{"id":106481,"no":30,"title":"Page 30","content":"From his vantage-place at the crest of the hill, Rajput Hasin Dahele stopped and pointed to the town below them; the streets were busy, the market crowded, and the fields beyond the walls were filled with activity. \"There. You see?\" The air around them smelled of green things and fertile fields as well as the richer, more pungent odor of the forest at their backs.\n \"I see,\" said Sanat Ji Mani, his head aching from the morning\u0027s exposure to the sun; the huge silken parasol provided some relief, but not enough to eliminate the discomfort of being in daylight without the protection of his native earth in the soles of his shoes. Beside him, the young officer assigned to hold the umbrella did his best to keep Sanat Ji Mani in shadow.\n \"How would you deploy your men to take the town with as few losses as possible?\" Hasin Dahele was enjoying himself hugely, thrilling to his panoply and all the accouterments of battle.\n \"I would set up my companies on the hills around the town and then send in an envoy to ask for surrender,\" said Sanat Ji Mani as quietly as he could, for the army was tremendously noisy. \"They know you are coming.\"\n \"All the more reason to attack,\" said Hasin Dahele. \"We will lose the element of surprise if we wait much longer.\"\n \"You do not need an element of surprise, which you have lost, in any case; they know you are here,\" Sanat Ji Mani said. \"It is a small town, the walls around it are wood, designed to keep animals out and livestock in, not to hold off armies. Your elephants would have it down in a single charge.\"\n \"Then let us charge,\" said the Rajput eagerly.\n \"Why bother? It is unnecessary,\" Sanat Ji Mani said, knowing his cautions were fruitless.\n \"Has exile taken all your spirit?\" the Rajput asked. \"Why should I hesitate to show my strength?\"\n \"Because those people are weak. Do your gods require you to punish the weak in order to deserve your favor?\" As he spoke, he wished he knew which of the myriad gods Hasin Dahele sought to honor, for there were many among them who were blood-thirsty.\n \"My men are avid for an opportunity to show their mettle,\" said Hasin Dahele with a hard look at Sanat Ji Mani. \"And my Gods do not expect me to falter.\"\n \"Then let them prove themselves on something more worthwhile than that town; find a city that is armed that will be a suitable offering to your gods, not this gathering of farmers and workmen,\" said Sanat Ji Mani. \"There is nothing to boast of in taking such a place. Fifty men on horseback with bows and lances could do it. You have five thousand soldiers at your back. That is many more than every man, woman, and child in that town.\"\n \"Just my point,\" said Hasin Dahele. \"We will have an easy victory and everyone in the towns and villages in this region will know that we must be reckoned with. Others will be glad to surrender to avoid the fate of this town. We show our might here and we will not have to battle again.\"\n Sanat Ji Mani stared at the Rajput, knowing it was an uncourteous thing to do. \"You asked my advice and I have given it to you. It may not be to your liking; you may take it or not as you see fit. This is your campaign.\"\n Hasin Dahele grinned. \"So it is.\" He signaled for his nearest aide. \"Tell my first two companies of archers to charge the fields and drive everyone back into the town; if they will not go, kill them. If there are any Untouchables, do not pollute yourselves with them. Capture what animals you can-except the cattle-and those you cannot, kill for our cooking pots.\" He turned to Sanat Ji Mani. \"You see, I will make the most of this opportunity.\"\n The pang that took hold of Sanat Ji Mani had little to do with the sun, or the lack of his native earth; he was sick at heart. \"You are not being prudent, and that will cost you in time to come,\" he warned the Rajput. \"This is not a crucial fight. You are risking your men unnecessarily and you are going to bring about needless destruction in a place that would serve you better as an ally than a foe.\"\n \"A town, so small-what kind of ally is a place like this? Better to subjugate the people, teach them to fear me, and let them serve as an example to the rest of the region.\" The Rajput lifted his hand and the first company of archers started down the hill, the men lifting their bows and notching arrows as they rode.\n \"The town holds the valley. You may have use of this valley, O Rajput,\" said Sanat Ji Mani, not wanting to watch what was happening.\n \"Why would I want so minor a place?\" the Rajput asked. \"It is a town of little worth or importance.\"\n \"If you ever have to retreat over this ground, the valley may be crucial to you and your army. It could be a haven.\" Sanat Ji Mani saw Hasin Dahele shake his head. \"I know you do not intend to retreat, but that may not be your decision to make.\"\n \"There is no army strong enough to drive my army back,\" said Hasin Dahele with such arrogant confidence that Sanat Ji Mani winced. \"The Gods are guiding me. No other Rajput has been favored by the Gods as I have.\"\n \"There is no army you know of, but that does not mean that another Rajput might not be planning exactly what you are attempting to do, and with a force stronger than the one you command, and believe that his gods favor him as yours favor you.\" It was a useless observation and Sanat Ji Mani knew it; he gestured to the valley. \"Leave them in peace and they will shelter you in your hour of need. Attack them and you will never be safe here again.\"\n \"How can you, of all men, say such things to me?\" The Rajput rose in his stirrups and gave a second signal that put his men into the charge. \"They will have this settled by evening, and then you and I may see what we have.\"\n \"I would rather remain outside the walls,\" said Sanat Ji Mani. \"There is more safety away from where the battle was fought than in its place.\" He pointedly turned away from the Rajput and the first skirmishes in the fields below.\n \"My spearmen,\" Hasin Dahele shouted. \"Follow the archers! First and fourth companies!\" He dropped his arm and gave a bellow of enthusiasm to send his men off. At once the spearmen set the horses plummeting down the hill; thundering down the slope, five horses missed their footing and fell in a thrashing tangle of legs that tripped another four before the spearmen could guide their mounts around the fallen.\n \"Are you going to send slaves to help them?\" Sanat Ji Mani asked as the horses neighed and men screamed in pain.\n \"I may, when all the spearmen have passed,\" said Hasin Dahele. He was breathing fast and his color was heightened with excitement; one of the horses collapsed and lay still. \"That one will have to be pulled off to the side.\"\n \"Have the tack removed. You cannot spare the saddle and bridle any more than you can spare the horse,\" said Sanat Ji Mani watching the rider stumble to his feet, clearly dazed; he took a step, screamed and fell. \"I fear the soldier has broken his leg.\"\n \"How can you be sure from this distance?\" Hasin Dahele demanded.\n \"I have seen men hurt in battle, and I know how they behave,\" Sanat Ji Mani answered, not quite daring to go down the hill himself to see how badly the man\u0027s leg was broken, not in the open sunlight with the Rajput watching him. \"If his leg is not set quickly, he will take a fever and he may die. You cannot want that to happen.\"\n \"He will have to wait until the village is in my hands,\" said Hasin Dahele, dismissing the whole matter with an impatient wave of his arm.\n \"You could stop the attack now, and demand a surrender. It would spare your soldiers more hurt. You will lose only those men injured when their horses fell,\" Sanat Ji Mani said, doubting that Hasin Dahele would listen to him.\n \"Why would I do that, when victory is so readily had?\" He was about to signal his other two companies of spearmen when he paused. \"Why do you not want me to fight for this valley?\"\n \"I have already told you: because it is unnecessary, and because it creates enemies. You will have enough of them without adding to their numbers.\" Sanat Ji Mani sighed. \"Also, you have just begun your campaign and this kind of battle is profligate: you will need your spears and arrows and men and horses later. Wasting them now on a needless assault is squandering, not strategic campaigning.\" He indicated the town. \"Those are not warriors, they are farmers and artisans. You have no reason to fight them.\"\n \"And yet you warned me against farriers, as subtle foes who could compromise an entire company of horsemen,\" the Rajput mused aloud. He signaled his spearmen. \"They need to be tested,\" he said as he gestured them into motion.\n The two companies pelted down the hill, taking care to dodge around the fallen men and horses, all of them raising their spears and shouting. They were an awesome sight, and the townspeople below were transfixed by the soldiers\u0027 terrifying onslaught. The first wave of archers were nearly to the town walls, the second line spreading out behind them to cross the fields to capture those working the crops. A wailing arose from the valley, the sound combining the cries of those attacked and the shouts of the soldiers.\n \"They are doing well,\" said the Rajput as he watched his soldiers\u0027 mounts turn the fields to mud and to chase down those farmers making for the town gates. \"I will have slaves from this.\"\n \"And you will have enemies,\" said Sanat Ji Mani.\n \"So long as they fear me, I do not mind enemies,\" the Rajput countered. \"You should understand how important fear is.\"\n \"No doubt,\" said Sanat Ji Mani, appalled by what he heard.\n \"My enemies will know not to expect mercy from me, and they will be wise.\" Hasin Dahele laid his hand on his sword. \"This is the beginning of my conquest of the world.\"\n Sanat Ji Mani stared down at the pandemonium of battle, and saw the first futile attempts at resistance; he glanced at the Rajput and read no horror in his handsome face, only glee and beneath that something more sinister-perhaps gloating-in the man\u0027s dark eyes; Hasin Dahele would not be stopped now, and Sanat Ji Mani recognized this with despair. His arm was aching and he saw that the shade from the umbrella had shifted. \"I am being burned,\" he said.\n \"Tend to your duty,\" the Rajput snapped at the aide holding the umbrella. \"This man is not to have sunlight fall on him. If you fail, you will be burned as you have allowed him to be. I will have your arm thrust in a fire.\"\n \"Do not do that,\" Sanat Ji Mani interceded. \"It is bad enough one of us be hurt-hurting him will not make me better.\"\n \"Are you asking for mercy for him\" Hasin Dahele laughed low in his throat. \"For a man who has let you suffer?\"\n \"Yes,\" said Sanat Ji Mani, \"as I would hope he would do for me.\"\n Hasin Dahele shrugged. \"I will forgive him-this time. For your sake.\"\n \"I am grateful,\" said Sanat Ji Mani, managing to keep the irony out of his voice. \"There will be agony enough for everyone before this campaign is done.\"\n \"Move back into the trees,\" Hasin Dahele ordered, without saying anything about Sanat Ji Mani\u0027s additional remark. \"I will summon you when the battle is done.\" Saying that, he spurred his dark-bay and went cantering down the line of mounted men still waiting to enter the fray.\n \"We had better do as he says,\" the aide recommended.\n Sanat Ji Mani gave a single nod. \"There is nothing to see here.\"\n The aide stared at Sanat Ji Mani, shocked. \"There is the battle.\"\n \"And all battles are confusion and anguish. I do not need to watch another to know that.\" He swung his horse around. \"I will sleep a while, for the night is going to be long, and the demands many.\"\n \"How can you be certain of that?\" the aide asked, bustling to keep the umbrella in position as he and Sanat Ji Mani made for the trees.\n \"It is always so after a battle. The wounded and the dying will need succor and the dead will have to be given the rites of death. Why should this battle be any different.\" Sanat Ji Mani stopped to look toward the soldiers waiting in the cover of the trees. Most of them were edgy, anticipating their entry into the fighting. \"What will become of them?\" He was not aware he had spoken aloud until the aide said, \"They will further the glory of the Rajput.\"\n Ahead of them, two elephants rigged out for war loomed out of the shelter of the trees, their mahouts straddling their necks, and behind the mahouts, howdahs with three archers in each. The big animals were restless, swaying as they stood, their trunks moving as if to begin their battle now. Slowly they ambled forward, each ponderous step guided by the mahouts as they began making their way toward the village. A dozen more elephants fell into line behind them.\n \"The villagers will tremble,\" said the aide with great satisfaction.\n Sanat Ji Mani shook his head. \"There is no need for such measures. The town will fall without using the elephants.\"\n \"But they will destroy the walls, and it will be told everywhere that the Rajput cannot be resisted,\" said the aide. \"That will serve Beragar well.\"\n \"It will also warn other rulers to increase their armies and strengthen their city walls, so the Rajput will not have a quick victory.\" Sanat Ji Mani almost smiled as he rode into the shadow of the trees; the shield they provided from the piercing rays of the sun was as welcome as nightfall. He drew in his horse, feeling a little strength returning to him. \"I will go to rest for the afternoon.\"\n \"There is no camp for you to-\" the aide began.\n \"I will find a sheltered place and that will suffice. If you will attend to my horse, I will thank you for your good service.\" He was already looking away from the reserve troops, trying to find a place where the leaves were the thickest and the shadows the most dense. \"If the Rajput has need of me, wake me. If not, let me sleep until I rouse myself.\"\n The aide bowed in the saddle. \"I will do as you wish, Illustrious Foreigner.\"\n Sanat Ji Mani found the title excessive but knew it would only trouble the aide if he did not accept it. \"You are very good,\" he said as he spotted a mound of vines and trees a short distance away. \"This will suit me very well.\"\n \"There may be snakes,\" warned the aide.\n \"I will be careful,\" Sanat Ji Mani assured him as he swung out of the saddle and handed the reins to the aide. \"Come for me at day\u0027s end and I will be ready for you.\"\n Reluctantly the aide took the reins and nudged his horse away from the thicket that Sanat Ji Mani was exploring. \"I will summon you if there is need.\"\n \"Very good,\" said Sanat Ji Mani, glad to be in a place that would protect him as much as anything other than his native earth could. He dropped to his knees and ducked into the heart of the vines and leaves, going cautiously in order not to disturb anything that might have taken shelter there. Finally he matted down a few small branches and lay back on them, his whole body aching for rest, his soul longing for sleep. For a long moment the image of Tulsi hung in his mind, and he yearned to speak to her, to know she was safe. He questioned himself again on his decision to travel with the Rajput, for he still was not certain she was not in danger on his account, and that troubled him; how was he to protect her while he was not with her? How could he defend her now that they were separated? What could he do to guard her? He tried, as he had tried for the five days the army had been on the march, to think of some means of securing her freedom and safety, but nothing occurred to him and he was left to fret over what he could not change. Then his enervation caught up with him; he closed his eyes and succumbed to the stupor that was the slumber of his kind.\n Shouts and drum-beats woke him as the sun dropped low in the west. Whoops and screams mixed on the air as the Rajput\u0027s army claimed the last remains of the town as their tattered prize; Sanat Ji Mani emerged, limping, from the thicket where he had rested to find the aide waiting for him, holding the reins of his horse and grinning eagerly. \"What is it?\" Sanat Ji Mani asked.\n \"They are branding the captives, so they will be known as slaves forever,\" said the aide. \"Many men were captured, and many women. Also children, some too young for branding.\"\n \"I am certain the Rajput is pleased,\" said Sanat Ji Mani, his body refreshed but his spirits wearier than before.\n \"The Rajput will take the slaves back to Devapur and decide which he will keep and which will be taken to the coast and sold to the Arabs.\" The aide grinned. \"This will be a most fortuitous expedition. The army has fought and there are slaves gained from it, and the rule of the land.\"\n \"A great achievement,\" said Sanat Ji Mani drily as he mounted the dun mare he had chosen from the Rajput\u0027s stables.\n \"You will see for yourself. The Rajput has ordered me to bring you to him.\" The aide nodded in the direction of the hill. \"We must make haste or the light will be gone.\"\n \"I am sure there is fire enough in the town to guide us,\" said Sanat Ji Mani, making no effort to disguise his distaste. He pulled the mare\u0027s head around and started toward the slope leading down to the village.\n \"The Rajput has had a feast prepared for his men. All the goats and all the sheep in the town have been slaughtered and set to cook over fires.\" The aide was full of anticipation.\n \"Have they.\" Sanat Ji Mani knew that this boded ill for the night. \"Have the soldiers been given anything other than water to drink?\"\n The aide laughed aloud. \"You are a most perspicacious fellow, foreigner. Yes, there was honey-beer found-barrels of it. The Rajput said it was to be given out to his men, first to those who fought, and then to the rest of his army.\" He put one hand to his chest. \"I am to have mine when I bring you to the town and present you to the Rajput.\"\n \"I am sure you are looking forward to it,\" said Sanat Ji Mani, his sincerity masking apprehension.\n \"Of course.\" The aide led Sanat Ji Mani to the broad swath of trampled vegetation when Hasin Dahele\u0027s army had descended the hill. \"We have lost thirteen men and nine horses. There are fifty-three wounded and injured that I know of, but there are probably a few more. The man you said had broken his leg is one of the worst hurt, although there is another man who was struck in the eye and one who fell into a fire, but most have nothing more than cuts and bruises,\" he babbled excitedly. \"There was a camp of Untouchables on the edge of the fields, and we drove them away.\"\n \"Untouchables,\" said Sanat Ji Mani, thinking of those unfortunate enough to be born into the under-caste, who were considered contaminated by the rest of the people; war would be hardest on them, who were already condemned.\n \"They will not be allowed to foul our victory,\" the aide boasted.\n \"How could they, indeed,\" Sanat Ji Mani said, drawing his horse in to look at the town: the order of the morning was gone and in its place was devastation, where the army was setting up a camp for the night as if to set the seal on what they had done; fields were uprooted and trampled, the walls of the town had been pushed down on the south-eastern side and the houses around that portion of wall were tumbled into heaps, two of them blackened where they had caught fire. At the center of the town, where the market had been, there was now a collection of tents, the Rajput\u0027s being the grandest. Huge cooking fires burned throughout the town, and soldiers were gathered around them. Outside the walls in a hastily improvised stockade the townspeople huddled together while a group of aides went among them, gathering information and recording what they learned on palm-leaves.\n \"Done in less than a day,\" said the aide proudly.\n \"The Rajput must be pleased,\" said Sanat Ji Mani, and put his mare in motion down the hill.\n \"The soldiers are saying that they will conquer all the way to the mountains at the Roof of the World,\" the aide went on. \"They say that this has shown them how mighty they are.\"\n \"To defeat a town of less than half their number is an accomplishment,\" said Sanat Ji Mani flatly.\n The aide mistook his intent. \"Oh, yes. We did not need more than a third of the army to do it. In time to come, more will fight, but for now, it is proof that the Gods are with Hasin Dahele. By the time the rains come, his rule will extend far and wide and his army will be feared from mountains of the Afghani to China, and south to the ends of our lands.\"\n Sanat Ji Mani cut into this rhapsodizing. \"The Rajput wants to exceed the conquests of Timur-i-he has said so. This is his beginning.\"\n \"Just so,\" said the aide, stopping his tongue at last.\n The sounds of celebration were drifting upward, filling the night. Around one of the huge spits men were dancing, singing a song in praise of Ganesh, Shiva, and Kali, while cooks cut off slabs of sheep and goat for them. Other fires had musicians gathered near them to play while the men ate and drank. The odor of sizzling meat was almost strong enough to conceal the metallic scent of blood and the stench of fear that lingered from the battle.\n The aide led the way to Hasin Dahele\u0027s tent, dismounted, and held the reins of Sanat Ji Mani\u0027s dun mare. \"He is waiting for you, the Rajput, and his poet.\" This last was an afterthought, and one with which the aide was not wholly comfortable.\n Sanat Ji Mani dismounted, alighting gingerly on his sore foot. \"You have done your duty.\" He bowed slightly to the aide, startling him, and then went into the Rajput\u0027s tent.\n \"Ah! There you are! At last!\" shouted Hasin Dahele as Sanat Ji Mani paused just inside the tent-flap; he was seated on a carved-and-inlaid chair of fine wood, flanked by braziers and protected by two Guards. His silken garments were torn and dirty and his hair was in disorder, but he beamed at Sanat Ji Mani. \"Come in!\"\n \"I hear you have sustained light losses,\" said Sanat Ji Mani without any formality.\n \"Light enough,\" said Hasin Dahele. He was drinking honey beer from a metal bowl. \"This is very good. I will have them bring you some.\"\n \"Thank you, no.\" Sanat Ji Mani noticed Vayu Ede sitting on a stool off to the side. \"How do you like the fruits of victory?\"\n \"I like them very well,\" said the Rajput, as if the question had been directed to him.\n \"And you, Vayu Ede?\" Sanat Ji Mani asked.\n \"It is the first step toward what the Gods have promised,\" he said, but in a subdued tone.\n \"Your gods offer strange gifts, do they not.\" Sanat Ji Mani came a few steps farther into the tent. \"This one was easy, O Rajput. Be content with it.\"\n \"I will, I will,\" said Hasin Dahele. \"For now. We will camp here tomorrow and the next day we will return to Devapur to show my people how we have succeeded. I will then prepare for a true campaign, and you will see that your woman has come to no harm.\" He wagged a finger at Sanat Ji Mani. \"I know you think of her. I want you to be satisfied that she will come to no harm in my palace.\" He chuckled. \"Then you can concentrate on advising me. And no more of this notion of accepting a surrender instead of showing force of arms.\"\n \"Why do you want my advice? you do not take it,\" said Sanat Ji Mani, hoping to be able to reach the Rajput while he was inclined to listen. \"Why not leave me in Devapur when you go on campaign again?\"\n Hasin Dahele laughed merrily. \"As if you do not know why.\" He sat back on his chair and grinned. \"You must see what I do to know I am worthy.\" He stopped smiling and shouted, \"Slave! Bring me meat and bread! I am hungry.\"\n Vayu Ede got up from his stool. \"You will be able to tell us how we have done,\" he said to Sanat Ji Mani. \"The Gods demand it.\"\n So it comes back to the gods, Sanat Ji Mani thought, and only said, \"I am a liability on campaign. I need to stay out of the sun, which is inconvenient.\"\n \"But you know war,\" said Hasin Dahele. \"You cannot deny it.\"\n \"Oh, yes,\" Sanat Ji Mani said bleakly. \"I know war.\"\n \"And you have led men in battle.\" He drank the last of his honey beer.\n \"Not recently,\" Sanat Ji Mani said, thinking back to his homeland when the Goths had come through on their way to Rome. That was the last time he had fought offensively, and it had left him filled with revulsion; Heliogabalus had ruled in Rome then, and had been incapable of mounting any defenses at the edge of the Empire, so it had fallen to the governors and garrisons to stem the tide: he had never again wanted to initiate a battle.\n \"But you know how, that is what matters,\" said Hasin Dahele, swinging around in his chair as two slaves came in bearing a brass platter piled high with goat and mutton, with half-a-dozen broiled fowl around the edges. A third slave followed with a large, flat basket felled with wide, soft breads shining with ghee. \"Set it down, set it down,\" he ordered, gesturing to a place on the floor of the tent. \"And bring cushions for me and my guests. And more honey beer.\" The slaves did as they were ordered, bowed and withdrew. \"You know, you were right, Sanat Ji Mani,\" he went on genially as he left his chair and sauntered toward the tray with its steaming bounty. \"You said I would need more slaves than I had planned to bring. You were right, and I was wise to listen to you. So you see, I do heed you.\"\n \"What can I be but honored?\" Sanat Ji Mani said, putting his hands together and bowing.\n \"And you will help me with what must be done to conquer, and not just in the matter of bringing slaves along-incidentally, we have a great many more to take back with us, and I suppose they will slow us down-but in everything having to do with war.\" The Rajput stood uneasily, waiting for someone to bring his cushions. \"How long must I wait?\" he asked testily as the time dragged on.\n One of the Guards set his lance aside and hurried to bring the cushions the Rajput had demanded. \"If these are insufficient, O Exalted One, you have only to ask for more.\" He put the cushions down next to the platter. \"I will try to discover where the honey beer is.\"\n \"Have some yourself,\" said Hasin Dahele magnanimously. \"It is very good.\"\n \"When you have eaten and dismissed me, I will,\" said the Guard with a quick but hungry glance at the piles of food.\n \"You are very loyal,\" said the Rajput, dropping to his knees on the cushion. \"He is loyal, do you not agree, Sanat Ji Mani?\"\n Knowing what the Rajput wanted to hear, Sanat Ji Mani said, \"He is.\"\n \"And you know the importance of loyalty, Sanat Ji Mani,\" said Hasin Dahele, and roared with more laughter as he beckoned to Vayu Ede to join him.\n Sanat Ji Mani remained where he stood, watching while the Rajput began to wolf down his food, using the bread to hold the meat. He was well-aware that Hasin Dahele was drunk, but whether on honey beer or triumph, Sanat Ji Mani could not tell.\n Text of a letter from the Chinese pilgrim and spy, Lum, to the prefecture of the armies, currently in Hsi-an.\n To the most honorable and esteemed Prefect of the Armies, admirable servant of the Wielder of the Vermillion Brush, this report from the city of Sindabur on the Arabian Sea, submitted most humbly to you for your assessment and evaluation.\n The disruption this traveler has seen during the past year continues, but not with the same chaotic energy as before. Many people are still displaced and even as far south as this person has come, there have been others fleeing from the ruins of Delhi and the continuing fighting between the two men claiming the title of Sultan of Delhi, one of whom serves Timur-i and one of whom is the bin Tughluq. This person has not yet discovered which of them is the most supported by the Rajputs, as the regional Princes are known. If there is support given to either claimant to the Sultan\u0027s title, the power may shift quickly and with dramatic results. This is a happenstance that this person cannot anticipate or predict, there being too many possibilities to know which is the most likely. Whatever the result may be, it is clear to this person that there will be more fighting; until someone can take and hold the Sultan\u0027s position, nothing will be settled. Had the Sultanate not been in decline before Timur-i came, the matter might have been more readily understood, but as there had been an erosion of the Sultanate for nearly fifty years, nothing could hold it together once Delhi was in ruins. Those regions that have broken away from the Sultanate may yet determine what becomes of Delhi and who rules there.\n Trade in these western ports does not seem much hampered by the troubles in Delhi, but it is apparent in the market-places that many goods are missing because of the on-going struggle, and that most trade has been disrupted, although the slave-trade is flourishing, so much so that the Arabs no longer bring Slavs to market, but buy the captives of the Sultans and the Rajputs to be sold in the markets to the west. In time this will change, but for a while, the slave-trade will go from east to west across the Arabian Sea.\n This person has seen many groups of people camping beyond the walls of towns and cities, scraping out a living from the menial work that is often left to those called Untouchables. In Delhi the Untouchables were not as apparent as the are here to the south, for apparently the Sultans did not require that all menial tasks-cleaning latrines, caring for the bodies of the dead-be done by these unfortunates. Here in the south, where the sway of the Sultans was less complete, the Untouchables continued in their appointed role. The people who have been shut out of their home cities and who have fled the on-going battles in the north are now little better than the Untouchables, except that they have some hope of improving their condition, which the Untouchables do not. This person knows that desperate persons do terrible things, and in a short time there may be uprisings among these homeless persons that will shake the fragile peace of the south.\n Pursuant to that, as this person indicated, there are many Rajputs who are struggling to turn the collapse of Dehli to their advantage, for many of them now seek to establish borders for their Principalities and a few are trying to expand their territories while in the process. Every minor Princeling has been stirred by the disruption in the land, and many of them are seeking opportunities to improve their presence in the world. As an example, the small Principality, Beragar, has laid claim to all the lands between the Godavari and the Narmanda Rivers in the west where they define the highlands against the Ghats. The Principality is small, but it is being said that the Rajput is ambitious and is attempting to claim a wider holding for himself while he has the opportunity. His is the Yadava region and as such, his people are diverse. He himself is said to be part of the traditional religion of the region, but to which of the many gods he is devoted, this person has not been able to discover. This person believes and reiterates that if the Rajput of Beragar has any success in his scheme more of the Rajputs will emulate him and there will be a number of small wars in the north and west of India, and that will bring about more disruption and confusion. If this upstart Rajput is unable to achieve his ends, then he may provide an example to others and lessen the upheavals that this person has observed in his travels.\n This person most meekly requests that his family remain ignorant of what has become of him and in what enterprise he is involved. There has been shame enough brought upon them on this unworthy person\u0027s behalf and it would only add to their distress to learn what this insignificant person has undertaken.\n With every assurance of this person\u0027s continuing dedication to the task with which he has been charged and with submission to the Will of the Vermillion Brush, at the Spring Feast of the Balance of Day and Night,\n Lum \n","sourceLink":"https://allnovel.net/a-feast-in-exile-saint-germain-14/page-30.html","bookId":2500,"book":{"id":2500,"title":"A Feast In Exile (Saint-Germain #14)","description":"Storyline: \n A Feast In Exile (Saint-Germain #14) \n A Feast in Exile draws readers back to the time when the Mongol hordes of Timur (known in the West as Tamerlane) swept across fourteenth-century India and Asia. Delhi\u0027s civilized veneer crumbles along with its walls. Foreigners, which the vampire Saint-Germain-here called Sanat Ji Mani-surely is, lose their positions, homes, wealth, and sometimes their lives, if they cannot escape the falling city. \n Before he can flee Delhi, Sanat Ji Mani must ensure the safety of Avasa Dani, his beautiful ward, who has been abandoned by her husband. Sanat Ji Mani\u0027s love has awakened Avasa Dani\u0027s every sense; even she will become a vampire upon her death, but she finds no terror in this fate. \n Avasa Dani and Rojire, Sanat Ji Mani\u0027s servant, successfully make their way out of Delhi, but Sanat Ji Mani himself is trapped. His life is bought by his skills with medicine, but, at Timur\u0027s command, he must travel-by day, and exposed to the sun-with the conqueror\u0027s army. Crippled and unable to escape, he knows that his vampire nature will soon be revealed, and then... \n Avasa Dani, with a worried Rojire at her side, considers her options as a woman without a visible male protector in a land and time ruled by men. While one of Sanat Ji Mani\u0027s allies searches desperately for the missing vampire, Saint-Germain and a young acrobat, with whom he has escaped from Timur\u0027s forces, make their slow and painful way to freedom. The journey changes them both forever.\n \n","cover":"https://allnovel.net/images/a-feast-in-exile-saint-germain-14.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-feast-in-exile-saint-germain-14.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:56:49 PM"}}
