{"id":70596,"no":23,"title":"Page 23","content":"11\\n\\n Barron Neville stared at her, quite speechless for a while. She looked calmly back at him. Her window panorama had been changed again. One of .them now showed the Earth, a little more than half full.\\n\\n Finally, he said, \"Why?\"\\n\\n She said, \"It was an accident, really, I saw the point and I was too enthusiastic not to speak. I should have told you days ago but I was afraid your reaction would be exactly what it is.\"\\n\\n \"So he knows. You fool!\"\\n\\n She frowned. \"What does he know? Only what he would have guessed sooner or later - that I\u0027m not really a tourist guide - that I\u0027m your Intuitionist. An Intuitionist who knows no mathematics, for heaven\u0027s sake. So what if he knows that? What does it matter if I have intuition? How many times have you told me that my intuition has no value till it is backed by mathematical rigor and experimental observation? How many times have you told me that the most compelling intuition could be wrong? Well, then, what value will he place on mere Intuitionism?\"\\n\\n Neville grew white, but Selene couldn\u0027t tell whether that was out of anger or apprehension. He said, \"You\u0027re different. Hasn\u0027t your intuition always proved right? When you were sure of it?\"\\n\\n \"Ah, but he doesn\u0027t know that, does he?\"\\n\\n \"He\u0027ll guess it. He\u0027ll see Gottstein.\"\\n\\n \"What will he tell Gottstein? He still has1 no idea of what we\u0027re really after.\"\\n\\n \"Doesn\u0027t he?\"\\n\\n \"No.\" She had stood up, walked away. Now she turned to him and shouted, \"No! It\u0027s cheap of you to imply that I would betray you and the rest. If you don\u0027t accept my integrity then accept my common sense. There\u0027s no point in telling them. What\u0027s the use of it to them, or to us, if we\u0027re all going to be destroyed?\"\\n\\n \"Oh, please, Selene!\" Neville waved his hand in disgust \"Not that.\"\\n\\n \"No. You listen. He talked to me and described his work. You hide me like a secret weapon. You tell me that I\u0027m more valuable than any instrument or any ordinary scientist. You play your games of conspiracy, insisting that everyone must continue to think me a tourist guide and nothing more so that my great talents will always be available to the Lunarites. To you. And what do you accomplish?\"\\n\\n \"We have you, haven\u0027t we? How long do you suppose you would have remained free, if they - \"\\n\\n \"You keep saying things nice that But who\u0027s been imprisoned? Who\u0027s been stopped? Where is the \"evidence of the great conspiracy you see all around you? The Earth-men keep you and your team from their large instruments much more because you goad them into it than out of any malice on their part. And that\u0027s done us good, rather than harm, since it\u0027s forced us to invent other instruments that are more subtle.\"\\n\\n \"Based on your theoretical insight, Selene.\"\\n\\n Selene smiled. \"I know. Ben was very complimentary about them.\"\\n\\n \"You and your Ben.\" What the hell do you want with that miserable Earthie?\"\\n\\n \"He\u0027s an Immigrant. And what I want is information. Do you give me any? You\u0027re so damned afraid 111 be caught, you don\u0027t dare let me be seen talking to any physicist; only you, and you\u0027re my - For that reason only, probably.\"\\n\\n \"Now, Selene.\" He tried to manage a soothing tone, but there was far too much impatience to it.\\n\\n \"No, I don\u0027t care about that really. You\u0027ve told me I have this one task and I\u0027ve tried to concentrate on it and sometimes I think I have it, mathematics or not. I can visualize it; the kind of thing that must be done - and then it slips away. But what\u0027s the use of it, when the Pump will destroy us all anyway . . . Haven\u0027t I told you I distrusted the exchange of field intensities?\"\\n\\n Neville said, \"I\u0027ll ask you again. Are you ready to tell me that the Pump will destroy us? Never mind might, never mind \u0027could\u0027; never mind anything but \u0027will.\u0027 \"\\n\\n Selene shook her head angrily. \"I can\u0027t. It\u0027s so marginal. I can\u0027t say it will. But isn\u0027t a simple \u0027might\u0027 sufficient in such a case?\"\\n\\n \"Oh, Lord.\"\\n\\n \"Don\u0027t turn up your eyes. Don\u0027t sneer! You\u0027ve never tested the matter. I told you how it might be tested.\"\\n\\n \"You were never this worried about it till you started listening to this Earthie of yours.\"\\n\\n \"He\u0027s an Immigrant. Aren\u0027t you going to test it?\"\\n\\n \"No! I told you your suggestions were impractical. You\u0027re not an experimentalist, and what looks good in your mind doesn\u0027t necessarily work in the real world of instruments, of randomness, and of uncertainty.\"\\n\\n \"The so-called real world of your laboratory.\" Her face was flushed and angry and she held her clenched fists at chin-level. \"You waste so much time trying to get a vacuum good enough - There\u0027s a vacuum up there, up there on the surface where I\u0027m pointing, with temperatures that, at times, are halfway down toward absolute zero. Why don\u0027t you try experiments on the surface?\"\\n\\n \"It would have been useless.\"\\n\\n \"How do you know? You just won\u0027t try. Ben Denison tried. He took the trouble to devise a system he could use on the surface and he set it up when he went to inspect the Solar batteries. He wanted you to come and you wouldn\u0027t. Do you remember? It was a very simple thing, something even I could describe to you now that it\u0027s been described to me. He ran it at day-temperatures and again at night-temperatures and that was enough to guide him to a new line of research with the Pionizer.\"\\n\\n \"How simple you make it sound.\"\\n\\n \"How simple it is. Once he found out I was an Intuitionist, he talked to me as you never did. He explained his reasons for thinking that the strengthening of the strong nuclear interaction is indeed accumulating catastrophically in the neighborhood of Earth. It will only be a few years before the Sun explodes and sends the strengthening, in ripples - \"\\n\\n \"No, no, no, no\" shouted Neville. \"I\u0027ve seen his results and I\u0027m not impressed.\"\\n\\n \"You\u0027ve seen them?\"\\n\\n \"Yes, of course. Do you suppose I let him work in our laboratories without making sure I know what he\u0027s doing? I\u0027ve seen his results and they\u0027re worth nothing. He deals with tiny deviations that are well within the experimental error. If he wants to believe that those deviations have significance and if you want to believe them, go ahead. But no amount of belief will make them have that significance if, in fact, they don\u0027t.\"\\n\\n \"What do you want to believe, Barron?\"\\n\\n \"I want the truth.\"\\n\\n \"But haven\u0027t you decided in advance what the truth must be by your own gospel? You want the Pump Station of the Moon, don\u0027t you, so that you need have nothing to do with the surface; and anything that might prevent that is not the truth - by definition.\"\\n\\n \"I won\u0027t argue with you. I want the Pump Station, and even more - I want the other. One\u0027s no good without the other. Are you sure you haven\u0027t - \"\\n\\n \"I haven\u0027t.\"\\n\\n \"Will you?\"\\n\\n Selene whirled on him again, her feet tapping rapidly on the ground in such a way as to keep her bobbing in the air to the tune of an angry clatter.\\n\\n \"I won\u0027t tell him anything,\" she said, \"but I must have more information. You have no information for me, but he may have; or he may get it with the experiments you won\u0027t do. I\u0027ve got to talk to him and find out what he is going to find out. If you get between him and me, you\u0027ll never have what you want. And you needn\u0027t fear his getting it before I do. He\u0027s too used to Earth thinking; he won\u0027t make that last step. I will.\"\\n\\n \"All right. And don\u0027t forget the difference between Earth and Moon, either. This is your world; you have no other. This man, Denison, this Ben, this Immigrant, having come from Earth to the Moon, can, if he chooses, return from Moon to Earth. You can never go to the Earth; never. You are a Lunarite forever.\"\\n\\n \"A Moon-maiden,\" said Selene, derisively.\\n\\n \"No maiden,\" said Neville. \"Though you may have to wait a long while before I confirm the matter once again.\"\\n\\n She seemed unmoved at that.\\n\\n He said, \"And about this big danger of explosion. If the risk involved in changing the basic constants of a Universe is so great, why haven\u0027t the para-men, who are so far advanced beyond us in technology, stopped Pumping?\"\\n\\n And he left.\\n\\n She faced the closed door with bunched jaw muscles. Then she said, \"Because conditions are different for them and for us, you incredible jerk.\" But she was speaking to herself; he was gone.\\n\\n She kicked the lever that let down her bed, threw herself into it and seethed. How much closer was she now to the real object for which Barren and those others had now been aiming for years?\\n\\n No closer.\\n\\n Energy! Everyone searched for energy! The magic word! The cornucopia! The one key to universal plenty! . . . And yet energy wasn\u0027t all.\\n\\n If one found energy, one could find the other, too. If one found the key to energy, the key to the other would be obvious. She knew the key to the other would be obvious if she could but grasp some subtle point that would appear obvious the moment it was grasped. (Good heavens, she had been so infected by Barren\u0027s chronic suspicion that even in her thoughts she was calling it \"the other.\")\\n\\n No Earthman would get that subtle point because no Earthman had reason to look for it.\\n\\n Ben Denison would find it for her, then, without finding it for himself.\\n\\n Except that - If the Universe was to be destroyed, what did anything matter?\\n\\n 12\\n\\n Denison tried to beat down his self-consciousness. Time and again, he made a groping motion as though to hitch upward the pants he wasn\u0027t wearing. He wore only sandals and the barest of briefs, which were uncomfortably tight And, of course, he carried the blanket\\n\\n Selene, who was similarly accoutered, laughed. \"Now, Ben, there\u0027s nothing wrong with your bare body, barring a certain flabbiness. It\u0027s perfectly in fashion here. In fact, take off your briefs if they\u0027re binding you.\"\\n\\n \"No!\" muttered Denison. He shifted the blanket so that it draped over his abdomen and she snatched it from him.\\n\\n She said, \"Now give me that thing. What kind of a Lunarite will you make if you bring your Earth puritanism here? You know that prudery is only the other side of prurience. The words are even on the same page in the dictionary.\"\\n\\n \"I have to get used to it, Selene.\"\\n\\n \"You might start by looking at me once in awhile, without having your glance slide off me as though I were coated with oil. You look at other women quite efficiently, I notice.\"\\n\\n \"If I look at you - \"\\n\\n \"Then you\u0027ll seem too interested and you\u0027ll be embarrassed. But if you look hard, you\u0027ll get used to it, and you\u0027ll stop noticing. Look, I\u0027ll stand still and you stare. Ill take off my briefs.\"\\n\\n Denison groaned, \"Selene, there are people all around and you\u0027re making intolerable fun of me. Please keep walking and let me get used to the situation.\"\\n\\n \"All right, but I hope you notice the people who pass us don\u0027t look at us.\"\\n\\n \"They don\u0027t look at you. They look at me all right. They\u0027ve probably never seen so old-looking and ill-shaped a person.\"\\n\\n \"They probably haven\u0027t,\" agreed Selene, cheerfully, \"but they\u0027ll just have to get used to it.\"\\n\\n Denison walked on in misery, conscious of every gray hair on his chest and of every quiver of his paunch. It was only when the passageway thinned out and the people passing them were fewer in number that he began to feel a certain relief.\\n\\n He looked about him curiously now, not as aware of Selene\u0027s conical breasts as he had been, nor of her smooth thighs. The corridor seemed endless.\\n\\n \"How far have we come?\" he asked.\\n\\n \"Are you tired?\" Selene was contrite. \"We could have taken a scooter. I forget you\u0027re from Earth.\"\\n\\n \"I should hope you do. Isn\u0027t that the ideal for an immigrant? I\u0027m not the least bit tired. Hardly the least bit tired at any rate. What I am is a little cold.\"\\n\\n \"Purely your imagination, Ben,\" said Selene, firmly. \"You just think you ought to feel cold because so much of you is bare. Put it out of your head.\"\\n\\n \"Easy to say,\" he sighed. \"I\u0027m walking well, I hope.\"\\n\\n \"Very well. I\u0027ll have you kangarooing yet.\"\\n\\n \"And participating in glider races down the surface slopes. Remember, I\u0027m moderately advanced in years. But really, how far have we come?\"\\n\\n \"Two miles, I should judge.\"\\n\\n \"Good Lord! How many miles of corridors are there altogether?\"\\n\\n \"I\u0027m afraid I don\u0027t know. The residential corridors make up comparatively little of the total. There are the mining corridors, the geological ones, the industrial, the mycological . . . I\u0027m sure there must be several hundred miles altogether.\"\\n\\n \"Do you have maps?\"\\n\\n \"Of course there are maps. We can\u0027t work blind.\"\\n\\n \"I mean you, personally.\"\\n\\n \"Well, no, not with me, but I don\u0027t need maps for this area; it\u0027s quite familiar to me. I used to wander about here as a child. These are old corridors. Most of the new corridors - and we average two or three miles of new corridors a year, I think - are in the north. I couldn\u0027t work my way through them, without a map, for untold sums. Maybe not even with a map.\"\\n\\n \"Where are we heading?\"\\n\\n \"I promised you an unusual sight - no, not me, so don\u0027t say it - and you\u0027ll have it. It\u0027s the Moon\u0027s most unusual mine and it\u0027s completely off the ordinary tourist trails.\"\\n\\n \"Don\u0027t tell me you\u0027ve got diamonds on the Moon?\"\\n\\n \"Better than that.\"\\n\\n The corridor walls were unfinished here - gray rock, dimly but adequately lit by patches of electroluminescence. The temperature was comfortable and at a steady mildness, with ventilation so gently effective there was no sensation of wind. It was hard to tell here that a couple of hundred feet above was a surface subjected to alternate frying and freezing as the Sun came and went on its grand biweekly swing from horizon to horizon and then underneath and back.\\n\\n \"Is all this airtight?\" asked Denison, suddenly uncomfortably aware that he was not far below the bottom of an ocean of vacuum that extended upward through all infinity.\\n\\n \"Oh, yes. Those walls are impervious. They\u0027re all booby-trapped, too. If the air pressure drops as much as ten per cent in any section of the corridors there is such a hooting and howling from sirens as you have never heard and such a flashing of arrows and blazing of signs directing you to safety as you have never seen.\"\\n\\n \"How often does this happen?\"\\n\\n \"Not often. I don\u0027t think anyone has been killed through air-lack for at least five years.\" Then, with sudden defensiveness, \"You have natural catastrophes on Earth. A big quake or a tidal wave can kill thousands.\"\\n\\n \"No argument, Selene.\" He threw up his hands. \"I surrender.\"\\n\\n \"All right,\" she said. \"I didn\u0027t mean to get excited. . . . Do you hear that?\"\\n\\n She stopped, in an attitude of listening.\\n\\n Denison listened, too, and shook his head. Suddenly, he looked around. \"It\u0027s so quiet. Where is everybody? Are you sure we\u0027re not lost?\"\\n\\n \"This isn\u0027t a natural cavern with unknown passageways. You have those on Earth, haven\u0027t you? I\u0027ve seen photographs.\"\\n\\n \"Yes, most of them are limestone caves, formed by water. That certainly can\u0027t be the case of the Moon, can it?\"\\n\\n \"So we can\u0027t be lost,\" said Selene, smiling. \"If we\u0027re alone, put it down to superstition.\"\\n\\n \"To what?\" Denison looked startled and his face creased in an expression of disbelief.\\n\\n \"Don\u0027t do that,\" she said. \"You get all lined. That\u0027s right. Smooth out. You look much better than you did when you first arrived, you know. That\u0027s low gravity and exercise.\"\\n\\n \"And trying to keep up with nude young ladies who have an uncommon amount of off-time and an uncommon lack of better things \"to do than to go on busmen\u0027s holidays.\"\\n\\n \"Now you\u0027re treating me like a tourist guide again, and I\u0027m not nude.\"\\n\\n \"At that, even nudity is less frightening than Intuitionism. . . . But what\u0027s this about superstition?\"\\n\\n \"Not really superstition, I suppose, but most of the people of the city tend to stay away from this part of the corridor-complex.\"\\n\\n \"But why?\"\\n\\n \"Because of what I\u0027m going to show you.\" They were walking again. \"Hear it now?\"\\n\\n She stopped and Denison listened anxiously. He said, \"You mean that small tapping sound? Tap - tap - Is that what you mean?\"\\n\\n She ran ahead in slow, loping strides with the slow-motion movement of the Lunarite in unhurried flight. He followed her, attempting to ape the gait.\\n\\n \"Here - here - \"\\n\\n Denison\u0027s eye followed Selene\u0027s eagerly pointing finger. \"Good Lord,\" he said. \"Where\u0027s it coming from?\"\\n\\n There was a drip of what was clearly water. A slow dripping, with each drip striking a small ceramic trough that led into the rock wall.\\n\\n \"From the rocks. We do have water on the Moon, you know. Most of it we can bake out of gypsum; enough for our purposes, since we conserve it pretty well.\"\\n\\n \"I know. I know. I\u0027ve never yet been able to manage one complete shower. How you people manage to stay clean I don\u0027t know.\"\\n\\n \"I told you. First, wet yourself. Then turn off the water and smear just a little detergent on you. You rub it - Oh, Ben, I\u0027m not going through it yet again. And there\u0027s nothing on the Moon to get you all that dirty anyway . . . But that\u0027s not what we\u0027re talking about. In one or two places there are actually water deposits, usually as ice near the surface in a mountain shadow. If we locate it, it drips out. This one has been dripping since the corridor was first driven through, and that was eight years ago.\"\\n\\n \"But why the superstition?\"\\n\\n \"Well, obviously, water is the great material resource on which the Moon depends. We drink it, wash with it, grow our food with it, make our oxygen with it, keep everything going with it. Free water can\u0027t help but get a lot of respect. Once this drip was discovered, plans to extend the tunnels in this direction were abandoned till it stopped. The corridor walls were even left unfinished.\"\\n\\n \"That sounds like superstition right there.\"\\n\\n \"Well - a kind of awe, maybe. It wasn\u0027t expected to last for more than a few months; such drips never do. Well, after this one had passed its first anniversary, it began to seem eternal. In fact, that\u0027s what it\u0027s called: \u0027The Eternal.\u0027 You\u0027ll even find it marked that way on the maps. Naturally people have come to attach importance to it; a feeling that if it stops it will mean some sort of bad fortune.\"\\n\\n Denison laughed.\\n\\n Selene said, warmly, \"No one really believes it, but everyone part-believes it. You see, it\u0027s not really eternal and it must stop some time. As a matter of fact, the rate of drip is only about a third of what it was when it was first discovered, so that it is slowly drying. I imagine people feel that if it happened to stop when they were actually here, they would share in the bad fortune. At least, that\u0027s the rational way of explaining their reluctance to come here.\"\\n\\n \"I take it that you don\u0027t believe this.\"\\n\\n \"Whether I believe it or not isn\u0027t the point. You see I\u0027m quite certain that it won\u0027t stop sharply enough for anyone to be able to take the blame. It will just drip slower and slower and slower and no one will ever be able to pinpoint the exact time when it stopped. So why worry?\"\\n\\n \"I agree with you.\"\\n\\n \"I do, however,\" she said, making the transition smoothly, \"have other worries, and I\u0027d like to discuss them with you while we\u0027re alone.\" She spread out the blanket and sat on it, cross-legged.\\n\\n \"Which is why you really brought me here?\" He dropped to hip and elbow, facing her.\\n\\n She said, \"See, you can look at me easily now. You\u0027re getting used to me. . . . And, really, there were surely times on Earth when near nudity wasn\u0027t something to be exclaimed over.\"\\n\\n \"Times and places,\" agreed Denison, \"but not since the passing of the Crisis. In my lifetime - \"\\n\\n \"Well, on the Moon, do as the Lunarites do is a good enough guide for behavior.\"\\n\\n \"Are you going to tell me why you really brought me here? Or shall I suspect you of planning seduction?\"\\n\\n \"I could carry through seduction quite comfortably at home, thank you. This is different The surface would have been best, but getting ready to go out on the surface would have attracted a great deal of attention. Coming here didn\u0027t, and this place is the only spot in town where we can be reasonably safe from interruption.\" She hesitated.\\n\\n \"Well?\" said Denison.\\n\\n \"Barren is angry. Very angry, in fact.\"\\n\\n \"I\u0027m not surprised. I warned you he would be if you told him that I knew you were an Intuitionist. Why did you feel it so necessary to tell him?\"\\n\\n \"Because it is difficult to keep things for long from my - companion. Probably, though, he doesn\u0027t consider me that any longer.\"\\n\\n \"I\u0027m sorry.\"\\n\\n \"Oh, it was turning sour anyway. It\u0027s lasted long enough. What bothers me more - much more - is that he violently refuses to accept your interpretation of the Pionizer experiments you ran after the surface observations.\"\\n\\n \"I told you the way it would be.\"\\n\\n \"He said he had seen your results,\"\\n\\n \"He glanced at them and grunted.\"\\n\\n \"It\u0027s rather disillusioning. Does everyone just believe what he wants to?\"\\n\\n \"As long as possible. Sometimes longer.\"\\n\\n \"What about you?\"\\n\\n \"You mean, am I human? Certainly. I don\u0027t believe I\u0027m really old. I believe I\u0027m quite attractive. I believe you seek out. my company because you think I\u0027m charming - even when you insist on turning the conversation to physics.\"\\n\\n \"No! I mean it!\"\\n\\n \"Well, I suspect Neville told you that the data I had gathered were not significant beyond the margin of error, which makes them doubtful, and that\u0027s true enough . . . And yet I prefer to believe they have the meaning I expected them to have to begin with.\"\\n\\n \"Just because you want to believe that?\"\\n\\n \"Not just because. Look at it this way. Suppose there is no harm in the Pump, but that I insist on thinking there is harm. In that case, I will turn out to be a fool and my scientific reputation will be badly damaged. But I am a fool in the eyes of the people who count, and I have no scientific reputation.\"\\n\\n \"Why is that, Ben? You\u0027ve hinted around the tale several times. Can\u0027t you tell me the whole story?\"\\n\\n \"You\u0027d be surprised how little there is to tell. At the age of twenty-five I was still such a child that I had to amuse myself by insulting a fool for no reason other than that he was a fool. Since his folly was not his fault, I was the greater fool to do it. My insult drove him to heights he couldn\u0027t possibly have scaled otherwise - \"\\n\\n \"You\u0027re talking of Hallam?\"\\n\\n \"Yes, of course. And as he rose, I fell. And eventually, it dropped me to - the Moon.\"\\n\\n \"Is that so bad?\"\\n\\n \"No, I rather think it\u0027s good. So let\u0027s say he did me a favor, long-way round . . . And let\u0027s get back to what I\u0027m talking about. I\u0027vejust explained that if I believe the Pump to be harmful and am wrong, I lose nothing. On the other hand, if I believe the Pump to be harmless and am wrong, I will be helping to destroy the world. To be sure, I\u0027ve lived most of my life already and I suppose I can argue myself into believing that I have no great cause to love humanity. However, only a few people have hurt me, and if I hurt everyone in return that is unconscionable usury.\\n\\n \"Then, too, if you\u0027d rather have a less noble reason, Selene, consider my daughter. Just before I left for the Moon, she had \u0027applied for permission to have a child. She\u0027ll probably get it and before long I\u0027ll be - if you don\u0027t mind my saying so - a grandfather. Somehow I\u0027d like to see my grandchild have a normal life expectancy. So I prefer to believe the Pump is dangerous and to act on that belief.\"\\n\\n Selene said, intensely, \"But here\u0027s\u0027 my point. Is the Pump dangerous or is it not? I mean, the truth, and not what anyone wants to believe.\"\\n\\n \"I should ask you that. You\u0027re the Intuitionist What does your intuition say?\"\\n\\n \"But that\u0027s what bothers me, Ben. I can\u0027t make it really certain either way. I tend to feel the Pump is harmful, but maybe that\u0027s because I want to believe that.\"\\n\\n \"All right. Maybe you do. Why?\"\\n\\n Selene smiled ruefully and shrugged her shoulders. \"It would be fun for Barron to be wrong. When he thinks he\u0027s certain, he\u0027s so vituperatively certain.\"\\n\\n \"I know. You want to see his face when he\u0027s forced to back down. I\u0027m well aware of how intense such a desire can be. For instance, if the Pump were dangerous and I could prove it, I might conceivably be hailed as the savior of humanity, and yet I swear that I\u0027d be more interested in the look on Hallam\u0027s face. I\u0027m not proud of that feeling so I suspect that what I\u0027ll do is insist on an equal share of the credit with Lamont, who deserves it after all, and confine my pleasure to watching Lamont\u0027s face when he watches Hallam\u0027s face. The pettishness will then be one place removed. . . . But I\u0027m beginning to speak nonsense. . . . Selene?\"\\n\\n \"Yes, Ben?\"\\n\\n \"When did you find out you were an Intuitionist?\"\\n\\n \"I don\u0027t quite know.\"\\n\\n \"You took physics in college, I imagine.\"\\n\\n \"Oh, yes. Some math, too, but I was never good at that Come to think of it, I wasn\u0027t particularly good in physics, either. I used to guess the answers when I was desperate; you know, guess what I was supposed to do to get the right answers. Very often, it worked and then I would be asked to explain why I had done what I did and I couldn\u0027t do that very well. They suspected me of cheating but could never prove it\"\\n\\n \"They didn\u0027t suspect Intuitionism?\"\\n\\n \"I don\u0027t think so. But then, I didn\u0027t either. Until - well, one of my first sex-mates was a physicist. In fact, he was the father of my child, assuming he really supplied the sperm-sample. He had a physics problem and he told me about it when we were lying in bed afterward, just to have something to talk about, I suppose. And I said, \u0027You know what it sounds like to me?\u0027 and told him. He tried it just for the fun of it, he said, and it worked. In fact, that was the first step to the Pionizer, which you said was much better than the proton synchrotron.\"\\n\\n \"You mean that was your idea?\" Denison put his finger under the dripping water and paused as he was about to put it in his mouth. \"Is this water safe?\"\\n\\n \"It\u0027s perfectly sterile,\" said Selene, \"and it goes into the general reservoir for treatment. It\u0027s saturated with sulfates, carbonates, and a few other items, however. You won\u0027t like the taste.\"\\n\\n Denison rubbed his finger on his briefs. \"You invented the Pionizer?\" \\n\\n","sourceLink":"https://allnovel.net/the-gods-themselves/page-23.html","bookId":1744,"book":{"id":1744,"title":"The Gods Themselves","description":"Storyline: Only a few know the terrifying truth--an outcast Earth scientist, a rebellious alien inhabitant of a dying planet, a lunar-born human intuitionist who senses the imminent annihilation of the Sun. They know the truth--but who will listen? They have foreseen the cost of abundant energy--but who will believe? These few beings, human and alien, hold the key to the Earth\u0027s survival.\\n","cover":"https://allnovel.net/images/the-gods-themselves.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-gods-themselves.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:17:03 AM"}}
