{"id":70598,"no":25,"title":"Page 25","content":"\"You are not disheartened by the failures of the experiment.\"\\n\\n \"They are not entirely failures,\" she said. \"They are less a failure than Dr. Denison thinks at present.\"\\n\\n \"What?\" Denison turned sharply on his heel, nearly overbalancing himself and sending out a spurt of dust.\\n\\n All three were facing the Pionizer now, and above it, just about five feet above it, light shone like a fat star, Selene said, \"I raised the intensity of the magnetic field, and the nuclear field remained stable in being - then eased further and further and - \"\\n\\n \"Leaked!\" Denison said. \"Damn it. I didn\u0027t see it happen.\"\\n\\n Selene said, \"I\u0027m sorry, Ben. First you were lost in your own thoughts, then the Commissioner arrived, and I couldn\u0027t resist the chance of trying on my own.\"\\n\\n Gottstein said, \"But just what is it that I see there?\"\\n\\n Denison said, \"Energy being spontaneously given off by matter leaking from another Universe into ours.\"\\n\\n And even as he said that the light blinked out and many yards away, a farther, dimmer star came into simultaneous being.\\n\\n Denison lunged toward the Pionizer, but Selene, all Lunar grace, propelled herself across the surface more efficiently and was there first. She killed the field structure and the distant star went out.\\n\\n She said, \"The leak-point isn\u0027t stable, you see.\"\\n\\n \"Not on a small scale,\" said Denison, \"but considering that a shift of a light-year is as theoretically possible as a shift of a hundred yards, one of a hundred yards only is miraculous stability.\"\\n\\n \"Not miraculous enough,\" said Selene, flatly.\\n\\n Gottstein interrupted. \"Let me guess what you\u0027re talking about You mean that the matter can leak through here, or there, or anywhere in our Universe - at random.\"\\n\\n \"Not quite at random, Commissioner,\" said Denison. \"The probability of leakage drops with distance from the Pionizer, and rather sharply I should say. The sharpness depends on a variety of factors and I think we\u0027ve tightened the situation remarkably. Even so, a flip of a few hundred yards is quite probable and, as a matter of fact, you saw it happen.\"\\n\\n \"And it might have shifted to somewhere within the city or within our own helmets, perhaps.\"\\n\\n Denison said, impatiently, \"No, no. The leak, at least by the techniques we use, is heavily dependent on the density of matter already present in this Universe. The chances are virtually nil that the leak-position would shift from a place of essential vacuum to one where an atmosphere even a hundredth as dense as that within the city or within our helmets would exist. It would be impractical to expect to arrange the leak anywhere but into a vacuum in the first place, which is why we had to make the attempt up here on the surface.\"\\n\\n \"Then this is not like the Electron Pump?\"\\n\\n \"Not at all,\" said Denison. \"In the Electron Pump there is a two-way transfer of matter, here a one-way leak. Nor are the Universes involved the same.\"\\n\\n Gottstein said, \"I wonder if you would have dinner with me this evening, Dr. Denison?\"\\n\\n Denison hesitated. \"Myself only?\"\\n\\n Gottstein attempted a bow in the direction of Selene but could accomplish only a grotesque parody of it in his spacesuit. \"I would be charmed to have Miss Lindstrom\u0027s company on another occasion, but on this one I must speak with you alone, Dr. Denison.\"\\n\\n \"Oh, go ahead,\" said Selene, crisply, as Denison still hesitated. \"I have a heavy schedule tomorrow anyway and you\u0027ll need time to worry about the leak-point instability.\"\\n\\n Denison said, uncertainly, \"Well, then - Selene, will you let me know when your next free day is?\"\\n\\n \"I always do, don\u0027t I? And we\u0027ll be in touch before then anyway. . . . Why don\u0027t you two go on? I\u0027ll take care of the equipment.\"\\n\\n 15\\n\\n Barren Neville shifted from foot to foot in the fashion made necessary by the restricted quarters and by the Moon\u0027s gravity. In a larger room under a world\u0027s stronger pull, he would have walked hastily up and back. Here, he tilted from side to side, in a repetitive back-and-forth glide.\\n\\n \"Then you\u0027re positive it works. Right, Selene? You\u0027re positive?\"\\n\\n \"I\u0027m positive,\" said Selene. \"I\u0027ve told you five times by actual count.\"\\n\\n Neville didn\u0027t seem to be listening. He said in a low, rapid voice, \"It doesn\u0027t matter that Gottstein was there, then? He didn\u0027t try to stop the experiment?\"\\n\\n \"No. Of course not.\"\\n\\n \"There was no indication that he would try to exert authority - \"\\n\\n \"Now, Barron, what kind of authority could he exert? Will Earth send a police force? Besides - oh, you know they can\u0027t stop us.\"\\n\\n Neville stopped moving, stood motionless for a while. \"They don\u0027t know? They still don\u0027t know?\"\\n\\n \"Of course they don\u0027t. Ben was looking at the stars and then Gottstein came. So I tried for the field-leak, got it, and I had already gotten the other. Ben\u0027s setup - \"\\n\\n \"Don\u0027t call it his setup. It was your idea, wasn\u0027t it?\"\\n\\n Selene shook her head. \"I made vague suggestions. The details were Ben\u0027s.\"\\n\\n \u0027 \"But you can reproduce it now. For Luna\u0027s sake, we don\u0027t have to go to the Earthie for it, do we?\"\\n\\n \"I think I can reproduce enough of it now so that our people can fill it in.\"\\n\\n \"All right, then. Let\u0027s get started.\"\\n\\n \"Not yet. Oh, damn it, Barron, not yet\"\\n\\n \"Why not yet?\"\\n\\n \"We need the energy, too.\"\\n\\n \"But we have that.\"\\n\\n \"Not quite. The leak-point is unstable; pretty badly unstable.\"\\n\\n \"But that can be fixed up. You said so.\"\\n\\n \"I said I thought it could.\"\\n\\n \"That\u0027s good enough for me.\"\\n\\n \"Just the same, it would be better to have Ben work out the details and stabilize it.\"\\n\\n There was a silence between them. Neville\u0027s\u0027 thin face slowly twisted into something approaching hostility. \"You don\u0027t think I can do it? Is that it?\"\\n\\n Selene said, \"Will you come out on the surface with me and work on it?\"\\n\\n There was another silence. Neville said, unsteadily, \"I don\u0027t appreciate your sarcasm. And I don\u0027t want to have to wait long.\"\\n\\n \"I can\u0027t command the laws of nature. But I think it won\u0027t be long . . . Now if you don\u0027t mind, I need my sleep. I\u0027ve got my tourists tomorrow.\"\\n\\n For a moment, Neville seemed on the point of gesturing to his own bed-alcove as though offering hospitality, but the gesture, if that was what it was, did not really come to birth and Selene made no sign of understanding or even anticipating. She nodded wearily, and left.\\n\\n 16\\n\\n \"I had hoped, to be frank,\" said Gottstein, smiling over what passed for dessert - a sticky, sweet concoction - \"that we would have seen each other more often.\"\\n\\n Denison said, \"It is kind of you to take such an interest in my work. If the leak-instability can be corrected, I think my achievement - and that of Miss Lindstrom - will have been a most significant one.\"\\n\\n \"You speak carefully, like a scientist. . . . I won\u0027t insult you by offering the Lunar equivalent of a liqueur; that is the one approximation to Earth\u0027s cuisine I have simply made up my mind not to tolerate. Can you tell me, in lay language, what makes the achievement significant?\"\\n\\n \"I can try,\" said Denison, cautiously. \"Suppose we start with the para-Universe. It has a more intense strong nuclear interaction than our Universe has so that relatively small masses of protons in the para-Universe can undergo the fusion reaction capable of supporting a star. Masses equivalent to our stars would explode violently in the para-Universe which has many more, but much smaller, stars than ours does.\\n\\n \"Suppose, now, that we had a much less Intense strong nuclear interaction than that which prevails in our Universe. In that case, huge masses of protons would have so little tendency to fuse that a very large mass of hydrogen would be needed to support a star. Such an anti-para-Universe - one that was the opposite of the para-Universe, in other words - would consist of considerably fewer but of far larger stars than our Universe does. In fact, if the strong nuclear interaction were made sufficiently weak, a Universe would exist which consisted of a single star containing all the mass in that Universe. It would be a very dense star, but relatively non-reactive and giving off no more radiation than our single Sun does, perhaps.\"\\n\\n Gottstein said, \"Am I wrong, or isn\u0027t that the situation that prevailed in our own Universe before the time of the big bang - one vast body containing all the universal mass.\"\\n\\n \"Yes,\" said Denison, \"as a matter of fact, the anti-para-Universe I am picturing consists of what some call a cosmic egg; or \u0027cosmeg\u0027 for short. A cosmeg-Universe is what we need if we are to probe for one-way leakage. The para-Universe we are now using with its tiny stars is virtually empty space. You can probe and probe and touch nothing.\"\\n\\n \"The para-men reached us, however.\"\\n\\n \"Yes, possibly by following magnetic fields. There is some reason to think that there are no planetary magnetic fields of significance in the para-Universe, which deprives us of the advantage they have. Onthe other hand, if we probe the cosmeg-Universe, we cannot fail. The cosmeg is, itself, the entire Universe, and wherever we probe we strike matter.\"\\n\\n \"But how do you probe for it?\"\\n\\n Denison hesitated. \"That is the part I find difficult to explain. Pions are the mediating particles of the strong nuclear interaction. The intensity of the interaction depends on the mass of the pions and that mass can, under certain specialized conditions, be altered. The Lunar physicists have developed an instrument they call the Pionizer, which can be made to do just such a thing. Once the pion\u0027s mass is decreased, or increased for that matter, it is, effectively, part of another Universe; it becomes a gateway, a crossing point. If it is decreased sufficiently, it can be made part of a cosmeg-Universe and that\u0027s what we want.\"\\n\\n Gottstein said, \"And you can suck in matter from the - the - cosmeg-Universe?\"\\n\\n \"That part is easy. Once the gateway forms, the influx is spontaneous. The matter enters with its own laws and is stable when it arrives. Gradually the laws .of our own Universe soak in, the strong interaction grows stronger, and the matter fuses and begins to give off enormous energy.\"\\n\\n \"But if it is super-dense, why doesn\u0027t it just expand in a puff of smoke?\"\\n\\n \"That, too, would yield energy, but that depends on the electromagnetic field and in this particular case the strong interaction takes precedence, because we control the electromagnetic field. It would take quite a time to explain that.\"\\n\\n \"Well, then, the globe of light that I saw on the surface was cosmeg material fusing?\"\\n\\n \"Yes, Commissioner.\"\\n\\n \"And that energy can be harnessed for useful purposes?\"\\n\\n \"Certainly. And in any quantity. What you saw was the arrival in our Universe of micromicrogram masses of cosmeg. There\u0027s nothing, in theory, to prevent our bringing it over in ton-lots.\"\\n\\n \"Well, then, this can be used to replace the Electron Pump.\"\\n\\n Denison shook his head. \"No. The use of cosmeg energy also alters the properties of the Universes in question. The strong interaction gradually grows more intense in the cosmeg-Universe and less intense in ours as the laws of nature cross over. That means that the cosmeg slowly undergoes fusion at a greater rate and gradually warms up. Eventually - \"\\n\\n \"Eventually,\" sad Gottstein, crossing his arms across his chest and narrowing his eyes, thoughtfully, \"it explodes in a big bang.\"\\n\\n \"That\u0027s my feeling.\"\\n\\n \"Do you suppose that\u0027s what happened to our own Universe ten billion years ago?\"\\n\\n \"Perhaps. Cosmogonists have wondered why the original cosmic egg exploded at some one point in time and not at another. One solution was to imagine an oscillating Universe in which the cosmic egg was formed and then at once exploded. The oscillating Universe has been eliminated as a possibility and the conclusion is that the cosmic egg had to exist for some long period of time and then went through a crisis\u0027 of instability which arose for some unknown reason.\"\\n\\n \"But which may have been the result of the tapping of its energy across the Universes.\"\\n\\n \"Possibly, but not necessarily by some intelligence. Perhaps there are occasional spontaneous leaks.\"\\n\\n \"And when the big bang takes place,\" said Gottstein, \"can we still extract energy from the cosmeg-Universe?\"\\n\\n \"I\u0027m not sure, but surely that is not an immediate worry. The leakage of our strong-interaction field into the cosmeg-Universe must very likely continue for millions of years before pushing it past the critical point. And there must be other cosmeg-Universes; an infinite number, perhaps.\\n\\n \"What about the change in our own Universe?\"\\n\\n \"The strong interaction weakens. Slowly, very slowly, our Sun cools off.\"\\n\\n \"Can we use cosmeg energy to make up for that?\"\\n\\n \"That would not be necessary, Commissioner,\" said Denison, earnestly. \"While the strong interaction here in our Universe weakens as a result of the cosmeg pump, it strengthens through the action of the ordinary Electron Pump. If we adjust the energy productions of the two then, though the laws of nature change in the cosmeg-Universe and in the para-Universe, they do not change in ours. We are a highway but not the terminus in either direction.\\n\\n \"Nor need we be disturbed on behalf of the terminuses\u0027. The para-men on their side may have adjusted themselves to the cooling off of their Sun which may be pretty cool to begin with. As for the cosmeg-Universe, there is no reason to suspect life can exist there. Indeed, it is by inducing the conditions required for the big bang that we may be setting up a new land of Universe that will eventually grow hospitable to life.\"\\n\\n For a while, Gottstein said nothing. His plump face, in repose, seemed emotionless. He nodded to himself as though following the line of his own thoughts.\\n\\n Finally, he said, \"You know, Denison, I think this is what will set the world on its ear. Any difficulty in persuading the scientific leadership that the Electron Pump is destroying the world should now disappear.\"\\n\\n Denison said, \"The emotional reluctance to accept that no longer exists. It will be possible to present the problem and the solution at the same time.\"\\n\\n \"When would you be willing to prepare a paper to this effect if I guarantee speedy publication?\"\\n\\n \"Can you guarantee that?\"\\n\\n \"In a government-published pamphlet, if no other way.\"\\n\\n \"I would prefer to try to neutralize the leak-instability before reporting.\"\\n\\n \"Of course.\"\\n\\n \"And I think it would be wise,\" said Denison, \"to arrange to have Dr. Peter Lamont as co-author. He can make the mathematics rigorous; something I cannot do. Besides, it was through his work that I took the course I have followed. One more point, Commissioner - \"\\n\\n \"Yes.\"\\n\\n \"I would suggest that the Lunar physicists be involved. One of their number, Dr. Barren Neville, might well be a third author.\"\\n\\n \"But why? Aren\u0027t you introducing unnecessary complications now?\"\\n\\n \"It was their Pionizer that made everything possible.\"\\n\\n \"There can be appropriate mention of that . . . But did Dr. Barren actually work on the project with you?\"\\n\\n \"Not directly.\"\\n\\n \"Then why involve him?\"\\n\\n Denison looked down and brushed his hand thoughtfully over the weave of his pants leg. He said, \"It would be the diplomatic thing to do. We would need to set up the cosmeg pump on the Moon.\"\\n\\n \"Why not on Earth?\"\\n\\n \"In the first place, we need a vacuum. This is a one-way transfer and not a two-way as in the case of the Electron Pump, and the conditions necessary to make it practical are different in the two cases. The surface of the Moon has its vacuum ready-made in vast quantities; while to prepare one on Earth would involve an enormous effort.\"\\n\\n \"Yet it could be done, couldn\u0027t it?\"\\n\\n \"Secondly,\" said Denison, \"if we have two vast energy sources from opposite directions with our own Universe between, there would be something like a short circuit if the two outlets were too close together. Separation by a quarter-million miles of vacuum, with the Electron Pump operating only on Earth and the cosmeg pump operating only on the Moon, would be ideal - in fact, necessary. And if we are to operate on the Moon, it would be wise, even decent, to take the sensibilities of the Lunar physicists into account. We ought to give them a share.\"\\n\\n Gottstein smiled. \"Is this the advice of Miss Lindstrom?\"\\n\\n \"I\u0027m sure it would be, but the suggestion is reasonable enough to have occurred to me independently.\"\\n\\n Gottstein rose, stretched, and then jumped in place two or three times in the eerily slow fashion imposed by Lunar gravity. He flexed his knees each time. He sat down again and said, \"Ever try that, Dr. Denison?\"\\n\\n Denison shook his head.\\n\\n \"It\u0027s supposed to help the circulation in the lower extremities. I do it whenever I feel my legs may be going to sleep. I\u0027ll be heading back for a short visit to Earth before long and I\u0027m trying to keep from getting too used to Lunar gravity. . . . Shall we talk of Miss Lindstrom, Dr. Denison?\"\\n\\n Denison said in a quite changed tone, \"What about her?\"\\n\\n \"She is a tourist guide.\"\\n\\n \"Yes. You said so earlier.\"\\n\\n \"As I also said, she is an odd assistant for a physicist.\"\\n\\n \"Actually, I\u0027m an amateur physicist only, and I suppose she is an amateur assistant\"\\n\\n Gottstein was no longer smiling. \"Don\u0027t play games, Doctor. I have taken the trouble to find out what I can about her. Her record is quite revealing, or would have been if it had occurred to anyone to look at it before this. I believe she is an Intuitionist\"\\n\\n Denison said, \"Many of us are. I have no doubt you are an Intuitionist yourself, after a fashion. I certainly know that I am, after a fashion.\"\\n\\n \"There is a difference, Doctor. You are an accomplished scientist and I, I hope, am an accomplished administrator . . . Yet while Miss Lindstrom is enough of an Intuitionist to be useful to you in advanced theoretical physics, she is, in actual fact, a tourist guide.\"\\n\\n Denison hesitated. \"She has little formal training, Commissioner. Her Intuitionism is at an unusually high level but it is under little conscious control.\"\\n\\n \"Is she the result of the one-time genetic engineering program?\"\u0027\\n\\n \"I don\u0027t know. I wouldn\u0027t be surprised if that were so, however.\"\\n\\n \"Do you trust her?\"\\n\\n \"In what way? She has helped me.\"\\n\\n \"Do you know that she is the wife of Dr. Barron Neville?\"\\n\\n \"There is an emotional connection; not a legal one, I believe.\"\\n\\n \"None of the connections are what we would call legal here on the Moon. The same Neville you want to invite as third author of the paper you are to write?\"\\n\\n \"Yes.\"\\n\\n \"Is that merely a coincidence?\"\\n\\n \"No. Neville was interested in my arrival and I believe he asked Selene to help me in my work.\"\\n\\n \"Did she tell you this?\"\\n\\n \"She said he was interested in me. That was natural enough, I suppose.\"\\n\\n \"Does it occur to you, Dr. Denison, that she may be working in her own interests and in those of Dr. Neville?\"\\n\\n \"In what way would their interests differ from ours? She has helped me without reservation.\"\\n\\n Gottstein shifted position and moved his shoulders as though he were going through muscle-pulling exercises. He said, \"Dr. Neville must know that a woman so close to himself is an Intuitionist. Wouldn\u0027t he use her? Why would she remain a tourist guide, if not to mask her abilities - for a purpose.\"\\n\\n \"I understand Dr. Neville frequently reasons in this fashion. I find it difficult to suspect unnecessary conspiracies.\"\\n\\n \"How do you know they are unnecessary. . . . When my space-skipper was hovering over the Moon\u0027s surface just before the ball of radiation formed over your equipment, I was looking down at you. You were not at the Pionizer.\"\\n\\n Denison thought back. \"No, I wasn\u0027t I was looking at the stars; rather a tendency of mine on the surface.\"\\n\\n \"What was Miss Lindstrom doing?\"\\n\\n \"I didn\u0027t see. She said she strengthened the magnetic field and the leak finally broke through.\"\\n\\n \"Is it customary for her to manipulate the equipment without you?\"\\n\\n \"No. But I can understand the impulse.\"\\n\\n \"And would there have been some sort of an ejection?\"\\n\\n \"I don\u0027t understand you.\"\\n\\n \"I\u0027m not sure I understand myself. There was a dim sparkle in the Earthlight, as though something was flying through the air. I don\u0027t know what.\"\\n\\n \"I don\u0027t either,\" said Denison.\\n\\n \"You can\u0027t think of anything that might naturally have to do with the experiment that - \"\\n\\n \"No.\"\\n\\n \u0027Then what was Miss Lindstrom doing?\"\\n\\n \"I still don\u0027t know.\"\\n\\n For a moment, the silence was heavy between them. Then the Commissioner said, \"As I see it then, you will try to correct the leak-instability and will be thinking about the preparation of a paper. I will get matters into motion at the other end and on my shortly forthcoming visit to Earth will make arrangements to have the paper published and will alert the government.\"\\n\\n It was a clear dismissal. Denison rose and the Commissioner said easily, \"And think about Dr. Neville and Miss Lindstrom.\"\\n\\n 17\\n\\n It was a heavier star of radiation, a fatter one, a brighter one. Denison could feel its warmth on his faceplate, and backed away. There was a distinct x-ray component in the radiation and though this shielding should take care of that there was no point in placing it under a strain.\\n\\n \"I guess we can\u0027t question it,\" he muttered. \"The leak-point is stable.\"\\n\\n \"I\u0027m sure of it,\" said Selene, flatly.\\n\\n \"Then let\u0027s turn it off and go back to the city.\"\\n\\n They moved slowly and Denison felt oddly dispirited. There was no uncertainty any more; no excitement. From this point on, there was no chance of failure. The government was interested; more and more, it would be out of his own hands.\\n\\n He said, \"I suppose I can begin the paper now.\"\\n\\n \"I suppose so,\" said Selene, carefully.\\n\\n \"Have you talked to Barren again?\"\\n\\n \"Yes, I have,\" \\n\\n","sourceLink":"https://allnovel.net/the-gods-themselves/page-25.html","bookId":1744,"book":{"id":1744,"title":"The Gods Themselves","description":"Storyline: Only a few know the terrifying truth--an outcast Earth scientist, a rebellious alien inhabitant of a dying planet, a lunar-born human intuitionist who senses the imminent annihilation of the Sun. They know the truth--but who will listen? They have foreseen the cost of abundant energy--but who will believe? These few beings, human and alien, hold the key to the Earth\u0027s survival.\\n","cover":"https://allnovel.net/images/the-gods-themselves.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-gods-themselves.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:17:03 AM"}}
