{"id":70200,"no":1,"title":"Page 1","content":"Science fiction has certain satisfactions peculiar to itself. It is possible, in trying to portray future technology, to hit close to home. If you live long enough after writing a particular story, you may actually have the pleasure of finding your predictions reasonably accurate and yourself hailed as a sort of minor prophet. This has happened to me in connection with my robot stories, of which \"Light Verse\" (included here) is an example. I began writing robot stories in 1939, when I was nineteen years old, and, from the first, I visualized them as machines, carefully built by engineers, with inherent safeguards, which I called \"The Three Laws of Robotics.\" (In doing so, I was the very first to use the word \"robotics\" in print, this taking place in the March, 1942 issue of Astounding Science Fiction.) As it happened, robots of any kind were not really practical until the mid-1970s when the microchip came into use. Only that made it possible to produce computers that were small enough and cheap enough, while possessing the potentiality for sufficient capacity and versatility, to control a robot at nonprohibitive expense. We now have machines, called robots, that are computer-controlled and are in industrial use. They increasingly perform simple and repetitious work on the assembly lines - welding, drilling, polishing and so on - and they are of increasing importance to the economy. Robots are now a recognized field of study and the precise word that I invented is used for it - robotics. To be sure, we are only at the very beginning of the robotic revolution. The robots now in use are little more than computerized levers and are very far from having the complexity necessary for the Three Laws to be built into them. Nor are they anything close to human in shape, so they are not yet the \"mechanical men\" that I have pictured in my. stories, and that have appeared on the screen innumerable times. Nevertheless, the direction of movement is clear. The primitive robots that have come into use are not the Frankenstein-monsters of equally primitive science fiction. They do not lust for human life (although accidents involving robots can result in human death, just as accidents with automobiles or electrical machinery can). They are, rather, carefully designed devices intended to relieve human beings of arduous, repetitive, dangerous, nonrewarding duties so that, in intent and in philosophy, they represent the first steps toward my story - robots. The steps that are yet to come are expected to proceed further in the direction I have marked out. A number of different firms are working on \"home robots\" that will have a vaguely human appearance and will fulfill some of the duties that once devolved on servants. The result of all this is that I am held in considerable regard by those working in the field of robotics. In 1985, a fat encyclopedic volume entitled Handbook of Industrial Robotics (edited by Shimon Y. Nof and published by John Wiley) appeared, and, on request of the editor, I supplied it with an introduction. Of course, in order to appreciate the accuracy of my predictions, I had to be fortunate enough to be a survivor. My first robots appeared in 1939, as I say, and I had to live for over forty more years in order to discover I was a prophet. Because I had begun at a very early age, and because I was fortunate, I managed to do this and words cannot tell you how grateful I am for that. Actually, I carried on my predictions of the future of robotics to the very end, to the ultimate moment, in my story \"The Last Question,\" published in 1957. I have a sneaking suspicion that, if the human race survives, we may continue to progress in that direction in some ways anyway. Still, survival is limited at the best, and I have no chance of seeing very much more of the future course of technology. I will have to content myself with having future generations witness and (I hope) applaud what triumphs of this sort I may gain. I, myself, won\u0027t, Nor are robots the only area in which my crystal ball was clear. In my story \"The Martian Way,\" published in 1952, I described a space walk quite accurately, although an actual feat of this sort didn\u0027t take place till fifteen years afterward. Foreseeing space walks was not a very daring piece of prescience, I admit, for, given spaceships, such things would be inevitable. However, I also described the psychological effects and thought of one that was rather unusual - particularly for me. I am, you see, a pronounced acrophobe with an absolute terror of heights and know perfectly well that I will never voluntarily go on a spaceship. If, however, I were somehow forced on one, I know, too, that I would never dare leave it for a space walk. Nevertheless, I put personal fear to one side and imagined the space walk to produce euphoria. I had my space travelers quarrel over whose turn it was to get out into space and drift in quiet peace among the stars. And when space walks became fact, such euphoria was felt. In my story, \"The Feeling of Power,\" published in 1957, I made use of pocket computers, about a decade before the real thing came along. I even considered the possibility that such computers might seriously decrease the ability of people to do arithmetic in the old-fashioned way, and that is a real concern of educators now. As a final example, in my story \"Sally,\" published in 1953, I described computerized cars that had almost reached the stage of having lives of their own. And, in the last few years, we do indeed have computerized cars that can actually talk to the driver - although their abilities in this direction are, as yet, very simple. Yet, if there is the possibility of this satisfaction from accurate prophecy in science fiction, there is also the reverse. Science fiction offers its writers chances of embarrassment that no other form of fiction does. After all, if we may prove accurate in our predictions, we may prove inaccurate as well, sometimes ludicrously so. Such embarrassment becomes particularly acute when one\u0027s stories are reprinted in a collection such as this one. When an author starts young, lives out a normal lifetime (as I seem to be doing) and has written continuously, there is likely to be included in the collection stories that were written and published thirty and forty years before and that leave ample scope for any cloudiness in the crystal ball to show up. This doesn\u0027t happen to me as often as it might, for I have several things going for me. In the first place, I am well acquainted with science and am not likely to be wrong in fundamentals. Secondly, I am cautious in my predictions and do not flail away madly in contravention of scientific principles. Nevertheless, science does advance and sometimes produces completely unexpected results in a very few years, and this may leave a writer (even me) high and dry on a pinnacle of false \"facts. \" The worst luck I had in this respect turned up in connection with a series of science fiction novels I wrote for youngsters between 1952 and 1958. That series dealt with the continuing adventures of my heroes on various planets of the solar system, and in each case, I carefully described the planets in strict accordance with what was known about them at the time. Unfortunately, it was in the course of those very years that microwave astronomy was developed and shortly after those years that rocket probes began to be sent out. The result was that our knowledge of the solar system was startlingly advanced and we learned something new and unexpected about every single planet. For instance, in my description of Mercury in Lucky Starr and the Big Sun of Mercury, I had it facing one side to the Sun, as astronomers then thought - and that was essential to the plot. As it happens, however, we now know that Mercury turns slowly and that every portion of its surface gets sunlight part of the time. There is no \"dark side.\" In my description of Venus in Lucky Starr and the Oceans of Venus, I had a planetwide ocean, which, at that time, seemed at least possible. It was essential to the plot as well. However, we now know that the surface of Venus is at a temperature far above the boiling point of water, and an ocean - or even a drop - of liquid water on its surface is totally impossible. As for Mars, in my book David Starr: Space Ranger, I managed to get the description right in many ways. However, I didn\u0027t take advantage of the huge extinct Martian volcanoes that were discovered about fifteen years after the book was published. What\u0027s more, I did talk about the canals (dry ones), which were found to be nonexistent, and I introduced intelligent Martians remaining from a long-dead surface civilization, and this is really extremely unlikely. Jupiter and its satellites appeared in Lucky Starr and the Moons of Jupiter, and while I was careful to describe all the worlds, I naturally missed some major points that were not discovered till twenty years afterward. I said nothing of the cracked world-girdling glacier of Europa and nothing of Io\u0027s active volcanoes. I didn\u0027t mention Jupiter\u0027s huge magnetic field. Nor, in Lucky Starr and the Rings of Saturn, did I mention some of the interesting features of the Saturnian satellite system and rings. The only book in the series that survived intact (scientifically speaking) was Lucky Starr and the Pirates of the Asteroids. Fortunately, there was a way out. Honesty in the best policy and when the Lucky Starr series was reprinted in the 1970s, I insisted on inserting introductory notes explaining where the astronomical details had become outdated. At first, the publishers were a little reluctant to do so, but I explained that I could not allow the young reader to be misled, or, if he were knowledgeable, to have him think that I was not. In went the notes, and, I am glad to say, sales were not adversely affected. None of the stories in this collection was as badly shattered as my poor Lucky Starr books were, but there are things to beware of. In the first place, there is one place where I missed something that was (in hindsight) very obvious, and I have been kicking myself over it for the last couple of years. In \"The Martian Way,\" the same story in which I triumphed with my description of the spacewalk, I had my heroes approach Saturn and actually enter the ring system. In doing so I very carefully described the rings, making use of observations from Earth\u0027s surface to do so. Now, from Earth\u0027s surface, some 800 million miles from Saturn, we see the rings as solid and unbroken except for the black line of the Cassini division that seems to separate them into two rings. The portion of the rings closest to Saturn is considerably dimmer than the rest of the ring system, and that portion is usually considered a third ring (the so-called \"crepe ring.\") And that was how I described the rings as seen by my space-travelers in the story. Yet it stands to reason (at least, now it stands to reason) that if we could see the ring system from a nearer distance, we would see greater detail. We would see divisions - places where fewer particles were in orbit so that we would see dimmer lines separating brighter lines - divisions that would simply not be seen at great distances. Earth\u0027s surface telescopes would just blur them out and record only the thickest of the dim lines - the Cassini division. The closer we would get, the more numerous and the thinner the bright lines would get as visibility became clearer and clearer, until, when we were as close as we could get and still see all the rings, the rings would look like a grooved record - which is what they do look like. Suppose I had figured this out in 1952 and had described the rings in that fashion. Even if I had missed such things as shadowy \"spokes\" in the ring, and \"braided\" rings, things that were absolutely unpredictable, it would have been great if I had imagined the fine divisions. That was an easy deduction to make and if I had described the rings in that fashion then, as soon as those rings had been probed I would have announced that I had anticipated what they had discovered. (You think that modesty would have held me back? Don\u0027t be an idiot!) How great that would have been! As it is, my failure to see this marks me down as not very bright, and that is there, for all to see, in \"The Martian Way.\" To be sure, no astronomer saw the truth about the rings in 1952, but what of that? An astronomer is only an astronomer and his vision is naturally limited. I am a science fiction writer and more is expected of me. Then, too, sometimes when I saw accurately, or when I saw something that might well prove to be accurate some day, then I generally placed it far too far into the future. I admit I got the robots correct, for my earliest stories indicated that they got their start in the 1980s and 1990s, which is not bad at all. However, what of the computerized cars in \"Sally\" and of the pocket computers in \"The Feeling of Power\"? I was careful not to give the exact dates of discovery of these advances. (I may be dumb, but I\u0027m not that dumb.) Still, there\u0027s no doubt as we read the stories that they are discoveries of the far future - yet they\u0027re here now and I have lived to see them, and be embarrassed over my lack of confidence in the human mind and human ingenuity. \"Breeds There a Man...?\" deals, in part, with the development of an advance against the nuclear bomb. It was published in 1951 and, although I don\u0027t date it, the impression it gives is that its events take place in the near future, perhaps just a few years after 1951. I was clearly wrong in this, for real discussions of possible defenses didn\u0027t come till the 1980s. What\u0027s more, my notion of a defense was a purely static one - the creation of a force-field shield strong enough to resist even a nuclear explosion (the story was written before the H-Bomb was invented, by the way). Now that we are considering a nuclear defense, we are talking of an active one. We are talking of the use of computerized X-ray lasers, designed to shoot down intercontinental ballistic missiles as soon as they are launched and move beyond the atmosphere. Frankly, I don\u0027t think this will work either, but it is considerably more advanced than my own foolish speculation of the matter in 1951, thirty-five years ago. Generally, I can do my best foreseeing once I\u0027m given a hint (a good strong hint). In my robot stories, I postulated robots that were so huge that they were immobile and that could do nothing but think and communicate the results of those thoughts. I had one like that in my very first robot story. In later robot stories I called them \"brains.\" I didn\u0027t think to call them computers. My robots, too, had \"brains\" that made them work, and I never spoke of them as computers, either. I had to make them science-fictionish, of course, so I called them \"positronic brains.\" Positrons had been detected for the first time only four years before my first robot story had been written. Positrons were exciting particles, bringing with them visions of \"antimatter.\" For that reason, I thought positronic brains was a phrase that sounded good. They would not be essentially different from electronic brains, except that positrons could be made to come into being and would then be destroyed in a millionth of a second or so by all the electrons that surround them, no matter where on Earth they were. That gave me the notion that they might be seen as responsible for the rapidity of thought. To be sure, the energy relationships - the energy required to produce positrons in quantity or the energy released when positrons are destroyed in quantity - are horrendous, so great that the notion of positronic brains is forever impossible, in all likelihood - but I ignored that. It wasn\u0027t until after computers were invented and the public was made aware of their existence, that computers began to exist in my stories, and even then I didn\u0027t truly conceive of the possibility of miniaturization. Yes, I spoke of rocket computers but I visualized them as scarcely more powerful than a slide rule. But eventually I did grasp miniaturization - naturally, after the process had started. In \"The Last Question\" I began with my usual computer, Multivac, as large as a city, for I could only conceive a larger computer by imagining more and more vacuum tubes heaved into it. But then, in that story, I began miniaturizing and miniaturizing far beyond what I think there is any real possibility of. However, I suspect the readers are always ready to forgive a poor science fiction writer getting to be out-of-date. As I said, my \"Lucky Starr\" books were not hurt for being out-of-date. As a matter.of fact, H.G. Wells\u0027s The War of the Worlds is still read avidly, nearly a century after it was published and despite the incredibly false picture of Mars that it represents (false in the light of the Mars we know today). The pictures of Mars given by Edgar Rice Burroughs, a generation after Wells, and by Ray Bradbury even as late as the 1950s, are also in no way comparable to the real thing, and yet that doesn\u0027t make it impossible to read A Princess on Mars or The Martian Chronicles, either. That is because there is more to a science fiction story than the science it contains. There is also the story and if the science it contains is bent because of later discoveries, or because the plot absolutely demands the bending, we tend to forgive and overlook. For instance, in my story \"The Billiard Ball\" I have a billiard ball enter a region of space in which it instantly assumes the speed of light. This is undoubtedly impossible, but even in terms of my bending of science, there is something more impossible. The billiard ball has a finite volume. Part of it enters the region first and that part instantly assumes the speed of light and breaks away from the rest. In short, the billiard ball must be reduced to atoms, or objects even less substantial, yet in the story it retains its integrity. My Conscience hurt me, but I just let it hurt and did what I had to do. In \"The Ugly Little Boy,\" I have a version of time travel and I firmly believe that time travel is impossible. However, I ignored that because the story is only tangentially about time travel. What it is really about is love. Again I doubt that human beings will ever become living energy vortexes, though I present them as such in \"Eyes Do More Than See,\" Who cares? The story is really about the beauty of material things. I think you see what I am getting at. You may, in reading the following stories, find points in science that are inaccurate in themselves, or that are made inaccurate by subsequent advance. But if you write to tell me about it, please tell me also if you enjoyed the story anyway. You might not, of course, but I hope you will. One more thing. My story collections are usually unillustrated and this doesn\u0027t bother me, for I am not very visual. I am a wordman. Nevertheless, this collection is illustrated by Ralph McQuarrie and I must admit it adds immeasurably to the beauty of the book and even adds to the sense of the stories, by placing the reader into the proper visual attitude. The cover illustration, which inspired my story \"Robot Dreams,\" written for this collection, is beautiful and humanizes a robot in a way I have never seen before. Perhaps none of this is terribly surprising, for Ralph is one of the best and most influential of all science fiction artists, having been involved with such blockbuster movies as \"Star Wars\" and \"The Empire Strikes Back.\" In 1986 he won an Oscar for special effects for the film \"Cocoon.\" I am so proud to have him part of this book.","sourceLink":"https://allnovel.net/robot-dreams-robot-0-4/page-1.html","bookId":1741,"book":{"id":1741,"title":"Robot Dreams (Robot #0.4)","description":"Storyline: Robot Dreams (Robot 0.4) Robot Dreams collects 21 of Isaac Asimov\u0027s short stories spanning the body of his fiction from the 1940s to the 1980s----exploring not only the future of technology, but the future of humanity\u0027s maturity and growth.","cover":"https://allnovel.net/images/robot-dreams-robot-0-4.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/robot-dreams-robot-0-4.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:15:35 AM"}}
