{"id":70214,"no":15,"title":"Page 15","content":"The very last person anyone would expect to be a murderer was Mrs. Avis Lardner. Widow of the great astronaut-martyr, she was a philanthropist, an art collector, a hostess extraordinary, and, everyone agreed, an artistic genius. But above all, she was the gentlest and kindest human being one could imagine.\n Her husband, William J. Lardner, died, as we all know, of the effects of radiation from a solar flare, after he had deliberately remained in space so that a passenger vessel might make it safely to Space Station 5.\n Mrs. Lardner had received a generous pension for that, and she had then invested wisely and well. By late middle age she was very wealthy.\n Her house was a showplace, a veritable museum, containing a small but extremely select collection of extraordinarily beautiful jeweled objects. From a dozen different cultures she had obtained relics of almost every conceivable artifact that could be embedded with jewels and made to serve the aristocracy of that culture. She had one of the first jeweled wristwatches manufactured in America, a jeweled dagger from Cambodia, a jeweled pair of spectacles from Italy, and so on almost endlessly.\n All was open for inspection. The artifacts were not insured, and there were no ordinary security provisions. There was no need for anything conventional, for Mrs. Lardner maintained a large staff of robot servants, all of whom could be relied on to guard every item with imperturbable concentration, irreproachable honesty, and irrevocable efficiency.\n Everyone knew the existence of those robots and there is no record of any attempt at theft, ever.\n And then, of course, there was her light-sculpture. How Mrs. Lardner discovered her own genius at the art, no guest at her many lavish entertainments could guess. On each occasion, however, when her house was thrown open to guests, a new symphony of light shone throughout the rooms; three-dimensional curves and solids in melting color, some pure and some fusing in startling, crystalline effects that bathed every guest in wonder and somehow always adjusted itself so as to make Mrs. Lardner\u0027s blue-white hair and soft, unlined face gently beautiful.\n It was for the light-sculpture more than anything else that the guests came. It was never the same twice, and never failed to explore new experimental avenues of art. Many people who could afford light-consoles prepared light-sculptures for amusement, but no one could approach Mrs. Lardner\u0027s expertise. Not even those who considered themselves professional artists.\n She herself was charmingly modest about it. \"No, no,\" she would protest when someone waxed lyrical. \"I wouldn\u0027t call it \u0027poetry in light.\u0027 That\u0027s far too kind. At most, I would say it was mere \u0027light verse.\u0027\" And everyone smiled at her gentle wit.\n Though she was often asked, she would never create light-sculpture for any occasion but her own parties. \"That would be commercialization,\" she said.\n She had no objection, however, to the preparation of elaborate holograms of her sculptures so that they might be made permanent and reproduced in museums of art an over the world. Nor was there ever a charge for any use that might be made of her light-sculptures.\n \"I couldn\u0027t ask a penny,\" she said, spreading her arms wide. \"It\u0027s free to all. After all, I have no further use for it myself.\" It was truer She never used the same light-sculpture twice.\n When the holograms were taken, she was cooperation itself. Watching benignly at every step, she was always ready to order her robot servants to help. \"Please, Courtney,\" she would say, \"would you be so kind as to adjust the step ladder?\"\n It was her fashion. She always addressed her robots with the most formal courtesy.\n Once, years before, she had been almost scolded by a government functionary from the Bureau of Robots and Mechanical Men. \"You can\u0027t do that,\" he said severely. \"It interferes with their efficiency. They are constructed to follow orders, and the more clearly you give those orders, the more efficiently they follow them. When you ask with elaborate politeness, it is difficult for them to understand that an order is being given. They react more slowly.\"\n Mrs. Lardner lifted her aristocratic head. \"I do not ask for speed and efficiency,\" she said. \"I ask goodwill. My robots love me.\"\n The government functionary might have explained that robots cannot love, but he withered under her hurt but gentle glance.\n It was notorious that Mrs. Lardner never even returned a robot to the factory for adjustment. Their positronic brains are enormously complex, and once in ten times or so the adjustment is not perfect as it leaves the factory. Sometimes the error does not show up for a period of time, but whenever it does, u. S. Robots and Mechanical Men, Inc., always makes the adjustment free of charge.\n Mrs. Lardner shook her head. \"Once a robot is in my house,\" she said, \"and has performed his duties, any minor eccentricities must be borne with. I will not have him manhandled.\"\n It was the worse thing possible to try to explain that a robot was but a machine. She would say very stiffly, \"Nothing that is as intelligent as a robot can ever be but a machine. I treat them as people.\"\n And that was that!\n She kept even Max, although he was almost helpless. He could scarcely understand what was expected of him. Mrs. Lardner denied that strenuously, however. \"Not at all,\" she would say firmly. \"He can take hats and coats and store them very well, indeed. He can hold objects for me. He can do many things.\"\n \"But why not have him adjusted?\" asked a friend, once.\n \"Oh, I couldn\u0027t. He\u0027s himself. He\u0027s very lovable, you know. After all, a positronic brain is so complex that no one can ever tell in just what way it\u0027s off. If he were made perfectly normal there would be no way to adjust him back to the lovability he now has. I won\u0027t give that up.\"\n \"But if he\u0027s maladjusted,\" said the friend, looking at Max nervously, \"might he not be dangerous?\"\n \"Never,\" laughed Mrs. Lardner. \"I\u0027ve had him for years. He\u0027s completely harmless and quite a dear.\"\n Actually he looked like all the other robots, smooth, metallic, vaguely human but expressionless.\n To the gentle Mrs. Lardner, however, they were all individual, all sweet, all lovable. It was the kind of woman she was.\n How could she commit murder?\n The very last person anyone would expect to be murdered would be John Semper Travis. Introverted and gentle, he was in the world but not of it. He had that peculiar mathematical turn of mind that made it possible for him to work out in his mind the complicated tapestry of the myriad positronic brain-paths in a robot\u0027s mind.\n He was chief engineer of U.S. Robots and Mechanical Men, Inc.\n But he was also an enthusiastic amateur in light-sculpture. He had written a book on the subject, trying to show that the type of mathematics he used in working out positronic brain-paths might be modified into a guide to the production of aesthetic light-sculpture.\n His attempt at putting theory into practice was a dismal failure, however. The sculptures he himself produced, following his mathematical principles, were stodgy, mechanical, and uninteresting.\n It was the only reason for unhappiness in his quiet, introverted, and secure life, and yet it was reason enough for him to be very unhappy indeed. He knew his theories were right, yet he could not make them work. If he could but produce one great piece of light-sculpture.\n Naturally, he knew of Mrs. Lardner\u0027s light-sculpture. She was universally hailed as a genius, yet Travis knew she could not understand even the simplest aspect of robotic mathematics. He had corresponded with her but she consistently refused to explain her methods, and he wondered if she had any at all. Might it not be mere intuition? - but even intuition might be reduced to mathematics. Finally he managed to receive an invitation to one of her parties. He simply had to see her.\n Mr. Travis arrived rather late. He had made one last attempt at a piece of light-sculpture and had failed dismally.\n He greeted Mrs. Lardner with a kind of puzzled respect and said, \"That was a peculiar robot who took my hat and coat.\"\n \"That is Max,\" said Mrs. Lardner.\n \"He is quite maladjusted, and he\u0027s a fairly old model. How is it you did not return it to the factory?\"\n \"Oh, no,\" said Mrs. Lardner. \"It would be too much trouble.\"\n \"None at all, Mrs. Lardner,\" said Travis. \"You would be surprised how simple a task it was. Since I am with U. S. Robots, I took the liberty of adjusting him myself. It took no time and you\u0027ll find he is now in perfect working order.\"\n A queer change came over Mrs. Lardner\u0027s face. Fury found a place on it for the first time in her gentle life, and it was as though the lines did not know how to form.\n \"You adjusted him?\" she shrieked. \"But it was he who created my light-sculptures. It was the maladjustment, the maladjustment, which you can never restore, that - that - \"\n It was really unfortunate that she had been showing her collection at the time and that the jeweled dagger from Cambodia was on the marble tabletop before her.\n Travis\u0027s face was also distorted. \"You mean if I had studied his uniquely maladjusted positronic brain-paths I might have learned - \"\n She lunged with the knife too quickly for anyone to stop her and he did not try to dodge. Some said he came to meet it - as though he wanted to die. \n","sourceLink":"https://allnovel.net/robot-dreams-robot-0-4/page-15.html","bookId":1741,"book":{"id":1741,"title":"Robot Dreams (Robot #0.4)","description":"Storyline: \n Robot Dreams (Robot 0.4) \n Robot Dreams collects 21 of Isaac Asimov\u0027s short stories spanning the body of his fiction from the 1940s to the 1980s----exploring not only the future of technology, but the future of humanity\u0027s maturity and growth.\n \n","cover":"https://allnovel.net/images/robot-dreams-robot-0-4.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/robot-dreams-robot-0-4.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:15:35 AM"}}
