{"id":74582,"no":1,"title":"Page 1","content":"Rush\n 13 years ago...\n There was a knock at the door then just the small shuffle of feet. My chest already ached. Mom had called me on their way home to tell me what she\u0027d done and that now she needed to go out to have some cocktails with friends. I\u0027d be the one that would need to soothe Nan. My mom couldn\u0027t handle the stress it involved. Or so she\u0027d said when she called me.\n \"Rush?\" Nan\u0027s voice called out with a hiccup. She\u0027d been crying.\n \"I\u0027m here, Nan,\" I said as I stood up from the beanbag I\u0027d been sitting on in the corner. It was my hiding spot. In this house you needed a hiding spot. If you didn\u0027t have one then bad things happened.\n Strands of Nan\u0027s red curls stuck to her wet face. Her bottom lip quivered as she stared up at me with those sad eyes of hers. I hardly ever saw them happy. My mother only gave her attention when she needed to dress her up and show her off. The rest of the time she was ignored. Exceptby me. I did my best to make her feel wanted.\n \"I didn\u0027t see him. He wasn\u0027t there,\" she whispered as a small sob escaped. I didn\u0027t have to ask who \"he\" was. I knew. Mom had gotten tired of hearing Nan ask about her father. So she\u0027d decided to take her to see him. I wish she\u0027d told me. I wish I could have gone. The stricken look on Nan\u0027s face had my hands balling into fist. If I ever saw that man I was gonna punch him in the nose. I wanted to see him bleed.\n \"Come here,\" I said, reaching out a hand and pulling my little sister into my arms. She wrapped hers around my waist and squeezed me tightly. Times like this it was hard to breathe. I hated the life she\u0027d been given. At least I knew my dad wanted me. He spent time with me.\n \"He has other daughters. Two of them. And they\u0027re... beautiful. Their hair is like an angel\u0027s hair. And they have a momma that lets them play outside in the dirt. They were wearing tennis shoes. Dirty ones.\" Nan was envious of dirty tennis shoes. Our mother didn\u0027t allow her to be less than perfect at all times. She\u0027d never even owned a pair of tennis shoes.\n \"They can\u0027t be more beautiful than you,\" I assured her because I firmly believed that.\n Nan sniffed and then pulled back from me. Her head tilted up and those big green eyes looked up at me. \"They are. I saw them. I could see pictures on the wall with both girls and a man. He loves them.... He doesn\u0027t love me.\"\n I couldn\u0027t lie to her. She was right. He didn\u0027t love her.\n \"He\u0027s a stupid asshat. You have me, Nan. You\u0027ll always have me.\" \n","sourceLink":"https://allnovel.net/never-too-far-too-far-2/page-1.html","bookId":1994,"book":{"id":1994,"title":"Never Too Far (Too Far #2)","description":"Storyline: \n Never Too Far (Too Far, #2; Rosemary Beach, #2) \n He had held a secret that destroyed her world. \n Everything she had known was no longer true. \n Blaire couldn’t stop loving him but she knew she could never forgive him. \n Now, she was back home and learning to live again. Moving on with life… until something happened to send her world spinning once again. \n What do you do when the one person you can never trust again is the one that you need to trust so desperately? \n You lie, hide, avoid, and pray that your sins never find you out.\n \n","cover":"https://allnovel.net/images/never-too-far-too-far-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/never-too-far-too-far-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:31:23 AM"}}
