{"id":74607,"no":26,"title":"Page 26","content":"Rush\n I sat down in one of the leather chairs across from Woods\u0027 desk. He was studying me and it pissed me off. I had been the one to call him and set up this meeting. Why was he so damn amused?\n \"I\u0027m going to pay you the correct lease amount in full for the condo. I know what the going rate is and I\u0027ve cut you a check for a one-year lease. Although, Blaire probably won\u0027t be living there very long. As soon as I can get her to trust me I\u0027m moving her in with me.\" I slid the check across his desk.\n Woods looked down at it and back up at me. \"I assume this is because you don\u0027t want me taking care of what is yours.\"\n \"That\u0027s right.\"\n Woods nodded and picked the check up. \"Good. I shouldn\u0027t have to take care of Blaire or your baby. But I would have. You may not believe me but I\u0027m glad you know about the pregnancy. Just don\u0027t fuck things up. You\u0027re gonna have to make sure Nan keeps her claws in.\"\n I didn\u0027t need Woods telling me what I did and didn\u0027t need to do. None of this was his business. I wasn\u0027t done with him just yet though, so pissing him off was a bad idea.\n \"I don\u0027t want her working double shifts or outside in the heat. She refuses to stop working but her hours need to be cut back.\"\n Woods crossed his arms over his chest and leaned back in his seat. \"She know about this? Because last time I checked she needed all the hours she could get.\"\n \"Last time you checked I didn\u0027t know she was carrying my baby. Nothing can happen to her, Woods. I can\u0027t let anything else happen to her.\"\n He nodded and let out a heavy sigh. \"Fine. I agree. I don\u0027t like being told what to do but I agree.\"\n \"One more thing,\" I said before standing up. \"Jimmy is gay, right?\"\n Woods burst into laughter then nodded. \"Yes, he is but keep that to yourself. The women like to come in just to look at him. He gets tipped well because of it.\"\n Good. I\u0027d thought he was but his attachment to Blaire bothered me. \"Then I guess he can hover over my girl.\"\n Woods smirked, \"I don\u0027t think you could stop him if you tried.\"\n My phone rang as I walked to my Range Rover. It reminded me that Blaire didn\u0027t have a phone. This wouldn\u0027t be her calling me. I was headed to check on her now. We\u0027d talk about that then. Pulling my phone out I saw my mother\u0027s name on the screen. I\u0027d ignored her for four weeks. I had Blaire back but I wasn\u0027t ready to talk to mom just yet. I pressed ignore and stuck my phone back in my pocket.\n Once I was at Blaire\u0027s I checked under the mat and I was happy to see there was no key hidden. I\u0027d talked to her and Bethy last night about how unsafe that was. I knocked on the door and listened to the footsteps on the other side of the door. Bethy\u0027s car had been at the club when I left so I knew Blaire was alone. Just thinking about having sometime alone with her made me smile.\n The door opened and a \u0027just crawled out of bed\u0027 Blaire stood on the other side holding a donut. The blush on her cheeks was adorable. The tiny little tank top barely covering up those big beautiful tits of hers and the little boxer shorts took the adorable and turned her into smoking hot.\n I walked inside and closed the door behind me. \"Dayum baby,\" I whispered as I backed her into the sofa. \"Please don\u0027t ever answer the door looking like this again.\"\n She looked down and then a smile tugged on her lips. \"They keep getting bigger. I think it\u0027s because of the pregnancy,\" she said in way of explanation. \"I forget they look like this.\"\n I wrapped a lock of her hair around my finger. \"Not just the tiny tank top but this sexy just got out of bed hair and,\" I slid my hand down over her barely covered up ass, \"this needs more covering up too.\"\n \"People don\u0027t normally stop by in the mornings.\" Blaire sounded out of breath. I liked knowing I was getting to her.\n \"Good,\" I replied. \"How did your bed sleep?\" I asked before taking a nip at her earlobe.\n \"Uh... I uh... sleeps good,\" she sounded nervous. I pulled back and looked down at her. Why did she sound nervous?\n \"Only good?\" I asked, watching as her cheeks turned bright red.\n Blaire shifted her feet and looked down at the floor. \"Pregnant dreams can be um... intense.\"\n \"Pregnant dreams? What do you mean?\" I was curious now. The fact her entire face was a bright red and she looked ready to crawl under the table and hide from me only made me want to know more.\n She started to move and I grabbed her hips and kept her pinned between me and the sofa. \"Oh no, you don\u0027t. You can\u0027t tell me things like that and not explain.\"\n Blaire let out a short unsure laugh and shook her head. \"You can keep me here all day but I\u0027m not telling you.\"\n I slipped my hands under her shirt and started to tickle her ribcage. I tried really hard not to focus on the perfectly plump tits just within my reach. I didn\u0027t want Blaire to think I only cared about sex with her. So far I\u0027d made our relationship about sex. I wanted to prove to her it was more than that. Even if I was taking cold showers and jerking off thinking about how sweet she\u0027d tasted the other day.\n Blaire giggled and squirmed as I tickled her. \"Stop!\" she squealed and pushed against me. When she tried to squirm away from me my hand slid up and grazed her left breast causing her to freeze. A small sound came from her throat that sounded really close to a moan. I brushed the pad of my thumb over her nipple and she pressed against me. Fuck the no sex thing. How was I supposed to ignore this?\n \"Please, Rush. I need you to,\" she begged.\n She needed me to? Wait... were her dreams... \"Blaire, baby, are your dreams about sex?\"\n She whimpered and nodded as I pinched her nipple between my fingers. \"Yes, and I\u0027m tired of waking up horny,\" she whispered.\n Fuck. I took the donut from her hands and laid it down on the table then sucked the glaze from her fingers. Her breathing hitched. I grabbed her and picked her up. She wrapped her legs around my waist and I devoured her mouth while I walked us back to her room. This time there was a big bed for me to put her on and I\u0027d keep her in it all day making love to her if that was what she needed.\n I laid her down on the bed and pulled her little shorts and panties off before crawling on top of her. \"Get this top off,\" I said as I yanked it up and over her head. I stopped and looked down at her. Just last week I\u0027d thought I would never see her like this again. Holding her was something I went to bed dreaming about. Now she was here and I wanted to cherish every small portion of her body.\n \"Rush, please. I need you in me,\" she squirmed and pleaded. As much as I wanted to worship her body it looked like I wasn\u0027t going to get to. I wasn\u0027t going to be able to turn down a needy Blaire.\n \"Can I taste you first?\" I asked, kissing her mouth again then running kisses down her body.\n \"Yes, anything. I just need you to touch me.\" She sighed as my hand found her wet folds and I slipped a finger inside. \"Oh God! Yes!Ahhhh,\" she cried out as I began touching her.\n Sex crazed Blaire was going to be fun. Itwas like I\u0027d just won the fucking jackpot. I pushed her thighs further apart and lowered my mouth to kiss the hardened little clit hiding there. She bucked and began begging again. Sticking my tongue out, I ran it over her swollen sweet spot.Both her hands grabbed my hair and held me. I couldn\u0027t help but smile.\n \"Please, Rush, please. You make it feel so good. Please.\" Her sexy little pleadings were about to make me explode. I wanted in her just as bad as she wanted me in there but I was also enjoying this. I focused on making her come in my mouth while she twisted and moaned on the bed. When she finally screamed my name and that she was coming I jumped up and stripped my clothes off in record time.\n We didn\u0027t need a condom anymore. I laid over her and with one easy stroke I was in her. Blaire grabbed onto my shoulders and threw her head back. If this was how all pregnant women were, then why the fuck didn\u0027t men keep their women knocked up? This was hot. So hot I might not make it very long.\n \"Fuck me, Rush. Real hard,\" Blaire panted.\n \"Baby, you keep saying stuff like that and I\u0027m gonna blow before you want me to.\"\n She smiled wickedly up at me. \"I\u0027ll get you hard again. I promise. Now please,do it hard. In my dreams, you bend me over and fuck me until I\u0027m screaming and clawing at the bed begging you never to stop. Right before I come, I wake up.\"\n She\u0027d not only been having sex dreams about me but dirty sex dreams about me. I pulled out of her and flipped her on her stomach, then jerked her hips up in the air. \"You want fucked, sweet Blair? I\u0027ll make my girl feel better,\" I cooed as I ran my hands gently over her bare ass. She started to squirm and I slapped her pussy causing her to gasp in surprise. \"If you want it hard baby, then I\u0027m going to give it to you hard,\" I promised.\n Grabbing her hip, I pounded into her and almost shot my load then. She was so fucking tight. The desperate cries of pleasure coming from Blaire weren\u0027t helping. Remembering that I needed to make Blaire come again was hard when my balls were drawn up tight and my cock was throbbing.\n \"Harder,\" Blaire moaned and I lost it. I began pumping into her with the same wild needy abandon that had consumed her. When her tight warmth began squeezing me and my name came tearing out of her mouth I closed my eyes and let go. \n","sourceLink":"https://allnovel.net/never-too-far-too-far-2/page-26.html","bookId":1994,"book":{"id":1994,"title":"Never Too Far (Too Far #2)","description":"Storyline: \n Never Too Far (Too Far, #2; Rosemary Beach, #2) \n He had held a secret that destroyed her world. \n Everything she had known was no longer true. \n Blaire couldn’t stop loving him but she knew she could never forgive him. \n Now, she was back home and learning to live again. Moving on with life… until something happened to send her world spinning once again. \n What do you do when the one person you can never trust again is the one that you need to trust so desperately? \n You lie, hide, avoid, and pray that your sins never find you out.\n \n","cover":"https://allnovel.net/images/never-too-far-too-far-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/never-too-far-too-far-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:31:23 AM"}}
