{"id":26786,"no":10,"title":"A PREFACE TO THE PROFESSION OF JOURNALISM","content":"(being an answer to a letter from a college student, asking advice as to taking up writing as a career) Your inquiry is congenial, and I feel guilty of selfishness in answering it in this way. But he must be a poor workman, whether artisan or artist, who does not welcome an excuse now and then for shutting out the fascinating and maddening complexity of this shining world to concentrate his random wits on some honest and self-stimulating expression of his purpose. There are exceptions to every rule; but writing, if undertaken as a trade, is subject to the conditions of all other trades. The apprentice must begin with task-work; he must please his employers before he can [52]earn the right to please himself. Not only that, he must have ingenuity and patience enough to learn how editors are pleased; but he will be startled, I think, if he studies their needs, to see how eager they are to meet him half way. This necessary docility is in the long run, a wholesome physic, because, if our apprentice has any gallantry of spirit, it will arouse in him an exhilarating irritation, that indignation which is said to be the forerunner of creation. It will mean, probably, a period—perhaps short, perhaps long, perhaps permanent—of rather meagre and stinted acquaintance with the genial luxuries and amenities of life; but (such is the optimism of memory) a period that he will always look back upon as the happiest of all. It is well for our apprentice if, in this season, he has a taste for cheap tobacco and a tactful technique in borrowing money. The deliberate embrace of literature as a career involves very real dangers. I mean dangers to the spirit over and above those of the right-hand trouser pocket. For, let it be honestly stated, the business of writing is solidly founded on a monstrous and perilous egotism. Himself, his temperament, his powers of observation and comment, his emotions and sensibilities and ambitions and idiocies—these are the only monopoly the writer has. This is his only capital, and with glorious and shameless confidence he proposes to market it. Let him make the best of it. Continually stooping over the muddy flux of his racing mind, searching a momentary flash of clearness in which he can find mirrored some delicate beauty or truth, he tosses between[53] the alternatives of self-grandeur and self-disgust. It is a painful matter, this endless self-scrutiny. We are all familiar with the addled ego of literature—the writer whom constant self-communion has made vulgar, acid, querulous, and vain. And yet it is remarkable that of so many who meddle with the combustible passions of their own minds so few are blown up. The discipline of living is a fine cooling-jacket for the engine. It is essential for our apprentice to remember that, though he begin with the vilest hack-work—writing scoffing paragraphs, or advertising pamphlets, or freelance snippets for the papers—that even in hack-work quality shows itself to those competent to judge; and he need not always subdue his gold to the lead in which he works. Moreover, conscience and instinct are surprisingly true and sane. If he follows the suggestions of his own inward, he will generally be right. Moreover again, no one can help him as much as he can help himself. There is no job in the writing world that he cannot have if he really wants it. Writing about something he intimately knows is a sound principle. Hugh Walpole, that greatly gifted novelist, taught school after leaving Cambridge, and very sensibly began by writing about school-teaching. If you care to see how well he did it, read \"The Gods and Mr. Perrin.\" I would propose this test to the would-be writer: Does he feel, honestly, that he could write as convincingly about his own tract of life (whatever it may be) as Walpole wrote about that boys\u0027 school? If so, he has a true vocation for literature. [54]The first and most necessary equipment of any writer, be he reporter, advertising copy-man, poet, or historian, is swift, lively, accurate observation. And since consciousness is a rapid, shallow river which we can only rarely dam up deep enough to go swimming and take our ease, it is his positive need (unless he is a genius who can afford to let drift away much of his only source of gold) to keep a note-book handy for the sieving and skimming of this running stream. Samuel Butler has good advice on this topic. Of ideas, he says, you must throw salt on their tails or they fly away and you never see their bright plumage again. Poems, stories, epigrams, all the happiest freaks of the mind, flit by on wings and at haphazard instants. They must be caught in air. In this respect one thinks American writers ought to have an advantage over English, for American trousers are made with hip-pockets, in which a small note-book may so comfortably caress the natural curvature of man. Fancy is engendered in the eyes, said Shakespeare, and is with gazing fed. By fancy he meant (I suppose) love; but imagination is also so engendered. Close, constant, vivid, and compassionate gazing at the ways of mankind is the laboratory manual of literature. But for most of us we may gaze until our eyeballs twitch with weariness; unless we seize and hold the flying picture in some steadfast memorandum, the greater part of our experience dissolves away with time. If a man has thought sufficiently about the arduous and variously rewarded profession of literature to propose seriously to follow it for a living, he will already [55]have said these things to himself, with more force and pungency. He may have satisfied himself that he has a necessary desire for \"self-expression,\" which is a parlous state indeed, and the cause of much literary villainy. The truly great writer is more likely to write in the hope of expressing the hearts of others than his own. And there are other desires, too, most legitimate, that he may feel. An English humorist said recently in the preface to his book: \"I wrote these stories to satisfy an inward craving—not for artistic expression, but for food and drink.\" But I cannot conscientiously advise any man to turn to writing merely as a means of earning his victual unless he should, by some cheerful casualty, stumble upon a trick of the You-know-me-Alfred sort, what one might call the Attabuoyant style. If all you want is a suggestion as to some honest way of growing rich, the doughnut industry is not yet overcrowded; and people will stand in line to pay twenty-two cents for a dab of ice-cream smeared with a trickle of syrup. To the man who approaches writing with some decent tincture of idealism it is well to say that he proposes to use as a trade what is, at its best and happiest, an art and a recreation. He proposes to sell his mental reactions to the helpless public, and he proposes not only to enjoy himself by so doing, but to be handsomely recompensed withal. He cannot complain that in days when both honesty and delicacy of mind are none too common we ask him to bring to his task the humility of the tradesman, the joy of the sportsman, the conscience of the artist. [56]And if he does so, he will be in a condition to profit by these fine words of George Santayana, said of the poet, but applicable to workers in every branch of literature: \"He labours with his nameless burden of perception, and wastes himself in aimless impulses of emotion and reverie, until finally the method of some art offers a vent to his inspiration, or to such part of it as can survive the test of time and the discipline of expression.... Wealth of sensation and freedom of fancy, which make an extraordinary ferment in his ignorant heart, presently bubble over into some kind of utterance.\"","sourceLink":"http://novel.tingroom.com/duanpian/3204/87543.html","bookId":759,"book":{"id":759,"title":"Plum Pudding","description":"简介： On Christmas Eve, while the Perfect Reader sits in his armchair immersed in a bookso absorbed that he has let the fire go outI propose to slip gently down the chimney and leave this tribute in his stocking. It is not a personal tribute. I speak, on b...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3204","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
