{"id":26795,"no":19,"title":"1100 WORDS","content":"The managing editor, the city editor, the production manager, the foreman of the composing room, and the leading editorial writer having all said to us with a great deal of sternness, \"Your copy for Saturday has got to be upstairs by such and such a time, because we are going to make up the page at so and so a.m.,\" we got rather nervous. If we may say so, we did not like the way they said it. They spoke—and we are thinking particularly of the production manager—with a kind of paternal severity that was deeply distressing to our spirit. They are all, in off hours, men of delightfully easy disposition. They are men with whom it would be a pleasure and a privilege to be cast away on a desert island or in a [111]crowded subway train. It is only just to say that they are men whom we admire greatly. When we meet them in the elevator, or see them at Frank\u0027s having lunch, how full of jolly intercourse they are. But in the conduct of their passionate and perilous business, that is, of getting the paper out on time, a holy anguish shines upon their brows. The stern daughter of the voice of God has whispered to them, and they pass on the whisper to us through a mega-phone. That means to say that within the hour we have got to show up something in the neighbourhood of 1100 words to these magistrates and overseers. With these keys—typewriter keys, of course—we have got to unlock our heart. Milton, thou shouldst be living at this hour. Speaking of Milton, the damp that fell round his path (in Wordsworth\u0027s sonnet) was nothing to the damp that fell round our alert vestiges as we hastened to the Salamis station in that drench this morning. (We ask you to observe our self-restraint. We might have said \"drenching downpour of silver Long Island rain,\" or something of that sort, and thus got several words nearer our necessary total of 1100. But we scorn, even when writing against time, to take petty advantages. Let us be brief, crisp, packed with thought. Let it stand as drench, while you admire our proud conscience.) Eleven hundred words—what a lot could be said in 1100 words! We stood at the front door of the baggage car (there is an odd irony in this: the leading editorial writer, one of the most implacable of our [112]taskmasters, is spending the summer at Sea Cliff, and he gets the last empty seat left in the smoker. So we, getting on at Salamis, have to stand in the baggage car) watching the engine rock and roar along the rails, while the rain sheeted the level green fields. It is very agreeable to ride on a train in the rain. We have never known just why, but it conduces to thought. The clear trickles of water are drawn slantwise across the window panes, and one watches, absently, the curious behaviour of the drops. They hang bulging and pendulous, in one spot for some seconds. Then, as they swell, suddenly they break loose and zigzag swiftly down the pane, following the slippery pathway that previous drops have made. It is like a little puzzle game where you man?uvre a weighted capsule among pegs toward a narrow opening. \"Pigs in clover,\" they sometimes call it, but who knows why? The conduct of raindrops on a smoking-car window is capricious and odd, but we must pass on. That topic alone would serve for several hundred words, but we will not be opportunist. We stood at the front door of the baggage car, and in a pleasant haze of the faculties we thought of a number of things. We thought of some books we had seen up on East Fifty-ninth Street, in that admirable row of old bookshops, particularly Mowry Saben\u0027s volume of essays, \"The Spirit of Life,\" which we are going back to buy one of these days; so please let it alone. We then got out a small note-book in which we keep memoranda of books we intend to read and pored over it zealously. Just for [113]fun, we will tell you three of the titles we have noted there: \"The Voyage of the Hoppergrass,\" by E.L. Pearson. \"People and Problems,\" by Fabian Franklin. \"Broken Stowage,\" by David W. Bone. But most of all we thought, in a vague sentimental way, about that pleasant Long Island country through which the engine was haling and hallooing all those carloads of audacious commuters. Only the other day we heard a wise man say that he did not care for Long Island, because one has to travel through a number of half-built suburbs before getting into real country. We felt, when he said it, that it would be impossible for us to tell him how much some of those growing suburbs mean to us, for we have lived in them. There is not one of those little frame dwellings that doesn\u0027t give us a thrill as we buzz past them. If you voyage from Brooklyn, as we do, you will have noticed two stations (near Jamaica) called Clarenceville and Morris Park. Now we have never got off at those stations, though we intend to some day. But in those rows of small houses and in sudden glimpses of modest tree-lined streets and corner drug stores we can see something that we are not subtle enough to express. We see it again in the scrap of green park by the station at Queens, and in the brave little public library near the same station—which we cannot see from the train, though we often try to; but we know it is there, and probably the same kindly lady librarian and the children borrowing books. We see it again—or [114]we did the other day—in a field at Mineola where a number of small boys were flying kites in the warm, clean, softly perfumed air of a July afternoon. We see it in the vivid rows of colour in the florist\u0027s meadow at Floral Park. We don\u0027t know just what it is, but over all that broad tract of hardworking suburbs there is a secret spirit of practical and persevering decency that we somehow associate with the soul of America. We see it with the eye of a lover, and we know that it is good. Having got as far as this, we took the trouble to count all the words up to this point. The total is exactly 1100. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3204/87552.html","bookId":759,"book":{"id":759,"title":"Plum Pudding","description":"简介： On Christmas Eve, while the Perfect Reader sits in his armchair immersed in a bookso absorbed that he has let the fire go outI propose to slip gently down the chimney and leave this tribute in his stocking. It is not a personal tribute. I speak, on b...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3204","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
