{"id":77415,"no":12,"title":"Page 12","content":"\"Merripen.\" Win stood at the front threshold of the cottage, hesitating to come in. There was such a queer look on her face that Kev rose to his feet at once.\n He was bone-weary and dirty, having just come in from working all day at a neighbor\u0027s house, building a gate and fence around their yard. To set the fence posts, Kev had dug holes in ground that had already been permeated with the frost of approaching winter. He had just sat down at the table with Amelia, who was attempting to clean spots from one of Poppy\u0027s dresses with a quill dipped in spirit of turpentine. The scent of the chemical burned in Kev\u0027s nostrils as he drew in a quick breath. He knew from Win\u0027s expression that something was very wrong.\n \"I\u0027ve been with Laura and Leo today,\" Win said. \"Laura took ill earlier… She said her throat hurt, and her head, and so we took her home at once and her family sent for the doctor. He said it was scarlet fever.\"\n \"Oh God,\" Amelia breathed, the color draining from her face. The three of them were silent with shared horror.\n There was no other fever that burned so violently or spread so quickly. It provoked a brilliant red rash from the skin, imparting a fine, gritty texture like the glass paper used to smooth pieces of wood. And it burned and ravaged its way through the body until the organs failed. The disease lingered in the expired air, in locks of hair, on the skin itself. The only way to protect others was to isolate the patient.\n \"Was he certain?\" Kev asked in a controlled voice. \"Yes, he said the signs are unmistakable. And he said-\"\n Win broke off as Kev strode toward her. \"No, Merripen!\" And she held up a slim white hand with such desperate authority that it stopped him in his tracks. \"No one must come near me. Leo is at Laura\u0027s house. He won\u0027t leave her. They said it was all right for him to stay, and… you must gather up Poppy and Beatrix, and Amelia, too, and take them to our cousins in Hedgerley. They won\u0027t like it, but they\u0027ll take them in and-\"\n \"I\u0027m not going anywhere,\" Amelia said, her manner calm even though she was trembling slightly. \"If you have the fever, you\u0027ll need me to take care of you.\"\n \"But if you should catch it-\"\n \"I had a very mild bout of it when I was a young child. That means I\u0027m probably safe from it now.\"\n \"What about Leo?\"\n \"I\u0027m afraid he didn\u0027t have it. Which may put him in danger.\" Amelia glanced at Kev. \"Merripen, did you ever-\"\n \"I don\u0027t know.\"\n \"Then you should stay away with the children until this is over. Will go you collect them? They went out to play at the winterbourne. I\u0027ll pack their things.\"\n Kev found it nearly impossible to leave Win when she might be ill. But there was no choice. Someone had to take her sisters to a safe place.\n Before an hour had passed, Kev had found Beatrix and Poppy, loaded the bewildered girls into the family carriage, and taken them on the half-day journey to Hedgerley. By the time he had settled them with their cousins and returned to the cottage, it was well past midnight.\n Amelia was in the parlor, wearing her nightclothes and dressing robe, her hair trailing down her back in a long braid. She sat before the fire, her shoulders hunched inward.\n She looked up with surprise as Kev entered the house. \"You shouldn\u0027t be here. The danger-\"\n \"How is she?\" Kev interrupted. \"Any sign of fever yet?\"\n \"Chills. Pains. No rise in temperature, as far as I can tell. Perhaps that\u0027s a good sign. Perhaps that means she\u0027ll only have it lightly.\"\n \"Any word from the Dillards? From Leo?\"\n Amelia shook her head. \"Win said he meant to sleep in the parlor, and go to her whenever they would allow it. It isn\u0027t at all proper, but if Laura… well, if she doesn\u0027t live through this…\" Amelia\u0027s voice thickened, and she paused to swallow back tears. \"I suppose if it comes to that, they wouldn\u0027t want to deprive Laura of her last moments with the man she loves.\"\n Kev sat nearby and silently sorted through platitudes he\u0027d heard gadje say to one another. Things about endurance, and accepting the Almighty\u0027s will, and about worlds far better than this one. He couldn\u0027t bring himself to repeat any of it to Amelia. Her grief was too honest, her love for her family too real.\n \"It\u0027s too much,\" he heard Amelia whisper after a while. \"I can\u0027t bear losing anyone else. I\u0027m so afraid for Win. I\u0027m afraid for Leo.\" She rubbed her forehead. \"I sound like the rankest coward, don\u0027t I?\"\n Kev shook his head. \"You would be a fool not to be afraid.\"\n That elicited a small, dry chuckle. \"I am definitely not a fool, then.\"\n By morning Win was flushed and feverish, her legs moving restlessly beneath the covers. Kev went to a window and drew open the curtain, admitting the weak light of dawn.\n She awakened as he approached the bed, her blue eyes wide in her red-burnished face. \"No,\" she croaked, trying to shrink away from him. \"You\u0027re not supposed to be here. Don\u0027t come near me; you\u0027ll catch it. Please go-\"\n \"Quiet,\" Kev said, sitting on the edge of the mattress. He caught Win as she tried to roll away, and settled his hand on her forehead. He felt the burning pulse beneath her fragile skin, the veins lit with raging fever.\n As Win struggled to push him away, Kev was alarmed by how feeble she had grown. Already.\n \"Don\u0027t,\" she sobbed, writhing. Weak tears slid from her eyes. \"Please don\u0027t touch me. I don\u0027t want you here. I don\u0027t want you to get sick. Oh, please go…\" \n","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-12.html","bookId":1786,"book":{"id":1786,"title":"Seduce Me at Sunrise (The Hathaways #2)","description":"Storyline: \n He has tried hard to forget her. \n Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. \n Can she remember the man he once was? \n Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...\n \n","cover":"https://allnovel.net/images/seduce-me-at-sunrise-the-hathaways-2.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:34:46 PM"}}
