{"id":77431,"no":29,"title":"Page 29","content":"Prudently the man had rushed behind a heavy chair, placing it between them. \"You must be Merripen,\" he said. \"And I\u0027m-\"\n \"A dead man,\" Kev growled, starting for him.\n \"He\u0027s my doctor!\" Win cried. \"He\u0027s Dr. Harrow, and-Merripen, don\u0027t you dare hurt him!\"\n Ignoring her, Kev went forward about two strides before he felt a leg hook around his, sending him hurtling to the floor. It was Cam Rohan, who pounced on him, knelt on his arms, and gripped the back of his neck.\n \"Merripen, you idiot,\" Rohan said, struggling to keep him down, \"he\u0027s the damned doctor. What do you think you\u0027re doing?\"\n \"Killing… him Kev grunted, lurching upward despite Rohan\u0027s restraining weight.\n \"Bloody hell!\" Rohan exclaimed. \"Leo, help me hold him! Now.\"\n Leo rushed over to help. It took both of them to keep Merripen down.\n \"I love our family gatherings,\" he heard Leo say. \"Merripen, what the devil is your problem?\"\n \"Win is in her underclothes, and that man-\"\n \"These are not my underclothes,\" came Win\u0027s exasperated voice. \"This is an exercise costume!\"\n Merripen twisted to look in her direction. Since Rohan and Leo were still pinning him down, he couldn\u0027t look all the way up. But he saw that Win was clad in loose-fitting drawers and a bodice with bare arms. \"I know underclothes when I see them,\" he snapped.\n \"These are Turkish trousers, and a perfectly respectable bodice. Every woman at the clinic wears this same costume. Exercising is necessary for my health, and I am certainly not going to do it in a gown and cors-\"\n \"He was touching you!\" Kev interrupted harshly.\n \"He was making certain that I had the correct form.\"\n The doctor approached with caution. There was a flicker of humor in his alert gray eyes. \"It\u0027s a Hindu exercise, actually. It\u0027s part of a strength-training system I\u0027ve developed. All my patients have incorporated it into their daily schedules. Please believe that my attentions to Miss Hathaway were entirely respectful.\" He paused and asked wryly, \"Am I safe now?\"\n Leo and Cam, still struggling with Kev, both answered simultaneously, \"No.\"\n By this time, Poppy, Beatrix, and Miss Marks had hurried into the room.\n \"Merripen,\" Poppy said, \"Dr. Harrow wasn\u0027t hurting Win a bit, and-\"\n \"He\u0027s really very nice, Merripen,\" Beatrix chimed in. \"Even my animals like him.\"\n \"Easy,\" Rohan said quietly to Kev, speaking in Romany so that no one else could understand. \"This is no good for anyone.\"\n Kev went still. \"He was touching her,\" he replied in the old language, even though he hated using it.\n And he knew Rohan understood that a Rom found it difficult, even impossible, to tolerate any other man putting a hand on his woman, for any reason.\n \"She\u0027s not yours, phral\" Rohan said in Romany, not without sympathy.\n Slowly Kev forced himself to relax.\n \"May I get off him now?\" Leo asked. \"There\u0027s only one kind of exertion I enjoy before breakfast. And this is not it.\"\n Rohan allowed Kev to stand but kept one arm twisted behind his back.\n Win went to stand beside Harrow. The sight of her wearing so little, being so near another man, caused muscles to twitch all over Kev\u0027s body. He could see the shape of her h*ps and legs. The entire family had gone insane, letting her dress that way in front of an outsider and acting as though it were appropriate. Turkish trousers… as if giving them such a name made them anything but underdrawers.\n \"I insist that you apologize,\" Win said. \"You\u0027ve been very rude to my guest, Merripen.\"\n Her guest? Kev stared at her in outrage.\n \"No need,\" Harrow said hastily. \"I know how it must have appeared.\"\n Win glared at Kev. \"He has made me well again, and this is the way you repay him?\" she demanded.\n \"You made yourself well,\" Harrow said. \"It was a result of your own efforts, Miss Hathaway.\"\n Win\u0027s expression softened as she glanced at the doctor. \"Thank you.\" But when she looked back at Kev, the frown returned. \"Are you going to apologize, Merripen?\"\n Rohan twisted his arm a bit more tighdy. \"Do it, damn you,\" Rohan muttered. \"For the sake of the family.\"\n Glaring at the doctor, Kev spoke in Romany. \"Ka xlia ma pe tute.\" (I\u0027m going to shit on you.)\n \"Which means,\" Rohan said hastily, \" \u0027Please forgive the misunderstanding; let\u0027s part as friends.\u0027\"\n \"Te malavel les i menkiva,\" Kev added for good measure. (May you die of a malignant wasting disease.)\n \"Roughly translated,\" Rohan said, \"that means, \u0027May your garden be filled with fine, fat hedgehogs.\u0027 Which, I may add, is considered quite a blessing among the Rom. \"\n Harrow looked skeptical. But he murmured, \"I accept your apology. No harm done.\"\n \"Excuse us,\" Rohan said pleasantly, still twisting Kev\u0027s arm. \"Go on with breakfast, please… We have some errands to accomplish. Please tell Amelia when she rises that I\u0027ll return at approximately midday.\" And he steered Kev from the room, with Leo at their heels.\n As soon as they were out of the suite and in the hallway, Rohan released Kev\u0027s arm and turned to face him. Raking his hand through his hair, Rohan asked with mild exasperation, \"What did you hope to get out of killing Win\u0027s doctor?\" \n","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-29.html","bookId":1786,"book":{"id":1786,"title":"Seduce Me at Sunrise (The Hathaways #2)","description":"Storyline: \n He has tried hard to forget her. \n Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. \n Can she remember the man he once was? \n Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...\n \n","cover":"https://allnovel.net/images/seduce-me-at-sunrise-the-hathaways-2.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:34:46 PM"}}
