{"id":77445,"no":43,"title":"Page 43","content":"Cam stared at him intently. \"My sister-in-law will find it a disappointment, to say the least.\"\\n\\n \"Yes. But Miss Hathaway will live longer and enjoy a higher quality of life as a childless woman. And she will learn to accept her altered circumstances. That is her strength.\" He swallowed some brandy before continuing quietly, \"Miss Hathaway was probably never destined for childbearing, even before the scarlet fever. Such a narrow frame. Elegant, but hardly ideal for breeding purposes.\"\\n\\n Kev tossed back his brandy, letting the amber fire wash down his throat. He pushed back from the table and stood, unable to bear another moment of the bastard\u0027s proximity. The mention of Win\u0027s \"narrow frame\" had been the last straw. Excusing himself with a rough mutter, he walked out of the hotel and into the night. His senses drew in the cool air, the foul, sharp city smells, the stirrings and rattlings and cries of the London night coming to life. Christ, he wanted to be away from this place.\\n\\n He wanted to take Win to the country with him, to some place that was fresh and wholesome. Away from the gleaming Dr. Harrow, whose clean, fastidious perfection filled Kev with dread. Every instinct warned that Win wasn\u0027t safe from Harrow.\\n\\n But she wasn\u0027t safe from him, either.\\n\\n His own mother had died giving birth. The thought of killing Win with his own body, his spawn swelling inside her until-\\n\\n His entire being shied at the thought. His deepest terror was harming her. Losing her.\\n\\n Kev wanted to talk to her, to listen to her, help her somehow to come to terms with the limitations she\u0027d been given. But he\u0027d put a barrier between them, and he didn\u0027t dare cross it. Because if Harrow \u0027s flaw was a lack of empathy, Kev\u0027s was just the opposite. Too much feeling, too much need.\\n\\n Enough to kill her.\\n\\n Later that evening Cam came to Kev\u0027s room. Kev had just returned from his walk, a glaze of evening mist still clinging to his coat and hair.\\n\\n Answering the knock at the door, Kev stood at the threshold and scowled. \"What is it?\"\\n\\n \"I had a private talk with Harrow,\" Cam said, his face expressionless.\\n\\n \"And?\"\\n\\n \"He wants to marry Win. But he intends the marriage to be in name only. She doesn\u0027t know it yet.\"\\n\\n \"Bloody hell,\" Kev muttered. \"She\u0027ll be the latest addition to his collection of fine objects. She\u0027ll stay chaste while he has his affairs-\"\\n\\n \"I don\u0027t know her well,\" Cam murmured, \"but I don\u0027t think she would ever agree to such an arrangement. Especially if you offered her an alternative, phral.\"\\n\\n \"There is only one alternative, and that is to stay safe with her family.\"\\n\\n \"There\u0027s one more. You could offer for her.\"\\n\\n \"That\u0027s not possible.\"\\n\\n \"Why not?\"\\n\\n Kev felt his face burn. \"I couldn\u0027t stay celibate with her. I could never hold to it.\"\\n\\n \"There are ways to prevent conception.\"\\n\\n That elicited a contemptuous snort from Kev. \"That worked well for you, didn\u0027t it?\" He rubbed his face wearily. \"You know the other reasons I can\u0027t offer for her.\"\\n\\n \"I know the way you once lived,\" Cam said, choosing his words with obvious care. \"I understand your fear of harming her. But in spite of all that, I find it hard to believe that you would really let her go to another man.\"\\n\\n \"I would if that was best for her.\"\\n\\n \"Can you actually say that the best Winnifred Hathaway deserves is someone like Harrow?\"\\n\\n \"Better him,\" Kev managed to say, \"than someone like me.\"\\n\\n Although the social season was not yet over, it was agreed that the family would go to Hampshire. There was Amelia\u0027s condition to consider-she would be better off in the healthful surroundings-and Win and Leo wanted to see the Ramsay estate. The only question was the fairness of depriving Poppy and Beatrix of the remainder of the season. But they both claimed to be quite happy to quit London.\\n\\n This attitude was not unexpected coming from Beatrix, who still seemed far more interested in books and animals and romping through the countryside like a wild creature. But Leo was surprised that Poppy, who was candid about wanting to find a husband, would be so willing to depart.\\n\\n \"I\u0027ve seen all this season\u0027s prospects,\" Poppy told Leo grimly as they rode through Hyde Park in an open carriage. \"Not one of them is worth staying in town for.\"\\n\\n Beatrix sat in the opposite seat, with Dodger the ferret curled in her lap. Miss Marks had wedged herself in the corner, her bespectacled gaze fixed on the scenery.\\n\\n Leo had rarely encountered such an off-putting female. Abrasive, pale, her form an accumulation of pointy elbows and angular bones, her character stiff and knotty and dry.\\n\\n Clearly Catherine Marks hated men. Which Leo wouldn\u0027t have blamed her for, since he was well aware of the faults of his gender. Except that she didn\u0027t seem to like women very much, either. The only people she seemed to unbend with were Poppy and Beatrix, who had reported that Miss Marks was exceptionally intelligent and could be very witty at times, and she had a lovely smile.\\n\\n Leo had a difficult time imagining the tight little seam of Miss Marks\u0027s mouth curving in a smile. He rather doubted she even had teeth, since he had never seen them.\\n\\n \"She\u0027ll ruin the view,\" he had complained that morning, when Poppy and Beatrix had told him they were bringing him on their drive. \"I won\u0027t enjoy the scenery with the Grim Reaper casting her shadow over it.\"\\n\\n \"Don\u0027t call her such horrid names, Leo,\" Beatrix had protested. \"I like her very much. And she\u0027s very nice when you\u0027re not around.\" \\n\\n","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-43.html","bookId":1786,"book":{"id":1786,"title":"Seduce Me at Sunrise (The Hathaways #2)","description":"Storyline: He has tried hard to forget her. \\n Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. \\n Can she remember the man he once was? \\n Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...\\n","cover":"https://allnovel.net/images/seduce-me-at-sunrise-the-hathaways-2.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:34:46 PM"}}
