{"id":77459,"no":57,"title":"Page 57","content":"Merripen, despite his fear of heights, had often climbed a ladder to wash the second-floor window for her. He had wanted her view of the outside world to be clear.\n He had said the sky should always be blue for her.\n \"You\u0027re fond of birds, Miss Hathaway?\" the housekeeper asked.\n Win nodded without looking around, afraid that her face was red with unexpressed emotion. \"Robins especially,\" she half-whispered.\n \"A footman will bring your trunks up soon, and one of the maids will unpack them. In the meantime, if you would like to wash, there is fresh water at the wash-stand.\"\n \"Thank you.\" Win went to the porcelain pitcher and basin and sluiced clumsy handfuls of cooling water on her face and throat, heedless of the drips that fell onto her bodice. Blotting her face with a cloth, she felt only momentary relief from the aching heat that had suffused her.\n Hearing the creak of a floorboard, Win turned sharply. Merripen was at the threshold, watching her. The damnable flush wouldn\u0027t stop. She wanted to be on the other side of the world from him. She wanted never to see him again. And at the same time her senses pulled him in greedily… the sight of him in an open-throated shirt, white linen clinging to the nutmeg tan of his skin… the short dark layers of his hair, the scent of his exertions reaching her prickling nostrils. The sheer size and presence of him paralyzed her with need. She wanted the taste of his skin against her lips. She wanted to feel the throb of his pulse against her own. If only he would come to her just as he was, this moment, and crush her onto the bed with his hard, heavy body, and take her. Ruin her.\n \"How was the journey from London?\" he asked, his face expressionless.\n \"I\u0027m not going to make pointless conversation with you.\" Win went to the window and focused blindly on the dark woodland in the distance.\n \"Is the room to your liking?\"\n She nodded without looking at him.\n \"If there is anything you need-\"\n \"I have everything I need,\" she interrupted. \"Thank you.\"\n \"I want to talk to you about the other-\"\n \"That\u0027s quite all right,\" she said, managing to sound composed. \"You don\u0027t need to come up with excuses about why you didn\u0027t offer for me.\"\n \"I want you to understand-\"\n \"I do understand. And I\u0027ve already forgiven you. Perhaps it will ease your conscience to hear that I\u0027ll be much better off this way.\"\n \"I don\u0027t want your forgiveness,\" he said curtly.\n \"Fine, you\u0027re not forgiven. Whatever pleases you.\" She couldn\u0027t bear to be alone with him for another moment. Her heart was breaking; she could feel it fracturing. Putting her head down, she began to walk past his motionless form.\n Win didn\u0027t intend to stop. But before she crossed the threshold, she halted within arm\u0027s length of him. There was one thing she wanted to tell him. The words would not be contained.\n \"Incidentally,\" she heard herself say tonelessly, \"I went to visit a London doctor yesterday. A highly respected one. I told him my medical history, and I asked if he would evaluate my general state of health.\" Aware of the intensity of Merripen\u0027s gaze, Win continued evenly. \"In his professional opinion, there is no reason I shouldn\u0027t have children if I want them. He said there is no guarantee for any woman that childbirth will be free of risk. But I will lead a full life. I will have marital relations with my husband, and God willing, I will become a mother someday.\" She paused, and added in a bitter voice that didn\u0027t sound at all like her own, \"Julian will be so pleased when I tell him, don\u0027t you think?\"\n If the jab had pierced through Merripen\u0027s guard, there was no sign of it. \"There is something you need to know about him,\" Merripen said quietly. \"His first wife\u0027s family-the Lanhams-suspect he had something to do with her death.\"\n Win\u0027s head whipped around, and she stared at Merripen with narrowed eyes. \"I can\u0027t believe you would sink so low. Julian told me all about it. He loved her. He did everything he could to bring her through the illness. When she died, he was devastated, and then he was victimized further by her family. In their grief, they needed someone to blame. Julian was a convenient scapegoat.\"\n \"The Lanhams claim he behaved suspiciously after her death. He didn\u0027t fit anyone\u0027s idea of a bereaved husband.\"\n \"Not all people show their grief in the same way,\" she snapped. \"Julian is a doctor-he has trained himself to be impassive in the course of his work, because that is best for his patients. Naturally he wouldn\u0027t let himself fall apart, no matter how deep his sorrow. How dare you judge him?\"\n \"Don\u0027t you realize you may be in danger?\"\n \"From Julian\u0027? The man who made me well?\" She shook her head with a disbelieving laugh. \"For the sake of our past friendship, I\u0027m going to forget you said anything about this, Kev. But remember in the future that I will not tolerate any insult to Julian. Remember that he stood by me when you did not.\"\n She brushed by him without waiting for his reaction, and saw her older sister coming along the hallway. \"Amelia,\" she said brightly. \"Shall we begin the tour now? I want to see everything.\"\n Chapter Sixteen\n Although Merripen had made it clear to the Ramsay household that Leo, not he, was master, the servants and laborers still considered him the authority. Merripen was the one they first approached with all concerns. And Leo was content to let it remain so while he familiarized himself with the reinvigorated estate and its inhabitants. \n","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-57.html","bookId":1786,"book":{"id":1786,"title":"Seduce Me at Sunrise (The Hathaways #2)","description":"Storyline: \n He has tried hard to forget her. \n Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. \n Can she remember the man he once was? \n Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...\n \n","cover":"https://allnovel.net/images/seduce-me-at-sunrise-the-hathaways-2.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:34:46 PM"}}
