{"id":77411,"no":8,"title":"Page 8","content":"Kev wasn\u0027t flinching because of the tangles, or the comb. It was that he had never been touched for so long by anyone in his life. He was mortified, inwardly alarmed… but as he glanced warily around the room, it seemed no one minded or cared about what Win was doing. He settled back with slitted eyes. The comb tugged a little too hard, and Win murmured an apology and rubbed the smarting spot with her fingertips. So gently. It made his throat tight and his eyes sting. Deeply disquieted, bewildered, Kev swallowed back the feeling. He stayed tense but passive beneath her touch. He could hardly breathe for the pleasure she gave him. Next came a cloth draped around his neck, and the scissors. \"I\u0027m very good at this,\" Win said, pushing his head forward and combing the locks at the back of his neck. \"And your hair wants cutting. There\u0027s enough wool on your head to stuff a mattress.\" \"Beware, lad,\" Mr. Hathaway said cheerfully. \"Recollect what happened to Samson.\" Kev\u0027s head lifted. \"What?\" Win pushed it back down. \"Samson\u0027s hair was his source of strength,\" she said. \"After Delilah cut it, he turned weak and was captured by the Philistines.\" \"Haven\u0027t you read the Bible?\" Poppy asked. \"No,\" Kev said. He held still as the scissors bit carefully through the thick waves at his nape. \"Then you\u0027re a heathen?\" \"Yes.\" \"Are you the kind that eats people?\" Beatrix asked with great interest. Win answered before Kev could say anything. \"No, Beatrix. One may be a heathen without being a cannibal.\" \"But Gypsies do eat hedgehogs,\" Beatrix said. \"And that\u0027s just as bad as eating people. Because hedgehogs do have feelings, you know.\" She paused as a heavy lock of black hair fell to the floor. \"Oooooh, how pretty!\" the little girl exclaimed. \"May I have it, Win?\" \"No,\" Merripen said gruffly, his head still bent. \"Why ever not?\" Beatrix asked. \"Someone could use it to make a bad-luck charm. Or a love spell.\" \"Oh, I wouldn\u0027t do that,\" Beatrix said earnestly. \"I just want to line a nest with it.\" \"Never mind, darling,\" Win said serenely. \"If it makes our friend uncomfortable, your pets will have to make do with some other nesting material.\" The scissors snipped through another heavy black swath. \"Are all Gypsies as superstitious as you?\" she asked Kev. \"No. Most are worse.\" Her light laugh tickled his ear, her warm breath bringing goosefiesh to the surface. \"Which would you hate more, Merripen… the bad luck, or the love spell?\" \"The love spell,\" he said without hesitation. For some reason the entire family laughed. Merripen glowered at all of them but found no mockery in their collective gaze, only friendly amusement. Kev was quiet, listening to them chatter while Win cut layers in his hair. It was the oddest conversation he\u0027d ever witnessed, the girls interacting freely with their brother and father. They all moved from one subject to another, debating ideas that didn\u0027t apply to them, situations that didn\u0027t affect them. There was no point to any of it, but they seemed to enjoy themselves tremendously. He had never known people like this existed. He had no idea how they had survived this long. The Hathaways were an unworldly lot, eccentric and cheerful and preoccupied with books and art and music. They lived in a ramshackle cottage, but instead of repairing door frames or holes in the ceiling, they pruned roses and wrote poetry. If a chair leg broke off, they merely wedged a stack of books beneath it. Their priorities were a mystery to him. And he was mystified still further when, after his wounds had healed sufficiently, they invited him to make a room for himself in the stable loft. \"You may stay as long as you wish,\" Mr. Hathaway had told him, \"though I expect that someday you\u0027ll want to strike out in search of your tribe.\" But Kev no longer had a tribe. They had left him for dead. This was his stopping place. He began to take care of the things the Hathaways had paid no attention to, such as repairing the holes in the ceiling and the decaying joints beneath the chimney stack. Despite his terror of heights, he did new coat work on the thatched roof. He took care of the horse and the cow, and tended the kitchen garden, and even mended the family\u0027s shoes. Soon Mrs. Hathaway trusted him to take money to the village to buy food and other necessities. There was only one time that his presence at the Hathaway cottage seemed in jeopardy, and that was when he had been caught fighting some village toughs. Mrs. Hathaway was alarmed by the sight of him, battered and bloody-nosed, and had demanded to know how it had happened. \"I sent you to fetch a round from the cheesemaker, and you come home empty-handed, and in such a condition,\" she cried. \"What violence did you do, and why?\" Kev hadn\u0027t explained, only stood grim-faced at the door as she berated him. \"I won\u0027t tolerate brutality in this household. If you can\u0027t bring yourself to explain what happened, then collect your things and leave.\" But before Kev could move or speak, Win had entered the house. \"No, Mother,\" she had said calmly. \"I know what happened-my friend Laura just told me. Her brother was there. Merripen was defending our family. Two other boys were shouting insults about the Hathaways, and Merripen thrashed them for it.\" \"Insults of what nature?\" Mrs. Hathaway asked, bewildered. Kev stared hard at the floor, his fists clenched.","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-8.html","bookId":1786,"book":{"id":1786,"title":"Seduce Me at Sunrise (The Hathaways #2)","description":"Storyline: He has tried hard to forget her. Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. Can she remember the man he once was? Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...","cover":"https://allnovel.net/images/seduce-me-at-sunrise-the-hathaways-2.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:34:46 PM"}}
