{"id":77491,"no":90,"title":"Page 90","content":"Music from guitars and violins filled the ballroom, while the guests gathered in a circle. Dressed in a loose white shirt, leather breeches and boots, and a red sash knotted at the side of his waist, Cam went to the center of the circle. He held a bottle wrapped in bright silk, the neck of it wrapped with a string of gold coins. He gestured for everyone to be quiet, and the music obligingly settled into a vibrant lull. Enjoying the colorful tumult of the gathering, Win stood beside Merripen and listened as Cam made several remarks in Romany. Unlike his brother, Merripen wore gadjo attire, except that he had left off a cravat and collar. The glimpses of his smooth brown throat beguiled Win. She wanted to put her lips to the spot where a steady pulse lurked. Instead, she contented herself with the discreet brush of his fingers against hers. Merripen was rarely given to public demonstrations. In private, however… She felt his hand wrap slowly around hers, his thumb stroking the tender flesh just above her palm. Finishing the short speech, Cam came to Win. Deftly he removed the coins from the bottle and placed them around her neck. They were heavy and cool against her skin, settling in a jubilant clatter. The necklace advertised that she was now betrothed, and any man other than Merripen would now approach her at his own peril. Smiling, Cam embraced Win firmly, murmured something affectionate in her ear, and gave her the bottle to drink from. She took a cautious sip of strong red wine, and gave the bottle to Merripen, who drank after her. Meanwhile, wine in liberally filled goblets was given to all the guests. There were various cries of \"Sastimos,\" or good health, as they drank in honor of the betrothed couple. The celebration began in earnest. Music flared into life and the goblets were quickly drained. \"Dance with me,\" Merripen surprised her by murmuring. Win shook her head with a little laugh, watching the couples twirl and move sinuously around each other. Women used their hands in shimmering motions around their bodies, while men stomped with their heels and clapped their hands, and all the while they circled each other while holding each other\u0027s gaze as long as possible. \"I don\u0027t know how,\" Win said. Merripen stood behind her and crossed his arm around her front, drawing her back against him. Another surprise. She had never known him to touch her so openly. But amid the goings-on, it seemed no one noticed or cared. His voice was hot and soft in her ear. \"Watch for a moment. You see how little space is needed? How they circle each other? When Roma dance they lift their hands to the sky, but they stomp their feet to express connection to the earth. And to earthly passions.\" He smiled against her cheek and gently turned her to face him. \"Come,\" he murmured, and hooked his hand around her waist to urge her forward. Win followed him shyly, fascinated by a side of him she hadn\u0027t seen before. She wouldn\u0027t have expected him to be this self-assured, drawing her into the dance with animal grace, watching her with a wicked gleam in his eyes. He coaxed her to raise her arms upward, to snap her fingers, even to swish her skirts at him as he moved around her. She couldn\u0027t seem to stop giggling. They were dancing, and he was so good at it, turning it into a cat-and-mouse game. She twirled in a circle, and he caught her around the waist, pulling her close for one scalding moment. The scent of his skin, the movement of his chest against hers, filled her with intense desire. Leaning his forehead against hers, Merripen stared at her until she was drowning in the depths of his eyes, as dark and bright as hellfire. \"Kiss me,\" she whispered unevenly, not caring where they were or who might see them. A smile touched his lips. \"If I start now, I won\u0027t be able to stop.\" The spell was broken by an apologetic throat clearing from nearby. Merripen glanced to the side, where Cam was standing. Cam \u0027s face was carefully blank. \"My apologies for interrupting. But Mrs. Barnstable just came to me with the news that an unexpected guest has arrived.\" \"More family?\" \"Yes. But not from the Romany side.\" Merripen shook his head, perplexed. \"Who is it?\" Cam swallowed visibly. \"Lord Cavan. Our grandfather.\" It was decided that Cam and Kev would meet Cavan with no other family members present. While the pliashka continued in full vigor, the brothers withdrew to the library and waited. Two footmen dashed back and forth, bringing in objects from a carriage outside: cushions, a velvet-covered footstool, a lap blanket, a foot warmer, a silver tray bearing a cup. After a multitude of preparations was made, Cavan was announced by one of the footmen, and he entered the room. The old Irish earl was physically unimposing, old and small and slight. But Cavan had the presence of a deposed monarch, a faded grandeur textured with weary pride. A frill of white hair had been cut to lie against his ruddy scalp, and a goatee framed his chin like a lion\u0027s whiskers. His shrewd brown eyes assessed the young men dispassionately. \"You are Kevin and Cameron Cole,\" he said rather than asked in a flowing Anglo-Irish accent, the syllables graceful and lightly arid. Neither of them replied. \"Who is the elder?\" Cavan asked, seating himself in an upholstered chair. A footman immediately arranged a footstool beneath his heels. \"He is,\" Cam said, helpfully pointing at Kev, while Kev gave him a sideways glare. Ignoring the look, Cam spoke casually. \"How did you find us, my lord?\" \"A heraldic master recently approached me in London with the information that you had hired him to research a particular design. He had identified it as the Coles\u0027 ancient mark. When he showed me the sketch he\u0027d made of the tattoo on your arm, I knew at once who you were, and why you wanted the design researched.\"","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-90.html","bookId":1786,"book":{"id":1786,"title":"Seduce Me at Sunrise (The Hathaways #2)","description":"Storyline: He has tried hard to forget her. Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. Can she remember the man he once was? Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...","cover":"https://allnovel.net/images/seduce-me-at-sunrise-the-hathaways-2.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:34:46 PM"}}
