{"id":13154,"no":10,"title":"STRANDED","content":"“Aucun chemin de fleurs ne conduit a la gloire.” It was nearly half-past eight when the Grandhaven ran into a fog-bank, and the second officer sent a message to the captain\u0027s steward, waiting at that great man\u0027s dinner-table in the saloon. The captain\u0027s steward was a discreet man. He gave the message in a whisper as he swept the crumbs from the table with a jerk of his napkin. The second officer could not, of course, reduce speed on his own responsibility. The Grandhaven had been running through fog-banks ever since she left Plymouth in the grey of a November afternoon. Every Atlantic traveller knows the Grandhaven. She was so well known that every berth was engaged despite the lateness of the season. It was considered a privilege to sail with Captain Dixon, the most popular man on the wide seas. A few millionaires considered themselves honoured by his friendship. One or two of them called him Tom on shore. He was an Englishman, though the Grandhaven was technically an American ship. His enemies said that he owed his success in life to his manners, which certainly were excellent. Not too familiar with any one at sea, but unerringly discriminating between man and man, between a real position and an imaginary one. For, in the greatest Republic the world has yet seen, men are keenly alive to social distinctions. On the other hand, his friends pointed to his record. Captain Dixon had never made a mistake in seamanship. He was a handsome man, with a trim brown beard cut to a point in the naval style, gay blue eyes, and a bluff way of carrying his head. The lady passengers invariably fell into the habit of describing him as a splendid man, and the word seemed to fit him like a glove. Nature had certainly designed him to be shown somewhere in the front of life, to be placed upon a dais and looked up to and admired by the multitude. She had written success upon his sunburnt face. He had thousands of friends. Every seat at his table was booked two voyages ahead, and he knew the value of popularity. He was never carried off his feet, but enjoyed it simply and heartily. He had fallen in love one summer voyage with a tall and soft-mannered Canadian girl, a Hebe with the face of a Madonna, with thoughtful, waiting blue eyes. She was only nineteen, and, of course, Captain Dixon carried everything before him. The girl was astonished at her good fortune; for this wooer was a king on his own great decks. No princess could be good enough for him, had princesses been in the habit of crossing the Atlantic. Captain Dixon had now been married some years. His marriage had made a perceptible change in the personnel of his intimates. A bachelor captain appeals to a different world. He was still a great favourite with men. Although the Grandhaven had only been one night at sea, the captain\u0027s table had no vacant seats. These were all old travellers, and there had been libations poured to the gods, now made manifest by empty bottles and not a little empty laughter. Dixon, however, was steady enough. He had reluctantly accepted one glass of champagne from the bottle of a Senator powerful in shipping circles. He and his officers made a point of drinking water at table. The modern sailor is one of the startling products of these odd times. He dresses for dinner, and when off duty may be found sitting on the saloon stairs discussing with a lady passenger the respective merits of Wagner and Chopin as set forth by the ship\u0027s band, when he ought to be asleep in bed in preparation for the middle watch. The captain received the message with a curt nod. But he did not rise from the table. He knew that a hundred eyes were upon him, watching his every glance. If he jumped up and hurried from the table, the night\u0027s rest of half a hundred ladies would inevitably suffer. He took his watch from his pocket and rose, laughing at some sally made by a neighbour. As he passed down the length of the saloon, he paused to greet one and exchange a laughing word with another. He was a very gracious monarch. On deck it was wet and cold. A keen wind from the north-west seemed to promise a heavy sea and a dirty night when the Lizard should be passed and the protection of the high Cornish moorlands left behind. The captain\u0027s cabin was at the head of the saloon stairs. Captain Dixon lost no time in changing his smart mess-jacket for a thicker coat. Oilskins and a sou\u0027wester transformed him again to the seaman that he was, and he climbed the narrow iron ladder into the howling darkness of the upper bridge with a brisk readiness to meet any situation. The fog-bank was a thick one. It was like a sheet of wet cotton-wool laid upon the troubled breast of the sea. The lights at the forward end of the huge steamer were barely visible. There was no glare aloft where the masthead light stared unwinking into the mist. Dixon exchanged a few words with the second officer, who stood, rather restless, by the engine-room telegraph. They spoke in monosyllables. The dial showed “Full speed ahead.” Captain Dixon stood chewing the end of his golden moustache, which he had drawn in between his teeth. He looked forward and aft and up aloft in three quick movements of the head. Then he laid his two hands on the engine-room telegraph and reduced the pace to half-speed. There were a hundred people on board who would take note of it with a throb of uneasiness at their hearts, but that could not be helped. The second officer stepped sideways into the chart-room, reluctant to turn his eyes elsewhere than dead ahead into the wind and mist, to make a note in two books that lay open on the table under the shaded electric lamp. It was twenty minutes to nine. The Grandhaven was a quick ship, but she was also a safe one. The captain had laid a course close under the Lizard lights. He intended to alter it, but not yet. The mist might lift. There was plenty of time, for by dead reckoning they could scarcely hope to sight the twin lights before eleven o\u0027clock. The captain turned and said a single word to his second officer, and a moment later the great fog-horn above them in the darkness coughed out its deafening note of warning. A dead silence followed. Captain Dixon nodded his head with a curt grunt of satisfaction. There was nothing near them. They could carry on, playing their game of blindman\u0027s-buff with Fate, open-eared, steady, watchful. There was no music to-night, though the band had played the cheeriest items of its repertoire outside the saloon door during dinner. Many of the passengers were in their cabins already, for the Grandhaven was rolling gently on the shoulder of the Atlantic swell. The sea was heavy, but not so heavy as they would certainly encounter west of the Land\u0027s End. Presently the Grandhaven crept out into a clear space, leaving the fog-bank in rolling clouds like cannon-smoke behind her. “Ah!” said Captain Dixon, with a sigh of relief; he had never been really anxious. The face of the second officer, ruddy and glistening with wet, lighted up suddenly, and sundry lines around his eyes were wiped away as if by the passage of a sponge as he stooped over the binnacle. Almost at once his face clouded again. “There is another light ahead,” he muttered. “Hang them.” The captain gave a short laugh to reassure his subordinate, whom he knew to be an anxious, careful man, on his promotion. Captain Dixon was always self-confident. That glass of champagne from the Senator\u0027s hospitable bottle made him feel doubly capable to-night to take his ship out into the open Atlantic, and then to bed with that easy heart which a skipper only knows on the high seas. Suddenly he turned to look sharply at his companion, whose eyes were fixed on the fog-bank, which was now looming high above the bows. There were stars above them, but no moon would be up for another three hours. Dixon seemed to be about to say something, but changed his mind. He raised his hands to the ear-flaps of his sou\u0027wester, and, loosening the string under his chin, pushed the flannel lappets up within the cap. The second officer wore the ordinary seafaring cap known as a cheese-cutter. He was much too anxious a man to cover his ears even in clear weather, and said, with his nervous laugh, that the colour did not come out of his hair, if any one suggested that the warmer headgear would protect him from rain and spray. Dixon stood nearer to his companion, and they stood side by side, looking into the fog-bank, which was now upon them. “Any dogs on board?” he asked casually. “No—why do you ask?” “Thought I heard a little bell; such a thing as a lady\u0027s lap-dog wears round his neck on a ribbon.” The second officer turned and glanced sharply up at the captain, who, however, made no further comment, and seemed to be thinking of something else. “Couldn\u0027t have been a bell-buoy, I suppose?” he suggested, with a tentative laugh as he pushed his cap upwards away from his ears. “No bell-buoys out here,” replied the captain, rather sharply, with his usual self-confidence. They stood side by side in silence for five minutes or more. The mist was a little thinner now, and Captain Dixon looked upwards to the sky, hoping to see the stars. He was looking up when the steamer struck, and the shock threw him against the after rail of the bridge. The second officer was thrown to the ground and struggled there for an instant before getting to his feet again. “God Almighty!” he said, and that was all. Captain Dixon was already at the engine-room telegraph wrenching the pointer round to full speed ahead. The quartermaster on watch was at his side in a moment, and several men in shining oilskins swarmed up the ladder to the bridge for their orders. The Grandhaven was quite still now, but trembling like a horse that had stumbled badly and recovered itself with dripping knees. Already the seas were beating the bluff sides of the great vessel, throwing pyramids of spray high above the funnels. Captain Dixon grabbed the nearest man by the arm. “The boats,” he shouted in his ear. “Tell Mr. Stoke to take charge. Tell him it\u0027s the Manacles.” There seemed to be no danger, for the ship was quite steady, with level decks. Turning to another quartermaster, Dixon gave further orders clearly and concisely. “Keep her at that,” he said to the second officer, indicating the dial of the engine-room. “Stay where you are!” he shouted to the two steersmen who were preparing to quit the wheelhouse. If Captain Dixon had never made a mistake in seamanship he must have thought out the possibilities of this mistake in all their bearings. For the situation was quite clear and compact in his mind. The orders he gave came in their proper sequence and were given to the right men. From the decks beneath arose a confused murmur like the stirring of bees in an overturned hive. Then a sharp order in one voice, clear and strong, followed by a dead silence. “Good!” said the captain. “Stoke has got \u0027em in hand.” He broke off and looked sharply fore and aft and up above him at the towering funnel. “She is heeling,” he said. “Martin, she\u0027s heeling.” The ship was slowly turning on her side, like some huge and stricken dumb animal laying itself down to die. “Yes,” said the captain with a bitter laugh, to the two steersmen who had come a second time to the threshold of the wheel-house, “yes, you can go.” He turned to the engine-room telegraph and rang the “Stand by.” But there was no answer. The engineers had come on deck. “She\u0027s got to go,” said Martin, the second officer, deliberately. “You had better follow them,” replied the captain, with a jerk of his head towards the ladder down which the two steersmen had disappeared. “Go, be d—d,” said Martin. “My place is here.” There was no nervousness about the man now. The murmur on the decks had suddenly risen to shrieks and angry shouts. Some were getting ready to die in a most unseemly manner. They were fighting for the boats. The clear, strong voice had ceased giving orders. It afterwards transpired that the chief officer, Stoke, was engaged at this time on the sloping decks in tying lifebelts round the women and throwing them overboard, despite their shrieks and struggles. The coastguards found these women strewn along the beach like wreckage below St. Keverne—some that night, some at dawn—and only two were dead. The captain snapped his finger and thumb, a gesture of annoyance which was habitual to him. Martin knew the meaning of the sound, which he heard through the shouting and the roar of the wind and the hissing of a cloud of steam. He placed his hand on the deck of the bridge as if to feel it. He had only to stretch out his arm to touch the timbers, for the vessel was lying over farther now. There was no vibration beneath his hand; the engines had ceased to work. “Yes,” said Dixon, who was holding to the rail in front of him with both hands. “Yes, she has got to go.” And as he spoke the Grandhaven slid slowly backwards and sideways into the deep water. The shrieks were suddenly increased, and then died away in a confused gurgle. Martin slid down on to the captain, and together they shot into the sea. They sank through a stratum of struggling limbs. The village of St. Keverne lies nearly two miles from the sea, high above it on the bare tableland that juts out ten miles to the Lizard lights. It is a rural village far from railway or harbour. Its men are agriculturists, following the plough and knowing but little of the sea, which is so far below them that they rarely descend to the beach, and they do no business in the great waters. But their churchyard is full of drowned folk. There are one hundred and four in one grave, one hundred and twenty in another, one hundred and six in a third. An old St. Keverne man will slowly name thirty ships and steamers wrecked in sight of the church steeple in the range of his memory. A quick-eared coastguard heard the sound of the escape of steam, which was almost instantly silenced. Then he heard nothing more. He went back to the station and made his report. He was so sure of his own ears that he took a lantern and went down to the beach. There he found nothing. He stumbled on towards Cadgwith along the unbroken beach. At times he covered his lantern and peered out to sea, but he saw nothing. At last something white caught his eye. It was half afloat amid the breakers. He went knee-deep and dragged a woman to the shore; she was quite dead. He held his lantern above his head and stared out to sea. The face of the water was flecked with dark shadows and white patches. He was alone, two miles from help up a steep combe and through muddy lanes, and as he turned to trudge towards the cliffs his heart suddenly leapt to his throat. There was some one approaching him across the shingle. A strong deep voice called to him, with command and a certain resolution in its tones. “You, a coastguard?” it asked. “Yes.” The man came up to him and gave him orders to go to the nearest village for help, for lanterns and carts. “What ship?” asked the coastguard. “Grandhaven, London, New Orleans,” was the answer. “Hurry, and bring as many men as you can. Got a boat about here?” “There is one on the beach half a mile along to the south\u0027ard. But you cannot launch her through this.” “Oh yes, we can.” The coastguard glanced at the man with a sudden interest. “Who are you?” he asked. “Stoke—first mate,” was the reply. The rest of the story of the wreck has been told by abler pens in the daily newspapers. How forty-seven people were saved; how the lifeboat from Cadgwith picked up some, floating insensible on the ebbing tide with lifebuoys tied securely round them; how some men proved themselves great, and some women greater; how a few proved themselves very contemptible indeed; how the quiet chief officer, Stoke, obeyed his captain\u0027s orders to take charge of the passengers;—are not these things told by the newspapers? Some of them, especially the halfpenny ones, went further, and explained to a waiting world how it had all come about, and how easily it might have been avoided. They, moreover, dealt out blame and praise with a liberal hand, and condemned the owners or exonerated the captain with the sublime wisdom which illumines Fleet Street. One and all agreed that because the captain was drowned he was not to blame, a very common and washy sentiment which appealed powerfully to the majority of their readers. Some of the newspapers, while agreeing that the first officer, having saved many lives by his great exertions during the night, and perfect organization for relief and help the next day, had made for himself an immortal name, hinted darkly that the captain\u0027s was the better part, and that they preferred to hear in such cases that all the officers had perished. Stoke despatched the surviving passengers by train from Helston back to London. They were not enthusiastic about him, neither did they subscribe to present him with a service of plate. They thought him stern and unsympathetic. But before they had realized quite what had happened they were back at their homes or with their friends. Many of the dead were recovered, and went to swell the heavy crop of God\u0027s seed sown in St. Keverne churchyard. It was Stoke who organized these quiet burials, and took a careful note of each name. It was he to whom the friends of the dead made their complaint or took their tearful reminiscences, to both of which alike he gave an attentive hearing emphasized by the steady gaze of a pair of grey-blue eyes which many remembered afterwards without knowing why. “It is all right,” said the director of the great steamship company in London. “Stoke is there.” And they sent him money, and left him in charge at St. Keverne. The newspaper correspondents hurried thither, and several of them described the wrong man as Stoke, while others, having identified him, weighed him, and found him wanting in a proper sense of their importance. There was no “copy” in him, they said. He had no conception of the majesty of the Press. At length the survivors were all sent home and the dead thrown up by the sea were buried. Martin, the second officer, was among these. They found the captain\u0027s pilot-jacket on the beach. He must have made a fight for his life, and thrown aside his jacket for greater ease in swimming. Twenty-nine of the crew, eleven passengers, and a stewardess were never found. The sea would never give them up now until that day when she shall relinquish her hostages—mostly Spaniards and English—to come from the deep at the trumpet call. Stoke finished his business in St. Keverne and took the train to London. Never an expansive man, he was shut up now as the strong are shut up by a sorrow. The loss of the Grandhaven left a scar on his heart which time could not heal. She had come to his care from the builder\u0027s yard. She had never known another husband. He was free now—free to turn to the hardest portion of his task. He had always sailed with Dixon, his life-long friend. They had been boys together, had forced their way up the ladder together, had understood each other all through. His friend\u0027s wife, by virtue of her office perhaps, had come nearer to this man\u0027s grim and lonely heart than any other woman. He had never defined this feeling; he had not even gone back to its source as a woman would have done, or he might have discovered that the gentle air of question or of waiting in her eyes which was not always there, but only when he looked for it, had been there long ago on a summer voyage before she was Captain Dixon\u0027s wife at all. All through his long swim to shore, all through the horrors of that November night and the long-drawn pain of the succeeding days, he had done his duty with a steady impassiveness which was in keeping with the square jaw, the resolute eyes, the firm and merciful lips of the man; but he had only thought of Mary Dixon. His one thought was that this must break her heart. It was this thought that made him hard and impassive. In the great office in London he was received gravely. With a dull surprise he noted a quiver in the lips of the managing director when he shook hands. The great business man looked older and smaller and thinner in this short time, for it is a terrible thing to have to deal in human lives, even if you are paid heavily for so doing. “There will be an official inquiry—you will have to face it, Stoke.” “Yes,” he answered, almost indifferently. “And there is Dixon\u0027s wife. You will have to go and see her. I have been. She stays at home and takes her punishment quietly, unlike some of them.” And two hours later he was waiting for Mary Dixon in the little drawing-room of the house in a Kentish village which he had helped Dixon to furnish for her. She did not keep him long, and when she came into the room he drew a sharp breath; but he had nothing to say to her. She was tall and strongly made, with fair hair and delicate colouring. She had no children, though she had been married six years, and Nature seemed to have designed her to be the mother of strong, quiet men. Stoke looked into her eyes, and immediately the expectant look came into them. There was something else behind it, a sort of veiled light. “It was kind of you to come so soon,” she said, taking a chair by the fireside. There was only one lamp in the room, and its light scarcely reached her face. But for all the good he did in coming it would seem that he might as well have stayed away, for he had no comfort to offer her. He drew forward a chair and sat down with that square slowness of movement which is natural to the limbs of men who deal exclusively with Nature and action, and he looked into the fire without saying a word. Again it was she who spoke, and her words surprised the man, who had only dealt with women at sea, where women are not seen at their best. “I do not want you to grieve for me,” she said quietly. “You have enough trouble of your own without thinking of me. You have lost your friend and your ship.” He made a little movement of the lips, and glanced at her slowly, holding his lip between his teeth as he was wont to hold it during the moments of suspense before letting go the anchors in a crowded roadstead as he stood at his post on the forecastle-head awaiting the captain\u0027s signal. She was the first to divine what the ship had been to him. Her eyes were waiting for his. They were alight with a gentle glow, which he took to be pity. She spoke calmly, and her voice was always low and quiet. But he was quite sure that her heart was broken, and the thought must have been conveyed to her by the silent messenger that passes to and fro between kindred minds. For she immediately took up his thought. “It is not,” she said, rather hurriedly, “as if it would break my heart. Long ago I used to think it would. I was very proud of him and of his popularity. But—” And she said no more. But sat with dreaming eyes looking into the fire. After a long pause she spoke again. “So you must not grieve for me,” she said, returning persistently to her point. She was quite simple and honest. Hers was that rare wisdom which is given only to the pure in heart; for they see through into the soul of man and sift out the honest from among the false. It seemed that she had gained her object, for Stoke was visibly relieved. He told her many things which he had withheld from other inquirers. He cleared Dixon\u0027s good name from anything but that liability to error which is only human, and spoke of the captain\u0027s nerve and steadiness in the hour of danger. Insensibly they lapsed into a low-voiced discussion of Dixon as of the character of a lost friend equally dear to them both. Then he rose to take his leave before it was really necessary to go in order to catch his train, impatient to meet her eyes—which were waiting for his—for a moment as they said good-bye, as the man who is the slave of a habit waits impatiently for the time when he can give way to it. He went home to the rooms he always occupied near his club in London. There he found a number of letters which had been sent on from the steamship company\u0027s offices. The first he opened bore the postmark of St. Just in Cornwall. It was from the coastguard captain of that remote western station, and it had been originally posted to St. Keverne. “Dear Sir,” he wrote. “One of your crew or passengers has turned up here on foot. He must have been wandering about for nearly a week and is destitute. At times his mind is unhinged. He began to write a letter, but could not finish it, and gives no name. Please come over and identify him. Meanwhile, I will take good care of him.” Stoke opened the folded paper, which had dropped from the envelope. “Dear Jack,” it began. One or two sentences followed, but there was no sequence or sense in them. The writing was that of Captain Dixon without its characteristic firmness or cohesion. Stoke glanced at his watch and took up his bag—a new bag hurriedly bought in Falmouth—stuffed full of a few necessities pressed upon him by kind persons at St. Keverne when he stood among them in the clothes in which he had swum ashore, which had dried upon him during a long November night. There was just time to catch the night mail to Penzance. Heaven was kind to him and gave him no time to think. The coach leaves Penzance at nine in the morning for a two hours\u0027 climb over bare moorland to St. Just—a little grey, remote town on the western sea. The loneliness of the hills is emphasized here and there by the ruin of an abandoned mine. St. Just itself, the very acme of remoteness, is yearly diminishing in importance and population, sending forth her burrowing sons to those places in the world where silver and copper and gold lie hid. The coastguard captain was awaiting Stoke\u0027s arrival in the little deserted square where the Penzance omnibus deposits its passengers. The two men shook hands with that subtle and silent fellowship which draws together seamen of all classes and all nations. They walked away together in the calm speechlessness of Englishmen thrown together on matters of their daily business. “He doesn\u0027t pick up at all,” said the coastguard captain, at length. “Just sits mum all day. My wife looks after him, but she can\u0027t stir him up. If anybody could, she could.” And the man walked on, looking straight in front of him with a patient eye. He spoke with unconscious feeling. “He is a gentleman, despite the clothes he came ashore in. Getting across to the Southern States under a cloud, as likely as not,” he said, presently. “Some bank manager, perhaps. He must have changed clothes with some forecastle hand. They were seaman\u0027s clothes, and he had been sleeping or hiding in a ditch.” He led the way to his house, standing apart in the well-kept garden of the station. He opened the door of the simply furnished drawing-room. “Here is a friend come to see you,” he said; and, standing aside, he invited Stoke by a silent gesture of the head to pass in. A man was sitting in front of the fire with his back towards the door. He did not move or turn his head. Stoke closed the door behind him as he entered the room, and went slowly towards the fireplace. Dixon turned and looked at him with shrinking eyes, like the eyes of a dog that has been beaten. “Let us get out on to the cliffs,” he said in a whisper. “We cannot talk here.” He was clean-shaven, and his hair was grizzled at the temples. His face looked oddly weak; for he had an irresolute chin, hitherto hidden by his smart beard. Few would have recognized him. By way of reply Stoke went back towards the door. “Come on, then,” he said rather curtly. They did not speak until they had passed out beyond the town towards the bare tableland that leads to the sea. “Couldn\u0027t face it, Jack, that\u0027s the truth,” said the captain, at last. “And if you or any others try to make me, I\u0027ll shoot myself. How many was it? Tell me quickly, man.” “Over a hundred and ninety,” replied Stoke. They walked out on to the bare tableland and sat down on a crumbling wall. “And what do the papers say? I have not dared to ask for one.” Stoke shrugged his square shoulders. “What does it matter what they say?” answered the man who had never seen his own name in the newspapers. Perhaps he failed to understand Dixon\u0027s point of view. “Have you seen Mary?” asked the captain. “Yes.” Then they sat in silence for some minutes. There was a heavy sea running, and the rocks round the Land\u0027s End were black in a bed of pure white. The Longship\u0027s lighthouse stood up, a grey shadow in a grey scene. “Come,” said Stoke. “Be a man and face it.” There was no answer, and the speaker sat staring across the lashed waters to the west, his square chin thrust forward, his resolute lips pressed, his eyes impassive. There was obviously only one course through life for this seaman—the straight one. “If it is only for Mary\u0027s sake,” he added at length. “Keeping the Gull Lightship east-south-east, and having the South Foreland west by north, you should find six fathoms of water at a neap tide,” muttered Captain Dixon, in a low monotone. His eyes were fixed and far away. He was unconscious of his companion\u0027s presence, and spoke like one talking in his dreams. Stoke sat motionless by him while he took his steamer in imagination through the Downs and round the North Foreland. But what he said was mostly nonsense, and he mixed up the bearings of the inner and outer channels into a hopeless jumble. Then he sat huddled up on the wall and lapsed again into a silent dream, with eyes fixed on the western sea. Stoke took him by the arm and led him back to the town, this harmless, soft-speaking creature who had once been a brilliant man, and had made but one mistake at sea. Stoke wrote a long letter to Mary Dixon that afternoon. He took lodgings in a cottage outside St. Just, on the tableland that overlooks the sea. He told the captain of the coastguards that he had been able to identify this man, and had written to his people in London. Dixon recognized her when she came, but he soon lapsed again into his dreamy state of incoherence, and that which made him lose his grip on his reason was again the terror of having to face the world as the captain of the lost Grandhaven. To humour him they left St. Just and went to London. They changed their name to that which Mary had borne before her marriage, a French Canadian name, Baillere. A great London specialist held out a dim hope of ultimate recovery. “It was brought on by some great shock,” he suggested. “Yes,” said Stoke. “By a great shock.” “A bereavement?” “Yes,” answered Stoke, slowly. It is years since the loss of the Grandhaven, and her story was long ago superseded and forgotten. And the London specialist was wrong. The Bailleres live now in the cottage westward of St. Just towards the sea, where Stoke took lodgings. It was the captain\u0027s wish to return to this remote spot. Whenever Captain Stoke is in England he spends his brief leave of absence in journeying to the forgotten mining town. Baillere passes his days in his garden or sitting on the low wall, looking with vacant eyes across the sea whereon his name was once a household word. His secret is still safe. The world still exonerates him because he was drowned. “He sits and dreams all day,” is the report that Mary always gives to Stoke when she meets him in the town square, where the Penzance omnibus, the only link with the outer world, deposits its rare passengers. “And you?” Stoke once asked her in a moment of unusual expansion, his deep voice half muffled with suppressed suspense. She glanced at him with that waiting look which he knows to be there, but never meets. For he is a hard man—hard to her, harder to himself. “I,” she said, in a low voice, “I sit beside him.” And who shall gauge a woman\u0027s dream? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2878/79656.html","bookId":1160,"book":{"id":1160,"title":"Fortune and Ot","description":"简介： It does not matter where it was. I do not want other peoplethat is to say, those who were around usto recognize Sister or myself. It is not likely that she will see this, and I am not sure that she knows my name. Of course, some one may draw her atte...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2878","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
