{"id":100581,"no":13,"title":"Page 13","content":"She’d only run a few steps when he caught her, grabbing the back of her suit. Aria tensed, terrified, as she felt a tug. Her Medsuit loosened and then cold air blew across her back. She was just grasping what he’d done when the whole suit fell away. Aria sprang back, covering herself and her thin undergarments. This was not happening.\\n\\n The Outsider balled her torn suit and hurled it into the darkness. “You were calling the Aether. Move, Mole! Now, or we cook!”\\n\\n She could hardly hear him. Her ears weren’t working right and the storm shrieked around her, muffling his voice. But she realized he was right. The Aether funnels appeared to be getting closer and gathering around them.\\n\\n He grabbed her wrist. “Keep low. If it’s close, put your hands on your knees to give the charge somewhere to go. You hear me, Dweller?”\\n\\n She couldn’t think beyond his grip on her wrist. A wave of warm air swept past, heavy, like fingers brushing her face. She recognized the warning. A funnel would strike close. Aria did what he said. She bent low over her knees, saw the Outsider doing the same, folding to half his size, until she had to close her eyes against the glaring light. When the brightness behind her eyelids dimmed, she straightened to a silent flashing world.\\n\\n The Outsider shook his head, realizing she couldn’t hear. She no longer fought when he pointed into the darkness. If he took her away from this place, at least her skin wouldn’t burn and her ears wouldn’t break again.\\n\\n She didn’t know how long they ran. The funnels never came as close as before. As they moved away from the Aether storm, the rain began, the drops cold pinpricks, so unlike pseudo-rain in the Realms. At first it cooled her skin, but soon the cold numbed her muscles, leaving her shivering.\\n\\n With the threat of the Aether receding behind them, her focus turned back to the Savage. How could she escape? He was double her size and moved sure-footedly through the dark. She was beyond exhausted, struggling just to stumble alongside, but she had to try something. There weren’t any good reasons the Savage could be forcing her to come with him. She needed to find the right moment to get away.\\n\\n The desert ended abruptly, giving to low hills patched with dry grass. It had grown darker away from the Aether funnels. Aria couldn’t see where she set her feet anymore. She stepped on something that stabbed deep into her foot. She stifled a cry of pain, seeing her chance of escape slipping away.\\n\\n The Outsider turned, his eyes glinting in the dark. “What is it, Dweller?”\\n\\n She heard him dimly but didn’t answer. Rain poured over her as she stood, balancing on one leg. She couldn’t put any weight on her foot anymore. He came toward her without any warning and hoisted her against his side. Aria raked her nails into his skin. He lost his footing, nearly bringing them both down.\\n\\n “Hurt me again, I hurt you back harder,” he said through clenched teeth. She felt the rumble of his voice where their ribs pressed together.\\n\\n He firmed his grip around her waist and quickened his pace up the slope, his breath a muffled hiss at her side. Warmth gathered where their skin touched, making her nauseous. She didn’t think she could bear it anymore when they crested the slope.\\n\\n By the light of the Aether, she saw a darkened opening in a smooth wall of rock. She’d have laughed if she could. Of course it would be a cave. Rain poured over the mouth in a solid sheet of water. The Outsider set her down inside.\\n\\n “Back under a rock. Must feel like home.” He disappeared into the cave.\\n\\n Aria limped back out into the pelting rain. She stared down at the way they’d come, a hillside so broken with rock it looked like it had teeth. She saw no other way, downhill or up, that looked manageable. She climbed down anyway, using her hands and her good foot to move over rocks made slick with rain. Aria pushed herself to hurry before the Outsider returned. Her foot slipped, wedging into the space between two large slabs. Aria tugged and turned, but the crack wouldn’t let her go and she was fading, the last of her strength seeping into the cold rock against her back.\\n\\n Aria tucked herself into a ball and had two thoughts. First, she was plunging to a place far deeper than sleep. And second, she hadn’t gotten far enough away.\\n\\n Chapter 12\\n\\n PEREGRINE\\n\\n The girl had passed out by the time Perry got the fire started. She seemed to do that a lot. He freed her foot from the slabs. Then he carried her into the cave and wrapped a blanket around her. A stone fell out of her hand. He guessed she’d meant it as protection from him. A decent thought. Might have worked for half a second.\\n\\n He remembered her scent from the night in the Dweller fortress. A rancy mix of must and flesh at the brink of decay. It had surprised him earlier, when he’d come across it in the valley. Led him right to her. Here, in the closed space of the cave, her odor was strong enough to bring a sour taste to the back of his throat. He lay down as far from her as he could without leaving the fire’s warmth and slept.\\n\\n He woke before sunrise to the hush that always followed an Aether storm. The girl hadn’t moved. It was a cold morning, the weather heading fast toward winter. Perry got the fire going again, moving slow. Even breathing too deep brought daggers to his side.\\n\\n He hadn’t been in this cave since Vale deemed this area forbidden, but found it well stocked by traders who used the cave as shelter when they came through the valley. He found clothes and jars with nuts. Dried fruits that were still edible. He even found a healing compound. Perry spread it on the girl’s feet, seeing that only one cut looked deep. She could use stitches. But he’d never been good with a needle, and she was going to die one way or another. Besides, he didn’t need her walking. Only alert long enough to talk.\\n\\n Perry checked the cut on his side. Only a short slice on his skin where he’d been hit, but he’d bruised a few ribs. He also had five stripes of torn flesh on his chest, thanks to the girl. But his body would heal and grow strong again, unlike Talon’s.\\n\\n He ate, then sat looking at the flames, torturing himself by remembering everything that had happened. He’d lost Talon. Something he thought impossible. Now he needed the impossible to happen again. He needed to get Talon back.\\n\\n Perry had done what he had to, leaving the Tides. But when he thought of how he’d run, his face went hotter than fire. He had spent his life dreaming of being the Tides’ Blood Lord. The tribe would think him a coward now. They’d be glad to have him gone.\\n\\n When he lay down to sleep, the girl still hadn’t moved. He wondered if she’d ever wake.\\n\\n Perry hunted the next morning. The hurt in his ribs made him sweat cold, but sitting about would’ve felt worse. He coaxed a rattler from a hole, speared it through with an arrow. He cooked and ate the rich meat, but felt nauseous afterward. Like the snake had come back to life in his gut.\\n\\n By nightfall the girl began to stir with fever. Perry burned some dry oak leaves to mask her Dweller scent and stayed awake through the night. He needed to be ready if she came around. She might have information about Talon. And there was the eyepiece to find out about. He hoped it would give him a way to contact the Dwellers who’d taken Talon.\\n\\n She opened her eyes the next afternoon and scurried away from him, pressing her back against the opposite wall. Her legs snapped together beneath the blanket.\\n\\n Perry smirked. “You’ve been passed out two days and you’re worried about that now?” He shook his head. “Relax, Dweller. Last thing you bring to mind.”\\n\\n She examined the dark granite walls. Then the steel cases of supplies stacked to one side. When she looked at the dwindling fire, she followed the thread of smoke toward the mouth of the cave.\\n\\n “Yeah,” Perry said. “That’s the way out. But you’re not leaving yet.”\\n\\n She turned to him, her gaze catching on his Markings. “What do you want from me, Savage?”\\n\\n “Is that what you call us?”\\n\\n “You’re murderers. Diseased. Cannibals.” She flung the words at him like curses. “I’ve heard the stories.”\\n\\n Perry crossed his arms. She lived under a rock. What did she know about anything? “Guess we’re well-named, Mole.”\\n\\n She watched him with a look of disgust. Then she touched her throat with a skitty hand. “I need water. Is there water?”\\n\\n He took his leather waterskin from his satchel and held it up.\\n\\n “What is that?” she asked.\\n\\n “Water.”\\n\\n “It looks like an animal.”\\n\\n “It used to be.” The pouch protecting the bottle inside was made of goat hide.\\n\\n “It looks filthy,” she said.\\n\\n Perry unstopped the cork and drank deeply. “Tastes fine.” He shook it so the water sloshed around. “Lose your thirst?”\\n\\n The girl snatched it from his hand, darted back to her spot. She shut her eyes and drank. When she was done, he raised a hand. “Keep it.” No way he’d drink from it now.\\n\\n “Why were you out in the open?” he asked.\\n\\n “Why should I tell you?”\\n\\n “I saved your life. Twice, by my count.”\\n\\n She sat forward. “You’re wrong! I’m here because of you. Guess who they think let you in?”\\n\\n That surprised him. He shifted his back on the cool rock, wondering what had happened after he’d left her that night. It didn’t matter. He’d done what he could. Now there was only Talon to think of.\\n\\n Perry slid his knife from the sheath at his hip. He checked the edge of the blade with his thumb, turning it so it caught the firelight. “I don’t have time to waste, Mole. Don’t think it would take much to make you talk.”\\n\\n “You don’t scare me with that.”\\n\\n Perry inhaled deeply. Her lie was acrid and sharp, bringing a bitter taste to his mouth. She wasn’t scared. She was terrified.\\n\\n “Why are you looking at me like that?” she asked.\\n\\n “Your scent.”\\n\\n Her lower lip quivered. “You drink from a rabbit and you think I smell?”\\n\\n Perry knew what was coming when she started laughing. He caught the shift in the air like the drag of a dark tide. She wouldn’t be laughing for long.\\n\\n He went outside and sat on a smooth boulder. It was a gray dusk, pulling a cold night in its wake. He sat and breathed and tried not to imagine Talon sobbing for his home like the girl in the cave.\\n\\n Chapter 13\\n\\n ARIA\\n\\n To calm herself, Aria tried to pretend it was a Realm. A Paleolithic Realm. She was in a cave, after all. With a fire, which she avoided looking at for the memories it brought of Ag 6. But there were also steel cases to one side. And the navy blue blanket around her was made of fleece. And the glass jars lined up near the fire had metal screw-top lids. Too many things that broke the Stone Age illusion.\\n\\n This was real.\\n\\n Aria stood and winced at the pain in the soles of her feet. She pulled the blanket around her and listened for the Savage. Only the piercing rhythm of her headache broke the silence. Had she been infected with disease? Would she die in this cave, wrapped in this blue fleece blanket? She drew a few slow breaths. Thinking like that wouldn’t do any good.\\n\\n There were supplies by the Outsider’s leather bag, but she wasn’t going to touch any of his things. She hobbled to the steel crates. Broken pieces of plastic and glass mixed with bottles of medicine. They were useless to her now. All the expiration dates reached back more than three hundred years, to the time of the Unity, when the Aether had forced people into Pods. She found one sterile bandage that had yellowed with time, but it would serve. \\n\\n","sourceLink":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1/page-13.html","bookId":1657,"book":{"id":1657,"title":"Under the Never Sky (Under the Never Sky #1)","description":"Storyline: Under the Never Sky (Under the Never Sky #1) \\n WORLDS KEPT THEM APART. \\n DESTINY BROUGHT THEM TOGETHER. \\n Aria has lived her whole life in the protected dome of Reverie. Her entire world confined to its spaces, she\u0027s never thought to dream of what lies beyond its doors. So when her mother goes missing, Aria knows her chances of surviving in the outer wasteland long enough to find her are slim. \\n Then Aria meets an outsider named Perry. He\u0027s searching for someone too. He\u0027s also wild - a savage - but might be her best hope at staying alive. \\n If they can survive, they are each other\u0027s best hope for finding answers.\\n","cover":"https://allnovel.net/images/under-the-never-sky-under-the-never-sky-1.jpg","author":"Veronica Rossi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:53:00 PM"}}
