{"id":100597,"no":29,"title":"Page 29","content":"“Of course not, Perry. Would you have supported his decision?”\\n\\n “No.”\\n\\n “As I heard it,” Roar continued, “Lodan was heading toward the Horns.”\\n\\n “To Sable?” Marron asked.\\n\\n Roar nodded. “There’s a place people speak of,” he told Aria. “A place free of the Aether. They call it the Still Blue. Some say it’s not real. Just a dream of a clear sky. But from time to time, people get to whispering about it.”\\n\\n Roar looked back at Perry. “There’s more noise than I’ve ever heard out there. People are saying Sable’s discovered it. Lodan was convinced.”\\n\\n Perry sat forward. He looked ready to spring from his chair. “We need to find out if it’s true.”\\n\\n Roar’s hand settled on his knife. “If I go to Sable, it won’t be to ask questions about the Still Blue.”\\n\\n “If you go to Sable, it will be to deliver my sister as you should have.” Perry’s tone had grown cold. Aria’s eyes darted from Roar to Perry.\\n\\n “What happened to the Fins?” Marron asked. He calmly cut his meat into a perfect square, like he had no idea of the sudden tension in the room.\\n\\n Roar took a long drink before he spoke. “The Fins were already weakened when illness hit them in the open. Then the Croven came and took the strongest children into their fold. To the rest . . . well, they did what the Croven do.”\\n\\n Aria looked down. The sauce on her plate had begun to look too red.\\n\\n “Terrible,” Marron said, nudging his plate away. “The stuff of nightmares.” He smiled at her. “You’ll soon leave this all behind, my dear. Perry told me your mother is a scientist. What sort of research does she do?”\\n\\n “Genetics. I don’t know much beyond that. She works for the committee that oversees all the Pods and the Realms. The Central Governing Board. It’s high-level research. She’s not allowed to talk about it.”\\n\\n Aria was embarrassed at how it sounded. Like her own mother couldn’t trust her with information. “She’s very dedicated. She left to work in another Pod a few months ago,” she added, feeling the need to say something more.\\n\\n “Your mother is not in Reverie?” Marron asked.\\n\\n “No. She had to go to Bliss to do some research.”\\n\\n Marron set his wine down so fast it spilled over the edges of the crystal, soaking into the cream table linen.\\n\\n “What is it?” Aria asked.\\n\\n Marron’s rings winked red and blue as he gripped the arms of his chair. “There’s a rumor from the traders who came around last week. It’s only a rumor, Aria. You heard what Roar said about the Still Blue. People talk.”\\n\\n The room turned around her. “What’s the rumor?”\\n\\n “I’m so sorry to tell you. Bliss was struck by an Aether storm. They said it was destroyed.”\\n\\n Chapter 25\\n\\n PEREGRINE\\n\\n Perry stood outside Aria’s door, his lungs pumping air like a bellows. There was plenty to like about Marron’s. Food. Beds. Food. But all the doors and walls gave him a pathetic range on tempers. He thought of all the times over the past week he’d wanted a break. Just an hour without breathing in Aria’s ache, or Roar’s. Yet here he was, practically sniffing under Aria’s door.\\n\\n He didn’t catch anything. Perry put his ear to the wood. Fared no better. Swearing under his breath, he jogged downstairs. He entered a room on the first floor, bare save for a large painting that looked like accidental splatter, and the heavy steel door of an elevator. Perry punched at the buttons. Paced until the door slid open. There were no buttons inside. The steel box dropped to only one place. Marron called it the Navel.\\n\\n Ten seconds in, he started to sweat. He continued to drop, deeper, deeper, imagining all the steps he’d taken to climb the mountain in reverse. The elevator slowed and stopped, though his stomach kept going for a moment or two. He remembered the feeling from his first visit. A hard one to forget. Finally the door opened.\\n\\n A smell as damp and thick as breathing dirt came to him. He sneezed a few times, striding through a wide corridor toward the source of light at the end. Crates were piled high along the walls. Even on top, they were littered with odd things. Dusty vases and chairs. A mannequin arm. A thin paper screen painted with images of cherry blossoms. A harp with no strings. A wooden box full of doorknobs and hinges and keys.\\n\\n He had explored every one of those crates the last time he’d come. Like everything at Marron’s, the bits and pieces stashed in the Navel had taught him about the world before the Unity. A world Vale had discovered years before him in the pages of books.\\n\\n Perry followed the clutter to the end of the corridor, nodding to Roar and Marron as he entered a large room. A bank of computers took up one side. Most were ancient, but Marron had a few pieces of Dweller equipment, sleek as Aria’s Smarteye. There was also a wall-sized screen, like in the common room above. The image he saw on it was of the plateau they’d crossed before the final climb to Marron’s. The colors were odd and the image was murky, but he recognized the caped figures moving around tents.\\n\\n “I had a microcamera set up,” Marron said from a wooden desk. He controlled the images on the wallscreen from a thin control palette. Aria’s Smarteye was on his desk on a thick black board that looked like a piece of granite. “It won’t last long with the Aether, but it’ll help us see what they’re doing until then.”\\n\\n “They’re setting up to stay, that’s what they’re doing,” Roar said. He sat on the lone couch, his feet kicked up onto a small table. “Another ten added since the last count, I’d say. You’ve finally got a tribe following you, Per.”\\n\\n “Thanks, Roar. But it’s not the kind I wanted.” Perry sighed. Would the Croven ever leave? How was he going to get out of here?\\n\\n Marron guessed his thoughts. “Perry, there are old tunnels that run deeper into the mountain. Most of them are impassable, but we might find one that’s held up. I’ll have them explored in the morning.”\\n\\n Perry knew Marron had meant to be reassuring, but it only made him feel worse for all the trouble he was creating. And tunnels? He dreaded to think of leaving that way. Just being in this room was making him sweat. But unless the Croven gave up and left, he couldn’t think of another way out of Delphi.\\n\\n “What’s the news on the Smarteye?”\\n\\n Marron’s fingers glided over the palette. The image on the wallscreen changed to a series of numbers. “By my estimate, I could have it decrypted and running in eighteen hours, twelve minutes, and twenty-nine seconds.”\\n\\n Perry nodded. They’d have it sometime early tomorrow night.\\n\\n “Perry, even if I can get it powered, I think the two of you should be prepared for any outcome. The Realms are even better protected than their Pods. Walls and energy shields are nothing by comparison. There may not be anything I can do to get you connected with Talon. Or to link Aria with her mother.”\\n\\n “We have to try.”\\n\\n “We will. We’ll try our best.”\\n\\n Perry tipped his chin at Roar. “I need you.” Roar followed him without question. He explained what he wanted in the elevator.\\n\\n “I thought you’d already gone to her,” Roar said.\\n\\n Perry stared at the metal doors. “I haven’t. . . . I did, but I didn’t see her.”\\n\\n Roar laughed. “And you want me to go?”\\n\\n “Yes. You, Roar.” Was he going to have to explain that Aria talked to him more easily?\\n\\n Roar leaned against the elevator and crossed his arms. “Remember that time I was trying to talk to Liv and I fell off the roof?”\\n\\n In the cramped elevator car, he couldn’t escape picking up the shift in Roar’s temper. The scent of longing. He’d always hoped Roar and Liv would outgrow their crush, but they’d always been wrapped up in each other.\\n\\n “I was talking to her through that hole in the timbers, remember that, Perry? She was up in the loft and it had just rained. I lost my balance and slid right off.”\\n\\n “I remember you running away from my father with your pants around your ankles.”\\n\\n “That’s right. I tore them on a tile on the way down. I don’t think I’d ever seen Liv laugh so much. Almost made me want to stop running just to see her like that. Hearing it was pretty good, though. Best sound in the world, Liv’s laugh.” Roar’s smile faded after a moment. “He was fast, your father.”\\n\\n “He was stronger than he was fast.”\\n\\n Roar didn’t say anything. He knew how it had been for Perry growing up.\\n\\n “Was there a point to that story?” Perry stepped out as soon as the elevator doors parted. “Are you coming?”\\n\\n “Fall off your own roof, Perry,” he said as the door slid closed.\\n\\n The elevator dropped back to the Navel, carrying away the sound of Roar’s laughter.\\n\\n Aria was sitting at the edge of the bed when Perry stepped into her room. Her arms were crossed low, over her stomach. Only the small lamp by the bedside was lit. The light came off the shade in a perfect triangle, falling across her folded arms. The room held her scent. Violets of early spring. The first bloom. He could’ve gotten lost in that scent if it weren’t for the dankness of her temper.\\n\\n Perry closed the door behind him. This room was smaller than the one he’d been given to share with Roar. He saw nowhere to sit but the bed. Not that he felt like sitting. But he didn’t want to stand by the door, either.\\n\\n She looked over, her eyes swollen from crying. “Did Marron send you again?”\\n\\n “Marron? No . . . he didn’t.” He shouldn’t have come. Why had he closed the door like he’d meant to stay? Now leaving would be strange.\\n\\n Aria wiped the tears from her face. “That night in Reverie? I was in Ag 6 trying to find out if she was all right. The link with Bliss was down, and I was so worried. When I saw the message from her, I thought she was fine.”\\n\\n Perry stared at the empty space by her side. Just four steps away. Four steps that looked like a mile. He took them like he was going to launch himself off a cliff. The bed rocked as he sat. What was wrong with him?\\n\\n He cleared his throat. “They were just rumors, Aria. The Auds just spread things.”\\n\\n “It could be true.”\\n\\n “But it could be false, too. Maybe only part of it is destroyed. Like the dome that night? It was crushed where I came in.”\\n\\n She turned to the painting on the wall, lost in thought. “You’re right. The Pods are built to break down in parts. There are ways of containing damage.”\\n\\n She pushed her hair behind her ear. “I just want to know. I don’t feel like she’s gone. . . . But what if she is? What if I should be mourning her right now? What if I do and she’s not? I’m so afraid of guessing it wrong. And I hate that I can’t do anything about it.”\\n\\n He bent over his knees and pulled at the edge of his cast.\\n\\n “This is what you’ve felt about Talon. Isn’t it?”\\n\\n He nodded. “Yes,” he said. “Exactly.” He’d been avoiding the fear that he might be doing everything in vain. That Talon was gone. He hadn’t allowed himself to think about that. What if Talon had died because of him? Where was Talon? Perry knew she understood. This Dweller girl knew what it was like to feel the torture of loving someone who was lost. Maybe gone forever. \\n\\n","sourceLink":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1/page-29.html","bookId":1657,"book":{"id":1657,"title":"Under the Never Sky (Under the Never Sky #1)","description":"Storyline: Under the Never Sky (Under the Never Sky #1) \\n WORLDS KEPT THEM APART. \\n DESTINY BROUGHT THEM TOGETHER. \\n Aria has lived her whole life in the protected dome of Reverie. Her entire world confined to its spaces, she\u0027s never thought to dream of what lies beyond its doors. So when her mother goes missing, Aria knows her chances of surviving in the outer wasteland long enough to find her are slim. \\n Then Aria meets an outsider named Perry. He\u0027s searching for someone too. He\u0027s also wild - a savage - but might be her best hope at staying alive. \\n If they can survive, they are each other\u0027s best hope for finding answers.\\n","cover":"https://allnovel.net/images/under-the-never-sky-under-the-never-sky-1.jpg","author":"Veronica Rossi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:53:00 PM"}}
