{"id":100605,"no":37,"title":"Page 37","content":"“I’m asking now.” Roar tipped his head toward Aria. “I thought you’d see things differently.”\n Perry glanced at her. She was still talking with Marron. All he could think about was the way she’d felt against him when they had kissed. “It’s not the same, Roar.”\n “Isn’t it?”\n Perry pulled his satchel over his shoulder. Grabbed his bow and quiver. “Let’s go.”\n He wanted the earth blurring fast beneath his feet. The night flowing into his nostrils. He always knew what to do with a weapon in his hand.\n They left through a small gate on the north wall. Perry brought in all the scents, letting earth and wind tell him what they’d find. His nose hummed with the strength of the Aether. He glanced up. Vast spools crowded the sky.\n He eased smoothly into the woods, finally shedding the feeling of being bound. They broke into two groups to lessen the sounds of their movement. He prowled uphill with Aria, choosing every step with care, scanning the canopy. He had no doubt the Croven’s sentinels were Marked, probably Auds. They would sleep in the treetops, the safest place at night.\n Perry glanced over his shoulder. Aria had her hair pulled under a black cap and her face darkened with charcoal, as he did. Her eyes were wide and alert. She had a satchel of her own now. A knife. Clothes that fit. It struck him in that instant how much she’d changed. He’d wondered how it would be, doing this with her. She could have weakened his concentration. She was afraid. No question of that. But this was different than their journey to Marron’s. She was trapping the nerves and making them work. When he breathed, he knew the strength of her control.\n Delphi’s walls receded as they crept deeper into the mountain. Judging by the look of the Aether and the burn in his nose, they still had time. An hour maybe, before the funnels rained down.\n Aria’s hand at his back stopped him. She pointed to a large tree forty paces ahead. A fresh scatter of branches littered the ground below. Looking up, he saw a figure nestled in the crook of a branch. The man bore an ivory horn. The signaler. Perry looked higher and spotted another man. A pair, tasked with sounding the alarm.\n He didn’t know how he’d missed them. Even more, he wasn’t sure how Aria had spotted them first. The men spoke quietly, a conversation Perry only caught as faint sounds. He met Aria’s eyes and then straightened slowly, nocking an arrow in place. He knew he wouldn’t miss the first man. Perry’s challenge was to kill him soundlessly. If he could keep the man from falling from the tree, that would be even better.\n He took his aim and drew a few breaths. It should be easy. He wasn’t far. But one yell from the man, or one blast of his horn, and all the Croven would be on them.\n A wolf howled in the distance, the perfect sound cover. He straightened the two fingers that held the bowstring, loosing the arrow. He struck the man’s neck, pinning him to the trunk. The horn slid off his lap but didn’t fall to the ground. It remained slung around his arm by a strap, hanging just below the branch. A pale crescent hovering in the darkness.\n Perry nocked another arrow but the other man, definitely an Aud because he’d heard the noise, called out desperately for his friend. When he got no answer, he climbed down the tree, fast as a squirrel. Perry loosed another arrow. He heard a crunch as his shot sank into bark. The Aud scampered to the opposite side of the thick trunk, giving Perry no clear shot. Perry dropped his bow, pulled his knife, and ran.\n The Aud saw him and veered toward a dense knot of brush. He was slight, closer to Aria’s size than Perry’s, and quick as he threaded around the thick undergrowth. Perry didn’t slow down. He crashed through the branches, hearing them snap and break around him. The man turned downhill, scampering in panic, but Perry knew he had him. He lunged, covering the final paces in the air, slamming into the Aud’s back.\n Perry jerked up as soon as they hit the ground, making a clean swipe with his blade across the man’s neck. The wriggling body beneath him went slack as the rich scent of hot blood shot into his nose. Perry wiped his blade on the man’s shirt and stood, his lungs working for breath. Killing a man should be more difficult than killing game. It wasn’t. He looked at the knife in his trembling hand. Only the aftermath was different.\n A stab deep inside his nose had him looking up. The Aether had begun to take the shape of a massive whirlpool. The storm would come soon and it would strike hard.\n He slid the knife back into his sheath, his muscles seizing as he heard a muffled cry.\n Aria.\n Chapter 34\n ARIA\n Aria pulled into a crouch as a third man appeared, dropping from another tree close by, only twenty paces off. She clutched Talon’s knife, ready to fight, but he didn’t run toward her. He darted toward the tree where the dead man hung. Fear shot through her. He wanted the horn. If he alerted the rest of the Croven, it wouldn’t just be her death. It would be Marron’s men. Roar. And Perry.\n She waited until he neared the base of the tree before she ran after him. Aria didn’t feel her legs moving beneath her. She knew she’d picked the right moment. He was climbing, his hands occupied, and his back turned to her. She’d used speed and surprise to her advantage just as Roar had taught her.\n It should have been perfect. But with steps to go, she realized the only lethal targets she knew were along the front of the body. She thought of reaching around for his jugular, but he was too far off the ground.\n She couldn’t turn back. He heard her, his head whipping around. For an awful second, their eyes met. Roar’s voice burst into her mind. Strike first and fast. But where? On the leg? His back? Where?\n The man pushed off the tree, falling toward her. She tried to raise her blade. She intended to do it. But he came down on her in a blur.\n Aria landed on her back, the air driving out of her chest in one heave. A muffled groan burst out of her. He was on top of her. She braced for a knife in her side. For a blow across the face. She was ready, but he shuddered and then went limp.\n She’d killed him.\n Waves of panic blared through her at the feel of his hair strewn over her eyes, at his weight pressing down on her. It took three tries to bring air into her lungs. When she finally did, the odor of him was so foul, she choked back a rise of nausea. Warmth seeped across her stomach. She couldn’t move.\n A face appeared above her. A girl. She was a wild-eyed thing, but pretty. She scrambled up the tree, slipped the horn around her neck, jumped to the ground, and ran off.\n Aria pushed her shoulder back with all the strength she had. It was enough to free her arm. With another push, she rolled the man off. She wanted to shoot away from him. She couldn’t do anything except feed her starved lungs.\n Another Croven came, a larger figure, suddenly there, crouching at her side. Aria groped through the dirt for her knife, hearing Roar in her mind again. Never let go of your blade.\n “Steady, Aria. It’s me.”\n Perry. She remembered he was wearing a cap, hiding his gold-streaked hair.\n “Where are you hurt?” His hands ran over her stomach.\n “It’s not me,” she said. “It’s not mine.”\n Perry pulled her into his arms, cursing softly, saying he’d thought it had happened again. She didn’t know what he meant. She wanted to stay pressed close to him. She’d just killed a man. His blood was all over her, making her stomach shake. But she pulled away.\n “Perry,” she said. “We have to find Roar.”\n Before they were on their feet, the blast of the horn shattered the silence.\n They ran through the darkened woods together, knives in hand, coming upon a body lying facedown. Aria’s knees weakened. She knew Roar’s proportions well, had spent the past days watching him, measuring him so she could dodge his strikes.\n “It’s not him,” Perry said. “It’s Gage.”\n Roar called softly from a distance. “Here, Perry.”\n They found him sitting against a tree, one leg outstretched, an arm propped on his other knee. Aria fell to her knees at his side.\n “There were five of them. They got Mark right away. Gage and I managed four. He went after the one who ran off.”\n “Gage is dead,” Perry said.\n A pool of blood glistened beneath Roar’s leg. Aria saw the tear in his dark pants at his thigh. The skin was split open, the muscle beneath as well. Blood leaked steadily out of the wound, shiny under the blue Aether light. “Your leg, Roar.” She pressed her hands on his leg to stop the flow of blood.\n Roar’s face twisted with pain. Perry pulled a lash of leather from her satchel and tied it above the wound, his hands moving swiftly. “I’ll carry you.”\n “No, Peregrine,” Roar said. “I hear them. The Croven are coming.”\n Aria heard it too. The bells were ringing. The Croven were moving, chasing them, undeterred by the storm.\n “We’re getting you back to Marron’s first,” Perry said.\n “They’re too close. We won’t get there in time.”\n Cold raced down Aria’s neck. She stared into the trees, imagining sixty cannibals sweeping toward them in black cloaks.\n Perry swore. He handed Aria his satchel, bow, and quiver. “Don’t fall more than three feet behind me.” He hoisted Roar up, slinging an arm over his shoulder as he’d done with Cinder. They ran, Perry half carrying Roar, as the bells trilled in her ears. She stumbled downslope, the pealing of the bells maddening.\n Perry scanned the trees, his eyes bright and wide. “Aria!” he yelled, turning toward an outcropping of rocks. He set Roar down and took his bow and quiver from her.\n She crouched behind the rocks, breathless, shoulder-to- shoulder with Roar. Perry stood at her other side, unleashing a barrage of arrows, one after another, never stopping. Shouts of alarm erupted from the night. The Croven flung their last words at the sky. But still the bells rang louder.\n Aria couldn’t tear her eyes away from Perry. She’d seen him this way before, almost serene as he dealt death. He’d been a stranger then. But this was Perry. How could he bear to do it?\n His bow landed with a soft, surprising thump on the pine needles by her feet.\n “I’m out,” he said. “I’ve run out of arrows.”\n Chapter 35\n PEREGRINE\n The Croven’s putrid scents coated Perry’s throat. The bells at their belts glinted in the Aether light. They rang softly now. The chase was over. They were surrounded.\n At some signal, they donned their masks and pulled on the hoods of their black cloaks. Soon it was all Perry saw. Dozens of beaked faces hovering in the gloom of the forest. Aria stood beside him, her knife out. Roar rose to his feet and leaned against the rock behind him.\n The Croven had their own archers, Perry saw. Six men with bows trained on them. None of them more than thirty feet away. Would this be the way he died? It would be a fitting death. How many men had he just killed with his bow?\n A heavily built man stepped forward. His mask wasn’t made of bone and skin but silver. It shone, reflecting the Aether as he lifted his head to the wind in a way Perry knew well.\n “Lay down where you are, Blood Lord.” \n","sourceLink":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1/page-37.html","bookId":1657,"book":{"id":1657,"title":"Under the Never Sky (Under the Never Sky #1)","description":"Storyline: \n Under the Never Sky (Under the Never Sky #1) \n WORLDS KEPT THEM APART. \n DESTINY BROUGHT THEM TOGETHER. \n Aria has lived her whole life in the protected dome of Reverie. Her entire world confined to its spaces, she\u0027s never thought to dream of what lies beyond its doors. So when her mother goes missing, Aria knows her chances of surviving in the outer wasteland long enough to find her are slim. \n Then Aria meets an outsider named Perry. He\u0027s searching for someone too. He\u0027s also wild - a savage - but might be her best hope at staying alive. \n If they can survive, they are each other\u0027s best hope for finding answers.\n \n","cover":"https://allnovel.net/images/under-the-never-sky-under-the-never-sky-1.jpg","author":"Veronica Rossi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:53:00 PM"}}
