{"id":107457,"no":14,"title":"Page 14","content":"AMARYL, YUGO-... A mathematician who, next to Hari Seldon himself, may be considered most responsible for working out the details of psychohistory. It was he who... ... Yet the conditions under which he began life are almost more dramatic than his mathematical accomplishments. Born into the hopeless poverty of the lower classes of Dahl, a sector of ancient Trantor, he might have passed his life in utter obscurity were it not for the fact that Seldon, quite by accident, encountered him in the course of... Encyclopedia Galactica 61. The Emperor of all the Galaxy felt weary-physically weary. His lips ached from the gracious smile he had had to place on his face at careful intervals. His neck was stiff from having inclined his head this way and that in a feigned show of interest. His ears pained from having to listen. His whole body throbbed from having to rise and to sit and to turn and to hold out his hand and to nod. It was merely a state function where one had to meet Mayors and Viceroys and Ministers and their wives or husbands from here and there in Trantor and (worse) from here and there in the Galaxy. There were nearly a thousand present, all in costumes that varied from the ornate to the downright outlandish, and he had had to listen to a babble of different accents made the worse by an effort to speak the Emperor\u0027s Galactic as spoken at the Galactic University. Worst of all, the Emperor had had to remember to avoid making commitments of substance, while freely applying the lotion of words without substance. All had been recorded, sight and sound-very discreetly-and Eto Demerzel would go over it to see if Cleon, First of that Name, had behaved himself. That, of course, was only the way that the Emperor put it to himself. Demerzel would surely say that he was merely collecting data on any unintentional self-revelation on the pan of the guests. And perhaps he was. Fortunate Demerzel! The Emperor could not leave the Palace and its extensive grounds, while Demerzel could range the Galaxy if he wished. The Emperor was always on display, always accessible, always forced to deal with visitors, from the important to the merely intrusive. Demerzel remained anonymous and never allowed himself to be seen inside the Palace grounds. He remained merely a fearsome name and an invisible (and therefore the more frightening) presence. The Emperor was the Inside Man with all the trappings and emoluments of power. Demerzel was the Outside Man, with nothing evident, not even a formal title, but with his fingers and mind probing everywhere and asking for no reward for his tireless labors but one-the reality of power. It amused the Emperor-in a macabre sort of way-to consider that, at any moment, without warning, with a manufactured excuse or with none at all, he could have Demerzel arrested, imprisoned, exiled, tortured, or executed. After all, in these annoying centuries of constant unrest, the Emperor might have difficulty in exerting his will over the various planets of the Empire, even over the various sectors of Trantor-with their rabble of local executives and legislatures that he was forced to deal with in a maze of interlocking decrees, protocols, commitments, treaties, and general interstellar legalities-but at least his powers remained absolute over the Palace and its grounds. And yet Cleon knew that his dreams of power were useless. Demerzel had served his father and Cleon could not remember a time when he did not turn to Demerzel for everything. It was Demerzel who knew it all, devised it all, did it all. More than that, it was on Demerzel that anything that went wrong could be blamed. The Emperor himself remained above criticism and had nothing to fear-except, of course, palace coups and assassination by his nearest and dearest. It was to prevent this, above all, that he depended upon Demerzel. Emperor Cleon felt a tiny shudder at the thought of trying to do without Demerzel. There had been Emperors who had ruled personally, who had had a series of Chiefs of Staff of no talent, who had had incompetents serving in the post and had kept them-and somehow they had gotten along for a time and after a fashion. But Cleon could not. He needed Demerzel. In fact, now that the thought of assassination had come to him-and, in view of the modern history of the Empire, it was inevitable that it had come to him-he could see that getting rid of Demerzel was quite impossible. It couldn\u0027t be done. No matter how cleverly he, Cleon, would attempt to arrange it, Demerzel (he was sure) would anticipate the move somehow, would know it was on its way, and would arrange, with far superior cleverness, a palace coup. Cleon would be dead before Demerzel could possibly be taken away in chains and there would simply be another Emperor that Demerzel would serve-and dominate. Or would Demerzel tire of the game and make himself Emperor? Never! The habit of anonymity was too strong in him. If Demerzel exposed himself to the world, then his powers, his wisdom, his luck (whatever it was) would surely desert him. Cleon was convinced of that. He felt it to be beyond dispute. So while he behaved himself, Cleon was safe. With no ambitions of his own, Demerzel would serve him faithfully. And now here was Demerzel, dressed so severely and simply that it made Cleon uneasily conscious of the useless ornamentation of his robes of state, now thankfully removed with the aid of two valets. Naturally, it would not be until he was alone and in dishabille that Demerzel would glide into view. \"Demerzel,\" said the Emperor of all the Galaxy, \"I am tired!\" \"State functions are tiring, Sire,\" murmured Demerzel. \"Then must I have them every evening?\" \"Not every evening, but they are essential. It gratifies others to see you and to be taken note of by you. It helps keep the Empire running smoothly.\" \"The Empire used to be kept running smoothly by power,\" said the Emperor somberly. \"Now it must be kept running by a smile, a wave of the hand, a murmured word, and a medal or a plaque.\" \"If all that keeps the peace, Sire, there is much to be said for it. And your reign proceeds well.\" \"You know why-because I have you at my side. My only real gift is that I am aware of your importance.\" He looked at Demerzel slyly. \"My son need not be my heir. He is not a talented boy. What if I make you my heir?\" Demerzel said freezingly, \"Sire, that is unthinkable. I would not usurp the throne. I would not steal it from your rightful heir. Besides, if I have displeased you, punish me justly. Surely, nothing I have done or could possibly do deserves the punishment of being made Emperor.\" Cleon laughed. \"For that true assessment of the value of the Imperial throne, Demerzel, I abandon any thought of punishing you. Come now, let us talk about something. I would sleep, but I am not yet ready for the ceremonies with which they put me to bed. Let us talk.\" \"About what, Sire?\" \"About anything.-About that mathematician and his psychohistory. I think about him every once in a while, you know. I thought of him at dinner tonight. I wondered: What if a psychohistorical analysis would predict a method for making it possible to be an Emperor without endless ceremony?\" \"I somehow think, Sire, that even the cleverest psychohistorian could not manage that.\" \"Well, tell me the latest. Is he still hiding among those peculiar baldheads of Mycogen? You promised you would winkle him out of there.\" \"So I did, Sire, and I moved in that direction, but I regret that I must say that I failed.\" \"Failed?\" The Emperor allowed himself to frown. \"I don\u0027t like that.\" \"Nor I, Sire. I planned to have the mathematician be encouraged to commit some blasphemous act-such acts are easy to commit in Mycogen, especially for an outsider-one that would call for severe punishment. The mathematician would then be forced to appeal to the Emperor and, as a result, we would get him. I planned it at the cost of insignificant concessions on our part-important to Mycogen, totally unimportant to us-and I meant to play no direct role in the arrangement. It was to be handled subtly.\" \"I dare say,\" said Cleon, \"but it failed. Did the Mayor of Mycogen \"He is called the High Elder, Sire.\" \"Do not quibble over titles. Did this High Elder refuse?\" \"On the contrary, Sire, he agreed and the mathematician, Seldon, fell into the trap neatly.\" \"Well then?\" \"He was allowed to leave unharmed.\" \"Why?\" said Cleon indignantly. \"Of this I am not certain, Sire, but I suspect we were outbid.\" \"By whom? By the Mayor of Wye?\" \"Possibly, Sire, but I doubt that. I have Wye under constant surveillance. If they had gained the mathematician, I would know it by now.\" The Emperor was not merely frowning. He was clearly enraged. \"Demerzel, this is bad. I am greatly displeased. A failure like this makes me wonder if you are perhaps not the man you once were. What measures shall we take against Mycogen for this clear defiance of the Emperor\u0027s wishes?\" Demerzel bowed low in recognition of the storm unleashed, but he said in steely tones, \"It would be a mistake to move against Mycogen now, Sire. The disruption that would follow would play into the hands of Wye.\" \"But we must do something.\" \"Perhaps not, Sire. It is not as bad as it may seem.\" \"How can it be not as bad as it seems?\" \"You\u0027ll remember, Sire, that this mathematician was convinced that psychohistory was impractical.\" \"Of course I remember that, but that doesn\u0027t matter, does it? For our purposes?\" \"Perhaps not. But if it were to become practical, it would serve our purposes to an infinitely great extent, Sire. And from what I have been able to find out, the mathematician is now attempting to make psychohistory practical. His blasphemous attempt in Mycogen was, I understand, part of an attempt at solving the problem of psychohistory. In that case, it may pay us, Sire, to leave him to himself. It will serve us better to pick him up when he is closer to his goal or has reached it.\" \"Not if Wye gets him first.\" \"That, I shall see to it, will not happen.\" \"In the same way that you succeeded in winkling the mathematician out of Mycogen just now?\" \"I will not make a mistake the next time, Sire,\" said Demerzel coldly. The Emperor said, \"Demerzel, you had better not. I will not tolerate another mistake in this respect.\" And then he added pettishly, \"I think I shall not sleep tonight after all.\" 62. Jirad Tisalver of the Dahl Sector was short. The top of his head came up only to Hari Seldon\u0027s nose. He did not seem to take that to heart, however. He had handsome, even features, was given to smiling, and sported a thick black mustache and crisply curling black hair. He lived, with his wife and a half-grown daughter, in an apartment of seven small rooms, kept meticulously clean, but almost bare of furnishings. Tisalver said, \"I apologize, Master Seldon and Mistress Venabili, that I cannot give you the luxury to which you must be accustomed, but Dahl is a poor sector and I am not even among the better-off among our people.\" \"The more reason,\" responded Seldon, \"that we must apologize to you for placing the burden of our presence upon you.\" \"No burden, Master Seldon. Master Hummin has arranged to pay us generously for your use of our humble quarters and the credits would be welcome even if you were not-and you are.\" Seldon remembered Hummin\u0027s parting words when they finally arrived in Dahl. \"Seldon\" he had said, \"this is the third place I\u0027ve arranged as sanctuary. The first two were notoriously beyond the reach of the Imperium, which might well have served to attract their attention; after all, they were logical places for you. This one is different. It is poor, unremarkable, and, as a matter of fact, unsafe in some ways. It is not a natural refuge for you, so that the Emperor and his Chief of Staff may not think to turn their eyes in this direction. Would you mind staying out of trouble this time, then?\" \"I will try, Hummin,\" said Seldon, a little offended. \"Please be aware that the trouble is not of my seeking. I am trying to learn what may well take me thirty lifetimes to learn if I am to have the slightest chance of organizing psychohistory.\" \"I understand,\" said Hummin. \"Your efforts at learning brought you to Upperside in Streeling and to the Elders\u0027 aerie in Mycogen and to who can guess where in Dahl. As for you, Dr. Venabili, I know you\u0027ve been trying to take care of Seldon, but you must try harder. Get it fixed in your head that he is the most important person on Trantor-or in the Galaxy, for that matter-and that he must be kept secure at any cost.\" \"I will continue to do my best,\" said Dors stiffly. \"And as for your host family, they have their peculiarities, but they are essentially good people with whom I have dealt before. Try not to get them in trouble either.\" But Tisalver, at least, did not seem to anticipate trouble of any kind from his new tenants and his expressed pleasure at the company he now had-quite apart from the rent credits he would be getting-seemed quite sincere. He had never been outside Dahl and his appetite for tales of distant places was enormous. His wife too, bowing and smiling, would listen and their daughter, with a finger in her mouth, would allow one eye to peep from behind the door. It was usually after dinner, when the entire family assembled, that Seldon and Dors were expected to talk of the outside world. The food was plentiful enough, but it was bland and often tough. So soon after the tangy food of Mycogen, it was all but inedible. The \"table\" was a long shelf against one wall and they ate standing up. Gentle questioning by Seldon elicited the fact that this was the usual situation among Dahlites as a whole and was not due to unusual poverty. Of course, Mistress Tisalver explained, there were those with high government jobs in Dahl who were prone to adopt all kinds of effete customs like chairs-she called them \"body shelves\"-but this was looked down upon by the solid middle class. Much as they disapproved of unnecessary luxury, though, the Tisalvers loved hearing about it, listening with a virtual storm of tongue-clicking when told of mattresses lifted on legs, of ornate chests and wardrobes, and of a superfluity of tableware. They listened also to a description of Mycogenian customs, while Jirad Tisalver stroked his own hair complacently and made it quite obvious that he would as soon think of emasculation as of depilation. Mistress Tisalver was furious at any mention of female subservience and flatly refused to believe that the Sisters accepted it tranquilly. They seized most, however, on Seldon\u0027s. casual reference to the Imperial grounds. When, upon questioning, it turned out that Seldon had actually seen and spoken to the Emperor, a blanket of awe enveloped the family. It took a while before they dared ask questions and Seldon found that he could not satisfy them. He had not, after all, seen much of the grounds and even less of the Palace interior. That disappointed the Tisalvers and they were unremitting in their attempts to elicit more. And, having heard of Seldon\u0027s Imperial adventure, they found it hard to believe Dors\u0027s assertion that, for her part, she had never been anywhere in the Imperial grounds. Most of all, they rejected Seldon\u0027s casual comment that the Emperor had talked and behaved very much as any ordinary human being would. That seemed utterly impossible to the Tisalvers. After three evenings of this, Seldon found himself tiring. He had, at first, welcomed the chance to do nothing for a while (during the day, at least) but view some of the history book-films that Dors recommended. The Tisalvers turned over their book-viewer to their guests during the day with good grace, though the little girl seemed unhappy and was sent over to a neighbor\u0027s apartment to use theirs for her homework. \"It doesn\u0027t help,\" Seldon said restlessly in the security of his room after he had piped in some music to discourage eavesdropping. \"I can see your fascination with history, but it\u0027s all endless detail. It\u0027s a mountainous heap-no, a Galactic heap-of data in which I can\u0027t see the basic organization.\" \"I dare say,\" said Dors, \"that there must have been a time when human beings saw no organization in the stars in the sky, but eventually they discovered the Galactic structure.\" \"And I\u0027m sure that took generations, not weeks. There must have been a time when physics seemed a mass of unrelated observations before the central natural laws were discovered and that took generations.-And what of the Tisalvers?\" \"What of them? I think they\u0027re being very nice.\" \"They\u0027re curious.\" \"Of course they are. Wouldn\u0027t you be if you were in their place?\" \"But is it just curiosity? They seem to be ferociously interested in my meeting with the Emperor.\" Dors seemed impatient. \"Again... its only natural. Wouldn\u0027t you be-if the situation was reversed?\" \"It makes me nervous.\" \"Hummin brought us here.\" \"Yes, but he\u0027s not perfect. He brought me to the University and I was maneuvered Upperside. He brought us to Sunmaster Fourteen, who entrapped us. You know he did. Twice bitten, at least once shy. I\u0027m tired of being questioned.\" \"Then turn the tables, Hari. Aren\u0027t you interested in Dahl?\" \"Of course. What do you know about it to begin with?\" \"Nothing. It\u0027s just one of more than eight hundred sectors and I\u0027ve only been on Trantor a little over two years.\" \"Exactly. And there are twenty-five million other worlds and I\u0027ve been on this problem only a little over two months.-I tell you. I want to go back to Helicon and take up a study of the mathematics of turbulence, which was my Ph.D. problem, and forget I ever saw-or thought I saw-that turbulence gave an insight into human society.\" But that evening he said to Tisalver, \"But you know, Master Tisalver, you\u0027ve never told me what you do, the nature of your work.\" \"Me?\" Tisalver placed his fingers on his chest, which was covered by the simple white T-shirt with nothing underneath, which seemed to be the standard male uniform in Dahl. \"Nothing much. I work at the local holovision station in programming. It\u0027s very dull, but it\u0027s a living.\" \"And it\u0027s respectable,\" said Mistress Tisalver. \"It means he doesn\u0027t have to work in the heatsinks.\" \"The heatsinks?\" said Dors, lifting her light eyebrows and managing to look fascinated. \"Oh well,\" said Tisalver, \"that\u0027s what Dahl is best known for. It isn\u0027t much, but forty billion people on Trantor need energy and we supply a lot of it. We don\u0027t get appreciated, but I\u0027d like to see some of the fancy sectors do without it.\" Seldon looked confused. \"Doesn\u0027t Trantor get its energy from solar power stations in orbit?\" \"Some,\" said Tisalver, \"and some from nuclear fusion stations out on the islands and some from microfusion motors and some from wind stations Upperside, but half\"-he raised a finger in emphasis and his face looked unusually grave-\"half comes from the heatsinks. There are heatsinks in lots of places, but none-none-as rich as those in Dahl. Are you serious that you don\u0027t know about the heatsinks? You sit there and stare at me.\" Dors said quickly, \"We are Outworlders, you know.\" (She had almost said \u0027tribespeople,\u0027 but had caught herself in time.) \"Especially Dr. Seldon. He\u0027s only been on Trantor a couple of months.\" \"Really?\" said Mistress Tisalver. She was a trifle shorter than her husband, was plump without quite being fat, had her dark hair drawn tightly back into a bun, and possessed rather beautiful dark eyes. Like her husband, she appeared to be in her thirties. (After a period in Mycogen, not actually long in duration but intense, it struck Dors as odd to have a woman enter the conversation at will. How quickly modes and manners establish themselves, she thought, and made a mental note to mention that to Seldon-one more item for his psychohistory.) \"Oh yes,\" she said. \"Dr. Seldon is from Helicon.\" Mistress Tisalver registered polite ignorance. \"And where might that be?\" Dors said, \"Why, it\u0027s-\" She turned to Seldon. \"Where is it, Hari?\" Seldon looked abashed. \"To tell you the truth, I don\u0027t think I could locate it very easily on a Galactic model without looking up the coordinates. All I can say is that it\u0027s on the other side of the central black hole from Trantor and getting there by hypership is rather a chore.\" Mistress Tisalver said, \"I don\u0027t think Jirad and I will ever be on a hypership.\" \"Someday, Casilia,\" said Tisalver cheerfully, \"maybe we will. But tell us about Helicon, Master Seldon.\" Seldon shook his head. \"To me that would be dull. Its just a world, like any other. Only Trantor is different from all the rest. There are no heatsinks on Helicon-or probably anywhere else-except Trantor. Tell me about them.\" (\"Only Trantor is different from all the rest.\" The sentence repeated itself in Seldon\u0027s mind and for a moment he grasped at it, and for some reason Dors\u0027s hand-on-thigh story suddenly recurred to him, but Tisalver was speaking and it passed out of Seldon\u0027s mind as quickly as it had entered.) Tisalver said, \"If you really want to know about heatsinks, I can show you.\" He turned to his wife. \"Casilia, would you mind if tomorrow evening I take Master Seldon to the heatsinks.\" \"And me,\" said Dors quickly. \"And Mistress Venabili?\" Mistress Tisalver frowned and said sharply, \"I don\u0027t think it would be a good idea. Our visitors would find it dull.\" \"I don\u0027t think so, Mistress Tisalver,\" said Seldon ingratiatingly. \"We would very much like to see the heatsinks. We would be delighted if you would join us too... and your little daughter-if she wants to come.\" \"To the heatsinks?\" said Mistress Tisalver, stiffening. \"It\u0027s no place at all for a decent woman.\" Seldon felt embarrassed at his gaffe. \"I meant no harm, Mistress Tisalver.\" \"No offense,\" said Tisalver. \"Casilia thinks it\u0027s beneath us and so it is, but as long as I don\u0027t work there, it\u0027s no distress merely to visit and show it to guests. But it is uncomfortable and I would never get Casilia to dress properly.\" They got up from their crouching positions. Dahlite \"chairs\" were merely molded plastic seats on small wheels and they cramped Seldon\u0027s knees terribly and seemed to wiggle at his least body movement. The Tisalvers, however, had mastered the art of sitting firmly and rose without trouble and without needing to use their arms for help as Seldon had to. Dors also got up without trouble and Seldon once again marveled at her natural grace. Before they parted to their separate rooms for the night, Seldon said to Dors, \"Are you sure you know nothing about heatsinks? Mistress Tisalver makes them seem unpleasant.\" \"They can\u0027t be that unpleasant or Tisalver wouldn\u0027t suggest taking us on tour. Let\u0027s be content to be surprised.\" 63. Tisalver said, \"You\u0027ll need proper clothing.\" Mistress Tisalver sniffed markedly in the background. Cautiously, Seldon, thinking of kirtles with vague distress, said, \"What do you mean by proper clothing?\" \"Something light, such as I wear. A T-shirt, very short sleeves, loose slacks, loose underpants, foot socks, open sandals. I have it all for you.\" \"Good. It doesn\u0027t sound bad.\" \"As for Mistress Venabili, I have the same. I hope it fits.\" The clothes Tisalver supplied each of them (which were his own) fit fine-if a bit snugly. When they were ready, they bade Mistress Tisalver good-bye and she, with a resigned if still disapproving air, watched them from the doorway as they set off. It was early evening and there was an attractive twilight glow above. It was clear that Dahl\u0027s lights would soon be winking on. The temperature was mild and there were virtually no vehicles to be seen; everyone was walking. In the distance was the ever-present hum of an Expressway and the occasional glitter of its lights could be easily seen. The Dahlites, Seldon noted, did not seem to be walking toward any particular destination. Rather, there seemed to be a promenade going on, a walking for pleasure. Perhaps, if Dahl was an impoverished sector, as Tisalver had implied, inexpensive entertainment was at a premium and what was as pleasant-and as inexpensive-as an evening stroll? Seldon felt himself easing automatically into the gait of an aimless stroll himself and felt the warmth of friendliness all around him. People greeted each other as they passed and exchanged a few words. Black mustaches of different shape and thickness flashed everywhere and seemed a requisite for the Dahlite male, as ubiquitous as the bald heads of the Mycogenian Brothers. It was an evening rite, a way of making sure that another day had passed safely and that one\u0027s friends were still well and happy. And, it soon became apparent, Dors caught every eye. In the twilight glow, the ruddiness of her hair had deepened, but it stood out against the sea of black-haired heads (except for the occasional gray) like a gold coin winking its way across a pile of coal. \"This is very pleasant,\" said Seldon. \"It is,\" said Tisalver. \"Ordinarily, I\u0027d be walking with my wife and she\u0027d be in her element. There is no one for a kilometer around whom she doesn\u0027t know by name, occupation, and interrelationships. I can\u0027t do that. Right now, half the people who greet me... I couldn\u0027t tell you their names. But, in any case, we mustn\u0027t creep along too slowly. We must get to the elevator. It\u0027s a busy world on the lower levels.\" They were on the elevator going down when Dors said, \"I presume, Master Tisalver, that the heatsinks are places where the internal heat of Trantor is being used to produce steam that will turn turbines and produce electricity.\" \"Oh, no. Highly efficient large-scale thermopiles produce electricity directly. Don\u0027t ask me the details, please. I\u0027m just a holovision programmer. In fact, don\u0027t ask anyone the details down there. The whole thing is one big black box. It works, but no one knows how.\" \"What if something goes wrong?\" \"It doesn\u0027t usually, but if it does, some expert comes over from somewhere. Someone who understands computers. The whole thing is highly computerized, of course.\" The elevator came to a halt and they stepped out. A blast of heat struck them. \"It\u0027s hot,\" said Seldon quite unnecessarily. \"Yes, it is,\" said Tisalver. \"That\u0027s what makes Dahl so valuable as an energy source. The magma layer is nearer the surface here than it is anywhere else in the world. So you have to work in the heat.\" \"How about air-conditioning?\" said Dors. \"There is air-conditioning, but it\u0027s a matter of expense. We ventilate and dehumidify and cool, but if we go too far, then we\u0027re using up too much energy and the whole process becomes too expensive.\" Tisalver stopped at a door at which he signaled. It opened to a blast of cooler air and he muttered, \"We ought to be able to get someone to help show us around and he\u0027ll control the remarks that Mistress Venabili will otherwise be the victim of... at least from the men.\" \"Remarks won\u0027t embarrass me,\" said Dors. \"They will embarrass me,\" said Tisalver. A young man walked out of the office and introduced himself as Hano Linder. He resembled Tisalver quite closely, but Seldon decided that until he got used to the almost universal shortness, swarthiness, black hair, and luxuriant mustaches, he would not be able to see individual differences easily. Lindor said, \"I\u0027ll be glad to show you around for what there is to see. It\u0027s not one of your spectaculars, you know.\" He addressed them all, but his eyes were fixed on Dors. He said, \"It\u0027s not going to be comfortable. I suggest we remove our shirts.\" \"It\u0027s nice and cool in here,\" said Seldon. \"Of course, but that\u0027s because we\u0027re executives. Rank has its privileges. Out there we can\u0027t maintain air-conditioning at this level. That\u0027s why they get paid more than I do. In fact, those are the best-paying jobs in Dahl, which is the only reason we get people to work down here. Even so, it\u0027s getting harder to get heatsinkers all the time.\" He took a deep breath. \"Okay, out into the soup.\" He removed his own shirt and tucked it into his waistband. Tisalver did the same and Seldon followed suit. Linder glanced at Dors and said, \"For your own comfort, Mistress, but it\u0027s not compulsory.\" \"That\u0027s all right,\" said Dors and removed her shirt. Her brassiere was white, unpadded, and showed considerable cleavage. \"Mistress,\" said Lindor, \"That\u0027s not-\" He thought a moment, then shrugged and said, \"All right. We\u0027ll get by.\" At first, Seldon was aware only of computers and machinery, huge pipes, flickering lights, and flashing screens. The overall light was comparatively dim, though individual sections of machinery were illuminated. Seldon looked up into the almost-darkness. He said, \"Why isn\u0027t it better lit?\" \"It\u0027s lit well enough... where it should be,\" said Lindor. His voice was well modulated and he spoke quickly, but a little harshly. \"Overall illumination is kept low for psychological reasons. Too bright is translated, in the mind, into heat. Complaints go up when we turn up the lights, even when the temperature is made to go down.\" Dors said, \"It seems to be well computerized. I should think the operations could be turned over to computers altogether. This sort of environment is made for artificial intelligence.\" \"Perfectly right,\" said Lindor, \"but neither can we take a chance on any failures. We need people on the spot if anything goes wrong. A malfunctioning computer can raise problems up to two thousand kilometers away.\" \"So can human error. Isn\u0027t that so?\" said Seldon. \"Oh. yes, but with both people and computers on the job, computer error can be more quickly tracked down and corrected by people and, conversely, human error can be more quickly corrected by computers. What it amounts to is that nothing serious can happen unless human error and computer error take place simultaneously. And that hardly ever happens.\" \"Hardly ever, but not never, eh?\" said Seldon. \"Almost never, but not never. Computers aren\u0027t what they used to be and neither are people.\" \"That\u0027s the way it always seems,\" said Seldon, laughing slightly. \"No, no. I\u0027m not talking memory. I\u0027m not talking good old days. I\u0027m talking statistics.\" At this, Seldon recalled Hummin talking of the degeneration of the times. \"See what I mean?\" said Lindor, his voice dropping. \"There\u0027s a bunch of people, at the C-3 level from the looks of them, drinking. Not one of them is at his or her post.\" \"What are they drinking?\" asked Dors. \"Special fluids for replacing electrolyte loss. Fruit juice.\" \"You can\u0027t blame them, can you?\" said Dors indignantly. \"In this dry heat, you would have to drink.\" \"Do you know how long a skilled C-3 can spin out a drink? And there\u0027s nothing to be done about it either. If we give them five-minute breaks for drinks and stagger them so they don\u0027t all congregate in a group, you simply stir up a rebellion.\" They were approaching the group now. There were men and women (Dahl seemed to be a more or less amphisexual society) and both sexes were shirtless. The women wore devices that might be called brassieres, but they were strictly functional. They served to lift the breasts in order to improve ventilation and limit perspiration, but covered nothing. Dors said in an aside to Seldon, \"That makes sense, Hari. I\u0027m soaking wet there.\" \"Take off your brassiere, then,\" said Seldon. \"I won\u0027t lift a finger to stop you.\" \"Somehow,\" said Dors, \"I guessed you wouldn\u0027t.\" She left her brassiere where it was. They were approaching the congregation of people-about a dozen of them. Dors said, \"If any of them make rude remarks, I shall survive.\" \"Thank you,\" said Lindor. \"I cannot promise they won\u0027t.-But I\u0027ll have to introduce you. If they get the idea that you two are inspectors and in my company, they\u0027ll become unruly. Inspectors are supposed to poke around on their own without anyone from management overseeing them.\" He held up his arms. \"Heatsinkers, I have two introductions to make. We have visitors from outside-two Outworlders, two scholars. They\u0027ve got worlds running short on energy and they\u0027ve come here to see how we do it here in Dahl. They think they may learn something.\" \"They\u0027ll learn how to sweat!\" shouted a heatsinker and there was raucous laughter. \"She\u0027s got a sweaty chest right now,\" shouted a woman, \"covering up like that.\" Dors shouted back, \"I\u0027d take it off, but mine can\u0027t compete with yours.\" The laughter turned good-natured. But one young man stepped forward, staring at Seldon with intense deep-set eyes, his face set into a humorless mask. He said, \"I know you. You\u0027re the mathematician.\" He ran forward, inspecting Seldon\u0027s face with eager solemnity. Automatically, Dors stepped in front of Seldon and Lindor stepped in front of her, shouting, \"Back, heatsinker. Mind your manners.\" Seldon said, \"Wait! Let him talk to me. Why is everyone piling in front of me?\" Lindor said in a low voice, \"If any of them get close, you\u0027ll find they don\u0027t smell like hothouse flowers.\" \"I\u0027ll endure it,\" said Seldon brusquely. \"Young man, what is it you want?\" \"My name is Amaryl. Yugo Amaryl. I\u0027ve seen you on holovision.\" \"You might have, but what about it?\" \"I don\u0027t remember your name.\" \"You don\u0027t have to.\" \"You talked about something called psychohistory.\" \"You don\u0027t know how I wish I hadn\u0027t.\" \"What?\" \"Nothing. What is it you want?\" \"I want to talk to you. Just for a little while. Now.\" Seldon looked at Lindor, who shook his head firmly. \"Not while he\u0027s on his shift.\" \"When does your shift begin, Mr. Amaryl?\" asked Seldon. \"Sixteen hundred.\" \"Can you see me tomorrow at fourteen hundred?\" \"Sure. Where?\" Seldon turned to Tisalver. Would you permit me to see him in your place?\" Tisalver looked very unhappy. \"Its not necessary. He\u0027s just a heatsinker.\" Seldon said, \"He recognized my face. He knows something about me. He can\u0027t be just an anything. I\u0027ll see him in my room.\" And then, as Tisalver\u0027s face didn\u0027t soften, he added, \"My room, for which rent is being paid. And you\u0027ll be at work, out of the apartment.\" Tisalver said in a low voice, \"It\u0027s not me, Master Seldon. It\u0027s my wife, Casilia. She won\u0027t stand for it.\" \"I\u0027ll talk to her,\" said Seldon grimly. \"She\u0027ll have to.\" 64. Casilia Tisalver opened her eyes wide. \"A heatsinker? Not in my apartment.\" \"Why not? Besides, he\u0027ll be coming to my room,\" said Seldon. \"At fourteen hundred.\" \"I won\u0027t have it,\" said Mistress Tisalver. \"This is what comes of going down to the heatsinks. Jirad was a fool.\" \"Not at all, Mistress Tisalver. We went at my request and I was fascinated. I must see this young man, since that is necessary to my scholarly work.\" \"I\u0027m sorry if it is, but I won\u0027t have it.\" Dors Venabili raised her hand. \"Hari, let me take care of this. Mistress Tisalver, if Dr. Seldon must see someone in his room this afternoon, the additional person naturally means additional rent. We understand that. For today, then, the rent on Dr. Seldon\u0027s room will be doubled.\" Mistress Tisalver thought about it. \"Well, that\u0027s decent of you, but it\u0027s not only the credits. There\u0027s the neighbors to think of. A sweaty, smelly heatsinker-\" \"I doubt that he\u0027ll be sweaty and smelly at fourteen hundred, Mistress Tisalver, but let me go on. Since Dr. Seldon must see him, then if he can\u0027t see him here, he\u0027ll have to see him elsewhere, but we can\u0027t run here and there. That would be too inconvenient. Therefore, what we will have to do is to get a room elsewhere. It won\u0027t be easy and we don\u0027t want to do it, but we will have to. So we will pay the rent through today and leave and of course we will have to explain to Master Hummin why we have had to change the arrangements that he so kindly made for us.\" \"Wait.\" Mistress Tisalver\u0027s face became a study of calculation. \"We wouldn\u0027t like to disoblige Master Hummin... or you two. How long would this creature have to stay?\" \"He\u0027s coming at fourteen hundred. He must be at work at sixteen hundred. He will be here for less than two hours, perhaps considerably less. We will meet him outside, the two of us, and bring him to Dr. Seldon\u0027s room. Any neighbors who see us will think he is an Outworlder friend of ours.\" Mistress Tisalver nodded her head. \"Then let it be as you say. Double rent for Master Seldon\u0027s room for today and the heatsinker will visit just this one time.\" \"Just this one time,\" said Dors. But later, when Seldon and Dors were sitting in her room, Dors said, \"Why do you have to see him, Hari? Is interviewing a heatsinker important to psychohistory too?\" Seldon thought he detected a small edge of sarcasm in her voice and he said tartly, \"I don\u0027t have to base everything on this huge project of mine, in which I have very little faith anyway. I am also a human being with human curiosities. We were down in the heatsinks for hours and you saw what the working people there were like. They were obviously uneducated. They were low-level individuals-no play on words intended-and yet here was one who recognized me. He must have seen me on holovision on the occasion of the Decennial Convention and he remembered the word \u0027psychohistory.\u0027 He strikes me as unusual-as out of place somehow-and I would like to talk to him.\" \"Because it pleases your vanity to have become known even to heatsinkers in Dahl?\" \"Well... perhaps. But it also piques my curiosity.\" \"And how do you know he hasn\u0027t been briefed and intends to lead you into trouble as has happened before.\" Seldon winced. \"I won\u0027t let him run his fingers through my hair. In any case, we\u0027re more nearly prepared now, aren\u0027t we? And I\u0027m sure you\u0027ll be with me. I mean, you let me go Upperside alone, you let me go with Raindrop Forty-Three to the microfarms alone, and you\u0027re not going to do that again, are you?\" \"You can be absolutely sure I won\u0027t,\" said Dors. \"Well then, I\u0027ll talk to the young man and you can watch out for traps. I have every faith in you.\" 65. Amaryl arrived a few minutes before 1400, looking warily about. His hair was neat and his thick mustache was combed and turned up slightly at the edges. His T-shirt was startlingly white. He did smell, but it was a fruity odor that undoubtedly came from the slightly overenthusiastic use of scent. He had a bag with him. Seldon, who had been waiting outside for him, seized one elbow lightly, while Dors seized the other, and they moved rapidly into the elevator. Having reached the correct level, they passed through the apartment into Seldon\u0027s room. Amaryl said in a low hangdog voice, \"Nobody home, huh?\" \"Everyone\u0027s busy,\" said Seldon neutrally. He indicated the only chair in the room, a pad directly on the floor. \"No,\" said Amaryl. \"I don\u0027t need that. One of you two use it.\" He squatted on the floor with a graceful downward motion. Dors imitated the movement, sitting on the edge of Seldon\u0027s floor-based mattress, but Seldon dropped down rather clumsily, having to make use of his hands and unable, quite, to find a comfortable position for his legs. Seldon said, \"Well, young man, why do you want to see me?\" \"Because you\u0027re a mathematician. You\u0027re the first mathematician I ever saw-close up-so I could touch him, you know.\" \"Mathematicians feel like anyone else.\" \"Not to me, Dr... Dr... Seldon?\" \"That\u0027s my name.\" Amaryl looked pleased. \"I finally remembered.-You see, I want to be a mathematician too.\" \"Very good. What\u0027s stopping you?\" Amaryl suddenly frowned. \"Are you serious?\" \"I presume something is stopping you. Yes, I\u0027m serious.\" \"What\u0027s stopping me is I\u0027m a Dahlite, a heatsinker on Dahl. I don\u0027t have the money to get an education and I can\u0027t get the credits to get an education. A real education, I mean. All they taught me was to read and cipher and use a computer and then I knew enough to be a heatsinker. But I wanted more. So I taught myself.\" \"In some ways, that\u0027s the best kind of teaching. How did you do that?\" \"I knew a librarian. She was willing to help me. She was a very nice woman and she showed me how to use computers for learning mathematics. And she set up a software system that would connect me with other libraries. I\u0027d come on my days off and on mornings after my shift. Sometimes she\u0027d lock me in her private room so I wouldn\u0027t be bothered by people coming in or she would let me in when the library was closed. She didn\u0027t know mathematics herself, but she helped me all she could. She was oldish, a widow lady. Maybe she thought of me as a kind of son or something. She didn\u0027t have children of her own.\" (Maybe, thought Seldon briefly, there was some other emotion involved too, but he put the thought away. None of his business.) \"I liked number theory,\" said Amaryl. \"I worked some things out from what I learned from the computer and from the book-films it used to teach me mathematics. I came up with some new things that weren\u0027t in the book-films.\" Seldon raised his eyebrows. \"That\u0027s interesting. Like what?\" \"I\u0027ve brought some of them to you. I\u0027ve never showed them to anyone. The people around me-\" He shrugged. \"They\u0027d either laugh or be annoyed. Once I tried to tell a girl I knew, but she just said I was weird and wouldn\u0027t see me anymore. Is it all right for me to show them to you?\" \"Quite all right. Believe me.\" Seldon held out his hand and after a brief hesitation, Amaryl handed him the bag he was carrying. For a long time, Seldon looked over Amaryl\u0027s papers. The work was naive in the extreme, but he allowed no smile to cross his face. He followed the demonstrations, not one of which was new, of course-or even nearly new-or of any importance. But that didn\u0027t matter. Seldon looked up. \"Did you do all of this yourself?\" Amaryl, looking more than half-frightened, nodded his head. Seldon extracted several sheets. \"What made you think of this?\" His finger ran down a line of mathematical reasoning. Amaryl looked it over, frowned, and thought about it. Then he explained his line of thinking. Seldon listened and said, \"Did you ever read a book by Anat Bigell?\" \"On number theory?\" \"The title was Mathematical Deduction. It wasn\u0027t about number theory, particularly.\" Amaryl shook his head. \"I never heard of him. I\u0027m sorry.\" \"He worked out this theorem of yours three hundred years ago.\u0027 Amaryl looked stricken. \"I didn\u0027t know that.\" \"I\u0027m sure you didn\u0027t. You did it more cleverly, though. It\u0027s not rigorous, but-\" \"What do you mean, \u0027rigorous\u0027?\" \"It doesn\u0027t matter.\" Seldon put the papers back together in a sheaf, restored it to the bag, and said, \"Make several copies of all this. Take one copy, have it dated by an official computer, and place it under computerized seal. My friend here, Mistress Venabili, can get you into Streeling University without tuition on some sort of scholarship. You\u0027ll have to start at the beginning and take courses in other subjects than mathematics, but-\" By now Amaryl had caught his breath. \"Into Streeling University? They won\u0027t take me.\" \"Why not? Dors, you can arrange it, can\u0027t you?\" \"I\u0027m sure I can.\" \"No, you can\u0027t,\" said Amaryl hotly. \"They won\u0027t take me. I\u0027m from Dahl.\" \"Well?\" \"They won\u0027t take people from Dahl.\" Seldon looked at Dors. \"What\u0027s he talking about?\" Dors shook her head. \"I really don\u0027t know.\" Amaryl said, \"You\u0027re an Outworlder, Mistress. How long have you been at Streeling?\" \"A little over two years, Mr. Amaryl.\" \"Have you ever seen Dahlites there-short, curly black hair, big mustaches?\" \"There are students with all kinds of appearances.\" \"But no Dahlites. Look again the next time you\u0027re there.\" \"Why not?\" said Seldon. \"They don\u0027t like us. We look different. They don\u0027t like our mustaches.\" \"You can shave your-\" but Seldon\u0027s voice died under the other\u0027s furious glance. \"Never. Why should I? My mustache is my manhood.\" \"You shave your beard. That\u0027s your manhood too.\" \"To my people it is the mustache.\" Seldon looked at Dors again and murmured, \"Bald heads, mustaches... madness.\" \"What?\" said Amaryl angrily. \"Nothing. Tell me what else they don\u0027t like about Dahlites.\" \"They make up things not to like. They say we smell. They say we\u0027re dirty. They say we steal. They say we\u0027re violent. They say we\u0027re dumb.\" \"Why do they say all this?\" \"Because its easy to say it and it makes them feel good. Sure, if we work in the heatsinks, we get dirty and smelly. If we\u0027re poor and held down, some of us steal and get violent. But that isn\u0027t the way it is with all of us. How about those tall yellow-hairs in the Imperial Sector who think they own the Galaxy-no, they do own the Galaxy. Don\u0027t they ever get violent? Don\u0027t they steal sometimes? If they did my job, they\u0027d smell the way I do. If they had to live the way I have to, they\u0027d get dirty too.\" \"Who denies that there are people of all kinds in all places?\" said Seldon. \"No one argues the matter! They just take it for granted. Master Seldon, I\u0027ve got to get away from Trantor. I have no chance on Trantor, no way of earning credits, no way of getting an education, no way of becoming a mathematician, no way of becoming any thing but what they say I am... a worthless nothing.\" This last was said in frustration-and desperation. Seldon tried to be reasonable. \"The person I\u0027m renting this room from is a Dahlite. He has a clean job. He\u0027s educated.\" \"Oh sure,\" said Amaryl passionately. \"There are some. They let a few do it so that they can say it can be done. And those few can live nicely as long as they stay in Dahl. Let them go outside and they\u0027ll see how they\u0027re treated. And while they\u0027re in here they make themselves feel good by treating the rest of us like dirt. That makes them yellow-hairs in their own eyes. What did this nice person you\u0027re renting this room from say when you told him you were bringing in a heatsinker? What did he say I would be like? They\u0027re gone now... wouldn\u0027t be in the same place with me.\" Seldon moistened his lips. \"I won\u0027t forget you. I\u0027ll see to it that you\u0027ll get off Trantor and into my own University in Helicon-once I\u0027m back there myself.\" \"Do you promise that? Your word of honor? Even though I\u0027m a Dahlite?\" \"The fact that you\u0027re a Dahlite is unimportant to me. The fact that you are already a mathematician is! But I still can\u0027t quite grasp what you\u0027re telling me. I find it impossible to believe that there would be such unreasoning feeling against harmless people.\" Amaryl said bitterly, \"That\u0027s because you\u0027ve never had any occasion to interest yourself in such things. It can all pass right under your nose and you wouldn\u0027t smell a thing because it doesn\u0027t affect you. \" Dors said, \"Mr. Amaryl, Dr. Seldon is a mathematician like you and his head can sometimes be in the clouds. You must understand that. I am a historian, however. I know that it isn\u0027t unusual to have one group of people look down upon another group. There are peculiar and almost ritualistic hatreds that have no rational justification and that can have their serious historical influence. It\u0027s too bad.\" Amaryl said, \"Saying something is \u0027too bad\u0027 is easy. You say you disapprove, which makes you a nice person, and then you can go about your own business and not be interested anymore. It\u0027s a lot worse than \u0027too bad.\u0027 It\u0027s against everything decent and natural. We\u0027re all of us the same, yellow-hairs and black-hairs, tall and short, Easterners, Westerners, Southerners, and Outworlders. We\u0027re all of us, you and I and even the Emperor, descended from the people of Earth, aren\u0027t we?\" \"Descended from what?\" asked Seldon. He turned to look at Dors, his eyes wide. \"From the people of Earth!\" shouted Amaryl. \"The one planet on which human beings originated.\" \"One planet? Just one planet?\" \"The only planet. Sure. Earth.\" \"When you say Earth, you mean Aurora, don\u0027t you?\" \"Aurora? What\u0027s that?-I mean Earth. Have you never heard of Earth?\" \"No,\" said Seldon. \"Actually not.\" \"It\u0027s a mythical world,\" began Dors, \"that-\" \"It\u0027s not mythical. It was a real planet.\" Seldon sighed. \"I\u0027ve heard this all before. Well, let\u0027s go through it again. Is there a Dahlite book that tells of Earth?\" \"What?\" \"Some computer software, then?\" \"I don\u0027t know what you\u0027re talking about.\" \"Young man, where did you hear about Earth?\" \"My dad told me. Everyone knows about it.\" \"Is there anyone who knows about it especially? Did they teach you about it in school?\" \"They never said a word about it there.\" \"Then how do people know about it?\" Amaryl shrugged his shoulders with an air of being uselessly badgered over nothing. \"Everyone just does. If you want stories about it, there\u0027s Mother Rittah. I haven\u0027t heard that she\u0027s died yet.\" \"Your mother? Wouldn\u0027t you know-\" \"She\u0027s not my mother. That\u0027s just what they call her. Mother Rittah. She\u0027s an old woman. She lives in Billibotton. Or used to.\" \"Where\u0027s that?\" \"Down in that direction,\" said Amaryl, gesturing vaguely. \"How do I get there?\" \"Get there? You don\u0027t want to get there. You\u0027d never come back.\" \"Why not?\" \"Believe me. You don\u0027t want to go there.\" \"But I\u0027d like to see Mother Rittah.\" Amaryl shook his head. \"Can you use a knife?\" \"For what purpose? What kind of knife?\" \"A cutting knife. Like this.\" Amaryl reached down to the belt that held his pants tight about his waist. A section of it came away and from one end there flashed out a knife blade, thin, gleaming, and deadly. Dors\u0027s hand immediately came down hard upon his right wrist. Amaryl laughed. \"I wasn\u0027t planning to use it. I was just showing it to you.\" He put the knife back in his belt. \"You need one in self-defense and if you don\u0027t have one or if you have one but don\u0027t know how to use it, you\u0027ll never get out of Billibotton alive. Anyway\"-he suddenly grew very grave and intent-\"are you really serious, Master Seldon, about helping me get to Helicon?\" \"Entirely serious. That\u0027s a promise. Write down your name and where you can be reached by hypercomputer. You have a code, I suppose.\" \"My shift in the heatsinks has one. Will that do?\" \"Yes.\" \"Well then,\" said Amaryl, looking up earnestly at Seldon, \"this means I have my whole future riding on you, Master Seldon, so please don\u0027t go to Billibotton. I can\u0027t afford to lose you now.\" He turned beseeching eyes on Dors and said softly, \"Mistress Venabili, if he\u0027ll listen to you, don\u0027t let him go. Please.\"","sourceLink":"https://allnovel.net/prelude-to-foundation-foundation-6/page-14.html","bookId":2020,"book":{"id":2020,"title":"Prelude to Foundation (Foundation #6)","description":"Storyline: Prelude to Foundation (Foundation: Prequel, #1) It is the year 12,020 G.E. and Emperor Cleon I sits uneasily on the Imperial throne of Trantor. Here in the great multidomed capital of the Galactic Empire, forty billion people have created a civilization of unimaginable technological and cultural complexity. Yet Cleon knows there are those who would see him fall - those whom he would destroy if only he could read the future. Hari Seldon has come to Trantor to deliver his paper on psychohistory, his remarkable theory of prediction. Little does the young Outworld mathematician know that he has already sealed his fate and the fate of humanity. For Hari possesses the prophetic power that makes him the most wanted man in the Empire... the man who holds the key to the future - an apocalyptic power to be know forever after as the Foundation.","cover":"https://allnovel.net/images/prelude-to-foundation-foundation-6.jpg","author":"Isaac Asimov","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/prelude-to-foundation-foundation-6.html","creation":"Oct 5, 2019 8:58:15 AM","modification":"Oct 5, 2019 11:07:52 PM"}}
