{"id":24858,"no":3,"title":"CHAPTER II. THE SECRET FOE.","content":"In the pleasant valley of the Scioto, near what is now the town of Chillicothe, stood the principal village of the great Shawnee nation—the Indian tribe that could bring ten thousand warriors into the field—deadly enemies of the pale-faced intruder. All was bustle within the Indian village. To one used to the Indian customs, it would have been plain that the red-skins were preparing for the war-path. The village was alive with warriors. Gayly-painted savages, decked with ocher and vermilion, strutted proudly up and down, eagerly waiting for the time to come when, like tigers, they could spring upon the pale-faces and redden their weapons with the blood of their hated foes. Over the village ruled the great chief, Ke-ne-ha-ha, or “The-man-that-walks”—so termed, first, because he was reputed to be the fastest runner of any red braves in the Ohio valley, Shawnee, Wyandot or Mingo; second, that when a youth, on his first war-path against the Hurons, he had stolen by night into the midst of a Huron village, literally walked among the sleeping warriors, and brought back to his comrades the scalp of a great Huron chief, whom he had dispatched without alarming the sleepers—the greatest warrior in all the Shawnee nation—a chief wise in council, brave on the war-path, and wily as the red fox. In the village of the red-men were two whose skins were white, though they were Indians at heart. The two were renegades from their country and their kin. These two stood together by the river’s bank, and idly watched the daring and howling warriors. They were dressed in the Indian fashion, and were sinewy, powerful men in build. The taller of the two, whose hair and eyes were dark, was called Simon Girty. At one time he had been reputed to be one of the best scouts on the border, but, for some reason, he had forsaken the settlements and found a home with the fierce red-men of the forest-wild, giving up home, country, friends, every thing. He had been adopted into the Indian tribe, and none of his red-skinned brothers seemed to bear as deadly a hatred to the whites as this renegade, Simon Girty. His companion was not quite so tall, or as stoutly built. He was called David Kendrick, and was an adopted son of the Shawnees, as Girty was of the Wyandots. “This is going to be a bloody business,” said Girty, as he surveyed the yelling Indians, who were busy in the “scalp-dance.” “Yes, our chief, Ke-ne-ha-ha, has sworn to break the power of the whites along the Ohio. The braves are well provided with arms by the British Governor. Kentucky never saw such a force upon her border as this will be,” replied the other. “The more the better,” said the renegade, Girty, moodily. Then a howl of anguish rung through the Indian village. The braves stopped their sports to listen. They knew the signal well: it was the wail for the dead. It told that some Shawnee warrior had gone to the spirit-land. The cry of anguish came from a party of braves entering the village from the south. In their midst they bore what seemed, to the eyes of the renegades, a human body. The warriors deposited their burden before the door of the council-lodge. Attracted by the death-note, Ke-ne-ha-ha, the great chief of the Shawnees, came from his lodge. The chief was a splendid specimen of a man. He stood nearly six feet in hight, and was as straight as an arrow. He was quite light in hue for an Indian, and his features were intelligent and finely cut. Astonishment flashed from his eyes as he gazed upon the face of the dead Indian, around whom, at a respectful distance, were grouped the Shawnee warriors. The chief recognized the features of the brave known as Little Crow, a stout warrior, and reputed to be one of the best fighting-men in all the Shawnee nation. “Wah!” said the chief, in a tone that betrayed deep astonishment, “the soul of the Little Crow has gone to the spirit-land—he rests in Manitou’s bosom. Let my braves speak—who has taken the life of the Shawnee warrior?” “Let the chief open his ears and he shall hear,” replied one of the braves, a tall, muscular warrior, known as Watega. “Little Crow went forth, last night, to hunt the deer in the woods of the Scioto. He was a great warrior; his arm was strong—his feet swift on the trail. He told his brothers that he would return before the spirit-lights (stars) died. He did not come. His brothers sought for him. By the banks of the Scioto they found him, but the hatchet of a foe had taken the life of the Little Crow.” Then the chief knelt by the side of the body and examined the wound in the head; the clotted blood marked the spot. The head of the chief had been split open by a single blow, and that dealt by a giant’s hand. The wound had apparently been made by a tomahawk, and, as the chief guessed, the dead man had been attacked suddenly, and from the rear. “Did my warriors find no trail of the enemy who took the life of their brother?” asked the chief, still keeping his position by the body, and with a puzzled look upon his face. “Wah!—the Shawnee braves have eyes—they are not blind, like owls in the light. When they found the Little Crow dead, they looked for the track of the foe. They found footprints by the body, but the trail came from nowhere and went nowhere.” “And the footprints—Indian or pale-face?” “Pale-face, but the moccasins of the red-man,” answered the brave. The brow of the chief grew dark. A white foe so near the village of the Shawnee, and so daring as to attack and kill one of the best warriors of the tribe, apparently without a struggle, must needs be looked after. “My braves must hunt down the pale-face that wears the moccasin of the Indian and uses the tomahawk,” said the chief, gravely. Then Ke-ne-ha-ha drew aside the blanket that was wrapt around the body of the dead brave. A cry of horror broke from the lips of the great chief, and was re-echoed by the surrounding Indians when they gazed upon the naked breast of the dead warrior. “The totem of the Wolf Demon!” exclaimed the chief. The circle of friends gazed upon the mysterious mark in silent consternation. Their staring eyes and fear-stricken[4] countenances showed plainly how deeply they were interested. And what was the totem of the Wolf Demon? On the naked breast of the brawny dead chief were three slashes, apparently made by a knife, thus: Red Arrow And the blood, congealing on the skin, formed a Red Arrow. It was the totem of the Wolf Demon—the invisible and fatal scourge of the great Shawnee nation. Thus he marked his victims. The chief arose with a troubled look upon his haughty face. “Let my people sing the death-song, for a brave warrior has gone to the spirit-land. Ke-ne-ha-ha will seek the counsel of the Great Medicine Man, so that he may learn how to fight the Wolf Demon, who has stricken unto death the great braves of the Shawnee nation, and put the totem of the Red Arrow upon their breast.” Sorrowfully the warriors obeyed the words of the chief, and soon the sound of lamentation wailed out loud on the air, which, but a moment before, had resounded with the glad shouts of triumph. Slowly and with knitted brows Ke-ne-ha-ha betook himself to the lodge of the old Indian who was the Great Medicine Man of the Shawnee tribe. The death of one of the principal warriors of his tribe by the dreaded hand of the Wolf Demon, almost within the very precincts of his village, and at the moment when he was preparing to set out on his expedition against the whites, seemed like an omen of evil. A dark cloud descended upon his soul, despite all his efforts to remove it. The two renegades had joined the circle around the dead Indian, and had listened to the story of how he met his death. Then, when the circle had broken up, they had slowly walked back again to their former position by the bank of the river. A puzzled look was upon Girty’s face. After they had resumed their former station, he spoke: “Dave, the words of the chief are a mystery to me, though the Indians seem to understand them well enough. What did he mean when he spoke of the Wolf Demon? and what did that mark of a Red Arrow, cut on the breast of the dead Indian, mean?” “Why, don’t you know?” asked the other, in astonishment. “No; you forget that for the past six months I have been at upper Sandusky, with the Wyandots.” “Yes; and it is just about six months since the Wolf Demon first appeared.” “Explain,” said Girty, unable to guess the mystery. “I will. For the past six months some mysterious being has singled out the warriors of the Shawnee tribe for his victims. He always seems to take them by surprise; single warriors alone he attacks. And on the breast of those he kills he leaves, as his mark, three slashes with a knife forming a Red Arrow, like the one you saw on this fellow.” “But the name of the Wolf Demon?” “I will explain. One Indian alone has lived to tell of an encounter with this mysterious slayer. He was only stunned, and recovered. He reported that he was attacked by a huge gray wolf, with a man’s head—the face painted black and white. The wolf stood on its hind legs like a man, but in hight far out-topping any human. He caught a glimpse of the monster as it struck him down with a tomahawk that the beast held in its paws. And that’s the story of the Wolf Demon, who has killed some of the bravest warriors of the Shawnee nation.” “But what do you think it is?” “I reckon it’s the devil,” said the renegade, solemnly.","sourceLink":"http://novel.tingroom.com/duanpian/2939/80710.html","bookId":1090,"book":{"id":1090,"title":"The Wolf Demon or, The Queen of the Kanawha","description":"简介： The great, round moon looked down in a flood of silver light upon the virgin forest by the banks of the Scioto, the beautiful river which winds through the richest and fairest valley in all the wide western landthe great corn valley of the Shawnee tr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2939","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
