{"id":44958,"no":13,"title":"CHAPTER XIII","content":"Instead of the Christmas season making Thurley homesick, it lent a vivacious joy that caused Ernestine Christian and Polly Harris to marvel at her development. The atmosphere of the city had its foothold. She thought, if at all, of the Christmas preparations in Birge’s Corners, with passing scorn. Thurley’s thoughts had been rather well regulated by routine until she was left with but scant time for reminiscence. No lesson had been done away with but more added. She spent twice as much time at Hobart’s studio, either with him or with the Bohemian singing teacher whom she loathed but who knew how to guide her voice into unsurpassed channels. Then there were hateful languages to conquer and, if she disliked the social secretary or the gymnast or the corps of other workers who were making her “ready” to sing for her supper on the opera stage, they continued to appear at regular intervals until Thurley realized that Bliss Hobart had had method in his madness, for he had seen the need of curbing a rebellious and turbulent spirit, one that tired too quickly of routine for its own good. In reality, he was teaching her the grind, which most artists never escape, in a condensed and merciful fashion. Thurley was beginning to realize even more of this great question of “values.” In the old days at the Corners when gray, sullen moods conquered her sunny self, she had been wont to take refuge within the box-car[149] wagon or the hilly cemetery, to sob without reason or plan rebellions of which neither Dan nor Betsey Pilrig could have had the slightest understanding! Now she called a taxi and drove through the parks or out suburban roads, thinking the same quality of thoughts with different and widely varied guises and returning, as she had done from the box-car wagon or cemetery, light hearted, dangerously glad for every one, singing like a meadow lark and insisting on doing things for whosoever might come her way almost to the extent of exaggeration. Formerly, when saddish longings and presentiments would sweep over the wild rose Thurley, she had tramped through the pine woods as sturdily as a soldier under his captain’s orders, tramping, tramping, tramping up through the amphitheater of hills which lay outside the town. Finally, she would come upon a pasture clearing and here she would sit, exhausted but filled with sweet contentment, at the “top of the world” she fondly called it, looking down at the little village which seemed a cardboard play-town and dreaming of the day when she should stand at the top of the world to sing and all the cardboard towns in the universe should listen and applaud. In New York, Thurley took another method when pessimism interrupted common sense routine. She went to the piano and practised until her throat gave warning to cease and she could again face the world as the wild-rose-with-a-prophecy-of-the-hothouse-variety Thurley, baby of the great “family,” an interesting young goddess who seldom voiced an opinion but who could sweep away opinions if she sang a ballad (unbeknownst to her present audience) with thoughts of Dan or Philena or the old days in the wagon as the inspiration! [150] During those effervescent moods of abandon which fairly intoxicated all those who saw Thurley under their spell—back in the Corners—she had always rushed down to the emporium and coaxed Dan away on a frolic—a picnic, if summer, or skating, if winter. They would sit, these two, on the porch of a deserted lake mansion dreaming dreams of a lyric quality with a sincerity which made both the boy and the girl the better for having dreamed them! Thurley would weave garlands of wild flowers—Dan gathering them—and she would come home to Betsey Pilrig, her cheeks like roses and her eyes like stars, singing a spring song and causing Betsy to lapse into Ali Baba’s favorite expression, “Land sakes and Mrs. Davis—Thurley, be you from another world?” The joyous moods, these days, came very seldom. To some degree they happened when Ernestine told her that Hobart was pleased with her progress or when Polly Harris kissed her and said she was a little sister to the great; some faint imitation of them was experienced when Caleb took her motoring and told her his humorous troubles or when she went with Miss Clergy and Hobart to the first opera—“Rigoletto”—and saw with the grave, conceited eyes of youth herself outshining the present Gilda—herself standing with outstretched arms to acknowledge the applause. The wild joy was felt for half an instant when Collin Hedley said he would paint the infant before her début—there would be no fun at all in painting her when she was famous and unapproachable, waving engagement tablets at a mere artist. Thurley came to realize clearly the difference in the inspiration of her joy—the joy which had been her solace during the gray, hungry days of childhood. In[151] Birge’s Corners supreme mirth came from smell of new mown hay, with sunshine sparkling all about, or the summer breeze kissing the little curls at the delicious nape of her white, soft neck—it was generated by the discovery of the first violets or the exhilaration of a skating party with Dan, by some baby’s laughing face or Betsey’s pleased smile—and most of all by Dan’s ardor. Thurley told herself with almost shamed admission that her values had changed. But if Thurley changed quickly during the winter, Miss Clergy stayed the same feeble, at times querulous, ghost lady, always willing for Thurley to go to places without her, trusting the girl as one would trust a matron, content, now that she had roused from her neurotic lethargy, to lapse into a semi-doze with a vigilant eye for only two things—to have Thurley succeed as a spinster and to have no one become personally acquainted with her own withered self lest memories be unearthed over which she mourned in vain. So Thurley came and went at will and the family became used to the fact that the infant’s benefactress was a “character.” For that matter the family themselves were characters with pet “phobias” and hobbies and theories, to say nothing of scars, cotton-wooled and well protected from the bromidic world. It was Christmas week when Thurley experienced a savage mood—anger really the stimulus—for she had bought a supply of frocks and hats preparatory to the “family’s” Christmas festivities when Ernestine wrote her a note from Chicago, where she was playing engagements, saying that she would not be home until January and she was writing before Christmas purposely because she never had believed in the holiday and neither gave nor accepted gifts; therefore she wished the child-Thurley[152] all good things and to work as hard as she could; she would see her within a few weeks. The savage mood began to manifest itself as Thurley read the careless note. Like the writer, its force and decision were unquestionable. Thurley had prepared gifts for all members of the family in the same impulsive fashion as for every one she had loved back at the Corners. She went to the bureau drawer and opened it to examine them—they seemed garish and absurd. She was not yet at the topnotch of fame which allows one to do whatsoever one will and have it accepted. If she had made her début and chosen to present Ernestine Christian with one of those gilded rolling pins with a regiment of hooks which hung on the doors of many of the best families in the Corners, it would have been received in resigned silence. As it was, the purse she had chosen for Ernestine was probably not at all what she would have liked; Thurley would give it to the room maid instead. She would think it quite wonderful and carry it for shopping or Sunday mass! She looked at the handkerchiefs she had for Polly Harris—but Polly would probably make some sarcastic squib at their expense and never be seen with one protruding from her smock pocket. No, the handkerchiefs would do for the social secretary and the antique leather box for Caleb she would press upon the gymnast, while the book on art originally intended for Collin would be relegated to the scrap heap! Thurley laughed aloud as she thought of giving Collin a book on art—when Collin, foremost portrait painter in America, had written a book on art which was used as an authority by the younger school ... well, it had not been so very long since she had bought her gifts at Dan’s store with Dan refusing her money and had done them up in white tissue[153] and the reddest of red ribbon, flying about like a good fairy on Christmas Eve to leave them at doorsteps! After re-reading Ernestine’s note, Thurley came to the conclusion that Christmas was not for those afflicted with exaggerated ego but merely for those who held good jobs. She had bought no present for Sam Sparling or Mark Wirth, the latter still abroad, and as for Bliss Hobart, her fingers fearfully touched the carved idol—a metal Buddha mounted on teakwood. Why she had selected it, after endless excursions to endless shops, Thurley did not know—perhaps it was because she had never seen one in his office where there was everything else under the sun from a Filipino kris to a bibelot which had belonged to Marie Antoinette. Or perhaps there was another reason—at any rate, she had recklessly bought the idol and sacrificed her spending money for a month to come, blushing furiously each time she planned what to write on the accompanying card. She could hardly give the Buddha to a bellboy and she had purchased black gloves for Miss Clergy, the presents for Betsey, Ali Baba and Hopeful being on their way. She pushed the Buddha back in the drawer and went to her lesson with Hobart with a reserved, patronizing manner which amused him and his amusement, in turn, angered Thurley. Fame seemed something which would strangle everything commonplace and joyous, Thurley thought, as she mechanically did her exercises. These persons were so ultra, so fond of “my taste in dress”—“the way I eat my artichokes”—“the sort of wall paper in my studio”—so over developed and emphasized that they made clever, well bred fun of the “pastoral joys,” as Ernestine[154] named them, all the while amusingly unconscious of the whine of conceit which crept into their voices whenever they made a drastic statement. There ought to be a refined, sulphitic, fumigated holiday just for this sort of people, Thurley thought. She was driving home and watching the crowds of shoppers laden with packages who tried to make their way across the street. They were good-natured crowds because they were buying something for some one else and she longed to leave the cab and be one with them, to jostle and sway together until the traffic signal was given and then to dash across to reach a crosstown car and to end, breathless, disordered of hat and hair but happy, in some small home where the packages were relegated to the top shelf and a recital of the day’s happenings told to the master of the household over a supper of steak, coffee and baker’s pie! Up to this moment Thurley had not experienced homesickness, but as the cab shot on in patrician fashion she began recalling the fattened turkey they would have at Birge’s Corners and the way Betsey had made her pudding and Christmas cakes days before, as well as the nights Dan had called for her to have her aid in trimming the store windows with make-believe fireplaces and tinsel stars; the way the boys and girls went into the woods for the smallest fir trees and decorated the church until it was “a bower of beauty,” according to the Gazette report; how the choir would practise the Christmas anthem and carols night after night with Thurley directing, playing the organ and singing. On Christmas morning would come the service with Thurley, the envy of every girl in town because of her new pin or bracelet or chain which Dan had given her, singing “The Birthday of a King” in a glorious, clear voice—like[155] some one permitted to sing down from the clouds for an instant! Oh, it was good to remember—good?—Thurley’s eyes filled with tears. She told the man to drive on until she ordered him to turn back to her hotel. She laughed as she snuggled down in the machine, drawing a robe over her lap and prepared to dream-remember. As she did so, she recalled Caleb Patmore’s saying to Ernestine one afternoon at tea, “I’m going into the ooze again.” To which Ernestine answered, “Jolly lark, isn’t it? Don’t make it a habit or you may slip into it altogether—then you would be helpless.” “Take the advice for yourself,” he had retorted, to which she nodded her head and the subject was dropped. When Thurley asked her about it, Ernestine said with a trace of confusion, “You child, you’re not ready for any ‘ooze’ game yet; you are still in it in actuality to an extent. When you begin to want to go to nerve specialists and are not hungry enough for bread and butter but keen on frosted cake as it were, knowing nothing but work and wanting to know nothing but play, when your day’s program—not the one written by your press agent—is as impossible as a typewritten love letter, you’ll find the ooze. I’ll show you how to find it.” But Thurley had insisted, like a true Pandora, upon knowing and so Ernestine good-naturedly tried to explain. “My nice creature, when people are so famous they experience loneliness because they are quite shut away from those who are quite famous, they cannot exist on work no matter in what line their talent may be—nor[156] on lollipop praise of the public nor carping criticisms. They must have an antidote. Yet they cannot sacrifice their relentless system of life which takes a first mortgage on their time and energy. So while you hear of us as having huge poultry farms and see our pictures taken in the act of garroting a red pepper from Madame So and So’s truck farm where she spends most of her time when not—and so on, or read an interview in which one of us declares a submarine boat to be our favorite siesta spot, please know it is not true. But throughout the years of endless work and surrender of the mystical force constituting genius, we have just to be children—and pretend. There, that is the whole thing in a nutshell—pretend just as children fancy themselves policemen, motormen, kings and fairy queens all the while swallowing the mortification of domineering nurses and bibs. We live with our memories, many times, if they are pleasant. How rich a confession Caleb could wring out of us, if he were not so sluggish! We dream-play, fancy, create a world within a world. Bliss Hobart in a fit of cynicism—I noticed he began taking pepsin the following week—named it ‘the ooze’—and it became our trade name for it. The ooze, the unreal, really unimportant and absurd, yet ready to be lived with and yet to vanish, the state of mind which we people as we wish and live house-and-garden lives for as much as half an hour at a time! You may not give this credence, but it is quite as real as my piano or Collin’s brush. And heaven grant you won’t need the ooze, Thurley, for a little! Still, it is a lovely, plastic state of thought—like those lavender and gold butterflies you find lingering in the corners of Whistler’s paintings or that flutter in the margins of special editions.” “Why don’t you have the—the ooze be real—live[157] a fifty-fifty sort of existence?” Thurley borrowed Dan’s slang. “It would be like blending chilblains and poetry or mosquitoes and mahogany—impossible! That is why they say all genius is a trifle mad. Remember, the ooze is your best friend! Why, after a fatiguing concert, I’ve played I was the bustling, happy mother of half a dozen youngsters, the type of American housewife who does all her work except the washing and whose hands grow red and hardened yet are sparkling with diamonds, whose children grow up and adore her—I’ve lived in a red brick house with those diamond-shaped panes at the front windows and dotted muslin curtains criss-crossed—you know—and I’ve entertained bridge clubs galore, making mayonnaise and maple parfait myself while the baby was napping—” and when Thurley had clamored for a clearer understanding, Ernestine ordered her off to study her French and forget she shared the secret of the “ooze.” “What is Bliss Hobart’s ooze?” she had insisted. “I think he plays he runs an ice cream soda fountain in Harlem,” Ernestine had answered to be rid of her. At the time Thurley had seriously questioned Ernestine’s sanity. But this snowy December night the ooze became very real to her and, unknowingly, Thurley passed a telling boundary line of progress. She dreamed on of Birge’s Corners—she saw the Christmas entertainment taking place. There was the awful make-believe chimney which the Sunday-school superintendent, invariably the thinnest man in town, was to descend, fragments of his cotton beard floating about the stage after the feat was accomplished. She could see the primary class waving the red satin banner symbolic of the best attendance—strange,[158] how excellent is the Sunday-school attendance during holiday season—and then marching on the stage to sing in a series of mouse-like squeaks, “Jolly Old Saint Nicholas” while their teacher, in love with Jo Drummer, the Santa Claus, stood below to direct them and wonder if Jo was properly impressed with her maternal devotion and her new hat. Then the minister “delivered” a few remarks and Lorraine came on the stage to hand out tarlatan stockings with nuts and hard candies which accompanied the gifts. After laborious recitations by tortured boys with slicked-back hair and freckles pale because of the excitement, the town elocutionist let loose with “How They Brought the Good News from Aix to Ghent” or “The Wreck of the Hesperus” and about at this juncture the stage chimney would crash down and reveal the truth—it was nothing but a lot of brick-paper pasted on Dan Birge’s store boxes! Well, it was fun to play that one was taking part in the entertainment and showing off a little, as every one else did, including the minister, to smell, in imagination, the pines and evergreens and to visualize Dan Birge, the handsomest lad in the assemblage, winking at her during the minister’s address! The river wind swept in through the lowered taxicab window-pane and Thurley leaned forward to say, “Home, please”—the ooze drifting obediently away. She was Thurley Precore, the Thurley with rejected Christmas gifts and the prospect of a hotel holiday dinner in company with Miss Clergy who would nap most of the day! Yet the ooze had stimulated Thurley; she could always go slipping back to the Corners to relive the homey things which had made her a wild rose. It appeared[159] to be tremendously comforting and she went a step further in self-analysis, telling herself, as she was going up to the hotel rooms, that the thing which made great people lapse into the ooze for tangled up nerves and snarly frames of mind was the thing which made sarcastic, aloof Ernestine Christian play a gypsy dance with the wild fire its author intended it to have or gave Caleb the power to invent an entirely new setting for the same old, “Will you love me?” or told Collin how to forget the ingrowing chin of his subject and make it strong and masterful still looking like the ingrowing original—here, Thurley took the lesson home for she, too, was crystallizing her personality. It gave Thurley the ability to feel that she was Juliet in the tomb or Rosina having that delightful music lesson with her masquerading lover, it was temperament, psychic masquerading! There, that was a much nicer name than the ooze and when she was famous enough she would tell Bliss Hobart so and make him admit his clumsiness of nomenclature. After which exhilaration came the hint of a warning—Miss Clergy’s years of uselessness were the result of just such “psychic masquerading” fed by revenge and disappointment. After all, was this ooze merely confined to the great? Would they not have to yield a point and admit they had much in common with their neighbors? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2848/78561.html","bookId":1218,"book":{"id":1218,"title":"The Gray Angels","description":"简介： The younger generation of Birges Corners insisted that nothing exciting had happened since Abigail Clergys love affair in 1867, and the older generation retorted that Thurley Precore, who must have been born in Arcadia, was bound to create excitement...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2848","creation":"Aug 1, 2019 12:24:39 AM","modification":"Aug 1, 2019 12:24:39 AM"}}
