{"id":44948,"no":3,"title":"CHAPTER III","content":"The sale of the nags brought enough to pay for the burial of Mrs. Precore. After which Betsey Pilrig sent word to have some one wheel the wagon up to the empty pasture land, across from her house, where it could stay as long as was necessary, at least until they had enough money to buy more horses and go somewhere else. So the dingy white wagon was anchored across from Betsey Pilrig’s, to Philena’s delight, and, while Thurley’s father stayed inside to sob in half-drunken fashion about “his loss,” Thurley made rapid inroads on Betsey’s and Philena’s hearts. For that matter, she had made inroads upon the hearts of Birge’s Corners en masse. Even Lorraine loaned her a black hat for the funeral and stripped her garden of late blossoms to lay in the wasted fingers. Thurley had sung at her mother’s funeral. “They always have music,” she told them, and, besides, “it made her feel better inside.” So, standing at the newly dug grave, the curious mourners watched this long-legged, blue-eyed child-woman in every one’s discarded black clothes sing bravely: Jesus, tender Shepherd, hear me, Bless thy little lambs to-night, In the darkness hear me calling, Lead me to eternal light— “It’s a wonder she knows any hymn tunes,” Submit Curler had whispered to Ali Baba. [29] “Says she learned ’em from a gypsy evangelist,” Ali Baba answered, happy to be able to inform Submit Curler, rather than be informed. “She hasn’t a shoe for the winter,” Betsey Pilrig was telling Hopeful. “Don’t it seem sinful to think of Abby Clergy with her thousands?” Hopeful nodded. “But I wouldn’t dare to mention it. I’ve got some things of my own, Betsey. Come around after dark. Ain’t it a disgrace to have that man come drunk to his wife’s funeral? If God is just, Betsey, tell me why He gave that beautiful young ’un with an angel’s voice those parents?” But the minister began to pray, so Betsey was spared answering. After the funeral, Thurley and her father had retired within the box-car wagon to “grieve proper,” Ali Baba summarized, and every one left them alone, except Dan Birge, junior, who promptly knocked at the wreck of a door. Ali Baba tried to stop him, although it was nearing four o’clock, sacred hour for Miss Clergy’s drive. “Hi, you—ain’t you no reverence?” he demanded. “There’s been death in that—that household.” “I got business with her,” Dan retorted, knocking more boldly. “You don’t own this town any more’n I do. You come down off that step, you upstart.” “Chase yourself—I got to speak to Thurley.” Dan made a tantalizing face. “You don’t dare touch me—you ghost coachman—aha—aha—” Thurley opened the door just in time to allow Dan to make good his escape. Within, he stood back, abashed and silent. “What is it, Dan?” she asked mournfully. “If it’s[30] the money you gave me—it’s gone. I’m sorry, but Pa needed ‘comfort’ for the burial.” “Oh, that’s nothing—he got the ‘comfort’ at my pa’s store, so it’s back in the till. I wanted to say I was sorry and we won’t have the circus until you’re feeling fit.” Thurley’s eyes filled with tears. “Your mother’s dead, too, ain’t she?” she asked. “My mother died when I was born,” he confided. “I guess I’d rather have it that way. It would hurt worse to lose your mother, after you really knew her. Say, Thurley, I wanted to tell you I’d like to have you join our gang. There’s about eight of us now—all boys—but I think you’d be just as good. Maybe it would make you forget; maybe your father will go to work and you’ll never go away from here; maybe my father will give him a job, if he can tote barrels. I’ll ask him and you join our gang and we’ll be happy.” “I’ll have to work,” Thurley corrected. “Pa’s awful sick; Ma thought he would die when we was on the road. He can’t tote barrels and neither can I, but I’d like to join the gang, Dan, if I have time. And when your circus plays at South Wales, I’ll come and sing.” She held out her hand in gratitude. The boy took it awkwardly. “I liked you right off,” he admitted. “If you see me getting too fresh or mis-spelling words or things like that—tell me. I’ll take it from you. Everybody thinks because my father made money selling beer that I’m going to be hung. Maybe I’ll go to school like you said—I’m not going to be any old bum, anyhow—and, if you decide to join the gang, we meet at Wood’s Hollow by Dog Creek every afternoon it ain’t raining, but don’t tell Lorraine McDowell,[31] because she wanted to be my girl this winter and I won’t let her.” With which he strutted out of the wagon with the serious feeling of a muchly married man. Somehow Dan had “adopted” Thurley. He felt personally responsible for her happiness and support, and, when he tried convincing his father that Thurley ought to get nine dollars a week for doing nothing and his father jokingly dismissed the matter, Daniel registered a vow that he must see to it that she had everything for which her feminine soul should desire! It was the first time in his life that the finer part of the lad had had a chance to show itself. Philena Pilrig told her grandmother after Thurley’s first visit, “She makes my fingers tingle down at the ends, and, when she smiles, I want to hug her, and, when she sings, I want to cry and dance all at once.” Philena, who was eleven but small because of the twisted spine, sat in the window facing the old wagon car, so she could catch glimpses of Thurley striding about bare-legged, her ragged dress fluttering gracefully in the breeze, whistling or singing or calling out to her father who lay on the lounge and coughed and complained. Having invited the Precores to camp on her land, Betsey Pilrig also felt responsible for their welfare. She saw to it that Thurley washed dishes and ran errands in return for food, and, once, when she ventured over to interview her father as to his intentions of ever working, Thurley stood guard on the steps to tell her “Pa was sleeping—he’s getting that gray look around his lips.” “Thurley, did you ever go to Sunday school?” she asked one afternoon when Thurley and Philena were intent on paper dolls. [32] “No, but it’s where you learn about the Lord and you have a Christmas tree—the evangelist told me.” “Philena gets there except in bad weather—maybe you and she could go together,” Betsey suggested. “I’ve the loveliest teacher!” Philena supplemented. “Her name is Kate Sills, and she’s going to marry the postmaster—she has a beautiful white plume on her hat.” “I’d like to go, if I had shoes. I guess you can’t get in barefoot.” “Maybe we can find shoes, if that’s all that’s wrong.” “I can be a home missionary, granny,” Philena’s little old face lighted with smiles. “You know—the money in my bank.” Thurley flushed. “I don’t want any one’s money—least of all Philena’s. What is a home missionary?” “I’m going to be a foreign missionary when I’m big and strong,” Philena answered. “It’s some one who sails off to China or Africa where they find heathens ready to eat them up; the heathens throw their babies into the river and don’t believe in God, and the missionaries teach them to build nice houses and dress their babies in white and sing songs. I heard a real true one tell about it last winter—she stayed two days at Lorraine’s house—and that’s what I’m going to be, isn’t it, granny?” “If you’re well enough.” “Why couldn’t I go with you to Africa or China and sing the songs, and you could pray and teach and I’d mind the babies while you stitched up the white dresses?” Thurley rattled on. “Let’s be missionaries together—listen, I’ll sing some songs.” “Granny, fetch all the dolls—they can be heathen—that’s the ship we’re going on—and there is Africa all[33] full of savages—get my Bible, Thurley, and my bag—we’ll pretend we’re there now.” Philena’s crutch tapped quickly over the floor. Betsey Pilrig, supposed to be busy with her mending, paused to listen to Philena pray for the heathen, her crutch laid aside, kneeling on the floor of “awful Africa,” alias the south room alcove. The heathen, six subdued, disinterested dolls and a fast unravelling Teddy-bear, stood in a row listening to her sweet, thin voice conclude: “Oh, Lord, you have sent us here to save these people, and, if they don’t understand what I mean and how wrong it is to sacrifice their young and eat us up—Thurley, isn’t it awful to have to say that to the Lord?—but it’s so—may their hearts be inspired by the sweet, sweet voiced singer who has come with me into the wilderness, forsaking wealth and love to serve the cause. Amen. Now, ladies of Africa,” finished Philena, opening her eyes, “Miss Precore will sing.” She picked up her crutch and gave way to Thurley. Whereat Thurley, balancing Philena’s pink parasol with one hand and a pretended hymnal in the other, sang “Throw Out the Life Line” and “Onward, Christian Soldiers,” until Betsey Pilrig, unable to remain incognito any longer, came to the doorway to say, “Thurley, Thurley, how did you ever learn to sing?” Annoyed that the game be interrupted Thurley answered shortly, “God taught me, I guess, but He made my long legs, too. And now, Mrs. Pilrig, unless we finish, we may be taken prisoner any minute and roasted to ashes—look out, Philena, that big one is after you,” brandishing her parasol to ward him off. Properly rebuked Mrs. Pilrig stole away to prepare the missionaries’ supper, while Thurley and Philena drew up a compact, signing and dating it to read as follows: [34] “Thurley Precore and Philena Pilrig of Birge’s Corners do swear they will go as missionaries to convert the heathen from eating flesh and all the other bad things they do. Thurley will sing the songs and mind the babies so the mothers can attend the meetings and Philena is to preach and pray and make white dresses for every one. If Lorraine McDowell wants to she can travel in America and raise funds for the cause but nobody shall ever be the same dear friends as Thurley Precore and Philena Pilrig. Amen. “Thurley Precore and Philena Pilrig.” They put it between the pages of the illustrated Bible and then, descending to things of the earth earthy, fell upon a batch of newly-baked cookies with the ferocity of the unconverted savages. In the midst of her cookie Philena paused to remark, “Thurley, do you think my being lame will make any difference—you’re so straight and strong—” Thurley finished her cookie, while she thought up her defense. Spying tears in Philena’s eyes she went over to fling her arms about the crooked back and declare, “Philena Pilrig, you’ll be armed with your crutch—like a soldier with a gun. You’ll really be better to go as a missionary than folks that haven’t crutches,” clapping her hands in delight at the rainbow smile. “But nobody ever thinks much of cripples—Oyster Jim fought in the Civil War, and, when he came back lame, nobody married him and he started in having a store—they say he wanted to be a lawyer.” “Then he should have been a lawyer just the same. Wait, Philena, I guess God wants to say something—ssh!” Her eyes were like stars, and she warded off Philena’s outstretched arm as if afraid mortal touch[35] might dim the celestial message. “Oh, lots of times,” she added a moment later, “God does tell me things—queer things. Sometimes they rhyme like poems in books and sometimes they’re cross—’cause some one has to scold little girls and Pa and Ma never said anything to me—so God had to scold me, and now He’s telling me something to comfort you, Philena. What do you think it is?” “Oh, you scare me most—talking like a book—God never tells folks things, except what He wrote down in the Bible—whisper it, Thurley—” “He says, ‘Tell Philena that cripples can be conquerors,’” sang Thurley in a clear monotone, “cripples can be conquerors—there—I guess you’ll be as good a missionary as ever lived.” Philena repeated it in an awed tone. “That’s beautiful—now I don’t care about my crutch ... but how can you tell for sure it’s God talking?” Thurley’s eyes were like sapphires in the sun. “Something taps at my heart and I know I’m going to have a wonderful something told me—or a terrible scolding—and then whatever it is God wants to say is just sung into my head and I know—I do know, Philena, I am right.” “I wouldn’t tell any one, if I was you,” Philena suggested enviously. “No, there’s as much about children that grownups don’t understand, as there is about grownups we don’t understand,” Thurley said sagely. “But you can always remember that God said that straight to me—‘cripples can be conquerors’—just like He told me at Midland City, Illinois, ‘You let me catch you cutting off your hair and trying to run away and I’ll stop your singing mighty quick!’ See, Philena?” “Isn’t it funny?” Thurley told her father that night, “I’m to belong to the gang and play robbers and Indians, and I’m to be a missionary with Philena, and there must be different halves of me, and Dan has seen one half and thinks it is a whole, and so has Philena. I wonder what I’d do if the gang met the same day I’d promised to play missionary?” A cough answered her. “Is there any more rum?” he fretted. Regretfully Thurley produced the bottle. “Don’t drink until you see things,” she begged. “Makes me shiver when you talk down low—there—that’s enough for now.... I guess if the gang met on missionary day, I’d make ’em all sit down in front of me and I’d sing to ’em—something awful different from gang stuff or missionary hymns, and then neither could be cross.” “I guess,” her father hiccoughed, “you’ll—hic—always be a good fellow.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2848/78551.html","bookId":1218,"book":{"id":1218,"title":"The Gray Angels","description":"简介： The younger generation of Birges Corners insisted that nothing exciting had happened since Abigail Clergys love affair in 1867, and the older generation retorted that Thurley Precore, who must have been born in Arcadia, was bound to create excitement...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2848","creation":"Aug 1, 2019 12:24:39 AM","modification":"Aug 1, 2019 12:24:39 AM"}}
