{"id":44979,"no":34,"title":"CHAPTER XXXIV","content":"In September Thurley did go back to the Corners, Miss Clergy with her, but she did not take the maid, the accompanist, the extra motor car with which to startle the natives. “I keep humming the old tune: ‘Home, boys, home, in the old countree, ’Neath the oak and the ash and the spreading maple-tree,’” she confessed to Bliss the day before she left, “so it’s home I’m going and I’ll probably race back to town and wonder what madness moved me.” Her concert season did not begin until November, for which she was thankful and with Miss Clergy amicably assenting to the return, Thurley sent word to reopen the Fincherie. Inspiring her return was the longing to see Dan and Lorraine and the harmony which their child had brought them. Envious though she was and starved with the longing to have some one of her very own, Thurley had come to judge things with a broader gauge. She wanted the satisfaction of saying to Dan that she was glad for him and she understood. She must tell Lorraine that she was truly friends with “the family!” She knew her world would have ridiculed her ridiculous conscience, deeming it more essential that she reopen the flirtation with the chewing-gum king or find out a more distinctive method of advertising. But to Thurley the contented handshake of Dan Birge and his wife’s smile was more to the point. So she drove quietly into[374] the Corners one warm, early fall day when every color in Dame Nature’s paint box had been employed in the bordering trees of the Fincherie lawn. She said to Ali Baba who met them eagerly, “I’ve come home again.” Nor did she waver from that manner. She went into the bedrooms and proceeded to settle Miss Clergy and herself with as businesslike an air as her own maid had done, stopping to ask Betsey and Hopeful questions which she knew would please, telling them again and again that it seemed good to “be home.” “I guess you’ll find a lot of changes,” Betsey said, lingering in the room. “I guess you’re changed some yourself,” her kind old eyes looking at the girl shrewdly. “Come, Betsey, you’re going to accuse me of growing old! Now what is it—let me hear the worst?” “No,” Betsey pushed her glasses on to the top of her head so as to see the better, “it’s a change of heart—like I’ve heard tell about,” unconscious of Thurley’s desire both to laugh and cry, “a real change of heart, I guess.” “Was I that bad?” Thurley asked penitently. “I thought only the town drunkards had changes of heart—” she paused, realizing it was not fair to tax Betsey’s sense of humor. “It is this, Betsey, I’ve grown up and with all the wonderful things life has given me, I have no one of my own, so,” she finished bravely, “I’m determined to belong to a town ... now, Betsey, tell me, what are my chances for having Birge’s Corners fall dead in love with me?” amused at Betsey’s struggles to be honest yet not offend. “I guess you give ’em an earful the last time,” Betsey began. “You know, Thurley, they ain’t up to the new ways—and you—you—” [375] “You’re afraid I don’t understand,” Thurley hugged her—because she wanted to hug some one and Betsey happened to be handy. “I do understand—but remember the old railway crossing advice, ‘stop—look—listen’—” here she handed out a dress pattern for a present and took a deep interest in the debate as to whether there should be box pleats or a circular skirt! Within a short time Thurley became both unconscious and disinterested as to her own change of heart. For she discovered that here was an opportunity to study first hand and in unsuspected fashion the war madness which was taking its toll of house-and-garden folk destined to do their bit by stay-at-home effort. The news that Dan had a commission did not surprise her beyond a certain pride, almost as if she had been instrumental in her arguments for his going. She thought that Lorraine probably cried a little and tried to convince Dan his duty lay at home because of the boy; she could picture Lorraine’s distressed, pretty self as she coaxed Dan not to go “and get killed” and Dan’s sentimental side warring with his manhood. At any rate he had gone, so Betsey told her, watching Thurley’s face for some evidence as to her state of feeling. Also he was making the very best first lieutenant in the army—for was he not the first commissioned officer from the Corners? There had been a quota of village lads, some of whom Thurley remembered, who had gone and there was a fudge club organized by the village maidens which yielded weekly so many pounds of sugary delight to be forwarded to the training camps. The social club was a Red Cross center, the lodge rooms were forwarding station for garments and relief funds, no corner of the town but what had scrambled personal possessions into a corner to make way for impersonal duties. [376] As Thurley saw these evidences in even the shut-in hamlet, she reproached herself for having mere visions of a time far ahead when America should win the violet crown, the time when the future generations would recite in history the events of the war of wars and then say with as much assertion as they told of the enemy’s defeat, “A renaissance in art was noted in America during the reconstruction period, art was placed on a more permanent, moral basis, there was a widecut destroying and discouragement of all pursuits and achievements which did not conform to a high moral and spiritual idea. For the first time in the history of the world, our people demanded of artists more than their work, they demanded a conforming to moral law so that the number of art workers became fewer and the public was relieved of superfluous art intriguers whose influence was a menace.” So would the children recite and when the teacher would ask: “Who inspired this great movement?” their answer would be, “Bliss Hobart, he named it the violet crown—the crown for supremacy, violet as the eccelesiastics interpret it—for humility.” Thurley could almost fancy she heard the answer being made, as glorious a feat as there ever was to be, to have children speak one’s name with admiration, to have shown America over-rich in all physical attributes, as taking for her spoils the greatest lesson of all, re-educating her artists so they might draw on the wonderful and hitherto barely skimmed surface of her astral or mystical energy which lies waiting for all true idealists. The third day after Thurley’s return, when she was card-indexing her thoughts in order to begin her concert tour, wondering how to convince the town that she had returned to be one of them and that no matter how great[377] the world might call her she did not belong to the world but to Birge’s Corners, she finally decided to go to see Lorraine. She was amused at the situation as she slipped into a frock like the beautiful green blue rust which comes on copper and put a gold piece in her purse for the boy. She, Thurley Precore, like a wistful village spinster, going to call on the son of her erstwhile adorer! And she chose to carry out the illusion by walking through the streets, nodding at passers-by and pretending not to notice their astonished glances. The Corners could never quite forget the birthday party for Taffy, although Taffy had long since ascended to canine realms above. She came upon a gathering in front of Dan’s store—she had wanted to go inside to buy some trifle and recall the atmosphere of the old days, even if Dan’s desk was now locked and deserted, the days when a willful girl used to dance in and call “Cohoo” up at the young proprietor. But there was a platform in front of the showcases and women were sitting on it, all of them in uniforms. They had a barrel for a table, a pitcher of water and glasses, and pamphlets which they flung out into the crowd at intervals. Boy Scouts were standing in line and singing lustily the doughboy favorite, while a small person also in uniform directed them with wild gestures: Oh, there was a little hen and she had a wooden leg, The best little hen that ever laid an egg, And she laid more eggs than any hen on the farm— And another little drink won’t do us any harm— As the crowd cheered, the small directress turned to face them and speak in a shrill, excited voice about the[378] need for funds, lapsing into slang when other superlative failed her, striding up and down, her soldier hat on one side and her hair dishevelled. It was Lorraine Birge! Thurley felt as if the world were approaching an end as she discovered the identity of the speaker. Beside Lorraine were Josie Donaldson, Hazel Mitchell and presently Cora Spooner appeared to play an uncertain trombone solo, while a queer youth in white flannels and a dangling eye glass began passing the hat—it was Oweyne Pringle of the art shoppe! He gurgled his delight when he recognized Thurley. “You’ll have to sing for us—the crowd will be twice as generous ... oh, do, it will please Mrs. Birge.” “Tell Mrs. Birge I will wait for her after the meeting.” Thurley weakly dropped the gold piece she had intended for the boy into the offered hat. After the collection and another shower of pamphlets, Lorraine and her young Coldstream Guards marched off the platform to tack up placards asking for farmerettes and speakerettes to be pressed into service. Then Lorraine dashed over to Thurley—nothing left of the timid little person with a saddish look in her dove-colored eyes. She approached Thurley as hail-fellow well-met, holding out her hand cordially: “Well, Thurley, you’ve stolen a march on us. You would have been dragged up here to sing if I’d seen you ... isn’t it glorious?” She paused as if uncertain whether it was the war, the audience or Thurley’s frock. “I was going to call on you,” Thurley said gravely. “Come along—I drive the car now. Yes, indeed, I’m qualifying for an ambulance corps. Come on, girls—this is Thurley Precore who’ll boost the subscriptions a lot—you know these girls—Josie, Cora, Hazel—and,[379] Owen, you stay behind and take in the platform and the barrel.” They piled into the muddied car while Lorraine whizzed them up the hill. Sentimental thoughts about entering Dan’s house, which was to have once been hers, took flight. This new and a trifle mad Lorraine commanded all of Thurley’s attention—and sense of humor. It was amusing to see the desperate way in which she strove to appear mannish, capable, immune to fears as to bumblebees or punctured tires, shouting out commands to her “crew,” the way the crew shouted back opinions and watched Thurley and her frock in semi-envy, semi-disapproval! They left the car before the door and went inside in breathless fashion. Lorraine walked up the pathway with Thurley. “How can you bury yourself here,” she asked, “when you could be speaking to crowds in New York? I’m going to get there—I can’t go overseas because of Dan.” She almost resented the interference! “I was tired—my head was in a whirl, the season seems a nightmare—” “Oh, not personal work—the cause we women have championed,” she opened the door as she spoke. “Where is your boy?” Thurley interrupted. “Oh, the love—I’ve a girl to take care of him, I couldn’t do both my war work and the boy.” Lorraine went upstairs, her absurd little boots tapping importantly. The young Coldstream Guardesses waited below, playing the Victrola and rummaging for a dish of fudge. A frowsly headed, sullen girl met them at the head of the stairs. “He’s bumped hisself again,” she said by way of greeting. [380] “Then watch him more, Herta,” Lorraine was petulant. “Dear me, such a great lad ought to be more steady on his feet, I should think!” The disordered nursery exhibited traces of a large lunch which Herta had consumed, a novel spread face downward, also for Herta, and the outlines of Herta’s recumbent form on the divan. Thurley’s face was disapproving as she said swiftly: “If I were a detective, I could explain why the Boy bumped himself!” “Oh, Herta’s mad about him,—dear me, some days I never see him at all. He’s terribly self-willed. I spoiled him those first months because we—we were all so happy,” she flushed as she went ahead. “Then Dan went away and I saw my duty as a war worker. I really have lived in the fullest sense since I went in for public work. Thurley, let’s be friends—I used to think I envied you because Dan had once loved you so,” there was a trace of the old Lorraine as she spoke, but with a surety of opinion which told Thurley that Lorraine’s husband now loved only his wife! “Boy made it all so different. Now I envy you because you are free, unhampered, able to do things—I’d be in France if I could.” Herta appeared with Boy in her arms, a splendid little chap if he had had a little more grooming. There were telltale hollows under his pinkish rimmed eyes indicative of nervous spasms, of unattended or unchecked sobs, his hands were soiled and scratched and a blue-black bump stood out over one temple; he tried his best both to abuse and welcome his mother in his incoherent greeting. “Oh, see his poor head.” Thurley took him from the[381] girl’s unwilling arms. “Didn’t you put anything on it?” she asked her sharply. “He’s got an awful temper,” the girl retorted. “He fights me off for fair. I would have, but he didn’t want it—so I let him cry it out.” Lorraine interposed, “It is my own fault—I never left him alone at first and it makes it hard for any one else who looks after him.” Thurley sat down to rock Boy. “I should think you wouldn’t let a baby’s nerves be an excuse for neglecting him,” she said to her own surprise. “He must have sobbed and sobbed—and see,” pointing to traces of dried and goo-ey egg around his mouth. “Oh, we scrub him up at night—it really doesn’t pay to keep him like a doll.... I want to show you my letters of recommendation.” Lorraine vanished with Thurley following reluctantly, Boy in her arms playing with her sash fringe. The entire house had the neglected look which the town had prophesied Thurley’s house would have should she marry Dan—dust over everything, unpolished floors, a careless air of hurried living, merely existing within the four walls in order to escape without. Herta poked herself after them, with a look of disapproval as she watched Thurley. When Thurley refused to surrender Boy, but sat down to listen to this new and surprising Lorraine tell of her work and aims, mentioning Dan casually, of how surprised he would be at her development, the young guardesses below set up a chorus of protests and came bounding into the room with a quick hullo to Boy and a “Mercy, what a bruise,” settling themselves on the divan to explain their life-work to Thurley. [382] Of course they were all going overseas—heavens, yes, why Josie and Hazel had their passports and were waiting further orders—didn’t Thurley pine to go and sing? Fancy any one’s not going if they could ... they were all going to keep a diary and take a camera, lots of people had smuggled pictures through, they just knew they had. Owen Pringle was going too—he was so jolly and his mother was related to a senator and it had all been arranged for him—these old fogies who said people had better stay home and ’tend to their knitting, who listened to them?—at least, not until it was over ... just think of the adventures, the sea trip and the chance of being submarined, every one said there were lots of life boats—and the chance to learn French and the friends they would make, particularly moving picture men. Every one said Cora Spooner was as good as Nazimova, only she needed an introduction among the professional set, while the ideas for Josie’s war stories—well, all the editors would be cabling her! Josie’s mother would have to do the housework because the help had all gone to the munition plants and her aunt’s eyes had failed terribly—but of course their day was over and it was Josie’s turn to find adventures. Besides, she would lose weight. There was an incentive—she did hate being called Fatty at all the parties. As for Hazel Mitchell—any one who knew what a wonderful godmother Hazel had been to several Tommies—and what beautiful little things she could do to make every one happy—well, Hazel would walk in and literally back melancholy against the ropes. Of course Lorraine had to stay at home—but she was certainly going to try to speak in larger cities—she wanted to be as much of the great cause as she could be— [383] Despite the clatter of tongues, Boy’s dark little head drooped wearily and he slept the exhausted sleep of a neglected hysteric who feels the sympathetic throb of a woman’s breast and can afford to ignore brainless chatter. Lorraine took Thurley home. The lieutenants were all to stay for tea and start out on an evening campaign. “We’ll have a canned supper—and candy,” she said. “I do think I’ve been a goose to drudge so in the kitchen—but no more of it.” “And when Dan comes home?” Thurley asked in spite of herself. “The old dear will be so used to soldiers’ fare he’ll think mine perfection.... Good-by, Thurley, do change your mind and give us a benefit sing. Don’t worry about Boy, he is all right, I weigh him every week and I am afraid I’ll lose Herta if I find too much fault—” Ali Baba was working in the backyard and Thurley fled with relief to find him busied with currant bushes. “Ali Baba,” she said, stamping her foot, “look at me—tell me, do you see war-madness in my eyes?” He leaned on his hand cultivator reflectively. “War madness? Land sakes and Mrs. Davis, that’s a new one—” “You have seen fame-madness and vanity-madness and lonesome-madness and even temper-madness in me,” Thurley confessed, “but this war-madness, this way of leaving houses undusted and babies unkissed—like Lorraine—” Ali Baba left the cultivator to come forward. His blue eyes were keen with indignation. “Thurley,” he[384] said, “God bless our women that work and pray for the boys, but I’m gosh-hanged sick of these critters chasing around day and night trying their best to get changed into these here semi-monjays!” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2848/78582.html","bookId":1218,"book":{"id":1218,"title":"The Gray Angels","description":"简介： The younger generation of Birges Corners insisted that nothing exciting had happened since Abigail Clergys love affair in 1867, and the older generation retorted that Thurley Precore, who must have been born in Arcadia, was bound to create excitement...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2848","creation":"Aug 1, 2019 12:24:39 AM","modification":"Aug 1, 2019 12:24:39 AM"}}
