{"id":90761,"no":5,"title":"Page 5","content":"It was very disappointing. No one had vaporized at all. Uncle Drac and I found them all sitting at the long table in the third- kitchen-on-the-right-just-around-the-corner- past-the-boiler-room. Brenda and Wanda had managed to crawl out from underneath the table, and Wanda was helping to pour the hot water into Brenda\u0027s biggest teapot--which is about the size of a bucket.\\n\\n The whole kitchen smelled of wet wool-- Uncle Drac\u0027s mother, the weird little kid, and the almost grown-up girl were sitting at the table, steaming quietly as their thick black clothes began to dry off. No one said a word. Aunt Tabby sat glaring at the end of the table while Uncle Drac\u0027s mother was busy eye- balling her in the kind of way that Aunt Tabby sometimes eyeballs me. Close up I could see that you could not mistake Uncle Drac\u0027s mother for anyone else in a million years. She looked just like him. She had the same square, pale face and the same brilliant pointy teeth that just showed over the corners of her mouth--but she did not smile like Uncle Drac. She glowered. So did the double-headed ferret.\\n\\n The almost grown-up girl looked very interesting. She had long dark hair with black ribbons threaded through it, and I really liked her little black hat, which had lots of black lace and feathers all over it. I thought I saw a stuffed mouse on it too, but I was not sure and I didn\u0027t want to stare too hard. The almost grown-up girl looked like she might not appreciate that. The little kid was weird. He had squinty eyes and a really pale face like he had never, ever been out in the sun. His shiny black hair was swept back and you could still see the comb marks in it. He was wearing a starched white collar, a tie, and a buttoned-up jacket, and he was sitting on my chair, with his little legs swinging to and fro. He was quite pudgy and was busy chewing some candy. I could see he had a great big bag of candy stuffed into each pocket but he wasn\u0027t about to offer any to Wanda or me. I gave him my fiendish frog stare but he stared right back and he didn\u0027t blink. Not once. That had never happened to me before. Suddenly Uncle Drac broke the silence. \"Hello, Mother, \" he said. \"You remember Araminta. \" Then he said to me, \"Minty, this is your great-aunt Emilene. \" I smiled and was about to say hello when Great-aunt Emilene snorted like a camel and said, \"I remember Araminta. Odd little scrap. \" Well. She got a fiendish frog stare too, and the almost grown-up girl almost smiled. \"And these, Minty, are your cousins, Mathilda and Maximilian, \" said Uncle Drac. I had heard Uncle Drac talking about them sometimes but I had never met them before. \"Hello, \" I said. Mathilda just smiled kind of mysteriously and Maximilian shoved another piece of candy in his mouth and kept right on chewing. I was really glad that the almost grown-up girl was my cousin, but I could have done without the little kid. Great-aunt Emilene did her camel impres- sion again and said in a loud voice, \"Well, Drac, you\u0027re looking sickly. I see Tabitha is still not feeding you properly. \" \"Oh . . . Er . . . \"\\n\\n Uncle Drac did not seem to know what to say, and Aunt Tabby said nothing at all, which really surprised me. \"I did not receive a reply to my letter, Drac, \" said his mother sternly. Uncle Drac blinked. \"What letter?\" he asked. \"Don\u0027t make excuses, Drac. As I was say- ing, I did not get a reply to my letter so I came anyway.\\n\\n Maximilian\u0027s parents have been called away on an urgent assignment. I expect you know how successful their ghost-hunting business is now. A good deal more successful than the bat poo business, I would imagine. \" She sniffed loudly and I thought Uncle Drac looked upset. But she didn\u0027t care, she just carried on in her scratchy voice, like chalk squeaking on a blackboard, \"Well, Drac, as I said in my letter, Mathilda is off to college and I have a cruise booked that I have no intention of missing.\\n\\n Maximilian\u0027s trunk is in the car. You can help Perkins out with it and then we\u0027ll be gone. \" At the mention of \"gone, \" I saw Aunt Tabby smile faintly, but Uncle Drac looked like something had hit him over the head. \"Trunk?\" he asked. His mother sighed just like Aunt Tabby sighs when I say something that she does not agree with. \"Help Perkins lift it out, will you, Drac?\" Just then Brenda put the teapot down on the table with such a thump that everyone and everything, including all the cups, jumped. \"Oops, sorry. Clumsy me, \" Brenda trilled rather nervously. She started pouring the tea, and I went and sat down at the end of the table.\\n\\n Wanda came and sat next to me, then she leaned over and said right in my ear, \"It will be nice to have Maximilian staying with us, won\u0027t it, Araminta? I told him he could have our Saturday bedroom. \" \"What?\" I gasped. The Saturday bedroom is my favorite bedroom. \"It will be such fun, \" said Wanda, who had obviously not noticed that I most definitely did not think it would be anything like fun. \"We can sleep in our Friday bedroom on Saturday, too. That would be really exciting. \" Wanda\u0027s idea of what is exciting is not exactly the same as mine. I looked at Aunt Tabby--surely she was Q going to say something about this? But she didn\u0027t say a thing. She just sat there like a goldfish whose water has just been poured down the sink. \"Um . . . Trunk. I\u0027d, er, better go and get it then, \" muttered Uncle Drac. He gulped down his tea and stood up. His chair made a hor- rible scraping sound on the floor, but I didn\u0027t mind because even that was better than lis- tening to the weird slurping noise that Great- aunt Emilene made while she sucked up her tea like a vacuum cleaner. There was no way I was going to stay down in that kitchen with Wanda Wizzard grinning at the little kid like he was her new best friend, so I said, \"I\u0027ll help you, Uncle Drac. \"\\n\\n \"Would you, Minty?\" Uncle Drac looked pleased. He grabbed my hand and we both shot out of the kitchen like we were being chased by a whole pack of werewolves. In fact give me a pack of werewolves any day.\\n\\n It was pouring down rain when we got outside and the thunder was still rumbling, which was fun. Perkins was asleep in the driver\u0027s seat. His mouth was wide open and he was snoring loudly. Uncle Drac tapped on his window, but there was no chance Perkins would hear anything with a snore almost as loud as the thunder. \"You\u0027ll have to bang on the window really hard, \" I told Uncle Drac, who is quite shy and usually leaves all the loud stuff to Aunt Tabby. He didn\u0027t seem to want to, so I thumped the window hard and made my cross-eyed wide- mouth frog face through the steamed-up glass.\\n\\n It worked. Perkins jumped up like some- thing had bitten him, squashed his top hat on the roof of the car, and sat straight back down again. Then he wound down the window and said, \"Yeeeees?\" in a low, spooky kind of voice that would have really scared Wanda, though it did not scare me at all. Uncle Drac coughed and said, \"We have come for Maximilian\u0027s trunk. \" Perkins--who looked like a skeleton close up--pushed open the door and nearly knocked us over. A moment later he had opened the back of the hearse and was tug- ging at the coffin. \"A little assistance would not be amiss, \" he said in his eerie voice. Uncle Drac and I looked at each other.\\n\\n Who was in the coffin? And why were they going to be buried in Spookie House? \"Not the . . . Coffin, \" said Uncle Drac. \"Maximilian\u0027s trunk. \" Perkins looked at Uncle Drac like he was being really stupid. \"This is Maximilian\u0027s trunk, \" he said. Uncle Drac and I heaved the coffin up the crumbling steps to Spookie House while Perkins the skele- ton watched us through his steamy window, safely back in his nice dry car. We staggered through the front door and dumped the coffin down in the hall with a huge thump, which shook the house and brought Aunt Tabby running. \"What is that?\" she asked, staring at the coffin. \"Trunk, \" gasped Uncle Drac, sitting down on it and wiping the water out of his eyes. \"Minty and I carried it in. \" I had never seen Aunt Tabby make a startled horse expression before, so I was very inter- ested in what she was going to say next, but she just whinnied like you had run out of sugar lumps and rolled her eyes. Then Wanda appeared. She was holding Maximilian\u0027s hand.\\n\\n He was trotting beside her, his short little legs, which were even shorter than Wanda\u0027s-- if that is possible--having trouble keeping up as Wanda dragged him across the hall and started up the big cobwebby stairs that sweep up from the hall. \"Come on, Max, \" said Wanda, sounding like she was trying to get one of Barry\u0027s frogs to do a particularly diffi- cult jump, \"I\u0027ll show you your room. It\u0027s called the Saturday bedroom and it\u0027s really great. I have to share it with Araminta but you can have it all to yourself. \" Max did not look convinced. He kept star- ing at me, and the more Wanda pulled him up the stairs, the more he hung back. I could see his point because who would want to be dragged anywhere by Wanda Wizzard? But Wanda kept on tugging.\\n\\n \"Don\u0027t take any notice of Araminta--she\u0027s always making faces, \" she told him in a loud voice while she stared right at me. \"If she\u0027s not careful, the wind will change and she will get stuck like that. Not that you\u0027d notice. \" Then she gave Max an extra-strong tug. Max gave in and they disappeared up the stairs. So guess who had to help carry the trunk all the way up to the Saturday bedroom? That\u0027s right, Uncle Drac and I. Of course it wouldn\u0027t fit up the rope ladder and through the little door at the top, so I let Wanda spend the rest of the afternoon climbing up and down the ladder with Max\u0027s stuff, which was good for her, as she has gained a bit of weight recently. While Wanda was climbing up and down the ladder, I did some thinking. I had wondered how Pusskins was still managing to eat my cheese and onion chips even when she had disappeared.\\n\\n But it was obvious now that I thought about it. It wasn\u0027t Pusskins who had been eating them, and it never had been. It was the werewolf. So if I wanted to ever eat cheese and onion chips again, there was a whole lot of stuff I had to do. And number one on the list was to get together a Werewolf Trapping Kit. \\n\\n","sourceLink":"https://allnovel.net/vampire-brat-araminta-spook-4/page-5.html","bookId":2805,"book":{"id":2805,"title":"Vampire Brat (Araminta Spook #4)","description":"Storyline: Vampire Brat (Araminta Spook #4) \\n Araminta thinks something horrible is hiding in the deep, hidden passages of Spookie House--could it be a werewolf? Add to that the arrival of Uncle Drac\u0027s creepy nephew, Max, and Araminta knows things will never be the same. Max is Wanda\u0027s new best friend, and Araminta finds him annoying. She comes up with a plan to figure out what Max is up to--and also to capture the werewolf. But will it work?\\n","cover":"https://allnovel.net/images/vampire-brat-araminta-spook-4.jpg","author":"Angie Sage","type":"Humorous","source":"allnovel","link":"https://allnovel.net/vampire-brat-araminta-spook-4.html","creation":"Oct 5, 2019 9:01:31 AM","modification":"Oct 5, 2019 5:44:38 PM"}}
