{"id":102900,"no":14,"title":"Page 14","content":"THIRTEEN YES, I know where we are. You\u0027ve been trying to bring me back here from the beginning, to the little hospital. How forlorn it looked now, so crude with its clay walls, and wooden shuttered windows, and the little beds lashed together out of barely finished wood. Yet she was there in the bed, wasn\u0027t she I know the nurse, yes, and the old round-shouldered doctor, and I see you there in the bed-that\u0027s you, the little one with the curls on the top of the blanket, and Louis there . .. All right, why am I here I know this is a dream. It\u0027s not death. Death has no particular regard for people. Are you sure? she said. She sat on the straight-back chair, golden hair done up in a blue ribbon, and there were blue satin slippers on her small feet. So that meant she was there in the bed, and there on the chair, my little French doll, my beauty, with the high rounded insteps, and the perfectly shaped little hands. And you, you\u0027re here with us and you\u0027re in a bed in the Washington, D.C., emergency room. You know you\u0027re dying down there, don\u0027t you? Severe hypothermia, very possibly pneumonia. But how do we know what infections we\u0027ve got Hit him with antibiotics. There\u0027s no way we can get this man on oxygen now. If we send him to University, he\u0027d end up in the hall there too. Don\u0027t let me die. Please . . . I\u0027m so afraid. We\u0027re here with you, we\u0027re taking care of you. Can you tell me your name Is there some family whom we can notify? Go ahead, tell them who you really are, she said with a little silvery laugh, her voice always so delicate, so very pretty. I can feel her tender little lips, just to look at them. I used to like to press my finger against her lower lip, playfully, when I kissed her eyelids, and her smooth forehead. Don\u0027t be such a little smarty! I said between my teeth. Besides, who am I down there? Not a human being, if that\u0027s what you mean. Nothing could make you human. All right, I\u0027ll give you five minutes. Why did you bring me here What do you want me to say-that I\u0027m sorry about what I did, taking you out of that bed and making you a vampire Well, do you want the truth, the rock-bottom deathbed truth I don\u0027t know if I am. I\u0027m sorry you suffered. I\u0027m sorry anybody has to suffer. But I can\u0027t say for certain that I\u0027m sorry for that little trick. Aren\u0027t you the least little bit afraid of standing by yourself like this? If the truth can\u0027t save me, nothing can. How I hated the smell of sickness around me, of all those little bodies, feverish and wet beneath their drab coverings, the entire dingy and hopeless little hospital of so many decades ago. My father who art in hell, Lestat be your name. And you After the sun burnt you up in the air well in the Theatre of the Vampires, did you go to hell? Laughter, such high pure laughter, like glittering coins shaken loose from a purse. I\u0027ll never tell! Now, I know this is a dream. That\u0027s all it\u0027s been from the beginning. Why would someone come back from the dead to say such trivial and inane things. Happens all the time, Lestat. Don\u0027t get so worked up. I want you to pay attention now. Look at these little beds, look at these children suffering. I took you away from it, I said. Aye, the way that Magnus took you away from your life, and gave you something monstrous and evil in return. You made me a slayer of my brothers and my sisters. All my sins have their origin in that moment, when you reached for me and lifted me from that bed. No, you can\u0027t blame it all on me. I won\u0027t accept it. Is the father parent to the crimes of his child All right, so what if it is true. Who is there to keep count That\u0027s the problem, don\u0027t you see There is no one. So is it right, therefore, that we kill? I gave you life, Claudia. It wasn\u0027t for all time, no, but it was life, and even our life is better than death. How you lie, Lestat. \u0027Even our life,\u0027 you say. The truth is, you think our accursed life is better than life itself. Admit it. Look at you down there in your human body. How you\u0027ve hated it. It\u0027s true. I do admit it. But now, let\u0027s hear you speak from your heart, my little beauty, my little enchantress. Would you really have chosen death in that tiny bed rather than the life I gave you Come now, tell me. Or is this like a mortal courtroom, where the judge can lie and the lawyers can lie, and only those on the stand must tell the truth? So thoughtfully she looked at me, one chubby hand playing with the embroidered hem of her gown. When she lowered her gaze the light shone exquisitely on her cheeks, on her small dark mouth. Ah, such a creation. The vampire doll. What did I know of choices? she said, staring forward, eyes big and glassy and full of light. I hadn\u0027t reached the age of reason when you did your filthy work, and by the way, Father, I\u0027ve always wanted to know: Did you enjoy letting me suck the blood from your wrist? That doesn\u0027t matter, I whispered. I looked away from her to the dying waif beneath the blanket. I saw the nurse in a ragged dress, hair pinned to the back of her neck, moving listlessly from bed to bed. Mortal children are conceived in pleasure, I said, but I didn\u0027t know anymore if she was listening. I didn\u0027t want to look at her. I can\u0027t lie. It doesn\u0027t matter if there is a judge or jury. I... Don\u0027t try to talk. I\u0027ve given you a combination of drugs that will help you. Your fever\u0027s going down already. We\u0027re drying up the congestion in your lungs. Don\u0027t let me die, please don\u0027t. It\u0027s all unfinished and it\u0027s monstrous. I\u0027ll go to hell if there is one, but I don\u0027t think there is. If there is, it\u0027s a hospital like this one, only it\u0027s filled with sick children, dying children. But I think there\u0027s just death. A hospital full of children? Ah, look at the way she\u0027s smiling at you, the way she puts her hand on your forehead. Women love you, Lestat. She loves you, even in that body, look at her. Such love. Why shouldn\u0027t she care about me She\u0027s a nurse, isn\u0027t she And I\u0027m a dying man. And such a beautiful dying man. I should have known you wouldn\u0027t do this switch unless someone offered you a beautiful body. What a vain, superficial being you are! Look at that face. Better looking than your own face. I wouldn\u0027t go that far! She gave me the most sly smile, her face glowing in the dim, dreary room. Don\u0027t worry, I\u0027m with you. I\u0027ll sit right here with you until you\u0027re better. I\u0027ve seen so many humans die. I\u0027ve caused their deaths. It\u0027s so simple and treacherous, the moment when life goes out of the body. They simply slip away. You\u0027re saying crazy things. No, I\u0027m telling you the truth, and you know it. I can\u0027t say I\u0027ll make amends if Hive. I don\u0027t think it\u0027s possible. Yet I\u0027m scared to death of dying. Don\u0027t let go my hand. Lestat, why are we here? Louis I looked up. He was standing in the door of the crude little hospital, confused, faintly disheveled, the way he\u0027d looked from the night I\u0027d made him, not the wrathful blinded young mortal anymore, but the dark gentleman with the quiet in his eyes, with the infinite patience of a saint in his soul. Help me up, I said, I have to get her from the little bed. He put out his hand, but he was so confused. Didn\u0027t he share in that sin No, of course not, because he was forever blundering and suffering, atoning for it all even as he did it. I was the devil. I was the only one who could gather her from the little bed. Time now to lie to the doctor. The child there, that is my child. And he\u0027d be oh, so glad to have one less burden. Take her, monsieur, and thank you. He looked gratefully at the gold coins as I tossed them on the bed. Surely I did that. Surely I didn\u0027t fail to help them. Yes, thank you. God bless you. I\u0027m sure He will. He always has. I bless Him too. Sleep now. As soon as there\u0027s a room available, we\u0027ll move you into it, you\u0027ll be more comfortable. Why are there so many here Please don\u0027t leave me. No, I\u0027ll stay with you. I\u0027ll sit right here. Eight o\u0027clock. I was lying on the gurney, with the needle in my arm, and the plastic sack of fluid catching the light so beautifully, and I could see the clock perfectly. Slowly I turned my head. A woman was there. She wore her coat now, very black against her white stockings and her thick soft white shoes. Her hair was in a thick coil on the back of her head, and she was reading. She had a broad face, of very strong bones and clear skin, and large hazel eyes. Her eyebrows were dark and perfectly drawn, and when she looked up at me, I loved her expression. She closed the book soundlessly and smiled. You\u0027re better, she said. A rich, soft voice. A bit of bluish shadow beneath her eyes. Am I? The noise hurt my ears. So many people. Doors swooshing open and shut. She stood up and came across the corridor, and took my hand in hers. Oh, yes, much better. Then I\u0027D live? Yes, she said. But she wasn\u0027t sure. Did she mean for me to see that she wasn\u0027t sure Don\u0027t let me die in this body, I said, moistening my lips with my tongue. They felt so dry! Lord God, how I hated this body, hated the heave of the chest, hated even the voice coming from my lips, and the pain behind my eyes was unbearable. There you go again, she said, her smile brightening. Sit with me. I am. I told you I wouldn\u0027t leave. I\u0027ll stay here with you. Help me and you help the devil, I whispered. So you told me, she said. Want to hear the whole tale? Only if you stay calm as you tell me, if you take your time. What a lovely face you have. What is your name? Gretchen. You\u0027re a nun, aren\u0027t you, Gretchen? How did you know that? I could tell. Your hands, for one thing, the little silver wedding band, and something about your face, a radiance- the radiance of those who believe. And the fact that you stayed with me, Gretchen, when the others told you to go on. I know nuns when I see them. I\u0027m the devil and when I behold goodness I know it. Were those tears hovering in her eyes You\u0027re teasing me, she said kindly. There\u0027s a little tag here on my pocket. It says I\u0027m a nun, doesn\u0027t it Sister Marguerite. I didn\u0027t see it, Gretchen. I didn\u0027t mean to make you cry. You\u0027re better. Much better. I think you\u0027re going to be all right. I\u0027m the devil, Gretchen. Oh, not Satan\u0027 himself, Son of Morning, ben Sharar. But bad, very bad. Demon of the first rank, certainly. You\u0027re dreaming. It\u0027s the fever. Wouldn\u0027t that be splendid Yesterday I stood in the snow and tried to imagine just such a thing-that all my life of evil was but the dream of a mortal man. No such luck, Gretchen. The devil needs you. The devil\u0027s crying. He wants you to hold his hand. You\u0027re not afraid of the devil, are you? Not if he requires an act of mercy. Sleep now. They\u0027re coming to give you another shot. I\u0027m not leaving. Here, I\u0027ll bring the chair to the side of the bed so you can hold my hand. What are you doing, Lestat? We were in our hotel suite now, much better place than that stinking hospital-I\u0027ll take a good hotel suite over a stinking hospital anytime-and Louis had drunk her blood, poor helpless Louis. Claudia, Claudia, listen to me. Come round, Claudia . . . You\u0027re ill, do you hear me You must do as I tell you to get well. I bit through the flesh of my own wrist, and when the blood began to spill, I put it to her lips. That\u0027s it, dear, more... Try to drink a little of this. She slipped her hand behind my neck. Ah, the pain when I lifted my head. It tastes so thin. It\u0027s not like blood at all. Her lids were heavy and smooth over her downcast eyes. Like a Grecian woman painted by Picasso, so simple she seemed, large-boned and fine and strong. Had anybody ever kissed her nun\u0027s mouth People are dying here, aren\u0027t they That\u0027s why the corridors are crowded. I hear people crying. It\u0027s an epidemic, isn\u0027t it? It\u0027s a bad time, she said, her virginal lips barely moving. But you\u0027ll be all right. I\u0027m here. Louis -was so angry. But why, Lestat? Because she was beautiful, because she was dying, because I wanted to see if it would work. Because nobody wanted her and she was there, and I picked her up and held her in my arms. Because it was something I could accomplish, like the little candle flame in the church making another flame and still retaining its own light-my way of creating, my only way, don\u0027t you see One moment there were two of us, and then we were three. He was so heartbroken, standing there in his long black cloak, yet he could not stop looking at her, at her polished ivory cheeks, her tiny wrists. Imagine it, a child vampire! One of us. I understand. Who spoke I was startled, but it wasn\u0027t Louis, it was David, David standing near with his copy of the Bible. Louis looked up slowly. He didn\u0027t know who David was. Are we close to God when we create something out of nothing When we pretend we are the tiny flame and we make other flames? David shook his head. A bad mistake. And so is the whole world, then. She\u0027s our daughter- I\u0027m not your daughter. I\u0027m my mama\u0027s daughter. No, dear, not anymore. I looked up at David. Well, answer me. Why do you claim such high aims for what you did? he asked, but he was so compassionate, so gentle. Louis was still horrified, staring at her, at her small white feet. Such seductive little feet. And then I decided to do it, I didn\u0027t care what he did with my body if he could put me into this human form for twenty-four hours so that I could see the sunlight, feel what mortals feel, know their weakness and their pain. I pressed her hand as I spoke. She nodded, wiping my forehead again, feeling my pulse with her firm warm fingers. ... and I decided to do it, simply do it. Oh, I know it was wrong, wrong to let him go with all the power, but can you imagine, and now you see, I can\u0027t die hi this body. The others won\u0027t even know what\u0027s happened to me. If they knew, they\u0027d come. . . The other vampires, she whispered. Yes. And then I was telling her all about them, about my search so long ago to find the others, thinking that if I only knew the history of things, it would explain the mystery... On and on I talked to her, explaining us, what we were, all about my trek through the centuries, and then the lure of the rock music, the perfect theatre for me, and what I\u0027d wanted to do, about David and God and the Devil in the Paris cafe, and David by the fire with the Bible in his hand, saying God is not perfect. Sometimes my eyes were closed; sometimes they were open. She was holding my hand all the while. People came and went. Doctors argued. A woman was cry-nig. Outside it was light again. I saw it when the door opened, and that cruel blast of cold air swept through the corridor. How are we going to bathe all these patients? a nurse asked. That woman should be in isolation. Call the doctor. Tell him we have a case of meningitis on the floor. It\u0027s morning again, isn\u0027t it You must be so tired, you\u0027ve been with me all through the afternoon and the night. I\u0027m so scared, but I know you have to go. They were bringing hi more sick people. The doctor came to her and told her they would have to turn all these gurneys so that their heads were against the wall. The doctor told her she ought to go home. Several new nurses had just come on duty. She ought to rest. Was I crying The little needle hurt my arm, and how dry my throat was, how dry my lips. We can\u0027t even officially admit all these patients. Can you hear me, Gretchen? I asked. Can you follow what I\u0027m saying? You\u0027ve asked me that over and over again, she said, and each time I\u0027ve told you that I can hear, that I can understand. I\u0027m listening to you. I won\u0027t leave you. Sweet Gretchen; Sister Gretchen. I want to take you out of here with me. What did you say? To my house, with me. You\u0027re much better now, your fever\u0027s way down. But if you stay here . . . Confusion hi her face. She put the cup to my lips again and I drank several gulps. I understand. Yes, please take me, please. I tried to sit up. I\u0027m afraid to stay. Not just yet, she said, coaxing me back down on the gurney. Then she pulled the tape off my arm and extracted that vicious little needle. Lord God, I had to piss! Was there no end to these revolting physical necessities What in the hell was mortality Shitting, pissing, eating, and then the same cycle all over again! Is this worth the vision of the sunshine It wasn\u0027t enough to be dying. I had to piss. But I couldn\u0027t bear using that bottle again, even though I could scarce remember it. Why aren\u0027t you afraid of me? I asked. Don\u0027t you think I\u0027m insane? You only hurt people when you\u0027re a vampire, she said simply, when you\u0027re in your rightful body. Isn\u0027t that true? Yes, I said. That\u0027s true. But you\u0027re like Claudia. You\u0027re not afraid of anything. You are playing her for a fool, said Claudia. You \u0027re going to hurt her too. Nonsense, she doesn\u0027t believe it, I said. I sat down on the couch in the parlour of the little hotel, surveying the small fancy room, feeling very at home with these delicate old gilded furnishings. The eighteenth century, my century. Century of the rogue and the rational man. My most perfect time. Petit-point flowers. Brocade. Gilded swords and the laughter of drunken men in the street below. David was standing at the window, looking out over the low roofs of the colonial city. Had he ever been in this century before No, never! he said in awe. Every surface is worked by hand, every measurement is irregular. How tenuous the hold of created things upon nature, as if it could slide back to the earth so easily. Leave, David, said Louis, you don\u0027t belong here. We have to remain. There\u0027s nothing we can do. Now, that\u0027s a bit melodramatic, said Claudia. Really. She wore that soiled little gown from the hospital. Well, I would soon fix that. I would sack the shops of laces and ribbons for her. I would buy silks for her, and tiny bracelets of silver, and rings set with pearls. I put my arm around her. Ah, how nice to hear someone speak the truth, I said. Such fine hair, and now it will be fine forever. I tried to sit up again, but it seemed impossible. They were rushing an emergency case through the corridor, two nurses on either side, and someone struck the gurney and the vibration moved through me. Then it was quiet, and the hands on the big clock moved with a little jerk. The man next to me moaned, and turned his head. There was a huge white bandage over his eyes. How naked his mouth looked. We have to get these people into isolation, said a voice. Come on, now, I\u0027m taking you home. And Mojo, what had become of Mojo Suppose they\u0027d come to take him away This was a century in which they incarcerated dogs, simply for being dogs. I had to explain this to her. She was lifting me, or trying to do it, slipping her arm around my shoulders. Mojo barking in the town house. Was he trapped Louis was sad. There\u0027s plague out there in the city. But that can\u0027t hurt you, David, I said. You\u0027re right, he said. But there are other things ... Claudia laughed. She\u0027s in love with you, you know. You would have died of the plague, I said. Maybe it was not my time. Do you believe that, that we have our time? No, actually I don\u0027t, she said. Maybe it was just easier to blame you for everything. I never really knew right from wrong, you see. You had time to learn, I said. So have you, much more time than I ever had. Thank God you\u0027re taking me, I whispered. I was standing on my feet. I\u0027m so afraid, I said. Just plain ordinary afraid. One less burden to the hospital, Claudia said with a ringing laugh, her little feet bobbing over the edge of the chair. She had on the fancy dress again, with the embroidery. Now that was an improvement. Gretchen the beautiful, I said. It makes a flame in your cheeks when I say that. She smiled as she brought my left arm over her shoulder now, and kept her right arm locked around my waist. I\u0027ll take care of you, she whispered in my ear. It isn\u0027t very far. Beside her little car, in the bitter wind, I stood holding that stinking organ, and watching the yellow arc of piss, steam rising from it as it struck the melting snow. Lord God, I said. That feels almost good! What are human beings that they can take pleasure in such dreadful things!","sourceLink":"https://allnovel.net/the-tale-of-the-body-thief-the-vampire-chronicles-4/page-14.html","bookId":2212,"book":{"id":2212,"title":"The Tale of the Body Thief (The Vampire Chronicles #4)","description":"Storyline: The Tale of the Body Thief (The Vampire Chronicles #4) Lestat speaks. Vampire-hero, enchanter, seducer of mortals. For centuries he has been a courted prince in the dark and flourishing universe of the living dead. Lestat is alone. And suddenly all his vampire rationale--everything he has come to believe and feel safe with--is called into question. In his overwhelming need to destroy his doubts and his loneliness, Lestat embarks on the most dangerous enterprise he has undertaken in all the danger-haunted years of his long existence. The Tale of the Body Thief is told with the unique--and mesmerizing--passion, power, color, and invention that distinguish the novels of Anne Rice.","cover":"https://allnovel.net/images/the-tale-of-the-body-thief-the-vampire-chronicles-4.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-tale-of-the-body-thief-the-vampire-chronicles-4.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:17:07 PM"}}
