{"id":102912,"no":26,"title":"Page 26","content":"TWENTY-FIVE I SHOULD have gone on to Miami that night. I knew that David might need me. And of course I had no idea where James might be. But I had no heart for it-I was far too badly shaken-and I found myself before morning quite far east of the little country of French Guiana, yet still in the hungry sprawling jungles, and thirsting, but with no hope of satisfaction on that account. About an hour before dawn I came upon an ancient temple- a great rectangle of pitted stone-so overgrown with vines, and other rankled foliage that it was perhaps altogether invisible even to mortals who might pass a few feet away. But as there was no road or even a footpath through this part of the jungle, I sensed that no one had passed here in centuries. It was my secret, this place. Except for the monkeys, that is, who had waked with the coming light. A veritable tribe of them had laid siege to the crude building, whooping and screeching and swarming all over the long flat roof, and the sloping sides. In a dull listless fashion I watched them, even smiling, as they went about their antics. Indeed, the whole jungle had gone into a rebirth. The chorus of the birds was much louder than it had been in the hours of total darkness, and as the sky paled, I saw myriad shades of green all around me. And with a shock I realized I wasn\u0027t going to see the sun. My stupidity on this count surprised me somewhat. But what creatures of habit we are. Ah, but wasn\u0027t this early light enough It was pure joy to be in my old body . . . . . unless I remembered the look of pure revulsion on Gretchen\u0027s face. A thick mist rose from the floor of the jungle, catching this precious illumination and diffusing it even to the tiniest nooks and crannies beneath shuddering flowers and leaves. My sadness deepened as I looked around me; or more truly I felt raw and as if I\u0027d been skinned alive. Sadness is too mild and sweet a word. I thought again and again of Gretchen, but only in wordless images. And when I thought of Claudia I felt a numbness, a silent obdurate remembrance of the words I\u0027d spoken to her in my fever dreams. Like a nightmare the old doctor with the stained whiskers. The doll-child in the chair. No, not there. Not there. Not there. And what did it matter if they had been It didn\u0027t matter at all. Beneath these deep enervating emotions, I was not unhappy; and to be aware of this, to know it truly, was perhaps a wondrous thing. Ah, yes, just my old self again. Had to tell David all about this jungle! David must go to Rio before he returned to England. I would go with him, perhaps. Perhaps. I found two doors in the temple. The first was blocked with heavy irregular stones. But the other lay open, for the stones had long ago fallen away into a shapeless heap. Climbing over them, I made my way down a deep staircase, and then through several passages, until I came upon chambers to which no light penetrated at all. It was in one of these, very cool and utterly removed from the noises of the jungle, that I lay down to sleep. Tiny slithering things dwelt there. As I laid my face against the damp cool floor, I felt these little creatures moving around the tips of my fingers. I heard their rustling. And then the heavy silken weight of a snake moved across my ankle. All this made me smile. How my old mortal body would have cringed and shaken. But then my mortal eyes could have never seen into this deep place. I began to tremble suddenly, to cry again softly, thinking of Gretchen. I knew there would never again be a dream of Claudia. What did you want of me? I whispered. Did you really think I could save my soul? I saw her as I had in my delirium, in that old New Orleans hospital when I\u0027d taken her by the shoulders. Or had we been in the old hotel I told you I would do it again. I told you. Something had been saved at that moment. The dark damnation of Lestat had been saved, and was now forever intact. Good-bye, darlings, I whispered again. And then I slept.","sourceLink":"https://allnovel.net/the-tale-of-the-body-thief-the-vampire-chronicles-4/page-26.html","bookId":2212,"book":{"id":2212,"title":"The Tale of the Body Thief (The Vampire Chronicles #4)","description":"Storyline: The Tale of the Body Thief (The Vampire Chronicles #4) Lestat speaks. Vampire-hero, enchanter, seducer of mortals. For centuries he has been a courted prince in the dark and flourishing universe of the living dead. Lestat is alone. And suddenly all his vampire rationale--everything he has come to believe and feel safe with--is called into question. In his overwhelming need to destroy his doubts and his loneliness, Lestat embarks on the most dangerous enterprise he has undertaken in all the danger-haunted years of his long existence. The Tale of the Body Thief is told with the unique--and mesmerizing--passion, power, color, and invention that distinguish the novels of Anne Rice.","cover":"https://allnovel.net/images/the-tale-of-the-body-thief-the-vampire-chronicles-4.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-tale-of-the-body-thief-the-vampire-chronicles-4.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:17:07 PM"}}
