{"id":26765,"no":5,"title":"CHAPTER IV.","content":"Lisaveta was sitting in her room, still in her ball dress, lost in the deepest meditation. On her return to the house, she had sent away her maid, and had gone upstairs to her room, trembling at the idea of finding Hermann there; desiring, indeed, not to find him. One glance showed her that he was not there, and she gave thanks to Providence that he had missed the appointment. She sat down pensively, without thinking of taking off her cloak, and allowed to pass through her memory all the circumstances of the intrigue which had begun such a short time back, and had already advanced so far. Scarcely three weeks had passed since she had first seen the young officer from her window, and already she had written to him, and he had succeeded in inducing her to make an appointment. She knew his name, and that was all. She had received a quantity of letters from him, but he had never spoken to her; she did not know the sound of his voice, and until that evening, strangely enough, she had never heard him spoken of. \n \n \"ONE GLANCE SHOWED HER THAT HE WAS NOT THERE.\" \n \n But that very evening Tomski, fancying he had noticed that the young Princess Pauline, to whom he had been paying assiduous court, was flirting,[Pg 52] contrary to her custom, with, another man, had wished to revenge himself by making a show of indifference. With this noble object he had invited Lisaveta to take part in an interminable mazurka; but he teased her immensely about her partiality for Engineer officers, and pretending all the time to know much more than he really did, hazarded purely in fun a few guesses which were so happy that Lisaveta thought her secret must have been discovered. \n \n \"But who tells you all this?\" she said with a smile. \"A friend of the very officer you know, a most original man.\" \n \n [Pg 53] \n \n \"And who is this man that is so original?\" \n \n \"His name is Hermann.\" \n \n She answered nothing, but her hands and feet seemed to be of ice. \n \n \"Hermann is a hero of romance,\" continued Tomski. \"He has the profile of Napoleon, and the soul of Mephistopheles. I believe he has at least three crimes on his conscience.... But how pale you are!\" \n \n \"I have a bad headache. But what did this Mr. Hermann tell you? Is not that his name?\" \n \n \"Hermann is very much displeased with his friend, with the Engineer officer who has made your acquaintance. He says that in his place he would behave very differently. But I am quite sure that Hermann himself has designs upon you. At least, he seems to listen with remarkable interest to all that his friend tells him about you.\" \n \n \"And where has he seen me?\" \n \n \"Perhaps in church, perhaps in the street; heaven knows where.\" \n \n At this moment three ladies came forward according to the custom of the mazurka, and asked Tomski to choose between \"forgetfulness and regret.\"[1] \n \n And the conversation which had so painfully excited the curiosity of Lisaveta came to an end. \n \n The lady who, in virtue of the infidelities permitted by the mazurka, had just been chosen by Tom ski, was the Princess Pauline. During the rapid evolutions which the figure obliged them to make, there was a grand explanation between them, until at last he conducted her to a chair, and returned to his partner. \n \n But Tomski could now think no more, either of Hermann or Lisaveta, and he tried in vain to resume the conversation. But the mazurka was coming to an end, and immediately afterwards the old Countess rose to go. \n \n Tomski\u0027s mysterious phrases were nothing more than the usual platitudes of the mazurka, but they had made a deep impression upon the heart of the poor little companion. The portrait sketched by Tomski had struck her as very exact; and with her romantic ideas, she saw in the rather ordinary countenance of her adorer something to fear and admire. She was now sitting down with her cloak off, with bare shoulders; her head, crowned with flowers, falling forward from fatigue, when suddenly the door opened and Hermann entered. She shuddered. \n \n \"Where were you?\" she said, trembling all over. \n \n [Pg 55] \n \n \"In the Countess\u0027s bedroom. I have just left her,\" replied Hermann. \"She is dead.\" \n \n \"Great Heavens! What are you saying?\" \n \n \"I am afraid,\" he said, \"that I am the cause of her death.\" \n \n Lisaveta looked at him in consternation, and remembered Tomski\u0027s words: \"He has at least three crimes on his conscience.\" \n \n Hermann sat down by the window, and told everything. The young girl listened with terror. \n \n So those letters so full of passion, those burning expressions, this daring obstinate pursuit—all this had been inspired by anything but love! Money alone had inflamed the man\u0027s soul. She, who had nothing but a heart to offer, how could she make him happy? Poor child! she had been the blind instrument of a robber, of the murderer of her old benefactress. She wept bitterly in the agony of her repentance. Hermann watched her in silence; but neither the tears of the unhappy girl, nor her beauty, rendered more touching by her grief, could move his heart of iron. He had no remorse in thinking of the Countess\u0027s death. One sole thought distressed him—the irreparable loss of the secret which was to have made his fortune. \n \n \"You are a monster!\" said Lisaveta, after a long silence. \n \n [Pg 56] \n \n \"I did not mean to kill her,\" replied Hermann coldly. \"My pistol was not loaded.\" \n \n They remained for some time without speaking, without looking at one another. The day was breaking, and Lisaveta put out her candle. She wiped her eyes, drowned in tears, and raised them towards Hermann. He was standing close to the window, his arms crossed, with a frown on his forehead. In this attitude he reminded her involuntarily of the portrait of Napoleon. The resemblance overwhelmed her. \n \n \"How am I to get you away?\" she said at last. \"I thought you might go out by the back stairs. But it would be necessary to go through the Countess\u0027s bedroom, and I am too frightened.\" \n \n \"Tell me how to get to the staircase, and I will go alone.\" \n \n She went to a drawer, took out a key, which she handed to Hermann, and gave him the necessary instructions. Hermann took her icy hand, kissed her on the forehead, and departed. \n \n He went down the staircase, and entered the Countess\u0027s bedroom. She was seated quite stiff in her armchair; but her features were in no way contracted. He stopped for a moment, and gazed into her face as if to make sure of the terrible reality. Then he entered the dark room, and, feeling behind the tapestry, found the little door[Pg 57] which, opened on to a staircase. As he went down it, strange ideas came into his head. \"Going down this staircase,\" he said to himself, \"some sixty years ago, at about this time, may have been seen some man in an embroidered coat with powdered wig, pressing to his breast a cocked hat: some gallant who has long been buried; and now the heart of his aged mistress has ceased to beat.\" \n \n At the end of the staircase he found another door, which his key opened, and he found himself in the corridor which led to the street. \n \n [1] The figures and fashions of the mazurka are reproduced in the cotillon of Western Europe.—TRANSLATOR. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1829/53064.html","bookId":1018,"book":{"id":1018,"title":"The Queen of Spades and other stories","description":"简介： Alexander Sergueievitch Pushkin came of a noble family, so ancient that it was traced back to that Alexander Nevsky who, in the thirteenth century, gained a great victory over the Swedes upon the ice of the River Neva, in token whereof he was surname...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1829","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
