{"id":72490,"no":5,"title":"Page 5","content":"“That was terrible,” I said. “What do I need to do to ensure that never happens to me again?”\n “Nothing you can do!” she said excitedly. “I’m unpredictable. God, don’t you hate Dr. Hyde? Don’t you? He’s so condescending.”\n I sat up and said, “I think he’s a genius,” partly because I thought it was true and partly because I just felt like disagreeing with her.\n She sat down on the bed. “Do you always sleep in your clothes?”\n “Yup.”\n “Funny,” she said. “You weren’t wearing much last night.” I just glared at her.\n “C’mon, Pudge. I’m teasing. You have to be tough here. I didn’t know how bad it was—and I’m sorry, and they’ll regret it—but you have to be tough.” And then she left. That was all she had to say on the subject. She’s cute, I thought, but you don’t need to like a girl who treats you like you’re ten: You’ve already got a mom.\n one hundred twenty-two days before\n AFTER MY LAST CLASS of my first week at Culver Creek, I entered Room 43 to an unlikely sight: the diminutive and shirtless Colonel, hunched over an ironing board, attacking a pink button-down shirt. Sweat trickled down his forehead and chest as he ironed with great enthusiasm, his right arm pushing the iron across the length of the shirt with such vigor that his breathing nearly duplicated Dr. Hyde’s.\n “I have a date,” he explained. “This is an emergency.” He paused to catch his breath. “Do you know”—breath—“how to iron?”\n I walked over to the pink shirt. It was wrinkled like an old woman who’d spent her youth sunbathing. If only the Colonel didn’t ball up his every belonging and stuff it into random dresser drawers. “I think you just turn it on and press it against the shirt, right?” I said. “I don’t know. I didn’t even know we had an iron.”\n “We don’t. It’s Takumi’s. But Takumi doesn’t know how to iron, either. And when I asked Alaska, she started yelling, ‘You’re not going to impose the patriarchal paradigm on me.’ Oh, God, I need to smoke. I need to smoke, but I can’t reek when I see Sara’s parents. Okay, screw it. We’re going to smoke in the bathroom with the shower on. The shower has steam. Steam gets rid of wrinkles, right?\n “By the way,” he said as I followed him into the bathroom, “if you want to smoke inside during the day, just turn on the shower. The smoke follows the steam up the vents.”\n Though this made no scientific sense, it seemed to work. The shower’s shortage of water pressure and low showerhead made it all but useless for showering, but it worked great as a smoke screen.\n Sadly, it made a poor iron. The Colonel tried ironing the shirt once more (“I’m just gonna push really hard and see if that helps”) and finally put it on wrinkled. He matched the shirt with a blue tie decorated with horizontal lines of little pink flamingos.\n “The one thing my lousy father taught me,” the Colonel said as his hands nimbly threaded the tie into a perfect knot, “was how to tie a tie. Which is odd, since I can’t imagine when he ever had to wear one.”\n Just then, Sara knocked on the door. I’d seen her once or twice before, but the Colonel never introduced me to her and didn’t have a chance to that night.\n “Oh. My God. Can’t you at least press your shirt?” she asked, even though the Colonel was standing in front of the ironing board. “We’re going out with my parents.” Sara looked awfully nice in her blue summer dress. Her long, pale blond hair was pulled up into a twist, with a strand of hair falling down each side of her face. She looked like a movie star—a bitchy one.\n “Look, I did my best. We don’t all have maids to do our ironing.”\n “Chip, that chip on your shoulder makes you look even shorter.”\n “Christ, can’t we get out the door without fighting?”\n “I’m just saying. It’s the opera. It’s a big deal to my parents. Whatever. Let’s go.” I felt like leaving, but it seemed stupid to hide in the bathroom, and Sara was standing in the doorway, one hand cocked on her hip and the other fiddling with her car keys as if to say, Let’s go.\n “I could wear a tuxedo and your parents would still hate me!” he shouted.\n “That’s not my fault! You antagonize them!” She held up the car keys in front of him. “Look, we’re going now or we’re not going.”\n “Fuck it. I’m not going anywhere with you,” the Colonel said.\n “Fine. Have a great night.” Sara slammed the door so hard that a sizable biography of Leo Tolstoy (last words: “The truth is . . . I care a great deal . . . what they . . . ”) fell off my bookshelf and landed with a thud on our checkered floor like an echo of the slamming door.\n “AHHHHH!!!!!!!!!!!” he screamed.\n “So that’s Sara,” I said.\n “Yes.”\n “She seems nice.”\n The Colonel laughed, knelt down next to the minifridge, and pulled out a gallon of milk. He opened it, took a swig, winced, half coughed, and sat down on the couch with the milk between his legs.\n “Is it sour or something?”\n “Oh, I should have mentioned that earlier. This isn’t milk. It’s five parts milk and one part vodka. I call it ambrosia. Drink of the gods. You can barely smell the vodka in the milk, so the Eagle can’t catch me unless he actually takes a sip. The downside is that it tastes like sour milk and rubbing alcohol, but it’s Friday night, Pudge, and my girlfriend is a bitch. Want some?”\n “I think I’ll pass.” Aside from a few sips of champagne on New Year’s under the watchful eye of my parents, I’d never really drunk any alcohol, and “ambrosia” didn’t seem like the drink with which to start. Outside, I heard the pay phone ring. Given the fact that 190 boarders shared five pay phones, I was amazed at how infrequently it rang. We weren’t supposed to have cell phones, but I’d noticed that some of the Weekday Warriors carried them surreptitiously. And most non-Warriors called their parents, as I did, on a regular basis, so parents only called when their kids forgot.\n “Are you going to get that?” the Colonel asked me. I didn’t feel like being bossed around by him, but I also didn’t feel like fighting.\n Through a buggy twilight, I walked to the pay phone, which was drilled into the wall between Rooms 44 and 45. On both sides of the phone, dozens of phone numbers and esoteric notes were written in pen and marker (205.555.1584; Tommy to airport 4:20; 773.573.6521; JG—Kuffs?). Calling the pay phone required a great deal of patience. I picked up on about the ninth ring.\n “Can you get Chip for me?” Sara asked. It sounded like she was on a cell phone.\n “Yeah, hold on.”\n I turned, and he was already behind me, as if he knew it would be her. I handed him the receiver and walked back to the room.\n A minute later, three words made their way to our room through the thick, still air of Alabama at almost-night. “Screw you too!” the Colonel shouted.\n Back in the room, he sat down with his ambrosia and told me, “She says I ratted out Paul and Marya. That’s what the Warriors are saying. That I ratted them out. Me. That’s why the piss in the shoes. That’s why the nearly killing you. ’Cause you live with me, and they say I’m a rat.”\n I tried to remember who Paul and Marya were. The names were familiar, but I had heard so many names in the last week, and I couldn’t match “Paul” and “Marya” with faces. And then I remembered why: I’d never seen them. They got kicked out the year before, having committed the Trifecta.\n “How long have you been dating her?” I asked.\n “Nine months. We never got along. I mean, I didn’t even briefly like her. Like, my mom and my dad—my dad would get pissed, and then he would beat the shit out of my mom. And then my dad would be all nice, and they’d have like a honeymoon period. But with Sara, there’s never a honeymoon period. God, how could she think I was a rat? I know, I know: Why don’t we break up?” He ran a hand through his hair, clutching a fistful of it atop his head, and said, “I guess I stay with her because she stays with me. And that’s not an easy thing to do. I’m a bad boyfriend. She’s a bad girlfriend. We deserve each other.”\n “But—”\n “I can’t believe they think that,” he said as he walked to the bookshelf and pulled down the almanac. He took a long pull off his ambrosia. “Goddamn Weekday Warriors. It was probably one of them that ratted out Paul and Marya and then blamed me to cover their tracks. Anyway, it’s a good night for staying in. Staying in with Pudge and ambrosia.”\n “I still—” I said, wanting to say that I didn’t understand how you could kiss someone who believed you were a rat if being a rat was the worst thing in the world, but the Colonel cut me off.\n “Not another word about it. You know what the capital of Sierra Leone is?”\n “No.”\n “Me neither,” he said, “but I intend to find out.” And with that, he stuck his nose in the almanac, and the conversation was over.\n one hundred ten days before\n KEEPING UP WITH MY CLASSES proved easier than I’d expected. My general predisposition to spending a lot of time inside reading gave me a distinct advantage over the average Culver Creek student. By the third week of classes, plenty of kids had been sunburned to a bufriedo-like golden brown from days spent chatting outside in the shadeless dorm circle during free periods. But I was barely pink: I studied.\n And I listened in class, too, but on that Wednesday morning, when Dr. Hyde started talking about how Buddhists believe that all things are interconnected, I found myself staring out the window. I was looking at the wooded, slow-sloping hill beyond the lake. And from Hyde’s classroom, things did seem connected: The trees seemed to clothe the hill, and just as I would never think to notice a particular cotton thread in the magnificently tight orange tank top Alaska wore that day, I couldn’t see the trees for the forest—everything so intricately woven together that it made no sense to think of one tree as independent from that hill. And then I heard my name, and I knew I was in trouble.\n “Mr. Halter,” the Old Man said. “Here I am, straining my lungs for your edification. And yet something out there seems to have caught your fancy in a way that I’ve been unable to do. Pray tell: What have you discovered out there?”\n Now I felt my own breath shorten, the whole class watching me, thanking God they weren’t me. Dr. Hyde had already done this three times, kicking kids out of class for not paying attention or writing notes to one another.\n “Um, I was just looking outside at the, uh, at the hill and thinking about, um, the trees and the forest, like you were saying earlier, about the way—”\n The Old Man, who obviously did not tolerate vocalized rambling, cut me off. “I’m going to ask you to leave class, Mr. Halter, so that you can go out there and discover the relationship between the umtrees and the uh-forest. And tomorrow, when you’re ready to take this class seriously, I will welcome you back.”\n I sat still, my pen resting in my hand, my notebook open, my face flushed and my jaw jutting out into an underbite, an old trick I had to keep from looking sad or scared. Two rows behind me, I heard a chair move and turned around to see Alaska standing up, slinging her backpack over one arm.\n “I’m sorry, but that’s bullshit. You can’t just throw him out of class. You drone on and on for an hour every day, and we’re not allowed to glance out the window?”\n The Old Man stared back at Alaska like a bull at a matador, then raised a hand to his sagging face and slowly rubbed the white stubble on his cheek. “For fifty minutes a day, five days a week, you abide by my rules. Or you fail. The choice is yours. Both of you leave.”\n I stuffed my notebook into my backpack and walked out, humiliated. As the door shut behind me, I felt a tap on my left shoulder. I turned, but there was no one there. Then I turned the other way, and Alaska was smiling at me, the skin between her eyes and temple crinkled into a starburst. “The oldest trick in the book,” she said, “but everybody falls for it.”\n I tried a smile, but I couldn’t stop thinking about Dr. Hyde. It was worse than the Duct Tape Incident, because I always knew that the Kevin Richmans of the world didn’t like me. But my teachers had always been card-carrying members of the Miles Halter Fan Club.\n “I told you he was an asshole,” she said.\n “I still think he’s a genius. He’s right. I wasn’t listening.”\n “Right, but he didn’t need to be a jerk about it. Like he needs to prove his power by humiliating you?! Anyway,” she said, “the only real geniuses are artists: Yeats, Picasso, GarcIa Márquez: geniuses. Dr. Hyde: bitter old man.”\n And then she announced we were going to look for four-leaf clovers until class ended and we could go smoke with the Colonel and Takumi, “both of whom,” she added, “are big-time assholes for not marching out of class right behind us.”\n When Alaska Young is sitting with her legs crossed in a brittle, periodically green clover patch leaning forward in search of four-leaf clovers, the pale skin of her sizable cleavage clearly visible, it is a plain fact of human physiology that it becomes impossible to join in her clover search. I’d gotten in enough trouble already for looking where I wasn’t supposed to, but still . . .\n After perhaps two minutes of combing through a clover patch with her long, dirty fingernails, Alaska grabbed a clover with three full-size petals and an undersize, runt of a fourth, then looked up at me, barely giving me time to avert my eyes.\n “Even though you were clearly not doing your part in the clover search, perv,” she said wryly, “I really would give you this clover. Except luck is for suckers.” She pinched the runt petal between the nails of her thumb and finger and plucked it. “There,” she said to the clover as she dropped it onto the ground. “Now you’re not a genetic freak anymore.” \n","sourceLink":"https://allnovel.net/looking-for-alaska/page-5.html","bookId":2700,"book":{"id":2700,"title":"Looking for Alaska","description":"Storyline: \n Before. Miles \"Pudge\" Halter\u0027s whole existence has been one big nonevent, and his obsession with famous last words has only made him crave the \"Great Perhaps\" (François Rabelais, poet) even more. He heads off to the sometimes crazy, possibly unstable, and anything-but-boring world of Culver Creek Boarding School, and his life becomes the opposite of safe. Because down the hall is Alaska Young. The gorgeous, clever, funny, sexy, self-destructive, screwed-up, and utterly fascinating Alaska Young, who is an event unto herself. She pulls Pudge into her world, launches him into the Great Perhaps, and steals his heart. \n After. Nothing is ever the same.\n \n","cover":"https://allnovel.net/images/looking-for-alaska.jpg","author":"John Green","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/looking-for-alaska.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:23:56 AM"}}
