{"id":83768,"no":1,"title":"Page 1","content":"The Baby was crying again.\\n\\n The sound roused her from a dream about a castle on a cloud, and set her teeth on edge. It had been a good dream, and in it she\u0027d been young and slim and her hair had been the color of the summer sun. It had been a dream that she\u0027d hated leaving, but the baby was crying again. Sometimes she regretted being a mother; sometimes the baby killed her dreams. But she sat up in bed and slid her feet into her slippers because there was no one else to take care of the child.\\n\\n She stretched, popping her joints, and stood up. She was a big, heavy woman with broad shoulders, and she was six feet tall. amazon Chick, she\u0027d been called. By whomi She couldn\u0027t remember. Oh, yes; it came to her. By him. It had been one of his pet names for her, part of their secret code of love. She could see his face in her mind, like a blaze of beauty. She remembered his dangerous laugh, and how his body felt hard as warm marble atop hers on a bed fringed with purple beads...\\n\\n Stop. It was torture; thinking of what used to be.\\n\\n She said, \"Hush, hush,\" in a voice raspy with sleep. The baby kept crying. She loved this child, better than she\u0027d loved anything for a long time, but the baby did cry a lot. He couldn\u0027t be satisfied. She went to the crib and looked at him. Tears were rolling down his cheeks in the dank light from the Majik Market across the highway. \"Hush,\" she said. \"Robbyi Hush, now!\" But Robby wouldn\u0027t hush, and she didn\u0027t want to wake the neighbors. They didn\u0027t like her as it stood. Particularly not the old bastard next door, who knocked on the walls when she played her Hendrix and Joplin records. He threatened to call the pigs, and he had no respect for God, either.\\n\\n \"Quiet!\" she told Robby. The baby made a choking sound, nailed at the air with fists the size of large strawberries, and his crying throttled up. She picked up the infant from his crib and rocked him, while he trembled with baby rage. as she tried to soothe his demons, she listened to the noise of eighteen-wheelers rushing past Mableton on the highway that led to atlanta. She liked it. It was a clean sound, like water flowing over stones. But it made her sad, too, in a way. Everybody was going somewhere but her, it often seemed. Everybody had a destination, a fixed star. Hers had burned brightly for a time, flared, and dwindled to a cinder. That was a long time ago, in another life. Now she lived here, in this low-rent apartment building next to the highway, and when the nights were clear she could see the lights of the city to the northeast. When it rained, she saw nothing but dark.\\n\\n She walked around the cramped bedroom, crooning to the baby. He wouldn\u0027t stop crying, though, and it was giving her a headache. The kid was stubborn. She took him through the hallway into the kitchen, where she switched on the light. Roaches fled for shelter. The kitchen was a damned mess, and anger burst in her for letting it get this way. She swept empty cans and litter off the table to make room for the child, then she laid him down and checked his diaper. No, it wasn\u0027t wet. \"You hungryi You hungry, sweetiei\" Robby coughed and gasped, his crying ebbing for a few seconds and then swelling to a thin, high keening that razored her skull.\\n\\n She searched in vain for a pacifier. The clock caught her eye: four-twelve. Jesus! She\u0027d have to be at work in little more than an hour, and Robby was crying his head off. She left him flailing on the table and opened the refrigerator. a rancid smell drifted from it. Something had gone bad, in there amid the cold french fries, bits of Burger King hamburgers, Spam, cottage cheese, milk, half-empty cans of baked beans, and a few jars of Gerber\u0027s baby food. She chose a jar of applesauce, then she opened a cupboard and got a small pot. She turned on one of the stove\u0027s burners, and she drew a little water from the sink\u0027s tap into the pot. She placed the pot on the burner and the jar of applesauce down into the water to heat it. Robby didn\u0027t like cold food, and the warmth would make him sleepy. a mother had to know a lot of tricks; it was a tough job.\\n\\n She glanced at Robby as she waited for the applesauce to heat up, and she saw with a start of horror that he was just about to roll off the table\u0027s edge.\\n\\n She moved fast for her one hundred and eighty-four pounds. She caught Robby an instant before he fell to the checkered linoleum, and she hugged him close as he squalled again. \"Hush, now. Hush. almost broke your neck, didn\u0027t youi\" she said as she paced the floor with the crying infant. \"almost broke it. Bad baby! Hush, now. Mary\u0027s got you.\"\\n\\n Robby kicked and wailed, struggling in her arms, and Mary felt her patience tattering like an old peace flag in a hard, hot wind.\\n\\n She shoved that feeling down because it was a dangerous thing. It made her think of ticking bombs and fingers forcing bullet clips into the chambers of automatic rifles. It made her think of God\u0027s voice roaring commandments in the night from her stereo speakers. It made her think of where she\u0027d been and who she was, and that was a dangerous thing to lodge in her mind. She cradled Robby with one arm and felt the jar of applesauce. Warm enough. She took the jar out, got a spoon from a drawer, and sat down in a chair with the baby. Robby\u0027s nose was running, his face splotched with red. \"Here,\" Mary said. \"Sweets for baby.\" His mouth was clamped shut, he wouldn\u0027t open it, and suddenly he convulsed and kicked and the applesauce spewed onto the front of Mary\u0027s plaid flannel robe. \"Damn it!\" she said. \"Shit! Look at this mess!\" The child\u0027s body jerked with fierce strength. \"You\u0027re going to eat this!\" she told him, and she spooned up more applesauce.\\n\\n again, he defied her. applesauce dripped from his mouth down his chin. It was combat now, a battle of wills. Mary caught the infant\u0027s face with one large hand and squeezed the babyfat cheeks. \"YOU\u0027RE GOING TO MIND ME!\" she shouted into the glistening blue eyes. The infant quieted for a second, startled, and then new tears streaked down his face and his wailing pierced Mary\u0027s head with fresh pain.\\n\\n Robby\u0027s lips became a barrier to the spoon. applesauce drooled down onto his sleepsuit, where yellow ducks cavorted. Mary thought of the washing she was going to have to do, a chore she despised, and the frayed thread of her temper broke.\\n\\n She threw aside the spoon, picked up the infant, and shook him. \"MIND ME!\" she shouted. \"DO YOU HEaR WHaT I SaIDi\" She shook him harder and harder, his head lolling and the high-pitched wail still coming from his mouth. She clamped a hand over his lips, and his head thrashed against her fingers. The sound of his crying went up and up, a crazy spiral. She had to get ready for work, had to put on the face she wore every day outside these walls, had to say \"Yes ma\u0027am\" and \"No sir\" and wrap the burgers just so and the people who bought them never knew who she had been, they never guessed, no never never in a million years did they guess she would rather cut their throats than look at them. Robby was screaming, the apartment was filling up with screaming, somebody was knocking on the wall, and her own throat was raw.\\n\\n \"YOU WaNT TO CRYi\" she shouted, holding the struggling infant under one arm. \"I\u0027LL MaKE YOU CRY!\"\\n\\n She knocked the pot off the stovetop, and turned the burner up to high.\\n\\n Still Robby, a bad seed, screamed and fought against her will. She didn\u0027t want to do this, it hurt her heart, but what good was a baby who didn\u0027t mind his motheri \"Don\u0027t make me do it!\" She shook Robby like a fleshy rag. \"Don\u0027t make me hurt you!\" His face was contorted, his scream so high it was almost inaudible, but Mary could feel its pressure sawing at her skull. \"Don\u0027t make me!\" she warned, and then she held him by the scruff of his neck and slapped his face.\\n\\n Behind her the burner was beginning to glow.\\n\\n Robby would not bend to her will. He would not be quiet, and somebody might call the pigs, and if that happened...\\n\\n a fist was hammering on the wall. Robby flailed and kicked. He was trying to break her, and that could not be tolerated.\\n\\n She felt her teeth grind together, the blood pulsing in her temples. Little drops of crimson ran from Robby\u0027s nose, and his scream was like the voice of the world at the end of time.\\n\\n Mary made a low, moaning sound, deep in her throat. She turned toward the stove and pressed the baby\u0027s face against the red-hot burner.\\n\\n The little body writhed and jerked. She felt the terrible heat rising past him, washing into her own face. Robby\u0027s scream went on and on, his legs thrashing. She kept her hand pressed hard on the back of his head, there were tears in her eyes, and she was sick at heart because Robby had always been such a good baby.\\n\\n His struggling ceased, and his scream ended with a sizzle.\\n\\n The baby\u0027s head was melting.\\n\\n Mary watched it happen as if she were outside her body looking down, a remote bystander cool in her curiosity. Robby\u0027s head was shrinking, little sparks of flame kicking up, and the pink flesh running in glistening strands. She could feel the heat beneath her hand. He was quiet now. He had learned who was in control.\\n\\n She pulled him up off the burner, but most of his face stayed on the hot coils in a crisp black inside-out impression. Robby was dead.\\n\\n \"Hey, you crazy freak!\" a voice through the thin wall. The old man next door, the one who went out on the highway collecting aluminum cans in a garbage bag. Shecklett, the name on his mailbox said. \"Stop that hollerin\u0027 or I\u0027ll call the cops! Hear mei\"\\n\\n Mary stared at the black-edged hole where Robby\u0027s face had been. The head was full of smoke. Plastic sparked on the burner, and the kitchen was rank with the sickeningly sweet smell of another infant\u0027s death.\\n\\n \"Shut up and let a man steep!\" He struck the wall again, and the pictures of babies clipped from magazines and mounted in dimestore frames jumped on their nails.\\n\\n Mary stood looking at the doll, her mouth half open and her gray eyes glassy. This one was gone. This one was ready for heaven. But he\u0027d been such a good boy. She\u0027d thought he was the best of them all. She wiped her eyes with a sluggish hand, and turned off the burner. Bits of plastic flamed and popped, a haze of blue smoke filming the air like the breath of ghosts.\\n\\n She took the doll to a closet in the hallway. at the back of the closet was a cardboard box, and in that box were the dead babies. The signature of her rage lay here. Some of the dolls had been burned faceless, like Robby. Others had been decapitated, or were torn limb from limb. Some bore the marks of being crushed under tires, and some had been ripped open by knives or razors. all of them were little boys, and all of them had been her loves.\\n\\n She peeled the sleepsuit with its yellow ducks off Robby. She held Robby with two fingers, like something filthy, and she dropped him into the box of death. She shoved the box into the back of the closet again, then she closed the door.\\n\\n She put away the wooden crate that had served as a crib, and she was alone.\\n\\n an eighteen-wheeler swept past on the highway, making the walls creak. Mary went into the bedroom with the slow gait of a sleepwalker. another death freighted her soul. There had been so many of them. So many. Why didn\u0027t they mind heri Why did they always have to fight her willi It wasn\u0027t right that she fed them and clothed them and loved them and they died hating her in the end.\\n\\n She wanted to be loved. More than anything in the world. Was that too much to aski\\n\\n Mary stood at the window for a long time, looking out at the highway. The trees were bare. Bleak January had gnawed the land, and it seemed that winter ruled the earth.\\n\\n She dropped the sleepsuit into the clothes hamper in her bathroom. Then she walked to her dresser, opened the bottom drawer, reached under some folded-up sweaters, and found the Colt Snubnose.38. The shine had worn off, and in the six-bullet cylinder there was one shell.\\n\\n Mary turned on the television set. The early morning cartoons from TBS were on. Bugs Bunny and Elmer Fudd. In the blue glow, Mary sat on the edge of her rumpled bed and spun the cylinder once, twice, and a third time.\\n\\n She drew a long, deep breath, and she pressed the Colt\u0027s barrel against her right temple.\\n\\n \"C\u0027mere, ya cwazy wabbit!\"\\n\\n \"Who, mei\"\\n\\n \"Yeah, you!\"\\n\\n \"ahhhhhh, what\u0027s up, d -\"\\n\\n She squeezed the trigger.\\n\\n The hammer clicked on an empty chamber.\\n\\n Mary let her breath go, and she smiled.\\n\\n Her heart was beating hard, driving the sweet adrenaline through her body. She returned the pistol to its place beneath the sweaters, and she slid the drawer shut. Now she felt so much better, and Robby was just a bad memory. But she couldn\u0027t survive long without a baby to care for. No, she was a natural mother. an earth mother, it had once been said. She needed a new baby. She\u0027d found Robby in a Toys \u0027R Us in Douglasville. She knew better than to go to the same store twice; she still had eyes in the back of her head, and she was always watching for any sign of the pigs. So she\u0027d find another toy store. No sweat.\\n\\n It was almost time to get ready for work. She needed to relax, and put on the face she wore beyond these walls. It was her Burger King face, smiling and friendly, no trace of steel in her eyes. She stood before the mirror in the bathroom, the harsh incandescent bar of light switched on, and she slowly let the face emerge. \"Yes ma\u0027am,\" she said to the person in the mirror. \"Would you like fries with that, ma\u0027ami\" She cleared her throat. The voice needed to be a little higher, a little dumber. \"Yes sir, thank you sir! Have a nice day!\" She switched her smile off and on, off and on. Cattle needed to see smiles; she wondered if the people who worked in slaughterhouses smiled before they smashed the skulls of cattle with big wooden mallets.\\n\\n The smiley face stayed on. She looked younger than her forty-one years, but there were deep lines at the corners of her eyes. Her long hair was no longer as blond as the summer sun. It was a mousy brown, streaked with gray. It would go up in a tight bun when she got to work. Her face was square and strong-jawed, but she could make it look weak and afraid, like a cow who senses the breaking of skulls in the long line ahead. There wasn\u0027t much she couldn\u0027t do with her face if she wanted. She could look old or young, timid or defiant. She could be an aging California girl or a backwoods hick with equal ease. She could slump her shoulders and look like a frightened schmuck, or she could stand at her full amazonian height and dare any sonofamotherfuckingbitch to cross her path. It was all in the attitude, and she hadn\u0027t gone to drama school in New York City for nothing.\\n\\n Her real name was not the name on her Georgia driver\u0027s license, her library card, her cable TV bills, or any of the mail that came to her apartment. Her real name was Mary Terrell. She remembered what they used to call her as they passed the joints and the cheap red wine and sang songs of freedom: Mary Terror.\\n\\n She had been wanted for murder by the FBI since the spring of 1969.\\n\\n Sergeant Pepper was dead. G.I. Joe lived on. George Bush was president, movie stars were dying from aIDS, kids were smoking crack in the ghettos and the suburbs, Muslims were blowing airliners from the skies, rap music ruled, and nobody cared much about the Movement anymore. It was a dry and dusty thing, like the air in the graves of Hendrix, Joplin, and God. She was letting her thoughts take her into treacherous territory, and the thoughts threatened her smiley face. She stopped thinking about the dead heroes, the burning breed who made the bombs full of roofing nails and planted them in corporate boardrooms and National Guard armories. She stopped thinking before the awful sadness crushed her.\\n\\n The sixties were dead. The survivors limped on, growing suits and neckties and potbellies, going bald and telling their children not to listen to that satanic heavy metal. The dock of the age of aquarius had turned, hippies and yippies had become preppies and yuppies. The Chicago Seven were old men. The Black Panthers had turned gray. The Grateful Dead were on MTV, and the airplane had become a top-forty Starship.\\n\\n Mary Terror closed her eyes, and thought she heard the noise of wind whistling through the ruins.\\n\\n I need, she thought. I need. a single tear coursed slowly down her left cheek.\\n\\n I need something to call mine.\\n\\n She opened her eyes and stared at the woman in the mirror. Smile! Smile! Her smile ticked back on. \"Thank you, sir. Would you like an ice-cold Pepsi with that burgeri\"\\n\\n Her eyes were still hard, a chink in the disguise. She\u0027d have to work on that.\\n\\n She took off her plaid robe, stained by the applesauce that a convulsive jerk of her wrist had spilled upon it, and she looked at her nude body in the mean light. Her smile faded and went away. Her body was pale and loose, flabby around the belly, hips, and thighs. Her breasts sagged, the nipples grayish-brown. They looked empty. Her gaze fixed on the network of old scars that crisscrossed her stomach and her right hip, the ridges of scar tissue snaking down into the dark brown nest between her thighs. She ran her fingers over the scars, and felt their cruelty. What was inside her, she knew, were worse scars. They ran deep, and they had ravaged her soul.\\n\\n Mary remembered when her body had been young and tight. He hadn\u0027t been able to keep his hands off her. She remembered the hot thrust of him inside her, when they were both flying on acid and the love went on forever. She remembered candles in the dark, the smell of strawberry incense, and the Doors - God\u0027s band - on the record player. Long time past, she thought. The Woodstock Nation had become the Pepsi Generation. Most of the outlaws had surfaced for air, had served their time in the cages of political restitution, put on the suits of the Mindfuck State, and joined the herd of cattle marching to the slaughterhouse.\\n\\n But not him. Not Lord Jack.\\n\\n and not her, either.\\n\\n She was still Mary Terror down beneath the soft fast food-puffed flesh. Mary Terror was sleeping inside her body, dreaming of what was and what might have been.\\n\\n The alarm clock went off in the bedroom. Mary silenced the jangle with a slap of her palm, and she turned on the cold water tap in the shower and stepped into the bitter flood. When she had finished showering and drying her hair, she dressed in her Burger King uniform. She\u0027d been working at Burger King for eight months, had reached the level of assistant day manager, and beneath her was a crew of kids who didn\u0027t know Che Guevara from Geraldo Rivera. That was all right with her, they\u0027d never heard of the Weather Underground, or the Storm Front either. To those kids she was a divorced woman trying to make ends meet. That was all right. They didn\u0027t know she could make a bomb out of chicken shit and kerosene, or that she could fieldstrip an M16 or shoot a pig in the face with as little hesitation as flicking a fly.\\n\\n Better that they stay dumb than be dead.\\n\\n She turned off the TV. Time to go. She picked up a yellow Smiley Face button from atop her dresser and pinned it to the front of her blouse. Then she put on her brown overcoat, got her purse with its credentials that identified her as Ginger Coles, and opened the door into the cold, hated outside world.\\n\\n Mary Terror\u0027s rusted, beat-up blue Chevy pickup was in the parking lot. She caught a glimpse of Shecklett, watching her from his window, pulling back when he realized he\u0027d been seen. The old man\u0027s eyes were going to get him in trouble someday. Maybe real soon.\\n\\n She drove away from the apartment complex, merged with the morning traffic heading into atlanta from the small country towns around it, and none of the other drivers guessed she was a six-foot-tall time bomb ticking steadily toward explosion. \\n\\n","sourceLink":"https://allnovel.net/mine/page-1.html","bookId":2480,"book":{"id":2480,"title":"Mine","description":"Storyline: Adrift in the 1980s and slowly losing her mind, a heavily armed former \u002760s radical kidnaps a baby with the hope, deluded as it may be, of returning her life to simpler times. The child\u0027s mother, though, isn\u0027t about to take it lying down and, along with a tracker, begins a cross-country chase to get her child back.\\n","cover":"https://allnovel.net/images/mine.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/mine.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:53:28 PM"}}
