{"id":83769,"no":2,"title":"Page 2","content":"The baby kicked. \"Oh!\" Laura Clayborne said, and touched her swollen belly. \"There he goes again!\"\n \"He\u0027ll be a soccer player, I\u0027m telling you.\" across the table, Carol Mazer picked up her glass of chardonnay. \"So anyway, Matt tells Sophia her work is shoddy, and Sophia hits the roof. You know Sophia\u0027s temper. I swear, honey, you could hear the windows shake. We thought it was Judgment Day. Matt ran back to his office like a whipped puppy, but somebody\u0027s got to stand up to that woman, Laura. I mean, she\u0027s running the whole show over there, and her ideas absolutely - pardon my French - but they absolutely suck.\" She took a sip of wine, her dark brown eyes shining with the pleasure of a gossip well told. Her hair was a riot of black ringlets, and her red fingernails looked long enough to pierce to the heart. \"You\u0027re the only one she\u0027s ever listened to, and with you off the track the whole place is falling to pieces. Laura, I swear she\u0027s out of control. God help us until you can get back to work.\"\n \"I\u0027m not looking forward to it.\" Laura reached for her own drink: Perrier with a twist of lime. \"Sounds like everybody\u0027s gone crazy over there.\" She felt the baby kick once more. a soccer player, indeed. The child was due in two weeks, more or less. around the first of February, Dr. Bonnart had said. Laura had given up her occasional glass of wine the first month of her pregnancy, way back at the beginning of a long hot summer. also forsaken, after a much harder struggle, was her habit of a pack of cigarettes a day. She had turned thirty-six in November, and this would be her first child. a boy, for sure. He\u0027d displayed a definite penis on the sonogram. Some days she was almost stupid with happiness and other days she felt a dazed dread of the unknown perched on her shoulder, picking at her brain like a raven. The house was filled with baby books, the guest bedroom - once known as Doug\u0027s study - had been painted pale blue and his desk and IBM PC hauled out in favor of a crib that had belonged to her grandmother.\n It had been a strange time. Laura had been hearing the ticking of her biological clock for the last four years, and everywhere she looked it seemed she saw women with strollers, members of a different society. She was happy and excited, yes, and sometimes she did think she actually looked radiant - but other times she simply found herself wondering whether or not she\u0027d ever play tennis again, or what she was going to do if the bloat didn\u0027t melt away. The horror stories abounded, many of them supplied by Carol, who was seven years her junior, twice married, and had no children. Grace Dealey had ballooned up with her second child, and now all she did was sit around and wolf down boxes of Godiva chocolates. Lindsay Fortanier couldn\u0027t control her twins, and the children ran the household like the offspring of attila the Hun and Marie antoinette. Marian Burrows had a little red-haired girl with a temper that made McEnroe look like a pansy, and Jane Fields\u0027s two boys refused to eat anything but Vienna sausages and fish sticks. all this according to Carol, who was glad to help soothe Laura\u0027s fear of future shock.\n They were sitting at a table in the Fish Market restaurant, at atlanta \u0027s Lenox Square. The waiter came over, and Laura and Carol ordered lunch. Carol asked for a shrimp and crabmeat salad, and Laura wanted a large bowl of seafood gumbo and the poached salmon special. \"I\u0027m eating for two,\" she said, catching Carol\u0027s faint smile. Carol ordered another glass of chardonnay. The restaurant, an attractive place decorated in seagreen, pale violet, and pink, was filling up with the business crowd. Laura scanned the room, counting the power ties. The women wore their dark-hued suits with padded shoulders, their hair fixed in sprayed helmets, and they gave off the flashes of diamonds and the aromas of Chanel or Giorgio. This was definitely the BMW and Mercedes crowd, and the waiters hustled from table to table heeding the desires of new money and platinum american Express cards. Laura knew what businesses these people were in: real estate, banking, stockbrokerage, advertising, public relations - the hot professions of the New South. Most of them were living on plastic, and leasing the luxury cars they drove, but appearance was everything.\n Laura suddenly had an odd vision as Carol talked on about the calamities at the newspaper. She saw herself walking through the doors of the Fish Market, into this rarefied air. Only she was not as she was now. She was no longer well-groomed and well-dressed, her nails French-manicured and her chestnut-brown hair drawn back with an antique golden clip to fall softly around her shoulders. She was as she had been when she was eighteen years old, her light blue eyes clear and defiant behind her granny glasses. She wore ragged bellbottom jeans and a blouse that looked like a faded american flag, and on her feet were sandals made from car tires, like the sandals the Vietnamese wore in the news films. She wore no makeup, her long hair limp and in need of brushing, her face adamant with anger. Buttons were stuck to her blouse: peace signs, and slogans like STOP THE WaR, IMPERIaLIST aMERIKa, and POWER TO THE PEOPLE. all conversations of interest rates, business mergers, and ad campaigns abruptly ceased as the hippie who had once been Laura Clayborne - then Laura Beale - strode defiantly into the center of the restaurant, sandals thwacking against the carpeted floor. Most of the people here were in their mid-thirties to early forties. They all remembered the protest marches, the candlelight vigils, and the draft card burnings. Some of them, perhaps, had been on the front lines with her. But now they gaped and sneered, and some laughed nervously. \"What happenedi\" she asked them as forks slid into bowls of seafood gumbo and hands stopped halfway to their glasses of white wine. \"What the hell happened to all of usi\"\n The hippie couldn\u0027t answer, but Laura Clayborne knew. We got older, she thought. We grew up and took our places in the machine. and the machine gave us expensive toys to play with, and Rambo and Reagan said don\u0027t worry, be happy. We moved into big houses, bought life insurance, and made out our wills. and now we wonder, deep in our secret hearts, if all the protest and tumult had a point. We think that maybe we could have won in Vietnam after all, that the only equality among men is in the wallet, that some books and music should be censored, and we wonder if we would be the first to call out the Guard if a new generation of protesters took to the streets. Youth yearned and burned, Laura thought. age reflected, by the ruddy fireplaces.\n \"... wanted to cut his hair short and let one of those rat-tail things hang down in back.\" Carol cleared her throat. \"Earth to Laura! Come in, Laura!\"\n She blinked. The hippie went away. The Fish Market was a placid pool again. Laura said, \"I\u0027m sorry. What were you sayingi\"\n \"Nikki Sutcliff\u0027s little boy, Max. Eight years old, and he wanted to crop his hair and have a rat-tail. and he loves that rap junk, too. Nikki won\u0027t let him listen to it. You can\u0027t believe the dirty words on records these days! You\u0027d better think about that, Laura. What are you going to do if your little boy wants to cut all his hair off and go around bald-headed and singing obscene songsi\"\n \"I think,\" she answered, \"that I\u0027ll think about it later.\"\n The salad and the gumbo were served. Laura listened as Carol talked on about politics in the atlanta Constitution\u0027s Life and Style department. Laura was a senior reporter specializing in social news and doing book reviews and an occasional travel piece. atlanta was a social city, of that there was no doubt. The Junior League, the art Guild, the Opera Society, the Greater atlanta Museum Board: those and many more demanded Laura\u0027s attention, as well as debutante parties, donations from wealthy patrons to various art and music funds, and weddings between old southern families. It was good that she was getting back to work in March, because that was when the wedding season began to blossom, swelling to its peak in mid-June. It sometimes puzzled her how quickly she\u0027d gotten from twenty-one to thirty-six. She\u0027d graduated with a degree in journalism from the University of Georgia, had worked as a reporter on a small paper in her hometown of Macon for two years, then had come to atlanta. The big-time, she\u0027d thought. It took her over a year to get onto the copy desk of the Constitution, a period she\u0027d spent selling kitchen appliances at Sears.\n She\u0027d always harbored hopes of becoming a reporter for the Constitution. a firebrand reporter, with iron teeth and eagle eyes. She would write stories to rip off the mask of racial injustice, destroy the slumlord, and expose the wickedness of the arms dealer. after three years of drudgery writing headlines and editing the stories of other reporters, she got her chance: she was offered a position as a metro reporter. Her first assignment was covering a shooting in an apartment complex near Braves Stadium.\n Only they hadn\u0027t told her about the baby. No, they hadn\u0027t.\n When it was all over, she knew she couldn\u0027t do it again. Maybe she was a coward. Maybe she\u0027d been deluding herself, thinking she could handle it like a man. But a man wouldn\u0027t have broken down and cried. a man wouldn\u0027t have thrown up right there in front of the police officers. She remembered the shriek of an electric guitar, the volume turned up and roaring over the parking lot. It had been a hot, humid night in July. a terrible night, and she still saw it sometimes in her worst dreams.\n She was assigned to the social desk. Her first assignment there was covering the Civitans Stars and Bars Ball.\n She took it.\n Laura knew other reporters, men and women who did their jobs well. They crowded around the distraught relatives of plane-crash victims and stuck microphones in their faces. They went to morgues to count bullet holes in bodies, or stood in gloomy forests while the police hunted for pieces of murder victims. She watched them grow old and haggard, searching for some kind of purpose amid the carnage of life, and she\u0027d decided to stay on the social desk.\n It was a safe place. and as she got older, Laura realized that safe places were hard to find, and if the money was good as well, then wasn\u0027t that the best a person could doi\n She wore a dark blue suit not unlike the outfits worn by the other businesswomen in the restaurant, though hers was maternity-tailored. In the parking lot was her gray BMW. Her husband of eight years was a stockbroker with Merrill Lynch in midtown atlanta, and together they made over a hundred thousand dollars a year. She used Estee Lauder cosmetics, and she shopped for clothes and accessories in the tony little boutiques of Buckhead. She went to a place where she got manicures and pedicures, and another place where she took steambaths and had massages. She went to ballets, operas, art galleries, and museum parties, and most of the time she went alone.\n Doug\u0027s work claimed him. He had a car phone in his Mercedes, and when he was home he was constantly making or receiving calls. That was a camouflage, of course. They both knew it was more than work. They were caring toward each other, like two old friends might be who had faced adversity and fought through it together, but what they had could not be called love.\n \"So how\u0027s Dougi\" Carol asked. She\u0027d known the truth for a long time. It would be hard to hide the truth from someone as sharp-eyed as Carol, and anyway, they both knew many other couples who lived together in a form of financial partnership.\n \"He\u0027s fine. Working a lot.\" Laura took another bite of her gumbo. \"I hardly see him except on Sunday mornings. He\u0027s started playing golf on Sunday afternoons.\"\n \"But the baby\u0027s going to change things, don\u0027t you thinki\"\n \"I don\u0027t know. Maybe it will.\" She shrugged. \"He\u0027s excited about the baby, but... I think he\u0027s scared, too.\"\n \"Scaredi Of whati\"\n \"Change, I guess. Having someone new in our lives. It\u0027s so strange, Carol.\" She placed a hand against her stomach, where the future lived. \"Knowing that inside me is a human being who\u0027ll - God willing - be on this earth long after Doug and I are gone. and we\u0027ve got to teach that person how to think and how to live. That kind of responsibility is scary. It\u0027s like... we\u0027ve just been playing at being grown-ups until now. Can you understand thati\"\n \"Sure I can. That\u0027s why I never wanted children. It\u0027s a hell of a job, raising kids. One mistake, and bam! You\u0027ve either got a wimp or a tyrant. Jesus, I don\u0027t know how anybody can raise kids these days.\" She downed a hefty drink of chardonnay. \"I don\u0027t think I\u0027m the mothering type, anyway. Hell, I can\u0027t even housebreak a puppy.\"\n That much was certainly true. Carol\u0027s Pomeranian had no respect for Oriental carpets and no fear of a rolled-up newspaper. \"I hope I\u0027m a good mother,\" Laura said. She felt herself approaching inner shoals. \"I really do.\"\n \"You will be. Don\u0027t worry about it. You definitely are the mothering type.\"\n \"Easy for you to say. I\u0027m not so sure.\"\n \"I am. You mother the hell out of me, don\u0027t youi\"\n \"Maybe I do,\" Laura agreed, \"but that\u0027s because you need somebody to kick you in the tail every now and again.\"\n \"Listen, you\u0027re going to be a fantastic mother. Mother of the year. Hell, mother of the century. You\u0027re going to be up to your nose in Pampers and you\u0027re going to love it. and you watch what happens to Doug when the baby comes, too.\"\n Here lay the real rocks, on which boats of hope could be broken to pieces. \"I\u0027ve thought about that,\" Laura said. \"I want you to know that I\u0027m not having this baby so Doug and I can stay together. That\u0027s not it at all. Doug has his own life, and what he does makes him happy.\" She traced money signs on the misty glass of Perrier. \"One night I was at home reading. Doug had gone to New York on business. I was supposed to cover the Ball of Roses the next day. It struck me how alone I was. You were in Bermuda, on vacation. I didn\u0027t want to talk to Sophia, because she doesn\u0027t like to listen. I tried four or five people, but everybody was out somewhere. So I sat there in the house, and do you know what I realizedi\"\n Carol shook her head.\n \"I don\u0027t have anything,\" Laura said, \"that\u0027s mine.\"\n \"Oh, right!\" Carol scoffed. \"You\u0027ve got a three-hundred-thousand-dollar house, a BMW, and a closetful of clothes I\u0027d die to get my hooks into! So what else do you needi\"\n \"a purpose,\" Laura answered, and her friend\u0027s wry smile faded.\n The waiter brought their lunches. Soon afterward, three women entered the restaurant, one of them pushing a stroller, and they were seated a few tables away from Laura and Carol. Laura watched the mother - a blond-haired woman at least ten years younger than herself, and fresh in the way that youth can only be - look down at her infant and smile like a burst of sunshine. Laura felt her own baby move in her belly, a sudden jab of an elbow or knee, and she thought of what he must look like, cradled in the swollen pink womb, his body feeding from a tube of flesh that united them. It was amazing to her that in the body within her was a brain that would hunger for knowledge. That the baby had lungs, a stomach, veins to carry his blood, reproductive organs, eyes, and eardrums. all this and so much more had been created inside her, had been entrusted to her. a new human being was about to emerge into the earth. a new person, suckled on her fluids. It was a miracle beyond the miraculous, and sometimes Laura couldn\u0027t believe it was really about to happen. But here it was, two weeks until a birth day. She watched the young mother smooth a white blanket around the infant\u0027s face, and then the woman glanced up at her. Their eyes met for a few seconds, and the two women passed a smile of recognition of labors past and yet to be.\n \"a purpose,\" Carol repeated. \"If you\u0027d wanted one of those, you could\u0027ve come over and helped me paint my condo.\"\n \"I\u0027m serious. Doug has his purpose: making money, for himself and his clients. He does a good job at it. But what do I havei Don\u0027t say the newspaper, please. I\u0027ve gone about as far as I can go there. I know I\u0027m paid well and I have a cushy job, but -\" She paused, trying to put her feelings into words. \"That\u0027s something anybody can do. The place won\u0027t fold if I\u0027m not at my desk.\" She cut a piece of salmon but left it on her plate. \"I want to be needed,\" she told Carol. \"Needed in a way that no one else can match. Do you understandi\"\n \"I guess so.\" She looked a little uncomfortable at this personal revelation.\n \"It doesn\u0027t have anything to do with money or possessions. Not the house, not the car, not clothes or anything else. It\u0027s having someone who needs you, day and night. That\u0027s what I want. and, thank God, that\u0027s what I\u0027m going to have.\"\n Carol was attacking her salad. \"I still say,\" she observed, a shred of crabmeat on her fork, \"that a puppy would have been less expensive. and puppies don\u0027t want to shave all their hair off except for a rat-tail hanging down in back, either. They don\u0027t like punk rock and heavy metal, they don\u0027t chase girls, and they won\u0027t get their front teeth knocked out at football practice. Oh, Jesus, Laura!\" She reached across the table and gripped Laura\u0027s hand. \"Swear you won\u0027t name him Bo or Bubba! I won\u0027t be godmother to a kid who chews tobacco! Swear it, okayi\"\n \"We\u0027ve decided on a name,\" Laura said. \"David. after my grandfather.\"\n \"David.\" Carol repeated it a couple of times. \"Not Davy or Dave, righti\"\n \"Right David.\"\n \"I like that. David Clayborne. President of the Student Government association, the University of Georgia, nineteen... oh Lord, when would that bei\"\n \"Wrong century. Try twenty ten.\"\n Carol gasped. \"I\u0027ll be ancient!\" she said. \"Shriveled up and ancient! I\u0027d better get some pictures made so David\u0027ll know how pretty I used to be!\"\n Laura had to laugh at Carol\u0027s expression of merry terror. \"I think you\u0027ve got plenty of time for that.\"\n They veered away from talking about the forthcoming new arrival, and Carol, who was also a reporter on the Constitution\u0027s social desk, entertained Laura with more tales from the trenches. Then her lunch break was over, and it was time for Carol to get back to work. They said good-bye in front of the restaurant as the valets brought their cars, and then Laura drove home while cold drizzle fell from a gray winter sky. She lived about ten minutes away from Lenox Square, on Moore\u0027s Mill Road off West Paces Ferry. The white brick house was on a small plot of land with pine trees in front. The place wasn\u0027t large, particularly in comparison to the other houses in the area, but it had carried a steep price tag. Doug had said he\u0027d wanted to live close to the city, so when they found the property through the friend of a friend they\u0027d been willing to spend the money. Laura pulled into the two-car garage, opened an umbrella, and walked back out to the mailbox. Inside were a half-dozen letters, the new issue of The atlantic Monthly, and catalogues from Saks and Barnes and Noble. Laura went back into the garage and pressed the code numbers in on the security system, then she unlocked a door that led into the kitchen. She shed her raincoat and looked through the letters. Electric bill, water bill, a letter whose envelope read MR. aND MRS. CLEYBURN YOU HaVE WON aN aLL-EXPENSES-PaID TRIP TO DISNEY WORLD!, and three more letters that Laura held on to after she\u0027d pushed aside the bills and the desperate come-on for the sale of Florida swampland. She walked through a hallway into the den, where she punched on the answering machine to check her messages.\n Beep. \"This is Billy Hathaway from Clements Roofing and Gutter Service, returnin\u0027 your call. Missed you, I guess. My number\u0027s 555-2142. Thanks.\"\n Beep. \"Laura, it\u0027s Matt. I just wanted to make sure you got the books. So you\u0027re going to lunch with Carol today, huhi are you a glutton for punishmenti Have you decided to name the kid after mei Talk to you later.\"\n Beep. Click.\n Beep. \"Mrs. Clayborne, this is Marie Gellsing from Homeless aid of atlanta. I wanted to thank you for your kind contribution and the reporter you sent to give us some publicity. We really need all the help we can get. So thanks again. Good-bye.\"\n and that was it.\n Laura walked over to the tapedeck, pushed in a tape of Chopin piano preludes, and eased herself down in a chair as the first sparkling notes began to play. She opened the first letter, which was from Help for appalachia. It was a note requesting aid. The second letter was from Fund for Native americans, and the third was from the Cousteau Society. Doug said she was a sucker for causes, that she was on a national mailing list of organizations that made you think the world would collapse if you didn\u0027t send a check to prop it up. He believed most of the various funds and societies were already rich, and you could tell that because of the quality of their paper and envelopes. Maybe ten percent of contributions get where they\u0027re supposed to go, Doug had told her. The rest, he said, went to accounting fees, salaries, building rents, office equipment, and the like. So why do you keep sending them more moneyi\n Because, Laura had told him, she was doing what she thought was right. Maybe some of the funds she donated to were shams, maybe not. But she wasn\u0027t going to miss the money, and it all came from her newspaper salary.\n But there was another reason she gave to charities, and perhaps it was the most important one. Purely and simply, she felt guilty that she had so much in a world where so many suffered. But the hell of it was that she enjoyed her manicures, her steambaths, and her nice clothes; she\u0027d worked hard for them, hadn\u0027t shei She deserved her pleasures, and anyway she\u0027d never used cocaine or bought animal-skin coats and she\u0027d sold her stock in the company that did so much business in South africa. and had made a lot of profit from the sale, too. But Jesus, she was thirty-six years old! Thirty-six! Didn\u0027t she deserve the fine things she\u0027d worked so hard fori\n Deserve, she thought. Who really deserved anythingi Did the homeless deserve to shiver in alleysi Did the harp seals deserve to be clubbed and slaughteredi Did the homosexual deserve aIDS, or the wealthy woman deserve a fifteen-thousand-dollar designer dressi Deserve was a dangerous word, Laura thought. It was a word that built barriers, and made wrong seem right.\n She put the letters aside, on a small table next to her checkbook.\n a package of four books had come in the mail yesterday, sent from Matt Kantner at the Constitution. Laura was supposed to read them and do reviews for the arts and Leisure section over the next month or so. She\u0027d scanned them yesterday, when she\u0027d been sitting by the fireplace and the rain was coming down outside. There was the new novel by anthony Burgess, a nonfiction book on Central america, a novel about Hollywood called The address, and a fourth nonfiction work that had instantly caught her attention.\n Laura picked it up from where it sat beside her chair with a bookmark in it. It was a thin book, only one hundred and seventy-eight pages, and not very well produced. The covers were already warping, the paper was of poor quality, and though the pub date was 1989, the book had a faintly moldy smell. The publisher\u0027s name was Mountaintop Press, based in Chattanooga, Tennessee. The title was Burn This Book, by Mark Treggs. There was no author\u0027s picture on the back, only an ad for another book about edible mushrooms and wildflowers, also written by Mark Treggs.\n Looking through Burn This Book brought back some of the feelings that had surfaced when she was sitting in the Fish Market. Mark Treggs, as recounted in the slim memoir, had been a student at Berkeley in 1964, and had lived in Haight-ashbury in San Francisco during the era of love-ins, long hair, free LSD, happenings, and skirmishes with the police in Peoples\u0027 Park. He wrote wistfully of communes, of crash pads hazed with marijuana fumes, where discussions of allen Ginsburg poems and Maoist theories mingled into abstract philosophies of God and nature. He talked about draft card burnings, and massive marches against Vietnam. When he described the smell and sting of tear gas, he made Laura\u0027s eyes water and her throat feel raw. He made that time seem romantic and lost, a communion of outlaws battling for the common cause of peace. Seen in hindsight, though, Laura realized there was as much struggle for power between the various factions of unrest as there was between the protesters and the Establishment. In hindsight, that era was not as romantic as it was tragic. Laura thought of it as the last scream of civilization, before the Dark ages set in.\n Mark Treggs talked about abbie Hoffman, the SDS, altamont, flower power, the Chicago Seven, Charles Manson and the White album, the Black Panthers, and the end of the Vietnam War. as the book went on, his writing style became more confused and less pointed, as if he were running out of steam, his voice dwindling as had the voices of the Love Generation. at the midpoint, he called for an organization of the homeless and a rising up against the powers of Big Business and the Pentagon. The symbol of the United States was no longer the american flag, he said, it was a money sign against a field of crosses. He advocated demonstrations against the credit card companies and the TV evangelists; they were partners, Treggs believed, in the stupefaction of america.\n Laura closed Burn This Book and laid it aside. Some people probably would heed the title, but the volume was most likely fated to molder in the cubbyhole bookstores run by holdover hippies. She\u0027d never heard of Mountaintop Press before, and from the looks of their production work they were only a small regional outfit with not a whole lot of experience or money. Little chance of the book being picked up by mainstream publishers, either, this sort of thing was definitely out of fashion.\n She put her hands to her stomach and felt the heat of life. What would the world be like by the time David reached her agei The ozone layer might be gone by then, and the forests gnawed bare by acid rain. Who knew how much worse the drug wars could get, and what new forms of cocaine the gangs could flood the streets withi It was a hell of a world to bring a child into, and for that she felt guilty, too. She closed her eyes and listened to the soft piano music. Once upon a time, Led Zeppelin had been her favorite band. But the stairway to heaven had broken, and who had time for a whole lotta lovei Now all she wanted was harmony and peace, a new beginning: something real that she could cradle in her arms. The sound of amplified guitars reminded her too much of that hot July night, in the apartments near the stadium, when she watched a woman crazy on crack put a gun to a baby\u0027s head and blow the infant\u0027s brains out in a steamy red shower.\n Laura drifted amid the piano chords, her hands folded across her belly. The rain was falling harder outside. The gutters that needed repairs would soon be flooding. But in the house it was safe and warm, the security system was on, and for the moment Laura\u0027s world was a sanctuary. Dr. Bonnart\u0027s number was close at hand. When the time came, she\u0027d deliver the baby at St. James Hospital, which was about two miles from the house.\n My baby is on the way, she thought.\n My baby.\n Mine.\n Laura rested as the silvery music of another age filled the house and rain began to slam down on the roof.\n and at a K-Mart near Six Flags, the clerk behind the counter in the sporting goods department was just selling a boy-sized rifle called a Little Buckaroo to a customer who wore stained overalls and a battered Red Man cap. \"I like the looks of that one,\" the man in the cap said. \"I believe Cory will, too. That\u0027s my boy. Saturday\u0027s his birthday.\"\n \"I wish I\u0027d had me a squirrel gun like this when I was a boy,\" the clerk said as he got the rifle, two boxes of ammunition, and a small telescopic sight ready to go. \"Nothin\u0027 better than bein\u0027 out in the woods doin\u0027 a little shootin\u0027.\"\n \"That\u0027s the truth. Got woods all around where we live, too. and plenty of squirrels, I\u0027m tellin\u0027 you.\" Cory\u0027s father, whose name was Lewis Peterson, began to write out a check for the amount. He had the work-roughened hands of a carpenter. \"Yeah, I believe a ten-year-old fella can handle a rifle that size, don\u0027t youi\"\n \"Yessir, it\u0027s a beauty.\" The clerk copied down the necessary information and filed the form in a little metal box behind the counter. When the Buckaroo was slid into its rifle case and wrapped up, the gun was passed across the counter to Lewis Peterson. The clerk said, \"There you go. Hope your boy has a happy birthday.\"\n Peterson put the package under his arm, the receipt in full view for the security guard up front to see, and he walked out of the K-Mart into the misting afternoon rain. Cory was going to be jumping up and down on Saturday, he knew. The boy had wanted a gun of his own for some time, and this little rifle was just the thing for him. a good starter rifle.\n He got in his pickup truck, a shotgun in its rack across the back window. He started the engine and turned on the windshield wipers, and he drove home feeling proud and good, his son\u0027s birthday present cradled on the seat beside him. \n","sourceLink":"https://allnovel.net/mine/page-2.html","bookId":2480,"book":{"id":2480,"title":"Mine","description":"Storyline: \n Adrift in the 1980s and slowly losing her mind, a heavily armed former \u002760s radical kidnaps a baby with the hope, deluded as it may be, of returning her life to simpler times. The child\u0027s mother, though, isn\u0027t about to take it lying down and, along with a tracker, begins a cross-country chase to get her child back.\n \n","cover":"https://allnovel.net/images/mine.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/mine.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:53:28 PM"}}
