{"id":83808,"no":41,"title":"Page 41","content":"Three hours ahead of the Cutlass, the snow was whirling before Mary\u0027s headlights. It was coming down fast and heavy now from the solid night, a blowing snow that the wipers were straining to clear. Every so often a gust of wind would broadside the Cherokee and the wheel would shudder in Mary\u0027s hands. She could feel the tires wanting to slew on the slick interstate, and around her the other traffic - which had thinned out dramatically since nightfall - had slowed to half the posted speed. \"We\u0027re going to be fine,\" she told Drummer. \"Don\u0027t you worry, Mama\u0027ll take care of her sweet baby.\" But the truth was that the ants of fear were crawling under her skin, and she\u0027d passed two pileups since she\u0027d left a McDonald\u0027s in North Platte, Nebraska, twenty minutes before. This kind of driving shredded the nerves and shot the eyes, but the interstate was still clear and Mary didn\u0027t want to stop until she had to. Drummer had been fed and changed at the McDonald\u0027s, and he was getting sleepy. Mary\u0027s injured leg was numb from driving, but the pain in her forearm wound woke up occasionally and bit her hard and deep just to let her know who was really in charge. She felt feverish, too, her face moist and swollen with heat. She had to go on, as far as she could tonight, before her suffering body gave out on her. \"Let\u0027s sing,\" Mary said. \"\u0027age of aquarius,\u0027\" she decided. \"The Fifth Dimension, rememberi\" But of course Drummer did not. She began to sing the song, in a voice that might have been pleasant in her youth, but was now harsh and incapable of carrying a tune. \" \u0027If You\u0027re Going to San Francisco,\u0027\" she said: another song title, but she couldn\u0027t recall the artist\u0027s name. She began to sing that, too, but she knew only the part about going to San Francisco with flowers in your hair, so she sang that over and over a few times and then let it go. The snow blew against the windshield and the Cherokee trembled. The flakes hit the glass and stuck there, large and intricate like Swiss lace, for a few seconds before the wipers could plow them aside and the next ones came. \"\u0027Hot Fun in the Summertime,\u0027\" Mary said. \"Sly and the Family Stone.\" Except she didn\u0027t know the words to it, all she could do was hum the tune. \u0027\"Marrakesh Express.\u0027 Crosby, Stills, and Nash.\" She knew almost all of that one; it had been one of Lord Jack\u0027s favorites. \" \u0027Light My Fire,\u0027\" the man in the backseat said in a voice like velvet and leather. Mary looked into the rearview mirror and saw his face and part of her own. Her skin was glistening with fever sweat. His was white, like carved ice. \" \u0027Light My Fire,\u0027\" God repeated. His dark hair was a thick mane, his face sculpted with shadows. \"Sing it with me.\" She was shivering. The heater was blasting, she was full of heat, but she was shivering. God looked just like he did when she\u0027d seen him up close in Hollywood. She smelled the phantom aromas of pot and strawberry incense, the combination like an exotic and lost perfume. He began to sing, there in the back of the Cherokee, as the snow flailed down and Mary Terror gripped the wheel. She listened to his half moan, half snarl, and after a while she joined him. They sang \"Light My Fire\" together, his voice tough and vibrant, hers searching for the lost chord. and they were on the part about setting the night on fire when Mary saw red flames erupt in the windshield. Not flames, no: brake lights. a truck, its driver stomping on the brakes just in front of her. She wrenched the wheel to the right and felt the tires defy her. The Cherokee was sliding into the rear of a tractor-trailer rig. She made a choked noise as God sang on. and then the Cherokee lurched as the tires found traction; the vehicle went off onto the right shoulder and missed slamming into the truck by about two feet. Maybe she had screamed; she didn\u0027t know, but Drummer was awake and crying shrilly. \u0027 Mary put the emergency brake on, picked up Drummer, and hugged him against her. The song had stopped. God was no longer in the backseat; he had abandoned her. The truck was moving on, and a hundred yards ahead blue lights spun and figures stood in the sweeping snow. It was another wreck, two cars jammed together like mating roaches. \"It\u0027s all right,\" Mary said as she rocked the child. \"It\u0027s all right, shhhhhh.\" He wouldn\u0027t stop, and now he was wailing and hiccuping at the same time. \"Shhhhh, shhhhhh,\" she whispered. She was burning up, her leg was hurting again, and her nerves were raw. He kept crying, his face squeezed with anger. \"SHUT UP!\" Mary shouted. \"SHUT UP, I SaID!\" She shook him, trying to rattle his crybox loose. His breath snagged on a series of hiccups, his mouth open but nothing coming out. Mary felt a jolt of panic, and she pressed Drummer against her shoulder and thumped his back. \"Breathe!\" she said. \"Breathe! Breathe, damn you!\" He shuddered, pulling the air into his lungs, and then he let out a holler that said he was through taking shit. \"Oh, I love you, I love you so much!\" Mary told him as she rocked him and tried to quiet him down. What if he\u0027d strangled to death just theni What if he hadn\u0027t been able to breathe and he\u0027d died right herei What good would a lump of dead baby be for Jacki \"Oh Mama loves her baby, her sweet sweet Drummer, yes she does,\" Mary crooned, and after a few minutes Drummer\u0027s tantrum subsided and his crying ceased. \"Good baby. Good baby Drummer.\" She found the pacifier he\u0027d spat out and stuck it back in his mouth. Then she laid him on the floorboard again, snuggled deep in a dead man\u0027s parka, and she got out of the Cherokee and stood in the falling snow trying to cool her fever. She limped away a distance, picked up a handful of snow, and rubbed it over her face. The air was wet and heavy, the snowflakes whirling down from a heaven as dark as stone. She stood watching other cars, vans, and trucks go past, heading west. The cold made her head clear and sharpened her senses. She could go on. She had to go on. Jack was waiting for her, and when they were joined again life would be incense and peppermints. Back behind the wheel, Mary repeated the three names over and over again as the night went on and the miles clicked away. \"Hudley... Cavanaugh... Walker... Hudley...\" \"Cavanaugh... Walker,\" God said, returned to the Cherokee\u0027s backseat. He came and went, at his whim. There were no chains on God. Sometimes Mary looked back at him and thought he favored Jack, other times she thought there had never been another face like his and there never would be again. \"Do you remember mei\" she asked him. \"I saw you once.\" But he didn\u0027t answer, and when she glanced in the rearview mirror again the backseat was empty. The snow was getting heavier, the wind rocking the Cherokee like a cradle. The land changed from flat to rolling, a preview of Wyoming. Mary stopped at a gas station near Kimball, twenty-five miles east of the Wyoming state line, and she filled the Cherokee\u0027s tank and bought a pack of glazed doughnuts and black coffee in a plastic cup. The brassy-haired woman behind the counter told her she ought to get off the interstate, that the weather was going to get worse before it got better, and there was a Holiday Inn a couple of miles north. Mary thanked her for the advice, paid what she owed, and pulled out. She crossed the Wyoming line, and the land began to rise toward the Rocky Mountains. The lights of Cheyenne emerged from the snow-torn dark, then disappeared in Mary\u0027s rearview mirror as she drove on. The wind\u0027s force had increased, shrieking around the Cherokee and shaking it like an infant with a rattle. The wiper blades were losing their combat with the snow, the headlights showing cones of whirling white. Fever sweat glistened on Mary\u0027s face, and from the backseat the voice of God urged her on. Forty miles past Cheyenne, Laramie went past like a white dream, and the Cherokee\u0027s tires began to slip as I-80 rose on its rugged ascent between mountain ranges. another twenty miles beyond Laramie, into the teeth of the wind, and Mary suddenly realized there were no more vehicles coming from the west. She was alone on the highway. an abandoned tractor-trailer truck, its emergency lights flashing, came out of the snow on her right, its back freighted with frost. The highway\u0027s ascent was steeper now, the Cherokee\u0027s engine lugging. She felt the wheels slide on patches of ice, the wind savage as it howled across the mountain peaks. The wiper blades were getting loaded down, the windshield as white as a cataract. She had to fight the wheel from side to side as the wind beat at the Cherokee, and she passed two more abandoned cars that had slammed together and skidded off onto the median. Yellow emergency lights were flashing ahead of her again, and in another moment she could make out the big blinking sign that stood on the interstate: STOP ROaD CLOSED. a highway patrol car was parked nearby, its lights spinning in the murk of snowflakes. as Mary slowed the Cherokee, two troopers in heavy overcoats began to wave red flashlights at her, flagging her down. She stopped, rolled her window down, and the cold that swept in iced her lungs and overpowered the heater in four seconds. Both the troopers wore ski masks and caps with earflaps, and the one who stepped up to her window to speak to her shouted, \"Can\u0027t go any farther, ma\u0027am! I-80\u0027s closed between here and Creston!\" \"I have to get through!\" Her lips were already freezing, the air\u0027s temperature fallen below zero and snowflakes clinging to her eyebrows. \"No, ma\u0027am! Not tonight! Highway\u0027s iced up over the mountains!\" He aimed his flashlight to Mary\u0027s right. \"You\u0027ll have to pull off here!\" She looked where the light was pointed, and saw a sign that said EXIT 272. Below the exit number were MCFaDDEN and ROCK RIVER. a snowplow was shoving a mound of white off the exit road. \"The Silver Cloud Inn\u0027s about two miles toward McFadden!\" the trooper went on. \"That\u0027s where we\u0027re sending everybody!\" \"I can\u0027t stop! I\u0027ve got to keep going!\" \"We\u0027ve had three fatalities on that stretch of highway since this storm started, ma\u0027am, and it\u0027s not going to get any better before daylight! You\u0027re not in a big enough hurry to get yourself killed!\" Mary looked at Drummer, swaddled in the parka. again the question came to her what good would a lump of dead baby be for Jacki Her leg was hurting her, she was tired and it had been a long day. It was time to rest until the storm had passed. \"all right!\" she told the trooper. \"I\u0027ll pull off!\" \"Just follow the signs!\" he said, and he waved her toward the exit with his flashlight. Mary trailed the snowplow for a few hundred yards and then eased the Cherokee around it. Her headlights caught a sign that said SILVER CLOUD INN NEXT LEFT. SEE THE WORLD-FaMOUS DINOSaUR GaRDENS! She took the left turn when it came, and had to fight the Cherokee uphill on a curving road bordered with dense, snow-weighted woods. The tires moaned as they lost their grip, and the Cherokee skidded violently to the right and careened off the guardrail before rubber found pavement again. Mary kept pushing the Cherokee onward, and around the next curve she saw abandoned cars on the sides of the road. Maybe a hundred yards farther, and the Cherokee\u0027s tires lost their purchase again, this time swinging the vehicle toward the left and slamming into a four-foot-high snowbank. The engine rattled and died with an exhausted moan, and the wind\u0027s shriek reigned over all. Mary started the engine again, backed away from the snowbank, and tried to force the Cherokee on, but the tires slipped and slid and she realized the rest of the way would have to be on foot. She turned onto the left shoulder, cut the engine, and pulled up the emergency brake. Then she buttoned up her corduroy coat to her neck, zipped Drummer securely in the parka, and put her bag with its cache of baby supplies and guns over her shoulder. She picked Drummer up, opened her door, and stepped out into the storm. The cold overpowered her fever as it had the Cherokee\u0027s heater. It was a solid thing, hard as iron, and it locked around her and turned every movement into an agony of slow motion. But the wind was fast and loud, and the snow-covered trees thrashed in white torment. She limped along the left lane, her arms folded around the infant and snow slashing into her face like bits of razor blade. She felt wet heat on her thigh wound: new blood oozing up through the broken crust, like lava seething from a volcanic core. The road leveled off. The woods gave way to mounds of blowing snow, and Mary could see the yellow lights of a long, ranch-house-type building ahead. Something gargantuan was suddenly towering above Mary and the baby, its reptilian head agrin with jagged teeth. another massive form with armor plates on its back stood nearby, the snow up to its snout. The world-famous Dinosaur Gardens, Mary realized as she limped between the concrete monsters. a third huge beast reared up from the snow on her left, an alligator\u0027s head on a hippo\u0027s body. On her right what looked like a tank with glass eyes and concrete horns stood as if about to charge the rearing statue. Between her and the Silver Cloud Inn was a prehistoric landscape, dozens of dinosaurs frozen on the snowfield. She limped onward, carrying her own history. around her stood fourteen-foot-tall thunder lizards and meat eaters, their sculpted heads white with snow and bearded with icicles, snow wedged into the cracks of their skins. The wind roared like a great monstrous voice, a memory of dinosaur song, and it almost knocked Mary to her knees amid the beasts. Headlights hit her. an enclosed vehicle on treads was coming toward her, snow whirling up in its wake. When it reached her, a man in a cowboy hat and a long brown coat got out and grasped her shoulder, guiding her around to the passenger side. \"anybody else behind youi\" he shouted into her ear, and she shook her head. When they were inside the snow buggy, the heater on full blast, the man picked up a CB radio\u0027s microphone and said, \"Found the new arrivals, Jody. Takin\u0027 \u0027em in.\" \"That\u0027s a big ten-four,\" a man\u0027s voice answered through crackling static. Mary figured it was one of the pigs down on I-80. Then the cowboy turned the buggy around and started driving toward the inn, and he said, \"Get you good and warm in just a few minutes, ma\u0027am.\" The Silver Cloud Inn was made of bleached stones and had a huge pair of antlers over the front door. The cowboy pulled the buggy up to the steps, and Mary got out with Drummer pressed against her. Then the cowboy came around and started to take her shoulder bag, but Mary pulled back and said, \"I\u0027ve got it,\" and he opened the inn\u0027s door for her. Inside, there was a large lobby with oak beams and a stone fireplace that a car could have parked in. The fire was popping sparks, the lobby sweet with the smell of woodsmoke and delicious warmth. Twenty or more people of all ages and descriptions were on cots or in sleeping bags around the fireplace, and another dozen or so were talking or playing cards. Their attention was drawn to Mary and the baby for a few seconds, and then they went back to what they were doing. \"Lord, what a night! Storm\u0027s a screamer, for sure!\" The cowboy took off his hat, revealing thinning white hair and a braided ponytail with a band around it made of multicolored Indian beads. He had a grizzled, heavily lined face and bright blue eyes beneath white brows. \"Rachel, let\u0027s get this lady some hot coffee!\" a gray-haired, plump Indian woman in a red sweater and bluejeans began to draw coffee from a metal dispenser into a plastic cup. On the table beside the coffeemaker were a few sandwiches, some cheese, fruit, and slices of poundcake. \"Name\u0027s Sam Jiles,\" the cowboy said. \"Welcome to the Silver Cloud Inn. I\u0027m sorry you couldn\u0027t see it on a better day.\" \"That\u0027s all right. I\u0027m glad to be here.\" \"Rooms were all gone around seven o\u0027clock. Cots ran out around nine, but we might have a sleepin\u0027 bag left. You travelin\u0027 alone with your babyi\" \"Yes. Going to California.\" She felt him waiting for more. \"To meet my husband,\" she added. \"Bad night to be on the road, I say.\" Jiles walked to the registration desk, where another CB radio was set up. \"Excuse me just a minute.\" He picked up the mike. \"Silver Cloud to Big Smokey, come on back, Smokey.\" The static crackled and hissed, and the pig\u0027s voice answered, \"Big Smokey. You got an ear, Silver Cloud.\" Rachel brought Mary the coffee, and she looked at Drummer in the parka\u0027s folds. \"Oh, that\u0027s a new one!\" she said, her eyes large and dark brown. \"Boy or girli\" \"Boy.\" \"What\u0027s his namei\" \"Brought \u0027em in real fine, Jody,\" Sam Jiles was saying over the radio. \"You fellas want me to bring you down some eatsi\" \"I hear you talkin\u0027, Sam. We\u0027re stuck here till I-80\u0027s open.\" \"Okay, bring you down some grub and coffee pronto.\" \"Does he have a name yeti\" Mary blinked, looking into the Indian woman\u0027s eyes. What was going through her head was the thought that she was trapped with strangers at her back and two pigs guarding the only way out. \"David,\" she said, and the name was foul in her mouth, but Drummer was his real and secret name, not to be shared with everyone. \"That\u0027s a nice, strong name. I\u0027m Rachel Jiles.\" \"I\u0027m... Mary Brown.\" It had come from the color of the woman\u0027s eyes. \"We have some food left.\" Rachel motioned toward the table. \"Ham and cheese sandwiches. Some beef stew there, too.\" She nodded at bowls and a clay pot. \"Help yourself.\" \"Thanks, I will.\" Mary limped over to the table, and Rachel stayed with her. \"Did you hurt your legi\" Rachel asked. \"No, it\u0027s an old injury. Broken ankle didn\u0027t heal right.\" Drummer began to cry at that moment, as if shouting to the world that Mary Terror was lying. She rocked him and cooed to him, but his crying soared up and up with increasing power. Rachel suddenly held out her stocky arms and said, \"I\u0027ve had three boys. Maybe I can try iti\" What would it hurti Besides, the pain in Mary\u0027s leg was so bad it was sapping her strength. She handed Drummer over and fed herself while Rachel rocked him and sang softly in a language Mary didn\u0027t understand. Drummer\u0027s crying began to quiet, his head cocked to one side as if listening to the woman\u0027s singing. In about two minutes he had ceased crying altogether, and Rachel sang and smiled, her round face almost radiant with care for a stranger\u0027s child. Sam Jiles made food packages for the two troopers, loading up sandwiches, fruit, and cake into two sacks and adding cups and a thermos of coffee. He asked one of the men to go with him in the tracked snow buggy, and he kissed Rachel on the cheek and said he\u0027d be back quicker than a skillet sizzles grease. Then he and his companion left the Silver Cloud, a gust of freezing wind and snow coming through the front door with their departure. Rachel seemed to enjoy cradling Drummer, so Mary let her hold the baby while she ate and drank her fill. She limped over to the fireplace to warm herself, threading a path through the other people, and she took off her gloves and offered her palms to the flames. Her fever had returned, throbbing with a hot pulse at her temples, and she couldn\u0027t stay near the fire very long. She glanced at the faces around her, judging them: predominant in the mix were middle-aged people, but there was a couple who might have been in their sixties and two young couples who had the tanned, fit look of ardent skiers. She moved away from the hearth, back toward where Rachel stood with Drummer, and that was when she felt someone watching her. Mary looked to her right, and found a young man sitting against the wall, his legs crossed beneath him. He had a thin, hawk-nosed face and sandy-brown hair that spilled down over his shoulders, and he wore black horn-rimmed glasses, faded jeans with patches on the knees, and a dark blue turtleneck sweater. Beside him was a battered army jacket and a rolled-up sleeping bag. He was watching her intently with deep-socketed eyes the color of ashes. His stare didn\u0027t waver as she returned it, and then he frowned slightly and began to examine his fingernails. She didn\u0027t like him. He made her nervous. She went back to Rachel and took her child. Rachel said, \"He\u0027s sure a good baby! all three of my boys used to holler like screech owls when they were as little as him. How old is hei\" \"He was born on...\" She didn\u0027t know the exact date. \"The third of February,\" she said, which was when she\u0027d taken him from the hospital. \"Do you have any other childreni\" \"No, just Drum -\" Mary smiled. \"Just David.\" Her gaze skittered back to the young man. He was staring at her again. She felt fever sweat on her cheeks. What was that fucking hippie looking ati \"I\u0027ll see if I can find a sleeping bag for you,\" Rachel said. \"We always keep a supply on hand for the campers.\" She went off across the lobby and through another door, and Mary found a place to sit on the floor away from everyone else. She kissed Drummer\u0027s forehead and crooned softly to him. His skin was cool against her lips. \"Going to California, yes we are. Going to California, Mama and her sweet baby.\" She realized with a start that there were two spots of blood, each about the size of a quarter, on the thigh of her jeans. The blood was seeping up through her makeshift bandage. She set Drummer aside, took off her coat, and laid it across her lap. She looked up, and saw the hippie watching her. Mary pulled her shoulder bag, with its small Magnum automatic and the.38 from Rocky Road\u0027s gun cabinet, against her side. \"He knows.\" The voice sent chill bumps shivering up her spine. It had been spoken from her left, and close to her ear. She turned her head. God was there, hunkered down beside her, his glacial face gaunt and his eyes dark with truth. He wore skin-tight black velvet and a gold chain with a crucifix on it. On his head was a floppy-brimmed black hat with a snake-skin band. It was the same outfit he\u0027d worn when she\u0027d seen him up close in Hollywood. Except for one thing: God wore a yellow Smiley Face button on his lapel. \"He knows,\" the cruel mouth repeated in a whisper. Mary Terror stared at the young hippie. He was looking at his fingernails again; he darted a glance at her, then shifted his position and studied the fire. Or pretended to. \"Road\u0027s closed,\" God said. \"Pigs at the roadblock. Your leg\u0027s busted open again. and that fucker knows. What\u0027cha gonna do, Maryi\" She didn\u0027t answer. She couldn\u0027t. She leaned her back against the wall and closed her eyes. She could feel him watching, but every time she opened her eyes she couldn\u0027t catch him at it. Rachel returned with a tattered but usable sleeping bag, and Mary spread it out like a mattress and laid on top of it instead of confining herself inside. She kept the shoulder bag\u0027s strap around her arm, its top zippered shut, and Drummer alternately drowsed and fretted beside her. \"He knows,\" she heard God whisper in her ear as she drifted toward sleep. His voice pulled her away from rest. She felt swollen with damp, pulsing heat, her thigh and forearm wounds heavy with crusted blood under the bandages. a firm touch to her thigh made searing pain travel from her hip to her knee, and the blood spots were growing. \"What\u0027cha gonna do, Maryi\" God asked, and she thought he might have laughed a little. \"Damn you,\" she rasped, and she pulled Drummer closer. It was the two of them against a hateful world. The exhaustion won over pain and fear, at least for a while. Mary slept, Drummer sucked busily on his pacifier, and the young hippie scratched his chin and watched the woman and her infant.","sourceLink":"https://allnovel.net/mine/page-41.html","bookId":2480,"book":{"id":2480,"title":"Mine","description":"Storyline: Adrift in the 1980s and slowly losing her mind, a heavily armed former \u002760s radical kidnaps a baby with the hope, deluded as it may be, of returning her life to simpler times. The child\u0027s mother, though, isn\u0027t about to take it lying down and, along with a tracker, begins a cross-country chase to get her child back.","cover":"https://allnovel.net/images/mine.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/mine.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:53:28 PM"}}
