{"id":98103,"no":4,"title":"Page 4","content":"NINE\\n\\n But before they had even entered the field, alarms started sounding. By the time they were in the Longsword and taking off, a good half-dozen ships were being crewed, ready to take off in\\n\\n pursuit. Plus , thought Soren, the planet is surrounded by Orbital Defense Platforms. This is a crazy idea.\\n\\n The first warning shot flashed past them before they had even cleared the atmosphere, shaking the ship slightly. It was quickly followed by two more, precision shots, even closer, that shocked the ship from end to end. Partch looked scared.\\n\\n ―Evasive maneuvers, Captain Teach!\" he instructed the AI.\\n\\n The latter flickered to holographic life on the console before them. His construct was a pirate captain, bristling with pistols, with a gold-toothed grin and an ebony beard in braids.\\n\\n ―Have been evading all along, lads,\" Teach said. ―There‘s just too many of the bastards.\" He put one hand to his ear, pretended to listen. ―Signal coming in—care to hear it?\"\\n\\n Partch, holding on to the arms of the chair with white-knuckled fingers, just nodded.\\n\\n ―Longsword,\" said a voice that Soren did not recognize. ―You have not been authorized for takeoff.\\n\\n Return to base immediately.\"\\n\\n ―Seems like they should have sent out that before they started firing across our bow,\" said Soren.\\n\\n ―Well, they did,\" the AI admitted. ―But I knew you wouldn‘t want to parley with such scallywags.\"\\n\\n Partch groaned. A shot caught them, burning across the wing, inflicting light damage and giving the Longsword a worrying wobble. The atmosphere was thinner now but they still hadn‘t broken free of Reach‘s gravitation.\\n\\n ―How long until we reach our rendezvous?\" asked Soren.\\n\\n Teach gave a hearty laugh. ―Astronav is unstable after that hit,\" he said. ―I can‘t say that we‘re likely to go anywhere we want at all, even once we‘re free of the planet‘s gravity.\"\\n\\n ―Oh God, oh God,\" said Partch. ―We‘re going to die!\"\\n\\n ―We‘ll have to turn back,\" said Soren. ―Teach, let them know we surrender.\"\\n\\n A blow caught them from behind, spinning the craft almost all the way around. Black smoke, Soren realized, was billowing around them.\\n\\n ―Never surrender,\" said Teach, his hologram flickering. ―Besides, too late for that. Systems are being shut down before they go critical. A pleasure knowing you, lads.\"\\n\\n He vanished. The lights flickered and went out. The craft spun and spiraled, slowly stabilizing.\\n\\n Then gravity began to sink its claws into it and it started down.\\n\\n ―Buckle in,\" said Soren to Partch. Backup power kicked in, stuttered once, then went out again. He flicked the controls over to manual. The engines were gone but, unlike some of the other USNC\\n\\n spacecraft, the Longsword had enough of a wingspan that he might manage to bring it down even without the engines. The flaps he could manually control—at least in theory. He‘d never flown one before, but he‘d flown sims of the Longsword‘s various predecessors and variants, back when he was a Spartan, and crash-landing was one of the scenarios. It should work. With a little luck, they might even survive.\\n\\n HE ENGAGEDmanual, grabbed hold of the stick with both hands, and pulled back, trying to level the craft out and bring it down as softly as he could. The fighters behind him were no longer firing, able, no doubt, to see that the Longsword was in trouble.\\n\\n They were going faster now, a slow whine building around the aircraft. It was hard to hold the stick in place. Partch, he saw, was passed out from fear, g‘s, or a combination of both.\\n\\n They were just above the clouds now, then moving down and through them, the Longsword\\n\\n buffeted back and forth by odd crosswinds. He let the craft settle a little further until they burst out of the bottom of clouds, and then he banked, trying to get a clear view of what was around them.\\n\\n Kilometers of farmland in most directions, more inhabited towns and districts in others, but there, in the distance, almost out of sight, a shimmer of green that he hoped was one of Reach‘s vast swathes of deciduous forest.\\n\\n ―Teach,\" he said, ―Any life left in you?\"\\n\\n There was no response. He would have to try to eyeball it, figure out how to come down in a way that would get him close enough to the forest for a quick escape while still letting him land on open ground.\\n\\n He circled once and saw the pursuing ships still there, just coming through the clouds now, hanging back a little distance, waiting. He pointed toward the green line and started down.\\n\\n He was, he quickly realized, too high, but better too high than too low. He dipped and corrected.\\n\\n There, that was more or less right. Yes, he saw as they came closer, definitely forest. He‘d have to come very close and then try to bring the Longsword along its edge, keep it there more or less once they hit the ground. Then, if he survived the crash, he‘d simply disappear.\\n\\n Lower now. Nearly able to make out individual trees. This was the tricky part, banking just right and then correcting and then descending, trying to keep it all straight. Partch awake and screaming now. Ignore it if you can , he told himself. No, not quite, coming in too close to the trees. Starting away again, but too late, the wing clipping the treetops and starting to come asunder. Out of control now, shaking and shuddering, the craft falling to pieces around him. An engine torn free and crashing through trees as if they were toothpicks. Hold on, Soren , he thought, hold on. One part of his mind was screaming, screaming. The other part was calm, cold. Why worry, Soren? that second part was asking, as the plane around him caught fire and, screeching and falling apart, gouged a half-kilometer-long channel along the ground. You’ve lived through much worse , it was telling him. You should be able to live through this. Partch, he saw from the corner of his eye, was dead, his neck broken, his eyes glazed over. Soren‘s arm seemed to be on fire. He could see the ground and the sky through cracks in the craft as what was left of the fuselage turned over and over again. Metal burning and grinding around him, he waited for whatever god that controlled the farce that was his life to flip some charred and malformed cosmic coin and decide his fate.\\n\\n EPILOGUE\\n\\n There was a knocking on the door. Or rather a rapping on the doorframe: The door had already slid open, revealing Chief Petty Officer Mendez, still in fatigues, an unlit Sweet William jutting from one corner of his mouth.\\n\\n Dr. Halsey looked up from her desk. ―Well?\" she said.\\n\\n ―I‘ve been to the site,\" said Mendez, taking the chair at the other side of the desk. She could still smell the smoke in his clothing. ―I‘ve looked at the wreckage. Not much left. Most of the fuselage is gone and what‘s left is mangled, hardly worth much even as scrap. There was a fire as well. There‘s a body, charred pretty much beyond recognizing, but it doesn‘t belong to Soren-66.\"\\n\\n ―How can you be sure?\"\\n\\n Mendez gave her a look. ―Wasn‘t deformed,\" he said. ―And no evidence of augmentation. Not to mention he was barely six feet, even when you account for fire damage. Must have been the missing technician, Partch—running DNA now. We don‘t know how that one got in here in the first\\n\\n place—take one look at his background and he has all the earmarks of a rebel. We‘ve got some sort of problem with somebody higher up in security.\"\\n\\n ―I‘ll look into it,\" said Dr. Halsey.\\n\\n ―You do that, ma‘am,\" said Mendez. ―If I were you I‘d run the check again on everybody.\"\\n\\n He took out his lighter and held it near the end of his cigar. Before lighting it, he raised his eyebrows inquisitively. She shook her head. A faint look of disgust crossing his mouth, he put the lighter away, leaving the cigar unlit.\\n\\n ―Anything else, Mendez?\" she asked.\\n\\n ―We looked at the parts torn free as well, what we could find of them in the woods. No evidence of him there either. Could be he was thrown out early on. If that‘s the case, we‘ll never find the body.\\n\\n Or could be he made it out in one piece.\"\\n\\n ―You think he‘s still alive?\" Dr. Halsey asked.\\n\\n Mendez shrugged. ―No way to tell,\" he said. ―All I‘ll say is that it‘s strange that we didn‘t find any trace of him. Could be alive, I suppose, but it‘s not likely, even for a Spartan. Considering the kind of luck that Soren-66 had to this point, it‘s hard to imagine things working out well for him.\" He paused, meditative. ―Then again,\" he said, ―maybe his luck was about due for a change.\"\\n\\n Dr. Halsey nodded curtly. ―How‘s Randall doing?\" she asked.\\n\\n Mendez snorted, lips curling back into an almost predatory smile. ―He‘s fine. Kicking himself for letting his guard down a little, but there was nothing he could have done and as far as I can tell, he didn‘t let down much. He might have taken Soren-66, but couldn‘t take both him and somebody armed with a tranquilizer. He did what he could. It‘s good for him to go through something like this.\\n\\n In the long run, he‘ll be a better soldier because of it.\"\\n\\n Halsey nodded. Sink or swim , she couldn‘t help but think. And what was it Soren had said, a few years back now? That he didn‘t want to be left behind? An incident like this would make Randall less cocky, would get him scrambling to make sure that he was up to snuff.\\n\\n ―I‘ve inserted ground troops. Set them combing the woods for the body,\" said Mendez.\\n\\n ―They won‘t find him,\" Dr. Halsey said.\\n\\n ―Maybe not,\" he said. ―Still it‘d be nice to be able to wrap things up, to have some closure.\"\\n\\n ―You won‘t get it. Pull your men back in and file him MIA,\" said Dr. Halsey.\\n\\n ―Not KIA?\"\\n\\n She shook her head. ―Not without a body. He‘s lived through a lot and had a lot of bad luck along the away. He lived through pain that killed some of the other recruits. We should have figured out something for him, some better way of making use of him. I‘d bet he‘s out there somewhere, still alive.\"\\n\\n ―If he‘s out there, we can find him.\"\\n\\n ―No, you won‘t,\" she said. ―He grew up living in the forest. You‘ll find him only if he wants to be found. You might as well pull your troops.\"\\n\\n ―But—\"\\n\\n She reached across the desk and touched his arm. ―Let him go, Franklin,\" she said, her voice softening. ―He‘s no threat to us.\"\\n\\n ―He‘s an augmented, Spartan-trained insurrectionist sympathizer. How is that not a threat?\" he asked.\\n\\n ―He‘s no traitor. He‘s just a lost soul, looking for a direction. I know him. Trust me.\"\\n\\n ―What about—\" he started to answer, then thought better of it, stopped. He stood, saluted her, and went out, leaving her to her thoughts.\\n\\n GONE NOW, she thought.\\n\\n Was I wrong? she thought. Should I not have given him the choice? Should I not have brought him into the Spartan program in the first place?\\n\\n She ran a finger slowly through Deja‘s hologram construct, watched the AI clutch her clay tablets closer to her chest and stare at her, puzzled, curious.\\n\\n Had she been wrong? She sighed. Too late for it to matter either way.\\n\\n ―Penny for your thoughts,\" said Deja.\\n\\n Dr. Halsey shook her head. Deja smiled. Then she shrugged and disappeared.\\n\\n Whether she‘d been wrong or right, Dr. Halsey realized, she was committed now. She‘d had\\n\\n seventy-five lives to watch out for, seventy-five lives depending on her, seventy-five lives weighing on her conscience. Even if it was down now to less than half that, there were still several dozen Spartans depending on her. Not to mention the weight of all those already dead. The future of millions might depend on them, on how well she‘d done her job. Not might , she corrected herself, did .\\n\\n She straightened her shoulders, shifting under her burden, and went back to work.\\n\\n STOMPING ON THE HEELS\\n\\n OF A FUSS\\n\\n ERIC RAAB\\n\\n THE INTENSEstink and splatter from the Brutae‘s roar woke Connor Brien instantly—a web of\\n\\n spittle connected the beast‘s jagged, bloodstained fangs. The smell of the Brute‘s breath was bad enough, but as he tried to wipe the wet off his face, he just set the odor deeper into his mustache, beard, and all over his hands. He convulsed, gagging once before vomiting the last MRE he‘d eaten.\\n\\n He kept his eyes on the ground, knowing to avoid eye contact with the gray-haired beast, something he learned from all of his studies before arriving. He‘d watched video feeds of humans who dared to stare defiantly at Brutes and were beaten into mush in seconds. Even the slightest eye contact was some form of challenge they could not resist.\\n\\n His last memory was falling from the tree he‘d set up as his surveillance point. He‘d been watching a trio of the beasts as they gestured to one another, trying to track a human that they‘d let escape from captivity for the fun of hunting him down. He thought he‘d be safe up high, but he quickly learned that the Brutes not only had a great sense of smell but they were excellent climbers. He had fallen while panicking, reaching for his tranq dart gun as one of the Brutes climbed quickly toward him. He felt down by his leg and breathed a sigh of relief. Its reassuring bulk was still strapped to his ankle.\\n\\n He kicked himself for not having his M6, which sat nestled in his pack at his base camp; but then he realized, what good would it do? Another dozen or so Brutes hovered behind the one who treated him to his wake-up shower. Varying in shades of brown and black, tan and gray, each hulking beast seemed more fierce and frightening than the next. They each stood at about nine feet, and though he didn‘t dare to look, they all seemed to be casting hungry eyes on his five-foot-five frame. Even if he could take out twelve of them, the thirteenth would rip him to shreds.\\n\\n He surveyed his surroundings. It was a makeshift camp, all centered around a large Covenant ship.\\n\\n The nearby outpost‘s shops and cabins had clearly been ransacked, the camping equipment and supplies strewn among what looked like thousands of human bones, all still with dried blood and muscle clinging to them. He even noticed a few methane tanks scattered about and the charred remains of Grunts. They were eating their own.\\n\\n He turned to survey his fellow captives and the smell really set in, death clinging to the roof of his mouth. They all hovered together but there was no fence or wall keeping them in. He thought immediately that he could run for it, but as he looked at the other prisoners and the mounds of human carnage surrounding the camp, he knew that was a bad idea. None of the prisoners looked anywhere near well. Shreds of soiled clothing hung in tatters from their malnourished bodies.\\n\\n Knotted hair on their heads and faces, bloodstained hands and teeth, unhealed scars and open wounds, mounds of excrement . . . no one looked capable of moving, except him. And judging by the way this beast welcomed him awake, that wouldn‘t last very long. Why the Brutes had been keeping any of them alive was beyond his understanding.\\n\\n He‘d spent four days watching this camp from about a mile up a rolling hill of forest, and as soon as he‘d arrived he knew it was a bad scene. Reports had the human occupancy of Beta Gabriel at barely five hundred people. But judging by the carnage he‘d seen strewn about the forest, it had to have been much more. Beta Gabriel was a blip on the map, an ―uninhabited\" planet that a group of entrepreneurs turned into a secret society, an ―outdoors\" getaway: a place where the wealthy came to hike, hunt, go on spirit quests, or to get in touch with themselves or whatever they got in touch with. There wasn‘t a lot of commerce or buildings on the planet, just a few supply shops, a basic landing port, a few rustic cabins strewn about, and a community lodge outfitted with information on the planet and maps of the area.\\n\\n In the time he‘d studied the Brutes from his tree, he had witnessed some of the most vulgar and brutal treatment of another living species he‘d ever seen. It had been completely unbearable to watch, let alone understand. The Brutes had turned their human captives into toys. Some were tortured in despicable ways, pitted against one another in games that even Brien couldn‘t make out the rules for—at least not at that distance.\\n\\n Connor Brien was one of the Office of Naval Intelligence‘s top operatives, recruited by ONI after the Covenant first attacked Humanity. His work in linguistic anthropology was as good as it gets, most noted for deciphering the language and sociological structure of a lost tribe discovered deep in the tundra of North America that had survived hundreds of years in an elaborate cave dwelling.\\n\\n Their origins dated back some six hundred years, and Brien linked their societal structure back to a small charismatic cult that emerged in the early 1970s.\\n\\n As an ONI intelligence officer, he had played an integral part in unraveling the methodology behind the Covenant by brilliantly decoding the sign language of a captured Covenant Engineer, and had been the commanding ONI officer on some of the most harrowing attempts to capture Covenant species alive. He had an extreme taste for adventure. He was fearless and brilliant, as relentless as a man can get. He earned the nickname ―Kip\" among his peers, an homage to Rudyard Kipling, a\\n\\n nineteenth-century novelist and adventurer. He actually looked a bit like Kipling, with his bushy eyebrows and salt-and-pepper beard.\\n\\n But it was one fateful day that really put him on his path. He and a team of Marines had actually succeeded in subduing a Brute-led siege of their ship as they traversed for the first time into Covenant space. They managed to tranq the six Brutes who boarded, but they should have killed them. When he got a really close look at them he was in awe. But the tranq darts wore off fast on these behemoths and their attempts to contain them quickly proved feeble. The pack literally tore their way out of the synthetic alloy constraints, and even unarmed proved to be an unstoppable force. The Marines managed to wipe out their fierce gray-haired leader, and Brien hid and watched in amazement as his death incited something primal in the others, who began scrambling and\\n\\n recklessly attacking with more viciousness and abandon than before. But what really interested him was that there was one lone Brute whose coat was much shaggier than the others, that didn‘t charge and simply watched the melee. He thought at first he might have still been suffering from the effects of the tranq, but immediately after the enraged pack overwhelmed the unprepared Marines, they turned on their inactive brother. Brien was mesmerized by this murderous rampage. He was lucky to make it to the evac craft in one piece.\\n\\n For months their ferocity haunted him. He started gathering all the footage and reports on the race that came in. Brutes showed a diversity not only in appearance but in the way they carried\\n\\n themselves, as if the weight of the world was on some of their shoulders and others were free to stand tall and dominant. He intuited they must be a weathered species, hardened by many years of struggle, most likely battling among themselves. He tried numerous times to get approval to travel back into Covenant space in search of their home world. Every attempt was denied. But when\\n\\n Brutes started playing a larger role in the attacks on human planets and were suspected of having some animosity toward other Covenant species, his requests started working themselves further into ONI command. When word came down that they had seized the planet Beta Gabriel, he finally got his approval. They were nesting right in his backyard.\\n\\n His mission was to gather as much as he could on the inner workings of this race of the Covenant, find out just how many survivors remained on Beta Gabriel, and look into finding anything among this species that could be used to cause deeper fissures within the Covenant juggernaut. It was a simple operation. Enter point A, watch from point B, exit a few days later from the exact drop at point A. Quiet, discreet, quick. He‘d never thought it would be this bad.\\n\\n CERETUS HATEDbeing around these despicable creatures. If it were up to him he would have\\n\\n them all in his belly. He truly enjoyed the taste of their flesh, but Parabum‘s new ―honor\" code put an end to it. Their Chieftain decided that the simple slaying and eating of the humans had to stop; there were too few of them left and it was far better to keep them around than to quickly eliminate them. Many of the others agreed, and Ceretus had to admit it was extremely enjoyable to watch them suffer. But he just couldn‘t stand living among them, especially after the shame he‘d been suffering since their defeat.\\n\\n When they‘d first arrived on this forest planet, it had been a glorious day. The humans all clumped themselves together in one area, as if that made them safer. Only a few of them were even armed.\\n\\n Ceretus and his brother, Maladus, didn‘t even need their spikers; they had more fun killing by hand.\\n\\n The hunts lasted for days, the bounties delicious, their bellies never fuller. Ceretus knew that the gods would have been pleased with this conquest. It was a bittersweet revenge in the face of such a painful loss. But as the days passed and the human population dwindled, there was still no sign that the Chieftain was ready to leave.\\n\\n Ceretus quickly began regretting following this cowardly Chieftain when he retreated from the massive attack. Now, as he stared at the newly found human they‘d shaken from the tree, he would have much preferred to die in battle. This was not the life for a true follower of the Great Journey.\\n\\n He looked back toward his brothers-in-arms. All were barely capable of understanding the path the Forerunners left for them to follow. He took his eyes from the pathetic human captives to the ship that brought them here, the Valorous Salvation . Chieftain Parabum kept the ship constantly protected with four of his bodyguards. He refused to power the ship‘s communications; he didn‘t want anyone to find them. It was more and more obvious that their Chieftain feared any backlash from the defeat, and he was right to be fearful. His cowardice was punishable by death.\\n\\n His brother, Maladus, had been leery when their pack had been folded into Parabum‘s. They were from two of the most divergent clans dating back as far as Jiralhanae history goes—ancient enemies.\\n\\n The two clans fought even before the great civil war that knocked the Jiralhanae from a space-faring species back to being bound to their planets, forced to rediscover the great advances their ancestors had made before them. They were able to coexist again rather peacefully once the Covenant brought the unifying words of the Great Journey, but their deep-seated distrust for one another slowly rose again . . . and knowing the history of that clan, they had strikingly different levels of devotion to the Covenant.\\n\\n Parabum‘s clan never fully believed in the power of the gods, nor did they worship the technology left behind. They feared, in fact, becoming too dependent on technology. Ceretus‘s clan was always the more intelligent, and their beliefs fell more in line with the San ‘Shyuum, believing with devout faith in the Great Journey and the gods that took it before them. Ceretus‘s clan was terribly ashamed of the civil war that forced the Jiralhanae to give up hundreds of years of progress, and they were at the forefront of rebuilding their scientific prowess when the San ‘Shyuum arrived. They were beyond grateful for the opportunity to take to the stars once again.\\n\\n Parabum‘s clan reviled it. It was their kind of thinking that robbed the Jiralhanae of their rightful place among the Covenant species; they used the artifacts in disrespectful ways, more opportunistic than holy. They believed only in muscle and tradition, in the strength of living without an overwhelming reliance on technology. It made them fierce warriors, Ceretus had to admit, reliant on their strength and loyalty to one another. But Ceretus and Maladus both knew from the start that Parabum was strong in body but weak in mind. He never kept any of his underlings in line, leaving them on their own, lazy and undisciplined. This was not the way to rule a pack. Ceretus knew you ruled through fear and manipulation, and faith in the gods. He could never respect Parabum‘s leadership.\\n\\n It was only a matter of time before someone challenged Parabum for the Chieftainship, and\\n\\n Maladus had burst out surprisingly one day shortly after they had landed. It was a risky move, as they hadn‘t established much of an alliance in their movement against Parabum, but Maladus called out a challenge anyway. And once you called out a challenge there was no turning back. Maladus had always been a cunning warrior, but the truth was that Parabum was twice as strong. Parabum overpowered Maladus from the start, pummeling him blow after blow. Maladus did little damage to the Chieftain. He barely landed a worthwhile strike. The battle lasted only a few minutes before Parabum had completely subdued Maladus. Ceretus watched, his whole body tense with anger as Parabum stomped on his brother‘s neck, crushing it at the shoulder blade. And to rub it in, he viciously bit into Maladus‘s broken neck and ripped his throat out with his teeth.\\n\\n It was pure disrespect. Now Ceretus couldn‘t stand looking at Parabum, let alone follow another order from him. And he knew Parabum knew it. Ceretus wished he were strong enough to challenge the Chieftain, but Maladus had been even stronger than him; he stood little chance.\\n\\n He turned back to the human prisoners and licked his fangs. He went from face to face, trying to strike intense fear in each of the captives. There was little else to do with his time.\\n\\n ―Has our Chieftain returned from the hunt?\" Ceretus called out in the face of the newly captured bushy-eyebrowed human, who had quietly coiled into himself.\\n\\n ―Not yet,\" answered Facius, his tan fur prickling up a bit as he, too, ogled the captives. He was a particularly impressionable warrior who had become Ceretus‘s right hand after Maladus‘s demise.\\n\\n ―Perhaps enough time to fire up one of these, a little snack before the feast, served with a proper blessing.\"\\n\\n ―But the Chieftain, he will certainly smell the cooking flesh.\" This response came from Hammadus, Facius‘s brother, a young, rich-coated brown warrior that showed signs of naivete but was perhaps the strongest of the pack. Ceretus could smell the young one‘s fear in daring to disobey the Chieftain. It was Hammadus that got the newly found human out of the tree, and whined demands that they bring him back to the camp, to show their Chieftain, rather than eat him on the spot.\\n\\n Ever since Parabum called for the eating of human flesh only after a traditional and grossly over elaborate hunt, Ceretus couldn‘t bear the idea of following suit. Plus, the time it took to bring the carcass in from the forest caused the meat to spoil. Any worthy Jiralhanae knew all too well that the fresher the kill, the finer the taste. A savage like their Chieftain wouldn‘t bother to savor the feast properly in the name of the gods.\\n\\n ―What do you suggest, young brother?\"\\n\\n ―Well the Chieftain doesn‘t know we didn‘t kill one in the hunt, does he?\" Facius asked with an ever-so-slight grin. ―We can at least have some fun until he returns.\"\\n\\n ―Yes we can, Facius.\" And he turned back to the prisoners. This young one showed promise.\\n\\n BRIEN COULDN‘Thelp but stare out at the human remains lining the forest pathways, hanging from trees, beaten to pulpy pieces surrounding the camp. It was disgusting. One thing was obvious: These beasts had no respect for humans at all. The same keen sense of smell the Brutes followed to his hiding place didn‘t seem bothered by the awful stench of human carnage. He figured it might actually seem sweet to these monsters.\\n\\n Though he‘d only been awake in captivity for a few hours, Brien was starting to make sense of a few of their growls and grunts, at least emotionally. It didn‘t take long for Brien to pick up on a brewing impatience from the circling Brutes.\\n\\n ―What do you think they‘re doing?\" Brien whispered to the man next him, as the Brutes all began walking down the line of prisoners.\\n\\n ―You don‘t want to know . . .\"\\n\\n Brien watched carefully, looking away at any sign of a Brute turning back toward him. Most of the captives slept or showed such shock and fear that he found it impossible to communicate with many of them, but this man he immediately recognized. Dasc Gevadim was a renowned guru of a religion known as Triad. Those who followed the Triad teachings believed that we all harbored three internal lives, and spiritual transcendence only occurred if you managed to link all three. His followers ran galaxy wide. He used to run seminars via public comm channels, but he‘d disappeared about ten years ago. It was much publicized. Many called it a transcendence, and his following grew exponentially with such reports. The sales of his vidcasts went through the roof.\\n\\n ―They‘re deciding which one of us to eat, huh?\" Brien asked, knowing the answer. \\n\\n","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-4.html","bookId":1641,"book":{"id":1641,"title":"Halo: Evolutions, Volume I (Halo #0)","description":"Storyline: Halo: Evolutions, Volume I (Halo) \\n by Tobias S. Buckell , Jonathan Goff, Nicolas Bouvier (Illustrator), Robert McLees, Karen Traviss , Kevin Grace, Eric Raab, Frank O\u0027Connor , Fred Van Lente , Tessa Kum, Gabriel Garza (Illustrator), Eric S. Nylund , Jeff VanderMeer , B.K. Evenson, Robt McLees … \\n When humanity expanded beyond the safety of Earth to new stars and horizons, they never dreamed what dangers they would encounter there. When the alien juggernaut known as the Covenant declared holy war upon the fragile human empire, millions of lives were lost—but, millions of heroes rose to the challenge. In such a far-reaching conflict, not many of the stories of these heroes, both human and alien, have a chance to become legend. This collection holds eleven stories that dive into the depths of the vast Halo universe, not only from the perspective of those who fought and died to save humanity, but also those who vowed to wipe humanity out of existence.\\n","cover":"https://allnovel.net/images/halo-evolutions-volume-i-halo-0.jpg","author":"Tobias S. Buckell","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-evolutions-volume-i-halo-0.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:30:58 PM"}}
