{"id":98104,"no":5,"title":"Page 5","content":"―Not exactly. Big Boy seemed to put a stop to it. Now they only eat after they let one of us go and hunt us down,\" Dasc whispered back. His scraggly white beard was caked with dust and blood. His eyes glassy and red. Brien wondered if they had been feeding the captives raw human flesh. He didn‘t want to know.\n ―Which one is Big Boy? That one?\" He pointed discreetly to the one who had knocked him out of the tree.\n ―No. Big Boy isn‘t around. Maybe still hunting,\" the man next to Dasc answered—a sickly yet stocky man Brien recognized as a famous big-game hunter, named Hague or something.\n It made sense. He‘d seen a few packs scrambling around this morning, and now there was silent hostility among the beasts as if they were on the verge of doing something wrong.\n This especially rang true for the slightly graying, black-furred one, the one with a clean-shaven face, who had been surveying the captives and had treated Brien to a foul saliva offering. He seemed to have good control of the lot. Brien immediately called him Six.\n Just then, Six caught wind of the whispering and turned back toward them. All three men adjusted themselves awkwardly. As he made his way closer, Dasc was quickly overrun with some of the\n deepest fear Brien had ever seen. Fear was never in Brien‘s blood. He was usually ready for any end that might meet him, but as this man-eating giant beast lumbered over toward him, his body\n trembled in fright.\n Six stopped right in front of the cringing Dasc. His nostrils flared as he looked closer, grabbing at Dasc‘s arms and poking at his scrawny build. He then made a grunt that was obviously a\n summoning or a name. Two other Brutes made their way over; one tan that Brien dubbed Butch, and the huge, rich brown one he‘d thought was Big Boy. He quickly referred to him as Ludo, though he couldn‘t figure out why. He wondered if any among them were female. It was impossible to tell. In all of his research, he‘d never positively identified one.\n Six grabbed Dasc in one big rip with his right hand, but when Hague leaped back startled, his eyes must‘ve met Six‘s. The Brute immediately dropped Dasc, pulled Hague out and tossed him toward the other Brutes. Dasc‘s body lay limp and unconscious beside Brien, and judging from the smell he‘d lost control of his bowels.\n Brien and the other captives watched fearfully as Six let out a roar and a hand motion—a wider summons—and a crowd started to gather around. Hague wobbled himself upright, trying to be as brave and defiant as one could when surrounded by nine-foot-tall hairy beasts, all able to crush you in a blink and drooling in anticipation of a fresh meal.\n Just as Brien finished counting the fifteen Brutes surrounding Hague, one of them ripped the famed hunter up by the leg and held him upside down. The others gave roars of laughter. The old saying always held true; laughter was the same everywhere, even in the Covenant. Hague struggled to rise, trying desperately to wiggle himself free, when another grabbed at his other leg. The crowd goaded them on and another Brute grabbed an arm, and that‘s when Brien couldn‘t look anymore. He\n watched as Six suddenly seemed to lose interest as well, wandering back beyond the crowd, to the edge of the forest. He couldn‘t quite place why the beast would incite such a spectacle and walk away, unless it was to impress.\n Hague‘s screams sent shivers through Brien‘s bones and he shut his eyes. Then the screams\n stopped with a chorus of crunches and yells from the Brutes. His mind‘s eye painted it black. The hollering Brutes slowly gave way to silence and Brien opened his eyes again. The crowd had\n dispersed, and standing amidst the torn and bloodied remains of Hague was undoubtedly the one Dasc had referred to as Big Boy. Clad in a few strokes of armor and with his gray-brown hair unkempt around his snout, the hammer-wielding leader definitely was one of the biggest Brutes Brien had ever seen. He stood there silently. Brien looked around for Six; he was nowhere to be found.\n CERETUS WATCHEDfrom the darkness as Chieftain Parabum stood silent with his hammer over\n his shoulder. Behind him were his security chief, Jupentus, and his right hand, Brunus. Two of the dumbest Jiralhanae Ceretus had ever encountered. They each had dragged in a human corpse behind them. Parabum took in his pack with disappointment.\n ―Looks like a bit of fun was had here,\" he said, signaling the human remains with his hammer.\n ―Without me.\" Parabum lifted the torso, a string of muscle still connected the head. Ceretus‘s stomach growled. ―A plump one, too. Who led this game?\" He looked around to see, but everyone was bowing their heads in respect.\n Ceretus knew no one would confess; it was too risky. Parabum never kept a cool head for anything.\n He chose awkward battles to fight, found disrespect where none was intended. He was one of the worst Chieftains Ceretus had the displeasure of serving. He watched hungrily as the head of the human sway off the juicy torso. He had been looking forward to feasting on this one, but now it would certainly spoil. Brother Golubus had come really close to making the fatter ones taste like Thorn Beast, and he missed that delicacy as much as he missed the brothels back on Teash. The humans ruined any chance of returning to such pleasures. Parabum ruined it, really. But here he was listening to a Chieftain who couldn‘t even properly sermon the pack. There was a lot of hate in Ceretus‘s heart, mostly for the humans who put him here—but he was happy to focus all his hatred on this ancient clan enemy and the bastard who disgraced his brother. He couldn‘t hold the hatred in much longer. He‘d rather die than rot in the shadows of this coward.\n ―It was me, my Chieftain, who called for the preparation.\" Ceretus emerged boldly from the\n darkness. ―Our brothers were getting restless in their hunger, and I feared you‘d be late in returning.\" He quickly hid his bravery, taking on a much humbler tone as a shred of fear took over.\n ―Ceretus, do you not have faith that your Chieftain is the greatest of hunters, a fierce and keen tracker, especially of these simple creatures?\" Parabum was obviously trying to test him. The Chieftain walked toward him with no fear.\n ―I have no such doubt, Chieftain,\" Ceretus said as he approached, bowing before him at an arm‘s length. ―This was a kill from our hunt, and we figured we‘d go ahead and get it prepared while it was still fresh.\" He bowed before him, keeping his eyes on the ground in front of him. The charade pained him.\n Parabum grabbed his throat; his nails, digging through Ceretus‘s fur, piercing his skin. ―Not one of these pathetic creatures is to be touched without your Chieftain to sanction it. Not one.\" Ceretus struggled to keep his eyes averted, his shame apparent in his lack of challenge. And like a switch going off, the Chieftain released his grip, his attention diverted to the human pen.\n ―What is this!\" Parabum slowly waked toward the pen, Ceretus gasping for air. ―A new human\n emerged?!\"\n Ceretus looked over toward Hammadus, who was watching in excitement.\n Hammadus shouted proudly, ―We found him up in a tree, my Chieftain. I climbed up and the\n coward fell to the ground in fear before I could even reach him. A blessing from the gods, Chieftain.\n Perhaps there are more out there. We brought him back here . . . he will make a great hunt, I‘m sure.\n Being able to climb so well and all.\"\n Parabum looked annoyed. Ceretus watched as the Chieftain wandered over to where the hulking young warrior stood, his head returning to a humble and fearful bow.\n ―A find indeed,\" Parabum added, assessing the now frightened Hammadus, who stood almost a\n foot taller and wider than his Chieftain. Parabum brought his hammer from his shoulder to the ground. Ceretus knew that once Parabum caught a whiff of fear he would dig in deep, just as he had just done to him.\n Ceretus watched as Parabum tried to intimidate Hammadus. He knew the young warrior was\n getting stronger, and this was his another attempt to scare him into servitude. Perhaps the smartest move Parabum had yet to pull off. Ceretus would have to be smarter.\n Once Parabum felt Hammadus was sufficiently cowed, his tone took a celebratory note and he\n addressed the rest of the pack. ―Tonight we feast on three of the pathetic creatures. May we consume their flesh as an offering from the gods. Enjoy, my brothers; once again we dine like kings.\"\n Parabum looked out to the others as they cheered obligingly. Ceretus, clutching his pierced throat, gave the vainglorious Parabum‘s back a secret, hateful stare as he walked away; he loathed his Chieftain‘s awful benedictions more than anything. They were empty words and not at all inspiring or meaningful. A facade of faith. There was no way he was going to endure another pathetic attempt at prayer like that. The gods were truly laughing at them. He could eat his shame. But he hoped Hammadus could not.\n BRIEN WATCHEDas the Brutes gathered for their meal. But the sight of watching human flesh\n being served, let alone enjoyed, was too much for him to handle. There was no surviving this. Even if he had enough time to establish some kind of communication with the Brutes, it would be in vain.\n He had to escape. By his count he had less than forty-eight hours until the exfiltration craft would arrive. He felt a hand on his hunched back.\n ―You never get used to it,\" Dasc said quietly. ―You just hope someone will get here soon before they pull your card . . . Thought you were the first of a cavalry, but I guess not.\"\n ―I‘m Dr. Connor Brien. I came down here to gather some intel on them,\" indicating the Brute dinner party with his head, ―but this . . . this is . . .\" Brien couldn‘t even complete the thought.\n The two shook hands. ―I‘m . . . Francis.\"\n ―So this is transcendence?\" Brien used his eyes and bushy brows to compliment his sarcasm,\n making sure his tone called out the man‘s lie. The smell of the man, of the whole human pen, was not easy getting used to. He jerked his head back slightly to keep a good distance.\n ―Hmmm, my being betrays my guise. It was, for quite some time . . . So you came in here alone?\"\n ―I was supposed to be here for just a short time, assess the situation. Communications with the port AI were destroyed almost immediately upon the siege. No one knew if there were any survivors.\"\n He turned to watch what appeared to be a ceremonial prayer before the meal, Big Boy sitting majestically above the pack.\n A woman prisoner crept over. Long, straight, gray hair flowed down her shoulders, her body so thin her raggedy clothes swam on her. She would‘ve been pretty under better circumstances. She looked hours away from dying.\n ―Are you here to save us?\" The look in her eyes was enough to break Brien‘s heart. She was\n holding on to any hope she could find.\n Brien couldn‘t answer. ―Has anyone tried to escape?\"\n ―Almost every day . . . someone makes a run for it.\" This came from another prisoner, a\n brown-skinned man with the remains of an athletic build. ―But look at those monsters; they cover more ground in one step than we do in three.\"\n Brien suddenly became extremely self-conscious of his girth. He was the only one of the remaining prisoners who had any meat on his bones. He knew his time was short. ―Do they eat anything else, besides . . . well, us?\"\n ―They did eat the little frog-looking aliens they brought with them, and they have brought back game from the forest, but . . .\" Dasc gestured a thumb over to the feast. ―They seem to like us the best.\"\n Brien watched in silence as the Brutes gnawed meat off human bone. He‘d studied cannibals\n before, but he always knew they had some sort of doctrine behind their reasons for eating flesh. Not that it made it any better, but he understood it. These animals killed for the sake of killing. Even killing and eating those who shared their faith and alliance. Brien wondered if this was\n representative of the whole Brute mind-set or just this single pack. Regardless, these beasts were natural human predators, even beyond the war.\n He moved his eyes from Brute to Brute beforing returning his gaze to Big Boy. The beast gestured and growled wildly from his makeshift throne. Unlike the battle footage he‘d watched and the Brutes he‘d encountered personally on High Charity, Big Boy didn‘t wear the highly decorative armor of most Chieftains. He was barely outfitted in armor at all: a few protective shards in key places, but nothing like he‘d seen on the other leaders. Big Boy now sat listening to one of his captains as he growled out a tale, riotously laughing time and again, but at the same time\n suspiciously eyeing another crowd that had formed near a campfire. Brien followed his worrisome gaze.\n Six was hovering over a fire, holding court for eight of the other Brutes. They too tore at the human flesh, but remained transfixed on whatever story Six was telling. His shaven face stuck out in opposition to Big Boy‘s gruff visage, as if Six took pride in grooming himself on a daily basis.\n Surely a sign of aesthetic difference, and judging from their encounter earlier and the way they eyed one another, definitely a sign of conflict. He guessed Six was either from a smaller clan vying for power or simply found himself outnumbered among this more barbaric group, but he seemed to be gaining the attention of more and more of them, especially Butch and Ludo. He sensed hostility before; now he smelled the beginning of an inevitable clash.\n ―Stomping on the heels of a fuss . . .\" Brien said to himself, but loud enough to confuse the others who heard him.\n They all looked oddly at him. He caught their eyes.\n ―It‘s from an old song my mother used to sing to me. ‗Hold no court, know no rust, just stomp, stomp, stomp, on the heels of a fuss.‘ \"\n ―What‘s it mean?\" Dasc asked.\n ―It means I think we might have chance to get out of here.\"\n THE NEXTmorning Ceretus woke with nothing but challenging Parabum on his mind. The one\n thing that this awful predicament provided him was the discontent of some of his fellow Brutes.\n While Parabum and his cronies felt like they had finally achieved a kingdom on this planet, a few of the others truly longed for home and were getting impatient with Parabum‘s excuses for not\n departing. He knew this retreat would be met with severe punishment from the Covenant, most likely sentences of death when presented to the tribunal. As soon as they powered up the Valorous Salvation, they would be discovered, hunted, and destroyed. He needed witnesses and allies to expose Parabum‘s and his captains‘ treachery and blasphemy.\n The young naive Hammadus was the only one here strong enough to defeat Parabum in a\n challenge, but it would take a lot to push him to attack, even in the wake of the Chieftain‘s shameful treatment of him. He followed the chain of command to a fault, betraying himself with his own fear constantly. But Ceretus thought of one powerful tool to fire him up: Hammadus‘s brother and best friend, Facius. He was older, more assured, and could control his emotions a bit better. The two were inseparable, and though he did not like the idea of using a devout Jiralhanae like Facius as a means to an end, it was the only hope he had.\n He walked over to the two who were once again eyeing the remaining captives.\n ―Not many of them left, my brothers, none with meat to savor, except for the new one.\" Ceretus said.\n ―Chieftain was out of line last night. Hammadus was merely excited to entertain him with a great hunt.\" Facius stated the obvious.\n ―He will use any attempt he can to dig into our fear. We need to leave this place, return home. The Chieftain is disgracing us in the eyes of the gods with his cowardice.\" Ceretus appealed to their honor as best as he could.\n ―But he is Chieftain, what can we do?\" Hammadus pleaded, excreting fear again.\n ―He‘s no real Chieftain. He‘s a barbarian who would surely choose to stay here forever rather than suffer the shame the San ‘Shyuum will inflict on him. Shame he deserves, and we‘ll deserve it, too, if we don‘t stop him. He‘s a faithless savage, just like his bloodline has proven to be in the past.\"\n ―What do you suggest, Captain?\" By his tone, Facius suspected he was leading him into something.\n ―My clan has been at odds with Parabum‘s long before the great civil war. I‘m surprised I survived last night. And any subordination from me will surely be met with a deathblow. I think you, Facius, should make a request on behalf of the pack. Your two clans have much more in common with one another. He may listen to a cousin like yourself if the argument is presented properly. I have been thinking all night on the matter, and perhaps this could work . . . Suggest to him that we reboard the Valorous Salvation and stow him away, as if he were killed in combat. Perhaps suggest yourself to act as Chieftain. We throw ourselves on the mercy of the Prophets, blame faulty coordinates, mutiny, anything that we decide is feasible . . . and if they don‘t hunt us down and blast us out of the sky, we set coordinates for Warial; it is the farthest-flung of our colonies. There we attempt to assimilate, asking the gods for forgiveness and serving them entirely. It‘s our only hope, other than dying slowly here with the gods‘ backs to us.\"\n Ceretus watched the eyes of Facius and Hammadus as they assessed the idea, exchanged glances.\n Ceretus knew that neither of them was very smart, but they were among the most devout in this pack\n . . . and the idea of being left behind on the Great Journey brought about true fear in them. He could smell it. ―At least the gods will know you tried,\" he added.\n Ceretus watched as those words sunk deep into their minds.\n ―Do you think it will work, that he‘ll listen to me?\" Facius asked rather dubiously.\n Hammadus grabbed his brother by the shoulders. ―If he doesn‘t, I‘ll be there to protect you, brother.\"\n Ceretus nodded gravely, concealing a pleased smirk.\n BRIEN‘S PLANwas a long shot, but it was their only hope. Haunted by the memory of the\n rampaging Brutes he‘d barely escaped, and what he knew from studies and his experiences so far here, these aliens were pack creatures and followed alpha males. Eliminate the alpha males and you‘d have a bunch of thugs. Pit those thugs against one another somehow and you‘d get a chaotic brawl. Then they could make a run for it. The exfil point was about five miles up through the thick forest, over the hill. If his guess on time was correct, they had about eight hours before the Calypso hit the rendezvous point, which meant they needed to act at the first opportunity and hope for a miracle.\n He had waited until the Brutes were mostly asleep before feeding the others the plan. Judging by the health and shape of his fellow captives, he knew if any of them made it with him off this planet it would be a miracle.\n But his plan was based on one necessity. He needed a confrontation between Big Boy and Six. As best as he could gather, these two were the alpha males of this pack: Big Boy by force, Six by brains. If he could tranq the two of them just after they started fighting, the others would be lost and hopefully argue and battle amongst themselves, creating enough of a distraction for them to make a run for it. He had about two miles until he made it back to his camp, where he had the M6 in case the Brutes did come following. Then he‘d have at least a few hours before the exfil craft came for him. It was the best he could come up with.\n The entire hostage camp was on alert for Six and Big Boy. The morning was relatively slow, and Brien was completely transfixed by an impromptu meeting between Six, Ludo, and Butch. If Brien had to guess judging by the events of last night, they seemed to be conspiring. This could be their chance.\n ―Dasc, I think we got something cooking . . . look.\" He moved only his eyes toward the hovering trio of Brutes.\n The three conspirators seemed reserved as they walked quietly toward where Big Boy and his\n entourage were gathered. The whole Brute camp diverted their attention from what they were doing to bear witness.\n Dasc waved the others over, and they hovered around Brien.\n ―Okay, this is it. Look for my okay and then, you two\"—indicating the woman, Nixaliz, and\n another withering prisoner with a turtle face, named Vern—―run to the front of the pen and start screaming your asses off. Once they look toward them, the rest of you clear me a path and I‘ll send two tranq darts at Six and Big Boy as fast as I can, then we run like hell. Up toward the tree line at the hill. No turning back, like the dickens.\"\n ―Like the what?\" asked a stick of a prisoner whose thin face barely escaped his puff of hair and beard.\n Brien caught his eye. ―Like you‘ve never run before.\"\n CERETUS WATCHEDin amazement as Parabum actually entertained the words of Facius. He\n actually looked like he was considering it. Maybe he wasn‘t as stupid as he seemed. Then he saw his tone quickly change.\n ―Cousin, we live like kings here, and judging by the fleet back on that human planet, there will be no Covenant to return to. We need not cower at the thought of their displeasure. We wait until I say we can return. You disgrace yourself with this plan, brother.\"\n ―So staying here is the will of the gods?\" Hammadus asked, confused from behind his brother.\n Ceretus caught a whiff of his fear.\n ―Will of the gods, boy? There is no will of the gods. If there is anything I‘ve learned from all this is that no gods answer our prayers, they do not care what we do. They abandoned us long ago.\"\n ―Blasphemy!\" Ceretus erupted; he couldn‘t hold back. ―All you spout is selfish\n blasphemy, Chieftain. \" He spat the word at him, making sure his disdain shined through.\n Parabum‘s captains tensed up at the outburst, and Ceretus could sense the fear rise in both Hammadus and Facius. Parabum raised and swung his hammer just as a wild scream distracted them all.\n IT ALLhappened in the blink of few seconds. After Six raised his voice, Nixaliz and Vern shouted like mad, and the captives cleared the view and Brien popped off two shots. One hit Big Boy right in the chest, just as his hammer struck the face of Six. The second shot meant for Six wedged itself into the shoulder of Butch. All three monstrosities hit the ground within seconds of one another, and just as he expected, chaos erupted. Ludo tensed up as one of Big Boy‘s captains leapt for the hammer, and then attacked him with all he had. Brien didn‘t waste much more time watching the melee; he ran like mad for the hills, firing tranq darts at any Brute within fifty yards of him, the other captives at his heels. Or so he thought. When he turned around only Dasc was behind him.\n ―What happened to the others?\" He turned, panting, eyeing the commotion behind him. He saw\n Nixaliz, Brute spiker in her hand, firing shots into the face of Big Boy. Her revenge didn‘t last long, as another Brute simply smacked her head clear of her shoulders. Some of the others were trying to make their way up the hill slowly, but the Brutes were quick to follow, snatching them up, ripping them to shreds, some tearing into their flesh with their teeth.\n ―Come on. We gotta move, Dasc.\" And they took off in the direction of Brien‘s camp, turning every so often to make sure that they weren‘t leaving anyone behind or that some Brute wasn‘t on their tail. Their adrenaline died very close to the camp, and the two men collapsed as soon as it was in eyesight.\n ―I think we‘re safe for now . . . shit, I need a break.\" Brien panted, throat dry and hoarse. He looked up at the sun. ―Exfil should arrive in a few hours or so. We still got another two and a half miles to the rendezvous point. We got time.\"\n ―I can‘t believe we did it.\" Dasc barely was able to get the words out; his mouth looked dry and brittle beneath his matted beard.\n ―There are some hydro packs near the tent up there. Help yourself, bring me one, too . . . .\" He looked up into the sky, smiling, knowing that he survived another one. What he witnessed here was of severe interest to command, but there was no way they could fold these Brutes into their fight.\n They seemed beyond control. How the Covenant kept them at bay and of service to them was something he wanted to know more than anything. He heard Dasc coming up from behind him.\n ―Here you go, Doc.\" Dasc handed him the hydro pack. ―Never tasted sweeter.\" Brien could hear Dasc‘s slurping. He laughed to himself. Dasc Gevadim. He couldn‘t wait to tell his peers about this.\n ―So how far to the rescue?\"\n ―About two and a half miles, we should get moving in—\"\n A bullet from Brien‘s M6 seared right through Brien‘s head.\n DASC KNEWhe would never meet that rescue craft. He devoted his entire life to Triad; to return to the public eye would prove him a phony, and the hearts and minds of millions would be broken, shattered. What was one man‘s life for the comfort and faith of countless others? He thought he heard the Calypso arrive, and imagined the recon team as they surveyed the area, the camp, laying all Brute survivors to waste. And it was days before he decided to head down there again.\n He strolled through the human and Brute carnage, taking the opportunity to kick a few Brute corpses as some sort of revenge. With each kick he cried, harder and harder until he crawled up tucking his knees into his chest, and wept himself to sleep. He awoke hours later, the smell of all the death around him striking him anew. He turned over to his back to stare up at the night sky. He‘d never felt so alone, even knowing that all his followers were still out there.\n ―Transcendence.\"\n The word may or may not have come out of his mouth; it didn‘t matter. \n","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-5.html","bookId":1641,"book":{"id":1641,"title":"Halo: Evolutions, Volume I (Halo #0)","description":"Storyline: \n Halo: Evolutions, Volume I (Halo) \n by Tobias S. Buckell , Jonathan Goff, Nicolas Bouvier (Illustrator), Robert McLees, Karen Traviss , Kevin Grace, Eric Raab, Frank O\u0027Connor , Fred Van Lente , Tessa Kum, Gabriel Garza (Illustrator), Eric S. Nylund , Jeff VanderMeer , B.K. Evenson, Robt McLees … \n When humanity expanded beyond the safety of Earth to new stars and horizons, they never dreamed what dangers they would encounter there. When the alien juggernaut known as the Covenant declared holy war upon the fragile human empire, millions of lives were lost—but, millions of heroes rose to the challenge. In such a far-reaching conflict, not many of the stories of these heroes, both human and alien, have a chance to become legend. This collection holds eleven stories that dive into the depths of the vast Halo universe, not only from the perspective of those who fought and died to save humanity, but also those who vowed to wipe humanity out of existence.\n \n","cover":"https://allnovel.net/images/halo-evolutions-volume-i-halo-0.jpg","author":"Tobias S. Buckell","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-evolutions-volume-i-halo-0.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:30:58 PM"}}
