{"id":29858,"no":3,"title":"CHAPTER III.—THE CIRCUS, AND WHAT CAME OF IT.","content":"LOWLY out of the great ocean rose the sun the next morning, shooting his long rays over level Long Island, spanning the East River and touching with rosy light the hill on which Captain Boniface had built his comfortable home. What a wonderful tale, provided his memory is good and his eyesight strong, this same old sun could tell, particularly if he had the moon to help him, for, whether shining brightly, or peering through mists of heavy clouds, between them they have seen most of this world’s doings. One thing is certain, however change, change, change would be the theme of all their story. Old ocean alone remains always the same; for even the “everlasting hills” may be pierced by boring tunnels and disfigured by the shafts and engines of unsightly mines. And this that is true of the whole world is true of every inhabited corner of it, and doubly true of that particular corner where we find New York mapped out to-day. Row upon row of dwellings—mansion and hut crowding close upon one another; mile after mile of stores, warehouses, and every conceivable sort of structure, and yet only a hundred years, and lo! there was none of it. Do you chance to know where St. Paul’s Church stands on Broadway, on the block bounded by Fulton and Vesey streets? Then let me tell you that no longer ago than 1784 St. Paul’s was on the very outskirts of the city. Just above it were two fine dwellings, which now form part of the Astor House, and a little farther on a highway leading to the right bore the weather-beaten sign, “The Road to Boston,” and another turning to the left, “The Road to Albany,” and Hazel’s home was a mile or more out on this Albany road. Beyond were only open fields, with here and there a farm-dwelling or country homestead, and an occasional “mead-house” or “tea-garden,” for the refreshment of jaded travellers, or pleasure-seeking parties from the town. Nearly on the site of the present City Hall stood the almshouse, and in close proximity the jail, while sandwiched in between them were the gallows, not exactly affording what might be called a cheery outlook to the poor unfortunates obliged to seek such food and shelter as the almshouse offered. These gallows were enclosed in a building shaped like a Chinese summer-house, and painted in all the colors of the rainbow, as though trying thereby to overcome any mournful associations which the place might otherwise possess. A platform within this remarkable building supported various contrivances for conveniently “dropping malefactors into eternity.” while a row of hooks and halters adorned the ceiling, so that at least half a dozen offenders might be dispatched by the same method at one and the same moment. Wall Street, in 1783, was a street of residences. Here was the bachelor homestead of Daniel McCormick, upon whose stoop, on a mild and pleasant afternoon, you were likely to find a goodly little company of cronies and toadies, each and all of whom made it a point never to refuse an invitation to remain to dinner and enjoy his excellent pot-luck. The court end of the town lay in the region extending from Pearl Street around to the Battery, and up to Trinity Church, while the shops and offices were confined to Maiden Lane. On Great Dock Street, now a part of Pearl Street, lived the widow of John Lawrence, who, during his lifetime, was widely known as “Handsome Johnnie.” There, as Dr. Duer puts it, in his “Reminiscences of an Old Yorker,” the genial widow kept open house for her relatives, or rather her relatives kept open house for themselves, and were entertained in the roll of “transient, constant, or perpetual” visitors. All this and far more could the sun of to-day tell of the sights of the last century; but on the morning of which we are writing, he looked down upon nothing of greater interest to the average boy and girl of all time, than when he flashed suddenly upon the preparations going forward for the circus that had lately arrived from across the water, and because of whose arrival there was a flutter in all the child-hearts throughout the length and breadth of the town. Some were fluttering joyously with actual anticipation, and some with grave doubts as to their gaining even a peep at the wonderful show. As for Hazel Boniface, she was not only up with the sun, but up before it; as for Starlight, he was dressed, and “trying to kill time” a full hour before breakfast, for it had been settled the previous evening that they were to be allowed to attend the performance, and Captain Boniface had slipped the coins necessary for their admission into Starlight’s safe keeping. Josephine, Hazel’s older sister, was also early astir, stowing away the most inviting of luncheons within the snowy folds of a napkin, which in turn was committed to the keeping of a little wicker hamper. Joyous and beaming the children set forth, Josephine accompanying them as far as the gate. “I wish I were going with you,” she said, as she held it open. “I almost wish you were,” Hazel answered. “Almost, but not quite,” laughed Josephine; “for it would spoil the fun a little, now wouldn’t it, Hazel, to have a grown-up sister in the party? But you need not worry, dear, the big sister must stay at home to mind the baby sister; it’s only the little middle-sized sister who can roam abroad, and go to the circus, and do whatever she likes all day long.”. The color came into Hazel’s cheeks. She knew she did do pretty much as she wished from week’s end to week’s end, but that was not her fault. If nobody told her to do “things,” it was hardly to be expected she should do them. “Will you go in my place?” she asked, ruefully, of Josephine, who stood leaning on the gate with a merry, teasing look in her gray eyes. 0034 “No, of course I won’t, dearie, and you come straight back and give me a kiss, and know that no one wishes you quite such a jolly time as your own sister Josephine.” And thus speeded on their way, the children’s figures grew smaller and smaller in the maple-shaded distance of the roadside path, and with a little sigh Josephine turned back to her duties within-doors. There was a foreboding of coming evil in her heart, and in Hazel’s and Starlight’s, too, for that matter. Children though they were, they were still old enough to know, that, now that the war had ended in the defeat of the English, those who had sided with them, as Captain Boniface had done, would have to suffer for it; but for to-day every worry was utterly forgotten. Hazel had no thought for the coming interview with Colonel Hamilton—which, it must be confessed, she rather dreaded—nor Starlight for the soldiers in the old homestead. Right before them lay all the delights of a wonderful English circus, and with the lightest of hearts they set forth upon their happy expedition. Having strolled along in leisurely fashion, the old town clock struck eleven as they pressed in through the clumsy turnstile which barred the circus entrance, and the regular performance was not to commence until one. But two hours were none too much for the inspection of the wonderful sideshows, and wide-eyed they passed from one to the other, instinctively turning quickly away from two or three human monstrosities in a close, unsavory tent, to spend an hour of intense merriment over the antics of a family of monkeys in a cage in the open air. Indeed, they doled out most of their luncheon to the mischievous little youngsters, actually forgetting that there was any likelihood of their ever being hungry themselves and repenting of such liberality. A great deal of fuss over a circus, you may be thinking, my little friend, having yourself been so many times to see “The Greatest Show on Earth” but if you had lived in the days of Hazel and Starlight, and never seen a circus in your life, nor a show of any kind—either great or small—then, perhaps, you would have been not a little excited too. Long before it was at all necessary, and after much consultation and numerous experiments at different angles, the children seated themselves at the precise point which they had concluded, on the whole, offered greatest advantages, and then they impatiently watched the uncomfortable benches become gradually filled, and certain significant preparations going forward on the part of the gayly-liveried lackeys. At last the orchestra of three ill-tuned instruments struck up a preliminary march, the low, red-topped gates of the ring swung open, and the gorgeous company pranced in, dazzling and brilliant indeed, in the eyes of the children. What did it matter if tinsel were tarnished, and satins and velvets travel-stained and bedraggled. They saw it not. It was all glitter and shimmer to them, and, oh, those beautiful, long-tailed horses with their showy trappings! Hazel silently made up her mind on the spot, that she would be a circus-rider herself as soon as she was old enough, if her father would let her. She changed her mind later in the day, however, owing to certain unexpected experiences, and was thankful enough that she had not openly expressed her resolution of a few hours before. Midway in the performance, as the clown had announced, for they did not have printed programmes in those days, there was to be some lofty tumbling by the Strauss brothers, and at the proper moment in they came leaping and jumping. They were all attired in the regulation long hose, short trousers, and sleeveless jackets of the professional tumbler, but it was easy enough for any child to detect at a glance that it was quite impossible that they should belong to the same family. They were of all ages and sizes, but the youngest performer did not appear to be more than twelve; he was a handsome little fellow, with a fine dark complexion, and from the first both Hazel’s and Starlight’s attention centred upon him. He proved himself the most agile of all the brothers, eagerly watching for his turn every time, and apparently enjoying the performance almost as keenly as the audience. But it happened after a while, that when he had just accomplished the feat of turning a double somersault from the top of a spring-board, he did not attempt to rejoin the other leapers and tumblers, but crept from the place where he had landed in the sawdust to the edge of the ring, seated himself, with his little slippered feet straight out before him, and leaned comfortably back against its rail. The spot he had chosen was directly underneath where Hazel and Starlight were sitting, and being in the first row they naturally leaned over to investigate matters. He sat there so comfortably, and his older brothers seemed so indifferent to the fact that he had dropped from their number, that the children came to the conclusion that he was simply taking a little permitted rest. At last Starlight made so bold as to ask, “Say, Straussie, you didn’t hurt yourself any way, did you?” At the sound of Starlight’s voice the little fellow looked up surprised. “Yes, I did,” he replied, “I often slip my knee-cap, or something like that when I take that double ‘sault.” “Does it hurt you now,” asked Hazel, with real solicitude. “Yes, a little. I can’t jump any more to-day. The men know what’s the matter with me. I’ll be all right in a little while.” “Do you like being in a circus?” continued Starlight, for it was even more interesting to converse with a member of the troupe than to watch the performance of the troupe itself. “I like the jumping and tumbling; that’s all the part I like,” ending with a sigh. But it was not easy to carry on a conversation at the distance they were from each other, particularly as the tumblers, as if to add to the excitement, kept up an almost ceaseless hallooing and shouting. Now it happened that the ring, with the exception of the gates of entrance, was formed by a short canvas curtain suspended from a circular iron rail. Observing this, a happy thought occurred to Starlight. “Look here, Straussie,” he said, in a penetrating whisper, “I’d like to talk with you. Couldn’t you creep under the curtain there, and I’ll drop down between the seats.” “Yes, I could,” answered the little tumbler, grasping the situation at once, and suiting the action to the word. “I wish I could drop too,” urged Hazel, longingly. “No, you stay where you are. It wouldn’t do, Hazel; folks might notice,” and Hazel was sensible enough to see the wisdom of the remark. As it was, every one was by far too much absorbed to take account of the fact that a little fellow inside the ring and a little fellow outside of it had disappeared at one and the same moment. And so it happened that all unsuspected a very important conversation was carried on, and a remarkable scheme planned under the crowded benches of that day’s performance. Meanwhile Hazel “sat on pins and needles.” Even “the most educated elephant in the world” failed to rouse much interest in a little maiden who knew an absorbing conversation to be going on almost within earshot and in which she longed to have a hand. “What is your name?” asked Starlight, as soon as he had dropped safely to the dry grass, and had stretched himself beside the little tumbler, who sat with his knees gathered close to him and his hands clasped round them. “Flutters,” answered the boy. “That’s not your real name?” “That’s what they call me.” “You mean the circus people?” Flutters simply nodded “yes.” Somehow he did not seem at first inclined to be quite as communicative as Starlight would have wished. “It must be fun to wear clothes like those,” he said, after a pause, eyeing his new friend from head to foot with evident admiration. “Oh, it’s kind of fun for a while, but there isn’t much real fun. Everything’s only kind of fun, and there isn’t any fun at all about most things.” Starlight couldn’t quite agree with these sage remarks, although he had himself of late been seeing a great deal of the darker side of life. “I guess you’re not very well, Flutters,” he said, seriously; “or perhaps you’re tired.” “Oh, I’m well enough, but I’m not over-happy,” answered the boy, who, from little association with children and much with older people, had formed rather a mature way of speaking. “What makes you feel like that?” asked Starlight. “Oh, lots of things. There’s no one who cares for me ‘cept to make money out of me. That’s kind of hard on a fellow. “Don’t you get some of the money yourself?” “Not a penny. You see, I’m ‘prenticed to the manager till I’m eighteen.” “Who apprenticed you?” said Starlight, taking care to speak correctly. “The manager, I suppose; but I did not know anybody had to ‘prentice you. I thought you just ‘prenticed yourself by promising to work for your board.” “Not a bit of it. You oughtn’t to have made such a promise. If you were worth anything to the manager you were worth part of the money you earned. Besides, I don’t think anybody can apprentice a boy except his parents or his guardian, or some one who has charge of him.” “Well, nobody’s had charge of me this long while.” “Is that big man with the great black moustache the manager?” asked Starlight. “Yes, he is, and he’s a tough one,” and Flutters pressed his lips tightly together and shook his head by way of emphasis. “He doesn’t look kind.” “Folks doesn’t look things what they never are.” “Why don’t you cut the circus, Flutters?” “Would you, really?” “You mean run away?” Starlight nodded yes. “Where to?” was Flutters’s pointed question. “Oh, anywhere,” somewhat vaguely. “That’s all very well; but board, you know, and a blanket to roll yourself in at night is a little better than nothing at all.” “That’s so,” said Starlight, and then sat silent a few moments, drawing his fingers, rake fashion, through the dry grass in front of him, and evidently thinking hard. “Flutters,” he said at last, “if you ran away I believe you’d find a home and somebody to care for you—we’d look out for you ourselves, Aunt Frances and I, till something turned up.” 0039 “Would you, really?” and Flutters leaned very close to Starlight in his eagerness. “Yes, I’m sure we would. Will you do it?” “Yes, sir, I’ll do it now,” and Flutters got straightway on to “all fours,” as if he deemed that the most silent and effective mode of escape, although the benches were hardly so low as to render it necessary for a boy of his size. “But you’ll be caught in a minute in those—fixings.” Starlight did not think there was enough of them to deserve the respectable name of clothes. Flutters sat down in despair. “Then there’s no use; I may as well give it up if I have to go back for anything.” Flutters stood in such fear of the manager that he felt sure he could read his very thoughts. He honestly meant that he would abandon the whole scheme rather than face Mr. Bradshaw with such a design in mind, and he looked down at his spangled slippers and bedraggled tights in most woe-begone fashion. “I have it,” said Starlight, after a moment’s serious cogitation; “wait here a minute,” and taking hold of a board directly under the seat where he had sat, he pulled himself up to his place beside Hazel. She was ready with a host of eager questions, but Starlight, in the most imperative of whispers, gave her quickly to understand that there was no time for anything of that sort. “Just do as I tell you, Hazel,” some one overheard him say, but more than that they fortunately did not hear. A moment later Starlight disappeared, and a little red cloak, which Josephine had made Hazel carry with her, had disappeared too. Not long afterward, but it seemed a very long while to Hazel, the entertainment came to a close with a wild sort of farce, which everybody seemed to think pretty funny, but Hazel did not so much as smile. She had neither seen nor heard what was going on; she had an important little piece of business ahead of her, and could hardly wait to be off and about it. If her seat had not been quite in the middle of the row, so that she would have been obliged to crowd past a long line of people, she simply could not have waited; and now that the performance was actually over, she energetically pushed her way through one group after another, lingering about as if loath to desert the charms of the circus, and was clear of the great tent in almost less time than it takes to tell it. Off she darted down the road—down Broadway one would say today—for the gateway to the circus enclosure was exactly on the spot where Niblo’s Theatre has for so many years set forth its varied amusements. There was only one farm-house in the immediate neighborhood, and thither Hazel flew, bringing up at the threshold of its old Dutch kitchen in a state of breathless excitement. “Mrs. V an Wyck,” she cried with what little breath she had left, as she peered over the half door that barred her entrance. “In a moment, Hazel,” came a voice from the depths. “I am putting some curd in the cheese press; I’ll be up in a minute.” The minute afforded Hazel a much-needed breathing space, and when a rosy-cheeked Dutch Frau emerged from the horizontal doorway of the cool, clean-smelling cellar, Hazel was able to make known her request in quite coherent fashion. “Oh Mrs. Van Wyck, will you let me have a pair ol Hanss trousers,’ and some shoes and a coat, and please, please don’t ask me what I want them for!” for she saw the question shaping itself on Frau Van Wyck’s lips; “I’ll bring them home safe to-morrow, and tell you all about it.” The little woman looked decidedly astonished, but the child was so urgent, and withal such a little favorite of hers, that she could but accede to her request, and in a trice Hazel was off again with the coveted articles, in a snug bundle, swinging from one hand as she ran.","sourceLink":"http://novel.tingroom.com/ertong/1743/51017.html","bookId":650,"book":{"id":650,"title":"A Loyal Little Red-Coat","description":"简介： In the introductory chapter of The History of the People of the United States, Mr. McMaster announces as his subject, The history of the people from the close of the war for Independence down to the opening of the war between the States. It seems at...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1743","creation":"Aug 1, 2019 12:19:06 AM","modification":"Aug 1, 2019 12:19:06 AM"}}
