{"id":29861,"no":6,"title":"CHAPTER VI.—OFF FOR THE PRISON-SHIP.","content":"HAT a queer sort of thing it is, this regularly going to sleep and waking up again once in every twenty-four hours; but people who have had a little experience in not going to sleep regularly, and in waking up at most unheard-of and irregular hours, will tell you that that experience is a deal queerer, and not so pleasant by half Some of the little folk who have need to be coaxed and urged to bed six nights out of the seven, would hardly dare to fret, I imagine, if they only knew that to be a sound sleeper is an accomplishment sorely envied by some of those grown-up people who may sit up as late as they choose. And if one of those wakeful, grown-up people should some day ask you, “What is the secret of your sound sleeping, my little friend?” just tell them that you think it is because you do not worry. Then if they say, “That’s all very well; children have no need to worry, they have fathers and mothers to lean upon tell them that they, too, have a Father, One far more kind and loving than any earthly father, and that they could lie down at night as free from worry as any child if they would;” and who knows but they will learn a blessed lesson from you that will be well worth the learning. \n \n Now this little reverie has all beep suggested by the fact that the Boniface household was waking up, all save old Dinah, the cook, for she had been up for an hour or more. She had once been Hazel’s nurse, and, since the beginning of the war, was the only servant the Bonifaces could afford to keep. How comfortable she made them, that faithful old Dinah, so that all one had to do was to waken and wash, and brush and dress, and then sit down to steaming coffee, delicate rolls, and the most savory little rasher of bacon, which Dinah always added as a “relisher,” as she called it, to the more substantial part of the breakfast. Yes, they were waking, all of them, from anxious Captain Boniface to happy little Flutters, for Dinah’s vigorous ringing of the rising bell had thoroughly done its work. \n \n Each busy brain was taking up again the manifold threads of thought which had slipped from its hold when sleep had stolen across it so gently the night before. Captain Boniface instantly remembered the angry letter, as, of course, did Mrs. Boniface and Josephine, and so their waking was rather heavy hearted. Harry instantly remembered it too, but his second thought was of the pretty sail-boat moored down at the Boniface wharf, and of the plan for the day, and he was glad to open his eyes on blue skies and the sunshine that flooded his eastward room. Flutters woke with a smile. Indeed, he doubted if he should ever do anything but smile again, so sure was he that he had turned a very happy corner in his life. Starlight roomed with Flutters, and his first thought when he opened his eyes was how they were to manage to return those clothes of Hans Van Wyck’s, that Flutters was getting into with such an air of complacent ownership. Hazel’s little mind took its first morning flight in the same direction as Harry Avery’s. The sail-boat, the bay sparkling in the sunshine, the visit to the old prison-ship—it all meant so much to her enthusiastic, pleasure-loving temperament. A certain uncomfortable and premeditated call upon Colonel Hamilton could easily be postponed to an indefinite future, with such delightful anticipations in the definite present. \n \n “It seems heartless to be going off for a day’s jaunt, when father has so much to trouble him,” Josephine said, when, soon after breakfast, the little party of five, basketed and equipped, were starting down to the wharf. \n \n “Not at all, Josephine,” answered her sweet-faced mother, holding bonny Kate by the hand as she spoke. “We will try and keep dear old papa cheery, won’t we, little daughter?” then, seeing that Josephine still lingered, as though reluctant to go, she added, cheerily, “nothing would be gained by your staying, Josephine. Your father has some office work that will keep him in the house, so you can think of him as safe at home all day, and we are both of us glad enough to have you enjoy a little change.” So, somewhat relieved in her mind, Josephine hurried down and joined the Others, and soon the “Gretchen,” with her white sail spread to the crisp morning breeze, sped out on the river, fairly dancing along the crests of the white caps that splashed against her prow with such a continuous and merry little thump and splutter. \n \n \n \n 0059 \n \n Wind and tide favored them, and Harry was an excellent sailor, so that in a comparatively short time they had left the waters of the Hudson behind them, had rounded Fort George, the Battery of to-day, and were headed up the East River, with New York on the one side, and the then scattered town of Brooklyn on the other. Skilfully tacking in long slants from shore to shore, the wharves and shipping were soon exchanged for the sloping banks of Manhattan Island on the left, and of Long Island on the right, and then suddenly the dismasted hulk of the old “Jersey” loomed up before them. \n \n She was a dreary enough looking object to any one, but if, like Harry, you had been a prisoner aboard of her for eighteen long months, you would, like him, no doubt, have shuddered at the sight of her. Josephine shuddered too. “Oh, do not let us go any nearer!” she said. \n \n “All right,” was Harry’s quick response, for, in point of fact, nothing pleased him better than to comply with Josephine’s slightest wish, so the “Gretchen” veered off again. \n \n “Oh! can’t we go aboard?” cried Flutters, with a world of disappointment in his tone, for in imagination he had already scaled the gangway ladder that hung at her larboard side, and turned more than one somersault on the wide sweep of her upper deck. \n \n “Why, no, child!” answered Hazel, who was fast assuming a most patronizing air toward her little protégé; “no one would think of going aboard of her, would they, Cousin Harry?” \n \n “Why, why not?” Flutters asked, half-impatiently, for Harry, giving his attention for the moment to the management of the boat, did not at once reply. \n \n “Because,” he said, finally, “there has been far too much sickness in that old hulk for any one to safely venture aboard of her; she has been responsible for the lives of eleven thousand men. I doubt if the strongest and longest of north winds could ever blow her free from the fever that must be lurking in her rotten timbers.” \n \n That was a new phase of the matter to Flutters, and he subsided at once into thoughtful silence. \n \n “I think this would be a good place to anchor,” suggested Harry, but waited a moment till Josephine had given her consent before letting the anchor run the length of its rope and bury itself in the mud bottom beneath them. \n \n As soon as the “Gretchen” had settled into the position determined for her by the tide, the little party of five ranged themselves about the boat, so as to be as comfortable as possible, for there they meant to stay for the next hour, or two, or three, as the case might be. It had been for some time a thoroughly understood matter between Hazel and Harry Avery, that whenever the day should come for this trip to the “Jersey,” they were to anchor their boat in full sight of her, and then and there he was to tell them the “whole story”—from the day he volunteered till the day of his release in the previous summer. \n \n Flutters, who had been made acquainted with the object of the expedition, waited, with a charming native sense of the “fitness of things,” until the others had chosen their places; then he threw himself at Harry’s feet, in one of the graceful positions so natural to him, and which even Hans Van Wyck’s rough, homespun clothes did not altogether succeed in hiding. It was wonderful to look into Flutters’s upturned face—such complete satisfaction, such tranquil happiness shone out of it. Even in those exciting moments when every nerve and tissue was thrilling under Harry’s narration of the dark features of his prison life, a smile still seemed to be lurking in the corners of his expressive mouth. Yesterday, a lonely little tumbler in a dreary, tawdry circus company; to-day, one of a blessed circle of warm-hearted friends. Whatever fears others might have as to the disposal to be made of him, Flutters had none for himself. Of course he was to be Hazel’s faithful little servant from that day forward, and it was almost worth while, he thought, to have “darkey blood” in one’s veins for the sake of rendering such happy service. Farther than that he did not trouble himself, literally taking no thought for the morrow, nor for what he should put on when his present habiliments should have found their way back to their rightful owner. The “Gretchens” little company made a pretty picture against the blue gray of the bay, and when at last there was no more arranging to be done, and all had repeatedly declared themselves “perfectly comfortable,” there was a breathless, momentous little pause, as in the moment at a play between the significant and abrupt cessation of the orchestra and the rolling back of the curtain. “Please begin,” said Hazel, with a great sigh, as though the intense anticipation of that supreme moment was quite too heavy for child-nature to endure, and Harry, looking sadly over to the old “Jersey,” commenced his story. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/1743/51020.html","bookId":650,"book":{"id":650,"title":"A Loyal Little Red-Coat","description":"简介： In the introductory chapter of The History of the People of the United States, Mr. McMaster announces as his subject, The history of the people from the close of the war for Independence down to the opening of the war between the States. It seems at...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1743","creation":"Aug 1, 2019 12:19:06 AM","modification":"Aug 1, 2019 12:19:06 AM"}}
