{"id":39835,"no":8,"title":"CHAPTER VII: A TERRIBLE SHOCK","content":"Ned had been looking forward with great anticipations to Michaelmas day, upon which the great match was to take place; for he was one of the eleven, being the youngest of the boys included in it. An event, however, happened which deprived him of his share in the match, and caused the day to pass almost unnoticed. On the 20th of September the servant came in to Mr. Porson during morning school to say that he was wanted. A minute or two later she again re-entered and said that Ned and his brother were to go to the master\u0027s study. Much surprised at this summons they followed her. Mr. Porson was looking exceedingly grave. “My dear boys,” he said, “I have bad news for you. Very bad news. You must bear it bravely, looking for support and consolation to Him who alone can give it. Dr. Green\u0027s boy has just been here. He was sent down by his master to say that there has been a serious accident in the town.” The commencement of the master\u0027s speech and the graveness of his tone sent a serious thrill through the hearts of the boys. Mr. Porson would never have spoken thus had not the news been serious indeed. When he paused Ned gave a little gasp and exclaimed, “My father!” “Yes, Ned, I am grieved to say that it is your brave father who has suffered from the accident. It seems that as he was walking down the High Street one of Ramsay\u0027s heavy wagons came along. A little girl ran across the street ahead, but stumbled and fell close to the horses. Your father, forgetful of the fact of his wooden leg, rushed over to lift her; but the suddenness of the movement, he being a heavy man, snapped the wooden leg in sunder, and he fell headlong in the street. He was within reach of the child, and he caught her by the clothes and jerked her aside; but before he could, in his crippled condition, regain his feet, the wheel was upon him, and he has suffered very serious injuries.” “He is not dead, sir?” Ned gasped, while his brother began to cry piteously. “No, Ned, he is not dead,” Mr. Porson said; “but I fear, my dear boy, that it would be cruel kindness did I not tell you to prepare yourself for the worst. I fear from what I hear that he is fatally injured, and that there is but little hope. Get your hats, my boys, and I will walk home with you at once.” There were but few words exchanged during that dismal walk, and these were addressed by Mr. Porson to Ned. “Try to calm yourself, my boy,” he said, putting his hand on his shoulder, which was shaking with the boy\u0027s efforts to keep down his convulsive sobs; “try and nerve yourselves for the sake of your father himself, of your mother, and the little ones. The greatest kindness you can show to your father new is by being calm and composed.” “I will try, sir,” Ned said as steadily as he could; “but you don\u0027t know how I loved him!” “I can guess it, my boy; for I, too, lost my father when I was just your age. God\u0027s ways are not our ways, Ned; and be sure, although you may not see it now, that he acts for the best.” A little crowd stood gathered near the door. They were talking in low tones of the gallant way in which the crippled officer had sacrificed himself to save the child. They made way silently for the boys to pass. Ned opened the door and entered. Abijah was in the hall. She was tearless, but her face was white and set. “My poor boy,” she said to Ned, “he is in the parlor; he has just been asking for you. I am glad you have come. Your mother is in hysterics in her bedroom, and is going on like a mad woman. You must be calm, dear, for your father\u0027s sake.” Ned gave a little nod, and, taking his brother\u0027s hand, opened the door of the parlor. Captain Sankey was lying on the hearth rug, his head propped up with pillows from the sofa; his face was an ashen pallor, and his eyes were closed. The doctor was kneeling beside him, pouring some liquid from a glass between his lips. A strong friendship had sprung up between the two men, and tears were running fast down the doctor\u0027s cheeks. He motioned to the boys to approach. They fell on their knees by their father\u0027s side. “Sankey,” the doctor said in a steady voice, “here are your boys, Ned and Charlie.” The eyes of the dying man opened slowly, and he looked at his sons, and Ned felt a slight pressure of the hand which he had taken in his own. “God bless you, my boys!” he said, in a faint whisper. “Ned, be kind to your mother; care for her always. She will need all your kindness.” “I will, father,” the boy said steadily. “I will take care of mother, I promise you.” A faint smile passed over the pale face; then the eyes closed again, and there was silence for five minutes, broken only by the sobbing of the younger boy. The doctor, who had his fingers on the pulse of Captain Sankey, leaned closely over him; then he laid his arm gently down, and putting his hand on Ned\u0027s shoulder said softly: “Come, my boy, your father is out of pain now.” Ned gave one loud and bitter cry, and threw himself down by the side of the corpse, and gave way to his pent up emotion. The doctor led the younger boy from the room, and gave him into the care of Abijah. Then he returned and stood for awhile watching Ned\u0027s terrible outburst of grief; then he poured some wine into a glass. “My boy,” he said tenderly, “you must not give way like this or you will make yourself ill. Drink this, Ned, and then go up and lie down on your bed until you feel better. Remember you must be strong for the sake of the others. You know you will have to bear your mother\u0027s burdens as well as your own.” He helped Ned to his feet and held the glass to his lips, for the boy\u0027s hand was shaking so that he could not have held it. After drinking it Ned stumbled upstairs and threw himself on the bed, and there cried silently for a long time; but the first passion of grief had passed, and he now struggled with his tears, and in an hour rose, bathed his flushed and swollen face, and went downstairs. “Abijah,” he said, in a voice which he struggled in vain to steady, “what is there for me to do? How is my mother?” “She has just cried herself off to sleep, Master Ned, and a mercy it is for her, poor lady, for she has been going on dreadful ever since he was brought in here; but if you go in to Master Charlie and Miss Lucy and try and comfort them it would be a blessing. I have not been able to leave your mother till now, and the poor little things are broken hearted. I feel dazed myself, sir. Think of the captain, who went out so strong and well this morning, speaking so kind and bright just as usual, lying there!” and here Abijah broke down and for the first time since Captain Sankey was carried into the house tears came to her relief, and throwing her arms round Ned\u0027s neck she wept passionately. Ned\u0027s own tears flowed too fast for him to speak for some time. At last he said quietly, “Don\u0027t cry so, Abijah. It is the death of all others that was fitted for him, he, so brave and unselfish, to die giving his life to save a child. You told me to be brave; it is you who must be brave, for you know that you must be our chief dependence now.” “I know, Master Ned; I know, sir,” the woman said, choking down her sobs, and wiping her eyes with her apron, “and I will do my best, never fear. I feel better now I have had a good cry. Somehow I wasn\u0027t able to cry before. Now, sir, do you go to the children and I will look after things.” A fortnight passed. Captain Sankey had been laid in his grave, after such a funeral as had never been seen in Marsden, the mills being closed for the day, and all the shutters up throughout the little town, the greater part of the population attending the funeral as a mark of respect to the man who, after fighting the battles of his country, had now given his life for that of a child. The great cricket match did not come off, it being agreed on all hands that it had better be postponed. Mr. Porson had called twice to see Ned, and had done much by his comforting words to enable him to bear up. He came again the day after the funeral. “Ned,” he said, “I think that you and Charlie had better come to school again on Monday. The sooner you fall into your regular groove the better. It would only do you both harm to mope about the house here; and although the laughter and noise of your schoolfellows will jar upon you for awhile, it is better to overcome the feeling at once; and I am sure that you will best carry out what would have been his wishes by setting to your work again instead of wasting your time in listless grieving.” “I think so too, sir,” Ned said, “but it will be awfully hard at first, and so terrible to come home and have no one to question one on the day\u0027s work, and to take an interest in what we have been doing.” “Very hard, Ned; I thoroughly agree with you, but it has to be borne, and remember there is One who will take interest in your work. If I were you I should take your brother out for walks this week. Get up into the hills with him, and try and get the color back into his cheeks again. He is not so strong as you are, and the confinement is telling upon him—the fresh air will do you good, too.” Ned promised to take his master\u0027s advice, and the next morning started after breakfast with Charlie. His mother had not yet risen, and indeed had not been downstairs since the day of the accident, protesting that she was altogether unequal to any exertion whatever. Ned had sat with her for many hours each day, but he had indeed found it hard work. Sometimes she wept, her tears being mingled with self reproaches that she had not been able to do more to brighten her husband\u0027s life. Sometimes she would break off and reproach the boy bitterly for what she called his want of feeling. At other times her thoughts seemed directed solely toward the fashion of her mourning garments, and after the funeral she drove Ned almost to madness by wanting to knew all the details of who was there and what was done, and was most indignant with him because he was able to tell her nothing, the whole scene having been as a mist to him, absorbed as he was in the thought of his father alone. But Ned had never showed the least sign of impatience or hastiness, meeting tears, reproaches, and inquiries with the same stoical calmness and gentleness. Still it was with a sigh of relief that he took a long breath of fresh air as he left the house and started for a ramble on the moor with his brother. He would have avoided Varley, for he shrank even from the sympathy which Bill Swinton would give; but Bill would be away, so as it was the shortest way he took that road. As he passed Luke Marner\u0027s cottage the door opened and Mary came down to the gate. One of the little ones had seen Ned coming along the road and had run off to tell her. Little Jane Marner trotted along by Polly\u0027s side. “Good morning, Polly!” Ned said, and walked on. He dreaded speech with any one. Polly saw his intention and hesitated; then she said: “Good morning, Master Ned! One moment, please, sir.” Ned paused irresolutely. “Please don\u0027t say anything,” he began. “No, sir, I am not a-going to—at least—” and then she hesitated, and lifted up the child, who was about four years old, a soft eyed, brown haired little maiden. “It\u0027s little Jenny,” she said; “you know sir, you know;” and she looked meaningly at the child as the tears stood in her eyes. Ned understood at once. “What!” he said; “was it her? I did not know; I had not heard.” “Yes, sir; she and all of us owe her life to him. Feyther wanted to come down to you, but I said better not yet awhile, you would understand.” “How did it happen?” Ned said, feeling that here at least his wound would be touched with no rough hand. “She went down to the town with Jarge, who was going to fetch some things I wanted. He left her looking in at a shop window while he went inside. They were some time serving him as there were other people in the shop. Jenny got tired, as she says, of waiting, and seeing some pictures in a window on the other side of the street started to run across, and her foot slipped, and—and—” “I know,” Ned said. “I am glad you have told me, Polly. I am glad it was some one one knows something about. Don\u0027t say anything more now, I cannot bear it.” “I understand, sir,” the girl said gently. “God bless you!” Ned nodded. He could not trust himself to speak, and turning he passed on with Charlie through the village, while Mary Powlett, with the child still in her arms, stood looking sorrowfully after him as long as he was in sight. “So thou\u0027st seen the boy?” Luke said, when on his return from work Polly told him what had happened. “Thou told\u0027s him, oi hope, how we all felt about it, and how grateful we was?” “I didn\u0027t say much, feyther, he could not bear it; just a word or two; if I had said more he would have broken out crying, and so should I.” “Thou hast cried enoo, lass, the last ten days. Thou hast done nowt but cry,” Luke said kindly, “and oi felt sore inclined to join thee. Oi ha\u0027 had hard work to keep back the tears, old though oi be, and oi a cropper.” “You are just as soft hearted as I am, feyther, every bit, so don\u0027t pretend you are not;” and indeed upon the previous day Luke Marner had broken down even more completely than Mary. He had followed the funeral at a short distance, keeping with Mary aloof from the crowd; but when all was over, and the churchyard was left in quiet again, Luke had gone and stood by the still open grave of the man who had given his life for his child\u0027s, and had stood there with the tears streaming down his cheeks, and his strong frame so shaken by emotion that Polly had been forced to dry her own eyes and stifle her sobs, and to lead him quietly away. “Strange, bain\u0027t it, lass; feyther and son seem mixed up with Varley. First the lad has a foight wi\u0027 Bill Swinton, and braakes the boy\u0027s leg; then t\u0027 feyther sends oop all sorts o\u0027 things to Bill, and his son comes up here and gets as friendly with Bill as if he were his brother, and gets to know you, and many another in the village. Then our Jane goes down into t\u0027 town and would ha\u0027 lost her life if captain he hadn\u0027t been passing by and saaved her. Then he gets killed. Just gived his life for hearn. Looks like a fate aboot it; may be it eel be our toorn next, and if ever that lad waants a man to stand beside him Luke Marner will be there. And there\u0027s Bill too—oi believe that boy would lay down his life for him. He\u0027s very fond of our Janey—fonder nor her own brothers. He ain\u0027t got no sister of his own, and he\u0027s took to t\u0027 child wonderful since he got ill. He thowt a soight o\u0027 Ned Sankey afore; I doan\u0027t know what he wouldn\u0027t do for him now.” “I don\u0027t suppose, feyther, as any of us will be able to do anything for him; but we may do, who knows?” “Ay, who knows, lass? toimes is main bad, and oi doot there will be trouble, but oi doan\u0027t see as that can affect him no ways, being as he is a lad, and having nowt to do with the mills—but oi do hoape as the time may come, lass, as we can show un as we knows we owes a loife to him.” On the Monday following Ned and Charlie returned to school, and found it less painful than Ned had expected. Mr. Porson had taken Ripon aside and had told that the kindest way to treat the boys would be to avoid all allusion to their loss or anything like a show of open sympathy, but to let them settle quietly into their places. “Sankey will know you all feel for him, Ripon, he will need no telling of that.” Ripon passed the word round the school, and accordingly when the boys came into the playground, two or three minutes before the bell rang, Ned, to his great relief, found that with the exception of a warm silent wring of the hand from a few of those with whom he was most intimate, and a kindly nod from others, no allusion was made to his fortnight\u0027s absence or its cause. For the next month he worked hard and made up the time he had lost, running straight home when he came out from school, and returning just in time to go in with the others; but gradually he fell into his former ways, and by the time the school broke up at Christmas was able to mix with the boys and take part in their games. At home he did his best to make things bright, but it was uphill work. Mrs. Sankey was fretful and complaining. Their income was reduced by the loss of Captain Sankey\u0027s half pay, and they had now only the interest of the fortune of four thousand pounds which Mrs. Sankey had brought to her husband on her marriage. This sum had been settled upon her, and was entirely under her own control. The income was but a small one, but it was sufficient for the family to live upon with care and prudence. Captain Sankey had made many friends since the time when he first settled at Marsden, and all vied with each other in their kindness to his widow. Presents of game were constantly left for her; baskets of chickens, eggs, and fresh vegetables were sent down by Squire Simmonds and other county magnates, and their carriages often stopped at the door to make inquiries. Many people who had not hitherto called now did so, and all Marsden seemed anxious to testify its sympathy with the widow of the brave officer. Ned was touched with these evidences of respect for his father\u0027s memory. Mrs. Sankey was pleased for herself, and she would of an evening inform Ned with much gratification of the visits she had received. Ned was glad that anything should occur which could rouse his mother, and divert her from her own grievances; but the tone in which she spoke often jarred painfully upon him, and he wondered how his mother could find it in her heart to receive these people and to talk over his father\u0027s death. But Mrs. Sankey liked it. She was conscious she looked well in her deep mourning, and that even the somber cap was not unbecoming with her golden hair peeping out beneath it. Tears were always at her command, and she had ever a few ready to drop upon her dainty embroidered handkerchief when the occasion commanded it; and her visitors, when they agreed among themselves, what a soft gentle woman that poor Mrs. Sankey was, but sadly delicate you know—had no idea of the querulous complaining and fretfulness whose display was reserved for her own family only. To this Ned was so accustomed that it passed ever his head almost unheeded; not so her constant allusions to his father. Wholly unconscious of the agony which it inflicted upon the boy, Mrs. Sankey was incessantly quoting his opinions or utterances. “Ned, I do wish you would not fidget with your feet. You know your dear father often told you of it;” or, “As your dear father used to say, Ned;” until the boy in despair would throw down his book and rush out of the room to calm himself by a run in the frosty night air; while Mrs. Sankey would murmur to herself, “That boy\u0027s temper gets worse and worse, and with my poor nerves how am I to control him?” Mr. Porson was very kind to him in those days. During that summer holiday he had very frequently spent the evening at Captain Sankey\u0027s, and had formed a pretty correct idea of the character of Ned\u0027s mother. Thus when he saw that Ned, when he entered the school after breakfast or dinner, had an anxious hunted look, and was clearly in a state of high tension, he guessed he was having a bad time of it at home. Charlie had fast got over the shock of his father\u0027s death; children quickly recover from a blow, and, though delicate, Charlie was of a bright and gentle disposition, ready to be pleased at all times, and not easily upset. One morning when Ned came in from school looking pale and white, gave random answers to questions, and even, to the astonishment of the class, answered Mr. Porson himself snappishly, the master, when school was over and the boys were leaving their places, said: “Sankey, I want to have a few words with you in the study.” Ned followed his master with an air of indifference. He supposed that he was going to be lectured for the way he had spoken, but as he said to himself, “What did it matter! what did anything matter!” Mr. Porson did not sit down on entering the room, but when Ned had closed the door after him took a step forward and laid his hand on his shoulder. “My boy,” he said, “what is it that is wrong with you? I fear that you have trouble at home.” Ned stood silent, but the tears welled up into his eyes. “It can\u0027t be helped, sir,” he said in a choking voice, and then with an attempt at gayety: “it will be all the same fifty years hence, I suppose.” “That is a poor consolation, Ned,” Mr. Porson rejoined. “Fifty years is a long time to look forward to. Can\u0027t we do anything before that?” Ned was silent. “I do not want you to tell me, Ned, anything that happens at home—God forbid that I should pry into matters so sacred as relations between a boy and a parent!—but I can see, my boy, that something is wrong. You are not yourself. At first when you came back I thought all was well with you; you were, as was natural, sad and depressed, but I should not wish it otherwise. But of late a change has come ever you; you are nervous and excited; you have gone down in your class, not, I can see, because you have neglected your work, but because you cannot bring your mind to bear upon it. Now all this must have a cause. Perhaps a little advice on my part might help you. We shall break up in a week, Ned, and I shall be going away for a time. I should like to think before I went that things were going on better with you.” “I don\u0027t want to say anything against my mother,” Ned said in a low voice. “She means kindly, sir; but, oh! it is so hard to bear. She is always talking about father, not as you would talk, sir, but just as if he were alive and might come in at any moment, and it seems sometimes as if it would drive me out of my mind.” “No doubt it is trying, my boy,” Mr. Porson said; “but you see natures differ, and we must all bear with each other and make allowances. Your mother\u0027s nature, as far as I have seen of her, is not a deep one. She was very fond of your father, and she is fond of you; but you know, just as still waters run deep, shallow waters are full of ripples, and eddies, and currents. She has no idea that what seems natural and right to her should jar upon you. You upon your part can scarcely make sufficient allowance for her different treatment of a subject which is to you sacred. I know how you miss your father, but your mother must miss him still more. No man ever more lovingly and patiently tended a woman than he did her so far as lay in his power. She had not a wish ungratified. You have in your work an employment which occupies your thoughts and prevents them from turning constantly to one subject; she has nothing whatever to take her thoughts from the past. It is better for her to speak of him often than to brood over him in silence. Your tribute to your father\u0027s memory is deep and silent sorrow, hers is frequent allusions. Doubtless her way jars upon you; but, Ned, you are younger than she, and it is easier for you to change. Why not try and accept her method as being a part of her, and try, instead of wincing every time that she touches the sore, to accustom yourself to it. It may be hard at first, but it will be far easier in the end.” Ned stood silent for a minute or two; then he said: “I will try, sir. My father\u0027s last words to me were to be kind to mother, and I have tried hard, and I will go on trying.” “That is right, my boy; and ask God to help you. We all have our trials in this life, and this at present is yours; pray God to give you strength to bear it.”","sourceLink":"http://novel.tingroom.com/duanpian/3117/85785.html","bookId":927,"book":{"id":927,"title":"Through the Fray","description":"简介： It has just struck one, and the boys are streaming out from the schoolroom of Mr. Hathorn\u0027s academy in the little town of Marsden in Yorkshire. Their appearance would create some astonishment in the minds of lads of the present generation, for it was...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3117","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
