{"id":77308,"no":23,"title":"Page 23","content":"“Kitchen knife,” he said. “She had it in the sleeve of her sweatshirt.” “Black levels eat in camp. They don\u0027t go anywhere near the cafeteria. Where\u0027d she get it?” “A staff member must\u0027ve gotten careless, left it somewhere. I find out who, I\u0027m going to grind them into rebarb. The point is, the Zedman girl is resourceful. And determined.” “I just saw Olsen at the party. She said nothing about this.” “She insisted we not make a big deal about it. Got three stitches and a tetanus shot and she wants to keep working with Zedman. The girl has spirit, amigo. I can see why you wanted to keep her.” Hunter hit another button on his surveillance console, brought up a live shot. It was like looking into a well—just a shaft of gray brick. Mallory was sitting with her back against the door, as if to keep anyone else from coming in. She was mumbling something. It could\u0027ve been a lullaby, judging from her expression. As if she knew they were watching, she stopped singing and looked straight up at the camera. Her eyes were like a marathon runner\u0027s in the middle of a course, just when the real pain was setting in. “Has she eaten?” Chadwick asked. “Been two days. We\u0027ll have to force-feed soon.” Hunter\u0027s tone was dry. Force-feeding was one of the extreme measures even he disliked. “I\u0027m not saying we haven\u0027t dealt with worse . . .” “Let me talk to her,” Chadwick said. Hunter sat back in his huge leather chair. He stared at the only photo on his desk—his father, the Reverend Asa Hunter, Sr. Hunter often professed dislike for his father, had run away when he was fifteen, joined the Air Force when he was seventeen. And yet there was the Reverend\u0027s picture—the implacable African Methodist Episcopal who had turned his son into the most biblically well-versed atheist in the world. “I spoke with your friend at Oakland Homicide,” Hunter told Chadwick. “Sergeant Damarodas.” “Since when is he my friend?” “They identified two people\u0027s blood at the scene. Talia Montrose\u0027s. The other—smaller amount. They\u0027re assuming the attacker. DNA says chances are a billion to one the attacker was related to the victim.” “Samuel Montrose?” “Police are still looking for the younger brother, Race. They still want to talk to Mallory. Damarodas thinks she may have seen the murder.” “You reconsidering giving him access?” Anyone besides Chadwick probably wouldn\u0027t have sensed Hunter\u0027s uneasiness, it was so slight—as hard to see, as insubstantial as a tripwire. “You know a guy named David Kraft?” Hunter asked him. “A friend of my daughter\u0027s. Works at Laurel Heights now.” “Damarodas talked to him—wanted to get some background on you, Katherine, that necklace they found. David Kraft said he used to date your daughter. He admitted that once, to score some pot, he took her to this place he knew—the Montrose house. He\u0027s the one introduced them.” Chadwick flexed his fingers, which suddenly felt stiff and swollen. “There\u0027s no point bringing all that up now.” “So I told Damarodas. Except, according to Kraft, your daughter took an instant liking to the dealer, Samuel. She dumped David Kraft pretty quick after that, but he claims Katherine and Samuel got involved—heavily involved. Romantically.” On the surveillance screen, Mallory was serenading her knee, prodding it with her finger as if there were a tiny bug there. “The night I told you about,” Chadwick said, “the one time I saw Samuel. I was taking Katherine home from the Oakland police station and she told me about him. She said she was in love. She was going to run away with him.” “That\u0027s why you came to see me,” Hunter guessed. “You needed to get her out of there, bring her to Texas. And then, before you could, she committed suicide. That\u0027s why you\u0027re afraid of Samuel. You think he holds you responsible for her death.” Chadwick said nothing. Hunter leaned forward. “I don\u0027t like this, amigo. I don\u0027t like finding things out about you from a homicide cop.” “Asa, I didn\u0027t tell anyone about Katherine and Samuel. Not even Norma.” “And now the police are going after a student of mine to frame some poor black kid.” “Frame?” “The cops aren\u0027t buying the Samuel Montrose angle. They\u0027re not going to expend any effort to find the guy. Easy money is on Race.” “Damarodas said that?” “He didn\u0027t have to. Maybe I\u0027m reading between the lines here, giving Damarodas too much credit, but the man sounded like he was warning me. Said he was coming down here—even gave me a date, a week from Monday.” “You going to let him in?” “Not if I can help it. Thing is, Damarodas hinted that John Zedman was throwing his weight around, having lunch with the chief of police, shit like that. I got the impression they\u0027re trying to cut a deal—drop accessory charges against Mallory if she provides testimony against Race Montrose. Damarodas told me Talia Montrose sold her house for twice what it was worth just before she died. Damarodas is pretty certain John Zedman worked that deal—paying her off for some reason. That\u0027s all being overlooked by Damarodas\u0027 superiors. I don\u0027t think the sergeant was completely happy with that.” “We\u0027re agreed on that point.” “So I\u0027m asking you again—is there leverage the Montroses might\u0027ve had on John Zedman? Anything he had to hide?” “I don\u0027t know.” Chadwick held his eyes. “But Damarodas didn\u0027t have to wait so long to visit. He didn\u0027t have to warn you, either. It\u0027s almost like he\u0027s giving us time to find out.” Hunter\u0027s gaze shifted to the monitor. He tapped his knuckle on Mallory Zedman\u0027s forehead. “I don\u0027t like this, Chadwick. This kid would sell us south in a minute. When you talk to her, you tell her I\u0027m going to save her sorry butt anyway. She\u0027s going to go through the program. She\u0027s got no choice about that.” Chadwick managed a smile. “Thank you, Asa.” “She wants to tell you something, fine. But don\u0027t make it into a deal. This is about compliance to authority, not co-opting.” Chadwick studied the unrelenting face of Reverend Asa, Sr., and wondered if that were a quote from him. He said nothing. “Keep to the weekly schedule. I gave you a pickup in Menlo Park Thursday. Kindra Jones goes along with you—we\u0027ll treat it as standard time on the job. But you\u0027ll have the day in the Bay Area, just in case you wanted to do anything. Understood?” “You\u0027re the best, Asa.” “I\u0027m flying down to the Playa Verde campus for a couple of days,” Hunter said, “but you\u0027ve got my number. You find out something, I\u0027m the first one to know. Are we clear on that?” His tone was even, but the set of his jaw, the veins standing out like a root system on his bald scalp, made Chadwick think of the afternoon, long ago, when Hunter had thrown his knife at a live oak tree, over and over, until his hand blistered and the bark of the tree erupted in wet white splinters. “We\u0027re clear,” Chadwick promised. As he left, three people were staring at him—Hunter, the Reverend and the glowing apparition of Mallory Zedman, singing him a soundless lullaby. 11 Her left wrist was cuffed to the picnic table. Olsen sat next to her, a large trail of Mallory\u0027s spittle glistening on the shoulder of her fleece jacket. It was too cold, too late in the afternoon for anyone else to be using the deck. Deer grazed the hillside. Mesquite smoke scented the air. The junipers crackled as ice expanded in the joints of their branches. Chadwick sat across from Mallory, slid her a plate of food. She scowled at the turkey and dressing. “What is this—Thanksgiving?” “Yes. You need to eat.” She shoved the plate back toward him. “Like I\u0027ve got a ton to be thankful for. Thank you, Chadwick. Thank you, Miss Bitch-sitting-next-to-me-with-the-plastic-handcuff-collection.” “Mallory,” Olsen warned. The girl turned away. Olsen removed her wristwatch and set it on the table next to the plate of food. “Ten minutes. That\u0027s all you have to be here.” “He ruined my goddamn life. He slept with my mother, made Katherine kill herself. He brought me here. You helped him. Why the fuck should I listen to you?” The deer on the hillside raised their heads. Their hindquarters twitched. “Set aside the anger,” Olsen told her. “Put it away for ten minutes and listen.” Mallory grabbed the fork from her dinner plate. She wedged it under the handcuff and tried to pry it loose, but the fork was cheap plastic. The tines snapped. She threw what was left at Chadwick. “Ten minutes without an outburst,” Olsen said. “Starting now.” Olsen looked at Chadwick, and he realized that her deadline—the maximum time she would tolerate—was an edict meant mostly for him. He told Mallory about the police investigation into Talia Montrose\u0027s murder—the bloodstains, Sergeant Damarodas\u0027 visit, the fact that Race and she were both wanted for questioning. Mallory kept her eyes on the mist curling up from the turkey. “Dr. Hunter will protect you if he can,” Chadwick told her. “But we need to know what you saw that night. What you did.” “Nothing. I didn\u0027t do anything.” “Who killed Mrs. Montrose?” “I don\u0027t know. I don\u0027t want to.” “Mrs. Montrose\u0027s killer was probably related to her,” Chadwick said. “Was it Race?” “No. Goddamn you. No.” “One of his brothers?” Her face darkened. “You mean Samuel. Race told me . . . Race swore Samuel was gone. Like, permanently gone.” She yanked on her handcuff. “Anyway, why the hell do you care? You\u0027d love them all dead.” “Three minutes, Mallory,” Olsen promised. “Just lock me up,” Mallory murmured. “Fuck you.” The watch kept ticking. It had a transparent face, exposed gears that reminded Chadwick of his father\u0027s repair shop. He wondered if the closet in the Mission house was still full of old clock parts. He remembered Katherine playing hide-and-seek there, surprising him by leaping out of the woodwork, smelling of dust and oiled copper, wrapping her arms around his neck. “Mallory, did your father ever say anything about Samuel?” The question drained the color from her face. “No. Why would he?” “Your dad bought Talia Montrose\u0027s house. He gave her a lot more money than it was worth. Maybe he was paying her to go away—to get Race away from you. But I think there was more to it than that. I think someone in the Montrose family was blackmailing him.” Mallory\u0027s attention seemed to be focusing on smaller and smaller things—the design in the paper plate, the grain of the table. “Talia Montrose should\u0027ve had a large amount of money on her when she died,” Chadwick said. “The police found nothing. When we picked you up in Rockridge, you had over six hundred in cash.” “Race got it.” “Where?” “He just said . . . I don\u0027t know. I don\u0027t remember what he said.”","sourceLink":"https://allnovel.net/cold-springs/page-23.html","bookId":2423,"book":{"id":2423,"title":"Cold Springs","description":"Storyline: The death of a child ripples effects on all around her - whether accident, suicide, or murder. Katherine Chadwick 16 overdoses on heroin while babysitting little Mallory, daughter of her parents\u0027 best friends. Forward nine years to two ruined marriages. For a reform school in Cold Springs Texas, Kat\u0027s dad must capture Mallory, now 15 and in trouble.","cover":"https://allnovel.net/images/cold-springs.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/cold-springs.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:35:07 PM"}}
