{"id":77318,"no":34,"title":"Page 34","content":"John\u0027s lips were moving, making sounds, but nothing intelligible came out. For a minute, Samuel was afraid Zedman might\u0027ve broken completely.\\n\\n Then Zedman said, “Pérez. I told him . . . I thought . . . he\u0027s going after Chadwick—”\\n\\n Samuel stared at him. And then he got it, and he started to laugh. He filled up the bathroom with laughter, had to sit on the pot, it was all so funny. He looked down and saw that poor Zedman wasn\u0027t sharing the joke.\\n\\n “Yeah, I got you,” Samuel said. “And?”\\n\\n “It wasn\u0027t Chadwick\u0027s fault. It was mine. Please stop him. Don\u0027t let Pérez . . .”\\n\\n “Noble, John. What does it take for you to make an enemy and have it stick? Man fucks your wife, steals your daughter—brings all this on you, and you want to save his life now, after you told your Mexican to kill him? Man. Money makes you crazy, John. I guess it does.”\\n\\n In the next room, the DVD was still playing—bright and cheerful sounds, music from a fairy tale.\\n\\n “The real account number,” John promised. “A password. The right one.”\\n\\n The wound on his mouth was still bleeding—ragged and pink like a fishhook gouge.\\n\\n Zedman told him the password, the account number, the name of the bank. He told him the exact amount, the agent who could make the transfer. And Samuel knew he wasn\u0027t lying this time. He was broken. He was ready for the next level of training—as pliable as his goddamn weak daughter.\\n\\n “You can\u0027t remember all that,” Zedman muttered. “Let me out of here. I\u0027ll write it down. I\u0027ll take you downstairs—”\\n\\n “Oh, I\u0027ll remember,” Samuel promised. “I\u0027m brilliant, see? Everybody says so.”\\n\\n Then he came over to the tub, knelt, pressed the gun to John\u0027s heart—imagining the pattern it would make, like red wings on the tiles behind him, imagining Katherine\u0027s pleading, the fairy-tale music going, evoking impossible images like Talia being alive, Samuel being in charge—realizing his dreams, getting through college, teaching kids, protecting his family once and for all.\\n\\n John Zedman closed his eyes. His lips trembled so violently it was hard to tell if he was just afraid, or if his body was involved in some terrible, desperate prayer.\\n\\n Samuel was filled with benevolence. Good old John. Paying his dues at last.\\n\\n He said, “I\u0027m thinking about letting you go, John. Would you like that? Would you give me anything for that?”\\n\\n And they knelt there together, at a moment of endless possibility, the shower soaking Samuel\u0027s sleeve and running off John Zedman\u0027s thinning hair, John\u0027s heartbeat so strong Samuel could almost feel it in the grip of his gun.\\n\\n 17\\n\\n Chadwick told himself he had no destination in mind, but it wasn\u0027t true. He fell back into a pattern as old as his adulthood—south on 101, exit on Army Street, up Van Ness to 24th.\\n\\n He knew he shouldn\u0027t go to the Mission District. He shouldn\u0027t indulge in the past. But seeing John, then visiting the East Bay, had put him in a frame of mind for examining old wounds.\\n\\n Some of the townhouses on San Angelo Street looked the way he remembered them—muddy facades, windows curtained with bedsheets, the stoops decorated with hubcaps and bilingual City Council election posters, Spanish graffiti. Other townhouses had been renovated by invading dot-commers—painted mauve and burgundy and teal, dandified with gingerbread trim and high-tech security systems. No cars out front—those would be parked in a guarded lot somewhere close by, safe from keying and window-smashing by angry blue-collar residents being driven out by the skyrocketing housing prices.\\n\\n Chadwick pulled in front of his old home, which nobody could have mistaken for dandified. The street level, which had once been his father\u0027s clock repair shop, was boarded up, anarchy signs and gang monikers scrawled across bricks and plywood and window frames. The steps up to the second-story porch were littered with takeout wrappers. A beer bottle sprouted from the mailbox.\\n\\n Chadwick slid his key in the lock—almost wishing it wouldn\u0027t work, but of course it did.\\n\\n The green door swung open on the interior stairwell, the air dark and stale as sleeper\u0027s breath.\\n\\n Chadwick tried the light switch. The electricity still worked—regulations required that of Chadwick. The management company must not have been changing the lightbulbs.\\n\\n He climbed up to the living room, ran his fingers over the chocolate wainscoting, stared at the coal-burning fireplace that had not worked since he was a child. On the mantel, islands of light dust marked the places where clocks had stood, years ago.\\n\\n Thin evening light filtered through the branches of the enormous bougainvillea in the backyard, making yellow streaks across the kitchen floor. Chadwick had always loved that bougainvillea—the pink snow of petals that had filled the yard every spring. He opened the window, stared past the empty clotheslines, the patch of weeds that had once been his garden, the toolshed, the broken fence, over the backs of the stores that faced Mission, their tar roofs painted silver and their vents pouring out the charred smells of cabrito and hamburger.\\n\\n He thought about Norma at the oven, cursing her burned raisin bread. It was one of the few memories he could conjure about her that did not cause pain.\\n\\n A portable stereo sat on the kitchen counter, a Brahms CD in the carriage from Chadwick\u0027s last visit, maybe three years ago. He\u0027d dropped by between escort jobs, supposedly to inspect the property with a mind toward finally selling it, giving Norma her half that the divorce decree demanded. His property manager had begged him to do so. He\u0027d tried to impress Chadwick with the incredible market, promising him an easy million for the old house. But in the end, Chadwick had decided nothing.\\n\\n He could never live in this house again. But he couldn\u0027t bear to sell it, or even lease it. He certainly couldn\u0027t bear to give any money from the sale to Norma. She had hated this place, blamed it for her unhappiness, cursed him for trying to raise Katherine here. Their last argument as a married couple, just a month after Katherine\u0027s suicide, had been about this house.\\n\\n And so the place stood heretically vacant in a zero-vacancy real estate market. Instead of making him lots of money, it took most of his meager income in property taxes. It was his one luxury—his one indulgence.\\n\\n He pushed the button on the stereo, let Brahms play.\\n\\n He walked into the front bedroom—his old childhood bedroom, later Katherine\u0027s. It was stripped now, the only piece of furniture a wooden chair where Chadwick had once sat and told stories to Katherine. A woman\u0027s red coat, probably Norma\u0027s, was draped over the chair back. Chadwick wondered how long it had been there.\\n\\n He remembered Katherine\u0027s bed in the corner, the crisp white sheets, the headboard he had painted—little pink stars, a cow jumping over a smiling moon.\\n\\n Chadwick remembered the imprint Katherine\u0027s slender body had left on the sheets, the tarnished heroin spoon discarded on the floor, the police lights pulsing in the windows. A female plainclothes officer kneeling next to the black leather chair in the doorway, holding Mallory\u0027s hand while the little girl chewed on a silver necklace, sobbing if anyone tried to take it away from her.\\n\\n Chadwick sat heavily in the wooden chair, in the middle of the empty room, surrounded by his memories.\\n\\n Piano Quartet No. 3.\\n\\n Chadwick closed his eyes. He thought about the number three, tried to strip away the years, imagining himself in 1903, then in 1803, trying to think of major events for those years.\\n\\n When he was in high school, he used to sit by these windows and watch the younger kids play basketball across the street. Even then, he knew he wanted to be a teacher. He and Ann would someday teach together. He had enlisted in the Air Force for the education money, pure and simple, knowing that his parents couldn\u0027t provide college tuition even if they\u0027d been inclined to do so. And later, after discharge, with Norma harping at him to get a business degree, he\u0027d studied history instead, because it was the opposite of everything his father stood for—his father who spent his life oiling chronometers, making time go forward as smoothly and flawlessly as possible—no drama, no breaks, never a surprise. Certainly nothing ever went backwards.\\n\\n Thinking about his father, Chadwick instinctively checked his watch. Seven o\u0027clock. Nine o\u0027clock in Texas. Mallory Zedman would be bunking down for the night. Hunter would be in his office, catching up on paperwork. Olsen . . . where would she be? Her room in the Big Lodge, or out for drinks in Fredericksburg, perhaps—a counselor\u0027s big night out.\\n\\n It bothered him, what John had said about his blackmailer describing Mallory\u0027s day.\\n\\n Chadwick had tried to dismiss the comment at first. No one got on the Cold Springs campus without Hunter\u0027s approval. Security was tight. And even if John was telling the truth, and the blackmailer had said something, it could\u0027ve been a bluff—some facts recounted from daytime talk shows where boot camp schools got plenty of lurid publicity. Hell, some of that publicity Hunter had generated himself.\\n\\n But Chadwick kept returning to what Kindra Jones had said—about how he should go back to confront John. She was right, though part of him wanted to stay bitter, to leave John to his fate.\\n\\n John thought he had a monopoly on suffering?\\n\\n Race Montrose was right: What could anyone do to Chadwick that was worse than leaving him alone?\\n\\n Chadwick heard light footsteps on the stairs. He thought he was imagining it, but then the Brahms piece ended, and the creaking didn\u0027t.\\n\\n “House isn\u0027t vacant!” he yelled. “I\u0027ve got a gun.”\\n\\n Norma appeared in the doorway, looking embarrassed, still wearing her wrinkled red dress from that morning. She raised her hands in surrender.\\n\\n “I was . . . just driving past. Saw that car in front.”\\n\\n Almost a decade since they\u0027d been divorced, and Chadwick was surprised how quickly he still picked up on her signals. Her statement wasn\u0027t so much a lie as a request that he not ask. He read the truth—Norma came here often. The coat on the chair was not from many years ago. He remembered she\u0027d been wearing it that morning, which meant she\u0027d been here once today already.\\n\\n Chadwick suddenly realized that if he\u0027d stayed in San Francisco, he would\u0027ve made the same pilgrimages, torturing himself, hating that he was drawn back to the source of the wound, but returning to this empty room nonetheless. How much Norma must resent him for not selling the property—how much easier it would\u0027ve been for her if he hadn\u0027t kept this shrine open for visitation. Better it be painted mauve, trimmed with gingerbread, sold to some young business grad whose definition of history was any amount of time longer than a Super Bowl commercial.\\n\\n “I found Race Montrose,” he told her. “Claims he never talked to you.”\\n\\n “He\u0027s lying.”\\n\\n “The boy is scared. He told me his big brother Samuel has been extorting John for years. Stealing the school\u0027s money is the final act.”\\n\\n Norma shivered, hugged her arms. “You\u0027re sitting on my coat.”\\n\\n Chadwick tossed it to her.\\n\\n She stepped into the room, pacing, her eyes on the floor. “I know about Samuel. The real story—that Katherine wasn\u0027t just getting drugs from him, that they were in love. I heard it last week, from David. He felt sorry for me, that I didn\u0027t know this about my own daughter. How do you think that made me feel?”\\n\\n A lowrider cruised by on San Angelo, the bass of its stereo loud enough to rattle the house\u0027s windows.\\n\\n “David Kraft is a disturbed young man,” Chadwick told her. “He wants the school razed, preferably with all of us inside.” \\n\\n","sourceLink":"https://allnovel.net/cold-springs/page-34.html","bookId":2423,"book":{"id":2423,"title":"Cold Springs","description":"Storyline: The death of a child ripples effects on all around her - whether accident, suicide, or murder. Katherine Chadwick 16 overdoses on heroin while babysitting little Mallory, daughter of her parents\u0027 best friends. Forward nine years to two ruined marriages. For a reform school in Cold Springs Texas, Kat\u0027s dad must capture Mallory, now 15 and in trouble.\\n","cover":"https://allnovel.net/images/cold-springs.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/cold-springs.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:35:07 PM"}}
