{"id":4421,"no":2,"title":"Chapter 2","content":"2:1 [hgb] 你 们 要 在 锡 安 吹 角 ， 在 我 圣 山 吹 出 大 声 。 国 中 的 居 民 ， 都 要 发 颤 。 因 为 耶 和 华 的 日 子 将 到 ， 已 经 临 近 。 [kjv] Blow ye the trumpet in Zion, and sound an alarm in my holy mountain: let all the inhabitants of the land tremble: for the day of the LORD cometh, for it is nigh at hand; [bbe] Let the horn be sounded in Zion, and a war-cry in my holy mountain; let all the people of the land be troubled: for the day of the Lord is coming; 2:2 [hgb] 那 日 是 黑 暗 ， 幽 冥 ， 密 云 ， 乌 黑 的 日 子 ， 好 像 晨 光 铺 满 山 岭 。 有 一 队 蝗 虫 （ 原 文 作 民 ） 又 大 又 强 。 从 来 没 有 这 样 的 ， 以 后 直 到 万 代 ， 也 必 没 有 。 [kjv] A day of darkness and of gloominess, a day of clouds and of thick darkness, as the morning spread upon the mountains: a great people and a strong; there hath not been ever the like, neither shall be any more after it, even to the years of many generations. [bbe] For a day of dark and deep shade is near, a day of cloud and black night: like a black cloud a great and strong people is covering the mountains; there has never been any like them and will not be after them again, from generation to generation. 2:3 [hgb] 他 们 前 面 如 火 烧 灭 ， 后 面 如 火 焰 烧 尽 。 未 到 以 前 ， 地 如 伊 甸 园 ， 过 去 以 后 ， 成 了 荒 凉 的 旷 野 。 没 有 一 样 能 躲 避 他 们 的 。 [kjv] A fire devoureth before them; and behind them a flame burneth: the land is as the garden of Eden before them, and behind them a desolate wilderness; yea, and nothing shall escape them. [bbe] Before them fire sends destruction, and after them flame is burning: the land is like the garden of Eden before them, and after them an unpeopled waste; truly, nothing has been kept safe from them. 2:4 [hgb] 他 们 的 形 状 如 马 ， 奔 跑 如 马 兵 。 [kjv] The appearance of them is as the appearance of horses; and as horsemen, so shall they run. [bbe] Their form is like the form of horses, and they are running like war-horses. 2:5 [hgb] 在 山 顶 蹦 跳 的 响 声 ， 如 车 辆 的 响 声 ， 又 如 火 焰 烧 碎 秸 的 响 声 ， 好 像 强 盛 的 民 摆 阵 预 备 打 仗 。 [kjv] Like the noise of chariots on the tops of mountains shall they leap, like the noise of a flame of fire that devoureth the stubble, as a strong people set in battle array. [bbe] Like the sound of war-carriages they go jumping on the tops of the mountains; like the noise of a flame of fire burning up the grain-stems, like a strong people lined up for the fight. 2:6 [hgb] 他 们 一 来 ， 众 民 伤 恸 ， 脸 都 变 色 。 [kjv] Before their face the people shall be much pained: all faces shall gather blackness. [bbe] At their coming the people are bent with pain: all faces become red together. 2:7 [hgb] 他 们 如 勇 士 奔 跑 ， 像 战 士 爬 城 ， 各 都 步 行 ， 不 乱 队 伍 。 [kjv] They shall run like mighty men; they shall climb the wall like men of war; and they shall march every one on his ways, and they shall not break their ranks: [bbe] They are running like strong men, they go over the wall like men of war; every man goes straight on his way, their lines are not broken. 2:8 [hgb] 彼 此 并 不 拥 挤 ， 向 前 各 行 其 路 。 直 闯 兵 器 ， 不 偏 左 右 。 [kjv] Neither shall one thrust another; they shall walk every one in his path: and when they fall upon the sword, they shall not be wounded. [bbe] No one is pushing against another; everyone goes straight on his way: bursting through the sword points, their order is not broken. 2:9 [hgb] 他 们 蹦 上 城 ， 蹿 上 墙 ， 爬 上 房 屋 ， 进 入 窗 户 如 同 盗 贼 。 [kjv] They shall run to and fro in the city; they shall run upon the wall, they shall climb up upon the houses; they shall enter in at the windows like a thief. [bbe] They make a rush on the town, running on the wall; they go up into the houses and in through the windows like a thief. 2:10 [hgb] 他 们 一 来 地 震 天 动 ， 日 月 昏 暗 ， 星 宿 无 光 。 [kjv] The earth shall quake before them; the heavens shall tremble: the sun and the moon shall be dark, and the stars shall withdraw their shining: [bbe] The earth is troubled before them and the heavens are shaking: the sun and the moon have become dark, and the stars keep back their shining: 2:11 [hgb] 耶 和 华 在 他 军 旅 前 发 声 。 他 的 队 伍 甚 大 。 成 就 他 命 的 ， 是 强 盛 者 。 因 为 耶 和 华 的 日 子 大 而 可 畏 。 谁 能 当 得 起 呢 ？ [kjv] And the LORD shall utter his voice before his army: for his camp is very great: for he is strong that executeth his word: for the day of the LORD is great and very terrible; and who can abide it? [bbe] And the Lord is thundering before his forces; for very great is his army; for he is strong who gives effect to his word: for the day of the Lord is great and greatly to be feared, and who has strength against it? 2:12 [hgb] 耶 和 华 说 ， 虽 然 如 此 。 你 们 应 当 禁 食 ， 哭 泣 ， 悲 哀 ， 一 心 归 向 我 。 [kjv] Therefore also now, saith the LORD, turn ye even to me with all your heart, and with fasting, and with weeping, and with mourning: [bbe] But even now, says the Lord, come back to me with all your heart, keeping from food, with weeping and with sorrow: 2:13 [hgb] 你 们 要 撕 裂 心 肠 ， 不 撕 裂 衣 服 。 归 向 耶 和 华 你 们 的 神 。 因 为 他 有 恩 典 。 有 怜 悯 ， 不 轻 易 发 怒 ， 有 丰 盛 的 慈 爱 ， 并 且 后 悔 不 降 所 说 的 灾 。 [kjv] And rend your heart, and not your garments, and turn unto the LORD your God: for he is gracious and merciful, slow to anger, and of great kindness, and repenteth him of the evil. [bbe] Let your hearts be broken, and not your clothing, and come back to the Lord your God: for he is full of grace and pity, slow to be angry and great in mercy, ready to be turned from his purpose of punishment. 2:14 [hgb] 或 者 他 转 意 后 悔 ， 留 下 余 福 ， 就 是 留 下 献 给 耶 和 华 你 们 神 的 素 祭 ， 和 奠 祭 ， 也 未 可 知 。 [kjv] Who knoweth if he will return and repent, and leave a blessing behind him; even a meat offering and a drink offering unto the LORD your God? [bbe] May it not be that he will again let his purpose be changed and let a blessing come after him, even a meal offering and a drink offering for the Lord your God? 2:15 [hgb] 你 们 要 在 锡 安 吹 角 ， 分 定 禁 食 的 日 子 ， 宣 告 严 肃 会 。 [kjv] Blow the trumpet in Zion, sanctify a fast, call a solemn assembly: [bbe] Let a horn be sounded in Zion, let a time be fixed for going without food, have a holy meeting: 2:16 [hgb] 聚 集 众 民 ， 使 会 众 自 洁 ， 招 聚 老 者 ， 聚 集 孩 童 ， 和 吃 奶 的 。 使 新 郎 出 离 洞 房 ， 新 妇 出 离 内 室 。 [kjv] Gather the people, sanctify the congregation, assemble the elders, gather the children, and those that suck the breasts: let the bridegroom go forth of his chamber, and the bride out of her closet. [bbe] Get the people together, make the mass of the people holy, send for the old men, get together the children and babies at the breast: let the newly married man come out of his room and the bride from her tent. 2:17 [hgb] 事 奉 耶 和 华 的 祭 司 ， 要 在 廊 子 和 祭 坛 中 间 哭 泣 ， 说 ， 耶 和 华 阿 ， 求 你 顾 惜 你 的 百 姓 ， 不 要 使 你 的 产 业 受 羞 辱 ， 列 邦 管 辖 他 们 。 为 何 容 列 国 的 人 说 ， 他 们 的 神 在 哪 里 呢 ？ [kjv] Let the priests, the ministers of the LORD, weep between the porch and the altar, and let them say, Spare thy people, O LORD, and give not thine heritage to reproach, that the heathen should rule over them: wherefore should they say among the people, Where is their God? [bbe] Let the priests, the servants of the Lord, be weeping between the covered way and the altar, and let them say, Have mercy on your people, O Lord, do not give up your heritage to shame, so that the nations become their rulers: why let them say among the peoples, Where is their God? 2:18 [hgb] 耶 和 华 就 为 自 己 的 地 发 热 心 ， 怜 恤 他 的 百 姓 。 [kjv] Then will the LORD be jealous for his land, and pity his people. [bbe] Then the Lord had a care for the honour of his land and had pity on his people. 2:19 [hgb] 耶 和 华 应 允 他 的 百 姓 ， 说 ， 我 必 赐 给 你 们 五 谷 ， 新 酒 ， 和 油 ， 使 你 们 饱 足 。 我 也 不 再 使 你 们 受 列 国 的 羞 辱 。 [kjv] Yea, the LORD will answer and say unto his people, Behold, I will send you corn, and wine, and oil, and ye shall be satisfied therewith: and I will no more make you a reproach among the heathen: [bbe] And the Lord made answer and said to his people, See, I will send you grain and wine and oil in full measure: and I will no longer let you be shamed among the nations: 2:20 [hgb] 却 要 使 北 方 来 的 军 队 远 离 你 们 ， 将 他 们 赶 到 干 旱 荒 废 之 地 ， 前 队 赶 入 东 海 ， 后 队 赶 入 西 海 。 因 为 他 们 所 行 的 大 恶 （ 原 文 是 事 ） ， 臭 气 上 升 ， 腥 味 腾 空 。 [kjv] But I will remove far off from you the northern army, and will drive him into a land barren and desolate, with his face toward the east sea, and his hinder part toward the utmost sea, and his stink shall come up, and his ill savour shall come up, because he hath done great things. [bbe] I will send the one from the north far away from you, driving him into a dry and waste land, with his front to the sea of the east and his back to the sea of the west, and the smell of him will go up, even his evil smell will go up. 2:21 [hgb] 地 土 阿 ， 不 要 惧 怕 ， 要 欢 喜 快 乐 。 因 为 耶 和 华 行 了 大 事 。 [kjv] Fear not, O land; be glad and rejoice: for the LORD will do great things. [bbe] Have no fear, O land; be glad with great joy; for the Lord has done great things. 2:22 [hgb] 田 野 的 走 兽 阿 ， 不 要 惧 怕 。 因 为 旷 野 的 草 发 生 ， 树 木 结 果 ， 无 花 果 树 。 葡 萄 树 也 都 效 力 。 [kjv] Be not afraid, ye beasts of the field: for the pastures of the wilderness do spring, for the tree beareth her fruit, the fig tree and the vine do yield their strength. [bbe] Have no fear, you beasts of the field, for the grass-lands of the waste are becoming green, for the trees are producing fruit, the fig-tree and the vine give out their strength. 2:23 [hgb] 锡 安 的 民 哪 ， 你 们 要 快 乐 ， 为 耶 和 华 你 们 的 神 欢 喜 。 因 他 赐 给 你 们 合 宜 的 秋 雨 ， 为 你 们 降 下 甘 霖 ， 就 是 秋 雨 ， 春 雨 ， 和 先 前 一 样 。 [kjv] Be glad then, ye children of Zion, and rejoice in the LORD your God: for he hath given you the former rain moderately, and he will cause to come down for you the rain, the former rain, and the latter rain in the first month. [bbe] Be glad, then, you children of Zion, and have joy in the Lord your God: for he gives you food in full measure, making the rain come down for you, the early and the late rain as at the first. 2:24 [hgb] 禾 场 必 满 了 麦 子 ， 酒 榨 与 油 榨 必 有 新 酒 和 油 盈 溢 。 [kjv] And the floors shall be full of wheat, and the vats shall overflow with wine and oil. [bbe] And the floors will be full of grain, and the crushing-places overflowing with wine and oil. 2:25 [hgb] 我 打 发 到 你 们 中 间 的 大 军 队 ， 就 是 蝗 虫 ， 蝻 子 ， 蚂 蚱 ， 剪 虫 ， 那 些 年 所 吃 的 ， 我 要 补 还 你 们 。 [kjv] And I will restore to you the years that the locust hath eaten, the cankerworm, and the caterpiller, and the palmerworm, my great army which I sent among you. [bbe] I will give back to you the years which were food for the locust, the plant-worm, the field-fly, and the worm, my great army which I sent among you. 2:26 [hgb] 你 们 必 多 吃 ， 而 得 饱 足 ， 就 赞 美 为 你 们 行 奇 妙 事 之 耶 和 华 你 们 神 的 名 。 我 的 百 姓 ， 必 永 远 不 至 羞 愧 。 [kjv] And ye shall eat in plenty, and be satisfied, and praise the name of the LORD your God, that hath dealt wondrously with you: and my people shall never be ashamed. [bbe] You will have food in full measure, and give praise to the name of the Lord your God, who has done wonders for you: 2:27 [hgb] 你 们 必 知 道 我 是 在 以 色 列 中 间 ， 又 知 道 我 是 耶 和 华 你 们 的 神 ， 在 我 以 外 并 无 别 神 。 我 的 百 姓 必 永 远 不 至 羞 愧 。 [kjv] And ye shall know that I am in the midst of Israel, and that I am the LORD your God, and none else: and my people shall never be ashamed. [bbe] And you will be certain that I am in Israel, and that I am the Lord your God, and there is no other: and my people will never be shamed. 2:28 [hgb] 以 后 ， 我 要 将 我 的 灵 浇 灌 凡 有 血 气 的 。 你 们 的 儿 女 要 说 预 言 。 你 们 的 老 年 人 要 作 异 梦 。 少 年 人 要 见 异 象 。 [kjv] And it shall come to pass afterward, that I will pour out my spirit upon all flesh; and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions: [bbe] And after that, it will come about, says the Lord, that I will send my spirit on all flesh; and your sons and your daughters will be prophets, your old men will have dreams, your young men will see visions: 2:29 [hgb] 在 那 些 日 子 ， 我 要 将 我 的 灵 浇 灌 我 的 仆 人 和 使 女 。 [kjv] And also upon the servants and upon the handmaids in those days will I pour out my spirit. [bbe] And on the servants and the servant-girls in those days I will send my spirit. 2:30 [hgb] 在 天 上 地 下 ， 我 要 显 出 奇 事 ， 有 血 有 火 ， 有 烟 柱 。 [kjv] And I will shew wonders in the heavens and in the earth, blood, and fire, and pillars of smoke. [bbe] And I will let wonders be seen in the heavens and on the earth, blood and fire and pillars of smoke. 2:31 [hgb] 日 头 要 变 为 黑 暗 ， 月 亮 要 变 为 血 ， 这 都 在 耶 和 华 大 而 可 畏 的 日 子 未 到 以 前 。 [kjv] The sun shall be turned into darkness, and the moon into blood, before the great and the terrible day of the LORD come. [bbe] The sun will be made dark and the moon turned to blood, before the great day of the Lord comes, a day to be feared. 2:32 [hgb] 到 那 时 候 ， 凡 求 告 耶 和 华 名 的 就 必 得 救 。 因 为 照 耶 和 华 所 说 的 ， 在 锡 安 山 耶 路 撒 冷 必 有 逃 脱 的 人 ， 在 剩 下 的 人 中 必 有 耶 和 华 所 召 的 。 [kjv] And it shall come to pass, that whosoever shall call on the name of the LORD shall be delivered: for in mount Zion and in Jerusalem shall be deliverance, as the LORD hath said, and in the remnant whom the LORD shall call. [bbe] And it will be that whoever makes his prayer to the name of the Lord will be kept safe: for in Mount Zion and in Jerusalem some will be kept safe, as the Lord has said, and will be among the small band marked out by the Lord.","sourceLink":"http://novel.tingroom.com/shuangyu/138/2044.html","bookId":153,"book":{"id":153,"title":"约珥书 Joel","description":"简介： 1:1 [hgb] 耶 和 华 的 话 临 到 毗 土 珥 的 儿 子 约 珥 。 [kjv] The word of the LORD that came to Joel the son of Pethuel. [bbe] The word of the Lord...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/138","creation":"Aug 1, 2019 12:18:20 AM","modification":"Aug 1, 2019 12:23:38 AM"}}
