{"id":42436,"no":14,"title":"CHAPTER XIII","content":"A FAITHFUL FRIEND For two days Ward Hill continued in no enviable frame of mind. He felt hurt and humiliated by the words of Mr. Crane, and also felt that he had been hard and somewhat unjust in his judgment. It was true that he had not referred to the disturbance in Ripley\u0027s room, but to Ward that seemed a trifling matter now. The struggle through which he was passing was uppermost in his thoughts, and before that, all else seemed insignificant and small. And to Ward Hill it was a struggle of no small character. The stand which near the close of the preceding year he had taken for Henry had brought upon him the enmity of his former associates, and they had succeeded not only in annoying him themselves, but also in creating a prejudice against him in the school. Henry, it was true, remained his true friend, but he was a boy who was never demonstrative, and Ward somehow felt the need of continued praise. In this particular he did not differ from other sensitive and bright lads; but in his own home and in the little village of Rockford, he had been so looked up to by all his associates that he had come to regard such feelings toward him as but his just and natural right. Jack Hobart\u0027s good will he highly prized and also prized more than he himself was aware all the good-natured references to the possibilities of his becoming the valedictorian of the class; but Ward Hill, like many another when he finds himself beset with perplexities and difficulties, was more prone to dwell upon his lacks than upon his possessions, and consequently he was thinking much more of the words of implied blame which Mr. Crane had spoken, than he was of the encouragement and appreciation he had received. And it was just because Mr. Crane thoroughly understood Ward that he had spoken as he did at the time of Ward\u0027s indirect statement. He had understood clearly that in the case which Ward had stated, he was speaking of himself. The disguise was very thin, and the teacher had listened attentively and with a full sense of what it all meant to the eager, impulsive boy. But he had also seen, what Ward himself had failed to see, that as yet he had not faced his situation with the true spirit. It was his vanity which was suffering more than his sense of justice and right. Eager for the praise of the boys and his teachers, he had not as yet come to perceive that there was something deeper, stronger, better. It was with no lack of appreciation of the efforts Ward certainly was making to do better work in his classes and to cut himself loose from the more disorderly elements of the Weston school, that Mr. Crane had spoken, but because he clearly perceived that as yet the troubled boy was governed only by his feelings, and that deep down below all his desires to improve there lay a motive which must be purified before anything like a radical or permanent change in his life could be produced. He had not failed to notice the pain his words produced, but as we are informed that \"faithful are the wounds of a friend,\" he had resolved for the sake of the boy, whom he sincerely loved and whose brightness he was in no wise backward in acknowledging, that what he needed most was not praise and sympathy, but frankness and a true picture of himself. Not the least of Ward\u0027s troubles arose from the fact that in his own heart there was a perception of the fact that the basis of all his regard for Mr. Crane was his confidence in the teacher\u0027s candor and sincerity. Ward felt that come what might Mr. Crane never said pleasing things just for the pleasure of saying them, or for the pleasure his praise might impart. In all this he was in marked contrast to Mr. Blake whose words of praise were so plentiful as to be cheap, and were bestowed so indiscriminately that they were slightly valued. Mr. Crane, on the contrary, was ever ready to speak a word of encouragement to any boy whom he perceived to be doing his best, but he never praised at the expense of truth. And perhaps it was because of the dim consciousness that there was too much truth in what he had heard, that Ward\u0027s bitterness was somewhat increased. He could not conceal from himself the fact that in the preceding year, when he had been received into the \"Tangs\" and made much of by a class of boys whose ideals, home training, and lives had been very different from his own, that he had been somewhat elated by the attentions he had received and that his manner and bearing toward the other boys in the school had gradually undergone a marked change. He had become somewhat overbearing and condescending in his dealings with them. He had assumed airs that did not become him and rejected many of the overtures of friendship that had been offered him. And as a consequence he had not gained them, and now he had lost the others. Did Mr. Crane know anything of that? Ward almost felt that he must, but the knowledge did not tend to increase his peace of mind at the time. In fact, Ward Hill wanted what he did not need, and needed what he did not want. For two days, as we have said, the struggle went on in Ward\u0027s soul. At times he would be bitter and hard, feeling that it made no difference what he attempted to do, the hand of nearly every one was certain to be against him. Then again, his better self would assert itself and he would be able to see things in their true light. To Henry he did not speak of his troubles. He worked faithfully and hard over his lessons, and knew that he was doing well in his classes; but somehow the knowledge did not bring him the satisfaction he had expected. He could not forget or ignore Mr. Crane\u0027s words, and the recollection of them was ever a disturbing element in his mind. When the two days had passed, he sought out Jack, having resolved to seek his opinion, half hoping that his friend, who ever had good words for all, would have something to say to him which would be a comfort to his troubled soul. It was in his room that he found his friend and after stating, as clearly and fully as he could recall, the conversation with Mr. Crane, he said abruptly: \"Now, Jack, I want you to tell me just what you think. Am I a prig, like Big Smith? Do you think Mr. Crane was right? Am I to blame for what\u0027s coming to me?\" \"Ward, I don\u0027t know,\" said Jack soberly after a brief silence. Ward felt hurt and somewhat humiliated by his friend\u0027s reply. He was so anxious to be absolved from all blame that he had eagerly looked forward to Jack as a consoler. And now Jack\u0027s manner, far more than his words, seemed to imply that he too thought something was wrong with himself. \"It seems to me,\" said Ward, unable entirely to conceal his disappointment, \"that a fellow who stands up for Henry as I did when the \u0027Tangs\u0027 got after him, isn\u0027t altogether bad. And why is Tim Pickard so down on me? If I\u0027d gone into his scrapes, or if even now I\u0027d go in again, he\u0027d be all right, and you know it. I\u0027d have my place on the nine and the fellows in the school wouldn\u0027t all be down on me as they now are.\" \"I don\u0027t know what to say to you,\" said Jack slowly. \"You know how I feel, old fellow, and there isn\u0027t a chap in the school who would be so glad to have you take the place I know belongs to you as I would. I know Tim\u0027s to blame, but then you know how it was with Big Pond. He didn\u0027t go in with Tim and the \u0027Tangs,\u0027 and yet there hasn\u0027t been a fellow in school for years whom every one liked as they did Pond. Now I know him and I know you, and for the life of me I can\u0027t see just where the fault lies.\" \"Only you know they liked Pond and don\u0027t like me.\" \"It isn\u0027t as strong as that. It isn\u0027t that the fellows dislike you, Ward. That isn\u0027t it.\" \"It\u0027s that they don\u0027t like me,\" said Ward bitterly, determined to say the words which he perceived that Jack would not. \"I think it\u0027ll come out all right, Ward, if you\u0027ll have patience and wait. It isn\u0027t very pleasant, I know,\" he hastily added as he saw an expression of pain and mortification sweep over Ward\u0027s face, \"but it\u0027ll all come right, I\u0027m sure.\" \"And meanwhile I\u0027m to sit still and bear it all like a martyr on a pole.\" \"No, not that--not that--but----\" \"But what?\" \"But I wish you\u0027d take a little more pains to make the fellows like you.\" \"Don\u0027t you remember, though, what the doctor said about the fellows that tried to do the popular act, how they never succeeded and the school was always down on them?\" \"Yes, I remember, and it\u0027s true too, but that doesn\u0027t mean that a fellow\u0027s not to take a little trouble to be agreeable--I mean to go out of his way. Forgive me, Ward. It hurts me worse than it does you, but you asked me the honest question and I\u0027m trying hard, honestly I am, to see a way out of it. Now there\u0027s Big Smith. He\u0027s never in a scrape. He doesn\u0027t know what the word mischief means, but then he isn\u0027t over popular, you know.\" \"Yes, I know; but I hope I\u0027m not like Big Smith. I suppose I\u0027ll have to take it out in being respected, even if I\u0027m not liked.\" \"That\u0027s where you\u0027re wrong, Ward. I tell you a fellow\u0027s got to be respected or he\u0027s not liked. He\u0027s got to have something the other fellows don\u0027t have or they don\u0027t look up to him and don\u0027t care much for him, either. No, sir! I don\u0027t believe a fellow can be respected and not be liked. Speaking of that, and the doctor\u0027s words, don\u0027t you remember what he said about \u0027speaking the truth in love\u0027? that it wasn\u0027t enough for a fellow to be true, and speak the truth too, for that matter, but that the way in which he did it counted for as much or more than what he said? I usually take a nap when the doctor gets to preaching, but I was thinking that morning and so kept awake.\" \"Thinking of me, maybe?\" said Ward, looking keenly at Jack as he spoke. \"Why, yes, to tell the truth I was thinking of you, Ward; but I fancy I\u0027d been in a good deal better business to have been thinking of myself.\" \"Jack, what would you advise me to do?\" \"I told you, Ward, I don\u0027t know what to tell you. Still, if you want me to, I\u0027ll tell you one or two things I\u0027ve thought of.\" \"Go ahead,\" said Ward, striving to appear calm, though there was a sinking of the heart as he spoke. \"Well, to begin with, old fellow, there isn\u0027t a boy in the class who can learn his lessons with as little work as you can. Why, you can see right through a thing that takes my old head an hour to find out. But, Ward,\" he added hesitatingly, \"I\u0027ve sometimes thought you were a little quick to poke fun at the fellows who are not so quick-witted as you are. And then you aren\u0027t over ready to give a fellow a lift when he\u0027s in trouble. Now, for example, there\u0027s Big Smith. I saw him come up to you before class yesterday and say, \u0027Ward, how do you translate this passage?\u0027 And maybe you remember what you said to him.\" \"No, I don\u0027t,\" replied Ward. \"He\u0027s such a shirk I\u0027ve no patience with him. What did I say, Jack?\" \"Why you turned him off with a curt, \u0027How do I translate that place? Why, I translate it right,\u0027 and then you turned on your heel and walked off.\" \"But I don\u0027t want to drag Big Smith through by letting him hang on to my coat tails. I work to get what I have, and why shouldn\u0027t the other fellows work too, I\u0027d like to know? Every tub ought to stand on its own bottom.\" \"That\u0027s all true enough, but it wouldn\u0027t cost you anything to give another fellow a lift; you can do it too, I know, for you\u0027ve lifted me right out of the mire every time I asked you.\" \"Yes, but I like you, Jack.\" \"But I thought it was of the other fellows and the school you were talking just now.\" \"So I was, Jack,\" replied Ward slowly. Perhaps he was beginning to see what his friend had in mind. \"But go on, give me another. I\u0027m good for it.\" \"Well,\" said Jack hesitatingly, \"I\u0027ve thought about the nine, Ward. Henry and I were perfectly willing to keep off till they\u0027d take you on, but you wouldn\u0027t have that.\" \"No, sir! I\u0027d never go on the nine if I had to get on in that way.\" \"That\u0027s all right and I don\u0027t know that I blame you, though I think by a little squeezing Tim would have come around all right. But I did think you might have gone on the scrub.\" \"Go on the scrub!\" said Ward quickly. \"What? Go on the scrub when I\u0027d been put off from the nine? Not much! Not as long as the court knows itself.\" And Ward rose from his seat and in his anger began to pace back and forth in the room. \"You don\u0027t see what I\u0027m driving at. Now it looks to me like this. If you\u0027d taken the thing good-naturedly and made out that you weren\u0027t hit so hard, I think the most of the fellows in the school would have taken your part in no time. As it is, you just keep away from them, and if Tim tells them that you\u0027ve gone back on everything, why they don\u0027t know but it\u0027s true, you see. Now if you\u0027d swallowed your pride and gone in with the fellows, whether you were on the nine or not, why it wouldn\u0027t have been any time before every one of them would be willing to swear that you were one of the best fellows in the school, as well as one of the best players, and Tim would be forced to give you back your place. Ripley has it now, but he doesn\u0027t size up to your knees, when it comes to playing ball.\" \"Yes, but think what Tim Pickard would say if he should see me on the scrub nine. He\u0027d think he\u0027d got me just where he wanted me, and that I was all cut up about being put off the nine, and was trying to force my way back again.\" \"Tim might be a little disagreeable at first; but you know if you braced up and either laughed at him or paid no attention to what he said, how soon he\u0027d cool off. Now look here, Ward, how many times has your room been stacked since we had our little interview with Timothy down at Ma Perrins\u0027?\" \"Not once.\" \"Exactly. And if you meet Tim and the boys in the same way down on the ball ground you\u0027d see how soon he\u0027d crawl there. Oh, I know Tim Pickard all the way up and all the way down, from the top of his head to the sole of his foot.\" \"But, I don\u0027t want to get on the nine in any such way,\" protested Ward. \"Never mind the nine, just come down and go in with the fellows, that\u0027s all I\u0027m telling you. You can\u0027t run off up to the glen or away off to the Hopper, and think all the school is going to come trailing after you. If you\u0027re going to catch fish, you\u0027ve got to go where the fish are, haven\u0027t you? And if you think the fellows are all down on you, you can\u0027t fix things straight by going off and talking with the whispering breezes and echoing hills, and all that sort of stuff.\" Ward soon departed and went to his own room. His heart was smarting from the effect of Jack\u0027s words, but somehow he could not feel angry with him. Who could? The light-hearted, generous lad made friends on every side, for no one could long withstand his sunny ways. That night Ward sat for a long time at his study table, with his head resting upon his hands and his books unopened before him. He was thinking of Mr. Crane\u0027s words and what Jack had said. At last he arrived at a quick decision, and with the decision once made he opened his books and resolutely began the preparation of his lessons for the following day.","sourceLink":"http://novel.tingroom.com/jingdian/1607/47650.html","bookId":1250,"book":{"id":1250,"title":"Ward Hill the Senior","description":"简介： A school has been very correctly termed a little world of itself. Within it the temptations and struggles and triumphs are as real as those in the larger world outside. They differ in form, not in character, and become for many a man the foundation u...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1607","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
