{"id":32287,"no":14,"title":"CHAPTER XIV.","content":"The coming of Mr. Clem had a great effect upon our household. It was like a new breeze, blowing in from afar off where the woods are fresh. With his foot he was ever ready to press upon a tradition, and to leave off if the annoyance was too great; he experimented constantly with the sentiments and prejudices of anyone who happened to be near him. He joked with Old Miss, something ever dangerous to undertake, and at times he wrought sorely upon Old Master by arguing abolition with him. But no matter how hot might be the discussion, it was always pleasantly tempered, in the end, by some joke borrowed from the sturdy men who were busy with the building of a new political empire in the West. Lincoln was his hero. He had lived in Springfield, and had seen the great stump-speaker striding across a pasture land with a naked youngster on his back, and with the Galilean\u0027s smile upon his face. From his saddle-bags he brought forth newspapers with abstracts of the backwoodsman\u0027s speeches, words that rang like an axe on a frosty[Pg 121] morning, and he never was weary of declaring that the man was inspired. \"He is Peter come back to the earth,\" I remember hearing him say, \"and upon a rock he is going to build a great church not for caste, but for man.\" \"If you are going to worship a man, let him be a hero,\" Old Master cried. We were in the library and the elder brother was walking up and down in the fire-light. I was hunting a book for Young Master and purposely made a lag of my errand. \"I don\u0027t know what you mean by a hero,\" said Mr. Clem, looking up from his pipe in the corner. \"A man who does something for his country,\" Old Master retorted, still walking with his hands behind him. Mr. Clem smiled. \"Yes, that is a hero,\" said he. \"But what would you have a man do? Overcome a band of Mexicans and win a new territory, or save his entire country?\" Old Master halted, posing to make an impressive reply, but at that moment Mr. Clem sprang to his feet, threw open the window and thrusting forth his head shouted: \"Hi, there, don\u0027t you want to swap that horse for a better one?\" He had heard the sounds of hoofs and had seen a[Pg 122] man riding past the gate. The man reined up and looked round. \"I don\u0027t know but I might,\" he answered. \"Well, just wait a minute,\" Mr. Clem shouted and turned about to leave the room. Old Master frowned. \"You are not going to swap horses here on a Sunday morning,\" he said. \"It will bring a scandal upon us.\" \"Now, Guilford, that\u0027s nonsense,\" Mr. Clem protested. And then he shouted again from the window: \"Ride on down to the end of the lane and I\u0027ll meet you there.\" He hastened away, and just before dinner he came back leading a trim horse, so much better than his old nag that his brother racked himself with a loud laugh. His shrewdness was indeed remarkable. He came to us on a woolly-looking plow horse, and before he was in the neighborhood two months, he was the owner of three as fine mares as I have ever seen. The negroes looked upon him in the light of a vastly superior being, and about the fire at night they told tales of his marvelous power. He would permit none of them to call him master, and at first this told against him, bespeaking as they thought a very humble station; but their prejudice was overturned when they perceived that among the high-born he could hold his[Pg 123] head with a lofty pride. Sometimes he talked in a way almost to chill my blood. I have often mused upon his meeting me one evening as I strolled along the shores of the little creek, listening to the music bursting with more boldness as the twilight settled down. Spring was come and I smelt the smoke of the dead grass burning in the fields. I had halted and was standing on a rock when he came up to me. \"Fishing?\" he asked. \"No, sir; listening to the water.\" \"And yet they tell us that the negro has no soul,\" he said. \"No gentleman has ever told me that,\" I ventured to reply. \"No,\" he rejoined, stepping upon the rock. \"The gentlemen acknowledge your soul so that the pulpit may continue to hold you in slavery. I know that you and Bob are great friends, know all that, but if I were in your place I would leave.\" \"Mr. Clem!\" I cried. \"Yes, I would. Here, you are a young fellow of parts waiting for what? Nothing. Why, you could go North and make a man of yourself.\" \"I am going to make a man of myself as it is,\" I replied, actually trembling. [Pg 124] \"Make a man of yourself for someone else. Young man, the world is becoming too enlightened to permit of slavery much longer. They tell you that God made slaves. That\u0027s an insult to the Almighty. I don\u0027t really advise you to leave your master, for I can see that Bob makes your bed as easy as it could well be made; but it is an infamous shame that a young man as intelligent as you can have nothing but a life of bondage to look forward to. It is true that as compared with the others, you walk on rose-buds and sleep on feathered palm, but you are a slave for all that.\" He moved up closer to me, put his hand on my shoulder and turned me about as if in the growing darkness he would study the expression of my face, the effect his words had wrought. I trembled under the light weight of his hand, for it was as if freedom from afar off had touched me; but I could give no ear to this bold man\u0027s suggestion. I had read many a book conceived by great minds that abhored servility, poets that had shaken their fists in the faces of the earth\u0027s annointed, orators whose last utterances were cried aloud for the freedom of man, not the white man alone, but man. All my life I had been tapping upon the head the ambitions that arose within me, killing them and seeing their skeletons bleach in the desert of my[Pg 125] fancy; and with a stout and determined heart I could have turned my back upon Old Master, for his years were nearly spent; but I could not leave the young man, though the incense of freedom filled my nostrils. Not many miles away flowed the Ohio River. Beyond that stream were thousands of people who would be glad to help me, would regard it a duty which they owed to their religion; and farther away was a British domain, where all men were free—the way was clear, but in that direction I could not have stirred from that rock. My heart was my real master. \"Mr. Clem,\" said I, and I must have sobbed, for he turned away to hide his own face, \"I may be a fool, but I cannot be a traitor to my affections. I wear a chain, but it is made of gold, and I would rather exchange it for one of iron than to know that Bob Gradley had lost confidence in me. I know that I could amount to something in the world—I feel it; I am convinced that I could go to the North and help free the wretched creatures in the far South, but I should have to speak against my Young Master and that I could not do.\" He caught my hand with a tight grip, and I continued: \"I value your kindness; I know that it is genuine, but I must ask you not to tempt me again.\" [Pg 126] And still harder did he grip my hand as he replied: \"There is a salt of the earth and it never loses its savor, and you are of that salt. If you had come to me and begged me to point out the road to freedom, I might have sent you to your Master; your fidelity and strength caused me to speak to you in your behalf. But I did not know the full measure of that strength and fidelity. I know now and I honor you. But keep to your books; the time will come.\" Suddenly he broke away and turned on a trot toward the turn-pike, not far off. I heard the hoofs of a horse beating on the hard macadam, and soon I heard this queer man shout, \"Hi, there; who ever you are. Hold on a minute. Believe I can give you a better horse for the one you are riding.\" The hoofs fell slower, and a voice replied: \"That you, Clem Gradley? Don\u0027t want to transact that sort of business with you—Came in one of having to walk after the last swap. Another whet and I couldn\u0027t more than crawl.\" The hoofs fell faster and Mr. Clem, chuckling mirthfully, returned to the rock. It was now quite dark and I could not see his face, but I knew that he was in favor with himself, for he had clapped his hat on the back part of his head (a good-humored bravado [Pg 127]characteristic of him) and continued to shake with joviality. \"I think that was Lige Berry,\" he said. \"They told me that he had nipped everybody in this county, but I guess I skinned him a little. That\u0027s the way to do, Dan. When they try to skin you, skin them. Suppose we go on toward the house? Yes, sir-ree,\" he continued as we walked along, \"skin the skinners in a horse trade. And skin anybody else for that matter. Everything is fair in a horse trade—you\u0027ve got to be slick and believe nothing. I remember starting out once on an old mule. I had owned a steamboat and it had burnt up without a copper of insurance. I thought I\u0027d make my way to St. Louis and there get something to do. A captain offered me passage on his boat, but I told him no, that I would try the luck of going overland. Well, as I tell you, I set out on that old mule, bought on credit for twenty-three dollars. I was a long time on the road, months, I might say, but when I got to St. Louis I drove in about as fine a lot of horses as you ever saw. And three weeks afterward I steamed up the Illinois River on a boat of my own. I swapped it for a stock of goods in old Salem—always somebody in that town ready to swap off his store, knowing that he couldn\u0027t get the worst of it—and I[Pg 128] staid there until I went broke. I don\u0027t know why I never could hold on to anything. I am great up to a certain point, and then I go to pieces. Why, if I had owned this farm I would have made it three times as large and then lost it all. I\u0027ve done most everything except to sponge on people, and I never could do that. Set up a drug store in a little place called \u0027Prophet\u0027s Town\u0027 on Rock River. Didn\u0027t know anything about drugs—helped a feller too liberally to something his prescription called for and poisoned him. He didn\u0027t die, but I thought it was time for me to get out of that sort of business. Yes, and I practiced law. Didn\u0027t know anything about law, but I could talk. Defended a feller and they hanged him. Of course that might have happened with anybody—with Lincoln himself, for that matter—but a prejudice was raised against me. It tickled Lincoln. Of course he didn\u0027t want to see the man hanged, but he had to laugh at me. \u0027Gradley,\u0027 he said to me shortly afterward, \u0027I want you to do me a favor. I have an enemy, a man that has always stood in my path, and I want him removed. You can do it. I will have it whispered about that he is a thief; you defend him and they\u0027ll send him to the penitentiary for life!\u0027\" The supper bell was now ringing and I hastened[Pg 129] into the house to take my place behind Young Master\u0027s chair. He had many a time commanded me to leave off this useless act of servitude, but such a favoritism would have inflamed Old Miss against me, so I insisted upon a continuance of the office. Old Master and Old Miss were Hard-Shell Baptists and at supper there was present an old and honored exponent of that faith, Elija Brooks. He visited us often, but Bob and I had a stronger cause than this to call him to mind. Once we had taken his rubber overshoes and made a town-ball of them and had been severely whipped for our enterprise. The old gentleman refused to erase this, our act of meanness, from his mind, and whenever he looked at me I felt that my soul was surely lost. Upon this visit he was in higher spirits. Out in his neighborhood, we were soon informed, a man discovered to be an abolitionist had been tarred and feathered, an example of God\u0027s avenging wrath; and the old man\u0027s mouth appeared to water with the delicious recollection of the sight. \"They came to my house,\" he said as he passed his plate for a Shanghai rooster\u0027s breast, \"and asked my opinion in case the fellow was found guilty. I took down the good book and sought instruction, and I think that I[Pg 130] modified his punishment when I recommended tar and feathers. Ah, Brother Guilford, the ways of the devil are many and sly; we must keep a constant lookout for him.\" \"He is never idle a moment,\" said Old Miss with a sigh. Old Master didn\u0027t say much. He wasn\u0027t a very strong believer in the devil, and but for his negroes and his blue-grass land, he had surely been turned out of the church for saying, in the midst of a God-loving assembly upon his own veranda, \"the devil be damned!\" \"What had the man done?\" Mr. Clem asked, and I saw his face harden. \"Why, sir,\" returned Mr. Brooks, \"he had openly set our institutions at defiance and proclaimed abolition. He said that no Christian could own human flesh and blood.\" \"Had he been in the community very long?\" Mr. Clem asked. \"Several years,\" the preacher answered. \"And there comes in a strange part of the affair,\" he continued. \"He had lived among us for that length of time and had never been known to steal anything or to commit any sort of depredation.\" [Pg 131] \"Marvelous,\" Mr. Clem cried, setting his cup violently upon the table. \"Hadn\u0027t stolen anything! Why, sir, I expected you to tell me that he had murdered women and children.\" The unsuspecting preacher was deeply moved by the earnestness of Mr. Clem, but Old Master slily shook his head as a warning not to go too far, and Old Miss cleared her throat. \"It is a thousand wonders,\" Mr. Brooks went on, \"that he had not committed murder; and now it comes to mind that certain little pilferings throughout our neighborhood may justly be laid to him.\" \"No doubt of it,\" Mr. Clem cried. \"It is at least a well-founded suspicion,\" said the preacher. \"He ought to be burned at the stake!\" Mr. Clem shouted, and the preacher, his suspicions aroused at this outbreak of vehemence, looked searchingly at the man from the West. \"I would not advise quite so stringent a measure,\" said he, turning his eyes upon Old Master and then directly his gaze again at Mr. Clem. \"Oh, yes,\" Mr. Clem insisted, \"I would even go further than that. I would burn him at the stake and if he has any children I would skin them for the delight[Pg 132] of the Sunday school. But I forget. Your denomination has no Sunday schools.\" \"Sir,\" said the preacher, \"I will waive your sarcasm to refute your attack upon my church,\" and he had squared himself to deliver a harangue when Old Master struck the table with his fist. \"I want an end of this right now,\" he snorted, shaking his head, and with his nose looking more than ever like an eagle\u0027s beak. The preacher took no part of this reprimand to himself; indeed, he struck in with an approval of Old Master\u0027s violence. \"You are scarcely expected to restrain yourself, Brother Guilford,\" said he. \"The Lord has not asked us to put up with everything, and most of all with sentiments that seek the destruction of our country.\" Is it not singular, I must stop to reflect, that only a few years ago a large part of our country believed that liberty and prosperity depended upon slavery? This old preacher I knew to be an honest man, a God-serving and a generous man. His plantation was large, his soil strong, his crops bountiful, and he gave nearly everything to the poor; but, viewing him in the broad light of to-day, his heart was narrow and his soul was blind. Such was the atmosphere in which we lived, beautiful and romantic, but filled with an[Pg 133] inflammable gas; and one hot word would serve to set it off. I remember that at a store not far from our house a man sat on a box, reading the \"New York Tribune.\" A deputy sheriff, standing near, discovered the name of the publication, tore it from the man\u0027s grasp, threw it upon the ground, spurned it with his foot and swore that he would shoot the person who attempted to take it up. The paper was not taken up, but the question was discussed at the polls, and the deputy was elected sheriff. Still the wise men in the East were at work quietly with the pen which soon should be supported by the sword. Conversation that evening fell pleasantly enough, after Old Master\u0027s forceful veto, and out upon the veranda where the air was soft they sat until a late hour, Young Master with them, and I, seated on the steps. Mr. Clem sang a dolefully-comic song, \"The State of Illinois,\" which moved the preacher to gracious laughter, and Old Master told many a humorous story. But in the height of this pleasantry Old Miss broke in with the trouble that was hers, one daughter dead and the other married and gone afar off. This I thought was to tell the preacher that it was time to pray and go to bed. And he must have accepted it as a hint, for shortly afterward he said: \"Brother Guilford, let us[Pg 134] pray!\" Then came a solemn shuffle as they followed the preacher to his knees. I was included in the invitation to ask God to help me and I knelt upon the stone walk at the bottom of the steps. From a distance came the song of the ignorantly-happy negro; I heard the opening notes of a pack of hounds on a hill-side far away, and the creek lifted its voice in a sweeter prayer than man could utter. The preacher implored the Lord to bless Old Master\u0027s household, white and black; to hasten the day when the holy word of the Savior should be acknowledged throughout the earth. He prayed that all evil might be stricken from the sin-inclined mind of man; that the benighted politician who strove to prevent the admission into the union of more slave territory might be persuaded to see the error of interfering with the progress of the South, and closed with asking God to bless all mankind. The hanging lamp in the hall had been lighted, and as the old preacher passed under it I could see from where I now stood on the veranda that he tottered with emotion, so fervent had been his supplication; and I thought of the prayers in another part of our country; the gray men imploring our Father to hasten the time when the chain should drop from the slave. Ah, man, self-appointed keeper of the Maker\u0027s seal, you pray[Pg 135] that your brother may be cleansed and then you shoot him. But I will not moralize against you, for I am earthly enough to believe that war is sometimes a blessing, that the world\u0027s greatest progress has been sprinkled with blood—blood, the emblem of the soul\u0027s salvation. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3303/90312.html","bookId":423,"book":{"id":423,"title":"My Young Master","description":"简介： This is the story of a master, told by his slave. As I sit now, after the flight of so many years, and gaze at the pictures in the firethe hills and the valleys of my boyhood, so bright, so glowingI am oppressed with the fear that my rude hand can bu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3303","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
