{"id":32300,"no":27,"title":"CHAPTER XXVII.","content":"How sadly were dashed the hopes of the husband and the lover who had expected not a war, but a military demonstration to last but a few days. The cheerful party of decorated pleasure seekers soon became a sober army, stripped of feathers, bent upon the shedding of blood. I may be pardoned this egotism, but it seemed that the South, more Anglo-Saxon, more American, fought with brighter fire and bravery than the miscellaneous nationalities gathered in the North. I know one thing, that the Southern soldier held the foreigner in contempt. He had, however, to face too much of his own blood. But I am going to follow the fortunes of no campaign; I am going to be as brief as possible. My Master was promoted for gallantry, and soon was placed at the head of a regiment of cavalry. I rode by his side, and I knew that beyond that blue line, away over yonder, my freedom and the freedom of my down-trodden race was lying, but I was true to him, and was proud of him. Letters from home were very irregular. Old [Pg 282]Master did not write. Old Miss wrote; but never came there a word for me. I wrote to Titine, but no answer reached me. Sometimes, at night, alone in the tent, master would read aloud Miss Potter\u0027s letter, and though the words were affectionate, they appeared to me to be mechanical and meaningless. But to him each sentence was a string of pearls. For a time the Confederate arms were so successful that it looked as if the war might soon close, with victory for the South. But a change came. The old Puritan stock, the old blood that humbled a king and cut off his head, gathered in solemn and God-serving force. We had chaplains and held services; we prayed to God to bless our cause, but the Puritan mixed prayer with his powder and brightened his sword with a scriptural text. We went with Bragg\u0027s invasion into Kentucky. How joyous it was again to turn our faces toward home. We did not think of the blood that was to flow at Perryville. One day we halted within fifteen miles of Old Master\u0027s house. And Young Master received permission to visit his home. We set out at night. First we were to go to Potter\u0027s. We were cautioned to be back by day-light, to overtake the army at a place called Elwood. The night was moon-flooded.[Pg 283] The turn-pike looked an endless strip of light. How delightful to see the first familiar object, an old mill where Bob and I had caught many a sun-fish. Now we were but a short distance from Potter\u0027s. We passed the toll-gate. The bar was up and no one came out. We met an old negro and he told us that the people had nearly all flocked to town, that they had been ordered in as a battle was expected. \"Here we are!\" Bob cried, and he jumped from his horse in front of Potter\u0027s house. A dog barked, but there was no light. He went to the front door and the sharp fall of the brass knocker resounded afar off, throughout the stillness of the night. He called me and I went to him. \"I believe they are gone, too,\" he said, his voice choking with disappointment. \"Let us go around and see if we can find anyone.\" We went to the cabins in the rear of the house. All was dark. We mounted and rode on toward home, silent, desolate with the realization of war\u0027s uncompromising demands. I heard the creek and my heart leaped. We turned into the lane. The gate was down and heavy artillery had cut the road into deep ruts, here where Dr. Bates had lain under the eye of the law. [Pg 284] \"They are all gone, too,\" said master, \"negroes and all.\" \"No,\" I cried, \"there\u0027s a light in your room.\" We put spurs and dashed up to the gate. The front door stood ajar. There was no light in the hall. \"Easy,\" said Bob, and we tip-toed up the stairs. A light streamed under the door of our \"office.\" We did not knock, but Bob shoved the door open. Then he sprang back with pistol in hand. \"Why, helloa!\" a voice cried. It was Mr. Clem. \"Come in, boys.\" He stood there in the uniform of a Federal colonel, his sword on the table. We shook hands and the greeting was one of unaffected warmth. We sat down, though not yet over our surprise. \"How on earth did you get here?\" Colonel Clem asked. \"The country is full of our troops. You took a big risk. Sorry the folks are not here. Had hard work in driving Brother Guilford in. Swore he\u0027d stay here and let them knock the house about his ears. But, how well you\u0027re looking, my boy. Make a nice prisoner for me to take in, eh?\" Bob touched the butt of his revolver and smiled. Colonel Clem nodded goodhumoredly. \"Bobbie, so far as we are now concerned,\" said he, \"there is no[Pg 285] war. But haven\u0027t we had a time? Told you it wouldn\u0027t be a picnic. Come, don\u0027t be sad.\" \"When did \u0027she\u0027 go to town?\" \"To-day,\" the colonel answered. \"I saw her about noon-time. She is more beautiful than ever; said she had a charming letter from you not long ago. I have been over in Missouri a good deal of the time lately,\" he added with a strange smile. \"Had a piece of the past thrust into my face, while I was there. A fellow had been court-martialed and sentenced to be hanged. I met the guards as they were taking him out. My old-time negro-trader, the man that robbed me years ago. It was hardly the same sort of court that he had escaped from in Illinois. What did I do? I ordered them to halt—I ran to the commander and begged him to let me have that fellow. I wanted to kill him with my sword. But they wouldn\u0027t let me, so I had to content myself with seeing him hanged. What sort of stock are you boys riding? Now, I\u0027ve got a good mare here that I think would just suit you, Bob. But I don\u0027t want any Confederate money. Come down and let\u0027s see what can be done.\" Bob shook his head and laughed. \"I am to get back to my command by daylight, Uncle Clem,\" said[Pg 286] he, \"and I know that if I should trade horses with you, I\u0027d have to walk.\" \"What nonsense. I want to see you on a good horse. Come on.\" \"No, I thank you.\" \"Let me show you the mare.\" \"Don\u0027t want to see her.\" \"She\u0027s a beauty—got her from General Buell.\" \"Take her back to him. I don\u0027t want her.\" \"All right,\" he said, with a loud laugh, \"Got your eye teeth, haven\u0027t you. Well—what was that? A bugle.\" \"Come,\" said Bob, starting toward the door. But he halted. \"Uncle Clem, give my love to them all. Tell the old man that I love him.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3303/90325.html","bookId":423,"book":{"id":423,"title":"My Young Master","description":"简介： This is the story of a master, told by his slave. As I sit now, after the flight of so many years, and gaze at the pictures in the firethe hills and the valleys of my boyhood, so bright, so glowingI am oppressed with the fear that my rude hand can bu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3303","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
