{"id":34655,"no":5,"title":"CHAPTER V. VAN ZWIETEN SHOWS HIS TEETH.","content":"This unexpected piece of evidence caused Brenda no little uneasiness. She reflected that the man with the crape scarf had so closely resembled her father as to be mistaken for him, and then she remembered how her father had refused to give any information concerning this double of his. There was also the fact of his avowed hatred of Malet. Do what she would, she could not rid herself of the idea that through this third person, so like himself, her father was in some way connected with the murder. And little as she loved him, the thought of it shocked and terrified her. She told Harold what had passed between them in the study, and unbosomed herself of her suspicions to him. In reply he asked her a few straightforward questions. \\n\\n \\n\\n \"Did your father refuse to speak of this man, Brenda?\" \\n\\n \\n\\n \"Absolutely. He sent me out of the room.\" \\n\\n \\n\\n \"He was uneasy?\" \\n\\n \\n\\n \"More than uneasy,\" said the girl, with emphasis; \"he was terrified. There is great mystery in all this, Harold. In some way my father is connected with this man. For all I know, he may be a relative. I am very ignorant of my family history.\" \\n\\n \\n\\n \"H\u0027m! Have you seen your father this morning?\" \\n\\n \\n\\n \"No. He did not come to breakfast, and I did not go to his study, knowing that he dislikes to be disturbed.\" \\n\\n \\n\\n \"Well, we must go to his study now,\" said Harold, rising, \"for I am sure that the man with the crape scarf killed Malet, and your father may be able to throw some light on the subject.\" \\n\\n \\n\\n \"Harold, you don\u0027t think my father----\" \\n\\n \\n\\n \"Who can tell? Brenda, we must face the facts, and see him. In any case I am the only person who knows about this scrap of crape, and I shall keep the information to myself. Now, come along, dear, and let\u0027s hunt him up.\" \\n\\n \\n\\n When they reached the study they found it empty. On the table lay a note for Brenda in her father\u0027s handwriting. It informed her very curtly that he had gone up to London for the day and would return that same evening. Harold looked grave, and Brenda was perplexed. It was so unexpected. Mr. Scarse seemed to be doing all he could to heap suspicion on his own head. \\n\\n \\n\\n \"Does he usually go off in this sudden fashion?\" asked Captain Burton. \\n\\n \\n\\n \"Yes and no. Sometimes he tells me, sometimes he leaves a note. After all, Harold, we may be altogether mistaken. Perhaps father knows nothing at all about it.\" \\n\\n \\n\\n \"I hope so, Brenda. But from what you say he certainly knows this man, and it is strange there should be such a striking resemblance between them. The scrap of crape might easily have been torn off the scarf in the struggle.\" \\n\\n \\n\\n \"But there was no struggle,\" said Brenda, eagerly. \"I saw Mr. Malet for one moment when the lightning flashed; the next I heard a cry, and it was followed at once by a shot. There was no time for a struggle.\" \\n\\n \\n\\n \"You heard the cry first, and then the shot?\" \\n\\n \\n\\n \"Yes. The shot must have killed the poor man at once. He did not cry again.\" \\n\\n \\n\\n Harold reflected. \"I saw Dr. Lincoln this morning at the Manor,\" he said slowly. \"He deduces from the blackened skin and singed hair that the shot must have been fired at close quarters. Now, if the murderer saw Malet by that lightning flash, and was close at hand, he no doubt sprang forward and clutched the poor devil\u0027s arm while he placed the muzzle of the weapon at his temple. In that case Malet would utter a cry and the next moment drop dead. In his agony he might have gripped at the crape scarf, and have torn off the piece I found clenched in his hand.\" \\n\\n \\n\\n \"That is all purely hypothetical,\" said Brenda, fighting against her doubts. \\n\\n \\n\\n \"I know it is. But it seems to me the only way to account for your hearing the cry first, and for this piece of crape being in the hand of the corpse. Depend upon it, Brenda, your father can throw some light on the subject. Well, as he\u0027s gone to town, there\u0027s nothing for it but to wait till he comes back. Meanwhile I won\u0027t say anything about the piece of crape to any one.\" \\n\\n \\n\\n \"And what are you going to do now?\" she asked, as he moved toward the study door. \\n\\n \\n\\n \"Return to the inn. I should like to know if any one else saw this stranger, and if they mistook him, as I did, for your father.\" \\n\\n \\n\\n \"Harold, Harold, do be careful,\" implored Brenda; \"we may be misjudging father altogether, dear. Don\u0027t, I beg of you, get him into any trouble.\" \\n\\n \\n\\n \"On the contrary, dear, my object is to get him out of trouble. If I don\u0027t succeed in arriving at some explanation of this queer confusion of identities the police may take it up. Then it would be dangerous. Good-bye, dear; I shall be back shortly.\" \\n\\n \\n\\n Brenda waved her hand as he left her, and returned to the study. She was filled with ominous foreboding, and trembled at the thought of possible complicity on the part of her father. His pronounced hatred of Malet, his agitation at the mention of the stranger, the odd idea of the crape scarf worn by the supposed criminal, and the morsel of it in the dead man\u0027s hand--these things collectively formed a mystery which Brenda could not fathom. \\n\\n \\n\\n She looked again at the note which intimated that her father had gone to town, and from the straggling, scratching character of the handwriting she gathered that he must have been greatly agitated when he wrote it. Afterward she went to the kitchen, and skillfully questioned Mrs. Daw and Tilda about their master\u0027s departure. Both declared that he had said nothing to them about it. It seemed likely, then, that he had made up his mind on a sudden impulse and gone off in a hurry. \\n\\n \\n\\n Brenda wondered vainly what it could all mean, and then rebuked herself severely for her suspicions. After all, her father would no doubt be able to give good reason for his hurried departure when he returned; the surrounding circumstances, strange as they were, might prove to be all that was natural and obvious in the light of what he would have to say. \\n\\n \\n\\n The dawn had brought wisdom to Mrs. Daw and the housemaid too, for they no longer spoke of giving notice. They were chattering like parrots about the murder, many exaggerated and wholly imaginary details of which had been supplied by butcher, baker and milkman. But Brenda learned that as yet no one was definitely suspected of the crime, and that the villagers were hopelessly bewildered at its committal. \\n\\n \\n\\n About the stranger no word was said; and somewhat relieved in her mind, Brenda gave her orders for the day, and returned to the study. She sat down before the fire--which was lighted, as usual, in spite of the summer warmth--and gave herself up to thoughts of Harold. These were pleasant enough, but occasionally there would come the recollection of Van Zwieten and his calm insistence that she should be his wife. Then she shuddered, for the man fascinated her as a serpent fascinates a bird. There were moments when it came upon her that he might get his way in spite of her repulsion. \\n\\n \\n\\n Idly looking into the fire, she noticed a fine white ash under the grate, disposed in a regular line. At first she took no heed of it, but presently she became aware that this was no coal débris, and her eye travelled along the line until she found an unburnt piece of the material, the remainder of which was ash. Growing pale, she bent down and picked up a tiny piece of crape. Undoubtedly it was crape--there was enough saved from the burning to swear by. Brenda turned faint; from the long narrow outline of the white ash, from the scrap of material she held in her hand, it was certain that her father had flung a crape scarf under the grate, and had set fire to it. And she guessed that the scarf was the one worn by the stranger--the scarf from which the morsel in Harold\u0027s possession had been torn. Motionless and terrified, she pondered over the meaning of this destruction. \\n\\n \\n\\n Before she could come to any conclusion, there was a shadow thrown across the floor, and Brenda, her nerves shaken, jumped up with a slight scream to see Van Zwieten step into the room through the French window. He looked unusually well pleased with himself, and smiled blandly when he saw her. In fact, she detected an exulting expression in his blue eyes, which vaguely terrified her. With the instinct to conceal the discovery of the burnt scarf, she thrust the scrap into her pocket, and turned to welcome Van Zwieten with a smile. \\n\\n \\n\\n He looked at the fire, at her action, and seemed to connect the two. But he said nothing. No doubt he thought she had been about to burn something, and that he had interrupted her. \\n\\n \\n\\n \"Aha, Miss Scarse,\" he said politely, \"I have been walking in the orchards to have a look at the spot where I murdered that man.\" \\n\\n \\n\\n Brenda was annoyed at his satire, and rather foolishly showed her annoyance. \\n\\n \\n\\n \"You should make allowance for my state of mind last night,\" she said irritably. \"I spoke without thinking. Besides, I accused you of killing Harold, not poor Mr. Malet.\" \\n\\n \\n\\n \"Quite so. But you might as well say I killed the one as the other. Pardon me, I will say no more. I have been to the place where the poor man was murdered, and I have made discoveries. Ah, you English, you have no eyes! Dozens of people have been round this morning, but they have seen nothing. I have seen much.\" \\n\\n \\n\\n \"What have you seen--what have you discovered?\" asked Brenda, anxiously. \\n\\n \\n\\n Van Zwieten clicked his heels together in foreign fashion, and bowed. \"Miss Scarse, I am a wise man,\" he said, smiling; \"wise men never talk. But if you will be wise also, and give me the right to tell you what I know, why then----\" \\n\\n \\n\\n \"How can I give you the right?\" \\n\\n \\n\\n \"By accepting me as your future husband.\" \\n\\n \\n\\n \"No, a thousand times, no. I am engaged to Captain Burton.\" \\n\\n \\n\\n \"Ah, Captain Burton! I quite forgot that young gentleman. I have something to say to him. He is, no doubt, still at his hotel. I will call.\" \\n\\n \\n\\n \"If your object is to make him give me up, you may save yourself the trouble of calling,\" said Brenda, quietly. \"We are engaged, and nothing you can say or do can break our engagement. \\n\\n \\n\\n \"Ah! I think otherwise.\" \\n\\n \\n\\n \"Mr. van Zwieten, will you understand once and for all that I refuse to have anything to do with you. I refuse to marry you.\" \\n\\n \\n\\n Van Zwieten shook his head. \"I cannot accept your refusal. I have made up my mind that you shall marry me, and marry me you must. I have a strong will, Miss Scarse.\" \\n\\n \\n\\n \"I also, and so has Captain Burton. You can\u0027t bully me into being your slave.\" \\n\\n \\n\\n \"Pardon me, I should be the slave,\" said the Dutchman, blandly. \"As for Captain Burton, poof! I will sweep him from my path. When he is in South Africa, I shall be there also.\" \\n\\n \\n\\n \"He is not going to South Africa.\" \\n\\n \\n\\n \"Oh, yes, I think so. He is a soldier, and your soldiers will have much to do in South Africa shortly.\" \\n\\n \\n\\n \"Mr. van Zwieten, I believe you are a Boer spy.\" \\n\\n \\n\\n \"Indeed! Why do you believe so?\" \\n\\n \\n\\n \"You seem to be so certain of the war. You are going out to the Transvaal----\" \\n\\n \\n\\n \"I am. You too, Miss Scarse--as my wife. Ah, do not look angry. You must accept the inevitable with a good grace. As to my being a spy, there is no need for me to act so low a part as that. I think there will be war because I read the sign of the times. Europe is with us----\" \\n\\n \\n\\n \"Did your friend Dr. Leyds tell you so?\" she asked scornfully. \\n\\n \\n\\n \"Perhaps. But this is idle talk. I am not what you think me. When the time comes you will know--what I intend you to know. So sure am I that you will be my wife, that I am content to return to London this day and leave you with Captain Burton.\" \\n\\n \\n\\n \"The sooner you go the better pleased I shall be.\" \\n\\n \\n\\n \"Ach! What English hospitality! How charmingly said!\" \\n\\n \\n\\n Brenda turned on him with tears of rage in her eyes. \"You force me to be rude,\" she said, almost breaking down in the face of this persistence. \"I have never been spoken to as you speak to me. An English gentleman can take \u0027no\u0027 for an answer.\" \\n\\n \\n\\n \"But I love you too much to accept such an answer.\" \\n\\n \\n\\n \"If you loved me, you would not worry me so. Please go, Mr. van Zwieten. Oh! I wish my father were here to protect me!\" cried poor Brenda, keeping back her tears with difficulty. \\n\\n \\n\\n \"Call him, Miss Scarse. He has not gone out to-day, has he?\" \\n\\n \\n\\n \"He has gone to London.\" \\n\\n \\n\\n Clever and self-possessed as Van Zwieten was, this intelligence disconcerted him. He started and frowned. \"To London!\" he repeated. \"He was here a couple of hours ago.\" \\n\\n \\n\\n Brenda handed him the note left by her father, and turned away. \"You can see for yourself. I suppose you will go after luncheon.\" \\n\\n \\n\\n Van Zwieten read the note and frowned again. \"Yes, I will go after luncheon,\" he said. \"In the meantime I will see Captain Burton, I think; oh, yes, I think I shall come to terms with that young gentleman. Till luncheon, Miss Scarse,\" and, bowing with a mocking smile, he stepped out of the window, leaving Brenda puzzled and uneasy. \\n\\n \\n\\n Meanwhile, Harold was talking with Inspector Woke at the inn. He had found that official waiting for him on his return from the cottage, and had at once consented to his request for a private conversation. He had no idea that Woke suspected him in any way, and answered his questions with the utmost frankness. \\n\\n \\n\\n \"I went to the Rectory last night to see Mr. Slocum, who is an old friend of mine,\" he said, \"and left here about eight o\u0027clock. It was shortly after nine when I returned.\" \\n\\n \\n\\n \"At what time did you arrive here?\" asked Woke, watching his companion\u0027s face. \\n\\n \\n\\n \"About ten o\u0027clock.\" \\n\\n \\n\\n \"Oh! and you left the Rectory at nine. Did it take you an hour to walk a quarter of a mile?\" \\n\\n \\n\\n Captain Burton stared, and his dark face flushed. \"I don\u0027t know why you wish me to answer you so precisely,\" he said haughtily; \"but it so happened that I was caught in the storm, and stood under a tree for some time.\" \\n\\n \\n\\n \"The storm again,\" murmured Woke, rubbing his chin. \"Lady Jenny Malet and your brother were both caught in the storm.\" \\n\\n \\n\\n \"I know that,\" retorted Burton, impatiently. \"Lady Jenny was coming to the Rectory to see me on business. This morning I learned that she was caught in the storm and turned back. My brother sprained his foot. I know all this. Well?\" \\n\\n \\n\\n \"Mr. Malet was murdered at half-past nine.\" \\n\\n \\n\\n \"So the doctor told me. Well?\" \\n\\n \\n\\n Harold was so unsuspicious that the inspector felt uncomfortable, and did not know very well how to put his doubts into words. \"Did you see Mr. Malet last night?\" he asked. \\n\\n \\n\\n \"No, I did not.\" \\n\\n \\n\\n \"Oh! If you had, would you have spoken to him?\" \\n\\n \\n\\n \"What the devil do you mean?\" asked Captain Burton, sharply. \\n\\n \\n\\n \"Only this. That I have been informed at the Manor--by Roberts the butler, if you want to know--that you and Mr. Malet had a quarrel yesterday.\" \\n\\n \\n\\n \"We had, over family business. That has nothing to do with you.\" \\n\\n \\n\\n \"I\u0027m not so sure about that,\" said Woke, drily. \"You used threats. You said you would make it hot for him.\" \\n\\n \\n\\n Captain Burton jumped up with clenched fists. \"Are you trying to make out that I murdered Malet?\" he asked savagely. \"If so, put your meaning more clearly, and I shall know how to defend myself.\" \\n\\n \\n\\n \"I don\u0027t say you murdered him,\" protested Woke, soothingly; \"but you quarrelled with him, you threatened him, and you were out of doors between nine and ten, during which time he was killed. The position is suspicious--don\u0027t be angry, Captain Burton, I am only doing my duty. Of course you can prove an alibi.\" \\n\\n \\n\\n \"I can give you my word that I did not see Malet last night. I saw his body after I had been informed of his murder. As to an alibi, no one saw me after I left the Rectory, so far as I know. I stood under a tree for a time; then I walked round by Mr. Scarse\u0027s cottage.\" \\n\\n \\n\\n \"Had you any particular reason to do so?\" \\n\\n \\n\\n Captain Burton flushed and bit his lip. \"I could refuse to answer that question,\" he said at length; \"but as you suspect me I will be as candid as possible. I am engaged to Miss Scarse, and I went round with the intention of seeing her on the same matter about which I went to the Rectory. However, I concluded it was too late, so I returned here.\" \\n\\n \\n\\n \"You answer frankly, Captain Burton,\" said Woke rather disconsolately, \"and I say again, I don\u0027t accuse you of the crime.\" \\n\\n \\n\\n Harold bowed ironically. \"Have you any idea who committed it? \\n\\n \\n\\n \"No,\" replied Burton, keeping his own counsel, \"I have not.\" \\n\\n \\n\\n Woke rose to go. Then he looked at Harold and hesitated. Finally he spoke in a confidential tone. \"Do you know if Mr. Scarse is mad?\" was his strange question. \\n\\n \\n\\n Burton suppressed a smile. \"Not that I know of,\" he replied wonderingly. \"Why?\" \\n\\n \\n\\n \"Because he was seen in the village yesterday afternoon with a yard or two of crape around his neck--crape, Captain Burton--a strange material for a scarf!\" \\n\\n \\n\\n \"Very strange,\" replied Burton, keeping strict guard on his tongue. He saw that other people besides himself had mistaken the stranger for Scarse; but he did not correct the inspector lest he might say too much. For Brenda\u0027s sake it would not do for that subject to be gone into too minutely. \"You had better see Mr. Scarse yourself about the matter,\" said he at length; \"he has gone up to town, but may return this evening.\" \\n\\n \\n\\n Woke nodded and withdrew. He had not gained much by his conversation. Harold was evidently guiltless; or, at all events, there seemed to be no evidence to connect him with the crime. The poor inspector, accustomed to open murders of the poker or hatchet order, was wholly at a loss how to deal with the intricate criminal problem presented to him. He could not find the weapon with which the crime had been committed; he could gain no tangible intelligence likely to fasten the crime on to any one person. At last, utterly perplexed, he took himself off. \\n\\n \\n\\n Harold watched him go with some sense of relief. He saw that the case, handled by a man of such inexperience and meagre intelligence, would come to nothing, and for Brenda\u0027s sake he was glad. He could not help thinking that Scarse was in some way connected with the matter. Much would depend upon the explanation he had to give regarding his \"double.\" Until that mystery was solved, nothing could be done. \\n\\n \\n\\n He was still pondering over the pros and cons of it all when he was interrupted by the waiter with the intelligence that Mr. van Zwieten wished to see him. Wondering what his rival could have to say to him, he directed that he should be shown in. When Van Zwieten appeared, Harold received him coldly. He did not offer to shake hands. \\n\\n \\n\\n \"You wish to see me?\" was all he said. \\n\\n \\n\\n \"Ach, yes!\" replied Van Zwieten, with a beaming smile. \"You will let me sit down.\" He threw himself lightly on the sofa. \"Thank you. Yes, Captain Burton, I have come to see you about a lady.\" \\n\\n \\n\\n \"I know whom you mean,\" said Harold, his voice tremulous with rage, \"and I must ask you to leave that lady\u0027s name unspoken. I refuse to discuss the matter, you have come about.\" \\n\\n \\n\\n \"It will be better for you to agree,\" said Van Zwieten, with a steely gleam of his blue eyes. \"I come to see you about more than Miss Scarse.\" \\n\\n \\n\\n Harold sat down suddenly. It flashed across him that the Dutchman knew something connected with the crime, so significantly did he speak. Resolved to know the worst, he decided to let him have his say, although he winced at the idea of Brenda\u0027s name on the lips of the man. However, there was no help for it. The position was dangerous, and this was not the time for squeamishness. \\n\\n \\n\\n \"Say what you have to say and go then,\" he said, holding himself in hand. \\n\\n \\n\\n \"I can say that in a few words,\" said Van Zwieten; \"you are engaged to be married to Miss Scarse.\" \\n\\n \\n\\n \"Yes,\" assented Burton, breathing quickly. \\n\\n \\n\\n \"Know then that I love her, Captain Burton, and I wish to marry her.\" \\n\\n \\n\\n \"Miss Scarse has consented to marry me. You have--oh, damn you, get out, or I\u0027ll kick you! How dare you talk about Miss Scarse--about my private affairs?\" \\n\\n \\n\\n The young man was on his feet, furious with rage. It wanted little to make him hurl himself on Van Zwieten; but the Dutchman never flinched, never ceased to smile. \"You must give up Miss Scarse to me!\" \\n\\n \\n\\n \"I\u0027ll see you at the devil first,\" was the fierce reply. \\n\\n \\n\\n \"In that case I must talk of your private affairs.\" \\n\\n \\n\\n \"You have done so--you are doing so.\" \\n\\n \\n\\n \"Not yet. But now--Captain Burton, I hold you in the hollow of my hand.\" \\n\\n \\n\\n \"What do you mean?\" asked the startled Harold. \\n\\n \\n\\n Van Zwieten bent forward and spoke low for a few moments. When he had finished, Captain Burton\u0027s face was grey and drawn and terror-stricken. \\n\\n \\n\\n The Dutchman continued to smile. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1929/55390.html","bookId":880,"book":{"id":880,"title":"A Traitor in London","description":"简介： It\u0027s an infernal shame!I call it common sense!Call it what you please, Malet. I deny your right to keep back my money....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1929","creation":"Aug 1, 2019 12:23:47 AM","modification":"Aug 1, 2019 12:23:47 AM"}}
