{"id":78799,"no":18,"title":"Page 18","content":"Jade didn\u0027t forget about the pain, but it didn\u0027t seem to matter now. The restlessness came back with building insistence. Caine forced himself to stay completely still until she\u0027d adjusted to him. When she slowly arched up against him, he partially withdrew, then drove back into her again.\\n\\n Her ragged moan forced him to stop again. \"Am I still hurting you?\" he asked, all the while praying he wasn\u0027t causing her more pain. His body was screaming for release, and he knew, even if she begged\\n\\n him, he wouldn\u0027t be able to stop now. \"Is it better now?\"\\n\\n \"A little,\" she answered against his neck. Her voice sounded shy, uncertain. \"It\u0027s a little better.\"\\n\\n He continued to hesitate until she bit his earlobe and pushed against him again. It was all the encouragement he needed. His body took over. Though he vowed to be gentle with her, his thrusts became more powerful, more out of control.\\n\\n Her thighs clenched him tight. Her toes arched against the backs of his legs. Her nails dug into his shoulder blades.\\n\\n Caine was relentless now in his quest to push her beyond control. He drove into her and then slowly withdrew, again and again. He knew he should withdraw before he reached his own cl**ax, for neither\\n\\n of them had taken any precautions against pregnancy, but she was so hot, so tight, that noble thought became untenable. And somewhere, in the dark recesses of his mind was the honest admission that he wanted to give her his child.\\n\\n The mating rhythm took over. The bed squeaked with each hard thrust. Thunder blended with their low moans of pleasure, his whispered words of love. Caine wouldn\u0027t let her give half measure. Wave after wave of intense pleasure began to spiral through her body until she was shaking with her need for fulfillment. He made her burn for completion. Jade was suddenly terrified of what was happening to her. It was as though he was trying to steal her soul. \"Caine, I can\u0027t. . .\"\\n\\n He hushed her fear with another long, drugging kiss. \"Let it happen, Jade. Hold on to me. I\u0027ll keep you safe.\"\\n\\n Safe. He would keep her safe. Jade\u0027s instinctive trust in him pushed her fear and her vulnerability away. She let the storm capture her until she became one with the wind. And then she felt as though she was splintering through the air toward the sun. Her body squeezed him tight. She cried out his name, with joy, with release, and with love.\\n\\n Caine buried his seed inside her at the very same moment. His head fell to her shoulder and he let out a low grunt of satisfaction.\\n\\n His own cl**ax made him shudder in wonder. Never had he felt such blissful surrender. He felt drained . . . and renewed.\\n\\n He was never going to let her go. That sudden thought hammered through his mind with the same force of his wild heartbeat. He neither fought the truth nor tried to move.\\n\\n He was content.\\n\\n Jade was exhausted.\\n\\n Only when her arms began to ache did she realize she was still clinging to him. She slowly released her hold, then let her arms fall to her sides. She was too astonished by what had just happened to her to speak yet. No one had ever told her it would be like this. Dear heaven, she\u0027d completely lost control. She\u0027d given herself to him completely, body and soul, trusting him absolutely to keep her safe.\\n\\n No one had ever had such power over her. No one.\\n\\n Jade closed her eyes to keep her tears hidden. Caine, she decided, was a far more cunning thief than she was. The man had dared to steal her heart. Worse, she had allowed it.\\n\\n Even when he felt her tense beneath him, he couldn\u0027t find the strength or the will to move away from her.\\n\\n \"I think you should leave now,\" she whispered. Her voice trembled.\\n\\n Caine sighed against her neck. He wrapped his arms around her and rolled to his side. Jade couldn\u0027t resist the urge to cuddle up against his chest for just a minute. Though she didn\u0027t understand why, she actually wanted to hear a few words of praise from him before she sent him away . . . just a few little lies about iove and honor, that she could pull out and savor in the future on those cold nights when she was all alone. Yes, they would be lies, but she wanted to hear them anyway.\\n\\n That, of course, didn\u0027t make any sense to her. She could feel herself becoming angry with him. This was all his fault because he\u0027d turned her into a blithering simpleton who couldn\u0027t make up her mind if she wanted to weep or shout.\\n\\n \"Sweet, are you already having regrets?\"\\n\\n She couldn\u0027t detect a shred of regret in his tone. In truth, he sounded downright amused.\\n\\n When she didn\u0027t answer his question, he tugged on her hair, forcing her to look up at him.\\n\\n He was thoroughly pleased by what he saw. Her face was flushed from their lovemaking, her mouth swollen from his kisses, and her eyes were still cloudy with passion.\\n\\n Caine felt as though he\u0027d left his brand on her. A wave of raw possessiveness filled him, and he arrogantly nodded. He decided to ignore her disgruntled expression, guessing it was all bluster for his benefit.\\n\\n He couldn\u0027t resist kissing her again. When he slowly leaned down to claim her mouth, she tried to turn away. Caine simply tightened his hold on her hair to keep her still.\\n\\n The kiss was meant to melt away her glare. As soon as his mouth covered hers, his tongue sank inside\\n\\n her sweet, intoxicating heat. The erotic love play coaxed her response. It was a long, intense kiss and she was clinging to him when he finally lifted his head to look at her again.\\n\\n \"You wanted me as much as I wanted you, Jade,\" he said. \"You made the choice, love, and now you\u0027re going to have to live with it.\"\\n\\n The man was a cad. Her eyes filled with fresh tears. His attitude was as callous as a hardened blister.\\n\\n And did he have to smile at her after making such a painful statement?\\n\\n She vowed he\u0027d never know how much his words hurt her. \"Yes, Caine, I did make the choice to give you my virginity, and I will live with the consequences of my actions. Now, if you don\u0027t mind, I\u0027m really sleepy and I would like . . .\"\\n\\n \"That isn\u0027t what I\u0027m talking about,\" he interrupted. His voice was as ragged as lightning. \"The choice you made was to belong to me, Jade. We\u0027re going to get married, sweet.\"\\n\\n \"What?\"\\n\\n \"You heard me,\" he replied, his voice softer now. \"Don\u0027t look so appalled, my love. It isn\u0027t as bad as all that.\"\\n\\n \"Caine, I never made any such choice,\" she stammered out.\\n\\n He wasn\u0027t in the mood to listen to her denial. He wanted her acceptance. By God, he wasn\u0027t going to leave her bed until he had it. He rolled her onto her back, then roughly pushed her thighs apart with one of his knees. His hands held hers captive above her head. He deliberately ground his pelvis against her. \"Look at me,\" he commanded. When she obeyed that order, he said, \"What we have just shared can\u0027t be undone. You\u0027re all mine now. Accept it, Jade, and it will go a hell of a lot easier for you.\"\\n\\n \"Why should I accept?\" she asked. \"Caine, you don\u0027t know what you\u0027re asking.\"\\n\\n \"I\u0027m a very possessive man,\" he countered. His voice had taken on a hard edge.\\n\\n \"I noticed,\" she muttered. \"It\u0027s a sin, that.\"\\n\\n \"I won\u0027t share what belongs to me, Jade. Understand?\"\\n\\n \"No, I don\u0027t understand,\" she whispered. The look in his eyes chilled her. \"Is it because I was a virgin\\n\\n and you feel guilty? Is that the reason you want to marry me?\"\\n\\n \"No, I don\u0027t feel guilty,\" he answered. \"You are going to marry me, though. I\u0027ll speak to your brother\\n\\n just as soon as he returns to . . .\"\\n\\n \"You are the most arrogant, unbending man I\u0027ve ever had the displeasure to meet.\"\\n\\n A smile tugged at the corners of his mouth. \"But you like arrogant, unbending men, love. You wouldn\u0027t have let me touch you otherwise.\"\\n\\n Odd, but she couldn\u0027t fault that argument. \"Please get off me. I can\u0027t breathe.\"\\n\\n He immediately rolled to his side. Then he propped his head up with his elbow so he could watch her expressions. Jade pulled the sheet up over the two of them, folded her hands across her breasts, and stared intently at the ceiling.\\n\\n \"Jade?\"\\n\\n \"Yes?\"\\n\\n \"Did I hurt you?\"\\n\\n She wouldn\u0027t look at him. Caine tugged on her hair to emphasize his impatience. \"Answer me.\"\\n\\n \"Yes, you hurt me,\" she whispered. She could feel herself blush.\\n\\n \"I\u0027m sorry, Jade.\"\\n\\n She shivered over the tenderness in his voice, then realized she needed to get control of her emotions.\\n\\n She felt like weeping and couldn\u0027t understand why. \"No, you\u0027re not sorry,\" she announced. \"Or you would have stopped when I asked you to.\"\\n\\n \"I couldn\u0027t stop.\"\\n\\n \"You couldn\u0027t?\" She turned to look at him.\\n\\n \"No, I couldn\u0027t.\"\\n\\n She was almost undone by the tenderness she could see in his eyes. There was a definite sparkle there, too, indicating his amusement. She didn\u0027t know what to make of him now. \"Well, it\u0027s a good thing you don\u0027t feel guilty because you have nothing to feel guilty about.\"\\n\\n \"And why is that?\" he drawled out.\\n\\n \"Why? Because you didn\u0027t make me do anything I didn\u0027t want to do. This was all my doing.\"\\n\\n \"Was I even here?\" he asked. \"I seem to remember being an active participant.\"\\n\\n She ignored the laughter in his voice. \"Yes, of course you were here. But I allowed you to be ... active.\"\\n\\n If she hadn\u0027t looked so damned sincere, if she hadn\u0027t been wringing her hands together, he would have shouted with laughter. Her feelings were at issue, however, and for that reason he controlled himself.\\n\\n \"All right,\" he agreed. \"You were more active than I was. Happy now?\"\\n\\n \"Yes,\" she answered. \"Thank you.\"\\n\\n \"You\u0027re most welcome,\" he returned. \"Now tell me why you wanted me to make love to you.\"\\n\\n She looked back up at the ceiling before she answered him. Caine was fascinated by the blush that covered her face. His little innocent was embarrassed again. She\u0027d been wild just minutes before when they\u0027d been making love. His shoulders still stung from her nails. Her passionate nature more than matched his own, but it had also been the first time for her, and he assumed she was still shy and confused by what had happened.\\n\\n \"Because I wanted to,\" she answered. \"You see, I\u0027ve always known I would never marry and I wanted\\n\\n to ... Oh, you aren\u0027t going to understand. I wager that soon, after I\u0027ve gone away, you won\u0027t even remember me.\"\\n\\n She turned to judge his reaction to that statement, certain she\u0027d made him angry.\\n\\n He started laughing. \"You\u0027re being very rude,\" she announced before returning her gaze back to the ceiling. \"I do wish you\u0027d go away.\"\\n\\n His fingers trailed a shiver down the side of her neck. \"Jade? It was inevitable.\"\\n\\n She shook her head. \"It wasn\u0027t.\"\\n\\n He slowly pulled the sheet down until her br**sts were uncovered. \"It was,\" he whispered. \"God, I wanted you for so long,\" He tugged the sheet lower until her stomach was in view. \"You know what, love?\"\\n\\n \"What?\" she asked. She sounded breathless.\\n\\n \"I want you again.\"\\n\\n He leaned down and kissed her before she could argue with him. Jade let him have his way until his mouth became more insistent. Then she nudged him away. She rolled with him, and when they were facing each other, she kept her gaze directed on his chest. \"Caine?\" Her fingers toyed with the crisp hair while she tried to find the courage to ask him her question.\\n\\n \"Yes?\" he asked, wondering why she was acting shy again.\\n\\n \"Was it all right then?\"\\n\\n He tilted her chin up with his thumb. \"Oh, yes, it was all right.\"\\n\\n \"You weren\u0027t disappointed?\"\\n\\n He was touched by her vulnerability. \"No, I wasn\u0027t disappointed.\"\\n\\n His expression had turned so somber, she decided he was telling the truth.\\n\\n \"I wasn\u0027t disappointed either.\"\\n\\n \"I know,\" he answered with that arrogant grin back in evidence.\\n\\n \"How do you know?\"\\n\\n \"By the way you reacted to my touch, the way you found your own fulfillment, the way you shouted\\n\\n my name then.\"\\n\\n \"Oh.\"\\n\\n His smile melted away the rest of her worry. \"It was a little shattering, wasn\u0027t it, Jade?\"\\n\\n She nodded. \"I had no idea it would be so ... splendid.\"\\n\\n He kissed the top of her head. \"I can smell my scent on you,\" he said. \"I like that.\"\\n\\n \"Why?\"\\n\\n \"It makes me hard.\"\\n\\n \"I should wash.\"\\n\\n \"I\u0027ll do it for you,\" he offered.\\n\\n She rolled away from him and was out of the bed before he could reach for her. \"You\u0027ll do no such thing,\" she said before she gave him her back and struggled into her robe.\\n\\n Her smile was dazzling but it faded quickly when she noticed the spots of blood on the sheets.\\n\\n \"You made me bleed.\" That accusation came out in a stammer.\\n\\n \"Love, it was your first time.\"\\n\\n \"I know that,\" she returned.\\n\\n \"You were supposed to bleed.\"\\n\\n She looked taken aback by that statement. \"You\u0027re serious?\"\\n\\n He nodded.\\n\\n \"But only the first time, Caine? Not that there\u0027s ever going to be a second time,\" she rushed on. \"Still, I wouldn\u0027t. . .\"\\n\\n \"Only the first time,\" he answered. He decided to ignore her protest about not making love again and asked instead, \"Jade? Didn\u0027t anyone ever explain these facts to you?\"\\n\\n \"Well, of course they did,\" she replied, feeling like a complete fool now.\\n\\n He didn\u0027t believe her. \"Who? Your parents died before you were old enough to understand. Was it your brother? Did Nathan explain?\"\\n\\n \"Nathan left me.\" She really hadn\u0027t meant to blurt out that truth. \"I mean to say, he was away at school\\n\\n all the time and I rarely saw him.\"\\n\\n Caine noticed how agitated she was becoming. She was twisting the tie of her robe into knots. \"When\\n\\n did Nathan leave you?\"\\n\\n \"He was away at school,\" she said again.\\n\\n \"For how long?\"\\n\\n \"Why are you asking me these questions?\" she asked. \"My Uncle Harry took over my education while Nathan was away. He did a fine job, Caine.\"\\n\\n \"He obviously left out a few pertinent facts,\" Caine remarked.\\n\\n \"Uncle is a very reserved man.\"\\n\\n \"Weren\u0027t there any women around who . . .\"\\n\\n He quit his question when she shook her head at him. \"There were women but I would never discuss such a personal matter with any of them, Caine. It wouldn\u0027t have been proper.\" \\n\\n","sourceLink":"https://allnovel.net/guardian-angel-crown-s-spies-2/page-18.html","bookId":1791,"book":{"id":1791,"title":"Guardian Angel (Crown\u0027s Spies #2)","description":"Storyline: The Emerald flew across the seas, carrying the pirate Pagan -- despised by the ton, whose riches he plundered, and beloved by the poor, whose plight was eased by his gifts. \\n The Marquess of Cainewood vows to hunt down the pirate wretch in revenge for his brother\u0027s death. But when Jade, an enchanting vision of rippling red hair and eyes of jewel-green, appears at his door to beg desperately for his protection, the Marquess agrees to keep her safe from the villains who want her dead. Jade is infuriating, exasperating, and gorgeous; Caine is noble, strong-willed, and powerful. No woman has ever befuddled him so, nor so deeply aroused his desire. But as Jade answers his knowing caresses with an innocent, wild abandon, they are drawn into a web of treachery that will test the very heart of their love!\\n","cover":"https://allnovel.net/images/guardian-angel-crown-s-spies-2.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/guardian-angel-crown-s-spies-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 4:09:55 PM"}}
