{"id":78808,"no":27,"title":"Page 27","content":"\"Yes, I\u0027ve heard of the Tribunal.\"\n Colin was astonished. \"You have?\"\n \"When?\" Nathan demanded. \"How?\"\n \"There was an investigation immediately after your father\u0027s death, Nathan. The Earl was linked to all\n sorts of subversive activities. His lands were confiscated, his children left in poverty . . .\"\n \"How do you know all this?\" Nathan asked.\n Caine looked at Jade before answering. \"When she told me who her father was, I asked Lyon to make some inquiries.\"\n \"Who is this Lyon?\" Nathan asked.\n \"Our friend,\" Colin answered.\n \"Can he be trusted?\" Nathan asked.\n \"He can,\" Colin answered before his brother could. \"Caine, that was a safe bet. Lyon wouldn\u0027t ask the wrong people the way I did.\"\n Jade\u0027s back started aching from her uncomfortable position. She eased her hand away from Caine\u0027s, somewhat surprised when he gave her her freedom. She knew better than to try to leave, though. If\n Caine was anything, he was reliable. He would embarrass her just as he threatened.\n She moved to the chair Harry had vacated, and sat down.\n \"Lyon didn\u0027t ask anyone any questions,\" Caine explained. \"He simply looked the information up in the files.\"\n \"He couldn\u0027t have,\" Jade interjected. \"My father\u0027s file was missing.\"\n Caine raised an eyebrow over that telling remark. \"And how would you know if it was missing or not?\"\n She daintily shrugged. \"Because I took it,\" she admitted.\n \"You what?\"\n \"Caine, the file isn\u0027t the issue now,\" she rushed out, hoping to placate his rising temper.\n \"Then how did Lyon ...\" Nathan began.\n Caine continued to frown at Jade when he answered her brother. \"Richards was Lyon\u0027s director as well\n as mine. He had his own records. Lyon read those files.\"\n \"Was my father vindicated after the investigation?\" Nathan asked.\n \"No,\" Caine answered. \"He wasn\u0027t condemned either, Nathan. There wasn\u0027t enough proof.\"\n \"There is now,\" Jade whispered.\n \"Proof to vindicate your father?\" Caine asked.\n \"No, proof to condemn him. I read Papa\u0027s letters.\"\n The sadness in her voice tore at his heart. Caine still wanted to throttle her for deceiving him, but he also wanted to be kissing her at the same time.\n \"Caine, how can you be smiling now?\" Colin asked. \"This isn\u0027t. . .\"\n \"Sorry,\" Caine answered, unaware he had been smiling. \"I was sidetracked.\"\n He stared at Jade while he made that admission. She stared at her hands.\n \"Continue, Colin,\" Caine ordered then, turning his attention back to his brother.\n \"Right after their father\u0027s funeral, Pagan ... I mean, Jade, left with Black Harry. The Earl trusted Harry completely.\"\n \"That\u0027s difficult to believe,\" Caine interjected.\n \"Harry\u0027s a good man,\" Jade said. \"He has a pure heart.\"\n \"I\u0027m sure he does,\" Caine agreed. \"However, you mentioned that there was another close friend, a woman by the name of Lady Briars, who would have been more than willing to take you and Nathan\n into her home. I just don\u0027t understand why your father would have chosen a thief over ...\"\n \"It was a question of trust,\" Nathan explained. \"My father had turned his heart against England, Caine.\n He didn\u0027t think either one of us would be safe here. Harry was our best bet.\"\n \"Why didn\u0027t he think you\u0027d be safe?\"\n \"The letters,\" Colin answered. \"The Earl kept all the ones he received from the other two. Nathan\u0027s father\u0027s operative name was Fox, and he was one of the three in the Tribunal. The other two were called Ice and Prince.\"\n \"My father was a very idealistic man,\" Nathan interjected. \"In the beginning, I think he saved all the letters for future generations. He believed he was doing something . . . heroic for England. Things soured fast, though. Soon enough it became only for the good of the Tribunal. Anything was just, as long as it furthered the scope of their power.\"\n \"It was a slow metamorphosis,\" Colin said. \"The first letters were signed with the closing, \u0027for the good\n of England.\u0027 Then after the tenth, or perhaps the eleventh letter, the closing changed.\"\n \"To what?\" Caine asked.\n \"They started using the phrase, \u0027for the good of the Tribunal,\u0027\" he answered. \"Ice was the first to sign\n his letter that way, and the other two followed suit. Their corruption was complete by that time.\"\n \"They started acting independently long before that, Colin,\" Nathan remarked.\n \"The end justified their means,\" Colin explained to Caine. \"As long as they believed that what they were doing aided their country, they could justify anything.\"\n \"Very like your attitude, Jade,\" Caine announced.\n She was so startled by that comment, her eyes widened. \"No, not at all like my attitude,\" she argued. \"Caine, I\u0027m nothing like my father. I don\u0027t approve of what he did. It\u0027s sinful to admit, but I don\u0027t have any feelings for him, either. He chose his path.\"\n \"Your father\u0027s lands were confiscated, his fortune taken away,\" Caine said.\n \"Yes,\" she agreed, wondering what he was leading up to with that remark.\n \"It\u0027s the reason you steal from the wealthy, Jade. I\u0027d say you\u0027re getting even.\"\n \"I\u0027m not!\"\n Her shout told him he\u0027d rattled her with that opinion. \"Power corrupts,\" he said. \"Absolute power\n corrupts absolutely.\"\n \"You needn\u0027t quote Machiavelli to me, Caine. I will agree that the Tribunal was after absolute power.\"\n \"You were on the same path.\"\n \"I\u0027m not,\" she cried out.\n \"Was, Caine?\" Colin asked.\n \"Was,\" Caine announced. His voice was hard.\n \"Then you . . .\" Colin began.\n \"Not now, Colin,\" Caine ordered.\n \"What are you talking about?\" Jade asked. \"I\u0027ve never been after power.\"\n Caine ignored her protest. \"Tell me the rest of this,\" he ordered Nathan.\n \"Our father had a change of heart,\" Nathan said. \"His conscience began to bother him when his director, a man named Hammond, was sanctioned.\"\n \"Sanctioned?\" Colin scoffed. \"What a pleasant word for such a foul deed.\"\n \"Hammond was director over all three,\" Nathan interjected. \"There was Ice, Prince, and Fox. Anyway, in the beginning, they did whatever they were ordered to do. It wasn\u0027t long, though, before they started acting independently. Hammond was beginning to get wise to their doings and the three were certain he was growing in his suspicions. Ice came up with the idea that they sanction him.\"\n \"My father didn\u0027t want to kill Hammond,\" Jade said. \"Papa was on his way to London to warn the director when he was killed. At least that\u0027s what we\u0027ve been able to piece together.\"\n \"Who was killed? Your father or Hammond?\" Caine asked.\n \"Our father,\" Nathan answered. \"He had sent Hammond a note telling him that he had to meet with him as soon as possible, that it was an urgent, life-threatening matter.\"\n \"And how were you able to piece that together?\" Caine asked.\n \"Hammond showed me the note at my father\u0027s funeral,\" Nathan replied. \"He asked me if I knew\n anything about this urgent problem. I didn\u0027t know anything, of course. I\u0027d been away at school. Jade\n was too young to understand.\"\n \"Our father confided in Harry and gave him the letters he\u0027d saved.\"\n \"And Harry told you everything when you were older?\" Caine asked Jade.\n She nodded. She refused to look at him and kept her gaze directed on her lap.\n \"Harry wanted Nathan to go with us. Father had a ship and Harry was bent on becoming a pirate. Nathan wanted to finish school. He thought Harry was taking me to an island in the south and that I\u0027d be safe until he could come and fetch me.\"\n \"When I started hearing about the escapades of a pirate named Pagan, I have to admit I never once considered that it might be Harry,\" Nathan interjected. \"Why didn\u0027t you come for Jade?\" Caine asked. \"He couldn\u0027t,\" Jade answered before her brother could. \"Harry and I were never in one place long enough. Besides, Nathan had his own problems then. Father\u0027s enemies knew he\u0027d saved the letters. They were desperate to find them. Once Nathan\u0027s rooms had been searched, they left him alone ... for a time anyway, until we started a fresh investigation of our own.\"\n \"The letters were with you?\" Caine asked. \"Or did Harry hide them somewhere safe?\" \"We kept them on the Emerald,\" she answered. \"I want them,\" Caine demanded. \"Is this vessel near enough to send one of the men? Or perhaps . . .\"\n He stopped his question when she shook her head. \"There isn\u0027t any need to fetch them. I can tell you the contents.\"\n \"Word for word,\" Colin said. \"Pagan need only read something once, and it\u0027s committed to memory for the rest of her life.\"\n If Caine thought that talent odd, he didn\u0027t mention it. Jade was thankful he remained silent. \"Pagan, recite the letters for Caine,\" Nathan suggested. \"If you call her Pagan one more time, I\u0027m going to beat the hell out of you.\"\n Nathan scowled at Caine a long minute, then gave in. \"All right,\" he snapped. \"I\u0027ll call her Jade, though only because I don\u0027t want anyone hearing her nickname.\"\n \"I don\u0027t give a damn what your reasons are, just do it,\" Caine grated out.\n \"Hell, Colin, I\u0027m trying to be accommodating, but I swear to God I\u0027m going to knock the arrogance out of him when this is over and done with.\"\n Jade believed a fight was imminent. She drew everyone\u0027s attention by beginning her recitation. The telling took over thirty minutes. She didn\u0027t leave a word out. And when she was finished, no one said a word\n for a long while. Everyone was slowly filtering through the information she\u0027d just related.\n Then Colin spoke. \"All right then,\" he began, his voice filled with enthusiasm. \"That very first letter was addressed to Thorton ... that\u0027s Nathan and Jade\u0027s father, of course, and it was signed by a man named William.\"\n \"They hadn\u0027t been assigned their operative names yet,\" Jade volunteered.\n \"Yes,\" Colin agreed. \"Then Thorton became Fox, and William became Prince. Ice is another matter, though. We don\u0027t have any clues as to his . . .\"\n \"Colin, we can speculate about his identity later,\" Nathan interrupted.\n Colin nodded. \"I went to Willburn and told him all about the letters, Caine. Nathan and I decided we had to trust him. He was our director, after all, and he\u0027d taken good care of us. To this day, I still don\u0027t believe he was involved with the Tribunal.\"\n \"You\u0027re an innocent,\" Nathan muttered. \"Of course he was involved with the bastards.\"\n \"You\u0027ll have to prove it to me first,\" Colin argued. \"Only then will I believe.\"\n Nathan shook his head. He turned back to Caine. \"We were sent to the south on what we now know was a setup. We were supposed to meet with two informants at the harbor. It was a trick, of course. Before we knew what was happening, we had both been bound and gagged, and tossed into the warm waters.\"\n \"You aren\u0027t going to tell all of it, are you?\" Jade asked. \"There isn\u0027t any need, Colin.\"\n Neither Nathan nor Colin picked up on the fear in her voice. Caine did, and immediately glanced over\n to look at her.\n \"Get on with it, Colin,\" Nathan muttered.\n Jade, Caine noticed, was now clenching her hands together. He decided then that she must have witnessed something that had terrified her.\n \"I was the first to go into the waters,\" Colin said, drawing Caine\u0027s attention again. \"After they\u0027d made long, shallow cuts on my legs with their knives, they tossed me off the pier. Nathan understood what\n they were up to, though I thank God now that I didn\u0027t understand at the time. I thought I still had a chance, you see.\"\n Colin\u0027s expression had taken on a gray cast. Nathan looked just as grim.\n \"Because Shallow Wharf was close by, we spent several days with Jade and Black Harry. Colin didn\u0027t know she was Pagan then, of course, and he developed quite a crush on my little sister,\" Nathan continued.\n \"Yes, I did,\" Colin agreed. He turned to wink at Jade. \"I\u0027ll still have you, Jade, if you\u0027ll only give me a chance.\"\n She blushed while she shook her head at him. \"You were quite impossible.\"\n \"Colin followed her around like a puppy,\" Nathan said. \"When he realized she wasn\u0027t at all interested, he was so disappointed I had to take him drinking.\"\n \"I fell in love with two other ladies that night, Nathan,\" Colin remarked.\n \"They weren\u0027t ladies,\" Jade remarked.\n \"No, they weren\u0027t,\" Nathan agreed. \"How can you even remember, Colin? You were sotted, man.\"\n Colin laughed. \"I remember everything,\" he boasted. Caine held his patience. He could tell, from their dark expressions, that they needed to jest with each other in order to get through their memory.\n Jade didn\u0027t have as much patience. \"Tommy and I followed Nathan and Colin when they went to keep their appointment. They were so secretive about their plans, I became very curious. I also had this\n feeling that something was amiss.\"\n \"Who is Tommy?\" Caine asked.\n Jade literally bounded out of her chair and hurried across the room. \"Nathan, you finish this story while\n I see to refreshments. I\u0027m tired of talking about this.\"\n Nathan started to call out to her but Colin stayed the action by putting his hand on his friend\u0027s arm. \"It\u0027s still difficult for her,\" he whispered. Nathan nodded.\n \"Of course it\u0027s difficult for her,\" Caine interjected, his tone harsh. \"My God, she must have watched\n you . . .\"\n \"She didn\u0027t watch,\" Nathan whispered. \"As Colin was explaining, I knew what their plan was as soon as they cut Colin\u0027s legs. I put up a struggle when they tried to use their blades on me, ended up getting shot for my trouble. My shoulder was on fire when I went into the water.\"\n \"They cut us to draw the attention of the sharks, of course. The harbor is always full of the scavangers because of all the garbage that\u0027s thrown in. The blood did draw them, like flies to a carcass.\" \n","sourceLink":"https://allnovel.net/guardian-angel-crown-s-spies-2/page-27.html","bookId":1791,"book":{"id":1791,"title":"Guardian Angel (Crown\u0027s Spies #2)","description":"Storyline: \n The Emerald flew across the seas, carrying the pirate Pagan -- despised by the ton, whose riches he plundered, and beloved by the poor, whose plight was eased by his gifts. \n The Marquess of Cainewood vows to hunt down the pirate wretch in revenge for his brother\u0027s death. But when Jade, an enchanting vision of rippling red hair and eyes of jewel-green, appears at his door to beg desperately for his protection, the Marquess agrees to keep her safe from the villains who want her dead. Jade is infuriating, exasperating, and gorgeous; Caine is noble, strong-willed, and powerful. No woman has ever befuddled him so, nor so deeply aroused his desire. But as Jade answers his knowing caresses with an innocent, wild abandon, they are drawn into a web of treachery that will test the very heart of their love!\n \n","cover":"https://allnovel.net/images/guardian-angel-crown-s-spies-2.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/guardian-angel-crown-s-spies-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 4:09:55 PM"}}
