{"id":36444,"no":19,"title":"CHAPTER XVIII — KATARINA","content":"As soon as the king\u0027s army approached Arras, Guy repeated all the precautions that had before been taken, but as this time there had been long warning, these were carried out more effectually. A considerable number of the cattle and sheep of the tenants were driven to Calais and there sold, the rest, with the horses, were taken into the castle. The crops were hastily got in, for it was near July, and these were thrashed and the grain brought in, with the household furniture and all belongings. A great store of arrows had been long before prepared, and Guy felt confident that he could hold out for a long time. The women and children took up their abode in the castle, and the former were all set to work to make a great number of sacks. A hundred cart-loads of earth were brought in, and this was stored in a corner of the court-yard. The earth was to be employed in filling the sacks, which were to be lowered from the walls so as to form a protection against heavy missiles, should an attempt be made to effect a breach. A few days after the king\u0027s army sat down before Arras, the look-out informed Guy that a horseman, together with a lady and two attendants, were riding towards the castle. Wondering who these visitors could be, Guy crossed the drawbridge to the outwork, where a small party were now stationed. As they rode up, he saw, to his surprise and pleasure, that they were the Count of Montepone and his daughter. He ran out to meet them. \"I am delighted to see you, Count, and you also Mistress Katarina. I regret that Sir Eustace and Dame Margaret are not here to receive you properly.\" \"We were aware that she was absent,\" the count said as he dismounted, while Guy assisted Katarina from her saddle. \"I received a letter three months since; it came by way of Flanders from Sir Eustace, expressing his thanks for what slight services I had rendered to his wife. He told me that they had crossed over to England, and that you were his castellan here. But I thought that ere this he might have returned.\" \"I heard from him but a few days ago,\" Guy said. \"He is detained in England by the illness of Dame Margaret, or he would have hastened hither on hearing that the French army was moving north. I need scarcely ask how you are, Mistress Katarina, for you have changed much, and if I may say it without offence, for the better.\" The girl flushed a little and laughed, and her father said: \"It is nigh three months since we left Paris; the country air has done her good. Since we left she has till now been in disguise again, and has ridden as my page, for I could not leave her behind, nor could I in an army, with so many wild and reckless spirits, take her in the dress of a girl.\" By this time they had crossed the drawbridge, the servants leading their horses after them. \"My stay must be a short one,\" the count said as they entered the banqueting-hall, and Guy gave orders for a repast to be served. \"I hoped that you were come to stay for a time, Count; I would do all in my power to make your visit a pleasant one.\" The Italian shook his head. \"No, I must ride back tonight. I have come here for a double purpose. In the first place I must send Katarina to England; she is almost a woman now, and can no longer wander about with me in times like these. In the second place, I have come to tell you that I think you need have no fear of an attack upon the castle. That news you gave me, which enabled me to save those three Orleanist nobles, has, added to what I had before done in that way, helped me vastly. One of them is a great favourite with Aquitaine, and the latter took me under his special protection; and he and many other great lords, and I may tell you even the queen herself, consult me frequently. Shortly after you left I moved to a larger house, and as there was no longer any need for me to assume the character of a vendor of medicines I abandoned that altogether, and took handsome apartments, with my negro from the booth to open the door, and two other lackeys. \"My knowledge of the stars has enabled me with some success to predict the events that have taken place, and Aquitaine and the queen have both implicit confidence in me and undertake nothing without my advice. The Duke of Orleans, too, has frequently consulted me. I have used my influence to protect this castle. I have told them that success will attend all their efforts, which it was easy enough to foresee, as Burgundy has no army in the field that can oppose them. But I said that I had described a certain point of danger. It was some time before I revealed what this was, and then said that it appeared to me that the evil in some way started from the west of Arras. I would go no further than this for many days, and then said that it arose from a castle held by one who was not altogether French, and that were an attack made upon it evil would arise. I saw that it would lead to a disturbance, I said, in the negotiations for the marriage, and perhaps the arrival of an English army. More than this I said the stars did not tell me. \"Aquitaine made inquiries and soon found that my description applied to Villeroy, and he and the queen have issued strict orders that no plundering party is to come in this direction, and that on no account is the castle to be interfered with, and I shall take care that their intentions in this matter are not changed. I had the royal orders to accompany the army. This I should have done in any case, but of course I professed a certain reluctance, by saying that I had many clients in Paris. However, I received various rich presents, and was therefore prevailed upon to travel with them.\" \"I thank you most heartily, Count, for, as you saw on crossing the court-yard, I have already called all the vassals in and made preparations to stand a siege. As to your daughter, I will, if you wish it, appoint two of the tenants\u0027 daughters as her attendants, and send an elderly woman as her companion, with an escort under Robert Picard,—one of those who were with me in Paris,—and four other men-at-arms to accompany her to Summerley and hand her over to the charge of Dame Margaret, who will, I trust, be in better health than when Sir Eustace wrote to me. It will be a great relief to our lord and lady to know that their presence is not urgently required here. The escort can start to-morrow at daybreak if you wish that they should do so.\" The count hesitated, and Guy went on: \"I will appoint the woman and the two maids at once. Mistress Katarina can occupy Dame Margaret\u0027s chamber, and the woman and the maids can sleep in those adjoining it.\" \"That will do well,\" the count said cordially. \"We have ridden twenty miles already, and she could hardly go on to-day, while if she starts at daybreak they may reach Calais to-morrow.\" \"I will give Picard a letter to the governor, asking him in my lord\u0027s name to give honourable entertainment to the young lady, who is under Dame Margaret\u0027s protection, and to forward her upon her journey to join them by the first vessel sailing to Southampton, or if there be none sailing thither, to send her at once by ship to Dover, whence they can travel by land. One of the four men-at-arms shall be an Englishman, and he can act as her spokesman by the way.\" \"That will do most excellently,\" the count said, \"and I thank you heartily. As soon as I have finished my meal I must ride for the camp again. I started early this morning in order not to be observed; in the first place because I did not wish my daughter to be seen in her female dress, and in the second because I would not that any should notice my coming in this direction, and indeed we rode for the first mile backwards along the road to Bapaume, and I shall return by the same way.\" \"What will the end of these troubles be, Count?\" \"As I read the stars there will be peace shortly, and indeed it is clear to me that the Duke of Burgundy must by this time see that if the war goes on he will lose all Artois and perhaps Flanders, and that therefore he must make peace, and perhaps keep it until the royal army has marched away and dispersed; after that we may be sure that the crafty duke will not long remain quiet. I have a trusty emissary in Burgundy\u0027s household, and as soon as the duke comes to the conclusion that he must beg for peace I shall have intelligence of it, and shall give early news to the queen and to Aquitaine, who would hail it with gladness; for, seeing that the latter\u0027s wife is Burgundy\u0027s daughter, he does not wish to press him hard, and would gladly see peace concluded.\" An hour later the count rode off with his two followers, after taking an affectionate leave of his daughter, and telling her that it would not be long before he joined her—if only for a time—in England. Before he went Guy had chosen the woman who, with her two daughters, was to accompany Katarina, and had installed them in the private apartments. \"What shall we do with ourselves for the day?\" he asked the girl, who was, he saw, shy and ill at ease, now that her father had left. \"If you are not tired we might take a ride. We have some hawks here, and now that the harvest has been gathered we shall doubtless find sport with the game-birds.\" \"I am not at all tired,\" she said eagerly, \"and should like it much.\" Calling upon Long Tom and another to accompany them, horses were brought up, and they started and remained out until supper-time, bringing home with them some seven or eight partridges that had been killed by the hawks. Guy suggested that perhaps she would prefer to have the meal served in her own apartments and to retire to bed early. She accepted the offer, and at once went to her room, which she did not leave again that evening. Guy, as he ate alone, wondered to himself at the change that some nine or ten months had made in her. \"I suppose she feels strange and lonely,\" he said to himself. \"She was merry enough when we were out hawking; but directly we got back again she seemed quite unlike herself. I suppose it is because I always used to treat her as if she were a boy, and now that she has grown up into a woman she wants to forget that time.\" The town of Arras resisted sturdily. The garrison made frequent sorties, took a good many prisoners, and inflicted heavy loss upon the besiegers before these could gather in sufficient numbers to drive them in again, and all assaults were repulsed with loss. The Castle of Belle Moote, near Arras, also repulsed all the efforts of the king\u0027s army to take it. Foraging parties of Orleanists committed terrible devastations in the country round, but gained no advantage in their attacks on any fortified place. On the 29th of August the Duke of Brabant arrived with some deputies from Flanders to negotiate a peace between Burgundy and the king. They were well received, and an armistice was at once arranged. The French troops were suffering severely from disease, and the failure of all their attempts to capture Arras made them ready to agree willingly upon a peace. This was accordingly concluded on the 4th of September, and the next day the royal army marched away. Three weeks after Katarina had gone to England, Sir Eustace himself, to Guy\u0027s great joy, arrived at the castle, bringing with him his esquire and eight men-at-arms, as well as the three serving-women and their escort. As soon as his pennon was seen Guy leapt on a horse that was standing saddled in the court-yard, and rode to meet them. As he came up he checked his horse in surprise, for his father was riding by the side of Sir Eustace. Recovering himself, however, he doffed his cap to his lord. \"Welcome back, my lord!\" he said. \"I trust that our dear lady is better.\" \"Much better, Guy. You see I have brought your father over with me.\" Guy bent low to his father. \"I am right glad to see you,\" the latter said, \"and to hear such good accounts of you. Dame Margaret and Mistress Agnes were never tired of singing your praises, and in truth I was not weary of hearing them.\" \"Are you going to make a long stay, father?\" \"I shall stay for some little time, Guy. Our lady is going to be her own castellan for the present. And in truth things are so quiet in England that Summerley could well go on without a garrison, so Sir Eustace suggested that I should accompany him hither, where, however, just at present things have also a peaceful aspect. The young countess arrived safely, Guy, and was heartily welcomed, the more so since, as your letter told me, it is to her father that we owe it that we did not have the king\u0027s army battering our walls, or, even if they did not try that, devastating the fields and ruining the farmers.\" By this time they were at the gate. Long Tom had the garrison drawn up in the court-yard, and they hailed the return of their lord with hearty cheers, while the retainers of Summerley were no less pleased at seeing Sir John Aylmer. \"And now, Guy,\" said Sir Eustace, \"I will tell you why I have come hither. It is partly to see after the estate, to hear the complaints of my vassals and to do what I can for them, and in the next place I wanted to see these fortifications that you have raised, and, thirdly, I shall shortly ride to Paris in the train of the Earl of Dorset, the Lord Grey, Admiral of England, some bishops, and many other knights and nobles, amounting in the whole to 600 horse. They go to treat for the marriage of the princess of France with the English king. I had an audience with the king at Winchester as soon as we heard that the royal army was marching towards Artois, and he gave assurance that he would instruct the governor of Calais to furnish what assistance he could should the castle be attacked, and that he himself would at once on hearing of it send a remonstrance to the King of France, urging that I, as a vassal of his as well as of France, had avoided taking any part in the troubles, and had ever borne myself as a loyal vassal of his Majesty. \"He was at Winchester when the young countess arrived, and I rode over to him to tell him that I had news that it was not probable that Villeroy would be attacked. It was then that his Majesty informed me that the Earl of Dorset with a large body of nobles would ere long cross the Channel for the purpose that I have named, and begged me to ride with them. The king, being disengaged at the time, talked with me long, and questioned me as to the former defence of the castle, and how Dame Margaret had fared when, as he had heard, she was obliged to go as a hostage to Paris. I told him all that had befallen her, at which he seemed greatly interested, and bade me present you to him at the first opportunity. \"\u0027He must be a lad after my own heart,\u0027 he said, \u0027and he shall have an opportunity of winning his spurs as soon as may be, which perchance is not so far away as some folks think.\u0027\" Guy thanked Sir Eustace for having so spoken of him to the English king, and asked: \"What do you think he meant by those last words, my lord?\" \"That I cannot say, Guy; but it may well be that he thinks that this marriage which has been so long talked of may not take place, and that the negotiations have been continued solely for the purpose of keeping him quiet while France was busied with her own troubles. Moreover, I know that the king has been already enlisting men, that he is impatient at having been put off so often with soft words, and that embassy is intended to bring matters to a head; therefore if, as I gathered from some of my friends at his court, he is eager for fighting, it may be that his ambassadors will demand conditions which he is sure beforehand the King of France will not grant. At any rate I shall ride with Dorset to Paris; whatever the sentiments of the Burgundians or Orleanists may be towards me will matter nothing, riding as I shall do in the train of the earl. I am going to take you with me, as well as John Harpen, for I must do as well as others, and have had to lay out a goodly sum in garments fit for the occasion, for the king is bent upon his embassy making a brave show. Your father will be castellan here in my absence. I shall also take with me Long Tom and four of his archers, and five French men-at-arms. I have brought some Lincoln-green cloth to make fresh suits for the archers, and also material for those for the men-at-arms.\" Both Sir Eustace and Sir John Aylmer expressed great satisfaction at the manner in which the new outworks had been erected. \"Assuredly it is a strong castle now, Sir Eustace,\" Sir John said, \"and would stand a long siege even by a great army.\" \"What is all that earth for in the corner, Guy?\" Sir Eustace asked as they re-entered the castle after having made a survey of the new works. \"I had that brought in, my lord, to fill sacks, of which I had three hundred made, so that if guns and battering machines were brought against us, we might cover the wall at the place they aimed at with sacks hanging closely together, and so break the force of the stones or the cannon balls.\" \"Excellently well arranged, Guy. You thought, Sir John, that I was somewhat rash to leave the defence solely to the charge of this son of yours, but you see the lad was ready at all points, and I will warrant me that the castle would have held out under him as long a time as if you and I both had been in command of it.\" It was not until January, the year being 1414, that the Earl of Dorset and a great company arrived at Calais. As they passed not far from the castle they were joined by Sir Eustace and his retinue. The king\u0027s wishes had been carried out, and the knights and nobles were so grandly attired and their retinues so handsomely appointed that when they rode into Paris the people were astonished at the splendour of the spectacle. A few days after they reached the capital the king gave a great festival in honour of the visitors, and there was a grand tournament at which the king and all the princes of the blood tilted. The English ambassadors were splendidly entertained, but their proposals were considered inadmissible by the French court, for Henry demanded with Katherine the duchy of Normandy, the county of Pontieu, and the duchy of Aquitaine. No direct refusal was given, but the king said that he would shortly send over an embassy to discuss the conditions. Many handsome presents were made to all the knights and noblemen, and the embassy returned to England. Sir Eustace left them near Villeroy with his party, and stayed two days at the castle. Sir John Aylmer said that he would prefer that Guy should return home with Sir Eustace and that he himself should remain as castellan, for he thought that there was little doubt that war would soon be declared; he said that he himself was too old to take the field on active service, and preferred greatly that Guy should ride with Sir Eustace. Long Tom made a petition to his lord that he too should go to England for a time. \"If there was any immediate chance of fighting here, my lord,\" he said, \"I would most willingly remain, but seeing that at present all is quiet, I would fain return, were it but for a month; for I have a maid waiting for me, and have, methinks, kept her long enough, and would gladly go home and fetch her over here.\" The request was at once granted, and Sir Eustace, his two esquires, and the archer rode to Calais, and crossed with the company of the Earl of Dorset. For some months Guy remained quietly at Summerley. Agnes, though nearly sixteen, was still but a young girl, while Katarina had grown still more womanly during the last six months. The former always treated him as a brother, but the latter was changeable and capricious. Occasionally she would laugh and chat when the three were alone, as she had done of old in Paris, but more often she would tease and laugh at him, while sometimes she would be shy and silent. \"I cannot make out the young countess, my lady,\" he said to Dame Margaret when Katarina had been teasing him even more than usual. \"She was never like this in Paris, and I know not that I have done aught to offend her that she should so often pick up my words, and berate me for a meaning they never had.\" \"You see, things have changed since then,\" Dame Margaret said with a smile; \"\u0027tis two years since you were in Paris, and Katarina, although but little older than Agnes, is already a young woman. You were then still under seventeen, now you are nineteen, and in growth and stature well-nigh a man. You can hardly expect her to be the same with you as when she was running about Paris in boy\u0027s attire, for then you regarded her rather as a comrade than as a girl. I think, perhaps, it is that she a little resents the fact that you knew her in that guise, and therefore feels all the less at her ease with you. Do not trouble about it, the thing will right itself in time; and besides, you will shortly be going off to the war.\" In fact, preparations were being already made for it. A French embassy of nobles and knights, with three hundred and fifty horsemen, had come over, and, after passing through London, had gone to Winchester, and there met the king and his great lords. The Archbishop of Bourges, who was their spokesman, at once set forth that the king could not hand over so large a portion of his kingdom, but that he would give with his daughter large estates in France, together with a great sum in ready money. This offer was refused, and preparations for war went on in both countries. France was, indeed, but in poor condition to defend itself, for the Duke of Aquitaine had seriously angered both parties. He had made a pretext to get the great lords to ride out from Paris, he being with them; but he had secretly returned, and had ordered the gates to be closed, had called the citizens to arms, and had resumed the supreme authority of the realm. Having done this, he sent his wife, Burgundy\u0027s daughter, to a castle at a distance, and surrounding himself with young nobles as reckless and dissipated as himself, led a life of disorder, squandering money on his pleasures, and heavily taxing the city for his wants. The Duke of Burgundy, indignant at the treatment of his daughter, sent an ambassador to demand that she should be taken back, and that all the persons, five hundred in number, who had been exempted from the terms of the treaty, should be allowed to return to Paris. Both requests were refused, and the consequence was that the Duke of Burgundy, with his partisans, returned to his own country in deep anger; he would take no part in the war against the English, although he permitted his vassals to do so. In July the English levies gathered at Southampton. The king was to have embarked immediately, and a great fleet had been collected for the purpose; but, as he was on the point of sailing, Henry obtained news of a plot against his life on the part of Sir Thomas Grey, Lord Scroop, and Richard, Earl of Cambridge, the king\u0027s cousin. As Scroop was in constant attendance upon the king and slept in his room, the conspirators had little doubt that their purpose could be carried out, their intention being to proclaim the Earl of March king, and to summon assistance from Scotland. The three conspirators were tried by a jury and were all found guilty. Grey was beheaded, but his companions claimed to be tried again by their peers. No time was lost in carrying out the trial; all the lords assembled at Southampton were called together, and, after hearing the evidence, at once found the two nobles guilty, and they were immediately beheaded. Orders were then given for the embarkation. Sir Eustace had brought with him thirty archers and as many men-at-arms, and, as they were waiting on the strand for the boats that were to take them out to the ships to which they had been appointed, the king, who was personally superintending the operations, rode past. Sir Eustace saluted him. \"Is this your following, Sir Eustace?\" the king asked. \"It is, my lord king, and would that it were larger. Had we landed at Calais I should have been joined by another fifty stout Englishmen from Villeroy, and should we in our marches pass near it I will draw them to me. Your majesty asked me to present to you my esquire, Guy Aylmer, who, as I had the honour of telling you, showed himself a brave and trusty gentleman, when, during the troubles, he was in Paris with my wife. Step forward, Guy!\" The latter did so, saluted the king, and stood erect in military attitude. \"You have begun well,\" the king said graciously; \"and I hereby request your lord that in the day of battle he will permit you to fight near me, and if you bear yourself as well when fighting for your king as you did when looking after your lady mistress, you shall have your share of honours as well as of blows.\" The king then rode on, and Sir Eustace and Guy took their places in a boat where the men had already embarked. \"This is something like, Master Guy,\" said Long Tom, who was in command of the archers. \"It was well indeed that I asked to come home to England when I did, else had I been now mewed up at Villeroy while my lord was fighting the French in the open field. Crecy was the last time an English king commanded an army in battle against France; think you that we shall do as well this time?\" \"I trust so, Tom; methinks we ought assuredly not to do worse. It is true that the French have been having more fighting of late than we have, but the nobles are less united now than they were then, and are likely to be just as headstrong and incautious as they were at Crecy. I doubt not that we shall be greatly outnumbered, but numbers go for little unless they are well handled. The Constable d\u0027Albrett is a good soldier, but the nobles, who are his equals in rank, will heed his orders but little when their blood is up and they see us facing them. We may be sure, at any rate, that we shall be well led, for the king has had much experience against the Scotch and Welsh, and has shown himself a good leader as well as a brave fighter. I hope, Tom, that you have by this time come to be well accustomed to your new bow.\" \"That have I. I have shot fourscore arrows a day with it from the time I reached home, not even omitting my wedding day, and I think that now I make as good shooting with it as I did with my old one. \u0027Tis a pity we are not going to Calais; if we had been joined by thirty archers there we should have made a brave show, and more than that, they would have done good service, for they are picked men. A few here may be as good, but not many. You see when we last sailed with our lord the times were peaceful, and we were able to gather the best shots for fifty miles round, but now that the king and so many of the nobles are all calling for archers we could not be so particular, and have had to take what we could get; still, I would enlist none who were not fair marksmen.\" This conversation took place as they were dropping down Southampton waters. Their destination was known to be Harfleur, which, as it was strongly fortified and garrisoned, was like to offer a sturdy resistance. The fleet was a great one, consisting of from twelve to fourteen hundred sail, which the king had collected from all the ports of England and Ireland, or hired from Holland and Friesland. The army consisted of six thousand five hundred horsemen and twenty-four thousand footmen of all kinds. On the 13th of August the fleet anchored in the mouth of the Seine, three miles from Harfleur. The operation of landing the great army and their horses occupied three days, the French, to the surprise of all, permitting the operation to be carried on without let or hindrance, although the ground was favourable for their attacks, As soon as the landing was effected the army took up its position so as to prevent any supplies from entering the town. They had with them an abundance of machines for battering the walls, and these were speedily planted, and they began their work. The garrison had been reinforced by four hundred knights and picked men-at-arms, and fought with great determination and valour, making several sorties from the two gates of the town. There were, however, strong bodies of troops always stationed near to guard the engines from such attacks, and the French sorties were not only repulsed, but their knights had much difficulty in winning their way back to the town. The enemy were unable to use their cannon to much effect, for a large supply of gunpowder sent by the French king was, on the day after the English landed, captured on its way into the town. The besiegers lost, however, a good many men from the crossbowmen who manned the walls, although the English archers endeavoured to keep down their shooting by a storm of arrows. The most formidable enemy, however, that the English had to contend with was dysentery, brought on by the damp and unhealthy nature of the ground upon which they were encamped. No less than two thousand men died, and a vastly larger number were so reduced by the malady that they were useless for fighting. The siege, however, was carried on uninterruptedly. The miners who had been brought over drove two galleries under the walls, and the gates were so shattered by stones and cannon-balls that they scarce hung together. The garrison surrendered after having by the permission of the English king sent a messenger to the King of France, who was at Vernon, to say that unless they were succoured within three days they must surrender, as the town was already at the mercy of the English, and received for answer that no army was as yet gathered that could relieve them. In addition to the ravages of dysentery the English army had suffered much from want of food. Large bodies of French troops were gathered at Rouen and other places, and when knights and men-at-arms went out to forage, they fell upon them and drove them back. Still a large amount of booty was gathered, together with enough provisions to afford a bare subsistence to the army. A considerable amount of booty was also obtained when Harfleur fell. The greater portion of the inhabitants of the town were forced to leave it, the breaches in the walls were repaired and new gates erected. A portion of the treasure obtained was divided by the king among the troops. The prisoners and the main portion of the booty—which, as Harfleur was the chief port of Normandy, and indeed of all the western part of France, was very great—he sent direct to England, together with the engines of war. The sick and ailing were then embarked on ships, with a considerable fighting force under the Earl of Warwick. They were ordered to touch at Calais, where the fighting-men were to be landed and the sick carried home, and Henry then prepared to march to Calais by land.","sourceLink":"http://novel.tingroom.com/duanpian/3141/86346.html","bookId":818,"book":{"id":818,"title":"At Agincourt","description":"简介： The long and bloody feud between the houses of Orleans and Burgundywhich for many years devastated France, caused a prodigious destruction of life and property, and was not even relaxed in the presence of a common enemyis very fully recorded in the p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3141","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
