{"id":36429,"no":4,"title":"CHAPTER III — A SIEGE","content":"The two men who had lit the alarm fires had already ridden in. They reported that they had, just as it became dark, seen flames rising from a village three miles from them, and that the man in advance had ridden forward until near enough to see that a great body of men were issuing from the village in the direction of the castle. Ten of the English men-at-arms, and as many French, were now posted in the outwork at the head of the drawbridge under the command of Jean Bouvard. Sir Eustace placed himself with his squire on the wall above the gate, and four men were stationed at the chains of the drawbridge in readiness to hoist it should the order be given. The English archers were on the wall beside Sir Eustace, as their arrows commanded the ground beyond the outwork. Half an hour after the first alarm was given the tale of the tenants was found to be complete, and the guards on the other two roads had also ridden in. Guy, to his great satisfaction, had been ordered by Sir Eustace to don his armour and to take his place beside him. It was upwards of an hour before a body of horsemen could be heard approaching. They came at a leisurely pace, for the bonfire on the road and that on the keep had apprised them that their hope of taking the castle by surprise had been frustrated by the disobedience of some of their men, who, in defiance of the strictest orders to the contrary, had set fire to several houses in the village after having plundered them. Sir Eustace, accompanied by his esquire and Guy, descended from the wall and crossed the drawbridge to the outwork. As soon as the horsemen came within bow-shot of the castle they lighted some torches, and three knights, preceded by a trooper carrying a white flag, and two others with torches, came towards the work. When within fifty yards of the postern they halted. \"Is Sieur Eustace de Villeroy present?\" \"I am here,\" Sir Eustace replied, and at his order two men with torches took their place one on each side of him. \"Who are you that approach my castle in armed force?\" \"I am Sir Clugnet de Brabant, Admiral of France. These are Sir Manessier Guieret and Sir Hugh de Fruges, and we come in the name of the Duke of Orleans to summon you to admit a garrison of his highness\u0027s troops.\" \"I am neither for Orleans nor for Burgundy,\" Sir Eustace replied. \"I am a simple knight, holding my castle and estate as a vassal of the crown, and am ready to obey the orders of the king,—and of him only when he is in a condition of mind to give such orders. Until then I shall hold my castle, and will admit no garrison whether of Orleans or of Burgundy.\" \"We hold you to be but a false vassal of the crown, and we are told that at heart you are an enemy to France and devoted to England.\" \"I am a vassal of England for the estates of my wife in that country,\" Sir Eustace said; \"and as at present there is a truce between the two nations, I can serve here the King of France as faithfully as if, in England, I should serve the King of England.\" \"Nevertheless, Sir Eustace, you will have to receive a garrison of Orleans. I have at my back eight thousand men, and if you compel me to storm this hold of yours I warn you that all within its walls will be put to the sword.\" \"Thanks for your warning, Sir Knight; and I on my part warn you that, eight thousand though you be, I shall resist you to the death, and that you will not carry eight thousand away. As for Sir Hugh de Fruges, I give him my open defiance. I know it is to him that I owe this raid; and if he be man enough, I challenge him to meet me in the morning on fair ground outside this postern, with lance and battle-axe, to fight to the death. If he conquers, my castle shall be surrendered to him, upon promise of good treatment and a safe-conduct to depart where they will for all within it; but if I slay him, you must give me your knightly oath that you and your following will depart forthwith.\" \"The conditions would be hardly fair, Sir Eustace,\" Sir Clugnet said; \"and though I doubt not that Sir Hugh would gladly accept them, I cannot permit him to do so. I have brought some eight thousand men here to capture this castle, and hold it for the Duke of Orleans, and I see not why I should march away with them because you may perchance prove a better fighter than Sir Hugh. I am ready, however, to give a safe-conduct to all within the walls if you will surrender.\" \"That will I not do, Sir Clugnet. I hold this castle neither for Burgundy nor Orleans, and am ready to give pledge that I will not draw sword for either of these princes; but if that will not content you, you must even take my castle if you can, and I give you fair warning that it will cost you dear.\" \"Then adieu, Sir Knight, until to-morrow morning, when we will talk in other fashion.\" \"So be it,\" Sir Eustace replied, \"you will not find me backward in returning any courtesies you may pay me.\" The knights turned away with their torch-bearers. \"Keep a close watch to-night, Bouvard,\" Sir Eustace said. \"Mark you what the knight said,—adieu till the morning. Had I to deal with a loyal gentleman I could have slept soundly, but with these adventurers it is different. It may be that he truly does not intend to attack till morning, but it is more likely that he used the words in order to throw us off our guard.\" \"We will keep close ward, Sir Eustace. All the men-at-arms have their cross-bows, and though I say not that they can shoot like these English archers, they can shoot straight enough to do good work should those fellows attempt in force to cross the small moat and attack the gate. But if they come, methinks it will be but to try if we are wakeful; \u0027tis no light thing to attack even an outwork like this, with this loop from the moat surrounding it, without previous examination of the ground and reconnoitring of the castle.\" \"They would not attempt to attack the fortress itself,\" Sir Eustace said; \"but if they could seize this outwork by surprise it would mightily aid them in their attack on the fortress; at any rate I will send down five archers, and if any of the enemy crawl up to see how wide the water is here, and how the attempt had best be made, I warrant that they will not return if the archers can but get a sight of them. Post half your men on the wall, and let the others sleep; change them every two hours—we want no sleepy heads in the morning.\" By this time the confused sound of a large number of men marching could be made out, and a quarter of an hour later three or four cottages, some five hundred yards away, were fired, and an angry murmur broke from the men as the flames shot up. After sending down the five archers, Sir Eustace returned to his post over the main gate. \"Get cressets and torches in readiness to light if they attack the postern,\" Sir Eustace said; \"we must have light to see how things go, so that we may hoist the drawbridge as soon as our men are upon it, should the enemy get the better of them. Be sure that one is not left behind; it were better that half a dozen of the enemy set foot on the drawbridge than that one of our brave fellows should be sacrificed.\" \"I should think that there is no fear of their attacking until those flames have burnt down; we should see them against the light,\" John Harpen said. \"No, there is no fear of their attacking; but the fire would be of advantage if any men were crawling up to spy. Of course they would not cross the slope in a line with the fire, but would work along on either side, reckoning, and with reason, that as our men would have the light in their eyes they would be all the less likely to make out objects crawling along in the shade by the side of the moat. Plant half a dozen bowmen at intervals on the wall, Tom, and tell them to keep a shrewd eye on the ground near the moat, and if they see aught moving there to try it with an arrow.\" There was shouting and noise up by the burning cottages, where the enemy were feasting on the spoils they had taken, and drinking from the wine-barrels that had been brought with them in carts from the last village that they had plundered. \"I wish we were somewhat stronger, or they somewhat weaker,\" Sir Eustace said; \"were it so, we would make a sally, and give the knaves a sharp lesson, but with only two hundred men against their eight thousand it would be madness to try it; we might slay a good many, but might lose a score before we were back in the castle, and it would be a heavy loss to us.\" \"I was thinking that myself, Sir Eustace,\" his esquire said. \"That is the worst of being on the defence; one sees such chances but cannot avail one\u0027s self of them.\" In the castle everything was quiet, and all those not on duty were already asleep. Along the wall watchers stood at short intervals peering into the darkness, but the main body there were also stretched on the wall with their arms by their side until required to be up and doing. Now that Sir Eustace was himself at the gate his esquire went round the walls at short intervals to be sure that the men on watch were vigilant. Presently a loud cry was heard from the corner of the moat away to the right. \"Go and see what is doing, Guy,\" Sir Eustace said, \"and bring me news.\" Guy ran along to the angle of the wall. Here one of the archers was posted. \"What is it, Dickon?\" \"A man crept up to that corner opposite, Master Guy. I could not have sworn to him, it is so pesky dark, but I thought there was something moving there and shot almost at a venture, for I could scarce see the end of my arrow; but it hit there or thereabouts, for I heard him shout. A moment later he was on his feet and running. I could see him more plainly then, so I shot again, and over he went. I fancy that in the morning you will see my arrow sticking up somewhere between his shoulder-blades, though there is no saying precisely, for a nicety of shooting is not to be looked for in the dark.\" \"You have done very well, Dickon. Keep your eyes open; we may be sure there are more than one of these fellows about.\" Guy hurried back with the news. \"That is good,\" said Sir Eustace, \"and it was just as well that the archer did not kill him outright with his first arrow, the cry will show any of his comrades who may be about that they had best keep their distance from the walls.\" A minute\u0027s silence followed, and then Long Tom said, \"There is another has had his lesson, Sir Eustace. I heard a bow twang across there, and as there was no cry you may be sure that the shaft sped straight, and that the man had no time to utter one.\" \"He may have been missed altogether, Tom.\" \"Missed altogether! no indeed, Sir Eustace, there is no fear of that. There is not one of the men on the wall who would miss a man whose figure he could make out at fifty yards\u0027 distance, and they would scarce see them until they were as close as that. No, my lord, I would wager a month\u0027s pay that when morning dawns there is a dead man lying somewhere in front of the outwork.\" \"Now, Guy, you had best go up to your room and lie down until daylight,\" Sir Eustace said. \"There will be naught doing to-night, and unless I am mistaken, we shall be busy from sunrise till sunset. I shall myself lie down for a couple of hours presently, and then send John Harpen to rest till daylight. Long Tom, see that you yourself and all your men take a short sleep by turns; we shall need your eyes to be open above all others to-morrow.\" Guy promptly obeyed the order. Dame Margaret was still up. \"Is everything quiet, Guy?\" she asked as she entered, \"So quiet, my lady, that Sir Eustace has ordered me to bed, and he said that he himself should come down for a short sleep presently. Two spies who crawled up have been slain by the archers. Sir Eustace is sure that no attack will be made before morning.\" Then he went into his little room and threw himself onto his pallet. During the first few minutes he lifted his head several times fancying that he heard noises; then he fell into a sound sleep and did not awake until the day dawned. In a few minutes Guy was on the wall. The night had passed quietly; so far as was known no fresh attempt at reconnoitring the works had been made, and as the moon had risen soon after he had gone to bed there was reason to believe that the fact that the two spies had not returned was so strong a proof of the vigilance of the garrison, that the enemy had been content to wait until morning. Just as the sun rose the three knights who had summoned the castle on the preceding evening appeared on the brow of the opposite slope, accompanied by a body of men-at-arms, and rode slowly round the castle. From time to time they halted, and were evidently engaged in a discussion as to the point at which it could be best attacked. \"Shall I shoot, my lord?\" Long Tom asked. \"They are some two hundred and fifty yards away, but from this height methinks that I could reach them.\" \"It would be useless,\" Sir Eustace said; \"you could hit them, I doubt not, but you would not pierce their armour at this distance, and it is as well that they should not know how far our bows will carry until we are sure of doing execution when we shoot; besides I would rather that they began the fight. The quarrel is not one of my seeking, and I will leave it to them to open the ball. It is true that they did so last night by sending their spies here, but we have balanced that account. Moreover, if they are to attack, the sooner the better. They may have gained news from Sir Hugh of the coming here of the English archers and the men-at-arms, but if they have not done so we shall have a rare surprise in store for them.\" After the knights had made a circuit of the castle they retired, and presently a dense mass of men appeared from behind the brow on which the cottages they had burned had stood. \"They have bundles of faggots, Sir Eustace!\" Guy exclaimed. \"So they have, Guy! Your eye is a good one. It seemed to me that the outline was a strange one, but doubtless it is as you say—that each man has a faggot on his shoulder. It is evident that they intend, in the first place, to assault the postern, and have brought the faggots to fill up the ditch.\" Then he turned to the gunners at the cannon. \"Lay your pieces so as to bear on them when they come half-way down the hill,\" he said, \"and shoot when they are fairly in the line of fire. Take the same orders, Guy, to the men working the ballistas and mangonels on the wall. Tell them not to loose their machines until after the guns are fired. If the fellows take to flight, tell them not to waste their missiles; if they advance, let them be sure that they are well within range before they shoot.\" With loud shouts the enemy came down the slope. When they were half-way down the two guns roared out, and their shot ploughed two lanes in the crowded body. There was a movement of retreat, but the three knights and several others threw themselves in front, waving their swords and shouting, and the Orleanists rallied and moved forward, but at a much slower pace than before. They had gone but a short distance when the arrows of the archers in the outwork and the bolts of the cross-bows worked by the men-at-arms there, began to fall among them. So true was the aim of the archers that scarce a shaft was wasted. At the distance at which they were shooting they did not aim at the knights, whose vizors and coats of mail could not have been pierced, but shot at the commonalty, whose faces and throats were for the most part unprotected. Man after man fell, and the cross-bow bolts also told heavily upon the crowd. They had come down but a short distance farther when Long Tom, and the archers with him on the wall, began to send their arrows thick and fast, and the machines hurled heavy stones with tremendous force among them. A moment later the French broke and fled up the slope again, leaving some fifty of their number stretched on the ground. The knights followed more slowly. When they reached the crest a group of them gathered around Sir Clugnet de Brabant. \"By my faith,\" the latter said bitterly, \"we have reckoned without our host, Sir Knights. We came to shear, but in good sooth we seem more likely to go back shorn. Truly those knaves shoot marvellously; scarce an arrow went astray.\" \"As I mentioned to you, Sir Clugnet,\" Sir Hugh de Fruges said, \"Sir Eustace brought with him from England five-and-twenty bowmen, and I heard tell from men who had seen them trying their skill at targets that they were in no wise inferior to those with whom we have before had to deal to our cost.\" \"Truly ye did so, Sir Hugh; but the matter made no impression upon my mind, except as a proof that the knight\u0027s inclinations were still with England, and that it were well that his castle were placed in better keeping; but in truth these fellows shoot marvellously, both for strength and trueness of aim. I marked as we came back that of the men we passed lying there, nigh all those who had been struck with arrows were hit in the face or throat, and yet the distance must have been over a hundred and fifty yards.\" \"I can answer for the force,\" one of the others said, \"for a shaft struck me fairly on the chest, and hurled me to the ground as if it had been the shock of a lance, and it is well my mail was of the best work of Milan; but nevertheless the arrow broke two of the links; if the distance had been shorter, I doubt not that it would have slain me. Well, what shall we do next, gentlemen? For very shame we cannot with eight thousand men march away having accomplished nothing. The question is, where shall our next attack be delivered?\" \"Methinks,\" another knight said, \"we delivered our attack too rashly. Had I known that there were English archers there I should have advised waiting until nightfall, and I think that it would be best to do so now. If we take our fellows up while there is light they will suffer so much from the stings of these wasps that they will soon lose heart. The knaves shoot not only straight and strong, but they shoot so fast that though, as you say, there may be but twenty-five of them, the air seemed full of arrows, and had you told us that there were two hundred archers shooting, I should have thought the estimate a reasonable one.\" They stood for some time discussing the best method of attack, and as soon as they had settled upon it the men were told to scatter. Some were to go to the farmhouses, and bring up any hides that might be stored there, and to fetch all the hurdles they could lay hands upon; a portion were to go to the woods and cut timber for making mantlets and cover, while two thousand were to remain under arms in case the garrison should make a sortie. Within the castle all were in high spirits at the easy repulse of the first attack. \"Sir Clugnet must have learned from Sir Hugh of my having English archers and men-at-arms here,\" Sir Eustace said to his lieutenant, \"and yet he advanced as carelessly and confidently as if he had been attacking a place defended only by fat Flemish burghers; however, he has had his lesson, and as it is said he is a good knight, he will doubtless profit by it, and we shall hear no more of him till after the sun has set. Run up to the top of the keep, Guy, and bring me back news what they are doing.\" In a few minutes the lad returned. \"There are two or three thousand of them, my lord, drawn up in a body beyond the crest; the rest of them are scattering in various directions.\" \"That is as I expected,\" Sir Eustace remarked; \"they have gone to prepare materials for a regular attack. It may be delivered to-night, or may be delayed for a day or two; however, we shall be ready for them. Jean Bouvard, do you go round the walls and tell all, save a few as sentries, to retire until the watchman blows his horn to warn us if they seem to be gathering for an attack; and do you, Long Tom, give the same orders to your archers. There is no use wasting the men\u0027s strength till the work begins in earnest. If Sir Clugnet is wise he will march away at once. He would need heavy machines and cannon to make a breach in our walls, and even had he an abundance of them it would take him some time to do so. If he tries again, you may be sure that it will be the work of Sir Hugh de Fruges, who has no doubt a lively interest in the matter. He is a clever fellow, and will no doubt do his best to work on the feelings of the other knights by representing that it would be disgraceful for so large a force to abandon the enterprise merely because a first hasty attack, delivered without preparation, had been repulsed. The fact that they have made so careful an examination of the castle would seem in itself to show that they intended to renew the attempt in another form if the first onset failed, and, moreover, the scattering of the force afterwards while the knights still remained with a large body here points in the same direction.\" Guy on descending from the keep joined Sir Eustace and his wife in their apartments. \"The lad has borne himself bravely,\" Sir Eustace said approvingly to his wife; \"he was standing beside me when their shot was bringing down the dust round our ears, and he neither started nor flinched, though in truth it was far from pleasant, especially as we had nothing to do but to look on. It may be next time we shall have sterner fighting, and I doubt not that he will bear himself well.\" \"Could I not come up and carry your messages, father?\" Henry asked; \"I am not strong like Guy, but I could do that.\" \"He is too young for it yet, Eustace,\" Dame Margaret broke in. \"Nay, wife,\" the knight said gently, \"the lad is not too young for such service. There will be little danger in it, for his head will not show over the battlements, and it is well that he should learn to hear without fear the whizz of an arrow or the shock of a great stone from a ballista, the clash of arms, and the shouting of men. As he says, he is not yet strong enough to bear arms, but he will learn to brace his nerves and show a bold front in danger; that is a lesson that cannot be learned too young. Yes, Henry, you shall be my messenger. If they try an assault to-night, you shall put on for the first time the steel cap and breastpiece I had made for you in England; there will be no danger of your being hit by crossbow bolt or arrow, but there may be splinters of stone flying when a missile hits the battlement. Take no arms with you, only your dagger; they would be useless to you, and would hamper your movements in getting past the men on the wall, or in running up and down the steps leading to it. Now you had better lie down; both Guy and myself are going to do so. At sunset, if no alarm comes before, you will be called.\" \"We must not coddle the boy, Margaret,\" he said as Guy and Henry went off. \"I know that he is not physically strong as yet, and sorry I am that it should be so, but he might exert himself more than he does, and he is apt to think too much of his ailments. I was glad when he volunteered to do something, for it is at least as well that he should be able to stand fire even if he cannot learn the use of arms; moreover, it may be that after once bearing a part in a fray he may incline more warmly to warlike exercises than he has hitherto done; it may rouse in him a spirit which has so far been wanting. I have often thought that it would have been better if Agnes had been the boy and he the girl; she has far more courage and fire than he has. You remember when that savage bull chased them, how she saw him first over the stile and got tossed over after him for her pains?\" Dame Margaret nodded. \"I am not likely to forget it, Eustace, seeing that her arm was broken and I had to nurse her for six weeks. Do you know that she was up on the top of the keep while the fighting was going on? Of course I was there myself, and she begged so hard to be allowed to remain with me that I had not the heart to say her nay.\" \"Was Henry there too?\" \"Oh, yes; and shouted with the best of them when the enemy fled over the hill. Even Charlie was there, and as excited as either of them. Of course, I had to hold him up sometimes for him to be able to see what was going on; and he looked rather pale at first, when they opened fire, but he soon plucked up when he saw that their shot did no damage near us. You see he is a strong healthy boy; while Henry has always been weak, although I do not think that he lacks courage.\" \"He ought not, wife; he comes from a fighting stock on either side. But I fear that unless he changes greatly he is cut out rather for a monk than a man-at-arms. And now I will lie down, for you may be sure that I shall not close an eye to-night. Did you note the banner of Hugh de Fruges with the others?\" \"Yes, and I felt more uncomfortable after seeing it. He is a crafty man, Eustace.\" \"He is not a brave one,\" the knight said scornfully. \"I challenged him to meet me outside in a fair field, and the craven did not answer me, and Sir Clugnet had to make speech for him and decline the offer.\" \"You will need all your vigilance, Eustace. I trust that every man within the walls is faithful to us; but if there be a traitor, be sure that Sir Hugh will endeavour to plot with him, nay, he may already have done so.\" \"They would have no chance of making communication with him were there a dozen of them, wife. Long Tom and his comrades will take good care that none come near enough for speech.\" The day passed away in perfect quiet. From time to time word came down from the look-out that the scattered soldiers were returning laden with a great quantity of young trees, wattles, and doors. Dame Margaret kept watch in her room, and allowed no messengers to enter her husband\u0027s apartments. \"If there be need, I will wake him,\" she said; \"but he knows well enough what the French have gone for, and there is naught to do until they advance to the attack.\" Guy slept but a short time, and as he frequently started up under the impression that the horn was sounding an alarm, in the afternoon he got up and went down into the courtyard. For some time he wandered about in the quarters occupied by the tenants. These had now settled down; the children were playing about as unconcernedly as if they had been on their fathers\u0027 farms; women were washing clothes or preparing the evening meal over little charcoal fires. A certain quantity of meat had been served out to each family, and they were therefore doing better than in their own houses, for meat was a luxury seldom touched by the French peasantry. Almost all who had entered the castle had brought with them a supply of herbs and vegetables; these, with a handful or two of coarsely-ground meal boiled into broth, constituted their usual fare, and the addition of a portion of meat afforded them great satisfaction. Some of the men were still asleep, in preparation for a long night\u0027s work; others were standing about talking in little groups; some were on the walls watching with gloomy faces the smoke wreaths that still rose from what had been their homes. Ducks, geese, and hens walked about unconcernedly looking for any stray grains that had passed unnoticed when they had last been fed, and a chorus of dissatisfied grunting arose from the pigs that had a large pen in the yard next to the huts. These were still smarting under a sense of injury excited not only by their removal from their familiar haunts, but by the fact that most of them had been hastily marked by a clipping of some kind in the ear in order to enable their owners to distinguish them from the others. Boys were carrying buckets of water from a well in the court-yard to the troughs for the cattle and horses, and the men-at-arms were cleaning their armour and polishing their steel caps. \"Well, Tom, I hope we shall get on as well to-night as we did this morning,\" Guy said to the leader of the archers. \"I hope so, Master Guy, but I would rather fight by day than by night; it is random work when you can neither see your mark nor look straight along your arrow. If we had a moon we should do well enough, but on these dark nights skill does not go for much; still, I doubt not that we shall give a good account of ourselves, for at any rate we shall be able to make them out before they come to close work. The women have been making a great store of torches to-day, and that will help us a bit, though I would that they could be planted fifty yards beyond the moat instead of on the walls, for although they will be of some use to us they will be of even more to the enemy. What think you that their plan will be?\" \"I should say that they are intending to march forward covered by mantlets of wattles and hides. They will plant them near the edge of the moat, and throw up some earthworks to shelter them and their machines; no doubt they will use the doors they have fetched from all the farmhouses for the same purpose.\" \"The doors will be more to the point, certainly,\" the bowman said. \"As to their hides and wattles, at fifty yards I will warrant our arrows go through them as if they were paper; but I cannot say as much about stout oaken doors—that is a target that I have never shot against; I fear that the shock would shiver the shafts. The mantlets too would serve them to some purpose, for we should not know exactly where they were standing behind them. As for their machines, they cannot have many of them.\" \"They had something like a score of waggons with them, Tom; these would carry the beams for half a dozen big ballistas; besides, they have their cannon.\" \"I don\u0027t make much account of the cannon,\" the archer said; \"they take pretty nearly an hour to load and fire them, and at that rate, however hard a shot may hit, it would be some time before they wrought much damage on the walls. It is the sound more than the danger that makes men afraid of the things, and, for my part, I would not take the trouble of dragging them about. They are all very well on the walls of a castle, though I see not that even there they are of great advantage over the old machines. It is true that they shoot further, but that is of no great use. It is when the enemy come to attack that you want to kill them, and at fifty yards I would kill more men with my shafts in ten minutes than a cannon would do with a week\u0027s firing. I wonder they trouble to carry them about with them, save that folks are not accustomed to their noise yet, and might open their gates when they see them, while they would make a stout defence if they had only ballistas and mangonels to deal with. I suppose when they have got the shelters close to the moat they will bring up planks to throw across.\" \"Yes, no doubt they will try that, Tom; but the moat is over wide for planks, and I think it more likely that they will have provided themselves with sacks, and filled them with earth, so as to make a passage across with them.\" \"As to the planks not being long enough, Master Guy, they could get over that easy enough. They would only have to send three or four swimmers across the moat, then thrust long beams over for those who had crossed to fix firmly, and then lay short planks across them.\" \"So they would, Tom; I did not think of that. Well, at any rate, I expect they will manage to get across the moat somehow and plant ladders against the wall.\" \"And we shall chuck them down again,\" Tom said. \"They won\u0027t care much for that. But as long as they cannot knock a breach in the walls I warrant that we can hold them.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3141/86331.html","bookId":818,"book":{"id":818,"title":"At Agincourt","description":"简介： The long and bloody feud between the houses of Orleans and Burgundywhich for many years devastated France, caused a prodigious destruction of life and property, and was not even relaxed in the presence of a common enemyis very fully recorded in the p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3141","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
