{"id":92295,"no":14,"title":"Page 14","content":"\\n\\n Frannie stood and slipped a shawl over her shoulders. Her feet were silent on the boards, her nightdress whispering as she crossed the small bedroom and put a hand on the door as if she would be able to feel his warmth through it. With no warning, she twisted the knob, and the large man caught himself before he could fall backward into a lady’s chamber.\\n\\n “What ails ye now?” he asked, pulling his kilt and unbuttoned shirt to rights and keeping his gaze politely averted from her bare feet.\\n\\n She couldn’t see his eyes in the dark, and that made it all the easier to answer, “You do.”\\n\\n He leaped to his feet and stood, dwarfing her. “I can keep watch downstairs in the parlor, if that would be easier. I know it’s damned improper, having a strange man about at night and not a lodger.” He frowned as he looked at the door of Casper’s empty room.\\n\\n She only put a hand on his arm and said, “Can I trust you?”\\n\\n “Aye.” It was half statement, half question.\\n\\n He hesitated for just a moment on the threshold of her room before following her inside. The house was dark, but she knew every inch of it. She wasn’t surprised to feel his fingers catch her gown as she walked to the closet door. Frannie had kept her family’s secret faithfully, the only one left to keep it since Bertram’s death. As she opened the closet door and pushed aside the layers of tweed and wool, a little thrill ran through her, making her swallow down a giddy giggle. Even Charles had never known about this. She had planned to tell him after their wedding, which had never happened.\\n\\n Thom’s breath was hot on her ear, one hand even hotter against the small of her back. “Dragging me into a closet, lass? I don’t think that’s going to help ye sleep.”\\n\\n “Close the door and come along.”\\n\\n She pulled the hook hidden under a coat, and when the panel slid aside, she reached behind for Thom’s hand and pulled him up a narrow staircase. Even as she shoved the coats aside, he didn’t grumble or question her, as if he understood that what he was about to see was important. The steps were tall and wooden and probably quite dusty, but it was too dark to know for sure. Frannie held her nightdress up in front, counting the steps until she felt the press of wood against her outstretched hand. The stair below hers creaked ominously as Thom stopped and waited, a solid presence behind her. Smiling to herself, she opened the door to the roof and stepped out into the most beautiful garden in London.\\n\\n The smell always struck her first. Green things and deep earth and robust, natural health. And, yes, goat. Next came the tweets of birds in the branches, just as sleepy as their captive brothers below. After a few steps in, the smooth stone under her feet turned to soft grass, and she sighed happily and looked up at the half-full moon that lit the milky glass of the greenhouse ceiling.\\n\\n “I’ll be damned,” Thom said softly under his breath. “Am I dreaming, lass?”\\n\\n “You’re no sleepier than I am,” she said with a grin.\\n\\n She tried to see it through his eyes, as if for the first time. She’d played in the secret garden all her life, had even taken her first steps here. Since first her parents’ and then Bertram’s passing, it had been a large part of her life, taking care of all the chores that allowed it to flourish. The small fruit trees, carefully pruned. The grass and rows of vegetables and tidy fences. The flowers and beehives, sleepily humming. The cantankerous but tiny goats that kept her in cream and milk when the rest of the city suffered. The troublesome process of turning their scat into the richest compost in the city. Even the high stone walls of the roof that hid the bounty within were painted the fresh, warm green of a summer that had ceased to be, ever since London had grown weak and watery with pollution and sharp with blud creatures. Frannie’s home was the tallest house for blocks. The glass ceiling could only be seen from an airship, and not many of those crossed this part of London. A small but powerful charm helped eyes slide away, should they actually land on the curved glass, which was carefully vented on the side so the wild birds could come and go.\\n\\n “This is why you’re so scared of the Coppers, aye?” Thom asked. “And my badge?”\\n\\n She looked up at the cold, indigo sky. “All very illegal, yes. If anyone ever found out, it would all be seized for the city. Probably ruined, as they ruin everything.”\\n\\n Looking all around, he put a hand on her shoulder, where the shawl had fallen aside. The warmth and weight of his touch seared through her.\\n\\n “This place is far too precious to be ruined,” he said gently.\\n\\n “This is where I go when I can’t sleep. When I feel unsafe or unquiet or too alone. I lie back in the grass and stare at the sky and just breathe.”\\n\\n With long familiarity, she went to a faded wooden trunk along the wall and cleared off the half-filled pots and trowels to lift the lid. When she turned back to face him with a rough wool blanket in her arms, a smile lit his face with the light of secrets shared and promises to come. A new heat unspooled in her belly, matching the wet warmth of the sun-kissed grass soft under her feet. He took the blanket from her, and she moved to an open patch where the grass was thick.\\n\\n “This is my favorite spot,” she said, and he tossed the blanket high, holding on to one side and letting it settle smoothly over the ground.\\n\\n Even though she’d done this a thousand times or more, this was her first experience in the garden with a man’s eyes on her body, on her face. She tried to avoid his gaze, busily bundling her shawl into a pillow and stretching out on the blanket, enjoying the trapped warmth of the greenhouse more than any coverlet and trying to ignore the fact that she wasn’t wearing nearly enough clothing. She had long ago decided that the rooftop greenhouse was a place beyond time, a place where nothing mattered but warmth and nature and light, and she struggled to convince herself further as Thom settled by her side, not touching but close enough that she could feel the brush of his kilt.\\n\\n Frannie stared up through the glass at the faraway glitter of stars. London’s famous fog swirled in and out between the moon and the greenhouse, but she found her favorite constellations, the Swan and the Great Bear. Thom was a still and silent presence at her side. Barely moving, barely breathing. On high alert, and waiting.\\n\\n An owl hooted overhead, and Thom startled.\\n\\n Frannie finally had to laugh. “A bit jumpy, there?”\\n\\n He sighed and chuckled and ran a hand through his hair, caught out. “Aye, well, I’m in an illegal garden, alone with a beautiful, half-dressed girl. I’m one step away from sitting on my hands.”\\n\\n Frannie ran fingers through the grass, the uneven blades tickling over her palm. “Time seems to stop here,” she murmured. “I used to come here and watch the stars spin and fall asleep to the sound of rustling leaves. I came here when my parents died. I came here the night my brother was killed.” She rolled to her side, her head on her hand as she looked at him. “I came here after you kissed me.”\\n\\n He looked down on her with soft, serious eyes. “I’ve regretted that. Poor wee thing. I didn’t mean to scare you away.”\\n\\n “I’m not a virgin, Thom.”\\n\\n He didn’t blink. Didn’t move.\\n\\n “I was engaged for one day, and then he used me and left me. My brother called him out to the Dueler’s Green, sword in hand. My brother lost.” Thom groaned and put his head in his hands, and she sat up, a hand on his forearm. “I’m not telling you so you’ll regret kissing me, nor so that you’ll pity me. I’m telling you so you’ll understand why I bolted. I’m skittish. No one’s touched me in years. I’m . . . apologizing. It was a nice kiss.”\\n\\n “No wonder you’ve no faith. Poor lass.”\\n\\n The way he said “poor” made it come out “puir,” and Frannie leaned forward slowly to put her head against his bicep. He stroked her braided hair gently and then wrapped his arm around her.\\n\\n “I had a wife.”\\n\\n She nodded against his chest, scared to speak and break the spell of the garden. Something about the sleepy warmth, the cool darkness beyond, and the charmed glass that kept it secret created a bubble of solitude that she didn’t care to end. Thom ran his fingers down the long braid in her hair, and he swallowed hard.\\n\\n “We were married young, and I left her behind when I did my service with the Scottish Navy. I didn’t know until I returned home with a bag of pearls that she had died in a fire just a few months after I left. I hadn’t been there. I couldn’t save her. Or the bairn she carried. I sold the pearls and left home again. I figured I would keep other families from losing their hearts, or die trying. Either was better than reminding myself of what I let happen. I should have been there.” He paused, and she heard his fingers scrape the stubble on his cheek, knocking away a tear, perhaps. “I don’t sleep so well, these days.”\\n\\n “I only sleep well here. Lie back beside me. Look at the stars. Feel the sun’s heat still in the ground.”\\n\\n He pulled back to look at her. “You’re a cheeky wee thing.”\\n\\n He scooted down and lay back on the blanket, arranging his kilt and settling his hands over his stomach.\\n\\n She stretched out on her back beside him, her feet crossed at the ankles. His elbow brushed hers, but it wasn’t enough.\\n\\n “Cheeky? Is that what they call it?” She shifted, setting her arm against his with quiet purpose. “From what I hear, the fine ladies of society have another word altogether for someone like me.”\\n\\n “Now, Frannie—”\\n\\n “I like the way you say my name. With that little trill on the r. And I don’t care what they would call me. That’s what I’m trying to tell you. I ran away when you kissed me because I can’t hide from my memories, not because I’m worried about my future. I made mistakes, and I have regrets, but I don’t want to run away anymore. You make me feel safe, make me realize that hiding isn’t actually living. Actions speak louder than words, for me. You make me want to live again.” She gazed up at the moon, praying to still her heart. “Are you still sitting on your hands?” \\n\\n","sourceLink":"https://allnovel.net/the-peculiar-pets-of-miss-pleasance-blud-2/page-14.html","bookId":1602,"book":{"id":1602,"title":"The Peculiar Pets of Miss Pleasance (Blud #2)","description":"Storyline: The Peculiar Pets of Miss Pleasance (Blud #1.6) \\n In a world ruled by blood, live pets are rare and kindness rarer still. London pet shop owner Frannie Pleasance has a mysterious way with animals and keeps her charges (and heart) locked in a veritable Eden. She thinks Casper Sterling is just another stray…until she takes in the troublesome lodger (and unwelcome suitor) and becomes the victim of a series of strange and dangerous occurrences. \\n When an unexplained fire threatens to destroy Frannie\u0027s carefully guarded world, firefighter Thom Maccallan is there to extinguish the blaze and help gather the lost creatures. The heat between Frannie and Thom begins to burn, but someone\u0027s still after the lady. Could it be Casper himself, or is Frannie’s new lodger just another victim of fate? Will they be able to figure out who\u0027s pursuing Frannie—and stop them—before she loses everything?\\n","cover":"https://allnovel.net/images/the-peculiar-pets-of-miss-pleasance-blud-2.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-peculiar-pets-of-miss-pleasance-blud-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:54:26 PM"}}
