{"id":69163,"no":10,"title":"Page 10","content":"\"So Dad sent you out to spy on me?\" she demanded coolly.\\n\\n Brand nodded reluctantly.\\n\\n \"When we met at the Blue Lagoon…it wasn’t by chance?\"\\n\\n \"Not exactly. I followed you there.\"\\n\\n Erin closed her eyes and placed her hand over her mouth. \"Dear heaven.\"\\n\\n \"I know it sounds bad.\"\\n\\n \"Bad?\" she cried. \"You… I was set up by my own father!\" She started pacing, because standing still was impossible. Turning abruptly, she glared at him with eyes she was sure conveyed her feelings exactly. \"What about everything else? The kissing, the…petting. Did Dad ask you to indoctrinate me into – \"\\n\\n \"Erin, no.\" He expelled his breath sharply and jammed his fingers into his scalp with enough force to remove a fistful of hair. \"Okay, I made a mistake. I should have told you the first night that your father and I are friends. If you want to condemn me for that, go ahead, I deserve it. But everything else was for real.\"\\n\\n Erin didn’t know whether she believed him or not, but at this point it didn’t matter. She crossed her arms and glared at the ceiling, trying fruitlessly to gather her thoughts and make sense of what had happened between them.\\n\\n \"I liked you the minute I saw you,\" Brand admitted slowly, \"and the feeling has intensified each and every day since. I don’t know what’s happening between us. It’s crazy, but I feel… Hell, I don’t know what I feel, other than the fact I don’t want to lose you.\"\\n\\n \"That’s what I can’t make you understand,\" she cried. \"You lost me the minute I realized you were navy.\"\\n\\n \"Erin…\"\\n\\n \"I think you should go.\" The lump in her throat made it impossible for her to speak distinctly. When Brand didn’t budge, she pointed the way to the door. \"Please, just leave.\"\\n\\n Brand hesitated, then nodded. \"All right, I can see I’ve really messed this up. At the rate I’m going, I’ll only make matters worse. I’ll try to give you a call before I leave tomorrow.\"\\n\\n She nodded, although she hadn’t a clue what she was agreeing to.\\n\\n \"I’ve got your address.\"\\n\\n Once more she moved her head, willing to concede anything as long as he would get out of her home, her safe haven, and leave her alone. She felt shocked as she rarely had been. Shaken and hurt. To the best of her knowledge, her father had never done anything like this before. Once she got through with him, she would damn well make sure he wouldn’t again.\\n\\n Brand paused at the front door. \"I’m not saying goodbye to you, Erin.\" He stood there for the longest moment without moving. His eyes were filled with regret. It seemed that he wanted to say something more but changed his mind.\\n\\n Erin looked away, not wanting to encourage him to do anything but leave her in peace. Or whatever was left of that precious commodity.\\n\\n The door closed, and she glanced up to discover that Brand was gone. A breath rattled through her lungs as she continued to stare into space.\\n\\n It was over. Brand Davis had left.\\n\\n Brand closed his eyes as he listened to the message on Erin’s answering machine for the tenth time. He was paying long-distance rates to speak to a stupid tape recorder. Not that it had done any good. Not once had she returned his call.\\n\\n She hadn’t even tried.\\n\\n He’d contacted her every day since he’d returned to Hawaii, but he hadn’t spoken to her yet. It didn’t seem to matter what time of the day he phoned, she wasn’t home. Or if she was, she wasn’t answering.\\n\\n He’d tried writing too. Brand wasn’t much of a letter writer, but each night since he’d been back he had sat down faithfully and written to Erin. Not just short notes, either. Real letters, sometimes two and three pages each. He wrote about things he’d rarely shared with longtime friends. He wasn’t revealing deep, dark secrets, just feelings. Feelings a man wouldn’t easily convey to another human being unless that person was someone special. Erin was more than special. Until he’d left Seattle, Brand hadn’t realized how important Casey’s daughter had become to him.\\n\\n Ten days into his letter-writing campaign, he had yet to receive so much as a postcard from her. It didn’t take a master’s degree for him to figure out that his sweet Irish rose had no intention of answering his letters, either.\\n\\n Rarely had Brand felt more discouraged. He was frustrated enough to contact Casey MacNamera.\\n\\n \"Casey, you old goat, it’s Brand,\" he said, speaking into the telephone receiver. The long-distance wire hummed between them. Casey had retired in Pensacola, Florida.\\n\\n \"Well if it isn’t Face Davis, himself. How you doing, boy?\"\\n\\n \"Good. Real good.\" Which was only a slight exaggeration.\\n\\n \"I take it you told Erin about me asking you to check up on her. Good grief, that girl nearly had a conniption right on the phone. I don’t think I’ve ever heard her more shooting mad. Nearly shouted me ears off, she did.\" The pot-bellied MCPO paused to chuckle, as if the whole matter were one of great amusement.\\n\\n \"I didn’t mean to give it away,\" Brand said by way of apology. \"We sort of hit it off… Erin and me.\" He paused, hoping Casey would make some comment either way. He didn’t.\\n\\n \"That oldest girl of mine has got a temper on her. If you ever cross her, the best advice I can give you is to stand back and protect yourself from the fireworks.\"\\n\\n \"Speaking of Erin,\" Brand said, delicately leading into the purpose of this call, \"how is she?\"\\n\\n \"I can’t rightly say.\" Casey paused and chuckled again. \"She didn’t get around to telling me anything about her health. She was far more concerned about giving me a solid piece of her mind.\"\\n\\n \"Did she say anything about me?\"\\n\\n Casey paused. \"Not really. Only that she didn’t appreciate the fact I’d sent you her way.\"\\n\\n \"I appreciated it.\"\\n\\n \"You did?\" Casey’s voice lowered suspiciously. \"What makes you say that?\"\\n\\n \"Erin and 1 dated two or three times. You’ve done yourself proud, you old goat. Erin’s a wonderful woman.\"\\n\\n \"She’s not your type.\"\\n\\n Brand was about to take offense at that. \"Why isn’t she?\"\\n\\n \"I thought you liked your women sleek and sophisticated. Erin’s not like that. Not in the least. The girl’s meat-and-potatoes.\"\\n\\n \"1 like Erin. In fact, I like her a whole lot. I hope that doesn’t offend you, because I intend to see more of her.\"\\n\\n Brand expected a long list of possible responses from Casey. It didn’t include laughter, but laugh was exactly what Casey MacNamera did. In fact, he burst into loud chuckles, as if Brand had just told the funniest joke of the year.\\n\\n \"Good luck, Brand. You’re going to need it with my Erin. That woman’s stubborner than a Tennessee mule. I don’t want to discourage you, but she won’t have anything to do with someone in the navy.\"\\n\\n \"I plan to change her mind.\"\\n\\n \"As far as I can see, you’ve got a snowball’s chance in hell of ever doing that. Now, before I forget it, tell me how it is you got chosen for this cushy assignment. I should have known that handsome face of yours was going to get you a boondoggle one of these days. Where you headed to next?\"\\n\\n \"San Francisco.\" And none too soon, as far as Brand was concerned, because the city was only six hundred miles from Seattle. And that was a hell of a lot closer than Hawaii.\\n\\n \"Oh, please, don’t let there be another letter from Brand,\" Erin prayed aloud as she pulled into her driveway. For twenty days straight, she’d received a letter from him every day.\\n\\n Twenty days.\\n\\n She walked up to the mailbox on her porch and lifted the lid. Two flyers and a bill. There wasn’t a letter.\\n\\n Unreasonably disappointed, she sorted through everything again, and then stuck her hand back inside the mailbox. It was there, tucked down in the back.\\n\\n Erin didn’t know whether she should be upset or relieved. What did it matter? She’d been of two minds from the moment she’d met Brand Davis.\\n\\n Two minds and one heart.\\n\\n Opening her front door with her key, Erin walked inside her home and slapped everything down on the kitchen counter. Making herself a cup of tea, she leafed through the flyers and set the bill aside.\\n\\n Once the tea was made, she reached for Brand’s letter, opening it with her index finger. She counted five pages. Five long, single-spaced, handwritten pages. Wouldn’t he ever stop?\\n\\n \"Oh, please, make him stop writing,\" she pleaded once more as her gaze hungrily scanned each word, canceling out her prayer.\\n\\n When the first letter had arrived, Erin had righteously marched to the outside garbage can and tossed it inside.\\n\\n She’d refused to read a single line of what that deceiver had written. From there, she’d made herself dinner, muttering sanctimonious epithets directed at the lieutenant j.g. and then headed off to her Women in Transition class, feeling downright pious about having tossed out the letter.\\n\\n The feeling hadn’t lasted long.\\n\\n At nine-thirty, when she’d returned from class, she’d reached for her flashlight and, without a pause, started rooting through the garbage until she found the envelope.\\n\\n She’d called herself every word for fool that she could think of in the days since. As much as she hated to admit it, each night she rushed home, eager for word from Brand.\\n\\n She was living in a fool’s paradise. Nothing would come of this. First off, she had no intention of ever answering him.\\n\\n Nor did she intend to see him again. Their differences were irreconcilable, as far as she could discern. There were no compromises for her and Brand. He was military, and she adamantly refused to fall in love with someone in the armed services – especially someone in the navy.\\n\\n Each and every time they’d been together, they’d hashed over their differences. There was no way to arbitrate this issue, no meeting in the middle. Nothing he could say would change her mind. Nothing she could say would alter his. Rehashing their differences would only be a waste of time and energy, and Erin had enough on her mind as it was.\\n\\n The phone rang just as she was turning the last page of his letter. He was giving a humorous account of something he and his friend Alex had done. Without thinking, she reached for the receiver, not giving a thought to letting the recorder answer for her as had been her habit of late.\\n\\n \"Hello,\" she said softly.\\n\\n \"Erin? Erin, is that really you?\"\\n\\n It was Brand, and he sounded absolutely amazed that she’d answered the phone.\\n\\n Chapter Five\\n\\n \"Ah…\" Erin stammered, resisting the urge to replace the receiver and escape talking to Brand. That would be a coward’s way of handling the situation. She and Brand were bound to have a showdown one time or another, and the longer she delayed the confrontation the more difficult it would be.\\n\\n \"Okay, just listen,\" Brand said, speaking with authority, his voice slightly high-pitched, his words rushed. \"I’ve got everything I want to say all planned.\"\\n\\n \"Brand, please…\"\\n\\n \"You can tell me whatever it is you want when I’m finished, okay?\" \\n\\n","sourceLink":"https://allnovel.net/navy-brat-navy-3/page-10.html","bookId":1958,"book":{"id":1958,"title":"Navy Brat (Navy #3)","description":"Storyline: Navy Brat (Navy Series #3) \\n New York Times bestselling author Debbie Macomber will capture readers\u0027 hearts with the third title in her popular Navy series.\" After more than 12 years, Silhouette Books is proud to bring readers Debbie\u0027s greatly anticipated \"Navy\" stories once again. Erin MacNamera had one hard-and-fast rule: never, never, never fall for a navy man. From birth through college, Erin had lived and breathed the navy as her father\u0027s career moved her family countless times. Now all Erin wants is to put down roots and live a normal life. But then she meets navy man Brand Davis...and falls in love.\\n","cover":"https://allnovel.net/images/navy-brat-navy-3.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/navy-brat-navy-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:12:25 AM"}}
