{"id":69157,"no":4,"title":"Page 4","content":"\"I wasn’t sure you’d show,\" he said when he reached her side.\n \"I wasn’t sure I would, either.\" That was stretching the truth. She was a navy brat. Responsibility, promptness and duty had been programmed into her the way most children were taught to brush their teeth and make their beds. No one could live on a military base and not be affected by the value system promoted there.\n \"I’m glad you did decide to meet me.\" His eyes were warm and genuine, and she hurriedly looked away before she could be affected by them.\n \"Where would you like to eat?\" To Erin’s way of thinking, the sooner they arrived at the restaurant, the sooner she could leave. She wanted this evening to be cut-and-dried, without a lot of room for discussion.\n \"Ever been to Joe’s Grill?\"\n Erin’s gaze widened with delight. \"Yes, as a matter of fact, I have, but it’s been years.\" Since she was ten by her best guess. Her father had been stationed at Sand Point, and whenever there was something to celebrate he’d taken the family out to eat at Joe’s. Generally restaurants weren’t something a child would remember, but it seemed her family had a special place in each of the cities where they’d been stationed through the years. Joe’s Grill had been their Seattle favorite.\n \"1 asked around and heard the food there is great,\" Brand said, placing his hand at her elbow.\n She felt his touch, and although it was light and impersonal it still affected her. \"You mean the guys from Sand Point still eat there?\"\n \"Apparently so.\"\n A flood of happy memories filled Erin’s mind. For her tenth birthday, Joe himself had baked her a double-decker chocolate cake. She could still remember him proudly carrying it out of the kitchen as if he’d been asked to give away the bride. Visiting the restaurant had crossed her mind half a dozen times since she’d moved to Seattle, but with her hectic schedule she hadn’t gotten around to it.\n \"Joe’s Grill,\" she repeated, fighting the strong desire to fill in the details about her birthday and the cake to Brand. Her eyes met his, and mutual smiles emerged, despite Erin’s attempts to the contrary. She had to keep her head out of the clouds when it came to dealing with this handsome lieutenant j.g. Reminding herself of that was apparently something that was going to be necessary all evening.\n Brand’s car was parked on a side street. He held open the passenger door for her and gently closed it once she was inside.\n He did most of the talking as he drove to the restaurant. Every once in a while Erin would feel herself start to relax in his company, a sure sign she was headed for trouble. She’d give herself a hard mental shake and instantly put herself back on track.\n When Brand eased the vehicle into Joe’s crowded parking lot, Erin looked around her and nearly drowned in nostalgia. She swore the restaurant hadn’t changed in nearly twenty years. The same neon sign flashed from above the flat-topped roof, with a huge T-bone steak lit up in red and Joe’s Grill flashing off and on every two seconds.\n \"As I recall, the steaks here are so thick they resemble roasts, and the baked potatoes were larger than a boxer’s fist.\" She was confident that was an exaggeration, but in her ten-year-old mind that was the way it seemed.\n \"That’s what my friend said,\" Brand said, climbing out of the car.\n The inside was much as Erin remembered. A huge fish tank built into the wall was filled with a wide variety of colorful saltwater fish. The cash register rested on top of a large glass display case full of tempting candy and gum. Erin never had understood why a restaurant that served wonderful meals would want to sell candy to its customers afterward.\n The hostess escorted them to a table by a picture window that revealed a breath-taking panorama of Lake Union.\n Erin didn’t open her menu right away. Instead, she looked around, soaking up the ambience, feeling as if she were a kid all over again.\n \"This reminds me of a little place on Guam,\" Brand said, his gaze following hers. \"The tables have the same red tablecloths under a glass covering.\"\n \"Not…\" She had to stop and think.\n \"The Trattoria,\" Brand supplied.\n \"Yes.\" Erin was impressed he’d even heard of it, but then he probably had since everyone stationed on Guam ate there at one time or another. \"They serve a clam spaghetti my father swore he would die for. My mom tried for years to duplicate the recipe and finally gave up.\n Who would ever believe a tiny restaurant on the island of Guam would serve the best Italian food in the world?\"\n \"Better even than Miceli’s in Rome?\" he probed.\n \"You’ve been to Miceli’s?\" she asked excitedly. Obviously he had, otherwise he wouldn’t have mentioned it. The fresh-from-the-oven-bread was what she remembered about Miceli’s. The aroma would drift through the narrow cobblestoned streets of the Italian town like nothing Erin had ever known. Her stomach growled just thinking about it.\n \"I’ve been in the navy nearly fifteen years,\" he reminded her.\n Mentioning the fact that he was navy was like slapping a cold rag across her face and forcing her back to reality. Her reaction was immediate. She reached for the menu, jerked it open and decided what she intended to order in three seconds flat. She looked up, hoping to catch the waitress’s eye.\n \"I can’t decide if I’m hungry enough for the T-bone or not,\" Brand remarked conversationally. He glanced over the menu a second time before looking to her. \"You’ve decided?\"\n \"Yes. I’ll have the peppercorn filet.\"\n Brand nodded, apparently saluting her choice. \"That sounds good. I’ll have the same.\"\n \"No,\" Erin said, surprised by how adamant she sounded. \"Have the T-bone. It’s probably the best of any place in town. And since you’re only going to be in Seattle a few weeks, you really should sample Joe’s specialty.\"\n \"All right, I will.\" Brand smiled at her, and Erin’s heart started to pound like a giant sledgehammer, a fact she chose to ignore.\n The waitress arrived to take their order, and Brand suggested a bottle of wine.\n \"No, thanks, none for me,\" Erin said quickly. After what had happened the night they’d met, she’d considered living her entire life without drinking wine again. It was probably ridiculous to blame two glasses of Chablis for the eager way she’d responded to Brand’s kisses. But it was an excuse, and she badly needed one. She certainly wasn’t looking for a repeat performance. Her objective was to get through this dinner, thank Brand and then go her own way. Naturally she wanted them to part with the understanding she didn’t ever intend to date him again. But she wanted to be sure he realized it was nothing personal.\n The conversation that followed was polite, if a tad stilted. Erin’s hand circled the water glass, and her gaze flittered across the restaurant, gathering in the memories.\n \"I made a mistake,\" Brand announced out of the blue, capturing her attention. \"I shouldn’t have reminded you I’m navy. You were enjoying yourself until then.\"\n Erin lowered her gaze to the red linen napkin in her lap. \"Actually, I’m grateful. It’s far too easy to forget with you.\" As she spoke, Erin could hear a thread of resentment and fear in her own voice.\n \"I was hoping we might be able to forget about that.\"\n \"No,\" she answered, softly, regretfully. \"I can’t allow myself to forget. You’re here for how long? Two, three weeks?\" She asked this as a reminder to herself of how foolish it would be to become involved with Brand.\n \"Two weeks.\"\n \"That’s what I thought.\" Her gaze drifted toward the kitchen in a silent appeal to the chef to hurry with their order. The more time she spent with Brand, the more susceptible she was to his charm. He was everything she feared. Appealing. Attractive. Charming. She was beginning to hate that word, but it seemed to fit him so well.\n He asked her about the places she’d lived, and she answered him as straightforwardly as she could, trying not to let the resentment seep into her voice. Her answers were abridged, clipped.\n Their meal arrived, and none too soon, as far as Erin was concerned.\n Brand’s steak was delicious. As delicious as Erin had promised, cooked to perfection. He didn’t know what to make of Erin MacNamera, however. Hell, he didn’t know what to make of himself. She’d made her views on seeing him plain enough. He didn’t know what it was about her that affected him so strongly. The challenge, perhaps. There weren’t many women who turned him down flat the way she had.\n The challenge was there, he’d admit that, but it was something else, too. Something he couldn’t quite put his finger on. Whatever it was, Erin was driving him crazy.\n They’d agreed to meet outside her office building, and Brand had half expected her to stand him up. When she had shown, he’d noted regretfully that it wasn’t out of any desire to spend time with him. At first she’d been tense. They’d started talking, and she’d lowered her guard and been beginning to relax. Then he’d blown it by reminding her he was in the navy.\n From that point on he might as well have been sitting across the table from a robot. He’d asked her something, and she’d answered him with one-word replies or by simply shrugging her shoulders. After a while he’d given up the effort. If she wanted conversation with her dinner, then she could damn well carry it on her own.\n It didn’t come as any surprise to Brand that she was ready to leave the minute they finished. He collected the bill, left a generous tip and escorted Erin to the car.\n \"Are you parked at the same lot off Yesler?\" he asked once they were in traffic.\n \"Yes. You can drop me off there, if you don’t mind.\"\n \"I don’t.\" Brand noted that she sounded downright eager to part company with him. This woman was definitely a detriment to his ego. Fine, he got the message. He wasn’t exactly sure why he’d even suggested this dinner date. As Erin had taken pains to remind him, he would be in Seattle only a couple of weeks. The implication being that he’d be out of her life forever then. Apparently that was exactly what she wanted.\n In retrospect, Brand was willing to admit why he’d asked her out to dinner.\n It was the kiss.\n Her response, so tentative in the beginning, so hesitant and unsure, had thrown him for a loop. If Casey was ever to find out Brand had kissed his red-haired daughter, there would be hell to pay. The sure wrath of his friend hadn’t altered the fact Brand had wanted to kiss Erin. And kiss her he had, until his knees had been knocking and his heart had been roaring like a runaway train.\n What had started out as a challenge had left him depleted and shaken. Numb with surprise and wonder. Erin had flowered in his arms like a rare tropical plant. She was incredibly sweet, and so soft that he’d been forced to use every ounce of restraint he possessed not to crush her in his arms.\n This dinner date was a different story. She could hardly wait to get out of his car. Fine. He’d let her go, because frankly he wasn’t much into cultivating a relationship with a woman who clearly didn’t want to have anything to do with him. \n","sourceLink":"https://allnovel.net/navy-brat-navy-3/page-4.html","bookId":1958,"book":{"id":1958,"title":"Navy Brat (Navy #3)","description":"Storyline: \n Navy Brat (Navy Series #3) \n New York Times bestselling author Debbie Macomber will capture readers\u0027 hearts with the third title in her popular Navy series.\" After more than 12 years, Silhouette Books is proud to bring readers Debbie\u0027s greatly anticipated \"Navy\" stories once again. Erin MacNamera had one hard-and-fast rule: never, never, never fall for a navy man. From birth through college, Erin had lived and breathed the navy as her father\u0027s career moved her family countless times. Now all Erin wants is to put down roots and live a normal life. But then she meets navy man Brand Davis...and falls in love.\n \n","cover":"https://allnovel.net/images/navy-brat-navy-3.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/navy-brat-navy-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:12:25 AM"}}
