{"id":108004,"no":15,"title":"Page 15","content":"FORTY-ONE\\n\\n TORCELLO\\n\\n VIKTOR\u0027S MIND RACED. THE TURTLE CONTINUED ITS PROGRAMMED assault of the museum\u0027s ground floor, leaving a stinking trail of Greek fire. He thought about trying to force the double doors with Rafael, but he knew the wood\u0027s breadth and the bar outside would make any effort foolish.\\n\\n The windows seemed the only way out.\\n\\n \"Get one of the vacuum packs,\" he said to Rafael, as his eyes raked the room and he decided on the set of windows to his left.\\n\\n Rafael retrieved one of the clear plastic bags from the floor.\\n\\n The Greek fire should weaken the aged wrought iron, along with the bolts that held the bars to the exterior wall, enough that they could force them. He drew one of the guns they\u0027d obtained in the warehouse and was just about to shoot out the panes when, from the far side of the room, glass shattered.\\n\\n Someone had shot out the window from outside.\\n\\n He ducked for cover, as did Rafael, waiting to see what would happen next. The turtle continued its rhythmic crawl, stopping and starting as it encountered obstacles. He had no idea how many people were outside and whether or not he and Rafael were vulnerable from the three other sets of windows.\\n\\n He felt the edge of danger on which they were balancing. One thing was clear. The turtle needed to be stopped. That would buy them some time.\\n\\n But still.\\n\\n They knew nothing.\\n\\n CASSIOPEIA STUFFED THE GUN BACK AGAINST HER SPINE AND gripped the fiberglass bow she\u0027d removed from the cloth bag. Thorvaldsen had not questioned why she needed a bow and high-velocity arrows, and she\u0027d not really known if the weapon would prove useful.\\n\\n But now it certainly would.\\n\\n She was standing thirty meters from the museum, dry under the basilica\u0027s porch. On her way from the other side of the island, she had stopped in the village and retrieved one of the oil lamps that illuminated the quayside near the restaurant. She\u0027d noticed the lanterns earlier when she and Malone first arrived, which was another reason why she\u0027d asked Thorvaldsen for the bow. She\u0027d then found some rags in a trash bin near a vendor stall. While the thieves tended to their mission inside the museum, she\u0027d prepared four arrows, wrapping strips of cloth around the metal tips and soaking them with lamp oil.\\n\\n Matches were obtained during dinner with Malone-a few books retrieved from a tray in the restroom.\\n\\n She lit the flammable rags on two of the arrows, then carefully loaded the first flaming projectile onto the bow. Her aim was for the ground-floor windows that she\u0027d just shattered with bullets. If Viktor wanted a fire, then that was precisely what he was going to get.\\n\\n She\u0027d learned archery as a child. Never had she hunted, she detested the thought, but she regularly enjoyed target practice at her French estate. She was good, especially at distances, so thirty meters to the window across the piazzetta was no problem. And the bars themselves should not be a deterrent. Far more air than iron.\\n\\n She stretched the string.\\n\\n \"For Ely,\" she whispered.\\n\\n VIKTOR SAW FLAMES STREAK THROUGH THE OPEN WINDOW AND crash into a tall sheet of glass that backed one of the ground-floor exhibits. Whatever propelled the flames had pierced the glass, the sheet smashing to the hardwood and taking the fire down with it. The turtle had already made a pass of that part of the museum, which was confirmed by a roar, as Greek fire sprang to life.\\n\\n Orange and yellow instantly evolved into a scorching blue and the floor consumed itself.\\n\\n But the vacuum packs.\\n\\n He saw that Rafael had realized the same thing. Four lay scattered. Two atop display cases, two on the floor, one of which announced its presence in a cascade of mushrooming flames.\\n\\n Viktor dove under one of the remaining display cases, seeking shelter from the heat.\\n\\n \"Get back here,\" he yelled to Rafael.\\n\\n His partner retreated toward him. Half the ground floor was now ablaze. Floor, walls, ceilings, and fixtures all burned. Where he\u0027d taken refuge had yet to catch, thanks to a lack of the potion, but he knew that would only last another precious few moments. The stairway leading up began to his right, the path toward it clear. But the top floor would provide little refuge considering the fire would shortly obliterate it from beneath.\\n\\n Rafael came close. \"The turtle. You see it?\"\\n\\n He realized the problem. The device was heat sensitive, programmed to explode when temperatures reached a predetermined level. \"How high is it set?\"\\n\\n \"Low. I wanted this place to burn fast.\"\\n\\n His eyes searched the flames. Then he spotted the turtle, still cruising across the blazing floor, each exhale from its funnel roaring like a fire-breathing dragon.\\n\\n More glass shattered from the opposite side of the room.\\n\\n Hard to tell if heat or bullets had been the culprit.\\n\\n The turtle rolled straight for them, emerging from the fire and finding a part of the floor that had yet to catch. Rafael stood and, before Viktor could stop him, rushed toward the device. Deactivating it was the only way to shut off its program.\\n\\n A flaming arrow pierced Rafael\u0027s chest.\\n\\n His clothes caught fire.\\n\\n Viktor came to his feet and was about to dart to his partner\u0027s aid when he saw the turtle\u0027s funnel retract and the unit halt its advance.\\n\\n He knew what was about to happen.\\n\\n He dove for the stairway, lunging forward through the open doorway and scampering up the metal runners.\\n\\n On hands and knees he climbed in a desperate retreat.\\n\\n The turtle ignited.\\n\\n CASSIOPEIA HAD NOT PLANNED ON SHOOTING ONE OF THE thieves, but the man had appeared just as she released the string. She watched as the flaming arrow slammed into his chest and his clothing ignited. Then a huge ball of flame consumed the museum\u0027s interior, heat surging out the open window and exploding the remaining panes.\\n\\n She leaped to the wet ground.\\n\\n Fire licked the night through the shattered openings.\\n\\n She\u0027d left the basilica\u0027s porch and assumed a position opposite the museum\u0027s bell tower. At least one of the men was dead. Hard to tell which one, but it didn\u0027t matter.\\n\\n She came to her feet and shifted to the front of the building, watching the prison she\u0027d fashioned burn.\\n\\n One more flaming arrow ready to fire.\\n\\n FORTY-TWO\\n\\n VENICE\\n\\n ZOVASTINA STOOD BESIDE THE PAPAL NUNCIO. SHE\u0027D LANDED AN hour ago, Monsignor Michener waiting for her on the tarmac. She, Michener, and two of her guardsmen had traveled to central downtown from the airport via a private water taxi. They\u0027d been unable to use the basilica\u0027s north entrance, off the Piazzetta dei Leoncini, as first arranged. A sizable portion of San Marco had been cordoned off, some sort of shooting, the nuncio had told her. So they\u0027d detoured down a side street, behind the basilica, and entered the church from the diocese offices.\\n\\n The papal nuncio looked different from yesterday, his black robes and priest\u0027s collar replaced with street clothes. The pope was apparently making good on his pledge that the visit be nondescript.\\n\\n She now stood within the cavernous church, its ceiling and walls ablaze with golden mosaics. Clearly a Byzantine concoction, as if it had been erected in Constantinople instead of Italy. Five hemispherical cupolas vaulted overhead. The Domes of Pentecost, St. John, St. Leonard, the Prophets, and the one she was standing beneath, the Ascension. Thanks to a warm glow from strategically placed incandescent lights, she silently agreed that the church had earned its well-known label as the Golden Basilica.\\n\\n \"Quite a place,\" Michener said. \"Isn\u0027t it?\"\\n\\n \"It\u0027s what religion and commercial might can do when joined together. Venetian merchants were the scavengers of the world. Here\u0027s the best evidence of their pilfering.\"\\n\\n \"Are you always so cynical?\"\\n\\n \"The Soviets taught me that the world is a tough place.\"\\n\\n \"And to your gods, do you ever offer any thanks?\"\\n\\n She grinned. This American had studied her. Never in their previous conversations had they talked of her beliefs. \"My gods are as faithful to me as yours is to you.\"\\n\\n \"We\u0027re hoping you might reconsider your paganism.\"\\n\\n She bristled at the label. The word itself implied that somehow the belief in many gods was inferior to the belief in one. She didn\u0027t view it that way. Throughout history, many of the world\u0027s cultures had agreed with her, which she made clear. \"My beliefs have served me well.\"\\n\\n \"I didn\u0027t mean to imply they were wrong. It\u0027s only that we may be able to offer some new possibilities.\"\\n\\n After tonight, she would have little use for the Catholic Church. She\u0027d allow a limited amount of contact within the Federation, enough to keep the radical Muslims off balance, but never would an organization capable of preserving all that now surrounded her be allowed a foothold in her domain.\\n\\n She motioned toward the high altar, beyond an ornate multicolored rood screen that looked suspiciously like an iconostasis. She could hear activity from its brightly lit far side.\\n\\n \"They\u0027re preparing to open the sarcophagus. We\u0027ve decided to return a hand, arm, or some other significant relic that can be easily extracted.\"\\n\\n She couldn\u0027t resist. \"You don\u0027t see the ridiculousness in that?\"\\n\\n Michener shrugged. \"If it\u0027ll please the Egyptians, what does it hurt?\"\\n\\n \"What about sanctity of the dead? Your religion preaches that constantly. Yet there\u0027s apparently nothing wrong with disturbing a man\u0027s tomb, removing part of his remains, and giving them away.\"\\n\\n \"It\u0027s an unfortunate thing, but necessary.\"\\n\\n She despised his bland innocence. \"That\u0027s the thing I like about your church. Flexible when necessary.\"\\n\\n She stared around at the deserted nave, most of the chapels, altars, and niches cast in deep shadows. Her two guardsmen stood only a few meters away. She studied the marble floor, every bit as exquisite as the mosaic walls. Lots of colorful geometrical, animal, and flower motifs, along with unmistakable undulations-intentional, some said, to mimic the sea, but more likely the effect of a weak foundation.\\n\\n She thought of Ptolemy\u0027s words. And you, adventurer, for my immortal voice, though far off, fills your ears, hear my words. Sail onto the capital founded by Alexander\u0027s father, where sages stand guard.\\n\\n Though Ptolemy certainly believed himself clever, time had solved that part of the riddle. Nectanebo ruled Egypt, as pharaoh, during the era of Alexander the Great. While Alexander was a teenager, Nectanebo was driven into exile by invading Persians. Egyptians at the time firmly believed Nectanebo would one day return and expel the Persians. And nearly ten years after his defeat, this idea proved more or less true, when Alexander arrived and the Persians promptly surrendered and left. To elevate their liberator and make his presence more palatable, Egyptians told stories of how, early in his rule, Nectanebo had traveled to Macedonia, disguised as a magician, and coupled with Olympias, Alexander\u0027s mother, which would make Nectanebo, not Philip, Alexander\u0027s father. The story was utter nonsense but prevalent enough that five hundred years later it found its way into the Alexander Romance, a piece of fanciful historical fiction that many historians, she knew, erroneously cited as authority. During his reign as the last Egyptian pharaoh, history notes that Nectanebo established Memphis as his capital, which solved sail onto the capital founded by Alexander\u0027s father.\\n\\n The next part, where sages stand guard, reinforced that conclusion.\\n\\n At the temple of Nectanebo, in Memphis, stood a semicircle of eleven limestone statues depicting Greek sages and poets. Homer, whom Alexander worshipped, was a central figure. Plato, who taught Aristotle, and Aristotle himself, who taught Alexander, were there, too, along with other renowned Greeks to whom Alexander possessed a close connection. Only fragments of those sculptures remained, but enough to know they once existed.\\n\\n Ptolemy had entombed the body he believed to be Alexander at the temple of Nectanebo. There it stayed until after Ptolemy\u0027s death, when his son moved the body north to Alexandria.\\n\\n Sail onto the capital founded by Alexander\u0027s father, where sages stand guard.\\n\\n Go south to Memphis and the temple of Nectanebo.\\n\\n She thought of the next line of the riddle.\\n\\n Touch the innermost being of the golden illusion.\\n\\n And smiled.\\n\\n FORTY-THREE\\n\\n TORCELLO\\n\\n VIKTOR FLATTENED HIMSELF ONTO THE STAIRWAY, RAISING AN arm and shielding his face from the overwhelming heat that surged upward through the ground-floor doorway. The turtle had reacted to the rising temperatures, automatically disintegrating, doing what it was created to do. No way Rafael had survived. Greek fire\u0027s initial temperatures were enormous, enough to soften metal and burn stone, but its secondary heat was even more powerful. Human flesh was no match. As with what should have happened to the man in Copenhagen, Rafael would soon be ash.\\n\\n He turned back.\\n\\n Fire raged ten feet away.\\n\\n The heat was becoming unbearable.\\n\\n He hustled to the top.\\n\\n The old building was erected at a time when the first-floor ceiling doubled as the second story\u0027s flooring. The ceiling below was, by now, totally ablaze. One of the purposes of having the turtle explode was to force the destruction outward. Creaks and moans from the second-story floorboards confirmed their rapid devastation. The weight of the three display cases and the other bulky exhibits wasn\u0027t helping. Though the second story had not yet ignited, he realized that crossing the floor could be foolish. Thankfully, the stairwell where he stood was fashioned from stone.\\n\\n A set of double windows broke the wall a few feet away, facing the piazzetta. He decided to risk it and stepped lightly, hugging the outer perimeter, glancing through the panes, down below.\\n\\n CASSIOPEIA SAW THE FACE IN THE WINDOW. SHE INSTANTLY dropped the bow, gripped her gun, and fired two shots.\\n\\n VIKTOR LEAPED BACK INTO THE STAIRWELL AS THE WINDOW SHATTERED. He gripped his gun and prepared to return fire. He\u0027d seen enough to know that his attacker was a woman, clear from her silhouetted shape. She\u0027d been holding a bow, but had quickly replaced that weapon with a gun.\\n\\n Before he could take advantage of his higher ground, a flaming arrow bypassed the wrought-iron bars and pierced the open window, embedding into the plaster on the opposite side of the room. Thankfully, no turtle had saturated things here. Only the two packs he\u0027d left earlier, one on the floor, the other inside the pilfered display case, were potential problems.\\n\\n He needed to do something.\\n\\n So he took a cue from his attacker and shot out the double windows that opened to the rear of the building.\\n\\n CASSIOPEIA HEARD VOICES TO HER LEFT, TOWARD WHERE THE restaurant and inn stood. The shots had surely attracted attention from the inn guests. She spotted darkened figures heading down the path from the village and quickly abandoned her position in the piazzetta, retreating to the basilica\u0027s porch. She\u0027d fired the last flaming arrow hoping the second floor would ignite, too. In the fire\u0027s glow she\u0027d clearly recognized Viktor\u0027s face in the window.\\n\\n People appeared. One man held a cell phone to his ear. No police occupied the island, which should give her time, and she doubted Viktor would enlist the help of any onlookers. Too many questions about the corpse on the ground floor.\\n\\n So she decided to leave.\\n\\n VIKTOR STARED ACROSS THE HARDWOOD PLANKS AT THE PACK OF Greek fire lying on the floor. He decided a quick assault was best, so he stepped lightly, grabbed the bag, and hopped straight toward the window he\u0027d just shot out.\\n\\n The floorboards held.\\n\\n He laid the pack outside across the C-shaped wrought-iron bars.\\n\\n The flooring in the center of the room moaned.\\n\\n He recalled crossbeams below, but they were surely weakening by the second. A few more steps toward the arrow stuck into the wall and he yanked it free. Rags wrapped around its tip still burned. He rushed across to the stairway, then, with an underhanded toss, lobbed the arrow into the open window frame. It landed on top of the pack, the flames flickering a few inches away from the plastic wrap. He knew it would only take a few moments for the bag to melt.\\n\\n He sought refuge inside the stairwell.\\n\\n A woosh and another firestorm raged.\\n\\n He glanced around the doorway and saw that the wrought iron was burning. Luckily, most of the firepower had stayed outside. The window frame had not joined the conflagration.\\n\\n The second floor collapsed, swallowing the case with the other fuel pack downward. The remaining bag ignited, a cloud of heat floating upward. The Museo di Torcello would not stand much longer.\\n\\n He hopped to the open windows.\\n\\n He gripped the cornice that ran across the top of the frame and searched for a fingerhold, his body straining, feet powered outward, slamming into the burning bars.\\n\\n Nothing moved.\\n\\n Another chin-up and he kicked again, adrenaline powering each thrust as the heat began to affect his breathing.\\n\\n The bars started to give.\\n\\n More kicks and one corner broke free of its bolt to the exterior wall.\\n\\n Two more slams and the entire assembly flew outward.\\n\\n More flooring collapsed.\\n\\n Another display case and pieces of a column crashed to the ground floor, churning in the fire like bits in a stew.\\n\\n He stared out the window.\\n\\n The drop down was three or four meters. Flames spat out the ground-floor windows.\\n\\n He leaped.\\n\\n MALONE KEPT THE BOAT ON A NORTHEAST HEADING, SPEEDING AS fast as the churning water would allow toward Torcello. He spotted a glow on the horizon flickering with regularity.\\n\\n Fire.\\n\\n Billows of smoke gushed upward, the moist air dissolving it into gray wisps. They were a good ten to fifteen minutes away.\\n\\n \"Looks like we\u0027re late,\" he said to Stephanie.\\n\\n VIKTOR KEPT TO THE MUSEUM\u0027S REAR. HE COULD HEAR SHOUTS and voices from beyond the hedge that separated the yard from the garden and orchard that lay between here and the canal, where his boat waited.\\n\\n He plowed his way through the hedge and entered the garden.\\n\\n Luckily, early springtime meant not much vegetation. He was able to find a path and weave his way straight toward the concrete dock.\\n\\n There, he leaped into the boat.\\n\\n He untied the mooring lines and pushed off from the dock. No one had seen or followed him. The boat drifted out into the riverlike waterway and the current drove it past where the basilica and museum stood, back toward the north entrance to the lagoon. He waited until he was well beyond the dock before cranking the engine. He kept the power low and brought the bow around, slowly cruising with no lights.\\n\\n The shore on either side was a good fifty meters apart, mainly mud banks, shallows, and reeds. He checked his watch-11:20 P.M.\\n\\n At the mouth of the canal he revved the engines and maneuvered out into turbulent water. He finally switched on the boat\u0027s running lights and set a course around Torcello for the main channel that would lead to Venice and San Marco.\\n\\n He heard a noise and turned.\\n\\n Stepping from the aft cabin was a woman.\\n\\n Gun in hand. \\n\\n","sourceLink":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3/page-15.html","bookId":2234,"book":{"id":2234,"title":"The Venetian Betrayal (Cotton Malone #3)","description":"Storyline: The Venetian Betrayal (Cotton Malone #3) \\n Cotton Malone is back and the stakes were never higher: a deadly virus that could wipe out civilisation as we know it - and a cure that lies buried in the past. The Venetian League, a secret group of 45 political and economic leaders from around the world, has joined forces with a coalition of former Soviet republics to create a potentially devastating biological weapon, a bird flu-like virus that has been artificially mutated to pass from human to human. Whoever develops the cure would control the future of global warfare. Yet that cure may have been discovered centuries ago, and if so the clue to the location of the formula lies buried with Alexander the Great. When Cotton Malone\u0027s former companion Cassiopeia Vitt hears about it, she and Cotton join the hunt for Alexander\u0027s long-lost tomb, and what at first seems to Cotton a wild quest for the answer to a perplexing historical riddle becomes a harrowing fight for truth that has unimaginable repercussions, both geopolitical and terrifyingly personal.\\n","cover":"https://allnovel.net/images/the-venetian-betrayal-cotton-malone-3.jpg","author":"Steve Berry","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3.html","creation":"Oct 5, 2019 8:58:29 AM","modification":"Oct 5, 2019 11:13:57 PM"}}
