{"id":108008,"no":19,"title":"Page 19","content":"FIFTY-TWO\\n\\n VENICE\\n\\n ZOVASTINA ROSE AND FACED THE INTRUDER. HE WAS SHORT, WITH a crooked spine, bushy hair and eyebrows, and spoke in a brittle voice of maturity. His crinkly features, gaunt cheeks, coarsened hair, and veined hands all belonged to age.\\n\\n \"Who are you?\" she asked.\\n\\n \"Henrik Thorvaldsen.\"\\n\\n She knew the name. One of the wealthiest men in Europe. A Dane. But what was he doing here?\\n\\n Viktor instantly reacted to the visitor, pointing his weapon. She reached over and restrained him, her eyes saying, Let\u0027s see what he wants.\\n\\n \"I know of you.\"\\n\\n \"And I of you. Risen from Soviet bureaucrat to a forger of nations. Quite an achievement.\"\\n\\n She wasn\u0027t in the mood for compliments. \"What are you doing here?\"\\n\\n The older man shuffled close to the wooden box. \"Did you really think Alexander the Great was in there?\"\\n\\n This man knew her business.\\n\\n \"And you, adventurer, for my immortal voice, though far off, fills your ears, hear my words. Sail onto the capital founded by Alexander\u0027s father, where sages stand guard. Touch the innermost being of the golden illusion. Divide the phoenix. Life provides the measure of the grave. Be wary, for there is but one chance of success.\"\\n\\n She fought to conceal her shock at Thorvaldsen\u0027s recitation.\\n\\n This man truly did know her business.\\n\\n \"Do you think you\u0027re the only one who knows?\" he asked. \"How pompous are you?\"\\n\\n She grabbed Viktor\u0027s gun and leveled the barrel at Thorvaldsen. \"Enough to shoot you.\"\\n\\n MALONE WAS CONCERNED. HE AND CASSIOPEIA WERE FIFTY FEET up and three quarters of a football field away from where Thorvaldsen was challenging Irina Zovastina while Viktor watched. Michener had brought them into the basilica via the west atrium and led them to a steep stairway. At its top, the walls, arches, and domes reflected the architecture below, but instead of a stunning marble facade and glinting mosaics, the basilica\u0027s upper-story museum and gift shop were encased only by brick walls.\\n\\n \"What the hell is he doing here?\" Malone muttered. \"He just called you outside.\"\\n\\n They were huddled behind a stone balustrade, beyond which was a panoramic view of the towering vaulted domes, each resting on massive marble pillars. Golden ceiling mosaics shimmered from incandescent lamps-the marble floor and unlit side chapels cast in varying shades of black and gray. The presbytery, at the far end, where Thorvaldsen stood, loomed like a bright stage in a dark theater.\\n\\n \"You\u0027re not going to answer me?\"\\n\\n Cassiopeia stayed silent.\\n\\n \"You two are about to piss me off.\"\\n\\n \"I told you to go home.\"\\n\\n \"Henrik may have bit off more than he can chew.\"\\n\\n \"She\u0027s not going to shoot him. At least not until she knows why he\u0027s here.\"\\n\\n \"And why is he here?\"\\n\\n More silence.\\n\\n They needed to shift position. \"How about we move over there.\" He pointed left to the north transept and another gallery that overlooked the presbytery. \"This museum winds around that way. We\u0027ll be closer and can hear.\"\\n\\n She motioned right. \"I\u0027ll go that way. There\u0027s surely an opening to the upper south transept from here. That way we\u0027ll be on either side.\"\\n\\n VIKTOR\u0027S HEART RACED. FIRST THE WOMAN, NOW THE SUPPOSED museum owner. Surely the second man was also alive. And probably nearby. Yet he noticed Thorvaldsen paid him no mind.\\n\\n Not a hint of recognition.\\n\\n ZOVASTINA STARED DOWN THE GUN\u0027S SIGHTS AT THORVALDSEN.\\n\\n \"I realize you\u0027re a pagan,\" the Dane calmly said. \"But would you shoot me, here, on the altar of a Christian church?\"\\n\\n \"How do you know Ptolemy\u0027s riddle?\"\\n\\n \"Ely told me.\"\\n\\n She lowered the weapon and appraised her intruder. \"How did you know him?\"\\n\\n \"He and my son were close. Ever since they were children.\"\\n\\n \"Why are you here?\"\\n\\n \"Why is it important to find the tomb of Alexander the Great?\"\\n\\n \"Is there any reason I would discuss that with you?\"\\n\\n \"Let\u0027s see if I can provide you with some. At present you possess nearly thirty zoonoses that you\u0027ve harvested from a variety of exotic animals, many of which you stole from zoos and other private collections. You have at least two biological weapons laboratories at your disposal, one operated by your government, the other by Philogen Pharmaceutique, a corporation controlled by a man named Enrico Vincenti. Both of you are also members of the Venetian League. Am I making any progress?\"\\n\\n \"You\u0027re still breathing, aren\u0027t you?\"\\n\\n Thorvaldsen smiled in seeming satisfaction. \"For which I\u0027m grateful. You also have a formidable military. Nearly a million troops. One hundred and thirty fighter jets. Various transports and support aircraft, adequate bases, an excellent communications network-everything an ambitious despot would need.\"\\n\\n She didn\u0027t like that Viktor was listening, but she desperately needed to hear more, so she turned to him and said, \"Find out what the other two guards are doing, and make sure we\u0027re alone.\"\\n\\n THE OTHER TWO?\\n\\n Malone heard the words as he assumed a position behind another stone railing, this one high above the presbytery, less than a hundred fifty feet above Thorvaldsen and Zovastina. Cassiopeia was fifty yards across the nave, in the south transept, with an equally high perch.\\n\\n He couldn\u0027t see her, but he hoped she\u0027d heard.\\n\\n ZOVASTINA WAITED UNTIL VIKTOR LEFT, THEN GLARED AT THORVALDSEN. \"Is there a problem with wanting to defend my nation?\"\\n\\n \"Beware the toils of war. Soon they\u0027ll raze your sturdy citadel to the roots.\"\\n\\n \"What Sarpedon said to Hector in the Iliad. You have studied me. Let me offer a quotation. Nor do I think you\u0027ll find us short on courage, long as our strength will last.\"\\n\\n \"You\u0027re not planning on defending anything. You\u0027re preparing an attack. Those zoonoses are offensive. Iran, Afghanistan, Pakistan, India. Only one man ever conquered them. Alexander the Great. And he could only hold the land for just a handful of years. Ever since, conquerors have tried and failed. Even the Americans attempted with Iraq. But you, Supreme Minister, you intend to best them all.\"\\n\\n She possessed a leak-a massive one. She needed to return home and resolve that problem.\\n\\n \"You want to do what Alexander did, only in reverse. Not the West conquering the East. This time the East will dominate. You intend to acquire all of your neighbors. And you actually believe the West will allow you the luxury, thinking you\u0027ll be their friend. But you don\u0027t plan to stop there, do you? The Middle East and Arabia, you want those, too. You have oil. The old Kazakhstan is rich with it. But you sell most of that to Russia and Europe cheap. So you want a new source, one that would give you even greater world power. Your zoonoses might just make all that possible. You could devastate a nation in a matter of days. Bring it to its knees. None of your potential victim-states are particularly adept at war in the first place, and when your germs finish, they\u0027ll be defenseless.\"\\n\\n She still held the gun. \"The West should welcome that change.\"\\n\\n \"We prefer the devils we know. And contrary to all those Arab states\u0027 varied beliefs, the West isn\u0027t their enemy.\"\\n\\n He pointed straight at her.\\n\\n \"You are.\"\\n\\n MALONE LISTENED CAREFULLY. THORVALDSEN WAS NO FOOL, SO HE was challenging Zovastina for a reason. The Dane even being here was highly unusual. The last trip the man took was to Austria last fall. Yet here he was, inside an Italian basilica in the middle of the night, poking sticks into the spokes of an armed despot.\\n\\n He\u0027d watched as Viktor left the presbytery and turned into the south transept, below Cassiopeia\u0027s position. Malone\u0027s immediate concern was an open stairway twenty feet away that led down to the nave. If there was a portal on this side, in the north transept, surely another opened in the south since medieval builders, if nothing else, loved symmetry.\\n\\n He was surrounded by more undressed masonry walls along with art, tapestries, lace, and paintings, most displayed in glass cases or on tables.\\n\\n A shadow appeared in the lighted stairway and danced across the marble walls, growing in size.\\n\\n One of Zovastina\u0027s guards.\\n\\n Climbing to the second floor.\\n\\n Straight for him.\\n\\n FIFTY-THREE\\n\\n STEPHANIE FOLLOWED MONSIGNOR MICHENER DOWN THE HALLS of the diocese offices, into a nondescript cubicle, where Edwin Davis sat beneath a framed portrait of the pope.\\n\\n \"Still want to kick my ass?\" Davis asked.\\n\\n She was too tired to fight. \"What are you doing here?\"\\n\\n \"Trying to stop a war.\"\\n\\n She didn\u0027t want to hear it. \"You realize there could be trouble inside that church.\"\\n\\n \"Which is why you\u0027re not in there.\"\\n\\n Realization dawned. \"Malone and Cassiopeia can be denied.\"\\n\\n \"Something like that. We have no idea what Zovastina may do, but I didn\u0027t want the head of the Magellan Billet involved.\"\\n\\n She turned to leave.\\n\\n \"I\u0027d stay here if I were you,\" Davis said.\\n\\n \"Screw off, Edwin.\"\\n\\n Michener blocked her way in the doorway.\\n\\n \"Are you part of this insanity?\" she asked.\\n\\n \"As I said outside, we came across something and passed it on to a place we thought might be interested. Irina Zovastina is a threat to the world.\"\\n\\n \"She\u0027s planning a war,\" Davis said. \"Millions will die, and she\u0027s just about ready to start.\"\\n\\n She turned back. \"So she took the time to risk a trip to Venice and look at a two-thousand-year-old body? What is she doing here?\"\\n\\n \"Probably getting angry,\" Michener said.\\n\\n She saw a twinkle in his eye. \"You set her up?\"\\n\\n The priest shook his head. \"She did that all by herself.\"\\n\\n \"Somebody\u0027s going to get shot in there. Cassiopeia is way beyond the end of her rope. You don\u0027t think gunfire is going to attract the attention of all those police out in the square?\"\\n\\n \"The basilica\u0027s walls are several feet thick,\" Michener said. \"Totally soundproof. No one will disturb them.\"\\n\\n \"Stephanie,\" Davis said, \"we\u0027re not sure why Zovastina took the chance coming here. But it\u0027s obviously important. We thought since she was so intent on coming, we\u0027d accommodate her.\"\\n\\n \"I get the point. Out of her sandbox and into ours. But you have no right to place Malone and Cassiopeia in jeopardy.\"\\n\\n \"Come now. I didn\u0027t do that. Cassiopeia was already involved, with Henrik Thorvaldsen-who, by the way, involved you. And Malone? He\u0027s a big boy and can do what he wants. He\u0027s here because he wants to be here.\"\\n\\n \"You\u0027re fishing for information. Hoping to learn something.\"\\n\\n \"And using the only bait we have. She\u0027s the one who wanted a look inside that tomb.\"\\n\\n Stephanie was puzzled. \"You seem to know her overall plan. What are you waiting for? Move on her. Bomb her installations. Shut her down. Bring political pressures on her.\"\\n\\n \"It\u0027s not that simple. Our information is sketchy. And we have no concrete proof. Certainly not anything she can\u0027t simply deny. You can\u0027t bomb biologicals. And, unfortunately, we don\u0027t know it all. That\u0027s what we need Malone and the others to zero in on for us.\"\\n\\n \"Edwin, you don\u0027t know Cotton. He doesn\u0027t like to be played.\"\\n\\n \"We know Naomi Johns is dead.\"\\n\\n He\u0027d held that one for the right moment, and the words pounded her gut.\\n\\n \"She was stuffed into a coffin with another man, a small-time hood from Florence. Her neck was broken and he had a bullet to the head.\"\\n\\n \"Vincenti?\" she asked.\\n\\n Davis nodded. \"Who\u0027s also on the move. He left earlier for the Central Asian Federation. An unscheduled visit.\"\\n\\n She could see he knew even more.\\n\\n \"He just kidnapped a woman that Irina Zovastina has been caring for since last year, a woman that she was once romantically involved with.\"\\n\\n \"Zovastina\u0027s a lesbian?\"\\n\\n \"Wouldn\u0027t that be a shocker to her People\u0027s Assembly? She and this woman were involved for a long time. But her former lover is dying of AIDS, and Vincenti apparently has a use for her.\"\\n\\n \"And there\u0027s a reason you\u0027re allowing Vincenti to do whatever it is he\u0027s doing?\"\\n\\n \"He\u0027s up to something, too. And it\u0027s more than just supplying Zovastina with germs and antiagents. It\u0027s more than providing the Venetian League with a safe haven for all their business activities. We want to know what that is.\"\\n\\n She needed to leave.\\n\\n Another priest appeared in the office doorway and said, \"We just heard a shot, from inside the basilica.\"\\n\\n MALONE DOVE BEHIND ONE OF THE DISPLAY CASES AS THE GUARDSMAN fired. He\u0027d tried to hide before the man topped the stairs, but apparently a fleeting glance of his retreat was enough to generate an attack.\\n\\n The bullet thudded into one of the tables that displayed medieval textiles. The laminated wood deflected the round and allowed Malone the instant he needed to scurry farther into the shadows. The gunshot echoed through the basilica and had surely attracted everyone\u0027s attention.\\n\\n He scrambled across slick hardwood, taking refuge behind a long exhibit of panel paintings and illuminated manuscript pages.\\n\\n His gun was ready.\\n\\n He needed to draw the man farther in.\\n\\n Which didn\u0027t seem a problem.\\n\\n Footsteps were coming his way.\\n\\n ZOVASTINA HEARD THE SHOT FROM THE UPPER NORTH TRANSEPT. She spotted movement to her right, beyond the stone railing, and saw the head of one of her guards.\\n\\n \"I didn\u0027t come alone,\" Thorvaldsen said.\\n\\n She kept her gun aimed at the Dane.\\n\\n \"San Marco is littered with police. Going to be tough for you to leave. You\u0027re a head of state, in a foreign country. Are you really going to shoot me?\" He paused. \"What would Alexander do?\"\\n\\n She couldn\u0027t decide if he was being serious or patronizing, but she knew the answer. \"He\u0027d kill you.\"\\n\\n Thorvaldsen shifted his position, easing to her left. \"I disagree. He was a great tactician. And clever. The Gordian knot, for example.\"\\n\\n She called out, \"What\u0027s happening up there?\"\\n\\n Her guardsman did not answer.\\n\\n \"In the village of Gordium,\" Thorvaldsen was saying, \"that complicated knot attached to a wagon. Nobody could untie the thing. A challenge Alexander solved by simply cutting the rope with his sword, then untying it. A simple solution to a complex problem.\"\\n\\n \"You talk too much.\"\\n\\n \"Alexander did not allow confusion to affect his thinking.\"\\n\\n \"Viktor,\" she called out.\\n\\n \"Of course,\" Thorvaldsen said, \"there are many tales to that knot\u0027s story. One says Alexander withdrew a pole connected to the wagon yoke, found the rope ends, and untied it. So who knows?\"\\n\\n She was tiring of this man\u0027s rambles.\\n\\n Head of state or not.\\n\\n She pulled the trigger.\\n\\n FIFTY-FOUR\\n\\n SAMARKAND\\n\\n Vincenti remembered the first indication of a problem. Initially, the malady possessed all the characteristics of a cold, then he thought it the flu, but soon the full effects of a viral invasion became apparent.\\n\\n Contamination.\\n\\n \"Am I going to die?\" Charlie Easton screamed from the cot. \"I want to know, dammit. Tell me.\"\\n\\n He dabbed Easton \u0027s sopping brow with a damp rag, like he\u0027d done for the past hour, and quietly said, \"You need to calm down.\"\\n\\n \"Don\u0027t bullshit me. It\u0027s over, isn\u0027t it?\"\\n\\n Three years they\u0027d worked side by side. No sense hedging. \"There\u0027s nothing I can do.\"\\n\\n \"Shit. I knew it. You\u0027ve got to get some help.\"\\n\\n \"You know I can\u0027t.\"\\n\\n The station\u0027s remote location had been selected by the Iraqis, and the Soviets, with great care. Secrecy was paramount. And the price of that secrecy was fatal when a mistake occurred, and a mistake was exactly what happened.\\n\\n Easton jerked the cot with his restrained arms and legs. \"Cut these damn ropes. Let me out of here.\"\\n\\n He\u0027d tied the idiot down knowing their options were limited. \"We can\u0027t leave.\"\\n\\n \"Screw policy. Screw you. Cut these damn ropes.\"\\n\\n Easton stiffened, his breath grew labored, then he succumbed to the fever and relaxed into unconsciousness.\\n\\n Finally.\\n\\n Vincenti turned from the cot and grabbed a notebook that he\u0027d started three weeks back, the first page labeled with his partner\u0027s name. Inside, he\u0027d noted a progressive shift in skin color. Normal, to jaundiced, to such ashiness that the man now appeared dead. There\u0027d been an incredible weight loss, forty pounds all told, ten over one two-day period alone, the intestinal intake dwindling to an occasional gulp of warm water and a few sips of liquor.\\n\\n And the fever.\\n\\n A raging torrent of a constant one hundred and three, sometimes peaking higher, moisture escaping faster than it was being replaced, the body literally evaporating before his eyes. For years they\u0027d used animals in their research, Baghdad providing an endless supply of gibbons, baboons, green monkeys, rodents, and reptiles. But here, for the first time, the effects on a human being could be accurately gauged.\\n\\n He stared down at his partner. Easton\u0027s chest heaved with more labored breaths, mucus rattling deep in the throat, sweat beading off the skin like rain. He noted every observation in the journal, then pocketed the pen.\\n\\n He stood from the cot and tried to work some feeling into his rubbery legs. He lumbered outside into a crisp night. He wondered how much more Easton \u0027s ravaged tissues could take.\\n\\n Which raised the problem of what to do with the body.\\n\\n No protocol existed for handling this type of emergency, so he\u0027d have to improvise. Luckily, the station\u0027s builders had thoughtfully provided an incinerator for disposing of the animal carcasses used in experimentation. But making the oven work on something as large as a human body was going to take ingenuity.\\n\\n \"I see angels. They\u0027re here. All around,\" Easton cried from the cot.\\n\\n Vincenti walked back inside.\\n\\n Easton was now blind. He wasn\u0027t sure if the fever or a secondary infection had destroyed the retina.\\n\\n \"God\u0027s here. I see him.\"\\n\\n \"Of course, Charlie. I\u0027m sure you do.\"\\n\\n He took a pulse. Blood snapped through the carotid artery. He listened to the heart, which pounded like a drum. He checked blood pressure. On the verge of bottoming. The body temperature was a steady one hundred and three.\\n\\n \"What do I tell God?\" Easton asked.\\n\\n He stared down at his partner. \"Say hello.\"\\n\\n He pulled a chair close and watched death take hold. The end came twenty minutes later and seemed neither violent nor painful. Just a final breath. Deep. Long. No exhale.\\n\\n He noted the date and time in the journal, then extracted a blood and tissue sample. He then rolled the thin mattress and filthy sheets around the body and carried the stinking bundle out of the building into an adjacent shed. A scalpel was already there, sharpened to the degree of broken glass, along with a surgeon\u0027s saw. He slipped on a pair of thick rubber gloves and sawed the legs from the torso. The emaciated flesh cut soft and loose, the bone brittle, the intervening muscle offering the resistance of a boiled chicken. He amputated both arms and stuffed all four limbs into the incinerator, watching with no emotion as the flames consumed them. Without extremities, the torso and head fit easily through the iron door. He then cut the bloodied mattress into quarters and quickly stuffed it, the sheets, and gloves into the fire.\\n\\n He slammed the portal shut and staggered outside.\\n\\n Over. Finally.\\n\\n He fell to the rocky ground and stared up at the night. Against the indigo backdrop of a mountain sky, silhouetted as an even darker shadow, the incinerator\u0027s brick flue reached skyward. Smoke escaped, carrying with it the stench of human flesh.\\n\\n He lay back and welcomed sleep.\\n\\n Vincenti recalled that sleep from over twenty-five years ago. And Iraq. What hell. Hot and miserable. A lonely, desolate spot. What had the UN Commission concluded after the first Gulf War? Given their mission, the facilities were wholly archaic, but within the frantic atmosphere of the time they were thought state of the art. Right. Those inspectors weren\u0027t there. He was. Young and skinny with a head full of hair and brains. A hotshot virologist. He and Easton had eventually been detailed to a remote lab in Tajikistan, working in conjunction with the Soviets who controlled the region, at a station hidden away in the Pamir foothills.\\n\\n How many viruses and bacteria had they searched for? Natural organisms that could be used as biological weapons. Something that eliminated an enemy yet preserved a culture\u0027s infrastructure. No need to bomb the population, waste bullets, risk nuclear contamination, or put troops in jeopardy. A microscopic organism could do all of the heavy lifting-simple biology the catalyst for certain defeat.\\n\\n The working criteria for whatever they found had been simple. Fast-acting. Biologically identifiable. Containable. And, most important, curable. Hundreds of strains were discarded simply because no practical way could be found to stop them. What good would infecting an enemy be if you couldn\u0027t protect your own population? All four criteria had to be satisfied before a specimen was cataloged. Nearly twenty had made the grade.\\n\\n He\u0027d never accepted what the press reported after the Biological Toxin Weapons Convention of 1972-that the United States quit the germ-warfare business and destroyed all of its arsenals. The military wouldn\u0027t discard decades of research simply because a few politicians unilaterally decided it was the thing to do. At least a few of those organisms, he believed, were hidden in cold storage at some nondescript military institution.\\n\\n He personally found six pathogens that met all of the criteria.\\n\\n But sample 65-G failed on every count.\\n\\n He first discovered it in 1979, within the bloodstream of the green monkeys that had been shipped for experimentation. Conventional science then would never have noticed, but thanks to his unique virology training, and special equipment the Iraqis provided, he found it. A strange-looking thing-spherical-filled with RNA and enzymes. Expose it to air and it evaporated. In water, the cell wall collapsed. Instead, it craved warm plasma and seemed prevalent throughout all of the green monkeys that came his way.\\n\\n Yet none of the animals seemed affected.\\n\\n Charlie Easton, though, had been another matter. Damn fool. He\u0027d been bitten two years prior by one of the monkeys, but told no one until three weeks before he died, when the first symptoms appeared. A blood sample confirmed 65-G roamed through him. He\u0027d eventually used Easton \u0027s infection to study the viral effects on humans, concluding the organism was not an efficient biological weapon. Too unpredictable, sporadic, and far too slow to be an effective offensive agent.\\n\\n He shook his head.\\n\\n Amazing how ignorant he\u0027d been.\\n\\n A miracle he\u0027d survived.\\n\\n He was back in his hotel room at the Intercontinental, dawn coming slowly to Samarkand. He needed to rest, but was still energized from his encounter with Karyn Walde.\\n\\n He thought again about the old healer.\\n\\n Was it 1980? Or \u002781?\\n\\n In the Pamirs, about two weeks before Easton died. He\u0027d visited the village several times before, trying to learn what he could. The old man was surely dead by now. Even then he was well up in age.\\n\\n But still.\\n\\n The old man scampered barefoot up the liver-colored slope with the agility of a cat, on feet with soles like leather. Vincenti followed and, even through heavy boots, his ankles and toes ached. Nothing was flat. Rocks arched everywhere like speed breakers, sharp, unforgiving. The village lay a mile back, nearly a thousand feet above sea level, their current journey taking them even higher.\\n\\n The man was a traditional healer, a combination family practitioner, priest, fortune teller, and sorcerer. He knew little English but could speak passable Chinese and Turkish. He was a near-dwarf with European features and a forked Mongol beard. He wore a gold-threaded quilt and a bright skullcap. Back in the village, Vincenti had watched while the man treated the villagers with a concoction of roots and plants, meticulously administered with an intelligence born from decades of trial and error.\\n\\n \"Where are we going?\" he finally asked.\\n\\n \"To answer your question and find what will stop the fever in your friend.\"\\n\\n Around him, a stadium of white peaks formed a gallery of untouched heights. Thunder clouds steamed from the highest summits. Streaks of silvers and autumnal reds and dense groves of walnut trees added color to the otherwise mummified scene. A rush of water could be heard somewhere far off.\\n\\n They came to a ledge and he followed the old man through a purple vein in the rock. He knew from his studies that the mountains around him were still alive, slowly pushing upward about two and a half inches a year.\\n\\n They exited into an oval-shaped arena, walled in by more stone. Not much light inside, so he found the flashlight the old man had encouraged him to bring.\\n\\n Two pools dotted the rock floor, each about ten feet in diameter, one bubbling with the froth of thermal energy. He brought the light close and noticed their contrasting color. The active one was a russet brown, its calm companion a sea foam green.\\n\\n \"The fever you describe is not new,\" the old man said. \"Many generations have known that animals deliver it.\"\\n\\n To learn more about the yaks, the sheep, and the huge bears that populated the region was one of the reasons he\u0027d been sent. \"How do you know that?\"\\n\\n \"We watch. But only sometimes do they pass the fever. If your friend has the fever, this will help.\" He pointed to the green pool, its still surface marred only by an array of floating plants. They looked like water lilies, only bushier, the center flower straining through the shade for precious drops of sunlight. \"The leaves will save him. He must chew them.\"\\n\\n He dabbed the water and brought two moist fingers to his mouth. No taste. He half expected the hint of carbonate found in other springs of the region.\\n\\n The man knelt and gulped a cupped handful. \"It is good,\" he said, smiling.\\n\\n He drank, too. Warm, like a cup of tea, and fresh. So he slurped more.\\n\\n \"The leaves will cure him.\"\\n\\n He needed to know. \"Is this plant common?\"\\n\\n The old man nodded. \"Only ones from this pool work.\"\\n\\n \"Why is that?\"\\n\\n \"I do not know. Perhaps divine will.\"\\n\\n He doubted that. \"Is this known to other villages? Other healers?\"\\n\\n \"I am the only one who uses it.\"\\n\\n He reached down and pulled one of the floating pods closer, assessing its biology. It was a tracheophyta, the leaves peltate with the stalk and filled with an elaborate vascular system. Eight thick, pulpous stipules surrounded the base and formed a floating platform. The epidermal tissue was a dark green, the leaf walls full of glucose. A short stem projected from the center and probably acted as a photosynthetic surface because of the limited leaf space. The flower\u0027s soft white petals were arranged in a whorl and emitted no fragrance.\\n\\n He glanced underneath. A raccoon tail of stringy, brown roots extended out in the water, searching for nutrients. From all appearances, it seemed a well-adapted species.\\n\\n \"How did you learn that it worked?\"\\n\\n \"My father taught me.\"\\n\\n He lifted the plant from the water and cradled the pod. Warm water seeped through his fingers.\\n\\n \"The leaves must be chewed completely, the juice swallowed.\"\\n\\n He broke off a clump and brought it to his mouth. He looked at the old man-rapier eyes staring back quiet and confident. He stuffed the leaf in his mouth and chewed. The taste was bitter, sharp, like alum-and terrible, like tobacco.\\n\\n He extracted the juice and swallowed, almost gagging. \\n\\n","sourceLink":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3/page-19.html","bookId":2234,"book":{"id":2234,"title":"The Venetian Betrayal (Cotton Malone #3)","description":"Storyline: The Venetian Betrayal (Cotton Malone #3) \\n Cotton Malone is back and the stakes were never higher: a deadly virus that could wipe out civilisation as we know it - and a cure that lies buried in the past. The Venetian League, a secret group of 45 political and economic leaders from around the world, has joined forces with a coalition of former Soviet republics to create a potentially devastating biological weapon, a bird flu-like virus that has been artificially mutated to pass from human to human. Whoever develops the cure would control the future of global warfare. Yet that cure may have been discovered centuries ago, and if so the clue to the location of the formula lies buried with Alexander the Great. When Cotton Malone\u0027s former companion Cassiopeia Vitt hears about it, she and Cotton join the hunt for Alexander\u0027s long-lost tomb, and what at first seems to Cotton a wild quest for the answer to a perplexing historical riddle becomes a harrowing fight for truth that has unimaginable repercussions, both geopolitical and terrifyingly personal.\\n","cover":"https://allnovel.net/images/the-venetian-betrayal-cotton-malone-3.jpg","author":"Steve Berry","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3.html","creation":"Oct 5, 2019 8:58:29 AM","modification":"Oct 5, 2019 11:13:57 PM"}}
