{"id":108022,"no":33,"title":"Page 33","content":"NINETY-FOUR MALONE ADMIRED ALEXANDER THE GREAT\u0027S TOMB. AFTER EDWIN Davis arrived, an army special forces unit had quickly taken control of the estate, disarming the four remaining troops without a fight. President Daniels authorized the incursion, Davis saying he doubted there\u0027d be any official resistance from the Federation. Zovastina was dead. A new day was coming. Once the estate was secure, as darkness began to claim the mountains, they\u0027d all climbed to the pools and dove into the tawny eye. Even Thorvaldsen, who wanted desperately to see the grave. Malone had helped him through the tunnel and the Dane, for his age and deformity, was a surprisingly strong swimmer. They brought flashlights and additional lights from the Apaches, the tomb now ablaze with electric illumination. He stared in wonder at a wall of glazed bricks, their blues, yellows, oranges, and blacks still vibrant after two millennia. Ely was examining three lion motifs formed with great skill from the colorful tiles. \"Something similar to this lined the ancient Babylon\u0027s processional way. We have remnants. But here\u0027s one totally intact.\" Edwin Davis had swum through with them. He, too, had wanted to see what Zovastina had coveted. Malone felt better knowing that the other side of the pool was being guarded by a team operations sergeant and three U.S. Army soldiers armed with M-4 carbines. He and Stephanie had briefed Davis on what happened and he was beginning to warm to the deputy national security adviser, especially after he\u0027d anticipated their need for backup and had been ready to move. Ely stood beside the two sarcophagi. On the side of one was chiseled a single word.. More letters adorned its other side. \"This one is Alexander\u0027s,\" Ely said. \"The longer inscription is from the Iliad. Always to be the best and to be superior to the rest. Homer\u0027s expression of the heroic ideal. Alexander would have lived by that. Zovastina loved that quote, too. She used it many times. The people who put him here chose his epitaph well.\" Ely motioned to the other coffin, its inscription simpler. \"\u0027Hephaestion. Friend of Alexander.\u0027 Lover did not do justice to their relationship. To be called \u0027friend\u0027 was the supreme compliment of a Greek, reserved for only the most dear.\" Malone noticed how dust and debris had been cleared from the image of a horse on Alexander\u0027s coffin. \"Zovastina did that when she and I were here,\" Viktor said. \"She was mesmerized by the image.\" \"It\u0027s Bucephalas,\" Ely said. \"Has to be. Alexander\u0027s horse. He worshipped the animal. The horse died during the Asian campaign and was buried somewhere in the mountains, not far from here.\" \"Zovastina named her favorite horse that, too,\" Viktor noted. Malone scanned the room. Ely pointed out ritual buckets, a silver perfume container, a drinking horn shaped as a deer\u0027s head, even gilded bronze greaves with bits of leather still remaining that once protected a warrior\u0027s calves. \"It\u0027s breathtaking,\" Stephanie said. He agreed. Cassiopeia stood near one of the coffins, its lid slid open. \"Zovastina snuck a look,\" Viktor said. Their lights shone inside at a mummy. \"Unusual that it\u0027s not in a cartonnage,\" Ely said. \"But they may not have had the skill or time to make one.\" Gold sheets covered the body from neck to feet, each the size of a sheet of paper, more lay scattered inside the coffin. The right arm was bent at the elbow and lay across the abdomen. The left arm stretched straight, the forearm detached from the upper. Bandages wrapped most of the corpse in a tight embrace and on the partially exposed chest lay three gold disks. \"The Macedonian star,\" Ely said. \"Alexander\u0027s coat of arms. Impressive ones, too. Beautiful specimens.\" \"How did they get all of this in here?\" Stephanie asked. \"These coffins are huge.\" Ely motioned at the room. \"Twenty-three hundred years ago, the topography was surely different. I\u0027d wager there was another way in. Maybe the pools were not as high, the tunnel more accessible and not underwater. Who knows?\" \"But the letters in the pool,\" Malone said. \"How did they get there? Surely the people who fashioned this tomb didn\u0027t do it. That\u0027s like a neon sign to alert people.\" \"My guess is Ptolemy did that. Part of his riddle. Two Greek letters at the bottom of two dark pools. His way, I assume, of marking the spot.\" A golden mask covered Alexander\u0027s face. No one had yet touched it. Finally, Malone said, \"Why don\u0027t you, Ely? Let\u0027s see what a king of the world looks like.\" He saw the look of anticipation in the younger man\u0027s eyes. He\u0027d studied Alexander the Great from afar, learned what he could from the scant information that had survived. Now he could be the first in two thousand years to actually touch him. Ely slowly removed the mask. What skin remained cast a blackish tint and was bone dry and brittle. Death seemed to have agreed with Alexander\u0027s countenance, the half-closed eyes conveying a strange expression of curiosity. The mouth ran from one side of the cheek to the other, open, as if to shout. Time had frozen everything. The head was devoid of hair, the brain, which more than anything else accounted for Alexander\u0027s success, gone. They all stared in silence. Finally, Cassiopeia shined her light across the room, past an equestrian figure on horseback clad only in a long cloak slung over one shoulder, at a striking bronze bust. The powerful oblong face showed confidence and featured steady narrowed eyes, gazing off into the distance. The hair sprang back from the forehead in a classic style and dropped midlength in irregular curls. The neck rose straight and high, the bearing and look of a man who utterly controlled his world. Alexander the Great. Such a contrast to the face of death in the coffin. \"All of the busts I\u0027ve ever seen of Alexander,\" Ely said, \"his nose, lips, brow, and hair were usually restored with plaster. Few survived the ages. But there\u0027s an image, from his time, in perfect condition.\" \"And here he is,\" Malone said, \"in the flesh.\" Cassiopeia moved to the adjacent coffin and wrestled open its lid enough for them to peek inside. Another mummy, not fully adorned in gold, but masked, lay in similar condition. \"Alexander and Hephaestion,\" Thorvaldsen said. \"Here they\u0027ve rested for so long.\" \"Will they stay?\" Malone asked. Ely shrugged. \"This is an important archaeological find. It would be a tragedy not to learn from it.\" Malone noticed that Viktor\u0027s attention had shifted to a gold chest that lay close to the wall. The rock above was incised with a tangle of engravings showing battles, chariots, horses, and men with swords. Atop the chest a golden Macedonian star had been molded. Rosettes with petals of blue glass dotted its center. Similar rosettes wrapped a central band around the chest. Viktor grasped both sides and, before Ely could stop him, lifted the lid. Edwin Davis shined a light inside. A gold wreath of oak leaves and acorns, rich in stunning detail, came into view. \"A royal crown,\" Ely said. Viktor smirked. \"That\u0027s what Zovastina wanted. This would have been her crown. She would have used all of this to fuel herself.\" Malone shrugged. \"Too bad her helicopter crashed.\" They all stood in the chamber, soaking wet from the swim but relieved that the ordeal was over. The rest involved politics, and that didn\u0027t concern Malone. \"Viktor,\" Stephanie said. \"If you ever get tired of freelancing and want a job, let me know.\" \"I\u0027ll keep the offer in mind.\" \"You let me best you when we were here before,\" Malone said. \"Didn\u0027t you?\" Viktor nodded. \"I thought it better you leave, so I gave you the chance. I\u0027m not that easy, Malone.\" He grinned. \"I\u0027ll keep that in mind.\" He pointed at the tombs. \"What about these?\" \"They\u0027ve been waiting here a long time,\" Ely said. \"They can rest a little longer. Right now, there\u0027s something else we have to do.\" CASSIOPEIA WAS THE LAST TO CLIMB FROM THE TAWNY POOL, BACK into the first chamber. \"Lyndsey said the bacteria in the green pool could be swallowed,\" Ely said. \"They\u0027re harmless to us, but destroy HIV.\" \"We don\u0027t know if any of that is true,\" Stephanie said. Ely seemed convinced. \"It is. That man\u0027s ass was on the line. He was using what he had to save his skin.\" \"We have the disk,\" Thorvaldsen said. \"I can have the best scientists in the world get us an answer immediately.\" Ely shook his head. \"Alexander the Great had no scientists. He trusted his world.\" Cassiopeia admired his courage. She\u0027d been infected for over a decade, always wondering when the disease would finally manifest itself. To have a time bomb ticking away inside, waiting for the day when your immune system finally failed, that changed your life. She knew Ely suffered from the same anxiety, clutched at every hope. And they were the lucky ones. They could afford the drugs that kept the virus at bay. Millions of others could not. She stared into the tawny pool, at the Greek letter Z that lay at its bottom. She recalled what she\u0027d read in one of the manuscripts. Eumenes revealed the resting place, far away, in the mountains, where the Scythians taught Alexander about life. She walked to the green pool and again admired the H at its bottom. Life. What a lovely promise. Ely grasped her hand. \"Ready?\" She nodded. They dropped to their knees and drank. NINETY-FIVE COPENHAGEN SATURDAY, JUNE 6 7:45 P.M. MALONE SAT ON THE SECOND FLOOR OF THE CAFe NORDEN AND enjoyed more of the tomato bisque soup. Still the best he\u0027d ever eaten. Thorvaldsen sat across from him. The second-floor windows were flung open, allowing a lovely late-spring evening to wash over them. Copenhagen\u0027s weather this time of year was nearly perfect, another one of the many reasons why he so enjoyed living here. \"I heard from Ely today,\" Thorvaldsen said. He\u0027d wondered what was happening in central Asia. They\u0027d returned home six weeks ago and he\u0027d been busy selling books. That was the thing about being a field agent. You did your job, then moved on. No postanalysis or follow-up. That task was always left to others. \"He\u0027s excavating Alexander\u0027s tomb. The new Federation government is cooperating with the Greeks.\" He knew that Ely had taken a position in Athens with the Museum of Antiquities, thanks to Thorvaldsen\u0027s intervention. Of course, knowing the location of Alexander the Great\u0027s grave certainly fueled the museum\u0027s enthusiasm. Zovastina had been succeeded by a moderate deputy minister who, according to the Federation constitution, temporarily assumed power until elections could be held. Washington had quietly ensured that all of the Federation\u0027s biological stockpiles were destroyed and Samarkand had been given a choice. Cooperate or the Federation\u0027s neighbors would learn what Zovastina and her generals had planned, and then nature could take its course. Luckily, moderation prevailed and the United States sent a team to oversee the viral extermination. Of course, with the West holding the antiagent, there\u0027d been no choice. The Federation could start killing, but they could not stop it. The uneasy alliance between Zovastina and Vincenti had been replaced with one between two distrusting nations. \"Ely has full control of the tomb and is quietly working it,\" Thorvaldsen said. \"He says a lot of history may have to be rewritten. Lots of inscriptions inside. Artwork. Even a map or two. Incredible stuff.\" \"And how are Edwin Davis and Danny Daniels?\" he asked. \"Satisfied?\" Thorvaldsen smiled. \"I spoke with Edwin a couple of days ago. Daniels is grateful for all we did. He especially liked Cassiopeia blowing up that helicopter. Not a lot of sympathy from that man. He\u0027s a tough one.\" \"Glad we could help the president out one more time.\" He paused. \"What about the Venetian League?\" Thorvaldsen shrugged. \"Faded into the woodwork. It didn\u0027t do anything that can be proven.\" \"Except kill Naomi Johns.\" \"Vincenti did that, and I believe he paid.\" That was true. \"You know, it\u0027d be nice if Daniels could, for once, just ask for my help.\" \"Not going to happen.\" \"Like with you?\" His friend nodded. \"Like with me.\" He finished his soup and stared down at H\u0026oslash;jbro Plads. The square was lively with people enjoying a warm evening, which were few and far between in Copenhagen. His bookshop across the plaza was closed. Business had been great lately and he was planning a buying trip to London the following week, before Gary arrived for his yearly summer visit. He was looking forward to seeing his fifteen-year-old. But he was also melancholy. He\u0027d been that way every since returning home. He and Thorvaldsen ate dinner together at least once a week, but never had they discussed what was really on his mind. Some places need not be trod. Unless allowed. So he asked, \"How\u0027s Cassiopeia?\" \"I was wondering when you\u0027d inquire.\" \"You\u0027re the one who got me into all that.\" \"All I did was tell you she needed help.\" \"I\u0027d like to think she\u0027d help me, if needed.\" \"She would. But, to answer your question, both she and Ely are virus free. Edwin tells me scientists have also verified the bacteria\u0027s effectiveness. Daniels will announce the cure shortly and the United States government will control its distribution. The president has ordered that it be available to all at minimal cost.\" \"A lot of people will be affected by that.\" \"Thanks to you. You solved the riddle and found the grave.\" He didn\u0027t want to hear that. \"We all did our job. And, by the way, I heard you\u0027re a gun-toting fool. Stephanie said you were hell in that house.\" \"I\u0027m not helpless.\" Thorvaldsen had told him about Stephanie and the shooting. He\u0027d spoken to her about it before they left Asia and had called her again last week. \"Stephanie\u0027s realizing it\u0027s tough out in the field,\" he said. \"I spoke to her myself a few days ago.\" \"You two becoming buddies?\" His friend smiled. \"We\u0027re a lot alike, though neither one of us would admit that to the other.\" \"Killing is never easy. No matter what the reason.\" \"I killed three men myself in that house. You\u0027re right. It\u0027s never easy.\" He still had not received an answer to his initial question, and Thorvaldsen seemed to sense what he truly wanted to know. \"I haven\u0027t spoke with Cassiopeia much since we left the Federation. She went home to France. I don\u0027t know about she and Ely-the two of them. She offers little.\" Thorvaldsen shook his head. \"You\u0027ll have to ask her.\" He decided to take a walk. He liked roaming the Str\u0026oslash;get. He asked Thorvaldsen if he wanted to join him but his friend declined. He stood. Thorvaldsen tossed some folded papers across the table. \"The deed to that property by the sound, where the house burned. I have no use for it.\" He unfolded the sheets and saw his name on the grantee line. \"I want you to have it.\" \"That property is worth a lot of money. It\u0027s oceanfront. I can\u0027t take that.\" \"Rebuild the house. Enjoy it. Call it compensation for me bringing you into the middle of all this.\" \"You knew I\u0027d help.\" \"This way, my conscience, what little of it there is, will be satisfied.\" From their two years together he\u0027d learned that when Henrik Thorvaldsen made up his mind, that was it. So he stuffed the deed into his pocket and descended the stairs. He pushed through the main doors into the warm touch of a Danish evening. People and conversations greeted him from occupied tables that sprawled out from the cafe. \"Hey, Malone.\" He turned. Sitting at one of the tables was Cassiopeia. She stood and walked his way. She wore a navy canvas jacket and matching canvas pants. A leather shoulder bag draped one shoulder and T-strap sandals accented her feet. The dark hair hung in thick curls. He could still see her in the mountain. Tight leather pants and a sports bra, as she swam with him into the tomb. And those few minutes when they both were down to their underwear. \"What are you doing in town?\" he asked. She shrugged. \"You\u0027re always telling me how good the food is at this cafe, so I came to eat dinner.\" He smiled. \"Long way for a meal.\" \"Not if you can\u0027t cook.\" \"I hear you\u0027re cured. I\u0027m glad.\" \"Does take a few things off your mind. Wondering if today is the day you start to die.\" He recalled her preoccupation that first night in Copenhagen, when she aided his escape from the Greco-Roman museum. All the melancholy seemed gone. \"Where you headed?\" she asked. He stared out across the square. \"Just for a walk.\" \"Want some company?\" He glanced back at the cafe, up to the second story, and the window table where he and Thorvaldsen had been sitting. His friend gazed out the open frame, smiling. He should have known. He faced her and said, \"Are you two always up to something?\" \"You haven\u0027t answered my question about the walk.\" What the hell. \"Sure. I\u0027d love some company.\" She slid her arm into his and led him forward. He had to ask. \"What about you and Ely? I thought-\" \"Malone.\" He knew what was coming, so he saved her the trouble. \"I know. Just shut up and walk.\"","sourceLink":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3/page-33.html","bookId":2234,"book":{"id":2234,"title":"The Venetian Betrayal (Cotton Malone #3)","description":"Storyline: The Venetian Betrayal (Cotton Malone #3) Cotton Malone is back and the stakes were never higher: a deadly virus that could wipe out civilisation as we know it - and a cure that lies buried in the past. The Venetian League, a secret group of 45 political and economic leaders from around the world, has joined forces with a coalition of former Soviet republics to create a potentially devastating biological weapon, a bird flu-like virus that has been artificially mutated to pass from human to human. Whoever develops the cure would control the future of global warfare. Yet that cure may have been discovered centuries ago, and if so the clue to the location of the formula lies buried with Alexander the Great. When Cotton Malone\u0027s former companion Cassiopeia Vitt hears about it, she and Cotton join the hunt for Alexander\u0027s long-lost tomb, and what at first seems to Cotton a wild quest for the answer to a perplexing historical riddle becomes a harrowing fight for truth that has unimaginable repercussions, both geopolitical and terrifyingly personal.","cover":"https://allnovel.net/images/the-venetian-betrayal-cotton-malone-3.jpg","author":"Steve Berry","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3.html","creation":"Oct 5, 2019 8:58:29 AM","modification":"Oct 5, 2019 11:13:57 PM"}}
