{"id":42306,"no":26,"title":"CHAPTER XXV. THE CAPTURE OF SEBASTOPOL","content":"The morning of the 8th of September was bitterly cold, and a keen wind blowing from the town raised clouds of dust. The storming parties were to be furnished by the light and second divisions. The first storming party of the light division was to consist of 160 men of the 97th regiment, who were to form in rear of a covering party of 100 men, furnished by the second battalion, Rifle brigade. They were to carry ladders for descending into the ditch of the Redan. Behind them were to come 200 men of the 97th and 300 of the 90th. The supports consisted of 750 men of the 19th and 88th regiments. Therefore the assault was to be made by about 750 men, with an equal body in support, the remainder of the light division being in reserve. The covering party of the second division consisted of 100 men of the 3d Buffs; the storming party, with ladders, of 160 of the 3d Buffs, supported by 260 of the 3d Buffs, 300 of the 41st, with 200 of the 62d, and 100 of the 41st. The rest of the second division were in reserve. The first and Highland divisions were to be formed in the third parallel. The orders were that the British attack was not to commence until the French had gained possession of the Malakoff. This they did with but slight loss. The storming columns were immensely strong, as 30,000 men were gathered in their trenches for the attack upon the Malakoff. This was effected almost instantaneously. Upon the signal being given, they leaped in crowds from the advanced trench, climbed over the abattis, descended the ditch and swarmed up the rugged slope in hundreds. The Russians, taken wholly by surprise, vainly fired their cannon, but ere the men could come out from their underground caves, the French were already leaping down upon them. It was a slaughter rather than a fight, and in an incredibly short time the Malakoff was completely in the possession of the French. In less than a minute from the time they leaped from the trenches their flag floated on the parapet. The Russians, recovered from their first surprise, soon made tremendous attempts to regain their lost position, and five minutes after the French had entered, great masses of Russians moved forward to dispute its possession. For seven hours, from twelve to dusk, the Russians strove obstinately to recover the Malakoff, but the masses of men which the French poured in as soon as it was captured, enabled them to resist the assaults. At length, when night came on, the Russian general, seeing that the tremendous slaughter which his troops were suffering availed nothing, withdrew them from the attack. As the French flag appeared on the Malakoff, the English covering parties leaped from the trenches, and rushed forward. As they did so a storm of shot and shell swept upon them, and a great number of men and officers were killed as they crossed the 250 yards between the trenches and the Redan. This work was a salient, that is to say a work whose centre is advanced, the two sides meeting there at an angle. In case of the Redan it was a very obtuse angle, and the attacks should have been delivered far up the sides, as men entering at the angle itself would be exposed to the concentrated fire of the enemy behind the breastworks which ran across the broad base of the triangle. The projecting angle was, however, of course the point nearest to the English lines, and, exposed as they were to the sweeping fire of the enemy while crossing the open, both columns of assault naturally made for this point. The Russian resistance was slight, and the stormers burst into the work. The abattis had been torn to pieces by the cannonade, and the men did not wait for the ladders, but leapt into the ditch and scrambled up on the other side. The Russians within ran back, and opened a fire from their traverses and works in the rear. As the English troops entered, they halted to fire upon the enemy, instead of advancing upon them. The consequence was that the Russians, who were rapidly reinforced, were soon able to open a tremendous concentrated fire upon the mass of men in the angle, and these, pressed upon by their comrades who flocked in behind them, impeded by the numerous internal works, mixed up in confusion, all regimental order being lost, were unable either to advance or to use their arms with effect. In vain the officers strove by example and shouts to induce them to advance. The men had an idea that the place was mined, and that if they went forward they would be blown into the air. They remained stationary, holding their ground, but refusing to go forward. Every minute the Russians brought up fresh reserves, and a terrific fire was concentrated upon the British. The officers, showing themselves in front, were soon shot down in numbers, and success, which had been in their hands at first, was now impossible. For an hour and a half the slaughter continued, and then, as the Russian masses poured forward to attack them, the remnant who remained of the storming parties leaped from the parapet and made their way as best they could through the storm of bullet and shot, back to the trenches. The fight had lasted an hour and three quarters, and in that time we had lost more men than at Inkerman. Our loss was 24 officers and 119 men killed; 134 officers, and 1897 men wounded. Had the regiments engaged been composed of the same materials as those who won the heights of the Alma, the result might have been different, although even in that case it is questionable whether the small force told off for the assault would have finally maintained itself against the masses which the Russians brought up against them. But composed as they were of young troops, many being lads sent off to the front a few weeks after being recruited, the success of such an attack, so managed, was well-nigh impossible from the first. It was a gloomy evening in the British camps. We were defeated, while the French were victorious. The fact, too, that the attack had failed in some degree owing to the misconduct of the men added to the effect of the failure. It was said that the attack was to be renewed next morning, and that the Guards and Highland Brigade were to take part in it. Very gloomy was the talk over the tremendous loss which had taken place among the officers. From the manner in which these had exposed themselves to induce their men to follow them, their casualties had been nearly four times as large as they should have been in proportion to their numbers. Jack Archer was in deep grief, for his brother had been severely wounded, and the doctors gave no strong hopes of his life. He had been shot in the hip, as he strove to get the men of his company together, and had been carried to the rear just before the Russian advance drove the last remnants of the assailants from the salient. Jack had, with the permission of his commanding officer, gone to sit by his brother\u0027s bedside, and to give his services generally as a nurse to the wounded. At eleven o\u0027clock the hut was shaken by a tremendous explosion, followed a few minutes afterwards by another. Several of the wounded officers begged Jack to go to Cathcart\u0027s Hill, to see what was doing. Jack willingly complied, and found numbers of officers and men hastening in the same direction. A lurid light hung over Sebastopol, and it was evident that something altogether unusual was taking place. When he reached the spot from which he could obtain a view of Sebastopol, a wonderful sight met his eye. In a score of places the town was on fire. Explosion after explosion followed, and by their light, crowds of soldiers could be seen crossing the bridge. Hour after hour the grandeur of the scene increased, as fort after fort was blown up by the Russians. At four o\u0027clock the whole camp was shaken by a tremendous explosion behind the Redan, and a little later the magazines of the Flagstaff and Garden batteries were blown up, and the whole of the Russian fleet, with the exception of the steamers, had disappeared under the water, scuttled by their late owners. At half-past five two of the great southern forts, the Quarantine and Alexander, were blown up, and soon flames began to ascend from Fort Nicholas. The Russian steamers were all night busy towing boats laden with stores, from the south to the north side, and when their work was done, dense columns of smoke were seen rising from the decks. At seven o\u0027clock in the morning the whole of the Russian troops were safely across the bridge, which was then dismembered and the boats which composed it taken over to the north side. By this time Sebastopol was, from end to end, a mass of flames, and by nightfall nothing save a heap of smoking ruins, surrounded by shattered batteries, remained of the city which had, for so many months, kept at bay the armies of England and France. All through the night Jack Archer had travelled backwards and forwards between the crest of the hill and the hospital; for so great was the interest of the wounded in what was taking place that he could not resist their entreaties, especially as he could do nothing for his brother, who was lying in a quiet, half-dreamy state. The delight of the English army at the fall of the south side of Sebastopol was greatly tempered by the knowledge that it was due to the capture of the Malakoff by the French. Their own share in the attack having terminated by a defeat, and the feeling which had been excited by the fact that the Guards and Highlanders, who had taken no part whatever in the trench-work during the winter, and who were in a high state of efficiency, should have been kept in reserve, while the boy battalions bore the whole brunt of the attack, found angry expression among the men. All that day the allied armies remained quiescent. It was useless to attempt to occupy the burning town, and the troops might have been injured by the explosions which took place from time to time of stores of powder. The Zouaves, however, and our own sailors made their way down in considerable numbers, and returned laden with loot from houses which had so far escaped the conflagration. Happily the success of the French, and our own failure, did not create any feeling of unpleasantness between the troops of the two nations. As the remnants of the French regiments, engaged in the Malakoff, marched in the morning to their camps, the second division was drawn up on parade. As the leading regiment of Zouaves came along, the English regiment nearest to them burst into a hearty cheer, which was taken up by the other regiments as the French came along, and as they passed, the English presented arms to their brave allies and the officers on both sides saluted with their swords. The next day the officers thronged down to see the ground where the fighting had taken place. Around the Malakoff the ground was heaped with dead. Not less had been the slaughter outside the work known as the Little Redan, where the French attack had been repulsed with prodigious loss. The houses of the portion of the town nearest the batteries were found full of dead men who had crawled in when wounded in front. As a considerable number of the Russian steamers of war were still floating under the guns of their batteries on the north side, preparations were made at once to mount two heavy guns by the water-side; but the Russians, seeing that the last remains of their fleet would speedily be destroyed, took matters in their own hands, and on the night of the 11th the six steamers that remained were burnt by the Russians. After the din which had raged so fiercely for the previous four days, and the dropping fire which had gone on for a year, the silence which reigned was strange and almost oppressive. There was nothing to be done. No turn in the trenches or batteries to be served, nothing to do but to rest and to prepare for the next winter, which was now almost upon them. A week after the fall of Sebastopol the anniversary of the battle of Alma was celebrated. What great events had taken place since that time! None of those who had rested that night on the vine-clad hill they had won, dreamed of what was before them, or that they were soon to take part in the greatest siege which the world has ever known. Small indeed was the proportion of those who had fought at the Alma now present with the army at Sebastopol. The fight of Inkerman, the mighty wear and tear in the trenches, the deadly repulses at the Redan, and above all, the hardships of that terrible winter, had swept away the noble armies which had landed in the Crimea, and scarcely one in ten of those who heard the first gun in the Alma was present at the fall of Sebastopol. The naval camp was now broken up, the sailors returned on board ship, and the army prepared to go into winter quarters, that is to say, to dig deep holes under their tents, to erect sheltering walls, and in some instances to dig complete subterranean rooms. A week after the assault Harry Archer was carried down to Balaklava and put on board ship. The surgeons had in vain endeavored to extract the bullet, and were unable to give any cheering reply to Jack\u0027s anxious inquiries. His brother might live; but they owned that his chances were slight. It was a question of general health and constitution. If mortification did not set in the wound might heal, and he might recover and carry the bullet about with him all his life. Of course he had youth and health on his side, and Jack must hope for the best. The report was not reassuring, but they could say no more. Weeks passed on, and the two armies lay watching each other from the heights they occupied. At last it was determined to utilize the magnificent fleet which had hitherto done so little. Accordingly an expedition was prepared, whose object was to destroy the forts at Kinburn and occupy that place, and so further reduce the sources from which the Russians drew their food. The sight was an imposing one, as the allied squadrons in two long lines steamed north past the harbor of Sebastopol. The British contingent consisted of six line-of-battle ships, seventeen steam frigates and sloops, ten gun-boats, six mortar vessels, and nine transports. On board the men-of-war were 8340 infantry, and 1350 marines. The transports carried the Royal Artillery, the medical commissariat and transport corps, stores of all kinds, and the reserve of ammunition. The French fleet was nearly equal in number to our own. Steaming slowly, the great squadrons kept their course towards Odessa, and cast anchor three miles off the town. Odessa is one of the most stately cities of the sea; broad esplanades lined with trees, with a background of stately mansions; terrace after terrace of fine houses rising behind, with numbers of public buildings, barracks, palaces and churches; stretching away on the flanks, woods dotted with villas and country houses. Odessa possessed forts and batteries capable of defending it against the attack of any small naval force; but these could have made no defence whatever against so tremendous an armament as that collected before it. With telescopes those on board were able to make out large numbers of people walking about or driving on the promenade. Long lines of dust along the roads showed that many of the inhabitants were hastily leaving or were sending away valuables, while on the other hand the glimmer of bayonets among the dust, told of the coming of troops who were hurrying in all directions to prevent our landing. Odessa was, however, clearly at our mercy, and considerable controversy took place at the time as to whether the allies should not have captured it. Being defended by batteries, it ranked as a fortified town, and we should have been clearly justified in destroying these, and in putting the town under a heavy contribution, which the wealthy city could readily have paid. However, it was for some reason decided not to do so, and after lying at anchor for five days, the greater portion of which was passed in a thick fog, the great fleet steamed away towards Kinburn. The entrance to the gulf into which the Dneiper and Bug discharge themselves, is guarded by Fort Kinburn on the one side and by Fort Nikolaev on the other, the passage between them being about a mile across. On the 17th fire was opened on Fort Kinburn, and although the Russians fought bravely, they were unable to withstand the tremendous fire poured upon them. Twenty-nine out of their seventy-one guns and mortars were disabled, and the two supporting batteries also suffered heavily. The barracks were set on fire, and the whole place was soon in flames. Gradually the Russian fire ceased, and for some time only one gun was able to answer the tremendous fire poured in upon them. At last, finding the impossibility of further resistance, the officer in command hoisted the white flag. The fort on the opposite shore was blown up by the Russians, and the fleet entered the channel. The troops were landed, and Kinburn occupied, and held until the end of the war, and the fleet, after a reconnaissance made by a few gun-boats up the Dneiper, returned to Sebastopol. The winter was very dull. Exchanges of shots continued daily between the north and south side, but with this exception hostilities were virtually suspended; the chief incident being a tremendous explosion of a magazine in the centre of the camp, shaking the country for miles away, and causing a loss to the French of six officers killed and thirteen wounded, and sixty-five men killed and 170 wounded, while seventeen English were killed, and sixty-nine wounded. No less than 250,000 pounds of gunpowder exploded, together with mounds of shells, carcasses and small ammunition. Hundreds of rockets rushed through the air, shells burst in all directions over the camp, and boxes of small ammunition exploded in every direction. The ships in the harbors of Balaklava and Kamiesch rocked under the explosion. Mules and horses seven or eight miles away broke loose and galloped across the country wild with fright, while a shower of fragments fell over a circle six miles in diameter. On the last day of February the news came that an armistice had been concluded. The negotiations continued for some time before peace was finally signed. But the war was at an end, and a few days after the armistice was signed the \"Falcon\" was ordered to England, to the great delight of all on board, who were heartily sick of the long period of inaction. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3112/85702.html","bookId":932,"book":{"id":932,"title":"Jack Archer","description":"简介： The first day of term cannot be considered a cheerful occasion. As the boys arrive on the previous evening, they have so much to tell each other, are so full of what they have been doing, that the chatter and laughter are as great as upon the night p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3112","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
