{"id":100971,"no":11,"title":"Page 11","content":"“He’d never do that to you, Collin,” Julia said as she sat down.\\n\\n “A long time ago, I would have thought the same thing. But now, I’m not so sure anymore,” I said as I looked down.\\n\\n “I think you need to get some help and talk to someone about Hailey. Go see a shrink.”\\n\\n I chuckled. “Yeah, right. I’m not going to see a shrink. I’ll be fine.”\\n\\n “You’re fine when you’re drinking. Don’t you see, Collin, alcohol is a band aid, and without it, you won’t stop thinking about her.”\\n\\n “You don’t understand, Julia. No one understands what it’s like to walk in my shoes right now. Maybe I’m crazy. Who the fuck knows.”\\n\\n “She was your first love and first loves are hard to get over. But you can’t drink your troubles away. Mom and Dad always taught us to deal with our problems head on and find a solution. Alcohol is not the solution.”\\n\\n “You talk like I’m an alcoholic. I’m not an alcoholic, Julia.”\\n\\n “I didn’t say you were. I’m just worried about you heading down the wrong path.”\\n\\n I sighed as I got up from my chair and grabbed a bottle of water from the mini fridge. “Don’t worry about me. I’ll be fine. I promise you.”\\n\\n “Did you forget your birthday is in a couple of days?” she said.\\n\\n “No, I haven’t forgotten and Mom and Dad haven’t mentioned it either.”\\n\\n She smiled as she got up from the chair. “That’s because they’re throwing you a surprise party. Don’t you dare tell them that you know. Jake and I are taking you out to dinner and then back to the penthouse. The only reason I’m telling you is because you’ll go off and make plans and you’ll ruin it for Mom and Dad. So I’m giving you notice right now.”\\n\\n I walked over and hugged her. “Thank you for letting me know. I would’ve made plans.”\\n\\n “I know you would’ve.” She smiled.\\n\\n I placed my hand on her stomach and felt the small bump she had. “How’s my niece or nephew?”\\n\\n “Fine, and I need to go shop for maternity clothes. I can’t squeeze into my regular clothes anymore.”\\n\\n “I’m sure Mom is really excited to take you.”\\n\\n “She is. We’re going tomorrow,” she said as she opened the door. “I love you, little brother.”\\n\\n “I love you, big sister.” I smiled.\\n\\n Chapter 7\\n\\n Connor\\n\\n I sat at my desk, thinking about Collin and what the hell I was going to do with him. I picked up my phone from the desk and called Denny.\\n\\n “Hi, Connor.”\\n\\n “Hi, Denny. How are you, friend?”\\n\\n “You know me; I’m doing okay.”\\n\\n “Enjoying retirement?” I asked.\\n\\n “Somewhat.”\\n\\n “I was wondering if I can stop by later? I need to talk to you about Collin.”\\n\\n “Sure. I’ll be here all day.”\\n\\n “Great. I’ll see you soon.”\\n\\n I could always count on Denny to give me the right advice. After all, he always put his two cents in when it came to Ellery.\\n\\n I met with Diana and she accepted the position I offered her as my secretary. Valerie spent the day with her and showed her the ropes. I finished up some paperwork and stopped by Collin’s office to see what he was doing and to let him know that I was leaving the building for the day. When I walked in his office, he was standing and staring out the window with his hands in his pocket. He reminded me so much of me at his age.\\n\\n “Son,” I said as I walked in.\\n\\n “Hey, Dad.”\\n\\n “I have somewhere I need to be, so I’m leaving for the day.”\\n\\n “Okay. I’ll either catch a cab or get a ride home with Julia. You know, you really need to hire someone to replace Denny,” he said.\\n\\n “I know I do. I’ll see you later at home.”\\n\\n I walked out of the building and climbed into the Range Rover and headed to Denny’s house. When I arrived, he was sitting in the backyard. I walked back and gave him a hug. I hadn’t seen him in about a month and I really missed him.\\n\\n “Sit down and talk to me about Connor Jr.,” he said.\\n\\n I sighed as I sat down and took the scotch he already had waiting for me. “Why are you calling my son that?”\\n\\n “Because the apple doesn’t fall far from the tree. I told you that your past would come back to bite you in the ass one day.” He smiled.\\n\\n I rolled my eyes. “His heart is broken and he’s partying too much. God knows how many women he’s had sex with already.”\\n\\n “Like I said, the apple doesn’t fall far from the tree.” He chuckled. “The boy has your genes, Connor. Put yourself in his shoes because you’ve been there. You’ve walked in his shoes already. Your heart was broken because you thought you were responsible for Amanda’s death. His heart is broken because the love of his life, or so he thinks she is, left him and left the country. His defenses are up now, just like yours were. He’s killing the pain with booze and sex, just like you did. The difference is, you can help him now. Your father wasn’t there for you and I tried to be the best I could. But, you’ve been there and you can talk sense into him.”\\n\\n “I tried. He won’t listen to me.”\\n\\n “Yeah, I know the feeling.” He smiled as he held his glass up to mine. “I think you need to come clean with your son and tell him about the list of rules you had in place for your women.”\\n\\n I looked at him in horror. “There is no way in hell I’d share that with my son.”\\n\\n “Step outside your perfect box, Connor. Collin is hurting something awful. He’s doing the same thing you did. You need to make him see that it’s wrong, and if he continues walking that line, he’ll regret it. You were a miserable bastard until the day you met Ellery. You need to tell him about Ashlyn and what she did to you and your family. You never know, he could run across a psycho bitch like that himself if he keeps up his ways.”\\n\\n I threw back my drink. “I’ve already thought about that. The difference is I was more responsible at his age where work was concerned. I threatened to fire him and cut him off today if he didn’t straighten up.”\\n\\n “Was that really a wise move? Just be there for him, Connor. What does Ellery say about all this?”\\n\\n “Of course she’s upset and she’s worried about him.”\\n\\n “He’s a Black, and he comes from an outstanding and loving family. He’ll be okay. But he will need your guidance.” \\n\\n","sourceLink":"https://allnovel.net/collin-forever-4/page-11.html","bookId":1817,"book":{"id":1817,"title":"Collin (Forever #4)","description":"Storyline: The Forever Trilogy hasn\u0027t ended yet...now it\u0027s time for Connor \u0026 Ellery\u0027s son to tell his story... \\n I’d like to introduce myself. My name is Collin Black, and I’m the future CEO of Black Enterprises. At twenty-two years old, I’m living the American dream, or at least my version of it. I’m rich, fit, sexy, and no matter where I go, women are always throwing themselves at me. I love to party, and when I do, it can sometimes lead to trouble. \\n Women. What can I say? One woman broke my heart which led me to close myself off so it could never happen again. I’ve become one of New York’s most eligible bachelors and bad boy. I leave a trail of broken hearts wherever I go. \\n Until her. \\n This is my journey of going through the ups and downs of life as I climb the corporate ladder, heal a broken heart, and discover that there’s more life than what I thought. \\n She. Changed. Everything.\\n","cover":"https://allnovel.net/images/collin-forever-4.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collin-forever-4.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:07:15 PM"}}
