{"id":85664,"no":24,"title":"Page 24","content":"“Damn it, Amelia! I deserve an explanation!” She stopped walking and stood there for a second. Suddenly, she turned around. “You want an explanation? Fine, I’ll give you an explanation. I’ve known you now for two days. Only two days and I already feel guilty for spending time with you and having fun. I feel guilty because I should have been the one who died in that accident. Not my parents, not my sister, and certainly not Billy,” she yelled. “I don’t deserve to have fun or be happy!” My heart broke listening to her yell that across the beach. I slowly walked towards her, not knowing what she’d do. But she didn’t do anything but stand there. I approached her with caution and looked into her sad blue eyes and placed my hands gently on each side of her face. “You deserve to be happy. Don’t ever think you don’t. I don’t know what happened, but I do know that the accident wasn’t your fault. We can’t control fate, Amelia. You survived for a reason. Don’t ever forget that,” I said as I pulled her into a warm embrace. “They shouldn’t have died, Collin. They just shouldn’t have,” she began to cry. I held her tightly as I felt sorry for her. I could feel her pain and ache as she cried into my chest. As she began to stop crying, she looked up at me. “I’m so sorry for that,” she said. “Don’t apologize. Never apologize for the way you feel,” I said. We stood there and stared into each other’s eyes. I wanted to fucking kiss her so bad, but not under these circumstances. I pulled away. It was the only thing I could do or else I would have kissed her and potentially could’ve ruined what little we had at the moment. “Can we go back to making s’mores?” “Can we order a pizza?” she said with a half-smile. I chuckled as I placed my forehead on hers. “Yeah. Pizza sounds like a great idea.” I put my arm around her and she laid her head on my shoulder as we walked up to the house. I pulled out the pizza menu and, after we both decided on what we wanted, I placed the order and we waited for it to be delivered. Chapter 16 The alarm went off and I jumped into the shower. I couldn’t stop thinking about Amelia and last night. We enjoyed our pizza and had a great conversation about music. It turned out that we shared the same taste. Once I showered, I got dressed, grabbed my bag, locked up the house, and headed to Amelia’s. When I pulled in her driveway, she was standing on the porch with her bags. “Good morning.” I smiled. “Good morning. Look at you looking all handsome in a business suit.” I smiled as I grabbed her bags and set them with mine in the back seat. I opened the door for her and she climbed in. “Ready to head back to the city?” I asked. “Not really. I would like to stay here forever. I love it here.” “Me too.” I said as I touched her hand. She turned and looked at me with a smile. I could get used to seeing that smile every morning. “I think we need some Starbucks before we head back. What do you think?” “I think you just read my mind, Mr. Black.” I pulled into the drive thru and ordered us coffee and two muffins. All the way to the city, we sang some of my favorite songs and had a lengthy conversation about politics. That was a subject we must never talk about again. “My apartment is at 75 Third Ave. in the Third Avenue North building.” “You’re not too far from Black Enterprises.” We reached her building and I got out and grabbed her bags. “It’s okay, Collin. I can get them. Thank you for me driving back. I appreciate it,” she said as she kissed me on the cheek. “You’re welcome and it was my pleasure.” “I’ll see you around,” she spoke. “Don’t be a stranger,” I said as I got into the Range Rover and clasped the steering wheel. I felt sick to my stomach as I watched her walk into the building. What if this was the end for us? What if the Hamptons was just a dream and, now that we were back to reality, the dream was gone. I pulled out into traffic and drove to the office. I took the elevator up to my dad’s office, but stopped to say hi to Diana first. “How was your weekend?” she asked. “It was amazing! How’s Jacob?” “He’s had a little setback. But he’ll be okay.” “Tell him I’m coming over to play some Xbox tonight.” “He’ll like that very much.” She smiled. “Your dad is waiting for you.” I sighed. “I know.” I opened the door and, when I walked in, he was on the phone. He motioned for me to sit down. I walked over to the coffee pot and poured a cup of coffee before taking a seat in the chair. “How was your ride back?” he asked as he hung up from his call. “It was great. How was yours?” “Don’t try and change the subject, son. I can tell you’re smitten with this girl.” “Smitten? Really, Dad? Did you just say ‘smitten’?” “Collin, you know what I mean,” he sighed. “I do like Amelia. She’s a great girl, but she’s very complicated and that bothers me.” My dad leaned back in his chair. “Complicated how?” “Her parents, sister, and boyfriend were all killed in a boating accident two years ago. She confided in me last night that she should’ve have been the one killed, not them. She’s really closed herself off to the world and I can tell she’s scared.” “So are you,” he said. “Hailey left a bad mark on you and that’s why your behavior has been less than acceptable. But, as someone who understands, I can see where you’re coming from. If you truly like her and want to be with her, make it happen. I did, and believe me, son, I was more fucked up than you. I’ve learned to let go of fear and let things happen the way they’re supposed to.” “Thanks, Dad, for your wisdom. Now, let’s go over that proposal. I have a lot of work to do today.” He smiled at me as he pulled out the file from his drawer and we spent the next hour going over business. “Spill, little brother,” Julia said as she walked in my office. “Wow, you look bigger than the last time I saw you.” I smiled. “I’m not here to talk about how fat I’m getting. I’m here to talk about your little romantic weekend.”","sourceLink":"https://allnovel.net/collin-forever-4/page-24.html","bookId":1817,"book":{"id":1817,"title":"Collin (Forever #4)","description":"Storyline: The Forever Trilogy hasn\u0027t ended yet...now it\u0027s time for Connor \u0026 Ellery\u0027s son to tell his story... I’d like to introduce myself. My name is Collin Black, and I’m the future CEO of Black Enterprises. At twenty-two years old, I’m living the American dream, or at least my version of it. I’m rich, fit, sexy, and no matter where I go, women are always throwing themselves at me. I love to party, and when I do, it can sometimes lead to trouble. Women. What can I say? One woman broke my heart which led me to close myself off so it could never happen again. I’ve become one of New York’s most eligible bachelors and bad boy. I leave a trail of broken hearts wherever I go. Until her. This is my journey of going through the ups and downs of life as I climb the corporate ladder, heal a broken heart, and discover that there’s more life than what I thought. She. Changed. Everything.","cover":"https://allnovel.net/images/collin-forever-4.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collin-forever-4.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:07:15 PM"}}
