{"id":85687,"no":47,"title":"Page 47","content":"“YES I DO!” she yelled.\\n\\n We finally arrived at the hospital and I grabbed a wheelchair and helped her into it. I wheeled her into the Emergency Room and the nurse immediately took us up to the Labor and Delivery Unit. She handed me paperwork to fill out and called me Mr. Jensen.\\n\\n “Oh, I’m not her husband. I’m her brother. Her husband, Jake, is on his way.”\\n\\n The nurse apologized and made me leave the room while Julia changed into the hospital gown. As soon as it was safe, I walked back in and walked over to Julia. I grabbed her hand, kissed it, and sat down in the chair next to her.\\n\\n “It’s too early, Collin. I’m scared. What if something’s wrong with him?”\\n\\n “Nah, nothing’s wrong with him. He’s just an impatient little guy and he wants to come out and see the world.” I smiled.\\n\\n The nurse hooked Julia up to the fetal monitor and said that everything sounded great. She had a few more contractions that nearly broke my hand. The doctor came in and I left the room so he could examine her. When I walked back in, Julia had a big smile on her face.\\n\\n “I can have an epidural. The doctor is ordering it now.”\\n\\n “That’s great, Julia. You’ll be pain free soon,” I said as I dialed my dad. He didn’t answer.\\n\\n A few moments later, the anesthesiologist walked in with the epidural for Julia. Another contraction had come and, as I was holding her and helping her through it, she dug her nails so far into my arm that I started to bleed. I just bit down on my lip and didn’t make a sound. Once her contraction was over, the anesthesiologist gave her the epidural. I had to look away because the needle was making me sick. God, it was a good thing she didn’t see that. She lay back down and began to be comfortable. After the anesthesiologist left the room, my mom, dad, and Jake came busting through the door. All three of them ran to her side. Jake wouldn’t stop kissing her and my mom instantly ran to the bathroom and wet a washcloth for her. My dad looked at me and smiled. He walked over put his arm around me and led me out into the hallway.\\n\\n “Thank you, son, for taking care of your sister.”\\n\\n “Of course, Dad. She’s lucky I was there.”\\n\\n He looked at my arm and saw the nail marks and the tiny bit of blood that emerged from them.\\n\\n “Are you okay? It looks like she got you pretty good.”\\n\\n “I’m fine.” I smiled. “She just scared me a bit. God, all that yelling and shit. It was like she was possessed.”\\n\\n “Yep. I remember your mother in labor with both of you. Trying times, son. Trying times.”\\n\\n We walked back into the room and my mom hugged me. “Thank God you were there.”\\n\\n “Thanks a million, bro. I owe you big time,” Jake said as he hugged me.\\n\\n I pulled him over to the side and showed him my arm. “Yeah, you do.” I smiled.\\n\\n “Ouch. Sorry, man.”\\n\\n I kissed Julia on the head and told her I was going to see if Amelia was here yet. She smiled at me, and before I walked out the door, she called my name.\\n\\n “Hey, Collin.”\\n\\n I stopped and turned around. “Yeah.”\\n\\n “I love you.” She smiled.\\n\\n “I love you too, sis.”\\n\\n I met Amelia in the lobby and we stopped at the coffee bar before heading back up to see Julia.\\n\\n “What happened to your arm?” she asked.\\n\\n “Julia.” I laughed.\\n\\n I sent a text message to my dad, asking if he, my mom, or Jake wanted anything. He texted me back saying that he and my mom were on their way down. I bought Amelia and me some coffee and we sat down, waiting for my parents.\\n\\n “I can’t believe I’m going to be an uncle soon.”\\n\\n “I know. I didn’t think she’d go into labor this soon.”\\n\\n “The doctor said that the baby is fine and seems to be ready to make his appearance into the world.” I smiled. “Do you want kids?” I asked out of the clear blue.\\n\\n She laid her head on my shoulder. “Yeah. I love kids.”\\n\\n “How many do you want?”\\n\\n “Why?” she asked as she lifted her head and looked at me. “Are you worried that I’m going to say five or six.”\\n\\n “No. But you really don’t want that many, do you?” I asked with nervousness.\\n\\n She laughed as my parents walked up to us and she never did answer my question. As much as I loved and wanted children, I thought two was perfect.\\n\\n “I can’t believe I’m going to be a grandma!” my mom said with excitement as she hugged Amelia.\\n\\n “Do I dare ask what you were doing in the middle of the afternoon and why you weren’t at the office?” I said to my dad.\\n\\n He looked at me and smiled. “Do you really want to know the answer to that?”\\n\\n I rolled my eyes because I already knew. I looked at him and my mom and shook my head.\\n\\n “What?” she asked. “Your father came home because he left some papers on his desk that he needed.”\\n\\n “Okay. No details, please. I already got my answer.”\\n\\n All of our phones beeped at the same time and, when we looked at them, there was a text message from Jake.\\n\\n “IT’S TIME!”\\n\\n My mom and dad jumped up from their chairs and ran to the elevators. I took Amelia’s hand and we waited in the waiting room while my mom and dad stayed with Julia. She told them that she wanted both of them in the room to witness the birth of their first grandchild.\\n\\n “You never answered my question,” I said as I kissed Amelia’s hand.\\n\\n “What question?” She smiled.\\n\\n “The one about how many kids you want.”\\n\\n “So now you’re nervous?” She laughed.\\n\\n “No, not at all,” I lied.\\n\\n “Relax, Mr. Black. I think two children are perfect. But if a third happened unexpectedly, that would be okay too.”\\n\\n I smiled as I leaned over and kissed her cheek. She was on the same page as I was regarding kids and I couldn’t be happier.\\n\\n “I hope I’ve made you happy with my answer.” She smiled as she gently squeezed my hand. “I love you.”\\n\\n “You have and I love you just as much.”\\n\\n We waited patiently and, after about an hour, my dad came out of Julia’s room with the biggest smile on his face that I’d ever seen.\\n\\n “He has arrived.”\\n\\n I stood up and hugged my dad. He was so happy. We followed him into the room and I stopped in the doorway and stared at my big sister holding her brand new baby. I couldn’t help the tears that filled my eyes as she looked at me. \\n\\n","sourceLink":"https://allnovel.net/collin-forever-4/page-47.html","bookId":1817,"book":{"id":1817,"title":"Collin (Forever #4)","description":"Storyline: The Forever Trilogy hasn\u0027t ended yet...now it\u0027s time for Connor \u0026 Ellery\u0027s son to tell his story... \\n I’d like to introduce myself. My name is Collin Black, and I’m the future CEO of Black Enterprises. At twenty-two years old, I’m living the American dream, or at least my version of it. I’m rich, fit, sexy, and no matter where I go, women are always throwing themselves at me. I love to party, and when I do, it can sometimes lead to trouble. \\n Women. What can I say? One woman broke my heart which led me to close myself off so it could never happen again. I’ve become one of New York’s most eligible bachelors and bad boy. I leave a trail of broken hearts wherever I go. \\n Until her. \\n This is my journey of going through the ups and downs of life as I climb the corporate ladder, heal a broken heart, and discover that there’s more life than what I thought. \\n She. Changed. Everything.\\n","cover":"https://allnovel.net/images/collin-forever-4.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collin-forever-4.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:07:15 PM"}}
