{"id":83926,"no":14,"title":"Page 14","content":"\n \"Guh,\" she said, blinking, staring, before the wolf gave her a sloppy lick on her cheek. The large, furry head bent and licked her stomach, where their child nestled. \"Michael, oh Michael,\" she whispered, reaching out a shaking hand and touching the luxurious pelt. When the wolf—Michael—didn\u0027t move away from her touch, merely sat calmly, she gave her delight and curiosity free reign, running her hands over his strong limbs, his tail, stroking the noble head, even burying her face in his rich, black coat. She realized dimly her face was wet as the pent-up emotions—fear, anger, despair—departed as easily as Michael had shed his human form.\n It was all true. They weren\u0027t crazy fools. She was the fool, for blinding herself to the truth. He was pack leader, she was his mate, she carried the next pack leader. She was in danger as long as Gerald wanted power. Michael had been right to track her and bring her to his home. She had been wrong to escape.\n \"Michael,\" she whispered into his fur, \"I love you.\"\n She didn\u0027t know if he could understand her in his lupine form, but all the same, he made a deep, rumbling noise in his chest, quite like a purr. She hoped he understood. On the other hand, she had a lifetime to repeat the phrase.\n The rumbling abruptly shifted in pitch, from purr to growl. She pulled back from him, instinctively knowing Michael was incapable of hurting her in whatever form he took, but still wary. He sprang from her side and arrowed at the balcony doors, slamming into one of them hard enough to crack the heavy glass.\n \"Whoa!\" she said, scrambling to her feet and running for the door. \"You want out? No problem, just a second.\" After a moment she had the door open and Michael dashed past, scrambling up the railing and then fearlessly leaping into the dark.\n Behind him, Jeannie watched him drop two stories, landing in a crouch on all fours. \"Well, hell,\" she breathed, \"no wonder the elevator fall didn\u0027t kill you.\"\n She was still staring, mouth open like a rube idiot, when another wolf darted out of the cover and went for her lover\u0027s throat. This wolf had mud-colored fur the exact color of Gerald\u0027s hair, and she knew at once who the wolf had to be . . . and who he had come for. Michael avoided the attack, and the two powerful males squared off and charged.\n He\u0027s nuts! was her first thought. Taking Michael on in his own territory? Maybe Gerald had heard all the females were gone, and assumed Jeannie would be easy for the taking . . . maybe he\u0027d also heard Michael had planned to be gone this evening. And probably figured, tonight, or not at all . . .\n Her thoughts were interrupted by a noise; she turned in time to see a butterscotch-colored wolf with Derik\u0027s green eyes rocket past her, straight over the balcony railing. Four other wolves had by now surrounded the snarling, fighting males, and Derik unhesitatingly went for the throat of the closest traitor.\n Jeannie turned and went at once to the endtable drawer where she had so carelessly dropped Gerald\u0027s gun—was it only yesterday? She popped the clip, noted with grim pleasure that it was full, then slapped the clip back in, pulled back the slide, and ratcheted a load into the chamber. So Michael was right, she thought distractedly, walking back out on the balcony. Gerald\u0027s gun wouldn\u0027t have fired, and he could have killed me then. Well, well. Note to self: apologize to lover, after saving lover\u0027s ass.\n A distant part of her reminded her that the room was pitch dark and there was not enough starlight for her to see by. Still, she could make out everything as clearly as if it was noon: the wolves\u0027 coloring, the lush green of the grass, even some of their eye colors. Thank you, baby werewolf, she thought, and then sighted in on Gerald, who had, she noticed with detached rage, just taken a chunk out of her lover\u0027s shoulder. She had no idea how Gerald expected to hustle her off Wyndham property in his wolf form. Maybe he was part human and could control his change. Regardless, she wasn\u0027t about to stand by and let him damage others—Michael!—in his quest for power.\n The two wolves were locked together in an age-old battle for territory and females, and Jeannie, whose cop mother and Marine father knew a little something about battle, waited for her chance. In the meantime, Derik had chased off his opponent and, though one leg was bloodied and one ear gone, was turning hungrily on another.\n Gerald reared back and went for Michael\u0027s throat. Instead, Jeannie got his—two shots, right where she guessed the adam\u0027s apple was on a werewolf.\n \"How about that, Gerald?\" she shouted down. She picked off Derik\u0027s newest opponent with a clean head shot, and Derik jumped back from the newly-dead werewolf with a yip that sounded suspiciously like a laugh. \"In case you didn\u0027t realize, trespassers will be shot!\" Thinking: thank goodness, the stories about silver bullets aren\u0027t true.\n The other traitors froze, and looked up at her, except for Gerald, who was coughing out his life on the lawn.\n \"This is the alpha female speaking,\" she said, and as the fatally wounded Gerald made one last try for Michael, she put four into his head. \"Playtime\u0027s over.\"\n The other traitors—only two, now—took off, Derik hot on their heels. Michael looked up at her, coiled, and made a clumsy jump for the balcony. She gasped when she saw his wounds.\n \"Lucky for us you\u0027re a fast healer,\" she said, and popped the live round out of the chamber. She put the gun away, then went to tend to her mate.\n Chapter Ten\n In bed, she could hear them chatting at breakfast, even though they were a floor below her.\n \"And then Michael\u0027s trying to keep Gerald off his throat, right?\" Derik said. She could picture him holding the group spellbound, talking with his hands, eyes gleaming with suppressed excitement. \"And I\u0027ve got my hands full with those other two assholes. And Michael and I are both thinking, Cripes, are there more on the grounds? Can we take them even though the girls aren\u0027t here to help? And we\u0027re assuming Jeannie is just about out of her mind, right? I mean, I would have been scared at the sight. Then—ka-blammo! Close enough to singe Michael\u0027s fur, Gerald\u0027s got a couple holes in his throat, and we all look up and there\u0027s our pack leader\u0027s mate—naked, no less—holding a smoking gun and yelling at Gerald, who\u0027s been causing trouble since he was whelped.\"\n \"Then what?\" Moira asked excitedly.\n \"Then she drills my guy, puts a few more in Gerald, binds Michael\u0027s wounds, and ate a big supper at 2:00 a.m.\"\n \"I knew it! I knew Michael had chosen wisely! And you said she\u0027d never fit in, Dara.\"\n \"I did not. I said after a few months, she\u0027d never fit in her clothes. That\u0027s all.\"\n Hearing her staff speak of her with such admiration brought a warm flush to her cheeks. And really, she hadn\u0027t done all that much. Just saved the day.\n The thought made her laugh out loud. Beside her, Michael was sleeping deeply, and stirred at the sound. She hushed at once and examined his shoulder. The wound looked months old, and she again thanked God for werewolf metabolism.\n She touched her stomach lightly, with love. There was a werewolf growing inside her, which should have scared her—should have creeped her out at the very least—but instead, she was filled with a joyful acceptance of her future. She didn\u0027t know much about werewolves, but she was going to learn, oh yes. Michael would help her. Her pack would help her.\n A large brown hand covered hers, and she looked into Michael\u0027s golden eyes. \"My own mate,\" he said slowly, savoring the words, \"and so brave. Even when we were in the elevator, you were brave.\"\n \"Well, of course. You weren\u0027t going to let anything happen to me.\"\n \"As you, apparently, won\u0027t let anything happen to me,\" he said wryly. \"Remind me to instruct you on the finer points of werewolf etiquette. Number one: never interfere with a Challenge.\" But he was smiling as he said it, and she knew that, though his male pride might be a bit ruffled, he was pleased with her.\n \"And number two?\"\n \"Always take a human to mate,\" he said, and pulled her to him for a long kiss. When he pulled back, she was breathless, and his eyes glinted with satisfaction. \"Before we were so rudely interrupted last night, you told me something. I very much want to hear the words again.\"\n \"So you can understand me when you\u0027re a—\"\n \"The words, Jeannie.\"\n \"I love you. Dork. What, you think I\u0027d shoot a man for just anybody?\"\n \"For a while,\" he said seriously, \"I wondered if you might shoot me.\"\n \"I was an idiot,\" she admitted. \"A blind fool. It was all right in front of me, and I wouldn\u0027t accept it.\"\n \"You were perfect,\" he assured her, \"considering the circumstances. The words again, Jeannie, please.\"\n \"I love you.\"\n \"Let me show you how I feel,\" he whispered, and kissed her.\n Their lovemaking was slow and almost dreamlike, and for Jeannie, who had only known fierce, fast, couplings with this man, it was like discovering a whole different side to her mate. He took his time, touching her with skilled reverence, gaining pleasure from her own. Even when she was begging him to enter her, tugging on his shoulders and whimpering pleas that made his eyes narrow with lust, he held back. \"No,\" he said, almost moaned, \"this time, I want it to last.\"\n Shuddering with pleasure beneath his hands, she had the sense that he was finally touching her as he had always longed to, and she gloried in it. When he slid into her she shivered in his arms and gasped her love, and he closed his eyes in gratitude, deeply moved. He opened his eyes and she stared into his curious gold gaze. \"Oh, Jeannie,\" he breathed, \"I love you, too, my dearest, my own mate.\"\n They rocked together, both of them creatures of savagery and passion, and cried out until they were hoarse. And when they were done, and drowsing in each other\u0027s arms, Jeannie had time for one thought before she spiraled down into sleep: Thank God I didn\u0027t take the stairs. \n","sourceLink":"https://allnovel.net/love-s-prisoner-wyndham-werewolf-1/page-14.html","bookId":1882,"book":{"id":1882,"title":"Love\u0027s Prisoner (Wyndham Werewolf #1)","description":"Storyline: \n Love\u0027s Prisoner (Wyndham Werewolf #1) \n Trapped in an elevator, Jeannie Lawrence experienced unwilling rapture at Michael Windham\u0027s hands. She never expected the devilishly handsome man to show back up in her life  or turn out to be a werewolf! Will she accept her destiny to be his mate?\n \n","cover":"https://allnovel.net/images/love-s-prisoner-wyndham-werewolf-1.jpg","author":"MaryJanice Davidson","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/love-s-prisoner-wyndham-werewolf-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:55:25 PM"}}
