{"id":4726,"no":31,"title":"Chapter 31","content":"Mr. and Mrs. Morland\u0027s surprise on being applied to by Mr. Tilney for their consent to his marrying their daughter was, for a few minutes, considerable, it having never entered their heads to suspect an attachment on either side; but as nothing, after all, could be more natural than Catherine\u0027s being beloved, they soon learnt to consider it with only the happy agitation of gratified pride, and, as far as they alone were concerned, had not a single objection to start. His pleasing manners and good sense were self-evident recommendations; and having never heard evil of him, it was not their way to suppose any evil could be told. Goodwill supplying the place of experience, his character needed no attestation. \"Catherine would make a sad, heedless young housekeeper to be sure,\" was her mother\u0027s foreboding remark; but quick was the consolation of there being nothing like practice.\n There was but one obstacle, in short, to be mentioned; but till that one was removed, it must be impossible for them to sanction the engagement. Their tempers were mild, but their principles were steady, and while his parent so expressly forbade the connection, they could not allow themselves to encourage it. That the general should come forward to solicit the alliance, or that he should even very heartily approve it, they were not refined enough to make any parading stipulation; but the decent appearance of consent must be yielded, and that once obtained -- and their own hearts made them trust that it could not be very long denied -- their willing approbation was instantly to follow. His consent was all that they wished for. They were no more inclined than entitled to demand his money. Of a very considerable fortune, his son was, by marriage settlements, eventually secure; his present income was an income of independence and comfort, and under every pecuniary view, it was a match beyond the claims of their daughter.\n The young people could not be surprised at a decision like this. They felt and they deplored -- but they could not resent it; and they parted, endeavouring to hope that such a change in the general, as each believed almost impossible, might speedily take place, to unite them again in the fullness of privileged affection. Henry returned to what was now his only home, to watch over his young plantations, and extend his improvements for her sake, to whose share in them he looked anxiously forward; and Catherine remained at Fullerton to cry. Whether the torments of absence were softened by a clandestine correspondence, let us not inquire. Mr. and Mrs. Morland never did -- they had been too kind to exact any promise; and whenever Catherine received a letter, as, at that time, happened pretty often, they always looked another way.\n The anxiety, which in this state of their attachment must be the portion of Henry and Catherine, and of all who loved either, as to its final event, can hardly extend, I fear, to the bosom of my readers, who will see in the tell-tale compression of the pages before them, that we are all hastening together to perfect felicity. The means by which their early marriage was effected can be the only doubt: what probable circumstance could work upon a temper like the general\u0027s? The circumstance which chiefly availed was the marriage of his daughter with a man of fortune and consequence, which took place in the course of the summer -- an accession of dignity that threw him into a fit of good humour, from which he did not recover till after Eleanor had obtained his forgiveness of Henry, and his permission for him \"to be a fool if he liked it!\"\n The marriage of Eleanor Tilney, her removal from all the evils of such a home as Northanger had been made by Henry\u0027s banishment, to the home of her choice and the man of her choice, is an event which I expect to give general satisfaction among all her acquaintance. My own joy on the occasion is very sincere. I know no one more entitled, by unpretending merit, or better prepared by habitual suffering, to receive and enjoy felicity. Her partiality for this gentleman was not of recent origin; and he had been long withheld only by inferiority of situation from addressing her. His unexpected accession to title and fortune had removed all his difficulties; and never had the general loved his daughter so well in all her hours of companionship, utility, and patient endurance as when he first hailed her \"Your Ladyship!\" Her husband was really deserving of her; independent of his peerage, his wealth, and his attachment, being to a precision the most charming young man in the world. Any further definition of his merits must be unnecessary; the most charming young man in the world is instantly before the imagination of us all. Concerning the one in question, therefore, I have only to add -- aware that the rules of composition forbid the introduction of a character not connected with my fable -- that this was the very gentleman whose negligent servant left behind him that collection of washing-bills, resulting from a long visit at Northanger, by which my heroine was involved in one of her most alarming adventures.\n The influence of the viscount and viscountess in their brother\u0027s behalf was assisted by that right understanding of Mr. Morland\u0027s circumstances which, as soon as the general would allow himself to be informed, they were qualified to give. It taught him that he had been scarcely more misled by Thorpe\u0027s first boast of the family wealth than by his subsequent malicious overthrow of it; that in no sense of the word were they necessitous or poor, and that Catherine would have three thousand pounds. This was so material an amendment of his late expectations that it greatly contributed to smooth the descent of his pride; and by no means without its effect was the private intelligence, which he was at some pains to procure, that the Fullerton estate, being entirely at the disposal of its present proprietor, was consequently open to every greedy speculation.\n On the strength of this, the general, soon after Eleanor\u0027s marriage, permitted his son to return to Northanger, and thence made him the bearer of his consent, very courteously worded in a page full of empty professions to Mr. Morland. The event which it authorized soon followed: Henry and Catherine were married, the bells rang, and everybody smiled; and, as this took place within a twelvemonth from the first day of their meeting, it will not appear, after all the dreadful delays occasioned by the general\u0027s cruelty, that they were essentially hurt by it. To begin perfect happiness at the respective ages of twenty-six and eighteen is to do pretty well; and professing myself moreover convinced that the general\u0027s unjust interference, so far from being really injurious to their felicity, was perhaps rather conducive to it, by improving their knowledge of each other, and adding strength to their attachment, I leave it to be settled, by whomsoever it may concern, whether the tendency of this work be altogether to recommend parental tyranny, or reward filial disobedience.\n *Vide a letter from Mr. Richardson, No. 97, Vol. II, Rambler.\n A NOTE ON THE TEXT\n Northanger Abbey was written in 1797-98 under a different title. The manuscript was revised around 1803 and sold to a London publisher, Crosbie \u0026 Co., who sold it back in 1816. The Signet Classic text is based on the first edition, published by John Murray, London, in 1818 -- the year following Miss Austen\u0027s death. Spelling and punctuation have been largely brought into conformity with modern British usage.\n 当蒂尔尼先生请求莫兰夫妇同意他和凯瑟琳结婚时，夫妇俩起初感到万分惊讶。他们从没想到这两个人会相爱，然而凯瑟琳被人爱上毕竟是再自然不过的事情，因此他们很快便产生了一种得意的自豪感，只觉得心里十分高兴，十分激动。就他们自己来说，他们丝毫也不反对这门亲事。亨利举止可爱，富有见识，这是明摆着的优点。他们从没听见有人说过他的坏话，也不认为有人会说他的坏话。他们与他从没相处过，但是不需要什么证明，只凭好感便相信了他的人格。\"凯瑟琳是个小马虎，可不会理家呀，\"做母亲的事先警告说。可是马上又安慰道：实践实践就会啦。\n 简而言之，只有一个障碍要提出来，这个障碍不除掉，莫兰夫妇是不会答应订婚的。他们在脾气上是温和的，但在原则上却是坚定不移的。亨利的父亲既然明确发话反对两家结亲，他们也就不能鼓励这门亲事。他们没有那么高雅，不会装模作样地规定：将军非得亲自出来求亲，或者诚心诚意地表示赞成。但是，对方必须给个像样的同意，他们相信将军不会长期拒绝下去，一旦取得他的同意，他们马上就会答应这门婚事。他们只要求将军表示个同意。他们不希求，也没有权利要他的钱。根据结婚分授财产的规定，他儿子终究会得到一笔十分可观的财产。他目前的收人也足以自养，而且还能过得很舒适。无论从什么经济观点来看，这都是他们的女儿难得高攀的一门婚事。\n 两个青年人对这样一个决定并不感到惊奇。他们只是伤心，遗莫兰夫妇就从不追问。他们心肠太软，不会逼着女儿作出任何许诺。当时，他们明知凯瑟琳常常有信，但是每次来信的时候，他们总要把脸扭开。\n 在如此恩爱弥笃的情况下，亨利和凯瑟琳对他们的最终喜事一定心急如火，凡是爱他们的人也一定十分着急。但是，这种焦虑恐怕不会传染到读者们的心里，诸位一看故事给压缩得只剩这么几页了，就明白我们正在一起向着皆大欢喜的目标迈进。唯一的疑问就是：他们如何才能早日结婚？将军那样的脾气，什么情况才能让他回心转意？原来，促成两个青年人结合的，主要是这样一件事：那年夏天，将军的女儿嫁给了一个有钱有势的男人。将军遇上这光耀门庭的喜事，顿时变得兴高采烈起来，埃丽诺不等他恢复常态，便趁机求他宽恕了亨利，批准他\"爱做傻瓜就尽管去做吧\"。\n 自从亨利被赶出去以后，诺桑觉寺这个家变得越发不幸，埃丽诺·蒂尔尼结了婚，离开了这个不幸的家庭，去到自己心爱的家和心爱的人儿那里，我想这件事一定会使所有认识她的人都感到满意。我自己也感到由衷的高兴。埃丽诺朴实贤惠，理应得到幸福；而她长期忍受痛苦，一旦获得幸福，自然会无比快乐。她对这位先生的钟爱不是最近才开始的，那位先生仅仅因为身世卑微，所以一直没敢向她求婚。后来他意想不到地承袭了爵位和财产，一切困难便迎刃而解。将军第一次尊称女儿\"子爵夫人\"时，心里对她真是宠爱极了。埃丽诺长年陪伴父亲，替他做这做那，耐心地忍受着，还从来没有叫他如此喜爱过。她丈夫的确值得她钟爱，且不说他的爵位、财产和一片钟情，他本人还是个天下最最可爱的青年。他的优点长处就不必一一叙说了，一说他是个天下最最可爱的青年，我们大家就能立即想象到他是个怎样的人。关于这位先生，我只准备再说一件事（我知道，作文规则不准许我把一个与本书无关的人物牵扯进来），这位先生在诺桑觉寺住过很久，那一卷洗衣单子就是他那个马虎的仆人丢下的，结果害得我的女主角卷入了一场最可怕的冒险行动。\n 子爵和子爵夫人替亨利斡旋的时候，将军对莫兰先生家境的正确了解的确帮了很大的忙。原来，一俟将军能听得进话，他们立刻把莫兰家的境况告诉了他。他这才明白自己两次都受了索普的骗，那家伙先是夸大了索普家的财产，后来又恶毒地把自己的话一齐推翻。其实，莫兰家一点也不贫困，凯瑟琳还有三千镑的嫁妆。这件事大大改善了他近来的看法，使得他那受到伤害的自尊心得到莫大的宽慰。他私下好不容易才打听到，富勒顿的产业全归目前的业主自由支配，因而很容易勾起某些人的凯觑之心；这个消息对他也绝非没有影响。\n 因此，就在埃丽诺结婚后不久，将军把儿子叫到诺桑觉寺，让他送给莫兰先生一封许婚信，这封信措词十分谦恭，但内容却是些空空洞洞的表白。信中批准的那件事马上就操办了，亨利和凯瑟琳结了婚，教堂里响起了钟声，每个人都喜笑颜开。这两个人从初次相会到现在结婚，整整经历了十二个月，将军的残忍虽然引起了可怕的拖延，但他们似乎并没因此而受到多大损害。男方二十六，女方十八，在这样的年龄结成美满家庭，真是幸福无比。另外，我还相信，将军的无理阻挠决没有真正损害他们的幸福，或许还大大促成了他们的幸福，增进了他们的相互了解，增加了他们的恩爱。至于本书的意图究竟是赞成父母专制，还是鼓励子女杵逆，这个间题就留给那些感兴趣的人去解决吧。\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/308/2997.html","bookId":164,"book":{"id":164,"title":"诺桑觉寺 Northanger Abbey","description":"简介： Northanger Abbey was the first of Jane Austen\u0027s novels to be completed for publication, though she had previously made a start on Sense and Sensibility and Pride and Prejudice. According to Cassandra Austen\u0027s Memorandum, Susan (as it was fi...","cover":"http://novel.tingroom.com/uploads/110519/1-110519141033231.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/308","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
