{"id":36336,"no":42,"title":"CHAPTER XLII. KILLING TIME IN A MAN-OF-WAR IN HARBOUR.","content":"Reading was by no means the only method adopted by my shipmates in whiling away the long, tedious hours in harbour. In truth, many of them could not have read, had they wanted to ever so much; in early youth their primers had been sadly neglected. Still, they had other pursuits; some were experts at the needle, and employed their time in making elaborate shirts, stitching picturesque eagles, and anchors, and all the stars of the federated states in the collars thereof; so that when they at last completed and put on these shirts, they may be said to have hoisted the American colors. Others excelled in tattooing or pricking, as it is called in a man-of-war. Of these prickers, two had long been celebrated, in their way, as consummate masters of the art. Each had a small box full of tools and colouring matter; and they charged so high for their services, that at the end of the cruise they were supposed to have cleared upward of four hundred dollars. They would prick you to order a palm-tree, or an anchor, a crucifix, a lady, a lion, an eagle, or anything else you might want. The Roman Catholic sailors on board had at least the crucifix pricked on their arms, and for this reason: If they chanced to die in a Catholic land, they would be sure of a decent burial in consecrated ground, as the priest would be sure to observe the symbol of Mother Church on their persons. They would not fare as Protestant sailors dying in Callao, who are shoved under the sands of St. Lorenzo, a solitary, volcanic island in the harbour, overrun with rep-tiles, their heretical bodies not being permitted to repose in the more genial loam of Lima. And many sailors not Catholics were anxious to have the crucifix painted on them, owing to a curious superstition of theirs. They affirm—some of them—that if you have that mark tattooed upon all four limbs, you might fall overboard among seven hundred and seventy-five thousand white sharks, all dinnerless, and not one of them would so much as dare to smell at your little finger. We had one fore-top-man on board, who, during the entire cruise, was having an endless cable pricked round and round his waist, so that, when his frock was off, he looked like a capstan with a hawser coiled round about it. This fore-top-man paid eighteen pence per link for the cable, besides being on the smart the whole cruise, suffering the effects of his repeated puncturings; so he paid very dear for his cable. One other mode of passing time while in port was cleaning and polishing your bright-work; for it must be known that, in men-of-war, every sailor has some brass or steel of one kind or other to keep in high order—like housemaids, whose business it is to keep well-polished the knobs on the front door railing and the parlour-grates. Excepting the ring-bolts, eye-bolts, and belaying-pins scattered about the decks, this bright-work, as it is called, is principally about the guns, embracing the \"monkey-tails\" of the carronades, the screws, prickers, little irons, and other things. The portion that fell to my own share I kept in superior order, quite equal in polish to Rogers\u0027s best cutlery. I received the most extravagant encomiums from the officers; one of whom offered to match me against any brazier or brass-polisher in her British Majesty\u0027s Navy. Indeed, I devoted myself to the work body and soul, and thought no pains too painful, and no labour too laborious, to achieve the highest attainable polish possible for us poor lost sons of Adam to reach. Upon one occasion, even, when woollen rags were scarce, and no burned-brick was to be had from the ship\u0027s Yeoman, I sacrificed the corners of my woollen shirt, and used some dentrifice I had, as substitutes for the rags and burned-brick. The dentrifice operated delightfully, and made the threading of my carronade screw shine and grin again, like a set of false teeth in an eager heiress-hunter\u0027s mouth. Still another mode of passing time, was arraying yourself in your best \"togs\" and promenading up and down the gun-deck, admiring the shore scenery from the port-holes, which, in an amphitheatrical bay like Rio—belted about by the most varied and charming scenery of hill, dale, moss, meadow, court, castle, tower, grove, vine, vineyard, aqueduct, palace, square, island, fort—is very much like lounging round a circular cosmorama, and ever and anon lazily peeping through the glasses here and there. Oh! there is something worth living for, even in our man-of-war world; and one glimpse of a bower of grapes, though a cable\u0027s length off, is almost satisfaction for dining off a shank-bone salted down. This promenading was chiefly patronised by the marines, and particularly by Colbrook, a remarkably handsome and very gentlemanly corporal among them. He was a complete lady\u0027s man; with fine black eyes, bright red cheeks, glossy jet whiskers, and a refined organisation of the whole man. He used to array himself in his regimentals, and saunter about like an officer of the Coldstream Guards, strolling down to his club in St. James\u0027s. Every time he passed me, he would heave a sentimental sigh, and hum to himself \"The girl I left behind me.\" This fine corporal afterward became a representative in the Legislature of the State of New Jersey; for I saw his name returned about a year after my return home. But, after all, there was not much room, while in port, for promenading, at least on the gun-deck, for the whole larboard side is kept clear for the benefit of the officers, who appreciate the advantages of having a clear stroll fore and aft; and they well know that the sailors had much better be crowded together on the other side than that the set of their own coat-tails should be impaired by brushing against their tarry trowsers. One other way of killing time while in port is playing checkers; that is, when it is permitted; for it is not every navy captain who will allow such a scandalous proceeding, But, as for Captain Claret, though he did like his glass of Madeira uncommonly well, and was an undoubted descendant from the hero of the Battle of the Brandywine, and though he sometimes showed a suspiciously flushed face when superintending in person the flogging of a sailor for getting intoxicated against his particular orders, yet I will say for Captain Claret that, upon the whole, he was rather indulgent to his crew, so long as they were perfectly docile. He allowed them to play checkers as much as they pleased. More than once I have known him, when going forward to the forecastle, pick his way carefully among scores of canvas checker-cloths spread upon the deck, so as not to tread upon the men—the checker-men and man-of-war\u0027s-men included; but, in a certain sense, they were both one; for, as the sailors used their checker-men, so, at quarters, their officers used these man-of-war\u0027s men. But Captain Claret\u0027s leniency in permitting checkers on board his ship might have arisen from the following little circumstance, confidentially communicated to me. Soon after the ship had sailed from home, checkers were prohibited; whereupon the sailors were exasperated against the Captain, and one night, when he was walking round the forecastle, bim! came an iron belaying-pin past his ears; and while he was dodging that, bim! came another, from the other side; so that, it being a very dark night, and nobody to be seen, and it being impossible to find out the trespassers, he thought it best to get back into his cabin as soon as possible. Some time after—just as if the belaying-pins had nothing to do with it—it was indirectly rumoured that the checker-boards might be brought out again, which—as a philosophical shipmate observed—showed that Captain Claret was a man of a ready understanding, and could understand a hint as well as any other man, even when conveyed by several pounds of iron. Some of the sailors were very precise about their checker-cloths, and even went so far that they would not let you play with them unless you first washed your hands, especially if so be you had just come from tarring down the rigging. Another way of beguiling the tedious hours, is to get a cosy seat somewhere, and fall into as snug a little reverie as you can. Or if a seat is not to be had—which is frequently the case—then get a tolerably comfortable stand-up against the bulwarks, and begin to think about home and bread and butter—always inseparably connected to a wanderer—which will very soon bring delicious tears into your eyes; for every one knows what a luxury is grief, when you can get a private closet to enjoy it in, and no Paul Prys intrude. Several of my shore friends, indeed, when suddenly overwhelmed by some disaster, always make a point of flying to the first oyster-cellar, and shutting themselves up in a box with nothing but a plate of stewed oysters, some crackers, the castor, and a decanter of old port. Still another way of killing time in harbour, is to lean over the bulwarks, and speculate upon where, under the sun, you are going to be that day next year, which is a subject full of interest to every living soul; so much so, that there is a particular day of a particular month of the year, which, from my earliest recollections, I have always kept the run of, so that I can even now tell just where I was on that identical day of every year past since I was twelve years old. And, when I am all alone, to run over this almanac in my mind is almost as entertaining as to read your own diary, and far more interesting than to peruse a table of logarithms on a rainy afternoon. I always keep the anniversary of that day with lamb and peas, and a pint of sherry, for it comes in Spring. But when it came round in the Neversink, I could get neither lamb, peas, nor sherry. But perhaps the best way to drive the hours before you four-in-hand, is to select a soft plank on the gun-deck, and go to sleep. A fine specific, which seldom fails, unless, to be sure, you have been sleeping all the twenty-four hours beforehand. Whenever employed in killing time in harbour, I have lifted myself up on my elbow and looked around me, and seen so many of my shipmates all employed at the same common business; all under lock and key; all hopeless prisoners like myself; all under martial law; all dieting on salt beef and biscuit; all in one uniform; all yawning, gaping, and stretching in concert, it was then that I used to feel a certain love and affection for them, grounded, doubtless, on a fellow-feeling. And though, in a previous part of this narrative, I have mentioned that I used to hold myself somewhat aloof from the mass of seamen on board the Neversink; and though this was true, and my real acquaintances were comparatively few, and my intimates still fewer, yet, to tell the truth, it is quite impossible to live so long with five hundred of your fellow-beings, even if not of the best families in the land, and with morals that would not be spoiled by further cultivation; it is quite impossible, I say, to live with five hundred of your fellow-beings, be they who they may, without feeling a common sympathy with them at the time, and ever after cherishing some sort of interest in their welfare. The truth of this was curiously corroborated by a rather equivocal acquaintance of mine, who, among the men, went by the name of \"Shakings.\" He belonged to the fore-hold, whence, of a dark night, he would sometimes emerge to chat with the sailors on deck. I never liked the man\u0027s looks; I protest it was a mere accident that gave me the honour of his acquaintance, and generally I did my best to avoid him, when he would come skulking, like a jail-bird, out of his den into the liberal, open air of the sky. Nevertheless, the anecdote this holder told me is well worth preserving, more especially the extraordinary frankness evinced in his narrating such a thing to a comparative stranger. The substance of his story was as follows: Shakings, it seems, had once been a convict in the New York State\u0027s Prison at Sing Sing, where he had been for years confined for a crime, which he gave me his solemn word of honour he was wholly innocent of. He told me that, after his term had expired, and he went out into the world again, he never could stumble upon any of his old Sing Sing associates without dropping into a public house and talking over old times. And when fortune would go hard with him, and he felt out of sorts, and incensed at matters and things in general, he told me that, at such time, he almost wished he was back again in Sing Sing, where he was relieved from all anxieties about what he should eat and drink, and was supported, like the President of the United States and Prince Albert, at the public charge. He used to have such a snug little cell, he said, all to himself, and never felt afraid of house-breakers, for the walls were uncommonly thick, and his door was securely bolted for him, and a watchman was all the time walking up and down in the passage, while he himself was fast asleep and dreaming. To this, in substance, the holder added, that he narrated this anecdote because he thought it applicable to a man-of-war, which he scandalously asserted to be a sort of State Prison afloat. Concerning the curious disposition to fraternise and be sociable, which this Shakings mentioned as characteristic of the convicts liberated from his old homestead at Sing Sing, it may well be asked, whether it may not prove to be some feeling, somehow akin to the reminiscent impulses which influenced them, that shall hereafter fraternally reunite all us mortals, when we shall have exchanged this State\u0027s Prison man-of-war world of ours for another and a better. From the foregoing account of the great difficulty we had in killing time while in port, it must not be inferred that on board of the Neversink in Rio there was literally no work to be done, at long intervals the launch would come alongside with water-casks, to be emptied into iron tanks in the hold. In this way nearly fifty thousand gallons, as chronicled in the books of the master\u0027s mate, were decanted into the ship\u0027s bowels—a ninety day\u0027s allowance. With this huge Lake Ontario in us, the mighty Neversink might be said to resemble the united continent of the Eastern Hemisphere—floating in a vast ocean herself, and having a Mediterranean floating in her. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2831/78203.html","bookId":1240,"book":{"id":1240,"title":"White Jacket or, the World on a Man-of-War","description":"简介： When our frigate lay in Callao, on the coast of Peruher last harbour in the PacificI found myself without a grego, or sailor\u0027s surtout; and as, toward the end of a three years\u0027 cruise, no pea-jackets could be had from the purser\u0027s steward: and being...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2831","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
