{"id":36341,"no":47,"title":"CHAPTER XLVII. AN AUCTION IN A MAN-OF-WAR.","content":"Some allusion has been made to the weariness experienced by the man-of-war\u0027s-men while lying at anchor; but there are scenes now and then that serve to relieve it. Chief among these are the Purser\u0027s auctions, taking place while in harbour. Some weeks, or perhaps months, after a sailor dies in an armed vessel, his bag of clothes is in this manner sold, and the proceeds transferred to the account of his heirs or executors. One of these auctions came off in Rio, shortly after the sad accident of Baldy. It was a dreamy, quiet afternoon, and the crew were listlessly lying \u0027around, when suddenly the Boatswain\u0027s whistle was heard, followed by the announcement, \"D\u0027ye hear there, fore and aft? Purser\u0027s auction on the spar-deck!\" At the sound, the sailors sprang to their feet and mustered round the main-mast. Presently up came the Purser\u0027s steward, marshalling before him three or four of his subordinates, carrying several clothes\u0027 bags, which were deposited at the base of the mast. Our Purser\u0027s steward was a rather gentlemanly man in his way. Like many young Americans of his class, he had at various times assumed the most opposite functions for a livelihood, turning from one to the other with all the facility of a light-hearted, clever adventurer. He had been a clerk in a steamer on the Mississippi River; an auctioneer in Ohio; a stock actor at the Olympic Theatre in New York; and now he was Purser\u0027s steward in the Navy. In the course of this deversified career his natural wit and waggery had been highly spiced, and every way improved; and he had acquired the last and most difficult art of the joker, the art of lengthening his own face while widening those of his hearers, preserving the utmost solemnity while setting them all in a roar. He was quite a favourite with the sailors, which, in a good degree, was owing to his humour; but likewise to his off-hand, irresistible, romantic, theatrical manner of addressing them. With a dignified air, he now mounted the pedestal of the main-top-sail sheet-bitts, imposing silence by a theatrical wave of his hand; meantime, his subordinates were rummaging the bags, and assorting their contents before him. \"Now, my noble hearties,\" he began, \"we will open this auction by offering to your impartial competition a very superior pair of old boots;\" and so saying, he dangled aloft one clumsy cowhide cylinder, almost as large as a fire bucket, as a specimen of the complete pair. \"What shall I have now, my noble tars, for this superior pair of sea-boots?\" \"Where\u0027s t\u0027other boot?\" cried a suspicious-eyed waister. \"I remember them \u0027ere boots. They were old Bob\u0027s the quarter-gunner\u0027s; there was two on \u0027em, too. I want to see t\u0027other boot.\" \"My sweet and pleasant fellow,\" said the auctioneer, with his blandest accents, \"the other boot is not just at hand, but I give you my word of honour that it in all respects cor-responds to the one you here see—it does, I assure you. And I solemnly guarantee, my noble sea-faring fencibles,\" he added, turning round upon all, \"that the other boot is the exact counterpart of this. Now, then, say the word, my fine fellows. What shall I have? Ten dollars, did you say?\" politely bowing toward some indefinite person in the background. \"No; ten cents,\" responded a voice. \"Ten cents! ten cents! gallant sailors, for this noble pair of boots,\" exclaimed the auctioneer, with affected horror; \"I must close the auction, my tars of Columbia; this will never do. But let\u0027s have another bid; now, come,\" he added, coaxingly and soothingly. \"What is it? One dollar, one dollar then—one dollar; going at one dollar; going, going—going. Just see how it vibrates\"—swinging the boot to and fro—\"this superior pair of sea-boots vibrating at one dollar; wouldn\u0027t pay for the nails in their heels; going, going—gone!\" And down went the boots. \"Ah, what a sacrifice! what a sacrifice!\" he sighed, tearfully eyeing the solitary fire-bucket, and then glancing round the company for sympathy. \"A sacrifice, indeed!\" exclaimed Jack Chase, who stood by; \"Purser\u0027s Steward, you are Mark Antony over the body of Julius Cesar.\" \"So I am, so I am,\" said the auctioneer, without moving a muscle. \"And look!\" he exclaimed, suddenly seizing the boot, and exhibiting it on high, \"look, my noble tars, if you have tears, prepare to shed them now. You all do know this boot. I remember the first time ever old Bob put it on. \u0027Twas on a winter evening, off Cape Horn, between the starboard carronades—that day his precious grog was stopped. Look! in this place a mouse has nibbled through; see what a rent some envious rat has made, through this another filed, and, as he plucked his cursed rasp away, mark how the bootleg gaped. This was the unkindest cut of all. But whose are the boots?\" suddenly assuming a business-like air; \"yours? yours? yours?\" But not a friend of the lamented Bob stood by. \"Tars of Columbia,\" said the auctioneer, imperatively, \"these boots must be sold; and if I can\u0027t sell them one way, I must sell them another. How much a pound, now, for this superior pair of old boots? going by the pound now, remember, my gallant sailors! what shall I have? one cent, do I hear? going now at one cent a pound—going—going—going—gone!\" \"Whose are they? Yours, Captain of the Waist? Well, my sweet and pleasant friend, I will have them weighed out to you when the auction is over.\" In like manner all the contents of the bags were disposed of, embracing old frocks, trowsers, and jackets, the various sums for which they went being charged to the bidders on the books of the Purser. Having been present at this auction, though not a purchaser, and seeing with what facility the most dismantled old garments went off, through the magical cleverness of the accomplished auctioneer, the thought occurred to me, that if ever I calmly and positively decided to dispose of my famous white jacket, this would be the very way to do it. I turned the matter over in my mind a long time. The weather in Rio was genial and warm, and that I would ever again need such a thing as a heavy quilted jacket—and such a jacket as the white one, too—seemed almost impossible. Yet I remembered the American coast, and that it would probably be Autumn when we should arrive there. Yes, I thought of all that, to be sure; nevertheless, the ungovernable whim seized me to sacrifice my jacket and recklessly abide the consequences. Besides, was it not a horrible jacket? To how many annoyances had it subjected me? How many scrapes had it dragged me into? Nay, had it not once jeopardised my very existence? And I had a dreadful presentiment that, if I persisted in retaining it, it would do so again. Enough! I will sell it, I muttered; and so muttering, I thrust my hands further down in my waistband, and walked the main-top in the stern concentration of an inflexible purpose. Next day, hearing that another auction was shortly to take place, I repaired to the office of the Purser\u0027s steward, with whom I was upon rather friendly terms. After vaguely and delicately hinting at the object of my visit, I came roundly to the point, and asked him whether he could slip my jacket into one of the bags of clothes next to be sold, and so dispose of it by public auction. He kindly acquiesced and the thing was done. In due time all hands were again summoned round the main-mast; the Purser\u0027s steward mounted his post, and the ceremony began. Meantime, I lingered out of sight, but still within hearing, on the gun-deck below, gazing up, un-perceived, at the scene. As it is now so long ago, I will here frankly make confession that I had privately retained the services of a friend—Williams, the Yankee pedagogue and peddler—whose business it would be to linger near the scene of the auction, and, if the bids on the jacket loitered, to start it roundly himself; and if the bidding then became brisk, he was continually to strike in with the most pertinacious and infatuated bids, and so exasperate competition into the maddest and most extravagant overtures. A variety of other articles having been put up, the white jacket was slowly produced, and, held high aloft between the auctioneer\u0027s thumb and fore-finger, was submitted to the inspection of the discriminating public. Here it behooves me once again to describe my jacket; for, as a portrait taken at one period of life will not answer for a later stage; much more this jacket of mine, undergoing so many changes, needs to be painted again and again, in order truly to present its actual appearance at any given period. A premature old age had now settled upon it; all over it bore melancholy sears of the masoned-up pockets that had once trenched it in various directions. Some parts of it were slightly mildewed from dampness; on one side several of the buttons were gone, and others were broken or cracked; while, alas! my many mad endeavours to rub it black on the decks had now imparted to the whole garment an exceedingly untidy appearance. Such as it was, with all its faults, the auctioneer displayed it. \"You, venerable sheet-anchor-men! and you, gallant fore-top-men! and you, my fine waisters! what do you say now for this superior old jacket? Buttons and sleeves, lining and skirts, it must this day be sold without reservation. How much for it, my gallant tars of Columbia? say the word, and how much?\" \"My eyes!\" exclaimed a fore-top-man, \"don\u0027t that \u0027ere bunch of old swabs belong to Jack Chase\u0027s pet? Aren\u0027t that the white jacket?\" \"The white jacket!\" cried fifty voices in response; \"the white jacket!\" The cry ran fore and aft the ship like a slogan, completely overwhelming the solitary voice of my private friend Williams, while all hands gazed at it with straining eyes, wondering how it came among the bags of deceased mariners. \"Ay, noble tars,\" said the auctioneer, \"you may well stare at it; you will not find another jacket like this on either side of Cape Horn, I assure you. Why, just look at it! How much, now? Give me a bid—but don\u0027t be rash; be prudent, be prudent, men; remember your Purser\u0027s accounts, and don\u0027t be betrayed into extravagant bids.\" \"Purser\u0027s Steward!\" cried Grummet, one of the quarter-gunners, slowly shifting his quid from one cheek to the other, like a ballast-stone, \"I won\u0027t bid on that \u0027ere bunch of old swabs, unless you put up ten pounds of soap with it.\" \"Don\u0027t mind that old fellow,\" said the auctioneer. \"How much for the jacket, my noble tars?\" \"Jacket;\" cried a dandy bone polisher of the gun-room. \"The sail-maker was the tailor, then. How many fathoms of canvas in it, Purser\u0027s Steward?\" \"How much for this jacket?\" reiterated the auctioneer, emphatically. \"Jacket, do you call it!\" cried a captain of the hold. \"Why not call it a white-washed man-of-war schooner? Look at the port-holes, to let in the air of cold nights.\" \"A reg\u0027lar herring-net,\" chimed in Grummet. \"Gives me the fever nagur to look at it,\" echoed a mizzen-top-man. \"Silence!\" cried the auctioneer. \"Start it now—start it, boys; anything you please, my fine fellows! it must be sold. Come, what ought I to have on it, now?\" \"Why, Purser\u0027s Steward,\" cried a waister, \"you ought to have new sleeves, a new lining, and a new body on it, afore you try to shove it off on a greenhorn.\" \"What are you, \u0027busin\u0027 that \u0027ere garment for?\" cried an old sheet-anchor-man. \"Don\u0027t you see it\u0027s a \u0027uniform mustering jacket\u0027—three buttons on one side, and none on t\u0027other?\" \"Silence!\" again cried the auctioneer. \"How much, my sea-fencibles, for this superior old jacket?\" \"Well,\" said Grummet, \"I\u0027ll take it for cleaning-rags at one cent.\" \"Oh, come, give us a bid! say something, Colombians.\" \"Well, then,\" said Grummet, all at once bursting into genuine indignation, \"if you want us to say something, then heave that bunch of old swabs overboard, say I, and show us something worth looking at.\" \"No one will give me a bid, then? Very good; here, shove it aside. Let\u0027s have something else there.\" While this scene was going forward, and my white jacket was thus being abused, how my heart swelled within me! Thrice was I on the point of rushing out of my hiding-place, and bearing it off from derision; but I lingered, still flattering myself that all would be well, and the jacket find a purchaser at last. But no, alas! there was no getting rid of it, except by rolling a forty-two-pound shot in it, and committing it to the deep. But though, in my desperation, I had once contemplated something of that sort, yet I had now become unaccountably averse to it, from certain involuntary superstitious considerations. If I sink my jacket, thought I, it will be sure to spread itself into a bed at the bottom of the sea, upon which I shall sooner or later recline, a dead man. So, unable to conjure it into the possession of another, and withheld from burying it out of sight for ever, my jacket stuck to me like the fatal shirt on Nessus. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2831/78208.html","bookId":1240,"book":{"id":1240,"title":"White Jacket or, the World on a Man-of-War","description":"简介： When our frigate lay in Callao, on the coast of Peruher last harbour in the PacificI found myself without a grego, or sailor\u0027s surtout; and as, toward the end of a three years\u0027 cruise, no pea-jackets could be had from the purser\u0027s steward: and being...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2831","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
