{"id":36344,"no":50,"title":"CHAPTER L. THE BAY OF ALL BEAUTIES.","content":"I have said that I must pass over Rio without a description; but just now such a flood of scented reminiscences steals over me, that I must needs yield and recant, as I inhale that musky air. More than one hundred and fifty miles\u0027 circuit of living green hills embosoms a translucent expanse, so gemmed in by sierras of grass, that among the Indian tribes the place was known as \"The Hidden Water.\" On all sides, in the distance, rise high conical peaks, which at sunrise and sunset burn like vast tapers; and down from the interior, through vineyards and forests, flow radiating streams, all emptying into the harbour. Talk not of Bahia de Todos os Santos—the Bay of All Saints; for though that be a glorious haven, yet Rio is the Bay of all Rivers—the Bay of all Delights—the Bay of all Beauties. From circumjacent hill-sides, untiring summer hangs perpetually in terraces of vivid verdure; and, embossed with old mosses, convent and castle nestle in valley and glen. All round, deep inlets run into the green mountain land, and, overhung with wild Highlands, more resemble Loch Katrines than Lake Lemans. And though Loch Katrine has been sung by the bonneted Scott, and Lake Leman by the coroneted Byron; yet here, in Rio, both the loch and the lake are but two wild flowers in a prospect that is almost unlimited. For, behold! far away and away, stretches the broad blue of the water, to yonder soft-swelling hills of light green, backed by the purple pinnacles and pipes of the grand Organ Mountains; fitly so called, for in thunder-time they roll cannonades down the bay, drowning the blended bass of all the cathedrals in Rio. Shout amain, exalt your voices, stamp your feet, jubilate, Organ Mountains! and roll your Te Deums round the world! What though, for more than five thousand five hundred years, this grand harbour of Rio lay hid in the hills, unknown by the Catholic Portuguese? Centuries ere Haydn performed before emperors and kings, these Organ Mountains played his Oratorio of the Creation, before the Creator himself. But nervous Haydn could not have endured that cannonading choir, since this composer of thunderbolts himself died at last through the crashing commotion of Napoleon\u0027s bombardment of Vienna. But all mountains are Organ Mountains: the Alps and the Himalayas; the Appalachian Chain, the Ural, the Andes, the Green Hills and the White. All of them play anthems forever: The Messiah, and Samson, and Israel in Egypt, and Saul, and Judas Maccabeus, and Solomon. Archipelago Rio! ere Noah on old Ararat anchored his ark, there lay anchored in you all these green, rocky isles I now see. But God did not build on you, isles! those long lines of batteries; nor did our blessed Saviour stand godfather at the christening of yon frowning fortress of Santa Cruz, though named in honour of himself, the divine Prince of Peace! Amphitheatrical Rio! in your broad expanse might be held the Resurrection and Judgment-day of the whole world\u0027s men-of-war, represented by the flag-ships of fleets—the flag-ships of the Phoenician armed galleys of Tyre and Sidon; of King Solomon\u0027s annual squadrons that sailed to Ophir; whence in after times, perhaps, sailed the Acapulco fleets of the Spaniards, with golden ingots for ballasting; the flag-ships of all the Greek and Persian craft that exchanged the war-hug at Salamis; of all the Roman and Egyptian galleys that, eagle-like, with blood-dripping prows, beaked each other at Actium; of all the Danish keels of the Vikings; of all the musquito craft of Abba Thule, king of the Pelaws, when he went to vanquish Artinsall; of all the Venetian, Genoese, and Papal fleets that came to the shock at Lepanto; of both horns of the crescent of the Spanish Armada; of the Portuguese squadron that, under the gallant Gama, chastised the Moors, and discovered the Moluccas; of all the Dutch navies red by Van Tromp, and sunk by Admiral Hawke; of the forty-seven French and Spanish sail-of-the-line that, for three months, essayed to batter down Gibraltar; of all Nelson\u0027s seventy-fours that thunder-bolted off St. Vincent\u0027s, at the Nile, Copenhagen, and Trafalgar; of all the frigate-merchantmen of the East India Company; of Perry\u0027s war-brigs, sloops, and schooners that scattered the British armament on Lake Erie; of all the Barbary corsairs captured by Bainbridge; of the war-canoes of the Polynesian kings, Tammahammaha and Pomare—ay! one and all, with Commodore Noah for their Lord High Admiral—in this abounding Bay of Rio these flag-ships might all come to anchor, and swing round in concert to the first of the flood. Rio is a small Mediterranean; and what was fabled of the entrance to that sea, in Rio is partly made true; for here, at the mouth, stands one of Hercules\u0027 Pillars, the Sugar-Loaf Mountain, one thousand feet high, inclining over a little, like the Leaning Tower of Pisa. At its base crouch, like mastiffs, the batteries of Jose and Theodosia; while opposite, you are menaced by a rock-founded fort. The channel between—the sole inlet to the bay—seems but a biscuit\u0027s toss over; you see naught of the land-locked sea within till fairly in the strait. But, then, what a sight is beheld! Diversified as the harbour of Constantinople, but a thousand-fold grander. When the Neversink swept in, word was passed, \"Aloft, top-men! and furl t\u0027-gallant-sails and royals!\" At the sound I sprang into the rigging, and was soon at my perch. How I hung over that main-royal-yard in a rapture High in air, poised over that magnificent bay, a new world to my ravished eyes, I felt like the foremost of a flight of angels, new-lighted upon earth, from some star in the Milky Way. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2831/78211.html","bookId":1240,"book":{"id":1240,"title":"White Jacket or, the World on a Man-of-War","description":"简介： When our frigate lay in Callao, on the coast of Peruher last harbour in the PacificI found myself without a grego, or sailor\u0027s surtout; and as, toward the end of a three years\u0027 cruise, no pea-jackets could be had from the purser\u0027s steward: and being...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2831","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
