{"id":36358,"no":64,"title":"CHAPTER LXIV. MAN-OF-WAR TROPHIES.","content":"When the second cutter pulled about among the ships, dropping the surgeons aboard the American men-of-war here and there—as a pilot-boat distributes her pilots at the mouth of the harbour—she passed several foreign frigates, two of which, an Englishman and a Frenchman, had excited not a little remark on board the Neversink. These vessels often loosed their sails and exercised yards simultaneously with ourselves, as if desirous of comparing the respective efficiency of the crews. When we were nearly ready for sea, the English frigate, weighing her anchor, made all sail with the sea-breeze, and began showing off her paces by gliding about among all the men-of-war in harbour, and particularly by running down under the Neversink\u0027s stern. Every time she drew near, we complimented her by lowering our ensign a little, and invariably she courteously returned the salute. She was inviting us to a sailing-match; and it was rumoured that, when we should leave the bay, our Captain would have no objections to gratify her; for, be it known, the Neversink was accounted the fleetest keeled craft sailing under the American long-pennant. Perhaps this was the reason why the stranger challenged us. It may have been that a portion of our crew were the more anxious to race with this frigate, from a little circumstance which a few of them deemed rather galling. Not many cables\u0027-length distant from our Commodore\u0027s cabin lay the frigate President, with the red cross of St. George flying from her peak. As its name imported, this fine craft was an American born; but having been captured during the last war with Britain, she now sailed the salt seas as a trophy. Think of it, my gallant countrymen, one and all, down the sea-coast and along the endless banks of the Ohio and Columbia—think of the twinges we sea-patriots must have felt to behold the live-oak of the Floridas and the pines of green Maine built into the oaken walls of Old England! But, to some of the sailors, there was a counterbalancing thought, as grateful as the other was galling, and that was, that somewhere, sailing under the stars and stripes, was the frigate Macedonian, a British-born craft which had once sported the battle-banner of Britain. It has ever been the custom to spend almost any amount of money in repairing a captured vessel, in order that she may long survive to commemorate the heroism of the conqueror. Thus, in the English Navy, there are many Monsieurs of seventy-fours won from the Gaul. But we Americans can show but few similar trophies, though, no doubt, we would much like to be able so to do. But I never have beheld any of thee floating trophies without being reminded of a scene once witnessed in a pioneer village on the western bank of the Mississippi. Not far from this village, where the stumps of aboriginal trees yet stand in the market-place, some years ago lived a portion of the remnant tribes of the Sioux Indians, who frequently visited the white settlements to purchase trinkets and cloths. One florid crimson evening in July, when the red-hot sun was going down in a blaze, and I was leaning against a corner in my huntsman\u0027s frock, lo! there came stalking out of the crimson West a gigantic red-man, erect as a pine, with his glittering tomahawk, big as a broad-ax, folded in martial repose across his chest, Moodily wrapped in his blanket, and striding like a king on the stage, he promenaded up and down the rustic streets, exhibiting on the back of his blanket a crowd of human hands, rudely delineated in red; one of them seemed recently drawn. \"Who is this warrior?\" asked I; \"and why marches he here? and for what are these bloody hands?\" \"That warrior is the Red-Hot Coal,\" said a pioneer in moccasins, by my side. \"He marches here to show-off his last trophy; every one of those hands attests a foe scalped by his tomahawk; and he has just emerged from Ben Brown\u0027s, the painter, who has sketched the last red hand that you see; for last night this Red-Hot Coal outburned the Yellow Torch, the chief of a band of the Foxes.\" Poor savage thought I; and is this the cause of your lofty gait? Do you straighten yourself to think that you have committed a murder, when a chance-falling stone has often done the same? Is it a proud thing to topple down six feet perpendicular of immortal manhood, though that lofty living tower needed perhaps thirty good growing summers to bring it to maturity? Poor savage! And you account it so glorious, do you, to mutilate and destroy what God himself was more than a quarter of a century in building? And yet, fellow-Christians, what is the American frigate Macedonian, or the English frigate President, but as two bloody red hands painted on this poor savage\u0027s blanket? Are there no Moravians in the Moon, that not a missionary has yet visited this poor pagan planet of ours, to civilise civilisation and christianise Christendom?","sourceLink":"http://novel.tingroom.com/duanpian/2831/78225.html","bookId":1240,"book":{"id":1240,"title":"White Jacket or, the World on a Man-of-War","description":"简介： When our frigate lay in Callao, on the coast of Peruher last harbour in the PacificI found myself without a grego, or sailor\u0027s surtout; and as, toward the end of a three years\u0027 cruise, no pea-jackets could be had from the purser\u0027s steward: and being...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2831","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
