{"id":36359,"no":65,"title":"CHAPTER LXV. A MAN-OF-WAR RACE.","content":"We lay in Rio so long—for what reason the Commodore only knows—that a saying went abroad among the impatient sailors that our frigate would at last ground on the beef-bones daily thrown overboard by the cooks. But at last good tidings came. \"All hands up anchor, ahoy!\" And bright and early in the morning up came our old iron, as the sun rose in the East. The land-breezes at Rio—by which alone vessels may emerge from the bay—is ever languid and faint. It comes from gardens of citrons and cloves, spiced with all the spices of the Tropic of Capricorn. And, like that old exquisite, Mohammed, who so much loved to snuff perfumes and essences, and used to lounge out of the conservatories of Khadija, his wife, to give battle to the robust sons of Koriesh; even so this Rio land-breeze comes jaded with sweet-smelling savours, to wrestle with the wild Tartar breezes of the sea. Slowly we dropped and dropped down the bay, glided like a stately swan through the outlet, and were gradually rolled by the smooth, sliding billows broad out upon the deep. Straight in our wake came the tall main-mast of the English fighting-frigate, terminating, like a steepled cathedral, in the bannered cross of the religion of peace; and straight after her came the rainbow banner of France, sporting God\u0027s token that no more would he make war on the earth. Both Englishmen and Frenchmen were resolved upon a race; and we Yankees swore by our top-sails and royals to sink their blazing banners that night among the Southern constellations we should daily be extinguishing behind us in our run to the North. \"Ay,\" said Mad Jack, \"St. George\u0027s banner shall be as the Southern Cross, out of sight, leagues down the horizon, while our gallant stars, my brave boys, shall burn all alone in the North, like the Great Bear at the Pole! Come on, Rainbow and Cross!\" But the wind was long languid and faint, not yet recovered from its night\u0027s dissipation ashore, and noon advanced, with the Sugar-Loaf pinnacle in sight. Now it is not with ships as with horses; for though, if a horse walk well and fast, it generally furnishes good token that he is not bad at a gallop, yet the ship that in a light breeze is outstripped, may sweep the stakes, so soon as a t\u0027gallant breeze enables her to strike into a canter. Thus fared it with us. First, the Englishman glided ahead, and bluffly passed on; then the Frenchman politely bade us adieu, while the old Neversink lingered behind, railing at the effeminate breeze. At one time, all three frigates were irregularly abreast, forming a diagonal line; and so near were all three, that the stately officers on the poops stiffly saluted by touching their caps, though refraining from any further civilities. At this juncture, it was a noble sight to behold those fine frigates, with dripping breast-hooks, all rearing and nodding in concert, and to look through their tall spars and wilderness of rigging, that seemed like inextricably-entangled, gigantic cobwebs against the sky. Toward sundown the ocean pawed its white hoofs to the spur of its helter-skelter rider, a strong blast from the Eastward, and, giving three cheers from decks, yards, and tops, we crowded all sail on St. George and St. Denis. But it is harder to overtake than outstrip; night fell upon us, still in the rear—still where the little boat was, which, at the eleventh hour, according to a Rabbinical tradition, pushed after the ark of old Noah. It was a misty, cloudy night; and though at first our look-outs kept the chase in dim sight, yet at last so thick became the atmosphere, that no sign of a strange spar was to be seen. But the worst of it was that, when last discerned, the Frenchman was broad on our weather-bow, and the Englishman gallantly leading his van. The breeze blew fresher and fresher; but, with even our main-royal set, we dashed along through a cream-coloured ocean of illuminated foam. White-Jacket was then in the top; and it was glorious to look down and see our black hull butting the white sea with its broad bows like a ram. \"We must beat them with such a breeze, dear Jack,\" said I to our noble Captain of the Top. \"But the same breeze blows for John Bull, remember,\" replied Jack, who, being a Briton, perhaps favoured the Englishman more than the Neversink. \"But how we boom through the billows!\" cried Jack, gazing over the top-rail; then, flinging forth his arm, recited, \"\u0027Aslope, and gliding on the leeward side, The bounding vessel cuts the roaring tide.\u0027 Camoens! White-Jacket, Camoens! Did you ever read him? The Lusiad, I mean? It\u0027s the man-of-war epic of the world, my lad. Give me Gama for a Commodore, say I—Noble Gama! And Mickle, White-Jacket, did you ever read of him? William Julius Mickle? Camoens\u0027s Translator? A disappointed man though, White-Jacket. Besides his version of the Lusiad, he wrote many forgotten things. Did you ever see his ballad of Cumnor Hall?—No?—Why, it gave Sir Walter Scott the hint of Kenilworth. My father knew Mickle when he went to sea on board the old Romney man-of-war. How many great men have been sailors, White-Jacket! They say Homer himself was once a tar, even as his hero, Ulysses, was both a sailor and a shipwright. I\u0027ll swear Shakspeare was once a captain of the forecastle. Do you mind the first scene in The Tempest, White-Jacket? And the world-finder, Christopher Columbus, was a sailor! and so was Camoens, who went to sea with Gama, else we had never had the Lusiad, White-Jacket. Yes, I\u0027ve sailed over the very track that Camoens sailed—round the East Cape into the Indian Ocean. I\u0027ve been in Don Jose\u0027s garden, too, in Macao, and bathed my feet in the blessed dew of the walks where Camoens wandered before me. Yes, White-Jacket, and I have seen and sat in the cave at the end of the flowery, winding way, where Camoens, according to tradition, composed certain parts of his Lusiad. Ay, Camoens was a sailor once! Then, there\u0027s Falconer, whose \u0027Ship-wreck\u0027 will never founder, though he himself, poor fellow, was lost at sea in the Aurora frigate. Old Noah was the first sailor. And St. Paul, too, knew how to box the compass, my lad! mind you that chapter in Acts? I couldn\u0027t spin the yarn better myself. Were you ever in Malta? They called it Melita in the Apostle\u0027s day. I have been in Paul\u0027s cave there, White-Jacket. They say a piece of it is good for a charm against shipwreck; but I never tried it. There\u0027s Shelley, he was quite a sailor. Shelley—poor lad! a Percy, too—but they ought to have let him sleep in his sailor\u0027s grave—he was drowned in the Mediterranean, you know, near Leghorn—and not burn his body, as they did, as if he had been a bloody Turk. But many people thought him so, White-Jacket, because he didn\u0027t go to mass, and because he wrote Queen Mab. Trelawney was by at the burning; and he was an ocean-rover, too! Ay, and Byron helped put a piece of a keel on the fire; for it was made of bits of a wreck, they say; one wreck burning another! And was not Byron a sailor? an amateur forecastle-man, White-Jacket, so he was; else how bid the ocean heave and fall in that grand, majestic way? I say, White-Jacket, d\u0027ye mind me? there never was a very great man yet who spent all his life inland. A snuff of the sea, my boy, is inspiration; and having been once out of sight of land, has been the making of many a true poet and the blasting of many pretenders; for, d\u0027ye see, there\u0027s no gammon about the ocean; it knocks the false keel right off a pretender\u0027s bows; it tells him just what he is, and makes him feel it, too. A sailor\u0027s life, I say, is the thing to bring us mortals out. What does the blessed Bible say? Don\u0027t it say that we main-top-men alone see the marvellous sights and wonders? Don\u0027t deny the blessed Bible, now! don\u0027t do it! How it rocks up here, my boy!\" holding on to a shroud; \"but it only proves what I\u0027ve been saying—the sea is the place to cradle genius! Heave and fall, old sea!\" \"And you, also, noble Jack,\" said I, \"what are you but a sailor?\" \"You\u0027re merry, my boy,\" said Jack, looking up with a glance like that of a sentimental archangel doomed to drag out his eternity in disgrace. \"But mind you, White-Jacket, there are many great men in the world besides Commodores and Captains. I\u0027ve that here, White-Jacket\"—touching his forehead—\"which, under happier skies—perhaps in you solitary star there, peeping down from those clouds—might have made a Homer of me. But Fate is Fate, White-Jacket; and we Homers who happen to be captains of tops must write our odes in our hearts, and publish them in our heads. But look! the Captain\u0027s on the poop.\" It was now midnight; but all the officers were on deck. \"Jib-boom, there!\" cried the Lieutenant of the Watch, going forward and hailing the headmost look-out. \"D\u0027ye see anything of those fellows now?\" \"See nothing, sir.\" \"See nothing, sir,\" said the Lieutenant, approaching the Captain, and touching his cap. \"Call all hands!\" roared the Captain. \"This keel sha\u0027n\u0027t be beat while I stride it.\" All hands were called, and the hammocks stowed in the nettings for the rest of the night, so that no one could lie between blankets. Now, in order to explain the means adopted by the Captain to insure us the race, it needs to be said of the Neversink, that, for some years after being launched, she was accounted one of the slowest vessels in the American Navy. But it chanced upon a time, that, being on a cruise in the Mediterranean, she happened to sail out of Port Mahon in what was then supposed to be very bad trim for the sea. Her bows were rooting in the water, and her stern kicking up its heels in the air. But, wonderful to tell, it was soon discovered that in this comical posture she sailed like a shooting-star; she outstripped every vessel on the station. Thenceforward all her Captains, on all cruises, trimmed her by the head; and the Neversink gained the name of a clipper. To return. All hands being called, they were now made use of by Captain Claret as make-weights, to trim the ship, scientifically, to her most approved bearings. Some were sent forward on the spar-deck, with twenty-four-pound shot in their hands, and were judiciously scattered about here and there, with strict orders not to budge an inch from their stations, for fear of marring the Captain\u0027s plans. Others were distributed along the gun and berth-decks, with similar orders; and, to crown all, several carronade guns were unshipped from their carriages, and swung in their breechings from the beams of the main-deck, so as to impart a sort of vibratory briskness and oscillating buoyancy to the frigate. And thus we five hundred make-weights stood out that whole night, some of us exposed to a drenching rain, in order that the Neversink might not be beaten. But the comfort and consolation of all make-weights is as dust in the balance in the estimation of the rulers of our man-of-war world. The long, anxious night at last came to an end, and, with the first peep of day, the look-out on the jib-boom was hailed; but nothing was in sight. At last it was broad day; yet still not a bow was to be seen in our rear, nor a stern in our van. \"Where are they?\" cried the Captain. \"Out of sight, astern, to be sure, sir,\" said the officer of the deck. \"Out of sight, ahead, to be sure, sir,\" muttered Jack Chase, in the top. Precisely thus stood the question: whether we beat them, or whether they beat us, no mortal can tell to this hour, since we never saw them again; but for one, White-Jacket will lay his two hands on the bow chasers of the Neversink, and take his ship\u0027s oath that we Yankees carried the day. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2831/78226.html","bookId":1240,"book":{"id":1240,"title":"White Jacket or, the World on a Man-of-War","description":"简介： When our frigate lay in Callao, on the coast of Peruher last harbour in the PacificI found myself without a grego, or sailor\u0027s surtout; and as, toward the end of a three years\u0027 cruise, no pea-jackets could be had from the purser\u0027s steward: and being...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2831","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
