{"id":36368,"no":74,"title":"CHAPTER LXXIV. THE MAIN-TOP AT NIGHT.","content":"The whole of our run from Rio to the Line was one delightful yachting, so far as fine weather and the ship\u0027s sailing were concerned. It was especially pleasant when our quarter-watch lounged in the main-top, diverting ourselves in many agreeable ways. Removed from the immediate presence of the officers, we there harmlessly enjoyed ourselves, more than in any other part of the ship. By day, many of us were very industrious, making hats or mending our clothes. But by night we became more romantically inclined. Often Jack Chase, an enthusiastic admirer of sea-scenery, would direct our attention to the moonlight on the waves, by fine snatches from his catalogue of poets. I shall never forget the lyric air with which, one morning, at dawn of day, when all the East was flushed with red and gold, he stood leaning against the top-mast shrouds, and stretching his bold hand over the sea, exclaimed, \"Here comes Aurora: top-mates, see!\" And, in a liquid, long-lingering tone, he recited the lines, \"With gentle hand, as seeming oft to pause, The purple curtains of the morn she draws.\" \"Commodore Camoens, White-Jacket.—But bear a hand there; we must rig out that stun\u0027-sail boom—the wind is shifting.\" From our lofty perch, of a moonlight night, the frigate itself was a glorious sight. She was going large before the wind, her stun\u0027-sails set on both sides, so that the canvas on the main-mast and fore-mast presented the appearance of majestic, tapering pyramids, more than a hundred feet broad at the base, and terminating in the clouds with the light copestone of the royals. That immense area of snow-white canvas sliding along the sea was indeed a magnificent spectacle. The three shrouded masts looked like the apparitions of three gigantic Turkish Emirs striding over the ocean. Nor, at times, was the sound of music wanting, to augment the poetry of the scene. The whole band would be assembled on the poop, regaling the officers, and incidentally ourselves, with their fine old airs. To these, some of us would occasionally dance in the top, which was almost as large as an ordinary sized parlour. When the instrumental melody of the band was not to be had, our nightingales mustered their voices, and gave us a song. Upon these occasions Jack Chase was often called out, and regaled us, in his own free and noble style, with the \"Spanish Ladies\"—a favourite thing with British man-of-war\u0027s-men—and many other salt-sea ballads and ditties, including, \"Sir Patrick Spens was the best sailor That ever sailed the sea.\" also, \"And three times around spun our gallant ship; Three times around spun she; Three times around spun our gallant ship, And she went to the bottom of the sea— The sea, the sea, the sea, And she went to the bottom of the sea!\" These songs would be varied by sundry yarns and twisters of the top-men. And it was at these times that I always endeavoured to draw out the oldest Tritons into narratives of the war-service they had seen. There were but few of them, it is true, who had been in action; but that only made their narratives the more valuable. There was an old negro, who went by the name of Tawney, a sheet-anchor-man, whom we often invited into our top of tranquil nights, to hear him discourse. He was a staid and sober seaman, very intelligent, with a fine, frank bearing, one of the best men in the ship, and held in high estimation by every one. It seems that, during the last war between England and America, he had, with several others, been \"impressed\" upon the high seas, out of a New England merchantman. The ship that impressed him was an English frigate, the Macedonian, afterward taken by the Neversink, the ship in which we were sailing. It was the holy Sabbath, according to Tawney, and, as the Briton bore down on the American—her men at their quarters—Tawney and his countrymen, who happened to be stationed at the quarter-deck battery, respectfully accosted the captain—an old man by the name of Cardan—as he passed them, in his rapid promenade, his spy-glass under his arm. Again they assured him that they were not Englishmen, and that it was a most bitter thing to lift their hands against the flag of that country which harboured the mothers that bore them. They conjured him to release them from their guns, and allow them to remain neutral during the conflict. But when a ship of any nation is running into action, it is no time for argument, small time for justice, and not much time for humanity. Snatching a pistol from the belt of a boarder standing by, the Captain levelled it at the heads of the three sailors, and commanded them instantly to their quarters, under penalty of being shot on the spot. So, side by side with his country\u0027s foes, Tawney and his companions toiled at the guns, and fought out the fight to the last; with the exception of one of them, who was killed at his post by one of his own country\u0027s balls. At length, having lost her fore and main-top-masts, and her mizzen-mast having been shot away to the deck, and her fore-yard lying in two pieces on her shattered forecastle, and in a hundred places having been hulled with round shot, the English frigate was reduced to the last extremity. Captain Cardan ordered his signal quarter-master to strike the flag. Tawney was one of those who, at last, helped pull him on board the Neversink. As he touched the deck, Cardan saluted Decatur, the hostile commander, and offered his sword; but it was courteously declined. Perhaps the victor remembered the dinner parties that he and the Englishman had enjoyed together in Norfolk, just previous to the breaking out of hostilities—and while both were in command of the very frigates now crippled on the sea. The Macedonian, it seems, had gone into Norfolk with dispatches. Then they had laughed and joked over their wine, and a wager of a beaver hat was said to have been made between them upon the event of the hostile meeting of their ships. Gazing upon the heavy batteries before him, Cardan said to Decatur, \"This is a seventy-four, not a frigate; no wonder the day is yours!\" This remark was founded upon the Neversink\u0027s superiority in guns. The Neversink\u0027s main-deck-batteries then consisted, as now, of twenty-four-pounders; the Macedonian\u0027s of only eighteens. In all, the Neversink numbered fifty-four guns and four hundred and fifty men; the Macedonian, forty-nine guns and three hundred men; a very great disparity, which, united to the other circumstances of this action, deprives the victory of all claims to glory beyond those that might be set up by a river-horse getting the better of a seal. But if Tawney spoke truth—and he was a truth-telling man this fact seemed counterbalanced by a circumstance he related. When the guns of the Englishman were examined, after the engagement, in more than one instance the wad was found rammed against the cartridge, without intercepting the ball. And though, in a frantic sea-fight, such a thing might be imputed to hurry and remissness, yet Tawney, a stickler for his tribe, always ascribed it to quite a different and less honourable cause. But, even granting the cause he assigned to have been the true one, it does not involve anything inimical to the general valour displayed by the British crew. Yet, from all that may be learned from candid persons who have been in sea-fights, there can be but little doubt that on board of all ships, of whatever nation, in time of action, no very small number of the men are exceedingly nervous, to say the least, at the guns; ramming and sponging at a venture. And what special patriotic interest could an impressed man, for instance, take in a fight, into which he had been dragged from the arms of his wife? Or is it to be wondered at that impressed English seamen have not scrupled, in time of war, to cripple the arm that has enslaved them? During the same general war which prevailed at and previous to the period of the frigate-action here spoken of, a British flag-officer, in writing to the Admiralty, said, \"Everything appears to be quiet in the fleet; but, in preparing for battle last week, several of the guns in the after part of the ship were found to be spiked;\" that is to say, rendered useless. Who had spiked them? The dissatisfied seamen. Is it altogether improbable, then, that the guns to which Tawney referred were manned by men who purposely refrained from making them tell on the foe; that, in this one action, the victory America gained was partly won for her by the sulky insubordination of the enemy himself? During this same period of general war, it was frequently the case that the guns of English armed ships were found in the mornings with their breechings cut over night. This maiming of the guns, and for the time incapacitating them, was only to be imputed to that secret spirit of hatred to the service which induced the spiking above referred to. But even in cases where no deep-seated dissatisfaction was presumed to prevail among the crew, and where a seaman, in time of action, impelled by pure fear, \"shirked from his gun;\" it seems but flying in the face of Him who made such a seaman what he constitutionally was, to sew coward upon his back, and degrade and agonise the already trembling wretch in numberless other ways. Nor seems it a practice warranted by the Sermon on the Mount, for the officer of a battery, in time of battle, to stand over the men with his drawn sword (as was done in the Macedonian), and run through on the spot the first seaman who showed a semblance of fear. Tawney told me that he distinctly heard this order given by the English Captain to his officers of divisions. Were the secret history of all sea-fights written, the laurels of sea-heroes would turn to ashes on their brows. And how nationally disgraceful, in every conceivable point of view, is the IV. of our American Articles of War: \"If any person in the Navy shall pusillanimously cry for quarter, he shall suffer death.\" Thus, with death before his face from the foe, and death behind his back from his countrymen, the best valour of a man-of-war\u0027s-man can never assume the merit of a noble spontaneousness. In this, as in every other case, the Articles of War hold out no reward for good conduct, but only compel the sailor to fight, like a hired murderer, for his pay, by digging his grave before his eyes if he hesitates. But this Article IV. is open to still graver objections. Courage is the most common and vulgar of the virtues; the only one shared with us by the beasts of the field; the one most apt, by excess, to run into viciousness. And since Nature generally takes away with one hand to counter-balance her gifts with the other, excessive animal courage, in many cases, only finds room in a character vacated of loftier things. But in a naval officer, animal courage is exalted to the loftiest merit, and often procures him a distinguished command. Hence, if some brainless bravo be Captain of a frigate in action, he may fight her against invincible odds, and seek to crown himself with the glory of the shambles, by permitting his hopeless crew to be butchered before his eyes, while at the same time that crew must consent to be slaughtered by the foe, under penalty of being murdered by the law. Look at the engagement between the American frigate Essex with the two English cruisers, the Phoebe and Cherub, off the Bay of Valparaiso, during the late war. It is admitted on all hands that the American Captain continued to fight his crippled ship against a greatly superior force; and when, at last, it became physically impossible that he could ever be otherwise than vanquished in the end; and when, from peculiarly unfortunate circumstances, his men merely stood up to their nearly useless batteries to be dismembered and blown to pieces by the incessant fire of the enemy\u0027s long guns. Nor, by thus continuing to fight, did this American frigate, one iota, promote the true interests of her country. I seek not to underrate any reputation which the American Captain may have gained by this battle. He was a brave man; that no sailor will deny. But the whole world is made up of brave men. Yet I would not be at all understood as impugning his special good name. Nevertheless, it is not to be doubted, that if there were any common-sense sailors at the guns of the Essex, however valiant they may have been, those common-sense sailors must have greatly preferred to strike their flag, when they saw the day was fairly lost, than postpone that inevitable act till there were few American arms left to assist in hauling it down. Yet had these men, under these circumstances, \"pusillanimously cried for quarter,\" by the IV. Article of War they might have been legally hung. According to the negro, Tawney, when the Captain of the Macedonian—seeing that the Neversink had his vessel completely in her power—gave the word to strike the flag, one of his officers, a man hated by the seamen for his tyranny, howled out the most terrific remonstrances, swearing that, for his part, he would not give up, but was for sinking the Macedonian alongside the enemy. Had he been Captain, doubtless he would have done so; thereby gaining the name of a hero in this world;—but what would they have called him in the next? But as the whole matter of war is a thing that smites common-sense and Christianity in the face; so everything connected with it is utterly foolish, unchristian, barbarous, brutal, and savouring of the Feejee Islands, cannibalism, saltpetre, and the devil. It is generally the case in a man-of-war when she strikes her flag that all discipline is at an end, and the men for a time are ungovernable. This was so on board of the English frigate. The spirit-room was broken open, and buckets of grog were passed along the decks, where many of the wounded were lying between the guns. These mariners seized the buckets, and, spite of all remonstrances, gulped down the burning spirits, till, as Tawney said, the blood suddenly spirted out of their wounds, and they fell dead to the deck. The negro had many more stories to tell of this fight; and frequently he would escort me along our main-deck batteries—still mounting the same guns used in the battle—pointing out their ineffaceable indentations and scars. Coated over with the accumulated paint of more than thirty years, they were almost invisible to a casual eye; but Tawney knew them all by heart; for he had returned home in the Neversink, and had beheld these scars shortly after the engagement. One afternoon, I was walking with him along the gun-deck, when he paused abreast of the main-mast. \"This part of the ship,\" said he, \"we called the slaughter-house on board the Macedonian. Here the men fell, five and six at a time. An enemy always directs its shot here, in order to hurl over the mast, if possible. The beams and carlines overhead in the Macedonian slaughter-house were spattered with blood and brains. About the hatchways it looked like a butcher\u0027s stall; bits of human flesh sticking in the ring-bolts. A pig that ran about the decks escaped unharmed, but his hide was so clotted with blood, from rooting among the pools of gore, that when the ship struck the sailors hove the animal overboard, swearing that it would be rank cannibalism to eat him.\" Another quadruped, a goat, lost its fore legs in this fight. The sailors who were killed—according to the usual custom—were ordered to be thrown overboard as soon as they fell; no doubt, as the negro said, that the sight of so many corpses lying around might not appall the survivors at the guns. Among other instances, he related the following. A shot entering one of the port-holes, dashed dead two thirds of a gun\u0027s crew. The captain of the next gun, dropping his lock-string, which he had just pulled, turned over the heap of bodies to see who they were; when, perceiving an old messmate, who had sailed with him in many cruises, he burst into tears, and, taking the corpse up in his arms, and going with it to the side, held it over the water a moment, and eying it, cried, \"Oh God! Tom!\"—\"D——n your prayers over that thing! overboard with it, and down to your gun!\" roared a wounded Lieutenant. The order was obeyed, and the heart-stricken sailor returned to his post. Tawney\u0027s recitals were enough to snap this man-of-war world\u0027s sword in its scabbard. And thinking of all the cruel carnal glory wrought out by naval heroes in scenes like these, I asked myself whether, indeed, that was a glorious coffin in which Lord Nelson was entombed—a coffin presented to him, during life, by Captain Hallowell; it had been dug out of the main-most of the French line-of-battle ship L\u0027Orient, which, burning up with British fire, destroyed hundreds of Frenchmen at the battle of the Nile. Peace to Lord Nelson where he sleeps in his mouldering mast! but rather would I be urned in the trunk of some green tree, and even in death have the vital sap circulating round me, giving of my dead body to the living foliage that shaded my peaceful tomb. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2831/78235.html","bookId":1240,"book":{"id":1240,"title":"White Jacket or, the World on a Man-of-War","description":"简介： When our frigate lay in Callao, on the coast of Peruher last harbour in the PacificI found myself without a grego, or sailor\u0027s surtout; and as, toward the end of a three years\u0027 cruise, no pea-jackets could be had from the purser\u0027s steward: and being...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2831","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
