{"id":23953,"no":22,"title":"CHAPTER XXII. A BUSINESS MAN\u0027S SUSPICIONS.","content":"Jasper stood at a little distance, witnessing the happy meeting between the mother and child. He did not wish to interrupt their happiness. Soon, however, the mother looked up, and then Jasper advanced, raising his hat, politely. \"Is this Mrs. Fitch?\" he asked. \"Yes,\" said the lady, surveying him with curiosity. \"Then I have great pleasure in restoring to you your child.\" \"What? Did he come with you?\" \"Yes, madam.\" \"Did you know I was in here?\" \"No; I only came in to consult the directory to learn your residence.\" \"How could you be so wicked as to steal my boy?\" demanded Mrs. Fitch, with pardonable indignation, judging that Jasper was the kidnapper. \"I wouldn\u0027t have done it for five thousand dollars!\" said Jasper, impetuously. \"He didn\u0027t \u0027teal me, mamma,\" said little Harry, coming opportunely to Jasper\u0027s defense. \"Who did, then, my darling?\" \"It was big, ugly man. Jasper good boy—kind to Harry.\" Mrs. Fitch, prompt to remedy her injustice, held out her hand to Jasper, which he took respectfully. \"Excuse me,\" she said; \"but I thought, as Harry was with you, that you had been concerned in his kidnapping.\" \"I never saw him till this morning,\" said Jasper. \"Chance drew me to a lonely house where he was confined.\" \"And you rescued him! How can I thank you?\" \"I would have done so if I could, but I can\u0027t take the credit of it. Your husband offered a reward, which the kidnapper thought best to accept. He did not dare to bring him back himself, and having no one else to employ, asked me to become his agent in restoring him. Of course, I was very glad to do it.\" \"It was not chance that directed you to the haunt of these wicked men; it was a good and merciful Providence. Did they ill-treat my darling?\" \"I found him tied to the bed in which he was lying.\" \"How could they treat you so my dear boy!\" said the mother, piteously. \"May I ask your name?\" This was, of course, addressed to Jasper. \"My name is Jasper Kent.\" \"Can you come out and stop at our house over night? We live about two miles distant. I want my husband to see you and thank you for bringing back our darling boy.\" Jasper reflected that he must see Mr. Fitch, at any rate, in order to obtain the promised reward. Moreover, he had no means of his own to pay for a lodging, and he promptly accepted the offer. \"I will return home at once,\" said Mrs. Fitch. \"I came in to make some purchases, but I can\u0027t think of those now. Come, Mr. Kent.\" \"Take hold of my hand,\" said little Harry to Jasper. Jasper smilingly took the proffered hand, and Harry, happy in the double companionship, went out of the store. There was a handsome carriage in waiting, with a coachman in livery perched on the box. \"Edward,\" said Mrs. Fitch, her face fairly glowing with delight, \"do you see? Little Harry has come back.\" \"So he has, Heaven bless him!\" said the coachman, heartily. \"How do you do, Master Harry?\" \"I\u0027m pooty well,\" answered the little boy. \"Where did you find him, ma\u0027am, if I may be so bold?\" \"This young gentleman brought him back, Edward. Now, drive right home.\" \"Won\u0027t you go around to the office, ma\u0027am, and tell master?\" \"No; he must have left the office by this time. We shall see him at supper to-night.\" Half an hour later the carriage drew up in front of a handsome residence, far enough from the centre of the city to have a side yard of considerable dimensions, in the rear of which stood a brick stable. It was clear that Mr. Fitch was a man of wealth, so Jasper decided. Of the sensation produced in the house by Harry\u0027s arrival I will not speak. Jasper found himself regarded in the light of the heroic deliverer of the little boy from captivity, though he laughingly disclaimed the credit attaching to such a character. They had been home but fifteen minutes when Mr. Fitch arrived. At the moment of his arrival Jasper was in a handsome chamber on the second floor, which had been assigned to his use, preparing himself for dinner. Mr. Fitch was overjoyed at the recovery of his little boy, but he listened with some incredulity to the praises lavished upon Jasper by his wife. \"You don\u0027t seem to realize,\" he said, \"that this young hero of yours is a companion and acknowledged agent of a kidnapper.\" \"Wait till you see him,\" said Mrs. Fitch, confidently. Mr. Fitch shrugged his shoulders. \"How the women are carried away by a specious appearance!\" he thought. \"I am a man of the world, and cooler in my judgment.\" Yet when Jasper entered the room he could not help acknowledging that his appearance was very much in his favor. Frank and manly in his looks, he met Mr. Fitch with gentlemanly ease. \"You are the young gentleman who brought back my little boy, I believe,\" said the father. \"Yes, sir,\" said Jasper. \"I occupy, for the time being, the office of agent of the man who kidnapped him.\" \"Who is this man?\" \"I should be willing to tell you if I had not promised secrecy.\" \"Then,\" said Mr. Fitch, with slight suspicion, \"you are in confidential relations with this villain.\" \"Partly so, but it was forced upon me. I never met him till to-day, and he confided in me because there seemed to be no one else that he could trust.\" \"Why did he not come himself?\" \"Because he thought it would be dangerous.\" \"Shall you meet him again?\" \"Once only, to finish this business. He said you had promised a certain sum on the boy\u0027s return, and this I agreed to carry him.\" \"How much commission are you to receive?\" inquired Mr. Fitch. \"Nothing at all,\" said Jasper. \"He handed me five dollars to pay the railroad fare of little Harry and myself to St. Louis. What is left over I shall return to him.\" \"Then Harry was not concealed in this city?\" \"No, sir; but he was at no great distance from it.\" \"Are you living here?\" \"I never was in St. Louis until this afternoon. I have only just come on from the State of New York.\" \"To find employment, I suppose?\" \"Yes, sir. It was by the merest chance that I fell over your little boy and his captor. I was contriving plans for getting him away, when fortunately the kidnapper received a communication from you which led to my being here.\" \"Suppose you had got Harry away from this man, how could you have found me?\" \"That would have been the difficulty. I didn\u0027t know your name, or where you lived. But I meant to come here and get one of the daily papers to publish an account of the recovery, in the hope that the paragraph would find its way to your notice.\" \"A very sensible plan,\" commented Mr. Fitch, approvingly. \"When have you agreed to meet the kidnapper to carry him the money?\" \"To-morrow at twelve.\" \"And then you will proceed to carry out your own plans?\" \"Yes, sir. After supper, if you can spare the time, I will tell you my situation, and the circumstances that led me here, and ask for advice.\" \"Very well. I will gladly give you the best counsel I can.\" After supper Jasper told his story briefly, and confirmed the favorable impression he had already begun to make. Mr. Fitch cast aside his lingering remnant of suspicion, and promised his good offices in procuring him employment. \"After you have seen this man and paid him the money,\" he said, \"come to my counting-room, and we will talk over your affairs.\" The evening was spent socially, little Harry, of course, being the central object of interest. The little fellow appeared to have taken a great fancy to Jasper, and was unwilling to have him go the next day. He was not reconciled till Jasper promised to come back. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2967/81685.html","bookId":378,"book":{"id":378,"title":"Frank and Fearless or The Fortunes of Jasper Kent","description":"简介： A dozen boys were playing ball in a field adjoining the boarding-school of Dr. Pericles Benton, in the town of Walltham, a hundred and twenty-five miles northeast of the city of New York. These boys varied in age from thirteen to seventeen. In anothe...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2967","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
