{"id":23938,"no":7,"title":"CHAPTER VII. NEW RELATIONS.","content":"Jasper remained till the next afternoon. His father urged him to stay longer, and his step-mother, with apparent cordiality, seconded the invitation; but Jasper felt that the charm of home was gone. The new wife had stepped in between his father and himself. He felt sure that the marriage had not been of his father\u0027s seeking. To him it was no object. To the former governess it was a matter of importance, since it secured her a permanent home and position, and a share of Mr. Kent\u0027s property. There was an old servant in the family, a trusty maid, who had been in it before Jasper was born. With her he could speak confidentially. \"Tell me, Margaret,\" he asked, \"how came my father to marry Miss Thorne?\" Margaret went to the door and looked out cautiously, then closed it. \"I don\u0027t want her to hear what I say,\" she commenced, when convinced that they were in no danger of listeners, \"but it\u0027s my belief she asked your father to marry her.\" \"Do you really believe that, Margaret?\" \"Yes, I do, Master Jasper. She\u0027s that bold she wouldn\u0027t mind it, not a bit. Only she\u0027d do it sly-like. I know just how she\u0027d do it. She\u0027d tell him how she hadn\u0027t got a home, and must go out into the wide world, and get him to pity her. Then, you know, he\u0027d got used to seeing her round, and a sick man don\u0027t like changes.\" \"Why couldn\u0027t she stay as governess to Florence?\" \"According to her father\u0027s will Florence is to pass the next four years in the family of his sister, and she—that\u0027s her aunt—has a governess for her own children that\u0027ll do for Florence, too. So there wasn\u0027t no need of Miss Thorne staying here any longer. Your father asked her to stay a while, till she could find another place. It\u0027s my belief she didn\u0027t try, being bent on staying here as the mistress. At any rate, she told your father she couldn\u0027t get a place, and he offered her the one she wanted, that of his wife.\" \"How do you like her, Margaret?\" asked Jasper, thoughtfully. \"Me like her! That\u0027s what I never did. She\u0027s like a cat—soft-spoken enough when she has her own way, but she\u0027s got claws, and you may depend she\u0027ll show \u0027em. I hope she won\u0027t do anything to harm you, Master Jasper.\" \"Me!\" said Jasper, with the bold confidence of a boy, laughing at the thought. \"What can Mrs. Kent—a woman—do to injure me? I\u0027ll risk that, Margaret. It\u0027s of my father I\u0027m thinking. Will she treat him well?\" \"I think she will, for it\u0027s her object to, Master Jasper. She\u0027s married him for money, you know.\" \"I don\u0027t mind her benefiting by my father\u0027s property, if she will make him comfortable during his life.\" \"I think she will; she\u0027s too sly, and knows her own interest too well not to.\" \"I\u0027m glad you think that, Margaret. I shall feel better about it.\" \"Then you don\u0027t think you can stay, Jasper?\" said Mrs. Kent, softly, when he announced his determination. \"No, madam, I think I ought to be getting back to school.\" \"Perhaps you are right. We shall miss you.\" \"Yes, Jasper, we shall miss you,\" said his father. \"I will write you often, father. If you are not feeling well at any time, write and let me know.\" \"I will do so, Jasper,\" said his step-mother, promptly; \"but I shall have better news to write. Your father shall have the best of care.\" \"Thank you, madam. If you can contribute to his comfort, you will place me under obligations to you.\" \"As a wife, it will be my duty as well as my pleasure to do so,\" said Mrs. Kent. Jasper bowed. The suggestion of the relationship always fell unpleasantly on his ears. The carriage came round to take Jasper to the depot. His father and step-mother looked out of the front windows, and saw him off. \"He is a noble, warm-hearted boy,\" said his father, warmly. \"Yes,\" said Mrs. Kent, assenting, because it was expected. \"Manly and high-spirited, too!\" added his father, in a tone full of affectionate admiration. \"I\u0027d like to break his spirit!\" thought Mrs. Kent, spitefully. \"Some time I may have the chance.\" Of course she didn\u0027t venture to say this. She only inquired, \"Were you like him at his age, Mr. Kent?\" Mr. Kent smiled. \"I won\u0027t flatter myself so far,\" he answered. \"Jasper is an improvement on the parent stock. I see in him more manliness and self-reliance than I possessed at his age.\" \"May it not be parental partiality?\" asked Mrs. Kent, who by no means enjoyed hearing Jasper\u0027s praises. \"No, I don\u0027t think so.\" \"You must let me believe that it is your modesty then. Jasper may be a fine boy, but he will do well if he grows up as good a man as you.\" \"Now you flatter me, my dear,\" said Mr. Kent, smiling. \"You have too good an opinion of me.\" \"I don\u0027t know about that,\" said Mrs. Kent to herself. \"I think you are an addle-headed old fool, but I won\u0027t say so.\" Aloud she said, with a smile: \"My marrying you is a proof of my good opinion, Mr. Kent.\" \"Thank you,\" said her husband, politely. He was not a suspicious man—far from it—but even he knew that his wife only married him for a home and an establishment. But he never let his mind dwell on such things, and he quietly permitted his wife\u0027s assertion to go uncontradicted. Meanwhile Jasper Kent had returned to his boarding-school. There was one who awaited his return with mingled curiosity and exultation. This was Nicholas Thorne. He had received his mother\u0027s letter, from which he learned, first, that her plan had succeeded, and she was now the wife of a rich man, and, secondly, that his own relationship to her must be changed in the eyes of the world. \"I suppose mother knows what is best,\" he said to himself. \"So I\u0027m to be her nephew, am I? Well, it\u0027s all one to me, as long as I fare the better for her good fortune.\" For the moment it occurred to him that his mother might intend to throw him off—in a measure—but he quickly laid it aside. Bad as his mother was, she was yet devoted to him, and in so far was superior to him, for he cared for himself first and for no one second. The thought originated in his own base selfishness, and was laid aside only because he had received too many proof\u0027s of his mother\u0027s affection to doubt her. When he heard that Jasper had got back he took pains to meet him. \"Well, Kent,\" he said, with a show of intimacy which Jasper found very disagreeable, \"what news from home?\" Jasper was about to reply abruptly, when it occurred to him that, after all, Nicholas had an interest in the matter. \"I suppose you mean to ask if your mother is well?\" he said, eyeing Jasper keenly. But Nicholas was on his guard. His mother\u0027s letter had cautioned him. \"No, I don\u0027t,\" he answered, impudently. \"She is your mother, not mine.\" \"My mother!\" exclaimed Jasper, coloring. \"Yes, she\u0027s your father\u0027s wife, isn\u0027t she?\" said Thorne, with a leer. \"Yes, but I acknowledge no such relationship as you suggest.\" \"She\u0027s your step-mother, whatever you say.\" \"I shall never call her so. You told me before I went that she was your mother.\" \"I have always called her so, because I have known no other,\" said Thorne, composedly. \"She is really my aunt.\" \"It must be true, then,\" thought Jasper. \"However, it is of little importance to me what the relationship may be.\" \"I suppose this match makes us relations,\" said Thorne, smiling disagreeably. \"I don\u0027t see that it does,\" said Jasper, coldly. \"You\u0027d rather it wouldn\u0027t, I suppose,\" sneered Thorne, provoked. \"I don\u0027t know you well enough to desire so close a connection,\" said Jasper, in the same cold tone. \"We shall know each other well enough some time,\" said Thorne, with something of menace in his tone. Jasper turned on his heel and walked away. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2967/81670.html","bookId":378,"book":{"id":378,"title":"Frank and Fearless or The Fortunes of Jasper Kent","description":"简介： A dozen boys were playing ball in a field adjoining the boarding-school of Dr. Pericles Benton, in the town of Walltham, a hundred and twenty-five miles northeast of the city of New York. These boys varied in age from thirteen to seventeen. In anothe...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2967","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
