{"id":87525,"no":14,"title":"Page 14","content":"“Positive. I want to know everything she said.”\n Kiersten sighs and pulls her legs up on the couch and turns toward me. “She thinks you’re a jerk. She said you were an asshole, a dickhead, a bas-”\n “A bastard. I know, I get it. What else did she say?”\n “She didn’t tell me why she was mad at you…but she’s really mad at you. I don’t know what you did, but she’s at her house right now cleaning like a psycho! When she opened the door, she had hundreds of index cards all over the living room floor. It looked like recipes or something.”\n “Oh god, she’s alphabetizing,” I say. This is worse than I thought. “Kiersten, she won’t answer the door if I go over there. Will you knock so she’ll open the door? I really need to talk to her.”\n Kiersten presses her lips together as she thinks about my question. “You’re asking me to trick her? To basically lie to her?”\n I shrug my shoulders and nod.\n “Let me get my coat.”\n I stand up and Sherry comes from the kitchen and holds out her hand. I hold open my palm and she puts something in it and folds my fingers over it. “If it doesn’t go the way you’re hoping, take these with some water. You look like shit.”\n She can see the hesitation in my face and she smiles. “Don’t worry, I made them. They’re completely legal.”\n I don’t really have a plan of attack. I’m hiding against the wall in front of Lake\u0027s house when Kiersten knocks. My heart is beating so fast, I feel like I’m about to commit a robbery or something. I take a deep breath when I hear the door open. Kiersten steps aside and I brush past her and slip inside Lake’s house faster than she can realize what happened.\n “Get out, Will,” she says as she holds the door open and points outside.\n “I’m not leaving until you talk to me,” I say. I back further into the living room.\n “Get out! Get out, get out, get out!”\n I do what any sane male would do in this situation; I run down the hallway and lock myself in her bedroom. I realize I still don’t have a plan. I don’t know how I can talk to her if I’m locked up in her bedroom. But at least she can’t kick me out of her house now. I’ll stay here all day if I have to.\n I hear the front door slam and within seconds she’s standing outside the bedroom door. I wait for her to say something or to yell at me, but she doesn’t. I watch the shadow of her feet disappear as she walks away.\n What now? If I open the door, she’ll just try to kick me out again. Why didn’t I formulate a better plan? I’m an idiot. I’m a freaking idiot! Think, Will. Think.\n I see the shadow of her feet reappear and she pauses in front of her bedroom door again.\n “Will? Open the door. I’ll talk to you.”\n She doesn’t sound angry. My idiotic plan actually worked? I unlock the door to her bedroom and as soon as I open it all the way, I’m completely drenched in water. She just threw water on me! She threw an entire pitcher of water in my face!\n “Oh,” she says. “You look a little wet, Will. You better go home and change before you get sick.” She calmly turns and walks away.\n I’m an idiot, and she’s not ready to give in. I make the walk of shame down her hallway, out the front door and across the street to my house. It’s freezing. She didn’t even bother warming the water before she threw it at me. I take off my clothes and get in the shower. A hot shower this time.\n The shower didn’t help at all. I feel like complete crap. Five cups of coffee and no sleep on an empty stomach doesn’t make for a great start to the day. It’s almost two o’clock in the afternoon. If I wasn’t such an idiot, I wonder what Lake and I would be doing right now? Who am I kidding? I know what we’d be doing right now. My reflection on our turn of events over the past twenty-four hours causes my head to hurt. I pick my pants up off the bedroom floor and reach inside the pocket, pulling out whatever it is that Sherry gave me. I walk to the kitchen and down the medicine with an entire glass of water before going to the couch.\n It’s dark when I wake up. I don’t even remember lying down. I sit up on the couch and spot a note on the coffee table. I reach over and snatch it up and begin to read it. My heart sinks when I realize it’s not from Lake.\n Will,\n I was going to warn you not to drive after you take the medicine…but I see you already took it. So, never mind.\n ~Sherry\n P.S. I had a talk with Layken today. You really should apologize, you know. That was kind of a dick move on your part. If you need any more medicine, you know where I live. \n I toss the letter back onto the table. Was the smiley face really necessary? I wince as the cramps in my stomach intensify. When was the last time I ate something? I honestly can’t remember. I open the refrigerator and see the basagna from the night before. Unfortunately, it’s now the perfect night for basagna. I cut a section out and throw it on a plate and toss it in the microwave. As I’m filling a glass with soda, the front door swings open.\n She’s walking across the room, heading for the bookshelf. I dart into the living room just when she reaches it. She’s still ignoring me. Rather than reaching in for a single star this time, she grabs the entire vase off the bookshelf.\n She is not taking this vase with her. If she takes the vase with her, she won’t have a reason to come back. I grab the vase out of her hands, but she won’t let go. We tug back and forth, but I’m not letting go. I’m not letting her take it. She finally releases her grasp and crosses her arms across her chest as she glares at me.\n “Give it to me, Will. My mother made it and I want to take it home with me.”\n I walk back to the kitchen with the vase…she follows me. I set it in the corner of the countertop against the wall and I turn around and place my arms on either side of it so she can’t reach it.\n “Your mother made it for both of us. I know you, Lake. If you take this home you’ll open every single one of them tonight. You’ll be opening stars all night just like you carve pumpkins.”\n She throws her hands up in the air and groans. “Stop saying that! Please! I don’t carve pumpkins anymore!”\n I can’t believe she thinks she doesn’t carve pumpkins anymore. “You don’t? Really? You’re carving them right now, Lake. It’s been twenty-four hours and you still won’t let me talk to you about it.”\n She wads her hands into fists and stomps her feet in frustration. “Ugh!” she yells. She looks like she wants to hit something. Or someone. God, she’s so beautiful.\n “Stop looking at me like that!” she snaps.\n “Like what?”\n “You’ve got that look in your eyes again. Just stop!”\n I have absolutely no idea what look she’s talking about, but I divert my attention away from her. I don’t want to do anything to piss her off even more.\n “Have you eaten anything today?” I ask. I take my plate out of the microwave but she doesn’t answer me. She just stands in the kitchen with her arms folded across her chest. I pull the pan of basagna out of the refrigerator and fold back the tinfoil.\n “You’re eating basagna? How appropriate,” she says.\n It’s not the conversation I was hoping we would have, but it’s conversation nonetheless. I cut another square of basagna and put it in the microwave. Neither of us says anything while it cooks. She just stands there, staring at the floor. I just stand here, staring at the microwave. When it’s finished cooking, I put our plates on the bar and make another drink. We both sit down and eat in silence. Very uncomfortable silence.\n When we’re finished, I clear off the bar and sit across from her so I can see her better. I wait for her to speak first. She has her elbows resting on the bar while she stares down at her nails, picking at them, attempting to look uninterested.\n “So, talk,” she says evenly, without looking up at me.\n I reach my hands across the bar to touch hers, but she pulls them away and leans back in her chair. I don’t like the barrier of the bar between us so I get up and walk to the living room.\n “Come sit,” I say to her. She walks to the living room and sits on the same couch as me, but at the opposite end. I rub my face with my hands, trying to sort out just how I’m going to make her forgive me. I pull my leg up on the couch and turn to face her.\n “Lake, I love you. The last thing in the world I want to do is hurt you. You know that.”\n “Well, congratulations,\" she says. \"You just succeeded with accomplishing the last thing in the world you wanted to do.”\n I lean my head back into the couch. This is going to be harder than I thought. She’s tough to crack.\n “I’m sorry I didn’t tell you she was in my class. I didn’t want you to worry.”\n “Worry about what, Will? Is her being in class with you something I should worry about? Because if it’s nothing like you say it is, why would I need to worry?”\n Jesus! Am I picking the worst ways in the world to apologize or is she just that good? If she ever stops being mad at me, I’ll tell her I think she’s finally figured out her major; pre-law.\n “Lake, I don’t feel that way about Vaughn anymore. I was planning to tell you about her being in my class next week…I just didn’t want to bring it up before our getaway.”\n “Oh. So you wanted to make sure you got laid before you pissed me off. Good plan,” she says sarcastically.\n I slap my forehead with my hand and close my eyes. There isn’t a fight this girl couldn’t win.\n “Think about it, Will. Put yourself in my shoes. Let’s say I had sex with a guy before I met you. Then right when you and I were about to have sex, you walk into my bedroom and I’m hugging this guy. Then you see me kiss him…on the neck; your favorite place to be kissed by me. Then you find out I’ve been seeing this guy every other day for weeks and I’ve kept it a secret. What would you do? Huh?”\n She\u0027s not picking at her nails anymore. She\u0027s glaring right at me, waiting on my response.\n \"Well,\" I say. “I would allow you the chance to explain without interrupting you every five seconds.”\n She flips me off and jerks herself off the couch and starts toward the front door. I grab her arm when she passes me and I pull her back down onto the couch. When she falls into the spot next to me, I wrap my arms around her and press her head into my chest. I try not to let her go. I don’t want her to go. “Lake, please. Just give me a chance, I’ll tell you everything. Don’t leave again.”\n She doesn’t struggle to pull away. She doesn’t fight me, either. She relaxes into my chest and lets me hold her while I talk.\n “I didn’t know if you even knew about Vaughn. I know how much you hate talking about past relationships, so I thought it would be worse if I brought it up than if I didn’t. That’s why I didn’t bring it up. Seeing her again meant nothing to me. I didn’t want it to mean anything to you, either.” \n","sourceLink":"https://allnovel.net/point-of-retreat-slammed-2/page-14.html","bookId":2780,"book":{"id":2780,"title":"Point of Retreat (Slammed #2)","description":"Storyline: \n Point of Retreat (Slammed #2) \n Hardships and heartache brought them together… now it will tear them apart. \n Layken and Will have proved their love can get them through anything; until someone from Will’s past re-emerges, leaving Layken questioning the very foundation on which their relationship was built. Will is forced to face the ultimate challenge…how to prove his love for a girl who refuses to stop ‘carving pumpkins.’\n \n","cover":"https://allnovel.net/images/point-of-retreat-slammed-2.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/point-of-retreat-slammed-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:22:12 PM"}}
