{"id":88148,"no":48,"title":"Page 48","content":"\\n\\n Hed make sure every woman and child there was tucked behind Mac and Tyler, and then risk his life drawing the line of fire until they got them out of harms way. Marguerite nodded in perfect understanding. A soldier is just as brave as the colonel leading the troops, because he has to have the courage to follow, to believe that winning the battle is the most important thing. Thats what Brendan is.\\n\\n Percival. She remembered Brendans words about the knight.\\n\\n A s I said, Brendan is a more intuitive submissive, Chloe. He doesnt always need you to clearly state what you want. He seeks it out, as part of his nature, and strives to meet it, perhaps to excess. But no, hes not a doormat. Not in the least. He wont let you abuse him, though he might undervalue his worth, accept less than what you could truly give him, if you dont find the courage to do so.\\n\\n Okay, there was a warning there, that streak of protectiveness showing in Marguerites eyes that Tyler had mentioned. Chloe felt less threatened by it now, knowing Marguerite had a similar feeling toward her, but it did turn her toward that uneasiness shed felt a couple times during her conversations with Brendan. A n uneasiness because of his unwillingness to tell her what he wanted.\\n\\n The night at the carnival, how would you have done itwhen he was tied up?\\n\\n Id have told you first and foremost it wasnt about sticking six inches of molded rubber up his backside, any more than religious faith is about two sticks tied together in a certain way. Thats a tool for expressing your faith, not the sole focus of it.\\n\\n Rising abruptly, Marguerite drew Chloe out of her seat. She moved them a few steps into an open area of the garden, where they stood on a platform of slate tiles next to a gurgling fountain formed by smooth stones. The winter bushes here had a light, sweet smell.\\n\\n Turning Chloe away from her, Marguerite took her palm down Chloes back, a slow trail of sensation. Imagine youre him, Chloe. He wants to give himself to you utterly. You gag him because he needs to be helpless to your love, however you want to express it. Hes given up his voice, his freedom, to give you pleasure in this precious moment. To take you both on a journey together. Hes hard for you, his mind, soul and heart riveted upon you. You have commanded all his attention.\\n\\n Her hands settled on Chloes hips, her body pressing close, giving Chloe an unexpected charge of sexual energy, with an emotional twist. Now imagine youre wearing that strap-on. You put the tip in his anus, exert pressure and slide forward, easing in, so slowly, registering every single response of that body, heart, soul and mind to you.\\n\\n Chloe thought of Brendans body accepting her, those beautiful muscles straining, head fully back on his shoulders, ass tightening in delicious display, flexing against her. If shed moved forward, she would have felt it, that push followed by a sudden slick giving, a dildo accepted in a mans ass the way a womans cunt would accept his cock.\\n\\n Marguerite brushed her lips against her hair. Different as day and night, isnt it?\\n\\n Yeah. Chloe swallowed as Marguerite let her go enough to guide her back to the chair, easing her down on weak knees before taking a seat herself. Though she had no obvious feathers out of place, Marguerites gaze remained compassionate, gentle. It made something crack inside Chloes chest, remembering arousal and pain sawing together against her breast bone. But shed be brave enough to take it a step further.\\n\\n MI havent asked, because Im not even sure I could understand. But what is he to you? More importantly, what was she to him? Brendan had answered the question, for certain. Im not in love with her, and shes not in love with me. But she wanted Marguerites answer to it.\\n\\n I was his Mistress, Chloe. Marguerite pressed her lips together. I am his Mistress. Youre right, you may not be at a place you can fully understand how that doesnt impede or detract from where the two of you are going, but it doesnt. There is no active sexual or romantic relationship between us, and there never will be again, unless that is something the four of us find agreeable. Brendan and I are bonded, because of who and what we are to one another, but what the two of you have will exceed it, if your hearts desire it.\\n\\n I do, Chloe said slowly. Reassurance and apprehension both came with hearing the truth of it spoken. But M, I thinkI need to understand better.\\n\\n I dont know enough to know what I need to ask here, butcan you help me?\\n\\n Marguerite studied her in that peculiar way she had, as if she was sifting through a variety of things about Chloe that Chloe couldnt even see in herself.\\n\\n You need to understand the core of what he is. I think youre already mostly there, but you need to have an experience with it, untainted by your own fear and pain. Youll go where you need to go then, find out who you are, who he is. Its a thing of raw, perfect beauty.\\n\\n Chloe turned her gaze back to her tea cup. What if Im not undamaged enough to set aside fear and pain? Its like chicken and egg, M. I want him, but I may be too messed up right now. Do you think its best to let him go until I get it figured out?\\n\\n Like the chicken and egg, I think he may be the key to helping you figure it out. He has chosen you, and will be whatever you need him to be.\\n\\n I just want him to be him.\\n\\n Marguerite met her gaze. Im glad to hear it. You may be able to help him with that.\\n\\n So Marguerite knew. What had she said? What Brendan needs, more than a Mistress, is someone who understands what his submissiveness is truly about. A nd thats the challenge and test of acceptance you face. Before she could pursue that further, Marguerite shifted. If you are willing to do this, I can set it up. It may require me to have some brief exposure to Brendan in my capacity as his Mistress. But only to give you both a gift, I hope.\\n\\n Chloe digested that, thought about seeing Marguerite act as Mistress toward the man she felt, in an inexplicable way, was hers. Can I think about it a little while?\\n\\n Of course. Marguerites lovely hair, pulled back in a comb, fell alongside her shoulder as she leaned forward again, touched Chloes face, the lightest of contacts over sensitive nerves. The option is entirely up to you. What I most want, Chloe, is for you to find your happiness again. Not for my sake, or Brendans, but for your own.\\n\\n Chloe got lost in that blue gaze, how close Marguerite was. Her reassurance, warmth, love, it all wrapped around her. She could get up now, go back to work. In fact, she even started to do so, giving Marguerite a tired smile. Her boss squeezed her knee, leaned back. Chloe knew shed pick up her tea cup and go back to her meditation. Session done, lots of progress made. A fter all this, which had been emotionally draining, it would be okay to let it go for awhile, right?\\n\\n However, for the first time in forty-eight hours, it didnt hurt so much to think about Brendan. Which meant she couldnt help but think of what hed told her in his small kitchen, how hed held her beneath him, helped her from shattering. A nd now Marguerite, saying that she could help Chloe understand Brendans soulif her own fear and anger didnt get in the way.\\n\\n She did want him. A fter nearly a year of vacillating on nearly every decision, that want galvanized her to think about what healing really meant.\\n\\n It meant taking the scariest step imaginable, defying those dark voices that told her not to reach out to anyone, that she could handle this herself, that it would eventually go away\\n\\n M, I think She turned around, faced Marguerite again. She couldnt figure out why the words were sticking in her throat, or why it got worse when Marguerite put down her teacup and rose, her brow creasing at whatever she saw in Chloes face.\\n\\n It was too hard. The tears shed held back for so long surged up into her throat, as if this very second was the key moment, when they knew the dam would break and the flood would begin. She couldnt do it.\\n\\n She couldnt not do it.\\n\\n I wanted to be strong, like you, not let them win. Brendan told me they only win if they cut me off, you know. If I dont trust anyone or let myself be vulnerable. The words poured out at once, jumbled and insensible, so painful she couldnt breathe. She choked the words out anyway. I cant do this on my own. Im afraid, and scared all the time, and angry, and ashamed I need help. Goddess, I need help.\\n\\n When Marguerite closed the distance between them in barely a second, her arms immediately there, no doubt, no hesitation, Chloe grabbed hold of the taller woman like a panicked drowning swimmer. I cant fix it. I dont know howand they hurt me, and made me afraid to live Im afraid to cry. I cant\\n\\n She didnt know how Marguerite called her, or maybe Gen had been watching all along, but suddenly Gen was there too, so they held her between them, forming a solid protection all around her. She had to trust them. Brendan had told her she could. She knew she could.\\n\\n The dark memories rose, bringing violent hands and faces, anger and hatred, such that the evil and helplessness of it all drowned her. She went down in it and let go.\\n\\n It was like being in a nightmare, only she wasnt. She could scream out her rage and hurt, cry as if shed never stop, so hard she choked on the sobs, and yet they were holding her, keeping her between them as she struggled against the horror of it all, of everything that had been taken from her, that had come back to haunt her.\\n\\n Help She kept repeating that one word, and they held her tighter, pressing kisses on her face, stroking her hair, refusing to let her trembling body break apart. They all sat, folded on the pea gravel together, the fountain a hushed reassurance all its own. Evil had come here, the place shed always assumed was safe, but it hadnt destroyed it. It hadnt destroyed her. They wouldnt let it. She wouldnt let it.\\n\\n Thank God, Gen said softly, after a long time, when her sobs were becoming shuddering gulps of air. Oh precious, you should have done this a long time ago. Weve always been here for you.\\n\\n A lways, Marguerite repeated. Youre going to be fine.\\n\\n Chloe realized that Marguerites face was streaked with tears too, a remarkable validation of its own. In that moment, she knew it didnt mean a damn, what her boss was to Brendan or Brendan was to her, because those tears destroyed her, made Chloe forgive everything. Marguerite had known exactly what shed felt, what shed needed all along, and yet had suffered the heartbreak of knowing nothing could help her until Chloe reached out herself.\\n\\n It made her sorry and painfully reassured all at once. Family. This was what family did. Shelter in the storm, and even more than that.\\n\\n Remembering what Brendan had said, she knew that when the storm passed, they were the ones that would give her the strength to open those windows again, let the sunlight in, not fear its touch on her cold soul. \\n\\n","sourceLink":"https://allnovel.net/branded-sanctuary-nature-of-desire-7/page-48.html","bookId":1912,"book":{"id":1912,"title":"Branded Sanctuary (Nature of Desire #7)","description":"Storyline: Branded Sanctuary (Nature of Desire #7) \\n Chloe has always been a creature of joy and laughter. Since a brutal attack nearly a year ago, the trauma she experienced has gotten worse. She has started hiding from her life, even putting up walls between herself and those she cares about most. During a panic attack one night, she impulsively calls a number that she’s had for many months. Chloe met Brendan at her boss’s wedding. With confidence and seduction, he easily steps into the role of helping her manage her fear. By the end of the long call, they’ve indulged in some serious flirtation and mind-blowing phone sex—and she’s feeling things she’s buried for too long. \\n The problem is that Brendan is the perfect male submissive—and Chloe isn’t wired for the D/s lifestyle. While their attraction is undeniable, Chloe doesn’t know if she can be everything Brendan needs. As a submissive, Brendan would never ask her to be something she’s not—even if it will break both of their hearts to turn away from how they feel about each other.\\n","cover":"https://allnovel.net/images/branded-sanctuary-nature-of-desire-7.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/branded-sanctuary-nature-of-desire-7.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:25:37 PM"}}
