{"id":7345,"no":29,"title":"Chapter 29","content":"29:1 [hgb] 七 月 初 一 日 ， 你 们 当 有 圣 会 。 什 么 劳 碌 的 工 都 不 可 作 ， 是 你 们 当 守 为 吹 角 的 日 子 。 \\n\\n [kjv] And in the seventh month, on the first day of the month, ye shall have an holy convocation; ye shall do no servile work: it is a day of blowing the trumpets unto you. \\n\\n [bbe] In the seventh month, on the first day of the month, let there be a holy meeting; on it you may do no field-work; let the day be marked by the blowing of horns; \\n\\n 29:2 [hgb] 你 们 要 将 公 牛 犊 一 只 ， 公 绵 羊 一 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 七 只 ， 作 为 馨 香 的 燔 祭 献 给 耶 和 华 。 \\n\\n [kjv] And ye shall offer a burnt offering for a sweet savour unto the LORD; one young bullock, one ram, and seven lambs of the first year without blemish: \\n\\n [bbe] And give to the Lord a burned offering for a sweet smell; one ox, one male sheep, seven he-lambs of the first year, without any mark on them: \\n\\n 29:3 [hgb] 同 献 的 素 祭 用 调 油 的 细 面 。 为 一 只 公 牛 要 献 伊 法 十 分 之 三 。 为 一 只 公 羊 要 献 伊 法 十 分 之 二 。 \\n\\n [kjv] And their meat offering shall be of flour mingled with oil, three tenth deals for a bullock, and two tenth deals for a ram, \\n\\n [bbe] And their meal offering, the best meal mixed with oil, three tenth parts for an ox, two tenth parts for a male sheep, \\n\\n 29:4 [hgb] 为 那 七 只 羊 羔 ， 每 只 要 献 伊 法 十 分 之 一 。 \\n\\n [kjv] And one tenth deal for one lamb, throughout the seven lambs: \\n\\n [bbe] And a separate tenth part for every one of the seven lambs; \\n\\n 29:5 [hgb] 又 献 一 只 公 山 羊 作 赎 罪 祭 ， 为 你 们 赎 罪 。 \\n\\n [kjv] And one kid of the goats for a sin offering, to make an atonement for you: \\n\\n [bbe] And one he-goat for a sin-offering, to take away your sin: \\n\\n 29:6 [hgb] 这 些 是 在 月 朔 的 燔 祭 和 同 献 的 素 祭 ， 并 常 献 的 燔 祭 与 同 献 的 素 祭 ， 以 及 照 例 同 献 的 奠 祭 以 外 ， 都 作 为 馨 香 的 火 祭 献 给 耶 和 华 。 \\n\\n [kjv] Beside the burnt offering of the month, and his meat offering, and the daily burnt offering, and his meat offering, and their drink offerings, according unto their manner, for a sweet savour, a sacrifice made by fire unto the LORD. \\n\\n [bbe] In addition to the burned offering of the new moon, and its meal offering, and the regular burned offering and its meal offering, and their drink offerings, as they are ordered, for a sweet smell, an offering made by fire to the Lord. \\n\\n 29:7 [hgb] 七 月 初 十 日 ， 你 们 当 有 圣 会 。 要 刻 苦 己 心 ， 什 么 工 都 不 可 作 。 \\n\\n [kjv] And ye shall have on the tenth day of this seventh month an holy convocation; and ye shall afflict your souls: ye shall not do any work therein: \\n\\n [bbe] And on the tenth day of this seventh month there will be a holy meeting; keep yourselves from pleasure, and do no sort of work; \\n\\n 29:8 [hgb] 只 要 将 公 牛 犊 一 只 ， 公 绵 羊 一 只 ， 一 岁 的 公 羊 羔 七 只 ， 都 要 没 有 残 疾 的 ， 作 为 馨 香 的 燔 祭 献 给 耶 和 华 。 \\n\\n [kjv] But ye shall offer a burnt offering unto the LORD for a sweet savour; one young bullock, one ram, and seven lambs of the first year; they shall be unto you without blemish: \\n\\n [bbe] And give to the Lord a burned offering for a sweet smell; one ox, one male sheep, seven he-lambs of the first year: only those without any mark on them may be used: \\n\\n 29:9 [hgb] 同 献 的 素 祭 用 调 油 的 细 面 ， 为 一 只 公 牛 要 献 伊 法 十 分 之 三 。 为 一 只 公 羊 要 献 伊 法 十 分 之 二 。 \\n\\n [kjv] And their meat offering shall be of flour mingled with oil, three tenth deals to a bullock, and two tenth deals to one ram, \\n\\n [bbe] And their meal offering, the best meal mixed with oil, three tenth parts for an ox, two tenth parts for a male sheep, \\n\\n 29:10 [hgb] 为 那 七 只 羊 羔 ， 每 只 要 献 伊 法 十 分 之 一 。 \\n\\n [kjv] A several tenth deal for one lamb, throughout the seven lambs: \\n\\n [bbe] A separate tenth part for every one of the seven lambs; \\n\\n 29:11 [hgb] 又 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 赎 罪 祭 和 常 献 的 燔 祭 ， 与 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] One kid of the goats for a sin offering; beside the sin offering of atonement, and the continual burnt offering, and the meat offering of it, and their drink offerings. \\n\\n [bbe] One he-goat for a sin-offering; in addition to the offering for taking away your sin, and the regular burned offering and its meal offering, and their drink offerings. \\n\\n 29:12 [hgb] 七 月 十 五 日 ， 你 们 当 有 圣 会 。 什 么 劳 碌 的 工 都 不 可 作 ， 要 向 耶 和 华 守 节 七 日 。 \\n\\n [kjv] And on the fifteenth day of the seventh month ye shall have an holy convocation; ye shall do no servile work, and ye shall keep a feast unto the LORD seven days: \\n\\n [bbe] And on the fifteenth day of the seventh month let there be a holy meeting; do no field-work, and keep a feast to the Lord for seven days; \\n\\n 29:13 [hgb] 又 要 将 公 牛 犊 十 三 只 ， 公 绵 羊 两 只 ， 一 岁 的 公 羊 羔 十 四 只 ， 都 要 没 有 残 疾 的 ， 用 火 献 给 耶 和 华 为 馨 香 的 燔 祭 。 \\n\\n [kjv] And ye shall offer a burnt offering, a sacrifice made by fire, of a sweet savour unto the LORD; thirteen young bullocks, two rams, and fourteen lambs of the first year; they shall be without blemish: \\n\\n [bbe] And give a burned offering, an offering made by fire of a sweet smell to the Lord, thirteen oxen, two male sheep, fourteen he-lambs of the first year, all without any mark on them; \\n\\n 29:14 [hgb] 同 献 的 素 祭 用 调 油 的 细 面 。 为 那 十 三 只 公 牛 ， 每 只 要 献 伊 法 十 分 之 三 。 为 那 两 只 公 羊 ， 每 只 要 献 伊 法 十 分 之 二 。 \\n\\n [kjv] And their meat offering shall be of flour mingled with oil, three tenth deals unto every bullock of the thirteen bullocks, two tenth deals to each ram of the two rams, \\n\\n [bbe] And their meal offering, the best meal mixed with oil, three tenth parts for every one of the thirteen oxen, two tenth parts for every male sheep, \\n\\n 29:15 [hgb] 为 那 十 四 只 羊 羔 ， 每 只 要 献 伊 法 十 分 之 一 。 \\n\\n [kjv] And a several tenth deal to each lamb of the fourteen lambs: \\n\\n [bbe] And a separate tenth part for every one of the fourteen lambs; \\n\\n 29:16 [hgb] 并 献 一 只 公 山 羊 为 赎 罪 祭 ， 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one kid of the goats for a sin offering; beside the continual burnt offering, his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, and its meal offering, and its drink offering. \\n\\n 29:17 [hgb] 第 二 日 要 献 公 牛 犊 十 二 只 ， 公 绵 羊 两 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 十 四 只 。 \\n\\n [kjv] And on the second day ye shall offer twelve young bullocks, two rams, fourteen lambs of the first year without spot: \\n\\n [bbe] On the second day of the feast give an offering of twelve oxen, two male sheep, fourteen he-lambs of the first year, without any mark on them; \\n\\n 29:18 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] And their meat offering and their drink offerings for the bullocks, for the rams, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] And their meal offering and their drink offerings for the oxen and the sheep and the lambs, in relation to their number, as it is ordered: \\n\\n 29:19 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one kid of the goats for a sin offering; beside the continual burnt offering, and the meat offering thereof, and their drink offerings. \\n\\n [bbe] And one he-goat for a sin-offering in addition to the regular burned offering, and its meal offering, and their drink offerings. \\n\\n 29:20 [hgb] 第 三 日 要 献 公 牛 十 一 只 ， 公 羊 两 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 十 四 只 。 \\n\\n [kjv] And on the third day eleven bullocks, two rams, fourteen lambs of the first year without blemish; \\n\\n [bbe] And on the third day eleven oxen, two male sheep, fourteen he-lambs of the first year, without any mark; \\n\\n 29:21 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] And their meat offering and their drink offerings for the bullocks, for the rams, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] And their meal offering and drink offerings for the oxen, for the male sheep, and for the lambs, in relation to their number, as it is ordered: \\n\\n 29:22 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one goat for a sin offering; beside the continual burnt offering, and his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, and its meal offering, and its drink offering. \\n\\n 29:23 [hgb] 第 四 日 要 献 公 牛 十 只 ， 公 羊 两 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 十 四 只 。 \\n\\n [kjv] And on the fourth day ten bullocks, two rams, and fourteen lambs of the first year without blemish: \\n\\n [bbe] And on the fourth day ten oxen, two male sheep, fourteen he-lambs of the first year, without any mark: \\n\\n 29:24 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] Their meat offering and their drink offerings for the bullocks, for the rams, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] And their meal offering and their drink offerings for the oxen, for the male sheep, and for the lambs, in relation to their number, as it is ordered. \\n\\n 29:25 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one kid of the goats for a sin offering; beside the continual burnt offering, his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, and its meal offering, and its drink offering. \\n\\n 29:26 [hgb] 第 五 日 要 献 公 牛 九 只 ， 公 羊 两 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 十 四 只 。 \\n\\n [kjv] And on the fifth day nine bullocks, two rams, and fourteen lambs of the first year without spot: \\n\\n [bbe] And on the fifth day nine oxen, two male sheep, fourteen he-lambs of the first year, without any mark: \\n\\n 29:27 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] And their meat offering and their drink offerings for the bullocks, for the rams, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] And their meal offering and their drink offerings for the oxen, for the male sheep, and for the lambs, in relation to their number, as it is ordered: \\n\\n 29:28 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one goat for a sin offering; beside the continual burnt offering, and his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, and its meal offering, and its drink offering. \\n\\n 29:29 [hgb] 第 六 日 要 献 公 牛 八 只 ， 公 羊 两 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 十 四 只 。 \\n\\n [kjv] And on the sixth day eight bullocks, two rams, and fourteen lambs of the first year without blemish: \\n\\n [bbe] And on the sixth day eight oxen, two male sheep, fourteen he-lambs of the first year, without any mark: \\n\\n 29:30 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] And their meat offering and their drink offerings for the bullocks, for the rams, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] And their meal offering and their drink offerings for the oxen, for the male sheep, and for the lambs, in relation to their number, as it is ordered: \\n\\n 29:31 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one goat for a sin offering; beside the continual burnt offering, his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, its meal offering, and its drink offerings. \\n\\n 29:32 [hgb] 第 七 日 要 献 公 牛 七 只 ， 公 羊 两 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 十 四 只 。 \\n\\n [kjv] And on the seventh day seven bullocks, two rams, and fourteen lambs of the first year without blemish: \\n\\n [bbe] And on the seventh day seven oxen, two male sheep, fourteen he-lambs of the first year, without any mark: \\n\\n 29:33 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] And their meat offering and their drink offerings for the bullocks, for the rams, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] And their meal offering and their drink offerings for the oxen, for the male sheep, and for the lambs, in relation to their number, as it is ordered: \\n\\n 29:34 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one goat for a sin offering; beside the continual burnt offering, his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, its meal offering, and its drink offering. \\n\\n 29:35 [hgb] 第 八 日 你 们 当 有 严 肃 会 。 什 么 劳 碌 的 工 都 不 可 作 。 \\n\\n [kjv] On the eighth day ye shall have a solemn assembly: ye shall do no servile work therein: \\n\\n [bbe] On the eighth day let there be a holy meeting: you may do no field-work; \\n\\n 29:36 [hgb] 只 要 将 公 牛 一 只 ， 公 羊 一 只 ， 没 有 残 疾 ， 一 岁 的 公 羊 羔 七 只 作 火 祭 ， 献 给 耶 和 华 为 馨 香 的 燔 祭 。 \\n\\n [kjv] But ye shall offer a burnt offering, a sacrifice made by fire, of a sweet savour unto the LORD: one bullock, one ram, seven lambs of the first year without blemish: \\n\\n [bbe] And give a burned offering, an offering made by fire of a sweet smell to the Lord: one ox, one male sheep, seven he-lambs of the first year, without any mark: \\n\\n 29:37 [hgb] 并 为 公 牛 ， 公 羊 ， 和 羊 羔 ， 按 数 照 例 ， 献 同 献 的 素 祭 和 同 献 的 奠 祭 。 \\n\\n [kjv] Their meat offering and their drink offerings for the bullock, for the ram, and for the lambs, shall be according to their number, after the manner: \\n\\n [bbe] With the meal offering and the drink offerings for the ox, the male sheep, and the lambs, in relation to their number, as it is ordered: \\n\\n 29:38 [hgb] 又 要 献 一 只 公 山 羊 为 赎 罪 祭 。 这 是 在 常 献 的 燔 祭 和 同 献 的 素 祭 并 同 献 的 奠 祭 以 外 。 \\n\\n [kjv] And one goat for a sin offering; beside the continual burnt offering, and his meat offering, and his drink offering. \\n\\n [bbe] And one he-goat for a sin-offering; in addition to the regular burned offering, and its meal offering, and its drink offering. \\n\\n 29:39 [hgb] 这 些 祭 要 在 你 们 的 节 期 献 给 耶 和 华 ， 都 在 所 许 的 愿 并 甘 心 所 献 的 以 外 ， 作 为 你 们 的 燔 祭 ， 素 祭 ， 奠 祭 ， 和 平 安 祭 。 \\n\\n [kjv] These things ye shall do unto the LORD in your set feasts, beside your vows, and your freewill offerings, for your burnt offerings, and for your meat offerings, and for your drink offerings, and for your peace offerings. \\n\\n [bbe] These are the offerings which you are to give to the Lord at your regular feasts, in addition to the offerings for an oath, and the free offerings you give, for your burned offerings and your drink offerings and your peace-offerings. \\n\\n 29:40 [hgb] 于 是 ， 摩 西 照 耶 和 华 所 吩 咐 他 的 一 切 话 告 诉 以 色 列 人 。 \\n\\n [kjv] And Moses told the children of Israel according to all that the LORD commanded Moses. \\n\\n [bbe] So Moses gave the children of Israel all these directions as the Lord had given him orders. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/20/482.html","bookId":240,"book":{"id":240,"title":"Numbers民数记（双语小说）","description":"简介： And the LORD spake unto Moses in the wilderness of Sinai, in the tabernacle of the congregation, on the first day of the second month, in the second year after they were come out of the land of Egypt, saying； Take ye the sum of all the ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/20","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:53 AM"}}
