{"id":7346,"no":30,"title":"Chapter 30","content":"30:1 [hgb] 摩 西 晓 谕 以 色 列 各 支 派 的 首 领 说 ， 耶 和 华 所 吩 咐 的 乃 是 这 样 ， \\n\\n [kjv] And Moses spake unto the heads of the tribes concerning the children of Israel, saying, This is the thing which the LORD hath commanded. \\n\\n [bbe] And Moses said to the heads of the tribes of the children of Israel, This is the order of the Lord. \\n\\n 30:2 [hgb] 人 若 向 耶 和 华 许 愿 或 起 誓 ， 要 约 束 自 己 ， 就 不 可 食 言 ， 必 要 按 口 中 所 出 的 一 切 话 行 。 \\n\\n [kjv] If a man vow a vow unto the LORD, or swear an oath to bind his soul with a bond; he shall not break his word, he shall do according to all that proceedeth out of his mouth. \\n\\n [bbe] When a man takes an oath to the Lord, or gives an undertaking having the force of an oath, let him not go back from his word, but let him do whatever he has said he will do. \\n\\n 30:3 [hgb] 女 子 年 幼 ， 还 在 父 家 的 时 候 ， 若 向 耶 和 华 许 愿 ， 要 约 束 自 己 ， \\n\\n [kjv] If a woman also vow a vow unto the LORD, and bind herself by a bond, being in her father\u0027s house in her youth; \\n\\n [bbe] If a woman, being young and under the authority of her father, takes an oath to the Lord or gives an undertaking; \\n\\n 30:4 [hgb] 她 父 亲 也 听 见 她 所 许 的 愿 并 约 束 自 己 的 话 ， 却 向 她 默 默 不 言 ， 她 所 许 的 愿 并 约 束 自 己 的 话 就 都 要 为 定 。 \\n\\n [kjv] And her father hear her vow, and her bond wherewith she hath bound her soul, and her father shall hold his peace at her: then all her vows shall stand, and every bond wherewith she hath bound her soul shall stand. \\n\\n [bbe] If her father, hearing of her oath or the undertaking she has given, says nothing to her, then all her oaths and every undertaking she has given will have force. \\n\\n 30:5 [hgb] 但 她 父 亲 听 见 的 日 子 若 不 应 承 她 所 许 的 愿 和 约 束 自 己 的 话 ， 就 都 不 得 为 定 。 耶 和 华 也 必 赦 免 她 ， 因 为 她 父 亲 不 应 承 。 \\n\\n [kjv] But if her father disallow her in the day that he heareth; not any of her vows, or of her bonds wherewith she hath bound her soul, shall stand: and the LORD shall forgive her, because her father disallowed her. \\n\\n [bbe] But if her father, hearing of it, makes her take back her word, then the oaths or the undertakings she has given will have no force; and she will have forgiveness from the Lord, because her oath was broken by her father. \\n\\n 30:6 [hgb] 她 若 出 了 嫁 ， 有 愿 在 身 ， 或 是 口 中 出 了 约 束 自 己 的 冒 失 话 ， \\n\\n [kjv] And if she had at all an husband, when she vowed, or uttered ought out of her lips, wherewith she bound her soul; \\n\\n [bbe] And if she is married to a husband at the time when she is under an oath or an undertaking given without thought; \\n\\n 30:7 [hgb] 她 丈 夫 听 见 的 日 子 ， 却 向 她 默 默 不 言 ， 她 所 许 的 愿 并 约 束 自 己 的 话 就 都 要 为 定 。 \\n\\n [kjv] And her husband heard it, and held his peace at her in the day that he heard it: then her vows shall stand, and her bonds wherewith she bound her soul shall stand. \\n\\n [bbe] If her husband, hearing of it, says nothing to her at the time, then the oaths she made and the undertakings she gave will have force. \\n\\n 30:8 [hgb] 但 她 丈 夫 听 见 的 日 子 ， 若 不 应 承 ， 就 算 废 了 她 所 许 的 愿 和 她 出 口 约 束 自 己 的 冒 失 话 。 耶 和 华 也 必 赦 免 她 。 \\n\\n [kjv] But if her husband disallowed her on the day that he heard it; then he shall make her vow which she vowed, and that which she uttered with her lips, wherewith she bound her soul, of none effect: and the LORD shall forgive her. \\n\\n [bbe] But if her husband, hearing of it, makes her take it back, then the oath she made and the undertaking she gave without thought will have no force or effect, and she will have the Lord\u0027s forgiveness. \\n\\n 30:9 [hgb] 寡 妇 或 是 被 休 的 妇 人 所 许 的 愿 ， 就 是 她 约 束 自 己 的 话 ， 都 要 为 定 。 \\n\\n [kjv] But every vow of a widow, and of her that is divorced, wherewith they have bound their souls, shall stand against her. \\n\\n [bbe] But an oath made by a widow or one who is no longer married to her husband, and every undertaking she has given, will have force. \\n\\n 30:10 [hgb] 她 若 在 丈 夫 家 里 许 了 愿 或 起 了 誓 ， 约 束 自 己 ， \\n\\n [kjv] And if she vowed in her husband\u0027s house, or bound her soul by a bond with an oath; \\n\\n [bbe] If she made an oath while she was under the authority of her husband, \\n\\n 30:11 [hgb] 丈 夫 听 见 ， 却 向 她 默 默 不 言 ， 也 没 有 不 应 承 ， 她 所 许 的 愿 并 约 束 自 己 的 话 就 都 要 为 定 。 \\n\\n [kjv] And her husband heard it, and held his peace at her, and disallowed her not: then all her vows shall stand, and every bond wherewith she bound her soul shall stand. \\n\\n [bbe] And her husband, hearing of it, said nothing to her and did not put a stop to it, then all her oaths and every undertaking she gave will have force. \\n\\n 30:12 [hgb] 丈 夫 听 见 的 日 子 ， 若 把 这 两 样 全 废 了 ， 妇 人 口 中 所 许 的 愿 或 是 约 束 自 己 的 话 就 都 不 得 为 定 ， 因 她 丈 夫 已 经 把 这 两 样 废 了 。 耶 和 华 也 必 赦 免 她 。 \\n\\n [kjv] But if her husband hath utterly made them void on the day he heard them; then whatsoever proceeded out of her lips concerning her vows, or concerning the bond of her soul, shall not stand: her husband hath made them void; and the LORD shall forgive her. \\n\\n [bbe] But if her husband, on hearing of it, made them without force or effect, then whatever she has said about her oaths or her undertaking has no force: her husband has made them without effect, and she will have the Lord\u0027s forgiveness. \\n\\n 30:13 [hgb] 凡 她 所 许 的 愿 和 刻 苦 约 束 自 己 所 起 的 誓 ， 她 丈 夫 可 以 坚 定 ， 也 可 以 废 去 。 \\n\\n [kjv] Every vow, and every binding oath to afflict the soul, her husband may establish it, or her husband may make it void. \\n\\n [bbe] Every oath, and every undertaking which she gives, to keep herself from pleasure, may be supported or broken by her husband. \\n\\n 30:14 [hgb] 倘 若 她 丈 夫 天 天 向 她 默 默 不 言 ， 就 算 是 坚 定 她 所 许 的 愿 和 约 束 自 己 的 话 。 因 丈 夫 听 见 的 日 子 向 她 默 默 不 言 ， 就 使 这 两 样 坚 定 。 \\n\\n [kjv] But if her husband altogether hold his peace at her from day to day; then he establisheth all her vows, or all her bonds, which are upon her: he confirmeth them, because he held his peace at her in the day that he heard them. \\n\\n [bbe] But if the days go on, and her husband says nothing whatever to her, then he is giving the support of his authority to her oaths and undertakings, because at the time of hearing them he said nothing to her. \\n\\n 30:15 [hgb] 但 她 丈 夫 听 见 以 后 ， 若 使 这 两 样 全 废 了 ， 就 要 担 当 妇 人 的 罪 孽 。 \\n\\n [kjv] But if he shall any ways make them void after that he hath heard them; then he shall bear her iniquity. \\n\\n [bbe] But if at some time after hearing of them, he makes them without force, then he is responsible for her wrongdoing. \\n\\n 30:16 [hgb] 这 是 丈 夫 待 妻 子 ， 父 亲 待 女 儿 ， 女 儿 年 幼 ， 还 在 父 家 ， 耶 和 华 所 吩 咐 摩 西 的 律 例 。 \\n\\n [kjv] These are the statutes, which the LORD commanded Moses, between a man and his wife, between the father and his daughter, being yet in her youth in her father\u0027s house. \\n\\n [bbe] These are the laws which the Lord gave Moses in relation to a man and his wife, or a father and a young daughter who is under his authority. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/20/483.html","bookId":240,"book":{"id":240,"title":"Numbers民数记（双语小说）","description":"简介： And the LORD spake unto Moses in the wilderness of Sinai, in the tabernacle of the congregation, on the first day of the second month, in the second year after they were come out of the land of Egypt, saying； Take ye the sum of all the ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/20","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:53 AM"}}
