{"id":7320,"no":4,"title":"Chapter 4","content":"4:1 [hgb] 耶 和 华 晓 谕 摩 西 ， 亚 伦 说 ， \n [kjv] And the LORD spake unto Moses and unto Aaron, saying, \n [bbe] And the Lord said to Moses and Aaron, \n 4:2 [hgb] 你 从 利 未 人 中 ， 将 哥 辖 子 孙 的 总 数 ， 照 他 们 的 家 室 ， 宗 族 ， \n [kjv] Take the sum of the sons of Kohath from among the sons of Levi, after their families, by the house of their fathers, \n [bbe] Let the sons of Kohath, from among the sons of Levi, be numbered by their families, in the order of their fathers\u0027 houses; \n 4:3 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 办 事 的 ， 全 都 计 算 。 \n [kjv] From thirty years old and upward even until fifty years old, all that enter into the host, to do the work in the tabernacle of the congregation. \n [bbe] All those from thirty to fifty years old who are able to do the work of the Tent of meeting. \n 4:4 [hgb] 哥 辖 子 孙 在 会 幕 搬 运 至 圣 之 物 ， 所 办 的 事 乃 是 这 样 ， \n [kjv] This shall be the service of the sons of Kohath in the tabernacle of the congregation, about the most holy things: \n [bbe] And this is to be the work of the sons of Kohath in connection with the most holy things. \n 4:5 [hgb] 起 营 的 时 候 ， 亚 伦 和 他 儿 子 要 进 去 摘 下 遮 掩 柜 的 幔 子 ， 用 以 蒙 盖 法 柜 ， \n [kjv] And when the camp setteth forward, Aaron shall come, and his sons, and they shall take down the covering vail, and cover the ark of testimony with it: \n [bbe] When all the people go forward, Aaron is to go in with his sons, and take down the veil of the curtain, covering the ark of witness with it; \n 4:6 [hgb] 又 用 海 狗 皮 盖 在 上 头 ， 再 蒙 上 纯 蓝 色 的 毯 子 ， 把 杠 穿 上 。 \n [kjv] And shall put thereon the covering of badgers\u0027 skins, and shall spread over it a cloth wholly of blue, and shall put in the staves thereof. \n [bbe] And putting over it the leather cover and over that a blue cloth; and putting its rods in place. \n 4:7 [hgb] 又 用 蓝 色 毯 子 铺 在 陈 设 饼 的 桌 子 上 ， 将 盘 子 ， 调 羹 ， 奠 酒 的 爵 ， 和 杯 摆 在 上 头 。 桌 子 上 也 必 有 常 设 的 饼 。 \n [kjv] And upon the table of shewbread they shall spread a cloth of blue, and put thereon the dishes, and the spoons, and the bowls, and covers to cover withal: and the continual bread shall be thereon: \n [bbe] And on the table of the holy bread they are to put a blue cloth, and on it all the vessels, the spoons and the basins and the cups; and the holy bread with them; \n 4:8 [hgb] 在 其 上 又 要 蒙 朱 红 色 的 毯 子 ， 再 蒙 上 海 狗 皮 ， 把 杠 穿 上 。 \n [kjv] And they shall spread upon them a cloth of scarlet, and cover the same with a covering of badgers\u0027 skins, and shall put in the staves thereof. \n [bbe] And over them they are to put a red cloth, covering it with a leather cover, and putting its rods in their places. \n 4:9 [hgb] 要 拿 蓝 色 毯 子 ， 把 灯 台 和 灯 台 上 所 用 的 灯 盏 ， 剪 子 ， 蜡 花 盘 ， 并 一 切 盛 油 的 器 皿 ， 全 都 遮 盖 。 \n [kjv] And they shall take a cloth of blue, and cover the candlestick of the light, and his lamps, and his tongs, and his snuffdishes, and all the oil vessels thereof, wherewith they minister unto it: \n [bbe] And they are to take a blue cloth, covering with it the light-support with its lights and its instruments and its trays and all the oil vessels which are used for it: \n 4:10 [hgb] 又 要 把 灯 台 和 灯 台 的 一 切 器 具 包 在 海 狗 皮 里 ， 放 在 抬 架 上 。 \n [kjv] And they shall put it and all the vessels thereof within a covering of badgers\u0027 skins, and shall put it upon a bar. \n [bbe] All these they are to put in a leather cover, and put it on the frame. \n 4:11 [hgb] 在 金 坛 上 要 铺 蓝 色 毯 子 ， 蒙 上 海 狗 皮 ， 把 杠 穿 上 。 \n [kjv] And upon the golden altar they shall spread a cloth of blue, and cover it with a covering of badgers\u0027 skins, and shall put to the staves thereof: \n [bbe] On the gold altar they are to put a blue cloth, covering it with a leather cover; and they are to put its rods in their places. \n 4:12 [hgb] 又 要 把 圣 所 用 的 一 切 器 具 包 在 蓝 色 毯 子 里 ， 用 海 狗 皮 蒙 上 ， 放 在 抬 架 上 。 \n [kjv] And they shall take all the instruments of ministry, wherewith they minister in the sanctuary, and put them in a cloth of blue, and cover them with a covering of badgers\u0027 skins, and shall put them on a bar: \n [bbe] All the vessels which are used in the holy place they are to put in a blue cloth, covering them with a leather cover, and put them on the frame. \n 4:13 [hgb] 要 收 去 坛 上 的 灰 ， 把 紫 色 毯 子 铺 在 坛 上 。 \n [kjv] And they shall take away the ashes from the altar, and spread a purple cloth thereon: \n [bbe] And they are to take away the burned waste from the altar, and put a purple cloth on it; \n 4:14 [hgb] 又 要 把 所 用 的 一 切 器 具 ， 就 是 火 鼎 ， 肉 锸 子 ， 铲 子 ， 盘 子 ， 一 切 属 坛 的 器 具 都 摆 在 坛 上 ， 又 蒙 上 海 狗 皮 ， 把 杠 穿 上 。 \n [kjv] And they shall put upon it all the vessels thereof, wherewith they minister about it, even the censers, the fleshhooks, and the shovels, and the basons, all the vessels of the altar; and they shall spread upon it a covering of badgers\u0027 skins, and put to the staves of it. \n [bbe] Placing on the cloth all its vessels, the fire-baskets, the meat-hooks, the spades, and the basins; all the vessels of the altar; they are to put a leather cover over all these, and put its rods in their places. \n 4:15 [hgb] 将 要 起 营 的 时 候 ， 亚 伦 和 他 儿 子 把 圣 所 和 圣 所 的 一 切 器 具 遮 盖 完 了 ， 哥 辖 的 子 孙 就 要 来 抬 ， 只 是 不 可 摸 圣 物 ， 免 得 他 们 死 亡 。 会 幕 里 这 些 物 件 是 哥 辖 子 孙 所 当 抬 的 \n [kjv] And when Aaron and his sons have made an end of covering the sanctuary, and all the vessels of the sanctuary, as the camp is to set forward; after that, the sons of Kohath shall come to bear it: but they shall not touch any holy thing, lest they die. These things are the burden of the sons of Kohath in the tabernacle of the congregation. \n [bbe] And after the holy place and all its vessels have been covered up by Aaron and his sons, when the tents of the people go forward, the sons of Kohath are to come and take it up; but the holy things may not be touched by them for fear of death. \n 4:16 [hgb] 祭 司 亚 伦 的 儿 子 以 利 亚 撒 所 要 看 守 的 是 点 灯 的 油 与 香 料 ， 并 当 献 的 素 祭 和 膏 油 ， 也 要 看 守 全 帐 幕 与 其 中 所 有 的 ， 并 圣 所 和 圣 所 的 器 具 。 \n [kjv] And to the office of Eleazar the son of Aaron the priest pertaineth the oil for the light, and the sweet incense, and the daily meat offering, and the anointing oil, and the oversight of all the tabernacle, and of all that therein is, in the sanctuary, and in the vessels thereof. \n [bbe] And Eleazar, the son of Aaron the priest, is to be responsible for the oil for the light, and the sweet perfumes for burning, and the regular meal offering, and the holy oil; the House and the holy place and everything in it will be in his care. \n 4:17 [hgb] 耶 和 华 晓 谕 摩 西 ， 亚 伦 说 ， \n [kjv] And the LORD spake unto Moses and unto Aaron, saying, \n [bbe] And the Lord said to Moses and Aaron, \n 4:18 [hgb] 你 们 不 可 将 哥 辖 人 的 支 派 从 利 未 人 中 剪 除 。 \n [kjv] Cut ye not off the tribe of the families of the Kohathites from among the Levites: \n [bbe] Do not let the family of the Kohathites be cut off from among the Levites; \n 4:19 [hgb] 他 们 挨 近 至 圣 物 的 时 候 ， 亚 伦 和 他 儿 子 要 进 去 派 他 们 各 人 所 当 办 的 ， 所 当 抬 的 。 这 样 待 他 们 ， 好 使 他 们 活 着 ， 不 至 死 亡 。 \n [kjv] But thus do unto them, that they may live, and not die, when they approach unto the most holy things: Aaron and his sons shall go in, and appoint them every one to his service and to his burden: \n [bbe] But do this to them, so that life and not death may be theirs when they come near the most holy things; let Aaron and his sons go in and give to every one his work and that which he is to take up; \n 4:20 [hgb] 只 是 他 们 连 片 时 不 可 进 去 观 看 圣 所 ， 免 得 他 们 死 亡 。 \n [kjv] But they shall not go in to see when the holy things are covered, lest they die. \n [bbe] But they themselves are not to go in to see the holy place, even for a minute, for fear of death. \n 4:21 [hgb] 耶 和 华 晓 谕 摩 西 说 ， \n [kjv] And the LORD spake unto Moses, saying, \n [bbe] And the Lord said to Moses, \n 4:22 [hgb] 你 要 将 革 顺 子 孙 的 总 数 ， 照 着 宗 族 ， 家 室 ， \n [kjv] Take also the sum of the sons of Gershon, throughout the houses of their fathers, by their families; \n [bbe] Let the sons of Gershon be numbered by families, in the order of their fathers\u0027 houses; \n 4:23 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 办 事 的 ， 全 都 数 点 。 \n [kjv] From thirty years old and upward until fifty years old shalt thou number them; all that enter in to perform the service, to do the work in the tabernacle of the congregation. \n [bbe] All those from thirty to fifty years old who are able to do the work of the Tent of meeting. \n 4:24 [hgb] 革 顺 人 各 族 所 办 的 事 ， 所 抬 的 物 乃 是 这 样 ， \n [kjv] This is the service of the families of the Gershonites, to serve, and for burdens: \n [bbe] This is to be the work of the Gershonites, the things they are to do and take up. \n 4:25 [hgb] 他 们 要 抬 帐 幕 的 幔 子 和 会 幕 ， 并 会 幕 的 盖 与 其 上 的 海 狗 皮 ， 和 会 幕 的 门 帘 ， \n [kjv] And they shall bear the curtains of the tabernacle, and the tabernacle of the congregation, his covering, and the covering of the badgers\u0027 skins that is above upon it, and the hanging for the door of the tabernacle of the congregation, \n [bbe] They are to take up the curtains of the House, and the Tent of meeting with its cover and the leather cover over it, and the hangings for the door of the Tent of meeting; \n 4:26 [hgb] 院 子 的 帷 子 和 门 帘 （ 院 子 是 围 帐 幕 和 坛 的 ） ， 绳 子 ， 并 所 用 的 器 具 ， 不 论 是 作 什 么 用 的 ， 他 们 都 要 经 理 。 \n [kjv] And the hangings of the court, and the hanging for the door of the gate of the court, which is by the tabernacle and by the altar round about, and their cords, and all the instruments of their service, and all that is made for them: so shall they serve. \n [bbe] And the hangings for the open space round the House and the altar, and the curtain for its doorway, with the cords and all the things used for them; whatever is necessary for these, they are to do. \n 4:27 [hgb] 革 顺 的 子 孙 在 一 切 抬 物 办 事 之 上 都 要 凭 亚 伦 和 他 儿 子 的 吩 咐 。 他 们 所 当 抬 的 ， 要 派 他 们 看 守 。 \n [kjv] At the appointment of Aaron and his sons shall be all the service of the sons of the Gershonites, in all their burdens, and in all their service: and ye shall appoint unto them in charge all their burdens. \n [bbe] From the mouth of Aaron and his sons the Gershonites will have word about all the things they are to do and take up; you are to give them their orders. \n 4:28 [hgb] 这 是 革 顺 子 孙 的 各 族 在 会 幕 里 所 办 的 事 。 他 们 所 看 守 的 ， 必 在 祭 司 亚 伦 儿 子 以 他 玛 的 手 下 。 \n [kjv] This is the service of the families of the sons of Gershon in the tabernacle of the congregation: and their charge shall be under the hand of Ithamar the son of Aaron the priest. \n [bbe] This is the work of the family of the Gershonites in the Tent of meeting, and they will be under the direction of Ithamar, the son of Aaron the priest. \n 4:29 [hgb] 至 于 米 拉 利 的 子 孙 ， 你 要 照 着 家 室 ， 宗 族 把 他 们 数 点 。 \n [kjv] As for the sons of Merari, thou shalt number them after their families, by the house of their fathers; \n [bbe] The sons of Merari are to be numbered by families, in the order of their fathers\u0027 houses; \n 4:30 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 办 事 的 ， 你 都 要 数 点 。 \n [kjv] From thirty years old and upward even unto fifty years old shalt thou number them, every one that entereth into the service, to do the work of the tabernacle of the congregation. \n [bbe] Every one from thirty to fifty years old who is able to do the work of the Tent of meeting. \n 4:31 [hgb] 他 们 办 理 会 幕 的 事 ， 就 是 抬 帐 幕 的 板 ， 闩 ， 柱 子 ， 和 带 卯 的 座 ， \n [kjv] And this is the charge of their burden, according to all their service in the tabernacle of the congregation; the boards of the tabernacle, and the bars thereof, and the pillars thereof, and sockets thereof, \n [bbe] And this is their part in the work of the Tent of meeting: the transport of the boards and the rods of the Tent, with the pillars and their bases; \n 4:32 [hgb] 院 子 四 围 的 柱 子 和 其 上 带 卯 的 座 ， 橛 子 ， 绳 子 ， 并 一 切 使 用 的 器 具 。 他 们 所 抬 的 器 具 ， 你 们 要 按 名 指 定 。 \n [kjv] And the pillars of the court round about, and their sockets, and their pins, and their cords, with all their instruments, and with all their service: and by name ye shall reckon the instruments of the charge of their burden. \n [bbe] And the pillars of the open space outside it, with their bases and their nails and cords and all the instruments used, and everything which has to be done there; all the instruments for which they are responsible are to be numbered by name. \n 4:33 [hgb] 这 是 米 拉 利 子 孙 各 族 在 会 幕 里 所 办 的 事 ， 都 在 祭 司 亚 伦 儿 子 以 他 玛 的 手 下 。 \n [kjv] This is the service of the families of the sons of Merari, according to all their service, in the tabernacle of the congregation, under the hand of Ithamar the son of Aaron the priest. \n [bbe] This is the work which the sons of Merari are to do in connection with the Tent of meeting, under the direction of Ithamar, the son of Aaron the priest. \n 4:34 [hgb] 摩 西 ， 亚 伦 与 会 众 的 诸 首 领 将 哥 辖 的 子 孙 ， 照 着 家 室 ， 宗 族 ， \n [kjv] And Moses and Aaron and the chief of the congregation numbered the sons of the Kohathites after their families, and after the house of their fathers, \n [bbe] So Moses and Aaron and the chiefs of the people took in hand the numbering of the sons of the Kohathites, by families, in the order of their fathers\u0027 houses; \n 4:35 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 办 事 的 ， 都 数 点 了 。 \n [kjv] From thirty years old and upward even unto fifty years old, every one that entereth into the service, for the work in the tabernacle of the congregation: \n [bbe] Numbering all those from thirty to fifty years old who were able to do the work in the Tent of meeting; \n 4:36 [hgb] 被 数 的 共 有 二 千 七 百 五 十 名 。 \n [kjv] And those that were numbered of them by their families were two thousand seven hundred and fifty. \n [bbe] And the number of all these was two thousand, seven hundred and fifty. \n 4:37 [hgb] 这 是 哥 辖 各 族 中 被 数 的 ， 是 在 会 幕 里 办 事 的 ， 就 是 摩 西 ， 亚 伦 照 耶 和 华 借 摩 西 所 吩 咐 数 点 的 。 \n [kjv] These were they that were numbered of the families of the Kohathites, all that might do service in the tabernacle of the congregation, which Moses and Aaron did number according to the commandment of the LORD by the hand of Moses. \n [bbe] This is the number of those of the Kohathites who did the work in the Tent of meeting, as they were numbered by Moses and Aaron at the order of the Lord. \n 4:38 [hgb] 革 顺 子 孙 被 数 的 ， 照 着 家 室 ， 宗 族 ， \n [kjv] And those that were numbered of the sons of Gershon, throughout their families, and by the house of their fathers, \n [bbe] And those of the sons of Gershon who were numbered by families, \n 4:39 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 办 事 的 ， 共 有 二 千 六 百 三 十 名 。 \n [kjv] From thirty years old and upward even unto fifty years old, every one that entereth into the service, for the work in the tabernacle of the congregation, \n [bbe] All those from thirty to fifty years old who were able to do the work in the Tent of meeting, \n 4:40 [hgb] \n [kjv] Even those that were numbered of them, throughout their families, by the house of their fathers, were two thousand and six hundred and thirty. \n [bbe] Who were numbered by families in the order of their fathers\u0027 houses, were two thousand, six hundred and thirty. \n 4:41 [hgb] 这 是 革 顺 子 孙 各 族 中 被 数 的 ， 是 在 会 幕 里 办 事 的 ， 就 是 摩 西 ， 亚 伦 照 耶 和 华 借 摩 西 所 吩 咐 数 点 的 。 \n [kjv] These are they that were numbered of the families of the sons of Gershon, of all that might do service in the tabernacle of the congregation, whom Moses and Aaron did number according to the commandment of the LORD. \n [bbe] This is the number of the sons of Gershon who did the work in the Tent of meeting, as they were numbered by Moses and Aaron at the order of the Lord. \n 4:42 [hgb] 米 拉 利 子 孙 中 各 族 被 数 的 ， 照 着 家 室 ， 宗 族 ， \n [kjv] And those that were numbered of the families of the sons of Merari, throughout their families, by the house of their fathers, \n [bbe] And those of the sons of Merari who were numbered by families, in the order of their fathers\u0027 houses, \n 4:43 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 办 事 的 ， 共 有 三 千 二 百 名 。 \n [kjv] From thirty years old and upward even unto fifty years old, every one that entereth into the service, for the work in the tabernacle of the congregation, \n [bbe] All those from thirty to fifty years old who did the work in the Tent of meeting, \n 4:44 [hgb] \n [kjv] Even those that were numbered of them after their families, were three thousand and two hundred. \n [bbe] Who were numbered by families, were three thousand, two hundred. \n 4:45 [hgb] 这 是 米 拉 利 子 孙 各 族 中 被 数 的 ， 就 是 摩 西 ， 亚 伦 照 耶 和 华 借 摩 西 所 吩 咐 数 点 的 。 \n [kjv] These be those that were numbered of the families of the sons of Merari, whom Moses and Aaron numbered according to the word of the LORD by the hand of Moses. \n [bbe] This is the number of the sons of Merari, numbered by Moses and Aaron at the order of the Lord. \n 4:46 [hgb] 凡 被 数 的 利 未 人 ， 就 是 摩 西 ， 亚 伦 并 以 色 列 众 首 领 ， 照 着 家 室 ， 宗 族 所 数 点 的 ， \n [kjv] All those that were numbered of the Levites, whom Moses and Aaron and the chief of Israel numbered, after their families, and after the house of their fathers, \n [bbe] And all the Levites who were numbered by Moses and Aaron and the chiefs of the people, by families, in the order of their fathers\u0027 houses, \n 4:47 [hgb] 从 三 十 岁 直 到 五 十 岁 ， 凡 前 来 任 职 ， 在 会 幕 里 作 抬 物 之 工 的 ， 共 有 八 千 五 百 八 十 名 。 \n [kjv] From thirty years old and upward even unto fifty years old, every one that came to do the service of the ministry, and the service of the burden in the tabernacle of the congregation, \n [bbe] Those from thirty to fifty years old who were able to do the work of the Tent of meeting and of its transport, \n 4:48 [hgb] \n [kjv] Even those that were numbered of them, were eight thousand and five hundred and fourscore. \n [bbe] Came to eight thousand, five hundred and eighty. \n 4:49 [hgb] 摩 西 按 他 们 所 办 的 事 ， 所 抬 的 物 ， 凭 耶 和 华 的 吩 咐 数 点 他 们 。 他 们 这 样 被 摩 西 数 点 ， 正 如 耶 和 华 所 吩 咐 他 的 。 \n [kjv] According to the commandment of the LORD they were numbered by the hand of Moses, every one according to his service, and according to his burden: thus were they numbered of him, as the LORD commanded Moses. \n [bbe] At the order of the Lord they were numbered by Moses, every one in relation to his work and to his part in the transport; so they were numbered by Moses at the order of the Lord. \n \n","sourceLink":"http://novel.tingroom.com/zongjiao/20/338.html","bookId":240,"book":{"id":240,"title":"Numbers民数记（双语小说）","description":"简介： And the LORD spake unto Moses in the wilderness of Sinai, in the tabernacle of the congregation, on the first day of the second month, in the second year after they were come out of the land of Egypt, saying； Take ye the sum of all the ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/20","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:53 AM"}}
