{"id":20288,"no":18,"title":"CHAPTER XVII. — CAUGHT IN A TRAP.","content":"So much had passed between the first visit of the Scudamores to Madrid as Spanish peasant boys, and their second entry as captains upon Lord Wellington\u0027s staff, that they had scarcely given a thought to the dangers they had at that time run, or to the deadly hatred with which they had inspired the guerilla chief Nunez. When they first rode into the town, indeed, they had spoken of it one to the other, and had agreed that it would be pleasant to be able to walk through the streets without fear of assassination; for even, as Tom said, if the scoundrel had any of his band there, they would not be likely to recognize them in their uniforms. One evening, however, when they had been in Madrid about a fortnight, an incident happened which caused them to doubt whether their security from the hatred of the guerilla was as complete as they had fancied. They were sitting with a number of other officers in a large café in the Puerta del Sol, the principal square in Madrid, when a girl came round begging; instead of holding out her hand silently with a murmur for charity in the name of the holy Virgin, she began a long story, poured out in rapid language. Several of the officers present knew more or less Spanish, but they were unable to follow her quick utterances, and one of them said laughingly, \"Scudamore, this is a case for you, she is beyond us altogether.\" The girl followed the direction of the speaker\u0027s eye, and moved across to the brothers, who happened to be sitting next to each other, and began her story again. It was a complicated tale of French oppression, and the boys, interrupting her here and there to ask for details, talked with her for some minutes. \"I believe she is lying,\" Tom said, in English, \"she tells her story as if she had learned it by heart, and gets confused whenever we cross-question her; there, give her a few coppers, I am out of change.\" As Peter put his hand into his pocket for the money, Tom glanced up sharply at the girl. She was not, as might have been expected, watching Peter\u0027s movements with interest, but was looking inquiringly at some one in the crowd of promenaders. Tom followed her glance, and saw a peasant, standing half-hidden behind a group of passers, nod to her, and motion her to come to him. She waited until Peter put the coins into her hand; then, with a brief word of thanks, she moved away into the crowd. \"Peter, I believe those scoundrels are up to their old game, and that we are watched. Once or twice since we have been sitting here I have noticed a heavy-looking fellow glance at us very closely as he passed, and I just saw the same fellow, who was evidently hiding from observation, nod to that girl, and beckon her away.\" \"Her story was a lie from beginning to end,\" Peter said, \"and it is quite possible that it was a got-up thing, on purpose to see whether we could talk Spanish well. I don\u0027t think any one could swear to us who only saw us then; but the fact of our speaking Spanish so well would go a long way towards settling the point in the mind of any one who suspected us!\" \"We must be careful in future, Peter, and avoid quiet streets after dark, and keep a sharp look-out at all times, or we shall get a knife between our ribs, as sure as fate.\" Time, however, passed on without anything occurring to give any support to their suspicion, they could not discover that they were being watched, or their footsteps dogged. They, nevertheless, continued to be, to a certain extent, upon their guard after dark; in the daytime the number of English soldiers about the streets was so large that there was very little danger of any attack. On the evening before the army marched for Burgos, Tom, whose turn it was for duty at head-quarters, received a despatch, to carry to one of the generals of division encamped a mile or two out of the town. He did not need to go round to his quarters, as his horse was standing saddled in readiness in the courtyard. He was but an hour away, and, as he knew that he would not be farther required, he rode round to the house where he was quartered. His orderly came forward at his shout, and took his horse, and he mounted the broad stairs of the house, which was a very handsome one, and rang at the door on the second floor; for in Spain, as indeed almost all over the Continent, each floor is a separate dwelling. Sam opened it. \"Nothing new, Sam?\" \"No, sar, nothing new.\" Tom passed through the sitting-room, and entered Peter\u0027s bedroom. It was in darkness. \"Asleep, old man?\" he asked. There was no answer. He came back into the sitting room, where two lamps were burning, and looked at his watch. \"Half-past eleven. He is off to bed early. Sam, bring me some supper if you have got anything, I am hungry.\" Sam came in, in a minute, with a small tray. \"How long has my brother been gone to bed?\" \"Me did not know he gone to bed at all,\" Sam said, in surprise. \"Me thought Massa Peter been reading book.\" Tom took up a light, and went into the bedroom, it was empty. \"Sam, there\u0027s something wrong here!\" Tom said sharply, for a sudden sensation of alarm seized him. \"Peter is not here.\" Sam came into the bedroom, and looked round in astonishment. \"What become of him?\" he said. \"Where de debil he got to?\" \"That\u0027s what I want to know, Sam. Now, then, just give all your attention. What time did he come in?\" \"He came in at about nine o\u0027clock, sar, with three other officers, Captain Farquharson, Major Heriot, and Captain Brown. Dey have bottle wine, and sit here and smoke. Well, Massa Tom, Sam sit in his room, and smoke him pipe, and he doze off a little; after a bit, may be ten o\u0027clock, Sam hear dem move, and go to door; they were saying good-night, when Massa Peter said, \u0027I will just go down to see that the horses are all right.\u0027 Den dey all go down togeder.\" \"Did they shut the door?\" Tom asked. \"No, Massa Tom, dey did not shut de door, because, a little while after, Sam, he wake up wid little start; he hear de door bang, and \u0027spose Massa Peter come back. Sam go off to sleep again till you ring bell.\" Tom looked very grave. \"What can Peter have gone off with Farquharson at this time of night for?\" Then he looked round the room, and said, almost with a cry, \"Sam, look there, there are his cap and sword. He has not gone out with the others at all. What can have happened?\" Tom first glanced into his own room, and then ran downstairs in haste, followed by Sam, who was now also thoroughly alarmed. The orderly had just made the horse comfortable for the night, and was leaving the stable. \"Johnstone, when did you see my brother?\" \"Well, it may be an hour, or an hour and a half back, sir. He came down with some other officers; I did not see them, but I heard them talking for a minute or two before he came in to look at the horses, and he asked if they were all right, and said they must be saddled by half-past five, and then he went up again—at least, I suppose he went up, for he had not got his cap on. Is anything wrong, sir?\" \"I don\u0027t know, I am afraid to think,\" Tom said, in a dazed way. \"He is not upstairs; he has not gone out; what can have become of him?\" He stood quiet for a minute or two, and then, with a great effort, brought his thoughts within control again. \"The first thing is to assure ourselves whether he returned upstairs. Sam, fetch a lamp, the stairs are not lighted, and I want to examine them.\" Sam soon returned with the lamp, and Tom, beginning at the street door, examined every step carefully all the way up, Sam and the soldier following him. \"There has been no scuffle on the stairs,\" he said; then he went through the little hall into the sitting-room again. Nothing appeared to have been disturbed. Then he looked at the floor, which was of polished oak, and knelt down to examine it more closely. \"There have been men with dirty shoes standing here,\" he cried. \"Do you see the marks on each side of the door, and there, do you see that scratch and that? There has been a scuffle. Good heavens! what has taken place here?\" Sam\u0027s face was pale with apprehension that something had happened to Peter; but, he said, \"How dat be, Massa Tom, with Sam in the next room all the time?\" Tom made no reply; but was closely examining the floor—back across the hall. \"There is a mark; there is another,\" he said, \"not made by boots, but by their native sandals.\" Then he went out from the door, and up the next flight of stairs. \"There,\" he said, \"just as I thought.\" Just round the angle of the stairs two steps were dirty and stained, as if dirty feet had been trampling upon them for some time. \"I suppose they knew I was out, and watched here, for hours, perhaps. Then, when Peter went down, they slipped in through the open door, and then\"—without completing the sentence, Tom went back into the room, and threw himself into a chair in tearless despair. Sam sobbed loudly. For some time there was silence. \"There is no blood, sir, that I can see, not a speck,\" the orderly said. \"They can\u0027t have killed Captain Scudamore, and, if they had, why should they have carried his body away?\" This was the question Tom had been asking himself. Assassinations were, in Madrid, every-day occurrences, and that Peter and he were especially liable to be murdered, owing to the hatred of Nunez and his gang, was clear; but, so far as he could see, not a drop of blood had been shed here. Presently Sam began to sob more loudly. \"Dis break my heart, Massa Tom, to tink dat Sam be next door all de time, and, instead of watching, he sleep so sound dat Massa Peter carried straight away.\" \"You are not to blame, Sam, there was, probably, no noise whatever. But, what can it all mean? Johnstone, you had better go to bed, you can do no good now. Sam, give me my pistols; take that big stick of yours, and come round with me to head-quarters, we will call in at Captain Farquharson\u0027s on the way.\" That officer, on being roused, and made to understand what was the matter, confirmed the account given by the orderly; he and his companions had parted at the street door, and Peter had gone down the yard to the stable. \"It is clear that Peter has been carried off,\" Tom said, \"and I have not the least doubt that it has been done by some of the band of Nunez. As you have heard me say, they owe us a grudge, and have, no doubt, been on the look-out ever since we came here. We have been on guard, and never gave them a chance, and, I suppose, they got desperate when they found the army was moving again, and so carried out this audacious plan.\" \"If your brother had been found murdered I should understand it,\" Captain Farquharson said; \"but, what on earth did they carry him off for?\" Tom was silent for a minute. \"That fiend, Nunez, would have had us stabbed if he could do nothing else; but he would, if I judge him rightly, be really contented with nothing short of putting us to death himself in some horrible manner. My own idea is, that Peter is hidden away somewhere near, will be kept in concealment until the road is clear, and will then be taken to Nunez. I must go off and try and save him at all hazards.\" Captain Farquharson was silent, while Tom walked up and down the room thoughtfully. \"I don\u0027t suppose the chief would refuse me leave,\" Tom said. \"If he does, I must throw up my commission.\" \"No, no; you are sure to get leave for such a thing as this, but the difficulty of the affair will be to know how to proceed. The country will swarm with French, the guerillas are sure to keep a sharp look-out, and if you find him, how are you going to rescue him?\" \"I don\u0027t know,\" Tom said, \"but it\u0027s got to be done; that\u0027s clear. I can\u0027t set out as a Spanish peasant,\" he went on after a pause. \"They know me as that now. At least, if I do I must get up as an old man and change my appearance. I might go as a woman, but I am too tall in the first place, and then women don\u0027t go wandering over the country in such times as this. But there, I have time to think it over before morning. I suppose the general will be moving about five o\u0027clock; I will see him the first thing, and tell him the whole story. Good-night.\" And so Tom went back to his quarters, and sat thinking deeply until morning, while Sam sat gloomily in his little room, sometimes with tears rolling down his cheeks, sometimes muttering terrible threats against the guerillas, at other times cursing himself for having been asleep instead of watching over his young master\u0027s safety. Tom had briefly told him that he intended to get leave in order to search for Peter. At daybreak, when he heard Tom moving, he went into the sitting-room. \"Look here, Massa Tom, Sam only one word to say. He going to look for Massa Peter. Sam know dat him color berry spicuous, dat people look at him and tink he de debil. Sam don\u0027t spect he going wid you. Dat wouldn\u0027t do. Dese fellows watch him, know dat black fellow here. Only Sam go somehow. He trabel night, hide up at day time. He join you de last ting when you go to mash up dem guerillas like squash. Anyhow, Sam must go. If can get leave, berry well, if not he desert. Anyhow he go, dat sartin. Sam kill himself if he stay behind.\" Tom had already thought over this. He was sure that the faithful negro would not remain behind, but he had seen that his companionship would be fatal. He had, therefore, formed some plan in his head similar to that which Sam proposed, and he knew that when the moment for action came his courage, strength, and devotion would be invaluable. \"You shall go, Sam,\" he said, holding out his hand to his attached follower. \"As you say, you can\u0027t go with me, but you shall go somehow.\" \"Thank you, Massa Tom,\" the negro said gratefully, \"You berry sure if Massa Peter die Sam die too.\" Tom now went to head-quarters, and found that Lord Wellington was just up. Sending in to say that he wished to speak with him for a few minutes on a matter of urgent personal importance, he was admitted, and related as concisely as he could Peter\u0027s disappearance, and told the story of the affair with the guerillas, which accounted for the intense desire for vengeance on the part of Nunez. He ended by asking for leave of absence. The general heard him to the end, asking a brief question here and there. \"You can have the leave certainly, Captain Scudamore, I know that it is needless for me to point out the risks that you will run, both from the French and guerillas. I think that it might be an advantage if I give you a note which you can, in case of absolute necessity, show to any French officer.\" So saying, the general sat down and wrote as follows:— \"To the French officer commanding.—The Earl of Wellington, commander-in-chief of His Britannic Majesty\u0027s forces in Spain, gives his assurance that the bearer of this, Captain Scudamore, although not in English uniform, is not engaged upon any mission connected with the army, or to obtain information respecting the strength and position of the French forces. His business is entirely private, and he is engaged in an attempt to discover and rescue a brother who has been carried off by the guerilla chief Nunez in order to gratify private vengeance. The Earl of Wellington, confiding in the natural courtesy of the French nation, trusts that officers of that service will, if applied to, assist Captain Scudamore in any way in their power, and he will feel personally obliged to them by their so doing.\" Tom expressed his deep gratitude for this, which might, he foresaw, be of inestimable advantage to him. \"I am taking my servant with me, sir—the negro; he will not travel with me by day, but will join me wherever I tell him; he is very strong and brave, and is deeply attached to us.\" \"Yes, I remember,\" the general said; \"that is the man whose life you saved. Do you leave at once?\" \"No, sir; I am thinking of riding with you to-morrow at any rate. The route lies on the way I have to go, and I am sure to be watched here.\" \"Very well,\" the general said; \"I wish you good fortune; but you have a difficult, almost a desperate, service before you.\" Upon leaving head-quarters, Tom again called on Captain Farquharson. \"Farquharson, I hear that it will be eleven before the chief leaves. I wish you would go to that little shop opposite the opera-house; they have got wigs and all that sort of thing there. Please get me two old men\u0027s wigs and beards, and one set of those mutton-chop shaped whiskers, and a woman\u0027s wig. I haven\u0027t made up my mind yet what I am going to wear, but I want these things to choose from. I am sure to be watched, and if I were to go there they would find out, five minutes afterwards, what I had bought. In the meantime I am going to the head of the police to give notice of Peter\u0027s disappearance, and to ask him to have the carts leaving the town for the next few days searched. I have no doubt the fellows will outwit the police, but it\u0027s no use throwing away a chance.\" It was six days after this that an old man, with long white hair and gray beard, and with a box containing cheap trinkets, beads, necklaces, earrings, knives, scissors, and other like articles, was sitting at the junction of two roads near the lower slopes of the Pyrenees, some twenty miles north of Vittoria. He had one of his sandals off, and appeared to have just risen from a bed of leaves in the forest behind him. The dawn had broken, but it was still twilight. Presently he heard a footstep coming along the road, and at once applied himself to wrapping the bandages, which serve for stockings to the Spanish peasant, round his leg, looking eagerly from under his wide sombrero to see who was approaching. As the new-comer came in sight, the pedlar at once ceased his employment and rose to meet him. He had recognized the figure, but the face was hidden, the Spanish cloak, worn as is usual by peasant and noble alike, with one end thrown over the shoulder, hiding the chin and lower part of the face, while the wide felt hat, pressed well down in front, allowed scarcely a glimpse even of the nose. That, however, would have been sufficient in the present case, for the man was a negro. Upon seeing the pedlar rise, he ran forward to meet him. \"Ah, Massa Tom, tank de Lord me find you safe and sound. I always keep on tinking you taken prisoner or killed eider by de French or de robbers—one as bad as de oder.\" \"I have thought the same of you, Sam, for your risk has been far greater than mine. Well, thank God, it is all right thus far. But come back into the wood, I have got some food there, and here any one might come along.\" They were soon deep in the wood, where, by a pile of grass and leaves which had evidently been used as a bed, was an open wallet, with some bread, cheese, cold meat and a small skin of wine. \"Are you hungry, Sam?\" \"Downright starving, sar; dis chile eat noting for two days.\" \"Why, how is that, Sam; you had six days\u0027 provision with you when you started?\" \"Dat true enough, sar, but Sam\u0027s appetite bigger than usual, noting to do all day sitting in de woods, waiting for night to come so as to go on again; so had to eat, and de food all went before Sam thought dat dere was two more days before he meet you.\" \"Well, sit down now, Sam, and eat away; we have plenty of time.\" They had much to tell each other. They had traveled by the same road, one by night, the other by day—Sam passing the days sleeping in the woods, his master traveling by day and at night sleeping in wretched village posadas. He, too, would far rather have slept in the woods, for the insects and filth made sleep almost impossible in these places, besides which he ran a good deal of risk as to the discovery of his disguise. He had, however, chosen the inns in hopes of hearing something which might give him a clue as to the object of his search. The only information, which he had gained was to the effect that Nunez still had his quarters at the old place. He had been driven out of it, and the village had been burned by the French, but the position was a convenient one, and the houses had been cleared and roughly roofed with boughs of trees and straw, and the band was still there. This much was satisfactory, and he could hardly have expected to learn more, unless he had happened to meet some of the members of the band itself. They had not traveled by the main road, as upon that large forces of the French were collected; and even if Tom could have passed through, boldly, Sam could not have made his way. Even by the road they had chosen Tom had met several bodies of French, while at Vittoria a very large force was assembling, destined for the relief of Burgos. Sam had but few incidents to relate. He had been carefully instructed by Tom before starting as to the road he should take, and the position and distances apart of the towns and villages upon it. He had traveled only at night, and had but once or twice exchanged a word with passers by. People did not travel much at night in so disturbed a country, and when Sam heard a foot-passenger approaching, or, as was more frequently the case, a party of French cavalry, he left the road and lay down, until they had passed. The one or two foot-passengers he had met suddenly he had passed with the usual Spanish muttered salutation, and the darkness and the disguise prevented any recognition of his color. \"Now, sar,\" Sam said, when they had finished breakfast, \"what am to be done next?\" \"I do not think, Sam, that the party who have got Peter have arrived yet. They could only have started on the day that we did; they have as long a road to go, and most likely they have got a bullock-cart, which won\u0027t travel more than fifteen miles a day at the outside. They have got Peter in a cart covered up with something, we may be sure. I don\u0027t think they will be here for another day or so at the earliest. If we knew what sort of cart it was, we could attack them on the way if there are not too many of them; but unfortunately we don\u0027t know that; and as there are three or four roads up to the village, and they are sure to make a detour, we don\u0027t know which they will come by. I hope to learn at the village. We will stay where we are till dark, then we will push on; it is only a couple of miles or so from here. I will steal into the place after dark, and try and overhear what is going on. You shall remain at a point where you can see down into the village and can hear a shout. I will give you this letter of Lord Wellington, and if you hear a pistol shot and hear me shout \u0027Sam!\u0027 you will know I am caught, and must make off as hard as you can to that small town in the plain, where there is a French garrison; ask for the commanding-officer, show this letter, and offer to guide them so as to surprise Nunez and his band. That is our sole chance. But I don\u0027t think there is much risk of being caught. I shall be very careful, you may rely upon it; and as I know the position of the house, I shall be able to make my way about. Once night has fallen they go off to bed; and even if I walked boldly about the place I should likely enough meet no one all night.\" That evening Tom entered the village as soon as it was fairly dark. He knew, from his former experience, that sentries were always placed at points whence they could get a view of the roads, and he made his way so as to avoid any risk of observation by them; but when he reached a place whence he could in turn view the posts of the watchers, he found that they were deserted, and concluded that the brigands had become careless, from the belief that, now the French had once destroyed the village, they would not be likely to come up to search for them there a second time; besides which, they might reckon that the French had their hands much too full with the advance of the Allied Army to spare either men or time in raids upon the guerillas. In this particular, indeed, they would have argued wrongly, for the French during the whole war, however much they were pressed by Wellington, always kept sufficient forces in hand to scatter the guerillas as fast as they become formidable. Tom had now taken off his beard and wig, and had put on the small whisker, which is the general fashion of wearing the hair throughout Spain. Thus he trusted, if surprised in the dark, to pass as one of the band. So quiet was the village when he entered, that he at first thought it was deserted; at last, however, he saw a light in one of the houses in the center of the village. Approaching carefully and noiselessly he saw a group of five men sitting and drinking round a fire made on the ground, in the center of one of the windowless rooms, the smoke finding its way out through the roof. \"I tell you,\" one said, \"I am getting sick of this life; I am ready to go and kill the French, but to be left up here, where there is nothing to do, no one to talk to, not a roof to cover one; bah! I am sick of it. But Nunez will be back in three days, and we shall be merry enough then.\" \"Not we,\" another said, \"this was a pleasant village in the old days, what is it now? There are no women, not even old mother Morena, who used to cook well, if she was free of her tongue. There is not even a priest now to shrive us if one is brought in to die.\" \"Nunez will come back in a good temper if it is true what Lope said yesterday when he came through, that the lads at Madrid had got one of those English boys who made a fool of him two years ago. That was a go. Demonio! but it was a fine thing. If it is true that they have got him and are bringing him here I would not be in his skin for all the treasures of King Joseph. Yes, Nunez was always a devil, but he is worse now. Somehow we always have bad luck, and the band gets smaller and smaller, I don\u0027t suppose there\u0027s above fifty with him now. I expect we shall have them pretty well all here this week.\" \"No fear of a visit from the French?\" \"None; Reynier at Vittoria is busy now in sending every man he can spare forward to the army that\u0027s gathering near Burgos.\" This was enough for Tom, who stole silently away to the spot where Sam was anxiously awaiting him. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3164/86834.html","bookId":870,"book":{"id":870,"title":"The Young Buglers","description":"简介： Had any of the boys in the lower forms of Eton in the year 1808, been asked who were the most popular boys of their own age, they would have been almost sure to have answered, without the slightest hesitation, Tom and Peter Scudamore, and yet it is p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3164","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
