{"id":20274,"no":4,"title":"CHAPTER III. — ENLISTED.","content":"It was a bright moonlight night when the boys, after a sad farewell from Rhoda, let themselves down from the window, and started upon their journey. Each carried a bundle on a stick; each bundle contained a suit of clothes, a few shirts and stockings, a pair of shoes, and a pistol. The other pistols were carried loaded inside their jackets, for there was no saying whom they might meet upon the road. They had put on the oldest suit of clothes they possessed, so as to attract as little attention as possible by the way. After they had once recovered from their parting with Rhoda their spirits rose, and they tramped along lightly and cheerfully. It was eleven o\u0027clock when they started, and through the night they did not meet a single person. Towards morning they got under a haystack near the road, and slept for some hours; then they walked steadily on until they had done twenty miles since their start. They went into a small inn, and had some breakfast, and then purchasing some bread and cold ham, went on through the town, and leaving the London road, followed that leading to Portsmouth, and after a mile or two again took up their quarters until evening, in a haystack. It is not necessary to give the details of the journey to Portsmouth. After the first two days\u0027 tramp, having no longer any fear of the pursuit, which, no doubt, had been made for them when first missed, they walked by day, and slept at night in sheds, or under haystacks, as they were afraid of being questioned and perhaps stopped at inns. They walked only short distances now, for the first night\u0027s long journey had galled their feet, and, as Tom said, they were not pressed for time, and did not want to arrive at Portsmouth like two limping tramps. Walking, therefore, only twelve miles a day after the first two days, they arrived at Portsmouth fresh and in high spirits. They had met with no adventures upon the road, except that upon one occasion two tramps had attempted to seize their bundles, but the production of the pistols, and the evident determination of the boys to use them if necessary, made the men abandon their intention and make off, with much bad language and many threats, at which the boys laughed disdainfully. Arrived at Portsmouth, their first care was to find a quiet little inn, where they could put up. This they had little difficulty in doing, for Portsmouth abounded with public-houses, and people were so much accustomed to young fellows tramping in with their bundles, to join their ships, that their appearance excited no curiosity whatever. Tom looked older than he really was, although not tall for his age, while Peter, if anything, overtopped his brother, but was slighter, and looked fully two years younger. Refreshed by a long night\u0027s sleep between sheets, they started out after breakfast to see the town, and were greatly impressed and delighted by the bustle of the streets, full of soldiers and sailors, and still more by the fortifications and the numerous ships of war lying in the harbor, or out at Spithead. A large fleet of merchantmen was lying off at anchor, waiting for a convoy, and a perfect fleet of little wherries was plying backwards and forwards between the vessels and the shore. \"It makes one almost wish to be a sailor,\" Peter said, as they sat upon the Southsea beach, and looked out at the animated ocean. \"It does, Peter; and if it had been ten years back, instead of at present, I should have been ready enough to change our plans. But what is the use of going to sea now? The French and Spanish navies skulk in harbor, and the first time our fellows get them out they will he sure to smash them altogether, and then there is an end to all fighting. No, Peter, it looks tempting, I grant, but we shall see ten times as much with the army. We must go and settle the thing to-morrow. There is no time to be lost if the expedition starts in a fortnight or three weeks.\" Returning into the town, the boys were greatly amused at seeing a sailor\u0027s wedding. Four carriages and pair drove along; inside were women, while four sailors sat on each roof, waving their hats to the passers-by, and refreshing themselves by repeated pulls at some black bottles, with which they were well supplied. Making inquiries, the boys found that the men belonged to a fine frigate which had come in a day or two before, with several prizes. The next morning they went down to the barracks. Several non-commissioned officers, with bunches of gay ribbons in their caps, were standing about. Outside the gates were some boards, with notices, \"Active young fellows required. Good pay, plenty of prize-money, and chances, of promotion!\" The boys read several of these notices, which differed only from each other in the name of the regiment; and then Tom gave an exclamation of satisfaction as he glanced at a note at the foot of one of them, \"Two or three active lads wanted as buglers.\" \"There we are, Peter; and, oh, what luck! it is Uncle Peter\u0027s regiment! Look here, Peter,\" he said, after a pause, \"we won\u0027t say anything about being his nephews, unless there is no other way of getting taken; for if we do it won\u0027t be nice. We shall be taken notice of, and not treated like other fellows, and that will cause all sorts of ill-feeling and jealousy, and rows. It will be quite time to say who we are when we have done something to show that we shan\u0027t do discredit to him. You see it isn\u0027t much in our favor that we are here as two runaway boys. If we were older we could go as volunteers, but of course we are too young for that.\" It should be mentioned that in those days it was by no means unusual for young men who had not sufficient interest to get commissions to obtain permission to accompany a regiment as volunteers. They paid their own expenses, and lived with the officers, but did duty as private soldiers. If they distinguished themselves, they obtained commissions to fill up vacancies caused in action. \"There is our sergeant, Tom; let\u0027s get it over at once.\" \"If you please,\" Tom said, as they went up to the sergeant, \"are you the recruiting sergeant of the Norfolk Rangers?\" \"By Jove, Summers, you are in luck to-day,\" laughed one of the other sergeants; \"here are two valuable recruits for the Rangers. The Mounseers will have no chance with the regiment with such giants as those in it. Come, my fine fellows, let me persuade you to join the 15th. Such little bantams as you are would be thrown away upon the Rangers.\" There was a shout of laughter from the other non-commissioned officers. Tom was too much accustomed to chaffing bargees at Eton to be put out of countenance. \"We may be bantams,\" he said, \"but I have seen a bantam lick a big dunghill cock many a time. Fine feathers don\u0027t always make fine birds, my man.\" \"Well answered, young one,\" the sergeant of the Rangers said, while there was a general laugh among the others, for the sergeant of the 15th was not a favorite. \"You think yourself sharp, youngster,\" he said angrily. \"You want a licking, you do; and if you were in the 15th, you\u0027d get it pretty quickly.\" \"Oh! I beg your pardon,\" Tom said gravely; \"I did not know that the 15th were famous for thrashing boys. Thank you; when I enlist it shall be in a regiment where men hit fellows their own size.\" There was a shout of laughter, and the sergeant, enraged, stepped forward, and gave Tom a swinging box on the ear. There was a cry of \"shame\" from the others; but before any of them could interfere, Tom suddenly stooped, caught the sergeant by the bottom of the trousers, and in an instant he fell on his back with a crash. For a moment he was slightly stunned, and then, regaining his feet, he was about to rush at Tom, when the others threw themselves in between them, and said he should not touch the boy. He struck him first, and the boy had only given him what served him right. The sergeant was furious, and an angry quarrel was going on, when an officer of the Rangers came suddenly out of barrack. \"Hullo, Summers, what is all this about? I am surprised at you. A lot of non-commissioned officers, just in front of the barrack gates, quarreling like drunken sailors in a pothouse. What does it all mean?\" \"The fact is this, Captain Manley,\" the sergeant said, saluting, \"these two lads came up to speak to me, when Sergeant Billow chaffed them. The lad gave the sergeant as good as he got, and the sergeant lost his temper, and hit him a box on the ear, and in a moment the young one tripped him up, and pretty nigh stunned him; when he got up he was going at the boy, and, of course, we wouldn\u0027t have it.\" \"Quite right,\" Captain Manley said. \"Sergeant Billow, I shall forward a report to your regiment. Chaffing people in the street, and then losing your temper, striking a boy, and causing a disturbance. Now, sergeant,\" he went on, as the others moved away, \"do you know those boys?\" \"No, sir; they are strangers to me.\" \"Do you want to see the sergeant privately, lads, or on something connected with the regiment?\" \"I see that you have vacancies for buglers, sir,\" Tom said, \"and my brother and myself want to enlist if you will take us.\" Captain Manley smiled. \"You young scamps, you have got \u0027runaway from home\u0027 as plainly on your faces as if it was printed there. If we were to enlist you, we should be having your friends here after you to-morrow, and get into a scrape for taking you.\" \"We have no friends who will interfere with us, sir, I can give you my word of honor as a gentleman.\" Captain Manley laughed. \"I mean,\" Tom said confused, \"my word of honor, as—as an intending bugler.\" \"Indeed we have no one to interfere with us in any way, sir,\" Peter put in earnestly. \"We wouldn\u0027t tell a lie even to enlist in the Rangers.\" Captain Manley was struck by the earnestness of the boys\u0027 faces, and after a pause he said to the sergeant,— \"That will do, Summers; I will take these lads up to my quarters and speak to them.\" Then, motioning to the boys to follow him, he re-entered the barracks, and led the way up to his quarters. \"Sit down,\" he said, when they had entered his room. \"Now, boys, this is a foolish freak upon your part, which you will regret some day. Of course you have run away from school.\" \"No, sir, we have run away from home,\" Tom said. \"So much the worse,\" Captain Manley said gravely. \"Tell me frankly, why did you do so? No unkindness at home can excuse boys from running away from their parents.\" \"We have none, sir,\" Tom said. \"We have lost them both—our mother many years ago, our father six months. Our only living relation, except a younger sister, is an aunt, who considers us as nuisances, and who, although meaning to do her duty, simply drives us out of our minds.\" Captain Manley could not resist a smile. \"Do you not go to school?\" \"We did go to a school near, but unfortunately it is broken up.\" Captain Manley caught a little look of amusement between the boys. \"I should not be surprised if you had something to do with its breaking up,\" he said with a laugh. \"But to return to your coming here. There is certainly less reason against your joining than I thought at first, but you are too young.\" \"We are both strong, and are good walkers,\" Tom said. \"But you cannot be much over fifteen,\" Captain Manley said, \"and your brother is younger.\" \"We are accustomed to strong exercise, sir, and can thrash most fellows of our own size.\" \"Very likely,\" Captain Manley said, \"but we can\u0027t take that into consideration. You are certainly young for buglers for service work; however, I will go across with you to the orderly-room, and hear what the colonel says.\" Crossing the barrack-yard, they found the colonel was in and disengaged. \"Colonel Tritton,\" Captain Manley said, \"these lads want to enlist as buglers.\" The colonel looked up and smiled. \"They look regular young pickles,\" he said. \"I suppose they have run away from school.\" \"Not from school, colonel. They have lost both parents, and live with an aunt, with whom they don\u0027t get on well. There does not seem to be much chance of their being claimed.\" \"You are full young,\" the colonel said, \"and I think you will be sorry, boys, for the step you want to take.\" \"I don\u0027t think so, sir,\" Tom said. \"Of course, you don\u0027t at present,\" the colonel said. \"However, that is your business. Mind, you will have a rough time of it; you will have to fight your way, you know.\" \"I\u0027ll back them to hold their own,\" Captain Manley said, laughing. \"When I went out at the barrack-gate just now there was a row among a lot of recruiting sergeants, and when I went up to put a stop to it, I found that a fellow of the 15th had chaffed these boys when they went up to speak to Summers, and that they had got the best of it in that line; and the fellow having lost his temper and struck one of them, he found himself on his back on the pavement. The boy had tripped him up in an instant.\" The colonel laughed, and then said suddenly and sharply to Peter, \"Where did you learn that trick, youngster?\" \"At Eton,\" Peter answered promptly, and then colored up hotly at his brother\u0027s reproachful glance. \"Oh, ho! At Eton, young gentlemen, eh!\" the colonel said. \"That alters the matter. If you were at Eton your family must be people of property, and I can\u0027t let you do such a foolish thing as enlist as buglers.\" \"Our father lost all his money suddenly, owing to a blackguard he trusted cheating him. He found it out, and it killed him,\" Tom said quietly. The colonel saw he was speaking the truth. \"Well, well,\" he said kindly, \"we must see what we can do for you, boys. They are young, Manley, but that will improve, and by the time that they have been a year at the dep?t—\" \"Oh, if you please, colonel,\" Tom said, \"we want to go on foreign service, and it\u0027s knowing that your regiment was under orders for foreign service we came to it.\" \"Impossible!\" the colonel said shortly. \"I am very sorry for that, sir,\" Tom said respectfully, \"for we would rather belong to this regiment than any in the service; but if you will not let us go with it we must try another.\" \"Why would you rather belong to us than to any other?\" the colonel asked, as the boys turned to leave the room. \"I had rather not say, sir,\" Tom said. \"We have a reason, and a very good one, but it is not one we should like to tell.\" The colonel was silent for a minute. He was struck with the boys\u0027 appearance and manner, and was sorry at the thought of losing them, partly from interest in themselves, partly because the sea service was generally so much more attractive to boys, that it was not easy to get them to enlist as buglers and drummers. \"You see, lads, I should really like to take you, but we shall be starting in a fortnight, and it would be altogether impossible for you to learn to sound the bugle, to say nothing of learning the calls, by that time.\" \"We can\u0027t play well, sir,\" Tom answered, his spirits rising again, \"but we have practiced for some time, and know a good many of the calls.\" \"Oh, indeed!\" the colonel said, pleased; \"that alters the case. Well, lads, I should like to take you with the regiment, for you look straightforward, sharp young fellows. So I will enlist you. Work hard for the next fortnight, and if I hear a favorable report of you by that time, you shall go.\" \"Thank you very much,\" the boys said warmly, delighted to find their hopes realized. \"What are your names?\" the colonel asked. \"Tom and Peter,\" Tom answered. \"Tom and Peter what?\" the colonel said. The boys looked at each other. The fact that they would of course be asked their names had never occurred to them, and they not had therefore consulted whether to give their own or another name. \"Come, boys,\" Colonel Tritton said good-temperedly, \"never be ashamed of your names; don\u0027t sail under false colors, lads. I am sure you will do nothing to disgrace your names.\" Tom looked at Peter, and saw that he agreed to give their real names, so he said, \"Tom and Peter Scudamore.\" \"Peter Scudamore! Why, Manley, these boys must be relations of the dear old colonel. That explains why they chose the regiment. Now, boys, what relation was he of yours?\" \"I do not admit that he was a relation at all, colonel,\" Tom said gravely, \"and I hope that you will not ask the question. Supposing that he had been a relation of ours, we should not wish it to be known. In the first place, it would not be altogether creditable to his memory that relations of his should be serving as buglers in his old regiment; and in the second place, it might be that, from a kindness towards him, some of the officers might, perhaps, treat us differently to other boys, which would make our position more difficult by exciting jealousy among others. Should there be any relation between him and us, it will be time enough for us to claim it when we have shown ourselves worthy of it.\" \"Well said, boys,\" the officers both exclaimed. \"You are quite right,\" the colonel went on, \"and I respect your motive for keeping silence. What you say about jealousy which might arise is very sensible and true. At the same time, I will promise you that I will keep my eye upon you, and that if an opportunity should occur in which I can give you a chance of showing that there is more in you than in other boys, be sure you shall have the chance.\" \"Thank you very much indeed, colonel,\" both boys exclaimed. \"Now, Manley, I shall be obliged if you will take them to the adjutant, and tell him to swear them in and attest them in regular form; the surgeon will, of course, examine them. Please tell the quartermaster to get their uniforms made without loss of time; and give a hint to the bugle-major that I should be pleased if he will pay extra attention to them, and push them on as fast as possible.\" Captain Manley carried out these instructions, the boys were duly examined by the surgeon and passed, and in half an hour became His Majesty\u0027s servants. \"Now, boys,\" Captain Manley said as he crossed with them to the quarters of the bandmaster, \"you will have rather a difficult course to steer, but I have no doubt you will get through it with credit. This is something like a school, and you will have to fight before you find your place. Don\u0027t be in a hurry to begin; take all good-natured chaff good-naturedly; resent any attempt at bullying. I have no doubt you will be popular, and it is well that you should be so, for then there will be no jealousy if your luck seems better than that of others. They will, of course, know that you are differently born and educated to themselves, but they will not like you any the worse for that, if they find that you do not try to keep aloof from them or give yourselves airs. And look here, boys, play any tricks you like with the men, but don\u0027t do it with the non-commissioned officers. There is nothing they hate so much as impudence from the boys, and they have it in their power to do you a great deal of good or of harm. You will not have much to do with the bandmaster. Only a portion of the band accompanies us, and even that will be broken up when we once enter upon active campaigning. Several of the company buglers have either left lately, or have got their stripes and given up their bugles, and I do not fancy that their places will be filled up before we get out there. Now, your great object will be to get two of these vacancies. I am afraid you are too young, still there will be plenty more vacancies after we are once in the field, for a bullet has no respect for buglers; and you see the better you behave the better your chance of being chosen.\" \"What is the difference exactly, sir?\" Tom asked. \"The company bugler ranks on the strength of the company, messes, marches, and goes into action with them; the other buglers merely form part of the band, are under the bandmaster, play at the head of the regiment on its march, and help in the hospitals during a battle.\" \"Macpherson,\" he said as he entered the bandmaster\u0027s quarters, where a number of men and a few lads were practicing, \"I have brought you two lads who have entered as buglers.\" The bandmaster was a Scotchman—a stiff-looking, elderly man. \"Weel, Captain Manley, I\u0027m wanting boys, but they look vera young, and I misdoubt they had better have been at school than here. However, I\u0027ll do my best with them; they look smart lads, and we shall have plenty of time at the dep?t to get them into shape.\" \"Lots of time, Macpherson, lots of time. They say they know a few calls on the bugle, so perhaps they had better stick to the calls at present; you will have plenty of time to begin with them regularly with the notes when all the bustle is over.\" \"Eh, ye know the calls, boys? Hardy and Graves, give them your bugles, and let us hear them. Now for the advance.\" Tom and Peter felt very nervous, but they had really practiced hard for an hour a day for the last four months, and could play all the calls they knew steadily and well. The bandmaster made no remark until they had sounded some half a dozen calls as he named them, and then he said, \"The lads have a vera gude idea of it, Captain Manley. They are steadier and clearer than mony a one of the boys already. Will ye begin at once, lads, or will ye wait till ye get your uniform?\" \"We had rather begin at once,\" the boys answered together. \"Vera gude. Hardy, take two bugles out of the chest, and then take these lads—What\u0027s your name, boys? Eh? Scudamore? A vera gude name—take them over to Corporal Skinner, he will be practicing with the others on the ramp.\" With a word of grateful thanks to Captain Manley as he went out before them, the boys followed their new guide out to the ramparts. A guide was hardly necessary, for an incessant bugling betokened the place, where, in one of the bastions behind the barracks, seven or eight buglers were sounding the various calls under the direction of Corporal Skinner. The corporal was a man of few words, for he merely nodded when the boy—who had not opened his lips on the way, indeed, he was too busy wondering who these young swells were, and what they had run away for, to say a word—gave the bandmaster\u0027s message to the effect that the new-comers knew some of the calls and were to be under his tuition for the present, pointed to them where to stand, and in another minute Tom and Peter were hard at work adding to the deafening din. After half an hour\u0027s practice they were pleased at seeing Captain Manley stroll up and call their instructor aside, and they felt sure that he was speaking to him of them. This was so, for the officer was carrying out the instructions he had received from Colonel Tritton. \"Corporal,\" he said, \"I want to say a word to you about those boys who have just joined. They seem to have a fair idea of the calls.\" \"Yes, sir, they only know a few, but those they do know they can sound as well as any of them.\" \"That is right, corporal. Now look here, what I am going to say is not to go farther, you understand.\" \"Yes, sir, I will keep my mouth shut.\" \"Very well. You can see the lads are not like most of our band boys. They are a gentleman\u0027s sons who have got into some scrape or other and run away from school.\" \"I was thinking as much, sir.\" \"The colonel believes that he knows their family, Skinner; but of course, that will not make any difference in regard to them. Still he would be pleased, I know, if they could sound the calls well enough to go with the regiment. They are most anxious to learn. Now I shall be glad if you can get them up to the mark. It will, of course, entail a lot of extra trouble upon you, but if you can get them fit in time, I will pay you a couple of guineas for your extra time.\" \"Thank you, sir,\" the corporal saluted. \"I think I can manage it—at any rate if I don\u0027t it won\u0027t be for want of trying.\" \"Who are those nice-looking lads I saw with you, Manley?\" Major James asked as the captain came into the messroom to lunch. \"Those are two buglers in his Majesty\u0027s Norfolk Rangers.\" There was a general laugh. \"No, but really, Manley, who are they? I was quite struck with them; good style of boys.\" \"It is a fact, major. Harding will tell you so,\" and he nodded to the adjutant. \"Yes, Manley is saying the thing that\u0027s right,\" the adjutant answered. \"The doctor passed them, and I swore them in.\" \"I am sorry for it,\" the major said. \"There were three or four of us standing on the mess-room steps and we all noticed them. They were gentlemen, if I ever saw one, and a hard life they will have of it with the band boys. However, they are not likely to stay there. They have run away from school, of course, and will be claimed. I wonder you enlisted them.\" \"The colonel\u0027s orders, major,\" the adjutant said. \"Manley took them to him, I believe, and then brought them to me.\" \"I don\u0027t think you need feel anxious about them among the boys, major,\" Captain Manley said. \"I fancy they can hold their own. I found them outside the gate where a row was going on among some of the recruiting sergeants, and one of those boys had just tripped up a sergeant of the 15th and nearly broken his head.\" There was a general laugh. \"They are quite interesting, these prodigies of yours, Manley. How did the boy do it? I should not have thought him strong enough to have thrown a man off his balance.\" \"I asked Summers about it afterwards,\" Captain Manley said, \"the fellow gave one of the boys a box on the ear, and in an instant the boy stooped, caught his foot and pulled it forward and up. The thing was done in a moment, and the sergeant was on his back before he knew what\u0027s what.\" \"By Jove,\" a young ensign said, \"I have seen that trick done at Eton.\" \"That is just where the boy said he learnt it,\" Captain Manley said. \"The colonel asked him suddenly, and it slipped out.\" \"If they\u0027re Etonians, I ought to know them,\" the ensign said. \"I only left six months ago. What are their names?\" \"Their name is Scudamore.\" \"By Jove, they were in the same house with me. Uncommonly sharp little fellows, and up to no end of mischief. It was always believed, though no one could prove it, that they were the boys who nearly suffocated the bargee.\" There was a roar of laughter. \"Tell us all about, Carruthers.\" \"Well, there was not very much known about it. It seems the fellow purposely upset a boat with four or five of our fellows in it, and that night a dozen lighted crackers were thrown down into the little cabin where the fellow was asleep; the hatch was fastened and he was sent drifting down stream with the crackers exploding all about him. The smoke nearly suffocated the fellow, I believe There was a tremendous row about it, but they could not bring it home to any one. We always put it down to the Scudamores, though they never would own to it; but they were the only fellows in the boat who would have done it, and they were always up to mischief.\" \"But what makes them come here as buglers?\" the major asked. \"Their father was a banker, I believe, down in the Eastern Counties somewhere. He died suddenly in the middle of the half before I left, and they went away to the funeral and never came back again.\" \"The fact is,\" Captain Manley said, \"I fancy by what they say, though they did not mention their father was a banker, that he lost all his money suddenly and died of the shock. At any rate they are alone in the world, and the colonel has no doubt that they are some relation—nephews, I should imagine—of Peter Scudamore, who was our colonel when I joined. One of them is called Peter. They acknowledged that they had a particular reason for choosing this regiment; but they would neither acknowledge or deny that he was a relation. Now that we know their father was a banker, we shall find out without difficulty—indeed I have no doubt the colonel will know whether Peter Scudamore had a brother a banker.\" \"What\u0027s to be done, Manley?\" Major James said. \"I don\u0027t like the thought of poor old Peter\u0027s nephews turning buglers. All of us field officers, and the best part of you captains, served under him, and a better fellow never stepped. I think between us we might do something.\" \"I would do anything I could,\" Carruthers said, \"and there are Watson and Talbot who were at Eton too. Dash it, I don\u0027t like to think of two Etonians in a band,\" \"You are all very good,\" Captain Manley said, \"but from what I see of the boys they will go their own way. They have plenty of pride, and they acknowledge that their reason for refusing to say whether they are any relation of the colonel was that they did not want to be taken notice of or treated differently from other boys, because it would cause jealousy, and make their position more difficult. All they asked was that they might accompany the regiment, and not remain behind at the dep?t; and as, fortunately, they have both been practising with the bugle, and can sound most of the calls as well as the others, the colonel was able to grant their request. Had they been older, of course, we could have arranged for them to go with us as volunteers, we who knew the colonel, paying their expenses between us: as it is, the only thing we can do for them—and that is what they would like best is to treat them just like the other boys, but to give them every chance of distinguishing themselves. If they don\u0027t get knocked over, they ought to win a commission before the campaign is over.\" In the meantime Tom and Peter had been introducing themselves to the regiment. The exercise over, they had returned to dinner. It was a rough meal, but the boys enjoyed it, and after it was over a number of the men of the band, with whom they messed, crowded round to ask the usual questions of new-comers—their curiosity heightened in the present instance by the fact that the boys differed so widely from ordinary recruits. \"Look here,\" Tom said, laughing, \"I can\u0027t answer you all at once, but if you put me on the table I will tell you all about us.\" There was a general laugh, and many of the soldiers other than the band sauntered up to see what was going on. \"The first thing to tell you,\" Tom said, \"is our names. We go by the names of Tom and Peter Scudamore, but I need scarcely tell you that these are not our real names. The fact is—but this is quite a secret—we are the eldest sons of Sir Arthur Wellesley—\" Here Tom was interrupted by a shout of laughter. \"Sir Arthur,\" Tom went on calmly, \"wished to make us colonels of two of the Life Guard regiments, but as they were not going on foreign service we did not see it, and have accordingly entered the regiment which Sir Arthur, our father, in speaking to a friend, said was the finest in the service—namely, the Norfolk Rangers. We believe that it is the custom, upon entering a regiment, to pay our footing, and I have given a guinea to Corporal Skinner, and asked him to make it go as far as he could.\" There was great laughter over Tom\u0027s speech, which was just suited to soldiers, and the boys from that moment were considered part of the regiment. \"There\u0027s good stuff in those boys,\" an old sergeant said to another, \"plucky and cool. I shouldn\u0027t be surprised if what Tom Dillon said was about right; he was waiting at mess just now, and though he didn\u0027t hear all that was said, he picked up that there was an idea that these boys are related to the old colonel. He was a good fellow, he was, and, though I say nothing against Colonel Tritton, yet we missed Colonel Scudamore terribly. Strict, and yet kind, just the sort of fellow to serve under. If the boys take after him they will be a credit to the regiment, and mark my words, we shan\u0027t see them in the band many years.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3164/86820.html","bookId":870,"book":{"id":870,"title":"The Young Buglers","description":"简介： Had any of the boys in the lower forms of Eton in the year 1808, been asked who were the most popular boys of their own age, they would have been almost sure to have answered, without the slightest hesitation, Tom and Peter Scudamore, and yet it is p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3164","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
