{"id":20279,"no":9,"title":"CHAPTER VIII. — A PAUSE IN OPERATIONS.","content":"Talavera was fought in July, 1809, and for four months longer Sir Arthur Wellesley kept his troops on the Spanish frontier, where his presence served as a check against any invasion, even by a very formidable army, of Portugal. After the utter bad faith and cowardice shown by the Spanish, the great commander was determined never again to trust in their promises, or to undertake any movement dependent for success upon their co-operation. The Junta then declared that the Spaniards would alone and unaided sweep the French beyond the Pyrenees, and a Spanish army of 45,000 infantry, 7000 cavalry, and 60 guns advanced in November against Madrid. It was met by a French army of 24,000 infantry, 5000 cavalry, and 50 guns. The battle began at eleven in the morning, and by three the French, with a loss of only 1700 killed and wounded, had utterly routed the Spanish, with a loss of 5000 killed and wounded, 45 guns, and 26,000 prisoners! After this signal and disgraceful defeat, Lord Wellington—for he had now been raised to the peerage—felt that nothing whatever could be done at present in Spain, and so fell back into Portugal, where for many months he occupied himself in preparing to meet the storm which would, he knew, fall ere long upon that country. The Portuguese authorities were as incapable, as untrustworthy, and as intractable as were those of Spain; but here, happily, Lord Wellington had more power. England was paying large subsidies towards keeping up the Portuguese army, which was commanded by Lord Beresford, having under him many British officers. The Portuguese troops were hardy, obedient, and far braver than the Spaniards; but difficulties often arose in keeping the army together, because the Portuguese Government, although England was paying the principal expenses of the army, yet starved their soldiers, and often kept them for months without pay. It was only by the strongest remonstrances, and by the oft-repeated threat that he would embark the British troops, and abandon Portugal altogether, unless these and other abuses were done away with, that Lord Wellington succeeded in reducing this incapable and insolent Government to reason. Reinforcements arrived but slowly from England, for a considerable portion of the available troops of England were frittered away in holding Cadiz and in an expedition to Sicily. In these two places some 25,000 English troops were wasted—a force, which, had it been added to Wellington\u0027s army, would have enabled him to take the field against the French, instead of being forced to remain in Portugal for upwards of a year without discharging a single shot against the enemy. Tom and Peter Scudamore, however, were not destined to remain inactive all these weary months. One day in November, just before the army fell back from the Spanish frontier, General Hill was dining at mess with the regiment; for, rough as was the accommodation, the officers had succeeded in establishing a general mess. The conversation turned upon the difficulty of discovering what force the various French generals had at their disposal, the reports received by the Commander-in-Chief being often ridiculously incorrect. There was also an immense difficulty in communicating with the guerilla chiefs who, almost always beaten when they came to blows with any considerable bodies of the French, yet managed to harass them terribly by cutting off convoys, falling upon small parties, and attacking outposts and bands of foragers. Knowing every mountain pass and road, these men could, if they would, keep Lord Wellington informed of every considerable movement of the enemy, and might in return receive instruction for acting, when required, in concert before the communication of an advancing army, or might create a diversion by uniting their bands, and threatening some important post. The next day the boys went to Colonel Tritton\u0027s quarters, and, referring to the conversation of the day before, said that they were willing to carry any messages that the general might require sent, and to obtain any information wanted. \"Nonsense, boys, you would be hung as spies before you had been gone a week.\" \"I don\u0027t think so, sir,\" Tom said; \"we have had very little to do during the six months we have been out here except to learn the language of the country, and I think now we could pass very well as Spanish boys. Besides, who would suspect boys? We are quite ready to chance detection if we can be allowed to go.\" \"I don\u0027t like it, boys; you are too young. Well, if not too young,\" he said, in answer to a movement of Tom\u0027s to speak, \"we all like you too well to run the risk of hearing you have been hung like a couple of young puppies.\" \"You are very kind, colonel; but you know you promised to give us a chance if you could, and having a chance of course means having extra danger; but I really don\u0027t think that there would be any great danger in it.\" \"Well, boys,\" Colonel Tritton said, after a few moments\u0027 thought, \"I do not feel justified in refusing your application, and will mention it to General Hill. There are very few officers in the army who speak Spanish fluently, and you being boys would, as you say, avert suspicion. But I tell you fairly that I hope General Hill will at once refuse to entertain the idea.\" \"Thank you, sir,\" the boys said. \"Of course that is all we could ask you to do.\" The next day, after parade was over, Colonel Tritton walked on to General Hill\u0027s quarters at a sort of half farm-house, half country-seat, a short distance from the village, round which the Rangers were encamped. As he came up to the house, General Hill came out from his door talking to a Spanish officer, who had the day before brought some despatches from one of the Spanish generals to Lord Wellington. Colonel Tritton joined them, and they stood talking together upon the state of affairs in Spain, and of the advance of the Spanish army on Madrid, which was then just taking place. As they did so two very ragged, unkempt Spanish boys, shoeless and wretched-looking, limped up, and began to beg. General Hill shook his head, and the Spaniard impatiently motioned them away. \"Por Dios,\" one whined; \"give us something; we are starving. The French have burnt down our houses, and killed our fathers and mothers—we are starving. \u0027Por l\u0027amor de Dios!\u0027\" \"What\u0027s the poor little beggar say?\" General Hill asked the Spaniard. \"The usual story—house burnt, father and mother killed, starving. I dare say it\u0027s all a lie.\" \"Where did you live?\" he asked in Spanish. \"In the village of Oros, near Valencia.\" \"And how did you come here?\" \"The French burnt the village because the guerillas had killed a party of theirs in it, and they killed all the people, and then carried off the mules and horses, and took us to drive some of them. That was four months ago. We had to drive till the other day at Tamanes, when our men beat the French; our mules were taken, and, as they did not want us as drivers we had nothing to do but to come on in hopes that the kind English would give us food.\" The Spanish officer translated what the boy said, and General Hill remarked, \"Yes, that was a brilliant affair of the Duke del Pasque\u0027s. Here,\" he called to an orderly, \"give these boys some bread. I will see what can be done for them afterwards. I am afraid nothing. Poor little wretches! their story is a very common one.\" The boys received the bread with a great show of thankfulness, and, sitting down by the roadside, began to munch it with great appetite. The Spanish officer now mounted his horse and rode off, while General Hill and Colonel Tritton remained standing where he had left them. Colonel Tritton then told General Hill of the Scudamores\u0027 request to be allowed to penetrate into Spain as spies or with dispatches. \"The young pickles!\" General Hill laughed. \"What will they be wanting to do next? Pooh, pooh! it would be out of the question.\" \"I believe they do really speak Spanish exceedingly well.\" Colonel Tritton said. \"They generally act as interpreters for us, and none of the officers speak Spanish with anything like the same fluency.\" \"As far as the language goes, they might get on, perhaps,\" General Hill said; \"but they look as thorough English boys as you could see. They would be detected at once.\" \"Yes,\" Colonel Tritton said, \"they are both thorough English boys; I should know them anywhere. What a contrast to the miserable, limping, hang-dog lads there! Poor little chaps! Why, upon my word, I believe the fellows are laughing.\" General Hill looked sharply at them, and, as he looked from one to the other, he said sarcastically, \"Poor little chaps indeed! You said that very naturally, Tritton. It really does you credit as an actor.\" Colonel Tritton looked at the general with an expression of blank astonishment. \"What,\" said the general, \"were you really taken in too\" \"Taken in?\" repeated Colonel Tritton vaguely. \"Don\u0027t you see, Tritton, those poor little chaps you are pitying so are those two young scamps we were talking about.\" Colonel Tritton stared in astonishment at the boys, and then, as he recognized them, he joined the general in a shout of laughter, while the two boys stood up and saluted with an attempt at gravity which was only partially successful, so amused were they at the astonishment of their colonel, as well as pleased at the success of their disguise. Just at this moment there was a sound of tramping horses, and directly afterwards an officer rode up, followed by four or five others, and at a short distance in the rear by an escort of orderlies. The boys needed not the exclamation of General Hill, \"Here is Wellington.\" They knew who the rider was, who checked his horse as he reached the gate, for they had often seen him as he rode through the camp. A slight man, very careful and neat in his dress, with an aquiline nose and piercing eyes. Peter was rising as he drew up his horse, when Tom said, \"Don\u0027t get up, Peter; go on with your bread. It would look absurd for us to salute now, and would draw attention to us,\" he went on, as Lord Wellington dismounted, threw the bridle off his horse to an orderly, and saying to General Hill, \"I wanted to see you; come in.\" Colonel Tritton went into the house, followed by the two officers. \"We\u0027ll stop here till they come out again, Peter. Perhaps General Hill may speak to him about us. At any rate, we will keep up our disguise till they\u0027ve gone. Let us play at odd and even.\" It was a game of which Spanish boys are very fond, and they may be seen in any of the Spanish towns sitting by the houses on door-steps in the sun playing. It was half an hour before the general came out again. He was about to mount his horse, when he glanced at the boys, who were sitting against the wall a few paces off, seemingly absorbed in their play, and paying no attention whatever to him. Suddenly he changed his mind, dropped his rein, and walked up to them. \"What are you playing for?\" he asked abruptly in Spanish. \"Reals, se?or,\" Tom said looking up, but not moving. \"You are poor; how can you pay?\" asked the general. \"Oh! we don\u0027t pay,\" Tom laughed. \"We keep count. I owe him twelve thousand now. I will pay him when I get rich. He can wait.\" And he held out his closed hand again for Peter to guess the number of stones it contained. \"Come inside,\" Lord Wellington said abruptly, and, turning led the way into the house again, followed by General Hill, Colonel Tritton, and the two boys. \"It is not often I change my mind,\" he said to General Hill; \"but for once I do so now. When you told me about these lads, I refused to employ them on such dangerous service, even when you told me of the courage and coolness which they exhibited on the voyage. Now I have tried them myself, I see that they will do. If they could keep up their disguise when I spoke to them suddenly, and answer without hesitation or any excitement which could have shown that they were not what they pretended to be, they can do so with a French general. I am no judge of the purity of their Spanish; but as you tell me they deceived a Spanish officer just now, they will be able to pass with Frenchmen. Now, lads,\" he went on turning to them, \"you have thought over, of course, the risks you are going to run, and are prepared, if detected, to be hung like dogs.\" The boys bowed. \"You will receive detailed instructions through Colonel Tritton, together with such despatches as I may wish sent. They will be written as small as possible. You will not go for a week; devote all your time to studying the map. The largest size we have shall be sent to your colonel this afternoon. Of course you will be supplied with money, and for anything you can think of likely to assist you, speak to Colonel Tritton. You are beginning well, young sirs. If you like, you ought to made a noise in the world. Now, Hill, I must be off.\" And the general left the room with the officers, while the boys were stammering out their thanks. \"Where did you dress up, boys?\" Colonel Tritton asked them after the general had ridden off. \"You did not come out from camp like this I hope?\" \"No, colonel; we changed in that little wood there.\" \"What have you colored your skins with?\" \"We got some iodine from the doctor, sir, and mixed it with water till it was just thick enough to tinge our skin. It will wash pretty well off with plenty of scrubbing, but we mean to use walnut juice when we start; it lasts much longer, and is a better brown.\" \"I am not sure, boys, that you had not better leave your faces alone, they and your hands are so sunburnt that you would pass well enough, though you must dye your arms and legs. Fortunately, your hair is pretty dark, for you can\u0027t well carry dye. Think well over all these things, for your lives may depend on some trifle of this kind. I shall see you at mess.\" So saying, Colonel Tritton walked on, leaving the boys to follow at their leisure. Just as they were about to turn off to make for the woods they saw a soldier coming along the road. \"That\u0027s Sam, if I am not mistaken, Peter, we will have some fun with him. We can trust him to say nothing in the regiment about meeting us like this.\" The two boys accordingly sat down by a low wall by the roadside, and as Sam came up talked away to each other in Spanish. He passed without paying any attention to them. After he had gone a few yards, Tom said in a deep, loud voice, \"Sambo.\" The black halted suddenly, and turned round. First he looked angrily at the boys, then he went to the side of the road and looked over the wall. Then with a very perplexed air he looked up and down the road. \"Who dat have impudence to call dis colored gentleman Sambo,\" he said to himself. \"Some fellow did, dat for sartin, not dose little Spanish trash, dey not know Sam\u0027s name, some rascal in regiment; he\u0027s hid somewhere. I pound him to squash when I find him.\" Muttering thus he turned to proceed on his way, but before he had gone twenty yards, he again heard a deep shout. \"Here, you, Sambo.\" The black jumped as if he was shot, \"My golly,\" he exclaimed, and then walked back to the boys, who were talking together, shook his head and again looked over the wall. Then he stooped down to the boys, and shook his fist in their faces, \"You little debils, you call Sambo, I pound you to squash.\" The boys both leapt to their feet with an air of intense surprise and alarm, and began to cry out in Spanish. \"No, can\u0027t be you,\" Sam said, \"dis chile must be witched, no place for men to hide, sartin not dem boys. Stone wall can\u0027t call Sambo all by self, Sam\u0027s going out of mind. Oh! Lor, dis berry bad affair,\" and Sam sat down by the roadside with a face of such perfect bewilderment and dismay that the boys could stand it no longer, but went off together into a scream of laughter, which caused Sam to jump to his feet again. \"What you larf for, what you larf for, you little rascals, you play trick, eh? you call Sambo, who taught you dat name?\" and he seized the two boys and shook them furiously. \"Oh! Sam, Sam, you will kill us with laughing,\" Tom got out at last. \"Do leave go, man, or we shall choke,\" and as Sam, astonished, loosed his hold, the boys sat down and laughed till their sides ached. \"Golly,\" exclaimed the negro, as he looked at them, \"Dose boys again. What on earth you do, Massa Tom, Massa Peter, in dose ragged close, what you dress up like two beggars for? Lor! how you take in dis chile, me tink you little Spanish trash, sure enuff.\" It was some time before the boys could compose themselves, and then Tom made Sam sit close by his side. \"Look here, Sam, this isn\u0027t a joke, this is a serious business and before I tell you anything about it, you must promise to keep the secret strictly, as it would do us a great deal of harm if it was known.\" Sam declared at once that if they tore him to pieces with wild horses he would say nothing. Tom then explained the whole thing to him and Sam at once declared that he would go too. \"Quite impossible, Sam. You do not speak a word of Spanish and although at any of the seaport towns you could pass as a runaway sailor, there could be no possible reason for your wandering about the country with two Spanish boys.\" Sam thought for some time. \"Now dat berry unlucky Massa Tom, dat Sam play big drum. Big drum fine music, but big drum not go well by self. If Sam had played fiddle, Sam could go, but Sam couldn\u0027t go nohow with big drum.\" \"I should think not, Sam, with the name of the regiment painted on it. No, no, you must stay behind. There won\u0027t be any fighting now till the spring, and by that time we shall be back with the regiment.\" \"But what you do without Sam? who black Massa\u0027s boots? who brush his clothes?\" Tom laughed. \"These clothes would fall all to pieces, if they were brushed much, Sam, and at present we have no boots to be blacked.\" \"Where you get dose clothes, Massa Tom,\" Sam asked, examining with great disgust the rags the boys had on. \"We bought some peasant\u0027s clothes about our size, and the first beggar boys we saw we offered to exchange. You should have seen their faces of astonishment. When we got the clothes we made them into a bundle, and took them to the bakehouse, and got the baker to put them into the oven for a few hours to kill anything there might be in them. Now, Sam, it is time for us to be going. It will take us an hour\u0027s scrubbing to get the color off us. Be sure you keep our secret.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3164/86825.html","bookId":870,"book":{"id":870,"title":"The Young Buglers","description":"简介： Had any of the boys in the lower forms of Eton in the year 1808, been asked who were the most popular boys of their own age, they would have been almost sure to have answered, without the slightest hesitation, Tom and Peter Scudamore, and yet it is p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3164","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
