{"id":94498,"no":24,"title":"Page 24","content":"Drizzt stood transfixed as a line appeared on the unblemished side of the crystalline tower, widening, widening, until it became an open doorway.\n And inside the door, beckoning to Drizzt, stood a drow elf wearing a great plumed hat that Drizzt surely recognized. For some reason he could not immediately discern, Drizzt was not as surprised as he should have been.\n \"Well met again, Drizzt Do\u0027Urden,\" Jarlaxle said, using the common surface tongue. \"Please do come in and speak with me.\"\n Drizzt put one hand to a scimitar hilt, the other to the pouch holding Guenhwyvar-though he had only recently sent the panther back to her astral home and knew she would be weary if recalled. He tensed his leg muscles and measured the distance to Jarlaxle, recognizing that he, with the enchanted ankle bracers he wore, could cover the ground in the blink of an eye, perhaps even get a solid strike in against the mercenary.\n But then he would be dead, he knew, for if Jarlaxle was here, then so was Bregan D\u0027aerthe, all about him, weapons trained upon him.\n \"Please,\" Jarlaxle said again. \"We have business we must discuss to the benefit of us both and to our friends.\"\n That last reference, coupled with the fact that Drizzt had come back this way on the word of an impostor-who was obviously working for the mercenary leader or was, perhaps the mercenary leader-that Wulfgar was in some danger, made Drizzt relax his grip on his weapon.\n \"I guarantee that neither I nor my associates shall strike against you,\" Jarlaxle assured him. \"And furthermore the friends who accompanied you to this village will walk away unharmed as long as they take no action against me.\"\n Drizzt held a fair understanding of the mysterious mercenary, enough to trust Jarlaxle\u0027s word, at least. Jarlaxle had held all the cards in previous meetings, times when the mercenary could have easily killed Drizzt, and Catti-brie as well. And yet he had not, despite the fact that bringing the head of Drizzt Do\u0027Urden back to Menzoberranzan at that time might have proven quite profitable. With a look back to the direction of the town, blocked from view by the high ridge, Drizzt moved to the door.\n Many memories came to Drizzt as he followed Jarlaxle into the structure, the magical door sliding closed behind them. Though this ground level was not as the ranger remembered it, he could not help but recall the first time he entered a manifestation of Crenshinibon, when he had gone after the wizard Akar Kessell back in Icewind Dale. It was not a pleasant memory to be sure, but a somewhat comforting one, for within those recollections came to Drizzt an understanding of how he could defeat this tower, of how he could sever its power and send it crumbling down.\n Looking back at Jarlaxle, though, as the mercenary settled comfortably into a lavish chair beside a huge upright mirror, Drizzt understood he wouldn\u0027t likely get any such chance.\n Jarlaxle motioned to a chair opposite him, and again Drizzt moved to comply. The mercenary was as dangerous as any creature Drizzt had ever know, but he was not reckless and not vicious.\n One thing Drizzt did notice, though, as he moved for the seat: his feet seemed just a bit heavier to him, as though the dweomer of his bracers had diminished.\n \"I have followed your movements for many days,\" Jarlaxle explained. \"A friend of mine requires your services, you see.\"\n \"Services?\" Drizzt asked suspiciously.\n Jarlaxle only smiled and continued. \"It became important for me to bring the two of you together again.\"\n \"And important for you to steal the crystal shard,\" Drizzt reasoned.\n \"Not so,\" the mercenary honestly answered. \"Not so. Crenshinibon was not known to me when this began. Acquiring it was merely a pleasant extra in seeking that which I most needed: you.\"\n \"What of Cadderly?\" Drizzt asked with some concern. He still was not certain whether it really had been Cadderly who had come to Regis\u0027s aid. Had Jarlaxle subsequently garnered Crenshinibon from the priest? Or had the entire episode with Cadderly been merely a clever ruse?\n \"Cadderly remains quite comfortable in the Spirit Soaring, oblivious to your quest,\" Jarlaxle explained. \"Much to the dismay of my wizard friend\u0027s new familiar, who holds a particular hatred for Cadderly.\"\n \"Promise me that Cadderly is safe,\" Drizzt said in all seriousness.\n Jarlaxle nodded. \"Indeed, and you are quite welcome for our actions to save your halfling friend.\"\n That caught Drizzt off guard, but he had to admit that it was true enough. Had not Jarlaxle\u0027s cronies come in the guise of Cadderly and enacted great healing upon Regis, the halfling likely would have died, or at the very least would have lost an arm.\n \"Of course, for the minor price of a spellcasting you gained much of our confidence,\" Drizzt did remark, reminding Jarlaxle that he understood the mercenary rarely did anything that did not bring some benefit to him.\n \"Not so minor a spellcasting,\" Jarlaxle bantered. \"And we could have faked it all, providing only the illusion of healing, a spell that would have temporarily healed the halfling\u0027s wounds, only to have them reopen later on to his ultimate demise.\n \"But I assure you that we did not,\" he quickly added, seeing Drizzt\u0027s eyes narrow dangerously. \"No, your friend is nearly fully healed.\"\n \"Then I do thank you,\" Drizzt replied. \"Of course, you understand that I must take Crenshinibon back from you?\"\n \"I do not doubt that you are brave enough to try,\" Jarlaxle admitted. \"But I do understand that you are not stupid enough to try.\"\n \"Not now, perhaps.\"\n \"Then why ever?\" the mercenary asked. \"What care is it to Drizzt Do\u0027Urden if Crenshinibon works its wicked magic upon the dark elves of Menzoberranzan?\"\n Again, the mercenary had put Drizzt somewhat off his guard. What care, indeed? \"But does Jarlaxle remain in Menzoberranzan?\" he asked. \"It would seem not.\"\n That brought a laugh from the mercenary. \"Jarlaxle goes where Jarlaxle needs to go,\" he answered. \"But think long and hard on your choice before coming for the crystal shard, Drizzt Do\u0027Urden. Are there truly any hands in all the world better suited to wield the artifact than mine?\"\n Drizzt did not reply but was indeed considering the words carefully.\n \"Enough of that,\" Jarlaxle said, coming forward in his chair, suddenly more intent. \"I have brought you here that you might meet an old acquaintance, one you have battled beside and battled against. It seems as if he has some unfinished business with Drizzt Do\u0027Urden, and that uncertainty is costing me precious time with him.\"\n Drizzt stared hard at the mercenary, having no idea what Jarlaxle might be talking about-for just a moment. Then he remembered the last time he had seen the mercenary, right before Drizzt and Artemis Entreri had parted ways. His expression showed his disappointment clearly as he came to suspect the truth of it all.\n \"Ye picked the wrong durned town,\" Bruenor said to Bumpo and Donat when he and the other two returned to Bottom Feeder,\n The two dwarven brothers looked curiously at each other, Donat scratching his head.\n \"Had to be this one,\" Bumpo insisted. \"By yer friend\u0027s description, I mean.\"\n \"The townsfolk might have been lying to us,\" Regis put in.\n \"They\u0027re good at it, then,\" said Catti-brie. \"Every one o\u0027 them.\"\n \"Well, I know a way to find out for certain,\" the halfling said, a mischievous twinkle in his eye. When Bruenor and Catti-brie, recognizing that tone in his voice, turned to regard him, they found him dangling his hypnotic ruby pendant.\n \"Back we go,\" Bruenor said, starting away from the boat once more. He paused and looked back at the four dwarves. \"Ye\u0027re sure, are ye?\" he asked.\n All four heads began wagging enthusiastically.\n Just before the threesome arrived back among the cluster of houses, a small boy ran out to meet them. \"Did you find your friend?\" he asked.\n \"Why no, we haven\u0027t,\" Catti-brie replied, holding back both Bruenor and Regis with a wave of her hand. \"Have ye seen him?\"\n \"He might be in the tower,\" the youngster offered.\n \"What tower?\" Bruenor asked gruffly before Catti-brie could reply.\n \"Over there,\" the young boy answered, unruffled by the dwarf\u0027s stern tone. \"Out back.\" He pointed to the ridge that rose up behind the small village, and as the friends followed that line they noted several villagers ascending the ridge. About halfway up the villagers began gasping in astonishment, some pointing, others falling to the ground, and still others running back the way they had come.\n The three friends began running, too, to the ridge and up. Then they too skidded to abrupt stops, staring incredulously at the tower image of Crenshinibon.\n \"Cadderly?\" Regis asked incredulously.\n \"I\u0027m not thinkin\u0027 so,\" said Catti-brie. Crouching low, she led them on cautiously.\n \"Artemis Entreri wishes this contest between you two at last resolved,\" Jarlaxle confirmed.\n Drizzt\u0027s uncharacteristic outburst made it quite obvious to Jarlaxle just how much he despised Entreri and just how sincere he was in his claim to never want to go against the man again.\n \"Never do you disappoint me,\" Jarlaxle said with a chuckle. \"Your lack of hubris is commendable, my friend. I applaud you for it and do wish, in all sincerity, that I could grant you your desire and send you and your friends on your way. But that I cannot do, I fear, and I assure you that you must settle your relationship with Entreri. For your friends, if not for yourself.\"\n Drizzt chewed on that threat for a long moment. While he did, Jarlaxle waved his hand in front of the mirror beside his chair, which clouded over immediately. As Drizzt watched the fog swirled away, leaving a clear image of Catti-brie, Bruenor, and Regis making their way up to the base of the tower. Catti-brie was in the lead, moving in a staggered manner, trying to utilize the little cover available.\n \"I could kill them with a thought,\" the mercenary assured Drizzt.\n \"But why would you?\" Drizzt asked. \"You gave me your word.\"\n \"And so I shall keep it,\" Jarlaxle replied. \"As long as you cooperate.\"\n Drizzt paused, digesting the information. \"What of Wulfgar?\" he asked suddenly, thinking that Jarlaxle must have some information regarding the man since he\u0027d used Wulfgar\u0027s name to lure Drizzt and his friends to this place.\n Now it was Jarlaxle\u0027s turn to pause and think, but just for a moment. \"He is alive and well from what I can discern,\" the mercenary admitted. \"I have not spoken with him, but looked in on him long enough to find out how his present situation might benefit me.\"\n \"Where?\" Drizzt asked.\n Jarlaxle smiled widely. \"There will be time for such talk later,\" he said, looking back over his shoulder to the one staircase ascending from the room.\n \"You will find that your magics will not work in here,\" the mercenary went on, and Drizzt understood then why his feet seemed heavier. \"None of them, not your scimitars, the bracers you took from Dantrag Baenre when you killed him, nor even your innate drow powers.\"\n \"Yet a new and wondrous aspect of the crystal shard,\" Drizzt remarked sarcastically.\n \"No,\" Jarlaxle admitted, smiling. \"More the help of a friend. It was necessary to defeat all magic, you see, because this last meeting between you and Artemis Entreri must be on perfectly equal footing, with no possible unfair advantages to be gained by either party.\"\n \"Yet your mirror worked,\" Drizzt reasoned, as much trying to buy himself some time as out of any curiosity. \"Is that not magic?\"\n \"It is yet another piece of the tower, nothing I brought in, and all the tower is impervious to my associate\u0027s attempts to defeat the magic,\" Jarlaxle explained. \"What a marvelous gift you gave to me-or to my associate-in handing over Crenshinibon. It has told me so much about itself... how to raise the towers and how to manipulate them to fit my needs\"\n \"You know that I cannot allow you to keep it,\" Drizzt said again.\n \"And you know well that I would never have invited you here if I thought there was anything at all you could do to take Crenshinibon away from me,\" Jarlaxle said with a laugh. He ended the sentence by looking again at the mirror to his side.\n Drizzt followed that gaze to the mirror, to see his friends moving about the base of the tower then, searching for a door-a door that Drizzt knew they would not find unless Jarlaxle willed it to be so. Catti-brie did find something of interest, though: Drizzt\u0027s tracks.\n \"He\u0027s in there!\" she cried.\n \"Please be Cadderly,\" both dark elves heard Regis remark nervously. That brought a chuckle from Jarlaxle.\n \"Go to Entreri,\" the mercenary said more seriously, waving his hand so that the mirror clouded over again, the image dissipating. \"Go and satisfy his curiosity, and then you and your friends will go your way, and I will go mine.\"\n Drizzt spent a long while staring at the mercenary. Jarlaxle didn\u0027t press him for many moments, just locked stares with him. In that moment they came to a silent understanding.\n \"Whatever the outcome?\" Drizzt asked again, just to be sure.\n \"Your friends walk away unharmed,\" Jarlaxle assured him. \"With you, or with your body.\"\n Drizzt turned his gaze back to the staircase. He could hardly believe that Artemis Entreri, his nemesis for so long, awaited him just up those steps. His words to Jarlaxle had been sincere and heartfelt; he never wanted to see the man again, let alone fight with him. That was Entreri\u0027s emotional pain, not Drizzt\u0027s. Even now, with the fight so close and obviously so necessary, the drow ranger did not look forward to his climb up those stairs. It wasn\u0027t that he was afraid of the assassin. Not at all. While Drizzt respected Entreri\u0027s fighting prowess, he didn\u0027t fear the challenge.\n He rose from his chair and started for the stairs, silently recounting all the good he might accomplish in this fight. In addition to satisfying Jarlaxle, Drizzt might well be ridding the world of a scourge.\n Drizzt stopped and turned about. \"This counts as one of my friends,\" he said, producing the onyx figurine from his pouch.\n \"Ah, yes, Guenhwyvar,\" Jarlaxle said, his face brightening.\n \"I will not see Guenhwyvar in Entreri\u0027s hands,\" Drizzt said. \"Nor in yours. Whatever the outcome, she is to be returned to me or to Catti-brie.\"\n \"A pity,\" Jarlaxle remarked with a laugh. \"I had thought you might forget to include the magnificent panther in your conditions. How much I would love a companion such as Guenhwyvar.\"\n Drizzt stood up straighter, lavender eyes narrowing.\n \"You would never trust me with such a treasure,\" Jarlaxle said. \"Nor could I blame you. I do indeed have a weakness for things magical!\" The mercenary was laughing, but Drizzt was not.\n \"Give it to them yourself,\" Jarlaxle offered, motioning for the door. \"Just toss the figurine at the wall, above where you entered. Watch the results for yourself,\" he added, motioning to the mirror, which cleared again of fog and produced an image of Drizzt\u0027s friends.\n The ranger looked back to the door to see a small opening appear right above it. He rushed over. \"Be gone from this place!\" he cried, hoping his friends would hear, and tossed the onyx figurine through the portal. Thinking suddenly that the whole episode might be just one of Jarlaxle\u0027s tricks, he swung about and scrambled to watch in the mirror.\n To his relief he saw the trio, Catti-brie calling for him and Regis picking up the panther from the ground. The halfling wasted no time in setting the thing down and calling to Guenhwyvar, and the cat soon appeared beside Drizzt\u0027s friends, growling out to the trapped drow even as the other three called for him.\n \"You know they\u0027ll not leave,\" Jarlaxle said dryly. \"But go on and be done with this. You have my word that your friends, all four, will not be harmed.\"\n Drizzt hesitated just one more time, glancing back at the mercenary who still sat comfortably in his chair as though Drizzt presented no threat to him whatsoever. For a moment Drizzt considered calling that bluff, drawing his weapons enchanted or not, and rushing over to cut the mercenary down. But he could not, of course, not when the safety of his friends hung in the balance.\n Jarlaxle, so smug in his chair, knew that implicitly.\n Drizzt took a deep breath, trying to throw away all the confusion of this last day, the craziness that had handed the mighty artifact over to Jarlaxle and brought Drizzt to this place, to fight Artemis Entreri, no less.\n He took a second deep breath, stretched out his fingers and arms, and started up the stairs.\n Artemis Entreri paced the room nervously, studying the many contours, staircases, and elevated planks. No simple circular, empty chamber for Jarlaxle. The mercenary had constructed this, the second floor of the tower, with many ups and downs, places where strategy could play in to the upcoming fight. At the center of the room was a staircase of four steps, rising to a landing large enough for only one man. The back side mirrored the front, another four steps back down to the floor level. More steps completely bordered the room, five up to the wall, where another landing ran all the way around. From these, on Entreri\u0027s left, went a plank, perhaps a foot wide, connecting the fourth step to the top landing of the center case.\n Yet another obstacle, a two-sided ramp, loomed near the back wall beside where Entreri paced. Two others, low, circular platforms, were set about the room by the door across the way, the door through which Drizzt Do\u0027Urden would enter.\n But how to make all of these props work for him? Entreri pondered, and he realized that his thoughts mattered little, for Drizzt was too unpredictable a foe, was too quick and quick thinking for Entreri to lay out a plan of attack. No, he would have to improvise every step and roll of the way, to counter and anticipate, and fight in measured thrusts.\n He drew out his weapons then, dagger and sword. At first he had considered coming in with two swords to offset Drizzt\u0027s twin scimitars. In the end he decided to go with the style he knew best, and with the weapon, though its magic would not work in here, that he loved best.\n Back and forth he paced, stretching his muscles, arms, and neck. He talked quietly to himself, reminding himself of all that he had to do, warning himself to never, not for a single instant, underestimate his enemy. And then he stopped suddenly, and considered his own movements, his own thoughts.\n He was indeed nervous, anxious and, for the first time since he had left Menzoberranzan, excited. A slight sound turned him around.\n Drizzt Do\u0027Urden stood on the landing.\n Without a word the drow ranger entered, then flinched not at all as the door slid closed behind him.\n \"I have waited for this for many years,\" Entreri said.\n \"Then you are a bigger fool than I supposed,\" Drizzt replied.\n Entreri exploded into motion, rushing up the back side of the center stairs, brandishing dagger and sword as he came over the lip, as if he expected Drizzt to meet him there, battling for the high ground.\n The ranger hadn\u0027t moved, hadn\u0027t even drawn his weapons.\n \"And a bigger fool still if you believe that I will fight you this day,\" Drizzt said.\n Entreri\u0027s eyes widened. After a long pause he came down the front stairs slowly, sword leading, dagger ready, moving to within a couple of steps of Drizzt. Who still did not draw his weapons. \"Ready your scimitars,\" Entreri instructed. \"Why? That we might play as entertainment for Jarlaxle and his band?\" Drizzt replied.\n \"Draw them!\" Entreri growled. \"Else I\u0027ll run you through.\"\n \"Will you?\" Drizzt calmly asked, and he slowly drew out his blades. As Entreri came on another measured step, the ranger dropped those scimitars to the ground. Entreri\u0027s jaw dropped nearly as far. \"Have you learned nothing in all the years?\" Drizzt asked. \"How many times must we play this out? Must all of our lives be dedicated to revenge upon whichever of us won the last battle?\"\n \"Pick them up!\" Entreri shouted, rushing in so that his sword tip came in at Drizzt\u0027s breastbone.\n \"And then we shall fight,\" Drizzt said nonchalantly. \"And one of us will win, but perhaps the other will survive. And then, of course, we will have to do this all over again, because you believe that you have something to prove.\"\n \"Pick them up,\" Entreri said through gritted teeth, prodding his sword just a bit. Had that blade still been carrying the weight of its magic, the prod surely would have slid it through Drizzt\u0027s ribs. \"This is the last challenge, for one of us will die this day. Here it is, laid out for us by Jarlaxle, as fair a fight as we might ever find.\" Drizzt didn\u0027t move.\n \"I will run you through,\" Entreri promised. Drizzt only smiled. \"I think not, Artemis Entreri. I know you better than you believe, and surely better than you are comfortable with. You would take no pleasure in killing me in such a manner and would hate yourself for the rest of your life for doing so, for stealing from yourself the only chance you might ever have to know the truth. Because that is what this is about, is it not? The truth, your truth, the moment when you hope to either validate your miserable existence or put an end to it.\"\n Entreri growled loudly and came forward, but he did not, could not, press his arm forward and impale the drow. \"Damn you!\" he cried, spinning away, growling and slashing, back around the stairs, cursing with every step. \"Damn you!\"\n Behind him Drizzt nodded, bent, and retrieved his scimitars. \"Entreri,\" he called, and the change in his tone told the assassin that something was suddenly very different.\n Entreri, on the other side of the room now, turned about to see Drizzt standing ready, blades in hand, to see the vision he so desperately craved.\n \"You passed my test,\" Drizzt explained. \"Now I\u0027ll take yours.\"\n \"Are we to watch or just wait to see who shall walk out victorious?\" Rai\u0027gy asked as he and Kimmuriel walked out from a small chamber off to the side of the first floor\u0027s main room.\n \"This show will be worth the watching,\" Jarlaxle assured the pair. He motioned to the stairs. \"We will ascend to the landing, and I will make the door translucent.\"\n \"An amazing artifact,\" Kimmuriel said, shaking his head. In only a day of communing with the crystal shard Jarlaxle had learned so very much. He had learned how to shape and design the tower reflection of the shard, to make doors appear and seemingly vanish, to create walls, transparent or opaque, and to use the tower as one great scrying device, as he was now. Both Kimmuriel and Rai\u0027gy noted this as they came around to see the image of Catti-brie, Regis, Bruenor, and the great cat showing in the mirror.\n \"We shall watch, and they should as well,\" Jarlaxle said. He closed his eyes, and all three drow heard a scraping sound along the outside of Crenshinibon. \"There,\" Jarlaxle announced a moment later. \"Now we may go.\"\n Catti-brie, Bruenor, and Regis stood dumbfounded as the crystalline tower seemed to snake to life, one edge rolling out wide, releasing a hidden fold. Then, amazingly, a stairway appeared, circling down along the tower from a height of about twenty feet.\n The three hesitated, looking to each other for answers, but Guenhwyvar waited not at all, bounding up the stairs, roaring with every mighty leap.\n They stared at each other for some time, looks of respect more than hatred, for they had come past hatred, these two, losing a good deal of their enmity by the sheer exertions of their running battle.\n So now they stared from opposite sides of the thirty-foot diameter room, across the central stairs, each waiting for the other to make the first move, or rather, for the other to show that he was about to move.\n They broke as one, both charging for the center stairs, both seeking the higher ground. Even without the aid of the magical bracers Drizzt gained a step advantage, perhaps because though he was twice the assassin\u0027s actual age, he was much younger in terms of a drow lifetime than Entreri was for a human.\n Always the improviser, Entreri took one step on the staircase, then dived to the side, headlong in a roll that brought him harmlessly past Drizzt\u0027s swishing blades. He went right under the raised plank, using it as a barrier against the scimitars.\n Drizzt turned completely around, falling into a ready crouch at the top of the stairs and preventing Entreri from coming back in.\n But Entreri knew that the ranger would protect his highground position, and so the assassin never slowed, coming out of his roll back to his feet and running to the side of the room, up the five steps, then moving along that higher ground to the end of the raised plank. When Drizzt did not pursue, neither by following Entreri\u0027s course nor rushing across the plank, Entreri hopped down to that narrow walkway and moved halfway along it toward the center stair.\n Drizzt held his ground on the wider platform of the staircase apex.\n \"Come along,\" Entreri bade him, indicating the walkway. \"Even footing.\"\n They feared climbing that stair, for how vulnerable they would all be perched on the side of Crenshinibon, but when Guenhwyvar, at the landing and looking into the tower, roared louder and began clawing at the wall they could not resist. Again Catti-brie arrived first to find a translucent wall at the top of the stairs, a window into the room where Drizzt and Entreri faced off.\n She banged on the unyielding glass. So did Bruenor when he arrived, with the back of his axe, but to no avail, for they could not even scratch the thing. If Drizzt and Entreri heard them, or even saw them, neither showed it.\n \"You should have made the room smaller,\" Rai\u0027gy remarked dryly when he, Jarlaxle, and Kimmuriel arrived at their landing, similarly watching the action-or lack thereof within.\n \"Ah, but the play\u0027s the thing,\" Jarlaxle replied. He pointed across the way then, to Catti-brie and the others. \"We can see the combatants and Drizzt\u0027s friends across the way, and those friends can see us,\" he explained, and even as he did so the three drow saw Catti-brie pointing their way, screaming something that they could not hear but could well imagine. \"But Drizzt and Entreri can see only each other.\"\n \"Quite a tower,\" Rai\u0027gy had to admit.\n Drizzt wanted to hold the secure position, but Entreri showed patience now, and the ranger knew that if he did not go out, this fight that he desperately wanted to be done with could take a long, long time. He hopped onto the narrow walkway easily and came out toward Entreri slowly, inch by inch, setting each foot firmly before taking the next small step.\n He snapped into sudden motion as he neared, a quick-step thrust of his right blade. Entreri\u0027s dagger, his left-hand weapon, wove inside the thrust perfectly and pushed the scimitar out wide. In the same fluid movement the assassin turned his shoulder and moved ahead, sword tip leading.\n Drizzt\u0027s second scimitar was halfway into the parry before the thrust ever began, turning a complete circle in the air, then ascending inside the angle of the thrust on the second pass, deflecting the rushing sword, rolling right over it and around as his first blade did the same with the dagger. Into the dance fully he went, his curving blades accentuating the spinning circular motions, cutting over and around, reversing the direction of one, then both, then one again. Spinning, seeking opening, thrusting ahead, slashing down.\n And Entreri matched every movement, his actions in straighter lines, straight to the side or above or straight ahead, picking off the blades, forcing Drizzt to parry. The metal screamed continuously, hit after hit after hit.\n But then Drizzt\u0027s left hand came in cleanly and cleanly swished through the air, for the assassin did not try to parry but dived into a forward roll instead, his sword knocking one scimitar at bay, his movement causing the other to miss, and his dagger, leading the ascent out of the roll, aimed for Drizzt\u0027s heart with no chance for the ranger to bring his remaining scimitar in to block.\n So up went Drizzt, up and out, a great leap to the left side, tucking and turning to avoid the strike, landing on the floor in a roll that brought him back to his feet. He took two running steps away as he spun about, knowing that Entreri, slight advantage gained, would surely pursue. He came around just in time to meet a furious attack from dagger and sword.\n Again the metal rang out repeatedly in protest, and Drizzt was forced back by the sheer momentum of Entreri\u0027s charge. He accepted that retreat, though, quick-stepping all the way to maintain perfect balance, his hands working in a blur.\n At the interior landing the three drow, who had lived all their lives around expert swordsmen and had witnessed many, many battles, watched every subtle movement with mounting amazement.\n \"Did you arrange this for Entreri\u0027s benefit or ours?\" Rai\u0027gy remarked, his tone surely different, surely without hint of sarcasm.\n \"Both,\" Jarlaxle admitted. As he spoke, Drizzt darted past Entreri up the center stairs and did not stop, but rather leaped off, turning in midair as he went, then landing in a rush back to the side toward the plank. Entreri took a shorter route instead of a direct pursuit, leaping up to the plank ahead of Drizzt, stealing the advantage the dark elf had hoped to achieve.\n As much the improviser as his opponent, Drizzt dived down low, skittering under the plank even as Entreri got his footing, and slashing back up and over his head, an amazingly agile move that would have hamstrung the assassin had Entreri not anticipated just that and continued on his way, leaping off the plank back to the floor and turning around.\n Still, Drizzt had scored a hit, tearing the back of Entreri\u0027s trousers and a line across the back of his calf.\n \"First blood to Drizzt,\" Kimmuriel observed. He looked to Jarlaxle, who was smiling and looking across the way. Following the mercenary\u0027s gaze Rai\u0027gy saw that Drizzt\u0027s friends, including even the panther, were similarly entranced, watching the battle with open-mouthed admiration.\n And so it was well-earned, Kimmuriel silently agreed, turning his full attention back to the dance, brutal and beautiful all at once.\n Now they came in at floor level, rushing together in a blur of swords and flying capes, their routines neither attack nor defense, but somewhere in between. Blade scraped along blade, throwing sparks, the metal shrieking in protest.\n Drizzt\u0027s left blade swished across at neck level. Entreri dropped suddenly below it into a squat from which he seemed to gain momentum, coming back up with a double thrust of sword and dagger. But Drizzt didn\u0027t stop his turn with the miss. The dark elf went right around, a complete circuit, coming back with a right-handed, backhand down-and-over parry. The inside hook of his curving blade caught both the assassin\u0027s blades and turned them aside. Then Drizzt altered the angle of his left before it swished overhead, the blade screaming down for Entreri\u0027s head.\n But the assassin, his hands even closer together because of Drizzt\u0027s block, switched blades easily, then extracted the dagger by bringing his right arm in suddenly, pumping it back out, dagger tip rising as scimitar descended.\n Then they both howled in pain, Drizzt leaping back with a deep puncture in his wrist, Entreri falling back with a gash along the length of his forearm.\n But only for a second, only for the time it took each to realize that he could continue, that he would not\n drop a weapon. Both Drizzt\u0027s scimitars started out wide, closing like the jaws of a wolf as he and Entreri came together. The assassin, though his blades had the inside track, found himself a split second behind and had to double block, throwing his own blades, and the scimitars they caught, out wide and coming forward with the momentum. He hesitated just an instant to see if he could possibly bring one of his blades back in.\n Drizzt hadn\u0027t hesitated at all, though, dipping his forehead just ahead of Entreri\u0027s similar movement, so that when they came smacking together, head to head, Entreri got the brunt of it.\n But the assassin, dazed, punched out straight with his right hand, knuckles and dagger crosspiece slamming into Drizzt\u0027s face.\n They fell apart again, one of Entreri\u0027s eyes fast swelling, Drizzt\u0027s cheek and nose bleeding.\n The assassin pressed the attack fiercely then, before his eye closed and gave Drizzt a huge advantage. He went in hard, stabbing his sword down low.\n Drizzt\u0027s scimitar crossed down over it, and he pivoted perfectly, launching a kick that got Entreri in the face.\n The kick hardly slowed him, for the assassin had anticipated that exact move indeed, he had counted on it. He ducked as the foot came in, a grazing blow, but one that nonetheless stung his already injured eye. Skittering forward he launched his dagger in a roundabout manner, the edge coming in at the back of Drizzt\u0027s knee.\n Drizzt could have struck with his second blade, hoping to get it past the already engaged sword, but if he tried and Entreri somehow managed to parry, he knew that the fight would be all but over, that the dagger would tear the back out of his leg.\n He knew all of that, instinctively, without thinking at all, so instead he just kicked his one supporting leg forward, falling backward over the dagger. Drizzt was scraped but not skewered. He meant to go all the way around in the roll and come right back up to his feet, but before he even really started he saw that the growling Entreri was fast pursuing and would catch him defenseless halfway around.\n So he stopped and set himself on his back as the assassin came in.\n On both sides of the room, dark elves and Drizzt\u0027s friends alike gasped, thinking the contest at its end. But Drizzt fought on, scimitars whirling, smacking, and stabbing to somehow, impossibly, hold Entreri at bay. And then the ranger managed to tuck one foot under him and come up in a wild rush, fighting ferociously, hitting each of Entreri\u0027s blades and hitting them hard, driving, driving to gain an equal footing.\n Now they were in it, face to face, blades working too quickly for the onlookers to even discern individual moves, but rather to watch the general flow of the battle. A gash appeared here on one combatant, a gash appeared there on the other, but neither warrior found the opportunity to bring any cut to completion. They were superficial nicks, torn clothes and skin. It went on and on, up one side of the staircase and down the other, and any misgivings that Drizzt might have had about this fight had long flown, and any doubts Entreri had ever had about desiring to battle Drizzt Do\u0027Urden again had been fully erased. They fought with passion and fury, their blades striking so rapidly that the ring came as constant.\n They were out on the plank then, but they didn\u0027t know it. They came down together, each knocking the other from his perch, on opposite sides, then went under the plank together, battling in a crouch. They moved past each other, coming up on either side, then leaping back atop the narrow walkway in perfect balance to begin anew.\n On and on it went, and the seconds became minutes, and sweat mixed with blood and stung open wounds. One of Drizzt\u0027s sleeves got sliced so badly that it interfered with his movements, and he had to launch an explosive flurry to drive Entreri back long enough so he could flip his blade in the air and pull the remnants of the sleeve from his arm, then catch his blade as it descended, just in time to react to the assassin\u0027s charge. A moment later Entreri lost his cape as Drizzt\u0027s scimitar came in for his throat, cutting the garment\u0027s drawstring and tearing a gash under Entreri\u0027s chin as it rose.\n Both labored for breath; neither would back off.\n But for all the nicks and blood, for all the sweat and bruises, one injury alone stood out, for Entreri\u0027s vision on his right side was indeed blurring. The assassin switched weapon hands, dagger back in left and the longer, better blocking sword back in his right.\n Drizzt understood. He launched a feint, a right, left, right combination that Entreri easily picked off, but the attacks had not been designed to score any definitive hit anyway, just to allow Drizzt to put his feet in line.\n To the side of the room cunning Jarlaxle saw it and understood that the fight was about to end.\n Now Drizzt came in again with a left, but he stepped into the blow and launched his scimitar from far out to the side, from a place where Entreri\u0027s closed eye could hardly make out the movement. The assassin did instinctively parry with the sword and counter with the dagger, but Drizzt rolled his scimitar right over the intended parry, then snapped it back out, slashing Entreri\u0027s wrist and launching the sword away. At the same time, the ranger dropped his blade from his right hand and caught Entreri\u0027s stabbing dagger arm at the wrist. Stepping in and rolling his wrist and turning his weapon hand, Drizzt twisted Entreri\u0027s dagger arm back under itself, holding it out wide while before the assassin\u0027s free hand could hold Drizzt\u0027s arm back the dark elf\u0027s scimitar tip came in at Entreri\u0027s throat.\n All movement stopped suddenly. The assassin, with one arm twisted out wide and the other behind Drizzt\u0027s scimitar arm, was helpless to stop the ranger\u0027s momentum if Drizzt decided to plunge the blade through Entreri\u0027s throat.\n Growling and trembling, as close to the very edge of control as he had ever been, Drizzt held the blade back. \"So what have we proven?\" he demanded, voice full of venom, his lavender orbs locked in a wicked stare with Entreri\u0027s dark eyes. \"Because my head connected in a favorable place with yours, limiting your vision, I am the better fighter?\"\n \"Finish it!\" Entreri snarled back.\n Drizzt growled again and twisted Entreri\u0027s dagger arm more, bending the assassin\u0027s wrist so that the dagger fell to the floor. \"For all those you have killed, and all those you surely will, I should kill you,\" Drizzt said, but he knew even as he said the words, and Entreri did, too, that he could not press home his blade, not now. In that awful moment Drizzt lamented not going through with the move in the first instant, before he had found the time to consider his actions.\n But now he could not, so with a sudden explosion of motion he let go of Entreri\u0027s arm and drove his open palm hard into the assassin\u0027s face, disengaging them and knocking Entreri staggering backward.\n \"Damn you, Jarlaxle, have you had your pleasure?\" Drizzt cried, turning about to see the mercenary and his companions, for Jarlaxle had opened the door.\n Drizzt came forward determinedly, as if he meant to run right over Jarlaxle, but a noise behind him stopped him, for Entreri came on, yelling.\n Yelling. The significance of that was lost on Drizzt in that moment as he spun about, right to left, his free right arm brushing out and across, lifting Entreri\u0027s leading arm, which held again that awful dagger. And around came Drizzt\u0027s left arm, scimitar leading, in a stab as Entreri crashed in, a stab that should have plunged the weapon into the assassin\u0027s chest to its hilt.\n The two came together and Drizzt\u0027s eyes widened indeed, for somehow, somehow, Entreri\u0027s very skin had repelled the blow.\n But Artemis Entreri, his body tingling with the energy of the absorbed hit, with the psionics Kimmuriel had suddenly given back to him, surely understood, and in a purely reactive move, without any conscious thought-for if the tormented man had considered it he would have loosed the energy back into himself-Entreri reached out and clasped Drizzt\u0027s chest and gave him back his blow with equal force.\n His hand sank into Drizzt\u0027s chest even as Drizzt, blood bubbling from the wound, fell to the ground.\n Out on the landing time seemed to freeze, stuck fast in that awful, awful moment. Guenhwyvar roared and leaped into the translucent wall, but merely bounced away. Outraged, roaring wildly, the cat went back at the wall, claws screeching against the unyielding pane.\n Bruenor, too, went into a fighting frenzy, hacking futilely with his axe while Regis stood dumbfounded, saying, \"No, it cannot be,\" over and over.\n And there stood Catti-brie, wavering back and forth, her jaw drooping open, her eyes locked on that horrible sight. She suffered through every agonizing second as Entreri\u0027s empowered hand melted into Drizzt\u0027s chest, as the lifeblood of her dearest friend, of the ranger she had come to love so dearly, spurted from him. She watched the strength leave his legs, the buckling knees, and the sinking, sinking as Entreri guided him to the floor, and the sinking, sinking, of her own heart, an emptiness she had felt before, when she had seen Wulfgar fall with the yochlol.\n And even worse it seemed for her this time.\n \"What have I done?\" the assassin wailed, falling to his knees beside the drow. He turned an evil glare over Jarlaxle. \"What have you done?\"\n \"I gave you your fight and showed you the truth,\" Jarlaxle calmly replied. \"Of yourself and your skills. But I am not finished with you. I came to you for my own purposes, not your own. Having done this for you, I demand that you perform for me.\"\n \"No! No!\" the assassin cried, reaching down furiously to try to stem the spurting blood. \"Not like this!\"\n Jarlaxle looked to Kimmuriel and nodded. The psionicist gripped Entreri with a mental hold, a telekinetic force that lifted Entreri from Drizzt and dragged him behind Kimmuriel as the psionicist headed out of the room, back down the stairs.\n Entreri thrashed and cursed, aiming his outrage at Jarlaxle but eyeing Drizzt, who lay very still on the floor. Indeed he had been granted his fight and, indeed, as he should have foreseen, it had proven nothing. He had lost-or would have, had not Kimmuriel intervened-yet he was the one who had lived.\n Why, then, was he so angry? Why did he want at that moment, to put his dagger across Jarlaxle\u0027s slender throat?\n Kimmuriel hauled him away.\n \"He fought beautifully,\" Rai\u0027gy remarked to Jarlaxle, indicating Drizzt, the blood flowing much lighter now, a pool of it all about his prone and very still form. \"I understand now why Dantrag Baenre is dead.\"\n Jarlaxle nodded and smiled. \"I have never seen Drizzt Do\u0027Urden\u0027s equal,\" he admitted, \"unless it is Artemis Entreri. Do you understand now why I chose that one.\"\n \"He is drow in everything but skin color,\" Rai\u0027gy said with a laugh.\n An explosion rocked the tower.\n \"Catti-brie and her marvelous bow,\" Jarlaxle explained, looking to the landing where only Guenhwyvar remained, roaring and clawing futilely at the unyielding glass. \"They saw, of course, every bit of it. I should go and speak with them before they bring the place down around us.\"\n With a thought to the crystal shard, Jarlaxle turned that wall in front of Guenhwyvar opaque once more.\n Then he nodded to the still form of Drizzt Do\u0027Urden and walked out of the room. \n","sourceLink":"https://allnovel.net/the-silent-blade-paths-of-darkness-1/page-24.html","bookId":2131,"book":{"id":2131,"title":"The Silent Blade (Paths of Darkness #1)","description":"Storyline: \n The Silent Blade (Paths of Darkness #1) \n Can the Crystal Shard be destroyed at last? Drizzt is determined to destroy the evil Crystal Shard, and seeks out the help of the scholar-priest Cadderly. But instead, his worst fears are realized, and Crenshinibon falls into the hands of the dark elf mercenary Jarlaxle and his unlikely ally Artemis Entreri. The Silent Blade is the book that brought Drizzt back to the Realms, and was a New York Times best seller on its initial release--and has been in print every day since. Like the rest of the Legend of Drizzt(R) reissues, The Silent Blade features beautiful new cover art by award-winning illustrator Todd Lockwood.\n \n","cover":"https://allnovel.net/images/the-silent-blade-paths-of-darkness-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-silent-blade-paths-of-darkness-1.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:08:15 PM"}}
