{"id":94478,"no":4,"title":"Page 4","content":"Well would you do to this one investigate,\" Giunta the Diviner said to Hand as the man left the wizard\u0027s house. \"Danger I sense, and we both know who it may be, though to speak the name we fear.\"\n Hand mumbled a reply and continued on his way, glad to be gone from the excitable wizard and Giunta\u0027s particularly annoying manner of structuring a sentence, one the wizard claimed came from another plane of existence, but that Hand merely considered Giunta\u0027s way of trying to impress those around him. Still, Giunta had his uses, Hand recognized, for of the dozen or so wizards the Basadoni house often utilized, none could unravel mysteries better than Giunta. From simply sensing the emanations of the strange coins Giunta had almost completely reconstructed the conversation between Hand, Kadran, and Sharlotta, as well as the identity of Taddio as the courier of the coins. Looking deeper, Giunta\u0027s face had turned into a profound frown, and as he had described the demeanor and general appearance of the one who had given the coins to Taddio, both he and Hand began to put the pieces together.\n Hand knew Artemis Entreri. So did Giunta, and it was common knowledge among the street folk that Entreri had left Calimport in pursuit of the dark elf who had brought about the downfall of Pasha Pook, and that the drow was reportedly living in some dwarven city not far from Silverymoon.\n Now that his suspicions pointed in a particular direction, Hand knew it was time to turn from magical information gathering to more conventional methods. He went out to the streets, to the many spies, and opened wide the eyes of Pasha Basadoni\u0027s powerful guild. Then he started back to the main house to speak with Sharlotta and Kadran but changed his mind. Indeed, Sharlotta had spoken truthfully when she had said that she desired knowledge of her enemies.\n Better for Hand that she didn\u0027t know.\n His room was hardly fitting for a man who had climbed so high among the ranks of the street. This man had been a guildmaster, albeit briefly, and could command huge sums of money from any house in the city simply as a retainer fee for his services. But Artemis Entreri didn\u0027t care much about the sparse furnishings of the cheap inn, about the dust piled on the window sills, about the noise of the street ladies and their clients in the adjoining rooms.\n He sat on the bed and thought about his options, reconsidering all his movements since returning to Calimport. He had been a bit careless, he realized, particularly in going to the stupid boy who was now claiming rulership of his old shanty town and by showing his dagger to the beggar at Pook\u0027s old house. Perhaps, Entreri realized, that journey and encounter had been no coincidence or bad luck, but by subconscious design.\n Perhaps he had wanted to reveal himself to any who would look closely enough.\n But what would that mean? he had to wonder now. How had the guild structures changed, and where in those new hierarchies would Artemis Entreri fit in? Even more importantly, where did Artemis Entreri want to fit in?\n Those questions were beyond Entreri at that time, but he realized that he could not afford to sit and wait for others to find him. He should learn some of the answers, at least, before dealing with the more powerful houses of Calimport. The hour was late, well past midnight, but the assassin donned a dark cloak and went out onto the streets anyway.\n The sights and sounds and smells brought him back to his younger days, when he had often allied with the dark of night and shunned the light of day. He noticed before he had even left the street that many gazes had settled upon him, and he sensed that they focused with more than a passing interest, more than the attention a foreign merchant might expect. Entreri recalled his own days on these streets, the methods and speed with which information was passed along. He was already being watched, he knew, and probably by several different guilds. Possibly the tavern keeper where he was staying or one of the patrons, perhaps, had recognized him or had recognized enough about him to raise suspicions. These people of Calimport\u0027s foul belly lived on the edge of disaster every minute of every day. Thus they possessed a level of alertness beyond anything so many other cultures might know. Like grassland field rats, rodents living in extensive burrow complexes with thousands and thousands of inhabitants, the people of Calimport\u0027s streets had designed complex warning systems: shouts and whistles, nods, and even simple body posture.\n Yes, Entreri knew as he walked along the quiet street, his practiced footsteps making not a sound, they were watching him.\n The time had come for him to do some looking of his own and he knew where to start. Several turns brought him to Avenue Paradise, a particularly seedy place where potent herbs and weeds were openly traded, as were weapons, stolen goods, and carnal companionship. A mockery of culture itself, Avenue Paradise stood as the pinnacle of hedonism among the underclass. Here a beggar, if he found a few extra coins that day, could, for a few precious moments, feel like a king, could surround himself with perfumed ladies and imbibe enough mind-altering substances to forget the sores that festered on his filthy skin. Here, one like the boy that Entreri had paid in his old shanty town could live, for a few hours, the life of pasha Basadoni.\n Of course it was all fake, fancy facades on rat-ridden buildings, fancy clothes on scared little girls or dead-eyed whores, heavily perfumed with cheap smells to hide the months of sweat and dust without a proper bath. But even fake luxury would suffice for most of the street people, whose constant misery was all too real.\n Entreri walked slowly along the street, dismissing his introspection and turning his eyes outward, studying every detail. He thought he recognized more than one of the older, pitiful whores, but in truth, Entreri had never succumbed to such unhealthy and tawdry temptations as could be found on Avenue Paradise. His carnal pleasures, on those very few occasions he took them (for he considered them a weakness to one aspiring to be the perfect fighter), came in the harems of mighty pashas, and he had never held any tolerance whatsoever for anything intoxicating, for anything that dulled his keen mind and left him vulnerable. He had come to Avenue Paradise often, though, to find others too weak to resist. The whores had never liked him, nor had he ever bothered with them, though he knew, as did all the pashas, that they could be a very valuable source of information. Entreri simply could not bring himself to ever trust a woman who made her daily life in that particular line of employ.\n So now he spent more time looking at the thugs and pickpockets and was amused to learn that one of the pickpockets was also studying him. Hiding a grin, he even changed his course to bring himself closer to the foolish young man.\n Sure enough, Entreri was barely ten strides past when the thief came out behind him, walking past and \"slipping\" at the last moment to cover his reach for Entreri\u0027s dangling purse.\n A split second later, the would-be thief was off balance, turned in and down, with Entreri\u0027s hand clamped over the ends of his fingers, squeezing the most exquisite pain up the man\u0027s arm. Out came the jeweled dagger, quietly but quickly, its tip poking a tiny hole in the man\u0027s palm as Entreri turned his shoulder in closer to conceal the movement and lessened his paralyzing grip.\n Obviously confused at the relief of pressure on his pained hand, the thief moved his free hand to his own belt, pulling aside his cloak and grabbing at a long knife.\n Entreri stared hard and concentrated on the dagger, instructing it to do its darker work, using its magic to begin sucking the very life-force out of the foolish thief.\n The man weakened, his dagger fell harmlessly to the street, and both his eyes and his jaw opened wide in a horrified, agonized, and ultimately futile attempt at a scream.\n \"You feel the emptiness,\" Entreri whispered to him. \"The hopelessness. You know that I hold not only your life, but your very soul in my hands.\"\n The man didn\u0027t, couldn\u0027t move.\n \"Do you?\" Entreri prompted, bringing a nod from the now gasping man.\n \"Tell me,\" the assassin bade, \"are there any halflings on the street this night?\" As he spoke, he let up a bit on the life-stealing process, and the man\u0027s expression shifted again, just a bit, to one of confusion.\n \"Halflings,\" the assassin explained, punctuating his point by drawing hard on the man\u0027s life-force again, so forcefully that the only thing holding the man up was Entreri\u0027s body.\n With his free hand, trembling violently through every inch of movement, the thief pointed farther down the avenue in the general direction of a few houses that Entreri knew well. He thought to ask the man a more focused question or two but decided against it, realizing that he might have revealed too much of his identity already by the mere hunger of his particular jeweled dagger.\n \"If I ever see you again, I shall kill you,\" the assassin said with such complete calm that all the blood ran from the thief\u0027s face. Entreri released him, and he staggered away, falling to his knees and crawling on. Entreri shook his head in disgust, wondering, and not for the first time, why he had ever come back to this wretched city.\n Without even bothering to look and ensure that the thief continued away, the assassin strode more quickly down the street. If the particular halfling he sought was still about and still alive, Entreri could guess which of those buildings he might be in. The middle and largest of the three, The Copper Ante, had once been a favorite gambling house for many of the halflings in the Calimport dock section, mostly because of the halfling-staffed brothel upstairs and the Thayan brown pipeweed den in the back room. Indeed, Entreri did see many (considering that this was Calimport, where halflings were scarce) of the little folk scattered about the various tables in the common room when he entered. He scanned each table slowly, trying to guess what his former friend might look like now that several years had passed. The halfling would be wider about the belly, no doubt, for he loved rich food and had set himself up in a position to afford ten meals a day if he so chose.\n Entreri slipped into an open seat at one table where six halflings tossed dice, each moving so quickly that it was almost impossible for a novice gambler to even tell which call the one at the head of the table was making and which halfling was grabbing which pot as winnings for which throw. Entreri easily sorted it out, though, and found, to his amusement but hardly his surprise, that all six were cheating. It seemed more a contest of who could grab the most coins the fastest than any type of gambling, and all half dozen appeared to be equally suited to the task, so much so that Entreri figured that each of them would likely leave with almost exactly the amount of coins with which he had begun.\n The assassin dropped four gold pieces on the table and grabbed up some dice, giving a half-hearted throw. Almost before the dice stopped rolling, the closest halfling reached for the coins, but Entreri was the quicker, slapping his hand over the halfling\u0027s wrist and pinning it to the table.\n \"But you lost!\" the little one squeaked, and the flurry of movement came to an abrupt halt, the other five looking at Entreri and more than one reaching for a weapon. The gaming stopped at several other tables, as well, the whole area of the common room focusing on the coming trouble.\n \"I was not playing,\" Entreri said calmly, not letting the halfling go.\n \"You put down money and threw dice,\" one of the others protested. \"That is playing.\"\n Entreri\u0027s glare put the complaining halfling back in his seat. \"I am playing when I say, and not before,\" he explained. \"And I only cover bets that are announced openly before I throw.\"\n \"You saw how the table was moving,\" a third dared to argue, but Entreri cut him short with an upraised hand and a nod.\n He looked to the gambler at his right, the one who had reached for the coins, and waited a moment to let the rest of the room settle down and go back to their own business. \"You want the coins? They, and twice that amount above them, shall be yours,\" he explained, and the greedy halfling\u0027s expression went from one of distress to a gleaming-eyed grin. \"I came not to play but to ask a simple question. Provide an answer, and the coins are yours.\" As he spoke, Entreri reached into his purse and brought out more coins-more than twice the number the halfling had grabbed.\n \"Well, Master ...\" the halfling began.\n \"Do\u0027Urden,\" Entreri replied, with hardly a conscious thought, though he had to bite back a chuckle at the irony after he heard the name come out of his mouth. \"Master Do\u0027Urden of Silverymoon.\"\n All the halflings at the table eyed him curiously, for the unusual name sounded familiar to them all. In truth, and they came to realize it one by one, they all knew that name. It was the name of the dark elven protector of Regis, perhaps the highest ranking (albeit for a short while!) and most famous halfling ever to walk the streets of Calimport.\n \"Your skin has-\" the halfling pinned under Entreri\u0027s grasp started to remark lightheartedly, but he stopped, swallowed hard and blanched as he put the pieces together. Entreri could see the halfling recall the story of Regis and the dark elf, and the one who had subsequently deposed the halfling guildmaster and then gone out after the drow.\n \"Yes,\" the halfling said as calmly as he could muster, \"a question.\"\n \"I seek one of your kind,\" Entreri explained. \"An old friend by the name of Dondon Tiggerwillies.\"\n The halfling put on a confused look and shook his head, but not before a flicker of recognition has crossed his dark eyes, one the sharp Entreri did not miss.\n \"Everyone of the streets knows Dondon,\" Entreri stated. \"Or once knew of him. You are not a child, and your gaming skills tell me that you have been a regular to the Copper Ante for years. You know, or knew, Dondon. If he is dead, then I wish to hear the story. If not, then I wish to speak with him.\"\n Grave looks passed from halfling to halfling. \"Dead,\" said one across the table, but Entreri knew from the tone and the quick manner in which the diminutive fellow blurted it out that it was a lie, that Dondon, ever the survivor, was indeed alive.\n Halflings in Calimport always seemed to stick together, though.\n \"Who killed him?\" Entreri asked, playing along.\n \"He got sick,\" another halfling offered, again in that quick, telltale manner.\n \"And where is he buried?\"\n \"Who gets buried in Calimport?\" the first liar replied.\n \"Tossed into the sea,\" said another.\n Entreri nodded with every word. He was actually a bit amused at how these halflings played off each other, building an elaborate lie and one the assassin knew he could eventually turn against them.\n \"Well, you have told me much,\" he said, releasing the halfling\u0027s wrist. The greedy gambler immediately went for the coins, but a jeweled dagger jabbed down between the reaching hand and the desired gems in the blink of a startled eye.\n \"You promised coins!\" the halfling protested.\n \"For a lie?\" Entreri calmly asked. \"I inquired about Dondon outside and was told that he was in here. I know he is alive, for I saw him just yesterday.\"\n The halflings all glanced at each other, trying to piece together the inconsistencies here. How had they fallen so easily into the trap?\n \"Then why speak of him in the past tense?\" the halfling directly across the table asked, the first to insist that Dondon was dead. This halfling thought himself sly, thought that he had caught Entreri in a lie ... as indeed he had.\n \"Because I know that halflings never reveal the whereabouts of other halflings to one who is not a halfling,\" Entreri answered, his demeanor changing suddenly to a lighthearted, laughing expression, something that had never come easily to the assassin. \"I have no fight with Dondon, I assure you. We are old friends, and it has been far too long since we last spoke. Now, tell me where he is and take your payment.\"\n Again the halflings looked around, and then one, licking his lips and staring hungrily at the small pile of coins, pointed to a door at the back of the large room.\n Entreri replaced the dagger in its sheath and gave a gesture that seemed a salute as he moved from the table, walking confidently across the room and pushing through the door without even a knock.\n There before him reclined the fattest halfling he had ever seen, a creature wider than it was tall. He and the assassin locked stares, Entreri so intent on the fellow that he hardly noticed the scantily clad female halflings flanking him. It was indeed Dondon Tiggerwillies, Entreri realized to his horror. Despite all the years and all the scores of pounds, he knew the halfling, once the slipperiest and most competent confidence swindler in all of Calimport.\n \"A knock is often appreciated,\" the halfling said, his voice raspy, as though he could hardly force the sounds from his thick neck. \"Suppose that my friends and I were engaged in a more private action.\"\n Entreri didn\u0027t even try to figure out how that might be possible.\n \"Well, what do you want, then?\" Dondon asked, stuffing an enormous bite of pie into his mouth as soon as he finished speaking.\n Entreri closed the door and walked into the room, halving the distance between him and the halfling. \"I want to speak with an old associate,\" he explained.\n Dondon stopped chewing and stared hard. Obviously stunned by recognition, he began violently choking on the pie and wound up spitting a substantial piece of it back onto his plate. His attendants did well to hide their disgust as they moved the plate aside.\n \"I did not... I mean, Regis was no friend of mine. I mean . . .\" Dondon stammered, a fairly common reaction from those faced with the spectre of Artemis Entreri.\n \"Be at ease, Dondon,\" Entreri said firmly. \"I came to speak with you, nothing more. I care not for Regis, nor for any role Dondon might have played in the demise of Pook those years ago. The streets are for the living, are they not, and not the dead?\"\n \"Yes, of course,\" Dondon replied, visibly trembling. He rolled forward a bit, trying to at least sit up, and only then did Entreri notice a chain trailing a thick anklet he wore about his left leg. Finally, the fat halfling gave up and just rolled back to his previous position. \"An old wound,\" he said with a shrug.\n Entreri let the obviously ridiculous excuse slide past. He moved closer to the halfling and went down in a crouch, brushing aside Dondon\u0027s robes that he could better see the shackle. \"I have only recently returned,\" he explained. \"I hoped that Dondon might enlighten me concerning the current demeanor of the streets.\"\n \"Rough and dangerous, of course,\" Dondon answered with a chuckle that became a phlegm-filled cough.\n \"Who rules?\" Entreri asked in a dead serious tone. \"Which houses hold power, and what soldiers champion them?\"\n \"I wish that I could be of help to you, my friend,\" Dondon said nervously. \"Of course I do. I would never withhold information from you. Never that! But you see,\" he added, lifting up his shackled ankle, \"they do not let me out much anymore.\"\n \"How long have you been in here?\"\n \"Three years.\"\n Entreri stared incredulously and distastefully at the little wretch, then looked doubtfully at the relatively simple shackle, a lock that the old Dondon could have opened with a piece of hair.\n In response, Dondon held up his enormously thick hands, hands so pudgy that he couldn\u0027t even bring the higher parts of his fingers together. \"I do not feel much with them anymore,\" he explained.\n A burning outrage welled inside Entreri. He felt as if he would simply explode into a murderous fit that would have him physically shaving the pounds from Dondon\u0027s fat hide with his jeweled dagger. Instead, he went at the lock, turning it roughly to scan for any possible traps, then reaching for a small pick.\n \"Do not,\" came a high-pitched voice behind him. The assassin sensed the presence before he even heard the words. He spun about, rolling into a crouch, dagger in one hand, arm cocked to throw. Another female halfling, this one dressed in a fine tunic and breeches, with thick, curly brown hair and huge brown eyes, stood at the door, hands up and open, her posture completely unthreatening.\n \"Oh, but that would be a bad thing for me and for you,\" the female halfling said with a little grin.\n \"Do not kill her,\" Dondon pleaded with Entreri, trying to grab for the assassin\u0027s arm, but missing far short of the mark and rolling back, gasping for breath.\n Entreri, ever alert, noticed then that both the female halflings attending Dondon had slipped hands into secret places, one to a pocket, the other to her generous waist-length hair, both no doubt reaching for weapons of some sort. He understood then that this newcomer was a leader among the group.\n \"Dwahvel Tiggerwillies, at your service,\" she said with a graceful bow. \"At your service, but not at your whim,\" she added with a smile.\n \"Tiggerwillies?\" Entreri echoed softly, glancing back at Dondon.\n \"A cousin,\" the fat halfling explained with a shrug. \"The most powerful halfling in all of Calimport and the newest proprietor of the Copper Ante.\"\n The assassin looked back to see the female halfling completely at ease, hands in her pockets.\n \"You understand, of course, that I did not come in here alone, not to face a man of Artemis Entreri\u0027s reputation,\" Dwahvel said.\n That brought a grin to Entreri\u0027s face as he imagined the many halflings concealed about the room. It struck him as a half-sized mock-up of another similar operation, that of Jarlaxle the dark elf mercenary in Menzoberranzan. On the occasions when he had to face the always well-protected Jarlaxle, though, Entreri had understood without doubt that if he made even the slightest wrong move, or if Jarlaxle or one of the drow guards ever perceived one of Entreri\u0027s movements as threatening, his life would have been at an abrupt end. He couldn\u0027t imagine now that Dwahvel Tiggerwillies, or any other halfling for that matter, could command such well-earned respect. Still, he hadn\u0027t come here for a fight, even if that old warrior part of him perceived Dwahvel\u0027s words as a challenge.\n \"Of course,\" he replied simply. \"Several with slings eye you right now,\" she went on. \"And the bullets of those slings have been treated with an explosive formula. Quite painful and devastating.\" \"How resourceful,\" the assassin said, trying to sound impressed.\n \"That is how we survive,\" Dwahvel replied. \"By being resourceful. By knowing everything about everything and preparing properly.\"\n In a single swift movement-one that would surely have gotten him killed in Jarlaxle\u0027s court-the assassin spun the dagger over and slipped it into its sheath, then stood up straight and dipped a low and respectful bow to Dwahvel.\n \"Half the children of Calimport answer to Dwahvel,\" Dondon explained. \"And the other half are not children at all,\" he added with a wink, \"and answer to Dwahvel, as well.\"\n \"And of course, both halves have watched Artemis Entreri carefully since he walked back into the city,\" Dwahvel explained.\n \"So glad that my reputation preceded me,\" Entreri said, sounding puffy indeed.\n \"We did not know it was you until recently,\" Dwahvel replied, just to deflate the man, who of course, was not at all conceited.\n \"And you discovered this by.... ?\" Entreri prompted.\n That left Dwahvel a bit embarrassed, realizing that she had just been squeezed for a bit of information she had not intended to reveal. \"I do not know why you would expect an answer,\" she said, somewhat perturbed. \"Nor do I begin to see any reason I should help the one who dethroned Regis from the guild of the former Pasha Pook. Regis, was in a position to aid all the other halflings of Calimport.\"\n Entreri had no answer to that, so he offered nothing in reply.\n \"Still, we should talk,\" Dwahvel went on, turning sidelong and motioning to the door.\n Entreri glanced back at Dondon.\n \"Leave him to his pleasures,\" Dwahvel explained. \"You would have him freed, yet he has little desire to leave, I assure you. Fine food and fine companionship.\"\n Entreri looked with disgust to the assorted pies and sweets, to the hardly moving Dondon, then to the two females. \"He is not so demanding,\" one of them explained with a laugh.\n \"Just a soft lap to rest his sleepy head,\" the other added with a titter that set them both to giggling.\n \"I have all that I could ever desire,\" Dondon assured him.\n Entreri just shook his head and left with Dwahvel, following the little halfling to a more private-and undoubtedly better guarded-room deeper into the Copper Ante complex. Dwahvel took a seat in a low, plush chair and motioned for the assassin to take one opposite. Entreri was hardly comfortable in the half-sized piece, his legs straight out before him.\n \"I do not entertain many who are not halflings,\" Dwahvel apologized. \"We tend to be a secretive group.\"\n Entreri saw that she was looking for him to tell her how honored he was. But, of course, he wasn\u0027t, and so he said nothing, just keeping a tight expression, eyes boring accusingly into the female.\n \"We hold him for his own good,\" Dwahvel said plainly.\n \"Dondon was once among the most respected thieves in Calimport,\" Entreri countered.\n \"Once,\" Dwahvel echoed, \"but not so long after your departure, Dondon drew the anger of a particularly powerful pasha. The man was a friend of mine, so I pleaded for him to spare Dondon. Our compromise was that Dondon remain inside. Always inside. If he ever is seen walking the streets of Calimport again, by the pasha or any of the pasha\u0027s many contacts, then I am bound to turn him over for execution.\"\n \"A better fate, by my estimation, than the slow death you give him chained in that room.\"\n Dwahvel laughed aloud at that proclamation. \"Then you do not understand Dondon,\" she said. \"Men more holy than I have long identified the seven sins deadly to the soul, and while Dondon has little of the primary three, for he is neither proud nor envious nor wrathful, he is possessed of an excess of the last four-sloth, avarice, gluttony, and lust. He and I made a deal, a deal to save his life. I promised to give him, without judgment, all that he desired in exchange for his promise to remain within my doors.\"\n \"Then why the chains about his ankle?\" Entreri asked.\n \"Because Dondon is drunk more often than sober,\" Dwahvel explained. \"Likely he would cause trouble within my establishment, or perhaps he would stagger onto the street. It is all for his own protection.\"\n Entreri wanted to refute that, for he had never seen a more pitiful sight than Dondon and would personally prefer a tortured death to that grotesque lifestyle. But when he thought about Dondon more carefully, when he remembered the halfling\u0027s personal style those years ago, a style that often included sweet foods and many ladies, he recognized that Dondon\u0027s failings now were the halfling\u0027s own and nothing forced upon him by a caring Dwahvel.\n \"If he remains inside the Copper Ante, no one will bother him,\" Dwahvel said after giving Entreri the moment to think it over. \"No contract, no assassin. Though, of course, this is only on the five-year-old word of a pasha. So you can understand why my fellows were a bit nervous when the likes of Artemis Entreri walked into the Copper Ante inquiring about Dondon.\"\n Entreri eyed her skeptically.\n \"They were not sure it was you at first,\" Dwahvel explained. \"Yet we have known that you were back in town for a couple of days now. Word is fairly common on the streets, though, as you can well imagine, it is more rumor than truth. Some say that you have returned to displace Quentin Bodeau and regain control of Pook\u0027s house. Others hint that you have come for greater reasons, hired by the Lords of Waterdeep themselves to assassinate several high-ranking leaders of Calimshan.\"\n Entreri\u0027s expression summed up his incredulous response to that preposterous notion.\n Dwahvel shrugged. \"Such are the trappings of reputation,\" she said. \"Many people are paying good money for any whisper, however ridiculous, that might help them solve the riddle of why Artemis Entreri has returned to Calimport. You make them nervous, assassin. Take that as the highest compliment.\n \"But also as a warning,\" Dwahvel went on. \"When guilds fear someone or something, they often take steps to erase that fear. Several have been asking very pointed questions about your whereabouts and movements, and you understand this business well enough to realize that to be the mark of the hunting assassin.\"\n Entreri put his elbow on the arm of the small chair and plopped his chin in his hand, considering the halfling carefully. Rarely had anyone spoken so bluntly and boldly to Artemis Entreri, and in the few minutes they had been sitting together, Dwahvel Tiggerwillies had earned more respect from Entreri than most would gather in a lifetime of conversations.\n \"I can find more detailed information for you,\" Dwahvel said slyly. \"I have larger ears than a Sossalan mammoth and more eyes than a room of beholders, so it is said. And so it is true.\"\n Entreri put a hand to his belt and jiggled his purse. \"You overestimate the size of my treasury,\" he said.\n \"Look around you,\" Dwahvel retorted. \"What need have I for more gold, from Silverymoon or anywhere else?\"\n Her reference to the Silverymoon coinage came as a subtle hint to Entreri that she knew of what she was speaking.\n \"Call it a favor between friends,\" Dwahvel explained, hardly a surprise to the assassin who had made his life exchanging such favors. \"One that you might perhaps repay me one day.\"\n Entreri kept his face expressionless as he thought it over. Such a cheap way to garner information. Entreri highly doubted that the halfling would ever require his particular services, for halflings simply didn\u0027t solve their problems that way. And if Dwahvel did call upon him, maybe he would comply, or maybe not. Entreri hardly feared that Dwahvel would send her three-foot-tall thugs after him. No, all that Dwahvel wanted, should things sort out in his favor, was the bragging right that Artemis Entreri owed her a favor, a claim that would drain the blood from the faces of the majority of Calimport\u0027s street folk.\n The question for Entreri now was, did he really care if he ever got the information Dwahvel offered? He thought it over for another minute, then nodded his accord. Dwahvel brightened immediately.\n \"Come back tomorrow night, then,\" she said. \"I will have something to tell you.\"\n Outside the Copper Ante, Artemis Entreri spent a long while thinking about Dondon, for he found that every time he conjured an image of the fat halfling stuffing pie into his face he was filled with rage. Not disgust, but rage. As he examined those feelings, he came to recognize that Dondon Tiggerwillies had been about as close to a friend as Artemis Entreri had ever known. Pasha Basadoni had been his mentor, Pasha Pook his primary employer, but Dondon and Entreri had related in a different manner. They acted in each other\u0027s benefit without set prices, exchanging information without taking count. It had been a mutually beneficial relationship. Seeing Dondon now, purely hedonistic, having given up on any meaning in life, it seemed to the assassin that the halfling had committed a form of living suicide.\n Entreri did not possess enough compassion for that to explain the anger he felt, though, and when he admitted that to himself he came to understand that the sight of Dondon repelled him so much because, given his own mental state lately, it could well be him. Not chained by the ankle in the company of women and food, of course, but in effect, Dondon had surrendered, and so had Entreri.\n Perhaps it was time to take down the white flag.\n Dondon had been his friend in a manner, and there had been one other similarly entwined. Now it was time to go and see LaValle. \n","sourceLink":"https://allnovel.net/the-silent-blade-paths-of-darkness-1/page-4.html","bookId":2131,"book":{"id":2131,"title":"The Silent Blade (Paths of Darkness #1)","description":"Storyline: \n The Silent Blade (Paths of Darkness #1) \n Can the Crystal Shard be destroyed at last? Drizzt is determined to destroy the evil Crystal Shard, and seeks out the help of the scholar-priest Cadderly. But instead, his worst fears are realized, and Crenshinibon falls into the hands of the dark elf mercenary Jarlaxle and his unlikely ally Artemis Entreri. The Silent Blade is the book that brought Drizzt back to the Realms, and was a New York Times best seller on its initial release--and has been in print every day since. Like the rest of the Legend of Drizzt(R) reissues, The Silent Blade features beautiful new cover art by award-winning illustrator Todd Lockwood.\n \n","cover":"https://allnovel.net/images/the-silent-blade-paths-of-darkness-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-silent-blade-paths-of-darkness-1.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:08:15 PM"}}
