{"id":18778,"no":30,"title":"CHAPTER XXX THE RESCUE AT THE STAKE","content":"T HE word uttered by the strange woman was one to conjure with even then in the Illinois country. Many a year had passed since the French flag ruled those prairies, yet not a warrior there but knew how the men of that race avenged an injury,—how swift their stroke, how keen their steel. I watched the startled throng press closely backward, as if awed by her mysterious presence, influenced insensibly by her terse sentence of command, each dusky face a reflex of its owner\u0027s perplexity. Drunken as most of them were, crazed with savage blood-lust and hours of remorseless torture of their victims, for the moment that sweet vision of womanly purity held them motionless, as if indeed the figure of the Christ she uplifted before their faces had taught them abhorrence of their crimes. ? 315 ? But it was not for long. To hundreds of those present she was merely an unknown white woman; while even to those who knew her best, the Pottawattomies, she appeared only as one who came to balk them of their revenge. They may have held her person inviolate amid their lodges, and even have countenanced her strange teaching; but now she had ventured too far in attempting thus to stand between them and their victim. They held back a single moment, halted by her fearlessness, rendered cowardly by vague superstitions regarding her religious power; but after the first breathless pause of dumb astonishment and irresolution, voice after voice arose in hoarse cries of rage and shouts of disapproval. There was a surging forward of the straining red line, while in their front howled and gesticulated the hideous old medicine-man, his painted face distorted by passion, eager to grasp this auspicious moment to cast down forever one who had sought to end his superstitious rule among the tribe. I marked how she drew back as they advanced, retreating step by step,—not, in deed, as if she feared them, but rather as if some definite purpose led her movement. Her eyes never wavered, her hand still uplifted the gleaming cross, as she retreated slowly, until she stood directly before De Croix, where he hung helplessly staring at her with an expression of fear in his face strangely at variance with his late show of desperate courage. ? 316 ? \"Back!\" she cried again, but now in a deeper and fuller voice that sounded like a clear-toned bell above the uproar. \"I tell you I will kill this man with my own hand before I permit you to put further torture upon him!\" An instant only did this threat halt the gathering rush. Some one voiced an Indian insult, and there came a fierce surging forward, although no warrior among them seemed eager to lead in the attack. I saw the woman lift her hand, and caught the glimmer of a steel blade; and even as I sprang erect, partially flinging aside the obstructing flap of the lodge, an Indian, stalking silently forth from the shadows, faced the mob, standing motionless within a foot of the desperate girl, and with his back toward her. One glance at that tall thin figure, the stern face, the long white hair, told me it was the great war-chief of the Pottawattomies, Gomo; and I sank back trembling from the reaction of that moment\u0027s strain. His words were calm, deliberate, commanding; but the angry roar with which they were greeted made me fear the horde he faced so resolutely was now beyond control. He smiled, his thin lips curling in derision as he gazed with contempt into the threatening faces pressing closer upon every side. \"Fear not,\" he murmured aside to the watchful woman, and resting one hand upon her arm. \"Cut loose the prisoner!\" ? 317 ? She turned instantly to her task, while he spoke briefly the names of his chiefs; and as each was called in turn, a warrior came from among the mass and silently stood beside him. A dozen came forth thus, stalwart, grim-faced braves, many with fresh scalps dangling at their belts. Gomo now spoke again, using the French tongue, that all present might better grasp his meaning. \"Brothers,\" he said gravely, \"this squaw is Pottawattomie. She was adopted by our people and lives in our lodges. Pottawattomies are friends to Frenchmen; there is no war between us. Why should Wyandots and Sacs wish to burn a Frenchman?\" For a moment no one ventured to reply; the mob stood halted now, robbed of its leaders and its courage, even the noisy medicine-man silenced before this stern array of protecting chiefs. Loose as was Indian discipline and tribal authority, even in drunkenness those desperate warriors dared not openly disregard such a display of power. \"Have the Pottawattomies spoken well?\" questioned the old chief, sternly, \"or have our words wronged our brothers?\" A giant of a fellow, whose broad face and huge head seemed disproportionate even to his big body, his long coarse hair profusely ornamented with shells and beads flashing gaudily in the firelight, pushed his way out from among the silent mass. ? 318 ? \"Gomo, the great war-chief of the Pottawattomies, has spoken well,\" he said in a deep voice that rolled like distant thunder. \"The Wyandots did not know; they war not with Frenchmen, nor harm the women of the Pottawattomies. The Great Spirit hath made us brothers, and we have smoked together the pipe of peace.\" Gomo moved forward with Indian dignity, and exchanged solemn greeting with the new-comer. \"It makes the hearts of the Pottawattomies light to hear the words of Sau-ga-nash,\" he said gravely. Then he turned and waved his hand to his clustered warriors. \"Release the Frenchman, and place him for safety in the council lodge. Pass the woman free. It is the will of our chiefs.\" The council lodge! I glanced about me apprehensively; surely this must be the same tepee in which Captain Heald and I had met the chiefs! There were no signs of ordinary Indian occupancy, and now as I looked about me the firelight from without revealed clearly the shading of those grotesque figures I recalled as having been sketched upon the outer covering. So it was here that De Croix was to be confined! I crept back hastily, dropping into place the loosened flap through which I had been peering. A skin or two were lying on the grassy floor; and I grasped the larger of these, drawing it over me while I rolled as closely as possible against the farther wall, hoping ? 319 ? desperately that no Indian guards would be posted within. The uproar outside continued, as if there were still opposition to the commands of the chiefs; but presently, as I peeped through a hole in the skin held over me, I perceived a sudden flash of light as the flap covering the entrance was drawn aside. I saw a number of dark hands thrust within, a savage face or two peering for a moment about the darkened interior; but to my inexpressible relief only one body was thrust inside, with such violence, however, as to cause the man to fall face downward at full length. The next instant the lodge was again wrapped in utter darkness. By God\u0027s mercy I remained undiscovered, and was alone with De Croix. For a short time, assured as I was of this fact, I did not venture to creep from my place of concealment, or make my presence known to my companion. What ears might be listening, I knew not; nor dared I trust too much to the Frenchman\u0027s already overtaxed nerves. He did not move from the position where he fell; but I could hear him groan and sob, with now and then a broken ejaculation. Without, the yelling and uproar grew perceptibly less, although an occasional outburst gave evidence that the carousal was not wholly ended. Finally I pushed back the robe that covered me, now grown uncomfortably warm, and crept cautiously toward the place where I knew ? 320 ? him to be lying. It was intensely dark, and I was still fearful lest he might cry out if I startled him. \"De Croix,\" I whispered, \"make no alarm; I am Wayland.\" \"Wayland!\" I could mark the amazement in his tone, as he instantly sat upright, peering through the gloom in the direction whence my voice came. \"Mon Dieu! You are here? You saw all of it?\" \"Ay,\" I answered, reaching out and groping in the darkness until I grasped his hand. \"You have had a hard time, my lad; but the worst is over, and hope remains for us both.\" He shuddered so violently I could feel the spasm shake his body. \"\u0027Twas not the dying,\" he protested; \"but did you see her, Wayland? Merciful God! was it really a living woman who stood there, or a ghost returned from the other world to haunt me and make living worse than death?\" \"You mean the sister who interposed to save you?\" I asked. \"\u0027 She was as truly alive as either of us. Think you she is not a stranger?\" He groaned, as if the confession was wrung from him by the terror of eternal torment. \"Mon Dieu! She is my wife!\" \"Your wife?\" \"Ay, my wife,—Marie Faneuf, of Montreal.\" \"But how comes she here, Monsieur, living in ? 321 ? the Pottawattomie camp? And how comes it that you sought another in this wilderness, if you were already long wedded?\" \"Saint Guise! but I cannot tell you,\" and his voice shook with the emotion that swept him. \"\u0027Tis like a black dream, from which I must yet awaken. She died, I swear she died; the sisters told me so at the convent of the Ursulines, whither she fled to escape my unkindness,—for I did her wrong; and I stood by the grave as the body they called hers was lowered into the ground. For all these years have I thought it true; yet the girl yonder was Marie. But you, Wayland,—know you aught of her?\" \"Only that she guided me hither in search of Mademoiselle. On the way we conversed, and she let me know that she had dedicated her life to the service of these Indians, seeking to save their souls.\" \"\u0027Tis like enough; she was ever half a nun, and most religious. Yet made she no mention of me, and of my crying out at the house?—for I must indeed have seen her there!\" \"She asked me your name, Monsieur, and when I told her she said she recalled it not. Knew she you by some other?\" He did not answer, though I could mark his heavy breathing, as if he strove with himself for mastery. Nor did I speak again, eager as I now was to arrange ? 322 ? some plan for the future; for this man was certainly in no condition to counsel with. I know not how long I may have rested there in silence, seeking vainly in my own mind for some opening of escape, or means whereby I might communicate with Mademoiselle. Would the strange woman forget me now, or would she venture upon a return with her message? If not, I must grope forward without her, hampered as I should be by this unnerved and helpless Frenchman. Outside, the noise had almost wholly ceased,—at least, close to where we were,—and I could perceive that a slight tinge of returning day was already in the air, faintly revealing the interior of the lodge. As I sat thus, drifting through inaction into a more despairing mood, the rear covering of the tepee moved almost imperceptibly, and I turned hastily to seek the cause, my heart in my throat lest it prove an enemy, perhaps some stealthy savage still seeking the life of De Croix. It was far from being light as yet, but there was sufficient to show me the faint outline of a woman\u0027s figure. The Frenchman had seemingly heard nothing; and I rose quickly and faced her eagerly. \"You have found her?\" I questioned anxiously. \"I beg you tell me that she yet lives!\" \"Hush! you speak too loud,\" was the low reply. \"The one you seek is, I think, confined within the ? 323 ? lodge of Little Sauk, and thus far remains unharmed. I have not been able to reach her, but she has been described to me as young, with dark hair and eyes, and as having been dragged from a horse near the rear of the column. Think you she is the one you seek?\" \"I do indeed!\" I cried, in a rapture of relief. \"Where is this lodge in which they hold her?\" She hesitated to answer, as if she somewhat doubted my discretion. \"It is the third from the fire, in the row west of this,\" she said at last. \"But it is already daylight, and you must lie hidden amid these skins until another night, when I will strive to aid you. You will be safe here, if you only keep hidden; and I have brought with me food for you both.\" I had quite forgotten De Croix, in my eagerness to learn news of Mademoiselle; but now I realized he had risen to his knees, and was gazing at our visitor through the dim shadows as if half fearful even yet that she was but a spectre. In that gray dawn his face was ghastly in its whiteness,—the dark lines under his eyes, his matted hair, and the traces of blood upon his cheek, yielding a haggardness almost appalling. \"Marie!\" he sobbed, catching his breath between the words as if they choked him, \"Marie, in God\u0027s name, speak one word to me!\" I saw the girl start, looking around at him with ? 324 ? eyes widely opened, yet with an expression in them I could not fathom; it was neither hatred nor love, though it might easily have been sorrow. \"Marie,\" he urged, rendered despairing by her silence, \"I have done you wrong, great wrong; but I thought you dead. They told me so,—they told me it was your body they buried. Will you not speak a word of mercy now?\" Dim as the light was, I saw her eyes were moist as she gazed down upon him; but there was no faltering in her voice. \"You were right, Monsieur le Marquis,\" she said slowly, \"Marie Faneuf is dead. It is only Sister Celeste who has aided in the preservation of your life in the name of the Master. Make your acknowledgment to the Mother of Christ, not to me, for such mercy.\" I knew not when she passed out, or how; but we were alone once more, and De Croix was lying with his face buried in the short grass. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3196/87372.html","bookId":838,"book":{"id":838,"title":"When Wilderness was King","description":"简介： S URELY it was no longer ago than yesterday. I had left the scythe lying at the edge of the long grass, and gone up through the rows of nodding Indian corn to the house, seeking a draught of cool water from the spring. It was hot in the July sunshine...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3196","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
