{"id":18783,"no":35,"title":"CHAPTER XXXV THE BATTLE ON THE SHORE","content":"W HAT followed was long a famous story on the border, and I have even read it written out most carefully in books purporting to tell the history of those troublous times. None of them have it as I recall the details of the incident, although it all occurred so rapidly that I myself can hardly tell just how \u0027twas done. I know that I scrambled again to my knees, resting half in the water, my purpose being to fling myself into the river in an effort to regain the boat. But it was already out of sight in the dense gloom, while not the slightest sound reached me for guidance. Beyond this, I had no time for much save action. Above me, upon the high bank not three yards away, I saw several Indian forms peering over; and then others, three or four, I am uncertain which, sprang lightly down within a yard of where I crouched in waiting. ? 369 ? My father gave me a frontier maxim once, which ran, \"If you must fight, strike first, and strike hard.\" The words flashed in my memory, and I put them to the test straightway. These prowling savages were apparently unaware of my predicament; their sole thought was with the boat floating away lakeward down the stream. At all cost, they must be blocked in any purpose of pursuit. These were the thoughts that darted through my brain like fire through stubble. How many opposed me, how desperate would be the struggle, were matters of which I did not stop to think. I could at least busy them until the fugitives were safe; after that, it was God\u0027s affair, and theirs. My rifle was wet and useless from my recent tumble; but before the group at the water\u0027s edge even saw me I was fairly upon them, striking fiercely with my gun-stock, and two savages went down, shrieking from pain and surprise, before so much as a return blow reached me. It was not a noisy battle; from the outset it was too fierce and rapid for any waste of breath. Never did I need my strength of body more, nor did the long training of my father come in better play. I made that long rifle-barrel both club and sword, knife and axe in one, striking, thrusting, clubbing, in the mad fury with which desperation bids a man battle for his life. I had no thought to live, but was determined that if I went down to earth many a painted savage should ? 370 ? lie there with me. The enshrouding darkness proved a friendly help; for as I backed in closer against the bank, I gained a fair view of my opponents, while keeping myself more hidden. Again and again they charged upon me, joined now by the others from above; but the circling iron I swung with tireless arms formed a dead-line no leaping Indian burst through alive. Once a hurtling tomahawk half buried itself in my shoulder; a long-knife, thrown by a practised hand, pierced the muscles of my thigh, and stuck there quivering, till I struck it loose; and twice they fired at me, the second shot tearing the flesh of my side, searing it like fire. Yet I scarcely realized I was touched, so fiercely was the battle-blood now coursing through my veins, so intense the joy with which I crushed them back. I grew delirious, feeling the rage to slay sweep over me as never before, giving me the crazed strength of a dozen men, until I lost all sense of defensive action, and sprang forth into their midst as might an avenging thunderbolt from the black sky. Never had I swung flail in peaceful border contest as I did that murderous iron bar in the dark of the river-shore, driving them back foot by foot against the high bank which held them helpless victims of my wrath. I struck again and again, my teeth set together in bulldog tenacity, my breath coming in gasps, the streaming blood from a deep cut over my eyes half ? 371 ? blinding me, yet guided by fierce instinct to find and smite my foes. I trod on limp bodies, on writhing forms, and felt my weapon clash against iron rifle barrels and clang upon uplifted steel; but nothing stopped me, no cry of terror, no plea for mercy, no clutching hand, no deadly numbing blow. God knows the story of that fight,—how long it lasted, by what miracle \u0027twas won. To me it is—and was—little more than a dim haze of strange leaping figures, of fierce dark faces, of maddened cries of hate, of uplifted hands, of dull-clashing weapons. I seemed to see it all through a red fog whence the blood dripped, and I lost consciousness of everything save my unswerving duty to strike hard until I fell. At last out from the maelstrom of that wild mêlée but a single warrior seemed to face me; and some instinct of the fight caused me to draw back a pace and wipe the obscuring blood away, that I might see him better. It came to me that this was to be the end, the final duel which was to decide that midnight battle. He and I were there alone; and the stars bursting through the clouds gave me faint view of him, and of those dark, silent forms that lined the shore where they had fallen. A chief, a Pottawattomie, this much I knew even in that hasty shrouded glance. Writers of history affirm my opponent was Peesotum, the same fierce warrior whose cruel hand slew the brave Captain ? 372 ? Wells and wrenched his still beating heart from out the mutilated body. All I realized then were his broad sinewy shoulders, his naked brawny body, his eyes ablaze with malignant hate. He was the first to close, his wild cry for vengeance piercing the still night; and before I knew it, the maddened savage was within the guard of my rifle-barrel, and we were locked in the stern grapple of death. It was knife to knife, our blades gleaming dull in the dim light of the stars, each man gripping the uplifted wrist of the other, putting forth each last reserve of strength, each cunning trick of fence, to break free and strike the ending blow. Back and forth we strove, straining like two wild animals, our moccasined feet slipping on the wet earth, our muscles strained, and sinews cracking with intensity of effort, our breath coming in labored gasps, our bodies tense as bowstrings. Such merciless strain could not endure forever, and, strong as I was in those young days, the savage was far stronger and less exhausted by the struggle, so that inch by inch he pressed me backward, battling like a demon, until I could see the cruel gleam of his eyes as I gave slowly down. It was God who saved me, for as I fell I struck the sharp shelving of the bank, and the quick stoppage swung the savage to one side and below me, so that, even as he gave vent to an exulting yell of triumph, wrenching his hand loose from my weakening clasp to strike the death-blow, ? 373 ? I whirled and forced him downward, his face buried in the stream. Those who write history say the rescuing warriors discovered him alive. I know not; but this I swear,—I held him there until every struggle ceased, until answering yells from the westward told me others were already close at hand, and then, breathless and trembling from the struggle, blinded by blood and faint from wounds, I sprang forward into the night-shadows, dimly conscious that my sole hope for escape lay lakeward. I ran but feebly at first, skirting the partially destroyed stockade of the old Fort, with its litter of debris, and stumbling constantly in the darkness over the obstructions that lined the river bank. As my breath returned, and I somewhat cleared my eyes of blood, I saw better; and at last ran from the darker soil on to the white sand of the beach. There were now many stars in the sky, with the moon struggling feebly to break through the haze; but to my anxious glance nothing was visible upon the water. Surely the boat must have floated to the river-mouth by this time,—surely the force of the current would have accomplished that; nor was it likely that Ol\u0027 Burns would draw far away from shore until assured of my fate. The wild shouting told me that savages from the camp had already found their dead. A moment more would place them on my trail, hot for revenge; and there was no course left me but to ? 374 ? take the water, before their keen eyes found me out. I waded out, seeking thus to get far enough from shore to baffle their search, when suddenly a quick spark of light winked from the blackness in front of me. Surely it could be nothing less than a signal, the swift stroke of flint on steel,—no doubt in the faint hope it would prove a beacon to me in my need. Desperate as the chance was, it was still a chance, and to my mind the only one. I glanced behind; a dim figure or two dotted the white sand, and my heart lifted a silent prayer to God for guidance. A second later I was beyond my depth, breasting the unknown waters, swimming steadily toward the place where that mysterious spark had glimmered. Once again it flashed, the barest glimpse of light through the intense gloom; and I pressed on with new vigor, certain now it was a real beacon. But I was so weakened by wounds and spent from exertion, and such desperate work is swimming fully clad, that my progress proved slow; and twice I was compelled to pause, paddling slowly on my back, in the buffeting of the waves, in order to gain strength to renew the struggle. I almost lost heart in the black loneliness, as the swirling water swept me back and confused me with its ever-tossing motion. Once I went down from sheer weakness, choking in a cloud of spray that swept my face; and doubtless I should have let the struggle end in despair even then, had not the spark leaped up once more ? 375 ? through the deep haze; and this time so close was it that my ears caught the clashing of the flint and steel. With the new hope of life thus given me, I pushed grimly forward, using the silent Indian stroke that never tires, my eyes at the surface level where the light of the moon glimmered feebly. At last I saw it,—the black lumpy shadow of the boat. I must have splashed a little in my weakness and excitement, for I plainly perceived the figure of a man hastily leap to his feet, with an oar-blade uplifted threateningly above his head. \"Don\u0027t strike, Burns!\" I managed to cry aloud. \"It\u0027s Wayland.\" The next moment, with scarce so much as a breath remaining in my battered body, I laid hand upon the boat\u0027s side, and clung there panting and well-nigh spent. I felt his hands pressed under my arms, and then, with the exercise of his great strength, he drew me steadily up, inch by inch, until I topped the rail, and fell forward into the bottom of the boat. An instant I rested thus, with tightly closed eyes, my head reeling, my breath coming in sobs of pain, every muscle of my strained body throbbing in misery. Scarcely conscious of what was being done about me, I could still realize that arms touched my neck, that my head was gently lifted to a softer resting-place, and that a hand, strangely tender, brushed back from my forehead the wet tangled hair. The touch was thrilling; ? 376 ? and I unclosed my wearied eyes, looking up into the sympathetic face of Mademoiselle. The faint moonlight rested upon it gently, touching her crown of hair with silver; and within the dark depths of her eyes I read clearly the message I had waited for so long. \"Toinette!\" I murmured, half conscious. She bowed her head above me, and I felt a sudden plash of tears that could not be restrained. \"Do not try to speak now, John!\" she whispered softly, her finger at my lips. \"I can only thank the good God who has brought you back to me.\" I made no effort to say more; I could only lie in silence and gaze up at her, pressing the hands resting so frankly within my own. Indeed, we needed no words in that hour; our hearts had spoken, and thenceforward we were one. Suddenly the heavy boat lurched beneath us, to some quick impetus that sent a shudder through every inch of it; and I heard a heavy splash alongside, which instantly brought me upright, anxiously grasping the rail. \"May Heaven help him!\" cried Burns excitedly, and pointing out at the black waters. \"The Frenchman has gone overboard!\" \"Overboard?\" I echoed, striving to regain my feet. \"Did he fall?\" \"Fall? No; it was a dive off the back seat here. Save me! but he went into it like a gull.\" ? 377 ? We sought for him long and vainly, peering over those dark swirling waters, calling his name aloud, and striking flint on steel in hope to guide him by the spark. Nothing appeared along the rolling surface, no answering cry came from the black void; De Croix had disappeared into the depths, as desperate men go down to death. Suddenly, as I leaned over, sick at heart, peering into the dimness, Toinette drew near and touched me softly. \"Let us not mourn,\" she said, in strange quietness. \"No doubt \u0027tis better so.\" \"How?\" I questioned, shocked at her seemingly heartless words. \"Surely you cannot rejoice at such a loss?\" \"\u0027Tis not a loss,\" she answered firmly, and the soft moon-rays were white upon her face. \"He has only gone back to her we left behind; it was the beckoning hand of love that called him through the waters. Now it is only ours to pray that he may find her.\"","sourceLink":"http://novel.tingroom.com/duanpian/3196/87377.html","bookId":838,"book":{"id":838,"title":"When Wilderness was King","description":"简介： S URELY it was no longer ago than yesterday. I had left the scythe lying at the edge of the long grass, and gone up through the rows of nodding Indian corn to the house, seeking a draught of cool water from the spring. It was hot in the July sunshine...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3196","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
