{"id":103885,"no":12,"title":"Page 12","content":"I’ve known Nina Truhler for four years, three months, and eleven days—yes, I’ve kept track. We had talked seriously about marriage, although not since year three. I thought that might change when Nina’s daughter, Erica, went off to Tulane University in New Orleans, but it hadn’t. I also thought we might move in together, she with me or me with her, at least until Erica came back for the summer or holidays, yet that didn’t happen, either. I loved her desperately and told her so many times; she said the same to me, and I believed her. “So what’s the problem?” our friend Shelby Dunston asked often and with increasing frustration—like many married people she didn’t think it was possible for us to be truly happy unless we were also married. The truth was we were both very contented in our relationship and both very afraid of somehow screwing it up. Nina had been married before, and the experience soured her on the institution. As for me, my mother died when I was in the sixth grade, and although I was well raised by my father, I was pretty much left to my own devices. After so many years living a solitary if not downright selfish life, I didn’t know if it was possible to live hand in hand with someone else. So we just kept living the way we always had, her on one side of the city, me on the other, together yet apart. It wasn’t perfect. On the other hand, I always knew where I could get a free meal. Rickie’s, the jazz-club-slash-restaurant-slash-neighborhood-tavern that Nina had built and named after her daughter, was crowded. It was pushing six, and the quick-drink-after-work crowd was overlapping the early-dinner-before-the-movie/theater/ballet gang. It was Monday night, so the upstairs performance and dining area was closed, a red sash fixed across the staircase. That meant all of Nina’s customers were gathered downstairs. Nearly all of the tables, booths, and comfy chairs and sofas were filled, as I knew they would be. What I didn’t expect was the lights and cameras. A film crew had set up in the far corner near the staircase, and a young man dressed in a black sweater with a white ghost stitched over his breast was interviewing—Erica? “What’s going on?” I asked no one in particular. I received an answer just the same. “It’s a cable TV show,” a young voice said. I turned to find Victoria, Bobby and Shelby Dunston’s fourteen-year-old daughter, sitting alone in a booth and nursing an IBC root beer. “Vic?” I said. “Hi, McKenzie.” I slid into the booth across from her. “What are you doing here?” I said. “I was interviewed, too.” “For what?” “The ghost show.” “You have to help me out here, sweetie.” “There’s this cable TV show that goes around investigating paranormal activities in, I don’t know, haunted houses, I guess.” “What are they doing here?” “Rickie called them. Said the club was haunted. Which it is, by the way.” “I can’t believe Nina went along with this.” “I guess she didn’t know until Rickie told her this morning.” I started laughing. “I would love to have heard that conversation,” I said. “It was tense,” Victoria said. I laughed some more. “Rickie said the publicity would be good for business,” she added. “What did Nina say to that?” “You know how sometimes her face gets really kinda hard and her hands just kinda quiver like this?” Victoria held her hands out, fingers spread like she was about to claw something savagely. “And then she turns around and walks away without saying anything?” I did know—it was not a pretty sight. “Scared me more than the ghosts,” Victoria said. “What ghosts? There aren’t any ghosts.” “Sure there are.” “Vic, please.” “I’m just saying.” “Where are your parents?” “Dad’s working—when isn’t he?” “Cops,” I said. “Mom left a few minutes ago. She had to take Katie to her piano lesson.” “They left you alone?” “I’m with friends,” she insisted. “Rickie is going to take me home. Besides, I’m not a little girl anymore.” “You’ll always be a little girl to me.” “Are you going to buy me a car when I get my driver’s license?” “Hell no.” “Why not?” “Because your father carries a gun and he’s a good shot. Besides, what part of ‘you’ll always be a little girl to me’ did you miss?” “You’re my godfather.” “So?” “So you’ve been doing a pretty good job of spoiling me up till now. If you stop, I might suffer emotional trauma.” “Not as much trauma as your parents will make me suffer if I buy you a car.” “You can just say that since I’m your heir I’m going to inherit your money anyway.” “Your sister is also my heir. You’ll have to split it.” “So buy her a car, too. I don’t mind.”","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-12.html","bookId":2218,"book":{"id":2218,"title":"Curse of the Jade Lily (Mac McKenzie #9)","description":"Storyline: A stolen gem with a tragic history, a curse and a million dollar ransom is Mac McKenzie\u0027s latest case, in David Housewright\u0027s Curse of the Jade Lily Several years ago, Rushmore McKenzie became an unexpected millionaire and set about doing not much of anything. Now, showing up at his doorstep is the insurance company that paid the settlement that made him rich—and they want a favor. Someone has stolen a very expensive gem from a local art museum and is willing to ransom it back. The only condition is that McKenzie has to be the go between. And this is no ordinary gem—it is a jade with a history going back to the Qing Dynasty and a reputed curse that stories claim has ruined or killed everyone who has ever owned it. McKenzie agrees to help but what starts out as a simple ransom quickly becomes complicated. Suddenly other parties—including the State Department and a mysterious woman named Heavenly—start showing up, wanting McKenzie to turn over the gem to them. When the murdered body of on of the thieves turns up in a snow drift, it looks like the cursed Jade Lily has claimed its latest victim. And there may well be more to follow…","cover":"https://allnovel.net/images/curse-of-the-jade-lily-mac-mckenzie-9.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:30:16 PM"}}
