{"id":103881,"no":7,"title":"Page 7","content":"Lake Calhoun is the biggest of the twenty-two lakes found within the City of Minneapolis. When TV networks come to town to broadcast live sporting events, they usually set their cameras on the southwestern shore of the lake because it gives them a gorgeous establishing shot of the city skyline reflected in the water. That’s where I had parked, on the southwest shore, as the thieves had instructed. Now I was walking along the 3.1 miles of plowed jogging trail that circled the lake with a red rose in my hand—also as I had been instructed. The sky was brilliant blue and the sun was dazzling, but that was just for show. It was so damn cold that the petals of the rose froze solid a few moments after I left my Jeep Cherokee. My hands and feet nearly froze, too. I was dressed to endure the chill that I expected to encounter dashing between warm buildings and warm cars, not for the numbing cold that blew off a frozen lake in Minnesota in January.\\n\\n The rose was for identification purposes. It meant that while the artnappers knew my name, they didn’t actually know me or what I looked like. Demanding that I carry it around the lake gave them a chance to get a good look at me. Meanwhile, I wouldn’t be able to distinguish them from all the other men and women who nodded and smiled as we passed on the trail. Or maybe they were hiding in a snowdrift or camped out on one of the countless benches taking my photograph. It was unlikely that Tarpley would have risked being discovered—he had to know that I would have seen his photograph by now. Of course, it could have been just a test designed to see how well I followed instructions. They demanded that I give them the number of my cell phone when we spoke. Maybe they’d call and tell me to drive to the Mall of America. Maybe they’d tell me to jump in the lake. The only thing I knew for certain was that everything they’d done so far, including involving me in their affairs, smacked of deliberation.\\n\\n I had been circling counterclockwise around the lake, walking at a brisk pace for no better reason than to keep warm. I hoped Donatucci wasn’t following me. The artnappers demanded that I come alone, and I said I would. I made Donatucci promise that there would be no surveillance of any kind, either at the lake or later when I delivered the money; nothing that would make the thieves twitchy. It might seem counterintuitive, but I felt I would be much safer without backup than with it. ’Course, I’ve been wrong before.\\n\\n I passed the Thirty-second Street Beach and the sailing school, making my way toward West Lake Street and the edge of Uptown, an eclectic neighborhood of bars, clubs, restaurants, cafés, coffeehouses, retail shops, movie theaters, and one decent blues joint. I thought about the blues joint and the bars and restaurants as I made my turn around the top of the lake, telling myself how well a warm beverage would go down right about then. Like I said, though, the artnappers might have been testing to see how well I followed instructions, so I kept walking, moving past the North Beach and following the trail until I was heading south.\\n\\n I was at about the 2.5-mile mark when they made their move, two men coming up fast behind me. I heard their footsteps and turned my head just as the larger of the men knocked me to the asphalt. The trail was icy and I skidded a few feet—I dropped the rose. The large man put a knee against my spine, pinning me down while he cuffed my hands behind my back. The smaller man pulled a black hood over my head. I protested.\\n\\n “This isn’t necessary,” I said.\\n\\n They didn’t care. They yanked me to my feet and half carried, half dragged me through the snow. A woman screamed. A man shouted, “What’s going on?” The two men paused. I heard the sound of a door being pulled back on rollers. A van, I guessed. I was shoved into the vehicle. The door was slammed shut. The vehicle started moving, picked up speed. There were a lot of sharp turns taken too fast. The van hit a patch of ice and fishtailed dangerously after one turn before the driver brought it under control.\\n\\n “Anyone ever teach you how to drive in the winter?” I asked.\\n\\n The driver didn’t respond. Perhaps he didn’t hear me through the hood.\\n\\n Minutes seem like hours in a situation like that, so I couldn’t tell you how long we drove. I tried to remain calm. I reminded myself that the thieves needed me to get their money. They might try to frighten me to death, but they weren’t going to kill me. There was no profit in it. \\n\\n","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-7.html","bookId":2218,"book":{"id":2218,"title":"Curse of the Jade Lily (Mac McKenzie #9)","description":"Storyline: A stolen gem with a tragic history, a curse and a million dollar ransom is Mac McKenzie\u0027s latest case, in David Housewright\u0027s Curse of the Jade Lily \\n Several years ago, Rushmore McKenzie became an unexpected millionaire and set about doing not much of anything. Now, showing up at his doorstep is the insurance company that paid the settlement that made him rich—and they want a favor. Someone has stolen a very expensive gem from a local art museum and is willing to ransom it back. The only condition is that McKenzie has to be the go between. And this is no ordinary gem—it is a jade with a history going back to the Qing Dynasty and a reputed curse that stories claim has ruined or killed everyone who has ever owned it. McKenzie agrees to help but what starts out as a simple ransom quickly becomes complicated. \\n Suddenly other parties—including the State Department and a mysterious woman named Heavenly—start showing up, wanting McKenzie to turn over the gem to them. When the murdered body of on of the thieves turns up in a snow drift, it looks like the cursed Jade Lily has claimed its latest victim. And there may well be more to follow…\\n","cover":"https://allnovel.net/images/curse-of-the-jade-lily-mac-mckenzie-9.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:30:16 PM"}}
