{"id":103954,"no":83,"title":"Page 83","content":"The food we ordered was served fairly quickly by a waitress Herzog knew as Mayra—she was happy to see him, too. Eating my fried pastry stuffed with beef and chicken was difficult with one hand, yet well worth the effort. Herzog’s stew looked so good I might have broken my personal rule about asking for a taste of someone else’s meal except, well, it was Herzog. We ate in silence. Herzog washed his meal down with a Mexican beer; I had switched to iced tea. Suddenly Herzog pointed upward at nothing in particular with his fork. “Shhh,” he said. I tilted my head and listened. Around us were the murmur of voices and the tinkling of silverware. Above, from hidden speakers, came a Latin rock song. “The music?” I asked. “The guitar. Listen t’ those riffs.” A moment passed. Herzog’s smile became gleeful. “Carlos Santana,” he said the way some people might say, “Lord almighty.” We listened some more. “He the best,” Herzog said when the song ended, replaced by something from Marc Anthony that he didn’t care for at all. “You’re starting to grow on me, Herzy,” I said. “Don’ go thinkin’ we be friends or nothin’, McKenzie.” “Never.” “You just the man payin’ the bills.” To prove it, when Mayra set the tab in the center of the table, Herzog slid it across to me. I didn’t mind. Between the iced tea and stuffed pastry, I was starting to feel pretty good about myself and the world in general. So good that I was actually mulling over the suggestion Nina had made that morning—Why not give the Jade Lily to the insurance company like you promised and forget the whole thing? Then the damn phone rang, ruining the moment. “Yeah,” I said. “This is Mr. Fiegen.” There’s that “mister” again, my inner voice reminded me. “Yeah,” I said. “I just spoke to Branko Pozderac and Jon Hemsted.” “Really?” I glanced at my watch. “It took them this long before they started whining?” “Branko is livid.” “What’s he got to complain about? The man’s lucky to be alive.” “He’s a foreign national.” “He’s a racist. He’s also a crook. Come to think of it, so are you.” “Do we need to go through this again, McKenzie?” “Why don’t you tell me why you’re calling?” “You have something that belongs to me.” “Are you referring to the letter? I’m going to hang on to that for a while.” “If you think you’re going to blackmail me—” “I just want to make sure that you keep your end of the deal.” “Do we still have a deal?” “You tell me.” “I was told that the Jade Lily was destroyed.” “No, you weren’t.” “Donatucci said—” “What did he say? Think about it.” Fiegen paused for a long moment. “What are you up to?” he asked. “I told Pozderac, although I don’t think he was listening, and now I’m telling you—I’ll be in touch.” I turned off my cell phone and set it in front of me. “I was starting to like it here. I was going to suggest we hang around for a while, have a few more drinks.” “Still could,” Herzog said. I closed my eyes and leaned back as far as I could without disturbing my collarbone. It had already been a long day. “Sometimes, Herzy…” I didn’t finish the thought, so Herzog finished it for me. “You a cop,” he said. “You always be a cop.” “If you say so.” Herzog pointed at the check. “I always tip twenty percent,” he said. FIFTEEN The street where Von Tarpley lived in Burnsville rose upward from the Minnesota River valley to a hilltop section of homes that must have looked impressive when they were first built in the decade following World War II. Times have changed. The average American home has doubled in size since the 1950s, and in today’s era of McMansions and three-and-a-half baths, Tarpley’s yellow two-story colonial with attached garage now seemed small, quaint, and out of place. It still had its Christmas lights up, which wasn’t particularly surprising. Minnesotans usually put them up around Thanksgiving when the ground is comparatively snow free and take them down when the snow melts in April. The question was—did Von still turn them on? Some people argue that Christmas lights must be extinguished the day after Christmas. Others hold out for New Year’s Day. Still others, in a staggering breach of etiquette, light them up well into February. Those that keep them shining all year ’round—well, they’re just plain nuts. My mother had been a big believer in the Twelve Days of Christmas and turned off the lights on January fifth. After she died, my father kept up the tradition, and now I did. We parked just down the street from the house and sat watching. No other cars approached or left; no one walked by. The street wasn’t used by anyone except the people who lived on it, and then just for transportation. It had been skillfully plowed, and most of the sidewalks and driveways abutting it had been cleared of snow. However, only a hole big enough to allow a car to pass had been carved out of the huge mound thrown up onto Tarpley’s driveway, and only a narrow path had been shoveled on his sidewalk, allowing room for just one person to pass. I kept thinking “his.” I had to remind myself that Tarpley had been dead for over a week now. I unlatched the door of the Jeep Cherokee and shoved it open with my good arm. “Want me t’ wait?” Herzog asked. “Come with,” I said.","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-83.html","bookId":2218,"book":{"id":2218,"title":"Curse of the Jade Lily (Mac McKenzie #9)","description":"Storyline: A stolen gem with a tragic history, a curse and a million dollar ransom is Mac McKenzie\u0027s latest case, in David Housewright\u0027s Curse of the Jade Lily Several years ago, Rushmore McKenzie became an unexpected millionaire and set about doing not much of anything. Now, showing up at his doorstep is the insurance company that paid the settlement that made him rich—and they want a favor. Someone has stolen a very expensive gem from a local art museum and is willing to ransom it back. The only condition is that McKenzie has to be the go between. And this is no ordinary gem—it is a jade with a history going back to the Qing Dynasty and a reputed curse that stories claim has ruined or killed everyone who has ever owned it. McKenzie agrees to help but what starts out as a simple ransom quickly becomes complicated. Suddenly other parties—including the State Department and a mysterious woman named Heavenly—start showing up, wanting McKenzie to turn over the gem to them. When the murdered body of on of the thieves turns up in a snow drift, it looks like the cursed Jade Lily has claimed its latest victim. And there may well be more to follow…","cover":"https://allnovel.net/images/curse-of-the-jade-lily-mac-mckenzie-9.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:30:16 PM"}}
