{"id":103959,"no":88,"title":"Page 88","content":"Von stepped in front of Dennis. “McKenzie, please,” she said. “He has nothing to do with the Lily. I promise you.”\n “Just so you know, I meant what I said before. I want my money. I’ll be in touch.”\n I reached out and tapped the tip of her nose with my finger. In hindsight, it was a silly gesture. After that, Herzog and I bulled our way past Von and Dennis and stepped onto the barely shoveled sidewalk.\n “I’ll be in touch,” I repeated.\n Dennis slammed the door behind us in reply.\n I’m pretty sure I was smiling as we made our way back to the Jeep Cherokee.\n “How was I?” I asked. “Scary?”\n “Girl Scout,” Herzog said.\n Herzog started the Cherokee once we were safely inside, but I told him to wait before he put it in gear. I pulled the printed photograph out of my inside pocket and unfolded it. The sun was starting to set, and I turned on the dome light so Herzog could get a good look at it.\n “Do you recognize this gentleman?” I asked.\n “Yeah,” he said. “Yeah. This is—ain’t this the dude inside the house? Dennis somethin’? One just threw us out?”\n “He’s also the guy who put the bomb in the motel room.”\n “Fuckin’ A.” Herzog stared at the photo and then at Von’s house. “He the one try t’ blow you up?”\n “It gets better.” I pointed at the small SUV that had been parked directly in front of the Cherokee while we were in Tarpley’s house—a metallic red Toyota RAV4. “The vehicle he’s driving was seen both at the motel and at the museum the night the Jade Lily was lifted.”\n Herzog opened his door.\n “Wait, wait,” I said. “Where are you going?”\n “Don’ you want to smoke this fuck?”\n “It can keep.”\n “No time like the present.”\n “Nah, nah, not yet.”\n “What we waitin’ on? You gonna call the cops?”\n “I thought you didn’t like cops.”\n “McKenzie, you gotta know—if’n he’s here, ’at proves ’im and the girl are in on it together. The money you lookin’ for probably in one of ’em boxes.”\n “No,” I said. “I know where the money is. It’s not here. Not yet, anyway. Otherwise they wouldn’t be wasting time packing.”\n “Where the money at, then?”\n Instead of answering, I pulled a pen from my pocket and used it to write down the license plate number of the Toyota. Afterward, I looked at my watch, which was on my right wrist because my left wrist was pinned to my chest.\n “We need to get going,” I said. “We’re running late.”\n It was a bad time of day to drive with traffic crawling on the freeway like a distracted infant. Fortunately, since there were two of us in the Cherokee, we were able to use the car pool lanes. That helped us to be only ten minutes late when we reached El Cid’s joint in the Phillips neighborhood. ’Course, the way Cid behaved you’d think we had delayed a shuttle launch.\n “I don’t wait ten minutes for anybody,” he announced when we stepped inside the bar.\n I was tempted to blame Chopper, say he must have confused the time when I asked him to set up the meeting. That would have been cheap, though.\n “I misjudged the rush hour traffic,” I said. “Sorry.”\n “That is no excuse,” Cid said. “Punctuality is one way we show respect for each other.”\n He had me there.\n “I apologize,” I said.\n “This had better be worth my while.”\n Cid had been standing when he called me out. Now he slipped into the same booth where he had sat when I first met him. His bodyguard was sitting at the same table. The same hat was on top of the table; I presumed his gun was beneath it. If there was a difference, it was that he openly watched Herzog intently. I could have been carrying a bazooka in my pocket instead of the Walther PPK and I doubt he would have noticed.\n I moved to the booth and waited until El Cid nodded his permission before I sat. Herzog stood at the door, his hands casually folded over his stomach, and stared at the bodyguard. He told me before we entered the bar, “I gots t’ say, ’at pussy pulls on you, I’m gonna cap ’is ass.”\n “I would certainly hope so,” I told him.\n “I agreed to meet you again as a favor to Chopper,” Cid said, the implication being that otherwise I was beneath his notice.\n “I appreciate that,” I said.\n “Well? What’s it about?”\n “When last we spoke, you suggested that you’d be happy to take the Jade Lily off my hands should I stumble upon it. If memory serves, you also mentioned several ways an enterprising man might dispose of it—selling it to interested parties in Europe or the Pacific Rim; perhaps locking it in a vault for safekeeping until the statute of limitations expired and/or a convincing provenance was established. These possibilities existed, of course, before the cop killing made the Lily too toxic to handle.”\n Cid spread his hands wide. “Just idle chatter,” he said. \n","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-88.html","bookId":2218,"book":{"id":2218,"title":"Curse of the Jade Lily (Mac McKenzie #9)","description":"Storyline: \n A stolen gem with a tragic history, a curse and a million dollar ransom is Mac McKenzie\u0027s latest case, in David Housewright\u0027s Curse of the Jade Lily \n Several years ago, Rushmore McKenzie became an unexpected millionaire and set about doing not much of anything. Now, showing up at his doorstep is the insurance company that paid the settlement that made him rich—and they want a favor. Someone has stolen a very expensive gem from a local art museum and is willing to ransom it back. The only condition is that McKenzie has to be the go between. And this is no ordinary gem—it is a jade with a history going back to the Qing Dynasty and a reputed curse that stories claim has ruined or killed everyone who has ever owned it. McKenzie agrees to help but what starts out as a simple ransom quickly becomes complicated. \n Suddenly other parties—including the State Department and a mysterious woman named Heavenly—start showing up, wanting McKenzie to turn over the gem to them. When the murdered body of on of the thieves turns up in a snow drift, it looks like the cursed Jade Lily has claimed its latest victim. And there may well be more to follow…\n \n","cover":"https://allnovel.net/images/curse-of-the-jade-lily-mac-mckenzie-9.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:30:16 PM"}}
