{"id":71204,"no":27,"title":"Page 27","content":"\n My jaw drops and I throw a chip at him, hitting him in the chest. “I am so an angel.”\n “Ow.” He rubs his nipple where the chip scraped. “That was vicious.”\n I nip my teeth at the air and then laugh, taking a drink of my beer. “Now back to the game. What do you have?”\n He taps his fingers on the table, eyeing his cards and then targets an inside-melting gaze on me. “I want to up the bet,” he says, and when I start to gripe, he adds, “If you win you get my signed Silverstein shirt, but if I win you have to get naked.”\n My heart thumps deafeningly in my chest. “I thought you said you’d never give me that shirt—that it was your pride and joy for getting it signed.”\n He gives a blasé shrug. “I’m making an exception right now.”\n I measure the pair of queens in my hand and the one laid down on the table, but there is also a pair of aces dealt. Shit. “I don’t know…”\n “Come on, Ella May,” he says, wiggling his eyebrows up and down. “Loosen up.”\n From over my cards, I glare at him. “I’ll tell you what. If you lose you give me the shirt, but if I lose I’ll take off my bra and jeans, but the panties are staying on.”\n Micha chuckles and takes a shot. “That’s not very fun.”\n I roll my eyes. “I’ve seen you play poker with girls like this before and you never offer up anything this rewarding unless you have a good hand and know you’ll win.”\n “And I’ve seen you play enough times that I know you won’t back down from a good challenge,” he retaliates, slamming the bottle onto the table. “So come, pretty girl, are you in or out?”\n I consider it, but not for very long, and lay my cards down on the table. “I’m in. Now what do you have?”\n A soon as his lips turn upward, I know how it ends. He slaps his cards down on the table. “Get naked, Ella May.”\n “You had the fucking ace.” I smack some of the cards off the table and they float to the floor. “I knew you had it.”\n He continues to grin. “And yet you kept playing. Now get naked.”\n I stare inanely at him. “That wasn’t fair. You tricked me.”\n His eyes hold mine powerfully as he pats his hands on the table. “That was a totally fair hand and you know it, so stop being a baby and hand over your losings.”\n Staring him down, I come to the conclusion that there’s no point in fighting. Keeping my eyes on him, I get to my feet and carry my chin high.\n He raises a finger as he shoves the chair away from the table. “Just a second.” He saunters into the living room and disappears out of my sight.\n Confused, I start to head for the doorway to find out what he’s doing, but as soon as my foot inches forward, the stereo clicks on and I stop as “Closer” by Nine Inch Nails clicks on.\n “You have got to be kidding me?” I mumble as Micha struts into the kitchen with a pleased grin on his face as he rubs his hands together. “No way. Music was not part of the deal.”\n He braces his hands on the door frame and the light highlights the muscles on his chest and the shameless blaze in his aqua eyes. “Now, most guys would have gone with some sexy song you had to dance to, but I’m a lyrical man myself and I think this song fits perfectly.”\n The lyrics make my cheeks heat. “In no way, shape, or form did I offer up a striptease.”\n His tongue slips slowly out of his mouth and when he pulls it back in, he draws his lip ring with it as his fingers comb through his disheveled hair, leaving strands sticking up. “Pay up, pretty girl.”\n Pressing my lips firmly together to bury my nerves, I reach around to the back of my bra and unclasp it. Wavering temporarily, I inhale an insecure breath, release the fabric from my fingers, and allow it to fall to the floor.\n His eyes drift to my chest, unashamed, as he sips a beer. When he pulls the bottle away from his lips, he makes a motion with his finger. “Continue.”\n I want to smack him upside the head, but I unbutton my jeans. With my knees shaking, I step out of my pants and stand vulnerable in the spotlight, something I despise. Thankfully, I’m wearing boy-cut panties so at least my ass is covered. His eyes lazily move up my long legs, across my bare stomach, finally resting on my eyes.\n “You can sit down now,” he says like he’s the boss.\n Proving a point, I walk across the kitchen and steal a beer from the fridge. “I don’t have to sit down just because you tell me to—”\n Warm fingers grip my side and reel me around, snatching the beer from my hand as my back presses against the fridge door. Micha stands only a sliver of space away from me, eyes fierce, lips tantalizing, his expression yearning with need.\n He leans in to kiss me, but my hand pushes at his chest, and his bare skin is warm as I hold him back. “No way. You didn’t win anything but a show.”\n Lowering my head, I duck under his arm, but he snags my wrist and pins it above my head kind of roughly. We’re drunk and neither of us is thinking rationally, but my interest in what’s coming renders me motionless.\n His pupils are so large only a ring of aqua is left. His breath is hot against my cheek as he takes my other arm and confines it above my head so my body is exposed to him. It seems like I should be nervous, but excitement bubbles through my very starved body.\n He inclines toward me and his chest brushes my tingling nipples. “Do you want me to stop?” His voice is husky.\n I shake my head with honesty. “No.”\n The thumb of his free hand travels down my side and along each rib before settling on my hipbone. Wetting his lips with his tongue, he moves his mouth toward my breast and my eyes close as he takes my nipple in his mouth.\n “Oh my God,” I moan as ecstasy shoots up between my legs and coils through my stomach as my back curves into him. “Micha…”\n He releases my arms, and before an objection departs my lips, his picks me up and smashes his lips into mine. I vice-grip my legs around his hips and my lips open willingly, allowing his tongue to enter my mouth for a heart-stopping kiss. Backing toward the sofa blindly, his hands feel all over my skin, leaving a trail of heat everywhere.\n “Not on the couch,” I murmur. “Lila and Ethan could be back at any moment.”\n He gives a glance at the front door and then turns us in the direction of the hallway. His fingers sneak up the bottom of my panties and cup my ass as he kicks his bedroom door open hard with his foot and the doorknob bangs into the wall. Without our lips parting, we fall onto the mattress with a bounce. Giggling, my fingers slide down his hard chest and to the button of his jeans, but he halts my hand with his.\n “Ella, maybe we shouldn’t,” he says, blinking dazedly through the alcohol.\n I manage to slip my other hand down the front of his jeans and his breath falters. “You don’t want me?” I ask.\n Sucking a sharp breath through his nose, his head slumps forward as I rub him and drive him crazy. “Trust me, that’s not it. I think we…”\n I hit the right spot and all his thoughts drift away. His lips pursue mine again and he kisses me freely as his hand slides down my stomach and to the edge of my panties. Hooking his finger into the top, he yanks them down my legs and when they reach my feet, I kick them off.\n Instead of his lips returning to my mouth, they endeavor to my stomach just above my belly button. Smoothing kisses down my skin, his warm tongue licks a path all the way down and my legs open up so his tongue can slip inside me and my mind becomes even foggier.\n When my eyes open, sunlight filters into the room and my head is pounding. A blanket is bunched up over me and my pores feel icky. Wiping the sweat from my cheek, I sit up and glance down at the signed Silverstein T-shirt covering my body.\n A smile breaks through as I spot a folded-up piece of paper on the pillow beside me and pick it up. Micha’s handwriting is scribbled across the lines in red ink.\n Hey beautiful,\n So that was quit the drunken night… never done one of those with you before. I think I might have a new song to add to our list.\n Anyway, don’t get all worked up. I stopped it before it got too far, in case you can’t remember. I didn’t want you to have to suffer through a drunken mistake. Trust me, I’m an expert at them and they’re not fun.\n I hate to bail on you, but I got to go to work. I’ll stop by your place later. And you can keep the shirt. It looks better on you anyway.\n Love you more than life itself, more than the sun and the air.\n You own my soul, Ella May.\n Micha\n Still smiling, I climb out of bed and slip my jeans on. Leave it to Micha to sign a letter like that. He’s always had such a poetic way with words and his beauty shines with each letter.\n Grabbing my shirt off the floor, I depart for the front door, folding up the note carefully and tucking it safely into the back pocket of my jeans. I feel light, even though I’m hungover. I don’t regret what happened, although it would have been nice if we were sober. The feeling is strange, but maybe that means I’m getting better at dealing with life.\n The living room is trashed, beer bottles all over the floor and coffee table, and there’s an empty Bacardi bottle on the table, along with scattered poker cards. Getting a garbage bag from the kitchen drawer, I rack my brain for where my phone and purse are. I remember being at the club, Micha playing on stage, and then coming here and his hands all over me. My eyelids drift shut as I remember every moment of it.\n “Only One” by Yellowcard begins playing from somewhere in the room and my eyes snap open. With my ears perked up, I follow the sound, which guides me to the couch. Under a frayed throw pillow is my phone. My eyebrows scrunch as I scoop it up, not recognizing the ringtone. When I glance at the screen, however, it makes sense.\n I answer the phone. “Did you change my ringtone for you?”\n His laughter fills the other end of the line. “It seemed fitting this morning.”\n “It seems like you’re trying to send me a message through your notes and your song choice.” I collect a bottle from off the top of the television and drop it into the bag. “You know I’m not mad about last night, right? I was sober enough that I can remember stuff… You don’t have to feel guilty.” \n","sourceLink":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2/page-27.html","bookId":1970,"book":{"id":1970,"title":"The Forever of Ella and Micha (The Secret #2)","description":"Storyline: \n The Forever of Ella and Micha (The Secret #2) \n Ella and Micha have survived tragedy and heartbreak. When they\u0027re together, anything seems possible. But now they are thousands of miles apart, and managing their long distance relationship will put their love to the test. \n Ella is back at school, trying hard not worry so much about her future. But with her father in and out of rehab, she\u0027s having a hard time making it through the days. All she wants is Micha by her side, but she refuses to let her problems get in the way of his dreams. \n Micha spends his days touring the country with his band, but deep down he knows something is missing. Being away from Ella is harder than he thought it would be. He wants her closer to him-needs her with him. But he won\u0027t ask her to leave college, just to be with him. \n The few moments they do spend together are intense and passionate, but it only makes it more difficult when they have to part. They know they want to be together, but is wanting something enough to get them to their forever?\n \n","cover":"https://allnovel.net/images/the-forever-of-ella-and-micha-the-secret-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:05 AM"}}
