{"id":71206,"no":29,"title":"Page 29","content":"“Rise and shine. We gotta hit the road.” Ethan bangs the door open, and when he takes in the situation, his face drops. “You are still going, aren’t you?” I nod as Ella snuggles closer to me. “Yeah, give me like fifteen minutes or so.” “Whatever, man. Just hurry your ass up.” He walks away, leaving the door wide open. “Baby, are you awake?” I whisper in her ear and kiss the sensitive spot on her neck. Her shoulder shivers upward as she nods her head with her eyes closed. “How could I sleep through Mr. Loud Mouth?” I nibble at the tip of her earlobe and breathe in the scent of her hair. “I have to get ready to go… Are you sure you don’t want to come with us? I really want you to.” Her leg hitches around my hip and her body bows into me. “I think I—I want to come with you guys, but I have to go back to my place and pack a bag real quick. And I have to stop by and do a quick visit with my therapist. We have to see if Lila will go with us too. I don’t want her here alone.” My body stiffens from her intimate touch. “Alright, but you know Ethan’s gonna complain the entire time.” She rolls on top of me, props herself up on her elbows, and peers down at me through her puffy eyes. “I know, but he’ll just have to deal with being a few hours late to wherever it is he thinks he has to be.” Knotting my fingers through her hair, I tug at the roots and bring her face close to mine, loving how her eyes roll back. “Are you sure you’re okay? Last night you had me worried.” “I’m fine, Micha.” She kisses my lips softly. “Last night was a good thing, even though it was intense… and I think I need to go back home. If nothing else than to talk to my father.” She begins to recoil, but seizing her hips, I trap her in place and entice her lips back to mine. I slip my tongue inside her mouth and she lets out a quiet moan. When I let her go, our breathing is ragged. She backs off of me and I try not to think about our unbalanced love for each other. She’ll get there eventually, once she understands what love is. When I call out “I love you” as she heads for the hallway and she returns it with only a smile, it stings a little. Ella Ethan lectured me the entire time I packed my bag and then his face got really red when I announced I had to go see my therapist before we took off. I need to talk to her, though, about my revelation last night. Ever since I was a little kid, I thought love wasn’t real. Then Micha showed me differently, but I still couldn’t love him like he deserved. Whether intentional or not, my dad’s letter released me from some of the burden I’d been carrying. Not all of it, but some, and last night when I was curled up beside Micha, I envisioned something I’d been blind to. A hope for a future. Anna is locking up her office door when I arrive. “I thought I was supposed to meet you?” She whirls around, pressing her hand to her heart, her eyes amplified as her keys fall from her hands to the floor. “Good God, you scared me.” I scoop up the keys and hand them to her. “I’m sorry. I just thought we had an appointment today.” She drops her keys into her purse. “I was actually getting ready to call you. I got a call from my sister and she needs me to come over a couple days early. She’s very worried about hosting Christmas dinner for everyone.” We make our way down the hallway of the school and push out through the doors, which latch shut behind us. It’s a cloudy day and the violent breeze cools my skin and stings my cheeks. “So I guess I’ll see you when you get back,” I say, getting ready to leave her and cut across the grass toward my apartment. She turns for the parking lot, but stops at the curb. “Of course, first thing on Monday. And make sure to call me if you need anything.” Ethan’s lifted truck drives up to the sidewalk and he lays on the horn. Anna’s eyes dart toward it and the heel of her shoe catches in the grass, causing her to trip. I sigh and redirect my direction to the truck. “Sorry about that. He just gets kind of antsy.” “Are you going somewhere?” She frees her shoe from the grass and steps back up onto the sidewalk. I nod. “I decided to go with Micha and Ethan back home.” She does the buttons of her navy blue jacket up. “That’s good. I’m glad you decided to go.” I shield the wind from my face with my hand. “Why? I thought you said you weren’t sure if I should.” “No, I said only you would know if you should.” She pauses and wisps of her short hair flap in the breeze. “Ella, can you do something for me on this vacation?” “Sure, what?” “Stop worrying so much and have fun. It’s what you need,” she says with a smile. “I do have fun… sometimes.” “Well, try to have fun the entire time.” I pluck bits of my hair out of my mouth as I take in her words. “You remember what you said about being in a relationship with Micha and that only I would know when I was ready. Well, I think I’m ready. I know it’s really soon and everything, but last night, well, I saw a glimpse of a future with him that I really, really wanted. And that’s never happened to me before.” She doesn’t look upset, like I’d expected she would. “That’s good. I’m glad you were able to see that. But remember to take things as slow as you need to. I want you to focus on yourself.” She waves and walks across the grass toward the parking lot. “Have fun, Ella, and I mean it. You deserve to.” Fun? Is that the magic cure to repair my mind? I tuck my chin in and fight against the wind, heading toward the car—heading home. Road trips with Ethan and Micha are a pain in the butt. I forgot about the guys’ “no bathroom stop” rule: they’ll only stop, like, every four hours for a break. If there isn’t a restroom close by, then they consider a bush a good substitution. It doesn’t bother me that much, but poor Lila isn’t used to their crap. We’re sitting in the back of the truck on opposite sides and she’s bouncing up and down, jiggling her legs to hold it in. “Just pull over.” I slap the side of Ethan’s arm for being an asshole and refusing to pull over. “She’s not going to pee off the side of an off-ramp.” “I’ll back the truck up, so it blocks her,” he replies, stunning Lila. “No one will see.” “I don’t think…” Lila presses a look at me for help. I unbuckle my seatbelt and lean over the seat to pinch Ethan’s arm. “Pull the damn truck over now,” I threaten. “If not for me, for her.” “Ow, you’re always so evil,” Ethan complains and then taps the brakes hard, sending me flying over the seat. “But I’m much eviler.” I summersault over and my legs hit the dash as the shifter stabs me in the back. Sitting up straight, I smooth my hair into place and extend my hand toward him to do something equally as sinister, but Micha snags my elbow and pulls me onto his lap. “Easy, you two,” he says, hugging me close and conforming his lap against my backside. “We have a long drive ahead of us still.” Shooting me a dirty look, Ethan swerves the truck off the nearest off-ramp that leads directly to a truck stop. Semis line the chain-linked fence that borders the building and there’s a flashing marque promising everyone ten cents off each gallon when paying with cash. He pulls up to an empty gas pump and silences the engine as he zips his plaid hooded jacket up. “But just so you know, this is for Lila, not you.” I glare at him as Lila hops out of the truck and dashes toward the entrance of the building. She’s wearing a white dress and pearls around her neck, looking completely out of place at the truck stop. When I asked her why she was overdressing for a road trip, she shrugged and said she was used to having to dress up for days related to holidays. Micha gets out of the car and offers his hand to help me out. The cool air hits my bare legs as I stretch my arms above my head. Micha eyes me with amusement as he ruffles his blond hair into place so wisps are dangling across his forehead. “You know you give Lila crap for overdressing, but you kind of undressed.” He gestures at my jean shorts and purple T-shirt. “What were you thinking when you put that on?” “Hey, it was hot when we left,” I argue, adjusting the bottom of my shirt back over my stomach. “And I wanted to be comfortable.” He unzips his black hoodie, and his T-shirt rides up a little, showing a glimpse of his abs. “Put this on before you freeze to death.” “I’ll be okay,” I assure him, enclosing my arms around myself. He urges the jacket at me with persistency. “Take it, because I’m not putting it back on.” I take the jacket and give him a quick kiss on the cheek before sticking my arms through the sleeves and zipping it up. It smells like his cologne mixed with a scent that belongs only to him and I inhale deeply, relishing it. “Did you just smell my jacket?” he inquiries with a cock of his eyebrow. “Is that like some kind of weird ritual or something?” “It smells like you,” I explain and pull the front of the jacket over my nose to shield it from the cold. “And I like the smell of you.” He seems pleased with my odd response and tugs the hood over my head. “Smell away.” Smiling, I turn for the gas station as a red Mustang, the same years as Blake’s, inches up to the pump two rows down. I shrug it off as coincidental, until Blake gets out of the car. He’s has on a gray beanie and a hoodie over a blue shirt. His jeans don’t have paint smudges on them and he has gloves on his hands. Micha and Ethan are distracted by a blonde who has her butt sticking out as she attempts to fill up the oil in her car. Ethan is saying something vulgar about her ass while Micha encourages him to go help her “fill up her tank.”","sourceLink":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2/page-29.html","bookId":1970,"book":{"id":1970,"title":"The Forever of Ella and Micha (The Secret #2)","description":"Storyline: The Forever of Ella and Micha (The Secret #2) Ella and Micha have survived tragedy and heartbreak. When they\u0027re together, anything seems possible. But now they are thousands of miles apart, and managing their long distance relationship will put their love to the test. Ella is back at school, trying hard not worry so much about her future. But with her father in and out of rehab, she\u0027s having a hard time making it through the days. All she wants is Micha by her side, but she refuses to let her problems get in the way of his dreams. Micha spends his days touring the country with his band, but deep down he knows something is missing. Being away from Ella is harder than he thought it would be. He wants her closer to him-needs her with him. But he won\u0027t ask her to leave college, just to be with him. The few moments they do spend together are intense and passionate, but it only makes it more difficult when they have to part. They know they want to be together, but is wanting something enough to get them to their forever?","cover":"https://allnovel.net/images/the-forever-of-ella-and-micha-the-secret-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:05 AM"}}
