{"id":95081,"no":19,"title":"Page 19","content":"Pergith stared at his friend, unable to believe what he was hearing. Zermicazyne had fallen in love with an earthling, and if that wasn\u0027t bad enough, he wanted to return to Earth and live with the woman. \"Live with her?\" Pergith queried. \"Cohabitate? In the same dwelling? Together?\" \"Yes.\" \"You cannot be serious. Do you mean to sacrifice your career and leave Xanthia forever for this female, this Earth woman?\" Pergith shook his head. \"Think what you would be giving up. Earth is a primitive planet. What would you do there?\" \"I have made up my mind, Pergith. When you take Lainey back to Earth, I am going with her.\" \"I think not.\" Micah stood up. Bracing his hands on the commander\u0027s desk, he leaned forward. \"I am going with her. You may be the commander of this vessel, but you are not in command of my life.\" \"You cannot walk away from the Fleet, or from your responsibilities,\" Pergith said, his voice suddenly cold. \"You have an obligation. To our people. ToAdana . To yourself. If you cannot think rationally enough to realize that what you\u0027re doing is wrong, then I shall take whatever steps I deem necessary for your own good.\" Micah\u0027s eyes narrowed ominously. \"That sounds dangerously like a threat.\" \"It is, in fact, a promise,\" Pergith retorted. \"Being on Earth so long has warped your thinking. Even your manner of speech is altered.\" Without taking his gaze off Micah, Pergith switched on the intercom on his desk. \"Security, report to the commander\u0027s cabin.\" Micah stared at Pergith in disbelief. \"Are you having me arrested?\" \"Of course not. I simply intend to have you confined until the Earth woman has been returned to her own planet.\" \"No! Damn you, Pergith, you cannot do this!\" \"I can.\" Pergith glanced past Micah as the door to his cabin swung open. Pergith signaled for Jerva, the chief security officer, to enter. Achaia waited in the companionway, his weapon at the ready. \"Jerva, I want Commander Zermicazyne confined to his quarters until the Earth woman is returned to the planet.\" \"Yes, Commander.\" Jerva approached Micah, his hand on the stunner at his side. \"Will you come peacefully, Commander?\" \"Pergith, I beg you, do not do this.\" \"You will thank me when it is over.\" \"Don\u0027t count on it.\" Pergith saw the rage glittering in Zermicazyne\u0027s eyes as he glanced at Jerva, and then at Achaia. The commander took a deep breath, fearing he was about to destroy a lifelong friendship, yet certain that he was only doing what needed to be done. \"You had best put him in restraints until you reach his quarters,\" Pergith suggested. He looked at Micah and shook his head. \"I am sorry, my friend.\" A muscle twitched in Micah\u0027s jaw as Jerva fastened the restraints around his wrists. They were a remarkable piece of work; lightweight yet virtually unbreakable, they were infused with a substance that reacted to violent emotion and movement. Should a prisoner become hysterical, try to escape, or become violent, the sudden accelerated change in heart rate and body temperature immediately caused the restraints to inject a drug into the bloodstream that rendered the prisoner unconscious within seconds. Micah stared at the restraints, and then at Pergith. \"Let me go to her and explain what is happening.\" Seeing the refusal in Pergith\u0027s eyes, Micah took a deep breath, hating his old friend for making him beg. \"Please, Pergith, at least let me tell her good-bye.\" Pergith glanced down at the medical report on his desk, wondering how much Zermicazyne knew, and then he shook his head. \"I think not.\" Micah took a step forward, his hands curled into tight fists. \"Damn you, why are you doing this?\" \"I think perhaps being so long on Earth has warped your thinking,\" Pergith replied. \"We will return the woman to Earth when it is dark, and then set course for Xanthia. You will feel better about everything once you are home again.\" Micah glared at Pergith. For one brief, irrational moment, he thought of unleashing his power, of destroying his friend and anyone else who dared stand in his way. He could incinerate Pergith and perhaps the other two before the restraints rendered him unconscious... He swore softly, appalled that the thought had even crossed his mind. With a last accusing glance at Pergith, he followed Jerva out of the room. Lainey paced the floor of her quarters, wondering where Micah was. She had no idea of how much time had passed since she\u0027d seen him last, but she was sure it had been at least twelve hours. Where was he? Tired of pacing, she sat down on the edge of the narrow bed and gazed at her surroundings. The room was small and round, with a domed ceiling, white walls, and a white floor. The chair beside the bed felt as if it was made of plastic, yet she knew it wasn\u0027t plastic at all. She stared at the ceiling curiously. There were no lights visible, yet the room was as bright as day unless she sat on the bed, at which time the light grew dim; when she lay down, the light went out altogether. There was a low table on the far side of the bed, made of the same substance as the chair. A tall blue vase holding a trio of bright red flowers of a kind Lainey had never seen before stood on the table. It was the only splash of color in the room. Where was Micah? She tapped her fingertips on the tabletop, the quiet of the room and the strain of not knowing what was going on making her more nervous by the minute. The last thing she remembered was falling asleep in some sort of examining room. When she\u0027d awakened, she\u0027d been here, in bed. An alien dressed in some sort of dark-green uniform had brought her something to eat an hour or so ago. A short time later, he had returned with her clothes, neatly washed, mended, and folded, in his arms. When she\u0027d asked him of Micah\u0027s whereabouts, he\u0027d merely smiled and shrugged. Dressing quickly, she had tried the door, only to find it locked. Muttering a very unladylike oath, she began to pace again, her imagination running wild. Micah was dead. She was being taken to an alien planet to be studied like a bug under a microscope. She was going to be sold as a love slave to some horrible slimy creature from another world. She shuddered as visions of the loathsome Jabba fromStar Wars filled her mind. She whirled around as the door to her room opened, Micah\u0027s name on her lips. But it wasn\u0027t Micah. Pergith stared at the woman for a moment. She was undoubtedly quite attractive, but Zermicazyne had known beautiful women before. What was there about this earthling that made his best friend willing to sacrifice his career and his home just to be with her? Lainey put her hands behind her back and clasped them tightly together. \"Where\u0027s Micah?\" \"Micah?\" Pergith lifted one brow in amusement. \"Is that what you call him?\" \"Yes. Where is he? Is he all right?\" \"He is well.\" \"Would you... can I see him?\" \"I am afraid that is quite impossible. You will be transporting soon.\" \"Transporting?\" \"We will transport you down to the planet. To Earth.\" Pergith folded his arms across his chest. \"I made... Micah, did you call him?... a promise that I would not erase your memory of this time. In return, I will require your promise that you will tell no one of what has transpired here, or described what you have seen.\" Erase her memory? Fear coiled in the depths of her soul. She remembered Micah telling her that after his people interviewed someone from earth, the entire incident was erased from their minds. \"I promise.\" \"Nevertheless, I would advise you to forget this incident entirely. Get on with your life.\" \"Can\u0027t I please tell him good-bye?\" \"No.\" Pergith stared at the woman, at the moisture welling in her eyes. He had never seen a woman weep. It was most disconcerting. \"It is for your own good,\" he said gently. \"And for his.\" \"Is it?\" \"Yes. Zermicazyne has resigned himself to returning home. It is where he belongs. He has a duty to his people. If he sees you again, it will only make parting more difficult for him. And for you.\" \"But... but I...\" Pergith drew himself up to his full height, steeling himself against the sorrow in her eyes, the overwhelming sadness of her tears. And then, sounding loudly in his mind, he heard Zermicazyne\u0027s voice.Pergith, in the name of our friendship, please let me see her one last time. Please, I\u0027m begging you, let me tell her goodbye . I gave you my answer before, my friend, Pergirth responded.It has not changed . \"I am sorry,\" he said gruffly. He spoke to Lainey, but his apology was for Zermicazyne, as well. \"Jerva will take you down as soon as it gets dark.\" Lainey stared at the door after he was gone. That was it, she thought. She would never see Micah again. She felt suddenly numb, the hurt too deep for tears. She had met a man she never should have met, fallen in love with him, and now it was over. Or was it? Micah? She focused her thoughts and sent them to him.Micah, can you hear me ? Lainey! Are you all right? I\u0027m fine. They\u0027re sending me back to Earth. I know. I love you, Lainey. And I love you. I\u0027ll never forget you. Never. Perhaps it would be best if you did. The heaviness in his voice, the note of despair, tore at her heart.Never ! she vowed.I\u0027ll love you until the day I die . Lainey, Lainey, so many things I want to tell you... I know. Promise you won\u0027t forget me. She heard the soft sound of bittersweet laughter, and then his voice, low and soft.I will not forget you , cominza. Micah... A sound at the door broke her concentration. Whirling around, she saw an alien standing in the doorway. \"It is time,\" he said. She tried to concentrate, tried to reestablish her bond with Micah so she could hear his voice one last time, but the alien was urging her out the door, down a narrow companionway. Her heart felt like lead as she followed him to a small oval room.Micah, I love you ... She stood where the Xanthian told her, felt a sudden sense of disorientation, of being hurled through space, and then, miraculously, she was standing on the hill behind the cabin at Chadds Creek. A faint whirring sound drew her attention and she glanced up in time to see a slender silver craft hovering overhead, and then it was gone, and Micah with it. The tears came then. Buckets of tears. Oceans of tears. Sitting down, Lainey crossed her arms on her bent knees and wept until she had no tears left. Micah glared at Pergith and then slowly raised his shackled hands. \"Are you going to make me wear these until we get home?\" Pergith shrugged. \"Do you think it will be necessary?\" Micah shook his head, the anger draining out of him. Lainey was gone and Pergith had set a course for Xanthia. It was over. \"I will have Jerva remove the restraints immediately,\" Pergith said quietly. Micah nodded, his face impassive. Pergith spread his hands in a gesture of appeal. \"I am truly sorry about the restraints.\" \"So am I.\" Pergith swore under his breath, irritated by his friend\u0027s sullen attitude. Zermicazyne had been a good friend; he would be a formidable enemy. \"I will send Jerva to you,\" Pergith said, and left the room, fearing he had lost his best friend. Micah sat on the edge of his bunk, staring at the floor. He was going home, but he felt as if he was being sent into exile, away from everything he loved. Lainey... He felt a tightness in his chest, a thickness in his throat. Lainey. He remembered the first time he saw her. She had been wearing black pants and a pink sweater, and he had thought her quite the prettiest creature he had ever seen. He closed his eyes and her image rose in his mind, so vividly that he could almost smell the fragrance of her hair, see the love shining in her eyes, hear the sound of her voice. With an effort, he banished her image from his mind. She was no longer a part of his life, he thought bleakly, but she would always be a part of his heart. He stood up as the door to his quarters swung open and Jerva entered the room. Wordlessly, Micah held out his hands and Jerva removed the restraints. \"Commander Pergith requests that you dine with him,\" Jerva said, tucking the restraints into his jacket. \"No.\" \"As you wish, Commander. Shall I have something sent in?\" \"No.\" Jerva stared at him for a moment, then left the room, quietly closing the door behind him. With a sigh, Micah stretched out on his bunk and closed his eyes. She was gone, and his life would never be the same again.","sourceLink":"https://allnovel.net/sunlight-moonlight/page-19.html","bookId":2306,"book":{"id":2306,"title":"Sunlight Moonlight","description":"Storyline: In Sunlight, handsome alien Micah is trapped on Earth after he crash lands and falls in love with beautiful woman, while in Moonlight, the vampire Navarre seeks for a woman brave enough to enter his world.","cover":"https://allnovel.net/images/sunlight-moonlight.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sunlight-moonlight.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:11:43 PM"}}
