{"id":95082,"no":20,"title":"Page 20","content":"\"Lainey! Thank God! Where have you been?\" Dolores St. John wrapped her arms around her daughter and hugged her tight. \"We\u0027ve been so worried.\"\\n\\n \"I\u0027m fine, Mom.\"\\n\\n \"Get her inside,Dee ,\" Ralph St. John said, hovering over the two of them. \"I\u0027ll get some coffee.\"\\n\\n \"Come in and sit down, dear,\" Dolores said. She shepherded Lainey into the living room, settled her on the sofa, and covered her with a blanket.\\n\\n \"Here, sweetie,\" Ralph said, handing Lainey a cup of coffee laced with brandy. \"Drink this.\"\\n\\n Obediently, Lainey took a sip, coughed, and drained the cup.\\n\\n \"Lainey, can you tell us about it now?\"\\n\\n She nodded, then burst into tears. \"Here, now,\" her father said, gathering her into his arms as if she were still his little girl. \"Go ahead, sweetie, cry it all out.\"\\n\\n And she did, releasing all her unhappiness, all her heartache in a flood of tears that scorched her eyes and did almost nothing to ease the pain in her heart. And all the while her father held her and rocked her.\\n\\n When her tears finally subsided, she slid off his lap onto the sofa. \"Sorry, Dad,\" she said, sniffing. \"I didn\u0027t mean to drown you.\"\\n\\n \"Don\u0027t be silly.\" Ralph thrust his handkerchief at her. \"I\u0027m waterproof. You ought to know that by now.\"\\n\\n Lainey smiled in spite of herself, then blew her nose and dabbed at her eyes.\\n\\n For the next half hour, she related what had happened up at the cabin and on the spaceship. Fresh tears welled in her eyes when she reached the end of her story.\\n\\n \"And now he\u0027s gone,\" she said mournfully, \"and I\u0027ll never see him again.\"\\n\\n \"What happened to the bodies?\" Ralph asked.\\n\\n \"The bodies?\" Lainey shuddered, remembering the charred remains. \"I don\u0027t know.\"\\n\\n Delores and Ralph exchanged glances, then Ralph cleared his throat. \"We weren\u0027t going to say anything, Lainey, but maybe you should know. A man came here the same night you and Micah were attacked. He held us at gunpoint for twenty-four hours.\"\\n\\n \"Gunpoint! Who was he?\"\\n\\n Ralph shook his head. \"I don\u0027t know. He wore a ski mask, but I\u0027d guess he had something to do with the two men who followed you to the cabin. I think he came here to wait in case you got away and came home. I don\u0027t know. He got real fidgety when you didn\u0027t show up. He kept looking at the phone, as if he was expecting a call. He even picked up the receiver a couple of times, like he was checking to make sure the phone was working.\" Ralph took a deep breath and let it out in a heavy sigh. \"All I\u0027m saying is, maybe it\u0027s a good thing Micah\u0027s gone.\"\\n\\n Lainey shook her head. \"No...\"\\n\\n \"Lainey, if everything you\u0027ve said is true, think of what would have happened to Micah if the wrong people found out he was here,\" Dolores remarked quietly. \"The press would have had a field day. Scientists would have been poking and probing at him for the rest of his life.\"\\n\\n Lainey thought about the three men who had captured Micah, about the tests they\u0027d performed, and knew that would be nothing compared to what would happen if SETI or some other organization had gotten hold of Micah. Her mother was right and she knew it, but it didn\u0027t lessen the pain.\\n\\n Lainey frowned. The men who had followed them to the cabin had to be the same men who had captured Micah. But how had they known where her parents lived? The realization that her parents might have been hurt or killed hit her for the first time. She stared at her father and saw the knowledge in his eyes.\\n\\n \"I\u0027m sorry, Lainey,\" Ralph said. \"I know how much you cared for him, but I can\u0027t be sorry he\u0027s gone. I\u0027d rather have you grieving than see anything happen to you or your mother.\"\\n\\n Lainey placed her hand on her father\u0027s and gave it a squeeze. \"I know, Dad. Thanks for listening and for believing me.\"\\n\\n Rising, she hugged her father, then her mother. \"I think I\u0027ll go to bed.\"\\n\\n \"Good night, sweetie,\" Dolores said. \"I love you.\"\\n\\n \"I love you, too. Good night, Mom. Dad.\"\\n\\n Heavy-hearted, Lainey climbed the stairs to her room, pulled off her sneakers, jeans, and sweater, and crawled into bed, praying that Micah would travel in safety, thanking God that her parents hadn\u0027t been harmed.\\n\\n She tried to focus on putting her life back together, tried to think of a plot for her next mystery, which was due at the end of the year, but to no avail.\\n\\n Micah was gone from her life, and nothing else mattered.\\n\\n \"Well,\" Delores said after Lainey had gone to bed, \"what do you make of that? Spaceships, indeed!\"\\n\\n \"Lainey\u0027s always had a vivid imagination,\" Ralph said, chuckling. \"Remember that time she thought her closet was haunted? Still...\" He rubbed a hand along his jaw. \"There\u0027s something strange going on here,Dee . I don\u0027t believe for a minute that Micah\u0027s from outer space, but peopleare looking for him. Maybe he\u0027s involved in some sort of mob activity or something. Whatever\u0027s going on,I think we\u0027d better cancel that trip to Palm Springs and stick close to home, just in case.\"\\n\\n He sat in the car across the street from theSt. John house, an unlit cigar clamped between his teeth. Gene and Mac had disappeared. He assumed they were dead, killed by the alien. But it was the fact that the girl had come home alone that concerned him. What did it mean?\\n\\n Turning the key in the ignition, he pulled away from the curb. The girl had come home alone. Did that mean the alien had escaped and headed home, or was he merely lying low?\\n\\n Frowning, he turned down the alley that ran behind his house.\\n\\n The alien was gone, at least for now, but there was always a chance he\u0027d come back for the girl.\\n\\n And Red LeMans would be waiting for him.\\n\\n Dressed in his official Fleet uniform, Micah stood in front of his superiors, his face impassive as the Minister of Flight enumerated the charges that had been filed against him.\\n\\n It was quite a lengthy list. Most of the charges were of little consequence, but his failure to follow standard procedures after the crash, coupled with his admission that he had intentionally put off signaling his sister ship, were charges to be reckoned with. And the fact that he had not only let an earthling see him, but had lived with her and told her about Xanthian ways, only made things worse. And yet it didn\u0027t matter. Nothing mattered. He had answered their questions honestly, not caring what anyone thought, not caring that he was likely ruining what had been an outstanding career. He had told them everything except the most important thing.\\n\\n Pergith had been called to testify. Micah had felt the commander\u0027s sympathetic gaze as Pergith related all that had happened on his ship from the time Micah and the woman had come on board until the time the woman had been returned to Earth.\\n\\n Told in a straightforward manner, fact upon fact, Micah\u0027s behavior sounded irrational, unacceptable. He wasn\u0027t surprised when he was stripped of his flight status and rank for the duration of a solar year. He was also denied the right to leave Xanthia during that period.\\n\\n Pergith was waiting for him in the hallway when Micah left the Minister of Flight\u0027s chambers. Micah would have passed him by, but Pergith grabbed him by the arm.\\n\\n \"I am sorry, Zermicazyne,\" he said. \"I never thought the penalty would be so severe.\"\\n\\n \"Didn\u0027t you?\" Micah stared at his old friend, and Pergith released his hold on Micah\u0027s arm.\\n\\n \"I wish you would join me for a late meal,\" Pergith said.\\n\\n \"No.\"\\n\\n \"We have been friends for many years,\" Pergith remarked quietly. \"What I did, I did because I thought it was best for you. And for the Earth woman.\"\\n\\n \"Her name is Lainey,\" Micah said softly. \"Lainey St. John.\"\\n\\n He stared past Pergith, his heart aching with the knowledge that he would never see her again. He took a deep breath and expelled it in a long, slow sigh. \"Farewell, Pergith.\"\\n\\n \"You will not forgive me for this?\"\\n\\n \"No.\"\\n\\n Pergith inclined his head in a formal gesture. \"Very well. I will not trouble you again.\"\\n\\n Micah watched Pergith walk away. He stood there for a long moment, feeling more alone than he could ever remember, and then he left the building.\\n\\n Adanawas waiting for him outside. He had forgotten how lovely she was. Her hair, so blond it was almost white, fell to her waist in a mass of soft waves. Her eyes were as blue as earth\u0027s sky, her skin a smooth golden brown.\\n\\n \"Zermicazyne,\" she said, slipping her arm through his in an uncharacteristic display of affection. \"I have missed you.\"\\n\\n Micah nodded, wishing he could say he had missed her, too, and that it was good to be home. But it would only be a lie, and so he remained silent.\\n\\n \"What happened in there?\"Adana asked in gentle concern.\\n\\n \"I was stripped of my rank and my flight status and admonished not to leave Xanthia.\"\\n\\n \"I am sorry. I know how much flying means to you.\" She squeezed his arm. \"But perhaps some good will come of it.\"\\n\\n \"What do you mean?\"\\n\\n A faint blush tinged her cheeks. \"You were scheduled for an exploratory flight to Delton Seven when you returned from your last mission, but now that you\u0027ve been... now that you will not be leaving, we can expedite the date of our joining.\"\\n\\n Her softly spoken words hit him like an iron fist. He had given his word, his pledge, to join withAdana . Speechless, he stared into the depths of her eyes and wondered how he could possibly fulfill his commitment now.\\n\\n He remembered Lainey\u0027s words, spoken in hurt and fear:Go home and join withAdana . She\u0027ll probably give you a hundred sons . He thought of the nights spent in Lainey\u0027s arms, the attraction that had flowed between them, the way his heart had swelled with love whenever she was near.\\n\\n In Lainey\u0027s arms, he had learned the true meaning of love, of caring and sharing. How could he join withAdana , plant his seed within her womb, knowing their progeny would be raised by others? If he was to have offspring, he wanted them to be nurtured by Lainey. Lainey who so badly wanted a child and could never have one.\\n\\n Lainey... The thought of never seeing her again slashed through his heart like a laser blast.\\n\\n Adanawas looking up at him, her expression worried. \"Is something wrong, Zermicazyne? I\u0027m sorry if I spoke out of turn. Perhaps now isn\u0027t the time to discuss intimate matters.\"\\n\\n She was smiling at him, the look in her eyes asking for his forgiveness.\\n\\n \"I am sorry,Adana ,\" he said. \"I... I have a lot on my mind right now.\"\\n\\n \"Of course.\" She gave his arm an understanding squeeze. \"We can talk about it later.\"\\n\\n \"Yes,\" he said in a strangled voice. \"Later.\"\\n\\n Micah watchedAdana walk away. Joining wasn\u0027t quite as casual as he had made it sound when he spoke of it to Lainey. There were gifts to be exchanged, blessings to be obtained from theHighChurch , medical examinations to ensure that they were both in good health, mentally and physically.\\n\\n Each requirement suddenly seemed like an obstacle that couldn\u0027t be overcome. The thought of buyingAdana a gift reminded him of the bracelet he had bought for Lainey; obtaining a blessing from the church reminded him that he had asked Lainey to marry him - to be his woman, not just until a child was conceived, but forever.\\n\\n Joining with Adana, which he had once viewed as no more than an obligation to be fulfilled and forgotten, now filled him with dread. And yet, how could he refuse? It was expected of him, just as total allegiance to Xanthia was expected of him.\\n\\n He walked out of the city, needing to be alone. A narrow path ran alongside the river that supplied the city with water.\\n\\n Stripping off his uniform shirt and boots, Micah cleared his mind and began to run, losing himself in the sheer physical act of running.\\n\\n His pace quickened as the miles went by. His legs ached, his side felt as if it were on fire; perspiration dripped from his body, and still he ran. But no matter how fast he ran, how far he went, he couldn\u0027t outrun Lainey\u0027s memory, couldn\u0027t run away from the fact that he\u0027d been grounded for a solar year; couldn\u0027t run away from the knowledge that, sooner or later, he would have to fulfill his obligation and join with Adana.\\n\\n He ran until his legs refused to obey, until the pain in his side forced him to stop. Dropping to the ground, he threw back his head and loosed all his pain and frustration in a long anguished cry.\\n\\n He sat there for a long time, reviewing his past, his life on Xanthia, the numerous flight honors and commendations he had accumulated in the last fifteen years. He thought of how little he had to live for on Xanthia, and how much waited for him on Earth.\\n\\n Sitting there, gazing at the city that glowed beneath a pale pink sky, he bade a silent farewell to his old life. If all went well, he would soon be with Lainey. If he failed...\\n\\n A wry smile lifted a corner of his mouth. If he failed, all his problems would be over.\\n\\n Permanently.\\n\\n Lainey glanced over her shoulder, unable to shake the feeling that she was being watched, but there was no one there.\\n\\n Another bizarre manifestation of being pregnant, no doubt. Pregnant! Numerous doctors had assured her that it was impossible, that she would never conceive, and yet here she was, five months pregnant, and the father was thousands, millions, of miles away, totally unaware that he was going to have a child.\\n\\n When she had asked the doctor how such a thing was possible when she had been told time and again that she was barren, he had only shrugged and smiled, somewhat sheepishly.We are not infallible , he had replied.Couples who have been told pregnancy is impossible often conceive once they stop trying so hard, or they adopt a child .\\n\\n Unlocking the door, she went into the kitchen and put the groceries away, then went into the living room and sank down on the sofa, her hands resting on the swell of her stomach.\\n\\n Pregnant. She had never contemplated the discomforts of being pregnant when she had dreamed of having a baby; she had thought only of the joy of having a child.\\n\\n That joy was hard to recall now. She had been nauseated the first three months. Her ankles were swollen. Her breasts were tender. She cried at the least provocation.\\n\\n She managed to keep busy during the day, but at night she was haunted by memories of Micah, of dreams filled with bizarre landscapes, of nightmare images of deformed babies with blue skin and webbed hands and feet.\\n\\n She was carrying an alien baby.\\n\\n Her emotions were out of control, soaring to heights of great joy and plunging into the depths of despair. If not for the support of her parents, she was certain she\u0027d have lost her mind. Her mother came by every day to make sure she was all right; her father called from work, and stopped by on his way home.\\n\\n They brought her silly gifts to make her smile, and a crib for the baby. Her parents painted the spare bedroom a soft shade of yellow. Her father bought a baseball glove; her mother bought a doll. They drove her to the doctor, took her out to dinner, to the movies.\\n\\n She loved them all the more for their patience and concern, but late at night, after her parents had gone home, she was alone with her fears, and with the ever-increasing certainty that someone was following her. \\n\\n","sourceLink":"https://allnovel.net/sunlight-moonlight/page-20.html","bookId":2306,"book":{"id":2306,"title":"Sunlight Moonlight","description":"Storyline: In Sunlight, handsome alien Micah is trapped on Earth after he crash lands and falls in love with beautiful woman, while in Moonlight, the vampire Navarre seeks for a woman brave enough to enter his world.\\n","cover":"https://allnovel.net/images/sunlight-moonlight.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sunlight-moonlight.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:11:43 PM"}}
