{"id":95084,"no":22,"title":"Page 22","content":"Lainey called her parents the next morning to let them know Micah had returned from Xanthia. Thirty minutes later, Ralph and Dolores arrived at the house. Earlier that morning, Micah had assumed the form Lainey\u0027s parents would be expecting. Now, sitting in the kitchen across the table from Ralph and Dolores St. John, he knew they were trying not to stare, but he was acutely aware of their furtive glances as they looked for some tangible evidence that he was, indeed, from another world. It was unsettling, to say the least, and after ten minutes or so, he\u0027d had enough. \"I guess Lainey told you where I\u0027m from,\" he remarked quietly. \"She might have mentioned it,\" Dolores said. She picked up a napkin, folding and unfolding it in her lap. \"But you don\u0027t believe it?\" \"Well, it did seem a little far-fetched, but she was upset. We knew she\u0027d been in some kind of trouble, and she\u0027s always been given to rather bizarre flights of fancy... You don\u0027t look - I mean...\" \"You\u0027re babbling,Dee ,\" Ralph said. Lainey crossed the kitchen to stand beside Micah, her hand resting on his shoulder. \"Maybe you should let them see how you really look?\" \"Oh, dear,\" Dolores murmured. The napkin fell unnoticed to the floor as she pressed a hand to her heart. \"He\u0027s not green or anything, is he?\" \"Blue, actually,\" Lainey said, grinning. \"Lainey, this is no time for levity. It\u0027s natural for your mother to be a little... upset.\" \"I\u0027m not making a joke, Dad. Show her, Micah.\" Feeling like some sort of aberration on public display, Micah took on his own form. He held up one hand so they could see the webbing between his thumb and forefinger, and then he pulled back his hair so they could see his ears. The inner tension he felt caused the blue glow that emanated from his skin to shimmer darker than usual. He tried to keep his face impassive as he endured theSt. Johns \u0027 reactions. Dolores stared at him, her face suddenly pale, her mouth agape, her deep blue eyes registering shock. Ralph swore under his breath. It was a crude oath, one that, under normal circumstances, he never would have repeated in front of his wife and daughter. And Lainey laughed. \"I told you he was blue,\u0027\u0027 she said. Bending down, she kissed Micah on the cheek. \"I\u0027m hungry. How about the rest of you?\" \"Forget breakfast,\" Dolores muttered under her breath. \"I could use a drink.\" She folded her hands in her lap and offered Micah a tentative smile, obviously relieved that he didn\u0027t have two heads in addition to everything else. \"Except for your hands and your ears, you don\u0027t look much different from most folks I know.\" Ralph snorted. \"He looks a damn sight better than a lot of people I know.\" \"Of course, your skin is an unusual color,\u0027\u0027 Dolores said, trying not to stare at him. \"And your eyes are a little strange, slanted the way they are. And that blue glow is a trifle disconcerting, but...\" Ralph laid his hand on his wife\u0027s shoulder. \"Let it go,Dee .\" \"I think he\u0027s beautiful,\" Lainey interjected smoothly. \"French toast okay for everybody?\" Lainey stood beside Micah, his arm draped around her shoulders, as they waved good-bye to her mom and dad. During her parents\u0027 visit, Lainey had pointedly refrained from mentioning the baby, but she knew her folks were having the same doubts she was, even if no one spoke them aloud. Her parents had taken the news of the wedding in stride, but then, what was the point in objecting? Lainey was old enough to make her own decisions, and there was a baby on the way. Lainey had talked it over earlier with Micah, and before her parents left for home, she had suggested they all drive to Vegas the following weekend. \"If that\u0027s what you want, sweeting,\" her father had said, giving her a hug. \"Well, that was a unique experience,\" Lainey declared as they went back into the house and closed the door. \"An experience,\" Micah muttered. \"Is that what you call it?\" Lainey slipped her arms around his waist and gave him a squeeze. \"I know it wasn\u0027t easy for you, but it had to be done sometime.\" \"I\u0027m not sure it was a good idea, telling them about me.\" \"Why not?\" Micah sat down on the sofa and drew Lainey down beside him. \"I just don\u0027t think it\u0027s wise to tell anyone where I\u0027m from.\" \"I had to tell my folks,\" Lainey said. \"I mean, I didn\u0027t think I\u0027d ever see you again, and someone had to know, in case something went wrong while I was in labor.\" Micah nodded. What she said made sense. \"Have you told anyone else?\" \"No. Who would believe me?\" \"It\u0027s obvious your parents didn\u0027t.\" Lainey grinned. \"Well, I thought they believed me when I told them that night you left, but now that I think about it, I guess they were just humoring me.\" She laughed as she remembered her parents\u0027 reaction to Micah\u0027s transformation. \"Did you see the look on my Mom\u0027s face? I guess seeing really is believing, but don\u0027t worry, they won\u0027t tell anyone.\" \"I\u0027m not worried.\" Lainey bit down on her lip. \"Micah, I\u0027ve decided to have the baby at home.\" He didn\u0027t have to ask why. Hospitals asked questions, took blood tests. \"I\u0027m sorry, Lainey,\" he said quietly. \"I\u0027ve made a mess of your life, haven\u0027t I?\" \"No!\" She took his hand in hers and held it tight. \"Don\u0027t even think that. If it wasn\u0027t for you, I wouldn\u0027t be having this baby at all.\" She looked up at him, her eyes bright with love and acceptance. \"You gave me something no one else could, something I\u0027ve wanted all my life. Something that was impossible, until I met you.\" \"Maybe we shouldn\u0027t get married until after the baby is born.\" Lainey shook her head, knowing he was offering her a way out in case she changed her mind, in case the baby died and she decided life with an alien was more than she could bear. \"I don\u0027t want to wait, Micah. No matter what happens, I don\u0027t want this child, born of our love, to be a bastard.\" Gently, he drew her into the circle of his arms and rested his chin on the top of her head. Would she still look at him with that same depth of love and devotion if the baby was born horribly deformed or dead? Or would she look at him with hatred and revulsion, recoiling from his touch? Would she then be sorry she had agreed to be his wife? \"I love you, Lainey,\" he murmured fervently. \"Love you, love you.\" And love her he would, he thought. No matter what happened in the future, he knew he would love Lainey St. John as long as he had life and breath in his body. \"You\u0027re awfully quiet,\" Ralph St. John mused as he slid into the flow of traffic on the freeway. \"I\u0027m not quiet,\" Dolores replied. \"I\u0027m stunned.\" \"Yeah, it\u0027s a little hard to swallow all right, but, hell, you can\u0027t doubt the truth of your own eyes.\" \"He\u0027s analien , Ralph. From outer space. And he\u0027s going to marry our daughter. Our only child.\" Ralph glanced at his wife, a wry grin on his face. \"Honey, they\u0027ve already done everything but say the words.\" \"I know, but...\" Dolores toyed with the folds of her skirt. \"Ralph, she\u0027s pregnant. I\u0027ve never been in favor of abortion, you know that, but don\u0027t you think we should have discussed it with her? I mean, there\u0027s no telling what the baby will look like...\" \"I know. I thought of it, too. But,Dee , she looks so damn happy, I just couldn\u0027t say anything to ruin it. Besides, she\u0027s too far along for an abortion, and even if she wanted one, she couldn\u0027t very well waltz into her doctor\u0027s office and tell him she\u0027s carrying an alien baby.\" \"Ralph, be serious. What if... what if it\u0027s dangerous for Lainey? What if...\" She couldn\u0027t say the words aloud. Ralph reached over and took her hand in his. \"She\u0027ll be fine, hon, I\u0027m sure of it. She\u0027s a strong, healthy girl.\" \"I know, but... but we don\u0027t know what effect having this alien\u0027s child could have. What if it\u0027s...\" She took a deep breath. \"Fatal?\" \"Don\u0027t even think that!\" \"I can\u0027t help it, Ralph. I\u0027m afraid.\" \"I know.\" He squeezed her hand. \"I am, too. But you want to hear something funny? Of all the guys she\u0027s dated, he\u0027s the first one I\u0027ve ever liked, and that includes that loser she married.\" \"You want to know something?\"Dee asked, grinning at him. \"I feel the same way. I just wish...\" They looked at each other and smiled. \"... he wasn\u0027t blue,\" they said simultaneously. \"She\u0027s happy.\" Ralph said, pulling off the freeway, \"really happy for the first time in her life.\" \"I know.\"Dee wiped a tear from her eye. \"Imagine, an alien for a son-in-law, and I can\u0027t even tell the girls at the beauty parlor.\" Micah couldn\u0027t sleep that night. Lying in bed, he stared into the darkness. He could feel Lainey curled up close beside him, her body warm and soft against his. Gently, he placed his hand on her belly and felt a little thrill of exhilaration as his child stirred beneath his hand. A child. Before knowing Lainey, he had never given any thought to having offspring beyond the physical act of joining; would never have agreed to join withAdana on Xanthia if joining had not been required of all healthy males. But now... A surge of love, of protectiveness such as he\u0027d never known, swelled within his heart as he felt the child kick again. His child, a child born of his love for Lainey. A child he would be able to touch, to hold in his arms. He would watch it grow, watch it learn to walk, to talk. He would be there to soothe its hurts, quiet its fears, share in its laughter, its accomplishments. He remembered sitting in the restaurant with Lainey, watching a woman bounce a baby on her lap while a man looked on, smiling with pride. A family. A wave of excitement swept through Micah as he realized that he was about to have a family of his own, and that it would encompass not only Lainey and the baby, but Lainey\u0027s parents, as well. Beside him, he felt Lainey stir. He knew the moment she came awake. \"Is something wrong?\" he asked. \"No. The baby\u0027s kicking a lot, that\u0027s all. It woke me up.\" Micah drew her into his arms, massaging her back with one hand. \"I love you, Lainey,\" he murmured. \"I don\u0027t think I realized how much until now.\" \"I love you, too.\" \"I know.\" His throat felt thick; tears burned his eyes. \"I know.\" In all his life, no one had ever loved him. He\u0027d had friends on Xanthia, people who had admired him, friends who had respected him, but no one had ever loved him. Lainey brushed her hand across Micah\u0027s cheek. She drew back, startled at the dampness she felt there. \"Are you crying?\" He squirmed uncomfortably, then nodded, afraid to speak for fear he would completely lose control. \"It\u0027s all right,\" Lainey whispered. \"I won\u0027t think less of you if you cry.\" \"I will.\" \"Why?\" \"It isn\u0027t... men don\u0027t...\" Lainey shook her head. Men! They seemed to be the same no matter what their planet of origin. \"Cry if you feel the need,\" she urged softly. \"You\u0027ll feel better for it, I promise.\" Heaven knew he had enough to cry about, Lainey thought as she wrapped her arms around him. He\u0027d left his home, left everything he knew, to be with her. She tried to imagine what it would be like to leave her home and her job and settle on an alien planet where she could only be herself in Micah\u0027s company, where she would have to spend the rest of her life in disguise so no one would know who she really was. It was beyond comprehension, and yet Micah was doing it, for her. She was comforting him now, her hands stroking his back, caressing his cheek. Her kindness, her sweetness, was his undoing. Silent sobs rose in his throat; silent tears coursed down his cheeks, and he was helpless to stop them. He wept because, even though he didn\u0027t want to, he could never go home again. He wept because his heart was so full of love for Lainey and their unborn child that it was almost painful. He wept because he was happy for the first time in his life, because Lainey loved him unconditionally. He wept because he knew that happiness, like life itself, was fragile and easily destroyed. \"Lainey...\" He clutched her to him, ashamed of his tears, and yet he did feel better for having shed them. \"Forgive me.\" \"There\u0027s nothing to forgive.\" Lifting a corner of the sheet, she wiped the last of the tears from his face, then kissed him lightly on both cheeks. \"Better?\" Micah sat up, drawing Lainey up beside him. \"Better.\" \"You know what?\" Micah smiled down at her. \"You\u0027re hungry.\" Lainey nodded. \"I\u0027ll go get you something.\" \"No, I\u0027ll go.\" She patted her stomach. \"I have to go to the pregnant ladies\u0027 room anyway.\" Sliding out of bed, she pulled on a robe and left the room. A noise outside drew Micah\u0027s attention and he shook his head. It sounded like the neighbor\u0027s cat was in the trash again. A few minutes later, he heard what sounded like a pan falling to the floor. He thought of going into the kitchen and offering to help, but he needed a few moments alone to regain his composure. Propping another pillow behind his head, he stared up at the ceiling. He had cried in Lainey\u0027s arms. Cried like a frightened child, yet she didn\u0027t seem to think less of him for it. In all his years on Xanthia, he had never seen a grown man cry. Never seen a woman cry, unless she was in extreme physical pain. With a sigh, he dragged a hand across his jaw. He had a lot to learn about life on Earth, he thought with a wry grin, but he wouldn\u0027t be alone. Because of Lainey, he would never be alone again. Lainey... where was she? Throwing the covers aside, he got out of bed and went into the kitchen. The lights were on, steam was rising from the tea kettle, there were eggs scrambled in a bowl on the sink. He picked a frying pan up from the floor. \"Lainey?\" Frowning, he went into the bathroom, but she wasn\u0027t there, either. Alarmed now, he walked through the house, checking the guest room, her office, switching on the lights as he went. She was nowhere to be found. Lastly, he checked the garage, but her car was still there. Returning to the kitchen, he glanced around the room again, looking for a clue of some kind. It was then he noticed that the back door was slightly ajar, and that the lock had been forced open. The noise he had heard outside earlier suddenly took on ominous overtones. Swearing a pithy curse word he had heard on television, he ran back into the bedroom. Dressing quickly, he went outside, his gaze sweeping up and down the sidewalk, his mind screaming Lainey\u0027s name. Silence was his only answer. Red Hair. With grim certainty, he knew that Red Hair had abducted Lainey. Quivering with rage, he stared down the dark street, remembering a cold metal table and thick iron straps. Lainey! Micah\u0027s hands curled into tight fists as he tried to remember where Red Hair had taken him. But he had been unconscious on the ride to the laboratory, and barely coherent when Lainey had rescued him. He had no clear idea of how near, or how far away, the laboratory might be or where it was located, only a cold certainty that Lainey was there, and that her life was in danger. Ralph St. John flipped on the porch light, then stared through the peephole. \"Micah!\" he exclaimed, opening the door. \"What are you doing here at this hour of the morning? Is something wrong? Where\u0027s Lainey?\" \"She\u0027s gone.\" \"Gone!\" Ralph stepped back so Micah could enter the house. \"Gone where? What happened, did you two have a lovers\u0027 quarrel?\" \"No.\" Micah dragged a hand through his hair. \"She\u0027s been taken.\" \"What is it?\" Dolores called from the bedroom. \"Nothing,Dee ,\" Ralph said. \"Go back to sleep. Sit down, Micah, I\u0027ll get some coffee.\" Micah followed Ralph into the kitchen, too agitated to sit still. \"I know who has her,\" he said. \"It\u0027s the same man who captured me.\" Ralph swore under his breath as he filled two cups with instant coffee, added hot water, and handed one to Micah. \"Do you know where he\u0027s taken her?\" \"No. I mean yes, but I don\u0027t know where it is, how to get there.\" \"What\u0027s going on?\" Dolores stood in the kitchen doorway, wrapped in a fluffy pink robe. \"Where\u0027s Lainey? Is it the baby?\" \"Sit down,Dee ,\" Ralph said. \"Something\u0027s happened.\" \"We\u0027ve got to call the police,\" Dolores said after Micah explained what had happened. \"And tell them what?\" \"That Lainey\u0027s missing, of course.\" \"You have to wait twenty-four hours to file a missing person\u0027s report,\" Ralph replied. \"Micah, do you remember anything about the place they took you?\u0027\u0027 \"No.\" He stared into the dark liquid in his cup for a long moment. \"The building was old. Dark wood. It was at the end of a long, narrow driveway.\" \"Were there houses on the street?\" Micah frowned, then shook his head. \"I don\u0027t remember.\" He stared at Lainey\u0027s father through eyes dark with anguish. \"I don\u0027t remember.\" \"We\u0027ll find her.\" Ralph St. John laid his hand on Micah\u0027s arm, thinking he had never seen such anguish in a man\u0027s eyes in all his life. If he\u0027d had any doubts about the depths of Micah\u0027s love for Lainey, they were gone now. \"Ralph, what are we going to do?\" \"There\u0027s nothing to be done tonight,Dee . Why don\u0027t you make up the bed in the spare room for Micah? Tomorrow we\u0027ll go to the police.\" Micah shook his head. \"I\u0027m going back to Lainey\u0027s house.\" \"You\u0027re welcome here,\" Dolores said. \"Please stay.\" \"No. I want to be there, in case...\" \"That might be a good idea,\" Ralph agreed. \"Someone should be there in case she comes home. Or in case they call...\" He wrapped his arm around Dolores. \"Maybe she\u0027s fine and we\u0027re worrying for nothing.\" Micah and Dolores exchanged glances, then looked at Ralph. \"I was just trying to look on the bright side,\" Ralph said. He looked at Micah. \"You\u0027ll call us if you hear anything?\"","sourceLink":"https://allnovel.net/sunlight-moonlight/page-22.html","bookId":2306,"book":{"id":2306,"title":"Sunlight Moonlight","description":"Storyline: In Sunlight, handsome alien Micah is trapped on Earth after he crash lands and falls in love with beautiful woman, while in Moonlight, the vampire Navarre seeks for a woman brave enough to enter his world.","cover":"https://allnovel.net/images/sunlight-moonlight.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sunlight-moonlight.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:11:43 PM"}}
