{"id":95106,"no":44,"title":"Page 44","content":"In the morning, she woke with a smile on her face, a sense of well-being flooding her soul.\n \"Navarre.Navarre .Navarre !\"\n She giggled out loud. Never in all her life had she felt like this. No schoolgirl crush had ever had her dancing around the house, laughing for no reason at all while she got dressed.\n She was too excited to eat, so she settled for a quick cup of coffee, brushed her teeth, and went to work two hours early to stock the shelves.\n She sang in the car, she sang while she opened cartons and placed the new romance novels on display on the rack in the front of the store. There was a definite trend toward paranormal romances these days, she mused as she read the titles. Ordinary heroes had been replaced by ghosts and werewolves, aliens and vampires...\n She shook her head, and then frowned.\n Vampires.\n Navarre had cast no reflection in her mirror.\n With a shake of her head, she put the thought from her.\n A moment later, she was driving toward Cliff House.\n She sat in the car, her fingers curled over the steering wheel, staring at the old house. She\u0027d never realized how spooky the old place really was.\n Resolutely, she stepped out of the car, telling herself there was nothing to be afraid of. She didn\u0027t believe in vampires. And even if such loathsome creatures did exist, everyone knew they slept in their coffins during the day.\n Clutching her car keys, she climbed the stairs and knocked on the door.\n Her heart jumped into her throat when the door opened and Navarre stood there, looking dark and dangerous in a pair of tight black jeans and a black sweatshirt.\n \"Adrianna!\" Navarre exclaimed, and then smiled. \"What are you doing here?\"\n She stared up at him, wondering what she could say.\n Navarre frowned. \"Is something wrong?\"\n \"No. No, I... I just wanted to see you.\"\n \"Come in.\"\n She hesitated, her gaze darting past him, sweeping over the interior of the house.\n \"Adrianna?\"\n She murmured a quick thank-you and stepped inside, wondering if she\u0027d just made what could be a fatal mistake. But that was silly. There was no such thing as vampires. She was simply letting her imagination get the best of her.That\u0027s what comes of reading too many paranormal romances , she mused.You start to see monsters in the closet .\n She shivered as she felt his arms around her. Were his hands unusually cold, or was it just that her skin was suddenly so warm?\n \"I\u0027m glad you came,\" Navarre said, his lips brushing the top of her head. \"Would you care for a cup of coffee?\"\n \"Yes, thank you.\"\n Relief seeped through her. Everyone knew that vampires couldn\u0027t consume normal food.\n \"It\u0027s instant,\" he said. \"I hope you don\u0027t mind?\"\n \"No, that\u0027s fine.\"\n She followed him down the hallway into the kitchen. Glancing into each room they passed, she noticed that all the drapes were drawn against the morning sun.\n She sat at the table while he filled a teapot with water and set it on the stove to heat.\n \"It\u0027s dark in here,\" she remarked. \"Why don\u0027t you open the curtains?\"\n \"Bad for the furniture.\" Navarre shrugged. \"I can\u0027t afford to have the fabric on some of those old pieces fade any more than it already has.\"\n Adrianna grunted softly. Of course! Why hadn\u0027t she thought of that herself? Her grandmother had always kept her house dark, claiming the sunlight would fade the carpet.\n She felt a flutter of excitement in the pit of her stomach as she watched him move around the kitchen, taking a cup from the shelf, adding a spoonful of instant coffee, filling the cup with water.\n \"Do you take cream or sugar?\" he asked.\n \"Both, please.\"\n It was only when he placed the cup before her that she realized he wasn\u0027t having any.\n \"I don\u0027t care for coffee,\" he said in answer to her unspoken question. \"I only keep it on hand for company.\"\n \"Oh.\"\n \"Are you taking the day off?\"\n \"No.\" She glanced at her watch. \"I\u0027ll have to go soon. The store opens at ten.\"\n His gaze moved over her face in a soft caress. \"Would you care to go for a walk along the beach?\"\n His question put the last of her doubts to rest. \"That sounds wonderful.\"\n He smiled as he slipped on a pair of dark glasses, then took her hand in his. \"Ready?\"\n The next hour was magical. Adrianna kicked off her shoes and they walked hand in hand along the beach, watching the sun dance on the water, listening to the quiet whisper of the waves against the shore, watching the gulls wheel and soar against the cloudless sky.\n Sitting in the shade of the cliff, she told him of how she\u0027d bought the bookstore, and how one of these days she was going to have to sit down and go through all the old boxes that she\u0027d found in the attic of the building.\n \"The previous owner was a gypsy woman. I don\u0027t think she ever threw anything away.\" Adrianna laughed softly. \"My great-grandmother didn\u0027t either. I inherited a huge old trunk when she passed away. I started to go through it a couple of times, but it made me sad, somehow, going through her things, so I just locked it up and put it away.\"\n \"The loss of a loved one is never easy,\" he remarked, \"but time is a great healer.\"\n \"You sound as though you\u0027re speaking from experience.\"\n \"Yes.\"\n He glanced out at the ocean, and Adrianna knew intuitively that he was thinking of another woman in another place.\n \"Would you care to talk about it?\" she asked.\n His gaze moved back to her face, and he shook his head. \"No. It was a long time ago.\"\n \"I\u0027ve been doing all the talking,\" Adrianna said, forcing a note of cheerfulness into her voice. \"Tell me about you. Where did you live before you came to Moreno Bay?\"\n \"Many places.\"\n \"Really? Like where? I\u0027ve never lived anywhere but here.\"\n Navarre blew out a deep breath. \"Europe, mostly.\"\n \"Have you been to Paris? And Italy? Oh, I\u0027d love to go to Italy. Is it wonderful?\"\n \"I suppose so.\"\n \"You suppose so! Tell me what Europe is like. Did you see the Eiffel Tower and the Tower of London? Did you go to Venice?\"\n Navarre nodded.\n Adrianna sighed. \"I guess I\u0027ll never get there.\"\n \"Anything is possible,\" Navarre remarked. He glanced up at the sun, still amazed, and inordinately pleased, that he could endure the weak winter sunlight for short periods of time. He could feel the heat penetrating the heavy sweatshirt and pants he wore, making his skin tingle. Soon, he would have to go inside, but not yet. He wanted to spend a few more minutes sitting on the beach with Adrianna, pretending he was no different than any other man she knew.\n \"Do you have family here?\" she asked.\n \"No. Do you?\"\n Adrianna nodded. \"Well, not reallyhere . My dad\u0027s company transferred him to California during my senior year.\"\n \"Why didn\u0027t you go with them?\"\n \"I wanted to graduate with my friends. My great-grandma said I could stay with her, and my mom thought it was a good idea, since Grams was so old. It\u0027s her house I\u0027m living in. She left it to me in her will, along with enough money to buy the bookstore.\"\n \"Do you have brothers or sisters?\"\n \"Oh, yeah. I\u0027ve got two brothers. Todd is fifteen, and Troy is sixteen. They came to stay with me last summer. At least, they said it was to see me. I suspect they just wanted to check out the girls in town and see if they\u0027d missed anything while they were gone. I suppose next year I\u0027ll go there.\"\n \"Of course,\" he said quietly, though he disliked the thought of her leaving town, even for a day. \"Family is important. You should stay close to them.\"\n She looked at Navarre, wondering if she was imagining the longing, the loneliness, she saw in his eyes.\n Navarre glanced up at the sun again, his eyes narrowing against the brightness that burned his eyes in spite of the dark glasses.\n Rising to his feet, he pulled Adrianna up beside him. \"As much as I\u0027ve enjoyed this, I have to go.\"\n \"Of course. I didn\u0027t mean to take up so much of your time.\" She pulled her hand from his. \"I really should be getting to work.\"\n \"Annie, don\u0027t.\" He drew her into his arms and kissed her cheek. Her skin was as smooth and warm as a sun-kissed peach. \"I\u0027d rather be here, with you, than anywhere else.\"\n \"Navarre...\"\n \"I wish I didn\u0027t have to go.\" With a low groan, he pulled her into his arms and kissed her, ignoring the heat of the sun that burned through his clothing and seared his flesh.\n Breathless, Adrianna gazed up at him. \"I don\u0027t have to go to work,\" she murmured.\n \"But I do.\" He kissed her again, deeply, passionately. \"Annie, I\u0027m sorry, but I have to go. I\u0027ll see you tonight,\" he said and then, after one last kiss, he ran down the beach to the path that led up to Cliff House.\n Adrianna frowned as she watched Navarre run effortlessly up the steep slope until he was out of sight. He was in a hurry, all right, there was no doubt of that.\n Picking up her shoes, she made her way up the path, hoping, as she did so, that Navarre had left the kitchen door open so she could get her keys, which she\u0027d left on the table.\n The door was unlocked, the house quiet, when she stepped into the kitchen. \"Navarre?\"\n She picked up her keys and walked through the rooms downstairs. There was something about Cliff House that made her walk softly, that made her feel that she wasn\u0027t alone even though it seemed apparent that the house was empty. And yet, strange as it seemed, she couldn\u0027t help feeling that Navarre was nearby. She felt his presence all around her.\n She glanced up the stairway, and then, after a moment\u0027s hesitation, she climbed the stairs to the second floor, wandering slowly from room to room. A narrow set of stairs led to what she assumed was the attic. A narrow chain stretched from one side of the bannister to the other. A neatly lettered wooden sign, with the words private, keep out, hung from the center of the chain.\n Adrianna felt her pulse quicken as she stepped over the chain. On tiptoe, she climbed the stairs, which led to a solid oak door.\n She stood there for several moments, her hand hovering over the doorknob, her heart pounding in her ears, and then, overcome by a sudden irrational fear, she turned and ran down the stairs and out of the house.\n Lying in his bed, hovering in the shadow world between awareness and oblivion, Navarre listened to Adrianna\u0027s footsteps as she moved from room to room, as she climbed the stairs to the attic. He could hear the frantic beating of her heart as she stood outside the door, then the quick tattoo of her footsteps as she ran out of the house, suddenly afraid without knowing why.\n But he knew why. A primal instinct buried deep in her subconscious had recognized the danger that lurked beyond the door.\n He took a deep breath when he heard her drive away. He grimaced against the pain that stalked his body, caused by his exposure to the sun. But the pain was of no consequence when compared to the pleasure of walking along the beach with Adrianna, of seeing her face in the full light of day, of watching the sunlight dance in the wealth of her hair.\n Closing his eyes, he waited for the darkness to descend, waited for the blackness that would carry him into oblivion; the blessed darkness that would heal him while his body took its unholy rest; the cursed darkness that kept him from sharing the daylight hours with the woman he loved.\n He groaned softly, the pain in his heart rivaling the pain in his flesh. He had no right to love her, no right to let her love him.\n And as the blackness washed over him, he knew he would have to let her go. \n","sourceLink":"https://allnovel.net/sunlight-moonlight/page-44.html","bookId":2306,"book":{"id":2306,"title":"Sunlight Moonlight","description":"Storyline: \n In Sunlight, handsome alien Micah is trapped on Earth after he crash lands and falls in love with beautiful woman, while in Moonlight, the vampire Navarre seeks for a woman brave enough to enter his world.\n \n","cover":"https://allnovel.net/images/sunlight-moonlight.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sunlight-moonlight.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:11:43 PM"}}
