{"id":95069,"no":7,"title":"Page 7","content":"He missed her. Missed her more every day. It was a new emotion for him, one he definitely didn\u0027t like. Never in all his life had he let himself get emotionally involved with another being. He was a navigator, the best one in the fleet, and he\u0027d never had time for anything else. He had sworn his allegiance to the fleet, had taken a blood oath that he would give his life to protect the welfare and interests of Xanthia.\\n\\n Crossing the floor to the window, he stared up at the night sky. How different life was at home. Males and females rarely intermingled for any length of time except to mate. Children were raised in a controlled environment by people who had been carefully selected for that assignment.\\n\\n Home. For the first time he realized that, while he missed flying, missed the thrill of exploring the unknown, he didn\u0027t actually miss Xanthia. Beautiful as it was, peaceful as it was, as much as he loved it, he had no desire to go back.\\n\\n And Lainey was the reason. She was as warm as the earth\u0027s sun, and as far away as the stars that lit the night sky. Much as he might wish to stay here, with her, it was not an option. His life\u0027s course had been set years ago. When he returned home, he would join withAdana , the female who had been chosen for him, ensuring the continuation of his line, ensuring that all he was, all he knew, would be passed to the next generation. There would be no fire between them as there had been between himself and Lainey. Breeding was not done for pleasure. Once his chosen mate had conceived, it was unlikely that he would ever see her again.\\n\\n He had never questioned the way his people lived until now. Until Lainey. He wondered, for one brief moment, what it would be like to stay here, in her world, to be her mate for life, to watch whatever children he might father grow up. It was an idea totally foreign to everything he knew and yet he yearned to embrace her way of life almost as much as he yearned to embrace Lainey herself.\\n\\n A frustrated sigh whispered past his lips. It was a waste of time even to consider such a thing. Even if he couldn\u0027t repair the transmitter, there was a good chance Pergith or one of the others would locate him sooner or later. They would search for him until they found him, or until they were certain he had died in the crash.\\n\\n Sending Lainey away had been the right thing, the expedient thing, to do.\\n\\n But, oh, how he missed her.\\n\\n Lainey stared out the window, gazing up at the stars, wondering what Micah was doing, wondering why he had sent her away. She wasn\u0027t an expert in sexual games by any means, but she knew when a man desired her, and Micah had wanted her. She was certain of that. His words, his touch, had spoken of a want that went deeper than the needs of the flesh.\\n\\n She closed her eyes as a new thought occurred to her. All along, she\u0027d had the feeling he was hiding from something. Maybe that something was a wife, children, a mountain of debts.\\n\\n She groaned softly. Painful as the thought was, it made more sense than anything else. A man alone. Needing company. And along comes Lainey, naive, gullible Lainey, all too willing to believe a few pretty words uttered by an attractive man...\\n\\n She slammed her fist on the window sill. It didn\u0027t make sense. If he was the kind of heel she was painting him to be, he wouldn\u0027t have stopped at a few kisses, he wouldn\u0027t have sent her away.\\n\\n It just didn\u0027t make sense. Nothing made sense.\\n\\n Eyes still closed, she pressed her forehead against the window pane, wishing she could see him just one more time.\\n\\n Lainey.\\n\\n It was his voice, husky and edged with pain. She whirled around, expecting to see him standing behind her, but there was no one there.\\n\\n I need you.\\n\\n \"Micah...\" Overcome with an unaccountable sense of alarm, she grabbed her coat, handbag, and keys and ran out of the house.\\n\\n Breathless, she backed the car out of the garage and drove toward the mansion, totally oblivious to everything but the necessity of finding Micah.\\n\\n She saw the lights even before she turned down the road. Slowing the car a good distance away from the house, she pulled over and killed the engine. The Grayson place was ablaze with lights. No doubt the police had ordered the electric company to turn on the power.\\n\\n She saw a trio of black-and-white police cruisers, at least a dozen cars bearing an insignia she didn\u0027t recognize, and a couple of unmarked cars. Police officers and men in dark suits and overcoats prowled the enormous front yard. Flood lights, located on all four sides of the house, turned the night to day. Up on the hill behind the house, flashlight beams cut across the darkness, sweeping the shrubbery, the shadows under the trees.\\n\\n She saw dogs.\\n\\n And guns.\\n\\n And men in Air Force blue.\\n\\n She didn\u0027t realize she had a death grip on the steering wheel until her hands began to ache. What on earth was going on?\\n\\n Lainey... hurry...\\n\\n Hurry, Lainey thought, dazed. Hurry where?\\n\\n My voice... follow the sound... of my voice...\\n\\n Without stopping to think, without taking time to wonder about the strangeness of it, Lainey slid out of the car and followed the sound of Micah\u0027s voice.\\n\\n She turned away from the mansion as she made her way down the sharp incline located on the south side of the house. Slipping and sliding, she descended the hill, then turned right and followed a drainage ditch until she came to a storm drain.\\n\\n Bending over, she looked inside. \"Micah?\"\\n\\n \"In here.\"\\n\\n Lainey breathed a sigh of relief when she heard his voice. The inside of the storm drain was damp and dark. She\u0027d gone about six feet when she saw him sitting with his back against the side of the cold cement.\\n\\n \"Micah? Are you all right?\"\\n\\n With a faint nod, he stood up, swaying unsteadily. \"Can you get me out of here?\"\\n\\n \"I can try.\" She held out her hand. \"Come on.\"\\n\\n She couldn\u0027t see his face clearly, but she felt him hesitate. He stooped to pick up something, which he tucked inside his shirt, and then his fingers were closing over hers.\\n\\n Lainey went first, peering into the darkness. \"I think we\u0027re in the clear,\" she whispered. \"Let\u0027s go.\"\\n\\n He followed her out of the storm drain and up the hill. Once, she heard him gasp as he stumbled, and then they were at the top of the incline. Her car was only a few yards away.\\n\\n It was then that she saw the dark stain that blossomed across his shirt front and spread down the left side of his trousers.\\n\\n \"You\u0027re hurt!\" she exclaimed. \"What happened?\"\\n\\n \"No time... to explain,\" he said, his voice reedy and uneven.\\n\\n Lainey stared at him for a moment. He\u0027d been shot, she thought, appalled. She wondered briefly why the police were after him. Wondered if he was, indeed, a mass murderer.\\n\\n And then she looked into his eyes, those guileless silver-blue eyes, and all her doubts and fears disintegrated.\\n\\n A quick glance up the road showed that the police were widening their search. She could see their flashlight beams sweeping the darkness as several officers approached the edge of the driveway. In the distance, she could hear dogs barking, as though they\u0027d picked up a fresh scent.\\n\\n Wordlessly, she helped Micah into the car, then slid behind the wheel. She turned the key in the ignition, then put the car in reverse.\\n\\n Only when they were well out of sight of the mansion did she turn on the headlights.\\n\\n She glanced at Micah several times as she drove home. His eyes were closed, his complexion was beyond pale, his breathing was rapid and shallow. For the first time, it occurred to her that he might die.\\n\\n He was barely conscious when they reached her house. She drove into the garage, shut off the headlights, and switched off the ignition. After getting out of the car, she closed the garage door, then turned on the light.\\n\\n Opening the car door, she shook Micah\u0027s arm. \"Micah? Mi-cah!\"\\n\\n His eyelids fluttered open and he stared up at her, his gaze unfocused.\\n\\n \"You\u0027ve got to walk. I can\u0027t carry you.\"\\n\\n He nodded that he understood, and Lainey stepped away from the car so he could get out.\\n\\n There was no way to explain what she saw. Afterwards, she would wonder if she had imagined it. While she watched, he closed his eyes and she knew, without knowing how she knew, that he was drawing on help from some deep inner well. Impossible as it seemed, she could almost see the vitality flowing through him, strengthening him from within.\\n\\n In less than a minute, Micah opened his eyes. Effortlessly, he climbed out of the car and followed Lainey inside, down the narrow hallway into the guest room located in the back of the house.\\n\\n He stood in the middle of the floor, his gaze sweeping the room in a swift glance, noting the single window, the narrow bed, the chest of drawers. And then he reached inside his shirt, pulled out a black box, and handed it to her.\\n\\n \"Take care of this for me,\" he said, forcing each word. \"If anything happens to me, you must destroy it.\"\\n\\n And then, as if the last drop of his energy had been expended, he fell face-down across the bed.\\n\\n Lainey stared at the box for a moment, then placed it on top of the dresser and turned her attention to Micah. It took all her strength to turn him over, to remove the blood-soaked shirt, his shoes and socks, the blood-stained trousers. He wasn\u0027t wearing anything under his trousers or shirt.\\n\\n As she pressed a cloth over the ugly wound in his side, her mind registered a quick impression of a perfect male body before she covered him with a sheet, then ran into the kitchen. She filled a teapot with water and put it on the stove to heat, found a pair of scissors, some gauze, a roll of tape, a bottle of disinfectant.\\n\\n While the water heated, she ran back to the bedroom to place a hand on his forehead. It was warm. Too warm. The sheet that covered him was already stained with blood. Lainey frowned... Brown blood?\\n\\n She closed her eyes and shook her head, but when she looked again, the blood was still brown.\\n\\n The whistle of the teapot drew her back into the kitchen. Finding a tray, she piled everything onto it and went back into the bedroom.\\n\\n Drawing the sheet away from the wound, she stared at the odd-colored blood that oozed from the bullet hole and then, taking a deep breath, she eased Micah onto his side, feeling a swift surge of relief when she saw that the bullet had gone through.\\n\\n Moving quickly, trying not to gag at the sight of so much blood, she washed the wound, soaked it with disinfectant, placed cold compresses over both holes, and wrapped a thick layer of gauze around his middle to hold everything in place.\\n\\n She was perspiring heavily by the time she was through. She hated the sight of blood! She knew lots of little girls dreamed of being doctors or nurses when they grew up, but she never had. Just the thought of a needle was enough to make her nauseated.\\n\\n Lainey stared at the bloody shirt on the floor, at the rag she\u0027d used to clean the wounds. Brown blood. Try as she might, she could find no logical explanation for it, but she didn\u0027t have time to worry about it now.\\n\\n Returning to the kitchen, she made herself a cup of strong coffee, then brewed a cup of weak herb tea, which she generously laced with brandy, for Micah.\\n\\n He roused enough to drink it, and then he fell back on the pillow.\\n\\n Sitting in the rocking chair beside the bed, Lainey sipped her coffee. Who was Micah? Why were the police hunting for him? And why had the Air Force been there?\\n\\n If he was wanted by the law, she could be arrested for harboring a fugitive.\\n\\n She rested her head against the back of the rocker and closed her eyes. Bits and pieces of the last few days drifted down the corridors of her mind - hearing Micah\u0027s voice the first night she had spent in the Grayson house - the fire that started by itself - the carton of orange juice that had appeared as if by magic at the back door of the mansion - the figure with the blue aura that had appeared in one of her photographs. Maybe they were all incidents that could be explained logically. And maybe not.\\n\\n Sitting up in the chair, Lainey stared at Micah. His breathing was shallow, so shallow that she placed her hand over his chest to make certain he was still alive.\\n\\n She couldn\u0027t seem to keep from touching him - his brow, which was much too hot; a lock of his hair, damp with sweat. She let her fingertips caress his cheek, his jaw. Odd, she thought, there was no telltale shadow of a beard.\\n\\n He muttered something in his sleep, something she couldn\u0027t understand, and then he whispered her name.\\n\\n \"I\u0027m here, Micah.\"\\n\\n His eyelids fluttered open. His eyes were dark, glazed with pain and fever. \"Thirsty... so thirsty.\"\\n\\n \"Here.\" Lifting his head, she held her cup to his mouth. He drank greedily, drinking the last of the coffee that had gone cold.\\n\\n \"Got... to... get... away.\"\\n\\n \"Later.\"\\n\\n \"Now.\"\\n\\n \"You\u0027ve got a fever, Micah. You\u0027ve got to rest.\"\\n\\n He shook his head. \"Must... go. Home.\"\\n\\n \"Soon.\" She lowered his head to the pillow, then wiped his face with a cool cloth. \"Rest now.\"\\n\\n He shook his head, then tried to sit up, groaning as the movement pulled on the wound in his side. \"Danger... here.\"\\n\\n \"You\u0027re safe. No one knows where you are.\" She pressed a hand to his shoulder, encouraging him to lie back down. \"Please, Micah, you\u0027ve got to stay quiet.\"\\n\\n He stilled at her touch and she started to sit back in the rocker when she noticed the stain spreading over the bedding.\\n\\n He was bleeding again.\\n\\n It was after midnight by the time she got the bleeding stopped, the bandages replaced, and the sheets changed. The fever raging through him frightened her even more than the blood and its peculiar color.\\n\\n Filling a bowl with cold water, she wiped his face, his neck, the broad expanse of his chest, down his flat belly, stopping at the strategic point where the sheet protected his modesty and thwarted her curiosity.\\n\\n Near dawn, his fever went down and a little color returned to his cheeks. Hardly able to keep her eyes open, Lainey curled up in the rocking chair, drew a furry blanket up to her chin, and closed her eyes. That quickly, she was asleep.\\n\\n Asleep and dreaming.\\n\\n She was walking with Micah, holding his hand. Everywhere they went, people stared at them, pointing, frowning. Puzzled, she glanced around, noticing for the first time that the sky was yellow, the grass was blue-green, and the sun was pale pink. She noticed the people then. They were all about the same height, they all had hair of varying shades of blond and eyes of varying shades of blue. Trying to stifle the hysteria she felt rising within her, she lifted her head to look at Micah...\\n\\n The sound of her own scream jerked her from sleep.\\n\\n \"Lainey, are you all right?\"\\n\\n \"Fine.\" She stared at Micah, but he was only a dark shape against the flowered percale sheets. Frowning, she tried to remember her dream, but it was gone.\\n\\n \"Go back to sleep, Lainey.\" Micah\u0027s voice, low and soothing, reached out to her through the darkness.\\n\\n She nodded. Sleep, yes.\\n\\n There\u0027s nothing to be afraid of.\\n\\n His voice, speaking in her mind, soothed her as it had once before, lulling her back to sleep.\\n\\n There were no more dreams. \\n\\n","sourceLink":"https://allnovel.net/sunlight-moonlight/page-7.html","bookId":2306,"book":{"id":2306,"title":"Sunlight Moonlight","description":"Storyline: In Sunlight, handsome alien Micah is trapped on Earth after he crash lands and falls in love with beautiful woman, while in Moonlight, the vampire Navarre seeks for a woman brave enough to enter his world.\\n","cover":"https://allnovel.net/images/sunlight-moonlight.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sunlight-moonlight.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:11:43 PM"}}
