{"id":65678,"no":6,"title":"Page 6","content":"\n “Lady Joanna,” Bernard said as he approached. “I wish to have a word with you.” He glanced at Maris, who appeared to be watching with very sharp eyes, and added, “if you would excuse us, my lady. I wish to speak with Jo-Lady Joanna.” His gaze raked over Joanna, touching her from head to toe as though to assure himself that she was all right.\n She raised her face high to look up at him, for her head reached only to the top of his broad chest. “Lord Bernard…I did not know you to be such a fine singer.”\n She noticed that his eyes were dark, shadowed by the flickering torch light, and his mouth set in a firm line that echoed the straightness of his neat moustache.\n “Many thanks, my lady,” he replied, a startled look passing over his face. “But I would wish—”\n “Did you not hear Lord Bernard as he sang such beautiful ballads this eve?” Joanna turned casually to Maris. “I vow, there’s never been a minstrel with such a rich voice.”\n “Aye, ’tis so,” Maris replied, her gaze moving from one to the other. “Lord Bernard, Lady Joanna is in some pain, and I was just about to—”\n “You are hurt? I thought the veil was to hide something.” His face darkened further as he tore the flimsy covering from her head, even as Joanna tried to duck aside.\n “Mary, Mother of God….” Maris breathed.\n Bernard’s hand fell to his sword even as he reached gently to touch the tender swelling on the side of her face. “He does not deserve to live….” he ground out. “I’ll kill the bastard, by God!”\n “Bernard, nay!” Despite her soreness, Joanna grasped his arm, clutching hard ridges of muscle. “Nay, you cannot—do you not be a fool. I am his wife. He can do with me what he will.” She looked up at him and saw a frightening rage in his eyes. “I belong to him.”\n Maris stepped forward, brushing one of Joanna’s thick braids back from her temple to look more closely at the bruising all along her face. “He deserves to die, he who would do this. Come, Joanna, I’ll tend you in my chamber.” When Bernard would speak, she looked up at him, “Nay, Bernard—you cannot attend her. You know that. Your task is to ensure that her husband does not return, looking for her, until midnight at the least. Start a fight with him if you must, but keep him away. Now go, you.”\n “’Tis a good thing you do not wish to wed, Lady Maris—for I know of few men who would have a termagent such as you,” Bernard muttered.\n Joanna drew back, insulted for her new friend and shocked that he would utter such words, but Maris merely laughed. “’Tis my own secret—and now yours—that that is the way I wish it to be. Now make haste!”\n But Bernard ignored her command, and instead took Joanna’s hand in his large fingers. He raised it to his lips, brushing his mouth over her palm and the sensitive inside of her wrist. Prickles of warmth skittered up her spine, and she breathed a faint gasp at the unexpected pleasure. The soft bristles of his moustache, and the warmth of his lips pressed one last kiss on the back of her hand before he released it.\n “Joanna, would that I could protect you now….But I cannot—not yet. I will find a way, my lady. Have a care tonight, and I will see you on the morrow.” He turned to Maris, giving a faint bow, and added, “My thanks, my lady, for caring for her. If only we could find a way to keep her from her husband.”\n Maris had been watching the two of them, and now she spoke. “I do not wish her to be in his custody any more than you do, Bernard, but she is his wife. There is no means of interference. Yet, I will think on it, and see if there is aught that can be done to somehow arrange a reprieve.”\n Bernard bowed and turned away. He took two steps, stopped, and turned back, holding Joanna’s veil. “I shall wear your favor on the lists tomorrow.” Then he strode off.\n “Come, Joanna.” Maris once again slipped her arm through hers.\n “’Tis dangerous for Bernard,” Joanna said as they paced along the corridor. “Ralf—my husband—bears ill will toward him.”\n Maris looked at her, faint amusement showing in her face. “It would appear that Bernard can protect himself, Joanna. I am most concerned with you and your fate.” The humor faded from her expression. “Here.” She stopped in front of a door and opened it for them to enter. She spoke immediately to the young servant within. “Anna, do you sit out side of the door and knock should anyone approach.” As her maid hurried to do her bidding, Maris gently pulled Joanna into the chamber and directed her to sit on the bed.\n “Now, let us get that gown off. I trow there is more anger hidden beneath it.”\n Her bruises were so painful that Joanna was forced to allow Maris to assist her in disrobing, and when the other woman saw the marks and cuts on her back, arms, and legs, she knelt beside her, clasping her hand.\n Tears filled her eyes as she looked up at Joanna. “How do you bear it?” she asked. “How do you bear it so bravely, so strongly?” A gentle hand smoothed down her back—the first touch Joanna had received on bare skin that was not designed to hurt.\n She moved her shoulders in an awkward shrug. “I have no choice. ’Tis my lot.” She pressed her hand onto Maris’s. “I could hide in my chambers all the day—’tis true—or end my life, or cower and squeak like no more than a mouse. An’ there are times when I must try to be invisible, and there are times when the merest noise causes me to jump—for it might be him.”\n She took a deep breath as Maris rose, and confessed the secret which burned deep inside her. “I am most likely damned, for I cannot accept my lot. I know that I must be obedient to my husband—that he owns me, and may do with me what he will….but I cannot accept that.”\n “And well you should not.” Maris returned to the bed, carrying a thick leather satchel. She flipped it open, and it unrolled, exposing small pouches, packets wrapped in leather and parchment, and other utensils. “God helps those who help themselves, and accepting of such a life is foolish. You will be killed if he continues like this.”\n Joanna drew in her breath deeply as Maris began to smooth a soothing salve onto her bruised face, and down to the shoulder that had been jolted by the man-at-arms in the hall.\n She took some small, dried green leaves and, crumbling them in her hands, sprinkled them over the salve on Joanna’s shoulder where Ralf’s knife had cut her. “Woad. Dried woad will ease the pain and start the healing. Jesu, no man should be allowed to live after this!”\n Joanna laughed bitterly. “Aye. There are many a night when I contemplate ways to send him to his death. But ’twould be almost as much of a sin—more, aye—than what he does to me.” She passed a shaking hand over her hair, pushing a thick lock from her face. “But I’ve dreamed of it.”\n “You are a better woman than I—for I would have done it after the first moon of enduring such treatment, damnation or nay.” Maris pressed a strip of cloth onto the herb-sprinkled salve. “Can your father not help? Can you not flee to him for protection?”\n “’Tis my father who gave me to Ralf. He does not care—he says what all men say: that a wife belongs to her husband.”\n “Another reason I shall never wed,” Maris said, dabbing something onto another fresh cut. It stung, but not so much as the leather whipcord had, and Joanna barely flinched.\n “You shan’t wed?”\n “Nay. My father will not force me, and I do not wish to be bound to a man.”\n Joanna shook her head slowly. “I do not mind being wed—but to a man such as Ralf, ’tis hell. When I leave, I shall have no—” Realizing what she’d said, she bit back her words and froze into silence.\n “Leave?”\n Joanna said nothing, cursing herself for letting her tongue relax.\n “Is Bernard to help you to leave? Do you run off with him?” Maris looked sharply at her. “Do not tell me you are Bathsheba to his David.”\n “Nay, oh nay! I would not allow it of him—or anyone. If Ralf does find me, he’ll kill me, and whoever would be with me, and whoever might have helped me along the way.”\n Miraculously, Joanna’s pain began to ebb, and her head to clear as she continued to speak. “Ralf does not allow me to leave the keep at Swerthmoor, but he could not keep me from coming to my sister’s wedding celebration, so I have this chance—this one chance—to run from him. I have been saving gold pieces, waiting for such an opportunity. He does not notice the small amount missing.”\n “Where will you go?”\n “I know of an abbey nearby—as I grew up here. The sisters will take me in, and hide me, I am certain. I shall live in a cloister all the rest of my days. If Ralf does not find me, and follow me, I shall be safe. And….” she hesitated.\n “Is there more?”\n “Aye. My father has a map of this keep, for there is a tale of great treasure hidden in the warren of secret tunnels beneath it. I plan to take the map during the tourney on the morrow, and it is with its help and through the tunnels that I’ll take my flight. Thus I will get outside of the walls unseen.”\n “If it is so legendary, does not your husband know of the map?”\n “Aye, and therein is my trick. Ralf has demanded that I obtain it from my father, but he will not ask for it on his own. He knows my father will not give it to him.” Joanna’s lips curved into a slight smile. “I will make a false copy and to give to Ralf—and use the true one for my own purposes.”\n Maris stopped her work to grin at her. “Clever girl. For even should he attempt to follow you, he will be lost.”\n “Aye.”\n They were silent for a moment—Joanna enjoying the touch of a healer and the moment where she need not fear that her peace would be interrupted. Maris worked quickly and with great efficiency.\n When she finished her work, Maris carefully rolled up the leather satchel and walked to a large trunk beside the fireplace. As she turned, she spoke. “What of Bernard, Joanna? How does he figure into this scheme?” \n","sourceLink":"https://allnovel.net/lavender-vows-medieval-herb-garden-1/page-6.html","bookId":2667,"book":{"id":2667,"title":"Lavender Vows (Medieval Herb Garden #1)","description":"Storyline: \n Lavender Vows (Medieval Herb Garden #1) \n Gruff, brooding Lord Bernard of Derkland needs to find a wife, if for no other reason than to satisfy his father and his incessant badgering. He has no interest in marrying, but when he meets the beautiful and gentle Joanna of Swerthmore, he immediately knows she is the one. \n The only problem is: she\u0027s already wed...to a monster. \n Readers who like Roberta Gellis, Catherine Coulter, Tina St. John, and Paula Quinn will enjoy this book of romance about ladies, lords, knights and castles.\n \n","cover":"https://allnovel.net/images/lavender-vows-medieval-herb-garden-1.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/lavender-vows-medieval-herb-garden-1.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:58:20 AM"}}
