{"id":110174,"no":11,"title":"Page 11","content":"Last Trick\n It was strange, but Tally couldn\u0027t help feeling sad. She knew she\u0027d miss the view from this window.\n She\u0027d spent the last four years looking out at New Pretty Town, wanting nothing more than to cross the river and not come back. That\u0027s probably what had tempted her through the window so many times, learning every trick she could to sneak closer to the new pretties, to spy on the life she would eventually have.\n But now that the operation was only a week away, time seemed to be moving too fast. Sometimes, Tally wished that they could do the operation gradually. Get her squinty eyes fixed first, then her lips, and cross the river in stages. Just so she wouldn\u0027t have to look out the window one last time and know she\u0027d never see this view again.\n Without Shay around, things felt incomplete, and she\u0027d spent even more time here, sitting on her bed and staring at New Pretty Town.\n Of course, there wasn\u0027t much else to do these days. Everyone in the dorm was younger than Tally now, and she\u0027d already taught all of her best tricks to the next class. She\u0027d watched every movie her wallscreen knew about ten times, all the way back to some old black-and-white ones in an English she could barely understand. There was no one to go to concerts with, and dorm sports were boring to watch now that she didn\u0027t know anyone on the teams. All the other uglies looked at her enviously, but no one saw much point in making friends. Probably it was better to get the operation over with all at once.\n Half the time, she wished the doctors would just kidnap her in the middle of the night and do it. She could imagine a lot worse things than waking up pretty one morning. They said at school that they could make the operation work on fifteen-year-olds now. Waiting until sixteen was just a stupid old tradition.\n But it was a tradition nobody questioned, except the occasional ugly. So Tally had a week to go, alone, waiting.\n Shay hadn\u0027t talked to her since their big fight. Tally had tried to write a ping, but working it all out on-screen just made her angry again. And it didn\u0027t make much sense to sort it out now. Once they were both pretty, there wouldn\u0027t be anything to fight about anymore. And even if Shay still hated her, there was always Peris and all their old friends, waiting across the river for her with their big eyes and wonderful smiles.\n Still, Tally spent a lot of time wondering what Shay was going to look like pretty, her skin-and-bones body all filled out, her already full lips perfected, and the ragged fingernails gone forever. They\u0027d probably make her eyes a more intense shade of green. Or maybe one of the newer colors - violet, silver, or gold.\n \"Hey, Squint!\"\n Tally jumped at the whisper. She peered into the darkness and saw a form scuttling toward her across the roof tiles. A smile broke onto her face. \"Shay!\"\n The silhouette paused for a moment.\n Tally didn\u0027t even bother to whisper. \"Don\u0027t just stand there. Come in, stupid!\"\n Shay crawled into the window, laughing, as Tally gathered her into a hug, warm and joyful and solid.\n They stepped back, still holding each other\u0027s hands. For a moment, Shay\u0027s ugly face looked perfect.\n \"It\u0027s so great to see you.\"\n \"You too, Tally.\"\n \"I missed you. I wanted to - I\u0027m so sorry about - \"\n \"No,\" Shay interrupted. \"You were right. You made me think. I was going to write you, but it was all...\"\n She sighed.\n Tally nodded, squeezing Shay\u0027s hands. \"Yeah. It sucked.\"\n They stood in silence for a moment, and Tally glanced past her friend out the window. Suddenly, the view of New Pretty Town didn\u0027t seem so sad. It looked bright and tempting, as if all the hesitation had drained out of her. The open window was exciting again. \"Shay?\"\n \"Yeah?\"\n \"Let\u0027s go somewhere tonight. Do some major trick.\"\n Shay laughed. \"I was kind of hoping you\u0027d say that.\"\n Tally noticed the way Shay was dressed. She was wearing serious trick-wear: all black clothes, hair tied back tight, a knapsack over one shoulder. She grinned. \"Already got a plan, I see. Great.\"\n \"Yeah,\" Shay said softly. \"I\u0027ve got a plan.\"\n She walked over to Tally\u0027s bed, unslinging the knapsack from her shoulder. Her footsteps squeaked, and Tally smiled when she saw that Shay was wearing grippy shoes. Tally hadn\u0027t been on a hoverboard in days. Flying alone was all the hard work and only half the fun.\n Shay dumped the contents of the knapsack out onto the bed, and pointed. \"Position-finder. Firestarter.\n Water purifier.\" She picked up two shiny wads the size of sandwiches. \"These pull out into sleeping bags.\n And they\u0027re really warm inside.\"\n \"Sleeping bags? Water purifier?\" Tally exclaimed. \"This must be some kind of awesome multiday trick.\n Are we going all the way to the sea or something?\"\n Shay shook her head. \"Farther.\"\n \"Uh, cool.\" Tally kept her smile on her face. \"But we\u0027ve only got six days till the operation.\"\n \"I know what day it is.\" Shay opened a waterproof bag and spilled its contents alongside the rest. \"Food for two weeks - dehydrated. You just drop one of these into the purifier and add water. Any kind of water.\" She giggled. \"The purifier works so well, you can even pee in it.\"\n Tally sat down on the bed, reading the labels on the food packs. \"Two weeks?\"\n \"Two weeks for two people,\" Shay said carefully. \"Four weeks for one.\"\n Tally didn\u0027t say anything. Suddenly, she couldn\u0027t look at the stuff on the bed, or at Shay. She stared out the window, at New Pretty Town, where the fireworks were starting.\n \"But it won\u0027t take two weeks, Tally. It\u0027s much closer.\"\n A plume of red soared up in the middle of town, tendrils of fireworks drifting down like the leaves of a giant willow tree. \"What won\u0027t take two weeks?\"\n \"Going to where David lives.\"\n Tally nodded, and closed her eyes.\n \"It\u0027s not like here, Tally. They don\u0027t separate everyone, uglies from pretties, new and middle and late.\n And you can leave whenever you want, go anywhere you want.\"\n \"Like where?\"\n \"Anywhere. Ruins, the forest, the sea. And...you never have to get the operation.\"\n \"Youwhat ?\"\n Shay sat next to her, touching Tally\u0027s cheek with one finger. Tally opened her eyes. \"We don\u0027t have to look like everyone else, Tally, and act like everyone else. We\u0027ve got a choice. We can grow up any way we want.\"\n Tally swallowed. She felt like speech was impossible, but knew she had to say something. She forced words from her dry throat. \"Not be pretty? That\u0027s crazy, Shay. All the times you talked that way, I thought you were just being stupid. Peris always said the same stuff.\"\n \"Iwas just being stupid. But when you said I was afraid of growing up, you really made me think.\"\n \"Imade you think?\"\n \"Made me realize how full of crap I was. Tally, I\u0027ve got to tell you another secret.\"\n Tally sighed. \"Okay. I guess it can\u0027t get any worse.\"\n \"My older friends, the ones I used to hang out with before I met you? Not all of them wound up pretty.\"\n \"What do you mean?\"\n \"Some of them ran away, like I am. Like I want us to.\"\n Tally looked into Shay\u0027s eyes, searching for some sign that this was all a joke. But the intense look on her face held firm. She was dead serious.\n \"You know someone who actually ran away?\"\n Shay nodded. \"I was supposed to go too. We had it all planned, about a week before the first of us turned sixteen. We\u0027d already stolen survival gear, and told David that we were coming. It was all set up.\n That was four months ago.\"\n \"But you didn\u0027t...\"\n \"Some of us did, but I chickened out.\" Shay looked out the window. \"And I wasn\u0027t the only one. A couple of the others stayed and turned pretty instead. I probably would have too, except I met you.\"\n \"Me?\"\n \"All of a sudden I wasn\u0027t alone anymore. I wasn\u0027t afraid to go back out to the ruins, to look for David again.\"\n \"But we never...\" Tally blinked. \"You finally found him, didn\u0027t you?\"\n \"Not until two days ago. I\u0027ve been out every night since we...since our fight. After you said I was afraid to grow up, I realized you were right. I\u0027d chickened out once, but I didn\u0027t have to again.\"\n Shay grasped Tally\u0027s hand, and waited until their eyes were locked. \"I want you to come, Tally.\"\n \"No,\" Tally said without thinking. Then she shook her head. \"Wait. How come you nevertold me any of this before?\"\n \"I wanted to, except you would have thought I was crazy.\"\n \"Youare crazy!\"\n \"Maybe. But not that way. That\u0027s why I wanted you to meet David. So you\u0027d know that it\u0027s all real.\"\n \"It doesn\u0027t seem real. I mean, what is this place you\u0027re talking about?\"\n \"It\u0027s just called the Smoke. It\u0027s not a city, and nobody\u0027s in charge. And nobody\u0027s pretty.\"\n \"Sounds like a nightmare. And how do you get there, walk?\"\n Shay laughed. \"Are you kidding? Hoverboards, like always. There are long-distance boards that recharge on solar, and the route\u0027s all worked out to follow rivers and stuff. David does it all the time, as far as the ruins. He\u0027ll take us to the Smoke.\"\n \"But how do peoplelive out there, Shay? Like the Rusties? Burning trees for heat and burying their junk everywhere? It\u0027s wrong to live in nature, unless you want to live like an animal.\"\n Shay shook her head and sighed. \"That\u0027s just school-talk, Tally. They\u0027ve still got technology. And they\u0027re not like the Rusties, burning trees and stuff. But they don\u0027t put a wall up between themselves and nature.\"\n \"And everyone\u0027s ugly.\"\n \"Which means no one\u0027s ugly.\"\n Tally managed to laugh. \"Which means no one\u0027spretty, you mean.\"\n They sat in silence. Tally watched the fireworks, feeling a thousand times worse than she had before Shay had appeared at the window.\n Finally, Shay said the words Tally had been thinking. \"I\u0027m going to lose you, aren\u0027t I?\"\n \"You\u0027re the one who\u0027s running away.\"\n Shay brought her fists down onto her knees. \"It\u0027s all my fault. I should\u0027ve told you earlier. If you\u0027d had more time to get used to the idea, maybe...\"\n \"Shay, I never would have gotten used to the idea. I don\u0027t want to be ugly all my life. I want those perfect eyes and lips, and for everyone to look at me and gasp. And for everyone who sees me to think Who\u0027s that? and want to get to know me, and listen to what I say.\"\n \"I\u0027d ratherhave something to say.\"\n \"Like what? \u0027I shot a wolf today and ate it\u0027?\"\n Shay giggled. \"People don\u0027t eat wolves, Tally. Rabbits, I think, and deer.\"\n \"Oh, gross. Thanks for the image, Shay.\"\n \"Yeah, I think I\u0027ll stick to vegetables and fish. But it\u0027s not about camping out, Tally. It\u0027s about becoming what I want to become. Not what some surgical committee thinks I should.\"\n \"You\u0027re still yourself on the inside, Shay. But when you\u0027re pretty, people pay more attention.\"\n \"Not everyone thinks that way.\"\n \"Are you sure about that? That you can beat evolution by being smart or interesting? Because if you\u0027re wrong...if you don\u0027t come back by the time you\u0027re twenty, the operation won\u0027t work as well. You\u0027ll look wrong, forever.\"\n \"I\u0027m not coming back. Forever.\"\n Tally\u0027s voice caught, but she forced herself to say it: \"And I\u0027m not going.\"\n They said good-bye under the dam.\n Shay\u0027s long-range hoverboard was thicker, and glimmered with the facets of solar cells. She\u0027d also stashed a heated jacket and hat under the bridge. Tally guessed that winters at the Smoke were cold and miserable.\n She couldn\u0027t believe her friend was really going.\n \"You can always come back. If it sucks.\"\n Shay shrugged. \"None of my friends has.\"\n The words gave Tally a creepy feeling. She could think of a lot of horrible reasons to explain why no one had come back. \"Be careful, Shay.\"\n \"You too. You\u0027re not going to tell anyone about this, right?\"\n \"Never, Shay.\"\n \"You swear? No matter what?\"\n Tally raised her scarred palm. \"I swear.\"\n Shay smiled. \"I know. I just had to ask again before I...\" She pulled out a piece of paper and handed it to Tally.\n \"What\u0027s this?\" Tally opened it up and saw a scrawl of letters. \"When did you learn to write by hand?\"\n \"We all learned while we were planning to leave. It\u0027s a good idea if you don\u0027t want minders sniffing your diary. Anyway, that\u0027s for you. I\u0027m not supposed to leave any record of where I\u0027m going, so it\u0027s in code, kind of.\"\n Tally frowned, reading the first line of slanted words. \"\u0027Take the coaster straight past the gap\u0027?\"\n \"Yeah. Get it? Only you could figure it out, in case someone finds it. You know, if you ever want to follow me.\"\n Tally started to say something, but couldn\u0027t. She managed to nod.\n \"Just in case,\" Shay said.\n She jumped onto her board and snapped her fingers, securing her knapsack over both shoulders.\n \"Good-bye, Tally.\"\n \"Bye, Shay. I wish...\"\n Shay waited, bobbing just a bit in the cool September wind. Tally tried to imagine her growing old, wrinkled, gradually ruined, all without ever having been truly beautiful. Never learning how to dress properly, or how to act at a formal dance. Never having anyone look into her eyes and be simply overwhelmed.\n \"I wish I could have seen what you would look like. Pretty, I mean.\"\n \"Guess you\u0027ll just have to live with remembering my face this way,\" Shay said.\n Then she turned and her hoverboard climbed away toward the river, and Tally\u0027s next words were lost on the roar of the water. \n","sourceLink":"https://allnovel.net/uglies-uglies-1/page-11.html","bookId":1573,"book":{"id":1573,"title":"Uglies (Uglies #1)","description":"Storyline: \n Uglies (Uglies #1) \n Tally Youngblood is about to turn sixteen, and she can\u0027t wait for the operation that turns everyone from a repellent ugly into a stunningly attractive pretty and catapults you into a high-tech paradise where your only job is to party. But new friend Shay would rather hoverboard to \"the Smoke\" and be free. Tally learns about a whole new side of the pretty world and it isn\u0027t very pretty. The \"Special Circumstances\" authority Dr Cable offers Tally the worst choice she can imagine: find her friend and turn her in, or never turn pretty at all. The choice Tally makes changes her world forever.\n \n","cover":"https://allnovel.net/images/uglies-uglies-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/uglies-uglies-1.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:51:31 PM"}}
