{"id":110176,"no":14,"title":"Page 14","content":"Ugly for Life\n They must have forewarned the minders about her return. All the other uglies were gone, off on some unscheduled school trip. But they hadn\u0027t found out in time to save her stuff. When Tally reached her old room, she saw that everything had been recycled. Clothes, bedding, furniture, the pictures on the wallscreen - it had all reverted back to Generic Ugly. It even looked as if somebody else had been briefly moved in, then out again, leaving a strange drink can in the fridge.\n Tally sat down on the bed, too stunned to cry. She knew she would start bawling soon, probably losing it at the worst possible time and place. Now that the encounter with Dr. Cable was over, her anger and defiance were fading, and there was nothing left to sustain her. Her stuff was gone, her future was gone, only the view out the window remained.\n She sat and stared, having to remind herself every few minutes that it had all really happened: the cruel pretties, the strange buildings on the edge of town, the terrible ultimatum from Dr. Cable. Tally felt as if some wild trick had gone horribly wrong. A weird and horrible new reality had opened up, devouring the world she knew and understood.\n All she had left was the small duffel bag she\u0027d packed for the hospital. She couldn\u0027t even remember carrying it all the way back here. Tally pulled out the few clothes, which she\u0027d shoved in at random, and found Shay\u0027s note.\n She read it, looking for clues.\n Take the coaster straight past the gap,\n until you find one that\u0027s long and flat.\n Cold is the sea and watch for breaks.\n At the second make the worst mistake.\n Four days later take the side you despise,\n and look in the flowers for fire-bug eyes.\n Once they\u0027re found, enjoy the flight.\n Then wait on the bald head until it\u0027s light.\n Hardly any of it made sense to her, only bits and pieces. Shay had obviously meant to hide the meaning from anyone else reading it, using references only the two of them would understand. Her paranoia made a lot more sense now. Having met Dr. Cable, Tally could see why David wanted to keep his city - or camp, or whatever it was - a secret.\n As Tally held the note, she realized that it was what Dr. Cable had wanted. The woman had been sitting across the room from the letter the whole time, but they\u0027d never bothered to search her. That meant that Tally had kept Shay\u0027s secret, and that she still had something to bargain with.\n It also meant that Special Circumstances could make mistakes.\n Tally saw the other uglies come back in before lunchtime. As they filed off the school transport, all of them craned their necks to look up at her window. A few pointed before she ducked back into the shadows. Minutes later Tally could hear kids in the hall outside, growing silent as they passed her door.\n A few even giggled, as new uglies always did when tried to keep quiet.\n Were theylaughing at her?\n Her rumbling stomach reminded Tally that she hadn\u0027t eaten breakfast, or dinner the night before. You weren\u0027t supposed to have food or water for sixteen hours before the operation. She was starving.\n But she stayed in her room until lunch was over. She couldn\u0027t face a cafeteria full of uglies watching her every move, wondering what she had done to deserve her still-ugly face. When she couldn\u0027t stand her hunger anymore, Tally stole upstairs to the roof deck, where they put out leftovers for whoever wanted them.\n A few uglies saw her in the hall. They clammed up and stood aside as Tally passed, as if she were contagious. What had the minders told them? Tally wondered. That she\u0027d pulled one too many tricks?\n That she was inoperable, an ugly-for-life? Or just that she was a Special Circumstance?\n Everywhere she went, eyes looked away, but it was the mostvisible she\u0027d ever felt.\n A plate was set out for her on the roof deck, sealed in plastic wrap, her name stuck to it. Someone had noticed that she hadn\u0027t eaten. And, of course, everyone would realize that she was in hiding.\n The sight of the plate of food, wilted and solitary, made the suppressed tears well up in her eyes. Tally\u0027s throat burned as if she\u0027d swallowed something sharp, and it was all she could do to get back to her room before she burst into loud, jagged sobs.\n When she got there, Tally found that she hadn\u0027t forgotten to bring the plate. She ate while she cried, tasting the salt of her tears in every bite.\n Her parents came by about an hour later.\n Ellie swept in first, gathering Tally into a hug that emptied her lungs and lifted her feet off the ground.\n \"Tally, my poor baby!\"\n \"Now don\u0027t injure the girl, Ellie. She\u0027s had a tough day.\"\n Even without oxygen, it felt good inside the crushing embrace. Ellie always smelled just right, like a mom, and Tally always felt like a littlie in her arms. Released after what was probably a solid minute, but still too soon, Tally stepped back, hoping that she wouldn\u0027t cry again. She looked at her parents sheepishly, wondering what they must be thinking. She felt like a total failure. \"I didn\u0027t know you guys were coming.\"\n \"Of course we came,\" Ellie said.\n Sol shook his head. \"I\u0027ve never heard of anything like this happening. It\u0027s ridiculous. And we\u0027ll get to the bottom of it, don\u0027t you worry!\"\n Tally felt a weight lift from her shoulders. Finally there was someone else on her side. Her father\u0027s middle-pretty eyes twinkled with calm certainty. There was no question that he would sort everything out.\n \"What did they tell you?\" Tally asked.\n Sol gestured, and Tally sat down on the bed. Ellie settled beside her while he paced back and forth across the small room.\n \"Well, they told us about this Shay girl. Sounds like she\u0027s a lot of trouble.\"\n \"Sol!\" Ellie interrupted. \"The poor girl\u0027s missing.\"\n \"Sounds like she wants to be missing.\"\n Her mother pursed her lips in silence.\n \"It\u0027s not her fault, Sol,\" Tally said. \"She just didn\u0027t want to turn pretty.\"\n \"So, she\u0027s an independent thinker. Fine. But she should have had better sense than to drag someone else down with her.\"\n \"She didn\u0027t drag me anywhere. I\u0027m right here.\" Tally looked out the window at the familiar view of New Pretty Town. \"Where I\u0027ll be forever, apparently.\"\n \"Now, now,\" Ellie said. \"They said that once you\u0027ve helped them find this Shay girl, everything should go ahead as normal.\"\n \"It won\u0027t make any difference if the operation happens a few days late. It\u0027ll be a great story when you\u0027re old.\" Sol chuckled.\n Tally bit her lip. \"I don\u0027t think I can help them.\"\n \"Well, you just do your best,\" Ellie said.\n \"But I can\u0027t. I mean, I promised Shay that I wouldn\u0027t tell anyone her plans.\"\n They were silent for a moment.\n Sol sat down, taking one of her hands in his. They felt so warm and strong, almost as wrinkled as a crumbly\u0027s from days spent working in his wood shop. Tally realized that she hadn\u0027t visited her parents since the week of summer break, when she\u0027d mostly been anxious to get back to hanging out with Shay full-time. But it was good to see them now.\n \"Tally, we all make promises when we\u0027re little. That\u0027s part of being an ugly - everything\u0027s exciting and intense and important, but you have to grow out of it. After all, you don\u0027t owe this girl anything. She\u0027s done nothing but cause you trouble.\"\n Ellie took her other hand. \"And you\u0027ll only be helping her, Tally. Who knows where she is now and what\u0027s happening to her? I\u0027m surprised you let her run off like that. Don\u0027t you know how dangerous it is out there?\"\n Tally found herself nodding. Looking into Sol\u0027s and Ellie\u0027s faces, everything seemed so clear. Maybe cooperating with Dr. Cable would really be helping Shay, and would set things back on course for herself. But the thought of Dr. Cable made her wince. \"You should have seen these people. The ones investigating Shay? They look like...\"\n Sol laughed. \"I guess it would be a bit of a shock at your age, Tally. But of course we old folks know all about Special Circumstances. They may be tough, but they\u0027re just doing their jobs, you know. It\u0027s a tough world out there.\"\n Tally sighed. Maybe her reluctance was just because the cruel pretties had scared her so much. \"Have you ever met them? I couldn\u0027t believe the way they looked.\"\n Ellie furrowed her brow. \"Well, I can\u0027t say I\u0027ve actuallymet one.\"\n Sol frowned, then broke into a laugh. \"Well, you wouldn\u0027twant to meet one, Ellie. And Tally, if you do the right thing now, you probably won\u0027t ever meet one again. That sort of business is something we can all do without.\"\n Tally looked at her father, and for a moment she saw something other than wisdom and confidence in his expression. It was almost too easy the way Sol laughed off Special Circumstances, dismissing everything that went on outside the city. For the first time in her life, Tally found herself listening to a middle pretty without being completely reassured, a realization that made her dizzy. And she couldn\u0027t shake the thought that Sol knew nothing about the outside world Shay had fled to.\n Maybe most people just didn\u0027twant to know. Tally had been taught all about the Rusties and early history, but at school they never said a single thing about people living outside the cities right now, people like David. Until she\u0027d met Shay, Tally had never thought about it either.\n But she couldn\u0027t dismiss the whole thing the way her father had.\n And she had made Shay a solemn promise. Even if she was just an ugly, a promise was a promise.\n \"Guys, I\u0027m going to have to think about this.\"\n For a moment, an awkward silence filled the room. She\u0027d said something they hadn\u0027t expected.\n Then Ellie laughed and patted her hand. \"Well, of course you do, Tally.\"\n Sol nodded, back in command. \"We know you\u0027ll do the right thing.\"\n \"Sure. But in the meantime,\" Tally said, \"maybe I could come home with you?\"\n Her parents shared another look of surprise.\n \"I mean, it\u0027s really weird being here now. Everyone knows that I...I\u0027m not scheduled for classes anymore, so it would just be like coming home for autumn break, but a little early.\"\n Sol recovered first, and patted her shoulder. \"Now, Tally, don\u0027t you think it would be even stranger for you out in Crumblyville? I mean, there\u0027s no other kids out there this time of year.\"\n \"You\u0027re much better off here with the other children, darling,\" Ellie added. \"You\u0027re only a few months older than some of them. And goodness, we don\u0027t have your room ready at all!\"\n \"I don\u0027t care. Nothing could be worse than this,\" Tally said.\n \"Oh, just order up some more clothes, and get that wallscreen back the way you want it,\" Sol said.\n \"I didn\u0027t mean the room - \"\n \"In any case,\" Ellie interrupted, \"why make a fuss? This\u0027ll all be over in no time. Just have a nice chat with Special Circumstances, tell them everything, and you\u0027ll be headed where you really want to be.\"\n They all looked out the window at the towers of New Pretty Town.\n \"I guess so.\"\n \"Sweetheart,\" Ellie said, patting her leg, \"what other choice do you have?\" \n","sourceLink":"https://allnovel.net/uglies-uglies-1/page-14.html","bookId":1573,"book":{"id":1573,"title":"Uglies (Uglies #1)","description":"Storyline: \n Uglies (Uglies #1) \n Tally Youngblood is about to turn sixteen, and she can\u0027t wait for the operation that turns everyone from a repellent ugly into a stunningly attractive pretty and catapults you into a high-tech paradise where your only job is to party. But new friend Shay would rather hoverboard to \"the Smoke\" and be free. Tally learns about a whole new side of the pretty world and it isn\u0027t very pretty. The \"Special Circumstances\" authority Dr Cable offers Tally the worst choice she can imagine: find her friend and turn her in, or never turn pretty at all. The choice Tally makes changes her world forever.\n \n","cover":"https://allnovel.net/images/uglies-uglies-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/uglies-uglies-1.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:51:31 PM"}}
