{"id":110177,"no":15,"title":"Page 15","content":"Peris\\n\\n During the daytime, she hid in her room.\\n\\n Going anywhere else was pure torture. The uglies in her own dorm treated her like a walking disease, and anyone else who recognized her sooner or later asked, \"Why aren\u0027t you pretty yet?\"\\n\\n It was strange. She\u0027d been an ugly for four years, but a few extra days had brought home to her exactly what the word really meant. Tally peered into her mirror all day, noting every flaw, every deformity. Her thin lips pursed with unhappiness. Her hair grew even frizzier because she kept running her hands through it in frustration. A trio of zits exploded across her forehead, as if marking the days since her sixteenth birthday. Her watery, too-small eyes glared back at her, full of anger.\\n\\n Only at night could she escape from the tiny room, the nervous stares, her own ugly face.\\n\\n She fooled the minders and climbed out as usual, but she didn\u0027t feel much like any real tricks. There was no one to visit, no one to play a prank on, and the idea of crossing the river was too painful to consider.\\n\\n She had gotten a new hoverboard, and tricked it up like Shay had taught her, so at least she could fly at night.\\n\\n But flying didn\u0027t feel the same. She was alone, it was getting cold at night, and no matter how fast she flew, Tally was trapped, and she knew it.\\n\\n The fourth night in ugly exile she took her board up into the greenbelt, staying at the edge of town. She whipped it back and forth past the dark columns of tree trunks, shooting through them at top speed, so fast that her hands and face collected dozens of scratches from the branches blurring by.\\n\\n After a few hours\u0027 flying had worn away some of her anguish, Tally had a happy realization: This was the best she\u0027d ever ridden; she was almost as good as Shay now. Never once did the board dump her for getting too close to a tree, and her shoes held on to its grippy surface like they were glued there. She worked up a sweat even in the autumn chill, riding until her legs were tired, her ankles aching, her arms sore from being spread out like wings guiding her through the dark forest. If she rode this hard all night, Tally thought, maybe tomorrow she could sleep the hideous daylight away.\\n\\n She flew until exhaustion forced her home.\\n\\n When she crawled back into her room at dawn, someone was waiting there.\\n\\n \"Peris!\"\\n\\n His features burst into a radiant smile, big eyes flashing beautifully in the early light. But when he looked closer, his expression changed. \"What happened to your face, Squint?\"\\n\\n Tally blinked. \"Haven\u0027t you heard? They didn\u0027t do the - \"\\n\\n \"Not that.\" Peris reached up and touched her cheek, which smarted under his fingertips. \"You look like you\u0027ve been juggling cats all night.\"\\n\\n \"Oh, yeah.\" Tally ran her fingers through her hair, and rummaged through a drawer. She pulled a medspray out, closed her eyes, and squirted herself in the face.\\n\\n \"Ow!\" she yelped in the few seconds before the anesthetic kicked in. She sprayed her scratched hands as well. \"Just a little midnight hoverboarding.\"\\n\\n \"A little past midnight, don\u0027t you think?\"\\n\\n Out the window, the sun was just beginning to turn the towers of New Pretty Town pink. Cat-vomit pink. She looked at Peris, exhausted and confused. \"How long have you been here?\"\\n\\n He shifted uncomfortably in her window chair. \"Long enough.\"\\n\\n \"Sorry. I didn\u0027t know you were coming.\"\\n\\n He raised his eyebrows in beautiful anguish. \"Of course I came. The moment I figured out where you were, I came.\"\\n\\n Tally turned away, unlacing her grippy shoes as she collected herself. She\u0027d felt so abandoned since her birthday, it had never occurred to her that Peris would want to see her, especially not here in Uglyville.\\n\\n But here he was, worried, anxious, lovely.\\n\\n \"It\u0027s good to see you,\" she said, feeling tears come into her eyes. They were red and puffy most of the time these days.\\n\\n He beamed up at her. \"You too.\"\\n\\n The thought of what she must look like was too much. Tally collapsed onto the bed, covering her face with her hands and sobbing. Peris sat next to her and held her for a while as she cried, then wiped her nose and sat her up. \"Look at you, Tally Youngblood.\"\\n\\n She shook her head. \"Please don\u0027t.\"\\n\\n \"You\u0027re an absolute mess.\"\\n\\n Peris found a brush and ran it through her hair. She couldn\u0027t meet his eyes, and stared at the floor.\\n\\n \"So, do you always go hoverboarding in a blender?\"\\n\\n She shook her head, lightly touching the scratches on her face. \"Just tree branches. At high speed.\"\\n\\n \"Oh, so getting yourself killed is your next brilliant trick. I guess that would just about top your current one.\"\\n\\n \"My current what?\"\\n\\n Peris rolled his eyes. \"This whole trick where you haven\u0027t turned pretty yet. Very mysterious.\"\\n\\n \"Yeah. Some trick.\"\\n\\n \"When didyou get modest, Squint? All my friends are fascinated.\"\\n\\n She turned her puffy eyes to her friend, trying to figure out if he was kidding.\\n\\n \"I mean, I already told everyone about you after that fire alarm thing, but they\u0027rereally dying to meet you now,\" he continued. \"There\u0027s even a rumor that Special Circumstances is involved.\"\\n\\n Tally blinked. Peris was serious.\\n\\n \"Well, that\u0027s true,\" she said. \"They\u0027re the reason I\u0027m still ugly.\"\\n\\n Peris\u0027s big eyes widened even more. \"Really? That is so bubbly!\"\\n\\n She sat up and frowned. \"Dideveryone know about them but me?\"\\n\\n \"Well, I had no idea what anyone was talking about. Apparently, Specials are like gremlins; you blame them when anything weird happens. Some people think they\u0027re totally bogus, and no one I know has actuallyseen a Special.\"\\n\\n Tally sighed. \"Just my luck, I guess.\"\\n\\n \"So they\u0027re real?\" Peris lowered his voice to a whisper. \"Do they really look different? You know,not pretty.\"\\n\\n \"It\u0027s not that they\u0027re not pretty, Peris. But they\u0027re really...\" Tally looked at him, gorgeous and hanging on every word. It felt so perfect to be sitting next to him, talking and touching, as if they\u0027d never been apart. She smiled. \"They\u0027re just not as pretty as you.\"\\n\\n He laughed. \"You\u0027ll have to tell me all about it. But don\u0027t you dare tell anyone else. Not yet. Everyone\u0027s going to be so intrigued. We can throw a big party when you get yourself prettied up.\"\\n\\n She tried to smile. \"Peris...\"\\n\\n \"I know, you\u0027re probably not supposed to talk about it. But once you\u0027re across the river, just drop a few hints about Special-you-know-what and you\u0027ll get invited to all the parties! Just make sure you take me with you.\" He leaned closer. \"There\u0027s even a rumor that all the bubbly jobs go to people who had tricky records as kids. But that\u0027s years from now. The main thing is to get you pretty already.\"\\n\\n \"But, Peris,\" she said, her stomach starting to hurt. \"I don\u0027t think I\u0027ll...\"\\n\\n \"You\u0027ll love it, Tally. Being pretty\u0027s the best thing ever. And I\u0027ll enjoy it about a million times more once you\u0027re there with me.\"\\n\\n \"I can\u0027t.\"\\n\\n He frowned. \"Can\u0027t what?\"\\n\\n Tally looked up at Peris, clutching his hand. \"You see, they want me to tattle on a friend of mine.\\n\\n Someone I got to know really well. After you left.\"\\n\\n \"Tattle? Don\u0027t tell me this is all about some ugly-trick.\"\\n\\n \"Sort of.\"\\n\\n \"So, tattle away. How big a deal can it be?\"\\n\\n Tally turned away. \"It\u0027s important, Peris. It\u0027s more than a trick. I made my friend a promise that I\u0027d keep a secret for her.\"\\n\\n His eyes narrowed, and for a moment he looked like the old Peris: serious, thoughtful, even a little bit unhappy. \"Tally, you made me a promise too.\"\\n\\n She swallowed and stared back at him. His eyes shone with tears.\\n\\n \"You promised you wouldn\u0027t do anything stupid, Tally. That you\u0027d be with me soon. That we\u0027d be pretty together.\"\\n\\n She touched the scar on her palm, still there, even though Peris\u0027s had been rubbed away. He reached over and held her hand. \"Best friends forever, Tally.\"\\n\\n She knew that if she looked into his eyes again, it would be all over. One glance, and her resistance would evaporate. \"Best friends forever?\" she said.\\n\\n \"Forever.\"\\n\\n She took a deep breath and let herself stare into his eyes. He looked so sad, so vulnerable and wounded. So perfect. Tally imagined herself by his side, just as beautiful, spending every day doing nothing but talking and laughing and having fun.\\n\\n \"You\u0027ll keep your promise, Tally?\"\\n\\n A shudder of exhaustion and relief went through her. She had it now, an excuse to break her vow. She\u0027d made that promise to Peris, just as real, before she\u0027d ever met Shay. She had known him for years, and Shay for only a few months.\\n\\n And Peris was right here, not out in some strange wilderness, and was looking at her with those eyes...\\n\\n \"Of course.\"\\n\\n \"Really?\" He smiled, and it was as bright as the daybreak outside.\\n\\n \"Yeah.\" The words came out so easily. \"I\u0027ll be there as soon as I can. I promise.\"\\n\\n He sighed and hugged her tight, rocking her softly. Tears rose up in her again.\\n\\n Peris finally released her, and looked out at the sunny day.\\n\\n \"I should go.\" He waved at the door. \"You know, before the...thingies...all wake up.\"\\n\\n \"Of course.\"\\n\\n \"It\u0027s almost past my bedtime, and you\u0027ve got a big day ahead of you.\"\\n\\n Tally nodded. She\u0027d never felt so exhausted. Her muscles ached, and her face and hands had started stinging again. But she was overwhelmed with relief. This nightmare had begun three months ago, when Peris went across the river. And soon it would end.\\n\\n \"Okay, Peris. I\u0027ll see you soon. As soon as possible.\"\\n\\n He hugged her again, kissed her salty, scratched cheeks, and whispered, \"Maybe in just a couple of days. I\u0027m so excited!\"\\n\\n He said good-bye and left, checking both ways down the corridor before departing. Tally looked out the window for another glance at Peris, and realized that a hovercar was waiting for him below. Pretties really did get whatever they wanted.\\n\\n Tally wanted nothing more than to fall asleep, but acting on her decision couldn\u0027t wait. She knew that with Peris gone, the doubts would come back again and haunt her. She couldn\u0027t stand another day like this, not knowing if her ugly purgatory would ever end. And she\u0027d promised Peris she\u0027d be with him as soon as possible.\\n\\n \"I\u0027m sorry, Shay,\" Tally said quietly.\\n\\n Then she picked up her interface ring from where it had lain on the bedside table all night, and slipped it on. \"Message to Dr. Cable, or whomever,\" she said to it. \"I\u0027ll do what you want. Just let me sleep for a while. Message over.\"\\n\\n Tally sighed, and let herself fall back onto the bed. She knew she should spray her scratches again before passing out, but the thought of moving made her whole body ache. A few dozen scratches wouldn\u0027t keep her from sleeping today. Nothing would.\\n\\n Seconds later, the room spoke. \"Reply from Dr. Cable: A car will be sent for you, arriving in twenty minutes.\"\\n\\n \"No,\" she mumbled, but realized that it would be useless to argue. Special Circumstances would come, they would wake her up, they would take her.\\n\\n Tally decided to try for a few minutes of sleep. It would be better than nothing.\\n\\n But for the next twenty minutes, she never once shut her eyes. \\n\\n","sourceLink":"https://allnovel.net/uglies-uglies-1/page-15.html","bookId":1573,"book":{"id":1573,"title":"Uglies (Uglies #1)","description":"Storyline: Uglies (Uglies #1) \\n Tally Youngblood is about to turn sixteen, and she can\u0027t wait for the operation that turns everyone from a repellent ugly into a stunningly attractive pretty and catapults you into a high-tech paradise where your only job is to party. But new friend Shay would rather hoverboard to \"the Smoke\" and be free. Tally learns about a whole new side of the pretty world and it isn\u0027t very pretty. The \"Special Circumstances\" authority Dr Cable offers Tally the worst choice she can imagine: find her friend and turn her in, or never turn pretty at all. The choice Tally makes changes her world forever.\\n","cover":"https://allnovel.net/images/uglies-uglies-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/uglies-uglies-1.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:51:31 PM"}}
