{"id":110185,"no":23,"title":"Page 23","content":"Lies\\n\\n A couple of hours after dawn, they came and got her.\\n\\n Tally saw them hiking through the orchids, four figures carrying hoverboards and dressed all in white.\\n\\n Broad white hats in a dappled pattern hid their heads, and she realized that if they ducked down into the flowers, they would practically disappear.\\n\\n These people went to a lot of trouble to stay hidden.\\n\\n As the party drew close, she recognized Shay\u0027s pigtails bobbing under one of the hats and waved frantically. Tally had planned to take the note literally and wait on the hilltop, but at the sight of her friend, she grabbed her board and dashed down to meet them.\\n\\n Infiltrator or not, Tally couldn\u0027t wait to see Shay.\\n\\n The tall, lanky form broke from the others and ran toward her, and the two embraced, laughing.\\n\\n \"Itis you! I knew it was!\"\\n\\n \"Of course it is, Shay. I couldn\u0027t stand missing you.\" Which was pretty much true.\\n\\n Shay couldn\u0027t stop smiling. \"When we spotted the helicopter last night, most people said it had to be another group. They said you\u0027d taken too long, and that I should give up.\"\\n\\n Tally tried to smile back, wondering if she hadn\u0027t made up enough time. She could hardly admit starting four daysafter her sixteenth birthday.\\n\\n \"I kind of got turned around. Could your note have been any more obscure?\"\\n\\n \"Oh.\" Shay\u0027s face fell. \"I thought you\u0027d understand it.\"\\n\\n Unable to bear Shay blaming herself, Tally shook her head. \"Actually, the note was okay. I\u0027m just a moron. And the biggest problem was when I got to the flowers. The rangers didn\u0027t see me at first, and I almost got roasted.\"\\n\\n Shay\u0027s eyes widened as she took in Tally\u0027s scratched and sunburned face, the blisters on her hands, and her patchy, scorched hair. \"Oh, Tally! You look like you went through a war zone.\"\\n\\n \"Just about.\"\\n\\n The other three uglies walked up. They stood back a bit, one boy holding a device in the air. \"She\u0027s carrying a bug,\" he said.\\n\\n Tally\u0027s heart froze. \"A what?\"\\n\\n Shay gently took Tally\u0027s board from her and handed it to the boy. He swept his device across it, nodded, and pulled one of the stabilizer fins off. \"Here it is.\"\\n\\n \"They sometimes put trackers on the long-range boards,\" Shay said. \"Trying to find the Smoke.\"\\n\\n \"Oh, I\u0027m really...I didn\u0027t know. I swear!\"\\n\\n \"Relax, Tally,\" the boy said. \"It\u0027s not your fault. Shay\u0027s board had one too. That\u0027s why we meet you newbies down here.\" He held up the bug. \"We\u0027ll take it away in some random direction and stick it on a migrating bird. See how the Specials like South America.\" The Smokies all laughed.\\n\\n He stepped closer and swept the device up and down her body. Tally flinched when it passed close to the pendant. But he smiled. \"It\u0027s okay. You\u0027re clean.\"\\n\\n Tally sighed with relief. Of course, she hadn\u0027t activated the pendant yet, so his device couldn\u0027t detect it.\\n\\n The other bug was just Dr. Cable\u0027s way of misleading the Smokies, getting them to drop their guard.\\n\\n Tally herself was the real danger.\\n\\n Shay stepped up next to the boy, taking his hand in hers. \"Tally, this is David.\"\\n\\n The boy smiled again. He was an ugly, but he had a nice smile. And his face held a kind of confidence that Tally had never seen in an ugly before. Maybe he was a few years older than she was. Tally had never watched anyone mature naturally past age sixteen. She wondered how much of being ugly was just an awkward age.\\n\\n Of course, David was hardly a pretty. His smile was crooked, and his forehead too high. But, uglies or not, it was good to see Shay, David - all of them. Except for a couple of stunned hours with the rangers, she hadn\u0027t seen human faces in what seemed like years.\\n\\n \"So, what\u0027ve you got?\"\\n\\n \"Huh?\"\\n\\n Croy was one of the other uglies who\u0027d come to meet her. He also looked older than sixteen, but it didn\u0027t suit him like it did David. Some people needed the operation more than others. He reached out a hand for her knapsack.\\n\\n \"Oh, thanks.\" Her shoulders were sore from being strapped to the thing for the last week.\\n\\n He pulled it open as they hiked, looking inside. \"Purifier. Position-finder.\" Croy pulled out the waterproof bag and opened it. \"SpagBol! Yum!\"\\n\\n Tally groaned. \"You can have it.\"\\n\\n His eyes widened. \"I can?\"\\n\\n Shay pulled the knapsack away from him. \"No, you can\u0027t.\"\\n\\n \"Listen, I\u0027ve eaten that stuff three times a day for the past...what seems like forever,\" Tally said.\\n\\n \"Yeah, but dehydrated food\u0027s hard to get in the Smoke,\" Shay explained. \"You should save it to trade.\"\\n\\n \"Trade?\" Tally frowned. \"What do you mean?\" In the city, uglies might trade chores or stuff they\u0027d stolen, but tradefood ?\\n\\n Shay laughed. \"You\u0027ll get used to the idea. In the Smoke, things don\u0027t just come out of the wall. You\u0027ve got to hang on to the stuff you brought with you. Don\u0027t go giving it away to anyone who asks.\" Shay glared at Croy, who looked down sheepishly.\\n\\n \"I was going to give her something for it,\" he insisted.\\n\\n \"Sure you were,\" David said.\\n\\n Tally noticed his hand on Shay\u0027s shoulder, touching her softly as they hiked. She remembered the way Shay had always talked about David, kind of dreamily. Maybe it wasn\u0027t just the promise of freedom that had brought her friend here.\\n\\n They reached the edge of the flowers, a dense growth of trees and brush that started at the foot of a towering mountain.\\n\\n \"How do you keep the orchids from spreading?\" Tally asked.\\n\\n David\u0027s eyes lit up, as if this was his favorite subject. \"This old-growth forest stops them. It\u0027s been around for centuries, probably even before the Rusties.\"\\n\\n \"It\u0027s got lots and lots of species,\" Shay said. \"So it\u0027s strong enough to keep out the weed.\" She looked at David for approval.\\n\\n \"The rest of this land used to be farms or grazing pasture,\" he continued, gesturing back at the expanse of white behind them. \"The Rusties had already broken its back before the weed arrived.\"\\n\\n A few minutes into the forest, Tally realized why the orchids were no match for it. The tangled brush and thick trees were knotted together into an impassable wall on either side. Even on the narrow path, she was constantly shoving past branches and twigs, tripping over roots and rocks. She\u0027d never seen any woodlands this raw and inhospitable. Vines dotted with cruel thorns ran through the semidarkness like barbed wire. \"You guyslive in here?\"\\n\\n Shay laughed. \"Don\u0027t worry. We\u0027ve got a ways to go. We\u0027re just making sure you weren\u0027t followed.\\n\\n The Smoke\u0027s much higher, where the trees aren\u0027t so intense. But the creek\u0027s coming up. We\u0027ll be on board soon.\"\\n\\n \"Good,\" Tally said. Her feet were already chafing in the new shoes. But they were warmer than her destroyed grippies, she realized, and were better for hiking. She wondered what would have happened if the rangers hadn\u0027t given them to her. How did you get new shoes in the Smoke? Trade someone all your food? Make them yourself? She looked down at the feet ahead of her, David\u0027s, and saw that his shoes did look handmade, like a couple of pieces of leather crudely sewn together. Strangely, though, he moved gracefully through the undergrowth, silent and sure while the rest of them crashed along like elephants.\\n\\n The very idea of making a pair of shoes by hand boggled her mind.\\n\\n It didn\u0027t matter, Tally reminded herself, taking a deep breath. Once in the Smoke, she could activate the pendant and be home within a day, maybe within hours. All the food and clothes she would ever need, hers for the asking. Her face pretty at long last, and Peris and all their old friends around her.\\n\\n Finally, this nightmare would be over.\\n\\n Soon, the sound of running water filled the forest, and they reached a small clearing. David pulled his device out again, pointing it back toward the path. \"Still nothing.\" He grinned at Tally. \"Congratulations, you\u0027re one of us now.\"\\n\\n Shay giggled and hugged Tally again as the others readied their boards. \"I still can\u0027t believe you came. I thought I\u0027d messed everything up, waiting so long to tell you about running away. And I was so stupid, getting into a fight instead of just telling you what I was going to do.\"\\n\\n Tally shook her head. \"You\u0027d said everything already, I just wasn\u0027t listening. Once I realized you were serious, I needed a chance to think about it. It just took me a while...every minute, until the last night before my birthday.\" She took a deep breath, wondering why she was saying all this, lying to Shay when she didn\u0027t really have to. She should just shut up, get to the Smoke, and get it over with. But Tally found herself continuing. \"Then I realized I\u0027d never see you again if I didn\u0027t come. And I\u0027d always wonder.\"\\n\\n That last part was true, at least.\\n\\n As they boarded higher up into the mountain the creek widened, cutting an archway of trees into the dense forest. The gnarled, smaller trees became taller pines, the undergrowth thinning, the brook breaking into occasional rapids. Shay cried out as she rode through the spray of churning white water.\\n\\n \"I\u0027ve been dying to show you this! And thereally good rapids are on the other side.\"\\n\\n Eventually, they left the creek, following a vein of iron over a ridge. From the top, they looked down into a small valley that was mostly clear of forest.\\n\\n Shay held Tally\u0027s hand. \"There it is. Home.\"\\n\\n The Smoke lay below them. \\n\\n","sourceLink":"https://allnovel.net/uglies-uglies-1/page-23.html","bookId":1573,"book":{"id":1573,"title":"Uglies (Uglies #1)","description":"Storyline: Uglies (Uglies #1) \\n Tally Youngblood is about to turn sixteen, and she can\u0027t wait for the operation that turns everyone from a repellent ugly into a stunningly attractive pretty and catapults you into a high-tech paradise where your only job is to party. But new friend Shay would rather hoverboard to \"the Smoke\" and be free. Tally learns about a whole new side of the pretty world and it isn\u0027t very pretty. The \"Special Circumstances\" authority Dr Cable offers Tally the worst choice she can imagine: find her friend and turn her in, or never turn pretty at all. The choice Tally makes changes her world forever.\\n","cover":"https://allnovel.net/images/uglies-uglies-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/uglies-uglies-1.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:51:31 PM"}}
