{"id":32833,"no":9,"title":"CHAPTER VIII","content":"PROMOTERS OF CRIME—PEOPLE WHO PLAN ROBBERIES AND ACT AS \"BACKERS\" FOR PROFESSIONAL CRIMINALS; THE EXTRAORDINARY \"MOTHER\" MANDELBAUM, \"QUEEN OF THE THIEVES,\" AND GRADY, WHO HAD HALF A DOZEN GANGS OF CRACKSMEN WORKING FOR HIM If there is any one familiar adage that fits every criminal in the underworld it is \"Easy come, easy go.\" Surely there is a curse on stolen money. More than once in my former life I have received $50,000 as my share in a Sunday morning bank burglary—and by the next Saturday night not even a five-dollar bill remained. Professional thieves are rich one day and poor the next. The fact that more money is always to be had without the hard labor which brings honest reward makes thieves as improvident as children. All thieves are gamblers—scarcely in all my acquaintances can I recall even one exception. Sometimes the entire proceeds of a robbery are lost in a gambling house within twenty-four hours after the crime. And this is how it has come about that all over the world, in every big city, there are \"backers\" of thieves; men, and sometimes women, who take the stolen goods off their hands, find hiding places for criminals who are being pursued, advance money[Pg 187] to them when they are out of funds, and even pay the expenses of their families when the burglars get into prison. Some of these friends of thieves are really promoters of criminal enterprises. They name the banks and jewelry shops that are to be robbed and select the residences of wealthy persons that are to be entered. They are like the backers of theatrical enterprises who put up the money for the necessary expenses and advance the salaries of the actors; they are like the promoters in the mining world who pay for the tools, the pack animals, and who \"grub-stake\" the miners to outfit them on prospecting tours in the mountains. QUEEN OF THE THIEVES Curiously enough the greatest crime promoter of modern times was a New York woman, \"Mother\" Mandelbaum. Alas! I knew her well—too well. A hundred, yes, perhaps near five hundred transactions I have had with her, little and big. Many were entirely on my own account, oftentimes I dealt with her in behalf of thieves who were in hiding or in need of help or were in jail. MOTHER MANDELBAUM\u0027S FAKE CHIMNEY AND SECRET HIDING PLACE FOR STOLEN JEWELS \"MOTHER\" MANDELBAUM\u0027S FAKE CHIMNEY AND SECRET HIDING PLACE FOR STOLEN JEWELS. Nobody anywhere did such a wholesale business in stolen goods or had such valuable associations among big criminals. \"Mother\" Mandelbaum, of course, cracked no safes, she did not risk her skin in house burglaries, her fat hand was never caught in anybody\u0027s pocket, no policeman\u0027s bullet was ever[Pg 188] sent after her fleeing figure. Here, then, we have a dealer in crime pretty shrewdly protected from the dangers that beset criminals. And yet I shall once again prove to my readers and from this very woman who was the uncrowned \"Queen of the Thieves,\" rich, powerful, and protected by the police—from this very \"Mother\" Mandelbaum I shall again show that CRIME DOES NOT PAY! But was this woman exceptionally unlucky? No. I will recount to you also the career of John D. Grady, her very remarkable rival in the same field of criminal promotion—the man who financed the great $3,000,000 Manhattan Bank robbery and had the famous Jimmy Hope and his band of expert cracksmen in his employ. From Grady I will also prove the great moral truth that surely CRIME DOES NOT PAY! \"Mother\" Mandelbaum\u0027s real name was Mrs. William Mandelbaum. She was born in Germany of poor but respectable parentage. As a young woman she arrived in America without a friend or relative. But her coarse, heavy features, powerful physique, and penetrating eye were sufficient protection and chaperone for anyone. It is not likely that anyone ever forced unwelcome attentions on this particular immigrant. Arrived in New York she was compelled to pawn one or two gold trinkets while looking for work. This brought her in touch with the flourishing pawnshop business. [Pg 189] ENCOURAGING PICKPOCKETS The pawn shops were practically unregulated by law in those days and the German girl\u0027s painful experience as a customer, instead of making her angry, impressed her with great admiration. There was a field for an ambitious person, and if ambition is a virtue none was ever more virtuous in that particular than \"Mother.\" But how to enter this profitable industry was the question. To be a pawn-broker has always required capital. That is, it always has for anyone but this woman, who had none. She made a hurried survey of the pawn shops along the Bowery and elsewhere, and among others noticed the place of one William Mandelbaum. William was unmarried, rather weak willed for a man of his calling, lazy, and afflicted with chronic dyspepsia. He cooked his own meals over a kerosene lamp, which was undoubtedly the cause of his indigestion. \"Mother\" Mandelbaum introduced herself as Fredericka Goldberg, and offered to cook and tend store at nominal wages. The \"nominal wages\" item secured her the position and the cooking made her firm in it. Within a week, William\u0027s digestion was better than he could ever remember since boyhood; he had gained seven pounds in weight and business was growing beautifully—all on account of the capable Fredericka. At the end of the week, William and Fredericka had a business talk. Fredericka didn\u0027t want an [Pg 190]increase in wages. She didn\u0027t want any wages at all. It was partnership or nothing. William ate one meal cooked by himself and then surrendered. Within a few weeks they were married. Mrs. Mandelbaum forever afterward was the head of the house of Mandelbaum. Among her customers Mrs. Mandelbaum noticed an occasional one who would hurry in and get what he could on a miscellany of watches and small pieces of jewelry. These hasty, furtive young men and boys took what they could get and showed little disposition to haggle. Also, they never returned to redeem their pledges. Mrs. Mandelbaum\u0027s Special Devices for Dealing with Thieves, and the Secret Trap-Door Escape Mrs. Mandelbaum\u0027s Special Devices for Dealing with Thieves, and the Secret Trap-Door Escape. If ever anybody lived in the proverbial \"glass house,\" surely it was \"Mother\" Mandelbaum—and she knew it. Her establishment was ostensibly a general store and a pawnbroker\u0027s office, which she maintained in the front room (B), but Mrs. Mandelbaum also dealt in stolen goods of all kinds and planned robberies with thieves, and often sheltered, protected, and hid thieves in times of trouble. \"Mother\" Mandelbaum was never seen in the front room (B), where a clerk was always kept on guard. She kept out of reach behind the window with the steel grating (A). Her false chimney and secret dumb-waiter arrangement was at the point (C). In the room (D) \"Mother\" Mandelbaum kept two or three employees busy removing stolen jewels from their settings and engraving designs to cover up and hide monograms and identification marks on watches, jewelry, and silverware. In the room (E) were kept bulky articles and stolen goods, such as fur coats, etc. Here, too, the price tags, factory numbers and other marks were always removed from stolen furs, laces and silks. The room (F) contained beds where thieves were lodged when occasion demanded. The room (H) was a store room, where crates and cases of stolen goods were packed up for shipment to her customers. At the end of the passageway leading to the room (H) was a secret trap door (G). In case of a raid by the police, and if her front and back doors were guarded by detectives, she could use the trap door (G) to let thieves escape down through a hole in the basement wall, which led up into the house next door, which \"Mother\" Mandelbaum also owned under another name. The new head of the house encouraged these customers, who were, of course, pickpockets. At first, through ignorance, and later, as a matter of policy, Mrs. Mandelbaum was more liberal in her terms than was customary. Some pawn-brokers would not accept anything from a pickpocket if they knew it. The others took advantage of the pickpocket\u0027s peril of the law to drive the hardest possible terms. It was not long before Mandelbaum\u0027s had the lion\u0027s share of the pickpocket business. One who disposes of stolen goods is known as a \"fence,\" and Mrs. Mandelbaum soon became one of the most important \"fences\" for pickpockets in the city. As the pawn shop grew more and more notorious, the weight of the police grew heavier and heavier on the proprietress. She dealt less liberally with pickpockets than before. She squeezed them to the[Pg 191] last notch, but they still remained her customers for she was no harder than the other fences. In order to meet the ever increasing blackmail of the police, Mrs. Mandelbaum found it necessary to steadily enlarge her business. Carefully she developed a system for scattering her stock so that her New York headquarters never contained a very large stock of stolen goods. She kept men busy melting down gold and silver and disguising jewelry and others ferreting out supposedly honest merchants who were willing to buy her wares and ask no questions. It must always be borne in mind in these articles that crime cannot be carried on by individuals. It requires an elaborate permanent organization. While the individual operators, from pickpockets to bank burglars, come and go, working from coast to coast, they must be affiliated with some permanent substantial person who is in touch with the police. Such a permanent head was \"Mother\" Mandelbaum. The field of usefulness to thieves of the big \"fences\" like \"Mother\" Mandelbaum and Grady are infinite. Suppose you are a burglar and last night\u0027s labors resulted mostly in jewelry and silverware, you would have neither the time nor the plant to melt down the silver and disguise or unset the stones. \"Mother\" Mandelbaum would attend to all that for you on about a 75 per cent. commission. This wonderful woman kept certain persons busy on salary melting down silver. Others worked [Pg 192]steadily altering, unsetting, and otherwise disguising jewelry. What would you do with a stolen watch which bore, deeply engraved on the back, the name and address of its rightful owner? You might melt down the case and get a little something for the works, but \"Mother\" would do better. She would turn it over to one of her engravers who would rapidly and not inartistically engrave a little scene or decoration on the watch case, completely masking the name and address. A stolen automobile is the worst kind of a \"white elephant\" on your hands unless you know where to take it. Every city has its plants where a stolen car is quickly made over, usually into a taxicab, and so well disguised that its former owner may pay for a ride in it without suspicion. The force of artisans and mechanics employed on the fruits of burglaries and pocket picking is several thousand in a city the size of New York or Chicago. All burglars and thieves are busy with their own enterprises, and have no time to look after all these matters. Somebody there must be who will organize these first aids to the captured criminals—the \"squarers of squealers,\" the lawyers, the men to provide bail, etc. Such a one was \"Mother\" Mandelbaum. Hacks, taxicabs, express wagons, and even moving vans must be readily available. Peddlers are extremely useful. They prowl about wherever they[Pg 193] please and act as advance men for the burglars. Keeping peddlers and tramps off your premises is one of the best forms of burglar insurance. The army of enemies of society must have its general, and I believe that probably the greatest of them all was \"Mother\" Mandelbaum. ROBBING TIFFANY Of all the stolen things brought into her shop, Mrs. Mandelbaum preferred diamonds. She rapidly became an expert on stones and they presented few difficulties. A stone once outside its setting usually bears no \"earmarks\" by which it can be identified. Nothing is so easily hidden nor so imperishable as a diamond, and, as everyone knows, they have an unfailing market. She exhorted her pickpocket customers to specialize on stickpins, and doubtless they did their best to please her. While pickpockets are \"pickers,\" they cannot always be choosers, and the percentage of diamonds remained disappointingly low. This interest in diamonds brought the \"fence\" to visit Tiffany\u0027s several times. She stole nothing, in fact, I am sure \"Mother\" never stole anything in her life. But it cost her nothing to examine and admire the beautiful stones, and during one of her visits she was struck with an ingenious idea which marked the second step in her career. She planned a robbery. In the rear of the Mandelbaum store a [Pg 194]consultation was held between the proprietress, a confidence man known as \"Swell\" Robinson, and a shoplifter, just arrived from Chicago, by the name of Mary Wallenstein. Robinson, as his name would indicate, was a man of good clothes and presence. He walked into Tiffany\u0027s, went to the diamond counter, and spent a long time examining the big stones. After about twenty minutes of questioning he was unable to make up his mind and decided to think the matter over and return later. One of the stones valued at about $8,000 was missing, and the clerk very apologetically asked Robinson to wait a moment while he searched for it. A dozen employees hunted and counted the stones while Robinson grew more and more indignant at the evident suspicion that he had taken the stone. At last things came to a head and Robinson was led to a room and searched. Nothing was found and the store, knowing they had been somehow robbed, were compelled to let him go. The excitement had not quieted down when Mary appeared. She went to the same counter and stood exactly where Robinson had been. She examined one or two small diamonds and, like Robinson, she concluded to go home and think it over. There was no objection made, for there was nothing missing this time. An hour later she handed the $8,000 gem to \"Mother\" Mandelbaum. The following morning the man who polished the[Pg 195] counters at Tiffany\u0027s found a piece of chewing gum wedged underneath the counter where nobody would see it. Inspection of the gum revealed the impression of the facets of a diamond of the general size of the missing stone. Then everyone understood. The man had placed the gum beneath the counter when he came in. At his first opportunity he stuck the diamond in it. The girl coming in later had only to feel along the counter and remove the gem to make the theft complete. This first robbery planned by \"Mother\" Mandelbaum was so delightfully successful that the pickpocket industry seemed slow by comparison. The chewing gum trick could not be worked again, because the jewelers\u0027 association had notified all its members of the new scheme. It was a short step from jewel-stealing to sneak-thief operations in banks. Sneak thieves and confidence men began to frequent the back rooms of the Mandelbaum establishment. It became a clearing house for crimes of larceny—big and small. Many able and successful burglars are unimaginative, and, left to their own devices, would never discover anything to rob. These earnest but unimaginative souls hung about the premises as if it were an employment agency waiting for the \"boss\" to find a job suited to their particular talents. DRY GOODS STORE THIEVES On the other hand, timid but shrewd and observant persons frequently saw chances to steal which[Pg 196] they dared not undertake. Servants of wealthy New York families learned that \"Mother\" Mandelbaum paid well for tips and plans of houses. Next came employees of wholesale and retail dry goods houses. To handle bales of silk and woolen, furs, blankets, and other bulky but valuable merchandise presented new problems. To meet these Mrs. Mandelbaum moved her establishment to larger quarters. She retained the pawnbroking department, but added a miscellaneous store, in which she carried for sale most all the articles found in a country store. She was now the mother of three children, two daughters and a son—Julius. One of the daughters married a Twelfth Ward Tammany politician. This political alliance was extremely valuable. It made the police more moderate in their extortion for immunity, and was the means of obtaining pardons, light sentences, and general miscarriage of justice on the part of judges. I shall never forget the atmosphere of \"Mother\" Mandelbaum\u0027s place on the corner of Clinton and Rivington Streets. In the front was the general store, innocent enough in appearance; and, in fact, the goods were only part stolen, and these of such a character that they could not possibly be identified. \"Mother\" Mandelbaum led a life which left her open to many dangers from many different directions. Every member of the underworld knew that stolen goods of great value were constantly coming[Pg 197] into her resort and from time to time schemes were devised to plunder the famous old \"fence.\" Mrs. Mandelbaum always sat inside of a window which was protected by strong steel slats. The door to the room was of heavy oak. It was impossible, thus protected, for anybody to make a sudden rush and catch \"Mother\" Mandelbaum off her guard. But, realizing that thieves might at any moment raid her establishment and finally force their way into her den, she provided still another safeguard. THE SECRET OF THE CHIMNEY \"Mother\" Mandelbaum had a special chimney built in her den, where she kept a little wood fire burning during the winter and kept the fireplace filled with old trash during the hot season. This chimney was peculiarly constructed, and had a false back behind the fire, and in this cavity was hidden a little dumb-waiter. In front of the dumb-waiter was a false iron chimney back on a hinge that could be let down. She constructed a special brick wall so that it appeared to be the regular wall of the house. In case of sudden emergency, \"Mother\" Mandelbaum could gather up any diamonds or stolen goods which might be incriminating, pull down the false chimney back, which fell down over the fire, stow away the telltale valuable in the hidden dumb-waiter, push the dumb-waiter up out of sight into[Pg 198] the chimney, and push back into place the false chimney back. This simple operation concluded, \"Mother\" Mandelbaum was then ready to face a search or a holdup. If ever anybody lived in the proverbial \"glass house,\" surely it was \"Mother\" Mandelbaum—and she knew it. Her establishment was ostensibly a general store and a pawnbroker\u0027s office, which she maintained in the front room, but Mrs. Mandelbaum also dealt in stolen goods of all kinds and planned robberies with thieves and often sheltered, protected, and hid thieves in times of trouble. \"Mother\" Mandelbaum was never seen in the front room, where a clerk was always kept on guard. She kept out of reach in an inside room, behind the window with the steel grating. Her false chimney and secret dumb-waiter arrangement, as already explained, was in this room. In another room, \"Mother\" Mandelbaum kept two or three employees busy removing stolen jewels from their settings and engraving designs to cover up and hide monograms and identification marks on watches, jewelry, and silverware. \"MOTHER\u0027S\" GLASS HOUSE In an adjoining room were kept bulky articles and stolen goods, such as fur coats, etc. Here, too, the price tags, factory numbers, and other marks were always removed from stolen furs, laces, and silks. One of the back rooms contained beds where thieves were lodged when occasion demanded. Still[Pg 199] another room was a store room where crates and cases of stolen goods were packed up for shipment to her customers. At the end of the passageway leading to one of the rooms was a secret trap door. In case of a raid by the police, and if her front and back doors were guarded by detectives, she could use the trap door to let thieves escape down through a hole in the basement wall which led up into the house next door, which \"Mother\" Mandelbaum also owned under another name. Gradually \"Mother\" Mandelbaum\u0027s clientele of crooks increased in number and importance until she had only one real rival, John D. Grady, known as \"Old Supers and Slangs.\" Grady had a more distinguished body of bank burglars under his sway than had \"Mother.\" Bank burglars are the aristocrats of the underworld, just as pickpockets are the lowest. When the Manhattan Bank robbery was planned and executed, \"Mother\" Mandelbaum was much humiliated that she could not command the financing and planning of the splendid project. It was Grady\u0027s funds which financed the undertaking, and poor \"Mother\" lost her one pet and star, \"Western George\" Howard. Howard, in many ways, was the greatest of bank burglars, and he was rated by many as superior to Grady\u0027s Jimmy Hope. In another chapter I told you how \"Western George\" made the Manhattan Bank robbery possible and then was murdered. After Grady\u0027s tragic death, \"Mother\" [Pg 200]Mandelbaum was the undisputed financier, guide, counsellor, and friend of crime in New York. For twenty-five years she lived on the proceeds of other people\u0027s crimes. During that time she made many millions. But these millions slipped away for the most part in bribing, fixing, and silencing people. Still she was a very wealthy, fat, ugly old woman when the blow fell. Mary Holbrook, a shoplifter and old-time ally of Mrs. Mandelbaum, had a serious row with her. This row was the beginning of \"Mother\u0027s\" end. Soon after Mary was arrested, and, of course, applied for help from the usual source. Not a cent would the old woman give her for bail, counsel fees, or even for special meals in the Tombs. Mary was desperate, and sent for the District Attorney. It just happened that District Attorney Olney was an honest man. He listened to Mary\u0027s tale about \"Mother\" Mandelbaum, and acted. \"Mother\" Mandelbaum, her son Julius, and Herman Stoude, one of her employees, were arrested. \"Abe\" Hummel did his best, but the indictment held, and there was a mass of evidence sure to swamp her at the trial. But \"Mother\" did not wait for the trial. She and the others \"jumped\" their bail and escaped to Canada. Here she lived a few years a wretched and broken figure, yearning and working to get back to the haunts she loved. But neither her money nor her political friends were able to secure her immunity.[Pg 201] Once she did sneak to New York for a few hours and escaped unnoticed. It was at the time of her daughter\u0027s funeral, which she watched from a distance, unable to attend publicly. Though \"Mother\" Mandelbaum had money when she died, yet she was an exiled, broken-hearted old woman, whose money did her no good. Unusually talented woman that she was, it took most of her lifetime for her to learn the lesson that crime does not pay! And now let us take a look at Grady, Mrs. Mandelbaum\u0027s great rival. Did this remarkable man find that crime paid in the long run? GRADY THE DARING John D. Grady, known to the police and the underworld as \"Old Supers and Slangs,\" probably never handled as much money or had his finger in quite so many crimes as \"Mother\" Mandelbaum. His career, too, was somewhat shorter, but it made up for these defects in the unequaled daring and magnitude of his exploits. \"Mother\" Mandelbaum \"played safe.\" Not so John D. Grady. His was a desperate game, well played for splendid stakes, with risks few men would care to take, and with all the elements of romance and a tragic death to cap it. Grady, like \"Mother\" Mandelbaum, was a \"fence,\" but, while she dealt in everything, Grady specialized in diamonds. He had an office opposite[Pg 202] the Manhattan Bank, which bore the sign, \"John D. Grady, Diamond Merchant.\" From the windows of this office, Grady, Jimmy Hope, and his gang gazed hungrily across at the bank and plotted its ruin. Up to the actual day of the robbery, Hope and Grady were in accord on all plans. Afterward the two leaders quarreled over the disposition of the bonds. Hope had his way and there is little doubt that had Grady taken charge of the two million dollars of securities he would have succeeded in selling them, whereas Hope failed. While \"Mother\" Mandelbaum was building up her trade with pickpockets and shoplifters, Grady was carrying his business about in a satchel. No man ever took greater chances. At all hours of the night this short, stocky man went about the darkest and most dangerous parts of New York. In the little black satchel, as every criminal knew, was a fortune in diamonds. When a thief had made a haul, Grady would meet him at any time or place he pleased and take the diamonds off his hands. Only once was he \"sandbagged\" and robbed of several thousand dollars worth of the stones. He took the misfortune in good part, said it was his own fault, and never took revenge on the men who robbed him. STEAM-DRILL BURGLARY While \"Mother\" Mandelbaum engineered house and dry goods store robberies, Grady set his mind[Pg 203] and energies on the great banks. As bold as the Manhattan affair was his assault on a West Side bank. The vaults of this bank were surrounded by a three-foot wall of solid concrete. Grady opened a first-class saloon next door, and as soon as he got his bearings installed a steam engine in the cellar. This engine was supposed to run the electric light dynamo and an air pump. In reality it was there to drill a hole into the bank next door. Selecting a Saturday which happened to be a holiday, he commenced operations Friday night, and there was every prospect of being inside the vault long before Monday morning. But, unfortunately, a wide-awake policeman of inquiring mind heard the unfamiliar buzzing out in the street. He prowled around and finally discovered that something unusual was going on in the cellar under the saloon. No answer coming to his knocks, he burst in the door and descended to the cellar. The thieves ran out, but two were caught in the street. Though Grady financed and planned this scheme, he escaped untouched, for there was no evidence against him. Criminals, successful and unsuccessful, rarely lack women to love them. Strangely enough, this grim, daring, successful general of crime was perpetually spurned and flouted by my sex. Finally there came to him like an angel from heaven a very beautiful, well-bred daughter of the rich. Of course, John fell in love with her—any man would have—and things looked favorable for him. [Pg 204] This woman was the young and almost penniless widow of a member of the \"four hundred.\" She had involved herself in a financial situation from which there was no honest escape. Just as servants of the rich ran to \"Mother\" Mandelbaum with their secrets, so this woman went to Grady with her inside knowledge. A sort of partnership sprang up between them which was profitable to both, but particularly to the woman, who used her sex unhesitatingly to get the better of her bargains with the cunning old master of the underworld. Grady\u0027s passion grew stronger and stronger, and the young widow, who really despised him, found it harder and harder to keep him at a distance. Finally things came to a head. Grady knew that the secret of the Manhattan Bank was soon to come out and that his position in New York would be no longer safe. He was ready to flee, but his passion for the woman had become so completely his master that he would not move without her. It was a peculiar duel of wits that followed. The woman was financially dependent on Grady and dared not hide from him nor pretend that she did not return his passion. The night came when she must either elope with him or lose his aid. The thought of either was unbearable, yet she met him in his empty house at midnight prepared. She knew that Grady would have his entire fortune with him in the form of the diamonds and her plan was nothing less than to[Pg 205] murder him and take his jewels. She had brought a little vial of poison with her and held it in trembling fingers within her muff. She knew Grady had a bottle of yellow wine, and she knew it would not be hard to have him drink a toast to their elopement. Grady produced the bottle but also only one dirty tumbler. They were both to drink from that, it seemed. The woman, at her wits\u0027 ends, glanced about the room and spied a battered tin cup. \"There,\" she cried, pointing, \"the very thing.\" GRADY\u0027S ROMANTIC DEATH While Grady went to get it she emptied the vial into the dirty glass. Grady soon poured a quantity of the yellow wine on top of it, and then filled the cup. But to her horror, he handed her the glass and took the cup. \"No, no, John,\" she gasped, \"you take the glass. I\u0027ll drink from the cup.\" \"Why,\" asked Grady, his eyes aflame with sudden suspicion, \"what\u0027s the matter?\" \"Oh, only that I left a kiss for you on the glass,\" she faltered. Grady took the glass and slowly, very slowly, he raised it toward his lips, all the while gazing unwinkingly at the woman. Just at his lips the glass stopped and the woman could not avoid a shudder, she covered her eyes and Grady, used to reading[Pg 206] people\u0027s minds, read hers. He let the glass fall and shouted: \"So, it\u0027s murder you want—well, murder it shall be, but I\u0027ll do the murdering.\" She saw death in his eyes as he seized her arm but before death he would first have his way with her. She screamed and, pulling with the strength of despair, twisted the arm out of Grady\u0027s grasp, leaving half her sleeve in his hand. Still, there could surely be no hope for her, and yet at that very instant when he poised himself to plunge after her again, his eyes turned glassy; paralysis seized him, and he sank slowly into his chair while the fainting woman tottered out of the door. The next day, it so happened, Shevelin, the watchman, confessed to his connection with the Manhattan Bank robbery. The police were just taking up the trail that led to Grady\u0027s connection with the affair when the news came to headquarters that Grady was dead. He was found with the sleeve of a woman\u0027s dress grasped convulsively in his hand. On the table were a bottle of wine and a cup. A broken glass and spilled wine on the floor showed traces of poison. CREED OF THE \"FENCES\" An autopsy performed on Grady\u0027s body showed no sign of poison. His death had been caused by apoplexy. The woman who meant to kill him by[Pg 207] poison had actually done so by means of the furious emotions she had aroused. She could have taken the diamonds had she only dared to wait. Thus died Grady, still free from the law, and with his great fortune in diamonds in his pocket. Yet he died in an agony of furious disappointment as miserably as it is the lot of man to die. For him, as for \"Mother\" Mandelbaum, it was destined that the lesson should be finally but tragically impressed—that crime does not pay! As a general thing the receiver of stolen goods is the greediest, tightest-fisted individual who ever squeezed a dollar. The bargains he drives are so one-sided that unless the thief is unusually shrewd he will find his profits dwindling to almost nothing by the time he has disposed of his plunder. The margin between what the thief gets for his stealings and the price they finally bring is enormous, and even with only a few thieves working regularly for him the \"fence\" finds it easy to get rich in a very short time. The greed of the \"fences\" is one important reason why many criminals find it difficult to reform. The more thieves a \"fence\" has working for him the greater his profits, and naturally the longer they remain in the business the more valuable they are. When a thief reforms, the \"fence\" is put to the trouble and expense of training a new man—and there is always the danger that the new member of the staff will prove less capable or industrious than the one whose place he takes. [Pg 208] The \"fence,\" therefore, tries to make crime so attractive or so necessary to the clever thief that he will continue stealing until death or arrest overtakes him. He keeps close watch for signs of a desire to reform, and does all he can to discourage it. The \"fence\" studies the special weaknesses of his thieves and understands just how to play on them to his advantage. If a thief suggests \"turning over a new leaf,\" the \"fence\" pays him more liberally for his next lot of goods, or loans him money to satisfy his craving for liquor, drugs, fine clothes, or whatever may be his failing. This last is a favorite method of getting a thief into a \"fence\u0027s\" power. The \"fence\" advances money freely, with the \"always-glad-to-help-an-old-friend\" spirit. But he keeps careful count of every dollar loaned, and when the inevitable day of reckoning comes the debt is usually so large that the thief can never hope to pay it except by crime. SHINBURN AND THE \"FENCE\" After living an honest life for fifteen years, Mark Shinburn might never have turned burglar again had he not fallen into the hands of one of these avaricious receivers of stolen goods. Shinburn—as I will tell you in a later chapter—had accumulated from his early robberies a million dollars. With this fortune he went to Belgium, bought an estate and the title of count, and settled[Pg 209] down to the life of a prosperous country gentleman. But the evil fortune which seems to follow every thief never forsook Shinburn. His mania for gambling and an unlucky series of speculations in the stock market at last left him penniless. In the hope of restoring his fallen fortunes, Shinburn went to London. There he met an old acquaintance of his—a wealthy receiver of stolen goods. This wily trickster, eager to get Shinburn, the greatest of burglars, to stealing for him again, received him with open arms. \"Glad to accommodate you, Mark,\" said the \"fence\" when a loan was suggested. \"Your word is good for whatever you need—and pay it back whenever you are able.\" The money Shinburn received in this way went where much of his original fortune had gone—at Monte Carlo. He returned to the London \"fence\" for another loan, and another—and all were willingly granted. But when he sought money the fourth time he found the \"fence\u0027s\" attitude strangely changed. HE TURNS BURGLAR AGAIN \"Really,\" said the \"fence,\" \"I don\u0027t see how I can let you have any more money. It seems peculiar that you should be in such straitened circumstances. In the old days you used to have all the money you needed—why don\u0027t you use your wits and get some now?\" [Pg 210] After touching Shinburn\u0027s pride in this crafty way, the \"fence\" casually mentioned an excellent opportunity which had come to his ears for robbing a bank in Belgium. It was, he said, a rather delicate undertaking, but there was a great deal of money involved—and Shinburn was the one man in the world who could carry it through. Shinburn\u0027s shame at being obliged to borrow money made him an easy victim of the \"fence\u0027s\" wiles. He went to Belgium, was caught in the act of entering the bank, and was sent to prison for a long term. As soon as he was released the London \"fence\" began pressing him for money, and Shinburn became a confirmed criminal again, primarily to pay this debt. And this same \"fence,\" Einstein by name, paid the penalty of his wretched practices with a bullet in his brain, which was sent there by a desperate burglar who had tried vainly to reform but was held in criminal bondage by Einstein. The promoter of crime is not always a receiver of stolen goods. Sometimes he is himself a thief, who has mastered some branch of the business so thoroughly that he is able to sit back and let others do the active work. Such a man was \"Dutch Dan\" Watson, who was long considered one of the most expert makers of duplicate keys in America. His specialty was entering buildings and taking wax impressions of the keys, which he often found hanging up in surprisingly convenient places. [Pg 211] From these impressions Watson, in his own workshop, would make the duplicate keys and file them away for future use. To each key he would attach a tag bearing the address of the building and a little diagram showing the exact location of the door which the key unlocked. \"Dutch Dan\u0027s\" active part in the proposed crime ended as soon as the keys were made. Then, from the wide circle of criminals that he knew, he would select a number of expert burglars and hand them a set of the keys and diagrams, showing just how the robbery was to be carried out. If the burglars were successful they turned over to \"Dutch Dan\" 20 per cent. of the proceeds. This mode of operation proved very profitable for Watson, and I remember that he often had as many as eight different parties of burglars working for him at one time. And Watson, like Einstein, was sent to his grave by a fellow criminal, who had been discarded from his gang and killed him in revenge. Will any reader who has reviewed with me the lives of the famous criminals recounted above dispute my assertion that, truly, CRIME DOES NOT PAY? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3194/87328.html","bookId":840,"book":{"id":840,"title":"Why Crime Does Not Pay","description":"简介： The publishers believe that a picture of life sketched by a master handsomebody who stands in the world of crime as Edison does in his field or as Morgan and Rockefeller do in theirscould not fail to be impressive and valuable and prove the oft repea...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3194","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
