{"id":36704,"no":11,"title":"CHAPTER XI","content":"\"I never noticed her looks,\" Howard Maitland was saying, as he and another member of the Survey Expedition lounged against the railing of their tubby little vessel and looked idly down on an oily sea. They had been talking about women—or Woman, as Frederica Payton would have expressed it; and, naturally, she herself came in for comment. \\n\\n \\n\\n \"Pretty?\" Thomas Leighton had asked, sleepily. It was very hot, and the flats smelt abominably; both men were muddy and dripping with perspiration. \\n\\n \\n\\n Howard meditated: \"I never noticed her looks. She keeps you hustling so to know what she\u0027s talking about, that looks don\u0027t count. She says things that make you sit up—but lots of girls do that.\" \\n\\n \\n\\n \"They do. Boring after the first shock. But they enjoy it. It draws attention to \u0027em. Our grandmothers used to faint all over the lot, for the same purpose.\" \\n\\n \\n\\n \"Sometimes,\" Howard said, grinning, \"when they get going about sex, I don\u0027t know where to look!\" \\n\\n \\n\\n \"Look at them. That\u0027s what they want. And as most of \u0027em don\u0027t know what they\u0027re talking about, you needn\u0027t be uncomfortable. When they orate on Man\u0027s injustice to Woman—capital M and capital W—I get a little weary.\" \\n\\n \\n\\n [Pg 128] \\n\\n \\n\\n \"I\u0027m with \u0027em, there!\" Maitland said. \\n\\n \\n\\n The older man gave a grunt of impatience: \"It isn\u0027t men who are unfair to women; it\u0027s Nature. But I don\u0027t see what can be done about it. Even the woman\u0027s vote won\u0027t be very successful in bucking Nature.\" \\n\\n \\n\\n \"I don\u0027t agree with you! Nature is perfectly impartial. Brain has no sex!\" \\n\\n \\n\\n \"Nature impartial?\" Leighton repeated, grimly; \"Maitland, when the time comes for you to sit outside your wife\u0027s room, and wait for your first-born, you will not call Nature impartial. Theories are all very pretty, but just try waiting outside that door—\" his face twitched; and Howard, remembering vaguely that Mrs. Leighton had been an invalid since the birth of their only child, changed the subject: \\n\\n \\n\\n \"Miss Payton\u0027s just sent me a cartload of suffrage literature; came on the tug yesterday.\" \\n\\n \\n\\n \"Suffragist?—you, I mean?\" \\n\\n \\n\\n \"Yes; aren\u0027t you? Let\u0027s get in the flap of that sail.\" \\n\\n \\n\\n \"Do I look like a suffragist?\" the other man demanded. \\n\\n \\n\\n Howard surveyed him. \"I don\u0027t know the earmarks, but you show traces of intelligence, so I suppose you are.\" \\n\\n \\n\\n \"I\u0027ll tell you the earmarks—in the human male: amiable youth or doddering age.\" \\n\\n \\n\\n \"You\u0027re not guilty on the amiability charge, and you don\u0027t visibly dodder. So I suppose you\u0027re an anti.\" \\n\\n \\n\\n \"Not on your life! It\u0027s a case of a plague on both your houses.\" \\n\\n \\n\\n They were silent for a while, looking across the lagoon at a low reef where, all day long, the palms bent and[Pg 129] rustled in the hot wind; then Leighton broke out: \"For utter absence of logic I wouldn\u0027t know which party to put my money on.\" \\n\\n \\n\\n \"Play the antis,\" Howard advised. \\n\\n \\n\\n But the other man demurred. \"It\u0027s neck and neck. Some of the arguments of the antis indicate idiocy; but some of the suffs\u0027 arguments indicate mania—homicidal mania! It\u0027s a dead heat. It\u0027s queer,\" he ruminated; \"each side has sound reasons for the faith that is in it, yet they both offer us such a lot of—truck! One of the mysteries of the feminine mind, I suppose.\" He knocked the ashes out of his pipe on the deck-rail, and yawned. \"As an example of \u0027truck,\u0027 I heard an anti say that for a woman to assume the functions of a man, and vote, was to \u0027revert to the am?ba.\u0027 Can you match that? But, on the other hand, look at the suffs! My own sister-in-law (a mighty fine woman) told me that men \u0027were of no use except to continue the race.\u0027\" \\n\\n \\n\\n \"That\u0027s going some!\" \\n\\n \\n\\n \"But of course,\" the older man said, \"it is ridiculous to make sex either a qualification or a disqualification for the ballot; and it\u0027s absurd that my wife shouldn\u0027t have a vote when that old Portuguese fool from Gloucester, Massachusetts, who guts our fish and can\u0027t speak English so that an American dog could understand him—has it.\" \\n\\n \\n\\n \"That\u0027s just it!\" Howard said, surprised at his fairness. \\n\\n \\n\\n \"Why multiply him by two?\" Leighton said, dryly. \\n\\n \\n\\n \"We wouldn\u0027t be a democracy if we discriminated against the uneducated!\" \\n\\n \\n\\n \"I don\u0027t. I discriminate against the unintelligent.[Pg 130] You\u0027ll admit there\u0027s a difference? Also, allow me to remind you that democracy is not the ballot; it\u0027s a state of mind.\" \\n\\n \\n\\n \"Very well!\" Maitland retorted. \"Make intelligence the qualification: the women put it over us every time! They are far more intelligent than men.\" \\n\\n \\n\\n \"I\u0027d like to hear you prove it.\" \\n\\n \\n\\n \"That\u0027s easy! Girls can stay in school longer than boys, so they are better educated.\" \\n\\n \\n\\n \"But I\u0027m not talking about schooling!\" Leighton broke in; \"I mean just common sense as to functions of the ballot. Let women ask for an intelligence qualification, and I\u0027ll be the biggest kind of a suff! But while they don\u0027t know any more about what the ballot can and can\u0027t do, than to gas about its raising woman\u0027s wages—oh, Lord!\" he ended, hopelessly. \\n\\n \\n\\n \"Suffrage in itself is educating,\" Howard instructed him. \\n\\n \\n\\n Leighton nodded. \"It ought to be. But I can\u0027t see that it has perceptibly educated our fish-gutter. Still, you\u0027d like to meet his wife at the polls?\" \\n\\n \\n\\n The suffragist hesitated: \"When women get the vote, they\u0027ll change the election laws, and weed out the unfit.\" \\n\\n \\n\\n Leighton lifted despairing hands: \"When you say things like that, I feel like putting my money on the suffs! Mait, get out of the cradle! Our grandfathers made a mess of it, by dealing out universal male suffrage; and our fathers made a worse mess in giving it to the male negro; now the women want to make asses of themselves, just as we did. They are always yapping about being our \u0027equals.\u0027 They are! They are as big fools as we are.[Pg 131] Bigger, for they have the benefit of observing our blunders, and being able to avoid them—and they won\u0027t do it! Because Mr. Portugee has the ballot, Mrs. Portugee must have it, too. They say it wouldn\u0027t be \u0027fair\u0027 to leave her out. You\u0027d think they were a parcel of schoolgirls! If women would ask for a limited suffrage, ask for the vote for my wife, so to speak—a vote for any intelligent woman, cook or countess!—I\u0027d hold up both hands, and so would most men.\" \\n\\n \\n\\n \"It isn\u0027t practical.\" \\n\\n \\n\\n \"Practical enough, if we wanted to do it. And think what we could accomplish—the intelligent men, and the intelligent women! The people who buy and sell Mr. Portugee would be snowed under;—which is the reason the corrupt element in politics object to a limited suffrage for women! They need Mr. Portugee in their business, and rather than lose him, they\u0027ll take Mrs. P., too. So what\u0027s the use of talking? Votes for Women will come, in spite of all the antis in the land, for in this woman\u0027s scrimmage, though the antis have the charm, the suffragists have the brains; and brains always win, no matter how bad the cause! They\u0027ll get it—I\u0027m betting that they\u0027ll get it in five years.\" \\n\\n \\n\\n \"You ought to hear Miss Payton talk about it,\" Maitland said; \"she\u0027d floor you every time. She\u0027s got a mighty pretty cousin,\" he rambled off; \"she has charm.\" \\n\\n \\n\\n \"Suffragist?\" \\n\\n \\n\\n \"Laura Childs? You bet she is! And she has brains. Not like Miss Payton, of course. But—\" he straightened up, and his eyes began to shine; his description of Laura was so explicit that his companion smiled. \\n\\n \\n\\n [Pg 132] \\n\\n \\n\\n \"Oh, that\u0027s the lay of the land, is it?\" he said. \\n\\n \\n\\n To which Howard responded by telling him to go to thunder. \"Trouble with Miss Childs,\" he said, \"is that the fellows are standing in a queue up to her father\u0027s door-steps, waiting to get a chance at her.\" \\n\\n \\n\\n \"Why did you step out of line?\" \\n\\n \\n\\n \"I\u0027ll tell you the kind of a girl she is,\" Howard said, ignoring the question. \"Of course, a man never would get stuck with Laura at a dance, but she\u0027s the kind, if she thought he was stuck, would make some sort of excuse—say she wanted to speak to her mother—so as to shake him. No man ever wants to get clear of Laura, but she\u0027s that kind of girl. That\u0027s why men hang round so.\" \\n\\n \\n\\n \"You evidently didn\u0027t hang round?\" \\n\\n \\n\\n Howard yawned. \"Did I show you the pearl I found yesterday?\" he asked, and produced, after much rummaging in his various pockets, a twist of paper. Leighton inspected the pearl without enthusiasm. \\n\\n \\n\\n \"Good so far as it goes. Hardly big enough for the ring.\" \\n\\n \\n\\n Howard gave him a thrust in the ribs. \"I\u0027m going down to the cabin.\" \\n\\n \\n\\n In his sweltering state-room he looked at his find, critically. \"No, it isn\u0027t big enough,\" he decided. \"Well, maybe I\u0027ll never have a chance to produce a ring,\" he added, dolefully; then he dropped the pearl into his collar-box, and mopped the perspiration from his frowning forehead. \"Wonder if I shall ever be cool enough in this life to wear a collar?\" he speculated. After all, why had he stepped[Pg 133] out of the line? \"I wish I\u0027d prospected before I left home!\" Yet he realized that he had not known how much Laura counted in his life until he got away from her. Out here, \"digging for buried treasure\" in the blazing sun, lying on deck through velvet, starlit nights, the recollection of that \"queue\" lining up at Billy-boy\u0027s front door-steps had become first an irritation, and by and by an uneasiness. He had had one card from her,—\"7° above. Don\u0027t you wish you were as cold as we are?\" The photograph on the back revealed a snowy mountain-side that was tantalizing to a man who had nothing to look at but blazing, palm-fringed reefs, and who, for weeks, had been sweating at 104°. And it was not only the temperature that tantalized him—in the foreground of the picture were half a dozen of his set on skis. Laura, in a sweater and a woolly white toque, was putting a mittened hand into Jack McKnight\u0027s, to steady herself. Howard had not liked that card. \"McKnight\u0027s got on his Montreal rig, all right,\" he thought, contemptuously; \"he always dresses for the part!\" \\n\\n \\n\\n It was that postal which had aroused his uneasiness about the queue, and set him to counting the weeks until he could get into the line again. Also, it made him write rather promptly to Frederica Payton: \\n\\n \\n\\n \"Hasn\u0027t Jack McKnight got any job? He\u0027s a pretty successful loafer if he can go off skiing all around the clock. Why doesn\u0027t Laura put an extinguisher on him? How is Laura? I suppose she and Jack are having the time of their young lives this winter.\" \\n\\n \\n\\n It was well on in July before Fred\u0027s reply to that [Pg 134]particular letter reached him, and it made him tell Tom Leighton that Miss Payton—\"You remember I told you about her?\"—was the finest woman he had ever known. \"No sentimental squash about Freddy Payton!\" This tribute was given because Fred had said: \\n\\n \\n\\n \"Laura hasn\u0027t confided in me, but I\u0027m betting that she\u0027ll turn Jack McKnight down. He\u0027s not good enough to black her boots, and nowadays women demand that men—\" \\n\\n \\n\\n At this point Howard folded the letter and put it in his pocket. \"Laura\u0027ll bounce him!\" he said to himself; and for the next hour he expatiated to Mr. Leighton upon the charm of common sense in a woman—the woman being Miss Payton, of whom his hearer was getting just a little tired; but he was confused, too. At the end of an hour his gathering perplexity found words: \\n\\n \\n\\n \"But I thought it was the pretty cousin you were gone on?\" \\n\\n \\n\\n \"You did, did you?\" Howard said. \"Digging shells has affected your brain, Tommy.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1821/52860.html","bookId":1026,"book":{"id":1026,"title":"The Rising Tide","description":"简介： A single car-track ran through Payton Street, and over it, once in a while, a small car jogged along, drawn by two mules. Thirty years ago Payton Street had been shocked by the intrusion upon its gentility of a thing so noisy and vulgar as a street-c...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1821","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
