{"id":36712,"no":19,"title":"CHAPTER XIX","content":"\"You can\u0027t stay here by yourself,\" he said. \"I can\u0027t go back to town and leave Flora here by herself. We\u0027ve got to find her!\" He nodded; they were both of them entirely at ease. That tense consciousness of a few minutes before had disappeared. \"I\u0027m worried,\" Fred said, again; \"she was awfully low-spirited because—because somebody hadn\u0027t written to her.\" \"Oh, she\u0027s all right. She\u0027ll be back in a few minutes.\" \"But where has she gone?\" \"Perhaps she walked into Laketon.\" \"What for? Besides, it\u0027s nearly five miles!\" They were standing in the kitchen doorway; Zip pushed past them and went out into the mist; smelled about, stretching first his front legs, then his hind legs. The motor loomed like a black monster under the tree. Zip gave a bored look at the lingering guest. \"Flor-a-a!\" No answer; just the lake, sighing and rippling in the sedge. \"Could she have gone down to the water?\" Howard[Pg 210] said; \"have you got such a thing as a lantern? I\u0027ll go out and look.\" \"No; but light that lamp on the center-table—a candle might blow out.\" He went into the other room, and she heard him scratch a match and fumble with the lamp-chimney. In that minute, alone, listening all the while for Flora\u0027s returning step, her mind leaped back to that moment in front of the fire. His look—astounded, incredulous, shocked—was burned into her memory; his distressed words rung in her ears. She was not conscious of any pain because he did not love her. She was simply stunned by the jolt of suddenly and unexpectedly stepping down into the old, irrational modesties.... Her face began to scorch. She went out on the porch and called again, mechanically; some water dripping from the eaves on her bare head ran down one blazing cheek; the coolness gave her an acute sense of relief that struggled through the medley of tearing emotions; she was saying to herself: \"Where can she be? She hasn\u0027t washed the dishes! (He refused me.)\" Howard, holding the lamp over his head, came up behind her and went down the steps into the mist. Fred followed him, Zip lumbering along at her heels. \"She must have left the house this way; we know that,\" she said. \"Come down to the beach,\" he said. \"Yes; sometimes she used to sit on that big rock,\" Frederica remembered. He walked ahead of her; the light, shining through the[Pg 211] solferino lamp-shade, made a rosy nimbus about his bare head, but scarcely penetrated the fog. They went thus, all three, single file, along the path to the rickety wooden pier; at the end of it, they stood staring out into the mist. Twice he called, loudly, \"Flora!\"... \"Not a sound!\" he said. \"Is there any possible place in the house where she could have hidden herself? I mean, gone to sleep, or anything?\" \"Not a place! I\u0027ve looked everywhere. (He refused me.)\" They turned silently to go back. Just as they reached the path again Howard stopped—so abruptly that the lamp sent a jarring gleam into the white darkness. \"Fred—?\" She looked where he was looking, and caught her breath. \"No!\" she said; \"oh, no—no! It can\u0027t be!\" \"Hold the lamp. I\u0027ll go and see—\" He climbed down the little bluff and waded into the sedge. The swaying mass that had looked like a stone until a larger wave stirred it, came in nearer the shore, caught on the shoaling beach, rolled, and was still. Frederica saw him bend over it, then try, frantically, to lift it in his arms. She put the lamp on the wharf. (\"Don\u0027t touch it, Zip!\"), slid, catching at tufts of grass, and bending branches—down the crumbling bank, plunged into the water up to her knees, and together, half pulling, half carrying that sodden bundle, they stumbled over the oozy bottom and through the sedges. The lifting it up the bluff was terrible; the dripping figure, sagging and bending, was so heavy! [Pg 212] \"We must get her into the house,\" Frederica panted. And, somehow or other, they did it, Howard taking the shoulders, and Fred the feet. They were gasping with the strain of it when they laid her on the floor of the living-room. \"Is she dead?\" he said. Frederica thrust her hand into the bosom of Flora\u0027s dress—and held her breath. \"I can\u0027t tell; we mustn\u0027t stop to find out! You know what to do? Pull her arms up, this way!\" They stood over her, Howard following Fred\u0027s short, sharp directions, and, even in the horror of the moment, conscious of a wondering admiration at her efficiency. But no quiver of life came into the still face. \"We ought to get a doctor!\" Fred said, at last, panting. \"I\u0027ll go instantly!\" \"No, the quickest way will be to take her to a doctor, not bring a doctor to her!\" \"But if she is dead we ought not to move her! That\u0027s the law.\" \"Law? I don\u0027t care anything about the law! Life is what I\u0027m thinking of! We don\u0027t know whether she\u0027s dead or not. Crank your car! I\u0027ll get some blankets—\" He hurried out, and she rushed up-stairs for blankets. She was folding them about Flora when he came in, the car chugging loudly at the door. Again, lifting and straining, they carried her out, and got her into the tonneau. Then Frederica saw the lamp down on the wharf, burning steadily in the mist. \"Put it out! Put it out! Hurry!\" she commanded;[Pg 213] and while he ran to do it she darted back to blow out the candles in the living-room and snap the lock of the front door—\"never mind about taking the lamp into the house. Leave it on the porch!\" she said. Then she got in the car and, sitting down, put an arm about the crumpling, sodden form. Zip, fearful of being left, jumped on the front seat, and glanced wonderingly back at his mistress. \"Fred,\" Howard said, agitatedly, \"I think she\u0027s—dead.\" \"So do I; but hurry! Don\u0027t lose a minute!\" Then, through the noise of the clutch, she screamed at him: \"Doctor Emma Holt! In Laketon!\" And the car jerked forward. \"But that\u0027s a woman doctor,\" he called, over his shoulder. Just for a moment the habit of revolt asserted itself: \"Why not?\" Then, \"Hurry! Hurry!\" Dr. Emma Holt was five miles away. \"I felt,\" Howard Maitland used to say, afterward, \"as if she were fifty miles away!\" The fog was so thick it was impossible to speed with safety, so they sped without it, and tore bumping along through the white smother. Twice he looked around, and saw Fred sitting there, rigid, with that face, open-mouthed, open-eyed, gray under its brown skin, wabbling, and dripping on her shoulder. \"She is magnificent!\" he thought. \"I couldn\u0027t do it.\" The second time he looked, some reflection from the lamps, gleaming in the fog, flickered on that set face, and it seemed as if the eyes closed, then opened again. The horror of it made his hand jerk on the wheel, and there[Pg 214] was a skid out of the ruts that frightened him into carefulness. When he sprang out at the house of the \"woman doctor,\" he dared not glance back into the tonneau. Hammering on the panels of the door, and keeping his thumb on the bell, he called up to an opening window on the second floor: \"Doctor! Hurry! A woman has got drowned! Hurry!\" \"Where is she?\" came a laconic voice from the window. \"Here! In my car! Hurry!\" The window slammed down; a minute later the electric lights were snapped on in the sleeping house, and hurrying feet came along the hall.","sourceLink":"http://novel.tingroom.com/jingdian/1821/52868.html","bookId":1026,"book":{"id":1026,"title":"The Rising Tide","description":"简介： A single car-track ran through Payton Street, and over it, once in a while, a small car jogged along, drawn by two mules. Thirty years ago Payton Street had been shocked by the intrusion upon its gentility of a thing so noisy and vulgar as a street-c...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1821","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
