{"id":73486,"no":28,"title":"Page 28","content":"Marcus Cheers, clapping, and whistling ensued when I walked into Live Bay two nights later with Low tucked closely to my side. \"Hot damn!\" \"Hall elujah\" \"It\u0027s about time.\" \"Finally!\" Will ow glanced up at me smiling. \"I guess they\u0027re happy about this.\" She had no idea. \"Yes I\u0027m pretty sure nothing short of our marriage would make them happier. They weren\u0027t a fan of the Will owless Marcus.\" \"Oh\" \"Yes, Oh.\" Will ow kissed my cheek and our crowd went wild. \"That\u0027s what I\u0027m talking about. Lick all over him,\" Preston hooted as we came up to the table. \"I\u0027d even be okay with some PDA at this point,\" Dewayne drawled. \"hello to all of you too,\" Will ow piped up. \"You have no idea how badly you were missed,\" Preston said. Will ow glanced up at me, \"I have an idea.\" \"I\u0027m taking my girl to dance and away from all of you. You\u0027re making me sound pathetic.\" \"You were pathetic,\" Dewayne responded. I was. No point arguing. Pulling Will ow into my arms I enjoyed her soft curves and sweet honey scent. Nothing in my life had ever felt as right as she did in my arms. Willow \"I can\u0027t believe you\u0027re moving out. If I\u0027d known you\u0027d leave me I\u0027d never have helped the jackass out and convinced you to give him another chance.\" Cage stood in the living room frowning. I had my suitcase packed and the key he\u0027d given me in my outstretched hand. \"Don\u0027t say that Cage. I\u0027m not leaving you. I\u0027m releasing you.\" \"Who the hell said I wanted to be released?\" \"I did. You\u0027ve been my best friend, savior, family, safe haven for so long. I\u0027ve always come first in your life. You put your wants and needs on hold to make sure I\u0027m happy. I love you. And it\u0027s time I let you go. You\u0027re free to just be my friend. You don\u0027t have to drop everything to come save me or pick up the pieces. I\u0027m a big girl now. If my world falls apart again I\u0027ll handle it.\" Cage reached out and took the key then grabbed my hand and jerked me into a hug. \"He won\u0027t ever leave you, Low. That\u0027s the only way I can let you walk out that door. I know he won\u0027t. The boy is a goner.\" I nodded against his chest. \"I don\u0027t think he will either.\" \"And I don\u0027t regret anything. I\u0027d do it all again. You know that right?\" I nodded feeling my eyes fill up with tears. \"You\u0027re my family, Cage. You always will be.\" \"You too, Low, always.\" Marcus cleared his voice from the doorway. I stepped back and wiped my tears before he could see them. \"Take care of her,\" Cage told Marcus. \"I will.\" Cage nodded and tucked my key into his pocket. \"I guess I\u0027m going on that road trip. I\u0027ll have a lot of free time on my hands now.\" \"Go. Have fun.\" Cage grinned, \"Okay.\" He nodded toward the couch, \"And just take the couch. I\u0027m not taking your money.\" \"I want to pay you for it. You\u0027re gonna need to replace it.\" \"I\u0027m thinking of putting a few blow up mattresses out here. Might have a few orgies\" \"UGH! Shut up Cage,\" I shoved him making him loose his balance. Chuckling he shrugged, \"Hey I thought you wanted me to live a little.\" \"You\u0027re crazy, Cage York.\" Marcus came up behind me and took my suitcase. \"You ready?\" I smiled back at him and nodded. I was ready. I was ready for everything tomorrow may bring.","sourceLink":"https://allnovel.net/because-of-low-sea-breeze-2/page-28.html","bookId":1986,"book":{"id":1986,"title":"Because of Low (Sea Breeze #2)","description":"Storyline: Because of Low (Sea Breeze #2) In my debut novel, Breathe, Sadie may have fallen in love with the teen rock star, Jax Stone, but readers fell head over heels for Marcus Hardy. This is his story… Marcus Hardy had hoped to enjoy a year away at college while he put the summer he’d rather forget behind him. But instead, he’s jerked right back to the coastal town of Sea Breeze, Alabama due to a family crisis. His dear ol\u0027 dad found himself a girlfriend only a few years older than Marcus. So now his sister needs help dealing with their mother who is mentally falling apart. The only bright spot to returning is the fascinating red head who sleeps over several times a week. The problem is she\u0027s sleeping in bed with his new roommate, Cage York. Willow “Low” Foster needs a place to live. Running to Cage’s apartment every time her sister kicks her out isn’t exactly a long term solution. Juggling her courses at the local community college and a part time job doesn’t produce excess income. But Cage has a new roommate and suddenly sleeping over at her best friend’s apartment isn’t such a bad thing. Not when she gets to see those sexy green eyes of Marcus Hardy’s twinkle when he smiles at her like he wants her there. Even though Cage seems a little territorial where Low is concerned, Marcus finds time to spend with Low without upsetting his roommate. Cage may use his small college baseball star persona to sleep with every hot female in his path but he’s still under the disillusion that when he’s through sowing his wild oats, he’s going to marry Low. Marcus intends to change that assumption for both Cage and Low. Until his carefully laid plans come crashing down with a revelation he never expected. He’ll have to choose between Low or his family. Because once the truth comes out.... there’s no other choice.","cover":"https://allnovel.net/images/because-of-low-sea-breeze-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/because-of-low-sea-breeze-2.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:27:36 AM"}}
