{"id":39790,"no":26,"title":"CHAPTER IX JONES SPEAKS IN THE PREDICATE","content":"“What a lot of things happen to me since I come to Panama,” said Susan, as with her hands she smoothed out the black skirt, heavily trimmed with crape, which she wore. \\n\\n \\n\\n “This is a world where y’u don’t know to-day what goin’ to happen to-morrow,” remarked her father, his tone suggesting that in better-regulated worlds one would know beforehand everything that was likely to occur. \\n\\n \\n\\n “A few months ago I was only Susan Proudleigh,” the widow continued, “an’ I had to work for me living; now I am a widow and everybody respect me an’ sympathize with me.” \\n\\n \\n\\n “You are more than a widder,” said Mr. Proudleigh; “you are a young ooman of property, an’ there is very few that can say de same thing.” \\n\\n \\n\\n “For which we must be thankful,” Miss Proudleigh interposed. “Providence is always looking after the widow an’ the orphant; but sometimes they don’t deserve it, and that is why, peradventure, that some widows with their money go like butter against the sun. But Sue is not goin’ to be one of those.” \\n\\n \\n\\n Since the reading of Mackenzie’s will Miss Proudleigh had come to see qualities in Susan which she had not been able to perceive during all the previous months she had lived in Panama. Cordial relations had therefore been re-established between the two, and Miss Proudleigh had now reverted to her long-ignored habit of seeing most things that concerned Susan from Susan’s point of view. \\n\\n \\n\\n “I am glad y’u make up you’ mind to go back home, Sue, now that you not married any more, for the house which you’ husband, who is now in heaven, leave to you in Kingston, needs somebody to look after it, an’ you ’ave other property in Jamaica to see about. An’ you can’t trust no strange person to do it, for them will rob your eye out of you’ head; and if you take them to law the judge may tell you to make up the case peacefully, like that time when you bring up Maria. Therefore,” Miss Proudleigh concluded, “go and look after your business you’self.” \\n\\n \\n\\n “I ’ave nothing more to do with court-house,” said Susan, “nor wid Maria and her mother either. They can’t trouble me again.” \\n\\n \\n\\n “They have not troubled you at all,” said her aunt. “All their wickedness have been turned aside, an’ you have not dashed your foot against a stone. That is what I say from the first. You see what it is to ’ave faith?” \\n\\n \\n\\n In her cheap black muslin dress (provided by Susan) Miss Proudleigh looked as though, by faith, she would be able to move mountains, if only she should determine to exert herself to that extent. \\n\\n \\n\\n “Even Tom try to make mischief against me,” continued Susan, still bent upon recounting her experiences; “but he didn’t succeed any more than Maria an’ her mother.” \\n\\n \\n\\n “Well, me dear daurter,” said Mr. Proudleigh, “dat was because I was always having y’u in me thoughts. I don’t know what you could do without me. Tom was a bad young man; but when I kneel down every night an’ thoughted about him, an’ pray dat some harm would befall him because he was tryin’ to disturb y’u, I felt that my pr’yer would be answered.” \\n\\n \\n\\n “Anything happen to him?” asked Susan. \\n\\n \\n\\n “Not exactly—yet,” replied her father; “but I hear this morning that him gone away to de capital with a female who used to beat her other intended; an’ don’t you see dat if she could beat one, she will do de same with Tom?” \\n\\n \\n\\n Susan, knowing Tom as she did, thought it highly probable. \\n\\n \\n\\n “Let him go about his business,” she said, thus dismissing Tom and his affairs from her mind. “I am sorry, Aunt Deborah, that you an’ Kate won’t come home with me; but of course you can do better here.” \\n\\n \\n\\n Miss Proudleigh nodded affirmatively. “But next year, please God,” she said, “I will take a trip home to see how everybody is getting on.” \\n\\n \\n\\n It was the ninth day after Mackenzie’s death. Susan had been allowed to remain for a few days in the house at Culebra, during which she had made arrangements for her departure from Panama. She had determined to go to Jamaica without delay, to see after her property there, and she was leaving to-morrow. But before going there was one function to be attended to; this was Mackenzie’s Ninth Night, the final taking leave of Mackenzie’s spirit, the last ceremony to be held in his honour. For this purpose she had come to Colon. \\n\\n \\n\\n This Ninth Night is a survival of an African purification ceremony, the origin and meaning of which neither Susan nor her relatives knew. All that they did know was that the Ninth Night was a custom which it was not considered altogether proper to neglect, and yet which it was not considered altogether proper to observe after the manner of the lower classes. With these it tended sometimes to degenerate into an orgy; in Miss Proudleigh’s view it should only be a quiet prayer-meeting, a sort of love-feast, eminently respectable and edifying. The theory was that Mackenzie’s spirit, though ultimately destined for heaven, was for some nine days fated to hover near those who had been connected with him, and might continue so to do for years unless the Ninth Night ceremony was performed. This theory not being countenanced by the churches, Miss Proudleigh defended it by pointing out that the soul was not the spirit; and that though the soul went straight to heaven or to hell, after the decease of the body, the spirit, assuming the form of a ghost, might be unpleasantly present on earth. When this explanation was held to be unsatisfactory by some sceptic, Miss Proudleigh took refuge in asserting that it was all very well to scoff, but that plenty of people had seen ghosts and every one was afraid of them. Then she would instance the raising of Samuel’s spirit by the Witch of Endor, a fact which could only be got rid of by being dismissed as untrue. \\n\\n \\n\\n On Ninth Nights both Susan and Catherine looked with some disrespect; they were of the younger generation. But Mr. Proudleigh stood up for them, not only on religious grounds, but because he knew from experience that much good cheer was provided at them, and many opportunities afforded for oratory. Therefore a Ninth Night was highly desirable. So Susan had decided to wait for the Ninth Night; and Jones, knowing that, had waited also, and had booked his passage by the same steamer in which she was going to Jamaica. \\n\\n \\n\\n Susan and her people were now waiting for the guests. The room in which they sat was provided with a number of extra chairs; in the centre was a table covered with a white cloth; on the table were a few hymn-books and a Bible. The lamps were lighted, for it was already dark. \\n\\n \\n\\n “Everything is prepared,” said Miss Proudleigh, after she had announced her intention of going to Jamaica on a visit in the following year. “The chocolate is good chocolate, an’ I parch ah’ grind the coffee meself.” \\n\\n \\n\\n “You ’ave any rum?” inquired Mr. Proudleigh anxiously. \\n\\n \\n\\n “Plenty. You think we could ask people to come an’ have a little quiet pr’yer and talk with us, and don’t treat them decently?” \\n\\n \\n\\n “No,” agreed her brother heartily, and would have launched out into a lengthy account of those Ninth Nights at which he had not been treated decently, but that his sister refused him the chance of doing so. \\n\\n \\n\\n “We have bread, an’ bun, an’ cake, an’ fish, cheese, bananas, an’ rum, an’ a bottle of whisky, an’ lemonade, besides coffee an’ chocolate,” recited Miss Proudleigh with pride. “Mackenzie can’t feel ashamed to-night!” \\n\\n \\n\\n Mr. Proudleigh inwardly determined that, when the time came, he would make all these good things “look foolish.” He complacently disposed himself to wait for that happy hour. \\n\\n \\n\\n Presently Catherine came in, accompanied by a tall young man of her own complexion, who appeared to be very attentive to her. These were followed by other persons, and then the ceremony of the evening began. \\n\\n \\n\\n Miss Proudleigh suggested a hymn, which was sung; then she volunteered to lead in prayer. This she did, taking the opportunity of reminding her audience, under guise of a general supplication, that she was not as other women were, but might more properly be likened to the ancient Deborah or to some other equally superior character, having been strenuous in following the light, and having, beyond the shadow of a doubt, set a noble example to all with whom she had come in contact. \\n\\n \\n\\n She prayed for Susan, Catherine, and for all her other relatives, and she informed the angelic host that she knew that Mackenzie was in heaven, enjoying all the felicities prepared for the righteous before the foundations of the world were laid. Then she proceeded to review the events of the times as she had heard of them, and asked earnestly that peace should be established on earth. She did not forget the King and all the Royal Family. Jamaica was included as a place which sadly needed regeneration. It seemed as if she would never cease, and her brother, who himself had prepared a nice little prayer for the occasion, began to feel jealous; Deborah had touched upon every subject he had intended to deal with, and more besides. Susan felt decidedly bored. The guests began to shuffle uneasily on their knees. Warned by certain slight though ominous sounds, Miss Proudleigh at last brought her eloquence to a close. As she rose from her knees she began chanting the Hundredth Psalm. Everybody joined her. At that moment Samuel Josiah Jones entered the room. \\n\\n \\n\\n Jones had left Culebra immediately after the burial of Mackenzie, and, yielding to the urgent advice of Miss Proudleigh, had not returned thither to see Susan. He had written to her, and had received in reply a brief letter telling him that she was going to Colon, to her relatives, as soon as her affairs at Culebra were settled. It was from Mr. Proudleigh that he had learnt when Susan was leaving for Jamaica. Susan’s aloofness, he thought, might be due to grief, or to the circumstance that her husband was only a few days dead, or to her improved financial position, and a determination, the result of that improved position to have nothing more to do with Samuel Josiah. Well, he would find out what it was. No woman should say that her money frightened him. He could always earn a good living, either in Jamaica or in Panama; in a few years he could save as much as Mackenzie had saved, though he did not see any good reason why he should. \\n\\n \\n\\n All eyes were turned on him as he entered the room and deliberately asked a youth to let him have his chair. The youth had been sitting next to Susan. Jones installed himself in his place. \\n\\n \\n\\n “Sorry I am late,” he whispered, wishing at the same time that the people would sing more loudly. Miss Proudleigh seemed to divine his wish. Her voice shrilled out astonishingly. \\n\\n \\n\\n “You are quite in time,” said Susan quietly. \\n\\n \\n\\n “No; I miss you every minute I am not with y’u.” \\n\\n \\n\\n “Sh-h. People will hear y’u.” \\n\\n \\n\\n “It is all in camera.” \\n\\n \\n\\n “You mustn’t talk, Mr. Jones.” \\n\\n \\n\\n The “Mr. Jones” was disconcerting. But he would not be repulsed. \\n\\n \\n\\n “I want to talk to you,” he said. \\n\\n \\n\\n “Later on,” she answered, and would not pursue the conversation. \\n\\n \\n\\n Hymn followed hymn, and the good things so freely provided by Miss Proudleigh (who had received an advance for that purpose from Susan) were duly handed round. The guests enjoyed them, eating and drinking to their hearts’ content; and Mr. Proudleigh, reflecting that it might be long before he should assist at another Ninth Night, worthily led them on in this satisfactory effort. Then, when it was nearly twelve o’clock, he thought he saw his opportunity, and, forestalling his sister, he rose and intimated that it was his intention to make a few remarks. \\n\\n \\n\\n “It is shortly toward midnight, dear friends,” he began, “an’ before we finish an’ terminate this firs’ part of our gathering, we must call to mind certain things. Every meeting have an end, an’ every end has a termini.” (He paused to allow this term to have its full effect upon the audience. It was one he had learnt from Jones.) “But before we proceed to bid Mackenzie good-bye,” he went on, “an’ the younger folkses begin to enjie themself, which is natural, for I remember that in de old days, which I always tell my fambily, for none of them know what I know, an’ so to speak a man like me is expected to ’ave experience, an’ as I was saying——” But the difficulty was that he could not for the life of him remember what he had been saying. His sister had given him no opportunity of speaking earlier that night, and in the meantime sundry glasses of rum and water had inflamed his ambition without strengthening his mind. There was now, therefore, a struggle between the orator and the liquor, and his refusal to own himself vanquished as he strove to recall what he had intended to say would have been magnificent had it not appeared to the audience supremely ludicrous. Mr. Proudleigh wanted to pronounce a eulogy upon Mackenzie. He had an idea that Mackenzie’s spirit was hovering near, and he would have liked it to hear his speech. He felt that Mackenzie deserved special posthumous praise for having left Susan so comfortably off. He bravely began once more. \\n\\n \\n\\n “Mackenzie was me son-in-law. He was a very kind young man. An’ when he write me for Miss Susan” (here Susan stared) “I wouldn’t refuse him. I say to him . . . I say . . .” Once again Mr. Proudleigh halted, and in the midst of the momentary silence the little clock on the shelf just above his head struck the midnight hour. A hush fell on the company as Miss Proudleigh sank upon her knees. That lady afterwards declared that as the last stroke of the clock died away she had felt something like a cold wind rushing by her, as though an invisible presence were leaving this mundane sphere for ever; and after hearing of her experience Mr. Proudleigh also asserted that he too had been touched by Mackenzie’s departing spirit that night. His sister, recollecting his condition, secretly doubted his story; but as moral support is always of value when proof is not forthcoming, she never contradicted him. \\n\\n \\n\\n “Let us pray,” said Miss Proudleigh when the clock had ceased to strike. \\n\\n \\n\\n This time she prayed that all wandering spirits might find eternal rest, and that the dead might never be allowed to intervene in the affairs of the living. She made it known to all and sundry whose place was another world that, however much their company may have been pleasant and interesting when they were alive, the proper sphere for their activities now was heaven, where, she indirectly assured them, they would be far more happy than if they returned to earth. This prayer closed with a loud Amen from the assembled guests, who entirely shared the sentiments expressed by Miss Proudleigh. “Well, we are done wid poor Mackenzie now,” she said, satisfied, as she rose from her knees. \\n\\n \\n\\n Mr. Proudleigh, with his undelivered speech still in mind, understood from these words that the end of that speech would never be heard by that audience. He felt that an advantage had been taken of him, and his bitterness was intense. \\n\\n \\n\\n It was a relief to the younger guests and members of the family when Miss Proudleigh signified that the religious portion of the Ninth Night ceremony was over, and Mackenzie finally dismissed to his last home. In a moment their emotions changed from grave to gay, and they all settled themselves down to gossip, joke, laugh, and otherwise enjoy themselves, while more refreshments were handed round. Every one present addressed Susan punctiliously as Mrs. Mackenzie. Jones still sat by her side, and his gestures and movements were marked by the company, whose chief diversion was to discuss the private affairs of their neighbours and friends. \\n\\n \\n\\n “We can’t always mourn,” sententiously observed one young lady, who saw in Samuel a suitor for Susan’s hand, and who wished to gain merit by indirectly suggesting that she personally knew of no reason for unlimited grief. “Life is short, an’ when we ’ave done our best, we must do what we can.” \\n\\n \\n\\n An enigmatical speech, but well understood by those who heard it, and who saw the significant glance which the speaker directed towards Susan and Jones. \\n\\n \\n\\n “Sorrow endureth for a night, but joy cometh in the morning,” commented Miss Proudleigh. “Sue, will you take a little ginger-wine? Or do you prefer chocolate?” \\n\\n \\n\\n “She prefer love,” said Jones shamelessly. “Love is better than wine.” \\n\\n \\n\\n “Behave you’self!” cried Susan. “Y’u forget where you are?” \\n\\n \\n\\n “After a storm there comes a calm, after a funeral, why not a wedding?” said the lady who had previously suggested the futility of endless weeping. \\n\\n \\n\\n “That’s not the sort of conversation for a Nine-Night,” primly suggested Susan. “I will never marry again, an’ so what y’u say don’t concern me; but still, this is not the time to talk about weddings.” \\n\\n \\n\\n “I don’t know dat I agrees wid Sue,” said her father. “Mister Mac is dead, an’ if Mister Jones write me for y’u, I——” \\n\\n \\n\\n But the old man, doomed it would appear to perpetual interruptions, was not allowed to complete his remark. Miss Proudleigh felt that the limits of decorum were in danger of being overstepped. She immediately and loudly began to tell of an arrest she had witnessed a day or two before in Colon, an arrest which had almost caused the death of the prisoner, he having been unmercifully clubbed by the policemen. This was an interesting topic of conversation, and while the company were discussing the demerits of the Republic’s peace officers, Jones quietly suggested to Susan that they might go and sit together for a little while on the veranda. \\n\\n \\n\\n She agreed, and they went out, remarked by all. But such pairings-off were customary; it was felt, moreover, that the widow had the right to do as she pleased, on account of her youth and her superior financial position. \\n\\n \\n\\n She and Samuel sat on the chairs they took out with them, and, leaning over the veranda, looked down into the silent street. They had placed themselves where they could not easily be seen by the people in the room, though the door stood open. After a few seconds Jones stretched out his hand and placed it on Susan’s shoulder. “Sue,” he whispered, “when you going to Jamaica?” \\n\\n \\n\\n “To-morrow. Don’t you know it already?” \\n\\n \\n\\n “I am going with you.” \\n\\n \\n\\n “I can’t stop y’u, Sam. The ship is for you as well as for me.” \\n\\n \\n\\n “Stop that foolishness, Sue. It is all very well when you makin’ fun to talk like that. But now I am talking in the Predicate and in the verb To Be; I am serious. I am going to marry you.” \\n\\n \\n\\n “But suppose I don’t want to get married again? I know what marriage mean, an’ you don’t. Besides that, I am all right now, an’ I can live comfortable without anybody. When you could marry me y’u didn’t, and I don’t forget how y’u used to leave me in the night when we was together. It’s better we remain apart, for what ’appen once will ’appen again.” \\n\\n \\n\\n “You know you don’t mean what y’u say,” replied Jones with conviction. “Jamaica is not Colon, and it will be all right when we get there. I will be steadier. I was steady there.” \\n\\n \\n\\n “Cho!” exclaimed Susan, but there was something in her voice which denoted satisfaction. “Y’u going to go on the same way in Jamaica as you went on here,” she added. \\n\\n \\n\\n “Well, we will have to make the best of it,” said Jones philosophically, “though you know quite well I am not a drunkard. We will get married in Parish Church.” \\n\\n \\n\\n Fully a minute passed before she replied— \\n\\n \\n\\n “As poor Mackenzie is just dead, don’t tell anybody here about it.” \\n\\n \\n\\n When, two days after the Ninth Night ceremony, Susan and Jones, with Mr. Proudleigh standing between them, saw the grey-green mountains of Jamaica rising into view as the ship drew nearer the shore, they felt for the first time in their lives what a homecoming meant. Susan eagerly pointed out object after object as her eyes roved over the scene stretched out in front of her; Jones was enthusiastic; Mr. Proudleigh, contrary to his habit, was silent. But when the ship entered the harbour, and Kingston appeared, and he saw again the houses and the piers with which he had been familiar all his life, he broke his silence and spoke the thoughts that were in his mind. \\n\\n \\n\\n “Fancy a old man like me go quite to Colon an’ come back,” he said reflectively. “Who is to tell what is gwine to happen in dis world! An’ I leave me second daurter and me sister behind me! Well, God will take care of them, same as Him take care of me. I am glad to come back. I really glad.” \\n\\n \\n\\n “No place like home,” said Jones heartily. \\n\\n \\n\\n “That’s a fact,” was Susan’s sincere comment. \\n\\n \\n\\n The End \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1955/56097.html","bookId":749,"book":{"id":749,"title":"Susan Proudleigh","description":"简介： I know I ave enemies, said Susan bitterly; I know I am hated in this low neighbourhood. But I dont see what them should hate me for, for I never interfere wid any of them....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1955","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
