{"id":86600,"no":10,"title":"Page 10","content":"I keep going over the night of the accident in my head. The conversation I had with Caleb before the accident and the stories I heard about afterward. He was obviously drunk; the policemen who arrested him gave him an alcohol test immediately after he admitted to hitting me with his car. But was he so drunk he didn\u0027t know what he was doing? So what if he hated what I told him that night, it was the truth. His girlfriend was cheating on him. \"You\u0027re lying, \"he\u0027d said that night. I was determined not to let him get away from me before I told him. \"I\u0027m not, Caleb. I swear I saw her with another guy. \"I didn\u0027t add that the other guy was his best friend. He grabbed my shoulders so hard I winced. Caleb had never laid a hand on me before. His rough touch made tears roll down my face. \"I love you,\" I\u0027d told him. \"I\u0027ve always loved you.\" I\u0027d let my fear of the truth and my love for Caleb all come out that night. \"Open your eyes, Caleb. Kendra is playing you for a fool.\" He took his hands off me like I was on fire and he was getting burned. Then he said something I\u0027ll never forget. \"You don\u0027t get it, Maggie, do you? You and me will never happen. Now stop spreading lies about my girlfriend before you get hurt.\" That warning has echoed in my head from that day until now. The logical part of me knows it was an accident. Of course he didn\u0027t mean to lose control of his car. But in the dark recesses of my mind there\u0027s this little nagging doubt that creeps up every once in a while. I finally fall asleep, but it\u0027s not a restful slumber because my dreams are haunted by the fact that I won\u0027t be able to escape Paradise and go somewhere far away---where the past can\u0027t catch up with me. The next day after school I get off the bus and come home to a message on our answering machine from Mrs. Reynolds--the old lady I met yesterday. She left her number and told me to call her as soon as I got home. When I call her back, she says she wants to interview me for an after-school job ... as her companion. \"Are you sure?\" I ask. \"I can strike a deal with you so you can go to Spain,\" she says, totally tempting me. \"Can you come to my house in Hampton so we can talk?\" As fast as my limpy legs can carry me I\u0027m on a bus heading to Hampton. It\u0027s not far, just a fifteen minute bus ride from Paradise. The whole time I\u0027m thinking of the deal Mrs. Reynolds wants to offer me. What does a companion do? Play checkers and listen to her talk about the old days? It can\u0027t be that hard. I can do it, even with a bad leg. Visions of making the old lady tea sandwiches and lemonade while we sit and talk float in my head. Leah and I used to talk--for hours on end about nothing and everything. I know talking with an old lady won\u0027t be the same as talking to an old best friend, but I think it could be cool. I ring the doorbell to Mrs. Reynolds\u0027 house and she greets me with a smile. \"Come in, Margaret.\" I sit primly on her expensive, cream-colored sofa, trying to make a good impression. Maggie, forget about the past and focus on the future, I tell myself. Mrs. Reynolds has bright, alert, green eyes that defy her old age, and an attitude that rivals the senior girls on the pompom squad. \"Would you mind working for a crabby old lady like me, Margaret, if at the end you\u0027d be able to take that trip to Spain?\" \"Besides needing the money for studying abroad next semester,\" I say, holding my hands in my lap and trying not to fidget, \"I believe one can learn a lot from people with life experience.\" Did I just hear Mrs. Reynolds snort? \"Don\u0027t you mean \u0027old people\u0027?\" she retorts. I bite the inside of my mouth. \"Urn, what I meant was, um ...\" \"Take it from someone with life experience. Don\u0027t pussyfoot around, it only wastes time. Can you cook?\" Does macaroni and cheese count as cooking? \"Yes.\" \"Play gin?\" \"Yes.\" \"Do you talk too much?\" Her question throws me off guard. \"Excuse me?\" \"You know, do you just talk to hear your voice, or do you keep quiet until you have something interesting to say?\" s\"The latter,\" I answer. \"Good. I don\u0027t like senseless chatter.\" \"Me, either.\" So much for not pussyfooting around. \"I\u0027ll expect you here from three thirty to seven o\u0027clock on weekdays, a few hours on weekends. I can give you an hour break so you can do homework.\" \"Does that mean I\u0027m hired?\" I ask. \"It seems so. I\u0027ll give you fifteen hundred dollars a month, enough to pay for that tuition you need. You can start after school on Monday.\" Wow. Way more than I\u0027d make if I worked anywhere else. \"It\u0027s too much,\" I admit. \"You could probably get someone for a lot less money.\" \"Probably. But you want to go to Spain, don\u0027t you?\" \"Of course, but...\" \"No buts. Buts can be categorized as senseless chatter.\" I want to kiss and hug the woman and thank her a hundred times. But I don\u0027t think she\u0027s the kissing and hugging type. And if I thank her a hundred times, I think she\u0027d have an aneurysm from the amount of senseless chatter. Mrs. Reynolds stands, using her cane to steady herself. Which reminds me to add, \"I have a limp.\" Instead of asking me about it, the woman just says, \"So do I. So do most of my friends. At least the ones who aren\u0027t dead. As long as you don\u0027t complain about yours, I won\u0027t complain about mine.\" And that, if you can believe it, is the end of my interview. FIFTEEN *** Caleb \"You, Caleb, come sir with us,\" Brian yells from the middle of the cafeteria. I had planned on grabbing a sandwich and sitting next to my sister. Today she\u0027s wearing jet-black lipstick to match her black, faded jeans. Mom didn\u0027t even flinch when Leah walked down the stairs this morning. I shuddered at the sight. Whoever made up that black lip stuff has got some serious issues. I\u0027m standing next to her, contemplating what to do. She doesn\u0027t look up from reading a book and says, \"Go sit with Brian. I don\u0027t care.\" \"Leah, come with me.\" She looks up, black lipstick and all. \"Do I look like I want to sit with them?\" That\u0027s it, I can\u0027t stand it anymore. I lean my hands on the cafeteria lunch table and say, \"You might want to freak me out with all this black crap, but I\u0027m not buying it. Now why don\u0027t you wipe that shit off your lips and cut the death act already. It\u0027s wearing thin on my nerves.\" Instead of being grateful I\u0027m being brutally honest, she abruptly picks up her books and runs out of the cafeteria. What the hell am I supposed to do now? Brian is still waving me over, but I hesitate. It\u0027s not that I don\u0027t want to sit with my old friends; I just don\u0027t feel like being bombarded with questions about jail. Because these guys wouldn\u0027t last one day in the DOC and they\u0027d probably think I was lying if I told them what really goes down in there. Don\u0027t think for one minute that anyone is immune to being convicted. Man, there\u0027s so many guys of all different races and religions and colors and sizes. Jews and Christians, Muslims and Catholics. Rich kids who thought they were above the law and dirt-poor kids who didn\u0027t know any better. It\u0027s a whole different ball game when you\u0027re on the inside, with an unspoken inmate hierarchy and rules. Some stuff you can figure out right off the bat and some things you have to learn the hard way. Accidents happen at the DOC, and some of them are intentional. Gangs are rampant, even in the juvenile jail. When there\u0027s an altercation between two rivals, you better get the hell out of the way. Warden Miller has this thing about greeting a new inmate on their first day at the DOC. He thinks it eases the new kid\u0027s mind knowing his expectations, but all it does is scare the crap out of them. Unless, of course, they\u0027re repeaters. Miller is on a first-name basis with a lot of repeaters. They get a very different version of the welcome speech. His first-timer speech goes something like this: \"My name is Scott Miller. Welcome to my house. You\u0027ll get up at five forty-five every morning and go to the showers. You get five minutes, no more, to wash up. You\u0027ll get three squares a day and you\u0027ll attend classes for eight hours. We\u0027ll get along just fine as long as you respect the rules in my house. If you don\u0027t... well, then you and I will have ourselves a problem. Ask anyone around, they\u0027ll tell you that you don\u0027t want a problem with me. My problems get twenty-three hours straight cell time. Any questions?\" Warden Miller doesn\u0027t explain the absence of toilet paper in the cells; that\u0027s one of those things you have to find out the hard way. It\u0027s when you\u0027re sitting on the can and need to wipe. The call button to borrow a roll is on the other side of the cell, nowhere near the seat you\u0027re crapping in. I head over to Brian and the guys, ready to distract them from talk about jail. \"Wha\u0027s up, guys? Where are all the girls?\" I ask. Drew is sitting across from me and rolls his eyes. \"Practicing for cheerleader tryouts. Don\u0027t get me wrong, I love when the chicks jump up and down for me. I just don\u0027t know how it could be all that difficult that they\u0027d need to practice for three weeks straight.\" \"Brianne and Danielle are going out for cheerleading instead of tennis?\" I ask. Brianne and Danielle were diehard tennis fanatics. \"It\u0027s because of Sabrina,\" Tristan says. \"She doesn\u0027t have enough hand-eye coordination to be a tennis player, so she\u0027s convinced Brianne and Danielle to try out for the Pantherettes.\" Maybe I\u0027ve been gone too long. Or maybe I didn\u0027t hear correctly. \"What\u0027s a Pantherette?\" \"Caleb, you got to get up to speed, man.\" Brian is trying to control his amusement as he says, \"Pantherettes are the cheerleaders for the wrestling team. Get it... Paradise Panthers ... Pantherettes\" Huh? \"Wrestling cheerleaders?\" Drew nods. \"Pantherettes, dude. Gotta love \u0027em. Lots of schools have wrestling cheerleaders, so last year we got \u0027em, too.\" \"You wrestling this year, Becker?\" Tristan chimes in. \"It might be Wenner\u0027s last year coachin\u0027. He\u0027s got a kid due in the summer, and I think he wants to keep his Saturdays open to stay home with the brat.\" \"I can\u0027t,\" I say. \"I\u0027ve got to work after school.\" I intentionally leave out the part that work is actually community service and if I ditch it, I may have to go back to jail. Brian takes a bite of his sandwich and says with a full mouth, \"We need you, or we\u0027ll suck like last year.\" Tristan and Drew nod their heads, agreeing with Brian. Nothing like peer pressure to make one give in. But the truth is I missed these guys. \"Okay, listen,\" I say. \"If there\u0027s a match I can make, I\u0027ll compete.\" Brian holds up a hand for me to give him a high-five. \"That\u0027s what I\u0027m talkin\u0027 \u0027bout.\" I slap his hand. \"You\u0027re seriously pathetic if you think I can single-handedly make a difference.\" Drew shakes his curly-haired head. \"You pinned Vic Medonia, Caleb. The guy is huge and a legend. Remember when you kicked his ass, getting that five point throw-down ten seconds before the round ended?\" \"Drew, please,\" Tristan says. \"Don\u0027t disrespect CB here. It was four minutes when he did the throw-down.\" \"Whatever, Tristan,\" Drew says, \"I forgot you know everything.\" Tristan crosses his arms in front of his chest. \"Damn straight.\"","sourceLink":"https://allnovel.net/leaving-paradise-leaving-paradise-1/page-10.html","bookId":2771,"book":{"id":2771,"title":"Leaving Paradise (Leaving Paradise #1)","description":"Storyline: Leaving Paradise (Leaving Paradise #1) Nothing has been the same since Caleb Becker left a party drunk, got behind the wheel, and hit Maggie Armstrong. Even after months of painful physical therapy, Maggie walks with a limp. Her social life is nil and a scholarship to study abroad—her chance to escape everyone and their pitying stares—has been canceled. After a year in juvenile jail, Caleb’s free . . . if freedom means endless nagging from a transition coach and the prying eyes of the entire town. Coming home should feel good, but his family and ex-girlfriend seem like strangers. Caleb and Maggie are outsiders, pigeon-holed as \"criminal\" and \"freak.\" Then the truth emerges about what really happened the night of the accident and, once again, everything changes. It’s a bleak and tortuous journey for Caleb and Maggie, yet they end up finding comfort and strength from a surprising source: each other.","cover":"https://allnovel.net/images/leaving-paradise-leaving-paradise-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/leaving-paradise-leaving-paradise-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:15:21 PM"}}
