{"id":86612,"no":22,"title":"Page 22","content":"\"Nope. The next time I kiss you I\u0027m gonna take my time, and you said your mom\u0027s coming home any minute.\"\\n\\n I check the clock on my nightstand and nod.\\n\\n He bites his bottom lip, deep in thought. \"No, the next time I kiss you it\u0027ll last a long, long time. And when we\u0027re done you\u0027re gonna realize being turned on is not about experience.\"\\n\\n While I\u0027m still awestruck, Caleb heads out of the house.\\n\\n THIRTY-ONE\\n\\n Caleb\\n\\n It\u0027s Sunday. Football Sunday. I\u0027m hanging at Dusty\u0027s Sports Bar \u0026 Grill with the guys, since we can sit in the dining area and watch the game from the three large screens plastered throughout the restaurant.\\n\\n The place is run-down--even the dark, wooden tables and chairs wobble because they\u0027re so old. But their TV screens are big and new, which brings guys from the closest three towns on Sunday afternoons.\\n\\n I wonder what Maggie\u0027s doing today. She works for Mrs. Reynolds in the mornings, but she\u0027ll probably head home early. Is she home now, sitting in her bedroom? Or is she at physical therapy?\\n\\n \"Did you see that, Becker?\" Tristan asks as the crowd in the bar groans.\\n\\n \"Sorry, man, I missed it.\" I was thinking about someone I have no right thinking about.\\n\\n Shaking his head, Tristan points to the screen. \"I swear, Guerrera needs some glue on his hands in order to keep the ball in his grip. That\u0027s his third fumble.\"\\n\\n \"Fourth,\" Drew corrects him.\\n\\n I\u0027m not into the game today.\\n\\n I catch Brian looking at the doorway and signaling over whoever just came into the restaurant. I turn around. It\u0027s Kendra. Followed by Hannah, Brianne, Danielle, and Sabrina. I don\u0027t think their wrestling cheer will go over too well at this place. But then again, maybe it will.\\n\\n \"What are the girls doing here?\" a balking Tristan asks Brian, who obviously invited them.\\n\\n \"Can\u0027t we change the rules just this once? Kendra really wanted to come.\"\\n\\n \"Ugh, I\u0027m gonna be sick,\" Drew says, then fake gags. \"She\u0027s got you by the balls, man. When are you gonna see it?\\n\\n Drew, the self-proclaimed asshole of our group, for the first time in his life is right on. Just as I\u0027m about to proclaim Drew an insightful genius, the girls reach the table. Kendra is wearing tight jeans and a Bears jersey. Brian\u0027s jersey, the same one I remember him wearing every Sunday.\\n\\n Brian is staring at his trophy girl, and it\u0027s making me sick too. Because if that\u0027s what I looked like when I was dating her, all grateful that a girl like her chose to gift me with being her boyfriend. Someone shoot me right now.\\n\\n \"Can we join you guys?\" Kendra asks, but as the words spew out of her mouth she\u0027s already pulling up a chair next to Brian and motioning for the girls to find some chairs, too.\\n\\n Seriously, this is a huge violation of the \"no girls allowed for Sunday ball games\" code. I can tell Tristan and Drew are not happy about the invasion of chicks. The reason the rule was created in the first place was that we all agreed girls (at least the ones in our group, a.k.a. the ones sitting down at our table right now) are not interested in watching the game. They\u0027re interested in breaking our concentration. It\u0027s like a challenge, to see if they can distract us from football.\\n\\n \"Hey, Caleb,\" Danielle says as she parks her chair next to me. \"Whatcha been up to?\"\\n\\n Before I can answer, the waitress comes over to our table to slap down our food and ask the girls what they\u0027d like to order.\\n\\n \"What kind of salads do you have?\" Brianne asks.\\n\\n The waitress stifles a laugh. \"No salads. We got burgers, chicken sandwiches, wings, and fries. Take your pick.\"\\n\\n Brianne is stunned by the choices. I can tell by the way she looks at the waitress in horror. This place is all about the beer/alcohol for the over-twenty-one crowd. Food is the afterthought. \"I\u0027ll just have a Diet Coke,\" she finally says.\\n\\n All of the girls order Diet Cokes. Nothing else. Tristan rolls his eyes.\\n\\n \"Wait!\" Sabrina says, calling the waitress back. \"I\u0027ll have a burger. No cheese, just plain.\"\\n\\n \"One plain burger, five Diet Cokes,\" the waitress repeats before retreating.\\n\\n \"I\u0027ll have a burger, too,\" Danielle says, piping in. \"Plain, like hers.\"\\n\\n \"Two burgers, five Diet Cokes.\"\\n\\n Brianne raises her eyebrows.\\n\\n Danielle shrugs. \"What? I didn\u0027t have lunch and I\u0027m starving. Besides, I\u0027m off the no-carb thing, Brianne.\"\\n\\n Drew stands abruptly and puts his hands up. \"Okay, if you girls want to join us, there\u0027s got to be a few rules. No talking about salads, and I don\u0027t even want to hear the word \u0027carb.\u0027 If you didn\u0027t come here to talk about the Bears or football, or to reminisce about the year 1985, be silent. And for God\u0027s sake, if you don\u0027t know which side to root for, I expect no cheering or comments. Got it?\"\\n\\n Kendra\u0027s eyebrows are furrowed. \"What happened in 1985? Drew, I hate to tell you but we weren\u0027t even born yet.\"\\n\\n While Drew slaps his forehead in frustration, an embarrassed Brian covers Kendra\u0027s mouth. \"That was the last year the Bears won the Super Bowl,\" Brian informs her.\\n\\n He removes his hand from Kendra\u0027s mouth.\\n\\n \"You do know what the Super Bowl is, don\u0027t you?\" Drew asks, sitting down at last.\\n\\n \"Of course she does,\" Brian comments, then pulls Kendra close and keeps his arm draped over her shoulders.\\n\\n The rest of the quarter is met with silence from the girls and hoots and hollers from the rest of the people in the restaurant. When I happen to glance at Kendra and Brian during a commercial break, her gaze is directed at me as she whispers something in Brian\u0027s ear to make him smile mischievously.\\n\\n I swear I just caught her licking his lobe, too.\\n\\n Disgusted, I get up and head to the can. After I pee, I wash my hands and lean over the sink while I check out my reflection in the mirror. I\u0027m a fucking mess, unable to just chill and hang out with my friends. Especially not with the girls here. Especially not with Kendra here. She puts my nerves on edge, reminding me of the past. The accident. Maggie.\\n\\n The door to the men\u0027s room opens and sure enough Kendra walks in. I\u0027m not surprised.\\n\\n \"Your boyfriend\u0027ll follow you in here,\" I tell her.\\n\\n She saunters close to me, close enough I can smell her strong perfume mixed with cherry lip gloss. Total overkill.\\n\\n \"He won\u0027t. He thinks you\u0027re upset, so I told him I\u0027d talk to you. He trusts us both.\"\\n\\n \"He\u0027s an idiot.\"\\n\\n \"He also thinks you\u0027re jealous. Are you?\"\\n\\n \"Oh, yeah,\" I tell her. She wants to hear it, so I give her what she wants. It\u0027s a game she likes to play. I\u0027m tired of playing games, but it\u0027s the only way to deal with her.\\n\\n \"You\u0027ve been elusive, CB.\" try busy.\\n\\n \"I thought we had an understanding.\"\\n\\n The only relationship I want is the one I already have, with Maggie. It might not be public, but it\u0027s genuine.\\n\\n The nagging thing is, I don\u0027t know what Kendra knows. Every time we\u0027re together, she hints she knows more about the accident than everyone else. But what if she doesn\u0027t, what if she\u0027s yanking my chain? We were both so plastered that night, and she\u0027s a lightweight. Maybe my ex has been playing me this whole time and I\u0027m a sucker just like Brian.\\n\\n No matter how much I want to, I can\u0027t risk alienating her.\\n\\n She creeps her fiery-red fingertips up my shirt like a spider, stopping when she gets to my shoulder. Then she leans in. \"You\u0027re like a drug, Caleb. I can\u0027t quit.\"\\n\\n She\u0027s thriving on the chase. Not me. It probably turns her on that someone can walk in any minute and catch us this close together. It\u0027s the risk factor giving her the rush. \"So why are you suckin on another guy\u0027s ear?\" I don\u0027t know why I asked. It\u0027s not that I even care. I put my hand on her waist, ready to push her away if she comes closer. I\u0027m so done with being her pawn.\\n\\n \"I just wanted to get a reaction out of you. It worked. For the past couple of weeks you\u0027ve given me nothing, no emotion or encouragement. Brian thinks you\u0027re into Maggie Armstrong. Isn\u0027t that ridiculous?\"\\n\\n Just when I\u0027m about to answer, the door opens. Drew comes in, seeing Kendra and me standing close, touching each other in what might look like an embrace. It\u0027s not what it seems, but it looks bad.\\n\\n \"I\u0027m not even gonna ask,\" Drew says, then heads to the urinals. Before he slides his zipper down, he turns his head to Kendra. \"Do you mind taking this somewhere else?\"\\n\\n \"It\u0027s nothing I haven\u0027t seen before,\" Kendra says to Drew as she steps away from me, breaking all contact.\\n\\n Drew gives a short laugh. \"Yeah, well you may have made the rounds with my friends, but you ain\u0027t getting your hands on mine.\"\\n\\n \"From what I\u0027ve heard, one hand would be enough,\" Kendra shoots back.\\n\\n \"Enough,\" I say. \"Kendra, go back to Brian. Drew, take a leak already.\"\\n\\n Hurt that I haven\u0027t defended her, she storms out of the men\u0027s bathroom, but not before murmuring, \"asshole\" to Drew on her way out, to which Drew responds, \"slut.\"\\n\\n Drew finishes, then as he washes his hands he says, \"Caleb, you think hooking up with Kendra is the answer? Listen, let Brian have the bitch and move onto someone else.\"\\n\\n \"It\u0027s a little more complicated than that.\" Drew makes a tsking noise, just like Mrs. Reynolds. \"You\u0027re making it complicated.\" Then it hits me.\\n\\n For the second time today, Drew is right on. I\u0027m letting Kendra manipulate me instead of the other way around. I don\u0027t need to appease her. I can just let her keep the chase going without giving her a chance to go in for the kill. Wow, I\u0027ve been going about this whole situation all wrong,\\n\\n I can\u0027t believe the solution is so simple. I take out my wallet and hand Drew a twenty. \"Here, pay my bill. I\u0027m outta here.\"\\n\\n \"You don\u0027t have to leave. I\u0027m not gonna tell Brian what you and Kendra were doing.\"\\n\\n \"At this point, I don\u0027t even care,\" I say, then leave the men\u0027s room and head out the back door.\\n\\n THIRTY-TWO\\n\\n Maggie\\n\\n Caleb comes over in the afternoon, totally unexpected. I open the door to answer it and here he is, standing in front of me with a determined look on his face.\\n\\n \"I wanted to see you,\" is all the explanation I get. \"Is your mom home?\"\\n\\n \"No. She just left for work five minutes ago.\" Caleb and I are friends. Okay, we\u0027re more than friends. It\u0027s strange and complicated, but it\u0027s the only unstrained friendship I have.\\n\\n I lead him to my room and have him wait there while I bring up some drinks and chips. We sit on the floor and munch on the chips. We talk about school and wrestling, and laugh about the times when we were kids in preschool and the stupid things we did. Then we play gin with the playing cards my mother got me when I was in the hospital. He doesn\u0027t talk about kissing at all. He doesn\u0027t even look at me with that hot, wanting look I\u0027ve seen before. He\u0027s got something on his mind. I don\u0027t know what it is, but it\u0027s distracting him.\\n\\n After a while he puts down the cards and says, \"I want to help you, Maggie.\"\\n\\n \"With what?\"\\n\\n \"Playing tennis again. I always see you looking into the closet like there\u0027s a monster in there, so I checked it out while you were in the kitchen. I found your racquet.\"\\n\\n I stand up. My heart starts racing as I hobble away from him. \"I\u0027m never playing again.\"\\n\\n He stands, too. \"I\u0027m not trying to hurt you, Maggie. I\u0027m trying to help.\"\\n\\n I turn my back to him. \"I can\u0027t play.\" \\n\\n","sourceLink":"https://allnovel.net/leaving-paradise-leaving-paradise-1/page-22.html","bookId":2771,"book":{"id":2771,"title":"Leaving Paradise (Leaving Paradise #1)","description":"Storyline: Leaving Paradise (Leaving Paradise #1) \\n Nothing has been the same since Caleb Becker left a party drunk, got behind the wheel, and hit Maggie Armstrong. Even after months of painful physical therapy, Maggie walks with a limp. Her social life is nil and a scholarship to study abroad—her chance to escape everyone and their pitying stares—has been canceled. \\n After a year in juvenile jail, Caleb’s free . . . if freedom means endless nagging from a transition coach and the prying eyes of the entire town. Coming home should feel good, but his family and ex-girlfriend seem like strangers. \\n Caleb and Maggie are outsiders, pigeon-holed as \"criminal\" and \"freak.\" Then the truth emerges about what really happened the night of the accident and, once again, everything changes. It’s a bleak and tortuous journey for Caleb and Maggie, yet they end up finding comfort and strength from a surprising source: each other.\\n","cover":"https://allnovel.net/images/leaving-paradise-leaving-paradise-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/leaving-paradise-leaving-paradise-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:15:21 PM"}}
