{"id":86597,"no":7,"title":"Page 7","content":"Man, Kendra looked hot. Her hair is cut different than I remember, her shirt a little tighten How will she react when she sees me? Will she throw herself into my arms or will she play it cool? I miss her. I gaze at the wrestling mats piled in the corner of the gym. Kendra used to cheer me on during matches. I remember the last wrestling tournament I competed in. I jumped two weight classes to wrestle the big guy. It was a 1-1 tie before I made my move. His legs were as dense as a python, but I was quicker. I\u0027ll never forget his name ... Vic Medonia. I wasn\u0027t intimidated, although I probably should\u0027ve been. Vic was last year\u0027s state champion. But I won the match. The guy had one word to say to me after the match. Later. I was arrested a week later. \"You\u0027re back.\" Coach Wenner is standing at the door to the gym, eyeing me. I shove my hands into my jean pockets. \"That\u0027s what they tell me.\" \"You gonna wrestle for me this season?\" \"No.\" \"My team could sure use a good one-sixty-five.\" \"I\u0027m one-eighty now.\" The coach whistles in awe. \"You sure? You look leaner than I remember.\" \"I\u0027ve worked out a lot. Muscle weight.\" \"Don\u0027t tease me like that, Becker.\" I laugh. \"I\u0027ll come to some matches. To watch.\" Coach Wenner slaps the wrestling mats. \"We\u0027ll see. Maybe when the season starts you won\u0027t be able to resist.\" I check my watch. I better get back and finish those exams. \"I gotta get back to Meyer\u0027s office.\" \"If you change your mind about joining the team, you know where to find me.\" \"Yeah,\" I say, then walk down the hall. Back in the office, Meyer plops the next test in front of me. Damn. I forgot to eat. Now the words on the page are blurred, the knot on the back of my neck is throbbing, and Meyer is staring at me from his desk. The guy sits there, his eyebrows raised like little French accents over his eyes. \"Something wrong?\" I shake my head. \"No, sir.\" \"Then get to work.\" Easy for him to say. He doesn\u0027t have to take a social studies test the president of the United States wouldn\u0027t have a chance in hell of passing. I should purposely flunk it; that\u0027ll show \u0027em. Then I can skip my last year of high school. There\u0027s no way my ma will let me be a junior again. Or will she? I fill out answers until my pencil wears down and my ass is numb from sitting on the hard metal chair. It\u0027s a fifty-fifty chance I\u0027ve passed Morehouse\u0027s stupid test. Only two more of the things to go before I can leave for the day. Two hours later, I answer the final question on the last test. I almost smile. Almost. My brain is too tired to use any facial muscles. So when Meyer dismisses me, I practically run from his office. I have to take a bus to the hardware store. Bus number 204 from Hampton will stop a block away from school at three twenty-nine. My watch says three twenty-seven. That gives me two minutes to run to the bus. I\u0027m ready to book as fast as I can to catch the thing, because if I don\u0027t, Damon\u0027ll know I was late. As soon as the bus is in sight, Brian Newcomb steps in front of me, holding his hand to my chest and stopping me. \"Caleb, buddy, I\u0027ve been looking all over for you.\" Brian and I had been best friends since kindergarten. We haven\u0027t talked for almost a year. I told him not to visit me in jail, so I don\u0027t know if we\u0027re still buds. But right now isn\u0027t the time to find out. Community service sucks, but I have to do it. My freedom depends on it. \"Wha\u0027s up, Brian?\" I say quickly, then look behind him as the bus pulls away from the stop. Shit. \"You know. Nothing ... and everything. What up with you?\" \"Oh, you know. Getting used to living without bars in my bedroom.\" There\u0027s one of those really long pauses, where Brian looks like he doesn\u0027t know how to respond, before finally saying, \"That was a joke, right?\" \"Right.\" Not really. Brian laughs, but there\u0027s something else behind it. Nervousness? What reason does he have to be nervous? The guy knows me better than my own mother. I narrow my eyes at my friend who\u0027d been my confidante since kindergarten. \"Are we cool?\" I ask. There\u0027s a slight, almost unnoticeable hesitation. But I see it, and, more importantly, feel it. \"Yeah, we\u0027re cool,\" Brian says. The bus turns the corner. \"I gotta go.\" \"You need a ride? My dad got a new Yukon and gave me his,\" Brian says, jangling the keys to the car in front of my face. I\u0027d settle for an old, rusted junker at this point. I murmur a \"No, thanks,\" because I learned in jail not to have expectations or rely on others. \"Listen, I\u0027m sorry I never wrote. There were crazy things going on and you told me not to visit...\" \"Don\u0027t sweat it. It\u0027s over, man.\" Brian shifts his feet. \"I\u0027d still like to talk about it.\" \"I said it\u0027s over. I really got to go,\" I say, then start walking toward The Trusty Nail. The last thing I need is my best friend acting stranger than my mom. I have enough to deal with right now, like how Damon is going to spit fire when he hears I was late for my first day of community service. TWELVE Maggie I borrowed a Frommer\u0027s book about Spain at the library today. Looking in the mailbox after school, I say a little prayer, hoping the information packet arrived. There\u0027s a letter from the program, not a packet. I rip the envelope open, getting a paper cut as I slide my finger between the folds. I don\u0027t care. This is my ticket out, my chance to get away from Caleb and Paradise. Time to forget the accident and get psyched about independence and anonymity. I unfold the letter quickly, as if it\u0027s the Golden Ticket in Willy Wonka and the Chocolate Factory. I have a huge smile on my face as I read the letter. To: Miss Margaret Armstrong From: International Exchange Student (IES) Program Dear Miss Armstrong: It has come to the attention of our IES committee that the scholarship for which you originally applied was an athletic scholarship. Since your records indicate you have not been active on a high school athletic team for the past twelve months, I\u0027m sorry to inform you that your scholarship has been revoked. We are under legal limitations to distribute the athletic scholarships solely to current high school athletes. You are still welcome to participate in the IES program provided you arrange your own transportation and pay tuition costs which include discounted room and board on the University of Barcelona campus. The cost of tuition for one semester of high school in the IES program is $4,625. Please remit payment by December 15th to the IES office in order to hold your place in the program. If you have any questions, please don\u0027t hesitate to contact me. Sincerely, Helena Cortez, President International Exchange Student program, University of Barcelona, Spain When my brain comprehends the words scholarship revoked, my smile instantly fades. \"I can\u0027t go,\" I whisper. Mom had to work overtime just to get me a Juicy Couture outfit that cost a hundred dollars. There\u0027s no way we can afford over four thousand dollars. I squeeze my eyes shut. This isn\u0027t happening. Not now. My hands start to shake again. I feel them shivering as I cover my eyes with my palms. When my mom gets home from work in the evening, I hold the letter out to her. \"Okay, don\u0027t panic,\" she says after reading it. \"There must be some way we can manage.\" \"Mom, it\u0027s useless to even think about. We don\u0027t have that kind of money.\" \"My boss might let me work enough overtime. Let\u0027s see ...\" She grabs a piece of paper and starts scribbling numbers down. \"Mom, forget it.\" \"Wait. Sixty hours a week minimum, sometimes seventy ... and if I work on Thanksgiving and add in my Christmas bonus--\" \"Mom!\" She stops writing and looks up at me. \"What?\" \"Stop writing, stop compensating ... just stop.\" I\u0027m depressed enough as it is without watching her attempt to kill herself to make me happy. I\u0027ll figure this out. But it\u0027s my problem, not hers. The phone rings. It\u0027s Mr. Reynolds telling my mom she forgot her paycheck at work. Now she\u0027s got to go back and get it. \"Come with me, Maggie.\" \"I don\u0027t want to.\" \"Oh, come on. I saw Irina baking some new pies this afternoon. Pie always cheers you up.\" Irina is one of the chefs at the diner. She likes having me try her new pie creations before she offers them on the menu. Irina\u0027s pies are one of the reasons I\u0027ve gained weight this past year. At the mention of pie, I give in. If there was any time I need pie to cheer me up, this is it. \"The place is crowded tonight,\" Mom says to Mr. Reynolds when he hands her the forgotten paycheck. Mr. Reynolds, usually so calm and in control, seems panicked. \"It\u0027s the men\u0027s bowling league,\" he explains. \"They just came in and Yolanda went home sick ten minutes ago.\" There\u0027s about thirty hungry men milling around the tables, and I only see Tony, a new waiter, looking more frazzled than Mr. Reynolds. Mom taps her boss on the shoulder. \"If you need help, I\u0027m sure Maggie won\u0027t mind if I stay for a bit.\" Mr. Reynolds smiles. \"Really? That would be great.\" \"No problem.\" \"You\u0027re the best, Linda. I owe you one.\" My mom rolls her eyes playfully as she heads behind the counter to wrap an apron around her waist. \"You owe me more than one, Lou, but we can discuss it later.\" \"You got it,\" he says, then rushes to greet new customers who\u0027ve just walked in the door. Mom scurries to the group to help Tony take orders while I follow behind her with a pitcher, filling water glasses. After I pour the water, Mom tells me to sit down at a booth. I pull out the Frommer\u0027s book on Spain from my purse and stare at it longingly. If only we were as rich as Kendra\u0027s parents, I\u0027d be able to go to Spain. Even if we were as rich as Caleb and Leah\u0027s parents, we\u0027d probably be able to afford it without thinking twice. Their dad is an oral surgeon and has just about every southwest Illinois resident as a patient. It\u0027s times like these I wish my dad and mom never got divorced. I can pretend to forget about the fights, the screaming, the anger lurking around every corner of the house. Mom said they just grew apart while he traveled for work and she stayed home. When he came home on weekends, he wanted to relax while my mom wanted to go out. Eventually Dad stopped coming home on weekends. And Mom stopped caring if he was home. I\u0027m not sure where Judy (his new wife) fits into the divorce equation. I miss my dad, but he never asks me to come to Texas and visit. I don\u0027t want to ask him why he doesn\u0027t invite me because, to be completely honest, I don\u0027t want to hear he doesn\u0027t want me as a part of his new life. As I\u0027m waiting for my mom, Irina comes out of the kitchen. \"Moggie, Moggie!\" she says excitedly in her heavy Russian accent, \"I hove a new pie for you.\" \"Is it with carrots?\" I ask, worried. The last time Irina made a carrot pie using an old family recipe of hers, there were chunks of carrots in the middle. I\u0027m happy to say it didn\u0027t end up on the menu. \"I promise no weggies. It\u0027s a vhite pie viz chocolate cheeps and graham cracker crumbs laced viz caramel. Sounds delicious, no?\"","sourceLink":"https://allnovel.net/leaving-paradise-leaving-paradise-1/page-7.html","bookId":2771,"book":{"id":2771,"title":"Leaving Paradise (Leaving Paradise #1)","description":"Storyline: Leaving Paradise (Leaving Paradise #1) Nothing has been the same since Caleb Becker left a party drunk, got behind the wheel, and hit Maggie Armstrong. Even after months of painful physical therapy, Maggie walks with a limp. Her social life is nil and a scholarship to study abroad—her chance to escape everyone and their pitying stares—has been canceled. After a year in juvenile jail, Caleb’s free . . . if freedom means endless nagging from a transition coach and the prying eyes of the entire town. Coming home should feel good, but his family and ex-girlfriend seem like strangers. Caleb and Maggie are outsiders, pigeon-holed as \"criminal\" and \"freak.\" Then the truth emerges about what really happened the night of the accident and, once again, everything changes. It’s a bleak and tortuous journey for Caleb and Maggie, yet they end up finding comfort and strength from a surprising source: each other.","cover":"https://allnovel.net/images/leaving-paradise-leaving-paradise-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/leaving-paradise-leaving-paradise-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:15:21 PM"}}
