{"id":87431,"no":4,"title":"Page 4","content":"I clear my throat and break our stare as I grab an available cart next to us and hand him the grocery list.\n “Does it always snow in September?” I ask in an attempt to appear unfazed by his touch.\n He lays his jacket across the side of the shopping cart. “No, it won’t last more than a few days, maybe a week. Most of the time the snow doesn’t start until late October,\" he says. \"You’re lucky.”\n “Lucky?\"\n \"Yeah. It’s a pretty rare cold front. You got here right in time.\"\n \"Huh. I assumed most of y’all would hate the snow. Doesn’t it snow here most of the year?”\n “Y’all?” he laughs.\n “What?”\n “Nothing,\" he says with a smile on his face. \"I’ve just never heard anyone say ‘y’all’ in real life before. It’s cute. So southern belle.”\n “Oh, I’m sorry,\" I laugh. \"From now on I’ll do like you Yankees and waste my breath by saying \u0027all you guys.’”\n He laughs and nudges my shoulder. “Don’t. I like your accent, it’s perfect.”\n I can’t believe I’ve actually turned into a girl who swoons over a guy. I detest it so much; I start to inspect his features more intently, trying to find a flaw. I can’t. Everything about him so far is perfect.\n We get most of the items on our list and head to the checkout. He refuses to let me put anything on the conveyor belt, so I just stand back and watch as he unloads the items from the buggy. The last item he places on the line is a box of bandages. I never even saw him grab them.\n When we pull out of the grocery store, Will tells me to turn in the opposite direction in which we came. We drive maybe two whole blocks when he instructs me to turn left-onto our street. The drive that took us twenty minutes on the way there takes us less than a minute on the way back.\n \"Nice,\" I laugh as I pull in my driveway. I realize what he\u0027s done and that the flirtation on his end is blatantly obvious.\n I park the car, remove the keys from the ignition and grab my purse. Will has already rounded to the back of the jeep so I press the trunk lever for him. I get out and walk to where he is, expecting him to have an armload of groceries. Instead, he\u0027s just standing there holding the trunk up, watching me.\n With my best southern belle impression, I place my hand across my chest and say, \"Why! I never would have been able to find the store without your help. Thank you so much for your hospitality kind sir.\"\n I sort of expect him to laugh, but he just stands there, staring at me.\n \"What?\" I ask nervously.\n He takes a step toward me and softly cups my chin with his free hand. I\u0027m shocked by my own reaction; the fact that I allow it. He studies my face for a few seconds as my heart races within my chest. I think he\u0027s about to kiss me.\n I attempt to calm my breathing as I stare up at him. He steps in even closer and removes his hand from my chin and places it on the back of my neck, leaning my head in toward him. His lips press gently against my forehead, lingering a few seconds before he releases his hand and steps back.\n \"You\u0027re so cute,\" he says as he reaches in the trunk and grabs four sacks with one hefty swoop. He walks toward the house and sets them at the entryway outside the door.\n I\u0027m frozen, attempting to absorb the last fifteen seconds of my life. Where did that come from? Why did I just stand there and let him do that? Despite my objections I realize, almost pathetically, that I have just experienced the most passionate kiss I\u0027ve ever received from a guy, and it was on the freaking forehead!\n As Will is reaching into the trunk for another handful of groceries, Kel and Caulder run out of the house, followed by my mother.\n The boys dart across the street to check out Caulder’s bedroom. Will politely extends his hand out to my mother as she walks toward us.\n “You must be Layken and Kel’s mom. I’m Will Cooper. We live across the street.”\n \"Julia Cohen,\" she says. \"You\u0027re Caulder\u0027s older brother?\"\n \"Yes, Ma’am,\" he replies. \"Older by twelve years.\"\n \"So that makes you…twenty-one?\" She turns toward me and winks.\n Oh no, she\u0027s trying to embarrass me. I\u0027m standing behind Will at this point, so I take the opportunity to reciprocate one of her infamous glares. She just smiles.\n “Well, I\u0027m glad Kel and Lake were able to make friends so fast,” she says.\n \"Me too,\" he replies.\n She turns and heads inside but purposefully nudges me with her shoulder as she passes. She doesn\u0027t speak a word but I know what she\u0027s hinting at; she\u0027s giving me her approval.\n Will reaches in for the last two sacks. \"Lake, huh? I like that.\" He hands me the sacks as he shuts the trunk.\n \"So, Lake.\" He leans back against the car and crosses his arms. \"Caulder and I are going to Detroit on Friday. We’ll be gone until late Sunday, family stuff,\" he says with a dismissing wave of his hand. \"I was wondering if you had any plans for tomorrow night, before I go?\"\n It\u0027s the first time anyone has ever referred to me as \"Lake,\" other than my mom and dad. I like it. I lean my shoulder against the car too, and face him. I try to keep my cool, but inside I\u0027m screaming with excitement.\n \"Are you really going to make me admit that I have absolutely no life here?\" I say.\n \"Great! It\u0027s a date then. I\u0027ll pick you up at seven-thirty.\" He immediately turns and heads toward his house when I realize he never actually asked, and I never actually agreed.\n 2.\n \"It won\u0027t take long for me\n To tell you who I am.\n Well you hear this voice right now\n Well that\u0027s pretty much all I am.\"\n -The Avett Brothers, Gimmeakiss\n Chapter Two\n The next afternoon, I\u0027m picking out what to wear but can\u0027t seem to locate any clean, weather appropriate clothing. I don\u0027t own many winter shirts, besides what I\u0027ve already worn this week. I choose a purple long sleeved shirt and smell it, deciding it\u0027s clean enough. I spray some perfume though, just in case it isn\u0027t. I brush my teeth, touch up my makeup, brush my teeth again and let down my ponytail. I curl a few sections of my hair and pull some silver earrings out of my drawer when I hear a knock on the bathroom door.\n My mother enters with a handful of towels. She opens the cabinet next to the shower and places them inside.\n \"Going somewhere?\" she asks. She sits down on the edge of the bathtub while I continue to get ready.\n \"Yes, somewhere.\" I try to hide my smile as I put in my earrings. \"Honestly, I\u0027m not sure what we\u0027re doing. I really never even agreed to the date.\"\n She stands up and walks to the door, leaning up against the frame as she watches me in the mirror. She has aged so much in the short time since my dad\u0027s death. Her bright green eyes against her smooth porcelain skin used to be breathtaking. Now, her cheekbones stand out above the hallowed shadows in her cheeks. The dark circles under her eyes overpower their emerald hue. She looks tired. And sad.\n \"Well, you\u0027re eighteen now. You\u0027ve had enough of my dating advice for a lifetime,\" she says. \"But I\u0027ll provide you with a quick recap just in case. Don\u0027t order anything with onion or garlic, never leave your drink unattended and always use protection.\"\n \"Ugh, Mom!\" I roll my eyes. \"You know I know the rules, and you know I don\u0027t have to worry about the last one. Please don\u0027t give Will a recap of your rules. Promise?\" I make her promise.\n \"So tell me about Will. Does he work? Is he in college? What\u0027s his major? Is he a serial killer?\" She says this with such sincerity.\n I walk the short distance to my bedroom from the bathroom and bend down to search through my shoes. She follows me and sits on the bed.\n \"Honestly Mom, I don\u0027t know anything about him. I didn\u0027t even know how old he was until he told you.\"\n \"That\u0027s good,\" she says.\n \"Good?\" I glance back at her. \"How is not knowing anything about him good? I\u0027m about to be alone with him for hours. He could be a serial killer.\" I grab my boots and walk over to the bed to slip them on.\n \"It’ll give you plenty to talk about. That\u0027s what first dates are for.\"\n \"Good point,\" I say.\n Growing up, my mother did give great advice. She always knew what I wanted to hear, but would tell me what I needed to hear. My dad was her first boyfriend so I have always been curious how she seems to know so much about dating, boys, and relationships. She\u0027s only been with one person, and it seems most knowledge would have to come from life experiences. She\u0027s the exception, I guess.\n \"Mom?\" I say as I slip on my boots. \"I know you were only eighteen when you met dad. I mean, that\u0027s really young to meet the person you spend the rest of your life with. Do you ever regret it?\"\n She doesn\u0027t answer immediately. Instead, she lies back on my bed and clasps her hands behind her head as she ponders my question.\n \"I\u0027ve never regretted it. Questioned it? Sure. But never regretted.\"\n \"Is there a difference?\" I ask.\n \"Absolutely. Regret is counterproductive. It\u0027s looking back on a past that you can\u0027t change. Questioning things as they occur can prevent regret in the future. I questioned a lot about my relationship with your father. People make spontaneous decisions based off of their hearts all the time. There\u0027s so much more to relationships than just love.\"\n \"Is that why you always tell me to follow my head, not my heart?”\n My mother sits up on the bed and takes my hands in hers as she speaks. \"Lake, do you want some real advice that doesn\u0027t include a list of foods you should avoid?\"\n Has she been holding out on me? \"Of course,\" I reply.\n She\u0027s lost the authoritative, parented edge to her voice, which makes me aware that this conversation is less from a mother-daughter standpoint and more woman to woman. She pulls her legs up Indian style on the bed and faces me.\n \"There are three questions every woman should be able to answer yes to before they commit to a man. If you answer no to any of the three questions, run like hell.\"\n \"It\u0027s just a date,\" I laugh. \"I doubt we\u0027ll be doing any committing.\"\n \"I know you\u0027re not, Lake. I\u0027m serious. If you can\u0027t answer yes to these three questions, don\u0027t even waste your time on a relationship.\"\n When I open my mouth, I feel like I\u0027m just reinforcing the fact that I\u0027m her child. I don\u0027t interrupt her again.\n \"Does he treat you with respect at all times? That’s the first question. The second question is, if he is the exact same person twenty years from now that he is today, would you still want to marry him? And finally, does he inspire you to want to be a better person? You find someone you can answer yes to all three, then you’ve found a good man.\"\n \"Wow, those are some intense questions.\" I take a deep breath as I soak in even more sage advice from her. \"Were you able to answer yes to all of them? When you were with Dad?\"\n \"Absolutely.\" She doesn\u0027t hesitate. \"Every second I was with him.\"\n I watch the sadness enter her eyes as she finishes her sentence. She loved my dad. I start to regret bringing it up. I put my arms around her and embrace her. It\u0027s been so long since I\u0027ve hugged her, a twinge of guilt rises up inside me. She kisses my hair, then pulls away and smiles. \n","sourceLink":"https://allnovel.net/slammed-slammed-1/page-4.html","bookId":2779,"book":{"id":2779,"title":"Slammed (Slammed #1)","description":"Storyline: \n Slammed (Slammed #1) \n Following the unexpected death of her father, 18-year-old Layken is forced to be the rock for both her mother and younger brother. Outwardly, she appears resilient and tenacious, but inwardly, she\u0027s losing hope. \n Enter Will Cooper: The attractive, 21-year-old new neighbor with an intriguing passion for slam poetry and a unique sense of humor. Within days of their introduction, Will and Layken form an intense emotional connection, leaving Layken with a renewed sense of hope. \n Not long after an intense, heart-stopping first date, they are slammed to the core when a shocking revelation forces their new relationship to a sudden halt. Daily interactions become impossibly painful as they struggle to find a balance between the feelings that pull them together, and the secret that keeps them apart.\n \n","cover":"https://allnovel.net/images/slammed-slammed-1.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/slammed-slammed-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:21:07 PM"}}
