{"id":96817,"no":1,"title":"Page 1","content":"PROLOGUE 0500 Hours, February 12, 2535 (Military Calendar) / Lambda Serpentis System, Jericho VII Theater of Operations “Contact. All teams stand by: enemy contact, my position.” The Chief knew there were probably more than a hundred of them—motion sensors were off the scale. He wanted to see them for himself, though; his training made that lesson clear: “Machines break. Eyes don’t.” The four Spartans that composed Blue Team covered his back, standing absolutely silent and immobile in their MJOLNIR combat armor. Someone had once commented that they looked like Greek war gods in the armor . . . but his Spartans were far more effective and ruthless than Homer’s gods had ever been. He snaked the fiber-optic probe up and over the three-meter-high stone ridge. When it was in place, the Chief linked it to his helmet’s heads-up display. On the other side he saw a valley with eroded rock walls and a river meandering through it . . . and camped along the banks as far as he could see were Grunts. The Covenant used these stocky aliens as cannon fodder. They stood a meter tall and wore armored environment suits that replicated the atmosphere of their frozen homeworld. They reminded the Chief of biped dogs, not only in appearance, but because their speech—even with the new translation software— was an odd combination of high-pitched squeaks, guttural barks, and growls. They were about as smart as dogs, too. But what they lacked in brainpower, they made up for in sheer tenacity. He had seen them hurl themselves at their enemies until the ground was piled high with their corpses . . . and their opponents had depleted their ammunition. These Grunts were unusually well armed: needlers, plasma pistols, and there were four stationary plasma cannons. Those could be a problem. One other problem: there were easily a thousand of them. This operation had to go off without a hitch. Blue Team’s mission was to draw out the Covenant rear guard and let Red Team slip through in the confusion. Red Team would then plant a HAVOK tactical nuke. When the next Covenant ship landed, dropped its shields, and started to unload its troops, they’d get a thirty-megaton surprise. The Chief detached the optics and took a step back from the rock wall. He passed the tactical information along to his team over a secure COM channel. “Four of us,” Blue-Two whispered over the link. “And a thousand of them? Piss-poor odds for the little guys.” “Blue-Two,” the Chief said, “I want you up with those Jackhammer launchers. Take out the cannons and soften the rest of them. Blue-Three and Five, you follow me up—we’re on crowd control. Blue-Four: you get the welcome mat ready. Understood?” Four blue lights winked on his heads-up display as his team acknowledged the orders. “On my mark.” The Chief crouched and readied himself. “Mark!” Blue-Two leaped gracefully atop the ridge—three meters straight up. There was no sound as the half ton of MJOLNIR armor and Spartan landed on the limestone. She hefted one launcher and ran along the ridge—she was the fastest Spartan on the Chief’s team. He was confident those Grunts wouldn’t be able to track her for the three seconds she’d be exposed. In quick succession, Blue-Two emptied both of the Jackhammer’s tubes, dropped one launcher, and then fired the other rockets just as fast. The shells streaked into the Grunts’ formation and detonated. One of the stationary guns flipped over, engulfed in the blast, and the gunner was flung to the ground. She ditched the launcher, jumped down—rolled once—and was back on her feet, running at top speed to the fallback point. The Chief, Blue-Three, and Blue-Five leaped to the top of the ridge. The Chief switched to infrared to cut through the clouds of dust and propellant exhaust just in time to see the second salvo of Jackhammers strike their targets. Two consecutive blossoms of flash, fire, and thunder decimated the front ranks of the Grunt guards, and most importantly, turned the last of the plasma cannons into smoldering wreckage. The Chief and the others opened fire with their MA5B assault rifles—a full automatic spray of fifteen rounds per second. Armor-piercing bullets tore into the aliens, breaching their environment suits and sparking the methane tanks they carried. Gouts of flame traced wild arcs as the wounded Grunts ran in confusion and pain. Finally the Grunts realized what was happening—and where this attack was coming from. They regrouped and charged en masse . An earthquake vibration coursed through the ground and shook the porous stone beneath the Chief’s boots. The three Spartans exhausted their AP clips and then, in unison, switched to shredder rounds. They fired into the tide of creatures as they surged forward. Line after line of them dropped. Scores more just trampled their fallen comrades. Explosive needles bounced off the Chief’s armor, detonating as they hit the ground. He saw the flash of a plasma bolt—side stepped—and heard the air crackle where he had stood a split second before. “Inbound Covenant air support,” Blue-Four reported over the COM link. “ETA is two minutes, Chief.” “Roger that,” he said. “Blue-Three and -Five: maintain fire for five seconds, then fall back. Mark!” Their status lights winked once, acknowledging his order. The Grunts were three meters from the wall. The Chief tossed two grenades. He, Blue-Three, and Blue-Five stepped backward off the ridge, landed, spun, and ran. Two dull thumps reverberated though the ground. The squeals and barks of the incoming Grunts, however, drowned out the noise of the exploding grenades. The Chief and his team sprinted up the half-kilometer sandstone slope in thirty-two seconds flat. The hill ended abruptly—a sheer drop of two hundred meters straight into the ocean. Blue-Four’s voice crackled over the COM channel: “Welcome mat is laid out, Chief. Ready when you are.” The Grunts looked like a living carpet of steel-blue skin, claws, and chrome weapons. Some ran on all fours up the slope. They barked and howled, baying for the Spartans’ blood. “Roll out the carpet,” the Chief told Blue-Four. The hill exploded—plumes of pulverized sandstone and fire and smoke hurtled skyward. The Spartans had buried a spiderweb pattern of Lotus antitank mines earlier that morning. Sand and bits of metal pinged off of the Chief’s helmet. The Chief and his team opened fire again, picking off the remaining Grunts that were still alive and struggling to stand. His motion detector flashed a warning. There were incoming projectiles high at two o’clock—velocities at over a hundred kilometers per hour. Five Covenant Banshee fliers appeared over the ridge. “New contacts. All teams, open fire!” he barked. The Spartans, without hesitation, fired on the alien fliers. Bullet hits pinged from the fliers’ chitinous armor—it would take a very lucky shot to take out the antigrav pods on the end of the craft’s stubby meter-long “wings.” The fire got the aliens’ attention, however. Lances of fire slashed from the Banshees’ gunports. The Chief dove and rolled to his feet. Sandstone exploded where he had stood only an instant before. Globules of molten glass sprayed the Spartans. The Banshees screamed over their heads—then banked sharply for another pass. “Blue-Three, Blue-Five: Theta Maneuver,” the Chief called out. Blue-Three and -Five gave him the thumbs-up signal. They regrouped at the edge of the cliff and clipped onto the steel cables that dangled down the length of the rock wall. “Did you set up the fougasses with fire or shrapnel?” the Chief asked. “Both,” Blue-Three replied. “Good.” The Chief grabbed the detonators. “Cover me.” The fougasses were never meant to take down flying targets; the Spartans had put them there to mop up the Grunts. In the field, though, you had to improvise. Another tenet of their training: adapt or die. The Banshees formed into a “flying V” and swooped toward them, almost brushing the ground. The Spartans opened fire. Bolts of superheated plasma from the Banshees punctuated the air. The Chief dodged to the right, then to the left; he ducked. Their aim was getting better. The Banshees were one hundred meters away, then fifty meters. Their plasma weapons might recycle fast enough to get another shot . . . and at this range, the Chief wouldn’t be dodging. The Spartans jumped backward off the cliff—guns still blazing. The Chief jumped, too, and hit the detonators. The ten fougasses—each a steel barrel filled with napalm and spent AP and shredder casings—had been buried a few meters from the edge of the cliff, their mouths angled up at thirty degrees. When the grenades at the bottom of the barrels exploded, it made one hell of a barbecue out of anything that got in their way. The Spartans slammed into the side of the cliff—the steel cables they were attached to twanged taut. A wave of heat and pressure washed over them. A heartbeat later five flaming Banshees hurtled over their heads, leaving thick trails of black smoke as they arced into the water. They splashed down, then vanished beneath the emerald waves. The Spartans hung there a moment, waiting and watching with their assault rifles trained on the water. No survivors surfaced. They rappelled down to the beach and rendezvoused with Blue-Two and -Four. “Red Team reports mission objective achieved, Chief,” Blue-Two said. “They send their compliments.” “It’s hardly going to balance the scales,” Blue-Three muttered, and kicked the sand. “Not like those Grunts when they slaughtered the 105th Drop Jet Platoon. They should suffer just as much as those guys did.” The Chief had nothing to say to that. It wasn’t his job to make things suffer—he was just here to win battles. Whatever it took. “Blue-Two,” the Chief said. “Get me an uplink.” “Aye aye.” She patched him into the SATCOM system. “Mission accomplished, Captain de Blanc,” the Chief reported. “Enemy neutralized.” “Excellent news,” the Captain said. He sighed, and added, “But we’re pulling you out, Chief.” “We’re just getting warmed up down here, sir.” “Well, it’s a different story up here. Move out for pickup ASAP.” “Understood, sir.” The Chief killed the uplink. He told his team, “The party’s over, Spartans. Dust-off in fifteen.” They jogged double-quick up the ten kilometers of the beach, and returned to their dropship—a Pelican, scuffed and dented from three days’ hard fighting. They boarded and the ship’s engines whined to life. Blue-Two took off her helmet and scratched the stubble of her brown hair. “It’s a shame to leave this place,” she said, and leaned against the porthole. “There are so few left.” The Chief stood by her and glanced out as they lifted into the air—there were wide rolling plains of palmgrass, the green expanse of ocean, a wispy band of clouds in the sky, and setting red suns. “There will be other places to fight for,” he said. “Will there?” she whispered. The Pelican ascended rapidly through the atmosphere, the sky darkened, and soon only stars surrounded them. In orbit, there were dozens of frigates, destroyers, and two massive carriers. Every ship had carbon scoring and holes peppering their hulls. They were all maneuvering to break orbit. They docked in the port bay of the UNSC destroyer Resolute . Despite being surrounded by two meters of titanium-A battle plate and an array of modern weapons, the Chief preferred to have his feet on the ground, with real gravity, and real atmosphere to breathe—a place where he was in control, and where his life wasn’t held in the hands of anonymous pilots. A ship just wasn’t home. The battlefield was. The Chief rode the elevator to the bridge to make his report, taking advantage of the momentary respite to read Red Team’s after-action report in his display. As predicted, the Spartans of Red, Blue, and Green Teams—augmenting three divisions of battle-hardened UNSC Marines—had stalled a Covenant ground advance. Casualty figures were still coming in, but—on the ground, at least—the alien forces had been completely stonewalled. A moment later the lift doors parted, and he stepped on the rubberized deck. He snapped a crisp salute to Captain de Blanc. “Sir. Reporting as ordered.” The junior bridge officers took a step back from the Chief. They weren’t used to seeing a Spartan in full MJOLNIR armor up close—most line troops had never even seen a Spartan. The ghostly iridescent green of the armor plates and the matte black layers underneath made him look part gladiator, part machine. Or perhaps to the bridge crew, he looked as alien as the Covenant. The view screens showed stars and Jerico VII’s four silver moons. At extreme range, a small constellation of stars drifted closer. The Captain waved the Chief closer as he stared at that cluster of stars—the rest of the battlegroup. “It’s happening again.” “Request permission to remain on the bridge, sir,” the Chief said. “I . . . want to see it this time, sir.” The Captain hung his head, looking weary. He glanced at the Master Chief with haunted eyes. “Very well, Chief. After all you’ve been through to save Jericho Seven, we owe you that. We’re only thirty million kilometers out-system, though, not half as far as I’d like to be.” He turned to the NAV Officer. “Bearing one two zero. Prepare our exit vector.” He turned to face the Chief. “We’ll stay to watch . . . but if those bastards so much as twitch in our direction, we’re jumping the hell out of here.” “Understood, sir. Thank you.” Resolute’s engines rumbled and the ship moved off. Three dozen Covenant ships—big ones, destroyers and cruisers—winked into view in the system. They were sleek, looking more like sharks than starcraft. Their lateral lines brightened with plasma—then discharged and rained fire down upon Jericho VII. The Chief watched for an hour and didn’t move a muscle. The planet’s lakes, rivers, and oceans vaporized. By tomorrow, the atmosphere would boil away, too. Fields and forests were glassy smooth and glowing red-hot in patches. Where there had once been a paradise, only hell remained. “Make ready to jump clear of the system,” the Captain ordered. The Chief continued to watch, his face grim. There had been ten years of this—the vast network of human colonies whittled down to a handful of strongholds by a merciless, implacable enemy. The Chief had killed the enemy on the ground—shot them, stabbed them, and broken them with his own two hands. On the ground, the Spartans always won. The problem was, the Spartans couldn’t take their fight into space. Every minor victory on the ground turned into a major defeat in orbit. Soon there would be no more colonies, no human settlements—and nowhere left to run.","sourceLink":"https://allnovel.net/halo-the-fall-of-reach-halo-1/page-1.html","bookId":1633,"book":{"id":1633,"title":"Halo: The Fall of Reach (Halo #1)","description":"Storyline: Halo: The Fall of Reach (Halo #1) As the bloody Human-Covenant War rages on Halo, the fate of humankind may rest with one warrior, the lone SPARTAN survivor of another legendary battle . . . the desperate, take-no-prisoners struggle that led humanity to Halo--the fall of the planet Reach. Now, brought to life for the first time, here is the full story of that glorious, doomed conflict. While the brutal Covenant juggernaut sweeps inexorably through space, intent on wiping out humankind, only one stronghold remains--the planet Reach. Practically on Earth\u0027s doorstep, it is the last military fortress to defy the onslaught. But the personnel here have another, higher priority: to prevent the Covenant from discovering the location of Earth. Outnumbered and outgunned, the soldiers seem to have little chance against the Covenant, but Reach holds a closely guarded secret. It is the training ground for the very first \"super soldiers.\" Code-named SPARTANs, these highly advanced warriors, specially bioengineered and technologically augmented, are the best in the universe--quiet, professional, and deadly. Now, as the ferocious Covenant attack begins, a handful of SPARTANs stand ready to wage ultimate war. They will kill, they will be destroyed, but they will never surrender. And at least one of them--the SPARTAN known as Master Chief--will live to fight another day on a mysterious and ancient, artificial world called Halo. . . .","cover":"https://allnovel.net/images/halo-the-fall-of-reach-halo-1.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-fall-of-reach-halo-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:22:09 PM"}}
