{"id":96849,"no":33,"title":"Page 33","content":"CHAPTER THIRTY-TWO 0519 Hours, August 30, 2552 (Military Calendar) UNSC Pillar of Autumn , Epsilon Eridani System’s edge Something was wrong. John felt it in his stomach first: a slight lateral acceleration—that became a spin strong enough that he had to brace his legs. The Pillar of Autumn was turning. Every other Spartan in the storage bay felt it as well; they paused as they unloaded equipment from crates and readied the cryo tubes for their journey. The lateral motion slowed and stopped. The Pillar of Autumn ’s engines rumbled like thunder through the hull of the ship. Kelly approached him. “Sir? I thought we were accelerating to enter Slipspace?” “So did I. Have Fred and Joshua continue to prep the tubes. Have Linda get a team and secure our gear. I’ll find out what’s going on.” “Aye, sir.” The Master Chief marched toward the intercom panel. He hated being on spaceships. The lack of control was disturbing. He and the other Spartans were just extra cargo in a space battle. He hesitated as he reached for the intercom. If Captain Keyes was involved in some tricky maneuver or engaging an enemy, the last thing he needed was an interruption. He pressed the button. “Cortana? We’ve changed course. Is there a problem?” Instead of her voice, however, Captain Keyes spoke over the channel: “Captain Keyes to Spartan 117.” He replied, “Here, sir.” “There’s been a change in plans,” Keyes said. There was a long pause. “This will be easier to explain face-to-face. I’m on my way down to brief you. Keyes out.” John turned and the other Spartans snapped to their tasks. Those without specific orders checked and rechecked their weapons and assembled their combat gear. They had all heard the Captain, however. The sound receivers in their armor could pick up a whisper at a hundred meters. And the Spartans didn’t have to be told this was trouble. John clicked on the monitor near the intercom. The fore camera showed the Pillar of Autumn had indeed turned about. Reach’s sun blazed in the center of the screen. They were heading back. Was something wrong with the ship? No. Captain Keyes wouldn’t be coming to brief him if that was the case. There was definitely a snag. The elevator doors opened and Captain Keyes stepped off the lift. “Captain on the deck!” the Master Chief shouted. The Spartans stood at attention. “At ease,” Captain Keyes said. The expression on the Captain’s face suggested that “ease” was the last thing on his mind. He smoothed his thumb over the antique pipe the Master Chief had seen him carry. “There is something very wrong,” Keyes said. He glanced at the other Spartans. “Let’s talk in private,” he told the Master Chief in a low voice. He walked to the monitor over the intercom. “Sir,” the Master Chief said. “Unless you wish to leave the deck, the Spartans will hear everything we say.” Keyes looked at the Spartans and frowned. “I see. Very well, your squad might as well hear this now, too. I don’t know how they found Reach—they bypassed a dozen Inner Colony worlds to get here. It doesn’t matter. They are here. And we have to do something.” “Sir? ‘They’?” “The Covenant.” He turned to the intercom. “Cortana, display the last priority Alpha transmission.” A communiqué flickered on screen, and the Master Chief read: United Nations Space Command ALPHA PRIORITY TRANSMISSION 04592Z-83 Encryption Code:Red Public Key:file /bravo-tango-beta-five From:Admiral Roland Freemont, Commanding Fleet Officer, FLEETCOM Sector One Commander (UNSC Service Number: 00745-16778-HS) To:ALL UNSC warships in REACH, JERICO, and TANTALUS systems Subject:IMMEDIATE RECALL Classification:Classified (BGX Directive) /start file Covenant presence detected on REACH system’s edge coordinates 030 relative. All UNSC warships are hereby ordered to cease all activities and regroup at rally pointZULU at best speed. ALL SHIPSare to enact the Cole Protocol immediately. /end file “Cortana has picked up ship signatures on the Pillar of Autumn ’s sensors,” Captain Keyes said. “She cannot be sure how many because of electrical interference, but there are more than a hundred alien ships inbound toward Reach. We have to go. We have our orders. The Section Three mission has to be scrubbed.” “Sir? Scrubbed?” John had never had a mission canceled. “Reach is our strategic headquarters and our biggest ship-building facility, Master Chief. If the shipyards fall, then Dr. Halsey’s prediction of humanity having only months to survive will shrink to weeks.” The Master Chief normally would never have contradicted a superior officer, but this time duty compelled him. “Sir, our two missions are not mutually exclusive.” Captain Keyes lit his pipe—in defiance of three separate regulations of igniting a combustible on a USNC ship. He puffed once and thoughtfully examined the smoke. “What do you have in mind, Master Chief?” “A hundred alien vessels, sir. Between the combined force of the fleet and Reach’s orbital gun platforms, it is almost guaranteed there will be a disabled ship my squad can board and capture.” Captain Keyes mulled this over. “There will also be hundreds of ships exchanging fire with one another. Missiles, nukes . . . Covenant plasma torpedoes.” “Just get us close enough,” the Master Chief said. “Punch a hole in their shields long enough for us to get on their hull. We’ll do the rest.” Captain Keyes chewed on his pipe. He tucked it into the cup of his hand. “There are operational complications with your plan. Cortana has been running the Pillar of Autumn ’s shakedown. We have our own AI, but by the time we get it initialized and running this ship—the battle may be over.” “I see, sir.” Captain Keyes gazed a moment at the Master Chief, then sighed. “If there is a disabled Covenant ship and if we are close enough to it and if we’re not blown to a million bits by the time we get there, then I’ll transfer Cortana to you. I’ve flown ships without an AI before.” Captain Keyes managed a weak smile, but it quickly disappeared. “Yes, sir!” “We’ll be at rally point Zulu in twenty minutes, Master Chief. Have your team ready by then . . . for anything.” “Sir.” He saluted. Captain Keyes returned the salute and entered the elevator, puffing on his pipe and shaking his head. The Master Chief turned to his teammates. They halted what they were doing. “You all heard. This is it. Fred and James, I want to you to refit one of our Pelicans. Get every scrap of C-12 and shape a charge on her nose. If Captain Keyes downs a Covenant shield, we may have to blast our way into the ship’s hull.” Fred and James replied, “Aye, sir.” “Linda, assemble a team and get into every crate ONI packed for us—distribute that gear ASAP. Make sure everyone gets a thruster pack, plenty of ammo, grenades, and Jackhammer launchers if we have them. If we do get on board, we may encounter those armored Covenant types again—this time I want the firepower to take them out.” “Yes, sir!” The Spartans scrambled to make ready for the mission. The Master Chief approached Kelly. On a private COM channel, he told her, “Crate thirteen on the manifest has three HAVOK nuclear mines. Get them. I have the arming cards. Ready them for transport.” “Affirmative.” She paused. The Master Chief couldn’t see her face past the reflective shield of her helmet, but he knew her well enough to know that the tiny slump of her shoulders meant that she was worried. “Sir?” she said. “I know this mission will be tough, but . . . do you ever get the feeling that this is like one of Chief Mendez’s missions? Like there’s a trick . . . some twist that we’ve overlooked?” “Yes,” he replied. “And I’m waiting for it.”","sourceLink":"https://allnovel.net/halo-the-fall-of-reach-halo-1/page-33.html","bookId":1633,"book":{"id":1633,"title":"Halo: The Fall of Reach (Halo #1)","description":"Storyline: Halo: The Fall of Reach (Halo #1) As the bloody Human-Covenant War rages on Halo, the fate of humankind may rest with one warrior, the lone SPARTAN survivor of another legendary battle . . . the desperate, take-no-prisoners struggle that led humanity to Halo--the fall of the planet Reach. Now, brought to life for the first time, here is the full story of that glorious, doomed conflict. While the brutal Covenant juggernaut sweeps inexorably through space, intent on wiping out humankind, only one stronghold remains--the planet Reach. Practically on Earth\u0027s doorstep, it is the last military fortress to defy the onslaught. But the personnel here have another, higher priority: to prevent the Covenant from discovering the location of Earth. Outnumbered and outgunned, the soldiers seem to have little chance against the Covenant, but Reach holds a closely guarded secret. It is the training ground for the very first \"super soldiers.\" Code-named SPARTANs, these highly advanced warriors, specially bioengineered and technologically augmented, are the best in the universe--quiet, professional, and deadly. Now, as the ferocious Covenant attack begins, a handful of SPARTANs stand ready to wage ultimate war. They will kill, they will be destroyed, but they will never surrender. And at least one of them--the SPARTAN known as Master Chief--will live to fight another day on a mysterious and ancient, artificial world called Halo. . . .","cover":"https://allnovel.net/images/halo-the-fall-of-reach-halo-1.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-fall-of-reach-halo-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:22:09 PM"}}
