{"id":91597,"no":22,"title":"Page 22","content":"\n Boyd searched Ruger’s eyes for the lie, for the cruel joke, but he found nothing more than the unemotional determination of a predator looking out for its own hide. He believed him. “Okay…okay, man.”\n Ruger smiled that slithery smile of his.\n “That’s my man. That’s my main man!” He winked and then reached for the buckle of Boyd’s pack. “Let’s lighten the load a little first.” That done, he stood and moved around behind Boyd, crouched, and caught him under the armpits. Before he lifted, he leaned so close that his lips brushed Boyd’s ear as he spoke. “I’m going to lift you out of that hole. If you dare scream, man, I’ll rip your throat out. Do you think I’m joking?”\n “N…no…” Boyd whispered.\n “Good. It’s gonna hurt like a motherfucker. Just take it, man. Just take it and screw that pain like you’d screw a little tight-snatch bitch. You hear me? Just screw the hell out of it.”\n “Okay….”\n “Okay. Here we go, buddy-boy.”\n He hoisted Boyd up out of the hole.\n Boyd didn’t scream. He almost did…Christ knows he wanted to, but instead he bit into his lip so hard that blood burst from it and ran hot and salty down his chin. The world took a sick and dizzying stagger and there was a dull roaring in Boyd’s ears as if he were standing too near to a raging waterfall. Nausea punched him in the pit of the stomach and slapped tears from his eyes. Ruger wasn’t gentle about it. He lifted the big, heavy Boyd as best he could, arms wrapped like iron bands around his thick chest, and dragged him to the fence. He squatted and lowered Boyd to the ground and more or less shoved him up against the rough wooden slats of the fence. He even tried to position him so that he had a modicum of comfort. The whole process, as Boyd saw it, took about a thousand years.\n “Jesus Christ, man, how much do you friggin’ weigh?” Ruger said, sucking in great gulps of air. He walked around in a small circle, arching his back and stretching his arms over his head. Finally he walked away and returned lugging both backpacks. He crossed his ankles and lowered himself slowly to the ground, sitting Indian fashion in front of Boyd.\n “G…gimme a cigarette,” Boyd wheezed, licking the blood from his lips. “Christ, I need a cigarette.”\n Ruger slapped his pockets until he found his pack of Pall Malls, kissed one out of the pack, lighted it, and handed it to Boyd, who sucked it greedily. Boyd’s face was the color of sour milk and it glistened with greasy sweat.\n “Ruger, my leg…”\n “Yeah, yeah, your leg. Wait a minute. Here, toot some of this. Better than Novocain.” He held up one of the bulky Ziploc bags and a rolled-up ten-dollar bill. Boyd took the tube and bent toward the proffered coke; his inhalation was long and deep. “Ride ’em, cowboy!” said Ruger in real appreciation as Boyd took a second snort, and then a third.\n “Oh man oh man oh man oh man oh man oh man…” Boyd sighed, closing his eyes and leaning back against the fence.\n Ruger beamed at him like a country doctor watching a kid swallow a spoonful of tonic and honey. “The breakfast of champions, m’man.”\n “Oh man, that feels so much better.”\n “Think so? Good, ’cause now I gotta set your leg.”\n Boyd half shrugged. “With enough of this shit, you could cut the fucker right off.”\n Grinning, Ruger fished in his pocket for a knife, found it, and flicked it open, a bone-handled Buck with a three-inch locking blade that was always sharp and well oiled. The keen edge sliced almost arrogantly through the tough black fabric of Boyd’s double-knits, gliding silently from cuff to midthigh. Ruger cut the pant-leg off and then tore the cloth into long strips, which he then set aside. Using his lighter he inspected the break. Both shinbones had broken a few inches below the knee, and they had broken in an ugly way. There were small mounds where the ends of the broken bones tented the skin, and the whole area was livid and swollen.\n “Mm,” Ruger said. “Cute.”\n “How’s it look?”\n “Like shit.”\n “Can you fix it?”\n “I can set it, but I think you’re gonna need a doctor. You broke the hell out of it, Boyd. Man, when you break something, you break the ass off it.” He flicked off his lighter.\n “I can’t feel it too bad. Just hurts a little.”\n “Not for long. Go on, take another toot,” Ruger said, lightly grasping Boyd’s shin with both hands and placing his foot against Boyd’s chest.\n “Gimme a sec…” Boyd said, diving nose-first into the bag of coke. Between toots he said, “Just let me know when you’re gonna do it, okay?”\n Ruger did it right then. He shoved with his foot and threw all his weight back and away. The leg stretched in its tube of skin and muscle, the bones shifted, the ends scything through meat and muscle, and then he let it snap back into place.\n “Now,” Ruger said, but Boyd had passed out. His eyes had rolled up in their sockets, his mouth dropped open in the beginnings of a scream, and then he fell over on his side. “You’re welcome,” Ruger said with a mean smile.\n Ruger sat and finished his cigarette, then stubbed it out on the ground, watching with quiet amusement as Boyd slowly drifted back up out of the pool of painless sleep into the real world. He searched for that exact moment when the pain sensors in Boyd’s brain came online and connected his muzzy thoughts with all the jumbled stimuli from his leg. When Boyd’s eyes suddenly flared wide and he drew in a sharp, high hiss of agony, Ruger closed his eyes for a second, savoring that little moment. Rather tasty.\n “Oh…Christ!” Boyd wailed, clawing at his leg with his good hand. His scrabbling fingers encountered strangeness in the form of wooden slats bound to the leg with strips of torn denim.\n “Hi, Boyd,” Ruger said, “have a nice nap?”\n “My leg…?”\n “…Is set. More or less. Still have to get your ass to a doctor, but it’ll do for now, I guess. I splinted it, so you should be okay for a little while. I waited until you woke up before I took off to find Farmer John, or whoever owns all this friggin’ corn.”\n “Man, you can’t just leave me—”\n “Hey…hey! We’ve been through all that. I’m leaving you here, but I will be back. Just so you see that I’m not shitting you, I’m leaving all the stuff here. Cash, coke—the works. Now, you know I’m coming back for that, am I right?”\n Boyd gave him a long, uncertain look, but finally he nodded.\n Ruger popped a stick of Juicy-Fruit into his mouth and chewed thoughtfully for several seconds, his dark eyes ranging over Boyd’s face. “Okay then. End of discussion. You stay here and talk to Mr. Scarecrow, and I’ll go see what I can see. Maybe I’ll get a wheelbarrow or something. Wheel your ugly butt right the hell out of here. If we’re lucky I’ll find a nice nondescript set of wheels. Pickup or four-by-four…something we can use to go off-road to stay away from our buddies in blue.”\n “Hurry, man.”\n Ruger smiled disarmingly, white teeth gleaming. “Back before you even know it.” He stood up, stretched his aching muscles, and then did a slow turn, orienting himself. He sketched a little salute to Boyd, told him to be good, and strolled off, ignoring Boyd’s pleas to hurry. Within a few seconds he vanished around a bend and was gone.\n Boyd stared after him, eyes awash with tears of pain. Above him the scarecrow’s loose clothing rustled quietly in the light, cold breeze. Boyd did not see the long scrambling line of beetles and roaches and worms and spiders that swarmed out of the fields, scurried up the fence posts, and scuttled up the pants-legs of the scarecrow. Not all of the rippling of the dummy’s clothing was caused by the breeze blowing past, yet all of it was caused by the night itself.\n 5\n Iron Mike Sweeney, the Enemy of Evil, looked at his chronometer. Nearly 1930 hours. He had half an hour to get home.\n “Oh man,” he said in a low, terse whisper, “don’t let me be late.”\n He was all the way out past the Guthrie farm, far down on A-32. Miles to go, and it would be hard enough on flat ground. He kicked the War Machine into action and pedaled like crazy.\n “Crap,” he said aloud. He hadn’t meant to be late, but the papers that should have been dropped off before school was even out had come in an hour after Mike usually picked them up. He’d kicked ass dropping them off, saving the last ones for the long haul down A-32. Home was on the other side of town, and the miles between were mostly hills. No way to get there until sometime after eight.\n Yeah, a belting for sure.\n He zoomed down one hill and tried to use the momentum to get himself up the next one, but gravity began pulling at him and he had to pump his legs so that sweat popped out on his face and under his clothes. He kept his head down and pumped the pedals, thinking of home that lay one thousand and seven miles away. One million and seven. Where Mom and Vic were waiting for him. Mom sitting by the door with her hand clamped around a collins glass, looking out, waiting for him to come creeping into the yard, steeling herself to try and run some kind of interference for him; and Vic, sitting on the left-hand side of the couch, a Winston burning in one corner of his mouth, the remote-control dwarfed by his hand, clicking through channel after channel. Vic, with his hard mechanic’s hands and that little smile of his that he wore only when Mike did something wrong. Which, by Vic’s tally, was pretty often. Vic, who demanded to be called “sir” and had enforced his decree with his belt. Vic, who liked how hard his hands were, and how fast. Vic, who liked to use his hands, to hurt with his hands.\n Mike looked down the long road and swore to himself that he would not cry. Not this time. Not now, and not after it was all over. No matter how bad it was, he wouldn’t let that prick see him cry. Even if it meant that Vic would try all the harder to wring the tears out of him. \n","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-22.html","bookId":2567,"book":{"id":2567,"title":"Ghost Road Blues (Pine Deep #1)","description":"Storyline: \n Ghost Road Blues (Pine Deep #1) \n From a new master of horror comes an apocalyptic showdown between the residents of a secluded, rural town and the deadly evil that confronts them wherever they turn . . . \n Evil Doesn\u0027t Die \n The cozy little town of Pine Deep buried the horrors of its past a long time ago. Thirty years have gone by since the darkness descended and the Black Harvest began, a time when a serial killer sheared a bloody swath through the quiet Pennsylvania village. The evil that once coursed through Pine Deep has been replaced by cheerful tourists getting ready to enjoy the country\u0027s largest Halloween celebration in what is now called \"The Spookiest Town in America.\" \n It Just Grows Stronger \n But then--a month before Halloween--it begins. Unspeakably desecrated bodies. Inexplicable insanity. And an ancient evil walking the streets, drawing in those who would fall to their own demons and seeking to shred the very soul of this rapidly fracturing community. Yes, the residents of Pine Deep have drawn together and faced a killer before. But this time, evil has many faces--and the lust and will to rule the earth. This struggle will be epic.\n \n","cover":"https://allnovel.net/images/ghost-road-blues-pine-deep-1.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/ghost-road-blues-pine-deep-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:50:05 PM"}}
