{"id":91608,"no":33,"title":"Page 33","content":"\n “They still haven’t caught the psychos yet?”\n “No, and I’m hip-deep in Philly cops. It seems,” Terry said, dropping his voice, “that these psychos are the real deal. Not just some clowns running from a stickup at a Wawa. These are some serious bad boys, m’man.”\n “What do you mean?”\n Terry’s voice dropped even lower. “One of the guys is some madman named Karl Ruger.”\n “Never heard of him.”\n “Yes, you have.”\n “No, I—”\n “Ever heard of the Cape May Killer?”\n “Yeah. Who hasn’t?”\n Terry said nothing, letting Crow work it out. It didn’t take long. “Oh my God!”\n “Uh-huh.”\n “I mean…oh my God!”\n “Yep.”\n “Christ, Terry, are you sure?”\n “He was ID’d by the Philly cops.”\n “Oh. My. God.”\n “Yeah. So,” said Terry, “did you remember to bring your gun?”\n “Huh? Oh…yeah, I got it.”\n “Is it loaded?”\n “Of course it’s loaded.”\n “Then keep it close, my brother, ’cause Halloween’s come to town early this year.”\n “What d’you mean?”\n “There are monsters out there tonight,” Terry said, but despite his flippant words, there was little humor in his voice.\n Crow switched off the phone and frowned into the shadows for a few moments; then he hit speed-dial for Val’s cell phone, but it rang through to her voice mail. He left a message for a callback, ended the call, walked back to the car, got in, and sat behind the wheel staring out at the night for a long time. Beside him, Mike sat patiently, waiting in silence. Finally, Crow turned to him and said, “I just spoke with the mayor. He’s going to call your mom and, uh, Vic, and have them pick you up out at the Haunted Hayride.”\n “At the hayride? How come?”\n “Well, it’s complicated,” Crow began, “and I’m trusting you to keep your mouth shut about this. Okay?” Mike nodded and Crow gave him an abridged version of the facts. By the time he was done, Mike’s eyes were very large and for the moment he looked more like a kid than ever. He licked his lips nervously.\n “Jeez-us!”\n “My feelings exactly.”\n “In Pine Deep?” Mike said wonderingly. “Did the mayor really make you a cop again?”\n “Seems so.”\n “Wow.”\n “Mm.”\n “Well,” said Mike.\n “Well,” agreed Crow.\n They looked at each other for a dark minute, and then Mike said, “Crow…there’s something else I have to tell you. But…I don’t want you to think I’m whacked or something.”\n “Too late,” Crow said with a grin; then he caught the look on Mike’s face. The kid was serious. “Um, sure, Mike…fire away.”\n So, Mike told him about his encounter with the white stag. He described the animal and how it moved, what it looked like—and how it had growled at him. The only part he forgot to mention were the skid marks, which was unfortunate.\n Crow leaned against the car door and looked at him. A variety of thoughts ran through his head, chief among them a concern on whether Mike had hit his head hard enough to have caused some kind of hallucinations. The kid seemed pretty lucid, though, and even with his youth coloring the description it had been a pretty straightforward and orderly account.\n Mike asked, “Have you ever seen anything like that? I mean…isn’t that pretty weird?”\n This whole flipping night is pretty weird , thought Crow. He said, “Yeah, Mike, that’s off the hook.”\n Mike winced and touched Crow’s arm. “Crow—the whole slang thing? Grown-ups never get that kind of thing right.”\n Crow gave him a look. “Do you know what ‘precocious’ means?”\n “No.”\n “It’s Gaelic for ‘pain in the ass.’”\n Mike grinned. “So, what do you think?”\n “I think I haven’t a clue about that whole deer thing. I mean, if we were in the Middle Ages I’d say, okay, white stag or white hart—sign of impending doom. But we’re not in the Middle Ages and this is Pine Deep and I think you just saw an albino deer who was acting pretty funky.”\n “Are deer supposed to act like that?”\n “What am I, Animal Planet? I don’t know from deer. I sell rubber rats and fright masks. What I’ll do, though, is tomorrow I’ll call Nate Holland, he’s a park ranger, and I’ll ask him. Who knows? Maybe the deer is sick or something and that’s why it was acting so funny.”\n “Maybe,” Mike said, but it was clear he didn’t agree.\n Crow looked at his watch. “I really have to get out to the hayride, kiddo. You game to go with me, Iron Mike?” he said with a grin.\n “Fire up the converters, R2, we’re about to make the jump to light speed.”\n Crow chuckled. “Okay, but you’re R2D2, I’m Luke.”\n “No way.”\n “Hey, who’s driving?”\n “Hunh. Well, if you’re Luke Skywalker, where’s your light saber?”\n Crow’s smile dwindled slightly and his eyes took on a strange, distant quality. Then he leaned across the seat, thumbed open the glove compartment, and took out the Beretta. He eyed it to make sure the safety was on and then tucked it in his waistband, where it once again felt like a block of sinister ice against his skin.\n “That enough of a light saber for you?”\n Mike swallowed the watermelon in his throat. “It’ll do,” he said.\n Crow turned the key and Missy sprang to life. With barely a squeal of tires he pulled the car back onto the road and headed toward the hayride at a sedate eighty-five miles an hour.\n 3\n Terry hung up the phone with a sigh, knowing it was going to be a very long night. Around him, the station house was in full furor, with officers coming and going, phones ringing, chatter filling the air. For a stretch of moments, Terry just stood by the desk, fingertips still resting lightly on the curved back of the phone, lost in musings. He thought how odd it was that Crow had encountered Mike Sweeney. It bothered him for some reason that he couldn’t quite touch. There was something about that kid that had always bothered Terry. Every time he saw him pedaling down Main Street with his canvas bag of papers it always gave him a weird feeling in his gut. Not something he could put his finger on, just a little flicker of the creeps. Weird kid, he thought, then shook his head to clear his thoughts. He had enough things to worry about, primarily the organization of a real honest-to-God manhunt in Pine Deep. Lord, he thought, this is all I need, and Halloween just a month away.\n He went into the men’s room, closed the door, and locked it. From an inner pocket he took out his bottle of Xanax and popped one, washing it down with handfuls of water from the tap. His morning dose of clozapine had kicked in, and he could feel his bowels cement shut. Though he didn’t get the drowsiness his shrink had warned him of, he hadn’t had a good bowel movement since he’d started the antipsychotic. With the Xanax on top of the other drug he felt he might be able to get through the rest of the day.\n He washed his face, pressing cupped hands full of cold water to his face for a long moment, patted himself dry, straightened his tie, and went back out to the squad room.\n Detective Sergeant Ferro was talking earnestly with Gus Bernhardt, but the chief glanced up and waved him over. “D’you have a minute?”\n “Sure,” Terry said, but as he began to move he caught sight of himself reflected in the large picture window across from the desk. The darkness without and the bright fluorescents within transformed the glass to a dark and opaque mirror. Terry saw himself reflected in the polished-coal surface, saw his own size and brawn, he saw his red beard and red hair, but the darkened glass distorted things, shaded his hair to black and deepened the wells of his eyes so that his reflection looked like that of a bearded skull without eyes or expression, a scowl devoid of humor or compassion. He stood and stared at the distorted reflection, remembering his dreams of the last few nights. The beast reflected in the store windows of a burning town. Then he made a face of self-disgust at his own ridiculous paranoia and turned away to join the others.\n As he left, the mirrored glass surface of the window was wiped clean for a moment, but then another image gradually appeared. It seemed to come forward toward the light, like someone stepping out of deep shadows into pale lamplight. If anyone had been watching, the image might have just seemed like someone stepping out of the darkness beyond the glass to a point of nearness where the glass once more became transparent; but anyone on the other side of the glass would have known this wasn’t true: there was no one outside the chief’s office, no one in the street at all. Yet the image remained. Not a figure outside, not a reflection of anyone inside, for inside the station there was no little girl with bright red curly hair and bright blue eyes and a dark green dress. That image appeared only in the darkness of the glass. A pretty little girl, with an oval face and a stuffed rabbit clutched in the child’s hand. A lovely face, even though streaked with blood; a pretty dress once, but which hung now in blood-soaked tatters.\n The little red-haired girl watched the big red-haired man move away, watched with troubled eyes as he went over to the policemen and began to talk. A tear like a single pear-shaped diamond appeared on her cheek. It paused for a moment, and then rolled slowly down her face, tumbling over the streaks of blood, becoming tainted with red, metamorphosing into a tear of blood as it wended its way down to her chin. By the time it reached the point of her chin, the image in the darkened window had faded and was gone.\n 4\n Val Guthrie stared into the black eye of the pistol, her face blank except for a small half smile on her lips.\n “What?” she asked softly. \n","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-33.html","bookId":2567,"book":{"id":2567,"title":"Ghost Road Blues (Pine Deep #1)","description":"Storyline: \n Ghost Road Blues (Pine Deep #1) \n From a new master of horror comes an apocalyptic showdown between the residents of a secluded, rural town and the deadly evil that confronts them wherever they turn . . . \n Evil Doesn\u0027t Die \n The cozy little town of Pine Deep buried the horrors of its past a long time ago. Thirty years have gone by since the darkness descended and the Black Harvest began, a time when a serial killer sheared a bloody swath through the quiet Pennsylvania village. The evil that once coursed through Pine Deep has been replaced by cheerful tourists getting ready to enjoy the country\u0027s largest Halloween celebration in what is now called \"The Spookiest Town in America.\" \n It Just Grows Stronger \n But then--a month before Halloween--it begins. Unspeakably desecrated bodies. Inexplicable insanity. And an ancient evil walking the streets, drawing in those who would fall to their own demons and seeking to shred the very soul of this rapidly fracturing community. Yes, the residents of Pine Deep have drawn together and faced a killer before. But this time, evil has many faces--and the lust and will to rule the earth. This struggle will be epic.\n \n","cover":"https://allnovel.net/images/ghost-road-blues-pine-deep-1.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/ghost-road-blues-pine-deep-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:50:05 PM"}}
