{"id":91633,"no":58,"title":"Page 58","content":"Crow saw the green creeping into Terry complexion, and realized that the mayor had seen the body. He didn’t pursue it. “So, then the manhunt is still on.” “Uh-huh, and stronger than ever. We’re hip-deep in cops. We even reinstated a dozen locals boys.” “Oh? Like who?” Terry recited a list of names. “Mm,” said Crow doubtfully. “I’d classify them more as ‘warm bodies’ than cops. Most of them aren’t much good for this sort of thing, wouldn’t you say?” “I agree, but they know the turf, and they can drive a police car. A couple aren’t too bad. Jack Tunny’s okay. Eddie Oswald’s a stand-up guy, though.” “For a Bible thumper.” “He was a good officer and stayed by the book. And B.B. Harrison’s not too wretched. We’ve paired each of our locals with one of the cops from Philly, and we have a few loaners from Black Marsh and Crestville. The Philly cops were supposed to be meeting with some FBI types half an hour ago, so pretty soon we’ll have everyone but the National Guard on the job.” “Wow. All trying to arrest one man.” “Tell you the truth, I really don’t think anyone is really going to try too hard to arrest this Ruger character. I think this has gone all the way over into a ‘shoot on sight’ kind of thing. Or, rather, shoot to kill.” Crow grunted. “Maybe they should drive a stake through his heart, too.” “Maybe.” Terry rubbed his eyes again and sighed. “You know, man, you look about as bad as I do.” Terry smiled weakly. “Well, aside from the fact that I haven’t had a good night’s sleep in weeks, the crop blight, Halloween, and Karl Ruger…I’m just peachy.” “Yeah.” Crow studied Terry’s face. “Any troubles with you and Sarah?” “Hm? Oh, heck no, nothing like that. Sarah’s the best. No, it’s just that I’ve been having really bad dreams lately. I told you about it yesterday. Very vivid, very intense.” Crow frowned. “Hunh.” “Whyfore the ‘hunh’?” “I’ve been having nightmares, too. Real corkers.” They looked at each other for a moment, and just as Terry was about to say something, the door opened and a nurse came in. Crow glanced at her. She did look like Steve Buscemi, but not as pretty. The nurse pointed a finger at Terry and said, “Out.” Terry blinked in surprise. “Me?” “You. Vamoose.” “You do realize,” he said, “that I’m the mayor of this town.” “I’ll faint later, but for right now get out.” She turned and glared at Crow. “It is time for your vitals.” “But I—” She gave him a stern glance, fiercer than anything Crow had seen on Ruger’s face. Terry and Crow exchanged a brief, helpless look, and Terry got up. Behind the nurse’s back, he raised his right hand and mouthed, “Sieg heil!” and then crept out. When Crow opened his mouth to say good-bye to his friend, the nurse stuck a thermometer in it. 4 No one laughed at the joke, so Dixie MacVey tried it again. “I said…you guys look like a police lineup.” He chuckled for them, hoping it would encourage them. It didn’t. The gathered officers just stared at him, unamused and unmoved. They all stood in a relatively straight line, their assorted uniforms a mix of local gray, big-city blue, and state-police black. “Get it? A police lineup.” “We get it,” Officer Shanks said tiredly. “Jeez, you guys got no sense of humor.” Officer Jerry Head snorted. “You’re right, we all ought to be laughing our asses off. Everything is so carefree and funny.” “Hoo-ha,” added Toombes. “I better watch so I don’t bust a gut.” “Okay,” called Ferro as he rose from behind Gus Bernhardt’s desk, “knock it off and listen up.” The officers straightened up and MacVey, sulking, joined the line. “Sorry we don’t have enough chairs for everyone,” Bernhardt said from where he sat by the door. The uniformed officers stood in their lineup, hands at their sides or clasped behind them in the manner of parade rest. Polk and MacVey sat on folding chairs and LaMastra sat on the ledge of the window bay. Ferro looked down the row, recognizing some of the faces from last night, but seeing plenty of new faces as well, more new ones than old ones. “Okay, ladies and gentlemen, I want to thank you all for being here. I know some of you are not actively working in the law enforcement field, but the fact that you were willing to be reactivated as part-time officers is commendable. Again, thanks.” The eighteen new recruits nodded. “All right, well, here’s the scoop. We were able to borrow some patrol cars from neighboring towns, so that means that most of you will be able to go right out and join in the search. After I take roll, you folks will get your unit assignments. I had a crate of Kevlar vests brought up from Philly, and I think there are enough to go around. Everyone who goes out wears one, is that clear? Good. Every officer is to have his or her sidearm cleaned and loaded. No mistakes, no heroics, and no sloppy police work. We are all professionals, and we don’t often have to prove how really good we can be. This, however, is one of those times. This is a very dangerous man. This man has killed without hesitation or remorse. He has gunned down innocent citizens, as well as law officers. Don’t take any chances. I don’t want you to investigate a cat up a tree without backup. Is that understood? Good. We have one officer down right now, as well as one reactivated officer. We’ve already seen what Karl Ruger is capable of doing to one of his own gang—imagine what he would be willing to do to one of you.” The speech was more for the locals but Ferro’s hard stare ranged slowly over every face in the lineup, meeting each set of eyes in turn. The officers he’d brought with him from Philly each met his gaze, Head even nodded to him. Most of the local officers could only meet that glare for a few seconds before their eyes faltered and found something less intense to look at. One of the reactivated men, a big blond bruiser with a broad, almost simian face and long muscular arms, did meet his eyes, and returned intensity for intensity. Ferro thought he looked tough and clear-headed, and wondered if he’d been military, perhaps even M.P. “Any questions?” No one moved for a few seconds; then the big blond officer held up his hand. “I have a question, sir.” “Your name?” “Edward Oswald, reactivated volunteer, sir.” “Okay, what’s your question, Officer Oswald?” “This man, this Karl Ruger…” “Yes?” “Well, sir, the rumors have been flying all over the station house about him. The others said that this man is supposed to be the Cape May Killer. Is that straight?” Ferro pursed his lips. “It is a possibility, but no more than that.” Oswald gave him a flat stare. “Sir, I don’t mean any disrespect, but if this fellow is the Cape May Killer, shouldn’t we know about it? I know we’re only temporary cops, but we’re still going to be the ones out there, the ones who might have to face him. Shouldn’t we know everything about who we might be up against?” There were some faint and discreet murmurs of agreement. It took Ferro a long five seconds to make his decision. He looked at Gus, who just spread his hands. “Okay, that’s fair enough, but let me say this. You people took an oath, however temporary. You are bound by policies of confidentiality, and I want each of you to respect that. For the moment, we can’t allow the full facts about this case to come out. There are reasons. Are we clear about that?” They all thought about it, then nodded. “Right, then. Okay, Karl Ruger is wanted for questioning in the Cape May Lighthouse killings. He is not only the prime suspect, he is the only suspect. Am I going to come out and say that he is the Cape May Killer? No, but I would be one very surprised cop if it turned out to be anyone else. Does that answer your question, Officer Oswald?” “Yes, sir, it surely does.” “Okay then? Any further questions? No? Okay then, listen up for your names and patrol assignments,” Ferro said loudly. “Officer Burke…?” 5 All through the long night and longer day they gave her sedatives and each time she tried to fight the drugs, tried to fight the tentacled pull of sleep; and each time she finally lost the battle and was pulled beneath the surface. Val Guthrie didn’t want to be down there in the darkness. Time and again she would swim upward toward the faint and distant light; time and again she would lose her way and sink back into the darkness. It hurt less in the darkness, but she wanted the light. There in the dark Karl Ruger smiled at her from out of the shadows. He chased her endlessly though the black stalks of corn, his eyes burning with a hellfire red and his wet teeth glistening and sharp. He chased her and reached for her with impossibly long arms, tore at her with improbably sharp fingers. And as she ran, she would stagger past the bleeding and dying body of her father. No matter which route she took, no matter how far she ran, she would always find him again, lying there, broken, bleeding, face streaked with tears and rain and mud and blood. Every time she stumbled past, her father would reach imploringly for her, his voice pleading with her to stop and help him, to save him. He begged her to get him out of the cold rain, called her name with a mouth that bubbled with fresh blood. Always she ran on, knowing that Karl Ruger was right behind her. When she managed to get to the light, to come awake for whatever period of time fatigue and morphine would allow, the specter of Karl Ruger lagged behind, losing her in the maze of cornfields. Yet when she felt herself falling away once more in the darkness, Karl Ruger would be waiting. It was the chime of the distant bell on City Hall Tower that woke her, a sound she shouldn’t have been able to hear through the distance and the thickness of walls and windows. With each chime, she came one increment closer to the light, one increment further from the darkness and the pursuing monster.","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-58.html","bookId":2567,"book":{"id":2567,"title":"Ghost Road Blues (Pine Deep #1)","description":"Storyline: Ghost Road Blues (Pine Deep #1) From a new master of horror comes an apocalyptic showdown between the residents of a secluded, rural town and the deadly evil that confronts them wherever they turn . . . Evil Doesn\u0027t Die The cozy little town of Pine Deep buried the horrors of its past a long time ago. Thirty years have gone by since the darkness descended and the Black Harvest began, a time when a serial killer sheared a bloody swath through the quiet Pennsylvania village. The evil that once coursed through Pine Deep has been replaced by cheerful tourists getting ready to enjoy the country\u0027s largest Halloween celebration in what is now called \"The Spookiest Town in America.\" It Just Grows Stronger But then--a month before Halloween--it begins. Unspeakably desecrated bodies. Inexplicable insanity. And an ancient evil walking the streets, drawing in those who would fall to their own demons and seeking to shred the very soul of this rapidly fracturing community. Yes, the residents of Pine Deep have drawn together and faced a killer before. But this time, evil has many faces--and the lust and will to rule the earth. This struggle will be epic.","cover":"https://allnovel.net/images/ghost-road-blues-pine-deep-1.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/ghost-road-blues-pine-deep-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:50:05 PM"}}
