{"id":81779,"no":34,"title":"Page 34","content":"“Brooke, oh, baby, she’s coming, isn’t she?” She nods, and my heart has never pounded so hard as I wipe away her tears, murmuring, “I got you, all right? You got me, baby, now I got you. Come here.” I scoop her up in my arms, and she cuddles into me, so vulnerable and sweet as she cries into my neck. “He’s not . . . supposed . . . to come yet. . . . It’s too soon. . . . What if he won’t make it . . . ? ” The crowd has flocked around us, but I tuck her head under my neck and use my shoulders to bulldoze past the fans, determined to get us out of here as fast as I can as hands reach out to rub me. “RIPTIDE, YOU ROCK! RRIIIIPPPPTIIIDE!” they scream. White roses start raining over us from the stands when the announcer speaks. Fuck this is all wrong. I’m supposed to be on my knees. She’s supposed to be happy tonight. “At the request of our victor, who has a very special question to ask . . .” I spot the exit when the music starts playing in the background, and my heart starts pounding in a way it doesn’t even pound when I’m fighting. Brooke’s confusion seems to grow, and the chorus that asks what I’ve wanted to ask her from the moment I held her in my arms, kissed her for the first time, and introduced myself to her, plays out loud. She was mine then. She. Is. Mine. She will be mine. “Wh-what?” she asks me in confusion. Pushing out through the exit, I tell Pete, “Pull the car around,” and I keep walking until Pete screeches to a halt before us. Brooke’s sister climbs up front. I tuck Brooke into the back, and she keeps looking at me expectantly, watching me close the door as Pete drives us out of there. I hold her face between my hands, and my heart is still galloping. This is it. This is what I want most in the world. I feel like I’ve been waiting since before I was born to ask her. It’s like asking her to jump off a cliff, with me. It goes against my instinct to protect her, but my instinct to claim her overrules anything else. She’s mine, my girl. Her eyes hold me, hot and pained but shining expectantly, and I hear the need in my voice when I speak, “The song was supposed to ask you to marry me, but you’ll have to settle on me doing the asking . . .” She stares at me, her lips apart, and she’s trembling so hard, she doesn’t know my hands are trembling too as I squeeze her face between my hands. “Mind. Body. Soul. All of you for me. All of you mine . . . Marry me, Brooke Dumas.” “Yes!” she exclaims, sobbing and grabbing my jaw and pressing her lips to mine, no hesitation in her answer, no worry, no concern. “Yes yes yes!” “Fuck baby, thank you,” I murmur, my throat tight as I pull her to me and she buries herself against me. She can’t see my face, and I exhale a breath against her hair and hold her, my adrenaline starting to crash almost instantly. She moans in pain and I quietly rock her, whispering in her ear, “Tell me what to do.” “Hold me,” she says, groaning softly, then breathing fast, “Stay with me, don’t go black, stay with me.” I nod and hold her, but I start to worry when she keeps moaning in pain. Don’t fucking go black, asshole! When we check her in, I’m trying to calm down, but she’s moaning and grimacing and I can’t stop thinking I’m the bastard who knocked her up. I try to think of the look of happiness on her face when I proposed. I try to hang onto it and remember what she’s told me before. We want this. We want a family. We deserve it like anyone else. I try to think of that look of happiness when she’s on the delivery table, pushing. Holy god, I don’t even know how I’m in one piece. I hold her hand as her cries tear through my ears and split me open. I brush her hair behind her face and watch her chew on her lip as she pushes, while I quietly beg myself to please just hang tight and not let my daughter first meet me when I’m black. It feels like forever by the time Brooke lets go a sigh and drops back on the table, suddenly relaxed, when I see the doctor holding a squirming, wet, pink figure. “It’s a boy,” he says, and a soft cry follows. “A boy,” she gasps, delighted. “A boy,” I repeat. “Breathing on his own. No complications. He’s preterm—we still need to incubate,” the doctor murmurs. “We want to see . . .” Brooke cries. She lifts her arms and they tremble as she waits for them to clean the baby, and it howls in protest, and then, the nurse brings it over. I’m staring in disbelief as Brooke holds it . . . not it . . . him. Our son. Our son who stopped screaming when they placed him in her arms. She ducks her head, her hair tangled, a sheen of sweat across her neck and face, our son wrapped in a small blanket and in her arms, and my body loosens as I bend my head to her, and to him, as a whole truckload of protectiveness, and love, and pure raw happiness slam into me. “I love him, Remy,” she whispers, tilting her head to me, and I feel so fucking grateful for her giving me this, I just need to kiss her, feel her whisper against my mouth, “I love you so much. Thank you for this baby.” “Brooke,” I rasp, protectively wrapping my arms around both of them. My throat is raw, and my eyes are killing me, and I’ve never had something so perfect, pure, and precious in my life than my little firecracker and a little part of her, with a little part of me. “If he’s like me, we will support him,” I whisper to her. “If he’s like me . . . we’ll be there for him.” “Yes, Remy,” she agrees, looking at our son, and at me, her expression so loving I feel renewed by it. “We will teach him music. And exercise. And how to take care of this little body. It will be strong and astound him and maybe frustrate him sometimes too. We will teach him to love it. And himself. We will teach him love.” I wipe the moisture from my eye and tell her yeah, that yeah, we will, but I won tonight, and I still wish I felt worthier and I were different. I wish I were perfect for them. I wish I were perfect in every way so they’d never shed a tear for me, worry, or stress because of me. But I love them more than anything perfect ever could. I love them more than anything perfect ever will. Nothing perfect would kill for them like I would, or die for them like I would. Tears are streaming down her cheeks as she stretches out her arm, and I realize I stepped back like some pussy afraid to be rejected by them. “Come here,” she whispers, and I come and bow my head to hers, and I’m not sure if the wetness on my jaw is mine or hers, but it’s taking all my effort to hold myself under control. “I am so in love with you,” she whispers as she nuzzles me, caressing me in a way that makes my eyes burn even harder. “You deserve this and more. While you fight out there, I will fight for you to come home to this.” I growl, angry that I’m crying, and then wipe my tears and kiss her lips, rasping, “I fucking love you to pieces. To pieces. Thank you for this baby. Thank you for loving me. I can’t wait to make you my wife.” PRESENT SEATTLE The way my wife looks today. The way my wife smiles today. The way my wife nuzzles our smiling son as she says, “Goodbye, Racer, be good with Grandma and Grandpa. . . . ” “Gah!” I pat the top of Racer’s round little head and kiss his chubby cheek. “That’s right, devil, you heard her.” “Leave him to us,” Brooke’s mother tells us outside the church, while the team looks on from a couple feet away. Brooke’s sister, Nora, is clutching the bouquet she just caught to her chest, and Pete looks ready to puke at her side because of his feelings for her. Coach is grinning like he never does, while Diane is standing with her arm linked to his, and Riley can’t stop glaring at Melanie’s new boyfriend, who clearly doesn’t give a shit. Me . . . I’ve had it with the suit, with being kept away from my bride in our own home, with kissing her meekly by the altar and without using my tongue and my teeth or putting my hands on her ass. As Brooke waves to Melanie and yells, “Racer, Mommy loves you!” I pull her into the back of the limousine and reach around her to slam the door, and I finally have her all for me. She turns, panting, to look into my eyes, her cheeks blushed pink, her eyes sparkling in excitement, and no, I will never forget today. I reach for her while she simultaneously tries climbing on my lap and I grab her waist to help her, but she squeaks as she tries flattening the billowing skirt of her dress and we fail to get her comfortably on top of me. “I loved this dress until this moment when it won’t let me get close to you,” she complains. “Shit, I’m so hard for you, come here.” Sliding my hand under the fall of her hair, I grab her by the neck and dive hungrily for her lips, kissing her, my tongue anxious to be touching hers. I want more. And she instantly gives me more, thirsty for me, moaning softly. Keeping our mouths attached, I gather her closer as she strokes my hair. “I can’t wait,” she breathes. “For you to tear this dress off me.” “I’ll send those fucking buttons flying.” My mouth waters as I drag my thumbs down her cheeks. “And I’m going to feast on you like a fucking banquet.” “Oh yes, please.” She sets her nose on mine and sighs, her fingers playing in my hair. “We’ve never left Racer for more than two hours before. I feel like a bad mother.” I shake my head, nuzzling her as I do. “If we don’t want to leave him and go on a honeymoon yet, you at least have to let me steal you for an evening.” I kiss her jaw. “You’re the most tender, playful mother I know, Brooke.” She laughs. “Oh, and how many do you know?” she teases, reaching up to poke both my dimples. “To compare me to?” Really? I know none. But the mother of my son. God, they’re so fucking perfect, and they’re both mine. I sometimes watch them from across the room, and my chest swells as they play around with each other. Brooke has a canny sixth sense that always knows when I stare. She always looks up, her eyes warm and sparkling with happiness at me, and I come over and pull them close to me, kissing and nuzzling them both. “I know my mother wasn’t like you,” I whisper to her now, kissing the tip of her nose. “And you, there’s no father like you.” She caresses the bow at my neck. “I love you so much, Remington.” She presses her face into my neck and tries getting closer to my side, dragging in a deep inhale, her voice thick, “You look so hot in that tuxedo, I’m dying to have you all to myself.” “I get you all for me too.” I tighten my arm around her waist as I buzz my lips over her hair. Maybe taking a honeymoon currently is impossible, especially when neither of us wants to leave Racer, but I need my wife tonight. Quietly I kiss her forehead and her nose. Running my eyes over her features, I tip her head and scrape my thumb across her lips. “I need this,” I rasp, and set my mouth on hers.","sourceLink":"https://allnovel.net/remy-real-3/page-34.html","bookId":2738,"book":{"id":2738,"title":"Remy (Real #3)","description":"Storyline: Remy (Real #3) Underground fighter Remington Tate is a mystery, even to himself. His mind is dark and light, complex and enlightening. At times his actions and moods are carefully measured, and at others, they spin out of control. Through it all, there\u0027s been one constant: wanting, needing, loving, and protecting Brooke Dumas. This is his story; from the first moment he laid eyes on her and knew, without a doubt, she would be the realest thing he\u0027s ever had to fight for.","cover":"https://allnovel.net/images/remy-real-3.jpg","author":"Katy Evans","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/remy-real-3.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:36:33 PM"}}
