{"id":33678,"no":17,"title":"GENERAL JOSHUA.","content":"(April, 1882.) Mountebank Talmage has just preached a funeral sermon on General Joshua. It is rather behind date, as the old warrior has been dead above three thousand years. But better late than never. Talmage tells us many things about Joshua which are not in the Bible, and some sceptics will say that his panegyric is a sheer invention. They may, however, be mistaken. The oracle of the Brooklyn Jabbernacle is known to be inspired. God holds converse with him, and he is thus enabled to supply us with fresh facts about Jehovah\u0027s fighting-cock from the lost books of Jasher and the Wars of the Lord. Joshua, says Talmage, was a magnificent fighter. We say, he was a magnificent butcher. Jehovah did the fighting. He was the virtual commander of the Jewish hosts; he won all their victories; and Joshua only did the slaughter. He excelled in that line of business. He delighted in the dying groans of women and children, and loved to dabble his feet and hands in the warm blood of the slain. No \"Chamber of Horrors\" contains the effigy of any wretch half so bloodthirsty and cruel. According to Talmage, Joshua \"always fought on the right side.\" Wars of conquest are never right. Thieving other people\u0027s lands is an abominable crime. The Jews had absolutely no claim to the territory they took possession of, and which they manured with the blood of its rightful owners. We know they said that God told them to requisition that fine little landed estate of Canaan. Half the thieves in history have said the same thing. We don\u0027t believe them. God never told any man to rob his neighbor, and whoever says so lies. The thief\u0027s statement does not suffice. Let him produce better evidence. A rascal who steals and murders cannot be believed on his oath, and \u0027tis more likely that he is a liar than that God is a scoundrel. Talmage celebrates \"five great victories\" of Joshua. He omits two mighty achievements. General Joshua circumcised a million and a half Jews in a single day. His greatest battle never equalled that wonderful feat. The amputations were done at the rate of over a thousand a minute. Samson\u0027s jaw-bone was nothing to Joshua\u0027s knife. This surprising old Jew was as great in oratory as in surgery. On one occasion he addressed an audience of three millions, and everyone heard him. His voice must have reached two or three miles. No wonder the walls of Jericho fell down when Joshua joined in the shout. We dare say the Jews wore ear-preservers to guard their tympanums against the dreadful artillery of his speech. Joshua\u0027s first victory, says Tahnage, was conquering the spring freshet of Jordan. As a matter of fact, Jehovah transacted that little affair. See, says Talmage, \"one mile ahead go two priests carrying a glittering box four feet long and two feet wide. It is the Ark of the Covenant.\" He forgets to add that the Jew God was supposed to be inside it. Jack in the box is nothing to God in a box. What would have happened if the Ark had been buried with Jehovah safely fastened in? Would his godship have mouldered to dust? In that case he would never have seduced a carpenter\u0027s wife, and there would have been no God the Son as the fruit of his adultery. Talmage credits General Joshua with the capture of Jericho. The Bible says that Jehovah overcame it. Seven priests went blowing rams\u0027 horns round the city for seven days. On the seventh day they went round it seven times. It must have been tiresome work, for Jericho was a large city several miles in circumference. But priests are always good \"Walkers.\" After the last blowing of horns all the Jews shouted \"Down Jericho, down Jericho!\" This is Talmage\u0027s inspired account. The Bible states nothing of the kind. Just as the Islamites cry \"Allah, Il Allah,\" it is probable that the Jews cried \"Jahveh, Jahveh.\" But Talmage and the Bible both agree that when their shout rent the air the walls of Jericho fell flat—as flat as the fools who believe it. Then, says Talmage, \"the huzza of the victorious Israelites and the groan of the conquered Canaanites commingle!\" Ah, that groan! Its sound still curses the Bible God. Men, women and children, were murdered. The very cattle, sheep and asses, were killed with the sword. Only one woman\u0027s house was spared, and she was a harlot. It is as if the German army took Paris, and killed every inhabitant except Cora Pearl. This is inspired war, and Talmage glories in it. He would consider it an honor to be bottle-washer to such a pious hero as General Joshua. When Ai was taken, all its people were slaughtered, without any regard to age or sex. Talmage grins with delight, and cries \"Bravo, Joshua!\" The King of Ai was reserved for sport. They hung him on a tree and enjoyed the fun. Talmage approves this too. Everything Joshua did was right. Talmage is ready to stake his own poor little soul on that. Joshua\u0027s victory over the five kings calls forth a burst of supernatural eloquence. Talmage pictures the \"catapults of the sky pouring a volley of hailstones\" on the flying Amorites, and words almost fail him to describe the glorious miracle of the lengthening of the day in order that Jehovah\u0027s prize-fighters might go on killing. One passage is almost sublime. It is only one step off. \"What,\" asks Talmage, \"is the matter with Joshua? Has he fallen in an apoplectic fit? No. He is in prayer.\" Our profanity would not have gone to that length. But we take Talmage\u0027s word for it that prayer and apoplexy are very much alike. The five kings were decapitated. \"Ah,\" says Talmage, \"I want five more kings beheaded to-day, King Alcohol, King Fraud, King Lust, King Superstition, and King Infidelity.\" Soft, you priestly calumniator! What right have you to associate Infidelity with fraud and lust? That Freethought, which you call \"infidelity,\" is more faithful to truth and justice than your creed has ever been. And it will not be disposed of so easily as you think. You will never behead us, but we shall strangle you. We are crushing the life out of your wretched faith, and your spasmodic sermons are only the groans of its despair. Talmage\u0027s boldest step on the line which separates the ludicrous from the sublime occurs in his peroration. He makes General Joshua conquer Death by lying down and giving up the ghost, and then asks for a headstone and a foot-stone for the holy corpse. \"I imagine,\" he says, \"that for the head it shall be the sun that stood still upon Gibeon, and for the foot the moon that stood still in the valley of Ajalon.\" This is about the finest piece of Yankee buncombe extant. If the sun and moon keep watch over General Joshua\u0027s grave, what are we to do? When we get to the New Jerusalem we shall want neither of these luminaries, for the glory of the Lord will shine upon us. But until then we cannot dispense with them, and we decidedly object to their being retained as perpetual mourners over Joshua\u0027s grave. If, however, one of them must do service, we humbly beg that it may be the moon. Let the sun illumine us by day, so that we may see to transact our affairs. And if ever we should long to behold \"pale Dians beams\" again, we might take Talmage as our guide to the unknown grave of General Joshua, and while they played softly over the miraculous two yards of turf we should see his fitting epitaph—Moonshine.","sourceLink":"http://novel.tingroom.com/duanpian/3217/87775.html","bookId":719,"book":{"id":719,"title":"Arrows of Freethought","description":"简介： The Archbishop of York is peculiarly qualified to speak on religion and progress. His form of thanksgiving to the God of Battles for our victory in Egypt marks him as a man of extraordinary intellect and character, such as common people may admire wi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3217","creation":"Aug 1, 2019 12:19:12 AM","modification":"Aug 1, 2019 12:19:12 AM"}}
