{"id":9897,"no":13,"title":"Chapter XIII Awaking From the Trance","content":"The first unexpected words may always startle a hearer; but when the shock is over, the listener\u0027s reason has asserted itself, and he can judge of the manner, as well as of the matter, of speech. Thus it was on this occasion. With intelligence now alert, I could not doubt of the simple sincerity of Margaret\u0027s next question. \"What have you two men been talking about all this time, Mr. Ross? I suppose, Mr. Corbeck has been telling you all his adventures in finding the lamps. I hope you will tell me too, some day, Mr. Corbeck; but that must not be till my poor Father is better. He would like, I am sure, to tell me all about these things himself; or to be present when I heard them.\" She glanced sharply from one to the other. \"Oh, that was what you were saying as I came in? All right! I shall wait; but I hope it won\u0027t be long. The continuance of Father\u0027s condition is, I feel, breaking me down. A little while ago I felt that my nerves were giving out; so I determined to go out for a walk in the Park. I am sure it will do me good. I want you, if you will, Mr. Ross, to be with Father whilst I am away. I shall feel secure then.\" I rose with alacrity, rejoicing that the poor girl was going out, even for half an hour. She was looking terribly wearied and haggard; and the sight of her pale cheeks made my heart ache. I went to the sick-room; and sat down in my usual place. Mrs. Grant was then on duty; we had not found it necessary to have more than one person in the room during the day. When I came in, she took occasion to go about some household duty. The blinds were up, but the north aspect of the room softened the hot glare of the sunlight without. I sat for a long time thinking over all that Mr. Corbeck had told me; and weaving its wonders into the tissue of strange things which had come to pass since I had entered the house. At times I was inclined to doubt; to doubt everything and every one; to doubt even the evidences of my own five senses. The warnings of the skilled detective kept coming back to my mind. He had put down Mr. Corbeck as a clever liar, and a confederate of Miss Trelawny. Of Margaret! That settled it! Face to face with such a proposition as that, doubt vanished. Each time when her image, her name, the merest thought of her, came before my mind, each event stood out stark as a living fact. My life upon her faith! I was recalled from my reverie, which was fast becoming a dream of love, in a startling manner. A voice came from the bed; a deep, strong, masterful voice. The first note of it called up like a clarion my eyes and my ears. The sick man was awake and speaking! \"Who are you? What are you doing here?\" Whatever ideas any of us had ever formed of his waking, I am quite sure that none of us expected to see him start up all awake and full master of himself. I was so surprised that I answered almost mechanically: \"Ross is my name. I have been watching by you!\" He looked surprised for an instant, and then I could see that his habit of judging for himself came into play. \"Watching by me! How do you mean? Why watching by me?\" His eye had now lit on his heavily bandaged wrist. He went on in a different tone; less aggressive, more genial, as of one accepting facts: \"Are you a doctor?\" I felt myself almost smiling as I answered; the relief from the long pressure of anxiety regarding his life was beginning to tell: \"No, sir!\" \"Then why are you here? If you are not a doctor, what are you?\" His tone was again more dictatorial. Thought is quick; the whole train of reasoning on which my answer must be based flooded through my brain before the words could leave my lips. Margaret! I must think of Margaret! This was her father, who as yet knew nothing of me; even of my very existence. He would be naturally curious, if not anxious, to know why I amongst men had been chosen as his daughter\u0027s friend on the occasion of his illness. Fathers are naturally a little jealous in such matters as a daughter\u0027s choice, and in the undeclared state of my love for Margaret I must do nothing which could ultimately embarrass her. \"I am a Barrister. It is not, however, in that capacity I am here; but simply as a friend of your daughter. It was probably her knowledge of my being a lawyer which first determined her to ask me to come when she thought you had been murdered. Afterwards she was good enough to consider me to be a friend, and to allow me to remain in accordance with your expressed wish that someone should remain to watch.\" Mr. Trelawny was manifestly a man of quick thought, and of few words. He gazed at me keenly as I spoke, and his piercing eyes seemed to read my thought. To my relief he said no more on the subject just then, seeming to accept my words in simple faith. There was evidently in his own mind some cause for the acceptance deeper than my own knowledge. His eyes flashed, and there was an unconscious movement of the mouth—it could hardly be called a twitch—which betokened satisfaction. He was following out some train of reasoning in his own mind. Suddenly he said: \"She thought I had been murdered! Was that last night?\" \"No! four days ago.\" He seemed surprised. Whilst he had been speaking the first time he had sat up in bed; now he made a movement as though he would jump out. With an effort, however, he restrained himself; leaning back on his pillows he said quietly: \"Tell me all about it! All you know! Every detail! Omit nothing! But stay; first lock the door! I want to know, before I see anyone, exactly how things stand.\" Somehow his last words made my heart leap. \"Anyone!\" He evidently accepted me, then, as an exception. In my present state of feeling for his daughter, this was a comforting thought. I felt exultant as I went over to the door and softly turned the key. When I came back I found him sitting up again. He said: \"Go on!\" Accordingly, I told him every detail, even of the slightest which I could remember, of what had happened from the moment of my arrival at the house. Of course I said nothing of my feeling towards Margaret, and spoke only concerning those things already within his own knowledge. With regard to Corbeck, I simply said that he had brought back some lamps of which he had been in quest. Then I proceeded to tell him fully of their loss, and of their re-discovery in the house. He listened with a self-control which, under the circumstances, was to me little less than marvellous. It was impassiveness, for at times his eyes would flash or blaze, and the strong fingers of his uninjured hand would grip the sheet, pulling it into far-extending wrinkles. This was most noticeable when I told him of the return of Corbeck, and the finding of the lamps in the boudoir. At times he spoke, but only a few words, and as if unconsciously in emotional comment. The mysterious parts, those which had most puzzled us, seemed to have no special interest for him; he seemed to know them already. The utmost concern he showed was when I told him of Daw\u0027s shooting. His muttered comment: \"stupid ass!\" together with a quick glance across the room at the injured cabinet, marked the measure of his disgust. As I told him of his daughter\u0027s harrowing anxiety for him, of her unending care and devotion, of the tender love which she had shown, he seemed much moved. There was a sort of veiled surprise in his unconscious whisper: \"Margaret! Margaret!\" When I had finished my narration, bringing matters up to the moment when Miss Trelawny had gone out for her walk—I thought of her as \"Miss Trelawny\u0027, not as \u0027Margaret\u0027 now, in the presence of her father—he remained silent for quite a long time. It was probably two or three minutes; but it seemed interminable. All at once he turned and said to me briskly: \"Now tell me all about yourself!\" This was something of a floorer; I felt myself grow red-hot. Mr. Trelawny\u0027s eyes were upon me; they were now calm and inquiring, but never ceasing in their soul-searching scrutiny. There was just a suspicion of a smile on the mouth which, though it added to my embarrassment, gave me a certain measure of relief. I was, however, face to face with difficulty; and the habit of my life stood me in good stead. I looked him straight in the eyes as I spoke: \"My name, as I told you, is Ross, Malcolm Ross. I am by profession a Barrister. I was made a Q. C. in the last year of the Queen\u0027s reign. I have been fairly successful in my work.\" To my relief he said: \"Yes, I know. I have always heard well of you! Where and when did you meet Margaret?\" \"First at the Hay\u0027s in Belgrave Square, ten days ago. Then at a picnic up the river with Lady Strathconnell. We went from Windsor to Cookham. Mar—Miss Trelawny was in my boat. I scull a little, and I had my own boat at Windsor. We had a good deal of conversation—naturally.\" \"Naturally!\" there was just a suspicion of something sardonic in the tone of acquiescence; but there was no other intimation of his feeling. I began to think that as I was in the presence of a strong man, I should show something of my own strength. My friends, and sometimes my opponents, say that I am a strong man. In my present circumstances, not to be absolutely truthful would be to be weak. So I stood up to the difficulty before me; always bearing in mind, however, that my words might affect Margaret\u0027s happiness through her love for her father. I went on: \"In conversation at a place and time and amid surroundings so pleasing, and in a solitude inviting to confidence, I got a glimpse of her inner life. Such a glimpse as a man of my years and experience may get from a young girl!\" The father\u0027s face grew graver as I went on; but he said nothing. I was committed now to a definite line of speech, and went on with such mastery of my mind as I could exercise. The occasion might be fraught with serious consequences to me too. \"I could not but see that there was over her spirit a sense of loneliness which was habitual to her. I thought I understood it; I am myself an only child. I ventured to encourage her to speak to me freely; and was happy enough to succeed. A sort of confidence became established between us.\" There was something in the father\u0027s face which made me add hurriedly: \"Nothing was said by her, sir, as you can well imagine, which was not right and proper. She only told me in the impulsive way of one longing to give voice to thoughts long carefully concealed, of her yearning to be closer to the father whom she loved; more en rapport with him; more in his confidence; closer within the circle of his sympathies. Oh, believe me, sir, that it was all good! All that a father\u0027s heart could hope or wish for! It was all loyal! That she spoke it to me was perhaps because I was almost a stranger with whom there was no previous barrier to confidence.\" Here I paused. It was hard to go on; and I feared lest I might, in my zeal, do Margaret a disservice. The relief of the strain came from her father. \"And you?\" \"Sir, Miss Trelawny is very sweet and beautiful! She is young; and her mind is like crystal! Her sympathy is a joy! I am not an old man, and my affections were not engaged. They never had been till then. I hope I may say as much, even to a father!\" My eyes involuntarily dropped. When I raised them again Mr. Trelawny was still gazing at me keenly. All the kindliness of his nature seemed to wreath itself in a smile as he held out his hand and said: \"Malcolm Ross, I have always heard of you as a fearless and honourable gentleman. I am glad my girl has such a friend! Go on!\" My heart leaped. The first step to the winning of Margaret\u0027s father was gained. I dare say I was somewhat more effusive in my words and my manner as I went on. I certainly felt that way. \"One thing we gain as we grow older: to use our age judiciously! I have had much experience. I have fought for it and worked for it all my life; and I felt that I was justified in using it. I ventured to ask Miss Trelawny to count on me as a friend; to let me serve her should occasion arise. She promised me that she would. I had little idea that my chance of serving her should come so soon or in such a way; but that very night you were stricken down. In her desolation and anxiety she sent for me!\" I paused. He continued to look at me as I went on: \"When your letter of instructions was found, I offered my services. They were accepted, as you know.\" \"And these days, how did they pass for you?\" The question startled me. There was in it something of Margaret\u0027s own voice and manner; something so greatly resembling her lighter moments that it brought out all the masculinity in me. I felt more sure of my ground now as I said: \"These days, sir, despite all their harrowing anxiety, despite all the pain they held for the girl whom I grew to love more and more with each passing hour, have been the happiest of my life!\" He kept silence for a long time; so long that, as I waited for him to speak, with my heart beating, I began to wonder if my frankness had been too effusive. At last he said: \"I suppose it is hard to say so much vicariously. Her poor mother should have heard you; it would have made her heart glad!\" Then a shadow swept across his face; and he went on more hurriedly. \"But are you quite sure of all this?\" \"I know my own heart, sir; or, at least, I think I do!\" \"No! no!\" he answered, \"I don\u0027t mean you. That is all right! But you spoke of my girl\u0027s affection for me ... and yet...! And yet she has been living here, in my house, a whole year... Still, she spoke to you of her loneliness—her desolation. I never—it grieves me to say it, but it is true—I never saw sign of such affection towards myself in all the year!...\" His voice trembled away into sad, reminiscent introspection. \"Then, sir,\" I said, \"I have been privileged to see more in a few days than you in her whole lifetime!\" My words seemed to call him up from himself; and I thought that it was with pleasure as well as surprise that he said: \"I had no idea of it. I thought that she was indifferent to me. That what seemed like the neglect of her youth was revenging itself on me. That she was cold of heart.... It is a joy unspeakable to me that her mother\u0027s daughter loves me too!\" Unconsciously he sank back upon his pillow, lost in memories of the past. How he must have loved her mother! It was the love of her mother\u0027s child, rather than the love of his own daughter, that appealed to him. My heart went out to him in a great wave of sympathy and kindliness. I began to understand. To understand the passion of these two great, silent, reserved natures, that successfully concealed the burning hunger for the other\u0027s love! It did not surprise me when presently he murmured to himself: \"Margaret, my child! Tender, and thoughtful, and strong, and true, and brave! Like her dear mother! like her dear mother!\" And then to the very depths of my heart I rejoiced that I had spoken so frankly. Presently Mr. Trelawny said: \"Four days! The sixteenth! Then this is the twentieth of July?\" I nodded affirmation; he went on: \"So I have been lying in a trance for four days. It is not the first time. I was in a trance once under strange conditions for three days; and never even suspected it till I was told of the lapse of time. I shall tell you all about it some day, if you care to hear.\" That made me thrill with pleasure. That he, Margaret\u0027s father, would so take me into his confidence made it possible.... The business-like, every-day alertness of his voice as he spoke next quite recalled me: \"I had better get up now. When Margaret comes in, tell her yourself that I am all right. It will avoid any shock! And will you tell Corbeck that I would like to see him as soon as I can. I want to see those lamps, and hear all about them!\" His attitude towards me filled me with delight. There was a possible father-in-law aspect that would have raised me from a death-bed. I was hurrying away to carry out his wishes; when, however, my hand was on the key of the door, his voice recalled me: \"Mr. Ross!\" I did not like to hear him say \"Mr.\" After he knew of my friendship with his daughter he had called me Malcolm Ross; and this obvious return to formality not only pained, but filled me with apprehension. It must be something about Margaret. I thought of her as \"Margaret\" and not as \"Miss Trelawny\", now that there was danger of losing her. I know now what I felt then: that I was determined to fight for her rather than lose her. I came back, unconsciously holding myself erect. Mr. Trelawny, the keen observer of men, seemed to read my thought; his face, which was set in a new anxiety, relaxed as he said: \"Sit down a minute; it is better that we speak now than later. We are both men, and men of the world. All this about my daughter is very new to me, and very sudden; and I want to know exactly how and where I stand. Mind, I am making no objection; but as a father I have duties which are grave, and may prove to be painful. I—I\"—he seemed slightly at a loss how to begin, and this gave me hope—\"I suppose I am to take it, from what you have said to me of your feelings towards my girl, that it is in your mind to be a suitor for her hand, later on?\" I answered at once: \"Absolutely! Firm and fixed; it was my intention the evening after I had been with her on the river, to seek you, of course after a proper and respectful interval, and to ask you if I might approach her on the subject. Events forced me into closer relationship more quickly than I had to hope would be possible; but that first purpose has remained fresh in my heart, and has grown in intensity, and multiplied itself with every hour which has passed since then.\" His face seemed to soften as he looked at me; the memory of his own youth was coming back to him instinctively. After a pause he said: \"I suppose I may take it, too, Malcolm Ross\"—the return to the familiarity of address swept through me with a glorious thrill—\"that as yet you have not made any protestation to my daughter?\" \"Not in words, sir.\" The arriere pensee of my phrase struck me, not by its own humour, but through the grave, kindly smile on the father\u0027s face. There was a pleasant sarcasm in his comment: \"Not in words! That is dangerous! She might have doubted words, or even disbelieved them.\" I felt myself blushing to the roots of my hair as I went on: \"The duty of delicacy in her defenceless position; my respect for her father—I did not know you then, sir, as yourself, but only as her father—restrained me. But even had not these barriers existed, I should not have dared in the presence of such grief and anxiety to have declared myself. Mr. Trelawny, I assure you on my word of honour that your daughter and I are as yet, on her part, but friends and nothing more!\" Once again he held out his hands, and we clasped each other warmly. Then he said heartily: \"I am satisfied, Malcolm Ross. Of course, I take it that until I have seen her and have given you permission, you will not make any declaration to my daughter—in words,\" he added, with an indulgent smile. But his face became stern again as he went on: \"Time presses; and I have to think of some matters so urgent and so strange that I dare not lose an hour. Otherwise I should not have been prepared to enter, at so short a notice and to so new a friend, on the subject of my daughter\u0027s settlement in life, and of her future happiness.\" There was a dignity and a certain proudness in his manner which impressed me much. \"I shall respect your wishes, sir!\" I said as I went back and opened the door. I heard him lock it behind me. When I told Mr. Corbeck that Mr. Trelawny had quite recovered, he began to dance about like a wild man. But he suddenly stopped, and asked me to be careful not to draw any inferences, at all events at first, when in the future speaking of the finding of the lamps, or of the first visits to the tomb. This was in case Mr. Trelawny should speak to me on the subject; \"as, of course, he will,\" he added, with a sidelong look at me which meant knowledge of the affairs of my heart. I agreed to this, feeling that it was quite right. I did not quite understand why; but I knew that Mr. Trelawny was a peculiar man. In no case could one make a mistake by being reticent. Reticence is a quality which a strong man always respects. The manner in which the others of the house took the news of the recovery varied much. Mrs. Grant wept with emotion; then she hurried off to see if she could do anything personally, and to set the house in order for \"Master\", as she always called him. The Nurse\u0027s face fell: she was deprived of an interesting case. But the disappointment was only momentary; and she rejoiced that the trouble was over. She was ready to come to the patient the moment she should be wanted; but in the meantime she occupied herself in packing her portmanteau. I took Sergeant Daw into the study, so that we should be alone when I told him the news. It surprised even his iron self-control when I told him the method of the waking. I was myself surprised in turn by his first words: \"And how did he explain the first attack? He was unconscious when the second was made.\" Up to that moment the nature of the attack, which was the cause of my coming to the house, had never even crossed my mind, except when I had simply narrated the various occurrences in sequence to Mr. Trelawny. The Detective did not seem to think much of my answer: \"Do you know, it never occurred to me to ask him!\" The professional instinct was strong in the man, and seemed to supersede everything else. \"That is why so few cases are ever followed out,\" he said, \"unless our people are in them. Your amateur detective neer hunts down to the death. As for ordinary people, the moment things begin to mend, and the strain of suspense is off them, they drop the matter in hand. It is like sea-sickness,\" he added philosophically after a pause; \"the moment you touch the shore you never give it a thought, but run off to the buffet to feed! Well, Mr. Ross, I\u0027m glad the case is over; for over it is, so far as I am concerned. I suppose that Mr. Trelawny knows his own business; and that now he is well again, he will take it up himself. Perhaps, however, he will not do anything. As he seemed to expect something to happen, but did not ask for protection from the police in any way, I take it that he don\u0027t want them to interfere with an eye to punishment. We\u0027ll be told officially, I suppose, that it was an accident, or sleep-walking, or something of the kind, to satisfy the conscience of our Record Department; and that will be the end. As for me, I tell you frankly, sir, that it will be the saving of me. I verily believe I was beginning to get dotty over it all. There were too many mysteries, that aren\u0027t in my line, for me to be really satisfied as to either facts or the causes of them. Now I\u0027ll be able to wash my hands of it, and get back to clean, wholesome, criminal work. Of course, sir, I\u0027ll be glad to know if you ever do light on a cause of any kind. And I\u0027ll be grateful if you can ever tell me how the man was dragged out of bed when the cat bit him, and who used the knife the second time. For master Silvio could never have done it by himself. But there! I keep thinking of it still. I must look out and keep a check on myself, or I shall think of it when I have to keep my mind on other things!\" When Margaret returned from her walk, I met her in the hall. She was still pale and sad; somehow, I had expected to see her radiant after her walk. The moment she saw me her eyes brightened, and she looked at me keenly. \"You have some good news for me?\" she said. \"Is Father better?\" \"He is! Why did you think so?\" \"I saw it in your face. I must go to him at once.\" She was hurrying away when I stopped her. \"He said he would send for you the moment he was dressed.\" \"He said he would send for me!\" she repeated in amazement. \"Then he is awake again, and conscious? I had no idea he was so well as that! O Malcolm!\" She sat down on the nearest chair and began to cry. I felt overcome myself. The sight of her joy and emotion, the mention of my own name in such a way and at such a time, the rush of glorious possibilities all coming together, quite unmanned me. She saw my emotion, and seemed to understand. She put out her hand. I held it hard, and kissed it. Such moments as these, the opportunities of lovers, are gifts of the gods! Up to this instant, though I knew I loved her, and though I believed she returned my affection, I had had only hope. Now, however, the self-surrender manifest in her willingness to let me squeeze her hand, the ardour of her pressure in return, and the glorious flush of love in her beautiful, deep, dark eyes as she lifted them to mine, were all the eloquences which the most impatient or exacting lover could expect or demand. No word was spoken; none was needed. Even had I not been pledged to verbal silence, words would have been poor and dull to express what we felt. Hand in hand, like two little children, we went up the staircase and waited on the landing, till the summons from Mr. Trelawny should come. I whispered in her ear—it was nicer than speaking aloud and at a greater distance—how her father had awakened, and what he had said; and all that had passed between us, except when she herself had been the subject of conversation. Presently a bell rang from the room. Margaret slipped from me, and looked back with warning finger on lip. She went over to her father\u0027s door and knocked softly. \"Come in!\" said the strong voice. \"It is I, Father!\" The voice was tremulous with love and hope. There was a quick step inside the room; the door was hurriedly thrown open, and in an instant Margaret, who had sprung forward, was clasped in her father\u0027s arms. There was little speech; only a few broken phrases. \"Father! Dear, dear Father!\" \"My child! Margaret! My dear, dear child!\" \"O Father, Father! At last! At last!\" Here the father and daughter went into the room together, and the door closed. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3241/88861.html","bookId":646,"book":{"id":646,"title":"The Jewel of Seven Stars","description":"简介： It all seemed so real that I could hardly imagine that it had ever occurred before; and yet each episode came, not as a fresh step in the logic of things, but as something expected. It is in such a wise that memory plays its pranks for good or ill; f...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3241","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
