{"id":9898,"no":14,"title":"Chapter XIV The Birth-Mark","content":"During my waiting for the summons to Mr. Trelawny\u0027s room, which I knew would come, the time was long and lonely. After the first few moments of emotional happiness at Margaret\u0027s joy, I somehow felt apart and alone; and for a little time the selfishness of a lover possessed me. But it was not for long. Margaret\u0027s happiness was all to me; and in the conscious sense of it I lost my baser self. Margaret\u0027s last words as the door closed on them gave the key to the whole situation, as it had been and as it was. These two proud, strong people, though father and daughter, had only come to know each other when the girl was grown up. Margaret\u0027s nature was of that kind which matures early. The pride and strength of each, and the reticence which was their corollary, made a barrier at the beginning. Each had respected the other\u0027s reticence too much thereafter; and the misunderstanding grew to habit. And so these two loving hearts, each of which yearned for sympathy from the other, were kept apart. But now all was well, and in my heart of hearts I rejoiced that at last Margaret was happy. Whilst I was still musing on the subject, and dreaming dreams of a personal nature, the door was opened, and Mr. Trelawny beckoned to me. \"Come in, Mr. Ross!\" he said cordially, but with a certain formality which I dreaded. I entered the room, and he closed the door again. He held out his hand, and I put mine in it. He did not let it go, but still held it as he drew me over toward his daughter. Margaret looked from me to him, and back again; and her eyes fell. When I was close to her, Mr. Trelawny let go my hand, and, looking his daughter straight in the face, said: \"If things are as I fancy, we shall not have any secrets between us. Malcolm Ross knows so much of my affairs already, that I take it he must either let matters stop where they are and go away in silence, or else he must know more. Margaret! are you willing to let Mr. Ross see your wrist?\" She threw one swift look of appeal in his eyes; but even as she did so she seemed to make up her mind. Without a word she raised her right hand, so that the bracelet of spreading wings which covered the wrist fell back, leaving the flesh bare. Then an icy chill shot through me. On her wrist was a thin red jagged line, from which seemed to hang red stains like drops of blood! She stood there, a veritable figure of patient pride. Oh! but she looked proud! Through all her sweetness, all her dignity, all her high-souled negation of self which I had known, and which never seemed more marked than now—through all the fire that seemed to shine from the dark depths of her eyes into my very soul, pride shone conspicuously. The pride that has faith; the pride that is born of conscious purity; the pride of a veritable queen of Old Time, when to be royal was to be the first and greatest and bravest in all high things. As we stood thus for some seconds, the deep, grave voice of her father seemed to sound a challenge in my ears: \"What do you say now?\" My answer was not in words. I caught Margaret\u0027s right hand in mine as it fell, and, holding it tight, whilst with the other I pushed back the golden cincture, stooped and kissed the wrist. As I looked up at her, but never letting go her hand, there was a look of joy on her face such as I dream of when I think of heaven. Then I faced her father. \"You have my answer, sir!\" His strong face looked gravely sweet. He only said one word as he laid his hand on our clasped ones, whilst he bent over and kissed his daughter: \"Good!\" We were interrupted by a knock at the door. In answer to an impatient \"Come in!\" from Mr. Trelawny, Mr. Corbeck entered. When he saw us grouped he would have drawn back; but in an instant Mr. Trelawny had sprung forth and dragged him forward. As he shook him by both hands, he seemed a transformed man. All the enthusiasm of his youth, of which Mr. Corbeck had told us, seemed to have come back to him in an instant. \"So you have got the lamps!\" he almost shouted. \"My reasoning was right after all. Come to the library, where we will be alone, and tell me all about it! And while he does it, Ross,\" said he, turning to me, \"do you, like a good fellow, get the key from the safe deposit, so that I may have a look at the lamps!\" Then the three of them, the daughter lovingly holding her father\u0027s arm, went into the library, whilst I hurried off to Chancery Lane. When I returned with the key, I found them still engaged in the narrative; but Doctor Winchester, who had arrived soon after I left, was with them. Mr. Trelawny, on hearing from Margaret of his great attention and kindness, and how he had, under much pressure to the contrary, steadfastly obeyed his written wishes, had asked him to remain and listen. \"It will interest you, perhaps,\" he said, \"to learn the end of the story!\" We all had an early dinner together. We sat after it a good while, and then Mr. Trelawny said: \"Now, I think we had all better separate and go quietly to bed early. We may have much to talk about tomorrow; and tonight I want to think.\" Doctor Winchester went away, taking, with a courteous forethought, Mr. Corbeck with him, and leaving me behind. When the others had gone Mr. Trelawny said: \"I think it will be well if you, too, will go home for tonight. I want to be quite alone with my daughter; there are many things I wish to speak of to her, and to her alone. Perhaps, even tomorrow, I will be able to tell you also of them; but in the meantime there will be less distraction to us both if we are alone in the house.\" I quite understood and sympathised with his feelings; but the experiences of the last few days were strong on me, and with some hesitation I said: \"But may it not be dangerous? If you knew as we do—\" To my surprise Margaret interrupted me: \"There will be no danger, Malcolm. I shall be with Father!\" As she spoke she clung to him in a protective way. I said no more, but stood up to go at once. Mr. Trelawny said heartily: \"Come as early as you please, Ross. Come to breakfast. After it, you and I will want to have a word together.\" He went out of the room quietly, leaving us together. I clasped and kissed Margaret\u0027s hands, which she held out to me, and then drew her close to me, and our lips met for the first time. I did not sleep much that night. Happiness on the one side of my bed and Anxiety on the other kept sleep away. But if I had anxious care, I had also happiness which had not equal in my life—or ever can have. The night went by so quickly that the dawn seemed to rush on me, not stealing as is its wont. Before nine o\u0027clock I was at Kensington. All anxiety seemed to float away like a cloud as I met Margaret, and saw that already the pallor of her face had given to the rich bloom which I knew. She told me that her father had slept well, and that he would be with us soon. \"I do believe,\" she whispered, \"that my dear and thoughtful Father has kept back on purpose, so that I might meet you first, and alone!\" After breakfast Mr. Trelawny took us into the study, saying as he passed in: \"I have asked Margaret to come too.\" When we were seated, he said gravely: \"I told you last night that we might have something to say to each other. I dare say that you may have thought that it was about Margaret and yourself. Isn\u0027t that so?\" \"I thought so.\" \"Well, my boy, that is all right. Margaret and I have been talking, and I know her wishes.\" He held out his hand. When I wrung it, and had kissed Margaret, who drew her chair close to mine, so that we could hold hands as we listened, he went on, but with a certain hesitation—it could hardly be called nervousness—which was new to me. \"You know a good deal of my hunt after this mummy and her belongings; and I dare say you have guessed a good deal of my theories. But these at any rate I shall explain later, concisely and categorically, if it be necessary. What I want to consult you about now is this: Margaret and I disagree on one point. I am about to make an experiment; the experiment which is to crown all that I have devoted twenty years of research, and danger, and labour to prepare for. Through it we may learn things that have been hidden from the eyes and the knowledge of men for centuries; for scores of centuries. I do not want my daughter to be present; for I cannot blind myself to the fact that there may be danger in it—great danger, and of an unknown kind. I have, however, already faced very great dangers, and of an unknown kind; and so has that brave scholar who has helped me in the work. As to myself, I am willing to run any risk. For science, and history, and philosophy may benefit; and we may turn one old page of a wisdom unknown in this prosaic age. But for my daughter to run such a risk I am loth. Her young bright life is too precious to throw lightly away; now especially when she is on the very threshold of new happiness. I do not wish to see her life given, as her dear mother\u0027s was—\" He broke down for a moment, and covered his eyes with his hands. In an instant Margaret was beside him, clasping him close, and kissing him, and comforting him with loving words. Then, standing erect, with one hand on his head, she said: \"Father! mother did not bid you stay beside her, even when you wanted to go on that journey of unknown danger to Egypt; though that country was then upset from end to end with war and the dangers that follow war. You have told me how she left you free to go as you wished; though that she thought of danger for you and and feared it for you, is proved by this!\" She held up her wrist with the scar that seemed to run blood. \"Now, mother\u0027s daughter does as mother would have done herself!\" Then she turned to me: \"Malcolm, you know I love you! But love is trust; and you must trust me in danger as well as in joy. You and I must stand beside Father in this unknown peril. Together we shall come through it; or together we shall fail; together we shall die. That is my wish; my first wish to my husband that is to be! Do you not think that, as a daughter, I am right? Tell my Father what you think!\" She looked like a Queen stooping to plead. My love for her grew and grew. I stood up beside her; and took her hand and said: \"Mr. Trelawny! in this Margaret and I are one!\" He took both our hands and held them hard. Presently he said with deep emotion: \"It is as her mother would have done!\" Mr. Corbeck and Doctor Winchester came exactly at the time appointed, and joined us in the library. Despite my great happiness I felt our meeting to be a very solemn function. For I could never forget the strange things that had been; and the idea of the strange things which might be, was with me like a cloud, pressing down on us all. From the gravity of my companions I gathered that each of them also was ruled by some such dominating thought. Instinctively we gathered our chairs into a circle round Mr. Trelawny, who had taken the great armchair near the window. Margaret sat by him on his right, and I was next to her. Mr. Corbeck was on his left, with Doctor Winchester on the other side. After a few seconds of silence Mr. Trelawny said to Mr. Corbeck: \"You have told Doctor Winchester all up to the present, as we arranged?\" \"Yes,\" he answered; so Mr. Trelawny said: \"And I have told Margaret, so we all know!\" Then, turning to the Doctor, he asked: \"And am I to take it that you, knowing all as we know it who have followed the matter for years, wish to share in the experiment which we hope to make?\" His answer was direct and uncompromising: \"Certainly! Why, when this matter was fresh to me, I offered to go on with it to the end. Now that it is of such strange interest, I would not miss it for anything which you could name. Be quite easy in your mind, Mr. Trelawny. I am a scientist and an investigator of phenomena. I have no one belonging to me or dependent on me. I am quite alone, and free to do what I like with my own—including my life!\" Mr. Trelawny bowed gravely, and turning to Mr. Corbeck said: \"I have known your ideas for many years past, old friend; so I need ask you nothing. As to Margaret and Malcolm Ross, they have already told me their wishes in no uncertain way.\" He paused a few seconds, as though to put his thoughts or his words in order; then he began to explain his views and intentions. He spoke very carefully, seeming always to bear in mind that some of us who listened were ignorant of the very root and nature of some things touched upon, and explaining them to us as he went on: \"The experiment which is before us is to try whether or no there is any force, any reality, in the old Magic. There could not possibly be more favourable conditions for the test; and it is my own desire to do all that is possible to make the original design effective. That there is some such existing power I firmly believe. It might not be possible to create, or arrange, or organise such a power in our own time; but I take it that if in Old Time such a power existed, it may have some exceptional survival. After all, the Bible is not a myth; and we read there that the sun stood still at a man\u0027s command, and that an ass—not a human one—spoke. And if the Witch at Endor could call up to Saul the spirit of Samuel, why may not there have been others with equal powers; and why may not one among them survive? Indeed, we are told in the Book of Samuel that the Witch of Endor was only one of many, and her being consulted by Saul was a matter of chance. He only sought one among the many whom he had driven out of Israel; \u0027all those that had Familiar Spirits, and the Wizards.\u0027 This Egyptian Queen, Tera, who reigned nearly two thousand years before Saul, had a Familiar, and was a Wizard too. See how the priests of her time, and those after it tried to wipe out her name from the face of the earth, and put a curse over the very door of her tomb so that none might ever discover the lost name. Ay, and they succeeded so well that even Manetho, the historian of the Egyptian Kings, writing in the tenth century before Christ, with all the lore of the priesthood for forty centuries behind him, and with possibility of access to every existing record, could not even find her name. Did it strike any of you, in thinking of the late events, who or what her Familiar was?\" There was an interruption, for Doctor Winchester struck one hand loudly on the other as he ejaculated: \"The cat! The mummy cat! I knew it!\" Mr. Trelawny smiled over at him. \"You are right! There is every indication that the Familiar of the Wizard Queen was that cat which was mummied when she was, and was not only placed in her tomb, but was laid in the sarcophagus with her. That was what bit into my wrist, what cut me with sharp claws.\" He paused. Margaret\u0027s comment was a purely girlish one: \"Then my poor Silvio is acquitted! I am glad!\" Her father stroked her hair and went on: \"This woman seems to have had an extraordinary foresight. Foresight far, far beyond her age and the philosophy of her time. She seems to have seen through the weakness of her own religion, and even prepared for emergence into a different world. All her aspirations were for the North, the point of the compass whence blew the cool invigorating breezes that make life a joy. From the first, her eyes seem to have been attracted to the seven stars of the Plough from the fact, as recorded in the hieroglyphics in her tomb, that at her birth a great aerolite fell, from whose heart was finally extracted that Jewel of Seven Stars which she regarded as the talisman of her life. It seems to have so far ruled her destiny that all her thought and care circled round it. The Magic Coffer, so wondrously wrought with seven sides, we learn from the same source, came from the aerolite. Seven was to her a magic number; and no wonder. With seven fingers on one hand, and seven toes on one foot. With a talisman of a rare ruby with seven stars in the same position as in that constellation which ruled her birth, each star of the seven having seven points—in itself a geological wonder—it would have been odd if she had not been attracted by it. Again, she was born, we learn in the Stele of her tomb, in the seventh month of the year—the month beginning with the Inundation of the Nile. Of which month the presiding Goddess was Hathor, the Goddess of her own house, of the Antefs of the Theban line—the Goddess who in various forms symbolises beauty, and pleasure, and resurrection. Again, in this seventh month—which, by later Egyptian astronomy began on October 28th, and ran to the 27th of our November—on the seventh day the Pointer of the Plough just rises above the horizon of the sky at Thebes. \"In a marvellously strange way, therefore, are grouped into this woman\u0027s life these various things. The number seven; the Pole Star, with the constellation of seven stars; the God of the month, Hathor, who was her own particular God, the God of her family, the Antefs of the Theban Dynasty, whose Kings\u0027 symbol it was, and whose seven forms ruled love and the delights of life and resurrection. If ever there was ground for magic; for the power of symbolism carried into mystic use; for a belief in finites spirits in an age which knew not the Living God, it is here. \"Remember, too, that this woman was skilled in all the science of her time. Her wise and cautious father took care of that, knowing that by her own wisdom she must ultimately combat the intrigues of the Hierarchy. Bear in mind that in old Egypt the science of Astronomy began and was developed to an extraordinary height; and that Astrology followed Astronomy in its progress. And it is possible that in the later developments of science with regard to light rays, we may yet find that Astrology is on a scientific basis. Our next wave of scientific thought may deal with this. I shall have something special to call your minds to on this point presently. Bear in mind also that the Egyptians knew sciences, of which today, despite all our advantages, we are profoundly ignorant. Acoustics, for instance, an exact science with the builders of the temples of Karnak, of Luxor, of the Pyramids, is today a mystery to Bell, and Kelvin, and Edison, and Marconi. Again, these old miracle-workers probably understood some practical way of using other forces, and amongst them the forces of light that at present we do not dream of. But of this matter I shall speak later. That Magic Coffer of Queen Tera is probably a magic box in more ways than one. It may—possibly it does—contain forces that we wot not of. We cannot open it; it must be closed from within. How then was it closed? It is a coffer of solid stone, of amazing hardness, more like a jewel than an ordinary marble, with a lid equally solid; and yet all is so finely wrought that the finest tool made today cannot be inserted under the flange. How was it wrought to such perfection? How was the stone so chosen that those translucent patches match the relations of the seven stars of the constellation? How is it, or from what cause, that when the starlight shines on it, it glows from within—that when I fix the lamps in similar form the glow grows greater still; and yet the box is irresponsive to ordinary light however great? I tell you that that box hides some great mystery of science. We shall find that the light will open it in some way: either by striking on some substance, sensitive in a peculiar way to its effect, or in releasing some greater power. I only trust that in our ignorance we may not so bungle things as to do harm to its mechanism; and so deprive the knowledge of our time of a lesson handed down, as by a miracle, through nearly five thousand years. \"In another way, too, there may be hidden in that box secrets which, for good or ill, may enlighten the world. We know from their records, and inferentially also, that the Egyptians studied the properties of herbs and minerals for magic purposes—white magic as well as black. We know that some of the wizards of old could induce from sleep dreams of any given kind. That this purpose was mainly effected by hypnotism, which was another art or science of Old Nile, I have little doubt. But still, they must have had a mastery of drugs that is far beyond anything we know. With our own pharmacopoeia we can, to a certain extent, induce dreams. We may even differentiate between good and bad—dreams of pleasure, or disturbing and harrowing dreams. But these old practitioners seemed to have been able to command at will any form or colour of dreaming; could work round any given subject or thought in almost any was required. In that coffer, which you have seen, may rest a very armoury of dreams. Indeed, some of the forces that lie within it may have been already used in my household.\" Again there was an interruption from Doctor Winchester. \"But if in your case some of these imprisoned forces were used, what set them free at the opportune time, or how? Besides, you and Mr. Corbeck were once before put into a trance for three whole days, when you were in the Queen\u0027s tomb for the second time. And then, as I gathered from Mr. Corbeck\u0027s story, the coffer was not back in the tomb, though the mummy was. Surely in both these cases there must have been some active intelligence awake, and with some other power to wield.\" Mr. Trelawny\u0027s answer was equally to the point: \"There was some active intelligence awake. I am convinced of it. And it wielded a power which it never lacks. I believe that on both those occasions hypnotism was the power wielded.\" \"And wherein is that power contained? What view do you hold on the subject?\" Doctor Winchester\u0027s voice vibrated with the intensity of his excitement as he leaned forward, breathing hard, and with eyes staring. Mr. Trelawny said solemnly: \"In the mummy of the Queen Tera! I was coming to that presently. Perhaps we had better wait till I clear the ground a little. What I hold is, that the preparation of that box was made for a special occasion; as indeed were all the preparations of the tomb and all belonging to it. Queen Tera did not trouble herself to guard against snakes and scorpions, in that rocky tomb cut in the sheer cliff face a hundred feet above the level of the valley, and fifty down from the summit. Her precautions were against the disturbances of human hands; against the jealousy and hatred of the priests, who, had they known of her real aims, would have tried to baffle them. From her point of view, she made all ready for the time of resurrection, whenever that might be. I gather from the symbolic pictures in the tomb that she so far differed from the belief of her time that she looked for a resurrection in the flesh. It was doubtless this that intensified the hatred of the priesthood, and gave them an acceptable cause for obliterating the very existence, present and future, of one who had outrage their theories and blasphemed their gods. All that she might require, either in the accomplishment of the resurrection or after it, were contained in that almost hermetically sealed suite of chambers in the rock. In the great sarcophagus, which as you know is of a size quite unusual even for kings, was the mummy of her Familiar, the cat, which from its great size I take to be a sort of tiger-cat. In the tomb, also in a strong receptacle, were the canopic jars usually containing those internal organs which are separately embalmed, but which in this case had no such contents. So that, I take it, there was in her case a departure in embalming; and that the organs were restored to the body, each in its proper place—if, indeed, they had ever been removed. If this surmise be true, we shall find that the brain of the Queen either was never extracted in the usual way, or, if so taken out, that it was duly replaced, instead of being enclosed within the mummy wrappings. Finally, in the sarcophagus there was the Magic Coffer on which her feet rested. Mark you also, the care taken in the preservance of her power to control the elements. According to her belief, the open hand outside the wrappings controlled the Air, and the strange Jewel Stone with the shining stars controlled Fire. The symbolism inscribed on the soles of her feet gave sway over Land and Water. About the Star Stone I shall tell you later; but whilst we are speaking of the sarcophagus, mark how she guarded her secret in case of grave-wrecking or intrusion. None could open her Magic Coffer without the lamps, for we know now that ordinary light will not be effective. The great lid of the sarcophagus was not sealed down as usual, because she wished to control the air. But she hid the lamps, which in structure belong to the Magic Coffer, in a place where none could find them, except by following the secret guidance which she had prepared for only the eyes of wisdom. And even here she had guarded against chance discovery, by preparing a bolt of death for the unwary discoverer. To do this she had applied the lesson of the tradition of the avenging guard of the treasures of the pyramid, built by her great predecessor of the Fourth Dynasty of the throne of Egypt. \"You have noted, I suppose, how there were, in the case of her tomb, certain deviations from the usual rules. For instance, the shaft of the Mummy Pit, which is usually filled up solid with stones and rubbish, was left open. Why was this? I take it that she had made arrangements for leaving the tomb when, after her resurrection, she should be a new woman, with a different personality, and less inured to the hardships that in her first existence she had suffered. So far as we can judge of her intent, all things needful for her exit into the world had been thought of, even to the iron chain, described by Van Huyn, close to the door in the rock, by which she might be able to lower herself to the ground. That she expected a long period to elapse was shown in the choice of material. An ordinary rope would be rendered weaker or unsafe in process of time, but she imagined, and rightly, that the iron would endure. \"What her intentions were when once she trod the open earth afresh we do not know, and we never shall, unless her own dead lips can soften and speak.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3241/88862.html","bookId":646,"book":{"id":646,"title":"The Jewel of Seven Stars","description":"简介： It all seemed so real that I could hardly imagine that it had ever occurred before; and yet each episode came, not as a fresh step in the logic of things, but as something expected. It is in such a wise that memory plays its pranks for good or ill; f...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3241","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
