{"id":12694,"no":20,"title":"CHAPTER XX.","content":"\"Apoplexy!\" Dr. Edwardes exclaimed, as soon as he entered. \"Cut his sleeve open, Cuthbert. Fetch a basin, sir, and some water,\" he added to the clerk. He took a lancet from his pocket and opened a vein in the arm. At first only a few drops of dark-colored blood issued out. \"Dip a cloth in cold water and wrap it round his head; and do you, lad, run down to Miggleton, the confectioner, and get some ice, quick; it is a matter of life or death!\" At last the blood began to flow more freely. \"I think he will do now,\" the doctor said, \"it is his first seizure. I have told him a good many times that he was too[Pg 259] fond of good living and did not take exercise enough. What brought this about, Cuthbert?\" \"We had an unpleasant interview, Doctor. I had some ugly truths to tell him and did not spare him.\" \"Then I think you had better go before he comes to his senses again. Tell my man to bring down a mattress, pillows, and blankets. He won\u0027t be fit to be moved to-day, and we must make him up a bed here. Directly I see that he is out of immediate danger, I will send over to Fairclose to break the news to his wife. Yes, I will come round and let you know how he is going on as soon as I can leave him.\" Cuthbert nodded and put on his hat and went out. James Harford was standing a few paces from the door. \"He has had a fit,\" Cuthbert said, as he joined him. \"I thought that was it when I saw the clerk run down the street without a hat and come back with the doctor two or three minutes later. Will he get over it?\" \"The doctor thinks so, and I am sure I most sincerely hope he will do so—it would be a bad business in all ways if he did not. Now, Mr. Harford, I don\u0027t think there is any occasion to detain you here longer; it may be days before I can see him again, and I don\u0027t think it will be needful for you to confirm my statements. I fancy the fight is all out of him—it came upon him too suddenly—if he had known that I was here he might have braced himself up, but coming down like an avalanche upon him it stunned him. Now, Mr. Harford, you must permit me to draw a check for ten pounds for your expenses down here; when I come to my own again I shall be able properly to show my gratitude for the inestimable services you have rendered me.\" \"I will take the money for my expenses, Mr. Hartington, but I can assure you that I have no thought or wish for payment of any kind for my share in this business, and am only too glad to have been able to give some little aid towards righting the grievous harm you have suffered, to say nothing of paying off my old score against Brander.\" Half an hour later Dr. Edwardes returned home.[Pg 260] \"He is conscious now,\" he said to Cuthbert. \"That is to say, vaguely conscious. I have not let him speak a word, but simply told him he had had a fit and must remain absolutely quiet. I don\u0027t suppose he has as yet any recollection whatever of what preceded it. I am going to write a note and send it up to Fairclose. I must keep a close watch over him for a bit, for I have taken a good deal of blood from him.\" \"I would rather you did not mention to anyone, Doctor, that I was present at the time he had the fit, as things may happen ere long that will set people talking, and if it was known that it was during an interview with me that he had this apoplectic stroke it might give rise to unpleasant surmises—unpleasant not only to him but to me, for—this is also a secret at present—I am going to marry his eldest daughter!\" \"You don\u0027t say so, Cuthbert. Well, I congratulate you, for she is a charming girl. I need not say that you can rely upon my keeping it quiet until you choose to have it published.\" \"Well, Doctor, as it may be some days before I can see Brander again, I will go back to town this evening. I did not see anyone I knew as I went to his office, and I would rather that it should not be known that I am down here. As you are going back there now you might ask Levison to come round here to see me. I will then tell him that neither Brander nor myself would wish it mentioned that I was with him at the time he had that seizure.\" \"Then I suppose the fact is, Cuthbert, that while I have been flattering myself your visit was to me, you really came down to see Brander?\" \"I am rather afraid, Doctor, that had some influence in bringing me down, but you must forgive me this time.\" \"All right, lad, I am glad to have had a glimpse of you again, whatever your motive was in coming down.\" It was ten days before Cuthbert received a letter from the doctor saying that Mr. Brander was now strong enough to see him. \"He has asked to see you several times,\" he said, \"but I have told him that I could not permit him to talk. However,[Pg 261] he is a good deal stronger now and is downstairs, again, and as I am sure some worry or other is preying on his mind and keeping him back, I told him this morning that I would send for you.\" Cuthbert went down by the next train and was driven over in the doctor\u0027s gig to Fairclose. It was strange to him to enter the familiar house as a visitor, and he looked round the library into which he was shown upon giving his name, with a sort of doubt whether the last two years had not been a dream. He had not much time for thought for the door opened and Mr. Brander entered. Cuthbert was shocked at his appearance. He looked a mere wreck of himself. He walked feebly and uncertainly. His face was pale and the flesh on the cheeks and chin was loose and flabby. He made his way to an armchair and sank wearily into it. \"What are you going to do with me, Cuthbert Hartington?\" he asked in a weak voice. \"Does all the world know that I am a forger and a swindler?\" \"No one knows it, Mr. Brander, nor need anyone know it. If you make restitution as far as is in your power, the matter may rest entirely between us. With the evidence in my possession I am in a position to obtain a judge\u0027s order striking out my father\u0027s name from the list of shareholders of the bank and annulling the sale of Fairclose, of regaining my own, and of securing your punishment for the offences you have committed. The latter part, as I have said, I have no desire to press. I consider that you have been punished sufficiently already, but I must insist upon the restoration of the estates of which I have been wrongfully deprived.\" \"And you will say nothing of what I have done?\" \"Nothing whatever; it will be for you to offer any reason you choose for resigning Fairclose to me, but there is one other point that I must insist on, namely, that you leave Abchester. Your illness will be a valid excuse for retiring altogether from an active share in the business and of relinquishing the part you have taken in the affairs of the town. As the senior partner you will doubtless receive a sufficient income from your business to enable you to live in comfort elsewhere, and it will be for your[Pg 262] own benefit as much as mine for you to leave the place, for it will be painful for both of us to meet.\" \"I cannot give up Fairclose altogether unburdened,\" the lawyer said. \"￡15,000 of the purchase money I found myself. The other ￡20,000 I raised on mortgages of the estate, and although that mortgage would be invalidated by the proof that I had no power to give it, the mortgagee would, of course, fight the question, and the whole matter would be made public.\" Cuthbert was silent for a minute, not from any great doubt or hesitation, but he did not wish the man to see that he was eager to make terms, for he would at once think that he was not in the position to prove the statement he had made. \"It is a large sum,\" he said, \"a very large sum to lose, and then there are two years\u0027 rents that you have received.\" \"These I could repay, Mr. Harrington,\" the lawyer said, eagerly. \"I have six thousand pounds invested in securities I could realize at once.\" Cuthbert was silent again. \"Mr. Brander,\" he said at last, \"I feel, and I think naturally, very sore at the cruel wrong that has been inflicted upon me, but I cannot forget that in my boyhood I was always received with kindness by your wife, and for her sake, and that of your daughters, I am most anxious your reputation should remain untarnished. I am willing to believe that this crime was the result of a sudden impulse, and that in other respects you have been an honest man. I cannot forget, too, that my father had a great esteem for you. As to the two years\u0027 rents you have received, I will not claim them. I have done well enough without them, and in fact the necessity for working for my living has been of great advantage to me, and that alone makes me less inclined than I otherwise might be to press hardly upon you. I will, therefore, make this offer. You shall sign a paper that I have drawn up confessing the share you have taken in this business. That paper I pledge myself solemnly to keep a profound secret, unless by any subsequent actions you force me to use it in self-protection, and that you will sign a deed of gift to me of Fairclose and its estates, subject to the mortgage of[Pg 263] ￡20,000. You can hand me over the deeds of the estate and I will have the deed of gift drawn up. You will also give me your promise to leave this town and settle elsewhere. On these conditions, I pledge you my word that the transactions by which you obtained possession of the estates shall not be divulged, and that the high reputation you bear shall be altogether unsullied.\" \"God bless you, Mr. Hartington,\" the lawyer said, in a broken voice, \"for your generosity in sparing my wife and children from the shame and disgrace that would have fallen upon them had you insisted on your rights. It is more than I deserve. I have never had a day\u0027s happiness since I came here; it seemed to me that all danger of detection had passed, and yet it was ever before me. I was ever dreading that in some way I had not provided against, it would come out.\" \"May I ask what income you will draw from your business?\" \"The business is worth between four and five thousand a year, and by my deed of partnership I was to receive two-thirds of that as long as I myself chose to take a share in the management, and one-third when I like to retire altogether. A thousand a year is to be paid to my widow after my death, and two hundred apiece to my daughters at her death.\" \"So you will have some fifteen hundred a year, Mr. Brander, and with that and the six thousand you have invested you will not do badly. I shall return to town this evening again and will bring down the deed as soon as it is prepared.\" \"The papers connected with the estate are in a tin box at my office, Mr. Hartington,\" Mr. Brander said, in a voice more like his own than he had hitherto used. \"I will write an order to Levison to hand it over to you. I feel a different man already,\" he went on, as he got up and took a seat at the table; \"before, it seemed to me, there was nothing but disgrace and ruin staring me in the face. Now, I may hope that, thanks to your forbearance, I may enjoy in peace what remains to me of life. You may not believe me, Mr. Hartington, there is no reason why you should—but I swear to you I have been a miserable man ever since your father\u0027s death. It was not that I[Pg 264] was afraid of detection—it seemed to me in that respect I had nothing to fear—and yet I was miserable. Before, I was proud of the respect in which I was held in the town, and felt to some extent I deserved it, for I had given up well nigh every moment of my spare time to its service. Since then I have known that the poorest man in the town would draw aside from me did he but know what I was. To my family it has been a terrible disappointment that the county has turned its back on us. To me it has been a relief. I have felt a sort of satisfaction at finding that, in this respect at least, I had sinned in vain. Were it not for my wife and girls I would even now prefer that all should be known and that I should take the punishment that I deserve. I could bear prison-life better than to go about and mix with other men, knowing what I know of myself and feeling always what they would think of me did they know it also——\" and he broke down and buried his face in his hands. Cuthbert put his hand on his shoulder. \"You have done wrong, Mr. Brander, but as you have repented of it, you may fairly hope it will be forgiven you as freely and as fully as I forgive you. You may take it from me that I feel I have been greatly benefited by what has taken place, and that I have reason to bless the necessity that fell upon me for working for my living. I was spending a very useless and indolent life, and had nothing occurred to rouse me, should probably have led it to the end. Now I have worked hard for two years, and my masters tell me that I have every prospect of rising to eminence as an artist. There will be no occasion for me to rely upon that as a profession now, but the good the necessity for work has done me will remain, and at any rate I shall continue to work at it until this mortgage is paid off. It has in another way brought happiness into my life. Therefore, on my account at least, you need not regret what has happened. I should say nothing at present as to your intention of leaving here. Possibly we may hit upon some reason for your doing so that will be accepted as a natural one. I can assure you I am as anxious as you are yourself, indeed more so, that no shadow of suspicion of anything wrong should rest upon you.[Pg 265] So do not worry yourself about it. You can safely leave it in my hands. Now I will say good-bye. I hope that when I return I shall find you stronger and better. I do not know that there is any occasion for you to sign this paper I have brought.\" \"I would rather do so,\" the lawyer said, firmly. \"It will be a relief to me to know that I have at least made a full confession.\" He took the document Cuthbert had drawn up, read it through carefully, then took a pen and added at the bottom— \"The fifteen thousand pounds mentioned above as having been drawn by me from my bank for the purpose of the mortgage, was really used for the payment of calls on shares held by me in the Oakhurst Mining Company. This can be established by a reference to the accounts of that company in the hands of the liquidator.\" He then signed his name and handed the paper to Cuthbert. In spite of the efforts the latter made to hurry on Messrs. Barrington and Smiles, it was nearly three weeks before the deed of gift was prepared. It had, in the first place, been sketched out by Cuthbert, with the assistance of James Harford, and recited \"That Mr. Brander, of Fairclose, handed back that estate, together with the house and all appurtenances appertaining thereto, to Cuthbert Hartington as a dowry with his daughter Mary upon her marriage with the said Cuthbert Hartington, being moved thereto partly by his love and affection for his daughter, partly by the desire to restore to the said Cuthbert Hartington the family estates of which he had been deprived, partly from the want of care of the said Jeremiah Brander in failing to represent to the late J. W. Hartington, father of the said Cuthbert Hartington, the grievous nature of the liability he would incur by taking shares in the Abchester and County Bank.\" Cuthbert was the more anxious to get the affair arranged, as the insurrection in Paris had broken out, and he was eager to return there. At last the deed was drawn up and he returned to Abchester, and taking a fly at the station drove straight to Fairclose.[Pg 266] He had written several times to Mary lamenting that business had detained him longer than he expected, and suggesting that it would be better for her to leave Paris at once, but she had replied that she would rather remain there, at any rate, until his return. As he did not wish her to come to Abchester at present, he abstained from pressing the point, believing that McMahon would speedily collect a sufficient force at Versailles to suppress the insurrection. He found Mr. Brander looking much more himself. It was a very subdued likeness, but he had evidently gained strength greatly. \"I have been longing for your return,\" he said, as soon as Cuthbert entered the library. \"I am eager to get out of this and to go away. Have you brought down the deed?\" \"Here it is; it is all stamped and in due form, and needs only your signature and that of two witnesses.\" Mr. Brander rang the bell. \"John, call Gardener in. I want you both to witness my signature.\" The coachman came in. \"Glad to see you again, Mr. Cuthbert,\" he said, touching an imaginary hat. \"I am glad to see you, Gardener. I knew you were still here.\" All was ready for the signature. While waiting for the men\u0027s entry Cuthbert had said— \"I would rather you did not read this deed until you have signed it, Mr. Brander. I know it is a most unbusiness-like thing for you to do, but I think you may feel sure you can trust me.\" \"I have no intention of reading it,\" the lawyer said. \"Whatever the conditions of that paper I am ready to comply with them.\" After the signatures had been affixed, and the witnesses had retired, Cuthbert said— \"Now, Mr. Brander, you are at liberty to read the deed. I think you will find its provisions satisfactory.\" Mr. Brander, with a slight shrug of his shoulders that signi[Pg 267]fied that he was indifferent as to the details of the arrangement, took the paper and began to run his eyes carelessly through it. Suddenly his expression changed. He gave a start of surprise, read a few lines farther, and then exclaimed— \"Can this be true, are you really going to marry Mary?\" \"It is quite true,\" Cuthbert said, quietly. \"I first asked her a few weeks before my father\u0027s death when I met her down at Newquay. She refused me at that time, but we have both changed since then. I saw a great deal of her in Paris and she worked as a nurse in the American ambulance during the siege. I was one of her patients, having been shot through the body and brought in there insensible. Having assisted in saving my life she finally came to the conclusion that she could not do better than make that life a happy one. She had refused me because she considered, and rightly, that I was a useless member of society, and the fact that I was heir to Fairclose had no influence whatever with her, but finding that I had amended my ways and was leading an earnest and hard-working life, she accepted me, small though my income was.\" \"God bless her!\" Mr. Brander said, fervently. \"We never got on well together, Mr. Hartington. I had always an uneasy consciousness that she disapproved of me, and that she regarded me as a humbug, and as I was conscious of the fact myself this was not pleasant. So I was rather glad than otherwise that she should choose her own path. But I am indeed delighted at this. She is honesty and truth itself, and I pray she may make up to you for wrongs you have suffered at my hands.\" \"She will do much more than that, Mr. Brander, and you see I have good reason for what I said when I was here before, that the change in my fortune had been a benefit, since it had forced me to take up a profession and work at it. Had it not been for that I should never have won Mary. My being once again master of Fairclose would not have weighed with her in the slightest. She would not have married a mere idler, had he been a duke. Now you had better finish reading the deed.\" The lawyer read it through to the end.[Pg 268] \"You have indeed made it easy for me,\" he said, when he had laid it down. \"You see, I have an object in doing so, Mr. Brander. I told you that my interest in your reputation was as great as your own. I hope that in any case I should not have made a harsh use of the power I possessed. I am sure that I should not, especially as I felt how much I had benefited by the two years of work, but perhaps I might not have felt quite so anxious that no breath of suspicion should fall upon you had it not been for Mary.\" \"Does she know?\" Mr. Brander asked. \"She does not know and will never hear it from me. She may have vague suspicions when she hears that you have made over Fairclose to me, but these will never be more than suspicions. Nor need your other daughters know. They may wonder, perhaps, that Mary should have so large a share of your property, but it will be easy for you to make some sort of explanation, as is given in this deed, of your reason for restoring Fairclose to me with her.\" \"They will be too glad to get away from here, to care much how it was brought about, and if afterwards they come to ask any questions about it, I can tell them so much of the truth that it had been found the sale of the property to me had been altogether illegal and irregular, and that in point of fact you had a right not only to the estate but to the ￡20,000 for which I mortgaged it to raise the purchase money, and to the two-years\u0027 rents. \"That is what I shall tell my wife. I think she has always had a vague suspicion that there was something shady about the transaction, and I shall tell her that, so far from regarding the loss of Fairclose as a hardship, I consider you have behaved with extreme generosity and kindness in the matter. Women do not understand business. I am sure it won\u0027t be necessary to go into details. She, too, will be heartily glad to leave Fairclose.\" \"Shall we go in and see them, Mr. Brander? You can tell them as much or as little of the news as you think fit, and after that you can give me some lunch. I want it badly.\"[Pg 269] \"Thank you,\" Mr. Brander said, gratefully. \"I did not like to ask you, but it will make matters easier.\" He led the way into the drawing-room. Mrs. Brander was sitting at the window with an anxious look on her face. She knew of Cuthbert\u0027s former visit, and that he was again closeted with her husband, and had a strong feeling that something was wrong. The girls were sitting listlessly in easy-chairs, not even pretending to read the books that lay in their laps. They rose with a look of bright surprise on their faces as Cuthbert entered with their father. \"Why, Mr. Hartington, it is ages since we saw you.\" \"It is indeed—it is over two years.\" \"I have two surprising pieces of news to give you, Eliza. In the first place it has been discovered that there was a very serious flaw in the title to Fairclose, and that the sale to me was altogether illegal. Mr. Hartington has behaved most kindly and generously in the matter, but the result is he comes back to Fairclose and we move out.\" The three ladies uttered an exclamation of pleasure. Fairclose had become hateful to them all, and at this moment it mattered little to them how it had come about that they were going to leave it. \"You don\u0027t mean to go back to the High Street, father?\" Julia, the elder of the girls, asked anxiously. \"No, my dear; it will be a question to be settled between us where we will go, but I have decided to leave Abchester altogether. I feel that I require rest and quiet and shall give up business and go right out of it.\" The girls both clapped their hands. \"And now for my second piece of news which will surprise you as much as the first. Your sister Mary is going to marry Mr. Hartington. The matter was settled in Paris, where they have both been shut up during the siege.\" \"That is, indeed, good news,\" Mrs. Brander said cordially, foreseeing at once the advantage of such a marriage. The girls took their cue from her, and professed great pleasure at the news which, however, was not altogether welcome to them.[Pg 270] Mary, whom they had never liked, was to be mistress of Fairclose, and was to gain all the advantages that they had expected but had never obtained. The thought was not pleasant, but it was speedily forgotten in the excitement of the other news. Her mother, however, seeing the pleasure that her husband unmistakably felt at the thought of the marriage, was genuinely pleased. Not only might the connection be useful to the girls, but it might be invaluable in covering their retirement from Fairclose. There might be something more about that than her husband had said. At any rate this would silence all tongues and put an end to the vague anxiety that she had long felt. She had always liked Cuthbert, and had long ago cherished a faint hope that he might some day take to Mary. \"This all comes very suddenly upon us, Mr. Hartington. I suppose I ought to call you Cuthbert again, now.\" \"It would certainly sound more like old times, Mrs. Brander.\" \"Only think, my dear,\" the lawyer put in, \"he proposed to Mary more than two years ago and she refused him. I suppose she never told you?\" \"She never said a word on the subject,\" Mrs. Brander said, almost indignantly. \"Why, it must have been before——\" and she stopped. \"Before my short reign here as master, Mrs. Brander. Yes, I was down at Newquay sketching, when she was staying with her friend, Miss Treadwyn, and Mary was at the time too much occupied with the idea of raising womankind in the scale of humanity to think of taking up with a useless member of society like myself.\" Mrs. Brander shook her head very gravely. \"It was a sad trouble to her father and myself,\" she said; \"I hope she has got over those ideas.\" \"I think she has discovered that the world is too large for her to move,\" Cuthbert replied, with a smile. \"At any rate she has undertaken the task of looking after me instead of reforming the world; it may be as difficult, perhaps, but it sounds less arduous.\" At lunch the girls were engaged in an animated discussion as[Pg 271] to where they would like to move to, but Mrs. Brander put an end to it by saying— \"We shall have plenty of time to talk that over, girls—it must depend upon many things. Your father\u0027s health will, of course, be the first consideration. At any rate, I shall set my face against London. So you can put that altogether out of your minds. An income that would be sufficient to establish one in a good position near a country or seaside town would be nothing in London. And now, Cuthbert, we want to hear a great deal more about our dear Mary. She writes so seldom, and of course she has been cut off for so long a time from us that we scarcely know what she is doing. In Germany she did not seem to be doing anything particular, but as she said in her letters, was studying the people and their language.\" \"That is what she was doing in Paris—at least that is what she came to do, but the siege put a stop to her studies, and she devoted herself to the much more practical work of nursing the wounded.\" \"Dear me, what an extraordinary girl she is,\" Mrs. Brander said, much shocked. \"Surely there were plenty of women in Paris to nurse the wounded without her mixing herself up in such unpleasant work, of which she could know absolutely nothing.\" \"She was a very good nurse, nevertheless,\" Cuthbert said, quietly. \"She worked in the American ambulance, under an American doctor, the other nurses and assistants being all American or English.\" \"How do you know she was a good nurse, Mr. Hartington?\" Clara asked. \"Simply because I was one of her patients, Miss Brander. I joined one of the corps of Franc-tireurs, in which most of my student-friends enrolled themselves, and had the bad luck to get shot through the body in the sortie at Champigny, and as your sister was one of the nurses in the tent where I lay, I think that I am a pretty fair judge as to her powers of nursing. She was often there during the heaviest time for twenty-four hours at a stretch, and completely knocked herself up by he[Pg 272] continued labors. At any rate I consider I owe my life in no small degree to her care.\" \"I don\u0027t think we ever understood Mary,\" Mr. Brander said, in a more peremptory tone than the girls had heard him use since his seizure. \"There is no doubt that it was as much our fault as it was hers. I feel proud to hear that she has done such noble work. Mr. Hartington tells me,\" he said, abruptly changing the conversation, \"that he has been working hard with the intention of making art his profession as it has long been his amusement. He seems to think that although he will, of course, be no longer obliged to look upon it as a necessary career, he intends at any rate to pursue it for a time.\" \"That will be very interesting,\" Mrs. Brander said, \"and it is quite the fashion in our days.\" \"It is very nice when you haven\u0027t to live by it,\" Cuthbert said. \"When you are obliged to do that, and instead of painting what you like, have to paint things that will sell, it is up-hill work, and none but men of real talent can push their way up out of the crowd. I shall be more happily situated, and shall therefore be able to devote an amount of care and time to a picture that would be impossible to a man who had his daily bread and cheese to earn by his brush. And now, Mr. Brander, we will have a few more words together and then I must be off. I shall most likely return to town this evening.\" \"It must be for you to decide, Mr. Brander,\" he went on, when they were alone in the study, \"how this news shall be broken to the public. I am quite ready to be guided entirely by your wishes in the matter.\" \"The sooner the better. I would suggest that you should see Dr. Edwardes before you go up to town. If you will tell him what I told them in the next room, that it has been discovered that there is a flaw in the sale of Fairclose, and that as you are engaged to marry Mary, we have arrived at an amicable agreement under which you will return at once to Fairclose, while I intend to seek an entirely new scene and to retire altogether from business, there will be very little more needful. The news will spread like wildfire over the town and county.[Pg 273] After that I shall have very few questions asked me. None that I shall not be able to answer without difficulty. The state of my health will form an excuse for my cutting my farewells short. There will, no doubt, be some gossip and wonder as to how it has come about, but the county will be so pleased at your coming back again to your father\u0027s place, that they will not be very curious as to how it occurred. I shall go off as quickly and as quietly as I can, after calling to say good-bye to those with whom I have been so long associated in the municipal business. \"It matters not where we go. I can take a furnished house at some seaside watering-place. The doctor will advise which is most likely to suit me, and we can then look round and settle on our future plans at our leisure. If I gain strength I think it likely enough we may travel on the Continent for a time. The girls have never been abroad and the prospect would go a long way towards reconciling them entirely to the change.\" \"I think that a very good plan,\" Cuthbert said. \"I was intending to call upon the doctor on my way down and he will at once set the ball rolling.\" Mr. Brander went to the door where the fly had been waiting for two hours. \"God bless you!\" he said. \"I cannot tell you how deeply grateful I am to you for your forbearance and generosity.\" \"Don\u0027t worry any more about it, Mr. Brander,\" Cuthbert said, as he shook his hand, \"it has been a temporary change, and good rather than bad has come of it. Believe me, I shall put the matter out of my mind altogether.\" \"Back again, Cuthbert,\" the doctor said, when he was shown into the consulting-room. \"I was down just now at the station to see a man off, and the station-master said you had arrived by the 11.30 train, and that he had seen you drive off in a fly. I could hardly believe it, but as you are here in person I suppose that there can be no mistake about it. Of course you have been up to Brander\u0027s again?\" \"I have, Doctor, and for the last time. That is, the next time I shall go up it will be to take possession of Fairclose.\"[Pg 274] \"My dear lad, I am delighted,\" the doctor said, shaking him heartily by the hand, \"how has this miracle come about?\" \"I cannot give you all the details, Doctor. I will simply give you the facts, which, by the way, I shall be glad if you will retail to your patients for public consumption,\" and he then repeated the statement that he had arranged with Mr. Brander that he should make. \"And that is the tale you wish me to disseminate?\" the doctor said, with a twinkle of his eye, when Cuthbert concluded. \"That is the statement, Doctor, and it has the merit of being, as far as it goes, true. What the nature of the illegality of this sale was, I am not at liberty to disclose, not even to you, but I have discovered that beyond all question it was irregular and invalid, and Brander and I have come to a perfectly amicable understanding. I may tell you that to prevent the trouble inseparable even from a friendly lawsuit he assigns the property to me as Mary\u0027s dowry, and as a sort of recognition of the fact that he acted without sufficient care in advising my father to take those shares in the bank. Thus all necessity for the reopening of bygone events will be obviated.\" \"A very sensible way, lad. You will understand, of course, that I know enough of Jeremiah to be quite sure that he would not relinquish a fine property if he had a leg to stand upon. However, that is no business of mine, and I have no doubt that the fact that he is going to be your father-in-law, has had no small influence in bringing about this very admirable arrangement. Of course the matter will make a good deal of talk, but these things soon die out, and the county will welcome you back too heartily to care how your return has been brought about. You can rely upon my action in the part of town-crier, and I am sure to some of my patients the flutter of excitement the news will occasion will do a great deal more good than any medicine I could give them. Of course you are going to stay here?\" \"Only to dinner, Doctor. I shall run up to town again this evening.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3131/86111.html","bookId":893,"book":{"id":893,"title":"A Girl of the Commune","description":"简介： Jeremiah Brander was one of the most prominent personages in the Cathedral town of Abchester. He inhabited an old-fashioned, red brick house near the end of the High Street. On either side was a high wall facing the street, and from this a garden, en...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3131","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
