{"id":95531,"no":20,"title":"Page 20","content":"“This way!” said the guard.\\n\\n “No, this way’s faster,” I heard a voice behind me say. “I’ll show you!” It was the street vendor. He tossed aside his tray of trinkets and led us through a narrow alley, pointing as we came out the other side. “There.”\\n\\n It was the Great Pyramid of Cheops, its golden tip glowing against the melting sky. There was a hieroglyph emblazoned on the golden tip, but it wasn’t Egyptian: It was the ride symbol, shining a neon red. To reach it, we’d have to climb the pyramid.\\n\\n Quinn and I took off across the sands toward the pyramid in the distance, and as I looked around me I realized we were not alone. Dozens ran alongside of us now, a wave of people escorting us, cheering me on to the last ride.\\n\\n I knew Cassandra was somewhere nearby. I could feel the wild extremes of her soul—the searing heat, the frosty cold. But the wake of excitement created by the ride in revolt protected us and swept us toward the pyramid.\\n\\n The rumble in the earth grew more violent, and now the entire sky was melting away. Then, as we reached the base of the pyramid, the ground tore open beneath me. Quinn was already up on the first stone block, but I lost my footing and tumbled into the widening crevasse. Sand poured in all around me; steam rose from down below as I fell. I was so close! So close! My hands had touched the pyramid, but I hadn’t moved fast enough. Now my eyes were so full of sand and steam, I couldn’t see where I was falling, but I didn’t have to see; I knew. I knew because of the sounds around me. The terrible gnashing sounds of gears.\\n\\n I’d fallen into The Works.\\n\\n 13\\n\\n The Works\\n\\n I may forget everything else that happened to me in the park. The memories of the rides may be sucked from my mind by a real world that cannot allow such things to exist. But I will never forget The Works. That will live on in my nightmares. I will feel its grinding metallic teeth every time I see scenes of war, or a plane crash, or some other disaster on the news, too terrible to watch but too riveting to look away from. I will see in those things the dark clockwork that gets built gear by gear out of our dying dreams and our desperate fears. Cassandra did not build The Works. We’re the ones who built it. She just gave it form. I know that as surely as I know that I stood there, and watched the wheels turn.\\n\\n I fell through the crack in the desert sands and landed with a clang on an iron catwalk in a place so hot and humid, my lungs felt as if I were breathing water. All around me were gears, shiny chrome gears, from the size of a dime to what seemed the size of planets. They all revolved at a fever pitch, turning crankshafts and\\n\\n pumping pistons in an unrelenting dance that extended downward into a bottomless pit. The chrome cogs were as cold as a glacier, and yet the air burned furnace-hot. Waves of heat and spatial distortion pulsed out from the great machine, and I had to hold on to the catwalk to overcome a light-headed vertigo as I looked down into the depths. Yet that wasn’t the worst of it.\\n\\n I’d thought at first that whoever was consigned to The Works got ground up in its unforgiving gears like human hamburger, but I was wrong.\\n\\n There were figures working the machine—hundreds upon hundreds of them. They held levers, valves, and cranks, pushing and pulling in a backbreaking rhythm, but they weren’t really holding the machinery. They were growing out of it, their flesh melding into the metal of the gear-work, as much a part of the machine as the cogs, pinions, and rotors. Their muscles bulged, sinewy and strong from the work, but their eyes were vacant and reflective chrome.\\n\\n The park had absorbed them, as Cassandra had said, but I could never have imagined this.\\n\\n Closest to me were two figures laboring on alternate sides of a two-man pump—a seesaw device, like an old-fashioned hand-cranked railroad car. They struggled to turn a ratchet wheel that was connected to a larger wheel that turned a shaft running down to the sweltering depths. Their eyes—their souls—had been voided into mechanical numbness.\\n\\n It was Maggie and Russ.\\n\\n “They make a nice team,” I heard Cassandra say.\\n\\n I turned but couldn’t find her. Her voice seemed to come from all around me.\\n\\n “We’re all part of something larger than ourselves,” she said. “That’s the nature of the universe. And now your friends are part of my machine.”\\n\\n My revulsion and anger fused into something so heavy, I couldn’t move. There was nowhere to go. The catwalk ended just behind me at a huge wheel that slowly churned the steam. On either side of the wheel was a drop down into the hellish Works.\\n\\n Cassandra appeared out of the steam on the narrow catwalk, still adorned in Egyptian splendor. This was it. She was coming in for the final kill. She’d won.\\n\\n What she said next caught me completely by surprise.\\n\\n “Thank you, Blake.” Her voice was soft yet surprisingly clear over the throbbing of the great machine. “Because of you, I’ve experienced fear for the first time. Your challenge was remarkable.” She put her hands on my shoulders. Something about her touch made the atmosphere of The Works different. Sweat still poured from me, yet I felt chilled deep inside. “You wanted to make a deal before,” she said. “Will you deal with me now?”\\n\\n And against all my better judgment, I said, “What do you have in mind?”\\n\\n “Stop now,” she said, “and you can share it with me.”\\n\\n “Share what?”\\n\\n “Everything. All the rides and any other ride you can imagine.”\\n\\n “As your slave.”\\n\\n “No, as my equal.”\\n\\n I realized that she was not just holding me, I was holding her as well. Why? If I felt such fury and such revulsion at what she was, why did I hold her? Was it just her beauty that captivated me, or something more?\\n\\n “This place has always been out of balance,” she said. “It was all that I knew. Now I want to experience the balance you bring.”\\n\\n Suddenly the slave rags I wore began to shimmer like gold. Jewels grew in the fabric, and I found myself clad in a robe of rubies, sapphires, and emeralds.\\n\\n “You could be the god Osiris over a new, better Egypt,” she told me. “You could build any world you desire, be its king or its subject; you could experience thrills or tranquility and move freely from one ride to another, just as I do.” She ran her hands down the length of my jewel-covered arms, then clasped my hands in hers. “I am the park’s soul. I want you to be its mind.”\\n\\n Was she sincere, or was it just another trick? I’d become aware enough to see through her deceptions, and this offer felt real. I had brought her something she never had. I was the only one who ever had.\\n\\n I tore myself away from her eyes long enough to look at Russ and Maggie, laboring across the chasm. “What about them? What about my brother? Will you let them go?”\\n\\n “I can’t do that. But if you stay here, we’ll create rides for each of them. They can have whatever they want, whatever they need, forever and ever.”\\n\\n Could that be possible? Would she really put that kind of power in my hands? I imagined the rides I might design for my friends. For Maggie I’d build a palace of mirrors that told all the truths about herself that were worth telling. How she was kind, generous, compassionate, and, yes, beautiful. Maybe a log flume for Russ! Not a slow, dull one, but one where he could ride down the rapids of an endless river, camping every night at its bank. And for my brother, perhaps a parachute jump that air-dropped food to a starving people. It would open him up to the thrill found in giving, rather than taking.\\n\\n “Think about it, Blake. This place could be different with you here.”\\n\\n The more I thought about Cassandra’s offer, the more appealing it got. I tried to weigh my alternatives against each other. If I took one more ride and survived it, I’d win my freedom. But if I ended my journey here, I’d win the park. A master of worlds . . . it was a dizzying thought. It wasn’t the power, but the peace that appealed to me—the peace of truly being in control at last. She was right: The park would be different with me sharing the power. And she would be different if we weren’t cast as enemies.\\n\\n “The larger the park grows, the more real it becomes,” she said. “In time your world will become the false one, and all these worlds will be real. Come build them with me.”\\n\\n It was there that the bubble burst.\\n\\n “Build them how? Build them on the spirits of others you’ll trap here?”\\n\\n She answered me with no shame or remorse. “Nothing comes without a price, and no one comes who doesn’t choose to be here.”\\n\\n I looked around me once more. So many were trapped here—not just the ones in The Works, but those forced to playact in the worlds of each ride. All for her amusement. If I took my place with Cassandra here, it would be for my amusement as well. I suppose we can all be accused of using people in our lives, but I could never use people the way she did.\\n\\n “I’ve given you your first real challenge,” I told her, “and now you know what it means to be afraid. But there’s something else you still need to experience.”\\n\\n “And what’s that?”\\n\\n “You need to lose.”\\n\\n I reached back, grasping firmly on to the largest wheel, which looked eerily like a giant Ferris wheel. As it turned it tore me out of her arms, lifting me up and up.\\n\\n I heard her scream in anger, but in a moment her voice disappeared into the grinding of The Works, and she was hidden by the billowing plumes of steam.\\n\\n As the wheel took me higher the jewels on my robe dropped away and disappeared into the gear-work. Would I have been a decent “god”? Perhaps. At least I’d like to think so. But the cost of accepting the job was too great.\\n\\n Now my clothes were just rags again as I rode the wheel to the uppermost level of The Works. There, the machinery gave way to a fissure, still streaming sand from Egypt up above. I jumped from the wheel to the jagged rocks, sliding and scrambling for a foothold, kicking rocks down into the depths, until I finally had a grip and stopped sliding. Then I shoved my fingertips and toes into cracks in the stone, pulling my way up. I wasn’t much of a rock climber, but I was learning fast.\\n\\n Quinn saw me the second I came up through the mist. He must have been waiting there all this time. He never lost hope in me. He reached down and helped me out.\\n\\n “I thought it was over,” he said. “I thought you were gone for sure!”\\n\\n “And miss the next ride?” I looked toward the top of the Great Pyramid where the ride symbol glowed. It reminded me that I hadn’t kept my soul, not yet. Refusing Cassandra’s deal bought me nothing if I didn’t get to the next ride, and getting there wouldn’t be easy. The pyramid stones we had to climb were like six-foot-high steps, and there were dozens of them.\\n\\n “We’ll help each other up each step,” I told Quinn. “First you, then me.” I gave Quinn a boost up to the next ledge.\\n\\n We climbed one immense stone after another. Above us the blue sky melted away. Below us the voices of the crowd that had gathered to cheer us became fainter and more distant. Finally we reached the illuminatus, the golden tip of the pyramid. The ride symbol glowed a searing white, matching the glowing brand on the backs of our hands. The spiral of the symbol spanned ten feet, and in the very center of the symbol, where the wave intersected the spiral, was a button about the size of my hand. I slammed my palm down on the button, forcing it in until a mechanism clicked. Somewhere deep down in The Works, a new gear engaged. \\n\\n","sourceLink":"https://allnovel.net/full-tilt/page-20.html","bookId":2591,"book":{"id":2591,"title":"Full Tilt","description":"Storyline: Sixteen-year-old Blake and his younger brother, Quinn, are exact opposites. Blake is the responsible member of the family. He constantly has to keep an eye on the fearless Quinn, whose thrill-seeking sometimes goes too far. But the stakes get higher when Blake has to chase Quinn into a bizarre phantom carnival that traps its customers forever. \\n In order to escape, Blake must survive seven deadly rides by dawn, each of which represents a deep, personal fear -- from a carousel of stampeding animals to a hall of mirrors that changes people into their deformed reflections. Blake ultimately has to face up to a horrible secret from his own past to save himself and his brother -- that is, if the carnival doesn\u0027t claim their souls first!\\n","cover":"https://allnovel.net/images/full-tilt.jpg","author":"Neal Shusterman","type":"Horror","source":"allnovel","link":"https://allnovel.net/full-tilt.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:14:46 PM"}}
