{"id":95514,"no":3,"title":"Page 3","content":"“I . . . uh . . . what?” This girl was beautiful. Beautiful in a way that even now is hard to explain. Like an impressionist painting in a soft gallery spotlight. “I asked if you like the fast rides.” “I . . . can’t get them out of my mind,” I told her, which wasn’t entirely untrue. She smiled as if she knew exactly what I meant. Her hair was long and red—the kind that must have been brushed a thousand times to make it flow in a perfect fall of copper silk. And there was something about her eyes—blue as glacier ice, yet hot as a gas flame—reflecting the chasing lights of the midway. They seemed like windows to some other place. They also seemed familiar. “There are better rides than these,” she said, in as close to a whisper as the loud park would allow. She was older than me. Eighteen at least. Like all the girls will be, I thought. They’ll all be older than you when you get to college next month. Looking at her was like looking into my future. “I’m Cassandra,” she said with a smile. Is she flirting with me? It was a heady feeling. I got a knot in my gut, like I was still on the Kamikaze, turning a tight loop. No hidden safety track here. “I’m Blake.” I held out my hand to shake, and she put a ball into it instead. “Try your luck,” she said. “This one’s on the house.” By now Russ and Maggie had taken notice of the way Cassandra was looking at me and the way I looked back. Russ smirked knowingly. Maggie’s mood took a turn toward sour. “Why are we wasting our time here? Let’s ride something,” she said. Quinn was getting angrier with each ball he threw and each dollar he lost. “These stupid games are all rigged.” He stepped away, and I took his place. A life-altering experience. I shook off the strange feeling that I would have recognized as a premonition if I had had any sense whatsoever. Then I took aim and hurled the ball at the little pyramid of bottles, hitting them squarely in the center. Those bottles flew like they were hit by a freight train, not a baseball. Looking back, I think those bottles would still have fallen even if I had hurled the ball at the moon. Quinn jolted in disgust. “Oh, man!” “We have a winner,” said Cassandra. She reached above her to a menagerie of stuffed animals and pulled one down. She didn’t give me a choice—she decided which one I got. The roller coaster rumbled again, and the air filled with the screams of its riders. “Enjoy,” she said as she handed me my prize. It was a bear, but this bear was one sorry specimen. Its head was lopsided, its bright red eyes were too small and too far apart, making it appear both angry and congenitally stupid at the same time. Its fur was an uneasy shade of greenish brown, like what you get when you mix all of your paints together. “That bear is as inbred as they come,” said Russ. The bear wore a bright yellow jersey bearing the number 7. School bus yellow, I thought, but I shook the thought away. On the jersey was a large pocket in the center of the bear’s chest. The edge of something stuck out of the pocket. I reached in and pulled it out. It was a white card about the size of an index card. On it was a strange symbol in bright red: “What’s that supposed to be?” Quinn asked. I flipped the card over to see what was written on the back. An invitation to ride 10 Hawking Road Midnight to Dawn “I don’t get it.” I looked at the bear as if it could give me an explanation, but all it gave me was a beady, red-eyed stare. “Hey, Cassandra—” I turned to ask her what it was all about, but she was gone. Instead, the booth was now manned by some bearded, bald guy who looked like he’d rather be on a Harley than behind a counter. “Three balls for a buck,” he said. “Wanna play?” “Wait a second. Where’s Cassandra?” “Cassandra who?” I scanned the crowd around us, but there was no sign of her. Somewhere up above, the roller coaster plunged and the ground shook like an aftershock. 3 Ten and Two Last month, on my sixteenth birthday, I bought a car with the money I had made working summer jobs for four years. Mom couldn’t contribute, but that was okay, I never expected her to. It’s a Volvo. Beat up, rusty, and barely breathing, but a Volvo, nonetheless. Still the safest car on the road. Air bags, head-restraint system, front- and rear-end crumple zones, and a crush-resistant passenger compartment. No crash-test dummies lost their lives testing this one. With my license only one month old, I drove us home from the amusement park with both hands on the wheel, positioned at ten and two, like we learned in driver’s ed. “What a rip!” Quinn complained. “What theme park closes at ten at night?” He fiddled with his nose ring, pulling loose a booger that had rotated out on the shiny silver ring like an asteroid. He wiped it on the dashboard, and I smacked him. In the back Russ and Maggie examined the strange invitation to the phantom amusement park. “I think I’ve heard of this place,” Maggie said. “If I’m right, it’s supposed to be pretty good.” “I’ve heard of it too,” Russ said. I thought of the way Cassandra just disappeared. It was pretty creepy. “There’s nothing down Hawking Road,” I informed them. “Just the old quarry.” “Dude, it’s a theme park rave. Never in the same place twice. Attendance by invitation only.” “And we’ve got an invitation,” said Quinn. “Correction: I’ve got an invitation.” Quinn made a face. “What good is it to you? You’ll never go!” “Maybe I will and maybe I won’t.” But we all knew I wouldn’t. I turned a corner, arm over arm, then returned my hands to ten and two. “You know what your problem is—” said Russ, but Maggie didn’t let him finish the thought. She grabbed the invitation from him. “If Blake doesn’t want to go, then he doesn’t have to go.” She slipped the card back into the inbred bear’s pocket. “It’s probably overrated, anyway.” I held back a smile. Whenever I was at the short end of a disagreement, Maggie always shifted the balance to my side. I dropped off Russ, then Maggie. As I worked my way through the neighborhood toward our house, Quinn set his mouth on cruise control, constantly complaining about how I came to a complete three-second stop at every stop sign. “C’mon! At this time of night, stop signs are optional.” “Is there any rule that’s not optional for you?” Then, as I braked for the next stop sign, a little green car barreled across the intersection, completely ignoring the four-way stop. “See? If I didn’t stop, we would have smashed into that Pinto. Do you know what happens when you hit a Pinto?” “What?” “They blow up!” “Cool!” said Quinn. As it turned out, explosive Pintos were the least of our problems. I could tell what type of evening it was going to be when we drove up to our house and saw Mom out front with Carl, boyfriend of the month. So you get the complete picture, I ought to explain about my mother and her boyfriends. You see, Mom is sort of like a blue whale. I don’t mean she’s big—she’s actually on the small side. What I mean is that Mom filters losers through her baleen as if they were krill. I don’t know why; she’s a good person with a big heart—enough of a heart to raise Quinn and me alone on what little she makes. But when it comes to herself, I don’t know, it’s like she never aims as high as she deserves. She could have graduated college, but she dropped out because Dad wanted her to. Then when Dad left, she never went back, because she had to support us. Most of the guys she’s dated were like Dad. They drank too much, demanded too much, and when it came time to give something back, they bailed. But her latest boyfriend seemed to be an exception to the rule. Aside from a bad hair transplant that looked like rows of wheat and a wardrobe that was just a bit too young for him, Carl seemed to be an okay guy. But I reserve judgment on anyone Mom filters through her baleen. Now, as I drove up, Carl had a new mark against him, because he was making out with Mom on the porch—and I mean really making out, the way I should have been doing at around this time in my life. I was thankful we’d dropped Maggie and Russ off already so they didn’t have to witness the scene. “Now, that’s what I call a vomit ride,” I told Quinn as we pulled up the driveway. He snickered. No matter what disagreements we had, we were of one mind when it came to Mom and her boyfriends. As soon as we got out of the car, they stopped sucking face. Mom looked embarrassed at having been caught. “Hi, guys,” Carl said. He noticed the bear I held. “Looks like you came up a winner.” “Carl was just saying good-bye,” Mom said. “Really,” I said. “He must speak in tongues.” That got me a high five from Quinn. When we were done laughing, Mom raised her eyebrows and said, “Are you done having your joke at our expense?” Oh, please don’t try to sound parental now. “Yeah. Sorry.” “Good, because Carl and I have an announcement to make.” She took his hand, and I felt my gut beginning to collapse into a knot, because I knew what she was going to say. I knew because of the ring I saw on her hand. It was a diamond; and I had a feeling it was no cheap zircon, either, but the real thing. I clenched the arm of the misshapen bear tighter. “We’re engaged,” she said, and bounced up and down like a cheerleader. Her enthusiasm was met by our silence. “Well, aren’t you going to congratulate us?” Frankly I didn’t know what I felt: good, bad, or indifferent. The news hadn’t completely sunk in yet. But Quinn took it all in at once. First his ears went red, and the redness spread like a rash across his pinched face. “Well?” Mom prompted. “The last guy’s ring was bigger,” Quinn said, and tried to storm off into the house. Carl grabbed Quinn by the arm, and Quinn braced himself to be hit. It was a natural reflex after years of Mom’s boyfriends, who spoke in fists rather than in tongues. But Carl, to his credit, wasn’t like that. He only grabbed Quinn to get his attention, and he let go as soon as he had. “Hey,” he said, “I’ve got something for you, Quinn.” He held out a small jewelry box, flipping it open to reveal a tiny diamond ear stud. It was just like the one Carl himself wore. “I don’t want it.” “Take it, Quinn,” Mom said. It was an order. Carl cautiously took a step closer to Quinn. “Here, let me.” He removed the sputnik dangling from Quinn’s ear, replacing it with the diamond stud. “Sometimes one is enough, when it’s the right one.” Quinn grimaced like he was having a root canal. Finally Carl stepped back. The new stud was still one among three earrings in his ear, but it was definitely less in-your-face than the sputnik.","sourceLink":"https://allnovel.net/full-tilt/page-3.html","bookId":2591,"book":{"id":2591,"title":"Full Tilt","description":"Storyline: Sixteen-year-old Blake and his younger brother, Quinn, are exact opposites. Blake is the responsible member of the family. He constantly has to keep an eye on the fearless Quinn, whose thrill-seeking sometimes goes too far. But the stakes get higher when Blake has to chase Quinn into a bizarre phantom carnival that traps its customers forever. In order to escape, Blake must survive seven deadly rides by dawn, each of which represents a deep, personal fear -- from a carousel of stampeding animals to a hall of mirrors that changes people into their deformed reflections. Blake ultimately has to face up to a horrible secret from his own past to save himself and his brother -- that is, if the carnival doesn\u0027t claim their souls first!","cover":"https://allnovel.net/images/full-tilt.jpg","author":"Neal Shusterman","type":"Horror","source":"allnovel","link":"https://allnovel.net/full-tilt.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:14:46 PM"}}
