{"id":21712,"no":6,"title":"CHAPTER VI BEALBY AND THE TRAMP","content":"§ 1 Bealby was loth to leave the caravan party even when by his own gross negligence it had ceased to be a caravan party. He made off regretfully along the crest of the hills through bushes of yew and box until the clamour of the disaster was no longer in his ears. Then he halted for a time and stood sorrowing and listening and then turned up by a fence along the border of a plantation and so came into a little overhung road. His ideas of his immediate future were vague in the extreme. He was a receptive expectation. Since his departure from the gardener’s cottage circumstances had handed him on. They had been interesting but unstable circumstances. He supposed they would still hand him on. So far as he had any definite view about his intentions it was that he was running away to sea. And that he was getting hungry. It was also, he presently discovered, getting dark very gently and steadily. And the overhung road after some tortuosities expired suddenly upon the bosom of a great grey empty common with distant mysterious hedges. 191It seemed high time to Bealby that something happened of a comforting nature. Always hitherto something or someone had come to his help when the world grew dark and cold, and given him supper and put him or sent him to bed. Even when he had passed a night in the interstices of Shonts he had known there was a bed at quite a little distance under the stairs. If only that loud Voice hadn’t shouted curses whenever he moved he would have gone to it. But as he went across this common in the gloaming it became apparent that this amiable routine was to be broken. For the first time he realized the world could be a homeless world. And it had become very still. Disagreeably still, and full of ambiguous shadows. That common was not only an unsheltered place, he felt, but an unfriendly place, and he hurried to a gate at the further end. He kept glancing to the right and to the left. It would be pleasanter when he had got through that gate and shut it after him. In England there are no grey wolves. Yet at times one thinks of wolves, grey wolves, the colour of twilight and running noiselessly, almost noiselessly, at the side of their prey for quite a long time before they close in on it. In England, I say, there are no grey wolves. Wolves were extinguished in the reign of Edward the Third; it was in the histories, and since then no free wolf has trod the soil of England; only menagerie captives. 192Of course there may be escaped wolves! Now the gate!—sharp through it and slam it behind you, and a little brisk run and so into this plantation that slopes down hill. This is a sort of path; vague, but it must be a path. Let us hope it is a path. What was that among the trees? It stopped, surely it stopped, as Bealby stopped. Pump, pump—. Of course! that was one’s heart. Nothing there! Just fancy. Wolves live in the open; they do not come into woods like this. And besides, there are no wolves. And if one shouts—even if it is but a phantom voice one produces, they go away. They are cowardly things—really. Such as there aren’t. And there is the power of the human eye. Which is why they stalk you and watch you and evade you when you look and creep and creep and creep behind you! Turn sharply. Nothing. How this stuff rustled under the feet! In woods at twilight, with innumerable things darting from trees and eyes watching you everywhere, it would be pleasanter if one could walk without making quite such a row. Presently, surely, Bealby told himself, he would come out on a high road and meet other people and say “good-night” as they passed. Jolly other people they would be, answering, “Good-night.” He was now going at a moistening trot. It was getting darker and he stumbled against things. 193When you tumble down wolves leap. Not of course that there are any wolves. It was stupid to keep thinking of wolves in this way. Think of something else. Think of things beginning with a B. Beautiful things, boys, beads, butterflies, bears. The mind stuck at bears. Are there such things as long grey bears? Ugh! Almost endless, noiseless bears?... It grew darker until at last the trees were black. The night was swallowing up the flying Bealby and he had a preposterous persuasion that it had teeth and would begin at the back of his legs.... § 2 “Hi!” cried Bealby weakly, hailing the glow of the fire out of the darkness of the woods above. The man by the fire peered at the sound; he had been listening to the stumbling footsteps for some time, and he answered nothing. In another minute Bealby had struggled through the hedge into the visible world and stood regarding the man by the fire. The phantom wolves had fled beyond Sirius. But Bealby’s face was pale still from the terrors of the pursuit and altogether he looked a smallish sort of small boy. “Lost?” said the man by the fire. “Couldn’t find my way,” said Bealby. “Anyone with you?” “No.” The man reflected. “Tired?” “Bit.” 194“Come and sit down by the fire and rest yourself. “I won’t ’urt you,” he added as Bealby hesitated. So far in his limited experience Bealby had never seen a human countenance lit from behind by a flickering red flame. The effect he found remarkable rather than pleasing. It gave this stranger the most active and unstable countenance Bealby had ever seen. The nose seemed to be in active oscillation between pug and Roman, the eyes jumped out of black caves and then went back into them, the more permanent features appeared to be a vast triangle of neck and chin. The tramp would have impressed Bealby as altogether inhuman if it had not been for the smell of cooking he diffused. There were onions in it and turnips and pepper—mouth-watering constituents, testimonials to virtue. He was making a stew in an old can that he had slung on a cross stick over a brisk fire of twigs that he was constantly replenishing. “I won’t ’urt you, darn you,” he repeated. “Come and sit down on these leaves here for a bit and tell me all abart it.” Bealby did as he was desired. “I got lost,” he said, feeling too exhausted to tell a good story. The tramp, examined more closely, became less pyrotechnic. He had a large loose mouth, a confused massive nose, much long fair hair, a broad chin with a promising beard and spots—a lot of spots. His eyes looked out of deep sockets and they were sharp little eyes. He was a lean 195man. His hands were large and long and they kept on with the feeding of the fire as he sat and talked to Bealby. Once or twice he leant forward and smelt the pot judiciously, but all the time the little eyes watched Bealby very closely. “Lose yer collar?” said the tramp. Bealby felt for his collar. “I took it orf,” he said. “Come far?” “Over there,” said Bealby. “Where?” “Over there.” “What place?” “Don’t know the name of it.” “Then it ain’t your ’ome?” “No.” “You’ve run away,” said the man. “Pr’aps I ’ave,” said Bealby. “Pr’aps you ’ave! Why pr’aps? You ’ave! What’s the good of telling lies abart it? When’d you start?” “Monday,” said Bealby. The tramp reflected. “Had abart enough of it?” “Dunno,” said Bealby truthfully. “Like some soup?” “Yes.” “’Ow much?” “I could do with a lot,” said Bealby. “Ah yah! I didn’t mean that. I meant, ’ow much for some? ’Ow much will you pay for a nice, nice ’arf can of soup? I ain’t a darn charity. See?” 196“Tuppence,” said Bealby. The tramp shook his head slowly from side to side and took out the battered iron spoon he was using to stir the stuff and tasted the soup lusciously. It was—jolly good soup and there were potatoes in it. “Thrippence,” said Bealby. “’Ow much you got?” asked the tramp. Bealby hesitated perceptibly. “Sixpence,” he said weakly. “It’s sixpence,” said the tramp. “Pay up.” “’Ow big a can?” asked Bealby. The tramp felt about in the darkness behind him and produced an empty can with a jagged mouth that had once contained, the label witnessed—I quote, I do not justify—‘Deep Sea Salmon.’ “That,” he said, “and this chunk of bread.... Right enough?” “You will do it?” said Bealby. “Do I look a swindle?” cried the tramp, and suddenly a lump of the abundant hair fell over one eye in a singularly threatening manner. Bealby handed over the sixpence without further discussion. “I’ll treat you fairly, you see,” said the tramp, after he had spat on and pocketed the sixpence, and he did as much. He decided that the soup was ready to be served and he served it with care. Bealby began at once. “There’s a nextry onion,” said the tramp, throwing one over. “It didn’t cost me much and I gives it you for nothin’. That’s all right, eh? Here’s ’ealth!” Bealby consumed his soup and bread meekly with one eye upon his host. He would, he decided, 197eat all he could and then sit a little while, and then get this tramp to tell him the way to—anywhere else. And the tramp wiped soup out of his can with gobbets of bread very earnestly and meditated sagely on Bealby. “You better pal in with me, matey, for a bit,” he said at last. “You can’t go nowhere else—not to-night.” “Couldn’t I walk perhaps to a town or sumpthing?” “These woods ain’t safe.” “’Ow d’you mean?” “Ever ’eard tell of a gurrillia?—sort of big black monkey thing.” “Yes,” said Bealby faintly. “There’s been one loose abart ’ere—oh week or more. Fact. And if you wasn’t a grown up man quite and going along in the dark, well—’e might say something to you.... Of course ’e wouldn’t do nothing where there was a fire or a man—but a little chap like you. I wouldn’t like to let you do it, ’strewth I wouldn’t. It’s risky. Course I don’t want to keep you. There it is. You go if you like. But I’d rather you didn’t. ’Onest.” “Where’d he come from?” asked Bealby. “M’nagery,” said the tramp. “’E very near bit through the fist of a chap that tried to stop ’im,” said the tramp. Bealby after weighing tramp and gorilla very carefully in his mind decided he wouldn’t and drew closer to the fire—but not too close—and the conversation deepened. 198 § 3 It was a long and rambling conversation and the tramp displayed himself at times as quite an amiable person. It was a discourse varied by interrogations, and as a thread of departure and return it dealt with the life of the road and with life at large and—life, and with matters of ‘must’ and ‘may.’ Sometimes and more particularly at first Bealby felt as though a ferocious beast lurked in the tramp and peeped out through the fallen hank of hair and might leap out upon him, and sometimes he felt the tramp was large and fine and gay and amusing, more particularly when he lifted his voice and his bristling chin. And ever and again the talker became a nasty creature and a disgusting creature, and his red-lit face was an ugly creeping approach that made Bealby recoil. And then again he was strong and wise. So the unstable needle of a boy’s moral compass spins. The tramp used strange terms. He spoke of the ‘deputy’ and the ‘doss-house,’ of the ‘spike’ and ‘padding the hoof,’ of ‘screevers’ and ‘tarts’ and ‘copper’s narks.’ To these words Bealby attached such meanings as he could, and so the things of which the tramp talked floated unsurely into his mind and again and again he had to readjust and revise his interpretations. And through these dim and fluctuating veils a new side of life dawned upon his consciousness, a side that was strange and lawless and dirty—in every way dirty—and dreadful and—attractive. That 199was the queer thing about it, that attraction. It had humour. For all its squalor and repulsiveness it was lit by defiance and laughter, bitter laughter perhaps, but laughter. It had a gaiety that Mr. Mergleson for example did not possess, it had a penetration, like the penetrating quality of onions or acids or asaf?tida, that made the memory of Mr. Darling insipid. The tramp assumed from the outset that Bealby had ‘done something’ and run away, and some mysterious etiquette prevented his asking directly what was the nature of his offence. But he made a number of insidious soundings. And he assumed that Bealby was taking to the life of the road and that, until good cause to the contrary appeared, they were to remain together. “It’s a tough life,” he said, “but it has its points, and you got a toughish look about you.” He talked of roads and the quality of roads and countryside. This was a good countryside; it wasn’t overdone and there was no great hostility to wanderers and sleeping out. Some roads—the London to Brighton for example, if a chap struck a match, somebody came running. But here unless you went pulling the haystacks about too much they left you alone. And they weren’t such dead nuts on their pheasants, and one had a chance of an empty cowshed. “If I’ve spotted a shed or anything with a roof to it I stay out,” said the tramp, “even if it’s raining cats and dogs. Otherwise it’s the doss-’ouse or the ‘spike.’ It’s the rain is the worst thing—getting wet. You haven’t been wet yet, not if you only started 200Monday. Wet—with a chilly wind to drive it. Gaw! I been blown out of a holly hedge. You would think there’d be protection in a holly hedge.... “Spike’s the last thing,” said the tramp. “I’d rather go bare-gutted to a doss-’ouse anywhen. Gaw!—you’ve not ’ad your first taste of the spike yet.” But it wasn’t heaven in the doss-houses. He spoke of several of the landladies in strange but it would seem unflattering terms. “And there’s always such a blamed lot of washing going on in a doss-’ouse. Always washing they are! One chap’s washing ’is socks and another’s washing ’is shirt. Making a steam drying it. Disgustin’. Carn’t see what they want with it all. Barnd to git dirty again....” He discoursed of spikes, that is to say of work-houses, and of masters. “And then,” he said, with revolting yet alluring adjectives, “there’s the bath.” “That’s the worst side of it,” said the tramp.... “’Owever, it doesn’t always rain, and if it doesn’t rain, well, you can keep yourself dry.” He came back to the pleasanter aspects of the nomadic life. He was all for the outdoor style. “Ain’t we comfortable ’ere?” he asked. He sketched out the simple larcenies that had contributed and given zest to the evening’s meal. But it seemed there were also doss-houses that had the agreeable side. “Never been in one!” he said. “But where you been sleeping since Monday?” 201Bealby described the caravan in phrases that seemed suddenly thin and an?mic to his ears. “You hit it lucky,” said the tramp. “If a chap’s a kid he strikes all sorts of luck of that sort. Now ef I come up against three ladies travellin’ in a van—think they’d arst me in? Not it!” He dwelt with manifest envy on the situation and the possibilities of the situation for some time. “You ain’t dangerous,” he said; “that’s where you get in....” He consoled himself by anecdotes of remarkable good fortunes of a kindred description. Apparently he sometimes travelled in the company of a lady named Izzy Berners—“a fair scorcher, been a regular, slap-up circus actress.” And there was also “good old Susan.” It was a little difficult for Bealby to see the point of some of these flashes by a tendency on the part of the tramp while his thoughts turned on these matters to adopt a staccato style of speech, punctuated by brief, darkly significant guffaws. There grew in the mind of Bealby a vision of the doss-house as a large crowded place, lit by a great central fire, with much cooking afoot and much jawing and disputing going on, and then “me and Izzy sailed in....” The fire sank, the darkness of the woods seemed to creep nearer. The moonlight pierced the trees only in long beams that seemed to point steadfastly at unseen things, it made patches of ashen light that looked like watching faces. Under the tramp’s direction Bealby skirmished round and got sticks and fed the fire until the 202darkness and thoughts of a possible gorilla were driven back for some yards and the tramp pronounced the blaze a “fair treat.” He had made a kind of bed of leaves which he now invited Bealby to extend and share, and lying feet to the fire he continued his discourse. He talked of stealing and cheating by various endearing names; he made these enterprises seem adventurous and facetious; there was it seemed a peculiar sort of happy find one came upon called a “flat,” that it was not only entertaining but obligatory to swindle. He made fraud seem so smart and bright at times that Bealby found it difficult to keep a firm grasp on the fact that it was—fraud.... Bealby lay upon the leaves close up to the prone body of the tramp, and his mind and his standards became confused. The tramp’s body was a dark but protecting ridge on one side of him; he could not see the fire beyond his toes but its flickerings were reflected by the tree stems about them, and made perplexing sudden movements that at times caught his attention and made him raise his head to watch them.... Against the terrors of the night the tramp had become humanity, the species, the moral basis. His voice was full of consolation; his topics made one forget the watchful silent circumambient. Bealby’s first distrusts faded. He began to think the tramp a fine, brotherly, generous fellow. He was also growing accustomed to a faint something—shall I call it an olfactory bar—that had hitherto kept them apart. The monologue 203ceased to devote itself to the elucidation of Bealby; the tramp was lying on his back with his fingers interlaced beneath his head and talking not so much to his companion as to the stars and the universe at large. His theme was no longer the wandering life simply but the wandering life as he had led it, and the spiritedness with which he had led it and the real and admirable quality of himself. It was that soliloquy of consolation which is the secret preservative of innumerable lives. He wanted to make it perfectly clear that he was a tramp by choice. He also wanted to make it clear that he was a tramp and no better because of the wicked folly of those he had trusted and the evil devices of enemies. In the world that contained those figures of spirit; Isopel Berners and Susan, there was also it seemed a bad and spiritless person, the tramp’s wife, who had done him many passive injuries. It was clear she did not appreciate her blessings. She had been much to blame. “Anybody’s opinion is better than ’er ’usband’s,” said the tramp. “Always ’as been.” Bealby had a sudden memory of Mr. Darling saying exactly the same thing of his mother. “She’s the sort,” said the tramp, “what would rather go to a meetin’ than a music ’all. She’d rather drop a shilling down a crack than spend it on anything decent. If there was a choice of jobs going she’d ask which ’ad the lowest pay and the longest hours and she’d choose that. She’d feel safer. She was born scared. When there wasn’t anything else to do she’d stop at ’ome and scrub the floors. Gaw! it made a chap 204want to put the darn’ pail over ’er ’ed, so’s she’d get enough of it.... “I don’t hold with all this crawling through life and saying Please,” said the tramp. “I say it’s my world just as much as it’s your world. You may have your ’orses and carriages, your ’ouses and country places and all that and you may think Gawd sent me to run abart and work for you; but I don’t. See?” Bealby saw. “I seek my satisfactions just as you seek your satisfactions, and if you want to get me to work you’ve jolly well got to make me. I don’t choose to work. I choose to keep on my own and a bit loose and take my chance where I find it. You got to take your chances in this world. Sometimes they come bad and sometimes they come good. And very often you can’t tell which it is when they ’ave come....” Then he fell questioning Bealby again and then he talked of the immediate future. He was beating for the seaside. “Always something doing,” he said. “You got to keep your eye on for cops; those seaside benches, they’re ’ot on tramps—give you a month for begging soon as look at you—but there’s flats dropping sixpences thick as flies on a sore ’orse. You want a there for all sorts of jobs. You’re just the chap for it, matey. Saw it soon’s ever I set eyes on you....” He made projects.... Finally he became more personal and very flattering. 205“Now you and me,” he said, suddenly shifting himself quite close to Bealby, “we’re going to be downright pals. I’ve took a liking to you. Me and you are going to pal together. See?” He breathed into Bealby’s face, and laid a hand on his knee and squeezed it, and Bealby, on the whole, felt honoured by his protection.... § 4 In the unsympathetic light of a bright and pushful morning the tramp was shorn of much of his overnight glamour. It became manifest that he was not merely offensively unshaven, but extravagantly dirty. It was not ordinary rural dirt. During the last few days he must have had dealings of an intimate nature with coal. He was taciturn and irritable, he declared that this sleeping out would be the death of him and the breakfast was only too manifestly wanting in the comforts of a refined home. He seemed a little less embittered after breakfast, he became even faintly genial, but he remained unpleasing. A distaste for the tramp arose in Bealby’s mind and as he walked on behind his guide and friend, he revolved schemes of unobtrusive detachment. Far be it from me to accuse Bealby of ingratitude. But it is true that that same disinclination which made him a disloyal assistant to Mr. Mergleson was now affecting his comradeship with the tramp. And he was deceitful. He allowed the tramp to build projects in the confidence of his continued adhesion, he did not warn 206him of the defection he meditated. But on the other hand Bealby had acquired from his mother an effective horror of stealing. And one must admit, since the tramp admitted it, that the man stole. And another little matter had at the same time estranged Bealby from the tramp and linked the two of them together. The attentive reader will know that Bealby had exactly two shillings and twopence-halfpenny when he came down out of the woods to the fireside. He had Mrs. Bowles’ half-crown and the balance of Madeleine Philips’ theatre shilling, minus sixpence halfpenny for a collar and sixpence he had given the tramp for the soup overnight. But all this balance was now in the pocket of the tramp. Money talks and the tramp had heard it. He had not taken it away from Bealby, but he had obtained it in this manner: “We two are pals,” he said, “and one of us had better be Treasurer. That’s Me. I know the ropes better. So hand over what you got there, matey.” And after he had pointed out that a refusal might lead to Bealby’s evisceration the transfer occurred. Bealby was searched, kindly but firmly.... It seemed to the tramp that this trouble had now blown over completely. Little did he suspect the rebellious and treacherous thoughts that seethed in the head of his companion. Little did he suppose that his personal appearance, his manners, his ethical flavour—nay, even his physical flavour—were being 207judged in a spirit entirely unamiable. It seemed to him that he had obtained youthful and subservient companionship, companionship that would be equally agreeable and useful; he had adopted a course that he imagined would cement the ties between them; he reckoned not with ingratitude. “If anyone arsts you who I am, call me uncle,” he said. He walked along, a little in advance, sticking his toes out right and left in a peculiar wide pace that characterized his walk, and revolving schemes for the happiness and profit of the day. To begin with—great draughts of beer. Then tobacco. Later perhaps a little bread and cheese for Bealby. “You can’t come in ’ere,” he said at the first public house. “You’re under age, me boy. It ain’t my doing, matey; it’s ’Erbert Samuel. You blame ’im. ’E don’t objec’ to you going to work for any other Mr. Samuel there may ’appen to be abart or anything of that sort, that’s good for you, that is; but ’e’s most particular you shouldn’t go into a public ’ouse. So you just wait abart outside ’ere. I’ll ’ave my eye on you.” “You going to spend my money?” asked Bealby. “I’m going to ration the party,” said the tramp. “You—you got no right to spend my money,” said Bealby. “I—’Ang it!—I’ll get you some acid drops,” said the tramp in tones of remonstrance. “I tell you, blame you,—it’s ‘Erbert Samuel.’ I can’t ’elp it! I can’t fight against the lor.” 208“You haven’t any right to spend my money,” said Bealby. “Downt cut up crusty. ’Ow can I ’elp it?” “I’ll tell a policeman. You gimme back my money and lemme go.” The tramp considered the social atmosphere. It did not contain a policeman. It contained nothing but a peaceful kindly corner public house, a sleeping dog and the back of an elderly man digging. The tramp approached Bealby in a confidential manner. “’Oo’s going to believe you?” he said. “And besides, ’ow did you come by it? “Moreover, I ain’t going to spend your money. I got money of my own. ’Ere! See?” And suddenly before the dazzled eyes of Bealby he held and instantly withdrew three shillings and two coppers that seemed familiar. He had had a shilling of his own.... Bealby waited outside.... The tramp emerged in a highly genial mood, with acid drops, and a short clay pipe going strong. “’Ere,” he said to Bealby with just the faintest flavour of magnificence over the teeth-held pipe and handed over not only the acid drops but a virgin short clay. “Fill,” he said, proffering the tobacco. “It’s yours jus’ much as it’s mine. Be’r not let ’Erbert Samuel see you, though; that’s all. ’E’s got a lor abart it.” Bealby held his pipe in his clenched hand. He had already smoked—once. He remembered it quite vividly still, although it had happened six months ago. Yet he hated not using that tobacco. “No,” he said, “I’ll smoke later.” 209The tramp replaced the screw of red Virginia in his pocket with the air of one who has done the gentlemanly thing.... They went on their way, an ill-assorted couple. All day Bealby chafed at the tie and saw the security in the tramp’s pocket vanish. They lunched on bread and cheese and then the tramp had a good sustaining drink of beer for both of them and after that they came to a common where it seemed agreeable to repose. And after a due meed of repose in a secluded hollow among the gorse the tramp produced a pack of exceedingly greasy cards and taught Bealby to play Euchre. Apparently the tramp had no distinctive pockets in his tail coat, the whole lining was one capacious pocket. Various knobs and bulges indicated his cooking tin, his feeding tin, a turnip and other unknown properties. At first they played for love and then they played for the balance in the tramp’s pocket. And by the time Bealby had learnt Euchre thoroughly, that balance belonged to the tramp. But he was very generous about it and said they would go on sharing just as they had done. And then he became confidential. He scratched about in the bagginess of his garment and drew out a little dark blade of stuff, like a flint implement, regarded it gravely for a moment and held it out to Bealby. “Guess what this is.” Bealby gave it up. “Smell it.” It smelt very nasty. One familiar smell indeed there was with a paradoxical sanitary quality 210that he did not quite identify, but that was a mere basis for a complex reek of acquisitions. “What is it?” said Bealby. “Soap!” “But what’s it for?” “I thought you’d arst that.... What’s soap usually for?” “Washing,” said Bealby guessing wildly. The tramp shook his head. “Making a foam,” he corrected. “That’s what I has my fits with. See? I shoves a bit in my mouth and down I goes and I rolls about. Making a sort of moaning sound. Why, I been given brandy often—neat brandy.... It isn’t always a cert—nothing’s absolutely a cert. I’ve ’ad some let-downs.... Once I was bit by a nasty little dog—that brought me to pretty quick—and once I ’ad an old gentleman go through my pockets. ‘Poor chap!’ ’e ses, ‘very likely ’e’s destitoot, let’s see if ’e’s got anything.’... I’d got all sorts of things, I didn’t want ’im prying about. But I didn’t come?to sharp enough to stop ’im. Got me into trouble that did.... “It’s an old lay,” said the tramp, “but it’s astonishing ’ow it’ll go in a quiet village. Sort of amuses ’em. Or dropping suddenly in front of a bicycle party. Lot of them old tricks are the best tricks, and there ain’t many of ’em Billy Bridget don’t know. That’s where you’re lucky to ’ave met me, matey. Billy Bridget’s a ’ard man to starve. And I know the ropes. I know what you can do and what you can’t do. And I got a feeling for a policeman—same as some 211people ’ave for cats. I’d know if one was ’idden in the room....” He expanded into anecdotes and the story of various encounters in which he shone. It was amusing and it took Bealby on his weak side. Wasn’t he the Champion Dodger of the Chelsome playground? The tide of talk ebbed. “Well,” said the tramp, “time we was up and doing....” They went along shady lanes and across an open park and they skirted a breezy common from which they could see the sea. And among other things that the tramp said was this, “Time we began to forage a bit.” He turned his large observant nose to the right of him and the left. § 5 Throughout the afternoon the tramp discoursed upon the rights and wrongs of property, in a way that Bealby found very novel and unsettling. The tramp seemed to have his ideas about owning and stealing arranged quite differently from those of Bealby. Never before had Bealby thought it possible to have them arranged in any other than the way he knew. But the tramp contrived to make most possession seem unrighteous and honesty a code devised by those who have for those who haven’t. “They’ve just got ’old of it,” he said. “They want to keep it to themselves.... Do I look as though I’d stole much of anybody’s? It isn’t me got ’old of this land and sticking up my notice boards to keep everybody 212off. It isn’t me spends my days and nights scheming ’ow I can get ’old of more and more of the stuff.... “I don’t envy it ’em,” said the tramp. “Some ’as one taste and some another. But when it comes to making all this fuss because a chap who isn’t a schemer ’elps ’imself to a m?thful,—well, it’s Rot.... “It’s them makes the rules of the game and nobody ever arst me to play it. I don’t blame ’em, mind you. Me and you might very well do the same. But brast me if I see where the sense of my keeping the rules comes in. This world ought to be a share out, Gawd meant it to be a share out. And me and you—we been done out of our share. That justifies us.” “It isn’t right to steal,” said Bealby. “It isn’t right to steal—certainly. It isn’t right—but it’s universal. Here’s a chap here over this fence, ask ’im where ’e got ’is land. Stealing! What you call stealing, matey, I call restitootion. You ain’t probably never even ’eard of socialism.” “I’ve ’eard of socialists right enough. Don’t believe in Gawd and ’aven’t no morality.” “Don’t you believe it. Why!—’Arf the socialists are parsons. What I’m saying is socialism—practically. I’m a socialist. I know all abart socialism. There isn’t nothing you can tell me abart socialism. Why!—for three weeks I was one of these here Anti-Socialist speakers. Paid for it. And I tell you there ain’t such a thing as property left; it’s all a blooming old pinch. Lords, commons, judges, all of them, they’re 213just a crew of brasted old fences and the lawyers getting in the stuff. Then you talk to me of stealing! Stealing!” The tramp’s contempt and his intense way of saying ‘stealing’ were very unsettling to a sensitive mind. They bought some tea and grease in a village shop and the tramp made tea in his old tin with great dexterity and then they gnawed bread on which two ounces of margarine had been generously distributed. “Live like fighting cocks, we do,” said the tramp wiping out his simple cuisine with the dragged-out end of his shirt sleeve. “And if I’m not very much mistaken we’ll sleep to-night on a nice bit of hay....” But these anticipations were upset by a sudden temptation, and instead of a starry summer comfort the two were destined to spend a night of suffering and remorse. A green lane lured them off the road, and after some windings led them past a field of wire-netted enclosures containing a number of perfect and conceited-looking hens close beside a little cottage, a vegetable garden and some new elaborate outhouses. It was manifestly a poultry farm, and something about it gave the tramp the conviction that it had been left, that nobody was at home. These realizations are instinctive, they leap to the mind. He knew it, and an ambition to know further what was in the cottage came with the knowledge. But it seemed to him desirable that the work of exploration should be done by 214Bealby. He had thought of dogs, and it seemed to him that Bealby might be unembarrassed by that idea. So he put the thing to Bealby. “Let’s have a look round ere,” he said. “You go in and see what’s abart....” There was some difference of opinion. “I don’t ask you to take anything,” said the tramp.... “Nobody won’t catch you.... I tell you nobody won’t catch you.... I tell you there ain’t nobody here to catch you.... Just for the fun of seeing in. I’ll go up by them outhouses. And I’ll see nobody comes.... Ain’t afraid to go up a garden path, are you?... I tell you, I don’t want you to steal.... You ain’t got much guts to funk a thing like that.... I’ll be ab?t too.... Thought you’d be the very chap for a bit of scarting.... Thought Boy Scarts was all the go nowadays.... Well, if you ain’t afraid you’d do it.... Well, why didn’t you say you’d do it at the beginning?...” Bealby went through the hedge and up a grass track between poultry runs, made a cautious inspection of the outhouses and then approached the cottage. Everything was still. He thought it more plausible to go to the door than peep into the window. He rapped. Then after an interval of stillness he lifted the latch, opened the door and peered into the room. It was a pleasantly furnished room, and before the empty summer fireplace a very old white man was sitting in a chintz-covered arm-chair, lost it would seem in painful thought. He had a peculiar grey shrunken look, his eyes were closed, a bony 215hand with the shiny texture of alabaster gripped the chair arm.... There was something about him that held Bealby quite still for a moment. And this old gentleman behaved very oddly. His body seemed to crumple into his chair, his hands slipped down from the arms, his head nodded forwards and his mouth and eyes seemed to open together. And he made a snoring sound.... For a moment Bealby remained rigidly agape and then a violent desire to rejoin the tramp carried him back through the hen runs.... He tried to describe what he had seen. “Asleep with his mouth open,” said the tramp. “Well, that ain’t anything so wonderful! You got anything? That’s what I want to know.... Did anyone ever see such a boy? ’Ere! I’ll go.... “You keep a look out here,” said the tramp. But there was something about that old man in there, something so strange and alien to Bealby, that he could not remain alone in the falling twilight. He followed the cautious advances of the tramp towards the house. From the corner by the outhouses he saw the tramp go and peer in at the open door. He remained for some time peering, his head hidden from Bealby.... Then he went in.... Bealby had an extraordinary desire that somebody else would come. His soul cried out for help against some vaguely apprehended terror. And in the very moment of his wish came its fulfilment. He saw advancing up the garden 216path a tall woman in a blue serge dress, hatless and hurrying and carrying a little package—it was medicine—in her hand. And with her came a big black dog. At the sight of Bealby the dog came forward barking and Bealby after a moment’s hesitation turned and fled. The dog was quick. But Bealby was quicker. He went up the netting of a hen run and gave the dog no more than an ineffectual snap at his heels. And then dashing from the cottage door came the tramp. Under one arm was a brass-bound workbox and in the other was a candlestick and some smaller articles. He did not instantly grasp the situation of his treed companion, he was too anxious to escape the tall woman, and then with a yelp of dismay he discovered himself between woman and dog. All too late he sought to emulate Bealby. The workbox slipped from under his arm, the rest of his plunder fell from him, for an uneasy moment he was clinging to the side of the swaying hen run and then it had caved in and the dog had got him. The dog bit, desisted and then finding itself confronted by two men retreated. Bealby and the tramp rolled and scrambled over the other side of the collapsed netting into a parallel track and were halfway to the hedge before the dog,—but this time in a less vehement fashion,—resumed his attack. He did not close with them again and at the hedge he halted altogether and remained hacking the gloaming with his rage. The woman it seemed had gone into the house, 217leaving the tramp’s scattered loot upon the field of battle. “This means mizzle,” said the tramp, leading the way at a trot. Bealby saw no other course but to follow. He had a feeling as though the world had turned against him. He did not dare to think what he was nevertheless thinking of the events of these crowded ten minutes. He felt he had touched something dreadful; that the twilight was full of accusations.... He feared and hated the tramp now, but he perceived something had linked them as they had not been linked before. Whatever it was they shared it. § 6 They fled through the night; it seemed to Bealby for interminable hours. At last when they were worn out and footsore they crept through a gate and found an uncomfortable cowering place in the corner of a field. As they went they talked but little, but the tramp kept up a constant muttering to himself. He was troubled by the thought of hydrophobia. “I know I’ll ’ave it,” he said, “I know I’ll get it.” Bealby after a time ceased to listen to his companion. His mind was preoccupied. He could think of nothing but that very white man in the chair and the strange manner of his movement. “Was ’e awake when you saw ’im?” he asked at last. 218“Awake—who?” “That old man.” For a moment or so the tramp said nothing. “’E wasn’t awake, you young silly,” he said at last. “But—wasn’t he?” “Why!—don’t you know! ’E’d croaked,—popped off the ’ooks—very moment you saw ’im.” For a moment Bealby’s voice failed him. Then he said quite faintly, “You mean—he’d —. Was dead?” “Didn’t you know?” said the tramp. “Gaw! What a kid you are!” In that manner it was Bealby first saw a dead man. Never before had he seen anyone dead. And after that for all the night the old white man pursued him, with strange slowly-opening eyes, and a head on one side and his mouth suddenly and absurdly agape.... All night long that white figure presided over seas of dark dismay. It seemed always to be there, and yet Bealby thought of a score of other painful things. For the first time in his life he asked himself, “Where am I going? What am I drifting to?” The world beneath the old man’s dominance was a world of prisons. Bealby believed he was a burglar and behind the darkness he imagined the outraged law already seeking him. And the terrors of his associate reinforced his own. He tried to think what he should do in the morning. He dreaded the dawn profoundly. But he 219could not collect his thoughts because of the tramp’s incessant lapses into grumbling lamentation. Bealby knew he had to get away from the tramp, but now he was too weary and alarmed to think of running away as a possible expedient. And besides there was the matter of his money. And beyond the range of the tramp’s voice there were darknesses which to-night at least might hold inconceivable forms of lurking evil. But could he not appeal to the law to save him? Repent? Was there not something called turning King’s Evidence? The moon was no comfort that night. Across it there passed with incredible slowness a number of jagged little black clouds, blacker than any clouds Bealby had ever seen before. They were like velvet palls, lined with snowy fur. There was no end to them. And one at last most horribly gaped slowly and opened a mouth.... § 7 At intervals there would be uncomfortable movements and the voice of the tramp came out of the darkness beside Bealby lamenting his approaching fate and discoursing—sometimes with violent expressions—on watch-dogs. “I know I shall ’ave ’idrophobia,” said the tramp. “I’ve always ’ad a disposition to ’idrophobia. Always a dread of water—and now it’s got me. “Think of it!—keeping a beast to set at a ’uman being. Where’s the brotherhood of it? 220Where’s the law and the humanity? Getting a animal to set at a brother man. And a poisoned animal, a animal with death in his teeth. And a ’orrible death too. Where’s the sense and brotherhood? “Gaw! when I felt ’is teeth coming through my tr?sers—! “Dogs oughtn’t to be allowed. They’re a noosance in the towns and a danger in the country. They oughtn’t to be allowed anywhere—not till every blessed ’uman being ’as got three square meals a day. Then if you like, keep a dog. And see ’e’s a clean dog.... “Gaw! if I’d been a bit quicker up that ’en roost—! “I ought to ’ave landed ’im a kick. “It’s a man’s duty to ’urt a dog. When ’e sees a dog ’e ought to ’urt ’im. It’s a natural ’atred. If dogs were what they ought to be, if dogs understood ’ow they’re situated, there wouldn’t be a dog go for a man ever. “And if one did they’d shoot ’im.... “After this if ever I get a chance to land a dog a oner with a stone I’ll land ’im one. I been too sorft with dogs....” Towards dawn Bealby slept uneasily, to be awakened by the loud snorting curiosity of three lively young horses. He sat up in a blinding sunshine and saw the tramp looking very filthy and contorted, sleeping with his mouth wide open and an expression of dismay and despair on his face. 221 § 8 Bealby took his chance to steal away next morning while the tramp was engaged in artificial epilepsy. “I feel like fits this morning,” said the tramp. “I could do it well. I want a bit of human kindness again. After that brasted dog. “I expect soon I’ll ’ave the foam all right withat any soap.” They marked down a little cottage before which a benevolent-looking spectacled old gentleman in a large straw hat and a thin alpaca jacket was engaged in budding roses. Then they retired to prepare. The tramp handed over to Bealby various compromising possessions, which might embarrass an afflicted person under the searching hands of charity. There was for example the piece of soap after he had taken sufficient for his immediate needs, there was ninepence in money, there were the pack of cards with which they had played Euchre, a key or so and some wires, much assorted string, three tins, a large piece of bread, the end of a composite candle, a box of sulphur matches, list slippers, a pair of gloves, a clasp knife, sundry grey rags. They all seemed to have the distinctive flavour of the tramp.... “If you do a bunk with these,” said the tramp. “By Gawd—.” He drew his finger across his throat. (King’s Evidence.) Bealby from a safe distance watched the beginnings of the fit and it impressed him as a 222thoroughly nasty kind of fit. He saw the elderly gentleman hurry out of the cottage and stand for a moment looking over his little green garden gate, surveying the sufferings of the tramp with an expression of intense yet discreet commiseration. Then suddenly he was struck by an idea; he darted in among his rose bushes and reappeared with a big watering-can and an enormous syringe. Still keeping the gate between himself and the sufferer he loaded his syringe very carefully and deliberately.... Bealby would have liked to have seen more but he felt his moment had come. Another instant and it might be gone again. Very softly he dropped from the gate on which he was sitting and made off like a running partridge along the hedge of the field. Just for a moment did he halt—at a strange sharp yelp that came from the direction of the little cottage. Then his purpose of flight resumed its control of him. He would strike across country for two or three miles, then make for the nearest police station and give himself up. (Loud voices. Was that the tramp murdering the benevolent old gentleman in the straw hat or was it the benevolent old gentleman in the straw hat murdering the tramp? No time to question. Onward, Onward!) The tramp’s cans rattled in his pocket. He drew one out, hesitated a moment and flung it away and then sent its two companions after it.... He found his police station upon the road between Someport and Crayminster, a little peaceful 223rural station, a mere sunny cottage with a blue and white label and a notice board covered with belated bills about the stealing of pheasants’ eggs. And another bill—. It was headed MISSING and the next most conspicuous words were ￡5 REWARD and the next ARTHUR BEALBY. He was fascinated. So swift, so terribly swift is the law. Already they knew of his burglary, of his callous participation in the robbing of a dead man. Already the sleuths were upon his trail. So surely did his conscience strike to this conclusion that even the carelessly worded offer of a reward that followed his description conveyed no different intimation to his mind. “To whomsoever will bring him back to Lady Laxton, at Shonts near Chelsmore,” so it ran. “And out of pocket expenses.” And even as Bealby read this terrible document, the door of the police station opened and a very big pink young policeman came out and stood regarding the world in a friendly, self-approving manner. He had innocent, happy, blue eyes; thus far he had had much to do with order and little with crime; and his rosebud mouth would have fallen open, had not discipline already closed it and set upon it the beginnings of a resolute expression that accorded ill with the rest of his open freshness. And when he had surveyed the sky and the distant hills and the little rose bushes that occupied the leisure of the force, his eyes fell upon Bealby.... Indecision has ruined more men than wickedness. 224And when one has slept rough and eaten nothing and one is conscious of a marred unclean appearance, it is hard to face one’s situations. What Bealby had intended to do was to go right up to a policeman and say to him, simply and frankly: “I want to turn King’s Evidence, please. I was in that burglary where there was a dead old man and a workbox and a woman and a dog. I was led astray by a bad character and I did not mean to do it. And really it was him that did it and not me.” But now his tongue clove to the roof of his mouth, he felt he could not speak, could not go through with it. His heart had gone down into his feet. Perhaps he had caught the tramp’s constitutional aversion to the police. He affected not to see the observant figure in the doorway. He assumed a slack careless bearing like one who reads by chance idly. He lifted his eyebrows to express unconcern. He pursed his mouth to whistle but no whistle came. He stuck his hands into his pockets, pulled up his feet as one pulls up plants by the roots and strolled away. He quickened his stroll as he supposed by imperceptible degrees. He glanced back and saw that the young policeman had come out of the station and was reading the notice. And as the young policeman read he looked ever and again at Bealby like one who checks off items. Bealby quickened his pace and then, doing his best to suggest by the movements of his back a more boyish levity quite unconnected with the law, he broke into a trot. 225Then presently he dropped back into a walking pace, pretended to see something in the hedge, stopped and took a sidelong look at the young policeman. He was coming along with earnest strides; every movement of his suggested a stealthy hurry! Bealby trotted and then becoming almost frank about it ran. He took to his heels. From the first it was not really an urgent chase; it was a stalking rather than a hunt, because the young policeman was too young and shy and lacking in confidence really to run after a boy without any definite warrant for doing so. When anyone came along he would drop into a smart walk and pretend not to be looking at Bealby but just going somewhere briskly. And after two miles of it he desisted, and stood for a time watching a heap of mangold wurzel directly and the disappearance of Bealby obliquely, and then when Bealby was quite out of sight he turned back thoughtfully towards his proper place. On the whole he considered he was well out of it. He might have made a fool of himself.... And yet,—five pounds reward!","sourceLink":"http://novel.tingroom.com/duanpian/3252/89101.html","bookId":602,"book":{"id":602,"title":"Bealby; A Holiday","description":"简介： The cat is the offspring of a cat and the dog of a dog, but butlers and ladys maids do not reproduce their kind. They have other duties.So their successors have to be sought among the prolific, and particularly among the prolific on great estates. Su...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3252","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
