{"id":80299,"no":2,"title":"Page 2","content":"“This will look perfect on you,” Natalie says holding up a thin, half-sleeve tight white shirt with Scars on Broadway written across the front. “It fits tight and your boobs are perfect.” She puts the shirt up against my chest and examines what I might look like in it.\\n\\n I snarl at her, not satisfied with her first pick.\\n\\n She rolls her eyes and her shoulders slump over. “Fine,” she says, tossing the shirt on the bed. She slides her hand in the closet and takes down another one, holding it up with a big smile that is at the same time a manipulation tactic of hers. Big toothy smiles equal me not wanting to crush her efforts.\\n\\n “How about something that doesn’t have some random band plastered across the front?” I say.\\n\\n “It’s Brandon Boyd,” she says, her eyes bugging out at me. “How can you not like Brandon Boyd?”\\n\\n “He’s alright,” I say. “I’m just not into advertising him on my chest.”\\n\\n “I’d like to actually have him on my chest,” she says, admiring the tight-fitting V-neck top made much like the first one she tried to show me.\\n\\n “Well then you wear it.”\\n\\n She looks across at me, nodding as if contemplating the idea. “I think I will.” She takes off the top she’s already wearing and tosses it in the laundry basket next to the closet and then slips Brandon Boyd’s face down over her huge boobs.\\n\\n “Looks good on you,” I say, watching her adjust herself and admiring what she sees in the mirror at several different angles.\\n\\n “Damn right he does,” she says.\\n\\n “How’s Jared Leto going to feel about this?” I joke.\\n\\n Natalie spats out a laugh and she tosses her long dark hair back and reaches for the hairbrush. “He’ll always be my number one.”\\n\\n “What about Damon, y’know, the non-imaginary boyfriend?”\\n\\n “Stop it,” she says, looking at me through the reflection in the mirror. “If you keep raggin’ on me about Damon like you do—.” She stops the brush mid-way in her hair and turns at the waist to face me. “Do you have a thing for Damon, or something?”\\n\\n My head springs back and I feel my eyebrows knot thickly in my forehead.\\n\\n “No, Nat! What the hell?”\\n\\n Natalie laughs and goes back to brushing her hair. “We’re going to find you a guy tonight. That’s what you need. It’ll fix everything.”\\n\\n My silence immediately tells her that she went too far. I hate it when she does this. Why does everybody have to be with somebody? It’s a stupid delusion and a really pathetic way of thinking.\\n\\n She places the brush back on the dresser and turns around fully, letting the jest disappear from her face and she sighs heavily. “I know I shouldn’t say that—look I swear I won’t pull any match-making stuff, alright?” She puts both of her hands up in surrender.\\n\\n “I believe you,” I say, giving in to her sincerity. Of course, I know too that a promise never stops her completely. She may not directly try to hook me up with somebody, but all she has to do is bat those dark eyelashes of hers at Damon about any guy in the place and Damon will know right away what she wants him to do.\\n\\n But I don’t need their help. I don’t want to hook up with anyone.\\n\\n “Oh!” Natalie says with her head in the closet. “This top is perfect!” She turns around dangling a loose-fitting black top with the fabric in the shoulders missing. Across the front it reads: SINNER.\\n\\n “Got it at Hot Topic,” she says, sliding it off the hanger.\\n\\n Not wanting to drag this shirt-choosing session out any longer, I slip off my own shirt and then take it from her hand.\\n\\n “Black bra,” she says. “Good choice.”\\n\\n I slip the top on and check myself out in the mirror.\\n\\n “Yeah? Say it,” she says, coming up behind me with a big smile on her face. “You like it, dont’cha?”\\n\\n I smile slimly back at her and turn to look at how the bottom of the shirt just barely covers the top of my hips.\\n\\n And then I notice it says SAINT across the back.\\n\\n “OK,” I say, “I do like it.” I turn around and point sternly at her. “But not enough to start raiding your closet so don’t get your hopes up. I’m content with my cute button-up tops, thank you very much.”\\n\\n “I never said your clothes weren’t cute, Cam.” She grins and reaches up and snaps my bra against my back. “You look frickin’ sexy on a daily basis, girl—I’d totally do you if I wasn’t with Damon.”\\n\\n My mouth falls open. “You’re so damn sick, Nat!”\\n\\n “I know,” she says as I turn back to the mirror and I hear the devilish grin in her voice. “But it’s the truth. I’ve told you before and I wasn’t joking.”\\n\\n I just shake my head at her, smiling while picking her brush up from the dresser. Natalie had a girlfriend once, during a short breakup with Damon. But she claimed she was ‘way too cock-crazy’ (her words, not mine) to spend her life with a girl. Natalie’s not a real slut—she’ll knock your face off if you ever call her one—but she is any boyfriend’s nympho dream, that’s for sure.\\n\\n “Now let me do your makeup,” she says stepping up to the vanity with me.\\n\\n “No!”\\n\\n Natalie thrusts her hands on her hourglass h*ps and looks at me wide-eyed, as if she was my mom and I just mouthed-off to her.\\n\\n “Do you want it to be painful?” she asks, glaring at me.\\n\\n I give in and plop down on the vanity chair.\\n\\n “Whatever,” I say, holding up my chin to give her full access to my face, which has just become her blank canvas. “Just no raccoon-eye shit, alright?”\\n\\n She cups my chin vigorously in her hand. “Now hush,” she demands, barely breaking a smile and trying to look all serious. “An arteest,” she says with a dramatic accent and the flourish of her free hand, “needs quiet to vork! Vut do you think these ees, a Deetroit beautee parlor?”\\n\\n By the time she’s finished with me, I look exactly like her. Except for the giant boobs and silky brown hair. My hair is the kind of blonde some girls pay a salon a lot of money to have, and it stops just to the middle of my back. I admit I was lucky in the perfect hair department. Natalie said that my hair would look better if I wore it down and so I did. I had no choice. She was very intimidating….\\n\\n And she didn’t make me look like a raccoon, but she didn’t go light on the dark eye shadow, either. “Dark eyes with blonde hair,” she had said as she went about applying the thick, black mascara. “It’s sexy hot.” And apparently my little open-toed sandals just weren’t going to do, because she made me toss them and wear a pair of her pointy heeled boots, which fit snugly over the legs of my skinny jeans.\\n\\n “You are one sexy bitch,” she says, looking me up and down.\\n\\n “And you owe me big-time for doing this,” I say.\\n\\n “Huh? I owe you?” She cocks her head to the side. “No, honey, I think not. You’ll owe me before this is over with because you’re going to have a great time and will be begging me to take you there more often.”\\n\\n I sneer playfully at her with my arms crossed and my hip popped out. “I doubt that,” I say. “But I’ll give you the benefit of the doubt and hope that I have a good time, at least.”\\n\\n “Good,” she says, slipping on her boots. “Now let’s get out of here; Damon’s waiting for us.”\\n\\n 2\\n\\n WE MAKE IT TO THE Underground just as night falls, but not before driving around in Damon’s souped-up truck to various houses. He would pull into the driveway, get out and stay inside no more than three or four minutes and never say a word when he came back out. At least, not about what he went inside for, or who he talked to—the usual stuff that would make these visits normal. But not much about Damon is usual or normal. I love him to death. I’ve known him almost as long as I’ve known Natalie, but I’ve never been able to accept his drug habits. He grows copious amounts of weed in his basement, but he’s not a pothead. In fact, no one but me and a few of his close friends would ever suspect that a hot piece of ass like Damon Winters would be a grower, because most growers look like white trash and often have hairdos that are stuck somewhere between the 70’s and 90’s. Damon is far from looking like white trash—he could be Alex Pettyfer’s younger brother. And Damon says weed just isn’t his thing. No, Damon’s drug of choice is coc**ne and he only grows and sells weed to pay for his coc**ne habit.\\n\\n Natalie pretends that what Damon does is perfectly harmless. She knows that he doesn’t smoke weed and says that weed really isn’t that bad and if other people want to smoke it to chill out and relax, that she sees no harm in Damon helping with that.\\n\\n She refuses to believe, however, that coc**ne has seen more action from his face than any part of her body has.\\n\\n “OK, you’re going to have a good time, right?” Natalie bumps my backseat door shut with her butt after I get out and then she looks hopelessly at me. “Just don’t fight it and try to enjoy yourself.”\\n\\n I roll my eyes. “Nat, I wouldn’t deliberately try to hate it,” I say. “I do want to enjoy myself.”\\n\\n Damon comes around to our side of the truck and slips his arms around both of our waists. “I get to go in with two hot chicks on my arms.”\\n\\n Natalie elbows him with a pretend resentful smirk. “Shut up, baby. You’ll make me jealous.” Already she’s grinning impishly up at him.\\n\\n Damon lets his hand drop from her waist and he grabs a handful of her butt cheek. She makes a sickening moaning sound and reaches up on her toes to kiss him. I want to tell them to get a room, but I’d be wasting my breath.\\n\\n The Underground is the hottest spot just outside of downtown North Carolina, but you won’t find it listed in the phone book. Only people like us know it exists. Some guy named Rob rented out an abandoned warehouse two years ago and spent about one million of his rich daddy’s money to convert it into a secret nightclub. Two years and going strong; the place has since become a spot where local rock sex gods can live the rock n’ roll dream with screaming fans and groupies. But it’s not a trashy joint. From the outside it might look like an abandoned building in a partial ghost town, but the inside is like any upscale hard rock night club equipped with colorful strobe lights that shoot continuously across the space, slutty-looking waitresses and a stage big enough for two bands to play at the same time.\\n\\n To keep The Underground private, everybody who goes has to park elsewhere in the city and walk to it because a street lined with vehicles outside an ‘abandoned’ warehouse is a dead giveaway.\\n\\n We park in the back of a nearby Mickey D’s and walk about ten minutes through spooky town.\\n\\n Natalie moves from Damon’s right side and gets in between us, but it’s just so she can torture me before we go inside.\\n\\n “OK,” she says as if about to run down a list of do’s and don’t’s for me, “If anybody asks, you’re single, alright?” She waves her hand at me. “None of that stuff you pulled like with that guy who was hitting on you at Office Depot.” \\n\\n","sourceLink":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1/page-2.html","bookId":1856,"book":{"id":1856,"title":"The Edge of Never (The Edge of Never #1)","description":"Storyline: Twenty-year-old Camryn Bennett thought she knew exactly where her life was going. But after a wild night at the hottest club in downtown Raleigh, North Carolina, she shocks everyone-including herself-when she decides to leave the only life she\u0027s ever known and set out on her own. Grabbing her purse and her cell phone, Camryn boards a Greyhound bus ready to find herself. Instead, she finds Andrew Parrish. \\n Sexy and exciting, Andrew lives life like there is no tomorrow. He persuades Camryn to do things she never thought she would and shows her how to give in to her deepest, most forbidden desires. Soon he becomes the center of her daring new life, pulling love and lust and emotion out of her in ways she never imagined possible. But there is more to Andrew than Camryn realizes. Will his secret push them inseparably together-or destroy them forever?\\n","cover":"https://allnovel.net/images/the-edge-of-never-the-edge-of-never-1.jpg","author":"J.A. Redmerski","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:23:29 PM"}}
