{"id":80300,"no":3,"title":"Page 3","content":"“What was she doing at Office Depot?” Damon says, laughing.\\n\\n “Damon, this guy was on her,” Natalie says, totally ignoring the fact that I’m right here, “I mean like all she had to do was bat her eyes once and he would’ve bought her a car—you know what she said to him?”\\n\\n I roll my eyes and pull my arm out of hers. “Nat, you’re so stupid. It wasn’t like that.”\\n\\n “Yeah, babe,” Damon says. “If the guy works at Office Depot he’s not going to be buying anybody any cars.”\\n\\n Natalie smacks him across the shoulder playfully. “I didn’t say he worked there—anyway, the guy looked like the lovechild of…Adam Levine and…,” she twirls her fingers around above her head to let another famous example materialize on her tongue, “…Jensen Ackles, and Miss Prudeness here told him she was a lesbian when he asked for her number.”\\n\\n “Oh shut up, Nat!” I say, irritated at her serious over-exaggeration illness. “He did not look like either one of those guys. He was just a regular guy who didn’t happen to be fugly.”\\n\\n She waves me away and turns back to Damon. “Whatever. The point is that she’ll lie to keep them away. I don’t doubt for a second that she’d go as far as to tell a guy she has Chlamydia and an out of control case of crabs.”\\n\\n Damon laughs.\\n\\n I stop on the dark sidewalk and cross my arms over my chest, chewing on the inside of my bottom lip in agitation.\\n\\n Natalie, realizing I’m not walking beside her anymore runs back towards me. “OK! OK! Look, I just don’t want you to ruin it for yourself, that’s all. I’m just asking that if someone—who isn’t a total hunchback—hits on you that you not immediately push him away. Nothing wrong with talking and getting to know one another. I’m not asking you to go home with him.”\\n\\n I’m already hating her for this. She swore!\\n\\n Damon comes up behind her and wraps his hands around her waist, nuzzling his mouth into her squirming neck.\\n\\n “Maybe you should just let her do what she wants, babe. Stop being so pushy.”\\n\\n “Thank you, Damon,” I say with a quick nod.\\n\\n He winks at me.\\n\\n Natalie purses her lips and says, “You’re right,” and then puts up her hands, “I won’t say anything else. I swear.”\\n\\n Yeah, I have heard that before….\\n\\n “Good,” I say and we all start walking again. Already these boots are killing my feet.\\n\\n The ogre at the warehouse entrance inspects us at the door with his huge arms crossed in front.\\n\\n He holds out his hand.\\n\\n Natalie’s face twists into an offended knot. “What? Is Rob charging now?”\\n\\n Damon reaches into his back pocket and pulls out his wallet, fingering the bills inside.\\n\\n “Twenty bucks a pop,” the ogre says with a grunt.\\n\\n “Twenty? Are you f**king kidding me?!” Natalie shrieks.\\n\\n Damon gently pushes her aside and slaps three twenty dollar bills into the ogre’s hand. The ogre shoves the money into his pocket and moves to let us pass. I go first and Damon puts his hand on Natalie’s lower back to guide her in front of him.\\n\\n She sneers at the ogre as she passes by. “Probably going to keep it for himself,” she says. “I’m going to ask Rob about this.”\\n\\n “Come on,” Damon says and we slip past the door and down one lengthy, dreary hallway with a single flickering florescent light until we make it to the industrial elevator at the end.\\n\\n The metal jolts as the cage door closes and we’re rather noisily riding to the basement floor many feet below. It’s just one floor down, but the elevator rattles so much I feel like it’s going to snap any second and send us plunging to our deaths. Loud, booming drums and the shouting of drunk college students and probably a lot of drop-outs funnels through the basement floor and into the cage elevator, louder every inch we descend into the bowels of The Underground. The elevator rumbles to a halt and another ogre opens the cage door to let us out.\\n\\n Natalie stumbles into me from behind. “Hurry up!” she says, pushing me playfully in the back. “I think that’s Four Collision playing!” Her voice rises over the music as we make our way into the main room.\\n\\n Natalie takes Damon by the hand and then tries to grab mine, but I know what she has in store and I’m not going into a throng of bouncing, sweaty bodies wearing these stupid boots.\\n\\n “Oh, come on!” she urges, practically begging. Then an aggravated line deepens around her snarling nose and she thrusts my hand into hers and pulls me towards her. “Stop being a baby! If anybody knocks you over, I’ll personally kick their ass, alright?”\\n\\n Damon is grinning at me from the side.\\n\\n “Fine!” I say and head out with them, Natalie practically pulling my fingers out of the sockets.\\n\\n We hit the dance floor and after a while of Natalie doing what any best friend would do by grinding against me to make me feel included, she eases her way into Damon’s world only. She might as well be hav**g s*x with him right there in front of everybody, but no one notices. I only notice because I’m probably the only girl in the entire place without a date doing the same thing. I take advantage of the opportunity and slip my way off the dance floor and head to the bar.\\n\\n “What can I get’cha?” the tall blond guy behind the bar says as I push myself up on my toes and take an empty barstool.\\n\\n “Rum \u0026 Coke.”\\n\\n He goes to make my drink. “Hard stuff, huh?” he says, filling the glass with ice. “Going to show me your I.D.?” He grins.\\n\\n I purse my lips at him. “Yeah, I’ll show you my I.D. when you show me your liquor license.” I grin right back at him and he smiles.\\n\\n He finishes mixing the drink and slides it over to me.\\n\\n “I don’t really drink much anyway,” I say, taking a little sip from the straw.\\n\\n “Much?”\\n\\n “Yeah, well, tonight I think I’ll need a buzz.” I set the glass down and finger the lime on the rim.\\n\\n “Why’s that?” he asks, wiping the bar top down with a paper towel.\\n\\n “Wait a second,” I hold up one finger, “before you get the wrong idea, I’m not here to spill my guts to you—bartender-customer therapy.” Natalie is all the therapy I can handle.\\n\\n He laughs and tosses the paper towel somewhere behind the bar.\\n\\n “Well that’s good to know because I’m not the advice type.”\\n\\n I take another small sip, leaning over this time instead of lifting the glass from the bar; my loose hair falls all around my face. I rise back up and tuck one side behind my ear. I really hate wearing my hair down; it’s more trouble than it’s worth.\\n\\n “Well, if you must know,” I say looking right at him, “I was dragged here by my relentless best friend who would probably do something embarrassing to me in my sleep and take a blackmail pic if I didn’t come.”\\n\\n “Ah, one of those,” he says, laying his arms across the bar top and folding his hands together. “I had a friend like that once. Six months after my fiancé skipped out on me, he dragged me to a nightclub just outside of Baltimore—I just wanted to sit at home and sulk in my misery, but turns out that night out was exactly what I needed.”\\n\\n Oh great, this guy thinks he knows me already, or, at least my ‘situation’. But he doesn’t know anything about my situation. Maybe he has the bad ex thing down—because we all have that eventually—but the rest of it, my parents’ divorce, my older brother, Cole, going to jail, the death of the love of my life…I’m not about to tell this guy anything. The moment you tell someone else is the moment you become a whiner and the world’s smallest violin starts to play. The truth is, we all have problems; we all go through hardships and pain, and my pain is paradise compared to a lot of people’s and I really have no right to whine at all.\\n\\n “I thought you weren’t the advice type?” I smile sweetly.\\n\\n He leans away from the bar and says, “I’m not, but if you’re getting something out of my story then be grateful.”\\n\\n I smirk and take a fake sip this time. I don’t really want a buzz and I definitely don’t want to get drunk, especially since I have a feeling I’m going to be the one driving us home again.\\n\\n Trying to take the spotlight off me, I prop one elbow on the bar and rest my chin on my knuckles and say, “So then what happened that night?”\\n\\n The left side of his mouth lifts into a grin and he says, shaking his blond head, “I got laid for the first time since she left me and I remembered how good it felt to be unchained from one person.”\\n\\n I didn’t expect that kind of answer. Most guys I know would’ve lied about their relationship phobia, especially if they were hitting on me. I kind of like this guy. Just as a guy, of course; I’m not about to, as Natalie might say, bend over for him.\\n\\n “I see,” I say, trying to hold in the true measure of my smile. “Well, at least you’re honest.”\\n\\n “No other way to be,” he says as he reaches for an empty glass and starts to make a Rum \u0026 Coke for himself. “I’ve found that most girls are as much afraid of commitment as guys are these days and if you’re up front in the beginning, you’re more likely to come out of the one-nighter unscathed.”\\n\\n I nod, fitting my fingertips around my straw. There’s no way I’d openly admit it to him, but I completely agree with him and even find it refreshing. I’ve never really given it that much thought before, but as much as I don’t want a relationship within one hundred feet of me, I am still human and I wouldn’t mind a one-night stand.\\n\\n Just not with him. Or anyone in this place. OK, so maybe I’m too chicken for a one-night stand and this drink has already started going straight to my head. Truth is, I’ve never done anything like that before and even though the thought is kind of exciting, it still scares the shit out of me. I’ve only ever been with two guys: Ian Walsh, my first love who took my virginity and died in a car accident three months later, and then Christian Deering, my Ian rebound guy and the jerk who cheated on me with some red-haired slut.\\n\\n I’m just glad I never said that poisonous three-word phrase that begins with ‘I’ and ends with ‘you’, back to him because I had a feeling, deep down, that when he said it to me, he didn’t know what the hell he was talking about.\\n\\n Then again, maybe he did and that’s why after five months of dating, he hooked up with someone else: because I never said it back.\\n\\n I look up at the bartender to notice he’s smiling back at me, waiting patiently for me to say something. This guy’s good; either that, or he really is just trying to be friendly. I admit, he’s cute; can’t be older than twenty-five and has soft brown eyes that smile before his lips do. I notice how toned his biceps and chest are underneath that tight-fitting t-shirt. And he’s tanned; definitely a guy who has lived most of his life near an ocean somewhere.\\n\\n I stop looking when I notice my mind wandering, thinking about how he looks in swim shorts and no shirt.\\n\\n “I’m Blake,” he says. “I’m Rob’s brother.” \\n\\n","sourceLink":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1/page-3.html","bookId":1856,"book":{"id":1856,"title":"The Edge of Never (The Edge of Never #1)","description":"Storyline: Twenty-year-old Camryn Bennett thought she knew exactly where her life was going. But after a wild night at the hottest club in downtown Raleigh, North Carolina, she shocks everyone-including herself-when she decides to leave the only life she\u0027s ever known and set out on her own. Grabbing her purse and her cell phone, Camryn boards a Greyhound bus ready to find herself. Instead, she finds Andrew Parrish. \\n Sexy and exciting, Andrew lives life like there is no tomorrow. He persuades Camryn to do things she never thought she would and shows her how to give in to her deepest, most forbidden desires. Soon he becomes the center of her daring new life, pulling love and lust and emotion out of her in ways she never imagined possible. But there is more to Andrew than Camryn realizes. Will his secret push them inseparably together-or destroy them forever?\\n","cover":"https://allnovel.net/images/the-edge-of-never-the-edge-of-never-1.jpg","author":"J.A. Redmerski","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:23:29 PM"}}
