{"id":87895,"no":9,"title":"Page 9","content":"As Marcus led him down to a second level of the Club, Thomas couldn\u0027t get a sense of his Master\u0027s thoughts. Arousal, for certain. The flash of anger, almost vicious resentment, had unsettled him. In these surroundings, Thomas was already unsettled.\n He needed to be sure of his Master, and he wasn\u0027t at all sure of Marcus\u0027 mind at the moment.\n This area of the club was a circular lounge, where those taking a break could relax with a drink, talk. In the center of the room was...well, he wasn\u0027t sure what to call it. He was starting to know what Alice in Wonderland must have felt. Or any character who found himself in a world fantastically, temptingly different from his own.\n It appeared to be a large oval-shaped fountain with water pouring over stepped layers of flat slate from a top round disk into the pool. On top of the disk was an excellent reproduction of Michelangelo\u0027s David.\n There were men kneeling, manacled in a circle around the wall of the pool. The line of the wall was scalloped, so each convex or concave curve formed a separate space for the man placed there. The men\u0027s positions were also arranged to form an aesthetic design. Where one man was bent over the wall in the concave space, the ivory rough stucco side pressing against his pelvis as he stared down into the water, the man next to him sat on the convex top of the scallop, facing outward and sitting upright.\n Their arms were chained, one man\u0027s arm under or over the man\u0027s next to him. The ankles were likewise done, legs spread, so the sitting man\u0027s jutting cock and balls were exposed from the front as the bent-over man\u0027s was from the back, hanging free between his legs.\n The floor beneath the fountain and the men was a rotating disk, and they were moving slowly, being displayed from all angles. As Thomas studied the carousel, the rigid faces of the men on their knees or the jerking hips of the men facing forward, he understood.\n The cocks of the men bent forward were threaded through holes in the fountain wall, their hips and thighs anchored with straps so they couldn\u0027t move back to free themselves. Something in that hole was stimulating them like a man\u0027s mouth. Whereas the sitting men were obviously sitting on automated phalluses to fuck their asses. All for the watching pleasure of the wine drinkers in the room.\n \"Chocolate sauce, sir?\" A waiter stepped up to Marcus. Thomas managed to tear his gaze away to see Marcus hand over the required tip before dipping his fingers into the metal chalice offered. Thomas noted all the men on the carousel were marked in some way on chest or back, depending on which direction they were situated, with letters or symbols he didn\u0027t understand.\n Marcus brought the sauce-covered fingers to Thomas\u0027 back. As he stayed still and felt the slow glide over his spine, the caress as Marcus made a symbol of his own, Thomas digested the fact that Marcus was going to put him here. Restrain him, let others watch him get fucked or jerked off by inanimate electronic devices.\n This imprisonment of his body, displaying it for the pleasure of others, was unthinkable, and yet he was fascinated by it. He was unable to resist the pressure of Marcus\u0027 hand as he was guided to the fountain and Marcus removed the cock harness.\n \"On your knees, pet,\" Marcus ordered. \"Put this new condom on and then guide your cock into the hole.\"\n Thomas sank down on a knee cushion apparently provided to help the sub hold his position. As he leaned forward, obeying, he felt as if everyone\u0027s eyes were on him, but particularly Marcus\u0027. He guided himself into a warm, moist canal and jumped as it automatically closed on him, adjusting for his girth. Then it cinched in a little tighter to hold him.\n \"Holy Christ.\" He swallowed. It felt too snug to remove himself without tearing off something he might need.\n Marcus fitted the straps over the backs of his thighs and his waist, spreading out his arms to either side, under the braced arms of the two sitting men on either side of him so their forearms touched. There was another vulnerability to this position, for his cheek now pressed on the upper curve of the well wall, mist from the fountain bathing his face as Marcus bound his neck against it with a strap, holding him completely in place.\n His knees were nudged further apart and the ankles of the men on either side were briefly released so Thomas\u0027 legs could be guided to the inside of their feet. When they were all rebound, he was firmly manacled, their heels pressing against the inside of his calves, almost as if they were holding him spread open. They did not speak, at least one of them gagged, but he could feel the warmth of their unfamiliar flesh, the flex of their muscles.\n \"This will keep you occupied for a time. I\u0027m going to go set up a room I want to use.\" Marcus fiddled with a dial and Thomas clenched his jaw as the simulation of a wet mouth began to work him, making his body tense with the artificial stimulation.\n \"Master...\" Don\u0027t go, he wanted to say. Don\u0027t leave. But there was an element of punishment here he had to endure for the pleasure of his Master. One part of him wanted to tear free, be back home with Marcus where play was between them. Another part of him wanted to be here, showing the world he belonged to Marcus. Which made no sense at all. But what had ever made sense with Marcus?\n Marcus was standing where he could partially see him, and he was aroused.\n Looking at Thomas and nowhere else, and Thomas knew him so well, he knew Marcus was so turned on he could barely speak. It made his own reaction leap, not a wise idea with the stimulation he was already experiencing. He groaned.\n Marcus passed his hand over his hair, clenching and tugging to the point of pain.\n \"You\u0027re going to make every dick in the place rock hard. I changed my mind on one thing, because you seem to be having trouble remembering to keep your eyes down.\n You can be touched, pet, but the symbol I left on your back says you\u0027re mine, that you\u0027re not to be fucked.\"\n Thomas bit his lips as Marcus called a staff member to attend him. The oiled-down muscular man in painted-on Latex black pants and black tie carried a shallow crate supported with a strap around his neck like one of the vintage cigarette girls, only he was providing a selection of plugs in sealed packaging. Marcus chose one very thick dildo, paid and tipped him well, then lubricated it for insertion.\n Thomas watched him, his mouth dry, unable to speak. When Marcus eased it into him, his fingers gripping his buttock, Thomas\u0027 testicles drew up, his cock flexing inside the tight cavern of that automated mouth.\n \"If you should sweat it off, that\u0027s to protect your virtue until I return. Don\u0027t let it slide out, pet. Keep that ass tight.\"\n Marcus\u0027 fingers whispered down his back and then he was gone where Thomas couldn\u0027t see him. With his neck locked down, he could only look at the man next to him or gaze down into the wading pool.\n The man next to him was getting ready to explode, bouncing spasmodically, as much as he could with his tight restraints, breath rasping. \"Please...Master...\" His Master must be at one of the tables watching him. The wet mouth sucked on Thomas\u0027 cock, rippled. Holding his ass tight wasn\u0027t a problem. He wanted to slam himself against the wall in response, but he couldn\u0027t.\n He tore his gaze from the man and looked down into the fountain, only to find that provided no relief. It had a glass bottom, and through the wake of the fountain water he could see the floor of a third level below. There appeared to be a full scale Roman orgy ensuing.\n Desire and lust crowding in on all sides, but where the hell was Marcus? Surely Marcus wouldn\u0027t go where he couldn\u0027t see Thomas? As Thomas rotated with the others, he couldn\u0027t see anything, for the carousel was almost full, too many bodies in the way.\n Marcus had surely only been gone a minute, but without being able to see him, it seemed much longer. He felt helpless.\n He heard voices, registered words as Doms walked by, appreciatively fondling those with the right symbols. One gripped the cock of the man about to explode, testing the weight and girth while his companion leisurely took down his pants and drove a sheathed cock glistening with lubrication into the slave on the other side of that man, eliciting a guttural cry which seemed to inspire him to a rougher thrust, a reverent curse. His friend rubbing the cock next to Thomas chuckled and made a comment Thomas couldn\u0027t hear.\n The man ejaculated, crying out, and Thomas closed his eyes. He didn\u0027t want to come like this. Oh God, but he was going to...\n Then he stiffened as a strange hand touched his ass, his lower back. A thigh pressed against his, making his thighs widen further. When fingers rocked the dildo in his ass, the explosion of sensation went right to the root of his cock. An electric knot of tension fired through his belly and tributary lines in his chest as if he wore nipple clamps.\n That hand was now on his back stroking. Get off. That\u0027s not yours. Two men. There were two men behind him. He was hemmed in by them, and by the slaves on either side.\n He didn\u0027t like this. Didn\u0027t want this. He wanted out of here. The lobby and the glass wall, that had been just Marcus and him, even surrounded by other people. Where the fuck was Marcus?\n Stop it. He squeezed his eyes shut, the rushing of the water filling his senses, but it didn\u0027t calm him. If anything, it was like the roar of a crowd watching gladiators, men forced to perform, to bleed, to suffer for cruel eyes and faces.\n He wanted to focus on soft green fields, the way the North Carolina mist would lie low on the cut fields on an early morning. The velvet press of Kate\u0027s nose in his hand.\n The feel of Marcus\u0027 body curled protectively around him, only this wasn\u0027t protective, so the image didn\u0027t hold, dissolving away like the empty fantasy it was. Fingers pinched his ass hard, closed around his testicles.\n This was Marcus\u0027 punishment. His anger, which had been simmering below the surface since Thomas had gone down on him in front of a mass of strangers and they\u0027d left the foyer. That was what was wrong. This was wrong.\n \"Let go.\" He tried to twist around, tried to see his tormentors and couldn\u0027t as they stayed just out of his vision, playfully laughing at his efforts. \"Stop it.\" He said it again, stronger, and one slapped his ass.\n \"It says you can\u0027t be fucked, Slave Sixty-Eight. It doesn\u0027t say you can\u0027t be touched.\" It was a game to them. They didn\u0027t know. He should just ride it out. He should just...\n \"I\u0027m saying it. I\u0027m...\" As the man\u0027s touch drifted to his front, teasing his nipples, his other hand clamping on the back of Thomas\u0027 neck to increase the sense of being pinned, Thomas tried to kick out, forgetting his leg was bound to the floor. He yanked against the hold of the manacles, managing to send a tremor through the fountain wall. It drew startled looks from the bound slaves he could see.\n \"Stop it. Go away. Damn it, stop. STOP. \"\n \"Sshh...sshhh.\"\n Marcus. Marcus\u0027 touch on his back, Marcus\u0027 thighs straddling his hips, the other men moving away at Marcus\u0027 murmured word. The electronic stimulation stopped.\n \"Let me go.\"\n \"In a minute. I promise, in just a minute. You need to calm down first. Deep breaths.\"\n \"Why did you do this? This wasn\u0027t about...like the rest. I\u0027m not...\" I\u0027m not theirs. I\u0027m yours. Thomas wanted to say it, but he didn\u0027t. Not right now. He was angry, hurt. He wanted to be let go.\n The other man had been removed by his Master after his climax, so Marcus came into his field of vision then, sitting down on the now empty convex scallop of the carousel, sans dildo. Propping his hand just behind Thomas\u0027 head, he leaned down over him, so Thomas could see his Master\u0027s face. Only his Master\u0027s face. Marcus laid his hand on Thomas\u0027 cheek, thumb caressing the side of his nose.\n \"It\u0027s different now with us, isn\u0027t it?\" Thomas managed. He was able to stretch out his fingers enough to grasp the cuff of Marcus\u0027 sleeve, capture it between two fingers in a tenuous hold, just a physical connection. \"It was easier before, but it\u0027s like...we\u0027re deeper somehow now.\"\n His intuitive artist. Marcus didn\u0027t know how to answer him, how to say that yes, it was more intense. That bringing Thomas here had opened up scars much older than those Thomas had inflicted. That the cut of his leaving had severed stitches over ancient wounds Marcus thought he\u0027d left behind.\n Don\u0027t sacrifice my son on the altar of your demons...\n \"Come on.\" Marcus reached over and removed the restraints on Thomas\u0027 neck and arms, the legs and hips. He wanted to touch him, but he didn\u0027t. He felt unclean. \"You don\u0027t belong here.\"\n It was startling to realize that neither did he. Not anymore. Not while he was with Thomas.\n Thomas rose. Swayed a little as blood rushed to his head, but still Marcus couldn\u0027t bring himself to reach out. It was Thomas who did, catching Marcus\u0027 shoulder before he could draw away. He curled a hand in Marcus\u0027 shirt lapel to steady himself.\n \"Is this what you want? What you like?\" When Thomas said the words in an odd, soft voice, Marcus could see the weight he\u0027d placed on his farm boy\u0027s heart. Thomas was obviously torn between what he subconsciously knew to be true about the two of them and his doubt of that truth. Doubt, because Marcus had betrayed Thomas\u0027 trust.\n Betrayed what Marcus himself knew to be true about the two of them.\n \"No,\" Marcus said at last, making himself say that truth. \"Not with you.\" When he started to turn away, his slave tightened his grip, met his gaze. \"Master.\n It\u0027s okay.\"\n \"No. No, it\u0027s not.\" Marcus attempted a light tone, failed. \"You mess me up, Thomas. In a lot of ways.\"\n A slow smile crossed Thomas\u0027 face, a surprising expression considering the gravity of the moment. \"And you think my compass isn\u0027t spinning around like I\u0027m in the Bermuda Triangle when I\u0027m with you?\" He took a breath. \"If this is the kind of thing you want, I\u0027ll...figure it out. I\u0027ll do it. We\u0027ll do it.\"\n \"No.\" Marcus pried his touch off his shirtfront and held it upright between them, curled hand over curled hand, like two men taking a warriors\u0027 oath. \"It\u0027s never going to be that way with us. Anything you say \"stop\" about, I respect. No apologies, no guilt on your part, no feeling like you\u0027ve disappointed me. I want you to feel comfortable saying it. You want to get out of here now?\"\n When Thomas looked at him, something shifted in his eyes, something that made everything in Marcus go still. His grip increased around Marcus\u0027 hand.\n \"You said...\"\n \"What, pet?\"\n \"\u0027Then I kissed every welt so he was begging for more.\u0027\" Thomas moved in, his hair brushing Marcus\u0027 temple. They were eye to eye, his lips so close, his body completely naked, pressing close to Marcus\u0027 fully clothed one. But it was his gaze where all his energy was concentrated, bringing fire into Marcus\u0027 chest at that searing look. \"That\u0027s the room you set up, wasn\u0027t it?\"\n Marcus nodded, one slow movement.\n \"Then give me your pain, Master. I can bear it as long as I know your lips will touch every mark when you\u0027re done, signing it as your work.\" They both knew there was more going on here, but Jesus. As usual it was Thomas who called it forth, gave it a name, restored the balance. And Marcus knew Thomas had no clue he had that gift. He wondered if any Master could deserve him, let alone one as despicable as himself.\n The room he\u0027d booked wasn\u0027t private. Three other couples were in there. Marcus was fine with that, though initially he would have preferred a room with just him and his slave. He ignored the sly voice that suggested his change of heart was to keep Thomas from making any more soul baring confessions that might drive him to his knees.\n However, it was silent except for the short commands of Masters to their bound subs, the slap of weapons against flesh. One slave was bent double, wrists bound so he hugged his knees as his Master caned him. Another was over a spanking bench being paddled, his buttocks already a bright red. His grunts came through the ball gag strapped around his head.\n Some Masters were like used car salesmen, loud, admonishing their subs as if for a performance. These three couples were quiet, simply giving Marcus a cursory look and a nod as he came into the door. They were into their own scenes, personal between their sub and them. Their presence was stimulating, but not intrusive.\n Walking Thomas to the side of the room, Marcus straightened his arms above his head and locked him into a pair of manacles dropped from the ceiling. Marcus did the same to his ankles with a set bolted into the floor, using his knee instead of his voice to command Thomas to spread wide. The chains made a clanking sound.\n There was a delicious shiver running through his slave\u0027s body now, Thomas responding as Marcus knew he would, making him want to snap and salivate like a wolf. Something was drawing tight, low in Marcus\u0027 belly, a feeling he hadn\u0027t ever experienced as a Dom before. He\u0027d gotten hints of it before with Thomas, a vision of the places the feelings between them could take them both.\n \"Master...\" Thomas\u0027 voice, almost a murmur, sending a ripple of response through Marcus\u0027 body. He leaned up against his now immobilized lover, pressing his hips against Thomas\u0027 bare backside. He stroked his arms, all the way up, and gripped his wrists just below the cuffs with his own hot palms, as if they were bound together. Two slaves to Fate, awaiting its lash.\n Then he got hold of himself. Marcus dropped one hand to Thomas\u0027 jaw, holding him steady. \"Don\u0027t move your lips,\" he commanded.\n He brushed his lips over the firm mouth, the corners, tracing him with his tongue.\n Thomas clenched his fists in the cuffs. His cock brushed against Marcus\u0027 as it rose high again, bumping his groin.\n When Marcus glanced down and raised an ironic gaze, there was a tight smile on Thomas\u0027 lips, even as his eyes burned with need. \"You said my lips. You didn\u0027t say anything else.\"\n Marcus pressed his temple to him. \"So I did. I\u0027m going to blindfold you now, dearest. I want your focus to be only on what\u0027s going on inside of you and what I\u0027m doing. Let everything but that energy go and see where it takes you.\" Thomas didn\u0027t reply, just stood still as Marcus fitted the blindfold over his eyes, unable to resist brushing his fingers over Thomas\u0027 fair lips one more time before he turned him, the heavy ankle chains having enough slack that he could make Thomas face away from him. Then he moved back, went to the weapon choices on the wall.\n Let everything but the energy go, and see where it takes you...\n That was what Thomas did when he painted. Thomas wondered if Marcus had knowingly provided him the right words to help him focus, give him something to hang onto. So much of the past hour had been instinct, no thought. There was no explaining why. As he strained to hear Marcus\u0027 movements, his footsteps, the portentous sound of something being retrieved from inside a cabinet, his body trembled with anxiety and arousal both. His cock was as stiff as it had been when Marcus was inside him, as if Marcus were still inside him.\n Like a cruel poltergeist, the thought flitted through his mind of what his family would think. Jesus, would they be glad to accept he was \"just gay\" if they knew about this? No, he didn\u0027t want his thoughts to go there. But there it was. Rory or his mother, or even Celeste, seeing this. Was something wrong with him? Was he sick to crave this so much from Marcus\u0027 hand? He was about to be beaten, hard, and all he could think was yes, please. Give me the release.\n His fists became knots, reflecting what was happening in his lower abdomen. Was this who he was? He couldn\u0027t even explain why he desired and wanted this to himself.\n Was he just fucked up? What if -\n The whistle of air announced the lick of flame which sliced down his back in a diagonal line from shoulder blade to mid-back. He arched on a gasp.\n \"Let everything go. You\u0027re disobeying your Master. Let me see if I can\u0027t help bring you in line.\" Marcus\u0027 voice, stern, implacable, with a rough thread that told Thomas his instant response had aroused him.\n Give me your pain...\n The lash fell again. Holy God, what was Marcus using? The stinging provided a jolt, the weight of the tail like a knife cut that became a rope burn. But the pain released a wealth of inexplicable emotional and physical responses in him. It simply was and there was no defense against the reaction.\n The tableau of broad shoulders, muscles bunching and rippling across Thomas\u0027 back, down to the tight flex of his buttocks and thighs, the curling of his toes, made Marcus harder, hotter. He was mindful of his strength, knowing the difference between administering pain for pleasure and pain for pain\u0027s sake. He was straddling the line with it, choosing different areas for each stroke, then going back, increasing the agony and the burn, but increasing something else too.\n The wall beyond them was mirrored, so he could tell Thomas was getting closer to climax with every blow. His expulsion of breaths, the quiet grunts and trembling, the gleam of perspiration spreading on his smooth, firm skin, told Marcus what he\u0027d always suspected, that Thomas was a sub to the hardcore, even if it was only with him.\n That exclusivity suited him just fine. If anything, it drove his lust to levels that could easily make him insane.\n He closed the distance between them. Before Thomas could anticipate, Marcus laid the hand still holding the whip on his back, letting Thomas feel the texture of the braided weapon along with the fingers holding it.\n When Marcus wet three fingers from his own mouth and thrust them deep between his slave\u0027s buttocks, he nearly growled with possessive satisfaction at Thomas\u0027 groan of response. His thighs strained against the manacles. \"Jesus...\" He had raised red welts on his skin, so now Marcus made good on his promise.\n Touching his lips to those marks, he felt Thomas shudder at each touch of his mouth.\n \"I\u0027m going to move back in a minute and do it some more,\" Marcus said gruffly.\n \"Because of the pause, the initial blows will be more sensitive, so the first strikes will hurt. But instead of tensing, I want you to relax. Completely surrender to the pain, and to me. Can you do that?\"\n Thomas nodded, his head pressed hard against his arm. When he spoke, nerves made his voice shake. \"Yes, Master.\"\n \"Good.\"\n When Marcus moved his fingers in the tight channel of his ass, slow, steady, Thomas rocked against his touch. God, his cock was so hard Marcus ached. \"You\u0027re so hot you\u0027d go off like a volcano if I commanded it, wouldn\u0027t you?\" Thomas jerked his head in another nod. \"Yes, Master.\"\n \"I love it when you call me that. When you know it\u0027s absolutely true, so I hear it in your voice.\" Marcus bent his head, soothed another welt and noticed Thomas biting down on the inside of his mouth as if to keep from crying out.\n He\u0027d changed his mind. He wanted to hear Thomas cry out. In fact, he wanted to hear him scream.\n Marcus was moving around to his front. The heat of his body brushed Thomas, the whip circling his waist, the loop of it dropping low on his ass. When Marcus released his ankles, Thomas heard some type of mechanism humming. His arms drew taut, his body stretching, his heels leaving the ground...\n \"Marcus - \"\n \"Be still, pet.\"\n His feet left the floor completely, his shoulders straining with his own weight. He was moving, a conveyor taking him...backward? It was hard to tell blindfolded, but his body came up against an uneven vertical metal surface, like the bars of some type of cage. His shoulder blades, buttocks and heels were against them.\n Marcus took him back to the ground again, though he kept him stretched out pretty well, his toes barely brushing the floor. What contraption was he up against? Thomas couldn\u0027t remember what all was in the room, so distracted by what Marcus was going to do to him here.\n \"All points - head, shoulders, heels - stay right against these bars, pet. Or I stop.\" Stop what? Then Thomas felt the whip tighten on his hips so he had to pull against him to stay in position. His mind as well as his body froze as Marcus\u0027 mouth closed over his bare cock.\n Marcus had mouthed him there before, usually after he\u0027d wrestled Thomas to the ground to tease him with the passing caress of his warm breath, the playful sandpaper stroke of his jaw in the late afternoon. But never like this, where Thomas felt the full blissful suction of his mouth taking him deep while Marcus held the whip in a tight grip compressing his ass cheeks.\n He used the whip to move Thomas as he wished, making him have to focus on obeying Marcus\u0027 order against Marcus\u0027 own strength, which had the effect of stretching the rubber band reaction in his lower body even tauter.\n When Marcus\u0027 tongue flicked on Thomas\u0027 head, he gasped. Though he gripped the chain with both hands to try to stay still, he couldn\u0027t. Oh God, there was no way... He tried to hold his heels and shoulders in a fixed position as Marcus had demanded, but his body swayed and moved.\n \"Master, I can\u0027t... Oh God...\"\n Marcus removed his mouth. With swift and ruthless functionality, he closed something over Thomas\u0027 chest, shoulders, throat and face and snapped it closed, then did the same across his legs at mid-thigh, leaving just his groin and head area free. It was a tight, constricting fit, making Thomas grunt with need. Marcus ignored him, went back to work on him with his mouth.\n He\u0027d put him in some sort of modified iron maiden. Under the blindfold, Thomas was locked in darkness, in the hell-born pleasure of that mouth, its slow friction up and down his length, the lash of the tongue, the addition of strong fingers, moving between his legs to find his rim again, teasing his hips into a jerky rhythm as Marcus slid several fingers back in. It was the knife edge of pleasure, cutting him deep, but he hung onto the blade with both hands, needing it too much to fall off, even if it cut him to the core and split him in half.\n Marcus was performing long, slow glides along his length with his mouth. Rocking back and forth on his Master\u0027s fingertips, Thomas couldn\u0027t contain his response. He made a strangled sound of pain, an attempted warning, but rather than pulling back, Marcus took him deeper, hand curling on Thomas\u0027 hip, the cylindrical shape of the whip pressed against his skin, between hot palms and his damp flesh.\n As Thomas jerked forward, jetting, Marcus took his release into the back of his throat with expert precision, growling his approval as Thomas cried out with the power of the sensation.\n He rocked and bucked, hearing the rhythmic clank of the chains, their clatter against the iron maiden as he jerked. Somewhere else in the room, another slave released among the sounds of punishment and flogging.\n Then as he was still shuddering, Marcus pulled his mouth away, removed his fingers. Rising, he moved behind Thomas.\n Taking a firm, possessive hold of Thomas\u0027 throat with the whip hand, Marcus reached down, put those three fingers back in, thrusting, thrusting. Then a fourth finger. Then a fifth.\n All five, stretching the way as Marcus slowly, inexorably worked his hand in until he was fully there, deep in the rectum, negotiating the curves, seeming to know Thomas\u0027 body inside and out. His fingers curled and he was fisting Thomas, his forearm between his ass cheeks, his wrist stretching him open.\n Marcus had never fisted him before, but Thomas was so open to him in every way now that he trusted, didn\u0027t tense, let Marcus all the way in and suddenly found himself fuller than he\u0027d ever been, an indescribable feeling. He thought he\u0027d finished climaxing, but he found he was wrong. His cock jetted anew, as if Marcus was milking a reservoir Thomas hadn\u0027t known he\u0027d had, taking the orgasm to a cataclysmic level.\n Thomas\u0027 shout became a scream, all the thoughts in his mind exploding so there was nothing but this second in time, the universe stopping as everything else vanished.\n And even then Marcus was not done with him, still ruthlessly working him, keeping Thomas screaming, convulsing in the restraint of the iron maiden as if in a seizure.\n He might have blacked out at last. He wasn\u0027t sure. All he knew was when he finally came down, he was hanging limply against the cuffs, his shoulder joints aching like hell. His mouth was open, lips stretched back to draw shuddering gasps.\n He could hear at least two of the Masters murmuring to one another in appreciation of the stimulation to their own scene, could sense the eyes of the other subs on him.\n Perhaps envious. Perhaps counting themselves lucky their Masters didn\u0027t strip them so raw. But it didn\u0027t matter. He was Marcus\u0027. There was no thinking about that, no choice.\n His back stung like holy hell and his cock felt wrung out but all he wanted, desperately needed, was Marcus. Enough to beg.\n \"Please touch me.\"\n He needed intimacy, the emotion behind the physical punch of what Marcus had just done to him.\n Marcus moved around him, so close to Thomas\u0027 body Thomas felt the brush of his slacks against his knees. The whip slithered over his buttocks and fell to the outside of his legs as Marcus dropped it. Grasping Thomas\u0027 waist, a proprietary touch, he leaned in, pressed his lips to Thomas\u0027 throat just below his ear, then across his cheekbone. The forehead, the slope of his nose. The eyes beneath the blindfold.\n Thomas stood in the manacles, vibrating, overwhelmed with words he couldn\u0027t say.\n Didn\u0027t know if he knew how to say them, because they contained all the heartbreak of the world mixed with its ephemeral joy. Waking to the aroma of breakfast when he was eight. Feeling the heat of the setting sun on his skin while falling asleep on Kate\u0027s back at ten.\n Turning and seeing Marcus for the very first time. Moments too powerful to be contained by the human heart and therefore having a peculiar way of making the soul hurt, as if there was something to mourn in the midst of the happiness. As if happiness itself couldn\u0027t exist without shadows to define it.\n Thomas parted his lips. He understood his Master would kiss his mouth when he desired to do so, and he was embracing his pleasure by staying still. But when Marcus at last cupped his jaw and pressed his mouth to Thomas\u0027 lips, he made a soft noise, a breath of sound into that welcome place, teasing Marcus\u0027 tongue, everything in him straining, needing. He never wanted Marcus to remove the blindfold, for truth and desire were easier to hold onto in this cleansing darkness.\n \"Yours,\" he said abruptly, a hoarse whisper into that heated cavern. \"Always.\" He\u0027d said it earlier, in a different way. But he wanted Marcus to know it, to realize it was the one thing he could give him without reservation, no matter if everything else in his life took him away from the one thing he wanted above all others, even his painting. Actually, the two were intertwined, expressions of the soul without which he was just a shell. He supposed it was no wonder Marcus was a gallery owner.\n \"All mine,\" Marcus agreed, the voice of his soul. \n","sourceLink":"https://allnovel.net/rough-canvas-nature-of-desire-6/page-9.html","bookId":1911,"book":{"id":1911,"title":"Rough Canvas (Nature of Desire #6)","description":"Storyline: \n Rough Canvas (Nature of Desire #6) \n When his father dies, Thomas is forced to abandon a burgeoning art career in New York. As difficult as it was to give up his lifelong dream, it\u0027s nothing next to walking away from the man he loves. Marcus taught him to embrace who he is, a sexual submissive who responds to the touch of only one Master. But why would the sophisticated Marcus need some farm kid from the South? \n Then Marcus shows up and offers him a way to continue his art career and help his family. There\u0027s only one hitch-he asks Thomas to spend a week with him in the Berkshires. Thomas knows he should refuse. But he\u0027s never been able to say no to his Master.\n \n","cover":"https://allnovel.net/images/rough-canvas-nature-of-desire-6.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rough-canvas-nature-of-desire-6.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:24:49 PM"}}
