{"id":108404,"no":20,"title":"Page 20","content":"\n Look at this magic pen I got for you, she says and tilts it in front of his eyes so he can see. His eyes focus deep, like he would like to put himself on the carriage inside that pen.\n Go on, she says, handing it to him. You can keep it. It’s a present. Who knows, maybe today is your birthday.\n AT NIGHT they find places to sleep. Structures they can barricade, rooftops onto which they can climb. They look at the stars, and she makes up stories about what’s happening on the different earths going in circles around those different suns. Maury falls asleep easily, as though it were his natural state and wakefulness a chore to maintain. She herself has trouble sleeping. These are the times when she wishes she knew how to play a harmonica or a guitar or a jaw harp. She remembers the lighthouse, her magazines, pulling in the nets in the morning, circling the island like it was the perimeter of everything. And then her mind crowds with other things—a noisy parade of memories that frustrate her because of the way they play themselves out. These memories—it feels like she’s back there in the moment, like she has the moment to do over and make different choices than she made. But she can’t, because they’re just memories and they’re set down permanent as if they were chiseled in marble, and so she has to just watch herself do the same things over and over, and it’s a condemnation if it’s anything.\n She’s taken to sleeping with her head on Maury’s chest. The sound of his heartbeat steady where other things are calamitous.\n Daylight they drive.\n I sure wish you could read, Maury. I mean, have a look at that lake.\n The road opens up and they are driving along the shore of a shimmering body of water. Through the trees, she can see the sun scintillating on the rippled surface. It widens as they drive and the opposite shore retreats until they can barely see the houses and docks on the other side.\n Look at the pair of us, she says. It sure would help if one of us could read.\n She looks at him, his eyes far gone in the horizon.\n Hell, she says. Who knows? Maybe you can read, you just can’t speak it out loud. Either way it don’t do us much good.\n She would like to see people swimming out there in that lake. Getting their enjoyment out of it.\n I mean, that’s a beautiful thing right there, she says. I bet it’s got a beautiful name to it too. Like Crystal Palace Lake or Lake Sparkle Heaven or something like that. And I bet that sign right there would tell us if either of us could decipher it.\n She sighs.\n Nope, she says. You and me, we’re not privy to the secrets of language. Good thing I got taught a few songs when I was little—and lucky for you I’m blessed with the voice of an angel. Watch out, dummy, I’m gettin ready to let go.\n Take me out of the ball game!\n Take me out of the crowd!\n Buy me some peanuts and snapplecracks!\n I don’t care if I ever go back!\n So it’s hoot, hoot, hoot for the home range!\n If you don’t care, it’s a shame!\n Cause it’s one, two, three strikes you’re out\n Of the old ball game!\n When the tank is half full, they stop at each gas station until they find one where the pumps are still working. She likes the smell of the fuel burning her nostrils.\n On a narrow two-lane road, they encounter a station wagon going in the opposite direction. A hand from the driver’s window waves them down and the two cars pull up next to each other in the road, their noses inverted. Temple keeps a hand on her pistol and rolls down her window. It’s an older man and a younger man in the front seat, and in the backseat two women and a girl. The girl looks at her over the tops of the seats, her thumb in her mouth and a sooty-faced doll choked under her arm.\n The family is coming from Lafayette, headed through Baton Rouge to Slidell—heard there was a redoubt there, and it was getting tough where they were coming from.\n The girl’s eyes, sleepy and hypnotic, meet Temple’s and for a moment they are locked.\n Listen, the driver says, leaning closer to Temple through the window and lowering his voice. You have any shotgun ammo? We’ve only got a handful of shells left.\n What kind? Temple asks.\n Twelve gauge.\n All we got’s twenty.\n Oh.\n Hey, your girl like bingberries?\n She’s never had any.\n Here, says Temple, handing the remaining quarter tub of berries through the window. Fresh picked a couple days ago.\n We sure do appreciate it, the man says, taking the tub. She’s never gotten very much to cherish.\n It’s nothin. I had my fill and this dummy of mine don’t even like em. But make sure she don’t eat em all at once, they’ll give her the runs.\n Where you headed?\n West.\n He tells her she should take Levee Road north to the 190 instead of staying on this road.\n It’s a few miles out of your way, he says, but it’s safer. We just came across the Atchafalaya. There’s something on the other side. Some kind of town. You don’t want to go through there unless you’ve got no other choice. We saw some things.\n What things? Slugs?\n I don’t know what they were, the man says. Big is all I know. I wasn’t inclined to slow down and get a closer look.\n She thanks him and looks again at the girl in the backseat, the tangle of blond hair on her doll.\n All right then, I guess we’ll be going, the man says. It’s a beautiful day for a drive. Beautiful day.\n The cars pull away from each other, and she can see the station wagon receding in the rearview mirror, stretching taut the reflection of her own journey, like going back in time as though hours were roads with two directions.\n Marshland, long stretches of mudflat and barren reeds set asway by the hot breezes, a body here and there, festering in the muck and lit upon by carrion birds. A meatskin, finding himself stuck, unable to move, up to his neck in the mud, arms floating out crosswise as though he were treading water, motionless, nothing even to jaw at in this place of swamp and brittle grass. They come to a small rutted road leading off to the right. She supposes that’s the Levee Road the man told her about, but it’s in bad repair, a small shack toppled over onto it—she can see it in the distance.\n I reckon we can make it through whatever they made it through, she says and continues west down the swamp road.\n Soon the road rises up on concrete pylons and the swamp becomes a lake of thick brackish water beneath them, green slime shifting in slow eddies across the surface. The road ends halfway across the bridge, the tarmac surface ripped away from itself and collapsed into the muck. She stops the car and looks across the gap where the bridge continues a hundred yards away, the ragged end of the concrete bent like an aluminum antenna. So she turns the car around and drives back and takes a side road that looks like it might circle the lake to the south. The road follows a narrow brown river, scrub overgrowing the verge, styrofoam cups and other ancient garbage caught up in the thorny limbs of bushes.\n Around a bend she sees the thing in the distance. At first it looks like a man in the road, or a slug, but as she gets closer she realizes the thing is too big. It’s man-shaped, but it must be seven or eight feet tall. It lumbers along, a revenant, its arms swinging like heavy chains. When it hears the car behind it, it turns its head and she can see the face—human but disfigured, part of the skull exposed, one eye crazy wide and the other sleepy lidded, a pallor the color of moss or rot. But it’s not a slug, because when it sees the car it retreats into the trees with a weird sideways loping gait.\n Now what in holy hell was that? Temple says.\n She gets to the place in the road where the thing disappeared and pulls the car over. She leans out the window and scans the tree line, but there’s nothing to be seen.\n Hey! she calls into the dense brush. Hey, bigfoot! You can come out, I ain’t gonna hurt you.\n Next to her, in the passenger seat, Maury begins to moan, a long low wail absent of meaning.\n Hush up, she says. We’ll get movin again. I just gotta know what that giant was. Miracles’re sometimes hidden by unpleasing looks.\n She opens the door and steps out, putting on the panama hat and taking the gurkha knife in hand. In the car, Maury continues to moan.\n Come on, Maury, she says. Hush up, would ya? I’m listenin for the monster.\n She steps off the tarmac into the tangle of ropy weeds on the shoulder. Evening is coming, but the cicadas haven’t started up yet. Instead the birdsong preaches clipped and constant through the air.\n Come on out, monster, she says loud. You’re one of God’s own creatures. Ain’t no reason to hide.\n Pushing through some viney branches, she comes into a clearing and finds a sight that makes her hush—and not just her voice but every part of her, like feeling silence in her deep guts.\n At first she thinks it’s a row of dead infants all lined up, but then she sees they are pink plastic dolls. Baby dolls, some naked, some clothed in dirty, rain-blanched outfits, some with tangles of fake hair, and some bald with painted forelocks. And not all of them are complete. A couple are missing one arm, one has no limbs at all, and another is just a torso lying like a fleshy lozenge on the packed earth. Most are nested on cradles made of twigs, with leaves for pillows. She sees one that has been knocked askew, the twigs scattered and the doll lying facedown, its pink lace dress, stiff and reedy, twisted up to expose the legs bent backward in an unnatural way.\n It’s something she can feel in the back of her throat, her dislike of the scene—as though what she’s looking upon is unholy, the conjunction of chaos and order in a forced fit where everything is stretched and bent the wrong way like those baby legs.\n She hears the breathing behind her, a raspy, fluttering intake of breath—but her mind is gone to darker places, and by the time it comes back it’s too late. She turns to see the face a full two feet above her, skeletal and horrid, peeled half away, the bone dry and filthy gray, the gumless teeth, the intelligent eyes. Then she sees the arm like a tree limb, raised above her, and the stone clutched in the hand.\n And when the hand falls, her mind explodes with light.\n BY THE time she wakes, evening has fallen—the crickets and tree toads making their racket, the sky still umber with the leftover light of a sunken sun. She tries to get to her feet, but her head sways to right and left, and she can’t control it so she sits down hard and waits for the pounding and the nausea to go away. She finds the spot on the back of her head where the bump has raised. Her fingers come back bloody, and she can feel that it’s already begun to scab over. She’ll be all right if she can stop the world from leaping around. \n","sourceLink":"https://allnovel.net/the-reapers-are-the-angels-reapers-1/page-20.html","bookId":2516,"book":{"id":2516,"title":"The Reapers are the Angels (Reapers #1)","description":"Storyline: \n The Reapers are the Angels (Reapers #1) \n Zombies have infested a fallen America. A young girl named Temple is on the run. Haunted by her past and pursued by a killer, Temple is surrounded by death and danger, hoping to be set free. \n For twenty-five years, civilization has survived in meager enclaves, guarded against a plague of the dead. Temple wanders this blighted landscape, keeping to herself and keeping her demons inside her heart. She can\u0027t remember a time before the zombies, but she does remember an old man who took her in and the younger brother she cared for until the tragedy that set her on a personal journey toward redemption. Moving back and forth between the insulated remnants of society and the brutal frontier beyond, Temple must decide where ultimately to make a home and find the salvation she seeks.\n \n","cover":"https://allnovel.net/images/the-reapers-are-the-angels-reapers-1.jpg","author":"Alden Bell","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-reapers-are-the-angels-reapers-1.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:19:26 PM"}}
