{"id":69819,"no":10,"title":"Page 10","content":"I suppose many of you are familiar with the comic strip \"Peanuts.\" My daughter Robyn (now in the fourth grade) is very fond of it, as I am myself.\n She came to me one day, delighted with a particular sequence in which one of the little characters in \"Peanuts\" asks his bad-tempered older sister, \"Why is the sky blue,?\" and she snaps back, \"Because it isn\u0027t green!\"\n When Robyn was all through laughing, I thought I would seize the occasion to maneuver the conversation in the direction of a deep and subtle scientific discussion (entirely for Robyn\u0027s own good, you understand). So I said, \"Wen, tell me, Robyn, why is the night sky black?\"\n And she answered at once (I suppose I ought to have foreseen it), \"Because it isn\u0027t purple!\"\n Fortunately, nothing like this can ever seriously frustrate me. If Robyn won\u0027t cooperate, I can always turn, with a snarl, on the Helpless Reader. I will discuss the blackness of the night sky with youl\n Ile story of the black of night begins with a German physician and astronomer, Heinrich Wilhelm Matthias Olbers, bom in 1758. He practiced astronomy as a hobby, and in midlife suffered a peculiar disappointment. It came about in this fashion...\n Toward the end of the eighteenth century, astronomers began to suspect, quite strongly, that some sort of planet must exist between the orbits of Mars and Jupiter. A team of German astronomers, of whom Olbers was one of the most important, set themselves up with the intention of dividing the ecliptic among themselves and each searching his own portion, meticulously, for the planet.\n Olbers and his friends were so systematic and thorough that by rights they should have discovered the planet and received the credit of it. But life is funny (to coin a phrase).\n While they were still arranging the details, Giuseppe Piazzi, an Italian astronomer who wasn\u0027t looking for planets at all, discovered, on the night of January 1, 1801, a point of light which had shifted its position against the background of stars. He followed it for a period of time and found it was continuing to move steadily. It moved less rapidly than\n Mars and more rapidly than Jupiter, so it was very likely a planet in an intermediate orbit. He reported it as such so :hat it was the casual Piazzi and not the thorough Olbers who got the nod in the history books.\n Olbers didn\u0027t lose out altogether, however. It seems that after a period of time, Piazzi fell sick and was unable to continue his observations. By the time he got back to the telescope the planet was too close to the Sun to be observ able.\n Piazzi didn\u0027t have enough observations to calculate an orbit and this was bad. It would take months for the slow-moving planet to get to the other side of the Sun and into observable position, and without a calculated orbit it might easily take years to rediscover it.\n Fortunately, a young German mathematician, Karl Friedrich Gauss, was just blazing his way upward into the mathematical firmament. He had worked out something called the \"method of least squares,\" which made it possible to calculate a reasonably good orbit from no more than three good observations of a planetary position.\n Gauss calculated the orbit of Piazzi\u0027s new planet, and when it was in observable range once more there was Olbers and his telescope watching the place where Gauss\u0027s calcula tions said it would be. Gauss was right and, on January 1, 1802, Olbers found it.\n To be sure, the new planet (named \"Ceres\") was a peculiar one, for it turned out to be less than 500 miles in diameter. It was far smaller than any other known planet and smaller than at least six of the satellites known at that time.\n Could Ceres be all that existed between Mars and Jupiter? The German astronomers continued looking (it would be a shame to waste all that preparation) and sure enough, three more planets between Mars and Jupiter were soon discovered. Two of them, Pallas and Vesta, were dis covered by Olbers. (In later years many more were discovered.)\n But, of course, the big payoff isn\u0027t for second place. All Olbers got out of it was the name of a planetoid. The thou sandth planetoid between Mars and Jupiter was named \"Piazzia,\" the thousand and first \"Gaussia,\" and the thou sand and second (hold your breath, now) \"Olberia.\"\n Nor was Olbers much luckier in his other observations.\n He specialized in comets and discovered five of them, but practically anyone can do that. There is a comet called \"Olbers\u0027 Comet\" in consequence, but that is a minor dis tinction.\n Shall we now dismiss Olbers? By no means.\n It is hard to tell just what will win you a place in the annals of science. Sometimes it is a piece of interesting reverie that does it. In 1826 Olbers indulged himself in an idle speculation concerning the black of night and dredged out of it an\u0027apparently ridiculous conclusion.\n Yet that speculation became \"Olbers\u0027 paradox,\" which has come to have profound significance a century after ward. In fact, we can begin with Olbers\u0027 paradox and end with the conclusion that the only reason life exists any where in the universe is that the distant galaxies are reced ing from us.\n What possible effect can the distant galaxies have on us?\n Be patient now and we\u0027ll work it out.\n In ancient times, if any astronomer had been asked why the night sky was black, he would have answered-quite reasonably-that it was because the light of the Sun was absent. If one had then gone on to question him why the stars did not take the place of the Sun, he would have answered-again reasonably-that the stars were limited in number and individually dim. In fact, all the stars we can see would, if lumped together, be only a half-birionth as bright as the Sun. Their influence on the blackness of the night sky is therefore insignificant.\n By the nineteenth century, however, this last argument had lost its force. The number of stars was tremendous.\n Large telescopes revealed them by the countless millions.\n Of course, one might argue that those countless millions of stars were of no importance for they were not visible to the naked eye and therefore did not contribute to the light in the night sky. This, too, is a useless argument. The stars of the Milky Way are, individually, too faint to be made out, but en masse they make a dimly luminous belt about the sky. The Andromeda galaxy is much farther away than the stars of the Milky Way and the individual stars that make it up are not individually visible except (just barely) in a very large telescope. Yet, en masse, the Andromeda galaxy is faintly visible to the naked eye. (It\u0027is, in fact, the farthest object visible to the unaided eye; so if anyone ever asks you how far you can see; tell him 2,000,000 light years.)\n In short distant stars-no matter how distant and no matter how dim, individually-must contribute to the light of the night sky, and this contribution can even become detectable without the aid of instruments if these dim distant stars exist in sufficient density.\n Olbers, who didn\u0027t know about the Andromeda galaxy, but did know about the Milky Way, therefore set about asking himself how much light ought to be expected from the distant stars altogether. He began by making several assumptions:\n 1. That the universe is infinite in extent.\n 2. That the stars are infinite in number and evenly spread throughout the universe.\n 3. That the stars are of uniform average brightness through all of space.\n Now let\u0027s imagine space divided up into shells (like those of an onion) centering about us, comparatively thin. shells compared with the vastness of space, but large enough to contain stars within them.\n Remember that the amount of light that reaches us from individual stars of equal luminosity varies inversely as the square of the distance from us. In other words, if Star A and Star B are equally bright but Star A is three times as far as Star B, Star A delivers only % the light. If Star A were five times as far as Star B, Star A would deliver 1/2r, the light, and so on.\n This holds for our shells. The average star in a shell 2000 light-years from us would be only 1/4 as bright in appearance as the average star in a shell only 1000 light years from us. (Assumption 3 tells us, of course, that the intrinsic brightness of the average star in both shells is the same, so that distance is the only factor we need consider.)\n Again, the average star in a shell 3000 light-years from us would be only % as bright in appearance as the average star in the 10004ight-year shell, and so on.\n But as you work your way outward, each succeeding shell is more voluminous than the one before. Since each shell is thin enough to be considered, without appreciable error, to be the surface of the sphere made up of all the shells within, we can see that the volume of the shells in creases as the surface of the spheres would-that is, as the square of the radius. The 2000-light-year shell would have four times the volume of the 1000-light-year shell.\n The 3000-light-year shell would have nine times the volume of the 1000-light-year shell, and so on.\n If we consider the stars to be evenly distributed through space (Assumption 2), then the number of stars in any given shell is proportional to the volume of the shell. If the 2000-light-year shell is four times as voluminous as the 1000-light-year shell, it contains four times as many stars.\n If the 3000-light-year shell is nine times as voluminous as the 1000-light-year shell, it contains nine times as many stars, and so on.\n Well, then, if the 2000-light-year shell contains four ,times as many stars as the IOOG-light-year shell, and if each star in the former is % as bright (on the average) as each star of the latter, then the total light delivered by the 20GO-light-year shell is 4 times Y4 that of the 1000 fight-year shell. In other words, the 2000-light-year shell delivers just as much total light as the 1000-light-year shell. The total brightness of the 3000-light-year shell is 9 times % that of the 1000-light-year shell, and the bright ness of the two shells is equal again.\n In summary, if we divide the universe into successive shells, each shell delivers as much light, in toto, as do any of the others. And if the universe is infinite in extent (As sumption 1) and therefore consists of an finate number of shells, the stars of the universe, however dim they may be individually, ought to deliver an infinite amount of light to the Earth.\n The one catch, of course, is that the nearer stars may block the light of the more distant stars.\n To take this into account, let\u0027s look at the problem in another way. In no matter which direction one looks, the eye will eventually encounter a star, if it is true they are infinite in number and evenly distributed in space (As sumption 2). The star may be individually invisible, but it will contribute its bit of light and will be immediately adjoined in all directions by other bits of light.\n The night sky would then not be black at all but would be I an absolutely solid smear of starlight. So would the day sky be an absolutely solid smear of starlight, with the Sun itself invisible against the luminous background.\n Such a sky would be roughly as bright as 150,000 suns like ours, and do you question that under those conditions life on Earth would be impossible?\n However, the sky is not as bright as 150,000 suns. The night sky is black. Somewhere in the Olbers\u0027 paradox there is some mitigating circumstance or some logical error..\n Olbers himself thought he found it. He suggested that space was not truly transparent; that it contained clouds of dust and gas which absorbed most of the starlight, allowing only an insignificant fraction to reach the Earth.\n That sounds good, but it is no good at all. There are indeed dust clouds in space but if they absorbed all the starlight that fell upon them (by the reasoning of Olbers\u0027 paradox) then their temperature would go up until they grew hot enough to be luminous. They would, eventually, emit as much light as they absorb and the Earth sky would still be star-bright over all its extent.\n But if the logic of an argument is faultless and the con clusion is still wrong, we must investigate the assumptions.\n What about Assumption 2, for instance? Are the stars in deed infinite in number and evenly spread throughout the universe?\n Even in Olbers\u0027 time there seemed reason to believe this assumption to be false. The German-English astronomer William Herschel made counts of stars of different bright ness. He assumed that, on the average, the dimmer stars were more distant than the bright ones (which follows from Assumption 3) and found that the density of the stars in space fell off with distance.\n From the rate of decrease in density in different direc tions, Herschel decided that the stars made up a lens shaped figure. The long diameter, he decided, was 150 times the distance from the Sun to Arcturus (or 6000 light-years, we would now say), and the whole conglomer ation would consist of 100,000,000 stars.\n This seemed to dispose of Olbers\u0027 paradox. If the lens shaped conglomerate (now called the Galaxy) truly con tained all the stars in existence, then Assumption 2 breaks down. Even if we imagined space to be infinite in extent outside the Galaxy (Assumption 1), it would contain no stars and would contribute no illumination. Consequently, there would be only a finite number of star-containing shells and only a finite (and not very large) amount of illumination would be received on Earth. That would be why the night sky is black.\n The estimated size of the Galaxy has been increased since Herschel\u0027s day. It is now believed to be 100,000 light-years in diameter, not 6000; and to contain 150,000, 000,000 stars, not 100,000,000. This change, however, is not crucial; it still leaves the night sky black.\n In the twentieth century Olbers\u0027 paradox came back to life, for it came to be appreciated that there were indeed stars outside the Galaxy.\n The foggy patch in Andromeda had been felt through out the nineteenth century to be a luminous mist that formed part of our own Galaxy. However, other such patches of mist (the Orion Nebula, for instance) contained stars that lit up the mist. The Andromeda patch, on the other hand, seemed to contain no stars but to glow of itself.\n Some astronomers began to suspect the truth, but it wasn\u0027t definitely established until 1924, when the Amer ican astronomer Edwin Powell Hubble turt\u0027ied the 100 inch telescope on the glowing mist and was able to make out separate stars in its outskirts. These stars were in dividually so dim that it became clear at once that the patch must be hundreds of thousands of light-years away from us and far outside the Galaxy. Furthermore, to be seen, as it was, at that distance, it must rival in size our entire Galaxy and be another galaxy in its own right.\n And so it is. It is now believed to be over 2,000,000 light-years from us and to contain at least 200,000,000, 000 stars. Still other galaxies were discovered at vastly greater distances. Indeed, we now suspect that within the observable universe there are at least 100,000,000,000 galaxies, and the distance of some of them has been esti mated as high as 6,000,000,000 light-years.\n Let us take Olbers\u0027 three assumptions then and substi tute the word \"galaxies\" for \"stars\" and see how they sound.\n Assumption 1, that the universe is infinite, sounds good.\n At least there is no sign of an end even out to distances of billions of light-years.\n Assumption 2, that galaxies (not stars) are infinite in number and evenly spread throughout the universe, sounds good, too. At least they are evenly distributed for as far out as we can see, and we can see pretty far.\n Assumption 3, that galaxies (not stars) are of uniform average brightness throughout space, is harder to handle.\n However, we have no reason to suspect,-6at distant galaxies are consistently larger or smaller than nearby ones, and if the galaxies come to some uniform average size and star-content, then it certainly seems reasonable to suppose they are uniformly bright as well.\n Well, then, why is the night sky black? We\u0027re back to that.\n Let\u0027s try another tack. Astronomers can determine whether a distant luminous object is approaching us- or receding from us by studying its spectrum (that is, its lijzht as spread out in a rainbow of wavelengths from short wavelength violet to long-wavelength red).\n The spectrum is crossed by dark lines which are in a fixed position if the object is motionless with respect to us. If the object is approaching us, the lines shift toward the violet. If the object is receding from us, the lines shift toward the red. From the size of the shift astronomers can determine the velocity of approach or recession.\n In the 1910s and 1920s the spectra of some galaxies (or bodies later understood to be galaxies) were studied, and except for one or two of the very nearest, all are re ceding from us. In fact, it soon became apparent that the farther galaxies are receding more rapidly than the nearer ones. Hubble was able to formulate what is now called \"Hubble\u0027s Law\" in 1929. This states that the velocity of recession of a galaxy is proportional to its distance from us. If Galaxy A is twice as far as Ga laxy D, it is receding at twice the velocity. The farthest observed galaxy, 6,000, 000,000 light-years from us, is receding at a velocity half that of light.\n The reason for Hubble\u0027s Law is taken to lie in the ex pansion of the universe itseff-an expansion which can be made to follow from the equations set up by Einstein\u0027s General Theory of Relativity (which, I hereby state firmly, I will not go into).\n Given the expansion of the universe, now, how are Olbers\u0027 assumptions affected?\n If, at a distance of 6,000,000,000 light-years a galaxy recedes at half the speed of light, then at a distance of 12,000,000,000 light-years a galaxy ought to be receding at the speed of light (if Hubble\u0027s Law holds). Surely, further distances are meaningless, for we cannot halve velocities greater than that of light. Even if that were pos sible, no light, or any other \"message\" could reach us from such a more-distant galaxy and it would not, in effect, be in our universe. Consequently, we can imagine the universe to be finite after all, with a \"Hubble radius\" of some 12,000,000,000 light-years.\n But that doesn\u0027t wipe out Olbers\u0027 paradox. Under the requirements of Einstein\u0027s theories, as galaxies move faster and faster relative to an observer, they become shorter and shorter in the line of travel and take up less and less space, so that there is room for larger and larger numbers of galaxies. In fact, even in a finite universe, with a radius of 12,000,000,000 light-years, there might still be an in finite number of galaxies; almost all of them (paper-thin) existing in the outermost few miles of the Universe-sphere.\n So Assumption 2 stands even if Assumption I does not; and Assumption 2, by itself, can be enough to insure a star-bright sky.\n But what about the red shift?\n Astronomers measure the red shift by the change in position of the spectral lines, but those lines move only because the entire spectrum moves. A shift to the red is a shift in the direction of lesser energy. A receding galaxy delivers less radiant energy to the Earth than the same galaxy would deliver if it were standing still relative to us - just because of the red shift. The faster a galaxy recedes the less radiant energy it delivers. A galaxy receding at the speed of light delivers no radiant energy at all no matter how bright it might be.\n Thus, Assumption 3 falls! It would hold true if the uni verse were static, but not if it is expanding. Each succeed ing shell in an expanding universe delivers less light than the one within because its content of galaxies is succes sively farther from us; is subjected to a successively greater red shift; and falls short, more and more, of the expected radiant energy it might deliver.\n And because Assumption 3 fails, we receive only a finite amount of energy from the universe and the night sky is black.\n According to the most popular models of the universe, this expansion will always continue. It may continue with out the production of new galaxies so that, eventually, billions of years hence, our Galaxy (plus a few of its neighbors, which together make up the \"local cluster\" of galaxies) will seem alone in the universe. AU the other galaxies will have receded too far to detect. Or new galaxies may continuously form so that, the universe will always seem full of galaxies, despite its expansion. Either way, however, expansion will continue and the night sky will remain black.\n There is another suggestion, however, that the universe oscillates; that -the expansion will gradually slow down until the universe comes to a moment of static pause, then begins to contract again, faster and faster, till it tightens at last into a small sphere that explodes and brings about a new expansion.\n If so, then as the expansion slows the diinming effect of the red shift will diminish and the night sky will slowly brighten. By the time the universe is static the sky will be uniformly star-brigbt as Olbers\u0027 paradox required. Then, once the universe starts contracting, there will be a \"violet shift\" and the energy delivered will increase so that the sky will become far brighter and still brighter.\n This will be true not only for the Earth (if it still existed in the far future of a contracting universe) but for any body of any sort in the universe. In a static or, worse still, a contracting universe there could, by Olbers\u0027 paradox, be no cold bodies, no solid bodies. There would be uniform high temperatures everywhere-in the millions of degrees, I suspect-and life simply could not exist.\n So I get back to my earlier statement. The reason there is life on Earth, or anywhere in the universe, is simply that the\u0027distant galaxies are moving away from us.\n In fact, now that we know the ins and outs of Olbers\u0027 paradox, might we, do you suppose, be able to work out the recession of the distant galaxies as a necessary conse quence of the blackness of the night sky? Maybe we could amend the famous statement of the French philosopher Rene Descartes.\n He said, \"I think, therefore I am!\"\n And we could add: \"I am, therefore the universe ex pandsl\" \n","sourceLink":"https://allnovel.net/of-time-space-and-other-things/page-10.html","bookId":1738,"book":{"id":1738,"title":"Of Time, Space, and Other Things","description":"Storyline: \n DOOMED PLANET They called him \u0027Crazy Rik\u0027 - but only he knew that the planet was doomed with all its people. The only key to the vital information that could save it was locked in the subconscious memory of this strange, child-minded man...a memory obliterated by a psychic probe!\n \n","cover":"https://allnovel.net/images/of-time-space-and-other-things.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/of-time-space-and-other-things.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:14:28 AM"}}
