{"id":80872,"no":17,"title":"Page 17","content":"Oh, no... Rebecca felt a welling rush of sadness inside as she stared after Steve, John and David both grim and silent beside her. The blank shock on Steve\u0027s face before he\u0027d turned away told them what must have happened.\n Poor Karen. And Steve, what must it have been like...\n They\u0027d found the lab too late. She glanced down at the key card slot next to the door as she stepped into the double seal, feeling a horrible sense of futility at the pointlessness of it all. They\u0027d come to find infor- mation, only to find tests, only for Karen to get infected and then to turn against Steve even as they\u0027d reached the one chance they might have had to cure her...\n ... but Kinneson. Thurman...\n She stepped through the second door, frowning. The laboratory was huge, counters lined with equip- ment, desks piled incredibly high with stacks of paper, but it was the open hatch across from them that first commanded her attention, her gaze immedi- ately drawn to the thick sheet of plexi or reinforced glass set into the thick door. It was an airlock, the inner door standing open. And behind the second sealed door, past a mesh grate, the dark waters of the ocean swirled past, bubbles spinning by. The laboratory was underwater. The second thing she noticed was the blood, a thick trail of crimson leading across the concrete floor in splatters and pools, but ending in a sliding smear.\n Steve must have moved a body -\n -so much! God, not Karen\u0027s...\n Steve had walked to the airlock and turned, seemed to be waiting for them to cross the room. Rebecca started toward him, her throat tight with sympathy and swelling tears. John and David were right behind her, quiet, looking around the vast room -\n - when behind them, the door back into the pas- sage slammed shut. They spun around, saw Kinneson standing there, holding a tiny semi-automatic, a.25, pointing it at them with no expression on his face.\n \"Drop your weapons.\"\n The low, quiet voice was Steve\u0027s. Rebecca turned again, confused and saw Steve pointing his Beretta at them, his face as blank as Kinneson\u0027s. Now that she was close enough to the airlock, she saw the body on the grated floor. It was Karen, her white face streaked with blood, a gaping blackness where her left eye had been.\n Oh, my God, what\u0027s going on...\n David stepped toward him, holding his Beretta loosely, confusion and disbelief in his voice. \"Steve, what are you doing? What\u0027s happened?\"\n \"Drop your weapons,\" Steve said again. His voice had no emotion at all.\n \"What did you do to him?!\"\n John screamed, turned and fired at Kinneson, the round punching neatly through his left temple. Kin- neson crumpled, sagging... Boom! The second shot came from Steve\u0027s Beretta, hitting John in the lower back. Blood gushed from the hole and as he staggered halfway around, Rebecca saw the dark fluid trickling from his mouth, the dazed disbe- lief in his eyes......and John crashed to the cement, spasming once before he lay motionless. It had all happened in the space of a few seconds. \"Drop your weapons,\" Steve said calmly. He pointed his semi at Rebecca. For a moment, Rebecca could do nothing at all. She stared at Steve in horror, felt tears slipping down her frozen cheeks, unable to comprehend what had hap- pened. \"Disarm,\" David said quietly, letting his slip from his fingers and clatter to the floor. Rebecca dropped the Beretta, the heavy weapon falling from her equally heavy fingers. \"Back up,\" Steve said, still aiming at her chest. \"Do as he says,\" David said, his voice trembling just slightly. They stepped back slowly, Rebecca unable to take her eyes from Steve\u0027s face, the handsome, boyish face she\u0027d grown to care about. Now it was only a mask, worn by a...\n ... by a zombie.\n They backed into a desk and stopped, watching dully as Steve moved to pick up their weapons, Rebecca\u0027s mind whirling with more than just horror and loss. A zombie that could walk and talk like a man. Like Kinneson. Like Steve.\n How? When did this happen?\n As Steve stepped away, a pleasant male voice came out of the corner of the room, from behind a desk.\n \"All finished, then? My God, what a Greek tragedy...\"\n The voice was followed by an appearance. A slen- der, gray-haired man stood up and walked around the desk, moving almost casually to stand by Steve. He was in his mid-fifties, his hair long enough to brush at the collar of his lab coat, his lined face sporting a beaming smile.\n \"I\u0027ll repeat my instructions for the benefit of our guests,\" the man said happily. \"If either of them makes any sudden moves, shoot them.\"\n Rebecca knew who he was immediately, knew that she hadn\u0027t been wrong after all. \"Dr. Griffith,\" she said quietly. Griffith arched an eyebrow, seeming amused. \"My reputation precedes me! How did you know?\" \"I\u0027ve heard about you,\" she said coldly. \"Or Nic-olas Dunne, anyway.\" His smile froze, then widened again. \"All in the past,\" he said dismissively, waving one hand in the air. \"And you\u0027ll never have a chance to tell anyone about the pleasure of our acquaintance, I\u0027m afraid.\"\n Griffith\u0027s smile faded, his dark blue gaze turning icy. \"You people have held me up long enough. I\u0027m tired of this game, so I believe that I\u0027m going to have your nice young man kill you...\"\n He brightened suddenly, and Rebecca saw the mad- ness flashing in those eyes, the complete break from sanity.\n \"Now that I think of it, why create even more of a mess? Steve, tell our friends to get into the airlock, if you would be so kind.\"\n Steve kept his weapon trained on her heart. \"Get into the airlock,\" he said calmly.Before David could take a step, Rebecca started talking, fast and deadly serious.\n \"Was it the T-Virus? Did you use that as a platform for whatever this is? I know you were responsible for the increase in amplification time, but this is some-thing new, this is something that Umbrella doesn\u0027t even know about. It\u0027s a mutagen with an instantane-ous membrane fusion, isn\u0027t it?\" Griffith\u0027s eyes widened. \"Steve, wait... what do you know about membrane fusion, little girl?\" \"I know that you\u0027ve perfected it. I know that you\u0027ve managed to create a rapid fuse virion that apparently infects the brain tissue in under an hour...\" \"In under ten minutes,\" Griffith said, his whole demeanor changing from that of a smiling old man to that of a fanatic, his gaze narrowing with a danger-ously brilliant intensity, his lips drawing tight over clenched teeth.\n \"These stupid, stupid animals with their ridiculous T-Virus! Birkin may have a mind, but the rest of them amp;K fools, playing with war games while I\u0027ve created a miracle!\"\n He turned, gesturing at a row of shining oxygen tanks next to the lab\u0027s entrance. \"Do you know what that is, do you know what I\u0027ve managed to synthesize? Peace! Peace and the freedom from choice for all of mankind!\"\n David felt his heart start to pound viciously, his entire body breaking out in a cold sweat. Griffith was pacing in front of them now, his eyes burning with mad genius.\n \"There\u0027s enough of my strain, of my creation in those tanks to infect a billion people in less than twenty-four hours! I\u0027ve managed to find the answer, the answer to the pitiful, selfish, and self-important breed that the human race has become - when I give my gift to the wind, the world will become free again, it will be reborn, a simple and beautiful place for every creature, great and small, surviving on instinct alone!\" \"You\u0027re insane,\" David breathed, knowing that Griffith could kill them, was going to kill them, but unable to stop himself from saying it. \"You\u0027re out of your bloody mind!\" This is why my team is dead, why all those people are dead. He wants to turn the world into things like Kinneson. Like Steve.\n Griffith snarled at him, flecks of spittle flying from his lips. \"And you\u0027re dead. You\u0027re not going to be here when my miracle graces this earth, I, I deprive you of my gift, both of you! When the sun comes up tomorrow, there will be peace, and neither of you will ever know a second of it!\" He whirled around, pointing at Steve. \"Put them in the airlock, now!\"\n Steve raised the Beretta again, motioning toward the opened hatch, where Karen\u0027s lifeless body layslumped and bloody on the floor. He\u0027s out of reach, can\u0027t grab the weapon in time...\n \"Steve, now! Kill them if they won\u0027t go!\"\n David and Rebecca stepped into the lock, David\u0027s body cold, tensed, he had to do something or the world would be infected by this maniac\u0027s psychotic dream... Steve slammed the lock closed. They were trapped. \n","sourceLink":"https://allnovel.net/caliban-cove-resident-evil-2/page-17.html","bookId":2457,"book":{"id":2457,"title":"Caliban Cove (Resident Evil #2)","description":"Storyline: \n The novel takes place between the events of the Umbrella Conspiracy (Resident Evil 1) and City of the Dead (Resident Evil 2) \u0026 Nemesis (Resident Evil 3) and centers around Rebecca Chambers. After a call from Barry about the Umbrella investigation, she heads to his house where she meets David Trapp, strategist and captain of the STARS Exeter branch. David informs Rebecca that another incident has occurred at another Umbrella facility, in Caliban Cove, Maine. Just when Chris and Jill come in, David continues his briefing, which includes a list of people involved in or with the Caliban Cove facility. One of the names Rebecca knows as Nicholas Griffith, a former biochemist who had disappeared after being fired from a university. Umbrella forces, led by STARS members, attack Barry\u0027s house. Rebecca takes one out; some others are suspected to be dead. The team takes refuge in Brad \"Chickenheart\" Vicker\u0027s home. After a little talk, Rebecca and David set out and leave on a plane for Exeter.\n \n","cover":"https://allnovel.net/images/caliban-cove-resident-evil-2.jpg","author":"S.D. Perry","type":"Horror","source":"allnovel","link":"https://allnovel.net/caliban-cove-resident-evil-2.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:30:09 PM"}}
