{"id":77829,"no":9,"title":"Page 9","content":"There was a man in a porter’s lodge in the small hallway. As they came in, he looked up from the sports section of The News. “Hi,” he said to the driver. He looked sharply at Bond.\n “Hi,” said the driver. “Mind if we leave the bags with you?”\n “Go ahead,” said the man. “Be okay in here.” He jerked his head back.\n The driver, with Bond’s clubs over his shoulder, waited for Bond beside the doors of an elevator across the hall. When Bond followed him inside, he pressed the button for the fourth floor and they rode up in silence. They emerged into another small hallway. It contained two chairs, a table, a large brass spittoon and a smell of stale heat.\n They crossed the frayed carpet to a glass-fronted door and the driver knocked and walked through without waiting for an answer. Bond followed him and shut the door.\n A man with very bright red hair and a big peaceful moon-shaped face was sitting at a desk. There was a glass of milk in front of him. He stood up as they came in and Bond saw he was a hunchback. Bond didn’t remember having seen a red-haired hunchback before. He could imagine that the combination would be useful for frightening the small fry who worked for the gang.\n The hunchback moved slowly round the desk and over to where Bond was standing. He walked round-Bond, making a show of examining him minutely from head to foot, and then he came and stood close in front of Bond and looked up into his face. Bond looked impassively back into a pair of china eyes that were so empty and motionless that they might have been hired from a taxidermist. Bond had the feeling that he was being subjected to some sort of test. Casually he looked back at the hunchback, noting the big ears with rather exaggerated lobes, the dry red lips of the big half-open mouth, the almost complete absence of a neck, and the short powerful arms in the expensive yellow silk shirt, cut to make room for the barrel-like chest and its sharp hump.\n “I like to have a good look at the people we employ, Mr Bond.” The voice was sharp and pitched high.\n Bond smiled politely.\n “London tells me you have killed a man. I believe them. I can see you are capable of it. Would you like to do more work for us?”\n “It depends what it is,” said Bond. “Or rather,” he hoped he was not being too theatrical, “how much you pay.”\n The hunchback gave a short squeal of laughter. He turned abruptly to the driver. “Rocky, get those balls out of the bag and cut them open. Here”; he gave a quick shake of his right arm and held his open hand out to the driver. On it lay a double-bladed knife with a flat handle bound with adhesive tape. Bond recognized it as a throwing knife. He had to admit that the bit of legerdemain had been neatly executed.\n “Yes, boss,” said the driver, and Bond noticed the alacrity with which he took the knife and knelt on the floor to unstrap the ball-pocket of the golf bag.\n The hunchback walked away from Bond and back to his chair. He sat down and picked up the glass of milk. He looked at it with distaste and swallowed the contents in two huge gulps. He looked at Bond as if for comment.\n “Ulcers?” asked Bond sympathetically.\n “Who spoke to you?” said the hunchback angrily. His anger was transferred to the driver. “What are you waiting for, Rocky? Put those balls on the table where I can see what you’re doing. The number on the ball is the centre of the plug. Dig ‘em out.”\n “Coming, boss,” said the driver. He stood up from the floor and put the six new balls on the desk. Five of them were still in their black wrapping. He took the sixth and turned it round in his fingers. Then he picked up the knife and dug its point into the cover of the ball and levered. A half-inch circular section of the ball came away on the tip of the blade and he passed the ball across the desk to the hunchback, who tipped the contents, three uncut stones of ten to fifteen carats, on to the leather surface of the desk.\n The hunchback moodily poked the stones with his finger.\n The driver went on with his work until Bond counted eighteen stones on the table. They were unimpressive in their rough state but if they were of top quality Bond could easily believe they might be worth £100,000 after cutting.\n “Okay, Rocky,” said the hunchback. “Eighteen. That’s the lot. Now get those goddam golf-sticks out of here and send the boy to the Astor with them and this guy’s bags. He’s registered there. Have them sent up to his room. Okay?”\n “Okay, boss.” The driver left the knife and the empty golf balls on the table, strapped up the ball-pocket on Bond’s bag, hoisted the bag on his shoulder and left the room.\n Bond went over to a chair against the wall, pulled it over to face the hunchback across the desk and sat down. He took a cigarette and lit it. He looked across at the hunchback and said “And now, if you’re happy, I’d be glad of those $5000.”\n The hunchback, who had been carefully watching Bond’s movements, lowered his eyes to the untidy pile of diamonds in front of him. He poked them into a circle. Then he looked up at Bond.\n “You will be paid in full, Mr Bond,” the high voice was precise and businesslike. “And you may get more than $5000. But the method of payment will be devised as much for your protection as for ours. There will be no direct payment. And you will understand why, Mr Bond, because you will have made pay-offs during your career of burglary. It is very dangerous for a man suddenly to be flush with money. He talks about it. He throws it around. And if the cops catch up with him and ask him where it all came from he hasn’t got an answer. Agree?”\n “Yes,” said Bond surprised by the sanity and authority of what the man was saying. “That makes sense.”\n “So,” said the hunchback, “I and my friends pay only very seldom and in small amounts for services rendered. Instead, we arrange for the guy to make the money on his own account. Take yourself. How much money have you got in your pocket?”\n “About three pounds and some silver,” said Bond.\n “All right,” said the hunchback. “Today you met your friend Mr Tree.” He pointed a finger at his chest. “Which is me. A perfectly respectable citizen whom you knew in England in 1945 when he was concerned with the disposal of Army surplus goods. Remember?”\n “Yes.”\n “I owed you $500 for a bridge game we had at the Savoy. Remember?”\n Bond nodded.\n “When we meet today I toss you double or quits for it. And you win. Okay? So you now have $1000 and I, a tax-paying citizen, will support your story. Here is the money.” The hunchback took a wallet out of his hip-pocket and pushed ten $100 bills across the table.\n Bond picked them up and put them casually in the pocket of his coat.\n “And then,” continued the hunchback, “you say you’d like to see some horse-racing while you’re over here. So I say to you ‘Why not go and take a look at Saratoga? The meeting begins on Monday.’ And you say okay, and you go on up to Saratoga, with your thousand bucks in your pocket. Okay?”\n “Fine,” said Bond.\n “And you back a horse there. And it pays off at least fives. So you have your $5000 and if anybody asks where it came from, you earned it and you can prove it.”\n “What if the horse loses?”\n “It won’t.”\n Bond made no comment. So he was getting somewhere already-into the gangster world with a bang. The racing end of it. He looked across into the pale china eyes. It was impossible to tell whether they were receptive. They stared blankly back at him. But now for the big step through the cut-out.\n “Well, that’s fine,” said Bond, hoping that flattery was the key. “You people certainly seem to think things out. I like working for careful people.”\n There was no encouragement in the china eyes.\n “I’d like to stay away from England for a bit. I suppose you couldn’t do with an extra hand?”\n The china eyes shifted away from his and inched reflectively over Bond’s face and shoulders as if the hunchback was judging horseflesh. Then the man looked down at the circle of diamonds in front of him and carefully, thoughtfully, poked it into a square.\n There was silence in the room. Bond looked at his fingernails.\n At last the hunchback looked up at him again. “Could be,” he said thoughtfully. “Could be there’d be something else for you. You made no mistakes so far. You go on that way and keep your nose clean. Call me up after the race and I’ll tell you what the word is. But, like I said, just take it easy and do what you’re told. Okay?”\n Bond’s muscles relaxed. He shrugged his shoulders. “Why should I get out of line? I’m looking for a job. And you can tell your outfit that I’m not particular so long as the pay’s good.”\n For the first time the china eyes showed emotion. They looked hurt and angry and Bond wondered if he had overplayed.\n “Who d’you think we are?” the hunchback’s voice rose to an indignant squeak. “Some sort of a cheap crook outfit? Well, hell.” He shrugged his shoulders resignedly. “Can’t expect a Limey to understand the way things are over here these days.” The eyes went dull again. “Now listen to what I say. This is my number. Put it down. Wisconsin 7-3697. And write this down, too. But keep it to yourself or you may get your tongue cut out.” Shady Tree’s short, shrill laugh was not merry. “Fourth race on Tuesday. The Perpetuities Stakes. Mile and a quarter for Three Year Olds. And put your money on just before the windows close. You’ll shift the odds with that Grand of yours. Okay?”\n “Okay,” said Bond, a pencil poised obediently over his notebook.\n “Right,” said the hunchback. “Shy Smile. Big horse with a blaze face and four white stockings. And play him to win.”\n 8\n THE EYE THAT NEVER SLEEPS\n IT was 12.30 when Bond went down in the elevator and out on to the roasting street.\n He turned right and walked slowly down towards Times Square. As he passed the handsome black marble frontage of the House of Diamonds, he stopped to examine the two discreet show-windows lined with dark blue velvet. In the centre of each there was just one piece of jewellery, an ear-ring consisting of a big pear-shaped diamond hanging from another perfect stone, circular and brilliant-cut. Below each ear-ring there was a thin plate of yellow gold, in the shape of a visiting card with one edge turned down. On each plate was engraved the words Diamonds are Forever.\n Bond smiled to himself. He wondered which of his predecessors had smuggled those four diamonds into America.\n Bond sauntered on in search of an air-conditioned bar where he could get out of the heat and do some thinking. He was pleased with his interview. At least it hadn’t been the brush-off he had more than half expected. He was amused by the hunchback. There was something splendidly theatrical about him, and his vanity about the Spangled Mob was appealing. But he wasn’t at all funny.\n Bond had walked for only a few minutes when it suddenly occurred to him that he was being followed. There was no evidence for it except a slight tingling of the scalp and an extra awareness of the people near him, but he had faith in his sixth sense and he at once stopped in front of the shop window he was passing and looked casually back along 46th Street. Nothing but a lot of miscellaneous people moving slowly on the sidewalks, mostly on the same side as himself, the side that was sheltered from the sun. There was no sudden movement into a doorway, nobody casually wiping his face with a handkerchief to avoid recognition, nobody bending down to tie a shoelace. \n","sourceLink":"https://allnovel.net/diamonds-are-forever-james-bond-4/page-9.html","bookId":2427,"book":{"id":2427,"title":"Diamonds Are Forever (James Bond #4)","description":"Storyline: \n Diamonds Are Forever (James Bond (Original Series) #4) \n \"Listen, Bond,\" said Tiffany Case. \"It’d take more than Crabmeat Ravigotte to get me into bed with a man. In any event, since it’s your check, I’m going to have caviar, and what the English call “cutlets”, and some pink champagne. I don’t often date a good-looking Englishman and the dinner’s going to live up to the occasion.\" \n Meet Tiffany Case, a cold, gorgeous, devil-may-care blonde; the kind of girl you could get into a lot of trouble with—if you wanted. She stands between James Bond and the leaders of a diamond-smuggling ring that stretches from Africa via London to the States. Bond uses her to infiltrate this gang, but once in America the hunter becomes the hunted. Bond is in real danger until help comes from an unlikely quarter, the ice-maiden herself …\n \n","cover":"https://allnovel.net/images/diamonds-are-forever-james-bond-4.jpg","author":"Ian Fleming","type":"Mystery","source":"allnovel","link":"https://allnovel.net/diamonds-are-forever-james-bond-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:40:10 PM"}}
