{"id":88528,"no":11,"title":"Page 11","content":"Sorrow met her eyes with a mischievous twinkle. “Don’t you mean woman the tables, Dad?” “I don’t care who does it. All I know is Helen’s not here yet.” “Helen needs to step up,” Laura said at once. Their waitress fought her on everything, and while she didn’t need her employees to bow at her feet, Helen’s attitude verged on downright disrespectful. “We pay her good money. If she’s not going to work for it, then we should find someone who will.” “I know you’re not exactly friends,” Sorrow began. “Not friends? Not hardly. Does she even have any friends?” “We can’t just fire her,” Sorrow said. “She’s got kids.” Bear shrugged. “Your mother won’t hear of it anyhow.” “Well, she needs to at least attempt to be on time.” “I’ll talk to her,” Sorrow said. “Try to give her a break. I feel bad for the woman. Her husband’s never around.” Laura did a mental scan. “She’s married to that Rob guy, from the hardware store, right?” “Yeah.” Dad nodded. “Real piece of work, that one.” Women too hung up on their men…as far as Laura was concerned, everyone should take a page from her book and swear off the male sex completely. “Not my problem.” She went to put her coffee cup in the sink. “All I know is, business is up, and we’re relying on her more than ever.” “Hey,” Sorrow exclaimed, and her knife froze midchop, “what’s up with hiring another person? Dad, didn’t you say we could get some more help around here?” “Did I?” he asked, looking a little like a trapped animal. Sorrow smiled. “Oh, you did. You told Billy, remember? How we could get someone to help with the cleaning and front desk stuff.” “Seriously? Hired help?” Laura perked up, joining her sister. “That’d be awesome. I totally need help managing reservations.” “I don’t know about any hiring.” Their father looked panicked. “Don’t be getting ahead of yourselves.” She’d been momentarily light-headed with excitement, and then her mood dipped lower than ever. “Doesn’t matter, anyway. We won’t even be able to afford Helen once we go under.” Dad swung to face her. “What kind of nonsense are you talking, girl?” “Have you heard about Eddie’s construction project?” “Sure.” He shrugged. “You mean that rundown ranch what’s on the old logging creek?” “That’s the one.” He waved it off. “Yeah, Jessup told me about it. He says sprucing it up could be good for the town. Damned if those dot-commers ever did anything with the place. Fat waste that was. Good people could’ve been living there all this time.” “Nobody is going to live there,” Laura said. “His project is to turn it into a hotel.” “What of it?” “What of it?” She looked to her sister for support. Sorrow took over in more even tones, telling him, “Laura’s worried because of who the developer is. Fairview Properties isn’t exactly small potatoes. They’ve got plans to turn the ranch into a resort.” “But they mostly run those little hippie places, where they charge rich people an arm and a leg to eat nuts and berries, that sort of thing.” “They run world-class resorts,” she protested. “They’ll be touting this as a world-class resort.” Bear looked back and forth between the two of them, clearly not getting it. “That little place?” “They’re building up that little place,” Laura said. “They’re turning it into a spa thing, like Forever Sleepy Resort or something ridiculous like that. Whatever. What I do know is that once they finish, it’ll be just a matter of time before they put us out of business.” Their dad thought on that for a moment but finally brushed it off. “I don’t care how big they are, that old ranch is small potatoes, and small potatoes ain’t gonna bring us down. Not with Sorrow in the kitchen now.” He gave his youngest a wink. “How times change,” Sorrow murmured with a smirk. Just a year ago, Sully had been in charge of the food, and it was meat loafs and meat pies all around. “Well, some things don’t change,” Bear asserted. “I’ve seen that old rancher go from hand to hand since I was a kid. Trust me. Nobody’s gonna bend over backward to stay there.” The girls’ eyes met. There was no convincing Dad when he didn’t want to be convinced. At least her sister would be able to enjoy several months of cooking before they went under. “It’ll be okay,” Sorrow mouthed to her as she went to the sink to fill the pot with water. Bear followed and peered over her shoulder. “What the heck are you making?” Suspicion was thick in his voice. “She’s just busting out her famous toxic witch’s brew,” Laura deadpanned. “Jeez, Dad, it’s soup.” Sorrow gave a swirl to the water with her spoon. “Looks watery.” “This is how it’s done,” she said matter-of-factly. He peered closer, picking up a particularly long leaf. “What the heck is this?” “A leek.” “Sounds like a plumbing problem, not a vegetable.” “That’s it.” Sorrow spun and waggled her fingers at him. “Shoo! Out of my kitchen.” “Come on, Dad.” Laura put her arm through his. “I hear zombie hordes might be coming to the tavern today.” “What on earth?” her father exclaimed as she ushered him into the dining room. “Zombie-whats? What are you talking about?” But she barely heard him. All she registered was the sight of Eddie, folding his long, strong body into a booth. “Apocalypse,” he said in his deep voice. “Sounds bad. Should I go get my gun?” She stopped short, glaring. “Eddie.” “In the flesh, tiger.” He gave her a slow smile. “Just in time, too. You’ll need somebody around to help propagate the species.” Nine Bear looked his way. “We were just talking about you.” “Yeah,” Laura said in a flat voice. “Speak of the devil.” The way it came out, one would have thought he was actual evil-spawn. Eddie touched a hand to his forehead. “What? Are my horns showing?” She bustled by without sparing him another glance, headed behind the bar. “Shouldn’t you be at your job site? You know, sawing, hammering, crushing the hopes of others, that sort of thing.” Bear sauntered over to join him in his the booth. “I got something to ask you.” “Shoot.” He kept the easy smile on his face, but inside he braced. Laura looked ready to snap, and it gave him an inkling of what her father wanted to discuss. “I hear you’re trying to put us out of business.” “No such thing, Bear. I regret your daughter has a problem—” “Problem?” Laura exclaimed. Here it came. He ignored her to lean forward and talk fast. “With respect, sir, so long as Fairview plays by the rules—and I’ve got a permit in my truck that says they are—then I’ve got a responsibility to grow my business.” Bear liked the sir. He gave a gruff nod. “A man’s got to look out for his business.” “I believe this’ll only bring more tourists to Sierra Falls. That rancher can only hold so many guests.” It’d be more guests once they added a second story, but he’d work up to that part. “People coming to visit the spa will need someplace to stay…” He cocked his head in the direction of the lodge, letting Bear do the math. And he honestly believed it, too. A night at the Fairview property would probably run about four times what a night at the lodge cost. Sure enough, the man gave him a slow smile as he rose from his seat. “That was my notion exactly. I like how you think.” He went to the bar, pausing to smack a hand on the counter. “Can’t fight progress, girl.” Laura looked unusually deflated. Quietly, she said, “They’ll put us out of business, Dad.” “No prissy health farm is going to put us Baileys out of business. Seems to me you’ve got enough to fret about, so get back to it.” Bear shook his head as he settled onto a far stool, muttering, “Spa Jacuzzi city folk prissiness.” Laura automatically poured her dad a cup of coffee. Eddie had known the man for years, and he knew to let him sip and sit with this latest development for a while before he broke the rest of his news. It took baby steps with Bear Bailey. And besides, something else was demanding his attention at the moment. Laura had begun to crash around behind the bar, slamming the coffeemaker open and shut, rattling cups in the bus tray, breaking up the ice in the freezer bin. To someone else, she might’ve looked angry, but Eddie saw something in the way her mouth was drawn. A pinched look to her eyes that made it seem like she was damming back some emotion. He hated it. Hated to be the bad guy in those eyes. He popped up from the booth and joined her behind the bar. She grew utterly still, watching as he poured himself a cup of coffee. “What are you doing?” “I came for coffee, so I’m getting myself some.” “I can see that. You know what I mean.” He could tell she wanted to tear into him, but how could she fault his helping himself? Their waitress wasn’t in yet, so serving fell to the family. “Just trying to help a pretty lady.” “Then rip up Fairview’s check.” He topped off Bear’s cup, then walked back around and grabbed a stool at the bar. “Seems our goals are mutually exclusive.” As he leaned his elbows on the counter, he couldn’t help but eye her tight body in that skimpy workout getup. “Although…”","sourceLink":"https://allnovel.net/timber-creek-sierra-falls-2/page-11.html","bookId":1914,"book":{"id":1914,"title":"Timber Creek (Sierra Falls #2)","description":"Storyline: Timber Creek (Sierra Falls #2) In love and war, something’s gotta give… For Laura Bailey it wasn’t easy weathering her teen years at her quaint family lodge in a boondock town at the foothills of the Sierra Nevadas. Fleeing for San Francisco the minute she graduated high school seemed like a good idea—until she lost her job and her fiancé. The blow to her pride sent her back to Sierra Falls to figure out her life. But her hometown is undergoing a bit of renovation. A new Sierra Falls resort is posing a threat to the Bailey family business. Even worse, the construction company developing the property is run by Eddie Jessup, Laura’s cocky high school nemesis who delighted in locking horns with the little spitfire. Some things never change. But their battle isn’t the only thing heating up between Laura and Eddie, and before long they realize that getting to know each other all over again has its rewards. But fate isn’t through with them. Nor are the games men and women play in the name of love.","cover":"https://allnovel.net/images/timber-creek-sierra-falls-2.jpg","author":"Veronica Wolff","type":"Romance","source":"allnovel","link":"https://allnovel.net/timber-creek-sierra-falls-2.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:28:28 PM"}}
