{"id":88542,"no":25,"title":"Page 25","content":"\\n\\n “Daniel, this isn’t Little House on the Prairie. We have hot and cold running water.” She stood over the table, her arms wrapped tightly around her chest. She’d been so happy to see him, but he was acting so oblivious. Couldn’t he hear how disdainful he sounded? This was her new life he was joking about. Her new priorities. She was reminded with a brilliant flash of clarity why she’d given up men.\\n\\n Eddie chose that moment to get back in on the conversation. “I’ll bet in LA, you only drink organic bottled vitamin water shipped in from a Peruvian hot spring.”\\n\\n That was it. She stormed to the bar. She felt one of the men follow her, and somehow she knew it wouldn’t be Dan she saw when she turned around. She’d felt Eddie’s judgment from the moment he came in—as if he were one to judge.\\n\\n She rounded on him. “What is your problem?”\\n\\n Eddie assessed her quietly. “Just feeling a little protective, country girl.” He paused a moment, his eyes focused on her, looking like he wanted to say something more.\\n\\n She couldn’t look away. His eyes were a bright, unusual blue, and she’d never noticed how long his lashes were.\\n\\n When he spoke again, he sounded sincere. “I’m sorry. I didn’t mean to be an ass…” But then he spoke again in a voice like he was testing her, adding, “Lola.”\\n\\n He was baiting her, and she refused to bite. Instead, she kept her voice dead serious when she asked him, “Why are you even hanging around if you’ve got such a low opinion of everyone?”\\n\\n “I came because…” A look of wariness crept over his face. “I have news, Laura.”\\n\\n “What news?” She curled her fingers into her arms, because now she read wariness and regret.\\n\\n “I looked into the watershed thing for you.”\\n\\n “You did?” The words were out before she had a chance to temper the shock from her voice. Though, thinking about it, she didn’t know why she was so surprised. He’d remeasured the property lines when she’d asked him to do that, too.\\n\\n “Yes,” he said, looking oddly insulted. “I told you I’d look into it, and I’m a man of my word. I’m sorry, Laura, the bond goes to identifying and protecting flood zones. Timber Creek has never flooded. There are no restrictions to building on that land.”\\n\\n “Of course there aren’t.” Sudden emotion clutched at her throat, and she spun away to gather herself, acting as if she needed to get herself a drink. She forced her voice to steady as she said, “Next time, just shoot me an e-mail, okay?”\\n\\n He was already walking back to the booth, and the wave of his hand was all that told her he’d heard. So why had he come to deliver the news? She stole a look at him as she filled a glass with ice. Was he there to rub it in?\\n\\n And then there was the Dan thing. Dan was clueless, but she could tell how much Eddie was mocking him. It was like he was mocking her old life, and that mocked her. How could she take it any other way? So why was he even there if he judged her so much?\\n\\n Why did she care?\\n\\n Filling a glass with club soda, she stole another glance. Eddie was leaning back, jawing easily with Dan. That was how he acted—easy with everyone. Flirty with everyone. It wasn’t just with her. Those blue-eyed winks weren’t because she was special.\\n\\n She’d need to shore up her defenses.\\n\\n By the time she returned to the table, she’d schooled all emotion from her face. She gave Eddie a flat look. “I didn’t realize you were still here.”\\n\\n Something flashed in his eyes, and she waited for him to make a crack, but he only sighed and stood. “I’ll leave you to it,” he said politely. “And Laura, I really am sorry.”\\n\\n She let her eyes linger on his back as he left. Giving Eddie the cold shoulder didn’t feel as good as she’d hoped it would.\\n\\n But she had no choice. She’d failed once before, because of a man. Patrick had become her fiancé, but he’d begun as her co-worker. Eventually she’d lost her job because of him, and hearing his name only reminded her of one crystal-clear fact: she couldn’t lose again.\\n\\n Never again.\\n\\n Nineteen\\n\\n Damn. Eddie’s tires spun in gravel as he sped into the ranch’s lot and slammed his truck into park.\\n\\n Damn that woman.\\n\\n He hadn’t been able to get her out of his mind all weekend. Not even spending a couple of nights at Camp Richardson with a bunch of rowdy kids had tired him out.\\n\\n But dammit, he wasn’t a bad guy. He was a good guy. The good guy, who was doing what he could to rein in this construction project.\\n\\n Fairview could easily have given the contract to some other outfit, and they’d probably have razed the whole thing by now, erecting some postmodern glass-and-steel thing, with fake stone fountains and a giant Buddha in the foyer.\\n\\n But they’d given the job to him and Jack instead, and he was the one running around, double-checking paperwork, resurveying the land, investigating watershed bonds, God help him.\\n\\n He scowled at his reflection in the driver’s-side mirror. “Rough,” he muttered, and reached for the glove box to grab his electric razor. A couple of nights of no sleep would leave any man looking rough, but camping with a van full of kids from the Reno community center had to be the killing blow.\\n\\n It was how he spent many of his weekends, leading at-risk youth on guided hiking and camping trips. Not many people knew about it—it wasn’t something he advertised. On the contrary, it was something that felt very private to him.\\n\\n He’d been a screw-up, just like so many of these kids.\\n\\n There hadn’t been a lot to do, growing up in a small town. His home life hadn’t been bad, but still, his parents had spent years tiptoeing on the brink of divorce. They’d focused mostly on their own needs, which had made it easy for a teenage boy in a big family to get away with some bad behavior.\\n\\n As he’d gotten older, it’d only gotten worse. Temptations became more within reach. It’d only gotten easier to find someone to buy him booze before he’d been legal. And, most exciting for him, the girls eventually got older and filled out, and he had, too.\\n\\n But it wasn’t just the partying. The youngest of four boys, he’d had big shoes to fill, following in the shadow of Mark, who’d become some fancy doctor in Silver City, and then there was Scott, who’d known practically from infancy that his vocation was to be a park ranger. Meanwhile, the only thing that’d called to Eddie had been the Gas-n-Go the next town over, where the attendant was always happy to overlook the fake ID and sell him a case of beer.\\n\\n Only the strong hand of his oldest brother, Jack, had saved him. All Eddie had ever been good at was football, flirting, and fast driving, but when Jack realized the road his little brother was headed down, he’d made extra time for him.\\n\\n Growing up in Sierra Falls, Eddie had always appreciated a blue-sky day or waking to a fresh blanket of snow, but it was Jack who really showed him what nature was all about. Fishing trips, hiking, camping, living off the land for days with nobody else for miles around…those things had shown him how deep was the connection he felt with the land.\\n\\n It was the mountains that’d shown him what it was to be a man.\\n\\n The first time a bear walked through his camp was when it all really clicked. He saw how insignificant he was. How meaningless all the partying and girl chasing.\\n\\n Jack had turned Eddie’s world around. At the time, his brother had been building his business, and when Eddie graduated from high school, Jack gave him a job. A reason to get out of bed and comb his hair in the morning.\\n\\n People credited both of them for their success—and sure, Eddie worked hard—but it’d been Jack’s vision that’d made it happen.\\n\\n He thought of his latest trip. Those kids might’ve been born in the shadow of the Sierras, but many of them had never been out of the Reno city limits, and this latest batch, like Eddie so many years ago, had just experienced their first bear encounter.\\n\\n They’d hiked out to Mount Tallac, not an easy day, and were taking a break before turning back around when a black bear ambled by. The guy didn’t pose a threat, but as Eddie could attest, there was nothing like the sight of one’s first bear to forget your troubles. Meth-cooking moms, dads doing hard time—it all tended to fade to the background.\\n\\n One would’ve thought that, after a weekend like that, he’d have been dead to the world when he finally hit his own mattress last night. But he couldn’t get Laura out of his mind. She pissed him off. She was cold and prickly and uptight, capable of thinking only of her own ambitions.\\n\\n But she also riled him up in a way that made him want to pull that hot body close to his. She was sexy and sassy and smart, but she was vulnerable, too, and that right there was the crux of it. In her eyes, he’d seen flickers of the emotion—the sadness even—that she kept bottled up, under tight control. He guessed something or someone had hurt her badly, and though her vulnerability was something she kept hidden, he knew she had her demons, secreted way down deep.\\n\\n He longed to touch her…to finally, really touch her. To shoulder her burdens for a little while. To watch her let go and forget herself, with one of those knockout smiles lighting up her face, her greatest ambition only to melt into him.\\n\\n He often caught her eyes on him. He longed to see the spark in those eyes transform, for the switch to flick from cold wariness into something white-hot. Something that forgot about arguments and bottom lines…something that didn’t think at all. He’d seen it once, by the creek.\\n\\n Maybe that was the trick—to get her away from the world she knew so well. Get her away from things she thought she could control. He wanted to show her how to lose control. That losing control could be good.\\n\\n The way she responded to his touch, he knew she had it in her. She’d relaxed into him, warmed to him. But then it was like she remembered she wasn’t supposed to show her tender side, like she was afraid of it.\\n\\n And he knew it wasn’t just him. She kept herself strung tight, looking ready to shatter before she’d let anyone in.\\n\\n It was good to see that she and Sorrow had reconciled. He was glad Laura had someone to turn to. But still, he sensed she was lonely. If she weren’t, she wouldn’t have that thing in her eyes he spotted sometimes—that look of fear, that flicker of sadness. \\n\\n","sourceLink":"https://allnovel.net/timber-creek-sierra-falls-2/page-25.html","bookId":1914,"book":{"id":1914,"title":"Timber Creek (Sierra Falls #2)","description":"Storyline: Timber Creek (Sierra Falls #2) \\n In love and war, something’s gotta give… For Laura Bailey it wasn’t easy weathering her teen years at her quaint family lodge in a boondock town at the foothills of the Sierra Nevadas. Fleeing for San Francisco the minute she graduated high school seemed like a good idea—until she lost her job and her fiancé. The blow to her pride sent her back to Sierra Falls to figure out her life. But her hometown is undergoing a bit of renovation. A new Sierra Falls resort is posing a threat to the Bailey family business. Even worse, the construction company developing the property is run by Eddie Jessup, Laura’s cocky high school nemesis who delighted in locking horns with the little spitfire. Some things never change. But their battle isn’t the only thing heating up between Laura and Eddie, and before long they realize that getting to know each other all over again has its rewards. But fate isn’t through with them. Nor are the games men and women play in the name of love.\\n","cover":"https://allnovel.net/images/timber-creek-sierra-falls-2.jpg","author":"Veronica Wolff","type":"Romance","source":"allnovel","link":"https://allnovel.net/timber-creek-sierra-falls-2.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:28:28 PM"}}
