{"id":108181,"no":1,"title":"Page 1","content":"\"Tonight I want to tell you about that most fascinating of murder mysteries, the Wallace case,\" I told my mirror. Enthusiastically. I tried Sincere after that; then Earnest.\\n\\n My brush caught in a tangle. \"Shoot!\" I said, and tried again. \"I think the Wallace case can easily fill our whole program tonight,\" I said Firmly.\\n\\n We had twelve regular members, which worked out well with twelve programs a year. Not all cases could fill up a two-hour program, of course. Then the member responsible for presenting the Murder of the Month, as we jokingly called it, would have a guest speaker - someone from the police department in the city, or a psychologist who treated criminals, or the director of the local rape crisis center. Once or twice, we\u0027d watched a movie.\\n\\n But I\u0027d come up lucky in the draw. There was more than enough material on the Wallace case, yet not so much that I\u0027d be compelled to hurry over it. We\u0027d allocated two meetings for Jack the Ripper. Jane Engle had taken one for the victims and the circumstances surrounding the crimes and Arthur Smith had taken another on the police investigation and the suspects. You can\u0027t skimp Jack. \"The elements of the Wallace case are these,\" I continued. \"A man who called himself Qualtrough, a chess tournament, an apparently inoffensive woman named Julia Wallace, and of course the accused, her husband, William Herbert Wallace himself.\" I gathered all my hair into a brown switch and debated whether to put it in a roll on the back of my head, braid it, or just fasten a band around it to keep it off my face. The braid. It made me feel artsy and intellectual. As I divided my hair into clumps, my eyes fell on the framed studio portrait of my mother she\u0027d given me on my last birthday with an offhand, \"You said you wanted one.\" My mother, who looks a lot like Lauren Bacall, is at least five-foot six, elegant to her fingertips, and has built her own small real estate empire. I am four-foot eleven, wear big round tortoise-rimmed glasses, and have fulfilled my childhood dream by becoming a librarian. And she named me Aurora, though to a woman herself baptized Aida, Aurora may not have seemed so outrageous. Amazingly, I love my mother.\\n\\n I sighed, as I often do when I think of her, and finished braiding my hair with practiced speed. I checked my reflection in the big mirror; brown hair, brown glasses, brown eyes, pink cheeks (artificial), and good skin (real). Since it was, after all, Friday night, I\u0027d shucked my work clothes, a plain blouse and skirt, and opted for a snug white knit top and black slacks. Deciding I wasn\u0027t festive enough for William Herbert Wallace, I tied a yellow ribbon around the top of my braid and pulled on a yellow sweater. A look at the clock told me it was finally time to go. I slapped on some lipstick, grabbed my purse, and bounded down the stairs. I glanced around the big den/dining/kitchen area that took up the back half of the ground floor of the townhouse. It was neat; I hate to come home to a messy place. I tracked down my notebook and located my keys, muttering facts about the Wallace case all the while. I had thought about xeroxing the indistinct old pictures of Julia Wallace\u0027s body and passing them out to show the murder scene, but I decided that would perhaps be ghoulish and certainly disrespectful to Mrs. Wallace. A club like Real Murders seemed odd enough to people who didn\u0027t share our enthusiasms, without adding the charge of ghoulishness. We kept a low profile. I flipped on the outside light as I shut the door. It was already dark this early in spring; we hadn\u0027t switched to daylight savings time yet. In the excellent light over the back door, my patio with its high privacy fence looked swept and clean, the rose trees in their big tubs just coming into bud. \"Heigh ho, heigh ho, it\u0027s off to crime I go,\" I hummed tunelessly, shutting the gate behind me. Each of the four townhouses \u0027owns\u0027 two parking spaces: there are extra ones on the other side of the lot for company. My neighbor two doors down, Bankston Waites, was getting into his car, too. \"I\u0027ll see you there,\" he called. \"I\u0027ve got to pick up Melanie first.\"\\n\\n \"Okay, Bankston. Wallace tonight!\"\\n\\n \"I know. We\u0027ve been looking forward to it.\"\\n\\n I started up my car, courteously letting Bankston leave the lot first on his way to pick up his lady fair. It did cross my mind to feel sorry for myself that Melanie Clark had a date and I always arrived at Real Murders by myself, but I didn\u0027t want to get all gloomy. I would see my friends and have as good a Friday night as I usually had. Maybe better.\\n\\n As I backed up I noticed that the townhouse next to mine had bright windows and an unfamiliar car was parked in one of its assigned spaces. So that was what Mother\u0027s message taped to my back door had meant. She\u0027d been urging me to get an answering machine, since the townhouse tenants (her tenants) might need to leave me (the resident manager) messages while I was at work at the library. Actually, I believe my mother just wanted to know she could talk to me while I wasn\u0027t even home.\\n\\n I\u0027d had the townhouse next door cleaned after the last tenants left. It had been in perfect condition to show, I reassured myself. I\u0027d go meet the new neighbor tomorrow, since it was my Saturday off.\\n\\n I drove up Parson Road far enough to pass the library where I worked, then turned left to get to the area of small shops and filling stations where the VFW Hall was. I was mentally rehearsing all the way. But I might as well have left my notes at home. \\n\\n","sourceLink":"https://allnovel.net/real-murders-aurora-teagarden-1/page-1.html","bookId":2236,"book":{"id":2236,"title":"Real Murders (Aurora Teagarden #1)","description":"Storyline: Real Murders (Aurora Teagarden Mysteries #1) \\n Though a small town at heart, Lawrenceton, Georgia, has its dark side-and crime buffs. One of whom is librarian Aurora \"Roe\" Teagarden, a member of the Real Murders Club, which meets once a month to analyze famous cases. It\u0027s a harmless pastime-until the night she finds a member killed in a manner that eerily resembles the crime the club was about to discuss. And as other brutal \"copycat\" killings follow, Roe will have to uncover the person behind the terrifying game, one that casts all the members of Real Murders, herself included, as prime suspects-or potential victims.\\n","cover":"https://allnovel.net/images/real-murders-aurora-teagarden-1.jpg","author":"Charlaine Harris","type":"Thriller","source":"allnovel","link":"https://allnovel.net/real-murders-aurora-teagarden-1.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 11:16:36 PM"}}
