{"id":26322,"no":20,"title":"CHAPTER XX THE ULTIMATE DISCOVERY","content":"Jean had so few acquaintances in Saintsbury that there was little chance of finding her off on a visit. I went to the railway station and tried to discover whether anyone there had seen her or sold a ticket to Dunstan, but I found nothing. I believe it was superstition more than anything else that sent me finally to Barney. He was at his stand, selling papers as calmly as though this chaotic day were like any other. \n \n \"Barney, Miss Benbow is lost,\" I said, without preliminary. \"She has left Mr. Ellison\u0027s house, and told the maid she was not coming back. I have been to the station to inquire. For heaven\u0027s sake, suggest something that I can do.\" \n \n Barney listened sympathetically, but without any manifestation of concern. \n \n \"Gone, has she? And not coming back! And I\u0027ll warrant you haven\u0027t had a chance to talk to her since I got her home from the church.\" \n \n \"Of course I haven\u0027t. I\u0027ve been at the jail. Barney, we\u0027ve arrested Garney, and he is the man that killed Barker, and Benbow will be cleared. But I am not going to talk about anything until I find that girl. So don\u0027t ask questions. Tell me something to do.\" \n \n Barney\u0027s eyes grew round as saucers, but he was an old soldier. He knew when to obey. But he would do it in his own way. \n \n \"I\u0027m thinking, Mr. Hilton, that if ye mind your own affairs, ye\u0027ll best be mindin\u0027 hers.\" \n \n \"Is that impertinence, Barney?\" \n \n \"Divil a bit, your honor, and you with a face on you that would scare a banshee into saying prayers!\" \n \n \"Then, I am in no mood for guessing riddles.\" \n \n He gave me a glance that made me feel inexpressibly young. \n \n \"I\u0027m thinkin\u0027 I saw the young leddy go up yonder,\" he said, nodding toward the building where I had my office. \"If she was goin\u0027 away forever, maybe she wanted to say good-bye!\" \n \n Could it be possible? I dashed across the street and up the stairs without waiting for the slow elevator. I opened the door,--and there lay a pathetic little heap on the Daghestan rug on my floor. \n \n p290 \n There lay a pathetic little heap on the Daghestan rug on my floor. Page 290. \n \n It was a moment before I realized that the tired child was merely asleep. I had dropped down beside her and lifted her head upon my arm, when she opened her eyes with a start. Then something wonderful and dazzling swam up from her unconscious eyes to meet my gaze,--and I knew in a bewildering flash that it was no child but a woman that I held in my arms. My heart went from me. I did not realize that I had kissed her. \n \n She lay quite still for a moment, but her white eyelids fell slowly to hide her eyes from mine. \n \n \"Thank heaven you are safe!\" I murmured. \"How could you frighten me so?\" \n \n She withdrew herself gently from my arms and rose. Her hat was on my desk, between the inkstand and the mucilage. She picked it up and proceeded to stab it to her head. \n \n \"I must have fallen asleep,\" she murmured, keeping her downcast eyes from me. \"I just came in to say good-bye, and I waited, and told Mr. Fellows he could leave the door unlocked, because I was sure you would come, and I was so tired,--\" \n \n \"Good-bye indeed! Where do you think you are going?\" \n \n \"I am going back to Miss Elwood\u0027s School,\" she said, with the gentle inflexibility I always enjoyed. \"I seem to do nothing but get into trouble when I am away from there. I didn\u0027t tell anyone but Minnie, because I didn\u0027t want to have to argue about it, but I thought I ought to say good-bye to you,--\" \n \n \"I am glad you remembered to be polite to me,\" I said, getting possession of her hands, \"because I have a lot of things to tell you. That is,--if you will promise to marry me first!\" \n \n \"Don\u0027t!\" she said, breathlessly, drawing away. \"You--forget!\" \n \n \"Forget what?\" \n \n \"The other girl!\" \n \n \"There is no other girl,--never was and never will be,\" I protested. \"What in the world do you mean, child?\" \n \n She looked at me with troubled eyes. \"Katherine Thurston said that you said there was--someone.\" \n \n \"Oh!\" I gasped. That foolish, forgotten incident of the locket! I felt myself blushing,--at least I had that grace. \n \n \"Let me explain, dear. When Mrs. Whyte introduced me to Miss Thurston, I thought she would be more willing to be friends if she were assured that I was not going to bother her with any love-making. So, just to make things pleasant, I showed her a miniature which I had in my pocket and told her that it was a picture of the only woman in the world to me.\" \n \n \"And wasn\u0027t that true?\" she asked gravely. \n \n \"It was,--but it isn\u0027t true now. Darling, it was my mother\u0027s face,--the one I took out of this locket.\" I touched the jeweled trifle which lay upon her breast. \n \n \"Oh!\" A look of terror came into her eyes, as though she drew back from an abyss. \"Oh, and I might have married that man!\" \n \n \"Jean! Did that have anything to do with it?\" \n \n \"Why, I thought that, since I should never marry anyone else, it would be awfully selfish to refuse to save Gene,\" she said simply. \"And if you were going to marry some strange person, why,--it didn\u0027t matter. That\u0027s what I thought.\" \n \n \"Oh, Jean, Jean!\" I cried, taking her into my arms. What was the use of talking common-sense to a creature like that? I gave it up, and talked her own tongue instead! But after awhile she looked up under her lashes. \n \n \"Was I foolish to believe Mr. Garney?\" \n \n \"Of course you were, my darling. But perhaps it was a guided foolishness. Jean, what you told me about his recognizing that locket gave me a clue to the man who shot Barker. Dear, it was not Gene. It was Mr. Garney himself.\" \n \n \"Oh! Can it be true?\" \n \n \"Only too true.\" I told her some of the strange disconnected links which had at last been knit into a strong chain of evidence. \n \n \"Was that what he meant to tell me when we were married?\" she asked, her eyes full of horror. \n \n \"No, I do not believe he ever meant to tell you anything,--or at most some wild tale like that one about Fellows,--which might have made trouble for us, too, if the real discovery had not come so soon. He merely wanted to get you to marry him, by hook or crook. He felt perfectly safe, I am sure. He thought he had the whole thing in his hands when he forced Gene to believe and to confess what would forever close future investigation.\" \n \n \"And Gene will now go free?\" \n \n \"Perfectly free,--free to dance at our wedding. Don\u0027t forget that,\" I said. \n \n She laughed,--which was what I wanted. I could not let her break nervously under all this emotional strain. \n \n \"Then everything has turned out happily except for poor Mr. Clyde!\" she said, clasping her hands hard together. \n \n \"Oh, my precious child, I quite forgot all about Mr. Clyde! He is just as happy as the rest of us. That letter of yours, you angel of all good tidings, is going to save him. It was from your father, you know, and it proves that Mr. Clyde was not in Houston that fatal night. I had to leave him to come back to look after you, but that is going to be all straightened out in a very short time. All because of that letter, dearest girl! See how things have worked out!\" \n \n She looked at me, breathless, bewildered, trying to understand all these marvels. Then suddenly she burst into nervous tears. It was just as well. It relieved the emotional strain--and it gave me a chance to comfort her. \n \n It was some time before I remembered that Miss Thurston and Mr. Ellison and Mrs. Whyte and the police department were still uninformed that Miss Jean Benbow need not be the object of further search. \n \n \"You see!\" I pointed out to her. \"You put all the rest of the world out of my mind. Now stand here and tell me what I shall say to Mrs. Whyte.\" And I took down the office telephone. \n \n \"Tell her that since I have lost my train, I\u0027ll come back for awhile,\" she said demurely. \n \n \"Is that your only reason for staying, young lady?\" \n \n \"Isn\u0027t that enough?\" \n \n \"There are other trains!\" \n \n \"But I have lost the one I wanted!\" \n \n \"What have you found instead?\" \n \n She would not answer. \n \n \"What have you found?\" I insisted, drawing her to me. \n \n But what my Story-Book Girl told me I shall not repeat. \n \n The End \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2044/58302.html","bookId":608,"book":{"id":608,"title":"The Saintsbury Affair","description":"简介： Let me see where the story begins. Perhaps I can date it from the telephone invitation to dinner which I received one Monday from my dear and kind friend Mrs. Whyte....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2044","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
