{"id":69693,"no":30,"title":"Page 30","content":"KATHY ORDONEZ WALKED into Tanner Kingsley\u0027s office with the morning newspapers and said, \"It\u0027s happening again.\" She handed him the newspapers. They all had banner headlines:? FOG DISRUPTS MAJOR GERMAN CITIES? ALL SWISS AIRPORTS CLOSED BY FOG? DEATH TOLL RISES FROM FOG IN ROME Kathy said, \"Shall I send these to Senator Van Luven?\" \"Yes. Right away,\" Tanner said grimly. Kathy hurried out of his office. Tanner looked at his wristwatch and smiled. The bomb must have gone off by now. The two bitches have finally been disposed of. His secretary\u0027s voice came over the intercom. \"Mr. Kingsley, Senator Van Luven is on the line for you. Do you wish to take it?\" \"Yes.\" Tanner picked up the phone. \"Tanner Kingsley.\" \"Hello, Mr. Kingsley. This is Senator Van Luven.\" \"Good afternoon, Senator.\" \"My assistants and I happen to be near your headquarters, and I wondered if it would be convenient for you if we dropped in for a visit.\" \"Absolutely,\" Tanner said enthusiastically. \"I would be very happy to show you around, Senator.\" \"Fine. We\u0027ll be there shortly.\" Tanner pressed the intercom button. \"I\u0027m expecting some visitors in a few minutes. Hold all my calls.\" He thought about the obituary he had seen in the newspapers a few weeks earlier. Senator Van Luven\u0027s husband had died of a heart attack. I\u0027ll offer my condolences. FIFTEEN MINUTES LATER, Senator Van Luven and her two attractive young assistants arrived. Tanner rose to greet them. \"I\u0027m delighted you decided to come.\" Senator Van Luven nodded. \"You remember Corinne Murphy and Karolee Trost.\" Tanner smiled. \"Yes. It\u0027s nice to see you both again.\" He turned to the senator. \"I heard about your husband\u0027s passing away. I\u0027m terribly sorry.\" Senator Van Luven nodded. \"Thank you. He had been ill for a long time, and finally, a few weeks ago? She forced a smile. \"By the way, the information on global warming that you\u0027ve been sending me is very impressive.\" \"Thank you.\" \"Would you like to show us what you\u0027re doing here?\" \"Of course. How much of a tour would you like? We have a five-hour tour, a four-hour tour, and an hour-and-a-half tour.\" Corinne Murphy grinned. \"It would be nice to take the five-\" Senator Van Luven interrupted. \"We\u0027ll settle for the hour-and-a-half tour.\" \"My pleasure.\" \"How many people work at KIG?\" Senator Van Luven asked. \"Approximately two thousand. KIG has offices in a dozen major countries all over the world.\" Corinne Murphy and Karolee Trost looked impressed. \"We have five hundred employees in these buildings. The staff members and the research fellows have separate quarters. Every scientist employed here has a minimum IQ of one hundred sixty.\" Corinne Murphy gushed, \"They\u0027re geniuses.\" Senator Van Luven gave her a disapproving look. \"Follow me, please,\" Tanner said. THE SENATOR AND Murphy and Trost followed Tanner through a side door into one of the adjoining buildings. He led them into a room crammed with esoteric-looking equipment. Senator Van Luven walked up to one of the odd-looking machines and asked, \"What does this do?\" \"That\u0027s a sound spectrograph, Senator. It converts the sound of a voice into a voiceprint. It can recognize thousands of different voices.\" Trost frowned. \"How does it do that?\" \"Think of it this way. When a friend calls you on the telephone, you instantly recognize the voice because that sound pattern is etched in your brain circuit. We program this machine the same way. An electronic filter allows only a certain band of frequencies to get through to the recorder, so that we have only the distinguishable features of that person\u0027s voice.\" The rest of the tour became a fascinating montage of giant machines and miniature electronic microscopes and chemical laboratories; rooms with blackboards filled with mysterious symbols, labs with a dozen scientists working together, and offices where a single scientist was absorbed in trying to solve some arcane problem. They passed a redbrick building with a double set of locks on the door. Senator Van Luven asked, \"What\u0027s in there?\" \"Some secret government research. Sorry, it\u0027s out of bounds, Senator.\" The tour took two hours. When it was over, Tanner escorted the three women back to his office. \"I hope you enjoyed it,\" Tanner said. Senator Van Luven nodded. \"It was interesting.\" \"Very interesting.\" Corinne Murphy smiled. Her eyes were on Tanner. \"I loved it!\" exclaimed Karolee Trost. Tanner turned to Senator Van Luven. \"By the way, have you had a chance to discuss with your colleagues the environmental problem we talked about?\" The senator\u0027s voice was noncommittal. \"Yes.\" \"Would you tell me what you think the chances are, Senator?\" \"This is not a guessing game, Mr. Kingsley. There will be more discussions. I\u0027ll let you know when it\u0027s been decided.\" Tanner managed a smile. \"Thank you. Thank you all for dropping by.\" He watched them leave. AS THE DOOR closed behind them, Kathy Ordonez\u0027s voice came over the intercom. \"Mr. Kingsley, Saida Hernandez has been trying to reach you. She said it was urgent, but you told me to hold your calls.\" \"Get her for me,\" Tanner said. Saida Hernandez was the woman he had sent to the Adams Hotel to plant the bomb. Line one. Tanner picked up the phone, anticipating the good news. \"All went well, Saida?\" \"No. I\u0027m sorry, Mr. Kingsley.\" He could hear the fear in her voice. \"They got away.\" Tanner\u0027s body went stiff. \"They what?\" \"Yes, sir. They left before the bomb went off. A bellman saw them rush out of the hotel lobby.\" Tanner slammed the phone down. He buzzed his secretary. \"Send Flint and Carballo in here.\" A minute later, Harry Flint and Vince Carballo walked into Tanner\u0027s office. Tanner turned to the two men. He was in a towering rage. \"The bitches got away again. That\u0027s the last time I will allow that to happen. Do you understand? I\u0027m going to tell you where they are, and you\u0027re going to take care of them. Any questions?\" Flint and Carballo looked at each other. \"No, sir.\" Tanner pressed a button that revealed the electronic city map. \"As long as they have the cards that I gave them, we can track them down.\" They watched the electronic lights appear on the television screen map. Tanner pressed a button. The lights did not move. Tanner gritted his teeth. \"They\u0027ve gotten rid of their cards.\" His face got redder. He turned to Flint and Carballo. \"I want them killed today.\" Flint looked at Tanner, puzzled. \"If we don\u0027t know where they are, how can we-?\" Tanner cut in. \"Do you think I\u0027d let a woman outwit me that easily? As long as they have their cell phones, they\u0027re not going anywhere without telling us.\" \"You could get hold of their cell phone numbers?\" Flint asked, surprised. Tanner did not bother to reply. He was examining the map. \"By now they\u0027ve probably separated.\" He pressed another switch. \"Let\u0027s try Diane Stevens first.\" Tanner punched in a number. The lights on the map started to move and began to slowly focus on Manhattan streets, panning across hotels, shops, and banks. Finally, the moving lights stopped at a building with a sign that read NELSON GALLERY. \"Diane Stevens is in a gallery.\" Tanner pressed another button. \"Let\u0027s see where Kelly Harris is.\" Tanner began to repeat the same procedure. The lights started moving again, this time focusing on a different part of the city. The men watched as the lighted area narrowed down to a street with a clothing store, a restaurant, a drugstore, and a bus station. The lights scanned the area and suddenly stopped in front of a large, open building. \"Kelly Harris is at a bus station.\" Tanner\u0027s voice was grim. \"We\u0027ve got to catch them both, fast.\" \"How?\" Carballo asked. \"They\u0027re at opposite ends of town. By the time we got there, they\u0027d be gone.\" Tanner turned. \"Come with me.\" He headed for an adjoining room, Flint and Carballo close behind him. The room they entered had an array of monitors, computers, and electronic keyboards with color-coded keys. On a shelf was a small squat machine, with dozens of compact discs and DVDs. Tanner looked through them and slipped one labeled diane stevens inside the machine. He explained to the men: \"This is a voice synthesizer. The voices of Diane Stevens and Kelly Harris were digitized earlier. The patterns of their speech have been recorded and analyzed. With the press of a button, every word I say is calibrated to duplicate their voices.\" Tanner picked up a cell phone and pressed some numbers. There was a cautious \"Hello?\" It was Kelly Harris\u0027s voice. \"Kelly! I\u0027m so glad I found you.\" It was Tanner speaking, but it was Diane Stevens\u0027s voice that they heard. \"Diane! You caught me just in time. I\u0027m on my way out of here.\" Flint and Carballo were listening in wonder. \"Where are you going, Kelly?\" \"To Chicago. I\u0027m taking a plane home, out of O\u0027Hare.\" \"Kelly, you can\u0027t leave now.\" There was a moment of silence. \"Why?\" \"Because I found out what\u0027s really happening. I know who killed our husbands and why.\" \"Oh, my God! How did?Are you sure?\" \"Positive. I have all the proof we need.\" \"Diane, that\u0027s-that\u0027s wonderful.\" \"I have the proof with me. I\u0027m at the Delmont Hotel, in penthouse A. From here I\u0027m going to the FBI. I wanted you to go with me, but if you have to go home, I understand.\" \"No, no! I-I want to help finish what Mark was trying to do.\" Flint and Carballo were listening to every word, riveted. In the background, they could hear the station announcement for the bus to Chicago. \"I\u0027ll go with you, Diane. You said the Delmont Hotel?\" \"Yes, on Eighty-sixth Street. Penthouse A.\" \"I\u0027m on my way. See you in a little while.\" The connection was broken. Tanner turned to Flint and Carballo. \"Half the problem is solved. Now we\u0027ll take care of the other half.\" Flint and Carballo watched as Tanner inserted another compact disc labeled kelly Harris into the synthesizer. Tanner moved a switch on the phone and pressed some numbers. Diane\u0027s voice came on almost immediately. \"Hello? Tanner spoke into the phone, but it was Kelly\u0027s voice they heard. \"Diane-\" \"Kelly! Are you all right?\" \"I\u0027m wonderful. I have some exciting news. I found out who killed our husbands and why.\" \"What? Who-who-?\" \"We can\u0027t discuss this on the phone, Diane. I\u0027m at the Delmont Hotel, on Eighty-sixth Street, penthouse A. Can you meet me here?\" \"Of course. I\u0027ll come right over.\" \"Wonderful, Diane. I\u0027ll be waiting.\" Tanner clicked off the set and turned to Flint. \"You\u0027ll be waiting.\" He handed Flint a key. \"This is the key to penthouse A. It\u0027s our company suite. Get there right away and wait for them. I want you to kill them as soon as they walk in the door. I\u0027ll see to it that the bodies are taken care of.\" Carballo and Tanner watched Flint turn and hurry out the door. Carballo said, \"What would you like me to do, Mr. Kingsley?\" \"Take care of Saida Hernandez.\" WAITING INSIDE PENTHOUSE A, Flint was determined that this time nothing would go wrong. He had heard of bunglers that Tanner had disposed of. Not me, Flint thought. He took out his gun, checked the barrel, and screwed on the silencer. All he had to do now was wait. In a taxi six blocks from the Delmont Hotel, Kelly Harris\u0027s mind was racing with excitement over what Diane had told her. I know who killed our husbands and why. ?I have all the proof we need. Mark, I\u0027m going to make them pay for what they did to you. DIANE WAS IN a fever of impatience. The nightmare was at an end. Somehow Kelly had discovered who was behind the plot to kill them and she had proof. I\u0027m going to make you proud of me, Richard. I feel you near me, andDiane\u0027s thoughts were interrupted by the taxi driver. \"We\u0027re here, lady. Delmont Hotel.\"","sourceLink":"https://allnovel.net/are-you-afraid-of-the-dark/page-30.html","bookId":2370,"book":{"id":2370,"title":"Are You Afraid of the Dark?","description":"Storyline: The new novel that Sidney Sheldon\u0027s millions of fans all over the world have been waiting for. And, like his seventeen previous books, it is destined for a top place on bestseller lists everywhere. In New York, Denver, Paris and Berlin, four people have died separately in apparent accidents. Two women -- the widows of two of the dead -- find themselves under ruthless attack and are drawn together in fear, confusion and for mutual protection. But are they being targeted because one of them is the prosecution witness at a famous criminal trial? Or is there a connection to the mystery behind their husband\u0027s deaths? Meanwhile, Tanner Kingsley, Chief Executive of an international Think Tank created only seven years ago, is on the cusp of an amazing discovery which could alter the future of the world. If properly handled, the outcome of this could deliver unbelievable power into the company\u0027s hands. But are the mysterious deaths connected to this volatile secret? And can it be further protected? Thrown together, the women could not be more different: Diane Stevens is a well-connected, affluent artist from the Upper East Side. Philadelphia neighbourhood with a new \u0027uncle\u0027 every month, believed she had at last found safety and contentment in Paris, married to a brilliant scientist. Taut with suspense and vivid characterization, and with an unnervingly realistic premise that could alter our lives, ARE YOU AFRAID OF THE DARK is Sheldon at the top of his form.","cover":"https://allnovel.net/images/are-you-afraid-of-the-dark.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/are-you-afraid-of-the-dark.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:13:18 AM"}}
