{"id":69669,"no":6,"title":"Page 6","content":"AT ORLY, A limousine was waiting to take them to the Hotel Plaza Athenee.\n When they arrived, the manager said, \"Your suite is ready for you, Mr. and Mrs.\n Stevens.\"\n \"Thank you.\" They were booked into suite 310. The manager opened the door, and Diane and Richard walked inside. Diane stopped in shock. Half a dozen of her paintings were hanging on the walls. She turned to look at Richard. \"I-how did that-?\" Richard said innocently, \"I have no idea. I guess they have good taste here, too.\" Diane gave him a long, passionate kiss.\n PARIS WAS A wonderland. Their first stop was at Givenchy, to buy outfits for both of them, then over to Louis Vuitton, to get luggage for all their new clothes.\n They took a leisurely walk down the Champs-Elysees to the Place de la Concorde, and saw the storied Arc de Triomphe, and the Palais-Bourbon, and la Madeleine.\n They strolled along la Place Vendome, and spent a day at the Musee du Louvre. They wandered through the sculpture garden of the Musee Rodin and had romantic dinners at Auberge de Trois Bonheurs, and Au Petit Chez Soi, and D\u0027Chez Eux.\n The ONLY THING that seemed odd to Diane was the telephone calls Richard received at peculiar hours.\n \"Who was that?\" Diane asked once, at 3 a.m., as Richard finished a phone conversation.\n \"Just routine business.\"\n In the middle of the night?\n \"Diane! diane!\" She was shaken out of her reverie. Carolyn Ter was standing over her. \"Are you all right?\" \"I\u0027m-I\u0027m fine.\" Carolyn put her arms around Diane. \"You just need time. It\u0027s only been a few days.\" She hesitated.\n \"By the way, have you made arrangements for the funeral?\" Funeral. The saddest word in the English language. It carried the sound of death, an echo of despair.\n \"I-I haven\u0027t-been able to-\" \"Let me help you with it. I\u0027ll pick out a casket and-\" \"No!\" The word came out harsher than Diane had intended.\n Carolyn was looking at her, puzzled.\n When Diane spoke again, her voice was shaky. \"Don\u0027t you see? This is-this is the last thing I can ever do for Richard. I want to make his funeral special. He\u0027ll want all his friends there, to say goodbye.\" Tears were running down her cheeks.\n \"Diane-\" \"I have to pick out Richard\u0027s casket to make sure he-he sleeps comfortably.\" There was nothing more Carolyn could say.\n THAT AFTERNOON, DETECTIVE Earl Greenburg was in his office when the call came.\n \"Diane Stevens is on the phone for you.\" Oh, no. Greenburg remembered the slap in the face the last time he had seen her.\n What now? She probably has some new beef. He picked up the phone. \"Detective Greenburg.\" \"This is Diane Stevens. I\u0027m calling for two reasons. The first is to apologize.\n I behaved very badly, and I\u0027m truly sorry.\" He was taken aback. \"You don\u0027t have to apologize, Mrs. Stevens. I understood what you were going through.\" He waited. There was a silence.\n \"You said you had two reasons for calling.\" \"Yes. My husband\u0027s-\" Her voice broke. \"My husband\u0027s body is being held somewhere by the police. How do I get Richard back? I\u0027m arranging for his-his funeral at the Dalton Mortuary.\" The despair in her voice made him wince. \"Mrs. Stevens, I\u0027m afraid that some red tape is involved.\n First, the coroner\u0027s office has to file a report on the autopsy and then it\u0027s necessary to notify the various-\" He was thoughtful for a moment, then made his decision. Look-you have enough on your mind. I\u0027ll make the arrangements for you. Everything will be set within two days.\" \"Oh. I-I thank you. Thank you very-\" Her voice choked up and the connection was broken.\n Earl Greenburg sat there a long time, thinking about Diane Stevens and the anguish she was going through. Then he went to work cutting red tape.\n THE DALTON MORTUARY was located on the east side of Madison Avenue. It was an impressive two-story building with the facade of a southern mansion. Inside, the decor was tasteful and understated, with soft lighting and whispers of pale curtains and drapes.\n Diane said to the receptionist, \"I have an appointment with Mr. Jones. Diane Stevens.\" \"Thank you.\" The receptionist spoke into a phone, and moments later the manager, a gray-haired, pleasant-faced man, came out to greet Diane.\n \"I\u0027m Ron Jones. We spoke on the phone. I know how difficult everything is at a time like this, Mrs. Stevens, and our job is to take the burden off you. Just tell me what you want and we will see that your wishes are carried out.\" Diane said uncertainly, \"I-I\u0027m not even sure what to ask.\" Jones nodded. \"Let me explain. Our services include a casket, a memorial service for your friends, a cemetery plot, and the burial.\" He hesitated. \"From what I read of your husband\u0027s death in the newspapers, Mrs. Stevens, you\u0027ll probably want a closed casket for the memorial service, so-\" \"No!\" Jones looked at her in surprise. \"But-\" \"I want it open. I want Richard to-to be able to see all his friends, before he ? Her voice trailed off.\n Jones was studying her sympathetically. \"I see. Then if I may make a suggestion, we have a cosmetician who does excellent work where\"-he said tactfully-\"it\u0027s needed. Will that be all right?\" Richard would hate it, but-\"Yes.\" \"There\u0027s just one thing more. We\u0027ll need the clothes you want your husband to be buried in.\" She looked at him in shock. \"The-\" Diane could feel the cold hands of a stranger violating Richard\u0027s naked body, and she shivered.\n \"Mrs. Stevens?\" I should dress Richard myself. But I couldn \u0027t bear to see him the way he is. I want to remember\"Mrs. Stevens?\" Diane swallowed. \"I hadn\u0027t thought about-\" Her voice was strangled. \"I\u0027m sorry.\" She was unable to go on.\n He watched her stumble outside and hail a taxi.\n WHEN DIANE RETURNED to her apartment, she walked into Richard\u0027s closet. There were two racks filled with his suits. Each outfit held a treasured memory. There was the tan suit Richard had been wearing the night they met at the art gallery. I like your curves. They have the delicacy of a Rossetti or a Manet. Could she let go of that suit? No.\n Her fingers touched the next one. It was the light gray sport jacket Richard had worn to the picnic, when they had been caught in the rain.\n Your place or mine?\n This isn \u0027tjust a one-night stand.\n I know.\n How could she not keep it?\n The pinstriped suit was next. You like French food. I know a great French restaurant?\n The navy blazer?the suede jacket?Diane wrapped the arms of a blue suit around herself and hugged it. I could never let any of these go. Each of them was a cherished remembrance. \"I can\u0027t.\" Sobbing, she grabbed a suit at random and fled.\n The following afternoon, there was a message on Diane\u0027s voice mail: \"Mrs.\n Stevens, this is Detective Greenburg. I wanted to let you know that everything here has been cleared. I\u0027ve talked to the Dalton Mortuary. You\u0027re free to go ahead with whatever plans you want to make? There was a slight pause. \"I wish you well?Good-bye.\" Diane called Ron Jones at the mortuary. \"I understand that my husband\u0027s body has arrived there.\" \"Yes, Mrs. Stevens. I already have someone taking care of the cosmetics, and we\u0027ve received the clothes you sent. Thank you.\" \"I thought-would this coming Friday be all right for the funeral?\" \"Friday will be fine. By then we will have taken care of all the necessary details. I would suggest eleven a.m.\" In three days, Richard and I will be parted forever. Or until I join him.\n THURSDAY MORNING, DIANE was busily preparing the final details of the funeral, verifying the long list of invitees and the pallbearers, when the telephone call came.\n \"Mrs. Stevens?\"\n \"Yes.\" \"This is Ron Jones. I just wanted to let you know that I received your paperwork and the change was made, just as you requested.\" Diane was puzzled. \"Paperwork-?\" \"Yes. The courier brought it yesterday, with your letter.\" \"I didn\u0027t send any-\" \"Frankly, I was a little surprised, but, of course, it was your decision.\" \"My decision-?\" \"We cremated your husband\u0027s body one hour ago.\" \n","sourceLink":"https://allnovel.net/are-you-afraid-of-the-dark/page-6.html","bookId":2370,"book":{"id":2370,"title":"Are You Afraid of the Dark?","description":"Storyline: \n The new novel that Sidney Sheldon\u0027s millions of fans all over the world have been waiting for. And, like his seventeen previous books, it is destined for a top place on bestseller lists everywhere. In New York, Denver, Paris and Berlin, four people have died separately in apparent accidents. Two women -- the widows of two of the dead -- find themselves under ruthless attack and are drawn together in fear, confusion and for mutual protection. But are they being targeted because one of them is the prosecution witness at a famous criminal trial? Or is there a connection to the mystery behind their husband\u0027s deaths? Meanwhile, Tanner Kingsley, Chief Executive of an international Think Tank created only seven years ago, is on the cusp of an amazing discovery which could alter the future of the world. If properly handled, the outcome of this could deliver unbelievable power into the company\u0027s hands. But are the mysterious deaths connected to this volatile secret? And can it be further protected? Thrown together, the women could not be more different: Diane Stevens is a well-connected, affluent artist from the Upper East Side. Philadelphia neighbourhood with a new \u0027uncle\u0027 every month, believed she had at last found safety and contentment in Paris, married to a brilliant scientist. Taut with suspense and vivid characterization, and with an unnervingly realistic premise that could alter our lives, ARE YOU AFRAID OF THE DARK is Sheldon at the top of his form.\n \n","cover":"https://allnovel.net/images/are-you-afraid-of-the-dark.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/are-you-afraid-of-the-dark.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:13:18 AM"}}
