{"id":22859,"no":3,"title":"Chapter 3","content":"It was a warm spring night and I sat at a table on the terrace of the Napolitain after Robert had gone, watching it get dark and the electric signs come on, and the red and green stop-and-go traffic-signal, and the crowd going by, and the horse-cabs clippety-clopping along at the edge of the solid taxi traffic, and the _poules_ going by, singly and in pairs, looking for the evening meal. I watched a good-looking girl walk past the table and watched her go up the street and lost sight of her, and watched another, and then saw the first one coming back again. She went by once more and I caught her eye, and she came over and sat down at the table. The waiter came up. \\n\\n \\n\\n \"Well, what will you drink?\" I asked. \\n\\n \\n\\n \"Pernod.\" \\n\\n \\n\\n \"That\u0027s not good for little girls.\" \\n\\n \\n\\n \"Little girl yourself. Dites garcon, un pernod.\" \\n\\n \\n\\n \"A pernod for me, too.\" \\n\\n \\n\\n \"What\u0027s the matter?\" she asked. \"Going on a party?\" \\n\\n \\n\\n \"Sure. Aren\u0027t you?\" \\n\\n \\n\\n \"I don\u0027t know. You never know in this town.\" \\n\\n \\n\\n \"Don\u0027t you like Paris?\" \\n\\n \\n\\n \"No.\" \\n\\n \\n\\n \"Why don\u0027t you go somewhere else?\" \\n\\n \\n\\n \"Isn\u0027t anywhere else.\" \\n\\n \\n\\n \"You\u0027re happy, all right.\" \\n\\n \\n\\n \"Happy, hell!\" \\n\\n \\n\\n Pernod is greenish imitation absinthe. When you add water it turns milky. It tastes like licorice and it has a good uplift, but it drops you just as far. We sat and drank it, and the girl looked sullen. \\n\\n \\n\\n \"Well,\" I said, \"are you going to buy me a dinner?\" \\n\\n \\n\\n She grinned and I saw why she made a point of not laughing. With her mouth closed she was a rather pretty girl. I paid for the saucers and we walked out to the street. I hailed a horse-cab and the driver pulled up at the curb. Settled back in the slow, smoothly rolling _fiacre_ we moved up the Avenue de l\u0027Opéra, passed the locked doors of the shops, their windows lighted, the Avenue broad and shiny and almost deserted. The cab passed the New York _Herald_ bureau with the window full of clocks. \\n\\n \\n\\n \"What are all the clocks for?\" she asked. \\n\\n \\n\\n \"They show the hour all over America.\" \\n\\n \\n\\n \"Don\u0027t kid me.\" \\n\\n \\n\\n We turned off the Avenue up the Rue des Pyramides, through the traffic of the Rue de Rivoli, and through a dark gate into the Tuileries. She cuddled against me and I put my arm around her. She looked up to be kissed. She touched me with one hand and I put her hand away. \\n\\n \\n\\n \"Never mind.\" \\n\\n \\n\\n \"What\u0027s the matter? You sick?\" \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"Everybody\u0027s sick. I\u0027m sick, too.\" \\n\\n \\n\\n We came out of the Tuileries into the light and crossed the Seine and then turned up the Rue des Saints Pères. \\n\\n \\n\\n \"You oughtn\u0027t to drink pernod if you\u0027re sick.\" \\n\\n \\n\\n \"You neither.\" \\n\\n \\n\\n \"It doesn\u0027t make any difference with me. It doesn\u0027t make any difference with a woman.\" \\n\\n \\n\\n \"What are you called?\" \\n\\n \\n\\n \"Georgette. How are you called?\" \\n\\n \\n\\n \"Jacob.\" \\n\\n \\n\\n \"That\u0027s a Flemish name.\" \\n\\n \\n\\n \"American too.\" \\n\\n \\n\\n \"You\u0027re not Flamand?\" \\n\\n \\n\\n \"No, American.\" \\n\\n \\n\\n \"Good, I detest Flamands.\" \\n\\n \\n\\n By this time we were at the restaurant. I called to the _cocher_ to stop. We got out and Georgette did not like the looks of the place. \"This is no great thing of a restaurant.\" \\n\\n \\n\\n \"No,\" I said. \"Maybe you would rather go to Foyot\u0027s. Why don\u0027t you keep the cab and go on?\" \\n\\n \\n\\n I had picked her up because of a vague sentimental idea that it would be nice to eat with some one. It was a long time since I had dined with a _poule_, and I had forgotten how dull it could be. We went into the restaurant, passed Madame Lavigne at the desk and into a little room. Georgette cheered up a little under the food. \\n\\n \\n\\n \"It isn\u0027t bad here,\" she said. \"It isn\u0027t chic, but the food is all right.\" \\n\\n \\n\\n \"Better than you eat in Liege.\" \\n\\n \\n\\n \"Brussels, you mean.\" \\n\\n \\n\\n We had another bottle of wine and Georgette made a joke. She smiled and showed all her bad teeth, and we touched glasses. \\n\\n \\n\\n \"You\u0027re not a bad type,\" she said. \"It\u0027s a shame you\u0027re sick. We get on well. What\u0027s the matter with you, anyway?\" \\n\\n \\n\\n \"I got hurt in the war,\" I said. \\n\\n \\n\\n \"Oh, that dirty war.\" \\n\\n \\n\\n We would probably have gone on and discussed the war and agreed that it was in reality a calamity for civilization, and perhaps would have been better avoided. I was bored enough. Just then from the other room some one called: \"Barnes! I say, Barnes! Jacob Barnes! \\n\\n \\n\\n \"It\u0027s a friend calling me,\" I explained, and went out. \\n\\n \\n\\n There was Braddocks at a big table with a party: Cohn, Frances Clyne, Mrs. Braddocks, several people I did not know. \\n\\n \\n\\n \"You\u0027re coming to the dance, aren\u0027t you?\" Braddocks asked. \\n\\n \\n\\n \"What dance?\" \\n\\n \\n\\n \"Why, the dancings. Don\u0027t you know we\u0027ve revived them?\" Mrs. Braddocks put in. \\n\\n \\n\\n \"You must come, Jake. We\u0027re all going,\" Frances said from the end of the table. She was tall and had a smile. \\n\\n \\n\\n \"Of course, he\u0027s coming,\" Braddocks said. \"Come in and have coffee with us, Barnes.\" \\n\\n \\n\\n \"Right.\" \\n\\n \\n\\n \"And bring your friend,\" said Mrs. Braddocks laughing. She was a Canadian and had all their easy social graces. \\n\\n \\n\\n \"Thanks, we\u0027ll be in,\" I said. I went back to the small room. \\n\\n \\n\\n \"Who are your friends?\" Georgette asked. \\n\\n \\n\\n \"Writers and artists.\" \\n\\n \\n\\n \"There are lots of those on this side of the river.\" \\n\\n \\n\\n \"Too many.\" \\n\\n \\n\\n \"I think so. Still, some of them make money.\" \\n\\n \\n\\n \"Oh, yes.\" \\n\\n \\n\\n We finished the meal and the wine. \"Come on,\" I said. \"We\u0027re going to have coffee with the others.\" \\n\\n \\n\\n Georgette opened her bag, made a few passes at her face as she looked in the little mirror, re-defined her lips with the lip-stick, and straightened her hat. \\n\\n \\n\\n \"Good,\" she said. \\n\\n \\n\\n We went into the room full of people and Braddocks and the men at his table stood up. \\n\\n \\n\\n \"I wish to present my fiancée, Mademoiselle Georgette Leblanc,\" I said. Georgette smiled that wonderful smile, and we shook hands all round. \\n\\n \\n\\n \"Are you related to Georgette Leblanc, the singer?\" Mrs. Braddocks asked. \\n\\n \\n\\n \"Connais pas,\" Georgette answered. \\n\\n \\n\\n \"But you have the same name,\" Mrs. Braddocks insisted cordially. \\n\\n \\n\\n \"No,\" said Georgette. \"Not at all. My name is Hobin.\" \\n\\n \\n\\n \"But Mr. Barnes introduced you as Mademoiselle Georgette Leblanc. Surely he did,\" insisted Mrs. Braddocks, who in the excitement of talking French was liable to have no idea what she was saying. \\n\\n \\n\\n \"He\u0027s a fool,\" Georgette said. \\n\\n \\n\\n \"Oh, it was a joke, then,\" Mrs. Braddocks said. \\n\\n \\n\\n \"Yes,\" said Georgette. \"To laugh at.\" \\n\\n \\n\\n \"Did you hear that, Henry?\" Mrs. Braddocks called down the table to Braddocks. \"Mr. Barnes introduced his fiancee as Mademoiselle Leblanc, and her name is actually Hobin.\" \\n\\n \\n\\n \"Of course, darling. Mademoiselle Hobin, I\u0027ve known her for a very long time.\" \\n\\n \\n\\n \"Oh, Mademoiselle Hobin,\" Frances Clyne calIed, speaking French very rapidly and not seeming so proud and astonished as Mrs. Braddocks at its coming out really French. \"Have you been in Paris long? Do you like it here? You love Paris, do you not?\" \\n\\n \\n\\n \"Who\u0027s she?\" Georgette turned to me. \"Do I have to talk to her?\" \\n\\n \\n\\n She turned to Frances, sitting smiling, her hands folded, her head poised on her long neck, her lips pursed ready to start talking again. \\n\\n \\n\\n \"No, I don\u0027t like Paris. It\u0027s expensive and dirty.\" \\n\\n \\n\\n \"Really? I find it so extraordinarily clean. One of the cleanest cities in all Europe.\" \\n\\n \\n\\n \"I find it dirty.\" \\n\\n \\n\\n \"How strange! But perhaps you have not been here very long.\" \\n\\n \\n\\n \"I\u0027ve been here long enough.\" \\n\\n \\n\\n \"But it does have nice people in it. One must grant that.\" \\n\\n \\n\\n Georgette turned to me. \"You have nice friends.\" \\n\\n \\n\\n Frances was a little drunk and would have liked to have kept it up but the coffee came, and Lavigne with the liqueurs, and after that we all went out and started for Braddocks\u0027s dancing-club. \\n\\n \\n\\n The dancing-club was a _bal musette_ in the Rue de la Montagne Sainte Genevieve. Five nights a week the working people of the Pantheon quarter danced there. One night a week it was the dancingclub. On Monday nights it was closed. When we arrived it was quite empty, except for a policeman sitting near the door, the wife of the proprietor back of the zinc bar, and the proprietor himself. The daughter of the house came down-stairs as we went in. There were long benches, and tables ran across the room, and at the far end a dancing-floor. \\n\\n \\n\\n \"I wish people would come earlier,\" Braddocks said. The daughter came up and wanted to know what we would drink. The proprietor got up on a high stool beside the dancing-floor and began to play the accordion. He had a string of bells around one of his ankles and beat time with his foot as he played. Every one danced. It was hot and we came off the floor perspiring. \\n\\n \\n\\n \"My God,\" Georgette said. \"What a box to sweat in!\" \\n\\n \\n\\n \"It\u0027s hot.\" \\n\\n \\n\\n \"Hot, my God!\" \\n\\n \\n\\n \"Take off your hat.\" \\n\\n \\n\\n \"That\u0027s a good idea.\" \\n\\n \\n\\n Some one asked Georgette to dance, and I went over to the bar. It was really very hot and the accordion music was pleasant in the hot night. I drank a beer, standing in the doorway and getting the cool breath of wind from the street. Two taxis were coming down the steep street. They both stopped in front of the Bal. A crowd of young men, some in jerseys and some in their shirt-sleeves, got out. I could see their hands and newly washed, wavy hair in the light from the door. The policeman standing by the door looked at me and smiled. They came in. As they went in, under the light I saw white hands, wavy hair, white faces, grimacing, gesturing, talking. With them was Brett. She looked very lovely and she was very much with them. \\n\\n \\n\\n One of them saw Georgette and said: \"I do declare. There is an actual harlot. I\u0027m going to dance with her, Lett. You watch me.\" \\n\\n \\n\\n The tall dark one, called Lett, said: \"Don\u0027t you be rash.\". \\n\\n \\n\\n The wavy blond one answered: \"Don\u0027t you worry, dear.\" And with them was Brett. \\n\\n \\n\\n I was very angry. Somehow they always made me angry. I know they are supposed to be amusing, and you should be tolerant, but I wanted to swing on one, any one, anything to shatter that superior, simpering composure. Instead, I walked down the street and had a beer at the bar at the next Bal. The beer was not good and I had a worse cognac to take the taste Out of my mouth. When I came back to the Bad there was a crowd on the floor and Georgette was dancing with the tall blond youth, who danced big-hippily, carrying his head on one side, his eyes lifted as he danced. As soon as the music stopped another one of them asked her to dance. She had been taken up by them. I knew then that they would all dance with her. They are like that. \\n\\n \\n\\n I sat down at a table. Cohn was sitting there. Frances was dancing. Mrs. Braddocks brought up somebody and introduced him as Robert Prentiss. He was from New York by way of Chicago, and was a rising new novelist. He had some sort of an English accent. I asked him to have a drink. \\n\\n \\n\\n \"Thanks so much,\" he said, \"I\u0027ve just had one.\" \\n\\n \\n\\n \"Have another.\" \\n\\n \\n\\n \"Thanks, I will then.\" \\n\\n \\n\\n We got the daughter of the house over and each had a _fine a l\u0027eau_. \\n\\n \\n\\n \"You\u0027re from Kansas City, they tell me,\" he said. \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"Do you find Paris amusing?\" \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"Really?\" \\n\\n \\n\\n I was a little drunk. Not drunk in any positive sense but just enough to be careless. \\n\\n \\n\\n \"For God\u0027s sake,\" I said, \"yes. Don\u0027t you?\" \\n\\n \\n\\n \"Oh, how charmingly you get angry,\" he said. \"I wish I had that faculty.\" \\n\\n \\n\\n I got up and walked over toward the dancing-floor. Mrs. Braddocks followed me. \"Don\u0027t be cross with Robert,\" she said. \"He\u0027s still only a child, you know.\" \\n\\n \\n\\n \"I wasn\u0027t cross,\" I said. \"I just thought perhaps I was going to throw up.\" \\n\\n \\n\\n \"Your fiancée is having a great success,\" Mrs. Braddocks looked out on the floor where Georgette was dancing in the arms of the tall, dark one, called Lett. \\n\\n \\n\\n \"Isn\u0027t she?\" I said. \\n\\n \\n\\n \"Rather,\" said Mrs. Braddocks. \\n\\n \\n\\n Cohn came up. \"Come on, Jake,\" he said, \"have a drink.\" We walked over to the bar. \"What\u0027s the matter with you? You seem all worked up over something?\" \\n\\n \\n\\n \"Nothing. This whole show makes me sick is all.\" \\n\\n \\n\\n Brett came up to the bar. \\n\\n \\n\\n \"Hello, you chaps.\" \\n\\n \\n\\n \"Hello, Brett,\" I said. \"Why aren\u0027t you tight?\" \\n\\n \\n\\n \"Never going to get tight any more. I say, give a chap a brandy and soda.\" \\n\\n \\n\\n She stood holding the glass and I saw Robert Cohn looking at her. He looked a great deal as his compatriot must have looked when he saw the promised land. Cohn, of course, was much younger. But he had that look of eager, deserving expectation. \\n\\n \\n\\n Brett was damned good-looking. She wore a slipover jersey sweater and a tweed skirt, and her hair was brushed back like a boy\u0027s. She started all that. She was built with curves like the hull of a racing yacht, and you missed none of it with that wool jersey. \\n\\n \\n\\n \"It\u0027s a fine crowd you\u0027re with, Brett,\" I said. \\n\\n \\n\\n \"Aren\u0027t they lovely? And you, my dear. Where did you get it?\" \\n\\n \\n\\n \"At the Napolitain.\" \\n\\n \\n\\n \"And have you had a lovely evening?\" \\n\\n \\n\\n \"Oh, priceless,\" I said. \\n\\n \\n\\n Brett laughed. \"It\u0027s wrong of you, Jake. It\u0027s an insult to all of us. Look at Frances there, and Jo.\" \\n\\n \\n\\n This for Cohn\u0027s benefit. \\n\\n \\n\\n \"It\u0027s in restraint of trade,\" Brett said. She laughed again. \\n\\n \\n\\n \"You\u0027re wonderfully sober,\" I said. \\n\\n \\n\\n \"Yes. Aren\u0027t I? And when one\u0027s with the crowd I\u0027m with, one can drink in such safety, too.\" \\n\\n \\n\\n The music started and Robert Cohn said: \"Will you dance this with me, Lady Brett?\" \\n\\n \\n\\n Brett smiled at him. \"I\u0027ve promised to dance this with Jacob,\" she laughed. \"You\u0027ve a hell of a biblical name, Jake.\" \\n\\n \\n\\n \"How about the next?\" asked Cohn. \\n\\n \\n\\n \"We\u0027re going,\" Brett said. \"We\u0027ve a date up at Montmartre.\" \\n\\n \\n\\n Dancing, I looked over Brett\u0027s shoulder and saw Cohn, standing at the bar, still watching her. \\n\\n \\n\\n \"You\u0027ve made a new one there,\" I said to her. \\n\\n \\n\\n \"Don\u0027t talk about it. Poor chap. I never knew it till just now.\" \\n\\n \\n\\n \"Oh, well,\" I said. \"I suppose you like to add them up.\" \\n\\n \\n\\n \"Don\u0027t talk like a fool.\" \\n\\n \\n\\n \"You do.\" \\n\\n \\n\\n \"Oh, well. What if I do?\" \\n\\n \\n\\n \"Nothing,\" I said. We were dancing to the accordion and some one was playing the banjo. It was hot and I felt happy. We passed close to Georgette dancing with another one of them. \\n\\n \\n\\n \"What possessed you to bring her?\" \\n\\n \\n\\n \"I don\u0027t know, I just brought her.\" \\n\\n \\n\\n \"You\u0027re getting damned romantic.\" \\n\\n \\n\\n \"No, bored.\" \\n\\n \\n\\n \"Now?\" \\n\\n \\n\\n \"No, not now.\" \\n\\n \\n\\n \"Let\u0027s get out of here. She\u0027s well taken care of.\" \\n\\n \\n\\n \"Do you want to?\" \\n\\n \\n\\n \"Would I ask you if I didn\u0027t want to?\" \\n\\n \\n\\n We left the floor and I took my coat off a hanger on the wall and put it on. Brett stood by the bar. Cohn was talking to her. I stopped at the bar and asked them for an envelope. The patronne found one. I took a fifty-franc note from my pocket, put it in the envelope, sealed it, and handed it to the patronne. \\n\\n \\n\\n \"If the girl I came with asks for me, will you give her this?\" I said. \"If she goes out with one of those gentlemen, will you save this for me?\" \\n\\n \\n\\n \"C\u0027est entendu, Monsieur,\" the patronne said. \"You go now? So early?\" \\n\\n \\n\\n \"Yes,\" I said. \\n\\n \\n\\n We started out the door. Cohn was still talking to Brett. She said good night and took my arm. \"Good night, Cohn,\" I said. Outside in the street we looked for a taxi. \\n\\n \\n\\n \"You\u0027re going to lose your fifty francs,\" Brett said. \\n\\n \\n\\n \"Oh, yes.\" \\n\\n \\n\\n \"No taxis.\" \\n\\n \\n\\n \"We could walk up to the Pantheon and get one.\" \\n\\n \\n\\n \"Come on and we\u0027ll get a drink in the pub next door and send for one.\" \\n\\n \\n\\n \"You wouldn\u0027t walk across the street.\" \\n\\n \\n\\n \"Not if I could help it.\" \\n\\n \\n\\n We went into the next bar and I sent a waiter for a taxi. \\n\\n \\n\\n \"Well,\" I said, \"we\u0027re out away from them.\" \\n\\n \\n\\n We stood against the tall zinc bar and did not talk and looked at each other. The waiter came and said the taxi was outside. Brett pressed my hand hard. I gave the waiter a franc and we went out. \"Where should I tell him?\" I asked. \\n\\n \\n\\n \"Oh, tell him to drive around.\" \\n\\n \\n\\n I told the driver to go to the Parc Montsouris, and got in, and slammed the door. Brett was leaning back in the corner, her eyes closed. I sat beside her. The cab started with a jerk. \\n\\n \\n\\n \"Oh, darling, I\u0027ve been so miserable,\" Brett said. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/lizhi/11/150.html","bookId":329,"book":{"id":329,"title":"The Sun Also Rises太阳照常升起","description":"简介： 《太阳照常升起》是美国作家海明威于1926年出版的长篇小说。作者藉此成为迷惘的一代的代言人，并以此书开创了海明威式的独特文风。小说以1924年至1925年这一历史时段和名城巴黎为背景，围绕一群在感情或爱情上遭受过严重创伤或者在战争中落下了严重心理或生理机能障碍的...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12854023179f0f8.jpg","type":"Inspirational","link":"http://novel.tingroom.com/lizhi/11","creation":"Aug 1, 2019 12:18:34 AM","modification":"Aug 1, 2019 12:18:34 AM"}}
