{"id":66570,"no":11,"title":"Page 11","content":"Standing, she found Ian several feet back, watching her.\n Neither spoke. He wore his thick Navy coat, with his white sailor’s cap. His hands were buried in his coat pockets, arms pressed against his sides.\n “I saw you leave the grocery store,” he murmured.\n “You followed me here?” She didn’t like the idea of that.\n He nodded. “It isn’t a habit, if that’s what you’re thinking. I just happened to see you and wanted to talk.”\n Cecilia thrust her own hands into her pockets, waiting, unsure what to say.\n “I wondered if this was where you were heading,” Ian continued, “and I was right.” He paused, shrugging. “I thought we could talk.”\n She stiffened. “What’s there to talk about?” The last time she’d seen him, he’d been drinking and argumentative.\n Ian sighed, glancing past her, past the row of graves. “I want to apologize for showing up at the restaurant the other night.”\n “Andrew told me you’re leaving on the George Washington.”\n “Yeah.” He didn’t elaborate, or explain the transfer.\n “When did you get assigned to the carrier?”\n “You’d know the answer to that if you hadn’t been in such a hurry to file for divorce,” he said with unconcealed bitterness.\n “We couldn’t—can’t—even talk without snarling at each other.” Then and now. It hurt so badly to be standing on one side of their daughter’s grave while he stood on the other.\n “Does it matter?” he asked. “I’m in the Navy—that hasn’t changed.”\n She shook her head. The reasons were unimportant; he didn’t owe her an explanation. Defensiveness had become an automatic response, a means of keeping people at a distance. Especially him…\n “Damn,” he said impatiently. “Why is it so hard to talk to you?”\n Didn’t he already know? What else could she say?\n “Like I said, I’m sorry about the other night. It won’t happen again.” He turned away, his movement abrupt.\n “You’re leaving soon?” she called after him, not wanting him to walk off just yet.\n He turned back to face her and nodded.\n “I’d like to know about the transfer.”\n He stared down at their daughter’s grave. “I requested it. If I’d been assigned to the carrier when Allison was born, I could’ve been airlifted home. To be with you…. It’s a moot point now, but I didn’t want to risk anything like that ever again.”\n She hadn’t known such a transfer was possible.\n “I’ll be away for six months,” he told her.\n It sounded longer than a lifetime. Her reaction must have shown on her face.\n “I can’t help that,” he said.\n “I know,” she whispered.\n “I suppose you’re worried about your divorce.”\n He always referred to it like that, emphasizing whose decision it had been. “The delay doesn’t matter,” she said. “I don’t have any money for attorney’s fees, anyway.”\n “I thought you wanted to take it to the Dispute Resolution Center?”\n “I did, but with you at sea, it’d be a waste of time, wouldn’t it?” She could talk to an impartial third party, but without Ian available, they wouldn’t be able to resolve anything.\n “We’re still legally married then—right?”\n Cecilia guessed this was his way of telling her he regretted last week’s suggestion about pretending they were divorced.\n “Yes,” she said. “You don’t need to worry that I’ll be dating anyone else.”\n He frowned.\n Perhaps she’d read him wrong. “That’s what you were saying, wasn’t it?” She couldn’t help recalling his reaction to the man in the bar.\n He looked at her blankly. “No, but I’m glad to hear it. No man likes to think of his wife with someone else, regardless of the situation.”\n Now Cecilia was confused. “Exactly what are you saying? Do you want us to be married? Or do you just want me to remember that I’m still legally bound to you?”\n “I want you to keep in mind that we’re stuck together—legally and financially—until we can sort this mess out, all right?”\n Cecilia nodded, crossing her arms. She had a feeling she wasn’t going to like his reasoning.\n “The last time I was away…” He paused and glanced toward Allison’s gravestone. “You ran up the credit cards. While we’re still married, I’m legally responsible for those bills, so I’d appreciate it if you used some discretion.”\n It would have hurt less if he’d punched her.\n “You mean you’re worried about me spending money while you’re at sea?” She couldn’t believe he’d say such a thing. “Every penny I spent, every single penny that went on those charge cards, was so I could bury Allison.” Cecilia started to shake, first with anger, then with outrage. How dared he? How dared he! If she’d needed a reminder of why she could no longer stay in this marriage, he’d certainly given it to her.\n “I didn’t mean that the way it sounded,” he said.\n “It won’t happen again,” she said in a deadened voice, consciously echoing his earlier words.\n Ian shook his head. “I don’t even know why I mentioned that. I’m sorry.”\n She ignored him. Her lack of response should be answer enough.\n “You do this every time,” he said, sounding exasperated. “I try to talk to you, get things into the open and you clam up on me like I’m not even here.”\n Her arms remained buried deep in her pockets, her head down. “Every penny I charged was so I could bury our daughter,” she repeated dully. “And the three-hundred-dollar phone bill…I know it upset you, but—”\n Suddenly she could no longer control her voice—or her emotions.\n “But that was for me!” she cried, shouting the words at him, hurling them in her anger and pain. “So there wouldn’t be two funerals that day instead of one. I’m sorry, Ian, for being so weak, but I’m not like you. I needed my mother…I needed to talk to someone. My dad couldn’t deal with it and you weren’t here. My mother…” Unwilling to have him witness her tears, she whirled around and started searching frantically through her purse.\n “Cecilia?”\n She found what she was looking for and tore open the small plastic holder. “Here,” she choked, taking out the VISA card and throwing it at him. The card landed on the wet green grass. “Take it! I don’t want it….”\n He hesitated before picking it up. “You might need it for emergencies.”\n As though the death of their daughter hadn’t been one.\n She shook her head vehemently. She’d rot in hell before she’d use any credit card with his name on it again. She’d get one with her own name. Her maiden name.\n Ian examined the card, and ran his thumb over the raised letters that spelled out Cecilia Randall.\n “I didn’t come here to get your credit card.”\n “Well, you have it now,” she returned flippantly, refusing to look at him.\n Ian said nothing. A long moment passed. “I’m sorry, Cecilia,” he finally whispered.\n “What for this time?”\n There was another pause. “I’m going away for six months,” he murmured. “I wish we’d been able to settle this divorce business before I left, but…”\n They’d been over this too many times already.\n “I’d like to leave without bad feelings between us. I know you’d rather not be married to me anymore, but we can’t do anything about that right now.”\n “And your point is?” she asked, deliberately sarcastic.\n “Dammit, Cecilia, would you listen to us? Is this what you want? Is this how you want things to be? I don’t. I followed you here because I thought…I hoped there’d be a chance for us to end this on a friendly note.”\n “Divorces aren’t friendly.”\n “You’re right, but does that give you any pleasure?”\n It didn’t. She knew why he’d come. Ian would leave for sea in a few days, and when he left he wanted to go without a huge knot in his gut over her.\n “Goodbye, Ian,” she said softly. “Have a good tour.”\n He frowned, as though he wasn’t sure he should trust her. “Do you mean it?”\n She nodded. “I don’t want to fight, I never did. Go with a clear conscience. When you get back, we’ll settle all the legal stuff.”\n “Thank you.” His relief was evident and his eyes softened as he turned away. Cecilia watched him disappear into the fog, watched until she could no longer see his dark shape.\n She closed her eyes. She pictured how their parting might have been if Allison had lived. She’d be standing on the pier with all the other Navy wives and Ian would kiss her goodbye, kiss Allison and then her again, one last time. Then he’d run toward the aircraft carrier and she’d hold the baby in her arms, raise Allison’s tiny arm so she could send her daddy off with a wave. Instead, they bade each other farewell standing over their daughter’s grave.\n Justine had avoided her mother all weekend, and with good reason. The minute they were together, Olivia would start to criticize Warren. Not openly, but she’d insinuate things. For instance, she’d mention some piece of gossip she’d supposedly heard about one of his ex-wives. Or she’d refer to problems with one or other of the homes his company constructed.\n In Justine’s opinion, the fact that she was seeing Warren was none of her mother’s business. Okay, he was a few years older. And she’d concede that his reputation wasn’t the greatest. But there were things about Warren that her mother and most other people didn’t know and never would. Warren trusted her and his confidence meant a great deal to her.\n The second reason Justine had been avoiding her mother had to do with her brother James. A year earlier, without warning, he’d joined the Navy and as a result, was away from home for the first time. He missed his family, and their mother fretted about him. Now her younger brother had made another life-altering decision and had left it to Justine to announce to their family.\n “Tell her for me,” he’d pleaded, and because she loved him she’d foolishly agreed.\n Now a confrontation was inevitable. Monday morning, she’d half decided to call her grandmother and let Charlotte deliver the news. She went as far as picking up the phone and actually dialing the number. At the first ring, she’d replaced the receiver, berating herself as a coward.\n All afternoon, she’d had difficulty concentrating on loan applications and staff meetings—she was the manager of the Cedar Cove branch of First National Bank and had plenty of responsibilities to occupy her. Justine sighed; she knew she had to tell her mother in person and as soon as possible.\n After work, she drove straight from the bank to the family home at 16 Lighthouse Road. She’d lived here until she left for college ten years ago; she’d returned for short periods in the intervening years. It was home in a way no other place had ever been. Every time she took the curve in the road and came upon it, Justine experienced a sensation that had been impossible to reproduce anywhere she’d lived since. \n","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-11.html","bookId":1941,"book":{"id":1941,"title":"16 Lighthouse Road (Cedar Cove #1)","description":"Storyline: \n 16 Lighthouse Road (Cedar Cove #1) \n Olivia Lockhart \n 16 Lighthouse Road \n Cedar Cove, Washington \n Dear Reader, \n You don\u0027t know me yet, but in a few hours that\u0027s going to change. You see, I\u0027m inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! \n I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there\u0027s my mother, Charlotte, who has plenty of opinions and is always willing to share them. \n Here\u0027s an example: I\u0027m a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte\u0027s view, young Cecilia and Ian Randall hadn\u0027t tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. \n Well, you wouldn\u0027t believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn\u0027t mind seeing more of!), everyone\u0027s talking. \n Cedar Cove - people love it and sometimes they leave it, but they never forget it! \n See you soon ... \n Olivia\n \n","cover":"https://allnovel.net/images/16-lighthouse-road-cedar-cove-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/16-lighthouse-road-cedar-cove-1.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:05 AM"}}
