{"id":66571,"no":12,"title":"Page 12","content":"She parked out front. Her mother must have been looking out the window when she drove up, because she opened the door as Justine climbed the steps to the porch. “Sweetheart,” Olivia said, holding out her arms for a hug. “This is a pleasant surprise.” Justine forced a smile. “You’re just in time for dinner.” Justine could never figure out why her mother insisted on feeding her. It was the same with her grandmother. A maternal need to nurture, she supposed. Not that she needed nurturing anymore. Well, not that kind. “Great,” she said, without enthusiasm. Her stomach was in knots already. Olivia took a good look at her. “Something on your mind?” Radar. Justine swore her mother had radar. “Why don’t you make a pot of tea?” she suggested. Her mother froze. “You’re pregnant, aren’t you? Dear God, don’t tell me you’re going to marry Warren!” “Mother, just make the tea and no, I’m not pregnant.” “Thank God.” Her relief couldn’t have been more evident. Did she even realize how insulting her reaction was? Olivia moved into the kitchen and Justine followed. “That was rude of me, honey. Forgive me,” her mother said, putting the kettle on the burner. She sighed. “You know the way I feel about Warren.” Justine didn’t need to be reminded. “But you seem to enjoy his company and that’s all that matters.” Justine didn’t respond to her mother’s halfhearted apology. What was the point? Yes, she liked Warren, but she wasn’t blind to his faults, either. The most appealing thing about him was his age. Justine liked older men. They were settled, confident and, for the most part, secure. She didn’t intend on having children herself and was looking for a mature relationship. She found most men her own age childish and irresponsible. Olivia poured the tea and carried two cups to the dining-room table. “All right,” she said when they’d both sat down. “If you’re not pregnant, then what’s wrong?” Justine ignored the question and doctored her tea. “I heard from James last week.” Her mother stared at her blankly. “What does James have to do with this?” “He sounded good.” “Good?” “Happy,” she elaborated. “Does he have a new girlfriend?” She couldn’t believe her mother hadn’t made the connection. “Not…exactly.” “He’s seeing the same girl as before? Selina? I can’t recall her surname at the moment.” “Solis.” “Hmm. Every time James mentions her, they’re fighting over one thing or another.” “They’re getting along just fine at the moment,” Justine said, struggling not to laugh outright. Her mother appeared to be completely dense. “I’m glad to hear it.” “Are you, Mother?” Justine pressed. “Of course I am.” Olivia hesitated. “Are you trying to tell me that James and Selina are engaged?” “No, I’m here to tell you they’re married.” “Married?” Olivia came out of her chair and just as quickly sat down again. “Married? Without letting me know? Without a word until the deed is done?” “James was afraid of how you’d react.” “He should be a lot more afraid of what I’m going to say now,” Olivia muttered grimly. “Why would he think such a thing? What about Selina’s family? Was it as much of a shock to them?” “Apparently not.” “How do you mean?” “Selina’s father insisted they be married by a priest.” “James isn’t Catholic.” “He’s converting.” Justine could see from the bewilderment in her mother’s eyes that she found it difficult to take in the news. The son she’d raised Protestant had converted to Catholicism overnight. “He must love her very much,” Olivia responded thoughtfully. “I’m sure he does.” “So in other words, my son and this young woman I’ve never met were married in a Catholic ceremony without telling anyone from our family?” “Yes,” Justine concurred. “Why?” Justine held her breath for an instant. “James wanted you and Dad there, but he was afraid you might disapprove.” “For the love of heaven, why? Because Selina’s Hispanic? James knows us better than that.” Justine shrugged. She disagreed with what her brother had done, but it was too late to worry about that. “When will I meet her?” “Mom, there’s more.” Olivia set the cup back into the saucer. “Selina’s pregnant, isn’t she?” Finally, Mom. It took you long enough. “I talked to Selina myself,” Justine said cheerfully. “She sounds delightful. James is crazy about her and I’m sure she’s going to make him a good wife.” Her mother didn’t look nearly as certain. “How far along?” This was the hard part. “She’s due in four months.” “Four months,” her mother echoed. “I’m going to be a grandmother in four months?” “It seems that way.” Her mother didn’t say anything for several moments, then her eyes glistened and Justine could tell she was struggling not to cry. “Mom, does being a grandmother bother you so much?” Olivia shook her head and dabbed at her eyes with the napkin. “Oh, no…I just wish my son had the courage to tell me himself.” Justine hugged her close. “He’s waiting to hear from you now. Do you want me to dial the phone for you?” Her mother nodded. “Please.” Five Cecilia arrived for work at four, an hour earlier than she was scheduled to start. The bar at The Captain’s Galley was already getting crowded. She slipped onto a padded stool, hoping for an opportunity to speak to her father. “How you doin’, kiddo?” Bobby Merrick asked from the other side of the counter. “Can I get you something to drink?” Cecilia hated it when he treated her like a customer. “Okay, how about a cup of coffee?” “You sure you don’t want anything stronger?” “Positive.” In some respects, her father had never grown up, still dressing and acting like he had as a young man. He had shoulder-length graying hair, and his wardrobe consisted of wildly printed shirts that he wore with jeans. While that didn’t bother Cecilia, there were times she wanted and needed him to be a father. This afternoon was one of those times. He brought her a mug of stale black coffee, waited on someone else, then drifted back to visit with her. “Heard from your mother lately?” he asked. After her parents’ divorce, Bobby—which he insisted Cecilia call him—had left New Jersey and moved first to New Mexico, then Arizona and had gradually drifted north to Washington State. “She phoned this weekend.” “She’s well?” To the best of her knowledge, her parents hadn’t spoken to or seen each other in years, until last May, when her mother flew out for Cecilia’s wedding. Now all of a sudden Bobby was asking about her. “Mom’s doing fine.” “I’m glad to hear it,” he said, leaning against the bar. “She’s one hell of a woman.” That being the case, Cecilia wondered why he’d abandoned them both, but she didn’t want to bring up any unpleasantness. She understood her father. He couldn’t tolerate conflict of any kind. He wanted people to love each other and get along, as he’d frequently explained to Cecilia. He couldn’t function if anyone was upset with him; he even disliked being around other people’s arguments. When a situation became too intense for him, he simply moved on. He’d asked about her mother, but he hadn’t sought her out, hadn’t called or written her in years. That made sense. He didn’t want to hear about difficulties or disappointments—especially if he’d caused them. When Allison Marie died, he’d stayed away, emotionally and physically. He was incapable of giving Cecilia the support she’d needed so badly; he didn’t have it in him. It’d taken her time to reach this conclusion. She could be angry with him, perhaps should have been, but it wouldn’t have done any good. Bobby was Bobby, and she either had to accept him or do without a father, lame as he was in that role. “I was out at Olympic College this afternoon.” “You were?” “Yeah, I signed up for an algebra class and for English.” It was the 101-level, basic stuff, but she had to start somewhere. For the first time in a very long while, she was looking toward the future instead of dwelling on the past. “Algebra?” “I was always good with numbers.” Math was something she enjoyed and she’d done well at it in high school. She liked the sense of order mathematics offered her. Everything fell neatly into place, and problems all had solutions. Perhaps that was what appealed to her most. “How are you going to use algebra?” Cecilia didn’t know that yet, but this was more a refresher course than anything that would lead to a career. “It’s important that I know how to solve for x,” she said, just for fun. “That’s how I can unlock the secrets of the universe. Like Einstein, you know. It all starts with x.” Bobby’s eyes widened. “Really?” It was a joke, and he’d taken her seriously. “Sure. Well, sort of.” Clearly he wouldn’t have been any help with high-school math if he’d been around. “What do you think about me taking these classes?” she asked, seeking his encouragement. His returning look was blank. “Hey, that’s cool.” Cool? She’d done it again. Once more she’d set herself up for disappointment. She should’ve known Bobby’s response would be inadequate at best. He waited on a customer, and Cecilia slipped off the stool, ready to start her shift at the restaurant. “We’ll talk later,” Bobby called after her. She nodded. This was about as deep as any conversation went with him. The man just didn’t get it, and nothing she said or did was going to change that. Before long, the restaurant started to fill up. Escorting customers to their tables, answering the phone and manning the cash register kept her busy. She preferred it that way. It was when she had time on her hands that her thoughts automatically drifted to Ian. The George Washington had pulled out of Cedar Cove two days earlier. She’d watched it on the evening news, which had shown the massive aircraft carrier gliding through the protected waters of the cove. Cecilia had sat intently in front of the television. She couldn’t have stayed away even if she’d wanted to. Ian was gone. Deployed for six months. She wondered if he’d write. She could go to the library and e-mail him herself, but she wasn’t convinced she should. And yet, that was exactly what she longed to do.","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-12.html","bookId":1941,"book":{"id":1941,"title":"16 Lighthouse Road (Cedar Cove #1)","description":"Storyline: 16 Lighthouse Road (Cedar Cove #1) Olivia Lockhart 16 Lighthouse Road Cedar Cove, Washington Dear Reader, You don\u0027t know me yet, but in a few hours that\u0027s going to change. You see, I\u0027m inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there\u0027s my mother, Charlotte, who has plenty of opinions and is always willing to share them. Here\u0027s an example: I\u0027m a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte\u0027s view, young Cecilia and Ian Randall hadn\u0027t tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. Well, you wouldn\u0027t believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn\u0027t mind seeing more of!), everyone\u0027s talking. Cedar Cove - people love it and sometimes they leave it, but they never forget it! See you soon ... Olivia","cover":"https://allnovel.net/images/16-lighthouse-road-cedar-cove-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/16-lighthouse-road-cedar-cove-1.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:05 AM"}}
