{"id":66561,"no":2,"title":"Page 2","content":"“It’s almost over,” Ian said, his voice low and devoid of emotion. “Yes,” she returned. After a moment’s silence, she added, “I didn’t follow you out here.” She wanted him to know that. “I figured as much.” “It felt like the walls were closing in on me.” He didn’t comment and sank onto one of the wooden benches that lined the hallway outside the courtrooms. He slouched forward, elbows braced against his knees. She sat at the other end of the bench, perched uncomfortably on the very edge. Other people left the crowded courtroom and either disappeared or found a secluded corner to confer with their lawyers. Their whispered voices echoed off the granite walls. “I know you don’t believe me, but I’m sorry it’s come to this,” Ian said. “I am, too.” Then, in case he assumed she might be seeking a reconciliation, she told him, “But it’s necessary.” “I couldn’t agree with you more.” He sat upright, his back ramrod-straight as he folded his arms across his chest. He didn’t look at her again. This was awkward—both of them sitting here like this. But if he could pretend she wasn’t there, she could do the same thing. Surreptitiously, she slid farther back on the bench. This was going to be a long wait. “Well, hello there,” Charlotte Jefferson said as she peeked inside the small private room at Cedar Cove Convalescent Center. “I understand you’re a new arrival.” The elderly, white-haired gentleman slouched forward in his wheelchair, staring at her with clouded brown eyes. Despite the ravages of illness and age—he was in his nineties, she’d learned—she could see he’d once been a handsome man. The classic bone structure was unmistakable. “You don’t need to worry about answering,” she told him. “I know you’re a stroke patient. I just wanted to introduce myself. I’m Charlotte Jefferson. I stopped by to see if there’s anything I can do for you.” He raised his gaze to hers and slowly, as though with great effort, shook his head. “You don’t have to tell me your name. I read it outside the door. You’re Thomas Harding.” She paused. “Janet Lester—the social worker here—mentioned you a few days ago. I’ve always been fond of the name Thomas,” she chattered on. “I imagine your friends call you Tom.” A weak smile told her she was right. “That’s what I thought.” Charlotte didn’t mean to be pushy, but she knew how lonely it must feel to come to a strange town and not know a single, solitary soul. “One of my dearest friends was here for years, and I came to visit with her every Thursday. It got to be such a habit that after Barbara went to be with the Lord, I just continued. Last week, Janet told me you’d just arrived. So I decided to come over today and introduce myself.” He tried to move his right hand, without success. “Is there something I can get you?” she asked, wanting to be helpful. He shook his head again, then with a shaky index finger pointed at the chair across from him. “Ah, I understand. You’re asking me to sit down.” He managed a grin, lopsided though it was. “Well, don’t mind if I do. These dogs are barking.” She sat in the chair he’d indicated and removed her right pump in order to rub some feeling back into her toes. Tom watched her, his eyes keen with interest. “I suppose you’d like to know a little something about Cedar Cove. Well, I don’t blame you, poor man. Thank goodness you got transferred here. Janet said you’d requested Cedar Cove in the first place, but got sent to that facility in Seattle instead. I heard about what happened there. All I can say is it’s a crying shame.” According to Janet, Tom’s previous facility had been closed down for a number of serious violations. The patients, most of whom were wards of the state, were assigned to a variety of care units across Washington. “I’m so glad you’re here in Cedar Cove—it’s a delightful little town, Tom,” she said, purposely using his name. She wanted him to feel acknowledged. He’d spent time in a substandard facility where he’d been treated without dignity or compassion. In fact, Janet had told her the staff there had been particularly neglectful. Charlotte was shocked to hear that; she found it incomprehensible. Imagine being cruel to a vulnerable person like Tom! Imagine ignoring him, leaving him to lie in a dirty bed, never talking to him…. “I see you’ve got a view of the marina from here,” she said with as much enthusiasm as she could muster. “We’re proud of our waterfront. During the summer there’s a wonderful little festival, and of course the Farmer’s Market fills the parking lot next to the library on Saturdays. Every so often, fishing boats dock at the pier and sell their wares. I swear to you, Tom, there’s nothing better than Hood Canal shrimp bought fresh off the boat.” She hesitated, but Tom seemed to be listening, so she went on. “Okay, let’s see what I can tell you about Cedar Cove,” she said, hardly knowing where to start. “This is a small town. Last census, I believe we totaled not quite five thousand. My husband, Clyde, and I both came from the Yakima area, in the eastern part of the state and we moved here after World War II. Back then, Cedar Cove had the only stoplight in the entire county. That was fifty years ago now.” Fifty years. How could all that time have slipped away? “Cedar Cove has changed in some ways, but it’s stayed the same in others,” she said. “A lot of people around here are employed by the Bremerton shipyard, just like they were in the forties. And naturally the Navy has a real impact on the town’s economy.” Tom must have guessed as much, with the Bremerton Naval shipyard on the other side of the cove. Huge aircraft carriers lined the waterfront; so did rows of diesel-powered submarines. The nuclear ones were stationed at the submarine base out in Bangor. On overcast days, the gray flotilla blended with the slate colors of the sky. Tom jerkily placed his right hand over his heart. “You served in the military?” she asked. The older man’s nod was barely perceptible. “God bless you,” Charlotte said. “There’s all that talk about us being the greatest generation, living through the depression and the war, and you know what? They’re right. Young people these days don’t know what it means to sacrifice. They’ve had it far too easy, but then, that’s just my opinion.” Tom’s eyes widened, and Charlotte could tell he agreed with her. Not wanting to get sidetracked, she paused, gnawing on her lower lip. “Now, what else can I tell you?” she murmured. “Well, for one thing, we’re big on sports in Cedar Cove. Friday nights in the fall, half the town shows up for the high-school football games. This time of year, it’s basketball. Two years ago, the softball team took the state championship. My oldest grandson—” She hesitated and looked away, sorry she’d followed this train of thought. “Jordan showed real promise as a baseball player, but he drowned fifteen years ago.” She wasn’t sure what had prompted her to mention Jordan and wished that she hadn’t. A familiar sadness lodged in her heart. “I don’t think I’ll ever get over his death.” Tom, feeble as he was, leaned toward her, as though to rest his hand on hers. It was a touching gesture. “I’m sorry,” she whispered. “I didn’t mean to talk about this. My daughter lives in Cedar Cove,” she continued, forcing a cheerful note into her voice. “She’s a judge—Judge Olivia Lockhart—and I’m proud as can be of her. When she was a little girl, Olivia was a skinny little thing. She grew up tall, though. Very striking. She’s in her early fifties now, and she still turns heads. It’s the way she carries herself. Just looking at her, people know she’s someone important. That’s my daughter, the judge, but to me she’ll always be my little brown-eyed girl. I get a lot of joy out of sitting in her courtroom while she’s presiding.” She shook her head. “Here I am talking about myself instead of Cedar Cove.” If she’d had questions to answer, Charlotte would’ve found this easier; unfortunately, it wasn’t possible for Tom to ask. “We’re only a ferry ride away from Seattle, but we’re a rural community. I live in the town proper, but plenty of folks have chickens and horses. Of course, that’s outside the city limits.” Tom nodded in her direction. “You’re asking about me?” His answering smile told her she’d guessed right. Charlotte smiled, a bit flustered. She lifted her hand to her head and smoothed the soft wavy hair. At seventy-two, her hair was completely white. It suited her, if she did say so herself. Her face was relatively unlined; she’d always been proud of her complexion—a woman was allowed a little vanity, wasn’t she? “I’m a widow,” she began. “Clyde’s been gone nearly twenty years. He died much too young—cancer.” She lowered her eyes. “He worked at the Naval shipyard. We had two children, William and Olivia. You know, the judge. William works in the energy business and travels all over the world, and Olivia married and settled down right here in Cedar Cove. Her children graduated from the same high school she did. The school hangs a picture of each year’s graduating class on the wall and it’s quite interesting to look back on all those young smiling faces and see what’s become of them.” Charlotte grew thoughtful. “Justine’s picture is there. She was Jordan’s twin and oh, I do worry about her. She’s twenty-eight now and dating an older man neither her mother nor I trust.” Charlotte stopped herself from saying more. “James is Olivia’s youngest, and he’s currently in the Navy. It was a shock to all of us when he enlisted. William and his wife decided against children, and I sometimes wonder if they regret that now. I think Will might, but not Georgia.” Although both her children were in their fifties, Charlotte still worried about them. Tom’s eyes drifted shut, then swiftly opened. “You’re tired,” Charlotte said, realizing she was discussing her concerns about her daughter and grand-children more than she was giving Tom an overview of Cedar Cove. He shook his head slightly, as if he didn’t want her to leave. Charlotte stood and placed her hand on his shoulder. “I’ll be back soon, Tom. You should get some sleep. Besides, it’s time I headed for the courthouse. Olivia’s on the bench this morning and I’m finishing a baby blanket.” Deciding she should explain, she added, “I do my best knitting in court. The Chronicle did an article about me a couple of years ago with a photo! There I was, sitting in court with my needles and my yarn. Which reminds me, if you’d like I’ll bring in the local paper and read it to you. Until just this week, we only had the Wednesday edition, but the paper was recently sold and a new editor hired. He’s expanded to two papers a week. Isn’t that nice?”","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-2.html","bookId":1941,"book":{"id":1941,"title":"16 Lighthouse Road (Cedar Cove #1)","description":"Storyline: 16 Lighthouse Road (Cedar Cove #1) Olivia Lockhart 16 Lighthouse Road Cedar Cove, Washington Dear Reader, You don\u0027t know me yet, but in a few hours that\u0027s going to change. You see, I\u0027m inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there\u0027s my mother, Charlotte, who has plenty of opinions and is always willing to share them. Here\u0027s an example: I\u0027m a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte\u0027s view, young Cecilia and Ian Randall hadn\u0027t tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. Well, you wouldn\u0027t believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn\u0027t mind seeing more of!), everyone\u0027s talking. Cedar Cove - people love it and sometimes they leave it, but they never forget it! See you soon ... Olivia","cover":"https://allnovel.net/images/16-lighthouse-road-cedar-cove-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/16-lighthouse-road-cedar-cove-1.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:05 AM"}}
