{"id":66579,"no":20,"title":"Page 20","content":"Her daughter looked away. “When James first called to tell me he and Selina were married—and that she’s pregnant—I was so relieved.” “Relieved?” That was a curious reaction. “It took the pressure off me. I know you want grandchildren and I want you to have them.” She straightened and met Olivia’s gaze. “But unfortunately, you won’t get them from me.” “Justine—” “Listen to me, Mom, please, just this once. I have no intention of ever marrying or having children. I realize you’re concerned about my relationship with Warren, but you don’t need to be. He treats me well and I enjoy his company most of the time, but I’m not serious about him.” “You don’t want to get married?” She shook her head. “I know I’m a disappointment to you and I’m sorry, but please accept that I’m just not interested in being a wife or a mother.” Olivia let the words sink into her heart, then nodded. “I said it earlier and I meant it. I love you, Justine, not for what you do but for who you are.” Her daughter blinked back tears and lowered her head in order to hide the emotion from Olivia, but it was too late. She saw. “Thanks, Mom.” Then as if nothing noteworthy had transpired between them, they went back to eating their salads. Every afternoon as Cecilia arrived for work, she looked across Cedar Cove to the Bremerton shipyard, where the George Washington was still berthed. It’d been more than a week since her dinner with Ian and she hadn’t heard a word from him. Before he’d left her that night, he’d promised to get in touch prior to sailing. Apparently the aircraft carrier was still undergoing repairs. Cecilia knew she had no right to feel disappointed that he hadn’t called. He didn’t have any reason to contact her, other than to leave her the keys to his car. The dinner and movie had been wonderful; the lovemaking, too. Until he’d abruptly left, Cecilia had begun to feel that they’d made a breakthrough in their relationship. Now she wasn’t sure what to think. And she was horrified that they’d done something as foolish as having unprotected sex. Granted, the likelihood of her being pregnant was very slight, but anyone might figure she’d learned her lesson the first time. Apparently not. When she was in his arms, she’d felt desired—and reassured. Safe. Then he’d dressed and run out as if he couldn’t get away fast enough. Now this silence. She didn’t understand any of it. Perhaps Ian was waiting for her to call him. She couldn’t remember exactly what they’d said before he walked out the door. Nothing of importance. Nothing she could even remember. All she could think at the time was that she didn’t want him to leave, but couldn’t ask him to stay, either. The more she thought about phoning him, the more appealing the idea became. By the end of her shift on Monday night, she’d decided to call Ian first thing after her classes on Tuesday. All morning Cecilia found herself eyeing the time. She had no idea what Ian’s work schedule was. She hoped he’d be available, but if not, she could always leave him a message. She knew he was living on base and had a cell phone; she’d written the number in her address book more than a year ago. She called from a pay phone on the community college campus. The phone rang four times and then she got his voice mail, inviting her to leave a message. “Ian,” she said, worried now that she might be doing the wrong thing. “It’s Cecilia…I hadn’t heard from you and was wondering if you’d changed your mind about the car…which is fine. I mean, I don’t need it or anything. My car’s running great. I’ll talk to you later—that is, if you still want to talk to me.” The last part came out sounding defensive. He’d wanted her badly enough earlier, but apparently sex was all he’d been after. She quickly hung up the receiver and felt foolish, wishing now that she hadn’t given in to the impulse. Wednesday afternoon when she showed up for work, Cecilia was convinced that Ian wanted nothing more to do with her. Just as the dinner hour was picking up and she was at her busiest, her father appeared. “There’s a call for you.” Her heart raced. “Me?” It had to be Ian. No one else would think to contact her here. “You can take it at the bar,” he told her, glancing around for their boss. Cecilia quickly abandoned her duties and hurried in. Her hands were moist, her mouth dry with anticipation. “This is Cecilia Randall,” she said into the mouthpiece, eagerly anticipating Ian’s voice. Only it wasn’t her husband on the other end of the line. Instead, Andrew Lackey answered. “We met not long ago, remember?” “Of course. Where’s Ian?” He might have been transferred again. The Navy did that, often without rhyme or reason—at least in her opinion. “Listen, I thought you should know. Ian’s in the hospital.” She gasped. “What’s wrong?” “Nothing too serious. He took a tumble and wrenched his back. Apparently he hit his head, too, because he has a concussion. They’re keeping him for observation.” “When did it happen?” “Yesterday morning.” “Oh.” “There’s nothing to worry about. I just thought you’d like to know.” “Yes, thank you.” As soon as they’d finished the conversation, Cecilia walked over to her father. “Ian’s been hurt…I’m going to the hospital. Find someone to cover for me, would you?” “Sure thing. You go, and I’ll hold down the fort.” Grateful, she smiled at her father and impulsively hugged him. “Thanks, Dad.” The tears sprang to her eyes. “Hey, none of that. Now, give Ian my best and let me know if you need anything.” “I will,” she said and hurriedly reached for her coat and purse. The drive to the Navy Hospital in Bremerton seemed to take forever. Her car belched thick smoke as she turned off the freeway and headed for the extensive parking lot outside the hospital. She quickly found out where she needed to go. Breathless, Cecilia charged into the elevator. Once she’d located his room, she paused in the hallway for a moment, just long enough to brush a hand through her hair and draw in a deep breath. Then she knocked at the door. No one answered, so she opened it and stepped inside. At her first sight of her husband, Cecilia couldn’t prevent an exclamation of shock. Andrew had led her to believe that Ian had suffered a minor fall, that the only reason he’d been hospitalized was as a precaution. One quick look told her his injuries were far worse than she’d expected. Ian lifted his bandaged head and when he saw who it was, he groaned. “What happened?” she asked, moving fully into the room. “What are you doing here?” he demanded, and it was plain she was the last person he wanted to see. “I-I…Andrew called me, and…” He frowned, and winced; no wonder, she thought. One side of his face was swollen and badly bruised. His left eye was completely shut and there was a bandage around his left arm. “What’s the other guy look like?” she asked, hoping a light approach would relax him. He ignored the question. “Ian…what’s wrong?” “I didn’t ask you to come here,” he returned gruffly. “I know. I came because I wanted to make sure you were all right.” She didn’t mention that she’d risked her job to do so. Her father had said he’d cover for her, but in her rush, she hadn’t spoken to her boss and had left without permission. “As you can see, I’m just hunky-dory, so you can leave now.” His words stung. “That’s rude.” “In case you hadn’t figured it out, I’m not exactly in the mood for company.” “All right,” she whispered and retreated a step. “Go on,” he urged. “Get out of here.” She blinked, unbearably hurt that Ian would speak to her this way. “If that’s how you feel, then—” “Go,” he shouted, pointing at the door. Turning on her heel, Cecilia ran out of the room. If he didn’t want her concern or…or her love, that was fine with her. “Cecilia!” he called after her, but she resolutely ignored him. She hurried to the elevator, pushing the button with more force than necessary. Maybe it was time to see her attorney, after all. She refused to stay married to a man who treated her like this. Eight The March rains had arrived, and the last thing Justine Lockhart wanted was to sit in a stuffy room with a bunch of classmates, planning an event she probably wouldn’t even attend. But that was exactly what she’d have to do. As Justine had predicted, she’d been contacted by the reunion committee and asked if she’d be willing to help. In a moment of weakness, she’d agreed. Unfortunately, Justine had made the mistake of mentioning the reunion to Warren. He’d refused to even consider going with her. After all the times she’d sat through dead boring meetings waiting for him or played hostess to a group of his business colleagues, she’d assumed he’d do this one small thing for her. She’d obviously assumed wrong. He’d tried to smooth over their spat with a pretty sapphire necklace and an invitation to dinner. In the past, Justine had accepted his jewel-encrusted apologies, and they’d gone on as before. Justine was well acquainted with Warren’s faults; she usually chose to ignore them. He could be entertaining and he tended to indulge her in return for her company. That might sound calculating but it was an arrangement that suited them both. Besides, for all his money, he had few friends. And neither of them was in this relationship for the long haul. Expectations were clear. The planning meeting was held at the home of Lana Sullivan, who’d married Jay Rothchild. In the ten years since she’d graduated, Justine hadn’t spoken to Lana once. “Justine!” Lana greeted her enthusiastically, hugging her as though they were long-lost friends. “Come in! Seth’s here and so is Mary.” Justine glanced into the living room and saw that Mary O’Donnell was several months pregnant. “Good to see you Mary,” Justine said, smiling, then nodded at Seth. The school’s star athlete hadn’t changed much—physically, at least. He was just as tall and muscular, although he’d filled out and had a more mature look. He remained strikingly blond. She didn’t remember him being this handsome, but her high-school years were pretty much a blur. “What are you doing these days?” Mary asked. Justine shrugged. “I’m working at First National.” She’d graduated from college with a degree in history; unfortunately, this hadn’t translated into an employable skill. “I hear you’re the manager,” Seth said. “I am.” It surprised her he knew that. He wasn’t a customer.","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-20.html","bookId":1941,"book":{"id":1941,"title":"16 Lighthouse Road (Cedar Cove #1)","description":"Storyline: 16 Lighthouse Road (Cedar Cove #1) Olivia Lockhart 16 Lighthouse Road Cedar Cove, Washington Dear Reader, You don\u0027t know me yet, but in a few hours that\u0027s going to change. You see, I\u0027m inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there\u0027s my mother, Charlotte, who has plenty of opinions and is always willing to share them. Here\u0027s an example: I\u0027m a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte\u0027s view, young Cecilia and Ian Randall hadn\u0027t tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. Well, you wouldn\u0027t believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn\u0027t mind seeing more of!), everyone\u0027s talking. Cedar Cove - people love it and sometimes they leave it, but they never forget it! See you soon ... Olivia","cover":"https://allnovel.net/images/16-lighthouse-road-cedar-cove-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/16-lighthouse-road-cedar-cove-1.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:05 AM"}}
