{"id":66595,"no":36,"title":"Page 36","content":"“He didn’t know what to do,” Maryellen interjected, “and he was halfway to the library to get you.”\\n\\n “I thought you’d want to know,” John said, looking miserable. He shoved his hands in his coverall pockets and stared at the pavement.\\n\\n “That was when he saw me,” Maryellen explained.\\n\\n “Your daughter said she’d get you and sent me back to keep an eye on Dan.”\\n\\n “Mom, your knee!”\\n\\n Blood trickled down Grace’s leg; the nylons were already soaked.\\n\\n “Are you all right?” John asked.\\n\\n “I’m fine. Tell me about the pickup.” Grace wanted as much information about Dan as she could get. She’d take care of her knees later.\\n\\n John hung his head. “I should’ve gotten the license plate number, but it happened so fast I didn’t think to look.”\\n\\n “Did you see who the driver was?” Maryellen asked.\\n\\n “Sorry, no.”\\n\\n Maryellen sat down next to Grace, both hands over her face, and hunched forward.\\n\\n Grace placed a comforting arm on Maryellen’s back. Caught up in her own misery, she’d failed to see how upset her oldest daughter was by Dan’s disappearance. Kelly had been much more forthcoming about her emotions, and Grace had assumed Maryellen was taking the situation in stride. As far as anyone could…\\n\\n “I can’t tell you how sorry I am about all this,” John Malcom said again.\\n\\n “You didn’t see who was driving?” Grace asked one final time.\\n\\n John shook his head. “It wasn’t anyone I recognized. Not from around here, leastways.”\\n\\n “Male or female?”\\n\\n John hesitated and looked away. “Female.”\\n\\n Grace bit her lower lip to keep it from trembling. John wasn’t telling her anything she didn’t already know.\\n\\n Fourteen\\n\\n Cecilia would forever be grateful that she hadn’t given in to the impulse to drop out of her community college classes. The day of her wedding anniversary, she’d been feeling depressed and regretful. She thought now that her desire to quit was a way of punishing herself—by taking away the very thing in life that brought her joy. She couldn’t understand why she’d wanted to do such a thing. Thankfully, Mr. Cavanaugh had been kind enough to reason with her. He hadn’t tried to pressure her or talk her out of it, but he’d been sensible and matter-of-fact.\\n\\n She loved her classes, especially advanced algebra. On a Sunday afternoon when she was free to go anywhere and do anything she wanted, Cecilia chose to work on problems in her textbook. Problems that hadn’t even been assigned. That said a lot. Recently one of the other students had flippantly called Cecilia the teacher’s pet. She didn’t believe it since Mr. Cavanaugh wasn’t the sort of teacher who played favorites. But afterward Cecilia had smiled all day. Never in her life had she experienced anything like this sense of approval and success.\\n\\n She enjoyed telling Ian how well she was doing. They were back to e-mailing and writing. Yesterday, she’d received a postcard from Australia. He hadn’t chosen one with a picture of the famous opera house, the outback or even the Barrier Reef. No koalas or kangaroos, either. Instead, Ian had mailed her a photograph of the night sky. It showed the Milky Way and what looked like millions upon millions of stars. His message on the back was full of praise for her high marks and the promise of a celebration once he got home.\\n\\n Cathy was still keeping the news of her pregnancy from Andrew. It was all Cecilia could do not to tell Ian. Every day that Cathy remained pregnant was a triumph. She’d miscarried the first pregnancy at eight weeks, and the second at twelve. Already this pregnancy had lasted longer than the first two, but Cathy couldn’t trust that all was well—not yet, anyway. Cecilia was the only person she’d told. Not even her mother knew, and Cecilia regarded the news as sacred information.\\n\\n At a little after one, she decided it was time for lunch. With the radio on in the background, she was opening a can of soup, when a news bulletin interrupted the Top 40 song that was playing.\\n\\n “This is a KVI news bulletin. There’s been an explosion aboard the George Washington, the Bremerton-based aircraft carrier. Details are just coming into our newsroom now. At this early hour we have no idea as to the cause of the explosion. The possibility exists that this is the work of a terrorist group. There has been loss of life, but how many casualties and the extent of damage to the aircraft carrier is unknown at this point. We’ll keep you updated.”\\n\\n Cecilia gasped and dropped the soup can. The contents spilled out over the counter, dripping onto the floor. Unrolling some paper towels, she started wiping it up when the phone rang.\\n\\n “Hello,” she nearly shouted as she grabbed the receiver.\\n\\n “Did you hear?” It was Cathy.\\n\\n “Just now. What do you know?”\\n\\n “Nothing…just about the explosion. I called the ombudsman, but she’d just heard it herself. The Navy has set up a meeting area on base for husbands, wives and family members to wait for news. We’ll get information there more quickly than we will at home.”\\n\\n “I’m on my way.” Cecilia didn’t waste time worrying about the appropriateness of being on base. Although she hadn’t lived with Ian in many months, she was still his wife.\\n\\n “That’s one of the reasons I phoned,” Cathy said, her voice faltering. “Could you swing by for me?”\\n\\n “I’ll be there as fast as I can.” Then it hit her. “Cathy, is everything all right?”\\n\\n Cathy released a sob. “I think so…I don’t know.”\\n\\n “Cath? You’d better tell me.”\\n\\n Cecilia heard her friend struggle not to cry. “I…I’ve started spotting.”\\n\\n “When?”\\n\\n “This morning.”\\n\\n “How bad is it?” It might be more important to drive Cathy to the hospital first.\\n\\n “Not bad—much lighter than the first two miscarriages.” Cathy made it sound like a foregone conclusion that she would lose this baby, too.\\n\\n “I’ll be there in ten minutes.”\\n\\n “Oh, Cecilia, I don’t know what I’d do without you.” The tears were back in her voice.\\n\\n Dumping everything in the sink, Cecilia didn’t change clothes or bother with her hair or makeup. She refused to think of what might be happening to her husband half a world away. If there was one thing she’d learned this past year, it was that she couldn’t take anything for granted. She could only hope for the best.\\n\\n Cathy was sitting on the front porch steps outside her rental house, waiting for her. As soon as Cecilia approached, Cathy stood. She looked shaken and deathly pale.\\n\\n “Did you hear anything else?” Cecilia asked.\\n\\n “No. You?”\\n\\n Cecilia had turned on the all-news radio station on the drive over. “Just what was on the local news.”\\n\\n “A number of…deaths have been reported.”\\n\\n Cecilia couldn’t bear to think about that. “I’m taking you to the hospital.”\\n\\n “No, I have to find out what I can about Andrew first,” Cathy said. “If we go to the hospital, it’ll take hours and they might keep me. I need to know if Andrew’s all right. Then I’ll go, I promise.”\\n\\n “Are you still bleeding?”\\n\\n Cathy shook her head. “No, thank God.”\\n\\n Cecilia headed toward the Bremerton Navy base and joined the cars streaming toward the checkpoint at the entrance. It seemed that every spouse, parent and sibling of each enlisted man and woman sought information. A large hangar was set aside for the purpose; hundreds of chairs had been brought in, along with drinks and snacks.\\n\\n Women, older men and children gathered together in small groups. Cecilia was astonished by the speed with which rumors started to circulate. By three that afternoon, word arrived of five confirmed deaths. Then Cecilia heard ten had died and with every hour the number grew. The truth remained unknown, lost amid all the speculation.\\n\\n An officer announced that the explosion had been due to human error and was not a terrorist attack as first suspected. Terrorists were prominent in everyone’s fears, Cecilia suspected, especially after what had happened to the USS Cole. Australia was a friendly port, but one could never be sure.\\n\\n Next, they learned that the explosion had occurred in the munitions area, which sent gasps of horror rippling through the room. Three known dead, the officer said, but in such a volatile spot on the ship, that left a lot of uncertainty regarding the number of injuries.\\n\\n By nightfall they were told that everything was under control. The fires were out; the aircraft carrier was secure. At last came the moment they’d all been waiting for. The base commander moved to the front of the room to read a list of those who’d been injured. “Lieutenant Wayne Van Buskirk. Ensign Jeremiah Smith. Chief Petty Officer Alfred Hussey. First Class Gunner’s Mate Gerald Frederickson. Third Class Gunner’s Mate Charles Washington. Seaman Janet Lewis…” Cathy and Cecilia clung to one another. Each name echoed through the room like a bomb-shell, followed by a gasp or a cry of alarm. And then Ian’s name was called out. Cecilia heard her own shout of panic; her legs went slack and she slumped into a chair.\\n\\n “Ian.” She wasn’t prepared, wasn’t ready to deal with this. Cathy gripped her hand and Cecilia squeezed so hard, her fingers lost feeling.\\n\\n “I’ll wait for you here,” Cathy told her.\\n\\n Until that instant, Cecilia didn’t realize any other instructions had been given. Cathy hugged her and explained that she was to proceed to the front of the room and speak to the Information Officer.\\n\\n Weaving her way through the crowd of Navy family and friends, Cecilia seemed to be walking in slow motion. She heard the sounds of conversation and weeping and occasional nervous laughter as though from a great distance.\\n\\n “I’m Cecilia Randall,” she told the officer. She gave him Ian’s name and rank, and showed her military identification card.\\n\\n He directed her to another officer. By then, Cecilia was nearly at the point of passing out. This all seemed so unreal. It couldn’t be happening. Not to Ian. Not to her. She’d already lost her daughter. Surely life wouldn’t be so cruel as to claim her husband, too. Clenching her hands at her sides, Cecilia held her breath and waited.\\n\\n “Mrs. Randall?”\\n\\n “Yes.” Instantly alert, Cecilia stepped forward. “I’m the wife of Ian Randall.”\\n\\n The officer smiled reassuringly. “Your husband has sustained cuts and bruises.”\\n\\n “Is—Is he hospitalized?”\\n\\n “No.” He tore off a sheet and handed it to her. “The reason we ask to speak to all the relatives of those injured is to inform you that you can talk to your loved one.”\\n\\n “Talk?” She didn’t understand.\\n\\n “We have a bank of phones in the other room. If you’ll go over there, your name will be called shortly. Give the officer this sheet.”\\n\\n She was going to be able to talk directly with Ian. Cecilia resisted the urge to sob with joy and relief. Waiting in the inner room with several other wives, she realized how fortunate she was that her husband had only minor injuries. \\n\\n","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-36.html","bookId":1941,"book":{"id":1941,"title":"16 Lighthouse Road (Cedar Cove #1)","description":"Storyline: 16 Lighthouse Road (Cedar Cove #1) \\n Olivia Lockhart \\n 16 Lighthouse Road \\n Cedar Cove, Washington \\n Dear Reader, \\n You don\u0027t know me yet, but in a few hours that\u0027s going to change. You see, I\u0027m inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! \\n I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there\u0027s my mother, Charlotte, who has plenty of opinions and is always willing to share them. \\n Here\u0027s an example: I\u0027m a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte\u0027s view, young Cecilia and Ian Randall hadn\u0027t tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. \\n Well, you wouldn\u0027t believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn\u0027t mind seeing more of!), everyone\u0027s talking. \\n Cedar Cove - people love it and sometimes they leave it, but they never forget it! \\n See you soon ... \\n Olivia\\n","cover":"https://allnovel.net/images/16-lighthouse-road-cedar-cove-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/16-lighthouse-road-cedar-cove-1.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:05 AM"}}
