{"id":69483,"no":12,"title":"Page 12","content":"IT WAS AN EFFORT for Rachel to move. Just walking from room to room in her Florida home was exhausting. She could not remember when she had ever been so tired. I probably have a flu of some kind. Jeff was right. I should see a doctor. A hot bath will relax me... It was while Rachel was stretched out in the soothing warm water that her hand went to her breast and felt the lump. Her first reaction was shock. Then denial. It\u0027s nothing. It\u0027s not cancer. I don\u0027t smoke. I exercise and take care of my body. There is no cancer in my family. I\u0027m fine. I\u0027ll have a doctor look at it, but it\u0027s not cancer. Rachel got out of the tub, dried herself, and made a telephone call. \"Betty Richman Model Agency.\" \"I\u0027d like to speak to Betty Richman. Please tell her it\u0027s Rachel Stevens.\" A moment later Betty Richman was on the line. \"Rachel! It\u0027s great to hear from you. Are you all right?\" \"Of course I am. Why do you ask?\" \"Well, you cut the Rio shoot short, and I thought that maybe - \" Rachel laughed. \"No, no. I was just tired, Betty. I\u0027m eager to go to work again.\" \"That\u0027s great news. Everyone\u0027s been trying to book you.\" \"Well, I\u0027m ready. What\u0027s on the agenda?\" \"Hold on a moment.\" A minute later Betty Richman was back on the line. \"The next shoot is in Aruba. It starts next week. That gives you plenty of time. They\u0027ve been asking for you.\" \"I love Aruba. Book me for it.\" \"You\u0027ve got it. I\u0027m glad you\u0027re feeling better.\" \"I feel great.\" \"I\u0027ll send all the details.\" At two o\u0027clock the following afternoon, Rachel had an appointment with Dr. Graham Elgin. \"Good afternoon, Dr. Elgin.\" \"And what can I do for you?\" \"I have a small cyst in my right breast and - \" \"Oh, you\u0027ve seen a doctor?\" \"No, but I know what it is. It\u0027s just a little cyst. I know my body. I\u0027d like you to use microsurgery to get it out.\" She smiled. \"I\u0027m a model. I can\u0027t afford to have a scar. With just a tiny blemish, I can cover it with makeup. I\u0027m leaving next week for Aruba, so would it be possible to schedule the operation tomorrow or the next day?\" Dr. Elgin was studying her. Considering the situation, she seemed unnaturally calm. \"Let me examine you first, then I\u0027ll have to do a biopsy. But yes, we can schedule the operation within the week, if necessary.\" Rachel was beaming. \"Wonderful.\" Dr. Elgin stood up. \"Let\u0027s go into the other room, shall we? I\u0027ll have the nurse bring you a hospital gown.\" Fifteen minutes later, with a nurse looking on, Dr. Elgin was palpating the lump in Rachel\u0027s breast. \"I told you, Doctor, it\u0027s just a cyst.\" \"Well, to be certain, Miss Stevens, I\u0027d like to do the biopsy. I can do it right here.\" Rachel tried not to wince as Dr. Elgin inserted a thin needle into the side of her breast to draw out tissue. \"All finished. That wasn\u0027t too bad, was it?\" \"No. How soon...?\" \"I\u0027ll send this in to the lab, and I can have a preliminary cytology report tomorrow morning.\" Rachel smiled. \"Good. I\u0027m going home to pack for Aruba.\" When Rachel got home, the first thing she did was take out two suitcases and lay them on the bed. She went to the closet and started collecting clothes to take to with her. Jeanette Rhodes, her cleaning woman, came into the bedroom. \"Miss Stevens, are you going away again?\" \"Yes.\" \"Where are you going this time?\" \"To Aruba.\" \"Where\u0027s that?\" \"It\u0027s a beautiful island in the Caribbean Sea, just north of Venezuela. It\u0027s a paradise. Great beaches, beautiful hotels, and wonderful food.\" \"Sounds great.\" \"By the way, Jeanette, while I\u0027m gone, I\u0027d like you to come in three times a week.\" \"Of course.\" At nine o\u0027clock the following morning, the phone rang. \"Miss Stevens?\" \"Yes.\" \"This is Dr. Elgin.\" \"Hello, Doctor. Were you able to schedule the operation?\" \"Miss Stevens, I just got the cytology report. I\u0027d like you to come into the office so we can - \" \"No. I want to hear it now, Doctor.\" There was a slight hesitation. \"I don\u0027t like to discuss this sort of thing on the phone, but I\u0027m afraid the preliminary report shows you do have cancer.\" Jeff was in the middle of writing his sports column when the phone rang. He picked it up. \"Hello?\" \"Jeff...\" She was crying. \"Rachel, is that you? What\u0027s the matter? What\u0027s happened?\" \"I - I have breast cancer.\" \"Oh, my God. How serious is it?\" \"I don\u0027t know yet. I have to have a mammogram. Jeff, I can\u0027t face this alone. I know I\u0027m asking a lot, but could you come down here?\" \"Rachel, I - I\u0027m afraid I - \" \"Just for a day. Just till I...know.\" She was crying again. \"Rachel...\" He was torn. \"I\u0027ll try. I\u0027ll call you later.\" She was sobbing too hard to speak. When Dana returned from a production meeting, she said, \"Olivia, make a reservation for me on a morning plane to Aspen, Colorado. Get me into a hotel. Oh, and I\u0027ll want a car rental.\" \"Right. Mr. Connors is waiting for you in your office.\" \"Thanks.\" Dana walked inside. Jeff was standing there looking out the window. \"Hi, darling.\" He turned around. \"Hi, Dana.\" There was a strange expression on his face. Dana looked at him, concerned. \"Are you all right?\" \"That\u0027s a two-part question,\" he said heavily. \"Yes and no.\" \"Sit down,\" Dana said. She took a chair opposite him. \"What\u0027s wrong?\" He let out a deep breath. \"Rachel has breast cancer.\" She felt a little shock. \"I - I\u0027m so sorry. Is she going to be all right?\" \"She called this morning. They\u0027re going to let her know how serious it is. She\u0027s panicky. She wants me to come to Florida to help her face the news. I wanted to talk to you first.\" Dana walked over to Jeff and put her arms around him. \"Of course you must go.\" Dana remembered the luncheon with Rachel and how wonderful she had been. \"I\u0027ll be back in a day or two.\" Jeff was in Matt Baker\u0027s office. \"I have an emergency situation, Matt. I have to leave for a few days.\" \"Are you okay, Jeff?\" \"Yes. It\u0027s Rachel.\" \"Your ex?\" Jeff nodded. \"She just learned she has cancer.\" \"I\u0027m sorry.\" \"Anyway, she needs a little moral support. I want to fly to Florida this afternoon.\" \"You go ahead. I\u0027ll have Maury Falstein fill in for you. Let me know how it goes.\" \"I will. Thanks, Matt.\" Two hours later Jeff was on an airplane to Miami. Dana\u0027s most immediate problem was Kemal. I can\u0027t go to Aspen without having someone reliable here to take care of him, Dana thought. But who can handle cleaning and laundry and the most ornery little boy in the world? She telephoned Pamela Hudson. \"I\u0027m so sorry to bother you, Pamela, but I have to leave town for a little while, and I need someone to stay with Kemal. Would you happen to know of a good housekeeper with the patience of a saint?\" There was a moment\u0027s silence. \"It just so happens that I do. Her name is Mary Rowane Daley, and she worked for us years ago. She\u0027s a treasure. Let me find her and have her call you.\" \"Thanks,\" Dana said. An hour later Olivia said, \"Dana, there\u0027s a Mary Daley on the phone for you.\" Dana picked up the phone. \"Mrs. Daley?\" \"Yes. This is herself.\" The warm voice had a rich Irish brogue. \"Mrs. Hudson said you might be needing someone to take care of your son.\" \"That\u0027s right,\" Dana said. \"I have to go out of town for a day or two. I wonder if you could drop by early tomorrow morning - say, seven o\u0027clock - so we can talk?\" \"It\u0027s sure I can. As luck would have it, I\u0027m free at the moment.\" Dana gave Mrs. Daley her address. \"I\u0027ll be there, Miss Evans.\" Mary Daley arrived the next morning promptly at seven. She appeared to be in her fifties, a dumpling of a woman, with a cheery manner and a bright smile. She shook hands with Dana. \"I\u0027m very glad to meet you, Miss Evans. I watch you on the TV when I can.\" \"Thank you.\" \"And where\u0027s the young lad of the house?\" Dana called out, \"Kemal.\" A moment later Kemal came out of his room. He looked at Mrs. Daley and his expression saidFreak. Mrs. Daley smiled. \"Kemal, is it? I\u0027ve never met anyone named Kemal before. You look like a young devil.\" She walked over to him. \"You must tell me all the favorite things you like to eat. I\u0027m a grand cook. We\u0027re going to have a good time together, Kemal.\" I hope so, Dana thought prayerfully. \"Mrs. Daley, will you be able to stay here with Kemal while I\u0027m away?\" \"Certainly, Miss Evans.\" \"That\u0027s wonderful,\" Dana said gratefully. \"I\u0027m afraid there isn\u0027t too much room. The sleeping accommodations are - \" Mrs. Daley smiled. \"Don\u0027t you worry. That fold-out couch will do nicely.\" Dana breathed a sigh of relief. She looked at her watch. \"Why don\u0027t you come with me to drop Kemal off at school? Then you can pick him up at one-forty-five.\" \"That will be fine.\" Kemal turned to Dana. \"You\u0027re going to come back, aren\u0027t you, Dana?\" Dana put her arms around him. \"Of course I\u0027m going to come back to you, darling.\" \"When?\" \"I\u0027ll be back in a few days.\"With some answers . When Dana arrived at the studio, on her desk was a small, beautifully wrapped package. She looked at it, curious, and opened it. Inside was a lovely gold pen. The card read \"Dear Dana, have a safe trip.\" It was signedThe Gang. Thoughtful. Dana put it into her purse. At the same time Dana was boarding a plane, a man in a workman\u0027s outfit rang the bell of the Whartons\u0027 former apartment. The door opened and the new tenant looked at him, nodded, and closed the door. The man moved on to Dana\u0027s apartment and rang the bell. Mrs. Daley opened the door. \"Yes?\" \"Miss Evans sent me to repair her TV set.\" \"Very well. Come in.\" Mrs. Daley watched the man go to the television set and start to work.","sourceLink":"https://allnovel.net/the-sky-is-falling/page-12.html","bookId":2369,"book":{"id":2369,"title":"The Sky Is Falling","description":"Storyline: Washington TV anchorwoman Dana Evans (from Best Laid Plans) suspects the accidents befalling the rich Winthrop family, killing all five members, were murders. Like Chicken Little and the sky falling, she chases clues across the world to unravel an international conspiracy. The inheritance goes to charity, so money is not the motive. Her Sarajevo ward Kemal gets expelled, a prosthetic arm, then often naps afternoons under care of kindly new housekeeper. Unseen agents follow her, bug hotel rooms, while an evil mastermind voice overhears taped conversations and supervises regular secret auctions, inviting armed wealthy customers. Witnesses and informants die before, and after meetings. Friends become foes, nobody can be trusted.","cover":"https://allnovel.net/images/the-sky-is-falling.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sky-is-falling.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:12:54 AM"}}
