{"id":69474,"no":3,"title":"Page 3","content":"DANAEVANS WAS awakened by the relentless ringing of the telephone. She struggled to sit up and looked at the bedside clock, bleary-eyed. It was five o\u0027clock in the morning. She picked up the phone. \"Hello?\" \"Dana...\" \"Matt?\" \"See how fast you can get down to the studio.\" \"What\u0027s happened?\" \"I\u0027ll fill you in when you get here.\" \"I\u0027m on my way.\" Fifteen minutes later, hastily dressed, Dana was knocking on the door of the Whartons\u0027 apartment, her next-door neighbors. Dorothy Wharton opened the door, wearing a robe. She looked at Dana in alarm. \"Dana, what\u0027s wrong?\" \"I hate to do this to you, Dorothy, but I\u0027ve been called to the studio on an emergency. Would you mind getting Kemal to school?\" \"Why, of course not. I\u0027d be happy to.\" \"Thank you so much. He has to be there at seven-forty-five, and he\u0027ll need breakfast.\" \"Don\u0027t you worry. I\u0027ll take care of it. You run along.\" \"Thanks,\" Dana said gratefully. Abbe Lasmann was already in her office, looking sleepy. \"He\u0027s waiting for you.\" Dana walked into Matt\u0027s office. \"I have some awful news,\" he said. \"Gary Winthrop was murdered earlier this morning.\" Dana sank into a chair, stunned. \"What? Who - ?\" \"Apparently his house was being robbed. When he confronted the burglars, they killed him.\" \"Oh, no! He was so wonderful!\" Dana remembered the friendliness and warmth of the attractive philanthropist, and she felt ill. Matt shook his head in disbelief. \"This makes - my God - the fifth tragedy.\" Dana was puzzled. \"What do you mean, the fifth tragedy?\" Matt looked at her in surprise, then suddenly realized, \"Of course - you were in Sarajevo. I guess over there, with a war going on, what happened to the Winthrops during the last year wouldn\u0027t have been such headline news. I\u0027m sure you know about Taylor Winthrop, Gary\u0027s father?\" \"He was our ambassador to Russia. He and his wife died in a fire last year.\" \"Right. Two months later, their older son, Paul, was killed in an automobile accident. And six weeks after that, their daughter, Julie, died in a skiing accident.\" Matt paused for a moment. \"And now, this morning, Gary, the last of the family.\" Dana was stunned into silence. \"Dana, the Winthrops are a legend. If this country had a royal family, they would hold the crown. They invented charisma. They were world-famous for their philanthropy and government service. Gary was planning to follow in his father\u0027s footsteps and run for the Senate, and he\u0027d have been a shoo-in. Everyone loved him. Now he\u0027s gone. In less than one year, one of the most distinguished families in the world has been totally wiped out.\" \"I - I don\u0027t know what to say.\" \"You\u0027d better think of something,\" Matt said briskly. \"You\u0027re on the air in twenty minutes.\" The news of Gary Winthrop\u0027s death sent shock waves around the world. Comments from government leaders flashed onto universal television screens. \"It\u0027s like a Greek tragedy...\" \"Unbelievable...\" \"An ironic twist of fate...\" \"The world has sustained a terrible loss...\" \"The brightest and the best, and they\u0027re all gone...\" Gary Winthrop\u0027s murder seemed to be all that anyone was talking about. A wave of sadness swept over the country. Gary Winthrop\u0027s death had brought back the memory of the other tragic deaths in his family. \"It\u0027s unreal,\" Dana told Jeff. \"The whole family must have been so wonderful.\" \"They were. Gary was a real sports fan and a big supporter.\" Jeff shook his head. \"It\u0027s hard to believe that some two-bit thieves wiped out such a wonderful person.\" Driving to the studio the next morning, Jeff said, \"By the way, Rachel\u0027s in town.\" By the way? How casual. Much too casual, Dana thought. Jeff had been married to Rachel Stevens, a top model. Dana had seen her picture in television ads and on magazine covers. It was hard to believe how beautiful she was. But she probably doesn\u0027t have a working brain cell in her head, Dana decided. On the other hand, with that face and body, she doesn\u0027t need any brains. Dana had discussed Rachel with Jeff. \"What happened to the marriage?\" \"It was great in the beginning,\" Jeff told her. \"Rachel was so supportive. Even though she hated baseball, she used to come to the games to watch me play. Besides that, we had a lot in common.\" I\u0027ll bet you did. \"She\u0027s really a wonderful woman, completely un-spoiled. She loved to cook. When she was on a shoot, Rachel would cook for the other models.\" Great way to get rid of the competition. They were probably dropping like flies. \"What?\" \"I didn\u0027t say anything.\" \"Anyway, we were married for five years.\" \"And then?\" \"Rachel was very successful. She was always booked, and her work took her all over the world. Italy...England...Jamaica...Thailand...Japan...You name it. Meanwhile, I was playing ball around the country. We didn\u0027t get together very often. Little by little the magic faded.\" The next question seemed logical because Jeff loved children. \"Why no children?\" Jeff smiled wryly. \"Not good for a model\u0027s figure. Then one day Roderick Marshall, one of Hollywood\u0027s ace directors, sent for her. Rachel went to Hollywood.\" He hesitated. \"She called me a week later to tell me she wanted a divorce. She felt we had drifted too far apart. I had to agree. I gave her the divorce. Shortly after that I broke my arm.\" \"And you became a sportscaster. What about Rachel? She didn\u0027t make it in movies?\" Jeff shook his head. \"She wasn\u0027t really interested. But she\u0027s doing just fine.\" \"And you\u0027re still friendly?\" A loaded question. \"Yes. As a matter of fact, when she called me, I told her about us. She wants to meet you.\" Dana frowned. \"Jeff, I don\u0027t think - \" \"She\u0027s really very nice, honey. Let\u0027s all have lunch tomorrow. You\u0027ll like her.\" \"I\u0027m sure I will,\" Dana agreed. Snowball in hell, Dana thought. But I don\u0027t get to talk to many airheads. The airhead turned out to be even more beautiful than Dana had feared. Rachel Stevens was tall and slender, with lustrous, long blond hair, flawless tanned skin, and striking facial features. Dana hated her on sight. \"Dana Evans, this is Rachel Stevens.\" Dana thought, Shouldn\u0027t it have been \"Rachel Stevens, this is Dana Evans\"? Rachel Stevens was saying, \"...your broadcasts from Sarajevo whenever I could. They were incredible. We could all feel your heartbreak and share it.\" How do you respond to a sincere compliment? \"Thank you,\" Dana said lamely. \"Where would you like to have lunch?\" Jeff asked. Rachel suggested, \"There\u0027s a marvelous restaurant called the Straits of Malaya. It\u0027s just two blocks off Dupont Circle.\" She turned to Dana and asked, \"Do you like Thai food?\" As if she really cares. \"Yes.\" Jeff smiled. \"Fine. Let\u0027s try it.\" Rachel said, \"It\u0027s only a few blocks from here. Shall we walk?\" In this freezing weather? \"Sure,\" Dana said gamely. She probably walks naked in the snow. They headed for Dupont Circle. Dana felt uglier by the second. She was bitterly sorry she had accepted the invitation. The restaurant turned out to be packed, with a dozen people at the bar, waiting for tables. The maitre d\u0027 came bustling up. \"A table for three,\" Jeff said. \"Do you have a reservation?\" \"No, but we - \" \"I\u0027m sorry, but - \" He recognized Jeff. \"Mr. Connors, it\u0027s a pleasure to see you.\" He looked at Dana. \"Miss Evans, this is an honor.\" He made a small moue. \"I\u0027m afraid there will be a short delay.\" His glance moved to Rachel, and his face lit up. \"Miss Stevens! I read that you were doing a layout in China.\" \"I was, Somchai. I\u0027m back.\" \"Wonderful.\" He turned to Dana and Jeff. \"Of course we have a table for you.\" He led them to a table in the center of the room. I hate her, Dana thought. I truly hate her. When they were seated, Jeff said, \"You look great, Rachel. Whatever you\u0027re doing agrees with you.\" And we can all guess what that is. \"I\u0027ve been doing a lot of traveling. I think I\u0027m going to start taking it easy for a while.\" She looked into Jeff\u0027s eyes. \"Do you remember the night that you and I - \" Dana looked up from the menu. \"What isudang goreng ?\" Rachel glanced at Dana. \"That\u0027s shrimp in coconut milk. It\u0027s very good here.\" She turned back to Jeff. \"The night you and I decided that we wanted to - \" \"What islaksa ?\" Rachel said patiently, \"That\u0027s spicy noodle soup.\" She turned back to Jeff. \"You said you wanted to - \" \"Andpoh pia ?\" Rachel looked at Dana and said sweetly, \"That\u0027s jicama stir-fried with vegetables.\" \"Really?\" Dana decided not to ask what jicama was. But as the meal went on, Dana was surprised that in spite of herself, she began to like Rachel Stevens. She had a warm and charming personality. Unlike most world-class beauties, Rachel seemed to be completely unself-conscious about her looks and displayed no ego. She was intelligent and articulate, and when she gave the luncheon order to the waiter in Thai, there was no hint of superiority. How did Jeff ever let this one get away? Dana wondered. \"How long will you be in Washington?\" Dana asked. \"I have to leave tomorrow.\" \"Where are you heading for this time?\" Jeff wanted to know. Rachel hesitated. \"Hawaii. But I\u0027m feeling really tired, Jeff. I was even thinking of canceling this.\" \"But you won\u0027t,\" Jeff said knowingly. Rachel sighed. \"No, I won\u0027t.\" \"When will you be back?\" Dana asked. Rachel looked at her for a long moment and then said softly, \"I don\u0027t think I\u0027ll be coming back to Washington, Dana. I hope you and Jeff will be very happy.\" There was an unspoken message in her words. Outside, after lunch, Dana said, \"I have some errands to do. You two go on ahead.\" Rachel took Dana\u0027s hand in hers. \"I\u0027m very glad we met.\" \"So am I,\" Dana said, and to her surprise she really meant it. Dana watched Jeff and Rachel start down the street. A striking couple, she thought. Because it was early December, Washington was preparing for the holiday season. The streets of the capital were decorated with Christmas lights and wreaths of holly, and on almost every corner Salvation Army Santa Clauses stood, tolling their bells for coins. The sidewalks were crowded with shoppers braving the icy winds. The time has come, Dana thought. I have to get started with my own shopping. Dana thought about the people for whom she should buy gifts. Her mother; Kemal; Matt, her boss; and, of course, wonderful Jeff. Dana jumped in a cab and headed for Hecht\u0027s, one of Washington\u0027s largest department stores. The place was jammed with people celebrating the Christmas spirit by rudely elbowing other shoppers out of the way. When Dana finished shopping, she headed back to her apartment to drop off her gifts. The apartment was on Calvert Street, in a quiet residential section. Attractively furnished, it consisted of one bedroom, a living room, a dining room, a kitchen, a bathroom, and a study, where Kemal slept. Dana put the gifts in a closet, looked around the small apartment, and thought happily, We\u0027ll have to get a larger place when Jeff and I get married. As she headed for the door to return to the studio, the telephone rang. Murphy\u0027s law. Dana picked up the phone. \"Hello.\" \"Dana, darling.\" It was her mother. \"Hello, Mother. I was just leav - \" \"My friends and I listened to your broadcast last night. You were very good.\" \"Thank you.\" \"Although we thought you could have brightened up the news a bit.\" Dana sighed. \"Brightened up the news?\" \"Yes. All the things you talk about are so depressing. Can\u0027t you find something cheerful to discuss?\" \"I\u0027ll certainly see what I can do, Mother.\" \"That would be nice. By the way, I\u0027m running just a little short of cash this month. I wonder if you could help me out again?\" Dana\u0027s father had disappeared years ago. In time, Dana\u0027s mother had moved to Las Vegas. It seemed that she was always short of cash. The monthly allowance Dana gave her mother never seemed to be enough. \"Do you gamble, Mother?\" \"Of course not,\" Mrs. Evans said indignantly. \"Las Vegas is a very expensive city. By the way, when are you going to come out here? I would like to meet Kimbal. You should bring him here.\" \"His name is Kemal, Mother. I can\u0027t get away right now.\" There was a slight hesitation at the other end. \"You can\u0027t? My friends are all saying how fortunate you are to have a job where you only have to work an hour or two a day.\" Dana said, \"I guess I\u0027m just lucky.\" As anchorwoman, Dana arrived at the television studio at nine o\u0027clock every morning and spent much of the day on international conference calls, getting the latest news from London, Paris, Italy, and other foreign locations. The rest of the day was devoted to meetings, putting all the news together, and deciding what would be broadcast and in what order when she went on the air. She did two evening broadcasts. \"It\u0027s nice that you have such an easy job, darling.\" \"Thank you, Mother.\" \"You\u0027ll come and see me soon, won\u0027t you?\" \"Yes, I will.\" \"I can\u0027t wait to meet that darling little boy.\" It will be good for Kemal to meet her, too, Dana thought. He\u0027ll have a grandmother. And when Jeff and I are married, Kemal will have a real family again. As Dana stepped out into the corridor of her apartment building, Mrs. Wharton appeared. \"I want to thank you for taking care of Kemal the other morning, Dorothy. I really appreciate it.\" \"It was my pleasure.\" Dorothy Wharton and her husband, Howard, had moved into the building a year ago. They were Canadians, a delightful middle-aged couple. Howard Wharton was an engineer who repaired monuments. As he had explained to Dana at dinner one night, \"There\u0027s no better city in the world than Washington for my kind of work. Where else could I find opportunities like this?\" And he answered his own question. \"Nowhere.\" \"Howard and I both love Washington,\" Mrs. Wharton confided. \"We\u0027re never going to leave.\" When Dana got back to her office, the latest edition of theWashington Tribune was on her desk. The front page was filled with stories and photographs of the Winthrop family. Dana looked at the photographs for a long time, her mind racing. Five of them all dead in less than a year. Incredible. The call was made to a private phone in the executive tower of Washington Tribune Enterprises. \"I just got the instructions.\" \"Good. They\u0027ve been waiting. What do you want them to do with the paintings?\" \"Burn them.\" \"All of them? They\u0027re worth millions of dollars.\" \"Everything\u0027s gone perfectly. We can\u0027t allow any loose ends. Burn them now.\" Dana\u0027s secretary, Olivia Watkins, was on the intercom. \"There\u0027s a call for you on line three. He\u0027s called twice already.\" \"Who is it, Olivia?\" \"Mr. Henry.\" Thomas Henry was the principal of Theodore Roosevelt Middle School. Dana rubbed her hand against her forehead to wipe away the headache that was about to start. She picked up the telephone. \"Good afternoon, Mr. Henry.\" \"Good afternoon, Miss Evans. I wonder if you could stop by and see me?\" \"Certainly. In an hour or two, I\u0027m - \" \"I would suggestnow, if that\u0027s possible.\" \"I\u0027ll be there.\"","sourceLink":"https://allnovel.net/the-sky-is-falling/page-3.html","bookId":2369,"book":{"id":2369,"title":"The Sky Is Falling","description":"Storyline: Washington TV anchorwoman Dana Evans (from Best Laid Plans) suspects the accidents befalling the rich Winthrop family, killing all five members, were murders. Like Chicken Little and the sky falling, she chases clues across the world to unravel an international conspiracy. The inheritance goes to charity, so money is not the motive. Her Sarajevo ward Kemal gets expelled, a prosthetic arm, then often naps afternoons under care of kindly new housekeeper. Unseen agents follow her, bug hotel rooms, while an evil mastermind voice overhears taped conversations and supervises regular secret auctions, inviting armed wealthy customers. Witnesses and informants die before, and after meetings. Friends become foes, nobody can be trusted.","cover":"https://allnovel.net/images/the-sky-is-falling.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sky-is-falling.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:12:54 AM"}}
