{"id":84784,"no":1,"title":"Page 1","content":"\"Pax.\"\\n\\n I can\u0027t be sure that the girl said my name. Her voice is muffled and unintelligible and hard to understand, mostly because my dick is in her mouth.\\n\\n Slumping against the black leather seat of my car, I push the girl\u0027s head down further, wordlessly urging her to bury more of me in her throat.\\n\\n \"Don\u0027t talk,\" I tell her. \"Just suck.\"\\n\\n I close my eyes and listen. I can hear the spit pooling in her mouth and sliding out the corners. Her cheek makes a soft sound as it grazes my open zipper. She moans periodically, although I don\u0027t understand it. She\u0027s not getting anything out of this. My hand is on her head, pushing, pushing. Guiding her movements and her speed. I grip the hair at the base of her neck, winding it in my fingers; pulling it, releasing it, then pulling it again.\\n\\n She moans again.\\n\\n I still don\u0027t know why.\\n\\n I still don\u0027t care.\\n\\n I\u0027m high as fuck.\\n\\n And I don\u0027t know her name.\\n\\n Everything is a fog, except this moment. I tune out the crashing sounds of Lake Michigan to our right, and the sounds of the cars on the highway a few miles away. I block out the glowing lights from town. I tune out the roaring quiet and the occasional thought that someone might happen by and see us. No one is out here on the beach, not at 11:00 pm. Not that I would care anyway.\\n\\n Right now, all I\u0027m focused on is this blow job.\\n\\n I already know that I\u0027m not ready to come, but I don\u0027t tell her because I don\u0027t want her to stop yet, either. I let her go for a few minutes more before I push her away.\\n\\n \"Take a break,\" I tell her as I settle back into my seat.\\n\\n I don\u0027t bother to put myself away, I just sigh loud and long as I relax in the breeze. The girl turns her attention to the visor mirror, trying to straighten her mess of a face.\\n\\n \"Wait,\" I instruct. \"Hold on for a minute.\"\\n\\n She looks at me in confusion, her lipstick smeared. I smile.\\n\\n \"I know you want some of this,\" I tell her, grabbing a little bottle from my jacket pocket. I dump a few coke pebbles onto a little mirror on my console and crush them with a razor, dragging the powder into two straight lines.\\n\\n I offer her the little straw and now she\u0027s the one smiling with her distorted clown mouth.\\n\\n She snorts at her line, coughs, then snorts it again.\\n\\n Settling back into her seat, she tilts her face to the car roof as she lets the drug take effect. Her eyes are empty as she thrusts the straw at me and I hesitate for only a second.\\n\\n I\u0027ve hit it hard today and I\u0027ve done more than I usually do.\\n\\n Of everything.\\n\\n But for some reason, the need to disappear into the black is strong today, stronger than usual. And it\u0027s on days like this that I hit the hard stuff. I grab the straw and do my line, breathing in the powder that never fails to take me away. Even when I can count on nothing else, I can always count on this.\\n\\n The familiar burn immediately numbs my throat. The emptiness spreads throughout the rest of my body, dulling my senses, speeding up my heart. I can feel the blood pulsing through it, hard and pounding, carrying oxygen to my numb fingers.\\n\\n I fucking love this shit.\\n\\n I love the way it dulls everything but my attention. I love how it heightens my awareness while still turning everything else black and numb.\\n\\n This is where I am comfortable. Drifting here into this nothingness, this obscurity.\\n\\n Coke makes it easy to exist in the emptiness.\\n\\n I run my fingers through the traces of the remaining powder and slide it along the skin of my erection before grabbing the girl by the back of the neck. I shove her head back down and she opens her mouth willingly. This is most definitely not against her will. She wants to be here.\\n\\n Especially now that I have fed her habit.\\n\\n Especially now that she can lick her habit from my dick. If she moans now I\u0027ll believe it because she\u0027s getting something out of it, too.\\n\\n \"Finish,\" I tell her. I stroke her back while she moves and I can\u0027t feel my fingers.\\n\\n Her head bobs for a few more minutes and then without warning, I come in her mouth. Her eyes widen and she starts to pull away as my ejaculate seeps from the edges of her lips, but I hold her fast by the back of the neck until my dick stops throbbing.\\n\\n \"Swallow,\" I tell her politely.\\n\\n Her blank eyes widen, but she swallows obediently.\\n\\n I smile.\\n\\n She gags, but she doesn\u0027t heave.\\n\\n \"Thank you,\" I say, still polite. And then I lean past her and shove open the passenger side door. It creaks as it swings wide, evidence that cars were still made from iron back in 1968. I pull out my wallet and hand her a dog-eared twenty.\\n\\n \"Get yourself something to eat,\" I tell her. \"You\u0027re too skinny.\"\\n\\n She\u0027s got the look that girls on nose candy get. The way-too-thin look. That\u0027s one downfall of the stuff. It\u0027s good for drifting away into oblivion, but it\u0027s hell on your appetite. If you don\u0027t make yourself eat, you\u0027ll waste away and start looking like shit.\\n\\n This girl doesn\u0027t look like shit. Yet. She\u0027s not ugly. But she\u0027s not pretty either. She mostly looks hardened. Mousy brown hair, pale blue eyes. Bland, stick-thin body. I can take her or leave her.\\n\\n And I\u0027m leaving her.\\n\\n She glares at me as she wipes her mouth.\\n\\n \"My car is in town. Aren\u0027t you at least going to take me back to it?\"\\n\\n I look at her and note how there are three of her that blur into one, then back into three, before I shake the blurriness from my head and try to focus again.\\n\\n Nope. Still three of her.\\n\\n \"Can\u0027t,\" I tell her, dropping my head heavily against the headrest. \"I\u0027m too fucked up to drive. It\u0027s not that far, anyway. It\u0027s not my fault that you wore five-inch stripper shoes. Just take them off. It\u0027ll make it easier to walk.\"\\n\\n \"You\u0027re a fucking asshole, Pax Tate,\" she spits angrily. \"You know that?\"\\n\\n She grabs her purse from the floor and slams my car door as hard as she can. My car, Danger, shakes from her efforts.\\n\\n Yes, I named my car. A 1968 Dodge Charger in pristine condition deserves a name.\\n\\n And no, I don\u0027t care that this coked up little bitch thinks I\u0027m an asshole. I am an asshole. I\u0027m not going to deny it.\\n\\n As if to prove that point, I can\u0027t even think of her name right now even though it only took me one second to recall the name of my car. I might remember the girl\u0027s in the morning or I might not. That doesn\u0027t matter to me at this point. She\u0027ll come back. She always does.\\n\\n I\u0027ve got what she wants.\\n\\n I strip off my jacket and lay it on the passenger seat, zipping my pants back up as I watch her stomp away. Then I open my own door, dangling one black boot over the doorsill, letting the cool breeze rustle over my flushed, overheated body.\\n\\n The landscape up and down the coast is jagged and rolling and wild. It is so vast that it makes me feel small. The night is inky black and there are barely any stars. It\u0027s the kind of night where a guy can just disappear into the dark. My kind of night.\\n\\n I rest my head against the seat and allow the car to spin around me. It feels as though the seat is the anchor that is holding me to the ground. Without it, I might drift off into space and no one will ever see me again.\\n\\n It\u0027s not a bad notion.\\n\\n But the car is spinning too fast. Even in this state, I know it\u0027s too fast. I\u0027m not going to worry about it, though. I simply pull out my vial and take something to slow things down. My vial is like a magician\u0027s hat. It\u0027s got a little bit of everything in it. Everything I need; fast or slow, white or blue, capsule, pill or rock. I\u0027ve got it.\\n\\n I wash the pill down with a gulp of whiskey. I don\u0027t even feel the burn as it slides down my throat. I consider it for a minute, the speed that things are turning and blurring around me. I decide I should take another pill, maybe even two. I put them in my mouth and take another slog of Jack before I toss the bottle onto the passenger side floor. I realize that I don\u0027t know if I put the cap back on or not.\\n\\n Then I realize that I don\u0027t care.\\n\\n The drug-induced fog blurs my vision and all of the blacks and grays swirl together and I close my eyes against it. I still feel like I\u0027m moving, like the car is spinning round and round.\\n\\n The night swallows me and I am propelled into the darkness, far above the clouds and into the night sky, sailing through the stars, past the moon. Reaching out, I touch it with a finger.\\n\\n I laugh.\\n\\n Or I think I laugh.\\n\\n It\u0027s hard to say at this point. I don\u0027t know what\u0027s real or not real. And that\u0027s just the way I like it. \\n\\n","sourceLink":"https://allnovel.net/if-you-stay-beautifully-broken-1/page-1.html","bookId":2758,"book":{"id":2758,"title":"If You Stay (Beautifully Broken #1)","description":"Storyline: If You Stay (Beautifully Broken #1) \\n 24-year old Pax Tate is an asshole. \\n Seriously. \\n He’s a tattooed, rock-hard bad-boy with a bad attitude to match. \\n But he’s got his reasons. \\n His mother died when Pax was seven, leaving a hole in his heart filled with guilt although he doesn’t understand why. What he does know is that he and his dad are left alone and with more issues than they can count. \\n As Pax grew up, he tried to be the kid his father always wanted; the perfect golden boy, but it didn’t work. His dad couldn’t overcome his grief long enough to notice and Pax couldn’t keep up the impossible perfect façade. \\n So he slipped far, far from it. \\n Now, he uses drugs and women to cope with the ugliness, the black void that he doesn’t want to deal with. If he pretends that the emptiness isn’t there, then it isn’t, right? \\n Wrong. \\n And it’s never more apparent than when he meets Mila. \\n Sweet, beautiful Mila Hill is the fresh air to his hardened frown, the beauty to his ugly heart. He doesn’t know how to not hurt her, but he quickly realizes that he’s got to figure it out because he needs her to breathe. \\n When memories of his mother’s death resurface from where he’s repressed them for so long, Mila is there to catch him when the guilt starts making sense. Mila is the one…the one who can save him from his broken troubled heart; from his issues, from the emptiness. \\n But only if he can stop being an asshole long enough to allow it. \\n He knows that. And he’s working on it. \\n But is that enough to make her stay?\\n","cover":"https://allnovel.net/images/if-you-stay-beautifully-broken-1.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/if-you-stay-beautifully-broken-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:01:27 PM"}}
