{"id":84802,"no":19,"title":"Page 19","content":"My phone buzzes. As I pick it up, I notice that it is 7:05 p.m.\n Crap. I was supposed to meet Pax at 7:00. Time got away from me.\n Sure enough, I glance at the text and it is from him.\n Hey, Miss Tardy. Didn\u0027t we have a date tonight?\n I seriously hate to be late. As in, so freaking much. I\u0027ve always been that way. So I punch in a reply, hit send and am pulling my coat on as I run out the door. \"I\u0027m late, Maddy. Gotta go, bye.\"\n I can hear her laughing as I slam the door closed behind me.\n I pull into Pax\u0027s drive ten minutes later, and am galloping to the door when he sticks his head out the door and laughs.\n \"You look like a lame horse, Red. Calm down before you fall and break something.\"\n I step up onto the step and kiss him, my cold lips pressing to his warm ones. He looks sexy as hell, like he does on any other day, in his jeans that fit his ass perfectly and the black t-shirt that hugs his chest. I lean into him, soaking in his warmth. He smells like musk, and the woods and everything male. I inhale him and wrap my arms around his neck.\n \"I\u0027m sorry I\u0027m late,\" I tell him as I kiss him by the ear. \"Trust me, there\u0027s no place I\u0027d rather be than here.\"\n \"Really?\" he cocks an eyebrow. \"Then we agree. Because there\u0027s no place I\u0027d rather have you be, either.\"\n I roll my eyes at his corniness as we walk into his foyer. But then I push him against the wall and kiss him again, just because I want to. He drags me against him and I linger there, in the comfort of his arms. Holy cow. There really isn\u0027t anywhere I\u0027d rather be than here.\n Finally, I sigh. \"So, it was your turn to plan our date tonight. What are we doing? Want to order take-out?\"\n He shakes his head. \"I\u0027m hungry for fried zucchini. So I thought we\u0027d try to make it.\"\n I stare at him. \"You thought we\u0027d try to make fried zucchini? Um. I should mention that my family owns a restaurant, but I don\u0027t really cook. Much. And who in the world gets hungry for zucchini?\"\n Pax laughs and drags me up the stairs. \"My housekeeper used to make it when I was growing up. I loved it. So I looked for the recipe online today. I went to the grocery store and everything. What\u0027s the worst that can happen?\"\n \"Now you\u0027ve done it,\" I grumble as I take off my coat. \"You should never ask that question.\"\n Ten minutes later, we are both staring uncertainly at a recipe and a pan of oil on the stove. Everything in Pax\u0027s kitchen is gleaming and new. He\u0027s clearly never used it and doesn\u0027t know how. And I\u0027m no better.\n \"I\u0027m not sure about this,\" I tell him as the oil spits and sputters everywhere.\n He watches it for a minute. \"I think the oil is too hot,\" he decides and he turns the flame down just a bit. We roll the sliced zucchini in the flour mixture and drop it into the pan and it sizzles.\n We look at each other. \"Looks fine,\" he shrugs. \"I think we did it right.\"\n He turns to me. \"Now, where were we in the foyer?\"\n He reaches for me, pinning me against the granite counter. I smile.\n \"You realize, of course, that you look really out of place in the kitchen?\"\n I raise an eyebrow. He grins.\n \"I thought women wanted men who could cook?\"\n \"If so, I\u0027m probably out of luck,\" I tell him as I press my lips to his. He laughs, which rumbles in his chest and he lifts me up, sitting me on the counter. I automatically wrap my legs around him.\n \"It\u0027s where my legs belong, right?\" I remind him. He nods.\n \"You\u0027re learning.\"\n \"Oh, I\u0027m a good learner,\" I tell him with a grin as an idea occurs to me. \"Wanna see?\n I trail my fingers down to the button on his jeans and flick it open with one deft movement.\n \"Impressive,\" he says, cocking an eyebrow teasingly. \"But now what are you going to do? I think you already know how to use that.\"\n \"Maybe,\" I answer. \"But I haven\u0027t mastered everything. And every good student needs a teacher.\"\n He stares at me as I slide off the counter and pull his pants off, then his underwear. And then I drop to my knees in front of him.\n His eyes widen.\n \"You\u0027re going to...\" his voice trails off as I take him in my hand, sliding my fingers down his length. His penis lurches to life, instantly rock hard. I smile.\n I look up at him. \"I\u0027m sure I have the mechanics down, but everyone has preferences, don\u0027t you agree?\" He nods wordlessly, his eyes frozen to mine as I grasp him firmly in my hand. \"So I want you to tell me exactly how you like oral sex.\"\n He\u0027s frozen, his hands limp on my shoulders.\n \"Well, you should start by repeating that question, but instead of saying oral sex, say, \u0027Tell me exactly how to suck your dick\u0027. No, wait. Say cock. Because that word coming from your lips will be fucking hot.\"\n I smile at the eager look on his face. I love how he is so big and tattooed, but I can turn him on and make him speechless with just one little word. And saying that one naughty little word is turning me on, quite frankly.\n \"Okay, I\u0027ll play. Tell me, Pax. How do you want me to suck your cock?\"\n He stiffens, in more ways than one. He just got harder in my hand, although I didn\u0027t know that was possible.\n \"Cat got your tongue?\" I tease, as I lower my head and run my tongue along his shaft. \"It doesn\u0027t have mine.\"\n He shudders as I run my tongue around the tip, then lick down the back, then back up, like I\u0027m licking a lollipop.\n \"You\u0027re a freaking vixen,\" he mutters. \"You know what you\u0027re doing.\"\n \"I do. But tell me what you\u0027d really like,\" I prompt him, as I stroke him with my fingers again. \"I want to know.\"\n He swallows and closes his eyes, leaning back against the counter, his hands gripping the edge. He pushes further into my mouth.\n \"Okay, Red. I like it when you take all of me in your mouth. I want you to deep-throat me. If you can handle it.\"\n He says the last part like a dare.\n I want to smile, but don\u0027t. He continues speaking, his voice husky.\n \"While you suck me, I want you to squeeze my balls, just a little. Tug on them. Lightly. Push your fingers against me right behind my ball sack and pull. Lightly, not too hard.\"\n He shudders again when I do as he says. I pull his balls toward my mouth, just slightly.\n I inch my lips along his length, working the entire thing into my mouth. I feel like he is practically scraping the back of my throat, but I don\u0027t gag. I just concentrate on keeping my teeth from scraping him as I slide him in and out.\n \"Fuck,\" he groans, gripping the stone counter. \"Fuck.\"\n I make sure my lips form a good vacuum and continue sucking, sliding, moving. I stroke his balls and pull at them and Pax\u0027s breathing gets more and more ragged.\n And then, with his balls cupped in my hand, I suck on them.\n He tenses up completely, his knuckles turning white. \"Fuck.\"\n I smile now as I lick at them, then suck. Then lick.\n Then I plunge his dick back in my mouth, all the way. In, out, wet.\n I increase my speed and he finally yanks me away by my shoulders.\n \"I\u0027m going to come,\" he tells me raggedly. \"And I want to come inside of you.\"\n I yank off my clothes and he rolls me onto all fours, sliding into me from behind.\n He fills me up, the friction nail-bitingly hot. He rocks me to and fro as he leans over me, pressing his lips to my ear.\n \"Tell me to fuck you harder,\" he whispers.\n \"Fuck me harder,\" I say obediently and my voice is strained. It\u0027s hard to form thought, let alone words while he is doing what he\u0027s doing.\n As he slides in and out, he reaches around to my front, spinning circles around the most sensitive part of me. Then he presses his hand against my belly as he plunges deep inside. I cry out and he kisses in between my shoulder-blades.\n \"Tell me again,\" he says, with his lips still against my back.\n \"Fuck me harder,\" I feel like I am screaming now as he rides me from behind, his hand cupping me from beneath, driving me to distraction. \"Pax! Oh my God.\"\n I\u0027m moaning now, but he\u0027s pulling me with him toward an orgasm that is going to be mind-blowing. I can feel it building and building and his muscles flexing against me as he moves.\n \"Come in me,\" I tell him. \"I want to feel you come.\"\n He moves faster and just as I am moaning from my orgasm, he shudders from his. He grabs my ass and holds there, shaking as he finishes.\n And then I drop to the ground and he gently falls on top of me, while still supporting his weight. He kisses the side of my neck, breathing hard.\n \"That was fucking hot. You\u0027re fucking hot.\"\n I smile. \"Thank you. You\u0027re not too bad yourself.\"\n He chuckles, and as he does, I look around and notice the smoke.\n \"What the hell?\" I wiggle from under Pax and sit up. \"Holy hell!\"\n Smoke is billowing toward the ceiling. I leap to my feet, naked, running for the stove. At this very moment, the smoke alarms go off.\n Pax runs to disarm them and I slam a lid over the smoking pan of burned zucchini, turning the flame off.\n He rushes back and we stare at it. And then he laughs.\n \"Well, we did say it was fucking hot. Apparently, we lit my kitchen on fire.\"\n I giggle. \"That might have been our poor cooking skills.\"\n The entire house smells like it burned down now, so I walk around spraying air freshener while Pax scrapes out the burned mess into the disposal, running cold water over the pan.\n \"I think this is the end of my career as a chef,\" he announces as I wrap my arms around him from behind.\n \"That\u0027s okay,\" I tell him. \"I think there\u0027s already a Naked Chef out there. They don\u0027t need another one.\"\n He spins around and looks at me. \"I always need for you to be naked,\" he tells me as he drags his hands down my sides before he grasps my hips and pulls me to him.\n He kisses me, lightly and soft. \"You deserve a reward.\"\n I pull away a bit. \"A reward?\"\n He nods. \"Yep. For being such a good pupil.\"\n I laugh. \"What do you have in mind?\"\n \"You\u0027re going to like it. Give me a minute.\"\n He smiles and strides away, leaving me in the kitchen alone. And naked.\n This is an interesting turn of events, I decide as I put away the few things that we\u0027d left out. As I do, I let my mind wander. I think about how glad I am that I\u0027m on the pill now and that Pax\u0027s STD tests came back negative. It\u0027s nice not having to use condoms. And then, as I turn to rinse off the paring knife, I notice a hospital bill laying on the counter. I glance at it, and notice that it was from the night Pax overdosed which was exactly two months ago today.\n I\u0027m astounded. I hadn\u0027t realized it has been this long. Two whole months. Who would have ever thought that we\u0027d last this long?\n But Pax is back before I can over-analyze it. He grabs my hand, leading me up to the guest bathroom.\n \"Why are we in here?\" I ask as we walk inside.\n \"Because my bathroom doesn\u0027t have a tub,\" he explains. \"And after that performance, you deserve a hot bath. I don\u0027t have bubble bath, but I used some of your body wash from upstairs. Is that okay?\"\n I nod as I stare at the steaming, claw-footed tub. It\u0027s filled with bubbles and there is a folded towel next to it. And two lit candles. I can\u0027t even believe that he thought of this.\n \"Thank you,\" I tell him, as I turn and hug him. \"This is so sweet.\"\n \"It\u0027s just a bath,\" he murmurs as I continue to squeeze him. \"It\u0027s not a big deal.\"\n But it is. No one has ever run a bath for me, except for my mother, when I was little.\n \"It\u0027s the sweetest thing ever,\" I tell him as I step in. \"Trust me.\"\n I settle against the back of the tub and close my eyes.\n \"I\u0027ll let you soak for a bit,\" Pax tells me before he backs out of the room. I relax, inhaling the lavender scent as I enjoy the hot water. Every muscle kink fades away as I soak. And I revel in the thought that my big, bad boyfriend ran a bubble-bath for me.\n Just when my fingers are starting to prune, he walks through the door again. He\u0027s got underwear on now, but his chest is still bare.\n \"Hi,\" he says as he kneels behind me on his knees, reaching in and running his fingers along my shoulders. \"How was the bath?\"\n He bends and kisses the side of my neck and I lean into him.\n \"It was amazing,\" I answer. \"Thank you. It was just what I needed.\"\n \"Want to know something?\" he whispers into my ear. \"You\u0027re the most beautiful thing I\u0027ve ever seen. And I love you.\"\n I freeze, my heart pounding. I can literally hear my pulse pounding in my ears.\n I flip over in the water, my wet hands grasping his on the edge of the tub.\n \"Did you just say what I think you said?\"\n He nods. And for once, there is not one ounce of amusement on his face. He is completely serious.\n \"I love you. I love how you are so sweet and innocent and kind to people, but you are such a vixen in the sack. I love how you look at me. I love your smile. I love everything about you.\"\n I am completely still as I stare at him in utter shock.\n This is big. Huge. I\u0027ve known for a couple of weeks that I loved him, but I didn\u0027t want to scare him by telling him so. But he said it first. Tonight. It\u0027s dumbfounding. And unexpected.\n \"Aren\u0027t you going to say something?\" he asks and he actually looks nervous, as though I might reject him. My heart twinges.\n \"I love you, too,\" I tell him quickly. \"I have for weeks.\"\n And I leap out of the tub, the water sloshing onto the floor as I barrel into his arms. The velocity knocks him to the ground and I hover above him, dripping.\n \"I love you,\" I tell him again.\n \"I see that,\" he laughs, kissing me. \"Simple words would have sufficed. You didn\u0027t need to knock me down with it.\"\n I giggle. \"Shut up and kiss me.\"\n So he does. \n","sourceLink":"https://allnovel.net/if-you-stay-beautifully-broken-1/page-19.html","bookId":2758,"book":{"id":2758,"title":"If You Stay (Beautifully Broken #1)","description":"Storyline: \n If You Stay (Beautifully Broken #1) \n 24-year old Pax Tate is an asshole. \n Seriously. \n He’s a tattooed, rock-hard bad-boy with a bad attitude to match. \n But he’s got his reasons. \n His mother died when Pax was seven, leaving a hole in his heart filled with guilt although he doesn’t understand why. What he does know is that he and his dad are left alone and with more issues than they can count. \n As Pax grew up, he tried to be the kid his father always wanted; the perfect golden boy, but it didn’t work. His dad couldn’t overcome his grief long enough to notice and Pax couldn’t keep up the impossible perfect façade. \n So he slipped far, far from it. \n Now, he uses drugs and women to cope with the ugliness, the black void that he doesn’t want to deal with. If he pretends that the emptiness isn’t there, then it isn’t, right? \n Wrong. \n And it’s never more apparent than when he meets Mila. \n Sweet, beautiful Mila Hill is the fresh air to his hardened frown, the beauty to his ugly heart. He doesn’t know how to not hurt her, but he quickly realizes that he’s got to figure it out because he needs her to breathe. \n When memories of his mother’s death resurface from where he’s repressed them for so long, Mila is there to catch him when the guilt starts making sense. Mila is the one…the one who can save him from his broken troubled heart; from his issues, from the emptiness. \n But only if he can stop being an asshole long enough to allow it. \n He knows that. And he’s working on it. \n But is that enough to make her stay?\n \n","cover":"https://allnovel.net/images/if-you-stay-beautifully-broken-1.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/if-you-stay-beautifully-broken-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:01:27 PM"}}
