{"id":10624,"no":14,"title":"Chapter 13: The Escape.","content":"The first thing that the Barclays did, after reporting themselves, was to settle themselves in a lodging--no very easy thing to find, for the town was crowded with troops, and prisoners. However, as they were able to pay a higher sum than the great majority of French officers, in their position, they had no very great difficulty in finding a place to suit them. The rooms were purposely taken in a large house, with a staircase common to a number of families living on different floors; so that anyone going in or out would be less likely to be noticed than in a smaller house. They were also careful in choosing rooms so placed that they could go in and out of the door on to the staircase, without being noticed by the people with whom they lodged. Ralph\u0027s arm was now extremely painful, the long march having inflamed the wound. He had, therefore, on reporting himself, begged that a surgeon might attend him; and had also asked, as a great favor, that his servant--the hussar Doyle--might be allowed to remain with him; stating that, in that case, he would pay for his lodgings and provide him with food. As the prison in which the private soldiers were confined was, at the time, crowded; the request was complied with. For the next week Ralph suffered greatly with his arm, and had to keep his room. After that the inflammation subsided; and in another fortnight he was able to dispense, for the first time since he received his wound, with a sling. In the meantime he had made the acquaintance of the people with whom he lodged; who were very kind to their wounded lodger, and whose hearts he completely won by being able to chat to them in their native tongue, like one of themselves. The family consisted of a father, who was away all day at the railway station, where he was a clerk; the mother, a garrulous old woman; and a daughter, a pretty blue-eyed girl of about Ralph\u0027s age, who assisted her mother to wait upon them. She had a lover, away as a soldier in the army besieging Paris; and the thought that he might be wounded, or taken prisoner, made her very pitiful to the young officers. Ralph Barclay had--for some days--been intending to sound her as to her willingness to aid them when she, herself, began it one day. She had cleared away their dinner, and was standing--as she often did--talking with them, when she lowered her voice, so as not to be overheard by her mother in the next room: \"I wonder you don\u0027t try to get away. Lots of French officers have done so.\" \"That is just what we are thinking of, Christine. We have only been waiting till my arm was out of a sling, and we want you to help us.\" \"How can I help you?\" the girl asked. \"In the first place, you can buy us clothes. It would excite suspicion if we were to buy them, ourselves. Percy and I were thinking of going as girls--not pretty girls, of course, like you, Christine--but great, rough peasant girls.\" Christine laughed, and colored \"You would be too tall,\" she said. \"We should be rather tall,\" Ralph said, ruefully. \"We have grown so horribly, in the last few months. Still, some women are as tall as we are.\" \"Yes, some women are,\" Christine said, \"but men look after them and say, \u0027What big, gawky women!\u0027 and you don\u0027t want to be looked after. If people did so, they would see that you didn\u0027t walk one bit like a woman, and that your shoulders were very wide, and your arms very strong, and-- \"Oh no! It wouldn\u0027t do at all. I must think it over. \"I suppose you want that great blue-coated bear to go?\" and she nodded at Tim Doyle who--not being able to speak a word of her language--was always indulging in the most absurd pantomime of love and devotion; causing screams of laughter to the merry German girl. \"Yes, Tim must go too, Christine.\" \"Ha, ha!\" laughed the girl. \"Fancy him as a woman.\" \"What is she saying about me, Mister Percy?\" \"She says you would make a very pretty woman, Tim.\" \"Tare and ages, Mister Percy,\" Tim said, taking it quite seriously, \"how could I do it, at all? I\u0027d have to shave off all my beautiful beard and mustaches and, even then, I doubt if you would mistake me for a woman.\" The boys screamed with laughter, and translated the Irishman\u0027s speech to Christine; who laughed so that her mother came into the room. \"Look here, children,\" she said, smiling, \"I don\u0027t want to know what you are talking about. If anything of any sort happens, I may be asked questions; and I don\u0027t want to have to tell stories. I can\u0027t help hearing, if you leave the door open, and laugh so--indeed, all the neighborhood might hear it; so please shut the door, in future.\" So saying, she again went back to her work in the next room. \"Goodbye, I\u0027m going, too,\" Christine said. \"I will think it over, by tomorrow morning, and tell you what you are to do.\" The next morning, the boys were very anxious to hear Christine\u0027s proposals; for although they had quite made up their minds to try their own plan, if hers was not feasible, still they felt that, with her knowledge of the country, she was likely, at any rate, to give them good advice. Until she had cleared away breakfast, Christine said nothing. Then she took out her knitting, and sat against the window. \"Now,\" she began, \"I will tell you what I have thought of. It would be easy enough, if it was not for him. He\u0027s so big, and so red, and he doesn\u0027t speak German. \"Oh dear, he\u0027s very tiresome!\" and she shook her head at Tim; who smiled, laid his hand on his breast, and endeavored to look affecting. Christine laughed. \"The only thing I can think of, for him, is that he shall go out as a Jew peddler; with one of their broad hats, and a tray of little trinkets. He might pass, if none of the soldiers took it into their heads to buy.\" The proposition was translated to Tim Doyle. \"Is it me, your honor--me, Tim Doyle, a good Catholic, and come of honest people--that\u0027s to turn myself into a haythin Jew?\" the Irishman burst out, with great indignation. \"It was bad enough that I should be made into a woman, but a haythin Jew! I put it to your honors, it\u0027s nayther sinsible nor dacent.\" The boys went off in screams of laughter. Christine laughed for a moment, too, when they translated Tim\u0027s speech to her; and then looked indignant that the proposition, which had cost her so much thought, should be so scornfully rejected. Tim saw the look, and at once went on, persuasively: \"Sure now, darlint Miss Christine, don\u0027t be angry wid me, out of your bright blue eyes! But is it raisonable--is it natural to ask a Christian man to make a haythin Jew of himself? Would you like it, yourself?\" When the boys could stop laughing, they translated Tim\u0027s appeal. \"Did you ever see such an absurd man?\" she said, laughing. \"As if it could make any difference to his religion. Tell him I am a good Catholic, too, but I should not mind dressing up as a Jewess.\" \"Sure, thin, darlint,\" Tim exclaimed, when her speech was translated, \"I will go as a Jew, directly, if you\u0027ll go with me and be my Jewess.\" Christine laughed, blushed, shook her head and said, \"Nonsense!\" upon hearing Tim\u0027s proposition. \"But seriously, Christine,\" Ralph said, \"the objection which you mention to the Jew pedlar\u0027s disguise is important. Full as the streets are of soldiers looking about, he could hardly hope to go from here through the streets, and out at the gate, without someone asking him about the contents of his box.\" Christine allowed--a little pettishly, at the failure of her plan--that it certainly was likely. \"The real difficulty is to get outside the gate,\" Ralph said, thoughtfully. \"After that, I should have no fear.\" \"What are you thinking of doing, then?\" Christine asked. \"I was thinking of dressing Percy, and myself, in the clothes of young peasants; and putting Tim into something of the same sort, with a great bandage round his face. Then I should say that we were two lads, from some place near the frontier, who had come here to meet our uncle; who had had his jaw shattered, in battle. That would explain Tim\u0027s not being able to talk at all; and as to looks, he is red enough for a German, anywhere.\" \"Yes,\" Christine said, \"that would do, very well; but of course, you would be liable to be asked for papers.\" \"Of course,\" Ralph said, \"but we must risk something.\" \"I have an idea,\" Christine said, suddenly, clapping her hands. \"I have some cousins living at Wiesbaden. These are three boys, and I am sure they would do anything for me. I will go out to Wiesbaden, tomorrow, and ask them to lend me their papers, just for one day. Wiesbaden is not your way, at all; but for that very reason you would get out more easily there, and be less likely to be suspected, or followed. You could cross the Rhine somewhere near Saint Goar. \"I shall have to tell some sad stories to my cousins, and coax them a great deal. Still, I daresay I shall succeed; and then you can go boldly across the bridge, and into the railway station, and take a ticket for Wiesbaden. You can have an envelope, ready directed, and put the papers into the post there.\" \"The very thing, Christine. You are a darling!\" Ralph exclaimed, catching her by the waist and kissing her, before she had time to think of resistance. \"I shan\u0027t do anything at all for you,\" Christine said, laughing and blushing, \"if you misbehave in that way.\" \"I couldn\u0027t help it, Christine--not even if your mother had been looking on. \"And now, about our clothes.\" \"I couldn\u0027t buy them,\" Christine said. \"I never could go into a shop and buy men\u0027s clothes.\" The thing was so evident that, for a moment, the boys\u0027 looks fell. Then Christine said, coloring very much: \"There is a box, in my room, of Karl\u0027s things. He is my cousin, you know; and he was working as a gardener, here, till he had to go out in the Landwehr--so, of course, he left his things here, for us to take care of. He is about your size. I will take out one suit--it won\u0027t hurt it--and you can put it on, and go out into the town, and buy the things for all three of you.\" \"Capital!\" the boys exclaimed. \"It couldn\u0027t be better.\" Ten minutes afterwards, Ralph went down the stairs and out into the street, dressed as a German laborer in his best suit. He was a little uneasy, at first; but no one noticed him, and he was soon in a shop, haggling over the price of a peasant\u0027s coat--as if the matter of a thaler, one way or other, was a thing of vital importance to him. He bought the three suits at three different shops--as he thought that it would look suspicious, if he were to get them all at the same--and in an hour was back again. An hour afterwards, Christine started for Wiesbaden. The Barclays had reason to congratulate themselves that they had not longer deferred their preparations for escape; for when presenting themselves, as usual, that afternoon at the roll call, they were told that they must hold themselves in readiness to leave for one of the eastern fortresses, upon the following evening; as another large batch of prisoners, from Metz, was expected to arrive upon the following day. In the evening, Christine returned from Wiesbaden; which is distant only a quarter of an hour, by rail, from Mayence. \"I have got them,\" she said, \"but if you only knew the trouble I have had! What a bother boys are, to be sure!\" \"Especially cousins--eh, Christine?\" \"Especially cousins,\" Christine said, demurely. After thanking her very warmly for her kindness, the Barclays started out, and bought a variety of things which they thought might be useful. They also bought a pretty gold watch and chain, to give to Christine as a parting present. The next morning they answered, as usual, to their early roll call; and then, returning at once to their lodgings, changed their clothes for those which Ralph had purchased. It was agreed that they should not say goodbye to Christine\u0027s mother; in order that, whatever she might suspect, she might be able to say that she knew nothing of any idea, on the part of her lodgers, to make their escape. Then Christine herself came in, to say goodbye; and went half wild with delight, at the present. Then she said goodbye, kissed the boys--without any affectation of objecting to it--and then went to a window, to watch if they went safely down the street. The boys had no uneasiness, whatever, upon their own account--for they had before passed so easily, among the Prussian troops, that they felt quite confident in their disguise--but they were uncomfortable as to Tim, whose inability to answer questions would have at once betrayed them, had anyone addressed him. They had not ventured to bandage up his face, as if wounded; as he would have naturally, in that case, had a military pass. As the best thing they could think of, they had shoved a large lump of cotton into one of his cheeks--which gave him the appearance of having a swelled face--and had instructed him to frequently put his hand up to it, as if in great pain. Tim had plenty of shrewdness, and acted his part admirably. They passed across the bridge of boats, without question; and into the railway station, which is just opposite its end. Here soldiers and other officials swarmed; but the three walked along carelessly, the two boys chatting together in German, Tim walking with his hand up to his face, and giving an occasional stamp of pain. He sat down with Percy on a seat in the station, while Ralph went to the little window where tickets were being delivered. There were a good many people waiting and, when it came to Ralph\u0027s turn, and he put the papers in at the window, and asked for three third-class tickets to Wiesbaden, the clerk scarcely glanced at them; but handed the tickets over, without a question. They then went into the third-class waiting room, and sat down. There were a good many peasants, and others there; and when the doors opened for them to go on to the platform, and enter the carriages, they saw it was hopeless to try and get a carriage to themselves. They did, therefore, the best they could; putting Tim next to the window, while Percy sat next to, and Ralph opposite to him. The rest of the compartment was filled with country people. \"He seems in great pain,\" a good-natured peasant woman said, to Ralph; as Tim rocked himself backwards and forwards, in his anguish. \"Yes, he is very bad,\" Ralph said. \"Toothache?\" asked the woman. \"Worse than that,\" Ralph said, gravely, \"an abscess in the jaw. He has just been to the hospital.\" \"Poor fellow!\" the woman said. \"Why does he not poultice it? \"I should advise you to poultice,\" she said, addressing Tim. Tim gave a grunt--which might have meant anything--and Ralph said, in a whisper: \"Don\u0027t talk to him. Poor uncle, he is so bad tempered, now, it puts him in a rage if anyone speaks to him; because it hurts him so, to answer. At ordinary times, he is very good tempered; but now, oh!\" and Ralph made a little pantomime, to express the extreme badness of Tim\u0027s temper. \"You are not of Wiesbaden, are you?\" the woman asked. \"I do not know you by sight.\" \"No,\" Ralph said; \"we are from Holzhausen, a village some eight miles upon the other side of Wiesbaden.\" \"Ah!\" the woman said, \"I have a sister living there; surely you must know her. She is the wife of Klopstock, the carpenter.\" \"Surely,\" Ralph said, \"she is my neighbor; everyone knows her. She is very like you.\" \"Well now, you are the first person who has ever said that,\" the woman said, surprised. \"I am so short, and she is so tall.\" \"Yes, she is tall--very tall,\" Ralph said, very gravely; \"but there is something about the expression of your eyes which reminds me of Mrs. Klopstock. \"Yes, the more I look at you, the more I see it,\" and Ralph looked so earnestly, at the woman, that Percy had the greatest difficulty in preventing himself going off into a shout of laughter. \"I wonder I have never seen you, at Holzhausen,\" Ralph continued. \"Well,\" the woman said, \"it is years since I have been there. You see, it is a long way, and my sister often comes into Wiesbaden, and I see her; but in truth, her husband and I don\u0027t get on very well together. You know his temper is--\" and she lifted up her hands. \"Yes, indeed,\" Ralph said. \"His temper is, as you say, terrible. Between ourselves, it is so well known that we have a saying, \u0027As bad tempered as Klopstock the carpenter.\u0027 One can\u0027t say more than that-- \"But we are at Wiesbaden. Good morning.\" \"Good morning. I hope your uncle\u0027s tooth will be better, ere long.\" \"I hope so, indeed, for all our sakes,\" Ralph said. \"He is as bad as Klopstock, at present.\" So saying, they got out of the train and walked into the town. When they had separated from the crowd, Percy could restrain himself no longer, and went off into a scream of laughter. \"What is it, Mister Percy?\" Tim asked, opening his lips for the first time since they had left the house. \"Oh, Tim, if you had but heard!\" Percy said, when he recovered his voice. \"Do you know you are as bad tempered as Klopstock, the carpenter?\" \"Sure, I never heard tell of him, Mister Percy; and if I have been bad tempered, I haven\u0027t said much about it; and if the carpenter had a wad of cotton as big as a cricket ball in one cheek, as I have, it\u0027s small blame to him if he was out of temper.\" Both the boys laughed, this time; and then Ralph explained the whole matter to Tim, who laughed more heartily than either of them. \"Which way shall we go, Ralph?\" \"I looked at the map, the last thing before starting, Percy; and I noticed that the road went out past the gambling place. I dare not take out the map again, to look at the plan of the town--it would look too suspicious--so let us wander about, till we find the place. It has large grounds, so we cannot miss it.\" They were not long in finding the place they were looking for. There was no mistaking it; with its long arcades leading up to the handsome conversation rooms, its piece of water, and its beautifully laid-out grounds. \"I should like to go in, and have a look at it,\" Percy said. \"I can hear the band playing, now.\" \"So should I,\" Ralph said, \"but time is too precious. They will find out at the muster, this afternoon, that we are missing and, as we answered this morning, they will know that we cannot have got far. We had better put as many miles between us as we can. \"First of all, though, let us put those papers Christine got us into the envelope, and drop them into that post box. We should not do badly, either, to buy three dark-colored blankets before we start. It is terribly cold; and we shall want them, at night.\" They therefore turned up into the town again; and then Ralph separated from the others, and went in and bought the blankets. Ten minutes later they were walking along, at a steady pace, from the town. Each carried a stick. The boys carried theirs upon their shoulder; with a bundle, containing a change of clothes and other articles, slung upon it. Tim carried his bundle in one hand, and walked using his stick in the other. When a short distance out of the town, they stopped in a retired place; and put some strips of plaster upon Tim\u0027s cheeks, and wrapped up his face with a white bandage. It was, as he said, \"mighty uncomfortable,\" but as he was now able to dispense with the ball of cotton in his mouth, he did not so much mind it. The day was bitterly cold, for it was now the beginning of the second week of November; but the party strode on, full of the consciousness of freedom. They met but few people, upon their way; and merely exchanged a brief good day with those they did meet. They had brought some bread and cold meat with them, from Mayence; and therefore had no need to go into any shops, at the villages they passed. They did not dare to sleep in a house, as it was certain that some official would inquire for their papers; and therefore, when it became dark, they turned off from the road and made for a wood, at a short distance from it. Here they ate their supper, laid a blanket on the ground, put the bundles down for pillows, and lay down close together, putting the other two blankets over them. \"It\u0027s mighty cold,\" Tim said, \"but we might be worse.\" \"It\u0027s better than a prison in Pomerania, by a long way,\" Ralph answered. \"By the look of the sky, and the dropping of the wind, I think we shall have snow before morning.\" At daybreak, next morning, they were up; but it was some little time before they could start, so stiffened were their limbs with the cold. Ralph\u0027s prognostication as to the weather had turned out right, and a white coating of snow lay over the country. They now set off and walked, for an hour, when they arrived at a large village. Here it was agreed they should go in, and buy something to eat. They entered the ale house, and called for bread, cheese, and beer. The landlord brought it and, as they expected, entered into conversation with them. After the first remarks--on the sharpness of the weather--Ralph produced a tin of portable soup, and asked the landlord if he would have it heated, for their uncle. \"He cannot, as you see, eat solid food,\" Ralph said; \"He had his jaw broken by a shell, at Woerth.\" \"Poor fellow!\" the landlord said, hastening away with the soup. \"Are you going far?\" he asked, on his return. \"To Saint Goar,\" Ralph said. \"But why does he walk?\" the landlord asked. \"He could have been sent home, by train.\" \"Of course he could,\" Ralph said. \"We walked over to see him, and intended to have walked back again; but when the time came for us to start, he said he would come, too. The surgeon said he was not fit to go. Uncle had made up his mind to be off and, as the surgeon would not give him an order, he started to walk. He says it does not hurt him so much as the jolting of the train, and we shall be home to breakfast.\" An hour later they arrived at Saint Goarshaus. They were now quite out of the track which prisoners escaping from Mayence would be likely to take, and had not the slightest difficulty in getting a boat to cross the Rhine. \"How beautiful the river is, here,\" Percy said. \"Yes it is, indeed,\" Ralph answered. \"I believe that this is considered one of the most lovely spots on the whole river. I can\u0027t say that I think that that railway, opposite, improves it.\" They landed at Saint Goar, and tramped gaily on to Castellan, and slept in a barn near that village. The next morning they were off before daybreak and, eight miles farther, crossed the Moselle at Zell. They left the road before they arrived at Alf; for they were now approaching the great road between Coblentz and the south, and might come upon bodies of troops upon the march, or halting; and might be asked troublesome questions. They therefore struck upon a country lane and, keeping among the hills, crossed the main road between Bertrich and Wittlech; and slept in a copse, near Dudeldf. They had walked five-and-thirty miles, and were so dead beat that even the cold did not keep them awake. Next morning they got a fresh supply of bread and cheese, at a tiny village between Dudeldf and Bittburg and, leaving the latter place to the left, made straight for the frontier, across the hills. The road to the frontier ran through Bittburg; but they were afraid of keeping to it, as there were sure to be troops at the frontier. Several times they lost their way; but the pocket compass and map, which they had brought with them, stood them in good stead and, late in the evening, they arrived at the stream which forms the frontier. It was, fortunately, very low; for the cold had frozen up its sources. They had, therefore, little difficulty in crossing and, tired as they were, gave a cheer upon finding themselves in Luxembourg. They tramped along merrily, until they came to a cottage; where they boldly entered, and were received with the greatest kindness, and hospitality. The Luxembourg people at once feared and hated Prussia, and were delighted to do anything in their power for the escaped prisoners. The peasant made a blazing fire, and some hot coffee; and the tired travelers felt what a blessing it was to sit down without listening, every moment, for the step of an enemy. The peasants told them, however, that they were not yet altogether safe for that, owing to the complaints of Prussia, both the Dutch and Belgian Governments were arresting, and detaining, escaped prisoners passing through their territories. After some discussion the boys agreed that, next morning, they should dress themselves in the change of clothes they had brought--which were ordinary shooting suits--and should leave their other clothes behind; and then walk as far as Spa, twenty miles to the north. They would excite no suspicion in the minds of anyone who saw them arrive; as they would merely be taken for three Englishmen, staying at one of the numerous hotels there, returning from a walk. Their feet however were so much swollen, the next morning, that they were glad to remain another day quiet in the cottage; and the following day they started, and walked gaily into Spa. After strolling about the place, some time, they went to the railway station at the time the evening train started for Brussels; asked for tickets--in very English French--and, at eleven o\u0027clock at night, entered Brussels. Here their troubles were over. A good night\u0027s rest, in a good hotel, completely set them up again and, the next morning, they left by train for Dunkirk. There they reported themselves to the French officer in command; and received permission to go on board a Government steamer which was to leave, the next morning, for Cherbourg. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3162/86789.html","bookId":872,"book":{"id":872,"title":"The Young Franc Tireurs","description":"简介： The usually quiet old town of Dijon was in a state of excitement. There were groups of people in the streets; especially round the corners, where the official placards were posted up. Both at the Prefecture and the Maine there were streams of callers...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3162","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
