{"id":39541,"no":6,"title":"LETTER IV.","content":"Death of the Queen of Navarre—Marguerite’s Marriage with Her Son, the King of Navarre, Afterwards Henri IV. of France.—The Preparations for That Solemnisation Described.—The Circumstances Which Led to the Massacre of the Huguenots on St. Bartholomew’s Day. Some short time after this a marriage was projected betwixt the Prince of Navarre, now our renowned King Henri IV., and me. The Queen my mother, as she sat at table, discoursed for a long time upon the subject with M. de Meru, the House of Montmorency having first proposed the match. After the Queen had risen from table, he told me she had commanded him to mention it to me. I replied that it was quite unnecessary, as I had no will but her own; however, I should wish she would be pleased to remember that I was a Catholic, and that I should dislike to marry any one of a contrary persuasion. Soon after this the Queen sent for me to attend her in her closet. She there informed me that the Montmorencys had proposed this match to her, and that she was desirous to learn my sentiments upon it. I answered that my choice was governed by her pleasure, and that I only begged her not to forget that I was a good Catholic. This treaty was in negotiation for some time after this conversation, and was not finally settled until the arrival of the Queen of Navarre, his mother, at Court, where she died soon after. Whilst the Queen of Navarre lay on her death-bed, a circumstance happened of so whimsical a nature that, though not of consequence to merit a place in the history, it may very well deserve to be related by me to you. Madame de Nevers, whose oddities you well know, attended the Cardinal de Bourbon, Madame de Guise, the Princesse de Conde, her sisters, and myself to the late Queen of Navarre’s apartments, whither we all went to pay those last duties which her rank and our nearness of blood demanded of us. We found the Queen in bed with her curtains undrawn, the chamber not disposed with the pomp and ceremonies of our religion, but after the simple manner of the Huguenots; that is to say, there were no priests, no cross, nor any holy water. We kept ourselves at some distance from the bed, but Madame de Nevers, whom you know the Queen hated more than any woman besides, and which she had shown both in speech and by actions,—Madame de Nevers, I say, approached the bedside, and, to the great astonishment of all present, who well knew the enmity subsisting betwixt them, took the Queen’s hand, with many low curtseys, and kissed it; after which, making another curtsey to the very ground, she retired and rejoined us. A few months after the Queen’s death, the Prince of Navarre, or rather, as he was then styled, the King, came to Paris in deep mourning, attended by eight hundred gentlemen, all in mourning habits. He was received with every honour by King Charles and the whole Court, and, in a few days after his arrival, our marriage was solemnised with all possible magnificence; the King of Navarre and his retinue putting off their mourning and dressing themselves in the most costly manner. The whole Court, too, was richly attired; all which you can better conceive than I am able to express. For my own part, I was set out in a most royal manner; I wore a crown on my head with the ‘coet’, or regal close gown of ermine, and I blazed in diamonds. My blue-coloured robe had a train to it of four ells in length, which was supported by three princesses. A platform had been raised, some height from the ground, which led from the Bishop’s palace to the Church of Notre-Dame. It was hung with cloth of gold; and below it stood the people in throngs to view the procession, stifling with heat. We were received at the church door by the Cardinal de Bourbon, who officiated for that day, and pronounced the nuptial benediction. After this we proceeded on the same platform to the tribune which separates the nave from the choir, where was a double staircase, one leading into the choir, the other through the nave to the church door. The King of Navarre passed by the latter and went out of church. But fortune, which is ever changing, did not fail soon to disturb the felicity of this union. This was occasioned by the wound received by the Admiral, which had wrought the Huguenots up to a degree of desperation. The Queen my mother was reproached on that account in such terms by the elder Pardaillan and some other principal Huguenots, that she began to apprehend some evil design. M. de Guise and my brother the King of Poland, since Henri III. of France, gave it as their advice to be beforehand with the Huguenots. King Charles was of a contrary opinion. He had a great esteem for M. de La Rochefoucauld, Teligny, La Noue, and some other leading men of the same religion; and, as I have since heard him say, it was with the greatest difficulty he could be prevailed upon to give his consent, and not before he had been made to understand that his own life aid the safety of his kingdom depended upon it. The King having learned that Maurevel had made an attempt upon the Admiral’s life, by firing a pistol at him through a window,—in which attempt he failed, having wounded the Admiral only in the shoulder,—and supposing that Maurevel had done this at the instance of M. de Guise, to revenge the death of his father, whom the Admiral had caused to be killed in the same manner by Poltrot, he was so much incensed against M. de Guise that he declared with an oath that he would make an example of him; and, indeed, the King would have put M. de Guise under an arrest, if he had not kept out of his sight the whole day. The Queen my mother used every argument to convince King Charles that what had been done was for the good of the State; and this because, as I observed before, the King had so great a regard for the Admiral, La Noue, and Teligny, on account of their bravery, being himself a prince of a gallant and noble spirit, and esteeming others in whom he found a similar disposition. Moreover, these designing men had insinuated themselves into the King’s favour by proposing an expedition to Flanders, with a view of extending his dominions and aggrandising his power, knew would secure to themselves an influence over his royal and generous mind. Upon this occasion, the Queen my mother represented to the King that the attempt of M. de Guise upon the Admiral’s life was excusable in a son who, being denied justice, had no other means of avenging his father’s death. Moreover, the Admiral, she said, had deprived her by assassination, during his minority and her regency, of a faithful servant in the person of Charri, commander of the King’s body-guard, which rendered him deserving of the like treatment. Notwithstanding that the Queen my mother spoke thus to the King, discovering by her expressions and in her looks all the grief which she inwardly felt on the recollection of the loss of persons who had been useful to her; yet, so much was King Charles inclined to save those who, as he thought, would one day be serviceable to him, that he still persisted in his determination to punish M. de Guise, for whom he ordered strict search to be made. At length Pardaillan, disclosing by his menaces, during the supper of the Queen my mother, the evil intentions of the Huguenots, she plainly perceived that things were brought to so near a crisis, that, unless steps were taken that very night to prevent it, the King and herself were in danger of being assassinated. She, therefore, came to the resolution of declaring to King Charles his real situation. For this purpose she thought of the Marechal de Rais as the most proper person to break the matter to the King, the Marshal being greatly in his favour and confidence. Accordingly, the Marshal went to the King in his closet, between the hours of nine and ten, and told him he was come as a faithful servant to discharge his duty, and lay before him the danger in which he stood, if he persisted in his resolution of punishing M. de Guise, as he ought now to be informed that the attempt made upon the Admiral’s life was not set on foot by him alone, but that his (the King’s) brother the King of Poland, and the Queen his mother, had their shares in it; that he must be sensible how much the Queen lamented Charri’s assassination, for which she had great reason, having very few servants about her upon whom she could rely, and as it happened during the King’s minority,—at the time, moreover, when France was divided between the Catholics and the Huguenots, M. de Guise being at the head of the former, and the Prince de Conde of the latter, both alike striving to deprive him of his crown; that through Providence, both his crown and kingdom had been preserved by the prudence and good conduct of the Queen Regent, who in this extremity found herself powerfully aided by the said Charri, for which reason she had vowed to avenge his death; that, as to the Admiral, he must be ever considered as dangerous to the State, and whatever show he might make of affection for his Majesty’s person, and zeal for his service in Flanders, they must be considered as mere pretences, which he used to cover his real design of reducing the kingdom to a state of confusion. The Marshal concluded with observing that the original intention had been to make away with the Admiral only, as the most obnoxious man in the kingdom; but Maurevel having been so unfortunate as to fail in his attempt, and the Huguenots becoming desperate enough to resolve to take up arms, with design to attack, not only M. de Guise, but the Queen his mother, and his brother the King of Poland, supposing them, as well as his Majesty, to have commanded Maurevel to make his attempt, he saw nothing but cause of alarm for his Majesty’s safety,—as well on the part of the Catholics, if he persisted in his resolution to punish M. de Guise, as of the Huguenots, for the reasons which he had just laid before him. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3063/84626.html","bookId":991,"book":{"id":991,"title":"Memoirs of Marguerite de Valois, Complete","description":"简介： The Memoirs, of which a new translation is now presented to the public, are the undoubted composition of the celebrated princess whose name they bear, the contemporary of our Queen Elizabeth; of equal abilities with her, but of far unequal fortunes....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3063","creation":"Aug 1, 2019 12:24:07 AM","modification":"Aug 1, 2019 12:24:07 AM"}}
