{"id":9243,"no":4,"title":"CHAPTER III. THE TRIAL.","content":"The cries of “Silence” by the constables were some time in being of effect, so anxious were the people without to get in. The efforts of those inside to secure places of vantage was also the cause of some confusion and noise, but, at length, order was obtained. The learned looking judges, with their wigs and gowns, whispered to each other, and then to the clerk. There was some passing of papers back and forth among them, and then Clark Sewall, clearing his voice importantly, read from a parchment he held: “Indictment of Tituba, the Indian, and of Marie de Guilfort. The jurors for our Sovereign Lord and Lady, King William and Queen Mary, do present that you, Tituba, the Indian, and Marie de Guilfort, in the county of Essex, upon the 26th day of February, in the fourth year of the reign of our Sovereign Lieges, rulers, by the grace of God, over England, Ireland, Scotland and France, King and Queen, defenders of the faith; divers other days and times, as well as before and after, certain detestable arts called witchcraft and sorceries, wickedly and feloniously, 33hath used, preached, exercised, at and within the township of Salem aforesaid, in and upon and against Elizabeth Parris and Abigaile Williams. By which said wicked arts the said children are hurt and tortured, afflicted, pined, consumed, wasted and tormented. And also for sundry acts of witchcraft, by the said Tituba and Marie committed and done before and since that time, against the peace of our Sovereign Lord and Lady, their Crown and dignity, and against the forms of statutes in that case made and provided.” All this the clerk read, scarce pausing for breath, and, when he had finished, a sound like a great sigh went up from the people. “Terrible! Oh, most terrible!” whispered Willis. “Out upon you,” I exclaimed. “’Tis naught but a lot of high sounding law terms. Master Sewall has a pretty trick of rolling them off his tongue.” I glanced at the prisoners, who had been led to chairs on the high platform near the judges’ desks. She, who was called Marie, looked straight over the heads of the crowd, right down to where I sat. Her eyes roved on past me to the shrinking form of the maiden at my right. The latter raised her head, her eyes dim with tears. While I watched her lips moved, as if in prayer, and she stretched out her arms to the beautiful girl on the stand. “Who is the maid at our right?” I asked of Willis. 34“’Tis Lucille, the cousin of Marie,” he answered. Just then Lucille turned her head, and her eyes met mine. Full half a minute we gazed at each other, and though I know not the import of the message that came from her eyes, it was like one that would make me do her bidding, even though death stood in the way. The indictment having been read the witnesses against the accused were called. The mother of Elizabeth mounted the stand, and began giving her testimony in a dull, monotonous tone. She told how the two children were of a sudden stricken into fits one day, which illness Dr. Clarke was not able to allay. Then the children cried out that some one was thrusting pins in them. Dr. Jacobs related how he had been called in, and, finding no evident cause for the ailments, had concluded, with Dr. Clarke, that the girls were possessed by witches. How the learned men arrived at this conclusion they said not. Then came strange testimony. Dr. Jacobs told how he had cautioned Mistress Parris to hang the children’s blankets near the fireplace at night, burning whatever fell therefrom. A great toad dropped out, the woman said, and a boy caught the reptile up with the tongs, and threw it in the fire. It exploded with a noise like gun powder, and the next day Tituba was found to be burned on the left cheek, which made it plain that she had changed herself into a toad for the purpose of tormenting 35the children. What further proof was wanting? If there was it would seem to have been furnished by the girls themselves. They were brought into court, trembling and shrinking back. And then, suddenly, with mine own eyes, I saw them fall down in strange fits, the like of which I had never seen before. They cried that pins and knives were being stuck into them by Marie and Tituba. Though how that could be I fathomed not, for the hapless women never moved from their seats. But a murmer went around, and the judges, nodding their heads, looked grave. Next Farmer John Sloan related how he was removing his hay from the meadow, using three carts. “And, your Honors,” he said, “when I passed Tituba’s house one of the wheels touched her gate post, and she muttered an evil spell against me. After that the cart was overturned, though the road was without ruts. Coming from the field on the next trip the cart did somehow fasten itself between two gate posts, so that they had to be cut away ere the cart could be drawn through. Yet neither the wheels nor the sides nor any part of the cart did touch the posts.” “’Tis enough,” broke in Judge Corwin. “Do you question the prisoners, Judge Hathorne. Let not the day of judgment be stayed. A great evil is upon the land, and must be purged away.” 36Judge Hathorne asked Tituba what evil spirit she had familiarity with, and whether she had ever seen the Devil. Then of a sudden she rose in her chair. She let her eyes rove over the room, while the whole assemblage, judges, jurors, and all save myself, cowered in their seats. “Aye,” she shrieked, “aye, I have seen him. He came to me in his chariot of fire, and bade me serve him. I dared not say him nay. Also have I seen two rats, a red one and a white one. And they did command that I pinch the children. Aye, the rats did carry me to them like a spirit of the air, and I pinched them and thrust sharp pins in them. Aye, the Devil! the Devil! the Devil!” And then the creature ceased, and shrank back in her chair, crooning away in her own tongue. The judges on their benches shuddered, and many near me whispered: “She is a witch, indeed.” Next their honors turned toward Marie, and a sound like a great deep cry came from the maiden near me. I half started from my seat, and had a mind to draw my sword, to do what I could to rescue the beautiful girl who seemed to me to be as innocent as the flowers. But even as I rose, scowling looks met me at every side. Some of the constables hastened in my direction, and Master Willis, with a quick motion, drew me back into my seat. Clearly the town folks were witch-mad, and would brook no interference 37with their doings. I listened to what the judge was saying. “Are you a witch?” he asked of Marie. But she did not reply. “Answer,” commanded the clerk. “Tell his Honor if you be a witch.” Then in a voice that, though it was weak from fear, yet which seemed like the tinkle of a silver bell, sad and sweet, came the reply: “I am no witch indeed. You who have known me since I have lived among you know me for but a harmless maid.” “True enough; she was kind to me when my child was sick unto death,” said a woman near me. But the terror of the scarlet snow of the night before had seized on the minds of all, so that they could not see the truth. “Confess, and ye die not,” said Judge Hathorne. He leaned over toward Marie, a trace of pity on his face. But Marie only looked down at her cousin, whose lips were moving in silent prayer. “Will ye not confess, and save your soul?” persisted the judge, in some anger at the manner in which the fair prisoner ignored him. “I can speak in the presence of God, safely, as I may look to give account another day,” said Marie, “that I am as innocent of witchcraft as the babe unborn.” There was a murmur in the crowd, but it was quickly hushed. The Indian woman was swaying back and forth 38in her chair, mumbling away, and now and then breaking out into a wild melody. Some near me said she was singing her death song as is the custom of that race. The judges motioned the jury to retire, and, while they were out I sat looking at Lucille. Her body was shaking with sobs. Marie, on the contrary, did nothing but sit and stare away into vacancy, with wide, unseeing eyes, like a beautiful statue. It seemed but a short time ere the jury was back again. Once more the constables proclaimed silence. The jurors took their seats. There were the usual questions and answers, and then the leader said: “We find Tituba, the Indian, and Marie de Guilfort guilty of witchcraft.” “And the sentence of this court is that you both be taken hence and hanged by the necks until ye both are dead, and may God have mercy on your souls,” came from the judge. The fatal words scarce were uttered when Lucille rose from her seat. Her face was the color of the white snow outside. She reeled, and would have fallen, had I not sprang toward her, catching her in my arms, and carrying her to the fresh air without. I held her, hardly knowing what to do with the lovely burden, until some women, who had hastened from the court room came up and relieved me. Then like one in a dream I made my way to the tavern. I was aware of a multitude following the 39prisoners to the gaol, crowding about the unfortunates, as if rejoicing at their distress. Then I left the assemblage behind, and went into the inn, where I drank deep of the ale to try and drive from my mind the memory of what I had observed. ’Twas but a few hours since I had reached Salem, yet I had seen strange sights. I had been near to death, I had been witness to the scarlet snow, and I had heard the words of doom pronounced. Truly events moved with no little speed in this new land. The day passed, and I did not leave the inn. The darkness fell. There came a confused murmer from the centre of the town. Some men passed the tavern, running in the direction of the little hill, whence I had first found the right path, in my journey of the night before. They were hastening to the place of execution. I went to bed with a heavy heart. And I dreamed strange dreams of horrid witches. I rose as soon as it was light, but, early as I was, the inn keeper was before me. He told me the two prisoners had been hung that night, and, though I desired greatly to question him concerning Lucille de Guilfort, I forebore. However, he spoke of her soon, telling me that she had been with her cousin to the last. The gaolers had to drag them apart, when they led Marie to the scaffold. After the execution Lucille had gone to her home in great distress, attended by some women folks, who 40vainly tried to console her. It made my blood boil to think of the matter, and, when my hand fell to my sword hilt, I felt that I would ask no better work than to lay about among some of these witch-finders. But there was other work ahead of me. I must soon begin to plan for the raising of my men, as desired by Sir William.","sourceLink":"http://novel.tingroom.com/jingdian/1758/51392.html","bookId":1116,"book":{"id":1116,"title":"With Force and Arms","description":"简介： The showman, crying his attractions, lifted up his voice at the flap of his tent. So, at this, the entrance to that which is within, those who stop to read may gain a hint of what is beyond. Only a little, though, to whet your appetite and make you w...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1758","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
