{"id":21203,"no":5,"title":"CHAPTER V. GRANT ORDERS A NEW SUIT.","content":"Grant listened to what Rodney said, but Mr. Tarbox’s anger did not signify as much to him as it would have done a few hours earlier. The money he possessed made him feel independent. \\n\\n \\n\\n Seth Tarbox appeared at the door, ready to empty the vials of his wrath on Grant’s devoted head. \\n\\n \\n\\n “So you’ve been loiterin’ on the way, have you?” he said harshly. “You’ve been twice as long as you need to be.” \\n\\n \\n\\n “Well, perhaps I have,” Grant admitted coolly. \\n\\n \\n\\n “So you own up to it, do you?” \\n\\n \\n\\n “Of course I do.” \\n\\n \\n\\n “And what excuse have you?” \\n\\n \\n\\n “Do you expect me to work all the time?” \\n\\n \\n\\n “I expect you to earn your board and clothes.” \\n\\n \\n\\n 39“I earn them both, and more too, but I don’t get the clothes.” \\n\\n \\n\\n “Hey? Oh, I see. You loitered because I wouldn’t buy you a suit of clothes,” snarled Seth. \\n\\n \\n\\n “You can take it that way if you want to,” said Grant. \\n\\n \\n\\n “What’s got into you, Grant Colburn? ’Pears to me you are mighty independent all at once.” \\n\\n \\n\\n “That’s the way I feel.” \\n\\n \\n\\n “You seem to forget that but for me you wouldn’t have a home.” \\n\\n \\n\\n “When you get tired of providing me with a home, Mr. Tarbox, I will find one somewhere else.” \\n\\n \\n\\n “So you think, but if you leave my home you’ll become a poor tramp.” \\n\\n \\n\\n Rodney laughed. \\n\\n \\n\\n “I guess you’re right, grandfather,” he said. \\n\\n \\n\\n Grant darted a look at him which showed that he understood the nature of his feelings. \\n\\n \\n\\n “Well,” he said, “I’ll take the risk.” \\n\\n \\n\\n “I don’t take back the offer of a suit of 40clothes, Grant,” said Rodney smoothly. “I’ll bring ’em over the next time I come.” \\n\\n \\n\\n “Yes, do, Rodney,” put in his grandfather. \\n\\n \\n\\n “You needn’t take the trouble, Rodney,” said Grant. “I shan’t wear the suit if you bring it.” \\n\\n \\n\\n “I suppose you expect I’ll buy you a new one,” sneered Seth Tarbox. \\n\\n \\n\\n “No, I don’t.” \\n\\n \\n\\n “Then you are content to go as you are?” \\n\\n \\n\\n “No, I shall have a new suit in a few days, if I have to pay for it myself.” \\n\\n \\n\\n “You’re welcome to do that,” responded Seth in a tone of satisfaction, for he concluded that Grant’s mother would pay the bill, and that suited him. \\n\\n \\n\\n No more was said to Grant on the subject of his delay in returning from the other farm. He had occasion a little later to go on an errand, and called at the village tailor’s. \\n\\n \\n\\n “Mr. Shick,” he said, “I want you to make me up a good serviceable suit. How much will it cost?” \\n\\n \\n\\n “It depends on the cloth, Grant. Here is a remnant that will wear like iron. I can make 41it up in two styles, according to the trimmings, seventeen dollars or twenty.” \\n\\n \\n\\n “I want a good suit, and will pay twenty.” \\n\\n \\n\\n The tailor was rather surprised, for he knew that Grant’s step-father was a thoroughly mean man. \\n\\n \\n\\n “Mr. Tarbox is getting liberal, isn’t he?” he inquired. “That’s more than he pays for his own suits.” \\n\\n \\n\\n “He isn’t going to pay for mine.” \\n\\n \\n\\n “Oh, it’s your mother, then.” \\n\\n \\n\\n “No, I shall pay for it myself.” \\n\\n \\n\\n “Will it be cash down?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “I am glad you are so well off, Grant,” said Mr. Shick, puzzled. \\n\\n \\n\\n “So am I. You may rest assured that you won’t have to wait for your money.” \\n\\n \\n\\n “Then I’ll do a good job. You shall have as nice a suit as any boy in the village. You deserve it, too, Grant, for you’re a hard-working boy.” \\n\\n \\n\\n “Just say that to Mr. Tarbox when you meet him,” said Grant, smiling, “for I am afraid he doesn’t fully appreciate me.” \\n\\n \\n\\n 42As Grant left the tailor’s shop he met Rodney at the door. Rodney found the farm rather a slow place, and had made a second visit to the village. \\n\\n \\n\\n “Hallo,” he exclaimed, “have you been into the tailor’s?” \\n\\n \\n\\n “Yes,” \\n\\n \\n\\n “I suppose you had business there.” \\n\\n \\n\\n “I had.” \\n\\n \\n\\n “What was it?” \\n\\n \\n\\n “You can ask Mr. Shick, if you like. I’m in a hurry.” \\n\\n \\n\\n Rodney decided to act on this suggestion. \\n\\n \\n\\n “How do you do, Mr. Shick?” he said politely, for he wanted to get some information. “I see Grant has just been in here.” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “Are you going to make him a suit?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n Rodney was surprised. \\n\\n \\n\\n “Would you mind showing me the cloth?” he asked. “I might like to get a suit myself.” \\n\\n \\n\\n “I shall be happy to fill your order. This is the cloth.” \\n\\n \\n\\n “It looks pretty good.” \\n\\n \\n\\n 43“Yes, it is of excellent quality.” \\n\\n \\n\\n “How much do you charge for a suit off this cloth?” \\n\\n \\n\\n “Twenty dollars is what I charged Grant.” \\n\\n \\n\\n It must be explained that Shick, being in the country, was obliged to put his prices a good deal lower for the same article than if he lived in the city. \\n\\n \\n\\n “Well, I hope you’ll get your pay,” said Rodney shortly. \\n\\n \\n\\n “I shan’t trouble myself about that. Grant is an honest boy.” \\n\\n \\n\\n “Well, I’m glad you feel so confident.” \\n\\n \\n\\n Rodney left the shop abruptly, and, going into the street, came face to face with his grandfather. \\n\\n \\n\\n “Grandfather,” he said, “I’ve got some news for you.” \\n\\n \\n\\n “Have you, Rodney? What is it?” \\n\\n \\n\\n “Grant has ordered a suit of Mr. Shick, for which the price is twenty dollars.” \\n\\n \\n\\n “You don’t mean it?” ejaculated the farmer. \\n\\n \\n\\n “Yes, I do. I suppose the bill will be sent to you,” added Rodney, desirous of making trouble. \\n\\n \\n\\n 44“I won’t pay it!” exclaimed Seth Tarbox excitedly. \\n\\n \\n\\n “You’d better see Mr. Shick about it.” \\n\\n \\n\\n Seth Tarbox entered the shop, looking flurried. \\n\\n \\n\\n “Is it true, Mr. Shick,” he said abruptly, “that Grant has ordered a twenty-dollar suit of you?” \\n\\n \\n\\n “Yes, Mr. Tarbox.” \\n\\n \\n\\n “If you expect me to pay for it, you’ll be disappointed. Did Grant tell you to charge it to me?” \\n\\n \\n\\n “No; he said he would pay for it himself.” \\n\\n \\n\\n “I suppose he expects to get the money out of his mother,” continued Mr. Tarbox, feeling somewhat relieved. “It will be a shame to make her pay so much. Why, I don’t pay that for my own suits.” \\n\\n \\n\\n “Why don’t you?” asked the tailor bluntly. “You can afford it.” \\n\\n \\n\\n “I don’t believe in throwing away money,” answered Seth shortly. \\n\\n \\n\\n “You wouldn’t. This suit of Grant’s will wear like iron.” \\n\\n \\n\\n “It’s all foolish extravagance. Rodney, my 45grandson, offered to give him one of his old cast-off suits.” \\n\\n \\n\\n Mr. Shick smiled. \\n\\n \\n\\n “Probably Grant thought he would prefer a new one.” \\n\\n \\n\\n “But it’s wasteful extravagance.” \\n\\n \\n\\n “Mr. Tarbox, you need a new suit yourself. You’d better let me make you one. You don’t want your step-son to outshine you.” \\n\\n \\n\\n “I’ll see about it. I can make the old one do a little longer.” \\n\\n \\n\\n When Mr. Tarbox got home he at once tackled his wife. \\n\\n \\n\\n “Mrs. T.,” he said, “I’m surprised at your letting Grant order a twenty-dollar suit. Truly a fool and his money are soon parted, as the saying is.” \\n\\n \\n\\n “I don’t know what you mean, Mr. Tarbox, and I’ll thank you not to call me a fool,” she added, with a flash of spirit. \\n\\n \\n\\n “You mean to say you haven’t authorized Grant to order a twenty-dollar suit at Mr. Shick’s?” \\n\\n \\n\\n “Grant hasn’t asked me to buy him a suit?” \\n\\n \\n\\n 46“Well, he’s ordered one, for Mr. Shick told me so. It aint possible that he’s going to trust that boy. I don’t understand it.” \\n\\n \\n\\n “Nor do I. I will speak to Grant about it.” \\n\\n \\n\\n Mrs. Tarbox felt anxious, for the story seemed strange and almost incredible. It did not seem like Grant, but still she knew that he was very anxious to have a new suit. She would have been willing to advance ten dollars to buy him a ready-made one, but twenty dollars in her circumstances would be extravagant. \\n\\n \\n\\n Just then Grant entered the room. \\n\\n \\n\\n “Grant,” she said, “have you ordered a suit at Mr. Shick’s?” \\n\\n \\n\\n “Yes, mother.” \\n\\n \\n\\n “At twenty dollars?” \\n\\n \\n\\n “Yes, mother.” \\n\\n \\n\\n “How could you be so inconsiderate? Mr. Tarbox will not pay for it, and I cannot afford to pay so high a price.” \\n\\n \\n\\n “Don’t be worried, mother,” said Grant quietly, “I shall pay for it myself.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1644/48582.html","bookId":1227,"book":{"id":1227,"title":"Digging for Gold","description":"简介： His mother looked up from the table where she was cutting out pie crust, and asked in surprise, What do you mean, Grant? Why is to-day any different from ordinary days?...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1644","creation":"Aug 1, 2019 12:24:40 AM","modification":"Aug 1, 2019 12:24:40 AM"}}
