{"id":110364,"no":22,"title":"Page 22","content":"\\n\\n “She won’t stay away,” Patrick said. “Let her in. I want to know what the hell is going on, and she’s the only one who might be able to tell us.”\\n\\n “Don’t tell her we recovered anything,” Bryn said. She felt…good. It was such a bizarre fact of her unlife, that she could jump to her death from eight stories up and feel fine a couple of hours and a hot bath later. “Everything but that.”\\n\\n He nodded. “I’ll let you do the talking, since I’m still a little off.” Of course he was. She wasn’t the only casualty of the morning—just the only one who’d come back from it so quickly. “Go on, Liam. Let her in.”\\n\\n Liam didn’t seem pleased with the ruling, but he hit the control and activated the speaker to say, “Please drive to the front, Agent Block.”\\n\\n “Thank you,” she said, and got back in her car. Well. She was in a polite mood—that was something, at least.\\n\\n Liam turned the screen off and gathered up the coffee cups she and Patrick had been using. “I’ll bring a light lunch,” he said. “Enough for the three of you.”\\n\\n Joe wasn’t here; he’d stopped off to hand back the thumb drive, then headed home to see his family and get to the funeral home to cover for Bryn. Patrick shook his head. “Never mind lunch. Go watch Annie. I still don’t trust her to stay put, even sedated and restrained.”\\n\\n Liam looked disapproving, and before he left, he set out a tray of chilled finger-food sandwiches—cheese, cucumber, roast beef. “I’ll get the door and send Riley back here.”\\n\\n “All right, Mom,” Patrick said. Liam gave him a downright dour look.\\n\\n “I believe your friend is having a bad influence on you. Sir.”\\n\\n “Don’t sir me, Liam, or I’ll dock your pay.”\\n\\n “I write the checks, if you recall. Sir.”\\n\\n “Game, set, match.” Patrick’s moment of levity passed, and so did Liam’s. “Careful up there.”\\n\\n “Careful in here,” Liam said, and included Bryn in that as well; he’d taken her ruined clothing away without commenting on the blood or smoke and fire damage, but the looks he gave her were worried and reproachful. “Ring if you need me.”\\n\\n “I think I can handle Riley Block,” Patrick said.\\n\\n “One-handed, sir?”\\n\\n That evoked a smile—a thin one—that showed no lack of confidence. Liam nodded and disappeared from the doorway. He was back a moment later, ushered in Riley, and left again.\\n\\n Riley was, in fact, not in a polite mood, at least not by the time she arrived in the kitchen. She looked very official, Bryn thought; she was wearing a navy blue suit with a gray blouse that practically shouted FEDERAL AGENT. The only thing missing was the visible shiny badge. She stared at the two of them for a moment, then yanked a chair out from the table and sat down without an invitation. “Don’t even fucking try to tell me you weren’t there,” she said, leveling a finger at Bryn. “What the hell happened? I have seven dead bodies, Bryn! And we’re damn lucky there aren’t more. And I know good and well that this has something to do with Pharmadene.”\\n\\n “If it had been anybody else but me, you would have had eight bodies,” Bryn said. She shoved the plate of sandwiches toward her. “Lunch?”\\n\\n Riley’s glare was hot enough to toast the bread. “What. Happened?”\\n\\n “How do you know it’s related to Pharmadene?”\\n\\n “Because I was doing a little digging of my own when the word came in,” Riley said. “Graydon is a contractor doing janitorial work for the company. Your turn.”\\n\\n “I did just as Zaragosa asked. I put on a nice suit and went there to ask questions. When I got there, the place was locked up tight.”\\n\\n “And you what, broke in?”\\n\\n Bryn shrugged and ate a finger sandwich. The cucumber was delicious. “Well,” she said, chewing, “it was that or wait around for someone to show up. I kicked in a door. It wasn’t like I stormed the place with a machine gun.”\\n\\n “And then?”\\n\\n “And then I searched. I found seven bodies neatly wrapped up in plastic tarps, bound with duct tape. From the smell, they’d been dead for days.”\\n\\n “Where?”\\n\\n “Break room.”\\n\\n “Where, by some weird coincidence, the police found bullet holes around a grate that had fallen off?”\\n\\n “I’m getting to that.” Bryn laid it out, one step at a time…the search, the bomb, Joe Fideli’s bullet-related assistance in her escape. The jump. That made Riley flinch a little, imagining the subsequent fall and damage, which Bryn made sure to describe in detail. Through it all, Patrick sat in silence, studying Riley with unsettling intensity.\\n\\n When she finished, there was a short silence before Riley said, “So you came away from that with nothing.”\\n\\n No way in hell was she handing Riley the thumb drive. “Not only did I not find anything; I had to leave my briefcase behind when I spotted the bomb. So if you find any traces of that…”\\n\\n That earned her a shake of Riley’s head. “Not much chance,” she said. “The place was an inferno. The only reason we know how many dead there were is the floor collapsed in that room before the bodies were completely incinerated. We’ll be weeks figuring anything else out. Damn it.” Riley’s short fingernails drummed the tabletop, and she reached for a sandwich and bit into it, almost as if she didn’t realize she was taking up the offer of food. “We needed someone alive. Or at least some records to examine.”\\n\\n “The place had been sanitized. I’m no professional at that kind of thing, but the computers were missing and the file drawers emptied.”\\n\\n “No DVDs? Backups?”\\n\\n “Nothing like that,” Bryn said. It wasn’t quite a lie. She still didn’t know what, if anything, was on the thumb drive. “What exactly was Graydon into? I’m assuming someone doesn’t go black ops on a company that just cleans toilets, even if they clean them for Pharmadene.”\\n\\n “I asked Zaragosa that question. He tells me that on the books they look like a legitimate company.”\\n\\n “I didn’t even see a broom in the place, but I suppose theoretically they could have been storing all their cleaning supplies in a warehouse somewhere, and these were just the main offices. But there were a lot of file cabinets for a simple waste management company. And we keep coming back to the question: why wipe out seven people who do nothing but empty the trash?”\\n\\n “Access?” Riley said. “Pharmadene always had tight security, even before the invention of Returné.”\\n\\n This time, finally, Patrick entered the fray. “First, I used to be in charge of security at Pharmadene, and I wouldn’t have authorized the murder of seven people, whatever the situation. Also, those people died recently, not under the old administration, bad as it was. They were killed after the company went under FBI control. Even so, one thing’s certain. Whatever happened, odds are it had to do with Returné.” He spoke with authority. He’d left Pharmadene in the debacle that had led to the demise of Irene Harte and the old administration, and if anybody knew what the company had been involved with then, he did. For all their insidious dealings, Patrick had tried to keep the security department clean, or at least as clean as possible given the circumstances, until the circumstances had changed violently for the worse.\\n\\n Then, like any sensible person, he’d—what was the phrase?—left to pursue other opportunities.\\n\\n “Zaragosa already audited inventory records and accounted for every single vial of the drug still in existence. I just ordered random testing to be sure the vials hadn’t been tampered with or switched, but I don’t think these people were being used to smuggle it out. They wouldn’t have had access to the storage areas.”\\n\\n “Then they were doing something else, but as to what it was…?” Bryn shrugged and ate another sandwich. She had no idea how she could be this hungry after something so traumatic, but her stomach was cheerfully ignoring any PTSD. “I’ll be honest, this was damn thorough and paranoid work. The killers are ghosts, and so are your Graydon people. If you want my advice, just let it go. Maybe they were just what they appeared to be: janitors.”\\n\\n “Janitors don’t usually end up being killed and gift wrapped, but I take your point,” Riley said. “If you came away with nothing, we’re at a dead end.”\\n\\n “Good. Job’s over. Bryn is finished working for you,” Patrick said.\\n\\n Riley studied him for a long moment. There was doubt in those dark eyes, and calculation, and she finally inclined her head an unwilling inch. “Done for now,” she said. “Don’t think I won’t be looking into this further, and if I find out you’re holding anything back…”\\n\\n In a deadly quiet voice, Patrick said, “You should go now, Agent Block. Your welcome’s wearing thin.” He stood up, and even with one arm in a sling, he looked utterly dangerous. Riley got up, and she didn’t turn her back on him. He, on the other hand, walked past her, opened the kitchen door, and held it for her. “Go.”\\n\\n The FBI agent left without another word. After exchanging a silent look with her, Patrick followed her—seeing she left without any side trips, Bryn assumed. She sat back in her chair, feeling an indefinable sensation of loss; she’d originally liked Riley on some level, when Riley had been acting undercover at Fairview Mortuary. Being at odds with her now was just one more way she was cut off from the world of the normal people. Who can’t jump from an eight-story building, on fire, and eat sandwiches afterward.\\n\\n Well, in that particular case, at least, being a drug-addicted dead person was proving to be an advantage.\\n\\n Bryn ate another sandwich before Patrick returned, not so much out of hunger as a restless kind of boredom. He turned on the security camera array built into the far wall of the kitchen and watched Riley drive to the gates and leave before he poured a pint glass of beer and brought it to the table. \\n\\n","sourceLink":"https://allnovel.net/two-weeks-notice-revivalist-2/page-22.html","bookId":2539,"book":{"id":2539,"title":"Two Weeks\u0027 Notice (Revivalist #2)","description":"Storyline: Two Weeks\u0027 Notice (Revivalist #2) \\n After dying and being revived with the experimental drug Returne, Bryn Davis is theoretically free to live her unlife—with regular doses to keep her going. But Bryn knows that the government has every intention of keeping a tight lid on Pharmadene’s life-altering discovery, no matter the cost. Thankfully, some things have changed for the better; her job at the rechristened Davis Funeral Home is keeping her busy and her fragile romance with Patrick McCallister is blossoming—thanks in part to their combined efforts in forming a support group for Returne addicts. But when some of the group members suddenly disappear, Bryn wonders if the government is methodically removing a threat to their security, or if some unknown enemy has decided to run the zombies into the ground…\\n","cover":"https://allnovel.net/images/two-weeks-notice-revivalist-2.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/two-weeks-notice-revivalist-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:55:33 PM"}}
