{"id":110386,"no":45,"title":"Page 45","content":"\\n\\n Fear, Bryn thought. Reality. “Just do it.”\\n\\n Her sister left, taking Mr. French with her. Bryn cleared the used hypos and put them into the biohazard container near the trash can, then went upstairs herself to grab a few things. She didn’t bother with anything she could replace—just the necessary overnight accessories and a couple of changes of clothing. A zip-up pair of low boots that provided both comfort and traction. She looked around the room a little blindly, but everything else was just noise now, just distractions she couldn’t afford in this moment.\\n\\n She took the bag downstairs and put it in the trunk.\\n\\n Maxine had gone quiet behind the library door. Bryn checked her own skin; it still had a gray cast to it, but didn’t look quite so off as it had. “Max?” she said, and tapped on the wood. “Maxine?” She got a low growl in response. Taking Maxine out of here would be difficult at best, and being trapped in a car with an angry, suspicious Rottweiler didn’t seem like a very good plan. But the dogs didn’t deserve what was likely to come calling here. If she wouldn’t leave Mr. French, she couldn’t leave the other dogs, either.\\n\\n So she got the rest of them rounded up—the greyhounds, the pug, and the other Rottie, who was much less suspicious—and put them in the backseat of the car together. Annie came back with her bag, and Mr. French tagged at her heels; he sniffed at Bryn suspiciously, then barked and seemed comfortable enough to settle in near her again, though he didn’t beg for a petting.\\n\\n When Annie let her out, Maxine kept her distance, too, but she didn’t growl or attack. Still, there was something in the Rottweiler’s steady attention that kept Bryn on her guard. “Put her in a crate,” she said. There were travel crates, folding ones, stacked in the utility room off the kitchen, and Annie put one together and got Maxine inside; she and Bryn managed to fit the crate into the back of the car, barely. It was an uncomfortable fit with all the other dogs, even with the pug and Mr. French up front—one on Annie’s lap, one at her feet on the passenger side.\\n\\n But it wouldn’t be a long trip.\\n\\n Bryn headed for Pharmadene.\\n\\n “What happened to you?” Annie demanded as Bryn drove. Bryn didn’t reply; her attention was focused around them, looking for any signs that Jane might already have locked on to her location. She was hyperaware now of the danger, and the ticking clock. “Hey! Bryn, you’re scaring me! Where’s Patrick? And Liam? They went to meet you.…Are they okay? What happened?”\\n\\n Annie wasn’t going to shut up until she got some kind of answer, even a half-assed one, so Bryn finally said, “I met them. Everything’s fine. This is part of the plan. I can’t tell you the details right now.”\\n\\n “Oh,” Annie said, and sat back, crossing her arms. She got that thundercloud frown on her pretty face. “I see. So you don’t trust me. Still.”\\n\\n “Jesus, Annie, why does everything have to be about you?” For a wild, bitter moment, Bryn almost regretted making the trip to get her sister, but then she felt a surge of shame. “I’m sorry. I didn’t mean to snap at you, but—things are bad right now.”\\n\\n Annie’s frown faded, and she said, much more gently, “Is that why Patrick’s not here with you? Has something happened?”\\n\\n “No.” Yes. “Patrick’s fine. Everybody’s fine, we just…need to split up right now. For safety.” Because I might kill him if I hear him say Jane’s name again. “It’ll be okay. We’ll be safe here. The FBI will protect us.”\\n\\n “Okay.” Annie didn’t seem too convinced, but she contented herself with calming the excited, agitated pug wiggling around in her lap. Mr. French was maintaining a dignified sitting position at her feet, leaning on her leg. The greyhounds and free Rottweiler prowled restlessly in the back, as nervous as Bryn herself felt.\\n\\n She phoned Zaragosa when she made the turnoff for the Pharmadene front gates, and got his well-dressed assistant. “This is Bryn Davis,” she said. “I need to talk to your boss. Right now.”\\n\\n “I’m sorry. Mr. Zaragosa is in a meeting,” the assistant said. She could almost see his expression of total indifference. “I can have him return your call, but he has a full calendar—”\\n\\n “Tell Zaragosa that I am half a mile from the facility, and I’m coming in the front gate. It’s his choice how that happens. I’ve got my sister with me—”\\n\\n “Tell him about the dogs,” Annie whispered.\\n\\n Bryn ignored her. “—and we need admittance to the grounds and a pass to get inside. It’s important.”\\n\\n “I’m sorry, but I was told your employment with Pharmadene had ended. That means you’ll need to make an appointment to visit Mr. Zaragosa, and your sister needs to undergo all the usual background checks.…”\\n\\n “Jeremy. You’re not listening. Closed or open, I am coming in the gate. Make that happen so nobody has to get hurt in the process. And tell Zaragosa that people will probably be tracking me to your front door. Bad people who aren’t going to be nearly as concerned about the well-being of your people as I am. Understood?”\\n\\n “Hold,” he said, and she heard the soft, New Age music start playing. Bryn fought the urge to curse him, and didn’t let up on the gas as she took the curves heading up the hill to where the Pharmadene property began.\\n\\n “Bryn?” Annie said. The gates were in sight. Bryn didn’t slow. “Um, Bryn? Those are closed. And there’s a guard.”\\n\\n The hold music went off. “Mr. Zaragosa wants to speak with you, but you’re going to have to wait.”\\n\\n “Tell him I am one minute from crashing into his gate at seventy miles an hour. See if he can make a hole in his schedule for that.”\\n\\n This time, she got hold without music. Annie, who was sitting tensely now, arms protectively around the pug, said, “Bryn, slow down.”\\n\\n “I can’t,” she said. “We’re playing chicken, Annie. The first one who blinks loses, and we can’t be left out here. We’re dead if they don’t let us inside.”\\n\\n “But—”\\n\\n Mr. Zaragosa’s voice came on the line. “Bryn, you can’t just—”\\n\\n “Thirty seconds from the front gates,” she said. “It’s going to take at least ten seconds for them to roll back. Your choice, but you’ve got a max of fifteen seconds to get it done once I stop talking.”\\n\\n He wasted only one second in silence, then said, “Gate’s opening.”\\n\\n “Not yet, it isn’t.”\\n\\n “Jeremy’s calling the guard. Slow down, Bryn. I swear, we’re working on it.”\\n\\n “Work faster.” Instincts were trying to pull her foot off the gas, but she fought them and kept going. She needed to see the guard making the effort, or it would be for nothing.\\n\\n The guard ducked back into the shack and picked up the phone.\\n\\n They were less than fifteen seconds from hitting the gates. “Bryn!” Annie shouted, and Mr. French barked, responding to the alarm in her voice. The greyhounds and the loose Rottweiler were moving agitatedly in the backseat, worried by the tension thickening the air.\\n\\n I’m going to kill us all.\\n\\n The guard hit the controls, and the gates began to roll back. Bryn hit the brakes, slowing fast, but even; then the front right bumper of the car caught the metal and crumpled. The car scraped through, but only just, and then the guard reversed the course of the gates behind them to wheel them shut as Bryn brought the vehicle to a skidding stop.\\n\\n And then, of course, heavily armed guards surrounded the car as it came to a stop—a battalion of them, looked like. Bryn dropped the phone, killed the engine, and held up both hands. Annie looked frozen in place. “Pretend like you just got busted by the cops,” Bryn said. “Do exactly what they say. Don’t argue, don’t resist.”\\n\\n Annie tentatively raised her hands, too. The dogs were all barking excitedly, except for the pug, who was now cowering on the floor between Annie’s feet and next to Mr. French. He just looked like he wanted some peace and quiet.\\n\\n Bryn’s and Annie’s doors were pulled open at the same time, and Bryn popped her seat belt so the guard who reached in could pull her free without effort and send her facedown to the pavement. Annie hit the ground on the other side of the car. Mr. French bailed out and started trying to bite the guard holding Bryn, but he was kicked aside.\\n\\n “Run!” she screamed at Mr. French. He took a step back from her, looking confused. “Run, you stupid dog!”\\n\\n He wouldn’t have, Bryn thought, but then one of the guards tried to grab him, and that sent him fleeing.\\n\\n Chasing something was what the greyhounds did for a living, so they jumped out of the open car door and took off in graceful leaps after him, followed by the pug. The Rottweiler followed, leaving Maxine still in the cage. She was snarling and fighting to get out.\\n\\n The fleeing dogs ran for the parkland and woods beyond the building. Someone fired a shot, but it missed.\\n\\n “Don’t hurt them!” Bryn turned her head to yell. “You sons of bitches!”\\n\\n “No need for that,” said a voice from somewhere over her head, and she looked up to see the CEO of Pharmadene walking quickly toward them, trailed by his assistant, Jeremy, and a couple of others. “Nobody will hurt the dogs.” He looked at the guard who had her down on the ground. “Let her stand up.”\\n\\n The guard held to the letter of the order, but he slipped handcuffs on her just to be safe. Zaragosa didn’t object. He looked tired, Bryn thought, and careworn. Presiding over this place, keeping all these secrets, probably wasn’t a restful occupation.\\n\\n “Now,” he said. “You want to tell me what’s so critical you had to pull a stunt like that just to see me?”\\n\\n “Sir, we should get this car out of here. It wasn’t scanned properly,” a man at his side said—from his badge, he was some kind of high-level security officer by the name of Robinson. “Should I kill this dog?” \\n\\n","sourceLink":"https://allnovel.net/two-weeks-notice-revivalist-2/page-45.html","bookId":2539,"book":{"id":2539,"title":"Two Weeks\u0027 Notice (Revivalist #2)","description":"Storyline: Two Weeks\u0027 Notice (Revivalist #2) \\n After dying and being revived with the experimental drug Returne, Bryn Davis is theoretically free to live her unlife—with regular doses to keep her going. But Bryn knows that the government has every intention of keeping a tight lid on Pharmadene’s life-altering discovery, no matter the cost. Thankfully, some things have changed for the better; her job at the rechristened Davis Funeral Home is keeping her busy and her fragile romance with Patrick McCallister is blossoming—thanks in part to their combined efforts in forming a support group for Returne addicts. But when some of the group members suddenly disappear, Bryn wonders if the government is methodically removing a threat to their security, or if some unknown enemy has decided to run the zombies into the ground…\\n","cover":"https://allnovel.net/images/two-weeks-notice-revivalist-2.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/two-weeks-notice-revivalist-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:55:33 PM"}}
