{"id":110392,"no":51,"title":"Page 51","content":"\\n\\n “I couldn’t,” Patrick said. A muscle jumped in his jaw, and he tried to relax it. “Riley says you won’t be contagious, either of you, for about thirty days. It takes that long for the new generation being built inside you to mature.”\\n\\n “Riley lies. You should remember that.”\\n\\n “Sitting right here,” Riley murmured, but she didn’t dispute it.\\n\\n “I did remember,” he said. “Manny pulled files from the servers, and she’s telling the truth. We’ve got about thirty days to stop you and Riley from replicating. If we don’t make it, Manny says he can still safely remove the excess nanites to storage and start over.”\\n\\n Bryn realized she was crying—slow, inevitable tears of fury and failure. Her head was strapped down in place. She couldn’t even shake it. “You cannot take this risk. You have to turn us over. God, Patrick, we eat people and we can’t be stopped. Did Riley tell you that? Did she?”\\n\\n He didn’t say anything to that. None of them did until finally Joe said, “If it comes to burning you down, I won’t let him get in the way, Bryn. But it ain’t gonna come to that.”\\n\\n “Trust me,” McCallister said, and took her hand. “Please.”\\n\\n “You should have told me about Jane,” she said. The pain she was feeling inside was nothing the nanites could fix. “God, Patrick, why didn’t you tell me?”\\n\\n “I would have, but it’s not a pretty time of my life. I wanted—I wanted you to think better of me, just for a while. And I had no idea she was alive.” He shook his head. “Doesn’t matter. What matters is that I love you. And I’m not letting it end like this. We will stop this.”\\n\\n It’s too late, she thought. She could feel the nanites inside her, building their own future generations and destroying her life in the process. What if Jane was right? What if the nanites could infect regular, living people? What would stop them?\\n\\n You will, she told herself. And Riley. And Patrick. And Joe. And even Annie and Manny and Pansy. We will stop them.\\n\\n Patrick was holding her hand, and after the instinctive flinch of horror that she might somehow transfer her doom to him, she was grateful for that. For the warmth and the silent promises. She knew he hadn’t lied to her about Jane; he would have told her. And she knew he didn’t love Jane.\\n\\n We will stop this. We have to.\\n\\n She opened her eyes and met Patrick’s steady, warm gaze. She didn’t need to say what she was thinking. He knew. His fingers brushed the hair back from her forehead, and he pressed a gentle kiss there in a bloom of warmth. “We will,” he said.\\n\\n It was a promise she would have to trust. \\n\\n","sourceLink":"https://allnovel.net/two-weeks-notice-revivalist-2/page-51.html","bookId":2539,"book":{"id":2539,"title":"Two Weeks\u0027 Notice (Revivalist #2)","description":"Storyline: Two Weeks\u0027 Notice (Revivalist #2) \\n After dying and being revived with the experimental drug Returne, Bryn Davis is theoretically free to live her unlife—with regular doses to keep her going. But Bryn knows that the government has every intention of keeping a tight lid on Pharmadene’s life-altering discovery, no matter the cost. Thankfully, some things have changed for the better; her job at the rechristened Davis Funeral Home is keeping her busy and her fragile romance with Patrick McCallister is blossoming—thanks in part to their combined efforts in forming a support group for Returne addicts. But when some of the group members suddenly disappear, Bryn wonders if the government is methodically removing a threat to their security, or if some unknown enemy has decided to run the zombies into the ground…\\n","cover":"https://allnovel.net/images/two-weeks-notice-revivalist-2.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/two-weeks-notice-revivalist-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:55:33 PM"}}
