{"id":109870,"no":17,"title":"Page 17","content":"Chapter 27\\n\\n Bridging the Boredom\\n\\n Half past midnight. He stood at the top of the southwest tower of the Oakland Bay Bridge, some fifty stories above the gunmetal-cold bay, thinking, Jump or dive? He wore a black silk suit and he paused for a moment, regretting that the suit would be ruined. He liked the feel and flow of silk on his skin. Oh well.\\n\\n Two miles away Jody was walking up Market Street wishing that she could just get drunk and pass out. I wonder, she thought, if I found someone who was really drunk and drank his blood? No, this damn system of mine would probably identify alcohol as a poison and fight the effects. So many questions. If only I\u0027d remembered to ask them.\\n\\n She stopped at a phone booth and called Tommy at the store.\\n\\n \"Marina Safeway.\"\\n\\n \"Tommy, it\u0027s me.\"\\n\\n \"Are you still mad?\"\\n\\n \"Not mad enough, I guess. I just wanted to tell you to stay in the store until after daylight. Don\u0027t go outside for any reason. And stay around the other guys if you can.\"\\n\\n \"Why? What\u0027s the matter?\"\\n\\n \"Just do as I say, Tommy.\"\\n\\n \"I cleaned up the loft. Mostly, anyway.\"\\n\\n \"We\u0027ll talk about it tomorrow night. Stay at home until I wake up, okay?\"\\n\\n \"Are you still going to be pissed?\"\\n\\n \"Probably. I\u0027ll see you then. Good-bye.\" She hung up. How could he be so smart sometimes and so ignorant other times? Maybe the vampire was right, a human could never understand her. She suddenly felt very lonely.\\n\\n She ducked into an all-night diner and ordered a cup of coffee as rent on a booth. She still could enjoy the smell of coffee, even if she couldn\u0027t keep it down.\\n\\n She opened the paper she had bought from the bum with her cosmetics bag and began to read through the personals. \"Men Seeking Women,\" \"Women Seeking Men,\" \"Men Seeking Men,\" \"Women Seeking Women,\" \"Men Seeking Small Fuzzy Animals\"; there was a wide selection of categories. She scanned over the more mundane entries until her eye settled on one under \"Support Groups.\" \"Are You a Vampire? You don\u0027t have to face your problem alone. Blood Drinkers Anonymous can help. Mon.-Fri. Midnight. Rm. 212 Asian Cultural Center, Non-Smoking.\"\\n\\n It was Friday. It was midnight. She was only ten minutes from the Asian Cultural Center. Could it be this simple?\\n\\n The first thing she noticed when she walked into room 212 of the Asian Cultural Center is that all of the people sitting in a circle in molded plastic chairs, all twenty of them, were giving off heat signatures. They were all human.\\n\\n She was backing out of the door when a pear-shaped woman in a leotard and black cape intercepted her and took her hand.\\n\\n \"Welcome,\" said the woman. She sported a set of rather wicked-looking fangs that caused her to lisp. \"I\u0027m Tabitha. We\u0027re just getting ready to start. Come on in. There\u0027s coffee and cookies.\"\\n\\n She led Jody to an orange plastic chair and urged her to sit down. \"It\u0027s hard the first time, but everyone here has been where you are.\"\\n\\n \"Not bloody likely,\" Jody said, wiping a speck of Tabitha\u0027s spittle from her cheek.\\n\\n Tabitha pointed to a plastic medallion that hung from her neck by a heavy silver chain. \"See this chip? I\u0027ve been clean and bloodless for six months. If I can do it, so can you. One night at a time.\"\\n\\n Tabitha squeezed her arm, then threw her cape over her shoulder, turned dramatically, and stalked across the room to the cookie table, her cape billowing behind her.\\n\\n Jody looked at the other occupants of the room. All were talking, most were sneaking looks at her between sips of coffee. The men were all tall and thin with protruding Adam\u0027s apples and bad skin. Their dress ranged from business suits to jeans and flannel. They might have been a chess club out for the evening if not for the capes. To a man, they wore capes. Four of seven had fangs. Two sets of four were made of glow-in-the-dark plastic.\\n\\n Jody focused on two of them whispering in the corner. \"I told you, this is a babe-fest. Did you see the redhead?\" He sneaked a look.\\n\\n His partner said, \"I think I saw her at Compulsive Cleaners last week.\"\\n\\n \"Compulsive Cleaners, I was going to try that. How are the odds?\"\\n\\n \"Lots of gay guys, but a few babes. Mostly they smell like Pine Sol, but it\u0027s hot if you like latex gloves.\"\\n\\n \"Cool, I\u0027ll check it out. I think I\u0027m going to quit going to Adult Children of Alcoholics, everybody\u0027s looking to blame, no one\u0027s looking to get laid.\"\\n\\n Jody thought, I don\u0027t know if I want to hear quiet desperation this clearly. She changed her focus to the women in the room.\\n\\n A six-foot-two brunette woman in a black choir robe and Kabuki-like makeup was complaining to a washed-out blonde wearing a tattered wedding dress. \"They want to be tied up, I tie them up. They want to be spanked, I spank them. They want to be called names, I call them names. But try and drink a little of their blood, and they scream like babies. What about my needs?\"\\n\\n \"I know,\" said the blonde. \"I asked Robert to sleep in the coffin one time and he left.\"\\n\\n \"You have a coffin? I want a coffin.\"\\n\\n Christ, Jody thought, I\u0027ve got to get out of here.\\n\\n Tabitha clapped her hands. \"Let\u0027s get the meeting started!\"\\n\\n Those who were standing found seats. Several men tried to shove their way into the seats next to Jody. A skinny geek with peanut-butter breath leaned in to her and said, \"I was on \u0027Oprah\u0027 on Halloween. \u0027Men who drink blood and the women who find them disgusting. If you want, you can come by my place and watch the tape after the meeting.\"\\n\\n \"I\u0027m out of here,\" Jody said. She jumped up and headed for the door.\\n\\n Behind her she heard Tabitha saying, \"Hi, I\u0027m Tabitha and I\u0027m a bloodsucking fiend.\"\\n\\n \"Hi, Tabitha,\" the group said in chorus.\\n\\n Outside Jody looked up and down the street wondering which way to go, what to do. She paused by a phone booth, realizing that there was no one she could call. Tears welled in her eyes. Why even bother to hope? The only person who had the slightest idea how she felt was the vampire who had made her. And he had made it clear that he wasn\u0027t interested in helping her - the evil fucker.\\n\\n I should set him up with my mother, she thought, then the two of them can look down on humanity together. The thought made her smile.\\n\\n Then the phone rang. She looked at it for a second, looked around for someone else who would answer it, but except for a guy standing by his car a couple of blocks away, the street was empty.\\n\\n She picked up the phone. \"Hello.\"\\n\\n A man\u0027s voice said, \"I thought you would show up here eventually.\"\\n\\n \"Who is this?\" Jody asked. The man sounded young, his voice was unfamiliar.\\n\\n \"I can\u0027t tell you that yet.\"\\n\\n \"Okay,\" Jody said.\\n\\n \"Bye.\"\\n\\n \"Wait, wait, wait, don\u0027t hang up.\"\\n\\n \"Well?\"\\n\\n \"You\u0027re the one, aren\u0027t you? You\u0027re real. I mean, you are a real vampire.\"\\n\\n Jody held the phone away, stared at the receiver as if it were an alien object. \"Who is this?\"\\n\\n \"I don\u0027t want to tell you my name. I don\u0027t want you to be able to find me. Let\u0027s just say that I\u0027m a friend.\"\\n\\n \"That\u0027s how most of my friends are,\" Jody said. \"They don\u0027t tell me their names or how to find them. It keeps my social calendar pretty clear.\" Who was this guy? Who could possibly know that she was here, right now?\\n\\n \"Okay, I guess I owe you something. I\u0027m a med student at... at a local college. I did some research on one of the bodies... one of the bodies of the people you killed.\"\\n\\n \"I didn\u0027t kill anyone. I don\u0027t know what you\u0027re talking about. If I am who you think I am, how did you know I\u0027d be here? I didn\u0027t even know I would be here until an hour ago.\"\\n\\n \"I\u0027ve been waiting, watching every night for a couple of weeks. I had a theory that you wouldn\u0027t have any noticeable body heat, and you don\u0027t.\"\\n\\n \"What are you talking about? No one notices anybody\u0027s body heat.\"\\n\\n \"Look up the street. By the white Toyota. It\u0027s running, by the way. If you make a move to come toward me, I\u0027m gone.\"\\n\\n Jody looked more closely at the person up the street standing by a white car. The car was running. The man was holding a cell phone and looking at her through some very large binoculars.\\n\\n \"I see you,\" she said. \"What do you want?\"\\n\\n \"I\u0027m looking at you through infrared glasses. You\u0027re not giving off any body heat, so I know you\u0027re the one. My theory was right.\"\\n\\n \"Are you a cop?\"\\n\\n \"No, I told you, I\u0027m a medical student. I don\u0027t want to turn you in. In fact, I think I might be able to help you, if you\u0027re interested in being helped.\"\\n\\n \"Talk,\" Jody said. She held her hand over the phone and focused on the guy by the car. She could hear him talking into the cell phone.\\n\\n \"They gave one of the cadavers to our department after the coroner was done with it. It was a male, about sixty years old, the third victim, I think. I noticed that there was a clean spot on his neck, as if it had been washed. The coroner hadn\u0027t put that in his report. I took a tissue sample and put it under a microscope. The tissue in that area was living. Regenerating. I cultured it and it started to die, until I added something on a hunch.\"\\n\\n \"What?\" Jody asked. She didn\u0027t know what to think. This man knew she was a vampire, and strangely, she felt an urge to attack. Some protective instinct wanted her to hurt him. Kill him. She fought to stay calm.\\n\\n \"Hemoglobin. I added some human hemoglobin and the tissue started to regenerate again. I ran it through the sequencer. It\u0027s not human DNA. It\u0027s close, but not human. It doesn\u0027t produce heat, doesn\u0027t seem to burn fuel the same way that mammalian cells do. The coroner said that he was the one that had drained the blood from the body, but he\u0027d never done that before. And I knew that the guy had been murdered. I made a guess. I saw the ad in the Weekly for a vampire support group, so I\u0027ve been watching.\"\\n\\n Jody said, \"Suppose I believe what you\u0027re saying. Suppose I believe that you believe this bullshit, how could you help me? Supposing I wanted to be helped?\"\\n\\n \"My major is gene therapy. There\u0027s a chance I could reverse the process.\"\\n\\n \"This isn\u0027t science. I\u0027m not saying that you\u0027re right about your theory. There are a lot of things that you don\u0027t know, that can\u0027t be explained by science. If you don\u0027t know that by now, you will. What you\u0027re talking about is magic.\"\\n\\n \"Magic is just science that we don\u0027t know yet. Do you want me to help or not?\"\\n\\n \"Why would you want to do that? As far as you know, I kill people.\"\\n\\n \"So does cancer, but I still work on it. Do you have any idea what kind of competition there is for jobs in my field? It\u0027s an all-or-nothing field. I could end up getting my PhD and giving saccharine enemas to rats for five bucks an hour. What I learn from you would put my resume at the top of the stack.\"\\n\\n Jody didn\u0027t know what to say. Part of her wanted to drop the phone and go after him. Another part wanted to accept his help.\\n\\n She said, \"What do you want me to do?\"\\n\\n \"Nothing yet. How can I get hold of you?\"\\n\\n \"I can\u0027t tell you that. I\u0027ll call you. What\u0027s your number?\"\\n\\n \"I can\u0027t tell you that.\"\\n\\n Jody sighed. \"Look, Mr. Scientific Genius, figure out something. And by the way, I really didn\u0027t kill those people.\"\\n\\n \"Then why are you even listening to me?\"\\n\\n \"I guess this conversation is over. Get in your car and get comfortable with asking rats to bend over. Good-bye.\"\\n\\n \"Wait, we could meet somewhere. Tomorrow. Someplace public.\"\\n\\n \"No, it has to be at night. Someplace private. You could have cops everywhere.\" She watched him as she talked. He had put the binoculars down and she could see that he was Asian.\\n\\n \"You\u0027re the killer here. Would you meet you someplace private and dark?\"\\n\\n \"All right. Tomorrow night. Seven o\u0027clock, at Enrico\u0027s on Broadway. That public enough for you?\"\\n\\n \"Sure. Can I bring a blood-sample kit? Would you let me?\"\\n\\n \"Would you let me?\" she asked.\\n\\n He didn\u0027t answer.\\n\\n \"Just kidding,\" she said. \"Look, I don\u0027t want to hurt you, but I don\u0027t want to get hurt either. When you leave here, drive like hell and take an indirect route home.\"\\n\\n \"Why?\"\\n\\n \"Because I really didn\u0027t kill those people, but I know who did, and he\u0027s been following me. If he\u0027s seen you, you\u0027re in danger.\"\\n\\n The line was quiet for a minute, just the ghost voices of a cellular connection. Jody watched the Asian guy watching her.\\n\\n Finally he cleared his throat. \"How many of you are there?\"\\n\\n \"I don\u0027t know,\" she said.\\n\\n \"I know that all of the victims don\u0027t change. It couldn\u0027t work. The geometric progression would have the entire human race turned to vampires in a month.\" He sounded more confident now that he had brought the conversation back to science.\\n\\n \"I\u0027ll tell you what I know tomorrow. But don\u0027t expect much. I don\u0027t know much. Or I\u0027ll tell you now if you want to talk face to face, but I don\u0027t think it\u0027s a good idea to talk about this with you on a cell phone.\"\\n\\n \"Yeah, you\u0027re right. Not now, though. Not here. You understand, don\u0027t you?\"\\n\\n Jody nodded, exaggerating the gesture so he could see. \"The longer you stand there, the better chance you have of being seen by... by the other one. Tomorrow night, then. Seven o\u0027clock.\"\\n\\n \"Will you be wearing that dress?\"\\n\\n Jody smiled. \"Do you like it? It\u0027s new.\"\\n\\n \"It\u0027s great. I didn\u0027t think you would be a woman.\"\\n\\n \"Thanks. Go now.\"\\n\\n She watched him climb into the Toyota, the cell phone still in hand. \"Promise not to try and track me down?\"\\n\\n \"I know where you\u0027ll be tomorrow night, remember?\"\\n\\n \"Oh yeah. By the way, my name\u0027s Steve.\"\\n\\n \"Hi, Steve. I\u0027m Jody.\"\\n\\n \"\u0027Bye,\" he said. He disconnected. Jody hung up the phone and watched him drive away.\\n\\n She thought, Great, another one to worry about.\\n\\n It hadn\u0027t occurred to her that her condition might be reversible. But then, the med student didn\u0027t know about how the body had turned to dust. Science indeed.\\n\\n Jump or dive, he thought. The silk suit whipped about his legs in the chill wind. The tower\u0027s aircraft warning light flashed red across his face and he could see heat swirling off it, dissolving over the bay.\\n\\n His name was Elijah Ben Sapir. He stood five feet ten inches tall and he had been a vampire for eight hundred years. In human life he had been an alchemist and had spent his time mixing noxious chemicals and chanting arcane incantations trying to turn lead into gold and tap the secret of eternal life. He hadn\u0027t been a particularly good alchemist. He had never been able to pull off the gold transformation, although by a bizarre miscalculation of chemistry he did manage to invent Teflon some eight hundred years before DuPont would find a use for it. (It should be noted, though, that archaeologists recently uncovered a Viking rune stone in Greenland that mentions a Jew who entered the palace of Constantine the Magnificent in 1224 selling a line of nonstick hot pokers for the Emperor\u0027s torture chamber and was promptly given the bum\u0027s rush to the city gates. The accuracy of the story has been questioned, however, as it begins, \"I never believed that your letters were true until Gunner and I...\" and goes on to recount the sexual exploits of two Vikings and a harem of brown-skinned Byzantine babes.)\\n\\n Ben Sapir\u0027s search for eternal life had been somewhat more successful. Granted, it came with the side effects of drinking human blood and staying out of sunlight, but he had gotten used to that. It was the loneliness that he couldn\u0027t abide. Perhaps, after all these years, it would end. He was afraid to hope.\\n\\n It had been a hundred years since a fledgling had lasted this long. She had been a Yanomamo woman in the Amazon Basin and she had hunted the jungle for three months before she returned to her village and turned her sister. The sisters declared themselves gods and demanded sacrifices from the village. He found them by the river feeding on an old woman, and he took no pleasure in killing them. Perhaps the redhead, perhaps she would be the one.\\n\\n Dive, he decided. He leaped away from the tower, jackknifed into a dive, and plunged fifty stories to the black water. The challenge was to avoid changing to mist before hitting the water. That was too easy.\\n\\n The impact of the water ripped the clothes off his back; the stitching of his shoes exploded with the pressure. He surfaced, naked except for one sock that had strangely survived the impact, and began the long swim back to his yacht thinking, I shouldn\u0027t have saved her from the sunlight. I must be desperate for entertainment.\\n\\n Chapter 28\\n\\n Is That a Blackjack in Your Pocket?\\n\\n Tommy booted the Emperor out of the store at dawn. It had been a long night trying to keep the crazed ruler away from the Animals while throwing stock and trying to figure out the logistics of his meeting with Mara, all while under the influence of Dr. Drew\u0027s polio weed, which seemed to affect the part of the brain that motivates one to sit in the corner and drool while staring at one\u0027s hands. When the shift ended, he declined the Animal\u0027s invitation for beers and Frisbee in the parking lot, swiped a baguette from the bread-delivery man, and caught the bus home, intent on going straight to bed. He knew his plan was foiled when Frank, the biker/sculptor, met him outside their building holding a familiar-looking bronze turtle.\\n\\n \"Flood, check it out.\" Frank held up the turtle. \"It worked!\"\\n\\n \"What worked?\" Tommy asked.\\n\\n \"Thick electroplating process. Come on in, I\u0027ll show you.\" Frank turned and led Tommy through the roll-up door into the foundry.\\n\\n The foundry took up the entire bottom floor of the building, here was a huge furnace making a muffled rumbling sound. There were several large pits filled with sand, and plaster-of-Paris molds lay in them in various states of completion. In the back, near the only windows, stood wax figures of naked women, Indians, Buddhas, and birds, waiting to be cut up and placed in plaster of Paris.\\n\\n Frank said, \"We\u0027ve been doing a lot of statues for people\u0027s gardens. Buddhas are big with the koi-pond types. That\u0027s what we needed the turtles for. Monk already sold one of them to a woman in Pacific Heights for five hundred bucks. Sight unseen.\"\\n\\n \"My turtles?\" Tommy said. He looked more closely at the bronze turtle Frank was holding. \"Zelda!\"\\n\\n \"Can you believe it?\" Frank said. \"We did them both in less than eight hours. Lost-wax process would have taken days. I\u0027ll show you.\"\\n\\n He led Tommy to the other side of the shop where a short, portly man in leather and denim was working beside a tall Plexi-glas tank filled with a translucent green liquid.\\n\\n Frank said, \"Monk, this is our neighbor, Tom Flood. Flood, this is my partner Monk.\"\\n\\n Monk grunted, not looking up from a compressor that he seemed to be having trouble with. Tommy could see how he had gotten his name. He had a large bowl-shaped bald spot with a fringe of hair around it: the Benedictine version of Easy Rider, Friar Tuck on wheels.\\n\\n \"This,\" said Frank, gesturing toward the ten-foot tank, \"as far as we know, is the biggest electroplating tank on the West Coast.\"\\n\\n Tommy didn\u0027t know quite how to react. He was still stunned by seeing the bronze likeness of Zelda. \"That\u0027s just spiffy,\" he said finally.\\n\\n \"Yeah, dude. We can do anything we can find. No molds, no wax carvings. You just dunk and go. That\u0027s how we did your turtles.\"\\n\\n Tommy was beginning to get it. \"You mean that that is not a sculpture? You covered my turtles with brass?\"\\n\\n \"That\u0027s it. That liquid is supersaturated with dissolved metal. We sprayed the turtles with a thin metal-based paint that would conduct current. Then we attached a wire to them and dipped them in the tank. The current draws the metal out of the water and it fuses to the paint on the turtle. Leave it a long time and the coating gets thick enough to have structural integrity. Voila, a bronze garden turtle. I don\u0027t think anybody\u0027s ever done it before. We owe you, man.\"\\n\\n Monk grunted in gratitude.\\n\\n Tommy didn\u0027t know whether to be angry or depressed. \"You should have told me you were going to kill them.\"\\n\\n \"I thought you knew, man. Sorry. You can have this one, if you want.\" Frank presented the bronzed Zelda.\\n\\n Tommy shook his head and looked away. \"I don\u0027t think I could look at her.\" He turned and walked away.\\n\\n Frank said, \"C\u0027mon, man, take it. We owe you one. If you need a favor or something...\"\\n\\n Tommy took Zelda. How would he explain to Jody? \"By the way, I\u0027ve turned your little friends into statues.\" And this right after they\u0027d had a big fight. He slunk up the steps feeling completely lost.\\n\\n Jody had left him a note on the counter:\\n\\n Tommy:\\n\\n Imperative that you are here when I wake up. If you go out you are in serious, life-threatening trouble. I mean it. I have some very important things to tell you. No time now, I\u0027m going to go out any second. Be here when I wake up.\\n\\n Jody\\n\\n \"Great,\" Tommy said to Peary. \"Now what do I do about Mara? Who does Jody think she is, threatening me? What does she think she\u0027s going to do if I\u0027m not here? I can\u0027t be here. Why don\u0027t you keep her busy until I get home.\" Tommy patted the chest freezer and an idea came to him.\\n\\n \"You know, Peary, scientists have frozen vampire bats and thawed them completely unharmed. I mean, how would she know? How many times has she thought it was Tuesday when it was really Wednesday?\"\\n\\n Tommy went to the bedroom and looked in on Jody, who had made it to bed, but not in time to change out of her black dress.\\n\\n Wow, Tommy thought, she never dresses like that for me.\\n\\n She looked so peaceful. Sexy, but peaceful.\\n\\n She\u0027ll be angry if she finds out, but she\u0027s angry now. It won\u0027t really hurt her. I can just take her out tomorrow morning and put her under the electric blanket. By sundown she\u0027ll be thawed out and I\u0027ll have handled the Mara thing. I can tell Mara that I\u0027m involved. I can\u0027t start something new until this is finished. Maybe with the extra time, Jody will have chilled a little.\\n\\n He smiled to himself.\\n\\n He opened the lid of the freezer, then went into the bedroom to get Jody. He carried her into the kitchen and laid her in the freezer on top of Peary. As he tucked her into the fetal position he felt a twinge of jealousy. \"You guys behave now, okay?\" He tucked a few TV dinners around her nice and snug under her arms, then kissed her on the forehead and gently closed the lid.\\n\\n As he crawled into bed he thought, If she ever finds out about this, she\u0027s really going to be pissed.\\n\\n Tommy had been asleep three hours when the pounding started. He rolled out of bed, stumbled across the dark bedroom, and was blinded when he opened the door into the loft. He was just regaining his eyesight when he opened the fire door and Rivera said, \"Are you Thomas Flood, Junior?\"\\n\\n \"Yes,\" Tommy said, bracing himself against the doorjamb.\\n\\n \"I\u0027m Inspector Alphonse Rivera from the San Francisco Police Department.\" He held up a badge wallet. \"You\u0027re under arrest\" - Rivera pulled a warrant from his jacket pocket - \"for abandoning a vehicle on a public street.\"\\n\\n \"You\u0027re kidding,\" Tommy said.\\n\\n Cavuto stepped through the door and grabbed Tommy by the shoulder, whipping him around as the big cop pulled his handcuffs from his belt. \"You have the right to remain silent...\" Cavuto said.\\n\\n Two hours later Tommy had been processed, probed, and printed, and as Cavuto had expected, Tommy\u0027s fingerprints matched those on the copy of On the Road that they had found under the dead bum. It was enough for them to get a search warrant issued for the loft. Five minutes after they entered the loft a mobile crime lab was dispatched along with a forensics team and two coroners\u0027 trucks. As far as crime scenes went, the loft in SOMA was the mother lode.\\n\\n Cavuto and Rivera left the crime scene to the forensics team and returned to the station, where they took Tommy from a holding cell and put him in a pleasantly pink interrogation room furnished with a metal table and two chairs. There was a mirror on one wall and a tape recorder sat on the table. Tommy sat staring at the pink wall, remembering something about how pink was supposed to calm you down. It didn\u0027t seem to be working. His stomach was tied in knots.\\n\\n Rivera had done dozens of interrogations with Cavuto and they always took the same roles: Cavuto was the bad cop, and Rivera was the good cop. Actually Rivera never felt like the good cop. More often he was the I-am-tired-and-overworked-and-I\u0027m-being-nice-to-you-because-I-don\u0027t-have-the-energy-to-be-angry cop.\\n\\n \"Would you like a smoke?\" Rivera asked.\\n\\n \"Sure,\" Tommy said.\\n\\n Cavuto jumped in his face. \"Too bad, punk. There\u0027s no smoking in here.\" Cavuto took great pleasure in being the bad cop. He practiced in front of the mirror at home.\\n\\n Rivera shrugged. \"He\u0027s right. You can\u0027t smoke.\"\\n\\n Tommy said, \"That\u0027s okay, I don\u0027t smoke.\"\\n\\n \"How about a lawyer then?\" asked Rivera. \"Or a phone call?\"\\n\\n \"I have to be at work at midnight,\" Tommy said. \"If it looks like I\u0027m going to be late, I\u0027ll use my call then.\"\\n\\n Cavuto was pacing the room, timing his path so he could wheel on Tommy with every statement. He wheeled. \"Yeah, kid, you\u0027re going to be late, about thirty years late, if they don\u0027t fry you.\"\\n\\n Tommy pushed back in his chair with fright.\\n\\n \"Good one, Nick,\" Rivera said.\\n\\n \"Thanks.\" Cavuto smiled around an unlit cigar and backed away from the table where Tommy sat.\\n\\n Rivera moved up. \"Okay, kid, you don\u0027t want an attorney. Where do you want to start? We\u0027ve got you hands-down on two murders and probably three. If you tell us the story, tell us everything, about all the other murders, we might be able to waive the death penalty.\"\\n\\n \"I didn\u0027t kill anybody.\"\\n\\n \"Don\u0027t be cute,\" Cavuto said. \"We found two bodies in your freezer. We\u0027ve got your fingerprints all over a book that we found under a third body outside your apartment. We\u0027ve got you staying at the motel where we found a fourth body. And we\u0027ve got you with a closetful of women\u0027s clothing and eyewitnesses that put a woman near where we found a fifth body...\"\\n\\n Tommy interrupted, \"Actually, there\u0027s only one body in the freezer. The other is my girlfriend.\"\\n\\n \"You sick fuck.\" Cavuto drew back as if to hit Tommy. Rivera moved to restrain him. Tommy cowered in his chair.\\n\\n Rivera led Cavuto to the far side of the room. \"Let me take this for a minute.\" He left Cavuto grumbling to himself and went to the seat across from Tommy.\\n\\n \"Look, kid, we\u0027ve got you cold, so to speak, on two murders. We\u0027ve got circumstantial evidence on another. You are going to jail for a very long time, and at this point, the death penalty is looking pretty good. Now if you tell us everything, and don\u0027t leave anything out, we might be able to help you out, but you have to give us enough to close all the cases. Do you understand?\"\\n\\n Tommy nodded. \"But I didn\u0027t kill anybody. I put Jody in the freezer, which I admit is inconsiderate, but I didn\u0027t kill her.\"\\n\\n Cavuto growled. Rivera nodded in mock acceptance of the story. \"Fine, but if you didn\u0027t kill them, who did? Did someone you know force you into this?\"\\n\\n Cavuto exploded, \"Oh Christ, Rivera! What do you need, a videotape? This little bastard did it.\"\\n\\n \"Nick, please. Give me a minute here.\"\\n\\n Cavuto moved to the table and leaned over it until his face was next to Tommy\u0027s. He whispered, raspy and gruff, \"Flood, don\u0027t think you can use a wiggle and a wink to get yourself out of this. That might work down on Castro, but I\u0027m immune to it here, you got me? I\u0027m going to leave now, but when I come back, if you haven\u0027t told my partner your story, I\u0027m going to cause pain. Lots of it, and I won\u0027t leave a mark on you.\" He stood up, smiled, then turned and left the room.\\n\\n Tommy looked at Rivera. \"A wiggle and a wink?\"\\n\\n \"Nick thinks you\u0027re cute,\" Rivera said.\\n\\n \"He\u0027s gay?\"\\n\\n \"Completely.\"\\n\\n Tommy shook his head. \"I would have never guessed.\"\\n\\n \"He\u0027s a Shriner, too.\" Rivera tapped a cigarette out of his pack and lit it. \"Looks can be deceiving.\"\\n\\n \"Hey, I didn\u0027t think you were allowed to smoke in here.\"\\n\\n Rivera blew smoke in Tommy\u0027s face. \"You had two people in your freezer, and you\u0027re giving me shit about smoking.\"\\n\\n \"Good point.\"\\n\\n Rivera sat down and leaned back in the chair. \"Tommy, I\u0027m going to give you one more chance to tell me how you killed those people, then I\u0027m going to let Nick back in here and I\u0027m going to leave. He really likes you. This room is soundproof, you know.\"\\n\\n Tommy swallowed hard. \"You\u0027re not going to believe me. It\u0027s a pretty fantastic story. There\u0027s supernatural stuff involved.\"\\n\\n Rivera rubbed his temples. \"Satan told you to do it?\" he said wearily.\\n\\n \"No.\"\\n\\n \"Elvis?\"\\n\\n \"I told you, it\u0027s supernatural.\"\\n\\n \"Tommy, I\u0027m going to tell you something I\u0027ve never told anyone before. If you repeat it, I\u0027ll deny I said it. Five years ago I saw a white owl with a seventy-foot wingspan swoop out of the sky and pluck a demon off a hillside and take off into the sky.\"\\n\\n \"I heard that cops get the best drugs,\" Tommy said.\\n\\n Rivera got up. \"I\u0027m going to bring Nick in.\"\\n\\n \"No, wait. I\u0027ll tell you. It was a vampire. You can thaw Jody out and ask her.\"\\n\\n Rivera reached over and turned on the tape recorder. \"Now slow down. Start at the beginning and go until we walked you into this room.\"\\n\\n An hour later Rivera met Cavuto behind the one-way mirror. Cavuto was not happy. \"You know, I\u0027d rather you just threaten that I would beat him up.\"\\n\\n \"It worked, didn\u0027t it?\"\\n\\n \"There\u0027s nothing there we can use. Not a thing. If he sticks with that story he\u0027ll get off on insanity. It\u0027s too wild. I want to know how he got the blood out of the bodies.\"\\n\\n \"The kid thinks he\u0027s a writer. He\u0027s showing off his imagination. Let\u0027s let him sit awhile and get something to eat. I want to find the Emperor.\"\\n\\n \"That wacko?\"\\n\\n \"He\u0027s been reporting seeing a vampire for weeks. Maybe he saw the kid doing one of the murders.\"\\n\\n \\n\\n","sourceLink":"https://allnovel.net/bloodsucking-fiends-a-love-story-a-love-story-1/page-17.html","bookId":2047,"book":{"id":2047,"title":"Bloodsucking Fiends: A Love Story (A Love Story #1)","description":"Storyline: Here\u0027s something different: a vampire novel that\u0027s light, funny, and not at all hackneyed. Between scenes of punks bowling frozen turkeys on the graveyard shift in a supermarket, or snapping turtles loose in a loft and gnawing on designer shoes, this novel has comic charm to spare. But it also packs an appealingly downbeat message about the consumer culture: Becoming a vampire has given the twentysomething heroine \"a crampless case of rattlesnake PMS\"--a grumpy mood in which she realizes that she can dress to the nines as a \"Donner Party Barbie\" and still end up disillusioned and unhappy, just another slacker doing her own laundry and watching sucky TV \u0027til the sun rises.\\n","cover":"https://allnovel.net/images/bloodsucking-fiends-a-love-story-a-love-story-1.jpg","author":"Christopher Moore","type":"Humorous","source":"allnovel","link":"https://allnovel.net/bloodsucking-fiends-a-love-story-a-love-story-1.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:43:37 PM"}}
