{"id":89081,"no":24,"title":"Page 24","content":"I leaned down, pressing my lips against hers, soft and slow. The longer our mouths were melded together, the more overwhelmed I became by the reality of what was happening.\n Abby pulled me closer to her. Each movement she made was further affirmation of her answer. She felt the same. She cared about me. She wanted me. I wanted to run around the block screaming in celebration, and at the same time, didn’t want to move my mouth from hers.\n Her mouth opened, and I moved my tongue inside, tasting and searching softly.\n “I want you,” she said.\n Her words sunk in, and I understood what she meant. One part of me wanted to rip off every piece of fabric between us, the other set off full lights and sirens. We were finally on the same page. No need to rush it now.\n I pulled back a bit, but Abby only became more determined. I retreated all the way upright on my knees, but Abby stayed with me.\n I gripped her shoulders to hold her at bay. “Wait a sec,” I whispered, breathing hard. “You don’t have to do this, Pidge. This isn’t what tonight is about.”\n Even though I wanted to do the right thing, Abby’s unexpected intensity coupled with the fact that I hadn’t been laid in a length of time that was sure to be my all-time record, my dick was proudly standing against my boxers.\n Abby leaned in again, and this time I let her come close enough to touch her lips to mine. She looked up at me, serious and resolute. “Don’t make me beg,” she whispered against my mouth.\n No matter how noble I’d intended to be, those words coming from her mouth destroyed me. I grabbed the back of her head and sealed my lips against hers.\n Abby’s fingers ran down the length of my back and settled on the elastic of my boxers, before seeming to contemplate her next move. Six weeks of pent-up sexual tension overwhelmed me, and we crashed into the mattress. My fingers tangled in her hair as I positioned myself between her open knees. Just as our mouths met again, she slid her hand down the front of my boxers. When her soft fingers touched my bare skin, a low groan erupted. It was the best fucking feeling I could imagine.\n The old gray T-shirt Abby wore was the first thing to go. Thankfully the full moon lit the room just enough that I could appreciate her bare breasts for just a few seconds before I impatiently moved on to the rest of her. My hand gripped her panties, and then slipped them down her legs. I tasted her mouth as I followed the inside line of her leg, and traveled the length of her thigh. My fingers slipped between Abby’s soft, wet skin, and she let out a long, faltering breath. Before I went further, a conversation we’d had not too long before replayed in my mind. Abby was a virgin. If this was what she really wanted, I had to be gentle. The last thing I wanted to do was hurt her.\n Her knees arched and twitched with each movement of my hand. I licked and sucked different spots on her neck while I waited for her to make a decision. Her hips moved from side to side, and rocked back and forth, reminding me of the way she danced against me at the Red. Her bottom lip pulled in, and she bit it, digging her fingers into my back at the same time.\n I positioned myself above her. My boxers were still on, but I could feel her bare skin against me. She was so fucking warm, holding back was the hardest thing I’d ever made myself do. Not even an inch more and I could have pushed through my boxers and been inside her.\n “Pigeon,” I said, panting, “it doesn’t have to be tonight. I’ll wait until you’re ready.”\n Abby reached for the top drawer of the nightstand, pulling it open. Plastic crackled in her hand, and then she ripped the square package open with her teeth. That was a green light if I’d ever seen one.\n My hand left her back, and I pulled my boxers down, kicking them violently. Any patience I’d had was gone. The only thing I could think about was being inside of her. I slipped the latex on, and then lowered my hips between her thighs, touching the most sensitive parts of my skin to hers.\n “Look at me, Pigeon,” I breathed.\n Her big, round, gray eyes peered up at me. It was so surreal. This was what I had dreamed about since the first time she rolled her eyes at me, and it was finally happening. I tilted my head, and then leaned down to kiss her tenderly. I moved forward and tensed, pushing myself inside as gently as I could. When I pulled back, I looked into Abby’s eyes. Her knees held my hips like a vise grip, and she bit her bottom lip harder than before, but her fingers were pressing into my back, pulling me closer. When I rocked into her again, she clenched her eyes shut.\n I kissed her, softly, patiently. “Look at me,” I whispered.\n She hummed, and groaned, and cried out. With each noise she made, it became more difficult to control my movements. Abby’s body finally relaxed, allowing me to move against her in a more rhythmic motion. The faster I moved, the less in control I felt. I touched every part of her skin, and licked and kissed her neck, cheek, and lips.\n She pulled me into her over and over, and each time I pressed deeper inside.\n “I’ve wanted you for so long, Abby. You’re all I want,” I breathed against her mouth.\n I grabbed her thigh with one hand and propped myself up with my elbow. Our stomachs slid easily against each other as beads of sweat began to form on our skin. I thought about turning her over, or pulling her on top of me, but decided I’d rather sacrifice creativity for being able to look into her eyes, and staying as close to her as I could.\n Just when I thought I could make it last all night, Abby sighed.\n “Travis.”\n The sound of her breathing my name unguarded me and put me over the edge. I had to go faster, press farther until every muscle in my body tensed. I groaned and jerked a few times before finally collapsing.\n I breathed in through my nose against her neck. She smelled like sweat, and her lotion . . . and me. It was fucking fantastic.\n “That was some first kiss,” she said with a tired, contented expression.\n I scanned her face and smiled. “Your last first kiss.”\n Abby blinked, and then I fell onto the mattress beside her, reaching across her bare middle. Suddenly the morning was something to look forward to. It would be our first day together, and instead of packing in poorly concealed misery, we could sleep in, spend a ridiculous amount of the morning in bed, and then just enjoy the day as a couple. That sounded pretty damn close to heaven to me.\n Three months ago, no one could have convinced me that I would feel that way. Now, there was nothing else I wanted more.\n A big, relaxing breath moved my chest up and down slowly as I fell asleep next to the second woman I’d ever loved.\n CHAPTER SIXTEEN\n Space and Time\n AT FIRST, I DIDN’T PANIC. AT FIRST, A SLEEPY HAZE PROVIDED just enough confusion to foster a sense of calm. At first, when I reached for Abby across the sheets and didn’t feel her there, I felt just a small bit of disappointment, followed by curiosity.\n She was probably in the bathroom, or maybe eating cereal on the couch. She’d just given her virginity to me, someone with whom she’d spend a lot of time and effort pretending not to have more than platonic feelings. That was a lot to take in.\n “Pidge?” I called. I lifted only my head, hoping she would crawl back in bed with me. But after several moments, I gave in, and sat up.\n Having no idea what was in store, I slipped on the boxers I’d kicked off the night before, and slipped a T-shirt over my head.\n My feet dragged down the hall to the bathroom door, and I knocked. The door opened a bit. I heard no movement but I called for her, anyway. “Pigeon?”\n Opening the door wider revealed what was expected. Empty and dark. I then went into the living room, fully expecting to see her in the kitchen or on the couch, but she was nowhere.\n “Pigeon?” I called, waiting for an answer.\n Panic started to swell inside of me, but I refused to freak out until I knew what the hell was going on. I stomped into Shepley’s room and opened the door without knocking.\n America lay next to Shepley, tangled in his arms the way I imagined Abby would have been in mine at that point.\n “Have you guys seen Abby? I can’t find her.”\n Shepley raised himself up onto his elbow, rubbing his eye with his knuckle. “Huh?”\n “Abby,” I said, impatiently flipping on the light switch. Shepley and America both recoiled. “Have you seen her?”\n Different scenarios ran through my mind, all causing different degrees of alarm. Maybe she had let out Toto, and someone had taken her, or hurt her, or maybe she’d fallen down the stairs. But Toto’s claws were clicking against the floor down the hall, so that couldn’t be it. Maybe she went to get something out of America’s car.\n I rushed to the front door and looked around. Then I jogged down the stairs, my eyes searching every inch between the front door of the apartment and America’s car.\n Nothing. She’d vanished.\n Shepley appeared in the doorway, squinting and hugging himself from the cold.\n “Yeah. She woke us up early. She wanted to go home.”\n I took the stairs back up two at a time, grabbing Shepley’s bare shoulders, pushing him back all the way to the opposite side of the room, and grinding him into the wall. He gripped my T-shirt, a half-frowning, half-stunned expression on his face.\n “What the—” he began.\n “You took her home? To Morgan? In the middle of the fucking night? Why?”\n “Because she asked me to!”\n I shoved him against the wall again, blinding rage beginning to take over my system.\n America came out of the bedroom, her hair ratted and her mascara smeared below her eyes. She was in her robe, tightening the belt around her waist. “What the hell is going on?” she asked, pausing midstep at the sight of me.\n Shepley jerked out his arm and held out his hand. “Mare, stay back.”\n “Was she angry? Was she upset? Why did she leave?” I asked through my teeth.\n America took another step. “She just hates goodbyes, Travis! I wasn’t surprised at all that she wanted to leave before you woke up!”\n I held Shepley against the wall and looked to America. “Was she . . . was she crying?”\n I imagined Abby disgusted that she’d allowed some asshole like me, someone she didn’t give a shit about, taking her virginity, and then I thought maybe I’d somehow, accidentally hurt her.\n America’s face twisted from fear, to confusion, to anger. “Why,” she said. Her tone was more an accusation than a question. “Why would she be crying or upset, Travis?”\n “Mare,” Shepley warned.\n America took another step. “What did you do?”\n I released Shepley, but he took a fistful of my shirt as I faced his girlfriend.\n “Was she crying?” I demanded.\n America shook her head. “She was fine! She just wanted to go home! What did you do?” she yelled.\n “Did something happen?” Shepley asked.\n Without thinking, I flipped around and swung, nearly missing Shepley’s face.\n America screamed, covering her mouth with her hands. “Travis, stop!” she said through her hands.\n Shepley wrapped his arms around mine at the elbows, his face just a couple of inches from mine. “Call her!” he yelled. “Fucking calm down, and call Abby!”\n Quick, light footsteps ran down the hall and back. America returned, her hand outstretched, holding my phone. “Call her.”\n I snatched it from her hand and dialed Abby’s number. It rang until the voice mail picked up. I hung up and dialed again. And again. And again. She wasn’t answering. She hated me.\n I dropped the phone to the ground, my chest heaving. When tears burned my eyes, I picked up the first thing my hands touched, and launched it across the room. Whatever it was splintered into large pieces.\n Turning, I saw the stools situated directly across from each other, reminding me of our dinner. I picked one up by the legs and smashed it against the refrigerator until it broke. The refrigerator door popped open, and I kicked it. The force caused it to spring open again, so I kicked it again, and again, until Shepley finally rushed over to keep it closed.\n I stomped to my room. The messy sheets on the bed mocked me. My arms flung in every direction as I ripped them off the mattress—fitted sheet, top sheet, and blanket—and then returned to the kitchen to throw them in the trash, and then I did the same with the pillows. Still insane with anger, I stood in my room, willing myself to calm down, but there was nothing to calm down for. I’d lost everything.\n Pacing, I stopped in front of the nightstand. The thought of Abby reaching into the drawer came to mind. The hinges squeaked when I opened it, revealing the fishbowl full of condoms. I had barely delved into them since I’d met Abby. Now that she’d made her choice, I couldn’t imagine being with anyone else.\n The glass was cold in my hand as I picked it up and launched it across the room. It made contact with the wall beside the door and shattered, spraying small foil packages in every direction.\n My reflection in the mirror above my dresser looked back at me. My chin was down, and I stared into my eyes. My chest heaved, I was shaking, and by anyone’s standards looked insane, but control was so far out of my reach at that point. I reared back and slammed my fist into the mirror. Shards stabbed into my knuckles, leaving behind a bloody circle.\n “Travis, stop!” Shepley said from the hall. “Stop it, God dammit!”\n I rushed him, pushed him back, and then slammed my door shut. I pressed my hands flat against the wood, and then took a step back, kicking it until my foot made a dent at the bottom. I yanked on the sides until it came off the hinges, and then I tossed it across the room.\n Shepley’s arms grabbed me again. “I said stop!” he screamed. “You’re scaring America!” The vein in his forehead popped out, the one that appeared only when he was enraged.\n I shoved him, and he shoved me back. I took another swing, but he ducked.\n “I’ll go see her!” America pleaded. “I’ll find out if she’s okay, and I’ll have her call you!” \n","sourceLink":"https://allnovel.net/walking-disaster-beautiful-2/page-24.html","bookId":2787,"book":{"id":2787,"title":"Walking Disaster (Beautiful #2)","description":"Storyline: \n Walking Disaster (Beautiful #2) \n Finally, the highly anticipated follow-up to the New York Times bestseller Beautiful Disaster. \n Can you love someone too much? \n Travis Maddox learned two things from his mother before she died: Love hard. Fight harder. \n In Walking Disaster, the life of Travis is full of fast women, underground gambling, and violence. But just when he thinks he is invincible, Abby Abernathy brings him to his knees. \n Every story has two sides. In Beautiful Disaster, Abby had her say. Now it’s time to see the story through Travis’s eyes.\n \n","cover":"https://allnovel.net/images/walking-disaster-beautiful-2.jpg","author":"Jamie McGuire","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/walking-disaster-beautiful-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:32:02 PM"}}
