{"id":89085,"no":28,"title":"Page 28","content":"America put the car in reverse, and I watched Abby through the window. “You’re going to call me tomorrow, right?” I asked, touching the windshield. “Just go, Mare,” she said, looking straight ahead. When the brake lights were no longer visible, I retreated into the apartment. “Travis,” Shepley warned. “No messes, bro. I mean it.” I nodded, trudging to my room in defeat. It seemed that just when I was getting a handle on things, my fucking temper would rear its ugly head. I had to get it under control, or I was going to lose the best thing that ever happened to me. To pass the time, I cooked some pork chops and mashed potatoes, but just rolled it all around on my plate, unable to eat. Laundry helped to knock out an hour, and then I decided to give Toto a bath. We played for a while, but then even he gave up and curled up on the bed. Staring at the ceiling, obsessing about how stupid I’d been, wasn’t appealing, so I decided to pull all the dishes out of the cabinet and wash them by hand. Longest night of my life. The clouds began to turn colors, signaling the sun. I grabbed the bike keys and went for a drive, ending up in front of Morgan Hall. Harmony Handler was just leaving for a jog. She watched me for a moment, keeping her hand on the door. “Hey, Travis,” she said with her typical small smile. It quickly faded. “Wow. Are you sick or something? Do you need me to take you somewhere?” I must have looked like hell. Harmony had always been a sweetheart. Her brother was a Sig Tau, so I didn’t know her all that well. Little sisters were off-limits. “Hey, Harmony,” I said, trying a smile. “I wanted to surprise Abby with breakfast. Think you could let me in?” “Uh,” she trailed off, looking back through the glass door. “Nancy might freak. Are you sure you’re okay?” Nancy was Morgan Hall’s dorm mom. I’d heard of her, but never seen her, and doubted she would even notice. The word around campus was that she drank more than the residents and was seldom seen outside of her room. “Just a long night. C’mon.” I smiled. “You know she won’t care.” “Okay, but it wasn’t me.” I held my hand to my heart. “I promise.” I made my way upstairs, knocking softly on Abby’s door. The knob turned quickly, but the door opened slowly, gradually revealing Abby and America across the room. Kara’s hand slipped from the doorknob back under the covers of her bed. “Can I come in?” Abby sat up quickly. “Are you okay?” I walked in and fell to my knees before her. “I’m so sorry, Abby. I’m sorry,” I said, wrapping my arms around her middle and burying my head in her lap. Abby cradled my head in her arms. “I’m uh . . . ,” America stuttered, “I’m gonna go.” Abby’s roommate Kara stomped around the room, getting her shower supplies. “I’m always very clean when you’re around, Abby,” she said, slamming the door behind her. I looked up at Abby. “I know I get crazy when it comes to you, but God knows I’m tryin’, Pidge. I don’t wanna screw this up.” “Then don’t,” she said simply. “This is hard for me, ya know. I feel like any second you’re going to figure out what a piece of shit I am and leave me. When you were dancing last night, I saw a dozen different guys watching you. You go to the bar, and I see you thank that guy for your drink. Then that douche bag on the dance floor grabs you.” “You don’t see me throwing punches every time a girl talks to you. I can’t stay locked up in the apartment all the time. You’re going to have to get a handle on your temper.” “I will,” I said, nodding. “I’ve never wanted a girlfriend before, Pigeon. I’m not used to feeling this way about someone . . . about anyone. If you’ll be patient with me, I swear I’ll get it figured out.” “Let’s get something straight; you’re not a piece of shit, you’re amazing. It doesn’t matter who buys me drinks or who asks me to dance or who flirts with me. I’m going home with you. You’ve asked me to trust you, and you don’t seem to trust me.” I frowned. “That’s not true.” “If you think I’m going to leave you for the next guy that comes along, then you don’t have much faith in me.” I tightened my grip. “I’m not good enough for you, Pidge. That doesn’t mean I don’t trust you, I’m just bracing for the inevitable.” “Don’t say that. When we’re alone, you’re perfect. We’re perfect. But then you let everyone else ruin it. I don’t expect a 180, but you have to pick your battles. You can’t come out swinging every time someone looks at me.” I nodded, knowing she was right. “I’ll do anything you want. Just . . . tell me you love me.” I was fully aware of how ridiculous I sounded, but it just didn’t matter anymore. “You know I do.” “I need to hear you say it.” “I love you,” she said. She touched her lips to mine, and then pulled a few inches away. “Now quit being such a baby.” Once she kissed me, my heart slowed, and every muscle in my body relaxed. How much I needed her terrified me. I couldn’t imagine love was like this for everyone, or men would be walking around like lunatics the second they were old enough to notice girls. Maybe it was just me. Maybe it was just me and her. Maybe together we were this volatile entity that would either implode or meld together. Either way, it seemed the moment I met her, my life had been turned upside down. And I didn’t want it any other way. CHAPTER EIGHTEEN Lucky Thirteen HALF EXCITED, HALF NERVOUS AS HELL, I WALKED INTO my father’s home, my fingers intertwined with Abby’s. Smoke from my father’s cigar and my brothers’ cigarettes drifted from the game room, mixing with the faint, musky smell of carpet older than I was. Even though Abby was initially pissed that she didn’t have much notice before meeting my family, she looked more at ease than I felt. Bringing home a girlfriend was not a habit of the Maddox men, and any prediction of their reaction was unreliable at best. Trenton came into view first. “Holy Christ! It’s the asshat!” Any hope of my brothers even pretending not to be anything but feral was a waste of time. I loved them anyway, and knowing Abby, she would, too. “Hey, hey . . . watch the language around the young lady,” Dad said, nodding to Abby. “Pidge, this is my dad, Jim Maddox. Dad, this is Pigeon.” “Pigeon?” Jim asked, an amused expression on his face. “Abby,” she said, shaking his hand. I pointed to my brothers, all of them nodding when I said their name. “Trenton, Taylor, Tyler, and Thomas.” Abby seemed a bit overwhelmed. I couldn’t blame her; I’d never really talked about my family, and five boys would be mind-boggling to anybody. In fact, five Maddoxes were downright frightening to most. Growing up, the neighborhood kids learned early not to mess with one of us, and only once did someone make the mistake of taking on all of us. We were broken, but came together as a solid fortress if necessary. That was clear even to those we didn’t mean to intimidate. “Does Abby have a last name?” Dad asked. “Abernathy,” she said, nodding politely. “It’s nice to meet you, Abby,” Thomas said with a smile. Abby wouldn’t have noticed, but Thomas’s expression was a front for what he was really doing: analyzing her every word and movement. Thomas was always on the lookout for someone that could potentially rock our already rickety boat. Waves weren’t welcome, and Thomas had always made it his job to calm potential storms. Dad can’t take it, he used to say. None of us could argue with that logic. When one or a few of us found ourselves in trouble, we would go to Thomas, and he would take care of it before Dad could find out. Years of fostering a bunch of rowdy, violent boys made a man out of Thomas far earlier than anyone should be expected to be. We all respected him for it, including my father, but years of being our protector left him a little overbearing at times. But Abby stood, smiling and oblivious to the fact that she was now a target, under scrutiny by the family guardian. “Really nice,” Trenton said, his eyes roving over places that would have gotten anyone else killed. Dad slapped the back of Trenton’s head and he yelped. “What’d I say?” he said, rubbing the back of his head. “Have a seat, Abby. Watch us take Trav’s money,” Tyler said. I pulled out a chair for Abby, and she sat. I glared at Trenton, and he responded with only a wink. Smart-ass. “You knew Stu Unger?” Abby asked, pointing to a dusty photo. I couldn’t believe my ears. Dad’s eyes brightened. “You know who Stu Unger is?” Abby nodded. “My dad’s a fan, too.” Dad stood up, pointing to the dusty picture beside it. “And that’s Doyle Brunson, there.” Abby smiled. “My dad saw him play, once. He’s unbelievable.” “Trav’s granddaddy was a professional. We take poker very seriously around here.” Dad smiled. Not only had Abby never mentioned the fact that she knew anything about poker, it was also the first time I’d ever heard her speak of her dad. As we watched Trenton shuffle and deal, I tried to forget what had just happened. With her long legs, slight but perfectly proportioned curves, and big eyes, Abby was stunningly gorgeous, but knowing Stu Unger by name already made her a huge hit with my family. I sat up a little taller in my seat. No way would any of my brothers bring home anyone that could top that. Trenton raised an eyebrow. “You wanna play, Abby?” She shook her head. “I don’t think I should.” “You don’t know how?” Dad asked. I leaned over to kiss her forehead. “Play . . . I’ll teach you.” “You should just kiss your money goodbye, now, Abby.” Thomas laughed. Abby pressed her lips together and dug into her purse, pulling out two fifties. She held them out to Dad, waiting patiently while he traded them for chips. Trenton smiled, eager to take advantage of her confidence. “I have faith in Travis’s teaching skills,” Abby said. Taylor clapped. “Hells yeah! I’m going to get rich tonight!” “Let’s start small this time,” Dad said, throwing in a five-dollar chip. Trenton dealt, and I fanned out Abby’s hand. “Have you ever played?” “It’s been a while.” She nodded. “Go Fish doesn’t count, Pollyanna,” Trenton said, looking at his cards. “Shut your hole, Trent,” I growled, throwing him a quick threatening look before returning to Abby’s cards. “You’re shooting for higher cards, consecutive numbers, and if you’re really lucky, in the same suit.” We lost the first few rounds, but then Abby refused to let me help her. After that, she started to pick it up pretty quickly. Three hands later, she had kicked all of their asses without blinking. “Bullshit!” Trenton whined. “Beginner’s luck sucks!” “You’ve got a fast learner, Trav,” Dad said, moving his mouth around his cigar. I took a sip of my beer, feeling like the king of the world. “You’re makin’ me proud, Pigeon!” “Thanks.” “Those that cannot do, teach,” Thomas said, smirking. “Very funny, asshole,” I murmured. “Get the girl a beer,” Dad said, an amused smile lifting his already puffy cheeks. I gladly hopped up, pulled a bottle from the fridge, and used the already cracked edge of the countertop to pop off the cap. Abby smiled when I placed the beer in front of her and didn’t hesitate to take one of her signature man-size swigs. She wiped her lips with the back of her hand, and then waited on my dad to put in his chips. Four hands later, Abby had tipped back the last of her third beer and watched Taylor closely. “The action’s on you, Taylor. You gonna be a baby or you going to put in like a man?” It was getting very difficult for me to keep from being excited in other places. Watching Abby own my brothers—and a poker veteran like my father—hand after hand was turning me on. I’d never seen a women so sexy in my life, and this one happened to be my girlfriend. “Fuck it,” Taylor said, throwing the last of his chips in. “Whatdya got, Pigeon?” I asked with a grin. I felt like a kid at Christmas. “Taylor?” Abby prompted, her face completely blank. A wide grin spread across his face. “Flush!” He smiled, spreading his cards faceup on the table. We all looked to Abby. Her eyes scanned the men around the table, and then she slammed her cards down. “Read ’em and weep, boys! Aces and eights!” “A full house? What the fuck?” Trenton cried. “Sorry. I’ve always wanted to say that,” Abby said, giggling as she pulled in her chips. Thomas’s eyes narrowed. “This isn’t just beginner’s luck. She plays.” I watched Thomas for a moment. He wasn’t taking his eyes from Abby. I looked to her, then. “Have you played before, Pidge?” She pressed her lips together and shrugged, letting a sweet smile turn up the corners of her mouth. My head fell back, and I burst into laughter. I started to tell her how proud I was, but the words were held hostage by the uncontrollable cackling shaking my entire body. I hit the table with my fist a few times, trying to get a hold of myself. “Your girlfriend just fucking hustled us!” Taylor said, pointing in my direction.","sourceLink":"https://allnovel.net/walking-disaster-beautiful-2/page-28.html","bookId":2787,"book":{"id":2787,"title":"Walking Disaster (Beautiful #2)","description":"Storyline: Walking Disaster (Beautiful #2) Finally, the highly anticipated follow-up to the New York Times bestseller Beautiful Disaster. Can you love someone too much? Travis Maddox learned two things from his mother before she died: Love hard. Fight harder. In Walking Disaster, the life of Travis is full of fast women, underground gambling, and violence. But just when he thinks he is invincible, Abby Abernathy brings him to his knees. Every story has two sides. In Beautiful Disaster, Abby had her say. Now it’s time to see the story through Travis’s eyes.","cover":"https://allnovel.net/images/walking-disaster-beautiful-2.jpg","author":"Jamie McGuire","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/walking-disaster-beautiful-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:32:02 PM"}}
