{"id":63475,"no":23,"title":"Page 23","content":"\"How did you sleep?\" \"I missed you. Is that coffee I smell for me?\" \"If you\u0027re good.\" My eyes popped open. \"But you like me bad.\" His smile did crazy things to me. He\u0027d dressed already in one of his amazingly sexy suits and looked much better this morning than he had the night before. \"I like you bad with me. Tell me about this concert on Friday.\" \"It\u0027s a band called Six-Ninths. That\u0027s all I know. Wanna go?\" \"It\u0027s not a question of whether I want to go. If you\u0027re going, so am I.\" My brows rose. \"Is that right? And what if I hadn\u0027t asked you?\" He reached for my hand and gently twirled my promise ring around my finger. \"Then you wouldn\u0027t be going, either.\" \"Excuse me?\" I shoved my hair back. Noting the set look on his gorgeous face, I sat up. \"Gimme that coffee. I want to be caffeinated when I kick your ass.\" Gideon grinned and handed the mug over. \"Don\u0027t look at me like that,\" I warned. \"I\u0027m seriously not happy with you telling me I can\u0027t go somewhere.\" \"We\u0027re talking specifically about a rock concert and I didn\u0027t say you couldn\u0027t go, just that you can\u0027t go without me. I\u0027m sorry you don\u0027t like it, but it is what it is.\" \"Who says it\u0027s rock? Maybe it\u0027s classical. Or Celtic. Or pop.\" \"Six-Ninths signed with Vidal Records.\" \"Oh.\" Vidal Records was run by Gideon\u0027s stepfather, Christopher Vidal Sr., but Gideon had controlling interest. I wondered how a boy grew up to take over his stepfather\u0027s family business. I figured whatever the reason was, it was also why Gideon\u0027s half brother, Christopher Jr., hated him to the extreme. \"I\u0027ve seen videos of their indie shows,\" he said dryly. \"I\u0027m not risking you to a crowd like that.\" I sucked down a big gulp of coffee. \"I get it, but you can\u0027t order me around.\" \"Can\u0027t I? Shh.\" He placed his fingers over my lips. \"Don\u0027t argue. I\u0027m not a tyrant. I may occasionally have concerns, and you\u0027ll be sensible about acknowledging them.\" I shoved his hand away. \"\u0027Sensible\u0027 being whatever you\u0027ve decided is best?\" \"Of course.\" \"That\u0027s bullshit.\" He stood. \"We\u0027re not going to fight over a hypothetical situation. You asked me to go to the concert with you on Friday and I said yes. There\u0027s nothing to argue about.\" Setting my coffee on the nightstand, I kicked off the covers and slid out of bed. \"I have to be able to live my life, Gideon. I still have to be me or this won\u0027t work.\" \"And I have to be me. I\u0027m not the only one who needs to compromise.\" That hit me hard. He wasn\u0027t wrong - I had a right to expect him to give me my space, but he had a right to be understood as the man he was. I had to make accommodations for the fact that he had triggers, too. \"What if I want a girls\u0027 night out clubbing with my friends?\" He caught my jaw in both hands and kissed my forehead. \"You can take the limo and stick to clubs I own.\" \"So you can have your security people spy on me?\" \"Keep an eye on you,\" he corrected, his lips sliding over my brow. \"Is that so terrible, angel? Is it so unforgivable that I hate taking my eyes off you?\" \"Don\u0027t twist this around.\" He tilted my head back and looked down at me with hard, determined eyes. \"You need to understand that even if you take the limo and stick to my clubs, I\u0027m still going to go crazy until you get home. If that means you\u0027re driven a little crazy with my safety precautions, isn\u0027t that part of the give-and-take?\" I growled. \"How do you make something unreasonable sound reasonable?\" \"It\u0027s a gift.\" Grabbing his very fine, very taut ass in my hands, I squeezed. \"I need more coffee to deal with your gift, ace.\" It had become somewhat of a Wednesday tradition for Mark, his partner Steven, and me to go out to lunch. When Mark and I arrived at the little Italian restaurant he\u0027d chosen and found Shawna waiting with Steven, I was really touched. Mark and I had a very professional relationship, but somehow we\u0027d managed to make that personal and it meant a lot to me. \"I\u0027m so jealous of your tan,\" Shawna said, looking casual and cute in jeans, embellished tank top, and filmy scarf. \"The sun just makes me red and gives me more freckles.\" \"But you\u0027ve got that beautiful hair to show for it,\" I pointed out, admiring the deep red hue. Steven ran a hand through his hair, which was the exact same color as his sister\u0027s, and grinned. \"The things one sacrifices to be hot.\" \"How would you know?\" Shawna shoved at his shoulder with a laugh, an effort that didn\u0027t budge her brother even an inch. Where she was slender as a reed, Steven was big and strapping. I knew from talking to Mark that his partner was very hands-on with his construction business, which explained both his size and the rugged condition of his hands. We entered the restaurant and were seated right away, thanks to the reservation I\u0027d made when Mark had invited me to lunch. It was a small establishment, but it had great charm. Sunlight poured in through the floor- to-ceiling windows and the aroma of the food was so tantalizing it made my mouth water. \"I am so excited about Friday.\" Shawna\u0027s soft blue eyes were lit with anticipation. \"Yeah, she\u0027ll take you,\" Steven told me dryly, \"and not her big brother.\" \"Sooo not your scene,\" she shot back. \"You hate crowds.\" \"Just gotta establish some personal space, that\u0027s all.\" Shawna rolled her eyes. \"You can\u0027t be a bruiser everywhere.\" The talk about crowds had me thinking of Gideon and his protective streak. \"Mind if I bring the guy I\u0027m seeing?\" I asked. \"Or is that a buzzkill?\" \"Not at all. Does he have a friend who\u0027d like to come?\" \"Shawna.\" Mark was clearly shocked. And disapproving. \"What about Doug?\" \"What about him? You didn\u0027t let me finish.\" She looked at me and explained, \"Doug\u0027s my boyfriend. He\u0027s in Sicily for the summer taking a culinary course. He\u0027s a chef.\" \"Nice,\" I said. \"I dig guys who can cook.\" \"Oh, yeah.\" She grinned, then aimed a glare at Mark. \"He\u0027s a keeper and I know it, so if your guy has a friend who\u0027s fine with filling the empty seat with no possibility of a hookup, bring him along.\" I immediately thought of Cary and grinned. But later that day, after Gideon and I had spent quality time with our personal trainers and had returned to his apartment for the night, I changed my mind. I got up from the couch where I\u0027d been trying unsuccessfully to read a book and padded down the hall to his home office. I found him frowning at whatever he was working on, his fingers flying over the keyboard. The glow of the monitor and the spotlight aimed at the photo collage on the wall were the only sources of illumination in the room, which left much of the large space in shadow. He sat in the semidark, bare- chested and beautiful, alone and powerfully self-contained. As he always did while working, he looked solitary and unreachable. I felt lonely just looking at him. The combination of the physical distance caused by my period and Gideon\u0027s understandable decision to sleep separately stirred my deepest insecurities, made me want to cling tighter and try harder to keep his attention focused on me. That he was working instead of spending time with me shouldn\u0027t have rankled - I knew how busy he was - but it did. I felt abandoned and needy, which told me I was regressing into familiar bad patterns. The simple fact was, Gideon and I were the best and worst things that had ever happened to each other. He looked up and pinned me with his gaze. I watched his focus shift from work to me. \"Am I neglecting you, angel?\" he asked, leaning back in his chair. I flushed, wishing he couldn\u0027t read me so well. \"I\u0027m sorry to interrupt.\" \"You should always come to me when you need something.\" Pushing his keyboard drawer in, he patted the empty space on the desk in front of him and wheeled his chair back. \"Come sit.\" A thrill rushed through me. I hurried over, making no effort to hide my eagerness. I hopped onto the desk in front of him and smiled wide when he rolled his chair forward to fill the space between my legs. Draping his arms over my thighs, he hugged me around the hips and said, \"I should\u0027ve explained that I\u0027m trying to clear my schedule so we can take off this weekend.\" \"Really?\" I pushed my fingers through his hair. \"I want you all to myself for a while. And I really, really need to fuck you for a very long time. Maybe the whole time.\" His eyes closed as I touched him. \"I miss being inside you.\" \"You\u0027re always inside me,\" I whispered. His mouth curved in a slow, wicked smile and his eyes opened. \"You\u0027re making me hard.\" \"What\u0027s new?\" \"Everything.\" I frowned. \"We\u0027ll get to that,\" he said. \"For now, tell me what you came in here for.\" I hesitated, still stuck on his cryptic comment. \"Eva.\" His firm tone focused me.","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-23.html","bookId":1923,"book":{"id":1923,"title":"Reflected in You (Crossfire #2)","description":"Storyline: Reflected in You (Crossfire #2) Gideon Cross. As beautiful and flawless on the outside as he was damaged and tormented on the inside. He was a bright, scorching flame that singed me with the darkest of pleasures. I couldn\u0027t stay away. I didn\u0027t want to. He was my addiction... my every desire... mine. My past was as violent as his, and I was just as broken. We’d never work. It was too hard, too painful... except when it was perfect. Those moments when the driving hunger and desperate love were the most exquisite insanity. We were bound by our need. And our passion would take us beyond our limits to the sweetest, sharpest edge of obsession...","cover":"https://allnovel.net/images/reflected-in-you-crossfire-2.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reflected-in-you-crossfire-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:50:36 AM"}}
