{"id":63479,"no":27,"title":"Page 27","content":"I was so into him and the ferocity of his passion for me that I barely registered when Six-Ninths started. It wasn\u0027t until the vocals kicked in that I was jolted back to where I was. I stiffened, my mind clawing its way up through the fog of desire to process what I was hearing. I knew the song. My eyes opened as Gideon pulled back. Over his shoulder I saw handwritten signs held up in the air. BRETT KLINE IS MINE! And BANG ME, BRETT! And my personal favorite, BRETT, I\u0027D HIT IT WITH YOU LIKE THE WRATH OF GOD!!! Hell. What were the chances? And Cary had known, of course. He\u0027d known and hadn\u0027t warned me. Probably thought it\u0027d be hysterical for me to find out by accident instead. My legs loosened from around Gideon\u0027s hips and he set me down, protecting me from the frenzied fans with the shield of his body. I turned to face the stage, feeling a mad fluttering in my belly. Sure enough, it was Brett Kline at the mic, his deep, powerful, sexy-as-hell voice pouring over the thousands who\u0027d come to see him in action. His short hair was spiked and tipped with platinum, his lean body clothed in olive cargo pants and a black tank top. It was impossible to see from where I was, but I knew his eyes were a brilliant emerald green, his face was ruggedly handsome, and his killer smile revealed a dimple that drove women crazy. Tearing my eyes away from him, I looked at the other band members, recognizing all of them. They hadn\u0027t been called Six-Ninths back in San Diego, though. They\u0027d been called Captive Soul then, and I wondered what had led to the name change. \"Good, aren\u0027t they?\" Gideon asked with his mouth to my ear so I could hear him. He had one hand on the railing and the other around my waist, keeping me pulled up tight against him as he moved to the music. The combination of his body and Brett\u0027s voice did insane things to my already raging sex drive. I closed my eyes, focusing on the man behind me and the unique rush I\u0027d always felt while listening to Brett sing. The music throbbed through my veins, bringing back memories - some good and some bad. I swayed in Gideon\u0027s arms, desire pounding through me. I was achingly aware of his hunger. It poured off him like heat waves, sinking into me, making me crave him until the physical distance between us was painful. Grabbing the hand he had pressed flat against my stomach, I urged it downward. \"Eva.\" His voice was harsh with lust. I\u0027d been pushing him all night, from the moment I told him my period was over, to the hand job beneath the restaurant table, to the scorching kiss in the intermission. He gripped my bare thigh and squeezed. \"Open.\" I set my left foot on the bottom of the railing. My head fell back against his shoulder and a heartbeat later, his hand was under my skirt. His tongue traced the shell of my ear, his breathing hard and fast. I felt him groan as much as heard it when he discovered how wet I was. One song blended into another. Gideon rubbed me through the crotch of my boyshorts, moving in circles, then vertically through my cleft. My hips rolled into his touch, my core clenching, my ass grinding into the hard ridge of his erection. I was going to come right there, inches away from dozens of people, because that was what Gideon did to me. That was how insanely he turned me on. Nothing mattered when his hands were on me, his attention completely riveted to me. \"That\u0027s it, angel.\" His fingers pushed my underwear aside and two sank into me. \"I\u0027m going to fuck this gorgeous cunt for days.\" With bodies pressing in all around us, music pounding over us, and privacy granted only by distraction, Gideon slid his fingers deep into my soaked sex and stayed there. The solid, unmoving penetration drove me wild. I ground my hips into his hand, working toward the orgasm I needed so desperately. The song ended and the lights went out. Drenched in darkness, the crowd roared. Anticipation weighted the audience, building until the strum of guitar strings broke the heavy expectation. Shouts rang out, then lighters flickered to life, turning the sea of people into thousands of fireflies. A spotlight hit the stage, revealing Brett sitting on a bar stool, shirtless and glistening with sweat. His chest was hard and defined, his abs ridged with muscle. He lowered the height of the microphone stand and the piercings in his nipples glittered with his movements. The women in the audience screamed, including Shawna, who jumped in place and gave an earsplitting whistle. I totally got it. Sitting there as he was, with his feet propped on the rungs of the chair and his muscular arms covered in sleeves of black and gray tattoos, Brett looked insanely sexy and extremely fuckable. For six months nearly four years ago I\u0027d debased myself to get him naked every chance I could, so infatuated with him and desperate to be loved that I took whatever scraps he threw me. Gideon\u0027s fingers began to slide in and out of me. The bass kicked in. Brett began to sing a song I\u0027d never heard before, his voice low and soulful, the words crystal clear. He had the voice of a fallen angel. Mesmerizing. Seductive. And the face and body to enhance the temptation. Golden girl, there you are. I\u0027m singing for the crowd, the music\u0027s loud. I\u0027m living my dream, riding the high, But I see you there, sunlight in your hair, And I\u0027m ready to go, desperate to fly. Golden girl, there you are. Dancing for the crowd, the music\u0027s loud. I want you so bad. I can\u0027t look away. Later, you\u0027ll drop to your knees. You\u0027ll beg me please. And then you\u0027ll go, it\u0027s only your body I know. Golden girl, where\u0027d you go? You\u0027re not there, with sunlight in your hair. I could have you in the bar or the back of my car, But never your heart. I\u0027m falling apart. I\u0027ll drop to my knees, I\u0027ll beg you. Please. Please don\u0027t go. There\u0027s so much more I want to know. Eva, please. I\u0027m on my knees. Golden girl, where\u0027d you go? I\u0027m singing for the crowd, the music\u0027s loud. And you\u0027re not there, with sunlight in your hair. Eva, please. I\u0027m on my knees. The spotlight went dark. A long moment passed as the music faded. Then the lights came back on and the drums exploded with sound. The flames winked out and the crowd went crazy. But I was lost to the roaring in my ears, the tightness in my chest, and a confusion that had me reeling. \"That song,\" Gideon growled in my ear, his fingers fucking me forcefully, \"makes me think of you.\" His palm pressed into my clit and massaged, and I climaxed in a rush that took me by storm. Tears came to my eyes. I cried out, shaking in his arms. Gripping the railing in front of me, I held on and let the unstoppable pleasure pulse through me. When the show was over, all I could think about was getting to a phone and calling Cary. While we waited for the crowd to thin, I leaned heavily into Gideon, drawing support from the strength of his arms around me. \"You okay?\" he asked, running his hands up and down my back. \"I\u0027m fine,\" I lied. Honestly, I didn\u0027t know how I was feeling. It shouldn\u0027t matter that Brett wrote a song about me that painted a different light on our fuck-buddy history. I was in love with someone else. \"I want to go, too,\" he murmured. \"I\u0027m dying to get inside you, angel. I can barely think straight.\" I pushed my hands into the back pockets of his jeans. \"So let\u0027s get out of here.\" \"I\u0027ve got backstage access.\" He kissed the tip of my nose when I leaned back to look up at him. \"We don\u0027t have to tell them, if you\u0027d rather get out of here.\" I seriously debated it for a moment. After all, the night had been great as it was, thanks to Gideon. But I knew it\u0027d bother me later, if I denied Shawna and Arnoldo - who was also a Six-Ninths fan - something they\u0027d remember for the rest of their lives. And I\u0027d be lying if I didn\u0027t admit to myself that I wanted to catch a glimpse of Brett up close. I didn\u0027t want him to see me, but I wanted to see him. \"No. Let\u0027s take them back there.\" Gideon grabbed my hand and spoke to our friends, whose excitement over the news gave me the excuse to say I\u0027d done it solely for them. We headed down toward the stage, then off to the side of it, where Gideon spoke to the massive man acting as security. When the guy spoke into the mic of his headset, Gideon pulled out his cell and told Angus to bring the limo around to the back. While he spoke, his eyes met mine. The heat in them and the promise of pleasure took my breath away. \"Your man is the ultimate,\" Shawna said, eyeing Gideon with a look of near reverence. It wasn\u0027t a predatory look, just an appreciative one. \"I can\u0027t believe this night. I owe you big-time for this.\" She pulled me in for a quick, hard hug. \"Thank you.\" I hugged her back. \"Thank you for inviting me.\" A tall, rangy man with blue streaks in his hair and stylish black-framed glasses approached us. \"Mr. Cross,\" he greeted Gideon, extending his hand. \"I didn\u0027t know you\u0027d be coming tonight.\" Gideon shook the man\u0027s hand. \"I didn\u0027t tell you,\" he replied smoothly, reaching his other hand out to me. I caught it and he pulled me forward, introducing me to Robert Phillips, Six-Ninths\u0027 manager. Shawna and Arnoldo were introduced next; then we were led back through the wings, where activity was high and groupies loitered. I suddenly didn\u0027t want to catch even a glimpse of Brett.","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-27.html","bookId":1923,"book":{"id":1923,"title":"Reflected in You (Crossfire #2)","description":"Storyline: Reflected in You (Crossfire #2) Gideon Cross. As beautiful and flawless on the outside as he was damaged and tormented on the inside. He was a bright, scorching flame that singed me with the darkest of pleasures. I couldn\u0027t stay away. I didn\u0027t want to. He was my addiction... my every desire... mine. My past was as violent as his, and I was just as broken. We’d never work. It was too hard, too painful... except when it was perfect. Those moments when the driving hunger and desperate love were the most exquisite insanity. We were bound by our need. And our passion would take us beyond our limits to the sweetest, sharpest edge of obsession...","cover":"https://allnovel.net/images/reflected-in-you-crossfire-2.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reflected-in-you-crossfire-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:50:36 AM"}}
