{"id":63455,"no":3,"title":"Page 3","content":"A muscle in his jaw twitched.\n \"Your roommate fucks up and I have to spend the weekend without you.\"\n Hating that he was unhappy, I took his coffee from him and set our travel mugs in the backseat cup holders.\n Then I climbed into his lap, straddling him.\n I draped my arms around his shoulders.\n \"I appreciate you bending on this, Gideon.\n It means a lot to me.\"\n He caught me in his fierce blue gaze.\n \"I knew you were going to drive me insane the moment I saw you.\"\n I smiled, recalling how we\u0027d met.\n \"Sprawled on my ass on the lobby floor of the Crossfire Building?\" \"Before.\n Outside.\"\n Frowning, I asked, \"Outside where?\" \"On the sidewalk.\"\n Gideon gripped my hips, squeezing in that possessive, commanding way of his that made me ache for him.\n \"I was leaving for a meeting.\n A minute later and I would\u0027ve missed you.\n I\u0027d just gotten into the car when you came around the corner.\"\n I remembered the Bentley idling at the curb that day.\n I\u0027d been too awed by the building to take note of the sleek vehicle when I arrived, but I had noticed it when I left.\n \"You hit me the instant I saw you,\" he said gruffly.\n \"I couldn\u0027t look away.\n I wanted you immediately.\n Excessively.\n Almost violently.\"\n How could I not have known that there\u0027d been more to our first meeting than I\u0027d realized? I thought we\u0027d stumbled across each other by accident.\n But he\u0027d been leaving for the day .\n which meant he had deliberately backtracked inside.\n For me.\n \"You stopped right next to the Bentley,\" he went on, \"and your head tilted back.\n You were looking up at the building and I pictured you on your knees, looking up at me that same way.\"\n The low growl in Gideon\u0027s voice had me squirming in his lap.\n \"What way?\" I whispered, mesmerized by the fire in his eyes.\n \"With excitement.\n A little awe .\n a little intimidation.\"\n Cupping my rear, he urged me tighter against him.\n \"There was no way to stop myself from following you inside.\n And there you were, right where I\u0027d wanted you, damn near kneeling in front of me.\n In that minute, I had a half dozen fantasies about what I was going to do to you when I got you naked.\"\n I swallowed, remembering my similar reaction to him.\n \"Looking at you for the first time made me think about sex.\n Screaming, sheet-clawing sex.\"\n \"I saw that.\"\n His hands slid up either side of my spine.\n \"And I knew you saw me, too.\n Saw what I am .\n what I have inside me.\n You saw right through me.\"\n And that was what had knocked me on my ass - literally.\n I\u0027d looked into his eyes and realized how tightly reined he was, what a shadowed soul he had.\n I had seen power and hunger and control and demand.\n Somewhere inside me, I\u0027d known he would take me over.\n It was a relief to know he\u0027d felt the same upheaval over me.\n Gideon\u0027s hands hugged my shoulder blades and pulled me closer, until our foreheads touched.\n \"No one\u0027s ever seen before, Eva.\n You\u0027re the only one.\"\n My throat tightened painfully.\n In so many ways, Gideon was a hard man, yet he could be so sweet to me.\n Almost childishly so, which I loved because it was pure and uncontrolled.\n If no one else bothered to look beyond his striking face and impressive bank account, they didn\u0027t deserve to know him.\n \"I had no idea.\n You were so .\n cool.\n I didn\u0027t seem to affect you at all.\"\n \"Cool?\" he scoffed.\n \"I was on fire for you.\n I\u0027ve been fucked up ever since.\"\n \"Gee.\n Thanks.\"\n \"You made me need you,\" he rasped.\n \"Now I can\u0027t stand the thought of two days without you.\"\n Holding his jaw in my hands, I kissed him tenderly, my lips coaxing and apologetic.\n \"I love you, too,\" I whispered against his beautiful mouth.\n \"I can\u0027t stand being away from you, either.\"\n His returning kiss was greedy, devouring, and yet the way he held me close to him was gentle and reverent.\n As if I were precious.\n When he pulled back, we were both breathing hard.\n \"I\u0027m not even your type,\" I teased, trying to lighten the mood before we went into work.\n Gideon\u0027s preference for brunettes was well known and well documented.\n I felt the Bentley pull over and to a halt.\n Angus got out of the car to give us privacy, leaving the engine and air- conditioning running.\n I looked out the window and saw the Crossfire beside us.\n \"About the type thing - \" Gideon\u0027s head fell back to rest against the seat.\n He took a deep breath.\n \"Corinne was surprised by you.\n You weren\u0027t what she\u0027d expected.\"\n My jaw tightened at the mention of Gideon\u0027s former fiancee.\n Even knowing that their relationship had been about friendship and loneliness for him, not love, didn\u0027t stop the claws of envy from digging into me.\n Jealousy was one of my virulent flaws.\n \"Because I\u0027m blond?\" \"Because .\n you don\u0027t look like her.\"\n My breath caught.\n I hadn\u0027t considered that Corinne had set the standard for him.\n Even Magdalene Perez - one of Gideon\u0027s friends who wished she were more - had said she\u0027d kept her dark hair long to emulate Corinne.\n But I hadn\u0027t grasped the complexity of that observation.\n My God .\n if it was true, Corinne had tremendous power over Gideon, way more than I could bear.\n My heart rate quickened and my stomach churned.\n I hated her irrationally.\n Hated that she\u0027d had even a piece of him.\n Hated every woman who\u0027d known his touch .\n his lust .\n his amazing body.\n I started sliding off him.\n \"Eva.\"\n He stayed me by tightening his grip on my thighs.\n \"I don\u0027t know if she\u0027s right.\"\n I looked down at where he held me, and the sight of my promise ring on the finger of his right hand - my brand of ownership - calmed me.\n So did the look of confusion on his face when I met his gaze.\n \"You don\u0027t?\" \"If that\u0027s what it was, it wasn\u0027t conscious.\n I wasn\u0027t looking for her in other women.\n I didn\u0027t know I was looking for anything until I saw you.\"\n My hands slid down his lapels as relief filled me.\n Maybe he hadn\u0027t been consciously looking for her, but even if he had, I couldn\u0027t be more different from Corinne in appearance and temperament.\n I was unique to him; a woman apart from his others in every way.\n I wished that could be enough to kill my jealousy.\n \"Maybe it wasn\u0027t a preference so much as a pattern.\"\n I smoothed his frown line with a fingertip.\n \"You should ask Dr.\n Petersen when we see him tonight.\n I wish I had more answers after all my years of therapy, but I don\u0027t.\n There\u0027s a lot that\u0027s inexplicable between us, isn\u0027t there? I still have no idea what you see in me that\u0027s hooked you.\"\n \"It\u0027s what you see in me, angel,\" he said quietly, his features softening.\n \"That you can know what I have in me and still want me as much as I want you.\n I go to sleep every night afraid I\u0027ll wake up and you\u0027ll be gone.\n Or that I scared you away .\n that I dreamed you - \"\"No.\n Gideon.\"\n Jesus.\n He broke my heart every day.\n Shattered me.\n \"I know I don\u0027t tell you how I feel about you in the same way you tell me, but you have me.\n You know that.\"\n \"Yes, I know you love me, Gideon.\"\n Insanely.\n Outrageously.\n Obsessively.\n Just like my feelings for him.\"I\u0027m caught up with you, Eva.\"\n With his head tilted back, Gideon pulled me down for the sweetest of kisses, his firm lips moving gently beneath mine.\n \"I\u0027d kill for you,\" he whispered, \"give up everything I own for you .\n but I won\u0027t give you up.\n Two days is my limit.\n Don\u0027t ask for more than that; I can\u0027t give it to you.\"\n I didn\u0027t take his words lightly.\n His wealth insulated him, gave him the power and control that had been stolen from him at some point in his life.\n He\u0027d suffered brutality and violation, just as I had.\n That he would consider it worthwhile to lose his peace of mind just to keep me meant more than the words I love you.\n \"I just need the two days, ace, and I\u0027ll make them worth your while.\"\n The starkness of his gaze bled away, replaced by sexual heat.\n \"Oh? Planning on pacifying me with sex, angel?\" \"Yes,\" I admitted shamelessly.\n \"Lots of it.\n After all, the tactic seems to work well for you.\"\n His mouth curved, but his gaze had a sharpness that quickened my breath.\n The dark look he gave me reminded me - as if I could forget - that Gideon wasn\u0027t a man who could be managed or tamed.\n \"Ah, Eva,\" he purred, sprawled against the seat with the predatory insouciance of a sleek panther who\u0027d neatly trapped a mouse in his den.\n A delicious shiver moved through me.\n When it came to Gideon, I was more than willing to be devoured.\n Chapter 2\n Just before I exited the elevator into the vestibule of Waters Field \u0026 Leaman, the advertising firm I worked for on the twentieth floor, Gideon whispered in my ear, \"Think about me all day.\"\n I squeezed his hand surreptitiously in the crowded car.\n \"Always do.\"\n He continued the ride up to the top floor, which housed the headquarters of Cross Industries.\n The Crossfire was his, one of many properties he owned throughout the city, including the apartment complex I lived in.\n I tried not to pay attention to that. \n","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-3.html","bookId":1923,"book":{"id":1923,"title":"Reflected in You (Crossfire #2)","description":"Storyline: \n Reflected in You (Crossfire #2) \n Gideon Cross. As beautiful and flawless on the outside as he was damaged and tormented on the inside. He was a bright, scorching flame that singed me with the darkest of pleasures. I couldn\u0027t stay away. I didn\u0027t want to. He was my addiction... my every desire... mine. \n My past was as violent as his, and I was just as broken. We’d never work. It was too hard, too painful... except when it was perfect. Those moments when the driving hunger and desperate love were the most exquisite insanity. \n We were bound by our need. And our passion would take us beyond our limits to the sweetest, sharpest edge of obsession...\n \n","cover":"https://allnovel.net/images/reflected-in-you-crossfire-2.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reflected-in-you-crossfire-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:50:36 AM"}}
