{"id":63502,"no":50,"title":"Page 50","content":"\"My bad. I\u0027m going through a tough breakup.\" I tried to shrug it off. \"It\u0027s hard for me to get excited about anything right now, even things I\u0027m crazy about. This job being one of them.\" \"I\u0027m sorry about the breakup,\" he said, his dark eyes warm with sympathy. \"Yeah. Me, too.\" Cary was looking and feeling better by Saturday. His ribs were still bandaged and his arm was going to be in a cast for a while, but he was walking around on his own and didn\u0027t need the nurse anymore. My mom brought a beauty team over to our apartment - six women in white lab coats who took over my living room. Cary was in heaven. He had no qualms whatsoever about enjoying spa day. My mom looked tired, which wasn\u0027t like her at all. I knew she was worried about Stanton. And she was maybe spending time thinking about my dad, too. It seemed impossible to me that she wouldn\u0027t, after seeing him for the first time in nearly twenty-five years. His longing for her had been hot and alive to me; I couldn\u0027t imagine what it must have felt like to her. As for me, it was just great to be around two people who loved me and knew me well enough not to bring up Gideon or give me a hard time for being a bummer to hang around with. My mom brought me a box of my favorite Knipschildt truffles, which I savored slowly. It was the one indulgence she never scolded me about. Even she agreed that a woman had a right to chocolate. \"What are you going to have done?\" Cary asked me, looking at me with a bunch of black goop smeared all over his face. He was getting his hair trimmed in its usual sexily floppy style, and his toenails were being trimmed and filed into perfect rounded squares. I licked the chocolate off my fingers and considered my answer. The last time we\u0027d had a spa date, I\u0027d just agreed to have an affair with Gideon. He and I were going on our first date, and I knew we\u0027d be having sex. I\u0027d chosen a package designed for seduction, making my skin soft and fragrant with scents purported to have aphrodisiac properties. Everything was different now. In a way, I had a second chance to do things over. The investigation into Nathan\u0027s death was a concern for us all, but the fact that he was gone from my life forever liberated me in a way I hadn\u0027t realized I\u0027d needed. Somewhere in the back of my mind, the fear must have been lurking there. It was always a possibility that I could see him again as long as he was alive. Now I was free. I also had a new chance to embrace my New York life in a way I hadn\u0027t before. I was accountable to no one. I could go anywhere with anyone. I could be anyone. Who was the Eva Tramell who lived in Manhattan and had her dream job at an advertising agency? I didn\u0027t know yet. Up until now, I\u0027d been the San Diego transplant who got swept into the orbit of an enigmatic and incredibly powerful man. That Eva was on Day Eight After Gideon: Round Two curled in a corner licking her wounds and would be for a long time. Maybe forever, because I couldn\u0027t imagine that I\u0027d ever fall in love again like I had with Gideon. For better or worse, he was my soul mate. The other half of me. In many ways, he was my reflection. \"Eva?\" Cary prodded, studying me. \"I want everything done,\" I said decisively. \"I want a new haircut. Something short and flirty and chic. I want my nails painted fire engine red - fingers and toes. I want to be a new Eva.\" Cary\u0027s brows rose. \"Nails, yes. Hair, maybe. You shouldn\u0027t make sweeping decisions when you\u0027re fucked up over a guy. They come back to haunt you.\" My chin lifted. \"I\u0027m doing it, Cary Taylor. You can either help or just shut up and watch.\" \"Eva!\" My mother practically squealed. \"You\u0027re going to look amazing! I know just the thing to do with your hair. You\u0027ll love it!\" Cary\u0027s lips twitched. \"All righty, then, baby girl. Let\u0027s see what New Eva looks like.\" New Eva turned out to be a modern, slightly edgy sexpot. My once long, straight blond hair was now shoulder length and cut in long layers, with platinum highlights sprinkled throughout and framing my face. I\u0027d had my makeup done, too, to see what sort of look I should pair with my new hairdo, and I learned that smoky gray for my eyes was the way to go, along with soft pink lip gloss. In the end, I hadn\u0027t gone with red for my nails and chose chocolate instead. I really liked it. For now, anyway. I was willing to admit I might be going through a phase. \"Okay, I take it back,\" Cary said, whistling. \"Clearly you wear breakups well.\" \"See?\" my mother crowed, grinning. \"I told you! Now you look like an urban sophisticate.\" \"Is that what you call it?\" I studied my reflection, amazed at the transformation. I appeared a bit older. Definitely more polished. Certainly sexier. It boosted my spirits to see someone else looking back at me besides the hollow-eyed young woman I\u0027d been seeing for nearly two weeks now. Somehow, my thinner face and sad eyes paired well with the bolder style. My mom insisted we go out for dinner since we all looked so good. She called Stanton and told him to get ready for a night out, and I could tell from her end of the conversation that she was delighting him with her girlish excitement. She left it to him to pick the place and make the arrangements, then continued with my makeover by picking a little black dress out of my closet. As I slipped it on, she held up one of my ivory cocktail dresses. \"Go for it,\" I told her, finding it amusing and pretty amazing that my mother could pull off wearing the clothes of someone nearly twenty years younger. When we were set, she went to Cary\u0027s room and helped him get ready. I watched from the doorway as my mother fussed over him, talking the whole time in that way she had that didn\u0027t require reciprocal conversation. Cary stood there with a sweet smile on his face, his eyes following her around the room with something like joy. Her hands brushed over his broad shoulders, smoothing the pressed linen of his dress shirt, and then she expertly knotted his tie and stepped back to take in her handiwork. The sleeve on his casted arm was unbuttoned and rolled up, and his face still had yellow and purple bruising, but nothing could detract from the overall effect of Cary Taylor dressed for a casually elegant night out. My mother\u0027s smile lit up the room. \"Stunning, Cary. Simply stunning.\" \"Thank you.\" Stepping forward, she kissed him on the cheek. \"Almost as beautiful on the outside as you are on the inside.\" I watched him blink and look at me, his green eyes filled with confusion. I leaned into the doorjamb and said, \"Some of us can see right through you, Cary Taylor. Those gorgeous looks don\u0027t fool us. We know you\u0027ve got that big beautiful heart inside you.\" \"Come on!\" my mom said, grabbing both of our hands and pulling us out of the room. When we made it down to the lobby level, we found Stanton\u0027s limousine waiting. My stepfather climbed out of the back and wrapped his arms around my mom, pressing a gentle kiss to her cheek because he knew she wouldn\u0027t want to mess up her lipstick. Stanton was an attractive man, with snow white hair and denim blue eyes. His face bore some traces of his years, but he was still a very attractive man, one who stayed fit and active. \"Eva!\" He hugged me, too, and kissed my cheek. \"You look ravishing.\" I smiled, not quite sure whether being \"ravishing\" meant I looked like I was going to ravish someone or was waiting to be ravished. Stanton shook Cary\u0027s hand and gave him a gentle slap to the shoulder. \"It\u0027s good to see you back on your feet, young man. You gave us all a scare.\" \"Thank you. For everything.\" \"No thanks necessary,\" Stanton said, waving it off. \"Ever.\" My mom took a deep breath, then let it out. Her eyes were bright as she watched Stanton. She caught me looking at her and smiled, and it was a peaceful smile. We ended up at a private club with a big band and two excellent singers - one male and one female. They switched frequently throughout the evening, providing the perfect accompaniment to a candlelit meal served in a high-backed velvet booth right out of a classic Manhattan society photo. I couldn\u0027t help but be charmed. Between dinner and dessert, Cary asked me to dance. We\u0027d taken formal dance classes together, at my mother\u0027s insistence, but we had to take it easy with Cary\u0027s injuries. We basically just swayed in place, enjoying the contentment that came from ending a happy day with a good meal shared with loved ones. \"Look at them,\" Cary said, watching Stanton expertly lead my mom around the dance floor. \"He\u0027s crazy about her.\" \"Yes. And she\u0027s good for him. They give each other what they need.\" He looked down at me. \"You thinking about your dad?\" \"A little.\" I reached up and ran my fingers through his hair, thinking of longer and darker strands that felt like thick silk. \"I never really thought of myself as romantic. I mean, I like romance and grand gestures and that tipsy feeling you get when you\u0027re crushing hard on someone. But the whole Prince Charming fantasy and marrying the love of your life wasn\u0027t my thing.\" \"You and me, baby girl, we\u0027re too jaded. We just want mind-blowing sex with someone who knows we\u0027re fucked up and accepts it.\"","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-50.html","bookId":1923,"book":{"id":1923,"title":"Reflected in You (Crossfire #2)","description":"Storyline: Reflected in You (Crossfire #2) Gideon Cross. As beautiful and flawless on the outside as he was damaged and tormented on the inside. He was a bright, scorching flame that singed me with the darkest of pleasures. I couldn\u0027t stay away. I didn\u0027t want to. He was my addiction... my every desire... mine. My past was as violent as his, and I was just as broken. We’d never work. It was too hard, too painful... except when it was perfect. Those moments when the driving hunger and desperate love were the most exquisite insanity. We were bound by our need. And our passion would take us beyond our limits to the sweetest, sharpest edge of obsession...","cover":"https://allnovel.net/images/reflected-in-you-crossfire-2.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reflected-in-you-crossfire-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:50:36 AM"}}
