{"id":37995,"no":16,"title":"Section 16","content":"Peter’s adventures in love had so far been pretty much of a piece with the rest of his life experiences; there had been hopes, and wonderful dreams, but very few realizations. Peter knew a lot about such matters; in the orphan asylum there were few vicious practices which he did not witness, few obscene imaginings with which he was not made familiar. Also, Pericles Priam had been a man like the traditional sailor, with a girl in every port; and generally in these towns and villages there had been no place for Peter to go save where Pericles went, so Peter had been the witness of many of his master’s amours and the recipient of his confidences. But none of these girls and women had paid any attention to Peter. Peter was only a “kid”; and when he grew up and was no longer a kid, but a youth tormented with sharp desires, they still paid no attention to him—why should they? Peter was nothing; he had no position, no money, no charms; he was frail and undersized, his teeth were crooked, and one shoulder higher than the other. What could he expect from women and girls but laughter and rebuffs? Then Peter moved on to the Temple of Jimjambo, and there a devastating experience befell him—he tumbled head over heels and agonizingly in love. There was a chambermaid in the institution, a radiant creature from the Emerald Isles with hair like sunrise and cheeks like apples, and a laugh that shook the dish-pans on the kitchen walls. She laughed at Peter, she laughed at the major-domo, she laughed at all the men in the place who tried to catch her round the waist. Once or twice a month perhaps she would let them succeed, just to keep them interested, and to keep herself in practice. The only one she really favored was the laundry deliveryman, and Peter soon realized why. This laundry fellow had the use of an automobile on Sundays, and Nell would dress herself up to kill, and roll away in state with him. He would spend all his week’s earnings entertaining her at the beach; Peter knew, because she would tell the whole establishment on Monday morning. “Gee, but I had a swell time!” she would say; and would count the ice-creams and the merry-go-rounds and the whirly-gigs and all the whang-doodle things. She would tell about the tattooed men and the five-legged calf and the woman who was half man, and all the while she would make the dishpans rattle. Yes, she was a marvelous creature, and Peter suddenly realized that his ultimate desire in life was to possess a “swell lady-friend” like Nell. He realized that there was one essential prerequisite, and that was money. None of them would look at you without money. Nell had gone out with him only once, and that was upon the savings of six months, and Peter had not been able to conceal the effort it cost him to spend it all. So he had been set down as a “tight-wad,” and had made no headway. Nell had disappeared, along with everybody else when the police raided the Temple. Peter never knew what had become of her, but the old longings still haunted him, and he would find himself imagining—suppose the police had got her; suppose she were in jail, and he with his new “pull” were able to get her out, and carry her away and keep her hid from the laundry man! These were dreams; but meantime here was reality, here was a new world. Peter had settled down in the home of the Todd sisters; and what was their attitude toward these awful mysteries of love? \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3225/88002.html","bookId":701,"book":{"id":701,"title":"100%: The Story of a Patriot","description":"简介： Now and then it occurs to one to reflect upon what slender threads of accident depend the most important circumstances of his life; to look back and shudder, realizing how close to the edge of nothingness his being has come. A young man is walking do...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3225","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
