{"id":37982,"no":3,"title":"Section 3","content":"Peter’s imaginings were brought to an end by the packing-box being pulled out from the wall. “Hello!” said a voice. Peter groaned, but did not look up. The box was pulled out further, and a face peered in. “What you hidin’ in there for?” Peter stammered feebly: “Wh-wh-what?” “You hurt?” demanded the voice. “I dunno,” moaned Peter. The box was pulled out further, and its occupant slid out. Peter looked up, and saw three or four policemen bending over him; he moaned again. “How did you get in there?” asked one. “I crawled in.” “What for?” “To g-g-get away from the—what was it?” “Bomb,” said one of the policemen; and Peter was astounded that for a moment he forgot to be a nervous wreck. “Bomb!” he cried; and at the same moment one of the policemen lifted him to his feet. “Can you stand up?” he demanded; and Peter tried, and found that he could, and forgot that he couldn’t. He was covered with blood and dirt, and was an unpresentable object, but he was really relieved to discover that his limbs were intact. “What’s your name?” demanded one of the policemen, and when Peter answered, he asked, “Where do you work?” “I got no job,” replied Peter. “Where’d you work last?” And then another broke in, “What did you crawl in there for?” “My God!” cried Peter. “I wanted to get away!” The policemen seemed to find it suspicious that he had stayed hidden so long. They were in a state of excitement themselves, it appeared; a terrible crime had been committed, and they were hunting for any trace of the criminal. Another man came up, not dressed in uniform, but evidently having authority, and he fell onto Peter, demanding to know who he was, and where he had come from, and what he had been doing in that crowd. And of course Peter had no very satisfactory answers to give to any of these questions. His occupations had been unusual, and not entirely credible, and his purposes were hard to explain to a suspicious questioner. The man was big and burly, at least a foot taller than Peter, and as he talked he stooped down and stared into Peter’s eyes as if he were looking for dark secrets hidden back in the depths of Peter’s skull. Peter remembered that he was supposed to be sick, and his eyelids drooped and he reeled slightly, so that the policemen had to hold him up. “I want to talk to that fellow,” said the questioner. “Take him inside.” One of the officers took Peter under one arm, and the other under the other arm, and they half walked and half carried him across the street and into a building. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3225/87989.html","bookId":701,"book":{"id":701,"title":"100%: The Story of a Patriot","description":"简介： Now and then it occurs to one to reflect upon what slender threads of accident depend the most important circumstances of his life; to look back and shudder, realizing how close to the edge of nothingness his being has come. A young man is walking do...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3225","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
