{"id":38045,"no":66,"title":"Section 66","content":"They went to the office of the secret service department of the Traction Trust, a place where Peter had never been allowed to come hitherto. It was on the fourteenth floor of the Merchant’s Trust Building, and the sign on the door read: “The American City Land \u0026 Investment Company. Walk In.” When you walked in, you saw a conventional real estate office, and it was only when you had penetrated several doors that you came to the secret rooms where Guffey and his staff conducted the espionage work of the big business interests of the city. Peter was hustled into one of these rooms, and there stood Guffey; and the instant Guffey saw him, he bore down upon him, shaking his fist. “You stinking puppy!” he exclaimed. “You miserable little whelp! You dirty, sneaking hound!” He added a number of other descriptive phrases taken from the vocabulary of the kennel. Peter’s knees were shaking, his teeth were chattering, and he watched every motion of Guffey’s angry fingers, and every grimace of Guffey’s angry features. Peter had been fully prepared for the most horrible torture he had experienced yet; but gradually he realized that he wasn’t going to be tortured, he was only going to be scolded and raged at, and no words could describe the wave of relief in his soul. In the course of his street-rat’s life Peter had been called more names than Guffey could think of if he spent the next month trying. If all Guffey was going to do was to pace up and down the room, and shake his fist under Peter’s nose every time he passed him, and compare him with every kind of a domestic animal, Peter could stand it all night without a murmur. He stopped trying to find out what it was that had happened, because he saw that this only drove Guffey to fresh fits of exasperation. Guffey didn’t want to talk to Peter, he didn’t want to hear the sound of Peter’s whining gutter-pup’s voice. All he wanted was to pour out his rage, and have Peter listen in abject abasement, and this Peter did. But meantime, of course, Peter’s wits were working at high speed, he was trying to pick up hints as to what the devil it could mean. One thing was quite clear—the damage, whatever it was, was done; the jig was up, it was all over but the funeral. They had taken Peter’s money to pay for the funeral, and that was all they hoped to get out of him. Gradually came other hints. “So you thought you were going into business on your own!” snarled Guffey, and his fist, which was under Peter’s nose, gave an upward poke that almost dislocated Peter’s neck. “Aha!” thought Peter. “Nelse Ackerman has given me away!” “You thought you were going to make your fortune and retire for life on your income!” Yes, that was it, surely! But what could Nelse Ackerman have told that was so very bad? “You were going to have a spy of your own, set up your own bureau, and kick me out, perhaps!” “My God!” thought Peter. “Who told that?” Then suddenly Guffey stopped in front of him. “Was that what you thought?” he demanded. He repeated the question, and it appeared that he really wanted an answer, and so Peter stammered, “N-n-no, sir.” But evidently the answer didn’t suit Guffey, for he grabbed Peter’s nose and gave it a tweak that brought the tears into his eyes. “What was it then?” A nasty sneer came on the head detective’s face, and he laughed at Peter with a laugh of venomous contempt. “I suppose you thought she really loved you! Was it that? You thought she really loved you?” And McGivney and Hammett and Guffey ha-ha-ed together, and to Peter it seemed like the mockery of demons in the undermost pit of hell. Those words brought every pillar of Peter’s dream castle tumbling in ruins about his ears. Guffey had found out about Nell! Again and again on the automobile ride to Guffey’s office Peter had reminded himself of Nell’s command, “Stick it out, Peter! Stick it out!” He had meant to stick it out in spite of everything; but now in a flash he saw that all was lost. How could he stick it out when they knew about Nell, and when Nell, herself, was no longer sticking it out? Guffey saw these thoughts plainly written in Peter’s face, and his sneer turned into a snarl. “So you think you’ll tell me the truth now, do you? Well, it happens there’s nothing left to tell!” Again he turned and began pacing up and down the room. The pressure of rage inside him was so great that it took still more time to work it off. But finally the head detective sat down at his desk, and opened the drawer and took out a paper. “I see you’re sitting there, trying to think up some new lie to tell me,” said he. And Peter did not try to deny it, because any kind of denial only caused a fresh access of rage. “All right,” Guffey said, “I’ll read you this, and you can see just where you stand, and just how many kinds of a boob you are.” So he started to read the letter; and before Peter had heard one sentence, he knew this was a letter from Nell, and he knew that the castle of his dreams was flat in the dust forever. The ruins of Sargon and Nineveh were not more hopelessly flat! “Dear Mr. Guffey,” read the letter, “I am sorry to throw you down, but fifty thousand dollars is a lot of money, and we all get tired of work and need a rest. This is to tell you that Ted Crothers has just broke into Nelse Ackerman’s safe in his home, and we have got some liberty bonds and some jewels which we guess to be worth fifty thousand dollars, and you know Ted is a good judge of jewels. “Now of course you will find out that I was working in Mr. Ackerman’s home and you will be after me hot-foot, so I might as well tell you about it, and tell you it won’t do you any good to catch us, because we have got all the inside dope on the Goober frame-up, and everything else your bureau has been pulling off in American City for the last year. You can ask Peter Gudge and he’ll tell you. It was Peter and me that fixed up that dynamite conspiracy, but you mustn’t blame Peter, because he only did what I told him to do. He hasn’t got sense enough to be really dangerous, and he will make you a perfectly good agent if you treat him kind and keep him away from the women. You can do that easy enough if you don’t let him get any money, because of course he’s nothing much on looks, and the women would never bother with him if you didn’t pay him too much. “Now Peter will tell you how we framed up that dynamite job, and of course you wouldn’t want that to get known to the Reds, and you may be sure that if Ted and me get pinched, we’ll find some way to let the Reds know all about it. If you keep quiet we’ll never say a word, and you’ve got a perfectly good dynamite conspiracy, with all the evidence you need to put the Reds out of business, and you can just figure it cost you fifty thousand dollars, and it was cheap at the price, because Nelse Ackerman has paid a whole lot more for your work, and you never got anything half as big as this. I know you’ll be mad when you read this, but think it over and keep your shirt on. I send it to you by messenger so you can get hold of Nelse Ackerman right quick, and have him not say anything to the police; because you know how it is—if those babies find it out, it will get to the Reds and the newspapers, and it’ll be all over town and do a lot of harm to your frame-up. And you know after those Reds have got beaten up and Shawn Grady lynched, you wouldn’t like to have any rumor get out that that dynamite was planted by your own people. Ted and me will keep out of sight, and we won’t sell the jewels for a while, and everything will be all right. “Yours respectfully, “Edythe. “P. S. It really ain’t Peter’s fault that he’s silly about women, and he would have worked for you all right if it hadn’t been for my good looks!” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3225/88052.html","bookId":701,"book":{"id":701,"title":"100%: The Story of a Patriot","description":"简介： Now and then it occurs to one to reflect upon what slender threads of accident depend the most important circumstances of his life; to look back and shudder, realizing how close to the edge of nothingness his being has come. A young man is walking do...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3225","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
