{"id":43033,"no":31,"title":"CHAPTER XXXI","content":"\\n\\n While the other members of the local scattered to distribute the circulars, Everley and Friedrich escorted Samuel home, and saw him safely in, and the door locked. They had supplied him with some Socialist papers and pamphlets, and he spent most of the next day devouring these. They spread a picture of the whole wonderful movement before him; they explained to him all the mechanism of the cruel system, in the cogs of which he had been caught. \\n\\n It was all so very obvious that Samuel found himself in a state of exasperation with the people who did not yet understand it, and spent his time wrestling in imagination with all those he had ever known: with his brothers, and with Finnegan, and with Charlie Swift, with Master Albert and Mr. Wygant, with Professor Stewart and Dr. Vince. Most of all he labored with Miss Gladys; and he pictured how it would be after the Revolution, when he would be famous and she would be poor, and he might magnanimously forgive her! \\n\\n And when Sophie came home, he explained it all to her. It did not take much to make a revolutionist out of Sophie. She had become quite thoroughly what the Socialists called “class-conscious.” \\n\\n The members of the local had been anxious about Samuel all day. Everley had come in twice in the afternoon, to make sure that he was safe; and he came over again after supper, and said that Beggs and Lippman and the Bartons and himself were coming to act as a body guard to take Samuel to the meeting. The circulars had created a tremendous sensation—the whole town was talking about it, and the police were furious at the way they had been outwitted. \\n\\n So the hour of the meeting drew near. It was as if a great shadow were gathering over them. They were nervous and restless—Samuel pacing the room, wandering about here and there. \\n\\n His speech was seething within him. He saw before him the eager multitude, and he was laying bare to them the picture of their wrongs. So much depended upon this speech! If he failed now, he failed in everything—all that he had done before has gone for nothing! Ah! if only one had a voice that could reach the whole world—that could shout these things into the ears of the oppressed! \\n\\n His friends had said they would come at a quarter to eight. But they came at half past seven, and sat round and waited. It was thought best that they should not arrive until the precise minute of the meeting; and meantime they outlined to Samuel the plan of campaign they had formed. \\n\\n Dr. Barton was to make the opening speech, introducing Samuel; and by way of outwitting the police, he was to be particularly careful to get into this “introduction” all the essential facts which it was desired to lay before the people. He was to tell about the twenty thousand dollars which Hickman paid to Slattery, and about the acknowledgment which Wygant had made to Samuel, and about how the boy had been turned out of St. Matthew\u0027s Church. If the police attempted to interfere with this, the doctor was to persist until he had been actually placed under arrest; and then others were to take up the attempt in different places, until six had been arrested. In this case Samuel was to make no attempt to speak at all; they would “save” him for an out-door meeting—and also Everley, who was to defend them in court. More circulars would be given out the next afternoon, and another attempt to speak would be made that evening. \\n\\n All this was duly impressed upon the boy, and then the little company set forth. Dr. Barton walked on one side of him, and Everley on the other; Mrs. Barton, Mrs. Stedman and Sophie came next, and Beggs and Lippman brought up the rear. So they marched along; they kept their eyes open, and every time they had to pass a man they gave him a wide berth. \\n\\n So they came to the place of the meeting. At the corner were the Bremers and half a dozen others, who formed a ring about them. There was a huge crowd, they said—the lot was thronged, and the people extended to streets on every side. There was a score of policemen scattered about, and no doubt there were many detectives. \\n\\n Promptly on the minute of eight the little group approached. There was a murmur of excitement among the waiting crowd, as they started to force their way through. Samuel\u0027s heart was thumping like mad, and his knees were trembling so that he could hardly walk. The people gave way, and they found themselves in the center, where several of the Socialists stood guard over the half dozen boxes from which the speaking was to be done. \\n\\n Without a moment\u0027s delay, Dr. Barton mounted up. \\n\\n “Fellow citizens,” he called in a clear, ringing voice; and instantly a hush fell upon the crowd, and a thousand faces were turned toward him. \\n\\n “We are here,” he began, “for a very important purpose—” \\n\\n Instantly a policeman pushed his way toward him. \\n\\n “Have you a permit for this meeting?” he demanded. \\n\\n “We have been refused a permit!” proclaimed Dr. Barton to the crowd. “We are here as law-abiding citizens, demanding our right to free speech!” \\n\\n “You cannot speak,” declared the policeman. \\n\\n “There has been bribery of the city council of Lockmanville,” shouted the doctor. \\n\\n “You cannot speak!” cried the policeman sharply. \\n\\n “Henry Hickman paid twenty thousand dollars to the city council to prevent the passage of the water bill!” cried the speaker. \\n\\n “Come down from there!” commanded the officer, and made a grab at him. \\n\\n “I will not stop until I am arrested!” declared the doctor. “I am here to protest against bribery!” \\n\\n “Come down and shut up!” shouted the other. \\n\\n “For shame! For shame!” said voices in the crowd. “Let him speak!” \\n\\n “That charge was made before the vestry of the St. Matthew\u0027s Church! And the vestry refused to investigate it, and turned out a member of the church! And we are here—” \\n\\n And so, still shouting, the doctor was dragged off the box and collared by the policeman. \\n\\n “An outrage!” cried people in the audience. “Let him go on!” And yet others shouted, “Arrest him!” The throng was in a turmoil; and in the midst of it, Lippman, who was the second victim appointed for the sacrifice, sprang upon the stump of an old tree, a little at one side, and shrieked at the top of his lungs: \\n\\n “Henry Hickman paid twenty thousand dollars to Slattery to beat the water bill; and now he and the Lockman estate are making ten thousand dollars a month out of it! And Wygant confessed to our speaker that he ran the city government to get franchise favors—” \\n\\n And then Lippman was seized by an officer and dragged off his perch, and choked into silence—surrounded meanwhile by a crowd of indignantly protesting citizens. It was quite clear by this time that the crowd had come to hear Samuel\u0027s speech, and was angry at being balked. There was a general shout of protest that made the policemen glad of their numbers. \\n\\n Of these exciting events Samuel and Everley had been witnesses from the vantage point of a soap box. Now suddenly the boy caught his friend\u0027s arm and pointed, crying, “Who\u0027s that man?” \\n\\n Near the outskirts of the thrown was a big burly individual, who had been roaring in a furious voice, “For shame! Go on!” and waving his fists in the air. \\n\\n “I don\u0027t know,” said Everley. “I never saw him before.” \\n\\n “An outrage!” yelled the man. “Kill the police! Smash them! Drive them away!” \\n\\n And Everley caught the boy\u0027s arm, crying excitedly, “He\u0027s been sent here, I\u0027ll wager! They want to provoke trouble!” \\n\\n And even as he spoke, the two saw the man stoop, and pick up a brick-bat, and fling it into the center of the crowd, where the police were massing. \\n\\n “Arrest that man!” shouted Everley indignantly, and leaped forward and plunged through the throng to reach him. \\n\\n There was a roar from the crowd, and Samuel saw that several men had grappled with the bully; he saw, also, that the police in the center of the throng had drawn their clubs, and were beginning to strike at the people. A burly sergeant was commanding them, and forcing back the crowd by jabbing men in the stomachs. \\n\\n Meantime the next speaker, a woman, had mounted upon a box, and was crying in a shrill voice: “We are Socialists! We are the only political party which dares to speak for the working class of Lockmanville! We protest against this outrage! We demand free speech! There has been bribery in our city council!” \\n\\n Then suddenly the boy heard a disturbance behind him, and turned, just in the nick of time. A fellow had thrust his way through the crowd toward him, a rowdy with a brutal, half-drunken face. And Samuel saw him raise his hand, with some dark object in it, and aim a smashing blow at his head. \\n\\n The boy ducked and raised his arm. He felt a sharp, agonizing pain, and his arm dropped helpless at his side. Something struck him across the forehead, cutting a gash, out of which hot blood spurted, blinding him. He heard Beggs, who was beside him, give a shout—“Down!” And realizing that his life was aimed at, he dropped like a flash, and put his head under him, covering it with one arm as well as he could. \\n\\n There was a struggle going on over him. Men were pushing and shouting—and some one kicked him savagely upon the leg. He crawled on a little way, still keeping his head down, underneath the feet of the contendents. He heard Beggs shouting for help, and heard the Bremers answering; he heard the roar of the throng all about, the sharp commands of the police sergeant, and the crack of clubs, falling upon the heads of men and women. And then he swooned, and lay there, his face in a pool of his own blood. \\n\\n Meanwhile, one by one, three more speakers rose and made their attempts, and were arrested, while the indignant people voiced their helpless protests. Then suddenly, somewhere in the crowd, a woman began to sing. Others took up the song—it swelled louder, until it rang above all the uproar. It was the hymn that Samuel had heard at the meeting of the local—The Red Flag! \\n\\n It took hold of the crowd—men followed the melody, even though they did not know the words. They continued to sing while the police were leading away their prisoners; they followed, all the way to the station house, with shouts of protest, and of encouragement for the victims. \\n\\n And so the throng moved on, and the uproar died away. There was left upon the scene a little group of frightened people, gathered about two who lay upon the ground. One of them was Samuel, unconscious and bleeding; and the other was Sophie, clinging to him and sobbing upon his bosom, frantic with grief and fear. And meanwhile, in the distance one could still hear the melody ringing: \\n\\n Yours is the power of club and jail, yours is the axe and fire, \\n\\n But ours is the hope of human hearts and the strength of the soul\u0027s desire! \\n\\n \\n\\n The End \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3245/88954.html","bookId":642,"book":{"id":642,"title":"Samuel the Seeker","description":"简介： He had written these words upon the little picture of Samuel\u0027s mother, which hung in that corner of the old attic which served as the boy\u0027s bedroom; and so Samuel grew up with the knowledge that he, too, was one of the Seekers. Just what he was to se...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3245","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
