{"id":96664,"no":19,"title":"Page 19","content":"“Stil, he did not like you and me, did he?\n “Anyway, they talked some more and their armor spoke to me in words I understood, like cha manune speech, and I heard this story, which is probably not far wrong.\n “A thousand years ago, the Master Builder made this big hoop- world, and then shared it with the Lifeshaper because other Forerunners who had power told him to, and so the Lifeshaper put many humans here of al types. Why she favors humans I do not know, but I stil say helo to her in my dreams.\n “And the Didact is her husband, how is that possible? Never mind. I’m talking here.\n “The Master Builder learned by stealing knowledge from the Lifeshaper that some of us humans could stand up to the Shaping Sickness, and survive. I did not know what the Shaping Sickness was, but someone inside me did. You look at me now, we looked at each other back on the Didact’s star boat—we both felt old memories rising up, put there by the Librarian. You stil have them, don’t you? So do I. Not what I would choose.\n “Now this monster over so many years persuaded the boss machine to turn on the Forerunners and try to destroy them; that is what monsters do, they cause trouble.\n “And this monster is a very old monster, mother and father of al troubles.\n “But that is a story I do not know. I think it is big and maybe important.\n “We have falen in an awful place. None of them are curious, and now we have to leave. I said it was a graveyard-desert. I have no other sign/sound for it. I wonder if maybe lava erupted and grew up over everything, trees, mountains, humans . . . cities filed with Forerunners. The whole land is made of frozen, painted-over dead people and the places they once worked and lived. I don’t have sounds/signs for those places, but they are much bigger than the power stations back on Erde-Tyrene.\n “But the lava that coats the people and al the things that once lived is not rock. It is dead or dying powder, more like ash than lava. This desert stretches for a long ways. I don’t see how we can escape.\n “But the two Forerunners pick me up and carry me and the other Forerunner who can’t walk because his armor is locked. They move fast, even carrying us—jumping, running, leaping. I wish I had known armor could do that, I would have tried rough stuff on the Didact. But probably the blue lady would have stopped me, too bad.\n “I have a hard time breathing. The Forerunners talk to each other and their armor does not tel me what they are saying, but I understand a little. They are scared but hope someone wil come rescue us, because (they say this without happiness) I am important, not them; I am more important than they are.\n “I don’t know why. Do you? No? Then be quiet. I am talking here.\n “The Forerunners move fast, but slowly things change and their armor doesn’t like them and then it tries to kil them. The Forerunner who is a prisoner is crushed by his armor—it just squeezes him to death, like a bug who squashes itself.\n “The other two shed their armor and it writhes al over, kicking up ashy dust, but it stil tries to reach out and kil them, kil me—but they grab me up fast and carry me away.\n “Now we are realy in trouble. Things like mountains, but big and round, are exploding off in the direction of the night that comes like a running shadow. I ask if these mountains are volcanoes, but no; the Forerunners cal them spore-peaks. Do you understand? No?\n You don’t know. Then be quiet. I am talking here.\n “The shadow runs over us. The Forerunners are having a hard, bad time. They cough and wheeze and slow down. But we try to keep walking, nowhere, I think; they don’t know where to go. I have never seen Forerunners so frightened. It makes me sad, because I once thought they were al-powerful and now they are just people, not human, but people, naked and afraid.\n “Finaly they are too weak to carry me. I walk beside them, but they walk like their legs are made of rock. They are very sick.\n “I see clouds cover up the stars, but by the smel—like mold off old fruit, dusty-green-sneezy, I know they are not just water- clouds. Soon it rains, and in each drop is the powder. The clouds have carried it from those exploding spore-peaks. It shrouds everything, clings to my skin— moves on my skin. The powder sits on top of puddles and moves there, too, so I lie down and cover my face with my hands.\n “I am so tired and afraid. I cannot die now. Abada sometimes smels fear and does not come. The hyenas smel fear and laugh and grind up your soul. The Elephant never finds your bones because he turns away from the smel of fear. So we have seen in the sacred caves. So I showed you when you were young and tough. If I am going to die, better to die unafraid. The only way to escape this sort of fear is to sleep a big, deep sleep.\n “And so I sleep now, too. Shh.”\n As if the strain of teling this story had taken its tol, Riser’s eyelids drooped, his chin dipped, and he dropped off into a heavy doze, leaving us to sit there.\n “Is he finished?” Vinnevra asked. Mara grumbled and drew her legs around the cha manush to protect him while he snored.\n “I don’t think so,” I said.\n She looked at me different now. I did not like that look and became very uncomfortable, even more uncomfortable when she moved closer to me. Mara reached out and nudged me toward her, and I glared at the ape, but she pouched out her lips and guttled.\n Vinnevra settled in.\n After a while, I told Vinnevra and Mara about the story devil who went from tribe to tribe and town to town, teling the very best stories ever, but whoever listened to him lost the power of speech and instead spoke useless babble. I did not know if the shadow- ape understood al that I was saying, but she listened close.\n I finished with, “And even now, we find the descendants of those who heard his stories and al they talk is babble.”\n A lame fable, but al I had.\n Vinnevra gave me a wry look. “Is that in your sacred caves?”\n she asked.\n “No,” I said. “Those are about life and death. This is just about how story devils confuse us.”\n “This monster the humans captured and the Master Builder released—was that a devil, too?”\n “Maybe.”\n Mara grumbled and looked away, then shook her head. Perhaps she understood more than she let on.\n “Is the Lady who touches us at birth a devil?” Vinnevra asked.\n “No,” I answered.\n “Is our flesh her story?”\n I shook my head, but the idea bothered me, flesh and story al tangled up. . . . Maybe. Maybe so.\n We waited while Riser slept. Dusk drew over us and the insects became fierce. But we did not shake him, because he might be grumpy and stay quiet for a while if he did not sleep wel, and we hoped he realy did know something useful.\n Finaly, he opened his eyes, leaned and stretched on Mara’s thigh, looked on Vinnevra and me with something like approval, and resumed.\n “That was a good sleep,” he said. “I remember more now. Swat some of these bugs for me.”\n We swatted some bugs until he was satisfied and resumed his teling.\n “Day comes. I wake slowly. The land is dry, the powder is crusty and dead, not moving, just dead. It smels like old dung in deep caves. The Forerunners do not look the same as when I went to sleep. They are al clotted powder. They tried to grow together during the night, and now they are just lumps. Their flesh is gone, their bones are gone. They are dead. I am not dead.\n “The powder fals off my skin.\n “I am alone. It is never good to be so alone. In this graveyard- desert, it is worse. The spore-peaks wil erupt again and more powder wil come and I think maybe next time it wil know how to dissolve my bones, too, or fil my nose and mouth forever.\n “Six times the night sweeps over and there is more rain. I walk through the rain. Too much rain. Sometimes, when it is not raining, both night and day, I see shooting stars and think they are star boats. Once, I find many crashed star boats, smaler ones, scattered on the desert. They have spiled out broken machines, like the one back there, but their eyes are dark. I kick them and they don’t fly away. There might have been Forerunners in the star boats but now they are only lumps of powder.\n “It seems that Forerunners have been arguing and fighting, but also they are losing a fight with something else, something awful, and that tels me to wake my old memories. I have been ignoring the old spirit in me ever since Charum Hakkor, but now I let it loose, and it watches through my eyes.\n “This hoop-world is like nothing known to the old spirit. It decides this must be one of their great machines, perhaps a fortress.\n “Before the old spirit fought Forerunners, it once fought the Shaping Sickness. Even back then, it was spread by touch or by a fine powder and turned flesh into lumps. Sometimes it gathered the sick together—two people, four people joining up and speaking with one voice.\n “It caled this a Gravemind.\n “But I have listened to the Didact and the Master Builder, and I know ‘Shaping Sickness’ is what they cal the Flood. I am in the middle of a place blasted by the Flood, which old humans long ago fought and defeated, but now it has come back, and it has changed.\n Why? How did the sickness get here? I look to the spore-peaks, shooting up great clouds of fine powder, and the winds that carry it al over. That is the source. The Shaping Sickness infects Forerunners, and it is winning.\n “But then—I learn a wonderful thing!” Riser’s eyes flick rapidly and he looks up. “My old spirit was once a female. Better a female than a hoary old male who might argue and be offensive to me.\n “The old female spirit asks me if the ‘Primordial’ was let loose.\n That’s the name she uses. She shows me amemory of it, al grasping arms and an old man’s fat body, but like a giant beetle curled up— and big, it would cover this mound—with a low, flat head, a mouth of many jaws, and dead jewel eyes. I have to tel her, I think that it was let loose, taken to this place, this hoop-world, and she says, Ah, so it is, and now there is great danger.\n “You have seen it, too? Then it is real. Too bad.\n “When I reach the low hils of the mountains, where the Shaping Sickness has not come, and see the smal round machines going up and down the hils, searching, waiting, watching . . . I folow them quietly up to the plateau, and that is where I find you and al those ghosts that walk outside and try to act like people. But they have no smel.” He raised his hands, palms up, and tapped one shoulder with three fingers. “That is what I know, but I know so little.”\n “You both saw where this devil was kept, didn’t you?” Vinnevra asked us. “On the world where humans last fought the Forerunners and died.”\n “Charum Hakkor,” I said.\n “Yes,” Riser said. “We both saw that place, but the monster was gone.”\n Within me, my own old spirit was rising from a long quiet.\n I must speak with this little one!\n Half-compeled, I gave the Lord of Admirals my voice and he spoke through my mouth. The effort racked my body. My muscles twitched and sweat beaded my brow. His words at first were clumsy and mumbled.\n Then the shaky voice—not quite my voice—became more clear.\n But what I heard from my mouth was not what I heard in my head.\n The accent was different—the language, at first, imprecise. My mouth was used to forming words a certain way—not the way nor in the manner of this old spirit.\n Vinnevra watched with furrowed brow, Riser with eyes wide, attentive, nostrils flexing nervously.\n “Tel me . . . tel us your name,” the Lord of Admirals said, addressing the spirit within Riser. “Tel me your old name.”\n Now it was Riser’s turn to give up his mouth. For him, it seemed even harder. Riser’s body was older than mine, more set in its ways.\n “I am Yprin Yprikushma,” his old spirit finaly managed. Neither of us understood that strange name—but the Lord of Admirals seemed almost to burst into flame, a flame of anger, dismay, and disappointment.\n But also, strangely, of exaltation! These old humans had different ways of mixing their emotions.\n “You—!” he cried, then puled back his anger, banked the fires —tried to swalow them. Stil, they seemed to burn and gouge the insides of my head.\n This type of anger I had never experienced before from the old spirit, and I could see by Riser’s expression that he was feeling something similar.\n We sat, Riser and I, in the shade of the great boulders on that promontory, experiencing a new relationship to one another—a relationship Gamelpar and I were never able to complete. Vinnevra looked between us with that same furrowed frown she used when Gamelpar and I had spoken about these things.\n “And who are you?” Riser’s old spirit asked.\n “Forthencho—Lord of Admirals, supreme commander of the last fleets of Charum Hakkor.”\n “The one who lost the war to the Didact.”\n “Yes. Yprin Yprikushma—you saw what the Shaping Sickness has done here,” the Lord of Admirals said. “And that has brought you forward, out of guilt! Out of pride!”\n “I am dead. You are dead.” Riser’s voice was almost\n unrecognizable.\n We had become puppets, and I feared these spirits would never let us go.\n The dialog between the old spirits went on for some time. I was not precisely present for al of it, so what I remember is shifting, dreamlike, but the facts—the larger facts—loom clearly enough, and if I wish—if I open many old doors—I can resuppose, reimagine the histories and emotions now being alowed to clash once again.\n “And now, many more are dead,”my old spirit resumed, “because you recovered and preserved the Primordial. From a place lost to the memory of al, including Forerunners, you brought it to Charum Hakkor. . . .”\n “I have no disgrace. I had reasons to speak to the Primordial, and it is not known to this day whether the Primordial was responsible for the Shaping Sickness. Confined the way it was, where it was, and found long after the sickness began—how could it be?” \n","sourceLink":"https://allnovel.net/halo-primordium-halo-9/page-19.html","bookId":1632,"book":{"id":1632,"title":"Halo: Primordium (Halo #9)","description":"Storyline: \n Halo: Primordium (Halo #9) \n \"A long time ago, I was a living, breathing human being. I went mad. I served my enemies. They became my only friends.\" \n \"Since then, I\u0027ve traveled back and forth across this galaxy, and out to the spaces between galaxies--a greater reach than any human before me. \" \n \"You have asked me to tell you about that time. Since you are the last true Reclaimer, I must obey. Are you recording? Good. Because my memory is failing rapidly. I doubt I\u0027ll be able to finish the story.\" \n \"Once, on my birth-world, a world I knew as Erde-Tyrene, and which now is called Earth, my name was Chakas...\" \n In the wake of apparent self-destruction of the Forerunner empire, two humans--Chakas and Riser--are like flotsam washed up on very strange shores indeed. \n Captured by the Master Builder, misplaced during a furious battle in space, they now find themselves on an inverted world where horizons rise into the sky, and where humans of all kinds are trapped in a perilous cycle of horror and neglect. For they have become both research animals and strategic pawns in a cosmic game whose madness knows no end--a game of ancient vengeance between the powers who seeded the galaxy with life, and the Forerunners who expect to inherit their sacred Mantle of duty to all living things. \n In the company of a young girl and an old man, Chakas begins an epic journey across a lost and damaged Halo in search of a way home, an explanation for the warrior spirits rising up within, and for the Librarian\u0027s tampering with human destiny. \n This journey will take them into the Palace of Pain, the domain of a powerful and monstrous intelligence who claims to be the Last Precursor, and who now has control of both this Halo and the fate of Forerunners and Humans alike. \n Called the Captive by Forerunners, and the Primordial by ancient human warriors, this intelligence has taken charge of, and retasked, the Master Builder\u0027s cruel researches into the Flood--which it may have itself unleashed on the galaxy more than ten thousand years before.\n \n","cover":"https://allnovel.net/images/halo-primordium-halo-9.jpg","author":"Greg Bear","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-primordium-halo-9.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:21:20 PM"}}
