{"id":37978,"no":11,"title":"CHAPTER X.","content":"“TO LIVE IN HEARTS WE LEAVE BEHIND, IS NOT TO DIE.” Before pronouncing the benediction in this pleasant meeting with old familiar faces, I must not fail to say more of the kind old master who was as respectful to his dusky body servant as to his proudest peer, and who could penetrate color, poverty, and untutored speech, and find where a true heart lodged. Eppa Lawson Fort was born at “Riverside,” a picturesque homestead on Red River, three miles southeast of Port Royal, Tennessee, August, 1802. He was the son of a prominent Baptist minister, and a church goer, but strange to say, during a pilgrimage of nearly ninety years, never joined a church. He believed implicitly in God’s mercy, and when approached by friends, on the subject of religion, he would assure them that the Lord would manifest Himself to him in a way that he would understand, when He was ready for him to enter the Christian fold. [84]Mr. Fort was twice married, the first time to Miss Virginia Metcalfe, of Robertson county, and the second to Miss Elizabeth Dancy, of Florence, Alabama. Three sons blessed his first marriage, and a son and daughter his last, all of whom are dead. For the benefit of those of my readers who knew Mr. Fort and his last wife, I give below a brief sketch of family history: The Forts, Dancys and Wimberlys were related, and came from North Carolina to Tennessee at an early date. The first Fort family settled on Sulphur Fork Creek, near Beech Valley Mill, at a place now owned by Mr. Plummer Poole. The Wimberlys went nearer Clarksville, on Red River, and their first homestead is now occupied by their descendants, Messrs. Joe and Alf Killebrew, of Rossview neighborhood. Esq. William E. Dancy located near Dunbar’s Cave, but later moved to Florence, Alabama, carrying with him a number of valuable slaves, and a family consisting of his wife and three small children, Caroline, Elizabeth and John. It was before the day of railroads, and all the visiting between the Tennessee and Alabama relatives was done on horseback, covering a period of several days’ journey. During the 30’s little Caroline and Elizabeth had grown to young ladyhood and accompanied by a younger brother, they came to visit the Wimberlys. They found[85] Mr. Fort a gay young widower, and he found Miss Elizabeth Dancy a charming young lady. A few months prior to this, he had paid his addresses to a popular young lady of Port Royal, and they were engaged, but by dint of accident he learned from a reliable source that she had said publicly that she did not intend to be bothered with his three little boys, so he frankly informed her that his children were first, and released her. After spending several weeks in Tennessee, as the time had come for the Dancy girls to return to Alabama, Mr. Fort asked the privilege of escorting them, by saying he had not seen “Cousin Nancy,” their mother, in a long time, and that she was his favorite relative. The old folks saw clearly through it all, and were pleased, and after a two weeks’ visit Mr. Fort returned home, with the prospect of being their son-in-law some time during the coming year. The three sweet little motherless boys, Jack, Ilai and Sugg, in the meantime were being tenderly cared for by their mother’s relatives. A year sped quickly by; a black broadcloth wedding suit was packed in a pair of leather saddle bags, and mounted on a handsome dappled gray horse, Mr. Fort set his face southward, with bright anticipations. A letter had preceded him, telling them what day to expect him; it was before the[86] time of sewing machines, and the bridesmaids, Hannah and Lute Barton, had been in the Dancy home several days making the wedding dresses; they and the bride were to be dressed alike, in white muslin, flounced to the waist, and flounces bound with white satin ribbon. Esq. Dancy lived on what was known as “The Military Road,” cut out by Andrew Jackson during the Creek War, and horsemen could be seen a long way off. Toward sunset a member of the family looked up the road and exclaimed, “Yonder comes the Tennessee widower!” and they all ran out to meet him. He set his saddle bags in the hall, and incidentally mentioned their contents, whereupon the bride elect took out the broadcloth suit and neatly folded it away in a bureau drawer in her room. In those days there were no trunks, but few spare rooms, and no foolish conventionalities. Along with the clothes was a fine pair of No. 5 pump sole shoes, to be worn on the wedding occasion. Mr. Fort had a small, shapely foot, and it was said the young ladies in the Dancy home, assisting the bride in her preparation for the wedding, would go every now and then and peep admiringly at those dainty pumps in the bureau drawer. Mr. Dancy made his daughter a bridal present of a nice black saddle horse, called “Indian,” and[87] when they turned their faces toward Tennessee, mounted on this black and white steed, it must have been an interesting picture. Seventy odd years ago, think of the changes! For her traveling suit, the bride wore a purple marino riding habit, made with long pointed tight waist, with hooks and eyes beneath the waist line underneath, by which it could be temporarily shortened and converted into a walking suit, thereby saving her the trouble of dressing when they took lodging at the wayside inns or taverns, as they were called. (It will be remembered that a bridal wardrobe folded in saddle pockets afforded but few dresses for change.) A shaker straw bonnet, with a green berege frill, or skirt, completed her outfit. The headpiece of these Shaker bonnets, or “scoops,” as they were called, were shaped something like the cover of an emigrant’s wagon, and were anything but pleasant to wear in warm weather. On reaching the Tennessee River, Mr. Fort’s fine gray horse grew stubborn, and refused to step into the large ferry boat, and had to be blindfolded. The trip was a long and tiresome one, and the bride was laid up for repairs over a week; the scorching July sun had dealt roughly with her delicate complexion, and before she was[88] aware of it, the back of her neck was deeply blistered from the sun shining through the thin berege skirt of her Shaker bonnet. The faithful servants did all in their power to make her feel at home; then and there an ideal home life began, and Mr. Fort was a prime factor in making it so. The following amusing story was often told of him: He had a nice herd of dairy cows, and among them was one they called “Stately,” the bell cow. Aunt Margaret was the milk maid, and she always carried along with her to the cow pen her ten-year-old son, Nelson, “to keep the calves off,” as they termed it. One summer evening about sunset, the family were seated on the front gallery, Mr. Fort, his wife, and their youngest son, the late W. D. Fort. They were quietly discussing the expected arrival next day of some favorite relatives from Paris, Texas, Dr. Joe Fort’s family. Suddenly Nelson appeared on the scene, and in breathless excitement exclaimed, “Mars Lawson, old Stately poked her head in a wagon wheel up at the lot, and she can’t get it out, and mammy says what must she do about it?” Revs. F. C. Plaster, and W. S. Adams, who assisted in Rev. Horace Carr’s ordination at Old Red River Church, before the Civil War. Mr. Fort sprang to his feet, and on the impulse of the moment said, “Tell one of the men up at the lot feeding, to get an axe and cut her fool[89] head off, QUICK!” It was too good to keep, and his son treasured it as a household joke, which he enjoyed telling on his kind old father, along with many others equally as amusing. But the happy old Riverside home was to undergo changes. After a few days illness, from the infirmities of old age, Mr. Fort quietly fell asleep, July 12, 1891. His remains were laid to rest with Masonic honors at the old Metcalfe burying ground on Elk Fork Creek, near Sadlersville, Tenn. His family feasted on his affections, and his friends enjoyed the wealth of his noble nature. Since the lives of most of the good people mentioned in this little story centered around Port Royal, I deem it not amiss to tell something of this historic spot. Nearly four generations have passed since this village, which tradition tells us, lacked only one vote of being the Capitol of the State, was settled. In 1789, Samuel Wilcox, of Port Royal, South Carolina, came with his small family and settled near a large spring, on the left bank of Red River, at the foot of a ridge called “The Devil’s Backbone.” The exact location may be better known today by pointing the reader to a slight elevation on the far side of W. N. Gaines’ bottom[90] field, lying between his “Hill Top” home and Sulphur Fork Creek, nearly opposite the old Weatherford mill site. Located as he was, between Red River on the one side and Sulphur Fork Creek on the other, he soon realized his mistake, for during the high water season a vast area of this level tract, including his home, was subject to overflow. So he crossed over Sulphur Fork Creek a few hundred yards northwest, to a picturesque point where the creek empties into Red River, and built a primitive residence, and a blacksmith shop, and called the place Port Royal, in honor of his native town in South Carolina. Mr. Wilcox later on entered about one thousand acres of land three or four miles from Port Royal, on the Graysville road leading to Kentucky. A portion of his original purchase is now owned by Mr. Polk Prince, of District No. 1, Montgomery county. This was the first permanent settlement made at Port Royal. But fourteen years earlier, 1775, the historian tells us of tragic scenes enacted thereabouts, as follows: “A famous hunter by the name of Manscoe, and three companions, camped a few weeks near where Sulphur Fork Creek empties into Red River, and here Manscoe had an adventure with some Indians. Having discovered from their[91] trail, that a hunting party of some sort was in the vicinity, he went alone to ascertain if possible who they were. “On the bank of the river, he saw a camp fire, and creeping as close as he dared, he saw two Indians, whom he recognized as belonging to the Black Feet tribe. Manscoe was about to retire to carry the news to his companions, when one of the Indians arose and came directly toward him. Manscoe fired, and the Indian wheeled and ran about fifty yards past his own camp fire and fell dead over the bluff into the river. The other Indian made quick time away from the fatal spot, not knowing, it was supposed, how many whites were in the attacking party. Manscoe not knowing the number of savages, beat a hasty retreat also. Joining his comrades, he returned in a few hours, accompanied by them, to find the fugitive Indian had, in the meantime, been to his camp, packed his scant belongings on his pony, and left for parts unknown. They followed close on his trail, the remainder of the day, but never found him. “Knowing that the Indians would soon return in full force to avenge the death of their comrade, Manscoe and his party left the country within the next few hours, but terribly was the death of this Indian afterwards avenged. In 1794, ten[92] years after Clarksville, Tenn., had been incorporated and named, Col. Isaac Titsworth, and his brother John, with their families, moved from North Carolina to the Cumberland country. They intended locating on Red River, and on the night of October 24, 1794, camped at the mouth of Sulphur Fork Creek, near where the Indian had been shot by Manscoe. That night a party of fifty Creek Indians stole upon them, taking them completely by surprise. Seven of the party, including Col. Titsworth and his brother, and their wives were killed and scalped. A negro woman was badly wounded, but crawled off in the woods and escaped. The Indians carried off six prisoners, a negro man, a white man, a grown daughter of Col. Titsworth, and three little children. Great excitement reigned, and in a few hours a party of white men was organized and on their trail. The Indians discovering their approach, tomahawked the children and scalped them, taking off the whole skins of their heads. The white man and the negro, they either killed or carried off with their daughter; none of the three were ever heard from.” As far back as 1807, the citizenship of Port Royal received favorable comment, as the following from “The Life and Times of Elder Reuben Ross,” will show: [93]“Although not a great deal could be said in praise of the small village of Port Royal, in itself, near which we are now living, it would be safe to say, no finer citizenship could have been found anywhere at this time than in the country around it, extending into Robertson and Montgomery counties. In evidence of this, one need only to mention such names as Fort, Norfleet, Northington, Dortch, Baker, Cheatham, Washington, Bryant, Turner, Blount (Gov. Willie Blount), Johnson, and others. They were generally men of large stature, dignified and patriarchal in their bearing, many of them wealthy, very hospitable, and always ready to assist those who needed assistance, especially strangers who came to settle among them.” While the lordly old masters have drifted away with the “days that are dust,” the posterity of a fine antebellum citizenship lingers yet with us to bless and beautify the hills and vales of dear old Port Royal.","sourceLink":"http://novel.tingroom.com/duanpian/2766/76330.html","bookId":1336,"book":{"id":1336,"title":"Pioneer Colored Christians","description":"简介： In the busy rush of life, the virtues of single individuals too often escape notice, or make but slight impression on the minds of their contemporaries. It is in after years, when the actors are dead and gone, that their virtues shine forth, and spea...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2766","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
