{"id":81054,"no":35,"title":"Page 35","content":"\"By the Lightstorm,\" Bryer said, \"this is sure a surprise. Wait until your folks hear about this, huh, Sariana? I bet they\u0027ll be stunned. They don\u0027t even know about Shields, do they?\" \"What\u0027s in the kit?\" Luri demanded eagerly. \"Did you get a chance to see what\u0027s inside? I\u0027ve always wanted to get a good look inside a Shield\u0027s weapon kit.\" Sariana turned her appalled gaze back to Gryph. He was calmly sipping tea. His eyes met hers over the edge of his cup but he said nothing. She scanned the faces of the Avylyns. \"Have you all gone crazy? What is this nonsense about marriage?\" Jasso\u0027s brows came together. \"You must know that under the laws set down in the First Generation Pact you have allowed this Shield to claim you for his bride.\" \"I know nothing of the kind!\" Sariana heard her voice rising to a shriek and frantically worked to control it. She never shrieked. \"What are you talking about?\" Lady Avylyn glanced doubtfully at her. Then she narrowed her eyes thoughtfully. \"The Pact was made between the First Generation social classes of The Serendipity and the Shields. A Shield is entitled to search for a mate in any social class he wishes. But he cannot take you by force, Sariana. It is clearly stated in the Pact that the woman must be willing. Did Gryph rape you last night?\" The beautiful little tea cup cracked and disintegrated between Gryph\u0027s fingers. He didn\u0027t move from his chair bat his eyes were suddenly dangerous. \"By the Lightstorm, I have done nothing against the Pact. I am a Shield. By definition that means I have obeyed the laws governing my marriage rights. Ask her.\" \"Ask me what?\" Sariana was tense with a strange panic. \"Will somebody please tell me what is going on here?\" \"Ask her,\" Gryph ordered. Lord Avylyn turned to Sariana. \"Sariana, you must tell me the truth. Did you give yourself willingly to this man?\" Sariana was mortified. \"How dare you ask such things in public or even in private. I know you westerners are far more liberal about - this sort of thing than those of us from the east, but surely you have some respect for a woman\u0027s privacy.\" Lord Jasso waved that aside. \"This is no time for false modesty. Sariana, you are living in my household. As a member of it you are entitled to my protection.\" He shot a defiant glance at Gryph who ignored it. \"But if no law has been broken, then I must assume that you are, indeed, married to this Shield. Did you go with him willingly last night or did he take you by force?\" Sariana wanted to scream. She felt as if she were caught in a nightmare. She jerked her gaze from Jasso\u0027s concerned expression to Gryph\u0027s implacable face. \"Answer him, Sariana. But see to it that you answer him honestly,\" Gryph said calmly. \"Because if you try to lie, I will force the truth out of you. Believe me, I can do it.\" Sariana took a step back toward the door. \"You have all gone out of your minds. I don\u0027t understand any of this.\" Lady Avylyn looked at her with compassion. \"Just tell us the truth, Sariana. It is very important.\" \"He did not rape me, if that\u0027s what you want to know.\" Sariana put a hand to her throat, wondering if she was losing her voice. It sounded so faint. \"But I never agreed to marry him.\" Lord Avylyn shook his head helplessly. \"Don\u0027t you see, Sariana? You already are married to him. You proved it a few moments ago when you opened his weapon kit. Everyone knows that only a true Shieldmate can open her lord\u0027s weapon kit. The prisma locks are sealed to everyone else. A Shield gives the secret to his wife on their wedding night. It is the proof of their bond when she opens the kit the next morning in front of witnesses. Under Pact law, you are married.\" \"No,\" Sariana said, feeling as though the walls were closing in around her. \"This Pact law, whatever it is, is a western law. I am an easterner. Do you understand? I am an easterner.\" Lord Avylyn looked at her sorrowfully. \"I am sorry, my dear. But as long as you are living with us, you are subject to our laws and ways. You know that.\" Sariana whirled around and fled as if all the terrors of the western frontiers were at her heels. Chapter 8 SARIANA ran toward the only source of comfort and rationality she knew in a world that seemed to be turning upside down. By the time she reached the wide, carved doors of Etion\u0027s bank, she was breathing hard. Before going in she forced herself to stop and draw several deep breaths. No one had much noticed a harried looking woman making her way through the streets of Serendipity, but once inside the bank she would draw unwanted attention to herself if she didn\u0027t calm down and appear a little less frantic. The last thing Sariana wanted to do was embarrass herself or Etion. When she had caught her breath, she swept through the doors and into the building. The people of Serendipity carried on their banking with the same loud enthusiasm they applied to nearly every other activity. Rakken\u0027s bank was no staid, solemn hall where business was conducted in hushed, reverent tones as would have been the case in the eastern provinces. Instead the building was full of lively, surprisingly organized employees who gossiped, argued and joked with their clients. As usual, there was color and drama everywhere, from the outrageous styles in clothing to the rather loud confrontations taking place at the loan desks. One of the secrets of Rakken\u0027s success was that, unlike other easterners who had tried to conduct business in the west, he hadn\u0027t attempted to impose eastern ways on his employees or his clients. As Etion had once explained to a newly arrived and thoroughly bewildered Sariana, one had to adapt in order to survive. For Etion, Sariana knew, there was no hope of going home. He had to make it here in Serendipity. He had adapted. Perhaps a little too much so judging by the way he had gone through the punch the night before. But then, she was in no position to make accusations in that regard, she reminded herself grimly. Just see where the indulgence in punch had landed her. She pushed her way through the mix of fashionably dressed people, her attention focused on reaching Etion\u0027s office at the far end of the hall. He saw her through the glass windows that separated him from the activity on the floor and rose to greet her as Sariana walked purposefully past the receptionist. \"Sariana. This is certainly a surprise. The luck of the day to you.\" He examined her with a concerned frown. \"Am I late for an appointment? If so, I sincerely apologize. I\u0027ve been fighting the most nagging headache this morning.\" Sariana stripped off her gloves and flung herself down into the nearest chair. \"No, you have not missed an appointment. And don\u0027t bother wishing me the luck of the day. This is very definitely not my lucky day.\"","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-35.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
