{"id":81078,"no":59,"title":"Page 59","content":"\"You tell me. I\u0027m afraid to guess. To be on the safe side you will stay within eyesight, not just shouting distance.\" He took off his boots and stepped over the edge of the flat sled. The clear waters lapped lazily at his bare feet.\n \"Do you know what your problem is, Gryph?\"\n \"I\u0027ve got all kinds of problems. Which one are you referring to?\" He tossed a pack down onto the sandy beach and glanced back at her.\n Sariana regarded him from the gently bobbing sled, her hands on her hips, her eyes militant. \"Your problem is that you don\u0027t know how to deal with others on an equal basis. You\u0027re arrogant and undiplomatic in the extreme. You\u0027re always giving orders. Especially to me.\"\n \"For all the good it does me.\" He studied her for a long moment. \"Why did you leave the windrigger this morning, Sariana?\"\n Sariana eyed him warily. She had been hoping that he had forgotten about that piece of business. His silence on the subject during the river trip had convinced her he had decided not to reopen a sore subject. \"I didn\u0027t feel like staying on board.\"\n \"You\u0027re lying.\"\n \"I am not lying!\"\n He regarded her closely. \"All right, we\u0027ll compromise. You\u0027re not telling me the whole truth. How\u0027s that?\"\n \"That sounds just fine to me,\" she retorted. She was beginning to feel cornered already and the knowledge made her angry.\n \"So what\u0027s the rest of the story? Why did you leave the windrigger? Was it just because I\u0027d given you orders to stay on board? Are you so stubborn and temperamental and defiant that you\u0027d disobey a reasonable request, just to prove you don\u0027t have to take orders from me?\"\n \"What do you think?\" she challenged.\n To her surprise, he appeared to consider the matter. \"I think,\" Gryph finally said, \"that you are independent and stubborn and irrational enough to do something like that just to provoke me, but I don\u0027t think that\u0027s why you disobeyed me this morning. I want to know why you went into town this morning, Sariana.\"\n \"Personal reasons.\" She sat down and began unlacing her walking boots in preparation for going ashore.\n \"What personal reasons?\" Grypb waded back into the water and bounded onto the sled. Sariana looked up and realized he had decided he wanted an answer and he wasn\u0027t going to leave her\n alone until be had it. \"Why does it matter?\"\n \"It just does, that\u0027s all. I\u0027ve been thinking about it all afternoon and I\u0027ve decided it definitely does matter.\" He put one bare foot on the low railing that went around the edge of the broad, flat sled and waited for her response.\n Sariana dredged up a bright smile. \"How about simple curiosity? I\u0027ve never been to Little Chance before and I wanted to see what the place looked like.\"\n He exhaled slowly, clearly doing his best to hang onto his patience. \"Stop it, Sariana. Just tell me the truth. That\u0027s all I want. Por the past few hours I\u0027ve told myself it was your curiosity that took you ashore.\n Or else it was your desire to assert yourself. But something doesn\u0027t ring true about either one of those answers. That\u0027s why I want the whole story.\"\n Sariana finished removing her second boot and sat quietly for a moment. \"All right,\" she said at last. \"It\u0027s simple enough. I went into town to find a medic.\"\n \"A medic?\" Alarm flared in his eyes. \"You didn\u0027t tell me you were ill.\"\n \"I\u0027m not ill. I went to see a women\u0027s medic. One who could give me a contraceptive device. There. Does that answer your question?\"\n \"You went into town to get something to use for birth control?\" There was genuine shock in his tone. Sariana stirred uneasily and rose to her feet. It didn\u0027t help much. He was a lot bigger than she was and\n they were very much alone out in the wilderness. \"Why not?\" she said bluntly. \"I got the feeling you weren\u0027t going to do anything about it, and if it\u0027s true that for some reason you can… can make a baby with me then I have to protect myself, don\u0027t I?\"\n He didn\u0027t move, but Sariana had the impression that it was only an incredible willpower that kept him still. The image of him grasping her shoulders and shaking her was so strong that she was startled into wondering if it had seeped into her mind from his. It enraged her and frightened her to realize that such transference might really be possible between them. With all her heart she longed to deny the link and with each passing hour it became more difficult to do so.\n \"Sariana, I\u0027ve warned you, you are going to push me too far one of these days.\" Her temper exploded and she threw up her hands in a wild gesture. \"What about me? I feel as though\n I\u0027ve already been pushed too far. Don\u0027t my feelings count?\"\n \"I know exactly what your feelings are when you lay in my arms and believe me, I take them into full account,\" he shot back. \"You want me as much as I want you.\"\n \"All you really want is a good breeder,\" she snapped, \"someone you can turn into a mother. How do you think that makes me feel?\"\n \"It should make you feel needed and wanted and very important to me,\" he flung at her as his own control began to slip.\n \"Well,\" it doesn\u0027t. It makes me feel like a farm animal.\" \"That\u0027s ridiculous.\"\n \"You\u0027re telling me! And I\u0027m tired of feeling ridiculous, do you hear me, Gryph Chassyn? I didn\u0027t think I could feel any more useless and ridiculous than I did the day I got word I had failed my academy entrance exams, but I was wrong. That was just a feeling of intellectual failure. You\u0027re trying to make me feel like a failure as a woman and a human being.\"\n \"Are you out of your mind?\" he snarled, still not moving. \"I\u0027m more than willing to turn you into a success as a woman. It seems to me I\u0027m offering you a better deal than any you\u0027d get from a routine business marriage. At least with me your real talent as a woman will be fully appreciated.\"\n \"Having your babies is supposed to be a sign of my success?\"\n \"You could do worse, lady.\"\n \"I could also do a whole lot better.\" Recklessly she took a step toward him, her eyes flashing with pride and outrage. \"Do you hear me, Chassyn? I said I could do a whole lot better than you.\"\n \"How? By forming a marriage alliance with someone like that banker friend of yours? What do you think the chances are that you\u0027d find any real passion in his aims? What do you think the chances are of him bringing out the real woman in you?\"\n It was too much. Sariana went over some invisible edge. \"What do you think the chances are that you can make me into a real woman when, from all accounts, you may not even be a real man yourself?\" \n","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-59.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: \n Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?\n \n","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
