{"id":81084,"no":65,"title":"Page 65","content":"part of the whole thing. I don\u0027t know. All I know was that I was on the receiving end of what you were projecting last night and it wasn\u0027t my imagination that was going wild.\"\n She got to her feet and walked down to the water\u0027s edge, not looking at him. \"This is all very complicated.\"\n \"I know.\"\n \"How did your ancestors save The Serendipity? How did they even happen to be on Windarra when the starships arrived?\"\n \"The original Shields cleaned up Tails and the planet was colonized. In the battle to survive on Talis, much of our technology was lost, including the secrets for producing more Shields and the secrets of interstellar travel. But a few Shields found mates and to everyone\u0027s shock, had sons. Fortunately, as it turned out. We never did rediscover the secret of creating more Shields. But when we got back into space we found out we still needed Shield talent. We were dependent on the ones who were descended from the original Shields.\"\n \"You did get back into space.\"\n \"Yes. We got back into space and when we did the Shields were needed once again to mop up the remaining planets of our solar system. And then faster, more sophisticated ships were designed. A decision was made to use the new technology to send exploration teams of Shields out beyond our star system to try to locate the source of the crystal ships. As long as they existed, they were a danger. My people decided they had to learm who or what had built them and where they came from. No trace of any living being has\u0027ever been found with the ships.\"\n Sariana picked up a few pebbles and tossed them out over the water. Gryph could see that the arc was all wrong but he decided this wasn\u0027t the time to correct her pitching. The pebbles hit the water and sank without a single skip. She turned around to face him.\n \"Your ancestors, the ones who saved The Serendipity, formed one of the exploration teams, right?\" He nodded. \"Right. They were tracking prisma to this planet, when they picked up signals from The\n Serendipity and The Rendezvous. They didn\u0027t know the people inside the ships were human. Not at first. There was the distinct possibility that the beings in the new starships were the ones who had created the prisma weapons. So my ancestors stalked yours and wound up in orbit around Windarra. When the first lightstorms hit The Serendipity and The Rendezvous, someone realized you weren\u0027t the bad guys.\"\n \"So the Shields came to the rescue.\"\n Gryph shrugged. \"It was what Shields were created to do. But there was only one Shield ship. It couldn\u0027t protect both of the incoming colony ships. The Shield team chose the one that seemed damaged the most by the initial assault and rode the storm down with it.\" Gryph paused and then added soberly, \"It was the worst lightstonn that had ever been encountered. Many Shields were killed and the ship was virtually destroyed. When it was all over, my ancestors were in the same shape as yours. Marooned on Windarra. No one on the home planet of Talis had any way of knowing where or how we had disappeared. As far as they were concerned we were missing in action. No one came looking for us.\"\n \"It seems to me,\" Sariana said softly, \"that there was a major difference between the situation your ancestors faced and the one the colonists faced. The colonists, at least, had arrived at their intended destination. They had come here prepared to create a home world for themselves. Your people had no such intention. They were truly shipwrecked.\"\n Gryph saw the understanding in her eyes and a rush of relief went through him. Her natural empathy\n was going to be his salvation. \"Initially my ancestors assumed there would be no second generation of Shields. The odds were against finding suitable mates among this strange group of humans. They faced the fact that they would die in exile and there would be no offspring.\"\n \"But some of the stranded Shields found wives among the First Generation colonists.\" \"Yes. Your people were grateful to ours. But they were also bound by a very rigid social structure. If\n my people were to survive, they had to create a legitimate place for themselves within that structure.\"\n \"Hence the First Generation Pact was negotiated.\"\n \"And we have abided by the terms of the Pact,\" be stated proudly.\n \"Tell me something. What makes the Avylyns\u0027 precious cutter Shield business?\" Sariana asked abruptly.\n Startled by the change in subject, Gryph frowned. He wondered why she wasn\u0027t asking him more detailed questions about his people. \"The cutter wasn\u0027t stolen by a rival jewelers\u0027 clan, Sariana. And if someone didn\u0027t need it to make prisma jewelry, there\u0027s only one other use for it.\"\n \"To cut prisma.\"\n \"Exactly. That means another crystal ship has been found. But there is something else that bothers me even more than that.\"\n She gave him a curious glance. \"What is that?\"\n \"Everyone in the western provinces knows the danger of the crystal ships. The last thing any sane or even any crazy westerner would do is try to get into one on his own.\" Gryph drew in a deep breath. \"But it\u0027s just barely possible an insane Shield might attempt it.\"\n Sariana\u0027s eyes widened. \"Why?\"\n \"Because a Shield is the only one who would know that it\u0027s theoretically possible to do something else besides jam the crystal frequencies and destroy the weapons on board the ships.\"\n \"What else can be done, Glyph?\"\n \"Some of my people have speculated that it\u0027s just barely possible a Shield could manipulate the light frequencies of the crystal instead of jamming them. And if he could manipulate them, he might possibly be able to control the weapons.\"\n Sariana stared at him. \"He could use them? Turn them against others?\"\n \"It\u0027s only a theory, Sariana. It\u0027s never been attempted, at least as far as we know. Certainly it hasn\u0027t been tried on Windarra. We Shields have been extremely careful to keep the theory to ourselves. No outsider has ever been told.\"\n \"I\u0027m an outsider, aren\u0027t I?\" she challenged.\n \"No,\" Gryph said. \"Not any longer. You\u0027re a Shield-mate. My Shieldmate. You are entitled to know the secrets of my social class.\"\n \"Even if I\u0027d rather not know them?\" She looked wistfully out across the river. \"You\u0027re the kind of woman who ultimately prefers to face facts. You may waste a lot of energy trying\n to bend those facts to suit your fancy, but eventually you do face them. This secret I am telling you is a fact. And it\u0027s a fact that a rogue Shield may have stolen the cutter because he\u0027s discovered a crystal ship and has decided to see if he can get inside to control the power of the weapons for his own purposes.\" \n","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-65.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: \n Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?\n \n","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
