{"id":81088,"no":69,"title":"Page 69","content":"buckle lay in his palm. Holding it in one hand, Gryph opened his weapon kit and withdrew a tiny vapor lamp. He thumbed a switch and a narrow beam of light revealed the intricacies of the buckle. Gryph studied it for a very long time, apparently fascinated. When he glanced up finally, it was difficult to read his shadowed gaze.\n \"It\u0027s beautiful.\" His voice was rough and strangely husky. \"Thank you, Sariana.\"\n \"I bought it at the fair.\"\n \"I stopped there to buy something for you, too. That\u0027s how I happened to be close enough to realize you were in trouble. With so much going on yesterday and today, I forgot to give it to you.\" He reached into a pocket and withdrew a tiny package. \"It\u0027s not much. After living with the Avylyns for a year you\u0027re\n probably accustomed to fancier jewelry.\"\n She was amazed by his diffidence. It was so uncharacteristic of Gryph. Sariana was amazed too, by her own reaction to the gift he was handing her. She was thrilled. When she unwrapped the cloak pin she thought it was the most beautiful pin she had ever seen in her whole life.\n \"Thank you, Gryph. It\u0027s really very lovely.\" She thrust it at once into a fold of her cloak. The scarlet-toe peered over the edge of her shoulder and studied the pin with idle interest. Then it went back to dozing.\n Gryph switched off the tiny vapor lamp and he and Sar-iana stood looking at each other in the moonlight.\n \"You\u0027ll be careful tomorrow?\" Sariana asked. \"I\u0027ll be careful.\"\n \"Maybe I should come with you,\" she suggested.\n \"Absolutely out of the question. You\u0027ve already been in too much danger because of this mess. I won\u0027t expose you to any more risk. I\u0027m going to make certain you\u0027re well hidden tomorrow.\"\n She heard the finality in his tone and knew this wasn\u0027t the time to argue. \"What an arrogant man you are.\"\n His smile was whimsical. \"Does that mean you\u0027ve decided I do qualify as a man, after all?\" She felt a pang of guilt as she realized he\u0027d taken her provoking words seriously. \"I only said those\n things because I was very, very annoyed with you.\"\n \"And because when you get annoyed you get even more mouthy than usual.\" He reached out to pull her closer. The soft night breeze wrapped her skirts aroiud his legs. \"Lucky for you I\u0027m such an understanding man, hmm?\"\n \"Lucky for me you\u0027re a man, period. Any kind of man at all,\" she whispered against his shirt. He laughed softly into her hair. \"Why is that?\"\n \"Because I\u0027ve fallen in love with you, Gryph.\"\n He froze. Then his hands caught and held her face so that he could look down at her in the moonlight. His expression was stark and searching. \"Sariana?\"\n \"Let\u0027s not talk about it,\" she said, her fingertips sliding upward into his hair. \"There is so little time before morning.\"\n \"But, Sariana - \" \"Hold me, Gryph.\"\n His arms enfolded her with an urgency that swamped everything else.\n At dawn the next morning Gryph woke Sariana and gave her a few terse instructions. He told her she was safe in the shelter of the cove and if something happened to him, she could use the river sled to make her way back to Little Chance. There she was to go straight to Delek\u0027s house. Gryph made Sariana repeat the directions to his friend\u0027s home twice to make sure she had them.\n \"With any luck, I\u0027ll locate the ship this afternoon,\" he told her crisply as he finished checking his weapon kit. \"I\u0027ll go in tonight for a closer look. Then I\u0027ll decide if I\u0027ll try to destroy it on my own or wait for Delek and the others. One way or another I\u0027ll be back tomorrow morning.\"\n \"I don\u0027t like it,\" Sariana said.\n He smiled at that. \"You rarely do approve of any of my suggestions, lady.\" \"You don\u0027t give suggestions. You give commands.\"\n \"I just want you to be as safe as possible.\"\n \"I know,\" she said with a cheeky grin. \"The fact that I can sense your intentions are well meant is the only reason I even listen to you at times like this.\"\n Gryph raised his eyes to the strip of dawn sky overhead. \"Save me from empathic females.\" He picked up a blade bow and handed it to her. \"Pay attention, Sariana. I\u0027m going to leave this behind with you, it\u0027s\n a good, all-purpose weapon and it can also be a useful tool. See all these different blades?\"\n Sariana studied the small quiver of blades. Each was a slightly different shape. Many had attachments such as tiny ropes or nets that were cleverly bound to the shaft of the blade. The specialized attachments unfurled or uncoiled or snapped into position when the blade was fired.\n \"What about them?\"\n \"You slide the one you want into firing position like this.\" Gryph demonstrated with cool precision. \"You fire it by releasing this trigger.\"\n \"Clever,\" Sariana said dryly.\n \"Sure. That goes without saying. It was invented by a westerner.\"\n He gave her one last, hard kiss and then he walked out of the cove without glancing back. He pushed all the hot memories of the previous night out of his mind, including Sariana\u0027s soft declaration of love. He had to keep his mind on his task or both of them and much of the populace of the western continent might wind up paying with their lives.\n He would deal with the issue of love later. Gryph made good time through the gorge. He walked swiftly along the river\u0027s edge. His fingers played on the prisma lock and in his mind he focused on the rays of light beyond the visible range that Sariana had helped him pick up last night. He kept a small portion of his awareness fixed on his surroundings. It would be stupid to become some hawkbeetle\u0027s dinner at this stage.\n The pulsing beam of invisible light that was peculiar to live prisma was clear in his mind now. It was beyond the range of human eyesight, but through some poorly understood process, it could be channeled through another bit of prisma. When that happened, a receptive, tuned mind could pick it up.\n Gryph had practiced long and hard as a boy learning how to focus, channel and control his awareness so that the strange prisma rays could be detected and tracked.\n That had been only the initial part of his training. The other half had consisted of learning how to tune his mind to the frequency of the emitting beam of light and jam it.\n The theoretical middle ground which no Shield had ever attempted as far as Gryph\u0027s people knew was to tune into the frequency of live prisma and resonate with it. It would be difficult to do, but once the frequency was under a man\u0027s control, he just might be able to stabilize it to the point where he could detonate the weapons in a deliberate, controlled manner.\n It was far more likely such an experiment would result in wiping out everything and everyone in the vicinity, including the crazy Shield working the prisma. \n","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-69.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: \n Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?\n \n","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
