{"id":81095,"no":78,"title":"Page 78","content":"Sariana drummed her fingers on the metal table. \"Was the second try in Little Chance?\" Rakken nodded. \"Ah, yes. The House of Reflections fiasco. I must admit, that was a last minute plan put together with local talent who proved most unreliable. But we couldn\u0027t just pick you up off the streets of Little Chance in broad daylight. When you headed for the fairgrounds we improvised. The attendant was paid well to look the other way while an elaborate joke was played on a visiting eastern tourist. It was easy to find three young toughs who were more than willing to terrorize said tourist. The goal was to frighten you witless and then drive you to a certain corner of the house. There\u0027s a hidden exit there. I had a man waiting to snatch you and bundle you off through the back gates of the fairgrounds. But once again you slipped through my fingers, Sariana.\" \"By then you knew we were on the trail of the cutter and you reasoned we would head for the gorge,\" Gryph said slowly. \"It was a logical assumption. Targyn and I decided that the easiest thing to do next was sit back and wait until you found us. Which you obligingly did very eariy this morning.\" Rakken peered intently at Gryph. \"Tell me the truth. Can you kill Targyn?\" \"Maybe. If I had my weapon kit.\" Rakken looked thoughtful. \"If you fail, he\u0027ll turn on me. Ours is a very precarious partnership, to say the least.\" \"What makes you think I won\u0027t turn on you if I\u0027m successful?\" Rakken glanced at Sariana. \"As long as I have her, you\u0027ll behave yourself.\" Sariana spoke. \"I think I\u0027m getting a bit tired of being used by everyone concerned in this mess.\" Rakken smiled thinly. \"Don\u0027t worry, my dear. I am a reasonable man. Once Targyn is out of the way I will be more than willing to discuss the financial aspects of our new relationship.\" Sariana tilted her head, her expression intently curious. \"You\u0027re willing to cut us in on the prisma deal?\" \"I would much rather do business with you than hold you hostage, Sariana.\" Rakken gave her a level glance. \"I know you very well. More than that, I know your background. I was raised under similar circumstances. You have been trained to think in terms of finances and good business policy since you were in the cradle. One year of living in Serendipity hasn\u0027t changed you in that regard. I think you will be very interested in negotiating with me for your cut. Am I right?\" Sariana lifted one shoulder negligently and reached for her wine. \"You\u0027re probably right, Etion.\" Only the restraint of the twist kept Gryph from launching himself across the table at Rakken. The other man wasn\u0027t even bothering to seduce Sariana with promises of love and passion. Rakken was too shrewd for that. He was using the one thing guaranteed to make any easterner pay attention: The promise of big business profits. Gryph was so full of anger that couldn\u0027t be released he almost didn\u0027t catch the stray, calming thought that wafted through his brain. Then he recognized the source of the soothing sensation. Sariana was telling him to relax. \"Well?\" Rakken asked with quiet satisfaction as he scanned the faces of his prisoners. \"Do we have an understanding? Gryph will take care of poor, unstable Targyn and then neutralize the ship. Afterward we will cut up the prisma, split it three ways and make our fortunes.\" \"What about Targyn\u0027s men?\" Sariana asked. \"Miscroft and the others?\" \"There are only three,\" Rakken said. \"And to be honest, none of them are very bright. They follow Targyn\u0027s orders because he has promised them great wealth. But with him out of the way they should be easy meat for a Shield.\" Sariana stared at him. \"You expect Gryph to kill all four of them? Targyn included?\" \"Why not? It\u0027s what he\u0027s good at, isn\u0027t it?\" Rakken asked blandly. \"You forget, my dear, that Chassyn and the other Shields make their living fighting border bandits. Bandit disposal is their specialty, and I have it on good authority that they are very skilled at their job. You have only seen your quasi-husband in the sophisticated social context of a city. But that is not his natural habitat. Don\u0027t worry. Targyn is his only real problem. Taking care of Miscroft and the others will be nothing more than a mopping up operation for him. But if it makes you feel more secure, rest assured, I am not unarmed myself. I have a blade bow and I can use it. I\u0027m not foolish enough to think I can take Targyn by surprise, but if Chassyn runs into trouble with any of the three bandits, I should be able to help him out.\" The tension that gripped Sariana was almost palpable. Gryph could feel the violent anger and denial vibrating in her. But her voice was steady when she spoke to Rakken. \"Why haven\u0027t you killed Targyn yourself, Etion? You must have had plenty of opportunity.\" Rakken cnuckled but there was no humor in the sound. \"If you believe a banker who has had no formal experience in hand-to-hand combat or any other kind of fighting can successfully take on a professionally armed Shield, you are very naive, Sariana. You still don\u0027t seem to realize just how skilled at violence these men are. Chassyn is every bit as dangerous to me as Targyn is. But at least with Chassyn I have some control.\" \"Me.\" \"You,\" he agreed. \"And a business arrangement. It\u0027s said Shields honor their word. Sane Shields, at any rate. Wi\u0027ll leave poor Targyn out of this. One can\u0027t do business with an insane man.\" \"I suggest we get back to the main business at hand,\" Gryph said roughly. He wasn\u0027t picking up anything at all from Sariana now. She had shut down her mind as surely as if she had turned off a switch. \"Speaking of business,\" Rakken said easily, \"there is one other point I would like to discuss before we conclude our little planning session.\" \"What?\" Gryph asked. \"I would like Sariana to open your weapon kit for me.\" Rakken got to his feet and walked across the room to open another hidden panel in the wall. Gryph\u0027s weapon kit sat on a shelf. Rakken picked it up and returned to the table. He placed the kit in front of Sariana who sat staring at it as if it were an alien bug. Gryph ran through all the possibilities inherent in the situation in a split second and came to his decision. With all the power he could muster he sent the image of a palm blade in its sheath into Sariana\u0027s head. Sariana trembled a little as she sat looking at the kit, but she didn\u0027t give any indication she had caught his silent message. She seemed lost in her own thoughts. Gryph concentrated on projecting the message. Along with the image of the small, sharp blade, be sent a picture of how it could be picked up unnoticed and hidden in her palm. Sariana had no training in such things, but she just might be able to pull it off if Gryph provided some cover for her at the right moment. Rakken\u0027s heavy consumption of wine should have the effect of making the man less than keenly observant.","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-78.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
