{"id":81106,"no":89,"title":"Page 89","content":"\"And you\u0027re going to show us the difference, right?\"\n \"As I said, this could be your lucky day.\"\n Before Gryph could think of an appropriate response there was a crackle of underbrush behind him. Sariana jumped in startled surprise as Etion Rakken, looking quite tattered and unkempt, made his way slowly down to the shoreline. But Gryph greeted the banker\u0027s arrival with resignation.\n \"Hello, Rakken. I wondered how long it would take before you stumbled out into the open. When I realized you\u0027d gotten past the traps back at the caverns, I figured you\u0027d probably joined forces with Miscroft to escape. You have a nasty habit of working with inferior craftsmen.\" Gryph indicated the gasping bandit at his feet.\n Rakken tried to straighten his clothing. Then he held up his hand in a placating gesture. \"Sorry about that little scene on the sled just now. It was Miscroft\u0027s idea. He thought he could take you in your sleep and thus ensure that the Shields never find out about all that prisma. I told him it would never work, but who can reason with a bandit?\" He turned to Sariana. \"I\u0027ve been listening to what you\u0027ve been saying, Sariana. Do you think you could use some expert banking advice?\"\n Gryph swore softly as he watched the other two regard each other with intent interest. He scowled at his wife and then at Rakken. \"I\u0027ll say one thing for you easterners, you never stop dealing.\"\n The next day Gryph and his small party arrived in Little Chance to find a contingent of Shields waiting for them at Delek\u0027s house. Delek himself limped happily out to welcome his friend.\n \"I just got back with the others,\" he explained. \"We were making preparations to set out after you.\" Gryph displayed his teeth in a fierce, elated grin. \"I\u0027m very glad to see you, Delek. I have much to tell\n you. But I think that first I had better introduce you to my wife. She has a few suggestions to make on the subject of dealing prisma.\"\n Delek cocked an eyebrow. \"Do we have a lot of it to deal?\"\n Gryph slapped his friend on the back and reached for his wife\u0027s hand. \"Let\u0027s go inside,\" he said to Delek. \"I want to tell you the revised, updated version of the legend of Targyn the Bandit Hunter.\"\n \"You know me,\" Delek said easily, \"I love a good story.\"\n Seven months later Sariana looked up from a pile of papers on her desk and smiled brightly as her husband strode into her office. He had her winter cloak over his arm. Her warm, laughing, loving smile had no impact whatsoever on his forbidding expression. Gryph glanced pointedly at the timepiece on her desk.\n \"I thought we agreed that you would only work half days from now until the baby arrives, Sariana. Damn it, I have to watch you every minute. This pregnancy has been twice as much work for me as it has for you. I\u0027m the one who has to remind you to take your tonic in the mornings. I\u0027m the one who has to be responsible for getting you to your monthly checkups with the medic. I\u0027m the one who had to make the appointment with the dressmaker so you\u0027d have something to wear during these last few months. And I\u0027m the one who has to make certain you don\u0027t work too hard.\"\n \"It\u0027s all right, Gryph, you\u0027re doing an excellent job on all accounts. You are very good at handling responsibility. You thrive on it, in fact.\" The lizard perched on her shoulder showed its teeth to Gryph in a taunting grin.\n Gryph ignored Lucky. An understandable reaction as the lizard invariably sided with Sariana. Instead, he slung Sariana\u0027s cloak into a chair and walked across the chamber to plant both hands on the circular desk. \"None of your sass, lady. It\u0027s lunchtime and you\u0027re supposed to stop work for the day. I\u0027m taking you out to a meal.\"\n Sariana surrendered to the inevitable and stood up. Her rounded stomach was elegantly draped in the folds of a yellow velvet business dress. At least, Gryph had told her it was a business gown. Sariana still had her doubts. The lace trimmings at the collar and on the cuffs of the gown were subdued by western standards, but still seemed quite decorative to Sariana\u0027s eyes, especially for an office setting.\n But she could hardly complain. When the dressmaker had arrived for the fittings of the maternity gowns, Sariana had been too busy to take much time for making decisions about clothing. As a result, Gryph had ended up making most of the decisions. Sariana\u0027s new wardrobe was a great deal more colorful than her old one.\n Gryph took her arm as she came out from behind the desk. His eyes strayed possessively over her pregnant figure. \"How are you feeling?\" he demanded tenderly as he wrapped her carefully in her winter cloak. Lucky scrambled to find a pocket. They left Sariana\u0027s office and headed toward the front door of the villa they had recently purchased.\n \"Just fine.\"\n \"How about your br**sts? Still tender?\"\n Sariana blushed and glanced around quickly to see if any of the household attendants had overheard. \"For the sake of the Ship, Gryph, keep your voice down.\"\n He paid no attention. \"I was worried after what happened last night. You should have told me they were tender.\"\n She glared at him. \"I enjoyed what happened last night. Now stop worrying about it.\" \"I hurt you.\"\n \"No you didn\u0027t.\"\n Glyph rounded on her, his voice rising in volume. \"Ha! Don\u0027t try to tell me I didn\u0027t hurt you when I kissed your br**sts last night. I was there, remember? I felt it.\"\n \"You wouldn\u0027t have felt it if I\u0027d had some warning,\" Sariana muttered. \"You took me by surprise, that\u0027s all.\" It was the truth. She hadn\u0027t been prepared for the unexpected discomfort of her swollen br**sts and had therefore been unable to stop herself from projecting it to Gryph along with everything else she was feeling at the time. Then she hid a small grin as she remembered the exquisitely tender lovemaking of the night.\n She had been deliciously aroused, thoroughly involved in the emotional, mental and physical exchange of passion. Gryph had been trying very hard to be very gentle as he always was of late. When he had lowered his head to kiss her br**sts, he had intended only the lightest of caresses.\n But Sariana\u0027s taut, full br**sts had proven almost unbearably sensitive. Gryph had lightly set his teeth around one tight nipple and Sariana had nearly gone through the roof.\n And, of course, because they were intimately, passionately linked at the time, she had nearly taken Gryph with her.\n Gryph\u0027s startled reaction had been much greater than her own as the sweet pain had translated itself into his mind. He\u0027d yelped and leaped off the bed, sending it into a wide swing. Then he\u0027d started making plans to call a medic in the middle of the night. Sariana had been laughing so hard she had nearly fallen out of the swinging bed. Gryph had not seen the humor in the situation. \n","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-89.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: \n Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?\n \n","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
