{"id":81107,"no":90,"title":"Page 90","content":"When he\u0027d finally climbed back into bed, his body still heavy with his arousal, he had made her pay for the earlier incident. He\u0027d grinned wickedly and sprawled on his back, arms folded behind his head.\n \"We won\u0027t take any chances this time,\" he\u0027d stated in a low, sexy voice. \"You can do all the work. I\u0027ll just lie back and enjoy it.\"\n Sariana had obliged with a willing, loving heart. Within minutes the lightstorm that always flared between them had reignited itself. Together they had hunted wild, flaming prisma, chasing colors and shades of light that had no names.\n \"What about your back?\" Gryph asked as he opened the front door for her and guided her out onto the street. \"Any aches? The medic warned me you might have some discomfort there.\"\n \"If I do you\u0027ll be the first to know,\" Sariana said with a teasing grin. \"Just as you were the first to know when I started having morning sickness.\"\n He winced. \"Don\u0027t remind me. At least we\u0027re long past the morning sickness stage.\"\n Sariana chuckled, remembering that unpleasant string of days just after she had realized she was pregnant. She had been miserable and on a few occasions she had been so ill she had unconsciously projected the queasiness to Gryph, who had borne it stoically. Sariana smiled at the memory and patted her tummy. \"Junior is doing just fine, thank you. And so am I.\"\n Gryph shook his head as he steered her toward a neighborhood cafe. There was still some snow on the ground, but not on the sidewalks. Last year one of the construction clans had developed a new device for keeping the pathways clear. The town council had adopted it at once. One of the eastern clans was negotiating to buy the invention.\n \"You\u0027ve got to start taking it easy, Sariana. You\u0027ve been working much too hard these past few months. I can see I\u0027m going to have to be firmer with you. There will be plenty of time after the boy is born for you to implement your grand plans and schemes.\"\n \"It\u0027s just that they\u0027re all coming along so nicely and I\u0027m so excited by them.\" Gryph\u0027s mouth curved wryly. \"You\u0027ve turned the whole Shield class upside down. Not to mention\n what that process has done to the rest of the western classes.\"\n \"The wonderful thing about working with westerners is that they\u0027re so adaptable,\" Sariana said with satisfaction.\n When she had made it known that the Shield class had recently discovered a sizable cache of prisma and would be putting it on the market in controlled amounts, the representatives of virtually all the jewelers\u0027 clans had shown up on her doorstep the following day. The Avylyns had, of course, been first in line.\n Since then, Sariana had been systematically investing the profits on behalf of the entire Shield class. The members of the class had been highly skeptical about turning their business affairs over to a woman, and an easterner at that. No one remembered any Shield ever having done any sophisticated investing. Selling prisma had always been a simple, straightforward process, rather like killing bandits.\n But the Shields had paid attention to Sariana. Her position as Gryph\u0027s wife guaranteed her a hearing and she had found plenty of support among the other wives. Most of them remembered well the pleasures of town living. Even the most devoted among them could see the advantages of increased contact with the more sophisticated world they had left behind. The wives were also very open to the notion of providing more career options for their sons than their husbands had had. Women married to warriors tended to worry a lot.\n When Gryph and Sariana reached the cafe they hurried into the cherry warmth. The proprietor recognized them and greeted them enthusiastically.\n \"This way, my lord and lady. I have your usual table waiting. A bit chilly today, isn\u0027t it?\" \"It is,\" Gryph agreed. \"My wife will have some of the kalala fish stew, Myrig. The medic says it\u0027s very\n good for pregnant ladies. I\u0027ll have my usual.\"\n Sariana, who had been thinking of having a salad and baked fish for a change, wrinkled her nose but made no protest. When it came to having babies, Gryph had decided he was an authority.\n \"How\u0027s business?\" Sariana asked cheerfully as the cafe proprietor scurried off to place the orders with his cook.\n Gryph lounged back in his suspended chair and smiled in satisfaction. \"Business is booming, as you well know. It looks like I\u0027ll be hiring a couple more men next week.\"\n \"I told you there was a market for an agency specializing in private investigative services, security guards and escorts for people who need to travel to the frontier towns.\"\n Gryph chuckled. \"You were right.\"\n \"This kind of work is the perfect transition craft for a Shield. It allows him and his clan to live in town if he wishes. His sons can go to school with the children of other classes and learn to move comfortably in society. When the time comes, those same sons will have a much broader range of acquaintances from which to choose mates. And they\u0027ll also be a lot more acceptable as husbands to families who fear losing a daughter to the frontier. Eventually, as the Shields learn the ins and outs of investments, they\u0027ll make all kinds of social inroads. In the long run money is a lot more useful than a blade bow or a knife.\"\n Gryph shrugged. \"We\u0027ll see what happens. You\u0027ve made one hell of a start on singlehandedly changing\n a whole social system, I\u0027ll say that for you.\"\n \"The whole social class system on both continents is undergoing a lot of change and restructuring. The old inflexible rules set down by the social philosophers who sent us here never did hold as well as those planners would have liked. Nothing stays static. Trust me. Things are going to be different around here in the coming years. I\u0027m going to help make sure that our class doesn\u0027t get left behind in the dust.\"\n \"It isn\u0027t a question of trusting you, it\u0027s a question of keeping up with you, my love. Wait until your parents see what you\u0027ve accomplished during your so-called exile here.\"\n \"We\u0027ll find out soon enough, won\u0027t we?\" she retorted with a grin. \"They\u0027re due to arrive next week.\"\n \"Worried about how they\u0027ll react to your new husband?\"\n \"No.\" Sariana smiled. \"My new husband is getting rich fast, and as I have tried to explain on countless occasions, easterners have a built-in respect for anyone who controls wealth.\"\n \"You certainly didn\u0027t have to worry about your welcome from my family, did you? When my folks took one look at you and realized you were pregnant, they adopted you instantly into the clan.\"\n \"I think both your parents and mine tend to be pragmatic about certain things. Oh, that reminds me,\" Sariana said, \"would you mind very much if we had a little girl instead of a little boy?\" \n","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-90.html","bookId":1801,"book":{"id":1801,"title":"Shield\u0027s Lady (Lost Colony #3)","description":"Storyline: \n Sarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?\n \n","cover":"https://allnovel.net/images/shield-s-lady-lost-colony-3.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shield-s-lady-lost-colony-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:30:29 PM"}}
