{"id":30176,"no":36,"title":"Chapter 35","content":"The inside of Gare Saint-Lazare looked like every other train station in Europe, a gaping indoor-outdoor cavern dotted with the usual suspects—homeless men holding cardboard signs, collectionsof bleary-eyed college kids sleeping on backpacks and zoning out to their portable MP3 players,and clusters of blue-clad baggage porters smoking cigarettes.\\n\\n 　　Sophie raised her eyes to the enormous departure board overhead. The black and white tabsreshuffled, ruffling downward as the information refreshed. When the update was finished,Langdon eyed the offerings. The topmost listing read: LYON—RAPIDE—3:06\"I wish it left sooner,\" Sophie said, \"but Lyon will have to do.\" Sooner? Langdon checked hiswatch 2:59 A.M. The train left in seven minutes and they didn\u0027t even have tickets yet.\\n\\n 　　Sophie guided Langdon toward the ticket window and said, \"Buy us two tickets with your creditcard.\"\"I thought credit card usage could be traced by—\"\"Exactly.\"Langdon decided to stop trying to keep ahead of Sophie Neveu. Using his Visa card, he purchasedtwo coach tickets to Lyon and handed them to Sophie.\\n\\n 　　Sophie guided him out toward the tracks, where a familiar tone chimed overhead and a P.A.\\n\\n 　　announcer gave the final boarding call for Lyon. Sixteen separate tracks spread out before them. Inthe distance to the right, at quay three, the train to Lyon was belching and wheezing in preparationfor departure, but Sophie already had her arm through Langdon\u0027s and was guiding him in the exactopposite direction. They hurried through a side lobby, past an all-night cafe, and finally out a sidedoor onto a quiet street on the west side of the station.\\n\\n 　　A lone taxi sat idling by the doorway.\\n\\n 　　The driver saw Sophie and flicked his lights.\\n\\n 　　Sophie jumped in the back seat. Langdon got in after her.\\n\\n 　　As the taxi pulled away from station, Sophie took out their newly purchased train tickets and torethem up.\\n\\n 　　Langdon sighed. Seventy dollars well spent.\\n\\n 　　It was not until their taxi had settled into a monotonous northbound hum on Rue de Clichy thatLangdon felt they\u0027d actually escaped. Out the window to his right, he could see Montmartre and thebeautiful dome of Sacré-Coeur. The image was interrupted by the flash of police lights sailing pastthem in the opposite direction.\\n\\n 　　Langdon and Sophie ducked down as the sirens faded.\\n\\n 　　Sophie had told the cab driver simply to head out of the city, and from her firmly set jaw, Langdonsensed she was trying to figure out their next move.\\n\\n 　　Langdon examined the cruciform key again, holding it to the window, bringing it close to his eyesin an effort to find any markings on it that might indicate where the key had been made. In theintermittent glow of passing streetlights, he saw no markings except the Priory seal.\\n\\n 　　\"It doesn\u0027t make sense,\" he finally said.\\n\\n 　　\"Which part?\"\"That your grandfather would go to so much trouble to give you a key that you wouldn\u0027t knowwhat to do with.\"\"I agree.\"\"Are you sure he didn\u0027t write anything else on the back of the painting?\"\"I searched the whole area. This is all there was. This key, wedged behind the painting. I saw thePriory seal, stuck the key in my pocket, then we left.\"Langdon frowned, peering now at the blunt end of the triangular shaft. Nothing. Squinting, hebrought the key close to his eyes and examined the rim of the head. Nothing there either. \"I thinkthis key was cleaned recently.\"\"Why?\"\"It smells like rubbing alcohol.\"She turned. \"I\u0027m sorry?\"\"It smells like somebody polished it with a cleaner.\" Langdon held the key to his nose and sniffed.\\n\\n 　　\"It\u0027s stronger on the other side.\" He flipped it over. \"Yes, it\u0027s alcohol-based, like it\u0027s been buffedwith a cleaner or—\" Langdon stopped.\\n\\n 　　\"What?\"He angled the key to the light and looked at the smooth surface on the broad arm of the cross. Itseemed to shimmer in places... like it was wet. \"How well did you look at the back of this keybefore you put it in your pocket?\"\"What? Not well. I was in a hurry.\"Langdon turned to her. \"Do you still have the black light?\"Sophie reached in her pocket and produced the UV penlight. Langdon took it and switched it on,shining the beam on the back of the key.\\n\\n 　　The back luminesced instantly. There was writing there. In penmanship that was hurried butlegible.\\n\\n 　　\"Well,\" Langdon said, smiling. \"I guess we know what the alcohol smell was.\"Sophie stared in amazement at the purple writing on the back of the key.\\n\\n 　　24 Rue HaxoAn address! My grandfather wrote down an address!\\n\\n 　　\"Where is this?\" Langdon asked.\\n\\n 　　Sophie had no idea. Facing front again, she leaned forward and excitedly asked the driver,\"Connaissez-vous la Rue Haxo?\"The driver thought a moment and then nodded. He told Sophie it was out near the tennis stadiumon the western outskirts of Paris. She asked him to take them there immediately.\\n\\n 　　\"Fastest route is through Bois de Boulogne,\" the driver told her in French. \"Is that okay?\"Sophie frowned. She could think of far less scandalous routes, but tonight she was not going to bepicky. \"Oui.\" We can shock the visiting American.\\n\\n 　　Sophie looked back at the key and wondered what they would possibly find at 24 Rue Haxo. Achurch? Some kind of Priory headquarters?\\n\\n 　　Her mind filled again with images of the secret ritual she had witnessed in the basement grotto tenyears ago, and she heaved a long sigh. \"Robert, I have a lot of things to tell you.\" She paused,locking eyes with him as the taxi raced westward. \"But first I want you to tell me everything youknow about this Priory of Sion.\"\\n\\n 圣拉查尔火车站和其他的欧洲火车站没有什么两样，一个装着大门的洞里散布着犯罪嫌疑人--无家可归者举着硬纸板，枕在背包上的睡眼朦胧的学生听着MP3，还有一群群身穿蓝色制服的行李搬运工在抽烟。\\n\\n 索菲抬头看了看那块巨大的列车时刻牌。那白底黑字的表单一直在刷新。当最新的信息显示在表单上的时候，兰登举目搜寻可供选择的车次。表单的最上方写着：利立--特快--3：06\"我希望它可以早点儿开。\"索菲说。\"但那是到利立的最早一班车了。\"\\n\\n 早点儿开？兰登看了看表--2：59A.M.还有七分钟车就要开了，可他们还没有买票。\\n\\n 索菲把兰登带到购票窗口前，说道。\"用你的信用卡买两张票。\"\\n\\n \"我想使用信用卡会为警察的追捕提供线索--\"\\n\\n \"一点儿不错。\"\\n\\n 兰登已决定不在索菲。奈芙面前显示聪明了。他用Visa 卡买了两张去利立的车票交给索菲。\\n\\n 索菲将兰登领向站台。站台上响起了熟悉的报时声，闭路广播中播报着开往利立的特快即将发车的消息。他们眼前横着十六条铁轨。在远处右边的三号站台旁，开往利立的特快正喷着蒸汽，准备出发。但是，索菲却挎着兰登的胳膊，领着他往相反的方向走。他们匆匆地穿过一条边廊，经过一个通宵营业的餐厅，最后从边门出站，来到了车站西侧一条僻静的街道上。\\n\\n 一辆出租车在门口等候着。\\n\\n 司机看见索菲，打亮了车灯。\\n\\n 索菲跳上车的后排座位，兰登也随后钻进车内。\\n\\n 出租车离开了车站，索菲拿出新买的车票，把它们撕得粉碎。\\n\\n 兰登感叹道，七十美元花得真是地方。\\n\\n 出租车开始在克里希街上平稳而单调地行驶，兰登这才感觉他们真正逃脱了追捕。透过右边的车窗，他可以看见蒙马特高地和圣心堂美丽的圆形屋顶。忽闪着的警灯打破这美丽的画卷，几辆警车正朝着相反方向驶去。\\n\\n 索菲和兰登低下身，直到警报声渐渐消失。\\n\\n 索菲只告诉司机把他们送出城。兰登见她抿着嘴，知道她正在考虑下一步行动。\\n\\n 兰登将那把十字形的钥匙举到窗边，再次端详，试图找到产地的标记。路灯向车内投来忽闪忽闪的光亮，除了那隐修会的标志，兰登什么也没有发现。\\n\\n \"这不合常理。\"最后，他说道。\\n\\n \"为什么？\"\\n\\n \"你祖父想方设法地把钥匙留给你，而你却不知道这把钥匙的用途。\"\\n\\n \"是呀。\"\\n\\n \"你肯定他没有在画背后留下其他什么信息？\"\\n\\n \"我查看过了，就发现了这个。这把钥匙是嵌在画框上的。我看见了上面的图案，把它放进了口袋，然后我们就离开了那间展厅。\"兰登皱着眉头，端详着三角形的钥匙尖。他又斜着眼睛打量了一下钥匙柄的边缘。还是没有发现什么。\"我想这把钥匙最近被清洗过。\"\\n\\n \"为什么？\"\\n\\n \"它闻上去像被酒精擦拭过。\"\\n\\n 索菲扭过头：\"对不起，你说什么？\"\\n\\n \"它闻上去像被用清洁剂擦洗过。\"兰登把钥匙放到鼻子前面嗅了嗅。\"另外一面味道更浓。\"他把钥匙翻转过来。\"是的，有股酒精的味道，就像被用清洁剂擦洗过或者--\"兰登愣了一下。\\n\\n \"或者什么？\"\\n\\n 兰登在灯光下转动着钥匙，端详着十字形较宽的那条边。那上面有些闪亮的地方……\\n\\n 就像被弄湿了一样。\"你在把它放入口袋前仔细看过朝匙的背面吗？\"\\n\\n \"什么？没有仔细看。太匆忙了。\"\\n\\n 兰登把头转向索菲：\"你还带着紫外线灯吗？\"\\n\\n 索菲将手伸进口袋，掏出了紫外线灯。兰登接过灯，打开开关，照了照钥匙背面十字形较宽的那条边。\\n\\n 在紫外线灯的照射下，钥匙背面立即显现出了文字。那文字匆匆写就，但仍可以辨认。\\n\\n 豪克斯街24 号地址！祖父留下了一个地址！\\n\\n \"是什么地方？\"兰登问。\\n\\n 索菲也不知道。她转向司机，身体前倾，兴奋地问：\"您知道豪克斯街吗？\"\\n\\n 司机想了想，点点头。他告诉索菲那条街位于巴黎西郊网球馆附近。索菲让他立即开到那里去。\\n\\n \"要走最快的路，就得穿过布劳涅森林。\"司机用法语问道。\"行吗？\"\\n\\n 索菲皱了皱眉头。她可以想到其他走法来取代那条讨厌的路线，但今晚她不想很挑剔。\\n\\n \"好的。\"我们可以让这位美国的来访者大吃一惊。\\n\\n 她又看了看那把钥匙，猜想着他们会在豪克斯街24 号发现些什么。一个教堂？隐修会的总部？\\n\\n 她又回想起十年前自己在地下洞室目睹的那个秘密仪式，长长地叹了口气。\"罗伯特，我有很多事要告诉你。\"她顿了顿，看着兰登。这时出租车开始向西行驶。\"但首先，请把你对郇山隐修会的了解全部告诉我。\"\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/100/8588.html","bookId":473,"book":{"id":473,"title":"The Da Vinci Code达芬奇密码","description":"简介： The Da Vinci Code is a 2003 mystery-detective fiction novel written by American author, Dan Brown. It follows symbologist Robert Langdon and Sophie Neveu as they investigate a murder in Paris\u0027s Louvre Museum and discover a battle between the Prio...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12900487539f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/100","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
