{"id":30180,"no":40,"title":"Chapter 39","content":"Although the spartan room in the brownstone on Rue La Bruyère had witnessed a lot of suffering,Silas doubted anything could match the anguish now gripping his pale body. I was deceived.\n 　　Everything is lost.\n 　　Silas had been tricked. The brothers had lied, choosing death instead of revealing their true secret.\n 　　Silas did not have the strength to call the Teacher. Not only had Silas killed the only four peoplewho knew where the keystone was hidden, he had killed a nun inside Saint-Sulpice. She wasworking against God! She scorned the work of Opus Dei!\n 　　A crime of impulse, the woman\u0027s death complicated matters greatly. Bishop Aringarosa had placedthe phone call that got Silas into Saint-Sulpice; what would the abbé think when he discovered thenun was dead? Although Silas had placed her back in her bed, the wound on her head was obvious.\n 　　Silas had attempted to replace the broken tiles in the floor, but that damage too was obvious. Theywould know someone had been there.\n 　　Silas had planned to hide within Opus Dei when his task here was complete. Bishop Aringarosawill protect me. Silas could imagine no more blissful existence than a life of meditation and prayerdeep within the walls of Opus Dei\u0027s headquarters in New York City. He would never again set footoutside. Everything he needed was within that sanctuary. Nobody will miss me. Unfortunately,Silas knew, a prominent man like Bishop Aringarosa could not disappear so easily.\n 　　I have endangered the bishop. Silas gazed blankly at the floor and pondered taking his own life.\n 　　After all, it had been Aringarosa who gave Silas life in the first place... in that small rectory inSpain, educating him, giving him purpose.\n 　　\"My friend,\" Aringarosa had told him, \"you were born an albino. Do not let others shame you forthis. Do you not understand how special this makes you? Were you not aware that Noah himselfwas an albino?\"\"Noah of the Ark?\" Silas had never heard this.\n 　　Aringarosa was smiling. \"Indeed, Noah of the Ark. An albino. Like you, he had skin white like anangel. Consider this. Noah saved all of life on the planet. You are destined for great things, Silas.\n 　　The Lord has freed you for a reason. You have your calling. The Lord needs your help to do Hiswork.\"Over time, Silas learned to see himself in a new light. I am pure. White. Beautiful. Like an angel.\n 　　At the moment, though, in his room at the residence hall, it was his father\u0027s disappointed voice thatwhispered to him from the past.\n 　　Tu es un désastre. Un spectre.\n 　　Kneeling on the wooden floor, Silas prayed for forgiveness. Then, stripping off his robe, hereached again for the Discipline.\n 虽然布吕耶尔街上那褐色的斯巴达克式石屋已经见证了无数的苦难，但塞拉斯却觉得他现在的痛苦才是世间最难堪的。我被骗了。一切都完了。\n 塞拉斯被骗了。隐修会的教友们宁愿选择死亡也不愿泄露秘密。塞拉斯连打电话给主教的力气都没有了。他不仅杀了知道楔石隐藏地的四个人，还杀了一个圣叙尔皮斯教堂的修女。她与上帝作对！她蔑视天主事工会！\n 修女之死把问题变得更加复杂了，这都是塞拉斯一时冲动惹的祸。阿林加洛沙主教曾打电话向修道院院长打了招呼，让塞拉斯进入圣叙尔皮斯教堂；但如果修道院院长发现修女死了，又会怎么想呢？虽然塞拉斯已经将她的尸体放在了床上，但她头部的伤痕是非常明显的。他也曾试图修复那块被砸碎的地砖，但那破坏的痕迹无法掩饰。他们一定会看出有人去过那里。\n 塞拉斯本想在完成任务后躲进天主事工会。阿林加洛沙主教会保护我的。在塞拉斯眼中，最幸福的生活方式莫过于整日在纽约的天主事工会总部里冥思和祈祷。他将再也不踏出那里半步。他的所有需求都可以在那个圣地得到满足。没有人会想起我。但此时，塞拉斯意识到，让阿林加洛沙主教那样的名人消失在人们的视线中可不容易。\n 我给主教带来了危险。塞拉斯茫然地看着地面，琢磨着如何逃生。毕竟，是阿林加洛沙给了塞拉斯新生……在西班牙的那个小教区时，阿林加洛沙教育他，给了他生活的目标。\n \"我的朋友。\"阿林加洛沙告诉他。\"你生来就是一个白化病人。不要让别人因此而瞧不起你。你不知道这让你多么地与众不同吗？你还不知道诺亚就是个白化病人吧？\"\n \"是\"诺亚方舟\"传说里的那个诺亚吗？\"塞拉斯从来没有听说过。\n 阿林加洛沙微笑着说：\"没错，就是\"诺亚方舟\"里的那个诺亚。和你一样，他的皮肤像天使一样白。想想看，诺亚挽救了地球上的所有生命。塞拉斯，你注定要做出壮举。上帝将你解救出来，就是因为你有你的使命。上帝需要你去完成他的旨意。\"一时间，塞拉斯学会了以新的眼光来看待自己。我是纯洁的，我是洁白的，我是美丽的，就像一个天使。\n 此时，父亲那失望的声音又从遥远的过去传来，传到他的房间里。\n 你是个祸星，一个幽灵。\n 塞拉斯跪在地板上祈求宽恕。然后，他解下长袍，伸手去拿那本戒律。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/100/8592.html","bookId":473,"book":{"id":473,"title":"The Da Vinci Code达芬奇密码","description":"简介： The Da Vinci Code is a 2003 mystery-detective fiction novel written by American author, Dan Brown. It follows symbologist Robert Langdon and Sophie Neveu as they investigate a murder in Paris\u0027s Louvre Museum and discover a battle between the Prio...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12900487539f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/100","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
