{"id":30202,"no":62,"title":"Chapter 61","content":"Princess Sophie. 　　Sophie felt hollow as she listened to the clicking of Teabing\u0027s crutches fade down the hallway. 　　Numb, she turned and faced Langdon in the deserted ballroom. He was already shaking his head asif reading her mind. 　　\"No, Sophie,\" he whispered, his eyes reassuring. \"The same thought crossed my mind when Irealized your grandfather was in the Priory, and you said he wanted to tell you a secret about yourfamily. But it\u0027s impossible.\" Langdon paused. \"Saunière is not a Merovingian name.\"Sophie wasn\u0027t sure whether to feel relieved or disappointed. Earlier, Langdon had asked an unusualpassing question about Sophie\u0027s mother\u0027s maiden name. Chauvel. The question now made sense. 　　\"And Chauvel?\" she asked, anxious. 　　Again he shook his head. \"I\u0027m sorry. I know that would have answered some questions for you. 　　Only two direct lines of Merovingians remain. Their family names are Plantard and Saint-Clair. 　　Both families live in hiding, probably protected by the Priory.\"Sophie repeated the names silently in her mind and then shook her head. There was no one in herfamily named Plantard or Saint-Clair. A weary undertow was pulling at her now. She realized shewas no closer than she had been at the Louvre to understanding what truth her grandfather hadwanted to reveal to her. Sophie wished her grandfather had never mentioned her family thisafternoon. He had torn open old wounds that felt as painful now as ever. They are dead, Sophie. 　　They are not coming back. She thought of her mother singing her to sleep at night, of her fathergiving her rides on his shoulders, and of her grandmother and younger brother smiling at her withtheir fervent green eyes. All that was stolen. And all she had left was her grandfather. 　　And now he is gone too. I am alone. 　　Sophie turned quietly back to The Last Supper and gazed at Mary Magdalene\u0027s long red hair andquiet eyes. There was something in the woman\u0027s expression that echoed the loss of a loved one. 　　Sophie could feel it too. 　　\"Robert?\" she said softly. 　　He stepped closer. 　　\"I know Leigh said the Grail story is all around us, but tonight is the first time I\u0027ve ever heard anyof this.\"Langdon looked as if he wanted to put a comforting hand on her shoulder, but he refrained. 　　\"You\u0027ve heard her story before, Sophie. Everyone has. We just don\u0027t realize it when we hear it.\"\"I don\u0027t understand.\"\"The Grail story is everywhere, but it is hidden. When the Church outlawed speaking of theshunned Mary Magdalene, her story and importance had to be passed on through more discreetchannels... channels that supported metaphor and symbolism.\"\"Of course. The arts.\"Langdon motioned to The Last Supper. \"A perfect example. Some of today\u0027s most enduring art,literature, and music secretly tell the history of Mary Magdalene and Jesus.\"Langdon quickly told her about works by Da Vinci, Botticelli, Poussin, Bernini, Mozart, andVictor Hugo that all whispered of the quest to restore the banished sacred feminine. Enduringlegends like Sir Gawain and the Green Knight, King Arthur, and Sleeping Beauty were Grailallegories. Victor Hugo\u0027s Hunchback of Notre Dame and Mozart\u0027s Magic Flute were filled withMasonic symbolism and Grail secrets. 　　\"Once you open your eyes to the Holy Grail,\" Langdon said, \"you see her everywhere. Paintings. 　　Music. Books. Even in cartoons, theme parks, and popular movies.\"Langdon held up his Mickey Mouse watch and told her that Walt Disney had made it his quietlife\u0027s work to pass on the Grail story to future generations. Throughout his entire life, Disney hadbeen hailed as \"the Modern-Day Leonardo da Vinci.\" Both men were generations ahead of theirtimes, uniquely gifted artists, members of secret societies, and, most notably, avid pranksters. LikeLeonardo, Walt Disney loved infusing hidden messages and symbolism in his art. For the trainedsymbologist, watching an early Disney movie was like being barraged by an avalanche of allusionand metaphor. 　　Most of Disney\u0027s hidden messages dealt with religion, pagan myth, and stories of the subjugatedgoddess. It was no mistake that Disney retold tales like Cinderella, Sleeping Beauty, and SnowWhite—all of which dealt with the incarceration of the sacred feminine. Nor did one need abackground in symbolism to understand that Snow White—a princess who fell from grace afterpartaking of a poisoned apple—was a clear allusion to the downfall of Eve in the Garden of Eden. 　　Or that Sleeping Beauty\u0027s Princess Aurora—code-named \"Rose\" and hidden deep in the forest toprotect her from the clutches of the evil witch—was the Grail story for children. 　　Despite its corporate image, Disney still had a savvy, playful element among its employees, andtheir artists still amused themselves by inserting hidden symbolism in Disney products. Langdonwould never forget one of his students bringing in a DVD of The Lion King and pausing the film toreveal a freeze-frame in which the word SEX was clearly visible, spelled out by floating dustparticles over Simba\u0027s head. Although Langdon suspected this was more of a cartoonist\u0027ssophomoric prank than any kind of enlightened allusion to pagan human sexuality, he had learnednot to underestimate Disney\u0027s grasp of symbolism. The Little Mermaid was a spellbinding tapestryof spiritual symbols so specifically goddess-related that they could not be coincidence. 　　When Langdon had first seen The Little Mermaid, he had actually gasped aloud when he noticedthat the painting in Ariel\u0027s underwater home was none other than seventeenth-century artistGeorges de la Tour\u0027s The Penitent Magdalene—a famous homage to the banished MaryMagdalene—fitting decor considering the movie turned out to be a ninety-minute collage of blatantsymbolic references to the lost sanctity of Isis, Eve, Pisces the fish goddess, and, repeatedly, MaryMagdalene. The Little Mermaid\u0027s name, Ariel, possessed powerful ties to the sacred feminine and,in the Book of Isaiah, was synonymous with \"the Holy City besieged.\" Of course, the LittleMermaid\u0027s flowing red hair was certainly no coincidence either. 　　The clicking of Teabing\u0027s crutches approached in the hallway, his pace unusually brisk. When theirhost entered the study, his expression was stern. 　　\"You\u0027d better explain yourself, Robert,\" he said coldly. \"You have not been honest with me.\" 索菲公主。 索菲听着提彬的拐杖声消失在走廊的尽头，感到一阵空虚。她怅然若失地转身望着兰登。兰登摇摇头，好像猜到了她的想法。 \"是的，索菲。\"他轻声说，目光异常坚定。\"当我意识到你祖父是隐修会的成员时，我也有同样的想法。你说他要告诉你一个关于你家庭的秘密。\"兰登停顿了一下。\"索尼埃不是梅罗文加王朝的姓氏。\"索菲不知自己是欣慰还是失望。早先，兰登曾很突兀地询问她母亲的名字。现在，这个问题变得很有意义了。\"肖维尔。她可能是梅罗文加王朝的后代吗？\"她焦急地问。 他又摇了摇头。\"对不起，我不能确定。梅罗文加王朝的子嗣只有两个家族姓氏--普兰塔得和圣。卡莱尔。后人都躲藏了起来，也许是被隐修会保护了起来。\"索菲默念着那几个名字，摇了摇头。她家里没人姓普兰塔得或圣，卡莱尔。她感到疲惫，觉得更加困惑了，更加不明白祖父要告诉她些什么。索菲真希望祖父没有提及家庭。 他撕开了旧伤口，那伤口依旧疼痛。他们死了，索菲。他们不会回来了。她回想起了妈妈唱歌哄她入睡的情景；回想起了骑在爸爸肩上玩耍的时光；回想起了祖母和弟弟用绿色的眼睛看着她，冲她微笑的样子。这一切都被偷走了。她只拥有祖父了。 而现在祖父也离开了。只有我一个人了！ 索菲默默地转过身，看着墙上的那幅《最后的晚餐》，凝视着抹大拉那火红的长发和安详的眼睛。索菲能感觉到抹大拉的眼里有种失去爱人的茫然。 \"罗伯特？\"她轻声说。 兰登走了过来。 \"虽然今晚我第一次听到圣杯的故事，但我觉得它跟我的家庭有关。\" 兰登想把手放到索菲肩上，安慰她一下，可最终还是没有那样做。他说道：\"索菲，你应该听说过抹大拉的故事。那样的故事广为流传，只是我们没有意识到它们的存在而已。\"\"我不明白。\" \"圣杯的故事无处不在，只不过被隐藏了起来，不易被发现罢了。罗马教廷不许人们公开谈论逃亡的玛利亚，于是人们便以隐秘的方法记录她的故事。这些方法包括比喻和象征等。\"\"当然了，是通过艺术作品。\" 兰登指着墙上的《最后的晚餐》，说道：\"这就是一个完美的例子。许多不朽的文学、音乐作品中都暗含着玛利亚。抹大拉和耶稣的故事。\"兰登简要地向索菲介绍了达。芬奇、波提切利、莫扎特和维克多。雨果的一些作品。那些作品都以隐秘的方法表达了恢复圣女玛利亚地位的希望。那些美丽的传说--如圆桌骑士、亚瑟王和睡美人等--都源于圣杯的故事。维克多。雨果的《巴黎圣母院》和莫扎特的《魔笛》都运用了象征手法来将圣杯的故事暗含其中。 \"一旦你睁开眼睛寻找圣杯。\"兰登说道。\"你就会发现她无处不在。绘画、音乐、书籍，甚至是卡通片、主题公园和卖座的电影里都有她的身影。\"兰顿举起手腕上的米奇手表，告诉索菲：\"沃尔特。迪斯尼一生都在默默地致力于圣杯故事的保存和宣扬。他被人们誉为\"当代的列昂纳多。达。芬奇\"。\"这两个人都是时代的先锋，都是举世无双的天才艺术家，都是隐修会成员，而且都以喜欢恶作剧而闻名。像达。芬奇一样，沃尔特。迪斯尼也喜欢运用象征手法并在其作品中藏人秘密。对于一个训练有素的符号学家来说，观看迪斯尼早期的电影就像是在观看欣赏无数的暗示和比喻。 迪斯尼的大部分电影里都有异教传说、圣杯故事的影子。迪斯尼公司将\"灰姑娘\"、\"睡美人\"\"和\"白雪公主\"\"的故事搬上银幕，就是因为它们描述的都是遭受迫害的神圣女性的故事。人们无需象征学的知识就能明白，那里公主吃了毒苹果变成丑八怪的情节明显地影射了夏娃的堕落。人们也很容易看出，人称\"玫瑰\"的奥罗拉公主和躲避追杀的\"睡美人\"的故事，实际上就是儿童版的圣杯故事。 迪斯尼公司的工作人员常常会在电影制作中掺进一些隐含的象征意义。兰登还记得，有一次，一个学生带来了一盘《狮子王》DVD.在播放碟片时，那个学生突然按了暂停键，给大家看了一个定格画面。画面上，飘浮在\"辛巴\"头上的尘土组成了\"SEX\"（性）的字样。在兰登看来，这与其说这是制作者对享受性生活的暗示，倒不如说是他们的恶作剧。 兰登还发现迪斯尼对象征手法的运用能力不可低估。电影《美人鱼》中的多彩画面包含了大量象征元素，这些象征大多都跟女神有关，这绝对不可能是巧合。 兰登第一次看到《美人鱼》时，大吃一惊。他发现电影中\"水下住宅\"的样子跟十七世纪画家乔治。德拉。图尔所画的《悔过的抹大拉》上的建筑一模一样。那幅画是为被驱逐的玛利亚。抹大拉而作的，只不过与原作相比，电影中的画面有些艳丽。小美人鱼的名字--阿日耳--跟神圣的女性也有紧密的联系，它在《伊沙梅尔的书》中表示\"被围困的圣城\"。当然了，小美人鱼那一头飘动的红发也有独特的象征意义。 这时，提彬的拐杖声从走廊里传来。他的步伐听起来特别快。他面色铁青地走进书房，冷漠地说道：\"罗伯特，你最好作一下解释。你一直没跟我说实话。\"","sourceLink":"http://novel.tingroom.com/jingdian/100/8614.html","bookId":473,"book":{"id":473,"title":"The Da Vinci Code达芬奇密码","description":"简介： The Da Vinci Code is a 2003 mystery-detective fiction novel written by American author, Dan Brown. It follows symbologist Robert Langdon and Sophie Neveu as they investigate a murder in Paris\u0027s Louvre Museum and discover a battle between the Prio...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12900487539f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/100","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
