{"id":30227,"no":87,"title":"Chapter 86","content":"Like a ghost, Silas drifted silently behind his target. Sophie Neveu sensed him too late. Before shecould turn, Silas pressed the gun barrel into her spine and wrapped a powerful arm across her chest,pulling her back against his hulking body. She yelled in surprise. Teabing and Langdon both turnednow, their expressions astonished and fearful. 　　\"What...?\" Teabing choked out. \"What did you do to Rémy!\"\"Your only concern,\" Silas said calmly, \"is that I leave here with the keystone.\" This recoverymission, as Rémy had described it, was to be clean and simple: Enter the church, take the keystone,and walk out; no killing, no struggle. 　　Holding Sophie firm, Silas dropped his hand from her chest, down to her waist, slipping it insideher deep sweater pockets, searching. He could smell the soft fragrance of her hair through his ownalcohol-laced breath. \"Where is it?\" he whispered. The keystone was in her sweater pocket earlier. 　　So where is it now? 　　\"It\u0027s over here,\" Langdon\u0027s deep voice resonated from across the room. 　　Silas turned to see Langdon holding the black cryptex before him, waving it back and forth like amatador tempting a dumb animal. 　　\"Set it down,\" Silas demanded. 　　\"Let Sophie and Leigh leave the church,\" Langdon replied. \"You and I can settle this.\"Silas pushed Sophie away from him and aimed the gun at Langdon, moving toward him. 　　\"Not a step closer,\" Langdon said. \"Not until they leave the building.\"\"You are in no position to make demands.\"\"I disagree.\" Langdon raised the cryptex high over his head. \"I will not hesitate to smash this on thefloor and break the vial inside.\"Although Silas sneered outwardly at the threat, he felt a flash of fear. This was unexpected. Heaimed the gun at Langdon\u0027s head and kept his voice as steady as his hand. \"You would never breakthe keystone. You want to find the Grail as much as I do.\"\"You\u0027re wrong. You want it much more. You\u0027ve proven you\u0027re willing to kill for it.\"Forty feet away, peering out from the annex pews near the archway, Rémy Legaludec felt a risingalarm. The maneuver had not gone as planned, and even from here, he could see Silas wasuncertain how to handle the situation. At the Teacher\u0027s orders, Rémy had forbidden Silas to fire hisgun. 　　\"Let them go,\" Langdon again demanded, holding the cryptex high over his head and staring intoSilas\u0027s gun. 　　The monk\u0027s red eyes filled with anger and frustration, and Rémy tightened with fear that Silasmight actually shoot Langdon while he was holding the cryptex. The cryptex cannot fall! 　　The cryptex was to be Rémy\u0027s ticket to freedom and wealth. A little over a year ago, he was simplya fifty-five-year-old manservant living within the walls of Chateau Villette, catering to the whimsof the insufferable cripple Sir Leigh Teabing. Then he was approached with an extraordinaryproposition. Rémy\u0027s association with Sir Leigh Teabing—the preeminent Grail historian onearth—was going to bring Rémy everything he had ever dreamed of in life. Since then, everymoment he had spent inside Chateau Villette had been leading him to this very instant. 　　I am so close, Rémy told himself, gazing into the sanctuary of the Temple Church and the keystonein Robert Langdon\u0027s hand. If Langdon dropped it, all would be lost. 　　Am I willing to show my face? It was something the Teacher had strictly forbidden. Rémy was theonly one who knew the Teacher\u0027s identity. 　　\"Are you certain you want Silas to carry out this task?\" Rémy had asked the Teacher less than halfan hour ago, upon getting orders to steal the keystone. \"I myself am capable.\"The Teacher was resolute. \"Silas served us well with the four Priory members. He will recover thekeystone. You must remain anonymous. If others see you, they will need to be eliminated, and therehas been enough killing already. Do not reveal your face.\"My face will change, Rémy thought. With what you\u0027ve promised to pay me, I will become anentirely new man. Surgery could even change his fingerprints, the Teacher had told him. Soon hewould be free—another unrecognizable, beautiful face soaking up the sun on the beach. 　　\"Understood,\" Rémy said. \"I will assist Silas from the shadows.\"\"For your own knowledge, Rémy,\" the Teacher had told him, \"the tomb in question is not in theTemple Church. So have no fear. They are looking in the wrong place.\"Rémy was stunned. \"And you know where the tomb is?\"\"Of course. Later, I will tell you. For the moment, you must act quickly. If the others figure out thetrue location of the tomb and leave the church before you take the cryptex, we could lose the Grailforever.\"Rémy didn\u0027t give a damn about the Grail, except that the Teacher refused to pay him until it wasfound. Rémy felt giddy every time he thought of the money he soon would have. One third oftwenty million euro. Plenty to disappear forever. Rémy had pictured the beach towns on the C.ted\u0027Azur, where he planned to live out his days basking in the sun and letting others serve him for achange. 　　Now, however, here in the Temple Church, with Langdon threatening to break the keystone,Rémy\u0027s future was at risk. Unable to bear the thought of coming this close only to lose it all, Rémymade the decision to take bold action. The gun in his hand was a concealable, small-caliber, J-frame Medusa, but it would be plenty deadly at close range. 　　Stepping from the shadows, Rémy marched into the circular chamber and aimed the gun directly atTeabing\u0027s head. \"Old man, I\u0027ve been waiting a long time to do this.\"Sir Leigh Teabing\u0027s heart practically stalled to see Rémy aiming a gun at him. What is he doing! 　　Teabing recognized the tiny Medusa revolver as his own, the one he kept locked in the limousineglove box for safety. 　　\"Rémy?\" Teabing sputtered in shock. \"What is going on?\"Langdon and Sophie looked equally dumbstruck. 　　Rémy circled behind Teabing and rammed the pistol barrel into his back, high and on the left,directly behind his heart. 　　Teabing felt his muscles seize with terror. \"Rémy, I don\u0027t—\"\"I\u0027ll make it simple,\" Rémy snapped, eyeing Langdon over Teabing\u0027s shoulder. \"Set down thekeystone, or I pull the trigger.\"Langdon seemed momentarily paralyzed. \"The keystone is worthless to you,\" he stammered. \"Youcannot possibly open it.\"\"Arrogant fools,\" Rémy sneered. \"Have you not noticed that I have been listening tonight as youdiscussed these poems? Everything I heard, I have shared with others. Others who know more thanyou. You are not even looking in the right place. The tomb you seek is in another locationentirely!\"Teabing felt panicked. What is he saying! 　　\"Why do you want the Grail?\" Langdon demanded. \"To destroy it? Before the End of Days?\"Rémy called to the monk. \"Silas, take the keystone from Mr. Langdon.\"As the monk advanced, Langdon stepped back, raising the keystone high, looking fully prepared tohurl it at the floor. 　　\"I would rather break it,\" Langdon said, \"than see it in the wrong hands.\"Teabing now felt a wave of horror. He could see his life\u0027s work evaporating before his eyes. All hisdreams about to be shattered. 　　\"Robert, no!\" Teabing exclaimed. \"Don\u0027t! That\u0027s the Grail you\u0027re holding! Rémy would never shootme. We\u0027ve known each other for ten—\"Rémy aimed at the ceiling and fired the Medusa. The blast was enormous for such a small weapon,the gunshot echoing like thunder inside the stone chamber. 　　Everyone froze. 　　\"I am not playing games,\" Rémy said. \"The next one is in his back. Hand the keystone to Silas.\"Langdon reluctantly held out the cryptex. Silas stepped forward and took it, his red eyes gleamingwith the self-satisfaction of vengeance. Slipping the keystone in the pocket of his robe, Silasbacked off, still holding Langdon and Sophie at gunpoint. 　　Teabing felt Rémy\u0027s arm clamp hard around his neck as the servant began backing out of thebuilding, dragging Teabing with him, the gun still pressed in his back. 　　\"Let him go,\" Langdon demanded. 　　\"We\u0027re taking Mr. Teabing for a drive,\" Rémy said, still backing up. \"If you call the police, he willdie. If you do anything to interfere, he will die. Is that clear?\"\"Take me,\" Langdon demanded, his voice cracking with emotion. \"Let Leigh go.\"Rémy laughed. \"I don\u0027t think so. He and I have such a nice history. Besides, he still might proveuseful.\"Silas was backing up now, keeping Langdon and Sophie at gunpoint as Rémy pulled Leigh towardthe exit, his crutches dragging behind him. 　　Sophie\u0027s voice was unwavering. \"Who are you working for?\"The question brought a smirk to the departing Rémy\u0027s face. \"You would be surprised,Mademoiselle Neveu.\" 塞拉斯有如幽灵般迅速地绕到进攻目标的背后。等索菲发现他时，已经太迟了。她还来不及转身，塞拉斯已把枪口对准了她的脊梁骨，并用粗壮的胳膊拦腰抱住了她，拼命将她向后拖。她惊叫起来。提彬与兰登这才回过头，他们的脸上，写满了震惊与恐惧。 \"你--\"提彬结结巴巴地说：\"你把雷米怎么样了？\" 塞拉斯平静地说道：\"你现在只管让我拿了拱心石离开这里就可以了。\"雷米刚才说过，要完成重新夺回拱心石的使命，就必须做得干净利落：进入教堂，把拱心石抢到手，然后就走；不要杀人，也不要与人争斗。 塞拉斯紧抱住索菲不放，又把手从她胸部放下来，移到她的腰间，然后伸进她背心的口袋里，搜索着。透过自己的酒气，他能够闻到索菲头发里散发出来的淡淡的清香。\"拱心石呢？\"他低声问。拱心石早些时候还在她的背心口袋里。现在到哪里去了呢？ \"在这里呢！\"兰登低沉的声音从房间另一头传来。 塞拉斯转身看到兰登手拿一只黑色的密码盒，在他面前摇来晃去，就像斗牛士在挑逗不能说话的动物一般。 \"把它放下。\"塞拉斯命令道。 \"你让索菲和提彬离开这里。\"兰登回答说：\"只需我们两人就可以解决问题了。\"塞拉斯一把将索菲推开，用枪对准了兰登，向他走去。 \"你别过来。\"兰登说：\"先让他们离开。\" \"你没资格跟我讲什么条件。\" \"话不能这么说。\"兰登把密码盒高高地举过头顶：\"我会毫不犹豫地把它摔到地上，将里面的小瓶子砸个稀巴烂。\"尽管塞拉斯表面上对他的威胁不屑一顾，但他内心还是闪过一丝恐惧。这真是始料不及的啊。他用枪对准兰登的头部，故作镇静地说：\"你绝不会砸坏它。你和我一样，都很想找到圣杯呢。\"\"你弄错了，你比我更想得到它。你已经证明，为了得到它，你甚至愿意去杀人。\" 四十码开外，雷米。莱格鲁德从拱门附近的附属建筑物里的靠背椅上探出头，他逐渐恐慌起来。塞拉斯并没按事先的计划采取行动。即使在这里，他也能看到塞拉斯穷于应付眼前的局面。按照教主的命令，雷米是不让塞拉斯开枪的。 \"放他们走。\"兰登再次下了命令，他把密码盒高高举过头顶，怒视着塞拉斯的枪口。 修道士的眼里既充满了怒气，也饱含了沮丧。雷米的心揪得更紧了。他担心塞拉斯真会朝手里还拿着密码盒的兰登开枪。密码盒可不能掉哇！ 密码盒将是雷米通往自由与财富的门票。一年前，他还只是一名时年五十五岁的仆人，居住在维莱特庄园的深宅大院，成天为迎合让人烦透了的瘸子雷。提彬爵士不断冒出来的奇异想法而疲于奔命。但接着就有人想跟他做一笔特别的交易。雷米与雷。提彬爵士--这位闻名全球研究圣杯史的历史学家--之间的特殊关系，将带给他终生梦寐以求的东西。自那以后，他继续在维莱特庄园效劳，终于迎来了眼前这难得的机遇。 我离目标是如此的接近，他对自己说，眼睛一刻不停地盯着圣殿教堂里的礼拜堂，以及罗伯特。兰登手中的拱心石。如果兰登真的把密码盒砸了，那他什么也没有了。 我要不要亲自出面呢？那是教主严格禁止过的。雷米是唯一知道教主身份的人。 \"你确定要让塞拉斯去执行任务吗？\"不到半小时前，雷米就已经向教主请示过了。当时，他正等着接受去窃取拱心石的命令呢。\"我一个人就可以对付了。\" 教主的语气非常坚决：\"塞拉斯跟其他四位郇山隐修会的成员都干得不错。他会把拱心石夺回来的。你还得继续隐匿身份。如果有人知道你的底细，就干掉他，反正我们人也已经杀得不少了。不管怎样，千万别暴露自己的身份。\"我可以改头换面啊，雷米心想。你不是答应过给我一笔可观的报酬吗？有了这笔钱，我就会从头到脚变成另外的一个人了。教主曾告诉他，做手术甚至能改变人的指纹哩。很快他就会获得自由--他将换上一幅让熟人认不出来的、英俊的脸孔，沐浴在洒满沙滩的阳光之中。 \"我明白了。\"雷米说：\"我会在暗中帮塞拉斯的。\" \"雷米，你要知道。\"教主告诉过他：\"那座可疑的坟墓不在圣殿教堂，所以，你不用担心，他们找错地方了。\"雷米大吃一惊：\"这么说你知道坟墓在哪里了？\" \"那当然，我以后再告诉你吧。现在你必须赶快采取行动。万一那些人找到了坟墓的确切位置，并抢在你拿到密码盒之前离开教堂，那我们就永远与圣杯失之交臂了。\"雷米对圣杯并无什么怨恨，只是如果不能找到它，教主就拒绝给他报酬。每次想到即将到手的那笔钱，他就兴奋不已。这是笔将近六七百万欧元的巨款呢。有了这笔钱，他就可以永远离开这里。雷米的脑海里闪过了法国的蓝岸地区海滩小镇的美丽图景，他将在那里度过余生，晒日光浴，让别人反过来服侍自己。 然而此刻，在圣殿教堂里，兰登威胁说要砸坏拱心石，这样，雷米的前程就未卜了。 想到即将失去的一切，他就特别的难受，于是他决定大胆行事。他手里的枪是一把隐蔽的小口径J 字形\"美杜莎\"牌左轮手枪，但在小范围内可以造成致命的创伤。 雷米从暗处走出来，快步来到圆形房子的中央，他用手枪直接瞄准了提彬的脑袋：\"老家伙，我等你已经很久了。\"雷。提彬爵士看到雷米用枪对准他，惊得连心跳都快要停止了。他这是干什么？提彬一眼认出了他那把出于安全考虑而锁在豪华轿车手套箱里的左轮手枪。 \"雷米，你这是怎么了？\"提彬气急败坏地说。 兰登与索菲同样被吓得目瞪口呆。 雷米从背后抱住提彬，用枪管猛击他左面偏高正对着心脏的后背。 提彬得全身肌肉都紧张起来了：\"雷米，我没--\" \"我直说了吧。\"雷米抢白道，他从提彬的肩上望过去，看着兰登。\"把拱心石放下，要不然我要开枪了。\"兰登一时好像变得麻木起来了。\"你要拱心石有什么用？\"他结结巴巴地说：\"你又不能把它打开。\"\"一群自以为是的傻瓜。\"雷米冷笑道：\"难道你们没注意到，整个晚上我一直都在听你们谈论这些诗吗？我什么都听到了，我也跟其他比你们懂得还多的人说了。你们甚至连地方都没找对。你们要找的坟墓纯粹在别的地方哩。\"提彬惊惶失措。他在胡说什么呀？！ \"你要圣杯干啥？\"兰登问：\"你想在世界末日之前毁了它？\" 雷米对那位修道士吩咐道：\"把拱心石从兰登先生那里拿走。\" 修道士步步紧逼，兰登则步步后退，他把拱心石高高举起，好像随时准备将它摔在地上。 \"我宁愿毁了它，也不愿让它落人非人之手。\" 提彬这时感到一阵恐惧。他仿佛看到他终生的事业将在眼前烟消云散，他所有的梦想都将化成尘埃。 \"罗伯特，不。\"他大声喊道：\"不要！你手里拿的可是圣杯啊。雷米不会朝我开枪的。 我们认识已经有十个--\"雷米朝天花板放了一枪。手枪这么小，但发出的声音实在太大了。枪声回响在石屋子里，简直就像电闪雷鸣。 \"我不是开玩笑的。\"雷米说：\"接下来我就要开枪打他的后背了。把拱心石交给塞拉斯。\"兰登很不情愿地伸出手，塞拉斯走上去接。他的红眼睛里充满了报复后的快感。他把拱心石放进长袍口袋里，然后向后退去，手枪仍旧瞄准了兰登与索菲两人。 提彬的脖子被雷米抱得紧紧的。雷米拖着他，开始向屋外退去，手枪还抵着他的背。 \"放他走。\"兰登命令道。 \"我要带提彬先生出去兜兜风。\"雷米还在往后退。\"如果你们报警，我就杀了他。如果你们想干涉，我也会杀了他。听清楚了没有？\" \"带我去。\"兰登的嗓子因为激动变得嘶哑起来。\"放雷爵士走！\" 雷米大笑起来：\"得了吧，我和他关系好着哩，而且他用处也大得很呢。\" 提彬将拐杖拖在身后，他被雷米推着往出口处走去。这时塞拉斯也开始向后移动起来，但他的手枪始终对准了兰登与索菲两人。 索菲的语气非常坚决：\"你是在给谁卖命啊？\" 闻听此言，雷米笑得得意忘形：\"奈芙小姐，说出来会让你大吃一惊的。\"","sourceLink":"http://novel.tingroom.com/jingdian/100/8639.html","bookId":473,"book":{"id":473,"title":"The Da Vinci Code达芬奇密码","description":"简介： The Da Vinci Code is a 2003 mystery-detective fiction novel written by American author, Dan Brown. It follows symbologist Robert Langdon and Sophie Neveu as they investigate a murder in Paris\u0027s Louvre Museum and discover a battle between the Prio...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12900487539f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/100","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
