{"id":11492,"no":2,"title":"I THE FIRST ENGLISH HERO","content":"The first golden door we open in the Great Palace shows us a hero, and that is as it should be, for the English have always been brave. Yet probably the poem about this first English hero is not the first poem. The first is a poem by the name of the \"Far Traveller.\" \"Many men and rulers have I known,\" says this traveler; \"through many strange lands I have fared throughout the spacious earth.\" This poem may not be of great value, but it is a wonderful experience to open this door and see back, back, back, thousands of [Pg 2]years to the very cradle in which English literature was born. This first Englishman was a wanderer, as all Englishmen, despite their love of home, have been, or else they would not hold so many great dominions as they do to-day. Then, too, there was \"Deor\u0027s Lament,\" with its sad refrain, \\n\\n Thas ofer eode, thisses swa maeg (That was overcome, so may this be) \\n\\n \\n\\n and its grave thought that \"The All-wise Lord of the world worketh many changes.\" One more poem, or, better, fragment, is spoken of in Beowulf. \"The Fight at Finnesburg\" is full of the savagery and fierceness of warfare; it is even more wild and barbarous than \"Beowulf.\" \\n\\n \\n\\n Now let us open the door over which is written Beowulf. It is one of the oldest and rudest of the golden doors in the Great Palace of English Poetry, but also one of the most precious. The pictures we are to see are beautiful sometimes. More often they are cruel and pitiless. \\n\\n \\n\\n The sun was shining, the wind was blowing, the air was as sweet-smelling as if it rose from fields of lilies, and it was the very springtime of the world some two thousand years ago. \\n\\n \\n\\n By song little Widsith has seen his master bind all men and all beasts. Not only the fish and worms forgot their tasks, but even the cattle stopped grazing, and, where they passed, men and children paused to listen. They were on their[Pg 3] way to the Great Hall to have a sight of the hero, Beowulf. \\n\\n \\n\\n Behind them lay the sea and the coast-guard pacing up and down. Before them, landward, rose a long, high-roofed hall. It had gable ends from which towered up huge stag-horns. And the roof shone only less brightly than the sun, for it was covered with metal. \\n\\n \\n\\n About the Great Hall toward which little Widsith and the master were traveling was the village made up of tiny houses, each in its own patch of tilled ground and apple-trees, and with fields in which sheep and oxen and horses were pastured. Narrow paths wound in and out everywhere. In front of the Hall was a broad meadow across which the king and queen and their lords and ladies were used to walk. \\n\\n \\n\\n There was much going on that day in Heorot. Flocks of children were playing about the pretty paths. Mothers and aunts and older sisters sat spinning in the open doorways. Beyond the wide meadow young men and boys were leading or riding spirited horses up and down to exercise them. \\n\\n \\n\\n And all—men, women, and children alike—were talking about Beowulf, who had come to kill the monster Grendel and free the people of Heorot. \\n\\n \\n\\n Beowulf had not much more than entered the Hall when the sc?p, or singer, as little Widsith\u0027s master was called, entered too. In those days[Pg 4] singers were welcome everywhere. They saw Beowulf stride mightily across the many-colored floor of Heorot and go up to the old King. And they heard his voice, which sounded like the rumble of a heavy sea on their rock-bound coast. \\n\\n \\n\\n \"Hrothgar!\" he said to the old King, \"across the sea\u0027s way have I come to help thee.\" \\n\\n \\n\\n \"Of thee, Beowulf, have we need,\" replied the old King in tears, \"for Heorot has suffered much from the monster.\" \\n\\n \\n\\n \"I will deliver thee, Hrothgar,\" said Beowulf, in his great voice; \"thee and all who dwell in Heorot.\" \\n\\n \\n\\n \"Steep and stony are the sea cliffs, joyless our woods and wolf-haunted, robbed is our Heorot, for to Grendel can no man do aught. He breaks the bones of my people. And those of my people he cannot eat in Heorot he drags away on to the moor and devours alive.\" \\n\\n \\n\\n And the old, bald-headed King, seated on his high seat in the Hall between his pretty daughter and his tired Queen, sighed as he thought of the approaching night. Yet, now that Beowulf had come, he hoped. \\n\\n \\n\\n Together they gathered about the banquet. Beowulf sat among the sons of the old King. The walls inside were as bright as the roof, and gold-gilded, and the great fires from which smoke poured out through openings in the roof were cheerful and warm. \\n\\n \\n\\n [Pg 5] \\n\\n \\n\\n Then little Widsith\u0027s master was called up, and Widsith placed the harp for him. Clear rose the song from the sc?p\u0027s lips, and all the company was still. For a while they forgot the monster which, even now with the falling dusk, was striding up from the sea, perhaps by the same path Beowulf and Widsith and the sc?p had come. Already it had grown dark under heaven and darker in the Hall, and the place was filled with shadowy shapes. \\n\\n \\n\\n And now came Grendel stalking from the cloudy cliffs toward the Gold Hall. It would have been hard for four men to have carried his huge head, so big it was. The nails of his hands were like iron, and large as the monstrous claws of a wild beast. And, since there was a spell upon him, no sword or spear could harm him. \\n\\n \\n\\n While others slept—even frightened little Widsith, who had thought he could never sleep—Beowulf lay awake, ready with his naked hands to fight Grendel. \\n\\n \\n\\n Suddenly the monster smote the door of Heorot, and it cracked asunder. In he strode, flame in his eyes, and before Beowulf could spring upon him or any one awake, he snatched a sleeping warrior and tore him to pieces. \\n\\n \\n\\n Beowulf, who had the strength of thirty men in his body, gripped him, and the dreadful battle and noise began. The benches were overturned, the walls cracked, the fires were scattered, and[Pg 6] dust rose in clouds from the many-colored floor as Beowulf wrestled with Grendel. \\n\\n \\n\\n The sc?p had seized his harp and was playing a great battle song, but music has no power over such evil as Grendel\u0027s. Beowulf himself, who was struggling to break the bone-house of the monster in the din of the mighty battle, did not hear it, either. And the song was lost in the noise and dust which rose together in Heorot. \\n\\n \\n\\n Even the warriors, who struck Grendel with their swords, could not help Beowulf, for neither sword nor spear could injure the monster. Only the might of the hero, himself, could do aught. \\n\\n \\n\\n At last, with the strength of thirty men, Beowulf gripped the monster. And Grendel, with rent sinews and bleeding body, fled away to the ocean cave where he had lived. And there in the cave, with the sea blood-stained and boiling above him, he died, outlawed for evil. \\n\\n \\n\\n In the second part of this poem Beowulf was living as king in his own land, and ruling like the great and brave king he was. But a huge old dragon who was guarding a treasure was robbed. So angry was the dragon that he left his heap of treasure and came down upon the land of King Beowulf, burning it and terrifying the people. Then Beowulf, who had become an old man, felt that he must fight to save his people. He went[Pg 7] out and slew the dragon, but was himself scorched to death by the fiery breath of the dragon. \\n\\n \\n\\n \"Beowulf\" is the epic of our old English period. An epic is an heroic poem. In \"Beowulf\" the story of Beowulf\u0027s great deeds—such as his struggle with Grendel and Grendel\u0027s mother—and of his death is told. Probably it was sung before the fifth century, when the English conquered Britain, for England itself is not mentioned in this wonderful poem. Indeed, the country described is that of the Goths of Sweden and of the Danes. Your geography will show you where Sweden and Denmark are. When the English forefathers came to England they brought this poem with them, perhaps in the form of short poems which were woven together by a Christian Northumbrian poet in the eighth century or thereabouts. \\n\\n \\n\\n It will be interesting to see how this wild moorland, over which Grendel stalked and over which the dreadful dragon dragged his length, became, with the cultivation of the land and advancing civilization, the gentle and beautiful dwelling of the fairies. The fairies will not live where it is too wild. \\n\\n \\n\\n Much is to be learned from this epic of the customs and the manners of the men who came to Britain and conquered it. We can see these people as they lived in their sea-circled settlements, the ships they used to sail upon the sea, how their villages looked, and the boys and girls[Pg 8] and grown-ups in them; the rocks and hills and ocean waves that made up their out-of-door world; the good times they had; their games and amusements. We come to know the respect that was given to their women; we see the bravery of the men in facing death, and we hear the songs they sang. \\n\\n \\n\\n \"Beowulf\" is a great poem—English literature knows no poem that is more sacred to it—but it is a sorrowful poem, too. These people believed in Fate, for Christ had not yet been brought to them with His message of love and peace and joy. English poetry to-day is much more joyous—because it is Christian poetry—than it ever could have been if England had remained a heathen land. Yet English poetry still has much in common with \"Beowulf,\" in love of the sea and worship of nature, and a strange sense of Fate. \\n\\n \\n\\n But we must close this door over which is written Beowulf, for the Great Palace is full of many doors and many stories, and we have only just begun our journey from golden door to golden door. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1696/49930.html","bookId":1155,"book":{"id":1155,"title":"Early English Hero Tales","description":"简介： The master-stories of English literature told for young readers. The author, who has been professor of English Literature at Mt. Holyoke and the author of several successful books for both younger and older readers, has been occupied for a long time...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1696","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
