{"id":103530,"no":2,"title":"Page 2","content":"The woman gasped in surprise, dropping her cloth, the cloth that had started on his body clinically and purposefully, as he\u0027d awakened, but had soon skimmed over him in sinuous movements.\\n\\n Her heels clicked on the polished wooden floor when she retreated. Court watched as she smoothed her already crisp dress, then the perfect knot of hair at her nape, then the choker at her throat with slender hands. At each of these tasks, her chin rose higher.\\n\\n \"I-I was merely caring for you,\" she answered in accented English.\\n\\n Instead of coming to in a haze of pain, he\u0027d woken to her breasts glancing over the hair on his chest as she reached across him, and to one of her soft, pale hands gripping his hip while the other rubbed over his skin. As he\u0027d felt fat drops of water hitting the sheet, he\u0027d caught the scent of her hair, making even his beaten body stir. \"Then consider me still in need of your care.\"\\n\\n Her cheeks turned pink.\\n\\n He tried to sit higher in the bed, then grimaced in pain. As if in answer, all his other wounds finally sounded the call. He glanced down at his wrist to find a cast. \"Who are you?\" he ground out. \"And where am I?\"\\n\\n \"My name is Annal¨ªa Elisabet Catherina Trist¨¢n. I am mistress of Casa del Llac, where you abide now, and daughter of the family Llorente.\" Her accent told him English wasn\u0027t her first language, though she spoke it perfectly and without hesitation, the words rolling from her tongue in a manner that was pleasing to the ear. She\u0027d said the name Llorente proudly, as though he\u0027d recognize it. He did feel as if he\u0027d heard it before but couldn\u0027t place it.\\n\\n \"Where did you find me? And how far are we from the village?\"\\n\\n \"Straight down this mountain on the banks of the Valira, four mountain passes to the south.\"\\n\\n Four passes away? He wondered if his men thought him dead. He needed to send a message -\\n\\n \"I would ask the name of my...guest.\" She indicated him with a nod.\\n\\n He studied her face, noting the high cheekbones and bright hazel-green eyes that matched the green-gold stone at her neck. She looked familiar to him - though he didn\u0027t see how he could ever have met then forgotten her - and he had a vague impression that she didn\u0027t like him. So why was she \"caring\" for him? \"I\u0027m Courtland MacCarrick.\"\\n\\n \"You are a Scot.\"\\n\\n \"Aye.\" At his answer, he could have sworn there was a flash of sadness in her eyes.\\n\\n \"And you are in Andorra because...\" She trailed off.\\n\\n The truth whispered in his mind: Because I was hired to tyrannize the people here. \"I was just passing through.\"\\n\\n The sadness he\u0027d sensed disappeared, and she said in a haughty voice, \"You chose to pass through a tiny country in the Pyrenees known for some of the highest mountain passes in Europe? For future reference, most simply go around.\"\\n\\n Her condescending tone annoyed him, and his body was rapidly becoming a mass of pain. \"I\u0027m a Highlander. I like high lands.\"\\n\\n She glared at him, then turned to leave, as if she couldn\u0027t wait to be away from him, but he needed information.\\n\\n \"Was I out for an entire day?\" he hastily asked.\\n\\n She looked longingly at the door, but then faced him. \"This is your third day here.\"\\n\\n Christ, three days? And from the feel of his ribs, he\u0027d be another week healing before he could even sit a horse. \"How did I come to be here?\"\\n\\n She hesitated before saying, \"I found you on the shore and dragged you up here.\"\\n\\n She looked like a stiff wind could blow her away. \"You?\"\\n\\n \"My horse and I.\"\\n\\n His brows drew together. \"There was no man who could do it?\"\\n\\n He was nearly six and a half feet tall and weighed more than seventeen stone. He could imagine how difficult it had been to haul him back even with the horse - especially if she lived high on the mountainside.\\n\\n \"We managed fine.\"\\n\\n Court owed her a debt of gratitude; he despised being indebted in any way. He grated, \"Then you saved my life.\"\\n\\n She peered at the ceiling, appearing embarrassed.\\n\\n Forcing the foreign words, he said, \"You have my thanks.\"\\n\\n She nodded and turned to go, but he didn\u0027t want the lass to leave yet. \"Annal¨ªa,\" he said, unable to remember anything else from her catalog of names.\\n\\n She whirled around, eyes wide, no doubt at the use of her given name. In a flash, he remembered her. Her beautiful countenance and curious expression had waned into sharp and glaring by the riverside. He rubbed his forehead with his good hand. In fact, she\u0027d lamented the fact that he lived.\\n\\n \"That is Lady Llorente to someone such as you! You would do well to remember that.\"\\n\\n His eyes narrowed. He\u0027d been right. \"Why did you call me an animal? Because I was so beaten?\"\\n\\n \"Of course not,\" she said with an incredulous look. \"I could tell you were Scottish.\"\\n\\n Court wrestled with his temper. \"Scottish?\" Many people held prejudices against Scots, and some hated them sight unseen, but no context on earth gave an Andorran the right to look down on one. \"Then why would you save \u0027someone such as me\u0027?\"\\n\\n She shrugged her slim shoulders. \"I would spare a mangy, rabid wolf suffering - \"\\n\\n \"So now you think me a mangy, rabid wolf?\" His head had begun pounding on both sides of his skull.\\n\\n She stretched out one hand and studied her nails, a perfect picture of disdain. \"If you\u0027d let a lady finish her thoughts, I would have added that I lowered my standards to accommodate you.\"\\n\\n He\u0027d be damned if he\u0027d allow this prig-arsed Andorran to look down her pert little nose at him. \"A lady?\" He snorted and glanced around the room. \"Alone with me. No chaperone.\" He lifted the sheet to glance down before giving her a smirk. \"And you got quite a gander. If you\u0027re such a lady, then why were you two seconds away from takin\u0027 me into your hand?\"\\n\\n She looked as though she fought for breath. \"I...I was - \"\\n\\n \"Granted, you doona seem like you\u0027re used to entertaining men in their rooms.\" He looked her up and down, not bothering to hide his blatant perusal. \"But I\u0027d wager you\u0027d be a natural at it.\"\\n\\n She stumbled back as though hit, her lips parting.\\n\\n When she rushed out of the room, with her shoulders, which had been jammed back, now slumped, his brows drew together. He was puzzled as much by her behavior as by the unfamiliar seed of guilt that lodged in his chest. As he tested to see if he could rise from the bed, he wondered why a coldhearted bastard like himself would regret his treatment of a woman who thought him no more than - no, worse than - a beast.\\n\\n He was determined to find the reasons for both reactions.\\n\\n Annal¨ªa had feared she was one of those women ever since she\u0027d known of their existence.\\n\\n She\u0027d feared that she could be one among those who lusted and acted on their passions even to their own ruin. Her discovery that the Highlander\u0027s brawny chest could fascinate her for hours had been dismaying. Realizing that each glimpse of his private place, outlined beneath the thin linen sheet, made her heart race had been devastating.\\n\\n Now, worse than her own fear, a thick-skulled, barbaric Scot had looked her over and concluded she was a \"natural.\"\\n\\n Just as her Castilian mother had been.\\n\\n Denying her true nature had been easy before. If she heard whispers about her \"hot blood\" in the village, she ignored them. She kept herself busy with the estate and with the people here. But after the Scot had come, each night became a struggle.\\n\\n Just last night, she\u0027d lain in bed thinking about his body - all of his body, which she\u0027d studied and touched - until she\u0027d slowly unbuttoned her nightdress and bared her breasts. The meager breeze fluttering past the curtains had grazed over her heated skin, making her shudder, making her...long.\\n\\n She\u0027d never known what to call the urges she\u0027d felt in the night - not lust, because they never had been focused on any one man. So she\u0027d thought of them as longing, but not last night. She\u0027d truly felt lust, and it had been so strong she\u0027d finally run her fingers over her own breast and down her belly.\\n\\n A noise had startled her - just the house settling - but she\u0027d jerked her hand away, ashamed.\\n\\n Not only was she one of those women, she was alone in the house with a man who knew it....\\n\\n When she\u0027d finally guided the shaking key into the lock of his door, she\u0027d fled outside, hurrying in the direction of the meadow in front of her home.\\n\\n Vitale met her on the path. \"What has happened? You\u0027re white as a sheet.\"\\n\\n \"It\u0027s nothing. The Scot woke.\"\\n\\n \"He\u0027s a mercenary?\"\\n\\n \"I\u0027m almost positive, though I am convinced he\u0027s an obnoxious man.\" At least he\u0027d be gone soon. She was sure that he\u0027d be eager to return to indiscriminate killing and sharpening knives and practicing pistols and whatever else mercenaries did.\\n\\n \"Did he frighten you or threaten you?\"\\n\\n \"N-Not exactly...\"\\n\\n \"You never listen to me!\" Vitale cried with a volley of Gallic hand gestures. \"You\u0027ve been too sheltered - can\u0027t comprehend that there are bad people in the world that shouldn\u0027t be saved! You\u0027re too...soft!\" He said the word with disgust.\\n\\n \"I am not soft!\"\\n\\n \"When I saved you from that footpad, you were too stunned to give him your choker and you quaked like a little girl.\"\\n\\n \"I was a little girl and I wasn\u0027t quaking.\" Nor had she been too stunned. The choker had been her mother\u0027s, and she\u0027d already known how much she needed it.\\n\\n He eyed her. \"The Scot will still be weak enough that we can throw him back like a bad catch.\"\\n\\n \"Vitale!\" Unconsciously, she drew her hand over her neck. Frowning, she glanced back at the house, puzzled at her uncanny feeling that she was being watched. There was no way he could have risen. No, not with those injuries.\\n\\n The sun was directly in her eyes, and she could see nothing. After a last squint, she said, \"Vitale, he\u0027ll be out of our lives soon enough. One day we probably will find him - and our silver - gone.\" With that, she walked on.\\n\\n Once in the meadow, she sank into the carpet of narcissus cladding the entire shelf of land. She\u0027d always been able to lose herself in the scents and daydream as she gazed out over the lake and farther beyond to the twining river.\\n\\n On the next plateau down, their champion horses played and jumped, their copper coats gleaming in the sun. On the lowest plateau skirting the river, rose of Canolich swathed the ground in yellow. But here, a cloud of white blooms. She plucked a flower, brought it to her nose, and inhaled, closing her eyes with pleasure....\\n\\n He\u0027d said she was a natural! Her eyes flashed open. What was it about her that made people continually come to this conclusion? She\u0027d saved his life, and he made disparaging comments? When one is nursing a man, contact is made and...parts are seen.\\n\\n Especially when they were drawing attention to themselves. She shivered.\\n\\n She would simply forget the scene, banishing it from her thoughts. She might be one of those women, but she\u0027d been trained to be a lady. Burying uncomfortable thoughts was one thing at which ladies excelled. She looked down to find the flower crushed in her hands.\\n\\n Soon he\u0027d be gone, and life would return to normal. Unfortunately, even then her existence would be anxious and cheerless. She continued to await some news from her brother Aleixandre, the only family she had left. She had heard nothing for more than a week, and worry preyed on her.\\n\\n A strong breeze blew for the first time in days, it seemed, flattening the grass in waves and teasing a lock of hair loose from her tight braid. Out here, the compulsion to rake it back into place wasn\u0027t so pressing, but still won over. She smoothed her hair and picked another flower.\\n\\n Even when her brother routed Pascal and returned, she still would be in a vulnerable position. This fight had only postponed Aleix\u0027s desire that she wed. When their father died two years ago, she\u0027d been brought home from school so that a marriage could be contracted for her. Just as Aleix had begun narrowing the choices, Pascal had arrived.\\n\\n Before he\u0027d shown his true nature, Pascal had surprised them by asking Aleix for her hand, though they\u0027d never met. Aleix had refused, incurring the general\u0027s anger, but her brother had never trusted the man even before his vile army of mercenaries and deserters had taken over the area.\\n\\n Aleix repeatedly lamented the fact that he hadn\u0027t forced her to marry earlier. At twenty-one, she was more than old enough, and she\u0027d been born and raised for it, but she\u0027d never met a man she wanted. She never could imagine doing the perplexing things the girls at school had whispered about, those painful, aggressive things done in the dark - no matter how much she longed. Whenever she\u0027d envisioned those acts with any of the men she\u0027d been introduced to, she\u0027d cringed.\\n\\n Besides, she\u0027d been so content to help care for Aleix and Mariette\u0027s baby that no man tempted her.\\n\\n Yet now there was no baby, no Mariette, and all the happiness that had been in Aleix had died with them.\\n\\n Annal¨ªa turned sharply toward the house. The feeling was back. When a cloud passed the sun, she held her hand to her forehead and scanned the windows.\\n\\n The curtains in the Highlander\u0027s room swayed - to the side - then settled back into place. \\n\\n","sourceLink":"https://allnovel.net/if-you-dare-maccarrick-brothers-1/page-2.html","bookId":2644,"book":{"id":2644,"title":"If You Dare (MacCarrick Brothers #1)","description":"Storyline: If You Dare (MacCarrick Brothers #1) \\n Kresley Cole introduces a thrilling new romance trilogy featuring fierce Scottish brothers with dangerous lives, dark desires, and a deadly curse. \\n Can he exact revenge? \\n High in the Pyrenees, a band of mercenaries led by Courtland MacCarrick wages war for General Reynaldo Pascal. When Court turns on the evil general, Pascal orders him killed, but Court narrowly escapes and exacts revenge by kidnapping Pascal\u0027s exquisite Castilian fiancée. \\n Can she deny her passions? \\n Lady Annalía Tristán Llorente despises her towering, barbaric captor almost as much as she does Pascal. Her inexplicable attraction to the Highlander only fuels her fury. But nothing will stop her from returning to Pascal—for if she doesn\u0027t wed him, she signs her brother\u0027s death warrant, as well as her own. \\n Can there be love between them? \\n From the moment Court discovers that Anna\u0027s prim façade masks a fiery, brave lass, his heart\u0027s ensnared, and he dares to defy the curse that has shadowed his life—to walk with death or walk alone. But Pascal vows that he\u0027ll hunt the two, never stopping until he\u0027s destroyed them both.\\n","cover":"https://allnovel.net/images/if-you-dare-maccarrick-brothers-1.jpg","author":"Kresley Cole","type":"Historical","source":"allnovel","link":"https://allnovel.net/if-you-dare-maccarrick-brothers-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 10:27:22 PM"}}
