{"id":103556,"no":28,"title":"Page 28","content":"The way MacCarrick moved, the way his muscles rippled, and the abandon he must have felt did odd things to Annal¨ªa.\\n\\n The idea that his reaction was so strong that he threw back his head, with his neck and chest straining and slick, and yelled like a beast made her breaths speed up.\\n\\n Though on the whole she was not pleased with lovemaking. She found it exciting because it was a new experience, and she relished his response, yet it was vastly overrated in her mind because of the stabbing pain involved.\\n\\n But then, after he\u0027d finished, he remained full inside her. It wasn\u0027t...unpleasant.\\n\\n His body was heavy on her, though. She moved to find a more comfortable position and was amazed at the feeling of his chest, slick with sweat, rubbing her breasts. His heart thundered against her, and the hair on his chest rasped her nipples. That felt...nice. His harried breaths on her damp neck made her tremble, which also was nice. And she loved the way his callused hand felt when he stroked her leg, the one still levered against his hip as if he were not ever letting go.\\n\\n Everything added up until she was very aware that she had not reached her end, the bliss she\u0027d been just one of his clever strokes away from enjoying. How would he know that she wanted his hands back on her? How did one go about asking a man to massage and kiss your breasts, with careful attention to the...She squeezed her eyes shut. She couldn\u0027t ask him. The next best thing was another wriggle beneath him. She sucked in a breath.\\n\\n \"Christ, I dinna want tae hurt you,\" he grated, as he rose up and began to withdraw.\\n\\n \"Please, stop.\" He did. \"MacCarrick?\"\\n\\n \"What do you want me tae do, Anna?\" His eyes were so dark as he watched her face. She knew he was reading her expression, trying to uncover what she desired. She knew he would do whatever it was.\\n\\n Yet she turned her face from him, unable to ask.\\n\\n \"Whisper what you want in my ear,\" he said, and leaned down.\\n\\n \"MacCarrick,\" she whispered hesitantly. \"My breasts...ache. Please touch them.\"\\n\\n He shuddered, every part of him tensing. Then, like a shot, his hands were on her, molding her flesh to his fingers before he put his palms behind her to arch her back and raise her to his mouth. He drew greedily on her nipples, even while groaning desperately against her.\\n\\n She cried out and threaded her fingers through his hair, holding him to her until her head fell back. The feelings were so intense, and she was ever aware of this delicious fullness still embedded in her, making every pleasure sharper.\\n\\n \"Mo cridhe,\" he rasped against her breast, \"tell me what else you want me tae do.\"\\n\\n She ran her hands down his arms in frustration. When she didn\u0027t answer he kissed her neck, putting his ear close to her lips. \"Tell me what you want, and I swear I will give it tae you.\" His voice was husky and deep.\\n\\n \"I want you,\" she said, panting, \"to try me again.\"\\n\\n He hissed between his teeth.\\n\\n \"Can we? Can you?\"\\n\\n \"Anna, I never stopped being hard,\" he said, sounding surprised. \"No difference.\" As if testing, he slowly pressed forward inside her.\\n\\n A swift feeling of rapture swept through her, and she arched her back in shocked pleasure. \"Oh, Courtland,\" she said in awe. In that instant she understood why man and woman were made this way.\\n\\n \"You doona hurt any longer?\" Court asked, as he withdrew and entered her again.\\n\\n She shook her head but said nothing. He leaned down again, and she whispered, \"I adore what you\u0027re doing to me.\"\\n\\n \"Anna.\" His hips bucked involuntarily.\\n\\n If she adored this, then he wanted her to come with him inside her, to know that feeling. He leaned down and took her mouth hard, teasing her tongue, then making his way down to her neck and breasts. When he nipped at the peak, she cried out.\\n\\n He raised his chest, then laid his hand low on her belly, resting it flat, and rubbed his thumb in time with his stroke. \"Do you like it when I touch here?\"\\n\\n Her answer was an incomprehensible cry as she spread her legs wider and wildly scratched her nails up his chest, making the muscles tense in reflex.\\n\\n With each pump of his hips, he fondled her. Her breasts bounced, her nipples were so hard and still wet from him, and he was on the verge again. Her hands flew to her sides, and she clutched the sheets, arching her back and undulating her hips harder against his cock. But he wouldn\u0027t end this until he felt her sex squeezing his shaft.\\n\\n He stroked her flesh faster, and she cried, \"Yes! Please don\u0027t stop!\"\\n\\n \"I\u0027ll do this as long as you want me tae.\"\\n\\n She moaned, her whole body tensing as she began to come. Her back arched, her hands flew to his shoulders, clutching, her nails biting into him. Inside, her body gripped his, and the pleasure from that was greater than before if even conceivable.\\n\\n His head fell back, and he gave a brutal groan when he tensed to spend. Though the sensation was so intense he had to battle the urges to yell to the ceiling, to graze his teeth against her wet skin or clench her hips and wrench her down harder on him, he leaned forward and took her face in his hands.\\n\\n With his last grinding thrusts, he caught her gaze, daring her to turn away from him. But she didn\u0027t. As his seed poured from him relentlessly, the words left his lips, \"Is leamsa thu. Naisgeam riut mi daonnan.\" You are mine. I bind you to me always. He heard them as if someone else had spoken, then collapsed onto her.\\n\\n Seconds later he pushed up, remembering he was too heavy for her. She looked at him with wonder, and, he hoped, something more that he didn\u0027t deserve. He put his arms underneath her and rolled onto his back with her. He was too big to lie on her, but even when she rested on his chest, he squeezed her to him hard and felt her heart beating fast. When her breaths calmed, she put her arms around him and squeezed back. His lips curled.\\n\\n \"Did I hurt you again?\" He stroked her hair, loving how soft it was, loving her scent.\\n\\n She shook her head against his chest. \"Not the second time.\" In a voice so quiet he scarcely heard her, she said, \"Nothing could feel that heavenly.\" Her tone was marveling and he was proud. \"But did I please you?\" she asked.\\n\\n When he chuckled, she rose up and looked at him with narrowed golden eyes. \"What is so amusing?\"\\n\\n \"Your question. You canna ken how much you did.\"\\n\\n She bit her lip and put her face back to his chest. She was smiling against him. \"I wasn\u0027t aware you possessed the ability to laugh.\"\\n\\n \"Aye. I\u0027ve the ability.\" Just not much opportunity before.\\n\\n \"I want to hear it more,\" she said in a drowsy voice. Squeezing him one last time, she drifted to sleep. On this night, he knew more satisfaction than he had ever known, ever imagined a man could know. She was so warm on him, her hair spilling over his chest, her body fitting to him.\\n\\n Before he grew even harder inside her again - even he wasn\u0027t enough of a beast to take her three times - he withdrew and set her beside him on the bed.\\n\\n She protested in Catalan and her head fell to the side as she slept soundly as usual.\\n\\n He rose to wash the sweat off him, soaking a cloth to run over his body, and saw blood. Turning to the bed, he spied it on the sheet like an accusation, and it twisted something inside him. He was a man, and no one had ever explained to him how to take care of his woman after he took her virginity. Not that conversations like that abounded, but Court was never supposed to have a woman of his own. Was never supposed to even entertain thoughts of a woman like her.\\n\\n He wanted to lessen any hurt he had caused her. He knew she\u0027d be embarrassed if anyone saw the blood on the sheet, and he thought that even though she\u0027d be prepared for the sight of it on her thigh, it might startle her just the same. Brows drawn together, he soaked another cloth, then went to grasp her shoulder. \"Anna, I\u0027m goin\u0027 tae take care of you.\"\\n\\n \"Of course,\" she murmured, making his chest swell.\\n\\n He brought the cloth to her thighs and ran it over her skin, then over her sex. He could see her squeezing her eyes shut, but he didn\u0027t want her embarrassed in front of him. She was his now, and it was his due to get to care for her.\\n\\n So instead of removing it, he held the cool cloth against her, thinking that it might soothe her. When he went to take it away, she softly grasped his wrist and held him there. Her breathing was deepening, and when her hand slipped to her side, he barely heard her whisper, \"Thank you.\"\\n\\n She trusted him.\\n\\n She\u0027d trusted him with her safety and her life and now her innocence.\\n\\n He hoped she\u0027d made a good decision.\\n\\n With her asleep once more, he lifted her as he removed the bottom sheet, then placed her on the top one. He balled up the stained linen and tossed it in the corner, planning to wake before her and get rid of it. When he joined her, she curled into him, her body warm and soft. He brought her to his chest and probably held her too hard again.\\n\\n Sleeping with her was a luxury he\u0027d never thought to enjoy again. To be able to touch her and smell her hair whenever he pleased... To have her body wrap around him and to feel her breaths on his chest. Could his luck ever run this high? To have her accept his childless fate as her own. A short, amazed laugh. Not childless - just playing out a little differently than he\u0027d expected.\\n\\n She was his. And he was going to overcome any obstacle that might keep her from staying that way.\\n\\n When Hugh returned, he would ask his advice on weaponry to kill the Rechazados to a man. Court had already sent word to his crew, ready to get this finished, and expected they would receive it soon.\\n\\n Then he would have to take care of Anna\u0027s brother when he arrived. Llorente wouldn\u0027t have wanted a man like him marrying Anna - even before Court had fought him and delivered him to a despot. That would have to be worked out, which would be difficult because Court didn\u0027t have a lot of experience with working things out. But he would attempt it for her.\\n\\n And then the task he dreaded - telling Anna that he hadn\u0027t been completely honest about her brother. He\u0027d said he hadn\u0027t attacked Llorente, which was true, but they had fought. Would she believe that putting him in jail had saved his life?\\n\\n Her hand trailed down his arm, and when she murmured his name, he pulled her closer to him with the inside of his elbow and kissed her forehead. Yes, she would believe him, and yes, Court would kill anyone who threatened her, and if Llorente didn\u0027t accept the situation, then yes, he\u0027d bloody lose a sister.\\n\\n Right now, even the curse felt beatable. The rest were mere...complications.\\n\\n She was his. \\n\\n","sourceLink":"https://allnovel.net/if-you-dare-maccarrick-brothers-1/page-28.html","bookId":2644,"book":{"id":2644,"title":"If You Dare (MacCarrick Brothers #1)","description":"Storyline: If You Dare (MacCarrick Brothers #1) \\n Kresley Cole introduces a thrilling new romance trilogy featuring fierce Scottish brothers with dangerous lives, dark desires, and a deadly curse. \\n Can he exact revenge? \\n High in the Pyrenees, a band of mercenaries led by Courtland MacCarrick wages war for General Reynaldo Pascal. When Court turns on the evil general, Pascal orders him killed, but Court narrowly escapes and exacts revenge by kidnapping Pascal\u0027s exquisite Castilian fiancée. \\n Can she deny her passions? \\n Lady Annalía Tristán Llorente despises her towering, barbaric captor almost as much as she does Pascal. Her inexplicable attraction to the Highlander only fuels her fury. But nothing will stop her from returning to Pascal—for if she doesn\u0027t wed him, she signs her brother\u0027s death warrant, as well as her own. \\n Can there be love between them? \\n From the moment Court discovers that Anna\u0027s prim façade masks a fiery, brave lass, his heart\u0027s ensnared, and he dares to defy the curse that has shadowed his life—to walk with death or walk alone. But Pascal vows that he\u0027ll hunt the two, never stopping until he\u0027s destroyed them both.\\n","cover":"https://allnovel.net/images/if-you-dare-maccarrick-brothers-1.jpg","author":"Kresley Cole","type":"Historical","source":"allnovel","link":"https://allnovel.net/if-you-dare-maccarrick-brothers-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 10:27:22 PM"}}
