{"id":103562,"no":35,"title":"Page 35","content":"When Court, Hugh, and Llorente rode up the plateaus to Llorente\u0027s home, they had to dodge villagers camping out, weaving around the clothes hanging on their lines, their children playing, and their goats grazing. They\u0027d learned that most of the deserters had been scattered and that small parties raided the valleys, forcing the villagers to come to the one place they could be safe. Oddly enough, the place where the Highlanders were. Court noted that at the first sight of plaid, Llorente\u0027s hands clenched so tightly on the reins they should\u0027ve disintegrated. \"And I believe Court\u0027s crew is in residence,\" Hugh muttered. At the front door, Liam greeted them, graciously showing them into the home. He slapped the seething Llorente on the back and said, \"Any friend of Court\u0027s is a friend of ours. You look familiar. Do you like wine? Whisky? Just tell me whatever you need.\" Inside, Niall and still more men played cards, ate fruit, and snacked on river trout grilled on slate, delicacies that Vitale, of all people, ensured they had plenty of. Court\u0027s men saw him and cheered, asking, \"Where\u0027s our bonny Andorran?\" This made Llorente\u0027s look of fury turn murderous. He yanked Vitale along to the other side of the room, and Court heard him demand, \"I understand about the villagers, but how could you let these Scots overrun us?\" Vitale appeared sorry but unbending, his only concern about Annal¨ªa. Court jerked a chin at Niall, and he rose. \"Doona worry about old man Vitale,\" Niall said as he joined them, slapping their backs. \"Prickly sort till you save his arse from deserters enough times.\" \"We need to discuss some plans with you,\" Hugh said, all business. \"Well, there\u0027s a salon in the front we can go to.\" Niall pointed out the direction. \"By the dismal look on our Court\u0027s face, I think he\u0027ll be wantin\u0027 to avoid the study and the desk.\" Hugh raised his eyebrows, and Court scowled. Niall again slapped Court hard on the back. This time in sympathy. \"Lass steal your heart?\" Court surprised himself by answering, \"I\u0027ll no\u0027 be gettin\u0027 it back.\" Hugh called for Llorente, who reluctantly followed them to the salon, looking dazed with anger. He sat silently and stiffly, appearing uncomfortable in his own home. Court knew no man had ever hated him as much as Llorente. He shrugged. Once they\u0027d all taken seats, Niall outlined the situation. \"Andorra was chaos with people fleeing to high peaks and the deserters battling to escape when the main route to Spain was blocked. We\u0027ve cleaned the countryside of them, collecting the bounties, but there\u0027s a group of about two hundred huddled down around Pascal.\" \"How many Rechazados are left?\" Court asked. \"We took out six in the shootout at the border.\" Niall looked up to the ceiling, remembering. \"Poor MacMungan, the younger one, lost an ear. MacTiernay got shot through his hand. A hole only as big as a beer stein, so it was no\u0027 too terrible - \" Hugh interrupted, \"Seven more down in addition to that. Niall, we\u0027re leaving today to assassinate Pascal and take out the remaining Rechazados for good.\" Niall nodded in understanding. \"And I suppose you rode here first because you want us to round up the remaining deserters? Make even more money?\" He eyed him hard. \"Only \u0027cause you\u0027re family.\" He glanced over at the silent Llorente, frowned, then turned back to Hugh and Court. \"So what\u0027s brought down the wrath of the MacCarricks?\" Hugh answered, because Court could not. \"One of the Rechazados shoved a gun to Annal¨ªa\u0027s temple and was seconds from killing her right before Court\u0027s eyes. Does things.\" Niall\u0027s face went cold in an instant. \"Why did you no\u0027 say so? The crew will be furious.\" He slapped his hands and rubbed them together. \"It\u0027ll be a slaughter....\" \"Well, I\u0027ve never been greeted quite that way.\" Annal¨ªa\u0027s hand flew to her mouth. She ran for a towel by the basin to wipe the woman\u0027s skirts - the only thing she could think of in a situation like this - but heaved again once there. Olivia chirped over her shoulder, \"I told you there was a new Scottish woman.\" Lady Fiona asked Olivia, \"What is wrong with her?\" \"Perhaps she\u0027s upset that Mr. MacCarrick has left her like this. She and Mr. MacCarrick, the Courtland one, traveled together - alone - for several weeks. Just the two of them. They became...very close.\" What was she babbling about? Maybe Annal¨ªa had gotten sick because Courtland\u0027s mother just brought into relief something she\u0027d been struggling with since they\u0027d gone. Do you ken that you canna have him.... Why not? When he was all she wanted in the world? She gripped the side of the table, squeezing to get herself under control. Lady Fiona\u0027s voice was halting when she asked, \"Are you saying?...\" Annal¨ªa turned then and caught Olivia nodding slyly as the woman studied her. \"I\u0027m going to change my skirts,\" Lady Fiona said, never taking her eyes from Annal¨ªa. \"Olivia, dear?\" \"Yes, Lady Fiona.\" \"Do not\" - she raised her hand in a stopping gesture - \"let her go anywhere.\" As the strange woman bolted out of the doorway, Olivia called, \"As you wish, milady.\" Her voice was so saccharine, Annal¨ªa nearly emptied her stomach once more. When they were alone, Olivia said, \"You need to clean up,\" then took her shoulder and ran a wet cloth over Annal¨ªa\u0027s startled face. She did it hard enough that Annal¨ªa asked, \"Have you never done this before?\" \"Of course, everyone was so kind in Pascal\u0027s household, always caring for each other. What do you think?\" She handed her a cup. \"Rinse your mouth out.\" Annal¨ªa quickly did. The woman swept in directly after. \"Now, Lady Annal¨ªa - \" Olivia interrupted to say, \"Pardon me, but she likes to be called simply \u0027Anna,\u0027 since it sounds more Scottish that way. And of course that\u0027s what Mr. MacCarrick calls her.\" Annal¨ªa swung a lowering glare on Olivia. \"Of course, Anna.\" Lady Fiona looked so pleased, so touched, that Annal¨ªa didn\u0027t correct her. \"So you and my son became close?\" Absurdly, Annal¨ªa looked to Olivia to answer. When Olivia nodded, she said, \"Yes, Lady Fiona.\" \"You care for him?\" \"Yes.\" Her eyes began watering. She loved him. So much her heart pained her all the time. She put her nails into her palms to stop herself from crying. But Lady Fiona\u0027s sharp-eyed gaze flickered over her hands. \"And it was only you and my son, together for all those weeks on the road?\" Olivia answered for her in a conspiratorial tone, \"It\u0027s been just her and your son since then as well. He\u0027s exceedingly proprietary about her. He hit her brother when he tried to take her from him.\" Annal¨ªa rubbed her clammy forehead. \"What are we really discussing here?\" she asked much too tartly. \"Lady Fiona is trying to determine if Courtland MacCarrick was your only lover.\" She gasped in shock. \"Of course he was!\" she blurted, too late realizing what she\u0027d just admitted. She was humiliated, her face flaming in front of Lady Fiona. She turned on Olivia, telling her with her eyes, Rat. Weasel. All low animals... Wait, why was the woman trying to determine that? It wasn\u0027t her business. \"With respect to you, I must say this is a private matter that I will not discuss.\" \"But it\u0027s no\u0027 wholly private.\" Lady Fiona approached Annal¨ªa to stroke the damp hair from her forehead in a maternal gesture. \"For this family your baby means so much.\" \"Qu¨¨?!\" After swift preparations, the entire band rode out, arriving near Ordino late in the night. Niall\u0027s men were to remain outside the city waiting in ready while Court, Hugh, and Llorente slipped in. The three found a vantage where they could assess the Rechazados\u0027 camp - an old stone manor high on a mountain cliff. \"If I can find a fracture,\" Hugh said, scrutinizing it, \"I can take the top of the mountain out.\" \"How are you going to get up there?\" Court asked, scanning the mountain from the bottom to its sheer top. \"Scale it. I\u0027d planned to anyway, to make sure only Rechazados were inside.\" \"Are you going to be able to scale down quickly enough?\" Hugh faced him with a shadow of a grin. \"I\u0027m bettin\u0027 on yes.\" Llorente finally spoke to them to ask, \"Do you need one of us to go with you?\" \"I work better alone,\" Hugh said. He always said that. Hugh slapped Court on the shoulder and said to Llorente, \"You have the privilege of protecting them now. Doona hesitate tonight or you\u0027ll fail. And if you get my brother killed...\" He leaned in toward him. \"Just doona get my brother killed.\" After slinging his ropes over his shoulder, Hugh carefully stowed his volatile explosives. With a nod, he casually said, \"When you hear the bang, then.\" Court and Llorente set out after he left and advanced to a smaller town house, not nearly as grand as he\u0027d seen Pascal in last. \"If Olivia has led us astray,\" Court began, \"I\u0027ll return to England and kill her myself.\" Llorente scowled. \"She wouldn\u0027t lead us astray. See? Why would there be guards otherwise?\" Three guards did front it. \"You goin\u0027 to be able to take down one?\" Court asked. Llorente pulled out his pistol. \"I can do what I need to.\" Court shook his head. \"No\u0027 a chance. It\u0027s got to be quiet and quick. Ever slit a man\u0027s throat before?\" \"Not exactly.\" Court\u0027s brows drew together with realization. \"Kill anybody before? A single deserter?\" He grated, \"No.\" \"Oh, bloody hell, Llorente,\" Court muttered. \"You might\u0027ve mentioned this earlier.\" Annal¨ªa paced, occasionally kicking the bed, sometimes affecting a Scottish brogue to mock MacCarrick. \"I canna get ye with bairn, Annha.\" She didn\u0027t care that Lady Fiona stared on in bemusement. \"My dear, he truly believed it. And it was true before you.\" He\u0027d said he couldn\u0027t, and since her courses were irregular and often came late, Annal¨ªa had never even considered this possibility. Yet now it was an actuality. \"I am no expert, but I know a man can\u0027t be...he can\u0027t be...fruitful with only one specific woman. Things like this cannot happen.\" This curse nonsense made her head hurt. If Fiona hadn\u0027t appeared so sad, so remorseful when she\u0027d related it, Annal¨ªa would have laughed. \"But it has. There must be something among the last two lines about binding with the right woman, or finding her.\" Annal¨ªa didn\u0027t believe in the supernatural. Her father had always told her in a derisive tone, \"Why do people bring the supernatural into the equation when they can\u0027t even control the natural? Only a fool would.\" \"Please, I don\u0027t want to hear any more about the book.\" Annal¨ªa was already half delirious. Fiona insisted, \"If you\u0027d just go downstairs and touch it, you\u0027d feel there is something there, some power.\" \"Of course there\u0027d be power,\" Annal¨ªa conceded. \"Because clearly the book was written by elves,\" she breathed with wide eyes. Fiona chuckled, then appeared startled that she\u0027d laughed. Annal¨ªa figured she\u0027d laughed in the years before this as much as her sons had. Olivia rolled her eyes at Annal¨ªa, then asked, \"Lady Fiona, will you tell Ethan?\" Fiona said with obvious reluctance, \"I will, but no\u0027 until Anna leaves. He\u0027s been most affected by the curse and, unfortunately, he\u0027d think badly of her before he believed the babe was Court\u0027s. But Hugh I\u0027ll tell at the first opportunity.\" \"He should think badly of me regardless! I\u0027m ruined. Courtland never asked me to marry him.\" \"Because he loves you and dinna want to see you hurt. After the attack he would have felt responsible. But he said words to you, words that you doona say to anyone but the one you want for the rest of your life.\" \"That\u0027s all well and good, Lady Fiona. And I appreciate the sentiment - it means much that he has said these things to me. But some Gaelic love words aren\u0027t going to give my - Mare de D¨¦u - my baby a last name.\" Fates were inescapable. Look on the bright side, she told herself, nearly laughing out loud. At least I can no longer look down on my mother. \"A little more efficiently, then,\" Court advised Llorente as the third guard dropped, though he wasn\u0027t completely unimpressed. \"Go to hell, MacCarrick,\" Llorente snapped. \"Give it time,\" Court mused. \"Now move fast. We need to get there before Hugh sets up.\" They entered the building, treading down the dimly lit halls that Olivia had mapped for them. Just as she\u0027d predicted, they heard Pascal inside the manor\u0027s office. At the end of the adjoining hall, they set up against opposite walls, Llorente with two pistols and Court with his rifle and pistol. Court said in a low voice, \"The men with him will believe the explosion is the arsenal blowing from an attack. When they run out, pick them off. Doona hesitate.\" Soon after the manor quaked as the massive detonation sounded outside. Dust from the roof timbers and plaster ceiling rained on them, coating their shoulders and hair. \"Andorran construction,\" Court said under his breath. Llorente cast him a black look. At the explosion, the door flew open, and as predicted, four men ran outside. Court began shooting, Llorente followed, and the men dropped. But another four, this time Rechazados, had lined up, stealing glances at the doorway. Court exhaled. They were going to be here all night. This was what he\u0027d always hated about the job. The bloody downtime - Wait... \"Llorente,\" he hissed in whisper, \"shoot through the wall. Now.\" Taking out the Rechazados behind the walls required more bullets, but eventually they saw through a cloud of white dust and ricocheted stone that they\u0027d fallen. \"As I said, Andorran construction,\" Court mumbled as they advanced past the bodies. He swung his empty rifle to his back, then handed Llorente a handful of bullets. \"Put one in each of their skulls to make sure they\u0027re dead.\" He heard Llorente shooting behind him as he made his way to the doorway to the office. Inside, Court found the Rechazado leader armed with only a knife and scowled. Too easy. He raised his pistol to fire, but his weight left the ground as he was wrenched from his feet. One of the fallen Rechazados had not been dispatched. Court scrambled up, swinging the gun around, and shot twice, killing the man, using two of his three remaining bullets. He spied Llorente grappling with another. He had the advantage, but Court couldn\u0027t risk it. \"God damn it, Llorente.\" \"They won\u0027t die!\" he responded wildly just before Court fired. That\u0027s why I told you to shoot them. Now Court faced the Rechazado leader with an empty pistol, knowing he\u0027d never be able to reload in time. When the man tossed his knife back and forth, taunting him, Court understood what he had to do. \"If you\u0027re goin\u0027 to play with it, let me know, but I\u0027d thought you might get the urge to throw it.\" The man had no emotion on his face, even as he flipped up the blade to pinch the tip. He flung it; Court dodged but caught it deep in his left shoulder. He\u0027d known he\u0027d catch it somewhere at this range. \"My thanks,\" he hissed as he tore the knife from his shoulder. Movement to his right. Court threw the knife blindly. The last thing he saw before the Rechazado soundlessly plowed into him was Pascal levering the blade out from his collar area. He and the Rechazado hurled toward the room\u0027s main window, crashing through the glass onto the street below. Court landed on his back, taking both their weights against his rifle, his pistol knocked from his hand. He scrabbled to his feet, struggling for breath. The man drew another knife from an arm sheath. Court\u0027s lips curled into a sneer. He nodded at the Rechazado, then daubed at his neck, as though indicating to him that he missed a spot shaving or nicked himself. The man lifted his hand and felt the protrusion of glass jutting from where it was buried in his neck. Court would give him five minutes. Fewer if he removed it. Court doubtless had a similar wound that he\u0027d been incapable of feeling and willed himself not to look down. The man stumbled, but his knife stayed poised. Court ventured a look in the window and saw Llorente and Pascal in a pistol-to-pistol standoff. Though blood had spread across his shirt, Pascal began speaking to Llorente, just as Court had known he would. The Rechazado lunged and Court skipped back, but all the while he could hear.... \"Surprising that my daughter chose a life with you over one with me,\" he said, his tone even and mild despite the injury. \"And I\u0027m not often surprised.\" \"I\u0027m sure she had other reasons to leave you.\" \"Yes, I believe she found out that, sadly, the odds are against my being her father.\" Court heard it all, but remarkably the Rechazado was still prowling. Court glanced up and saw Llorente\u0027s brows drawing together. Don\u0027t get dragged in, he wanted to yell, but knew if he distracted Llorente for a second he\u0027d get him killed. He began digging for a bullet, but the Rechazado flicked the blade up, readying to throw. Court put his hands up. They continued to circle. \"She didn\u0027t tell you?\" Pascal made a tsking sound. \"That\u0027s not very forthcoming of her, and I do apologize in the case that she actually is mine.\" He smiled a sheepish smile, looking so...sane, then added, \"If you do happen to get out of this alive, please tell her that her dubious parentage is all her mother\u0027s fault.\" The Rechazado lunged and Court dodged. \"I will never tell her that her mother was impure,\" Llorente grated. \"Did I say she was impure? It was her very purity that attracted us. Not only a devout widow, but beautiful as well. How could we not have her that night?\" At that Court had to glance up. Llorente\u0027s face was twisted with fury, his hand shaking just as Pascal intended. Court faced the Rechazado with an irritated look. \"Be quick about this, man. I doona have all night.\" Finally, he gurgled blood, and his knife hand drooped. Court strode up, knocked the knife down, and without slowing, he twisted the man\u0027s neck until it broke. Below the window, he collected the rifle, taking time only to load it with one bullet. He ratcheted his arms up, and set his shoulders. Court drew a bead on Pascal and fired. Pascal fired and fell. Immediately sounding from inside: \"God damn it, MacCarrick!\" Then more weakly: \"You got me shot....\"","sourceLink":"https://allnovel.net/if-you-dare-maccarrick-brothers-1/page-35.html","bookId":2644,"book":{"id":2644,"title":"If You Dare (MacCarrick Brothers #1)","description":"Storyline: If You Dare (MacCarrick Brothers #1) Kresley Cole introduces a thrilling new romance trilogy featuring fierce Scottish brothers with dangerous lives, dark desires, and a deadly curse. Can he exact revenge? High in the Pyrenees, a band of mercenaries led by Courtland MacCarrick wages war for General Reynaldo Pascal. When Court turns on the evil general, Pascal orders him killed, but Court narrowly escapes and exacts revenge by kidnapping Pascal\u0027s exquisite Castilian fiancée. Can she deny her passions? Lady Annalía Tristán Llorente despises her towering, barbaric captor almost as much as she does Pascal. Her inexplicable attraction to the Highlander only fuels her fury. But nothing will stop her from returning to Pascal—for if she doesn\u0027t wed him, she signs her brother\u0027s death warrant, as well as her own. Can there be love between them? From the moment Court discovers that Anna\u0027s prim façade masks a fiery, brave lass, his heart\u0027s ensnared, and he dares to defy the curse that has shadowed his life—to walk with death or walk alone. But Pascal vows that he\u0027ll hunt the two, never stopping until he\u0027s destroyed them both.","cover":"https://allnovel.net/images/if-you-dare-maccarrick-brothers-1.jpg","author":"Kresley Cole","type":"Historical","source":"allnovel","link":"https://allnovel.net/if-you-dare-maccarrick-brothers-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 10:27:22 PM"}}
