{"id":103564,"no":37,"title":"Page 37","content":"As Annal¨ªa set out for her meadow, she passed Vitale with his friends playing dice and wished him snake eyes. \"You look different,\" he remarked as he squinted at her. \"Do I?\" When she\u0027d told Vitale she was carrying, he\u0027d been delighted that another child would be running about the mountain, but he\u0027d also confessed that he was pleased it didn\u0027t work out with MacCarrick. \"I love you like a daughter,\" he\u0027d said. \"But following you to Andorra was one thing. There was no way I\u0027d follow you to Scotland.\" Now Vitale studied her. \"You look...determined.\" \"I am.\" She patted her book on the Gaelic language. \"Determined to learn Gaelic by next spring.\" \"Ach, lass¨ªe,\" Vitale quipped, still sounding terribly French. His friends laughed uproariously. She even chuckled as she continued on. When she\u0027d found out she was pregnant, she\u0027d asked Lady Fiona for an instruction book. The woman had given her tomes, so delighted that Annal¨ªa was interested in their culture and language, so proud that Court had found her. Even as Fiona regretted the past. Annal¨ªa was starting slowly. Luckily, she\u0027d only just been digging into Greek when MacCarrick came into her life. She believed her capacity for languages had a ceiling of five. Although she\u0027d been making steady progress, she couldn\u0027t seem to focus today. The flowers in her meadow smelled too wonderful, and the sun teased her face until she wanted to remove her hat. And she kept returning to the book to trace her finger over the definition she\u0027d found of \"Mo cridhe.\" My heart. That\u0027s what he\u0027d called her. \"Neach-d¨¬olain.\" That\u0027s what she would call him. Bastard. She resolved to take off her hat, and was just shaking her hair loose when she saw something that could not be right. She leapt to her feet, heart thudding, her hat falling from her limp hand. She\u0027d just gotten to where she wasn\u0027t crying herself to sleep each night! MacCarrick spotted her and rode toward her. He looked tired and worn. And resolute? Wait! She was furious with him. She didn\u0027t even know if he was here for her. He probably left a belt or his favorite pistol or a lucky machete he needed to retrieve before he went back to work. She knew that must be why he was returning - any man who could wish her well after what they\u0027d had...Yet she was still dizzy. She inhaled deeply and rocked on her heels. Her brows drew together, and as she saw the sun straight ahead, she muttered, \"Merda.\" She just collapsed? Court felt like he\u0027d had his breath punched from him even as he spurred his horse. He didn\u0027t wait for it to stop before he swung off and rushed to her, scarcely noting the pain from his leg. She never got sick. She must be injured. He\u0027d kill Llorente. What good were the bloody guards down there when she was outside and alone up here? Fortunately, she\u0027d fallen into thick flowers. He grabbed her shoulders and drew her up to him. \"Anna!\" Cradling her head, he frowned. She didn\u0027t look injured or ill at all. He ran the backs of his fingers over her cheek. Warm, golden skin. \"Anna?\" When she blinked open her eyes they were clear and bright and focused on his. \"What\u0027s happened tae you, mo cridhe?\" His voice was hoarse. Now she rolled her eyes in irritation and stiffened in his arms. \"I\u0027m fine, thank you.\" She pulled away from him and sat up. He reluctantly let her go. \"Why\u0027d you faint?\" She hesitated, then said, \"My dress was laced too tightly.\" He swept a glance over her dress and found it was snug across the bodice. Finally, she\u0027d put on some of the weight she\u0027d lost. His gaze flickered over her neck, and he saw with pride that she wore the necklace. \"Women faint all the time,\" she added. They did. Yet he could name ten instances when she surely should have fainted and hadn\u0027t. \"Did you forget something?\" she asked crisply. His brows drew together. \"No. I wanted tae check on you.\" \"I appreciate your checking on me, but I\u0027m doing fine.\" \"Aye, you are.\" She looked amazing, more beautiful than he had ever seen her. Had he hoped to find her miserable? Bloody hell, yes, he\u0027d hoped that. Because he was a selfish bastard, and he wanted her to miss him as fiercely as he did her. She never could eat when she was anxious or unhappy, and yet without him she\u0027d put on flesh, making her body softer and rounder. She\u0027d been content. Why was he still here, then? Why wasn\u0027t he turning away? Out of the corner of his eye, he spotted her hand flitting in the flowers behind them. He peered over her at the book she was slipping under her skirts. \"You\u0027re studying Gaelic?\" \"Greek or Gaelic. Really, what\u0027s the difference?\" she said airily, but at his look she added, \"Very well. I have no personal connection whatsoever to Greece, but I\u0027ve been treated shabbily by a Gael.\" He flinched. \"You could\u0027ve written. I would have responded that everything was well and saved you the trip.\" \"I wanted tae see you.\" \"You wanted to see me. You can\u0027t just go in and out of my life whenever you please because of what you want. You left without even a good-bye. After all we\u0027d been through together, you wished me well.\" \"If I saw you, then I would no\u0027 be able tae leave you. I left you for you.\" She tilted her head. \"I don\u0027t understand.\" \"I need tae explain something.\" \"If this is about the curse, then your mother\u0027s already told me.\" He lowered his voice to say, \"She told you about...about the Leabhar?\" When she nodded, he said, \"It\u0027s no\u0027 something she has ever talked about since my da\u0027s death. Do you know what it says?\" \"Yes, I read it.\" He couldn\u0027t believe Fiona had allowed Anna near it. They would have words over this. \"That\u0027s what I thought I would bring to you. The more I cared for you, the more I knew I had tae leave.\" Her smile was cold. \"Yet you\u0027re here now? What does that tell me?\" \"Aye, I\u0027m here. Because something that is in the lines has been proven false.\" \"What would that be?\" Annal¨ªa asked, feigning nonchalance. She didn\u0027t want him to come only for the baby. He must\u0027ve already gotten Aleix\u0027s missive to Groot\u0027s, but how so soon? Perhaps his mother had written before she and Olivia had even left. Annal¨ªa would always wonder in the back of her mind. He was thrumming with some emotion, tense with it. \"It says I will no\u0027 know love.\" He stood and ran a hand through his hair. \"But damn it, I do.\" Her lips parted. His face was hard, intent, but his eyes...\"Above all things I love you.\" His expression tightened. \"I could be out of my mind. I want you so badly that I want tae believe the rest is false. I could be hurtin\u0027 you right now.\" His brogue was thick. \"Maybe it means I\u0027ll no\u0027 know love from another.\" He winced, apprehension clear on his face. \"I had no\u0027 thought of that.\" He looked so guilty, she found herself easing to her feet and murmuring, \"That\u0027s false, too.\" He took her shoulders. \"You told me once. But you were half asleep and hurting, and I dinna dare believe it. You could even after I left you?\" Her brows drew together. He was nervous. She laid her hand on his chest, curious. The simple touch made him close his eyes. Nervous. Beneath her palm, his heart was thundering. With that, the resistance she\u0027d thought she could hold on to slipped from her fingers. The truth left her lips, \"Your leaving hurt me. Badly. Even though I was so confused and afraid, I never stopped.\" His eyes opened, and she saw they were full of pain. \"I wish I had no\u0027 hurt you. I never wanted tae.\" \"I know,\" she said with a sigh. He\u0027d always wanted her happiness, had always hated the idea of her hurt. How the attack must have seemed, the blame he would\u0027ve placed on himself... \"I still feel that I canna risk your safety. I canna settle in with the idea,\" he said. \"Though everything in me wants tae.\" \"MacCarrick, I really don\u0027t believe there\u0027s any risk.\" He leaned in, putting an arm around her as though to shield her from being struck down. \"We canna scoff at it,\" he warned in a low tone. \"It is very real. And I\u0027ve lived my life with that hangin\u0027 over me. It made me what I am.\" She pushed him back to face him. \"Then I thank it! But I must respectfully demand its exit from our lives. What we could have together is stronger than anything dire in that book.\" He shook his head. \"So much of it has come true. None of us with children because the book ends with our generation - \" \"It ends with your generation because our children will make their own fate!\" His dark eyes revealed his regret. \"Anna, you know that I will no\u0027 have - \" She took his hand and placed it on her belly. Court grew very still. \"What are you sayin\u0027?\" His hand on her began shaking. He\u0027d kissed her there, caressed his fingers over her, and he knew that there to the touch was the slightest rounding. She pushed his hand away. \"I\u0027m saying the book seems to be getting everything wrong when it comes to you. And that you\u0027re getting more than you bargained for.\" \"You\u0027re...\" He swallowed hard. \"You are...\" She put her chin up. \"I\u0027m carrying your child.\" I bind you to me. The first night - the first night he\u0027d made love to her. He had bound her to him and claimed her. At the same time, he\u0027d felt that everything he was became hers as well. They\u0027d done this then. She was carrying his child. He stood, staggered. She was right. He was getting more than he\u0027d bargained for. He\u0027d only had a faint hope today of finding a way to be with her, and yet he\u0027d discovered that she loved him. How the hell she did, he couldn\u0027t imagine, but he knew better than to question such fortune. The babe would be his permission to keep her, and proved that the Leabhar had something else in store for him entirely. He felt the weight of that worry lifting for the first time since he\u0027d read it. Suddenly, falling to the ground seemed like a bloody fine idea. \"Your mother says early spring.\" \"She knows?\" \"Yes. She is very sorry about the past and wants to speak with you soon.\" The only way he\u0027d do it would be if Anna asked it of him, but he feared she might just. \"How is she reconcilin\u0027 it, then?\" \"Olivia came up with a theory.\" Impersonating Olivia\u0027s accent, she said, \"\u0027The ten lines begin with death and misery, loneliness and suffering, et-cet-era, et-cet-era, until the last two, which obviously say all of these unpleasant things will occur, until the blockheaded Scot comes to Andorra to pluck the spoiled little ninny from a mountain.\u0027\" She grinned. \"Your mother believes it\u0027s something along those lines but nicer - perhaps about binding with the woman fate meant to be yours.\" \"And what about the man meant for you? Would you want tae be marryin\u0027 someone like me?\" His voice was gruff. \"I can\u0027t say.\" She turned from him and said over her shoulder, \"I need to know what type of life we would live. I won\u0027t have you going away all the time risking your life.\" \"Then I\u0027m retired,\" he quickly said, striding in front of her. She gave him a soft smile. \"That\u0027s what I wanted to know.\" But he continued on, \"I\u0027ve got a place in Scotland. Beinn a\u0027Chaorainn, it\u0027s called. A long-neglected keep that needs work, but a lot of land. It\u0027s hilly, with mountains in the back, so you might like it. I vow I will make it so you do.\" \"Are you trying to convince me, Courtland?\" She jabbed her finger at his chest. \"Do you honestly think there is any way you will be leaving here without me?\" He was stunned and didn\u0027t bother to hide it. At his expression, she grinned and ran that finger up and down his chest. \"What does the Beiiinnn-something mean?\" She was touching him playfully as if she\u0027d missed simply being with him, an idea more gratifying to him than she could know. He felt the corners of his lips curl. \"Beinn a\u0027Chaorainn means...Land of Marsh and Pestilence.\" \"Oh.\" Her face fell, but then brightened. \"You said it needs work.\" She asked hopefully, \"Does that include draining swamps?\" He put his hands on her shoulders and stroked the sides of her neck. \"I\u0027m teasing you, mo cridhe. It means Hill of the Rowan Tree.\" She cuffed him with the back of her hand, then returned it to his chest. \"Hill of the Rowan Tree. Pendant del Roure,\" she said, rolling the r\u0027s in that voice he\u0027d longed to hear, making his home\u0027s name her own. As she should. \"I do think you could like it there, but if you doona, then I\u0027ll take you wherever you can be happy.\" She went to her toes to nuzzle her face against his neck, again stunning him. \"I\u0027m happy where you are.\" His eyes closed from the tenderness in the gesture. She wants to be with me, he thought in amazement. Damn, if she doesn\u0027t want to. She drew back and said, \"But on the way there, we\u0027ll need to stop in Paris.\" He swallowed and nodded. \"Anna, I\u0027ll deny you nothing.\" If money was the only obstacle between them, he\u0027d bloody well rob trains. She tilted her head. \"Oh, you think I want to go shopping.\" He made his expression stoic. But sadness flashed in her eyes. \"Thank you for the offer, but I\u0027ll have to decline. This stop is of an entirely different nature.\" When his brows drew together, she said, \"I\u0027ll tell you on the way. But if we\u0027re going to Scotland, then you have to get me over the mountain before I get too big to fit through the pass.\" She glanced around and added conspiratorially, \"Trust me, you do not want to be stuck here for the winter with Aleix and Olivia mooning over each other.\" He grinned and leaned down to put his forehead against hers. \"Anna, I\u0027ll take you away whenever you please. I still canna believe that you...that we...I thought I\u0027d lost you.\" She twined her arms around his neck. \"I don\u0027t suppose you can lose the woman fate decided was to be yours. You only needed to find her.\" \"I have found her. And I\u0027ll no\u0027 be lettin\u0027 her go.\" He laid his hands on her cheeks and gently kissed her. \"Actually,\" she murmured against his lips, \"I found you.\" Epilogue Not to marry, know love, or bind, their fate; Your line to die for never seed shall take. Death and torment to those caught in their wake, Unless each dark one finds his forechosen mate. For his true lady alone his life and heart can save....","sourceLink":"https://allnovel.net/if-you-dare-maccarrick-brothers-1/page-37.html","bookId":2644,"book":{"id":2644,"title":"If You Dare (MacCarrick Brothers #1)","description":"Storyline: If You Dare (MacCarrick Brothers #1) Kresley Cole introduces a thrilling new romance trilogy featuring fierce Scottish brothers with dangerous lives, dark desires, and a deadly curse. Can he exact revenge? High in the Pyrenees, a band of mercenaries led by Courtland MacCarrick wages war for General Reynaldo Pascal. When Court turns on the evil general, Pascal orders him killed, but Court narrowly escapes and exacts revenge by kidnapping Pascal\u0027s exquisite Castilian fiancée. Can she deny her passions? Lady Annalía Tristán Llorente despises her towering, barbaric captor almost as much as she does Pascal. Her inexplicable attraction to the Highlander only fuels her fury. But nothing will stop her from returning to Pascal—for if she doesn\u0027t wed him, she signs her brother\u0027s death warrant, as well as her own. Can there be love between them? From the moment Court discovers that Anna\u0027s prim façade masks a fiery, brave lass, his heart\u0027s ensnared, and he dares to defy the curse that has shadowed his life—to walk with death or walk alone. But Pascal vows that he\u0027ll hunt the two, never stopping until he\u0027s destroyed them both.","cover":"https://allnovel.net/images/if-you-dare-maccarrick-brothers-1.jpg","author":"Kresley Cole","type":"Historical","source":"allnovel","link":"https://allnovel.net/if-you-dare-maccarrick-brothers-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 10:27:22 PM"}}
