{"id":14505,"no":25,"title":"CHAPTER I THE COURT OF CHARLEMAGNE","content":"Because it was both midday and high summer, the thrushes that gave its pretty name to the old farmhouse of Le Clos-aux-Grives, near Lanvennec in Finistère, were not singing; and though the same hour of noon which silenced them called insistently for some voice from the large iron cooking-pot that hung over the fire in the living-room, the pot also was mute. Yet Lucien du Boisfossé, wearing as serious a face as that which he had bent over the ?neid at Hennebont, was seated on a stool near it, almost under the deep recessed hearth, and from time to time he would rise, take off the lid, and peer into its contents. The youthful cook was not alone in the big, low room—far from it. On one of the aged black oak settles that ran out at right angles from the hearth was seated Artamène de la Vergne, leaning forward with his elbows on his knees and a riding-switch between his hands. He was regarding his friend’s occupation with much the same amused criticism which he had bestowed on Roland’s bedmaking in M. Charlot’s attic four months ago. And at least a dozen other gentlemen, some quite young, some in the thirties or forties, were also in the room, talking and laughing. For though the three treasure-seekers who had formed part of the smaller gathering at Hennebont were still missing, their places, as far as numbers went, were amply filled. The projects which had been discussed with Georges Cadoudal on that occasion were in a fair way of realisation to-day. Finistère was in process of organisation—at the cost of weeks of unremitting toil and danger, in which M. de Kersaint had personally traversed all the wildest districts of the department. As far as the promise of men went, the harvest was good, but, as usual, the pinch came over arming them—and Mirabel had not yet yielded up its treasure. The chief source of encouragement, however, lay in the aspect of the political situation: the effect produced by the numerous Austrian and Russian victories of the spring and summer—not yet indeed come to an end, for it was the eve of Novi; the weariness of the country, still groaning under a detested but tottering government; the hopes based on the important Royalist movement centred in Bordeaux, which embraced Toulouse and Languedoc, and not a little, too, on the revulsion caused by the cruel operation of the Law of Hostages of July 12, which actually forced recruits into the Chouan camp. Of the other Royalist leaders many were still in England. And the Marquis de Kersaint was not advertising himself; with the means at his disposal—for in no one place could he hope to get together a really formidable force—his aim, when the time came, was to surprise rather than to defy. Weeks, however, would probably elapse before concerted action was taken, and meanwhile he had still to find most of the arms and ammunition required. And, though he had his staff round him here, his men, his gars, were, with certain exceptions, going about their usual avocations, cultivating their farms or preparing for harvest. Only, one day, when the whisper went round, the hoe and sickle would lie idle in the fields, and he who had been a small farmer would turn up in the likeness of a brigand at the rallying-place—Galoppe-la-Frime or Frappe d’Abord the Chouan. In one thing alone was M. de Kersaint singular, in that he already had a regular headquarters and was able to occupy it unmolested. Even Cadoudal and his subordinates in the Morbihan judged it prudent to leave theirs by night, and sleep dispersed in the forest. That M. de Kersaint and his officers could remain with impunity at the Clos-aux-Grives, that despatches found their way there and that it was the discreet centre of a continual going and coming of emissaries, as the work of organisation advanced towards completion, was owing to the fact that it stood in furthest Finistère, the most remote and untouched part of the intractable West. It was too difficult for the Blues, as they were termed, to get at it. And so, in this large farm-house, once a manoir, all but the superior officers of M. de Kersaint’s staff were awaiting their noontide meal this August day. The old greenish glass in the tiny panes admitted a tempered light, but the room was large enough to have windows on both sides, and it was a pleasant apartment. At night it was used as a dormitory by the younger officers, who slept on pallets on the floor, for which reason, and also because it was mainly ‘les jeunes’ who inhabited it at any time, M. du Ménars, acting second-in-command till the Comte de Brencourt’s return, had christened it ‘the nursery’—earning thereby small gratitude from Lucien and Artamène and their peers. On the long table, dark with the polish of ages, were set platters, horn spoons and forks, bowls of the cheerful Quimper ware, and jugs of cider, but the meal, whatever its nature, seemed to be dependent on the boiling of Lucien’s pot, to which process, indeed, other eyes than Artamène’s were directed. M. de la Vergne himself was moved at last to expostulate, though as a matter of fact he had only come into the ‘nursery’ five minutes before. Stretching out an arm, he tapped the pot with his switch, and said gently, “What is in this receptacle, my good Lucien? Stones?” “I am sure I don’t know,” replied M. du Boisfossé in a rather exasperated voice. “They brought it in here from the kitchen, and said it would finish cooking nicely, if I would just see that the fire was kept up. And I’ve put sticks and sticks on the wretched thing——” “And blacked your face into the bargain,” finished his friend brutally. “I expect it is the mortal part of that superannuated cow I have seen about. . . . Never mind, time conquers all things, even cows. Put on yet more sticks, and while the old lady simmers I will tell you a piece of news. M. le Marquis is going to recall—you can guess whom!” “Not our long-lost Roland?” exclaimed Lucien, starting up. Artamène nodded. “If you agitate yourself, mon ami, you will knock your head against the hearth next. Yes, it appears that the convalescent adventurer has written him so penitent and piteous a letter from Kerlidec that our leader’s heart is softened, and he is writing to tell Roland that he may rejoin us. You have heard, of course, gentlemen,” he went on, addressing a little group of newly-joined young officers who had strolled over to the hearth, “how our paladin was unhorsed at Roncesvalles—that is to say, winged by the guard of the enchanted castle of Mirabel. But he did not fall into the hands of the Saracens, like M. de Brencourt, his successor, for the princess who inhabits the same, in other words, the concierge, taking pity on him, nursed and smuggled him out of Mirabel again to his relatives in Paris. Thence, when he was sufficiently recovered, the poor Roland returned home to, I am afraid, a very irate grandparent.—Keep the dowager going, Lucien!” “And now you say that Charlemagne has relented, and is going to summon him here?” said Lucien, taking up his friend’s metaphor. “What a mercy!” “I suppose M. le Marquis has been anxious about M. de Céligny?” suggested one of the newcomers. “Yes, very anxious—and more than anxious, exceedingly angry,” replied M. du Boisfossé. “Isn’t that so, Artamène.” “Parbleu!” remarked M. de la Vergne, making a face. “Do you mean angry with you, Chevalier?” pursued the enquirer. “Why?” “Because I had a hand in M. de Céligny’s enterprise,” explained Artamène, sighing gently. “I would fain have shared it altogether, but I was winged myself then. We planned it together in our retirement last spring—if what we had to leave so largely to chance can be said to have had a plan. And then, when Roland had set out, his grandfather wrote to the Marquis to know what had become of him, and M. le Marquis sent to me, and out it all came . . . at least, most of it. I said that Roland had gone to visit his cousins in Paris, which was true, but not, I must confess, the whole truth. If I may venture a counsel, gentlemen, to such of you as are newcomers, always tell the whole truth when you are dealing with M. le Marquis.” “And when did you tell the whole truth, then, La Vergne?” “When I came here,” replied Artamène. He beat a little tattoo on one boot with his riding-switch, and added in a feeling voice, but with a laugh in the corner of his eye, “—a memorable day.” “Dies nefas,” commented Lucien. “And M. de Kersaint was displeased with you?” “Displeased!” exclaimed the culprit. “Had I possessed the gift of metamorphosis the shape of a mouse, a spider—of a gnat, even—had speedily been mine.” A laugh went round his audience. “But,” objected someone, “I do not see in your case, Chevalier, the reason for this excessive wrath at which you hint.” “Well, for one thing,” returned Artamène pensively, “M. le Marquis had definitely forbidden either of us to go to Mirabel, whereas I . . . and my family . . . had certainly encouraged Roland’s expedition. Then the Marquis seemed to consider also that I had deceived him about Roland by merely telling him of his visit to those confounded cousins (which of course I did solely to shield Roland). In fact he characterised my conduct by a very unpleasant term which I am not going to repeat. (However, we have since made it up, Charlemagne and I.) And thirdly, to such of us as have seen them together, it is undeniable that between M. le Marquis and the Vicomte de Céligny there subsists——” “Chut!” said the prudent Lucien, holding up a finger. “Mais, au nom de Dieu, pourquoi chut?” demanded Artamène in a voice of injured innocence. “I was merely going to say that there subsisted between them a special affection, of which I, for one, am not in the least jealous. What is the harm in that remark?” Nobody present either condemned or absolved him, but one or two who in the spring had seen the couple together turned away to hide a smile. “I still cannot quite understand,” remarked Lucien judicially, “how this good fairy of a concierge came to be inhabiting Mirabel. I thought that the place was in the hands of the Directory, and surely their nominee——” “We shall have to wait until the Abbé or M. de Brencourt returns to discover that,” said Artamène. “I gathered that M. le Marquis expects the latter any day now; it seems, from what the Abbé wrote, a foregone conclusion that he would succeed in escaping from the Temple.” “How?” asked Lucien, his head almost in the procrastinating pot. “Mainly by the use of the root of all evil, mon cher—in plainer language, by bribery. I thought you knew that.” “And M. le Comte did not get the treasure from Mirabel?” asked a newcomer. “No, the booty is left to the Church to secure. And, do you know, I shall stake my money on the Church’s success.” “I wish Roland could have got it,” murmured Lucien. “So do I,” said Artamène. “So does . . . my family.” He got up and stretched himself. “But, dear me, we were very young last spring! I am older now, and wiser—much wiser. And as for poor Roland, he must have attained to such a pitch of sagacity that——” He suddenly stopped and remained fixed, his arms extended, and, staring at an open casement said, “Morbleu, talk of the devil!” “What is it?” exclaimed several voices, their owners following his gaze, while Lucien sprang up and had exactly that encounter with the overhanging hearth which his friend had predicted. “May I be shot if that is not the Comte de Brencourt in person, just ridden into the courtyard!” And Artamène dashed to the window, followed by almost everybody else. But in a moment he had turned away again, shaking his head. “Too late!” he said disappointedly. “He will go straight to M. le Marquis now. Besides, he did not look as if he would be communicative; he had his mouth shut like a strongbox.” And he regretfully strolled back to the fire, which the sedulous Lucien had not deserted. “Good Heavens, philosopher, isn’t that soufflé of yours cooked yet?” “I think,” said M. du Boisfossé, prodding about with a fork, one hand pressed to his head, “that I shall assume the process.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3317/90731.html","bookId":399,"book":{"id":399,"title":"The Yellow Poppy","description":"简介： I wish I had been taught how to make a bed! complained Roland de Cligny, as he wrestled with his blanket in the half-darkness of the attic.You may think yourself lucky to have a bed to make! retorted a comrade who sat cross-legged on a neighbouring p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3317","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
