{"id":14528,"no":48,"title":"CHAPTER XI GASTON GIVES UP THE YELLOW POPPY","content":"(1) It was about six o’clock the next morning that old Bernard, who had just finished dressing himself, looked out of the window of the little ground-floor room in the Palace of the Temple where he slept—for most of the personnel of the prison were housed there, and he indeed, a former servant of the Prince de Conti, had slept there for more years than he could count. The pale, reluctant winter dawn was on the courtyard and its shivering trees. It would be a chilly transit to his duties in the Tower. As he was turning away, blowing on his fingers, he heard unusual sounds in the courtyard, and, after another glance through the window, he went out on to the perron and stood there in some astonishment. A closed carriage—a berline—had just drawn in under the entrance and was coming to a standstill in the middle of the court. Immediately behind, with a great jangle of bits and trappings, came riding two and two a score or so of hussars. What on earth could this portend, at so early an hour? It must be something official, however, since the guard at the entry had admitted the cortège. Even as Bernard stood there he heard himself hailed, and saw the sergeant of the guard running towards him and trying to attract his attention. A little behind him rode an officer. “Holà, Bernard!” called out the sergeant. “You are just the man I want. Take M. le Capitaine Guibert to the Tower at once; he brings orders for the immediate transference of a prisoner. Here, mon Capitaine, is the very gaoler who has the care of those au secret.” The officer dismounted without a word, threw the speaker the reins, and strode up the five steps to where the surprised old man awaited him. He was young, tall and handsome, suitable in every way to the bravery of his sky-blue pelisse heavily barred with silver, the fur-edged dolman of darker blue that hung from one shoulder, and the gaily embroidered sabretache that swung against his leg. But under the high, cord-wreathed shako his face looked impenetrably, almost unnaturally grave. “If you will come this way, sir,” said Bernard a little nervously, and thereafter trotted along in front of him through the palace and the length of its frosty garden, perturbed in spirit, while the officer stalked behind him equally silent. They passed the guardhouse in the wall without comment. At the greffe in the Tower itself the hussar, with the same economy of language, presented an order, and said he wished to see the prisoner in question immediately. The guichetier, having read it through, raised his eyebrows, pursed his lips and transcribed it carefully in a book. It was an order for the delivery of the person of Gaston de Saint-Chamans, ex-Duc de Trélan, known also as the Marquis de Kersaint. “M. de Trélan is au secret—I expect you know that, captain,” he remarked when he had finished. “I hope there has been no dissatisfaction at the Tuileries? I assure you that every precaution is taken for his safe custody.” The young officer made a gesture that might have meant anything, and prepared to follow his guide. To mount that dark, winding staircase on a winter’s morning required a light. Bernard produced a torch and preceded the officer, whose sabre clanked on the steps as he followed him. Half way up, at one of the wickets, the old man paused, and turned to him. “You are taking away our most distinguished prisoner, Monsieur le Capitaine.” “Yes,” replied the hussar. His mouth shut as if he did not intend to say more, and the old man went on again. One sentry—they were of a corps of veterans—was plainly asleep, on the bench by the door, when they got up. His companion, pacing to and fro, shoved him with his foot, and he stood sleepily to attention as the officer passed. In another moment the nail-studded door stood open, and the young hussar, taking the torch from Bernard and motioning him back, went in, pushing the door to behind him. The torch he held, conflicting with the daylight from the high window, showed him the man he had come for fast asleep on the little bed in the furthest corner. He went over to him, stood looking down at him a second or two, and then, with what looked like hesitation, put out a hand to wake him. But at that moment, roused by the light, the prisoner stirred. (2) Gaston had dreamt much that night, dreams commingled of sweet and sinister. Nearly always the menhirs had been in them, the Allée des Vieilles where Valentine had been miraculously restored to him, but they were strangely mixed with visions of Mirabel, where he and she had parted. He stood once more among the old stones, but she was not there; he was to meet her, he knew, at Mirabel, and the idea was sweet. Yet somehow the dream was sinister. . . . And now—he was fully awake on the instant, in the fashion of a soldier and a commander. His first thought was—Hyde de Neuville . . . they had put forward the time . . . here was the pseudo-Republican officer he was to expect. He looked up at the hussar for a second or two—and all that fell away from him for ever. A man in peril is swift of apprehension. This officer was genuine. “You are an early visitor, sir,” he said, raising himself on his elbow. “I may guess, may I not, that you do not come at this hour on any very agreeable errand?” “General,” said the young man, speaking at length for the first time since he had entered the prison, “my errand is hateful. I . . . I am ashamed of the uniform I wear—but as long as I wear it I must obey. . . . Will you read that, Monsieur le Duc?” He held out, not the order he had shown to the guichetier, but another, and brought the torch a little nearer. Gaston took the paper, and, still leaning on one elbow, studied it, and the vehement “Bonaparte” at the bottom, with the marks of the splutter of the pen. His eyebrows went up a trifle, but no other change came over his face. “A little sudden,” he observed. “But after all . . . What time do you wish me to be ready?” “At seven o’clock, General. It is now ten minutes after six.” The Duc de Trélan returned the warrant. “The First Consul is somewhat given to sudden impulses,” he remarked. “As he grows older he will find that they are generally to be regretted. But I think that, after all, I misjudge him; for this was intended from the first. I have about fifty minutes then. Would you be so good, Monsieur, as to see if they could find me a priest while I am dressing; there may be one in captivity in the Temple.—No, do not give yourself the trouble; if old Bernard is there I will ask him myself. And you, Monsieur le Capitaine—shall I see you again?” “I command the escort,” replied the young hussar, looking away. “I will be ready for you then, in . . . forty-seven minutes,” said the Duc, his eyes on the watch he had drawn from beneath his pillow. “Perhaps you will be good enough to leave me your torch for the moment. The oil was finished in my lamp last night, and the illumination here is not very good, as you can see.” The young officer looked round, saw a ring designed for that purpose on the wall, thrust the torch into it, drew himself up, made the captive a magnificent salute, and strode to the door. Next moment the old gaoler looked in, mildly curious. “Monsieur Bernard,” said the Duc, who was now sitting on the edge of the bed, “I have a particular favour to ask you. Can you contrive to heat me some shaving water within a quarter of an hour or so? I wish to be presentable this morning.” “But certainly, only—Monsieur le Duc, what is it, so early? You are being transferred, I gathered?” “Yes, Bernard—if you like to put it so. And besides the shaving water—and a better light to use it by—is there by chance a priest among the prisoners here, think you?” “A priest!” exclaimed the old man, taken aback. “A priest . . . I don’t know—I don’t think so. But why do you want a . . . O Monseigneur!—it’s not that!” “It is indeed,” said Gaston with a little smile. “Not altogether unexpected, my good Bernard.—Well, do your best to get me a priest. I have not much time; only about three-quarters of an hour.” No, he had not much time. And perhaps it was best. He could not possibly say good-bye to Valentine now. Yesterday had been their farewell after all. Did this hurried execution mean that the First Consul had got wind of to-night’s rescue? He dressed swiftly, but with attention to details, shaved with care when old Bernard, almost weeping, brought him the water and the tidings that no priest could so far be found; and, with only twenty-five minutes left, sat down to write his last letter to Valentine. He had no little to say, but he wrote steadily and without difficulty, pausing only once or twice. When he had finished he took out from a pocket-case in his breast a little square of folded paper, somewhat worn, wrote on it three words and slipped it inside his letter. Then he folded, addressed and sealed the whole, kissed his wife’s name upon the superscription, and put it in the case. There was already another letter there. And now, since he had taken from its place over his heart the amulet he always wore there, to give it back to the hand whence he had it, for the short time that heart had to beat it should beat against the symbol that was rather of loyalty than of love—but which love had nevertheless fashioned and given him. He took from the back of the chair the scarf he had so treasured, and put the end with the golden fleur-de-lys to his lips. For a moment, at the touch of what her fingers had wrought, a wave of anguish engulfed him. He gripped his hands hard behind his head, as it fell forward on the folds of the scarf across the table. O, not to have to leave her . . . even to see her once more, only once! It was short, that agony. Gaston de Trélan had faced it many times these last few days. He rose, fastening the scarf across his breast instead of as usual round his waist. Her arms would be about him thus, to the end. Only four minutes more. No priest had come. So he knelt down by the table, and tried to collect his thoughts. The door opened slowly. Gaston stood up; the young hussar, much the paler of the two, came in. “I am ready,” said the Duc. “But before we go I have a favour to ask of you. This case, Monsieur, contains a letter to my wife, with another to the same address. Could it be given to her? She is to be found at Mme Tessier’s in the Rue de Seine.” “I give you my word that she shall have it,” said the officer. “I will take it myself—if I cannot find a better messenger.” “Thank you, Monsieur,” said Gaston, replacing the case inside his uniform. “If it will not inconvenience you, however, I will keep the letter on me till the last possible moment, and give it to you—later on. And I have a fancy not to be parted from my Cross of Maria Theresa before I need; therefore, if it would not be putting you to too much trouble, I would ask you to take it off when the business is over. This scarf I should wish to be buried with. I am still, you know, Monsieur le Capitaine,” he threw back his head a little, “the General commanding for His Majesty King Louis XVIII. in Finistère, a position that is not cancelled by my capture under a safe-conduct.—I beg your pardon, for you neither had part in, nor approve of that,” he added, seeing the young man wince. “The scarf, then, I should desire to remain on me, the order to go to the Duchesse if you would be so good.” “She shall have it . . . if you think that a Republican’s word is ever to be trusted again.” “I think that I can trust yours,” retorted Gaston, holding out his hand. “Monsieur le Duc . . .” stammered the young hussar, hesitating. The keen eyes smiled at him. “My boy, do you think I don’t understand? Come, we have a journey to make in company. And your hands are clean—as I hope mine are.” So, with a flush, Captain Guibert gripped his prisoner’s fingers for a second. And then old Bernard’s voice broke in on them. “Monseigneur,” it said at Gaston’s elbow, “you are fasting, and it is so cold outside! Will you not?” And he held out on a little tray a cup of coffee. But his hands shook so that the cup was clattering on its saucer. “Monsieur Bernard, you are my good angel,” said Gaston gaily, as he took it from him. “I hope M. le Capitaine was as fortunate before he set out—so much earlier, too, than I am to do.” He drank down the hot coffee and set the empty cup on the table in significant proximity to his purse, which he had already placed there for the old gaoler. But Bernard, sniffing, shuffled out before he could take farewell of him. “Poor Bernard is too tenderhearted for his post,” observed his prisoner. “The sooner he is quit of us the better.—I follow you, Monsieur.” (3) A guard of dismounted hussars was awaiting them at the foot of the Tower. “I have a carriage for you, Monsieur le Duc,” explained Captain Guibert half apologetically, as, on a sign from him, his men fell in behind him and his prisoner, “but it is in the courtyard of the Palace, for as you know, it is impossible for a vehicle to be brought any nearer.” “But why should I wish for better treatment than my King?” asked the Duc de Trélan. “He had to walk from the Tower.” Once through the great wall of isolation—at last—they went side by side in silence, the armed guard behind, across the garden to the Palace. Gaston was thinking that if, on their way to the Plaine de Grenelle—the usual spot for such events—they crossed the river by the Pont Neuf, as was most likely, they could hardly avoid passing one end or other of the Rue de Seine, where Valentine lay asleep, or wakeful. He wondered whether she would somehow be aware . . . and whether he could entirely keep his composure as they went so near. . . . When they came, through the building, in sight of the courtyard, the carriage was drawn up at the foot of the steps. Grouped round it, the remaining hussars sat their horses motionless, holding those of their dismounted comrades, but the frost in the air made the animals impatient, and one perpetual jingle shook from their tossing heads, while their breaths, and the men’s, too, went up like smoke. Gaston looked back over his shoulder for an instant. Above the low fa?ade of the Palace, to the left of the Tower behind, the sun was now visible, huge and red. It would be a fine day, probably—but one would not know. . . . The dismounted men were already resuming their saddles; a horse was pawing the ground as if eager to be off. “Lieutenant Soyer,” said the captain, “take the head of the escort!” He turned to his prisoner. “Monsieur de Trélan, pardon me, but someone must drive in the carriage with you. I am very sorry . . . but if you will permit me, I will do so myself, instead of my lieutenant.” He reminded Gaston of his own three ‘jeunes.’ In such circumstances he would not have wished Roland to carry himself otherwise. “I should desire your company, Monsieur le Capitaine,” he replied courteously, and put his foot on the step of the high-slung berline. “We journey to the Plaine de Grenelle, I suppose?” The young man dropped his eyes and reddened. “No,” he said, in a low, ashamed voice, “the orders are . . . Mirabel.” For the first time since he had learnt that he was to die that morning, Gaston de Trélan showed emotion before a witness. He flushed too, but it was with anger. “The First Consul’s idea of the dramatic, I suppose! One sees his origin.” He bit his lip and recovered himself. “I have the right, I think, to consider it somewhat misplaced. However, the setting of the last scene is really of small importance to me.” He got into the carriage, and the captain of hussars silently followed him in, and sat down opposite him, his sabre across his knees. In a few seconds the carriage was rolling noisily over the cobblestones of the archway into the street. But they would not pass near Valentine now; they would soon be going further away every moment . . . for ever. They had traversed Paris, and were in the Avenue de Neuilly, when the young officer said abruptly, “Monsieur le Duc, if when we are past Neuilly, I were to get out, to halt the escort, make some diversion, and call off the men on either side if you could slip out . . .” Gaston shook his head, smiling, despite himself, at the wild idea. “My dear boy—apart from a personal preference for not being shot in the back—do you suppose that I would accept your young life for mine?” “My life! But my career was my life—and I am going to resign my commission before this day is over! I cannot serve any more a soldier who violates a safe-conduct. And I thought him . . . I was with him in Italy—at Acre—at Aboukir . . .” He put his forehead down on the hands that rested over each other on the hilt of his sabre, upright between his knees. Gaston’s face softened as he looked at him. It was as he thought. He would not have died in vain. He leant back with folded arms. The rumble of the wheels, the trot of the horses on either hand, the figures of their riders as they rose and fell close to the carriage windows, held a rhythm that was almost soothing. And now that the shock of indignation and disgust was over, what better place at which to die than Mirabel, which had re-united him and Valentine? It was his dream come true; he was not going away from her; she was—was she not?—waiting for him there. Only just this side of death had they plucked the flower of flowers; but they had plucked it. And the life whose uselessness had hurt her so, at the end he had contrived to do something with it after all. By refusing to ransom it, as he might conceivably have done, he was flinging it down, not as a forfeit, but as a challenge, against the walls that had been his and Valentine’s. In having him shot in defiance of the strictest article of military honour, Bonaparte plainly designed to make of the Duc de Trélan’s death a terrible example—in decreeing that the sentence should be carried out, against all the dictates of decent feeling, in front of his own confiscated house, to make that death a kind of show as well. But the more publicity given to so callous and unscrupulous an action, the longer it was likely to be remembered—against its author; and the impression might not be what Bonaparte designed. The hope of such a result was partly what Gaston de Trélan was laying down his life for. Already, as he knew, there was no small clamour and protest in Paris over his probable fate, so that the added affront of this morning did but make dying, after all, the more worth while. The short miles had slipped past. Here already, by the slackening pace, was the turn off the Saint-Germain road. Nearly ten years. . . . The carriage, swaying a little, swung round at right angles into the way lined with gaunt poplars, where the frozen puddles crackled under hoofs and wheels—the last stage but one of the journey that was bearing him away from all he loved. No! “Death could never take you from me!” Et expecto resurrectionem mortuorum et vitam venturi saeculi. Crossing himself, he began silently to recite his act of contrition. And in a few moments more, the faint winter sun glinting on its majolica, came Mirabel—Mirabel with the barrier removed, and some hundreds of troops drawn up in front of it on the frostbound gravel. The officer of hussars, raising his head, saw his companion holding out to him, with a little smile, the lettercase he had drawn from his breast. “I am glad, after all,” said the last Duc de Trélan quietly, “that it should be here.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3317/90754.html","bookId":399,"book":{"id":399,"title":"The Yellow Poppy","description":"简介： I wish I had been taught how to make a bed! complained Roland de Cligny, as he wrestled with his blanket in the half-darkness of the attic.You may think yourself lucky to have a bed to make! retorted a comrade who sat cross-legged on a neighbouring p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3317","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
