{"id":72553,"no":40,"title":"Page 40","content":"She’s chatting to one of the taller guys who has dark brown hair, oily skin, and yellow-stained teeth, along with a goatee that stretches to his chest. She keeps laughing and smiling, throwing back her head in a flirty way, and I keep waiting for Dylan to get pissed and intervene, but he never does. Then she hands him something, a plastic bag, and the dots connect inside my head. They’re dealing. I’m about to back away, when the shorter, rounder of the three guys notice me. His gaze sweeps across me, and anger masks his sore-covered face.\n “Who the fuck is she?” he asks with a nod of his chin as he cracks his knuckles.\n Suddenly they’re all looking at me and I start to step back, wondering if I should walk or run away when Quinton’s honey-brown eyes lock on me and I think of what he said to me at the pond. It’s almost like he can see the old me, the part of me that I lost. I wonder how, though? How can he see the good?\n I’m backing away, running away, when I stop in my tracks near the corner of the tent. I stare at the pain in his eyes, the dazed look that lets me know he’s not himself, and the pure and utter torture that I still don’t truly understand and I wonder if I ever will. Did I ever really know him? Did he ever really know me? Will we ever really know each other? I’m not sure, but I think I need to find myself first.\n My feet long to go to him, but my mind has the upper hand this time, because it’s as clear as the sky and suddenly I understand. At this moment in my life I can’t help him, even though I want to so badly that it consumes my body and mind. I want to take his pain away, save him like I couldn’t save Landon, but I’m not strong enough right now. I’m not the strong girl Landon talked about in the video. I wish I was, but I can barely hang on myself, let alone hold someone up with me. I’m understanding this now. I’m suddenly understanding a lot of things. It hurts to realize it and makes it hard to breathe, like my lungs are shrinking or maybe they’re expanding and there’s no more room left in my rib cage. Either way, I’m hyperventilating. I massage my hand over my chest, my heart aching as he stares at me, mystified. I look at the blue sky above us, the dirt below our feet, and a sea of people walking around, a sea we could easy get swept away into.\n I’m sorry, I mouth.\n He stares at me for a moment longer and I can’t tell if he gets what I mean or not, but he nods once before turning away, and I think that maybe, just maybe, he knows what I mean.\n “Hey, Nova,” Tristan says, taking a step toward me. He nods his head to the side, indicating for me to walk away. “You should go.”\n I gladly turn around and walk off toward the tent. One… two… three…\n “Nova, wait,” Tristan says and moments later he grabs my arm, jerking me to a stop.\n I slowly turn around to face him. He looks a little different, his pupils larger, his hair disheveled, and there are bags underneath his eyes. “I’m sorry,” I say, wiggling my arm out of his grip. “I didn’t know you guys were busy.”\n He shakes his head and then rakes his fingers through his blond locks. “You don’t need to be sorry… it’s just… it’s just better if you weren’t around… that.” His voice sounds subdued and it seems like he’s really struggling to move his lips.\n “It’s fine,” I say. But it’s not. Nothing is fine. I don’t want to be here anymore.\n “Yeah…” He bites on his lip, glancing over his shoulder, and then he ushers me forward, motioning his hands at me. “Look, I remember you in high school and you weren’t… you weren’t like us…”\n Us. Like we’re two different breeds. But we’re not. We’re all just living a different path and seeing life differently—I’m seeing life differently. “I know, but it doesn’t mean I was sheltered. I saw stuff.” I turn my shoulder inward to squeeze through a truck and a tent. “I saw stuff all the time.” Where do I go from here?\n “Yeah, I know,” he says, kicking a cooler out of his path and spilling a beer that was on top of it. “You were always hanging out with that guy that… died.”\n He did die. A while ago. But he’s gone now. “His name was Landon,” I say, pressing my hand to my chest. “Landon Evans.” The world starts to spin, but it’s a good spin. A natural spin and I let it be. Please, forgive me.\n When we reach the tent, I sit down in one of the chairs, watching the crowds, and listening to the music as it flows over the field. At one point I shut my eyes and bask in the freeness of the vocals, tapping my foot to the beat of the drum, remembering what it was like to play, when Landon would watch me with almost a smile on his face and I felt happy inside. I let the sound own me, take me over, and pull me back in a direction I was running away from.\n Tristan sits down beside me, and he instantly starts smoking something that smells strange and makes the air just a little bit hotter. The longer it goes on, the more droopy his eyes get, and the more he looks like he’s going to sink into the ground and vanish from the world.\n I don’t want to watch him. I don’t want to be here. I want to go home.\n I sit there, listening to the song, remembering what it was like when I would sit and listen to music with Landon and we’d talk about life and what we’d do when we got older, where we’d go, who we’d become. But that’s gone now, and I need to accept that.\n Please, forgive me.\n “If you could be anything in the world,” Landon had once asked me, “what would you be?”\n “A drummer,” I’d replied easily. “How about you?” I’d thought I’d known his answer. An artist. How could he say anything else?\n He’d thought about it forever and finally sighed. “I have no idea. Maybe I wouldn’t be anything. Maybe I’d just follow you around to concerts and carry your drumsticks.”\n I’d laughed at the time, because it seemed so silly, but thinking about it now, I start to cry. We could have been great together. Perfect. We could have been a lot of things, but now we can’t be anything other than memories.\n “Here,” Tristan says, urging the burning cigarette at me as watches the tears freely rolling down my cheeks. “You want a hit? It’ll calm you down.”\n I stare at the joint and then back him. Do I want a hit? Do I want this life? Is this the road I’m choosing to go down?\n I shake my head, and then get to my feet. “No thanks.” I start to back around the chair toward the tent.\n “Where are you going?” he asks, with the joint positioned between his lips and smoke masking his face.\n I shake my head, backing up to the tent. “I’m not sure.” I duck into the tent, grab my phone, and then climb back out. Tristan’s heading into the crowd, and I think about chasing him down and saying good-bye. I think about telling Delilah that I’m going. I think about telling Quinton I’m sorry.\n But instead I head toward the road, the sun blazing at my back, the clear sky above me, focusing only on myself and the path ahead. I take it step by step, letting myself count, because that’s what I need to do for the moment, but telling myself that I’ll work on breaking the habit when I can. It’s the first time I’ve admitted aloud that it’s a habit, and it’s liberating and gives me a sense of peace, and in the end, I run.\n I run all the way to the restaurant where Quinton and I had breakfast and he let me cry on his chest. By the time I reach the front door, I’m dripping in sweat and I have no idea how long it took me to get here. But I’m still breathing and my heart’s still beating.\n When I enter, it’s pretty much empty. I sit down and order a coffee, and the waitress looks at me like I’ve just climbed out of a Dumpster. But she’s polite and brings me a coffee along with a piece of pie and says it’s on the house, and I wonder if she thinks I’m a homeless person.\n Eating the pie, I take out my phone and call the one person I know will always be there for me. It rings three times and then she answers.\n “Nova, what’s wrong?” she says, worried, and I can tell she’s been crying. “I’ve been trying to call you for the last few days, and you haven’t answered your phone.” She starts going off on a rant, but I stop her in the middle of it.\n “Mom, I’m sorry,” I say, wiping the tears from my eyes. “And I want to come home.”\n She asks me a billion questions when I tell her where I am, but in the end she tells me she’s coming right now and that she loves me. We hang up and I sit in the booth staring at the trees outside, and sipping the coffee. Eventually, I take my phone out again. At first I just stare at my reflection in the screen. I look terrible. Plain and simple. Pale skin. Big, bloodshot eyes. My brown hair is matted, and there are scratches on my forehead from when I fell in the trees and a bruise on my cheek. It’s like I’ve altered into this monster over the last few months, and I’m just now noticing the change.\n I flip the camera on and clear my throat, preparing to make my final video. “I’m not really sure when I look back at these clips if they’ll mean anything to me or if I’ll even remembering anything of what happened, just like I’ll probably look back to this day and wonder why I decided to leave, other than I finally watched the video and Landon’s words spoke to me. I woke up and finally saw what things really where. I could close down all I wanted, lock who I am out, shut down all the things that happened with Landon… the good and the bad… but in the end they did happen. Just like this moment. Just like this breath I’m taking. Stuff happens. We get lost. We try to control what will happen. We give up. We do things that don’t make sense. We search for things in the wrongest of ways. We lose our way, but sometimes, if we’re really, really strong, we manage to find our way back.”\n I summon a deep breath and put the phone away. Then I rest my head onto the table and quickly fall asleep as the last two months smash down on me.\n Chapter 21\n Aug 20, Day 103 of Summer Break\n Nova\n I’ve heard about revelations before, when people’s eyes open up, and suddenly everything becomes crystal clear. I wouldn’t necessary call what I had a revelation because everything isn’t crystal clear, but I do see things in a different light, or maybe it’s just that I see the light, like the darkness I’ve kept inside me is dissolving. Looking back, it was Landon’s video that finally opened my eyes. It was painful and heartbreaking to watch, but it made me realize so many things, like how he saw me and how he wanted my forgiveness. I’d never thought to forgive him—I hadn’t even realized I was angry with him, not really, anyway. I kept holding on to him, not accepting the wholehearted truth, knowing he was gone but letting go and moving on. I was so lost and unsure of who I was, because I didn’t want to be anything without him. But watching him talk about me like that, saying I was strong, made me want to be strong, Be the person that he was talking about.\n The first week at home was pure and utter hell. Everything everyone said annoyed the shit out of me, and I felt like jabbing their eyes out. I yelled at my mom. I yelled at Daniel. I yelled at the mailman because he rang the doorbell and it woke me up from my nap. \n","sourceLink":"https://allnovel.net/breaking-nova-nova-1/page-40.html","bookId":1978,"book":{"id":1978,"title":"Breaking Nova (Nova #1)","description":"Storyline: \n Breaking Nova (Nova #1) \n Nova Reed used to have dreams-of becoming a famous drummer, of marrying her true love. But all of that was taken away in an instant. Now she\u0027s getting by as best she can, though sometimes that means doing things the old Nova would never do. Things that are slowly eating away at her spirit. Every day blends into the next . . . until she meets Quinton Carter. His intense, honey brown eyes instantly draw her in, and he looks just about as broken as she feels inside. \n Quinton once got a second chance at life-but he doesn\u0027t want it. The tattoos on his chest are a constant reminder of what he\u0027s done, what he\u0027s lost. He\u0027s sworn to never allow happiness into his life . . . but then beautiful, sweet Nova makes him smile. He knows he\u0027s too damaged to get close to her, yet she\u0027s the only one who can make him feel alive again. Quinton will have to decide: does he deserve to start over? Or should he pay for his past forever?\n \n","cover":"https://allnovel.net/images/breaking-nova-nova-1.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/breaking-nova-nova-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:23:45 AM"}}
