{"id":91275,"no":16,"title":"Page 16","content":"\"See the pleasure it promises,\" the guildmaster teased, scraping his hand over the barbed tip of a single spike sticking out of a block of wood on the center of the room\u0027s little table.\n Regis purposely curled his lips into a stupid smile, pretending to see the obvious logic of Pook\u0027s words.\n \"Just drop your palm onto it,\" Pook coaxed, \"then you will know the joy and will again be part of our family.\"\n Regis searched for a way out of the trap. Once before he had used the ruse, the lie within a lie, pretending to be caught under the magical charm\u0027s influence. He had worked his act to perfection then, convincing an evil wizard of his loyalty, then turning on the man at a critical moment to aid his friends.\n This time, though, Regis had even surprised himself, escaping the ruby pendant\u0027s insistent, hypnotizing pull. Now, though, he was caught: A person truly duped by the gem would gladly impale his hand on the barbed spike.\n Regis brought his hand above his head and closed his eyes, trying to keep his visage blank enough to carry out the dupe. He swung his arm down, meaning to follow through on Pook\u0027s suggestion.\n At the last moment, his hand swerved away and banged harmlessly on the table.\n Pook roared in rage, suspecting all along that Regis had somehow escaped the pendant\u0027s influence. He grabbed the halfling by the wrist and smashed his little hand onto the spike, wiggling it as the spike went through. Regis\u0027s scream multiplied tenfold when Pook tore his hand back up the barbed instrument.\n Then Pook let him go and slapped him across the face as Regis clutched his wounded hand to his chest.\n \"Deceiving dog!\" the guildmaster shouted, more angry with the pendant\u0027s failure than with Regis\u0027s facade. He lined up for another slap but calmed himself and decided to twist the halfling\u0027s stubborn will back on Regis.\n \"A pity,\" he teased, \"for if the pendant had brought you back under control, I might have found a place for you in the guild. Surely you deserve to die, little thief, but I have not forgotten your value to me in the past. You were the finest thief in Calimport, a position I might have offered you once again.\"\n \"Then no pity for the failure of the gem,\" Regis dared to retort, guessing the teasing game that Pook was playing, \"for no pain outweighs the disgust I would feel at playing lackey to Pasha Pook!\"\n Pook\u0027s response was a heavy slug that knocked Regis off his chair and onto the floor. The halfling lay curled up, trying to stem the blood from both his hand and his nose.\n Pook rested back in his chair and clasped his hands behind his head. He looked at the pendant, resting on the table in front of him. Only once before had it failed him, when he had tried it on a will that would not be captured. Luckily, Artemis Entreri had not realized the attempt that day, and Pook had been wise enough not to try the pendant on the assassin again.\n Pook shifted his gaze to Regis, now passed out from the pain. He had to give the little halfling credit. Even if Regis\u0027s familiarity with the pendant had given him an edge in his battle, only an iron will could resist the tempting pull.\n \"But it will not help you,\" Pook whispered at the unconscious form. He sat back in his chair again and closed his eyes, trying to envision still another torture for Regis.\n The tan-robed arm slipped in through the tent\u0027s flap and held the limp body of the red-bearded dwarf upside-down by the ankle. Sali Dalib\u0027s fingers started their customary twiddle, and he flashed the gold-and-ivory smile so wide that it seemed as if it would take in his ears. His little goblin assistant jumped up and down at his side, squealing, \"Magic, magic, magic!\"\n Bruenor opened one eye and lifted an arm to push his long beard out of his face. \"Ye be likin\u0027 what ye\u0027re seeing?\" the dwarf asked slyly.\n Sali Dalib\u0027s smile disappeared, and his fingers got all tangled together.\n Bruenor\u0027s bearer - Wulfgar, wearing the robe of one of the bandits walked into the tent. Catti-brie came in behind him.\n \"So \u0027twas yerself that set the bandits upon us,\" the young woman growled.\n Sali Dalib\u0027s exclamation of shock came out as so much gibberish, and the wily merchant spun away to flee...only to find a neat hole sliced into the back of his tent and Drizzt Do\u0027Urden standing within it, leaning on one scimitar while the other rested easily on his shoulder. Just to heighten the merchant\u0027s terror, Drizzt had again taken off the magical mask.\n \"Uh...um, de bestest road?\" the merchant stammered.\n \"Bestest for yerself and yer friends!\" Bruenor growled.\n \"So they thought,\" Catti-brie was quick to put in.\n Sali Dalib curled his smile sheepishly, but he had been in tight spots a hundred times before and had always weaseled his way out. He lifted his palms, as if to say, \"You caught me,\" but then jerked into a dizzying maneuver, pulling several small ceramic globes out of one of his robe\u0027s many pockets. He slammed them to the floor at his feet. Explosions of multicolored light left a thick, blinding smoke in their wake, and the merchant dashed for the side of the tent.\n Instinctively Wulfgar dropped Bruenor and jumped ahead, catching an armful of emptiness. The dwarf plopped onto the floor headfirst and rolled to a sitting position, his one-horned helm tilted to the side of his head. As the smoke thinned, the embarrassed barbarian looked back to the dwarf, who just shook his head in disbelief and mumbled, \"Suren to be a long adventure.\"\n Only Drizzt, ever alert, had not been caught unawares. The drow had shielded his eyes from the bursts, then watched the smoky silhouette of the merchant darting to the left. Drizzt would have had him before he got out of the hidden flap in the tent, but Sali Dalib\u0027s assistant stumbled into the drow\u0027s way. Barely slowing, Drizzt slammed Twinkle\u0027s hilt into the little goblin\u0027s forehead, dropping the creature into unconsciousness, then slipped the mask back on his face and jumped out to the streets of Memnon.\n Catti-brie rushed by to follow Drizzt, and Bruenor leaped to his feet. \"After \u0027im, boy!\" the dwarf shouted at Wulfgar. The chase was on.\n Drizzt caught sight of the merchant slipping into the throng of the streets. Even Sali Dalib\u0027s loud robe would blend well in the city\u0027s myriad of colors, so Drizzt added a touch of his own. As he had done to the invisible mage on the deck of the pirate ship, the drow sent a purplish glowing outline of dancing flames over the merchant.\n Drizzt sped off in pursuit, weaving in and out of the crowd with amazing ease and watching for the bobbing line of purple ahead.\n Bruenor was less graceful. The dwarf cut ahead of Catti-brie and plunged headlong into the throng, stomping toes and using his shield to bounce bodies out of his way. Wulfgar, right behind, cut an even wider swath, and Catti-brie had an easy time following in their wake.\n They passed a dozen lanes and crashed through an open market, Wulfgar accidentally overturning a cart of huge yellow melons. Shouts of protest erupted behind them as they passed, but they kept their eyes ahead, each watching the person in front and trying not to get lost in the overwhelming bustle.\n Sali Dalib knew at once that he was too conspicuous with the fiery outline to ever escape in the open streets. To add to his disadvantage, the eyes and pointing fingers of a hundred curious onlookers greeted him at every turn, signposts for his pursuers. Grabbing at the single chance before him, the merchant cut down one lane and scrambled through the doors of a large stone building.\n Drizzt turned to make certain that his friends were still behind, then rushed through the doors, skidding to a stop on the steam-slicked marble floor of a public bathhouse.\n Two huge eunuchs moved to block the clothed elf, but as with the merchant who had come in just before, the agile Drizzt regained his momentum too quickly to be hindered. He skated through the short entry corridor and into the main room, a large open bath, thick with steam and smelling of sweat and perfumed soaps. Naked bodies crossed his path at every step, and Drizzt had to be careful where he placed his hands as he slipped through.\n Bruenor nearly fell as he entered the slippery chamber, and the eunuchs, already out of their positions, got in front of him.\n \"No clothes!\" one of them demanded, but Bruenor had no time for idle discussions. He stamped a heavy boot onto one of the giant\u0027s bare feet, then crunched the other foot for good measure. Wulfgar came in then and heaved the remaining eunuch aside.\n The barbarian, leaning forward to gain speed, had no chance to stop or turn on the slippery floor, and as Bruenor turned to make his way along the perimeter of the bath, Wulfgar slammed into him, knocking them both to the floor and into a slide they could not brake.\n They bounced over the rim of the bath and plunged into the water, Wulfgar coming up, waist deep, between two voluptuous and naked, giggling women.\n The barbarian stammered an apology, finding his tongue twisted within the confines of his mouth. A slap across the back of his head shook him back to his senses.\n \"Ye\u0027re looking for the merchant, ye remember?\" Catti-brie reminded him.\n \"I am looking!\" Wulfgar assured her.\n \"Then be lookin\u0027 for the one lined in purple!\" Catti-brie shot back.\n Wulfgar, his eyes freed with the expectation of another smack, noticed the single horn of a helmet poking out of the water at his side. Frantically he plunged his hand under, catching Bruenor by the scruff of the neck and hoisting him out of the bath. The not-too-happy dwarf came up with his arms crossed over his chest and shaking his head in disbelief once again.\n Drizzt got out the back door of the bathhouse and found himself in an empty alley, the only unpopulated stretch he had seen since entering Memnon. Seeking a better vantage, the drow scaled the side of the bathhouse and jogged along the roof.\n Sali Dalib slowed his pace, thinking he had slipped the pursuit. The drow\u0027s purple fire died away, further adding to the merchant\u0027s sense of security. He wound his way through the back-alley maze. Not even the usual drunks leaned against the walls to inform his pursuers. He moved a hundred twisting yards, then two, and finally down an alley that he knew would turn onto the largest marketplace in Memnon, where anyone could become invisible in the blink of an eye.\n As Sali Dalib approached the end of the alley, however, an elven form dropped in front of him and two scimitars flashed out of their sheaths, crossing before the stunned merchant, coming to rest on his collarbones, then drawing lines on either side of his neck.\n When the four friends returned to the merchant\u0027s tent with their prisoner, they found, to their relief, the little goblin lying where Drizzt had bopped him. Bruenor none too gently pulled the unfortunate creature up behind Sali Dalib and tied the two back to back. Wulfgar moved to help and wound up hooking a loop of the rope over Bruenor\u0027s forearm. The dwarf wiggled free and pushed the barbarian away.\n \"Should\u0027ve stayed in Mithril Hall,\" Bruenor grumbled. \"Safer with the gray ones than beside yerself and the girl!\"\n Wulfgar and Catti-brie looked to Drizzt for support, but the drow just smiled and moved to the side of the tent.\n \"Ha ha ha ha ha,\" Sali Dalib giggled nervously. \"No problem here. We deal? Many riches, I have. What you need - \"\n \"Shut yer mouth!\" Bruenor snapped at him. The dwarf winked at Drizzt, indicating that he meant to play the bad guy role in the encounter.\n \"I don\u0027t be lookin\u0027 for riches from one what\u0027s tricked me,\" Bruenor growled. \"Me heart\u0027s for revenge!\" He looked around at his friends. \"Ye all saw his face when he thought me dead. Suren was him that put the riding bandits on us.\"\n \"Sali Dalib never - \" the merchant stammered.\n \"I said, \u0027shut yer mouth!\u0027\" Bruenor shouted in his face, cowing him. The dwarf brought his axe up and ready on his shoulder.\n The merchant looked to Drizzt, confused, for the drow had replaced the mask and now appeared as a surface elf once again. Sali Dalib guessed the truth of Drizzt\u0027s identity, figuring the black skin to be more fitting on the deadly elf, and he did not even think of begging for mercy from Drizzt.\n \"Wait on it, then,\" Catti-brie said suddenly, grabbing the handle of Bruenor\u0027s weapon. \"May that there be a way for this dog to save his neck.\"\n \"Bah! What would we want o\u0027 him?\" Bruenor shot back, winking at Catti-brie for playing her part to perfection.\n \"He\u0027ll get us to Calimport,\" Catti-brie replied. She cast a steely gaze at Sali Dalib, warning him that her mercy was not easily gotten. \"Suren this time he\u0027ll take us down the true bestest road.\"\n \"Yes, yes, ha ha ha ha ha,\" Sali Dalib blurted. \"Sali Dalib show you de way!\"\n \"Show?\" balked Wulfgar, not to be left out. \"You will lead us all the way to Calimport.\"\n \"Very long way,\" grumbled the merchant. \"Five days or more. Sali Dalib cannot - \"\n Bruenor raised his axe.\n \"Yes, yes, of course,\" the merchant erupted. \"Sali Dalib take you there. Take you right to de gate...through de gate,\" he corrected quickly. \"Sali Dalib even get de water. We must catch de caravan.\"\n \"No caravan,\" Drizzt interrupted, surprising even his friends. \"We will travel alone.\"\n \"Dangerous,\" Sali Dalib replied. \"Very, very. De Calim Desert be very full of monsters. Dragons and bandits.\"\n \"No caravan,\" Drizzt said again in a tone that none of them dared question. \"Untie them, and let them get things ready.\"\n Bruenor nodded, then put his face barely an inch from Sali Dalib\u0027s. \"And I mean to be watchin\u0027 them meself,\" he said to Drizzt, though he sent the message more pointedly to Sali Dalib and the little goblin. \"One trick and I\u0027ll cut \u0027em in half!\" Less than an hour later, five camels moved out of southern Memnon and into the Calim Desert with ceramic water jugs clunking on their sides. Drizzt and Bruenor led the way, following the signposts of the Trade Way. The drow wore his mask, but kept the cowl of his cloak as low as he could, for the sizzling sunlight on the white sands burned at his eyes, which had once been accustomed to the absolute blackness of the underworld.\n Sali Dalib, his assistant sitting on the camel in front of him, came in the middle, with Wulfgar and Catti-brie bringing up the rear. Catti-brie kept Taulmaril across her lap, a silver arrow notched as a continual reminder to the sneaky merchant.\n The day grew hotter than anything the friends had ever experienced, except for Drizzt, who had lived in the very bowels of the world. Not a cloud hindered the sun\u0027s brutal rays, and not a wisp of a breeze came to offer any relief. Sali Dalib, more used to the heat, knew the lack of wind to be a blessing, for wind in the desert meant blowing and blinding sand, the most dangerous killer of the Calim.\n The night was better, with the temperature dropping comfortably and a full moon turning the endless line of dunes into a silvery dreamscape, like the rolling waves of the ocean. The friends set a camp for a few hours, taking turns watching over their reluctant guides.\n Catti-brie awoke sometime after midnight. She sat and stretched, figuring it to be her turn on watch. She saw Drizzt, standing on the edge of the firelight, staring into the starry heavens.\n Hadn\u0027t Drizzt taken the first watch? she wondered.\n Catti-brie studied the moon\u0027s position to make certain of the hour. There could be no doubt; the night grew long.\n \"Trouble?\" she asked softly, going to Drizzt\u0027s side. A loud snore from Bruenor answered the question for Drizzt.\n \"Might I spell ye, then?\" she asked. \"Even a drow elf needs to sleep.\"\n \"I can find my rest under the cowl of my cloak,\" Drizzt replied, turning to meet her concerned gaze with his lavender eyes, \"when the sun is high.\"\n \"Might I join ye, then?\" Catti-brie asked. \"Suren a wondrous night.\"\n Drizzt smiled and turned his gaze back to the heavens, to the allure of the evening sky with a mystical longing in his heart as profound as any surface elf had ever experienced.\n Catti-brie slipped her slender fingers around his and stood quietly by his side, not wanting to disturb his enchantment further, sharing more than mere words with her dearest of friends.\n The heat was worse the next day, and even worse the following, but the camels plodded on effortlessly, and the four friends, who had come through so many hardships, accepted the brutal trek as just one more obstacle on the journey they had to complete.\n They saw no other signs of life and considered that a blessing, for anything living in that desolate region could only be hostile. The heat was enemy enough, and they felt as if their skin would simply shrivel and crack away.\n Whenever one of them felt like quitting, like the relentless sun and burning sand and heat were simply too much to bear, he or she just thought of Regis.\n What terrible tortures was the halfling now enduring at the hands of his former master?\n Epilogue\n From the shadows of a doorway, Entreri watched Pasha Pook make his way up the staircase to the exit of the guildhouse. It had been less than an hour since Pook had regained his ruby pendant and already he was off to put it to use. Entreri had to give the guildmaster credit; he was never late for the dinner bell.\n The assassin waited for Pook to clear the house altogether, then made his way stealthily back to the top level. The guards outside the final door made no move to stop him, though Entreri did not remember them from his earlier days in the guild. Pook must have prudently put out the word of Entreri\u0027s station in the guild, according him all the privileges he used to enjoy.\n Never late for the dinner bell.\n Entreri moved to the door to his old room, where LaValle now resided, and knocked softly.\n \"Come in, come in,\" the wizard greeted him, hardly surprised that the assassin had returned.\n \"It is good to be back,\" Entreri said.\n \"And good to have you back,\" replied the wizard sincerely. \"Things have not been the same since you left us, and they have only become worse in recent months.\"\n Entreri understood the wizard\u0027s point. \"Rassiter?\"\n LaValle grimaced. \"Keep your back to the wall when that one is about,\" A shudder shook through him, but he composed himself quickly. \"But with you back at Pook\u0027s side, Rassiter will learn his place.\"\n \"Perhaps,\" replied Entreri, \"though I am not so certain that. Pook was as glad to see me.\"\n \"You understand Pook,\" LaValle chuckled. \"Ever thinking as a guildmaster! He desired to set the rules for your meeting with him to assert his authority. But that incident is far behind us already.\"\n Entreri\u0027s look gave the wizard the impression that he was not so certain.\n \"Pook will forget it,\" LaValle assured him.\n \"Those who pursued me should not so easily be forgotten,\" Entreri replied.\n \"Pook called upon Pinochet to complete the task,\" said LaValle. \"The pirate has never failed.\"\n \"The pirate has never faced such foes,\" Entreri answered. He looked to the table and LaValle\u0027s crystal ball. \"We should be certain.\"\n LaValle thought for a moment, then nodded his accord. He had intended to do some scrying anyway. \"Watch the ball,\" he instructed Entreri. \"I shall see if I can summon the image of Pinochet.\"\n The crystal ball remained dark for a few moments, then filled with smoke. LaValle had not dealt often with Pinochet, but he knew enough of the pirate for a simple scrying. A few seconds later, the image of a docked ship came into view - not a pirate vessel, but a merchant ship. Immediately Entreri suspected something amiss.\n Then the crystal probed deeper, beyond the hull of the ship, and the assassin\u0027s guess was confirmed, for in a sectioned corner of the hold sat the proud pirate captain, his elbows on his knees and his head in his hands, shackled to the wall.\n LaValle, stunned, looked to Entreri, but the assassin was too intent on the image to offer any explanations. A rare smile had found its way onto Entreri\u0027s face.\n LaValle cast an enhancing spell at the crystal ball. \"Pinochet,\" he called softly.\n The pirate lifted his head and looked around.\n \"Where are you?\" LaValle asked.\n \"Oberon?\" Pinochet asked. \"Is that you, wizard?\"\n \"Nay, I am LaValle, Pook\u0027s sorcerer in Calimport. Where are you?\"\n \"Memnon,\" the pirate answered. \"Can you get me out?\"\n \"What of the elf and the barbarian?\" Entreri asked LaValle, but Pinochet heard the question directly.\n \"I had them!\" the pirate hissed. \"Trapped in a channel with no escape. But then a dwarf appeared, driving the reins of a flying chariot of fire, and with him a woman archer - a deadly archer.\" He paused, fighting off his distaste as he remembered the encounter.\n \"To what outcome?\" LaValle prompted, amazed at the development.\n \"One ship went running, one ship - my ship - sank, and the third was captured,\" groaned Pinochet. He locked his face into a grimace and asked again, more emphatically, \"Can you get me out?\"\n LaValle looked helplessly to Entreri, who now stood tall over the crystal ball, absorbing every word. \"Where are they?\" the assassin growled, his patience worn away.\n \"Gone,\" answered Pinochet. \"Gone with the girl and the dwarf into Memnon.\"\n \"How long?\"\n \"Three days.\"\n Entreri signaled to LaValle that he had heard enough.\n \"I will have Pasha Pook send word to Memnon immediately,\" LaValle assured the pirate. \"You shall be released.\"\n Pinochet sank into his original, despondent position. Of course he would be released; that had already been arranged. He had hoped that LaValle could somehow magically get him out of the Sea Sprite\u0027s hold, thereby releasing him from any pledges he would be forced to make to Deudermont when the captain set him free.\n \"Three days,\" LaValle said to Entreri as the crystal darkened. \"They could be halfway here by now.\"\n Entreri seemed amused at the notion. \"Pasha Pook is to know nothing of this,\" he said suddenly.\n LaValle sank back in his chair. \"He must be told.\"\n \"No!\" Entreri snapped. \"This is none of his affair.\"\n \"The guild may be in danger,\" LaValle replied.\n \"You do not trust that I am capable of handling this?\" Entreri asked in a low, grim tone. LaValle felt the assassin\u0027s callous eyes looking through him, as though he had suddenly become just another barrier to be overcome.\n But Entreri softened his glare and grinned. \"You know of Pasha Pook\u0027s weakness for hunting cats,\" he said, reaching into his pouch. \"Give him this. Tell him you made it for him.\"\n He tossed a small black object across the table to the wizard. LaValle caught it, his eyes widening as soon as he realized what it was.\n Guenhwyvar.\n On a distant plane, the great cat stirred at the wizard\u0027s touch upon the statuette and wondered if its master meant to summon it, finally, to his side.\n But, after a moment, the sensation faded, and the cat put its head down to rest.\n So much time had gone by.\n \"It holds an entity,\" the wizard gasped, sensing the strength in the onyx statuette.\n \"A powerful entity,\" Entreri assured him. \"When you learn to control it, you will have brought a new ally to the guild.\"\n \"How can I thank - \" LaValle began, but he stopped as he realized that he had already been told the price of the panther. \"Why trouble Pook with details that do not concern him?\" The wizard laughed, tossing a cloth over his crystal ball.\n Entreri clapped LaValle on the shoulder as he passed toward the door. Three years had done nothing to diminish the understanding the two men had shared.\n But with Drizzt and his friends approaching, Entreri had more pressing business. He had to go to the Cells of Nine and pay a visit to Regis.\n The assassin needed another gift. \n","sourceLink":"https://allnovel.net/the-dark-elf-trilogy-exile-the-dark-elf-trilogy-2/page-16.html","bookId":2105,"book":{"id":2105,"title":"The Dark Elf Trilogy: Exile (The Dark Elf Trilogy #2)","description":"Storyline: \n As I became a creature of the empty tunnels, survival became easier and more difficult all at once. I gained in the physical skills and experience necessary to live on. I could defeat almost anything that wandered into my chosen domain. It did not take me long, however, to discover one nemesis that I could neither defeat nor flee. It followed me wherever I went–indeed, the farther I ran, the more it closed in around me. My enemy was solitude, the interminable, incessant silence of hushed corridors.\n \n","cover":"https://allnovel.net/images/the-dark-elf-trilogy-exile-the-dark-elf-trilogy-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-dark-elf-trilogy-exile-the-dark-elf-trilogy-2.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:48:45 PM"}}
