{"id":6444,"no":34,"title":"Chapter 34","content":"I wrote to Agnes as soon as Dora and I were engaged. I wrote her a long letter, in which I tried to make her comprehend how blest I was, and what a darling Dora was. I entreated Agnes not to regard this as a thoughtless passion which could ever yield to any other, or had the least resemblance to the boyish fancies that we used to joke about. I assured her that its profundity was quite unfathomable, and expressed my belief that nothing like it had ever been known. \n Somehow, as I wrote to Agnes on a fine evening by my open window, and the remembrance of her clear calm eyes and gentle face came stealing over me, it shed such a peaceful influence upon the hurry and agitation in which I had been living lately, and of which my very happiness partook in some degree, that it soothed me into tears. I remember that I sat resting my head upon my hand, when the letter was half done, cherishing a general fancy as if Agnes were one of the elements of my natural home. As if, in the retirement of the house made almost sacred to me by her presence, Dora and I must be happier than anywhere. As if, in love, joy, sorrow, hope, or disappointment; in all emotions; my heart turned naturally there, and found its refuge and best friend. \n Of Steerforth I said nothing. I only told her there had been sad grief at Yarmouth, on account of Emily\u0027s flight; and that on me it made a double wound, by reason of the circumstances attending it. I knew how quick she always was to divine the truth, and that she would never be the first to breathe his name. \n To this letter, I received an answer by return of post. As I read it, I seemed to hear Agnes speaking to me. It was like her cordial voice in my ears. What can I say more! \n While I had been away from home lately, Traddles had called twice or thrice. Finding Peggotty within, and being informed by Peggotty (who always volunteered that information to whomsoever would receive it), that she was my old nurse, he had established a good-humoured acquaintance with her, and had stayed to have a little chat with her about me. So Peggotty said; but I am afraid the chat was all on her own side, and of immoderate length, as she was very difficult indeed to stop, God bless her! when she had me for her theme. \n This reminds me, not only that I expected Traddles on a certain afternoon of his own appointing, which was now come, but that Mrs. Crupp had resigned everything appertaining to her office (the salary excepted) until Peggotty should cease to present herself. Mrs. Crupp, after holding divers conversations respecting Peggotty, in a very high-pitched voice, on the staircase - with some invisible Familiar it would appear, for corporeally speaking she was quite alone at those times - addressed a letter to me, developing her views. Beginning it with that statement of universal application, which fitted every occurrence of her life, namely, that she was a mother herself, she went on to inform me that she had once seen very different days, but that at all periods of her existence she had had a constitutional objection to spies, intruders, and informers. She named no names, she said; let them the cap fitted, wear it; but spies, intruders, and informers, especially in widders\u0027 weeds (this clause was underlined), she had ever accustomed herself to look down upon. If a gentleman was the victim of spies, intruders, and informers (but still naming no names), that was his own pleasure. He had a right to please himself; so let him do. All that she, Mrs. Crupp, stipulated for, was, that she should not be \u0027brought in contract\u0027 with such persons. Therefore she begged to be excused from any further attendance on the top set, until things were as they formerly was, and as they could be wished to be; and further mentioned that her little book would be found upon the breakfast-table every Saturday morning, when she requested an immediate settlement of the same, with the benevolent view of saving trouble \u0027and an ill-conwenience\u0027 to all parties. \n After this, Mrs. Crupp confined herself to making pitfalls on the stairs, principally with pitchers, and endeavouring to delude Peggotty into breaking her legs. I found it rather harassing to live in this state of siege, but was too much afraid of Mrs. Crupp to see any way out of it. \n \u0027My dear Copperfield,\u0027 cried Traddles, punctually appearing at my door, in spite of all these obstacles, \u0027how do you do?\u0027 \n \u0027My dear Traddles,\u0027 said I, \u0027I am delighted to see you at last, and very sorry I have not been at home before. But I have been so much engaged -\u0027 \n \u0027Yes, yes, I know,\u0027 said Traddles, \u0027of course. Yours lives in London, I think.\u0027 \n \u0027What did you say?\u0027 \n \u0027She - excuse me - Miss D., you know,\u0027 said Traddles, colouring in his great delicacy, \u0027lives in London, I believe?\u0027 \n \u0027Oh yes. Near London.\u0027 \n \u0027Mine, perhaps you recollect,\u0027 said Traddles, with a serious look, \u0027lives down in Devonshire - one of ten. Consequently, I am not so much engaged as you - in that sense.\u0027 \n \u0027I wonder you can bear,\u0027 I returned, \u0027to see her so seldom.\u0027 \n \u0027Hah!\u0027 said Traddles, thoughtfully. \u0027It does seem a wonder. I suppose it is, Copperfield, because there is no help for it?\u0027 \n \u0027I suppose so,\u0027 I replied with a smile, and not without a blush. \u0027And because you have so much constancy and patience, Traddles.\u0027 \n \u0027Dear me!\u0027 said Traddles, considering about it, \u0027do I strike you in that way, Copperfield? Really I didn\u0027t know that I had. But she is such an extraordinarily dear girl herself, that it\u0027s possible she may have imparted something of those virtues to me. Now you mention it, Copperfield, I shouldn\u0027t wonder at all. I assure you she is always forgetting herself, and taking care of the other nine.\u0027 \n \u0027Is she the eldest?\u0027 I inquired. \n \u0027Oh dear, no,\u0027 said Traddles. \u0027The eldest is a Beauty.\u0027 \n He saw, I suppose, that I could not help smiling at the simplicity of this reply; and added, with a smile upon his own ingenuous face: \n \u0027Not, of course, but that my Sophy - pretty name, Copperfield, I always think?\u0027 \n \u0027Very pretty!\u0027 said I. \n \u0027Not, of course, but that Sophy is beautiful too in my eyes, and would be one of the dearest girls that ever was, in anybody\u0027s eyes (I should think). But when I say the eldest is a Beauty, I mean she really is a -\u0027 he seemed to be describing clouds about himself, with both hands: \u0027Splendid, you know,\u0027 said Traddles, energetically. \u0027Indeed!\u0027 said I. \n \u0027Oh, I assure you,\u0027 said Traddles, \u0027something very uncommon, indeed! Then, you know, being formed for society and admiration, and not being able to enjoy much of it in consequence of their limited means, she naturally gets a little irritable and exacting, sometimes. Sophy puts her in good humour!\u0027 \n \u0027Is Sophy the youngest?\u0027 I hazarded. \n \u0027Oh dear, no!\u0027 said Traddles, stroking his chin. \u0027The two youngest are only nine and ten. Sophy educates \u0027em.\u0027 \n \u0027The second daughter, perhaps?\u0027 I hazarded. \n \u0027No,\u0027 said Traddles. \u0027Sarah\u0027s the second. Sarah has something the matter with her spine, poor girl. The malady will wear out by and by, the doctors say, but in the meantime she has to lie down for a twelvemonth. Sophy nurses her. Sophy\u0027s the fourth.\u0027 \n \u0027Is the mother living?\u0027 I inquired. \n \u0027Oh yes,\u0027 said Traddles, \u0027she is alive. She is a very superior woman indeed, but the damp country is not adapted to her constitution, and - in fact, she has lost the use of her limbs.\u0027 \n \u0027Dear me!\u0027 said I. \n \u0027Very sad, is it not?\u0027 returned Traddles. \u0027But in a merely domestic view it is not so bad as it might be, because Sophy takes her place. She is quite as much a mother to her mother, as she is to the other nine.\u0027 \n I felt the greatest admiration for the virtues of this young lady; and, honestly with the view of doing my best to prevent the good-nature of Traddles from being imposed upon, to the detriment of their joint prospects in life, inquired how Mr. Micawber was? \n \u0027He is quite well, Copperfield, thank you,\u0027 said Traddles. \u0027I am not living with him at present.\u0027 \n \u0027No?\u0027 \n \u0027No. You see the truth is,\u0027 said Traddles, in a whisper, \u0027he had changed his name to Mortimer, in consequence of his temporary embarrassments; and he don\u0027t come out till after dark - and then in spectacles. There was an execution put into our house, for rent. Mrs. Micawber was in such a dreadful state that I really couldn\u0027t resist giving my name to that second bill we spoke of here. You may imagine how delightful it was to my feelings, Copperfield, to see the matter settled with it, and Mrs. Micawber recover her spirits.\u0027 \n \u0027Hum!\u0027 said I. \u0027Not that her happiness was of long duration,\u0027 pursued Traddles, \u0027for, unfortunately, within a week another execution came in. It broke up the establishment. I have been living in a furnished apartment since then, and the Mortimers have been very private indeed. I hope you won\u0027t think it selfish, Copperfield, if I mention that the broker carried off my little round table with the marble top, and Sophy\u0027s flower-pot and stand?\u0027 \n \u0027What a hard thing!\u0027 I exclaimed indignantly. \n \u0027It was a - it was a pull,\u0027 said Traddles, with his usual wince at that expression. \u0027I don\u0027t mention it reproachfully, however, but with a motive. The fact is, Copperfield, I was unable to repurchase them at the time of their seizure; in the first place, because the broker, having an idea that I wanted them, ran the price up to an extravagant extent; and, in the second place, because I - hadn\u0027t any money. Now, I have kept my eye since, upon the broker\u0027s shop,\u0027 said Traddles, with a great enjoyment of his mystery, \u0027which is up at the top of Tottenham Court Road, and, at last, today I find them put out for sale. I have only noticed them from over the way, because if the broker saw me, bless you, he\u0027d ask any price for them! What has occurred to me, having now the money, is, that perhaps you wouldn\u0027t object to ask that good nurse of yours to come with me to the shop - I can show it her from round the corner of the next street - and make the best bargain for them, as if they were for herself, that she can!\u0027 \n The delight with which Traddles propounded this plan to me, and the sense he had of its uncommon artfulness, are among the freshest things in my remembrance. \n I told him that my old nurse would be delighted to assist him, and that we would all three take the field together, but on one condition. That condition was, that he should make a solemn resolution to grant no more loans of his name, or anything else, to Mr. Micawber. \n \u0027My dear Copperfield,\u0027 said Traddles, \u0027I have already done so, because I begin to feel that I have not only been inconsiderate, but that I have been positively unjust to Sophy. My word being passed to myself, there is no longer any apprehension; but I pledge it to you, too, with the greatest readiness. That first unlucky obligation, I have paid. I have no doubt Mr. Micawber would have paid it if he could, but he could not. One thing I ought to mention, which I like very much in Mr. Micawber, Copperfield. It refers to the second obligation, which is not yet due. He don\u0027t tell me that it is provided for, but he says it WILL BE. Now, I think there is something very fair and honest about that!\u0027 \n I was unwilling to damp my good friend\u0027s confidence, and therefore assented. After a little further conversation, we went round to the chandler\u0027s shop, to enlist Peggotty; Traddles declining to pass the evening with me, both because he endured the liveliest apprehensions that his property would be bought by somebody else before he could re-purchase it, and because it was the evening he always devoted to writing to the dearest girl in the world. \n I never shall forget him peeping round the corner of the street in Tottenham Court Road, while Peggotty was bargaining for the precious articles; or his agitation when she came slowly towards us after vainly offering a price, and was hailed by the relenting broker, and went back again. The end of the negotiation was, that she bought the property on tolerably easy terms, and Traddles was transported with pleasure. \n \u0027I am very much obliged to you, indeed,\u0027 said Traddles, on hearing it was to be sent to where he lived, that night. \u0027If I might ask one other favour, I hope you would not think it absurd, Copperfield?\u0027 \n I said beforehand, certainly not. \n \u0027Then if you WOULD be good enough,\u0027 said Traddles to Peggotty, \u0027to get the flower-pot now, I think I should like (it being Sophy\u0027s, Copperfield) to carry it home myself!\u0027 \n Peggotty was glad to get it for him, and he overwhelmed her with thanks, and went his way up Tottenham Court Road, carrying the flower-pot affectionately in his arms, with one of the most delighted expressions of countenance I ever saw. \n We then turned back towards my chambers. As the shops had charms for Peggotty which I never knew them possess in the same degree for anybody else, I sauntered easily along, amused by her staring in at the windows, and waiting for her as often as she chose. We were thus a good while in getting to the Adelphi. \n On our way upstairs, I called her attention to the sudden disappearance of Mrs. Crupp\u0027s pitfalls, and also to the prints of recent footsteps. We were both very much surprised, coming higher up, to find my outer door standing open (which I had shut) and to hear voices inside. \n We looked at one another, without knowing what to make of this, and went into the sitting-room. What was my amazement to find, of all people upon earth, my aunt there, and Mr. Dick! My aunt sitting on a quantity of luggage, with her two birds before her, and her cat on her knee, like a female Robinson Crusoe, drinking tea. Mr. Dick leaning thoughtfully on a great kite, such as we had often been out together to fly, with more luggage piled about him! \n \u0027My dear aunt!\u0027 cried I. \u0027Why, what an unexpected pleasure!\u0027 \n We cordially embraced; and Mr. Dick and I cordially shook hands; and Mrs. Crupp, who was busy making tea, and could not be too attentive, cordially said she had knowed well as Mr. Copperfull would have his heart in his mouth, when he see his dear relations. \n \u0027Holloa!\u0027 said my aunt to Peggotty, who quailed before her awful presence. \u0027How are YOU?\u0027 \n \u0027You remember my aunt, Peggotty?\u0027 said I. \n \u0027For the love of goodness, child,\u0027 exclaimed my aunt, \u0027don\u0027t call the woman by that South Sea Island name! If she married and got rid of it, which was the best thing she could do, why don\u0027t you give her the benefit of the change? What\u0027s your name now, - P?\u0027 said my aunt, as a compromise for the obnoxious appellation. \n \u0027Barkis, ma\u0027am,\u0027 said Peggotty, with a curtsey. \n \u0027Well! That\u0027s human,\u0027 said my aunt. \u0027It sounds less as if you wanted a missionary. How d\u0027ye do, Barkis? I hope you\u0027re well?\u0027 \n Encouraged by these gracious words, and by my aunt\u0027s extending her hand, Barkis came forward, and took the hand, and curtseyed her acknowledgements. \n \u0027We are older than we were, I see,\u0027 said my aunt. \u0027We have only met each other once before, you know. A nice business we made of it then! Trot, my dear, another cup.\u0027 \n I handed it dutifully to my aunt, who was in her usual inflexible state of figure; and ventured a remonstrance with her on the subject of her sitting on a box. \n \u0027Let me draw the sofa here, or the easy-chair, aunt,\u0027 said I. \u0027Why should you be so uncomfortable?\u0027 \n \u0027Thank you, Trot,\u0027 replied my aunt, \u0027I prefer to sit upon my property.\u0027 Here my aunt looked hard at Mrs. Crupp, and observed, \u0027We needn\u0027t trouble you to wait, ma\u0027am.\u0027 \n \u0027Shall I put a little more tea in the pot afore I go, ma\u0027am?\u0027 said Mrs. Crupp. \n \u0027No, I thank you, ma\u0027am,\u0027 replied my aunt. \n \u0027Would you let me fetch another pat of butter, ma\u0027am?\u0027 said Mrs. Crupp. \u0027Or would you be persuaded to try a new-laid hegg? or should I brile a rasher? Ain\u0027t there nothing I could do for your dear aunt, Mr. Copperfull?\u0027 \n \u0027Nothing, ma\u0027am,\u0027 returned my aunt. \u0027I shall do very well, I thank you.\u0027 \n Mrs. Crupp, who had been incessantly smiling to express sweet temper, and incessantly holding her head on one side, to express a general feebleness of constitution, and incessantly rubbing her hands, to express a desire to be of service to all deserving objects, gradually smiled herself, one-sided herself, and rubbed herself, out of the room. \u0027Dick!\u0027 said my aunt. \u0027You know what I told you about time-servers and wealth-worshippers?\u0027 \n Mr. Dick - with rather a scared look, as if he had forgotten it - returned a hasty answer in the affirmative. \n \u0027Mrs. Crupp is one of them,\u0027 said my aunt. \u0027Barkis, I\u0027ll trouble you to look after the tea, and let me have another cup, for I don\u0027t fancy that woman\u0027s pouring-out!\u0027 \n I knew my aunt sufficiently well to know that she had something of importance on her mind, and that there was far more matter in this arrival than a stranger might have supposed. I noticed how her eye lighted on me, when she thought my attention otherwise occupied; and what a curious process of hesitation appeared to be going on within her, while she preserved her outward stiffness and composure. I began to reflect whether I had done anything to offend her; and my conscience whispered me that I had not yet told her about Dora. Could it by any means be that, I wondered! \n As I knew she would only speak in her own good time, I sat down near her, and spoke to the birds, and played with the cat, and was as easy as I could be. But I was very far from being really easy; and I should still have been so, even if Mr. Dick, leaning over the great kite behind my aunt, had not taken every secret opportunity of shaking his head darkly at me, and pointing at her. \n \u0027Trot,\u0027 said my aunt at last, when she had finished her tea, and carefully smoothed down her dress, and wiped her lips - \u0027you needn\u0027t go, Barkis! - Trot, have you got to be firm and self-reliant?\u0027 \n \u0027I hope so, aunt.\u0027 \n \u0027What do you think?\u0027 inquired Miss Betsey. \n \u0027I think so, aunt.\u0027 \n \u0027Then why, my love,\u0027 said my aunt, looking earnestly at me, \u0027why do you think I prefer to sit upon this property of mine tonight?\u0027 \n I shook my head, unable to guess. \n \u0027Because,\u0027 said my aunt, \u0027it\u0027s all I have. Because I\u0027m ruined, my dear!\u0027 \n If the house, and every one of us, had tumbled out into the river together, I could hardly have received a greater shock. \n \u0027Dick knows it,\u0027 said my aunt, laying her hand calmly on my shoulder. \u0027I am ruined, my dear Trot! All I have in the world is in this room, except the cottage; and that I have left Janet to let. Barkis, I want to get a bed for this gentleman tonight. To save expense, perhaps you can make up something here for myself. Anything will do. It\u0027s only for tonight. We\u0027ll talk about this, more, tomorrow.\u0027 \n I was roused from my amazement, and concern for her - I am sure, for her - by her falling on my neck, for a moment, and crying that she only grieved for me. In another moment she suppressed this emotion; and said with an aspect more triumphant than dejected: \n \u0027We must meet reverses boldly, and not suffer them to frighten us, my dear. We must learn to act the play out. We must live misfortune down, Trot!\u0027\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/101/5361.html","bookId":208,"book":{"id":208,"title":"David Copperfield大卫·科波菲尔","description":"简介： David Copperfield or The Personal History, Adventures, Experience and Observation of David Copperfield the Younger of Blunderstone Rookery (which he never meant to publish on any account)is a novel by Charles Dickens, first published as a novel in 185...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290216055bf31c.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/jingdian/101","creation":"Aug 1, 2019 12:18:24 AM","modification":"Aug 1, 2019 12:18:24 AM"}}
