{"id":6418,"no":8,"title":"Chapter 8","content":"When we arrived before day at the inn where the mail stopped, which was not the inn where my friend the waiter lived, I was shown up to a nice little bedroom, with DOLPHIN painted on the door. Very cold I was, I know, notwithstanding the hot tea they had given me before a large fire downstairs; and very glad I was to turn into the Dolphin\u0027s bed, pull the Dolphin\u0027s blankets round my head, and go to sleep.\n Mr. Barkis the carrier was to call for me in the morning at nine o\u0027clock. I got up at eight, a little giddy from the shortness of my night\u0027s rest, and was ready for him before the appointed time. He received me exactly as if not five minutes had elapsed since we were last together, and I had only been into the hotel to get change for sixpence, or something of that sort.\n As soon as I and my box were in the cart, and the carrier seated, the lazy horse walked away with us all at his accustomed pace.\n \u0027You look very well, Mr. Barkis,\u0027 I said, thinking he would like to know it.\n Mr. Barkis rubbed his cheek with his cuff, and then looked at his cuff as if he expected to find some of the bloom upon it; but made no other acknowledgement of the compliment.\n \u0027I gave your message, Mr. Barkis,\u0027 I said: \u0027I wrote to Peggotty.\u0027\n \u0027Ah!\u0027 said Mr. Barkis.\n Mr. Barkis seemed gruff, and answered drily.\n \u0027Wasn\u0027t it right, Mr. Barkis?\u0027 I asked, after a little hesitation.\n \u0027Why, no,\u0027 said Mr. Barkis.\n \u0027Not the message?\u0027\n \u0027The message was right enough, perhaps,\u0027 said Mr. Barkis; \u0027but it come to an end there.\u0027\n Not understanding what he meant, I repeated inquisitively: \u0027Came to an end, Mr. Barkis?\u0027\n \u0027Nothing come of it,\u0027 he explained, looking at me sideways. \u0027No answer.\u0027\n \u0027There was an answer expected, was there, Mr. Barkis?\u0027 said I, opening my eyes. For this was a new light to me.\n \u0027When a man says he\u0027s willin\u0027,\u0027 said Mr. Barkis, turning his glance slowly on me again, \u0027it\u0027s as much as to say, that man\u0027s a-waitin\u0027 for a answer.\u0027\n \u0027Well, Mr. Barkis?\u0027\n \u0027Well,\u0027 said Mr. Barkis, carrying his eyes back to his horse\u0027s ears; \u0027that man\u0027s been a-waitin\u0027 for a answer ever since.\u0027\n \u0027Have you told her so, Mr. Barkis?\u0027\n \u0027No - no,\u0027 growled Mr. Barkis, reflecting about it. \u0027I ain\u0027t got no call to go and tell her so. I never said six words to her myself, I ain\u0027t a-goin\u0027 to tell her so.\u0027\n \u0027Would you like me to do it, Mr. Barkis?\u0027 said I, doubtfully. \u0027You might tell her, if you would,\u0027 said Mr. Barkis, with another slow look at me, \u0027that Barkis was a-waitin\u0027 for a answer. Says you - what name is it?\u0027\n \u0027Her name?\u0027\n \u0027Ah!\u0027 said Mr. Barkis, with a nod of his head.\n \u0027Peggotty.\u0027\n \u0027Chrisen name? Or nat\u0027ral name?\u0027 said Mr. Barkis.\n \u0027Oh, it\u0027s not her Christian name. Her Christian name is Clara.\u0027\n \u0027Is it though?\u0027 said Mr. Barkis.\n He seemed to find an immense fund of reflection in this circumstance, and sat pondering and inwardly whistling for some time.\n \u0027Well!\u0027 he resumed at length. \u0027Says you, \"Peggotty! Barkis is waitin\u0027 for a answer.\" Says she, perhaps, \"Answer to what?\" Says you, \"To what I told you.\" \"What is that?\" says she. \"Barkis is willin\u0027,\" says you.\u0027\n This extremely artful suggestion Mr. Barkis accompanied with a nudge of his elbow that gave me quite a stitch in my side. After that, he slouched over his horse in his usual manner; and made no other reference to the subject except, half an hour afterwards, taking a piece of chalk from his pocket, and writing up, inside the tilt of the cart, \u0027Clara Peggotty\u0027 - apparently as a private memorandum.\n Ah, what a strange feeling it was to be going home when it was not home, and to find that every object I looked at, reminded me of the happy old home, which was like a dream I could never dream again! The days when my mother and I and Peggotty were all in all to one another, and there was no one to come between us, rose up before me so sorrowfully on the road, that I am not sure I was glad to be there - not sure but that I would rather have remained away, and forgotten it in Steerforth\u0027s company. But there I was; and soon I was at our house, where the bare old elm-trees wrung their many hands in the bleak wintry air, and shreds of the old rooks\u0027-nests drifted away upon the wind.\n The carrier put my box down at the garden-gate, and left me. I walked along the path towards the house, glancing at the windows, and fearing at every step to see Mr. Murdstone or Miss Murdstone lowering out of one of them. No face appeared, however; and being come to the house, and knowing how to open the door, before dark, without knocking, I went in with a quiet, timid step.\n God knows how infantine the memory may have been, that was awakened within me by the sound of my mother\u0027s voice in the old parlour, when I set foot in the hall. She was singing in a low tone. I think I must have lain in her arms, and heard her singing so to me when I was but a baby. The strain was new to me, and yet it was so old that it filled my heart brim-full; like a friend come back from a long absence.\n I believed, from the solitary and thoughtful way in which my mother murmured her song, that she was alone. And I went softly into the room. She was sitting by the fire, suckling an infant, whose tiny hand she held against her neck. Her eyes were looking down upon its face, and she sat singing to it. I was so far right, that she had no other companion.\n I spoke to her, and she started, and cried out. But seeing me, she called me her dear Davy, her own boy! and coming half across the room to meet me, kneeled down upon the ground and kissed me, and laid my head down on her bosom near the little creature that was nestling there, and put its hand to my lips.\n I wish I had died. I wish I had died then, with that feeling in my heart! I should have been more fit for Heaven than I ever have been since.\n \u0027He is your brother,\u0027 said my mother, fondling me. \u0027Davy, my pretty boy! My poor child!\u0027 Then she kissed me more and more, and clasped me round the neck. This she was doing when Peggotty came running in, and bounced down on the ground beside us, and went mad about us both for a quarter of an hour.\n It seemed that I had not been expected so soon, the carrier being much before his usual time. It seemed, too, that Mr. and Miss Murdstone had gone out upon a visit in the neighbourhood, and would not return before night. I had never hoped for this. I had never thought it possible that we three could be together undisturbed, once more; and I felt, for the time, as if the old days were come back.\n We dined together by the fireside. Peggotty was in attendance to wait upon us, but my mother wouldn\u0027t let her do it, and made her dine with us. I had my own old plate, with a brown view of a man-of-war in full sail upon it, which Peggotty had hoarded somewhere all the time I had been away, and would not have had broken, she said, for a hundred pounds. I had my own old mug with David on it, and my own old little knife and fork that wouldn\u0027t cut.\n While we were at table, I thought it a favourable occasion to tell Peggotty about Mr. Barkis, who, before I had finished what I had to tell her, began to laugh, and throw her apron over her face.\n \u0027Peggotty,\u0027 said my mother. \u0027What\u0027s the matter?\u0027\n Peggotty only laughed the more, and held her apron tight over her face when my mother tried to pull it away, and sat as if her head were in a bag.\n \u0027What are you doing, you stupid creature?\u0027 said my mother, laughing.\n \u0027Oh, drat the man!\u0027 cried Peggotty. \u0027He wants to marry me.\u0027\n \u0027It would be a very good match for you; wouldn\u0027t it?\u0027 said my mother.\n \u0027Oh! I don\u0027t know,\u0027 said Peggotty. \u0027Don\u0027t ask me. I wouldn\u0027t have him if he was made of gold. Nor I wouldn\u0027t have anybody.\u0027\n \u0027Then, why don\u0027t you tell him so, you ridiculous thing?\u0027 said my mother.\n \u0027Tell him so,\u0027 retorted Peggotty, looking out of her apron. \u0027He has never said a word to me about it. He knows better. If he was to make so bold as say a word to me, I should slap his face.\u0027\n Her own was as red as ever I saw it, or any other face, I think; but she only covered it again, for a few moments at a time, when she was taken with a violent fit of laughter; and after two or three of those attacks, went on with her dinner.\n I remarked that my mother, though she smiled when Peggotty looked at her, became more serious and thoughtful. I had seen at first that she was changed. Her face was very pretty still, but it looked careworn, and too delicate; and her hand was so thin and white that it seemed to me to be almost transparent. But the change to which I now refer was superadded to this: it was in her manner, which became anxious and fluttered. At last she said, putting out her hand, and laying it affectionately on the hand of her old servant,\n \u0027Peggotty, dear, you are not going to be married?\u0027\n \u0027Me, ma\u0027am?\u0027 returned Peggotty, staring. \u0027Lord bless you, no!\u0027\n \u0027Not just yet?\u0027 said my mother, tenderly.\n \u0027Never!\u0027 cried Peggotty.\n My mother took her hand, and said:\n \u0027Don\u0027t leave me, Peggotty. Stay with me. It will not be for long, perhaps. What should I ever do without you!\u0027\n \u0027Me leave you, my precious!\u0027 cried Peggotty. \u0027Not for all the world and his wife. Why, what\u0027s put that in your silly little head?\u0027 - For Peggotty had been used of old to talk to my mother sometimes like a child.\n But my mother made no answer, except to thank her, and Peggotty went running on in her own fashion.\n \u0027Me leave you? I think I see myself. Peggotty go away from you? I should like to catch her at it! No, no, no,\u0027 said Peggotty, shaking her head, and folding her arms; \u0027not she, my dear. It isn\u0027t that there ain\u0027t some Cats that would be well enough pleased if she did, but they sha\u0027n\u0027t be pleased. They shall be aggravated. I\u0027ll stay with you till I am a cross cranky old woman. And when I\u0027m too deaf, and too lame, and too blind, and too mumbly for want of teeth, to be of any use at all, even to be found fault with, than I shall go to my Davy, and ask him to take me in.\u0027\n \u0027And, Peggotty,\u0027 says I, \u0027I shall be glad to see you, and I\u0027ll make you as welcome as a queen.\u0027\n \u0027Bless your dear heart!\u0027 cried Peggotty. \u0027I know you will!\u0027 And she kissed me beforehand, in grateful acknowledgement of my hospitality. After that, she covered her head up with her apron again and had another laugh about Mr. Barkis. After that, she took the baby out of its little cradle, and nursed it. After that, she cleared the dinner table; after that, came in with another cap on, and her work-box, and the yard-measure, and the bit of wax-candle, all just the same as ever.\n We sat round the fire, and talked delightfully. I told them what a hard master Mr. Creakle was, and they pitied me very much. I told them what a fine fellow Steerforth was, and what a patron of mine, and Peggotty said she would walk a score of miles to see him. I took the little baby in my arms when it was awake, and nursed it lovingly. When it was asleep again, I crept close to my mother\u0027s side according to my old custom, broken now a long time, and sat with my arms embracing her waist, and my little red cheek on her shoulder, and once more felt her beautiful hair drooping over me like an angel\u0027s wing as I used to think, I recollect - and was very happy indeed.\n While I sat thus, looking at the fire, and seeing pictures in the red-hot coals, I almost believed that I had never been away; that Mr. and Miss Murdstone were such pictures, and would vanish when the fire got low; and that there was nothing real in all that I remembered, save my mother, Peggotty, and I.\n Peggotty darned away at a stocking as long as she could see, and then sat with it drawn on her left hand like a glove, and her needle in her right, ready to take another stitch whenever there was a blaze. I cannot conceive whose stockings they can have been that Peggotty was always darning, or where such an unfailing supply of stockings in want of darning can have come from. From my earliest infancy she seems to have been always employed in that class of needlework, and never by any chance in any other.\n \u0027I wonder,\u0027 said Peggotty, who was sometimes seized with a fit of wondering on some most unexpected topic, \u0027what\u0027s become of Davy\u0027s great-aunt?\u0027 \u0027Lor, Peggotty!\u0027 observed my mother, rousing herself from a reverie, \u0027what nonsense you talk!\u0027\n \u0027Well, but I really do wonder, ma\u0027am,\u0027 said Peggotty.\n \u0027What can have put such a person in your head?\u0027 inquired my mother. \u0027Is there nobody else in the world to come there?\u0027\n \u0027I don\u0027t know how it is,\u0027 said Peggotty, \u0027unless it\u0027s on account of being stupid, but my head never can pick and choose its people. They come and they go, and they don\u0027t come and they don\u0027t go, just as they like. I wonder what\u0027s become of her?\u0027\n \u0027How absurd you are, Peggotty!\u0027 returned my mother. \u0027One would suppose you wanted a second visit from her.\u0027\n \u0027Lord forbid!\u0027 cried Peggotty.\n \u0027Well then, don\u0027t talk about such uncomfortable things, there\u0027s a good soul,\u0027 said my mother. \u0027Miss Betsey is shut up in her cottage by the sea, no doubt, and will remain there. At all events, she is not likely ever to trouble us again.\u0027\n \u0027No!\u0027 mused Peggotty. \u0027No, that ain\u0027t likely at all. - I wonder, if she was to die, whether she\u0027d leave Davy anything?\u0027\n \u0027Good gracious me, Peggotty,\u0027 returned my mother, \u0027what a nonsensical woman you are! when you know that she took offence at the poor dear boy\u0027s ever being born at all.\u0027\n \u0027I suppose she wouldn\u0027t be inclined to forgive him now,\u0027 hinted Peggotty.\n \u0027Why should she be inclined to forgive him now?\u0027 said my mother, rather sharply.\n \u0027Now that he\u0027s got a brother, I mean,\u0027 said Peggotty.\n MY mother immediately began to cry, and wondered how Peggotty dared to say such a thing.\n \u0027As if this poor little innocent in its cradle had ever done any harm to you or anybody else, you jealous thing!\u0027 said she. \u0027You had much better go and marry Mr. Barkis, the carrier. Why don\u0027t you?\u0027\n \u0027I should make Miss Murdstone happy, if I was to,\u0027 said Peggotty.\n \u0027What a bad disposition you have, Peggotty!\u0027 returned my mother. \u0027You are as jealous of Miss Murdstone as it is possible for a ridiculous creature to be. You want to keep the keys yourself, and give out all the things, I suppose? I shouldn\u0027t be surprised if you did. When you know that she only does it out of kindness and the best intentions! You know she does, Peggotty - you know it well.\u0027\n Peggotty muttered something to the effect of \u0027Bother the best intentions!\u0027 and something else to the effect that there was a little too much of the best intentions going on.\n \u0027I know what you mean, you cross thing,\u0027 said my mother. \u0027I understand you, Peggotty, perfectly. You know I do, and I wonder you don\u0027t colour up like fire. But one point at a time. Miss Murdstone is the point now, Peggotty, and you sha\u0027n\u0027t escape from it. Haven\u0027t you heard her say, over and over again, that she thinks I am too thoughtless and too - a - a -\u0027\n \u0027Pretty,\u0027 suggested Peggotty.\n \u0027Well,\u0027 returned my mother, half laughing, \u0027and if she is so silly as to say so, can I be blamed for it?\u0027\n \u0027No one says you can,\u0027 said Peggotty.\n \u0027No, I should hope not, indeed!\u0027 returned my mother. \u0027Haven\u0027t you heard her say, over and over again, that on this account she wished to spare me a great deal of trouble, which she thinks I am not suited for, and which I really don\u0027t know myself that I AM suited for; and isn\u0027t she up early and late, and going to and fro continually - and doesn\u0027t she do all sorts of things, and grope into all sorts of places, coal-holes and pantries and I don\u0027t know where, that can\u0027t be very agreeable - and do you mean to insinuate that there is not a sort of devotion in that?\u0027\n \u0027I don\u0027t insinuate at all,\u0027 said Peggotty.\n \u0027You do, Peggotty,\u0027 returned my mother. \u0027You never do anything else, except your work. You are always insinuating. You revel in it. And when you talk of Mr. Murdstone\u0027s good intentions -\u0027\n \u0027I never talked of \u0027em,\u0027 said Peggotty.\n \u0027No, Peggotty,\u0027 returned my mother, \u0027but you insinuated. That\u0027s what I told you just now. That\u0027s the worst of you. You WILL insinuate. I said, at the moment, that I understood you, and you see I did. When you talk of Mr. Murdstone\u0027s good intentions, and pretend to slight them (for I don\u0027t believe you really do, in your heart, Peggotty), you must be as well convinced as I am how good they are, and how they actuate him in everything. If he seems to have been at all stern with a certain person, Peggotty - you understand, and so I am sure does Davy, that I am not alluding to anybody present - it is solely because he is satisfied that it is for a certain person\u0027s benefit. He naturally loves a certain person, on my account; and acts solely for a certain person\u0027s good. He is better able to judge of it than I am; for I very well know that I am a weak, light, girlish creature, and that he is a firm, grave, serious man. And he takes,\u0027 said my mother, with the tears which were engendered in her affectionate nature, stealing down her face, \u0027he takes great pains with me; and I ought to be very thankful to him, and very submissive to him even in my thoughts; and when I am not, Peggotty, I worry and condemn myself, and feel doubtful of my own heart, and don\u0027t know what to do.\u0027\n Peggotty sat with her chin on the foot of the stocking, looking silently at the fire.\n \u0027There, Peggotty,\u0027 said my mother, changing her tone, \u0027don\u0027t let us fall out with one another, for I couldn\u0027t bear it. You are my true friend, I know, if I have any in the world. When I call you a ridiculous creature, or a vexatious thing, or anything of that sort, Peggotty, I only mean that you are my true friend, and always have been, ever since the night when Mr. Copperfield first brought me home here, and you came out to the gate to meet me.\u0027\n Peggotty was not slow to respond, and ratify the treaty of friendship by giving me one of her best hugs. I think I had some glimpses of the real character of this conversation at the time; but I am sure, now, that the good creature originated it, and took her part in it, merely that my mother might comfort herself with the little contradictory summary in which she had indulged. The design was efficacious; for I remember that my mother seemed more at ease during the rest of the evening, and that Peggotty observed her less.\n When we had had our tea, and the ashes were thrown up, and the candles snuffed, I read Peggotty a chapter out of the Crocodile Book, in remembrance of old times - she took it out of her pocket: I don\u0027t know whether she had kept it there ever since - and then we talked about Salem House, which brought me round again to Steerforth, who was my great subject. We were very happy; and that evening, as the last of its race, and destined evermore to close that volume of my life, will never pass out of my memory.\n It was almost ten o\u0027clock before we heard the sound of wheels. We all got up then; and my mother said hurriedly that, as it was so late, and Mr. and Miss Murdstone approved of early hours for young people, perhaps I had better go to bed. I kissed her, and went upstairs with my candle directly, before they came in. It appeared to my childish fancy, as I ascended to the bedroom where I had been imprisoned, that they brought a cold blast of air into the house which blew away the old familiar feeling like a feather.\n I felt uncomfortable about going down to breakfast in the morning, as I had never set eyes on Mr. Murdstone since the day when I committed my memorable offence. However, as it must be done, I went down, after two or three false starts half-way, and as many runs back on tiptoe to my own room, and presented myself in the parlour.\n He was standing before the fire with his back to it, while Miss Murdstone made the tea. He looked at me steadily as I entered, but made no sign of recognition whatever.\n I went up to him, after a moment of confusion, and said: \u0027I beg your pardon, sir. I am very sorry for what I did, and I hope you will forgive me.\u0027\n \u0027I am glad to hear you are sorry, David,\u0027 he replied.\n The hand he gave me was the hand I had bitten. I could not restrain my eye from resting for an instant on a red spot upon it; but it was not so red as I turned, when I met that sinister expression in his face.\n \u0027How do you do, ma\u0027am?\u0027 I said to Miss Murdstone.\n \u0027Ah, dear me!\u0027 sighed Miss Murdstone, giving me the tea-caddy scoop instead of her fingers. \u0027How long are the holidays?\u0027\n \u0027A month, ma\u0027am.\u0027\n \u0027Counting from when?\u0027\n \u0027From today, ma\u0027am.\u0027\n \u0027Oh!\u0027 said Miss Murdstone. \u0027Then here\u0027s one day off.\u0027\n She kept a calendar of the holidays in this way, and every morning checked a day off in exactly the same manner. She did it gloomily until she came to ten, but when she got into two figures she became more hopeful, and, as the time advanced, even jocular.\n It was on this very first day that I had the misfortune to throw her, though she was not subject to such weakness in general, into a state of violent consternation. I came into the room where she and my mother were sitting; and the baby (who was only a few weeks old) being on my mother\u0027s lap, I took it very carefully in my arms. Suddenly Miss Murdstone gave such a scream that I all but dropped it.\n \u0027My dear Jane!\u0027 cried my mother.\n \u0027Good heavens, Clara, do you see?\u0027 exclaimed Miss Murdstone.\n \u0027See what, my dear Jane?\u0027 said my mother; \u0027where?\u0027\n \u0027He\u0027s got it!\u0027 cried Miss Murdstone. \u0027The boy has got the baby!\u0027\n She was limp with horror; but stiffened herself to make a dart at me, and take it out of my arms. Then, she turned faint; and was so very ill that they were obliged to give her cherry brandy. I was solemnly interdicted by her, on her recovery, from touching my brother any more on any pretence whatever; and my poor mother, who, I could see, wished otherwise, meekly confirmed the interdict, by saying: \u0027No doubt you are right, my dear Jane.\u0027\n On another occasion, when we three were together, this same dear baby - it was truly dear to me, for our mother\u0027s sake - was the innocent occasion of Miss Murdstone\u0027s going into a passion. My mother, who had been looking at its eyes as it lay upon her lap, said:\n \u0027Davy! come here!\u0027 and looked at mine.\n I saw Miss Murdstone lay her beads down.\n \u0027I declare,\u0027 said my mother, gently, \u0027they are exactly alike. I suppose they are mine. I think they are the colour of mine. But they are wonderfully alike.\u0027\n \u0027What are you talking about, Clara?\u0027 said Miss Murdstone.\n \u0027My dear Jane,\u0027 faltered my mother, a little abashed by the harsh tone of this inquiry, \u0027I find that the baby\u0027s eyes and Davy\u0027s are exactly alike.\u0027\n \u0027Clara!\u0027 said Miss Murdstone, rising angrily, \u0027you are a positive fool sometimes.\u0027\n \u0027My dear Jane,\u0027 remonstrated my mother.\n \u0027A positive fool,\u0027 said Miss Murdstone. \u0027Who else could compare my brother\u0027s baby with your boy? They are not at all alike. They are exactly unlike. They are utterly dissimilar in all respects. I hope they will ever remain so. I will not sit here, and hear such comparisons made.\u0027 With that she stalked out, and made the door bang after her.\n In short, I was not a favourite with Miss Murdstone. In short, I was not a favourite there with anybody, not even with myself; for those who did like me could not show it, and those who did not, showed it so plainly that I had a sensitive consciousness of always appearing constrained, boorish, and dull.\n I felt that I made them as uncomfortable as they made me. If I came into the room where they were, and they were talking together and my mother seemed cheerful, an anxious cloud would steal over her face from the moment of my entrance. If Mr. Murdstone were in his best humour, I checked him. If Miss Murdstone were in her worst, I intensified it. I had perception enough to know that my mother was the victim always; that she was afraid to speak to me or to be kind to me, lest she should give them some offence by her manner of doing so, and receive a lecture afterwards; that she was not only ceaselessly afraid of her own offending, but of my offending, and uneasily watched their looks if I only moved. Therefore I resolved to keep myself as much out of their way as I could; and many a wintry hour did I hear the church clock strike, when I was sitting in my cheerless bedroom, wrapped in my little great-coat, poring over a book.\n In the evening, sometimes, I went and sat with Peggotty in the kitchen. There I was comfortable, and not afraid of being myself. But neither of these resources was approved of in the parlour. The tormenting humour which was dominant there stopped them both. I was still held to be necessary to my poor mother\u0027s training, and, as one of her trials, could not be suffered to absent myself.\n \u0027David,\u0027 said Mr. Murdstone, one day after dinner when I was going to leave the room as usual; \u0027I am sorry to observe that you are of a sullen disposition.\u0027\n \u0027As sulky as a bear!\u0027 said Miss Murdstone.\n I stood still, and hung my head.\n \u0027Now, David,\u0027 said Mr. Murdstone, \u0027a sullen obdurate disposition is, of all tempers, the worst.\u0027\n \u0027And the boy\u0027s is, of all such dispositions that ever I have seen,\u0027 remarked his sister, \u0027the most confirmed and stubborn. I think, my dear Clara, even you must observe it?\u0027\n \u0027I beg your pardon, my dear Jane,\u0027 said my mother, \u0027but are you quite sure - I am certain you\u0027ll excuse me, my dear Jane - that you understand Davy?\u0027\n \u0027I should be somewhat ashamed of myself, Clara,\u0027 returned Miss Murdstone, \u0027if I could not understand the boy, or any boy. I don\u0027t profess to be profound; but I do lay claim to common sense.\u0027\n \u0027No doubt, my dear Jane,\u0027 returned my mother, \u0027your understanding is very vigorous -\u0027\n \u0027Oh dear, no! Pray don\u0027t say that, Clara,\u0027 interposed Miss Murdstone, angrily.\n \u0027But I am sure it is,\u0027 resumed my mother; \u0027and everybody knows it is. I profit so much by it myself, in many ways - at least I ought to - that no one can be more convinced of it than myself; and therefore I speak with great diffidence, my dear Jane, I assure you.\u0027\n \u0027We\u0027ll say I don\u0027t understand the boy, Clara,\u0027 returned Miss Murdstone, arranging the little fetters on her wrists. \u0027We\u0027ll agree, if you please, that I don\u0027t understand him at all. He is much too deep for me. But perhaps my brother\u0027s penetration may enable him to have some insight into his character. And I believe my brother was speaking on the subject when we - not very decently - interrupted him.\u0027\n \u0027I think, Clara,\u0027 said Mr. Murdstone, in a low grave voice, \u0027that there may be better and more dispassionate judges of such a question than you.\u0027\n \u0027Edward,\u0027 replied my mother, timidly, \u0027you are a far better judge of all questions than I pretend to be. Both you and Jane are. I only said -\u0027\n \u0027You only said something weak and inconsiderate,\u0027 he replied. \u0027Try not to do it again, my dear Clara, and keep a watch upon yourself.\u0027\n MY mother\u0027s lips moved, as if she answered \u0027Yes, my dear Edward,\u0027 but she said nothing aloud.\n \u0027I was sorry, David, I remarked,\u0027 said Mr. Murdstone, turning his head and his eyes stiffly towards me, \u0027to observe that you are of a sullen disposition. This is not a character that I can suffer to develop itself beneath my eyes without an effort at improvement. You must endeavour, sir, to change it. We must endeavour to change it for you.\u0027\n \u0027I beg your pardon, sir,\u0027 I faltered. \u0027I have never meant to be sullen since I came back.\u0027\n \u0027Don\u0027t take refuge in a lie, sir!\u0027 he returned so fiercely, that I saw my mother involuntarily put out her trembling hand as if to interpose between us. \u0027You have withdrawn yourself in your sullenness to your own room. You have kept your own room when you ought to have been here. You know now, once for all, that I require you to be here, and not there. Further, that I require you to bring obedience here. You know me, David. I will have it done.\u0027\n Miss Murdstone gave a hoarse chuckle.\n \u0027I will have a respectful, prompt, and ready bearing towards myself,\u0027 he continued, \u0027and towards Jane Murdstone, and towards your mother. I will not have this room shunned as if it were infected, at the pleasure of a child. Sit down.\u0027\n He ordered me like a dog, and I obeyed like a dog.\n \u0027One thing more,\u0027 he said. \u0027I observe that you have an attachment to low and common company. You are not to associate with servants. The kitchen will not improve you, in the many respects in which you need improvement. Of the woman who abets you, I say nothing since you, Clara,\u0027 addressing my mother in a lower voice, \u0027from old associations and long-established fancies, have a weakness respecting her which is not yet overcome.\u0027\n \u0027A most unaccountable delusion it is!\u0027 cried Miss Murdstone.\n \u0027I only say,\u0027 he resumed, addressing me, \u0027that I disapprove of your preferring such company as Mistress Peggotty, and that it is to be abandoned. Now, David, you understand me, and you know what will be the consequence if you fail to obey me to the letter.\u0027\n I knew well - better perhaps than he thought, as far as my poor mother was concerned - and I obeyed him to the letter. I retreated to my own room no more; I took refuge with Peggotty no more; but sat wearily in the parlour day after day, looking forward to night, and bedtime.\n What irksome constraint I underwent, sitting in the same attitude hours upon hours, afraid to move an arm or a leg lest Miss Murdstone should complain (as she did on the least pretence) of my restlessness, and afraid to move an eye lest she should light on some look of dislike or scrutiny that would find new cause for complaint in mine! What intolerable dulness to sit listening to the ticking of the clock; and watching Miss Murdstone\u0027s little shiny steel beads as she strung them; and wondering whether she would ever be married, and if so, to what sort of unhappy man; and counting the divisions in the moulding of the chimney-piece; and wandering away, with my eyes, to the ceiling, among the curls and corkscrews in the paper on the wall!\n What walks I took alone, down muddy lanes, in the bad winter weather, carrying that parlour, and Mr. and Miss Murdstone in it, everywhere: a monstrous load that I was obliged to bear, a daymare that there was no possibility of breaking in, a weight that brooded on my wits, and blunted them!\n What meals I had in silence and embarrassment, always feeling that there were a knife and fork too many, and that mine; an appetite too many, and that mine; a plate and chair too many, and those mine; a somebody too many, and that I!\n What evenings, when the candles came, and I was expected to employ myself, but, not daring to read an entertaining book, pored over some hard-headed, harder-hearted treatise on arithmetic; when the tables of weights and measures set themselves to tunes, as \u0027Rule Britannia\u0027, or \u0027Away with Melancholy\u0027; when they wouldn\u0027t stand still to be learnt, but would go threading my grandmother\u0027s needle through my unfortunate head, in at one ear and out at the other! What yawns and dozes I lapsed into, in spite of all my care; what starts I came out of concealed sleeps with; what answers I never got, to little observations that I rarely made; what a blank space I seemed, which everybody overlooked, and yet was in everybody\u0027s way; what a heavy relief it was to hear Miss Murdstone hail the first stroke of nine at night, and order me to bed!\n Thus the holidays lagged away, until the morning came when Miss Murdstone said: \u0027Here\u0027s the last day off!\u0027 and gave me the closing cup of tea of the vacation.\n I was not sorry to go. I had lapsed into a stupid state; but I was recovering a little and looking forward to Steerforth, albeit Mr. Creakle loomed behind him. Again Mr. Barkis appeared at the gate, and again Miss Murdstone in her warning voice, said: \u0027Clara!\u0027 when my mother bent over me, to bid me farewell.\n I kissed her, and my baby brother, and was very sorry then; but not sorry to go away, for the gulf between us was there, and the parting was there, every day. And it is not so much the embrace she gave me, that lives in my mind, though it was as fervent as could be, as what followed the embrace.\n I was in the carrier\u0027s cart when I heard her calling to me. I looked out, and she stood at the garden-gate alone, holding her baby up in her arms for me to see. It was cold still weather; and not a hair of her head, nor a fold of her dress, was stirred, as she looked intently at me, holding up her child.\n So I lost her. So I saw her afterwards, in my sleep at school - a silent presence near my bed - looking at me with the same intent face - holding up her baby in her arms.\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/101/5335.html","bookId":208,"book":{"id":208,"title":"David Copperfield大卫·科波菲尔","description":"简介： David Copperfield or The Personal History, Adventures, Experience and Observation of David Copperfield the Younger of Blunderstone Rookery (which he never meant to publish on any account)is a novel by Charles Dickens, first published as a novel in 185...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290216055bf31c.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/jingdian/101","creation":"Aug 1, 2019 12:18:24 AM","modification":"Aug 1, 2019 12:18:24 AM"}}
