{"id":27047,"no":10,"title":"Chapter 9","content":"MAY had reached its second half; the first hot summer days had already set in. After his history lesson one day, Nejdanov wandered out into the garden, and from thence into a birch wood adjoining it on one side. Certain parts of this wood had been cleared by merchants about fifteen years ago, but these clearings were already densely overgrown by young birches, whose soft silver trunks encircled by grey rings rose as straight as pillars, and whose bright green leaves sparkled as if they had just been washed and polished. The grass shot up in sharp tongues through the even layers of last years’ fallen leaves. Little narrow paths ran here and there, from which yellow-beaked blackbirds rose with startled cries, flying close to the earth into the wood as hard as they could go. After wandering about for half an hour, Nejdanov sat down on the stump of a tree, surrounded by old greyish splinters, lying in heaps, exactly as they had fallen when cut down by the axe. Many a time had these splinters been covered by the winter’s snow and been thawed by the spring sun, but nobody had touched them. Nejdanov leaned against a solid wall of young birches casting a heavy though mild shade. He was not thinking of anything in particular, but gave himself up to those peculiar sensations of spring which in the heart of young and old alike are always mixed with a certain degree of sadness — the keen sadness of awaiting in the young and of settled regret in the old. Nejdanov was suddenly awakened by approaching footsteps. It did not sound like the footsteps of one person, nor like a peasant in heavy boots, or a barefooted peasant woman; it seemed as if two people were advancing at a slow, measured pace. The slight rustling of a woman’s dress was heard. Suddenly a deep man’s voice was heard to say: Is this your last word? Never? “Never!” a familiar woman’s voice repeated, and a moment later from a bend in the path, hidden from view by a young tree, Mariana appeared, accompanied by a swarthy man with black eyes, an individual whom Nejdanov had never seen before. They both stood still as if rooted to the spot on catching sight of him, and he was so taken aback that he did not rise from the stump he was sitting on. Mariana blushed to the roots of her hair, but instantly gave a contemptuous smile. It was difficult to say whether the smile was meant for herself, for having blushed, or for Nejdanov. Her companion scowled — a sinister gleam was seen in the yellowish whites of his troubled eyes. He exchanged glances with Mariana, and without saying a word they turned their backs on Nejdanov and walked away as slowly as they had come, while Nejdanov followed them with a look of amazement. Half an hour later he returned home to his room, and when, at the sound of the gong, he appeared in the drawing room, the dark-eyed stranger whom he had seen in the wood was already there. Sipiagin introduced Nejdanov to him as his beaufrere’a, Valentina Mihailovna’s brother — Sergai Mihailovitch Markelov. “I hope you will get to know each other and be friends, gentlemen,” Sipiagin exclaimed with the amiable, stately, though absent-minded smile characteristic of him. Markelov bowed silently; Nejdanov responded in a similar way, and Sipiagin, throwing back his head slightly and shrugging his shoulders, walked away, as much as to say, “I’ve brought you together, but whether you become friends or not is a matter of equal indifference to me! Valentina Mihailovna came up to the silent pair, standing motionless, and introduced them to each other over again; she then turned to her brother with that peculiarly bright, caressing expression which she seemed able to summon at will into her wonderful eyes. “Why, my dear Serge, you’ve quite forgotten us! You did not even come on Kolia’s name-day. Are you so very busy? My brother is making some sort of new arrangement with his peasants,” she remarked, turning to Nejdanov. “So very original — three parts of everything for them and one for himself; even then he thinks that he gets more than his share.” “My sister is fond of joking,” Markelov said to Nejdanov in his turn, “but I am prepared to agree with her; for one man to take a quarter of what belongs to a hundred, is certainly too much.” “Do you think that I am fond of joking, Alexai Dmitritch?” Madame Sipiagina asked with that same caressing softness in her voice and in her eyes. Nejdanov was at a loss for a reply, but just then Kollomietzev was announced. The hostess went to meet him, and a few moments later a servant appeared and announced in a sing-song voice that dinner was ready. At dinner Nejdanov could not keep his eyes off Mariana and Markelov. They sat side by side, both with downcast eyes, compressed lips, and an expression of gloomy severity on their angry faces. Nejdanov wondered how Markelov could possibly be Madame Sipiagina’s brother; they were so little like each other. There was only one point of resemblance between them, their dark complexions; but the even colour of Valentina Mihailovna’s face, arms, and shoulders constituted one of her charms, while in her brother it reached to that shade of swarthiness which polite people call “bronze,” but which to the Russian eye suggests a brown leather boot-leg. Markelov had curly hair, a somewhat hooked nose, thick lips, sunken cheeks, a narrow chest, and sinewy hands. He was dry and sinewy all over, and spoke in a curt, harsh, metallic voice. The sleepy look in his eyes, the gloomy expression, denoted a bilious temperament! He ate very little, amused himself by making bread pills, and every now and again would fix his eyes on Kollomietzev. The latter had just returned from town, where he had been to see the governor upon a rather unpleasant matter for himself, upon which he kept a tacit silence, but was very voluble about everything else. Sipiagin sat on him somewhat when he went a little too far, but laughed a good deal at his anecdotes and bon mots, although he thought qu’il est un affreux reactionnaire. Kollomietzev declared, among other things, how he went into raptures at what the peasants, oui, oui! les simples mougiks! call lawyers. “Liars! Liars!” he shouted with delight. “Ce peupie russe est delicieux!” He then went on to say how once, when going through a village school, he asked one of the children what a babugnia was, and nobody could tell him, not even the teacher himself. He then asked what a pithecus was, and no one knew even that, although he had quoted the poet Himnitz, ‘The weakwitted pithecus that mocks the other beasts.’ Such is the deplorable condition of our peasant schools! “But,” Valentina Mihailovna remarked, “I don’t know myself what are these animals!” “Madame!” Kollomietzev exclaimed, “there is no necessity for you to know!” “Then why should the peasants know?” “Because it is better for them to know about these animals than about Proudhon or Adam Smith!” Here Sipiagin again intervened, saying that Adam Smith was one of the leading lights in human thought, and that it would be well to imbibe his principles (he poured himself out a glass of wine) with the (he lifted the glass to his nose and sniffed at it) mother’s milk! He swallowed the wine. Kollomietzev also drank a glass and praised it highly. Markelov payed no special attention to Kollomietzev ‘s talk, but glanced interrogatively at Nejdanov once or twice; he flicked one of his little bread pills, which just missed the nose of the eloquent guest. Sipiagin left his brother-in-law in peace; neither did Valentina Mihailovna speak to him; it was evident that both husband and wife considered Markelov an eccentric sort of person whom it was better not to provoke. After dinner Markelov went into the billiard room to smoke a pipe, and Nejdanov withdrew into his own room. In the corridor he ran against Mariana. He wanted to slip past her, when she stopped him with a quick movement of the hand. “Mr. Nejdanov,” she said in a somewhat unsteady tone of voice, “it ought to be all the same to me what you think of me, but still I find it.. . I find it.. .” (she could not think of a fitting word) “I find it necessary to tell you that when you met me in the wood today with Mr. Markelov . . . you must no doubt have thought, when you saw us both confused, that we had come there by appointment.” “It did seem a little strange to me —” Nejdanov began. “Mr. Markelov,” Mariana interrupted him, “proposed to me . . . and I refused him. That is all I wanted to say to you. Goodnight. Think what you like of me.” She turned away and walked quickly down the corridor. Nejdanov entered his own room and sat down by the window musing. “What a strange girl — why this wild issue, this uninvited explanation? Is it a desire to be original, or simply affectation — or pride? Pride, no doubt. She can’t endure the idea . . . the faintest suspicion, that anyone should have a wrong opinion of her. What a strange girl!” Thus Nejdanov pondered, while he was being discussed on the terrace below; every word could be heard distinctly. I have a feeling,” Kollomietzev declared, “a feeling, that he’s a revolutionist. When I served on a special commission at the governor-general’s of Moscow avec Ladisias, I learned to scent these gentlemen as well as nonconformists. I believe in instinct above everything.” Here Kollomietzev related how he had once caught an old sectarian by the heel somewhere near Moscow, on whom he had looked in, accompanied by the police, and who nearly jumped out of his cottage window. “He was sitting quite quietly on his bench until that moment, the blackguard!” Kollomietzev forgot to add that this old man, when put into prison, refused to take any food and starved himself to death. “And your new tutor,” Kollomietzev went on zealously, “is a revolutionist, without a shadow of a doubt! Have you noticed that he is never the first to bow to anyone?” “Why should he?” Madame Sipiagina asked; “on the contrary, that is what I like about him.” “I am a guest in the house in which he serves,” Kollomietzev exclaimed, “yes, serves for money, comme un salarie. . . . Consequently I am his superior. . . . He ought to bow to me first.” “My dear Kollomietzev, you are very particular,” Sipiagin put in, laying special stress on the word dear. “I thought, if you’ll forgive my saying so, that we had outgrown all that. I pay for his services, his work, but he remains a free man.” “He does not feel the bridle, le frein! All these revolutionists are like that. I tell you I can smell them from afar! Only Ladisias can compare with me in this respect. If this tutor were to fall into my hands wouldn’t I give it to him! I would make him sing a very different tune! How he would begin touching his cap to me — it would be a pleasure to see him!” “Rubbish, you swaggering little braggart!” Nejdanov almost shouted from above, but at this moment the door opened and, to his great astonishment, Markelov entered the room.","sourceLink":"http://novel.tingroom.com/jingdian/1404/42056.html","bookId":1406,"book":{"id":1406,"title":"Virgin Soil","description":"简介： Sergeevich Turgenev was a major 19th century Russian novelist. His novel Fathers and Sons is his best-known work. The author has written a number of critical essays, plays, poems, and several novelettes. Virgin Soil is a classic of Russian literature...","cover":"http://novel.tingroom.com/file/upload/201510/20/07-55-17-47-1.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1404","creation":"Aug 1, 2019 12:25:02 AM","modification":"Aug 1, 2019 12:25:02 AM"}}
