{"id":27041,"no":4,"title":"chapter 3","content":"THE elegantly dressed man went up to Nejdanov with an amiable smile and began: “I have already had the pleasure of meeting you and even speaking to you, Mr. Nejdanov, the day before yesterday, if you remember, at the theatre.” (The visitor paused, as though waiting for Nejdanov to make some remark, but the latter merely bowed slightly and blushed.) “I have come to see you about your advertisement, which I noticed in the paper. I should like us to have a talk if your visitors would not mind. . .” (He bowed to Mashurina, and waved a grey-gloved hand in the direction of Paklin and Ostrodumov.) “Not at all,” Nejdanov replied awkwardly. “Won’t you sit down?” The visitor bowed from the waist, drew a chair to himself, but did not sit down, as every oneelse was standing. He merely gazed around the room with his bright though half-closed eyes. “Goodbye, Alexai Dmitritch,” Mashurina exclaimed suddenly. “I will come again presently.” “And I too,” Ostrodumov added. Mashurina did not take the slightest notice of the visitor as she passed him, but went straight up to Nejdanov, gave him a hearty shake of the hand, and left the room without bowing to anyone. Ostrodumov followed her, making an unnecessary noise with his boots, and snorting out once or twice contemptuously, “There’s a beaver collar for you!” The visitor accompanied them with a polite though slightly inquisitive look, and then directed his gaze to Paklin, hoping the latter would follow their example, but Paklin withdrew into a corner and settled down. A peculiarly suppressed smile played on his lips ever since the appearance of the stranger. The visitor and Nejdanov also sat down. “My name is Sipiagin. You may perhaps have heard of me,” the visitor began with modest pride. We must first relate how Nejdanov had met him at the theatre. There had been a performance of Ostrovsky’s play “Never Sit in Another Man’s Sledge”, on the occasion of the great actor Sadovsky’s coming from Moscow. Rusakov, one of the characters in the play, was known to be one of his favourite parts. Just before dinner on that day, Nejdanov went down to the theatre to book a ticket, but found a large crowd already waiting there. He walked up to the desk with the intention of getting a ticket for the pit, when an officer, who happened to be standing behind him, thrust a three-rouble note over Nejdanov’s head and called out to the man inside: “He” (meaning Nejdanov) “will probably want change. I don’t. Give me a ticket for the stalls, please. Make haste, I’m in a hurry!” “Excuse me, sir, I want a ticket for the stalls myself!Nejdanov exclaimed, throwing down a three-rouble note, all the ready money he possessed. He got his ticket, and in the evening appeared in the aristocratic part of the Alexandrinsky Theatre. He was badly dressed, without gloves and in dirty boots. He was uncomfortable and angry with himself for feeling uncomfortable. A general with numerous orders glittering on his breast sat on his right, and on his left this same elegant Sipiagin, whose appearance two days later at Nejdanov’s so astonished Mashurina and Ostrodumov. The general stared at Nejdanov every now and again, as though at something indecent, out of place, and offensive. Sipiagin looked at him sideways, but did not seem unfriendly. All the people surrounding him were evidently personages of some importance, and as they all knew one another, they kept exchanging remarks, exclamations, greetings, occasionally even over Nejdanov’s head. He sat there motionless and ill at ease in his spacious armchair, feeling like an outcast. Ostrovsky’s play and Sadovsky’s acting afforded him but little pleasure, and he felt bitter at heart. When suddenly, Oh wonder! During one of the intervals, his neighbour on the left, not the glittering general, but the other with no marks of distinction on his breast, addressed him politely and kindly, but somewhat timidly. He asked him what he thought of Ostrovsky’s play, wanted to know his opinion of it as a representative of the new generation. Nejdanov, overwhelmed and half frightened, his heart beating fast, answered at first curtly, in monosyllables, but soon began to be annoyed with his own excitement. “After all,” he thought, “ am I not a man like everybody else? “And began expressing his opinions quite freely, without any restraint. He got so carried away by his subject, and spoke so loudly, that he quite alarmed the order-bedecked general. Nejdanov was a strong admirer of Ostrovsky, but could not help feeling, in spite of the author’s great genius, his evident desire to throw a slur on modern civilisation in the burlesqued character of Veherov, in “Never Sit in Another Man’s Sledge”. His polite neighbour listened to him attentively, evidently interested in what he said. He spoke to him again in the next interval, not about the play this time, but about various matters of everyday life, about science, and even touched upon political questions. He was decidedly interested in his eloquent young companion. Nejdanov did not feel in the least constrained as before, but even began to assume airs, as if saying, “If you really want to know, I can satisfy your curiosity!” The general’s annoyance grew to indignation and even suspicion. After the play Sipiagin took leave of Nejdanov very courteously, but did not ask his name, neither did he tell him his own. While waiting for his carriage, he ran against a friend, a certain Prince G., an aide-de-camp. “I watched you from my box,” the latter remarked, through a perfumed moustache. “Do you know whom you were speaking to?” “No. Do you? A rather clever chap. Who is he?” The prince whispered in his ear in French. “He is my brother . . .. illegitimate. . . . His name is Nejdanov. I will tell you all about it someday. My father did not in the least expect that sort of thing, that was why he called him Nejdanov. [The unexpected.] But he looked after him all right. Il lui a fait un sort. We make him an allowance to live on. He is not stupid. Had quite a good education, thanks to my father. But he has gone quite off the track — I think he’s a republican. We refuse to have anything to do with him. Il est impossible. Goodbye, I see my carriage is waiting.” The prince separated. The next day Sipiagin noticed Nejdanov’s advertisement in the paper and went to see him. “My name is Sipiagin,” he repeated, as he sat in front of Nejdanov, surveying him with a dignified air. “I see by your advertisement that you are looking for a post, and I should like to know if you would be willing to come to me. I am married and have a boy of eight, a very intelligent child, I may say. We usually spend the summer and autumn in the country, in the province of S., about five miles from the town of that name. I should like you to come to us for the vacation to teach my boy Russian history and grammar. I think those were the subjects you mentioned in your advertisement. I think you will get on with us all right, and I am sure you will like the neighbourhood. We have a large house and garden, the air is excellent, and there is a river close by. Well, would you like to come? We shall only have to come to terms, although I do not think,” he added, with a slight grimace, “that there will be any difficulty on that point between us.” Nejdanov watched Sipiagin all the time he was speaking. He gazed at his small head, bent a little to one side, his low, narrow, but intelligent forehead, his fine Roman nose, pleasant eyes, straight lips, out of which his words flowed graciously; he gazed at his drooping whiskers, kept in the English fashion, gazed and wondered. “What does it all mean?” he asked himself. “Why has this man come to seek me out? This aristocrat and I! What have we in common? What does he see in me?” He was so lost in thought that he did not open his lips when Sipiagin, having finished speaking, evidently awaited an answer. Sipiagin cast a look into the corner where Paklin sat, also watching him. “Perhaps the presence of a third person prevents him from saying what he would like,” flashed across Sipiagin’s mind. He raised his eyebrows, as if in submission to the strangeness of the surroundings he had come to of his own accord, and repeated his question a second time. Nejdanov started. “Of course,” he began hurriedly, “I should like to . . . with pleasure . . . . only I must confess . . . I am rather surprised . . . having no recommendations . . . and the views I expressed at the theatre were more calculated to prejudice you —” “There you are quite mistaken Alexai — Alexai Dmitritch — have I got the name right?” Sipiagin asked with a smile. “I may venture to say that I am well known for my liberal and progressive opinions. On the contrary, what you said the other evening, with the exception perhaps of any youthful characteristics, which are always rather given to exaggeration, if you will excuse my saying so, I fully agreed with, and was even delighted with your enthusiasm.” Sipiagin spoke without the slightest hesitation, his words flowing from him as a stream. “My wife shares my way of thinking,” he continued. “her views are, if anything, more like yours than mine, which is not surprising, considering that she is younger than I am. When I read your name in the paper the day after our meeting — and by the way, you announced your name and address contrary to the usual custom — I was rather struck by the coincidence, having already heard it at the theatre. It seemed to me like the finger of fate. Excuse my being so superstitious. As for recommendations, I do not think they are necessary in this case. I, like you, am accustomed to trusting my intuition. May I hope that you will come?” “Yes, I will come,” Nejdanov replied, “and will try to be worthy of your confidence. But there is one thing I should like to mention. I could undertake to teach your boy, but am not prepared to look after him. I do not wish to undertake anything that would interfere with my freedom.” Sipiagin gave a slight wave of the hand, as if driving away a fly. “You may be easy on that point. You are not made that way. I only wanted a tutor, and I have found one. Well, now, how about terms? Financial terms, that is. Base metal!” Nejdanov did not know what to say. “I think,” Sipiagin went on, bending forward and touching Nejdanov with the tips of his fingers, “that decent people can settle such things in two words. I will give you a hundred roubles a month and all travelling expenses. Will you come? Nejdanov blushed. “That is more than I wanted to ask . . . because I—” “Well,” Sipiagin interrupted him, “I look upon the matter as settled, and consider you as a member of our household.” He rose from his chair, and became quite gay and expansive, as if he had just received a present. A certain amiable familiarity, verging on the playful, began to show itself in all his gestures. “ We shall set out in a day or two,” he went on, in an easy tone. “There is nothing I love better than meeting spring in the country, although I am a busy, prosaic sort of person, tied to town . . . I want you to count your first month as beginning from today. My wife and boy have already started, and are probably in Moscow by now. We shall find them in the lap of nature. We will go alone, like two bachelors, ha, ha!” Sipiagin laughed coquettishly, through his nose. “And now —” He took a black and silver pocketbook out of his overcoat pocket and pulled out a card. “This is my address. Come and see me tomorrow at about twelve o’clock. We can talk things over further. I should like to tell you a few of my views on education. We can also decide when to start.” Sipiagin took Nejdanov’s hand. “By the way,” he said, lowering his voice and bending his head a little to one side, “if you are in need of money, please do not stand on ceremony. I can let you have a month’s pay in advance.” Nejdanov was at a loss to know what to say. He gazed, with the same puzzled expression, at the kind, bright face, which was so strange yet so close to him, smiling encouragingly. “You are not in need of any?” Sipiagin asked in a whisper. “I will tell you tomorrow, if I may,” Nejdanov said at last. “Well, goodbye, then. Till tomorrow.” Sipiagin dropped Nejdanov’s hand and turned to go out. “I should like to know,” Nejdanov asked suddenly, “who told you my name? You said you heard it at the theatre.” “Someone who is very well known to you. A relative of yours, I think. Prince G.” “The aide-de-camp?” “Yes.” Nejdanov flushed even redder than before, but did not say anything. Sipiagin shook his hand again, without a word this time, then bowing first to him and then to Paklin, put on his hat at the door, and went out with a self-satisfied smile on his lips, denoting the deep impression the visit must have produced upon him.","sourceLink":"http://novel.tingroom.com/jingdian/1404/42050.html","bookId":1406,"book":{"id":1406,"title":"Virgin Soil","description":"简介： Sergeevich Turgenev was a major 19th century Russian novelist. His novel Fathers and Sons is his best-known work. The author has written a number of critical essays, plays, poems, and several novelettes. Virgin Soil is a classic of Russian literature...","cover":"http://novel.tingroom.com/file/upload/201510/20/07-55-17-47-1.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1404","creation":"Aug 1, 2019 12:25:02 AM","modification":"Aug 1, 2019 12:25:02 AM"}}
