{"id":95567,"no":2,"title":"Page 2","content":"\u0027About what? Dying?\u0027 NO, I SUPPOSE NOT. IT WOULD BE TOO MUCH TO EXPECT, said Death sourly. THEY LEAVE IT ALL TO ME. \u0027Who do?\u0027 said Verence, mystified. FATE. DESTINY. ALL THE REST OF THEM. Death laid a hand on the king\u0027s shoulder. THE FACT IS, I\u0027M AFRAID, YOU\u0027RE DUE TO BECOME A GHOST. \u0027Oh.\u0027 He looked down at his . . . body, which seemed solid enough. Then someone walked through him. DON\u0027T LET IT UPSET YOU. Verence watched his own stiff corpse being carried reverentially from the hall. \u0027I\u0027ll try,\u0027 he said. GOOD MAN. \u0027I don\u0027t think I will be up to all that business with the white sheets and the chains, though,\u0027 he said. \u0027Do I have to walk around moaning and screaming?\u0027 Death shrugged. DO YOU WANT TO? he said. \u0027No.\u0027 THEN I SHOULDN\u0027T BOTHER, IF I WERE YOU. Death pulled an hour-glass from the recesses of his dark robe and inspected it closely. AND NOW I REALLY MUST BE GOING, he said. He turned on his heel, put his scythe over his shoulder and started to walk out of the hall through the wall. \u0027I say? Just hold on there!\u0027 shouted Verence, running after him. Death didn\u0027t look back. Verence followed him through the wall; it was like walking through fog. \u0027Is that all?\u0027 he demanded. \u0027I mean, how long will I be a ghost? Why am I a ghost? You can\u0027t just leave me like this.\u0027 He halted and raised an imperious, slightly transparent finger. \u0027Stop! I command you!\u0027 Death shook his head gloomily, and stepped through the next wall. The king hurried after him with as much dignity as he could still muster, and found Death fiddling with the girths of a large white horse standing on the battlements. It was wearing a nosebag. \u0027You can\u0027t leave me like this!\u0027 he repeated, in the face of the evidence. Death turned to him. I CAN, he said. YOU\u0027RE UNDEAD, YOU SEE. GHOSTS INHABIT A WORLD BETWEEN THE LIVING AND THE DEAD. IT\u0027S NOT MY RESPONSIBILITY. He patted the king on the shoulder. DON\u0027T WORRY, he said, IT WON\u0027T BE FOREVER. \u0027Good.\u0027 IT MAY SEEM LIKE FOREVER. \u0027How long will it really be?\u0027 UNTIL YOU HAVE FULFILLED YOUR DESTINY, I ASSUME. \u0027And how will I know what my destiny is?\u0027 said the king, desperately. CAN\u0027T HELP THERE. I\u0027M SORRY. \u0027Well, how can I find out?\u0027 THESE THINGS GENERALLY BECOME APPARENT, I UNDERSTAND, said Death, and swung himself into the saddle. \u0027And until then I have to haunt this place.\u0027 King Verence stared around at the draughty battlements. \u0027All alone, I suppose. Won\u0027t anyone be able to see me?\u0027 OH, THE PSYCHICALLY INCLINED. CLOSE RELATIVES. AND CATS, OF COURSE. \u0027I hate cats.\u0027 Death\u0027s face became a little stiffer, if that were possible. The blue glow in his eye sockets flickered red for an instant. I SEE, he said. The tone suggested that death was too good for cat-haters. YOU LIKE GREAT BIG DOGS, I IMAGINE. \u0027As a matter of fact, I do.\u0027 The king stared gloomily at the dawn. His dogs. He\u0027d really miss his dogs. And it looked like such a good hunting day. He wondered if ghosts hunted. Almost certainly not, he imagined. Or ate, or drank either for that matter, and that was really depressing. He liked a big noisy banquet and had quaffed[1] many a pint of good ale. And bad ale, come to that. He\u0027d never been able to tell the difference till the following morning, usually. He kicked despondently at a stone, and noted gloomily that his foot went right through it. No hunting, drinking, carousing, no wassailing, no hawking . . . It was dawning on him that the pleasures of the flesh were pretty sparse without the flesh. Suddenly life wasn\u0027t worth living. The fact that he wasn\u0027t living it didn\u0027t cheer him up at all. SOME PEOPLE LIKE TO BE GHOSTS, said Death. \u0027Hmm?\u0027 said Verence, gloomily. IT\u0027S NOT SUCH A WRENCH, I ASSUME. THEY CAN SEE HOW THEIR DESCENDANTS GET ON. SORRY? IS SOMETHING THE MATTER? But Verence had vanished into the wall. DON\u0027T MIND ME, WILL YOU, said Death, peevishly. He looked around him with a gaze that could see through time and space and the souls of men, and noted a landslide in distant Klatch, a hurricane in Howandaland, a plague in Hergen. BUSY, BUSY, he muttered, and spurred his horse into the sky. Verence ran through the walls of his own castle. His feet barely touched the ground – in fact, the unevenness of the floor meant that at times they didn\u0027t touch the ground at all. As a king he was used to treating servants as if they were not there, and running through them as a ghost was almost the same. The only difference was that they didn\u0027t stand aside. Verence reached the nursery, saw the broken door, the trailed sheets . . . Heard the hoofbeats. He reached the window, saw his own horse go full tilt through the open gateway in the shafts of the coach. A few seconds later three horsemen followed it. The sound of hooves echoed for a moment on the cobbles and died away. The king thumped the sill, his fist going several inches into the stone. Then he pushed his way out into the air, disdaining to notice the drop, and half flew, half ran down across the courtyard and into the stables. It took him a mere twenty seconds to learn that, to the great many things a ghost cannot do, should be added the mounting of a horse. He did succeed in getting into the saddle, or at least in straddling the air just above it, but when the horse finally bolted, terrified beyond belief by the mysterious things happening behind its ears, Verence was left sitting astride five feet of fresh air. He tried to run, and got about as far as the gateway before the air around him thickened to the consistency of tar. \u0027You can\u0027t,\u0027 said a sad, old voice behind him. \u0027You have to stay where you were killed. That\u0027s what haunting means. Take it from me. I know.\u0027 Granny Weatherwax paused with a second scone halfway to her mouth. \u0027Something comes,\u0027 she said. \u0027Can you tell by the pricking of your thumbs?\u0027 said Magrat earnestly. Magrat had learned a lot about witchcraft from books. \u0027The pricking of my ears,\u0027 said Granny. She raised her eyebrows at Nanny Ogg. Old Goodie Whemper had been an excellent witch in her way, but far too fanciful. Too many flowers and romantic notions and such. The occasional flash of lightning showed the moorland stretching down to the forest, but the rain on the warm summer earth had filled the air with mist wraiths. \u0027Hoofbeats?\u0027 said Nanny Ogg. \u0027No-one would come up here this time of night.\u0027 Magrat peered around timidly. Here and there on the moor were huge standing stones, their origins lost in time, which were said to lead mobile and private lives of their own. She shivered. \u0027What\u0027s to be afraid of?\u0027 she managed. \u0027Us,\u0027 said Granny Weatherwax, smugly. The hoofbeats neared, slowed. And then the coach rattled between the furze bushes, its horses hanging in their harnesses. The driver leapt down, ran around to the door, pulled a large bundle from inside and dashed towards the trio. He was halfway across the damp peat when he stopped and stared at Granny Weatherwax with a look of horror. \u0027It\u0027s all right,\u0027 she whispered, and the whisper cut through the grumbling of the storm as clearly as a bell. She took a few steps forward and a convenient lightning flash allowed her to look directly into the man\u0027s eyes. They had the peculiarity of focus that told those who had the Know that he was no longer looking at anything in this world. With a final jerking movement he thrust the bundle into Granny\u0027s arms and toppled forward, the feathers of a crossbow bolt sticking out of his back. Three figures moved into the firelight. Granny looked up into another pair of eyes, which were as chilly as the slopes of Hell. Their owner threw his crossbow aside. There was a glimpse of chain mail under his sodden cloak as he drew his sword. He didn\u0027t flourish it. The eyes that didn\u0027t leave Granny\u0027s face weren\u0027t the eyes of one who bothers about flourishing things. They were the eyes of one who knows exactly what swords are for. He reached out his hand. \u0027You will give it to me,\u0027 he said. Granny twitched aside the blanket in her arms and looked down at a small face, wrapped in sleep. She looked up. \u0027No,\u0027 she said, on general principles. The soldier glanced from her to Magrat and Nanny Ogg, who were as still as the standing stones of the moor. \u0027You are witches?\u0027 he said. Granny nodded. Lightning skewered down from the sky and a bush a hundred yards away blossomed into fire. The two soldiers behind the man muttered something, but he smiled and raised a mailed hand. \u0027Does the skin of witches turn aside steel?\u0027 he said. \u0027Not that I\u0027m aware,\u0027 said Granny, levelly. \u0027You could give it a try.\u0027 One of the soldiers stepped forward and touched the man\u0027s arm gingerly. \u0027Sir, with respect, sir, it\u0027s not a good idea—\u0027 \u0027Be silent.\u0027 \u0027But it\u0027s terrible bad luck to—\u0027 \u0027Must I ask you again?\u0027 \u0027Sir,\u0027 said the man. His eyes caught Granny\u0027s for a moment, and reflected hopeless terror. The leader grinned at Granny, who hadn\u0027t moved a muscle. \u0027Your peasant magic is for fools, mother of the night. I can strike you down where you stand.\u0027 \u0027Then strike, man,\u0027 said Granny, looking over his shoulder. \u0027If your heart tells you, strike as hard as you dare.\u0027 The man raised his sword. Lightning speared down again and split a stone a few yards away, filling the air with smoke and the stink of burnt silicon. \u0027Missed,\u0027 he said smugly, and Granny saw his muscles tense as he prepared to bring the sword down. A look of extreme puzzlement crossed his face. He tilted his head sideways and opened his mouth, as if trying to come to terms with a new idea. His sword dropped out of his hand and landed point downwards in the peat. Then he gave a sigh and folded up, very gently, collapsing in a heap at Granny\u0027s feet. She gave him a gentle prod with her toe. \u0027Perhaps you weren\u0027t aware of what I was aiming at,\u0027 she whispered. \u0027Mother of the night, indeed!\u0027 The soldier who had tried to restrain the man stared in horror at the bloody dagger in his hand, and backed away. \u0027I-I-I couldn\u0027t let. He shouldn\u0027t of. It\u0027s – it\u0027s not right to,\u0027 he stuttered. \u0027Are you from around these parts, young man?\u0027 said Granny. He dropped to his knees. \u0027Mad Wolf, ma\u0027am,\u0027 he said. He stared back at the fallen captain. \u0027They\u0027ll kill me now!\u0027 he wailed. \u0027But you did what you thought was right,\u0027 said Granny. \u0027I didn\u0027t become a soldier for this. Not to go round killing people.\u0027 \u0027Exactly right. If I was you, I\u0027d become a sailor,\u0027 said Granny thoughtfully. \u0027Yes, a nautical career. I should start as soon as possible. Now, in fact. Run off, man. Run off to sea where there are no tracks. You will have a long and successful life, I promise.\u0027 She looked thoughtful for a moment, and added, \u0027At least, longer than it\u0027s likely to be if you hang around here.\u0027 He pulled himself upward, gave her a look compounded of gratitude and awe, and ran off into the mist. \u0027And now perhaps someone will tell us what this is all about?\u0027 said Granny, turning to the third man. To where the third man had been. There was the distant drumming of hooves on the turf, and then silence. Nanny Ogg hobbled forward. \u0027I could catch him,\u0027 she said. \u0027What do you think?\u0027 Granny shook her head. She sat down on a rock and looked at the child in her arms. It was a boy, no more than two years old, and quite naked under the blanket. She rocked him vaguely and stared at nothing. Nanny Ogg examined the two corpses with the air of one for whom laying-out holds no fears. \u0027Perhaps they were bandits,\u0027 said Magrat tremulously. Nanny shook her head. \u0027A strange thing,\u0027 she said. \u0027They both wear this same badge. Two bears on a black and gold shield. Anyone know what that means?\u0027","sourceLink":"https://allnovel.net/wyrd-sisters-discworld-6/page-2.html","bookId":1625,"book":{"id":1625,"title":"Wyrd Sisters (Discworld #6)","description":"Storyline: Wyrd Sisters (Discworld #6) Witches are not by nature gregarious, and they certainly don\u0027t have leaders. Granny Weatherwax was the most highly-regarded of the leaders they didn\u0027t have. But even she found that meddling in royal politics was a lot more difficult than certain playwrights would have you believe...","cover":"https://allnovel.net/images/wyrd-sisters-discworld-6.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/wyrd-sisters-discworld-6.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:14:55 PM"}}
