{"id":104996,"no":63,"title":"Page 63","content":"\n I stumbled out onto the wreckage and John emerged behind me. He stared down at the hole we had come from, confused, and then closed the door I had thrown open. I saw that the door and its frame were in fact laying loose on the ground, flung aside when the blast destroyed the wall. When John picked up the door again, underneath was just dead grass.\n John said, “Shit, I left my shotgun shells back at the Caddie.”\n I took a breath and said, “Look … you remember when we watched Star Wars with Amy? And she’s like, ‘Why is Princess Leia being such a bitch when those guys just rescued her?’ Well I don’t want to be the Leia in this situation and I completely appreciate what a sweet ramp job that was back there. But did you have any kind of a plan at all?”\n “I’m working on it.”\n “Because time is running out here…”\n John was looking up at the old building, staring hard at the mossy brick walls.\n I said, “What?”\n “I took some Soy Sauce earlier.”\n “You did?”\n “Yeah. And I came by here.”\n “Okay…”\n “And … there were shadows here.”\n I followed his gaze. The rows of windows in the moldy brick were boarded over with ancient, warped plywood. It kind of made it seem like the building had cataracts. I saw no shadow people.\n I said, “Do you see any now?”\n “No.”\n He turned and saw something else, though, and said, “Here,” handing me the green mystery box. He jogged away from me, heading for the corner of the building. I spotted the ass of an RV parked there. I followed him. Faint shouts from the armed mob were growing louder.\n “John! What are you—”\n My words died at the sight of bloodstained grass surrounding the loose earth of a huge, freshly filled-in hole. Like a mass grave. John pulled out his ridiculous customized shotgun (he had it wedged down the back of his pants) and ducked into the RV. The windshield was busted out and when I followed John through the driver’s-side door, I saw that the tan upholstery of the driver’s seat was one big bloodstain.\n Christ.\n Leading with the shotgun, John quickly searched the inside. There were rows of hooks on the opposite wall that it took me a moment to realize were gun racks, all of which were now empty. John started throwing open foot lockers and found them stocked with at least four different types of ammunition.\n “Bingo,” he said, stuffing his pockets with shotgun shells. “See? Things have a way of working out. We needed shells, and here they are.”\n I looked around. On the floor was a busted laptop computer. At the very back, the floor was damp and it smelled like piss. There didn’t seem to be anything of use here other than the bullets—\n I froze.\n “Oh, no. Oh, fuck no. No, no, no…”\n John joined me and said, “What? I think these were…” but his words trailed off. He saw what I saw.\n Two objects, that a man in denial could have dismissed as meaningless: a mostly empty tub of red licorice, and an orthopedic pillow designed for people with back problems.\n Amy.\n It really only told me what I already knew. She’d come for me, because that’s who she was, and she’d find a way in, because she was too capable not to.\n John glanced nervously out of a side window. The mob would wash in at any moment. He was saying, “Okay, we don’t know this was hers. And even if it was, we do know that isn’t her blood in the driver’s seat. Amy can’t drive…” but I was already jumping out of the RV. Outside, I immediately I saw another, smaller bloodstain, this one in the grass in front of an open basement window. Laying in it was a single empty shoe. A man’s.\n I said, “Amy got somebody to give her a ride in. So they pulled up, something nasty came flying out of that window down there, and they killed the shit out of it. Look—next to the window. Spent shotgun shell. Maybe it got the driver first. Then the rest of the posse in the RV, and Amy if she was with them, they bail out and go inside. Probably in there right now. Then a hobo came along and pissed in the RV.”\n “Dave, why would they—”\n Ignoring him, I leaned my head down toward the basement window and yelled, “AMY! HEY! AMY? IT’S DAVE.” Nothing. “ANYBODY? IS THERE ANYBODY IN THERE?”\n A shot was fired. A bullet took a chip out of the wall. We ducked and John grabbed my sleeve, yanking me around the corner, toward the front door. Neither one of us had to debate the merits of getting down and crawling through that basement window. That violated two rules of living in Undisclosed: 1) never put yourself in a spot where you don’t have an open, and fast, means of escape, and 2) don’t go through any entrance that has a huge goddamned bloodstain in front of it.\n We reached the front door and John said, “Plug your ears.” He pointed the shotgun at the locks on the front door and blew a grapefruit-sized hole in the wood. We pushed our way inside.\n 105 Minutes Until the Aerial Bombing of Undisclosed\n It appeared the feds left behind anything that would take more than five minutes to load onto a truck. Boxes of medical supplies and biohazard suits and filters for biohazard suits and every other thing lined the main hallway, abandoned in the evacuation. Halogen work lamps were set up on stands here and there, a few of them still on, blasting bluish beams through the shadows of the huge corpse of a building. We pushed the front door closed and dragged a huge metal cabinet in front of it.\n Out of breath, I said, “We could have relocked that door but somebody blew a hole in it.”\n “I’m sorry, princess.”\n “And by the way, those shotgun shells in the RV? They weren’t there waiting for us because a guardian angel dropped them from the sky because you needed help. They were there because somebody else, somebody who believed in being prepared, paid for them with their own money. Keep that in mind the next time you get yourself in a bind and somebody is there for you with bail money or a sofa to sleep on. It isn’t providence. It’s generous people who work hard jobs to buy things you can take.”\n We were jogging down a main hallway now, heading deeper into the building. John said, “Search one of these crates. See if you can find some fucking antidepressants.”\n “All right, all right—”\n “Seriously, it’s an emergency. I’ll cram them down the barrel of the gun and blow them right into your brain.”\n We moved in silence for a moment and I said, “How did we screw this all up so badly, John?”\n He shook his head. “We always find a way.”\n We had to stop to climb over a knocked-over pile of plastic storage bins in the hall. I said, “Damn, the feds left in a hurry. They got overrun? By infected?”\n “Not exactly. I told you Falconer had to spring me out of here, we had to blow a huge hole in the wall to do it. They had us in like a big gymnasium and we saw a couple of liquid oxygen tanks along the wall and we’re like, ‘Let’s blow that shit up and get the hell out of here.’ It worked but I guess in the confusion a bunch of the infected they were holding here got loose and they decided to just leave town and let the situation sort itself out.”\n “Wait, you’re the reason the feds abandoned ship? Jesus, John.”\n “Well I feel like it’s their fault for trying to hold me. They should have known that shit comes with consequences.”\n John clicked three shells into his ridiculous tri-barreled shotgun, glancing nervously back toward the front doors. Nobody came crashing through. Wait, was the armed, angry mob scared to come in here? That couldn’t be a good fucking sign.\n “AMY? ANYBODY?”\n Echoes bounced off moldy walls. The building seemed five times bigger on the inside. It had the tangled floor plan common to all hospitals, seemingly designed by someone who believed in the healing power of watching confused visitors aimlessly wander around hallways. It didn’t help that all signage in the place had faded, or been stolen, or painted over with graffiti. We came to a “T” in the hall.\n I said, “Which way?”\n “When I was here earlier I—HEY!”\n John took off running to his right. I followed, the heavy green mystery box banging off my legs as I ran. I considered dropping the stupid thing.\n “What? What did you see? John!”\n We skidded to a stop at the end of the hall.\n “I saw somebody.”\n “Was it a … person?”\n He shook his head, in a way that meant he didn’t know.\n “Are you sure you saw them?”\n “Is that an elevator?” It was. Down at the end of the hall. The doors were closed. “Probably no power to it though, right?”\n I said, “I think you might be wrong. I rode in it. They had me down in the basement for a while.”\n “They did? You didn’t tell me that. What’s down there? Surely nothing worth complaining about, or else you would have brought it up by now.”\n “Don’t know. They had me knocked out the whole time and then put a bag on my head when they hauled me out to go to quarantine. I don’t want to shake your faith in government but I’m thinking this REPER is kind of a shady operation. Find the stairs.”\n There was no need to debate getting on the elevator, thanks to rule number one I mentioned just a moment ago. You get on one of those things, and you’re sealed up and somebody else is controlling where you go. All of these rules were learned from terrible experience.\n John said, “Boom. Stairs. Right over there.”\n We jogged toward the stairwell door and at the exact moment John’s hand grabbed the handle, the elevator dinged behind us. We heard the doors slide open.\n From behind us, a tiny voice said, “Walt?”\n 90 Minutes Until the Aerial Bombing of Undisclosed\n I very nearly pissed my pants. John saw the look on my face and spun around with the shotgun. He led the way, and we inched toward the now-open elevator. Inside was a little girl. Long, black, straight hair. She wore a filthy nightgown. \n","sourceLink":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2/page-63.html","bookId":2488,"book":{"id":2488,"title":"This Book Is Full of Spiders (John Dies at the End #2)","description":"Storyline: \n This Book Is Full of Spiders: Seriously, Dude, Don\u0027t Touch It (John Dies at the End #2) \n You will dismiss this as ridiculous fearmongering. Dismissing things as ridiculous fearmongering is, in fact, the first symptom of parasitic spider infection-the creature secretes a chemical into the brain to stimulate skepticism, in order to prevent you from seeking a cure. That\u0027s just as well, since the \"cure\" involves learning what a chain saw tastes like. \n You can\u0027t feel the spider, because it controls your nerve endings. You can\u0027t see it, because it decides what you see. You won\u0027t even feel it when it breeds. And it will breed. So what happens when your family, friends, and neighbors get mind-controlling skull spiders? We\u0027re all about to find out. \n Just stay calm, and remember that telling you about the spider situation is not the same as having caused it. I\u0027m just the messenger. Even if I did sort of cause it. \n Either way, I won\u0027t hold it against you if you\u0027re upset. I know that\u0027s just the spider talking.\n \n","cover":"https://allnovel.net/images/this-book-is-full-of-spiders-john-dies-at-the-end-2.jpg","author":"David Wong","type":"Humorous","source":"allnovel","link":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:38:27 PM"}}
