{"id":105002,"no":69,"title":"Page 69","content":"\n We flew through the smashed doorway, emerging onto a sidewalk downtown. Rain hammered the street, soaking our clothes. Two seconds later the buffalo blew through the door behind us, tearing off another foot of door frame on every side.\n We ran across the four lanes of street, looking for cover or, better yet, a door. I turned to Amy and screamed, “HERE! GIVE IT TO ME!”\n I took the furgun. I squeezed the trigger, and for a second, nothing happened. The beast charged, hoofs drumming across pavement. Then, out of nowhere, the buffalo was hit by a semi. The truck splattered buffalo guts thirty feet in every direction as it plowed through the screaming beast. It finally skidded to a stop, scraping a half ton of buffalo meat along the pavement and leaving a crimson skid mark of blood and entrails that stretched for a block and a half.\n We all stood and looked at this with disgust for a moment.\n Amy said, “Gross.”\n John said, “Over here!”\n He was running into the alley, toward a Dumpster. He stood up on a crate, took a moment to gather his energies, and threw open the lid.\n “BOOM! That’s it! I see water tower, bitches!”\n John climbed in. I helped Amy up next.\n I stepped up on the crate and looked down. I saw it. That is, instead of garbage, I saw open landscape. Patches of wet, green grass and mud puddles. It was dizzying, looking down and seeing the horizon at my feet. Rain was falling on the back of my neck, and falling perpendicular to that inside the universe of the Dumpster.\n I threw my legs over and stepped through, and felt that roller coaster flutter in my guts as gravity changed and—\n I stumbled forward as the ground rushed up at me, smacking my palms. I was suddenly on my hands and knees in mud, cold rain pounding down my back. I got to my feet, soaked from head to toe, mud caked on my knees and shoes. I squinted through the pouring rain. Thunder rumbled overhead.\n The water tower was right in front of me. I looked around for the truck John described, and found it. A big, black semi tractor trailer. Next to it was a black military troop transport. Next to it was a black Humvee. Next to it was another. Then about three dozen more.\n John said, “Ooooh, shit.”\n The water tower construction project was now the home to the makeshift REPER command center. Black military vehicles and mobile homes and tents stretched out as far as we could see. And, standing around us, were dozens and dozens of guys in black space suits, carrying assault rifles. All of them were currently screaming at us to drop our weapons and lay flat on the ground.\n A man strode up in a white space suit, carrying a helmet under one arm. His gray hair was still somehow perfectly combed even under the bombardment of the rain.\n Dr. Tennet glanced at his watch and said, “I was starting to think you wouldn’t make it.”\n 37 Minutes Until the Aerial Bombing of Undisclosed\n We were hauled under a tent, an open one like you’d see at a county fair. There were two long folding tables and along the back of the tent, just outside of the rain, were a series of carts holding stainless-steel canisters.\n There were two spacemen right behind us, holding some kind of weapons on us that I didn’t recognize. They were bulky and ended in some kind of slanted lens thing. I kind of wanted to get shot with one just to see what it did. Then, fifty feet or so outside the tent, were a dozen gunmen with regular old military-grade assault rifles. I was one hundred percent sure that their instructions were that if we overpowered the two guards next to us, they were to turn everything—including the guards—into the finale of Bonnie and Clyde.\n Tennet strode up from behind us, and handed Amy a towel. Not sure why John and I didn’t get one.\n Tennet said, “I have good news and bad news. The good news is that we are, of course, outside of the blast radius—though close enough that the noise will be very, very loud—unless someone at the Air Combat Command has made a grievous error in their calculations. A series of twenty-five thousand bombs will be dropped from the back of C-130 aircraft, starting from the center of town outward, in a series of concentric circles. The shock wave from each bomb can shatter ten city blocks, and liquefy any organism standing within a thousand feet in any direction. Once all of the structures have been blown into kindling, a second squadron of B-52 bombers will drop a series of thousand-pound CBU-97 incendiary cluster munitions, releasing a flammable aerosol that will ignite and raise the temperature at the center of town to a temperature hotter than the surface of the sun. The resulting conflagration will inhale so much surrounding oxygen that from here, we’ll feel like we’re in a monsoon—winds will reach fifty miles an hour. I’m told the noise of all the air rushing to feed the massive open-air furnace sounds like the world itself is howling in anguish. It should really be something.”\n John said, “And let me guess: you’re going to jerk off while you’re watching it. And you’re going to make us watch you.”\n Amy was actually using the towel to dry her hair, and I felt like she should have just left it wet out of solidarity.\n Ignoring John, Tennet said, “That’s the good news. The bad news is that you are of course being charged for this session.”\n He went back to the row of steel canisters and examined them. “I kid, of course.”\n I said, “So how do you get into the supervillain business, anyway? Is it something that happens gradually or do you just wake up and decide to go for it?”\n Tennet said, “I’m going to let you in on a little secret, and I apologize ahead of time because learning this will mark the end of your extended childhood. Nobody involved in a conflict thinks they’re the villain. And considering I’m on the verge of saving a couple of billion lives, I’m thinking I deserve hero status on this one. Even if you’re too shortsighted to understand.”\n I said, “Uh huh. So who is the bad guy, then?”\n “Everyone, depending on the day. In this case, I don’t know who is responsible for the parasite. That is, I don’t know their names. This is what you can’t—or aren’t willing to—understand. You found a cockroach in your hamburger. You want a two-word answer to the question of who put it there. Well, it’s not that simple. Was it the kid working the grill, who didn’t check the beef? Was it the franchise owner for buying beef from a shady supplier? Was it the slaughterhouse, for failing to adhere to contamination standards? Was it the government, for not funding FDA enforcement of those standards? Or was it you, the customer, for demanding lower taxes that resulted in that funding being cut, and for participating in a consumer culture that rewards cutting corners? Well, in that scenario, think of me as the harried assistant manager who has to apologize to the unhappy customer and try to keep the restaurant from getting shut down. Only here the ‘restaurant’ is all of civilization.”\n I said, “Okay, I’m … wait, what does the hamburger represent again?”\n “My point is, I have a job, just like you. I get a paycheck, I get memos. Just like you, I have superiors, and they have superiors who I am not allowed to speak to. Orders filter down from on high, arriving at my level stripped entirely of all context or rationale or justification. Orders do not come with an illustration of how they serve the overall goals of the organization. Same as any other job. Was the parasite released intentionally? And if so, for what purpose? It is not my job to know. All I know is that it is a near certainty that if it gets out, it will destabilize civilization as we know it. I have worked nonstop since the outbreak to contain this in a way that would let the world move on. And, I’m proud to say, I’m on the verge of succeeding.”\n Amy said, “By killing everyone.”\n “No. Not everyone. One medium-sized town. Some perspective helps here. Globally, a hundred and fifty thousand people die every day. From natural causes, accidents, war. The population of this town will be barely a blip in the worldwide dying that happens in an average month. So while you think you’re being heroic in saving it, you are, right now, in this situation, the villains. I know you don’t think you are. But you are.”\n I said, “Then why are you the one giving the supervillain monologue?”\n He walked back to the silver canisters. He put his back to us and started messing with some mechanism in whatever mad scientist setup he had back there. I heard liquid running. We were not restrained in our chairs, but there were so many guns on us that if I scratched my nose, the shooting aftermath would look like somebody had just spilled a huge lasagna here. I looked at Amy, who was impassive, and then at John, who looked like he was mentally running through escape options just like I was. The furgun was still laying in the grass where we had landed when we arrived. They probably thought it was a hairbrush. I pictured John trying to wrestle away one of those futuristic-lens guns the two guards behind us were carrying. Then I pictured him squeezing the trigger and a cartoon boxing glove popping out of the end.\n I watched Tennet work fluids from his steel canisters and wondered if we weren’t choosing between quick death under a hail of bullets, or something much, much worse caused by whatever he was brewing up there. He turned back to us, striding calmly our way. He placed three small Styrofoam cups in front of us.\n “We have sugar over there, but I’m afraid we’re out of creamer.”\n Coffee. I left mine in front of me. Amy, without asking, had been given a cup of hot water and a tea bag. She dropped in the tea bag and asked Tennet if he had any honey.\n She is terrible at this.\n Tennet walked back to the coffee carts and returned with a container of honey shaped like a bear.\n He said, “Think. Who allowed the outbreak to occur? Who failed to report the appearance of the parasite to any authorities? Who prevented any containment at your house? Who created the breach at the REPER command center? Who created the breach in the quarantine containment fence? Who has single-handedly spread this infection?”\n John said, “We didn’t do any of it on purpose. We’re just … not very good at things.”\n “Or, it could be that just maybe, one can act on what one believes is his own agency, while in reality perfectly serving the purposes of another.” \n","sourceLink":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2/page-69.html","bookId":2488,"book":{"id":2488,"title":"This Book Is Full of Spiders (John Dies at the End #2)","description":"Storyline: \n This Book Is Full of Spiders: Seriously, Dude, Don\u0027t Touch It (John Dies at the End #2) \n You will dismiss this as ridiculous fearmongering. Dismissing things as ridiculous fearmongering is, in fact, the first symptom of parasitic spider infection-the creature secretes a chemical into the brain to stimulate skepticism, in order to prevent you from seeking a cure. That\u0027s just as well, since the \"cure\" involves learning what a chain saw tastes like. \n You can\u0027t feel the spider, because it controls your nerve endings. You can\u0027t see it, because it decides what you see. You won\u0027t even feel it when it breeds. And it will breed. So what happens when your family, friends, and neighbors get mind-controlling skull spiders? We\u0027re all about to find out. \n Just stay calm, and remember that telling you about the spider situation is not the same as having caused it. I\u0027m just the messenger. Even if I did sort of cause it. \n Either way, I won\u0027t hold it against you if you\u0027re upset. I know that\u0027s just the spider talking.\n \n","cover":"https://allnovel.net/images/this-book-is-full-of-spiders-john-dies-at-the-end-2.jpg","author":"David Wong","type":"Humorous","source":"allnovel","link":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:38:27 PM"}}
