{"id":40567,"no":18,"title":"CHAPTER XVIII DUNSTER","content":"The approach to Dunster from Blue Anchor, and through the village of Carhampton, is a progress of pleasure. Turner has left a picture of Dunster from Blue Anchor, but it is not one of his successes, and the reality is far more romantic than his representation. You see before you the Castle of Dunster, on its hill, the eighteenth-century tower of Coneygore, on its own particular eminence, and the great Grabbist Hill, disposing themselves in new groupings as you advance, and realise that England has not much finer to give. Dunster, with much else in these districts, from Kilve to Minehead, belongs to the Luttrells, whose heraldic shield of a bend sable on a golden field, between six martlets—a “martlet” being a heraldic bird of the swallow species, without feet, unknown to ornithologists—is in consequence frequently to be noticed here. The Luttrell motto is Quaesita marte tuenda arte; that is to say, “What has been gained by force of war should by skill be guarded.” We may here perhaps detect the glimmerings of one of those puns of which the old heralds were so fond, in the similarity in sound 207between “marte” and “martlet”; but it is not a favourable example. CONEYGORE TOWER, AND ROAD INTO MINEHEAD. By what feat of arms, then, the traveller naturally enquires, did the Luttrells obtain these lands? By none at all, for, as a matter of fact, they came to the family by purchase, and when the heirs of the vendor sought to prove the sale illegal, it was by an action in a court of law, rather than by gage of battle, that they retained what they had bought. But it is well known that the family now owning the Luttrell lands are only Luttrells on the female side, and bear the name merely by adoption; Henry Fownes having in 2081746 married Margaret Luttrell, heiress-general of these manors. The history of Dunster begins with an entry in Domesday Book. There we learn that “Torre,” as it is styled, was owned by a certain Aluric. Perhaps it were best to style that Saxon landowner uncertain Aluric, for that is all we hear of him. A mere mention by name in Domesday Book is, after all, no great thing. Thereafter it became chief among the properties of William de Mohun, from Moyun in Normandy, one of the Conqueror’s liegemen in the red field of Hastings. The author of the “Roman de Rou” speaks of him as: Le viel Guillaume de Moion Ont avec li maint compagnon. He was not, however, so elderly a warrior, but is thus described in order to distinguish him from his son. He became a very landed man in the West, with sixty-seven other far-flung manors in Somerset, Dorset, Wiltshire, and Devonshire, including that of Tor Mohun, Torquay. But he established his headquarters here, and here he built the first castle of Torre, which soon afterwards is found referred to for the first time as “Dunestora,” in the deed by which he, in 1100, gave the advowson of St. George’s, Dunster, the fisheries of Dunster and Carhampton, the village of Alcombe, and the tenth part of his vineyards, ploughlands, markets, and flocks to the monks of St. Peter’s Abbey at Bath. 209William de Mohun the Second, son of this well-rewarded henchman of the Conqueror, played a turbulent part in the troubles that beset England during the war between Stephen and Queen Maud. He fought on behalf of Queen Maud; and the Gesta Stephani, which gives an account of these things from the point of view of King Stephen’s adherents, does not fail to draw a highly unflattering portrait of him, in which he appears established, like some robber baron, at Dunster Castle, with a strong force of horse and foot; issuing therefrom to devastate the surrounding country; “sweeping it as with a whirlwind.” The historian of these things proceeds to tell us that he was cruel and violent, firing the homes and pillaging the goods of the community indiscriminately. He appears, indeed, to have been one of those restless men of war, not uncommon in that era, who wanted trouble for its own sake, and when it came, cared little whether it was the property of friends or foes that he destroyed. “He changed a realm of peace and quiet, of joy and merriment, into a scene of strife, rebellion weeping, and lamentation,” says the chronicler. Queen Maud, on whose behalf he wrought so busily and with such devastation, created him—or he styled himself—“Earl of Somerset.” The historian continues: “When these things were after a time reported to the King, he collected his adherents in great numbers and proceeded by forced marches, in order to check the ferocity of William. But 210when he halted before the entrance to the Castle, and saw the impregnable defences of the place, inaccessible on one side where it was washed by the sea, and very strongly fortified on the other by towers and walls, by a ditch, and outworks, he altogether despaired of pressing on the siege, and, taking wiser counsel, he surrounded the Castle in full sight of the enemy, so that he might the better restrain them, and occupy the neighbouring country in security. He also gave orders to Henry de Tracy, a man skilled in war, and approved in the events of many different fights, that, acting in his stead, as he himself was summoned to other business, he should with all speed and vigour bestir himself against the enemy.” Henry accordingly, sallying forth from his own town of Barnstaple, so wrought with William de Mohun and his garrison that, if indeed he could not storm the castle, he could at any rate, coop within it that bold and fiery spirit, and so protect the neighbouring country. Tracy, in fact, did more. He captured a hundred and four horsemen in a single encounter, during one of those sallies from the castle by which de Mohun thought to break the force of the leaguer against him. DUNSTER CASTLE. And so the claws of this tiger were cut, and himself rendered harmless until that time when the factious, assured at last that they were too well matched ever to bring the struggle to a decisive issue, made peace, and thus sent the unruly and restless back to an undesired state of order. 211We read incidentally, in those old accounts, of Dunster Castle being washed on one side by the sea. That passage places in a yet more picturesque setting the picturesque scene even now presented to the traveller; for where the road now goes past the level meadows on the way from Carhampton to Minehead, the sea then ebbed and flowed in a shallow bay, whose shores reached to the foot of the commanding hill on whose crest the castle turrets still loom up, majestically. Yet, beautiful in its wild original way though it may have been in those days, when the castle was a sea-fortress and the little town of Dunster something in the nature of a port, Dunster Castle in our own times, and on some evening of late summer, when the sun sets gloriously over the hills and irradiates the burnt-up grass to a golden tinge, affords a picture of surpassing beauty, viewed from the road to Minehead, across those level pastures. The de Mohuns who succeeded the turbulent William of King Stephen’s time make little show in the history of the place, and even that mid-fourteenth century John, Lord Mohun of Dunster, who was one of the original Knights of the Garter, is more notable to us for the doings of his wife, than for any action of his own. He married in 1350 Joan, daughter of Sir Bartholomew de Burghershe. This lady it was who, according to a legend, declared by serious antiquaries to have no real foundation, obtained from her husband the grant of as much common-land for the poor 212of the town as she could walk barefoot: after the fashion of that Lady Tichborne who, although an invalid, crawled on hands and knees over an amazing acreage in one day. With this Lord Mohun, the de Mohuns of Dunster came to an end, and the West of England presently witnessed the entire extinction of the family, root and branch; or its gradual decline into obscurity through the growing poverty of landless collaterals who became absorbed by the middle-class, and survive here and there to this day as shopkeepers, and even as agricultural labourers, under the plebeian name of “Moon.” As more peaceful and commercial times succeeded the era in which arms decided the fate of noble families, the fortunes of those who by any chance had lost their lands grew desperate. In the altered circumstances, when law and order had replaced brute force, the sharp sword was no longer a match for sharp wits. Hence the great rise in the fifteenth and sixteenth centuries of the trading class, to wealth, power, and honours. But it was not precisely in this manner that the de Mohuns became alienated from the land. That John Lord Mohun of Dunster, who in 1350 married Joan Burghershe, had three daughters, but no sons. A courtier during the greater part of his career, he fell into the extravagant ways of those with whom he associated, and lived and died heavily in debt, and his widow, doubtless in want of ready money, sold Dunster to Lady Elizabeth Luttrell, née Courtenay, widow of Sir Andrew 213Luttrell, of Chilton, Devon, for the sum of five hundred marks, equal to ￡3333 6s. 8d., present value. The receipt given for this purchase-money is still a curious and cherished possession of the Luttrells of to-day. The low price at which Lady Mohun disposed of the property is accounted for by the fact that the purchaser was not to come into possession until after the vendor’s death, which did not occur until 1404, thirty years after the date of this transaction. Lady Joan retired from the West when this sale was completed, and was much at Court, and in Kent and Sussex in those thirty years. The curious may find her tomb in the undercroft of Canterbury Cathedral, and may with some difficulty read there the invocation to the piety of the beholder: “Pour Dieu priez por l’ame Johane Burwasche qe fut Dame de Mohun.” Two of her daughters survived her: Elizabeth Countess of Salisbury, and Philippa, married thirdly to Edward Plantagenet, Duke of York. To her daughter Elizabeth she left a cross, which she had promised to the one she loved best, and a copy of the Legenda Sanctorum. Philippa had merely her blessing, and some choice red wine; but her husband, the Duke of York, became the happy recipient, by bequest of his mother-in-law, of some improving literature, in the shape of a copy of the Legenda, and an illuminated book. Lady Elizabeth Luttrell, the purchaser of Dunster, did not live to enjoy the property. She predeceased Lady Mohun, and the reversion 214went to her son, Sir Hugh Luttrell, a distinguished soldier, Lieutenant of Calais, Governor of Harfleur, Seneschal of Normandy, and, holder of many other distinguished posts, much abroad on the King’s service all his life. It was one thing to become legal owner of Dunster, and quite another to obtain actual possession, for the daughters of Lady Joan refused to give up the property, on the ground that Lady Mohun had no right to dispose of it; and law-suits resulted, in which Sir Hugh was at length victorious. It was during his lifetime that the castle, by now grown ancient, was rebuilt under the supervision of his son, John, who occupied Dunster during his father’s long residence abroad. The Luttrells took the Lancastrian side in the quarrels of Red Rose and White, and suffered severely for that partisanship; Sir James, who had been knighted for valour at the bloody battle of Wakefield, being mortally wounded at the battle of Barnet, 1471, and his property forfeited to the victorious Yorkists, who granted the Luttrell acres to the Earls of Pembroke. After the battle of Bosworth, however, fourteen years later, they obtained their own again, and held it uneventfully until the beginning of hostilities between Cavaliers and Roundheads, in 1642. Mr. George Luttrell, the then owner, garrisoned Dunster Castle for the Parliamentary party, and held it for a time successfully against the Marquess of Hertford, the Royalist commander in these parts, established at Minehead, who was satisfied, in view of the 215formidable front made by this hilltop stronghold, in merely keeping a watch upon it, and preventing any offensive movement on the part of the garrison: thus—to use a modern military expression—“containing” the enemy. Luttrell, for his part, was satisfied at keeping the Royalists thus inactive and useless for offence elsewhere; each side thus “containing” the other: a not very stirring method of warfare. In the following year, in consequence of the sequence of Royalist successes in the West, Mr. Luttrell surrendered the castle, which was then held for three years for the King by Colonel Francis Windham. It was at this period that Prince Charles, afterwards Charles the Second, stayed here. The bedroom he then occupied is still known as “Prince Charles’s.” In those years the fortunes of the King declined, and rapidly grew desperate; until at last Dunster Castle became the sole outpost of the cause in Somerset. Finally, in 1645, it was resolved to reduce this remnant, and in November of that year a force was despatched from Taunton to besiege the Castle. The investing force was commanded by Blake, great on sea and on land, and by Sydenham, and a lengthy and stirring siege began. Both sides worked vigorously. Attack and defence proceeded on engineering lines; Blake’s men advancing cautiously by trenches, mines, and batteries; the defenders pushing forth to meet them by the same mole-like methods. On February 5th, 1646, in midst of these laborious operations, when the garrison 216had come near to being starved out, a column under Lord Hopton relieved them, and Blake’s men were forced to retire from beneath the walls. He kept watch, however, upon Dunster, and in the meanwhile received reinforcements. At length, on April 19th, the sturdy Windham, convinced that, the King having lost everywhere else in the West, it would be futile to hold this one remaining post, surrendered. The victorious Parliament, careful to destroy those places that had held out against it, duly ordered the Castle of Dunster to be “slighted,” otherwise to be blown up; but the order was not enforced, probably for the sufficient reason that the Luttrells, as we have seen, were themselves partisans of the popular party. The Parliament found Dunster, thus preserved, a place useful enough; for here during twelve months, from June 1650, was imprisoned that dauntless reformer and pamphleteer of those troubled times, William Prynne, who proved himself a scourge to foes and friends. He began, absurdly enough, as it seems to us in these days, by attacking “love-locks” and long hair worn by men, and short hair affected by women, with an excursus upon chin-wags and lip-whiskers; and proceeding by easy stages to a denunciation of stage-plays, religious controversy, and political bludgeoning. He was, in short, a born controversialist: the Universal Provider, so to say, of red-hot pamphlets, and generally left his opponents dead, figuratively speaking. A very grim person was William Prynne. 217No one, it is quite safe to say, ever called him “Willie,” and as for “Bill,” that would have been an impossible familiarity with the stern-faced Puritan, even supposing that vulgar diminutive to have at that time been invented. By the way, have the vulgarian who originated “Bill,” and the period of its origination, ever been traced? His opponents were not skilled in wordy warfare, but what they lacked in repartee and argument they fully made up for with the pillory, the whip, and the branding-irons, and they inflicted some particularly cutting rejoinders when they caused his ears to be shorn off. Thus deprived of his face-flaps, many a man would have rested from his pamphleteering, but Prynne persisted, and earned thereby the particular attention of Laud, the High Church Archbishop of Canterbury, who procured his branding on the cheeks with the letters, “S. L.” for “seditious libeller.” With that iron humour that was all his own, Prynne referred to this horrible facial disfigurement as “Stigmata Laudis.” The loss of his aural attachments, together with the addition of this undecorative poker-work, and a fine of ￡5,000, so embittered Prynne that he for ever after pursued Laud with an undying hatred, and had a prominent hand in hounding the Archbishop to public trial and execution, in those days when his fellow-Puritans had obtained the upper hand. Can we honestly blame that intense malevolence he directed at the insidious Romaniser, who would have imprisoned 218men’s consciences again, and who did not hesitate, in procuring these savage mutilations of his opponents, thus to disfigure the image of God! The fearless Prynne, imprisoned here awhile, passed the time of his captivity in looking over and arranging the Luttrell family papers. He was himself a Somerset man, and his detention in this castle could not have been very unpleasant, for it was then as much residence as fortress. The fortress built here by the first of the de Mohuns ceased to exist when the castle was rebuilt about 1417 by Sir Hugh, the first of the Dunster Luttrells. The keep of that Norman place of strength was situated on the crest of the hill, now clear of buildings and used as a bowling green. The spot was once known as St. Stephen’s, from an Early English chapel dedicated to the martyr having stood here. Nothing earlier exists in the buildings of Dunster Castle than the great inner gatehouse, half-way up to the hilltop, now covered, together with the massive curtain-walls, with a thick growth of ivy. This was the work of Reginald Mohun, who died in 1257. The fine outer gateway, built during the enlargement under Sir Hugh, bears sculptured shields with the arms of Luttrell and Courtenay, Sir James Luttrell having, like his great-grandfather Andrew, married into that family. DUNSTER: CASTLE AND YARN MARKET. The military works of Sir Hugh were in their turn remodelled, for the purpose of converting the castle into a residence, rather than a fortress, 219by George Luttrell, in the first years of the seventeenth century. Much of the Renaissance decorative plaster-work, particularly that of the Hall, belongs to this period. The havoc wrought by the siege of 1646 was fully repaired, and the Castle yet again remodelled as a residence, by Francis Luttrell. The grand staircase, elaborately and beautifully carved in oak with representations of hunting scenes, is of this period. Curiously painted ancient leather hangings, ancient furniture, and old paintings that have been in the Luttrell family for many generations, abound in the castle, which is, it may be added, the “Stancy Castle” of Thomas Hardy’s “A Laodicean,” although it should be still further added that it is by no means well characterised in those pages. Additions were again made in 1764; but a general overhauling and rebuilding under the direction of Salvin was undertaken by Mr. George Fownes Luttrell in 1854. This beautiful and interesting old place is generally to be seen by visitors on Saturdays, but not without a good many restrictions readily to be understood in an historic castle which is at the same time a residence. Thus, you are not entitled, by the purchase of a sixpenny ticket at the confectioner’s in the High Street, to wander at will through the beautifully wooded grounds. A guide meets strangers at the lodge-gates, and conducts them. It is not the ideal way, and one would fain linger awhile on the south terrace, 220by that fine lemon-tree which climbs the wall and brings its lavish crop of fruit to perfect ripeness in this soft climate; or would if possible dwell long upon the views in one direction and another; down upon the growing town of Minehead, or across to Blue Anchor and the Holms, set in mid-Channel, with fleeting glimpses of the Welsh mountains. The great church of Dunster, whose choir was in ruins until Mr. Luttrell undertook its restoration, about 1856, contains tombs of the Luttrells and others, and a very fine rood-screen. It is quite in character with the legendary and often muddled character of local history in England that the altar-tomb and alabaster effigies of Sir Hugh Luttrell and his wife, 1428, the first Luttrells of Dunster, were until recent times always shown as those of Sir John and Lady Mohun. A curious example of architectural adaptation is to be seen here, in a fifteenth-century enlargement of an Early English doorway, by which the jambs were cut back for some two-thirds of its height, leaving the upper part as before. This “shouldered” arch, as architects would technically style it, forms a striking object. One of the finest views of Dunster church is that in which, looking from the south, you get the great tower rearing majestically above the churchyard, and in the foreground the ancient alcove in the churchyard wall, formerly the home of the stocks. Some sweet chimes play from the old tower, 221at one, five and nine p.m., daily; with a change of tune for every day of the week. Sunday, “O, Rest in the Lord”; Monday, “Drink to Me only with Thine Eyes”; Tuesday, “Home, Sweet Home”; Wednesday, “Disposer Supreme”; Thursday, “The Blue Bells of Scotland”; Friday, “The old 113th Psalm”; and Saturday, “Hark, hark! my Soul.” DUNSTER CHURCH, FROM THE SOUTH, SHOWING OLD ALCOVE IN CHURCHYARD WALL FOR THE STOCKS. 222Not many visitors climb to the belfry chamber of Dunster church: the wealth of interest in Dunster makes too great a demand upon their energies for every corner to be explored; and as a rule, the interior of one belfry is very like that of another. There are the usual pendant bell-ropes, a few chairs, two or three oil lamps with tin reflectors, and various notice-boards of the Incorporated Society of Bell-Ringers, setting forth the appalling number of “grandsire triples” and “bob-majors” rung by those misguided persons who are so deaf to music that they consider bell-ringing to be harmonious. Education cannot be yet very far advanced while the barbarism of ringing church-bells for an hour at a stretch can be permitted these few fanatics, to the discomfort of the many; and justice and consistency are outraged at the ringing of the perambulating muffin-man’s tinkling bell being held an illegal nuisance, while tons of heavy metal are permitted to be set in motion in church-towers, to the misery of villagers and townsfolk, who have, apparently, no legal remedy. The bell-ringers take themselves with an absurd seriousness, which has not nowadays the least excuse. The exercise may have been accounted a useful and a pious one when bell-ringing was supposed to exorcise devils, or at the very least of it, to remind the faithful that the hour of prayer was come; but now that clerical advanced critics of the Scriptures themselves deny the existence of the Devil himself and all his 223imps, and impugn the inspired character of the Bible, and now that every one can afford a watch and ascertain the hour for himself, the greater part of the church bells in this country could be broken up and sold for old metal, to the profit of the church, and the joy of the laity. CURIOUS ARCHWAY, DUNSTER CHURCH. A battered, and now in parts barely legible, 224old board hangs in the belfry of Dunster church, showing how very seriously these ringers have always taken themselves. Somewhat similar versified rules may be occasionally found in various places throughout the country: You that in Ringing take delight Be pleased to draw near; These Articles you must observe If you mean to ring here. And first, if any Overturn A Bell, as that he may, He Forthwith for that only Fault In Beer shall Sixpence pay If anyone shall Curse or Swear When come Within the door, He then shall Forfit for that Fault As mentioned before. If anyone shall wear his Hat When he is Ringing here, He straightway then shall Sixpence pay In Cyder or in Beer. If anyone these Articles Refuseth to Obey, Let him have nine strokes of the Rope, And so depart away. It will be observed that the fines inflicted were applied to the purchase of beer and cider, and no doubt the misdemeanours were invented for the purpose of providing a constant supply of drink to the thirsty ringers. We may, perhaps, dimly envisage the wrath of the rest when one of their number, having offended, refused to pay his 225sixpence. “Nine strokes of the rope” were not too bad for him who refused to contribute towards quenching their thirst; and they were probably laid on with a will! Prominent in the picturesque street of the quiet old townlet is the Yarn Market, a stout, oak-framed building, quaintly roofed, whose name recalls the time when Dunster was a cloth-weaving town, producing kerseymeres and goods named after the place of origin, “Dunsters.” It was built in 1609, by George Luttrell. The initials of another George Luttrell, his nephew, and the date 1647 are to be seen on the weather-vane; evidence of the repairs effected after the siege of 1646. THE “NUNNERY,” OR “HIGH HOUSE,” DUNSTER. The “Luttrell Arms,” a famous hostelry, noted alike for its good cheer and for its interesting architectural details, stands opposite the Yarn 226Market. Legends, all too often, but by no means always, picturesque lies, have it that this noble fifteenth-century building was originally a “town house” of the Abbots of Cleeve; and they may in this case well tell us truly, for the massive carved-oak windows of the kitchen, looking on to the little courtyard, have a distinctly ecclesiastical feeling. But whoever it was owned the place, he was at pains to make the entrance-porch defensible, as may yet be seen in the arrow-slits contrived in the stonework on either side. The so-called “Oak Room” is perhaps less clerical in effect, but is nobly timbered, with oak hammer-beam roof in three bays. A curious early seventeenth-century mantelpiece in plaster-work, with hideous figures on either side, displays as central feature a medallion relief representing the classic story of Act?on torn to pieces by his dogs, or, this being a hunting country, shall we say his hounds? It is a very small and thin Act?on, and they are very large hounds that have got him down and are urgently seeking some meat on him. Dunster, as already hinted, is a place not readily exhausted, nor lightly to be hurried through. Curious old houses, notably the so-called “High House,” await inspection, and below the Castle, not always found by hurrying visitors, is the rustic old Castle Mill, with an overshot and an undershot waterwheel, side by side, tucked away from casual observation beneath tall trees. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2941/80824.html","bookId":1088,"book":{"id":1088,"title":"The Somerset Coast","description":"简介： On confiding to personal friends, journalistic paragraphists, and other Doubting Thomases, professional sceptics, chartered cynics and indifferent persons, the important and interesting literary news that a proposal was afloat to write a book on the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2941","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
