{"id":43168,"no":17,"title":"CHAPTER XVII IN WHICH SARAH CHANGES HER MIND","content":"It was indeed Sarah! The sound of her latch-key in the basement door was unmistakable. What could have induced her to return when she had been away scarcely more than an hour, they could not imagine, unless it was her anxiety on Margaret\u0027s account. At any rate, there she was, and a panic of consternation seized them all. Even the wonderful signet was forgotten in the stress of the moment. Strangely enough, it was Margaret who first regained her poise and grasped the situation. \\n\\n \\n\\n \"Quick!\" she whispered. \"Corinne and Jess, get those things back in the trunk—any old way! Bess, you go out and call down to ask her what\u0027s the matter. Maybe she isn\u0027t coming up just yet!\" \\n\\n \\n\\n They got to work in frantic haste, and Bess229 went out in the hall to make her inquiries of Sarah. \\n\\n \\n\\n \"What\u0027s the trouble, Sarah? You\u0027re back very early!\" they heard her ask. And an answering voice from the basement stairs responded: \\n\\n \\n\\n \"Sure \u0027tis rare unhealthy weather fur this time of year! \u0027Twas so war-rm I nearly roasted in me heavy coat—and we not out of winter yet! I come back fur me lighter cape. \u0027Tis hangin\u0027 in the attic!\" \\n\\n \\n\\n \"We\u0027re lost!\" muttered Mr. Cameron as Bess rushed in, despair written all over her face. \"Can\u0027t any one think of something to keep her downstairs for five minutes?\" \\n\\n \\n\\n And this time it was Alexander who came to the rescue. \\n\\n \\n\\n \"Just watch your Uncle Dudley!\" he whispered, as he ambled with apparent unconcern out of the room. \"If you hear me call her down, give that trunk the boost to the attic as soon as you can, and put the key back in her shoe.\" \\n\\n \\n\\n They heard him leisurely descending the230 stairs, and Sarah\u0027s massive tread approaching nearer and nearer. At one point there came sounds as of a slight scuffle, and muttered remarks of \"Spalpeen!\" and \"I\u0027ll fix you yet, young man!\" Then Alexander passed on, whistling derisively, and Sarah\u0027s heavy feet began the ascent of the second-story flight. Up and up she came, and still nothing happened. Hope died out in the listening group, for they were sure now that, whatever Alexander might do, it would be too late to avert the catastrophe. Sarah had, indeed, just planted a broad foot on the top step when they heard Alexander\u0027s shrill voice calling from the basement: \\n\\n \\n\\n \"Oh, Sarah! Sarah! Come quick! There\u0027s something afire in the kitchen!\" \\n\\n \\n\\n \"Saints save us!\" They heard her exclaim, and she turned to descend with a speed of which they had never dreamed her capable. \\n\\n \\n\\n \"Do you think it\u0027s anything serious?\" whispered Jess to Mr. Cameron. \"Oughtn\u0027t we go down, too?\" \\n\\n \\n\\n \"No indeed!\" he laughed. \"I guess we can231 trust Alexander. Fortunately, the trunk is very light, so you girls can get it upstairs while I listen in the hall to see if they need help below.\" \\n\\n \\n\\n In five minutes the three girls had the trunk safely back in its place, and the key restored, and were back in Margaret\u0027s room, panting from exertion and breathless excitement. But it was at least a quarter of an hour before Alexander came up again, chuckling and smoke-blackened. \\n\\n \\n\\n \"Well, this is one time when we put it all over the lallypaloozer!\" he exclaimed jubilantly. \"I got that pail of glue I keep in the yard to paste kites with, and put it on the gas-stove as if I was going to heat it. Then I accidentally-on-purpose dropped a lighted match into that big tin thing where Sarah keeps the waste paper and scraps. It made a big blaze, but I knew it couldn\u0027t hurt anything, \u0027cause it\u0027s tin all around it. But I raised a hullabaloo like you\u0027d thought the Woolworth Building was going up in blue smoke! It fetched her down, all right, and I232 figure it\u0027ll keep her there a good spell! The gas-stove\u0027s all smoky, and she\u0027s cleaning it up and growling like a bear, so I beat it up here!\" \\n\\n \\n\\n Then at last, with their minds relieved, did they have their first opportunity to consider their wonderful \"find,\" and they all crowded around Margaret, in whose little white palm it lay. The gold setting at the back was tarnished quite black, but the jewel itself was apparently unchanged. They gave an involuntary gasp as they examined it, for it was even more beautiful than they had imagined. The flat sapphire itself was as large as a big Lima bean, flawless, and curiously engraved with the old-English letter \"T,\" and a crest above it, looking like two eagles holding a sword. The surrounding diamonds were tiny, but finely cut and still brilliant. \\n\\n \\n\\n \"Isn\u0027t it almost unbelievable,\" half whispered Margaret, at last, \"to think that right here in my hand I hold the very jewel that cost poor Alison so much pain and trouble! And, oh! to think, besides, that it never got back to233 Bermuda, after all, and probably she didn\u0027t either. It makes me, feel just—sad—somehow!\" \\n\\n \\n\\n \"But what are we going to do with it?\" demanded Corinne. \\n\\n \\n\\n Mr. Cameron had been examining the jewel with all the ardor of a genuine lover of antiques. He now spoke very quietly: \\n\\n \\n\\n \"There\u0027s only one thing to do, and it\u0027s a solemn duty imposed on us by the writer of that poor little journal you found. We must make every effort to discover whether the Trenhams in Bermuda have any descendants or relatives existing to-day. No matter how distant they may be, the signet must be returned to them, for it was Alison\u0027s wish. If we should find none, that is another matter. I believe the jewel would then be rightly counted the property of—the Bronsons of Charlton Street!\" \\n\\n \\n\\n The Bronson contingent there present gasped in chorus! \\n\\n \\n\\n \"But how shall we go about hunting up the descendants of the Trenhams?\" questioned234 Corinne. \"That\u0027ll be a big piece of work, won\u0027t it?\" \\n\\n \\n\\n \"It probably will, and perhaps a very complicated one, besides,\" agreed Mr. Cameron. \"We had better start our investigations with the Bermuda records, and I\u0027ll write down there to the authorities asking how I can get hold of data about the family history. The matter must be dealt with very carefully, because it is really no light affair. I am convinced, even in this hasty examination, that the signet is very rare and of very considerable value, not only because of the stone itself, but of its antiquity. It must not be lightly given away. Its ownership must be proved beyond a doubt. I expect to be extremely busy for the next three or four weeks, and may have little time to give to this matter. But after that, when business slackens, I can give this the attention it deserves. Meantime, I think perhaps it had better be kept in my safe-deposit box at the bank, where it will be absolutely safe. We won\u0027t trust this, at least, to Sarah\u0027s tender mercies!\" \\n\\n \\n\\n 235 \\n\\n \\n\\n Suddenly Corinne cried out in perplexity: \"But this makes our mystery deeper than ever! Do you realize it, folks? What became of poor little Alison, after all? And why were her trunk and her jewel and half her journal found floating about in a wrecked vessel?\" \\n\\n \\n\\n \"I tell you, she had to \u0027walk the plank\u0027!\" reiterated Alexander. \"I said so before, and now I believe it! It\u0027d make a gorgeous old pirate yarn!\" \\n\\n \\n\\n \"She didn\u0027t! She didn\u0027t!\" wailed Margaret. \"I won\u0027t believe such a thing!\" \\n\\n \\n\\n \"Never mind what happened—just yet!\" interrupted Mr. Cameron, soothingly. \"The Antiquarian Club\u0027s going to find out the truth some time—I\u0027m convinced of that!\" \\n\\n \\n\\n It was two weeks later, about the middle of March, when Corinne came in to see Margaret one afternoon with considerable suppressed excitement in her manner. Margaret was still confined to her bed, and, though scarcely so listless as she had seemed at first, she was undoubtedly weaker. Corinne\u0027s visits were236 now her mainstay of pleasure and interest, and she welcomed the girl with a glad little cry. \\n\\n \\n\\n \"I\u0027ve got news for you, Honey!\" said Corinne, laying her usual offering of flowers and fresh fruit on the bed. \\n\\n \\n\\n \"What?\" cried Margaret, eagerly. \\n\\n \\n\\n \"Well, you mustn\u0027t be surprised, but Father hasn\u0027t been a bit well again, lately. The weather\u0027s awfully hard on him, and his business has rushed him, too, and he\u0027s all run down. So in a couple of weeks he\u0027s going to take a vacation and go down to Bermuda again. It did him a lot of good last time. He\u0027ll stay at least a month, and longer if he feels like it.\" \\n\\n \\n\\n \"Isn\u0027t that nice!\" cried Margaret, with great interest. \"I\u0027m awfully sorry he doesn\u0027t feel well, but I\u0027m glad he can go to such a lovely place and get better. You\u0027ll miss him though, won\u0027t you, Corinne, because you seem to be with him such a lot,—more than most girls are with their fathers!\" \\n\\n \\n\\n \"No,\" said Corinne, slowly, \"I won\u0027t miss him, because—I\u0027m going with him!\" \\n\\n \\n\\n 237 \\n\\n \\n\\n Margaret stared at her a moment wide-eyed, and her chin quivered—just a mere trifle. But she braced up with a visible effort and exclaimed: \\n\\n \\n\\n \"Oh, Corinne! how lovely! You certainly are a lucky girl!\" Then the chin began to quiver harder, and all at once poor little Margaret completely lost control of herself, and buried her head in the pillow, sobbing: \\n\\n \\n\\n \"Oh, I am glad! I really am glad for you, Corinne! Don\u0027t mind this! Only it just seemed as though I couldn\u0027t live without you for so long!\" \\n\\n \\n\\n Corinne gathered the sobbing form in her arms and crooned to her: \"You won\u0027t have to, dearie, for—you\u0027re going along, too!\" \\n\\n \\n\\n Margaret sprang back from her embrace, pushed the tangled curls from her eyes, and gazed at Corinne as though her friend had suddenly gone crazy. \\n\\n \\n\\n \"What?\" was the only word she could utter. \\n\\n \\n\\n \"Now, just you let me explain it all,\" began Corinne, soothingly, settling down on the bed beside her. \"And don\u0027t you get so excited, because238 it isn\u0027t good for you. I\u0027ll tell you the whole story. It was like this. After Father found it was best to go to Bermuda, he made up his mind that Aunt Katharine and I might as well go, too, because he hates to go alone. And, of course, I was crazy to go, but just one thing kept me from being entirely delighted, and that was—you! I hated to leave you, because I love you, and also because you are not at all well just now. Father and I have both been very anxious about you. So we got to talking it over, and suddenly he said: \u0027Why not invite Margaret to come along with you as your guest! The trip might do her a great deal of good, and I know you two are growing as inseparable as a pair of Siamese twins!\u0027 \\n\\n \\n\\n \"Well, you can just warrant I was delighted, for I knew Father\u0027d never make such a suggestion unless he really wanted you, too! He said he would call on your mother at her place of business, and see if she would consent, and also on your doctor, to see if he thought the trip would be advisable. I begged him to make them keep it a secret, so that, if everything239 went well, I could surprise you with the news when it was all settled. I hated to have you disappointed in case the doctor thought it wasn\u0027t wise, or your mother felt that she couldn\u0027t consent to your going. \\n\\n \\n\\n \"Your mother was awfully surprised, of course, and for a while she almost refused, because she felt it to be too much for Father to do. But when she found that it was going to do you so much good, and how terribly I wanted you, she gave in. And you needn\u0027t worry about being taken care of and having everything done for you that Sarah does. I\u0027m going to do that! It\u0027s to be my job, being your lady\u0027s maid, and won\u0027t I enjoy it! Aunt Katharine will help too, when necessary. She\u0027s lovely and kind and gentle, and you\u0027re going to like her a lot! \\n\\n \\n\\n \"Honey, we sail a week from next Wednesday, and I can hardly wait for the time to come!\" \\n\\n \\n\\n There was surprise and rejoicing in the Charlton Street house that night when Mrs.240 Bronson arrived and the great secret became public property. Mrs. Bronson admitted that she had known about it for several days, and was having a pretty outfit of traveling clothes made for Margaret. The twins were frankly delighted, for they had been themselves experiencing much secret anxiety on account of Margaret\u0027s precarious health, as indeed had all the household. Alexander gave an Indian war-whoop that was ear-splitting and performed the acrobatic feat of standing on his head in the middle of the parlor floor for three minutes unassisted! The extraordinary racket brought an indignant Sarah up from the kitchen to investigate. \\n\\n \\n\\n But it was when Sarah heard the news that consternation fell upon the happy household. She placed both hands on her massive hips, threw back her head, squared her shoulders, and announced: \\n\\n \\n\\n \"If Margie puts one fut aboard that rampagin\u0027 ship, I go out of this house, never to retur-rn!\" \\n\\n \\n\\n Now, when the autocratic Sarah made a241 statement of this nature, it was time for the family to tremble! Mrs. Bronson argued, pleaded, commanded—in vain. Sarah could no more be budged from her position than the Rock of Gibraltar. Urged to state her reasons, she would offer but two. And these were that, about forty years ago, she herself had come over from Ireland in a truly \"rampagin\u0027\" ship, and never again would she trust herself or any one she held dear to the mercies of the ocean. Arguments that ship-building had made some progress and traveling was safer since those days had absolutely no effect on her—in fact, she refused to believe them! \\n\\n \\n\\n Her second reason was that Margaret had been in her care ever since she was born, and no one else knew so well what to do for the delicate child. She was firmly convinced that it would be the death of her beloved charge to be removed from her oversight. At last the distracted Mrs. Bronson laid the matter aside for the night, the girls retired to bed in tears and indignation, and Alexander dared to shake his fist at the broad back of Sarah departing242 to the kitchen. Only Margaret remained in ignorance of the impending disaster, and fell asleep happy beyond words. \\n\\n \\n\\n The next day Mrs. Bronson sent a request to Mr. Cameron to call that evening, for she felt that the situation must be explained to him. It would be a serious matter if Sarah kept her word—as she doubtless had every intention of doing. It also was important, for the sake of Margaret\u0027s health, that she should get away and have this wonderful change. Mrs. Bronson was a sorely troubled woman as she explained the circumstances to her visitor. Mr. Cameron sat in deep thought for a few moments. Then he said: \\n\\n \\n\\n \"Could you have your housekeeper come up here for a few minutes and allow me to see her alone?\" \\n\\n \\n\\n Mrs. Bronson declared that it was entirely possible, summoned Sarah, who arrived full of hostile intent, introduced her to the visitor, and went upstairs, leaving them together for a while. Margaret had by this time learned of the trouble, and was nervous and anxious and243 feverish. Corinne, who had come with her father, was sitting with her, trying to assure her that she need not worry. But the assurance rang hollow in her own ears. She, too, knew Sarah! \\n\\n \\n\\n Presently they were surprised to hear her heavy footsteps coming upstairs. They passed the door and entered Mrs. Bronson\u0027s room. Then, in a moment, they returned, halted, and a singularly changed Sarah stood in the doorway. \\n\\n \\n\\n \"Yer father\u0027s goin\u0027 now, Miss Corinne, and he wants ye,\" she announced in a strangely meek, quiet voice. \"I\u0027ll be back in two minutes to fix me child for the night. We got to get her in good shape before she takes that rampagin\u0027 ship for Bermudy!\" \\n\\n \\n\\n That was all, but she actually smiled—a weak, apologetic little smile—before she vanished from the doorway! \\n\\n \\n\\n The girls stared at each other in complete bewilderment. Never had they witnessed a change more astonishing. \\n\\n \\n\\n \"Well, doesn\u0027t that beat everything!\" exclaimed244 Margaret. \"What could have happened to Sarah?\" \\n\\n \\n\\n \"I don\u0027t know,\" answered Corinne, \"except that Father\u0027s had a talk with her. He told me, coming over, that your mother had called him up to-day on the telephone, explained some of the trouble, and asked him to call to-night. He said he himself was going to have an interview with Sarah, and I told him it probably wouldn\u0027t do any good. But he said he had something that he thought would convince her ladyship pretty speedily. But he also said I was not to ask him what it was! Some time he might tell me, but not at present. Isn\u0027t that mysterious! I really didn\u0027t think he\u0027d succeed. He evidently has! Hurrah!\" \\n\\n \\n\\n \"But what can he have said to Sarah that would make her change around so!\" marveled Margaret. \\n\\n \\n\\n \"I\u0027m sure I can\u0027t imagine!\" cried Corinne. \"But never you mind, honey dear! A week from next Friday we step off on the island that was Alison\u0027s home! And nothing else matters!\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1918/55156.html","bookId":909,"book":{"id":909,"title":"The Sapphire Signet","description":"简介： It was five o\u0027clock and a very dull, dark afternoon in Charlton Street. One by one lights had twinkled out in all the little two-story-and-dormer-windowed houses on the block,in all but one. The parlor windows of this house were still unlit, but behi...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1918","creation":"Aug 1, 2019 12:23:51 AM","modification":"Aug 1, 2019 12:23:51 AM"}}
