{"id":98794,"no":14,"title":"Page 14","content":"When she came back down, Chase had sat on the edge of the tub again and was holding her in his lap, his cheek resting on her shoulder. His hands traced an idle, smooth circle along her lower back, following the curve of her spine. Madison didn’t protest when he leaned back, his vibrant blue eyes hooded. Those dimples appeared on his striking face, and she wanted to kiss them. She wanted to do all kinds of things. Starting with repaying him… Madison reached down, wanting to feel his length, but he stopped her. “We still need to talk,” he said, his fingers pressing into the flesh of her hips again as he placed her on her feet. Talk? She didn’t think she was capable of forming a coherent sentence. Tiny droplets of water sprayed from her soaked hair when she shook her head. Chase chuckled as he rose. Reaching around her, he grabbed the towel and slowly, carefully dried her off before wrapping the oversized material around her breasts. “Now,” he said, pressing a kiss to her forehead, “I can concentrate.” She stared up at him, doubting how affected he really was when he could engineer her lust like that and not take any pleasure for himself. Stirrings of unease began in her belly, a not-so-pleasant thing to feel after something so mind-blowingly wonderful. “Well, I can’t.” Taking her hand, he led her out of the bathroom to the bed. She sat, clutching the edge of the towel, very unsure of everything again. Especially when his emotions were on lockdown, his face blank, but his eyes… He stood before her, legs spread in a powerful, dominant stance. “I want you.” You have me, she wanted to say. “I think we’ve established that.” His lips curved at the corners. “And you want me.” “Another known fact,” she said. A well-known fact, that is, but there was no need for her to point that out. “Where is this conversation going?” Because she wanted to finish it, strip him naked, and finally get him where she’d always wanted him. Oddly, a heart-shaped bed was never in her fantasies, but she was okay with improvising. “And I care about you. I really do.” Chase knelt before her, his eyes meeting hers. “There’s only one option.” Hope was back again, beating at her insides like a hyper butterfly. Caring about someone didn’t mean loving her, but Chase wasn’t the type of man to proclaim his undying devotion, especially with the daddy issues. But she could work with this. And of course, there was only one option. Cut the crap and be together. Face her brother, admit that they cared for each other, and deal with it. Together, she could prove to him that he was nothing like his dad. That he was worth everything. Then they could finally discover if there really was a fairy-tale ending for them. And of course, lots and lots of sex in the near future. “I agree,” she said, fighting a goofy grin that would make her look like she’d been smacked with the idiot branch. “Good. Great.” His shoulders relaxed. “Because this is what we both need.” God, did she ever need this—need him. Chase smiled. “And once we do it, then…things will be normal again. It’ll be over.” She started to nod in agreement, because she was still knee deep in her fantasy coming true, but what he said slowly sank in. Icy dread drifted over her skin. “Come again?” “Having sex,” he explained as he rose and leaned forward, placing his palms on either side of her thighs, caging her in. “We do it. Get it over with. Because obviously we can’t go back to things being normal until we do.” That horrible chilled feeling seeped through her skin, leaving her numb. “Being normal?” “Yeah, like things were before. We can be friends again.” He placed a large hand on her shoulder, and she flinched. Chase frowned. “No harm. No foul.” Madison was having a hard time processing what he was saying. How long had she waited to hear him admit that he cared for her, wanted her, and this…this was added onto the end, like a disclaimer of doom? An ache opened up in her chest. He cupped the nape of her neck, tilting her head back. He placed a kiss under her chin, the gesture so sweet and gentle tears filled her eyes. Because the gesture really meant nothing. “Say something, Maddie.” He let go, moving back onto his haunches. She wasn’t sure if she could say anything. A lump had formed in her throat, and it was quickly moving up. Her insides felt bruised, and when she spoke, her voice was hoarse. “So…so that’s the magical fix? We have sex to get it out of our systems?” “I wouldn’t call it a magical fix,” he said, head cocked to the side. “But it’s something, right?” It was something, all right, and no matter how badly she wanted him, it wasn’t enough. And God, did that sting like a bitch? No, it was worse than a sting. It was like being cut wide open. “Wow,” she murmured finally, somewhat dumbfounded. “That’s such a romantic proposition, how could I refuse?” His lips formed a tight line. “You don’t need to be a smartass about it.” She laughed, but it was brittle sound. “How am I supposed to be, Chase?” Standing straight, he took a step back and shook his head. “Maddie—” “Let me get this straight,” she said, coming to her feet. Her legs shook. Her one free hand trembled as she crossed the distance between them and stopped. “You’re worried about disrespecting Mitch by being with me and you don’t want to treat me like your dad treated your mom, but somehow, in your head, sleeping with me to get it out of your system is less offensive?” Chase opened his mouth, but nothing came out. Maybe he realized his mistake, but it didn’t matter. It was too late. Heart breaking into a million stupid little pieces, she smiled tightly. “And even if in some messed-up parallel universe where that would be okay to my brother and you, I wouldn’t ever be okay with that.” And then she did something she had never done in her life. Madison smacked him across the cheek. Chapter Eight Well, that hadn’t gone as planned. Not that Chase really had a plan. Over an hour later, his cheek was still stinging like hell and the bathroom door she had slammed shut in his face was still ringing in his ears. God, he’d mucked everything up in the worst kind of way. As he had sat on the couch, wondering how in the hell he could fix this, he’d heard the water running in the bathroom and knew she wasn’t showering again. Maddie was too proud. She’d turned the water on to mask her tears. Damn it. The last thing Chase wanted to do was hurt her and damn if he hadn’t. He felt like the worst kind of son of a bitch. Finally, she had emerged from the bathroom, eyes puffy but face clear as she stalked past him, dressed in another pretty little dress that matched the green flecks in her eyes, and left the cabin without saying a word, her spine unnaturally stiff. He’d tried to stop her, like he’d gone to the bathroom door several times over, but he’d said nothing, because really, what could he say now? How could he fix this? He should’ve just kept his damn mouth shut and let it go. By the time he stood from the couch and changed into a pair of dark slacks and a light dress shirt for the formal dinner, he was already running a few minutes late. Most everyone had arrived to the dining hall in the main lodge by the time Chase finally trudged in. Mitch and Lissa sat at the head of the table, side by side, holding hands. And then on either side of them were their parents, followed by the… God damn, the bridal party. Maddie sat, one leg primly crossed over the other, hands folded in her lap, and spine still straight. The seat beside her was empty. The seating was assigned. Squaring his shoulders, he headed to his seat, nodding in response to various greetings. Maddie didn’t look at him, didn’t say a word. He glanced at her from the corner of his eye. Her jaw was tight, lips pressed into a small line. Across from him, Chad stood with a glass of wine in his hand. “Now that we’re all here, it’s time for a toast.” “And hopefully something to eat,” Mitch said, grinning. Lissa playfully smacked his arm, and he laughed. “Go ahead, Chad.” Chad cleared his throat melodramatically. Half the table was leaning forward, dying to hear what he was actually going to say. One never knew with him. “I think we can all agree that no one is surprised to be here,” he started out, raising his glass high in the air. “From the moment Mitch and Lissa met, we knew he was whipped.” Laughter followed, and at the head of the table, Mitch shrugged, accepting what was true. Even though the two had started off as friends, it had been obvious that Mitch had the hots for the pretty blonde. Chase’s gaze met his eldest brother’s. Chandler quirked an eyebrow and then glanced at Maddie. “Most of us were taking bets to see how long he went before asking her out.” Chad grinned at Lissa’s surprised expression. “Yep, I said a week. Chandler called two weeks, and good ole Chase said a month and a half.” Lissa gasped and then grinned. “Mitch asked me out when we’d known each other close to two months.” Her wide smile turned on Chase. “You won.” He shrugged as he toyed with the stem of his wineglass. Although a lot of eyes were on him, a lot of smiles, Maddie stared straight ahead. “Betting aside,” Chad went on, “we all knew that Lissa and Mitch were the real deal. No two better people could’ve met. So cheers!” Glasses rose and a roar of liveliness filled the room. Chase was surprised his brother had relatively behaved himself during the speech. Then it was his turn, and as the best man, he was honor-bound to humiliate his buddy, but like Chad, he kept it simple: short and sweet. The food arrived and the dinner progressed as it should, for the most part. Everyone around him was celebrating the union of two people who deserved it, but him? He was thrilled for them, but… Chase glanced at Maddie as she spoke to one of the bridesmaids. He was an asshole. There was no way around it, and he knew deep down that she was never going to forgive him for his offer. Not that he blamed her. It was tantamount to offering her money for sex. Worse than anything his father did. Appetite vanished, he pushed his plate back and tried to listen to what one of his college buds was saying. But he noted that Maddie stayed away from the wine. At least there would be no repeat of her dancing with the dickhead. A possessive feeling surged inside him as he recalled the guy putting his hands on her hips, lifting her off the bench. That guy had no right touching her. Chase sucked in a sharp breath. Hell, he had no right to touch her. When dinner was over, the party broke into small groups and he couldn’t help but notice Maddie steered straight toward her brother and family. Pressure built in his chest, like a sudden weight, settling hard. Knowing he needed to fix things, but not sure if he could, he felt his mood plummet from bad to shit, which wasn’t improved when Chad sauntered up to him and dropped a heavy arm over his shoulders.","sourceLink":"https://allnovel.net/tempting-the-best-man-gamble-brothers-1/page-14.html","bookId":2003,"book":{"id":2003,"title":"Tempting the Best Man (Gamble Brothers #1)","description":"Storyline: Tempting the Best Man (Gamble Brothers #1) by J. Lynn, Jennifer L. Armentrout A sexy category romance from Entangled\u0027s Brazen imprint... She\u0027ll make him lose control... Madison Daniels has worshipped her brother\u0027s best friend since they were kids. Everyone thinks she and Chase Gamble would make the perfect couple, but there are two major flaws in their logic. 1) Chase has sworn off relationships of any kind, and 2) after blurring the line between friends and lovers for one night four years ago, they can\u0027t stop bickering. Forced together for her brother\u0027s wedding getaway, Chase and Madison decide to call a truce for the happy couple. Except all bets are off when they\u0027re forced to shack up in a tacky 70’s honeymoon suite and survive a multitude of \"accidents\" as the family tries to prove their \"spark\" can be used than for more than fighting. That is, if they don\u0027t strangle each other first…","cover":"https://allnovel.net/images/tempting-the-best-man-gamble-brothers-1.jpg","author":"Jennifer L. Armentrout","type":"Romance","source":"allnovel","link":"https://allnovel.net/tempting-the-best-man-gamble-brothers-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:36:31 PM"}}
