{"id":22830,"no":13,"title":"XII. LANDLORD AND TENANT.","content":"The payment of a thousand dollars to Randall had been a severe blow to old Peter Manson, and this consideration materially lessened the satisfaction which he felt in Charlie\u0027s removal. We re-introduce him to our readers, engaged, as usual, in counting over his hoards. Preparatory to doing so, he carefully secured the outer door, and also the door of the apartment which he occupied. Then lifting up a plank from the floor, he raised from beneath a large box containing gold coins. It was very heavy, and it was not without difficulty that the old man, who was very feeble, succeeded in lifting it to a level with the floor. The box was, perhaps, four fifths full. [107] The old man surveyed the deficiency with a groan. \"It might have been full,\" he muttered, \"if I hadn\u0027t been obliged to pay away such a sight of money to that determined man. One thousand dollars! two hundred bright, sparkling coins! How many, many weary days it will take before I can supply their place. It was all but full. It wanted only ten more coins to make five thousand dollars. Oh gold, gold, gold! How beautiful you are! To me you are food and drink and clothing and friends and relations. I care for nothing but you.\" While Peter was indulging in this soliloquy, he was engaged in counting the coins in the box. The result of the count showed one less than he had anticipated. The old man turned pale. \"Some one has robbed me,\" he muttered. \"Or, perchance, I have counted wrong. I will go over it again.\" This he did with eager haste and a feeling of nervous anxiety, and, to his no small dismay, the count resulted as before. [108] \"They have taken my money!\" exclaimed Peter, tearing his white hair in anguish. \"They will make me a beggar, and I shall be reduced to want in my old age. Oh, oh!\" In the midst of his lamentations he suddenly discovered the missing coin, which had rolled away, without his observing it, to the opposite side of the room. Chuckling with delight, he picked it up and replaced it in the box. His duty satisfactorily performed, the miser put on his cloak, and prepared for another task. This was, to raise Mrs. Codman\u0027s rent, and so compel her to leave the rooms which she rented of him. This, however, was unnecessary, since, deprived of Charlie\u0027s earnings, his mother would have found it impossible to pay the rent previously demanded. Peter Manson resolved to call upon his tenant in person. He was not afraid of recognition. He felt that the changes which twenty years had wrought in his appearance, would be a sufficient protection. Indeed, this had already been tested; for Peter had already called several times on the same[109] errand, without attracting a glance which could be construed into recognition. It was the morning after Charlie had disappeared. He had been absent twenty-four hours, and his mother had heard nothing of him. She was in a terrible state of apprehension and anxiety, for few boys were more regular than he in repairing home as soon as his daily duties were over. Mrs. Codman had sat up late into the night, hoping against her fears that he would return. At length, exhausted by her vigils, she sank upon the bed, but not to sleep. In the morning she rose, unrefreshed, to prepare her solitary meal. But it was in vain. Sorrow and anxiety had taken away her appetite, and she was unable to eat anything. Soon afterwards a knock was heard at the door. She hastened to open it, hoping to hear some tidings of her lost boy. What was her disappointment to meet the bent form and wrinkled face of Peter Manson, her landlord. The old man gave her a stealthy glance. \"Why did I not know her before?\" he[110] thought. \"She is not so very much changed. But I—ha, ha! she don\u0027t know who I am.\" Mrs. Codman went to a drawer in her bureau, and took therefrom six dollars. \"This is the amount of your rent, I believe,\" she said. The old man greedily closed his fingers upon the money, and then, after intimating that it was very small, avowed his determination to raise the rent to two dollars per week. The miser watched with gleeful exultation the look of dismay which came over the face of his tenant. Two dollars a week was not only beyond Mrs. Codman\u0027s means, but was, at that time, an exorbitant rent for the rooms which she occupied. She would scarcely have been justified in paying it while she had Charlie\u0027s earnings as well as her own to depend on. Yet there seemed now an imperative necessity for remaining where she was, for a time at least. It was possible that Charlie would come back, and if she should remove, where would he find her? Of course, he would[111] come back! The thought that there was even a possibility of her son being lost to her was so full of shuddering terror, that Mrs. Codman would not for a moment indulge it. Life without Charlie would be so full of sadness, that she could not believe him lost. She resolved to make an effort to arouse the old man\u0027s compassion. She did not dream of the spite and hatred which he felt towards her. There are none whom the wicked hate so heartily as those whom they have injured. That is something beyond forgiveness. Mrs. Codman knew that Peter Manson was avaricious, and to this she attributed the increase in the rent. She had no suspicion that he had a particular object in distressing her. \"Surely, Mr. Manson,\" she remonstrated, \"You do not think these rooms worth two dollars a week. It is all we are able to do to raise the rent we now pay.\" \"Humph!\" muttered Peter, avoiding the eye of his tenant, \"they are worth all I can get for them.\" [112] \"Have you raised the rent on the other rooms in this house?\" \"No, but I—I shall soon.\" \"Then I tremble for your tenants. Mr. Manson, if you were poor yourself, perhaps you would have a heart to sympathize with and pity the poor.\" \"If I were poor!\" exclaimed the old man, betrayed into his customary whine; \"I am poor; indeed, I am very poor.\" \"You!\" repeated Mrs. Codman, incredulously. \"Why, you must receive a thousand dollars a year from this building.\" \"Yet I—I am poor,\" persisted Peter. \"I am only an agent. I—I do not own this building; at least—I mean—there are heavy incumbrances on it; I have to pay away nearly every dollar I receive.\" \"Can you let me remain a month longer for the same rent as heretofore?\" asked Mrs. Codman, anxiously. \"I—I couldn\u0027t do it,\" said Peter, hastily. \"Either you must pay two dollars a week, or move out.\" Mrs. Codman hesitated. [113] She went to her bureau, and found that she had between five and six dollars remaining in her purse. This would enable her, in addition to what she could earn by sewing, to get along for a month. \"Very well, sir,\" said she, \"I must stay a month longer, at any rate. I must for my boy\u0027s sake.\" \"Have you a son?\" asked Peter, desirous of learning from the mother\u0027s lips that the blow had struck home. \"Yes; you have probably seen him here sometimes.\" \"I haven\u0027t noticed him.\" \"I am feeling very anxious about him. Yesterday morning he went out on an errand for some one who had engaged him, and he hasn\u0027t been back since. I am afraid something must have happened to him,\" and the mother\u0027s eyes filled with tears. \"Perhaps he has fallen off from one of the wharves, and got drowned,\" suggested Peter, with a savage delight in the pain he was inflicting. \"You don\u0027t think it possible!\" exclaimed[114] Mrs. Codman, starting to her feet, and looking in the old man\u0027s face with a glance of agonized entreaty, as if he could change by his words the fate of her son. \"Such things often happen,\" said Peter, chuckling inwardly at the success of his remark; \"I knew a boy—an Irish boy, about the size of yours—drowned the other day.\" \"About the size of my boy! I thought you had not noticed him.\" \"I—I remember having seen him once,\" stammered Peter. \"He is about a dozen years old, isn\u0027t he?\" \"Yes; but you don\u0027t—you can\u0027t think him drowned.\" \"How should I know?\" muttered Peter. \"Boys are careless, very careless, you know that; and like as not he might have been playing on the wharf, and——\" \"No, it can\u0027t be,\" said Mrs. Codman, with a feeling of relief which her knowledge of Charlie\u0027s habits gave her. \"Charlie was not careless, and never went to play on the wharf.\" The old man was disappointed to find that[115] his blow had failed of its effect, but ingenious in devising new methods of torture, he now suggested the true cause of Charlie\u0027s absence. \"Perhaps,\" he said, with his cruel gray eyes fixed upon the mother, \"perhaps he\u0027s been carried off in a ship.\" \"Carried off in a ship!\" faltered Mrs. Codman. \"Yes,\" said Peter, delighted by the evident dismay with which this suggestion was received. \"But,\" said Mrs. Codman, not quite comprehending his meaning, \"Charlie never had any inclination to go to sea.\" \"Perhaps they didn\u0027t consult him about it,\" suggested Peter. \"What do you mean?\" exclaimed the mother, with startling emphasis, half advancing towards the old man. \"You—you shouldn\u0027t be so violent,\" said Peter, trembling, and starting back in alarm. \"Violent! Deprive a mother of her only child, and she may well show some vehemence.\" \"I—I didn\u0027t do it,\" said Peter, hastily. [116] \"Certainly not,\" said Mrs. Codman, wondering at his thinking it necessary to exculpate himself; \"but you were saying something about—about boys being carried to sea against their will.\" \"I didn\u0027t mean anything,\" muttered Peter, regretting that he had put her on the right track. \"But you did, otherwise you would not have said it. For heaven\u0027s sake, tell me what you did mean, and all you meant. Don\u0027t fear to distress me. I can bear anything except this utter uncertainty.\" She looked up earnestly in the old man\u0027s face. Peter was somewhat amused at the idea that he might be afraid to distress her, but decided, on reflection, to tell her that all he chose she should be made acquainted with. \"Sometimes,\" he explained, \"a captain is short of hands, and fills out his number the best way he can. Now perhaps one of the ships at the wharves might have wanted a boy, and the captain might have invited your son on board, and, ha, ha! it almost makes[117] me laugh to think of it, might carry him off before he thought where he was.\" \"Do you laugh at the thought of such a cruel misfortune?\" asked Mrs. Codman, startled from her grief by the old man\u0027s chuckle. \"I—excuse me, I didn\u0027t intend to; but I thought he would be so much surprised when he found out where he was.\" \"And does that seem to you a fitting subject for merriment?\" demanded the outraged mother. The miser cowed beneath her indignant glance, and muttering something unintelligible, slunk away. \"Curse her!\" he muttered, in his quavering tones, \"why can\u0027t I face her like a man? I never could. That was the way when—when she rejected me. But I shall have my revenge yet.\" Strange to say, Peter\u0027s last suggestion produced an effect quite different from that which he anticipated and intended. Days passed, and Charlie did not come; but his mother feeling certain, she hardly knew why,[118] that he had been inveigled on board some vessel, felt sure he would some day return. \"He will write to me as soon as he gets a chance,\" thought the mother, \"and I shall soon see him again.\"","sourceLink":"http://novel.tingroom.com/jingdian/1752/51203.html","bookId":1128,"book":{"id":1128,"title":"Charlie Codman\u0027s Cruise","description":"简介： This scarce antiquarian book is a selection from Kessinger Publishing\u0027s Legacy Reprint Series. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, w...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1752","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
