{"id":22851,"no":34,"title":"XXXIII. A LETTER FROM CHARLIE.","content":"Bert had plenty of capacity. She could get her lessons in an incredibly short time when there was any inducement. At other times she would sit for two or three hours with the book before her, but with her attention straying to other things, and, as a natural consequence, would know no more at the end of that time than at the beginning. Fortunately Mrs. Codman had the gift of patience, and though she was gentle, was, at the same time, firm. Of one thing Bert became convinced,—that study was not so terrible as she had imagined. At the end of three months she had made so great an improvement, that her father was equally surprised and delighted, and was disposed[264] to do full justice to Mrs. Codman\u0027s merits as a governess. \"Who knows but you will become quite a learned lady in time, Bert?\" he said, playfully. \"No doubt of it, papa,\" replied Bert. \"By the time I am eighteen, I expect to wear green glasses and write books.\" \"That will, indeed, be a miraculous transformation. And what is to become of Topsy, then?\" \"Oh, she\u0027ll be an old cat then, and won\u0027t feel any more like racing round than I do. She\u0027ll just curl up in a chair beside me, and I will use her fur to wipe my pens on. She is just the right color for that, you know.\" \"Quite a sensible plan. I confess. Indeed, it will be well for you to have something of that kind to be employed about, as you will probably have no beaux.\" \"No beaux, papa? And why am I to have no beaux, I should like to know?\" \"Because it takes two to make a bargain.\" \"Well, perhaps I sha\u0027n\u0027t,\" replied Bert, tossing her head. \"Perhaps you don\u0027t know that I have picked out my future husband.\" \"Whew! That is getting along faster than I had anticipated. May I be permitted to know who is to be my son-in-law? I think I can guess, however.\" [265] \"Who?\" \"Mr. Bradley.\" Mr. Bradley was an old bachelor, of about fifty, partially bald and more than partially homely, who had now and then dined with Mr. Bowman and had taken more notice of the young lady than she at all desired. \"Mr. Bradley!\" repeated Bert, in a contemptuous manner. \"I\u0027d a good deal rather marry Topsy.\" \"Perhaps,\" suggested her father, \"the superior length of the kitten\u0027s whiskers causes you to give her the preference. Am I to understand that she is your choice?\" \"No, it is a very handsome boy, and his name is Charlie Codman.\" A look of regret stole over Mrs. Codman\u0027s face—the expression of a sorrow caused by her uncertainty with regard to Charlie\u0027s fate. \"A son of yours?\" asked Mr. Bowman, in some surprise. Mrs. Codman replied in the affirmative. \"You ought to see his miniature, papa. He is very handsome.\" \"And you have lost your heart to him. Perhaps he may not return the compliment.\" \"I hope he will,\" said the young lady. \"Perhaps Mrs. Codman will allow me to look at the miniature of my future son-in-law,\"[266] said Mr. Bowman, not guessing the mother\u0027s sorrow and its cause. While Mrs. Codman was absent from the room, Bert gave her father a brief account of Charlie\u0027s disappearance. \"You must pardon me, Mrs. Codman,\" said Mr. Bowman, in a tone of feeling, when she had returned, \"for speaking in the lively tone I did. I little guessed the anxiety you must feel about your son. Is this the miniature?\" \"A very attractive face!\" he said. \"I don\u0027t wonder at Bert\u0027s taking a fancy to it.\" \"I cannot wonder at your sorrow in losing, even for a time, such a boy as this face seems to indicate,\" he added. \"You think there is a chance of his coming back to me?\" asked Mrs. Codman, anxiously. \"I am hardly prepared to express an opinion on the scanty information which Bert has been able to give me. If you are willing to tell me the story in detail, I will tell you what I think of the chances.\" Mrs. Codman told the story, mentioning, also, the name of Peter Manson, and the language which he had used. \"I sometimes see this man,\" said the merchant, \"and know him by reputation. He is a miser.\" \"He pretends to be very poor.\" [267] \"All pretence. I do not see what object he could have had in spiriting your son away.\" Further conversation followed, but, as might be expected, no satisfactory result was reached. Mrs. Codman, however, felt relieved and more hopeful in the knowledge that her employer knew of her loss, and would do what he could to discover Charlie. It was only a week later that he came into the school-room with a smile upon his face. \"Father, you bring good news; isn\u0027t it so?\" said Bert. \"I hope so.\" Mrs. Codman looked up with a glance of eager inquiry. \"As I took up the morning paper,\" said the merchant, \"my eyes, by chance, ran down the list of advertised letters. Recognizing the name of Mrs. Codman among them, I took the liberty of sending to the office for it. It is post-marked at Rio Janeiro.\" \"Oh, give it to me quick!\" exclaimed Mrs. Codman, in agitation. \"Is it from Charlie?\" asked Bert. \"It is, it is!\" exclaimed the happy mother, as she recognized the familiar handwriting; and too impatient to unseal the letter, she tore it open and devoured the contents. [268] It was the letter which Charlie had commenced on shipboard. We will give the greater part of it. \"Dearest Mother,— \"I hope this letter will reach you in safety, and will relieve you of some of the anxiety you must have felt about your wandering boy. You will start with surprise when you see where this is dated. I am three thousand miles from you, dear mother, but not by my own act. But I must tell you how I came to leave you. (This portion of the letter is omitted.) You mustn\u0027t think I have suffered all the time on board the ship, though it is hard work, and, for some reason, the captain and mate have both been my enemies. I have had one faithful friend, to whom I am very much indebted. He is a rough sailor, and neither educated nor refined, but he has a warm heart, and has been very kind to your boy. Indeed, mother, I don\u0027t know how much trouble I should have had, if it hadn\u0027t been for honest Bill Sturdy. Some time I hope you will have the pleasure of taking him by the hand, and thanking him for all he has done for me. The greatest act of friendship for which I have to thank him I will not write here, but I will tell you some time. [269] \"As we were neither of us treated as well as we ought to be, we have deserted the vessel, and transferred ourselves to a ship bound to Liverpool, and thence to New York; so that it may be some months from now before I see you again. \"I am so afraid you have suffered since I left you, not only from solitude and anxiety about me, but have been compelled to labor beyond your strength. You were so poorly paid for that horrid sewing, and had to work so hard at it. But when I come back we will live together, as we once did; and though it will not be a luxurious home, it shall be a happy one. As you may have moved elsewhere, you must leave word with those who occupy our old room where you live, so that when I come back, which will be just as soon as I can, I may come at once to you, and tell you how much I have missed you. \"From your affectionate, \"Charlie.\" Knowing that Mr. Bowman felt a friendly interest in Charlie\u0027s welfare, Mrs. Codman, her eyes dim with happy tears, handed him the letter, which he read attentively. \"A very good letter,\" he said, \"and very creditable to the writer. When he returns,[270] if you and he are both willing, I will receive him at once into my counting-room. His letter is sufficient recommendation.\" How differently the world looks according to the mood in which we view it. No one could have convinced Mrs. Codman, after the reception of this letter, that it was not a perfect paradise. The patient sorrow which her face had worn the day before, gave place to a sweet and happy expression, which made her look quite charming. \"Mrs. Codman is really a beautiful woman,\" thought Mr. Bowman, as unobserved, he watched her laughing with Bert, glancing over the newspaper which he was supposed to be reading.","sourceLink":"http://novel.tingroom.com/jingdian/1752/51224.html","bookId":1128,"book":{"id":1128,"title":"Charlie Codman\u0027s Cruise","description":"简介： This scarce antiquarian book is a selection from Kessinger Publishing\u0027s Legacy Reprint Series. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, w...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1752","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
