{"id":80569,"no":35,"title":"Page 35","content":"“I need the book by tonight.” I narrowed my eyes. “I’ll call you when I have it.” “Time is running out for all of us, Ayd.” I scooped up my bag and pushed away from the table. “It’s a good thing I’ve always been fast then.” I made him write a contact number down on a napkin before leaving the coffee shop. When I got to the Jeep, the first thing I did was call home. I asked my mom a hundred and one times if she had anyway for me to contact Asa, but she stonewalled me at every turn. I tried to let her know just how bad things were, that she might be in danger, but as usual she just blew me off and told me that moving to the city had made me paranoid. I called the strange Kentucky number on my phone over and over again. I even texted it a couple of times, but there was no response. I was going to freak out, and have a hissy fit because I couldn’t start to fix things if I couldn’t get my hands on Asa in the first place. I was about to bang my head on the steering wheel and scream in frustration, when a lightbulb went off. I called Adam with shaking hands, and felt even worse when I heard the genuine pleasure in his voice when he answered. “Hey, Ayd. I didn’t think I would be hearing from you anymore. Is everything okay?” I closed my eyes and rested my forehead on the steering wheel. I felt so cold, and not from the chilly Denver weather, just cold and frozen from how everything in my once perfectly normal life was going. “No, no, nothing is okay.” I didn’t mean to blurt that out, but I couldn’t control myself. “Uh, is there anything I can do for you? Are you all right?” This guy was just inherently nice, just a good guy all around and it made me feel even worse that I just couldn’t return his affection. It also made it pretty clear that whatever I had with Jet was just so much bigger, so much more consuming than anything I was ever going to have with anyone else, and I had just walked away from it. My heart folded in on itself and made me gasp in acute pain. “I just need to know if you’ve heard from my brother. He’s a pretty friendly guy and I figured since he was in town, he might have made good on his threat to get in touch with you if he was bored.” There was silence on the other end of the phone and I had to restrain myself from tossing it against the windshield. “Is that all? You sound pretty bad, Ayd.” “Things with Jet didn’t exactly work out, and I’m having a hard time with it right now.” He cleared his throat and it rasped across my skin like a bunch of tiny razors. “I have to say I’m kind of surprised to hear that. As much as I wanted things to work out between us, I think it was always pretty clear that there was someone else you would rather be with. I just figured out it was him on Valentine’s Day, but I feel like I should have seen it sooner.” “Unfortunately, things don’t always go the way we plan. But seriously, I really need to find Asa and he didn’t tell me where he was staying. I can’t get him on the phone.” Adam was quiet again and I found myself holding my breath. Finally, he sighed so heavily that I could feel it hit me through the phone line. “I met him at a hotel across the highway a few days ago for a drink. He’s staying at the one over by the stadium. I like your brother, Ayden. He seems like a really nice guy and he says he’s just worried about you being out here all alone, without any family to watch out for you.” Oh, Asa was the nicest guy in the world all right, when he wanted something from you, and the only thing he was worried about was how I was going to help him out of his latest jam. “Did he ask you for money?” If Adam had already played the role Asa had scoped him out for, I was going to be screwed. There was no way he was going to stick around and barter with me if he already had cash in hand. Adam sighed again and this time it annoyed me. Granted I would probably always feel bad for wasting his time for so long, but I had life-and-death matters at hand, and I needed him to be on board with things, and the sooner the better. “No. He did ask how much you were working and a bunch a questions about what your days looked like. Like I said, I think he’s just concerned about you. He made it sound like you don’t make too much of an effort to stay in touch with your family back home.” I could hear the disapproval in his tone, but I didn’t let it bother me. Adam had never even gotten close to the heart of me, so it was all right that he thought I was just a bad sister and a bad daughter. Things were beginning to be clear to me now. All the parts of me that I had hated, and had buried so far down, were the parts that were responsible for me being all the great things I was today. If wonderful people like Shaw and Cora and a guy like Jet could care about me, then both parts of me deserved a break, finally. “Okay, thanks, Adam. You take care.” “Hey, Ayd.” All I wanted to do was hang up and go find Asa, but I couldn’t do that to him, not when he had never done anything but care about me. “When you’re ready, when things with the rocker don’t seem as painful, maybe give me a call.” My hand clenched reflexively on the phone. The idea of going back to Adam, that he still wanted me, should have made me giddy. He was the picture-perfect mate for my dream future, but the thought of being with anyone who didn’t have black-velvet eyes and a voice that made me quiver and shake, made my skin crawl. Jet was going to be it for me, and I was just going to have to learn to live with the fact that I had let him go. “Thanks, Adam, but I don’t think I’m going to be ready for any kind of relationship anytime soon.” “Well, even if you need a friend, I’m here.” I ended the call and tossed the phone onto the passenger seat. I felt turned inside out but things were bright and clear, and the direction I had to go was sharp and defined. For the first time since I came to Denver, I felt like I wasn’t living a lie. I drove across town to the other side of the interstate, where all the hotels and motels next to Sports Authority field were located. The entire way, I kept an eye on the rearview mirror to make sure Silas wasn’t following me. The hotels here weren’t as nice as the places downtown, but they were right up Asa’s alley. I found the hotel Adam had mentioned and went inside. I knew no one would just give me my brother’s room number, but luckily I had watched him enough to know that if there was a pretty girl behind the counter, she would undoubtedly have fallen victim to his charms by now. There was a redhead who looked a couple years younger than me who fit the bill perfectly. She looked fresh-faced and sweet, the perfect victim for all of Asa’s machinations. I plastered a pleasant smile on my face and waited until she was alone at the desk. I crossed my arms on the counter and tried to look as innocent and unthreatening as possible. I made sure my accent was on in full force so that there would be no mistaking that Asa and I were related. “Hey there. I’m supposed to be meeting my brother here. I just got into town and I forgot what room he’s staying in. Do ya think ya can help me out?” I saw her look at me in surprise. The eyes were enough that anyone would know Asa and I were brother and sister, but the different hair color could be misleading. She bit her lip and looked from side to side. “What’s your brother’s name?” I smiled even bigger. “Asa Cross. He’s a handsome devil, and I just know he would be so grateful if you helped me out. Denver is a lot bigger than the city we come from, and I’ve been feeling a little overwhelmed so any help would sure be appreciated.” I made sure to layer on the yokel as thick as I could and batted my eyelashes at her. I should feel guilty for being another person who was manipulating her to get what she wanted, but my end game was more important than her feelings. She fiddled with her hair and continued to look around, like she was afraid of getting caught doing something wrong. “Um, I’m not allowed to give out room numbers, but I can call up and let him know you’re here, and you can ask him what room he’s in.” I didn’t trust Asa as far as I could throw him, but I figured he was going to want to hear what I had to say, so I nodded in agreement and kept an eye on the lobby for any sign of trouble. The girl made the call and it only took a moment for her to smile at me and blush at whatever my brother was telling her on the other end of the phone. She giggled, which made my skin crawl, and scribbled something on a piece of paper. “He said he’s been expecting you and he’s so glad you finally made it.” She put a hand over her chest and leaned a little over the counter, making me rear back to avoid having her right in my face. “He is so cute, and nice. My name is Heather. Feel free to let him know I was super excited to help you out.” I gritted my teeth and forced my smile to stay friendly and not turn nasty. “Well, thank you, Heather, I’ll be sure to pass that along. You were just a doll.” I snatched the paper with the room number on it and almost ran to the elevator. I knew where he was, now I just had to get him to let me in. The ride to the floor he was on felt like it took forever and somewhere along the way, a woman with a crying toddler got on, and kept apologizing for the kid. I wanted to tell her that I understood, because on the inside I was just as upset, crying just as loud as her baby, but I just smiled and shrugged at her to let her know it was just part of life. When I found Asa’s room I stood in front of the door for a second trying to decide the best course of action, if he decided not to let me in, but it turned out I was worrying for nothing. Just as I was raising my fist to pound on the door, it opened and I found myself being yanked inside by my wrist. I stumbled a little, which made Asa laugh, and I wanted to slug him on principle alone. He had on sweatpants and looked rumpled and well rested, not at all like he had a herd of angry bikers all over his ass, demanding retribution. “What’s going on, sis? Took you long enough to find me.” I shoved him away from me, and stalked into the room so I could flop down on the edge of the unmade bed. “Silas is here.” I saw his eyes open wide and he began to pace back and forth in front of me. “He’s been here waiting for you to show up. He told me about the book, about the biker gang. What were you thinking, you idiot?” Eyes that looked just like my own flared with heat as he glared at me. “I was thinking that book has every marker, every debt owed, in every county in the south. Do you have any idea how much power that is? Do you know what I can do with that information? It’s more than a get-out-of-jail-free card; it’s a move-out-of-the-trailer-park-and-play-with-the-big-boys card. It was one of the smartest things I’ve ever done. I can take care of Mama with it, I can make sure none of us ever has to work for anything ever again with it. You could come home and we could be a family again with it.” I wondered if he actually cared about Mom at all, or if he was just using that as an excuse, and I had no idea he thought I was ever returning to Woodward. Asa was a pretty man with pretty words, and that was what had always made him so dangerous.","sourceLink":"https://allnovel.net/jet-marked-men-2/page-35.html","bookId":2730,"book":{"id":2730,"title":"Jet (Marked Men #2)","description":"Storyline: Jet (Marked Men #2) With his tight leather pants and a sharp edge that makes him dangerous, Jet Keller is every girl’s rock and roll fantasy. But Ayden Cross is done walking on the wild side with bad boys. She doesn’t want to give in to the heat she sees in Jet’s dark, haunted eyes. She’s afraid of getting burned from the sparks of their spontaneous combustion, even as his touch sets her on fire. Jet can’t resist the Southern Belle with mile-long legs in cowboy boots who defies his every expectation. Yet the closer he feels to Ayden, the less he seems to know her. While he’s tempted to get under her skin and undo her in every way, he knows firsthand what happens to two people with very different ideas about relationships. Will the blaze burn into an enduring love. . . or will it consume their dreams and turn them to ashes?","cover":"https://allnovel.net/images/jet-marked-men-2.jpg","author":"Jay Crownover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/jet-marked-men-2.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:25:52 PM"}}
