{"id":7369,"no":17,"title":"Chapter 16","content":"16:1 [hgb] 亚 伦 的 两 个 儿 子 近 到 耶 和 华 面 前 死 了 。 死 了 之 后 ， 耶 和 华 晓 谕 摩 西 说 ， [kjv] And the LORD spake unto Moses after the death of the two sons of Aaron, when they offered before the LORD, and died; [bbe] And the Lord said to Moses, after the death of the two sons of Aaron when they took in strange fire before the Lord and death overtook them; 16:2 [hgb] 要 告 诉 你 哥 哥 亚 伦 ， 不 可 随 时 进 圣 所 的 幔 子 内 ， 到 柜 上 的 施 恩 座 前 ， 免 得 他 死 亡 ， 因 为 我 要 从 云 中 显 现 在 施 恩 座 上 。 [kjv] And the LORD said unto Moses, Speak unto Aaron thy brother, that he come not at all times into the holy place within the vail before the mercy seat, which is upon the ark; that he die not: for I will appear in the cloud upon the mercy seat. [bbe] The Lord said to Moses, Say to Aaron, your brother, that he may not come at all times into the holy place inside the veil, before the cover which is on the ark, for fear that death may overtake him; for I will be seen in the cloud on the cover of the ark. 16:3 [hgb] 亚 伦 进 圣 所 ， 要 带 一 只 公 牛 犊 为 赎 罪 祭 ， 一 只 公 绵 羊 为 燔 祭 。 [kjv] Thus shall Aaron come into the holy place: with a young bullock for a sin offering, and a ram for a burnt offering. [bbe] Let Aaron come into the holy place in this way: with an ox for a sin-offering and a male sheep for a burned offering. 16:4 [hgb] 要 穿 上 细 麻 布 圣 内 袍 ， 把 细 麻 布 裤 子 穿 在 身 上 ， 腰 束 细 麻 布 带 子 ， 头 戴 细 麻 布 冠 冕 ， 这 都 是 圣 服 。 他 要 用 水 洗 身 ， 然 后 穿 戴 。 [kjv] He shall put on the holy linen coat, and he shall have the linen breeches upon his flesh, and shall be girded with a linen girdle, and with the linen mitre shall he be attired: these are holy garments; therefore shall he wash his flesh in water, and so put them on. [bbe] Let him put on the holy linen coat, and the linen trousers on his body, and the linen band round him, and the linen head-dress on his head; for this is holy clothing, and before he puts them on his body is to be washed with water. 16:5 [hgb] 要 从 以 色 列 会 众 取 两 只 公 山 羊 为 赎 罪 祭 ， 一 只 公 绵 羊 为 燔 祭 。 [kjv] And he shall take of the congregation of the children of Israel two kids of the goats for a sin offering, and one ram for a burnt offering. [bbe] And let him take from the children of Israel two he-goats for a sin-offering and one male sheep for a burned offering. 16:6 [hgb] 亚 伦 要 把 赎 罪 祭 的 公 牛 奉 上 ， 为 自 己 和 本 家 赎 罪 。 [kjv] And Aaron shall offer his bullock of the sin offering, which is for himself, and make an atonement for himself, and for his house. [bbe] And Aaron is to give the ox of the sin-offering for himself, to make himself and his house free from sin. 16:7 [hgb] 也 要 把 两 只 公 山 羊 安 置 在 会 幕 门 口 ， 耶 和 华 面 前 ， [kjv] And he shall take the two goats, and present them before the LORD at the door of the tabernacle of the congregation. [bbe] And he is to take the two goats and put them before the Lord at the door of the Tent of meeting. 16:8 [hgb] 为 那 两 只 羊 拈 阄 ， 一 阄 归 与 耶 和 华 ， 一 阄 归 与 阿 撒 泻 勒 。 [kjv] And Aaron shall cast lots upon the two goats; one lot for the LORD, and the other lot for the scapegoat. [bbe] And Aaron will make selection from the two goats by the decision of the Lord, one goat for the Lord and one for Azazel. 16:9 [hgb] 亚 伦 要 把 那 拈 阄 归 与 耶 和 华 的 羊 献 为 赎 罪 祭 ， [kjv] And Aaron shall bring the goat upon which the LORD\u0027s lot fell, and offer him for a sin offering. [bbe] And the goat which is marked out for the Lord, let Aaron give for a sin-offering. 16:10 [hgb] 但 那 拈 阄 归 与 阿 撒 泻 勒 的 羊 要 活 着 安 置 在 耶 和 华 面 前 ， 用 以 赎 罪 ， 打 发 人 送 到 旷 野 去 ， 归 与 阿 撒 泻 勒 。 [kjv] But the goat, on which the lot fell to be the scapegoat, shall be presented alive before the LORD, to make an atonement with him, and to let him go for a scapegoat into the wilderness. [bbe] But the goat for Azazel is to be placed living before the Lord, for the taking away of sin, that it may be sent away for Azazel into the waste land. 16:11 [hgb] 亚 伦 要 把 赎 罪 祭 的 公 牛 牵 来 宰 了 ， 为 自 己 和 本 家 赎 罪 。 [kjv] And Aaron shall bring the bullock of the sin offering, which is for himself, and shall make an atonement for himself, and for his house, and shall kill the bullock of the sin offering which is for himself: [bbe] And Aaron is to give the ox of the sin-offering for himself and take away sin from himself and his house, and put to death the ox of the sin-offering which is for himself. 16:12 [hgb] 拿 香 炉 ， 从 耶 和 华 面 前 的 坛 上 盛 满 火 炭 ， 又 拿 一 捧 捣 细 的 香 料 ， 都 带 入 幔 子 内 ， [kjv] And he shall take a censer full of burning coals of fire from off the altar before the LORD, and his hands full of sweet incense beaten small, and bring it within the vail: [bbe] And he is to take a vessel full of burning coal from the altar before the Lord and in his hand some sweet perfume crushed small, and take it inside the veil; 16:13 [hgb] 在 耶 和 华 面 前 ， 把 香 放 在 火 上 ， 使 香 的 烟 云 遮 掩 法 柜 上 的 施 恩 座 ， 免 得 他 死 亡 。 [kjv] And he shall put the incense upon the fire before the LORD, that the cloud of the incense may cover the mercy seat that is upon the testimony, that he die not: [bbe] And let him put the perfume on the fire before the Lord so that the ark may be covered with a cloud of the smoke of the perfume, in order that death may not overtake him. 16:14 [hgb] 也 要 取 些 公 牛 的 血 ， 用 指 头 弹 在 施 恩 座 的 东 面 ， 又 在 施 恩 座 的 前 面 弹 血 七 次 。 [kjv] And he shall take of the blood of the bullock, and sprinkle it with his finger upon the mercy seat eastward; and before the mercy seat shall he sprinkle of the blood with his finger seven times. [bbe] And let him take some of the blood of the ox, shaking drops of it from his finger on the cover of the ark on the east side, and before it, seven times. 16:15 [hgb] 随 后 他 要 宰 那 为 百 姓 作 赎 罪 祭 的 公 山 羊 ， 把 羊 的 血 带 入 幔 子 内 ， 弹 在 施 恩 座 的 上 面 和 前 面 ， 好 像 弹 公 牛 的 血 一 样 。 [kjv] Then shall he kill the goat of the sin offering, that is for the people, and bring his blood within the vail, and do with that blood as he did with the blood of the bullock, and sprinkle it upon the mercy seat, and before the mercy seat: [bbe] Then let him put to death the goat of the sin-offering for the people, and take its blood inside the veil and do with it as he did with the blood of the ox, shaking drops of it on and before the cover of the ark. 16:16 [hgb] 他 因 以 色 列 人 诸 般 的 污 秽 ， 过 犯 ， 就 是 他 们 一 切 的 罪 愆 ， 当 这 样 在 圣 所 行 赎 罪 之 礼 ， 并 因 会 幕 在 他 们 污 秽 之 中 ， 也 要 照 样 而 行 。 [kjv] And he shall make an atonement for the holy place, because of the uncleanness of the children of Israel, and because of their transgressions in all their sins: and so shall he do for the tabernacle of the congregation, that remaineth among them in the midst of their uncleanness. [bbe] And let him make the holy place free from whatever is unclean among the children of Israel and from their wrongdoing in all their sins; and let him do the same for the Tent of meeting, which has its place among an unclean people. 16:17 [hgb] 他 进 圣 所 赎 罪 的 时 候 ， 会 幕 里 不 可 有 人 ， 直 等 到 他 为 自 己 和 本 家 并 以 色 列 全 会 众 赎 了 罪 出 来 。 [kjv] And there shall be no man in the tabernacle of the congregation when he goeth in to make an atonement in the holy place, until he come out, and have made an atonement for himself, and for his household, and for all the congregation of Israel. [bbe] And no man may be in the Tent of meeting from the time when Aaron goes in to take away sin in the holy place till he comes out, having made himself and his house and all the people of Israel free from sin. 16:18 [hgb] 他 出 来 ， 要 到 耶 和 华 面 前 的 坛 那 里 ， 在 坛 上 行 赎 罪 之 礼 ， 又 要 取 些 公 牛 的 血 和 公 山 羊 的 血 ， 抹 在 坛 上 四 角 的 周 围 。 [kjv] And he shall go out unto the altar that is before the LORD, and make an atonement for it; and shall take of the blood of the bullock, and of the blood of the goat, and put it upon the horns of the altar round about. [bbe] And he is to go out to the altar which is before the Lord and make it free from sin; and he is to take some of the blood of the ox and the blood of the goat and put it on the horns of the altar and round it; 16:19 [hgb] 也 要 用 指 头 把 血 弹 在 坛 上 七 次 ， 洁 净 了 坛 ， 从 坛 上 除 掉 以 色 列 人 诸 般 的 污 秽 ， 使 坛 成 圣 。 [kjv] And he shall sprinkle of the blood upon it with his finger seven times, and cleanse it, and hallow it from the uncleanness of the children of Israel. [bbe] Shaking drops of the blood from his finger on it seven times to make it holy and clean from whatever is unclean among the children of Israel. 16:20 [hgb] 亚 伦 为 圣 所 和 会 幕 并 坛 献 完 了 赎 罪 祭 ， 就 要 把 那 只 活 着 的 公 山 羊 奉 上 。 [kjv] And when he hath made an end of reconciling the holy place, and the tabernacle of the congregation, and the altar, he shall bring the live goat: [bbe] And when he has done whatever is necessary to make the holy place and the Tent of meeting and the altar free from sin, let him put the living goat before the Lord; 16:21 [hgb] 两 手 按 在 羊 头 上 ， 承 认 以 色 列 人 诸 般 的 罪 孽 过 犯 ， 就 是 他 们 一 切 的 罪 愆 ， 把 这 罪 都 归 在 羊 的 头 上 ， 借 着 所 派 之 人 的 手 ， 送 到 旷 野 去 。 [kjv] And Aaron shall lay both his hands upon the head of the live goat, and confess over him all the iniquities of the children of Israel, and all their transgressions in all their sins, putting them upon the head of the goat, and shall send him away by the hand of a fit man into the wilderness: [bbe] And Aaron, placing his two hands on the head of the living goat, will make a public statement over him of all the evil doings of the children of Israel and all their wrongdoing, in all their sins; and he will put them on the head of the goat and send him away, in the care of a man who will be waiting there, into the waste land. 16:22 [hgb] 要 把 这 羊 放 在 旷 野 ， 这 羊 要 担 当 他 们 一 切 的 罪 孽 ， 带 到 无 人 之 地 。 [kjv] And the goat shall bear upon him all their iniquities unto a land not inhabited: and he shall let go the goat in the wilderness. [bbe] And the goat will take all their sins into a land cut off from men, and he will send the goat away into the waste land. 16:23 [hgb] 亚 伦 要 进 会 幕 ， 把 他 进 圣 所 时 所 穿 的 细 麻 布 衣 服 脱 下 ， 放 在 那 里 ， [kjv] And Aaron shall come into the tabernacle of the congregation, and shall put off the linen garments, which he put on when he went into the holy place, and shall leave them there: [bbe] Then let Aaron come into the Tent of meeting and take off the linen clothing which he put on when he went into the holy place, and put them down there; 16:24 [hgb] 又 要 在 圣 处 用 水 洗 身 ， 穿 上 衣 服 ， 出 来 ， 把 自 己 的 燔 祭 和 百 姓 的 燔 祭 献 上 ， 为 自 己 和 百 姓 赎 罪 。 [kjv] And he shall wash his flesh with water in the holy place, and put on his garments, and come forth, and offer his burnt offering, and the burnt offering of the people, and make an atonement for himself, and for the people. [bbe] And after bathing his body in water in a holy place, he is to put on his clothing and come out and give his burned offering and the burned offering of the people, to take away his sin and the sin of the people. 16:25 [hgb] 赎 罪 祭 牲 的 脂 油 要 在 坛 上 焚 烧 。 [kjv] And the fat of the sin offering shall he burn upon the altar. [bbe] And the fat of the sin-offering is to be burned by him on the altar. 16:26 [hgb] 那 放 羊 归 与 阿 撒 泻 勒 的 人 要 洗 衣 服 ， 用 水 洗 身 ， 然 后 进 营 。 [kjv] And he that let go the goat for the scapegoat shall wash his clothes, and bathe his flesh in water, and afterward come into the camp. [bbe] And the man who takes away the goat for Azazel is to have his clothing washed and his body bathed in water and then he may come back to the tent-circle. 16:27 [hgb] 作 赎 罪 祭 的 公 牛 和 公 山 羊 的 血 既 带 入 圣 所 赎 罪 ， 这 牛 羊 就 要 搬 到 营 外 ， 将 皮 ， 肉 ， 粪 用 火 焚 烧 。 [kjv] And the bullock for the sin offering, and the goat for the sin offering, whose blood was brought in to make atonement in the holy place, shall one carry forth without the camp; and they shall burn in the fire their skins, and their flesh, and their dung. [bbe] And the ox of the sin-offering and the goat of the sin-offering, whose blood was taken in to make the holy place free from sin, are to be taken away outside the tent-circle and their skins and their flesh and their waste are to be burned with fire. 16:28 [hgb] 焚 烧 的 人 要 洗 衣 服 ， 用 水 洗 身 ， 然 后 进 营 。 [kjv] And he that burneth them shall wash his clothes, and bathe his flesh in water, and afterward he shall come into the camp. [bbe] And the man by whom they are burned is to have his clothing washed and his body bathed in water, and then he may come back to the tent-circle. 16:29 [hgb] 每 逢 七 月 初 十 日 ， 你 们 要 刻 苦 己 心 ， 无 论 是 本 地 人 ， 是 寄 居 在 你 们 中 间 的 外 人 ， 什 么 工 都 不 可 作 ， 这 要 作 你 们 永 远 的 定 例 。 [kjv] And this shall be a statute for ever unto you: that in the seventh month, on the tenth day of the month, ye shall afflict your souls, and do no work at all, whether it be one of your own country, or a stranger that sojourneth among you: [bbe] And let this be an order to you for ever: in the seventh month, on the tenth day, you are to keep yourselves from pleasure and do no sort of work, those who are Israelites by birth and those from other lands who are living among you: 16:30 [hgb] 因 在 这 日 要 为 你 们 赎 罪 ， 使 你 们 洁 净 。 你 们 要 在 耶 和 华 面 前 得 以 洁 净 ， 脱 尽 一 切 的 罪 愆 。 [kjv] For on that day shall the priest make an atonement for you, to cleanse you, that ye may be clean from all your sins before the LORD. [bbe] For on this day your sin will be taken away and you will be clean: you will be made free from all your sins before the Lord. 16:31 [hgb] 这 日 你 们 要 守 为 圣 安 息 日 ， 要 刻 苦 己 心 ， 这 为 永 远 的 定 例 。 [kjv] It shall be a sabbath of rest unto you, and ye shall afflict your souls, by a statute for ever. [bbe] It is a special Sabbath for you, and you are to keep yourselves from pleasure; it is an order for ever. 16:32 [hgb] 那 受 膏 ， 接 续 他 父 亲 承 接 圣 职 的 祭 司 要 穿 上 细 麻 布 的 圣 衣 ， 行 赎 罪 之 礼 。 [kjv] And the priest, whom he shall anoint, and whom he shall consecrate to minister in the priest\u0027s office in his father\u0027s stead, shall make the atonement, and shall put on the linen clothes, even the holy garments: [bbe] And the man on whose head the holy oil has been put, and who has been marked out to be a priest in his father\u0027s place, will do what is necessary to take away sin, and will put on the linen clothing, even the holy robes: 16:33 [hgb] 他 要 在 至 圣 所 和 会 幕 与 坛 行 赎 罪 之 礼 ， 并 要 为 众 祭 司 和 会 众 的 百 姓 赎 罪 。 [kjv] And he shall make an atonement for the holy sanctuary, and he shall make an atonement for the tabernacle of the congregation, and for the altar, and he shall make an atonement for the priests, and for all the people of the congregation. [bbe] And he will make the holy place and the Tent of meeting and the altar free from sin; he will take away sin from the priests and from all the people. 16:34 [hgb] 这 要 作 你 们 永 远 的 定 例 就 是 因 以 色 列 人 一 切 的 罪 ， 要 一 年 一 次 为 他 们 赎 罪 。 于 是 ， 亚 伦 照 耶 和 华 所 吩 咐 摩 西 的 行 了 。 [kjv] And this shall be an everlasting statute unto you, to make an atonement for the children of Israel for all their sins once a year. And he did as the LORD commanded Moses. [bbe] And let this be an order for ever for you, so that the sin of the children of Israel may be taken away once every year. And he did as the Lord gave orders to Moses.","sourceLink":"http://novel.tingroom.com/zongjiao/19/447.html","bookId":241,"book":{"id":241,"title":"Leviticus利未记（双语小说）","description":"简介： And the LORD called unto Moses, and spake unto him out of the tabernacle of the congregation, saying, Speak unto the children of Israel, and say unto them, If any man of you bring an offering unto the LORD, ye shal...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/19","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:53 AM"}}
