{"id":70331,"no":13,"title":"Page 13","content":"Jerry frowned, then sighed with resignation. “What’s he done?”\\n\\n “Everything… Listen, I don’t want to get into this. Let me make this as plain and simple as I can. I think it’s time he moved out of the condo. One of us has to and it’s either him or me.”\\n\\n Six\\n\\n “You want Alek out of your condo?” Jerry repeated.\\n\\n “You heard me the first time,” she said impatiently. “Our marriage has been sanctioned by the government. What reason do we have to continue this charade?”\\n\\n “Julia…”\\n\\n She’d heard that tone all too often. “Jerry, I’m not in any mood to argue with you.” She walked around her desk and claimed her seat. Reaching for a file from her in-basket, she opened it. “I’ll leave the arrangements in your hands.”\\n\\n “Do you plan to talk this over with Alek?”\\n\\n She hadn’t thought of that. “It…won’t be necessary. He’ll get the picture once he hears from you.”\\n\\n “I won’t do it.”\\n\\n Her brother’s refusal caught her attention as nothing else could have. “What do you mean, you won’t do it?”\\n\\n “First, I won’t have you treating Alek as though he’s…some pest you’re trying to get rid of.”\\n\\n “It wouldn’t be like that,” she insisted, realizing even as she spoke that Jerry was right. She couldn’t treat Alek this way.\\n\\n “Secondly,” her brother said, “it’d be crazy to throw everything away now. You think that just because you’ve passed some interview with an Immigration official, you’re in the clear. Think again, Julia. That’s exactly the kind of thing the government’s expecting.”\\n\\n “They won’t know.”\\n\\n “Don’t count on it. They make it their business to know.”\\n\\n “Jerry, please.” She rarely pleaded with her brother. “The man’s impossible.… I’ve done my duty. What more do you expect of me?”\\n\\n “Alek is your husband.”\\n\\n “You’re beginning to sound just like him! He frightens me.… He makes me feel things I don’t want to feel. I’m scared, Jerry, really scared.” Close to tears, she covered her mouth, fearing she’d break down.\\n\\n “I don’t know what to do,” Jerry said with a sympathetic shrug. “I wish I did, for your sake. Alek’s, too.”\\n\\n With nothing left to say, he returned to his own office.\\n\\n Her mood didn’t improve when two hours later Alek unexpectedly showed up. He walked into her office without waiting for her assistant to announce him. Julia happened to be on the phone at the time and she glanced up, irritated by the intrusion. Alek glared at her, and every minute she delayed appeared to infuriate him further.\\n\\n He began to pace, pausing every other step to turn and scowl in her direction.\\n\\n Julia finished her conversation as quickly as she could without being rude—and without letting him believe he was intimidating her.\\n\\n “You wanted something?” she asked calmly as she replaced the receiver.\\n\\n Anger was etched on his features. “Yes, I do. I understand you spoke to Jerry this morning about one of us moving. I want to know what’s going on in that head of yours.”\\n\\n Julia folded her hands on her desk. “It seemed the logical thing to do.”\\n\\n “Why?”\\n\\n She stood, feeling at a distinct disadvantage sitting. “It makes sense. The only reason we were living together was for show because—”\\n\\n “We’re living together, my dear wife, because we’re married.”\\n\\n “In name only.”\\n\\n He muttered something blistering in Russian, and Julia was grateful she couldn’t understand him.\\n\\n “You deny your vows. You abuse my pride by involving your brother. You ask for patience and then stab me in the back.”\\n\\n “I…explained on our wedding day that I need time. I let you know you were being cheated in this marriage. You can’t say I didn’t warn you.” Contacting Jerry had been wrong, she saw now. But she was frightened and growing more so each day. No longer could she ignore the powerful attraction she felt for Alek. No longer could she ignore his touch. He was chipping away at the barrier she’d erected to protect herself from feelings. From love. He was working his way into her life and her heart. She had to do something.\\n\\n “You are my wife,” Alek shouted.\\n\\n Julia closed her eyes at the anger in his voice.\\n\\n “I’m not a very good one,” she whispered.\\n\\n “We are married, Julia. When will you accept that?” He turned away from her and stalked to the door.\\n\\n “I…don’t know if I can.”\\n\\n At her words, he spun around.\\n\\n They stood no more than a few feet apart, yet an ocean might have lain between them. He was furious with her and she with him.\\n\\n “I may never be your wife in the way you want.” Julia didn’t know what drove her to say that.\\n\\n And yet, at the same moment, she realized she wanted him. Needed him. And that frightened her half to death.\\n\\n “You’re afraid, aren’t you?” he asked as if he could read her thoughts. “Afraid you aren’t woman enough to satisfy me. That’s what’s behind all this, isn’t it? That, and the fact that you’re afraid to trust another man. But I’m not like the one who hurt you, Julia, whoever he was. I’m not like him at all. I respect you—and I want you. Which, if you’re honest, is how you feel about me, too.”\\n\\n Stricken, Julia closed her eyes. It felt as if he’d blinded her with the truth, identified her fears, hurled them at her to explain or reject.\\n\\n “Julia?”\\n\\n She sobbed once, the sound nearly hysterical as she backed away from him.\\n\\n “I didn’t mean…” he began.\\n\\n She stopped him by holding out her arm.\\n\\n He cursed under his breath, and reaching for her, drew her into his arms. She didn’t resist. Without pause he lowered his head and covered her mouth, sealing their lips together in a wild kiss. The craziness increased with each impatient twist of their heads, growing in frenzied desperation.\\n\\n Her breasts tingled and her body grew hot as his powerful hands held her against him. It was where she wanted to be.…\\n\\n His hands were busy with the zipper at the back of her straight, no-nonsense business skirt. It hissed as he lowered it. Julia made a token protest, which he cut off with a bone-melting kiss.\\n\\n “I’m through fighting you,” he whispered. “Will you stop fighting me?”\\n\\n He gently brought his mouth back to hers. They were so close Julia felt as if they were drawing in the same breath, as if they required only one heart to beat between them.\\n\\n Sobbing, she slid her arms around his neck and buried her face, taking deep, uneven breaths. Not understanding her own desperate need, she clung to him as a low cry emerged from her lips. The grief she felt was overwhelming. She was lamenting the wasted years, when she’d closed herself off from life. Ever since her father’s death and Roger’s betrayal, she’d lived in limbo, rejecting love and laughter. Rejecting and punishing herself.\\n\\n “Julia,” Alek whispered, stroking her hair, “what is it?”\\n\\n She shook her head, unable to answer.\\n\\n “Say it,” he told her softly, sitting in her chair and taking her with him so she was nestled in his lap. “Tell me you need me. Tell me you want me, too.”\\n\\n She sobbed and with tears streaming down her face, she nodded.\\n\\n “That’s not good enough. I want the words.”\\n\\n “I…need you. Oh, Alek, I’m so scared.”\\n\\n He held her, kissed her gently, reassured her while she rested her head on his shoulder and cried until her tears were spent.\\n\\n “I don’t know why you put up with me,” she finally gasped.\\n\\n “You don’t?” he asked, chuckling softly. “I have the feeling you’ll figure it out soon enough, my love.”\\n\\n Her intercom hummed and Virginia’s voice echoed through the silence. “Your nine-thirty appointment is here.”\\n\\n Her eyes regretfully met Alek’s.\\n\\n “Send whoever it is away,” Alek urged.\\n\\n “I…I can’t do that.”\\n\\n “I know,” he said, and kissed the tip of her nose. He released her slowly.\\n\\n Just when Julia was convinced her day couldn’t possibly get any more complicated, she received a call from Virginia Mason Hospital. Her grandmother had slipped into a coma.\\n\\n Jerry was away, so she left a message for him and for Alek, canceled her appointments for the rest of the day and drove directly to the hospital.\\n\\n Julia realized the instant she walked into her grandmother’s room that Ruth’s hold on life was tenuous, a slender thread. Her heart was failing, and Julia felt as though her own heart was in jeopardy, too.\\n\\n In the past few years she’d faced a handful of crises, starting with the fire that had nearly destroyed the business and their family. Her father’s death had followed. Immediately afterward she’d realized Roger had used her, had sold out her family. And her.\\n\\n Ruth, her beloved Ruth, was dying, and Julia was powerless to stop it. She was terrified. For the past months she’d watched helplessly as her grandmother’s health deteriorated.\\n\\n Sitting at Ruth’s bedside now, Julia could almost hear the older woman’s calming voice. “My death is inevitable—” the unspoken words rang in her head “—but not unwelcome.”\\n\\n Silently Julia pleaded with her grandmother to live just a little longer, to give her time to adjust, to grant her a few days to gather her courage. Even as she spoke, Julia recognized how selfish she was being, thinking of herself, of her own pain. But she couldn’t make herself stop praying that God would spare her grandmother.\\n\\n “You have walked through your pain,” the silent voice continued. “The journey has made you wiser and far stronger than you know.”\\n\\n Julia wanted to argue. She didn’t feel strong. Not when it seemed Ruth was about to be taken from her. She felt pushed to the limits, looking both ways—toward despair in one direction and hope in the other, toward doubt and faith.\\n\\n An hour passed as Julia struggled with her grief, refusing to let it overwhelm her. Fear controlled her, the knowledge that if she gave in to her grief, she might never regain her sanity.\\n\\n “Please,” she pleaded aloud, praying Ruth heard her. It was the selfish prayer of a frightened child.\\n\\n Jerry arrived, pale and shaken. “What happened?”\\n\\n Julia shrugged. Their grandmother’s physician, Dr. Silverman, had been in earlier to explain the medical symptoms and reasons. Most of what he’d said had meant only one thing. Ruth was close to death.\\n\\n “She’s in a coma,” Julia answered. “I talked to her doctor earlier. He’s surprised she’s hung on this long.”\\n\\n Her brother pulled out a chair and sat down next to Julia. “I love this old woman, really love her.”\\n\\n “What are we going to do without her, Jerry?”\\n\\n Her brother shook his head. “I don’t know. We’ll make do the way we always have, I suppose.” \\n\\n","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-13.html","bookId":1964,"book":{"id":1964,"title":"An Engagement in Seattle","description":"Storyline: An Engagement in Seattle: Groom Wanted\\Bride Wanted (From This Day Forward #1-2) \\n Aleksandr Berinksi is a Russian biochemist in the U.S. on a visa that is about to expire. Marriage will allow him to stay\u0026#151;marriage to Julia Conrad. If Julia\u0027s going to save her Seattle-based company, she needs him as much as he needs her. There\u0027s a Groom Wanted in Julia\u0027s life. And not just any groom! \\n A billboard on the side of a Seattle road is common enough\u0026#151;but one advertising for a bride? It\u0027s Chase Goodwin\u0027s solution to the problem of finding a wife quickly, a wife to bring home to Alaska. Lesley Campbell has her own reasons for responding\u0026#133;and in no time she\u0027s the Bride Wanted in Chase\u0027s life!\\n","cover":"https://allnovel.net/images/an-engagement-in-seattle.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/an-engagement-in-seattle.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:50 AM"}}
