{"id":70346,"no":21,"title":"Page 21","content":"“Will you always work, Julia?” “I…don’t know. I hadn’t thought about it. I suppose I will until after the children are born at any rate, but even then I’ll still be involved in the management of the company.” “Then you wouldn’t mind if we had a family.” “No, of course I wouldn’t mind. Did you think I would?” “I wasn’t sure.” “Then rest assured, Mr. Berinski, I want your children.” Alek felt his heart expand with eagerness. “So you’d like a family,” he said. “Could we work on this project soon?” “How soon?” she whispered. He fiddled with the buttons of her shirt. “Now,” he said, aware of the husky sound of his voice. Julia sighed that womanly sigh he’d come to recognize as a signal of her eagerness for him. “I think we might be able to arrange that.” “Julia, my love,” Alek said with a groan, “I’m afraid I’ll never get enough of you. What have you done to me? Are you a witch who’s cast some spell over me?” Julia laughed. “If anyone’s cast a spell over anyone, it’s you over me. I’m lonely without you. If we can’t be together, I feel lost and empty. I never thought I could love again, certainly not like this, and you’ve shown me the way.” “Julia.” He rasped her name and, folding her over his arm, bent forward to cover her soft reaching mouth with his. The kiss revealed their need for each other. He heard Julia’s book fall off the sofa and hit the floor, but neither cared. His hands were busy with her shirt and once it was open, she twisted around to face him. “I vote for the bed this time.” “The bed,” he said mockingly. “Where’s your sense of adventure?” Julia laughed softly. “It was used up in the bathtub this morning. Did you know it took me twenty minutes to clean the water off the floor?” He carried her into their bedroom, kissing her all the while. Afterward, they lay on the bed. Julia was sprawled across him. Every now and then she kissed him, or he kissed her. Alek had never known such contentment in his life. It frightened him. Happiness had always been fleeting, and he wasn’t sure he could trust what he’d found with Julia. His hold on her tightened and he closed his eyes and discovered he couldn’t imagine what his life would be like without her now. Bleak and empty, he decided. When Jerry had first suggested this marriage, Alek had set his terms. He wasn’t a believer in the staying power of love. It had always seemed temporary to him, ephemeral, and it came at the expense of everything else. Alek couldn’t claim he’d never been in love before. There’d been a handful of brief relationships over the years, but each time he’d grown bored and restless. He was a disappointment to his mother, who was hoping he and Anna would provide her with grandchildren to spoil. How perceptive his sister was to realize he hadn’t loved Julia in the beginning. He hadn’t expected to ever truly love her. He’d offered her his loyalty and his devotion, but had held his heart in reserve. She had it now, though, in her palm. His heart. His very life. Julia lay across her husband’s body and sighed deeply, completely and utterly content. She’d never known a time like this with a man. A time of peace and discovery. His talk of children had unleashed long-buried dreams. They hadn’t bothered to use protection. Not even once. They each seemed to pretend it didn’t matter, that what would be would be. Pregnant. She said the word in her mind as though it was foreign to her, and in many ways it was. A few weeks ago she would’ve sworn it was impossible; after all, she didn’t intend to sleep with her husband. That had certainly changed, and now, thoughts of a family filled her mind and her heart. Perhaps it was because she’d so recently lost Ruth and because one of the last things her grandmother had said was about children “waiting to be born.” After so many years of pain, Julia hardly knew how to deal with happiness. In some ways she was afraid to trust that it would last. She’d been happy with Roger—and then everything had blown up in her face. The crushing pain of his deception would never leave her, but she’d lost the desire to punish him. Conrad Industries’ success would be revenge enough. There might not have been sufficient evidence to charge him, but people in the business suspected him. They talked. That meant he wasn’t likely to be hired by any other company once he left Ideal Paints—or they fired him. After what had happened, no one else would trust him. Without realizing what he was doing, he’d painted himself in a corner. She smiled at her own pun. “Something amuses you?” Alek asked, apparently having felt her smile. “Yes…and no.” “That sounds rather vague to me.” “Rest,” she urged. “Why?” he challenged. “Do you have something…physical in mind?” Julia grinned again. “If I don’t, I’m sure you do. Now hush, I’m trying to sleep.” “Then I suggest you stop making those little movements.” Julia hadn’t been conscious of moving. “Sorry.” He clamped his hands on her hips. “Don’t be. I’m not.” Julia resumed her daydream. A baby would turn her world upside down. She’d never been very domestic. If her child-rearing skills were on the level of her cooking skills, then she— “Now you’re frowning.” Alek murmured. “What’s wrong?” “I…I was just thinking I might not be a very good mother. I don’t know anything about babies. I might really botch this.” He took her head between his hands and brought her mouth to his. “You’re going to be a wonderful mother. We’ll learn about this together when the time comes. Agreed?” Julia sighed loudly. “You’re right. As a logical, practical businessperson I know it, but as a woman, I’m not so sure.” “Listen, woman, you’re making it impossible to nap. As far as I can tell, there’s only one way to keep you quiet.” With his arms around her waist, he turned her onto her back and nuzzled her neck until Julia cried out and promised to do whatever he said. Monday morning, Julia arrived at the office before eight. Virginia, her assistant, appeared a few minutes after she did, looking flustered. “I’m sorry, I didn’t realize you were planning to be here quite so early. If I had, I would’ve come in before eight myself. I’ll get your coffee right away.” “Don’t worry about it,” Julia said, reaching for the stack of mail in her in-basket. Her desk was neatly organized, and she was grateful Virginia had taken the time to lighten her load. “I read over the mail and your emails and answered everything I could,” Virginia said. “I hope that’s okay.” “Of course. I’m grateful for your help.” Virginia hurried out to the lunchroom, returning a few minutes later with a steaming cup of coffee. “I’m sorry but there doesn’t seem to be any cream. I’ll send out for some.” “I can live without cream,” Julia said absently, turning on her computer. “Would you ask my brother to drop in when it’s convenient? And please contact my husband and see if he could meet me for lunch.” She’d left while he was in the shower and had forgotten to leave him a note. “I meant to ask—” She stopped, realizing she probably already had a luncheon appointment. “That is, if I’m not tied up.” “You were scheduled to meet with Mr. Casey, but I wasn’t sure if you’d feel up to dealing with him your first day back. I took the liberty of rescheduling the luncheon for Tuesday.” Virginia knew Doug Casey, their outside counsel, was one of her least favorite people, and she smiled her appreciation. “Thanks.” “I’ll get right back to you,” Virginia said. True to her word, she returned a few minutes later. “Your brother will be down shortly and your husband suggests you meet at noon at Freeway Park.” “Great.” She turned back to her computer and didn’t hear Virginia leave her office. Jerry hurried into her office. “I’m worried about Stanhope,” he said immediately. “I think he’s up to something. I’ve got a private investigator following him. If he makes contact with any of our people, we’ll know about it.” Julia rolled a pen between her palms. “I can’t believe any of our employees would sell us out, can you?” Jerry tensed. “After what happened last time, who’s to tell?” “Let me know the second you hear anything.” “I will. The investigator’s going to make regular reports.” Her brother left, and Julia was involved with a large stack of correspondence when she noted the time. She stopped in the middle of a dictation. Virginia raised her head, anticipating Julia’s next move. “We’ll continue this after lunch,” she said, standing and reaching for her purse. “I won’t be back until after one. Cover for me if need be.” “Of course.” Virginia was on her feet, too, and Julia felt her scrutiny. “Is something wrong?” she asked the older woman. “No,” Virginia said with a shy smile. “Something’s very right.” “Oh?” Julia didn’t understand. “I don’t think I’ve ever seen you look happier.” Ten Freeway Park was one of Seattle’s many innovative ideas. A large grassy area built over a freeway. Green ivy spilled down the concrete banks, reaching toward the road far below. At noon, many Seattle office workers converged on the park to enjoy their lunch in the opulent sunshine. Each summer the city offered a series of free concerts. Julia didn’t know if there was one scheduled for that afternoon, but nothing could have made her day any more perfect than meeting her husband. She saw Alek from across the grass and started toward him. He’d obviously seen her at the same time because he grinned broadly and moved in her direction. “Did you bring anything for lunch?” he asked, after they kissed briefly. Eating was something Julia often failed to think about. “Oh, no, I forgot.” “I thought as much. Luckily you have a husband who knows his wife. Come, let’s find a place to sit down.” “What’d you buy?” she asked, pointing at the white sack in his hand. “Fish and chips. Do you approve?” “Sounds great.” She was hungry, she realized, which had become a rarity. Generally she ate because it was necessary, not for any real enjoyment. Anna was sure to change that. Alek’s sister cooked tempting breakfasts and left delicious three-and four-course dinners ready to be served when they got home. By the end of the year, Julia predicted she’d gain weight—from all the wonderful food…and because by then she’d likely be pregnant. The thought produced a deep sense of excitement.","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-21.html","bookId":1964,"book":{"id":1964,"title":"An Engagement in Seattle","description":"Storyline: An Engagement in Seattle: Groom Wanted\\Bride Wanted (From This Day Forward #1-2) Aleksandr Berinksi is a Russian biochemist in the U.S. on a visa that is about to expire. Marriage will allow him to stay\u0026#151;marriage to Julia Conrad. If Julia\u0027s going to save her Seattle-based company, she needs him as much as he needs her. There\u0027s a Groom Wanted in Julia\u0027s life. And not just any groom! A billboard on the side of a Seattle road is common enough\u0026#151;but one advertising for a bride? It\u0027s Chase Goodwin\u0027s solution to the problem of finding a wife quickly, a wife to bring home to Alaska. Lesley Campbell has her own reasons for responding\u0026#133;and in no time she\u0027s the Bride Wanted in Chase\u0027s life!","cover":"https://allnovel.net/images/an-engagement-in-seattle.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/an-engagement-in-seattle.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:50 AM"}}
