{"id":70387,"no":41,"title":"Page 41","content":"“Right, and Grandma, too.”\\n\\n “Those feminine touches can be nice, though,” Chase told the boys. “I live in a big log cabin up in Alaska and it gets mighty lonesome during the winters. Last January I would’ve done just about anything to have a pretty face smiling at me across the dinner table, even if it meant having to eat on a tablecloth. I wouldn’t have cared if she’d spread out ten of them. It would’ve been a small price to pay for her company.”\\n\\n “You mean you wanted a woman with you?” Eric sounded surprised.\\n\\n “Men like having women around?” Kevin asked.\\n\\n “Of course,” Chase returned casually.\\n\\n “My dad doesn’t feel like that. He said he was glad to be rid of us. He said lots of mean things that made Mom cry and he hit her sometimes, too.”\\n\\n Chase crouched down in front of Eric and Kevin and talked to them for several minutes. She couldn’t hear everything he said, because she was making trips back and forth to the car, but she knew whatever it was had an impact on the boys. She was touched when the three of them hugged.\\n\\n After a while, the fire Chase had built had burned down to hot coals. The boys and Chase wrapped the cleaned fish in a bed of leaves and packed them in mud before burying them in the dirt, which they covered with the hot coals.\\n\\n “While we’re waiting,” Chase suggested, “we’ll try those sandwiches Lesley packed and go exploring.”\\n\\n “Great.” After collecting their sandwiches, both boys eagerly accompanied Chase on a nearby trail. Lesley chose to stay behind. Trekking into the woods, chasing after those two, was beyond her. She got a lounge chair she’d packed, opened it and gratefully sank down on it.\\n\\n She must have dozed off because she woke with both boys staring down at her, studying her as if she were a specimen under a microscope.\\n\\n “She’s awake,” Eric cried.\\n\\n “Let’s eat,” Kevin said. “I’m starved.”\\n\\n Lesley had the plastic plates and plastic silverware set out on the table, along with a large bag of potato chips, veggies and a cake she’d baked the night before.\\n\\n Chase dug up the fish, scraped away the dried mud and peeled back the leaves. The tantalizing aroma of the trout took Lesley by surprise. Until then she hadn’t thought she was hungry.\\n\\n They ate until they were stuffed, until they couldn’t force down another morsel. Chase and the boys conscientiously packed up the garbage and loaded the vehicle after Lesley had wrapped the leftovers—not that there were many.\\n\\n Eric and Kevin fell asleep in the backseat on the ride home.\\n\\n “They really enjoyed themselves,” Lesley whispered. “They’ll remember this day all their lives. It was very sweet of you to invite them along.”\\n\\n She watched as his gaze briefly moved to his rearview mirror and he glanced at the boys. “I’d like to meet their father in a dark alley someday. I have no tolerance for a man who hits a woman.”\\n\\n “He has a drinking problem,” Lesley said.\\n\\n “Is that an excuse?”\\n\\n “No, just an explanation.”\\n\\n “The man should be punished for telling his sons he’s glad to be rid of them. What kind of father would say such a thing?”\\n\\n He didn’t seem to expect an answer, which was just as well since Lesley didn’t have one.\\n\\n Daisy was back from her computer classes by the time they arrived at the house. The boys woke up when Chase cut the engine. As soon as they realized they were home, they darted out of the car and into the house, talking excitedly about their adventures.\\n\\n Daisy came out of the house with her sons and ordered them to help unload the car for Lesley, which they did willingly.\\n\\n Lesley had been neighbors and friends with Daisy for three years. She’d watched this no-nonsense woman make some hard decisions in that time, but never once had she seen her friend cry. There were tears in Daisy’s eyes now.\\n\\n “Thank you,” she said to Chase in a tremulous voice.\\n\\n “No problem. I was happy to have them with us. You’re raising two fine boys there, Daisy. You should be proud of them.”\\n\\n “Oh, darn.” She held an index finger under each eye. “You’re going to have me bawling here in a minute. I just wanted to thank you both.”\\n\\n “Daisy?” Lesley asked gently. “Is everything all right?”\\n\\n “Of course everything’s all right. A woman can shed a few tears now and then, can’t she?”\\n\\n “Sure, but…”\\n\\n “I know. I’m making a fool of myself. It’s just that I appreciate what you did for my boys. I’ve never seen them so excited and so happy.” Lesley wasn’t expecting to be hugged, but Daisy reached for her, nearly squeezing the breath from her lungs. “I want to thank you for being my friend,” she murmured, wiping her hand under her nose. Then she returned to her house.\\n\\n Eric and Kevin were off, eager to relate their escapades to their neighborhood friends.\\n\\n Chase followed Lesley into the kitchen. He helped her unload the picnic basket, then stopped abruptly, looking over at her.\\n\\n “Is something the matter?” she asked.\\n\\n “It looks like you’ve got a message on your answering machine.”\\n\\n Lesley’s heart felt frozen in her chest. Trying to be nonchalant about it, she walked over and pushed the playback button. This time, Tony’s voice didn’t rip through her like the blade of a knife. In fact, hearing him again so soon felt anticlimactic.\\n\\n “Lesley, it’s Tony. When you didn’t return my call, I stopped by the house. You weren’t home. I need to talk to you. Call me soon. Please.”\\n\\n Lesley looked at Chase, wishing she could read his thoughts, wishing she could gauge her own. His eyes were darker than she’d ever seen them and his jaw was stiff.\\n\\n “Are you going to contact him?”\\n\\n She wasn’t any more confident than she’d been earlier. “I don’t know.”\\n\\n “I see.”\\n\\n “You want to remind me he’s a married man, don’t you?” she cried. “I know that, Chase. I have no idea why he’s calling or what he wants from me.”\\n\\n “Get real, Lesley. You know exactly what he wants. Didn’t he say April’s out of town?”\\n\\n “Tony’s not like that.” Again, she didn’t understand why she felt the need to defend him. She’d done it so often that it came naturally to her, she supposed. Although, she did have to wonder if Tony might be unfaithful to April, as he’d been to her.\\n\\n “You know him better than I do,” Chase admitted grudgingly. “I’ve got to get back,” he said, as though he couldn’t get away from her fast enough.\\n\\n “Are you interviewing more…applicants?” she asked him on the way to the door, making conversation, not wanting their day to end on a sour note.\\n\\n “Yes,” he said briskly. “Several.”\\n\\n His answer surprised her. “When?”\\n\\n “I talked to some last night and I have more scheduled for later this afternoon and evening.”\\n\\n “You’ll call me?” she asked, trailing after him.\\n\\n He hesitated, not looking at her. An eternity seemed to pass before he nodded. “All right,” he said curtly.\\n\\n Lesley longed to reassure him; that was what Chase was waiting for her to do. To promise him she wouldn’t call Tony. But she couldn’t tell him that. She hadn’t decided yet. She remembered what he’d said about not wanting to compete with another man for a woman’s affections. What Chase didn’t understand was that she’d never try to play one man against another.\\n\\n “I’ll look forward to hearing from you,” she said. To her own ears she sounded oddly formal. She stood on the other side of the screen door, watching him walk away from her. She had the craziest feeling that he was taking a piece of her heart with him.\\n\\n She waited until his car was gone before she breathed again. She told herself she couldn’t possibly know a man for such a short while and adequately judge her feelings. She was attracted to him, but any other woman with two eyes in her head would be, too.\\n\\n Then there was Tony. She’d loved him for so long she didn’t know how to stop. He’d been an integral part of her life and without him her world felt empty and meaningless.\\n\\n Lesley walked back into her kitchen and listened to the message again. She thought about phoning Lori and asking for advice, but decided against it. Lori had said she’d get back to her later, and she hadn’t yet.\\n\\n Daisy was the more logical choice, although her feelings about Tony were well-known. Lesley found her neighbor in the backyard, wearing a bikini, soaking up the sun on a chaise longue while propping an aluminum shield under her chin. Amused, Lesley stood by the fence and studied her.\\n\\n “Where in heaven’s name did you get that?” Lesley asked.\\n\\n “Don’t get excited. It’s one of those microwave pizza boxes the boys like, with those silver linings. I figured I’d put it to good use now that they’re finished with the pizza.”\\n\\n “Honestly, Daisy, you crack me up.”\\n\\n “I’ve only got so much time to get any sun. I’ve got to make the most of it.”\\n\\n “I know, I know.”\\n\\n “Where’d Chase take off to?”\\n\\n Lesley looked away. “He had to get back to his hotel. Did I tell you eight hundred women responded to his billboard?”\\n\\n Daisy’s eyes were closed. “Seems to me it’s a shame you’re not one of them. What’s the matter, Lesley, is it beneath your dignity?”\\n\\n “Yes,” she snapped.\\n\\n Daisy’s sigh revealed how exasperated she was with Lesley. “That’s too bad, sweetie, because that man’s worth ten Tonys.”\\n\\n Lesley’s fingers closed around the top of the fence. “It’s funny that you should mention Tony because he’s been calling me.”\\n\\n “What does that poor excuse of a man have to say for himself?”\\n\\n “He claims he needs to talk to me.”\\n\\n “I’ll just bet.”\\n\\n “He left two messages and Chase was here both times when I listened to them.”\\n\\n Daisy shook her head. “Chase isn’t the type to stand still for that nonsense. Did he set you straight?”\\n\\n “Daisy! I don’t need a man to tell me what to do and I resent you even suggesting such a thing.” She remembered, a little guiltily, that she had asked Chase to help her sort out her feelings for Tony as well as her moral obligations.\\n\\n “You’re right, of course. Neither of us truly needs a man for anything. I don’t and you’ve proved you don’t, either. But you know, having one around can be a real comfort at times.”\\n\\n “I don’t know what to do,” Lesley said, worrying her lower lip.\\n\\n “About Chase and all those women?”\\n\\n She was astonished by the way Daisy always brought the conversation back to Chase. “No! About Tony calling me.”\\n\\n “You’ve been miserable because that slimeball dumped you,” Daisy went on with barely a pause. “I find it ironic that when you meet up with a really decent guy, Tony comes sniffin’ around. Does this guy have radar or what?” \\n\\n","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-41.html","bookId":1964,"book":{"id":1964,"title":"An Engagement in Seattle","description":"Storyline: An Engagement in Seattle: Groom Wanted\\Bride Wanted (From This Day Forward #1-2) \\n Aleksandr Berinksi is a Russian biochemist in the U.S. on a visa that is about to expire. Marriage will allow him to stay\u0026#151;marriage to Julia Conrad. If Julia\u0027s going to save her Seattle-based company, she needs him as much as he needs her. There\u0027s a Groom Wanted in Julia\u0027s life. And not just any groom! \\n A billboard on the side of a Seattle road is common enough\u0026#151;but one advertising for a bride? It\u0027s Chase Goodwin\u0027s solution to the problem of finding a wife quickly, a wife to bring home to Alaska. Lesley Campbell has her own reasons for responding\u0026#133;and in no time she\u0027s the Bride Wanted in Chase\u0027s life!\\n","cover":"https://allnovel.net/images/an-engagement-in-seattle.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/an-engagement-in-seattle.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:50 AM"}}
