{"id":70395,"no":47,"title":"Page 47","content":"“I know…I know.” He sounded sad and uncertain, a combination that never failed to touch her heart. Part of her longed to invite him into her home and listen to his troubles, but she dared not and knew it.\\n\\n “I’m making a new life for myself,” she insisted, steeling herself against the pleading in his eyes. “I’ve given notice to the school and to my landlord.”\\n\\n “A new life? One without me?”\\n\\n “Yes. Please, Tony, just leave.” She stepped back, intending to close the door, but he placed his foot over the threshold, blocking her attempt.\\n\\n “I can’t,” he said. “Not until I’ve talked to you.”\\n\\n “Tony, please.” This was so much harder than she’d imagined it would be. He must have sensed that because he edged closer.\\n\\n “Tony.” Her voice shook with the force of her desperation. “We have nothing to say to each other.”\\n\\n “Lesley.”\\n\\n Chase’s voice sounded like an angel’s harp. She was so grateful he’d arrived that she nearly burst into tears.\\n\\n “Chase,” she said, breaking away from Tony and rushing forward. She must have appeared desperate, but she didn’t care. Chase was her one link to sanity and she held on to him with both hands.\\n\\n “What’s going on here?” Tony demanded. “Who is this man?”\\n\\n “Actually, I was about to ask you the same thing,” Chase said stiffly.\\n\\n “I’m Tony Field.”\\n\\n Lesley felt Chase stiffen as soon as he recognized the name. He reacted by placing his arm possessively around Lesley’s shoulders and pulling her closer to his side.\\n\\n “Who is this man?” Tony asked again.\\n\\n Lesley opened her mouth to explain, but before she could utter a single word, Chase spoke.\\n\\n “Lesley and I are going to be married.”\\n\\n “Married?” Tony laughed as if he’d just heard a good joke. “You can’t be serious.”\\n\\n “We’re dead serious,” Chase responded.\\n\\n “Lesley?” Tony looked at her, clearly expecting her to deny it.\\n\\n “It’s true,” she said with as much conviction as she could manage.\\n\\n “That’s ridiculous. You’ve never mentioned anyone named Chase and I know for a fact that you weren’t dating him before school was out. Isn’t this rather sudden?”\\n\\n “Not in the least,” Chase said as if they’d been involved for years.\\n\\n “Lesley?”\\n\\n “There’s a lot you don’t know about my fiancée,” Chase said, smiling down at her.\\n\\n It was all Lesley could do not to tell them both to stop playing these ridiculous games. Tony regarded her with a tormented expression, as though he was the loyal one and she’d betrayed him. Chase wasn’t any better. The full plumage of his male pride was fanned out in opulent display.\\n\\n “You can’t possibly be marrying this man,” Tony said, ignoring Chase and concentrating on her instead.\\n\\n “I already said I was.” She hated the way her voice quavered. Chase didn’t seem pleased with the lack of enthusiasm in her trembling response, but that couldn’t be helped.\\n\\n “The ceremony’s tomorrow evening,” Chase added.\\n\\n “Lesley, you don’t love this man,” Tony continued, his gaze burning into hers.\\n\\n “You don’t know that,” Chase challenged.\\n\\n “I do know it. Lesley loves me. Tell him, sweetheart. You’d be doing us both a grave disservice if you didn’t tell him the truth.”\\n\\n Lesley could see no reason to confess the obvious. “I’m marrying Chase.”\\n\\n “But you love me,” Tony insisted, his voice agitated. She noticed that he clenched his fists at his sides as if his temper was about to explode. He’d fight for her if necessary, he seemed to be saying.\\n\\n “You’re already married,” Chase told Tony with evident delight.\\n\\n Tony turned to Lesley once more, ignoring Chase. “Marrying April was a mistake. That’s what I’ve been trying to tell you. If only you’d returned my calls… I love you, Lesley. I have for years. I don’t know what came over me.… I can see now that April and I were never right for each other. I’ve been miserable without you.”\\n\\n “You don’t need to listen to this,” Chase hissed in her ear. He tried to steer her past Tony and toward the front door, but she was rooted to the spot and unable to move.\\n\\n “You’ve got to listen,” Tony pleaded, “before you ruin both our lives.”\\n\\n “Where’s April now?” Chase asked.\\n\\n “She left me.”\\n\\n “You’re lying.” Chase’s voice was tight with barely restrained anger. “You said she was visiting her mother for a week.”\\n\\n “She phoned and told me she’s not coming back. She knows I love Lesley and she can’t live with that anymore. It’s a blessing to us all.”\\n\\n “If you believe him,” Chase said to Lesley, “there’s a bridge in Brooklyn you might be interested in buying.”\\n\\n “I’m telling you the truth,” Tony insisted. “I should never have married April. It was a mistake on both our parts. April knows how I feel about you. She’s always known. I can’t go on pretending anymore. April can’t, either. That’s why she went to visit her mother and why she’s decided not to come back.”\\n\\n “I’m marrying Chase.” Her voice wavered, but not her certainty. She couldn’t trust Tony, couldn’t believe him. Chase was right about that. He’d lied to her before, and the experience had taught her painful but valuable lessons.\\n\\n “Lesley, don’t,” Tony cried. “I’m pleading with you. Don’t do something you’ll regret the rest of our lives. I made a terrible mistake. Don’t compound it by making another.”\\n\\n “She doesn’t believe you any more than I do,” Chase said calmly.\\n\\n “The least you can do is have the decency to give us some privacy,” Tony shouted, frustrated and short-tempered.\\n\\n “Not on your life.”\\n\\n “You’re afraid, aren’t you?” Tony shouted. “Because Lesley loves me and you know it. You think if you can keep her from listening to me, she’ll go through with the wedding, but you’re wrong. She doesn’t need you, not when she’s got me.”\\n\\n “But she hasn’t got you. In case you’ve forgotten, I’ll remind you again—you’re married.”\\n\\n As he was talking, Tony stepped closer to Chase, his stance challenging.\\n\\n Chase dropped his arm from Lesley’s shoulders and moved toward Tony. The two men were practically chest to chest. It wouldn’t take much for the situation to erupt into a brawl.\\n\\n “Stop it, both of you!” Lesley yelled. She was surprised none of the neighbors were out yet to watch the show. “This is ridiculous.”\\n\\n “You love me,” Tony said. “You can’t marry this…this barbarian.”\\n\\n “Just watch her,” Chase returned with a wide smile.\\n\\n “I’m not doing anything until both of you stop behaving like six-year-olds,” Lesley said. “I can’t believe either one of you would resort to this childish behavior.”\\n\\n “I’ll divorce April,” Tony promised. “I swear by everything I hold dear that I’ll get her out of my life.”\\n\\n “I’d think a husband would hold his wife dear,” Chase said. “Apparently that isn’t so. Your vows meant nothing the first time. What makes you so sure they’ll mean any more on a second go-round?”\\n\\n “I’m trying to be as civil as I can,” Tony muttered, “but if you want to fight this out, fine.”\\n\\n “Anytime,” Chase said, grinning broadly as if he welcomed the confrontation, “anyplace.”\\n\\n “Fine.”\\n\\n They were chest to chest once more.\\n\\n Lesley managed to wedge herself between them and braced a hand against each of their chests. “I think you should go,” she said to Tony. It was useless to try to discuss anything now. She wanted to believe him, but Chase was right. The first message Tony had left claimed that April was away for a week visiting her mother. He hadn’t said a word about his marriage being a mistake or that he still cared for her.\\n\\n “I’m not leaving you, not when you’re making the biggest mistake of your life,” Tony told her. “I already said I’d divorce April. What more do you want me to do? The marriage was a mistake from the first! What else can I do? Tell me, Lesley, tell me and I’ll do whatever it takes to make amends to you.”\\n\\n “I believe the lady asked you to leave,” Chase said with the same easy grace. “That’s all she wants from you. Get out of her life.”\\n\\n “No.”\\n\\n “It’ll give me a good deal of pleasure to assist you.”\\n\\n The next thing she knew, Chase had grabbed Tony’s arm and steered him toward his parked car.\\n\\n Lesley stood on the porch, her teeth sinking into her lower lip as she watched the unpleasant scene. She was furious and didn’t know who with—Chase or Tony. Both had behaved like children fighting on the playground. Neither of them had shown any maturity in dealing with an awkward situation.\\n\\n The two men exchanged a few words at Tony’s vehicle and it looked for a moment as if a fistfight was about to erupt. In the end, Tony climbed inside his car and drove away.\\n\\n Lesley was pacing her living room when Chase entered the house. “How could you?” she demanded.\\n\\n “How could I what? Treat lover boy the way he deserved, you mean?”\\n\\n “You weren’t any better than he was! I expected more from you, Chase. The least you could’ve done was…was be civil about the whole thing. Instead you acted like a jealous lover.” She continued pacing. Her anger had created an energy within her that couldn’t be ignored.\\n\\n “Did you want to talk to him alone?”\\n\\n “No.”\\n\\n “Then what did you expect me to do?”\\n\\n “I don’t know,” she said. “Something different than strong-arming him.”\\n\\n “You sound like you wanted to invite him in for tea and then sit around discussing this like civilized adults.”\\n\\n “Yes!” she cried. “That would’ve been better than a shouting match on my front porch. The two of you behaved as though I was a prize baseball card you both wanted. Tony had traded me away and now he wants me back and you weren’t about to see that happen.”\\n\\n Chase went still. “Is that what you wanted?” he asked. “To be handed back to Tony?”\\n\\n “No, of course it isn’t!”\\n\\n “He can’t stand the thought of losing you.”\\n\\n “He’s the one who ended the relationship, not me. It’s over, Chase.”\\n\\n Chase walked to the window and stared outside. He didn’t speak for a long time and seemed to be weighing his thoughts.\\n\\n “You…you told me once that you had a problem with a woman playing one man against another,” she said. “I’m not doing that, Chase. I wouldn’t. You’re the man I’m marrying, not Tony.” \\n\\n","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-47.html","bookId":1964,"book":{"id":1964,"title":"An Engagement in Seattle","description":"Storyline: An Engagement in Seattle: Groom Wanted\\Bride Wanted (From This Day Forward #1-2) \\n Aleksandr Berinksi is a Russian biochemist in the U.S. on a visa that is about to expire. Marriage will allow him to stay\u0026#151;marriage to Julia Conrad. If Julia\u0027s going to save her Seattle-based company, she needs him as much as he needs her. There\u0027s a Groom Wanted in Julia\u0027s life. And not just any groom! \\n A billboard on the side of a Seattle road is common enough\u0026#151;but one advertising for a bride? It\u0027s Chase Goodwin\u0027s solution to the problem of finding a wife quickly, a wife to bring home to Alaska. Lesley Campbell has her own reasons for responding\u0026#133;and in no time she\u0027s the Bride Wanted in Chase\u0027s life!\\n","cover":"https://allnovel.net/images/an-engagement-in-seattle.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/an-engagement-in-seattle.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:50 AM"}}
