{"id":70406,"no":58,"title":"Page 58","content":"“I was able to get the new motor this morning,” Chase said to Lesley. “We can leave for Twin Creeks as soon as you’re ready.”\\n\\n “Mother?”\\n\\n “Anytime. I’m anxious to see your home, although heaven knows you haven’t had much time to settle in, have you?”\\n\\n “No.” Lesley eyed Chase wearily.\\n\\n “I’ll leave you here and be back within the hour to get you,” he said, reaching for the lunch tab. “Perhaps you’d care to come with me?” he asked Lesley. He tried to appear nonchalant about it, but his heart was in his throat.\\n\\n “I don’t think I should leave Mother,” she said flatly.\\n\\n Chase’s shoulders fell. Her feelings couldn’t have been more obvious.\\n\\n Lesley couldn’t remember being more furious with anyone in her life. Chase was a fool. She’d agreed to marry him, agreed to leave the life she’d made for herself, leave her friends, her career and most of her possessions, and he still didn’t trust her. He assumed she’d walk out on him the minute his back was turned. That was what hurt so much. His lack of faith in her.\\n\\n Lesley had spent the morning listing Chase’s many fine qualities to her mother. By the time she’d finished, it sounded as if he were a candidate for sainthood.\\n\\n Fat chance of that after the way he’d barged into their hotel room. He couldn’t have shown himself in a worse light had he tried.\\n\\n After Chase left, her mother was strangely silent. They sat on their beds, staring straight ahead. Every time Lesley thought of something to say, she changed her mind. Her mother would see through her efforts to make small talk in a second.\\n\\n “He isn’t always like this,” she finally murmured.\\n\\n “I certainly hope not.”\\n\\n “Chase is honest and hardworking.”\\n\\n “That remains to be seen, doesn’t it?” her mother asked stiffly.\\n\\n “You don’t like him, do you?”\\n\\n June paused. “I don’t have much reason to, do I? I’m afraid you’ve been blinded, Lesley. How can you possibly love this man? You don’t really know him… You couldn’t. Tony said Chase disguised the truth.”\\n\\n “You can’t trust Tony!”\\n\\n “Why not? At least he called us when my own daughter hadn’t bothered to let me know she was getting married. Now that I’ve met your husband, I can appreciate Tony’s concern.”\\n\\n “Mother…”\\n\\n “Hear me out, please. I’ve bitten my tongue for the last hour, trying not to say what I should have earlier and didn’t. You have nothing in common with Chase. You might have convinced yourself that you’re happy now, and that you’re going to make this ridiculous marriage work, but it isn’t necessary.”\\n\\n “Mom, please, don’t.” It hurt that her mother thought her marriage ridiculous. Lesley was angry with Chase all over again for having put her in this impossible situation.\\n\\n “I have to speak my piece or I’ll regret it the rest of my life. I made the same mistake with your father.” Her voice faltered slightly. “I knew the marriage wasn’t going to work, almost from the first, but I was too stubborn to admit it. I convinced myself that I was deeply in love with him. I worked hard at making the best of the situation, giving more and more of myself until there wasn’t anything left to give.\\n\\n “After all that, after everything I did to hold that marriage together, he walked out. To see you repeat my mistakes would be the most tragic thing that could happen to me.”\\n\\n Lesley felt as if she was going to break into tears. “It isn’t like that with Chase and me.”\\n\\n “I don’t believe that, not after talking to Tony and meeting Chase for myself. He isn’t right for you. Anyone with a brain can see that.”\\n\\n “Mom…”\\n\\n “Are you pregnant?”\\n\\n “No.”\\n\\n Her mother sighed as though relieved. “Come back to Montana with me,” June pleaded. “If you want to start over, do it there. There’s always a need for good teachers. Don’t make the mistakes I did, Lesley. Leave Chase now—before it’s too late—and come back with me.”\\n\\n Lesley was so intent on listening to her mother that she didn’t hear the door open. But she felt Chase’s presence before she heard his words. He was studying her without emotion, without revealing a hint of his thoughts.\\n\\n “Well?” he said. “Make up your mind, Lesley. What do you want to do?”\\n\\n Thirteen\\n\\n Lesley’s mother was staring at her, too, pleading with her to cut her losses now.\\n\\n “I…I thought we’d already decided to return to Twin Creeks,” Lesley stammered.\\n\\n June’s shoulders sagged with dismay. Chase hurriedly reached for their suitcases, as though he expected Lesley to change her mind. That irritated her, too. Her mother was about to burst into tears and Chase was ignoring June completely.\\n\\n The flight into Twin Creeks seemed to take twice as long as before. Chase flew the four-seater, concentrating as hard as if he were flying an F-14 under siege. Lesley made several attempts to carry the conversation, but it became painfully obvious that neither her mother nor Chase was interested in small talk.\\n\\n When they landed at the tiny airfield, Pete and Jim were there to greet them. She knew Chase had let Jim know he’d be flying them home. But she didn’t understand what was going on between Pete and her husband. The minute Pete saw her, he grinned broadly and gave Chase a thumbs-up. Chase, however, didn’t seem to share his friend’s enthusiasm.\\n\\n “This is where you live?” June asked, scowling, staring at the tundra that surrounded the town. “Why, it’s…it’s like stepping back a hundred years.” The words were more accusation than comment. Lesley saw Chase’s jaw tense, but he didn’t say anything, which was just as well. Lesley doubted her mother would be receptive, anyway.\\n\\n When they arrived at the cabin, Lesley waited curiously for her mother’s reaction. June asked several questions, nodding now and then as Chase told her about his and Lesley’s life in Twin Creeks. Lesley was pleased with his honest responses. She added what little information she could.\\n\\n “The guest room is down the hall,” Chase explained, leading them into the house. There seemed to be a détente between him and her mother, much to Lesley’s relief.\\n\\n June paused in the living room, staring curiously at the fireplace and the bookshelves and the desk in much the same way Lesley had earlier. Before leaving, Lesley had added several feminine touches to the house. A homemade quilt that had been her grandmother’s was draped across the back of the rocking chair. A picture of her mother and Ken rested on the television and a small figurine of a harbor seal made of ash from the 1980 Mount Saint Helens eruption was propped against a Sue Grafton mystery in one of the built-in bookcases.\\n\\n “This has a homey feel to it,” June said grudgingly before following Chase down the narrow hallway.\\n\\n Lesley bit her tongue and trailed after her mother. Already she could see that this was going to be the longest five days of her life.\\n\\n Chase was forced to wait until after dinner before he had a chance to speak to his mother-in-law privately. While Lesley was busy with the dinner dishes, Chase casually suggested a drive into town.\\n\\n June hesitated, but it appeared she had things she wanted to say to him, too, and she agreed with a nod of her head.\\n\\n Chase walked into the kitchen. Under normal circumstances, he would’ve slipped his arms around Lesley’s waist. But these weren’t normal conditions. He was afraid of touching her for fear of being charged with not behaving in a circumspect fashion. He swore his mother-in-law had the eyes of an eagle and the temperament of a polar bear.\\n\\n “Your mother and I are going for a drive,” he said as casually as he could, hoping Lesley would leave it at that. He should’ve known better.\\n\\n She hurriedly finished rinsing the pan she’d used to bake biscuits and reached for a hand towel. “I’ll come with you.”\\n\\n “Don’t be offended, but we’d both rather you didn’t.”\\n\\n Lesley blinked and leaned against the sink. “I don’t know if talking to my mother when she’s in this frame of mind is a good idea.”\\n\\n “We either clear the air here and now, or all three of us are going to spend a miserable five days.”\\n\\n “But, Chase…”\\n\\n “Honey, listen.” He paused and glanced over his shoulder. June had gone for a sweater, but would return at any moment. “You and I need to talk, too. I’m sorry about starting off on the wrong foot with your mother. I promise I’ll do my best to make things right. I owe you that much—and a whole lot more.”\\n\\n Lesley lowered her gaze.\\n\\n “I realize June’s not the only one I offended,” he said gruffly, walking toward her. If he didn’t kiss her soon, he was going to go stark raving mad. Lesley must have felt the same way because she moved toward him, her steps as eager as his own. His heart reacted immediately, gladdened that she wanted to end this terrible tension between them.\\n\\n He clasped his hands about her waist and caught her, drawing her into the shelter of his arms.\\n\\n The sound of June clearing her throat behind him was like a bucket of cold water tossed over his head. He released Lesley and stepped away from her.\\n\\n “We won’t be long,” he said, as evenly as he could.\\n\\n June was fussing with her sweater when he turned around, smoothing out the sleeves. Her back was straight with unspoken disapproval. She looked prim and proper and determined to save her daughter from his nasty clutches. Chase sighed inwardly and prayed for patience.\\n\\n Lesley followed them out to the front porch and watched as Chase opened the passenger door and held out his hand to help June inside. His mother-in-law ignored him and hoisted herself into the front seat.\\n\\n So that was how it was going to be.\\n\\n Knowing what to expect, Chase threw a look over his shoulder at Lesley and shrugged. He’d do his best, but he wasn’t a miracle worker. He couldn’t force Lesley’s mother to accept him as her son-in-law, nor could he demand she give her approval to their marriage.\\n\\n He climbed into the seat beside her, and started the engine. “I don’t know if Lesley had a chance to tell you, but Twin Creeks is a small town,” he said, as he pulled onto the dirt and gravel road. “The population is around forty.”\\n\\n “Forty,” June repeated, sounding shocked. “Did Lesley tell you she was born and raised in Seattle?”\\n\\n “Yes.”\\n\\n “There were almost that many students in her kindergarten class. What makes you think a woman who’s lived in a large populated area all her life will adjust to a place like this?”\\n\\n Chase was ready for this one. “Lesley knew Twin Creeks was small when she agreed to marry me.” True, she hadn’t known how small, but she’d had the general idea.\\n\\n “You haven’t answered my question,” June said primly, her hands tightly clasped.\\n\\n “I’m hoping love will do that,” he said simply.\\n\\n “Aren’t you asking a good deal of a woman you’ve only known a few weeks?” \\n\\n","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-58.html","bookId":1964,"book":{"id":1964,"title":"An Engagement in Seattle","description":"Storyline: An Engagement in Seattle: Groom Wanted\\Bride Wanted (From This Day Forward #1-2) \\n Aleksandr Berinksi is a Russian biochemist in the U.S. on a visa that is about to expire. Marriage will allow him to stay\u0026#151;marriage to Julia Conrad. If Julia\u0027s going to save her Seattle-based company, she needs him as much as he needs her. There\u0027s a Groom Wanted in Julia\u0027s life. And not just any groom! \\n A billboard on the side of a Seattle road is common enough\u0026#151;but one advertising for a bride? It\u0027s Chase Goodwin\u0027s solution to the problem of finding a wife quickly, a wife to bring home to Alaska. Lesley Campbell has her own reasons for responding\u0026#133;and in no time she\u0027s the Bride Wanted in Chase\u0027s life!\\n","cover":"https://allnovel.net/images/an-engagement-in-seattle.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/an-engagement-in-seattle.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:50 AM"}}
