{"id":27847,"no":38,"title":"Chapter 38 Thibault","content":"Thibault, Beth, and Clayton Thibault finally arrived at the kennel driveway, his boots waterlogged and heavy. Zeus kept pace alongside him, slowed only by the knee-deep water. Up ahead, he could see the car and the truck, as well as another SUV. As he approached, he made out the lights on top and knew that Clayton was at the house. Despite his exhaustion, he surged forward, splashing hard. Zeus was bounding through the water like a dolphin skimming over the waves. The harder Thibault ran, the farther the distance seemed, but finally he passed the kennel office and angled toward the house. Only then did he notice Nana standing on the porch, aiming a flashlight toward the forest. Even from a distance, she looked panicked. \"Nana!\" he called out, but the storm kept the sound of his voice from reaching her. A few moments later she must have heard him, fot she turned in his direction, catching him in the glare of her flashlight. \"Thibault?\" Thibault forced his way through the last few steps. The rain whipped around him and the waning light made it difficult to see. He slowed to a walk, trying to catch his breath. \"What happened?\" he shouted. \"Ben\u0027s gone!\" she shouted back. \"What do you mean, gone? What happened?\" \"I don\u0027t know!\" Nana cried. \"Clayton was here and Beth came out looking for Ben… and then the two of them took off toward the creek. I heard something about the tree house.\" A moment later, Thibault was sprinting toward the woods, Zeus at his side. The rain and wind lashed the branches on either side of them, cutting their faces and hands. The path had been blocked by dozens of fallen limbs, forcing Beth and Keith to push through bushes and vines to get around them. Twice, Beth stumbled and fell; behind her, she heard Keith fall as well. The mud was thick and viscous; halfway to the tree house, Beth\u0027s shoe came off, but she didn\u0027t stop. The tree house. The bridge. The flood. Only adrenaline and fear kept her from throwing up. In her mind\u0027s eye, she could see her son on the bridge as it suddenly gave way. In the shadows, she stumbled again over a half-decayed tree trunk and felt a searing pain in her foot. She rose as quickly as she could, trying to ignore it, but as soon as she put weight on it, she crumpled to the ground again. By then, Keith had reached her side and he pulled her up without a word. Keeping an arm around her waist, he dragged her forward. They both knew Ben was in danger. Clayton had to force himself not to succumb to panic. He told himself that Ben was intelligent, that Ben would know danger when he saw it, that he wouldn\u0027t press his luck. Ben wasn\u0027t the bravest kid. For the first and only time in his life, he was grateful for that. Even as they struggled through the underbrush, Beth hobbling beside him, Clayton couldn\u0027t ignore what he was seeing. Far beyond its banks, almost at their feet, he saw the creek, running wider, stronger, and faster than he\u0027d ever seen it. Thibault had been running hard, charging through mud and water, forcing himself not to slow but finding it more difficult with every step to keep up his desperate pace. Branches and vines snapped at his face and arms, scissoring him with cuts he didn\u0027t feel as he blasted through them. As he ran, he ripped off his raincoat and then his shirt. Almost there, he kept telling himself. Only a little bit farther. And in the distant reaches of his mind, he heard the echo of Victor\u0027s voice: There is more. Beth could feel the bones in her foot grinding against one another with every step, sending flashes of fire throughout her lower body, but she refused to scream or cry out. As they drew near the tree house, the creek widened even more, the current curling and whipping into circles. Brackish water broke into tiny waves around heaps of fallen branches along the fast-disappearing banks. The turbulent water was filled with debris, enough to knock anyone unconscious. Rain came down from the sky in sheets. The wind toppled another branch, and it crashed to the ground only yards away. The mud seemed to suck the energy from both of them. But she knew they\u0027d reached the oak tree: Through the downpour, she could make out the rope bridge, like the ragged mast of a ship finally sighted through a misty harbor. Her eyes swung from the ladder to the rope bridge, toward the central landing… The waters of the creek were racing over it, debris collecting against it. Her gaze traveled from the rope bridge to the tree house platform, taking in the awkward angle of the dangling bridge. It hovered only a foot above the water because the platform had nearly been ripped off the tree house\u0027s ancient structural support, clearly about to give way. As if in a waking nightmare, she suddenly spotted Ben in the rushing creek, clinging to the rope bridge below the tree house platform. Only then did she allow herself to scream. Clayton felt fear flood his veins as soon as he saw Ben grasping the fraying edge of the rope bridge. His mind raced frantically. Too far to swim to the other side, and no time. \"Stay here!\" he shouted to Beth as he raced toward the tree ladder. He scaled it and set off on the bridge at a run, desperate to reach Ben. He could see the tree house platform sinking, Once the force of the current touched it, it would tear away completely. On his third step, the dry-rotted planks broke and Clayton felt himself smash through the platform, breaking his ribs on the way and free-falling toward the water. It was all he could do to grab the rope as he hit the raging water. He struggled to tighten his grip as he went under, his clothes dragging him down. He felt the current pulling at him, and the rope tightened. He held on, trying to get his head above water, kicking wildly. He bobbed to the surface and gasped: His broken ribs exploded in pain, making everything go black for an instant. In a panic, he reached for the rope with the other hand, fighting against the current. As he held on, ignoring the pain, branches rammed his body before spinning off wildly. The current crashed over his face, obscuring his vision, making it difficult to breathe, making it difficult to think of anything but survival. In his struggle, he didn\u0027t notice the pilings beneath the central landing lurch under the strain of his weight, beginning to lean with the ferocious current. Beth hobbled to her feet and tried to walk. She got three steps before falling again. She cupped her mouth and shouted across the creek. \"Move along the rope, Ben! Move away from the platform! You can do it!\" She wasn\u0027t sure whether he heard her, but a moment later, she saw him start to inch out from beneath the platform, toward the harsher current in the center of the creek. Toward his father— Keith was floundering, barely holding on… Everything seemed to speed up and slow down at exactly the same time when she suddenly saw movement in the distance, a litde ways upstream. From the corner of her eye, she spotted Logan ripping off his boots and rain bottoms. A moment later, he dove into the water, Zeus close behind him. Clayton knew he couldn\u0027t hold on much longer. The pain from his ribs was excruciating, and the current continued to beat him down. He could catch his breath only in snatches, and he flailed against the death he suddenly knew was coming. The relentless current was moving Thibault two feet down the creek for every foot he was moving across. He knew he could backtrack on land once he reached the opposite bank, but he didn\u0027t have that much time. Focusing his sights on Ben, he kicked with everything he had. A large branch slammed into him, sending him under for a moment. When he surfaced again, disoriented, he saw Zeus behind him, paddling hard. He regained his bearings, then stroked and kicked with desperate effort. In despair, he saw that he hadn\u0027t even reached the center of the creek. Beth saw Ben inching farther along the fraying rope bridge, and she dragged herself closer to the water\u0027s edge. \"Come on!\" she shouted, sobbing now. \"You can do it! Hold on, baby!\" In midstroke, Thibault collided with the submerged central land\u0027 ing of the bridge. He rolled in the water, spinning out of control; a moment later, he smashed into Clayton. Panicking, Clayton grabbed for his arm with his free hand, dragging Thibault under. Thibault flailed and felt for the rope, his grip tightening just as Clayton let go. Clayton clung instead to Thibault, clambering on top of him in a frenzied attempt to reach the air. Thibault struggled underwater, holding the rope with one hand, unable to free himself from Clayton. His lungs felt as if they would explode, and he felt panic beginning to overtake him. At that very moment, the pilings lurched again, the downstream weight of Clayton and Thibault too much to hold, and with a tearing sound, the landing gave way completely. Beth watched Keith and Logan struggle just before the remaining ropes attached to the central landing snapped. Across the creek, the tree house platform tumbled into the creek in a massive eruption of water, and Ben was whipsawed downstream. In horror, Beth saw that he was still clinging to the rope attached to the central landing, which had spiraled into the current. Zeus had been getting close to Logan and Keith when the central landing suddenly heaved like a seashell rolled up by the waves and crashed. Zeus vanished from sight. It was all happening too fast—she could no longer see Logan or Keith, and only after frantically scanning the water did she spot Ben\u0027s head, a speck among the debris. She heard Ben\u0027s high-pitched cries, and saw him fighting to keep his head above water. She rose again and hobbled forward, immune to the pain, trying desperately to keep him in view. And then, like a dream come to life, she saw a dark, sleek head moving purposefully toward her son. Zeus. She heard Ben calling for the dog, and her heart suddenly filled. She hobbled and fell, rose again and scrambled forward, then fell once more. At last she began to crawl, trying to see what was happening. She used the branches to drag herself forward. Zeus and Ben were getting smaller as they were carried downstream, but Zeus was getting ever closer. Then, all at once, their two figures merged, and Zeus suddenly turned, heading for her side of the creek, Ben behind him, holding Zeus\u0027s tail. \"Kick, baby! Kick!\" she screamed. She hobbled and hopped and thrashed her way forward, trying and failing to keep up with the current. Ben and Zeus were getting farther away with every passing second. She strained to keep sight of them—they\u0027d reached the center of the creek… no, past the center. She kept going, fighting with every remaining shred of strength to keep them in sight, pushing forward, instinct taking over. Instead of pain, she felt her heart beating with every step. Only a third of the way to the edge of the creek… the current getting slower … now a quarter … She kept going, clawing at branches and pulling herself forward. They were lost in the foliage, and it took a few agonizing moments, but she found them again. Almost there … allowing the relief to seep in … only a little bit farther … Please God … just a little more … Then they were there. Ben\u0027s feet hit first and he let go. Zeus surged forward and then reached ground as well. Beth lunged toward them as both Zeus and Ben staggered from the water. Zeus collapsed as soon as he hit dry land. Ben crumpled a moment later. By the time Beth reached them, Zeus was on his feet, his legs trembling from exhaustion, drenched and coughing. Beth went to the ground beside her son and sat hi began to cough in time with Zeus. u^ ^ he \"Are you okay?\" she cried. \"I\u0027m okay,\" he panted. He coughed again and wiped th from his face. \"I was scared, but I had the picture in my pocket. Thibault said it would keep me safe.\" He swiped at his nose. \"Where\u0027s Dad? And Thibault?\" At his words, they both began to cry. Epilogue Two Months Later Beth glanced in the rearview mirror and smiled at the sight of Zeus standing in the bed of the truck, his nose to the wind Ben sat beside her, rangier since his recent growth spurt but still not quite tall enough to rest his elbow comfortably out the window. It was the first warm spell they\u0027d had after weeks of miserably cold weather, and Christmas was coming soon, less than a couple of weeks away: The heat and storms of October had already become a distant memory. The floods had made national news. Downtown Hampton had flooded like many other towns in the region; in all, six people had lost their lives. Despite the nightmare they had all endured, Beth realized that she felt a kind of… peace for the first time in recent memory. Since the funeral, she\u0027d grappled with the extraordinary events that had led to that fateful day. She knew that many people in wondered about the choices she\u0027d made. Occasionally, she heard whispers, but for the most part, she ignored them. If Logan had taught her anything, it was that sometimes her faith in herself and her instincts was all she had. Thankfully, Nana continued to improve; in the days and weeks after \"the accident\" as she referred to it, Beth had leaned on her for her special brand of wisdom and her unfaltering support. These days, she sang regularly with the choir, found time to train the dogs, and was using both hands, limping only occasionally when tired. There had actually been a moment a couple of weeks back when both of them were walking exactly the same way. It was two days after Beth had had her cast removed—she\u0027d broken four bones in her foot and had been in a cast for five weeks—and Nana had ribbed her about it, enjoying the idea of someone else being the invalid. Ben had changed markedly since then, in some ways that Beth worried about and in others that made her proud. Surviving the ordeal had given Ben a newfound confidence that he carried with him to school. Or at least she liked to think so. Sometimes she wondered whether it was because of the photo he\u0027d carried in his pocket. The lamination was scuffed and worn and beginning to separate, but he wouldn\u0027t part with it, carrying it with him everywhere. In time, she assumed he\u0027d grow out of it, but who knew? It was Logan\u0027s legacy to Ben, and as such it held special meaning for him. The loss had been hard on Ben, of course. While he rarely spoke openly about it, she knew he blamed himself in some way. And he still had occasional nightmares, in which he called out sometimes for Keith and sometimes for Logan. When Beth shook him awake, the dream was always the same. He was floundering in the river, about to go under, when he saw Zeus coming toward him. In his dreams, though, he grabbed for the tail, only to find that he couldn\u0027t grasp it. He would reach and fail again and again, only to realize that Zeus no longer had a tail, and he would watch himself—as if from someplace else—flailing as he sank slowly under the water. When she reached the cemetery, Beth pulled into her usual spot. She carried two vases of flowers. First, as she always had when coming to this place, she went to the spot where Drake had been buried and took a moment to remember him before pulling a few weeds around the headstone and setting the flowers nearby. I Then she went to the other grave. She\u0027d saved the larger floral arrangement for this one: It was his birthday, and she wanted to make sure he was remembered. Zeus wandered here and there, sniffing and exploring as he usually did. Ben trailed behind, as he had ever since Zeus had arrived. Ben had always loved the dog, but after Zeus had saved him in the river, it had become impossible to separate them. Zeus seemed to recognize what he had done—or at least, that was the only way Beth could explain it—and in the dog\u0027s mind, they were now bound together. At night, he slept in the hallway outside of Ben\u0027s room. Stumbling to the bathroom in the middle of the night, Beth often spotted Zeus near the bed, checking up on his beloved companion as he slept. Loss was complicated, and she and Ben both struggled with its aftereffects. She felt sometimes that their memories wreaked havoc with their grieving, for despite the heroism that marked their ordeal, their reminiscences were not always rosy. But when all was said and done, Keith Clayton would be remembered by her with unequivocal gratitude. She could never forget how he\u0027d carried her when she fell that day. Or that in the end, he\u0027d died trying to save their son. That counted for something. That counted for a lot, and despite his other failings, that would always be how she chose to remember him. She hoped for Ben\u0027s sake that he would also come to remember him that way, without guilt and with the certain knowledge of Keith\u0027s love for him, so elusive in his life to that point. As for her, Logan would be waiting when she got back home. He\u0027d offered to go with her to the cemetery, but somehow she knew he hadn\u0027t really wanted to go. It was the weekend, and he preferred to spend the morning puttering around the grounds in solitude, repairing things and working on Ben\u0027s new tree house in the backyard. Later, they planned to decorate the Christmas tree. She was getting used to his rhythms and his moods, recognizing the quiet signals that telegraphed who he was. Good and bad, strengths and faults, he was hers forever. As she pulled into the driveway, she spotted Logan coming down the steps from the house, and she waved. She was his forever, too—imperfect as she was. Take it or leave it, she thought. She was who she was. As Logan walked toward her, he smiled as if reading her mind and opened his arms. The End","sourceLink":"http://novel.tingroom.com/jingdian/2101/59662.html","bookId":521,"book":{"id":521,"title":"The Lucky One 幸运符","description":"简介： 《幸运符》是《纽约时报》畅销书排行榜榜首作家爱情小说圣手尼古拉斯斯帕克思最斯帕克思味的真爱之篇，一个男人与死亡擦身而过，命运的力量却引领他找到一生的挚爱。在战火纷飞的伊拉克，前美国海军陆战队队员蒂伯在废墟里捡到一张照片，照片上一个年轻女人微笑着。自此...","cover":"http://novel.tingroom.com/file/upload/201804/25/10-42-16-95-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/2101","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
