{"id":25654,"no":9,"title":"CHAPTER VII","content":"THE MAID AT POITIERS FOR fourteen years the town of Poitiers had been the capital of that part of France which belonged to the French. The Dauphin Charles had transferred his Parlement there, or rather had assembled there those few members who had escaped from the Parlement of Paris. The Parlement of Poitiers consisted of two chambers only. It would have judged as wisely as King Solomon had there been any questions on which to pronounce judgment, but no litigants presented themselves—they were afraid of being captured on the way by freebooters and captains in the King\u0027s pay; besides, in the disturbed state of the kingdom justice had little to do with the settlement of disputes. The councillors, who for the most part had lands near Paris, were hard put to it for food and clothing. They were rarely paid and there were no perquisites. In vain they had inscribed their registers with the formula: Non deliberetur donec solvantur species; no payments were forthcoming from the suitors.[721] The Attorney General, Messire Jean Jouvenel des Ursins, who owned rich lands and houses in ?le-de-France, Brie, and Champagne, was filled with pity at the[Pg i.188] sight of that good and honourable lady his wife, his eleven children, and his three sons-in-law going barefoot and poorly clad through the streets of the town.[722] As for the doctors and professors who had followed the King\u0027s fortunes, in vain were they wells of knowledge and springs of clerkly learning, since, for lack of a University to teach in, they reaped no advantage from their eloquence and their erudition. The town of Poitiers, having become the first city in the realm, had a Parlement but no University, like a lady highly born but one-eyed withal, for the Parlement and the University are the two eyes of a great city. Thus in their doleful leisure they were consumed with a desire, if it were God\u0027s will, to restore the King\u0027s fortunes as well as their own. Meanwhile, shivering with cold and emaciated with hunger, they groaned and lamented. Like Israel in the desert they sighed for the day when the Lord, inclining his ear to their supplications, should say: \"At even ye shall eat flesh, and in the morning ye shall be filled with bread: and ye shall know that I am the Lord your God.\" Vespere comedetis carnes et mane saturabimini panibus: scietisque quod ego sum Dominus deus vester. (Exodus xvi, 12.) It was from among these poor and faithful servants of a poverty-stricken King that were chosen for the most part the doctors and clerks charged with the examination of the Maid. They were: the Lord Bishop of Poitiers;[723] the Lord Bishop of Maguelonne;[724] Ma?tre[Pg i.189] Jean Lombard, doctor in theology, sometime professor of theology at the University of Paris;[725] Ma?tre Guillaume le Maire, bachelor of theology, canon of Poitiers;[726] Ma?tre Gérard Machet, the King\u0027s Confessor;[727] Ma?tre Jourdain Morin;[728] Ma?tre Jean érault, professor of theology;[729] Ma?tre Mathieu Mesnage, bachelor of theology;[730] Ma?tre Jacques Meledon;[731] Ma?tre Jean Ma?on, a very famous doctor of civil law and of canon law;[732] Brother Pierre de Versailles, a monk of Saint-Denys in France, of the order of Saint Benedict, professor of theology, Prior of the Priory of Saint-Pierre de Chaumont, Abbot of Talmont in the diocese of Laon, Ambassador of his most Christian Majesty the King of France;[733] Brother Pierre Turelure, of the Order of Saint Dominic, Inquisitor at Toulouse;[734] Ma?tre Simon Bonnet;[735] Brother Guillaume Aimery, of the Order of Saint-Dominic, doctor and professor of theology;[736] Brother Seguin of Seguin of the Order of Saint Dominic, doctor and professor of theology;[737] Brother Pierre Seguin, Carmelite;[738] several of the King\u0027s[Pg i.190] Councillors, licentiates of civil as well as of canon law. Here was a large assembly of doctors for the cross-examination of one shepherdess. But we must remember that in those days theology subtle and inflexible dominated all human knowledge and forced the secular arm to give effect to its judgment. Therefore, as soon as an ignorant girl caused it to be believed that she had seen God, the Virgin, the saints, and the angels, she must either pass from miracle to miracle, through an edifying death to beatification, or from heresy to heresy through an ecclesiastical prison, to be burnt as a witch. And, as the holy inquisitors were fully persuaded that the Devil easily entered into a woman, the unhappy creature was more likely to be burnt alive than to die in an odour of sanctity. But Jeanne before the doctors at Poitiers was an exception; she ran no risk of being suspected in matters of faith. Even Brother Pierre Turelure himself had no desire to find in her one of those heretics he zealously sought to discover at Toulouse. In her presence the illustrious masters drew in their theological claws. They were churchmen, but they were Armagnacs, for the most part business men, diplomatists, old councillors of the Dauphin.[739] As priests, doubtless they were possessed of a certain body of dogma and morality, and of a code of rules for judging matters of faith. But now it was a question not of curing the disease of heresy, but of driving out the English. Jeanne was in favour with my Lord the Duke of Alen?on and with my Lord the Bastard; the inhabitants of Orléans were looking to her for their deliv[Pg i.191]erance. She promised to take the King to Reims; and it happened that the cleverest and the most powerful man in France, the Chancellor of the kingdom, my Lord Regnault de Chartres, was Archbishop and Count of Reims; and that had great weight.[740] If it should be as she said, if God had verily sent her to the aid of the Lilies, to the mind of whomsoever possessed sense and learning it appeared marvellous but not incredible. No one denied that God could directly intervene in the affairs of kingdoms, for he himself had said: Per me reges regnant. In this Church holy and indivisible, there were the doctors of Poitiers who deliberately pronounced God to be on the side of the Dauphin, while the University of Paris as deliberately pronounced God to be on the side of the Burgundians and the English. His messenger need not necessarily be an angel. He might employ a creature human or not human, like the raven that fed Elijah. And that a woman should engage in war accorded with what was written in books concerning Camilla, the Amazons, and Queen Penthesilea, and with what the Bible says of the strong women, Deborah, Jahel, Judith of Bethulia, raised up by God for the salvation of Israel. For it is written: \"The mighty one did not fall by the young men, neither did the sons of Titans smite him, nor high giants set upon him; but Judith the daughter of Merari weakened him with the beauty of her countenance.\"[741] Jeanne was taken to the mansion where dwelt Ma?tre Jean Rabateau, not far from the law-courts, in the heart of the town.[742] Ma?tre Jean Rabateau was[Pg i.192] Lay Attorney General; all criminal cases went to him, while civil cases went to the ecclesiastical Attorney General, Jean Jouvenel. Alike King\u0027s advocates, in the King\u0027s service, they both represented him in cases wherein he was concerned. The King was an unprofitable client. For representing him in criminal trials Ma?tre Jean Rabateau received four hundred livres a year. He was forbidden to appear in any but crown cases; and no one suspected him of receiving many bribes. If in addition he held the office of Councillor to the Duke of Orléans he gained little by it. Like most Parlement officials he was for the moment very poor. A stranger in Poitiers, he had no house there, but lodged in a mansion, which, because it belonged to a family named Rosier, was called the H?tel de la Rose. It was a large dwelling. Witnesses whom it was necessary to keep securely and deal with honourably were entertained there. Jeanne was taken there although the Parlement had nothing to do with her cross-examination.[743] Once again she was placed in charge of a man who served both the Duke of Orléans and the King of France. Jean Rabateau\u0027s wife, in common with the wives of all lawyers, was a woman of good reputation.[744] While she was at La Rose, Jeanne would stay long on her knees every day after dinner. At night she[Pg i.193] would rise from her bed to pray, and pass long hours in the little oratory of the mansion. It was in this house that the doctors conducted her examination. When their coming was announced she was seized with cruel anxiety. The Blessed Saint Catherine was careful to reassure her.[745] She likewise had disputed with doctors and confounded them. True, those doctors were heathen, but they were learned and their minds were subtle; for in the life of the Saint it is written: \"The Emperor summoned fifty doctors versed in the lore of the Egyptians and the liberal arts. And when she heard that she was to dispute with the wise men, Catherine feared lest she should not worthily defend the Gospel of Jesus Christ. But an angel appeared unto her and said: \u0027I am the Archangel Saint Michael, and I am come to tell thee that thou shalt come forth from the strife victorious and worthy of Our Lord Jesus Christ, the hope and crown of those who strive for him.\u0027 And the Virgin disputed with the doctors.\"[746] The grave doctors and masters and the principal clerks of the Parlement of Poitiers, in companies of two and three, repaired to the house of Jean Rabateau, and each one of them in turn questioned Jeanne. The first to come were Jean Lombard, Guillaume le Maire, Guillaume Aimery, Pierre Turelure, and Jacques Meledon. Brother Jean Lombard asked: \"Wherefore have you come? The King desires to know what led you to come to him.\" Jeanne\u0027s reply greatly impressed these clerks: \"As I kept my flocks a Voice appeared to me. The Voice said: \u0027God has great pity on the people of France. Jeanne, thou must go into France.\u0027 On[Pg i.194] hearing these words I began to weep. Then the Voice said unto me: \u0027Go to Vaucouleurs. There shalt thou find a captain, who will take thee safely into France, to the King. Fear not.\u0027 I did as I was bidden, and I came to the King without hindrance.\"[747] Then the word fell to Brother Guillaume Aimery: \"According to what you have said, the Voice told you that God will deliver the people of France from their distress; but if God will deliver them he has no need of men-at-arms.\" \"In God\u0027s name,\" replied the Maid, \"the men-at-arms will fight, and God will give the victory.\" Ma?tre Guillaume declared himself satisfied.[748] On the 22nd of March, Ma?tre Pierre de Versailles and Ma?tre Jean érault went together to Jean Rabateau\u0027s lodging. The squire, Gobert Thibault, whom Jeanne had already seen at Chinon, came with them. He was a young man and very simple, one who believed without asking for a sign. As they came in Jeanne went to meet them, and, striking the squire on the shoulder, in a friendly manner, she said: \"I wish I had many men as willing as you.\"[749] With men-at-arms she felt at her ease. But the doctors she could not tolerate, and she suffered torture when they came to argue with her. Although these theologians showed her great consideration, their eternal questions wearied her; their slowness and heaviness exasperated her. She bore them a grudge for not believing in her straightway, without proof, and for asking her for a sign, which she could not give them, since neither Saint Michael nor Saint Catherine nor Saint Margaret appeared during the exam[Pg i.195]ination. In retirement, in the oratory, and in the lonely fields the heavenly visitants came to her in crowds; angels and saints, descending from heaven, flocked around her. But when the doctors came, immediately the Jacob\u0027s ladder was drawn up. Besides, the clerks were theologians, and she was a saint. Relations are always strained between the heads of the Church Militant and those devout women who communicate directly with the Church Triumphant. She realised that the revelations granted to her so abundantly inspired her most favourable judges with doubts, suspicion, and even mistrust. She dared not confide to them much of the mystery of her Voices, and when the Churchmen were not present she told Alen?on, her fair Duke, that she knew more and could do more than she had ever told all those clerks.[750] It was not to them she had been sent; it was not for them that she had come. She felt awkward in their presence, and their manners were the occasion of that irritation which is discernible in more than one of her replies.[751] Sometimes when they questioned her she retreated to the end of her bench and sulked. \"We come to you from the King,\" said Ma?tre Pierre de Versailles. She replied with a bad grace: \"I am quite aware that you are come to question me again. I don\u0027t know A from B.\"[752] But to the question: \"Wherefore do you come?\" she made answer eagerly: \"I come from the King of Heaven to raise the siege of Orléans, and take the King to be crowned and anointed at Reims. Ma?tre Jean érault, have you ink and[Pg i.196] paper? Write what I shall tell you.\" And she dictated a brief manifesto to the English captains: \"You, Suffort, Clasdas, and La Poule, in the name of the King of Heaven I call upon you to return to England.\"[753] Ma?tre Jean érault, who wrote at her dictation, was, like most of the clerks, favourably disposed towards her. Further, he had his own ideas. He recollected that Marie of Avignon, surnamed La Gasque, had uttered true and memorable prophecies to King Charles VI. Now La Gasque had told the King that the realm was to suffer many sorrows; and she had seen weapons in the sky. Her story of her vision had concluded with these words: \"While I was afeard, believing myself called upon to take these weapons, a voice comforted me, saying: \u0027They are not for thee, but for a Virgin, who shall come and with these weapons deliver the realm of France.\u0027\" Ma?tre Jean érault meditated on these marvellous revelations and came to believe that Jeanne was the Virgin announced by Marie of Avignon.[754] Ma?tre Gérard Machet, the King\u0027s Confessor, had found it written that a Maid should come to the help of the King of France. He remarked on it to Gobert Thibault, the Squire, who was no very great personage;[755] and he certainly spoke of it to several others.[Pg i.197] Gérard Machet, Doctor of Theology, sometime Vice Chancellor of the University, from which he was now excluded, was regarded as one of the lights of the Church. He loved the court,[756] although he would not admit it, and enjoyed the favour of the King, who had just rewarded his services by giving him money with which to purchase a mule.[757] All doubts concerning the disposition of these doctors are removed by the discovery that the King\u0027s Confessor himself put into circulation those prophecies which had been distorted in favour of the Maid from the Bois-Chenu. The damsel was interrogated concerning her Voices, which she called her Council, and her saints, whom she imagined in the semblance of those sculptured or painted figures peopling the churches.[758] The doctors objected to her having cast off woman\u0027s clothing and had her hair cut round in the manner of a page. Now it is written: \"The woman shall not wear that which pertaineth unto a man, neither shall a man put on a woman\u0027s garment: for all that do so are abomination unto the Lord thy God\" (Deuteronomy xxii, 5). The Council of Gangres, held in the reign of the Emperor Valens, had anathematised women who dressed as men and cut short their hair.[759] Many saintly women, impelled by a strange inspiration of the Holy Ghost, had concealed their sex by[Pg i.198] masculine garb. At Saint-Jean-des-Bois, near Compiègne, was preserved the reliquary of Saint Euphrosyne of Alexandria, who lived for thirty-eight years in man\u0027s attire in the monastery of the Abbot Theodosius.[760] For these reasons, and because of these precedents, the doctors argued: since Jeanne had put on this clothing not to offend another\u0027s modesty but to preserve her own, we will put no evil interpretation on an act performed with good intent, and we will forbear to condemn a deed justified by purity of motive. Certain of her questioners inquired why she called Charles Dauphin instead of giving him his title of King. This title had been his by right since the 30th of October, 1422; for on that day, the ninth since the death of the King his father, at Mehun-sur-Yèvre, in the chapel royal, he had put off his black gown and assumed the purple robe, while the heralds, raising aloft the banner of France, cried: \"Long live the King!\" She answered: \"I will not call him King until he shall have been anointed and crowned at Reims. To that city I intend to take him.\"[761] Without this anointing there was no king of France for her. Of the miracles which had followed that anointing she had heard every year from the mouth of her priest as he recited the glorious deeds of the Blessed Saint Remi, the patron saint of her parish. This reply was such as to satisfy the interrogators because, both for things spiritual and temporal, it was important that the King should be anointed at[Pg i.199] Reims.[762] And Messire Regnault de Chartres must have ardently desired it. Contradicted by the clerks, she opposed the Church\u0027s doctrine by the inspiration of her own heart, and said to them: \"There is more in the Book of Our Lord than in all yours.\"[763] This was a bold and biting reply, which would have been dangerous had the theologians been less favourably inclined to her. Otherwise they might have held it to be trespassing on the rights of the Church, who, as the guardian of the Holy Books, is their jealous interpreter, and does not suffer the authority of Scripture to be set up against the decisions of Councils.[764] What were those books, which without having read she judged to be contrary to those of Our Lord, wherein with mind and spirit she seemed to read plainly? They would seem to be the Sacred Canons and the Sacred Decretals. This child\u0027s utterance sapped the very foundations of the Church. Had the doctors of Poitiers been less zealously Armagnac they would henceforth have mistrusted Jeanne and suspected her of heresy. But they were loyal servants of the houses of Orléans and of France. Their cassocks were ragged and their larders empty;[765] their only hope was in God, and they feared lest in rejecting this damsel they might be denying the Holy Ghost. Besides, everything went to prove that these words of Jeanne were uttered without guile and in all ignorance and[Pg i.200] simplicity. No doubt that is why the doctors were not shocked by them. Brother Seguin of Seguin in his turn questioned the damsel. He was from Limousin, and his speech betrayed his origin. He spoke with a drawl and used expressions unknown in Lorraine and Champagne. Perhaps he had that dull, heavy air, which rendered the folk of his province somewhat ridiculous in the eyes of dwellers on the Loire, the Seine, and the Meuse. To the question: \"What language do your Voices speak?\" Jeanne replied: \"A better one than yours.\"[766] Even saints may lose patience. If Brother Seguin did not know it before, he learnt it that day. And what business had he to doubt that Saint Catherine and Saint Margaret, who were on the side of the French, spoke French? Such a doubt Jeanne could not bear, and she gave her questioner to understand that when one comes from Limousin one does not inquire concerning the speech of heavenly ladies. Notwithstanding he pursued his interrogation: \"Do you believe in God?\" \"Yes, more than you do,\" said the Maid, who, knowing nothing of the good Brother, was somewhat hasty in esteeming herself better grounded in the faith than he. But she was vexed that there should be any question of her belief in God, who had sent her. Her reply, if favourably interpreted, would testify to the ardour of her faith. Did Brother Seguin so understand it? His contemporaries represented him as being of a somewhat bitter disposition. On the contrary, there is reason to believe that he was good-natured.[767] [Pg i.201] \"But after all,\" he said, \"it cannot be God\u0027s will that you should be believed unless some sign appear to make us believe in you. On your word alone we cannot counsel the King to run the risk of granting you men-at-arms.\" \"In God\u0027s name,\" she answered, \"it was not to give a sign that I came to Poitiers. But take me to Orléans and I will show you the signs wherefore I am sent. Let me be given men, it matters not how many, and I will go to Orléans.\" And she repeated what she was continually saying: \"The English shall all be driven out and destroyed. The siege of Orléans shall be raised and the city delivered from its enemies, after I shall have summoned it to surrender in the name of the King of Heaven. The Dauphin shall be anointed at Reims, the town of Paris shall return to its allegiance to the King, and the Duke of Orléans shall come back from England.\"[768] Long did the doctors and masters, following the example of Brother Seguin of Seguin, urge her to show a sign of her mission. They thought that if God had chosen her to deliver the French nation he[Pg i.202] would not fail to make his choice manifest by a sign, as he had done for Gideon, the son of Joash. When Israel was sore pressed by the Midianites, and when God\u0027s chosen people hid from their enemies in the caves of the mountains, the Angel of the Lord appeared to Gideon under an oak, and said unto him: \"Surely I will be with thee and thou shalt smite the Midianites as one man.\" To which Gideon made answer: \"If now I have found grace in thy sight, then shew me a sign that thou talkest with me.\" And Gideon made ready a kid and kneaded unleavened cakes; the flesh he put in a basket, and he put the broth in a pot and brought the pot and the basket beneath the oak. Then the Angel of God said unto him: \"Take the flesh and the unleavened cakes, and lay them upon this rock, and pour out the broth.\" And he did so. Then the angel of the Lord put forth the end of the staff that was in his hand, and touched the flesh and the unleavened cakes; and there rose up fire out of the rock, and consumed the flesh and the unleavened cakes. When Gideon perceived that he had seen an angel of the Lord, he cried out: \"Alas, O Lord God! for because I have seen an angel of the Lord face to face.\"[769] With three hundred men Gideon subdued the Midianites. This example the doctors had before their minds.[770] But for the Maid the sign of victory was victory itself. She said without ceasing: \"The sign that I will show you shall be Orléans relieved and the siege raised.\"[771] Such persistency made an impression on most of her interrogators. They determined to make of it,[Pg i.203] not a stone of stumbling, but rather an example of zeal and a subject of edification. Since she promised them a sign it behoved them in all humility to ask God to send it, and, filled with a like hope, joining with the King and all the people, to pray to the God, who delivered Israel, to grant them the banner of victory. Thus were overcome the arguments of Brother Seguin and of those who, led away by the precepts of human wisdom, desired a sign before they believed. After an examination which had lasted six weeks, the doctors declared themselves satisfied.[772] There was one point it was necessary to ascertain; they must know whether Jeanne was, as she said, a virgin. Matrons had indeed already examined her on her arrival at Chinon. Then there was a doubt as to whether she were man or maid; and it was even feared that she might be an illusion in woman\u0027s semblance, produced by the art of demons, which scholars considered by no means impossible.[773] It was not long since the death of that canon who held that now and again knights are changed into bears and spirits travel a hundred leagues in one night, then suddenly become sows or wisps of straw.[774] Suitable measures had therefore been taken. But they must be carried out exactly, wisely, and cautiously, for the matter was of great importance. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3040/83992.html","bookId":1034,"book":{"id":1034,"title":"The Life of Joan of Arc","description":"简介： SCHOLARS have been good enough to notice this book; and the majority have treated it very kindly, doubtless because they have perceived that the author has observed all the established rules of historical research and accuracy. Their kindness has tou...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3040","creation":"Aug 1, 2019 12:24:12 AM","modification":"Aug 1, 2019 12:24:12 AM"}}
