{"id":51277,"no":103,"title":"Chapter 26 If I let go of you, I won’t have a wife anymore! (3)","content":"Chapter 26 If I let go of you, I won’t have a wife anymore! (3) “Bing’er, what is the Heavenly Bow Unit? How come I’ve never heard about it before?” “You haven’t heard of the Heavenly Bow Unit?” “Yeah, I didn’t enter a military institute to study, nor did I go to a Jewel Master institute, so naturally I have never heard of them.” “The Heavenly Bow Unit is a legend in our Heavenly Bow Empire. In fact, in the past, our country was not known as the Heavenly Bow Empire, and it was because of the Heavenly Bow Unit and its merits that caused our country’s name change.” “Wow! That strong? Could it be that the Heavenly Bow Unit is even stronger than my father?” “I’m not sure about that, I have heard that there are only a few members in the Heavenly Bow Unit, but they are all top level godlike archers, and they can only be commandeered by His Majesty. There have been a few times in history when our country was in dire straits, and it was only because they took action, taking down some key members of enemy armies, that caused the tides to turn and saving us all. I’ve heard that their individual combat abilities might not be the strongest, but they are extremely skilled assassins that even Heavenly Jewel Masters have to fear.” “At that point in time, the Kalise Empire was at the peak of its power, and they had seven Heavenly Jewel Masters, while we only had Admiral Zhou alone. We were in deep danger, facing extinction, as the Kalise armies were at our very borders. However, in one single night, four of the strongest Heavenly Jewel Masters on the Kalise side died under their bows. That caused the Kalise Army Commanders and their Emperor to panic and order the armies to retreat from the border, and in the next sixteen years up to now, they have never fully recovered from that time. It can be said that it was the seniors of the Heavenly Bow Unit which saved our very empire. If we are able to pass the test and actually join the Heavenly Bow Unit, that would be the greatest honour.” “So formidable? I really have to meet them!” Zhou Weiqing said excitedly. ... Ten days later. Heavenly Bow City. After ten days of hasty travel, Zhou Weiqing and Shangguan Bing’er finally returned to the capital city. “Bing’er, where should we go to look for the Heavenly Bow Unit? When I left, my father did not give me any other instructions.” Zhou Weiqing asked as he looked high and low. Both were dressed in cloth attire, and while it was fine for Zhou Weiqing as his honest appearance did not cause him to stand out in the crowd, but Shangguan Bing’er’s beauty could not be hidden by even the simple clothing, and she was definitely still a head-turner. Luckily, Zhou Weiqing took prompt action, quickly handing her his large Wind Hat to over her face, slightly resolving the situation. Shangguan Bing’er said: “Admiral Zhou gave me a letter, and told me to open it when I reached Heavenly Bow City.” Zhou Weiqing said curiously: “Well, let’s open it and see. By the way, do you want to come home with me later? Or should I go back with you?” [1. Moving so fast, my dear boy] Shangguan Bing’er took out a letter from her bosom, and as she heard his words, she blushed: “Little Fatty, no, we’re still too small [2. 小 should usually mean young in this context, but it can also mean small, and I used it here because he puns with it in the next two paragraphs] … perhaps when we return from training in the Heavenly Bow Unit.” Traveling together these few days, Shangguan Bing’er had finally started to accept Zhou Weiqing a little, however our dear Little Fatty felt that he was still living a tragedy. In the past, Shangguan Bing’er always had a cold front towards him, and at least he didn’t dare have any untoward thoughts. However, now that the two of them had some relations, with his character, how could he not have some thoughts of being intimate with her. Alas, Shangguan Bing’er refused to be overly intimate with him due to his age, and the most she would do was to hold hands with him, or the occasional rare, quick embrace, causing Zhou Weiqing to itch in his heart, but he had no choice in the matter. Zhou Weiqing turned his hot gaze to sweep across her body, muttering to himself: “Small? I don’t think that’s small at all! It’s just nice and perfect… hmm… probably 33 or 34C, at the age of sixteen, that’s a lot of latent potential…” “ZHOU … LITTLE… FATTY!” Shangguan Bing’er grabbed hold of his ear and twisted. “What are you saying??” “Ah? Nothing! I was uhh saying, that we aren’t that young, according to our country’s law, sixteen is of marriageable age. You are already of suitable age, and I’ve matured early as well!” Shangguan Bing’er blushed again as she said: “Maturing early still doesn’t make it right. Little Fatty, I really am not prepared. I’ve lived along with my mom since I was young, and we depend a lot on each other, and her temper is not good. Can you wait at least 2 more years for me?” Zhou Weiqing shrugged helplessly: “Alright, I’ll listen to my wife dearest’s instructions.” Shangguan Bing’er rolled her eyes at him, but seeing that he was listening to her also put her in a good mood, and she did not quibble about him taking advantage of her with his words. As she opened the letter in her hands, she saw that there was only one line written on it: “Go to the first level of the Di Hao Inn, and look for a drunkard called Luo Ke Di. Tell him this - ‘I am looking for the Liu of the Unparalleled Liu Duo.’ He will bring you to take the test to enter the Heavenly Bow Unit.” Shangguan Bing’er passed Zhou Weiqing the letter for him to take a look as well, and they exchanged looks. The Di Hao Inn was a rather well known landmark in the Heavenly Bow City; it was six stories tall and was one of the largest, most well known inns in the entire city. The most interesting thing about the inn was that it catered to all walks of life, the higher the level of the inn, the higher the ranking and the price; as Heavenly Bow City citizens, they naturally knew the place. Shangguan Bing’er said: “I shall head home first to see my mother, let’s meet tomorrow at noon outside the Di Hua Inn alright?” Zhou Weiqing could not bear to part with her, and held on to her hand. A laugh slipped out of Shangguan Bing’er and she said: “Look at your foolish appearance.” She spread her arms and gave him an embrace, and just as she was about leave, she was hugged in return by Zhou Weiqing. Of course, he didn’t dare to go overboard, and just kissed her lightly on her forehead. Watching the Shangguan Bing’er as she vanished around the corner of the street, Zhou Weiqing regained his senses and headed back home as well. Admiral Zhou’s house was a manor with a relatively small courtyard, and the entire area was less than a thousand square metres, with around a dozen servants and without a single guard. If they didn’t witness it for themselves, no one would believe that the Heavenly Bow Empire’s commander in chief would have a house like that. However, Admiral Zhou had said that soldiers were meant to fight on the battlefield, and not as a guard. Even Emperor Di Feng Ling had brought up to Admiral Zhou about improving or expanding his manor, but he had always rejected it. In the empire, Admiral Zhou was one of the most respected persons, not just because he was the strongest person in the empire or the commander in chief of the army, but also because he was an extremely good role model. With a leader like that, how could the ranking officials in the Empire dare embezzle. “Mum, I’m home!” As soon as Zhou Weiqing entered the house, he shouted at the top of his lungs. “You little brat, you still know to come back! Did you hear that your father went back to the front lines, so you came running back? Come, let mommy see you, have been eating well? Are you thinner?” As soon as Zhou Weiqing’s shout resounded out, a voice cried out in reply, mixed with excitement, love and anger. From the inner courtyard, a lady walked out; it was Admiral Zhou’s wife, Zhou Weiqing’s mother. Zhou Weiqing’s mother, Ling Zihan was not a great beauty, and could probably only be considered above average in terms of looks. She was a childhood friend of Admiral Zhou’s, and their love was very deep. Even after Admiral Zhou was famous, and he found out that his son’s meridians were blocked, he still didn’t bear to let his wife give birth to another child; from that you could see how much he loved his wife, and thus he did not marry again. “Mum!!” Seeing his mother, Zhou Weiqing couldn’t help but leap forward and give her a big hug. Ling Zihan was originally very angry with him for running away from home, but with that hug, most of the anger vanished. Lifting her hand to give Zhou Weiqing a knock on the head, she scolded: “You little brat, you think your wings are ready to spread? You actually dared to run away from home? Hmph, wasn’t it just looking at the princess bathe, how big a deal is that? Difuya that girl is your fiancee, what’s wrong with looking! Will she lose a piece of meat looking? Why did you run!?” If Shangguan Bing’er was here, she’d definitely be shocked by how doughty and intrepid Ling Zihan was. Zhou Weiqing said with a woebegone expression: “Wasn’t that because Dad was at home? If he weren’t at home, I wouldn’t have ran.” Ling Zihan gave a cold humph: “So what if he’s at home? As if he can beat you to death? When your father beats you, it’s for your own good. Every time he beats you, aren’t you still full of energy? Although you aren’t able to cultivate Heavenly Energy, but when he beats you, he always used Heavenly Energy to improve your body. If not for that, if that old fellow beat you for nothing, I would have dealt with him!” Zhou Weiqing stared dumbfoundedly at his mother, only now did he know how much effort his father had spent on him, that even his beatings were not just to teach him, but to help him. All this while, although he knew his father loved him, he always thought his mum loved him more. However, listening to his mother’s words, he suddenly realised that his father’s love for him was no lesser, although he never expressed it out clearly. At that moment, the sudden shock, the sudden contrast in his heart, made him stand there in a daze, speechless. [3. Awwwwwwwwwww!!!] Right at that moment, a sudden clear and enraged voice sounded out from outside the manor. “Zhou Weiqing! Get out here right now!” The voice was extremely forceful, and gave Zhou Weiqing a fright; even Ling Zihan at his side was rather startled, after all the little brat had just returned home, how could someone find trouble with him so quickly? “What’s going on? Who’s that, you little brat?” Ling Zihan asked curiously. Zhou Weiqing’s memory was very good, but he could not find any trace of such a voice in his memories, and he said with a puzzled face: “I do not know as well! Let me go out and see.” As he said that, he rushed out. The Zhou Family manor did not have any guards, and only had some servants, but in all the dozens of years the manor had stood there, this was the first time that someone had dared to shout and yell outside the Admiral’s Manor, even holding a scolding tone. All the servants within the compound were rather puzzled, wondering who it was who had such guts to come here looking for trouble. The Zhou Family Manor usually had its door open, and before Zhou Weiqing could exit, the owner of the voice had already entered. There were two people, and on sight of them, Zhou Weiqing’s heart clutched. It was two females, the one at the back was the person he had just parted with less than an hour ago, Shangguan Bing’er. At this moment, her face was full of worry, and her hands were being held by the woman in front, as if she had been dragged here. The woman holding onto Shangguan Bing’er seemed to be around 30 years of age, and if Shangguan Bing’er’s beauty were to be described as a little under-ripe, then this lady would be definitely in the prime of her beauty, the sort of striking looks that was usually peerless in a generation, that could even shake the spirit. Although her face was icy cold in anger, Zhou Weiqing couldn’t help but stare a little. Shangguan Bing’er and the lady had very similar features, and without question Zhou Weiqing knew who she was. “Who’s Zhou Weiqing? the middle aged lady asked coldly, her breathing was obviously ragged as if the sheer rage surrounding her was igniting the very air. “Aunty, how are you, I am Zhou Weiqing.” Zhou Weiqing did not dare hesitate, and quickly stepped forward, looking at her with his honest expression. “Who’s your aunty? You’re Zhou Weiqing? Good, I’ve been looking for you. Do you want to take your own life, or do you want me to take action personally?” When the middle aged lady looked at Zhou Weiqing, he felt a cold shiver run down his spine, as if his body was being pierced by two sharp swords. “Is there need to be so ruthless…?” Zhou Weiqing asked, dumbfounded. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-5-chapter-26-03","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
