{"id":51300,"no":126,"title":"Chapter 34 Ring of Concealment (3)","content":"Chapter 34 Ring of Concealment (3)\n \n Zhou Weiqing was rather shocked in his heart, as what Tang Xian said was totally correct. After lots of experimentation, he had found out that he indeed required ten seconds after using the Touch of Darkness before he could use it again. This wasn’t a matter of a lack of Heavenly Energy, but was the recovery period after the Darkness Attribute was used.\n Tang Xian continued saying: “Ten seconds might seem very short to you now, but as your power levels grow higher, ten seconds is more than sufficient to decide your life and death ten times over. The more Control Skills you have, the more they can coordinate and overlap, and the initiative you have in the battlefield against your enemies. If you manage to control your enemies, you will be able to defeat or kill them easily. No matter how strong he is, as long as he is Controlled by you permanently, he will not even have the chance to counterattack. At the same time, a strong Heavenly Jewel Master usually has extremely strong defences. If you Control him and attack him once, you might not be able to kill him off. Under such circumstance, you will need to continue Controlling with different skills. Remember, while companions are important, none can compare in terms of reliability to yourself. Never put your life in another person’s hands, if you want to be powerful, you have to first learn how to control yourself.”\n “Control yourself” Zhou Weiqing repeated the words, all of a sudden he felt as if a door had been opened in his mind. ‘Control yourself’ those words seemed so simple, yet with so many hidden profound secrets and deeper meaning behind it.\n In an abrupt motion, Tang Xian raised her hand and a grey light shot forth towards Zhou Weiqing. Subconsciously, he raised his hands and caught it, only to see it was a black ring. As he examined it closely, he found it was totally black, not reflecting any light at all, and seemed rather ordinary.\n Tang Xian stroked Shangguan Bing’er’s hair tenderly as she said: “Little Fatty, that ring is called the Ring of Concealment, and it can be considered Bing’er’s dowry that I’m giving you. If you wear it on the ring finger of your left hand, and circulate some Heavenly Energy within, you can change the look of your Alexandrite Cat’s Eye into any of your Elemental Attributes, thus concealing its identity.”\n Zhou Weiqing was overjoyed. This item might be pretty useless to most people, but it was an extreme treasure for him. Not only could he prevent any trouble arising from anyone discovering his Alexandrite Cat’s Eye, he could also use it to trick the enemies he was facing but allowing them to surprising them with an Elemental Skill they would never expect. It was as if this item was custom made for him!\n “Aunty… uhh, no, Mum, since this is Bing’er’s dowry, then I shall not be polite.” Zhou Weiqing quickly wore it on his ring finger delightedly, causing Shangguan Bing’er to flush in embarrassment as she hugged her mother’s arm.\n Tang Xian smiled faintly and said: “Little Fatty, remember, if I find that you hurt Bing’er, I will take back the ring, along with your life.”\n Although she was smiling as she said that, Zhou Weiqing felt a chill down his spine and he could only grin foolishly and not speak.\n Tang Xian said: “You two chat a while, I’ll head in first.” As she said that, she looked at Zhou Weiqing before heading back inside.\n As soon as Tang Xian left, Zhou Weiqing relaxed noticeably. In a few steps, he had ran over to Shangguan Bing’er’s side, hugging her. She cried out in surprise: “Quick let go of me, my mum will see us!”\n Zhou Weiqing grinned and said: “Our mother has already confirmed our relationship, she won’t mind seeing us. Come, give your husband a kiss.”\n Shangguan Bing’er lifted her hand to cover his mouth. “Don’t play anymore. Little Fatty, let me lean on you for a while okay?”\n Zhou Weiqing started, and his gaze turned soft as he put her down, softly enveloping her in a warm hug. He then told her everything that had happened in the palace and his own thoughts.\n “If you do not marry Her Highness, can you get pass His Majesty and your father?”\n Zhou Weiqing said solemnly: “Bing’er, do not worry. I will do my best to distinguish myself and gain merits for the country. No matter what, I will never marry Difuya. I like you more not because you’re more beautiful than her, but because your character is so much better than hers. In my heart, you are so much better than her, perfect to me. Bing’er, I love you.” Shangguan Bing’er’s brow quivered and she hugged him closer.\n Zhou Weiqing stayed for almost 4 hours before leaving reluctantly. However, before he left, he passed the Spatial Ring to Shangguan Bing’er. After all, she would have to head to Fei Li Empire alone in a few months time, and he would feel better if she had Da Huang and Er Huang together with her for protection.\n After leaving Bing’er’s house, Zhou Weiqing returned home to bid his mother goodbye, before packing up his things, shouldering his Black Dawn Bow, and leaving the Heavenly Bow City towards the Fei Li Empire.\n Zhou Weiqing’s current cultivation was a huge difference from the past, and as soon as he left the Heavenly Bow City, the eleven energy whirlpools from the Death Acupuncture Points he had broken through all started spinning at top speed, greedily drawing in energy from the atmosphere and replenishing his energy while he charged forth into the Stars Forest, taking a straight-line pat towards Fei Li Empire. At this time, six Death Acupuncture Points of the second portion of his Immortal Deity Technique had already been broken through.\n The second portion of the Immortal Deity Technique were the eight Death Acupuncture Points on the back, and the ones that he had broken through were as follows: The Fei Shu Death Acupuncture Point at the 3rd section of the spinous process of thoracic vertebra, the Jue Yin Shu Death Acupuncture Point at the 4th section, Xin Shu Death Acupuncture Point at the 5th section, Jian Shu Death Acupuncture Point at the 2nd section of the spinous process of lumbar vertebra, the Ming Men Death Acupuncture Point between 2nd and 3rd portion, and the Zhi Shi Death Acupuncture Point which was 3 inches from the Ming Men Death Acupuncture Point.\n As compared to the five Death Acupuncture Points of the first portion, the second portion’s Death Acupuncture Points were a lot worse, many of them can instantly cause death. In this two years, although Zhou Weiqing seemed to have cultivated extremely quickly, almost catching up to Shangguan Bing’er, but whenever he broke through a Death Acupuncture Point, it was a painful battle for life and death. Furthermore, the sheer pain he had to go through made him almost feel like ending his own life, torturing all his senses. Luckily, every time he broke through his Death Acupuncture Points, he had Shangguan Bing’er nearby to accompany him. When he was breaking through the Ming Men Death Acupuncture Point, the intense pain had almost made him go crazy and bite his own tongue off, and it was Shangguan Bing’er who shoved her arm into his mouth, and up till now, there was still the bite mark visible due to that incident.\n The Immortal Deity Technique was simple to cultivate, and extremely fast, but the pain it brought was the drawback. However, its good points were also clear, currently with his eleven energy whirlpools spinning at the same time, Zhou Weiqing’s cultivation rate was many times faster than previously. Even though the amount of Heavenly Energy required was now much larger, but his cultivation rate had not slowed. The greatest benefit was of course the sheer speed at which his energy regenerated; when using skills during battle, his energy reserves could last almost as long as his teacher Mu En, who was already at the 5th level of the Heavenly Shen Energy Stage. From there, you could tell how overpowered the Immortal Deity Technique was.\n At the same time, as he broke through more Death Acupuncture Points, the stronger his Immortal Deity Shield was. With eleven energy whirlpools, the shield’s defense was much stronger. Since it was automatically triggered upon any attacks, he was nearly immune to any ordinary arrows by now.\n “Fat Cat, I say, shouldn’t you turn big and let me ride you?” Zhou Weiqing tweaked the ears of the Little White Tiger which was nestled comfortably in his arms, snoozing.\n “Wuu wuuu” Fat Cat gave a small cry, then ignored him, going back to rest.\n Zhou Weiqing said exasperatedly: “You little thing, you can clearly grow bigger, and there is no one else around now. You better serve your master well now! These two years, I’ve fed you well, and even accompanied you to sleep every night, yet you’re still ignoring me! Hmph, be careful or I, Your Father, will beat you! Look at Da Huang and Er Huang, at least I can ride them, you’re so useless compared to them.”\n When it heard that, Fat Cat opened its eyes angrily, and gave two furious howls, as if saying How dare you compare me to those two stupid bears!\n Alas, Zhou Weiqing could do nothing about Fat Cat. Ever since that day when this little fellow had saved them all, it had never turned big again. Although he said he fed it well, that was rather against his conscience. After all, these two years, that little thing had not ate or drank a single thing, nor had it grown at all, with the only difference being the change in its fur. By now, Zhou Weiqing had grown used to it being by his side, and playing and teasing it had also become a favourite past-time.\n …\n 7 days later. Flying Hill City.\n Rushing at his maximum speed, Zhou Weiqing easily made his way to the city as he was already familiar with the route. Previously, when he had entered the Heavenly Bow Unit, he had written to Huyan Aobo about his circumstances, lest his teacher think he was still in the normal army camp and went looking for him. After entering the Flying Hill City, Zhou Weiqing quickly headed to the little courtyard where Huyan Aobo stayed. However, before he could knock on the door, he heard a loud booming laughter sounding out in pride.\n “Wahaha, hahaha! I, Your Father have finally succeeded after two years! Who says that only Zong Stage Consolidated Equipment Masters are able to create Socketing Scrolls! I, Your Father, have also succeeded! Wahaha, if not for the fact that I wasn’t a Heavenly Jewel Master, I would have long become a Zong Stage Consolidated Equipment Master!”\n “Old Huyan, you really succeeded?” Another excited voice sounded out.\n “Yes! I finally succeeded after two years. This little thing is even tougher to make than Consolidated Equipment Scrolls.”\n Zhou Weiqing tapped on the door, thinking to himself: What did this Huyan Teacher make this time, to be so excited? Taking two years to create a scroll? That must be something good! Could it be for me? Heh Heh!\n “Didn’t you see the sign at the door?” Huyan Aobo’s impatient voice came from within.\n Only then did Zhou Weiqing see a sign hung at the side of the door, on it was written: “Not selling Consolidated Equipment Scrolls.”\n “Huyan Teacher, it’s me, Zhou Weiqing!” He could only shout out helplessly.\n Strangely, as soon as he shouted that, silence descended upon the house. After a few seconds, the door opened and Huyan Aobo and Feng Yu’s surprised faces popped out. Huyan Aobo blinked at him and said: “Little Brat, have you taken up fortune telling?”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-5-chapter-34-03","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
