{"id":51187,"no":13,"title":"Chapter 4 The secrets of Heavenly Jewel Masters (1)","content":"Chapter 4 – The secrets of Heavenly Jewel Masters (1) The camp was just outside the city gates, and Zhou Weiqing walked into the camp excitedly, touching his brand new internal armor and his freshly custom made 1 kg hat. It seems it had totally forgotten what trouble he had gotten himself into yesterday. As he entered the camp, he bumped into someone familiar. It was the the Company Leader who had asked him how the feeling was like. However, at this time, this fellow’s face was all serious, and he held out a hand to stop Zhou Weiqing. “You’re Little Fatty Zhou right?” Zhou Weiqing gave a honest smile, “Yes! Company Leader Big Bro, I’m Little Fatty Zhou.” The Company Leader said with a stern voice: “What Big Bro? In the army, there is only our posts and ranks. I’m Mao Li, Company Leader from the 5th Regiment, 3rd Battalion, 4th Company. From now onwards, you are a member of my 4th Company, understood?” Zhou Weiqing replied: “Understood”. Although he said that, but in his heart he was slandering the Company Leader: Mao Li? Donkey? Company Leader Donkey? TL: 毛利 Mao Li is the name, sounding similar to 毛驴 Mao Lu which means donkey. Company Leader Mao Li did not know that a moment of solemnity had caused that rascal to give him such a nickname, a nickname that would follow him throughout his entire military career. “Follow me.” Mao Li turned and headed towards the main tent. Zhou Weiqing followed him rather perplexedly, wondering why the Company Leader would personally look after him. After all, he was just a fresh new recruit, normally a squad leader would be handling him. After all, a Company Leader was leading 100 men, and for Heavenly Bow Empire whose army was rather small, they were considered as mid-ranked officials in the army, while a Battalion Commander like Shangguan Bing’er was already considered a high ranking general. Mao Li brought him deeper and deeper into the camp, into a more desolated area, before finally entering a small tent at the very edge of the camp site. Zhou Weiqing followed him in. The tent was only 10 metres or so in size, and there was only one bunk in it, without any other decorations or equipment. Mao Li stood in the tent, saying: “Before the recruitment ends and we head to the recruit training, you will be staying here. This time, our 5th Regiment will be recruiting a thousand men, and our 3rd Battalion alone will be recruiting a hundred, and I estimate we’ll probably take at least half a month to finish recruitment. Zhou Weiqing said in surprise: “Wow, Company Leader, the treatment of our soldiers are so good, we all have our own personal tents?” “Heh heh” Mao Li laughed, saying: “Of course not, this is specially for you. You rascal, I can’t help you here, you’ll have to take responsibility for your own actions. Alright, you just rest for now. The army mess is at the left quadrant of the camp, and should be very easy to find. When it is time for us to head for the recruit training, someone will inform you.” With that, he turned and left the tent. After Mao Li had left, Zhou Weiqing had a very bad feeling about the current scenario. He took off his longbow and quiver and left them on the floor before exiting the tent as well. Previously, he had not examined the area closely. Now, with a wary heart, he took a more detailed survey of his surroundings, and realised that the closest tent to him was 50 metres away. It could be said that his tent was on the very edge of the camp. Could it be that his real identity had been discovered? That shouldn’t be possible! He had been so careful. Suddenly, an beautiful but angry face flashed into Zhou Weiqing’s mind, and his heart sank, muttering to himself: “Shangguan Bing’er that chick is the top genius in the Empire, she shouldn’t be a big-boobed bimbo and be so fussy and vindictive against me right?” “Zhou….Little…. Fatty….!!!!” At this time, an angry voice which clearly was with teeth gritted sounded in his ear. The voice was as enchanting as an oriole’s chirp, but the tone in it did not bode well for Zhou Weiqing. Zhou Weiqing spun around quickly, to see Shangguan Bing’er dressed in army fatigues with a dark purple longbow on her back. Zhou Weiqing couldn’t help but stare at her in a daze; her air was tied up in a ponytail, and she was not wearing any armor, allowing the dark purple fatigues she was wearing to further accentuate her curves. Coupled with the longbow on her back, she was a lovely picture of a valiant warrior. Unfortunately, the expression on her lovely face was extremely black, almost as if she were about to spit out fire, clearly she had heard him say the words ‘big-boobed bimbo’. Ugh, what sort of luck is this? Zhou Weiqing sighed in his heart, quickly putting on his signature honest smile, “Lord Battalion Commander! I was just uh praising you .. uhm .. on your growth uhh.. development …. ….” Having been caught red-handed, even the glib Zhou Weiqing had no idea how to talk his way out of this one. Shangguan Bing’er was furious! She had originally asked Company Leader Mao Li to assign Zhou Weiqing to this isolated tent so that she could take some revenge on him. At first, she was feeling a bit guilty about it, questioning if she was being too hard on him; after all Zhou Weiqing was just a new recruit, and while he was infuriating, his previous ‘misdeeds’ had all been accidental. But after listening to his words just now, how could she still be fooled by his honest outlook. “Private Zhou, Attention!” She shouted loudly. Zhou Weiqing hurriedly stood at attention, there was no comparing the two of them, after all Shangguan Bing’er was not only his commanding officer with a much higher rank, she was also a Heavenly Jewel Master. As the saying goes, a wise man does not fight when the odds are against him. Shangguan Bing’er reached out with her right hand and took out a horse whip from around her waist, and glared and Zhou Weiqing coldly, saying: “Private Zhou, for insulting a superior officer, your punishment is 10 whips, the penalty will be administered by Shangguan Bing’er. Little Fatty Zhou, turn around now.” Zhou Weiqing looked mournfully at the whip in Shangguan Bing’er’s hands, crying in his heart. He did not imagine that he would be whipped on the first day in camp, but now he was under her command and he could only turn around with an unwilling, heavy heart. Shangguan Bing’er gave an angry hrmph, with a quick stride she was behind Zhou Weiqing, and *Pah* sounded resounded as it whipped across Zhou Weiqing’s back. “AHHHHHHHHH!!” Zhou Weiqing’s shrill screams sounded like he was being castrated, his whole body fell onto the floor face first, rolling around in agony. Shangguan Bing’er looked at the whip in her hands questioningly, thinking hesitatingly: Was it that painful? I didn’t use any Heavenly Energy in that blow! This Little Fatty Zhou looks so stout, who knew he is so frail? Zhou Weiqing’s acting was actually so realistic, his body writhing around in pain as he rolled on the ground as if he was about to die. If we were talking about getting beaten up, who had more experience than him? Since young, he had been punished by beatings countless of times by his father, and he was fully experienced in all sorts of trickeries when he was being beaten. When Shangguan Bing’er whipped him, he had already dove forward in perfect timing to reduce the impact on his back, and then acted out the scenario to use his pain to win sympathy. He had a lot of experience using this tactic, and was extremely skilled in pulling it off, to the point where it was almost second nature. In truth, this rascal was gloating in his heart, after all he was wearing the titanium alloy internal armor, added to the fact that Shangguan Bing’er had not used any Heavenly Energy, he pretty much did not even feel anything. As such, his act of pain was only a subconscious act that he had performed, and since he had started with it he might as well milk the situation. Looking at Little Fatty Zhou’s pain, Shangguan Bing’er couldn’t bring herself to hit him a second time. After rolling around for a while, Zhou Weiqing finally quietened down, but still lay there twitching, as if he couldn’t make it already. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-1-chapter-4-01","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
