{"id":51351,"no":177,"title":"Chapter 52 Ye Pao Pao and A Test (3)","content":"Chapter 52 Ye Pao Pao and A Test (3)\n Naturally, Zhou Weiqing giving Kou Rui the Scroll and giving the detailed explanation was part of his plan, designed for the rest of the class to hear. With Kou Rui as an example, no one would have any suspicions that Zhou Weiqing was lying to them.\n Ma Qun was now filled with regret. He originally had the opportunity to be the first! Although he was a Heavenly Jewel Master, he was of common birth, and what he hated most was for his freedom to be restricted. As such, he had always depended on himself throughout his life in cultivating. He had worked hard and finally saved enough to Store the Stoneskin Skill on his first Elemental Jewel, but that had wiped out all his savings. Consolidating Equipment Scrolls were just too expensive, and he just could not afford them. Yet, Zhou Weiqing was willing to provide them with them as long as he was boss in school, and without requiring them to be Sealed or restricting them! This was just an opportunity that only came by once in a blue moon, yet he had not seized that opportunity, and perhaps even offended him. He was even worried that his future possible equipment might be in peril.\n Just as the crowd were staring at Zhou Weiqing excitedly and fanatically, the classroom door opened. Ming Hua entered carrying a large stack of papers.\n As compared to the seductive look she had on yesterday, Ming Hua had a serious and even cold look on right now. When she spotted Zhou Weiqing, her body shuddered slightly, but she continued on towards the podium at the front of the class.\n Zhou Weiqing’s face turned serious and he turned to the other students and said: “Classmates, class has started, let’s all go back to our seats. Do not worry, I will handle each and every one of your requests, it will not take a long time.”\n After saying that, he walked towards Ming Hua, seeming the perfect image of a class monitor, as he took the stack of papers from Ming Hua.\n At that point, he was barely a foot from Ming Hua, and his mouth twitched as he said in a low voice that only the two of them could hear: “Little Wife Teacher, how are you!”\n Ming Hua froze instantly, and she glared at Zhou Weiqing. At that moment, she felt anger welling out in her again, and the instructions from her father last night vanished from her mind, and her usual calm also disappeared as she glared at him viciously, saying through gritted teeth: “If you talk more rubbish, I’ll pit my life to kill you.”\n Zhou Weiqing did not expect her to have such a huge reaction, and he grinned but did not say anything else, placing the stack of papers on the podium and turning back and was about to return to his seat.\n “Stop. Monitor, give out the papers, one set per person. We are having a test.”\n “Test?” Zhou Weiqing stared dumbfounded at Ming Hua, muttering to himself: “Could it be a test on military matters?”\n Ming Hua said coldly: “We are a military academy, what else can we be testing on?” Every year when class starts, we always test the freshmen first. We need to know your current standard of knowledge before we can design a proper teaching plan. You have entered our academy, and you don’t even know this most basic thing?” Seeing Zhou Weiqing’s frozen expression from her words, she felt a sudden rush of happiness. After all, it wasn’t easy to get one over this fellow with words.\n Zhou Weiqing’s face twitched a little, and he thought to himself. Damn, I just managed to earn my status in class, if I get the lowest score in class, how can I keep my position as monitor! Looking at Ming Hua, he thought for the first time that perhaps it would be good to get on her good side as well. Smiling, he said: “Beautiful teacher, as the monitor, I think I should help you reduce your workload. How about, I help you invigilate this test?”\n Ming Hua gave a humph and said: “Stop talking rubbish and give out the papers.” As she said that, she took her seat behind the podium, ignoring Zhou Weiqing. The anger within her had vanished by now, and seeing the gloomy expression on his face, she knew she had caught his weak spot. Hmph, you called me little wife teacher earlier, and now you’re trying to change to beautiful teacher?! Let’s wait and see!\n Zhou Weiqing could only give out the papers helplessly before returning to his own seat.\n Ming Hua said sternly: “Alright, now everyone has the test in hand. Today is the first day of school, and in schedule this is a class meeting. Now, everyone just answer your papers by yourself; this is to test your overall military knowledge, and I hope all of you take this seriously. I will be taking down the scores of all of you, and the lowest two will be in charge of cleaning the classroom for a week. That includes the toilet beside the classroom! Alright, enough said, let us begin. If anyone dares cheat, you’ll get a zero directly. And if there are many zeroes, I will extend the cleaning duties beyond a week.”\n Hearing there was a test, Zhou Weiqing was not the only one who was worried. Speaking of which, the one sitting right beside him at the back row, the large Ma Qun, also had a strange worried look on his face, his brow twitching.\n “Boss Zhou.” Ma Qun sidled closer to Zhou Weiqing and said softly.\n Zhou Weiqing was currently rather gloomy, and said rather bad temperedly: “What?”\n Ma Qun gulped, saying nervously: “Boss Zhou, in the future, I’ll treat you as my boss okay. This time I am serious, and I will never go back on my word. Can you help me get through this test?”\n Zhou Weiqing started. “Haven’t you learnt any military knowledge?”\n Ma Qun’s head drooped down. “In the past, I did attend a military high school, but in classes I was either trying to score with the girls or just sleeping. How could I possibly know how to answer these tests! I only got into this academy because I am a Heavenly Jewel Master, and I didn’t even take the military knowledge test.”\n Zhou Weiqing looked and him seriously and said: “I’m sorry, I really can’t accept you as a follower as I can’t help you. Damn, if you don’t know how to do it, do you think I will? At least you’ve been to a military high school, I haven\u0027t even had that luxury.”\n Ma Qun stared at him, his eyes wide. “What?! Boss, you…”\n Zhou Weiqing furrowed his brow and said: “I’m not all-knowing. It’s up to yourself.” As he said that, he noticed Shangguan Bing\u0027er, who was seated at the front, look at him, worry for him displayed on her face.\n Even if he couldn\u0027t make it for the test, he didn’t want to lose face. Zhou Weiqing immediately gave her a reassuring confident smile, not showing his own worry.\n “The test has started, if you all continue chit chatting, you’ll get a zero.” Ming Hua stood up from behind the podium, walking over. Currently, she looked every bit the stern teacher, a fierce light in her eyes as she looked across the class, and every student felt as if she were looking at them.\n A test… so be it. Zhou Weiqing grabbed a pen from the desk and started writing helplessly. Although he did not have any professional knowledge, he could still write as he pleased. Looking at the questions, he started writing quickly, answering the questions with the best answers he could think off. The way he wrote so quickly, anyone would think he was a skilled scholar.\n Ming Hua had been walking down towards Zhou Weiqing, hoping to look at him fail. However, seeing the way he was writing away, confident and quick, without any hint of wanting to copy from others, she started a little.\n After all, from her experiences with Zhou Weiqing, he had just created too many miracles. Who knows whether this fellow had some other hidden talents or abilities she did not know about. Perhaps he was even well versed in military knowledge… that was totally possible. After all, he had been praised by her brother, who was usually too proud to do so.\n There were eight pages to the exam, and the test took the entire morning. The more Zhou Weiqing wrote, the more confident he felt. Although he had not officially studied any military knowledge, he had after all spent two years in the Heavenly Bow Unit, and had developed his own way of dealing with things. The way he wrote, without any hesitation, caused Ma Qun beside him to stare in amazement. When Zhou Weiqing had first started, Ma Qun thought that he had lied to him, but with his height advantage, he was able to sneak a peek on Zhou Weiqing’s paper, and in doing so, he was even more confused.\n This Boss Zhou was indeed impressive, he totally did not know military knowledge, yet he was still writing with such enthusiasm. What did I just see? He wrote that in military exercises, he would give a few beauties to the opposing commander the night before, causing him to be overly exhausted and not be able to concentrate. What sort of tactics was that? Ma Qun was speechless… he could only bow down to Zhou Weiqing.\n In the end, Ming Hua still ended up standing next to Zhou Weiqing, putting up a look of a serious and fierce examiner, but her eyes were glued to Zhou Weiqing’s paper.\n When she first looked at Zhou Weiqing’s answers, she almost burst out laughing. What was this rascal writing?! Even the easiest of the military knowledge questions, the answers he had written were donkey\u0027s lips that could not fit into a horse\u0027s mouth[1. Direct Translation of the idiom 驴唇不对马嘴. Basically means rather inappropriate answers.]. Yet he seemed to be writing with such enthusiasm and ease, with such a look as if he were a top scoring scholar.\n However, the more she read, the smile in her eyes slowly vanished, replaced by a grave look.\n Indeed, Zhou Weiqing did not know anything about these basic military knowledge, in fact it was almost to a point where he didn’t know many of the definitions of the military phrases. However, when it came to analysis of battles and simulations of battles, it was just unbelievably stunning.\n No matter her father or her brother, they were famed generals in the Fei Li Empire. Naturally, she had spent a lot of time immersed in the military world, and was highly influenced by what she had experienced. In fact, Ming Hua’s talent and achievements in the military world were extremely high. However, it was just too difficult for a female in the military world, and her brother’s achievements were already extremely high, added to the Fei Li Empire rules about families, she did not go further into a military career. Even so, she had a much better and discriminating eye as compared to many of the professional teachers in the academy. In fact, before she became a teacher, during her time in the academy, she was a top student, the valedictorian of her cohort, with her results even surpassing that of her brother. That was also why she had been asked to stay as a teacher by the Academy.\n Ming Hua found that Zhou Weiqing was a novice in terms of military knowledge, but his grasp on strategy, tactics and especially the big picture vision was extremely strong. The few large questions on battle analysis, tactics and battle simulations, he had always gotten to the heart of the matter easily, quickly finding the root issue, and his solutions were always unique and unrestrained. In the military world, her brother was known to be a rather wild and crazy person; but in comparison with Zhou Weiqing’s answers, he would be rather tame.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-6-chapter-52-03","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
