{"id":51430,"no":256,"title":"Chapter 80 Battle to the death! Bai Da Battle Team! (2)","content":"Chapter 80 Battle to the death! Bai Da Battle Team! (2)\n Zhou Weiqing asked curiously: “What is the Secret Arts Fire Warrior?”\n Xiao Yan said solemnly: “Basically, the Secret Arts Fire Warrior requires the Heavenly Jewel master to have both the Strength and Fire Attribute, the focus being a powerful physical strength. When cultivation, all their Physical Jewels are Consolidated with Equipment that boosts their Strength. At the same time, all their Elemental Jewels are Stored with the same Skill - Flame Strength Blast. This Flame Strength Blast Skill is actually a very simple skill, simply adding an explosive strength to one’s attacks.”\n “Although this skill is only rated at three-stars, it has quite an obvious increase in strength. Furthermore, with the Secret Arts Fire Warrior Storing this Skill multiple times, with their effects stacking, although it might not be to such a degree like Boss’ Assembly Set Shield, it is still able to boost their strength to a considerable, almost terrifying degree. Of course, the drawback of this cultivation method is that there is almost no possibility of breaking past to the ninth Jewel level or higher. That is to say, his highest possible future level will only be an Upper Level Zong Stage. As such, anyone with outstanding talent would not choose such an extreme method of cultivation. However, at lower levels, they indeed have a huge advantage over most others, especially in the battlefield where they are nearly unstoppable.”\n “It is rumoured that several hundred years ago, there was an army formed out of Secret Arts Fire Warriors, all of whom were at the Upper Level Zong Stage. Although they only numbered a hundred people, they were almost invincible in the battlefield. Even Heavenly King Powerhouses were not willing to face them. For now, we do not know how much of the combat styles and secrets of the Secret Arts Fire Warrior Xu Chuan has mastered, but we do not need to worry that much; after all, the true power of the Secret Arts Fire Warriors are usually only when they reach the Zong Stage.”\n Hearing Xiao Yan’s explanation, Zhou Weiqing’s interest in these secret arts were definitely piqued. In truth, these so called secrets were mainly in the the matching of Consolidated Equipment and Stored Skills. The explosive power of Fire fused with the Strength Attribute… and how they matched together.\n In order words, having the Physical and Elemental Jewels focusing on boosting in the same direction. This was also the base principle behind all the Ultimate Heavenly Jewel Masters, like the Ultimate Agility of Shangguan Bing’er.\n Zhou Weiqing was a Consolidating Equipment Master, and hearing about these Secret Arts Fire Warriors, it was as if a door opened in his mind, broadening his horizons and giving him much food for thought. Of course, it was not for himself, but rather for his classmates and Followers who would be using his own Consolidating Equipment Scrolls. They could be said to have just entered the Jewel Master world, though they were not Heavenly Jewel Masters and were still low level, this would also allow him to shape them!\n At this point, the fight on the stage was reaching its climax.\n As a Secret Arts Fire Warrior, Xu Chuan’s strength was not inferior to Crow’s. As such, as both of the clashed time and again, the shockwaves reverberated around the plaza, causing the sturdy stage to tremble.\n Crow’s face was calm, the axes in her hands swirling about with all her martial skill, smashing hard into Xu Chuan’s hammers as he flew about in mid air, making use of the force of their blows to stay in the air, then using the downward force of his blows to increase their strength against Crow.\n Such a contest of strength was definitely a crowd pleaser, and the audience cheers swamped the entire plaza like waves. As compared to the first fight, this one definitely roused their spirits and fired their blood.\n In their Resting House, Zhou Weiqing, Lin TianAo and the rest of the team were smiling. They knew that barring any major surprises, they had secured this fight.\n Although Xu Chuan’s secret arts had allowed him to boost his strength to terrifying levels, it was still after all the boosts from his Consolidated Equipment AND Stored Skills.\n On the other hand, Crow was only using Heavenly Energy to boost herself, mainly using her own physique inherited from being a member of the Gold Crow Tribe. She had not even used her Consolidated Equipment or Stored Skills at all!\n As such, despite seemingly a stalemate, the disparity in terms of expenditure of Heavenly Energy was huge. Xu Chuan would eventually tire himself out, and though Crow’s cultivation level was lower than his and with a lower total amount of Heavenly Energy, she would definitely be able to outlast him… and by then, there would be no doubt in who the victor would be.\n As for Xu Chuan constantly staying in mid air, it might seem he was taking the initiative in doing so, making use of gravity. In truth, any skilled practitioner could tell that it was actually Crow who had the situation in hand, forcing him to be unable to land.\n Any human’s strength came from their physique, connected to the earth. Only then would they be able to leverage positioning, leveraging their own strength, and deflecting opponent’s strength. With her martial combat skills, Crow had been able to force Xu Chuan to stay in mid air, not giving him the time to slow down, recover; he could only attack continuously and clash forcefully.\n She wanted to end this as soon as possible.\n Xu Chuan naturally understood this as well. Alas, Crow’s strength was just too terrifying, as was her skill with the axes, and once she had gotten the advantage, he was unable to leverage anything to break himself out of the rut.\n Although he had seen all of Crow’s other fights, at that point he had just felt that her strength was powerful, but that he was no weaker. Only now that he fought her personally did he know he was wrong. Just standing there, Crow gave him the impression like she was an insurmountable mountain. Every clash reverberated right through his body, causing his body to feel a quick numbness, and his arms slowly started feeling leaden.\n Crow - Six hundred jin of weight, and a thousand three hundred jin weight of the legendary axes.\n Such a terrifying mass accompanied by her strength, one could never imagine the sheer power without experiencing it for themselves. This was simply not human. As compared to her physical strength, the boost from her Heavenly Energy and Fire Attribute Skills were much lesser.\n Such a clash of pure strength was naturally a huge drain on a Secret Arts Fire Warrior like Xu Chuan. After all, he was still at the four-Jeweled cultivation level, and was not able to fully make use of all their secret arts to their maximum capabilities. Feeling his energy draining rapidly, he was starting to get worried.\n In the next clash, when Xu Chuan’s body bounced back upwards in midair, he gave an abrupt shout, the diminishing flames around his body suddenly flared out once more, blazing in a new life as the red flames turned orange. His entire aura suddenly changed as well.\n Strangely, he actually paused in midair for a second, before he struck downwards at Crow once more.\n This time, his speed was obviously slower than before, but the hammers in his hands were stained an orange red flame, giving it a horrifying feel that struck to the very soul.\n Just like how all the members of the Fei Li Battle Team were so adamant about victory, so was the Bai Da Battle Team. In order to achieve victory, Xu Chuan was not afraid to sacrifice himself.\n In the Fei Li Battle Team Rest House, everyone stood up abruptly on seeing what had happened. What Xu Chuan was using was just too familiar to them… as Xiao Yan had just used it previously against Little Witch - Igniting his Flame of Life!\n In order to secure this victory, Xu Chuan had decided to ignite his flame of life before he fully ran out of Heavenly Energy.\n The watching members of the Fei Li Battle Team gripped their fists tightly, their eyes filled with concern. Even though Crow’s strength and defense were formidable, could she face down Xu Chuan who was pitting his life to use his Flame of Life?\n However, in the next instant, everyone was stunned, as the scene played out in front of them in an unbelievable way.\n *Swooosh* Without any warning, or any leverage, Crow suddenly shot back over a dozen yards, her axes held in front of her protectively. No one knew when she had done it, but only the members of the Fei Li Battle Team could see from their vantage point that Crow had somehow attached her Consolidated Equipment Chain to the edge of the stage. Indeed, she had made use of the chain to pull herself backwards instantaneously without any leverage.\n *BANG*\n Alas… unfortunately for Xu Chuan, the blow for which he had risked his life smashed savagely into the floor of the stage. It was as if a meteor had struck the diamond hard stage, with rubble and dust spraying into the air along with the huge explosion, erupting into the air like a ferocious volcano. As the air cleared, a twenty yard diameter huge crater was revealed in the center of the stage, and the very atmosphere around the stage seemed to have turned orange-red with the sheer heat.\n The explosion was just too violent, the resulting shockwaves still reverberating across the plaza, almost breaking the various Rest Houses as the wave passed them.\n Although Xu Chuan’s cultivation level was only four-Jeweled, such a strike with his ignited Flames of Life behind it, even a six-Jeweled Heavenly Jewel Master would not want to take such a blow easily.\n It took the time of several breaths before the intense heat in the air dissipated, though the air was still dusty. At that point, another dark red light lit up, flying forward with a *wuuu* sound. “WE SURRENDER!!” Lang Xie shouted out immediately. Alas… he was too late.\n One of Crow’s Legendary Axes, weighing over six hundred jin, spun in the air with a deatly air, burying itself deep into Xu Chuan’s chest. Already weak from burning up his Flame of Life, Xu Chuan was smashed to the ground by it.\n With its weight and Crow’s strength, such a blow was at least three thousand jin or more, let alone the fact that it was the axe blade that bit into his body.\n Not even mentioning the fact that Xu Chuan was an ordinary Heavenly Jewel Master; even if he were a Gold Crow Tribe member like Crow, their reinforced skin and bones would not be able to take such a blow. His entire chest caved in and split apart, every single rib and lungs smashed into bits. Before he could even cry out, Xu Chuan’s life had been swiftly taken by the flying axe.\n Crow stood up from the other side of the stage, looking at the judge innocently: “Aiiii, he was so fierce, I thought he still had the fight in him. Leader Lang Xie, you should have surrendered for him earlier, look, making me feel so bad… sigh… to have a life just gone like this. I didn’t do this on purpose, alas you were too slow in admitting defeat.”\n “You….!” Lang Xie almost spat out a mouthful of blood in rage as he glared at Crow, the flames in his eyes. The other Bai Da Battle Team Members were also enraged, almost charging forward towards Crow.\n Right at that moment, several ZhongTian officials from the Skill Storing Palace appeared, blocking their path.\n When they released their six sets of Heavenly Jewels, no matter how angry the Bai Da Battle Team members were, they had no choice but to hold themselves back.\n Even the judge on the stage couldn’t bear to look at the mangled corpse of Xu Chuan. Crow walked over, pulling her axe from his body, a sorrowful look on her face as she mourned: “Aiii, I did not want to kill you… Why did you have to be born in the Bai Da Empire? Alas, you shouldn’t have called yourself a Secret Arts Fire Warrior; without learning their secrets properly, you dared come on the stage to play around, sigh… dying in my hands, it was not unjust after all.”\n After the judge proclaimed the Fei Li Battle Team victory, Crow walked down the stage.\n Such a bloody scene caused the entire audience to lapse into silence. They had originally been looking forward to an exciting fight, but only then did they realise that the hate between the two empires were to such a degree. This was truly a fight to the death for both sides.\n As the officials once again cleared up the stage, the members of the Bai Da Battle Team all had bloodshot eyes. Under such a circumstance of certain victory, Crow had still finished off Xu Chuan; this had definitely angered all of them.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-10-chapter-80-02","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
