{"id":51471,"no":297,"title":"Chapter 95 Zhou Weiqing’s Coming of Age \u0027Ceremony! (1)","content":"Chapter 95 Zhou Weiqing’s Coming of Age \u0027Ceremony! (1)\\n\\n The four white clad guards looked at Zhou Weiqing with pitying gazes. Offending the Heaven’s Expanse Little Devil Girl, he would definitely have a tough time ahead.\\n\\n Zhou Weiqing turned to Lin TianAo and said: “I guess Bing’er will take while more, let’s go down and see how the rest are doing first. If they have already finished choosing their Consolidating Equipment Scrolls, I’ll settle their payments first before returning here by myself to wait for Bing’er. Leader, as for your Scroll, we’ll wait until tomorrow before coming here alright?”\\n\\n Lin TianAo knew that it would be a rare chance for Zhou Weiqing and Shangguan Bing’er to meet up today, and he did not want to waste any time of it. Nodding, he said: “No problems, there is no rush for my Consolidating Equipment Scroll.”\\n\\n Both of them returned to the first level to look for the other members of the Fei Li Battle Team, and they had already chosen their Scrolls. As a Consolidating Equipment Master, Zhou Weiqing helped them look through to see if their choices were good, and soon after, they made the purchases at the Consolidating Equipment Pavilion.\\n\\n Although the members of the Fei Li Battle Team had all ‘conned’ Zhou Weiqing, they did not overdo it. Besides Lin TianAo, the other five had spent a total of sixteen million gold coins. Of course, this was after a ten percent discount.\\n\\n As for Little Witch, Zhou Weiqing would naturally not pay for her. Currently, she was nowhere to be seen; after all, she was here this time on behalf of the Heavenly Demon Sect to purchase a large amount of Scrolls and Materials, and would likely be carrying a large amount of gold coins. As for what exactly she bought, Zhou Weiqing had no interest in finding out. It was the business of the Heavenly Demon Sect, and not a secret that he wanted to know, but no matter what, it was likely a massive purchase.\\n\\n Zhou Weiqing turned to Lin TianAo and said: “You guys go ahead first, if you want to head back or explore the area further. I’ll be waiting for Bing’er.”\\n\\n Lin TianAo said: “Do you want me to go with you?” This was after all the Heavenly Jewel Island, and could be said to be populated by many powerhouses. He was afraid that Zhou Weiqing might encounter any problems.\\n\\n Zhou Weiqing laughed and said: “That shouldn’t be necessary. In this place, I’m certain that any Heaven’s Expanse Palace disciple will be stronger than us; if anything really happens, even if you are there, it will not make any difference. Do not worry, I will be fine, I’ll just be waiting for Bing’er. We are after all guests for the Heavenly Jewel Tournament.”\\n\\n Lin TianAo nodded, and the rest of them left. Just as Zhou Weiqing was about to head back up to the fourth level, Shangguan Longyin entered the Pavilion and spotted him.\\n\\n “You all sure do not waste any time. After reporting to the Palace Masters about your requests, I returned to your inn to look for you, but you had already came to the Consolidating Equipment Pavilion. How was it? Did you find any suitable scrolls?” Shangguan Longyin asked sincerely.\\n\\n Zhou Weiqing laughed heartily and said: “My companions have already chosen and purchased their own, and as for myself, I was of course waiting for you.”\\n\\n Shangguan Longyin said: “Weiqing, the two Palace Masters have said, since the Heavenly Jewel Tournament is about to start, there isn’t sufficient time. We hope that you will go through the Tournament with all your power, and once the Tournament is over, no matter what the result is, we will go through the trade according to the terms you have mentioned. Is that alright?”\\n\\n Zhou Weiqing said: “That sounds great. It’s a deal then.”\\n\\n Shangguan Longyin said: “You still have two more days to prepare yourselves, and I hope you make use of that time wisely. The finals is a very different ball game from the preliminary heats, and everything will be decided in this one single ‘fight’. The other three teams have all entered the finals before, and they have some idea about the finals. Let me give you a simple idea about it - in the finals, you will be going through a massive free-for-all in a unique environment, you will find out more when it actually starts. I truly look forward to you pulling off a miracle once more.”\\n\\n After saying that, Shangguan Longyin patted Zhou Weiqing on the shoulder before turning to leave.\\n\\n One should not underestimate just that short and simple explanation that Shangguan Longyin had given Zhou Weiqing. To the Fei Li Battle Team, this being their first time at the finals of the Heavenly Jewel Tournament, and with their opponents all experienced, this could spell the difference between a swift defeat and some hope of success. In any case, it would at least give them two days of preparation.\\n\\n Zhou Weiqing hurried back down, managing to catch up with Lin TianAo at the first level, and told him about Shangguan Longyin’s description. After which, he headed back to the fourth level to wait for Shangguan Bing’er.\\n\\n …\\n\\n At the same time as Zhou Weiqing was anxiously waiting for Shangguan Bing’er, Shangguan Fei’er had already left the Consolidating Equipment Pavilion and had walked over to one of the inns on the Heavenly Jewel Island.\\n\\n “Hello, Young Miss.” All the employees of the various establishments around the entire Heavenly Jewel Island were actually outer disciples of the Heaven’s Expanse Palace, and naturally they recognized Shangguan Fei’er, and most of them could differentiate the two Young Miss from their expressions and airs. As for Shangguan Bing’er, their Third Young Miss, she had just returned, and not many knew about her just yet.\\n\\n Shangguan Fei’er looked to be in a huffy, irritable mood, and she said: “Where are the members of the ZhongTian Battle Team? Call them out, I want to see them.”\\n\\n Seeing her in such a mood, the employee did not dare to question her, and quickly headed in to comply with her request.\\n\\n In moments, the eight members of the ZhongTian Battle Team had gathered at the main hall of the inn, including the youth leader who had caught the attention of Zhou Weiqing previously.\\n\\n “Second Miss, what is the matter? Who angered you?” As soon as the youth saw Shangguan Fei’er, his eyes lit up and he quickly approached her.\\n\\n Shangguan Fei’er gave a humph, and said: “That is none of your concern, Zhan LingTian, I need your help to do something.”\\n\\n This Zhan LingTian was naturally the leader of the ZhongTian Battle Team, and was also one of the core disciples of this generation of the Heaven’s Expanse Palace, and he had training with the First Palace Master Shangguan Tianyang since a young age, and could be said to be one of the top few of the core disciples of their generation currently. In terms of cultivation level, he was also the cream of the crop.\\n\\n When he saw Shangguan Fei’er, he had gotten a headache. Even though Shangguan Fei’er and Shangguan Xue’er looked exactly the same, in Zhan LingTian’s heart, they were of totally different status. Since a young age, he had fallen for Shangguan Xue’er, but kept a respectful distance from the Little Devil Girl Shangguan Fei’er. Of course, seeing her here now, he could easily guess that it wouldn’t bode well for them.\\n\\n Shangguan Fei’er glanced at the only female member of the ZhongTian Battle Team, then turned to Zhan LingTian and said: “Zhan LingTian, let me swap with her, I want to join the Battle Team and attend the Heavenly Jewel Tournament!”\\n\\n “Whaa??” Zhan LingTian was caught by surprise. “Second Miss, please don’t joke around with me. How can that be possible? You are of exalted rank and status, and no harm must come to you. Should anything happen to you in the finals, how can I possibly take the responsibility for that? Furthermore, there are rules to the Tournament, and it is strictly forbidden to change team members after entering the Finals. Even though we are the organisers, we cannot break our own rules.”\\n\\n Shangguan Fei’er said angrily: “Don’t talk to me about all those principles and rules. Is my power not strong enough? I do not care, I want to join! None of you really fought much in the preliminary heats, I’m sure no one will have even taken much note of the members, what’s wrong with just a quick swap. Nobody will notice!”\\n\\n Originally, Zhan LingTian had gotten a slight headache when he saw her, but looking at her stubborn expression, it now grew into a severe migraine. He was clear on how difficult it was to get this Second Miss to change her mind once she had set her sights on something.\\n\\n “Second Miss, this is a matter of principle. I’m sorry, but I definitely cannot agree to it. If you really insist on it, I will have to report to the Palace Masters.” As one of the leading disciples of the Heaven’s Expanse Palace, he would not give in so easily.\\n\\n Hearing him bring up her father and uncle, Shangguan Fei’er knew she couldn’t continue forcing him. A mischievous look flashed in her eyes as she thought quickly, then she suddenly gave a loud sigh, saying: “Big Brother Zhan, don’t you know why I suddenly insist on joining the Heavenly Jewel Tournament?”\\n\\n Zhan LingTian had also been curious about that, and he asked uncertainly: “Why is that?”\\n\\n Shangguan Fei’er’s eyes reddened, and she said pitiably: “Because… because big sis was bullied…”\\n\\n “What did you say?!” Zhan LingTian exclaimed, a cold light flashing in his eyes. His stable countenance warped into a heavy killing intent, surprising even the other members of the ZhongTian Battle Team. None of them had ever seen their leader in such an enraged state.\\n\\n Shangguan Fei’er continued sadly: “I am speaking the truth. In the Fei Li Battle Team, there is a little rascal called Zhou Weiqing, and he was the one who brought back my Third Sis, and is also my Third Sis’ boyfriend. However, that time in the ZhongTian City Consolidating Equipment Pavilion, he mistook Big Sis for Third Sis, and kissed her without warning… he just stole away Big Sis’ first kiss like that!”\\n\\n “Big Sis actually wanted to kill him, but Third Sis appeared, and for her sake, she held back. However, I can still see that Big Sis was not happy, but with her character, you know she would never take action against that Zhou Weiqing. After all, he is Third Sis’ man! But… I won’t take it so easily, hmph, how can that fellow just steal Big Sis’ first kiss like that! Big Bro Zhan, I want to join the ZhongTian Battle Team in order to teach that rascal a lesson, to help Big Sis get some revenge. As long as we don’t kill or severely injure him, then we will be fine.”\\n\\n Although Zhan LingTian knew very well what Shangguan Fei’er’s character was like, her mischevious desire to stir up trouble notorious amongst the core disciples, but when he heard her words, he still fell for it, his eyes reddening in rage. After all, it was his idol, his love’s first kiss!\\n\\n As the saying goes, caring causes mistakes [1. Direct translation of 关心则乱, which is an idiom shortened from the saying 无欲则刚 关心则乱. Basically, you can probably get the gist of the meaning from the direct translation, but the entire thing means ‘If you have no desires, you will not be easily affected or tricked by others. Once someone cares a lot about something/someone, it is easy to make mistakes or misjudgements when the thing in question is at risk]. Even though Zhan LingTian was one of the top disciples in the Heaven’s Expanse Palace, perhaps one of the top of his generation in the entire mainland even, but he was still no exception to that. In his heart, Shangguan Xue’er was like his goddess, and for her first kiss to be stolen by some stranger, the rage and jealousy in his heart burned fiery hot.\\n\\n Seeing the fiery rage in Zhan LingTian’s eyes, Shangguan Fei’er smirked to herself inwardly. She knew that as long as she mentioned her Big Sis, she could easily manipulate this stubborn blockhead. This Zhan LingTian was so infatuated by her Big Sis, alas she did not have any reciprocal feelings for him.\\n\\n “Alright! I’ll let you join!” Zhan LingTian said curtly, his words filled with killing intent.\\n\\n Shangguan Fei’er started, furrowing her brow, before saying in a low tone: “Big Bro Zhan, that Zhou Weiqing is hateful, but he is after all Third Sis’ fiance. You can teach him a lesson, but you better not try to kill him!”\\n\\n Zhan LingTian looked at her, a cold light in his eyes, but he did not say anything else, instead turning back into his room.\\n\\n …\\n\\n Consolidating Equipment Pavilion.\\n\\n Zhou Weiqing sat quietly cross-legged at the entrance of the stairway to the fourth level, his eyes closed as he cultivated his Immortal Deity Technique. His emotions were still in turmoil from seeing Shangguan Bing’er earlier, and he was barely able to concentrate.\\n\\n Defeat Shangguan Xue’er, only then can you marry Bing’er. That was the condition that the Heaven’s Expanse Palace had set for him.\\n\\n Naturally, Zhou Weiqing did not think that just because he had barely beaten Shen Little Demon from the Blood Red Hell, that he would be able to take on Shangguan Xue’er. He had personally experienced the sheer presence she had, and the overwhelming power he could sense from her.\\n\\n Seven Jewels. Low Level Zong Stage Heavenly Jewel Master. Just her Heavenly Energy alone was more than twelve levels above his own. Furthermore, Shangguan Xue’er was from the Heaven’s Expanse Palace. Without even needing to verify, Zhou Weiqing was certain that she was using God Tier Consolidated Equipment, likely Legendary Sets. And unlike him or Shen Little Demon, she probably already had several pieces completed! The only advantage he would have over her would be his Elemental Jewels, but everything else he had would definitely pale in comparison, or perhaps even totally useless against her!\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-12-chapter-95-01","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\\n [Translated Synopsis]\\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\\n Our MC here is an archer who has such a pair of Heavenly Jewels.\\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
