{"id":51205,"no":31,"title":"Chapter 8 Profound Secrets of the Immortal Deity Technique (4)","content":"Chapter 8 Profound Secrets of the Immortal Deity Technique (4) As he thought up to here, Zhou Weiqing Received his Heavenly Jewels back into his Taiyuan Acupuncture Point, before falling down backwards. Since cultivating Heavenly Energy was a matter of focusing on the whirlpools, there was no difference between sitting and lying down – he sure gave himself a good reason for lying down lazily, closing his eyes and focusing on the energy whirlpools. Unfortunately, although the Immortal Deity Technique was able to cultivate while lying down unlike other cultivation techniques, this position was way too comfortable, and before long he was fast asleep. Luckily, the 4 energy whirlpools still continued absorbing energy from the surroundings even without his focused will, though it was at a slower speed. “Little Fatty Zhou, Little Fatty Zhou, wake up.” With a *Shuah* sound, a strong light focusing on Zhou Weiqing’s face, causing him to wake up from his beauty sleep. “What? Let me sleep a while more.” Zhou Weiqing turned around and said lazily. There was a loud bang as a kick landed on his buttocks, and Zhou Weiqing got a big fright and flipped up to stand upright, only to see Company Leader Mao Li standing in his tent, and the strong light was the sunlight shining in from the open tent flap. Mao Li said exasperatedly: “You’re still not up yet? You better get up now, what time is it already? Such lazy soldiers like you will have to be properly moulded by me.” Zhou Weiqing had no choice but to get up, saying, “Company Leader, let me go eat breakfast first.” Mao Li was both angry and exasperated, thinking to himself: This rascal is sure a piece of work, no wonder the other day after he had been frivolous with the Battalion Commander he still behaved as if nothing had happened, making her so angry. “Did I wake you up just to eat? Who asked you to wake up so late. Eat.. eat your own farts, there’s nothing to eat anymore. Come with me, the Battalion Commander has summoned you.” As he was talking, Mao Li grabbed Zhou Weiqing by the shoulder and pulled, trying to drag him out of the tent. However, he was surprised – he had originally thought that he could easily drag Zhou Weiqing out of the tent, but when he actually tried doing so, he found that his body was as heavy as a mountain, even exerting his strength, he could not move Zhou Weiqing at all. “En?” Mao Li said as he looked at Zhou Weiqing in surprise, “Brat, you have cultivated Heavenly Energy?” Zhou Weiqing said proudly: “Yes indeed.” After his body had been evolved from the Awakening of his Heavenly Jewels, he barely felt the strength that Mao Li applied on him. Of course, due to his promise to Shangguan Bing’er, he immediately shut up after that. Even so, just that simple two word answer made Company Leader Mao Li’s look towards him change drastically. After all, in the commoner world, barely a hundredth of the population could even start to cultivate Heavenly Energy, and of that number, a hundredth could cultivate enough to become a Jewel Master. Of course, the other portion of people who only managed to cultivate to the first or second stage of Heavenly Energy by the age of 16, although they were not able to Awaken their Power Jewel, they were still a lot stronger than ordinary people. in terms of cultivation of Heavenly Energy, the first 3 stages of the Heavenly Jing Energy was the most important, and also the most difficult. Every stage was tantamount to a new rebirth – remoulding and evolving the body. For someone like Zhou Weiqing who directly broke through to the 4th stage, thus melding all the rebirth and remoulding stages together as one, it was previously unheard of! As such, even if it were those who had only cultivated up to the first two stages of Heavenly Jing Energy, they were still highly wanted in the army. After the recruit phase, most of them would likely be promoted to a role of Squad Leader, and they definitely had greater combat capabilities than any ordinary soldiers. Mao Li himself was someone who had managed to cultivate up to the 2nd stage of Heavenly Jing Energy, and had almost been able to become a Jewel Master. As soon as he found out that Zhou Weiqing also had Heavenly Energy, his attitude towards him warmed considerably. “Alas, we are in the same sorry boat ah! Being able to cultivate Heavenly Energy, yet unable to become Jewel Masters, in a way such talents like us are the most tragic, seemingly having the chance yet ultimately failing to become a Jewel Master. It might be better off not having the chance at first, to be an ordinary person.” Mao Li said with much feelings. In truth he was not wrong, if one had always been a commoner, having not felt the strength and power of Heavenly Energy, they would not have an inkling of the true power of a Jewel Master. Yet for those who had tasted the benefits of Heavenly Energy, they were the ones who truly lusted after the strength of becoming Jewel Master. Ignorance was indeed bliss sometimes. Zhou Weiqing had no choice but to shrug his shoulders. After all, he couldn’t just reveal to Mao Li that he was already a Jewel Master, and Mao Li would also never suspect such a thing. After all, who would join the army as a common soldier as a Jewel Master. In any country, Jewel Masters were considered nobility. “Let’s go, looks like these two days the Battalion Commander has still been kind, at least she didn’t torture you and you aren’t missing any limbs. You better be careful next time! But you’re my part of my 4th Company Bros, I will look after you.” Mao Li patted Zhou Weiqing on the shoulder, he did not try to drag him along anymore, but turned and walked out. Zhou Weiqing put on an overcoat and followed him out of the tent, and followed Mao Li to Shangguan Bing’er’s Commander’s Tent. As soon as he entered the tent, Zhou Weiqing spotted Shangguan Bing’er who was seated on the seat of honor. Even though he had seen her several times previously, and had even had intimate relations with her, but the sight of her still gave him an intense jolt. Today, Shangguan Bing’er was dressed in a martial attire, the Battalion Commander’s Silver Mail she was wearing made her look especially valiant and heroic in bearing. She wasn’t wearing a helmet, and her long hair was braided in a pony tail behind her head. Although she was only 15 years of age, she looked very much the part of a General seated on the Commanding Officer’s chair, . To the left of her sat a handsome youth of about the age of twenty, black hair to the shoulders and a face with a complexion like jade. Unfortunately he seemed to have a pair of bewitching, seductive eyes like peach blossoms. He was dressed in light armor, with a yellow feather topping his helmet, showing that he had the same rank as Mao Li – Company Leader. The other side of Shangguan Bing’er was empty; this time round there were two companies recruiting men, obviously the other seat was meant for Mao Li. Behind those 2 seats, each sat ten Squad leaders dressed in leather armor. In Heavenly Bow Empire, only officers of the rank of Company Leaders and above would have differences in their armour, either by the feather in their helmets or by their armor design or colours. As such, the Squad Leaders who were in charge of ten men were also jokingly referred to as “No Feather Squad Leaders” Mao Li brought Zhou Weiqing into the tent, and everyone’s gaze immediately turned to them. Mao Li gave a sharp salute to Shangguan Bing’er, “Reporting to Battalion Commander, I have brought Little Fatty Zhou here.” Shangguan Bing’er said in cold clear voice, “Company Leader Mao Li, thanks for your efforts. Please take your seat.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-2-chapter-8-04","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
