{"id":51225,"no":51,"title":"Chapter 13 An eye for an eye, a tooth for a tooth (4)","content":"Chapter 13 An eye for an eye, a tooth for a tooth (4)\\n\\n Zhou Weiqing was given a huge scare. What was going on? Still, no matter what, he could not stop everything from happening now.\\n\\n After approximately three seconds, for the six color wheel disk in Zhou Weiqing’s eyes, the black region representing the darkness attribute and the grey region representing the evil attribute suddenly superposed together unexpectedly. A strange unusual feeling overwhelmed Zhou Weiqing’s whole body, and the weird winged black tiger appeared in his mind again; this time with its mouth opened wide, as if trying to swallow something.\\n\\n What Zhou Weiqing himself couldn’t see was that at this very moment, a black-grey tattoo started spreading out from his right shoulder, and in a short while it had reached his right wrist.\\n\\n In the next instance, the Consolidating Equipment Scroll which had been swallowing his Heavenly Energy suddenly stopped. Instead, Zhou Weiqing felt that the Taiyuan Acupuncture Point, one of the four Death Acupuncture Point that he had broken through, had suddenly opened like a huge mouth, and suddenly the bright light which the Consolidating Equipment Scroll had warped into was swallowed instantaneously by it.\\n\\n Due to the bright light from the Consolidating Equipment Scroll, it actually caused Feng Yu not miss seeing the black tattoo on Zhou Weiqing’s arm which disappeared quickly after, but he actually clearly saw the Consolidating Equipment Scroll get absorbed into Zhou Weiqing’s Physical Jewel, and he was so surprised that his jaw dropped.\\n\\n An indescribable feeling of fulfilment appeared in Zhou Weiqing’s mind, after the six color wheel disk had completely swallowed the Consolidating Equipment Scroll’s light, and in the next moment it had restored to its normal six color region state. Zhou Weiqing felt as if his Physical Jewel had came to life, the feeling of being connected to it and the burst of strength it filled him with made his whole spirit feel stimulated.\\n\\n A low cry resounded out from Zhou Weiqing, and the one-third Heavenly Energy that he had left started pouring into his Icy Jade Physical Jewel. A strong ferocious aura erupted from his wrist, and the Physical Jewel separated from his wrist to fall into his palm.\\n\\n When Zhou Weiqing’s closed his palm around the Physical Jewel and grasped it firmly, immediately, two bright white lights simultaneously emitted out from his palm into two directions, and in the next instant, it had changed into a 1.5m wide longbow without a bowstring in his grasp.\\n\\n As compared to the picture earlier, this longbow was full of the sense of reality, its entire body looked like it had been carved out of Icy Jade, glittering with beauty and surrounded with a shimmering icy mist, its streamline shape shape seemed like a ferocious beast giving forth a domineering aura.\\n\\n Zhou Weiqing lifted the Overlord Bow, and immediately, a sense like he was connected to the bow by his arm made him instantly fall in love with the bow. Although he had previously favoured the Consolidated Equipment Scroll of the Xuan Wu Shield, but after he had just succeeded in Consolidating Equipment with the Overlord Bow, his heart was flooding with satisfaction.\\n\\n “Senior, how come this does not have a bowstring?” Zhou Weiqing looked at his Overlord Bow and asked doubtfully.\\n\\n Feng Yu said in a bit of a shock: “You need to continue pouring in Heavenly Energy, if you just reached the fourth stage of Heavenly Energy, you will need at least half of your Heavenly Energy to full form this bow, even the bowstring requires your Heavenly Energy to take shape.”\\n\\n Zhou Weiqing said in realization: “I see, my Heavenly Energy is insufficient to form the bowstring. Alright, I will try again later.” As he withdrew his Heavenly Energy, the Overlord Bow disappeared quietly, forming back into his Icy Jade Physical Jewel to encircle his wrist again. However, the Physical Jewel’s brilliance was a lot dimmer now, as Zhou Weiqing did not have much Heavenly Energy left.\\n\\n “It doesn’t seem that difficult for Physical Jewels to Consolidate Equipment? I just succeeded like that.” Zhou Weiqing said with much satisfaction as he withdrew his Physical Jewel.\\n\\n “Kid, are you really a human?” Feng Yu sighed out the breath he had been holding, staring at Zhou Weiqing, his face full of shock.\\n\\n Zhou Weiqing also stared back with eyes wide open, “Senior, how can you curse at people?”\\n\\n Feng Yu said with a bitter smile: “I am not scolding you, I’m praising you. Do you really think Physical Jewel Consolidating Equipment is easy? Even though I have all nine Physical Jewels complete, but I have never thought that Physical Jewel Consolidating Equipment is easy. The reason why your little girlfriend led you here to look for Huyan Old Man, is because his grandmaster level Consolidating Equipment Scrolls that he makes, although they are expensive, but you are actually guaranteed success. Even so, 100 of them are still required to guarantee. I have never actually seen someone like you who was able to complete see have been able to complete Physical Jewel Consolidating Equipment with just a single Consolidating Equipment Scroll. Furthermore, it was your first time using a Consolidating Equipment Scroll. This has completely gone beyond my knowledge of Physical Jewel Consolidating Equipment!”\\n\\n Zhou Weiqing thought quickly and thought he understood, he guessed that perhaps the reason for his smooth success was probably his six attributes, especially the black and grey regions as they superimposed with each other. However, he did not want to reveal his secret, so he smiled and said: “Didn’t you say that Huyan Senior’s Consolidating Equipment Scroll’s success rate was 1%, naturally it’s also possible for this 1% to be done on the first or the last scroll right? Shouldn’t that be normal?”\\n\\n Feng Yu said helpless: “That is true theoretically speaking, however in my sixty years of experience I have never seen or heard of anyone who succeeded on their first use of Consolidating Equipment Scrolls.”\\n\\n “60 years? Senior, aren’t you joking with me?” Zhou Weiqing was rather startled. From his look, Feng Yu was at most forty-year-old.\\n\\n Feng Yu laughed and said: “Kid, my actual physical age is only younger than Huyan Old Man by one year. Why do you think he calls me Feng Yu Old Man as well? He is 75 years old this year, and I am 74 years old. When you compare the two, Physical Jewel Masters of the same rank will probably lose to Elemental Jewel Masters, but their greatest gain is that they have a strong anti-aging. After all, what we do is strengthening the body, while they are controlling the elements. However, as long as you are a Jewel Master, you will at least have 150 years lifespan. You Heavenly Jewel Masters have an even longer lifespan, there are those over 200 years old who are extremely formidable existences, when they stomp their feet, the four seas will tremble. The road in front of you is very very long, you need to put in much more effort along the way.”\\n\\n Upon hearing that, Zhou Weiqing was delighted, “So Heavenly Jewel Masters can have such a long lifespan, I have really gained a lot. Oh right, Senior, can I still keep this remaining 99 scrolls?”\\n\\n Feng Yu passed Zhou Weiqing the wooden box, saying with a faint smile: “Hey kid, do you know why I took a liking to you?”\\n\\n “Why?” Zhou Weiqing carefully took the box and covered it, then swiftly stored it in his own bag.\\n\\n Feng Yu said: “Because you are not artificial. A real villain who shows his colours is better than a hypocrital gentleman. Furthermore, you, this child, are also not a villain. Certainly, I am very curious, for someone so young, who did you learn to be such a ruffian from.”\\n\\n In Zhou Weiqing’s mind flashed a rascally old man’s image immediately, though that was clearly not his father. Smiling, he said: “That… I cannot say.”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-2-chapter-13-04","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\\n [Translated Synopsis]\\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\\n Our MC here is an archer who has such a pair of Heavenly Jewels.\\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
