{"id":51863,"no":689,"title":"Chapter 233: Hui Yao’s Revival (2)","content":"Chapter 233: Hui Yao’s Revival (2) Hui Yao heaved a deep sigh. “You all saved my life, so there’s no harm telling you. The Nether is a place. You could say it doesn’t exist in our world. You see, it’s a reality like the Lustre Spatial Realm, another parallel world. Only this place is much larger and much more terrifying than the Lustre Spatial Realm. There are many nether creatures there. There is no light there, only slaughter and destruction. Simply put, within the Nether ordinary nether creatures are much stronger than you human Six-Jeweled Stage Heavenly Jewel Masters. If the Nether connects to your human world, your world will be thoroughly annihilated.” Zhou Weiqing was dumbstruck by what the huge dragon, Hui Yao, had said. He’d never heard anything like that. His eyes shone with doubt. Hui Yao of course could tell what Zhou Weiqing was thinking. “You don’t have to believe it,” he said flatly. The Nether Realm’s existence is real because the Lustre Spectre Realm was established by the Nether Realm. A hundred thousand years ago the Nether Realm barely managed to link up a portal to the human world. In those days there were a lot of huge powerful dragons like us, and with their help they managed to completely seal off the portal, and someone was assigned to guard it. Later us dragons took up guarding it. That’s why we rarely appeared in the world. The successive dragon clan leaders took charge guarding the Nether Realm. Us dragons paid a hefty price for guarding the Nether Realm. We were affected by energy from the Nether Realm, which made it difficult for future generations to procreate. So our ancestors set up the Lustre Spatial Realm and sent a young Dou Si and myself into it in order to preserve our dragon bloodline.” Zhou Weiqing gasped. If what Hui Yao said was true, and the Nether Realm’s power was really what was behind the abduction of their children, then wasn’t the human world in danger? “The force that caused a rift in space might have been from the Nether,” Hui Yao said. “Only the Lord of the Nether has the kind of power to rip open space. Even though it and the Nether creatures can’t come to our world, they can help its representative come here. It was they who captured my children. I don’t know what they want, but it won’t be good for you humans. Your cultivation is good for a human, especially your astonishing Saint Energy. However, I’m afraid it’s not near good enough to match the Nether Realm representative.” Zhou Weiqing thought for a moment. “What is the Nether Realm representative?” “Humans,” Hui Yao said without hesitation. Some of you humans thirst for power and will stop at nothing to get it. They can be tempted by the Lord of the Nether Realm and become his lackey. The Lord of the Nether Realm will give them a certain amount of power and have them assist the lord with various tasks. When an opportunity appears they will help the Lord of the Nether Realm in his assault on the portal seal.” Zhou Weiqing’s eyes shimmered. “So then our world is in danger. Those nether creatures definitely can’t come to our world, right?” Hui Yao nodded. “As long as the seal is not broken even the almighty Lord of the Nether Realm will not be able to come to your world. The most he could do is rend space every now and then and teleport some energy fluctuations. And he will have to pay a large price to do it. So in order to prevent the portal to the Nether Realm from opening up you must first resolve the petty matters of your world. Dou Si and I leaving the Lustre Spatial Realm is not a bad thing for you humans. We have keen insight into the Nether. I’m a descendent of the dragon emperor. The power of the dragon emperor that flows through my bloodline veins can guide me to these existences.” Zhou Weiqing smiled wryly. “But, once you leave here it will be a devastating blow for the entire human race. Perhaps you all don’t know, but there is a place called Heaven’s Expanse Palace on Heavenly Jewel Island within the Lustre Spatial Realm. At the south end of the island there is a huge city with a population of over ten million. Once the Lustre Spatial Realm is destroyed, the most populous city in the human world will be no more. That’s why we have to do everything we can to stop you.” Hui Yao’s eyes shut slightly as he thought. “There’s nothing else to be done,” he said flatly. “Our children have not yet hatched. No matter what those people want to use my children for, they just have to wait until they hatch. But without our husband and wife’s powers there, no matter how they try to hasten it, it will still take about five years. It’s already been over half a year. If you can help us out here within three years, we will still have a chance.” Shangguan Xue’er, off to the side, said, “Just tell us what you require and we’ll do our best. Do you have a way to get out of here without destroying the Lustre Spatial Realm?” Hui Yao nodded. “There’s another way to do it besides breaking through space. Teleportation. Forcefully tear open space and teleport us out. Just like they tore open space in the past to teleport the humans.” Zhou Weiqing gasped. “Won’t it take a hell of a lot of power to do that? I don’t know if even a Heavenly God Tier Powerhouse would be able to do it.” “A lot of power is part of it,” Hui Yao said. “If you can find a Spatial Teleportation Gem you can cut down on a lot of power. You can use your Saint Energy to open the Spatial Teleportation Gem. I can give you a coordinate. Just cut the coordinates into the Spatial Teleportation Gem. I’m not really sure how to activate it. After all, the Spatial Teleportation Gem is an incredibly precious object from the ancient past.” Zhou Weiqing looked at Shangguan Xue’er. “Do you know what that is?” The richest place on the mainland was Heaven’s Expanse Palace. There were countless treasures there. Maybe there was a Spatial Teleportation Gem there? Unfortunately, Shangguan Xue’er shook her head. “I’ve never heard of such a thing. But if it exists in this world we have a chance to find it.” Zhou Weiqing looked at the gigantic dragon, Hui Yao. Even if the Nether Realm didn’t exist he would still do all he could to get it, so that the dragons wouldn’t destroy the Lustre Spatial Realm. But matters were very grave now. It was not as simple as the Nether Realm merely threatening ZhongTian City, but was now threatening the existence of the entire human race. What was he to say? Zhou Little Fatty’s boldness emerged. He thought for a moment, then looked at Hui Yao. “Elder,” he said gravely, “what do you think about this. We’ll do this one of two ways. You give three years to do all we can to find the Spatial Teleportation Gem, and at the same time begin evacuating the people of ZhongTian City. If we are really unable to locate a Spatial Teleportation Gem by then, then you two can break open the Lustre Spatial Realm. That will give us time to evacuate its inhabitants. Of course it’s best if we can find it. If so, I will be the first to open up space and get you out of here.” Without a doubt this was the best course of action they could hope for. Hui Yao nodded. When he saw the look in Zho Weiqing’s eyes he praised, “You are an intelligent human. We’ll do as you suggest. I’ll give you three years.” Zhou Weiqing nodded. “Thank you, elder. Well then, we mustn’t let time go to waste. We’re leaving at once to help you search.” “Wait,” Hui Yao said. “Before you go, absorb some of my Heavenly Energy. Otherwise, I can’t guarantee I will be able to restrain my urge to go find my children.” Zhou Weiqing was taken aback, but the dragon Hui Yao had already extended its dragon claw before him. Its eyes calm, but Zhou Weiqing knew what he intended. He smiled. “Then this junior will go ahead.” Heavenly Jewel Island, Heaven’s Expanse Palace. Shangguan Tianyang and Tianyue were standing before the Lustre Spatial Realm Opening Formation with awful looks on their faces. Half a year had passed since Zhou Weiqing and them had entered the Lustre Spatial Realm. But there had been no activity whatsoever. The occasional energy fluctuations had not been as intense as before. In a certain sense the existence of the Lustre Spatial Realm was clearly more important than the lives of Zhou Weiqing and the five of them. But, the three Shangguan sisters were the brothers’ only descendants! If they all perished in the Lustre Spatial Realm it would be a fatal blow to Heaven’s Expanse Palace. Plus there was Zhou Weiqing and Heavenly Snow Mountain Lord Xue Aotian’s daughter. In the past WanShou Empire people had also entered the Lustre Spatial Realm, but were all expelled due to the danger. They returned to the WanShou Empire and told of Tian’er entering the Lustre Spatial Realm. If they all died there then before long Six Ultimate Heavenly Emperor Long Shiya and Lord of Heavenly Snow Mountain Xue Aotian would likely come looking. Heaven’s Expanse Palace was mighty, but they didn’t dare gang up on the likes of them! Shangguan Tianyue knitted her brows. “Big Brother, send someone in there to go see. It looks like things have calmed down in there now. If they’re alive we will find them. If dead, we will find their bodies!” Shangguan Tianyang sighed. “Second Brother, it’s all my fault. I shouldn’t have agreed to their requests and let them enter.” Shangguan Tianyue’s eyes flashed with a hint of deep worry. He shook his head. “That’s all over now. What’s done is done. We can only pray for our children. Big Brother, I…” Shangguan Tianyue, the Heavenly Emperor powerhouse, cut himself off there as his eyes welled up. Shangguan Tianyang didn’t know how to console him. Suddenly, the Lustre Spatial Realm fluctuated violently and the two brothers looked at the golden light shooting out. Lights and shadows flashed and five figures appeared in mid-air. Another flash of light and the five were before them. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-25-chapter-233-02","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
