{"id":51868,"no":694,"title":"Chapter 235 Sumeru Ring, Sea Emperor’s Shuttle (1)","content":"The single-horned Ghost Demon Horse was indeed moving astonishingly fast, and as it galloped forwards Zhou Weiqing and Shangguan Bing’er followed the fastest route out of the Zhongtian Empire and entered the Mi Ou Empire. They didn’t pause at all as they crossed through the eastern provinces, finally reaching the strategic town of the Blue Ocean City, located on the eastern shores of the Mi Ou Empire. They had spent nearly twenty days travelling. Although Zhou Weiqing and Shangguan Bing’er had been travelling at maximum speed, this had been an extremely important period of time for Zhou Weiqing. He had made use of this period of time to slowly fuse together all of the powers he had gained within the Lustre Spatial Realm, making it so that he could make complete use of that power. In addition, he realized that although he didn’t have any follow-up cultivation techniques which would allow him to continue to train his Saint Energy, it didn’t even seem necessary. Now that the Saint Energy had formed a perfect cycle, it would continuously loop through the cycle and draw upon the atmospheric energy of heaven and earth to replenish itself, strengthening his body in the process. The Saint Energy in his body was growing denser and denser. This upgrade process was slow but extremely stable. Zhou Weiqing even had the vague feeling that if he wished to form his Saint Core Nucleus, all he needed was to keep accumulating energy like this. The two of them purchased large quantities of food and beverages at Blue Ocean, placing them within a Spatial Ring inlaid with a silver gem. This ring was one of the many treasures which Zhou Weiqing had acquired from Heaven’s Expanse Palace. When he saw the agonized look on Shangguan Tianyang’s face, he had felt rather puzzled. It was just a ring, right? Heaven’s Expanse Palace was extremely wealthy. Why would it care about a ring? But after he actually used his Saint Energy to probe the ring and understand just how powerful it was, he completely understood why Shangguan Tianyang, an exalted Palace Master of Heaven’s Expanse Palace, would have such a pained look on his face. This Spatial Ring was called the Sumeru Ring, and it was able to contain an entire mountain within it! Simply put, if he wanted to use this ring to store grain, he would be able to keep an army of a hundred thousand soldiers fully fed for half a year without needing to be resupplied. The insides of Spatial Rings were completely sealed off from the outside world and were composed of perfect vacuums, making it very difficult for food placed inside to rot away. Any item could become priceless if upgraded to the maximum level possible. The Sumeru Ring was no exception. It was likely that there was no finer Spatial Ring in all the Boundless Mainland. Obviously, it was unlikely that Zhou Weiqing would be willing to give up an item like this now that it was in his hands. This was why Shangguan Tianyang had such a helpless and pained look on his face! However, Zhou Weiqing was heading to the Xuantian Continent strictly for the sake of helping Heaven’s Expanse Palace. Compared to the Heavenly Jewel Island, this ring was nothing at all. After all, no one could be sure how much time would be needed to traverse the great sea. With this ring, Zhou Weiqing and Shangguan Bing’er could sail the seas for years without worrying about running out of food. After buying enough food, water, vegetables, and fruits, the two of them departed from the Blue Ocean City and headed towards the shore. It was dusk. The stars glittered in the skies, while the bright moon’s reflection could be seen from in the waters of the sea. The moon illuminated the waves, bringing a special sense of peace and quiet. As the two stared into the endless seas, they felt as though their hearts had become just as boundless. This was their first time seeing the sea. No mere human construct could ever compare to the stunning natural majesty of the ocean. Shangguan Bing’er leaned against Zhou Weiqing’s shoulder, a dreamy look in her eyes. “A bright moon above the seas. This is such a beautiful image.” Zhou Weiqing chortled and said, “We’re probably going to be spending months on these seas. By then, you probably won’t think it is all that beautiful. I can’t even imagine how many dangers are lurking within the ocean, waiting for us.” Shangguan Bing’er rolled her eyes at him. “You jerk. You have no sense of romance. Let’s head out right now. The sooner we leave, the sooner we can return.” Zhou Weiqing nodded. He took a deep breath of the briny sea wind then waved his hand. The Sumeru Ring on his hand began to glow, followed by a strange object falling into the ground before them with a plonk. The moon cast a pale glow across this object, which reflected the beautiful moonlight. It was roughly seven meters long and had two narrow ends and a round center. It was completely translucent and looked almost like an enormous crystal which had been carved into the shape of an enormous date seed. It had been engraved with certain special runes that looked like those of strange sea beasts, none of which Zhou Weiqing or Shangguan Bing’er had ever seen before. Even Zhou Weiqing couldn’t help but feel intoxicated as he stared at this thing. Regardless of its use or function, its design alone was enough to enspell anyone who saw it. It was simply too beautiful. Not even Heaven’s Expanse Palace had any records on what this thing was made out of it. The only record it had stated was that not even a full-strength blow from a Heavenly King would be able to damage it in the slightest. One could imagine just how terrifyingly tough it was! The two ends of the shuttle tapered off into sharp spikes. One could vaguely see the scrawling, spiral shadows which lay hidden within it. There were some mechanisms inside, but the crystalline surface diffracted light in such a way that it wasn’t possible to clearly see just what those mechanisms were. This was the first time Zhou Weiqing or Shangguan Bing’er had ever gone out to sea. They had no guide and not the slightest scrap of experience when it came to seafaring. Why was it that Shangguan Tianyang would dare to let them sail tens of thousands of kilometers towards the Xuantian Continent? It was precisely because of this little bauble before them. Zhou Weiqing flipped his hand over, glancing at the adorable little crystal in his palm. This octahedral crystal was covered with thousands of cross-sections, and as the moonlight fell upon the crystal it glowed with absolutely dazzling rainbow light. Zhou Weiqing looked at Shangguan Bing’er, then chuckled. “Let’s see just how useful this ‘Sea Emperor’s Shuttle’ really is! Your Senior Uncle praised this little thing to the moon. He even insisted that we had to give it back to Heaven’s Expanse Palace after we returned. What a cheapskate.” Shangguan Bing’er felt rather speechless. “Oh, you! Stop being so greedy. Still… for Senior Uncle to value it so highly means that it must be truly remarkable.” He sent a stream of Saint Energy into the crystal in his hand. Instantly, a faint sheen of golden light emerged from the crystal. Almost instantly, the golden light expanded to cover the Sea Emperor’s Shuttle. With a clear ‘ding’ sound, a crystal lid slowly began to rise up from the now-glowing central part of the Sea Emperor’s Shuttle. Zhou Weiqing was rather disappointed. “Is that it? We’re supposed to sail for tens of thousands of kilometers in this little thing?” Shangguan Bing’er said, “We don’t have to use it, you know. We’re both able to fly. As long as we can take the occasional break inside after flying for long distances, we’ll be able to make it to the other side of the sea.” Zhou Weiqing shook his head. “Sailing the seas won’t be as simple as that. How are we even supposed to tell which way we are going when we are flying? How are we supposed to even know where the Xuantian Continent is? Remember, a tiny mistake at the beginning can result in us being off by a thousand kilometers. Your Senior Uncle already told us that the maps are all inside this thing, alongside everything else we need. Let’s go take a look first.” As he spoke, he flew straight into the Sea Emperor’s Shuttle. The crystal seats within the shuttle emanated a cold aura that went straight through their bodies, but they were a bit too large. Even Zhou Weiqing found them to be slightly too large for him. As for Shangguan Bing’er, when she followed him inside and sat down on one of the giant throne-like seats, she appeared to be particularly miniscule. Zhou Weiqing placed the crystal in his hand into the cavity in front of him. This was as Shuangguan Tianyang had taught him, but the crystal didn’t have any response at all after he inserted it. Even the lid above them remained open. “It’s been in storage for ages. Maybe it’s broken?” Zhou Weiqing was rather depressed. Shangguan Bing’er glanced at him. “It’s meant to be used in the ocean. Should we perhaps put it into the ocean first?” Zhou Weiqing removed the crystal from the cavity. “Then you just keep sitting here. I’ll push it into the sea and give it another try.” As he spoke he hopped out of the shuttle, then moved behind it and gave it a push. Zhou Weiqing had felt certain that given his power, this push would be enough to instantly shove the shuttle into the sea. However, the shuttle only advanced by a single foot. This thing was much heavier than he had imagined! It must be remembered that he was strong enough that even a casual push from him would contain a thousand kilograms of force. The Sea Emperor’s Shuttle looked very delicate and light, but he was only to push it forward by an inch across the soft sands of the beach. “It’s really heavy!” Startled, Zhou Weiqing summoned his strength and pushed with both arms while shouting, “Move!” This time, the Sea Emperor’s Shuttle finally slid all the way into the ocean. Zhou Weiqing was now certain that the shuttle had to weigh 1,500 kilograms at the very least, and most likely a bit more. Zhou Weiqing himself wasn’t sure how physically strong he had become, now that he had reached the nine-Jeweled level. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-25-chapter-235-01","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
