{"id":51900,"no":726,"title":"Chapter 246: Tenebrous Demon Dragon’s Uncertainty (2)","content":"Chapter 246: Tenebrous Demon Dragon’s Uncertainty (2) \n Zhou Weiqing smiled faintly, saying: “It is not necessarily looking for death. For me to have achieved what I have today, I have experienced many dangers in my life, but I am still alive now. I think that if I am able to witness Senior Tenebrous Demon Dragon killing the Terror Sea Dragon, it will be of great help to my future cultivation.” \n This was truly patting the horse’s ass, oh, no, it should be patting the dragon’s ass [1]. This was truly an art-form in its own right, and Zhou Weiqing had done so subtly, without leaving any trace. Added on to the fact that the Tenebrous Demon Dragon already approved of him, it nodded repeatedly and said: “With this Dragon’s cultivation, although I may not be able to win the Terror Sea Dragon in a one versus one fight, it should not be a problem to protect one person. Since you wish to go, then go ahead. It will definitely be a great help to your future. If we can succeed this time, I will allow you to Store a Skill from me. Although it would be a waste to Store it for your Demonic Attribute, but it will be extremely good to add to your Darkness Attribute.”\n “Many thanks, Senior.” Zhou Weiqing said delightedly. This was not acting at all; to be able to Store a Skill from a Heavenly God Tier Heavenly Beast, that would definitely be a great help to him. \n Dreamwake stared at Zhou Weiqing in front of her dazedly, and she couldn’t help but think to herself. This fellow doesn’t seem to be as arrogant as he did before! However, his talent was truly at a point that made her speechless. Even with her own background and cultivation, she was unable to stop herself from being a little jealous. \n The XuanTian Palace Master said: “Since Senior is willing to go along, then we should properly plan our next step. We must ensure that we guarantee absolute success.” \n “En. The rest of you can return first. Dong Fang, you and Dreamwake stay.” The Tenebrous Demon Dragon said solemnly. \n Zhou Weiqing glanced reluctantly at Dreamwake before turning to leave with the four Grand Elders and Nie Han. Originally, he had thought of taking advantage of her again on the return trip. With the revealing of his six Attributes and skills earlier, he believed that even with Dreamwake’s high position in the XuanTian Palace, she wouldn’t dare to finish him easily. He could still remember the softness in his arms earlier. Her body seemed so soft and flexible, if he could just… heh heh… \n Of course, he was just thinking it only. That was what he told himself. \n This time, it was Nie Han who brought Zhou Weiqing to fly back up. As soon as they returned to the XuanTian Citadel, Nie Han gave him a big thumbs up, before they returned to their respective rooms. \n When Zhou Weiqing returned to his room, Shangguan Bing’er was still cultivating as usual. Hearing his return, she opened her eyes. \n “What happened?” Shangguan Bing’er asked via voice-transference. \n Zhou Weiqing also replied with the entire story, similarly with voice-transference. \n Hearing that they had finally heard about the whereabouts of the Spatial Teleportation Gem, Shangguan Bing’er was overjoyed. Although she had never thought of herself as part of the Heaven’s Expanse Palace, she was still happy to be able to protect the Heavenly Jewel Island and the ZhongTian City. It was after all a major issue. \n “Little Fatty, what are you preparing to do? Although the Spatial Teleportation Gem might appear then, but there will also be just too many powerhouses around at that time. It will not be easy to take action.” \n Zhou Weiqing nodded silently before saying solemnly: “No matter what, I have to give it a try. Perhaps, this is our best chance, and may be our only chance. From the words and manner of speaking of that Tenebrous Demon Dragon, the Terror Sea Dragon is not so easily taken care of. At that time, perhaps it might end up with both sides sustaining great losses. If that happens, my chance will come. The Tenebrous Demon Dragon will definitely be in the thick of battle, and should not be able to break away to deal with me. As for the others, as long as I am determined to flee, even a Heavenly Emperor powerhouse might not be able to catch up. If I succeed in gaining the Gem, then I will use the Lustre Speech Gem to inform you. You bring the Sea Emperor Shuttle\n Shangguan Bing’er’s expression was worried as she said: “But… won’t it be too risky and dangerous?” \n Zhou Weiqing replied confidently: “Do not worry. Without absolute confidence, I will not easily take action. Furthermore, they are currently not clear about my true power. I have some level of confidence. On the other hand, I am most worried about you. If I do not guess wrongly, as soon as we leave, you will definitely be left here. With a ‘hostage’ here, only then can they be totally confident and relaxed about me. After all, we are still new. As such, as soon as we make a move, and there is a chance that shows itself, you should leave this place as soon as you can. At that point, there should only be some Heavenly Kings left to guard this place, and with the Wings of the Wind God, escaping should not be a big problem.” \n Shangguan Bing’er nodded, saying: “I guess we have no other choice. You do not need to worry about me. If… just in case…” \n As she spoke those words, before she could continue, Zhou Weiqing held her in his arms, kissing her heavily. “Silly girl, there is no in case. Compared to your safety, the Spatial Teleportation Gem is nothing.” \n As he said that, he had already lifted her up. In a flash, they appeared in his favourite place once more, the bed...\n …\n In the following period of time, the atmosphere in the entire XuanTian Palace had obviously grown rather nervous. Everyone seemed to be wildly beating gongs and drums in preparation [2] for the upcoming fight, but there was no rush to take action. It was obvious that this time the XuanTian Palace wanted everything prepared perfectly, after all they only had the one chance at success. As for what exactly they were preparing, Zhou Weiqing was not too clear. \n The nervous atmosphere did not affect Zhou Weiqing at all. His status in the XuanTian Palace was extremely high and respected, as a Consecrated God Tier Consolidating Equipment Master. Naturally, he would not need to join in the preparation works. \n As such, both Zhou Weiqing and Shangguan Bing’er spent the days cultivating with all their might. In such a place with such rich and pure atmospheric energies, it was a breeze to cultivate, gaining twice the results with half the effort. Zhou Weiqing’s cultivation rose steadily, and though the speed was no match for when he was cultivating the Immortal Deity Technique, he could still sense the steady increase which would definitely lead to breakthrough in the future. Furthermore, he still needed to familiarize himself with the usage of the Heavenly Dao Energy. \n ...\n “Weiqing, are you in?” A knocking sound rang from the door as Dreamwake’s gentle voice came from outside. \n Ever since they had met the Tenebrous Demon Dragon a few days ago, Zhou Weiqing had not seen Dreamwake since. Originally, he thought she was angry with him, but currently from her tone, he could not hear any of that. \n Shangguan Bing’er walked to open the door, greeting: “Consecrated Dreamwake, please enter.” \n Dreamwake smiled as she shook her head, saying: “I won’t be entering now. We are about to go against the Tenebrous Demon Dragon soon, and I am here to invite Weiqing to come discuss our plans with the others.” \n At this point, Zhou Weiqing also walked over. He did not know why but when he saw the gentle smile on Dreamwake’s face, he suddenly felt a chill run down his spine.\n “Is it necessary for me to be there for the strategy discussion? Anyway, I am just there to watch.” Zhou Weiqing scratched his head awkwardly. \n Dreamwake laughed heartily, saying: “How could you say that? In our eyes, you are a genius unparalleled in history, and will remain unmatched in the future. Furthermore, as you said, you are going there to learn and experience, so this strategy meeting will be of good use to you too. Come on.” As she said that, she turned to leave.\n Zhou Weiqing gave Shangguan Bing’er an assuring glance before following behind Dreamwake. \n Dreamwake walked at the front, not speaking to him at all. Very quickly, both of them arrived at the teleportation formation of the sixth storey. \n Zhou Weiqing thought to himself: Could I have guessed wrongly? Are we really going to the Heavenly Hall to have a meeting? \n Dreamwake continued her silence, and before Zhou Weiqing could think further, the twisting light of being warped flashed, and their figures vanished instantly. \n However, very quickly, Zhou Weiqing realised something was wrong. When they reappeared once more, it was not in the Heavenly Hall like the previous time. Instead, it was in a broad open space. \n The floor seemed to be paved with asphalt, but there seemed to be a strange illusory quality to the entire area, though it seemed so vast that even Zhou Weiqing could not see an end. \n No good! I’ve been tricked! Zhou Weiqing’s heart gripped. Towards Dreamwake’s true power, he did not have a good grasp. Furthermore, in this new spatial zone, he did not know how to leave. If any problems arose, that would be extremely troublesome. \n Having reached her destination, the smile on Dreamwake’s face had vanished, her gaze turning cold. \n “Zhou Weiqing, die!” An abrupt pressure, as massive as a mountain smashing down upon him, burst forth from Dreamwake’s body, accompanying her right palm striking forward, a thick Heavenly Energy reverberation descending from the skies like a massive palm down towards his head. \n Oh crap, has she discovered my identity? This was the first notion in Zhou Weiqing’s heart. This palm strike from Dreamwake was clearly far beyond what a six-Jeweled Heavenly Jewel Master could withstand. \n A silver flash of light, as Zhou Weiqing activated his Blink Skill, appearing more than a dozen metres away from his original position. In a massive explosion, the place he had been standing at a split second ago exploded with a loud bang, the resulting shock waves actually causing him to fly back further. \n “Dreamwake, what are you doing? Are you crazy?!” Zhou Weiqing yelled in shock and fury. The acting was perfect, voice, tone and even the expression on his face. At the same time, his mind and heart was spinning like crazy as he tried to think of a solution as quickly as possible. \n The first thing he needed to judge was whether or not Dreamwake really knew about his identity. If that was the case, then this was a fight he could not avoid. The only thing he could do then was to capture Dreamwake; that would be his only ticket out of the entire situation. Furthermore, Bing’er was still in the XuanTian Citadel!\n Dreamwake’s first attack had failed, but she instantly launched a second one. A thick white Heavenly Energy coalesced itself into a longsword in midair, the tip of the sword lancing towards Zhou Weiqing’s chest in a flash of white light. \n Taking a deep breath, Zhou Weiqing had made a resolute decision instantly. Shouting angrily: “Come kill me if you want!” He actually stood there, not even attempting to dodge any further. \n The white sword glare reached his chest instantly. In that moment, Zhou Weiqing’s heart had risen up to his throat. Even if he did not make any attempt to dodge or block it, he had the confidence that this sword strike would not kill him outright, or even critically injure him. However, if that really happened, then it meant his worst fears had come true, and Dreamwake had discovered his identity and was adamant on killing him. This would greatly affect his entire plan. As such, this could be said to be one last key bet that would influence his entire quest to the XuanTian Continent. \n In a flash of light, the sword abruptly stopped just half chi away from his chest, the keen sword qi even causing goosebumps to appear on his chest area. The Immortal Deity Shield was already gathered at his skin level; if not for Zhou Weiqing suppressing it with his Saint Energy, it would have already erupted out to protect him automatically. \n [1] Patting the horse’s ass is the literal translation for flattery, just like ‘licking one’s boots’ in english. TJSS is making a pun here on that\n [2] intense publicity campaign in preparation\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-246-02","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
