{"id":51918,"no":744,"title":"Chapter 252: No Regrets (2)","content":"Perhaps because of how good the freshly-cooked grains were, Dongfang Hanyue’s nose twitched and she slowly opened her eyes. She couldn’t help but feel tremendously shocked at what had happened to her internal meridians. All of the damaged meridians had been healed. Given her cultivation base, even without actually cultivating she had been able to recover a large amount Heavenly Energy once her meridians had been restored. And, she could vaguely sense that the unshakable bottleneck she had faced due to her having using that unique cultivation-enhancing method had actually been loosened. A glow of faint, silvery-white light covered her internal organs, which seemed to be stronger than before. “Mm…” Dongfang Hanyue stretched her muscles, a series of gentle cracking sounds popping from her body. Her four limbs and her bones felt filled with strength and vitality. A look of pleasure appeared on her slender face without her even realizing it. Gulp. Zhou Weiqing’s cooked rations fell into the campfire, his eyes nearly popping out of their sockets. Dongfang Hanyue’s lazy stretch had put her alluring figure on full display, and her mesmerizing little moan almost instantly caused Zhou Weiqing’s blood to start pumping with bestial desire. “Can you not do that? This is total entrapment,” Zhou Weiqing said while gulping down his saliva. “Nope.” Dongfang Hanyue cast him a sidelong glance. Zhou Weiqing was instantly rendered speechless. He once more took out two rations of grains and dried meat to cook them over the fire. Dongfang Hanyue sat on the other side of the campfire, her arms hugging her knees. She didn’t look at Zhou Weiqing as she murmured, “Tell me more about the Boundless Mainland and of yourself.” “Alright,” Zhou Weiqing said. A reminiscent look appeared in his eyes. He didn’t lie, nor was there anything to lie about. He simply narrated his tale. “I was born in a small country known as the Heavenly Bow Empire in the Boundless Mainland. Originally, I wasn’t even supposed to become a Heavenly Jeweled Master, but then one day…” Although he was only in his twenties, he had a very rich history. He compressed the story as much as he could, but it still took him four full hours to tell his tale. By now, it was very late at night, and the two of them had already eaten quite a bit of food. Zhou Weiqing didn’t even know how many times he had added more wood which he had acquired from the trees behind them. “Then why do you need to take the Spatial Teleportation Gem of our Xuantian Palace?” Dongfang Hanyue asked curiously. Zhou Weiqing had narrated almost all the important events of his life. He didn’t even hold back on the details between him and his female ‘friends’, but he hadn’t spoken of why he needed the gem. Zhou Weiqing shook his head and smiled. “That’s a secret. If you give me the gem, I’ll tell you.” “In your dreams.” Dongfang Hanyue snorted. “Forget it then.” The two briefly fell silent. The only sound which could be heard was the crackling of the fire as it broke down the wood. “Compared to you, my history is much simpler. Weren’t you curious as to how I gained the power of a Heavenly Emperor and also became a God Tier Consolidating Equipment Master?” Dongfang Hanyue said in a low voice. Zhou Weiqing nodded. He was indeed extremely curious. Dongfang Hanyue murmured, “Actually, there’s no need for you to doubt your own talent, because it far surpasses mine. I’m absolutely certain that if I had to train by myself, even if I was several years older than you I still wouldn’t have your current level of power. The vast majority of my cultivation base was given to me.” “Given to you?” Zhou Weiqing’s eyes were filled with surprise. Dongfang Hanyue said, “You should’’ve been able to tell that every high-level member of Xuantian Palace has a legacy which grants us Tenebrous energies. In truth, that’s because of the Tenebrous Demon Dragon Bloodline which flows through our veins. Xuantian Palace, especially its leaders like myself and my ancestors, is composed of the progeny of a human who joined together with a Tenebrous Demon Dragon. Thus, from a certain perspective, I’m not a pure human being. I’m a Draconian.” “My dragon ancestor was able to take human form due to his transformation technique. He married a human woman, resulting in our lineage being created. We have the physique of Tenebrous Demon Dragons, but the wisdom and talent of humans. That was what the foundation of Xuantian Palace was built on, and so we were able to develop and thrive. We have always had the Tenebrous Demon Dragon’s aid. That is where our Tenebrous Attribute comes from. “As a result, we named ourselves ‘Demon Draconians’. Our race has a special legacy technique. Once the previous Palace Master is about to perish, he can transfer his cultivation base to the next Palace Master. Although not everything can be transferred, this legacy is still enough to ensure that the next Palace Master will become extremely powerful within a short period of time. Only those of us in the direct line of descent have the purest Bloodline necessary to engage in this ritual. I am the legacy inheritor of this generation. My father heavily injured himself as he forcibly tried to break into the Heavenly God level, and before he died he transferred his cultivation base to me.” “Although this transfer process allowed me to quickly gain the power of a Heavenly Emperor, it also came too easily. I didn’t need to go through the process of accumulating power, and so I shall be limited to the Heavenly Emperor level for my entire life.” Upon hearing this, Zhou Weiqing finally understood where Xuantian Palace came from. Dongfang Hanyue was basically telling him all of Xuantian Palace’s secrets without holding anything back at all. “Then who is ‘Palace Master Dong Fang’? Is he also a Grand Elder?” Zhou Weiqing asked. Dongfang Hanyue shook her head. “She, actually. She is my mother. In order to temporarily assist me in overawing the Elders, my mother and I are temporarily managing Xuantian Palace together. However, I am still the leader. The first ‘Xuantian Palace Master’ you encountered was actually me. After that, I only appeared in my position as ‘God Tier Consolidating Equipment Master Dreamwake’, at which point you only saw my mother.” Zhou Weiqing finally understood. “No wonder I felt something was off after the second meeting with her. So it was a different person. However, that mask of yours is truly marvelous. I couldn’t even tell if ‘Dong Fang’ was a man or a woman.” A dreamy look appeared in Dongfang Hanyue’s eyes. “In many people’s eyes, the Xuantian Palace Master is forever a lofty and exalted figure. However, they don’t know how lonely this position is. Your background took hours to narrate, but mine only took a few sentences. If I could choose, I would rather choose to be an ordinary person.” Zhou Weiqing said, “Although destiny has chosen you for certain tasks, you can also choose to try and change destiny.” Dongfang Hanyue laughed bitterly. “Change? How? I bear the burden of my entire Bloodline’s legacy and have shouldered the responsibilities of managing Xuantian Palace. All I can do is to ensure that Xuantian Palace remains powerful.” Suddenly, an incomparably powerful aura swept out of her body. Dongfang Hanyue slowly rose to her feet, her gaze turning sharp as she stared at Zhou Weiqing. “I have already recovered completely.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-252-02","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
