{"id":51936,"no":762,"title":"Chapter 258: Saint Core? Astral Core? (3)","content":"The water flowing past them turned almost illusory. None of it seemed real. Save for the hazy blue skies, she couldn’t see a thing in the outside world at all. What level of speed was necessary for something like this? This was probably far faster than when she was travelling with her Wings of the Wind God.\n In truth, she didn’t need to try and connect to the outside world. Zhou Weiqing doing it was enough. Zhou Weiqing suddenly reached out stealthily with his thoughts. He wasn’t using his own strength right now at all.\n His will was infused into the Astral Saint Core Nucleus in front of his chest, and a strange pulling force emanated from his body. He seemed to have become a true star, causing the energies of the sea to instantly transform into his subordinates. It was the powerful atmospheric energies of the sea itself which was propelling them forwards. Otherwise, how could they be going this fast?\n In addition, thanks to the influence of Zhou Weiqing’s Astral Saint Core Nucleus, all sea creatures within a thousand kilometers fled in terror. Thus, nothing would impede their path.\n Without question, the Astral Saint Core Nucleus was what had guided Zhou Weiqing to become a Heavenly King. He himself wasn’t sure just how strong he was after having condensed this Astral Saint Core Nucleus, but what he was seeing had proven a few things.\n First, after gaining the Astral Saint Core Nucleus, he was able to truly employ Heavenly Dao Energy to control atmospheric energies. However, he was different from other Heavenly Kings. Any Heavenly Jewel Master, be it Heavenly Kings, Heavenly Emperors, or even Heavenly Gods, had their own domains which they were best suited for. These domains were determined by their Attribute.\n Simply put, a Heavenly Jewel Master who had the Fire Elemental Jewel would definitely be able to summon the most atmospheric energies if he was in a place like the mouth of a volcano. The sea would naturally be most advantageous to Water Attribute Heavenly Jewel Masters, which was why Terror Sea Dragons were so powerful in the ocean.\n Zhou Weiqing was different. He didn’t have the Water Attribute, but when he unleashed the aura from his Astral Saint Core Nucleus, he had an even greater control over the ocean than a Heavenly King who DID have the Water Attribute.\n This essentially meant that his Astral Saint Core Nucleus would allow him to summon atmospheric energies in any situation, allowing him to use it as though he had that affinity. In other words, he could use atmospheric energies as he pleased. He would always be on ‘friendly terrain’, no matter where he fought.\n What was even more important, however, was that the amount of atmospheric energies Zhou Weiqing was able to summon was somewhere between ten times to a hundred times greater than what an ordinary Heavenly King could use. As for exactly how much, he wasn’t sure yet. Most terrifying of all was the fact that the atmospheric energies could actually be converted into Saint Energy in the outside world and used to cast techniques. He no longer had to first compress it and convert it within his body.\n This was Saint Energy, true Saint Energy. After gaining the Astral Saint Core Nucleus, Zhou Weiqing’s power had risen to an unprecedented level. Forget about Heavenly Kings, even ordinary Heavenly Emperors wouldn’t necessarily be a match for him.\n The Sea Emperor Shuttle’s speed was raised to its truest heights. In truth, they were moving so fast that Zhou Weiqing could clearly sense that if he accelerated any further, this divine seafaring artifact which had been created from a Terror Sea Dragon’s core might end up damaged. Thus, he kept the speed within a manageable zone instead of really giving it his all.\n What rendered Shangguan Bing’er speechless was… while they were hurtling through the seas at such a terrifying speed, Zhou Weiqing still had the presence of mind to ‘bully’ her. And… his body was now even more freakishly strong than before! Each time, he wouldn’t stop ‘bullying’ her until she repeatedly begged for mercy… and judging from the look on his face, he clearly wasn’t all that satisfied.\n For the first time, Shangguan Bing’er began to think that having a few extra sisters might not be a bad thing.\n This journey of tens of thousands of kilometers was completed in just half a month. They could now see the outlines of the Boundless Mainland.\n If someone had previously told Zhou Weiqing that they would be able to travel from one continent to another in just half a month, he never would’ve believed it. Now, however, it had just happened in front of him.\n The Sea Emperor Shuttle gradually slowed down. Zhou Weiqing hadn’t simply been trying to travel fast, he also wanted to familiarize himself with his Astral Saint Core Nucleus. The better he understood it, the more stunned he became. He was now certain that after gaining the Astral Saint Core Nucleus, he was definitely amongst the powerhouses of the Boundless Mainland.\n They finally reached the shore. Zhou Weiqing sent the Sea Emperor Shuttle rising back to the surface, then popped the lid open. He took a deep breath, inhaling the moist air of the seashore. Both of their spirits were invigorated.\n This had been a much shorter trip, and the sense of loneliness didn’t really set in as much. Zhou Weiqing and Shangguan Bing’er leapt onto the sand with his arm around her shoulders. He waved his right hand, causing a wave to push the Sea Emperor Shuttle to him. It flashed as it entered his Sumeru Ring. This feeling of having complete control over Heaven and Earth was absolutely marvelous.\n Two balls of fire suddenly burst out of Zhou Weiqing’s chest. Accompanying the dense Fire Attribute energies were the great dragons Hui Yao and Duosi, who appeared next to Zhou Weiqing.\n “I really didn’t imagine we’d be back so soon. Even if we flew all the way, we wouldn’t have been any faster. Weiqing, your Saint Attribute is truly marvelous!”\n Despite Hui Yao’s power, he couldn’t help but let out a congratulatory sigh. In his heart, Zhou Weiqing’s status rose even higher.\n Zhou Weiqing chortled. “Seniors, what do you plan to do next?”\n Hui Yao said, “I’m extremely grateful for you having released us from the Luster Spatial Realm, but we cannot continue to stay by your side. We can vaguely sense where our children are, and we need to go find them. Take this.” Hui Yao opened his draconic mouth, shooting out a streak of red light towards Zhou Weiqing.\n Zhou Weiqing lifted his hand up and accepted it. He lowered his head, seeing that it was a dark-red scale.\n Hui Yao said, “This scale contains my Bloodline Aura. This is how you use it…” His voice disappeared as he instead mentally transmitted the method to Zhou Weiqing.\n Zhou Weiqing nodded. “Thank you, senior.”\n Hui Yao shook his head. “We should be the ones thanking you. Alright, let’s part ways here. I trust we’ll meet again in the future.” After finishing, he sent his great bulk soaring into the skies and disappeared.\n Duo Si nodded towards Zhou Weiqing and Shangguan Bing’er, then flew after her husband.\n Zhou Weiqing watched as the two dragons vanished, then said, “Bing’er, let’s go.”\n Shangguan Bing’er said, “Where should we go first?”\n Zhou Weiqing said, “We naturally need to return to your Heaven’s Expanse Palace first. We need to tell my father-in-law the good news, that we’ve already summoned the great dragons back. Then we’ll head straight to Heaven’s Bow. It is time to save my parents.”\n He had finally broken through to become a Heavenly King and consolidated his Astral Saint Core Nucleus. Zhou Weiqing was tremendously confident in his chances of rescuing his parents. The sooner he saved them, the sooner he could relax.\n While chatting, he pulled Shangguan Bing’er into the sky and began to fly forwards. Given his current cultivation level, he no longer needed to rely on horses. Flying didn’t consume too much of his energy, and they didn’t even need for Bing’er to use her Wings of the Wind God.\n A gentle breeze brushed past the two of them. As they rose into the air, they began to hasten westwards. To prevent others from noticing them, Zhou Weiqing even summoned some clouds to cover them. They flew forward above the clouds, almost like Immortals or Gods.\n Even though Shangguan Bing’er had already experienced how powerful Zhou Weiqing had become while they were riding the Sea Emperor Shuttle, she was stunned once again as they flew. The wind seemed to have become their servant, supporting them, pushing them, and even covering and protecting them. The wind seemed to have become part of Zhou Weiqing’s body, and even high in the air they could still clearly see just how fast they were travelling judging from the land below them.\n It only took a few days to go from the eastern seas to the Zhongtian Empire. Just a few more days after that, they saw Heavenly Jewel Island and Heaven’s Expanse Palace appear in the distant horizon.\n Given Zhou Weiqing’s cultivation, he could’ve led Shangguan Bing’er to head inside directly. There were now very few people, even in Heaven’s Expanse Palace, who could stop him. This might incite some squabbling, but it wouldn’t cause any real problems.\n However, Zhou Weiqing didn’t do this. For some reason, after his level had increased his entire mindset seemed to have changed as well. Simply put, he had become much more peaceful and calmer. His spirit had been upgraded, allowing him to reach a brand new level. Compared to the previous him, instead of growing more arrogant he actually became much more reserved.\n Shangguan Bing’er had noticed this the most. If Zhou Weiqing previously shone like a dazzlingly sharp sword, he was now like a treasured blade hidden within the sheath.\n The two landed outside Zhongtian City, following the Heavenly Pillars upwards. Shangguan Bing’er’s face was more effective than any writ of passage. Everyone knew the three Shangguan sisters! Besides, Zhou Weiqing himself did have a writ, and so they were unimpeded as they reached Heavenly Jewel Island.\n As soon as they reached the island, the two were shocked. There were now two people waiting for them there. It was the mother and father of the three Shangguan sisters, Second Palace Lord Shangguan Tianyue and his wife Tang Xian.\n However, it looked as though Shangguan Tianyue still had yet to fully win his wife’s heart back. Tang Xian stood four or five meters away from him, but when she saw Shangguan Bing’er she charged out like a gust of wind and pulled her daughter into her arms.\n When parents had many children, even when they strove to be fair they couldn’t be completely impartial. Without question, of the three Shangguan sisters, Tang Xian doted on Bing’er the most, as she had viewed Bing’er as important as her own life for many years. Otherwise, she wouldn’t have come to wait here alongside Shangguan Tianyue as soon as she heard the news.\n “Mother…” Shangguan Bing’er’s voice caught in her throat as she threw herself into her mother’s arms like a baby sparrow.\n Shangguan Tianyue stood off to one side, watching them with eyes filled with warmth and gratification. He then turned to look at Zhou Weiqing.\n “I didn’t expect you to succeed after just a bit over a year. Huh?” Shangguan Tianyue’s eyes lit up, and the way in which he gazed at Zhou Weiqing changed a bit.\n Zhou Weiqing said curiously, “Milord father-in-law, how did you know that I completed the mission?”\n Shangguan Tianyue didn’t answer. Instead, his gaze grew increasingly stunned as he stared at Zhou Weiqing. “Kid, your cultivation…”\n Shangguan Tianyue felt as though Zhou Weiqing was nothing more than an ordinary person. The kid didn’t even seem to be a Heavenly Jewel Master, and didn’t even seem to have any Heavenly Energy ripples emanating form his body. But how could he possibly an ordinary person? If he was, how could he have so easily and calmly ascended the towering Heavenly Jewel Island? If he didn’t lose his cultivation, then… the answer had to be the exact opposite.\n Shangguan Tianyue was a Heavenly Emperor, after all. If even he couldn’t see Zhou Weiqing’s true level, how could he not be surprised?\n Zhou Weiqing chortled. “I was lucky enough to break through. Father-in-law, you can no longer refuse to acknowledge me as your son-in-law, right?” While speaking, Zhou Weiqing strode forwards, his body lifting up off the ground for a brief moment before coming back down again. Being able to physically fly was one of the hallmarks of a Heavenly King.\n An amazed light flashed through Shangguan Tianyue’s eyes, but he didn’t pursue this line of questioning. “Let’s go. We’re going to go visit my big brother. Xian’er, take Bing’er and have her get some rest.” He doted dearly on his daughter, but as for this son-in-law? Hmph. This damned brat managed to steal all three of my daughters. ‘Tired’ isn’t a problem for him.\n Shangguan Bing’er’s eyes were rather reddened. She turned to look at Zhou Weiqing, while Tang Xian said unhappily, “Silly girl, do you think he’s going to abandon you? Hmph. Zhou Weiqing, you son of a bitch, don’t go anywhere. I’m not done settling accounts with you.”\n It had indeed been a long time since he had seen his mother-in-law. When he heard her say ‘settling accounts’, he couldn’t help but stare.\n Tang Xian did something completely unexpected. She released Bing’er’s hands, then charged over to Zhou Weiqing. She reached out with her right hand, her palm instantly transforming to become fiery red as she slapped out at Zhou Weiqing’s chest.\n Tang Xian had never been a mild-mannered woman. Otherwise, she wouldn’t have left for so many years due to Shangguan Tianyue’s playboy ways. All three of the Shangguan sisters had lied to her, not daring to tell her that all three of them had fallen for Zhou Weiqing. This was why she had never shown herself. Alas, in the end paper could not smother fire. The three Shangguan sisters had grown closer and closer to Zhou Weiqing, while Shangguan Tianyang and his brother had already begun to prepare for their wedding ceremonies. They couldn’t hide all of this from Tang Xian, right?\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-258-03","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
