{"id":51987,"no":813,"title":"Chapter 276: The Sidhe\u0027s Sealed Grounds (3)","content":"As a former successor of Heaven’s Expanse Palace, Shangguan Xue’er was the most knowledgeable. At that moment, all she could think of was Spatial Law. Indeed, only one who had mastered Spatial Law could do what Zhou Weiqing just did. Clearly, the ancient tree was the entrance to the sidhe’s sealed grounds. The entrance didn’t actively move to avoid them when they arrived; rather, it was time for it to move. In turn, Zhou Weiqing brought the five ladies with him to find it once again. It looked easy, but in reality, it was extremely difficult. There was only one way to find the exact location of something or someone that used Spatial Teleportation - mastering Spatial Law and sensing the location via space ripples within a specific area. This was a skill that a Heavenly God with Spatial Attribute possessed. Heavenly Snow Mountain Lord Xue AoTian was currently the only known Heavenly God within the Boundless Mainland, but he did not have any Spatial Attribute abilities. Earlier when Zhou Weiqing boasted that he was on par with Heavenly God Stage powerhouses, Shangguan Xue’er was rather doubtful. However right now, she truly believed him. Zhou Weiqing’s strength and abilities had already exceeded beyond her knowledge and understanding. Zhou Weiqing was not aware of the psychological changes of the women watching him. He slowly walked up to the huge tree and tested the waters by touching it. Immediately, a strong sense of repulsion erupted. Despite Zhou Weiqing’s strength and cultivation base, his hand rebounded upon impact. “These are Heavenly God level energy ripples,” Zhou Weiqing blurted aloud. Of course, these were mere ripples; - if Zhou Weiqing wanted to force his way through, it would not be entirely impossible. However, if that was the case, the sealed grounds’ Parallel Space would definitely be damaged to a certain extent. The five women behind Zhou Weiqing stood in a semi-circle. Shangguan Xue’er said, “It is impossible to enter the sealed grounds without nature’s energy. You need to perfectly coordinate the Six Attributes - Water, Fire, Earth, Wind, Light and Darkness, to achieve certain unique ripples before creating a sufficient equilibrium to enter it.” Zhou Weiqing laughed, “Why do I feel as though you are referring to Master’s Six Ultimate Skill Manipulation Formation! Isn’t Master equipped with all six of those Attributes? Before they left Heavenly Bow Empire, Zhou Weiqing had put several things in order. Now that the Heavenly Demon Sect had become a part of Peerless Sect, Ming Yu was dead set on staying behind - even if he wanted to leave, he could not. And in order to fulfill his promise, Zhou Weiqing would not disturb Long Shiya over trivial matters. Shangguan Xue’er said, “I’m afraid Senior Long might not be able to enter either. The special frequency formed by the Six Attributes needs to be the same as the one within the sealed grounds. Furthermore, the frequency is constantly changing. With the six of us combined, we have all Six Attributes as well. We can only use trial and error, and depend on our luck. Zhou Weiqing chuckled and shook his head, “It doesn’t have to be that troublesome. Watch me.” As he spoke, Zhou Weiqing’s right hand gestured, dense reddish golden Nebula Saint Energy engulfed the six of them. Under the influence of the Nebula Saint Energy, they slowly floated above the ground, hovering an inch above. From afar, the six of them looked like a huge reddish golden light ball. Zhou Weiqing controlled the huge light ball, slowly approaching the entrance of the sealed grounds. “Weiqing, I don’t think it’s gonna work……” Shangguan Xue’er was shocked - just when she thought that Zhou Weiqing was relying on the Nebula Saint Energy to forcefully enter, something odd happened. The huge tree that was formed by energy actually did not repel the Nebula Saint Energy’s reddish golden rays of light. The surroundings suddenly became distorted. Immediately after, the outside of the Nebula Saint Energy was filled with green light. The light flashed and in the next moment, they had appeared in a different place. It was a dream-like place; the five of them appeared on a hillside, hence they were able to look further ahead. The sky was blue, crystal clear without a single blemish. There weren’t any roads, only all sorts of strange plants. The shortest tree was over 30 meters in height. Additionally, Zhou Weiqing had never seen most of these tree species before. If the vast forest earlier could be described as brimming with life, then this place was an absolutely boundless ocean of life. What took one’s breath away was an oval lake that was lying there peacefully and quietly, just a few hundred meters away from them. Even if one was standing a few hundred meters away, he would still be able to see the crystal clear waters of the lake, akin to sapphire of the highest quality. As the sun shone on it, it directly reflected its light onto the mountain on the other side. Anybody who saw a marvelous sight as such would be completely stunned by its beauty; the exceptionally fresh air caused the pores all over their bodies to open up. “Such a wonderful place.” Zhou Weiqing turned around and looked at his partners and noticed the shocked look on their faces. The other four women were enjoying the scenery but Shangguan Xue’er was looking at him. Her shocked and somewhat dazed expression was too alluring - her red lips were slightly opened and her delicate face was slightly flushed. How could Zhou Weiqing let go of this opportunity? He immediately went up to her and kissed her on the lips. Shangguan Xue’er snapped out of a trance by his kiss and asked, “Weiqing, how…how did you do that?” Zhou Weiqing laughed, “It’s very easy! Your husband is awesome, huh? In fact, I was already pretty confident when you told me about the sidhe’s sealed grounds this morning. Regardless of the type of energy, be it Nature Energy or Saint Energy, there are different means of achieving the same end as they are within the same scope. Even though my Saint Energy cannot be compared to the actual Creation Saint Energy, it is still one of the purest energies in the world, hence it still possesses creation powers similar to Creation Saint Energy. Even though I would not be using Nature Energy, at least it would not reject my Saint Energy. To put it simply, my Saint Energy is on a higher level than the sidhe’s Nature Energy. If it’s simply a matter of entering via having the ‘right’ type of energy, how are they going to reject me? This is what it means to have a superior Attribute. In truth, you guys should be able to do the same as well.” The women had a rather profound understanding of the wonders of Saint Energy, but they could not be compared to Zhou Weiqing, not even if Tian’er were to condense Astral Saint Core Nucleus. Her Astral Saint Core Nucleus could not come close to Zhou Weiqing’s Saint Energy. This was due to their difference in absorbing energies. Zhou Weiqing had both the Dragon-Tiger Transformation and the Immortal Deity Shield to protect himself, while his strength also surpassed that of Tian’er. Hence, when he condensed the Astral Saint Core Nucleus, he would be able absorb staggeringly greater amounts of energy. This was the reason why he took such a long time to breakthrough. Although the current Zhou Weiqing had not quite fully comprehended his Saint Energy, he still had a rather profound understanding of it. Otherwise, he would not have been able to master Spatial Law. Right at this moment, Little Witch excitedly jumped up, “This place is too beautiful, it is full of life aura! Weiqing, how nice would it be if we’re able to live in such a place in the future? It is indeed a paradise on earth.” Zhou Weiqing laughed, “No, this is the sidhe’s paradise. However, we might be able to establish another Parallel Space of our own. After my cultivation base has increased to Heavenly God Stage, I might be able to do it.” “Really?” Little Witch put her arms around Zhou Weiqing’s neck and kissed him on his cheek. After reuniting with Zhou Weiqing, her mood and personality had gradually loosened up and she had slowly started to go back to her usual impish self. Shangguan Xue’er sighed softly and looked at Zhou Weiqing, “If you talked about establishing another Parallel Space before we came here, I would have definitely called you out for senseless boasting. However, I do believe you now.” Only a person with at least a Heavenly God cultivation base could establish a Parallel Space. However, not any ordinary Heavenly God could do it - the size of any such Parallel Space would be directly proportional to one’s cultivation base. Generally speaking, it took at least four Heavenly Gods with Spatial Attribute who had also mastered Spatial Law working in concert to accomplish it. Since Zhou Weiqing had already mastered Spatial Law as a mere Heavenly Emperor, he was not bragging baselessly when he said that he would be able to establish a Parallel Space when he advanced to become a Heavenly God in future. Tian’er laughed out loud, “Little Witch, when he has really established a Parallel Space, you’ll understand that establishing one like the sidhe’s is no easy feat. It’s possible for him to establish a Parallel Space, but it does not mean that he could create one as breathtaking as this one - it is the result of thousands of years of hard work on the part of the sidhe. All the mountains, lakes and trees here were actually brought over from our world and cultivated here. You’ve also visited Heavenly Jewel Island’s Luster Spatial Realm - on the whole, everything there was just a natural product of the realm. It feels different from this place, right?” Shangguan Xue’er smiled and said, “Tian’er is right. However, if we are really able to own a Parallel Space, we would be able to decorate everything within it ourselves! If there is nothing for us to worry about on the Mainland, we can spend the rest of our lives sprucing up our own world, isn’t that wonderful?” When Shangguan Xue’er said that, all the women nodded continuously, with their eyes lit up. Having a world to call their own that only they have access to - the rich might own mansions but they would have their own dimension! Just thinking about it made them all fired up. Looking at the five women yearn for it, Zhou Weiqing felt resolved to help them fulfill their dreams. Furthermore, he also felt that it would be wonderful to have a dimension of his own, where he could even station the Peerless Sect. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-27-chapter-276-03","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis] In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour… Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift? Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country! An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao! [Translated Synopsis] Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power. Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels. Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters. Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes. Our MC here is an archer who has such a pair of Heavenly Jewels.","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
