{"id":52039,"no":865,"title":"Chapter 295 - One Hidden Trump After Another (1)","content":"The Boundless Infinitum Set - also known as the world’s number one Legendary Set; the one and only true God Set. Naturally, there was a reason behind that reputation.\n The Heavenly Snow Mountain had been rivals with the Heaven’s Expanse Palace for several years - if Xue AoTian truly had the ability to kill Shangguan Tianyang, why would he have held back during the previous Grand Tournaments? The reason why he could not do it was because Shangguan Tianyang possessed the Boundless Infinitum Set.\n An eight-piece Consolidated Equipment Set could barely be considered as a Legendary Set; a nine-piece and a ten-piece set were regarded as true Legendary Sets. As for an eleven-piece set, it was no longer confined to the term ‘Legendary’ - it was considered as a true God Set. \n The first property of the Boundless Infinitum Set was its resistance against Celestial Territories. The second property was that it possessed its own Celestial Territory - the Boundless Infinitum Celestial Territory. In terms of the overall power, even with the God Set, perhaps Shangguan Tianyang would still be unable to defeat Xue AoTian. However, the reverse was also true - Xue AoTian was equally unable to defeat him. Under such circumstances, with the Heaven’s Expanse Palace providing strong support, the Heaven’s Expanse Palace was undoubtedly ranked first amongst all the five Great Saint Lands. \n At this very moment, the Boundless Infinitum Set had once again made its appearance on the peak of the Heavenly Snow Mountain. Despite becoming Heavenly Gods, even Fen Tian and Huang Xingyun’s loftiness was restrained as a result - the Boundless Infinitum Set had greatly shocked them before. Even till this day, they still had not recovered from the psychological trauma caused by the Boundless Infinitum Set. \n There were no emotions detected in Shangguan Tianyang’s voice - it was so cold, as though he had poured ice cold water on Fen Tian and Huang Xingyun, “The Heavenly Spirits and Earthly Fiends Boundless Infinitum Formation, also known as the God-Slaying Demon-Exterminating Formation. So what if you’re Heavenly Gods? Brother Xue, leave it to the Heaven’s Expanse Palace to deal with Huang Xingyun and Fen Tian.”\n Xue AoTian glanced at Shangguan Tianyang. Even though they had no other choice but to join forces as a result of the present situation, as well as Zhou Weiqing’s sly mediation, it was not that easy for their years’ worth of rivalry and antagonism to be eradicated. Upon hearing what he said, Xue AoTian snorted and said, “Are you saying that only the Heaven’s Expanse Palace is capable of dealing with them? Do you think that the Heavenly Snow Mountain is not powerful enough?”\n As he spoke, Xue AoTian raised his right hand and waved it in the air. Immediately, a splendid ray of golden light erupted from his wrist; a rich golden light instantly illuminated the surroundings. A golden beam soared up to the sky - its overbearing power forcefully created a space within the Destruction Celestial Territory, shrouding every single person on the Heavenly Snow Mountain.\n Equipped with the ten-piece God Vanquishing Heavenly Spirit Set, a bright golden light appeared and the long slender God Spirit Staff landed in Xue AoTian’s hand. The intense divine aura immediately started spreading.\n Unlike the Heaven’s Expanse Palace, when Xue AoTian started making a move, all the Heavenly Snow Mountain powerhouses swiftly stepped forward and surrounded Xue AoTian, forming a ring. On the other hand, the Heaven’s Expanse Palace powerhouses took on a triangular formation, with the two Shangguan brothers in front. \n Huang Xingyun and Fen Tian did not take the opportunity to strike - they merely stared coldly at them. Before figuring out all of the Heaven’s Expanse Palace and the Heavenly Snow Mountain’s hidden trumps, they would remain calm. At least at the present moment, everything was still within their control. Similarly, they had not revealed their trump card. \n After fully equipping himself with the God Vanquishing Heavenly Spirit Set, its final color was purplish gold. Noble, divine and dignified. Xue AoTian was wearing a purplish golden headband with complicated patterns on it. It had a bright and dazzling golden oval gem in the middle of it. His body constantly emitted divine aura; it was his Heavenly Spirit Celestial Territory that broke open a portion of the Destruction Celestial Territory. What made it extremely strange was that the powerful Destruction Attribute within a strong and dense Destruction Celestial Territory as such actually could not counter against Xue AoTian’s Heavenly Spirit Celestial Territory.\n Similar to how the Blood Red Hell and the Passion Valley shared the Destruction Attribute, the Heavenly Mountain and the Heaven’s Expanse Palace also shared the Creation Attribute bestowed by the Saint Energy.\n Previously when Zhou Weiqing entered the Heaven’s Expanse Palace and defeated Shangguan Tianyue, which in turn won Shangguan Tianyang’s approval with regards to him marrying the three Shangguan sisters, he had already promised Shangguan Tianyang in secret that he would share the Saint Energy with the Heaven’s Expanse Palace. Of course, there was a limit pertaining to this arrangement. \n After that, when Zhou Weiqing allowed the three Shangguan sisters to return to the Heaven’s Expanse Palace to consolidate the Legendary Set, the preparations he made as a result from what he foresaw came in handy. \n Shangguan Fei’er and Shangguan Bing’er’s Legendary Sets were easy to consolidate, but Shangguan Xue’er’s Legendary Set was the Heaven’s Expanse Palace’s Boundless Infinitum Set, that was exclusive to the heirs of the Heaven’s Expanse Palace. Without a bargaining chip that was valuable enough, the old fox Shangguan Tianyang would never agree to his request. After all, the moment he had agreed to marry off the three Shangguan sisters to Zhou Weiqing, they were no longer considered to be members of the Heaven’s Expanse Palace. The fact that they had joined the Grand Tournament of Saint Lands as members of the Peerless Sect had attested to it. \n Naturally, the main reason why Zhou Weiqing had given the Saint Energy to the Heaven’s Expanse Palace was because he wanted to counter the Blood Red Hell’s Destruction Attribute. However at the same time, as a man, why would he be willing to watch his wives to feel aggrieved? Hence, he had used the Saint Energy to exchange for the three women’s Consolidated Equipment Sets, including the Boundless Infinitum Set.\n Shangguan Tianyang was very clear about the fact that the Boundless Infinitum Set was far inferior to the Saint Energy’s effects and transmissive nature. In the case of Heavenly Jewel Masters with a low cultivation base, at most the Saint Energy could only accumulate within their bodies, allowing them to temporarily possess powerful strength when they used it. However, once they had fully used it up, that was it. On the other hand, it was a completely different thing for cultivators who were at least of the Heavenly King Stage. \n Powerhouses who were at least of the Heavenly King Stage possessed the Heavenly Core Nucleus - they had the full ability to channel the Saint Energy into their Heavenly Core Nucleus, adding a portion of Creative Attribute within their Heavenly Core Nucleus. Hence, their resistance against the Destruction Attribute would be increased. Additionally, it was also greatly beneficial to their cultivation - especially for the powerhouses who had been stuck in a bottleneck for a long time.\n Hence, Shangguan Tianyang did not spend much time considering and readily accepted Zhou Weiqing’s offer, which was to get the three Shangguan sisters to channel their Saint Energy, which was not that pure in the first place, into the bodies of some of the Heaven’s Expanse Palace’s powerhouses, enhancing their power. Naturally, the people who benefited the most were Shangguan Tianyang and Shangguan Tianyue.\n This was also the reason why Shangguan Tianyang was not anxious in the face of the Destruction Celestial Territory - with a certain degree of Creation Attribute within their bodies, the Destruction Attribute did not pose that big of a threat to them compared to before. At least in terms of attributes, they were not as disadvantaged anymore. Of course, due to the purity of the Destruction Attribute within the Destruction Celestial Territory, it still had the absolute upper hand - except that they could no longer rely on the Destruction will to sustain the draining of the Heaven’s Expanse Palace powerhouses. \n It was even easier for the Heavenly Snow Mountain - Tian’er’s return was their saving grace. Furthermore, the purity of Tian’er’s Saint Energy was only second to Zhou Weiqing’s. Even though she was the only person with the Saint Energy, the benefits enjoyed by the Heavenly Snow Mountain powerhouses were still greater than that of the Heaven’s Expanse Palace’s. \n Hence, at this very moment, when Xue AoTian had raised his God Spirit Staff up high, releasing his Heavenly Spirit Celestial Territory, the Destruction Celestial Territory could not break it by force. The power displayed by Xue AoTian at this moment was no longer belonging to someone at the Mid Level Heavenly God Stage, but the High Level Heavenly God Stage. This was the power of the Creation Attribute.\n “For the honor of Wan Shou, the light that guards the Heavenly Snow Mountain, come on out, the Guardians of the Heavenly Snow Mountain.”\n Suddenly, the divine aura was strengthened. A ray of golden light descended from above the Heavenly Spirit Celestial Territory. It bombarded an area of the castle on the peak of the Heavenly Snow Mountain. Immediately after, deafening bellows that seemed neverending thundered through the air. \n The Heaven’s Expanse Palace possessed the Heavenly Dippers and Earthly Fiends Boundless Infinitum Formation; the Heavenly Snow Mountain had a much longer history compared to the Heaven’s Expanse Palace - how could it be possible that they did not have their own trump card as well? Additionally, this trump card of theirs had never been used in previous Grand Tournaments before. \n One by one, the enormous figures leapt into the air from where the Heavenly Snow Castle was located at. As the Heavenly Spirit Celestial Territory’s divine light shone on them, upon the emergence of each massive figure, a powerful wave of suppressive aura would appear. Additionally, each of them would shoot a strong golden beam into the Heavenly Spirit Celestial Territory, increasing the area covered by the Heavenly Spirit Celestial Territory.\n They were the enormous Heavenly Beasts that could only be found on the Heavenly Snow Mountain. After every single of them leapt into the sky, they had immediately flown towards the Heavenly Snow Mountain powerhouses, while every powerhouse would also leap into the sky, pairing up with their respective Heavenly Beast. In the blink of an eye, the twenty odd Heavenly Snow Mountain powerhouses had been paired up with their mounts, and all these Heavenly Beasts were at least of the Heavenly Emperor Stage. \n Even though in terms of power, the Heavenly Beasts that were above the Heavenly King Stage could not be compared to that of their Heavenly Jewel Master counterparts of the same level, the difference was not huge. However, it was everybody’s first time witnessing that many Heavenly Emperor Stage Heavenly Beasts appearing at the same time. It was a very spectacular sight. \n The joint aura unleashed by these twenty-plus Heavenly Emperor Stage Heavenly Beasts, coupled with Xue AoTian’s Heavenly Spirit Celestial Territory, had forcefully reduced the area controlled by the Destruction Celestial Territory by a lot. Even the purplish black light could no longer envelope the surrounding space. Albeit vaguely, rays of light shone down from above the Heavenly Spirit Celestial Territory. \n Apart from Fen Tian and Huang Xingyun, who were furrowing their brows hard, even their ally Shangguan Tianyang was extremely shocked at this moment. After all, in the previous Grand Tournaments, the Heavenly Snow Mountain had never released that many Heavenly Emperor Stage Heavenly Beasts before. Furthermore, there had never been such collaborations between a human and a Heavenly Beast. Even though previously the Heavenly Snow Mountain did not send as many powerhouses into the Grand Tournament and ultimately lost as a result, Shangguan Tianyang had always had a hunch that the Heavenly Snow Mountain still had a hidden trump that they did not use. Nonetheless, he did not expect it to be that powerful and solid.\n Every single Heavenly Snow Mountain powerhouse had his own Heavenly Emperor Stage mount, including the Lion King Gu SiTe as well as the Tiger King Xue AoYing. Furthermore, from the looks of it, it was clearly not their first time attempting such a collaboration. Once they had mounted their Heavenly Beast, their powers immediately merged, enhancing them. For example, the Tiger King and the Lion King immediately had their powers raised, almost reaching the Heavenly God Stage, after merging their powers with their Heavenly Beasts. \n Furthermore, this was not the end of it. The emergence of the Heavenly Beasts did not stop there - moments later, more than fifty Heavenly Beasts had appeared in succession on top of the Heavenly Snow Mountain. Additionally, they were all above the Heavenly King Stage. \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-28-chapter-295-1","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
