{"id":52073,"no":899,"title":"Chapter 306 - The Netherworld (3)","content":"The Lord of the Nether’s voice halted. The two eyes at the top of his head moved slightly; intense Destructive Energy instantly returned to his body in a frenzy. His voice had calmed down significantly as well.\n “From the looks of it, I will never be as treacherous as you human beings. Zhou Weiqing, you win once again. However, you’re not entirely right. It is not that I am not confident of killing the both of you, but rather, I am not confident of killing the both of you without making any sacrifices.\n “I have been sealed in this hellhole for way too many years. I don’t want to wait here, in this pitch-black space, for even another minute. Furthermore, I can’t deny the fact that both of your cultivation bases have reached a level that is able to threaten me. Right now, I do not have the power of a Heavenly Change powerhouse. Nonetheless, it is not a difficult feat for me to kill the both of you. In the worst case scenario, I simply have to sleep here for another hundred years.”\n Zhou Weiqing snorted, “A hundred years? I think it’s more than that. If you’ve exhausted too much of your energy, how are you going to create a small crack in the seal of the Netherworld, and secretly absorb the negative energy from the external world? If you can’t even achieve that, all you can do is perish here by yourself. This is what you’re most worried about, hence you did not dare to attack us at full force. Am I right?”\n “You……bastard.” The Lord of the Nether was furious. He never expected Zhou Weiqing to be so much more treacherous and witty compared to him. He assumed that he had already concealed his plans and thoughts very well, and yet Zhou Weiqing was still able to see through everything. At this moment, he was left with no other choice.\n Distorted pitch-black Destructive Energy rippled appeared on the Lord of the Nether’s massive body. It could be clearly seen that its entire body had begun to squirm violently.\n Zhou Weiqing hovered there, not budging a single bit. All the starlight on the ‘Hate Ground no Handle’ Set on his body lit up thereafter. Under the dazzling light, a dragon-shaped light image started moving as well, revolving around his body.\n The faint light roamed around in the air. Zhou Weiqing’s eyes were constantly fixated in the direction of where the Lord of the Nether was, without looking away - not even for a second. His other hand held tightly onto Tian’er’s hand; their Saint Energy continuously remained connected with one another.\n After all, the Netherworld belonged to the Lord of the Nether and it was his sphere of influence. It could be said that it was equivalent to his very own Celestial Territory. Zhou Weiqing was worried that if he and Tian’er were no longer connected, they would be killed off by the Lord of the Nether.\n The black light gradually dwindled. All of a sudden, the Lord of the Nether’s massive body started to become illusory. During the process, his body shrunk rapidly. Everything seemed to have become unrealistic.\n Zhou Weiqing’s left hand held onto Tian’er, and the Dual Legendary Hammer his right hand moved slightly forward. A seemingly solidified whitish golden light shot out in the direction of the Lord of the Nether.\n After a hum was heard, the Netherworld trembled slightly. Immediately after, the whitish golden light vanished into thin air. It did not even fly farther than twenty meters, let alone attack the Lord of the Nether’s body.\n The distorted light gradually retracted; the enormous body of the crab in mid-air had disappeared as well. A figure, that was almost of the same height as Zhou Weiqing, had quietly appeared in the center of the spot, where the massive body of the Lord of the Nether was located at earlier on.\n It was an image of what seemed to be a human, approximately two meters in height with broad shoulders. Its entire body was equipped with a dark green armor. It had eight wing-like long legs on its back that were spread wide open, as seen originally on Fen Tian. The sparkling dark green eyes on that handsome face, that was filled with a cold and gloomy aura, were fixated on Zhou Weiqing.\n His body armor did not include a helmet; he had a huge bald head. However, the dark green light in his eyes was too intense. The Destructive Energy around his body was at its strongest. Zhou Weiqing could clearly sense that this human-like body was completely condensed from the original Destructive Energy.\n “Don’t you find it strange that I had chosen to take on the human form to fight our last battle? That is because I feel that the human form is the most suitable for battles. Now, it’s time for the both of you to die.”\n After finishing his sentence, the Lord of the Nether made the first move. His body flashed and the entire Netherworld suddenly turned into a serene shade of green, after which his body vanished into thin air.\n It’s here. Zhou Weiqing’s heart tightened for a bit. Without any hesitation, he swung the Dual Legendary Hammer in his hand. His attack did not directly hit his target. Instead, it struck the air within the Netherworld.\n A huge rumbling sound was heard. The Netherworld shook violently. The Dual Legendary Hammer in Zhou Weiqing’s hand emitted an intense distorted whitish golden light.\n Within the Netherworld that was filled with Destructive Energy, he had forcefully created a black hole that was three meters in diameter. As a result of this tiny black hole, the entire Netherworld underwent mutations at a rapid speed.\n Never underestimate this attack of Zhou Weiqing’s. It was the result of the combination of the Spatial Law, Time Law and his unparalleled power, that even the Lord of the Nether was threatened by.\n A buzz was heard and the Lord of the Nether’s body appeared behind Zhou Weiqing and Tian’er, on the right. He was less than ten meters away from Zhou Weiqing. If Zhou Weiqing was slightly slower, the Lord of the Nether’s attack would have hit him.\n At this moment, Zhou Weiqing’s eyes lit up; a dazzling whitish golden light flickered in his eyes. Terrifying energy ripples exuded a tyrannical aura. Without turning around, his right leg kicked backwards. The distorted whitish golden light from his leg headed towards in the direction of the Lord of the Nether, attacking him.\n As he kicked his right leg, a ball of white incandescent light erupted from his right leg before transforming into a condensed solidified electrical light that shot out.\n At this same time, Zhou Weiqing grabbed Tian’er’s body and flung her outwards.\n The both of them had been cultivating together for such a long period of time, to the point they were able to read each other’s minds. Zhou Weiqing did not have the need to spell things out, as Tian’er automatically knew what she needed to do. A chain of Saint Energy wrapped around Zhou Weiqing’s waist and connected their bodies, after which, Tian’er flew ten meters backwards. In that way she would not affect Zhou Weiqing’s close combat, while assisting him from the side.\n Zhou Weiqing kicked his right leg, his body spiraled and the Dual Legendary Hammer struck in the direction of the Lord of the Nether with its terrifying power.\n Looking at the white incandescent light ball that came from Zhou Weiqing’s right leg, the Lord of the Nether was stunned. He did not expect Zhou Weiqing to be able to release a pure Saint Energy as such without the help of the Divine Beasts.\n He was unaware about the fact that as Zhou Weiqing was maintaining the formation, he had a completely new understanding of Saint Energy. Even though he did not have the help of the Divine beasts, the combined Saint Energy from him and Tian’er was similarly able to purify it.\n At this very moment, Zhou Weiqing had completely disregarded life and death, When he had arrived in the Netherworld, he did not expect himself to walk out of it alive. All he wanted to do right now was to weaken the Lord of the Nether to the best of his abilities, and if possible, injure him to the point where he would be unable to recover forever. Only in that way, the completed seal, that was led by him earlier, would not go to waste. Zhou Weiqing also believed that what the Lord of the Nether had mentioned earlier was possible. However, the powerhouses led by the Sidhe Empress would similarly think of a way to continue maintaining the formation. Even though they did not have a pure Saint Energy, they still had a semi-pure Saint Energy. With the cultivation base of the Lord of the Nether being weakened to its current state, coupled with the fact that it could not be restored, it was easier said than done for him to break through the seal. In his current battle against the Lord of the Nether, every time his original Destructive Energy got depleted, Zhou Weiqing was one step closer to destroying the Lord of the Nether.\n After being resolute in his decision, why would Zhou Weiqing be gutless when facing the Lord of the Nether head-on?\n The Lord of the Nether did not have any weapons in his hands. Looking at the white incandescent light ball attacking towards his direction, he extended his right hand at a lightning-fast speed, and caught the white incandescent light ball.\n As a hissing sound was made, the white incandescent light ball was forcefully extinguished. However, in the moment when the light ball was being destroyed, an explosion sound was heard coming from the Lord of the Nether’s hand. It had exploded, causing his body to shake.\n Immediately after, Zhou Weiqing’s hammer had reached him. The eight long legs on the Lord of the Nether’s back moved forward in a bid to block his attack. At the same time, it collided with the gigantic hammer, causing a ‘ding’ sound. Terrifying energy ripples erupted in an instant. Zhou Weiqing was astonished when he discovered that he was unable to use the strength and power that he possessed. The Lord of the Nether’s power was exerted in all directions; tyrannical Destructive Energy forcefully pierced his Dual Legendary Hammer like eight needles. In an instant, the majority of its power was being neutralized, creating a soft ‘bang’. Zhou Weiqing had no choice but to retreat dozens of meters backwards.\n At the same time, a layer of distorted light appeared in front of Zhou Weiqing, blocking the eight streaks of Destructive Energy that were shot from the eight legs. The moment the Destructive Energy came into contact with the layer of distorted light, they immediately dispersed in all directions. None of them had landed on Zhou Weiqing’s body. It was none other than the Time Disorder Skill that was being used.\n The earlier explosion of the Lord of the Nether’s hand was caused by the light ball that was kicked out of Zhou Weiqing’s right leg, which contained the Dark Demon God Lightning’s Saint Energy. The explosion was caused by the merging of the three different types of Saint Energy. If the Lord of the Nether had fallen for the ruse, he would suffer some damage.\n The brief collision and contact gave Zhou Weiqing the chills. The cultivation base currently displayed by the Lord of the Nether was still much more powerful than that of Fen Tian’s. Even though it was not at the Heavenly Change Stage, the level of the original Destructive Energy’s purity had far surpassed that of his Saint Energy’s. It was almost impossible for him to defeat the Lord of the Nether.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-28-chapter-306-3","bookId":1503,"book":{"id":1503,"title":"Heavenly Jewel Change","description":"[Zen’s Synopsis]\n In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father’s tarnished pride… his fianceé’s ultimate dishonour…\n Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or… is it truly a gift?\n Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!\n An all new world, an all new power system, unique weaponry \u0026 MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!\n [Translated Synopsis]\n Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n Our MC here is an archer who has such a pair of Heavenly Jewels.\n","cover":"http://cunovel.com/img/HJC.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/heavenly-jewel-change","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:14 AM"}}
