{"id":34522,"no":20,"title":"CHAPTER XIX.","content":"THEY FIGHT THE SERAPIS. The battle between the Bon Homme Richard and the Serapis stands in history as the first signal collision on the sea between the Englishman and the American. For obstinacy, mutual hatred, and courage, it is without precedent or subsequent in the story of ocean. The strife long hung undetermined, but the English flag struck in the end. There would seem to be something singularly indicatory in this engagement. It may involve at once a type, a parallel, and a prophecy. Sharing the same blood with England, and yet her proved foe in two wars—not wholly inclined at bottom to forget an old grudge—intrepid, unprincipled, reckless, predatory, with boundless ambition, civilized in externals but a savage at heart, America is, or may yet be, the Paul Jones of nations. Regarded in this indicatory light, the battle between the Bon Homme Richard and the Serapis—in itself so curious—may well enlist our interest. Never was there a fight so snarled. The intricacy of those incidents which defy the narrator\u0027s extrication, is not illy figured in that bewildering intertanglement of all the yards and anchors of the two ships, which confounded them for the time in one chaos of devastation. Elsewhere than here the reader must go who seeks an elaborate version of the fight, or, indeed, much of any regular account of it whatever. The writer is but brought to mention the battle because he must needs follow, in all events, the fortunes of the humble adventurer whose life lie records. Yet this necessarily involves some general view of each conspicuous incident in which he shares. Several circumstances of the place and time served to invest the fight with a certain scenic atmosphere casting a light almost poetic over the wild gloom of its tragic results. The battle was fought between the hours of seven and ten at night; the height of it was under a full harvest moon, in view of thousands of distant spectators crowning the high cliffs of Yorkshire. From the Tees to the Humber, the eastern coast of Britain, for the most part, wears a savage, melancholy, and Calabrian aspect. It is in course of incessant decay. Every year the isle which repulses nearly all other foes, succumbs to the Attila assaults of the deep. Here and there the base of the cliffs is strewn with masses of rock, undermined by the waves, and tumbled headlong below, where, sometimes, the water completely surrounds them, showing in shattered confusion detached rocks, pyramids, and obelisks, rising half-revealed from the surf—the Tadmores of the wasteful desert of the sea. Nowhere is this desolation more marked than for those fifty miles of coast between Flamborough Head and the Spurm. Weathering out the gale which had driven them from Leith, Paul\u0027s ships for a few days were employed in giving chase to various merchantmen and colliers; capturing some, sinking others, and putting the rest to flight. Off the mouth of the Humber they ineffectually manoeuvred with a view of drawing out a king\u0027s frigate, reported to be lying at anchor within. At another time a large fleet was encountered, under convoy of some ships of force. But their panic caused the fleet to hug the edge of perilous shoals very nigh the land, where, by reason of his having no competent pilot, Paul durst not approach to molest them. The same night he saw two strangers further out at sea, and chased them until three in the morning, when, getting pretty nigh, he surmised that they must needs be vessels of his own squadron, which, previous to his entering the Firth of Forth, had separated from his command. Daylight proved this supposition correct. Five vessels of the original squadron were now once more in company. About noon a fleet of forty merchantmen appeared coming round Flamborough Head, protected by two English man-of-war, the Serapis and Countess of Scarborough. Descrying the five cruisers sailing down, the forty sail, like forty chickens, fluttered in a panic under the wing of the shore. Their armed protectors bravely steered from the land, making the disposition for battle. Promptly accepting the challenge, Paul, giving the signal to his consorts, earnestly pressed forward. But, earnest as he was, it was seven in the evening ere the encounter began. Meantime his comrades, heedless of his signals, sailed independently along. Dismissing them from present consideration, we confine ourselves, for a while, to the Richard and the Serapis, the grand duellists of the fight. The Richard carried a motley, crew, to keep whom in order one hundred and thirty-five soldiers—themselves a hybrid band—had been put on board, commanded by French officers of inferior rank. Her armament was similarly heterogeneous; guns of all sorts and calibres; but about equal on the whole to those of a thirty-two-gun frigate. The spirit of baneful intermixture pervaded this craft throughout. The Serapis was a frigate of fifty guns, more than half of which individually exceeded in calibre any one gun of the Richard. She had a crew of some three hundred and twenty trained man-of-war\u0027s men. There is something in a naval engagement which radically distinguishes it from one on the land. The ocean, at times, has what is called its sea and its trough of the sea; but it has neither rivers, woods, banks, towns, nor mountains. In mild weather it is one hammered plain. Stratagems, like those of disciplined armies—ambuscades, like those of Indians, are impossible. All is clear, open, fluent. The very element which sustains the combatants, yields at the stroke of a feather. One wind and one tide at one time operate upon all who here engage. This simplicity renders a battle between two men-of-war, with their huge white wings, more akin to the Miltonic contests of archangels than to the comparatively squalid tussles of earth. As the ships neared, a hazy darkness overspread the water. The moon was not yet risen. Objects were perceived with difficulty. Borne by a soft moist breeze over gentle waves, they came within pistol- shot. Owing to the obscurity, and the known neighborhood of other vessels, the Serapis was uncertain who the Richard was. Through the dim mist each ship loomed forth to the other vast, but indistinct, as the ghost of Morven. Sounds of the trampling of resolute men echoed from either hull, whose tight decks dully resounded like drum-heads in a funeral march. The Serapis hailed. She was answered by a broadside. For half an hour the combatants deliberately manoeuvred, continually changing their position, but always within shot fire. The. Serapis—the better sailer of the two—kept critically circling the Richard, making lounging advances now and then, and as suddenly steering off; hate causing her to act not unlike a wheeling cock about a hen, when stirred by the contrary passion. Meantime, though within easy speaking distance, no further syllable was exchanged; but an incessant cannonade was kept up. At this point, a third party, the Scarborough, drew near, seemingly desirous of giving assistance to her consort. But thick smoke was now added to the night\u0027s natural obscurity. The Scarborough imperfectly discerned two ships, and plainly saw the common fire they made; but which was which, she could not tell. Eager to befriend the Serapis, she durst not fire a gun, lest she might unwittingly act the part of a foe. As when a hawk and a crow are clawing and beaking high in the air, a second crow flying near, will seek to join the battle, but finding no fair chance to engage, at last flies away to the woods; just so did the Scarborough now. Prudence dictated the step; because several chance shot—from which of the combatants could not be known—had already struck the Scarborough. So, unwilling uselessly to expose herself, off went for the present this baffled and ineffectual friend. Not long after, an invisible hand came and set down a great yellow lamp in the east. The hand reached up unseen from below the horizon, and set the lamp down right on the rim of the horizon, as on a threshold; as much as to say, Gentlemen warriors, permit me a little to light up this rather gloomy looking subject. The lamp was the round harvest moon; the one solitary foot-light of the scene. But scarcely did the rays from the lamp pierce that languid haze. Objects before perceived with difficulty, now glimmered ambiguously. Bedded in strange vapors, the great foot-light cast a dubious, half demoniac glare across the waters, like the phantasmagoric stream sent athwart a London flagging in a night-rain from an apothecary\u0027s blue and green window. Through this sardonical mist, the face of the Man-in-the-Moon—looking right towards the combatants, as if he were standing in a trap-door of the sea, leaning forward leisurely with his arms complacently folded over upon the edge of the horizon—this queer face wore a serious, apishly self-satisfied leer, as if the Man-in-the-Moon had somehow secretly put up the ships to their contest, and in the depths of his malignant old soul was not unpleased to see how well his charms worked. There stood the grinning Man-in-the-Moon, his head just dodging into view over the rim of the sea:—Mephistopheles prompter of the stage. Aided now a little by the planet, one of the consorts of the Richard, the Pallas, hovering far outside the fight, dimly discerned the suspicious form of a lonely vessel unknown to her. She resolved to engage it, if it proved a foe. But ere they joined, the unknown ship—which proved to be the Scarborough—received a broadside at long gun\u0027s distance from another consort of the Richard the Alliance. The shot whizzed across the broad interval like shuttlecocks across a great hall. Presently the battledores of both batteries were at work, and rapid compliments of shuttlecocks were very promptly exchanged. The adverse consorts of the two main belligerents fought with all the rage of those fiery seconds who in some desperate duels make their principal\u0027s quarrel their own. Diverted from the Richard and the Serapis by this little by-play, the Man-in-the-Moon, all eager to see what it was, somewhat raised himself from his trap-door with an added grin on his face. By this time, off sneaked the Alliance, and down swept the Pallas, at close quarters engaging the Scarborough; an encounter destined in less than an hour to end in the latter ship\u0027s striking her flag. Compared to the Serapis and the Richard, the Pallas and the Scarborough were as two pages to two knights. In their immature way they showed the same traits as their fully developed superiors. The Man-in-the-Moon now raised himself still higher to obtain a better view of affairs. But the Man-in-the-Moon was not the only spectator. From the high cliffs of the shore, and especially from the great promontory of Flamborough Head, the scene was witnessed by crowds of the islanders. Any rustic might be pardoned his curiosity in view of the spectacle, presented. Far in the indistinct distance fleets of frightened merchantmen filled the lower air with their sails, as flakes of snow in a snow-storm by night. Hovering undeterminedly, in another direction, were several of the scattered consorts of Paul, taking no part in the fray. Nearer, was an isolated mist, investing the Pallas and Scarborough—a mist slowly adrift on the sea, like a floating isle, and at intervals irradiated with sparkles of fire and resonant with the boom of cannon. Further away, in the deeper water, was a lurid cloud, incessantly torn in shreds of lightning, then fusing together again, once more to be rent. As yet this lurid cloud was neither stationary nor slowly adrift, like the first-mentioned one; but, instinct with chaotic vitality, shifted hither and thither, foaming with fire, like a valiant water-spout careering off the coast of Malabar. To get some idea of the events enacting in that cloud, it will be necessary to enter it; to go and possess it, as a ghost may rush into a body, or the devils into the swine, which running down the steep place perished in the sea; just as the Richard is yet to do. Thus far the Serapis and the Richard had been manoeuvring and chasing to each other like partners in a cotillion, all the time indulging in rapid repartee. But finding at last that the superior managableness of the enemy\u0027s ship enabled him to get the better of the clumsy old Indiaman, the Richard, in taking position, Paul, with his wonted resolution, at once sought to neutralize this, by hugging him close. But the attempt to lay the Richard right across the head of the Serapis ended quite otherwise, in sending the enemy\u0027s jib-boom just over the Richard\u0027s great tower of Pisa, where Israel was stationed; who, catching it eagerly, stood for an instant holding to the slack of the sail, like one grasping a horse by the mane prior to vaulting into the saddle. \"Aye, hold hard, lad,\" cried Paul, springing to his side with a coil of rigging. With a few rapid turns he knitted himself to his foe. The wind now acting on the sails of the Serapis forced her, heel and point, her entire length, cheek by jowl, alongside the Richard. The projecting cannon scraped; the yards interlocked; but the hulls did not touch. A long lane of darkling water lay wedged between, like that narrow canal in Venice which dozes between two shadowy piles, and high in air is secretly crossed by the Bridge of Sighs. But where the six yard-arms reciprocally arched overhead, three bridges of sighs were both seen and heard, as the moon and wind kept rising. Into that Lethean canal—pond-like in its smoothness as compared with the sea without—fell many a poor soul that night; fell, forever forgotten. As some heaving rent coinciding with a disputed frontier on a volcanic plain, that boundary abyss was the jaws of death to both sides. So contracted was it, that in many cases the gun-rammers had to be thrust into the opposite ports, in order to enter to muzzles of their own cannon. It seemed more an intestine feud, than a fight between strangers. Or, rather, it was as if the Siamese Twins, oblivious of their fraternal bond, should rage in unnatural fight. Ere long, a horrible explosion was heard, drowning for the instant the cannonade. Two of the old eighteen-pounders—before spoken of, as having been hurriedly set up below the main deck of the Richard—burst all to pieces, killing the sailors who worked them, and shattering all that part of the hull, as if two exploded steam-boilers had shot out of its opposite sides. The effect was like the fall of the walls of a house. Little now upheld the great tower of Pisa but a few naked crow stanchions. Thenceforth, not a few balls from the Serapis must have passed straight through the Richard without grazing her. It was like firing buck-shot through the ribs of a skeleton. But, further forward, so deadly was the broadside from the heavy batteries of the Serapis—levelled point-blank, and right down the throat and bowels, as it were, of the Richard—that it cleared everything before it. The men on the Richard\u0027s covered gun-deck ran above, like miners from the fire-damp. Collecting on the forecastle, they continued to fight with grenades and muskets. The soldiers also were in the lofty tops, whence they kept up incessant volleys, cascading their fire down as pouring lava from cliffs. The position of the men in the two ships was now exactly reversed. For while the Serapis was tearing the Richard all to pieces below deck, and had swept that covered part almost of the last man, the Richard\u0027s crowd of musketry had complete control of the upper deck of the Serapis, where it was almost impossible for man to remain unless as a corpse. Though in the beginning, the tops of the Serapis had not been unsupplied with marksmen, yet they had long since been cleared by the overmastering musketry of the Richard. Several, with leg or arm broken by a ball, had been seen going dimly downward from their giddy perch, like falling pigeons shot on the wing. As busy swallows about barn-eaves and ridge-poles, some of the Richard\u0027s marksmen, quitting their tops, now went far out on their yard-arms, where they overhung the Serapis. From thence they dropped hand-grenades upon her decks, like apples, which growing in one field fall over the fence into another. Others of their band flung the same sour fruit into the open ports of the Serapis. A hail-storm of aerial combustion descended and slanted on the Serapis, while horizontal thunderbolts rolled crosswise through the subterranean vaults of the Richard. The belligerents were no longer, in the ordinary sense of things, an English ship and an American ship. It was a co-partnership and joint-stock combustion-company of both ships; yet divided, even in participation. The two vessels were as two houses, through whose party-wall doors have been cut; one family (the Guelphs) occupying the whole lower story; another family (the Ghibelines) the whole upper story. Meanwhile, determined Paul flew hither and thither like the meteoric corposant-ball, which shiftingly dances on the tips and verges of ships\u0027 rigging in storms. Wherever he went, he seemed to cast a pale light on all faces. Blacked and burnt, his Scotch bonnet was compressed to a gun-wad on his head. His Parisian coat, with its gold-laced sleeve laid aside, disclosed to the full the blue tattooing on his arm, which sometimes in fierce gestures streamed in the haze of the cannonade, cabalistically terrific as the charmed standard of Satan. Yet his frenzied manner was less a testimony of his internal commotion than intended to inspirit and madden his men, some of whom seeing him, in transports of intrepidity stripped themselves to their trowsers, exposing their naked bodies to the as naked shot The same was done on the Serapis, where several guns were seen surrounded by their buff crews as by fauns and satyrs. At the beginning of the fray, before the ships interlocked, in the intervals of smoke which swept over the ships as mist over mountain-tops, affording open rents here and there—the gun-deck of the Serapis, at certain points, showed, congealed for the instant in all attitudes of dauntlessness, a gallery of marble statues—fighting gladiators. Stooping low and intent, with one braced leg thrust behind, and one arm thrust forward, curling round towards the muzzle of the gun, there was seen the loader, performing his allotted part; on the other side of the carriage, in the same stooping posture, but with both hands holding his long black pole, pike-wise, ready for instant use—stood the eager rammer and sponger; while at the breech, crouched the wary captain of the gun, his keen eye, like the watching leopard\u0027s, burning along the range; and behind all, tall and erect, the Egyptian symbol of death, stood the matchman, immovable for the moment, his long-handled match reversed. Up to their two long death-dealing batteries, the trained men of the Serapis stood and toiled in mechanical magic of discipline. They tended those rows of guns, as Lowell girls the rows of looms in a cotton factory. The Parcae were not more methodical; Atropos not more fatal; the automaton chess-player not more irresponsible. \"Look, lad; I want a grenade, now, thrown down their main hatchway. I saw long piles of cartridges there. The powder monkeys have brought them up faster than they can be used. Take a bucket of combustibles, and let\u0027s hear from you presently.\" These words were spoken by Paul to Israel. Israel did as ordered. In a few minutes, bucket in hand, begrimed with powder, sixty feet in air, he hung like Apollyon from the extreme tip of the yard over the fated abyss of the hatchway. As he looked down between the eddies of smoke into that slaughterous pit, it was like looking from the verge of a cataract down into the yeasty pool at its base. Watching, his chance, he dropped one grenade with such faultless precision, that, striking its mark, an explosion rent the Serapis like a volcano. The long row of heaped cartridges was ignited. The fire ran horizontally, like an express on a railway. More than twenty men were instantly killed: nearly forty wounded. This blow restored the chances of battle, before in favor of the Serapis. But the drooping spirits of the English were suddenly revived, by an event which crowned the scene by an act on the part of one of the consorts of the Richard, the incredible atrocity of which has induced all humane minds to impute it rather to some incomprehensible mistake than to the malignant madness of the perpetrator. The cautious approach and retreat of a consort of the Serapis, the Scarborough, before the moon rose, has already been mentioned. It is now to be related how that, when the moon was more than an hour high, a consort of the Richard, the Alliance, likewise approached and retreated. This ship, commanded by a Frenchman, infamous in his own navy, and obnoxious in the service to which he at present belonged; this ship, foremost in insurgency to Paul hitherto, and which, for the most part, had crept like a poltroon from the fray; the Alliance now was at hand. Seeing her, Paul deemed the battle at an end. But to his horror, the Alliance threw a broadside full into the stern of the Richard, without touching the Serapis. Paul called to her, for God\u0027s sake to forbear destroying the Richard. The reply was, a second, a third, a fourth broadside, striking the Richard ahead, astern, and amidships. One of the volleys killed several men and one officer. Meantime, like carpenters\u0027 augers, and the sea-worm called Remora, the guns of the Serapis were drilling away at the same doomed hull. After performing her nameless exploit, the Alliance sailed away, and did no more. She was like the great fire of London, breaking out on the heel of the great Plague. By this time, the Richard had so many shot-holes low down in her hull, that like a sieve she began to settle. \"Do you strike?\" cried the English captain. \"I have not yet begun to fight,\" howled sinking Paul. This summons and response were whirled on eddies of smoke and flame. Both vessels were now on fire. The men of either knew hardly which to do; strive to destroy the enemy, or save themselves. In the midst of this, one hundred human beings, hitherto invisible strangers, were suddenly added to the rest. Five score English prisoners, till now confined in the Richard\u0027s hold, liberated in his consternation by the master at arms, burst up the hatchways. One of them, the captain of a letter of marque, captured by Paul, off the Scottish coast, crawled through a port, as a burglar through a window, from the one ship to the other, and reported affairs to the English captain. While Paul and his lieutenants were confronting these prisoners, the gunner, running up from below, and not perceiving his official superiors, and deeming them dead, believing himself now left sole surviving officer, ran to the tower of Pisa to haul down the colors. But they were already shot down and trailing in the water astern, like a sailor\u0027s towing shirt. Seeing the gunner there, groping about in the smoke, Israel asked what he wanted. At this moment the gunner, rushing to the rail, shouted \"Quarter! quarter!\" to the Serapis. \"I\u0027ll quarter ye,\" yelled Israel, smiting the gunner with the flat of his cutlass. \"Do you strike?\" now came from the Serapis. \"Aye, aye, aye!\" involuntarily cried Israel, fetching the gunner a shower of blows. \"Do you strike?\" again was repeated from the Serapis; whose captain, judging from the augmented confusion on board the Richard, owing to the escape of the prisoners, and also influenced by the report made to him by his late guest of the port-hole, doubted not that the enemy must needs be about surrendering. \"Do you strike?\" \"Aye!—I strike back\" roared Paul, for the first time now hearing the summons. But judging this frantic response to come, like the others, from some unauthorized source, the English captain directed his boarders to be called, some of whom presently leaped on the Richard\u0027s rail, but, throwing out his tattooed arm at them, with a sabre at the end of it, Paul showed them how boarders repelled boarders. The English retreated, but not before they had been thinned out again, like spring radishes, by the unfaltering fire from the Richard\u0027s tops. An officer of the Richard, seeing the mass of prisoners delirious with sudden liberty and fright, pricked them with his sword to the pumps, thus keeping the ship afloat by the very blunder which had promised to have been fatal. The vessels now blazed so in the rigging that both parties desisted from hostilities to subdue the common foe. When some faint order was again restored upon the Richard her chances of victory increased, while those of the English, driven under cover, proportionably waned. Early in the contest, Paul, with his own hand, had brought one of his largest guns to bear against the enemy\u0027s mainmast. That shot had hit. The mast now plainly tottered. Nevertheless, it seemed as if, in this fight, neither party could be victor. Mutual obliteration from the face of the waters seemed the only natural sequel to hostilities like these. It is, therefore, honor to him as a man, and not reproach to him as an officer, that, to stay such carnage, Captain Pearson, of the Serapis, with his own hands hauled down his colors. But just as an officer from the Richard swung himself on board the Serapis, and accosted the English captain, the first lieutenant of the Serapis came up from below inquiring whether the Richard had struck, since her fire had ceased. So equal was the conflict that, even after the surrender, it could be, and was, a question to one of the warriors engaged (who had not happened to see the English flag hauled down) whether the Serapis had struck to the Richard, or the Richard to the Serapis. Nay, while the Richard\u0027s officer was still amicably conversing with the English captain, a midshipman of the Richard, in act of following his superior on board the surrendered vessel, was run through the thigh by a pike in the hand of an ignorant boarder of the Serapis. While, equally ignorant, the cannons below deck were still thundering away at the nominal conqueror from the batteries of the nominally conquered ship. But though the Serapis had submitted, there were two misanthropical foes on board the Richard which would not so easily succumb—fire and water. All night the victors were engaged in suppressing the flames. Not until daylight were the flames got under; but though the pumps were kept continually going, the water in the hold still gained. A few hours after sunrise the Richard was deserted for the Serapis and the other vessels of the squadron of Paul. About ten o\u0027clock the Richard, gorged with slaughter, wallowed heavily, gave a long roll, and blasted by tornadoes of sulphur, slowly sunk, like Gomorrah, out of sight. The loss of life in the two ships was about equal; one-half of the total number of those engaged being either killed or wounded. In view of this battle one may ask—What separates the enlightened man from the savage? Is civilization a thing distinct, or is it an advanced stage of barbarism? \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2836/78417.html","bookId":1225,"book":{"id":1225,"title":"Israel Potter","description":"简介： Biography, in its purer form, confined to the ended lives of the true and brave, may be held the fairest meed of human virtueone given and received in entire disinterestednesssince neither can the biographer hope for acknowledgment from the subject,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2836","creation":"Aug 1, 2019 12:24:39 AM","modification":"Aug 1, 2019 12:24:39 AM"}}
