{"id":34530,"no":28,"title":"CHAPTER XXVII.","content":"REQUIESCAT IN PACE. It happened that the ship, gaining her port, was moored to the dock on a Fourth of July; and half an hour after landing, hustled by the riotous crowd near Faneuil Hall, the old man narrowly escaped being run over by a patriotic triumphal car in the procession, flying a broidered banner, inscribed with gilt letters: \"BUNKER-HILL 1775. GLORY TO THE HEROES THAT FOUGHT!\" It was on Copps\u0027 Hill, within the city bounds, one of the enemy\u0027s positions during the fight, that our wanderer found his best repose that day. Sitting down here on a mound in the graveyard, he looked off across Charles River towards the battle-ground, whose incipient monument, at that period, was hard to see, as a struggling sprig of corn in a chilly spring. Upon those heights, fifty years before, his now feeble hands had wielded both ends of the musket. There too he had received that slit upon the chest, which afterwards, in the affair with the Serapis, being traversed by a cutlass wound, made him now the bescarred bearer of a cross. For a long time he sat mute, gazing blankly about him. The sultry July day was waning. His son sought to cheer him a little ere rising to return to the lodging for the present assigned them by the ship-captain. \"Nay,\" replied the old man, \"I shall get no fitter rest than here by the mounds.\" But from this true \"Potter\u0027s Field,\" the boy at length drew him away; and encouraged next morning by a voluntary purse made up among the reassembled passengers, father and son started by stage for the country of the Housatonie. But the exile\u0027s presence in these old mountain townships proved less a return than a resurrection. At first, none knew him, nor could recall having heard of him. Ere long it was found, that more than thirty years previous, the last known survivor of his family in that region, a bachelor, following the example of three-fourths of his neighbors, had sold out and removed to a distant country in the west; where exactly, none could say. He sought to get a glimpse of his father\u0027s homestead. But it had been burnt down long ago. Accompanied by his son, dim-eyed and dim-hearted, he next went to find the site. But the roads had years before been changed. The old road was now browsed over by sheep; the new one ran straight through what had formerly been orchards. But new orchards, planted from other suckers, and in time grafted, throve on sunny slopes near by, where blackberries had once been picked by the bushel. At length he came to a field waving with buckwheat. It seemed one of those fields which himself had often reaped. But it turned out, upon inquiry, that but three summers since a walnut grove had stood there. Then he vaguely remembered that his father had sometimes talked of planting such a grove, to defend the neighboring fields against the cold north wind; yet where precisely that grove was to have been, his shattered mind could not recall. But it seemed not unlikely that during his long exile, the walnut grove had been planted and harvested, as well as the annual crops preceding and succeeding it, on the very same soil. Ere long, on the mountain side, he passed into an ancient natural wood, which seemed some way familiar, and midway in it, paused to contemplate a strange, mouldy pile, resting at one end against a sturdy beech. Though wherever touched by his staff, however lightly, this pile would crumble, yet here and there, even in powder, it preserved the exact look, each irregularly defined line, of what it had originally been—namely, a half-cord of stout hemlock (one of the woods least affected by exposure to the air), in a foregoing generation chopped and stacked up on the spot, against sledging-time, but, as sometimes happens in such cases, by subsequent oversight, abandoned to oblivious decay—type now, as it stood there, of forever arrested intentions, and a long life still rotting in early mishap. \"Do I dream?\" mused the bewildered old man, \"or what is this vision that comes to me of a cold, cloudy morning, long, long ago, and I heaving yon elbowed log against the beech, then a sapling? Nay, nay, I cannot be so old.\" \"Come away, father, from this dismal, damp wood,\" said his son, and led him forth. Blindly ranging to and fro, they next saw a man ploughing. Advancing slowly, the wanderer met him by a little heap of ruinous burnt masonry, like a tumbled chimney, what seemed the jams of the fire- place, now aridly stuck over here and there, with thin, clinging, round, prohibitory mosses, like executors\u0027 wafers. Just as the oxen were bid stand, the stranger\u0027s plough was hitched over sideways, by sudden contact with some sunken stone at the ruin\u0027s base. \"There, this is the twentieth year my plough has struck this old hearthstone. Ah, old man,—sultry day, this.\" \"Whose house stood here, friend?\" said the wanderer, touching the half-buried hearth with his staff, where a fresh furrow overlapped it. \"Don\u0027t know; forget the name; gone West, though, I believe. You know \u0027em?\" But the wanderer made no response; his eye was now fixed on a curious natural bend or wave in one of the bemossed stone jambs. \"What are you looking at so, father?\" \"\u0027Father!\u0027 Here,\" raking with his staff, \"my father would sit, and here, my mother, and here I, little infant, would totter between, even as now, once again, on the very same spot, but in the unroofed air, I do. The ends meet. Plough away, friend.\" Best followed now is this life, by hurrying, like itself, to a close. Few things remain. He was repulsed in efforts after a pension by certain caprices of law. His scars proved his only medals. He dictated a little book, the record of his fortunes. But long ago it faded out of print— himself out of being—his name out of memory. He died the same day that the oldest oak on his native hills was blown down. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2836/78425.html","bookId":1225,"book":{"id":1225,"title":"Israel Potter","description":"简介： Biography, in its purer form, confined to the ended lives of the true and brave, may be held the fairest meed of human virtueone given and received in entire disinterestednesssince neither can the biographer hope for acknowledgment from the subject,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2836","creation":"Aug 1, 2019 12:24:39 AM","modification":"Aug 1, 2019 12:24:39 AM"}}
