{"id":85844,"no":28,"title":"Page 28","content":"\n I set my bag down, grab the note, and unfold it. But it’s not from Anna.\n Or Kara.\n The handwriting isn’t immediately familiar to me. It’s a single line on a piece of paper that has a photocopied quality about it.\n I hate it here.\n Michael.\n His name floats into my head for no reason at all.\n I turn, expecting to find him behind me. He’s not. But—\n Oh.\n I try to work it out. Why do I have this. Why was it in my locker .\n At first, I think it’s a gift from him. Something so important and private—he wants me to see it, wants to share it, but he wouldn’t, not even now, because that’s …his mom. I flip the page over and see another line scrawled across the back:\n Underneath the water fountain outside of Hartnett’s.\n The handwriting is deliberately warped.\n This isn’t bad. Not yet. I crumple the paper and rush for Hartnett’s room. I’m halfway down the hall when I realize I’ve left my book bag sitting in front of my locker, but I don’t care. The bell feels like it could go soon, so I leave it.\n This is more important.\n Ellen Pines is taking the longest drink of her life when I finally reach the fountain, and my head is pounding, swimming. I wait and wait and I’m about to shove her out of the way, when she stands, wipes her mouth, and goes. I run my hand along the porcelain underside until I find the next piece of paper taped to it.\n I rip it off and unfold it.\n I think I liked being an Unstable Freak better before she died.\n I hate everyone in this school, but I want to tell them about her.\n I somehow manage to keep the guilt that’s invading every space inside of me from turning into tears. This is so private. I flip the paper over and it directs me to the fountain outside of Holt’s office. No one’s there. I rip the note off and unfold it. I don’t want to read it.\n But I do.\n These people all look the same. They walk the same, wear the same type of clothes, talk the same. Nothing that comes out of their mouths is important.\n These people are wasters.\n It leads me to the fountain on the second floor. It’s bad.\n I’m the antichrist with the anger-management problem. That’s the latest.\n Everyone here is afraid. It’s sort of amazing in a really dumb way. Liz says it’s her fault. I like Liz She’s better than most of what’s walking the halls.\n I shove my hand into my pocket and find an antacid, and then I shove it into my mouth and chew. The next note sends me back to the fountain on the first floor, right by the entrance.\n I unfold it.\n I hate it here.\n Even the poor quality of the photocopy can’t hide how hard Michael wrote these words. The ink bleeds out, stressed edges around the final sentence. I can’t picture him this way. Hurt and angry and ready to explode—like me. He worked so hard to make sure no one ever saw it. At the fountain beside the lab, the next paper reads this:\n I need a reason.\n I close my eyes and flip the note over. Open them.\n Storage room off the gym.\n The bell rings. I make a run for it. The storage room off the gym. Michael’s journal. They have Michael’s journal. They dogged him all day yesterday. Why didn’t I pay attention? I should’ve known. I should’ve known. When I reach the storage room, there’s one last note taped to the door. I rip it off. I don’t need to read it.\n I push the door open.\n Anna.\n “Where’s the notebook?” I demand.\n “Close the door, Regina,” she says calmly. “We need to talk.”\n “Give me the fucking notebook now, Anna.”\n “It’s already back in Michael’s hands. He didn’t even know it was gone. Now close the door, Regina, so we can talk.”\n I close the door. “Give me the photocopies then.”\n She crosses her arms and looks me up and down slowly. That look. Like I’m not good enough to be acknowledged by her. Even after all this. And then the reality of the situation hits me full on, sinking into my bones, making me step back. I don’t understand how she’s standing here and looking at me like—\n “How—” I can’t even finish the question.\n “You really didn’t think I’d just sit around and stare at my hands, did you? Just let you have it?” Anna raises an eyebrow. “That’s more your style, Regina.”\n I shake my head. “No—”\n “I would’ve gotten bored with you by now if you’d backed off. I can spray-paint your locker, lock you in storage rooms, ruin your things, broadcast your secrets all over the Internet, and I can make everyone hate you twice as much as they used to, and you still haven’t learned.” She cocks her head to the side. “Right after your e-mail went out, I started brainstorming. That’s the trick: Don’t waste time. I wanted to figure out how to bury you so far into the ground, you’d finally get it and never bother me again. Except it was harder than I thought it’d be, because the problem with you is you don’t seem to care about what happens to you anymore.”\n I bite the inside of my cheek so hard there’s blood. I let the coppery taste reach my tongue and focus on it. Anna has Michael’s journal.\n She has his journal.\n “I was stumped, but then Josh said you’d probably care about what happened to Michael. I guess…he’s the best thing that’s ever happened to you?” She grins, laughing a little as she watches my own words turn my face a ghostly shade of white. “So cute.”\n “Anna, don’t—”\n “And then,” she says over me, “Josh reminded me about Michael’s notebook that he always carries around. His journal?”\n “Anna—”\n “First, I thought we should try to get our hands on it, because maybe there was something in it about you we could use. I was skeptical that Hayden had anything interesting to say, but after Bruce got it…” She laughs. “And what kind of moron leaves their journal in their car, by the way? Anyway, after Bruce got it, I was riveted from page one. Michael’s very sensitive, did you know?”\n “That’s a trait you find in people who have souls,” I manage.\n Her face changes. She’s angry, still smarting from what I did to her.\n “And how do you think he’d feel if the contents of his soul were plastered all over this school? Do you think that would bother him? Given everything he’s written, I think it’d bother me, if I were him. He doesn’t have much good to say about the people in this school.”\n “So? Michael doesn’t care what people here think of him.”\n “But would he care if they knew he was so distraught about his dead mother he wanted to die? Like, kill himself? Not that he ever came right out and said it, but it’s there. It’s so obvious.”\n My brain tries to process Michael that far gone and alone because of—me. And I knew it. It’s not like Liz ever told me, but when it’s vague, when no one’s telling you exactly what you did, it’s different. It makes it easier.\n “Seriously!” Anna says, relishing the stunned look on my face. “I mean, even I didn’t think he was that depressed! He hid it well, huh? Not like Liz. I always got this vibe from her.”\n “This is a new low, Anna, even for you.”\n “Well, I don’t want to do it, but—”\n “I’ll tell him. I’ll just tell him. No fun for you if I get there first—”\n “You tell him and I’ll take this to Holt.” Anna digs into her pocket and hands me another folded piece of paper. I don’t want it, but she keeps her hand out until I take it. “That was my favorite entry.”\n My hands are shaking. I don’t want her to see them shaking. I have to wait until I feel steady enough to read it.\n It’s a single line.\n I want to kill everyone in this stupid school.\n “You don’t even need to read between the lines for that one,” Anna says. “No room for interpretation. It’s sort of poetic, isn’t it? ‘I want to kill everyone in this stupid school’ Strong sentiment. Dangerous sentiment.”\n I swallow. “So?”\n “The first half of his journal is basically about a crazy, depressed boy with a dead mother who hates everyone in this school so much he wants to kill them. In this post-Columbine age, you know the rules, Reg.” She nods at the paper. “We’re supposed to report any warning signs we see. His journal is officially grounds for expulsion…probably a hell of a lot of therapy. They could put him away for this.”\n “No—he’s not—I know Michael and he’s not—” He’s not like that anymore.\n “You know Michael,” she points out. “Nobody else here does. In fact, what everyone here thinks they know about Michael pretty much supports the kind of picture I’m painting. And whose fault is that, by the way? Oh, right. Yours. Well, and mine. But I’ll let you take most of the credit for that one.”\n “He didn’t do anything to you,” I choke out.\n “Well, at first I thought I might be pushing it,” she agrees, “but it turns out Michael’s not my biggest fan. It’s all in his journal: I’m destined to be a future trophy wife who’s catatonic all the time because I’m always on pills to dull the pain of my life.”\n I go completely numb. My pulse stops spazzing, my heart stills.\n I stare at the paper in my hand.\n I want to kill everyone in this stupid school.\n “What do you want?” I ask slowly.\n She sighs. “Definitely not a truce. You don’t get away with what you did to me. You get to suffer for it.”\n “Just tell me.”\n “We’re reconciling!” She claps her hands. “That’s what everyone gets to think! Anna and Regina—best friends again! Can you imagine the looks on everyone’s faces when we walk into school together tomorrow? Any respect you earned from your YourSpace e-mail stunt will be instantly gone, and everyone will be so distracted by this insane turn of events, they’ll forget all about it. They’ll think I must be pretty good if I can get you back into the fold, and let’s face it, I am. And you—” She grins. “You, Regina, will act like you love it.” \n","sourceLink":"https://allnovel.net/some-girls-are/page-28.html","bookId":1896,"book":{"id":1896,"title":"Some Girls Are","description":"Storyline: \n Climbing to the top of the social ladder is hard—falling from it is even harder. Regina Afton used to be a member of the Fearsome Fivesome, an all-girl clique both feared and revered by the students at Hallowell High... until vicious rumors about her and her best friend\u0027s boyfriend start going around. Now Regina\u0027s been \"frozen out\" and her ex-best friends are out for revenge. If Regina was guilty, it would be one thing, but the rumors are far from the terrifying truth and the bullying is getting more intense by the day. She takes solace in the company of Michael Hayden, a misfit with a tragic past who she herself used to bully. Friendship doesn\u0027t come easily for these onetime enemies, and as Regina works hard to make amends for her past, she realizes Michael could be more than just a friend... if threats from the Fearsome Foursome don\u0027t break them both first.\n \n","cover":"https://allnovel.net/images/some-girls-are.jpg","author":"Courtney Summers","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/some-girls-are.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:08:57 PM"}}
