{"id":106336,"no":24,"title":"Page 24","content":"This was the second time they had stopped to rest their mules and horses, letting them drink from the stream their path followed in a steadily upward climb toward the crest of the mountain. The additional weight of Blaga and Ennati in their muffling bearskins slowed the mules, making them increasingly reluctant to go on. \"I am grateful that this is a long day,\" said Ragoczy Germainus in the language of the Poles, so that neither Ennati nor Blaga could understand him, should they happen to be roused from their daylight stupor sufficiently to overhear them. As he checked the girth, tightening it a little before getting back into the saddle, he went on. \"Were we in winter, there would be no chance of completing our mission; if the way was not made impassable by snow, the shortness of the day would give us insufficient time to complete our travel before nightfall.\" \"I would not like to have to fight on this trail,\" said Rotiger in the same tongue as he patted the pommel of the sword slung across his back, and fingered the other weapons on his broad leather belt. \"Nor would I, in any season,\" said Ragoczy Germainus. \"But still, we ought to be ready for anything once the sun is low.\" \"And that will not be long. Once we cross the bridge-\" Rotiger began only to be cut off by his master. \"We will not cross the bridge,\" he said as he gathered up the reins and the lead-rope in preparation for moving off again. \"Why not?\" Rotiger asked in surprise. \"Because Ennati was giving us...shall we say, poor information,\" Ragoczy Germainus replied. \"Are you certain of it?\" Rotiger pulled on the two leads he held, bringing the mules up behind his dun. \"As certain as I am of anything I do not know as a fact.\" He took the lead up the steep, winding trail toward the jutting crags at the top of the mountain. \"Consider how difficult it is for Chimena\u0027s brood to walk in daylight or cross running water-in spite of being on their native earth. Would they make so crucial a traverse over a series of waterfalls?\" \"It does seem unlikely,\" said Rotiger, and, after a brief silence asked, \"Why does their native earth not shield them, I wonder?\" \"I do not know,\" Ragoczy Germainus admitted. \"I have thought about it for a long time, and all I can arrive at is the same conclusion I reached decades ago: that since there is no reciprocity between Chimena and her...offspring, there are none of the benefits that come from that exchanged intimacy, with anything. They have lost their sense of...mutuality.\" He coughed in warning. \"There is an overhang ahead of us.\" \"I see it.\" Rotiger peered at the stone brow and frowned. \"I wish I had a hand free for my sword.\" \"And I,\" Ragoczy Germainus confessed. \"It is an ideal place for an ambush. I cannot use throwing weapons in so confined a place.\" \"Or there must be a watch-post,\" said Rotiger, holding the leads more firmly. \"I would expect them to try to stampede our animals. On a trail this narrow, and over a ravine, that could be fatal.\" \"So it could,\" Ragoczy Germainus said, recalling just such a trap in the Greek mountains; then the enemy had been Huns and the pack-train had had a dozen mules and six riders in it, but the results were the same as they would be here if the animals were panicked: disorder and disaster. Rotiger held his horse and mules back on the trail to give Ragoczy Germainus and his horse and mule some room to maneuver or retreat if that became necessary. He knew his nervousness was being communicated to the animals, and there was nothing he could do about it but keep his grip on the reins and lead while hoping nothing untoward would happen. The high screech of a hawk sounded overhead; a pair of the raptors were circling in their last hunt of the day. Ragoczy Germainus laughed once. \"Do you think we are their prey?\" \"The mules might be, if the birds could carry them off,\" said Rotiger, watching the hawks slide through the sky. \"We cannot rush the mules, not so high up. The air is thinner here, and they must not be pushed beyond their endurance. It would be folly to exhaust them.\" Ragoczy Germainus recalled crossing the Celestial Mountains, and the difficulty he had experienced on the high passes when he tried to speak; so high and cold was the road they followed that the ponies carrying their chests were fed hot gruel with bits of meat in it so that they would not collapse on the journey. A while later they reached the bridge; it was cooler now, and the shadows cast by the peaks around them moved over more of the mountain, creating a kind of twilight in the canyon. They took the goat-track that led up the mountain instead of crossing the falls. \"At another time I would admire them,\" said Ragoczy Germainus, looking down at the spectacular display in the gorge; the rumble of the falls, magnified by the stone walls around them, made it necessary for him to shout. Rotiger made a sign to show he heard and agreed as they continued upward, toward the long, brilliant rays of the westering sun; behind him, tied over the packs and chests the mules carried, the trussed figures of Ennati and Blaga began to move as the coming of the end of day stirred them from their sleep. Finally they emerged from the shadows of the narrow canyon to a plateau where scrub grew in place of trees and rocks poked up everywhere. \"It should not be far now,\" said Ragoczy Germainus as he looked around them with shaded eyes. \"I think I see one of those old shrines, there\"-he pointed-\"at the end of that escarpment.\" \"You mean those large white stones?\" Rotiger asked as he did his best to follow Ragoczy Germainus\u0027 line of vision. \"Immediately to the right of them. There is a standing arch, about half my height, by the look of it, making a niche.\" He sat back in the saddle, grateful-as he often was in the last nine years-for the stirrups that he had had fitted to his saddle a decade ago. On a climb like this, stirrups made all the difference. \"Is that a tomb?\" Rotiger asked, and turned in his saddle as Blaga roared in fury. \"The two are waking up,\" Ragoczy Germainus noted, his face set in an amiable smile that did not touch his eyes. \"Blaga, be still,\" he ordered in a louder tone, and in the dialect of the region. \"You are not improving your situation by making so much noise.\" He spoke to Rotiger in Persian, \"Let us wait until he is ready to be sensible. I do not wish to have to fight him on this trail.\" Blaga muttered incoherent threats as he struggled against the bonds that confined him in the bearskin. \"Rotiger will be forced to subdue you if you keep on that way. If you hope to alert Chimena of your coming, that has probably already been done.\" He waited until Blaga calmed down. \"That is much better. Continue in this manner and all will be well. I am afraid there is nothing I can do about the heat in those skins. It is summer, and even up high in the mountains, it has been warm.\" There was a long silence this time, then Ennati said, \"We will not fight you.\" \"We will not have to,\" Blaga finished for him. \"No doubt,\" said Ragoczy Germainus, and moved off again, trying to discern who was following them-if, indeed, anyone was. \"You are edgy, my master,\" Rotiger remarked in Persian as they approached the ancient tombs with their arches for protecting offerings. \"With good cause, I fear,\" Ragoczy Germainus said as he drew in his horse. Although he took his said from its ties on his saddle and slung it around his shoulders more for the protection it afforded than against the first evening chill, he remained in the saddle; Rotiger followed his example. \"This is a very exposed place,\" Rotiger said. \"And there is just the one path out of it,\" Ragoczy Germainus added. Rotiger nodded, glancing over his shoulder toward the fading sun. \"It will be night in a little while.\" \"Then it is time they emerged,\" Ragoczy Germainus said as he pointed to the high niches. \"How many?\" Rotiger asked. \"I have no idea,\" Ragoczy Germainus replied, and put his hand to his belt where a long chain hung, with a fist-sized iron ball at either end. Rotiger saw this, and said, \"You expect to fight.\" \"No; I am prepared to.\" He waited as the light behind them went from gold to red to lavender. \"Are you ready?\" he called out to Blaga. \"You and Ennati will soon be back with Chimena.\" \"She will be angry,\" said Ennati fatalistically. \"That she might,\" Ragoczy Germainus said, making no attempt to deny the possibility. \"And then what?\" Blaga demanded abruptly. \"Will you keep us safe from her anger?\" \"My master,\" whispered Rotiger before Ragoczy Germainus could answer Blaga. \"I see it,\" said Ragoczy Germainus. \"The nearest tomb...\" Rotiger trailed off. \"Is opening; yes, I see.\" He rose in his stirrups and loosened the fine chain holding the metal balls to his belt. He swung down out of the saddle and went to unstrap Blaga and Ennati from their places, handling them with no sign of effort as he lifted them from the packs to the ground, saying as he did, \"I am not going to release you yet. There is much to be decided before I do. You may struggle if you wish, but I would hope you have better sense than that.\" Blaga mumbled an obscenity and wriggled against his bonds, then did his best to sit up, but without success. Ennati lay supine and inert, which made Ragoczy Germainus more wary of him than Blaga. The first door was open now, and the occupant emerged. The figure was dressed in Moorish clothes, wearing a tunic of leather stitched with metal scales; he had a scimitar thrust through his broad green sash and there were metal points on his tooled-leather boots. Ragoczy Germainus recognized Yamut ibn Rabi; he recalled the steady hatred the Moor had shown for Chimenae, and wondered how he had become the guard of Chimena. A second door opened, and another Moor came out, also dressed for combat. The two swung around to face Ragoczy Germainus. \"I remember who you are,\" said Yamut ibn Rabi in the language of the region flavored with a strong Moorish accent. \"How is it you have returned?\" \"I remember you as well,\" said Ragoczy Germainus, offering him a salaam. \"My travels brought me here. I am on my way to Asturica; the roads forced me to come this way. I am in a hurry to reach my destination.\" He secured the lead-rope of his mule to his saddle. \"Of course,\" said Yamut ibn Rabi sarcastically. \"I should have realized that you would not come here for any other reason. How do you come to have two of ours trussed up like lambs going to slaughter?\" He indicated the struggling figures tied inside the bearskins. \"They will tell you if you ask them,\" said Ragoczy Germainus. \"I have brought them back to Chimena-for so I understand she now calls herself-to ask her not to set her tribe on me.\" \"Do you suppose she would do this?\" Yamut ibn Rabi asked, unconvinced. \"For what reason would she?\" \"Those two have...persuaded me that it is a possibility,\" said Ragoczy Germainus, indicating Ennati and Blaga. \"They and a number of their comrades attacked my manservant and me. They wanted our horses and mules for blood and rituals, it seems, and they attempted to kill us. Since the others fled, I decided it would be best to settle this now, before they all gather again.\" He nodded toward his two captives. \"I could easily have given them the True Death, but I did not, to show that I mean Chimena and her descendants no harm.\" \"So it is you,\" said a voice off to the left. Ragoczy Germainus turned to see Chimena approaching. She was as magnificent as ever, her silken finery better than most that could be found from Gadez to Roma. Her stole was of thick, pleated silk in a deep, wine-red, belted with golden links, and draped around her shoulders was a loros set with rubies and pearls and embroidered with gryphons-fine enough for an empress to wear. Her shoes were sewn with golden thread and she had added a golden fillet to her brow. \"You are very splendid,\" said Ragoczy Germainus as she approached. \"Yamut and Sayed have been busy getting tribute for me; it is only right that I should display it,\" said Chimena, nodding to her two Moorish guards. \"They have brought me things.\" She fingered the loros. \"They know what I like most.\" \"How unfortunate more of the world cannot behold your grandeur,\" said Ragoczy Germainus, no hint of condemnation in his voice. \"You have come far into the mountains.\" \"They are cutting down the forests. I could not rest safely in my own house; they are emptying the mountain villages, too, and that has driven me here.\" Resentment simmered in her eyes. \"One day, they will regret what they have done. They all will-the villagers who have forsaken me as well as the Moors.\" \"For your sake, I hope not; for in that day, they will know you enough to find you and kill you.\" Ragoczy Germainus glanced toward Blaga and Ennati. \"They are doing you no good, hunting travelers like wolves.\" She shrugged, then asked, \"Why do you think so?\" \"Because they cannot catch all of those who have offended you, and eventually the tales will be pieced together and you will be hunted as you have hunted them. Had the Moors not come, you would have been known before now, and you would have been forced to flee or die. Since you have increased your numbers, you have made yourself a reputation that may be your undoing.\" Ragoczy Germainus let the small chain slide through his fingers as he saw Yamut ibn Rabi and Sayed coming toward them. \"Tell your Moors to keep their distance.\" \"This is where I belong.\" Chimena sighed and held up her hand to them. \"Stay where you are. For now.\" She looked back at Ragoczy Germainus. \"Very well, you have brought them back to me. For that, you must suppose I will be grateful?\" \"No,\" said Ragoczy Germainus. \"No,\" she seconded. For a short while she said nothing more, then, \"Have you thought about how you will leave this place?\" \"I am aware that this could be dangerous,\" said Ragoczy Germainus, \"but I could not think you would be unworthy of trust.\" \"How delicately you put that,\" she said, false approval making her demeanor overly respectful. \"You were counting on my sense of obligation to you, were you not? to ensure your safe passage from here.\" \"Rather say I was hoping for it,\" said Ragoczy Germainus quietly. She laughed, throwing back her head as if she were baying at the night. \"Very deft, Sanct\u0027 Germain. You know just how to appeal to me, do you not?\" \"I am not trying to-\" he began, only to be interrupted. \"You are trying to shape me to your desires, as you have from the first, and I have no patience with it any longer. I am not subject to your pleasures or your strictures, no matter how much you suppose I ought to be. Will I never be rid of you?\" She pointed to Ennati and Blaga. \"Release them at once, and let me deal with them.\" \"If you are planning to harm them in any way, I will not; I did not bring them to you for that,\" said Ragoczy Germainus. \"But look at them,\" said Chimena as she went to stand over them. \"They are useless.\" She kicked out, striking Ennati in the leg; Ragoczy Germainus moved between her and the two bound men. \"How can you protect them when they have done nothing worthy of it?\" \"You do not know they have done nothing worthy,\" said Ragoczy Germainus. \"You bested them, did you not?\" she countered. \"They are useless to me if they fail.\" Rotiger spoke up, \"Chimena, you may be their master\"-he used the masculine word deliberately-\"but you should not hold your clan in contempt.\" She looked up at him. \"You would say that, for his sake!\" She flung her hand in Ragoczy Germainus\u0027 direction. \"It has nothing to do with me. I make members of my clan as I need them and I rid myself of them when they defy me or have proved themselves useless, as so many have.\" She paused. \"Yamut and Sayed know what to do.\" \"And who will know what to do with them when you decide to be rid of your Moors?\" Ragoczy Germainus asked. Chimena laughed. \"You are very clever, trying to make them think I will turn on them so that they will not do my bidding now.\" She held up her hands. \"You will go now, and you will be unharmed. If you stay, you will have to answer for it.\" \"Why do you do this?\" Ragoczy Germainus asked, changing his grip on the chain in his hand. \"You demand devotion and you reward it with disdain.\" \"They are all weak, every one of them,\" she said. \"What is there to admire in that?\" Ragoczy Germainus shook his head. \"You do not understand-\" \"Reciprocity,\" she finished for him. \"And you do not understand that I do not want it. Why should I? Reciprocity is for equals, and I have yet to find one, living or undead, who is that. Not even you-especially you, no matter what you think. You haven\u0027t the courage to defend your territory.\" She tossed her head, her golden fillet shining in the pale starlight. \"Still. You have brought my followers back to me. I acknowledge your service.\" It was clearly a dismissal, but Ragoczy Germainus made no move to depart. \"I do not want my guards to kill you, but if you insist...\" She shrugged, finishing her thought with the action. \"I have no desire to fight you, or them,\" said Ragoczy Germainus, stepping back to find better footing away from Blaga and Ennati. \"If you cannot be satisfied any other way, then so be it.\" \"They will kill you,\" said Chimena, smiling in anticipation. \"They may try,\" Ragoczy Germainus responded, getting more distance between himself and the two men on the ground. \"Rotiger, guard them.\" \"I will, my master,\" said Rotiger, and drew his short sword from its scabbard. Chimena pointed to her Moors. \"Yamut. Sayed.\" With that, she got out of the way, choosing the haven of an arched niche from which to watch the fight. Ragoczy Germainus pulled the chain out between his hands and set the balls on the end to spinning; they made an eerie moaning as they swept through the air. \"Come. Let us get this over with,\" he said, sounding tired. The two Moors separated and tried to move in on Ragoczy Germainus from the sides, their scimitars held up at the ready, but the whirring balls kept them at bay, giving them no opportunity to strike. \"What is happening?\" Blaga shouted, trying to maneuver the bearskin off his head so that he could watch. \"There is a fight going on,\" said Rotiger, his whole attention on the engagement taking place before him. \"The Moors?\" asked Ennati. \"Is he fighting the Moors?\" \"That he is,\" said Rotiger. Sayed made an experimental slash with his scimitar, testing to see how much it would trouble Ragoczy Germainus; the metal ball hummed past his head and forced him to withdraw a step. At the same time, Yamut ibn Rabi tried to get behind Ragoczy Germainus, only to discover the foreigner had swung around on his heel and now faced the Moor, driving him back with the weighted, whirling chain. \"The first passage ends in no advantage,\" said Rotiger to Ennati and Blaga. \"Did the Moors draw their swords?\" asked Blaga, a note of incredulity in his voice. \"Oh, yes,\" said Rotiger. \"How strange that they could not-\" Ennati interrupted himself as another sound-metal on metal-claimed his attention. \"What was that?\" \"One of the Moors tried to catch my master\u0027s chain on the blade of his scimitar,\" said Rotiger. Sayed jumped away, struggling to hold onto the hilt of his weapon, and discovered that it was well and truly caught in the chain. In a quick movement, Ragoczy Germainus jerked the scimitar out of the Moor\u0027s hands, shook it free of the chain and kicked it so it went bouncing and clattering down the mountain. Yamut ibn Rabi rushed forward, hoping to turn this misfortune to advantage and was stopped as the one metal ball still spinning slammed into his shin with an audible crack; Yamut ibn Rabi howled and went down, holding his leg. \"I am sorry,\" said Ragoczy Germainus, stopping his chain from moving. \"The break will heal over time, but it will be long, and you must keep it splinted and bound for all the months it heals or it will be weak.\" He looked toward Sayed. \"You may draw your dagger if you wish, and we can battle on, but you will not prevail.\" \"Attack him!\" Chimena ordered, pointing to Sayed. \"Do not stand there!\" Obediently Sayed pulled his dagger from his sash, raised it and rushed at Ragoczy Germainus only to be stopped as Ragoczy Germainus seized his arm and pulled it sharply around behind him, all but lifting him off his feet. \"If you drop your dagger I will not have to hurt you anymore,\" said Ragoczy Germainus gently. \"What has happened?\" Blaga demanded. \"My master has broken the leg of one and may wrench the shoulder of the other from its socket,\" said Rotiger with no display of emotion. Any remarks Blaga might have added were silenced as Chimena came rushing out of her niche, screaming in outrage, a spiked club swinging in her hands as she approached Ragoczy Germainus. \"You will not do this,\" Ragoczy Germainus said, and released Sayed to face her, stepping aside as she swung at him so that her club hit nothing and the force of its weighted swing nearly pulled her off her feet. As the club began its arc back, Ragoczy Germainus moved in and stopped it, lowering it out of her hands and letting it fall to the ground. \"Enough,\" he said. Chimena faced him. \"You are going to kill me, are you not?\" Ragoczy Germainus stared at her. \"Of course not,\" he said, still nonplused. \"You are of my blood, and I do not kill those I have brought into the world.\" \"I kill those I have made,\" she said with pride. \"I have the right.\" She studied him. \"I know what it is. You are afraid.\" She looked down at Yamut ibn Rabi. \"You should not live for this.\" \"He fought well,\" Ragoczy Germainus said quickly. \"He did not know how to counter my weapon.\" \"He did nothing to stop you,\" Chimena persisted. \"Now he will need a year of being crippled at least to be able to defend me again.\" \"What is a year to you?\" Ragoczy Germainus asked. \"You have more than a century behind you, and many more ahead of you. A year-it is such a little time.\" He waited for her to speak, and when she did not, he went on. \"I have my medicaments with me. I can splint his leg and show you what must be done to keep it from being injured again.\" \"Being injured again?\" Her voice rose in acerbity. \"Why should I do anything for him? He disappointed me.\" \"As will many others before now and after,\" said Ragoczy Germainus, taking a risk in reminding her of what she did not want to consider. \"You brought them to this life-why can you not accept them as they are?\" Chimena\u0027s lip lifted in an expression of disgust. \"He is no better than Ennati and Blaga. I should have Sayed strike off their heads and leave their bodies in the forest of vermin to forage on.\" \"Because they were unable to kill me?\" Ragoczy Germainus asked, not quite incredulously. \"Because they let themselves be bested,\" she said, unwilling to look at him. \"They are worthless.\" \"Worthless,\" Ragoczy Germainus echoed, shaking his head. \"They have given you all their loyalty and you want them slaughtered.\" \"I will find others who will do what I require of them; they will not be as cowardly as these are.\" She went to Yamut ibn Rabi and spat in derision. \"It is bad enough that you refused to punish Olutiz for me, you now fall to a weapon that is little more than a toy.\" She was about to kick him again when Ragoczy Germainus restrained her, pulling her away from the fallen Moor. \"You must not,\" he said as she struggled in his embrace. \"For your sake, you must not.\" \"Let go of me!\" she ordered, trying to scrape her heels down his legs without success; her attempt to smash his arch was also thwarted, leaving her fuming. \"You are doing an injustice to your people, Chimena,\" he said steadily. With a final wrench she broke out of his arms; panting and square-mouthed in fury, she rounded on him. \"Get away from here! You have no authority over me. Go. Go now. This is nothing of yours. I am nothing of yours. Leave me and do not come back, for you are now my enemy, and you will be my enemy until one of us is truly dead.\" She was trembling with rage and her voice shook. \"If you come back, you will be killed.\" \"By whom?\" Ragoczy Germainus asked, knowing his challenge was futile. \"I will have those around me who will not fail me.\" She pointed down the mountain. \"This is my place. You do not belong here.\" He took a step toward her only to see her draw a long, thin poignard from her deep sleeve. \"Chimena,\" he said. \"If you come any nearer, I will use this on Yamut ibn Rabi, and then on Sayed-\" She looked around and discovered Sayed was missing. \"The craven-how dare he-he will be made to pay for his perfidy.\" She went silent, then pointed at Ragoczy Germainus. \"I will not punish the two you brought if you go at once,\" she said in a tone that was coldly remote. \"If you linger, they will suffer for it.\" She held her poignard up, ready to use it. \"Give me your Word, Chimena,\" Ragoczy Germainus said, aware that she was prepared to do everything she promised. \"You have it. If you go. Now.\" Her rictus smile was dire. There were so many things Ragoczy Germainus wanted to say to Chimena, and he realized that all were useless. He walked back to his horse and got into the saddle, an emptiness yawning within him so profound that it held him like pain. A jumble of parting words rose in his mind, only to be abandoned; she had no desire to listen, nor inclination to hear. If he tried to press an advantage with her, the three vampires on the ground would pay the price of his failure. \"Come, Rotiger,\" he said as he signaled his horse to turn, and the mule with them. \"Ambrosius and Lavetta and Ubertuz are waiting. We have a long way to go.\" Text of a dispatch from Dabir ibn Badr ibn Jumah at Terrago to Ibrahim ibn Husain at Zaragusta. In the name of Allah, the All-Seeing and All-Merciful, this request from the leaders of our great fleet, that must surely triumph for the Glory of Islam, and to which end this petition is presented to Ibrahim ibn Husain on behalf of those devoted to the Caliph and the Prophet of the One God. May I be struck blind and impotent if I report in error. As the officer given the task of supervising logging in the mountains east of Zaragusta, you are without doubt aware of the severe storms that have cost us so many lives and ships since the Spring Equinox. Not only have we been unable to provide the admirals\u0027 needs, we have many ships still awaiting repairs that cannot be completed unless you undertake to increase the lumber that is needed to restore our navy and our merchants to their preeminent position on the seas. Without the enterprise of those over whom you have authority, we might lose the advantage we have enjoyed for more than twenty years; should that happen at so crucial a time, there is little chance that we could soon recover what we had lost, for our momentum has not altered until now, and as a hunter more urgently pursues a prey when he knows it is wounded, so our enemies will hound us should they come to discover how extensive our damage has been to our ships. Therefore it is imperative that you increase the number of logs you deliver and the speed at which you deliver them. To that end, you are being allocated twenty more work-gangs of slaves to enable you to provide us with what is required. We are also allocating more barges for the purpose of carrying cut logs down the river to the port, and the crews to man the barges as well. These crews will need to be quartered and fed, and will therefore require tents for barracks and tools for their work, all of which they shall have with them. The work-gangs for cutting trees will be provided tents as well, against the desertions that have been the bane of overseers in the mountains. Your reports of demons have been noted, and appropriate talismans will be issued for the preservation of the slaves cutting trees. We will also increase the flocks feeding on the hillsides once they are open; it may prove then that the demons are Christians who have become outlaws and bandits, hiding in the forests and preying upon those venturing too near their hiding-places. So that the remaining villagers will not be tempted to side with these lawless creatures, we will excuse all taxes for a year, and charge Christians the same taxes as followers of the Prophet for five years, so that they will not be beggared by aiding us. This may well put an end to the rumors of demons and the tales of the living dead who pursue the living for the purpose of draining the life from them. It is fitting that we should bring such fables to an end, and to cease the rites of Holy Blood that have been in the traditions of those mountains for many years, for to encourage anyone in those beliefs is to turn them from Allah and His Prophet, by indulging the ignorant in their superstitions. Let the villagers and shepherds see that we will not deny them charity, or refuse them the means of making a living, and they will no longer seek the favor of the creatures of legend. If there is more talk of demons, then burn the hillsides once you have taken the trees: that will destroy many hiding places as well as put an end to all this talk of demons and it will show the villagers that we are not going to accept their excuses, or it will send the demons-if demons there are-back to Shaitan, and show that the followers of the Prophet and the One True God have nothing to fear from demons, particularly Christian demons. You will soon have these new crews in your city, and you are urged to prepare for them; you will have to lay in additional foodstuffs and cloth, as well as the leather and metal these work crews require; the bargemen will be able to tend to themselves so long as the Eberuz is kept clear of debris, to which end watermen must be set to work. If we are to maintain control of these mountains, the work-gangs may well prove to be a double blessing, for in cutting trees for our ships, they will also open the mountains for our soldiers. You are being given a great honor and a great responsibility in this time. May Allah grant you strength and wisdom to make any adversity a victory for our people and our God. This at the first full moon after the Summer Solstice, in Tarrago, Dabir ibn Badr ibn Jumah Scribe to the admirals of the fleet","sourceLink":"https://allnovel.net/come-twilight-saint-germain-13/page-24.html","bookId":2499,"book":{"id":2499,"title":"Come Twilight (Saint-Germain #13)","description":"Storyline: Come Twilight (Saint-Germain #13) Beginning in the 600s, Spain\u0027s old blood rituals of animal sacrifice were replaced by the new gods of Christianity and Islam, who demanded no less obedience and allegiance. Saint-Germain becomes trapped in this cauldron of blood, fear, and faith when, he makes a vampire of the beautiful, haughty, tempestuous Csimenae. Csimenae kills without mercy. She makes vampires without a second thought; and they, For five hundred years, as waves of war and religion sweep over Spain, Csimenae hunts until her marauding, willful ways expose her vampiric nature. Saint-Germain\u0027s centuries of life have taught him that to fall out of step with history is to risk the True Death, a fate Saint-Germain wishes for none of his kind. He must try to save Csimenae-and her clan-but at what price?","cover":"https://allnovel.net/images/come-twilight-saint-germain-13.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/come-twilight-saint-germain-13.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:55:21 PM"}}
