{"id":106340,"no":28,"title":"Page 28","content":"\"There is something I must ask you to do for me,\" said Idelfonzuz to Germanno, Comide Ragoczy as they dismounted after a morning of hunting in the hills around Toledom; the escort of guards and courtiers had been left at the entrance to this inner courtyard and now only the two of them were met by grooms. \"It would be helpful to me if you would consider it while the others go to eat.\" He was so nonchalant that Germanno was immediately on the alert.\\n\\n \"I am, of course, at your service,\" said Germanno, making a reverence as he entered the palace a pace behind the King.\\n\\n \"That you are,\" Idelfonzuz approved. Dressed as he was for hunting, he still gave a military impression; his cote short and lined with fur, his pellotes was equally short and made of wolf-pelts that might have been mail. His bamberges were of boiled wool and clung to his legs; his estivaux were of tooled leather and had a broad, flat heel to support his foot in the stirrup, and his spurs rang as he walked. \"Unlike many of those around me, you have the wisdom to know it. You make this much easier for me.\" He headed down a broad, colonnaded gallery, striding through a series of parti-colored stone arches, paying no attention to the servants and slaves who hurried to get out of his way. \"I have to tell you what you are going to do for me.\"\\n\\n Germanno studied the King as he followed after him. \"I will be honored to do whatever I may; I am grateful for your hospitality.\" He understood now why the others had not been permitted to join them.\\n\\n \"Grateful. I hope you will be.\" Idelfonzuz increased his stride; Germanno kept pace easily. \"You are said to be wealthy. No,\" he went on, his hand up to show he was not to be interrupted, \"do not disclaim. I have seen how you have fitted out your house. You must have gold in plenty to do so well. If you have funds left over, I want you to use them on my behalf.\" They had now arrived at a grand hall with tall pillars holding up an ornate ceiling; there was a formidable hearth in which blazed a massive log to lessen the chill of the east wind that scampered through Toledom that day. Three slaves scurried off as Idelfonzuz and Germanno approached the fireplace. \"You will have my gratitude if you do this,\" the King added.\\n\\n \"You are most courteous to a foreigner,\" said Germanno, continuing cautiously, \"If you will tell me what it is that I am to do, I might better answer you.\"\\n\\n \"Ah, as to that,\" said Idelfonzuz, taking off his gloves and rubbing his hands before the fire, \"you are to purchase another grand house.\"\\n\\n Germanno maintained his calm. \"What house, good King? And to what purpose? Mine has proven most satisfactory, as I thought, to us both.\"\\n\\n \"True enough,\" said Idelfonzuz. \"But the grand house I want you to purchase is in Sevallis.\" He kept his light tone but turned to regard Germanno with a keen gaze.\\n\\n \"Sevallis is still in Moorish hands,\" Germanno reminded Idelfonzuz in a steady tone, no indication of surprise or dismay in his manner, although he was startled.\\n\\n \"Just so. That is why it would be most useful to me for you to do this,\" said Idelfonzuz, once again giving his attention to the fire. \"If it is not possible, then tell me, and the thing is forgotten.\"\\n\\n The Comide considered his response carefully, knowing once a King asked a favor that a refusal would always be remembered, and unfavorably. \"This is a most unexpected request, and one I must have more information about before I decide if I may be able to do as you request, although I hope it will be possible, for I owe you, Liege, a great deal. I do not know what price is being asked, for what dwelling, nor do I know why it is being sold, or by whom.\" He held out his hands apologetically. \"If I can discover these things, then I can answer you.\"\\n\\n \"What a canny fellow you are,\" said Idelfonzuz with a chuckle. \"No wonder they tell tales about you.\" He wagged his finger at Germanno. \"You need not ask who tells tales. You know what courtiers are-no fishwife gossips more than they, and you, being foreign, are an ideal target, the more so because many of them envy you.\"\\n\\n Germanno ducked his head. \"They do so without reason.\"\\n\\n \"Nonsense,\" said Idelfonzuz. \"You have gained my confidence, which most of them would lose a foot to have. They would envy you for that alone, but there is more. You are wealthy while most of them are not. You cannot think they would not be jealous of such a one as you are.\" He turned his back on the fire and let its warmth sink into him. \"Just the act of keeping you with me while the others of the hunt go off to have a meal will cause them to resent you. None of them would be willing-or able-to do what I have asked you to do, but they do not know this, and so they are given to rancor where you are concerned.\"\\n\\n \"No doubt you are right,\" said Germanno, his thoughts preoccupied: why had Idelfonzuz asked this of him, and what did he expect to gain from it? \"As an exile, I have learned that not all foreigners can hope to be welcome everywhere.\"\\n\\n \"No, they cannot,\" said Idelfonzuz. \"Nor can all rulers.\" He laughed aloud at his own wit, and cocked his head when Germanno did not echo him.\\n\\n \"I beg your pardon, Liege. I have had too many years wandering the world to be amused by them.\" He lowered his head to show he was abashed by his inability to share in the King\u0027s amusement.\\n\\n Idelfonzuz considered this, frowning a little. \"I suppose I would share your burden had I been forced to carry it. God has not imposed such a weight upon me, for which I am most truly thankful to Him, and serve His Cause.\" This was a significant concession, as both men knew. \"I cannot think of what you have endured. You must tell me of your travels, one day when there is time.\"\\n\\n \"So I shall,\" said Germanno, knowing neither he nor Idelfonzuz meant this.\\n\\n \"Anyway,\" Idelfonzuz went on with a wave of his hand to show this minor lapse was forgotten, \"the house I want you to purchase would be a most useful addition to the other Christian holdings in Sevallis.\"\\n\\n Germanno strove to keep from telling Idelfonzuz that he was no Christian, but held his peace, aware that such an admission was dangerous. \"What makes this particular house of such importance to you, Liege?\"\\n\\n \"It was once a Roman villa, where the great generals of Rome lived, and where horses and mules were bred for the Roman Legions. It was highly reputed everywhere, even after the Romans left. The Moors took it over and made it into a palace. The people of Sevallis will know that the rule of Rome is coming again if that house is in the hands of a Christian. Even the Moors will understand my meaning.\" He looked up at the Moorish embellishments in this palace and he sighed. \"They understand well enough why I have made this place my own.\"\\n\\n \"If that is the case-that the palace would become a symbol of your intentions-why should they permit this sale?\" Germanno inquired in a tone of curiosity rather than criticism.\\n\\n \"That is why I want you to buy it. You are not one of my Court as most are, and you have your great house here, and a fortune for traveling. There will be no reason to refuse you, no matter how suspicious they might be.\" He smiled broadly, pleased with his strategem. \"You can see the advantage in all this, can you not?\"\\n\\n \"I can see disadvantages as well,\" said Germanno as bluntly as he dared. \"Do you plan to send me to Sevallis to live in the house or do you want me to remain here?\"\\n\\n \"That is a problem.\" Idelfonzuz conceded, taking a few steps away from the fireplace. \"I want you by me, but if you are, you cannot do what must be done in Sevallis.\" He sighed again, more harshly. \"Well, I shall work it out in time. Not that we have much of that to spare.\" He swung around to face Germanno. \"So you must purchase that house, and soon. The owner will not wait for much longer to secure his price. He has only just arrived in Toledom but he will not remain here much longer. He is bound for Burgundom at the end of Lent.\"\\n\\n \"I see,\" said the Comide, wondering if Idelfonzuz had approached any of the others of his Court for this service and been refused. \"I would have to present my claim to the house in Sevallis or Corduba.\"\\n\\n \"Yes. I will give you leave for a period of time to do this. But I am pressing eastward soon, and I would like you to accompany me. I will need someone who can talk with the Moors we capture, and whose knowledge I can trust.\" He said it lightly enough, but the look in his prominent hazel eyes made it obvious this was an order.\\n\\n \"I am at your service, Liege,\" said Germanno, making a reverence in Idelfonzuz\u0027s direction.\\n\\n \"That you are,\" said Idelfonzuz with satisfaction. \"So you will purchase the house. We are understood on that point.\"\\n\\n \"I will try to,\" Germanno agreed. \"If the Moorish authorities will accept the sale, then all will be well. If they refuse, then-\" He lifted his hands to show he would be unable to do more.\\n\\n \"Bribe them well enough and there will be no opposition,\" said Idelfonzuz, dismissing Germanno\u0027s reservations with a slight shrug. \"You can afford a bribe, can you not?\"\\n\\n \"I can afford a bribe,\" said Germanno, thinking that he would have to build an athanor, and quickly, to make the gold and jewels he would need for this transaction. It had been centuries since he had been in Moorish-held territory, but he was certain the expectations for bribe had not decreased from his last time there.\\n\\n \"Then you may rest assured I will grant you occupancy of your house in Toledom for as long as you may wish to live there. You may have any other that suits you as well-except this one and the Obispus\u0027.\" He showed his teeth in a kind of smile. \"Send your servant along to me in the morning and my clerks will tend to the matter at once; we will settle our work this evening. By morning, you will have all the permission you need to purchase the house; I will see to it.\"\\n\\n \"Liege is most gracious,\" said Germanno.\\n\\n \"I am nothing of the sort,\" countered Idelfonzuz. \"I am demanding because I am at a crisis and I must find a way to win through or lose much of what I have gained. I have sworn an oath to God that I cannot break without sending my soul to perdition. I will reclaim Spain for Christ or I will perish and become a martyr with Santoz Ennati. Anything else is unthinkable.\"\\n\\n Germanno blinked. \"Santoz Ennati?\" he repeated.\\n\\n \"You may not be familiar with him: he is not much talked of outside of Aragon and Barzelunya. It is a most exemplary story: he was a Visigoth warrior who became a hermit and fought demons, killing a number of them with his axe-some say he killed five, some say he killed twelve, one for each Apostle-before they killed him, and hacked him to pieces. He saved his monastery and fellow-hermits by his act, and gained Heaven.\" He touched a small pendant decorated with seed-pearls that hung from a chain around his neck. \"I have some of his hair in this, to give me his protection and guidance.\"\\n\\n \"What color is it?\" Germanno asked, inwardly resisting the urge to laugh: it was a great irony, he thought, to have Ennati enrolled among his martyrs.\\n\\n \"I have just a little of it,\" said Idelfonzuz as he opened the little reliquary with his thumbnail; a lock of copper-colored hair lay coiled in the pendant-box. \"It is said he was a great champion, driving back Moors and demons with equal valor until he withdrew from the world. Then the demons mustered and came to drag him to Hell. His valiant battle earned him his place at the Right Hand of God.\" He snapped the little reliquary closed.\\n\\n \"A most...edifying legend,\" said Germanno, and went on, \"Not that I question you, Liege, but I know that over time the reports of such heroism can change, and the truth may be lost in the telling of the story.\"\\n\\n \"No doubt that is true,\" said Idelfonzuz stiffly.\\n\\n Aware that he had over-stepped, Germanno said, \"But that does not deny the underlying truth.\" He recalled Ennati\u0027s fear of being taken by Chimena\u0027s followers, and wondered if he would be offended or amused at the turn his story had taken, could he know of it.\\n\\n \"It may be so,\" Idelfonzuz said, relenting a bit.\\n\\n \"Where was the monastery or hermitage?\" Germanno asked, trying to discover how Ennati\u0027s tale had been handed down.\\n\\n \"It was near the road between Zaraguza and Usxa; it was long ago, three centuries at least. The monastery served as a hostel to travelers, and there were hermits\u0027 cells in the hills and the forest around the monastery. Having been a warrior, Ennati knew how to fight the demons.\" Idelfonzuz stopped his recitation. \"It is as I have told you.\"\\n\\n Germanno ducked his head in a show of deference. \"A brave man, whatever his situation.\"\\n\\n \"An inspired man, filled with zeal in God\u0027s cause, as I would hope all my men will be,\" said Idelfonzuz, and changed the subject. \"I want you to prepare for your journey, for delays will only impede my cause. You must be ready to go to Sevallis as soon as the sale is agreed upon. You will have at most a week to make ready. I want you to go there and secure the place. You are to appoint a care-taker-I will tell you whom to select-and then you will return here to aid me in my campaign in the east.\" He stared at Germanno. \"If you betray me, I will order you killed. Running would avail you nothing. Do not think you cannot be found, for my arm is long.\"\\n\\n \"I will return from Sevallis if I am permitted to do so,\" said Germanno, a bit wearily. \"It is not my wish to be hunted by anyone, Liege.\"\\n\\n \"A wise decision,\" said Idelfonzuz. \"You may yet prove as useful as any of my knights.\" He clapped his hands suddenly, and a moment later two slaves came, their heads lowered in abasement. \"Bring Fre Genisioz to me. Tell him to fetch parchment and his implements and his ink. I have need of him now.\" He clapped his hands again and the slaves departed. Looking directly at Germanno, he went on, \"Writing is not work for a man, and we must declare our purpose in writing.\"\\n\\n So that you can make all my property forfeit to you, should I fail in this task, Germanno thought, even as he made another reverence to this broad-shouldered, bristly man who was half a head shorter than Germanno. \"That is not necessary, Liege. If you have them fetch ink and pens and quills and parchment, I am willing to serve as your clerk,\" he offered.\\n\\n \"No; no reason to do that,\" said Idelfonzuz as if the notion was slightly distasteful. \"No man of position should do clerks\u0027 tasks.\"\\n\\n \"As you wish, Liege,\" said Germanno, adding to himself that Idelfonzuz did not trust Germanno sufficiently to allow him to write a binding agreement between them; this, he supposed, was because the King of Aragon and Navarre could read very little and was wary of the written word.\\n\\n Suddenly Idelfonzuz gave a broad, affable smile. \"You must be chilled. Come stand with me; let the fire warm you.\"\\n\\n Although he was not cold, Germanno obeyed promptly. \"It is a treat to have so large a fire.\" He found the heat pleasant, and remarked to Idelfonzuz, \"A morning in the saddle on such a day as this can leach the warmth from a man\u0027s bones.\"\\n\\n \"That it can,\" Idelfonzuz agreed. \"And it is prudent to take warmth where it can be found.\"\\n\\n \"Amen to that, Liege,\" said Germanno as he made a show of appreciating the warmth. \"You are good to let me share your hearth this way.\"\\n\\n Idelfonzuz laughed aloud. \"You are a man of some wit, Comide Ragoczy-wherever Ragoczy may be.\"\\n\\n \"It is a place far away, in mountains called the Carpathians, east of the Frankish lands, and south of them. The Magyars claim them now,\" said Germanno seriously. \"My family lived there for more generations that I can easily count,\" or, he added to himself, than you believe. \"I left when my father was killed and have been making my way about the world ever since.\"\\n\\n \"Your father\u0027s loss must have weighed heavily upon you,\" said Idelfonzuz. \"It is a cruel thing to lose a war and a father.\"\\n\\n \"That loss was hard, and the killing of our High Priest.\" It was the blood of this High Priest, who was also their god, that had made Germanno what he was. \"The deaths of those two was almost more than I could endure.\"\\n\\n \"Then you understand my battle, how I must embrace the cause of Christians in Spain, and the campaign of Adelfonzuz, my father-in-law, who wed me to his daughter Urraca for the purpose of ensuring his fight against the Moors would not falter with his death.\" He glanced over at Germanno. \"I mean nothing that would offend you when I say I would not like to wander the world as an exile.\"\\n\\n \"I do not blame you,\" said Germanno levelly. \"It is not always an easy life.\"\\n\\n \"That must be so, the more for me, if I do not defend the Christian faith along with the sacred soil of Spain.\" Idelfonzuz gave Germanno a quick smile. \"You have a deftness that must have served you well in your travels.\"\\n\\n \"Liege, you are kind to a stranger,\" said Germanno, and stepped away from the fireplace. \"I am honored that you are willing to entrust a mission to me. Let me know when I am to sign the deed for the grand house in Sevallis and I will do it willingly.\" He made a reverence again. \"It pleases me to serve you in this.\"\\n\\n \"So long as you do not linger in Sevallis, all will be well; you are not to be there over half a year, at most, and for a shorter time if you are able to arrange it,\" said Idelfonzuz curtly. \"You have too much to offer for me to want you to remain where my enemies might learn of your skills and employ them against me. Not that I doubt your many protestations of loyalty.\" He pointed to Germano. \"You have a place, and that is by my side. Secure the palace in Sevallis and come back. That is the whole of what I require of you at this time.\"\\n\\n This insistence caught Germanno\u0027s attention. He bowed in the manner of the Chinese. \"I will do what you require of me, Liege, not only for the good name of my House but to show you that you may well depend upon me in this.\"\\n\\n This assurance served to awaken Idelfonzuz\u0027s suspicions. \"You have no reason to make such pledges to me.\"\\n\\n \"No; that is why you may believe them,\" said Germanno.\\n\\n Fre Genisioz arrived at that moment, and hovered in the arched doorway, his short-sighted eyes peering into the room hesitantly as he clutched his writing supplies to his chest, against his pectoral crucifix. Finally he coughed to make himself noticed, and ducked his head as Idelfonzuz hailed him.\\n\\n \"Come forward, good monk. I have a task for you to perform.\" He pointed to the low table on the far wall, and frowned when Fre Genisioz did not move at once in response to his order.\\n\\n Germanno, however, realized the cause of this and went to lead the monk to the place the King had indicated. \"There is a chair, but it is low,\" he said as they approached the table.\\n\\n \"Ah. A Moorish table then,\" said Fre Genisioz, trying to smile in thanks and almost succeeding. \"You have done me a kindness, foreigner. I will not forget it.\" He set his parchment and implements down, then looked in the general direction of Idelfonzuz.\\n\\n \"Sit; sit,\" said the King impatiently, waving his hand as if to shoo away a pesky insect. \"Make your ink ready.\"\\n\\n \"It will not take me long, Liege,\" said Fre Genisioz. He set to work, adding water to his ink-cake and beginning to work it with the spatulate end of his pen. When he was satisfied with the texture and density, he chose a crow-quill and began to trim it to the shape he needed, all the while whispering bits of prayers.\\n\\n \"You will write,\" said Idelfonzuz loudly, pausing frequently as he spoke so that Fre Genisioz could keep up, \"that on this day, the foreigner, Germanno, Comide Ragoczy, resident in Toledom, has sworn to me, as King of Aragon and Naverre and son-in-law of Adelfonzuz of Leon and Castile, to undertake a mission for me, to be conducted in the city of Sevallis in the Moorish-held part of Spain; to wit: he will procure the grand house known as Al Catraz and set up Antoninus the Greek as his care-taker there. He is also charged with bringing back to me any and all such dispatches or other items as Antoninus may entrust to him. He is further to leave sufficient funds for Antoninus to run the household of Al Catraz for a period of two years at a standard that will give the Moors no cause to rescind the terms of sale. Failure in any particular will constitute an act of treachery and will bear severe penalties. Attempts to flee from Toledom or Sevallis will bring a death sentence and the seizure of all holdings now owned by Germanno, Comide Ragoczy in all Spain currently in Christian hands. This is my will, and to these terms, Germanno, Comide Ragoczy consents without reservation.\" He stamped his foot as if to punctuate his dictation. \"There must be a place for our names, and a witness, in case anyone brings the agreement terms into question.\"\\n\\n Fre Genisioz scribbled as rapidly as he could and still make a presentable page; he blew on the ink lightly before sanding the sheet. \"There, Liege,\" he said, and looked up at Idelfonzuz, his expression as ingratiating as that of a kicked hound.\\n\\n The King clapped again, calling out, \"Send two of my courtiers to me. Choose any two of those who have sat down at my table today, so long as they can sign their names.\" He laughed as the slaves hurried off, saying to Germanno, \"I wish I could be there to watch them scramble. As hungry as they are, they are more eager to serve me, in the hope of gaining my favor.\"\\n\\n \"And will they, for doing this?\" Germanno asked.\\n\\n \"If it suits me,\" Idelfonzuz answered, his head cocked to the side as he strove to read the words Fre Genisioz had written, sounding them out from time to time. \"Very good,\" he allowed at last. \"You have done well, monk.\"\\n\\n Fre Genisioz ducked his head. \"For that, give thanks to God.\"\\n\\n Idenflonziz shrugged. \"If you want.\"\\n\\n \"Tomorrow my servant will come to receive all permission for the sale-is that what you intend, Liege?\" Germanno asked in the awkward silence that followed.\\n\\n \"It is,\" said Idelfonzuz. \"You will bear the parchments with you, and the assurances we will have from the owner, and that will allow you to purchase Al Catraz. It is named for the-\"\\n\\n \"Seabirds,\" Germanno finished for him. \"I recognized the words.\"\\n\\n \"Yes. Seabirds,\" said Idelfonzuz with a broad smile. \"You do know the tongue, then. You have said you do, but that is not always an assurance to be trusted. I am much encouraged to know you have spoken accurately. Others have told me the same thing, and in the end, it has turned out that they had no such understanding; at most they spoke a few rudimentary phrases that might suffice in the marketplace, but would be of no use elsewhere.\" He scowled. \"And, unlike many I know, I will not ask Jews to undertake such missions for me.\"\\n\\n \"But why not?\" Germanno asked. \"Surely you may put greater trust in Spanish Jews than in one foreign exile.\"\\n\\n \"Jews betrayed Christ; the Church teaches us that. If they will turn against the Son of God, how much lesser a thing is it to betray me?\" He glared in Germanno\u0027s direction. \"Too many of the Castilians have come to trust their Jews, to give them high office and great powers, in the mistaken belief that they will serve their Christian rulers with devotion. But the Jews are not faithful to their Word, and when they go to the Moors, they become like them, given to opulence and luxury, and they forget their vows and purposes, and their Christian rulers come to grief.\"\\n\\n It was tempting to argue with Idelfonzuz, but Germanno kept silent, aware that he knew too little of such things, and convinced that Idelfonzuz was referring to a specific Castilian and a specific Jew. \"The Moors have had their share of betrayals as well, have they not?\"\\n\\n \"It is not a betrayal when a man seeks salvation,\" said Idelfonzuz in a tone that did not encourage more remarks. He pointed toward the inner archway. \"Where are my witnesses? This must be done today.\"\\n\\n Germanno wondered why Idelfonzuz was suddenly so determined to have this agreement on record, but he only said, \"You feed them too well, Liege, and they are loathe to leave their meal.\"\\n\\n \"Sluggards, all of them,\" Idelfonzuz declared loudly. \"What King is as poorly served as I am?\"\\n\\n Since Ragoczy had seen Idelfonzuz embrace the notion that he was ill-used on other occasions, he was not alarmed by this outburst, although he was not eager to have the King continue nursing slights and injuries. \"They should come at your bidding, Liege, whatever they may be doing when you summon them.\"\\n\\n \"Except they are being shriven,\" Idelfonzuz corrected Germanno. \"No King can call a man from his religious duties.\"\\n\\n \"Of course,\" said Germanno, and looked up in relief as he saw two courtiers approaching eagerly. \"There, you see?\" he said to Idelfonzuz. \"Your men know their obligation to you.\"\\n\\n Idelfonzuz did not deign to answer the Comide, but signaled the two to come and put their names at the places Fre Genisioz marked as soon as he and Germanno, Comide Ragoczy had signed the agreement.\\n\\n Text of a bill-of-sale recorded in Toledom for presentation in Sevallis.\\n\\n On the authority of the Church and that of Idelfonzuz of Aragon and Navarre and son-in-law of Adelfonzuz of Leon and Castile, I, Rachmael ben Abbas, formerly of Sevallis, do hereby acknowledge the receipt from Germanno, Comide Ragoczy the sum of forty gold Apostles and seventy silver Crowns as payment in full for the great house known as Al Catraz in the city of Sevallis, to which I have full title and the right to sell it for any amount that I deem acceptable. The monies paid for Al Catraz are sufficient, and in reasonable accord with what a reasonable man would expect to pay in Sevallis, and therefore are not to be challenged by any of those living in the city, or who may believe they should be entitled to occupy the great house Al Catraz.\\n\\n I have prepared statements for all the authorities having interest in such a transaction, bearing witness to my decision to sell the great house and to accept the money paid to me by Germanno, Comide Ragoczy, who will present these proofs upon his arrival in Sevallis. Such furnishings as I have left in the house are his to use or dispose of as he likes. He is to install his own staff, and to that end, I give him permission to sell my slaves for such money as may be reasonable, or to continue to house them in accordance with the laws of Sevallis.\\n\\n Let no one think that this sale is the result of gambling or of coercion or any other sort, for I give my most solemn Word that is not the case. To settle any suspicions that may be attached to my sale of Al Catraz, I will explicate my reasons for offering this great house to a foreigner. This sale was sought by me for the purpose of permitting me to move all my goods and chattels with me into Toulousa, where I have long maintained a factory to transfer goods and spices for me. Now that it is possible for me as a Jew to own land in Toulousa, I intend to operate my business from that location rather than from Sevallis, for Toulousa is more central to my profession than is Sevallis.\\n\\n The lands and grounds of Al Catraz are included in the sale, and all produce of those fields are to become the property of Germanno, Comide Ragoczy. It will be his task to decide how such crops are to be handled, how they are to be planted, changed, rotated, discontinued, or used in any way that suits him. I have placed no binding conditions upon Germanno, Comide Ragoczy, as a condition of this sale, and I hereby forbid others from imposing any such conditions upon him. The lands and grounds of Al Catraz are to be turned over without question to the Comide Ragoczy, and any decision he makes in their regard is to be obeyed as binding and final.\\n\\n In the event that any claim be made against this sale, I stipulate here that the person bringing such an action is to be given one copper Ship for his trouble, and that no other recovery be granted him now or in the future. I further declare that no heir of mine will at any time seek to recover this great house, nor its lands, nor its contents, and that those who proceed in spite of this shall be disinherited entirely, and be as if they were not ever heirs of mine in any capacity whatsoever.\\n\\n To this I set my hand in the City of Toledom in the Christian year of 1117, on the day after the Paschal Mass.\\n\\n Rachmael ben Abbas\\n\\n Spice merchant\\n\\n witnessed by Idelfonzuz, King of Aragon and Navarre and son-in-law to Adelfonzuz of Leon and Castile\\n\\n witnessed by Malachai ben Doron, advocate of Toledom \\n\\n","sourceLink":"https://allnovel.net/come-twilight-saint-germain-13/page-28.html","bookId":2499,"book":{"id":2499,"title":"Come Twilight (Saint-Germain #13)","description":"Storyline: Come Twilight (Saint-Germain #13) \\n Beginning in the 600s, Spain\u0027s old blood rituals of animal sacrifice were replaced by the new gods of Christianity and Islam, who demanded no less obedience and allegiance. Saint-Germain becomes trapped in this cauldron of blood, fear, and faith when, he makes a vampire of the beautiful, haughty, tempestuous Csimenae. \\n Csimenae kills without mercy. She makes vampires without a second thought; and they, \\n For five hundred years, as waves of war and religion sweep over Spain, Csimenae hunts until her marauding, willful ways expose her vampiric nature. Saint-Germain\u0027s centuries of life have taught him that to fall out of step with history is to risk the True Death, a fate Saint-Germain wishes for none of his kind. He must try to save Csimenae-and her clan-but at what price?\\n","cover":"https://allnovel.net/images/come-twilight-saint-germain-13.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/come-twilight-saint-germain-13.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:55:21 PM"}}
