{"id":106348,"no":36,"title":"Page 36","content":"Text of a letter from Atta Olivia Clemes in Roma to Hiermon Ragoczy in La Chappelle; written in the Latin of Imperial Rome.\\n\\n To my dearest, most worrisome friend, greetings from the new Circus Romana where the Church has been providing the entertainment in place of the charioteers, gladiators, and wild beasts of old.\\n\\n Anacletus II has taken over San Pietro\u0027s while Innocentus II has occupied the Lateranus. One has a choice of Popes, and that has brought a looseness to Roma that has not been in the city for many years. I tend to see Anacletus as the better of the Pontiffs whether or not he is a converted Jew; he is better educated and far more capable of handling the complexities that are encumbering the Church, particularly the uproar that has resulted from the new prohibition on priests marrying. Innocentus is little more than a tool of Lothair II, the Holy Roman Emperor, but he has armed men to support his claim. What an array of II\u0027s we have, to be sure; two Popes and an Emperor, all the second of that name. Were I an Arab mathematician, no doubt I should find some significance in this. As it is, I find it both diverting and lamentable.\\n\\n What is there in the edge of the Low Countries that offers half the amusement of what we now have here in Roma? You may say what you like about the change in trade, or the civil war in Britain, I know I am having a livelier time than you. Consider coming to join me here. I will not be departing for another year or so-I am too much delighted by the chaos being stirred by the Church, and all in the name of preserving the succession from San Pietro to the present. At least the Caesars were open in their ambition.\\n\\n Are you still planning to try to find the last of Ximene\u0027s tribe? I will tell you again that such an act would be absolute folly. Let well enough alone. If they enlarge their numbers, then you will have every reason to seek them out, but until then, trust that they profited by her errors and have learned not to flood the world with vampires. I have heard nothing from the Toulousa region, where you say you think they have gone. Why draw attention to them by searching them out? The Church would take immediate advantage if it was discovered that there were undead creatures to hunt; think of how much more important the Church would become if people thought they had to be protected from our kind. I understand that you believe you are under obligation to them because Ximene has not instilled in them a sense of proportion. Why you should have such a responsibility, when it is she who did not show them the danger of their nature, I cannot comprehend. Still, I am not astonished that you have taken the duty upon yourself.\\n\\n Consider the risk you will run to do this. I ask you. They may be able to manage without your instruction, but I am not certain that I can. If not for your sake, then for mine, do not expose yourself to the wrath of the living. Barring that, give me your oath that you will stay on the north side of the Pyrenees. As dangerous as Toulousa may be, Spain is infinitely more so. Promise me you will not cross into that thrice-cursed region of Holy Blood. Ximene may be right, and the peasants there may forget her and her tribe in time, but even you would agree that not enough has passed. Help those in Toulousa if you must, but leave those in Aragon and Barzelunya to their fates.\\n\\n You may think me hard-hearted to ask this of you, and truly, I may be. But, Sanct\u0027 Germain, I would be neglecting my obligation to you if I did not caution you in this venture of yours. You are not the only one who has a debt to honor; since you brought me to life, I have known that I owe more to you than I can ever repay. So, if you insist on placing yourself in harm\u0027s way, I will take it upon myself to inform you of the hazards you face. Do not chastise me for it: you have earned my concern.\\n\\n I have sent Niklos Aulirios to Alexandria to find out if there is any way I might arrange to purchase property there. I would like to have a place to go that is not in the lands of the Church, but I am worried that the followers of the Prophet are no more reasonable that the followers of Christ. There are many things I miss about the Roma I knew when I was one of the living, yet I miss none so much as the laws which once allowed women their own estates and property. To have to continually invent late husbands or missing brothers is not only an annoyance, it is an insult as well. But at least Niklos is capable of smoothing over those inconveniences as much as may be done. If he discovers a way for me to secure property that is not too convoluted, then I shall go there, and hope I will be able to avoid any of the intrusions that religion continues to make on those of us who would rather not be bothered by it.\\n\\n What I shrew I have become, and a carker, as well. I would not be amazed if you stopped reading before you reached this point. If you are still with me, I must tell you that I miss you, and I would be glad of seeing you at any time, in any place you may select, even in the distant lands of the Silken Empire-where you have gone, although I have not. Choose where you wish to meet and I will find the means to be there. In spite of the confusion in Roma, I would be delighted to have you with me, and would sacrifice my entertainment here for your company.\\n\\n With my affection and my-however unwished-for-guardianship, I sign myself,\\n\\n Your most enduring, most fond,\\n\\n Olivia \\n\\n","sourceLink":"https://allnovel.net/come-twilight-saint-germain-13/page-36.html","bookId":2499,"book":{"id":2499,"title":"Come Twilight (Saint-Germain #13)","description":"Storyline: Come Twilight (Saint-Germain #13) \\n Beginning in the 600s, Spain\u0027s old blood rituals of animal sacrifice were replaced by the new gods of Christianity and Islam, who demanded no less obedience and allegiance. Saint-Germain becomes trapped in this cauldron of blood, fear, and faith when, he makes a vampire of the beautiful, haughty, tempestuous Csimenae. \\n Csimenae kills without mercy. She makes vampires without a second thought; and they, \\n For five hundred years, as waves of war and religion sweep over Spain, Csimenae hunts until her marauding, willful ways expose her vampiric nature. Saint-Germain\u0027s centuries of life have taught him that to fall out of step with history is to risk the True Death, a fate Saint-Germain wishes for none of his kind. He must try to save Csimenae-and her clan-but at what price?\\n","cover":"https://allnovel.net/images/come-twilight-saint-germain-13.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/come-twilight-saint-germain-13.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:55:21 PM"}}
