{"id":106320,"no":8,"title":"Page 8","content":"Over the next few months as summer swelled and began to wane, another twenty-seven villagers returned, and twenty-five of them were willing to kiss Aulutis\u0027 foot and swear their allegiance to him in order to stay. The two who refused cursed Csimenae and swore vengeance upon her, promising terrible ruin for her and her son, who had not been bathed in the blood of a sacrificial horse; they had come at the end of summer, and Csimenae had assumed the threat of winter would incline them to make their vows to Aulutis. When they refused, she had pointedly ignored them, laughing as they execrated her name and the whole line of Aulutis. Only when they had gone and she was alone in her house did she give way to the tears that had almost overwhelmed her. She sat in the single chair and held Aulutis close to her while she did her best to stifle her sobs. \"You have been very brave,\" Sanct\u0027 Germain said to her as he came through the narrow rear door that led to the barn and the sheepfold. \"What are you doing here?\" she demanded, her voice shaking with her effort to control it; she put both her arms around Aulutis. \"I have finished my chores and I feared you might be in some distress. Rilsilin told me what happened at the gates.\" He had expected such a confrontation, but had not thought it would come so soon. She looked up sharply, glowering as she wiped her eyes. \"I am angry. I weep when I am angry.\" \"No doubt,\" said Sanct\u0027 Germain. \"Others before you have done the same.\" \"No one should see me cry,\" she said earnestly, still glaring at him. \"They think when women cry, it is a sign of weakness, not of fury. If I had horses, they would know better. I would make a sacrifice that all would remember.\" She began to rock Aulutis, calming him and herself at the same time. \"Rilsilin said that five men refused to make their vows to your son,\" Sanct\u0027 Germain went on. \"Five? What five would be so defiant?\" She did not quite laugh, but the barking sound she made might pass for harsh amusement to someone listening outside. \"Two; just two. One was Dantho, who keeps...kept the olive trees. He said he is entitled to rule here, not my son. He says as long as the trees are growing he has the right to rule.\" \"And did he rule here before the Great Pox?\" Sanct\u0027 Germain asked, watching her more closely than she knew. \"His cousin did. Occathin. He and his father before him. My grandfather was lord here until he brought a foreign wife to the village; he was disgraced by her. Before then, it was the old priests who ruled here. Occathin\u0027s father changed that, more than my grandfather could. He was head of the woodsmen. Dantho says that Occathin lost his sight and has gone to a monastery where the monks will take care of him. The other was Barago, who trapped animals for their hides. He has no importance here. No one will mind if he stays away.\" She had mastered herself now, and she sat up straight. Her face was alert and she spoke with banked emotions. \"Occathin\u0027s sons have gone to one of the Gardingi, to find a living for themselves. His daughters have been given to their men.\" Her chuckle was more successful than her laughter had been. \"The horses did not hold much honor in his sacrifice, and those men have no interests here, not with Occathin gone.\" \"Did Dantho say so?\" Sanct\u0027 Germain could see the corners of her mouth pull down and the edges of her eyes tighten. \"No. Dantho says that all of Occathin\u0027s blood will come to claim what is theirs. As if they have a right to any of this.\" She held up her head. \"You do not know what scorn I feel for all of them.\" \"I may have some idea,\" he said, his tone lightly ironic as a way to shore up her flagging spirits; some of his own memories were equally harsh, but he did not speak of them. She wiped furiously at her eyes. \"I do not want them here. If they despise me, let them live in the forest, with the rest of the beasts.\" Her face tightened. \"The signs are for an early winter. Perhaps they will starve.\" \"Perhaps they will have to ask you to take them in,\" Sanct\u0027 Germain suggested, his gaze enigmatic. She let out a single exclamation of derision. \"Let them in? Why should I do anything so foolish? They have chosen their way.\" As Aulutis began to cry, she rocked him automatically, but did little else to comfort him. \"It might be prudent to show them clemency, should they ask for it, for the sake of the other returning villagers,\" he said, taking care not to argue the point. He glanced at the shelves that served as a pantry, and noticed that there were very few bits of bread left. \"Have the monks sent any more flour?\" \"Not yet,\" she said, not looking at him. \"We have not made a donation, so they-\" \"If you need a few coins for the donation, I will provide them. You will want the flour shortly, or the rains will make it hard to fetch the barrels up muddy tracks.\" He realized he should have tended to this on his own, that she would never ask anything of him for fear of being beholden to him. \"Why should you pay for flour when you eat no bread?\" she challenged, daring now to look him full in the face. \"It would be better to let me have one of your two horses, for a true sacrifice.\" \"I want the flour for the sake of the village,\" he said quietly. \"I do not plan to leave here before spring, and perhaps not then. Why should I want to see all of you starving simply because my appetites are not what yours are.\" He came a few steps closer to her. \"Tell me you will let me do this for you, as a sign of my devotion to Aulutis.\" Her voice and her manner were sharper. \"Why should Aulutis have it as a sign of anything?\" \"Because he is a baby; one day soon he will eat bread and cheese, as you do. It would be best if you have bread to give him when that time comes. You have not enough of a crop planted to provide bread for more than a week or two after you harvest it.\" He did not change his demeanor, but something in his compelling gaze convinced her. \"All right. Since you will be here until spring, and perhaps longer.\" She cocked her head. \"Why do you want to stay so long? You do not have to remain, and yet you do. There must be a reason. Are you seeking a haven from the Gardingi, or the Church?\" It was the first time she had broached the matter so directly, and she regarded him with interest as he answered. \"I am sure there are Gardingi who would be pleased to detain me because I would be of use to them. And I am certain there are monasteries where the monks would be glad to command my skills. But I left Toletum with the good-will of the Episcus and the Jews, and no one has countermanded their good words-no one that I know of.\" He sighed, knowing she expected more. \"I told you that I am an exile, that I am going to Tolosa where I have holdings. I have a blood relative in Rome, and I may visit there to show honor to-\" \"Yes, yes,\" she said impatiently. \"But it is still odd to me that you would prefer to stay in this place than go to Tolosa.\" \"If the roads are in bad repair, I would have to stay in another village on another road in another part of the mountains. This one is as good as any of them.\" He smiled briefly. \"And here I have been made to feel welcome.\" \"Because you are useful,\" said Csimenae. \"Fetching flour is useful,\" he pointed out. \"I will believe you because it suits me to believe you,\" she said at last, stroking her child through the worn linen of his tunica. \"And because my son will need bread come spring. So will the villagers. In better times this would not be necessary, for the villagers would have planted enough grain to make bread of their own to last all through the winter. Well. They have sworn allegiance to my son, and in his name I must take care to see they are taken care of.\" Sanct\u0027 Germain saw her quick frown. \"Do you want to send word to the monastery at Templo Antica? It is near Osca. They have flour to sell.\" \"If you will go there and bring back what we will need, I will be grateful. I will not ask for either of your horses if you do this for us. And if you go and do not return, I will know you for a miscreant and a liar.\" Csimenae showed her teeth. \"Your manservant will remain here, of course.\" \"Of course,\" Sanct\u0027 Germain echoed, and busied himself with tending to the herbs hung out to dry on the doors of the pantry. He thought of her precarious situation, wondering what else she could do if she was going to maintain her authority. \"I will tell the villagers that this is your wish that I fetch the flour.\" \"Why?\" She was suspicious as well as surprised. \"Because this is your home, as you have reminded me often.\" He gave her a long moment to consider this. \"I am a stranger here, and anything I do is questioned: you are not the only one to have doubts about me, Csimenae. I know I am not wholly welcome among you. I am useful, which gives me some credibility, but not very much. I am little more than tolerated. Yet the villagers comprehend your wishes, and respect them; anything you do is to ensure your position and the position of your son for the future. No one questions this. So your decisions are not regarded as suspect.\" In the silence that followed, he left her alone with Aulutis while he went out to the market square, searching for Rogerian; he looked about the village until he found his manservant in the creamery, washing curds and turning the ripening cheeses on their shelves. When he finished explaining the mission he was about to undertake, he said, \"I will send a few letters from the monastery while I am there. I should be able to find men willing to carry them for me if I pay them for the service; if I am careful in my choice of messengers, one or two should reach their destinations.\" \"Why do you do this for her?\" Rogerian asked in ancient Greek. \"She is fighting a very lonely battle, and the odds are against her,\" Sanct\u0027 Germain replied in the same language. \"I know how difficult that can be.\" Rogerian said nothing while he tapped one of the cheeses. \"It is almost ready. There is an ample supply here.\" \"Good,\" Sanct\u0027 Germain approved. \"The winter is going to be hard, I think. The more foodstuffs we can prepare, the better.\" \"And you?\" Rogerian inquired. \"What plans have you made for providing for yourself during the winter?\" \"I will hunt, as I have done,\" said Sanct\u0027 Germain calmly. \"It is not sufficient, not if you limit your feeding to animals. You have said as much yourself, many times. You may not wish to admit it, but you are losing flesh, as you do when you are deprived of...touching. Why do you remain here if you are reduced to this?\" His eyes were worried. \"Do you seek that from her?\" Sanct\u0027 Germain understood his deliberately vague reference; he shook his head. \"It hardly matters: she does not seek it from me.\" \"Then why do we remain here?\" Rogerian persisted bluntly, unaware he was echoing Csimenae\u0027s question. \"This place is the edge of nothing. You could be in Rome, or in Tolosa, or in your homeland, for that matter, and you would be-\" He broke off, seeing something haunted in Sanct\u0027 Germain\u0027s dark eyes. \"I would be as much a stranger there as I am here. I would have to find a means to make myself acceptable. At least in this place I am useful. And there are no invaders pouring down the slopes, or harrying up them, for that matter, and no barbarians seeking slaves and livestock, as there are from my homeland to the Frankish uplands. You recall what it was like there, only twenty years ago; there is no reason to think it has improved. Here, at least, I have no greedy men watching me in the hope of increasing their riches through claiming mine. I have no one watching me and reporting to others for his own benefit, as we had in Toletum. We tolerated it because it was necessary, but I am pleased not to be perused so relentlessly. There are few havens we could find as accessible as this one, and both you and I know it. If I must live on the blood of animals for a time, what harm is there?\" His wan smile was vastly troubling to Rogerian, who spoke to him in Latin. \"When do you plan to leave to get the flour?\" It was a safe question, and one that could be overheard without causing alarm. \"In a day or two: within a week, most certainly. I have to hunt tonight, I think; tomorrow I will make arrangements.\" Sanct\u0027 Germain did his best to encourage Rogerian. \"Do not fret, old friend. We will be gone from here soon enough. A week, a year, both are gone in no time.\" This did nothing to reassure Rogerian; he continued to work with the cheeses. \"When that time comes, I will be ready,\" was all he allowed himself to say. \"I take your meaning,\" Sanct\u0027 Germain assured him, doing his best not to feel tired, although a sensation like fatigue insinuated itself through him. \"And I will consider your apprehension.\" For an instant, Rogerian hesitated, then asked, \"Do you miss Viridia?\" Sanct\u0027 Germain nodded. \"And Nicoris, and Olivia, and-\" He made himself stop. \"I could not bring Viridia to my life; that does not mean I have no love for her, or that I have forgot her.\" Rogerian kept himself from saying anything more, for he knew it was of no use. He went on with tending the cheeses, finally saying, \"I will see your horse is ready when you need him.\" \"And a mule,\" Sanct\u0027 Germain recommended. \"I will need both if I am to bring back enough barrels to carry the village through the winter.\" \"As you say,\" Rogerian conceded. Sanct\u0027 Germain spent the rest of that afternoon in the house Csimenae had allocated for his use; he busied himself making compounds of herbs and olive oil and wine that could be used to treat many ills, and which he supposed would be necessary to get the village through the winter, for he knew from long experience that cold and pernicious coughs traveled together, as heat and bad air did. This activity satisfied him, for it provided him with the means to occupy himself as well as demonstrate his value to the people around him. Over the centuries, he had been calmed and soothed by preparing medicaments; the afternoon faded quickly as he went about the familiar work. By twilight, he had done as much as he could with the little equipment he had, and reluctantly he put his materials away, thinking he would soon have to gather herbs or accept more shortages still. Now he missed his athanor and his reductio almost as much as he missed having moldy bread, from which he made his sovereign remedy against all fevers. At another time, he might have built a small athanor, but in Mont Calcius, he doubted the villagers would tolerate so foreign an object being used inside their walls, no matter what its potential benefit might be. So he would have to content himself with the compounds he could cook up in a pot over the fire. At least, he told himself, he would soon have moldy bread; it was a consolation of sorts. Night sent the villagers indoors, and the odor of cooking filled the dusk. Last chores were done in pens and the barn as the livestock were bedded down for the night. One of the villagers walked down the two streets calling out the names of those inside, and making a record of all replies. This was soon followed by darkness in the houses, and a breathing silence that was as familiar to Sanct\u0027 Germain as the pull of blood. When Rogerian came in from tending to the animals, Sanct\u0027 Germain greeted him in passing. \"I am going after goats tonight, I think.\" \"I will be ready to dress your kill, as soon as you bring it back,\" said Rogerian. \"There is not much meat left in the village.\" \"I am aware of that,\" Sanct\u0027 Germain said, adding, \"If there is time, I will try for a second animal.\" \"Good hunting,\" Rogerian said without a trace of irony in his voice. Sanct\u0027 Germain slipped out into the night, his black hippogaudion and black Persian leggings making him one with the shadows and the dark, his movements flexible as a cat\u0027s, as fluid as a shadow. He knew his way through the trees now, and he went swiftly toward the glades where the wild goats could be found; he was anticipating an easy kill, one that would feed his hunger and provide for the village, allowing him half the night to find other game that would serve as surplus, and one that was much needed if winter came early. Before he reached the little meadows, he sensed something was wrong-the night was too still, and the air too alive. He approached the clearing cautiously, testing the air as he went. Then he stopped moving, his attention fully on the sounds that came from the place where he expected to find goats, for he heard men\u0027s voices instead of bleating, and in a short while he saw the wavering light of a single torch. \"-could burn the gates down,\" one of the men said, raising his voice to be heard. \"It would have to be at night,\" said another. \"There aren\u0027t enough villagers to keep a proper guard. They do not watch after the mid-point of the night, and that watch is kept by one of the foreigners.\" \"Not...for the baby,\" quipped a third, some of his remark so quiet that Sanct\u0027 Germain could not hear it; whatever he said was seconded by laughter. \"We\u0027ll roast him on a spit,\" said the second speaker, his tone venomous. This was met with chuckles and muttered approval from more than a dozen voices. \"And that mother of his, we\u0027ll-\" This speaker broke off, laughing nastily. \"Save her for an offering,\" suggested a man with a gravelly tone. \"After we have done with her.\" The others chuckled again, more angrily; Sanct\u0027 Germain took advantage of the sound to move a little nearer to the clearing. \"Tomorrow night, then: we\u0027re agreed?\" This was a fourth man. \"It\u0027s time we took back what is ours. Occathin\u0027s kin should rule in Mons Calcius, not this stupid woman.\" \"We must drink the blood of horses,\" said the gravel-voiced man. The rest muttered agreement. \"Then we must get our weapons in order. A pity we have only the one small ram, but it will knock down the sheepfolds and the barndoors.\" The second man relished what lay ahead. \"Those who fight us will die or be our slaves.\" \"That\u0027s right,\" the first man declared. \"It should have been ours all along.\" Sanct\u0027 Germain slid back into the forest, skirting the clearing; he would have to return to the village by a round-about path, in case these men should decide to venture up to the walls in preparation for their coming attack. He paid only cursory attention to game in the forest, telling himself he would hunt later, after Mont Calcius was ready to fight off the men in the woods. As he scaled the walls, he was struck by an unpalatable thought: the men in the forest must have someone inside the village to keep them informed of what was happening in the town; they had known he and Rogerian patrolled the village at night, and the implications of that knowledge burgeoned in his mind. As cautious as he had been, he now felt he had been careless. He landed near the house he occupied, and waited a moment until Rogerian came out of the main door. \"There is trouble,\" he said quietly. \"So it seems,\" said Rogerian. \"You bring no game.\" \"It may be a fortunate thing that I do not; I have come upon something more important than meat in my hunt,\" Sanct\u0027 Germain said, going on steadily. \"There are men gathering in the forest who plan to attack the village. I found them in a clearing and overheard some of their talk.\" He paused. \"From what they said, they have at least one spy inside the walls. I had hoped we were done with spies.\" Rogerian did not look astonished. \"They have blood ties to the people here,\" he said. \"You, of all men, should appreciate that.\" \"I do,\" Sanct\u0027 Germain said with irony to match Rogerian\u0027s. \"What do you think? Are those men in earnest?\" Rogerian prompted. \"What are you going to tell Csimenae?\" \"About the coming attack?-as much as I can. About the spy, I have not made up my mind. I do not know what she will believe.\" He began to pace. \"My accusation would mean little, since I am an outsider. But she must be alerted to the presence of the spy, or it is useless to plan our defenses.\" \"Then you are going to help her fight,\" said Rogerian, his certainty so strong that Sanct\u0027 Germain paused in his pacing and stared at him. \"You could leave, could you not?\" \"Of course I could, but I will not,\" he replied sharply. \"Why should I put the village in danger because I fear for my skin?\" Rogerian did not quite smile. \"Apparently you do not think that reason enough to leave, though nothing holds you here.\" He touched his forehead lightly in a gesture of acquiescence. \"I am not surprised.\" \"You know me too well, old friend,\" said Sanct\u0027 Germain. \"I have had time to know you,\" Rogerian pointed out. \"I would have been surprised had you decided to leave.\" \"That is a compliment of sorts, I suppose,\" said Sanct\u0027 Germain. Making up his mind, he started off toward Csimenae\u0027s house. \"Come. She should hear of this now.\" \"Will not waking her in the dead of night alarm her?\" Rogerian suggested as he followed Sanct\u0027 Germain. Sanct\u0027 Germain walked a bit faster as he answered, \"I should hope it would.\" Csimenae answered her door promptly enough to suggest that she had not been sleeping; her eyes were brilliant and she moved decisively to block their way. She held Aulutis in the crook of her arm as she regarded Sanct\u0027 Germain uneasily, her face faintly illuminated by the single oil lamp that burned just inside her door. \"You have no game,\" she said, making it an accusation. \"No; I have something of greater import than that.\" He did not try to cross her threshold, in case someone else should be awake at this hour, and watching. \"You must, to come to my house at this hour. If the villagers find out, they will say my grandfather has cursed our family again.\" She lifted the edge of her tunica so that Sanct\u0027 Germain could see the long knife thrust through her belt. \"I will not let you do anything that would call me into question.\" \"Nor would I,\" Sanct\u0027 Germain said. \"It is not my purpose to discredit you.\" He saw her eyes sharpen. \"Yes. You must hear me out: there was more than game in the forest tonight,\" he told her, and went on to relate what he had stumbled upon. \"I think there are a fair number of them; a dozen or perhaps more. Mont Calcius is not the only village to lose its people. It is possible a number of them have banded together with the intention of claiming this place as their own.\" She stared at him, outrage distorting her features. \"How dare they?\" she demanded of the darkness. \"I gave them the chance to return, and they do this to me.\" She lifted her son up so that his head was on her shoulder. \"They would deprive Aulutis of what is his.\" \"They want the village,\" said Sanct\u0027 Germain. \"They will not hesitate to kill you-and your boy-to claim it. They know they must do that or fight again.\" He saw her flinch, and added, \"They would do the same to anyone holding this place if they wanted to make it theirs.\" She nodded. \"We must prepare. You were right to warn me, Sanct\u0027 Germain,\" she said, her manner transformed again, this time by diligence. \"Will they come tonight?\" \"No,\" Sanct\u0027 Germain assured her. \"That is good,\" she said. \"I will have a little time to ready my people to withstand the attack.\" She was about to go inside her house when Sanct\u0027 Germain stopped her. \"You will not want to be too obvious about what you are planning,\" he said, and, as he saw her frown, he continued, \"They expect to attack an undefended village. It is best that they continue to think the place undefended, for that gives you an advantage against them, for they will be surprised, not you.\" Csimenae stood quite still as she considered this. \"An undefended village. Yes. You have a point,\" she conceded at last. \"I must think about this, to decide what is best for Aulutis. At least we have your horses, and your mules: better than nothing. If we must, we will take one for a sacrifice, but only if we must. You did well to come to me, and to give me your thoughts. Now it is for me to decide what is best for my son.\" With that she closed her door, leaving Sanct\u0027 Germain and Rogerian in the darkness. After a while, Sanct\u0027 Germain said, \"I had better hunt in a different part of the forest tonight.\" \"You are going out again?\" Rogerian was almost shocked at this calm announcement. \"Because there are desperate men in the forest does not lessen our need for sustenance.\" Sanct\u0027 Germain shrugged. \"They will need meat if they are to fight.\" \"And you will need blood if you are to endure the daylight,\" Rogerian said, turning away and starting back toward the house they occupied. \"Yes,\" Sanct\u0027 Germain said before he sprinted for the walls. \"I will.\" Text of a letter from Frater Morduc, Scribe of the Archangeli monastery to Episcus Honorius of Caesaraugusta. Now may God be praised for your delivery from the Great Pox, my half-brother, and may He continue His Favor to you for all of your days. Amen. We of Archangeli monastery have prayed day and night for all Christians struck with the Great Pox, and finally, our faith has prevailed. Amen. There has been no new case of Great Pox for more than a month, and the few travelers we see at this place have all given testimony that the Great Pox is everywhere in retreat. No one has come here to escape the Great Pox in more than a month, as well, and we have heard no tales of more outbreaks. For this we are most truly grateful. Amen. To the most eloquent Episcus of Caesaraugusta, Honorious, the greetings of Frater Morduc, with the assurances of my continued devotion to the Church we both serve and the family whose blood we share: your own plight was reported to us some months ago, and therefore we have been diligent in the exercise of our faith in the hope that God would spare us, and you, and all those worthy souls who must guide the work of God before the Last Days are upon us. It was most troubling to learn of your ordeal, for if God visited so much upon you, who are known for the holiness of your life, what could such men as ourselves expect? We have striven to endure our travail in patience and in humility. Our own numbers are decreased, although we rejoice that so many of our Fraters are called to see God\u0027s Face; we have much to do to maintain this place with so few monks remaining to do the tasks once shouldered by half-again as many as now abide here. Not that we do not thank God for our lives every day, for we do not question His Wisdom, nor do we seek any attainment beyond the fulfillment of our vows to Him, and to Holy Church. It would ease our conditions if you would encourage the Gardingi on the road between Caesaraugusta and Roncesvalles to allocate men to rebuild the road, for as it is now, few travelers are able to transverse these mountains. Ours is not the only monastery left in isolation because of the neglected roads. We have heard those few, intrepid men who have made the journey in spite of all, say that without immediate efforts, the passage will be more arduous next year. If the road were in better repair, we might have more men to use it, to bring alms to the monastery, and to add their tolls to the coffers of the Gardingi. You are in a most favorable place in this respect and I beseech you, my dear half-brother, to prevail upon the Gardingi and Exarchs of your region to participate in this necessary work. Certainly the Great Pox has robbed the Gardingi of men, as it has robbed this monastery of monks, but it is fitting and right that the road be restored, for without it, many of the villages along the way will lose their ties to the Church and the Gardingi, and become what they were before Salvation-wild tribes of savages preying upon one another and upon any who venture into their territories. This cannot be seen as anything but the triumph of the Devil, and the denial of the Greatness of Our Lord. What benefit could that be? Yet if the Gardingi do not act, it could yet come to pass, and that would be a great misfortune for us all. We are informed that the men of Tolosa have ordered their portion of the road restored to full use; you cannot want it said that Franks will do what Goths will not. I am certain that if the Gardingi and Exarchs know of this, they will strive to see that the road is again in as good repair as when the Romans of old first laid its foundations. Pilgrims and merchants alike will benefit from the road being repaired, and so will the Gardingi, whose men will not have to make their way along the goat-tracks that pass for roads among the people of the mountains. This will be useful to everyone. You may well fear that the Exarch will not be willing to grant money for such a task, and that may be true, but he can assign men to the work as part of their vassalage. We here at Archangeli have a few monks and tertiaries working on our portion of the road, but there is not much we can do, given our numbers and our lack of equipment. The road-bed has washed away in some of the steeper sections, and until we can restore the bed-work, the problem is going to continue; to fill in the damage is useless, for it will only wash away again with the first rains. No one can keep the road in repair for its underpinnings are gone. Tell your Gardingio and Exarch that there could be an avalanche that would bring down the whole of the road that would render it unusable and unrepairable for years to come. Such an avalanche could also damage various forts and watch-towers if it struck a wide enough part of the mountain, which would mean trouble for the Gardingi as well an for the Exarchs. It is a danger that is very real, as we have seen with our own eyes. May God spare us from such a calamity. To that end, I implore you to impress upon the Exarchs and Gardingi the necessity of seeing this task attended to in good time. Without the road, these mountains are as remote as the hills of Jerusalem. It may be that there is protection in such remoteness, for the Franks of Tolosa cannot bring armed men over the mountains without roads, but neither can merchants nor monks nor scholars travel as they are wont. If the road is left to wash away, all the mountains will become the harbor of wild men and the bands of robbers who even now roam the crags and valleys for the purpose of looting and killing. Surely the Exarchs cannot want this. Surely the Church cannot support so ruinous a policy. I urge you, in the name of the family to which we both are bound, to prevail upon the Gardingi and Exarchs to act now, before there is complete disintegration in these mountains, to commit themselves to keeping the road open, maintained, and safe. To do otherwise would leave the Church exposed and the markets empty of goods, which serves no purpose but to return the country to a state of barbarism. As great as the dangers have been in the past, if the road is in poor repair, there will be worse for all to bear who live along the road. May God send you to know the right in this and in all things. May He reveal Glory to you, and bestow His Grace upon you and your sons. May He maintain your community of Christian souls in virtue. May you live in favor and die in Salvation. May you know honor in this world and the exaltation of Paradise in the next. May your flesh be proof against all illness and sin. May your prayers have the power of the Saints in them. May your name by praised from generation to generation until the Last Days. Amen. Frater Morduc, Scribe and kinsman at Archangeli monastery near Roncesvalles, on the 29th day of August in the 622nd year of God\u0027s Incarnation, according to Sanct\u0027 Iago\u0027s calendar","sourceLink":"https://allnovel.net/come-twilight-saint-germain-13/page-8.html","bookId":2499,"book":{"id":2499,"title":"Come Twilight (Saint-Germain #13)","description":"Storyline: Come Twilight (Saint-Germain #13) Beginning in the 600s, Spain\u0027s old blood rituals of animal sacrifice were replaced by the new gods of Christianity and Islam, who demanded no less obedience and allegiance. Saint-Germain becomes trapped in this cauldron of blood, fear, and faith when, he makes a vampire of the beautiful, haughty, tempestuous Csimenae. Csimenae kills without mercy. She makes vampires without a second thought; and they, For five hundred years, as waves of war and religion sweep over Spain, Csimenae hunts until her marauding, willful ways expose her vampiric nature. Saint-Germain\u0027s centuries of life have taught him that to fall out of step with history is to risk the True Death, a fate Saint-Germain wishes for none of his kind. He must try to save Csimenae-and her clan-but at what price?","cover":"https://allnovel.net/images/come-twilight-saint-germain-13.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/come-twilight-saint-germain-13.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:55:21 PM"}}
