{"id":29527,"no":14,"title":"Chapter 12 The Woodpecker","content":"The Challenge — Moving Mountains - The Many Uses of Cabbage — The Board Debates - Mr Lipwig on his Knees - The Smoking Gnu - The Way of the Woodpecker It was the next morning. Something prodded Moist. He opened his eyes, and stared along the length of a shiny black cane, past the hand holding the silver Death’s head knob and into the face of Lord Vetinari. Behind him, the golem smouldered in the corner. ‘Pray, don’t get up,’ said the Patrician. ‘I expect you have had a busy night?’ ‘Sorry, sir,’ said Moist, forcing himself upright. He’d fallen asleep at his desk again; his mouth tasted as though Tiddles had slept in it. Behind Vetinari’s head he could see Mr Groat and Stanley, peering anxiously round the door. Lord Vetinari sat down opposite him, after dusting some ash off a chair. ‘You have read this morning’s Times,’ he said. ‘I was there when it was printed, sir.’ Moist’s neck seemed to have developed extra bones. He tried to twist his head straight. ‘Ah, yes. Ankh-Morpork to Genua is about two thousand miles, Mr Lipwig. And you say you can get a message there faster than the clacks. You have issued that as a challenge. Most intriguing! ‘Yes, sir.’ ‘Even the fastest coach takes almost two months, Mr Lipwig, and I’m given to understand that if you travelled non-stop your kidneys would be jolted out of your ears.’ ‘Yes, sir. I know that,’ said Moist, yawning. ‘It would be cheating, you know, to use magic’ Moist yawned again. ‘I know that too, sir.’ ‘Did you ask the Archchancellor of Unseen University before you suggested that he should devise the message for this curious race?’ Lord Vetinari demanded, unfolding the newspaper. Moist caught sight of the headlines: THE RACE IS ON! ‘Flying Postman’ vs. Grand Trunk ‘No, my lord. I said the message should be prepared by a well-respected citizen of great probity, such as the Archchancellor, sir.’ ‘Well, he’s hardly likely to say no now, is he?’ said Vetinari. ‘I’d like to think so, sir. Gilt won’t be able to bribe him, at least.’ ‘Hmm.’ Vetinari tapped the floor once or twice with his cane. ‘Would it surprise you to know that the feeling in the city this morning is that you’ll win? The Trunk has never been out of commission for longer than a week, a clacks message can get to Genua in a few hours and yet, Mr Lipwig, people think you can do this. Don’t you find that amazing?’ ‘Er . . .’ ‘But, of course, you are the man of the moment, Mr Lipwig,’ said Vetinari, suddenly jovial. ‘You are the golden messenger!’ His smile was reptilian. ‘I do hope you know what you are doing. You do know what you are doing, don’t you, Mr Lipwig?’ ‘Faith moves mountains, my lord,’ said Moist. ‘There are a lot of them between here and Genua, indeed,’ said Lord Vetinari. ‘You say in the paper that you’ll leave tomorrow night?’ ‘That’s right. The weekly coach. But on this run we won’t take paying passengers, to save weight.’ Moist looked into Vetinari’s eyes. ‘You wouldn’t like to give me some little clue?’ said the Patrician. ‘Best all round if I don’t, sir,’ said Moist. ‘I suppose the gods haven’t left an extremely fast magical horse buried somewhere nearby, have they?’ ‘Not that I’m aware, sir,’ said Moist earnestly. ‘Of course, you never know until you pray.’ ‘No-o,’ said Vetinari. He’s trying the penetrating gaze, Moist thought. But we know how to deal with that, don’t we? We let it pass right through. ‘Gilt will have to accept the challenge, of course,’ said Vetinari. ‘But he is a man of . . . ingenious resource.’ That seemed to Moist to be a very careful way of saying ‘murderous bastard’. Once away, he let it pass. His lordship stood up. ‘Until tomorrow night, then,’ he said. ‘No doubt there will be some little ceremony for the newspapers?’ ‘I haven’t actually planned that, sir,’ said Moist. ‘No, of course you haven’t,’ said Lord Vetinari, and gave him what could only be called . . . a look. Moist got very much the same look from Jim Upwright, before the man said: ‘Well, we can put out the word and call in some favours and we’ll get good horses at the post houses, Mr Lipwig, but we only go as far as Bonk, you know? Then you’ll have to change. The Genua Express is pretty good, though. We know the lads.’ ‘You sure you want to hire the whole coach?’ said Harry, as he rubbed down a horse. ‘It’ll be expensive, ‘cos we’ll have to put on another for the passengers. It’s a popular run, that one.’ ‘Just the mail in that coach,’ said Moist. ‘And some guards.’ ‘Ah, you think you’ll be attacked?’ said Harry, squeezing the towel bone dry with barely an effort. ‘What do you think?’ said Moist. The brothers looked at one another. ‘I’ll drive it, then,’ said Jim. ‘They don’t call me Leadpipe for nothing.’ ‘Besides, I heard there were bandits up in the mountains,’ said Moist. ‘Used to be,’ said Jim. ‘Not as many now.’ ‘That’s something less to worry about, then,’ said Moist. ‘Dunno,’ said Jim. ‘We never found out what wiped them out.’ Always remember that the crowd which applauds your coronation is the same crowd that will applaud your beheading. People like a show. People like a show . . . . . . and so mail was coming in for Genua, at a dollar a time. A lot of mail. It was Stanley who explained. He explained several times, because Moist had a bit of a blind spot on this one. ‘People are sending envelopes with stamps inside envelopes to the coach office in Genua so that the first envelope can be sent back in the second envelope,’ was the shape of explanation that finally blew on some sparks in Moist’s brain. ‘They want the envelopes back?’ he said. ‘Why?’ ‘Because they’ve been used, sir.’ ‘That makes them valuable?’ ‘I’m not sure how, sir. It’s like I told you, sir. I think some people think that they’re not real stamps until they’ve done the job they were invented to do, sir. Remember the first printing of the one penny stamps that we had to cut out with scissors? An envelope with one of those on is worth two dollars to a collector.’ ‘Two hundred times more than the stamp?’ ‘That’s how it’s going sir,’ said Stanley, his eyes sparkling. ‘People post letters to themselves just to get the stamp, er, stamped, sir. So they’ve been used.’ ‘Er . . . I’ve got a couple of rather crusty handkerchiefs in my pocket,’ said Moist, mystified. ‘Do you think people might want to buy them at two hundred times what they cost?’ ‘No, sir!’ said Stanley. ‘Then why should—’ ‘There’s a lot of interest, sir. I thought we could do a whole set of stamps for the big guilds, sir. All the collectors would want them. What do you think?’ ‘That’s a very clever idea, Stanley,’ said Moist. ‘We’ll do that. The one for the Seamstresses’ Guild might have to go inside a plain brown envelope, eh? Haha!’ This time it was Stanley who looked perplexed. ‘Sorry, sir?’ Moist coughed. ‘Oh, nothing. Well, I can see you’re learning fast, Stanley.’ Some things, anyway. ‘Er . . . yes, sir. Er . . . I don’t want to push myself forward, sir—’ ‘Push away, Stanley, push away,’ said Moist cheerfully. Stanley pulled a small paper folder out of his pocket, opened it, and laid it reverentially in front of Moist. ‘Mr Spools helped me with some of it,’ he said. ‘But I did a lot.’ It was a stamp. It was a yellowy-green colour. It showed - Moist peered - a field of cabbages, with some buildings on the horizon. He sniffed. It smelled of cabbages. Oh, yes. ‘Printed with cabbage ink and using gum made from broccoli, sir,’ said Stanley, full of pride. ‘A Salute to the Cabbage Industry of the Sto Plains, sir. I think it might do very well. Cabbages are so popular, sir. You can make so many things out of them!’ ‘Well, I can see that—’ ‘There’s cabbage soup, cabbage beer, cabbage fudge, cabbage cake, cream of cabbage—’ ‘Yes, Stanley, I think you—’ ‘—pickled cabbage, cabbage jelly, cabbage salad, boiled cabbage, deep-fried cabbage—’ ‘Yes, but now can—’ ‘—fricassee of cabbage, cabbage chutney, Cabbage Surprise, sausages—’ ‘Sausages?’ ‘Filled with cabbage, sir. You can make practically anything with cabbage, sir. Then there’s—’ ‘Cabbage stamps,’ said Moist, terminally. ‘At fifty pence, I note. You have hidden depths, Stanley.’ ‘I owe it all to you, Mr Lipwig!’ Stanley burst out. ‘I have put the childish playground of pins right behind me, sir! The world of stamps, which can teach a young man much about history and geography as well as being a healthy, enjoyable, engrossing and thoroughly worthwhile hobby that will give him an interest that will last a lifetime, has opened up before me and—’ ‘Yes, yes, thank you!’ said Moist. ‘—and I’m putting thirty dollars into the pot, sir. All my savings. Just to show we support you.’ Moist heard all the words, but had to wait for them to make sense. ‘Pot?’ he said at last. ‘You mean like a bet?’ ‘Yes, sir. A big bet,’ said Stanley happily. ‘About you racing the clacks to Genua. People think that’s funny. A lot of the bookmakers are offering odds, sir, so Mr Groat is organizing it, sir! He said the odds aren’t good, though.’ ‘I shouldn’t think they are,’ said Moist weakly. ‘No one in their right mind would—’ ‘He said we’d only win one dollar for every eight we bet, sir, but we reckoned—’ Moist shot upright. ‘Eight to one odds on?’ he shouted. ‘The bookies think I’m going to win? How much are you all betting?’ ‘Er . . . about one thousand two hundred dollars at the last count, sir. Is that—’ Pigeons rose from the roof at the sound of Moist von Lipwig’s scream. ‘Fetch Mr Groat right now!’ It was a terrible thing to see guile on the face of Mr Groat. The old man tapped the side of his nose. ‘You’re the man that got money out o’ a bunch of gods, sir!’ he said, grinning happily. ‘Yes,’ said Moist desperately. ‘But supposing I - I just did that with a trick . . .’ ‘Damn good trick, sir,’ the old man cackled. ‘Damn good. A man who could trick money out of the gods’d be capable of anything, I should think!’ ‘Mr Groat, there is no way a coach can get to Genua faster than a clacks message. It’s two thousand miles!’ ‘Yes, I realize you’ve got to say that, sir. Walls have ears, sir. Mum’s the word. But we all had a talk, and we reckoned you’ve been very good to us, sir, you really believe in the Post Office, sir, so we thought: it’s time to put our money in our mouth, sir!’ said Groat, and now there was a touch of defiance. Moist gaped once or twice. ‘You mean “where your mouth is”?’ ‘You’re the man who knows a trick or three, sir! The way you just went into the newspaper office and said, we’ll race you! Reacher Gilt walked right into your trap, sir!’ Glass into diamond, thought Moist. He sighed. ‘All right, Mr Groat. Thank you. Eight to one on, eh?’ ‘We were lucky to get it, sir. They went up to ten to one on, then they closed the books. All they’re accepting now is bets on how you’ll win, sir.’ Moist perked up a little. ‘Any good ideas?’ he asked. ‘I’ve got a one-dollar flutter on “by dropping fire from the sky”, sir. Er . . . you wouldn’t like to give me a hint, p’raps?’ ‘Please go and get on with your work, Mr Groat,’ said Moist severely. ‘Yessir, of course, sir, sorry I asked, sir,’ said Groat, and crabbed off. Moist put his head in his hands. I wonder if it’s like this for mountain climbers, he thought. You climb bigger and bigger mountains and you know that one day one of them is going to be just that bit too steep. But you go on doing it, because it’s so-o good when you breathe the air up there. And you know you’ll die falling. How could people be so stupid? They seemed to cling to ignorance because it smelled familiar. Reacher Gilt sighed. He had an office in the Tump Tower. He didn’t like it much, because the whole place shook to the movement of the semaphore, but it was necessary for the look of the thing. It did have an unrivalled view of the city, though. And the site alone was worth what they’d paid for the Trunk. ‘It takes the best part of two months to get to Genua by coach,’ he said, staring across the rooftops to the Palace. ‘He might be able to shave something off that, I suppose. The clacks takes a few hours. What is there about this that frightens you?’ ‘So what’s his game?’ said Greenyham. The rest of the board sat around the table, looking worried. ‘I don’t know,’ said Gilt. ‘I don’t care.’ ‘But the gods are on his side, Readier,’ said Nutmeg. ‘Let’s talk about that, shall we?’ said Gilt. ‘Does that claim strike anyone else as odd? The gods are not generally known for no-frills gifts, are they? Especially not ones that you can bite. No, these days they restrict themselves to things like grace, patience, fortitude and inner strength. Things you can’t see. Things that have no value. Gods tend to be interested in prophets, not profits, haha.’ There were some blank looks from his fellow directors. ‘Didn’t quite get that one, old chap,’ said Stowley. ‘Prophets, I said, not profits,’ said Gilt. He waved a hand. ‘Don’t worry yourselves, it will look better written down. In short, Mr Lipwig’s gift from above was a big chest of coins, some of them in what look remarkably like bank sacks and all in modern denominations. You don’t find this strange?’ ‘Yes, but even the high priests say he—’ ‘Lipwig is a showman,’ snapped Gilt. ‘Do you think the gods will carry his mail coach for him? Do you? This is a stunt, do you understand? It got him on page one again, that’s all. This is not hard to follow. He has no plan, other than to fail heroically. No one expects him actually to win, do they?’ ‘I heard that people are betting heavily on him.’ ‘People enjoy the experience of being fooled, if it promises a certain amount of entertainment,’ said Gilt. ‘Do you know a good bookmaker? I shall have a little flutter. Five thousand dollars, perhaps?’ This got some nervous laughter, and he followed it up. ‘Gentlemen, be sensible. No gods will come to the aid of our Postmaster. No wizard, either. They’re not generous with magic and we’ll soon find out if he uses any. No, he’s looking for the publicity, that’s all. Which is not to say,’ he winked, ‘that we shouldn’t, how shall I put it, make certainty doubly sure.’ They perked up still more. This sounded like the kind of thing they wanted to hear. ‘After all, accidents can happen in the mountains,’ said Greenyham. ‘I believe that is the case,’ said Gilt. ‘However, I was referring to the Grand Trunk. Therefore I have asked Mr Pony to outline our procedure. Mr Pony?’ The engineer shifted uneasily. He’d had a bad night. T want it recorded, sir, that I have urged a six-hour shutdown before the event,’ he said. ‘Indeed, and the minutes will show that I have said that is quite impossible,’ said Gilt. ‘Firstly because it would be an unpardonable loss of revenue, and secondly because sending no messages would send quite the wrong message.’ ‘We’ll shut down for an hour before the event, then, and clear down,’ said Mr Pony. ‘Every tower will send a statement of readiness to the Tump and then lock all doors and wait. No one will be allowed in or out. We’ll configure the towers to run duplex - that is,’ he translated for management, ‘we’ll turn the down-line into a second up-line, so the message will get to Genua twice as fast. We won’t have any other messages on the Trunk while the, er, race is on. No Overhead, nothing. And from now on, sir, from the moment I walk out of this room, we take no more messages from feeder towers. Not even from the one in the Palace, not even from the one in the University.’ He sniffed, and added with some satisfaction: ‘ ‘specially not them students. Someone’s been having a go at us, sir.’ ‘That seems a bit drastic, Mr Pony?’ said Greenyham. ‘I hope it is, sir. I think someone’s found a way of sending messages that can damage a tower, sir.’ ‘That’s impossi—’ Mr Pony’s hand slapped the table. ‘How come you know so much, sir? Did you sit up half the night trying to get to the bottom of it? Have you taken a differential drum apart with a tin opener? Did you spot how the swage armature can be made to jump off the elliptical bearing if you hit the letter K and then send it to a tower with an address higher than yours, but only if you hit the letter Q first and the drum spring is fully wound? Did you spot that the key levers wedge together and the spring forces the arm up and you’re looking at a gearbox full of teeth? Well, I did!’ ‘Are you talking about sabotage here?’ said Gilt. ‘Call it what you like,’ said Pony, drunk with nervousness. ‘I went to the yard this morning and dug out the old drum we took out of Tower 14 last month. I’ll swear the same thing happened there. But mostly the breakdowns are in the upper tower, in the shutter boxes. That’s where—’ ‘So our Mr Lipwig has been behind a campaign to sabotage us . . .’ Gilt mused. ‘I never said that!’ said Pony. ‘No name need be mentioned,’ said Gilt smoothly. ‘It’s just sloppy design,’ said Pony. ‘I dare say one of the lads found it by accident and tried it again to see what happened. They’re like that, the tower boys. Show ‘em a bit of cunning machinery and they’ll spend all day trying to make it fail. The whole Trunk’s a lash-up, it really is.’ ‘Why do we employ people like this?’ said Stowley, looking bewildered. ‘Because they’re the only people mad enough to spend their life up a tower miles from anywhere pressing keys,’ said Pony. ‘They like it.’ ‘But somebody in a tower must press the keys that do all these . . . terrible things,’ said Stowley. Pony sighed. They never took an interest. It was just money. They didn’t know how anything worked. And then suddenly they needed to know, and you had to use baby talk. ‘The lads follow the signal, sir, as they say,’ he said. ‘They watch the next tower and repeat the message, as fast as they can. There’s no time to think about it. Anything for their tower comes out on the differential drum. They just pound keys and kick pedals and pull levers, as fast as they can. They take pride in it. They even do all kinds of tricks to speed things up. I don’t want any talk about sabotage, not right now. Let’s just get the message sent, as fast as possible. The lads will enjoy that.’ ‘The image is attractive,’ said Gilt. ‘The dark of night, the waiting towers, and then, one by one, they come alive as a serpent of light speeds across the world, softly and silently carrying its . . . whatever. We must get some poet to write about it.’ He nodded at Mr Pony. ‘We’re in your hands, Mr Pony. You’re the man with the plan.’ ‘I don’t have one,’ said Moist. ‘No plan?’ said Miss Dearheart. ‘Are you telling me you—’ ‘Keep it down, keep it down!’ Moist hissed. ‘I don’t want everyone to know!’ They were in the little cafe near the Pin Exchange which, Moist had noticed, didn’t seem to be doing much business today. He’d had to get out of the Post Office, in case his head exploded. ‘You challenged the Grand Trunk! You mean you just talked big and hoped something would turn up?’ said Miss Dearheart. ‘It’s always worked before! Where’s the sense in promising to achieve the achievable? What kind of success would that be?’ said Moist. ‘Haven’t you ever heard of learning to walk before you run?’ ‘It’s a theory, yes.’ ‘I just want to be absolutely clear,’ said Miss Dearheart. ‘Tomorrow night - that’s the day after today - you are going to send a coach -that’s a thing on wheels, pulled by horses, which might reach fourteen miles an hour on a good road - to race against the Grand Trunk -that’s all those semaphore towers, which can send messages at hundreds of miles an hour - all the way to Genua - that’s the town which is a very long way away indeed?’ ‘Yes.’ ‘And you have no wonderful plan?’ ‘No.’ ‘And why are you telling me?’ ‘Because, in this city, right now, you are the only person who would possibly believe I don’t have a plan!’ said Moist. ‘I told Mr Groat and he just tapped the side of his nose, which is something you wouldn’t want to watch, by the way, and said, “Of course you haven’t, sir. Not you! Hohoho!”‘ ‘And you just hoped something would turn up? What made you think it would?’ ‘It always has. The only way to get something to turn up when you need it is to need it to turn up.’ ‘And I’m supposed to help you how?’ ‘Your father built the Trunk!’ ‘Yes, but I didn’t,’ said the woman. ‘I’ve never been up in the towers. I don’t know any big secrets, except that it’s always on the point of breaking down. And everyone knows that.’ ‘People who can’t afford to lose are betting money on me! And the more I tell them they shouldn’t, the more they bet!’ ‘Don’t you think that’s a bit silly of them?’ said Miss Dearheart sweetly. Moist drummed his fingers on the edge of the table. ‘All right,’ he said, ‘I can think of another good reason why you might help me. It’s a little complicated, so I can only tell you if you promise to sit still and not make any sudden movements.’ ‘Why, do you believe I will?’ ‘Yes. I think that in a few seconds you’ll try to kill me. I’d like you to promise not to.’ She shrugged. ‘This should be interesting.’ ‘Promise?’ said Moist. ‘All right. I hope it’s going to be exciting.’ Miss Dearheart flicked some ash off her cigarette. ‘Go on.’ Moist took a couple of calm breaths. This was it. The End. If you kept changing the way people saw the world, you ended up changing the way you saw yourself. ‘I am the man who lost you that job at the bank. I forged those bills.’ Miss Dearheart’s expression didn’t change, apart from a certain narrowing of the eyes. Then she blew out a stream of smoke. ‘I did promise, did I?’ she said. ‘Yes. Sorry.’ ‘Did I have my fingers crossed?’ ‘No. I was watching.’ ‘Hmm.’ She stared reflectively at the glowing end of her cigarette. ‘All right. You’d better tell me the rest of it.’ He told her the rest of it. All of it. She quite liked the bit where he was hanged, and made him repeat it. Around them, the city happened. Between them, the ashtray filled up with ash. When he’d finished she stared at him for some time, through the smoke. ‘I don’t understand the bit where you give all your stolen money to the Post Office. Why did you do that?’ ‘I’m a bit hazy on that myself.’ ‘I mean, you’re clearly a self-centred bastard, with the moral fibre of a, a—’ ‘—rat,’ Moist suggested. ‘—a rat, thank you . . . but suddenly you’re the darling of the big religions, the saviour of the Post Office, official snook-cocker to the rich and powerful, heroic horseman, all-round wonderful human being and, of course, you rescued a cat from a burning building. Two humans, too, but everyone knows the cat’s the most important bit. Who are you trying to fool, Mr Lipwig?’ ‘Me, I think. I’ve fallen into good ways. I keep thinking I can give it up any time I like, but I don’t. But I know if I couldn’t give it up any time I liked, I wouldn’t go on doing it. Er . . . there is another reason, too.’ ‘And that is—?’ ‘I’m not Reacher Gilt. That’s sort of important. Some people might say there’s not a lot of difference, but I can see it from where I stand and it’s there. It’s like a golem not being a hammer. Please? How can I beat the Grand Trunk?’ Miss Dearheart stared through him until he felt very uncomfortable. Then she said, in a faraway voice: ‘How well do you know the Post Office, Mr Lipwig? The building, I mean.’ ‘I saw most of it before it burned down.’ ‘But you never went on to the roof?’ ‘No. I couldn’t find a way up. The upper floors were stuffed with letters when . . . I . . . tried . . .’ Moist’s voice trailed off. Miss Dearheart stubbed out her cigarette. ‘Go up there tonight, Mr Lipwig. Get yourself a little bit closer to heaven. And then get down on your knees and pray. You know how to pray, don’t you? You just put your hands together - and hope.’ Moist got through the rest of the day somehow. There were postmastery things to do - Mr Spools to speak to, builders to shout at, the everlasting clearing up to oversee and new staff to hire. In the case of the staff, though, it was more ratifying the decisions of Mr Groat and Miss Maccalariat, but they seemed to know what they were doing. He just had to be there to make the occasional judgement, like: ‘Do we embrace divertingly?’ said Miss Maccalariat, appearing in front of his desk. There was a pregnant pause. It gave birth to a lot of little pauses, each one more deeply embarrassing than its parent. ‘Not as far as I know,’ was the best Moist could manage. ‘Why do you ask?’ ‘A young lady wants to know. She said that’s what they do at the Grand Trunk.’ ‘Ah. I suspect she means embrace diversity,’ said Moist, recalling Gilt’s speech to the Times. ‘But we don’t do that here because we don’t know what it means. We’ll employ anyone who can read and write and reach a letter box, Miss Maccalariat. I’ll hire vampires if they’re a member of the League of Temperance, trolls if they wipe their feet, and if there’re any werewolves out there I’d love to hire postmen who can bite back. Anyone who can do the job, Miss Maccalariat. Our job is moving the mail. Morning, noon and night, we deliver. Was there anything else?’ Now there was a glint in her eye. ‘I don’t have any difficulties with anyone who speaks up about what they are, Mr Lipwig, but I must protest about dwarfs. Mr Groat is hiring them.’ ‘Fine workers, Miss Maccalariat. Keen on the written word. Hardworking, too,’ said Moist briskly. ‘But they do not tell you what their— what they— which— if they’re ladies or gentlemen dwarfs, Mr Lipwig.’ ‘Ah. This is going to be about the privies again?’ said Moist, his heart sinking. ‘I feel I am responsible for the moral welfare of the young people in my charge,’ said Miss Maccalariat sternly. ‘You are smiling, Postmaster, but I will not be funned with.’ ‘Your concern does you credit, Miss Maccalariat,’ said Moist. ‘Special attention will be paid to this in the design of the new building, and I will tell the architect that you are to be consulted at every stage.’ Miss Maccalariat’s well-covered bosom inflated noticeably at this sudden acquisition of power. ‘In the meantime, alas, we must make do with what the fire has left us. I do hope, as part of the management team, you will reassure people on this.’ The fires of dreadful pride gleamed off Miss Maccalariat’s spectacles. Management! ‘Of course, Postmaster,’ she said. But, mostly, Moist’s job was just to . . . be. Half of the building was a blackened shell. People were squeezed into what was left; mail was even being sorted on the stairs. And things seemed to go better when he was around. He didn’t have to do anything, he just had to be there. He couldn’t help thinking of the empty plinth, where the god had been taken away. He was ready when dusk came. There were plenty of ladders around, and the golems had managed to shore up the floors even up here. Soot covered everything and some rooms opened on to blackness, but he climbed ever up. He struggled through what remained of the attics, and clambered through a hatch and on to the roof. There wasn’t much of it. The descent of the rainwater tank had brought down a lot of burning roof with it, and barely a third remained over the great hall. But the fire had hardly touched one of the legs of the U, and the roof there looked sound. There was one of the old postal pigeon lofts there, and someone had been living in it. That wasn’t too surprising. Far more people wanted to live in Ankh-Morpork than there was Ankh-Morpork for them to live in. There was a whole sub-civilization at rooftop level, up here among the towers and ornamental domes and cupolas and chimneys and— —clacks towers. That’s right. He’d seen the clacks tower, and someone up here, just before his life had taken a turn for the strange. Why would a loft built for carrier pigeons have a semaphore tower? Surely the pigeons didn’t use it? Three gargoyles had colonized this one. They liked clacks towers anyway - being up high was what being a gargoyle was all about - and they’d fitted into the system easily. A creature that spent all its time watching and was bright enough to write down a message was a vital component. They didn’t even want paying, and they never got bored. What could possibly bore a creature that was prepared to stare at the same thing for years at a time? Around the city, the clacks towers were lighting up. Only the University, the Palace, the Guilds and the seriously rich or very nervous ran their towers at night, but the big terminal tower on the Tump blazed like a Hogswatch tree. Patterns of yellow squares ran up and down the main tower. Silent at this distance, winking their signals above the rising mists, outlining their constellations against the evening sky, the towers were more magical than magic, more bewitching than witchcraft. Moist stared. What was magic, after all, but something that happened at the snap of a finger? Where was the magic in that? It was mumbled words and weird drawings in old books and in the wrong hands it was dangerous as hell, but not one half as dangerous as it could be in the right hands. The universe was full of the stuff; it made the stars stay up and the feet stay down. But what was happening now . . . this was magical. Ordinary men had dreamed it up and put it together, building towers on rafts in swamps and across the frozen spines of mountains. They’d cursed and, worse, used logarithms. They’d waded through rivers and dabbled in trigonometry. They hadn’t dreamed, in the way people usually used the word, but they’d imagined a different world, and bent metal round it. And out of all the sweat and swearing and mathematics had come this . . . thing, dropping words across the world as softly as starlight. The mist was tilling the streets now, leaving the buildings like islands in surf. Pray, she’d said. And, in a way, the gods owed him a favour. Well, didn’t they? They’d got a handsome offering and a lot of celestial cred for not, in fact, doing anything at all. Get down on your knees, she’d said. It hadn’t been a joke. He knelt, pressed his hands together, and said, ‘I address this prayer to any god who—’ With a silence that was frightening, the clacks tower across the street lit up. The big squares glowed into life one after the other. For a moment, Moist saw the shape of the lamplighter in front of one of the shutters. As he disappeared into the dark, the tower started to flicker. It was close enough to illuminate the roof of the Post Office. There were three dark figures at the other end of the roof, watching Moist. Their shadows danced as the pattern of lights changed, twice every second. They revealed the figures were human, or at least humanoid. And they were walking towards him. Gods, now, gods could be humanoid. And they didn’t like to be messed about. Moist cleared his throat. ‘I’m certainly glad to see you—’ he croaked. ‘Are you Moist?’ said one of the figures. ‘Look, I—’ ‘She said you’d be kneeling down,’ said another member of the celestial trio. ‘Fancy a cup of tea?’ Moist got up slowly. This was not godly behaviour. ‘Who are you?’ he said. Emboldened by the lack of thunderbolts, he added: ‘And what are you doing on my building?’ ‘We pay rent,’ said a figure. ‘To Mr Groat.’ ‘He never told me about you!’ ‘Can’t help you there,’ said the shadow in the centre. ‘Anyway, we’ve only come back to get the rest of our stuff. Sorry about your fire. It wasn’t us.’ ‘You being—’ said Moist. ‘I’m Mad Al, he’s Sane Alex, and that’s Adrian, who says he’s not mad but can’t prove it.’ ‘Why do you rent the roof?’ The trio looked at one another. ‘Pigeons?’ suggested Adrian. ‘That’s right, we’re pigeon fanciers,’ said the shadowy figure of Sane Alex. ‘But it’s dark,’ said Moist. This information was considered. ‘Bats,’ said Mad Al. ‘We’re trying to breed homing bats.’ ‘I don’t believe bats have that kind of homing instinct,’ said Moist. ‘Yes, it’s tragic, isn’t it?’ said Alex. ‘I come up here at nights and see those empty little perches and it’s all I can do not to cry,’ said Undecided Adrian. Moist looked up at the little tower. It was about five times the height of a man, with the control levers on a polished panel near the bottom. It looked . . . professional, and well used. And portable. ‘I don’t think you breed any kind of birds up here,’ he said. ‘Bats are mammals,’ said Sane Alex. Moist shook his head. ‘Lurking on rooftops, your own clacks . . . you’re the Smoking Gnu, aren’t you?’ ‘Ah, with a mind like that I can see why you’re Mr Groat’s boss,’ said Sane Alex. ‘How about a cup of tea?’ Mad Al picked a pigeon feather out of his mug. The pigeon loft was full of the flat, choking smell of old guano. ‘You have to like birds to like it up here,’ he said, flicking the feather into Sane Alex’s beard. ‘Good job you do, eh?’ said Moist. ‘I didn’t say I did, did I? And we don’t live up here. It’s just that you’ve got a good rooftop.’ It was cramped in the pigeon loft, from which pigeons had, in fact, been barred. But there’s always one pigeon that can bite through wire netting. It watched them from the corner with mad little eyes, its genes remembering the time it had been a giant reptile that could have taken these sons of monkeys to the cleaners in one mouthful. Bits of dismantled mechanisms were everywhere. ‘Miss Dearheart told you about me, did she?’ said Moist. ‘She said you weren’t a complete arse,’ said Undecided Adrian. ‘Which is praise coming from her,’ said Sane Alex. ‘And she said you were so crooked you could walk through a corkscrew sideways,’ said Undecided Adrian. ‘She was smiling when she said it, though.’ ‘That’s not necessarily a good thing,’ said Moist. ‘How do you know her?’ ‘We used to work with her brother,’ said Mad Al. ‘On the Mark 2 tower.’ Moist listened. It was a whole new world. Sane Alex and Mad Al were old men in the clacks business; they’d been in it for almost four years. Then the consortium had taken over, and they’d been fired from the Grand Trunk on the same day that Undecided Adrian had been fired from the Alchemists’ Guild chimney, in their case because they’d spoken their mind about the new management and in his case because he hadn’t moved fast enough when the beaker started to bubble. They’d all ended up working on the Second Trunk. They’d even put money into it. So had others. It had all kinds of improvements, it would be cheaper to run, it was the bee’s knees, mutt’s nuts and various wonderful bits of half a dozen other creatures. And then John Dearheart, who always used a safety lanyard, landed in the cabbage field and that was the end of the Second Trunk. Since then, the trio had done the kinds of jobs available to new square pegs in a world of old round holes, but every night, high above, the clacks flashed its messages. It was so close, so inviting, so . . . accessible. Everyone knew, in some vague, half-understood way, that the Grand Trunk had been stolen in all but name. It belonged to the enemy. So they’d started an informal little company of their own, which used the Grand Trunk without the Grand Trunk’s knowing. It was a little like stealing. It was exactly like stealing. It was, in fact, stealing. But there was no law against it because no one knew the crime existed, so is it really stealing if what’s stolen isn’t missed? And is it stealing if you’re stealing from thieves? Anyway, all property is theft, except mine. ‘So now you’re, what was it again . . . crackers?’ Moist said. ‘That’s right,’ said Mad Al. ‘Because we can crack the system.’ ‘That sounds a bit over-dramatic when you’re just doing it with lamps, doesn’t it?’ ‘Yes, but “flashers” was already taken,’ said Sane Alex. ‘All right, but why “Smoking Gnu”?’ said Moist. ‘That’s cracker slang for a very fast message sent throughout the system,’ said Sane Alex proudly. Moist pondered this. ‘That makes sense,’ he said. ‘If I was a team of three people, who all had a first name beginning with the same letter, that’s just the kind of name I’d choose.’ They’d found a way into the semaphore system, and it was this: at night, all clacks towers were invisible. Only the lights showed. Unless you had a good sense of direction, the only way you could identify who the message was coming from was by its code. Engineers knew lots of codes. Ooh, lots. ‘You can send messages free?’ said Moist. ‘And nobody notices?’ There were three smug smiles. ‘It’s easy,’ said Mad Al, ‘when you know how.’ ‘How did you know that tower was going to break down?’ ‘We broke it,’ said Sane Alex. ‘Broke the differential drum. They take hours to sort out because the operators have to—’ Moist missed the rest of the sentence. Innocent words swirled in it like debris caught in a flood, occasionally bobbing to the surface and waving desperately before being pulled under again. He caught ‘the’ several times before it drowned, and even ‘disconnect’ and ‘gear chain’, but the roaring, technical polysyllables rose and engulfed them all. ‘—and that takes at least half a day,’ Sane Alex finished. Moist looked helplessly at the other two. ‘And that means what, exactly?’ he said. ‘If you send the right kind of message you can bust the machinery,’ said Mad Al. ‘The whole Trunk?’ ‘In theory,’ said Mad Al, ‘because an execute and terminate code—’ Moist relaxed as the tide came back in. He wasn’t interested in machinery; he thought of a spanner as something which had another person holding it. It was best just to smile and wait. That was the thing about artificers: they loved explaining. You just had to wait until they reached your level of understanding, even if it meant that they had to lie down. ‘—can’t do that any more in any case, because we’ve heard they’re changing the—’ Moist stared at the pigeon for a while, until silence came back. Ah. Mad Al had finished, and by the looks of things it hadn’t been on a high note. ‘You can’t do it, then,’ said Moist, his heart sinking. ‘Not now. Old Mr Pony might be a bit of an old woman but he sits and niggles at problems. He’s been changing all the codes all day! We’ve heard from one of our mates that every signaller will have to have a personal code now. They’re being very careful. I know Miss Adora Belle thought we could help you, but that bastard Gilt has locked things up tight. He’s worried you’re going to win.’ ‘Hah!’ said Moist. “We’ll come up with some other way in a week or two,’ said Undecided Adrian. ‘Can’t you put it off until then?’ ‘No, I don’t think so.’ ‘Sorry,’ said Undecided Adrian. He was playing idly with a small glass tube, full of red light. When he turned it over, it filled with yellow light. ‘What’s that?’ Moist asked. ‘A prototype,’ said Undecided Adrian. ‘It could have made the Trunk almost three times faster at night. It uses perpendicular molecules. But the Trunk’s just not open to new ideas.’ ‘Probably because they explode when dropped?’ said Sane Alex. ‘Not always.’ ‘I think I could do with some fresh air,’ said Moist. They stepped out into the night. In the middle distance the terminal tower still winked, and towers were alight here and there in other parts of the city. ‘What’s that one?’ he said, like a man pointing to a constellation. ‘Thieves’ Guild,’ said Undecided Adrian. ‘General signals for the members. I can’t read ‘em.’ ‘And that one? Isn’t that the first tower on the way to Sto Lat?’ ‘No, it’s the Watch station on the Hubwards Gate. General signals to Pseudopolis Yard.’ ‘It looks a long way off.’ ‘They use small shutter boxes, that’s all. You can’t see Tower 2 from here - the University’s in the way.’ Moist stared, hypnotized, at the lights. ‘I wondered why that old stone tower on the way to Sto Lat wasn’t used when the Trunk was built? It’s in the right place.’ ‘The old wizard tower? Robert Dearheart used it for his first experiments, but it’s a bit too far and the walls aren’t safe and if you stay in there for more than a day at a time you go mad. It’s all the old spells that got into the stones.’ There was silence and then they heard Moist say, in a slightly strangled voice: ‘If you could get on to the Grand Trunk tomorrow, is there anything you could do to slow it down?’ ‘Yes, but we can’t,’ said Undecided Adrian. ‘Yes, but if you could?’ ‘Well, there’s something we’ve been thinking about,’ said Mad Al. ‘It’s very crude.’ ‘Will it knock out a tower?’ said Moist. ‘Should we be telling him about this?’ said Sane Alex. ‘Have you ever met anyone else that Killer had a good word for?’ said Mad Al. ‘In theory it could knock out every tower, Mr Lipwig.’ ‘Are you insane as well as mad?’ said Sane Alex. ‘He’s government!’ ‘Every tower on the Trunk?’ said Moist. ‘Yep. In one go,’ said Mad Al. ‘It’s pretty crude.’ ‘Really every tower?’ said Moist again. ‘Maybe not every tower, if they catch on,’ Mad Al admitted, as if less than wholesale destruction was something to be mildly ashamed of. ‘But plenty. Even if they cheat and carry it to the next tower on horseback. We call it . . . the Woodpecker’. ‘The woodpecker?’ ‘No, not like that. You need, sort of, more of a pause for effect, like . . . the Woodpecker! ‘. . . the Woodpecker,’ said Moist, more slowly. ‘You’ve got it. But we can’t get it on to the Trunk. They’re on to us’ ‘Supposing I could get it on to the Trunk?’ said Moist, staring at the lights. The towers themselves were quite invisible now. ‘You? What do you know about clacks codes?’ said Undecided Adrian. ‘I treasure my ignorance,’ said Moist. ‘But I know about people. You think about being cunning with codes. I just think about what people see—’ They listened. They argued. They resorted to mathematics, while words sailed through the night above them. And Sane Alex said: ‘All right, all right. Technically it could work, but the Trunk people would have to be stupid to let it happen.’ ‘But they’ll be thinking about codes,’ said Moist. ‘And I’m good at making people stupid. It’s my job.’ ‘I thought your job was postmaster,’ said Undecided Adrian. ‘Oh, yes. Then it’s my vocation.’ The Smoking Gnu looked at one another. ‘It’s a totally mad idea,’ said Mad Al, grinning. ‘I’m glad you like it,’ said Moist. There are times when you just have to miss a night’s sleep. But Ankh-Morpork never slept; the city never did more than doze, and would wake up around 3 a.m. for a glass of water. You could buy anything in the middle of the night. Timber? No problem. Moist wondered whether there were vampire carpenters, quietly making vampire chairs. Canvas? There was bound to be someone in the city who’d wake up in the wee small hours for a wee and think, ‘What I could really do with right now is one thousand square yards of medium grade canvas!’ and, down by the docks, there were chandlers open to deal with the rush. There was a steady drizzle when they left for the tower. Moist drove the cart, with the others sitting on the load behind him and bickering over trigonometry. Moist tried not to listen; he got lost when maths started to get silly. Killing the Grand Trunk . . . Oh, the towers would be left standing, but it would take months to repair them all. It’d bring the company down. No one would get hurt, the Gnu said. They meant the men in the towers. The Trunk had become a monster, eating people. Bringing it down was a beguiling idea. The Gnu were full of ideas for what could replace it - faster, cheaper, easier, streamlined, using imps specially bred for the job . . . But something irked Moist. Gilt had been right, damn him. If you wanted to get a message five hundred miles very, very fast, the Trunk was the way to do it. If you wanted to wrap it in a ribbon, you needed the Post Office. He liked the Gnu. They thought in a refreshingly different way; whatever curse hung around the stones of the old tower surely couldn’t affect minds like theirs, because they were inoculated against madness by being a little bit crazy all the time. The clacks signallers, all along the Trunk, were . . . a different kind of people. They didn’t just do their job, they lived it. But Moist kept thinking of all the bad things that could happen without the semaphore. Oh, they used to happen before the semaphore, of course, but that wasn’t the same thing at all. He left them sawing and hammering in the stone tower, and headed back to the city, deep in thought.","sourceLink":"http://novel.tingroom.com/kehuan/339/634.html","bookId":331,"book":{"id":331,"title":"开始邮政 Going Postal","description":"简介： Going Postal is Terry Pratchett\u0027s 33rd Discworld novel, released in the United Kingdom on September 25, 2004. Unlike most of Pratchett\u0027s Discworld novels, Going Postal is divided into chapters, a feature previously seen only in Pratchett\u0027s...","cover":"http://novel.tingroom.com/uploads/110712/1-110G2142516212.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/339","creation":"Aug 1, 2019 12:18:36 AM","modification":"Aug 1, 2019 12:18:36 AM"}}
