{"id":86635,"no":14,"title":"Page 14","content":"\n Evan came back to the present, and looked back over at Brett, who was standing beside him brooding quietly as Evan pulled out his new camo outfit and his boots from the closet.\n “This is such bullshit, Brett. I’m doing this thing, and unless you plan to lock me in this room, you need to just go back to work and let me get ready.” At the look on Brett’s face, Evan took a backward step. He made himself drop his gaze.“Please, Brett.”\n “If I thought locking you in this room would do any good, I’d have already done it.Don’t push your luck, Evan.Go ahead with this if you must, but if you get hurt, don’t complain.” Brett turned and strode toward the door without even saying goodbye to him.\n He’d never left him before without kissing him goodbye, and Evan felt a momentary twinge. However, where this training was concerned, he had to reassert himself and not let Brett get away with his shit. Being jealous and possessive was one thing, but trying to control him and tell him what he could and couldn’t do was quite another.\n “I’m training with Logan, starting today, Brett.I won’t get hurt,” Evan called after him.\n Brett turned at the door and started to say something and then apparently thought better of it. He tightened his lips though and thrust out his jaw belligerently.“If you do, don’t come crying to me.”\n Evan rolled his eyes.“They’re pets, Brett—mostly women and children and a few young guys, not sumo wrestlers. How the heckam I going to get hurt?”\n “Just remember what I said.”\n “Oh, I definitely will. No crying to you—check.”\n “Smartass. I think your friends are a bad influence on you.” Brett growled, turning on his heel, slamming the door behind him and leaving Evan alone in their room. Evan turned wearily back to the closet and started getting dressed in a pair of camos that Logan had sent over when the door suddenly opened again and Brett marched over to him and pulled Evan in his arms, leaning him back so far Evan had to stick a leg out to keep his balance. Brett kissed him so hard he left him breathless, then still holding him in the same position Brett growled at him again. “Damn you.”\n He straightened him back up and stormed out of the room again, leaving Evan blushing and smiling, shaking his head. Life with Brett was always interesting. Most days now, Evan felt like he was walking a tightrope between wanting to please Brett and wanting to just be himself. The two didn’t always match up very well.\n Once he finished dressing, Evan went out to the little training area Nicky made Marco set up by the side of the lodge. Nicky and Evan were already there, along with about twenty-five young men and women, all dressed in their new green and tan Woodland camo outfits supplied by the pack. They were standing around laughing and joking until Logan stepped forward.\n Logan had changed greatly since his days as a Hunter, and Evan had seen plenty of pictures of him during his time in training with them. They used to use him at the Hunter complex as a kind of warning of what could happen to you if you were captured. Inthe pictures he’d been a nice-looking, fairly buff young man of average height and size. Now the man who stood before him was more than just good-looking. He was downright movie-star gorgeous. He was much bigger too, lean in the stomach and waist, but his chest and shoulders were larger, and he seemed to have grown a couple of inches. He looked tougher, like the kind of man you wouldn’t want to face in a fight.\n Nicky stood behind him, and despite the fact that his face was as beautifulas a girl’s, with long, thick eyelashes and all that curly, golden blond hair, he, too, had a body that was manly, toned and muscular. They looked like Hollywood extras or models. Evan wondered if he would look like that one day.The doctors had told him he’d get bigger and better-looking once he was mated to a wolf, and now he was beginning to believe it.\n Logan fixed the crowd of young people with a serious look.“I know most of you are here because the alpha told you to come, but this is serious business. No one wants to become a victim ofviolence, but we’re at war with a smart, relentless and determined enemy. They want you and the wolves annihilated, wiped off the face of the earth.” He looked around to see if his message was being taken seriously and saw that it was. A few of them were chewing nervously on their lips and were standing closer to each other.\n “The leaders of The Hunters have decided the best way to do this is to fight us with feral creatures. As you may have heard, Nicky here, our alpha’s mate, once became such a creature because he went without blood too long. This is the method they intend to use on you if they can catch you.And make no mistake, they’ll be after you.” He fixed them with another hard stare and continued.“So why is it that these predators, these Hunters, are so successful against people like you? They rely on the fact that you tend to think of them as having already won. You can’t defend yourself against someone that’s already succeeded in your mind, and if you’re concerned at all with yourattacker’s well-being, you’ve already given him the only advantage he needs to win. Raw, unadulterated violence is the Hunter’s best weapon, because it terrorizes your mind as well as your body.\n “This is not marital arts.There’s nothing pretty about what we’re going to teach you. Prepare yourself to get down and dirty, and you’ll walk away with your life. Are you guys ready to get started?”\n Evan found himself nodding right along with the rest of them. Damn, this sounded like fun. Logan had already been teaching Nicky some of these techniques, and he’d asked for Evan in this first training class because of his former training. He knew it would kick in once he’d learned a few of these techniques, and he could be a big help.\n He wasn’t kidding about the violence of the techniques, though. Over the next hour, Logan showed the pets how to gouge, kick, stomp, and generally maim any attacker foolish enough to try something with them. He was aware that a few of the wolves had gathered to watch from a distance. When they broke for a few minutes, he spotted Brett coming up to stand beside Casey. The two of them exchanged a few words, and Evan noticed the disapproving looks on both their faces.\n Nicky came up beside him and followed his gaze with a smile.“They don’t like it because they think we might use some of these techniques on them.”\n “How can they be so shortsighted?” Evan said with a shake of his head.“Can’t they see how this can help them in the long run?”\n “No, they can’t,” Nicky replied. “It hurts their pride for them to admit they need any help in protecting their own mates. Kind of a slap in their faces, you know?Marco hates it too, but he’s smart enough to know he has to let us train for the good of the pets. Plus he made a promise to me,and he won’t go back on it.” He slapped Evan on the back and followed his gaze over to where Brett was staring at him.“Don’t be too hard on him. This is all really new to them, and they do just want to protect us.We have to show them they’re wrong. Prove it to them so they’ll understand.”\n “How do we do that?”\n Behind them, Logan said “An exhibition fight, maybe? To show our skills?”\n Nicky shrugged.“Fight who?If we fight against each other, they wouldn’t be impressed. If it we fight against some of them, and they lost, they’d say it was because they were afraid they’d hurt us so they pulled their punches and let us win.”\n Evan spoke up.“What if we fought against our own mates?”\n Nicky held up a hand.“Hell, no. I did that once, and never again. He took it as a challenge to hisleadership and told me if I didn’t submit to him, he’d lose the respect of the pack. So I had to get down on my knees to him and totally submit. Even offer him my throat. Not pleasant. Especially since I thought at the time that he might rip it out.”\n “But, Nicky, that was because you two were in the ancestral ring.Ian told me about it,” Logan said.“Much too public a challenge, and Marco was right.If he’d been defeated by his own pet, he would have lost the respect of all the wolves.”\n “Then how?”\n “Keep it more private. Ian has already agreed to let me fight beside him if the time comes. He said he wants me by his side so he can protect me. What about Marco? Will he let you fight alongsidehim?”\n “Ha!” Nicky scoffed. “He has a plan to put me in one of the safe rooms downstairs, along with all the other pets—Brett will put you there too, Evan—and then we’ll wait there till they defeat the Hunters and come for us.If they were to lose, then the guards they’ll put in there with us have orders for no one to be taken alive.”\n “My God,” Evan said quietly. “We’d be sitting ducks—helpless.”\n “Right,” Nicky said bitterly. “I’d rather go out fighting any day. How can I get Marco to change his mind and let me stay near him?”\n “Make a wager with him—he won’t be able to resist, especially if you make it worth his while,” Logan suggested.\n “A wager? Like what?”\n “Likeif he wins, you’ll do something for him—something submissive that he’d love. But if he loses, he’ll have to let you stay near him if the fight ever comes to us. Then make damn sure you win.”\n Nicky looked skeptical.“Marco outweighs me by forty pounds of pure muscle. What the heck can I bet with him?”\n “Bet him you can beat him in a wrestling match in your bedroom.”\n Nicky looked at Logan as if he’d lost his mind. “What part of ‘forty pounds of muscle’ do you not understand?”\n “Remember what I told the pets the first day—if you already think he’s going to win, then you’re already defeated.”\n “I’m not going to try to gouge Marco’s eyes or knee him in the balls. I don’t want to try to hurt him.”\n Evan nodded.“Yeah, I’m not willing to try that on Brett either.”\n “So don’t—just put them on the floor.That’s all you have to do. A little martial arts move. I can show you how it’s done,“ Logan said with a little smirk. \n","sourceLink":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5/page-14.html","bookId":2257,"book":{"id":2257,"title":"Wolfsbane (Dark Hollow Wolf Pack #5)","description":"Storyline: \n Wolfsbane (Dark Hollow Wolf Pack #5) \n Evan Grant, a security guard in the Hunters’ prison, is anxious to prove himself with the group. A new prisoner arrives, and Evan feels an immediate attraction. The shifter is Brett, the most handsome man Evan’s ever seen, and the tortures the Hunters have put him through touch Evan’s heart. Bringing him pain medicine and food, he makes a strong connection with the handsome shifter. His attraction is overwhelming, and it becomes even more difficult when the Hunters’ scientists ask him to volunteer to mate with the shifter so they can study the bloodmatch. He agrees to the experiment only after the scientists promise nothing can go wrong, but after Evan mates with Brett, he overpowers the guards and escapes, taking Evan with him. It doesn’t take long to discover Evan’s the newest “pet” of the Mountain Wolf Pack, and Brett is his new master.\n \n","cover":"https://allnovel.net/images/wolfsbane-dark-hollow-wolf-pack-5.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:15:54 PM"}}
