{"id":86623,"no":2,"title":"Page 2","content":"\n Ushering Evan to the door, the major was all business now that he’d secured his agreement. In no time at all, Evan found himself outside in the corridor, wondering what in the hell he’d gotten himself into. An image of the shifter’s beautiful, glittering, dangerous eyes popped into his head, and he got weak in the knees. Damn, this thing might just be the death of him after all.\n Evan walked slowly down the hall toward the cell where the wolf was being held. Damn it, not just held—he was being chained, half-starved, beaten and tortured. The major had informed Evan his wolf had been “a bit combative.” Their answer to his resistance was apparently to beat him half to death from what the other guards told him. Evan hadn’t signed on for this kind of cruelty, and one of his first demands, he decided, would be to improve the captive wolf’s living conditions. Strange how he already felt a crazy kind of possessiveness toward the wolfman.\n It had been almost two weeks since his initial conversation with the major, followed by intensive physical and psychological exams. As promised, now that he’d been cleared for the experiment, Evan had been assigned as one of his night guards so he could get to know and befriend him. He had been given the private number of the doctor in charge of the experiment and told to call when he was ready to begin the mating process. In the meantime, Evan had been encouraged to visit him, get to know him. He was told by the doctor in charge of the experiment that this would make it easier for him to have sex with the wolf when the time came. Evan shuddered just thinking of it. Whether the idea filled him with fear or longing, hedidn’t want to examine too closely. After seeing the captive just the one time, he hadn’t been able to get him out of his mind. Still, he was a little frightened. Logan Winters was dead at the hands of these creatures, not to mention countless numbers of Hunters. Evan quietly put his hand on the doorknob as he unlocked the door, and eased it open. The wolfman was chained to the far wall, and the light was so dim, Evan couldn’t really see him. He could hear him though, his breathing slow and even in the small room, a few little stirring movements letting Evan know that the man was awake and aware of his presence in the room. He could smell him too—not a bad smell at all, but something musky and sweet.\n Evan lit a small candle he’d brought with him, not wanting to put on a light for fear of hurtingthe wolf’s eyes after he’d been so long in the dark. The other guards had been warned never to be alone with the wolf, and if he needed something they were to call for backup. Otherwise, they were to leave him strictly alone, and never go into the cell with him unless backup was waiting outside. Of course, that was for the other guards—not for Evan. Evan had resisted as long as he could. He knew the wolf had been interrogated and tortured every day sincehe’d been there.He had to wonder if this torture weren’t some way to coerce Evan into mating with the wolf more quickly. He knew the brass was upset with him for taking time to get used to the wolf.\n Evan had made no secret of the fact he hated the violent treatment of the wolf captives. When they had their last conversation, the major even implied that Evan’s greater haste in doing thedoctor’s experiment would end the daily suffering of the creature, and it was true hecouldn’t continue to stand by and do nothing while this wolfman was tortured and beaten. Not in all good conscience. He abhorred this cruelty and didn’t see any need to treat him like this.\n I f he were being honest, it wasn’t just his strong sense of right and wrong.He’d never felt as drawn to anyone so quickly before in his life, sincethe first moment he’d seen the huge man being escorted down the corridor to his cell.\n When they’d first brought the wolf shifter past his guard station in the basement of the huge Hunter’s complex, he’d been surprised at how handsome he was. Even though they’d said he would be well-built and good-looking, he was still surprised at his size and muscles, and so damned turned on he hadn’t really slept well since. This wolf was nothing like he’d imagined.\n The light from the candle now allowed Evan to just make out the prisoner across the room, his hands chained to hooks in the floor, along with his ankles. He had only a few inches that he could move in any direction, and he couldn’t even lie down if he wanted to. All he could do was lean back against the cell wall, as he was doing now, though the pain of that contact on his whipped back must be excruciating.\n He was blindfolded, a strip of leather wound tightly around his eyes, so that even if he tipped back his head, he couldn’t catch a glimpse of his surroundings. Evan knew from his recent training that this was more a form of psychological torture, denying the prisoner knowledge of his surroundings or of what was about to happen to him next.\n The wolf sat quietly in his chains, waiting. As Evan walked a little closer, the man tipped up his chin, sniffing the air ever so slightly. Again, Evan wondered if, like an animal, the wolfman could smell him, his fear, his hesitation, his raging damn hormones, because goddamn, the man was gorgeous. Even in the dim light of the candle, his hair gleamed and the sun darkened skin of his chest looked silky smooth. Evan wanted to touch that skin so badly. He wanted to run his tongue over those dark brown nipples and tease them between his teeth. Fuck, admit it. He wanted to bang him like a drum.\n Evan took a deep breath. Up close, the musky-sweet smell was even stronger. He stepped closer, keeping his voice low and steady.“I’ve brought you some food. Not that awful swill they’ve been giving you, but some stuff I brought from home. Just some sandwiches and juice, but…” His voice trailed off as the wolf made no sign that he’d even heard him, just a brief tightening of his perfect lips.\n Evan set the sandwiches down within reach of his hand and then quickly stepped back. “I brought some aspirin too.It’s there on top of the sandwiches. It’s not going to help much, I know, but it’s all I had at home.”\n Evan stood there for another second or two, feeling stupid. He began to back slowly toward the door.He’d been a fool to come, but he’d felt he had to do something. He knew the Hunters were the most hated enemies of the wolves—the guy probably felt nothing but the deepest contempt for him. He might even be afraid to eat the sandwiches, thinking they were poisoned or something. As he backed slowly toward the door, Evan thought he should say something, anything to break this strange tension in the room.\n “They’re not poisoned or drugged or anything. I wouldn’t do that.I just don’t like how they’re treating you. It’s not right.”\n The man still sat stolidly in the same place.Evan didn’t think he’d moved the whole time he’d been in the room with him. Sighing, he turned and started out the door when he heard a deep, wellmodulated voice from behind him, so quiet he couldn’t even be sure he’d heard it.\n “Just how am I supposed to eat this? Should I lap it from the floor like the dog you people think I am?”\n Evan whirled around to face him, but he still hadn’t moved, and he half wondered if he had hallucinated hearing the words.“I’m sorry.” He moved back to kneel beside the man.“I don’t think that, no.I mean that you’re a dog, or anything. Can I feed it to you? Would that be all right?”\n The man sat so quietly that for a moment Evan thought he wasn’t going to answer. Then just as Evan began feeling really foolish kneeling there by his feet, he inclined his head.\n Evan felt unreasonably pleased. He quickly unscrewed the cap from the bottle of juice and took the aspirin first, holding the tablets to the man’s lips.\n When the tip of his tongue, his beautiful, pink tongue, came out between his lips and ever so slightly touched Evan’s fingers as he accepted the aspirin, Evan felt weak in the knees. He had to sit down beside him.\n Over the course of the next few minutes, Evan carefully held the sandwich halves to his lips for him to take a bite, and watched him while he chewed. Occasionally, his lips would touch Evan’s fingers and once, his tongue. Each time it happened, the slight contact went straight to Evan’s cock. God, he was so perfect, from his even white teeth to his perfectly sculpted jaw line, and his straight, aquiline nose that twitched from time to time ever so slightly, as if he smelled something he couldn’t quite identify, though once he made a soft little moaning sound deep in his throat afterward, like he was moved by the scent in some way.\n When he finished feeding him, Evan didn’t quite know what to say or do. He got unsteadily to his feet.“Well, uh..that’s it. I can bring more tomorrow, if you like.”\n The wolf didn’t say anything. There was just a slight twitching at the corner of his mouth as if to indicate it was a stupid question, not really worth answering.\n “Uh, okay, so see you later then.” Evan turned and stumbled his way toward the door in the dim light, something about this man making him feel unsure of himself.\n As he got to the door, he heard the deep tones behind him again.\n “Thank you.”\n “You’re welcome,” he said quickly and turned, feeling unreasonably pleased.\n Evan retreated back to his guard station. Usually, third shift was very quiet, so he didn’t have any real duties to perform. He could have stayed longer and the doctors would have been pleased for him to do so, but the wolfman made him feel nervous and off balance. When he was with him all he wanted to do was touch him.\n Did the wolfman realize how he had affected him? Could a man who was half beast actually smell his raging hormones and the pre-cum that started leaking from his stupid cock the minute he smelled the guy? Because, oh yeah, the smell he’d been noticing was radiating off the wolf, a crazy, delicious smell like cookies baking in an oven, for Christ’s sake. He would have thought it was only his imagination, but he had to admit to himself that the odor was all too familiar—he’d been noticing that particular scent at his house for over two weeks, and even in his clean clothes he took straight out of the dresser drawer. Evan had no idea how that was even possible, but there it was. There it bloody well was, and he thought he might just be going out of his mind.\n Evan didn’t sleep well at all that day, and when it was time for his shift to start, he felt exhausted and overwhelmed. Yet he found himself eagerly looking forward to seeing his wolfman. Henderson, the guard he relieved, told him the brass had “interrogated” the wolf for hours that day, and it had taken four of them to drag his body back into the cell when they were through with him.He was still refusing to say a word, though, about why he’d been caught lurking around the compound before they captured him. The top brass feared some kind of attack, and had been trying to get him to confess whether or not he was a rogue or part of a pack. \n","sourceLink":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5/page-2.html","bookId":2257,"book":{"id":2257,"title":"Wolfsbane (Dark Hollow Wolf Pack #5)","description":"Storyline: \n Wolfsbane (Dark Hollow Wolf Pack #5) \n Evan Grant, a security guard in the Hunters’ prison, is anxious to prove himself with the group. A new prisoner arrives, and Evan feels an immediate attraction. The shifter is Brett, the most handsome man Evan’s ever seen, and the tortures the Hunters have put him through touch Evan’s heart. Bringing him pain medicine and food, he makes a strong connection with the handsome shifter. His attraction is overwhelming, and it becomes even more difficult when the Hunters’ scientists ask him to volunteer to mate with the shifter so they can study the bloodmatch. He agrees to the experiment only after the scientists promise nothing can go wrong, but after Evan mates with Brett, he overpowers the guards and escapes, taking Evan with him. It doesn’t take long to discover Evan’s the newest “pet” of the Mountain Wolf Pack, and Brett is his new master.\n \n","cover":"https://allnovel.net/images/wolfsbane-dark-hollow-wolf-pack-5.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:15:54 PM"}}
