{"id":86642,"no":21,"title":"Page 21","content":"“That could be an explanation, I guess. I never questioned him all that much after he came back,” Zack said thoughtfully. “I thought it would be best to leave him alone and let him find his own way.God, if that’s true, what the hell did Winters do to him?” “Good question,” Ian said. “When they had me, they had just begun injecting things into me. Logan objected, saying it might taint my blood, and they were feeding it to him, so the injections stopped. Who knows what might have happened if it hadn’t been for that?” “Is there any way to prove whether or not Winters captured Tim? I wonder if the people we have on the inside would recognize a picture of him? Do you have any recent pictures of him, Zack?” “My aunt, his mother, would have some. I don’t know that she’s forgiven me for killing him—if I’ve forgiven myself, for that matter—but if this might be a chance to at least partially clear his name, or explain what happened,I’m sure we could get them from her.” “Good.” Marco leaned back in his chair.“As soon as you can get those, I’ll contact our inside sources.I don’t know if we’ve answered all the questions we had about ferals, but we’ve made a start.Does anyone else have any questions they’d like to bring up?” Casey spoke up.“I have one, actually.It’s always been rumored that once a pet has gone feral, they’re never exactly the same. They’re wilder, harder to handle. Would you agree with that, Zack?” Marco glared down the table at Casey, angry over the implied insult to both Gabe and his own mate, Nicky. Zack didn’t seem to take offense though, particularly. He put a fond hand on Gabe’s thigh. “Wild, unpredictable, passionate and beautiful—those are all adjectives I’d use to describe Gabe. It’s true we had a few problems at the start of our relationship, but that’s only to be expected from a human pet.He wears my collar now and my ring on his finger. That’s usually more than enough to remind him who he belongs to. If not, I take whatever steps I need to. Does that answer your question, Casey?” Casey nodded with a grin on his face, and from where Evan sat, he could see the remark madeboth Gabe and Nicky’s faces flush red, and they looked angry. The meeting was breaking up. Marco, Casey, Ian and Brett all came over to speak to Zack and all of them looked pointedly at the wide gold collar Gabewas wearing while, to Evan’s mind, Zack preened like a peacock. While the wolves talked, Gabe and Nicky quietly got up and walked out of the large room, their heads together. Evan got up to meet them. Nicky spoke first.“Hi, Evan. Did your master let you out for a few minutes?” At Evan’s look of surprise, he shook his head and smiled at him.“I’m sorry. I’m just so damned mad at Casey’s question and Zack’s answer.” Evan shot a look at Gabe, but he smiled and nodded in agreement.“Yeah, that’s my man. Insufferable, conceited, full of himself—pretty typical wolf behavior, I’d say.” All three of them smiled, and Gabe touched his collar self-consciously.“I went into this whole thing kicking and screaming, especially the whole domination thing, but now I kind of like it.The collar’s pretty and kind of makes me feel protected.But I’m probably different from you guys. I like a little kink myself, and I like it when Zack goes all Dom on me. I have a feeling Nicky would hate it.” Nicky touched the collar too, and looked thoughtful.“I wouldn’t wear it. I’ve worn them before when I first cameand much uglier than this one, but for me, it represents what I’ve been fighting against for a long time. It would please Marco,but it wouldn’t be real for me. It represents real submission, and I don’t have that. What about you, Evan?” “No, I wouldn’t wear it either. I really like the rings though.” “Oh,hell yes, they’re gorgeous. I noticed Zack was wearing one too, for all his talk about ‘he’s wearing myring.’” Gabe smiled and put a companionable arm around both Nicky and Evan.“I have an idea, boys. A way to get back at Zack for his little remark about the collar and your wolves for how much they admired it. Will you help me?” Nicky looked eager and laughingly nodded his head. Evan pulled back a little. “I don’t know about this. What kind of lesson exactly?I don’t want to make Brett mad at me again.” “These collars they think control us so much—what if we all wore one and yet acted completely out of their control? Let them know that when the collar goes on, our so-called good behaviorgoes out the window.” Just then Brett called out.“Evan!” Evan turned to see him standing near the hallway to their room, his face scowling because he was talking to Nicky and Gabe. He snapped his fingers at him.“Over here! Now!” Back to this shit again? Evan turned back to Nicky and Gabe, his face dark with outrage. “Count me in, Gabe, whatever it is. I think my mate could use a little lesson too.” Chapter Eight Brett could hear the music from the moment they stepped out of the room, loud country music, the raucous kind with a boisterous, urgent beat. Nicky had picked a country-western theme for this party and it sounded like he already had it in full swing.Brett hadn’t wanted to go to theparty in honor of Zack and Gabe, but he didn’t exactly know how he could get out of it gracefully either without pissing Marco off.Reluctantly he’d taken a hot shower and tried to get all the paint off his fingers, clean up and look respectable for the evening.He’d been working hard all day, priming and painting over at the new addition, and he wasn’t in much of a party mood. Evan looked happy, though, as he stood by the sink shaving, a skimpy towel wrapped around his cute ass. Tempting, very tempting. Brett sighed.He’d like nothing better than to curl up on the sofa with a cold beer in one hand and Evan’s cock in the other tonight. He certainly didn’t feel like dancing, or watching the two alphas’ pets shaking their asses this evening, like he knew they probably would be. Really, it was plain embarrassing. Both young men were gorgeous, if a little too flamboyant for his taste. If they got out there tonight dancing around and grinding their hips, what was a redblooded young wolf supposed to look at? Better not be his alpha’s mate, if he knew what was good for him. Besides, he’d much rather look at his own mate’s shapely hips, and he could do that just as well at home. Evan passed him on the way out of the bathroom, tossing him a flirtatious little glance as he went, pulling the towel off at the door so he could get a good look at that shapely little ass. Damn, now he had a raging hard-on to contend with on top of everything else. He turned a blast of cold water on for as long as he could stand it, and then got out of the shower and dried himself off.He peered at himself in the mirror for a moment, decided he didn’t really need a shave, then used the blow dryer for a few minutes on his mane of auburn hair. He walked out to the bedroom and stopped dead in his tracks. Evan was wearing perhaps the tightest pair of leather pants he’d ever seen. He must have lain down on the bed to get them zipped. He’d paired it with a black t-shirt, also skin-tight, and a pair of black boots that laced up the front and went all the way to his knees. His blond hair was a little tousled and held in place with a touch of hair gel. He looked hot as hell and he knew it. He turned and gave Brett a little smile, and just as Brett opened his mouth to tell him to take off that fuck-me-please outfit, he whipped out a black leather strip from the dresser and held it out to Brett.“Would you like me to wear this too, babe?I saw how much you admired Gabe’s collar.” Brett took the leather strip in his hands and looked up at Evan wonderingly. “Really?” Brett’s mouth had gone instantly dry as his cock raised up again so fast it almost bounced. He had a hard time talking as he took it from his mate, and when he finally managed to speak his voice came out hoarse and ragged.“What...um...what made you decide to do this?” “Well, I noticed how much you admired Gabe’s gold collar. What is it you like about them so much, Brett?Are they like a symbol of something for you?” He angled another coquettish look up at him.“You do like the way it looks, don’t you, Brett?” Brett nodded and cleared his throat. “Oh hell, yeah. Yeah, I like it.” He stepped forward and buckled the thin leather strip around Evan’s throat, running a finger under it to make sure it wasn’t too tight. Then he bent down and trailed kisses down his throat, stopping just above his collarbone, where he sucked the tender skin up into his mouth to raise a mark. When he pulled away, he was happy to see a little hickey placed strategicallybeneath the collar where it couldn’t be missed or mistaken for anything else. Evan clapped a hand over his neck and pushed Brett away. “Damn it, Brett!” Brett just smiled and slapped him on his ass as he walked to the bed to pick up his own clothes, jeans and white, long-sleeved button-up shirt. He pulled on leather cowboy boots to complete his outfit and stood up, holding out his arms.“How do I look, sweetheart? Do I look l country enough for this party of Nicky’s?” “ Well youact like a redneck, that’s for sure.Come on, let’s go to the party. I feel like dancing tonight.” Brett followed him, but the first hint of unease hit him as he walked along behind his mate, his ass swinging along provocatively in his too-tight leather pants. When they walked into the main room, he was distracted at first by the dim lights, the loud music and the large number of people in the room. Evan slipped into the crowd and Brett lost sight of him right away, but he saw a table where Casey was sitting with Rory and made his way over to it. They were both eating from the buffet tables, so before he sat down, he walked over to fill a plate. He was starving and hadn’t eaten since early that morning, so for a while all his focus was on the food laid out for them on the buffet. He looked around again for Evan, but didn’t see him right away. He filled his plate and sat down with Casey and Rory. “Your boy’s looking good, Brett,” Casey nodded across the room. “He and Nicky could almost be twins.”","sourceLink":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5/page-21.html","bookId":2257,"book":{"id":2257,"title":"Wolfsbane (Dark Hollow Wolf Pack #5)","description":"Storyline: Wolfsbane (Dark Hollow Wolf Pack #5) Evan Grant, a security guard in the Hunters’ prison, is anxious to prove himself with the group. A new prisoner arrives, and Evan feels an immediate attraction. The shifter is Brett, the most handsome man Evan’s ever seen, and the tortures the Hunters have put him through touch Evan’s heart. Bringing him pain medicine and food, he makes a strong connection with the handsome shifter. His attraction is overwhelming, and it becomes even more difficult when the Hunters’ scientists ask him to volunteer to mate with the shifter so they can study the bloodmatch. He agrees to the experiment only after the scientists promise nothing can go wrong, but after Evan mates with Brett, he overpowers the guards and escapes, taking Evan with him. It doesn’t take long to discover Evan’s the newest “pet” of the Mountain Wolf Pack, and Brett is his new master.","cover":"https://allnovel.net/images/wolfsbane-dark-hollow-wolf-pack-5.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:15:54 PM"}}
