{"id":86643,"no":22,"title":"Page 22","content":"\\n\\n Brett jerked his attention up to where Casey was pointing. Evan was standing with Nicky near the little dance floor, and he could see they were dressed almost exactly alike. Same leather pants, black t-shirt and laced up boots. Nicky, too, was wearing the little strap of leather around his neck. Since both the good-looking men were blond and about the same size, they almost did look like brothers. Two more people joined them and Brett felt steam rising. It was Gabe and Logan, wearing the exact same outfits and sporting the little black leather collars. They looked like some kind of little gang, and the twinges of unease he’d felt earlier became full pangs of alarm. What the hell were they planning?\\n\\n The music started, some loud twangy party song about rowdy friends“gettin’ down”, and all four of the men pulled off their t-shirts and threw them on a nearby table. They stood in a little circle and started to dance, but not just regular dancing. This dancing was dirty, raw and hot as hell. All of them gorgeous, young and buff, they were thrusting their hips at each other and generally looked like they were having sex on the dance floor.\\n\\n Casey started laughing and looked over at Brett, who had half-risen from his chair.“Better tighten up on that, Brett, before somebody else does.”\\n\\n Brett threw down his fork and stood all the way up, shooting a look of pure fury around him. He saw everybody’s attention had been drawn to the four young men, and he didn’t at all like the kind of attention they were getting. A few of the unattached young gammas were pointing and nudging each other and one or two even moved over next to the group and were dancing alongside them.One of them looked up and caught Brett’s eye as he stalked toward them, froze and melted back into the crowd. The other one made the mistake of standing behind Nicky, making a motion like he was humping him.\\n\\n Nicky pushed him away and climbed up on a table to dance. Evan climbed up beside him. With wicked looks directed at their respective mates, they both slowly unsnapped their tight pants and began to pull them ever so slowly down their hips. Before Brett could arrive, the young gamma, who was practically salivating by now, had been thrown halfway across the room as Marco arrived on the scene. He then turned, snatched Nicky off the table, and strode off the dance floor with him.\\n\\n The music stopped as people started trying to gather close to see what was going on, and jostled each other excitedly as the wolf mates arrived. Zack and Brett arrived at the same time, each one snatching up their mates in their arms. Brett saw Ian looming over Logan with his hands on both Logan’s wrists, but he wasted no time with anyone else. He had problems of his own.\\n\\n He’d thrown Evan over his shoulder to take him from the room, and Evan was making his displeasure known. Yelling and trying to raise up off his shoulders, Evan was furious, but no more so than Brett.He swatted Evan’s backside hard as he took him to their room and threw him down on the bed. Evan tried to jump back up and Brett pushed him back down again.\\n\\n “What the hell did you think you were doing, Evan? You made a spectacle of yourselves! All of you! Whose brilliant plan was this anyway?Nicky’s? Gabe’s? And you were stupid enough to go along with it.”\\n\\n “Leave me alone, Brett. How dare you drag me out of there like some kind of fucking caveman?”\\n\\n “How do I dare? You belong to me, damn it!I’ll do whatever I want to with you!”\\n\\n Evan opened his mouth in surprise.“Stop saying that! I belong to myself, not you!” He reached up and unbuckled the collar from around his neck and tossed it on the bed.“I wore this tonight to show you it’s a bunch of crap. My wearing a stupid collar means nothing to me. You don’t control me. I’m your mate, and I love you. But I’m not your possession. It’s fine for Gabe, because he and Zack have that kind of relationship.It’s something Gabe wants. But this collar is something you want because of your pride.It has to be about both of us or it’s meaningless.”\\n\\n “You and Nicky both were flaunting your bodies!”\\n\\n “If I was, then it’s mine to flaunt! I can do whatever I want, Brett,and you don’t control me!”\\n\\n “You can do whatever you want, huh?I don’t control you? I think it’s time to explain a few things toyou, Evan.” He leaned over the bed and began to take off Evan’s boots.“Don’t fight me, Evan,” he said as he started to struggle and kick. “I’ve let you get away with far too much, and it’s over. As Casey told me, it’s time for me to tighten up.”\\n\\n Nicky was having a second cup of coffee when Logan tapped on the door and came in. “Is the coast clear?” he asked with a smile. At Nicky’s nod, he came all the way inside and sat at the bar beside him.“Is Marco still mad? “Oh hell, yes, but he’s alway s mad at me about something, though I must admit this one is worse than usual.It wasn’t the dancing that pissed him off so much—he’s seen me do that before and even joined me on the dance floor. He hated me unsnapping my pants. I tried to convince him I was only teasing, but he wasn’t buying it. He says I’m ‘an instigator’ again too. Heck, it was Gabe’s idea, I only went along with it. Although I guess I did go a little too far.” He dipped his head in embarrassment.“What about you?”\\n\\n “Yeah, Ian huffed and puffed about it for a while, but it’s pretty much blown over now. He was not too pleased about the leathers and the collars. He said some of the older human pets still wear them, and we shouldn’t make fun of things we don’t understand. I can see his point, but that wasn’t what we were doing exactly. I mean, Gabe’s a submissive who wears his all the time, and that’s his choice. I respect that. I stilldon’t like it when it’s forced on someone, and I didn’t much likeCasey’s and Zack’s attitudes about human pets and collarswhen you told me,” he shrugged.\\n\\n “I tried to explain to Marco it was just a joke, but he said it wasn’t funny to a lot of people. Brett got really mad at Evan, I understand.”\\n\\n “Really? Have you talked to him?”\\n\\n “No. Brett’s got him locked down in his room. Marco told me to stay out of it, but I was actually getting ready to go check on him. You want to go with me?”\\n\\n “Sure, I have time. The selfdefense class doesn’t start for another hour yet. Can we get in to see him?”\\n\\n Nicky smiled.“I have the passkey. I stole it off Marco’s key ring this morning. C’mon, Brett should be at work by now.”\\n\\n They walked downstairs down halls that were mostly empty this time of day until they reached Brett and Evan’s door. Using his key, Nicky opened the door.“Anyone home?” he called softly. There was no answer, and he glanced over at Logan uneasily.\\n\\n “You don’t think he’s done somethingto him, do you?”\\n\\n Logan laughed.“Nicky, you’re so dramatic. Let’s look in the bedroom.” Logan eased open the door and they saw Evan sound asleep on the bed, one hand over his head and cuffed to the headboard.\\n\\n “What the hell?” Nicky crossed over to the bed and sat down beside Evan, shaking him gently. He never moved. He was naked and had bite marks on his neck and shoulders. Nicky shook him harder and finally one eye opened just a little.\\n\\n “Whassa matter?” Evan said in a weak voice. “Sleepy...”\\n\\n Nicky looked up at Logan.“Damn Brett!He’s been feeding him too much. Probably fucking him half to death too, the asshole.Look over in that drawer for a key to this cuff.” Logan opened a few drawers until he found another cuff and a key. He used the key to unlock Evan and he chafed his reddened wrist in his hands, while Nicky sat fuming. “This is bullshit, Logan. I’m getting him out of here.”\\n\\n “Nicky, calm down. He’s not hurt, and yeah, it looks like Brett’s been feeding him too much, probably to keep him calm. We may just need to stay out of this.”\\n\\n “No, I won’t stay out of it. Look at those marks on him. This is what Marco did to me when I first came. He used to feed me too much blood to make me sleep all the time, and he locked me in cuffs a couple of times.The wolves used to claim it calmed pets down to be ‘controlled’ and put in restraints. I hated it then and I hate it now.It’s why Marco and I almost broke up, and I thought I’d managed to put a stop to this kind of thing.”\\n\\n “At least go get Marco and tell him about it.If he’s really changed the laws, then he’ll back you up.You don’t need to get between a wolf and his mate without Marco’s support.” Nicky set his jaw firmly.“I’ll tell Marco, just as soon as I get Evan out of here. Help me with him, Logan.I’m taking him home with me.”\\n\\n Brett stood in front of Marco, anxious and tense about Evan. He wondered where he was and if he was okay. What was Evan thinking? Did he hate him now? Was he asking to leave? He finally became aware that Marco had asked him a question.\\n\\n “What? Uh..sir? I didn’t hear you.”\\n\\n “I asked you if you put hands on him, Brett? Did you hit him?”\\n\\n “No!” Brett replied indignantly. “I would never hurt Evan! I-uh-I took his clothes off. He didn’t like that too much.” He shifted his feet.“And I made him drink blood, but I never hit him at all.Did he say I hit him?” His tone was incredulous, and Marco shook his head. “No, but I wanted to ask you to make sure he wasn’t trying to protect you.” Marco sat back in his chair and gazed at him sternly.“He did have bite marks on his neck.He said you’d been having a lot of sex with him too.”\\n\\n Brett could feel a flush come over his whole body. It was true he’d gotten a little possessive and carried away the last couple of days.Okay, a lot carried away, and he’d planned on coming home that afternoon after work and releasing Evan and trying to patch things up between them. He’d always heard from the older wolves that feeding the human pets would calm them, and Evan had needed a lot of calming down after he stripped his clothes off him the other night. They said to tie him up or put him in cuffs and it would help him to regain his temper.Boy, they’d been wrong about that. When he’d tied Evan up the night before,he’d practically tried to claw his eyes out and kicked him off the bedbefore he’d managed to subdue him. After he’d cuffed him that morning, he’d had to feed him again just so he could leave for work. \\n\\n","sourceLink":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5/page-22.html","bookId":2257,"book":{"id":2257,"title":"Wolfsbane (Dark Hollow Wolf Pack #5)","description":"Storyline: Wolfsbane (Dark Hollow Wolf Pack #5) \\n Evan Grant, a security guard in the Hunters’ prison, is anxious to prove himself with the group. A new prisoner arrives, and Evan feels an immediate attraction. The shifter is Brett, the most handsome man Evan’s ever seen, and the tortures the Hunters have put him through touch Evan’s heart. Bringing him pain medicine and food, he makes a strong connection with the handsome shifter. His attraction is overwhelming, and it becomes even more difficult when the Hunters’ scientists ask him to volunteer to mate with the shifter so they can study the bloodmatch. He agrees to the experiment only after the scientists promise nothing can go wrong, but after Evan mates with Brett, he overpowers the guards and escapes, taking Evan with him. It doesn’t take long to discover Evan’s the newest “pet” of the Mountain Wolf Pack, and Brett is his new master.\\n","cover":"https://allnovel.net/images/wolfsbane-dark-hollow-wolf-pack-5.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wolfsbane-dark-hollow-wolf-pack-5.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:15:54 PM"}}
