{"id":78859,"no":18,"title":"Page 18","content":"Why hadn’t his mother brought the evidence forth after his death and cleared his name? Instead, she had relinquished all control over the Stafford estates and married a fat-brain like Dickie Harewood. Why? For money? Had she been left without even the estates she had inherited from her mother?\n There were so many questions to be answered and so much injustice to correct. And there was so much honor at stake.\n All Nicholas felt he knew for sure was that he had been called forward to this time to discover what he needed to know. And, for some fortuitous reason, he had been given this lovely young woman to assist him. Looking back at her, he smiled. Would he have been as generous as she if she had come to him and told him she was from the future? He thought not. He might have ordered the lighting of the fires that burned her as a witch.\n But she had devoted all her time to him, reluctantly at first, but he had soon discovered that it was not in her nature to be ungenerous.\n And now, he thought with a sigh, she was falling in love with him. He could see it in her eyes. In his time, when a woman started to love him, he left her. Women who loved you were an annoyance. He much preferred women like Arabella who liked jewels or a fine piece of silk. He and Arabella understood each other. There was only sex between them.\n But that was not the way with this Dougless. She would be one to give love, and to love with all her being. That man Robert had had some of her love, but, obviously, he was too stupid to know what to do with it. Nicholas could see that the man used Dougless, played with her love, and enjoyed his control over her.\n Nicholas took a step toward her. If he, Nicholas, had her love, he would know what to do with it. He would—\n No! he told himself, then looked away. No, he could not let her love him. When he left this modern world, she would be overcome with grief. Nicholas would not like to return and think of her here alone, think of her loving a man who’d been dead over four hundred years.\n Therefore, he had to find a way to make her stop loving him. He couldn’t feign anger and send her away because he needed her knowledge of this foreign world. But, at the same time, he couldn’t bear to think of leaving her behind in misery. He had to find a way to stop her love, and it had to be a way she could understand, a way that related to her world, not his.\n Smiling at the absurdity of the idea, Nicholas thought that perhaps he could tell her he was in love with another woman. That usually set women off in any century. But who? Arabella? He almost laughed aloud when he thought of the postcard Dougless had bought. Perhaps a woman she’d not heard of would be better. Alice? Elizabeth? Jane? Ah, dear little Jane.\n He stopped smiling. What about Lettice?\n In love with his wife?\n Nicholas hadn’t thought of that cold-eyed bitch in weeks. When he had been arrested for treason, Lettice had started looking for a new husband.\n Could he make Dougless believe he was in love with his wife? That movie had shown people marrying for love. Perhaps if he told Dougless he wanted to go back because he loved his wife so much . . . He could not believe Dougless would consider love more important than honor, but this age was very strange to him.\n Now all he had to do was find a place and time to tell her.\n He had made his decision, but it didn’t make him feel better. Quietly, he left the room. He’d go to the coin dealer and see about selling more of the coins. Tomorrow, they would go to Thornwyck Castle and start finding the answers to his questions.\n With one last look at Dougless, he left the room.\n Dougless awoke with a start, and when she saw she was alone, a sense of panic gripped her, but she calmed herself. Then the scene with Robert came back to her. Had she done the right thing? Should she have gone with him? After all, Robert did apologize—sort of. He’d explained why he’d left her: he thought she was refusing to travel with him, and maybe Gloria had picked up her handbag innocently.\n Dougless put her hands to her head. Everything was so confusing. What did she mean to Robert? To Nicholas? What did these men mean to her? Why had Nicholas come to her? Why not to someone else? Why not to someone who wasn’t confused about everything in her life?\n The door opened and Nicholas came in smiling. “I have sold but a few of the coins and we are rich!” he said.\n Smiling back at him, she remembered the way he’d pushed Robert out the door. Was this man her Knight in Shining Armor? Had he been sent to her because she just plain needed him so much?\n Her look seemed to annoy Nicholas, for he turned away, frowning. “Shall we have supper?” he asked.\n As they walked through the village on their way to an Indian restaurant their landlady had recommended, they were both quiet, each thinking hard on their own thoughts. Once they were at the restaurant, Nicholas gave himself over to the food. He loved the flavors of the cumin, coriander, garam masala, and cinnamon all mixed together. As he ate, Dougless saw envious looks directed toward them from several women at nearby tables. Out of interest, and partly to keep him from looking at the women, she asked him what food they ate in 1564, and was it very different from food in the twentieth century?\n He talked, but Dougless didn’t really listen. Instead, she looked at his eyes and his hair, and watched the way his hands moved. He wasn’t going to leave this century, she thought. She’d wished him forward and he’d come to her. She knew enough about him to know that he was the man she’d always wanted: kind, thoughtful, funny, strong, a man who knew what he wanted.\n By the end of dinner, Nicholas had grown quiet and something seemed to be worrying him. They were silent as they walked back to the bed-and-breakfast. Nor did he want to talk once they were in their room. He didn’t even want Dougless to read to him. When he went to bed, he turned away from her without so much as a good night.\n Dougless lay awake for a long time, trying to puzzle out what had happened to her in the last few days. She had cried and begged for a Knight in Shining Armor and Nicholas had come to her. That one fact seemed to prove that he was hers and she was meant to keep him.\n Near midnight, just as she was finally dozing, she was startled by sounds from Nicholas. She smiled, knowing he was again having a bad dream. Still smiling, she went to him and climbed into bed beside him. At once he clasped her in his arms and immediately fell into a peaceful sleep. Dougless snuggled close, her cheek on his furred chest, and contentedly went to sleep. Let what is to be, happen, she thought.\n When Nicholas awoke it was daylight, and when he realized Dougless was in his arms, he knew his dreams had come true. She fit his body as though they were carved from one piece of earth. What was the word she used? Telepathy. There was a feeling between them, a deep bond that he’d never come close to feeling with another woman.\n Putting his face in her hair, he breathed deeply, and his hands began to caress her. He’d never felt such lust as he felt for her, never even known such lust existed.\n “Give me strength,” he prayed, “strength to do what I must. And forgive me,” he whispered.\n He hoped he could do what he had to, but first he wanted to taste her, just this once, this one and only time; then never again would he allow himself to touch her.\n He kissed her hair, her neck, his tongue on her smooth skin. His hand ran up her arm, then covered her breast. Nicholas’s heart was in his ears.\n Waking, Dougless turned in his arms to kiss him—a kiss such as she’d never experienced before. The other half of me, she thought. What I have been missing all my life is this man. He’s the other half of me.\n “Lettice,” Nicholas murmured near her ear.\n Their legs were entwined, their arms clasping one another. Dougless smiled, her head back as Nicholas placed hot kisses on her neck and throat. “I’ve been called . . . Carrots,” she said, breathless, “for my hair, but never lettuce.”\n “Lettice is . . .” He was kissing down her throat, lower and lower. “Lettice is my wife.”\n “Mmm,” Dougless murmured as his hand caressed her breast and his lips went lower.\n What he’d said hit her suddenly. She pushed away to look at him. “Wife?” she asked.\n Nicholas pulled her back to him. “We care naught for her now.”\n She pushed away from him again. “You seem to care about her enough to say her name when you’re kissing me.”\n “A mere slip,” he said, pulling her toward him.\n Dougless shoved at him hard, then got out of bed and straightened her unbuttoned gown. “Why don’t you explain to me about this wife of yours?” she demanded angrily. “And why haven’t I heard of her before? I know you had a child, but you said the mother had died.”\n Nicholas sat up in bed, the sheet to his waist. “There was no reason to tell of my wife. Her beauty, her talents, and my love for her are private to me.” He picked up Dougless’s watch off the table. “Perhaps today we will purchase me such as this.”\n “Put that down!” Dougless snapped. “This is serious. I think you owe me an explanation.”\n “Explain to you?” Nicholas said, getting out of bed, wearing only a pair of tiny briefs. He pulled on his trousers, then turned to her as he fastened them. “Pray, madam, who are you? Are you a duke’s daughter? An earl’s? Even a baron’s? I am the earl of Thornwyck, and you are my servant. You work for me. In return, I feed you and clothe you, and perhaps, if you are worth it, I will mayhap give you a small stipend. I have no obligation to tell you of my own life.”\n Dougless sat down hard on the bed. “But you never mentioned a wife,” she said softly. “Not once have you referred to her.”\n “I would be a poor husband to profane my beloved’s name to my servant.”\n “Servant,” Dougless whispered. “Do you love her very much?”\n Nicholas snorted. “She is the true reason I must return. I must find the truth, then return to my loving wife’s arms.”\n Dougless was having difficulty understanding what she was hearing. Robert yesterday and today finding that Nicholas had a wife—a wife he loved madly—was more than she could handle. “I don’t understand,” she said, burying her face in her hands. “I wished you here. I prayed for you. Why did you come to me if you love someone else?”\n “You prayed on my tomb. Perhaps if anyone had done that—man or woman—I would have come forth. Perhaps God knew I would need a servant and you needed work. I do not know. All I do know is that I must return.”\n “To your wife?”\n “Aye, to my wife.”\n She turned to look at him. “And what of this?” she asked, motioning to the bed.\n “Madam, you placed yourself in my bed. I am but a man, therefore I am weak.”\n As understanding came to Dougless, she began to feel deeply embarrassed. Was there any woman on earth who was a bigger fool than she was? Was there any man on earth she hadn’t fallen in love with? Let her spend three days with a man and she began to imagine a life together. If Attila the Hun or Jack the Ripper had come forward, she’d no doubt have fallen in love with him. With her luck, she’d be in love with Genghis Khan in two days.\n She stood up. “Look, I’m sorry for the misunderstanding. Of course you have a wife. A beautiful wife and three lovely kids. I don’t know what I was thinking of. You were on death row and married. I’m used to guys with only one major strike against them. I just seem to get luckier and luckier. I’ll get my things and get out of here. You go back to Mrs. Stafford and have a swell life.”\n He blocked the entrance to the bathroom. “You mean to unkiss the bargain?”\n “‘Unkiss’?” she asked, voice rising. “Again with the ‘unkiss.’ Yes, I mean to unkiss, unhug, un-whatever else it needs. You don’t need me, not when you have lovely Lettice and Arabella-on-the-table.”\n When Nicholas moved toward her, his voice lowered seductively. “If our interrupted love play annoys you, we may return to the bed.”\n “Not on your life, buster,” she said, eyes blazing. “Put one hand on me and you draw back a bloody nub.”\n Nicholas put his hand over his jaw to hide a smile. “I see no cause for your anger. I have represented myself truly. I need help in searching for the person who betrayed me. I want to find the information and return to my home. I have never been false with you.”\n Dougless turned away. He was right. He’d never been secretive in any way. She was the one who’d imagined castles in the sky and their living happily ever after. Idiot, idiot, idiot, she told herself.\n She turned back to him. “I’m sorry about all this. Maybe you should get someone else to help you. I’ve got my passport now, and my plane ticket, so I think I’d better go home.”\n “Ah, yes,” he said. “I see. You are a coward.”\n “I am no such thing. It’s just . . .”\n “You have fallen in love with me,” he said with a sigh of resignation. “All the women do. It is a curse that plagues me much. I cannot spend three days with a woman and not have her come to my bed. Think not on it. I do not blame you.”\n “You don’t blame me?” Anger was beginning to replace Dougless’s self-pity. “Listen, mister! You overrate your charms by a long shot. You don’t know what women are like today. Any liberated women could live in the same house with you and not fall for you. We don’t like conceited, puffed-up peacocks like you.”\n “Oh?” he said, one eyebrow raised. “It is just you who is different? In just three days’ time you are in my bed.”\n “For your information, I was trying to settle you down after a nightmare. I thought I was comforting you. Like a mother and child.”\n Nicholas smiled. “Comfort? You may comfort me any morn you wish.”\n “Save it for your wife. Now, will you get out of the way? I need to get dressed and get out of here.”\n He put his hand on her arm. “You are angry at me that I kissed you?”\n “I’m angry at you because . . .” She turned away. Why was she angry at him? He’d awakened and found her in his bed and he’d started kissing her. Before today, he hadn’t made a pass at her; he hadn’t been anything but a gentleman. Never once had he even hinted that they were more than employer and employee.\n It was she who’d made everything up. Out of his teasings, out of the laughter they’d shared and, especially, out of her hurt over Robert, she’d imagined more between them than there was.\n “I’m not angry at you at all,” she said. “I’m mad at myself. I guess I was on the rebound.”\n “‘Rebound’?” \n","sourceLink":"https://allnovel.net/a-knight-in-shining-armor-montgomery-taggart-15/page-18.html","bookId":1851,"book":{"id":1851,"title":"A Knight in Shining Armor (Montgomery/Taggart #15)","description":"Storyline: \n New York Times bestselling author Jude Deveraux will capture your heart with this reissue of her signature classic novel, a time-travel romance featuring a present-day heroine and a dashing hero from the sixteenth century! \n Abandoned by a cruel fate, lovely Dougless Montgomery lies weeping upon a cold tombstone in an English church. Suddenly, the most extraordinary man appears. It is Nicholas Stafford, Earl of Thornwyck…and according to his tombstone he died in 1564. \n Drawn to his side by a bond so sudden and compelling it overshadows reason, Dougless knows that Nicholas is nothing less than a miracle: a man who does not seek to change her, who finds her perfect, fascinating, just as she is. What Dougless never imagined was how strong the chains are that tie them to the past…or the grand adventure that lay before them. \n Hailed worldwide as one of the most romantic novels of all time, A Knight in Shining Armor is “a glorious love story that spans centuries, worlds, and souls. It is the epitome of every woman’s fantasy” (Chicago Daily Herald).\n \n","cover":"https://allnovel.net/images/a-knight-in-shining-armor-montgomery-taggart-15.jpg","author":"Jude Deveraux","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-knight-in-shining-armor-montgomery-taggart-15.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:10:40 PM"}}
