{"id":78849,"no":8,"title":"Page 8","content":"He gave the tea a tentative look, then sipped cautiously. After two sips, he looked at Dougless with such na**d joy on his face that she laughed as he drained the cup. She poured him another cup while he picked up the scone and looked at it. It was very much like a southern American biscuit, but it had sugar in the dough, and these were fruit scones, so they had raisins in them. She took the scone from him, broke it in half and slathered it with the thick clotted cream. He bit into it and as he chewed he looked like a man who had fallen in love. In minutes he had drunk all the tea and eaten all the scones. After a couple of remarks about his gluttony, Dougless went back into the shop and bought more of everything. When she returned, she ate while he leaned back in his chair, sipped tea, and studied her. “What made you to weep in the church?” he asked. “I . . . I really don’t believe that’s any of your business.” “If I am to return—and I must return—I need to know what brought me forth.” Dougless put her half-eaten scone down. “You aren’t going to start that again, are you? You know what I think? I think you’re a graduate student in Elizabethan history, probably Ph.D. level, and you got carried away with your research. My father said it used to happen to him, that he’d read so much medieval script that after a while he couldn’t read modern handwriting.” Nicholas looked at her with distaste. “For all your wonders of horseless chariots, your marvelous glass, and the riches of goods to purchase, you have no faith in the mystery and magic of the world,” he said softly. “But I do not doubt what has happened to me, and I know from whence I came,” he said evenly. “And you, witch—” At that, Dougless got up and left the table. But he caught her before she reached the door to the shop, his hand cutting into her arm. “Why were you weeping when first I saw you? What could cause a woman to weep such as I heard?” he demanded. She jerked out of his grip. “Because I’d just been left behind,” she said angrily. Then, to her shame, tears began again. Gently, he slipped her arm in his and led her back to the table. This time, he sat beside her, poured her another cup of tea, added milk, and handed her the pretty porcelain cup. “Now, madam, you must tell me what plagues you so that tears pour forth from your eyes as from a waterfall.” Dougless didn’t want to tell anyone what had happened to her. But her need to share was greater than her pride, and within minutes, she was pouring out her story to him. “This man left you alone? Unattended?” Nicholas asked, aghast. “He left you at the mercy of ruffians and thieves?” Nodding, Dougless blew her nose on a paper napkin. “And at the mercy of men who believe they’re from the sixteenth century, too. Oh, sorry,” she added. But Nicholas didn’t seem to hear her. He got up and began pacing the garden. There were four other tables but no other customers. “You but knelt by the tomb—my tomb—and asked for a . . .” He looked at her. “A Knight in Shining Armor. It’s an American saying. All women want a gorgeous . . . I mean, a . . . Well, a man to rescue her.” Smiling a bit, his lips hidden in his beard and mustache, he said, “I was not wearing armor when you called me forth.” “I didn’t call you,” she said fiercely. “It’s customary to cry when you get left in a church. Especially when a fat brat of a girl steals your handbag. I don’t even have a passport. Even if my family wired me money for a ticket home, I couldn’t leave immediately. I’d have to apply for another passport.” “Nor can I get home,” he said, beginning to pace again. “That we have in common. But if you brought me forth, you can send me back.” “I am not a witch,” she practically shouted at him. “I do not practice black magic, and I certainly don’t know how to send people back and forth in time. You’ve imagined all of this.” He raised an eyebrow at her. “No doubt your lover was justified in leaving you. With your vile temper, he would not want to remain with you.” “I was never ‘vile-tempered’ as you call it, with Robert. Maybe a little-short-tempered now and then, but only normally so, because I loved him. Love him. And I shouldn’t have complained so much about Gloria. It was just that her lying was beginning to get on my nerves.” “And you love this man who abandoned you, this man who allowed his daughter to steal from you?” “I doubt if Robert knows Gloria took my bag and, besides, Gloria is just a kid. She probably doesn’t even realize what she did. I just wish I could find them and get my passport back so I could go home.” “It seems we have kindred goals,” he said, his eyes boring into hers. Suddenly, she knew where he was leading. He wanted her to help him on a permanent basis. But she was not going to saddle herself with a man with amnesia. She set her empty cup down. “Our goals aren’t alike enough that we should spend the next few months together until you remember that you live in New Jersey with your wife and three kids, and that every summer you come to England, put on fancy armor, and play some little sex game with an unsuspecting tourist. No, thank you. Now, if you don’t mind, I believe we have an agreement. I’ll find you a hotel room, then I’m free to leave.” When she finished speaking, she could see the flush of anger through his beard. “Are all the women of this century as you are?” “No, just the ones who have been hurt over and over again,” she shot back at him. “If you really have lost your memory, you should go to a doctor, not pick up a woman in a church. And if this is all an act, then you should definitely go to a doctor. Either way, you don’t need me.” She put the tea things on the tray to carry them back into the shop, but he stood between her and the door. “What recourse have I if I tell the truth? Have you no belief that your tears could have called me from another time, another place?” “Of course I don’t believe that,” she said. “There are a thousand explanations as to why you think you’re from the sixteenth century, but not one of them has to do with my being a witch. Now, will you excuse me? I need to put these down so I can find you a hotel room.” He stepped aside so she could enter the tea room, then followed her to the street. All the while, he kept his head down as though he were considering some great problem. Dougless had asked the woman in the tea shop where the nearest bed-and-breakfast was, and as she and Nicholas walked quietly along the street, it bothered her that he didn’t speak. Nor did he look about him with the intense interest he’d shown earlier. “Do you like your clothes?” she asked, trying to make conversation. He was carrying the shopping bags full of armor and his old clothes. He didn’t answer, but kept walking, his brow furrowed. There was only one room available at the bed-and-breakfast, and Dougless started to sign the register. “Do you still insist that you’re Nicholas Stafford?” she asked him. The woman behind the little desk smiled. “Oh, like in the church.” She took a postcard of the tomb in the church from a rack and looked at it. “You do look like him, only a bit more alive,” she said, then laughed at her own joke. “First door on the right. Bath’s down the hall.” Smiling, she left them alone in the entrance hall. When Dougless turned to look at the man, she suddenly felt as though she were a mother abandoning her child. “You’ll remember soon,” she said soothingly. “And this lady can tell you where to get dinner.” “Lady?” he asked. “And dinner at this hour?” “All right,” she said, frustrated. “She’s a woman and a meal this late is supper. I’ll bet that after a good night’s sleep you’ll remember everything.” “I have forgot naught, madam,” he said stiffly, then seemed to relent. “And you cannot leave. Only you know how to return me to my own time.” “Cut me some slack, will you?” she snapped at him. Didn’t he understand that she, too, had needs? She couldn’t give up all that she needed to help this stranger, could she? “If you’ll just give me the fifty dollars we agreed on, I’ll leave. In pounds, that’s . . .” To her horror, she realized that was only about thirty pounds. A room in this bed-and-breakfast had cost forty pounds. But a deal was a deal. “If you’ll give me thirty pounds, I’ll be on my way.” When he just stood there, she rummaged in the shopping bags until she found his paper money; then she removed thirty pounds and gave him the rest of it. “Tomorrow you can take your coins to the dealer and he’ll give you more modern money,” she said as she turned to go. “Good luck.” She gave one last look to his blue eyes that looked so sorrowful, then turned and left. But once she left the house, she didn’t feel jubilant at finally having rid herself of the man. Instead, she felt as though she were missing something. But Dougless forced herself to put her shoulders back and her head up. It was getting late and she had to find a place to spend the night—a cheap place—and she had to decide where to go from here. FIVE When Nicholas found the upstairs room where he was to spend the night, he was appalled. The room was small, with two tiny, hard-looking beds with no cloth hangings enclosing them, and the walls were very bare. But upon closer examination he saw that the walls were painted with thousands of tiny blue flowers. On second thought, he decided that with a few borders and some order to the paintings they might look all right. There was a window with that marvelous glass in it, and it had fabric side hangings of painted cloth. There were framed pictures on the walls, and when he touched one, he felt the glass—so clear he could hardly see it. One of the pictures was quite lewd, showing two na**d women sitting on a cloth near two fully dressed men. It was not that Nicholas didn’t like the picture, but he couldn’t bear to see such a shameful thing displayed so openly. He turned it to face the wall. There was a door that led to a press, but there were no shelves in it. There was only a round stick going from one side to the other, with the same steel shapes that he had seen in the clothes shop hanging from the stick. There was a cabinet in the room, but such as he’d never seen before. It was entirely full of drawers! He tried, but the top of the cabinet did not lift up. He pulled the drawers out one by one and they worked marvelously well. After a while, Nicholas began to look for a chamber pot, but one was not to be found anywhere in the room. Finally, he went downstairs and out to the back garden to find a privy, but there was none. “Have things changed that much in four hundred years?” he mumbled as he relieved himself in the rosebushes. He fumbled with the zipper and snaps, but managed rather well, he thought. “I will do well without the witch,” he said to himself as he went back into the house. Perhaps tomorrow he would wake and find this all to be a dream, a long, bad dream. No one was about downstairs, so Nicholas looked into a room with an open door. There was furniture in the room that was fully covered with fine, woven fabric. There was a chair with not one inch of wood showing. When he sat on the chair, the softness enveloped him. For a moment he closed his eyes and thought of his mother and her old, frail bones. How she’d like a chair like this, covered in softness and fabric, he thought. Against one wall was a tall wooden desk with a stool beneath it. Here was something that looked somewhat familiar. When he examined the cabinet, he saw the hinge and lifted the top. It was not a desk but a type of harpsichord, and when he touched the keys, the sound was different. There was written music in front of him and for once something looked familiar. Nicholas sat down on the stool, ran his fingers over the keys to hear the tone of them, then, awkwardly at first, began to play the music before him. “That was beautiful.” Turning, he saw the landlady standing behind him. “‘Moon River’ always was one of my favorites. How do you do with ragtime?” She searched inside a drawer in a little table that had an extraordinary plant on top of it and withdrew another piece of music. “They’re all American tunes,” she said. “My husband was an American.” The most extraordinary piece of music, called “The Sting,” was put before Nicholas. It took him some time before he played it to the woman’s satisfaction, but once he understood the rhythm of the music, he played it with enjoyment. “Oh, my, you are good,” she said. “You could get a job in any pub.” “Ah, yes, a public house. I will consider the possibility,” Nicholas said, smiling as he stood up. “The need of employment might yet arise.” Suddenly, he felt dizzy and reached out to catch himself on a chair. “Are you all right?” “Merely tired,” Nicholas murmured. “Traveling always wears me out. Been far today?” “Hundreds of years.” The woman smiled. “I feel that way too when I travel. You should go up to your room and have a bit of a lie-down before supper.” “Yes,” Nicholas said softly as he started for the stairs. Perhaps tomorrow he would be able to think more clearly about how to get himself back to his own time. Or perhaps tomorrow he’d wake up in his own bed and find that all of it was over, not just this twentieth-century nightmare, but also the nightmare he’d been in when last he was home. In his room he undressed slowly, and hung his clothes up as he had seen done in the clothes shop. Where was the witch now? he wondered. Was she back in the arms of her lover? She was powerful enough to have called him forward over four hundred years, so he had no doubt that she could conjure an errant lover back across mere miles. Nude, Nicholas climbed into bed. The sheets were smooth beyond believing and they smelled clean and fresh. Over him, instead of multiple, heavy coverlets, was a fat, soft, light blanket. Tomorrow, he thought as he closed his eyes in weariness. Tomorrow he would be home. Instantly, he fell into a sleep that was deeper than any he’d ever experienced before, and he heard nothing when the sky opened and it began to rain. Hours after he went to bed, reluctantly, he was awakened by his own thrashing about. Groggily, Nicholas sat up. The room was so dark that at first he didn’t know where he was. As he listened to the rain pounding on the roof, his memory gradually returned. He fumbled at the table beside the bed for flint and candle so he could make a light, but there were none.","sourceLink":"https://allnovel.net/a-knight-in-shining-armor-montgomery-taggart-15/page-8.html","bookId":1851,"book":{"id":1851,"title":"A Knight in Shining Armor (Montgomery/Taggart #15)","description":"Storyline: New York Times bestselling author Jude Deveraux will capture your heart with this reissue of her signature classic novel, a time-travel romance featuring a present-day heroine and a dashing hero from the sixteenth century! Abandoned by a cruel fate, lovely Dougless Montgomery lies weeping upon a cold tombstone in an English church. Suddenly, the most extraordinary man appears. It is Nicholas Stafford, Earl of Thornwyck…and according to his tombstone he died in 1564. Drawn to his side by a bond so sudden and compelling it overshadows reason, Dougless knows that Nicholas is nothing less than a miracle: a man who does not seek to change her, who finds her perfect, fascinating, just as she is. What Dougless never imagined was how strong the chains are that tie them to the past…or the grand adventure that lay before them. Hailed worldwide as one of the most romantic novels of all time, A Knight in Shining Armor is “a glorious love story that spans centuries, worlds, and souls. It is the epitome of every woman’s fantasy” (Chicago Daily Herald).","cover":"https://allnovel.net/images/a-knight-in-shining-armor-montgomery-taggart-15.jpg","author":"Jude Deveraux","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-knight-in-shining-armor-montgomery-taggart-15.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:10:40 PM"}}
