{"id":88710,"no":9,"title":"Page 9","content":"How long since he\u0027d identified with humans? That had all stopped the day he stopped being human himself. Not at the moment he\u0027d stopped being human, though. At first all his anger had been for Hunter Redfern.... Waking up from the dead was an experience you don\u0027t forget. For Quinn, it happened in the Redfern cabin on a husk mattress in front of the fire. He opened his eyes to see three beautiful girls leaning over him. Garnet, with her wine-colored hair shining in the ruby light, Lily with her black hair and her eyes like topaz, and Dove, his own Dove, brown-haired and gentle, with anxious love in her face. That was when Hunter informed him that he\u0027d been dead for three days. \"I told your father you\u0027d gone to Plymouth; don\u0027t tell him otherwise. And don\u0027t try to move yet; you\u0027re too weak. We\u0027ll bring in something soon and you can feed.\" He stood behind his daughters, his arms around them, all of them looking down at Quinn. \"Be happy. You\u0027re one of us now.\" But all Quinn felt was horror-and pain. When he put his thumbs to his teeth, he found the source of the pain. His canine teeth were as long as a wildcat\u0027s and they throbbed at the slightest touch. He was a monster. An unholy creature who needed blood to survive. Hunter Redfern had been telling the truth about his family, and he\u0027d changed Quinn into one of them. Insane with fury, Quinn jumped up and tried to get his hands around Hunter\u0027s throat. And Hunter just laughed, fending off the attack easily. The next thing Quinn knew, he was running down the blazed trail in the forest, heading for his father\u0027s house. Staggering and stumbling down the trail, rather. He was almost too weak to walk. Then suddenly Dove was beside him. Little Dove who looked as if she couldn\u0027t outrun a flower. She steadied him, held him up, and tried to convince him to go back. But Quinn could only think of one thing: getting to his father. His father was a minister; his father would know what to do. His father would help. And Dove, at last, agreed to go with him. Later Quinn would realize that of course he should have known better. They reached Quinn\u0027s home. At that point, if Quinn was afraid of anything, it was that his father wouldn\u0027t believe this wild story of bloodthirst and death. But one look at Quinn\u0027s new teeth convinced his father of everything. He could recognize a devil when he saw one, he said. And he knew his duty. Like every Puritan\u0027s, it was to cast out sin and evil wherever he found it. With that, his father picked up a brand from the fire-a good piece of seasoned pine-and then grabbed Dove by the hair. It was around this time that the screaming started, the screaming Quinn would be able to hear forever after if he listened. Dove was too gentle to put up much of a fight. And Quinn himself was too weak to save her. He tried. He threw himself on top of Dove to shield her from the stake. He would always have the scar on his side to prove it. But the wood that nicked him pierced Dove to the heart. She died looking up at him, the light in her brown eyes going out. Then everything was confusion, with his father chasing him, crying, brandishing the bloody stake pulled from Dove\u0027s body. It ended when Hunter Red-fern appeared at the door with Lily and Garnet. They took Quinn and Dove home with them, while Quinn\u0027s father went running to the neighbors for help. He wanted help burning the Redfern cabin down. That was when Hunter said it, the thing that severed Quinn\u0027s ties with his old world. He looked down at his dead daughter and said, \"She was too gentle to live in a world full of humans. Do you think you can do any better?\" And Quinn, dazed and starving, so frightened and full of horror that he couldn\u0027t talk, decided then that he would. Humans were the enemy. No matter what he did, they would never accept him. He had become something they could only hate-so he might as well become it thoroughly. \"You see, you don\u0027t have a family anymore,\" Hunter mused. \"Unless it\u0027s the Redferns.\" Since then, Quinn had thought of himself only as a vampire. He shook his head, feeling clearer than he had for days. The girl had disturbed him. The girl in the cellar, the girl whose face he had never seen. For two days after that night, all he could think of was somehow finding her. What had happened between them... well, he still didn\u0027t understand that. If she had been a witch, he\u0027d have thought she bewitched him. But she was human. And she\u0027d made him doubt everything he knew about humans. She\u0027d awakened feelings that had been sleeping since Dove died in his arms. But now... now he thought it was just as well he hadn\u0027t been able to find her. Because the cellar girl wasn\u0027t just human, she was a vampire hunter. Like his father. His father, who, wild-eyed and sobbing, had driven the stake through Dove\u0027s heart. As always, Quinn felt himself losing his grip on sanity as he remembered it. What a pity that he\u0027d have to kill the cellar girl the next time he saw her. But there was no help for it. Vampire hunters were worse than the ordinary human vermin, who were just stupid. Vampire hunters were the sin and the evil that had to be cast out. The Night World was the only world. And I haven\u0027t been to the dub in a week, Quinn thought, showing his teeth. He laughed out loud, a strange and brittle sound. Well, I guess I\u0027d better go tonight. It\u0027s all part of the great dance, you see, he thought to the cellar girl, who of course couldn\u0027t hear him. The dance of life and death. The dance that\u0027s going on right this minute all over the world, in African savannas and Arctic snowfields and the bushes in Boston Common. Killing and eating. Hunting and dying. A spider snags a bluebottle fly; a polar bear grabs a seal. A coyote springs on a rabbit. It\u0027s the way the world has always been. Humans were part of it, too, except that they let slaughterhouses do the killing for them and received their prey in the form of McDonald\u0027s hamburgers. There was an order to things. The dance required that someone be the hunter and someone else be the hunted. With all those young girls longing to offer themselves to the darkness, it would be cruel of Quinn not to provide a darkness to oblige them. They were all only playing their parts. Quinn headed for the club, laughing in a way that scared even him. The club was only a few streets away from the warehouse, Rashel noted. Made sense. Everything about this operation had the stamp of efficiency, and she sensed Quinn\u0027s hand in that. I wonder what he\u0027s getting paid to provide the girls for sale? she thought. She\u0027d heard that Quinn liked money. \"Remember, once we get inside, you don\u0027t know me,\" she said to Daphne. \"It\u0027s safer for both of us that way. They might suspect something if they knew that first you escaped and now you\u0027re turning up with a stranger.\" \"Got it.\" Daphne looked excited and a little scared. Under her coat, she was wearing a slinky black top and a brief skirt, and her black-stockinged legs twinkled as she ran toward the club door. Under Rashel\u0027s coat, hidden in the lining, was a knife. Like her sword, it was made of lignum vitae, the hardest wood on earth. The sheath had several interesting secret compartments. It was the knife of a ninja, and Sensei, who had taught Rashel the martial arts, wouldn\u0027t have approved at all. He wouldn\u0027t have approved of Rashel made it in, too, her story must have passed inspection. That was a relief. Inside, the place looked like hell. Not a shambles. It literally looked like Hell. Hades. The Underworld. The lights turned it into a place of infernal fire and twisting purple shadows. The music was weird and dissonant and sounded to Rashel as if it were being played backward. She caught scraps of conversation as she walked across the floor. \"... going out Dumpster diving later...\" \"... no money. So I gotta jack somebody...\" \"... told Mummy I\u0027d be at the key-dub meeting...\" You get a real cross section here, she thought dryly. Everybody had one thing in common, though; they were young. Kids. The oldest looked about eighteen. The youngest-well, there were a few girls Rashel would put at twelve. She had an impulse to go back and insert something wooden into Ivan. A slow fire that had started in her chest when she first heard about the Crypt was burning hotter and hotter with everything she saw here. This entire place is a snare, a gigantic Venus\u0027 flytrap, she thought as she took off her coat and added it to a pile on the floor. But if she wanted to shut it down, she had to stay cool, stick to her plan. Standing by a cast-iron column, she scanned the room for vampires. And there, standing with a little group that in-duded Daphne, was Quinn. It gave Rashel an odd shock to see him, and she wanted to look away. She couldn\u0027t. He was laughing, and somehow that caught hold of her like a fishhook. For a moment the morbid lighting of the room seemed rainbow-colored in the radiance shed by that laughter. Appalled, Rashel realized that her face had flushed and her heart was beating fast. I hate him, she thought, and this was true. She did hate him for what he was doing to her. He made her feel unmoored and adrift. Confused. Helpless. She understood why those girls were clustered around him, longing to fling themselves into his darkness like a bunch of virgin sacrifices jumping into a volcano. I mean, what else do you do with a guy like that? she thought. Kill him. It would be the only solution even if he weren\u0027t a vampire, she decided with sudden insane cheer. Because prolonged contact with that smile was obviously going to annihilate her. Rashel blinked rapidly, getting a grip on herself. All right. Concentrate on that, on the job to be done. She was going to have to kill him, but not now; right now she had to get herself chosen. Walking carefully on her heels, she went over to join Quinn\u0027s group. He didn\u0027t see her at first. He was facing Daphne and a couple of other girls, laughing frequently- too frequently. He looked wild and a little feverish to Rashel. A sort of devilish Mad Hatter at an insane tea party. \"... and I just felt so totally awful that I didn\u0027t get to meet you,\" Daphne was saying, \"and I just wish I knew what happened, because it was just so seriously weird...\" She was telling her story, Rashel realized. At least none of the people listening seemed openly suspicious. \"I haven\u0027t seen you here before,\" came a voice behind her. It belonged to a striking girl with dark hair, very pale skin, and eyes like amber or topaz... or a hawk\u0027s. Rashel froze, every muscle tensing, trying to keep her face expressionless. Another vampire. She was sure of it. The camellia-petal skin, the light in the eyes... this must be the girl vampire who\u0027d brought Daphne food in the warehouse. \"No, this is my first time,\" Rashel said, making her voice light and eager. \"My name\u0027s Shelly.\" It was close enough to her own name that she would turn automatically if anyone said it. \"I\u0027m Lily.\" The girl said it without warmth, and those hawklike eyes continued to bore straight into Rashel\u0027s. Rashel had to struggle to stay on her feet. It\u0027s Lily Redfern, she thought, working desperately to keep an idiot smile plastered on her face. I know it is. How many Lily\u0027s can there be who\u0027d be working with Quinn? I\u0027ve got a Redfern right here in front of me. I\u0027ve got Hunter Redfern\u0027s daughter here. For an instant she was tempted to simply make a dash for her knife. Killing a celebrity like Lily seemed almost worth giving up the enclave. But on the other hand, Hunter Redfern was a moderate sort of vampire, with a lot of influence on the Night World Council. He helped keep other vampires in line. Striking at him through his daughter would just make him mad, and then he might start listening to the Councilors who wanted to slaughter humans in droves. And Rashel would lose any hope of getting at the heart of the slave trade, where the real scum were. I hate politics, Rashel thought. But she was already beaming at Lily, prattling for all she was worth. \"It was my friend Marnie who told me about this place, and I\u0027m really glad I came because it\u0027s even better than I thought, and I\u0027ve got this poem I wrote-\" \"Really. Well, I\u0027m dying not to hear it,\" Lily said. Her hawklike eyes had lost interest. Her face was filled with open contempt-she\u0027d dismissed Rashel as a hopeless fawning idiot. She walked away without glancing back. Two tests passed. One to go. \"That\u0027s what I like about Lily. She\u0027s just so absolutely cold,\" a girl beside Rashel said. She had wavy bronze hair and bee-stung lips. \"Hi, I\u0027m Juanita,\" she added. And she\u0027s serious, Rashel thought as she introduced herself. Quinn\u0027s group had noticed her at last, and they all seemed to agree with Juanita. They were fascinated by Lily\u0027s cold personality, her lack of feeling. They saw it as strength. Yeah, because feeling hurts. Maybe I should worship her, too, Rashel thought. She was finding too many things in common with these girls. \"Lily the ice princess,\" another girl murmured. \"It\u0027s like she\u0027s not even really from earth at all. It\u0027s like she\u0027s from another planet.\" \"Hold that thought,\" a new voice said, a crisp, laughing, slightly insane voice. The effect it had on Rashel was remarkable. It made her back stiffen and sent tingles up her palms. It closed her throat. Okay, test number three, she thought, drawing on every ounce of discipline she\u0027d learned in the martial arts. Don\u0027t lose zanshin. Stay loose, stay frosty, and go with it. You can do this. She turned to meet Quinn\u0027s eyes.","sourceLink":"https://allnovel.net/night-world-the-chosen-night-world-5/page-9.html","bookId":2079,"book":{"id":2079,"title":"Night World : The Chosen (Night World #5)","description":"Storyline: The Chosen (Night World Book 5) Armed with a wooden stake, martial arts, and the will to resist a vampire’s mind control, Rachel struggles to avenge her mother’s death in The Chosen. Then she meets Quinn, her soulmate, who is part of the world she has vowed to destroy.","cover":"https://allnovel.net/images/night-world-the-chosen-night-world-5.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-world-the-chosen-night-world-5.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:30:26 PM"}}
