{"id":109782,"no":18,"title":"Page 18","content":"CHAPTER SEVENTEEN W ithout really being conscious of where she was going, her legs had taken her to a rock-hewn corner of the beach, far away from the hacienda to sit alone under the bright rays of morning sun. Her heart was so heavy that she was sure it had stopped beating. Guilt kept her chest tight, and squeezed the air from her lungs, forcing her to make an effort to inhale. Damali straddled a small puddle of clear water and stared down into it. Seashells glistened in the shallow tide pool. Tiny crabs moved about. Grains of sand floated and resettled as a gentle breeze intermittently wafted over the water. She lowered the troublesome pearl into it and watched it drift to the bottom. It sat there like a nickel-sized pink-white jewel, absorbing the sun rays. Maybe some lucky, poverty-stricken person would find it and be able to hock it. She\u0027d never seen a pearl that large and knew the pinkish color had to come from the she-dragon\u0027s essence added to a natural pearl. As she\u0027d walked with it, the gem had warmed in her hand and then gone cool. She knew in that moment the last flicker of life had been extinguished within the bizarre creature on the other side. But as much as she\u0027d wanted to hold on to rage within her about what had happened with her man, she felt nothing but love from the pearl, and oddly felt sorry for the crazy, mixed-up dragon. There was no anger, no animosity, no negative charge coming from the pearl it had left. All she felt radiating from it was a free spirit, one with no malice of intent. The bite had been pure pleasure. There was no encroachment ever designed into it. Damali picked the pearl back up and placed it in her palm, staring at it with new eyes. \"Who were you?\" she whispered. Her gaze went to the sea. If it had dragon essence on it, no human needed to have it--who knew what it carried? She was about to stand to pitch the pearl to a much larger place that it deserved to get lost in when it began to glow. Damali slowly lowered it back into the water to wash it off, and to make sure that her eyes weren\u0027t just playing tricks on her. The sun was bright, she was weary, and all this madness had undoubtedly messed up her mind. \"A dragon\u0027s gift,\" a light, disembodied female voice whispered on the breeze, yet it was also coming from inside the underwater pearl at the same time. Damali looked around, sensing, and then looked down at the now-white-glowing pearl, and talked directly to it as she kept her palm submerged. \"Why did you give this to me?\" \"Because you needed to know,\" the pearl quietly replied, each word causing a slight strobe beneath the clear water. \"Yeah, well, I know you bit him, but I ain\u0027t mad--\" \"Good. Because I gave him something, too.\" Damali frowned. \"I\u0027ll pitch your little pink ass--\" \"Wait,\" it whispered. \"I gave him insight.\" Damali could feel herself about to get angry again, but something about what this dragon pearl said made her need to hear more. \"I was Cain\u0027s lover for years,\" it murmured. \"The Neteru needed my insight.\" Damali stared at the stone. Oh, shit... Carlos had been right. Information she\u0027d gleaned from her journey to Ethiopia and at the Neteru Council of Queens began to refresh in her mind and then slam it. The inscription at the Isis Temple in Egypt almost made her stand up. An epiphany. The queens had forecasted one was coming. \"Okay,\" Damali whispered more reverently, \"talk to me.\" \"He needed to learn how to heal,\" it whispered quickly, harshly, but with a loving vibration emanating from it. \"How to throw energy. To do all that Cain knows how to do. It is resident within him, takes time to perfect, but he does not have the benefit of time. My bite was a peace offering, actually, to you. I taught him, so you could receive that gift as well.\" Although Damali didn\u0027t like the sound of it, and it had the ring of dragon double-talk, she was more curious than wary. \"All right, then. Say, if I were to go with that theory. I haven\u0027t witnessed--\" \"He is afraid,\" the pearl whispered. \"He is insecure.\" \"Carlos insecure? Puhlease,\" Damali scoffed. \"He musta really blew your mind when--\" \"No,\" the pearl argued, becoming a darker shade of pink as though agitated. \"I felt it running all through him. Cain inspired that. Something else darker did, too.\" \"Deep.\" Damali just peered at the pearl and brought it up out of the water. But then it went still until she submerged it again. \"Thank you. I need the pools of natural waters to work.\" Damali chuckled in awe. \"Wow. So, you\u0027re like a minioracle. A cosmic iPod that just downloaded dragon essence, huh? Too freaky.\" \"All the best oracles use them,\" it murmured. \"I am the newest and last made. I am rare. Do not cast me away. You will need me.\" \"Whoa . . .\" \"Cain is not who you think.\" Damali stopped smiling. \"Who is he?\" \"Dante\u0027s son. He is aware that you have slain his father. He means you no direct harm, in fact, you have helped his cause. He is infatuated with you, truly he is, but will wreak havoc on your world.\" Damali almost stood up again. \"His seduction skills are unsurpassed. He has seduced you. His mother; an able queen. He had seduced Carlos to believe that he cannot match him. He has seduced your family into turmoil, so that you cannot stand united as one. The houses of the Covenant are embroiled in dissension over his reappearance. This is why they cannot come together to aid you this time. His is the ultimate seduction. There is also something he wants from another female I dare not name.\" \"Oh, shit.\" \"You must guard yourself. He can now cross the barrier at will. He will build an empire. You will be essential, as his goal is to sire with your superior Light energy You mesmerize him, your energy is so strong. He demands the best. Your lineage is important. I do not know if he has chosen to rule the Light or dark side, but he is positioning you to be the conduit for his heirs, nonetheless.\" \"How? How can he cross? That can\u0027t happen!\" \"All he needed was one sip from another Neteru, a strong female to balance his dominant male energy. You gave him the protoplasm. I felt it as you ran on the beach. I began sealing my essence into the pearl as I made my choice in a way that he would not immediately perceive. I knew he would leave my gift in your hands to further drive a wedge between you and your mate. He is so wise. It almost worked.\" \"Oh, my God!\" \"Yes. He has sought you since Dante\u0027s throne has been abandoned. He is also a Neteru. He has finally adjusted to your atmosphere. He has absorbed full knowledge of your new world and can raise a nearly unstoppable army. He has disdain for the weakness of humans, he hates that part of himself... he blames that weakness for his once-uncontrolled jealousy, the reason he slew his brother, Abel... he blames it for his incarceration, and desires to eradicate raw emotion devoid of logic. He truly believes that our beings are superior and deserve to rule the realm of sensation--earth.\" \"I\u0027ll butcher him first.\" \"Do not be angry, just well advised.\" \"Now I have to ask if you\u0027re crazy,\" Damali said flatly. The pearl giggled, but the soft voice emanating from it remained serene and unfazed. \"This is coming from a very pure place of conviction within his soul. We have debated this over many wondrous, pleasure-swept nights in his pool. My position has always been that all things of the earth should be free. I am a free spirit, I am a dragon... this is at my core. I am nature energy, wild and uncontained and undisciplined. This is why I could never be his vessel for children; I was not acceptable in his mind. But a very hidden part of him is drawn to that nature of unpredictability. He adores that in you--you are his greatest challenge.\" \"Oh, if he likes \u0027em crazy, I\u0027ll show him craaazy, okay?\" If Damali didn\u0027t have to keep her hand in the water, she would have stood and begun pacing. The pearl laughed low, and deep, and sensually, its melodic voice rising to the surface of the water with tiny bubbles. \"When he could not suppress his urges any longer, he always sought me as his favorite release. You\u0027ve replaced that now, in his mind... you are wild, uncontained, but have a measure of discipline that I did not. He tested that, and your Neteru will and prowess simply slaughtered him. I felt it nearly strangling him as I expired. He is in rapture with you--he gets to have the wildness, but within a disciplined queen that will bear regal heirs. Your lineage and bloodlines suit his fancy. Still, he feels that humans, in general, are undisciplined, are not worthy, are--\" \"What!\" Damali shrieked so upset she could barely keep the pearl beneath the shallow water. \"He\u0027s nuts!\" \"Perhaps. But he has had millennia to perfect battle tactics. He has unsurpassed discipline to be patient to wait for the right move. His mother felt his essential vibrations from your visit, and he was able to enter her heart just from that... you carried him to her, she has no resistance against him... she unearthed the Caduceus for him--which only an etheric Neteru queen can do, which you gave to him to help me out of pure compassion... another seduction. My young queen, he is also drawn to the pure Light in your heart. He feeds off energy, the purer the better. It is his aphrodisiac. He practically levitates when it enters his system. Then, with your silvery blood, he is now... oh, my, at the point of no return. I do not believe I have ever seen him this way.\" Damali felt like she\u0027d been punched in the stomach. \"Pearl. . .\" \"He could not have wrested the Caduceus from you, it had to be willingly given. Just as he could not take your body... but he did not want it with the tainted energy of hurt and spite resonating in it... that would have reduced his vibrations, therefore reduced his pleasure. He knows you are capable of pure, unrefined ecstasy, and that is what he wanted from you. He needed your trinity for a larger plan that he would never divulge to me, but I could feel his mind working the strategy daily.\" Damali groaned and closed her eyes. \"Tell me about the Caduceus.\" She couldn\u0027t even think about how close she\u0027d come to just giving this schizophrenic entity her body. \"Although created by Imhotep, he did so with the healing energies of Mother Nature, thus it contains female power, conferred queen to queen. Cain had to manipulate circumstances so that you would give it with your blessings attached to it, or the rod would go dead. He knew that. I was a pawn, even though we were friends... lovers... he could sense Carlos would panic and act prematurely while in Nod, he knew my weakness for pleasure, and put us in a volatile position. He knew that I had to be seriously injured in order to get you to part with the staff... just as he knew Carlos would be estranged from you for his actions... I love how Cain\u0027s ambitious but twisted mind works. He is brilliant.\" \"But you were his lover--for how long?\" Damali shouted, nearly faint. \"You were his friend, and he let you snap your neck to get the Caduceus? And you\u0027re not mad?\" She was incredulous. \"You\u0027re all right with that?\" \"Those sentimental facts were not as important as his overall goal. Why remain angry? I have enjoyed his pleasure for years. I am free. His actions impact his karma, not mine. So, why harbor resentments that only lower one\u0027s vibration?\" Again, she could only stare at the pearl in her palm. This sister who\u0027d encased the essence of her spirit in it was so cosmically cool and philosophical that it was bugging her out. \"Girl... what is your name?\" \"Zehiradangra,\" the pearl replied happily. \"Oh, Damali... Your heart is so good. I love your energy. Do not let him break it, or your heart. He will use the Caduceus to heal his mortally wounded in battles so they may repeatedly rise when felled. If he has his way, your Neteru Council of Queens will be divided on this issue, Eve and your complicity in this disaster... which will separate you from your power source of Aset, Isis... then he will not be stopped.\" \"He set his own mom up?\" Damali just stared at the pearl, her hand trembling. \"Oh, yeah, this is definitely Dante\u0027s son.\" \"I knew his intent the moment I felt his presence on the beach. That is why I would not go to him. That is why I would not return to the honest one, Carlos, when he called after me. If Cain got me back and trapped me, I would have been remanded to his pool of exquisite sensation again... or maybe banished from it. I do not know. Either way, I could not bear the limitations of the pool after a dip in the ocean. Nor could I fathom being totally denied it. The dilemma seemed hopeless.\" \"You weren\u0027t going to eat the people on the ship?\" Damali whispered, hot tears now wetting her lashes. \"No. I would never do that... I was simply curious. That is in my nature, as a dragon. I have never seen ships such as these. If I died, I wanted to die in the sea.\" \"It was suicide. You popped his energy bands... aw, girl... if you had only told us, you could have hooked up with our team.\" \"I did not pop Cain\u0027s bands. He let them go as I panicked, knowing I would run headlong from him. At that moment, I did not know that you would trust me. But I was sure that the younger Neteru would not be understood, and this would cause you pain. In the chaos, Cain would have had time to siphon the truth of my gift to you from me, and then he would have been angered by my betrayal of his plan. I did not know how far he would go to punish me, if he learned that I would not stand with him. I have seen him in battles. His valiance knows no bounds-- just as his rage knows none. He is the son of Dante, after all, and you do know who sired Dante, of that I\u0027m sure. It is all for the best. I could not risk being captured and forced to go back after I felt the change within Cain. This plane, and a blood feeding, did something to him that I did not like. He frightened me.\" \"Okay,\" Damali said quickly, a new level of panic cresting within her. \"How do I beat this guy? Get him secured on the other side?\" \"You must find a way to seal him in Nod. In ether, he is an honorable king. In the flesh, he is something dark that frightens me. Although I don\u0027t like what his grandfather\u0027s wife did to him on the earth plane, I do love him, but he has a sickness.\" \"Lilith! She--\" \"Oh, please, Damali, do not say her name around me. I am a sensory creature, vibration driven... after what I felt, I could not be with him again. I was moving too swiftly to stop... my neck... I am in a better place now.\" \"But it was suicide. What level of Hell--\" \"No. I willingly gave my life for a family headed by two Neterus. That elevates.\" The dragon giggled, humming. \"One day, there may be a baby?\" \"Oh,\" Damali whispered. \"I received my desire,\" the dragon\u0027s spirit said brightly. \"I\u0027m free! I am in an ocean so vast and so beautiful, you can never conceive it until you come here... which will hopefully not be for a very long time. Live well. Keep me close with the other stones. I will not abandon you. I am the sixth of the seven you will need. Be gentle with Carlos\u0027s heart--do not stay angry with him for also being wild, uncontained, passionate energy. I so enjoyed him. He makes me smile.\" The pearl flickered. \"Be also gentle with Cain, in Nod... he is wonderful.\" \"Don\u0027t go out,\" Damali said, her tone urgent. \"How do I keep him in Nod, or close the rip, or whatever?\" \"You know how. You already have. Deplete his energy. You know this method.\" \"I don\u0027t know anything!\" Damali said, nearly screaming at the pearl. \"I do know that I\u0027ve gotta get to my queens, drop this science on them, gotta protect the family--make sure they\u0027re battle-station ready, gotta make contact with Father Pat to be sure the Covenant knows what we\u0027re up against beyond their theories, gotta talk to Carlos and get his head right.... Girl, come on, I don\u0027t have time for riddles. How do I get Cain to temporarily stay in Nod and not bring an army over the barrier, and get the Caduceus back from him?\" The pearl flickered once more and then went still. \"Thoroughly seduce him.\" The SOS to Queen Aset fired in Damali\u0027s mind so quickly that she didn\u0027t even need the long process of divination, stones, or anything else. She was on her feet, looked out to the ocean, and hollered, \"Queen Aset! Private counsel, stat!\" Instantly the violet pyramid opened before her. She didn\u0027t have to walk into the Light; it practically yanked her through it. When she landed on the other side, she was in the regal queen\u0027s private chambers. Lazy white lions grumbled but didn\u0027t get up as Aset moved toward Damali with panic in her eyes. \"Queen Daughter. The level of distress in your tone... explain.\" Breathless, Damali stood before Aset, opened her palm, and produced the pearl. \"Great Queen Mother, I have news so crazy that I don\u0027t know what to do. An army is about to be raised against humanity! But they aren\u0027t exactly vampires, per se... I don\u0027t know what they are, but they come from Nod. Cain might have even hooked up with Lilith, or something wild like that to take Dante\u0027s throne.\" Aset looked at her with alarm in her eyes, and then down at the pearl. \"You were given a dragon\u0027s pearl as your sixth stone?\" She carefully lifted it from Damali\u0027s hand and studied it for authenticity. Her exotic Kemetian gaze returned to Damali slowly. \"Do you know how rare this oracle tool is?\" Aset gaped and pushed it around in her palm. \"This, with the others, gets set in platinum and silver, my darling. When you receive the seventh stone, the necklace becomes your amulet.\" Had her great queen gone mad? What the hell was jewelry at a time like this? Truthfully, she\u0027d no idea how rare a dragon\u0027s pearl was, nor was she really all that interested in fine gems. The point was the information that it spewed. \"That\u0027s what told me everything, Great Queen,\" Damali said, tempering her tone. Aset nodded arid placed the pearl back into Damali\u0027s fist. \"I am aware of that which you speak. It is a delicate matter, however, one that requires the most skilled levels of detent.\" The queen swept over to a long, alabaster bench and bid Damali to sit down with a slight pat of her hand on the seat beside her. For a moment. Damali didn\u0027t move. The great queen would allow her to sit next to her? On a bench. Like they were girls? Aset smiled warmly, sensing Damali\u0027s awe. Her gorgeous dark eyes held tender excitement as though she were about to burst with pride. Yet, even caught off guard and clearly relaxing in her sanctuary, this royal beauty exuded such dignity that her simple gesture of offering a seat was hard for Damali to fathom. She stood there immobilized, staring at Aset\u0027s flowing, sheer gold gown that practically made her flawless ebony skin shimmer. The entire bedchamber was laden with gold. The huge Egyptian white marble columns terminated in the fine metal. Gold friezes in ancient hieroglyphics littered the walls, a gold vanity, and a luxurious chaise lounge. Damali\u0027s gaze took a quick sweep of Aset\u0027s haven; even the bed was made of the substance, replete with lush silks, glistening sheer drapes, and a profusion of pillows made from fabrics of the same hue. Oddly, for an instant, it reminded her of Cain\u0027s lair... especially the veritable garden of palm plants and the placid, still pool. But this bath had a silver surface, much like that of a looking glass. Damali glimpsed into it as she began walking, cringed and stopped. She was sandy, dirty, had been in battle, had argued, and hadn\u0027t taken a shower since she\u0027d gone to Eve. Her entire white-pants- and-blouse ensemble was ripped, stained, and ragged. How could she even stand in front of Aset, much less sit beside her great queen? \"Daughter, please, dispense with formalities. Come sit and tell me all.\" Damali went to Aset and complied, talking a mile a minute. After a half-hour of breathless monologue told in a series of stop-start non-sequiturs, Damali inhaled and wrapped her arms about herself. \"So, that\u0027s what happened.\" Damali felt like she would jump out of her skin as she waited for the great queen to respond. \"I see,\" Aset said calmly and stood. Damali stared behind her. I see? What did that mean? \"We must call in Nefertiti and Nzinga on this matter,\" Aset replied-answering Damali\u0027s thoughts without even needing to do a mind lock. \"You were right to call me privately, and not the council at large, as my dear sister Queen Eve cannot be impartial on this grave matter.\" Damali audibly released her breath. Total relief almost made her keel over. Aset wasn\u0027t angry, but was going to work on the problem. Thank you, God. The great queen became still and pressed both of her palms together before her heart, elbows bent so that her forearms were perfectly horizontal to her breasts. She murmured something quietly that Damali couldn\u0027t hear, and within moments her palms glowed violet, then Nefertiti calmly strode into the room from the veranda, trailing a long, sheer silver gown. Nzinga followed her wearing a long copper-hued robe. Each queen bowed slightly and then peered at Aset with great concern. \"We have a situation, Queen Sisters,\" Aset replied, and then simply placed one hand on each of their shoulders until their eyes widened. Nefertiti swept away from Aset with her hand pressed against her stomach and looked at Damali. \"Dear, dear daughter, we shall rectify this.\" \"I say make quick work of it,\" Nzinga replied, her gaze filled with blazing fury. She materialized a battleaxe into her hand. \"Go in, grab the Caduceus, and then cut his balls off for even attempting to rob you. Then there\u0027s no issue of his siring anything.\" Damali was on her feet. \"Patience,\" Aset said, shaking her head. \"Nzinga, this must be delicate. We would not want to breed dissention at the Neteru Queens\u0027 Council. I have asked you here to provide battle tactics once Damali leaves Nod, but Nefertiti is here to help her with an entry strategy and diplomatic exit. If we play this right, we can allow Lucifer to stomp Lilith\u0027s worthless carcass into a black puddle without creating a problem for our eldest Neteru council members.\" Nzinga made the battle-ax disappear. \"Although I defer to your rank as our sovereign, let me be clear when I state that I am not concerned about the level of dissention at our table over this particular issue. Eve knows her son is crazy.\" Aset laughed. \"As do we all. However, what the dragon\u0027s pearl suggests is wise.\" Damali watched pure awe spread across Nefertiti\u0027s and Nzinga\u0027s faces. \"She has acquired a dragon\u0027s pearl?\" Nzinga murmured. Then she laughed and shook her head. \"My prot\u0026#65533;g\u0026#65533; has come into her own!\" \"Yes!\" Nefertiti exclaimed, going to Damali and hugging her hard, despite her ragged condition. Nefertiti held her back with tears in her eyes. \"Oh, my, my, my... the lessons I have for you. We must begin, immediately. Clean her up. Get her into the silver pool. Stand back. Nzinga, and watch me work.\" Damali was so stunned that she wasn\u0027t sure what protocols were in force any longer. Nefertiti had stripped her of her ragged clothes and had practically pushed her into Aset\u0027s bath. \"Call Sheba\u0027s handmaidens,\" Nefertiti said excitedly to Nzinga. \"Ask her to bring me the seven swaths--\" \"You are not going there,\" Nzinga said, laughing as Aset sat down heavily on a bench. \"Isn\u0027t that drastic?\" Aset asked, her voice strained. \"Girl, I was married to Akhenaton for years,\" Nefertiti said, unfazed. \"I gave him six daughters,\" she added with a sly wink, \"and he didn\u0027t mind. Not to mention, one of my princesses actually pulled Tut--need I say more?\" She clucked her tongue and returned her attention to Damali. \"Believe me; I know what I\u0027m doing.\" Pure curiosity flowed over Damali as Nefertiti\u0027s hands worked. Her skin felt like it was actually drinking in the silver waters as Nefertiti\u0027s graceful ministrations cleaned the grime off. \"Dear Queen, with all due respect,\" Damali said, embarrassed, her gaze going first to Nefertiti and then the others. \"I should be washing your feet, you shouldn\u0027t be--\" \"Shush,\" Nefertiti murmured. \"I had daughters. They are grown and in spirit now, and this reminds me so much of the old days. Let me tend to you. Yes, we had servants, but the most private time when I needed to truly educate my girls was when we\u0027d have moments like this. Allow me?\" Damali\u0027s heart filled with an emotion she couldn\u0027t describe. The older queens had taken her in. Yes, she\u0027d been a Neteru all her life, but more like an accidental bystander with her nose pressed to the mysterious glass of their leadership. This, however, was admission to the real inner circle, something very different, very special and she recognized the profound gift. Damali nodded. It was an invitation to participate as a full member. \"I am honored to learn from the great Nefertiti, as I am also beyond words and humbled by the knowledge of Nzinga\u0027s battle tactics.\" She looked at each queen with reverence and allowed her gaze to settle on Aset. \"And I am in awe and wonder that I was so graciously accepted into Aset\u0027s private sanctuary. Thank you.\" \"Each of us has a specialty,\" Aset said, seeming quietly pleased. \"Nzinga is renowned for her war strategies, our Amazon sister for her courage, Eve for her skills in detente, I excel in law, our Aztec sister in magic, Joan is bound by unwavering faith and visions, our Asian sister for her medicines.\" She smiled and offered Nefertiti an arched brow with a nod of respect. \"My dear sister queen who attends you... there is no better one on the council to teach you about men. Let her work.\" Damali couldn\u0027t keep the wild-eyed expression from flashing across her face as the older queens burst out laughing. \"Yeah, she does, little sister,\" Nzinga said, plopping down on the bench beside Aset. \"I stand down.\" \"Thank you,\" Nefertiti replied, lifting her chin. She gazed down at Damali. \"Feel your skin.\" Damali allowed her palm to glide over her damp forearm. \"Wow... what did you do?\" she murmured. \"The waters of the Nile infused with essence of Hathor,\" Nefertiti coolly replied. She leaned into Damali, took a deep inhale. \"Oh, yes, he will not be able to resist.\" \"What!\" Damali pulled back, stunned as the queens erupted in laughter again. \"If your goal is to seduce him, then let us do this the old-fashioned way.\" Damali blinked, opened her mouth, but nothing came out for a second. \"I, I, I\u0027m supposed to kill him, right?\" \"Yes,\" Nefertiti murmured, her voice low and sensual. \"Kill. Him.\" \"I don\u0027t understand, then,\" Damali said quickly, almost wanting to bolt from the bath. \"I--\" \"Spell it out,\" Nzinga said with a sly smile. \"Hey, I wouldn\u0027t have picked this up, either. Me, I\u0027m blades and arrows, okaaay? This finer art is way past my specialty.\" Damali bobbed her head and offered Nzinga a glance containing quiet thanks. \"Draw out of the bath, darling,\" Nefertiti said, opening a large Turkish towel for Damali to wrap herself in. \"I want her shaved as clean as a newborn,\" Nefertiti commanded, clapping her hands twice and making two young initiates appear. \"Oh... wait... dear Queen... uh, talk to me, okay?\" Damali tightened the towel around her as two beautiful brown-skinned teenage girls approached wearing big smiles, bright white gowns, and their hair wrapped up in crisp white cotton. She peered at the golden trays they carried bearing exotic, shimmering bottles in every hue. Each crystal vial seemed to contain lotions and potions foreign to Damali, but she immediately recognized a straight-edged razor, then panicked. Nefertiti sighed. \"Don\u0027t they teach you young queens anything today?\" She shook her head with disgust, waved the girls to sit on the floor at Damali\u0027s feet, and made Damali sit on the rim of the tub next to her. \"My goodness!\" \"Dear Queen,\" Damali said, her voice becoming shaky as she saw the resolve in Nefertiti\u0027s eyes. \"I\u0027m supposed to do what, exactly, in this process of killing him?\" A broad smile spread across Nefertiti\u0027s face. \"I want you to go in there,\" she said in a calm, breathy murmur. \"I want you to so distract him and so deplete his energy that he will hand you the Caduceus without bloodshed or struggle... and when he attempts to follow you across the barrier, we can tie him up, siphon the rest of his flesh protoplasm, and send him back. After which, he will not have enough energy all on his own to be able to cross at will.\" Again, words failed Damali as she stared at Nefertiti. \"Meanwhile,\" Aset said coolly, \"I will confer with Ausar about lending us a shield or two.\" She stood and began to pace. \"That will be a delicate conversation. You know how the old kings are... even when our counsel is wise, they must debate it into infinity until they think it was their idea. They always object to us assisting in their affairs, even though they regularly require our wisdom. And, given this issue is about one of their own, a male Neteru, I don\u0027t know.\" Nefertiti smiled. \"Then, take it to the pillow, dear sister.\" Aset smiled a half-smile. \"As I said, my discussion would be a delicate one.\" \"Oh, brother,\" Nzinga sighed. \"You married queens have to go through such loops over the basics that it frays my nerves.\" She stretched out on the bench to watch everything from a distant vantage point. \"Just tell Ausar he\u0027s violated the rule of no two male Neterus being on the planet at the same time, and the one in Nod is empire building.\" \"Empire building isn\u0027t exactly considered an offense from their perspective,\" Nefertiti said, still smiling. \"You know how the kings of old view that. They\u0027ve all done it. War, from their perspective, is often a necessary byproduct of being in the right. They may only slap his wrists until they are clear he is truly offending their codes. Thus, Aset could be in negotiations for months arguing the merits of having the superior Neteru rule humanity... they could vote either way, and avoiding war at all costs is not even in their DNA.\" \"Yes,\" Aset replied, finding the chaise lounge to recline on. \"We have this debate regularly. He feels that sometimes it\u0027s necessary for the right cause, whereas you know our Queens\u0027 Council abhors war as an option. Too many innocent lives... especially women and children get caught in the middle of male-created disputes. Even if Cain is talking about dominating humanity with a super race of hybrid entities, with the shape that humanity is presently in, as long as his forces are not strictly demons and have a soul, my dear husband might think Cain\u0027s plan has a rational basis.\" Aset let out her breath hard in frustration. \"But, by law,\" Nzinga argued, \"Ausar has to give up a shield of Heru so she can place the shield over the breach from the earth plane side to strengthen where the veil is thin. Once placed, we can obscure it to human sight. He already has a young male Neteru in training that, in time, we hope, comes to his right mind. Nevertheless, he cannot allow two brethren Neterus to battle, nor can he allow one to kill the other over a woman. Open and shut case.\" She peered at Aset with a firm gaze. \"So, what\u0027s the problem? Why all the delicate talks? Just tell him what time it is.\" \"She must be delicate, dear Nzinga, because if she goes the legal petition route that could take months before he\u0027d be forced to relent by law. Although you are correct, we don\u0027t have time. My way is more efficient,\" Nefertiti crooned. \"Let Aset take it to the pillow... let her explain that there is word in the valley that Lilith could be behind this--if told in the right tone, no evidence of this potential threat need be debated. Since we only have dragon hearsay about Cain allegedly being positioned to take Dante\u0027s old throne... You know how stubborn they can be, and how easy it is to become embroiled in a test of wills that only devolves into rhetoric.\" \"The indisputable fact is this, Nzinga: We need the Caduceus back under very quiet circumstances. It was taken by guile, thus will be quickly and efficiently returned by the same method. You are well aware if Adam ever found out that Eve assisted in it being delivered to her son, there would be strife on the councils for eons.\" Aset let her breath out hard. \"Therefore, it must be in our possession to not only heal the world in the end of days and to raise felled Guardians in the coming wars, but it is the only tool we may have able to divine which entities that spill over from Nod have gone light or dark. It divines the heart chakras.\" Nzinga let out a grunt. \"All right, Aset. You take it to the mattress, but get the shield.\" Aset nodded with a smile and winked at Nefertiti. Damali\u0027s gaze had been riveted on the short-lived dispute. Damn... if Aset had to negotiate with her man . . : \"We all do, darling,\" Nefertiti cooed. \"That is why, since you clearly have one that you\u0027re not willing to let go of, a bullheaded one, I might add... it is time to teach you some new strategies that will help make your life easier to reign as a true queen. The fewer disputes, the smoother and more quickly your law gets put into effect. Understand, young one? It is about outcome, not methodology. Be liquid fire.\" Damah let out a long whistle, unable to stop herself. The old girls were deep. Had she only known. \"But not to throw a monkey wrench into the operation--because I\u0027m down to stop Cain\u0027s crazy scheme. But, uh, see, this is gonna cause serious problems, now that you mentioned Carlos. I think it\u0027s only right of me to put it all out on the table. If, see, dear Queen, if I uh, actually do Cain, uh, there\u0027s gonna be everlasting repercussions. The bite, alone, created static like you can\u0027t imagine.\" \"First of all,\" Nefertiti murmured with a smile after a weary sigh. \"You never tell them everything, even when provoked.\" She cocked an eyebrow and stared at Damali with big, beautiful eyes. Firelight danced within them as she spoke, her easy, melodic voice pouring over Damali like warm water. \"Second of all, never lie--tactfully evade.\" The older queen stood and began counting off the lessons with her graceful fingers as the two young girls and the other queens sat rapt. \"Third of all, to seduce a man doesn\u0027t require sleeping with him. His most erogenous zone, especially for an arrogant male like Cain appears to be, is his ego. I\u0027m going to show you how to stroke it... suck it, torture it until he\u0027s in tears,\" Nefertiti whispered. \"Caress it. Nip it. Lick it,\" she said, releasing her breath in staccato bursts. \"Fondle it. Tease it until it spills over into your hands. Then, you ask a small favor to be pleased in return. Am I clear? Always allow Yum to ego-orgasm fast . . . and multiple times, at that.\" \"Whew,\" Damali said, raking her freshly shampooed locks. She just shook her head. \"You bad, Queen. If I can pull this off, it\u0027ll go down in the history books, because I\u0027ve never been all that... I mean, seriously.\" \"Yes, you have,\" Nefertiti said, coming to Damali to cup her face. \"You just did it naturally, and weren\u0027t aware of what you were doing. Now we are going to shape all that raw skill into a very deadly weapon.\" Nefertiti glanced at the tub. \"I want her feet done, they should feel like butter. I want her hands done, all body hair, except what\u0027s on her head, removed. Essence of Hathor, from crown to toe.\" The two young girls scrambled to meet Nefertiti\u0027s command, helping Damali to sit at the edge of the large pool so they could work while Nefertiti spoke. \"But, Queen,\" Damali said, not wanting to anger Nefertiti, but still not fully understanding where this invisible seduction line was drawn. Yeah, she\u0027d flirted and whatnot, but this seemed way more involved. \"Okay. I\u0027m going in there all dolled up, and I sit there and tell him all this great stuff he wants to hear. He\u0027s just gonna hand me the Caduceus? I\u0027ve been with him. When this brother pushes up on you, there\u0027s no telling him, \u0027Oh, I changed my mind,\u0027 ya know? How am I gonna get in and out of there without actually doing him, so that I don\u0027t have to lie to Carlos about it? Both of them are energy sensors, they can pick up a lie a mile away.\" Nefertiti smiled, materialized a small throne before the pool, and sat gazing at Damali with a sightline on her sister queens. \"You will cross the barrier with the truth, dear one. You\u0027ll tell him how much you two need to talk, that is true. That you couldn\u0027t wait to see him again, also true. That you know no one like him, also true. He is a king and he has... how do you say, blown your mind--that is not a he. Also tell him that you and Carlos had a huge fight over him, his bite, the dragon and her demise, classic truth--he\u0027ll feel that down to his soul... and say that after you received her pearl and felt the energy from it, you had to finally come to him... you just couldn\u0027t help yourself. Where is the lie?\" \"Dayum . . .\" Damali whispered, unable to censor herself as the raw awe flowed out of her mouth. \"Now,\" Nefertiti said, not the least bit offended by the outburst, will go to him, breathlessly, and tell him that since he left you, your mind cannot rest and that he has something that you want so badly you almost cannot speak. Hesitate, look away, then rake his body and murmur. \u0027Cain... I cannot forget your staff. Since I felt it come alive, I have been . . .\u0027 Then allow your words to deliciously trail off. That is true.\" she continued, when Damali bristled. \"You want the Caduceus, correct?\" Damali burst out laughing with the other queens as the young girls who were working on her feet giggled. \"Ya know what?\" Nzinga said, shaking her head. \"You, my sister, are deadly. I take back all former reservations. She gonna slay him going in there like that.\" \"It\u0027s all tone, inflection, the use of your eyes, and well-timed breaths,\" Nefertiti said proudly. \"It is a dance of emotion. It works like a song. You must begin with purpose, crest, dip, move... flow, each approach adding more urgency, but his ego strokes are the refrain.\" \"Wow,\" Damali said, \"I\u0027m listening, hard. You are definitely awesome.\" Nefertiti dropped her voice to a low, seductive whisper. \"Let him make assumptions by the way you appear at his door. If you go in with a suit of armor, he will expect a battle. If you go in, your hair swept up, adorned in a crown of wrapped gold... your naked, perfumed, satin-smooth body draped with only seven sheer silks of chakra hue... your feet bare, no weapon in your hand--your eyes rimmed in Egyptian kohl as your weapon... your mouth sweetened by mango as a drug... the essence of Hathor trailing like a steel net... and your fluid, graceful movements a sign of surrender, believe me, Damali, he will not be in the mood to fight.\" Aset chuckled and covered her mouth. \"He\u0027ll die of heart failure. Nefertiti, go easy, we aren\u0027t supposed to actually kill him, just contain him.\" \"He will never be able to admit this to Ausar,\" Nefertiti said coolly. \"This level of devastation cannot, by ego, be spoken of between men.\" She arched a perfectly waxed eyebrow and returned her attention to Damali. \"Now. Do not be afraid to go near him. Touch is essential. Your warmth and skin are his handcuffs. He prides himself on his discipline, and his ability to seduce you... that is what makes him vulnerable. Allow him to think that he already has.\" \"Yeah, but,\" Damali said, feeling a little unsure. \"Even as crazy as he is, this brother ain\u0027t no joke in that department.\" \"Good,\" Nefertiti said quickly. \"If he\u0027s adept and handsome, that will make it easier for you, not more difficult, darling. Then your responses won\u0027t be fraudulent, which any seasoned male can detect. Relax, allow him to taste your mouth, caress your skin, and unpin your hair to let his fingers luxuriate in it. Let him see your skin pebble from his attention. Let him know by the way you press against him and breathe out his name that he has aroused you. When we began this lesson, I said not to lie.\" \"Okay, but stop right there. When I get home,\" Damali said, now talking with her hands, \"Carlos--\" \"Only needs to know the truth,\" Nefertiti said, folding her arms with a smile. \"That you had a very treacherous, very delicate negotiation to handle in order to get back the Caduceus.\" Nefertiti unfolded her arms, leaned forward, and closed her eyes, sending her voice into a frenzied panic. \"It was frightening. Your heart was in your mouth the entire time. Sweat broke out on your brow, your hands had white knuckles.\" Nefertiti winked at Damali again as she excitedly mimicked the script Damali was to follow. Nefertiti began waving her arms about. \"With your graceful palm over your heart, you tell him you almost didn\u0027t know what to do. Cain nearly attacked you--you had to think fast on your feet and get out of there before it was too late! Oh! Tears were in your eyes, it was so . . .\" Nefertiti settled back into her throne and allowed her voice to lower to a calm whisper as her hands found the armrests, \"And then let your words trail off.\" Nzinga stood, walked in a circle, and sat back down again. \"She\u0027s the master, Damali. Listen to every word this queen has to say!\" Damali only shook her head as the young girls worked on her feet. \"You never, ever, ever tell your man about some of the feminine wiles required to negotiate a deal,\" Nefertiti said, wagging a finger at Damali. \"His ego remaining intact is paramount to being able to work around him, through him, over him, at will. Ten years from now, the story remains the same, etched into granite. If they ever learn that you pulled this on them, poof, the magic is gone. Even Cain needs to think this was all an accident. You got so thoroughly aroused, lost your head, became conflicted, and had to leave because you were so overwrought. Neva let \u0027em see you work.\" \"Queen . . .\" Damali whispered, \"you are da bomb.\" For a moment the entire chamber went still. There was so much respect for the science Nefertiti was dropping that not even Aset flinched. \"You are going to dance for this man,\" Nefertiti said with quiet authority. She held up her hand when Damali began to protest. \"The seven veils.\" \"Oh, my God... I can\u0027t. Queen--\" \"You can, and you will, because he is from the Old World!\" Nefertiti exclaimed, slapping a flat palm on the throne armrest. \"He is particularly sensitive to music. You will begin swaying as you keep your physical distance from him. You will walk around his sensory pool, your eyelids heavy, your breathing stilted, and then you will look up with an expression that will devastate him, and you will admit that a song, just for him, is torturing your mind. Pick one that you did, indeed, compose for him earlier--that way, the statement is still not a he. Then sing it. right there in his bedchamber for him, undulate to the sound of your voice as it echoes off his marble walls, and shred a veil at each stanza, until he\u0027s vibrating.\" The suggestion was so hot that Damali wiped her brow. \"I want him to feel this from across the room,\" Nefertiti said, raising her voice. \"I want him to crave it!\" \"Okay, okay, okay, I can sing, do a stage performance, I guess. Only thing is, once all the veils are gone . . .\" Nefertiti let her breath out hard in clear exasperation. \"You\u0027ll cut out his heart when he sees the tattoo.\" Damali stood, almost toppling the two girls who were working on her. \"What tattoo?\" Aset\u0027s mouth opened and closed. Nzinga raked her hair and stared at the floor. \"She\u0027s gone over the top,\" Nzinga said, chuckling. \"Queen?\" Damali squeaked. \"It\u0027s only temporary silver, comes off with solvent. Never worry.\" Damali stared at Nefertiti until the older queen smiled and stood. \"You need props for this theatrical event.\" Nefertiti sighed. \"Now I caution you to never do this permanently, even if married... things sometimes don\u0027t work out--and if your king dies, and Heaven forbid you should remarry, well, it could be an unnecessary obstacle... but you will need to wear it for this excursion. The fate of the world and the Caduceus is too valuable to trifle with variables.\" She placed her hands on her hips and stared at Damali hard. \"This, my dear, is the blade. Cut him dead.\" Damali sat down slowly before she fell down. \"In your palms, also anointed with the oil of Hathor, will be his male Neteru tattoo. His is kuntinkantan: four linked circles with a fifth one in the center overlapping all. It means humility is required, and you are sending a quiet message that you are willing to be that for him. Everywhere your palms land will ignite the one on his chest, send pleasure through his meridians, and blow him away.\" Nefertiti stopped pacing and stood behind the throne, leaning on it. \"Oil of Hathor is rare and much more concentrated than the essence you\u0027ve been bathing in. It has the effect on the skin to produce the sensation of... fertile planting. That is what that wondrous goddess rules, yes?\" Nefertiti pushed away from the throne with a mischievous chuckle. \"Use it sparingly. There\u0027s not a male Neteru I know of that can deal with it, except in moderation.\" She clapped her hands. \"Now. Here\u0027s where things become delicate and up to your discretion.\" Damali was almost limp with relief, once she learned the tattoo was only going on her hands. That she could deal with. But when Nefertiti lowered her eyes and chuckled hard, she knew she was in trouble. \"On your cleanly shaven mound, and the insides of your thighs, with a hint of Neteru ripening that we keep bottled for the older kings, since he does have a bit of significant vampire in him . . .\" \"Wait, y\u0027all keep ripening Neteru in vials like Viagra?\" Damali closed her eyes. \"Much better and more natural a substance, and when a few drops are applied to your--\" \"No, no, no, no, no,\" Damali said as the older queens laughed. The young girls at her feet looked away and covered their mouths, too shocked to even giggle. \"Here\u0027s how you play That one,\" Nefertiti said confidently. \"Advanced training, since we have so little time. At some point, this man is going to snatch you into his arms. That\u0027s a given. When he collides with your skin, grab his hair at the nape of his neck and pull hard to expose his throat like you\u0027re about to strike it. His eyes will roll into the back of his skull. The oil of Hathor will dissolve into his skin, as his own tattoo sends him into mild pleasure shock.\" She took off a tiny, golden scarab ring from her pinky and slipped it onto Damali\u0027s. \"Strike him. Bite him as hard as you can. You know where this goes. It\u0027s been soaking in oil of Hathor for weeks.\" Damali stared down at the ring and up at Nefertiti, unable to form words. Nefertiti shrugged and nodded. \"It the only way, darling... if you don\u0027t want him to enter you and need him to ejaculate so hard that he sees stars.\" She glided away and sat down again, leaving stunned expressions to stare after her. \"But don\u0027t let him do that right away. The moment he crests, catch the orb of building energy at the base of his spine in your palm, blow on it, hold it, use your freeze technique to stop it with a cool breath.... I\u0027ll show you the technique once you get dressed. However, just hold him back until he\u0027s stuttering, begging, sobbing, then heat it up and run it up his back. All right, darling? Rim his sphincter until he hollers and then plunge the ring. Simultaneously capture his mind with your silvery Neteru visions and let him momentarily believe he\u0027s inside you. Move with him. Lick his tattoo, since he\u0027s so much taller than you and it\u0027s right over his heart chakra... I may even add in a mystical falcon feather for you to work with.\" Nefertiti placed a finger over her lips as her gaze became distant while she decided. \"Ultimately,\" Nefertiti said with a satisfied sigh, \"I want you to take him to creation point, the opposite direction of vanishing point. Bring him to supernova, cell splitting, galaxy annihilating, light fractals that only reconstruct when and how you say so. When you\u0027re done, I want that man on his hands and knees, too weak to breach the barrier, but willing to crawl over it with his last ounce of energy, like an addict, to get to you. On the other side, you thrust the Caduceus in the ground, supposedly to revive him as he apologizes profusely for his lack of control and you siphon the last of what he\u0027s got from him. Your gentle embrace and tender words telling him that it\u0027s all right are to wrap around him like a silver vine. Bondage. Tie him up. Then jettison him back, for you fear your lover is coming to attack him... of course he would, and you don\u0027t want two Neteru males to kill each other--truth. Cain will surrender without protest to your gentle shove through the rip. because he\u0027ll be in no position to deal with a battle-bulked, irrational male who is beyond outrage.\" The regal queen laughed so hard she covered her mouth for a moment before composing herself again. \"Open the ring, douse the tattoos, and be totally undone when Carlos finds you--which, by that point, I\u0027m sure you adequately will be. Then never, ever, again, bring up Carlos\u0027s transgressions... and allow him to benefit from the batde with Cain. To the victor goes the spoils. Such is the rule of war. All men understand the concept. Harmony will be restored. All dignity preserved. Cain knows how this works, and his ego will allow him to take comfort in the fact that you simply had no other choice or you\u0027d die at Carlos\u0027s hands.\" Nefertiti laughed harder. \"That, too, is probably not a lie.\" Aset stood and paced with Nzinga. \"Nefertiti, remind me to confer with you about oil of Hathor before I go into negotiations with Ausar for his shields.\" Nzinga chuckled. \"Gives a whole new meaning to going to war.\" She patted away the dampness that had risen to her cleavage, picked up a bottle from one of the trays, then simply held it up to the light, shaking her head. \"Prepare her to my specifications,\" Nefertiti commanded the initiates with no nonsense in her tone. \"I just have one question,\" Damali said, not bothering to disguise her hysteria. \"Can you block this from Carlos until the end of time... especially if it goes down badly?\" Nefertiti winked. \"That\u0027s a given.\" He\u0027d looked everywhere for her, but no Damali. Carlos sat down on the beach and simply stared at the water. Based on her state of mind when they\u0027d parted, she could be anywhere. He couldn\u0027t blame her as he kept sensing for her life force. He didn\u0027t perceive she was in danger, but it was clear from her lack of response that she wasn\u0027t ready to be found. Marlene had ripped open his mind, made him see and feel things that he hadn\u0027t fully realized before. Juanita had gone so far into the Darkness and had held so much of it inside her for so long on his behalf that it scared him. Carlos pitched a seashell into the waves. Damali had been right. A good dragon had died unnecessarily. He\u0027d also hurt so many people that several lifetimes couldn\u0027t make it all up. When he went to her this time, he vowed it would be with humility, a listening ear, and patience beyond compare. If she would just hear him out and let him beg her forgiveness... he\u0027d go down on his hands and knees. No matter what she\u0027d done, or where she\u0027d been, he wouldn\u0027t ask. Didn\u0027t have the right to, after all the changes he\u0027d taken her through. Now he knew that, too. Until she came home, he\u0027d guard their almost shattered family. Until she came home, he\u0027d keep a light on in the window at the house. From this point forward, he would treat her like the queen she was... if she would only come home before it got dark, and anything else crazy kicked off. Damali stood before Aset, Nzinga, and Nefertiti awaiting their response. The queens hadn\u0027t allowed her to look in the mirror until Nefertiti gave the nod. The queens smiled. Nefertiti closed her eyes. \"I approve,\" Nefertiti murmured, and then gently turned Damali to look at herself. The transformation was so startling that for several moments Damali could only stare. A pair of dark, sultry, Egyptian eyes stared back at her from the mirror. A fine gold dust made her skin shimmer in the waning sunlight. Oil of Hathor glistened on her lips as though they were wet. Her hair, had been twisted up into a high crown wrapped in silver-and-gold serpent clasps. Her throat was bare and her breasts only covered by a drape of three sheer silken scarves knotted at one shoulder which allowed her nipples to peek through. The loose knot slung low at her hip precariously held four more delicate scarves, and each time she moved they glided over her satin- sheen body to expose her thighs. A hint of the silvery tattoo on her mound was almost invisible beneath the fabric, and the intricate patterns inside her palms glowed. They had affixed long strands of golden Kemetian coins to her ears that gently chimed as she approached the mirror. The large diamond in her navel caught prisms of light and almost stole her breath. \"The diamond is your seventh stone, a conductor of knowledge, of compressed organic matter, stored energy that you can release at will... and a way to directly call to us,\" Aset whispered. \"Diamonds are always a girl\u0027s best friend.\" \"Wow . . .\" Damali murmured. \"I\u0027ve never looked like this, even on stage.\" \"Natural beauty,\" Nefertiti replied with quiet satisfaction and pride. \"Less is more.\" \"You think you can pull it off without incident?\" Nzinga teased, cocking her head to the side. \"Look at her,\" Aset fussed. \"Is this not a queen worthy of pyramid inscription?\" \"The question is,\" Nefertiti murmured, her sultry, burning gaze holding Damali. \"How do you feel?\" Damali continued to stare into the mirror with the queens behind her, pondering the question. \"Nervous,\" she admitted. \"A little scared. A little devious.\" \"Good,\" Nefertiti whispered. \"That will put butterflies in your womb.\" She gently kissed Damali\u0027s cheek. \"What else?\" \"I don\u0027t know,\" Damali said, suddenly feeling too exposed. \"How about sexy?\" Nefertiti crooned, now taking a position fully behind Damali and softly clasping her shoulders. \"How about sensual... unstoppable... powerful... in control?\" Damali looked down, unable to continue to stare in the mirror. \"I\u0027ve only felt like that with one man in my life, because I love him,\" she admitted quietly. \"I don\u0027t want to feel like that with Cain.\" To Damali\u0027s surprise, Nefertiti nodded. She\u0027d expected the older queen to be annoyed that after all her hard work, she was still unsure of the mission. Instead, a tender smile crept over Nefertiti\u0027s beautiful face as tears rose in her eyes. \"Then you are ready,\" Nefertiti said calmly. \"You love him, so you will not sire for another tonight.\" Damali turned and just stared at Nefertiti. Nefertiti nodded. \"It is so easy to be swept away by one\u0027s own powerful magic. Love is a ground wire. Never release that. But do know the effect you have on other men. Now... take a deep breath.\" Damali complied as tears almost spilled over her eyes. \"No, no, no,\" Nefertiti said quickly, blowing the tears from Damali\u0027s eyes to keep them from spilling. \"You will ruin your makeup... but I\u0027ve left some for Cain to believe he put them there.\" Damali chuckled and sniffed. \"You are so bad.\" \"Uhmmm, hmmm,\" Nefertiti crooned. \"I want you to think of it this way. Your man\u0027s dignity has been abused at the hands of another man. His territory encroached, your kingdom nearly destroyed by devious means. What would Carlos do under those circumstances? Would he not cross the border to rectify the offense?\u0027 Nefertiti said, answering her own question. \"Definitely,\" Damali said, standing taller. \"Would he not use every weapon in his arsenal, including ruse, to best his opponent?\" Damali smiled. \"Every time.\" Nefertiti nodded. \"For this mission, what I have given you is the preferred weapon of choice. Now,\" she said on a deep inhale, \"do you feel powerful, sexy, unstoppable, in control, and righteously justified in slaughtering your opponent?\" Damali chuckle a little harder. \"Queen, you have a serious way of flipping the script.\" \"But you did not answer my question.\" Nefertiti waited. \"It is imperative that your mind is focused, you have no trepidation, other than the quiet nervous tension that all warriors feel when a significant negotiation is pending. Do not carry guilt over that barrier, or any insecurity.\" \"All right,\" Damali said, holding her shoulders back. \"I feel sexy, unbeatable, in control, and I\u0027m ready.\" Nefertiti arched an eyebrow and placed a long slender finger over her hps for a second. \"There\u0027s something else you need to be feeling to make this authentic.\" She motioned for the tray of potions, as Damali and the other queens looked on confused. \"I\u0027m going to place a drop of something sweet on your tongue, darling, to relax you. It is not fitting to go in there with your fists balled up at your sides the way they are now, your shoulders set to take a blow, and ready to reach for your Isis.\" Nefertiti shook her head with a smile as she removed the stopper from a small, ruby-crusted vial. Damali opened her mouth and allowed the warm droplet to hit her tongue without questioning the elder queen. As her eyes slid shut and reopened half-mast, Nefertiti sighed. \"Now, darling, how do you feel?\" Damali\u0027s fists unclenched slowly, her shoulders relaxed, her spine became fluid, and every pulse point lit. Her breaths were so shallow she was becoming dizzy. \"What\u0027s in that stuff?\" \"How do you feel?\" Curious gazes passed between the other queens. Damali looked at Nefertiti. \"Horny.\"","sourceLink":"https://allnovel.net/the-forsaken-vampire-huntress-legend-7/page-18.html","bookId":2531,"book":{"id":2531,"title":"The Forsaken (Vampire Huntress Legend #7)","description":"Storyline: The Forsaken (Vampire Huntress Legend #7) The Chairman of the Vampire Council is dead, and Lilith, the consort of the Unnamed One, and the Unnamed One himself are out for revenge against Damali Richards, the Vampire Huntress, and her lover, Carlos Rivera. A ruthless and carefully planned strategy---one that not even Damali will anticipate---has been developed. There is only one entity who can best Damali, send Carlos packing, and put the Guardian team at mortal risk. This powerful being was once banished into a forsaken land and possesses everything that would bring a Neteru to his or her knees. This time the fight is not so clear-cut, and it is not only Damali\u0027s soul in the balance but her body and heart as well.","cover":"https://allnovel.net/images/the-forsaken-vampire-huntress-legend-7.jpg","author":"L.A. Banks","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-forsaken-vampire-huntress-legend-7.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:42:14 PM"}}
