{"id":109773,"no":9,"title":"Page 9","content":"CHAPTER EIGHT C\u0027mon, Damali. Call me. Stop playing. The refrain strummed through Car-los\u0027s brain like an incessant chant as he followed Cain, watching the thick muscles knead in the huge entity\u0027s shoulders as he walked ahead of him. Even though he was now fairly certain that his woman hadn\u0027t totally lost her mind and slept with him, the fact that she got up out of bed and called this bastard kept Carlos\u0027s eyes glowing silver. After they\u0027d made love? Carlos wanted to spit, but wouldn\u0027t give Cain the satisfaction of seeing just how much the whole thing was jacking with his mind. After they\u0027d made love? The torturous awareness began to replace his chant for her to call him. Damn... and he\u0027d thought he\u0027d put his thing down hard. Shit. Damali had called for something stronger than that? He knew this day would come, but had hoped it would be when he was an old man. But what did she want from him? Blood? Fine. It was like that. Okay. So she wanted a street sample to see what else was out there on the block. All right. Just because of that thing with \u0027Nita--but he\u0027d had a reason; he\u0027d been possessed. He thought she\u0027d finally let it go, smoke or no smoke, but it was obvious she hadn\u0027t. Cool. Baby, call me. Aw\u0027ight. She didn\u0027t have to go there to make her point. Carlos rolled the tensior out of his shoulders and paused. His collarbone had been broken, had snapped clean when he\u0027d hit the barrier. But it had somehow mended on its own just like the old days, but without a feed. What was up with that? He glanced up at the sun again, just to be sure he wasn\u0027t really in Hell. Two strange discs illuminated the sky. One that seemed to generate solar heat, and another that was a swirling opalescent fusion of oranges and yellows and pinks. Very strange. Everything around him had a slightly iridescent quality that made it look surreal. Then, suddenly, it dawned on him, with all this natural splendor surrounding them, he had seen or heard nary a creature. No birds, not even a bug. He inhaled deeply. With all the grass and flowers, no scent? Carlos stared at Cain\u0027s rigid posture and almost snarled as they came to the edge of a cliff. The bastard had the arrogant stride of a king, head held all high and whatnot. \"I still maintain a lair at the realm\u0027s edge. You may lodge there, if you choose,\" Cain said with disinterest. \"Or if you prefer to go into the valley and reside at my summer palace for the duration, it is your choice.\" Carlos just looked at him. \"Do I seem crazy to you--like I\u0027d let you set me up in a lair up in the fucking mountains alone? You might not be able to smoke me, but one of your boys could, and my blood wouldn\u0027t be on your hands; I ain\u0027t stupid.\" The reference to a lair disturbed him. One near the border, one so very close to his boo... a place where if she tripped through the rip could be where... Carlos lifted his chin a little higher, fighting the curiosity of what Cain\u0027s spot looked like. \"I stay with you.\" \"As you wish.\" Cain sighed and shook his head. A sly smile tugged at his mouth. \"However, it is a long way down the mountainside, baby brother. If you get tired, I can always throw you over my shoulder and carry you the balance of the way. Just let me know.\" Carlos\u0027s eyes narrowed. \"You\u0027ll kill yourself going down,\" Cain said, badly concealing a chuckle. \"Look over the edge.\" Carlos brushed past Cain but gave him wide berth as he passed. Just the slight bump against Cain\u0027s rock-solid frame told him the entity was getting stronger, if that was possible. He peered down the steep incline and saw clouds, then small dots of buildings and movement. Whateva. He had vamp in him and could get down unassisted. Cain shook his head. \"You have not acclimated to our vibration. Your body is still too dense. Perhaps we should wait a few hours before you enter my kingdom.\" Again Carlos stared at him, gaining critical information from the brief statement. If the entity was losing density but gaining strength on this side of the rip, then that also meant that when on the other side of it, his side, he would possibly lose some power in the density transition. All right. He could work with that. \"Oh, please, you\u0027re a king, da man? Gimme a break.\" \"Yes,\" was all Cain said, and he walked toward a steep crag. Maybe it was the flat nonplussed tone that Cain had used to answer him, but it messed with Carlos no end. He was a king? Damali had gone too far! But he was forced to watch in awe as Cain slid his sword out of the heavy leather harness down his back, touched it to the rock wall, and made the illusion of natural landscape dissipate. Huge black onyx sphinxes guarded the entrance to what appeared to be a heavily columned temple. When they purred a welcome, Carlos jumped back. Cain chuckled and began walking forward. His footsteps left jeweled green energy in their wake that spread out on the carpet of what had seemed like grass to overtake it. Carlos\u0027s attention was torn between the grass and the color waves overriding it, and the things guarding the entrance to Cain\u0027s spot. Everything here was freakin\u0027 energy? How did they eat? What did they eat? His focus split again as Cain stopped before the entrance, stroked a fawning Hons back, and it nuzzled his shoulder as the other one stood and roared a complaint to get similar attention. \"Shush,\" Cain said in a low, calm voice, sheathing his blade. \"It is all right.\" The sphinxes glowered at Carlos, nuzzled their master again, and sat back down on their pedestals with eyes forward. Cain motioned with his head for Carlos to follow him inside. But how did Cain kept those suckers fed and chilled out? If he hadn\u0027t been a competitor, Carlos might have openly admitted that what Cain had just shown him was some smooth shit. However, any appreciation for what this brother could do would remain a very quiet secret within his weary soul. Carlos edged by the lions and kept his gaze sweeping as they entered a long, open corridor. A gleaming, oblong, crystal-blue pool of water stretched before him in Olympic proportions, almost seeming like glass. Carlos studied it hard, and for the first time really witnessing the delicate, congruent bands of hue that made up the shimmering surface. Water wasn\u0027t water? Oh, shit, he was screwed. Energy-generated lotus blossoms floated on the still surface, and white marble was everywhere. Carlos had to fight with himself not to reach out and touch it so that he could inspect the phenomena in detail. From where he stood, it seemed as though pure gold was the mortar between the marble tiles. Freaking hieroglyphics with inlaid silver? And everything around him had an energy pulse. Almost gave off a tone from the slightly moving hues. The brother could hold illusion energy like that, put tone and color all in it to this degree? Dayum. Oh, hell no, his woman couldn\u0027t ever come over here and see this shit. If this was just a cliff-side lair, not even the main palace, then . . . \"You need some clothes,\" Cain said, unfastening his blade harness and casually dropping it on a white marble bench by the pool. For the first time since they\u0027d clashed, Carlos studied the weapon with full appreciation. That was real. It was held in a black, hand-tooled sheath with intricate designs of gold and silver studs that had been forced into the leather. The ornate platinum handle was crusted with diamonds, and the four blades that became one were highly polished steel, but in the center blood gutters were gold alloy with silver Neteru sym-bology worked along them. And the Neteru King\u0027s Council had just given him a pocketknife? No respect. He refused to go deeper into Cain\u0027s lair as he watched him walk up a flight of twelve alabaster steps, his feet making the pale pastel colors in the masonry swirl beneath each footfall. Carlos ran his hand over the nape of his neck to keep from battle bulking again as Cain strode with unflinching authority past a massive, solid gold, twenty-four-karat four-poster bed, each post crested by a pyramid-shaped, clear quartz crystal as big as his fist. Vivid hibiscus in vibrant color splashes, ferns and elephant grass and huge leafy jewel-green plants of energy looked like they simply grew up from the marble floor and surrounded the bed. Energy-trembling white silk linens, white-on-white satin embroidered pillows, and sheer Egyptian drapes that resonated with low, sensual harmonic tones sprawled lazily across the monument of pure decadence. Aw, man... tones from the colors... white had every rainbow color resident within it, therefore every note. Instant insecurity rooted Carlos to the floor. Cain could probably fire up the bed like Rider could fire up his ax, pull a blossom off a nearby plant and hand it to Damali all romantic-like while composing on the fly, and make everything around them and under them do multipart harmony. This was the brother\u0027s studio, for real. This was where he probably listened to Damali\u0027s work. This put a vanishing-point move to shame--- or... shit, what if he could do that too, with the music vibe to go with it? Have her atomically deconstruct, tap a white-light color fusion, feel all the music, every tone to the max, and then bring her back breathless while wurkin\u0027. The brother was built, even he had to admit. Plus this motherfucker could sing? Carlos briefly closed his eyes and walked in a tight circle, and then abruptly stopped himself so he wouldn\u0027t give Cain any more satisfaction than he probably already had. No woman had ever put him in a position like this--ever. If his own imagination didn\u0027t kick his ass first, something told him there was a possibility that the SOB coolly getting undressed and dropping heavy armor might. Okay, he had to keep his head tight as a matter of pride. So the man could handle his business--but he\u0027d have to kill his ass for sure, if he ever dragged D over this threshold. Period. He was so upset that he couldn\u0027t ignore Cain. The being turned around and casually loped toward a huge marble built-in armoire that held an ornate twelve-foot silver-edged mirror. Carlos\u0027s heart was beating harder than it needed to. If his woman ever fell by this joint. . . Just man-up and suck it up, Carlos told himself. He wasn\u0027t no punk. Fuck it. Carlos\u0027s gaze shot around the expanse. Tall, eight-foot Egyptian pots seemed to guard each of the twelve columns that stood beside the small energy lake fronting as a pool in this brother\u0027s bedroom. Carlos swept them mentally--this was as good a place as any for a black adder to slither out. But Cain seemed so relaxed and casual it was setting Carlos\u0027s teeth on edge. He watched Cain serve him his back, remove his body armor, and drop it to the floor like a man who\u0027d come home from a tough day at the office. No stress, no worries, just glad to be home, and tolerating the noise his children were making. That had to be the only reason Cain was physically changing and not just willing it so--he was obviously tired. The battle on the other side of the rip had worn him out a little; Carlos clung to that, glad that something gave him the advantage. But he wasn\u0027t sure what pissed him off more, the fact that this guy clearly wasn\u0027t worried about him--so much so that he\u0027d left a weapon within his reach, turned his back on him, and was trying to figure out what to change into, like he wasn\u0027t even there--or the fact that he\u0027d have to do about a thousand more push-ups a day and bench press three-fifty at the gym to ever be cut like that. Carlos rubbed his hands down his face. Damali was so wrong, the girl couldn\u0027t ever get right. Cain tossed a pair of sandals in Carlos\u0027s direction, making them whir toward him like Frisbees. Carlos caught one in each hand, and then flung them down hard. He wasn\u0027t wearing this SOB\u0027s clothes. And he definitely wasn\u0027t stepping into shoes in front of Cain that would be way too big. Truth be told, he really didn\u0027t wanna know how much bigger Cain\u0027s feet were than his at the moment, and he definitely wasn\u0027t putting on a robe that would swallow him whole--clean or not. Doing the fang comparison had been humbling enough. The man had him by two inches, which was never gonna sit well with him as long as he was alive. \"You cannot walk around without shoes,\" Cain said, giving him a quizzical look. \"It is not done in the royal families.\" He pulled a long, elegant, gold-toned robe over his head, and began fastening the elaborate embroidered clasps with silver lion\u0027s-teeth hooks. Of all days for him to go looking for Damali... no shoes on, no drawers, just a pair of pants, no shirt. Wait until he got home! Carlos stared at the shoes on the floor, willing them to be the right size. If he could just get a good vamp whirl going, he\u0027d serve the cocky bastard across the room black Armani, a pair of leather slip-ons, and show him how it was done back in the \u0027hood. Matter of fact, he didn\u0027t do Old World nothing, not robes and dreadlocks, nor Egyptian braids, none of that--he did clean-shaven, precision-cut. Fuck Cain! And, yeah, he cussed--so? If Damali wanted some romance-language shit, some corny guy carrying a blade instead of a nine, who would croon to her in what sounded like Shakespeare\u0027s era, she could have all that. It wasn\u0027t him by a long shot. And so what if he didn\u0027t sing, he\u0027d like to see Cain\u0027s ass at a modern-day bargaining table, throwing down serious deal-making, strategy, handling business like it needed to be handled--he had a skill, now, she\u0027d better act like she knows. Not to mention-- \"Why are you working yourself up like this over a pair of shoes?\" Cain said, seeming genuinely perplexed. \"Conserve your energy.\" Carlos could practically feel steam coming out of his ears. He was so angry that his throat was cracked and dry. His blood pressure was spiking so hard it felt like his pulse was pushing his eyeballs out of their sockets. He made fists with his hands. \"I want my shoes, my shit, and I don\u0027t want anything from you,\" he shouted. Cain smiled, shook his head, and went back to his closet. \"Now you really do sound like a child.\" \"Are you sure?\" Marlene asked, glancing around the compound\u0027s altar room. Damali\u0027s gaze took in each of the ancestral artifacts and mementos from many lands that rested peacefully within the solemn, wood- framed room. Bright sunlight poured into it to splash the ivory walls. She took a deep breath. \"Yeah. I need to talk to Queen Eve.\" \"Remember, Damali, that\u0027s still his mother--Neteru or not.\" \"I know,\" Damali assured her as she stepped forward, preparing to kneel. Marlene caught her arm. \"No. You don\u0027t know. The mother-son bond is stronger than anything you could imagine. I know Eve won\u0027t take this to the male Neteru Roundtable for a divination on her own. Not when it comes to Cain. She and Adam have been at odds for years over her son, his stepson, okay? I\u0027d feel better if you went to a more neutral queen from that era, like Nefertiti. Even though her husband, Akhenaton, got elevated posthumously he holds serious advisor weight at the table--since he reintroduced monotheism into law after periods of human uncertainty on the many gods issue.\" \"It\u0027ll be fine, Mar,\" Damali said with a calm smile. Marlene let Damali\u0027s arm go, becoming exasperated with worry as Damali knelt. Nervous and wound up like a top, Marlene paced back and forth in front of the altar, keeping her voice low and reverent. \"Besides, Akhenaton had six daughters, and was always seen with his queen at his side--seven women, Damali. You know he\u0027s seen it all---all of them fine, his wife a star. Nefertiti\u0027s girls had to be the bomb and had to have everything under the sun and moon at his door coming at \u0027em. Why not take it there for unfiltered advice and leave Eve be, because she\u0027s conflicted. She has to be; she\u0027s his mother,\" Marlene whispered though her teeth. \"Her advice might be... oh, chile. I ain\u0027t speaking ill of one of our queens, but, remember, now, Akhenaton was the first of the monarchs to emphasize his role as a father, and with Tutankhamen as his son-in-law, you know--\" \"Help me call the violet pyramid, Mar,\" Damali said with her eyes closed. \"All right, all right, all right,\" Marlene said, her tone testy as she knelt. \"In and out. Keep the questions simple and--\" \"Open the pyramid with me, Mar,\" Damali said, breathing slowly and deeply. \"I know not to step on any toes. Trust me. I owe Eve, don\u0027t forget... she put her body on the line to direct us to the Chairman\u0027s lair. That had to be a difficult meeting. I\u0027m sure, if Adam found out, he didn\u0027t take it well.\" Marlene let her breath out hard and focused with Damali. With their eyes closed, both women turned toward each other once their palms began to tingle, creating a peaked V with their right hands, fingertips barely touching, as their left palms slowly rotated faceup to form the base of the energy structure. Slowly but surely a violet light filled the space between their hands as their focused energy intensified. They spread their hands apart until the light radiated and remained before them on its own with them kneeling before it palms up. \"I call great Queen Eve, alone, for private counsel,\" Damali whispered. The light throbbed. \"Enter, my child, at my permission. It is Eve.\" Marlene stood and backed away with a sigh. Damali stood and walked forward into the violet light. Marlene wrapped her arms around herself. \"Tell her I said hi.\" Lemurs and colorful birds made the heavy cover of trees seem restless. Damali slowly walked through the humid, heavily green- swathed terrain, her gaze sweeping as she searched for Eve. She stopped at the edge of a large pool and glanced up at the thundering falls. When the great queen surfaced from the beneath the clear water, Damali stepped back and noticed the white sheath that was warming on a rock. Eve dropped her head back, smiled at the sun, wiped the water from her face, and began to wring out her braids. \"Oh, Queen Daughter, I so love Madagascar. It reminds me of home.\" Eve sighed and walked to the rock, naked and unashamed--pure, natural sensuality oozing from her as Damali handed her the soft linen fabric. She pulled it over her head, shaking lose her long hair, her face radiant with natural beauty as she patted a spot beside her for Damali to sit. As Damali tried to decide how to begin the difficult conversation, she was so glad that her mother-seer had insisted she shower, rinse her hair with clean rosemary and sage water, and anoint herself with myrrh before coming here. Just sitting near such majestic beauty made her feel so very uninitiated to true elegance, even while wearing the light, white gauze blouse with flowing sleeves, billowing pants, and plain, flat gold sandals. She toyed with her silver ankh earring to divert nervous energy. Eve could make a plain sheath look like a million bucks. \"I am honored, daughter, that you have sought my private counsel and not Nzinga\u0027s. But why?\" \"I am honored that you would have me visit you alone,\" Damali said, bowing her head and keeping total humility in her tone. \"I mean no disrespect to Nzinga, she is warrior of warriors, huntress of huntresses, but this is a delicate matter that requires detente.\" Eve chuckled. \"Ah... and if it is about a male, why not consult Ne-fertiti? She is renowned for her most effective diplomacy with the other half. She bore six daughters in an attempt to offer her king a son, and did not--yet he loved her so that he remained faithful and did not seek to sire a male heir through taking other wives. She is your better counsel on that topic.\" \"No,\" Damali said, meeting Eve\u0027s merry eyes. \"You were first, will always be first, and are the wisest on the council. I owe you deeply; just as the world owes you deeply for all that you put on the line for us. Thank you for that. I also thank you for guiding us to the Himalayas to find... a lair, before.\" Damali\u0027s eyes slid from Eve\u0027s with reverence, not ever wanting to mention the Chairman or hurt the elder queen with a reference to her old lover. \"Therefore, I have come to you.\" Eve clasped Damali\u0027s hand and swept it to her mouth to place a kiss of adoration on the back of it, accepting the compassion and respect Damali\u0027s tone held. \"Tell me, child. What weighs your heart?\" \"I said a prayer,\" Damali replied in a rush, her eyes seeking Eve\u0027s so furtively that all the merriment left Eve\u0027s eyes. The older queen squeezed Damali\u0027s hand tighter, which made Damali\u0027s grasp follow suit. \"I was angry at my soul mate. He\u0027d hurt me, had done abominable things... so I wanted a change, I thought. Wanted to teach him a lesson. The prayer was darkened by anger, and . . .\" Eve\u0027s eyes became wide as her free hand covered her heart. \"You didn\u0027t slay him, did you?\" \"No, no,\" Damali said quickly. \"But I may have injured his spirit.\" Damali looked away. \"In fact I\u0027m sure of that, and I know forgiveness is a part of any relationship, but while under the influence, he took one of my Guardian sisters, and--\" Eve snatched her hand away. \"He did what?\" Damali stared at Eve as she stood, placed her hands on her hips, and tilted her regal head to the side. \"And you didn\u0027t plant your Isis in his chest?\" She made a hard tsking sound with her tongue and stormed back and forth for a moment before she finally sat near Damali again. \"All right. My apologies. I have just never been so galled... If he was under the influence, he should have never put himself in such a position to even . . .\" Eve closed her eyes. \"I am the last one who should cast aspersion,\" she said, opening her gorgeous brown eyes and taking in a deep breath through her nose. \"This type of dissention within your home troubles me, daughter. It strikes a nerve. I detest seeing one of our queens experience such disrespect.\" \"Oh, thank you, Eve,\" Damali said on a hard exhale. \"I thought it was me. That I was losing my mind for being so furious. I couldn\u0027t pull it together, and I lobbed a serious prayer.\" \"Oh, child, what did you ask the Most High for?\" Eve closed her eyes again and kept her hand over her heart. \"I wasn\u0027t playing games of spite, I really wanted someone who would love me with his whole heart, who would be honorable, do the right thing, be strong, disciplined, courageous, and good.\" Damali let her voice trail off as she looked at the water. \"I really meant no harm, I was hoping that it might even be a new and improved Carlos, actually, but then he manifested. Somebody else.\" Eve\u0027s palm cradled her face. \"Then why so blue, my child? Enjoy the gift from above.\" Damali\u0027s hand covered Eve\u0027s. \"I don\u0027t know that I should or if I can.\" Both women\u0027s eyes met. \"If you called him from a pure place in your heart, after having it so abused, why? If he manifested as all those wonderful things, and you were never married to Carlos in the Light... well. . .\" \"He\u0027s Cain,\" Damali said quietly. \"That\u0027s who came through.\" Eve just looked at her f\u003c?r a moment, too stunned to even remove her hand from Damali\u0027s cheek. \"My son? My Cain? That\u0027s who came to you?\" Damali nodded and stood as Eve\u0027s hand fell away from her face. \"Oh, Eve, listen, I\u0027m so sorry... I wasn\u0027t trying to stir up any old hurts, or rub salt--\" \"Oh, my God,\" Eve said, standing quickly. Tears were in her eyes as she walked in a crazed circle around Damali, half-laughing and half-crying, her hand intermittently covering her mouth. \"You called for an honorable male Neteru, and the Most High sent you my boy? My baby? Oh . . .\" Eve drew in a shaky breath. \"They\u0027ve released him? My child is coming home from Nod?\" Before Damali could respond, Eve had grabbed both of Damali\u0027s hands and pressed them to her bosom then to her lips as tears rolled down her face. \"Eons. I knew he had it in him to change. I never lost hope, even while I bitterly wept the loss of his younger brother. I had lost two sons, not just the one, and my heart was shattered.\" She hugged Damali so tightly that Damali could barely breathe. \"You have answered my prayers. Oh, Damali, love and light. Whatever I can do for you as your mother-in-law, just name it.\" She kissed Damali\u0027s cheek hard and then held her away. \"Tell me, what does he look like now? Is he still tall and handsome? He is such a good man, now--I must believe that.\" In that moment, Damali knew Marlene had been right. Eve was way past conflict, she had no objectivity whatsoever. So Damali dug down into her core and gave her queen a small sliver of hope, feeling that was the least she could do. \"He\u0027s tall and handsome and seems very honorable,\" Damali said quietly, watching silver tears now stream down Eve\u0027s beautiful cheeks. \"He said, \u0027God bless my mother, she has endured much.\u0027\" Damali stopped speaking when Eve covered her mouth with both hands to hold back a sob. \"He still bears the sword of Ausar. They didn\u0027t give it to Carlos when he was elevated to the position . . \"Did he come to you in pilgrimage robes or armor?\" Eve asked in a quiet, strained whisper, her third eye glowing violet as she tried to see her son through Damali\u0027s eyes. \"Both,\" Damali said, omitting the circumstances. \"First with humility, then--\" \"In full battle armor tp protect your honor.\" Eve nodded and paced away to lean on the huge, flat rock where they\u0027d been seated. She seemed to be nearly faint with pride, holding herself up by a very slight margin. \"But, Eve,\" Damali hedged, not wanting to hurt her queen. \"I\u0027m not sure who sent him.\" Eve snapped her head up and looked at Damali with a question and pain in her eyes. \"Damali, the man has served his sentence. I know who his father was, and what terrible thing he did--the whole world knows that. It was my mistake, not my son\u0027s, so do not blame him for my error. But you yourself have forgiven a drug dealer, a man who drew his own brother into a dark life, a life that consumed them both, made them both vampires... Alejandro was slain by Carlos\u0027s own hand, too, but you were able to forgive that and love him just the same. Carlos already had a chance to be by your side, but by your own admission, he desecrated your love with your own Guardian sister! Foolish. Leave him, and move on with the more honorable man. The decision is simple.\" When Damali didn\u0027t immediately answer, Eve clasped both hands together and brought them to her chest. \"Please, for me, offer my boy a chance at redemption and happiness.\" She looked up to the sky. \"The prophecy states that you and a male Neteru are to be one, united, and sire together the greatest Neteru ever made.\" Her line of vision went back to Damali\u0027s and held it. \"You and my son... my Lord. A combination that even I dared not dream.\" Nervous sweat filled Damali\u0027s palms. She\u0027d bow at Marlene\u0027s feet, when she got home, and would go prostrate on the floor in front of her mother-seer for calling this one. \"Queen Eve,\" Damali said slowly. \"It\u0027s not that cut-and-dried. The terrible tsunami ripped open a hole in the fabric of the universe. I don\u0027t know if Heaven sent your son, or if my call, as a Neteru, simply allowed him to be able to bypass the energy barriers to it. He seems like a wonderful guy, don\u0027t get me wrong, but you and I both know what the situation is over in Nod. If I mess up, and have accidentally called him out, and if he isn\u0027t clear about which side--\" \"He is clear!\" Eve shouted. \"The Light wouldn\u0027t have allowed the rip or him to hone his vibrations to your voice if he were not ready!\" Eve walked a hot path back and forth before the flat rock. \"Do not toy with his emotions, Damali. He has been through a lot, and any indecision on your part could be the thing to send him over the edge and back to his old ways!\" \"I understand, my queen,\" Damali said calmly, fighting the impulse to just up and run back through the violet light. \"This is why we must all be sure.\" She kept her tone humble, her eyes on Eve, her demeanor calm but firm. \"My fervent hope is that you are correct. But now that Carlos is trapped over in Nod with him--\" \"Carlos went through the rip? How?\" Eve stopped pacing, her eyes holding an expression like she\u0027d been struck. \"He has to leave my son alone and go back to his side! There can be no altercation while Cain is on parole.\" \"They already got into a fight; that\u0027s how it happened. When they collided and took a tumble, and--\" Eve leveled a finger at Damali, pointing at her so intensely that blue-violet light flickered at the tip of the digit. \"My son,\" Eve said in a low, lethal tone, \"has been incarcerated in a realm that is devoid of sensual stimulation for years. He lived a full life on the planet as a man, sired children, had many wives. Then, he died. But reincarnated in Nod with full recall of all of those earthly sensations so that he would learn self-discipline, honor, selfless sacrifice, and you would bait him into a fight with a half-vampire, half-human male Neteru while he\u0027s apexing!\" Violet flames covered Damali\u0027s chest and fanned out to paralyze her before she could turn and run. \"I didn\u0027t bait him, Eve, I swear. What had happened was--\" \"You called my boy to you through song--my poor male child--who has a weakness for music, like his father, into your company, my passionate son, my virile son, the one who takes after Dante\u0027s propensity for sensual excess... you call him sweetly like a lover over the barrier of Nod, but not sure if you would yield to him... after millennia of not being with a woman in the flesh and allow another Neteru challenger to--\" \"Eve, I swear to you . . .\" Damali\u0027s voice trailed off as the elder queen materialized an Isis blade in her hand and leveled it at her heart. \"My son,\" Eve said, walking closer to Damali, shaking her head with tears of rage in her eyes, \"who has pure royal vampire strain all through him--you would allow another male with Council-level vampire lineage to make my boy produce fangs!\" Damali shut her eyes tightly as the hot edge of the Isis pressed against her windpipe. She could instantly taste the electric discharge coming off of it on the back of her tongue. \"Why do they always blame the woman?\" It was the only truth she could quickly tell Eve to keep Eve from cutting her throat. Damali panted as the steel edge of the blade suddenly yanked away from her skin. Eve lifted her chin and swept away to stand by the water, her back to Damali but her blade readied. The energy field around Damali vanished, and she dropped forward on her hands and knees, coughing, and speaking to Eve in a gravelly voice. \"Queen Mother, please hear me,\" Damali said, standing slowly as Eve\u0027s tight grip on the extended Isis made it vibrate in her hand. Eve glanced over her shoulder at Damali and then turned away from her as she drove the blade into the sandy shore. She continued to give Damali her back as she stared out at the water. \"Speak.\" \"I did not call him by name,\" Damali said plainly, rubbing her throat. \"I called for the positive attributes I described to you. That\u0027s possibly a good sign, since that\u0027s what manifested him.\" Eve nodded and wrapped her arms around herself, but didn\u0027t speak or turn to look at Damali. \"I was angry, as I told you,\" Damali said, hoping to at least get Eve to see her point of view, even if the woman didn\u0027t agree with her decision--whatever that might finally be. \"I had been traumatized by what I saw with Carlos. Even Carlos said there was some type of black smoke--\" \"Lilith,\" Eve whispered through her teeth. \"Before the end of days, I will slay that bitch for this.\" Gaining confidence, Damali pressed on. \"It could be that Cain was released by the Hand of God or it could have been a Level- Seven diversion, if they intercepted my argument. I don\u0027t know. That\u0027s the problem. I was angry at Carlos when I lobbed the prayer... more like a complaint, as the case maybe. But I wasn\u0027t all the way ready to throw in the towel on our relationship. I. Am. Human,\" Damali said with emphasis. \"Eve, please hear me. I\u0027m human. Prone to error, prone to all sorts of things, huge mistakes being one of them. But, Eve, you know me. I also have a heart, and wouldn\u0027t just jack with a brother in jail or play with his mind.\" Damali walked back to the rock to lean on it and stare at Eve\u0027s spine, putting a little distance between herself and the clearly devastated Neteru queen. \"I\u0027m many things, but not cruel.\" Eve nodded and her breathing shuddered as though a sob so deep and profound was battling to come out. Damali almost cried for her. \"I knew it was too good\" to be true,\" Eve said quietly and swallowed hard. \"But a mother can always cling to hope. I also have love for my son... and faith. A mother always carries this divine trinity for her child.\" Damali watched Eve wipe her face with her back still turned to her and put the straightness in her spine as a queen\u0027s carriage dictated. \"You are right. I cannot blame the woman without thorough inquiry ever.\" Eve took in a deep breath and let it out slowly. \"I have experienced that.\" \"I know. That\u0027s why I brought this to you in trust, and out of respect,\" Damali said. \"As a matter of honor, I did not go to Nefertiti, or the others, as I felt you had the right to know above all others, first.\" Eve nodded, but still didn\u0027t turn. \"I deeply appreciate that,\" she said in a quiet tone. \"Your honor and discretion will never be forgotten. Forgive me for almost beheading you, but we were talking about my son.\" Damali rubbed her throat again, truly aware of just how close she had come to biting the dust. Whew... no wonder Mar was having a cow. \"Here\u0027s the thing,\" Damali finally said, pushing away from the rock. She needed motion to calm her nerves. \"Before I can just go off with Cain, I have to legitimately resolve this thing with me and Carlos, one way or another. Then, however it goes, whomever I decide to hook up with has to also pass the Light test, because Eve, I can\u0027t even think about siring--\" \"That you do not have to explain,\" Eve said calmly, raising one hand to stop Damali\u0027s words. For a moment, both women fell silent. \"Eve, I didn\u0027t sleep with him, because I wasn\u0027t sure... and at the same time, I wasn\u0027t trying to play with him. Does that make sense? I mean, how would that be... I\u0027m mad at Carlos for something foul he did, and in a fit of fury after an argument, I go hook up with some brother who ain\u0027t got nothing to do with the drama, then after me and Carlos come to terms, I dump him and go back home--or, worse, have both of \u0027em out in the street battling until one or both of them dies. Where\u0027s the maturity and honor in that? They deserve better; I deserve better. No Neteru or female with dignity needs to go there. Plus, it\u0027s not about all that--it\u0027s about the rip and making sure nothing untoward comes across that line. You know that. As this era\u0027s Neteru, all personal crises aside, I cannot let anything half-demon slip out of Nod to join with the currently weakened forces of Hell to strengthen them.\" Conviction entered Damali\u0027s tone as she spoke to Eve\u0027s back and her voice trembled with emotion. \"Your son is awesome, Eve. Almost made me forget any honorable intent or mission. But he also seemed like a nice guy, someone who deserved respect, someone who could be permanent, if that\u0027s where it was headed. So, I wasn\u0027t about to put him in a position like that. And, for all of Carlos\u0027s mess, he\u0027s still a good man, too, and a Neteru, so I was trying to sort it all out when they rolled up on each other. That\u0027s what happened, for real.\" Damali was breathing hard as Eve turned slowly to face her. The elder queen nodded sadly and forced a serene smile. \"You did the right thing, daughter... he\u0027s just my firstborn boy.\" Eve sighed and folded her arms over her chest and shook her head. \"But that you\u0027ve thought all this out so clearly, I wish I had your wisdom at your age... and even in this disaster, that you have spoken so highly of him makes me proud. I hope he\u0027s made the right decision. Time will tell. Yet I cannot vouch for him. He\u0027s all grown up,\" she added, her voice so melancholy that the birds went still. \"He\u0027s a man, and has been away from me so long I confess that I don\u0027t really know him anymore.\" Eve paced away from the water\u0027s edge and leaned against the rock with her eyes closed, seeming lost, if not drowning, in very old thoughts. \"His father never saw him after the banishment... that is why light perpetual shines in Nod. He could never glean information about that place, how it worked, what entities were there, or attach any relevant knowledge of it to his throne--the light blinded him, as they knew, inherently, that he would go after his son to save him from a sensory-less fate. It practically drove Dante mad to think of Cain there, but try as he might, he couldn\u0027t get to him, so he could never tell me how he was... and after Eden, I dared not transgress again to peek into that world.\" She chuckled sadly when Damali\u0027s eyes widened with shock. \"Dante never got to see our boy really grow up. I wonder if he would have admired him, and been proud, even if he went to my side?\" Eve\u0027s gaze captured Damali. \"When you have children of your own, you will understand. It sounds mad, but that\u0027s the thing... even a father who disagrees with his son\u0027s profession still holds some measure of pride if that son is the very best at what he sets out to accomplish. Tragic, all of it, the whole of it cannot be sorted out or easily explained in one sitting.\" \"I hope he\u0027s one of the good ones, for you, dear Queen,\" Damali murmured. \"I\u0027d hate to have to be the one to take your lover and your son\u0027s head... but if he goes dark on my watch, that\u0027s my job. I\u0027d do him no less than I\u0027d do Carlos, if either one of them take after Dante full-blown. You must understand that before I leave this glen, Eve. I need to get into Nod and I need your help. You were there when that realm was created.\" Crystal-blue tears filled Eve\u0027s brown eyes and fell without shame. \"You see, all I remember is that head of tight curls and ringlets against my breasts. That child who stayed awake all night with a bright, inquisitive smile, and who would occasionally nick me with a hint of fang when he suckled or laughed hard. Those warm, brown, hungry, intelligent eyes that absorbed every shred of knowledge ever put before him, those same eyes that painfully looked to me to solve the problems of the newborn world... and that wonderful, angelic voice that would join me in a lullaby when I sang him to sleep every dawn.\" Eve drew in a shaky breath and closed her eyes. \"That is what a mother sees. Not the monster. Not the seductive lover. Not the man who has grievously erred and must be punished, or possibly beheaded.\" \"I know, Eve,\" Damali said, removing the formality of title between them as she walked to her queen and gave her a much-needed hug. \"But you are also fair and wise and just... and I came to you because of all those things.\" Eve hugged Damali tightly as she stroked her hair. \"What I ask of you isn\u0027t fair. It is pure emotion.\" \"I can\u0027t commit.\" \"I know,\" Eve whispered. \"Just be gentle with my boy, whatever you decide. Tell him, if you see him again, that his mother loves him, no matter what, and always will. Tell him that, even if you must behead him.\" Damali swallowed hard and nodded. \"That I can do.\" \"Freeze!\" Multiple gun hammers clicked back. Semiautomatics leveled. Men in black S.WA.T. gear had come through the door in a Bradley, and swarmed out of it before any Guardian could take cover. Windows smashed in. A black-hawk chopper was landing on the roof, then footfalls pummeled the upper floors and stairs. The Guardian team stood very, very still, not even glancing at each other as they kept their hands on their heads. They kept their mouths shut as nervous palms patted them down, spun their bodies around, and affixed nylon ties to their wrists. \"Problem, officer?\" Rider finally said, as he was forced to kneel. \"Where\u0027s the one you call the Neteru in this cult?\" a burly figure shouted, his eyes darting around the team and then toward his men. \"Be careful, gentlemen. She\u0027s packing a long blade, samurai shit, and knows how to use it.\" \"I\u0027m a cop,\" Berkfield said. \"You need to start reading Miranda and explain--\" A gun butt to the side of his head stopped his words. \"This ain\u0027t local, it\u0027s federal,\" the lead searcher said through his black ski mask. \"Homeland Security--after the Patriot Act, we don\u0027t have to tell you shit. Anybody else got any stupid questions?\" Guardians watched a team of twenty masked men peel off from the group in search of Damali, and cringed when they heard the weapons room door get kicked open. \"You see this arsenal in here!\" a voice down the hallway shouted. \"Fucking Pentagon Web site up on monitors!\" another shouted. \"Bingo!\" \"Bring it all as evidence,\" the leader said, motioning with his chin to dispatch more men. \"Where\u0027s this Neteru chick, huh?\" He leaned in toward Bobby and Dan, and yanked Dan\u0027s hair back. \"She\u0027s not here,\" Dan said, grimacing from the pain. \"She left to go talk to somebody, okay? Now get off me!\" A gloved hand jerked Dan\u0027s hair again to make him fall. Bobby was drawing sudden breaths of rage, but knelt, unable to assist his friend. \"But we didn\u0027t do anything wrong!\" Krissy shouted, trying to lift her head off the rug as she was shoved down hard and fell. \"Hey!\" Berkfield shouted. \"That\u0027s my daughter!\" \"Don\u0027t put your hands on her!\" J.L. said between his teeth while a gun barrel dug into his cheek, forcing his head to the floor. \"The kid just wants to know what charges we\u0027re up on,\" Shabazz said, receiving a gun butt to his stomach for the question. When he dropped, Big Mike almost stood, but a Glock nine to the temple made him slowly go back down on his knees. \"Easy, big fella. Don\u0027t be crazy,\" one of the restrainers said. Inez tried to edge toward him on her knees, her eyes sending silent daggers to the gunman who\u0027d put a nine to Mike\u0027s temple. \"She left,\" Juanita shouted. \"She went to go see her man\u0027s mother!\" When a gunman nodded and yanked Juanita\u0027s ponytail back, two men shoved Jose to the floor. \"Hurt her again, and it\u0027s on!\" Jose shouted. \"You believe this little tamale?\" one guy said, forcing Juanita\u0027s head back so far she almost fell. Multiple two-way radios sputtered with static. \"All clear! She\u0027s not in the house.\" \"We just want to know what you want,\" Marjorie shrieked. \"Some people wanna have a talk with you about these experiments you\u0027re about to conduct.\" The lead invader laughed hard in a mocking tone. \"Your asses are screwed. We picked up everything off satellite intercepts of your coded message conference call with a buncha rogue clerics--religious fanatics. So let\u0027s go see some people who are very curious about your interest in Cairo setting something off and breaking into places with a link from here... just some folks who wanna know about all this Egyptian theory shit you\u0027re kicking around. All right?\"","sourceLink":"https://allnovel.net/the-forsaken-vampire-huntress-legend-7/page-9.html","bookId":2531,"book":{"id":2531,"title":"The Forsaken (Vampire Huntress Legend #7)","description":"Storyline: The Forsaken (Vampire Huntress Legend #7) The Chairman of the Vampire Council is dead, and Lilith, the consort of the Unnamed One, and the Unnamed One himself are out for revenge against Damali Richards, the Vampire Huntress, and her lover, Carlos Rivera. A ruthless and carefully planned strategy---one that not even Damali will anticipate---has been developed. There is only one entity who can best Damali, send Carlos packing, and put the Guardian team at mortal risk. This powerful being was once banished into a forsaken land and possesses everything that would bring a Neteru to his or her knees. This time the fight is not so clear-cut, and it is not only Damali\u0027s soul in the balance but her body and heart as well.","cover":"https://allnovel.net/images/the-forsaken-vampire-huntress-legend-7.jpg","author":"L.A. Banks","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-forsaken-vampire-huntress-legend-7.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:42:14 PM"}}
