{"id":82935,"no":11,"title":"Page 11","content":"\"She\u0027s gorgeous, Terri,\" Lisa gushed and Theresa smiled tiredly, nodding her appreciation of the comment. Lisa seemed not to notice her lack of enthusiasm, or if she did, probably dismissed it as exhaustion. Rick had been in earlier but was at work at the moment. Sandro, was leaning against a wall, arms crossed over his broad chest and legs crossed at the ankles. He said nothing but Theresa was aware of him watching her every move with brooding intensity. It was just over a day since the baby had been born and Sandro had gone home only to shower and change and to bring her a change of clothes too. He\u0027d also packed a bag for the baby, filling it with the tiny little pink and white things he\u0027d bought months ago while Theresa had been industriously buying toys and clothes for a baby boy. \"Have you thought of names yet?\" Lisa was asking and Theresa winced slightly at the memory of a conversation she\u0027d once had with Sandro. He must\u0027ve have remembered too because he made a caustic sound. \"Last time we talked about it,\" he spoke for the first time since Lisa had arrived ten minutes before. \"She had her heart set on Kieran, Liam, Ethan or Alexander.\" Lisa frowned at that. \"Only boys\u0027 names?\" She asked in confusion. \"You forget, your cousin was obsessed with having a son,\" he taunted. \"What a pity for her that she failed so dismally at achieving her goal.\" Theresa\u0027s soft mouth quivered at the slight and his eyes darkened at the sight but he kept pressing. \"She\u0027s so torn up by this inability of hers to do anything right, that she hasn\u0027t even bothered to look at our daughter. Or hold her. Or even attempt to feed her. Why hassle with a mere girl child when it won\u0027t get her out of her miserable marriage with me? When it won\u0027t win her the affection of her thrice-damned father?\" \"Theresa?\" Lisa prompted gently, watching as tears spilled onto Theresa\u0027s pale cheeks. Sandro cursed rawly, before levering himself from the wall and sitting down on the bed to wrap her in his strong arms. \"Don\u0027t cry,\" he whispered. \"I\u0027m a bastard. Just don\u0027t cry.\" \"You\u0027re not a bastard,\" she sobbed. \"You\u0027re right. I can\u0027t look at her. I can\u0027t hold her. I hate myself for being this way but she\u0027s not what I was expecting. I wanted to make this all right. I wanted to have that son and release you from your obligation to me. I wanted to finally do something right in my father\u0027s eyes... everything would have been perfect.\" \"Do you hate our baby?\" He asked painfully, keeping his face buried in her hair. \"Of course not... I love her so much it hurts. But I feel like such a failure...\" \"Oh God, sweetheart, just let all it go,\" he groaned. \"Let yourself love her. Allow yourself to be happy.\" \"But what about you? I promised you...\" \"For God\u0027s sake just stop it,\" he shook her slightly. \"I told you before, I don\u0027t want out of this marriage. And if you give me nothing but daughters for the next twenty years, I would consider myself blessed.\" She made a muffled sound as she buried her face in his neck and wept. She so desperately wanted to believe him. He rocked her soothingly and after a long while, he released her and gently lowered her until her head rested on the pillow. \"Why don\u0027t you rest, cara and when you wake up, I think it\u0027s time you met your daughter and gave her a proper welcome into this world.\" Theresa stared up into his dark, handsome face, barely noticing when her cousin got up and left, squeezing Sandro\u0027s taut shoulder on her way out. Her vision started to blur after a while and she fell asleep still trustingly clutching one of her husband\u0027s large, capable hands in both of hers. She awoke to the sound of angry, hushed voices and blinked groggily as she tried to get her bearings. \"I don\u0027t want you anywhere near her,\" she heard Sandro hiss furiously and tried to concentrate on the drama unfolding in her doorway where she could see two large men silhouetted. One was unmistakably Sandro and the other; she narrowed her eyes slightly, trying to focus a bit better. It looked like her father. \"She\u0027s my daughter and I\u0027ll damned well see her when I want to,\" the other man blustered, confirming that he was, indeed, Jackson Noble III. \"So that you can damage her more than you already have?\" Sandro asked, almost shaking with rage. \"I won\u0027t let you get close enough to hurt her like that again. And you can forget about getting that grandson you want anytime soon. I refuse to give you the pleasure.\" \"Well then stay married to her until you do, or give up the vineyard,\" her father sneered. \"The vineyard never meant as much to me as it did my father. You can have the damned place back. I want your grasping paws out of my business and the taint of your presence away from my marriage. You won\u0027t be getting your hooks into Theresa again and you most certainly will not be any kind of presence in our children\u0027s lives.\" \"Sandro...\" Theresa sat up slightly. \"It\u0027s okay. I want to speak with him.\" \"Theresa...\" his voice shook with anger as he stepped into her slightly darkened room. \"No.\" \"It\u0027s okay,\" she smiled, her lips trembling. \"He doesn\u0027t have the power to hurt me anymore. I want to see him.\" \"Theresa...\" \"Sandro.\" Her voice was firm and brooked no argument and he sighed, before stepping aside to let her father in. \"Father,\" she nodded warily as she watched the large, handsome man whose affection and approval she had craved her entire life enter the room. \"Theresa, you look none the worse for wear,\" he observed in the cold, distant voice he always used on her and she immediately went back to that insecure little girl who had never understood why her daddy didn\u0027t hug her and didn\u0027t want to spend time with her. \"Have you seen my daughter yet?\" She asked, her voice strong and sure. Not betraying the little girl who still lurked somewhere inside. \"Not yet, no...\" he seemed uncertain. Seeing the new strength in her and not sure what to make of it. \"It\u0027s funny...\" she suddenly observed. \"What having a baby does to you, you would go out of your way to protect that new life from anybody who would threaten its happiness. I won\u0027t allow you to hurt my baby the way you hurt me. I don\u0027t want you in her life... not unless you\u0027re prepared to love her in the way you were unable to love me: wholeheartedly and unconditionally.\" As if on cue a nurse brought a fretting, pink-wrapped bundle into the room. She paused for a moment, sensing the tension in the room... before pasting a bright smile onto her lips and bringing the baby over to Theresa. \"I think that it\u0027s past time this little one meets her mother properly,\" Theresa\u0027s entire face lit up and her heart filled with overwhelming love as the nurse placed the beautiful infant into her arms. She finally took inventory... counting fingers and toes, stroking downy black hair, and velvety skin. She even enjoyed it when the little one opened her rosebud of a mouth and started to wail angrily. \"Hello there sweetheart,\" she whispered. \"You are the most beautiful thing I\u0027ve ever seen in my life.\" The nurse brusquely proceeded to give her a crash course in breast-feeding, ignoring the way Theresa\u0027s face flamed when the older woman started talking about breast pumps and let-down reflexes. Her father shifted uncomfortably while Sandro sat down at her bedside, a mixture of smug amusement, overwhelming pride and bewildered love on his face. She had never seen him look more vulnerable, or more protective... he sent a glare of warning her father\u0027s way, before his unsettling gaze shifted back to her. Theresa, in the meantime, was struggling to conceal her milk-swollen breast from them after the nurse unceremoniously yanked the bodice of her nightgown down. The woman obviously thought that Theresa had nothing to be embarrassed about in front of husband and father. She fumbled with a towel but it was Sandro who reached across and draped it over her shoulder to cover her breast and the baby\u0027s head. The baby finally found her nipple and latched on with enough force to make her wince. He concealed her from her father but kept the towel up on his side so that he could watch, ignoring her flustered glare. \"She\u0027s got a pretty healthy appetite, doesn\u0027t she?\" He muttered in fascination, his voice alive with adoration. \"Does that hurt?\" Theresa shook her head slightly in response and snuck a glance up at her father who was unused to being so completely ignored and clearly did not it. \"Jackson, we\u0027ll discuss the details of the broken contract at a later date. You can have back the vineyard and you\u0027re more than welcome to keep the damned money but your daughter\u0027s mine, as is the beautiful baby she\u0027s given me. Sue me for breach of contract if you must.\" \"I don\u0027t want that useless piece of land back, we could renegotiate the terms...\" her father sounded almost desperate and Theresa suddenly lost patience with both men. \"Stop talking about me like I\u0027m an expensive piece of meat,\" she seethed. \"Take your sordid business elsewhere. I want it nowhere near my baby. Father, I\u0027ve given you my conditions.\" \"You\u0027re so brave now, aren\u0027t you?\" Her father sneered. \"But if push came to shove, I wonder how strong you\u0027d be?\" \"I\u0027m stronger than you\u0027ll ever know, father,\" she smiled serenely. \"Years of constant rejection from the people you love can leave you with pretty tough skin. You can\u0027t hurt me anymore. I don\u0027t want nor need your version love. I find that I no longer want nor need you in my life...\" \"Yes, so brave now that you have your loving husband\u0027s support,\" The man\u0027s words were laced with bitterness. \"But while he may love your baby, Theresa, he\u0027ll never love you. He has Francesca Delvecchio and, yes, he\u0027s Italian enough to want that baby of yours so it\u0027s just a matter of time before he finds a way to get her away from you...\" Theresa blinked, her sudden fear showing, as her father presented a scenario she had never once considered. She couldn\u0027t prevent herself from glancing over at Sandro, whose face was dark with fury and his entire body coiled with tension, he looked like he was about to tear her father\u0027s throat out. \"I think it\u0027s time you left, father,\" she whispered painfully and her father sneered one last time before he pivoted on his heel and strode from the room. \"Don\u0027t you dare believe what he just said, Theresa,\" Sandro whispered rawly, focusing his glare on her. \"Don\u0027t you bloody dare!\" \"I know you love her, Sandro...\" she whispered. Not sure if she meant the baby or Francesca and she could tell by the look of uncertainty on his face that he wasn\u0027t sure who she meant either and so was at a loss as to how to respond. \"Would you try to take her from me?\" \"No!\" He practically shouted and the baby started. Theresa soothed her with slight rocking motions until she started suckling again. He reined in his temper and gentled his voice with visible effort. \"I wouldn\u0027t do that to you. I\u0027d never hurt you like that.\" \"But you want her...\" again the ambiguity and his frown deepened. \"If you mean the baby, then yes of course I want her. But it\u0027s a package deal for me, I want both of you. You\u0027re my family. I don\u0027t want a life separate from yours. I want our life. The one we\u0027ve been building together these last few months.\" \"What do you mean? All we ever talked about was divorcing...\" she asked in confusion. \"I\u0027m referring to all those nights together... the movies, the games, the conversations... what the hell was that if not relationship-building? We know we\u0027re great in bed together. But we\u0027d never really tried all the other stuff that couples do. The last few of months, we did do those things. We may have done things a little backward, cara but that doesn\u0027t mean that we can\u0027t have a solid marriage like Rick and Lisa\u0027s. The only one of us who\u0027d ever mentioned divorce was you. I don\u0027t bloody want a divorce. I want us. Together.\" \"I think...\"she whispered so softly he could barely hear her and had to lean in closer to make out her words. \"I think that you\u0027re a wonderful man, Sandro. A decent man and because of that... I know that you\u0027d do anything to make things right. You\u0027d make any sacrifice to give Lily and me a normal life. But I can\u0027t let you do that. I can\u0027t let you keep forfeiting the things you want just because you think it\u0027s the right thing to do.\" \"This again,\" he muttered impatiently. \"I went from demon to saint in pretty short order, didn\u0027t I? I want you to listen to me very, very carefully Theresa because I won\u0027t be saying this again. I\u0027m not a saint. I\u0027m being very selfish when I say that I want you and our baby with me and when I say that I want us to be a family. I have duties back in Italy, people I love and need to take care of but right now I don\u0027t give a damn about any of that right now because I want to spend my every waking moment with you and this baby. This life I\u0027ve built with you, it\u0027s the only one that matters to me anymore. So please stop telling me what I really want and try listening to me for a change.\" Theresa stared up at him uncertainly. Dare she believe that he meant this? That it wasn\u0027t just a really good act? She cleared her throat, trying to formulate a response but he leaned over and kissed her gently, stilling the words. \"Don\u0027t say anything, cara. Just give me a chance...\" He looked like a man perched on a ledge with her as his last chance of redemption. How did she resist that? How could she? \"I know I\u0027m asking you to make yourself vulnerable again and I\u0027m so sorry for that. But I want you to trust me. Just one more time... allow yourself to trust me.\" She bit her lip, before taking a deep breath and stepping out onto that ledge with him. \"We need to name this little one before we take her home,\" she said lightly, ignoring the way he released the breath that he\u0027d been holding for countless moments. She felt the tension drain out of him and his relief was so overwhelming it was an almost tangible thing. \"Any ideas?\" He asked huskily, reaching over to stroke the top of the baby\u0027s soft head with his thumb, somehow managing to brush the sensitive skin of her breast too and she shivered at the contact. \"Well, since she has all this fuzzy black hair, we should probably stick with Lily,\" his face lit up with pleasure and he dropped a quick kiss on her smiling mouth. \"I only hope she has the temperament of a Lily and not that of a Sofia.\" \"If she takes after you, we\u0027re in for a bumpy ride,\" he joked and she rolled her eyes. \"Please, you\u0027re no angel yourself,\" she retorted without any heat. \"Let\u0027s just name her Lily and hope for the best.\" \"Hmm, if she does have your stubbornness and fiery temper, I\u0027ll adore her even more,\" he admitted. \"It\u0027ll certainly make life interesting.\" \"Why did you keep buying girl\u0027s toys and clothes, Sandro?\" She asked after a short silence and his thumb paused its stroking for an infinitesimal second, before continuing on. \"I mean, I\u0027m grateful for them now, of course. But why?\" \"Why?\" he shook his head and hesitated again before raising his eyes to meet hers. \"I was just... hoping for a girl,\" Her jaw dropped as she simply gaped at him for a few moments. That thought had never once crossed her mind. \"You were hoping for a girl?\" \"Yes. Very much,\" he staggered her by confirming, his eyes remaining steady so she was in no doubt as to his sincerity. \"I don\u0027t understand...\" she shook her head slightly. \"Why?\" He didn\u0027t respond, dropping his eyes to the suckling infant at her breast. \"Sandro?\" She prompted and he raised his eyes to hers once more. He smiled cryptically before shrugging. \"This is neither the time nor place to be having that particular conversation, Theresa,\" he frustrated her by saying. \"But...\" \"We\u0027ll discuss it soon but right now I think Lily is ready to be burped,\" he pointed to the infant whose tiny mouth had slackened. She awkwardly dragged her bodice back up and then clumsily repositioned Lily until the baby was draped over her shoulder. \"Could you get the nurse?\" She asked Sandro, putting his previous comment from her mind for now. \"I\u0027m not sure how to do this.\" \"Rub your hand on her back in a circular motion,\" he noted the surprise in her eyes before shrugging. \"The nurse showed me how to do it last night after I\u0027d bottle-fed her while you were asleep.\" Theresa complied with his instruction and was soon rewarded with a tiny burp. The sound was adorable in a way that only a new parent could appreciate and they grinned at each other when they heard it. In that one glorious moment of solidarity, Theresa started to believe in the possibility of a happily every after again... and it frightened her to death. The thin sound of a distressed infant\u0027s wail jerked Theresa from a restless sleep. She sat up and fought her way out of bed before groggily trudging to the nursery. When she got there she blinked up at the already-present Sandro who was cradling his crying daughter tenderly in his strong arms. He was wearing only a pair of boxers and held the tiny baby up against his strong, naked chest. He was crooning gently to her and Theresa was transfixed by the sweet picture they presented. He looked up suddenly and saw her standing in the doorway. His hair was messy and standing up in spikes. \"Hey,\" he smiled over at her. \"I was hoping you\u0027d sleep through this. You looked exhausted earlier. I don\u0027t think she\u0027s hungry. Just cranky, I think her wet nappy woke her up. I changed her and she\u0027s all dry and comfy now but she hasn\u0027t worked the bad mood out of her system yet,\" Theresa walked over to them and peered over one bulging bicep into Lily\u0027s scrunched up little face and smiled in amusement. \"Very cranky,\" she leaned over to drop a kiss on the baby\u0027s damp forehead and felt Sandro tense when her cheek brushed against his chest in the process. They both paused awkwardly before Theresa cleared her throat and stepped back. She dropped into the padded rocking chair and tucked her feet up beneath her and watched as Sandro continued to pace and gently talking to the crying baby. He eventually sank down into the second rocking chair beside Theresa\u0027s, while continuing to soothe the baby. Lily\u0027s wailing eventually decreased down to a few sad sniffles before she dropped back to sleep. Theresa looked over and smiled when she realised that Sandro had fallen asleep too. Lily was firmly anchored to his chest and held in place with a broad hand on her tiny back. She looked from the man to the infant and smiled at the similarities between them. Lily had his mouth and something about the set of her brow was one hundred per cent Sandro. Theresa got up quietly and went over to pick the baby up. Sandro\u0027s brow furrowed when she tried to move his hand and instead tightened his grip slightly. \"Sandro,\" she whispered. \"Let me put her to bed.\" His eyes fluttered open and he smiled when he saw her leaning over him. \"Theresa,\" he murmured and in that unguarded moment, Theresa saw a depth of emotion in his liquid brown eyes that she couldn\u0027t quite fathom. She blinked and in that split second he came fully awake and his eyes shifted back to neutral and slightly distant. Theresa wasn\u0027t sure if she\u0027d imagined the intensity of the emotion or not. He relinquished his hold on Lily and ducked his head to drop a loving kiss on top of her downy soft black hair. Theresa was aware of him getting up and following her to the crib. He stood directly behind her and watched over her shoulder as she put the infant to bed. Theresa was intensely aware of him and of the fact that all that stood between them and total nudity was her nightgown and his boxers. \"She has your nose,\" he whispered into her ear and she jumped, surprised and disturbed to feel his hot breath on her skin. \"Do you think so?\" She asked casually. \"I can\u0027t tell.\" \"It\u0027s an unmistakable nose...\" his hand came to rest on her shoulder and she tensed at the feeling of his warm hand on her bare skin. Her breathing went shallow. His hand swept down her shoulder in a gesture that couldn\u0027t be mistaken for anything other than a caress and shackled her upper arm loosely, he brought his other hand up to grip her free arm in a similar fashion. He gently dragged her back until she was leaning against his hot, hard chest and he released his grip with a rumble of satisfaction. His strong arms encircled her waist and he simply held her as they both watched their sleeping baby. The tension eventually left her body as she allowed herself to relax against him and tilt her head back to rest against his shoulder. \"Look at what we did,\" he murmured into her ear, his low voice brimming with love and pride. \"She\u0027s perfect.\" Theresa smiled at the awe she heard in his voice. \"It\u0027s been said that any fool can make a baby,\" she teased and he snorted. \"Yeah but have any of them made a baby as absolutely perfect as this one?\" Theresa looked down at the sleeping baby, with her wrinkled face and the slight milk rash that pinkened her cheeks and her patches of soft spiky hair. She looked like a wrinkly, grumpy little old lady... but she was their wrinkly, grumpy little old lady and she was adorable. \"No... I don\u0027t think any of them has,\" she concurred smugly. \"Theresa...\" his voice took on a serious tone and she tensed again. \"I just... I wanted...\" he seemed at a loss for words and Theresa frowned wondering if they would finally have that promised conversation. It had been more than a month since Lily\u0027s birth and they hadn\u0027t yet discussed his claim that he\u0027d hoped for a girl. \"Thank you,\" he finally said and she turned slightly to look up into his face, visibly surprised by his words. \"For what?\" She asked in confusion. \"For giving me everything I never knew I wanted,\" he said after a long pause. His voice was thick with emotion and he met her eyes directly. His own gaze was burning with intensity as he willed her to believe him. \"What have I given you, Sandro?\" She asked turning fully in his arms. \"A life,\" the two words frustrated her because they told her nothing. She was about to ask him to elaborate, when more words came tumbling out. \"Happiness, contentment and a beautiful daughter...\" \"And are happiness and contentment all you ever wanted from life?\" She asked after giving his words some thought. He smiled slightly. \"No... I want more than that. But it\u0027s a good start.\" \"What else do you want?\" She asked curiously. \"You.\" No hesitation. \"You have me.\" \"No, I don\u0027t. Not the way you were before, when we first married... before I stupidly proceeded to trample your heart and ego into ground.\" \"I\u0027ve changed since then, grown up. I won\u0027t ever be the same woman I was back then.\" \"Yes, you haven\u0027t changed in fantastic ways but you\u0027ve just become more guarded. And I don\u0027t blame you, I really don\u0027t. But I want you to trust me again.\" \"I do,\" she whispered. \"No, I want you to trust me with your heart, Theresa. I want you to allow yourself to love me again. I won\u0027t hurt you.\" \"Why should I trust you that way again, Sandro?\" She asked on a whisper and he smiled, before cupping her face and staring levelly into her eyes. \"Because I love you, Theresa.\" The words staggered her. She should have expected them, should have known he would say them... but for some reason she hadn\u0027t and now had no idea how to deal with them or how to process them or worse, how to believe them. He smiled bitter sweetly. \"I know you don\u0027t believe me yet,\" he whispered. \"But I\u0027ll make it my life\u0027s work to convince you.\" He bent his head and kissed her gently, his lips moist, gentle and sweet on hers. He raised his head much too quickly and Theresa went up on her toes to prolong the contact. \"Sandro...\" she didn\u0027t know what to say but he shook his head and smiled gently. \"It\u0027s okay. I just wanted you to know.\" He kissed her again, a little bit more urgently this time and she could feel his erection straining against her stomach. It startled her because she hadn\u0027t really felt him in so long and she suddenly realised how many months it had been since she\u0027d last felt him moving inside of her. Her dormant hormones sprang to life in an instant and she pushed closer to him, deliberately rubbing herself again his hard penis. He deepened the kiss, his tongue plunging into her mouth in clumsy desperation and his lack of finesse made her even hungrier for him. \"The doctor gave me the all-clear for sex last week,\" she reminded and he groaned harshly at her urgent words. \"I didn\u0027t tell you how I felt because I was trying to get you into bed, Theresa,\" his voice was thick with desire and she smiled up into his flushed face. \"I know that, Sandro. Now hurry up and take me to bed, will you?\" He shuddered and lifted her into his arms before carrying her out of the baby\u0027s room into hers next door. He gently deposited her onto the bed and watched as she dragged the nightgown over her head and tossed it aside, his dark eyes going slumberous with desire. Suddenly self-conscious, Theresa remembered that she\u0027d gained weight and acquired some stretch marks during her pregnancy. She wasn\u0027t the same slender, smooth-skinned woman he\u0027d had sex with last. She lifted her hands to cover herself but when Sandro swore reverently, she paused and looked at him. He couldn\u0027t take his hot eyes off of her; he looked like a starving man staring at a feast while wondering which dish to start with. She watched in fascination, her shyness forgotten, as he fumbled with his boxers and kicked them aside. He was so hard it looked painful and she could see how his heart was racing with every throb of his gorgeous penis. \"God,\" he groaned slightly, his voice awed and a little disbelieving. \"Oh God, oh God, oh God... you\u0027re more beautiful than I remembered.\" He stumbled to the bed and gathered her into his arms, kissing her hungrily. His usual finesse was gone; the hungry kiss was almost adolescently awkward with bumping noses and clashing teeth. But neither of them cared as they went at each other with a ferociousness that bordered on animalistic. Theresa had one brief moment of lucidity, when she asked him to wear a condom. In the past, Sandro would have been infuriated by the request, this time he stumbled from the bed in a daze and made his way to the en-suite where they stocked a new box of condoms every six months, in case their guests needed any. He was back in seconds, box in hand but was shaking so badly that the packaging defeated him. \"I can\u0027t...\" he growled in frustration and she took the box from him with slightly steadier hands. She managed to extract a condom, tossed the box aside and ripped open the foil package. She held up the little rubber circle with a questioning glance and his pupils dilated even further. \"You do it,\" he urged huskily and she smiled before, with agonising slowness, rolling the condom down his length. She gave him one more stroke for good measure but he arched himself away from her touch. \"Don\u0027t... baby... I\u0027m going to come.\" She lifted her hand to the nape of his neck and dragged him down for another urgent kiss. Without breaking the kiss, Sandro flipped her onto her back and parted her thighs with his own. Despite his obvious desperation he entered her slowly and with infinite gentleness. \"Am I hurting you?\" He asked against her mouth and she murmured a negative, pushing back up into him, to make it clear that she wanted more of him inside of her. It was all the invitation Sandro needed before he sheathed himself completely. They both groaned and he tilted his head back, his eyes closed in ecstasy. \"Oh God... Theresa... so long! It\u0027s been so long,\" He whispered. \"I\u0027ve missed this. I\u0027ve missed you.\" He began to move and she gasped at the feeling of fullness inside of her. He knew her body very well and shifted his position slightly until every stroke hit her in exactly the right spot. It didn\u0027t last long... barely two minutes and for the first time in their marriage Sandro lost all control and came before she did. Theresa watched his face contort, as his body clenched and his back arched. A desperate sound was ripped from his throat as he tried to hold back and couldn\u0027t. Theresa followed seconds later, his orgasm triggering hers. She clenched around him, squeezing him tightly and prolonging his pleasure as she took her own. For a few moments they both hung suspended in stasis after their powerful mutual orgasms and time seemed to freeze until Sandro collapsed onto the bed beside her moments later, breathing heavily as he gathered her into his arms. \"Theresa, love of my life,\" he whispered into her hair, as they fought to catch their breath and Theresa smiled before snuggling into his chest with a contented moan and falling asleep in his strong arms.","sourceLink":"https://allnovel.net/the-unwanted-wife-unwanted-1/page-11.html","bookId":1874,"book":{"id":1874,"title":"The Unwanted Wife (Unwanted #1)","description":"Storyline: The Unwanted Wife (Unwanted #1) All Alessandro de Lucci wants from his wife is a son but after a year and a half of unhappiness and disillusionment, all Theresa de Lucci wants from her ice cold husband is a divorce. Unfortunate timing, since Theresa is about to discover that she’s finally pregnant and Alessandro is about to discover that he isn’t willing to lose Theresa.","cover":"https://allnovel.net/images/the-unwanted-wife-unwanted-1.jpg","author":"Natasha Anders","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-unwanted-wife-unwanted-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:47:50 PM"}}
