{"id":81841,"no":16,"title":"Page 16","content":"Vicki launched herself toward the blur of light, the dim figures moving through it taking on solid form as she came closer. If Storm died, she didn\u0027t think she\u0027d be able to forgive herself. If only she hadn\u0027t been so stupidly wrong about Carl Biehn, so sure he couldn\u0027t be the killer. She felt Celluci take her arm and allowed herself to be guided the last few feet, flashlight hanging forgotten in her hand. Cloud had her front paws up on the table and was desperately licking her brother\u0027s face, her tongue alternately smoothing and spiking the fur on his muzzle. Stuart\u0027s arms were around Storm\u0027s shoulders, supporting his weight. Colin stroked trembling fingers down the russet back, whimpering low in his throat. Henry... Vicki squinted at Henry, bent over one of Storm\u0027s back legs. As she watched, he straightened and spat. \"The poison\u0027s spread through his system. I\u0027d kill him if I tried to take it all.\" Colin began to make a noise, low in his throat, not quite a howl, not quite a moan. \"Get him to Dr. Dixon.\" Cloud ignored her. The rest turned to stare. \"We can\u0027t move him, Vicki,\" Henry told her softly. \"He\u0027s trembling on the edge right now. It would be so easy to tip him over.\" \"If only we could get him to change,\" Stuart rested his cheek on the top of Storm\u0027s head, the anger in his voice only emphasizing the pain in his expression. Vicki remembered what the doctor had said about the change somehow neutralizing infection. She supposed poison could be considered a type of infection. \"He can\u0027t change because he isn\u0027t conscious?\" Stuart nodded, tears marking the russet fur with a darker pattern. \"Then what about forcing an unconscious change?\" \"You don\u0027t know anything about us, human.\" \"I know as much as I need to.\" Vicki\u0027s heart began to pound as she gathered up everything Dr. Dixon had told her, added it to her own observations, and knew she had something that might work. \"If he won\u0027t change on his own, maybe he\u0027ll change for Rose. Twins are linked. Dr. Dixon said it, Nadine said it, hell, you can see it. And Rose and Peter are... \" She couldn\u0027t think of a way to phrase it, not with Rose - Cloud - right there. Oh, hell, no way around it. \"As Rose goes into heat, she\u0027s pulling Peter with her. Their reactions are linked more now than they ever have been. If Rose, not Cloud, would, uh, well, maybe it would pull Storm over into Peter.\" Stuart raised his head. \"Do you realize what might happen? How strong a bond this is with our kind?\" Vicki sighed. \"Look, even if it works, he\u0027s too sick to do anything and besides... \" She reached out and stroked one finger down the limp length of Storm\u0027s front leg. Incest or death, what a choice. \"... isn\u0027t it better than the alternative?\" \"Yes. Oh, yes.\" Rose didn\u0027t wait for Stuart to reply. She threw herself down beside her twin, gathering him as close as she could, rubbing her face over his. Stuart released Storm and straightened, one hand resting lightly on his nephew\u0027s shoulder. \"Call him,\" he said, his voice resigned, his expression watchful. He would not allow this to go any further than it had to. \"Bring him back to us, Rose.\" But try not to lose yourself. The last thing they needed now was Rose going into heat without Nadine around to protect her. Breeding reaction had destroyed packs in the past. \"Peter?\" The fine hair along her spine rising, Vicki could feel the power in a name. This is who you are, it said. Come back to us. \"Peter, oh, please. Please, Peter don\u0027t leave me!\" For agonizing moments it looked as though nothing was happening. Rose continued to call, the grief, the pain, the longing, the love enough to raise the dead. Surely it must have some effect on one not yet gone. \"He moved,\" Henry said suddenly. \"I saw his nostrils twitch.\" \"He\u0027s got the scent,\" Stuart said, and he and Colin both shifted uncomfortably. Then it happened. Slowly enough this time that Vicki always after swore she\u0027d seen the exact moment of change. Peter tossed his head and moaned, his skin gray and clammy, left foot horribly cut by the steel jaws of the trap. Rose pressed kisses on his lips, his throat, his eyes, until her uncle moved her bodily off the table and shook her, hard. She burst into tears and buried her face on Peter\u0027s chest, both hands tightly wrapped around one of his. \"His heartbeat is stronger.\" Henry listened to it struggling, forcing the sluggish blood to flow. \"His life has a better hold. I think it\u0027s safe to move him now.\" \"In a minute.\" Vicki took a deep breath. It felt like the first in some time and even the dusty, kerosene scented air of the barn smelled sweet. Jesus Christ, how the hell are we going to explain this to the police ? \"Here\u0027s what we\u0027re going to do... \" \"Excuse me.\" She started and for a moment didn\u0027t recognize the old man who crept forward into the lamplight, Barry Wu trailing behind like an anxious shadow. Carl Biehn reached out a trembling hand and lightly brushed the silver spray of Rose\u0027s hair. She rubbed her nose on the back of her wrist and looked up, eyes narrowing when she saw who it was. \"I know it won\u0027t be enough,\" he said, speaking only to her, the words rough-edged with pain, \"but I realize now I was wrong. In spite of all I\u0027d done to you and yours, even in the midst of your grief, you saved my life at the risk of your own. That is the way of the Lord.\" He had to pause to clear his throat. \"I wanted to thank you, and say I\u0027m sorry even though I know I have no right to your forgiveness.\" He turned away then, and Vicki met his eyes. They were red rimmed with weeping but surprisingly clear. Although pain had become a part of them, no doubt lingered. This was a man who had made his peace with himself. Vicki heard the voice of memory say, \"He\u0027s a decent human being and they\u0027re rare.\" She nodded, once. He echoed it and moved past, bowed but somehow still possessing a quiet dignity. \"Okay people, we\u0027re going to keep this as uncomplicated as possible.\" She blinked rapidly to clear her eyes and shoved at her glasses. \"This is what happened. The police already know someone has been taking potshots at the Heerkens dogs - and the Heerkens - and that I\u0027m looking into it. Obviously Peter found something out... \" \"He spoke with Mark Williams this afternoon,\" Celluci told her, wondering how far he was going to let this vaguely surreal explanation go on. \"Great. Suspicious, he headed over here. Meanwhile, I found out the same information, called, discovered that Peter was missing, pulled Colin off shift, and started out here. Meanwhile, you,\" she pointed at Celluci, \"and you,\" the finger moved to Stuart, \"raced to the rescue. We stick to the truth as far as we can. Now then, Henry, you weren\u0027t here.\" Henry nodded. Staying clear of police investigations had always been one of his tenets of survival. \"Colin, you and Barry, get Peter into the back of your car. Rose, stay with him. Don\u0027t let him change again. And Rose, you weren\u0027t here either. The boys picked you up on their way back into town as you were running along the road, trying to get here, furious that Stuart and Celluci wouldn\u0027t take you with them. Got that?\" Rose sniffed again and nodded, letting go of her twin only long enough to pull on the T-shirt Stuart stripped off and gave her. It fell to mid-thigh and would do as clothing until they reached the doctor\u0027s where the entire family kept something to wear. Gently Colin lifted his brother and, with Peter\u0027s head lolling in the hollow of his throat, made for the door, Rose close at his side, her hands chasing each other up and down her twin\u0027s body. \"Wait by the car,\" Vicki called, sending Barry after them. \"There\u0027re a few more things you\u0027ll have to know.\" \"Like what you\u0027re planning to do about the corpse,\" Celluci snapped, running both hands up through his hair, his patience nearly at an end. \"I don\u0027t know if you\u0027ve taken a good look at it, but someone obviously helped it achieve its current condition, which is going to be just a little hard to explain. Or were you just going to bury it in the woods and conveniently forget about it? And what about Mr. Biehn? Where does he fit into this fairy tale you\u0027re wea... ?\" The gunshot, even strangely muffled as it was, jerked Celluci around. Stuart growled and fought to get himself free of the confining sweatpants. Even Henry whirled to face the sound, and from outside the barn came questioning exclamations and running footsteps. Vicki only closed her eyes and tried not to listen, tried to think of flowers spread across an August morning like a fallen rainbow. \"He went into the corner, put the rifle muzzle in his mouth and pulled the trigger with his toe.\" She felt Celluci\u0027s hands on her shoulders and opened her eyes. \"You knew he was going to do that, didn\u0027t you?\" She shrugged as well as she was able considering his grip. \"I suspected.\" \"No, you knew!\" He started to shake her. \"Why the hell didn\u0027t you stop him?\" She brought her arms up between his and broke his hold. They stood glaring at each other for a moment and when she thought he\u0027d actually hear her, she said, \"He couldn\u0027t live with what he\u0027d done, Mike. Who was I to say he had to?\" Sliding her glasses up her nose, she looked past him and drew a long shuddering breath. \"We\u0027re not done yet. Is there a can of kerosene around for that lamp?\" \"Here, by the table.\" Stuart bent to lift the five gallon can. \"No, don\u0027t touch it.\" Celluci knew at that moment what she was going to do and knew this was his last chance to stop her, to bring this entire night back under the cover of the law. He strongly suspected that if he tried, both Henry and Stuart would align themselves firmly on her side. Trouble was, if it came to choosing sides... Vicki dug a pair of leather driving gloves out of the bottom of her purse and as though she was reading his mind asked him, as she pulled them on. \"Did you want to add something, Celluci?\" Slowly, realizing he had no choice at all, he shook his head, forgetting that she couldn\u0027t see him. He\u0027d decided where he stood back at the farmhouse when he\u0027d passed on the information she\u0027d given him. She knew that as well as he did. Maybe better. Gloves in place, Vicki bent and carefully picked up the can. It felt nearly full. She unscrewed the cap, and paused. She needed both hands on the can but would be unable to see without her flashlight the moment she left the immediate area of the lamp. \"God damn it all to... \" Celluci found himself looking at Henry, whose expression so clearly said, It\u0027s up to you, that it took a moment before he realized it hadn\u0027t been said out loud. Up to me. Right. As if I had a choice. But he walked forward and picked up the flashlight anyway. Vicki squinted up into his face, but the light was too bad to make out nuances. Not that Celluci tends to do nuances. It was enough he was there; it helped. Let\u0027s get on with it. She walked along the beam of light toward Mark Williams body, pouring the kerosene carefully on the packed earth floor as she went, thankful that her grip on the can hid the trembling of her fingers. The law had meant everything to her once. \"As far as anyone will be able to piece together, there was a fight, probably because Carl Biehn walked in on whatever it was his nephew was doing to Peter. During the fight, Mark Williams stepped in one of his own grisly little bits of ironmongery. Out of grief, or guilt, or God knows what, Carl Biehn shot himself. Unfortunately, at some point during the fight, the can of kerosene got knocked over.\" The light slid across the body. It was evident that Mark Williams had died in great pain, the mark of Henry\u0027s fingers still apparent on his neck. Vicki couldn\u0027t find it in her to be sorry. The only thing she\u0027d felt for Mark Williams in life had been contempt and his death hadn\u0027t changed that. As soon feel sorry for squashing a cockroach, she thought, setting the can down beside the corpse and tipping it over. \"What about Carl Biehn?\" \"Leave him alone. Let him lie where he chose.\" She walked back along the light to the table and picked up the lantern. The dancing flame made patterns against the darkness that continued to dance in her vision after she looked away. \"Also unfortunately, at some time during the fight, the lantern shattered.\" The force with which the lantern hit the floor eloquently expressed the emotions that lurked behind her matter-of-fact tones. The kerosene in the shattered reservoir caught first, and then the path Vicki had poured. \"Take a good look, Mike, Stuart. This what you saw when you arrived.\" She took a deep breath and peeled off the gloves, shoving them down into the depths of her bag. \"Plus Peter\u0027s body, lying naked on the table. The two of you rushed in, grabbed Peter, and got out. The flames were then too high for you to go back. Now, I suggest we get out of here, as this barn is ancient, tinder dry, and likely to go up in very little time.\" With a hungry woosh, Mark Williams\u0027 clothes caught, the burning kerosene outlining his body in flame. She paused at the door, her hand dropping from Celluci\u0027s guiding arm, and looked back. A splash of orange had to be fire climbing the surface of the north wall. They couldn\u0027t stop it now, even if they wanted to. She wondered for an instant just who they were, then squared her shoulders and went out to talk to Colin and Barry by their car. \"When we arrived,\" she told them, \"Celluci and Stuart had Peter lying out on the grass. The barn was burning. Forget everything else. You put Peter in the car, called in the fire, and headed back to town, picking Rose up on the way.\" \"But what about... \" Barry didn\u0027t sound happy. Vicki stood quietly, waiting. She couldn\u0027t see his face but she had a good idea of what must be going through his mind. She heard him sigh. \"There isn\u0027t any other way, is there? Not without exposing the wer and... \" She heard Henry in his pause, heard him decide not to voice his suspicions. \"... other things.\" \"No, there isn\u0027t any other way. And don\u0027t let anyone get a good look at your boot.\" She watched their taillights pull away, saw them speed down the highway, then turned and walked back to the three men - the vampire, the werewolf, and the cop - outlined in the flickering flames from the burning building. There would be ash and not much more remaining when the fire burned out. As though his turn had now come to read her mind, Celluci said dryly, \"If they sift the ashes, any competent forensic team could poke a thousand holes in your story.\" \"Why should they investigate? With you and me and two of the local city police on the scene, I think they\u0027ll be happy to take our word for it.\" He had to admit she was likely right. Three cops and an ex-cop with nothing to gain from lying - and covering for a family of werewolves would not likely occur to anyone - they\u0027d wrap it up and write it off and get on to something they could solve. \"Still, there are a lot of loose ends,\" Stuart said thoughtfully. Vicki snorted. \"Police prefer loose ends. Wrap it up too neatly and they\u0027ll think you\u0027re handing them a package.\" The night was sultry, without a breath of wind, and the barn was now burning brightly, but Vicki hugged her arms close. They\u0027d won, she should feel happy, relieved, something. All she felt was empty. \"Hey.\" Henry wished he could see her eyes. All he could see were the flames reflected on her glasses. \"You all right?\" \"Yeah. I\u0027m fine. Why wouldn\u0027t I be?\" He reached out and slid her glasses up her nose. \"No reason.\" She grinned, a little shakily. \"You\u0027d better get going. I don\u0027t know how long it\u0027ll take the fire trucks and the OPP to get out here.\" \"Will you be back to the farmhouse?\" \"As soon as the police are finished with me.\" He shot a look at Celluci but managed to hold back the comment. Vicki sighed. \"Go,\" she told him. He went. Celluci took his place. Vicki sighed again. \"Look, if you\u0027re about to treat me to another lecture on ethics or morals, I\u0027m not in the mood.\" \"Actually, I was wondering if a grass fire was part of your plan? Maybe as a diversion? We\u0027re starting to get some sparks and the field behind the barn is awfully dry.\" Flames were racing across the roof now, the entire structure wrapped in red and gold. The last thing she wanted to do was more damage. \"There\u0027s a water hookup in the garden with plenty of hose. Just wet the field down.\" \"Well, how the hell was I supposed to know?\" \"You could have looked! Jesus H. Christ, do I have to do everything?\" \"No, thanks. You\u0027ve done quite enough!\" He wanted to recall the words the moment he said them but to his surprise, Vicki started to laugh. It didn\u0027t sound like hysteria, it just sounded like laughter. \"What?\" It was a moment before she could speak and even then, the threat of another outbreak seemed imminent. \"I was just thinking that it\u0027s all over but the shouting.\" \"Yeah? So?\" \"So?\" She waved one hand helplessly in the air as she went off again. \"So, now it\u0027s over.\" \"You will come back and see us again? When you need to get out of the city?\" \"I will.\" Vicki grinned. \"But right at the moment, the peace and quiet of the city seems pretty inviting.\" Nadine snorted. \"I don\u0027t know how you stand it. Bad smells and too many strangers on your territory... \" Although she still bore the mark of her twin\u0027s loss, in the last twenty-four hours the wound had visibly healed. Whether it was due to the deaths of Mark Williams and Carl Biehn or the saving of Peter\u0027s life, Vicki wasn\u0027t sure. Neither did she want to know. Rose had also changed, with less of the child she\u0027d been and more of the woman she was becoming showing in her face. Nadine kept her close, snarling when any of the males approached. Vicki moved toward the door where Henry stood waiting for her, tension stretching between him and Stuart in almost a visible line. \"In the barn, before you arrived,\" Henry\u0027d explained earlier, \"I gave him an order he had no choice but to obey. \" \"You vampired him?\" \"If you like. We \u0027re both pretending it didn\u0027t happen, but it\u0027ll take him some time to forget that it did.\" Shadow, his black fur marked with dust, crawled out from under the wood stove, his jaws straining around a huge soup bone. He trotted to the door and dropped it at Vicki\u0027s feet. \"It\u0027s my best bone,\" Daniel told her solemnly. \"I want you to have it so you don\u0027t forget me.\" \"Thank you, Daniel.\" The bone disappeared into the depths of Vicki\u0027s bag. She reached out and picked a bit of fluff from the top of his head. \"I think that I can pretty much guarantee that I\u0027ll never, ever forget you.\" Daniel squirmed, then Shadow threw himself at her knees, barking excitedly. Oh, what the hell, Vicki thought, crouched down and did what she\u0027d done to Storm way back in the beginning, digging her fingers deep into the thick, soft fur of his ruff and giving him a good scratch. It was hard to say which of them enjoyed it more. Celluci leaned against the car and tossed the keys from hand to hand. It was an hour and a half after sunset and he wanted to get going; after the last two days, plain, old, big city crime would be a welcome relief. He still wasn\u0027t certain why he\u0027d offered Vicki and Henry a ride back to Toronto. No, that wasn\u0027t entirely true. He knew why he\u0027d offered Vicki a lift, he just wasn\u0027t sure why he\u0027d included Henry in the package. Granted, the man\u0027s BMW would be another week in the shop, at least, but that wasn\u0027t really much of a reason. \"What the hell is taking them so long?\" he muttered. As if in answer, the back door opened and Shadow bounded out, tail beating the air. Vicki and Henry followed, accompanied by all the rest of the family except Peter, who had remained at Dr. Dixon\u0027s. Vicki had been right about the police investigation. The whole thing was just so weird and the witnesses so credible that the OPP had jumped to pretty much exactly the conclusions Vicki had outlined and were willing to write off the rest. Mark Williams\u0027 police record hadn\u0027t hurt either, especially when a report of his latest business venture had come in from Vancouver. Celluci braced himself as Shadow leapt up on his chest, licked his face twice, then raced off to run noisy circles around the group approaching across the lawn. Werewolves. He\u0027d never be able to look at anyone quite the same way again. If werewolves existed, who knew what other mythical creatures might turn up. Vicki seemed to have taken the whole thing in stride, but then, he\u0027d always known she was a remarkable woman. An obnoxious, arrogant, opinionated woman much of the time, but still, remarkable. On the other hand, he thought as he closed his fist around the keys, Vicki had known Henry since Easter so maybe none of this was new to her. Who knew what the two of them had been involved with? During the gratitude and the good-byes, Stuart approached, hand held out. \"Thank you for your help.\" The tone wasn\u0027t exactly gracious, but Celluci understood about pride. He smiled, careful to keep his teeth covered, and took the offered hand. \"You\u0027re welcome.\" The grip started firmly enough but soon progressed so that the veins in both forearms were standing out against the muscle and Celluci, in spite of being nearly ten inches taller and proportionally heavier, began to worry about his knuckles popping. Nadine, having caught scent of the competition, nudged Vicki and they both turned to watch. \"Do they keep this up until one of them breaks a hand?\" Vicki wondered dryly, squinting at the joined silhouette straining in the fan of light from the car. \"Hard to tell with males,\" Nadine told her in much the same tone. \"Their bodies seem to be able to go on for hours once their brains have shut off.\" Vicki nodded. \"I\u0027ve noticed that.\" If the sudden release came with any visible signals passing between the two men, Vicki didn\u0027t see them. One moment they were locked in stylized hand-to-hand combat, the next they were clapping each other on the shoulders like the best of friends. She figured that the correct internal pressure had finally been reached, tripping a switch and allowing life to go on - but she wasn\u0027t going to ask because she really didn\u0027t want to know. While Stuart demanded to know what his mate was laughing at, Celluci found himself unexpectedly preoccupied by a logistics problem; who was going to sit beside him in the front seat on the way home. It seemed a childish thing to worry about but although the seat should by rights go to Vicki - she was the taller and entitled to the greater leg room - he didn\u0027t want Henry Fitzroy sitting behind him in the dark for the three hour drive. Vicki took the decision away from him. Running her fingers along the car until she found the rear door handle, she opened it, tossed her bag in and climbed in after it, carefully removing Shadow - who\u0027d been trying to get a few more licks in - before she closed the door. She\u0027d known Mike Celluci for eight years and she had a pretty good idea of what was going through his head concerning this. If he thought she was going to run interference between him and Henry, he could think again. Henry kept his face expressionless as he slid into the front seat and buckled his seat belt. Shadow chased the car to the end of the lane then sat by the mailbox barking until they were out of sight. By the time they reached the 401, Celluci couldn\u0027t stand the silence a moment longer. \"Well,\" he cleared his throat, \"are all your cases that interesting?\" Vicki grinned. She knew he\u0027d break first. \"Not all of them,\" she said, \"but then I have a pretty exclusive clientele.\" \"That\u0027s one word for it,\" Celluci grunted. \"What\u0027s going to happen with Rose and Peter, did they say?\" \"As soon as Peter\u0027s better, Stuart\u0027s sending him to stay with his family in Vermont. Rose is pretty broken up about it.\" \"At least he\u0027s alive to send away.\" \"True enough.\" \"Rose is probably going to spend the next week howling in her room while the three adult males make themselves scarce.\" \"Three males? You mean her father... \" \"Apparently it\u0027s a pretty strong biological imperative.\" \"Yeah, but... \" \"Don\u0027t get your shorts in a knot, Celluci, Nadine\u0027ll make sure nothing happens.\" \"Only the alpha female gets to breed,\" Henry said matter-of-factly. \"Yeah? Great.\" Celluci drummed his fingers on the steering wheel and shot a sideways glance at the other man. \"I\u0027m still not sure where you fit in.\" Henry raised a red-gold brow. \"Well, in this particular instance, I acted as intermediary. Usually though, I\u0027m just a friend.\" And then, because he couldn\u0027t resist, he added, \"Sometimes I help Vicki out with the night work.\" \"Yeah. I bet you do.\" The engine roared as Celluci gunned the car past a transport. \"And you probably had more to do with that... that... thing, we ran into last spring than either of you are telling me.\" \"Perhaps.\" \"Perhaps nothing.\" Celluci ran one hand up through his hair. \"Look, Vicki, you can get involved with as many ghoulies and ghosties and things that go bump in the night,\" he shot another look at Henry, \"as you want. But from now on keep me out of it.\" \"No one invited you into it,\" Henry pointed out quietly before Vicki could respond. \"You should be damned glad I showed up!\" \"Should we?\" \"Yeah, you should.\" \"Perhaps you\u0027d care to elaborate on that, Detective-Sergeant.\" \"Perhaps I would.\" Vicki sighed, settled back, and closed her eyes. It was going to be a long ride home.","sourceLink":"https://allnovel.net/blood-trail-vicki-nelson-2/page-16.html","bookId":2465,"book":{"id":2465,"title":"Blood Trail (Vicki Nelson #2)","description":"Storyline: Blood Trail (Vicki Nelson #2) For centuries, the werewolves of Toronto have managed to live in peace and tranquility, hidden quietly away on their London, Ontario farm. But now, someone has learned their secret—and is systematically massacring this ancient race. The only one they can turn to is Henry Fitzroy, Toronto-based vampire and writer of bodice rippers. Forced to hide from the light of day, Henry can’t hunt the killer alone, so he turns to Vicki Nelson for help. As they race against time to stop the murderer, they begin to fear that their combined talents may not be enough to prevent him from completing his deadly plan.","cover":"https://allnovel.net/images/blood-trail-vicki-nelson-2.jpg","author":"Tanya Huff","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-trail-vicki-nelson-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:37:29 PM"}}
