{"id":81830,"no":5,"title":"Page 5","content":"\"Why can\u0027t I come?\" Daniel scowled fiercely up at Peter. \"You always took me with you when you went places before.\" \"It\u0027s too dangerous.\" Peter shimmied the track shorts up over his hips. Vicki tried not to watch and wasn\u0027t significantly successful at it. \"What if the human who shot Silver and Ebon is out there?\" Lips pulled back off small, pointed teeth. \"I\u0027d bite him!\" \"He\u0027d shoot you. You\u0027re not coming.\" \"But Peter... \" \"No.\" \"Cloud?\" She growled, her meaning plain. \"Okay, fine.\" Daniel threw himself down onto the grass. \"But if you get in trouble out there, don\u0027t go howling for me.\" He thrust his chin into his cupped hands and only glowered when Cloud gave him a couple of quick licks as she went by. Vicki fell into step beside Peter and the three of them headed for the nearly overgrown lane behind the barn. \"Hey, Peter!\" Peter turned. \"Ei kee ayaki awro!\" The words rose and fell in a singsong cadence, practically dripping with six-year-old indignation. Peter laughed. \"What did he say?\" \"He said I mate with sheep.\" It hadn\u0027t actually occurred to Vicki that the wer would have a language of their own although now she thought about it, it became obvious. It sounded a bit like Inuit - at least Inuit according to PBS specials on the Arctic; Vicki\u0027d never been farther North than Thunder Bay. When she mentioned this to Peter, he kicked at a clump of yellowed grass. \"I\u0027ve never heard Inuit but we sure got the same problems. The more we integrate with humans the more we speak their language and lose ours. Grandfather and Grandmother spoke Dutch and English and wer. Father still speaks a little Dutch but only Aunt Sylvia bothered to learn any wer.\" He sighed. \"She taught me and I\u0027m trying to teach Daniel but there\u0027s still so much I don\u0027t know. The dirt bag that killed her killed my best chance at keeping our language alive.\" \"You seem to be doing a good job.\" Vicki waved a hand back toward the willow. \"Daniel\u0027s certainly using it... \" It might not be much comfort but it was all she had to offer so far. Peter brightened. \"True. He\u0027s like a little sponge, just soaks it right up. Cloud now,\" he made a grab for his twin\u0027s tail but she whisked it out of his way, \"she learned to say Akaywo and gave up.\" \"Akaywo,\" Vicki repeated. The word didn\u0027t resonate the way it did when Peter said it but it was recognizable. Sort of. \"What does it mean?\" \"Uh, good hunting mostly. But that means hello, good-bye, how\u0027s tricks, long time no see.\" \"Like Aloha.\" \"Aloha. Alo-ha.\" Peter lengthened the second syllable until it trembled on the edge of a howl. \"Good word. But not one of ours... \" Suddenly, Cloud\u0027s ears went up and she bounded off into the underbrush. A second later, Peter shoved his shorts into Vicki\u0027s hands and took off after her. Vicki watched their tails disappear behind a barrier of bushes and weeds and slapped at one of the billions of mosquitoes their passage through the grass had stirred up. \"Now what?\" she wondered. From all the crashing about, they were still after it, whatever it was. \"Hey,\" she called, \"I\u0027ll just keep walking to the end of the lane. You can catch up with me there.\" There was no response but to be honest she didn\u0027t expect one. It was almost comfortable in the lane; a long way from cool but not nearly as hot as it would no doubt get later in the day. Vicki checked her watch. 8:40. \"You can make those calls this morning if you like,\" Nadine had said, \"but you might be better off heading out to the fields and having a look at where it happened before it gets too hot. When it warms up in a couple of hours, no one around here\u0027II be awake to show you the place. Beside, Peter or Rose can tell you all about the three humans while you go.\" A good theory if only Peter and Rose, or Peter and Cloud, or even Storm and Cloud - whatever - had stuck around. She brushed aside a swarm of gnats, crushed another mosquito against her knee, and wondered if Henry was all right. The wer had apparently light-proofed a room for him, but at this point Vicki wasn\u0027t entirely certain she\u0027d trust their good intentions. Still, Henry had been here other times and obviously survived. Pushing her glasses up her nose, sweat having well lubricated the slope, she reached the end of the lane and paused, a little overwhelmed by the vast expanse of land now before her. Up above, the sky stretched on forever, hard-edged and blue. Down below, there was a fence and a field and another fence and a bigger field. There were sheep in both fields. In fact, there were three sheep not twenty feet away on the other side of the first fence. Two of them were eating, the third stared down the arch of its Roman profile at Vicki. Vicki had never heard that sheep were dangerous, but then, what did she know, she\u0027d never been this close to a sheep before. \"So,\" leaning carefully against the fence, she picked a tuft of fleece off a rusty bit of wire and rolled it between her fingers, \"I don\u0027t suppose you saw anything the night that Jason Heerkens, aka Ebon, was murdered?\" At the sound of her voice, the staring sheep rolled its eyes and danced backward while the other two, still chewing, peeled off to either side and trotted a few feet away. \"So much for interviewing witnesses,\" she muttered, turning back to look down the lane. \"Where the hell are Cloud and Pe... Storm?\" As if in answer to her summons, the two wer burst out of the bushes and bounded toward her, tongues lolling, tails waving. Cloud reached the fence first and without pausing sailed over it and came to a dead stop, flattened against the grass on the other side. Storm, only a heartbeat behind, changed in midair, and Peter landed beside his sister in a very human crouch. The sheep, obviously used to this sort of thing, barely bothered to glance up from their grazing. Vicki, less accustomed, tried to maintain an unruffled expression. Silently, she offered Peter his shorts. \"Thanks.\" He slid them on with practiced speed. \"We almost had him that time.\" \"Had who?\" \"Old groundhog, lives under a pile of cedar rails alongside the lane. He\u0027s fast and he\u0027s smart, but this time he made it to his den with only about a hair between him and Cloud\u0027s teeth.\" \"Couldn\u0027t you just change and move the rails.\" Peter shook his head, bits of bracken flying out of his hair. \"That\u0027d be cheating.\" \"It\u0027s not like we\u0027re hunting for food,\" Rose put in, stretching out on the grass. \"There\u0027d be no fun in it if we used our hands.\" Vicki decided not to point out that there probably wasn\u0027t much fun in it for the groundhog either way. She slung her bag over the fence and followed a little more slowly. Rails she might have flag-jumped but wire offered no surface solid enough to push off from. Besides, if I try to keep up with a couple of teenage werewolves, I\u0027ll probably strain something. Besides credibility. She pushed her glasses up her nose. \"Where to now?\" \"Toward the far side of the big pasture.\" Peter pointed. \"Near the woods.\" The woods offered sufficient cover for a whole army of assassins. Vicki picked up her bag. Time to start earning her money. \"Who owns the woods?\" \"The government, it\u0027s crown land.\" Peter led the way along the fence, Cloud staying close by his side. \"We won\u0027t cut straight across \u0027cause these ewes are carrying late fall lambs and we don\u0027t want to bother them any more than we have to. Our property ends at the trees,\" he continued, \"but we\u0027re butted up against the Fanshawe Conservation Area.\" He grinned. \"We help maintain one of the best deer herds in the county.\" \"I\u0027m sure. Let me guess, that\u0027s how you met the game warden?\" \"Uh huh. He came on one of the pack\u0027s kills, knew it hadn\u0027t been dogs, thought he recognized the spoor as wolf but couldn\u0027t figure out what the occasional bare human footprint was doing in there, and tracked us. He was really good... \" \"And you, that is, the pack, wasn\u0027t being as careful as it could have been.\" In Vicki\u0027s experience, complacency had exposed the majority of the world\u0027s secrets. \"Yeah. But Arthur turned out to be an okay guy.\" \"He could have turned out to be disaster,\" Vicki pointed out. Peter shrugged. What was done was done as far as the pack was concerned. They\u0027d taken steps to see it would never happen again and thought no more about it. \"What about the doctor?\" She watched Cloud snap at a grasshopper and wondered if the separate forms had separate taste buds. \"Dr. Dixon\u0027s ancient history.\" Peter told her, snatched a high-leaping insect out of the air and popped it in his mouth. Vicki swallowed a rising wave of nausea. The crunch, crunch, swallow, gave the snack an immediacy the earlier episode with the rats hadn\u0027t had. And while it was one thing to see Cloud do it... Well, I guess that answers my question. Then she saw the look on Peter\u0027s face. The little shit ate that on purpose to gross me out. She gave her glasses a push and two steps later plucked a grasshopper off the front of her shorts - fortunately, it was a small one. A long time ago, on a survival course, an instructor had told Vicki that many insects were edible. She hoped he hadn\u0027t been pulling her leg. Biting down wasn\u0027t easy. Actually, it tastes a bit like a squishy peanut. The expression on Peter\u0027s face made the whole thing worthwhile. The last time she\u0027d impressed a young man to that extent, she\u0027d been considerably younger herself and her mother had gone away for the weekend. Mike Celluci would maintain that she was insanely competitive. That wasn\u0027t true. She merely liked to preserve the status quo and her position at the top of the heap. And no teenage anything was getting the better of her... \"Now, then,\" she tongued something out of her tooth and swallowed it quickly - there were limits - \"you were telling me about Dr. Dixon?\" \"Uh, yeah, well... \" He shot her a glance out of the corner of one eye but made an obvious decision not to comment. \"When our grandparents emigrated from Holland after the war, Grandmother was pregnant with Aunt Sylvia and Aunt Nadine. They got as far as London when she went into labor. We don\u0027t normally use doctors, the pack helps if it\u0027s needed. I went out to the barn when Daniel was born but Rose watched.\" Cloud looked up at the sound of her name. She\u0027d run ahead and was urinating against a fence post. \"Anyway,\" Peter continued, nostrils flared as they passed the post, \"there was this young doctor in the crowd and before Grandfather could carry Grandmother away, he\u0027d hustled the both of them and Father, who was about five, into his office.\" He snickered. \"Boy, did he get a shock. As soon as they were alone, Grandfather changed and almost ripped his throat out. Lucky for the doctor, Aunt Sylvia was wrong - somehow, I don\u0027t know - anyway, Dr. Dixon acted like a doctor and Grandfather let him live. He\u0027s been taking care of all our doctor stuff ever since.\" \"Handy man to know.\" The amount of \"doctor stuff\" necessary in Canada for government documents alone could be positively staggering. The wer were lucky they\u0027d stumbled onto Dr. Dixon when they had. \"So that leaves only Barry Wu.\" \"Yeah.\" Peter sighed deeply and scratched at the patch of red hair in the center of his chest. \"But you better talk to Colin about him.\" \"I intend to. But I\u0027d also like to hear your opinion.\" Peter shrugged. \"I like him. I hope he didn\u0027t do it. It\u0027ll kill Colin if he did.\" \"Have they been partners long?\" \"Since the beginning. They went to police school together.\" They\u0027d reached the second fence. Cloud sailed over it, just as she had the first. Peter slipped his thumbs behind the waistband of his shorts, changed his mind, and started climbing. \"Barry\u0027s an okay guy. He reacted to us the same way you did... \" Twisting his head at an impossible angle, he grinned back over his shoulder at her. \"... kind of shell-shocked but accepting.\" Cloud had run on ahead, nose to the ground. About three quarters of the way across the field, she stopped, sat back on her haunches, pointed her nose at the sky, and howled. The sound lifted every hair on Vicki\u0027s body and brought a lump into her throat almost too big to swallow. From not very far away came an answer; two voices wrapping about each other in a fey harmony. Then Peter, still in human form, wove in his own song. The sheep had begun to look distinctly nervous by the time the howl trailed off. \"Father and Uncle Stuart.\" Peter broke the silence to explain the two additional voices. \"They\u0027re checking fences.\" He turned a little red under his tan. \"Well, it\u0027s almost impossible not to join in... \" As Vicki had felt a faint desire - firmly squelched - to add in her own two cents worth, she nodded understandingly. \"Is that where it happened?\" \"Yeah. Right here.\" At first glance, \"right here\" looked no different than anywhere else in the field. \"Are you sure?\" \"Of course, I\u0027m sure. It hasn\u0027t rained and the scent\u0027s still strong. Besides,\" one bare foot brushed lightly over the cropped timothy grass, \"I was the first one to the body.\" Cloud pushed up against his legs. He reached down and pulled gently on her ears. \"Not something I\u0027m likely to forget.\" \"No, probably not.\" Maybe she should have told him that he\u0027d forget in time but Vicki didn\u0027t believe in lying if she could avoid it, even for comfort\u0027s sake. The violent death of someone close should make a lasting impression. Given that, she gentled her voice to ask, \"Are you going to be up to this?\" \"Hey, no problem.\" His hand remained buried in the thick fur behind Cloud\u0027s head. The wer touched a great deal, she realized, and it wasn\u0027t just the youngsters. Last night around the kitchen table, the three adults had seldom been out of contact with each other. She couldn\u0027t remember the last time she\u0027d spontaneously touched her mother. And why am I thinking about that now? She dug out her pad and a pencil. \"Let\u0027s get started, then.\" Ebon had been traveling northeast across the field. The bullet had spun his body around so that the ruin of his head had pointed almost due north. Even without Peter\u0027s description, there were enough rust brown stains remaining on the grass to show where what was left of Ebon\u0027s head had come to rest. The shot had to have come from the south. Vicki sat back on her heels and stared south into the wood. Brilliant deduction, Sherlock. She stood, rubbing at the imprints of dried grass on her knees. \"Where was your aunt shot?\" Peter remained sitting, Cloud\u0027s head in his lap. \"In the small south field, just off that way.\" He pointed. The small south field wrapped around a corner of the woods. \"Ebon was coming from there.\" \"Similar shot?\" \"Yeah.\" Head shots, at night, on moving targets. Whoever he was, he was good. \"Which way was the body facing?\" \"Like this.\" Peter shoved Cloud\u0027s body around until it was aligned to the northwest. She endured the mauling but didn\u0027t look thrilled. Silver\u0027s tracks had been coming from the south and the shot had spun her in an arc identical to Ebon\u0027s. The Conservation Area woods ran east of the small south field. \"I think we can safely assume it\u0027s the same guy and he shot from the cover of the trees,\" Vicki muttered, wishing for a city street and a clear line of sight. Trees shifted and moved about the way buildings never did and, from where Vicki stood, the woods looked like a solid wall of green and brown, with no way of knowing what they hid. A dribble of moisture rolled out of her hair and down the back of her neck. Someone could be watching now, raising the rifle, taking aim... You \u0027re getting ridiculous. The killings have happened at night. But she couldn\u0027t stop a little voice from adding. So far. Her back to the trees and an itching she couldn\u0027t control between her shoulder blades, she stood. \"Come on.\" \"Where?\" Peter rose effortlessly. Vicki tried not to be annoyed. \"We\u0027re going to have a look for the bullet that killed your aunt.\" \"Why?\" He fell into step beside her as Cloud bounded on ahead. \"We\u0027re eliminating the possibility of two killers. So far, the pattern of both deaths are identical with only one exception.\" \"The silver bullet?\" \"That\u0027s right. If the deaths match on all points, the odds are good there\u0027s a single person responsible.\" \"So if that\u0027s the case, how do you find them?\" \"You follow the pattern back.\" Peter frowned. \"I don\u0027t think I understand what you mean.\" \"Common sense, Peter. That\u0027s all.\" She scrambled over another fence. \"Everything connects to everything else. I just figure out how.\" \"After Aunt Sylvia died, the pack went hunting for her killer but we couldn\u0027t find any scents in the wood that didn\u0027t belong.\" \"What do you mean, didn\u0027t belong?\" \"Well, there\u0027s a lot of scents in there. We were looking for a strange one.\" He squirmed a little under Vicki\u0027s frown and continued in a less condescending tone. \"Anyway, after Uncle Jason was shot, Uncle Stuart wouldn\u0027t let anyone go into the woods except Colin.\" Good way to lose Colin, Vicki thought, amazed as she often was at the stupid things otherwise intelligent people could do, but all she said aloud was, \"And what did Colin discover?\" \"Well, not Barry\u0027s scent, and I think that was mostly what he was looking for.\" Cloud was making tight circles, nose to the ground, in roughly the center of the field. \"Is that where it happened?\" \"Uhhuh.\" Teeth clenched, Vicki waited for the howl. It didn\u0027t come. When she asked Peter why, he shrugged and said, \"It happened weeks ago.\" \"Don\u0027t you miss her?\" \"Of course we do, but... \" He shrugged again, unable to explain. Everyone but Aunt Nadine had finished howling for Silver. Cloud had found the bullet by the time they reached her and had dug it clear with more enthusiasm than efficiency. Her muzzle and paws had acquired a brown patina and the rest of her pelt was peppered with dirt. \"Good nose!\" Vicki exclaimed, bending to pick up the slug. And a good thing there wasn\u0027t anything else to learn from the scene, she added silently, surveying the excavation. A quick wipe on her shorts and she held the prize up in the sunlight. It certainly wasn\u0027t lead. Peter squinted at the metal. \"So it\u0027s just one guy?\" Vicki nodded, dropping the bullet into her bag. \"Odds are good.\" One marksman. Who killed at night with a single shot to the head. One executioner. \"And you can find him now?\" \"I can start looking.\" \"We should\u0027ve found the dirtbag,\" Peter growled, savagely ripped up a handful of grass. \"I mean, we\u0027re hunters!\" \"Hunting for people is a specialized sort of a skill,\" Vicki pointed out levelly. The last thing she wanted to do was inspire heroics. \"You have to train for it, just like everything else. Now, then,\" she squinted at the woods then looked back at the two young wer, \"I want the both of you to return to the house. I\u0027m going to go in there and have a look around.\" \"Uh, Ms. Nelson, you don\u0027t have much experience in woods, do you?\" Rose asked tentatively. \"No. Not especially,\" Vicki admitted, \"but... Rose, what the hell do you think you\u0027re doing?\" \"It\u0027s just that, you\u0027re from the city and... \" \"That\u0027s not what I meant!\" She positioned herself between the woods and the girl. \"You know someone is watching your family from those trees. Why are you changing? Why take such a stupid risk?\" Rose rubbed at the dirt on her face. \"But there\u0027s no one there now.\" \"You can\u0027t know that!\" Why the whole damned county wasn\u0027t in on the family secret, Vicki had no idea. \"Yes, I can.\" \"How?\" \"It\u0027s upwind.\" \"Upwind? The woods are upwind? You can smell that there\u0027s no one there?\" \"That\u0027s right.\" Vicki reminded herself once again not to judge by human standards and decided to drop it. \"I think you two should get home.\" \"Maybe we should stay with you.\" \"No.\" Vicki shook her head. \"If you\u0027re with me, you\u0027ll influence what I see.\" She raised a hand to cut off Peter\u0027s protest and added, \"Even if you don\u0027t intend to. Besides, it\u0027s too dangerous.\" Peter shrugged. \"It\u0027s been safe enough since Ebon died.\" It took her a moment to understand. \"You mean that two members of your family were shot out here and you\u0027re still coming in range of the woods? At night?\" \"We\u0027ve been in pairs like Henry said,\" he protested. \"And we\u0027ve had the wind.\" / don\u0027t believe this... \"From now on, until we know what\u0027s going on, no one comes out to these fields.\" \"But we have to keep on eye on the sheep.\" \"Why?\" Vicki snapped, waving a hand toward the flock. \"Do they do something?\" \"Besides eat and sleep? No, not really. But the reason there\u0027s so few commercial sheep operations in Canada is a problem with predators.\" Peter\u0027s lips drew back off his teeth and under his hair, his ears went back. \"We don\u0027t have problems with predators.\" \"But you\u0027ve gotta keep a pretty constant eye out,\" Rose continued, \"so someone\u0027s got to come out here.\" \"Can\u0027t you move the sheep closer to the house?\" \"We rotate the pastures,\" Peter explained. \"It doesn\u0027t quite work like that.\" \"Bugger the pastures and bugger the sheep,\" Vicki said, her tone, in direct contrast to her words, reminiscent of a lecture on basic street safety to a kindergarten class. \"Your lives are more important. Either leave these sheep alone for a while or move them closer to the house.\" Rose and Peter exchanged worried glances. \"It\u0027s not just the sheep... \" Rose began. \"Then what?\" \"Well, this is the border of our family\u0027s territory. It has to be marked.\" \"What do you mean, marked?\" Vicki asked even though she had a pretty good idea. Rose waved her hands, her palms were filthy. \"You know, marked. Scent marked.\" \"I would have thought that had been done already.\" \"Well, yeah, but you\u0027ve got to keep doing it.\" Vicki sighed. \"So you\u0027re willing to risk your life in order to pee on a post?\" \"It\u0027s not quite that simple.\" Rose sighed as well. \"But I guess not.\" \"I guess we could talk to Uncle Stuart...\" Peter offered. \"You do that,\" Vicki told him agreeably. \"But you do that back at the house. Now.\" \"But... \" \"No.\" Things had been a little strange for Vicki lately - her eyes, Henry, werewolves - but she was working now and, regardless of the circumstances, that put her back on firm ground. Two shots had been fired from those trees and somewhere in the woods would be the tiny bits of flotsam that even the most meticulous of criminals left behind, evidence that would lead her out of the woods and right down the bastard\u0027s throat. The twins heard the change in her voice, saw the change in her manner, and responded. Cloud stood and shook, surrounding herself for a moment in a nimbus of fine white hairs. Peter heaved himself to his feet, his hand on Cloud\u0027s shoulder. He tucked his thumbs behind the waist band of his shorts, then paused. \"Would you mind?\" he asked, gesturing at her shoulder bag with his chin. Vicki sighed, suddenly feeling old. The distance between thirty-one and seventeen stretched far wider than the distance between thirty-one and four hundred and fifty. \"I assume your nose tells you it\u0027s still safe?\" \"Cross my heart and bite my tail.\" \"Then give them here,\" she said, holding out her hand. He grinned, stripped them off, and tossed them to her. Peter stretched, then Storm stretched, then he and Cloud bounded back toward the house. Vicki watched until they leapt the closer of the two fences, stuffed Peter\u0027s shorts in her bag, and turned toward the woods. The underbrush appeared to reach up to meet the treetops reaching down, every leaf hanging still and sullen in the August heat. Who knew what was in there? She sure as hell didn\u0027t. At the edge of the field she stopped, squared her shoulders, took a deep breath, and pushed forward into the wilderness. Somehow, she doubted this was going to be fun. Barry Wu blinked a drop of sweat from his eye, squinted through his front sights, and brought the barrel of his .30-06 Springfield down a millimeter. Normally, he preferred to shoot at good old-fashioned targets set at the greatest distance accuracy would allow but he\u0027d just finished loading a number of low velocity rounds - the kind that reacted ballistically at one hundred yards the way a normal round would react at five - and he wanted to try them out. He\u0027d been reloading his own cartridges since he was about fourteen, but lately he\u0027d been getting into more exotic varieties and these were the first of this type he\u0027d attempted. A hundred yards away, the lead silhouette of the grizzly waited, scaled in the same five to one ratio as the rounds he planned to put into it. The bullet slammed into the target with a satisfyingly solid sound and Barry felt a little of the tension drain from his neck and shoulders as the grizzly went down. He worked the bolt, expelling the spent cartridge and moving the next round into the chamber. Shooting had always calmed him. When it was good, and lately it always was, he and the rifle became part of a single unit, one the extension of the other. All the petty grievances of his life could be shot away with a simple pull of the trigger. All right, not all, he conceded as the moose and the mountain sheep fell in quick succession. I\u0027m going to have to do something about Colin Heerkens. The trust necessary for them to do their job was in definite danger. Rising anger caused him to wing the elk, but the white-tailed deer he hit just behind the shoulder. We clear this up tonight. He centered the last target and squeezed the trigger. One way or another. A hundred yards away, the lead silhouette of the timber wolf slammed flat under the impact of the slug. Vicki rubbed at a welt on her cheek and waved her other hand about in an ineffectual effort to discourage the swarms of mosquitoes that rose around her with every step. Fortunately, most of them appeared to be males. Or dieting females, she amended, trying not to inhale any significant number. Barely a hundred yards into the trees, the field and the sheep had disappeared and looking back the way she\u0027d come, all she could see were more trees. It hadn\u0027t been as hard a slog as she\u0027d feared it would be but neither was it a stroll through the park. Fortunately, the sunlight blazed through to the forest floor in sufficient strength to be useful. The world was tinted green, but it was visible. \"Somebody should tidy this place up,\" she muttered, unhooking her hair from a bit of dead branch. \"Preferably with a flamethrower.\" She kept to as straight a path as she could, picking out a tree or a bush along the assumed line of fire and then struggling toward it. Somewhere in these woods, she knew she\u0027d find a fixed place where their marksman had a clear line of sight. It hadn\u0027t taken her long to realize that this place could only exist up off the forest floor. Which explained why the wer had found nothing; if they hunted like wolves, it was nose to the ground. Trouble was, every tree she passed had so far been un-climbable. Trees large enough to bear an adult\u0027s weight stretched relatively smooth and straight up toward the sun, not branching until there was a chance of some return for the effort. \"So, unless he brought in a ladder... \" Vicki sighed and scrubbed a drop of sweat off her chin with the shoulder of her T-shirt. She could see what might be higher ground a little to the right of where she thought she should be heading and decided to make for it. Stepping over a fallen branch, she tripped as the smaller branches, hidden under a rotting layer of last year\u0027s leaves, gave way under her foot. \"Parking lots.\" Shoving her glasses back up her nose, she stood and scowled around her at Mother Nature in the height of her summer beauty. \"I\u0027m all in favor of parking lots. A couple of layers of asphalt would do wonders for this place.\" Off to one side a cicada started to buzz. \"Shut up,\" she told it, trudging on. The higher ground turned out to be the end of a low ridge of rock on which a massive pine had managed to gain, and maintain, a roothold. Brushing aside years of accumulated needles, Vicki sat down just outside the perimeter of its skirts and contemplated her scratched and bitten legs. This was all Henry\u0027s fault. She could have been at home, comfortably settled in front of her eighteen inch, three speed, oscillating fan, watching Saturday morning cartoons, and... \"... and the wer would continue to die.\" She sighed and began building the fallen pine needles into little piles. This was what she\u0027d chosen to do with her life - to try to make a difference in the sewer the world was becoming - no point in complaining just because it wasn\u0027t always an easy job. And she had to admit, it was a job that had gotten a hell of a lot more interesting since Henry had come into her life. The jury was still out on whether or not that was a good thing given that the last time they\u0027d worked together she\u0027d come closer to getting killed than she ever had in nine years on the Metro Police. \"And this time, I\u0027m being eaten alive.\" She rubbed at a bite on the back of her leg with the rough front of her sneaker. \"Maybe I\u0027m going at this the wrong way. Maybe I should have started with the people. What the hell am I going to recognize out here?\" Then her hand froze over a patch of needles and slowly moved back until the needles were in full sunlight again. The scorch mark was so faint she had to hold her head at just the right angle to see it. About two inches long and half an inch wide, it was a marginally darker line across the pale brown carpet of dead pine - the mark a spent cartridge might make against a tinder dry resting place. Oh, all right, honesty forced her to admit, it could\u0027ve been caused by any number of other things - like acid rain or bunny piss. But it sure looked like a cartridge scorch to her. Of course, it could\u0027ve come from a legitimate hunter out here to blow away whatever it is legitimate hunters blow away. There were plenty of bits of bare rock nearby where the gunman could have stood to retrieve his brass and plenty of places Vicki had cleared herself but she searched for tracks anyway. Not expecting to find any didn\u0027t lessen the frustration when she didn\u0027t. Better to find where the shot came from. The ridge stood barely two and a half feet higher than the forest floor and the lines of sight hadn\u0027t improved. Vicki looked up. The pine was higher than most of the trees around it but its branches drooped, heavy with needles, right to the ground. Then on the north side, she found a way in to a dimly lit cavern, roofed in living needles, carpeted in dead ones. It was quiet in there, and almost cool, and the branches rose up the trunk as regular as a ladder; which was a good thing because Vicki could barely see. This was it. This had to be it. Had she seen the pine from the field? She couldn\u0027t remember, trees all looked alike to her. She peered at a few tiny spurs snapped off close to the trunk, her nose almost resting on the bark. They could have been broken by someone scrabbling for a foothold. Or they could have been broken by overweight squirrels. There\u0027s only one way to be sure. Settling her glasses more firmly on her face, she swung up onto the first branch. Climbing wasn\u0027t as easy as it looked from the ground; a myriad of tiny branches poked and prodded and generally impeded progress and the whole damn thing moved. Vicki hadn\u0027t actually been up a tree since about 1972 and she was beginning to remember why. If her nose hadn\u0027t scraped by an inch from the sneaker print, she probably wouldn\u0027t have seen it. Tucked tight up against the trunk on a flattened glob of pine resin, was almost a full square inch of tread signature. Not enough for a conviction, not with every man, woman, and child in the country owning at least one pair of running shoes, but it was a start. The stuff was so soft that removing it from the tree would destroy the print so she made a couple of quick sketches - balanced precariously on one trembling leg - then placed her foot as close to it as possible and heaved herself up. Her head broke free into direct sunlight. She blinked and swore and when her vision cleared, swore again. \"Jesus H. Christ on crutches... \" She\u0027d come farther into the woods than she\u0027d thought. About five hundred yards away, due north, was the spot where Ebon had been shot. A half turn and she could see the small pasture where Silver had been killed, a little closer but still an amazing distance away. If Barry Wu had pulled the trigger, he should have no trouble making the Olympic team or bringing home a gold. Vicki knew that some telescopic sights incorporated range finders but even they took both innate skill and years of practice to acquire the accuracy necessary. Throw in a moving target at five hundred yards... She\u0027d once heard that according to all the laws of physics, a human being should not be able to hit a major league fastball. By those same laws of physics, the assassin had hit not one, but two, and hit them out of the ballpark besides. A quick search turned up rubs in the bark where he\u0027d braced his weapon on the tree. \"Unfortunately,\" she sighed, leaning her head back against a convenient branch, \"discovering how and where brings me no closer to finding the answers to why and who.\" Closing her eyes for a moment, the sun hot against the lids, she wondered if she\u0027d actually go through with it; if when she found the killer, she\u0027d actually turn him over to the wer for execution. She didn\u0027t have an answer. She didn\u0027t have an alternative either. It was time to head back to the house and make some phone calls, although she had a sick feeling that a drive into town and a good look at Constable Barry Wu\u0027s sneakers would be more productive. Climbing down the tree took less time than climbing up but only because gravity took a hand and dropped her seven feet before she landed on a branch thick enough to hold her weight. Heart pounding, she made it the rest of the way to the ground in a slightly less unorthodox fashion. Had her Swiss army knife contained a saw, she would have attempted to remove that final branch, the one that lifted the climber out of the tree and into the light. Unfortunately, it didn\u0027t and whittling off a pine branch two inches in diameter didn\u0027t appeal to her. In fact, except for attempting to keep them out of those fields, there wasn\u0027t a damn thing she could do to prevent the tree from being used as a vantage point to shoot the wer. \"Never a beaver around when you need one,\" she muttered, wishing she\u0027d brought an ax. She had, however, uncovered two facts about the murderer. He had to be at least five foot ten, her height - any shorter and his shoulder wouldn\u0027t be level with the place where the rifle barrel had rested - and the odds were good that his hair was short and straight. She dragged a handful of needles and a small branch out of her short, straight hair. Had her hair been long or curly, she\u0027d never had made it out of the tree alive. \"Excuse me?\" The shriek was completely involuntary and as she caught it before it passed her lips Vicki figured it didn\u0027t count. Her hand on her bag - it had made a useful weapon in the past - she whirled around to confront two puzzled looking middle-aged women, both wearing high-powered binoculars, one of them carrying a canvas bag about a meter long and twenty centimeters wide. \"We were just wondering,\" said the shorter, \"what you were doing up that tree.\" Vicki shrugged, waning adrenaline jerking her shoulders up and down. \"Oh, just looking around.\" She waved a not quite nonchalant hand at the canvas bag. \"You out here to do a little shooting?\" \"In a manner of speaking. Although this is our camera tripod, not a rifle.\" \"It\u0027s illegal to shoot on conservation authority property,\" added the other woman. She glared at Vicki, obviously still unhappy at having found her up in a tree. \"We would report anyone we found shooting out here, you can be certain of that.\" \"Hey.\" Vicki raised both hands to shoulder height. \"I\u0027m unarmed.\" As neither woman seemed to appreciate her sense of humor, she lowered them again. \"You\u0027re birders, aren\u0027t you?\" A recent newspaper nature column had mentioned that birders was now the preferred term; bird-watcher having gone out of vogue. Apparently, the column had been correct. Twenty minutes later, Vicki had learned more about nature photography than she wanted to know; learned that in spite of the high-power binoculars the two women had seen nothing strange on the Heerkens farm - \"We don\u0027t look at other people\u0027s property, we look at birds,\" - and, in fact, didn\u0027t even know where the Heerkens farm was; learned that a .30 caliber rifle and scope would easily fit into a tripod bag, allowing it to be carried into the woods without arousing suspicion. Although neither woman had ever come across a hunter, they\u0027d both found spent shell casings and so were always on the look out. With middle-class confidence that no one would ever want to hurt them, they laughed at Vicki\u0027s warnings to be careful. There were two bird-watching clubs in London as well as a photography group run by the YMCA that often came out to the conservation area. Armed with names and phone numbers of people to contact - \"Although the members of that other club are really nothing more than a group of dilettantes. You\u0027d do much better to join us.\" - Vicki bade farewell to the birders and tromped off through the bush, willing to bet big money that not everyone with a pair of binoculars kept then trained exclusively on birds and that someone was shooting more than film. \"Henry Fitzroy?\" Dave Graham peered over his partner\u0027s shoulder at the pile of papers on the desk. \"Isn\u0027t that the guy that Vicki\u0027s seeing?\" \"What if it is?\" Celluci growled, pointedly turning the entire pile over. \"Nothing, nothing.\" Dave went around to his side of the desk and sat down. \"Did, uh, Vicki ask you to check into his background?\" \"No. She didn\u0027t.\" Dave recognized the tone and knew he should drop it, but some temptations were more than mortal man could resist. \"I thought you and Vicki had a relationship based on, what was it, \u0027trust and mutual respect\u0027?\" Celluci\u0027s eyes narrowed and he drummed his fingers against the paper. \"Yeah. So?\" \"Well... \" Dave took a long, slow drink of his coffee. \"It seems to me that checking up on the other men in her life doesn\u0027t exactly fit into those parameters.\" Slamming his chair back, Celluci stood. \"It\u0027s none of your damned business.\" \"You\u0027re right. Sorry.\" David smiled blandly up at him. \"I\u0027m just looking out for a friend. Okay? He\u0027s a writer, god knows what he\u0027s been into.\" \"Right.\" Seemingly of their own volition, Celluci\u0027s fingers crumpled the uppermost paper into a tightly wadded ball. \"She can see who she wants,\" he ground out through clenched teeth and stomped out of the office. Dave snickered into his coffee. \"Of course she can,\" he said to the air, \"as long as she doesn\u0027t see them very often and they meet with your approval.\" He made plans to be as far out of range as possible when Vicki found out and the shit hit the fan. By 10:27, Vicki was pretty sure she was lost. She\u0027d already taken twice as long coming out of the woods as she\u0027d spent going in. The trees all looked the same and under the thick summer canopy it was impossible to take any kind of a bearing on the sun. Two paths had petered out into nothing and a blue jay had spent three minutes dive-bombing her, screaming insults. Various rustlings in the underbrush seemed to indicate that the locals found the whole thing pretty funny. She glared at a pale green moss growing all around a tree. \"Where the hell are the Boy Scouts when you need one?\"","sourceLink":"https://allnovel.net/blood-trail-vicki-nelson-2/page-5.html","bookId":2465,"book":{"id":2465,"title":"Blood Trail (Vicki Nelson #2)","description":"Storyline: Blood Trail (Vicki Nelson #2) For centuries, the werewolves of Toronto have managed to live in peace and tranquility, hidden quietly away on their London, Ontario farm. But now, someone has learned their secret—and is systematically massacring this ancient race. The only one they can turn to is Henry Fitzroy, Toronto-based vampire and writer of bodice rippers. Forced to hide from the light of day, Henry can’t hunt the killer alone, so he turns to Vicki Nelson for help. As they race against time to stop the murderer, they begin to fear that their combined talents may not be enough to prevent him from completing his deadly plan.","cover":"https://allnovel.net/images/blood-trail-vicki-nelson-2.jpg","author":"Tanya Huff","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-trail-vicki-nelson-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:37:29 PM"}}
