{"id":86663,"no":16,"title":"Page 16","content":"\"It\u0027s your choice what you tell them.\" I look up at the brick building that I lived in for almost a year. I had to get up at six thirty and shower in front of others, I had to eat when they said eat, and when I needed to use the facilities during juvie school, I was escorted into the bathroom so I could crap. It was pathetic. Just like back then, it doesn\u0027t seem like I have any choice in the matter. I follow Yates and the other ReSTART guys towards the male sector, but look back and watch Ms. Bushnell escort the girls to the other sector. Maggie is limping behind her. Very soon she\u0027s going to see the reality of how I lived for a year. I wish I could stop her from going in there. When I was in the DOC, the girls and guys never saw each other. We had school a few hours a day, went to group therapy, were assigned chores, went outside for an hour, ate three meals, and had the rest of the day to chill in our cells. We were encouraged to read a lot or study to pass the time, but a lot of the guys hated reading or couldn\u0027t read worth shit. In the intake center waiting room, my hands are shaking a little, so I shove them into my pockets as I stand and scan the security guards and security cameras and securely locked doors. I glance at the waiting cells, where you get locked up before they register you. Bad memories come flooding back. After registering as an offender here, they confiscate every single piece of clothing and personal item and keep them locked up until you\u0027re released. The strip search is next, and let me tell you, the guard who does it makes sure you\u0027re not hiding any contraband in any crevice of your body. Yates holds out a clear plastic bin. \"Empty all your pockets. I mean everything, including pens, pencils, money, wallets, and paper.\" We all do as instructed, then we\u0027re escorted through a bunch of locked doors and corridors. We come to a room where inmates meet their families and friends on visitors\u0027 day. \"We\u0027ve decided to pair you off,\" Yates says. \"You\u0027ll each be meeting with our residents one-on-one. That way, we can have shifts and you guys can share your stories in a small setting. No cussing or lewd comments are allowed. No touching the residents.\" Damon, Matt, and I all look over at Lenny, who puts his hand on his chest. \"You guys think I\u0027m lewd?\" Is he kidding me? The kid urged me to pull his finger so he could fart, he fans his sweaty ball sacks in front of us, and doesn\u0027t clean his wayward pubes off the toilet seat. If he\u0027s not lewd, God help us all. I roll my eyes. \"No comment,\" Matt says and laughs. Damon gives Lenny a sharp stare. \"Keep it appropriate, Lenny, or you\u0027ll find yourself on bathroom cleaning duty for the rest of the day.\" Lenny mocks Damon by saluting him. \"Yes, sir.\" Damon shakes his head. He\u0027s probably counting down the days until this program is over and he can kick us to the curb. Yates sits on the edge of one of the tables in the room and points to me. \"Caleb will attest to the fact that some of our residents come from broken homes and/or gangs and don\u0027t have a grounded filter when it comes to making good choices. A lot of these kids will trust you if you\u0027ve also gone through tough times like they have. They think hardships are a badge of honor.\" My hardships are a pain in my ass, not a badge of honor. And make no mistake about it, the guys locked in the DOC are far from residents. Yates makes it sound like these guys are paying rent for their living quarters. What a fucking joke. In reality, they\u0027re locked up like animals. We\u0027re each assigned a table. It\u0027s eerily quiet as the first round of inmates join us. They walk in the room with their hands behind their backs as required by the guards, their expressions blank. The familiar dark blue polyester jumpsuits take me back to the first day I was here. That suit was a constant reminder my life was not my own anymore ... while I was locked up, it was owned by the Illinois Juvenile Justice Department and the Department of Corrections. Their heads are all buzz-cut or shaved, a requirement for all new inmates. When the final person walks in the room, it\u0027s like a ghost appears right in front of me. It\u0027s Julio, my old cellmate. He\u0027s wearing an orange jump suit instead of the regular blue one, meaning he\u0027s under harsh restrictions for getting into trouble in the DOC. I haven\u0027t heard from or talked to Julio since I left this place. He was a complete ass when we were first assigned as cellmates, but after he realized I wasn\u0027t afraid of him and saw me stand toe-to-toe with gang member Dino Alvarez in the exercise yard when he cornered me, we got along just fine. Julio, tattoos on his neck peeking out of his suit, sits opposite me. \"Long time no see, amigo.\" \"How you been?\" I ask. \"Chillin\u0027 in the DOC. I get released in two weeks, if not sooner,\" he says with a grin. \"Hoo-rah. Just got to stay out of trouble.\" Not easy for a guy like Julio. Julio was the one who hooked me up with his cousin Rio. I lived with Rio until... \"Rio got busted.\" Julio shakes his head. \"I heard. Fuckin\u0027 shame. My cuz ain\u0027t gettin\u0027 out anytime soon \u0027cause he\u0027s a repeater. I\u0027m screwed too, \u0027cause I was gonna live with him. My ma moved back to Mexico with her boyfriend.\" \"I got busted too,\" I tell him. \"That\u0027s why I\u0027m on this program. It was either this, or get locked up again.\" I watch Julio lean back in his chair as the news sinks in. \"What you gonna do after you\u0027re done?\" I shrug. \"Don\u0027t know.\" Damon walks over to us. \"Sounds like a reunion, guys.\" \"Julio was my cellmate,\" I explain. \"Julio, this is Damon. He was my transition counselor.\" Julio nods to Damon and shuts up immediately. There\u0027s no way Julio is gonna be friendly or chat with anyone who works for the DOC in any way, shape, or form. Julio is a gang member with connections inside and outside this place, and he doesn\u0027t trust anyone outside of his circle. I\u0027m surprised he still trusts me, but then again we spent almost a year as cellmates and slept, ate, and shit in close quarters. Damon walks over to Matt\u0027s table. Matt is talking to a kid who looks like the typical newbie. He\u0027s scared as hell to be here but is putting on a tough front. A guard stands right by the solid metal door, a stun gun on one side of his belt and a shoot-to-kill gun on the other. I notice that one of the guards has his eyes trained on Julio. This isn\u0027t the typical juvie. This place holds bigtime offenders who just happen to be underage. Yates is on the opposite side of the room, his arms folded on his chest as he narrows his eyes at us. They\u0027re watching us like hawks like they did when I was an inmate here. Julio leans in and whispers, \"Yates thinks this shithole is the Club Med, but it sucks. I can\u0027t wait to get out of here, man. Hell, maybe I\u0027ll come visit you in Paradise. I\u0027ve always wanted to know how the hicks in the boondocks live. I hear the chicks in Paradise are easy.\" \"Some are,\" I say, thinking about my ex, Kendra, \"and some aren\u0027t,\" I add, thinking about Maggie. My thoughts turn to Maggie. She\u0027s probably freaking out meeting tough girls who eat innocent girls like her for breakfast. Yates passes our table and gives us the evil eye. What does the guy expect, that I\u0027ll slip Julio some drugs or a shovel so he can dig his way out of here? I clear my throat and lean toward Julio. \"So I\u0027m supposed to share how reckless driving has changed my life and caused pain to others. It\u0027s part of the program.\" Julio rolls his eyes and snorts. \"All right, hit me with it. \"Reckless driving changed my life and caused pain to others,\" I say, as if I\u0027m reading off a cue card. Julio grins. I\u0027m making a joke of this visit and Julio gets it. But the truth is, it\u0027s not a joke. It\u0027s reality. Suddenly, I get serious. I take a deep breath and let it out slowly. \"I guess I, um, never told you what really happened the night I was arrested.\" \"You never talked much about it.\" \"Yeah, \u0027cause I didn\u0027t do it.\" I shrug and look at my former cellmate. \"I pled guilty even though I wasn\u0027t guilty.\" Julio chuckles. \"You\u0027re shittin\u0027 me, right?\" He says it low so nobody can hear him cuss. Yates doesn\u0027t take cussing lightly, not in his jail. Luckily Warden Miller isn\u0027t here, or Julio would probably get some sort of punishment for cussing. Warden Miller takes his rules seriously and expects everyone else to. If not, you better be prepared for extra chores, early bedtime, or even solitary. I shake my head. \"Nope.\" \"Why\u0027d you plead guilty? To protect someone?\" \"Yeah,\" I whisper. \"Something like that.\" \"Wow. Can\u0027t say I\u0027d do the same thing.\" Julio looks at me sideways. \"Unless it was family. I\u0027d die for my family.\" I nod slowly. \"Me too.\" Julio nods back in complete understanding, because even though we come from totally different backgrounds, we\u0027re cut from the same cloth. He knows just by my nod that I sacrificed myself and went to jail for a family member. \"You regret it?\" he asks. I pause to think about what my life would have been like if I hadn\u0027t been arrested. \"Yeah, I do. Fucked-up thing is, I can\u0027t say I wouldn\u0027t do it again.\" \"Loyalty and honor and all that shit really screws with your head, doesn\u0027t it?\" \"Yeah.\" I wince, because images of Maggie aren\u0027t far from my thoughts. I don\u0027t want to think about her now. \"And girls really screw with your head, too.\" Julio raises an excited eyebrow. \"My boy Caleb\u0027s got a girl? Nice goin\u0027, dude. Who is she? Last I heard, you and your skanky ex broke up \u0027cause she was gettin\u0027 it on with your best friend.\" \"One more minute guys,\" Yates bellows. \"Wrap it up!\" \"I don\u0027t have a girl,\" I say, chuckling at the thought. \"Besides, the only chick I might want hates me. I never say the right thing around her. Hell, I try and push her away so I don\u0027t have to deal with the drama. And she pisses me off most of the time.\" \"Sounds like a match made in Heaven to me.\" Julio leans across the table. \"Take advice from a guy who hasn\u0027t seen a girl under twenty in over a year-the only female I\u0027ve talked to lately is the cafeteria worker, and she\u0027s so fugly I\u0027m not even sure she\u0027s female. You only live once, so take advantage of what you got when you have it.\" \"You too.\" \"I hear you loud and clear. No regrets anymore, okay? Live every day like it\u0027s your last. jComprende?\" Yates orders the inmates to line up at the door. I crack a smile. Julio is right. I\u0027ve been living every day with regret, when it should be the other way around. \"Yeah, I understand.\" \"See you on the outside, Caleb.\" He holds up two fingers. \"Peace.\" With those words, he shuffles out of the room. I\u0027m ready to live my life without regrets. I\u0027ve just got to figure out a strategy to make that happen. TWENTY Maggie \u0027m sitting across from a girl with dyed-blonde hair and dark roots. She\u0027s wearing blue sweatpants and a blue T-shirt like the other girls in jail. Ms. Bushnell assigned her to my table. The girl is staring at me as if she doesn\u0027t want to be here. \"I\u0027m Maggie,\" I tell her. \"So, Maggie, what\u0027s your story?\" she asks impatiently, totally uninterested. I tell her how I was hit by a car in a hit-and-run accident and spent a year in hospitals and rehab. Her eyes glaze over and at one point I think she might be falling asleep.","sourceLink":"https://allnovel.net/return-to-paradise-leaving-paradise-2/page-16.html","bookId":2772,"book":{"id":2772,"title":"Return to Paradise (Leaving Paradise #2)","description":"Storyline: Return to Paradise (Leaving Paradise #2) Caleb Becker left Paradise eight months ago, taking with him the secret he promised to take to his grave. If the truth got out, it would ruin everything. Maggie Armstrong tried to be strong after Caleb broke her heart and disappeared. Somehow, she managed to move on. She\u0027s determined to make a new life for herself. But then Caleb and Maggie are forced together on a summer trip. They try ignoring their passion for each other, but buried feelings resurface. Caleb must face the truth about the night of Maggie\u0027s accident, or the secret that destroyed their relationship will forever stand between them.","cover":"https://allnovel.net/images/return-to-paradise-leaving-paradise-2.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/return-to-paradise-leaving-paradise-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:16:19 PM"}}
