{"id":11607,"no":9,"title":"CHAPTER IX. THE SOLITARY FARMHOUSE.","content":"If Eben had been sensitive, the cool reception which he met with at the hands of Mr. Melville would have disturbed him. As it was, he felt angry and disappointed, and desirous of “coming up with” Herbert, as he expressed it, though it was hard to see in what way the boy had injured him. It did not seem quite clear at present how he was to punish Herbert, but he only waited for an occasion. When Herbert learned, the next morning, from Mr. Melville, in what manner Eben had tried to undermine him, and deprive him of his situation, he was naturally indignant. “I didn\u0027t think Eben Graham could be so mean,” he exclaimed. “It was certainly a mean thing to do, Herbert,” said George Melville; “but you can afford to treat young Graham with contempt, as he has been unable to do you any injury.” “What shall we do this morning, Mr. Melville?” asked Herbert. “I should like a row on the river,” said Melville. “Do you know of any boat we can have?” “Walter Ingalls has a boat; I think we can hire that.” “Do you know him?” “Yes, sir.” “Then you may go and ascertain whether we can have it, or I will go with you to avoid loss of time.” The boat was readily loaned, and the two were soon on the river. Mr. Melville first took the oars, but he was quickly fatigued, and resigned them to Herbert, who was strong and muscular for his age. As his companion observed his strong and steady strokes, he said: “Herbert, I am disposed to envy you your strength and endurance. I get tired very easily.” “Were you not strong when a boy?” asked Herbert. “I never had much endurance. My mother had a feeble constitution and was consumptive, and I inherit something of her weakness.” “It is fortunate that you have money, Mr. Melville, so that you are not obliged to work.” “True; but I would give half my fortune to be strong and well.” Herbert noticed the hectic flush upon Mr. Melville\u0027s cheeks, and his white, transparent hands, and his sympathy was aroused. “I see,” he said, thoughtfully, “that I am more fortunate than I thought in my health and strength.” “They are blessings not to be overestimated, Herbert. However, my lot is, on the whole, a happy one, even though my life will probably be brief, and I have still many sources of satisfaction and enjoyment.” The river led away from the village, flowing between wooded banks, with here and there a cottage set in the midst of the fields. Lying back in the stern, Melville enjoyed their tranquil passage, when their attention was suddenly attracted by a boy who stood on the bank, frantically waving his hat. Melville was the first to see him. “What can that boy want?” he asked. Herbert immediately looked around, and exclaimed in surprise: “It\u0027s Tom Tripp!” “Row to shore, and see what he wants,” said Melville, quickly. They were already near, and in a brief space of time they touched the bank. “What\u0027s the matter, Tom?” “There\u0027s a tramp in the house, stealing all he can lay hands on,” answered Tom, in excitement. “What house?” “Farmer Cole\u0027s.” Mr. Cole was the farmer for whom Tom Tripp was working. Tom explained that the farmer was gone to the village, leaving his wife alone. A tramp had come to the door and asked for a meal. While Mrs. Cole was getting something for him, the visitor looked about him and, finding that there was no man about, boldly demanded money, after unceremoniously possessing himself of the silver spoons. “Is he armed?” asked Melville. “I don\u0027t know; I don\u0027t think so.” “Does he know that you have gone for help?” “No; he did not see me. I came from the fields, and saw him through the window. Mrs. Cole thinks I am in the field and there is no help near.” Physical courage and physical strength do not always go together, and a weak man often excels a strong man in bravery. George Melville was thoroughly roused. For injustice or brutality he had a hearty contempt, and he was not one to stand by and see a ruffian triumph. “Come, Herbert,” he said; “let us go to the help of this poor woman.” “With all my heart,” answered Herbert, his eyes flashing. Before describing the appearance of Herbert and George Melville upon the scene, I will go back a few minutes and relate what happened at the farmhouse. Mrs. Cole was engaged in ironing when she heard a knock at the door. Answering the summons, she found herself confronted by an ill-looking fellow whose dusty and travel-soiled garments revealed the character of the wearer. “What is it you wish?” asked the farmer\u0027s wife. “I\u0027m hungry!” said the tramp. “Can you give me something to eat?” “Yes,” answered Mrs. Cole, cheerfully, for the good woman could not find it in her heart to turn away a fellow creature suffering from hunger. “We have enough and to spare. Come in, and sit down at the table.” The visitor followed her into the kitchen and took a seat at the table, while the farmer\u0027s wife went to the pantry and brought out half a loaf of bread and a plate of cold meat. The tramp was not long in attacking it, but after a few mouthfuls laid down his knife and fork. “Where\u0027s the coffee?” he asked. “I have no warm coffee,” she answered. “Don\u0027t you drink coffee in the morning?” “Yes, but breakfast was over two or three hours since. Shall I get you a glass of water?” “Haven\u0027t you any cider?” “It seems to me you are particular,” said Mrs. Cole, growing indignant. “All the same I want some cider,” said the tramp, impudently. “I have no cider,” answered Mrs. Cole, shortly. “A pretty farmhouse this is, without cider,” growled the tramp. “You can make me some coffee, then!” “Who are you to order me round in my own house?” demanded Mrs. Cole, angrily. “One would think you took this for a hotel.” “I take it for what I please,” said the tramp. “If my husband were here you wouldn\u0027t dare to talk to me like this!” It was an unguarded admission, made on the impulse of the moment, and Mrs. Cole felt its imprudence as soon as she had uttered the words, but it was too late to recall them. “Where is your husband?” asked the tramp, his face lighting up with a gleam of exultation. “Near by,” answered Mrs. Cole, evasively; but her visitor saw that this was not correct. “How much money have you in the house?” he demanded, abruptly. “Money?” gasped the farmer\u0027s wife, turning pale. “Yes, money! Didn\u0027t I speak plain enough?” asked the tramp, angrily. “Are you a thief, then?” “Don\u0027t you dare to call me a thief!” said the tramp, menacingly. “Then, if you are an honest man, why do you ask that question?” “Because I am going to borrow what money you have.” “Borrow!” “Yes,” said the man, with a grin. “I\u0027ll hand it back when I come around again.” Under ordinary circumstances there would not have been money enough in the farmhouse to be anxious about, but it so happened that Farmer Cole had sold a yoke of oxen, and the money received, a hundred dollars, was upstairs in a bureau drawer. The thought of this, though she didn\u0027t suppose the tramp to be aware of it, was enough to terrify Mrs. Cole, and she sank back in the chair in a panic. Of course the tramp inferred that there was a considerable sum in the house. “Come, hurry up!” he said, roughly, “I can\u0027t wait here all day. Where do you keep the money?” “It is my husband\u0027s,” said Mrs. Cole, terrified out of all prudence. “All right! I\u0027ll pay it back to him. While you\u0027re about it, you may collect all the spoons, too. I\u0027m going to open a boarding house,” he continued, with a chuckle, “and I shall need them.” “Oh, heavens! What shall I do?” ejaculated the frightened woman. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2962/81513.html","bookId":427,"book":{"id":427,"title":"Do and Dare A Brave Boy\u0027s Fight for Fortune","description":"简介： If we could only keep the post office, mother, we should be all right, said Herbert Carr, as he and his mother sat together in the little sitting room of the plain cottage which the two had occupied ever since he was a boy of five....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2962","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
