{"id":2827,"no":25,"title":"Chapter 25","content":"It was autumn. The summer was gone. It passed as quickly as it had come; ah, how quickly it was gone! The days were cold now. I went out shooting and fishing — sang songs in the woods. And there were days with a thick mist that came floating in from the sea, damming up everything behind a wall of murk. \n \n One such day something happened. I lost my way, blundered through into the woods of the annexe, and came to the Doctor’s house. There were visitors there — the young ladies I had met before — young people dancing, just like madcap foals. \n \n A carriage came rolling up and stopped outside the gate; Edwarda was in it. She started at sight of me. “Good-bye,” I said quietly. But the Doctor held me back. Edwarda was troubled by my presence at first, and looked down when I spoke; afterwards, she bore with me, and even went so far as to ask me a question about something or other. She was strikingly pale; the mist lay grey and cold upon her face. She did not get out of the carriage. \n \n “I have come on an errand,” she said. “I come from the parish church, and none of you were there to-day; they said you were here. I have been driving for hours to find you. We are having a little party to-morrow — the Baron is going away next week — and I have been told to invite you all. There will be dancing too. To-morrow evening.” \n \n They all bowed and thanked her. \n \n To me, she went on: \n \n “Now, don’t stay away, will you? Don’t send a note at the last minute making some excuse.” She did not say that to any of the others. A little after she drove away. \n \n I was so moved by this unexpected meeting that for a little while I was secretly mad with joy. Then I took leave of the Doctor and his guests and set off for home. How gracious she was to me, how gracious she was to me! What could I do for her in return? My hands felt helpless; a sweet cold went through my wrists. Herregud! I thought to myself, here am I with my limbs hanging helpless for joy; I cannot even clench my hands; I can only find tears in my eyes for my own helplessness. What is to be done about it? \n \n It was late in the evening when I reached home. I went round by the quay and asked a fisherman if the post-packet would not be in by to-morrow evening. Alas, no, the post-packet would not be in till some time next week. I hurried up to the hut and began looking over my best suit. I cleaned it up and made it look decent; there were holes in it here and there, and I wept and darned them. \n \n When I had finished, I lay down on the bed. This rest lasted only a moment. Then a thought struck me, and I sprang up and stood in the middle of the floor, dazed. The whole thing was just another trick! I should not have been invited if I had not happened to be there when the others were asked. And, moreover, she had given me the plainest possible hint to stay away — to send a note at the last moment, making some excuse . . . \n \n I did not sleep all that night, and when morning came I went to the woods cold, sleepless, and feverish. Ho, having a party at Sirilund! What then? I would neither go nor send any excuse. Herr Mack was a very thoughtful man; he was giving this party for the Baron; but I was not going — let them understand that! . . . \n \n The mist lay thick over valley and hills; a clammy rime gathered on my clothes and made them heavy, my face was cold and wet. Only now and then came a breath of wind to make the sleeping mists rise and fall, rise and fall. \n \n It was late in the afternoon, and getting dark; the mist hid everything from my eyes, and I had no sun to show the way. I drifted about for hours on the way home, but there was no hurry. I took the wrong road with the greatest calmness, and came upon unknown places in the woods. At last I stood my gun against a tree and consulted my compass. I marked out my way carefully and started off. It would be about eight or nine o’clock. \n \n Then something happened. \n \n After half an hour, I heard music through the fog, and a few minutes later I knew where I was: quite close to the main building at Sirilund. Had my compass misled me to the very place I was trying to avoid? A well-known voice called me — the Doctor’s. A minute later I was being led in. \n \n My gun-barrel had perhaps affected the compass and, alas, set it wrong. The same thing has happened to me since — one day this year. I do not know what to think. Then, too, it may have been fate. \n \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/1197/35995.html","bookId":112,"book":{"id":112,"title":"Pan","description":"简介： These last few days I have been thinking and thinking of the Nordland summer, with its endless day. Sitting here thinking of that, and of a hut I lived in, and of the woods behind the hut. And writing things down, by way of passing the time; to amuse...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1197","creation":"Aug 1, 2019 12:18:17 AM","modification":"Aug 1, 2019 12:18:17 AM"}}
