{"id":2805,"no":3,"title":"Chapter 3","content":"There was a stone outside my hut, a tall grey stone. It looked as if it had a sort of friendly feeling towards me; as if it noticed me when I came by, and knew me again. I liked to go round that way past the stone, when I went out in the morning; it was like leaving a good friend there, who I knew would be still waiting for me when I came back. Then up in the woods hunting, sometimes finding game, sometimes none . . . Out beyond the islands, the sea lay heavily calm. Many a time I have stood and looked at it from the hills, far up above. On a calm day, the ships seemed hardly to move at all; I could see the same sail for three days, small and white, like a gull on the water. Then, perhaps, if the wind veered round, the peaks in the distance would almost disappear, and there came a storm, the south-westerly gale; a play for me to stand and watch. All things in a seething mist. Earth and sky mingled together, the sea flung up into fantastic dancing figures of men and horses and fluttering banners on the air. I stood in the shelter of an overhanging rock, thinking many things; my soul was tense. Heaven knows, I thought to myself, what it is I am watching here, and why the sea should open before my eyes. Maybe I am seeing now the inner brain of earth, how things are at work there, boiling and foaming. ?sop was restless; now and again he would thrust up his muzzle and sniff, in a troubled way, with legs quivering uneasily; when I took no notice, he lay down between my feet and stared out to sea as I was doing. And never a cry, never a word of human voice to be heard anywhere; nothing; only the heavy rush of the wind about my head. There was a reef of rocks far out, lying all apart; when the sea raged up over it the water towered like a crazy screw; nay, like a sea-god rising wet in the air, and snorting, till hair and beard stood out like a wheel about his head. Then he plunged down into the breakers once more. And in the midst of the storm, a little coal-black steamer fighting its way in . . . When I went down to the quay in the afternoon, the little coal-black steamer had come in; it was the mail-packet. Many people had gathered on the quayside to see the rare visitor; I noticed that all without exception had blue eyes, however different they might be in other ways. A young girl with a white woolen kerchief over her head stood a little apart; she had very dark hair, and the white kerchief showed up strangely against it. She looked at me curiously, at my leather suit, my gun; when I spoke to her, she was embarrassed, and turned her head away. I said: “You should always wear a white kerchief like that; it suits you well.” Just then a burly man in an Iceland jersey came up and joined her; he called her Eva. Evidently she was his daughter. I knew the burly man; he was the local smith, the blacksmith. Only a few days back he had mended the nipple of one of my guns . . . And rain and wind did their work, and thawed away the snow. For some days a cheerless cold hovered over the earth; rotten branches snapped, and the crows gathered in flocks, complaining. But it was not for long; the sun was near, and one day it rose up behind the forest. It sends a strip of sweetness through me from head to foot when the sun comes up; I shoulder my gun with quiet delight.","sourceLink":"http://novel.tingroom.com/mingren/1197/35973.html","bookId":112,"book":{"id":112,"title":"Pan","description":"简介： These last few days I have been thinking and thinking of the Nordland summer, with its endless day. Sitting here thinking of that, and of a hut I lived in, and of the woods behind the hut. And writing things down, by way of passing the time; to amuse...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1197","creation":"Aug 1, 2019 12:18:17 AM","modification":"Aug 1, 2019 12:18:17 AM"}}
