{"id":11088,"no":22,"title":"SECTION 21.","content":"Hal was glad of this opportunity to get better acquainted with his pit-boss. Alec Stone was six feet high, and built in proportion, with arms like hams—soft with fat, yet possessed of enormous strength. He had learned his manner of handling men on a sugar-plantation in Louisiana—a fact which, when Hal heard it, explained much. Like a stage-manager who does not heed the real names of his actors, but calls them by their character-names, Stone had the habit of addressing his men by their nationalities: “You, Polack, get that rock into the car! Hey, Jap, bring them tools over here! Shut your mouth, now, Dago, and get to work, or I\u0027ll kick the breeches off you, sure as you\u0027re alive!” Hal had witnessed one occasion when there was a dispute as to whose duty it was to move timbers. There was a great two-handled cross-cut saw lying on the ground, and Stone seized it and began to wave it, like a mighty broadsword, in the face of a little Bohemian miner. “Load them timbers, Hunkie, or I\u0027ll carve you into bits!” And as the terrified man shrunk back, he followed, until his victim was flat against a wall, the weapon swinging to and fro under his nose after the fashion of “The Pit and the Pendulum.” “Carve you into pieces, Hunkie! Carve you into stew-meat!” When at last the boss stepped back, the little Bohemian leaped to load the timbers. The curious part about it to Hal was that Stone seemed to be reasonably good-natured about such proceedings. Hardly one time in a thousand did he carry out his bloodthirsty threats, and like as not he would laugh when he had finished his tirade, and the object of it would grin in turn—but without slackening his frightened efforts. After the broad-sword waving episode, seeing that Hal had been watching, the boss remarked, “That\u0027s the way you have to manage them wops.” Hal took this remark as a tribute to his American blood, and was duly flattered. He sought out the boss that evening, and found him with his feet upon the railing of his home. “Mr. Stone,” said he, “I\u0027ve something I\u0027d like to ask you.” “Fire away, kid,” said the other. “Won\u0027t you come up to the saloon and have a drink?” “Want to get something out of me, hey? You can\u0027t work me, kid!” But nevertheless he slung down his feet from the railing, and knocked the ashes out of his pipe and strolled up the street with Hal. “Mr. Stone,” said Hal, “I want to make a change.” “What\u0027s that? Got a grouch on them mules?” “No, sir, but I got a better job in sight. Mike Sikoria\u0027s buddy is laid up, and I\u0027d like to take his place, if you\u0027re willing.” “Why, that\u0027s a nigger\u0027s place, kid. Ain\u0027t you scared to take a nigger\u0027s place?” “Why, sir?” “Don\u0027t you know about hoodoos?” “What I want,” said Hal, “is the nigger\u0027s pay.” “No,” said the boss, abruptly, “you stick by them mules. I got a good stableman, and I don\u0027t want to spoil him. You stick, and by and by I\u0027ll give you a raise. You go into them pits, the first thing you know you\u0027ll get a fall of rock on your head, and the nigger\u0027s pay won\u0027t be no good to you.” They came to the saloon and entered. Hal noted that a silence fell within, and every one nodded and watched. It was pleasant to be seen going out with one\u0027s boss. O\u0027Callahan, the proprietor, came forward with his best society smile and joined them, and at Hal\u0027s invitation they ordered whiskies. “No, you stick to your job,” continued the pit-boss. “You stay by it, and when you\u0027ve learned to manage mules, I\u0027ll make a boss out of you, and let you manage men.” Some of the bystanders tittered. The pit-boss poured down his whiskey, and set the glass on the bar. “That\u0027s no joke,” said he, in a tone that every one could hear. “I learned that long ago about niggers. They\u0027d say to me, \u0027For God\u0027s sake, don\u0027t talk to our niggers like that. Some night you\u0027ll have your house set afire.\u0027 But I said, \u0027Pet a nigger, and you\u0027ve got a spoiled nigger.\u0027 I\u0027d say, \u0027Nigger, don\u0027t you give me any of your imp, or I\u0027ll kick the breeches off you.\u0027 And they knew I was a gentleman, and they stepped lively.” “Have another drink,” said Hal. The pit-boss drank, and becoming more sociable, told nigger stories. On the sugar-plantations there was a rush season, when the rule was twenty hours\u0027 work a day; when some of the niggers tried to shirk it, they would arrest them for swearing or crap-shooting, and work them as convicts, without pay. The pit-boss told how one “buck” had been brought before the justice of the peace, and the charge read, “being cross-eyed”; for which offence he had been sentenced to sixty days\u0027 hard labour. This anecdote was enjoyed by the men in the saloon—whose race-feelings seemed to be stronger than their class-feelings. When the pair went out again, it was late, and the boss was cordial. “Mr. Stone,” began Hal, “I don\u0027t want to bother you, but I\u0027d like first rate to get more pay. If you could see your way to let me have that buddy\u0027s job, I\u0027d be more than glad to divide with you.” “Divide with me?” said Stone. “How d\u0027ye mean?” Hal waited with some apprehension—for if Mike had not assured him so positively, he would have expected a swing from the pit-boss\u0027s mighty arm. “It\u0027s worth about fifteen a month more to me. I haven\u0027t any cash, but if you\u0027d be willing to charge off ten dollars from my store-account, it would be well worth my while.” They walked for a short way in silence. “Well, I\u0027ll tell you,” said the boss, at last; “that old Slovak is a kicker—one of these fellows that thinks he could run the mine if he had a chance. And if you get to listenin\u0027 to him, and think you can come to me and grumble, by God—” “That\u0027s all right, sir,” put in Hal, quickly. “I\u0027ll manage that for you—I\u0027ll shut him up. If you\u0027d like me to, I\u0027ll see what fellows he talks with, and if any of them are trying to make trouble, I\u0027ll tip you off.” “Now that\u0027s the talk,” said the boss, promptly. “You do that, and I\u0027ll keep my eye on you and give you a chance. Not that I\u0027m afraid of the old fellow—I told him last time that if I heard from him again, I\u0027d kick the breeches off him. But when you got half a thousand of this foreign scum, some of them Anarchists, and some of them Bulgars and Montynegroes that\u0027s been fightin\u0027 each other at home—” “I understand,” said Hal. “You have to watch \u0027em.” “That\u0027s it,” said the pit-boss. “And by the way, when you tell the store-clerk about that fifteen dollars, just say you lost it at poker.” “I said ten dollars,” put in Hal, quickly. “Yes, I know,” responded the other. “But I said fifteen!”","sourceLink":"http://novel.tingroom.com/duanpian/3238/88704.html","bookId":649,"book":{"id":649,"title":"King Coal","description":"简介： Upton Sinclair is one of the not too many writers who have consecrated their lives to the agitation for social justice, and who have also enrolled their art in the service of a set purpose. A great and non-temporizing enthusiast, he never flinched fr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3238","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
