{"id":11103,"no":37,"title":"SECTION 7.","content":"Hal did not look back, but turned into the company-store. “North Valley Trading Company” read the sign over the door; within was a Serbian woman pointing out what she wanted to buy, and two little Lithuanian girls watching the weighing of a pound of sugar. Hal strolled up to the person who was doing the weighing, a middle-aged man with a yellow moustache stained with tobacco-juice. “Morning, Judge.” “Huh!” was the reply from Silas Adams, justice of the peace in the town of North Valley. “Judge,” said Hal, “what do you think about the election?” “I don\u0027t think about it,” said the other. “Busy weighin\u0027 sugar.” “Anybody round here going to vote for MacDougall?” “They better not tell me if they are!” “What?” smiled Hal. “In this free American republic?” “In this part of the free American republic a man is free to dig coal, but not to vote for a skunk like MacDougall.” Then, having tied up the sugar, the “J. P.” whittled off a fresh chew from his plug, and turned to Hal. “What\u0027ll you have?” Hal purchased half a pound of dried peaches, so that he might have an excuse to loiter, and be able to keep time with the jaws of the Judge. While the order was being filled, he seated himself upon the counter. “You know,” said he, “I used to work in a grocery.” “That so? Where at?” “Peterson \u0026 Co., in American City.” Hal had told this so often that he had begun to believe it. “Pay pretty good up there?” “Yes, pretty fair.” Then, realising that he had no idea what would constitute good pay in a grocery, Hal added, quickly, “Got a bad wrist here!” “That so?” said the other. He did not show much sociability; but Hal persisted, refusing to believe that any one in a country store would miss an opening to discuss politics, even with a miner\u0027s helper. “Tell me,” said he, “just what is the matter with MacDougall?” “The matter with him,” said the Judge, “is that the company\u0027s against him.” He looked hard at the young miner. “You meddlin\u0027 in politics?” he growled. But the young miner\u0027s gay brown eyes showed only appreciation of the earlier response; so the “J. P.” was tempted into specifying the would-be congressman\u0027s vices. Thus conversation started; and pretty soon the others in the store joined in—“Bob” Johnson, bookkeeper and post-master, and “Jake” Predovich, the Galician Jew who was a member of the local school-board, and knew the words for staple groceries in fifteen languages. Hal listened to an exposition of the crimes of the political opposition in Pedro County. Their candidate, MacDougall, had come to the state as a “tin-horn gambler,” yet now he was going around making speeches in churches, and talking about the moral sentiment of the community. “And him with a district chairman keeping three families in Pedro!” declared Si Adams. “Well,” ventured Hal, “if what I hear is true, the Republican chairman isn\u0027t a plaster saint. They say he was drunk at the convention—” “Maybe so,” said the “J. P.” “But we ain\u0027t playin\u0027 for the prohibition vote; and we ain\u0027t playin\u0027 for the labour vote—tryin\u0027 to stir up the riff-raff in these coal-camps, promisin\u0027 \u0027em high wages an\u0027 short hours. Don\u0027t he know he can\u0027t get it for \u0027em? But he figgers he\u0027ll go off to Washington and leave us here to deal with the mess he\u0027s stirred up!” “Don\u0027t you fret,” put in Bob Johnson—“he ain\u0027t goin\u0027 to no Washin\u0027ton.” The other two agreed, and Hal ventured again, “He says you stuff the ballot-boxes.” “What do you suppose his crowd is doin\u0027 in the cities? We got to meet \u0027em some way, ain\u0027t we?” “Oh, I see,” said Hal, na?vely. “You stuff them worse!” “Sometimes we stuff the boxes, and sometimes we stuff the voters.” There was an appreciative titter from the others, and the “J. P.” was moved to reminiscence. “Two years ago I was election clerk, over to Sheridan, and we found we\u0027d let \u0027em get ahead of us—they had carried the whole state. \u0027By God,\u0027 said Alf. Raymond, \u0027we\u0027ll show \u0027em a trick from the coal-counties! And there won\u0027t be no recount business either!\u0027 So we held back our returns till the rest had come in, and when we seen how many votes we needed, we wrote \u0027em down. And that settled it.” “That seems a simple method,” remarked Hal. “They\u0027ll have to get up early to beat Alf.” “You bet you!” said Si, with the complacency of one of the gang. “They call this county the \u0027Empire of Raymond.\u0027” “It must be a cinch,” said Hal—“being the sheriff, and having the naming of so many deputies as they need in these coal-camps!” “Yes,” agreed the other. “And there\u0027s his wholesale liquor business, too. If you want a license in Pedro county, you not only vote for Alf, but you pay your bills on time!” “Must be a fortune in that!” remarked Hal; and the Judge, the Post-master and the School-commissioner appeared like children listening to a story of a feast. “You bet you!” “I suppose it takes money to run politics in this county,” Hal added. “Well, Alf don\u0027t put none of it up, you can bet! That\u0027s the company\u0027s job.” This from the Judge; and the School-commissioner added, “De coin in dese camps is beer.” “Oh, I see!” laughed Hal. “The companies buy Alf\u0027s beer, and use it to get him votes!” “Sure thing!” said the Post-master. At this moment he happened to reach into his pocket for a cigar, and Hal observed a silver shield on the breast of his waistcoat. “That a deputy\u0027s badge?” he inquired, and then turned to examine the School-commissioner\u0027s costume. “Where\u0027s yours?” “I git mine ven election comes,” said Jake, with a grin. “And yours, Judge?” “I\u0027m a justice of the peace, young feller,” said Silas, with dignity. Leaning round, and observing a bulge on the right hip of the School-commissioner, Hal put out his hand towards it. Instinctively the other moved his hand to the spot. Hal turned to the Post-master. “Yours?” he asked. “Mine\u0027s under the counter,” grinned Bob. “And yours, Judge?” “Mine\u0027s in the desk,” said the Judge. Hal drew a breath. “Gee!” said he. “It\u0027s like a steel trap!” He managed to keep the laugh on his face, but within he was conscious of other feelings than those of amusement. He was losing that “first fine careless rapture” with which he had set out to run with the hare and the hounds in North Valley! \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3238/88719.html","bookId":649,"book":{"id":649,"title":"King Coal","description":"简介： Upton Sinclair is one of the not too many writers who have consecrated their lives to the agitation for social justice, and who have also enrolled their art in the service of a set purpose. A great and non-temporizing enthusiast, he never flinched fr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3238","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
