{"id":21246,"no":8,"title":"THE PERT LITTLE HAT","content":"HEMMING had a home, and dearly he loved everything in it—with one exception. He loved the furnace, and the kitchen range with its warm ruddy glow, and the violet-coloured wafer of expensive aromatic soap that always mysteriously appeared on the marble wash-basin when visitors came. He loved the little glass towel racks, and the miniature embroidered hand towels with Mrs. Hemming\u0027s maiden initials on them, which also appeared, white and fragrant, whenever there was any special festivity. Those little towels were to him a kind of symbol of the first ecstatic days of their married life, and he could not bear to think of the inevitable time when they would be frayed and discarded. He loved the shelf over the fireplace where his brown-stained corncob pipe waited for the after-supper smoke. He loved the little porch where the baby carriage stood, and the tulip beds that he and Janet had planted together, and the mission dining table, now blistered and scarred, that had been their very first piece of furniture. But in the little den upstairs stood his desk, and how he hated it! Hemming, you see, had literary ambitions, and that desk meant to him every circumstance, every long-drawn torment, of weariness and toil. It had meant much pleasure, too, in hours when his writing had prospered; but how the bitter outnumbered the sweet! How many hundred evenings he had dragged himself to it, in lassitude and lethargy; had forced his drowsy, unwilling mind to the task at hand. How many nights, nodding over the typewriter, he had stumbled on and on. Over his desk he kept, ironically, a letter he had once had from an editor, which said: We like stories. They have a joyous freshness. You write as though you enjoyed it. Hemming was no quick and easy composer. His stories emerged slowly, painfully, hammered and wrenched from the stubborn tissues of a weary brain. When his whole soul and body cried out for a comfortable stretch on the couch, with pipe and book, and a gradual, blissful lapse into slumber, he would throw off his coat, stick his head out of the window for a dozen gulps of cool night air, and then sit down at the wheezy old typewriter. Its yellow keys seemed a kind of doleful rosary on which he told long petitions to whatever gods look down pityingly on young writers. He would think how wonderful it would be if he could only do his writing in the morning when he was fresh. To leap out of bed in the crisp early air, to plunge into the cold bath where the water shimmered a pale green by catching the tint of the big maple tree just outside the bathroom, to swallow two cups of hot coffee, two slices of buttered toast, and then sit down to his desk. In the zest and lustihood of the morning, how the thoughts would throng, how the great empire of words would unroll before him, far away to the blue hills where lived his unwritten poems! Such was his daily thought as he hurried down the hill on bright mornings to catch the 8.13 train to town. But to come back at night after a long day at the office, and after helping Janet wash the dishes, and stoking the furnace or mowing the lawn or planting bulbs in the garden—then to try to write seemed tough indeed. Still, it had to be done, and Hemming threw his manhood into the task. In his little den there was just space for a couch, his desk, and his books, which were littered about the room. His only chance of accomplishing anything was to get Janet safely installed on the couch, for if he once lay down there work was impossible. She would curl up under a steamer rug, tired out from a long day with the house and the baby, reading a book or the evening paper. And then the stumbling clatter of the typewriter would begin. After a while there always came what they humorously called “the pathetic little moment.” This was the time when Janet\u0027s book or paper would slip from her hand, she would turn away from the light, and coast down the long, smooth toboggan of sleep. Then Hemming would switch off the reading lamp above her head (with the secret economic satisfaction young householders always feel when they switch off a light), touch the soft cheek with a friendly finger, and climb the keys once more. His writing always seemed to go better after the “pathetic little moment” was past. There was a kind of subconscious satisfaction in the feeling that Janet was there, asleep, and that he was working for her. And Janet used to affirm that there was no lullaby like the irregular thumping of those keys and levers. There was another catchword they had, which also moved stealthily in the back passages of his mind as he mulled over his manuscripts. Janet badly needed a new bonnet—a “pert little hat,” she liked to call it—and Hemming had pledged himself to write something that would bring her the saucy little ornament she craved in time for Christmas. She was a slender, bright-faced creature, and no one could wear an innocently tilted turban with more grace. But these had been hard days for small incomes. Winter coal, and warm clothes for the Urchin, and the cook\u0027s wages (when they had one), and Liberty Bonds—all these had taken precedence over the pert little hat. It had been talked of so long, it had become a kind of joyous legend, which Janet hardly expected to see realized on her head. She used to say wistfully, as she coasted off to sleep on the couch: “Would it be unpatriotic to think about the pert little hat?” And her husband would vow that patriotism that excluded pert little hats was no patriotism at all. So he had sworn that the bonnet should be millinered on the clacking loom of his typewriter. They used to laugh about it, and say that the little hat ought to be trimmed with carbon typewriter ribbons. But Hemming did not know that Janet was not always asleep after the so-called “pathetic moment” when she ostensibly gave up the struggle with drowsiness. The twanging springs of the old couch made less noise than the typewriter keys, but they, too, moved to a secret creative refrain. There were times when Janet lay watching the lamplight on the rows of books, and little pictures of stories that she would like to write flashed into her head. They often used to come to her at inopportune periods during the day, when the Urchin was in his bath or when she was taking stock of the ice-box. Of course her husband was the literary man of the family, and she had no thought of setting up her simple imaginings against his more serious efforts. But one night, when he was engrossed in some intractable plot, Janet slipped away into the little guest room and shut herself in. With a stub pencil, on odd sheets of notepaper, she began scribbling hotly. Two hours later, when Hemming came back to earth and hunted her out, she was still at it. “What on earth are you up to, monk?” he asked. “Making out laundry lists,” she said. More observant husbands might have wondered what occasion there would be for a laundry list on Thursday evening, but Hemming was always drowned in his dreams of literary fame. His story, on which he had laboured at night for two months, and hers, which had taken the spare hours of three days, were finished almost at the same time. After dinner one night, when he had read the manuscript of his story aloud, Janet handed him her venture, with some trepidation. At first he seemed a little nettled that she should have done such a thing. “Look here, monk,” he said, “you oughtn\u0027t to wear yourself out trying to write. You have quite enough to do with the house and the baby. Moreover, you don\u0027t know how discouraging it is. It takes years of patient apprenticeship before one can get anything across with the editors. This is my job, brownie.” “But I enjoyed doing it,” she said. “That\u0027s a bad sign. All really good stories take fearful effort. How long did you spend on this?” “Oh, quite a while,” she said, vaguely. She did not like to admit that her little story had involved no “patient apprenticeship.” He lit his pipe and began reading the sheets on which her quick pencil had flashed with such enthusiasm. She sat with her sewing, watching him shyly. “Very nice,” was his comment; but privately he wondered how he was to avoid hurting her feelings. It seemed to him that the story had all the faults of the amateur. “Would you submit it anywhere?” she asked, eagerly. “Do you think any magazine would buy it?” He evaded the question. “Would you like me to type it for you?” he said. “Oh, would you?” “I\u0027ll tell you what I\u0027ll do,” he said, “I\u0027ll be sending my manuscript to Mr. Edwards to-morrow. I\u0027ll type yours and send it, too.” Janet was delighted, and she fell asleep that night with the sweet music of the thumping keys in her ears. As she heard the staccato clicking, she thought: “I wonder how far he has got now? How good of him to take all that trouble to copy my poor little story.” Hemming sat up very late that night, copying Janet\u0027s manuscript and planning what to say to Mr. Edwards, the editor of the Colonial Magazine, who had been very cordial to him. He resisted the temptation to alter Janet\u0027s na?ve phrasing here and there, to improve her technique by recasting some of the situations in her story. It was long past midnight when both manuscripts were ready to go into the stout manila envelope. Then, after some meditation, Hemming added the following note: Dear Mr. Edwards: I am sending you herewith my new story, and hope you may like it. I am also enclosing a manuscript from my wife. Of course she is an untrained writer—this is her first attempt—but I think her story has a certain charm. Won\u0027t you, if you can, give her any encouragement you feel proper? If you would write her a personal note of comment it would mean a great deal to her. You know how tenderly one feels toward one\u0027s maiden effort. Sincerely yours, Godfrey Hemming. It was very late when Hemming folded the carefully typed sheets and placed them in the precious envelope. He was utterly weary, which must be the explanation of a curious error he made. It was his custom to type his name and address on a separate sheet of paper which was clipped to the story he was submitting. He put his own name on one sheet, and his wife\u0027s on another. But in arranging the manuscripts for the envelope he inadvertently put his name-page with his wife\u0027s manuscript, and vice versa. Then he went to bed with the satisfaction of well-earned fatigue, and wondering how soon he would be able to order the “pert little hat”. It was two weeks later, and the Urchin had just murmured himself off into his morning nap, when Janet heard the postman\u0027s whistle, and ran down to receive an envelope with the name of the Colonial Magazine engraved upon it. Eagerly she tore it open. My Dear Mrs. Hemming: Your husband was good enough to send me the manuscript of your story, which I have read with interest. It is an able piece of work, and shows unusual technical skill for a beginner. But I must caution you not to let your pen follow the track of your husband\u0027s method too closely. Naturally enough, perhaps, your style seems to have modeled itself on his: but this is a mistake, because it is quite evident that you have ability enough to strike out on your own line. I wish you would study carefully Mr. Hemming\u0027s last story, “Three Is Company,” which shows a freshness and spontaneous originality better than anything he has done before. It has a touch of charming humour which is new to his work. If you can do us something of that sort, we shall be only too happy to publish it. I am returning your manuscript with many thanks. Faithfully yours Theodore Edwards. Janet looked at the editor\u0027s flowing signature in amazement. “Three Is Company” was her own story. And there, in the Colonial Magazine\u0027s envelope, lay the revered pages of Godfrey\u0027s masterpiece, returned. The “fresh and spontaneous originality” was hers! A flush of exultation thrilled her: she could almost feel the pert little hat on her head. Instinctively she looked at herself in the mirror over the hall mantelpiece. Was it possible that she was a literary genius, and had never known it? But then a pang of horror chilled her. What dreadful mistake had happened? Alas, it was only too plain—the two stories had been confused. The editor had thought that her story was Godfrey\u0027s. He had read it expecting to find the skill of Godfrey\u0027s trained hand. And now how was she to spare her husband the mortification of having his painstaking work rejected, while her prentice sketch had won favour by some fluke? Her loyal heart, entirely devoid of selfish satisfaction, could not bear the thought of this grotesque and unhappy climax for her innocent venture. It was all her fault for meddling with what did not concern her. What business had she to write a better story than Godfrey, anyway? She knew that her husband would be honestly proud of her success and would not grudge her the triumph for an instant, but she felt that the poignance of the situation would be intolerable for her. Much better do without all the pert little hats on Chestnut Street than win one at the expense of Godfrey\u0027s feelings. How could she prevent the bad tidings from reaching him? Even now it might be too late. She flew to the telephone, and with pricking pulses asked for the office of the Colonial. One nervous hand unconsciously flew to her hair, as though she were about to enter the august sanctum of the editor. “Is this Mr. Edwards? “Oh, Mr. Edwards, this is Mrs. Hemming, Mrs. Godfrey Hemming, the wife of one of your authors—— “Why, there\u0027s been a terrible mistake about our manuscripts, Mr. Edwards, the stories that Mr. Hemming sent you. I\u0027ve just had your letter, and that story you sent back wasn\u0027t mine at all, it was Godfrey\u0027s—— “I don\u0027t see how you can have made the mistake— “Yes, the story called \u0027Three Is Company\u0027 is mine, I wrote it, but really it can\u0027t possibly be better than the other one because I wrote it in such a hurry, it\u0027s my first attempt—— “You want to publish it? But, Mr. Edwards, you simply mustn\u0027t, because—— “I can\u0027t explain over the telephone. I know you only like it because you thought—— “Will you promise not to do anything about it, and not to tell Mr. Hemming anything, until you get a letter from me? “You will promise? Oh, thank you so much! I\u0027ll write at once. “Good-bye!” She hurried to the little white enamelled desk, the same desk where the ill-starred “Three Is Company” had been written. “This will cure me of trying to write,” she thought; “why, I never heard of such a thing—to have one\u0027s first story accepted! Mr. Edwards must be mad.” Luckily there was one sheet of her engraved stationery left—the paper that Godfrey had given her, she thought remorsefully. All about her were evidences of his loving care, and she had repaid him by undermining his prestige with the one editor who had been nice to him. A fine way for an author\u0027s wife to behave! She seized her pen and wrote: Dear Mr. Edwards: As I just told you over the phone, there has been some horrible mistake. How it happened I can\u0027t guess. The manuscript you sent back to me is Mr. Hemming\u0027s story. The one you say you like and want me to study as a model is my own story, “Three Is Company”. I\u0027m sorry you like it, I mean I\u0027m sorry you think it is better than Mr. Hemming\u0027s story, which can\u0027t be so as it is the first story I ever tried to write. I have decided to withdraw it, I don\u0027t want it published, so please send it back to me instantly, and write me a letter saying how amateurish it is. I am sending Mr. Hemming\u0027s story back to you, so that now you know who wrote it you can reconsider it. Of course, if you thought it was by me, you naturally considered it as the work of a beginner, and only a poor imitation of Mr. Hemming\u0027s style. I don\u0027t want you ever to tell Mr. Hemming that I have written this letter. Just tell him you sent my story back to me because it was not good enough. Sincerely yours, Janet Colton Hemming. The importance Janet attached to this letter may be judged from the fact that she left the baby alone in the house, asleep, while she hurried down to the post-office to mail it, together with Godfrey\u0027s manuscript, back to Mr. Edwards. And not even the sympathetic Mr. Edwards ever guessed that on the first page, where Godfrey\u0027s careful typing ran in neat lines, she had printed a good luck kiss. The editor was an honourable man, and though he chuckled a little over Janet\u0027s breathless letter he really meant to keep the innocent secret. We hope that no young wives will be lured to destruction by our telling the truth, which was simply this, that Janet\u0027s little story was much better than Godfrey\u0027s. It might not have happened again in a lifetime, but the enthusiasm of her girlish zeal had carried her pen into a very pretty and moving tale, which the Colonial would have been glad to print. But since she wanted it back, there was nothing for Mr. Edwards to do but comply. Then, that very morning, while he was dictating a note of polite refusal to accompany “Three Is Company” back to the suburbs, who should call at the office but Godfrey, to know what the editor thought of the two stories. The coincidence was too much for Edwards, and thinking that it could do no harm to let Hemming know of his wife\u0027s devotion—for young husbands are too likely to be selfish—he told him the whole incident. And Godfrey, with a faint sensation of burning under his eyelids, related the dream of a new bonnet that had inspired “Three Is Company”. “Well, now, look here,” said Edwards, “I\u0027m not so awfully keen on this story of yours. It isn\u0027t anywhere near up to what you can do—or rather, up to what Mrs. Hemming can do,” he added, chuckling. “But you go home and write me a yarn about the pert little hat, and I\u0027ll put it in the January number. It\u0027ll come out just before Christmas, and I hope you\u0027ll get that wife of yours the best bonnet in town on the proceeds. If all writers had wives like yours, perhaps the magazines would make better reading. But for heaven\u0027s sake don\u0027t tell Mrs. Hemming I gave her away. Wait until she sees the story in the magazine, it\u0027ll be a Christmas surprise for her.” On the Saturday before Christmas Hemming took Janet to the city to solemnize the purchase of the pert little hat. Any one who happened to see her wearing it down Chestnut Street that bright winter afternoon knew that the elated pink in her cheek was not all reflected from the red bow on the bonnet\u0027s neat brim. As they sat down for a matinée and Janet removed the precious creation, giving it to Godfrey to hold for a moment, he said admiringly: “Well, the old typing bus isn\u0027t such a bad milliner after all, hey, monk?” And Janet, who would then have denied that such a story as “Three Is Company” ever existed, replied innocently: “I\u0027m so glad Mr. Edwards turned down my story, grump. I like the pert little hat ever so much better because it came all from you.” Even if the pert little hat should live to be a great-great-grandbonnet, none of its descendants will ever give Janet such pleasure. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3206/87627.html","bookId":757,"book":{"id":757,"title":"Tales From a Rolltop Desk","description":"简介： LESTER VALIANT came back from Oxford with the degree of B. Litt., some unpaid tailors\u0027 bills, and the conviction that the world owed him a living because he had been suffered within the sacred precincts of Balliol College for three years....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3206","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
