{"id":101290,"no":12,"title":"Page 12","content":"I SIMPLY COULDN\u0027T PROCESS WHAT HAD JUST HAPPENED ; it didn\u0027t jibe with my inner picture of myself or how I behaved. I could only think, You had to be there. And even then that didn\u0027t sound convincing.\\n\\n Okay, Sookie, I said to myself. What else could you have done? It wasn\u0027t the time to do a lot of detailed thinking, but a quick scan of my options came up zero. I couldn\u0027t have fought off Andre or persuaded him to leave me alone. Eric could have fought Andre, but he chose not to because he wanted to keep his place in the Louisiana hierarchy, and also because he might have lost. Even if he\u0027d chanced to win, the penalty would have been incredibly heavy. Vampires didn\u0027t fight over humans.\\n\\n Likewise, I could have chosen to die rather than submit to the blood exchange, but I wasn\u0027t quite sure how I would have achieved that, and I was quite sure I didn\u0027t want to.\\n\\n There was simply nothing I could have done, at least nothing that popped to my mind as I squatted there in the beigeness of the back stairway.\\n\\n I shook myself, blotted my face with a tissue from my pocket, and smoothed my hair. I stood up straighter. I was on the right track to regaining my self-image. I would have to save the rest for later.\\n\\n I pushed open the metal door and stepped into a cavernous area floored with concrete. As I\u0027d progressed farther into the working area of the hotel (beginning with the first plain beige corridor), the decor had scaled back to minimal. This area was absolutely functional.\\n\\n No one paid the least attention to me, so I had a good look around. It\u0027s not like I was anxious to hurry back to the queen, right? Across the floor, there was a huge industrial elevator. This hotel had been designed with as few openings onto the outside world as possible, to minimize the chance of intrusion, both of humans and the enemy sun. But the hotel had to have at least one large dock to load and unload coffins and supplies. This was the elevator that served that dock. The coffins entered here before they were taken to their designated rooms. Two uniformed men armed with shotguns stood facing the elevator, but I have to say that they looked remarkably bored, not at all like the alert watchdogs in the lobby.\\n\\n In an area by the far wall, to the left of the huge elevator, some suitcases were slumped together in a forlorn sort of suitcase corral, an area delineated by those posts that contain retractable strips that are used to direct crowds in airports. No one appeared to be in charge of them, so I walked over - and it was a long walk - and began reading labels. There was already another lackey like me searching through the luggage, a young man with glasses and wearing a business suit.\\n\\n \"What are you looking for?\" I asked. \"If I see it while I\u0027m looking, I can pull it out for you.\"\\n\\n \"Good idea. The desk called to say we had a suitcase down here that hadn\u0027t made it to the room, so here I am. The tag should say \u0027Phoebe Golden, Queen of Iowa\u0027 or something like that. You?\"\\n\\n \"Sophie-Anne Leclerq, Louisiana.\"\\n\\n \"Wow, you work for her? Did she do it?\"\\n\\n \"Nope, and I know because I was there,\" I said, and his curious face got even more curious. But he could tell I wasn\u0027t going to say any more about it, and he resumed looking.\\n\\n I was surprised at the number of suitcases in the corral.\\n\\n \"How come,\" I asked the young man, \"they can\u0027t just bring these up and leave them in the rooms? Like the rest of the luggage?\"\\n\\n He shrugged. \"I was told it\u0027s some kind of liability issue. We have to identify our suitcases personally, so they can say we were the ones who picked them out. Hey, this is the one I want,\" he said after a moment. \"I can\u0027t read the name of the owner, but it does say Iowa, so it must belong to someone in our group. Well, bye, nice to talk to you.\" He set off briskly with a black rolling bag.\\n\\n Immediately after that, I hit luggage pay dirt. A blue leather suitcase was tagged with \"Sheriff, Area\" - well, that was too scribbled to make out. The vampires used all kinds of scripts, depending on the education they\u0027d had in the age they were born. \"Louisiana\": the label did say that. I picked up the old suitcase and lifted it over the barrier. The writing wasn\u0027t any clearer closer to my eyes. Like my opposite number in Iowa, I decided the best course would be to take it upstairs and show it around until someone claimed it.\\n\\n One of the armed guards had turned halfway from his post to figure out what I was doing. \"Where you going with that, beautiful?\" he called.\\n\\n \"I work for the Queen of Louisiana. She sent me down to get it,\" I said.\\n\\n \"Your name?\"\\n\\n \"Sookie Stackhouse.\"\\n\\n \"Hey, Joe!\" he called to a fellow employee, a heavy guy who was sitting behind a really ugly desk on which sat a battered computer. \"Check out the name Stackhouse, will ya?\"\\n\\n \"Sure thing,\" Joe said, wrenching his gaze from the young Iowan, who was just barely visible over on the other side of the cavernous space. Joe regarded me with the same curiosity. When he saw that I\u0027d noticed, he looked guilty and tapped away at the keyboard. He eyed the computer screen like it could tell him everything he needed to know, and for the purposes of his job, maybe he was right.\\n\\n \"Okay,\" Joe called to the guard. \"She\u0027s on the list.\" His was the gruff voice that I remembered from the phone conversation. He resumed staring at me, and though all the other people in the cavernous space were having blank, neutral thoughts, Joe\u0027s were not blank. They were shielded. I\u0027d never encountered anything like it. Someone had put a metaphysical helmet on his head. I tried to get through it, around, under it, but it stayed in place. While I fumbled around, trying to get inside his thoughts, Joe was looking at me with a cross expression. I don\u0027t think he knew what I was doing. I think he was a grouch.\\n\\n \"Excuse me,\" I asked, calling so my question could reach Joe\u0027s ears. \"Is my picture by my name on your list?\"\\n\\n \"No,\" he said, snorting as if I\u0027d asked a strange question. \"We got a list of all the guests and who they brought with them.\"\\n\\n \"So, how do you know I\u0027m me?\"\\n\\n \"Huh?\"\\n\\n \"How do you know I\u0027m Sookie Stackhouse?\"\\n\\n \"Aren\u0027t you?\"\\n\\n \"Yeah.\"\\n\\n \"Then what you bitching about? Get outta here with the damn suitcase.\" Joe looked down at his computer, and the guard swung around to face the elevator. This must be the legendary Yankee rudeness, I thought.\\n\\n The bag didn\u0027t have a roller mechanism; no telling how long the owner had had it. I picked it up and marched back over to the door to the stairs. There was another elevator close to the door, I noticed, but it wasn\u0027t half as large as the huge one that had access to the outside. It could take up coffins, true, but perhaps only one at a time.\\n\\n I\u0027d already opened the stair door when I realized that if I went up that way I\u0027d have to pass through the service corridor again. What if Eric, Andre, and Quinn were still there? What if they\u0027d ripped each other\u0027s throats out? Though just at the moment such a scenario wouldn\u0027t have devastated me, I decided to forgo the chance of an encounter. I took the elevator instead. Okay, cowardly, but a woman can handle only so much in one night.\\n\\n This elevator was definitely for the peons. It had pads on the walls to prevent cargo from being damaged. It serviced only the first four floors: basement levels, lobby, mezzanine, human floor. After that, the shape of the pyramid dictated that to rise, you had to go to the center to catch one of elevators that went all the way up. This would make taking the coffins around a slow process, I thought. The staff of the Pyramid worked hard for their money.\\n\\n I decided to take the suitcase straight to the queen\u0027s suite. I didn\u0027t know what else to do with it.\\n\\n When I stepped off at Sophie-Anne\u0027s floor, the lobby area around the elevator was silent and empty. Probably all the vampires and their attendants were downstairs at the soiree. Someone had left a discarded soda can lying in a large, boldly patterned urn holding some kind of small tree. The urn was positioned against the wall between the two elevators. I think the tree was supposed to be some kind of short palm tree, to maintain the Egyptian theme. The stupid soda can bothered me. Of course, there were maintenance people in the hotel whose job it was to keep everything clean, but the habit of picking up was ingrained in me. I\u0027m no neat freak, but still. This was a nice place, and some idiot was strewing garbage around. I bent over to pick the darn thing up with my free right hand, intending to toss it into the first available garbage can.\\n\\n But it was a lot heavier than it should have been.\\n\\n I set down the suitcase to look at the can closely, cradling it in both my hands. The colors and the design made the cylinder look like a Dr Pepper can in almost every respect, but it just wasn\u0027t. The elevator doors whooshed open again, and Batanya stepped off, a strange-looking gun in one hand, a sword in the other. Looking over the bodyguard\u0027s shoulder into the elevator car, I saw the King of Kentucky, who looked back at me curiously.\\n\\n Batanya seemed a bit surprised to see me standing there, smack-dab in front of the door. She scanned the area, then pointed her gunlike weapon carefully at the floor. The sword remained ready in her left hand. \"Could you step to my left?\" she asked very courteously. \"The king wants to visit in that room.\" Her head nodded toward one of the rooms to the right.\\n\\n I didn\u0027t move, couldn\u0027t think of what to say.\\n\\n She took in the way I was standing and the expression on my face. She said in a sympathetic way, \"I don\u0027t know why you people drink those carbonated things. They give me gas, too.\"\\n\\n \"It\u0027s not that.\"\\n\\n \"Is something wrong?\"\\n\\n \"This isn\u0027t an empty can,\" I said.\\n\\n Batanya\u0027s face froze. \"What do you think it is?\" she asked very, very calmly. That was the voice of Big Trouble.\\n\\n \"It might be a spy camera,\" I said hopefully. \"Or, see, I\u0027m thinking it might be a bomb. Because it\u0027s not a real can. It\u0027s full of something heavy, and that heaviness is not fluid.\" Not only was the tab top not on the can, but the innards didn\u0027t slosh.\\n\\n \"I understand,\" Batanya said. Again with the calm. She pressed a little panel on the armor over her chest, a dark blue area about the size of a credit card. \"Clovache,\" she said. \"Unknown device on four. I\u0027m bringing the king back down.\"\\n\\n Clovache\u0027s voice said, \"How large is the device?\" Her accent was sort of like Russian, at least to my untravelled ears. (\"Hau larch...?\")\\n\\n \"The size of one of those cans of sweetened syrup,\" Batanya answered.\\n\\n \"Ah, the burping drinks,\" Clovache said. Good memory, Clovache, I thought.\\n\\n \"Yes. The Stackhouse girl noticed it, not me,\" Batanya said grimly. \"And now she is standing with it in her hand.\"\\n\\n \"Tell her to put it down,\" advised the invisible Clovache with the simplicity of one who was stating an obvious fact.\\n\\n Behind Batanya, the King of Kentucky was beginning to look very nervous. Batanya glanced over her shoulder at him. \"Get a bomb team up here from the local policing unit,\" Batanya said to Clovache. \"I\u0027m bringing the king back down.\"\\n\\n \"The tiger is here, too,\" Clovache said. \"She is his woman.\"\\n\\n Before I could say, \"For God\u0027s sake, don\u0027t send him up,\" Batanya pressed the rectangle again, and it went dark.\\n\\n \"I have to protect the king,\" Batanya said with an apology in her voice. She stepped back into the elevator, punched a button, and gave me a nod.\\n\\n Nothing had scared me as much as that nod. It was a good-bye look. And the door swooshed shut.\\n\\n There I stood, alone on the silent hotel floor, holding an instrument of death. Maybe.\\n\\n Neither of the elevators gave any signs of life. No one came out of the doors on the fourth floor, and no one went into them. The stair door didn\u0027t budge. There was a long, dead time in which I did nothing but stand and hold a fake Dr Pepper can. I did a little breathing, too, but nothing too violent.\\n\\n With an explosion of sound that startled me so much I nearly dropped the can, Quinn burst onto the floor. He\u0027d taken the stairs in a huge hurry if his breathing was any indication. I couldn\u0027t spare the brainpower to find out what was going on in his head, but his face was showing nothing but the same kind of calm mask that Batanya wore. Todd Donati, the security guy, was right on Quinn\u0027s heels. They stopped dead about four feet away from me.\\n\\n \"The bomb squad is coming,\" Donati said, leading off with the good news.\\n\\n \"Put it down where it was, babe,\" Quinn said.\\n\\n \"Oh, yeah, I want to put it back where it was,\" I said. \"I\u0027m just scared to.\" I hadn\u0027t moved a muscle in what felt like a million years, and I was becoming tired already. But still I stood looking down at the can I was holding in both hands. I promised myself I would never drink another Dr Pepper as long as I lived, and I\u0027d been real fond of them before tonight.\\n\\n \"Okay,\" Quinn said, holding out his hand. \"Give it to me.\"\\n\\n I\u0027d never wanted to do anything more in my life.\\n\\n \"Not till we know what it is,\" I said. \"Maybe it\u0027s a camera. Maybe some tabloid is trying to get insider shots of the big vampire summit.\" I tried to smile. \"Maybe it\u0027s a little computer, counting vampires and humans as they go by. Maybe it\u0027s a bomb Jennifer Cater planted before she got offed. Maybe she wanted to blow up the queen.\" I\u0027d had a couple of minutes to think about this.\\n\\n \"And maybe it\u0027ll take your hand off,\" he said. \"Let me take it, babe.\"\\n\\n \"You sure you want to do that, after tonight?\" I asked dismally.\\n\\n \"We can talk about that later. Don\u0027t worry about it. Just give me the damn can.\"\\n\\n I noticed Todd Donati wasn\u0027t offering, and he already had a fatal disease. Didn\u0027t he want to go out as a hero? What was wrong with him? Then I was ashamed of myself for even thinking that. He had a family, and he\u0027d want every minute with them.\\n\\n Donati was sweating visibly, and he was white as a vampire. He was talking into the little headset he wore, relaying what he was seeing to...someone.\\n\\n \"No, Quinn. Someone with one of those special suits on needs to take it,\" I said. \"I\u0027m not moving. The can\u0027s not moving. We\u0027re okay. Till one of those special guys gets here. Or special gal,\" I added in the interest of fairness. I was feeling a little light-headed. The multiple shocks of the night were taking their toll on me, and I was beginning to tremble. Plus, I thought I was nuts for doing this; and yet here I was, doing it. \"Anyone got X-ray vision?\" I asked, trying to smile. \"Where\u0027s Superman when you need him?\"\\n\\n \"Are you trying to be a martyr for these damn things?\" Quinn asked, and I figured the \"damn things\" were the vampires.\\n\\n \"Ha,\" I said. \"Oh, ha-ha. Yeah, \u0027cause they love me. You see how many vampires are up here? Zero, right?\"\\n\\n \"One,\" said Eric, stepping out of the stairwell. \"We\u0027re bound a bit too tightly to suit me, Sookie.\" He was visibly tense; I couldn\u0027t remember ever seeing Eric so notably anxious. \"I\u0027m here to die right along with you, it seems.\"\\n\\n \"Good. To make my day absolutely effing complete, here\u0027s Eric again,\" I said, and if I sounded a little sarcastic, well, I was due. \"Are you all completely nuts? Get the hell out of here!\"\\n\\n In a brisk voice, Todd Donati said, \"Well, I will. You won\u0027t let anyone take the can, you won\u0027t put it down, and you haven\u0027t blown up yet. So I think I\u0027ll go downstairs to wait for the bomb squad.\"\\n\\n I couldn\u0027t fault his logic. \"Thanks for calling in the troops,\" I said, and Donati took the stairs, because the elevator was too close to me. I could read his head easily, and he felt deep shame that he hadn\u0027t actually offered to help me in any more concrete way. He planned to go down a floor to where no one could see him and then take the elevator to save his strength. The stairwell door shut behind him, and then we three stood by ourselves in a triangular tableau: Quinn, Eric, and me. Was this symbolic, or what?\\n\\n My head was feeling light.\\n\\n Eric began to move very slowly and carefully - I think so I wouldn\u0027t be startled. In a moment, he was at my elbow. Quinn\u0027s brain was throbbing and pulsating like a disco ball farther to my right. He didn\u0027t know how to help me, and of course, he was a bit afraid of what might happen.\\n\\n Who knew, with Eric? Aside from being able to locate him and determine how he was oriented to me, I couldn\u0027t see more.\\n\\n \"You\u0027ll give it to me and leave,\" Eric said. He was pushing his vampire influence at my head with all his might.\\n\\n \"Won\u0027t work, never did,\" I muttered.\\n\\n \"You are a stubborn woman,\" he said.\\n\\n \"I\u0027m not,\" I said, on the verge of tears at being first accused of nobility, then stubbornness. \"I just don\u0027t want to move it! That\u0027s safest!\"\\n\\n \"Some might think you suicidal.\"\\n\\n \"Well, \u0027some\u0027 can stick it up their ass.\"\\n\\n \"Babe, put it down on the urn. Just lay it down re-a-a-llll easy,\" Quinn said, his voice very gentle. \"Then I\u0027ll get you a big drink with lots of alcohol. You\u0027re a real strong gal, you know that? I\u0027m proud of you, Sookie. But if you don\u0027t put that down now and get out of here, I\u0027m gonna be real mad, hear me? I don\u0027t want anything to happen to you. That would be nuts, right?\"\\n\\n I was saved from further debate by the arrival of another entity on the scene. The police sent up a robot in the elevator.\\n\\n When the door swooshed open we all jumped, because we\u0027d been too wrapped up in the drama to notice the noise of the elevator. I actually giggled when the stubby robot rolled off the elevator. I started to hold the bomb out to it, but I figured the robot wasn\u0027t supposed to take it. It seemed to be operating on remote control, and it turned slightly right to face me. It remained motionless for a couple of minutes to have a good look at me and what was in my hand. After a minute or two of examination, the robot retreated onto the elevator, and its arm jerkily reached up to punch the correct button. The doors swished shut, and it left.\\n\\n \"I hate modern technology,\" Eric said quietly.\\n\\n \"Not true,\" I said. \"You love what computers can do for you. I know that for a fact. Remember how happy you got when you saw the Fangtasia employee roster, with all the work hours filled in?\"\\n\\n \"I don\u0027t like the impersonality of it. I like the knowledge it can hold.\"\\n\\n This was just too weird a conversation for me to continue under the circumstances.\\n\\n \"Someone\u0027s coming up the stairs,\" Quinn said, and opened the stair door.\\n\\n Into our little group strode the bomb disposal guy. The homicide squad might not have boasted any vampire cops, but the bomb squad did. The vampire wore one of those space suit¨Clooking outfits. (Even if you can survive it, I guess getting blown up is not a good experience.) Someone had written \"BOOM\" on his chest where a name tag would normally be. Oh, that was so funny.\\n\\n \"You two civilians need to leave the floor to the lady and me,\" Boom said, moving slowly across the floor to me. \"Take a hike, guys,\" he said when neither man moved.\\n\\n \"No,\" said Eric.\\n\\n \"Hell, no,\" said Quinn.\\n\\n It isn\u0027t easy to shrug in one of those suits, but Boom managed. He was holding a square container. Frankly, I was in no mood to have a look at it, and all I cared about was that he opened the lid and held it out, carefully placing it under my hands.\\n\\n Very, very carefully I lowered the can into the padded interior of the container. I let it go and brought my hands out of the container with a relief that I can\u0027t even describe, and Boom closed the container, still grinning merrily through his clear face guard. I shuddered all over, my hands trembling violently from the release of the position.\\n\\n Boom turned, slowed by the suit, and gestured to Quinn to open the stairwell door again. Quinn did, and down the stairs the vampire went: slowly, carefully, evenly. Maybe he smiled all the way. But he didn\u0027t blow up, because I didn\u0027t hear a noise, and I\u0027ve got to say we all stood frozen in our places for a good long while.\\n\\n \"Oh,\" I said, \"Oh.\" This was not brilliant, but I was in about a thousand emotional pieces. My knees gave way.\\n\\n Quinn pounced on me and wrapped his arms around me. \"You idiot,\" he said. \"You idiot.\" It was like he was saying, \"Thank you, God.\" I was smothered in weretiger, and I rubbed my face against his E(E)E shirt to wipe up the tears that had leaked from my eyes.\\n\\n When I peered under his arm, there was no one else in the area. Eric had vanished. So I had a moment to enjoy being held, to know that Quinn still liked me, that the thing with Andre and Eric hadn\u0027t killed all feeling he had begun to have for me. I had a moment to feel the absolute relief of escaping death.\\n\\n Then the elevator and the stair door opened simultaneously, and all manner of people wanted to talk to me. \\n\\n","sourceLink":"https://allnovel.net/all-together-dead-sookie-stackhouse-7/page-12.html","bookId":2197,"book":{"id":2197,"title":"All Together Dead (Sookie Stackhouse #7)","description":"Storyline: All Together Dead (Sookie Stackhouse #7) \\n Louisiana cocktail waitress Sookie Stackhouse has her hands full dealing with every sort of undead and paranormal creature imaginable. And after being betrayed by her longtime vampire love, Sookie must not only deal with a new man in her life—the shapeshifter Quinn—but also contend with the long-planned vampire summit. \\n The summit is a tense situation. The vampire queen of Louisiana is in a precarious position, her power base weakened by hurricane damage to New Orleans. And there are some vamps who would like to finish what nature started. Soon, Sookie must decide what side she\u0027ll stand with. And her choice may mean the difference between survival and all-out catastrophe. \\n And with HBO\u0027s launching of an all-new show, True Blood, based on the Southern Vampire novels, the demand for Charlaine Harris and Sookie Stackhouse is bigger than ever.\\n","cover":"https://allnovel.net/images/all-together-dead-sookie-stackhouse-7.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/all-together-dead-sookie-stackhouse-7.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 10:00:35 PM"}}
