{"id":101284,"no":6,"title":"Page 6","content":"ON THE SECOND MORNING AFTER JASON\u0027S WEDDING, I was feeling much more myself. Having a mission helped. I needed to be at Tara\u0027s Togs right after it opened at ten. I had to pick out the clothes Eric said I needed for the summit. I wasn\u0027t due at Merlotte\u0027s until five thirty or so that night, so I had that pleasant feeling of the whole day stretching ahead of me. \"Hey, girl!\" Tara said, coming from the back of the shop to greet me. Her part-time assistant, McKenna, glanced at me and resumed moving clothes around. I assumed she was putting misplaced items back into their correct positions; clothing store employees seem to spend a lot of time doing that. McKenna didn\u0027t speak, and unless I was much mistaken, she was trying to avoid talking to me at all. That hurt, since I\u0027d gone to see her in the hospital when she\u0027d had her appendix out two weeks ago, and I\u0027d taken her a little present, too. \"Mr. Northman\u0027s business associate Bobby Burnham called down here to say you needed some clothes for a trip?\" Tara said. I nodded, trying to look matter of fact. \"Would casual clothes be what you needed? Or suits, something of a business nature?\" She gave me an utterly false bright smile, and I knew she was angry with me because she was scared for me. \"McKenna, you can take that mail to the post office,\" Tara told McKenna with an edge to her voice. McKenna scuttled out the back door, the mail stuffed under her arm like a riding crop. \"Tara,\" I said, \"it\u0027s not what you think.\" \"Sookie, it\u0027s none of my business,\" she said, trying hard to sound neutral. \"I think it is,\" I said. \"You\u0027re my friend, and I don\u0027t want you thinking I\u0027m just going traveling with a bunch of vampires for fun.\" \"Then why are you going?\" Tara\u0027s face dropped all the false cheer. She was deadly serious. \"I\u0027m getting paid to go with a few of the Louisiana vamps to a big meeting. I\u0027ll act as their, like, human Geiger counter. I\u0027ll tell them if a human\u0027s trying to bullshit them, and I\u0027ll know what the other vamps\u0027 humans are thinking. It\u0027s just for this one time.\" I couldn\u0027t explain more fully. Tara had been into the world of the vampires more heavily than she needed to be, and she\u0027d almost gotten killed. She wanted nothing more to do with it, and I couldn\u0027t blame her. But she still couldn\u0027t tell me what to do. I\u0027d gone through my own soul searching over this issue, even before Claudine\u0027s lecture, and I wasn\u0027t going to permit anyone else to second-guess me once I\u0027d made up my mind. Getting the clothes was okay. Working for the vamps was okay...as long as I didn\u0027t turn humans over to get killed. \"We\u0027ve been friends for a coon\u0027s age,\" Tara said quietly. \"Through thick and thin. I love you, Sookie, I always will; but this is a real thin time.\" Tara had had so much disappointment and worry in her life that she simply wasn\u0027t willing to undertake any more. So she was cutting me loose, and she thought she would call JB that night and renew their carnal acquaintance, and she would do that almost in memory of me. It was a strange way to write my premature epitaph. \"I need an evening dress, a cocktail-type dress, and some nice day clothes,\" I said, checking my list quite unnecessarily. I wasn\u0027t going to fool with Tara anymore. I was going to have fun, no matter how sour she looked. She\u0027d come around, I told myself. I was going to enjoy buying clothes. I started off with an evening dress and a cocktail dress. And I got two suits, like business suits (but not really, since I can\u0027t see myself in black pinstripes). And two pants outfits. And hose and knee-highs and a nightgown or two. And a bit of lingerie. I was swinging between guilt and delight. I spent more of Eric\u0027s money than I absolutely had to, and I wondered what would happen if Eric asked to see the things he\u0027d bought. I\u0027d feel pretty bad then. But it was like I\u0027d been caught up in a buying frenzy, partly out of the sheer delight of it, and partly out of anger at Tara, and partly to deny the fear I was feeling at the prospect of accompanying a group of vampires anywhere. With another sigh, this one a very quiet and private one, I returned the lingerie and the nightgowns to their tables. Nonessentials. I felt sad to part with them, but I felt better overall. Buying clothes to suit a specific need, well, that was okay. That was a meal. But buying underthings, that was something else entirely. That was like a MoonPie. Or Ding Dongs. Sweet, but bad for you. The local priest, who had started attending Fellowship of the Sun meetings, had suggested to me that befriending vamps, or even working for them, was a way of expressing a death wish. He\u0027d told me this over his burger basket the week before. I thought about that now, standing at the cash register while Tara rang up all my purchases, which would be paid for with vampire money. Did I believe I wanted to die? I shook my head. No, I didn\u0027t. And I thought the Fellowship of the Sun, which was the ultra right-wing anti-vampire movement that was gaining an alarming stronghold in America, was a crock. Their condemnation of all humans who had any dealings with vampires, even down to visiting a business owned by a vamp, was ridiculous. But why was I even drawn to vamps to begin with? Here was the truth of it: I\u0027d had so little chance of having the kind of life my classmates had achieved - the kind of life I\u0027d grown up thinking was the ideal - that any other life I could shape for myself seemed interesting. If I couldn\u0027t have a husband and children, worry about what I was going to take to the church potluck and if our house needed another coat of paint, then I\u0027d worry about what three-inch heels would do to my sense of balance when I was wearing several extra pounds in sequins. When I was ready to go, McKenna, who\u0027d come back from the post office, carried my bags out to my car while Tara cleared the amount with Eric\u0027s day man, Bobby Burnham. She hung up the phone, looking pleased. \"Did I use it all up?\" I asked, curious to find out how much Eric had invested in me. \"Not nearly,\" she said. \"Want to buy more?\" But the fun was over. \"No,\" I said. \"I\u0027ve gotten enough.\" I had a definite impulse to ask Tara to take every stitch back. Then I thought what a shabby thing that would be to do to her. \"Thanks for helping me, Tara.\" \"My pleasure,\" she assured me. Her smile was a little warmer and more genuine. Tara always liked making money, and she\u0027d never been able to stay mad at me long. \"You need to go to World of Shoes in Clarice to get something to go with the evening gown. They\u0027re having a sale.\" I braced myself. This was the day to get things done. Next stop, World of Shoes. I would be leaving in a week, and work that night went by in a blur as I grew more excited about the trip. I\u0027d never been as far from home as Rhodes, which was way up there by Chicago; actually, I\u0027d never been north of the Mason-Dixon Line. I\u0027d flown only once, and that had been a short flight from Shreveport to Dallas. I would have to get a suitcase, one that rolled. I\u0027d have to get...I thought of a long list of smaller items. I knew that some hotels had hair dryers. Would the Pyramid of Gizeh? The Pyramid was one of the most famous vampire-oriented hotels that had sprung up in major American cities. Since I\u0027d already arranged my time off with Sam, that night I told him when I was scheduled to leave. Sam was sitting behind his desk in the office when I knocked on the door - well, the door frame, because Sam almost never shut the door. He looked up from his bill paying. He was glad to be interrupted. When he worked on the books, he ran his hands through his reddish blond hair, and now he looked a little electrified as a result. Sam would rather be tending bar than doing this task, but he\u0027d actually hired a substitute for tonight just for the purpose of getting his books straight. \"Come in, Sook,\" he said. \"How\u0027s it going out there?\" \"Pretty busy; I haven\u0027t got but a second. I just wanted to tell you I\u0027ll be leaving next Thursday.\" Sam tried to smile, but he ended up simply looking unhappy. \"You have to do this?\" he asked. \"Hey, we\u0027ve talked about this,\" I said, sounding a clear warning. \"Well, I\u0027ll miss you,\" he explained. \"And I\u0027ll worry a little. You and lots of vamps.\" \"There\u0027ll be humans there, like me.\" \"Not like you. They\u0027ll be humans with a sick infatuation with the vampire culture, or deaddiggers, looking to make a buck off the undead. None of these are healthy people with long life expectancies.\" \"Sam, two years ago I didn\u0027t have any idea of what the world around me was really like. I didn\u0027t know what you really were; I didn\u0027t know that vampires were as different from each other as we are. I didn\u0027t know that there were real fairies. I couldn\u0027t have imagined any of that.\" I shook my head. \"What a world this is, Sam. It\u0027s wonderful and it\u0027s scary. Each day is different. I never thought I would have any kind of life for myself, and now I do.\" \"I\u0027d be the last person in the world to block your place in the sun, Sookie,\" Sam said, and he smiled at me. But it didn\u0027t escape my attention that his statement was a wee bit ambiguous. Pam came to Bon Temps that night, looking bored and cool in a pale green jumpsuit with navy piping. She was wearing navy penny loafers...no kidding. I hadn\u0027t even realized those were still for sale. The dark leather was polished to a high shine, and the pennies were new. She got plenty of admiring looks in the bar. She perched at a table in my section and sat patiently, her hands clasped on the table in front of her. She went into the vampire state of suspension that was so unnerving to anyone who hadn\u0027t seen it yet - her eyes open but not seeing, her body totally unmoving, her expression blank. Since she was having some downtime, I waited on a few people before I went to her table. I was sure I knew why she was there, and I wasn\u0027t looking forward to the conversation. \"Pam, can I get you a drink?\" \"What\u0027s with the tiger, then?\" she asked, going straight for the conversational jugular. \"Quinn is who I\u0027m seeing now,\" I said. \"We don\u0027t get to stay together much because of his job, but we\u0027ll see each other at the summit.\" Quinn had been hired to produce some of the summit\u0027s expected ceremonies and rituals. He\u0027d be busy, but I\u0027d catch glimpses of him, and I was already excited about the prospect. \"We\u0027re spending a month together after the summit,\" I told Pam. Ah-oh, maybe I\u0027d over-shared on that one. Pam\u0027s face lost its smile. \"Sookie, I don\u0027t know what strange game you and Eric have going, but it\u0027s not good for us.\" \"I have nothing going! Nothing!\" \"You may not, but he does. He has not been the same since the time you two spent together.\" \"I don\u0027t know what I can do about that,\" I said weakly. Pam said, \"I don\u0027t either, but I hope he can resolve his feelings for you. He doesn\u0027t enjoy having conflicts. He doesn\u0027t enjoy feeling attached. He is not the carefree vampire he used to be.\" I shrugged. \"Pam, I\u0027ve been as straight with him as I can be. I think maybe he\u0027s worried about something else. You\u0027re exaggerating my importance in Eric\u0027s scheme of things. If he has any kind of undying love for me, then he\u0027s sure not telling me about it. And I never see him. And he knows about Quinn.\" \"He made Bill confess to you, didn\u0027t he?\" \"Well, Eric was there,\" I said uncertainly. \"Do you think Bill would ever have told you if Eric hadn\u0027t commanded him to?\" I\u0027d done my best to forget that night altogether. In the back of my mind, I\u0027d known the strange timing of Bill\u0027s revelation was significant, but I just hadn\u0027t wanted to think about it. \"Why do you think Eric would give a flying fuck what Bill had been ordered to do, much less reveal it to a human woman, if he didn\u0027t have inappropriate feelings for you?\" I\u0027d never put it to myself quite like that. I\u0027d been so ripped up by Bill\u0027s confession - the queen had planted him to seduce me (if necessary) to gain my trust - that I hadn\u0027t thought of why Eric had forced Bill into the position of telling me about the plot. \"Pam, I don\u0027t know. Listen, I\u0027m working here, and you need to order something to drink. I gotta take care of my other tables.\" \"O-negative, then. TrueBlood.\" I hurried to get the drink out of the cooler, and I warmed it up in the microwave, shaking it gently to make sure the temperature was even. It coated the sides of the bottle in an unpleasant way, but it certainly looked and tasted like real blood. I\u0027d poured a few drops into a glass one time at Bill\u0027s so I could have the experience. As far as I could tell, drinking synthetic blood was exactly like drinking real blood. Bill had always enjoyed it, though he\u0027d remarked more than once that flavor wasn\u0027t the thing; it was the sensation of biting into flesh, feeling the heartbeat of the human, that made being a vampire fun. Glugging out of a bottle just didn\u0027t do the trick. I took the bottle and a wineglass to Pam\u0027s table and deposited both before her, along with a napkin, of course. \"Sookie?\" I looked up to see that Amelia had come in. My roomie had come into the bar often enough, but I was surprised to see her tonight. \"What\u0027s up?\" I asked. \"Um...hi,\" Amelia said to Pam. I took in Amelia\u0027s pressed khakis, her neat white golf shirt, her equally white tennis shoes. I glanced at Pam, whose pale eyes were wider than I\u0027d ever seen them. \"This is my roommate, Amelia Broadway,\" I told Pam. \"Amelia, this is Pam the vampire.\" \"I am pleased to meet you,\" Pam said. \"Hey, neat outfit,\" Amelia said. Pam looked pleased. \"You look very nice, too,\" she said. \"You a local vamp?\" Amelia asked. Amelia was nothing if not blunt. And chatty. Pam said, \"I\u0027m Eric\u0027s second-in-command. You do know who Eric Northman is?\" \"Sure,\" Amelia said. \"He\u0027s the blond hunk of burning love who lives in Shreveport, right?\" Pam smiled. Her fangs popped out a little. I looked from Amelia to the vampire. Geez Louise. \"Perhaps you would like to see the bar some night?\" Pam said. \"Oh, sure,\" Amelia said, but not as if she were particularly excited. Playing hard to get. For about ten minutes, if I knew Amelia. I left to answer a customer beckoning from another table. Out of the corner of my eye, Amelia sat down with Pam, and they talked for a few minutes before Amelia got up and stood by the bar, waiting for me to return. \"And what brings you here tonight?\" I asked maybe a little too abruptly. Amelia raised her eyebrows, but I didn\u0027t apologize. \"I just wanted to tell you, you got a phone call at the house.\" \"Who from?\" \"From Quinn.\" I felt a smile spread across my face, a real one. \"What did he say?\" \"He said he\u0027d see you in Rhodes. He misses you already.\" \"Thanks, Amelia. But you could\u0027ve just called here to tell me, or told me when I got home.\" \"Oh, I got a little bored.\" I\u0027d known she would be, sooner or later. Amelia needed a job, a full-time job. She missed her city and her friends, of course. Even though she\u0027d left New Orleans before Katrina, she\u0027d suffered a little every day since the storm\u0027s aftermath had devastated the city. Amelia missed the witchcraft, too. I\u0027d hoped she\u0027d pal around with Holly, another barmaid and a dedicated Wiccan. But after I\u0027d introduced the two and they\u0027d had some conversations, Amelia had told me glumly that she and Holly were very different sorts of witches. Amelia herself was (she considered) a true witch, while Holly was a Wiccan. Amelia had a thinly veiled contempt for the Wiccan faith. Once or twice, Amelia had met with Holly\u0027s coven, partly to keep her hand in...and partly because Amelia yearned for the company of other practitioners. At the same time, my houseguest was very anxious she might be discovered by the witches of New Orleans and made to pay a high price for her mistake in changing Bob. To add yet another emotional layer, since Katrina, Amelia feared for the safety of these same former companions. She couldn\u0027t find out if they were okay without them discovering her in return. Despite all this, I\u0027d known the day (or night) would come when Amelia would be restless enough to look outside my house and yard and Bob. I tried not to frown as Amelia went over to Pam\u0027s table to visit some more. I reminded my inner worrier that Amelia could take care of herself. Probably. I\u0027d been more certain the night before in Hotshot. As I went about my work, I switched my thoughts to Quinn\u0027s call. I wished I\u0027d had my new cell phone (thanks to Amelia\u0027s paying me a little rent, I could afford one) with me, but I didn\u0027t think it was right to carry it at work, and Quinn knew I wouldn\u0027t have it with me and turned on unless I was at liberty to answer it. I wished Quinn would be waiting at home when I left the bar in an hour. The strength of that fantasy intoxicated me. Though it would have been pleasant to roll in that feeling, indulging myself in the flush of my new relationship, I concluded was time to back down and face a little reality. I concentrated on serving my tables, smiling and chatting as needed, and refreshing Pam\u0027s TrueBlood once or twice. Otherwise, I left Amelia and Pam to their t¨ºte-¨¤-t¨ºte. Finally, the last working hour was over, and the bar cleared out. Along with the other servers, I did my closing-up chores. When I was sure the napkin holders and salt shakers were full and ready for the next day, I went down the little hall into the storeroom to deposit my apron in the large laundry basket. After listening to us hint and complain for years, Sam had finally hung a mirror back there for our benefit. I found myself standing absolutely still, staring into it. I shook myself and began to untie my apron. Arlene was fluffing her own bright red hair. Arlene and I were not such good friends these days. She\u0027d gotten involved in the Fellowship of the Sun. Though the Fellowship represented itself as an informational organization, dedicated to spreading the \"truth\" about vampires, its ranks were riddled with those who believed all vampires were intrinsically evil and should be eliminated, by violent means. The worst among the Fellowship took out their anger and fear on the humans who consorted with vampires. Humans like me. Arlene tried to meet my eyes in the mirror. She failed. \"That vamp in the bar your buddy?\" she asked, putting a very unpleasant emphasis on the last word. \"Yes,\" I said. Even if I hadn\u0027t liked Pam, I would have said she was my buddy. Everything about the Fellowship made the hair rise up on my neck. \"You need to hang around with humans more,\" Arlene said. Her mouth was set in a solid line, and her heavily made-up eyes were narrow with intensity. Arlene had never been what you\u0027d call a deep thinker, but I was astonished and dismayed by how fast she\u0027d been sucked into the Fellowship way of thinking. \"I\u0027m with humans ninety-five percent of the time, Arlene.\" \"You should make it a hundred.\" \"Arlene, how is this any of your business?\" My patience was stretched to its breaking point. \"You been putting in all these hours because you\u0027re going with a bunch of vamps to some meeting, right?\" \"Again, what business of yours?\" \"You and me were friends for a long time, Sookie, until that Bill Compton walked into the bar. Now you see vamps all the time, and you have strange people staying at your house.\" \"I don\u0027t have to defend my life to you,\" I said, and my temper utterly snapped. I could see inside her head, see all the smug and satisfied righteous judgment. It hurt. It rankled. I had babysat her children, consoled her when she was left high and dry by a series of unworthy men, cleaned her trailer, tried to encourage her to date men who wouldn\u0027t walk all over her. Now she was staring at me, actually surprised at my anger. \"Obviously you have some big holes in your own life if you have to fill them with this Fellowship crap,\" I said. \"Look at what sterling guys you pick to date and marry.\" With that unchristian dig, I spun on my heel and walked out of the bar, thankful I\u0027d already gotten my purse from Sam\u0027s office. Nothing\u0027s worse than having to stop in the middle of a righteous walkout. Somehow Pam was beside me, having joined me so quickly that I hadn\u0027t seen her move. I looked over my shoulder. Arlene was standing with her back flat against the wall, her face distorted with pain and anger. My parting shot had been a true one. One of Arlene\u0027s boyfriends had stolen the family silverware, and her husbands...hard to know where to start. Pam and I were outside before I could react to her presence. I was rigid with the shock of Arlene\u0027s verbal attack and my own fury. \"I shouldn\u0027t have said anything about him,\" I said. \"Just because one of Arlene\u0027s husbands was a murderer is no reason for me to be ugly.\" I was absolutely channeling my grandmother, and I gave a shaky hoot of laughter. Pam was a little shorter than I, and she looked up into my face curiously as I struggled to control myself. \"She\u0027s a whore, that one,\" Pam said. I pulled a Kleenex out of my purse to blot my tears. I often cried when I got angry; I hated that. Crying just made you look weak, no matter what triggered it. Pam held my hand and wiped my tears off with her thumb. The tender effect was a little weakened when she stuck the thumb in her mouth, but I figured she meant well. \"I wouldn\u0027t call her a whore, but she\u0027s truly not as careful as she might be about who she goes with,\" I admitted. \"Why do you defend her?\" \"Habit,\" I said. \"We were friends for years and years.\" \"What did she do for you, with her friendship? What benefit was there?\" \"She...\" I had to stop and think. \"I guess I was just able to say I had a friend. I cared about her kids, and I helped her out with them. When she couldn\u0027t work, I\u0027d take her hours, and if she worked for me, I\u0027d clean her trailer in return. She\u0027d come see me if I was sick and bring me food. Most of all, she was tolerant of my differences.\" \"She used you and yet you felt grateful,\" Pam said. Her expressionless white face gave me no clue to her feelings. \"Listen, Pam, it wasn\u0027t like that.\" \"How was it, Sookie?\" \"She really did like me. We really did have some good times.\" \"She\u0027s lazy. That extends to her friendships. If it\u0027s easy to be friendly, she will be. If the wind blows the other way, her friendship will be gone. And I\u0027m thinking the wind is blowing the other way. She has found some other way to be an important person in her own right, by hating others.\" \"Pam!\" \"Is this not true? I\u0027ve watched people for years. I know people.\" \"There\u0027s true stuff you should say, and true stuff that\u0027s better left unsaid.\" \"There\u0027s true stuff you would rather I left unsaid,\" she corrected me. \"Yes. As a matter of fact, that\u0027s...true.\" \"Then I\u0027ll leave you and go back to Shreveport.\" Pam turned to walk around the building to where her car was parked in front. \"Whoa!\" She turned back. \"Yes?\" \"Why were you here in the first place?\" Pam smiled unexpectedly. \"Aside from asking you questions about your relationship with my maker? And the bonus of meeting your delectable roommate?\" \"Oh. Yeah. Aside from all that.\" \"I want to talk to you about Bill,\" she said to my utter surprise. \"Bill, and Eric.\"","sourceLink":"https://allnovel.net/all-together-dead-sookie-stackhouse-7/page-6.html","bookId":2197,"book":{"id":2197,"title":"All Together Dead (Sookie Stackhouse #7)","description":"Storyline: All Together Dead (Sookie Stackhouse #7) Louisiana cocktail waitress Sookie Stackhouse has her hands full dealing with every sort of undead and paranormal creature imaginable. And after being betrayed by her longtime vampire love, Sookie must not only deal with a new man in her life—the shapeshifter Quinn—but also contend with the long-planned vampire summit. The summit is a tense situation. The vampire queen of Louisiana is in a precarious position, her power base weakened by hurricane damage to New Orleans. And there are some vamps who would like to finish what nature started. Soon, Sookie must decide what side she\u0027ll stand with. And her choice may mean the difference between survival and all-out catastrophe. And with HBO\u0027s launching of an all-new show, True Blood, based on the Southern Vampire novels, the demand for Charlaine Harris and Sookie Stackhouse is bigger than ever.","cover":"https://allnovel.net/images/all-together-dead-sookie-stackhouse-7.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/all-together-dead-sookie-stackhouse-7.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 10:00:35 PM"}}
