{"id":66642,"no":17,"title":"Page 17","content":"I sat in an office and had to do a couple of aptitude tests (no language aptitude required) – guide a thread round a series of tacks on a board and fold a piece of paper in a particular way, following visual instructions. Finally I had to learn to wind thin copper wire round an iron bobbin. And then I had a ‘skilled’ job, just like they’d told me I would – technically it was even a paid job, though nobody ever gave you any money, just jotted down your wages against your number. I sat at a bench under bright electric lights in a relatively clean and airy factory barrack, wrapping strands of copper wire around iron bobbins. The factory was decent because German civilians from Fürstenberg worked there too. I was a prisoner, but I was healthy and clean enough that I could work in the same room with normal people, though we weren’t allowed to speak to each other (not that I could). The dorms at Siemens were cleaner too, and less crowded. We were still three to a bed, but the mattresses were better and we had two blankets between the three of us and the toilet worked. We were all issued with kerchiefs to cover up how savagely some of us had been scalped.\n I missed Elodie like crazy, and most of my ill-gotten belongings (toothbrush, soap, etc.) were still hidden in a crack between the boards of my never-to-be-revisited bunk in Block 8. I didn’t meet anyone in my new barrack who spoke either French or English. But see, I’d waited out the dreadful quarantine believing my life would improve, and it did.\n I lasted three days.\n That’s counting the time I stood at my bench doing nothing for eighteen hours, waiting for someone to shoot me.\n It wasn’t that I couldn’t do the work. The summer before my senior year in high school I worked at the paper box factory in Mount Jericho. It was the same kind of work – just folding and sticking on an assembly line. Actually, it was worse at the paper box factory because the air was so dusty and it was so hot that summer. And it was so boring – the only interesting thing that happened the whole summer was when Polly put that cigarette butt in her pocket and set her apron on fire. The work was worth it – I needed the money for coming to England. But it wasn’t a fun job, and I stuck with it and was pleased with myself afterwards.\n OK, here I was on another assembly line, doing work that I knew I could handle, and hoping for the war to end at any minute – so why did I go and ruin it all?\n I blame it on a couple of civilian workers, although that’s not really fair. I’d have figured it out on my own eventually. I heard them talking when we were coming in after the dinner break, and I heard a word I recognised:\n Vergeltungswaffe – vengeance weapon.\n I filed meekly back to my place at the long table full of copper wire and iron spools. And in the back of my head the word was echoing over and over with the clattering rhythm of an approaching doodlebug:\n Vergeltungswaffe, Vergeltungswaffe\n I sat down. I picked up a piece of copper wire.\n I was making electrical relays for flying bomb fuses.\n I put down the piece of wire. Then I just sat there staring at it for twenty minutes. I was so quiet, so utterly unfussy, that it took twenty minutes for anyone to notice I had stopped working. At least, it took the foreman twenty minutes to notice I had stopped working. The prisoners on either side of me didn’t say anything – they just quietly beavered away at their own electrical relays.\n The foreman eventually came over and gave me a gentle prod in the ribs with the end of a ruler. The civilians didn’t like to touch the Ravensbrück prisoners, and no wonder – even when we were clean, we were still livid with bug bites. My shins were so bitten they looked sunburned. I knew exactly what the ruler-poke meant – he didn’t have to say anything in any language. I wanted to be willing, God knows I wanted to cooperate; I didn’t want to get in trouble. I picked up the wire thread.\n And I just couldn’t do it.\n Now this, this I remember like it was this morning. I watch my hands writing here on the vanity table in the Paris Ritz and I can see it happening. I picked up the wire thread, wrapped it once round the spool, and I saw Maddie’s hands instead of mine. Just in a blinking flash. Maddie’s pretty, capable hands, with the old French-cut ruby sparkling on her ring finger, taking apart the bomb fuse that Uncle Roger sent me.\n I closed my eyes to make it go away. My own hands were still frozen in place over the new relay. And when I closed my eyes, I saw the little boy’s hands from my nightmare – small dirty fingers blown to bloody splinters.\n And I just couldn’t do it.\n It wasn’t a conscious decision. It wasn’t rebellion. It wasn’t sabotage. It wasn’t my conscience nagging at me. It wasn’t anything noble. God knows I wouldn’t have been brave enough to do anything noble! But now that I knew what I was making – I just couldn’t do it.\n I laid the wire gently on the table. Then I laid my hands in my lap. The foreman called over the SS guard who was in charge of the prison workers.\n Gosh, they gave no quarter, those SS guards. They didn’t waste any time, ever. This one didn’t even try to talk to me. She took hold of my skull – just grabbed me by the back of my head – and slammed my forehead down on the table. For a moment it felt like my head had exploded, sparkling light everywhere. Then she shifted her grip on my head to force me back upright, and with her free hand she picked up the strand of copper wire and tossed it on the table in front of me.\n Beneath her grip I shook my head sadly. NO.\n She slammed my face back down on the table, and I have got a scar, just above my left eye, where the copper wire cut me. It’s so thin you probably can’t see it – I am not brave enough to look. But I can feel it and I know it’s there. I count it as a flying bomb scar.\n The guard let go of my head.\n ‘Aufstehen!’\n Get up. You got to know what that meant after a while, because you had to do it so much.\n They didn’t do anything else – just made me stand up. The copper wire and relay bobbins I was supposed to be working on still lay there on the table in front of me. The prisoners around me were still hunched over their own relays just the way they’d been when I first stopped working, diligently trying not to notice what was going on.\n It was like when I took the fuse from the boy on the railway line in Hamble. I was sure I was going to be killed. And it made me sad – not scared, but sad that I had forced myself into this corner where I just couldn’t win.\n But they didn’t kill me. They didn’t even hit me again. They just made me stand there.\n I stood there for the rest of the day. And all night. And into the next day.\n People came and went around me. Production went on during the night, so everybody changed shift around me and I went on standing there.\n They kept an eye on me. There were a couple of extra guards brought in especially for me. They wouldn’t let me touch the long table with my hands, or lean against the bench. It got harder and harder not to. I started dreaming about my crowded bunk with its thin mattress and shared blanket. The copper wire on the table in front of me danced and gleamed beneath the harsh factory lights. I heard the screaming sirens go and thought smugly, through the daze of exhaustion, I’ve missed two roll calls.\n Not that I’d have been doing anything else in a roll call except just standing there!\n In the middle of the night, when I’d been on my feet for probably more than twelve hours – and of course I’d been working for six hours before that, and awake since the 4 a.m. siren the previous day – there was a point when all I wanted to do was lie down under the table and go to sleep. If I couldn’t do that then I might as well be dead. I was pretty sure I didn’t care any more. I’d reached the point when I thought I would do anything to be allowed to sit down – so very carefully, I stepped over the bench and sat down and picked up the copper wire that was waiting for me.\n It was bliss, sheer bliss, to sit down, even though I was still sitting upright – bliss just to be allowed to sit. I didn’t think I’d get away with just sitting there, though. I was showing them they’d won, and I was going to have to go back to work. I knew they’d make me finish up the rest of that shift, or make up the time I’d wasted. So I started to wrap the wire around the spool.\n And you know what?\n I still couldn’t do it.\n I put the wire down quietly. I put my hands on the table and pushed myself to my feet somehow. And somehow I managed to climb back over the bench so I was standing behind it again.\n The other prisoners glanced up at me briefly and then away. Nobody smiled. The guards and the foreman chatted together for a while and then the foreman took away my copper wire and the spools and gave them to someone else to finish up. They didn’t do anything to me – didn’t hit me, didn’t make me leave the room – just made me go on standing there.\n Only, while before it had been a battle of wills between us – stand there until you feel like working – now I was being punished because I’d refused to work.\n This made everything a little different. Also, it woke me up.\n I’d sat down because I thought I’d been completely at the end of my strength. Obviously I wasn’t. But I was pretty close to it, and now I no longer had a way out. I knew this. Also, now I didn’t know where the whole thing was going, and that was very frightening. So I had to readjust something in my head to help me focus on not losing my mind with fear and exhaustion.\n So I made up a poem.\n It sort of started in my head as a chant about wire and fuses. It wasn’t anything profound or memorable, just a sort of counting-out rhyme based on something I’d tried to write last summer – rhyming words in a list, like the list of Polish girls’ names that we all memorised and which I reported to the American Embassy as well as the Swedish Red Cross, and which I will report again to anyone else who will listen.\n It was as though, ever since I left Camp Los Angeles, I’d been flying a plane so nose-high that I couldn’t see anything below me, because if I looked down I’d be looking into hell and I didn’t want to see. I knew it was there. But as long as I didn’t look, as long as I kept the nose up, I could fool myself into thinking it wasn’t. My Luftwaffe recommendation would protect me. There would be better beds and food and toilets when I was out of quarantine. The Allies would be here in a month. I wouldn’t make trouble. I would be all right.\n So now I’d raised the nose too high, and I was going to lose control of the aircraft and plummet into a spin. And when I did, like Celia’s Tempest, I would fall and I would be in hell. Really and truly and for good.\n So I stood there until I fell.\n I don’t remember this part very well. It really is a blur, not because I’ve forgotten, but because I was already so dazed while it was happening. I ended up soaking wet – I remember being utterly drenched and freezing cold. They must have hosed me down to wake me up so they didn’t have to carry me back to the main camp, and I did walk – incredibly, I am sure I walked. I know it was October and early in the morning, and windy, so it would have been chilly anyway even if I hadn’t been completely dripping wet. The wind felt like knives of ice and they wouldn’t let me hug my arms around me – I had to walk with my hands at my sides. I don’t remember passing the lake or the gates or what the sky looked like or if there were other prisoners around, or even where they were taking me, and when they’d left me locked in a shadowy, bare concrete cupboard of a cell, I didn’t care, because there was a narrow iron bed with a wooden plank for a mattress and no one in it. I curled in a tight, shaking ball against the dank wall and fell instantly asleep without even looking to see if there was a blanket. \n","sourceLink":"https://allnovel.net/rose-under-fire-code-name-verity-2/page-17.html","bookId":2673,"book":{"id":2673,"title":"Rose Under Fire (Code Name Verity #2)","description":"Storyline: \n Rose Under Fire (Code Name Verity #2) \n While flying an Allied fighter plane from Paris to England, American ATA pilot and amateur poet, Rose Justice, is captured by the Nazis and sent to Ravensbrück, the notorious women\u0027s concentration camp. Trapped in horrific circumstances, Rose finds hope in the impossible through the loyalty, bravery and friendship of her fellow prisoners. But will that be enough to endure the fate that\u0027s in store for her? \n Elizabeth Wein, author of the critically-acclaimed and best-selling Code Name Verity, delivers another stunning WWII thriller. The unforgettable story of Rose Justice is forged from heart-wrenching courage, resolve, and the slim, bright chance of survival.\n \n","cover":"https://allnovel.net/images/rose-under-fire-code-name-verity-2.jpg","author":"Elizabeth Wein","type":"Historical","source":"allnovel","link":"https://allnovel.net/rose-under-fire-code-name-verity-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 10:01:17 AM"}}
