{"id":66657,"no":32,"title":"Page 32","content":"Irina and a couple of the other Russians got out first, and they did the dirty and dangerous work of cutting a hole in the wire that fenced off Block 32 from the rest of the camp. Then we spent most of the night hoisting all the Lublin Special Transport girls out a couple of the broken windows. I had an easy job – I had to keep stuffing wads of newspaper over the jagged glass around the edges of the window frame.\\n\\n The tricky part was crossing the yard between the barrack and the fence without being seen, and getting through the fence. I didn’t have to do it myself, but it still makes me shiver to think about it. Nobody got caught, but my gosh we worked slowly – though after the first dozen Rabbits had made it through the fence we got good at it.\\n\\n It took two of us on one side of the window and two on the other to lift one person out efficiently. Then, one by one in the dark, Irina and her Red Army friends escorted all the Lublin Transport Rabbits through the fence into the main camp. After that they were on their own – on crutches or limping or clinging to each other.\\n\\n Irina caught Róża herself when it was her turn.\\n\\n ‘The tent is the nearest place to hide,’ Irina whispered.\\n\\n ‘I’m not going back there,’ Karolina fired down at her, next in line to sneak out.\\n\\n But Róża couldn’t walk – not really, not in the dark – and Karolina was stuck with her.\\n\\n ‘If we don’t come back, Rose knows all our names,’ Róża said in ringing tones of menace, a little too loud.\\n\\n ‘Shut up, you stupid little girl!’ Karolina gasped hysterically. ‘Or they’ll kill Rose too, and there will be NO ONE who gets out of here alive to tell anyone!’\\n\\n ‘The whole camp knows. Everybody knows. Rose will tell the world.’ Róża growled orders at me. ‘You are to tell the world, Rose, you hear me?’\\n\\n ‘I will! I promise!’\\n\\n Irina took her under her arm to help her scuttle limping towards the hole in the fence.\\n\\n Sometime before the 4 a.m. Screamer, Irina and I crept back to our own bunk in the pitch-black, and that hellhole was so darn overcrowded that when we got to our spots, there were new prisoners sleeping soundly in place of Lisette and Karolina and Róża – I don’t know who they were.\\n\\n We lined up for roll call at 4.30 a.m. in what felt like a crowd of strangers, Irina and I at sea without our Camp Family. It felt like the whole Lublin Transport was missing.\\n\\n ‘Think they’ll kill us instead?’ Irina whispered.\\n\\n ‘Maybe,’ I gulped, thinking of Anna’s relentless description of poison gas, and my impossible promise to make sure that everybody knew everything when it was all over.\\n\\n Irina tilted her hand at me. ‘Taran. We go down fighting.’\\n\\n They read the list of numbers in German. It was like listening to a swarm of droning hornets.\\n\\n ‘Siebentausendsiebenhundertzwei, Siebenstausendsiebenhundertdrei, Siebentausendsiebenhundertvier . . .’\\n\\n I looked down at the cinders, scuffling my feet nervously, trying to keep warm. A small black pool of slush and dirt formed beneath me.\\n\\n Siebentausendsiebenhundertfünf. That was Róża, 7705. They called Karolina’s number, and Lisette’s. I glanced at Irina, but she was staring straight ahead.\\n\\n The messenger doing the announcement was an SS woman, in one of their grim black rain capes over her uniform. She came to the end of her long list of numbers and paused. Then she barked an order in German. She paced from one end of our first row to the other, her cape flapping shadows in the dark as she peered at the numbers on people’s sleeves. It was pretty quiet, except for the usual coughing and sniffling. The turkey buzzard messenger yelled at us again. No one moved. She hadn’t called our numbers.\\n\\n She barked an order at the guards. They’d sent extras, expecting a fight. She took hold of a dog’s leash and started prowling among the first rows of silent, stubborn language professors and music teachers and widowed mothers and orphaned daughters, and projectionists and spies and bartenders and cleaning ladies and Resistance agents and Red Army soldiers and Girl Scout saboteurs. And taran pilots.\\n\\n And, in our first real moment of glory, the lights went out.\\n\\n I think, if there could be anything I am glad I was there for, it is that moment.\\n\\n We let out a ragged roar of sheer excitement, all 50,000 of us at once. I swear, it was all of us at once, and this time they couldn’t control anything. We had nowhere to go, of course – we still couldn’t get out – we were all too starved to overpower anyone, and we couldn’t see who we were fighting anyway, but BY GOD, we weren’t going to let them count us. They weren’t going to count anybody that morning.\\n\\n ‘Line up for work! Work details!’ we all shouted ridiculously – like we were trying to get organised, when in fact we were hurling handfuls of gravel.\\n\\n I felt the flat of Irina’s hand against my shoulder. She rocked her palm. Taran. She did it against my shoulder because we couldn’t see each other in the dark.\\n\\n Maybe it wasn’t really fighting back – maybe it was just pathetic passive resistance. The lights go out and everybody runs around in the dark, throwing dirt and screaming. But it felt like we were fighting back. There’s only so much fighting you can do in one day on a slice of bread mostly made of bonemeal and two bowls of lukewarm turnip broth.\\n\\n I wish I would stop sidetracking on to food. Even now, when I am not hungry, I can’t stop thinking about what it was like to be starving.\\n\\n It is true though – we got tired. Some of the women actually just went back to bed, climbing back through the broken windows of the block to snatch another hour of sleep. That also made it hard to count us! By the time it was light we were so disorganised that they gave up on the roll call – they also half-heartedly tried to stop Block 32 from getting our morning ‘coffee’ (there I go again), but a group of Polish prisoners from another block came running over with a couple of the big saucepans from the kitchen and passed us a desperate breakfast through the chain-link fence.\\n\\n And there weren’t even any Rabbits in there with us at that point. That’s how determined everyone was.\\n\\n The lights went out again at the evening roll call. Irina and I stood pressed close to each other, our shoulders touching, standing still amid the chaos.\\n\\n ‘How many times will she get away with it?’ I whispered. I was worried about Irina’s friend from the Moscow Metro, the Russian technician responsible for the lights going out. Irina didn’t answer; I hadn’t really expected an answer anyway.\\n\\n The lights went out at every roll call for a week.\\n\\n ‘Rose! Rose Justice! Rosie!’\\n\\n Through the never-ending background of coughs and groans and creaking bunk slats I heard my name, low and tuneful, coaxing me in my sleep. The Demon Nadine, asleep on her mat by the small stove in the knitters’ workroom, would never have been able to hear it. I sat bolt upright and banged my head against the ceiling. Irina grabbed me by the arm to steady me, instantly awake like a soldier.\\n\\n ‘Outside the window,’ Irina said.\\n\\n We climbed down to the level below us and crawled over people to the broken window. There was a sort of human-shaped bundle of rags standing there in the black slush, tapping for attention on the window frame with a stick while simultaneously trying to hang on to the side of the building and avoid the filth that was smeared all over the wooden wall from the ground to about three feet up – that was where we all went to the bathroom now.\\n\\n ‘It’s one of those schmootzichs begging to get in,’ I whispered. ‘Oh God, they’re so creepy. How do they get away with wandering around the camp like this? How did she figure out how to get through the Block 32 fence? Nadine will kill us if we let a schmootzich into the bunks.’\\n\\n I do not like to admit how much the schmootzichs scared me. Ever since that first day, when they swarmed over me with their starved claws, I had been scared of them. I was scared of them touching me and I was scared of becoming one of them.\\n\\n ‘Rosie, that is not like you! She would sleep under the bunks if we let her in,’ Irina suggested. ‘The schmootzichs do not care about the mess.’\\n\\n ‘You fucking morons!’ the schmootzich hissed. ‘I’m Róża!’\\n\\n The stick she’d been tapping on the window frame was her crutch. Irina climbed out the window and hoisted Róża up to me and I hauled her in, using my coat to pad the frame this time (we all slept in our coats by then, and they let us because there were so few blankets left).\\n\\n ‘What are you doing here, Róża? You’ve got to hide!’ We scolded her in several languages.\\n\\n ‘I don’t care,’ Róża snarled. ‘I’m sick of hiding.’\\n\\n ‘But Block 32 is the first place they’ll look for you! Are you hungry?’ They’d cut Block 32’s food back by ten loaves and a barrel of soup to try to coerce us into turning over the Rabbits. A bunch of us kept trying to save bread to sneak out to the people hiding, but it was just impossible with the rations down – people would snatch it out of your mouth if you weren’t fast enough.\\n\\n Róża shook with suppressed laughter at my question and hissed, ‘Do you think we get five-course meals in the tent? Of course I’m hungry. You’re hungry, Irina’s hungry, everybody’s hungry. We’re all fucking starving. I didn’t leave because I’m hungry! I’m bored. You thought I was a schmootzich! That’s a fabulous disguise. I can go around pretending to be a camp beggar. I can carry messages!’\\n\\n ‘You can’t WALK.’\\n\\n ‘I’ll ride in your wheelbarrow.’\\n\\n She’d ripped off her Ravensbrück sleeve patches. She’d managed to get some dead woman’s number inked on her wrist like an Auschwitz prisoner’s tattoo. Carefully darned woollen hose from Elodie covered up her maimed legs. And in fact Róża could walk without her crutch, but it was this impossible crablike, lurching, gimpy series of dives and landings – she wouldn’t put weight on the leg that was missing pieces of bone, because one of the girls who’d had the same operation had snapped her tibia in half trying to walk on it, and died of the infection that came raging in afterwards. And without Anna our calcium supply had dried up.\\n\\n ‘What messages will you take?’ Irina said. ‘Translation for the dead?’\\n\\n ‘I’ve got a message for you, smart-aleck. Lisette and Karolina are coming out tomorrow, in broad daylight, because they’re not going to hide any more either. They’re going to be our delegation to the commander.’\\n\\n ‘Are they crazy?’ I whispered back.\\n\\n ‘No, we’ve done it before. We really did! We took a petition to the commander before this one, saying we refused to be operated on again. He didn’t pay any attention, but this one is such a weasel he always pretends to be polite – he makes a show of negotiating with us so he’ll look good to the Red Cross. And yesterday Lisette got six of us out! There were three trucks transferring people to other camps, and she got six other Rabbits to sneak on board – we cut all their numbers apart so that only the symmetrical ones were left, and then we mixed them up and sewed them on upside down and backwards. They’ll get more of us out today – they take hundreds of people to the satellite camps every day because there’s no damn room here. Lisette wanted me to go too, but Karolina wouldn’t let me because of my legs – it has to be people who can walk without looking like they’re dancing.’ She giggled. ‘Karolina wants me to go, but she wants to go with me – I need taking care of, right?’ \\n\\n","sourceLink":"https://allnovel.net/rose-under-fire-code-name-verity-2/page-32.html","bookId":2673,"book":{"id":2673,"title":"Rose Under Fire (Code Name Verity #2)","description":"Storyline: Rose Under Fire (Code Name Verity #2) \\n While flying an Allied fighter plane from Paris to England, American ATA pilot and amateur poet, Rose Justice, is captured by the Nazis and sent to Ravensbrück, the notorious women\u0027s concentration camp. Trapped in horrific circumstances, Rose finds hope in the impossible through the loyalty, bravery and friendship of her fellow prisoners. But will that be enough to endure the fate that\u0027s in store for her? \\n Elizabeth Wein, author of the critically-acclaimed and best-selling Code Name Verity, delivers another stunning WWII thriller. The unforgettable story of Rose Justice is forged from heart-wrenching courage, resolve, and the slim, bright chance of survival.\\n","cover":"https://allnovel.net/images/rose-under-fire-code-name-verity-2.jpg","author":"Elizabeth Wein","type":"Historical","source":"allnovel","link":"https://allnovel.net/rose-under-fire-code-name-verity-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 10:01:17 AM"}}
