{"id":66664,"no":39,"title":"Page 39","content":"Nick is married. He is married. Married to some other girl – he didn’t even wait till the war was over.\\n\\n All that time I was alive, all that time I was – all I’ve seen, all I’ve had to do – cartloads of skeletal dead women, gas chamber paint in my ears, Karolina and Irina fighting over my coat, the list of mutilated girls stuck in my head, crumbs of stale bread for Christmas dinner, that day of Strafstehen in the snow, twice Fünfundzwanzig – telling fairy stories about him rescuing us! We’d never even split up – he proposed to me on our last date! And he went and married someone else.\\n\\n And if I did come back,\\n\\n what in return could I offer to you,\\n\\n who used to make so free\\n\\n with my softness and kisses and verse\\n\\n as if it were your due?\\n\\n Imagine me\\n\\n on your doorstep – would you laugh in the old way\\n\\n and greet me lovingly:\\n\\n Hello, it’s been a long time,\\n\\n how are you today?\\n\\n There won’t be anything to say.\\n\\n I did stop dreaming he was touching my hair and all I dreamed about was bread. But he could have waited. He could have waited till the war was over.\\n\\n My gosh, how Różyczka would laugh.\\n\\n Fernande took away my camp clothes about a week ago. This morning she returned what she found in my pockets, all the pointless things I’d stuffed there in a panic before I left Ravensbrück: a couple of poems I’d managed to write down, a paper airplane decorated with a silly drawing of Lisette nitpicking my scalp in the pilot’s seat, a pencil stub. Irina’s airplane, Karolina’s drawing of Lisette. Nothing of Róża. And the half of Aunt Rainy’s hanky that Elodie embroidered for me with the blue rose and our flags and our initials.\\n\\n I can’t believe that this is all I get – a torn handkerchief and a drawing on half a piece of folded paper. That these scraps of garbage are all I have left of any of them. And there isn’t a thing I can do about it – maybe not ever.\\n\\n I’m not going to go home either.\\n\\n Part 3\\n\\n Nuremberg\\n\\n Craig Castle, Castle Craig, Scotland\\n\\n December 23, 1946\\n\\n I am thinking about that line from the first paragraph of the Declaration of Independence – the words they made me write at the Amercian Embassy last year to prove that I am really Rose: A decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.\\n\\n DARN IT. ‘Declare the causes.’ That is another way of saying, TELL THE WORLD.\\n\\n It is a year and a half since I got back from Germany and I haven’t really told the world. I have been fooling myself about it for a while. I gave the Rabbits’ names to the US Embassy. Olympia Review published most of my Ravensbrück poems – but not ‘Service of the Dead’, ‘Gas Leak’ or ‘The Ditch’, which the poetry editor, Sue Parker, thought were all just too nasty to print. It says in her letter: ‘We feel these are so grotesque that they detract from the lyrical sensitivity of your other poems.’ And I didn’t argue.\\n\\n To be fair to Parky, she called the other poems ‘magnificent’ and had the inspired idea of combining ‘The Subtle Briar’ with the counting-out rhyme of the Rabbits’ names. But it was easy going along with her editorial suggestions. I didn’t have to do anything except type them up for her. She forwarded all the nice letters that came in to the magazine afterwards, and she didn’t let me read the ones accusing me of ‘sensationalism’ and ‘false reporting’.\\n\\n When the Mount Jericho Rotary Club asked me to come and talk to them, I was able to say no because I live in Scotland now and it was too far for me to travel. But when the English Department of the University of Edinburgh got hold of a copy of the Olympia Review and wanted me to come read the poems aloud in one of their classes, I couldn’t do it. I couldn’t do it. I said I would, and I went, but I couldn’t do it. I couldn’t even stay in the classroom while someone else read them. The professor took me into his office and made me drink a glass of sherry while it was going on, and I went back in afterwards when it was over and they all applauded very soberly. I said thank you and then ran away while they were getting out of their seats, before anyone could talk to me about the poems.\\n\\n So much for telling the world.\\n\\n But I just couldn’t escape the ripples spread by the Olympia Review. The officials organising the trials against the Ravensbrück administration managed to track me down as well. They asked me to come be a witness at the first Ravensbrück tribunal in Hamburg, in Germany, which has just started. Of course, all this summer I was wolfing down the news of the international tribunal in Nuremberg, as the Allied governments tried and sentenced the high-ranking Nazi officials. If the invitation to the Ravensbrück trial had come a week earlier I’d have been nervous about it, but I’d probably still have said yes, of course I’ll come. Unfortunately I got the letter right after that Edinburgh University poetry reading fiasco. I said no. When I got Lisette’s letter a week later I’d already weaselled out of it.\\n\\n I have been feeling miserable about it ever since – I am a witness. I am a victim and a witness. And the Ravensbrück tribunals are being run by the British; so being an English-speaking witness, of English heritage, imprisoned while working for a civilian British organisation, makes me a valuable witness. I want to be a witness. I want to be responsible. I want to keep my promises to the people I loved whose lives were violated and ruined. But I have never spoken aloud to anyone in detail about what happened to me at Ravensbrück. I made a life-and-death promise that I would, and I am scared to do it.\\n\\n Also, at the Nuremberg tribunal they handed out a lot of death sentences. I want retribution for my friends, and for the millions like them that I don’t know about. But I am fearful of having a hand in anyone’s death sentence. It may be just punishment for what they did – it may be the only just punishment. And the sentencing won’t be my decision. But it seems like an empty victory to me, killing all the perpetrators. I want retribution, but so much more than that I just wish everything could be put right.\\n\\n I have always felt this way. Even before Ravensbrück. I put it in my ‘Battle Hymn of 1944’ poem:\\n\\n ‘Fight with realistic hope, not to destroy\\n\\n all the world’s wrong, but to renew its good.’\\n\\n Then I had the idea of doing a new story for Olympia. I wrote to Parky telling her about the poetry-reading fiasco, and my cowardice about the trial, and Lisette’s suggestion that even if I didn’t go to Hamburg, I should go along to watch the Nazi Doctors’ Trial in Nuremberg – and I offered to go as a journalist for Olympia. I wouldn’t have to talk to anyone; I could just sit in the gallery with the other reporters and listen and take notes. It would be relevant to my studies as a medical student – I could write a report for my university tutor as well as for Olympia. I could help to ‘tell the world’ from behind the mostly anonymous shields of my notebook and typewriter. Parky sent me the world’s most enthusiastic yes – she wired me money for a train ticket. So I went.\\n\\n Now I’m back, and everything’s changed. Everything!\\n\\n I’m not much of a journalist. But I didn’t get a chance to feel like an imposter at the Doctors’ Trial last week because Dr Alexander, the American medical expert, kept me so busy. The medical report for my tutor will be straightforward and mostly a matter of typing up my notes. The sizzling human interest story is harder to write, especially since I ended up sitting in court for one day only. I’ve got an idea for how to tell it though – how going to the Doctors’ Trial changed my mind about going to the Ravensbrück trial. I still don’t want to go and even if I am going now I feel kind of ashamed and embarrassed for being such a scaredy-cat about it in the first place, but I’ll use this story for Olympia as a chance to defend myself.\\n\\n I’m going to try writing a draft of it right here in my Ravensbrück notebook. It seems like the right place to do it. And that’s why Maddie gave it to me in the first place after all, to bribe me with nice paper. There’s enough room left because the Ravensbrück bit is all written from top to bottom and edge to edge of every page in absolutely minuscule writing. I don’t remember doing that on purpose – in the back of my mind I probably thought someone was going to take the paper away from me.\\n\\n I like the idea that if I draft this article here then the story will be complete and in one place, even if the last part – the part I am about to write – gets typed up later and published somewhere else.\\n\\n Kite Flying: four principles of flight\\n\\n (by Rose Justice)\\n\\n A pilot’s greatest challenge is not bad weather or low fuel or getting lost. It’s not even getting shot at. My greatest challenge is a friend who is afraid of flying.\\n\\n I got my high school diploma six months early because I had a job in the British Air Transport Auxiliary, ferrying aircraft for the Royal Air Force in the spring of 1944 just before the Allied invasion of Normandy. Before I went to Europe I decided I was going to take every one of my best friends from the girls’ varsity basketball team for a joyride in one of my dad’s Piper Cubs. It only has two seats, so this was a fun project, just me and my friends without my dad. We’d fly over their houses or over the lake where we swam in the summer, or west to see the state Capitol building, and they’d take pictures, and then we’d get my dad to take a picture of us standing together by the plane afterwards – laughing and windblown, arms around each other’s shoulders, looking very pleased with ourselves.\\n\\n It never occurred to me Polly would be any different from anybody else on the team. She didn’t say anything. She was probably trying hard to be brave. After all, everybody else had gone flying with me, and they’d all come back safely, bubbling over with enthusiasm and snapshots.\\n\\n So when Polly walked out to the plane with me, I didn’t even know anything was wrong until she sat down on the brown winter grass of the airfield and burst into tears.\\n\\n I thought she’d twisted her ankle!\\n\\n ‘Hey, what’s wrong?’\\n\\n ‘I won’t I won’t I won’t I won’t I won’t –’\\n\\n ‘Won’t what?’\\n\\n ‘I won’t get in that kite! I don’t want to go anywhere near it! I told you I didn’t want to come –’\\n\\n She had, sort of, but she’d made it sound like her mother didn’t want her to come.\\n\\n I knelt down next to her and put my hand on her shoulder. ‘Don’t worry! It’s not scary getting in, and there are shoulder straps. The cockpit shuts up tight just like a little car. It’s so beautiful in the air! If you close your eyes while we’re taking off –’\\n\\n My best friend Polly socked me in the eye.\\n\\n That might have been the biggest shock of my entire life up to that point. In a million years I wouldn’t have guessed that my best friend could possibly be so scared of something that she’d punch me in the face for trying to talk her into doing it.\\n\\n I burst into tears. Polly was already crying. After a moment she clapped her hands over her mouth and gasped, ‘Rosie – I’m so sorry! Gosh, we’re like second graders pulling each other’s hair! I just –’ \\n\\n","sourceLink":"https://allnovel.net/rose-under-fire-code-name-verity-2/page-39.html","bookId":2673,"book":{"id":2673,"title":"Rose Under Fire (Code Name Verity #2)","description":"Storyline: Rose Under Fire (Code Name Verity #2) \\n While flying an Allied fighter plane from Paris to England, American ATA pilot and amateur poet, Rose Justice, is captured by the Nazis and sent to Ravensbrück, the notorious women\u0027s concentration camp. Trapped in horrific circumstances, Rose finds hope in the impossible through the loyalty, bravery and friendship of her fellow prisoners. But will that be enough to endure the fate that\u0027s in store for her? \\n Elizabeth Wein, author of the critically-acclaimed and best-selling Code Name Verity, delivers another stunning WWII thriller. The unforgettable story of Rose Justice is forged from heart-wrenching courage, resolve, and the slim, bright chance of survival.\\n","cover":"https://allnovel.net/images/rose-under-fire-code-name-verity-2.jpg","author":"Elizabeth Wein","type":"Historical","source":"allnovel","link":"https://allnovel.net/rose-under-fire-code-name-verity-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 10:01:17 AM"}}
