{"id":66629,"no":4,"title":"Page 4","content":"I don’t know how Lady Beaufort-Stuart copes – I really don’t. She has got eight refugee children living with her – all boys, evacuated from Glasgow so they won’t be bombed (for the wedding they all wore kilts borrowed from the Beaufort-Stuarts). Before the wedding this rabble formed a chain across the church door and refused to let anyone in until the bridegroom paid them, which Jamie staunchly refused to do, arguing that if he could kick their soccer ball over the church, he was exempt from their entry fee – and he did it too, amid a huge amount of cheering and yelling. Maddie gave them each a sixpence anyway. Then they tried to carry her into the church, but her grandfather took over at that point and made her walk sedately down the aisle on his arm.\\n\\n Jamie’s family didn’t talk much about their dead. They were so happy to have something to celebrate – almost desperate with it. There were flowers and champagne after all. They have got an amazing rose garden, like the one at the Hotel Hershey, and it hasn’t been dug up for vegetables because they have so much ground that there aren’t enough gardeners to take care of it all. So their own garden is where the wedding roses came from. And of course Jamie brought the champagne back with him on one of his clandestine Special Duties trips.\\n\\n The church they were married in is part of the castle estate, a tiny crooked building built from local stone (the boys’ ball did not have to go very high to be kicked over the top of it). Maddie had white heather in her bouquet, and pink and yellow damask rosebuds. Jamie was in a kilt too, the same tartan as the eight kids, and his Royal Air Force tunic; Maddie wore her ATA uniform (so did I).\\n\\n Her grandfather brought a wine glass that had been his mother’s in Russia, and Maddie and Jamie used it, instead of the traditional Scottish loving cup, for the couple’s first drink together at the reception afterwards. Then they smashed it, on purpose, as per her grandfather’s instructions. It was not a Jewish wedding, but Maddie’s grandparents are Jewish and breaking the glass is part of the ceremony.\\n\\n Lady Beaufort-Stuart was rather shocked that Mr Brodatt had wanted them to break an antique Russian glass that had belonged to his mother, thousands of miles away and a century ago. And he said, ‘I do not want to wait for Hitler’s doodlebugs to get to it first.’\\n\\n Maddie did not throw her bouquet. There would have only been me to catch it anyway, and we both knew how I felt about that. Instead she left it below the family’s memorial plaque in the church, where her friend’s name is carved. The older boy’s name is not there yet, but the girl died last year. Her dates were carved there too. And it was her birthday. They got married on her birthday, August 12th.\\n\\n I like that. Because now they will have a reason to celebrate on that day, a new reason and a good one, instead of being miserable every year.\\n\\n They didn’t mention the dead girl on the day, but Maddie said something about her on the train on our way back. It was when we were admiring Maddie’s ring. It is French rose-gold from the nineteenth century, a small, square-cut ruby flanked with little triangles of tiny pearls. It belonged to Jamie’s great-grandmother, and was handed down the generations eventually to his sister, and now Jamie’s family have given it to Maddie.\\n\\n ‘I love it fiercely,’ she said. ‘Because it is a little bit of Julie as well as Jamie, and of their lovely mother, and I will have it with me always. Fifty years from now, if I live that long, it will be part of me. It is all of ours and they are part of me. And I love that it is French too – their mother’s family is French – they are all fighting for France as much as for Britain. Julie too –’\\n\\n Maddie shut up suddenly. But I got it, suddenly, and I knew that she’d meant me to get it – her friend died in France. She must have been a spy or a saboteur or something. Maddie is very discreet, but she is closer to that clandestine side of warfare than the other ATA pilots. She does a good bit of specialised taxi flying – like me taking Uncle Roger places, only Maddie’s passengers are incognito. I don’t ask who they are and I know she wouldn’t answer if I did.\\n\\n Her friend Julie’s name is on the family’s memorial stone in Scotland, but I know Julie’s not buried in that church. Maddie said she didn’t get a funeral.\\n\\n ‘Do you know how she died?’ I asked.\\n\\n ‘Oh yes,’ Maddie answered. ‘I do. “Killed in action” means we know for sure. But I’ve often thought it would be worse if I didn’t know – if there hadn’t been a fight, the Nazis would have shipped her off in the dark to a concentration camp and never told anyone – that would have been worse. It doesn’t seem possible, but it would have been worse. We would still not know what had happened to her, eight months later, and the war’s not over. How long till we’d have found out? Would anyone have ever found out?’\\n\\n I am making myself miserable thinking about it. I started writing in here because I would like to make Maddie a wedding poem. But it is hard when the wedding is in the middle of a war. Maddie is a Doodlebug Bride. Not for the ‘usual’ reasons, not because she and Jamie couldn’t hear their own vows over the rattling of approaching bombs, and not because we had to worry about whether she’d be able to run to a shelter in a wedding dress – we’d have worn our uniform slacks if we had worried about it, but the village of Castle Craig is very quiet! No, Maddie is a Doodlebug Bride because she spent part of the afternoon following her wedding day lying on the floor of a London bus hoping she wouldn’t get hit by a flying bomb.\\n\\n London is covered in broken glass. Glass and dust. You can tell where the bombs have fallen by the piles of glass, which get bigger and bigger until you get to a hole in the ground where a house or a store was. More piles of glass are banked against the buildings that are still standing, and there are little paths cleared on the sidewalks. I thought it was bad around Southampton, but London is just a wasteland of wreckage. The trees have all lost their leaves in bomb blasts so that it looks like winter. Houses with no roofs and no windows have signs on the door that say ‘Still occupied’ to stop people looting them.\\n\\n The train line down from Scotland to Southampton had been hit, so we got diverted to a different line and had to get off in London and take a bus to Charing Cross Station where we got on another train to try to go around the damage. The bus had no glass in the windows – they take the glass out on purpose – people would rather sit in the wind than risk windows exploding in their faces. Two V-1 flying bombs went over while we were on the bus, one of them passing close to the rooftops of the buildings – the driver just sped on. Not much else he could do, I guess! Anti-aircraft guns were racketing away too from somewhere pretty close by. Every single passenger on the bus, including me and Maddie, dove under the seats and lay there cowering.\\n\\n There was a small boy, no more than three years old, just across from me. All the time we were on the floor he was shouting in terror, over and over: ‘Not on a bus! Not on a bus! MUMMY MUMMY NOT ON A BUS!’\\n\\n His mother couldn’t do a thing – she just kept kissing him and kissing him – ‘Shh, shh.’ But he wouldn’t stop and it was more terrible to listen to than the clattering of the bomb as it passed over, terrible to hear such a little kid so frightened and not be able to do anything to make the fear go away. Because the thing he’s afraid of is real.\\n\\n Maddie was just as bad. It surprised me – she always seems so confident, and so much older than me. She lay there next to me with her arms clamped over her head, absolutely shaking, and sobbing too.\\n\\n When the bomb’s racket cut out we didn’t know if that was because we couldn’t hear it any more, or if the guns had got it, or if it was falling on us.\\n\\n ‘Count – count now –’ the young mother whispered to her kid. ‘All the way up to thirty and then you’ll be safe –’\\n\\n I had my arm round Maddie’s shoulders, but she was still cowering with her arms over her head. I looked up at the little boy, with my hair just brushing the grubby underneath of the bus bench. Now I stopped worrying about the stupid bomb and lay there willing this kid to make it up to thirty.\\n\\n ‘25 – 26 – 27 – 28 – 29 –’\\n\\n He got there at last, triumphant.\\n\\n ‘30!’\\n\\n Everybody on the bus burst out clapping.\\n\\n Then we all got up sheepishly and dusted ourselves off, because nothing had happened and we felt a little foolish lying on the floor while the bus sped through the empty Sunday streets.\\n\\n Maddie still had her corsage of tartan ribbon and white heather and rosebuds from yesterday pinned on her uniform – actually, it had been part of the ceremony, pinning the family tartan on her. The flowers were very crushed and wilted. As we sat down again, she muttered, ‘No kiddies for me till after we’ve won the war, I think. Not that it’s likely! We were both out like lights the second we fell into bed. Just so tired all the time, you know? Thirteen days on duty and only two off, Spitfires coming and going as fast as the workshops can spit ’em out.’\\n\\n I nodded. I’d been so tired I’d slept in my uniform. Well, I’d taken off my hose and tunic anyway. American slob!\\n\\n ‘And Jamie’s away to – well, he’s away now anyway,’ Maddie finished wistfully.\\n\\n We made it safely to the train at Charing Cross – it is awful going in and out of Charing Cross, when you know perfectly well it’s the dead centre of London and probably the bullseye the Germans are targeting. But for me the most frightening thing happened after we got off the train at Hamble Station. We were walking along the branch line that takes trains down to the airfield except on Sundays (yes, we were walking back to the airfield on Sunday evening, because technically I was working that day and it would still be light for another five hours), and there were a couple of kids leaning over the wall by the tracks and yelling. They straightened up guiltily when they noticed us, but their pal who’d scaled the wall to get to the other side of the tracks didn’t realise we were there and gave himself away by shouting to his friends.\\n\\n ‘Oi, you lot – I’ve got another bit, but I need Rob’s knife back to cut these wires!’\\n\\n The kids froze. We probably looked scarily official in our uniforms, especially Maddie with her First Officer’s gold stripes. The boys took a couple of steps back. One of them leaned over the wall and tried to shush his pal. And that made me look over the side of the wall to see what the other boy was doing.\\n\\n He was taking apart a bomb.\\n\\n Scout’s honour, that’s what he was doing. It was a flying bomb that hadn’t gone off. Sometimes they run out of fuel prematurely and just glide down, and occasionally they just don’t go off. It was much smaller than a Tempest or even a Spitfire, really no more than a bomb with wings. It had taken a couple of saplings down as it ploughed into the strip of waste ground at the edge of the railway, and now it was sitting on its belly by the train tracks, one wing missing and a long strip of the fuselage ripped open where it had connected with the trees. All of its innards were lying exposed to view and ready for small boys to come along and mop up souvenirs. \\n\\n","sourceLink":"https://allnovel.net/rose-under-fire-code-name-verity-2/page-4.html","bookId":2673,"book":{"id":2673,"title":"Rose Under Fire (Code Name Verity #2)","description":"Storyline: Rose Under Fire (Code Name Verity #2) \\n While flying an Allied fighter plane from Paris to England, American ATA pilot and amateur poet, Rose Justice, is captured by the Nazis and sent to Ravensbrück, the notorious women\u0027s concentration camp. Trapped in horrific circumstances, Rose finds hope in the impossible through the loyalty, bravery and friendship of her fellow prisoners. But will that be enough to endure the fate that\u0027s in store for her? \\n Elizabeth Wein, author of the critically-acclaimed and best-selling Code Name Verity, delivers another stunning WWII thriller. The unforgettable story of Rose Justice is forged from heart-wrenching courage, resolve, and the slim, bright chance of survival.\\n","cover":"https://allnovel.net/images/rose-under-fire-code-name-verity-2.jpg","author":"Elizabeth Wein","type":"Historical","source":"allnovel","link":"https://allnovel.net/rose-under-fire-code-name-verity-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 10:01:17 AM"}}
