{"id":89800,"no":42,"title":"Page 42","content":"She couldn’t believe they were having this conversation. “Nick, my brother trusted you to keep me safe. You’ve done that. You don’t need to tell him about last night.”\\n\\n Astonishment had given way to anger and embarrassment, and she was so upset tears came to her eyes. She vowed she’d die before she cried in front of him again.\\n\\n “I haven’t done anything I’m ashamed of,” she insisted. “And you promised me you wouldn’t have any regrets.”\\n\\n “Yeah, well, I lied.”\\n\\n She jabbed him in the shoulder. “If you feel so guilty, then go to confession.”\\n\\n She was glaring at him now, and all he could think about was how pretty she was when she was angry. He wouldn’t have been surprised if sparks flew out of her eyes.\\n\\n “I thought about going to confession,” he admitted. “And then I pictured Tommy’s fist coming through that grille, and I thought, no, that wouldn’t be right. I can’t tell him that way. It should be face-to-face.”\\n\\n She put her hand to her brow to try to stop the pounding. “I didn’t mean for you to go to confession to Tommy,” she said. “Go to another priest.”\\n\\n “Don’t get into a lather.”\\n\\n “You have nothing to feel guilty about,” she cried out. “I seduced you.”\\n\\n “No, you didn’t.”\\n\\n “I most certainly did.”\\n\\n “All right,” he said. “Then tell me, how’d you do it?”\\n\\n “I made you feel sorry for me. I cried.”\\n\\n He rolled his eyes. “I see,” he drawled. “So I made love to you out of pity? Is that the way you see it?”\\n\\n She seriously contemplated getting out of the car and walking back to town.\\n\\n “Let me ask you something,” she said then, trying to make him realize how unreasonable and stubborn he was being. “You have slept with other women, haven’t you?”\\n\\n “Yes, I have,” he agreed. “You want the number?”\\n\\n “No,” she countered. “I want to know what happened after you had sex with them. Did you feel compelled to tell their mothers?”\\n\\n He laughed. “No, I didn’t.”\\n\\n “Well then?”\\n\\n “Like I said before, honey. You’re different.”\\n\\n She folded her arms across her chest and stared straight ahead. “I’m not talking about this any longer.”\\n\\n “Laurant, look at me. How about if I promise you something?”\\n\\n “Why bother? You don’t keep your promises.”\\n\\n “Making me promise I wouldn’t have any regrets was just plain stupid, so I don’t think that should count. I’ll keep this promise,” he assured her. “If he doesn’t ask, I won’t tell. I won’t say anything to your brother for a couple of days. That should give you enough time to calm down.”\\n\\n “Not good enough,” she countered. “Since you’re compelled to be a blabbermouth, you have to wait until you’re back in Boston.”\\n\\n “I should tell him face-to-face so, if he wants to punch me, he can.”\\n\\n “Boston,” she gritted out between clenched teeth.\\n\\n He finally relented. They got back on the road and headed for home again.\\n\\n “Nick?”\\n\\n “Yes?”\\n\\n He sounded downright cheerful now. He was the most exasperating man.\\n\\n “Any other bombshells you want to drop on me before we get home?”\\n\\n “Yeah, come to think of it, there is one more thing I should probably mention.”\\n\\n She mentally braced herself. “What is it? No, let me guess. You want to put it in the paper.”\\n\\n He laughed. “No.”\\n\\n “Then what?” Now she sounded cranky.\\n\\n “When I go back to Boston . . .”\\n\\n “Yes?”\\n\\n “You’re going with me.”\\n\\n “Why?”\\n\\n “Because I’m not letting you out of my sight until I’m convinced we’ve got the right guy under lock and key.”\\n\\n “For how long?”\\n\\n “As long as it takes. Until I’m satisfied.”\\n\\n “I can’t do that.”\\n\\n “You’re going to,” he countered.\\n\\n “I’ll go with you to Boston while the anniversary is going on here, but then I have to come back. I have to find a place to live, open my store, make some decisions about what I’m going to do with the rest of my life. I need some time to sort things out.”\\n\\n “I want to talk to you about something else while I’m thinking of it.”\\n\\n “Yes?”\\n\\n “You aren’t in love with me.”\\n\\n She blinked. “I’m not?”\\n\\n “No,” he said emphatically. “You just think you are. You’re confused,” he explained. “You’ve been under a hell of a lot of stress, and we’ve been tied together.”\\n\\n She knew where he was headed. “I see.”\\n\\n “Transference.”\\n\\n “I’m sorry?”\\n\\n “It’s called transference. It’s kind of like a patient falling in love with her doctor. It’s not real,” he stressed.\\n\\n “That’s what I’m suffering from?”\\n\\n “Not suffering, honey,” he said. “But I do think you’ve confused gratitude with love.”\\n\\n She pretended to ponder the possibility for a long minute and then said, “I believe you might be right.”\\n\\n She swore that if he looked the least bit relieved, she would do him bodily harm.\\n\\n “You do?” He sounded a little stunned.\\n\\n “Yes, I do,” she said more forcefully.\\n\\n He wanted confirmation. “So you realize you don’t love me.”\\n\\n No, she thought. I realize that telling you I love you terrifies you because it means commitment and taking a chance.\\n\\n “That’s exactly what I realize,” she told him. “It’s that transference thing all right. I was confused, but I’m not any longer. Thank you for clearing it up for me,”\\n\\n He shot her a hasty glance. “That was pretty damn quick, wasn’t it?”\\n\\n “When you’re right, you’re right.”\\n\\n “That’s it?” He was suddenly furious with her and didn’t care that it showed. Damn it, she had told him she loved him, and after a one-minute argument, she caved. What the hell kind of love was that? “That’s all you have to say?”\\n\\n “No, actually there is just one more thing I’d like to mention.”\\n\\n “Yeah? What’s that?”\\n\\n “You’re an idiot.”\\n\\n CHAPTER 31\\n\\n Laurant used Nick’s phone to call Michelle and give her the bad news about the bridesmaid’s dress.\\n\\n Michelle answered on the first ring. “Where are you? Are you all right? I heard about the fire, and Bessie Jean told Mother you left with Nick, but no one knew where you went. My God, can you believe Steve Brenner turned out to be such a pervert? Did you know he’d hidden a camera in your house?”\\n\\n Laurant patiently answered her questions and then told her about the dress. Michelle took the news surprisingly well. “If only you’d left the dress with Rosemary,” she said, referring to the dressmaker who had fitted the gown for her.\\n\\n “You told me to pick it up, remember?”\\n\\n “Yes, but when have you ever listened to me?”\\n\\n “Michelle, what are we going to do? Should I just bow out?”\\n\\n “No way,” Michelle cried. “You can wear something of mine.”\\n\\n “You’ve got to be joking. You’re tiny. Nothing of yours would fit me.”\\n\\n “Listen, Laurant. I’m stuck with Christopher’s two insipid cousins in my wedding, but I’m not letting either one of them be my maid of honor. Are you or are you not my best friend?”\\n\\n “Of course I am,” she said. “But—”\\n\\n “Then improvise. I don’t care what you wear. Come na*ed if you want. No, you better not do that. You’d cause a riot,” she said. “Christopher wouldn’t remember his vows,” she added with a laugh.\\n\\n “I’ll find something,” she promised, wondering how in God’s name she was going to have time to shop.\\n\\n “You’ll still be here at four?”\\n\\n “Give me at least until five.”\\n\\n “Was the dress destroyed by the fire? Maybe the dry cleaners could repair it if it wasn’t burned up.”\\n\\n “No,” she answered. “It’s gone.”\\n\\n “The town’s in an uproar over Brenner,” she said then. “How stupid was he to torch his own house? Did you know he’d brow-beaten poor Mrs. Talbot into selling it to him. He didn’t have any insurance either. Did you know that? The pervert paid cash.”\\n\\n “How did you find all that out?” she asked.\\n\\n “Mother’s nosy friends. Little Lorna’s called Mother three times in the past hour to give more information.”\\n\\n “Steve didn’t start the fire,” Laurant said. “Lonnie did. I guess he didn’t know Steve had bought the house.”\\n\\n “That wasn’t in the paper,” Michelle exclaimed. “The sheriff ’s son was in on it?”\\n\\n “Yes,” Laurant answered. “There’s a lot more too, Michelle, but I can’t go into it now.”\\n\\n “You can tell me everything while we get dressed,” she said. “And I mean everything. I’ve got to hang up now. I’m getting my nails done. I’ll see you at five, and please, stop worrying. It’s going to be fine. Nothing can ruin this day for me, and do you know why?”\\n\\n “Because you’re marrying the man of your dreams?”\\n\\n “That too.”\\n\\n “What were you going to say?”\\n\\n “That no matter what, I’m going to have hot incredible sex tonight. Uh-oh, Mom’s glaring at me. Got to go.”\\n\\n Laurant handed the phone back to Nick. “Let’s go by the house first,” she said. “If the fire didn’t reach the second floor, maybe I can find something suitable to wear in the wedding.”\\n\\n “Your clothes are going to smell like smoke,” he said. “But the dry cleaners could probably clean the dress before five.”\\n\\n She mentally went through her wardrobe of once-upon-a-time clothes. That’s what she called them, the beautiful designer dresses and suits that the head of the European modeling agency had given to her, trying to entice her to work for them. The ice blue Versace might do, or the peach Armani. Both of the formal dresses were long, and her high-heeled sandals would work with either one. If the clothes had been destroyed in the fire, she didn’t know what she could wear. The local ladies’ dress shop didn’t carry formal attire.\\n\\n “What else do you have to do before the wedding?” Nick asked.\\n\\n “Find a place to stay tonight,” she said. “I’ll wait until tomorrow to pack up whatever I can salvage from the house. It’s too overwhelming to think about today. We have to get a suit for you to wear to the wedding,” she added. “Did you bring one with you?”\\n\\n “Just my navy blazer and a couple of pairs of dress pants.”\\n\\n “That will work. We’ll drop them at the cleaners too.” She sounded weary.\\n\\n “Cheer up, honey. It’s going to get better.”\\n\\n She tried to think of something optimistic. “It’s a nice day for a wedding, isn’t it?”\\n\\n “Was your friend upset about the dress?”\\n\\n “No,” Laurant replied. She smiled then. “Michelle doesn’t get upset about things like that. She told me nothing could ruin today for her.”\\n\\n The phone rang, but it wasn’t Morganstern, as Nick had hoped. Noah was on the line, wanting to know when he and Laurant would be coming to the abbey.\\n\\n “Is Tommy worried?”\\n\\n “No,” Noah answered. “He just wants to know if we should hang around or not.”\\n\\n “We’ll be there in about an hour. Make him stay put.”\\n\\n Laurant was getting hungry, but she didn’t want to take time to eat. There was so much to get accomplished before tonight, and it was already going on noon.\\n\\n They reached Holy Oaks and wound their way down the quiet streets to her house.\\n\\n “You know what Michelle told me? Lonnie didn’t make the newspaper. She thought Steve Brenner set the fire.”\\n\\n “Farley told me he would pick him up and take him to Nugent,” Nick said. “He and Brenner can share a cell.”\\n\\n “You wish you were there, don’t you?”\\n\\n He glanced at her as he admitted, “Yeah, I do. I’d love to sit in on the interrogation. Look Brenner in the eyes. Then I’d know for sure.”\\n\\n “That he’s the unsub.”\\n\\n “No, that he isn’t.”\\n\\n “I want you to be wrong.”\\n\\n “I know you do.” He sounded sympathetic.\\n\\n “Until last night, I never would have believed that Steve could be a Peeping Tom,” she said.\\n\\n “That’s because you hadn’t seen the dark side of good old Steve.”\\n\\n “I certainly saw it last night. His face was contorted with hate, and the venom spewing out of his mouth shocked me. I think he is capable of anything, even murder. You know what strikes me as odd though?”\\n\\n “What’s that?”\\n\\n “Steve’s always been very uptight, around me anyway. He’s very controlling, or organized, as you would call him. Always planning,” she added with a nod. “He was pretty smooth the way he manipulated the shop owners into selling. He’d purchased five stores before the town found out what he was up to. He was sneaky and very clever, wouldn’t you agree?”\\n\\n “So?”\\n\\n “He had to have known from reputation alone how volatile and unpredictable Lonnie was. Why would he involve him?”\\n\\n “Maybe he thought he could use him as his scapegoat.”\\n\\n “Maybe,” she agreed. “How did Steve get in the house?”\\n\\n “He came in through the back door. He broke the glass, reached in, and unlocked the dead bolt. It was sloppy,” he added.\\n\\n “I think Lonnie was looking for a way in through a window.”\\n\\n “You told me he was on the roof.”\\n\\n “I heard him outside the bathroom window.”\\n\\n “But you didn’t see him, did you?”\\n\\n “No,” she answered. “He could have been checking to make sure no one was home. He didn’t see me. I dropped to the floor the second I saw the light.” \\n\\n","sourceLink":"https://allnovel.net/heartbreaker-buchanan-renard-1/page-42.html","bookId":1835,"book":{"id":1835,"title":"Heartbreaker (Buchanan-Renard #1)","description":"Storyline: Bless me father, for I will sin... \\n In the still shadows of the confessional, a madman tauntingly reveals his plan for a murder he is going to commit, pulling Father Thomas Madden into a twisted game by disclosing his next intended victim: Tom\u0027s sister, Laurant. In a frantic race to protect her, Tom calls upon his best friend, elite FBI agent Nick Buchanan, to track the predator who is closing in on Laurant. Now, as an electrifying attraction grows between Laurant and Nick, so does the danger -- and one false move will cost both of them everything that matters. \\n Let New York Times bestselling author Julie Garwood take you on a thrilling excursion into the soaring heights -- and the darkest impulses -- of the human heart.\\n","cover":"https://allnovel.net/images/heartbreaker-buchanan-renard-1.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/heartbreaker-buchanan-renard-1.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:36:50 PM"}}
