{"id":34453,"no":1,"title":"PREFACE.","content":"A Preface to a book on the History of English Literature is apt to be an apology, for a writer must be conscious of his inability to deal with a subject so immense and so multiplex in its aspects. This volume does not pretend to be an encyclop?dia of our literature; or to include all the names of authors and of their works. Selection has been necessary, and in the fields of philosophy and theology but a few names appear. The writer, indeed, would willingly have omitted not a few of the minor authors in pure literature, and devoted his space only to the masters. But each of these springs from an underwood, as it were, of the thought and effort of men less conspicuous, whom it were ungrateful, and is practically impossible, to pass by in silence. Nevertheless the attempt has been made to deal most fully with the greatest names. The author\u0027s object has been to arouse a living interest, if it may be, in the books of the past, and to induce the reader to turn to them for himself. Scantiness of space forbids the presentation of extracts; for poetry there is perhaps no better selection than that of the Oxford Book of Verse by Sir Arthur Quiller-Couch.[1] For prose, the[Pg vi] Anthologies of Mrs. Barnett and Mrs. Dale may be recommended.[2] It is unhappily the fact that the works of a majority of the earlier authors are scarcely accessible except in the publications of learned societies or in very limited editions; but from Chaucer onwards the Globe Editions are open to all; and the great Cambridge \"History of English Literature\" is invaluable as a guide to the Bibliography. It is better to study even a little of the greatest authors than to read many books about them. If the writer should perchance succeed in bringing any readers to the works of the immortals his purpose will be fulfilled But readers, like poets and anglers, are \"born to be so\"; and when born under a fortunate star do not need to be allured or compelled to come into the Muses\u0027 paradise. That sins of commission as well as of omission will be discovered the author cannot doubt, for through much reading and writing they that look out of window are darkened, and errors come.","sourceLink":"http://novel.tingroom.com/jingdian/1999/57127.html","bookId":665,"book":{"id":665,"title":"History of English Literature","description":"简介： A Preface to a book on the History of English Literature is apt to be an apology, for a writer must be conscious of his inability to deal with a subject so immense and so multiplex in its aspects....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1999","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
