{"id":29905,"no":3,"title":"Chapter 3","content":"\"Twenty minutes to blastoff,\" Bert reported. \"Right,\" Kevin acknowledged absently. He studied taped data moving in by radio facsimile from the mammoth electronic computer on Earth. \"Our orbit\u0027s true,\" he said with satisfaction and wiped a sweaty palm on his trousers. \"Get the time check, Bert.\" Beeps from the Naval Observatory synchronized with the space station chronometer. \"Alert Kramer.\" \"He\u0027s leaving the airlock now,\" Bert said. From the intercom, Morrow listened to periodic reports from crew members as McKelvie and Gordon progressed in their tour. \"Mr. Morrow?\" \"Right.\" \"This is Adams in Section M. The senator and Gordon have been in the line chamber for 10 minutes.\" \"Boot \u0027em out,\" Kevin said crisply. \"Blastoff in 15 minutes.\" \"That machinery controls the safety lines,\" Bert said. Kevin looked up with a puzzled frown, but turned back to watch Kramer creeping along a mooring line to the moon ship. A group of tugmen helped the space-suited figure into the rocket, dogged shut the hatch and cleared back to the station rim. \"Station to Kramer,\" on the radio, \"are you ready?\" \"All set,\" came the steady voice, \"give me the word.\" \"All right. Five minutes.\" Kevin turned to the intercom. \"Release safety lines.\" In the weightlessness of space the cables retained their normal rigid line from the rim of the station to the rocket. They had been under no strain. Their shape would not change until they were reeled in. \"Two minutes,\" Morrow warned. Tension grew as Anderson began the slow second count. The hatch opened. McKelvie and Gordon entered the control room. No one noticed it. \"Five ... four ... three ... two ... one ...\" A gout of white fire jabbed from the stern of the rocket. Slowly the ship moved forward. Morrow watched tensely, hands gripping a safety rail. Then his face froze in a mask of disbelief and horror. \"The lines!\" he shouted. \"The safety lines fouled!\" He fell sprawling as the space station lurched heavily, tipped upward like a giant platter under the inexorable pull of the moon rocket. Kevin scrambled back to the viewport, the shriek of tortured metal in his ears. Horror-stricken, he saw the taut cables that had failed to release. Then a huge section of nylon, aluminum and rubber ripped out of the station wall, was visible a second in the rocket glare, and vanished. Escaping air whistled through the crippled structure. Pressure dropped alarmingly before the series of automatic airlocks clattered reassuringly shut. Kevin\u0027s hand was bleeding. He staggered with the frightening new motion of the space station. Gordon and the senator had collapsed against a bulkhead. McKelvie\u0027s pale face twisted with fear and amazement. Blood streaked down the pink curve of his forehead. Individual station reports trickled through the intercom. Miraculously, the bulk of the station had escaped damage. \"Line chamber\u0027s gone,\" Adams reported. \"Other bulkheads holding, but something must have jammed the line machines. They ripped right out.\" \"Get repair crews in to patch leaks,\" Morrow shouted. He turned frantically to the radio. \"Station to Moonbeam. Kramer! Are you all right?\" He waited an agonizing minute, then a scratchy voice came through. \"Kramer, here. What the hell happened? Something gave me a terrific yaw, but the gyro pulled me back on course. Fuel consumption high. Otherwise I\u0027m okay.\" \"You ripped out part of the station,\" Kevin yelled. \"You\u0027re towing extra mass. Release the safety lines if you can.\" The faint answer came back, garbled by static. Another disaster halted a new try to reach him. With a howling rumble, the massive gyroscope case in the bulkhead split open. The heavy wheel, spinning at 20,000 revolutions per minute, slowly and majestically crawled out of its gimbals; the gyroscope that stabilized the entire structure remained in its plane of revolution, but ripped out of its moorings when the station was forcibly tilted. Spinning like a giant top, the gyro walked slowly across the deck. McKelvie and Gordon scrambled out of its way. \"It\u0027ll go through!\" Bert shouted. Kevin leaped to a chest of emergency patches. The wheel ripped through the magnesium shell like a knife in soft cheese. A gaping rent opened to the raw emptiness of space, but Morrow was there with the patch. Before decompression could explode the four creatures of blood and bone, the patch slapped in place, sealed by the remaining air pressure. Trembling violently, Kevin staggered to a chair and collapsed. Silence rang in his ears. Anderson gripped the edge of a table to keep from falling. Kevin turned slowly to McKelvie and Gordon. \"Come here,\" he said tonelessly. \"Now see here, young man—\" the senator blustered. \"I said come here!\" The two men obeyed. The commander\u0027s voice held a new edge of steel. \"You were the last to leave the line control room,\" he said. \"Did you touch that machinery?\" Gordon\u0027s face was the color of paste. His mouth worked like a suffocating fish. McKelvie recovered his bluster. \"I\u0027m a United States senator,\" he stuttered, \"I\u0027ll not be threatened....\" \"I\u0027m not threatening you,\" Kevin said, \"but if you fouled that machinery to assure your prediction about the rocket, I\u0027ll see that you hang. Do you realize that gyroscope was the only control we had over the motion of this space station? Whatever it does now is the result of the moon rocket\u0027s pull. We may not live to see that rocket again.\" As though verifying Morrow\u0027s words, the lights dimmed momentarily and returned to normal brilliance. A frightened voice came from the squawkbox. \"Hey, chief! This is power control. We\u0027ve lost the sun!\" Anderson looked out the port, studied the slowly wheeling stars. \"Mother of God,\" he breathed. \"We\u0027re flopping ... like a flapjack over a stove.\" And the power mirrors were on only one face of the space station, mirrors that collected the sun\u0027s radiation and converted it to power. Now they were collecting nothing but the twinkling of the stars. The vital light would return as the station continued its new, awkward rotation, but would the intermittent exposure be sufficient to sustain power? \"Shut down everything but emergency equipment,\" Morrow directed. \"When we get back on the sun, soak every bit of juice you can into those batteries.\" He turned to Gordon and McKelvie. \"Won\u0027t it be interesting if we freeze to death, or suffocate when the air machines stop?\" Worry replaced anger as he turned abruptly away from them. \"We\u0027ve got a lot of work to do, Bert,\" he said crisply. \"See if you can get White Sands.\" \"It\u0027s over the horizon, I\u0027ll try South Africa.\" Anderson worked with the voice radio but static obliterated reception. \"Here comes a Morse transmission,\" he said at last. Morrow read slowly as tape fed out of the translator: \"Radar shows moon rocket in proper trajectory. Where are you?\" The first impulse was to dash to the viewport and peer out. But that would be no help in determining position. \"Radar, Bert,\" he whispered. Anderson verniered in the scope, measuring true distance to Earth\u0027s surface. He read the figure, swore violently, and readjusted the instrument. \"It can\u0027t be,\" he muttered at last. \"This says we\u0027re 865 miles out.\" \"365 miles outside our orbit?\" Morrow said calmly. \"I was afraid of that. That tug from the Moonbeam not only cart-wheeled us, it yanked us out.\" He snatched a sheet of graph paper out of a desk drawer and penciled a point. \"Give me a reading every 10 seconds.\" Points began to connect in a curve. And the curve was something new. \"Get Jones from astronomy,\" Kevin said at last. \"He can help us plot and maybe predict.\" When the astronomer arrived minutes later, the space station was 1700 miles above the Earth, still shearing into space on an ascending curve. \"Get a quick look at this, Jones,\" Kevin spoke rapidly. \"See if you can tell where it will be two hours from now.\" The astronomer studied the curve intently as it continued to grow under Kevin\u0027s pencil. \"It may be an outward spiral,\" he said haltingly, \"or it could be a ... parabola.\" \"No!\" Bert protested. \"That would throw us into space. We couldn\u0027t—\" \"We couldn\u0027t get back,\" Kevin finished grimly. \"There\u0027d better be an alternative.\" \"It could be an ellipse,\" Jones said. \"It must be an ellipse,\" Bert said eagerly. \"The Moonbeam couldn\u0027t have given us 7000 mph velocity.\" Abruptly the lights went out. The radar scope faded from green to black. Morrow swore a string of violent oaths, realizing in the same instant that anger was useless when the power mirrors lost the sun. He bellowed into the intercom, but the speaker was dead. Already Bert was racing down the tube to the power compartment. Minutes later, the intercom dial flickered red. Morrow yelled again. \"You\u0027ve got to keep power to this radar set for the next half-hour. Everything else can stop, even the air machines, but we\u0027ve got to find out where we\u0027re going.\" The space station turned again. Power resumed and Kevin picked up the plot. \"We\u0027re 6000 miles out!\" he breathed. \"But it\u0027s flattening,\" Jones cried. \"The curve\u0027s flattening!\" Bert loped back into the control room. Jones snatched the pencil from his superior. \"Here,\" he said quickly, \"I can see it now. Here\u0027s the curve. It\u0027s an ellipse all right.\" \"It\u0027ll carry us out 9600 miles,\" Bert gasped. \"No one\u0027s ever been out that far.\" \"All right,\" Morrow said. \"That crisis is past. The next question is where are we when we come back on nadir. Bert, tell the crew what\u0027s going on. Jones, you can help me. We\u0027ve got to pick up White Sands and get a fuel rocket up here to push.\" \"Good Lord, look at that!\" Jones breathed. He stared out the port. The Earth, a dazzling huge globe filling most of the heavens, swam slowly past the plastic window. It was the first time they had been able to see more than a convex segment of oceans and continents. Kevin looked, soberly, and turned to the radio. The power did not fail in the next crazy rotation of the station. \"There\u0027s the West Coast.\" Kevin pointed. \"In a few minutes I can get White Sands, I hope.\" Jones had taken over the radar plot. At last his pencil reached a peak and the curve started down. The station had reached the limit of its wild plunge into space. \"Good,\" Kevin muttered. \"See if you can extrapolate that curve and get us an approximation where we\u0027ll cut in over the other side.\" The astronomer figured rapidly and abstractedly. \"May I remind you young man,\" McKelvie\u0027s voice boomed, \"you have a United States senator aboard. If anything happens—\" \"If anything happens, it happens to all of us,\" Kevin answered coldly. \"When you\u0027re ready to tell me what did happen, I\u0027m ready to listen.\" Silence. \"White Sands, this is Station I. Come in please.\" Kevin tried to keep his voice calm, but the lives of 90 men rode on it, on his ability to project his words through the crazy hash of static lacing this part of space from the multitude of radio stars. A power rocket with extra fuel was the only instrument that could return the space station to its normal orbit. That rocket must come from White Sands. White Sands did not answer. He tried again, turned as an exclamation of dismay burst from the astronomer. Morrow bent to look at the plotting board. Jones had sketched a circle of the Earth, placing it in the heart of the ellipse the space station was drawing around it. From 9600 miles out, the line curved down and down, and down.... But it did not meet the point where the station had departed from its orbit 500 miles above Earth\u0027s surface. The line came down and around to kiss the Earth—almost. \"I hope it\u0027s wrong,\" Jones said huskily. \"If I\u0027m right, we\u0027ll come in 87 miles above the surface.\" \"It can\u0027t!\" Morrow shouted in frustration. \"We\u0027ll hit stratosphere. It\u0027ll burn us—just long enough so we\u0027ll feel the agony before we die.\" Jones rechecked his figures and shook his head. The line was still the same. Each 10 seconds it was supported by a new radar range. The astronomer\u0027s lightning fingers worked out a new problem. \"We have about 75 minutes to do something about it,\" he said. \"We\u0027ll be over the Atlantic or England when it happens.\" \"Station I, this is....\" The beautiful, wonderful voice burst loud and clear from the radio and then vanished in a blurb of static. \"Oh God!\" Kevin breathed. It was a prayer. \"We hear you,\" he shouted, procedure gone with the desperate need to communicate with home. \"Come in White Sands. Please come in!\" Faintly now the voice blurred in and out, lost altogether for vital moments: \"... your plot. Altiac computer ... your orbit ... rocket on standby ... as you pass.\" \"Yes!\" Kevin shouted, gripping the short wave set with white fingers, trying to project his words into the microphone, across the dwindling thousands of miles of space. \"Yes. Send the rocket!\" \"Can they do it?\" Jones asked. \"The rocket, I mean.\" \"I don\u0027t know,\" Kevin said. \"They\u0027re all pre-set, mass produced now, and fuel is adjusted to come into the old orbit. They can be rigged, I think, if there\u0027s enough time.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3073/84886.html","bookId":981,"book":{"id":981,"title":"Slow Burn","description":"简介： Tell \u0027em to look sharp, Bert. This pickup\u0027s got to be good. Kevin Morrow gulped the last of his coffee and felt its bitter acid gurgle around his stomach. He stared moodily through the plastic port where the spangled skirt of stars glittered against...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3073","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
