{"id":101881,"no":8,"title":"Page 8","content":"\"It was just a kiss.\" \"You said that three times already. Would you turn off that light?\" Sarah plumped up a pillow behind her, and tucked the coverlet firmly over her legs before sitting back. \"A perfectly innocent kiss!\" \"Honey, there was nothing innocent about that kiss,\" she said with a knowing look. I stomped over to the light she had left burning on the desk and turned it off, feeling awkward and unsure of myself. I don\u0027t know why I felt compelled to explain that the kiss Theo and I shared was not what it seemed, but there I was, wringing my hands as I tried to sort through my emotions and thoughts. \"I find him physically attractive even though he\u0027s got some issues,\" I explained. \"There\u0027s nothing wrong with a healthy libido.\" \"Nothing at all, especially when the recipient of your attentions is a gorgeous angel. I looked up nephilim while you were occupied with Theo. That\u0027s what a nephilim is, you know. Kind of a sub-angel, the result of a union between - \" \"Oh, I know all about that,\" I said, waving my hands around for a moment before I was aware of what I was doing. I am not at all the hand-waving sort of person. \"It\u0027s part of this tale he spun me. That\u0027s neither here nor there - what I want to know is what is going to come of a relationship with a lunatic!\" \"I thought you said it was just your libido?\" \"It is!\" I shoved the chair aside just because I could. \"But you know me - I don\u0027t do casual sex, so if things progress beyond kissing, I\u0027m going to end up in a relationship. With a madman!\" \"Theo isn\u0027t a madman,\" Sarah said calmly, picking up the book she\u0027d brought to read on the vacation. \"Well, maybe not mad by the strictest definition of the word, but you have to admit that he\u0027s not normal.\" \"Of course he isn\u0027t. He\u0027s immortal. Are you done trying to convince yourself that he\u0027s not handsome as sin, and twice as delicious?\" \"I did not - oh, you\u0027re impossible!\" I said loudly. \"And speaking of that, you sure changed your tune quick enough.\" \"What do you mean?\" \"Yesterday you were positively drooling over Theo.\" Sarah looked surprised for a moment. \"Don\u0027t be ridiculous - I\u0027m happily married, which you know.\" \"That didn\u0027t stop you from ogling Theo yesterday.\" I refused to examine why it bothered me that she had ogled him. It couldn\u0027t possibly be important. \"Oh, that was before,\" she said, returning to her book as she waved a dismissive hand toward me. \"Before what?\" \"Before Theo explained he wasn\u0027t for me.\" I sat on the chair, staring at Sarah, confused by her calm acceptance of the short-lived lust she had felt for Theo. \"Aren\u0027t you the least bit disconcerted about the fact that Theo interested you? Should happily married women feel that sort of thing?\" \"They should if the man in question is a nephilim.\" She sighed at my puzzled look. \"I thought you knew about nephilims? Didn\u0027t Theo tell you that they have an effect on mortal women?\" \"No, he didn\u0027t.\" I frowned. \"Ah. Well, that\u0027s why I initially fell victim to his attractive self. He dismissed the effect once he realized I was being affected by it.\" I shoved myself out of the chair and stalked to the far side of the room. \"He didn\u0027t dismiss it for me!\" \"That\u0027s because you weren\u0027t affected by him in the first place. That\u0027s interesting, actually. It could mean he\u0027s the real deal, at least so far as you and he are concerned,\" she said, looking thoughtful. That was a thought. I considered that for a moment, then decided it was yet another distraction I didn\u0027t need in my life. I wished Sarah good night, and left her to her book. I slept poorly, waking up roughly every hour to find myself wrapped in vague remnants of nightmares. The unease caused by the nightmares hung over me all day, leaving me feeling itchy and nervous even though we spent a delightfully normal day touring a nearby castle, during which no ghosts, ghouls, specters, or phantoms of any sort manifested themselves. \"It was nice to have a day where the oddest thing we encountered was that woman who insisted on bringing her parrot on the castle tour,\" I commented at dinner that night. Sarah glanced toward the door of our private dining room, nodding. \"Although I could have done without you expounding at length about how much force would have to be supplied to rip someone\u0027s limb off while on the rack.\" \"You are the one who insisted on seeing the torture chamber. I was simply answering a question of physics.\" Sarah gave me a look that spoke volumes, glancing once again over my shoulder at the door before eating a bite of garlic-roasted potato. I pushed a clump of limp broccoli to the side of my plate, and rearranged a bit of hollandaise sauce more attractively around a mound of poached salmon. Sarah looked past me again. \"For Pete\u0027s sake, will you stop that! You\u0027re making me as nervous as a cat.\" \"Aha!\" Sarah waved her fork, bedecked with a piece of pork loin, at me. \"I knew it! And you said you weren\u0027t nervous earlier when I asked you when today\u0027s trial was going to be.\" \"I wasn\u0027t nervous until you started looking over my shoulder every five seconds.\" I set down my fork and stopped pretending to enjoy the meal. \"Oh, this is ridiculous. I\u0027m letting myself get all worked up over nothing. Obviously whoever is Theo\u0027s cohort of the day has had a change of heart. So you can stop looking over my shoulder for him, because he\u0027s probably decided we\u0027re not worth what must be a sizeable outlay of money to pull off whatever scheme he\u0027s attempting.\" Sarah chewed the bit of pork. \"How you can sit there and deny that Theo is exactly what he says he is - \" \"I deny it because it\u0027s perfectly clear he\u0027s a con man - \" \"A man you think is sexy as hell - \" \"Well of course I do! He is! But that doesn\u0027t excuse the fact that he\u0027s trying to pull some scheme - \" \"Admit it, Portia.\" Sarah speared another bit of potato. \"Part of the attraction he holds for you is his undeniable air of mystery, that dangerous sense of the unknown that sends shivers down your back every time he\u0027s near. No woman can turn away from that - it\u0027s a scientific fact that bad boys are completely irresistible! Give in to your inner woman and just admit he chimes your bells because of what he is.\" I pushed back from the table, tossing down my napkin. \"You\u0027re impossible when you\u0027re in that sort of a mood. You\u0027re sure you don\u0027t want me to go with you tonight?\" \"No, you take the evening off. You wouldn\u0027t enjoy sitting in a graveyard with the clairaudients, anyway.\" I smiled instead of giving her a piece of my mind about the so-called skill of recording the voices of the dead, and mentioned that I\u0027d amuse myself instead with a walk around the countryside. \"That\u0027s a great idea - your mind will be refreshed by the walk for the next trial.\" My smile turned wry. \"Whatever. Have fun in the graveyard.\" \"Maybe we should call Theo,\" Sarah mused to her dinner as I headed out of the room. \"Maybe he would know what\u0027s up with the trial...\" Once in my room, I stripped off the only other dress I\u0027d brought with me on the trip, shaking my head at myself for dressing up just because I expected to see Theo sometime during the day. I pulled out a pair of jeans and a sweatshirt, garb much more suitable for tramping around the countryside than the bright dress I\u0027d put on that morning, wondering as I did if Theo liked red. I hesitated as I pulled a pair of tennis shoes from the wardrobe, glancing down at the black silk-and-lace teddy I was wearing, my mind shying away from the reason I\u0027d put it on that morning. \"Oh, for heaven\u0027s sake, it\u0027s just underwear, not a world crisis,\" I told myself after an indecisive minute, turning around to grab my jeans. \"Just get dressaieeee!\" The floors in England seemed to be particularly prone to non-traditional behavior, for the boards that had served so solidly beneath my feet suddenly opened up into a hole, through which I fell in startled fear. \"What the...ooof!\" \"Good evening. My name is Noelle. I\u0027m a Guardian, and I\u0027ll be acting as the proctor for your third trial.\" I had fallen what seemed to be a deceptively short distance, landing on a stone floor with a thump that stung my ankles, and jarred my teeth painfully. \"Erm...do you know that you\u0027re just wearing a teddy?\" Someone had set a couple of portable camp lights on a shelf in an arched inset in the wall, the light pooling on the floor in front of me. The voice came from behind. I spun around, my eyes widening as I took in the large stone sarcophagus upon which a young, red-haired woman sat. \"I have shoes,\" I said, holding out my tennis shoes, wincing to myself at just how inane that sounded. \"I was in the middle of getting dressed. I wasn\u0027t expected to be sucked down to...where exactly are we?\" \"Crypt,\" Noelle said, giving me a rueful smile as she slid off the top of the sarcophagus. \"Sorry about the bad timing, but I\u0027ve had a day from Abaddon - literally! - and couldn\u0027t get to the trial until now. Oh well, it\u0027ll soon be over, and you can go back to your dressing. Why don\u0027t you put on your shoes, and we\u0027ll get started.\" I walked over to her and pressed my fingers to her shoulder. She certainly felt real. Which could only mean one thing. Her eyebrows rose. \"You look confused. Is there a problem?\" There were so many problems I couldn\u0027t begin to frame them in my mind, let alone explain to her the trouble I had with accepting the fact that I\u0027d just been teleported to some unknown crypt. \"No,\" I answered in what sounded like a choked voice. I cleared my throat and tried again. \"It\u0027s nothing outright insanity wouldn\u0027t explain.\" \"Oh, good.\" She smiled again, and gestured toward the center of the crypt. On the floor, an elaborate circle with several symbols had been drawn upon it. \"Shoes?\" \"Of course,\" I said, putting on my tennis shoes. \"The insanity isn\u0027t going to be complete without the idea of me standing around in nothing but lingerie and tennies.\" \"It\u0027s a very pretty teddy,\" Noelle said, walking around to the back. \"I like the straps on the side. Oh, it\u0027s not a thong. Good on you. I hate thongs - they\u0027re always getting places they shouldn\u0027t be.\" I shook my head at myself, wondering if the rest of my life - now that I\u0027d clearly gone quite, quite insane - would follow this pattern, or if some kind friend or family member would see to it that I got the mental help I needed. \"Ready?\" Noelle\u0027s voice brought me out of a reverie where I spent endless years learning how to write with my feet because my arms were confined by a straitjacket. \"Sure, why not? I\u0027ve got nothing to lose, right?\" She made a face, and looked down the room to a doorway that lurked in the darkness. \"Well...let\u0027s just say that you really need to get this one right. Right. Champion, you may enter the room.\" It didn\u0027t surprise me in the least (one of the perks of now being deranged) when Theo strolled into the room. He stopped after a few steps, pursing his lips as he looked me over from toes to head. \"That\u0027s...a new look for you,\" he finally said, having taken his time in the perusal. \"I didn\u0027t have a thing to wear,\" I said with a firm smile. \"Besides, what does it matter? I\u0027m just along for the ride now.\" \"I like it, regardless.\" His gaze flickered between my breasts and my face. \"What ride would that be?\" \"The highway to dementia. Want to come along?\" He sighed and only just kept from rolling his eyes. \"You are not insane, Portia.\" \"No, of course not. It\u0027s perfectly ordinary to be teleported to a crypt, so I can stand around in my undies waiting to...\" I turned to Noelle. \"What exactly am I waiting to do?\" \"Defeat a demon,\" she said, stepping backward until she was in the shadow of the crypt room. \"You may begin...now!\" I don\u0027t know what I expected a demon to look like - probably a short, squat red-skinned beast with horns, cloven feet, and a pointy tail - but the teenage boy who appeared in the circle did not scream demon to me. Until the little shit opened his mouth. \"Nice tits,\" the boy leered, reaching out as if he was going to honk them. \"Stay out of the circle,\" Theo commanded as he flung himself onto the boy. \"Why do you get to go in it?\" I asked. The demon teen spun around screaming, trying to pick Theo off his back, but Theo was bigger and stronger, and kept the teen\u0027s arms pinned behind him. \"Just defeat it while I\u0027m subduing it,\" he grunted, twisting to avoid the demon\u0027s attempt at a backward butt. \"Defeat it how?\" I looked around the crypt. I had no idea what it took to beat a demon, not that they really existed except in my own delusions. \"You\u0027d think that if my mind was going to snap and go to the trouble of imagining all this, it would give me a big demon-bashing club, or a cool samurai sword, or something like that.\" \"Use your Gift,\" Theo said, grunting as the demon jerked them both forward. \"The weather thing? You\u0027ve got to be kidding.\" \"Just use it!\" The demon suddenly kicked up his legs, twisting at the same time, pulling Theo to the floor where the two of them wrestled inside the circle. I parked my hands on my hips. \"I doubt rain is going to do anything but make him more slippery to hold. Ow. That had to hurt. Um. Noelle, can you help us?\" Her voice came out of the shadows, filled with regret. \"I am the proctor. I cannot assist you in any way or the trial would be void.\" \"Portia, use your damned powers!\" Theo demanded. He was sitting on the demon, who was pinned to the floor, but writhing with what looked like incredible strength. The demon bit Theo on the wrist, drawing blood. I raised my hands, letting them fall helplessly. There was nothing in the room I could use as a weapon. \"I don\u0027t know how!\" I finally admitted, unsure of what I could do to help Theo. Even if this was all a figment of my distraught imagination, I didn\u0027t want to see Theo hurt. \"How do I use weather to defeat someone?\" \"Gather it up and direct it at the demon.\" Theo\u0027s voice was garbled as the demon slammed his head into Theo\u0027s thorax, his arms and legs thrashing wildly. Theo was holding him down as best he could, but it was evident that, sooner or later, Theo\u0027s strength was going to give out and the demon would have the upper hand. \"That\u0027s impossible! No one can do that!\" \"Oh dear. I\u0027m afraid this is getting out of hand. I am authorized to stop the trial if it\u0027s clear that the test subject is not in control,\" Noelle said, taking a step out of the shadows. She had a notebook in her hand and was making notes. \"You must do this!\" Theo snarled, his face bloody. \"Now! One more failure and it\u0027s all over!\" I took a deep breath, made an apology to what I hoped was a still sane part of my brain, and concentrated on gathering up weather. \"I\u0027ll see you in Abaddon,\" Theo swore to the demon as the monstrous teen used both hands to claw him, his shirt coming away in shreds to reveal long, bloody streaks. \"Do something, woman!\" \"Weather, weather, weather,\" I said hurriedly to myself, wringing my hands as the teen continued to slash at Theo, his demonic mouth open in a wordless snarl, his eyes filled with hatred. \"What is weather? It\u0027s rain and wind and snow. It\u0027s particles of water suspended in the air. It\u0027s atomic elements, protons, electrons, neutrons, gluons, positive and negative charges, electrical charges...\" The word electrical glowed in my mind with an intensity that blinded me to all other thoughts. \"It\u0027s lightning. Lightning is electrically charged, superheated air that is released in tremendous blasts of energy - \" I closed my eyes, holding out my hands, allowing myself to feel what I was thinking. \"Energy is the ability to do work.\" My fingertips tingled. \"Portia!\" \"Work is force times distance, which is also kinetic energy.\" Around me, tiny little motes of static electricity gathered, as if I was summoning it to me. \"I\u0027m going to have to call this,\" Noelle said in a sympathetic voice. \"I can\u0027t let the demon get out of control. I\u0027m so sorry.\" \"You\u0027ve got to do something!\" I kept my eyes shut despite the plea in Theo\u0027s voice, imagining myself pulling from the stone and earth and air surrounding us the electrical charges that existed in all atoms. \"Kinetic energy can be transformed into potential energy.\" \"Gargh!\" I opened my eyes to see the demon on top of Theo, ripping with long, vicious swipes at his arms and chest. Around me, the air glowed blue with static, the hairs on my arms standing on end. \"I\u0027m sorry, I must stop - \" Noelle started forward toward the circle. \"Now!\" Theo demanded, interrupting her. \"And potential energy can be converted into the physical form known as electricity!\" I yelled, slamming the power that surrounded me into the demon. As the blue light burst into the demon\u0027s body, it threw him backward against the wall, a deafening clap of thunder bursting forth in the crypt. I shouted an oath and covered my ears, throwing myself onto the floor next to Theo. The floor cracked, the walls screamed with the echo of the thunderclap, while dust and small pieces of rock rained down from the stone ceiling. I crawled over to Theo, trying to shield his head from any falling objects. He was crumpled in a heap, filthy with dirt and blood, but alive. \"Oh, that\u0027s not good,\" Noelle said from the other side of the room, where she\u0027d gone to look at the demon. \"Are you all right?\" I asked Theo, propping him up on my lap in order to gently wipe blood and debris from his face. \"Are you hurt badly? You\u0027re bleeding a lot. I should call a paramedic.\" \"Erm...Portia...I\u0027m afraid there\u0027s a situation here,\" Noelle said from where she squatted next to the wall. I ignored her as I peeled back the shredded remains of Theo\u0027s shirt. \"Sweet mother! We have to get you to a hospital.\" Theo grabbed my arm as I was about to leap to my feet, not sure of where I was going to go for assistance, but driven to getting him help. \"I\u0027m all right, Portia. The wounds are not fatal.\" \"Your chest is torn to shreds,\" I started to say, but at that moment, Theo turned his head. I had pulled him up slightly, and his head was resting on my chest. He eyed the breast that was a scant millimeter from his mouth. \"I heal quickly.\" It was just three words, but my nipples tightened with the feeling of his breath on the thin silk that was the only thing separating my flesh from his mouth. \"That\u0027s...you\u0027re speaking into my breast,\" I said, oddly loathe to move. \"Yes, yes I am,\" he said, his eyes fixed with fascination as my nipple hardened even more, little waves of heat rippling outward from my breast across my chest before heading downward to pool in my stomach...and locations further south. \"I\u0027d like to do other things to it, but now is not the time or place.\" The air in the room seemed to evaporate into nothing. \"There\u0027s going to be a time and place?\" I asked, inwardly wincing at the moronic question, but unable to keep from asking. \"I fervently hope so,\" he said before looking down at his own chest. It took me a moment to wrestle my mind from the images of just what I\u0027d like Theo to do to my breasts, but the sight of his chest healing before my startled eyes did a lot to bring me down to earth. \"That\u0027s...that\u0027s impossible,\" I said, reaching out to touch a long welt which had been a deep gash just a few minutes before. His flesh was hot, fever-hot, radiating heat that indicated a lot of energy was being used to heal his wounds. \"This is...it\u0027s...it\u0027s just not possible!\" \"Welcome to Wonderland, Alice,\" he said with a smile that stripped the air from my lungs, and left my heart racing. Life as I knew it ceased to exist. Life as I never believed possible began. \"This is real, isn\u0027t it?\" I asked, gently touching another now-healed welt. As I watched, several more scratches merged together, healing to thick, raised patches that melted away into smooth flesh after a few minutes. \"All of this is real. I\u0027m not insane.\" Theo sat up as the last wound disappeared. His eyes expressed mingled pity and an unexpected sadness. \"No, you\u0027re not insane.\" \"Then you\u0027re...\" \"A nephilim. Immortal.\" I swallowed hard. \"And I\u0027m...\" \"A virtue. Soon to be immortal, as well, once you are accepted into the Court of Divine Blood.\" He got to his feet, and pulled me to mine, holding onto my hands. It was too much, too much to take in at once. I shook my head, not at what Theo was saying, but at the fact that my brain was trying to process all this new information so quickly. I just couldn\u0027t believe it was real...and yet, finally, I admitted to myself that the evidence piled up indisputably pointed to one conclusion: everything I had believed impossible, everything I knew could simply not be, now suddenly was. It was as if a whole new part of life opened up before me, beckoning me to go forth and explore all the mysteries it had to share. It was frightening as hell. \"And that teenager, that kid who was here tearing you apart...\" Theo gave me a slight smile, the corners of his mouth curling up in a manner that, despite my bemusement, made my stomach lurch uncomfortably. \"...was no teenager, but a demon, which you handily defeated.\" \"I hate to interrupt, but I feel it necessary to correct that statement.\" Noelle got up from where she had been looking at the wall, and came over to us. \"Portia didn\u0027t defeat the demon.\" Theo\u0027s thumbs were rubbing softly over the tops of my hands. He frowned at Noelle. \"What do you mean she didn\u0027t defeat it? I saw her do it.\" \"No,\" Noelle said with a sigh. \"What you saw her do was completely annihilate its physical form. I didn\u0027t send the demon back to Abaddon. I didn\u0027t have to - she so completely destroyed its human form that it was sent back by necessity.\" Theo\u0027s eyes widened as both he and Noelle looked at me. \"He was hurting Theo,\" I told them both. \"I wasn\u0027t going to just stand there and let him beat Theo up. Not to mention which, you both were egging me on to do something.\" \"We\u0027re not chastising you for defeating the demon,\" Noelle said with a watery smile. \"It\u0027s the fact that you destroyed its mortal form that has us in a situation.\" \"What sort of a situation?\" I asked, pulling my hands from Theo\u0027s. It was too distracting being in physical contact with him. My brain didn\u0027t want to think about anything but him when he was touching me. \"Which demon was it?\" Theo asked Noelle. She ignored my question to answer his. \"Nefere. It belonged to Bael.\" \"Salus invenitur,\" Theo swore, rubbing his forehead. \"Do I want to know who Bael is?\" I asked, rubbing the goose bumps on my arms. I was starting to get cold standing in the crypt in nothing but my teddy and shoes. \"Bael is the premiere prince of Abaddon,\" Noelle answered, her eyes on Theo. \"Abaddon being hell?\" \"Yes,\" Theo answered, his face grave. My stomach wadded itself up into a dense ball, and seemed to drop to my feet. \"Bael does not tolerate abuse of his legions. He will summon us before him to answer for the damage we did to his demon\u0027s form. Come, you are cold. I will take you back to the pub.\" He held out a hand for me, clearly intending me to follow him out of the room. \"Wait a sec,\" I said, rubbing my arms again. \"Why can\u0027t you just zap me back the way I came?\" Noelle gave me a rueful smile. \"Teleporting is a temporary power given to the trial proctors. It summons, but does not send, I\u0027m afraid.\" \"Oh great,\" I grumbled as I took Theo\u0027s hand and allowed him to lead me out of the crypt. His hand was warm, his fingers strong and reassuring. \"Now I\u0027m gallivanting who knows where in my teddy. This is so the image I want to remember England by. I don\u0027t understand why killing a demon is bad. They\u0027re demonic, right? So why isn\u0027t a good thing that I blasted it to kingdom come?\" \"It\u0027s a bit complicated,\" Noelle said with genuine regret in her voice. \"I must go back to the Court and submit the results of the trial. That, at least, you passed.\" She stopped at the doorway to what appeared to be the nave of a church, her gaze moving from me to Theo. \"Good luck. I wish I could help you, but it would be a violation of Guild law.\" \"I understand.\" Theo released me long enough to shake her hand, thanking her for her help. She gave me a brief, bright smile. \"I hope the rest of the trials go well. I think you\u0027ll be a very nice addition to the Court.\" She hurried off before I could respond. Theo escorted me out of the (thankfully unoccupied) church and into his car before I got too chilled. I wrapped myself up in the car blanket he kept in his trunk, and shivered the entire fifteen-minute drive to the pub, wondering the whole way there what had happened to the nice, orderly, sensible life I had made for myself.","sourceLink":"https://allnovel.net/the-last-of-the-red-hot-vampires-dark-ones-5/page-8.html","bookId":2206,"book":{"id":2206,"title":"The Last of the Red Hot Vampires (Dark Ones #5)","description":"Storyline: The Last of the Red-Hot Vampires (Dark Ones #5) Physicist Portia Harding’s life is grounded in facts. There’s nothing that can’t be explained by logic and science. Until she travels with her best friend to England—and accidentally summons an ethereal Virtue who bequeaths her gift of weather control to Portia… Now Portia’s walking around with a literal cloud over her head—and a heartstoppingly handsome maniac trying to kidnap her. But Theondre North is no run-of-the-mill maniac. He’s a nephilim—the son of a fallen angel—who needs Portia’s help to change his fate. Problem is, Portia’s down-to-earth attitude frustrates beings from both heavenly and hellish realms—and gets Theo turned into a vampire. But at least he has Portia to satisfy his newfound hungers—and possibly save his soul…","cover":"https://allnovel.net/images/the-last-of-the-red-hot-vampires-dark-ones-5.jpg","author":"Katie MacAlister","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-last-of-the-red-hot-vampires-dark-ones-5.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:07:58 PM"}}
