{"id":40213,"no":4,"title":"CHAPTER III. JAMES MARTIN\u0027S VICISSITUDES.","content":"While Miss Manning is seeking a new boarding-place for herself and Rose, events are taking place in Brooklyn which claim our attention. It is here that James Martin, the shiftless and drunken step-father of Rufus and Rose, has made a temporary residence. He had engaged board at the house of a widow, Mrs. Waters, and for two or three weeks paid his board regularly, being employed at his trade of a carpenter on some houses going up near by. But it was not in James Martin\u0027s nature to work steadily at anything. His love of drink had spoiled a once good and industrious workman, and there seemed to be little chance of any permanent improvement in his character or habits. For a time Rufus used to pay him over daily the most of his earnings as a newsboy, and with this he managed to live miserably enough without doing much himself. But after a while Rufus became tired of this arrangement, and withdrew himself and his sister to another part of the town, thus throwing Martin on his own resources. Out of spite Martin contrived to kidnap Rose, but, as we have seen, her brother had now succeeded in recovering her. After losing Rose, Martin took the way back to his boarding-house, feeling rather doubtful of his reception from Mrs. Waters, to whom he was owing a week\u0027s board, which he was quite unable to pay. He had told her that he would pay the bill as soon as he could exchange a fifty-dollar note, which it is needless to say was only an attempt at deception, since he did not even possess fifty cents. On entering the house, he went at once to his room, and lay down on the bed till the supper-bell rang. Then he came down, and took his place at the table with the rest of the boarders. \"Where\u0027s your little girl, Mr. Martin?\" inquired Mrs. Waters, missing Rose. \"She\u0027s gone on a visit to some of her relations in New York,\" answered Martin, with some degree of truth. \"How long is she to stay?\" \"\u0027Till she can have some new clothes made up; maybe two or three weeks.\" \"That\u0027s rather sudden, isn\u0027t it? You didn\u0027t think of her going this morning?\" \"No,\" answered Martin, with his mouth full of toast; \"but she teased so hard to go, I let her. She\u0027s a troublesome child. I shall be glad to have the care of her off my mind for a time.\" This might be true; but Mrs. Waters was beginning to lose confidence in Mr. Martin\u0027s statements. She felt that it was the part of prudence to make sure of the money he was already owing her, and then on some pretext get rid of him. When supper was over, Martin rose, and was about to go out, but Mrs. Waters was too quick for him. \"Mr. Martin,\" she said, \"may I speak to you a moment?\" \"Yes, ma\u0027am,\" answered Martin, turning reluctantly. \"I suppose you are ready to pay my bill; I need the money particularly.\" \"I\u0027ll pay it to-morrow, Mrs. Waters.\" \"You promised to pay me as soon as you changed a bill, and this morning you said you should have a chance to change it, as you were going to buy your little girl some new clothes.\" \"I know I did,\" said Martin, feeling cornered. \"I suppose, therefore, you can pay me the money to-night,\" said Mrs. Waters, sharply. \"Why, the fact is, Mrs. Waters,\" said Martin, awkwardly, \"I was very unfortunate. As I was sitting in the horse-car coming home, I had my pocket picked of all the money I got in change. There was some over forty dollars.\" \"I\u0027m sorry,\" said Mrs. Waters, coldly, for she did not believe a word of this; \"but I need my money.\" \"If it hadn\u0027t been for that, I\u0027d have paid you to-night.\" \"There\u0027s only one word I have to say, Mr. Martin,\" said the landlady, provoked; \"if you can\u0027t pay me, you must find another boarding-place.\" \"I\u0027ll attend to it in a day or two. I guess I can get the money to-morrow.\" \"If you can\u0027t pay me to-night, you\u0027ll oblige me by giving up your room to-morrow morning. I\u0027m a poor widder, Mr. Martin, and I must look out for number one. I can\u0027t afford to keep boarders that don\u0027t pay their bills.\" There was one portion of this speech that set Mr. Martin to thinking. Mrs. Waters was a widow—he was a widower. By marrying her he would secure a home, and the money received from the boarders would be paid to him. He might not be accepted. Still it would do no harm to try. \"Mrs. Waters,\" he said, abruptly, wreathing his features into what he considered an attractive smile, \"since I lost my wife I\u0027ve been feeling very lonely. I need a wife to look after me and my little gal. If you will marry me, we\u0027ll live happy, and—\" \"Thank you, Mr. Martin,\" said Mrs. Waters, considerably astonished at the sudden turn affairs had taken; \"but I\u0027ve got too much to do to think about marrying. Leastways, I don\u0027t care about marrying a man that can\u0027t pay his board-bill.\" \"Just as you say,\" answered Martin, philosophically; \"I\u0027ve give you a good chance. Perhaps you won\u0027t get another very soon.\" \"Well, if there isn\u0027t impudence for you!\" ejaculated Mrs. Waters, as her boarder left the room. \"I must be hard up for a husband, to marry such a shiftless fellow as he is.\" The next morning, Mr. Martin made his appearance, as usual, at the breakfast-table. Notwithstanding his proposal of marriage had been so decidedly rejected the day before, his appetite was not only as good as usual, but considerably better. In fact, as he was not quite clear where his dinner was to come from, or whether, indeed, he should have any at all, he thought it best to lay in sufficient to last him for several hours. Mrs. Waters contemplated with dismay the rapid manner in which he disposed of the beef-steak and hash which constituted the principal dishes of her morning meal, and decided that the sooner she got rid of such a boarder the better. Mr. Martin observed the eyes of the landlady fixed upon him, and misinterpreted it. He thought it possible she might have changed her mind as to the refusal of the day before, and resolved to renew his proposal. Accordingly he lingered till the rest of the boarders had left the table. \"Mrs. Waters,\" he said, \"maybe you\u0027ve changed your mind since yesterday.\" \"About what?\" demanded the landlady, sharply. \"About marrying me.\" \"No, I haven\u0027t,\" answered the widow; \"you needn\u0027t mention the matter again. When I want to marry you, I\u0027ll send and let you know.\" \"All right!\" said Martin; \"there\u0027s several after me, but I\u0027ll wait a week for you.\" \"Oh, don\u0027t trouble yourself,\" said the landlady, sarcastically; \"I don\u0027t want to disappoint anybody else. Can you pay me this morning?\" \"I\u0027ll have the money in a day or two.\" \"You needn\u0027t come back to dinner unless you bring the money to pay your bill. I can\u0027t afford to give you your board.\" Mr. Martin rose and left the house, understanding pretty clearly that he couldn\u0027t return. On reaching the street, he opened his pocket-book, and ascertained that twelve cents were all it contained. This small amount was not likely to last very long. He decided to go to New York, having no further inducements to keep him in Brooklyn. Something might turn up, he reasoned, in the shiftless manner characteristic of him. Jumping upon a passing car, he rode down to Fulton Ferry, and crossed in the boat to the New York side, thus expending for travelling expenses eight cents. Supposing that Rufus still sold papers in front of the \"Tribune\" office, he proceeded to Printing House Square, and looked around for him; but he was nowhere to be seen. \"Who you lookin\u0027 for, gov\u0027nor?\" inquired a boot-black, rather short of stature, but with an old-looking face. \"Aint you the boy that went home with me Wednesday?\" asked Martin, to whom Ben Gibson\u0027s face looked familiar. \"S\u0027posin\u0027 I am?\" \"Have you seen a newsboy they call Rough and Ready, this morning?\" \"Yes, I seed him.\" \"Where is he? Has he sold all his papers?\" \"He\u0027s giv\u0027 up sellin\u0027 papers, and gone into business on Wall Street.\" \"Don\u0027t you try to fool me, or I\u0027ll give you a lickin\u0027,\" said Martin, sternly. \"Don\u0027t you try to fool me.\" \"Thank you for your kind offer,\" said Ben, \"but lickings don\u0027t agree with my constitution.\" \"Why don\u0027t you tell me the truth then?\" \"I did.\" \"You said Rufus had gone into business in Wall Street.\" \"So he has. A rich cove\u0027s taken a fancy to him, and adopted him as a office-boy.\" \"How much does he pay him?\" asked Martin, considering whether there would be any chance of getting some money out of his step-son. \"Not knowin\u0027 can\u0027t say,\" replied Ben; \"but he\u0027s just bought two pocket-books to hold his wages in.\" \"You\u0027re a humbug!\" said Martin, indignantly. \"What\u0027s the man\u0027s name he works for?\" \"It\u0027s painted in big letters on the sign. You can\u0027t miss it.\" James Martin considered, for an instant, whether it would be best to give Ben a thrashing, but the approach of a policeman led him to decide in the negative. \"Shine yer boots, gov\u0027nor?\" asked Ben, professionally. \"Yes,\" said Martin, rather unexpectedly. \"Payment in advance!\" said Ben, who didn\u0027t think it prudent to trust in this particular instance. \"I\u0027ll tell yer what,\" said Martin, to whom necessity had taught a certain degree of cunning, \"if you\u0027ll lend me fifty cents for a week, I\u0027ll let you shine my boots every day, and pay you the money besides.\" \"That\u0027s a very kind proposal,\" said Ben; \"but I\u0027ve just invested all my money on a country-seat up the river, which makes me rather short.\" \"Then you can\u0027t lend me the fifty?\" \"No, but I\u0027ll tell you where you can get it.\" \"Where?\" \"Up in Chatham Street. There\u0027s plenty\u0027ll lend it on the security of that hat of yours.\" The hat in question was in the last stages of dilapidation, looking as if it had been run over daily by an omnibus, and then used to fill the place of a broken pane, being crushed out of all shape and comeliness. Martin aimed a blow at Ben, but the boot-black dexterously evaded it, and, slinging his box over his back, darted down Nassau Street. Later in the day he met Rough and Ready. \"I see the gov\u0027nor this mornin\u0027,\" said Ben. \"What, Mr. Martin?\" \"Yes.\" \"What did he say?\" \"He inquired after you in the most affectionate manner, and wanted to know where you was at work.\" \"I hope you didn\u0027t tell him.\" \"Not if I know myself. I told him he\u0027d see the name on the sign. Then he wanted to borrow fifty cents for a week.\" Rufus laughed. \"It\u0027s a good investment, Ben. I\u0027ve invested considerable money that way. I suppose you gave him the money?\" \"Maybe I did. He offered me the chance of blacking his boots every day for a week, if I\u0027d lend him the money; but I had to resign the glorious privilege, not havin\u0027 been to the bank this mornin\u0027 to withdraw my deposits.\" \"You talk like a banker, Ben.\" \"I\u0027m goin\u0027 to bankin\u0027 some day, when boot-blacking gets dull.\" Ben Gibson had been for years a boot-black, having commenced the business when only eight years old. His life had been one of hardship and privation, as street life always is, but he had become toughened to it, and bore it with a certain stoicism, never complaining, but often joking in a rude way at what would have depressed and discouraged a more sensitive temperament. He was by no means a model boy, though not as bad as many of his class. He had learned to smoke and to swear, and did both freely. But there was a certain rude honesty about him which led Rufus, though in every way his superior, to regard him with friendly interest, and he had, on more than one occasion, been of considerable service to our hero in his newsboy days. Rufus had tried to induce him to give up smoking, but thus far without success. \"It keeps a feller warm,\" he said; \"besides it won\u0027t hurt me. I\u0027m tough.\"","sourceLink":"http://novel.tingroom.com/ertong/3000/82764.html","bookId":301,"book":{"id":301,"title":"Rufus and Rose","description":"简介： In presenting to the public the last volume of the Ragged Dick Series, the author desires to return his thanks for the generous reception accorded, both by the press and the public, to these stories of street life. Several of the characters are drawn...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3000","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
