{"id":103391,"no":54,"title":"Page 54","content":"“You police? If you police you have to say.” No, you don’t have to say, my inner voice told me. Where do criminals get that idea from, anyway? “No, I’m not police,” I said aloud. “Arnie…” “Don’t call me that.” “Arnaldo. I’m not a policeman, and the ones who questioned you yesterday, they’re nothing to worry about, either. If you don’t help me, though, I can arrange for you to meet some real cops, like the ones who put Cesar away.” He told me to get out, and he kept telling me in a loud, screeching voice until a couple of nurses and an orderly appeared. So I left. I returned to the elevator, stepped inside the car, hit the button for the first floor, and stood facing out. I saw her just as the doors closed—an attractive young woman with long black hair. I hit the OPEN DOOR button, but it was too late, so I pressed the button for the third floor and the elevator stopped. I got out of the car, found the staircase, and climbed it to the fourth floor. No one noticed me as I walked quickly back down the corridor to Nunez’s room. I stopped outside the door and listened. “That fucking McKenzie,” Nunez said. God, that’s getting old, my inner voice said. “What does he know?” a woman’s voice asked. “He don’t know nuthin’.” “He must know something or he wouldn’t have come here.” “Look, you going to give me a ride home? I’ve been waiting all day. You gonna give me a ride?” “McKenzie could ruin everything.” “Fuck ’im.” “This is your fault, Arnaldo.” “My fault? I didn’t do nothing.” “You and your little friends. You’re so stupid.” “I am your brother. You do not talk to me that way.” “Estúpido. Mary Pat is good to me. She is a friend. She gave me a job; said she’d make me an assistant manager as soon as I finish a college course that she’s paying for. There was no reason for what you did. I would have told you if he showed up again. It was just a matter of time.” “Got tired of waiting.” “What if Mary Pat finds out?” I walked into the hospital room. “Good question,” I said. “What if Mary Pat does find out?” Maria spun to face me. Her mouth hung open, and her beautiful eyes exploded with a fearful light. “Buenas noches, Maria,” I said. I had knocked her off balance by my abrupt appearance, yet her equilibrium quickly returned. “It is too early for noches,” she said. “It is still afternoon.” “Buenas tardes,” I said. “Buenas tardes.” “At the risk of sounding racist, you got a lot of ’splainin’ t’ do.” Maria turned toward her brother. He was standing now, a crutch under each arm. “Tell him nothing,” he said. “In a minute your brother is going to start screaming for me to get out of here,” I said. “This time I won’t leave until the police arrive.” “Say nothing.” “Maria?” She was standing between her brother and me, turning her head back and forth as if she were at a tennis match. “I’m not here to jam you up,” I told her. “You or your brother. I like Mary Pat, and I don’t want her to be upset any more than she already is.” “Maria,” Nunez said. She turned her head to look at him. “We do not talk about our business.” “I don’t care about your business.” Maria’s head turned again. “I don’t care about the fire. I care only about Navarre.” “This is a family matter, Maria.” Her head turned once more. “La familia.” “No, it’s not. Someone else is after Navarre, too. Someone who hurt friends of mine in an attempt to find him. Who killed friends of mine. Who might hurt or kill Mary Pat. Or even you.” Maria pivoted so that she was facing me. “Help me. Please.” “You do not say anything. Maria.” She spun to face her brother. “You know the rules.” “Please,” I said again. “I just need to know why you’re looking for Navarre.” Maria looked me directly in the eye. “He is not Navarre,” she said. “Maria,” her brother said. “Do not say anything more.” “Who is he?” I asked. “Maria, who is he?” She put her hands over her ears and shouted. “Stop it. Stop it, both of you.” “Maria,” I said. “McKenzie, it is not for me to say. You must speak to my brother.” I glanced at Nunez. She shook her head. “My brother Cesar. It is for him to say.” FOURTEEN The face of Cesar Nunez bore all the marks of a trouble-prone life. Despite that—and the tattoos that peeked out from around the collar of his white T-shirt and up and down his arms—he had the forlorn expression of a businessman who fought all the way to the top only to discover it hadn’t been worth the effort. He yawned at me, and I wondered what kind of hours he kept and whether he had any choice in the matter. Probably not.","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-54.html","bookId":2216,"book":{"id":2216,"title":"The Devil May Care (Mac McKenzie #11)","description":"Storyline: Riley Brodin is the granddaughter of Walter Muehlenhaus - a man as rich, powerful, and connected as anyone since the days of J. P. Morgan. Despite her family\u0027s connections, it\u0027s McKenzie she reaches out to when her relatively new boyfriend goes missing. Despite his reservations about getting involved with the Muehlenhaus family - again - McKenzie agrees to look for one Juan Carlos Navarre. What he finds, though, is a man who appears to be a ghost. The house - mansion, really - he told Riley he owned is actually a rental, barely lived in and practically devoid of personal effects. The restaurant he claimed to own is owned by another and Navarre merely an investor. He apparently has no friends, no traceable past, and McKenzie isn\u0027t the only one looking for him. Whoever Juan Carlos Navarre is and wherever he\u0027s gone, the one thing that is clear is that he\u0027s trouble, and is perhaps someone - as Riley\u0027s family makes clear-better out of the picture. Unfortunately for everyone, McKenzie likes trouble and trouble likes him.","cover":"https://allnovel.net/images/the-devil-may-care-mac-mckenzie-11.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:21:56 PM"}}
