{"id":103404,"no":68,"title":"Page 68","content":"Hasselback’s head jerked again, and she looked at Nina as if it were the oddest question she had ever heard. Nina pulled at the hem of her black skirt and the cuff of her blue shirt as if she were wishing she had worn something else.\n “Anyway, we sent out bulletins,” the chief said. “I didn’t expect much; the boss told me not to expect much. Then we got a hit. Laredo, Texas. The PD there spotted Collin Baird’s car parked in a shopping mall lot near the Juárez-Lincoln International Bridge that crosses the Rio Grande. Car was clean. Nothing to indicate”—the chief quoted the air—“foul play. Took a chance and contacted Mexican Customs, who are a helluva lot more cooperative than we give them credit for. Turns out they dinged Collin Baird’s passport a week earlier. That told us the little SOB went to Mexico.”\n “What about Maurell?” I asked.\n “Nothing on him—whoever he is. You say he’s the one who turned up in the Twin Cities?”\n “He’s the one.”\n “I’d like to speak to him.”\n “You and me both, Chief.”\n “What I don’t get—why park the car?” Nina asked. “McKenzie, you and I have driven across the border, why not him? Why not just drive across the bridge into—what’s the city on the other side of Laredo, Texas?”\n “Nuevo Laredo,” Hasselback said. “Maybe he wanted the cops to find the car, wanted his mother to know he wasn’t lying dead in a ditch somewhere.”\n “He could have done that by picking up a phone,” I said.\n “Yeah, he coulda.”\n “Maybe he did,” Nina said.\n We agreed to visit Collin Baird’s mother together. Chief Hasselback warned that she didn’t expect anything would come of it.\n “I’ve spoken to her on and off over the years, mostly about her son,” she said. “The woman’s a walking ten-ninety-six.”\n “What’s that?” Nina asked.\n “Mental case,” I told her.\n The chief gave us directions to Mrs. Baird’s house and then told us to follow her. Nina and I were sitting in the Lexus waiting for her to pull out of her parking space when I decided I could no longer hold it in.\n “What was that all about before?” I asked. “‘Is she pretty, too?’ Where the hell did that come from?”\n “Chief Hasselback is an attractive woman,” Nina told me.\n “What does that have to do with anything?”\n “I was just wondering if you noticed.”\n “Nina, she’s a cop.”\n “I thought you’d like that about her.”\n “I don’t believe it. Are you jealous? You need to tell me, because I’ve never seen you jealous and I’m not sure what it looks like.”\n “I’m not jealous.”\n “It kinda sounds like you are.”\n “I’m sorry. I’ve never been a sidekick before. I don’t know how to behave.”\n “You’re not a sidekick. What do you think, that we’re Batman and Robin?”\n “I was thinking more like Sam Spade and Effie Perine.”\n “Sam didn’t sleep with Effie. She was his secretary.”\n “We don’t know what they did after hours.”\n “All right, all right, Rule Number Two—”\n “Should I write this down?”\n “You are forbidden to be jealous and we must never have a conversation like this again.”\n “Is that two rules, or one rule with two parts?”\n “This is why couples should never work together. What?”\n Nina leaned across the seat and buzzed my cheek.\n “I like that you said couple,” she said.\n “Couple, not partners.”\n “We’ll see.”\n Mrs. Baird lived in a small two-story house in a heavily wooded area on top of the hill, not terribly far from Galena’s senior high school, home of the Pirates. She met us on her front stoop, and I immediately noticed her nervousness. I marked it down as a consequence of Chief Hasselback’s presence. When I was a cop, I used to make people nervous, too, especially when I appeared unannounced on their doorsteps.\n Mrs. Baird demanded to know why we were there. The chief told her we wanted to talk about her son. She brought her hand to her throat and moved backward until she bumped into her closed screen door. The words came out in a rush.\n “I don’t know where he is,” she said. “I haven’t seen him. Why are you coming here now? I haven’t seen him, I tell you.”\n Chief Hasselback set a hand on the woman’s shoulder. It was meant to be a gesture of comfort, yet Mrs. Baird flinched just the same.\n “These are the investigators from Minnesota I told you about,” the chief said. Nina brightened at the word “investigators.” I was more interested in the phrase “I told you about.”\n “They’re the ones who found David Maurell in Minneapolis,” Hasselback added. “They want to ask a few questions about him.”\n Mrs. Baird stared at me with such intensity that I found myself cautiously reaching behind my right hip and patting the Beretta beneath my sports coat.\n “You’re McKenzie,” she said.\n “Yes.” I offered my hand. She refused to accept it. Her eyes had the obstinacy that comes from seeing too many changes in life and not being able to change with them. \n","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-68.html","bookId":2216,"book":{"id":2216,"title":"The Devil May Care (Mac McKenzie #11)","description":"Storyline: \n Riley Brodin is the granddaughter of Walter Muehlenhaus - a man as rich, powerful, and connected as anyone since the days of J. P. Morgan. Despite her family\u0027s connections, it\u0027s McKenzie she reaches out to when her relatively new boyfriend goes missing. Despite his reservations about getting involved with the Muehlenhaus family - again - McKenzie agrees to look for one Juan Carlos Navarre. What he finds, though, is a man who appears to be a ghost. The house - mansion, really - he told Riley he owned is actually a rental, barely lived in and practically devoid of personal effects. The restaurant he claimed to own is owned by another and Navarre merely an investor. He apparently has no friends, no traceable past, and McKenzie isn\u0027t the only one looking for him. Whoever Juan Carlos Navarre is and wherever he\u0027s gone, the one thing that is clear is that he\u0027s trouble, and is perhaps someone - as Riley\u0027s family makes clear-better out of the picture. Unfortunately for everyone, McKenzie likes trouble and trouble likes him.\n \n","cover":"https://allnovel.net/images/the-devil-may-care-mac-mckenzie-11.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:21:56 PM"}}
