{"id":103409,"no":73,"title":"Page 73","content":"“Special Agent Zo’ Marin,” the woman said.\n “That’s Greek,” Nina said.\n “So it is.”\n “Means ‘life of the sea.’”\n “So it does.”\n “I’m tired.”\n Nina moved to the winding staircase and started to climb it. The rest of us followed.\n The moment Nina entered the hotel suite, she tossed her bag on the bed, kicked off her shoes, and pulled her shirt out of her skirt. She moved to the bureau where she kept her Sangua Della Pantera. She grabbed the wine bottle by the neck, scooped up a corkscrew, and padded toward the bathroom.\n “I’m going to take a bath,” she said.\n She stepped inside the bathroom and closed the door behind her. I went to the door and rapped gently with a knuckle.\n “Are you okay, sweetie?” I asked.\n “Leave me alone.”\n I stepped away from the door.\n “Trouble in paradise?” Marin asked.\n “She’s had a long day.”\n “Yeah, that’s what we heard,” Cooper said. “Like to talk to you about that, if we might.”\n I directed them to the sitting area. The agents took the love seat, and I sat in the chair opposite them. The gas fireplace was between us. I thought about turning it on, yet decided not to.\n “All I can offer you is root beer,” I said.\n “Root beer?” asked Cooper.\n “I have forty-eight bottles.”\n “Oh God, not another one,” Marin said.\n “You discovered the Root Beer Revelry, too?” Cooper said. “I love that place. When this is over I’m going to have them ship a bottle of every variety they have to our field office in Chicago.”\n “In the meantime…,” Marin said. “Mr. McKenzie, what do you know about Collin Baird?”\n “Almost nothing. What do you know about him?”\n “We know he shot his mother today,” Cooper said. “Some say he was trying to shoot you.”\n “That’s what some say. Look, guys, I’m not trying to play with you. I know very little about Baird. I came here trying to get a handle on someone else—”\n “David Maurell,” Marin said.\n “The fact that Baird was here came as a great surprise to me,” I added.\n “Fine,” Cooper said. “Let’s talk about David Maurell.”\n “Let’s.” I settled back against the chair. “You first.”\n The two agents glanced at each other. Marin grinned.\n “He’s just like you,” she said. “Goddamned cowboy. All right. The first thing you should know, McKenzie, is that Coop and I are in the Investigations Division. We’ve been assigned to the Office of the Special Inspector General for Iraq Reconstruction—”\n Cooper interrupted to say, “The Office of the Special Inspector General is an independent entity working out of the Department of Justice whose mission is to detect and deter waste, fraud, abuse, and misconduct in DOJ programs and personnel.”\n “Do you mind?” Marin asked.\n “No, go ’head.”\n “The amount of fraud perpetrated in Iraq following the war is almost incomprehensible,” Marin told me. “It’s anywhere between sixty and one hundred billion dollars, depending on who you’re listening to.”\n “That’s billion with a B,” Cooper said.\n “Half this money came from Iraq, its cash and oil reserves,” Marin said. “The rest came from Uncle Sam. The IG for Iraq Reconstruction was put in place to get a handle on it. So far we’re talking over two hundred prosecutions of one type or another. Which isn’t to say that a lot of people are going to jail. Most contractors are merely being bumped off the approved list of vendors, you know?”\n “Which brings us to Maurell,” Cooper said. \n","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-73.html","bookId":2216,"book":{"id":2216,"title":"The Devil May Care (Mac McKenzie #11)","description":"Storyline: \n Riley Brodin is the granddaughter of Walter Muehlenhaus - a man as rich, powerful, and connected as anyone since the days of J. P. Morgan. Despite her family\u0027s connections, it\u0027s McKenzie she reaches out to when her relatively new boyfriend goes missing. Despite his reservations about getting involved with the Muehlenhaus family - again - McKenzie agrees to look for one Juan Carlos Navarre. What he finds, though, is a man who appears to be a ghost. The house - mansion, really - he told Riley he owned is actually a rental, barely lived in and practically devoid of personal effects. The restaurant he claimed to own is owned by another and Navarre merely an investor. He apparently has no friends, no traceable past, and McKenzie isn\u0027t the only one looking for him. Whoever Juan Carlos Navarre is and wherever he\u0027s gone, the one thing that is clear is that he\u0027s trouble, and is perhaps someone - as Riley\u0027s family makes clear-better out of the picture. Unfortunately for everyone, McKenzie likes trouble and trouble likes him.\n \n","cover":"https://allnovel.net/images/the-devil-may-care-mac-mckenzie-11.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:21:56 PM"}}
