{"id":103414,"no":79,"title":"Page 79","content":"“We’ve had an FBI Crime Alert on Baird for thirty-one months now,” she said. “We wouldn’t even have known for sure he was in the country if not for McKenzie.” There was some communal headshaking. Pelzer said, “You’d think we could do better.” Cooper said, “You’d think.” Pelzer handed me the package. “This is yours, by the way,” he said. I peaked inside. It was my SIG Sauer. I left it in the bag. “Thank you,” I said. “You’re welcome.” “Listen, I want you all to know that I appreciate it very much that you guys have allowed me to stay involved in this.” “Why not?” Marin said. “So far you’ve done most of the work.” “Speaking of which…” Pelzer threw a thumb at the restaurant. I locked the bag inside Nina’s Lexus before I went inside. Mary Pat Mulally was drinking. I found her sitting alone on a stool at her own bar, a glass and a half-filled bottle of Grey Goose vodka in front of her. I wondered if the bottle had been half full when she started, but the glassy look I saw in her eyes when I sat next to her told me that it hadn’t. “Hey,” I said. Mary Pat’s response was to stand on the rung of the stool, lean over the bar, grab a glass, place it in front of me, and slide the Grey Goose in my direction. I caught the bottle and poured a shot just to be polite. “I promised the deputies I would call if Navarre showed up, and he must have because there’s his goddamn boat,” she said. “The So?a-fucking-dora.” “No sign of Riley?” “Screw Riley. She’s where she wants to be.” “Where’s that?” “With Navarre, where do you think?” Mary Pat drained her glass of vodka and poured some more. At the rate she was going, I knew she wouldn’t last much longer, and I wanted to speak to her while she was still coherent. I took the bottle, poured a little more vodka into my glass, and set the bottle where she’d have to reach across me to get to it. If she noticed, she didn’t let on. “You gave me the impression that Riley was getting ready to kick Navarre to the curb,” I reminded her. Mary Pat snorted at the remark. “That’s the impression she gave me,” she said. “Riley’s such a…” “Such a what?” “Confused woman. One day she wants one thing. The next she wants something else. She can be so smart, so mature, so understanding of the world and her place in it. Then she behaves like an eight-year-old.” “The girl can be infuriating.” “Don’t insult her,” Mary Pat said. “Who are you to insult her? She’s not a girl. She’s a woman.” The rebuke should have told me something, yet it didn’t. “I’m so frightened,” Mary Pat added. “Riley can take care of herself better than most people except—except when she can’t.” “Where would Riley go if she was in trouble?” “She used to come to me. I’ve called her, McKenzie—sent texts. She won’t pick them up. What the hell do you want?” I didn’t see Maria approach until Mary Pat called her out. “The carpenter wants to know—” the young woman began. “Can’t you make one goddamn decision on your own? What do I pay you for?” Mary Pat raised her hands as if she were surrendering. “You know what? Who gives a damn?” She slid off the stool, reached past me to grab the Grey Goose by the neck, and stumbled toward her office. “What’s wrong with her?” I asked. “You really have no idea, do you?” Maria said. “If I knew…” “She’s in love with Riley.” “Oh.” How the hell did you miss that? my inner voice wanted to know. “Oh? Is that all you have to say, McKenzie? For a minute there I actually thought you were smart.” “I can’t imagine what gave you that impression.” “Me, neither.” I took a pull of the vodka, hoping it would restore my powers of observation. I don’t think it did. Maria sat next to me. “Will you do me a favor?” I asked the young woman. “Will you keep an eye on Mary Pat for me?” “I’d do that anyway.” “Let me know if she hears from Riley?” “Why not? McKenzie—thank you for not telling her about the fire; for not telling Mary Pat about Arnaldo and the rest of them.” “Don’t worry about it.” “Everything is all messed up. Cesar is furious with Arnaldo about the T-shirts and trying to bring back the Nine-Thirty-Seven. He says if he was here, he’d beat Arnaldo’s ass. At the same time, he despises Jax Abana and wants to see him dead. I don’t know what’s going to happen. Nothing good, probably.” “Whatever happens, you need to stay out of it.” “That’s what Cesar said.” Good for him, my inner voice said. “Does Arnaldo know where Navarre is?” I asked aloud. Maria shook her head slowly. “He’s waiting for you to tell him,” she said.","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-79.html","bookId":2216,"book":{"id":2216,"title":"The Devil May Care (Mac McKenzie #11)","description":"Storyline: Riley Brodin is the granddaughter of Walter Muehlenhaus - a man as rich, powerful, and connected as anyone since the days of J. P. Morgan. Despite her family\u0027s connections, it\u0027s McKenzie she reaches out to when her relatively new boyfriend goes missing. Despite his reservations about getting involved with the Muehlenhaus family - again - McKenzie agrees to look for one Juan Carlos Navarre. What he finds, though, is a man who appears to be a ghost. The house - mansion, really - he told Riley he owned is actually a rental, barely lived in and practically devoid of personal effects. The restaurant he claimed to own is owned by another and Navarre merely an investor. He apparently has no friends, no traceable past, and McKenzie isn\u0027t the only one looking for him. Whoever Juan Carlos Navarre is and wherever he\u0027s gone, the one thing that is clear is that he\u0027s trouble, and is perhaps someone - as Riley\u0027s family makes clear-better out of the picture. Unfortunately for everyone, McKenzie likes trouble and trouble likes him.","cover":"https://allnovel.net/images/the-devil-may-care-mac-mckenzie-11.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:21:56 PM"}}
