{"id":103421,"no":86,"title":"Page 86","content":"“I’ve been dealing with his crap all my life, McKenzie. You have no idea, you really don’t.” “I’ve been getting it, too,” said Brodin. “Ever since I married Sheila. The man’s a monster.” “You people,” I said. “Brodin, did it ever occur to you that Mr. Muehlenhaus said no to your request because he was unable to say yes, that he didn’t have any juice with the Department of Justice, that he didn’t have contacts who did, and he was afraid for you to find out? The first time I met her, Riley told me Mr. Muehlenhaus’s strength came from the perception people have that whatever it is, he can fix it, break it, build it, or make it go away. The perception. She understands it, how come you don’t? In the right light and at the right angle, even the tiniest object can throw an immense shadow onto the wall. But it’s an optical illusion. The shadow only makes the object appear bigger than it really is. Which raises the question—have you two been spending your lives doing exactly what that old man told you to do, living under his thumb, because you’re afraid of his shadow?” Neither of them seemed to have anything to say, so I kept going. “Listen, I don’t care,” I said. “This is none of my business. All I care about is Riley. I’m not trying to bring her back to Mr. Muehlenhaus. I’m not trying to keep her away from Navarre, whoever he turns out to be. I’m trying to protect her from a man who’s already murdered two people and assaulted another to get at Navarre. Now, dammit, where the hell is she?” Sheila unfolded her legs and rose slowly from her chair. She crossed the carpet and stood in front of me. For a moment, I had the feeling she was going to spit in my face. Instead, she sighed deeply like someone giving in to unpleasant news. “Promise you won’t tell the old man,” she said. “Promise that you’re just going to make sure she’s safe.” “I promise.” “The family has a place on the lake up north. Beautiful place. It was once featured in Minnesota Monthly magazine. They’re going to spend the night there before driving to Canada.” NINETEEN In the language of Minnesota, “a place on the lake up north” could be damn near anywhere. Start with “a place.” That suggested anything from a clearing where you pitched your tent or parked your trailer to a rustic cabin or palatial lake home. “The lake” was whichever one of our eleven-thousand-plus bodies of water where you owned or had access to “a place.” And the phrase “up north” referred more or less to the entire region a half-hour’s drive beyond the Cities—roughly two-thirds of the state. To the Muehlenhaus clan, it was a family compound consisting of a large main house surrounded by six small cabins located on the north shore of the lake—Lake Superior—near Lutsen, about four hours away by car assuming you obeyed the speed limit, which I seldom did. 8:34 P.M. and I was already on my way when I called to tell Nina about it. “You’re not going to swing by and pick me up, are you?” she asked. “No, I’m not.” “Is it because you’re afraid I’ll get hurt or because you think I’ll be in the way?” “Yes.” “Here I thought you’d be happy I was showing an interest in your work.” “Next time I need to drive two hundred and forty miles in search of a crazed killer, I’ll save you a seat.” “You say that, but you don’t really mean it. Can you at least do me a favor? Stop at Betty’s Pies and get me a blackberry peach crunch.” “Are you serious?” “You might as well. Driving along the north shore, it’s on your way.” “Nina, I’m not stopping to buy a pie.” “Ohhhh,” she moaned. “What?” “Where Baird hit me with the gun—it’s really starting to ache. Don’t worry about me, though. I’ll just take an aspirin.” “Fine. Blackberry crunch.” “Blackberry peach crunch. Oh, while you’re at it, get a five-layer chocolate pie, too.” “This is why I didn’t take you with me. You don’t have the right mindset for this sort of thing.” 10:17 P.M. and I was fast approaching the bright lights of Duluth when it occurred to me that instead of worrying, I should reach out to the Cook County Sheriff’s Department. I thumbed 9-1-1 into my cell phone keypad and asked the operator to transfer my call to the county’s nonemergency line. From there I was connected to dispatch. I gave the woman my name and requested a “welfare check” on Ms. Riley Muehlenhaus Brodin. “Is there an issue we should be aware of?” she asked. I explained that Riley had been linked to a murder that took place in Hennepin County and I was concerned for her safety. I gave the woman the names of Lieutenant Pelzer and Collin Baird, as well as Riley’s address and the license plate number of her Infiniti sports car. Dispatch told me Cook County had a deputy patrolling near the area and would request that he knock on Riley’s door. I thanked her and hung up the smartphone. I didn’t stop worrying, though.","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-86.html","bookId":2216,"book":{"id":2216,"title":"The Devil May Care (Mac McKenzie #11)","description":"Storyline: Riley Brodin is the granddaughter of Walter Muehlenhaus - a man as rich, powerful, and connected as anyone since the days of J. P. Morgan. Despite her family\u0027s connections, it\u0027s McKenzie she reaches out to when her relatively new boyfriend goes missing. Despite his reservations about getting involved with the Muehlenhaus family - again - McKenzie agrees to look for one Juan Carlos Navarre. What he finds, though, is a man who appears to be a ghost. The house - mansion, really - he told Riley he owned is actually a rental, barely lived in and practically devoid of personal effects. The restaurant he claimed to own is owned by another and Navarre merely an investor. He apparently has no friends, no traceable past, and McKenzie isn\u0027t the only one looking for him. Whoever Juan Carlos Navarre is and wherever he\u0027s gone, the one thing that is clear is that he\u0027s trouble, and is perhaps someone - as Riley\u0027s family makes clear-better out of the picture. Unfortunately for everyone, McKenzie likes trouble and trouble likes him.","cover":"https://allnovel.net/images/the-devil-may-care-mac-mckenzie-11.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:21:56 PM"}}
