{"id":103426,"no":91,"title":"Page 91","content":"“Yes.”\\n\\n “Collin was my only mistake. I needed someone to front for me, someone with a legitimate Social Security number and a clean passport. I picked Collin because he was a small-town boy who wasn’t nearly as smart as he thought he was. I didn’t know he enjoyed hurting people, though, especially women, until Laredo, and by then it was too late. A broken toy with no way to fix him. I’m sorry about Mrs. R. And Annie.”\\n\\n “Jax—”\\n\\n “Call me Juan Carlos. That’s the person I worked hardest to become. Almost made it, too.”\\n\\n “Why did you take his identity, of all people?”\\n\\n “Because he was flawed. I knew Riley’s people would think I was too good to be true. I knew they would check my background, well, Navarre’s background. Instead of a con man, they would find a prodigal son who didn’t get on well with his father—and then stop looking. They wouldn’t like Juan Carlos any better, but they weren’t going to like him anyway. Riley, though. Riley liked him just fine. She just didn’t like him enough.”\\n\\n “Did you kill him?”\\n\\n “Who? Navarre? Of course not. I don’t kill people. What do you take me for?”\\n\\n “How did you get his passport? His identity?”\\n\\n “I bought it. I met him in a bar in Greece. He sold me his name for half a million euros. Said he hadn’t had any use for it in years.”\\n\\n Then I asked him the big question. “Why did you do it?”\\n\\n “Do what? Be specific.”\\n\\n “Everything.”\\n\\n “I took the money from the Nine-Thirty-Seven because I wanted a better life. I became David Maurell and tried to get into Macalester College for the same reason. Meeting Riley—meeting Riley told me why I wanted a better life.”\\n\\n “But you didn’t actually meet, did you?”\\n\\n “Oh, no,” Navarre said. “Not back then. I wasn’t worthy of her then. She would have dismissed Jax and David out of hand. I had to become someone else first.”\\n\\n “Where’s your mother?”\\n\\n “Out shopping. She’s going to cook a feast for her long-lost baby boy.”\\n\\n “Your sister?”\\n\\n “At work.”\\n\\n “Don’t do this, man.”\\n\\n “I’ve got no moves left.”\\n\\n “The Department of Justice…”\\n\\n “And go to prison for thirty years?”\\n\\n “You have almost fifty million dollars of their money. Make a deal. Buy down your sentence.”\\n\\n “The money is in Switzerland. The account is set up so that I’d have to appear in person to get at it.”\\n\\n “So? Take a plane ride on the taxpayer’s dime.”\\n\\n Navarre shook his head.\\n\\n “The Nine-Thirty-Seven Mexican Mafia,” I said.\\n\\n “I know. Cesar’s little brother—last time I saw him he was a little snot-nose punk. Probably still is. I’ll find out soon enough.”\\n\\n “Don’t do this,” I repeated.\\n\\n Navarre had nothing to say.\\n\\n “Offer the money to Arnaldo,” I said. “Buy your way out of this.”\\n\\n Navarre had nothing to say to that, either. Still, it’s been my experience that a man who’s prepared to dive into a pool will fight tooth and nail to keep from being pushed. At the last moment, Navarre might decide he had plenty of moves left. If the Cook County cops hadn’t confiscated my SIG Sauer, I would have given it to him.\\n\\n “Good luck, Juan Carlos,” I said.\\n\\n I turned and walked back to my Jeep Cherokee. Navarre called to me.\\n\\n “Tell Riley … tell Riley I left her car at the Signal Hill Shopping Center.”\\n\\n I drove slowly down the street until I spied a black Cadillac DTS with silver wheels parked at the curve. I stopped. Two men were in the front seat. Arnaldo Nunez was in the back. He glanced out the window at me and nodded the way people do when they want to acknowledge your presence without actually speaking to you. I nodded back. There was nothing to be said anyway.\\n\\n I drove on.\\n\\n JUST SO YOU KNOW\\n\\n It had been a harder winter than most. The ice didn’t officially leave Lake Minnetonka until the first week of May—two days after the Twin Cities were pounded by a rogue blizzard that dropped six inches on us—and it wasn’t until the middle of the month that restaurant and café owners felt confident enough to open their outdoor patios and decks to customers. It was then that Riley Muehlenhaus Brodin summoned me to Casa del Lago for lunch.\\n\\n I had missed the grand reopening for reasons I don’t remember, so this was my first look at the place since the fire. I was impressed to discover that Mary Pat Mulally didn’t just repair the building; she remodeled to give it a more authentic look and feel. Based on the number of customers at the tables inside and out, I guessed it had recovered quite nicely.\\n\\n Maria Nunez met me at the door. She seemed happy to see me; even said I was “looking good,” which kind of threw me. We compliment women all the time on their appearance, yet we seldom mention it to men unless we’re surprised by something. \\n\\n","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-91.html","bookId":2216,"book":{"id":2216,"title":"The Devil May Care (Mac McKenzie #11)","description":"Storyline: Riley Brodin is the granddaughter of Walter Muehlenhaus - a man as rich, powerful, and connected as anyone since the days of J. P. Morgan. Despite her family\u0027s connections, it\u0027s McKenzie she reaches out to when her relatively new boyfriend goes missing. Despite his reservations about getting involved with the Muehlenhaus family - again - McKenzie agrees to look for one Juan Carlos Navarre. What he finds, though, is a man who appears to be a ghost. The house - mansion, really - he told Riley he owned is actually a rental, barely lived in and practically devoid of personal effects. The restaurant he claimed to own is owned by another and Navarre merely an investor. He apparently has no friends, no traceable past, and McKenzie isn\u0027t the only one looking for him. Whoever Juan Carlos Navarre is and wherever he\u0027s gone, the one thing that is clear is that he\u0027s trouble, and is perhaps someone - as Riley\u0027s family makes clear-better out of the picture. Unfortunately for everyone, McKenzie likes trouble and trouble likes him.\\n","cover":"https://allnovel.net/images/the-devil-may-care-mac-mckenzie-11.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:21:56 PM"}}
