{"id":110281,"no":13,"title":"Page 13","content":"\"My cargo requires a smooth ride, Mr. Sharp.\"\\n\\n \"It\u0027ll be calm once we\u0027re off the ground,\" Deryn said. In one airmanship lecture Mr. Rigby had filled a wineglass to the brim - even during hard turns not a drop had spilled over. \"It\u0027s just that the airflow gets messy down here.\"\\n\\n Dr. Barlow nodded. \"Especially in the middle of London, I suppose.\"\\n\\n \"Aye, ma\u0027am. The streets tangle up the wind, and the big ships get nervous coming down on unfamiliar fields.\" Deryn said this flatly, not mentioning whose fault the situation was. \"You see those wee grassy bits on the ship\u0027s flanks? They\u0027re called cilia, and they look shivery to me.\"\\n\\n \"MOORING AT REGENT\u0027S PARK.\"\\n\\n \"I know what cilia are, Mr. Sharp,\" the lady boffin said. \"I fabricated this particular species, in fact.\"\\n\\n Deryn blinked, feeling like a ninny. Lecturing one of the Leviathan\u0027s creators on the subject of airflow!\\n\\n The thylacine was bouncing happily on its hind legs again, its big brown eyes taking in all the activity. Two elephantines waited below the airship, harnessed to a transport wagon and an armored car. The constables could hardly keep the crowd back from the spectacle.\\n\\n With no mooring mast in the park, ropes stretched in all directions from the Leviathan. Deryn frowned, noticing that some of the men clinging to them weren\u0027t in Service uniforms. She spotted a few policemen, and even a team of cricketers drafted from games in the park.\\n\\n \"Fitzroy must be daft,\" she muttered.\\n\\n \"What\u0027s the trouble, Mr. Sharp?\" Dr. Barlow asked.\\n\\n \"Those men on the ropes, ma\u0027am. If a squall comes up quick, they won\u0027t know to let go - and fast - or be carried up into the air ...\"\\n\\n \"Where they shall eventually lose their grip,\" Dr. Barlow said.\\n\\n \"Aye. One strong gust can carry the Leviathan up a hundred feet in seconds.\" It was the first thing they taught ground men: Don\u0027t hang on. The trees rippled overhead, sending a shiver through Deryn.\\n\\n \"What would you recommend we do, Mr. Sharp?\"\\n\\n Deryn frowned, wondering if the ship\u0027s officers knew what was going on. Most of the untrained men were back at the stern end, out of sight of the bridge. \"Well, if we could get word up to the captain, he\u0027ll know to get down fast, or cut the ropes if a squall hits.\"\\n\\n She scanned the field, looking for Fitzroy, or anyone in charge. But the park was all in chaos, and the chief constable nowhere to be seen.\\n\\n \"Perhaps Clementine can help us,\" Dr. Barlow said.\\n\\n \"Who?\"\\n\\n Dr. Barlow handed Tazza\u0027s leash to Deryn, then reached for the birdcage. She opened the linen cover and reached inside, pulling out a bird with gray feathers and a brilliant red tuft at its tail.\\n\\n \"Good morning, Dr. Barlow,\" the bird squawked.\\n\\n \"Good morning, dear,\" she answered. Then she said in a slow, clear voice, \"Captain Hobbes, greetings from Dr. Barlow. I have a message from Mr. Sharp: You appear to have some untrained men on your ropes.\" She looked at Deryn and shrugged. \"And ... I look forward to meeting you, sir. End message.\"\\n\\n She gathered the bird closer to her chest, then pushed it toward the airship.\\n\\n As it swept up and away, Deryn murmured, \"What was that?\"\\n\\n \"A message parrot,\" Dr. Barlow said. \"Based on the Congo African Grey. We\u0027ve been training it especially for this trip. It can read airmen\u0027s uniforms and gondola markings, just like a proper Service lizard.\"\\n\\n \"Training it, ma\u0027am?\" Deryn frowned. \"But I thought this Constantinople business came up all of a sudden.\"\\n\\n \"Indeed, things are moving more quickly than expected.\" Dr. Barlow lay one hand on the mysterious box. \"But some of us have been planning this mission for years.\"\\n\\n Deryn gave the box another wary glance, then turned to watch the parrot. It flapped through the ropes and guidelines, straight into the open windows of the bridge.\\n\\n \"That\u0027s brilliant, ma\u0027am. It\u0027s like a flying message lizard!\"\\n\\n \"They have many of the same life threads,\" Dr. Barlow said. \"In fact, some of us believe that birds share ancestors with the ancient lizards... .\" Her voice faded as the Leviathan\u0027s tanks let loose with a spray of ballast.\\n\\n The ship rose a little, the men on the ropes skidding along the ground in a losing tug of war against the airship.\\n\\n \"Blisters!\" Deryn swore. \"Why\u0027s he climbing?\"\\n\\n \"Oh dear,\" Dr. Barlow said, looking down. \"I do hope that was Clementine.\"\\n\\n Deryn followed her stare to the birdcage. Another hooked gray beak was poking out, gnawing on the bars. \"There\u0027s two of them?\"\\n\\n The lady boffin nodded. \"Winston tends to garble things, and I can never tell them apart. It\u0027s such a bother.\"\\n\\n Deryn swallowed, watching as the ballast water rained down on the ground men\u0027s heads. It sparkled prettily in the sunlight, but Deryn knew where that ballast came from - it was straight from the gastric channel, clart and all.\\n\\n The civilians among them thought something had gone wrong. A squad of men in cricketing whites dropped their ropes and covered their heads, retreating from the unexpected rain of smelly water. The ship rose higher as their weight left the ropes, but Deryn saw the hydrogen sniffers on the ship\u0027s topside going into a frenzy. The captain was also venting gas.\\n\\n The ship steadied in the air.\\n\\n Another spray of ballast came, heavier than the last. The proper ground men, who\u0027d had clart hit their heads a hundred times, hung on. But in a few moments all the untrained men had abandoned their ropes.\\n\\n \"Very clever, your captain,\" Dr. Barlow said.\\n\\n \"Nothing like a bit of muck to clear things out!\" Deryn said happily, then added, \"So to speak, ma\u0027am.\"\\n\\n Dr. Barlow let out a laugh. \"Indeed. I shall enjoy traveling with you, Mr. Sharp.\"\\n\\n \"Thank you, ma\u0027am.\" Deryn glanced at the lady boffin\u0027s massive pile of luggage. \"Perhaps you could mention that to the bosun. You see, the ship\u0027s a wee bit over-weight.\"\\n\\n \"I shall,\" the woman said, taking back her beastie\u0027s leash. \"We\u0027d like a little cabin boy all our own, wouldn\u0027t we, Tazza?\"\\n\\n \"Um, that\u0027s not really what I ...\" Deryn blethered, starting to explain that midshipmen were officers, practically. They certainly weren\u0027t cabin boys.\\n\\n But Dr. Barlow was already leading her thylacine toward the airship, trailed by the other boffins and their mysterious box.\\n\\n Deryn sighed. At least she\u0027d earned her place aboard the Leviathan. And after his blunder with the ropes, that bum-rag Fitzroy might finally get what he deserved. Not bad for one day\u0027s work.\\n\\n Of course, now there was a fresh worry to ponder.\\n\\n As another female, Dr. Barlow might notice a few odd things the other crewmen hadn\u0027t. And she was a clever-boots, with all that science under her bowler. If anyone was going to guess Deryn\u0027s little secret, it would be this lady boffin.\\n\\n \"Brilliant,\" Deryn muttered, taking hold of the heavy trunk and hurrying for the ship.\\n\\n SEVENTEEN\\n\\n The land frigate stood atop a distant rise, its signal flags snapping in the breeze.\\n\\n \"That\u0027s a bother,\" Klopp said, lowering his field glasses. \"She\u0027s a thousand-tonner, Wotan class. A new experimental model. Small enough to make good speed; big enough to pound us into dust.\"\\n\\n Alek took the glasses from Klopp and raised them to his eyes.\\n\\n The Herkules wasn\u0027t the largest landship they\u0027d seen, but with its eight long legs - arranged like a spider\u0027s - it did look nimble. The array of smokestacks suggested a powerful engine bank inside.\\n\\n \"What\u0027s she doing here at the Swiss border?\" Alek asked. \"Isn\u0027t there a war on?\"\\n\\n \"One might think she was waiting for us,\" Count Volger said.\\n\\n \"See that crow\u0027s nest?\" Klopp pointed at a tall mast rising from the frigate\u0027s gun deck. Two tiny figures stood on the platform mounted at its top. \"That lookout tower isn\u0027t standard equipment.\"\\n\\n \"And the lookouts are facing this way - into Austria,\" Bauer said. The pilot\u0027s cabin was crowded, the other three arranged around Alek like a family portrait. \"I doubt they\u0027re stationed here to protect us from invasion.\"\\n\\n \"No, they\u0027re here to keep us in,\" Alek said, lowering the field glasses. \"They knew we were headed to Switzerland, thanks to me.\"\\n\\n Count Volger shrugged. \"Where else would we go?\"\\n\\n Alek supposed he was right. With the war spreading every day, Switzerland was the only country staying neutral - the last place for fugitives and deserters to hide.\\n\\n But it still didn\u0027t seem fair, running straight into this land frigate. They\u0027d been weaving back and forth across Austria for more than a month - creeping through forests for a few hours every night. They\u0027d been hunted, shot at, even dive-bombed by an aeroplane. They\u0027d spent whole days scavenging parts and fuel from farm machines and junkyards, just enough to keep the Stormwalker running. And finally they\u0027d reached a passage to safety, only to find it guarded by a giant metal spider.\\n\\n It was certain the Herkules wasn\u0027t going anywhere soon. A command tent was pitched under her engines, where a six-legged cargo walker waited to fetch supplies and fresh crew.\\n\\n \"How far are we from the border?\" Alek asked.\\n\\n \"You\u0027re looking at it, sir,\" Bauer said, pointing past the frigate. \"Those mountains are in Switzerland.\"\\n\\n Klopp shook his head. \"Might as well be Mars. Backtracking to another mountain pass will take a week at least.\"\\n\\n \"We\u0027d never make it,\" Alek said, flicking the kerosene gauge. The needle shivered at the halfway mark, enough for a few days at most.\\n\\n Fuel had been hard to come by after Alek\u0027s foolishness at Lienz. Horse scouts swept the carriage paths and zeppelins patrolled the skies - all because he\u0027d behaved like a spoiled brat.\\n\\n But at least Volger had been right about one thing. Prince Aleksandar of Hohenberg had not been forgotten.\\n\\n \"We can\u0027t go around them,\" Alek decided. \"So we\u0027ll go right through them.\"\\n\\n Klopp shook his head. \"She\u0027s designed for stern chases, young master. Her big guns are in the forward turrets - she can pound us without turning sideways.\"\\n\\n \"I didn\u0027t say we\u0027d fight her,\" Alek said. Klopp and Volger stared at him, and he wondered why they were being so thick. He sighed. \"Before this all began, had any of you ever traveled in a walker at night?\"\\n\\n Klopp shrugged. \"Too risky. In the Balkan Wars all the walker battles were in broad daylight.\"\\n\\n \"Exactly,\" Alek said. \"But we\u0027ve crossed the length of Austria in darkness. We\u0027ve mastered a skill that no one else even dares to practice.\"\\n\\n \"You\u0027ve mastered night-walking,\" Klopp said. \"My old eyes can\u0027t manage it.\"\\n\\n \"Nonsense, Klopp. You\u0027re still the far better pilot.\"\\n\\n The man shook his head. \"In daylight, perhaps. But if we\u0027re doing any running in the dark, it should be you at the saunters.\"\\n\\n Alek frowned. This whole last month he\u0027d assumed old Klopp was letting him pilot for the sake of practice. The idea that he had surpassed his old master of mechaniks was unsettling. \"Are you sure?\"\\n\\n \"Sure as blazes,\" Klopp said, clapping Alek on the back. \"What do you say, Count? We\u0027ve given our young Mozart here enough practice in night-walking. Might as well put him to the test!\"\\n\\n They started the engines just after sunset.\\n\\n The last rays still shone like pearl on the snowy peaks in the distance. But long shadows stretched from the mountains, plunging the pass into darkness.\\n\\n Alek\u0027s hand moved to the control saunters -\\n\\n Suddenly a pair of searchlights lanced out from the frigate. They swept across the dark expanse - bright knives slicing the night into pieces.\\n\\n His hands dropped from the controls. \"They know we\u0027re here.\"\\n\\n \"Nonsense, young master,\" Klopp said. \"They\u0027ve realized by now that we move at night. But two searchlights can\u0027t cover the whole border.\"\\n\\n Alek hesitated. There were always rumors of German secret weapons: listening devices or machines that peered through fog and darkness with radio waves. \"What if they have more than just lights?\"\\n\\n \"Then we\u0027ll improvise.\" Klopp smiled.\\n\\n Alek watched the searchlights carefully. Their paths across the valley seemed to have no pattern. Staying hidden would hinge on pure luck, which didn\u0027t seem like enough. This plan had been all his idea; any disaster was on Alek\u0027s head alone.\\n\\n He forced the thought away, remembering his father\u0027s favorite line from the poet Goethe: The dangers of life are infinite, and among them is safety.\\n\\n The real hazard was hiding here in Austria. If they tried to avoid any risks, they\u0027d be found sooner or later. He placed his hands on the saunters again.\\n\\n \"Ready?\" he said.\\n\\n \"Whenever you are, Alek.\" Count Volger pulled himself up into the top hatch, resting his feet on the back of the pilot\u0027s seat. The toes of his boots tapped Alek\u0027s shoulders, both at once - the signal to move ahead. \\n\\n","sourceLink":"https://allnovel.net/leviathan-leviathan-1/page-13.html","bookId":1574,"book":{"id":1574,"title":"Leviathan (Leviathan #1)","description":"Storyline: Leviathan (Leviathan #1) \\n Prince Aleksander, would-be heir to the Austro-Hungarian throne, is on the run. His own people have turned on him. His title is worthless. All he has is a battletorn war machine and a loyal crew of men. \\n Deryn Sharp is a commoner, disguised as a boy in the British Air Service. She\u0027s a brilliant airman. But her secret is in constant danger of being discovered. \\n With World War I brewing, Alek and Deryn\u0027s paths cross in the most unexpected way…taking them on a fantastical, around-the-world adventure that will change both their lives forever.\\n","cover":"https://allnovel.net/images/leviathan-leviathan-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/leviathan-leviathan-1.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:55:31 PM"}}
