{"id":110287,"no":19,"title":"Page 19","content":"\"With medicine?\"\\n\\n Alek blinked. \"Well, that was because ...\" There was a long pause. \"Um, I\u0027m afraid I don\u0027t know the word in English.\"\\n\\n \"The word for what?\"\\n\\n \"I just said: I don\u0027t know it!\" He turned from her and began to slide away on his funny oversize shoes. \"I have to go now.\"\\n\\n Alek\u0027s story was clearly a load of blether. And wherever he was from, the ship\u0027s officers would want to know about it. She started to follow him, but her foot cracked through the brittle surface, filling her boot with snow.\\n\\n \"Blisters!\" she swore, suddenly seeing the point of his big slidey shoes. \"Don\u0027t go skiting off, Alek! We need you!\"\\n\\n The boy came to a reluctant halt. \"Listen. I\u0027ll bring you what I can, all right? But you can\u0027t tell anyone you saw me. If you come looking for my family, it won\u0027t be good. We don\u0027t like strangers, and we can be quite dangerous.\"\\n\\n \"Dangerous?\" Deryn asked. They had to be outlaws - or worse. She put a hand into her pocket, feeling for her command whistle.\\n\\n \"Very deadly,\" Alek said. \"So you have to promise not to tell anyone about me! All right?\"\\n\\n He stood there, his green eyes locked with hers. Deryn held her breath, trying to match the intensity of his gaze. Like a stare-off before a fistfight, it made her stomach flutter.\\n\\n \"Do you promise?\" he demanded again.\\n\\n \"I can\u0027t let you go, Alek,\" she said softly.\\n\\n \"You ... what?\"\\n\\n \"I have to report you to the ship\u0027s officers. They\u0027ll want to ask you a few questions.\"\\n\\n His eyes widened. \"You\u0027re going to interrogate me?\"\\n\\n \"I\u0027m sorry, Alek. But if there\u0027s dangerous folks about, it\u0027s my duty to tell the officers.\" She held up the satchels. \"You\u0027re smugglers or something, aren\u0027t you?\"\\n\\n \"Smugglers! Don\u0027t be absurd,\" Alek said. \"We\u0027re perfectly decent people!\"\\n\\n \"If you\u0027re so decent,\" Deryn said, \"then why\u0027ve you been telling me a load of yackum?\"\\n\\n \"I was just trying to help! And I don\u0027t know what yackum is!\" the boy sputtered, then said something unpleasant in German. He turned around on his giant shoes and headed off into the darkness.\\n\\n Deryn pulled the command whistle from her pocket. The freezing metal burned her lips as she piped a quick sequence, the notes of an intruder alert ringing in the cold air.\\n\\n She stuffed the whistle back into her pocket and trudged after him, ignoring the snow collecting in her boots.\\n\\n \"Hold up, Alek! No one\u0027s going to hurt you!\"\\n\\n He didn\u0027t answer, just kept sliding away. But Deryn heard shouts behind her, and the scrabble of hydrogen sniffers on the ratlines. The beasties jumped like rabbits on fire when you blew an intruder alert.\\n\\n \"Alek, stop! I just want to talk!\"\\n\\n The boy glanced over his shoulder, and his eyes went wide at the sight of the sniffers. He uttered a panicked cry and slowed to a halt, turning to face her again.\\n\\n Deryn ran harder, hoping to get there before the sniffers did. No point in letting the beasties scare poor Alek to death.\\n\\n \"Just wait there!\" she called. \"There\u0027s no reason to ...\"\\n\\n Her voice trailed off as she saw what was in Alek\u0027s hand - a black pistol, the metal gleaming in the moonlight.\\n\\n \"Are you daft?\" she cried, breathing in the bitter smell of hydrogen. One spark from a gunshot could ignite the air, turning the ship into a vast fireball.\\n\\n \"Don\u0027t come any closer!\" Alek said. \"And call those ... things off!\"\\n\\n Deryn came to a halt, glancing at the sniffers bounding toward them across the snow. \"Aye, I would. But I don\u0027t think they\u0027ll listen!\"\\n\\n The pistol swerved from her to the sniffers, and she saw Alek\u0027s jaw tense.\\n\\n \"Don\u0027t!\" she cried. \"You\u0027ll set us all aflame!\"\\n\\n But he was raising his arm, aiming at the nearest beastie -\\n\\n Deryn threw herself forward, smothering the gun with her body. A bullet was nothing compared to catching fire. She grabbed Alek\u0027s shoulders and dragged him down into the snow.\\n\\n Her head went through the brittle ice with a crack, sending stars across her vision. Alek landed on top of her, the barrel of the gun jabbing hard into her ribs. She closed her eyes, waiting for an explosion of agony and noise.\\n\\n He was struggling to free the pistol, so she pulled him harder against her. Ice cut her cheek as their struggle dug them deeper into the snow.\\n\\n \"STRUGGLE ON ICE.\"\\n\\n \"Let me go!\" he cried.\\n\\n Deryn opened her eyes, glaring straight into his. He froze for a moment - and she spoke in a slow, clear voice.\\n\\n \"Don\u0027t. Shoot. The air\u0027s full of hydrogen!\"\\n\\n \"I\u0027m not trying to shoot anyone. I\u0027m trying to get away!\"\\n\\n He started struggling again, the pistol jamming harder into her ribs. Deryn let out an oof. She wrapped a hand around the gun, trying to push the barrel aside.\\n\\n A low growl rolled across the snow, and a sniffer thrust its long snout right into Alek\u0027s face. He froze again, a look of horror draining the color from his skin. Suddenly the animals were all around them, their hot breath steaming.\\n\\n \"It\u0027s okay, beasties,\" Deryn said in a calm voice. \"Just back off a wee bit, please? You\u0027re scaring our friend here, and we don\u0027t want him pulling the barking trigger.\"\\n\\n The nearest sniffer cocked its head, letting out a low whine. Deryn heard shouts, crewmen calling off the beasties. Green shadows from wormlamps swung around them.\\n\\n Alek let out a sigh, his muscles going limp.\\n\\n \"Let go of the gun,\" she said. \"Please?\"\\n\\n \"I can\u0027t,\" he said. \"You\u0027re squeezing my fingers.\"\\n\\n \"Oh.\" Deryn realized that her hand was still wrapped around his. \"Well, if I let go, you won\u0027t shoot me, will you?\"\\n\\n \"Don\u0027t be an idiot,\" he said. \"I would have shot you by now if I\u0027d wanted to.\"\\n\\n \"You\u0027re calling me an idiot? You barking ninny! You almost blew us all up! Don\u0027t you know what hydrogen smells like?\"\\n\\n \"Of course not,\" he said, giving her a look of disgust. \"What an absurd question.\"\\n\\n She glared back at him, but loosened her grip. The boy let the pistol fall aside and stood up, warily facing the men around him. Deryn scrambled to her feet, dusting snow from her flight suit.\\n\\n \"What\u0027s going on here?\" came a voice from the darkness. It was Mr. Roland, the master rigger.\\n\\n Deryn saluted. \"Midshipman Sharp reporting, sir. I was knocked out in the crash, and when I came to, this boy was here. He gave me these satchels - full of medicines, I think. He lives somewhere hereabouts but won\u0027t say where. I was trying to stop him for questioning, and he pulled a gun, sir!\"\\n\\n She knelt and picked up the pistol, proudly handing it to Mr. Roland.\\n\\n \"I managed to disarm him, though.\"\\n\\n \"You did no such thing,\" Alek muttered, then turned to Mr. Roland. Suddenly his twitchiness was gone. \"I demand you let me go!\"\\n\\n \"Do you, now?\" Mr. Roland gave Alek a good hard look, then dropped his eyes to the pistol. \"Austrian, isn\u0027t this?\"\\n\\n Alek nodded. \"I suppose so.\"\\n\\n Deryn stared at him. Was he a Clanker after all?\\n\\n \"And where did you get it?\" Mr. Roland asked.\\n\\n Alek sighed and crossed his arms. \"In Austria. You\u0027re all being ridiculous. I only came here to bring you medicines, and you treat me like an enemy.\"\\n\\n He shouted the last word, and one of the sniffers let out a bark. Alek flinched, looking down at it in horror.\\n\\n Mr. Roland chuckled. \"Well, if you\u0027re only here to help, I suppose you\u0027ve got nothing to worry about. Come with me, young man. We\u0027ll get to the bottom of this.\"\\n\\n \"What about me, sir?\" Deryn asked. \"I was the one who captured him!\"\\n\\n Mr. Roland gave her a look that all the warrant officers reserved for mere middies, like glancing at something on the bottom of his shoe. \"Well, why don\u0027t you take those satchels to the boffins. See what they make of them.\"\\n\\n Deryn opened her mouth to protest, but the word \"boffins\" reminded her of Dr. Barlow. Right before the crash she\u0027d been headed for the machine room. Full of widgets and loose parts, it was no place to get bounced around in!\\n\\n \"Aye, sir,\" Deryn said, and headed back toward the ship at a run.\\n\\n With a quick apology to the half-deflated airbeast, she grabbed the ratlines and hoisted herself up. Her hands felt shaky and weak, but trudging all the way around the vast creature would take ages - so up and over it was.\\n\\n She pulled herself higher, forcing questions about the strange boy from her mind.\\n\\n TWENTY-FOUR\\n\\n Once over the spine Deryn could see the wreck much better.\\n\\n Men and beasts were everywhere on this flank, four searchlights stretching their shadows to monstrous proportions. The main gondola lay at an angle, half hanging from the harness, half resting in the snow. She scrambled down the ratlines and hit the ground running.\\n\\n Inside the gondola the decks and bulkheads leaned to starboard, a fun house full of overturned furniture. With the scent of hydrogen everywhere, the oil lamps had been extinguished, leaving the chaos lit with the sickly green of glowworms. Men jostled in the slanting corridors, filling the air with curses and shouted orders.\\n\\n Deryn dodged and weaved among them, hoping for a glimpse of Newkirk or Mr. Rigby. They\u0027d been dangling from this side of the ship, which had rolled skyward, so they couldn\u0027t have been crushed... .\\n\\n But the bosun had looked badly wounded. What if he\u0027d been dead before the airship had hit the snow?\\n\\n Deryn swallowed the thought and kept running. Checking on the boffin was her first responsibility, a duty she was already late for.\\n\\n She skidded to a halt outside the machine room and flung open the door. The place was a shambles. Boxes of parts had gone tumbling in the crash, leaving the floor covered with metal bits and pieces. They glimmered with the light of a wormlamp hanging aslant from the ceiling.\\n\\n \"Ah, Mr. Sharp,\" came a voice. \"At last you appear.\"\\n\\n Deryn sighed - half with relief, half with remembering how tiresome Dr. Barlow could be. She was in a corner of the room, bent over her mysterious box of cargo.\\n\\n Tazza bounded from the shadows and up to Deryn, bouncing happily on his hind legs. She scratched the beastie\u0027s ears.\\n\\n \"Sorry to keep you waiting, ma\u0027am.\" Deryn indicated the blood-caked collar of her flight suit. \"Had a bit of an accident.\"\\n\\n \"We all had an accident, Mr. Sharp. I should think that was obvious. Now could you please lend me a hand?\"\\n\\n Deryn held up the satchels. \"Sorry, ma\u0027am, but I\u0027m here to ask you - \"\\n\\n \"Time is of the essence, Mr. Sharp. I\u0027m afraid your business can wait.\"\\n\\n Deryn started to argue, then realized that the top of the cargo box had been pried off. Heat rose from the insides, a few wisps of steam ghosting the freezing air. Straw packing was strewn everywhere - the secret purpose of the trip to Constantinople at last revealed.\\n\\n \"Well, I suppose so,\" Deryn said. She made her way across the slanted floor, careful not to slip on the hay and rolly bits of metal. Tazza bounced along beside her like he\u0027d been born on the side of a hill.\\n\\n It took a moment to see into the box\u0027s shadows. But as her eyes adjusted, twelve rounded shapes resolved in the soft glow of the wormlamp.\\n\\n \"Ma\u0027am ... are those eggs?\"\\n\\n \"Indeed they are, and quite close to hatching.\" Dr. Barlow scratched Tazza\u0027s head and let out a sigh. \"Or at least, they were. Most are broken. This wasn\u0027t the smooth ride you promised me, Mr. Sharp.\"\\n\\n Deryn looked closer, and saw cracks running across the shells, a yellowish liquid seeping out. \"I reckon it wasn\u0027t. But what are they the eggs of?\"\\n\\n \"Despite our grim situation, that remains a military secret.\" Dr. Barlow gestured to the four eggs closest to her. \"These seem to be alive, Mr. Sharp. And if they\u0027re to stay that way, we\u0027ll have to keep them warm.\"\\n\\n Deryn raised an eyebrow. \"Do you want me to sit on them, ma\u0027am?\"\\n\\n \"A delightful image, but no.\" Dr. Barlow pushed both hands into the straw and withdrew two small jars that shone with a rosy light. They looked like the bottles of phosphorescent algae that the middies dropped for altitude checks.\\n\\n Dr. Barlow gave the jars a shake, and the glow grew stronger, steam rising in the cold air. She tucked them back into the hay.\\n\\n \"The electrical heater was broken in the crash, but these bacterial warmers should keep the eggs alive for now. The trick is keeping the temperature exactly right, which won\u0027t be easy.\" She pointed at a mess in one corner of the box - red shivery droplets amid shattered glass. \"You\u0027ll have to clean up the remains of that thermometer, by the way. Be careful of the mercury; it\u0027s quite poisonous.\"\\n\\n \"Could you use a new one, ma\u0027am?\" Deryn dug into one of the satchels Alek had given her. \"I happen to have a few with me.\"\\n\\n \"You have thermometers with you?\" The lady boffin blinked. \"How very useful of you, Mr. Sharp.\"\\n\\n \"Glad to be of service, ma\u0027am.\" Deryn handed one over, then opened another of the satchels. \"I\u0027ve got two more, I think.\"\\n\\n When Deryn looked up, Dr. Barlow was still staring at the thermometer.\\n\\n \"Does the Air Service generally use Clanker equipment, Mr. Sharp?\"\\n\\n Deryn\u0027s eyes widened. Was the lady boffin a barking mind reader now?\\n\\n \"But how did you ...\"\\n\\n \"Again you underestimate my eye for detail.\" She handed back the thermometer. Deryn took it and stared at both sides. It seemed normal enough to her.\\n\\n \"Note the red line at 36.8 degrees,\" Dr. Barlow said. \"Body temperature in Celsius. And yet in all my interactions with the armed forces they have never used the metric system.\"\\n\\n Deryn cleared her throat. \"Well, we\u0027re not Clankers, are we?\"\\n\\n \"Or scientists.\" Dr. Barlow plucked the thermometer from Deryn\u0027s fingers. \"So why isn\u0027t this red line at 98.6? You don\u0027t seem like a Clanker spy, Mr. Sharp, unless you\u0027re a particularly incompetent one.\"\\n\\n Deryn tried not to roll her eyes. \"I was going to tell you, ma\u0027am, but you wouldn\u0027t let me. There was this strange boy ... out in the snow. That\u0027s where I got these kits.\"\\n\\n \"A boy? And I suppose he just walked up out of nowhere, bearing thermometers.\"\\n\\n \"Aye, more or less. When I woke up after the crash, he was standing there.\"\\n\\n \"I find this story difficult to believe, Mr. Sharp.\" Dr. Barlow placed a cool palm against Deryn\u0027s bruised eye. \"Took quite a bump to your head, didn\u0027t you?\"\\n\\n \"It\u0027s not my head, ma\u0027am. It\u0027s this whole mountaintop that\u0027s dizzy. A boy just came out of nowhere! His name was Alek.\"\\n\\n Dr. Barlow shared a dubious look with Tazza. \"Mr. Sharp, we both know you\u0027re not above a bit of fibbing.\"\\n\\n Deryn gaped at the boffin, black affronted. \"I may have misled the Service about my ... particulars when I joined up, but that doesn\u0027t mean I\u0027d go telling lies for no good reason!\"\\n\\n \"Well, if you are telling the truth, then this \u0027Alek\u0027 is possibly quite interesting.\" Dr. Barlow took the thermometer back again, then gave it a shake and slipped it into the hay. \"Did he say where he lives?\"\\n\\n \"Not really.\" Deryn frowned, trying to remember Alek\u0027s exact words. \"He mentioned a village at first, but mostly talked about his family. I reckon they\u0027re outlaws - or maybe spies. He looked nervous the whole time, as bouncy as Tazza here. Then he pulled a pistol on me, and was about to blow us all to pieces! But I wrestled it away from him.\"\\n\\n \"How fortunate,\" Dr. Barlow said distractedly, as if she routinely was saved from a fiery death. She reached for one of the satchels and arranged its contents on the slanted floor. \"Field dressings, a tourniquet - no, Tazza, these aren\u0027t for sniffing - even a scalpel.\"\\n\\n \"A bit fancy for some wee village on a mountaintop,\" Deryn said. \"Don\u0027t you think?\"\\n\\n Dr. Barlow lifted a box, squinting at its label. \"And this is marked with a double-headed eagle - Austrian military issue.\"\\n\\n Deryn\u0027s eyes widened. \"We\u0027re not too far from Austria, ma\u0027am. But Switzerland\u0027s meant to be neutral!\"\\n\\n \"Technically, Mr. Sharp, we are in violation of that neutrality.\" Dr. Barlow turned the scalpel in her hand, and its blade flashed. \"This is an alarming development. But I trust we\u0027ll be taking off soon?\"\\n\\n \"I doubt it, ma\u0027am. The ship\u0027s a barking mess.\"\\n\\n \"But surely we can depart once the skin is patched, and make our repairs somewhere warmer? My eggs won\u0027t last long in this cold.\"\\n\\n Deryn started to say that she wasn\u0027t certain, having mostly been unconscious since the crash. But Dr. Barlow didn\u0027t look in the mood for blether. And from what Deryn had seen climbing over the wreck, the answer was obvious.\\n\\n \"Not for a few days, ma\u0027am. We\u0027ve lost half our hydrogen, at least.\"\\n\\n \"I see,\" the lady boffin said, sinking down against the side of the cargo box. She pulled Tazza closer, her face pale in the green light of the wormlamp. \"Then I\u0027m afraid we may not be leaving at all.\"\\n\\n \"Don\u0027t be daft, ma\u0027am.\" Deryn remembered the way Mr. Rigby always put it. \"This ship isn\u0027t some dead Clanker mechanism. It\u0027s a living creature. It can make all the hydrogen it wants. I\u0027m more worried about the engines.\"\\n\\n \"I\u0027m afraid it\u0027s not so simple, Mr. Sharp.\" Dr. Barlow gestured across the slanted room to the porthole. \"Have you looked outside?\"\\n\\n \"Aye, I\u0027ve been out there half the night!\" Deryn remembered the word the strange boy had used. \"It\u0027s what they call a glacier, ma\u0027am.\"\\n\\n \"I\u0027m familiar with the concept,\" Dr. Barlow said. \"A great sheet of ice, as dead as the poles themselves. How high in the mountains do you suppose we are?\"\\n\\n \"Well, the Clankers hit us at eight thousand feet. And maybe we dropped a thousand or two before we hit the snow ...\"\\n\\n \"Well above the tree line,\" Dr. Barlow said softly. \"My grandfather\u0027s bees won\u0027t be finding much nectar out there, will they?\"\\n\\n Deryn frowned. She hadn\u0027t seen a single living creature out on the snowy waste. Which meant no flowers for the bees, no insects for the bats.\\n\\n \"But what about the hawks and the other raptors, ma\u0027am? They can fly a barking long way to hunt.\"\\n\\n Dr. Barlow nodded. \"They might find prey in a nearby valley. But the Leviathan needs more than a few mice and hares to heal herself. This place is a biological wasteland, empty of everything she needs to survive.\"\\n\\n Deryn wanted to argue, but the ship had to eat to get healthy, just like any natural creature. And there wasn\u0027t a scrap of food out on that bleak expanse of snow.\\n\\n \"You mean there\u0027s nothing we can do?\"\\n\\n \"I did not say that, Mr. Sharp.\" Dr. Barlow stood up, pointing at a pile of jars on the slanted floor. \"First we shall get these eggs to the proper temperature. Give those warmers a shake.\"\\n\\n \"Right, ma\u0027am!\"\\n\\n \"And then I want to meet this mysterious boy of yours.\"\\n\\n TWENTY-FIVE\\n\\n Alek was miserable, humiliated, and tired. But he was too cold to sleep.\\n\\n Smashed windows and bullet holes were everywhere in the wounded airship, and icy winds howled down the slanted corridors. Even Alek\u0027s cabin, with a locked door and closed porthole, was freezing. Instead of an oil lamp to warm his hands against, the cabin was lit by the same green worms that covered the ship\u0027s skin. Dozens were stuffed into a lantern that hung from the ceiling, squirming like glowing lice.\\n\\n The whole wreck was overrun with godless vermin. The awful six-legged dogs swarmed its wilting gasbag, and flying creatures filled the air. Even here inside the gondola, reptiles of all sizes scuttled along the walls. While the ship\u0027s officers had interrogated Alek, a sticky-footed talking lizard had tromped to and fro across the tilted ceiling, repeating random snatches of their conversation.\\n\\n Not that Alek had said much. The answers to the officers\u0027 questions - where he\u0027d come from, why he was here - were beyond their understanding. There was no point telling the Darwinists his real name; they\u0027d never believe he was the son of an archduke. And when he\u0027d tried to tell them how dangerous it was to keep him here, the warnings had sounded like empty, pompous threats.\\n\\n He\u0027d been such a fool - this vast creature, these people were so alien. It was madness to try to cross the gulf between his world and theirs.\\n\\n Locked in the cold, dark cabin, Alek wondered if his noble intentions had been a joke from the beginning. As if anyone could carry food for a hundred men across that glacier, every night and in secret. Perhaps he\u0027d come here only out of morbid curiosity, drawn like a child to a dead bird on the ground.\\n\\n Through the cabin\u0027s small porthole the black horizon was slowly turning gray. Time was running out.\\n\\n Otto Klopp would soon come to take the second watch. A quick search would prove that Alek wasn\u0027t in the castle, and it wouldn\u0027t take much imagination to figure out where he\u0027d gone. Within a few hours Count Volger would be gazing at the grounded airship, drawing his plans and pondering the fact that the heir to the throne of Austria-Hungary was a complete idiot. \\n\\n","sourceLink":"https://allnovel.net/leviathan-leviathan-1/page-19.html","bookId":1574,"book":{"id":1574,"title":"Leviathan (Leviathan #1)","description":"Storyline: Leviathan (Leviathan #1) \\n Prince Aleksander, would-be heir to the Austro-Hungarian throne, is on the run. His own people have turned on him. His title is worthless. All he has is a battletorn war machine and a loyal crew of men. \\n Deryn Sharp is a commoner, disguised as a boy in the British Air Service. She\u0027s a brilliant airman. But her secret is in constant danger of being discovered. \\n With World War I brewing, Alek and Deryn\u0027s paths cross in the most unexpected way…taking them on a fantastical, around-the-world adventure that will change both their lives forever.\\n","cover":"https://allnovel.net/images/leviathan-leviathan-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/leviathan-leviathan-1.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:55:31 PM"}}
