{"id":104262,"no":150,"title":"Page 150","content":"The Factor shrugged, then said, ‘They asked about you, then decided maybe someone had torched you out of spite-and that’s breaking the law and the Edur don’t like it when that happens-’ ‘And they told you to do your job, did they?’ Arbat laughed at the man. ‘That’d be a first!’ ‘Vrager, you said- is that a formal accusation, Arbat? If it is, you gotta dictate and make your mark and stay round for the convening and if Vrager hires an advocate-’ ‘Vrager’s got a cousin in Letheras who’s just that,’ someone said. The Factor nodded. ‘All this could take a damned while, Arbat, and ain’t none of us obliged to give you a roof overhead, neither-’ ‘So best I don’t cause trouble, right? You can tell the Edur I wasn’t making no formal complaint, so that’s that. And what with the shacks pretty much burnt down by now and the chill seeping into your bones and no sign the fire’s jumped anywhere…’ Arbat slapped the Factor on the shoulder-a gesture that nearly drove the man to his knees-then stepped past. ‘Make way, the rest of you-could be I’m still contagious with all the sick you been dumping in my cart.’ That worked readily enough, and Arbat’s way was suddenly clear. And on he walked. They’d give Vrager some trouble-not good calling down the Edur’s regard, after all-but it’d be nothing fatal. Pissing against a door don’t forfeit the fool’s life, now did it? Anyway, the Edur would ride on, to wherever it was they were going, and he’d leave them- What now? Horses on the road, riders coming at the canter. Grumbling under his breath, Old Hunch Arbat worked his way to one verge, then waited. Another damned troop. Letherii this time. The lead rider, an officer, slowed her mount upon seeing Arbat, and the troop behind her did the same at her command. As she trotted her horse closer, she called out, ‘You, sir-is there a village ahead?’ ‘There is,’ Arbat replied, ‘though you might have to fight for room at the inn.’ And why’s that?’ she asked as she rode opposite. ‘Some Edur staying the night there.’ At that the officer reined in, gesturing the rest to a halt. twisting in her saddle, she eyed him from beneath the ridge of her iron helm. ‘Tiste Edur?’ ‘That’s them all right.’ ‘What are they doing there?’ Before he could answer, one of her soldiers said, Atri-Preda, something’s blazing ahead-y’can see the glow and smell it.’ ‘That’d be my homestead,’ Arbat replied. ‘Accident. It won’t spread, I’m sure of that as can be. Got nothing to do,’ he added, ‘with them Edur. They’re just passing through.’ The Atri-Preda swore under her breath. ‘Tarthenal, yes?’ ‘Mostly.’ ‘Can you think of anywhere we can camp for the night, then? Close by, but well off the trail.’ Arbat squinted at her. ‘Off the trail, eh? Far enough off so’s your privacy ain’t disturbed, you mean?’ She nodded. Arbat rubbed at the bristly hair covering his prognathous jaw. ‘Forty or so paces up there’s a trail, right side of the road. Leads through a thicket, then an old orchard, and beyond that there’s an abandoned homestead-barn’s still got a roof, though I doubt it’s weatherproof. There’s a well too, which should be serviceable enough.’ ‘This close by, and no-one’s occupied it or stripped it down?’ Arbat grinned. ‘Oh, they’ll get to that before long. It was downwind of my place, you see.’ ‘No, I don’t.’ His grin broadened into a smile. ‘Local colour kinda pales when told to outsiders. It’s no matter, really. All you’ll be smelling is woodsmoke this night, and that’ll keep the bugs away.’ He watched as she thought about pressing the matter; then, as her horse tossed its head, she gathered the reins once more. ‘Thank you, Tarthenal. Be safe in your journey.’ ‘And you, Atri-Preda.’ They rode on, and Arbat waited on the verge for the troop to pass. Safe in my journey. Yes, safe enough, 1 suppose. Nothing on the road I can’t handle. No, it’s the destination that’s got my knees knocking together like two skulls in a sack. Lying on his stomach, edging up to the trapdoor, peering down. A menagerie in the room below, yet comforting in its odd domesticity nonetheless. Why, he knew artists who would pay for such a scene. Ten hens wandering about, occasionally squawking from the path of a clumsily swung foot from Ublala Pung as the huge man paced back and forth. The scholar Janath sitting with her back to one wall, rolling chicken down or whatever it was called between the palms of her hands, prior to stuffing it into a burlap sack that was intended to serve as a pillow at some point-proving beyond all doubt that academics knew nothing about anything worth knowing about. Not to mention inserting a sliver of fear that Bugg’s healing of her mind had not been quite up to scratch. And finally, Bugg himself, crouched by the hearth, using a clawed hen foot to stir the steaming pot of chicken soup, a detail which, Tehol admitted, had a certain macabre undercurrent. As did the toneless humming coming from his stalwart manservant.","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-150.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
