{"id":104268,"no":156,"title":"Page 156","content":"She had torn away an eye. Gone. Crushed in one bloody hand. But her blood gleamed on his knife. Enough. More than enough. The Errant, one hand outstretched, lone eye struggling to make sense of a battered, broken perspective, staggered towards the doorway. AH I need. Trailing blood, Feather Witch dragged herself to the far wall, where she curled up, in one stained hand the eye of a god, in the other the severed finger of Brys Beddict-it felt swollen now, as if it absorbed the Errant’s blood. Warm, no, hot. ‘Collecting,’ she whispered. The ghost of the Ceda drew close. ‘You are dying, child. You need a healer.’ She spat. ‘Then find me one.’ The brazier’s coals pulsed, but all she could feel was cold, deep in her body, spreading outward to steal all life from her limbs. ‘Hurry,’ she said in a mumble. But no-one replied. The Errant stumbled down the bridge. To either side, the tiles of the Cedance spun in confused mayhem. He barked out a laugh, holding the slick knife before him as if it was a torch-he could feel the heat searing his face, drying the blood and other fluids weeping down from his left socket. Someone had been here. Not long past. Hannan Mosag. Delving the mysteries of ancient power. But he was Tiste Edur. A stranger to these forces. No, they are mine. They were always mine. And now I come. To reclaim them. And 1 challenge you, Master of the Deck, whoever, whatever you are. Face me here, if you’ve the courage. I challenge you! The Errant reached the centre dais, held the knife high, then flung it down onto the tiles. The point sank deep into painted stone. He stared down. One eye. Widening. The knife had pierced the centre of a tile, nailing it in place. The others now began swirling round it, as if drawn into a vortex. The centre of a tile. His own. The blade buried in the chest of the image. My chest. What does that mean? No matter. What other tile could it possibly choose? The world trembled-he could feel it, deep in its core, spreading in ripples, those ripples rising, devouring energy, lifting into waves. The waves heaving higher, gaining speed, lifting… The Errant laughed as power burgeoned within him. ‘Mortal blood!’ Was she dead now? He’d struck her twice. Driven the weapon deep. She would have spilled out by now. A corpse huddled in that cursed chamber. Until the rats found her. And this was well. She could not be allowed to survive-he wanted no High Priestess, no mortal bound to his resurrected godhood. The other prayers I can swallow. Ignore. They all know 1 never answer. Never give a thing away. Expecting nothing, so they receive nothing, and I am not bound to them. But a High Priestess… He would have to make sure. Go back. And make sure. The Errant spun round, began walking. ‘Bastard,’ Feather Witch said, her mouth filled with the taste of blood. Running from her nostrils, bubbling at the back of her throat. Immense pressures crushing her chest on the right side. She could wait no longer. The ghost was too late. ‘I am dying.’ No. Errant, bastard god, forgotten god, hungry god. Well, you are not the only hungry one around here. She bared her teeth in a red smile, then pushed the mangled eyeball into her mouth. And swallowed. The Errant staggered, rebounded from a corridor wall, as something reached into his chest and tore free a welter of power. Stole it away. Leaving a cavern of agony. ‘The bitch!’ The roar echoed against cold stone. And he heard her voice, filling his skull: ‘lam yours now. You are mine. Worshipper and worshipped, locked together in mutual hate. Oh, won’t that twist things, yes? ‘You should have found someone else, Errant. I have read the histories. Destrai Anant, God Chosen, the Well of the Spirit. Feather Witch. You are mine. I am yours. And listen to my prayer-listen! Your Destrai demands it! In my hand, now, waits our Mortal Sword. He too has tasted your blood. Your power can heal him as it has done me. Do you not still feel his’-malicious delight-‘touch?’ Her laughter rasped in his head, rebounding bitter with his stolen power. ‘Summon him, Errant. We need him.’ ‘No.’ ‘We need him! And a Shield Anvil-a T’orrud Segul in the language of the First Empire. Which of us shall choose? Oh, of course, you would claim that right for yourself. But I have a candidate. Another wrapped tight in webs of spite-I utter his name and so find a face to my deepest hatred-is that not well suited? ‘And yes, he still lives. Udinaas. Let us make of this priesthood a company of betrayers. Let us claim the Empty Throne-it was ever rightfully ours, Errant-beloved.","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-156.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
