{"id":104279,"no":167,"title":"Page 167","content":"‘Stone-tipped arrows-you are truly a fool. They will break against Letherii armour. I can expect nothing from you. At least I discover that now, instead of in the midst of battle.\\n\\n Toe Anaster settled back on his haunches and watched Torrent march out of the firelight. Off… somewhere. Somewhere important. Like the latrines. He resumed examin-ing the fletching on the Imass arrows. Gift of an old friend That clunking, creaking collection of droll bones. He could barely recall the last time he was among friends. Gruntle perhaps. Another continent. A drunken evening-wa: that Saltoan wine? Gredfallan ale? He couldn’t recall.\\n\\n Surrounding him, the murmur of thousands-their moving through the camp, their quiet conversations around the cookfires. Old men and old women, the lame, the young. A fire burning for each and every Awl.\\n\\n And somewhere out on the plain, Redmask and his warriors-a night without fires, without conversations. Nothing, I imagine, but the soft honing of weapon edges. Iron and stone whispering in the night.\\n\\n A simple deceit, its success dependent on Letherii expectations. Enemy scouts had spotted this camp, after all, As predicted. Countless fires in the darkness, appropriately close to Bast Fulmar, the site of the impending battle. All the way it was supposed to be.\\n\\n But Redmask had other plans. And to aid in the deception, Toc suspected, some arcane sorcery from the K’Chain Che’Malle.\\n\\n An elder appeared, walking into the fire’s glow on bowed legs. Toc had seen this one speaking to Redmask, often riding at the war leader’s side. He crouched down opposite Toc and studied him for a dozen heartbeats, then spat into the flames, nodded at the answering sizzle, and spoke: ‘I do not trust you.’\\n\\n ‘I’m crushed.’\\n\\n ‘Those arrows, they are bound in ritual magic. Yet no spirit has blessed them. What sort of sorcery is that? Letherii? Are you a creature of the Tiles and Holds? A traitor in our midst. You plot betrayal, vengeance against our abandoning you.’\\n\\n Trying to inspire me, Elder? Sorry to disappoint you, but there are no embers in the ashes, nothing to stir to life.’\\n\\n ‘You are young.’\\n\\n ‘Not as young as you think. Besides, what has that to do with anything?’\\n\\n ‘Redmask likes you.’\\n\\n Toc scratched the scar where an eye had been. ‘Are your wits addled by age?’\\n\\n A grunt. ‘I know secrets.’\\n\\n ‘Me too.’\\n\\n ‘None to compare with mine. I was there when Redmask’s sister killed herself.’\\n\\n ‘And I suckled at the tit of a K’Chain Che’Malle Matron. If tit is the right word.’\\n\\n The old man’s face twisted in disbelief. ‘That is a good lie. But it is not the game I am playing. I saw with my own eyes the great sea canoes. Upon the north shore. Thousands upon thousands.’\\n\\n Toc began returning the arrows to the hide quiver.\\n\\n ‘These arrows were made by a dead man. Dead for a hundred thousand years, or more.’\\n\\n The wrinkled scowl opposite him deepened. ‘I have seen skeletons running in the night-on this very plain.’\\n\\n ‘This body you see isn’t mine. I stole it.’\\n\\n ‘I alone know the truth of Bast Fulmar.’\\n\\n ‘This body’s father was a dead man-he gasped his last breath even as his seed was taken on a field of battle.’\\n\\n ‘The victory of long ago was in truth a defeat.’\\n\\n ‘This body grew strong on human meat.’\\n\\n ‘Redmask will betray us.’\\n\\n ‘This mouth waters as I look at you.’\\n\\n The old man pushed himself to his feet. ‘Evil speaks in lies.’\\n\\n ‘And the good know only one truth. But it’s a lie, because there’s always more than one truth.’\\n\\n Another throatful of phlegm into the campfire. Then a complicated series of gestures, the inscribing in the air above the flames of a skein of wards that seemed to swirl for a moment in the thin smoke. ‘You are banished,’ the elder then pronounced.\\n\\n ‘You have no idea, old man.’\\n\\n ‘I think you should have died long ago.’\\n\\n ‘More times than I can count. Started with a piece of a moon. Then a damned puppet, then… oh, never mind.’\\n\\n ‘Torrent says you will run. In the end. He says your courage is broken.’\\n\\n Toc looked down into the flames. ‘That may well be,’ he said.\\n\\n ‘He will kill you then.’\\n\\n ‘Assuming he can catch me. If there’s one thing I know how to do, it’s ride a horse.’\\n\\n With a snarl, the elder stormed off.\\n\\n ‘Courage,’ Toc muttered to himself. ‘Yes, there is that. And maybe cowardice truly is bred in the very bones.’ Because let’s face it, Arxaster was no cold iron. Nor hot, for that matter. \\n\\n","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-167.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... \\n A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.\\n","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
