{"id":104318,"no":208,"title":"Page 208","content":"But when they died here, they had been on the run. Some of those swaths of material were from tents. Flesh and blood Imass did not pursue them-not across this lifeless ice. No, they must have been T’lan. Of the Ritual. Like Emroth here.\n ‘So,’ Hedge said, his own voice startlingly loud in his ears, ‘were you involved in this hunt, Emroth?’\n ‘I cannot be certain,’ she replied after a long moment. ‘It is possible.’\n ‘One scene of slaughter looks pretty much the same as the next, right?’\n ‘Yes. That is true.’\n Her agreement left him feeling even more depressed.\n ‘There is something ahead,’ the T’lan Imass said. ‘We are, I believe, about to discover the answer to the mystery’\n ‘What mystery?’\n ‘The absence of bodies.’\n ‘Oh, that mystery’\n Night came abruptly to this place, like the snuffing out of a candle. The sun, which circled just above the horizon through the day, would suddenly tumble, like a rolling ball, beneath the gleaming, blood-hued skyline. And the black sky would fill with stars that only faded with the coming of strangely coloured brushstrokes of light, spanning the vault, that hissed like sprinkled fragments of fine glass.\n Hedge sensed that night was close, as the wind’s pockets of warmth grew more infrequent, the ember cast to what he assumed was west deepening into a shade both lurid and baleful.\n He could now see what had caught Emroth’s attention. A hump on the plateau, ringed in dark objects. The shape rising from the centre of that hillock at first looked like a spar of ice, but as they neared, Hedge saw that its core was dark, and that darkness reached down to the ground.\n The objects surrounding the rise were cloth-swaddled bodies, many of them pitifully small.\n As the day’s light suddenly dropped away, night announced on a gust of chill wind, Hedge and Emroth halted just before the hump.\n The upthrust spar was in fact a throne of ice, and on it sat the frozen corpse of a male Jaghut. Mummified by cold and desiccating winds, it nevertheless presented an imposing if ghastly figure, a figure of domination, the head tilted slightly downward, as if surveying a ring of permanently supine subjects.\n ‘Death observing death,’ Hedge muttered. ‘How damned appropriate. He collected the bodies, then sat down and just died with them. Gave up. No thoughts of vengeance, no dreams of resurrection. Here’s your dread enemy, Emroth.’\n ‘More than you realize,’ the T’lan Imass replied.\n She moved on, edging round the edifice, her hide-wrapped feet plunging through the crust of brittle ice in small sparkling puffs of powdery snow.\n Hedge stared up at the Jaghut on his half-melted throne. All thrones should be made of ice, 1 think.\n Sit on that numb arse, sinking down and down, with the puddle of dissolution getting ever wider around you. Sit, dear ruler, and tell me all your grand designs.\n Of course, the throne wasn’t the only thing falling apart up there. The Jaghut’s green, leathery skin had sloughed away on the forehead, revealing sickly bone, almost luminescent in the gloom; and on the points of the shoulders the skin was frayed, with the polished knobs of the shoulder bones showing through. Similar gleams from the knuckles of both hands where they rested on the now-tilted arms of the chair.\n Hedge’s gaze returned to the face. Black, sunken pits for eyes, a nose broad and smashed flat, tusks of black silver. I thought these things never quite died. Needed big rocks on them to keep them from getting back up. Or chopped to pieces and every piece planted under a boulder.\n I didn’t think they died this way at all.\n He shook himself and set off after Emroth.\n They would walk through the night. Camps, meals and sleeping were for still-breathing folk, after all.\n ‘Emroth!’\n The head creaked round.\n ‘That damned thing back there’s not still alive, is it?’\n ‘No. The spirit left.’\n ‘Just… left?’\n ‘Yes.’\n ‘Isn’t that, uh, unusual?’\n ‘The Throne of Ice was dying. Is dying still. There was-is-nothing left to rule, ghost. Would you have him sit there for ever?’ She did not seem inclined to await a reply, for she then said, ‘I have not been here before, Hedge of the Bridgeburners. For I would have known.’\n ‘Known what, Emroth?’\n ‘I have never before seen the true Throne of Ice, in the heart of the Hold. The very heart of the Jaghut realm.’\n Hedge glanced back. The true Throne of Ice? ‘Who-who was he, Emroth?’ \n","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-208.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: \n All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... \n A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.\n \n","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
