{"id":104338,"no":228,"title":"Page 228","content":"Pray to the Worm, pay an army of disgruntled malcontents. Somehow, all you believers, I doubt that was in your prayers.\n Poor Brullyg had few allies in this chamber. Balm’s source of lust, this Captain Shurq Elalle of the privateer Undying Gratitude, and her first mate, Skorgen Kaban the Pretty. And neither seemed eager to leap to Brullyg’s side of the sandpit.\n But that Shurq, she was damned watchful. Probably a lot more dangerous than the usurper of this cruddy island.\n The Adjunct had been explaining, in decent traders’ tongue, the new rules of governance on Second Maiden Fort, and with each statement Brullyg’s expression had sagged yet further.\n Entertaining, if one was inclined towards sardonic humour.\n ‘Ships from our fleet,’ she was now explaining, ‘will be entering the harbour to resupply. One at a time, since it wouldn’t do to panic your citizens-’\n A snort from Shurq Elalle, who had drawn her chair to one side, almost in front of where Throatslitter leaned against the wall, to permit herself a clear view of host and guests. Beside her, Skorgen was filling his prodigious gut with Brullyg’s favourite ale, the tankard in one hand, the finger of the other hand exploring the depths of one mangled, rose-red ear. The man had begun a succession of belches, each released in a heavy sigh, that had been ongoing for half a bell now, with no sign of ending. The entire room stank of his yeasty exhalations.\n The captain’s derisive expostulation drew the Adjunct’s attention. ‘I understand your impatience,’ Tavore said in a cool voice, ‘and no doubt you wish to leave. Unfortunately, I must speak to you and will do so shortly-’\n ‘Once you’ve thoroughly detailed Brullyg’s emasculation, you mean.’ Shurq lifted one shapely leg and crossed it on the other, then laced together her hands on her lap, smiling sweetly up at the Adjunct.\n Tavore’s colourless eyes regarded the pirate captain for a long moment, then she glanced over to where stood her retinue. ‘Banaschar.’\n ‘Adjunct?’\n ‘What is wrong with this woman?’\n ‘She’s dead,’ the ex-priest replied. ‘A necromantic curse.’\n Are you certain?’\n Throatslitter cleared his throat and said, Adjunct, Corporal Deadsmell said the same thing when we saw her down in the tavern.’\n Brullyg was staring at Shurq with wide, bulging eyes, his jaw hanging slack.\n At Shurq’s side, Skorgen Kaban was suddenly frowning, his eyes darting. Then he withdrew the finger that had been plugging one ear and looked down at the gunk smeared all over it. After a moment, Pretty slid that finger into his mouth.\n ‘Well,’ Shurq sighed up at Tavore, ‘you’ve done it now, haven’t you? Alas, the coin of this secret is the basest of all, namely vanity. Now, if you possess some unpleasant bigotry regarding the undead, then I must re-evaluate my assessment of you, Adjunct. And your motley companions.’\n To Throatslitter’s surprise, Tavore actually smiled. ‘Captain, the Malazan Empire is well acquainted with undead, although few possessing your host of charms.’\n Gods below, she’s flirting with this sweet’Scented corpse!\n ‘Host indeed,’ murmured Banaschar, then was so rude as to offer no elaboration. Hood-damned priests. Good for nothing at all.\n ‘In any case,’ Tavore resumed, ‘we are without prejudice in this matter. I apologize for posing the question leading to this unveiling. I was simply curious.’\n ‘So am I,’ Shurq replied. ‘This Malazan Empire of yours-do you have any particular reason for invading the Lether Empire?’\n ‘I was led to understand that this island is independent-’\n ‘So it is, since the Edur Conquest. But you’re hardly invading one squalid little island. No. You’re just using this to stage your assault on the mainland. So let me ask again, why?’\n ‘Our enemy,’ the Adjunct said, all amusement now gone, ‘are the Tiste Edur, Captain. Not the Letherii. In fact, we would encourage a general uprising of Letherii-’\n ‘You won’t get it,’ Shurq Elalle said.\n ‘Why not?’ Lostara Yil asked.\n ‘Because we happen to like things the way they are. More or less.’ When no-one spoke, she smiled and continued, ‘The Edur may well have usurped the rulers in their absurd half-finished palace in Letheras. And they may well have savaged a few Letherii armies on the way to the capital. But you will not find bands of starving rebels in the forests dreaming of independence.’\n ‘Why not?’ Lostara demanded again in an identical tone. \n","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-228.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: \n All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... \n A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.\n \n","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
