{"id":104400,"no":291,"title":"Page 291","content":"But now 1 know what it means to be a marine in the Malazan Army, even if the empire’s decided we’re outlaws or something. Still marines. Still the elite and that’s worth fighting for-the soldier at your side, the one in the stretcher, the one on point. Not sure about Smiles, though. Not sure about her at all. Reminds me of Dunsparrow, with that knowing look in her eyes and the way she licks her lips whenever someone talks about killing. And those knives-no, not sure about her at all.\n At least they had a good corporal, though. A tough bastard not interested in words. Shield and sword did all Tarr’s talking, and Corabb always found himself rushing forward to stand at the man’s side in every scrap. Sword-arm side, but a step forward since Tarr used that short-bladed sticker so his parrying was foreshortened and that risked too much close-in stuff, the quick dirty underhanded kind-the style the desert tribes would use against a shield-wall soldier like Tarr-when there was no shield-wall, when it was just the one man, flank exposed and guard too tight. Batter and wail at the shield until his knees bent a fraction more and he ducked in behind and below that shield, left leg forward-then just sidestep and slip round the shield, over or under that stabbing shortsword, to take arm tendons or the unprotected underarm.\n Corabb knew he needed to protect Tarr on that side, even if it meant disobeying Fiddler’s orders about staying close to Bottle. So long as Bottle looked to be out of trouble, Corabb would move forward, because he understood Tarr and Tarr’s way of fighting. Not like Koryk, who was more the desert warrior than any other in these two squads, and. what he needed fending his flanks was someone like Smiles, with her flicking knives, crossbow quarrels and the like. Staying back and to one side, out of range of Koryk’s frenzied swings of his longsword, and take down the enemy that worked in from the flanks. A good pairing, that.\n Cuttle, the miserable old veteran, he had his cussers, and if Bottle got in danger the sapper would take care of things. Was also pretty sharp and quick with the crossbow, an old hand at the release and load-while-you-run.\n It was no wonder Seven Cities was conquered the first time round, with Malazan marines in the field. Never mind the T’lan Imass. They’d only been let loose at the Aren uprising, after all. And if Fiddler’s telling the truth, that wasn’t the Emperor at all. No, it was Laseen who’d given the order.\n Gesler ain’t convinced, so the truth is, no-one knows the truth. About Aren.]ust like, 1 suppose, pretty soon no-one will know the truth about Coltaine and the Chain of Dogs, or-spirits below-the Adjunct and the Bonehunters at Y’Ghatan, and at Mala? City.\n He felt a chill whisper through him then, as if he’d stumbled onto something profound. About history. As it was remembered, as it was told and retold. As it was lost to lies when the truth proved too unpleasant. Something, aye… Something… Damn.’ Lost it.’\n From the stretcher behind him, Bottle muttered in his sleep, then said, distinctly: ‘He never sees the owl. That’s the problem.’\n Poor bastard. Rawng in delirium. Exhausted. Sleep easy, soldier, we need you.\n I need you. Like Leoman never needed me, that’s how 1 need you. Because I’m a marine now. I suppose.\n Ask the mice,’ Bottle said. ‘They’ll tell you.’ He then mumbled something under his breath, before sighing and saying: ‘If you want to live, pay attention to the shadow. The shadow. The owl’s shadow.’\n At the other end of the stretcher, Cuttle grunted then shook the handles until Bottle groaned again and edged onto his side. Whereupon the young mage fell silent.\n They continued on through the night. And once more, sometime later, they heard detonations in the distance again. These ones to the north.\n Oh, they’d stirred ‘em awake all right.\n Shurq Elalle’s herbs were getting stale. It had been all right out on the Undying Gratitude, on a wind-whipped deck and in the privacy of her cabin. And with a man with no nose for company. But now she found herself in a cramped map room with a half-dozen foreigners and Shake.Brullyg, the eponymous king of this miserable little island, and-especially among the women-she could see their nostrils wrinkle as they caught unpleasant aromas in the turgid, over-warm air.\n Oh well. If they wanted to deal with her, they’d have to live with it. And be grateful for that ‘living’ part. She eyed the Adjunct, who never seemed to want to actually sit down; and although she stood behind the chair she had claimed at one end of the long, scarred table, hands resting on its back, she revealed none of the restlessness one might expect from someone for whom sitting felt like a sentence in a stock in the village square. \n","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-291.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: \n All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... \n A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.\n \n","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
