{"id":104480,"no":372,"title":"Page 372","content":"In any case, thereafter satisfied and pleasantly feeling… pleasant, Hellian was anything but pleased when Balgrid’s appallingly unattractive face loomed into view directly in front of her. She blinked at him. ‘You’re shorter than I’d thought.’ ‘Sergeant, I’m kneeling. What are you doing under the bar?’ ‘I’m not the one who keeps movin’ it, Baldy.’ ‘The other sergeants have agreed that we’re staying here for a while. You with them on that, Sergeant?’ ‘Why not?’ ‘Good. Oh, did you know, in the new squads, there’s another Kartoolii.’ ‘Probbly a spy-they’re still after me, y’know.’ ‘Why would they be after you?’ ‘Cause I did something, that’s why. Can’t ‘member ‘xactly what, but it was bad ‘nough to get me sent here, wasn’t it? A damned spy!’ ‘I doubt he’s anything-’ ‘Yeah? Fine, make him come ‘ere and kiss my feet, then! Tell ‘im I’m the Queen of Kartool! An’ I want my kissed feet! My feeted kiss, I mean. Go on, damn you!’ Less than six paces away, tucked beneath the bar at the other end, sat Skulldeath; Hiding from that pretty but way too lustful woman in Fiddler’s squad. And at Hellian’s words his head snapped round and his dark, almond-shaped eyes, which had already broken so many hearts, slowly widened on the dishevelled sergeant crouched in a pool of spilled wine. Queen of Kartool. On such modest things, worlds changed. The women were singing an ancient song in a language that was anything but Imass. Filled with strange clicks and phlegmatic stops, along with rhythmic gestures of the hands, and the extraordinary twin voices emerging from each throat, the song made the hair on the back of Hedge’s neck stand on end. ‘Eres’al,’ Quick Ben had whispered, looking a little ashen himself. ‘The First Language.’ No wonder it made the skin crawl, awakening faint echoes in the back of his skull-as if stirring to life the soft murmurings of his mother a handful of days after he’d been born, even as he clung by the mouth to her tit and stared stupidly up at the blur of her face. A song to make a grown man feel horribly vulnerable, weak in the limbs and desperate for comfort. Muttering under his breath, Hedge plucked at Quick Ben’s sleeve. The wizard understood well enough and they both rose, then backed away from the hearth and all the gathered Imass. Out into the darkness beneath a spray of glittering stars, up into the sprawl of tumbled boulders away from the rock shelters of the cliff face. Hedge found a flat stone the size of a skiff, lying at the base of a scree. He sat down on it. Quick Ben stood nearby, bending down to collect a handful of gravel, then pacing as he began examining his collection-more by feel than sight-flinging rejections off into the gloom to bounce and skitter. ‘So, Hedge.’ ‘What?’ ‘How’s Fiddler these days?’ ‘It’s not like I’m squatting on his shoulder or anything.’ ‘Hedge.’ ‘All right, I catch things occasionally. Whiffs. Echoes. He’s still alive, I can say that much.’ Quick Ben paused. ‘Any idea what the Adjunct’s up to?’ ‘Who? No, why should I-never met her. You’re the one should be doing the guessing, wizard. She shackled you into being her High Mage, after all. Me, I’ve been wandering for what seems for ever, in nothing but the ashes of the dead. At least until we found this place, and it ain’t nearly as far away from the underworld as you might think.’ ‘Don’t tell me what I think, sapper. I already know what I think and it’s not what you think.’ ‘Well now, you’re sounding all nervous again, Quick. Little heart going pitterpat?’ ‘She was taking them to Lether-to the Tiste Edur empire-once she managed to extricate them from Malaz harbour. Now, Cotillion says she managed that, despite my disappearing at the worst possible moment. True, some nasty losses. Like Kalam. And T’amber. Me. So, Lether. Pitching her measly army against an empire spanning half a continent or damn near, and why? Well, maybe to deliver some vengeance on behalf of the Malazan Empire and every other kingdom or people who got cut up by those roving fleets. But maybe that’s not it at all, because, let’s face it, as a motive it sounds, well, insane. And I don’t think the Adjunct is insane. So, what’s left?’ ‘Sorry, was that actually a question? For me?’ ‘Of course not, Hedge. It was rhetorical.’","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-372.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
