{"id":104547,"no":442,"title":"Page 442","content":"‘One? There should be two.’ ‘The challenger known as Icarium has fled, Emperor. Into the city. We are hunting him down.’ Liar. But Rhulad Sengar seemed indifferent, his head turning to one side, eyes lowering until they fixed on the gore-spattered sword. ‘The Toblakai.’ ‘Yes, Emperor.’ ‘Who murdered Binadas. My brother.’ ‘Indeed, sire.’ The head slowly lifted. ‘Is it dawn?’ ‘It is.’ Rhulad’s command was soft as a breath. ‘Bring him.’ They let the poor fool go once he had shown them the recessed door leading under the city wall. It was, of course, locked, and while the rest of the squads waited in the slowly fading darkness-seeking whatever cover they could find and it wasn’t much-Fiddler and Cuttle went down into the depression to examine the door. ‘Made to be broken down,’ Cuttle muttered, ‘so it’s like the lad said-we go in and then the floodgates open and we drown. Fid, I don’t see a way to do this, not quietly enough-so as no-one hears and figures out we’ve taken the trap.’ Fiddler scratched at his white beard. ‘Maybe we could dismantle the entire door, frame and all.’ ‘We ain’t got the time.’ ‘No. We pull back and hide out for the day, then do it tomorrow night.’ ‘The Adjunct should be showing up by then. Keneb wants us first in and he’s right, we’ve earned it.’ At that moment they heard a thump from behind the door, then the low scrape of the bar being lifted. The two Malazans moved to either side, quickly cocking their crossbows. A grinding sound, then the door was pushed open. The figure that climbed into view was no Letherii soldier. It was wearing plain leather armour that revealed, without question, that it was a woman, and on her face an enamel mask with a modest array of painted sigils. Two swords strapped across her back. One stride, then two. A glance to Fiddler on her right, then to Cuttle on her left. Pausing, brushing dirt from her armour, then setting out. Onto the killing field, and away. Bathed in sweat, Fiddler settled back into a sitting position, the crossbow trembling in his hands. Cuttle made a warding gesture, then sat down as well. ‘Hood’s breath was on my neck, Fid. Right there, right then. I know, she didn’t even reach for those weapons, didn’t even twitch…’ ‘Aye,’ Fid answered, the word whispered like a blessing. A Hood-damned Seguleh. High ranked, too. We’d never have got our shots off-no way. Our heads would have rolled like a pair of oversized snowballs. ‘I looked away, Fid. I looked right down at the ground when she turned my way.’ ‘Me too.’ ‘And that’s why we’re still alive.’ ‘Aye.’ Cuttle turned and peered down into the dark tunnel. ‘We don’t have to wait till tomorrow night after all.’ ‘Go back to the others, Cuttle. Get Keneb to draw ‘em up. I’m heading in to check the other end. If it’s unguarded and quiet, well and good, If not…’ ‘Aye, Fid.’ The sergeant dropped down into the tunnel. He moved through the dark as fast as he could without making too much noise. The wall overhead was damned thick and he’d gone thirty paces before he saw the grey blur of the exit at the end of a sharp slope. Crossbow in hands, Fiddler edged forward. He need not have worried. The tunnel opened into a cramped blockhouse with no ceiling. One bench lined the wall to his right. Three bodies were sprawled on the dusty stone floor, bleeding out from vicious wounds. Should’ve averted your eyes, soldiers. Assuming she even gave them the time to decide either way-she’d wanted out, after all. The door opposite him was ajar and Fiddler crept to it, looked out through the crack. A wide street, littered with rubbish. They’d been listening to the riots half the night, and it was clear that mobs had swept through here, if not this night then other nights. The garrison blocks opposite were gutted, the windows soot-stained. Better and better. He turned round and hastened back down the tunnel. At the other end he found Cuttle, Faradan Sort and Fist Keneb, all standing a few paces in from the door. Fiddler explained to them what he had found. Then said, ‘We got to go through right away, I think. Eight hundred marines to come through and that’ll take a while.’ Keneb nodded. ‘Captain Faradan Sort.’ ‘Sir.’ ‘Take four squads through and establish flanking positions. Send one squad straight across to the nearest barracks to see if they are indeed abandoned. If so, that will be our staging area. From there, I will lead the main body to the gate, seize and secure it. Captain, you and four squads will strike into the city, as far as you can go, causing trouble all the way-take extra munitions for that.’","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-442.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
