{"id":104163,"no":45,"title":"Page 45","content":"‘Foreigners.’ Redmask’s eyes narrowed in their slits. ‘Mercenaries.’ Masarch nodded. ‘There was a great battle, four seasons past, and those foreigners were destroyed.’ He made a gesture. ‘The Grey Sorcery.’ ‘Did not the victorious Letherii then march on the Ganetok camps?’ ‘No, Redmask, too few remained-the foreigners fought well.’ ‘Masarch,’ he said, ‘I do not understand. Did not the Ganetok fight alongside their mercenaries?’ The youth spat. ‘Their war leader gathered from the. clans fifteen thousand warriors. When the Letherii arrived, he fled, and the warriors followed. They abandoned the foreigners! Left them to slaughter!’ ‘Settle the camp below,’ Redmask said. He pointed to the warriors standing behind Masarch. ‘Stand first watch along this ridge line, here and to the west. I am now war leader to the Renfayar clan. Masarch, where hides the Ganetok?’ ‘Seven days to the east. They now hold the last great herd of the Awl.’ ‘Masarch, do you challenge my right to be war leader?’ The youth shook his head. ‘You are Redmask. The Elders among the Renfayar who were your enemies are all dead, Their sons are dead.’ ‘How many warriors remain among the Renfayar?’ Masarch frowned, then gestured. ‘You have met us, War Leader.’ A nod. Redmask noted a lone dray dog sitting at the edge of the camp. It seemed to be watching him. He raised his left hand and the beast lunged into motion. The huge animal, a male, reached him moments later, dropping onto its chest and settling its wide, scarred head between Redmask’s feet. He reached down and touched its snout-a gesture that, for most, would have risked fingers. The dog made no move. Masarch was staring down at it with wide eyes. ‘A lone survivor,’ he said, ‘from an outrider camp. It would not let us approach.’ ‘The foreigners,’ Redmask said quietly, ‘did they possess wardogs?’ ‘No. But they were sworn followers of the Wolves of War, and indeed, War Leader, it seemed those treacherous, foul beasts tracked them-always at a distance, yet in vast numbers. Until the Ganetok Elders invoked magic and drove them all away.’ Masarch hesitated, then said, ‘Redmask, the war leader among the Ganetok-’ Unseen behind the mask, a slow smile formed. ‘Firstborn son of Capalah. Hadralt.’ ‘How did you know?’ ‘Tomorrow, Masarch, we drive the herds east-to the Ganetok. I would know more of those hapless foreigners who chose to fight for us. To die for the people of the Awl’dan.’ ‘We are to crawl to the Ganetok as did the Sevond and the Niritha?’ ‘You are starving. The herds are too weakened. I lead six youths none of whom has passed the death night. Shall the seven of us ride to war against the Letherii?’ Though young, it was clear that Masarch was no fool. ‘You shall challenge Hadralt? Redmask, your warriors-we, we will all die. We are not enough to meet the hundreds of challenges that will be flung at us, and once we are dead, you will have to face those challenges, long before you are deemed worthy to cross weapons with Hadralt himself.’ ‘You will not die,’ Redmask said. ‘And none shall challenge any of you.’ ‘Then you mean to carve through a thousand warriors to face Hadralt?’ ‘What would be the point of that, Masarch? I need those warriors. Killing them would be a waste. No.’ He paused, then said, ‘I am not without guardians, Masarch. And I doubt that a single Ganetok warrior will dare challenge them. Hadralt shall have to face me, he and I, alone in the circle. Besides,’ he added, ‘we haven’t the time for all the rest.’ ‘The Ganetok hold to the old ways, War Leader. There will be rituals. Days and days before the circle is made-’ ‘Masarch, we must go to war against the Letherii. Every warrior’of the Awl-’ ‘War Leader! They will not follow you! Even Hadralt could only manage a third of them, and that with payment of rodara and myrid that halved his holdings!’ Masarch waved at the depleted herds on the hillsides. ‘We-we have nothing left! You could not purchase the spears of a hundred warriors!’ ‘Who holds the largest herds, Masarch?’ ‘The Ganetok themselves-’ ‘No. I ask again, who holds the largest herds?’ The youth’s scowl deepened. ‘The Letherii.’ ‘I will send three warriors to accompany the last of the Renfayar to the Ganetok. Choose two of your companion” to accompany us.’ The dray dog rose and moved to one side. Redmask collected the reins of his horse and set out down towards the camp. The dray fell in to heel on his left. ‘We shall ride west, Masarch, and find us some herds.’","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-45.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
