{"id":104170,"no":52,"title":"Page 52","content":"‘You do not, nor is my killing your kin in any way an answer to my need. Fear Sengar, you spoke of reparation. Is this your desire?’\n The Edur warrior was silent for a half-dozen heartbeats, then he said, ‘Scabandari brought us to this world.’\n Yours was dying.’\n Yes.’\n ‘You may not be aware of this,’ Silchas Ruin continued, ‘but Bloodeye was partly responsible for the sundering of Shadow. Nonetheless, of greater relevance, to me, are the betrayals that came before that particular crime. Betrayals against my own kin-my brother, Andarist-which set such grief upon his soul that he was driven mad.’ He slowly cocked his head. ‘Did you imagine me naive in fashioning an alliance with Scabandari Bloodeye?’\n Udinaas barked a laugh. ‘Naive enough to turn your back on him.’\n Seren Pedac shut her eyes. Please, Indebted, just keep your mouth shut. Just this once.\n ‘You speak truth, Udinaas,’ Silchas Ruin replied after a moment. ‘I was exhausted, careless. I did not imagine he would be so… public. Yet, in retrospect, the betrayal had to be absolute-and that included the slaughter of my followers.’\n Fear Sengar said, ‘You intended to betray Scabandari, only he acted first. A true alliance of equals, then.’\n ‘I imagined you might see it that way,’ the Tiste Andii replied. ‘Understand me, Fear Sengar. I will not countenance freeing the soul of Scabandari Bloodeye. This world has enough reprehensible ascendants.’\n ‘Without Father Shadow,’ Fear said, ‘I cannot free Rhulad from the chains of the Crippled God.’\n ‘You could not, even with him.’\n ‘I do not believe you, Silchas Ruin. Scabandari was your match, after all. And I do not think the Crippled God hunts you in earnest. If it is indeed Hannan Mosag behind this endless pursuit, then the ones he seeks are myself and Udinaas. Not you. It is, perhaps, even possible that the Warlock King knows nothing of you-of who you are, beyond the mysterious White Crow.’\n ‘That does not appear to be the case, Fear Sengar.’\n The statement seemed to rock the Tiste Edur.\n Silchas Ruin continued, ‘Scabandari Bloodeye’s body was destroyed. Against me, now, he would be helpless: A soul without provenance is a vulnerable thing. Furthermore, it may be that his power is already being… used.’\n ‘By whom?’ Fear asked, almost whispering.\n The Tiste Andii shrugged. ‘It seems,’ he said with something close to indifference, ‘that your quest is without purpose. You cannot achieve what you seek. I will offer you this, Fear Sengar. The day I choose to move against the Crippled God, your brother shall find himself free, as will all the Tiste Edur. When that time comes, we can speak of reparation.’\n Fear Sengar stared at Silchas Ruin, then glanced, momentarily, at Seren Pedac. He drew a deep breath, then said, ‘Your offer… humbles me. Yet I could not imagine what the Tiste Edur could gift you in answer to such deliverance.’\n ‘Leave that to me,’ the Tiste Andii said.\n Seren Pedac sighed, then strode to the horses. ‘It’s almost dawn. We should ride until midday at least. Then we can sleep.’ She paused, looked once more over at Silchas Ruin. ‘You are confident we will not be pursued?’\n ‘I am, Acquitor.’\n ‘So, were there in truth wards awaiting us?’\n The Tiste Andii made no reply.\n As the Acquitor adjusted the saddle and stirrups on one of the horses to suit Kettle, Udinaas watched the young girl squatting on her haunches near the forest edge, playing with an orthen that did not seem in any way desperate to escape her attentions. The darkness had faded, the mists silver in the growing light.\n Wither appeared beside him, like a smear of reluctant night. ‘These scaled rats, Udinaas, came from the K’Chain Che’Malle world. There were larger ones, bred for food, but they were smart-smarter perhaps than they should have been. Started escaping their pens, vanishing into the mountains. It’s said there are some still left-’\n Udinaas grunted his derision. ‘It’s said? Been hanging round in bars, Wither?’\n ‘The terrible price of familiarity-you no longer respect me, Indebted. A most tragic error, for the knowledge I possess-’\n ‘Is like a curse of boredom,’ Udinaas said, pushing himself to his feet. ‘Look at her,’ he said, nodding towards Kettle. ‘Tell me, do you believe in innocence? Never mind; I’m not that interested in your opinion. By and large, I don’t. Believe, that is. And yet, that child there… well, I am already grieving.’ \n","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-52.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: \n All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... \n A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.\n \n","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
