{"id":104194,"no":80,"title":"Page 80","content":"Seren Pedac wondered if the youth knew how close he was to pushing Ruin over the edge. A few more ill-chosen words and Clip’s head would roll from his shoulders. ‘Is it your mission,’ she asked the Tiste Andii, ‘to guide-us to our destination?’\\n\\n Another smile, another snap of the chain. ‘It is. You will be, uh, welcomed as guests of the Andara. Although the presence of both Letherii and Tiste Edur in your party is somewhat problematic. The Onyx Order has been outlawed, as you know, subject to vicious repression. The Andara represents the last secret refuge of our people. Its location must not be compromised.’\\n\\n ‘What do you suggest?’ Seren asked.\\n\\n ‘The remainder of this journey,’ Clip replied, ‘will be through warren. Through Kurald Galain.’\\n\\n Silchas Ruin cocked his head at that, then grunted, ‘I am beginning to understand. Tell me, Clip, how many wizards of the Order dwell in the Andara?’\\n\\n ‘There are five, and they are the last.’\\n\\n ‘And can they agree on anything?’\\n\\n ‘Of course not. I am here by the command of Ordant Brid, Reve Master of the Rock. My departure from the Andara was uneventful, else it is likely I would not be here-’\\n\\n ‘Should another of the Order have intercepted you.’\\n\\n A nod. ‘Can you wait for the maelstrom your arrival will bring, Silchas Ruin? I can’t.’\\n\\n ‘Thus, your greeting earlier should have been qualified. The Order does not welcome us. Rather, this Ordant Brid does.’\\n\\n ‘They all choose to speak for the Order,’ Clip said, his eyes glittering, ‘when it will most confound the others. Now, I can see how eager you all are.’ From his right hand the chain whipped out, the silver ring round his index finger, and at the snap of the chain’s full length, a gate into Darkness appeared to the warrior’s right. ‘Call the others here,’ Clip said, ‘at haste. Even now, bound wraiths serving the Tiste Edur are converging. Of course, they all dream of escape-alas, that we cannot give them. But their Edur masters watch through their eyes, and that won’t do.’\\n\\n Seren Pedac turned about and summoned the others.\\n\\n Clip stepped to one side and bowed low. ‘Silchas Ruin, I invite you to walk through first, and know once more the welcome embrace of true Darkness. Besides,’ he added, straightening as Ruin strode towards the gate, ‘you will make for us a bright beacon-’\\n\\n One of Silchas Ruin’s swords hissed out, a gleaming blur, the edge slashing across the space where Clip’s neck had been, but the young warrior had leaned back… just enough, and the weapon sang through air.\\n\\n A soft laugh from the youth, appallingly relaxed. ‘He said you’d be angry.’\\n\\n Silchas Ruin stared across at Clip for a long moment, then he turned and walked through the gate.\\n\\n Drawing a deep.breath to slow her heart, Seren Pedac glared at Clip. ‘You have no idea-’\\n\\n ‘Don’t I?’\\n\\n The others appeared, leading their horses. Udinaas, with Kettle tucked into one arm, barely glanced over at Clip before he tugged his horse into the rent.\\n\\n ‘You wish to cross swords with a god, Clip?’\\n\\n ‘He gave himself away-oh, he’s fast all right, and with two weapons he’d be hard to handle, I’ll grant you-’\\n\\n ‘And will the Reve Master who sent you be pleased with your immature behaviour?’\\n\\n Clip laughed. ‘Ordant could have selected any of a hundred warriors at hand for this mission, Letherii.’\\n\\n ‘Yet he chose you, meaning he is either profoundly stupid or he anticipated your irreverence.’\\n\\n You waste your time, Acquitor,’ Fear Sengar said, coming up alongside her and eyeing Clip. ‘He is Tiste Andii. His mind is naught but darkness, in which ignorance and foolishness thrive.’\\n\\n To Fear the young warrior bowed again. ‘Edur, please, proceed. Darkness awaits you.’ And he waved at the gate.\\n\\n As Fear Sengar led his horse into the gate, the chain on Clip’s right index finger spun out once more, ending with a clash of rings.\\n\\n ‘Why do you do that?’ Seren demanded, irritated.\\n\\n Brows lifted. ‘Do what?’\\n\\n Swearing under her breath, the Acquitor walked through the gate.\\n\\n Book Two\\n\\n Layers Of The Dead\\n\\n Who now strides on my trail\\n\\n devouring the distance between\\n\\n no matter how I flee, the wasted\\n\\n breath of my haste cast into the wind\\n\\n and these dogs will prevail\\n\\n dragging me down with howling glee\\n\\n for the beasts were born fated,\\n\\n trained in bold vengeance \\n\\n","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-80.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... \\n A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.\\n","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
