{"id":104202,"no":88,"title":"Page 88","content":"Bugg was thrown a second time against the wall, the back of his head crunching hard on the pitted brick. ‘For that, bastard,’ the man snarled, ‘you’ll Drown.’ Bugg blinked sweat from his eyes, then, as the thug’s words penetrated, he laughed. ‘Drown? Oh, that’s priceless. Now, take your hands off me or I will lose my temper.’ Instead, the man tightened his hold on the front of Bugg’s tunic, while the other said, ‘You were right, Kanorsos, he needs beating.’ ‘The bully’s greatest terror,’ Bugg said, ‘comes when he meets someone bigger and meaner-’ ‘And is that you?’ Both men laughed. Bugg twisted his head, looked round. People were hurrying past-it was never wise to witness such events, not when the murderers of the Patriotists were involved. ‘So be it,’ he said under his breath. ‘Gentlemen, allow me to introduce to you someone bigger and meaner, or, to be more accurate, something:.’ A moment later Bugg was alone. He adjusted his tunic, glanced about, then set off once more for his master’s abode. It was inevitable, he knew, that someone had witnessed the sudden vanishing of two armed and amoured men. But no-one cried out in his wake, for which he was relieved, since he was not inclined to discuss much with anyone right at that moment. Did 1 just lose my temper? It’s possible, but then, you were distracted. Perturbed, even. These things happen. Feather Witch wasted little time. Off the cursed ships and their countless, endlessly miserable crowds, the eyes always upon her, the expressions of suspicion or contempt and the stench of suffering that came of hundreds of prisoners-the fallen Edur of Sepik, mixed-blood one and all, worse in the eyes of the tribes than Letherii slaves; the scores of foreigners who possessed knowledge deemed useful-at least for now; the Nemil fisher folk; the four copper-skinned Shal-Morzinn warriors dragged from a floundering carrack; denizens of Seven Cities, hailing from Ehrlitan, the Karang Isles, Pur Atrii and other places; Quon sailors who claimed to be citizens of an empire called Malaz; dwellers of Lamatath and Callows… Among them there were warriors considered worthy enough to be treated as challengers. An axeman from the ruined Meckros City the fleet had descended upon, a Cabalhii monk and a silent woman wearing a porcelain mask the brow of which was marked with eleven arcane glyphs-she had been found near dead in a storm-battered scow south of Callows. There were others, chained in the holds of other ships in other fleets, but where they came from and what they were was mostly irrelevant. The only detail that had come to fascinate Feather Witch-among all these pathetic creatures-was the bewildering array of gods, goddesses, spirits and ascendants they worshipped. Prayers in a dozen languages, voices reaching out into vast silences-all these forlorn fools and all the unanswered calls for salvation. No end, in that huge, chaotic world, to the delusions of those who believed they were chosen. Unique among their kind, basking beneath the gaze of gods that gave a damn- as if they would, when the truth was, each immortal visage, for all its peculiar traits, was but a facet of one, and that one had long since turned away, only to fight an eternal battle against itself. From the heavens, only indifference rained down, like ash, stinging the eyes, scratching raw the throat. There was no sustenance in that blinding deluge. Chosen-now there was a conceit of appalling proportions. Either we all are, or none of us are. And if the former, then we will all face the same judge, the same hand of justice-the wealthy, the Indebted, the master, the slave, the murderer and the victim, the raper and the raped, all of us, so pray hard, everyone-if that helps-and look well to your own shadow. More likely, in her mind, no-one was chosen, and there was no day of judgement awaiting every soul. Each and every mortal faced a singular end, and that was oblivion. Oh, indeed, the gods existed, but not one cared a whit lor the fate of a mortal’s soul, unless they could bend that soul to their will, to serve as but one more soldier in their pointless, self-destructive wars. For herself, she was past such thinking. She had found her own freedom, basking beneath that blessed rain of indifference. She would do as she willed, and not even the gods could stop her. It would be the gods themselves, she vowed, who would come to her. Beseeching, on their knees, snared in their own game. She moved silently, now, deep in the crypts beneath the Old Palace. I was a slave, once-many believe 1 still am, yet look at me-1 rule this buried realm. 1 alone know where the hidden chambers reside, I know what awaits me within them. 1 walk this most fated path, and, when the time is right, I will take the throne.","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-88.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
