{"id":104204,"no":90,"title":"Page 90","content":"‘He will learn nothing. You and I, Letherii, we can work together. We can destroy that abomination-’ ‘With yet another in his place-you.’ ‘Do you truly think I would have let it come to this? Rhulad is mad, as is the god who controls him. They must be expunged.’ ‘I know your hunger, Hannan Mosag-’ ‘You do not!’ the Edur snapped, a shudder taking him. He edged closer into the chamber, then held up a mangled hand. ‘Look carefully upon me, woman. See what the Chained One’s sorcery does to the flesh-oh, we are bound now to the power of chaos, to its taste, its seductive flavour. It should never have come to this-’ ‘So you keep saying,’ she cut in with a sneer. ‘And how would the great empire of Hannan Mosag have looked? A rain of flowers onto every street, every citizen freed of debt, with the benign Tiste Edur overseeing it all?’ She leaned forward. ‘You forget, I was born among your people, in your very tribe, Warlock King. I remember going hungry during the unification wars. I remember the cruelty you heaped upon us slaves-when we got too old, you used us as bait for beskra crabs-threw our old ones into a cage and dropped it over the side of your knarri. Oh, yes, drowning was a mercy, but the ones you didn’t like you kept their heads above the tide line, you let the crabs devour them alive, and laughed at the screams. We were muscle and when that muscle was used up, we were meat.’ ‘And is Indebtedness any better-’ ‘No, for that is a plague that spreads to every family member, every generation.’ Hannan Mosag shook his misshapen head. ‘I would not have succumbed to the Chained One. He believed he was using me, but I was using him. Feather Witch, there would have been no war. No conquest. The tribes were joined as one-I made certain of that. Prosperity and freedom from fear awaited us, and in that world the lives of the slaves would have changed. Perhaps, indeed, the lives of Letherii among the Tiste Edur would have proved a lure to the Indebted in the southlands, enough to shatter the spine of this empire, for we would have offered freedom.’ She turned away, deftly hiding the small leather bag. ‘What is the point of this, Hannan Mosag?’ ‘You wish to bring down Rhulad-’ ‘I will bring you all down.’ ‘But it must begin with Rhulad-you can see that. Unless he is destroyed, and that sword with him, you can achieve nothing.’ ‘If you could have killed him, Warlock King, you would have done so long ago.’ ‘Oh, but I will kill him.’ She glared across at him. ‘How?’ ‘Why, with his own family.’ Feather Witch was silent for a dozen heartbeats. ‘His lather cowers in fear. His mother cannot meet his eyes. Binadas and Trull are dead, and Fear has fled.’ ‘Binadas?’ The breath hissed slowly from Hannan Mosag. I did not know that.’ ‘Tomad dreamed of his son’s death, and Hanradi Khalag quested for his soul-and failed.’ The Warlock King regarded her with hooded eyes. ‘And did my K’risnan attempt the same of Trull Sengar?’ ‘No, why would he? Rhulad himself murdered Trull. Chained him in the Nascent. If that was meant to be secret, it failed. We heard-we slaves hear everything-’ ‘Yes, you do, and that is why we can help each other. Feather Witch, you wish to see this cursed empire collapse-so do I. And when that occurs, know this: I intend to take my Edur home. Back to our northlands. If the south is in flames, that is of no concern to me-I leave the Letherii to the Letherii, for no surer recipe for obliteration do any of us require. I knew that from the very start. Lether cannot sustain itself. Its appetite is an addiction, and that appetite exceeds the resources it needs to survive. Your people had already crossed that threshold, although they knew it not. It was my dream, Feather Witch, to raise a wall of power and so ensure the immunity of the Tiste Edur. Tell me, what do you know of the impending war in the east?’ ‘What war?’ Hannan Mosag smiled. ‘The unravelling begins. Let us each grasp a thread, you at one end, me at the other. Behind you, the slaves. Behind me, all the K’risnan.’ ‘Does Trull Sengar live?’ ‘It is Fear Sengar who seeks the means of destroying Rhulad. And I mean for him to find it. Decide now, Feather Witch. Are we in league?’ She permitted herself a small smile. ‘Hannan Mosag, when the moment of obliteration comes… you had better crawl fast.’ ‘I don’t want to see them.’","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-90.html","bookId":2013,"book":{"id":2013,"title":"Reaper\u0027s Gale (The Malazan Book of the Fallen #7)","description":"Storyline: All is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor, while the Letherii secret police conduct a campaign of terror against its own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighbouring kingdoms. And the great Edur fleet - its warriors selected from countless peoples - draws ever closer. Amongst them are Karsa Orlong and Icarium Lifestealer - each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar must find the soul of Scabandari Bloodeye. It is his hope that it might help halt the Tiste Edur, and so save his brother, the emperor. Yet, travelling with them is Scabandari\u0027s most ancient foe: Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh. Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered - and it will be a reckoning on an unimaginable scale... A brutal, harrowing novel of war, intrigue and dark, uncontrollable magic, this is epic fantasy at its most imaginative, storytelling at its most thrilling.","cover":"https://allnovel.net/images/reaper-s-gale-the-malazan-book-of-the-fallen-7.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:17:21 PM"}}
