{"id":39129,"no":4,"title":"CHAPTER IV. SAMUEL LEE.","content":"Had Gavin Witherspoon been less strange in his manner, I should have taken little heed of his joining us in the mission with which we had been entrusted by General Marion, because the old man was often given to whims, and this could well have been considered as simply a fancy on his part to indulge in the love for adventure. \n \n If he had contented himself with vague words concerning the possible danger, neither Percy nor I would have paid any particular attention to him, believing he simply magnified the peril in order that it might appear as if he counted on being able to protect us. \n \n His manner, however, was so exceeding [73] odd—I can find no word which comes nearer explaining it—that I believed at once he was in possession of some knowledge which we did not share, and therefore had good reason for crediting all he said. \n \n A year later, perhaps, after I had had more experience in what some gentlemen are pleased to call the \"art of warfare,\" I might have held my peace, trusting in our ability to ward off such dangers as should arise, but then, ignorant as we were of a soldier\u0027s life, the old man\u0027s actions impressed me disagreeably, as I have said already, and I was minded to demand from him an explanation. \n \n Never before had I found it a difficult matter to gain speech with Gavin Witherspoon, for the old man was prone to indulge in conversation regardless of suitable opportunity or place; but on this morning Percy and I found it necessary to ride at full speed in order to come alongside our self-appointed guardian, and we were, perhaps, five miles from the camp when I [74] finally succeeded in forcing him to open his mouth. \n \n \"If you count to ride with us, Master Witherspoon, and claim that it is your purpose to protect Percy and I, we at least have the right to know why such an escort is considered necessary.\" \n \n \"That I have already explained,\" the old man replied curtly, and would have spurred ahead of us once more but that Percy caught his bridle rein, as he said sharply: \n \n \"We are minded, Gavin Witherspoon, to know the meaning of your mysterious words and odd behavior. If it so be you know more concerning the enemy than is told among the men of our brigade, let us hear it now, that my brother and I may be in some degree prepared for coming events.\" \n \n \"I have ridden with the command, and had no more means of gaining information than others. What may be in my mind has come there through what I call sound commonsense.\" [75] \n \n \"And you have reasoned out that we are in greater danger than we were four and twenty hours ago?\" I said with a laugh, beginning to feel somewhat of relief in my mind by this discovery, as I believed, that the old man\u0027s fears were the result of his own imagination. \n \n He must have read in the tone of my voice somewhat of that in my mind, for, reining in his horse, he wheeled around to face Percy and myself as he replied, speaking slowly and with exceeding earnestness: \n \n \"It was known to the leaders of our brigade that Captain Barfield had a force of Tories nearabout Dubose Ferry. Think you Major Gainey and his men did not have the same information?\" \n \n \"Of course they did,\" I replied, wondering greatly what the old man would come at. \n \n \"It is no more of a journey from Pedee Swamp to Dubose Ferry, than from where we halted for breakfast.\" [76] \n \n Again he paused as if waiting some reply; but neither Percy nor I spoke, for as yet we failed to understand what he was trying to convey. \n \n \"Major Gainey\u0027s force has lost an outfit, since our people took possession of it, and must, therefore, seek another encampment. Do you believe they will be content to remain in the swamp, knowin\u0027 their friends are near at hand?\" \n \n \"It would be reasonable that they rode in the direction of the Ferry,\" Percy said, an expression of deepest seriousness chasing away the smile which had been upon his lips. \n \n \"Very well. Since you allow that, there is no need for me to say more. It is the general belief that Gainey had near to two thousand men with him, an\u0027 think you they will not fight, however much cowardice may be in their hearts, when next we ride upon them? If these two forces of Tories come together—and by this time I venture to say the men we routed in the early dawn [77] have begun to understand how few we are in numbers—I look to see hot work. Therefore it is I predict that before arrivin\u0027 at Dubose Ferry we shall meet with many of those who so lately fled before us.\" \n \n I now realized why the old man looked upon the situation as being grave in the extreme, and there was no further inclination in my mind to make sport of his forebodings. \n \n Having learned what it might, perhaps, have been better we did not know, Percy and I became quite as solemn as was Gavin Witherspoon, and we three rode on again as if certain some evil fortune was about to overtake us, neither so much as speaking until half an hour or more had passed, when we came to a sudden halt. \n \n Our road at this time lay through the bottom-lands, which were covered with a growth of scrub oaks, and we had heard a noise as of horsemen forcing their way through the foliage. \n \n This it was which had caused us to halt so [78] suddenly, and I was looking to my rifle to make certain it was loaded, when Sam Lee came into view. \n \n He was riding a heavily-built iron-gray horse, the very animal I could have sworn to seeing during the brush with Major Gainey\u0027s force. Upon his face was an expression of deepest satisfaction and joy, which did not change materially when he saw us. \n \n Percy, quicker than I at such times, cried out for the Tory to halt, and he wisely obeyed the command, knowing full well his steed would have no show in a race with such animals as we bestrode, even though our rifles might not have brought him to a halt. \n \n \"Well,\" he asked, with an evil look upon his face. \"Since when have you begun to stop peaceful travelers?\" \n \n \"We have not yet commenced,\" I cried, allowing anger to take possession of me. \"In these times a Tory cannot lay claim to peacefulness, and it is our purpose to [79] make such prisoners whenever and wherever we find them.\" \n \n \"And I am a prisoner, eh?\" he asked, with not the slightest show of fear, and I was surprised thereat, because we knew him to be a rank coward. \n \n \"Throw down your musket an\u0027 hold up your hands while Percy makes search for pistols!\" Gavin Witherspoon said sternly, for the old man was a ready comrade in times when quick action became necessary. \n \n Sam Lee obeyed without a word, and after a brief search we discovered that he had no other weapons than the musket which lay upon the ground. \n \n Still he appeared well satisfied—even pleased. \n \n It angered me yet further, this show of carelessness, and I cried hastily: \n \n \"You were in no such happy mood this morning, when we chased your friends into the swamp—when less than four hundred men put to flight two thousand!\" \n \n Gavin Witherspoon turned upon me [80] quickly, and with such a show of temper as caused me to understand in an instant that I had thus given to the enemy information concerning the size of General Marion\u0027s force. \n \n It was too late to recall the words, unfortunately, and Sam, giving no heed to the old man\u0027s show of resentment at my folly, replied to the words which I had believed would humiliate him: \n \n \"The condition of affairs in the Carolinas have changed wonderfully within the past few days, and we who are loyal inhabitants of the colony have little to fear from rebels.\" \n \n Now did I realize that this Tory lad was certain of his ground, else he would not have dared to speak in such strain, and the result was that I, rather than our prisoner, grew disheartened. \n \n Gavin Witherspoon also pricked up his ears at this bold speech from the lad who had heretofore been so cowardly as never to venture an opinion lest he make trouble [81] for himself, and the old man asked as he advanced toward the rascal threateningly: \n \n \"What is it that has given you such a dose of courage, you Tory cur?\" \n \n Sam winced, as if believing Gavin Witherspoon was about to strike him, and then, understanding an instant later that we were not of his kidney, who would ill-treat a prisoner, replied with a laugh which aroused all my anger again: \n \n \"Your General Gates with his rag-tag and bob-tail of an army has been cut to pieces at Camden by Lord Cornwallis! What you are pleased to call the \u0027Cause,\u0027 is now wiped out from the Carolinas!\" \n \n We three sat speechless with dismay, gazing at each other questioningly, apprehensively, as the young Tory told a story which we at the time believed to be true, and afterward came to learn that no part had been exaggerated. \n \n General Gates, who believed himself to be more of a soldier than was the fact, had moved from Rugely\u0027s Mills on the [82] evening of the 15th, with his entire force, never so much as sending scouts in advance to learn whether the enemy might be in the vicinity. His raw recruits were suddenly met by a volley from the British skirmishers, and, retreating so far as seemed necessary for safety, lay upon their arms until morning. \n \n When the sun rose any other general than Gates would have known he was defeated, even before trying the issue. His men, unused to service, were formed in the swamp with the reserve only a few hundred yards in the rear of the battle line. Perhaps not one out of ten of these had ever been under fire, and opposed to them were picked soldiers—the best to be found in the king\u0027s regiments stationed at Charleston and Camden. \n \n At sunrise General Gates ordered the advance of the Virginia militia, who were met by the redcoats with such a deadly volley that the division retreated before more than half of them had discharged [83] their muskets. The North Carolina militia followed the disgraceful example, as did also the cavalry, and a charge by the British horse completed the rout. \n \n Only the Continentals under command of De Kalb held their ground until further resistance would have been madness, and the battle of Camden had been half fought, and wholly lost. \n \n No wonder Sam Lee was triumphant. \n \n To us who heard the story it seemed as if his boast that the Cause had been killed in the Carolinas was neither more nor less than the truth, and for a moment I fancied it our duty to return without loss of time to warn General Marion. \n \n Now it may seem strange to whosoever shall read these lines, that we believed so readily all the Tory told us; but we had good cause for credulity. \n \n Old soldiers among us—and the men of my mother\u0027s family had been in arms from the time the colonists first began resistance against the king\u0027s oppression—had again [84] and again argued that General Gates was not a skilful officer, despite his victory at Saratoga. \n \n When it was known that General Marion, who up to the time of taking command in the Williamsburg district had been only a colonel, was to leave the staff of Gates, our people predicted a disaster similar to what it seemed had just occurred. \n \n Therefore, when Sam Lee, liar and coward though he was naturally, gave us an account of the battle with so much of detail he could not have invented, we, unfortunately, had no choice but to believe the tale. \n \n It was Gavin Witherspoon who first regained sufficient composure to understand what should be done, and he soon showed the Tory that, however hardly our people had been used, it would not avail him under the present circumstances. \n \n \"It seems to me necessary we keep this young cub with us, however disagreeable the association may be, and do you lads [85] lash him on the saddle in such fashion that he will not be able to make his escape without assistance.\" \n \n Although believing for the moment that we ought to return immediately to General Marion, I obeyed the old man\u0027s order, and now it was that the look of satisfaction and exultation began to vanish from the coward\u0027s face. \n \n He had counted on our so far losing heart as to make an attempt at currying favor with him, or, at least, pass him by, and our thus guarding against the possibility of escape was by no means to his liking. \n \n \"What is to be done?\" I asked when the lad was secure, for I now realized, as did Percy, that Gavin Witherspoon should be given the command of our squad. \n \n \"We shall push on as was at first intended, keeping our wits well about us, lest we be surprised by others of this fellow\u0027s kidney, who are making haste to join Barfield. After having accomplished [86] that for which we were sent, if it be possible, there will be time enough to repeat the disagreeable story.\" \n \n I am making an overly long story of what should be told in fewer words, prompted to do so because of the fear which beset me at this time and caused the matter to seem of more importance than it really was. \n \n We pressed forward two hours or more, Percy and I riding either side of the prisoner, and Gavin Witherspoon keeping in advance. \n \n Then we were come, as nearly as could be judged, to the vicinity of the Tory camp, and might no longer with safety use the horses. \n \n Still acting under Gavin Witherspoon\u0027s command, we picketed our steeds in the thicket, leaving them and the prisoner to the charge of Percy, while the old man and I pressed forward to reconnoiter. \n \n This work occupied a full hour, and the time was by no means wasted, because [87] when it had expired we were well informed as to the number of Barfield\u0027s men. \n \n To the best of our belief there were not less than eight hundred Tories fairly well entrenched at Dubose Ferry, and Gavin said to me as we turned to retrace our steps: \n \n \"There will be no fighting this night, unless we are driven to it, for neither General Marion nor Major James, however brave they may be, will make the attack with such odds against us, particularly while it is certain this same force of Tories will be reinforced before nightfall by those whom we drove into the swamp.\" \n \n A similar thought was in my own mind, and therefore I made no reply. \n \n It was necessary we rejoin our friends before they should have come so far as to put themselves in a dangerous position, and Gavin and I hurried back to where we had left Percy. \n \n We had no difficulty in finding the place where we tethered the horses, and once [88] there the cold sweat of fear broke out upon my forehead. \n \n Percy, and prisoner, and the three horses which we had ridden, were not to be seen. But for the fact that the gray steed of Sam Lee was feeding close by, I would have said we had mistaken the location. \n \n Words are not sufficient to describe my condition of mind when this horrible truth burst upon me. I could not so much as speak; but looked questioningly at the old man, who said slowly and in a half whisper, after gazing carefully around: \n \n \"The boy has been captured by some of Gainey\u0027s cowards who no doubt are hunting for us at this moment. Sam Lee knew for what purpose we went ahead, and as a matter of course has given his Tory friends all possible information.\" \n \n \"Why do we stand here idly?\" I cried, regaining speech when the horrible fact had been put before me in words. \"We cannot desert him, and at whatsoever cost must go in pursuit.\" [89] \n \n \"It is not possible we could compass anything save our own capture,\" Gavin Witherspoon said, speaking slowly, and gripping hard both my hands as if to give me comfort. \n \n \"Surely you will not turn your back upon him,\" I cried in a fury, trying to wrench myself from his grasp; \"if that cowardly thought be in your mind you shall go alone, for I had rather face all Barfield\u0027s force single-handed, than have it said I deserted my brother.\" \n \n \"Fair and softly, Robert Sumter, fair and softly. I am not minded to go back. It is you who shall do that.\" \n \n \"But I will not,\" and again I strove to release my hands. \n \n \"Listen to me, lad, and the sooner the better for your brother\u0027s sake, because I shall hold you here by force until having laid the case squarely before you. Would you have it told that one of the James family, on account of his own personal grief, allowed four hundred brave men to [90] ride on to destruction? Would you have it said that rather than desert your brother you allowed the men of Williamsburg to face certain capture or death? Yet that is what must happen unless you are willing to do as I bid.\" \n \n \"But let me hear what is in your mind, for until then how can I answer the questions you ask!\" and now I was grown more tractable, understanding that the old man knew better than I what was necessary both for the safety of Percy, and those who were riding behind us. \n \n \"There is but one horse here, and it would be unsafe to set out on foot. Having had many more years of experience than you, I should be more capable of following the Tories who have Percy in their keeping, and having come upon them, if there be a chance for his rescue, ought to be able to take better advantage of the opportunity than you. Now this is my plan: Mount the gray horse and ride back until you have met our friends; tell them what has occurred, [91] and perchance Major James will send forward ten or twelve experienced woodsmen, who will help me in what seems little better than a forlorn hope. At all events, the gentlemen whom we both can trust implicitly will know the situation, and advise what we may do with honor. In addition to that you will be spared the pain of confessing in later days that you did what a James should never do—left your friends to ride blindly into such danger as has never before come upon men of the Carolinas.\" \n \n It was not easy to follow this advice, as may well be imagined, and I spent fully five minutes trying to force myself to do it. \n \n It seemed as if by going back when Percy had been forced to go forward, I was deserting him, and yet such seeming desertion was necessary to save, perhaps, the entire Williamsburg district. \n \n \"You will return as a brave lad should,\" the old man said finally, and, my heart [92] well-nigh bursting with grief, I made reply by mounting the gray horse. \n \n Not until then did I realize how much Gavin Witherspoon had taken upon himself. \n \n The old man was voluntarily remaining behind on foot, surrounded by enemies, in the vain hope that he might by some fortunate accident rescue Percy, and I knew full well that the chances were as one in a thousand that it could not be done. \n \n In other words, he was doing little less than delivering himself into the hands of the enemy and I—I was deserting him as well as my brother. \n \n \"I can\u0027t do it, Gavin,\" I said, making as if to dismount. \"It is better you ride back.\" \n \n \"No, lad. Having once come to a brave decision, hold steadfast, and forget all else save that the Cause demands the sacrifice, perchance of your life, and certainly of your feelings. Push the horse at his best pace, which will be a sorry one at the most, [93] and before many hours have passed we may grasp hands again; but I solemnly swear not to desert Percy whatever may come upon me.\" \n \n I clasped the old man\u0027s hand, understanding for the first time in my life what a friend he was. Then, not daring to so much as speak, I set the spurs deep into the gray, and he bounded forward with more of life than I had expected it would be possible for him to show. \n \n The wonder of it all to me is now, while I am writing it down after so many months have passed, that I was not captured before having traversed a mile on the backward journey, for I saw nothing, heeded nothing, thought of nothing save Percy and the brave old man who was following on his trail. \n \n Heedless alike of friend or foe I rode as if in all the district of Williamsburg there was not an enemy, and the good God allowed me to pass through that Tory infested district in safety. [94] \n \n It was no more than two hours past noon when I came upon the advance guard of our brigade, and five minutes later stood before my uncle and General Marion, shaking like one in an ague fit. \n \n Those brave soldiers needed not to be told that some disaster had befallen us. The fact, although not the story, was imprinted plainly on my face, and Major James dismounted that he might fling his arm around my shoulders, as he asked softly and tenderly: \n \n \"How far beyond here did you leave Percy and Gavin Witherspoon?\" \n \n \"Within three miles of Dubose Ferry, so nearly as I can say.\" \n \n \"Were you come upon Barfield\u0027s force before this thing happened?\" \n \n Then it was that I found my tongue, and told him all the sad story, taking good care however, that both he and the general understood full well the strength of the enemy as we had found them. \n \n \"We will fall upon them as soon as may [95] be,\" the general cried, and beckoning to Captain Mouzon he would have given some order but that I said hurriedly, forgetting my manners, as well I might, after all that had happened: \n \n \"Gavin Witherspoon declared that Major Gainey\u0027s men would join Barfield\u0027s force, and should the Williamsburg brigade advance, it would be only to their capture or death.\" \n \n \"Death is what every soldier must expect, and peradventure it be delayed until the end comes peacefully, then is he less fortunate, perhaps, than his fellow. We will ride on, gentlemen, and attack Barfield as soon as we can come upon him.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1488/44528.html","bookId":1323,"book":{"id":1323,"title":"With the Swamp Fox","description":"简介： He who sets himself down to write of his own deeds in order that future generations may know exactly what part he bore in freeing the colonies from the burdens put upon them by a wicked king, must have some other excuse, or reason, than that of self-...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1488","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
