{"id":98877,"no":20,"title":"Page 20","content":"Her heart flopped over heavily. She hadn’t seen Chad approach, but there he was, standing right behind Todd with a dark look on his face.\\n\\n Todd twisted at the waist and then took a surprised step back. Was it possible Todd was the only person in DC who wasn’t up to date on Chad’s love life?\\n\\n He extended a hand. “Chad Gamble? Wow. Nice to meet you.”\\n\\n Chad didn’t smile, but he took the other man’s hand. His eyes were a deep blue and his stare territorial and possessive. A shiver went down her spine. No way she’d admit to liking it. He echoed Todd’s sentiment, although Bridget highly doubted he meant a word. “Nice to meet you.”\\n\\n Todd dropped Chad’s hand and glanced back to where Bridget stood. “You’re a lucky man, Chad, in more ways than one.”\\n\\n Bridget’s brows shot up.\\n\\n A tight smile appeared on Chad’s face as he took Bridget’s boneless hand. “That I know. Have a nice evening.”\\n\\n Bridget let Chad drag her around the corner of her apartment building toward where his Jeep was illegally parked along the curb. She was surprised it still had its wheels.\\n\\n “Is that why you didn’t want me to meet you at your apartment?” Chad asked as he opened the passenger car door for her.\\n\\n Her brows knitted in confusion. “Huh?”\\n\\n “Seems like that guy was really happy about running into you outside.” Still at the side of the Jeep, he reached in once she was seated and tugged the seat belt around.\\n\\n “I can buckle myself in.”\\n\\n “Hey, I’m big on safety. Who was that guy?”\\n\\n Bridget pulled her hands back with a sigh. “He’s just someone who lives across the hall from me. I’m pretty sure that’s the longest conversation I’ve ever had with him.”\\n\\n “Really?” The back of his knuckles brushed the swell of her breasts as he brought the strap over, causing her to suck in a sharp gasp. His gaze lifted, eyes flaring sapphires. A half smile appeared on his lips as he buckled her in. “The guy seems like a dork.”\\n\\n A surprised laugh escaped her. “You don’t even know him.”\\n\\n “Neither do you.” He flashed a quick smile. “So for all you know, he definitely could be a dork.”\\n\\n Shaking her head, she watched him shut the door and head around the front. Was Chad jealous? No. That didn’t make any sense. Boyfriends got jealous, which wasn’t what he really was, and he didn’t seem like the kind of guy who would ever get jealous.\\n\\n When they pulled out into traffic, she glanced at him sideways. “So…thank you for the flowers. They were really beautiful.”\\n\\n That little lopsided grin remained. “Beautiful flowers for a beautiful woman.”\\n\\n She opened her mouth to point out that was pretty cheesy, but she was trying a more diplomatic approach to this setup and that wouldn’t help. “Did you have a good day?” A look of surprise crossed his striking face, and she couldn’t help but smile. “What?”\\n\\n He ran a hand through his hair and gave his head a little shake. “Oh, it’s nothing. I just didn’t think you’d be interested.”\\n\\n Bridget frowned and was about to ask why he’d think that, but then it struck her. They were pretending, which would mean in reality she shouldn’t care about his day. It was like talking on the phone at work, opening up the conversation with general BS and then getting right to the point of the call. This was just a job to him. Maybe Chad didn’t want to do anything other than put a show on when the cameras were snapping. The sour feeling in the back of her throat had nothing to do with disappointment. Must’ve been indigestion.\\n\\n As Chad navigated the back-to-back traffic, he cleared his throat. “Nothing really happened today. Started with my off-season trainer and that took up all the morning. Then I checked in with Miss Gore.” At Bridget’s sudden scowl, he chuckled deeply. “Yeah, that was about as fun as playing chicken with a Mack truck. She thought she needed to tell me that I should buy popcorn and soda at the movies. Then I pretty much sat around the bulk of the day. Fun stuff. How about you?”\\n\\n Bridget fidgeted with the strap on her purse. “Thankfully I didn’t have to talk to Miss Gore.”\\n\\n He nodded. “You really don’t like that woman, do you?”\\n\\n “Nope,” she replied. “I spent most of the day tracking down the caterer for the fund-raising Gala.”\\n\\n “That’s the big one the Smithsonian hosts every year?” Surprised that he knew anything about it, she nodded. His gaze flicked over to her before returning to the road. “Maddie’s talked about it before. You guys have been working on it for a while, right?”\\n\\n “Yep, all year it feels like. And it’s funny we spend this much time on an event that’s over in a couple of hours.”\\n\\n “Kind of like Christmas, eh? Months and months of everyone preparing for it, and it’s over in a few hours”\\n\\n “Yeah, like Christmas,” she said, turning her gaze to the window.\\n\\n There was a pause. “Not a fan of Christmas?”\\n\\n Bridget shook her head.\\n\\n As if sensing that was a topic she didn’t want to go into, he swiftly got the subject back on track. “So when is the Gala?”\\n\\n “January the second.” She wetted her lips. “We’ve discovered that people tend to be more giving in the New Year. And we need a lot of money or…”\\n\\n “Or what?”\\n\\n She bit down on her lip. “Or Madison could lose the funding after third quarter next year.”\\n\\n “Really? Shit.” He took the curve up ahead and immediately had to brake as there was a line of people turning into the parking garage serving the theatre. “How much money do you guys have to raise?”\\n\\n “A lot?” she said, letting out a little laugh. “We needed to hit close to five mil and we’re about a million short.”\\n\\n “Whoa—that’s a lot, but you guys probably have some donors with deep pockets, right?”\\n\\n “We do, but we’ve maxed most of them out. So we’re shooting for a Hail Mary with this.”\\n\\n They’d finally slid into a parking space and Chad killed the engine, facing her. “What happens if you guys lose your funding?”\\n\\n Bridget unbuckled herself when it was evident Chad trusted her to do that all by herself. “There’ll be a lot of cutbacks. Madison will be fine.”\\n\\n His dark brows furrowed. “I know Maddie will be fine. If she lost her job due to cutbacks, she has Chase. What about you?”\\n\\n She reached for the door. “They’d probably get rid of my position. I’d either be sucked into another department, or I’ll be let go.”\\n\\n “What?”\\n\\n “Yeah, look, this is really kind of a sucky conversation. I’m sure everything’s going to be fine and we’re going to be late to the movie.” Bridget forced a smile she really wasn’t feeling. If Chad thought the fact that she could lose her job was terrible, then he’d probably be horrified by how much in debt she was. “And you’re adoring public is awaiting you.”\\n\\n Tension pulled at the corners of his lips, but he nodded. She met him around the side of his car, and he took her hand like she expected. For a moment, they both stood there and stared at each other.\\n\\n The lopsided grin appeared once more. “You do look very nice tonight.”\\n\\n Her lips pursed. “Just jeans and a sweater—nothing amazing.”\\n\\n “They look good on you.”\\n\\n Feeling her cheeks heat, she looked away. The simple compliment that was probably meant to put her at ease shouldn’t have gotten her heart racing, but it did. “Flattery will get you nowhere,” she said.\\n\\n “Damn. There goes my master plan to get you in bed just by saying you look nice.”\\n\\n She cracked a grin.\\n\\n “Come on,” he said, tugging her toward the entrance. Just as they reached the double doors, yellow light spilled from inside the building onto the dark sidewalk. His cell phone went off. Reaching into his front pocket with his free hand, he pulled it out and snorted.\\n\\n “What?” she asked, nervous about heading into the crowded lobby.\\n\\n Chad laughed. “It’s from Miss Gore.”\\n\\n “Goody.”\\n\\n Shaking his head, he slipped his phone back in his pocket. “She wanted to make sure I was holding your hand.”\\n\\n Bridget laughed. “Aw, she’s like your mommy giving you pointers.”\\n\\n After opening the door for them, he arched a brow at her as he led her in, and she laughed. A smile formed on his lips in response. As soon as he turned, facing those in line for buying tickets, the double takes started. It was almost comical—one head turning right after the other.\\n\\n The purchase of tickets was rather uneventful, but as they waited in line to buy popcorn and drinks, because God help them if they let Miss Gore down, the whispers rose like a wave and the stares grew pointed.\\n\\n Bridget shifted her weight from one foot to the next and kept her gaze leveled on the glass counter ahead. The tips of her ears felt hot.\\n\\n “Large popcorn with extra butter and salt and…” Chase paused. “A cherry soda, right?”\\n\\n “Perfect.”\\n\\n “Make that two cherry sodas, then.”\\n\\n As they waited, Chase let go of her hand and slipped his arm around her shoulders. Turning so that his body blocked most of hers, he bent his head and whispered, “They’ll get bored with us soon enough.”\\n\\n Grateful he was blocking most of the stare-mongers and even a few who were snapping pics on their phones, she turned her face toward his chest. God, he smelled great. Spice and pure male.\\n\\n Once they got their popcorn and headed toward some action movie, they were stopped for an autograph. Chad handled it gracefully and then there was another autograph. She thought they might get mobbed inside the room but was shocked to discover that hardly anyone was at the showing.\\n\\n Chad stopped at the back row, letting her squeeze past him. She picked a seat in the middle and sat, helping him with the sodas.\\n\\n The previews—her favorite part of going to the movies—started seconds later, but as soon as the movie started and stuff was blowing up left and right, her attention wandered…right to the man sitting beside her.\\n\\n He was watching the movie—at least that’s what it looked like to her. In the shadowy theatre, his profile was starkly defined, really a work of art. There was no wonder he was voted sexiest man alive.\\n\\n Tight coils sprung in her belly as her gaze drifted over his cheekbones and lips. His shoulders were wide—\\n\\n “You’re staring at me,” he said gruffly.\\n\\n “No. I’m not.” She popped a kernel into her mouth. “Your imagination.”\\n\\n He cast a sidelong glance her way. “Terrible liar.”\\n\\n “You’re not watching the movie, either,” she pointed out and snuck another handful of popcorn.\\n\\n His lips curled up on one corner as he leaned over so his arm was pressed against hers. Lowering his head to her ear, he moved the popcorn to her lap. “Well, there is something more interesting going on.”\\n\\n Bridget turned to him and gasped when her lips brushed his chin. Neither of them moved for a few seconds, and then his lips were on hers. No other warning. The kiss was long and deep. \\n\\n","sourceLink":"https://allnovel.net/tempting-the-player-gamble-brothers-2/page-20.html","bookId":2004,"book":{"id":2004,"title":"Tempting the Player (Gamble Brothers #2)","description":"Storyline: Tempting the Player (Gamble Brothers #2) \\n by J. Lynn, Jennifer L. Armentrout \\n A sexy category romance from Entangled\u0027s Brazen imprint... \\n He\u0027s a player on and off the field... \\n Chad Gamble, all-star pitcher for the Nationals, is one of the best players on—and off—the field. And right now, the notorious bad boy wants Bridget Rodgers. But with her lush curves and snappy comebacks, the feisty redhead is the kind of woman a man wants to settle down with…and that’s the last thing Chad needs. \\n When the paparazzi catch them in a compromising position, Chad’s manager issues an ultimatum: clean up his act or kiss his multi-million dollar contract goodbye. To save his career, his meddling publicist says he\u0027ll have to convince everyone Bridget isn’t just his flavor of the week, but his girlfriend. \\n Being blackmailed into a fake relationship with Chad Gamble isn’t easy, especially when the sizzling physical attraction between them is undeniable. With a month to go on their arranged pretense, it\u0027s going to take every ounce of willpower they have not to fall into bed together...or in love.\\n","cover":"https://allnovel.net/images/tempting-the-player-gamble-brothers-2.jpg","author":"Jennifer L. Armentrout","type":"Romance","source":"allnovel","link":"https://allnovel.net/tempting-the-player-gamble-brothers-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:37:05 PM"}}
