{"id":108655,"no":26,"title":"Page 26","content":"Captain Pierce led his team toward the house, or at least he tried to. Twenty-nine men spread out to either side of him, armed with a vast array of weaponry. The ruling thralls had tried many times to make the militia into an army, insisting on uniforms and similar weaponry. Unfortunately, with so many weapons available in this New World and with little in the way of threat to keep the thralls busy, many of the dictates were ignored. Most of the militia continued to carry those weapons that were more suited to their personalities and, while this was fine when they were guarding brain-dead humans, it was a totally different matter when they were facing an enemy who had proved their capability in fighting back.\n The uniforms had started out the same, but while they still retained a similar theme, these too had been adapted. These additions included anything as innocuous as a bandana tied to the left arm denoting different squads by colour to headgear more suited to a ballgame than any theatre of war. The ruling council had all but given up on disciplining these transgressions when the vampires had cleaned house and the next level had taken over. Up till now the new council had been too busy to address this issue though they would have to do so.\n The lack of discipline in the way the thralls dressed was plainly visible to Pierce now in the way his platoon approached their target. Pierce sighed as he looked along the line and saw its ragged form. Some of the thralls were a good fifty meters ahead of the rest of the platoon and others had fallen behind as they stepped on cigarettes or finished their conversations before they caught up. All of them walked with a lazy inattention to what they were doing. He could see that the ranks had taken full advantage of the current confusion of the leadership purge and openly carried such diverse weaponry as bazookas and chain-fed machine guns, none of which would be of any use for close-quarter fighting inside the building ahead of them. He had tried numerous times on the way here to impress on the men how capable these humans were but it was hard to impress soldiers with the strength and speed that these thralls had. They saw this manoeuvre as a pleasant break to the tedium of guard duty and nothing more.\n The main downside to this was that he had lost control of his force as an effective fighting force. He had been a Captain in the National Guard and his rank had continued in this new world, however, where discipline and the army\u0027s chain of command structures were enough before they counted for nothing under the vampires. In this world he had to earn respect and there had been no opportunity to do that up to this point. He hoped that today he could prove his worth to his men and his own superiors.\n Dawn had come and gone, but a slight mist still licked at the river\u0027s surface and the edges of the nearby forest. There was no sign of life from the house. He whistled and signalled for the outer edges to take up positions on either side of the complex and cursed as he saw the men ignore him yet again. His cheeks burned red with embarrassment as he thought what his superiors would think. His men looked more like a group out on a Sunday stroll than a platoon about to go into battle.\n Their approach was confident; all the thralls walked upright, rather than sprinting in a crouch to present a smaller target.\n If it\u0027s the last thing I do I...\n He heard a dull click and stopped dead. He looked down at the thin metal line that lay on the ground under his boot. His eyes flicked from side to side and he noticed that the line ran up to a small clump of earth beside him. As he looked now he suddenly noticed that there were many of these mounds surrounded the entire approach to the house.\n \"Oh, shit!\"\n And then the Claymore mines exploded.\n Thousands of small metal bearings shot from the mines at ferocious speeds. Projectiles filled the area in front of the house; they shredded flesh and shattered bones. Bodies jerked spasmodically in a grotesque dance as the platoon was hit repeatedly by the flying shrapnel. Some of the thralls managed to get a few rounds off, firing blindly, before they were hit by the hail of death. The carnage was terrible; blood flowed copiously and turned the whole area red. Some of the bodies fell into the river, and red swirls eddied along with the current while bodies floated by the bank.\n When the smoke cleared the grounds were littered with bodies and limbs. There wasn\u0027t a sound. The Lieutenant, ashen-faced, turned to Evans and swallowed deeply. \"Should I call off the second platoon, Sir?\"\n \"What second platoon?\" Evans shouted.\n The second Platoon had just settled into position when they heard the explosions and the screaming. From their location in the forest, behind and to the east of the complex, they couldn\u0027t see what was happening and had no way of knowing who was screaming.\n \"Sounds like Alpha platoon are really giving \"em hell, sir.\"\n Captain Gilbert heard the words coming from his Sergeant\u0027s mouth, but he had to shake his head to bring himself back into focus. \"What\u0027s that, Jim?\" he said.\n \"I was just saying I hope they leave something for us, sir.\"\n Peter Gilbert nodded and prepared to launch his own attack. A loud squawk from the radio delayed his order and he looked to the communications officer for news.\n \"Sir, command has called off the attack. We\u0027re to wait for the artillery.\"\n \"Oh, shit,\" the sergeant cursed. \"We miss out on all the action.\"\n Gilbert nodded agreement. \"Maybe next time,\" he consoled and the men began to back up from the fringe of the trees.\n Just then the whole forest seemed to come alive around them. Branches that had been held taught by strong rope were suddenly cut, and the whiplash sent the limbs shooting toward the platoon. The thralls at the rear of the column were the first to notice anything. The rustling of the tress increased in volume until the first branches crashed through the clearing and smashed into the retreating soldiers.\n The thralls were picked up off the ground and flung violently against the surrounding trees. Bodies were wrapped brutally around tree trunks; bones were snapped and crushed when they dropped to the ground. The other thralls panicked and began to run in all directions. Two of them ran out toward the complex. A solid wooden frame suddenly appeared from above and slammed into the fleeing thralls. The frame was liberally dotted with long, wickedly sharp spikes that impaled the thralls with such speed they didn\u0027t have time to scream. Three others ran toward the river and the ground suddenly dropped from beneath them. They disappeared from view, and then the screaming began when they landed on the stakes set into the base of the hole.\n Gilbert tried to regain control by shouting orders, but the screaming from the injured and the panicked shouting of those trying to escape drowned out his commands. He pulled his M-16 from around his back and fired three rounds into the air. The sudden crack of the gun was so out of place in the forest that most of the platoon stopped and looked to the sound.\n \"Okay, let\u0027s get out of here, but carefully...\"\n Before he had a chance to speak further, there were a number of explosions around them. Everyone looked frantically around to see what this latest trap might be.\n The trees began to fall; there seemed to be hundreds of them. The noise was thunderous, like standing under a waterfall. The trees fell, taking smaller trees and branches with them when they dropped toward the platoon. Some of the thralls stared, frozen in fear, while the trunks loomed larger. Others bolted aimlessly, only to be hit by stray branches or crushed by the falling trunks. Thralls were crushed or impaled by the wood when the trees crashed to earth and completely decimated the entire area.\n After the last tree had fallen, the only sound to come from the clearing was the occasional creaking of wood. From the pit, at the edge of the clearing, the radio, which had miraculously survived, squawked to life and demanded attention.\n \"No answer, sir.\" The communications officer shook his head to emphasise the point, and the Lieutenant turned to Evans.\n \"I heard,\" Evans muttered and saved the Lieutenant the embarrassment.\n \"At least the artillery will be here within the hour. We\u0027ll get them then.\" The Lieutenant was ashen faced and didn\u0027t really look as if he had convinced himself, let alone his stone-faced General.\n Steele arrived at the scene around mid-afternoon. By that time tents had been erected and cooking fires lit. Steele sauntered into camp, where the smell of roasted meat filled the air. Thralls stood miserably around, like drunks at closing time. Bodies littered the lawn in front of the house and added to the overall pall of despair that had descended over the camp.\n Steele whistled while he looked about him and then made his way over to Evans.\n \"I see you found them, then. Come to admire your handiwork, eh?\" Evans indicated the complex.\n Steele reeled, pretending he\u0027d been shot. \"General, you wound me.\" Steele sobered and looked directly at the General. \"Actually, you\u0027re half right. Yes, I did find them; but no, I didn\u0027t report it.\"\n \"What...how?\" Evans stammered.\n \"Looks like I don\u0027t enjoy the lofty level of trust I thought, huh?\" Steele smiled while he spoke.\n \"You might be right. You don\u0027t look too worried about it, though.\"\n \"Worry is for those with something to lose, General.\" Steele dropped his gaze. \"Still, it looks as though our friends are doing quite well.\"\n Evans followed Steele\u0027s gaze to the complex.\n \"Yes, they haven\u0027t fired a shot yet, but they\u0027ve taken out fifty of my men.\"\n Both men were distracted by the noises of heavy machinery and looked over to see the artillery beginning to arrive.\n \"You don\u0027t seem too worried about that, General,\" Steele countered. \"It\u0027s a pity those guns will pound the shit out of them, isn\u0027t it? Doesn\u0027t seem quite sporting, eh?\"\n The General stood for a moment and Steele thought he was about to say something but then he simply shrugged. \"Well, if you\u0027ll excuse me, I have things to do.\" Evans strode purposely away.\n In the middle of bustling activity, General Jack Evans stood still, impassive and outwardly calm. But inside turmoil raged. All around him thralls hurried about their business. The walls surrounding the house had already been cleared to make way for the large guns, and the thralls busied themselves un-coupling equipment, rolling artillery into position, checking sights and unloading ammunition.\n The young Lieutenant shouted orders. Evans could tell that it would not be long before the human facility was a smouldering ruin. He looked down at the grenade in his hands, focused his will on the pin, and sent an impulse to his hand to pull it. For the fourth time in the last few minutes his finger didn\u0027t move.\n Goddamn mind control, he thought bitterly.\n Over the last two years Evans had pushed against the control that bound him to the Vampires. He still snapped to orders when a master was in sight. Their very presence somehow acted as a stimulant, but during the day he had been able to push his independence further and further. He had gotten to a stage now where he could think relatively freely and perform small actions of defiance. He had even been able to delay the order to reinforce the thralls during the last assault to give the rebels the time they needed to get away.\n He had also succeeded in coming to the artillery base; even to liberate the grenade, but he just couldn\u0027t pull the damn pin.\n \"Come on it\u0027s only half an inch,\" he muttered. Sweat poured from his forehead. He looked up and saw that the thralls were nearly ready to commence firing and he tried once more. He put every ounce of will power into moving the pin.\n \"Those pins can be a bitch sometimes,\" a voice whispered in his ear. His heart leapt in his chest and, dizzy with the shock, he turned slowly to see Steele\u0027s grinning face. \"I had a think about what you said.\"\n Evans could barely hear Steele for the blood pounding in his head. The two men stood mere feet apart and looked at each other while activities continued around them. Finally, Evans saw Steele reach over and take the grenade. He was powerless to stop him.\n \"And?\"\n \"I think they deserve a chance, don\u0027t you?\" Evans said.\n Evans watched Steele closely and saw him nod slightly. Then without another word Steele pulled the pin. The metal clasp sprang free and he dropped the explosive into a nearby ammunition crate.\n \"Run,\" he said.\n Evans didn\u0027t need to be told twice.\n The Lieutenant noticed the two men talking, but paid little attention while he readied his crew for the barrage. He smiled in anticipation when the first shell was loaded into the breach. He raised his hand to signal the firing order when he noticed the General break into a run out of the corner of his eye. He turned slightly and frowned at this strange turn of events.\n \"General ...\" he began, and then the grenade exploded.\n It took only a fraction of a second more before the rest of the ammunition followed suit. The roar was deafening.\n Evans and Steele launched themselves to the ground and covered their heads while shrapnel and rock flew in every direction. Bodies were shredded and equipment launched into the air by the force of the blast, only to land in twisted, useless piles across the lawn.\n \"Whoooooaaaaaa!\" Steele shouted. \"What a rush! Come on; let\u0027s see what other mischief we can create.\"\n Jack Evans pulled himself to his feet and looked up at the darkening sky. \"It\u0027ll be nightfall soon,\" he commented with a worried frown.\n \"Yeah, oh well, you only live once,\" Steele replied simply. \n","sourceLink":"https://allnovel.net/vampire-apocalypse-a-world-torn-asunder/page-26.html","bookId":2518,"book":{"id":2518,"title":"Vampire Apocalypse: A World Torn Asunder","description":"Storyline: \n The war is over and the Vampires have won. The drying up of the world\u0027s oil resources leads to the fabled End of Days. Technology stagnates and communities grow ever more insular. With communication between cities lost and attention turned inward, the vampires rise from the shadows where they have survived for centuries and sweep across the globe. \n By the time word spreads it is far too late and Vampires enslave humanity and keep them in walled cities to breed. The Vampires are masters of the darkness but maintain control by day through the use of Thralls - humans who have been bitten but have not yet crossed over, and whose inhuman lusts make daylight as terrifying as night. \n In the midst of chaos, a small band of rebels lead a terrified existence, but their survival is threatened by the Vampire\u0027s new scanning procedures. Peter Harris is an ordinary man. Young and reckless, he is frustrated with the group\u0027s stagnation and pushes for one more daring mission. His recklessness has exposed the group - but it has also increased the size of their community. Now, as circumstances force them to take the offensive, and accompanied by a small group of professional Vampire assassins, John will make one last stand for humanity\u0027s survival in the Vampire Apocalypse.\n \n","cover":"https://allnovel.net/images/vampire-apocalypse-a-world-torn-asunder.jpg","author":"Derek Gunn","type":"Horror","source":"allnovel","link":"https://allnovel.net/vampire-apocalypse-a-world-torn-asunder.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:22:35 PM"}}
