{"id":105378,"no":3,"title":"Page 3","content":"She would reach puberty at about the same time that I reached forty. Both prospects were unendurably upsetting. I started to put my arm around her, and for the first time I wondered if maybe I shouldn’t put my arm around her, and I winced, and she read about Alice while I thought first of Lewis Carroll and then of Vladimir Nabokov and finally of auto-defenestration. The next night I trudged to the subway and went down to the New Life restaurant on West 28th, where Katin Bazerian dances, wearing the name Alexandra the Great and comfortingly little else. I caught the last set. When it was over Kitty came to my table and we did in a bottle of rhodytis. We listened to bouzouki music and didn’t talk much. Eventually I said, “Get your coat and come home with me.” “I don’t know.” “What’s to know? We’re nice people and we love each other and we should go home together.” “Oh? We love each other?” “We always have.” “You drift from girl to girl, Evan, like a bee from flower to flower. Like a dog from hydrant to hydrant. Evan, I think there are healthier things in this world than our cockamamie relationship.” It is always bad when girls talk about relationships. They shouldn’t be allowed to use the word. “I always thought you liked our relationship,” I said. “Oh, I do. Oh, shit, everything’s rotten.” And she looked at the floor, and I watched the wine evaporate in my glass, and she looked up and said, “He wants to marry me.” “Who does?” “A… a fellow. You don’t know him. He’s a nice boy, he works steady. He’s an assistant cook at Gregorio’s on the next block and he plans to be a chef in a few years and he loves me and we talk to each other, you know, and we are good together, you know, I mean bed, we’re good together-” I wanted something with more authority than rhodytis. Something like heroin, for instance. “Evan, when a woman is thirty she can frankly forget the whole thing, and I am halfway to being thirty.” “You’re fifteen?” “I’m twenty-five.” “That’s halfway to-” “Between twenty and thirty it’s halfway.” “Oh.” “I mean, this life is fine up to a point, but at a certain point a woman is ready to settle down. It’s a human thing, to want to settle down.” “I know.” “I’m only human.” “Uh-huh. What did you tell him?” “That I didn’t know. That I had to think.” “What are you going to tell him?” “I’m not sure.” She was silent for a few moments. “You know,” she said, her voice softer, “it’s a funny thing, a proposal of marriage. A very strange thing. I have been proposed to before but it was never something to take very seriously, or at least I didn’t, you know, on account of not being ready to. To be serious, I mean. But it is a funny thing. It makes you feel very good, you know, that someone would ask you to marry him.” “Sure.” “I always wondered, you know, if you would someday ask me to, uh, to marry you. And how I would feel. You know.” “Er.” “I think about it occasionally, because you’re right, we do love each other. But I know you’ve never wanted to get married so I never pushed anything. But when this fellow asked me, oh, I thought how I had two minds about it, and I asked myself how would I feel if it had been you proposing instead of this fellow, and I knew I would be just of one mind. That I would want to marry you. And make a home with you, with you and Minna, sort of a ready-made family almost, and, oh, this is just what went through my mind and I shouldn’t have said anything to you but I couldn’t help it-” Her voice just trailed off, as if fading in the distance. “I’d better get my coat and go home now, Evan,” she said a little later. “To Brooklyn.” “I’ll take you.” “No, please, I’ll just get in a cab.” “I’ll put you in a cab.” “Well, if you want.” I flagged a cab on Seventh Avenue. I held the door for her and said, “Look, I don’t want you to marry this cook. But I can’t tell you not to because-” “There’s nothing to explain.” “I suddenly find my life completely fragmented, and up until a little while ago it had seemed very together. I have things to think about.” “I know, Evan.” I took the subway home. I missed my stop and had to walk all the way back from 116th Street. When I got home I drank a lot, but it didn’t do any good. That night was followed by two more damp and dreary days, and the best that could be said for them was that they were generally uneventful. I read my mail, I answered my telephone, I grunted at Minna, and now and then I went around the corner to the liquor store. The second day I got a phone call from a girl who was a friend of a friend and who had just gotten into town and needed a place to stay, and ordinarily she would have been a perfectly satisfactory girl, and ordinarily one girl is the world’s best way to get over another girl, but this was not an ordinary time. My dilemma was hornier than I was. I found a place for the girl to stay, and I took her there and left her there. She seemed surprised. On the morning of the third day I went around the corner for breakfast. I sat at the counter and had scrambled eggs and home fries and as much coffee as possible. There were a few tables of Columbia students in the back, but I was the only diner at the counter, just me and eight empty stools. I was working on a fourth cup of coffee when the door opened and the Sikh came in. He was six and a half feet tall, with the final six inches consisting of turban. He had a full black beard, a bronze face, baggy pantaloons, and bore a scimitar in a tooled brass sheath. I looked at him and decided I was hallucinating. He looked both ways like a conscientious child at a crosswalk, and then he strode to the counter and took the stool next to mine. The waitress was a solid stolid lady whom nothing surprises. She moved to take his order. The Sikh extended his lower jaw slightly, retrieved it, smiled carefully, and said that he would like an extra dry martini, made with Bombay gin, straight up, with just a twist of lemon peel. The waitress shook her head. “I am a guest in your nation,” the Sikh said. I had a fair idea what this was going to be all about. One develops a feel over the years. I turned to the Sikh and told him the place didn’t serve liquor. “Ah,” he said. “My apologies, good madam. Apple pie and coffee, if you please.” She brought it, served him, and went away, all without changing expression. I waited. After ingesting the final bite of apple pie and swallowing the final sip of coffee, the Sikh lowered his head and said, “Twelve-fifteen, Hotel Garrand, Room 1304, Mr. Cuttlefish. Godspeed!” And left. Of course it was the Chief. Who else sends a costumed Sikh to drink martinis in a Broadway diner? Who else employs couriers who wed the inconspicuousness of the Eiffel Tower to the subtlety of a nuclear warhead? So I went to the Hotel Garrand, and shortly after twelve I got into the elevator. The Garrand, it turned out, had no thirteenth floor. I went back to the desk and asked about Mr. Cuttlefish, who turned out to be in Room 1403. Well, no one’s perfect. He opened the door just as I knocked on it. “Tanner,” he said, beaming at me. “Come in, come in. A drink?” He poured scotch for both of us, gave me a glass, narrowed his eyes, frowned. “You knew Joe Klausner, didn’t you?” I had. “Then you’ll join me in drinking a toast to his memory.” “What happened?” “In Berlin. Stuffed into the engine compartment of his own Volkswagen. The engine had been removed. He’d been onto something and evidently they got onto him. Piano wire around his neck. Eyeballs all popped out of his head. Face all bloody purple. I’m not being British about it. That was the color, bloody purple.” I made a sound mixing sympathy with nausea. The Chief turned, looked out across the room. Then he turned to face me again. “To Klausner,” he said. “To Klausner.” We drank. I have never been able to decide whether the Chief is particularly intelligent or particularly stupid. Most of the time I suspect he’s merely mediocre, but it’s impossible to be sure. He runs a nameless intelligence agency that is so secret that its own agents don’t know how to get in touch with it. His employees operate on their own initiative, establish their own contacts, pull their own strings, and ultimately cut their own throats. You don’t have to write out reports when you work for him, nor do you have to worry about any of the usual bureaucratic claptrap. You just go out and do the job. The Chief thinks I’m one of his best men. He got this idea about four years ago and I’ve never seen fit to disabuse him of the notion. Every once in a while he finds some dumb way to get in touch with me and shoves some assignment at me, and every once in a while I can’t find a way to avoid the assignment, so maybe I work for him and maybe I don’t. It’s hard to be certain. The thing of it is that I’m on so many subversive lists as it is, with the FBI tapping my phone and the CIA reading my mail (or else it’s the other way around), that I figure I need all the help I can get. “Joe Klausner,” he said. “My boys are on their own, Tanner, but I would have helped Joe if I could have. But all at once he was dead. Just like that.” He walked to the window, looked out of it. “I didn’t even know he was in Berlin. I thought he was in St. Paul, Minnesota. Then there was a call from Berlin -” He filled his glass. “You don’t know Sam Bowman,” he said. “No.” “It may be too late. Just as it was too late with Joe. But there’s a chance, you know.” He drained his glass. He seems to drink all the time but never seems affected by it. Either I have never seen him drunk or I have never seen him sober. “Ah, Tanner,” he said heavily. “I don’t suppose you’ve so much as heard of Modonoland, now have you?” “Yes.” “Didn’t think so,” he said. “Most people – you have?” “Yes.” He said that was marvelous and would save a great deal of time. I don’t know what time it saved, exactly, because he was primed to deliver a certain speech and he couldn’t alter his programing. “A few thousand square miles in West Africa. A British Protectorate since Versailles. German before that, but a mixed settlement of Germans and Belgians and English and Dutch. Given its independence a couple of years ago. Retained Commonwealth status. Government seesawed for a while. Then a strong man came along.” “Knanda Ndoro,” I said. “Kuhnanda Nuhdoro,” he said, adding a couple of syllables. “The Glorious Retriever, he called himself. Sounds like something that might be useful for hunting waterfowl.” He chuckled deeply. “Typical African dictator at first. Went about building grand marble mausoleums and calling them government office buildings and cultural centers and such. Scattered statues of his beautiful self wherever two streets intersected. Which didn’t happen too often, Modonoland being on the primitive side. Did the usual, you know. Had himself a harem, lopped off the heads of the loyal opposition, usual sort of thing.","sourceLink":"https://allnovel.net/me-tanner-you-jane-evan-tanner-7/page-3.html","bookId":1534,"book":{"id":1534,"title":"Me Tanner, You Jane (Evan Tanner #7)","description":"Storyline: Me Tanner, You Jane (Evan Tanner #7) It\u0027s a jungle out there. Literally. At least for Evan Tanner, eternally sleepless sometime superspy, who finds himself in Africa on the trail of the AWOL ruler of tiny Modonoland. It seems the petty despot\u0027s gone missing, and he\u0027s taken the state treasury along with him. No stranger to impossible missions and international peril, Tanner\u0027s been in over his head before. This time, however, he\u0027s in imminent danger of being buried alive. And it all has to do with the CIA, white supremacists, moderate revolutionaries . . . and a blond jungle bombshell named (no joke!) Sheena. Tanner\u0027s always been a sucker for a pretty face and a curvaceous body, especially one that\u0027s wrapped in leopard skin. But this red hot renegade daughter of a local missionary is a maneater. Which means this time Tanner\u0027s goose is well and truly cooked.","cover":"https://allnovel.net/images/me-tanner-you-jane-evan-tanner-7.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/me-tanner-you-jane-evan-tanner-7.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:46:29 PM"}}
