{"id":40089,"no":12,"title":"CHAPTER XII.","content":"THE INDIAN MUTINY. \\n\\n \\n\\n ON the 12th of July, 1856, at the Court at Buckingham Palace, Lord Palmerston was made a Knight of the Garter, it being understood that this was done in recognition of his services in reference to the Crimean War. When we remember what had occurred a few years back as to his dismissal from the Foreign Office, we may allow that he was bound to accept this token of her Majesty’s favour. Lord Melbourne is reported to have said some years earlier, when a similar opportunity had come to him, that he had no need to bribe himself;—and he died without having K.G. written after his name. It is probable that no such word was used by Lord Melbourne, and that the cynical phrase was one merely made to suit the occasion. But there was a truth in it which took hold of men. There is, perhaps, a feeling that, as the Prime Minister is supposed to recommend the recipients of this honour for Her Majesty’s acceptance, Palmerston would not now stand lower in the world’s esteem had he declined it. Lord Fortescue, who was installed on the same day, could well afford to accept the blue ribbon. There was a reason why Lord Palmerston should accept it. But had he not done so, there would have been an increased glory in going to his rest, as Lord{175} Melbourne had done, without burdening his name with the additional title. \\n\\n \\n\\n In August, 1856, when Lord Palmerston was surrounded by the difficulties incident to the completion of the war, he lost his only brother; and with him those letters came to an end, which give us the freest account of Lord Palmerston’s thoughts, his ambition, his arrogance, and his justice. We do not hear a word from him afterwards about his brother. He might have been the merest casual friend, chance-selected for some smaller embassy. For his elder brother had never pushed him up to the higher places at Paris, Constantinople, Vienna, or St. Petersburg. Sir William Temple had probably lacked something either in intellect or energy, or perhaps in discretion, of that fitness for the duties of an ambassador which had been found in Lord Granville, Sir Stratford Canning, and Sir Hamilton Seymour. At any rate Lord Palmerston was determined that he would not be accused of nepotism. In expressions of grief there is somewhat of feminine feeling, which, to the nature of Lord Palmerston, was antipathetic. His brother had lived at Naples for many years, our Minister at a third-rate Court. Now he had come home and died, and, as far as Lord Palmerston’s outside life was concerned, there was an end of him. \\n\\n \\n\\n Early in the Session of 1857 there sprang up a difficulty in China in reference to a small ship which has ever since been known as the lorcha Arrow. The Arrow, on a charge of piracy, was boarded by certain Chinese from a war junk, and Sir John Bowring, who was our Governor at Hong-Kong, demanded reparation from Commissioner Yeh. Then arose a quarrel and a fight, in which, of course, the English got the better. The{176} matter, which was of importance at the time, has by lapse of years become so trivial as to be hardly worthy of notice here,—but that it led to a dissolution of Parliament. A motion was brought forward in the House of Lords by Lord Derby, blaming the Government, and was carried by a majority of thirty-six. Mr. Cobden brought a similar motion before the House of Commons, and was supported by Mr. Disraeli, Lord John Russell, Sir James Graham, and Mr. Gladstone. Mr. Disraeli twitted Lord Palmerston with having made his complaint to the country, and bade him follow his complaint by an appeal. The motion was carried by a majority of sixteen against the Government, and Lord Palmerston did appeal. \\n\\n \\n\\n That Lord Palmerston, as Prime Minister, should have been distasteful to Mr. Cobden and Mr. Gladstone we can understand. He was essentially a War Minister, and had latterly dealt with war alone. To Mr. Cobden and Mr. Gladstone he must have been the incarnation of insular aggression. But Lord Derby and Sir James Graham, Lord John Russell and Mr. Disraeli, could have entertained none of this feeling. They had shown themselves at least anxious to conduct the war, and we cannot imagine that the question of the lorcha Arrow can have so operated upon them as to make them feel it imperative for the sake of England’s glory to turn instantly upon the man who had just brought England through her difficulties. It was simply a party conflict, in which Aristides had been too just. But Aristides resolved that he would follow his enemies’ advice, and see what the country would say to it. \\n\\n \\n\\n He must have known when he went to the country what would be the result. He had just carried the war to a successful end, and the country would not see him{177} displaced. The normal Englishman was thoroughly proud of him, proud of his bad jokes, proud of his unflinching energy, and proud of his years. He called his opponents, when they denied that they combined together against him, “the fortuitous concourse of atoms.” The joke was better worth quoting than those he usually made. The country was even proud of him because he stuck to Tiverton instead of accepting a more glorious seat. To have deserted old friends in his glory, who had been true to him before his glory came, would not have been like Palmerston. So he got his majority in spite of the lorcha Arrow, and Mr. Bright and Mr. Cobden were both excluded from the new Parliament. \\n\\n \\n\\n Then came upon us the Indian Mutiny; and men who had never doubted during the Russian campaign, though they felt that England must strain every nerve for victory, began to fear that the few who were there to bear the brunt must perish in the attempt. It was a common fear that if India was to belong to us for the future, India must be conquered a second time; and while men thought of this, their hearts fell within them as they remembered what must be the fate of the British men, and children, and women, who were doomed to suffer things many times worse than death. And there was a feeling by no means uncommon, and very deadly, that India would be lost for ever, and with it all the glory of England. That this idea prevailed in France, which had just been our ally, and in Russia, which had just been our enemy, and in the United States, which of all nations was the nearest akin to us, cannot be doubted. When men’s hearts are so heavy they show it in their faces rather than by their speech. There were months in 1857 when men in England hardly dared to speak aloud what they thought and{178} felt about India. But of Lord Palmerston it must be said that he was made of some stronger and coarser fabric than other men, better prepared for hard wear, and able to bear without detriment rain and snow and dirty weather. Through that period of the Indian Mutiny,—which must have been harder, we think, for an English Prime Minister to bear even than the temporary failures of the Crimea,—he never blanched. \\n\\n \\n\\n It was said by the Edinburgh Review, just before the tidings of the Mutiny reached us, that “the past Session found Lord Palmerston covered with the glory of having trodden down the wine-press alone.” This was the very pinnacle of the column of praise which was raised to his honour on behalf of his steadfastness against Russia by those of the Press who supported his side in politics. But it was true. He had done it alone. If we look back we can find no other Minister who had not failed, or hesitated, or remained in the background. But yet we think that the effort made by him to suppress the Indian Mutiny was the greater of the two. It came easier to him because he had been made familiar with the efforts necessary for such work by the Russian war; and coming, as the Mutiny did, close after the Russian war, and dealing with matters less palpably open to the mind’s eye than the Russian quarrel, it created, with all its horrors and all its triumphs, a less abiding thoughtfulness. India had been ours, and must be ours. So we felt when India was again ours. But it had nearly come to pass that India, at any rate for the time, was not ours. But Palmerston went on governing the country through it all with apparent equanimity. In three months we had sent 30,000 troops to India, with all their horses, appurtenances, clothing, and armour. When we remember{179} the distance, the rapidity required, the scattered positions of the men to be collected, and of the transports needed, I think we may boast that no other country ever made such an effort. \\n\\n \\n\\n After all, much of the hardest fighting was done by the army stationary in India before the troops from England arrived. It would be unfair to say even a few words about the mutiny without declaring this. Delhi had been taken from the mutineers. Outram, Havelock, the Lawrences, and Inglis had done their work. When all were true and all were heroes, there need be no jealousy of praise. But to Lord Canning, the son of Palmerston’s old tutor in politics, the Canning who had been so hard on Palmerston in the Don Pacifico debate, the Canning who had gone to India most unwillingly in obedience to Palmerston’s commands, the Canning to have said a word against whom required the self-annihilation of a Minister,[N] Canning who completed by his death his victory in the country he had been sent to govern,—to him and to those brave men whom the Mutiny, bursting from its swarthy ranks, had found in India, the first praise for crushing it is due. \\n\\n \\n\\n Lord Palmerston in the Mansion House had to blow England’s trumpet in addressing the normal Mansion House audience. “An Englishman,” he said, “is not so fond as the people of some other countries are of uniforms, of steel scabbards, and of iron heels; but no nation can excel the English, either as officers or soldiers, in knowledge of the duties of the military profession, and in the zeal and ability with which those duties are performed; and whatever desperate deeds are to be{180} accomplished,—wherever superior numbers are to be boldly encountered and triumphantly overcome—wherever privations are to be encountered, wherever that which a soldier has to confront is individually or collectively to be found, there, I will venture to say, there is no nation on the face of the earth which can surpass,—I might, without too much national vanity, say, I believe there is no nation which can equal,—the people of the British islands. But, my Lord Mayor and gentlemen, while we all admire the bravery, the constancy, and the intrepidity of our countrymen in India, we must not forget to do justice also to our countrywomen. In the ordinary course of life the functions of women are to cheer the days of adversity, to soothe the hours of suffering, and to give additional brilliancy to the sunshine of prosperity; but our countrywomen in India have had occasion to show qualities of a higher and nobler kind, and when they have had either to sustain the perils of the siege, or endure the privations of a difficult escape, to forget their own sufferings in endeavouring to minister to the wants of others, the women of the United Kingdom have, wherever they have been found in India, displayed qualities of the noblest kind, such as have never been surpassed in the history of the world. Henceforth the bravest soldier may think it no disparagement to be told that his courage and his power of endurance are equal to those of an Englishwoman.” \\n\\n \\n\\n We can hear the words of the old man now, and tell ourselves that this was a moment in which national vanity might be forgiven. And we can hear the cheers, laden with vanity, as also with true glory, with which they were received. There had been some discussion{181} during the Mutiny as to the expediency of accepting such foreign helps as had been offered. Two Belgian regiments had been suggested. But Lord Palmerston had set his face against all assistance, even from Belgium. He wrote as follows to Lord Clarendon on the matter;—“The more I think of it, the more I feel it is necessary for our standing and reputation in the world that we should put down this mutiny and restore order by our own means; and I am perfectly certain that we can do it, and that we shall do it.” And now it had been done. \\n\\n \\n\\n We must pause for a moment here, to state that a Bill was now brought before Parliament for entirely altering the system under which India was governed. My readers will probably know that up to this time the East India Company did exist, with the power, which had gradually been curtailed indeed, and brought more or less under Government control, of managing the affairs of India as though it were simply the scene of certain commercial transactions. There was a Board of Control attached to the Government, but there was no Secretary of State for India. There was a Board of Directors, but no Indian Council directly appointed by Government. And my readers also know that there is at present a Secretary of State, equal in rank to the other Secretaries; and that India has become a branch of our Government,—as the Colonies are, and Foreign Affairs. I do not know that I need go further into the nature of the change effected than to say that it was carried out in conformity with the proposition made by Lord Palmerston, and in compliance with the Queen’s Speech in the previous December. This was done early in 1858. There was a long debate on the first reading, and infinite delays were proposed.{182} This was chiefly due to Mr. Disraeli. He declared that “at present we are undertaking an immense liability; we are entering into engagements which will some day make us tremble; and we have no security whatever that those who really possess power in India, who really manage the resources of the country, will be in the least controlled for our benefit.” Nevertheless, upon a division, the Bill was carried by a majority of 145, against an amendment moved, recommending delay. Such was the end of the East India Company as a ruling power; and since that date India has been simply a dependency of the British throne, as are Canada and the Australias. This, too, is to be reckoned among the performances of Lord Palmerston. \\n\\n \\n\\n Then there arose a question on which Lord Palmerston was most absurdly turned out of office; and he remained out from February, 1858, to June, 1859. It was done absurdly, because the matter in dispute was one in which, not only the country, but also the House of Commons, was altogether at one with him. An attempt had been made to murder the Emperor of the French. It had been done in a manner altogether reckless of human life, the number killed and wounded when the Emperor escaped having been stated as high as 150. And the horror was felt to have been aggravated when it was known that the Empress had been with the Emperor when the attempt was made. Orsini, an Italian, was the leader of the gang by whom the grenades were thrown beneath the Emperor’s carriage; and it came out in evidence that Orsini, with his fellow-assassins, had lived in England, and had here constructed his murderous machine. The French Minister of the Emperor applied{183} to our Foreign Office for co-operation in the matter, and desired that the law might be so altered as to make it impossible that suspected assassins,—assassins suspected—should to be so by the English or French Government, be able to carry on their trade in London. Lord Palmerston assented, and a Bill, intending to give the Ministry of the day the power of dealing with such persons, was carried in the House of Commons by a majority of no less than 200. This may be taken as the outspoken opinion of the House, when its feeling was simply one of indignant wrath in regard to Orsini. \\n\\n \\n\\n But in the meantime the “French Colonels” had signalized themselves. The French Colonels were certain officers who were indignant on the matter. They had known that Orsini had brought his grenades from London, but had not known that the British Government was anxious to do as the French Ministers would have them. They consequently sent various addresses to the Emperor, in which the abominable conduct of England was described in very strong language. The “Colonels” appeared to have thought that all England had been engaged in making murderous weapons for the accommodation of Orsini. And these addresses were unfortunately published in the Moniteur, whereby a quasi-official authority was attached to them; because all things published in the Moniteur were supposed to have received an official stamp. The French Ambassador expressed his regret, stating that the addresses had passed into the Moniteur without notice, and Lord Palmerston urged the House to disregard the vapourings of the “Colonels.” But the insult to the nation was there, in{184} the columns of the Moniteur, and was much more widely known than the apology which had been sent. There does appear to have been some lack of official despatches which might have been made known to the House. At any rate, an amendment was now proposed,—“That this House cannot but regret that Her Majesty’s Government, previously to inviting the House to amend the law of conspiracy at the present time, have not felt it to be their duty to reply to the important despatch received from the French Government, dated January 20”—and this was carried by a majority of 19. \\n\\n \\n\\n When that former strong expression of opinion had been given by 299 votes to 99, the Government had been supported by the desire of the Tories at large, to keep down such a nest of hornets as Orsini and his conspirators. To banish them from the country, or to hang them if it were necessary, must have seemed good, and did seem good, to Lord Derby’s party. And it was not the less good because of the French “Colonels”—who after all were a gallant set of fellows enough, standing up for their country and their Emperor. But it was seen that an instant advantage might be taken of Lord Palmerston and his Government; and they who led the Tory party were not slow to take advantage of it. Lord Palmerston, who seems to have been moved to wrath by such desertion, resigned on the following day, and Lord Derby came into office with Mr. Disraeli as his first lieutenant. Palmerston remained out for sixteen months; but before we go with him into comparative obscurity, we must point out that he had now been dismissed—on the motion too of Mr. Milner Gibson, one{185} of his old enemies, the peace-party,—not because as of yore he was supposed to have been arrogant on the part of England, and in the general course of his policy to have given offence to foreign nations; but because he was supposed,—erroneously supposed,—to have truckled to French orders. Palmerston was the same as ever; but so also was the English nation. When he was accused of arrogance abroad, he was dear old Pam to the normal Englishman. But when he was foolishly conceived to have unduly yielded an inch to French influence, there came instantly to his opponents the power of turning him out,—which his opponents were not slow to do. \\n\\n \\n\\n During his holiday he took the chair at the Royal Literary Fund dinner, and there, as elsewhere, he made a speech serviceable to the occasion. To make a speech at the Literary Fund dinner seems to be a duty expected from an ex-Prime Minister. Then came a Reform Bill introduced by the Tories;—this was in 1859. But Lord John was not going to accept a Reform Bill from the Tories as long as he could avoid it. The Government was left in a minority, Lord John having moved an amendment condemning the Tory Bill. Thereupon Lord Derby went out, and the Queen was again called upon to form a Ministry. \\n\\n \\n\\n These formations of new Ministries seem to come very rapidly in the record of one man’s life, and to be passed by as though they were matters of no real importance! But to us looking back now over the intervening years,—and twenty-three years have intervened,—how momentous was that unexpected sending for Lord Granville when Lord Derby retired! Lord John Russell and Lord{186} Palmerston had made a compact together that, as the Queen might choose between them, either would help the other; Lord Palmerston had by this time resolved to abandon his wrath, and Lord John, who expected probably to regain his ascendency, still would not decline to serve a second time under his old colleague should the Queen require him. But the claims of the two were equal, and Lord Granville, as being between them, was selected. When Lord Palmerston had before been asked to reconstruct a Ministry, the country had been at war, and every Englishman was in earnest. Then there had been no alternative. But now there could be no reason why Lord Palmerston should not go back to the ranks; though there might be a reason why he should not serve under Lord John. When it was suggested to Lord Palmerston that he should serve under Lord Granville he wrote as follows to the Queen; “Viscount Palmerston and Lord John Russell, before they called the meeting at Willis’s Rooms, came to an agreement to co-operate with each other in the formation of a new Administration, whichever of the two might be called upon by your Majesty to reconstruct your Majesty’s Government. That agreement did not extend to the case of any third person; but Viscount Palmerston conceives that the same sense of public duty which had led him to enter into that engagement with Lord John Russell should also lead him to give assistance to Lord Granville towards the execution of your Majesty’s commands. Viscount Palmerston’s promise to Lord Granville has, however, been conditional.” “The promise therefore, which he has given to Lord Granville has been made conditional on Lord Granville’s success in{187} organizing a Government so composed as to be calculated officially to carry on the public service, and to command the confidence of Parliament and of the country.” But Lord Granville was not successful. He found, we are told, that Lord John was unwilling to serve under him, and at the same time to leave the leadership of the House of Commons in Lord Palmerston’s hands. Consequently Lord Palmerston was again sent for, and became a second time Prime Minister in his seventy-fifth year. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2736/75348.html","bookId":1395,"book":{"id":1395,"title":"Lord Palmerston","description":"简介： IN looking for material on which to base this short memoir of Lord Palmerston I have of course taken, as my guide to his general life, the biography of Mr. Evelyn Ashley.[A] I have also referred to the unfinished volumes by Lord Dalling, which Mr. As...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2736","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
