{"id":64541,"no":20,"title":"Page 20","content":"I drive the boat all night long, standing at the wheel, while the others lie down, sleeping, as our boat bobs up and down on the currents. Every so often I can hear Charlie\u0027s cries, and I have no doubt that he\u0027s thinking of Flo. Bree leans cuddled with her arm around him, his head on her shoulder. The two of them are inseparable, and I think that if it weren\u0027t for Bree, Charlie would be devastated right now. I stare out at the blackness of the water, its foam racing past us as we go upriver - and all I see is Logan\u0027s face. I see him in the water, drowning, reaching out for me. I see the whirlpool sucking him down. I see him asking for my help, and my being unable to give it. It tears me apart. Every time I close my eyes, I see his. I feel that he is with me now, more than ever, that he is a part of me. I feel a burning desire to have him really here, with me, by my side. In some ways, it is the same burning ache I feel when I miss my dad. I want him here, too. To see everything I\u0027ve accomplished. To be proud of me. To be a part of it all. Ben, awake, walks up beside me and looks out at the water with me. \"I\u0027m sorry about Logan,\" he says softly, looking straight ahead. \"I am, too,\" I answer. \"I can\u0027t believe we made it,\" he says. \"I was sure we were dead. That was good thinking back there.\" \"We haven\u0027t made it yet,\" I caution. \"But we\u0027ve been driving for hours,\" he says. \"No one\u0027s following us. They have no idea. They won\u0027t know until morning. And by the time they find out, we\u0027ll be at least a day ahead of them.\" I shrug, thinking back to all the trials we\u0027ve been through, and knowing that means nothing. \"I\u0027m not worried about them,\" I say, thinking about it. \"I\u0027m more worried about what lays ahead.\" Ben searched the boat earlier, and found nothing - no food, no supplies, no weapons. We are all starving, exhausted, and freezing cold. And the further north we get, the colder it grows. The river is already freezing up in places. I look down at the gauge, and see we\u0027re burning fuel fast. We can\u0027t keep this up much longer. By sunrise, I estimate, will be completely out of gas, and once again, free-floating, at the mercy of whatever sick predators are out there. I want to relax, to kick back and think that we found comfort, that everything\u0027s going to be okay. But this time, I feel no security. Only a sense of anguish. Of needing to survive. In some ways, Logan and Flo are the lucky ones. They\u0027re out of the game. Now, they have no worries. \"Well, we came this far,\" Ben says, \"and I\u0027m proud of you.\" He leans in and kisses me on the cheek. It feels good, and I don\u0027t want him to stop, or to go away. But he does. He quickly retreats, and I wonder if we will be close again. Like we were that night. \"Want me to take the wheel?\" he asks. I shake my head no. He nods, and goes back to his side of the boat. As I stand there, staring out at the night, I wonder again how all of this will end. I think about that town, that mythical perfect town, somewhere north, in Canada. I guess that\u0027s why I\u0027m heading North, unconsciously - to fulfill Logan\u0027s dream. To see if it\u0027s all true. I know in my mind that it\u0027s probably not. But I\u0027ve finally learned something: we need to have hope. Without hope, we have nothing. The sun rises, and I crack open my eyes. We are bobbing, free-floating in the water, our boat adrift in the middle of the Hudson. We are all huddled together, under a single thin blanket, lying down under the open sky. Penelope lies still in Bree\u0027s lap. The boat ran out of gas hours ago, late in the night. But we all remember, what happened to us back there, the last time we left the boat, none of us want to abandon the boat. So we all instead huddled together, and let the current take us aimlessly down the river. We traveled for hours last night, and everywhere, there was nothing but a desolate wasteland. No towns, no humanity. In this cold, without warmth or food, we can\u0027t survive much longer. I\u0027ve been dreaming, peaceful dreams for a change. When I open my eyes, I see the sky flooded with pinks and purples, I\u0027m not sure if I\u0027m awake or asleep. I\u0027m so weak from hunger, so tired, so cold, I can\u0027t even get up. Neither can the others. We are all frozen here, together. I know we will all die here. And finally, I\u0027m ready to accept it. At least we are free. At least we are dying on our own terms. I open my eyes more, and realize I\u0027m awake. I see a world flooded with soft pinks and purples and muted colors, and it is the most beautiful breaking sky I have ever seen. As I look up, at the river, I see something, and I am sure I\u0027m hallucinating. I see our boat moving, upriver, against the current. It\u0027s impossible. I see a beautiful, shining white boat in front of us, tugging us, pulling us slowly upriver. We drift gently, being pulled, somewhere north, by this beautiful boat. The wind strokes my hair gently, and as I lean up, I see it pulls us through huge, shining golden gates in the river. As we go, I see dozens more boats, all shining white, everything perfectly new - and behind them, on either side of the river, I see a beautiful shining city. Everything intact. Stores. Sidewalks. People. Cars. Everything perfect. Immaculate. Clean. Happy. People sitting in cafes, laughing. Mothers strolling with their daughters on cobblestone streets. The mythical city. I force open my eyes, ask myself if this is perhaps my final dream before I die. I\u0027m not sure, but I can\u0027t help feeling that I\u0027m awake. That this is real. That we have found it. And that everything is going to be okay. COMING SOON....","sourceLink":"https://allnovel.net/arena-two/page-20.html","bookId":1692,"book":{"id":1692,"title":"Arena Two","description":"Storyline: Arena Two (The Survival Trilogy #2) Having just escaped from the treacherous island that was once Manhattan, Brooke, Ben, Logan, Bree and Rose make their way up the Hudson river in their stolen boat, low on fuel, low on food, and desperately needing shelter from the cold. On their tails are the slaverunners, who will stop at nothing until they capture them and bring them back. As they make their way upriver in this post-apocalyptic, action-packed thriller, on their way to try to find the mythical city in Canada, they will need to use all their ingenuity and survival skills to stay alive. Along the way they will encounter crazed survivors, roving gangs of predators, cannibals, wild animals, a desolate wasteland, and an unstoppable blizzard. They sustain injuries, get sick, and the Hudson freezes over as they do their best to salvage what they can and avoid the slaverunners’ pursuit. They find a small island and think they have found respite—until events don’t go their way. It is not until they board a mysterious train to nowhere that they find that things can always get worse. Along the way, Brooke’s feelings for Logan intensify, as do her feelings for Ben. Torn between these two boys, caught between their jealousy, she is unsure how she feels—until events choose for her. As they find themselves thrown back into an arena, they are shocked to discover that Arena Two is even worse. Thrown into a barbaric fighting stage, equipped with weapons, pitted against other teenagers—and against themselves—Brooke and the others will be forced to choose what’s important, and to make the most difficult sacrifices of their lives. Because in Arena Two, no one survives. Ever.","cover":"https://allnovel.net/images/arena-two.jpg","author":"Morgan Rice","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/arena-two.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:54:39 AM"}}
