{"id":64373,"no":40,"title":"Page 40","content":"No one followed me as I opened his door tentatively. James was there, sitting at his desk, staring blankly at his computer, his hand unmoving on his mouse. I stepped inside and shut the door softly behind me. I walked to him, but he didn’t look at me. Still, I saw something wounded and vulnerable move behind those tarnished eyes of his as I approached. “James,” I said softly. “I’m sorry,” he said brokenly, his voice no more than a whisper. “I only seem to disappoint you. If it makes you feel better, I’m beginning to hate the man I was before I met you.” I stroked a hand over his hair. “Of course that doesn’t make me feel better. As far as I can tell, you’ve always been wonderful, even during your slutty days.” “I feel like life was easy before I met you, because it didn’t matter,” he said in a rough voice, leaning into my hand. “Nothing mattered before I knew you. I was a pretender, playing at life with monopoly money. I didn’t feel anything. Nothing ever really changed because I just I didn’t care. And now that it does matter—now that everything matters, it’s so much harder, because things have weight now, and my life has substance. You can hurt a thing with substance. I’ve become vulnerable, where nothing could have hurt me before. My mistakes, even my past ones, will have consequences now.” I moved into him, pulling his head into my chest. He nuzzled there, making me sway with the force of his affection. I kissed the top of his head comfortingly. “I understand completely, James. I fought my feelings for you for so long for just that reason. Letting you in meant opening myself up to a pain I thought I was immune to, because I had become frozen to all of it. I was unfair to you, and even to some of my friends. You were right when you told me that I have room in my heart for more than Stephan. You read me so well without me ever having to say the words. It astounds me. Perhaps we were made for each other. You’re making me a believer, my love.” He wrapped his arms around me. “I’m sorry you had to see that video, Bianca. I tried so hard to keep it from getting out.” I rubbed my cheek against that silky hair. “You didn’t make me watch it. I take responsibility for that. And I learned something important from it. It did hurt to watch you with her, but I think it was worth it, in a way.” He pulled away far enough to give me a genuinely baffled look. “Why?! How?” I gave him a small smile and some very solid eye contact. “Because I learned that you may have fucked a lot of women, James, but I’m your first lover.” “Yes,” he rasped, kissing me like he owned me. I loved that kiss, and yes, that ownership. “You’re so different with me,” I told him as he pulled away long enough to pull me on top of him. I straddled him in his chair. “You always were, from the very beginning.” “Yes,” he murmured, undoing his slacks to pull out that delicious cock. It was hard as a poker and ready to go, as ever. “I’ve told you this. It’s unfortunate that you had to see me at my worst to believe it.” He ripped off my panties as he spoke, making the words come out harsh and raw. He impaled me on his arousal forcefully, not checking if I was ready—not letting me respond. It didn’t matter. I shuddered with the pleasure, and the pain, of his possession. He didn’t move once he’d seated me to the hilt, but held me there, looking up at me with his heart in his eyes. I loved those eyes so much. I cupped his cheek. “You’re so different with me,” I repeated. “You never made me look down; you never let me look away from you. You never walked away from me.” He shook his head. “Never.” “I loved your eyes first,” I told him, repeating his words from a few weeks ago back to him, because it was true, and because we were two halves of a whole—we had been all along, and he’d been so clever to know it right away. I used to think it was insanity, but now I was beginning to think that it was pure brilliance. “I see it, too, James. I see the other half of my soul in you.” He jerked against me suddenly, grinding me against him. He never broke eye contact as he came inside of me. He pulled my forehead to his, giving me a self-deprecating grin. “Well, that was embarrassing. I feel like a teenager. I’ll have to make it up to you.” I smiled back, far from upset about it. I loved affecting him so powerfully that he lost control like that. “I have no doubt that you will,” I said, meaning it. If we were keeping score on orgasms, I was in the lead by four to one, at least. The man always could play my body like a drum. He slid a hand between our bodies, moving his thumb in soft circles over my clit, circling his hips to move his thick length inside of me in an intoxicating grind. “Touch me,” he said roughly. I relished the chance. It seemed like more often than not only he did the touching. I ran my hands over his chest and up to his shoulders. I cupped his face in my hands before running my hungry fingers to the buttons of his shirt. I loosened it clumsily, popping a few unfortunate buttons as I went. I moaned when I got his chest bared enough to stroke that perfect golden skin. He brought me like that, with those little circles of his hips and that clever thumb, his skin under my hands. It was a gentle wave of sensations. He grabbed my hips firmly and thrust harder as I still quivered around him. Big hard thrusts turned into rough bucks. He bucked me nearly off his length before yanking me back onto him. What had started gentle turned into a deliciously rough ride as I was still recovering from the first orgasm. His eyes turned from tender between one hard thrust and the next, taking on a possessive gleam. He didn’t even have to say the words. I knew what he wanted. “I’m yours, James. Yours.” Those tarnished depths glittered at me as he made me fall over that fine edge again. He didn’t let up, pounding me until I knew I’d be deliciously sore, topping me from the bottom, controlling my body’s movements without having to utter a word. I loved that the most, that I could put myself into his control and, at least here, like this, he always knew just what I needed. He brought me again and watched my eyes as I fell apart before he let himself pour into me with that rough little moan that I loved best. He was pulling himself out of me when he froze. His eyes shot to mine, his concerned. “You’re bleeding,” he told me. I grimaced. “Ich. I’m starting my period. Sorry. I think maybe we jumpstarted it.” He laughed, looking relieved. “As long as I didn’t do it. And don’t be sorry. I don’t mind.” He pushed my hips back against the edge of his desk, pushing my dress up high. I tried to bat his hands away. He laughed again. “This is where you draw the line? I’ll never understand why some things are more taboo than others.” “And that’s what makes you so kinky, the fact that you don’t see the difference.” He just shrugged. He was at peace with the kinky part. “Lift up your leg. Let me look at you.” I batted his hands away again, cringing when I saw the blood on his suit. “I don’t even want to know the price of the suit we just destroyed.” He looked down at himself and shrugged. “I don’t give a fuck about the suit. I do give a fuck about that scandalized look on your face. You have to realize that’s just like blood in the water for me.” “Literally,” I muttered, still batting his hands away. “Get your ass on the desk,” he said with a grin. “I want to go down on you while you blush like that.” I glared at him, painfully embarrassed. Just the thought had me frozen to the spot in mortification. “I’m going down on you,” he told me in a stern voice, though the smile still playing around his mouth kind of ruined it. “On the desk or in the shower. I’ll let you pick that much.” “Shower,” I said quickly. It seemed far preferable. At least there wouldn’t be a mess in the shower. He pulled me into the bathroom, stripping us both and leaving our clothes in messy heaps on the floor. He didn’t draw it out, pushing me against the tiled wall and going to his knees in the steamy spray. He buried his face against my core, throwing my thigh over his shoulder. I gripped his hair, letting him take most of my weight as he worked his clever tongue against me. And if his tongue was clever, his fingers were brilliant. Both worked me, playing on different nerves, drawing moans out of me, and pushing me over that fine edge in swift moments. I lost all recollection of my own embarrassment under his perfect touch. He stood, driving hard into me even as he straightened. I whimpered, waves of pleasure still rocking through me deliciously. I was a little sore, but conditioned as I was, that sore only added to the pleasure. He kissed me hard, driving his tongue into my mouth as he drove his rampant cock into my core. I tasted myself on him—and him, all mixed with the taste of copper. It was different, but not unpleasant. “See,” he said, driving into me, pounding me into the wall, my thigh slung over his arm and pushed high. “You can still come when you’re bleeding. It doesn’t magically turn off your orgasm button.” I tried to give him an exasperated look, but it was hard to manage when he was fucking the sense right out of me. “I-I didn’t…mmm…think…that’s…” “Your body belongs to me, Bianca, no matter the fucking time of the month,” he growled against me. Only he could find a way to use my period as a way to show his possession. It was my last thought before he pounded them all right out of me, and I came again, gasping into his mouth. He kept thrusting, finally arching up high, pushing me up with the motion as he bottomed out hard. He grunted and shuddered against me, his hand sliding up into my hair as he let me see what his pleasure did to him through those turquoise depths. I loved every second of it. We were dried off and getting dressed before he spoke again, his back to me. “I guess I earned my red wings.” There was a smile in his voice. I blushed down to my toes. CHAPTER THIRTY-ONE Mr. Domesticated The issue of the sex tape still ran rampant through the headlines, but as far as James and I were concerned, it was old news. We had moved on. I took that as an encouraging sign. We were good together. We hashed things out and they were settled, instead of coming up again and again, like they seemed to in so many toxic relationships that I’d observed. That Friday marked our last New York layover. The crew wanted to go out, of course, but James wanted to have a late lunch with his friends Parker and Sophia. I didn’t see why we couldn’t do both. Sophia met us at the door to their luxury apartment, a wriggling child in her arms. I thought it was a boy, though his hair was kind of long, and his face was so pretty that it was hard to tell at a glance. James swung the child from her arms and up onto his shoulders without a word. “This is Elliot,” he told me with his most charming smile. “Elliot, this is Bianca. Say nice to meet you, Bianca.”","sourceLink":"https://allnovel.net/grounded-up-in-the-air-3/page-40.html","bookId":1928,"book":{"id":1928,"title":"Grounded (Up in the Air #3)","description":"Storyline: Grounded (Up in the Air #3) James and Bianca’s story draws to a close in the explosive conclusion to the Up In The Air Trilogy. After a short but earnest courtship, Bianca can no longer deny her feelings for James, and though she’s tried her hardest, she can’t help but see that he cares deeply for her, as well. In a completely uncharacteristic move, she has put aside her misgivings and agreed to live with the enigmatic billionaire. Is her leap of faith the beginning of something wonderful, or is it too much, too fast? As James and Bianca feel a growing need for each other that neither can deny, circumstances beyond their control intervene, trying to tear them apart. Amidst the ever mounting threat of a monster who wants Bianca dead, and the constant pitfalls of an indiscreet past that James can’t seem to escape, can these two passionate lovers manage to find their happily ever after?","cover":"https://allnovel.net/images/grounded-up-in-the-air-3.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/grounded-up-in-the-air-3.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:53:33 AM"}}
