{"id":64383,"no":50,"title":"Page 50","content":"“Tell Tristan I said hi,” she said. “Bianca says hello,” I told Tristan, not liking his name on her lips, but tamping my outrageous jealousy down. That jealousy would become a problem for us if I didn’t control it. I understood that. My need for us to work helped me to try to keep it to myself when I knew that it was unreasonable. “I’ll be heading over there when I finish,” I told her. “Are you about done?” It didn’t really matter to me if she was. I was impatient to see her, and I’d go and wait for her if necessary. I hoped that she wasn’t getting tired of my company, because we’d only been apart for a few hours and already I was ravenous for the sight of her. I was picturing how I would take her in that little house when she answered. “Yeah. That should be perfect.” I thought it would be perfect to fuck her one last time in that house, even if she was done packing. I would bury myself inside of her wherever I happened to find her. Maybe I would bend her over the kitchen counter, or take her on the dining room table. I shook myself. She’d put a spell on me, and I wouldn’t be free of it any time soon. Or ever, I thought with a grin. Mrs. Cavendish had such a lovely ring to it. “Tristan is coming over for dinner tonight. As if I’m not paying him enough to make rabbits disappear, now I have to make him dinner.” “I have a new trick where I can make pretty boy CEOs disappear,” Tristan told me. Bianca laughed into my ear. I loved that laugh. “Will you let the guys know that they’re invited, as well?” I asked, smiling. “That sounds fun,” she said. “I take it he got a favorable contract for next year’s shows.” “He signed on for another year,” I said, looking at Tristan with a raised brow, “but we had to double the bastard’s pay. Funny how soon he forgets just who discovered his sorry ass.” Bianca had gone very quiet on the other end. My whole body tensed, as if bracing for a blow and not knowing where that blow could come from. I absently scratched at the scars on my wrists, my most nervous tell. I thought I had trained myself out of the habit. What was wrong with me today? “Bianca?” I questioned. I would be fine if I just heard her voice again. “Hmm? Oh, sorry,” she said, the new distance in her voice just making me more agitated. “Love, is something the matter?” I asked. I stood and began to pace, unable to stand still. “You sound upset.” She didn’t respond for endless moments. I was getting desperate when her voice sounded again. “Blake!” she said, a clear thread of panic in her voice. No, I thought, my heart trying to pound out of my chest. I swung around, my gaze finding Clark. He was so good at reading me that he already had his phone out. “Police?” he asked. I nodded. It could be nothing, but I didn’t give a fuck. If it was something, the sooner they were on their way, the better. “Bianca, what is it?” I tried. “Is something wrong? Talk to me, Love.” An echoing bang on the other end of the line made my blood run cold. Bianca gasped into my ear. No, I thought, and began to move. “Stay down, Bianca,” I heard Blake say on the other end. “Don’t move, and whatever you do, don’t leave this house. I’ll be right back.” No. A mean fist gripped my heart. I could hear her breathing, but as I spoke and cajoled and pleaded with her to tell me what was going on, she refrained from speaking for long moments on the other end. I recalled that terrible afternoon just months ago, watching the ambulance take her away, my heart in pieces as I waited in agony to see if she was okay. Clark fell into step behind me without a word as I strode through the offices and to the elevator. I saw what floor it was on and took the stairs, not willing to wait, the phone still held to my ear. I took the stairs down at a sprint. “Tell me what’s going on, Bianca!” I tried again, tearing through the casino now. “What was that noise? Why did Blake tell you to stay down? Where did she go? I need to know what’s going on!” Another loud shot sounded on her end of the line, and I died a little inside just hearing it. I tried my damnedest to sound calm, but it was a struggle. “We’re on our way to you, Love, and we’ve put in a call to the police, but I need you to tell me what’s going on. What was that noise?” I was grasping at straws, I knew, hoping I had somehow heard an engine backfiring in the distance. Twice… “I love you, James,” she said very softly. It broke me, a feeling of helplessness and dread filling me. “What’s happening over there?” I asked roughly. I barely noticed that my voice broke on the words. Another gunshot sounded on her end, and she whimpered. It wrecked me. I wanted to clutch my chest and howl with the fear, but instead I ran, determined to get to her. “I love you, James,” she said again. The resignation in her voice wasn’t reassuring in the least. Clark kept pace with me, and broke ahead as we reached the doors, talking frantically to the valet manager, procuring us a car with remarkable speed. He got behind the wheel as I took the passenger’s seat. He was peeling out before I could finish buckling in. “Talk to me,” I told her desperately. “I have to know what’s going on. We’re in the car now. We’ll be there in less than twenty minutes, but you need to talk to me. What’s all that noise?” Another shot sounded and I closed my eyes in dread. “Are those gunshots?” I asked wretchedly. I had never felt so helpless and worthless in my life. “Yes,” she breathed. “In my backyard, I think. I’m scared, James. I need you to tell me that you love me back. Please. Just in case.” The starkest terror that I’d ever known gripped my chest. I wasn’t a superstitious man, but I felt suddenly as though if I told her that now, it would be the last time, and I just couldn’t do it. It was illogical, but I couldn’t make myself say the words again until I held her in my arms. “No,” I whispered, that brutal refusal making my chest ache. “I’ll be right there. Are all of your doors locked up? Just stay hidden, and stay down. You’re going to be fine, and I will be there so soon to tell you those words.” She gasped suddenly, her breathing changing, as though she was moving. Panic had me firmly in its grasp and I had to just listen futilely as two more shots sounded in the background. Two ragged sobs escaped her throat as though torn from her. No, no, no, I thought. “I love you, James,” she told me, her voice so steady now. Somehow, that terrified me more than anything else had. “So much. I’m so sorry.” I was yelling at her in a broken shout as she hung up on me. CHAPTER THIRTY-NINE Mr. Desolate JAMES I could have wished that the twenty minute drive was just a blur for me, but of course it wasn’t. It was the longest drive of my life. I died a million little deaths on that drive, my mind going to the darkest places. I even found myself cursing God, when I’d always been the most agnostic soul. Why did he hate me so much? I wondered angrily. First he took my parents, who I’d adored, and now I’d found a home and a family again, one that I coveted and worshipped with a single-minded purpose. I couldn’t bear the thought that I would lose her just when I’d found her. I rejected the thought. This couldn’t be happening. If her father had attacked her, surely the security had subdued him before he could have touched her. There was no acceptable alternative. I watched the clock on the dash for the entire drive. Clark ran red lights, weaved through traffic, and drove like his life depended on it. He made good time, and we were pulling into her neighborhood less than fifteen minutes after we’d gotten into the car. I was jumping out of the car before it had stopped, rushing to the front door. It was locked, and I cursed as I dug out my keys. Absently I noted that Clark took another route, jumping the fence into the backyard while I entered the house. It was where she’d been when I’d been talking to her, so I looked inside first. The first few rooms were empty, and I heard sirens drawing close as I scanned the kitchen. Clark was standing in front of the back door that led into the yard from the bedroom when I stepped inside. My gut clenched, nearly doubling me over. The back door had been open… I rushed forward, but Clark moved to stop me. He caught me before I reached the door. I fought him in earnest. There were no seconds to waste. “Please, James,” he said in a soft voice I barely recognized as coming out of him. “You don’t want to see what’s back there. No one should have to see that. The paramedics are here. Let’s let them in to do their jobs.” I heard a horrible whimper of a noise as though from a distance, barely noting that it had escaped from my own throat. He would only say a thing like that if there was nothing to be done, and clearly Bianca was not in the house. “Is she back there?” I asked him, my voice breaking on the words. It felt like every part of me was breaking. He nodded, and a tear ran down his cheek. “You can’t do anything for her, James, but you can save yourself the pain of seeing her like that.” Of course, I couldn’t stay away. I refused to accept what his words implied, even as I felt my own face growing wet with tears. “Let me by,” I told him, a quaver in my voice. “I have to be with her.” He bowed his head and let me pass, seeing my resolve. The sight that greeted me literally brought me to my knees. There hadn’t been a second since I’d met her that I felt as though I’d taken her for granted. I’d loved her, I’d treasured her, I’d coveted her, and adored every inch of her, but it still didn’t feel like it had been enough. I’d misstepped with her, I’d screwed up plenty, but we’d been working through it all. Life could have been perfect. All we’d needed was more time… I crawled to her, only distantly noting that hers was not the only body lying in the small backyard. She was on her back, her head turned sharply to the side, obscuring one side of her face. What was showing of her face was strangely intact, almost peaceful. Her hair was spread around her, the pale blonde strands now wet and dyed red with blood. I tried to tell myself that she might be fine, that she could survive this, but I could see clearly from where the blood pooled that it must be a head wound. Raw sounds of anguish tore out of me with every movement as I made my way to her. Lightly, carefully, as though she were made of glass, I held her hand and sobbed. I wouldn’t survive this. I didn’t want to survive this. There was nothing in the world that I wanted to live for after enduring this. For the first time in my life, I began to pray. For her life or my death, I didn’t know. I would have taken either just then. I didn’t even look up as the paramedics arrived in force. I only noticed the body that had been lying beside hers as it was shifted away. Apparently, the paramedics weren’t going to try to help that one, since it was missing a head. Its massive torso was riddled with holes, and I perceived that it had been her father. His death gave me no satisfaction. It wasn’t enough, and certainly, he hadn’t died in time to spare her.","sourceLink":"https://allnovel.net/grounded-up-in-the-air-3/page-50.html","bookId":1928,"book":{"id":1928,"title":"Grounded (Up in the Air #3)","description":"Storyline: Grounded (Up in the Air #3) James and Bianca’s story draws to a close in the explosive conclusion to the Up In The Air Trilogy. After a short but earnest courtship, Bianca can no longer deny her feelings for James, and though she’s tried her hardest, she can’t help but see that he cares deeply for her, as well. In a completely uncharacteristic move, she has put aside her misgivings and agreed to live with the enigmatic billionaire. Is her leap of faith the beginning of something wonderful, or is it too much, too fast? As James and Bianca feel a growing need for each other that neither can deny, circumstances beyond their control intervene, trying to tear them apart. Amidst the ever mounting threat of a monster who wants Bianca dead, and the constant pitfalls of an indiscreet past that James can’t seem to escape, can these two passionate lovers manage to find their happily ever after?","cover":"https://allnovel.net/images/grounded-up-in-the-air-3.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/grounded-up-in-the-air-3.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:53:33 AM"}}
