{"id":92849,"no":1,"title":"Page 1","content":"Text of a letter from Marcantonio Rosseli, apothecary in Verona, to his cousin, Pier-Ariana Salier in Venezia, delivered by private messenger ten days after it was written.\\n\\n To the daughter of my aunt Gioella, of revered memory, Marcantonio Rosseli sends his most faithful greetings, and his congratulations on your securing the patronage of the eminent foreigner, Conte Franzicco Ragoczy di Santo-Germano, and the hope that neither you nor he will have cause to regret the association.\\n\\n You tell me he has secured you a casetta near San Zaccaria, and that you have been provided virginals and a lute on which to play your songs, as well as the promise of publication of the best of them. To have so much distinction, and you only twenty-five, much younger than most patroned musicians: it is a very great honor, as I am sure you know. The terms of his patronage are most generous gifts, and I trust you will be at pains to deserve them. Few musicians ever have such good fortune as you have encountered, and as far as I am aware, none of those musicians who have achieved such success have been women. This requires your gratitude and careful performance of your talents, for to do anything less would shame your present benefits as well as deprive you of all opportunities in the future, for once known as feckless, no musician, and certainly no woman, can do other than fall in the eyes of the world.\\n\\n It may be, as you suggested, that more than music is required of you, and if that is the case, then I urge you to make a formal agreement regarding how you are to conduct yourself. If di Santo-Germano were a Venezian, it would be another matter, but since he is not, you must be prudent and see that your patronage cannot be rescinded on a whim. Conte or not, Santo-Germano-however grand it may be-is not in La Serenissima Repubblica Veneziana, and so long as that is the case, his title is more courtesy than binding responsibility. You need terms of settlement as to what he will provide you, and be sure that such monies or property that he provides is secured in such a way that his absence will not adversely impact your situation.\\n\\n For your own protection, be sure you maintain notes on di Santo-Germano\u0027s activities, in case you are ever required to appear before the Doge in regard to di Santo-Germano\u0027s affairs. You do not want any suspicions that fall upon him to fall upon you as well, and such a record would relieve you of any taint of wrong-doing. If di Santo-Germano did not own a press, it might be less important, but since il Conte is engaged in publishing, who knows what scandalous material he may decide to foist upon the world. The Maggior Consiglio takes a dim view of our own Veneziani undertaking to publish questionable material-they will be all the more stringent with a foreigner, noble or not, if he should go beyond the acceptable bounds established by the Doge.\\n\\n I am sending you a gift of lace to mark this fortunate occasion, and I will write to my father on your behalf, so that he need not send you money for as long as di Santo-Germano attends to your keep. He will be glad for you, I am sure, and for the sake of your mother, he may send to di Santo-Germano to learn more of your arrangements with him. I pray you may flourish with such a patron, and that you will gain a favorable reputation, unattended by the notoriety that so often adheres to musicians in general, and to women in particular, for that would leech away the many advantages that now lie before you.\\n\\n Your most affectionate cousin,\\n\\n Marcantonio Rosseli\\n\\n apothecary of Verona\\n\\n By my own hand at sunset, on this, the 9thday of February, 1530 Anno Domini \\n\\n","sourceLink":"https://allnovel.net/states-of-grace-saint-germain-18/page-1.html","bookId":1607,"book":{"id":1607,"title":"States of Grace (Saint-Germain #18)","description":"Storyline: States of Grace (Saint-Germain #18) \\n Franzicco Ragoczy di Santo-Germano is a successful merchant in Venice. His lavish lifestyle and rumored cache of magnificent jewels have attracted the wrong sort of attention, and without Santo-Germano\u0027s noble--and papal--connections, he might be imprisoned, his property confiscated. Also under surveillance is the vampire\u0027s mistress, the lovely and talented musician Pier-Ariana Salier. \\n Elsewhere, Ragoczy\u0027s publishing business is being investigated by the Inquisition. Erneste van Amsteljaxter, a writer whose intelligence Ragoczy finds attractive, is tarred with the brush of heresy. Ragoczy is trying to help her, when he learns that Pier-Ariana has disappeared. \\n Back in Venice Santo-Germano finds that his fortune has been embezzled, and that he is accused of kidnapping, and possibly murdering, a young man who had been spying on the vampire and his mistress. Another spy has discovered Santo-Germano\u0027s true nature and intends to kill him before he can feast on all of Venice!\\n","cover":"https://allnovel.net/images/states-of-grace-saint-germain-18.jpg","author":"Chelsea Quinn Yarbro","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/states-of-grace-saint-germain-18.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:58:06 PM"}}
