{"id":31103,"no":23,"title":"XXIII. AN UNACCOUNTABLE CABIN-PASSENGER","content":"AN UNACCOUNTABLE CABIN-PASSENGER, AND A MYSTERIOUS YOUNG LADY As yet, I have said nothing special about the passengers we carried out. But before making what little mention I shall of them, you must know that the Highlander was not a Liverpool liner, or packet-ship, plying in connection with a sisterhood of packets, at stated intervals, between the two ports. No: she was only what is called a regular trader to Liverpool; sailing upon no fixed days, and acting very much as she pleased, being bound by no obligations of any kind: though in all her voyages, ever having New York or Liverpool for her destination. Merchant vessels which are neither liners nor regular traders, among sailors come under the general head of transient ships; which implies that they are here to-day, and somewhere else to-morrow, like Mullins\u0027s dog. But I had no reason to regret that the Highlander was not a liner; for aboard of those liners, from all I could gather from those who had sailed in them, the crew have terrible hard work, owing to their carrying such a press of sail, in order to make as rapid passages as possible, and sustain the ship\u0027s reputation for speed. Hence it is, that although they are the very best of sea-going craft, and built in the best possible manner, and with the very best materials, yet, a few years of scudding before the wind, as they do, seriously impairs their constitutions— like robust young men, who live too fast in their teens—and they are soon sold out for a song; generally to the people of Nantucket, New Bedford, and Sag Harbor, who repair and fit them out for the whaling business. Thus, the ship that once carried over gay parties of ladies and gentlemen, as tourists, to Liverpool or London, now carries a crew of harpooners round Cape Horn into the Pacific. And the mahogany and bird\u0027s-eye maple cabin, which once held rosewood card-tables and brilliant coffee-urns, and in which many a bottle of champagne, and many a bright eye sparkled, now accommodates a bluff Quaker captain from Martha\u0027s Vineyard; who, perhaps, while lying with his ship in the Bay of Islands, in New Zealand, entertains a party of naked chiefs and savages at dinner, in place of the packet-captain doing the honors to the literati, theatrical stars, foreign princes, and gentlemen of leisure and fortune, who generally talked gossip, politics, and nonsense across the table, in transatlantic trips. The broad quarter-deck, too, where these gentry promenaded, is now often choked up by the enormous head of the sperm-whale, and vast masses of unctuous blubber; and every where reeks with oil during the prosecution of the fishery. Sic transit gloria mundi! Thus departs the pride and glory of packet-ships! It is like a broken down importer of French silks embarking in the soap-boning business. So, not being a liner, the Highlander of course did not have very ample accommodations for cabin passengers. I believe there were not more than five or six state-rooms, with two or three berths in each. At any rate, on this particular voyage she only carried out one regular cabin-passenger; that is, a person previously unacquainted with the captain, who paid his fare down, and came on board soberly, and in a business-like manner with his baggage. He was an extremely little man, that solitary cabin-passenger—the passenger who came on board in a business-like manner with his baggage; never spoke to any one, and the captain seldom spoke to him. Perhaps he was a deputy from the Deaf and Dumb Institution in New York, going over to London to address the public in pantomime at Exeter Hall concerning the signs of the times. He was always in a brown study; sometimes sitting on the quarter-deck with arms folded, and head hanging upon his chest. Then he would rise, and gaze out to windward, as if he had suddenly discovered a friend. But looking disappointed, would retire slowly into his state-room, where you could see him through the little window, in an irregular sitting position, with the back part of him inserted into his berth, and his head, arms, and legs hanging out, buried in profound meditation, with his fore-finger aside of his nose. He never was seen reading; never took a hand at cards; never smoked; never drank wine; never conversed; and never staid to the dessert at dinner-time. He seemed the true microcosm, or little world to himself: standing in no need of levying contributions upon the surrounding universe. Conjecture was lost in speculating as to who he was, and what was his business. The sailors, who are always curious with regard to such matters, and criticise cabin-passengers more than cabin-passengers are perhaps aware at the time, completely exhausted themselves in suppositions, some of which are characteristically curious. One of the crew said he was a mysterious bearer of secret dispatches to the English court; others opined that he was a traveling surgeon and bonesetter, but for what reason they thought so, I never could learn; and others declared that he must either be an unprincipled bigamist, flying from his last wife and several small children; or a scoundrelly forger, bank-robber, or general burglar, who was returning to his beloved country with his ill-gotten booty. One observing sailor was of opinion that he was an English murderer, overwhelmed with speechless remorse, and returning home to make a full confession and be hanged. But it was a little singular, that among all their sage and sometimes confident opinings, not one charitable one was made; no! they were all sadly to the prejudice of his moral and religious character. But this is the way all the world over. Miserable man! could you have had an inkling of what they thought of you, I know not what you would have done. However, not knowing any thing about these surmisings and suspicions, this mysterious cabin-passenger went on his way, calm, cool, and collected; never troubled any body, and nobody troubled him. Sometimes, of a moonlight night he glided about the deck, like the ghost of a hospital attendant; flitting from mast to mast; now hovering round the skylight, now vibrating in the vicinity of the binnacle. Blunt, the Dream Book tar, swore he was a magician; and took an extra dose of salts, by way of precaution against his spells. When we were but a few days from port, a comical adventure befell this cabin-passenger. There is an old custom, still in vogue among some merchant sailors, of tying fast in the rigging any lubberly landsman of a passenger who may be detected taking excursions aloft, however moderate the flight of the awkward fowl. This is called \"making a spread eagle\" of the man; and before he is liberated, a promise is exacted, that before arriving in port, he shall furnish the ship\u0027s company with money enough for a treat all round. Now this being one of the perquisites of sailors, they are always on the keen look-out for an opportunity of levying such contributions upon incautious strangers; though they never attempt it in presence of the captain; as for the mates, they purposely avert their eyes, and are earnestly engaged about something else, whenever they get an inkling of this proceeding going on. But, with only one poor fellow of a cabin-passenger on board of the Highlander, and he such a quiet, unobtrusive, unadventurous wight, there seemed little chance for levying contributions. One remarkably pleasant morning, however, what should be seen, half way up the mizzen rigging, but the figure of our cabin-passenger, holding on with might and main by all four limbs, and with his head fearfully turned round, gazing off to the horizon. He looked as if he had the nightmare; and in some sudden and unaccountable fit of insanity, he must have been impelled to the taking up of that perilous position. \"Good heavens!\" said the mate, who was a bit of a wag, \"you will surely fall, sir! Steward, spread a mattress on deck, under the gentleman!\" But no sooner was our Greenland sailor\u0027s attention called to the sight, than snatching up some rope-yarn, he ran softly up behind the passenger, and without speaking a word, began binding him hand and foot. The stranger was more dumb than ever with amazement; at last violently remonstrated; but in vain; for as his fearfulness of falling made him keep his hands glued to the ropes, and so prevented him from any effectual resistance, he was soon made a handsome spread-eagle of, to the great satisfaction of the crew. It was now discovered for the first, that this singular passenger stammered and stuttered very badly, which, perhaps, was the cause of his reservedness. \"Wha-wha-what i-i-is this f-f-for?\" \"Spread-eagle, sir,\" said the Greenlander, thinking that those few words would at once make the matter plain. \"Wha-wha-what that me-me-mean?\" \"Treats all round, sir,\" said the Greenlander, wondering at the other\u0027s obtusity, who, however, had never so much as heard of the thing before. At last, upon his reluctant acquiescence in the demands of the sailor, and handing him two half-crown pieces, the unfortunate passenger was suffered to descend. The last I ever saw of this man was his getting into a cab at Prince\u0027s Dock Gates in Liverpool, and driving off alone to parts unknown. He had nothing but a valise with him, and an umbrella; but his pockets looked stuffed out; perhaps he used them for carpet-bags. I must now give some account of another and still more mysterious, though very different, sort of an occupant of the cabin, of whom I have previously hinted. What say you to a charming young girl?—just the girl to sing the Dashing White Sergeant; a martial, military-looking girl; her father must have been a general. Her hair was auburn; her eyes were blue; her cheeks were white and red; and Captain Riga was her most devoted. To the curious questions of the sailors concerning who she was, the steward used to answer, that she was the daughter of one of the Liverpool dock-masters, who, for the benefit of her health and the improvement of her mind, had sent her out to America in the Highlander, under the captain\u0027s charge, who was his particular friend; and that now the young lady was returning home from her tour. And truly the captain proved an attentive father to her, and often promenaded with her hanging on his arm, past the forlorn bearer of secret dispatches, who would look up now and then out of his reveries, and cast a furtive glance of wonder, as if he thought the captain was audacious. Considering his beautiful ward, I thought the captain behaved ungallantly, to say the least, in availing himself of the opportunity of her charming society, to wear out his remaining old clothes; for no gentleman ever pretends to save his best coat when a lady is in the case; indeed, he generally thirsts for a chance to abase it, by converting it into a pontoon over a puddle, like Sir Walter Raleigh, that the ladies may not soil the soles of their dainty slippers. But this Captain Riga was no Raleigh, and hardly any sort of a true gentleman whatever, as I have formerly declared. Yet, perhaps, he might have worn his old clothes in this instance, for the express purpose of proving, by his disdain for the toilet, that he was nothing but the young lady\u0027s guardian; for many guardians do not care one fig how shabby they look. But for all this, the passage out was one long paternal sort of a shabby flirtation between this hoydenish nymph and the ill-dressed captain. And surely, if her good mother, were she living, could have seen this young lady, she would have given her an endless lecture for her conduct, and a copy of Mrs. Ellis\u0027s Daughters of England to read and digest. I shall say no more of this anonymous nymph; only, that when we arrived at Liverpool, she issued from her cabin in a richly embroidered silk dress, and lace hat and veil, and a sort of Chinese umbrella or parasol, which one of the sailors declared \"spandangalous;\" and the captain followed after in his best broadcloth and beaver, with a gold-headed cane; and away they went in a carriage, and that was the last of her; I hope she is well and happy now; but I have some misgivings. It now remains to speak of the steerage passengers. There were not more than twenty or thirty of them, mostly mechanics, returning home, after a prosperous stay in America, to escort their wives and families back. These were the only occupants of the steerage that I ever knew of; till early one morning, in the gray dawn, when we made Cape Clear, the south point of Ireland, the apparition of a tall Irishman, in a shabby shirt of bed-ticking, emerged from the fore hatchway, and stood leaning on the rail, looking landward with a fixed, reminiscent expression, and diligently scratching its back with both hands. We all started at the sight, for no one had ever seen the apparition before; and when we remembered that it must have been burrowing all the passage down in its bunk, the only probable reason of its so manipulating its back became shockingly obvious. I had almost forgotten another passenger of ours, a little boy not four feet high, an English lad, who, when we were about forty-eight hours from New York, suddenly appeared on deck, asking for something to eat. It seems he was the son of a carpenter, a widower, with this only child, who had gone out to America in the Highlander some six months previous, where he fell to drinking, and soon died, leaving the boy a friendless orphan in a foreign land. For several weeks the boy wandered about the wharves, picking up a precarious livelihood by sucking molasses out of the casks discharged from West India ships, and occasionally regaling himself upon stray oranges and lemons found floating in the docks. He passed his nights sometimes in a stall in the markets, sometimes in an empty hogshead on the piers, sometimes in a doorway, and once in the watchhouse, from which he escaped the next morning, running as he told me, right between the doorkeeper\u0027s legs, when he was taking another vagrant to task for repeatedly throwing himself upon the public charities. At last, while straying along the docks, he chanced to catch sight of the Highlander, and immediately recognized her as the very ship which brought him and his father out from England. He at once resolved to return in her; and, accosting the captain, stated his case, and begged a passage. The captain refused to give it; but, nothing daunted, the heroic little fellow resolved to conceal himself on board previous to the ship\u0027s sailing; which he did, stowing himself away in the between-decks; and moreover, as he told us, in a narrow space between two large casks of water, from which he now and then thrust out his head for air. And once a steerage passenger rose in the night and poked in and rattled about a stick where he was, thinking him an uncommon large rat, who was after stealing a passage across the Atlantic. There are plenty of passengers of that kind continually plying between Liverpool and New York. As soon as he divulged the fact of his being on board, which he took care should not happen till he thought the ship must be out of sight of land; the captain had him called aft, and after giving him a thorough shaking, and threatening to toss him overboard as a tit-bit for John Shark, he told the mate to send him forward among the sailors, and let him live there. The sailors received him with open arms; but before caressing him much, they gave him a thorough washing in the lee-scuppers, when he turned out to be quite a handsome lad, though thin and pale with the hardships he had suffered. However, by good nursing and plenty to eat, he soon improved and grew fat; and before many days was as fine a looking little fellow, as you might pick out of Queen Victoria\u0027s nursery. The sailors took the warmest interest in him. One made him a little hat with a long ribbon; another a little jacket; a third a comical little pair of man-of-war\u0027s-man\u0027s trowsers; so that in the end, he looked like a juvenile boatswain\u0027s mate. Then the cook furnished him with a little tin pot and pan; and the steward made him a present of a pewter tea-spoon; and a steerage passenger gave him a jack knife. And thus provided, he used to sit at meal times half way up on the forecastle ladder, making a great racket with his pot and pan, and merry as a cricket. He was an uncommonly fine, cheerful, clever, arch little fellow, only six years old, and it was a thousand pities that he should be abandoned, as he was. Who can say, whether he is fated to be a convict in New South Wales, or a member of Parliament for Liverpool? When we got to that port, by the way, a purse was made up for him; the captain, officers, and the mysterious cabin passenger contributing their best wishes, and the sailors and poor steerage passengers something like fifteen dollars in cash and tobacco. But I had almost forgot to add that the daughter of the dock-master gave him a fine lace pocket-handkerchief and a card-case to remember her by; very valuable, but somewhat inappropriate presents. Thus supplied, the little hero went ashore by himself; and I lost sight of him in the vast crowds thronging the docks of Liverpool. I must here mention, as some relief to the impression which Jackson\u0027s character must have made upon the reader, that in several ways he at first befriended this boy; but the boy always shrunk from him; till, at last, stung by his conduct, Jackson spoke to him no more; and seemed to hate him, harmless as he was, along with all the rest of the world. As for the Lancashire lad, he was a stupid sort of fellow, as I have before hinted. So, little interest was taken in him, that he was permitted to go ashore at last, without a good-by from any person but one.","sourceLink":"http://novel.tingroom.com/duanpian/2832/78278.html","bookId":1239,"book":{"id":1239,"title":"Redburn. His First Voyage","description":"简介： Wellingborough, as you are going to sea, suppose you take this shooting-jacket of mine along; it\u0027s just the thingtake it, it will save the expense of another. You see, it\u0027s quite warm; fine long skirts, stout horn buttons, and plenty of pockets.Out o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2832","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
