{"id":31115,"no":35,"title":"XXXV. GALLIOTS, COAST-OF-GUINEA-MAN, AND FLOATING CHAPEL","content":"Another very curious craft often seen in the Liverpool docks, is the Dutch galliot, an old-fashioned looking gentleman, with hollow waist, high prow and stern, and which, seen lying among crowds of tight Yankee traders, and pert French brigantines, always reminded me of a cocked hat among modish beavers. The construction of the galliot has not altered for centuries; and the northern European nations, Danes and Dutch, still sail the salt seas in this flat-bottomed salt-cellar of a ship; although, in addition to these, they have vessels of a more modern kind. They seldom paint the galliot; but scrape and varnish all its planks and spars, so that all over it resembles the \"bright side\" or polished streak, usually banding round an American ship. Some of them are kept scrupulously neat and clean, and remind one of a well-scrubbed wooden platter, or an old oak table, upon which much wax and elbow vigor has been expended. Before the wind, they sail well; but on a bowline, owing to their broad hulls and flat bottoms, they make leeway at a sad rate. Every day, some strange vessel entered Prince\u0027s Dock; and hardly would I gaze my fill at some outlandish craft from Surat or the Levant, ere a still more outlandish one would absorb my attention. Among others, I remember, was a little brig from the Coast of Guinea. In appearance, she was the ideal of a slaver; low, black, clipper-built about the bows, and her decks in a state of most piratical disorder. She carried a long, rusty gun, on a swivel, amid-ships; and that gun was a curiosity in itself. It must have been some old veteran, condemned by the government, and sold for any thing it would fetch. It was an antique, covered with half-effaced inscriptions, crowns, anchors, eagles; and it had two handles near the trunnions, like those of a tureen. The knob on the breach was fashioned into a dolphin\u0027s head; and by a comical conceit, the touch-hole formed the orifice of a human ear; and a stout tympanum it must have had, to have withstood the concussions it had heard. The brig, heavily loaded, lay between two large ships in ballast; so that its deck was at least twenty feet below those of its neighbors. Thus shut in, its hatchways looked like the entrance to deep vaults or mines; especially as her men were wheeling out of her hold some kind of ore, which might have been gold ore, so scrupulous were they in evening the bushel measures, in which they transferred it to the quay; and so particular was the captain, a dark-skinned whiskerando, in a Maltese cap and tassel, in standing over the sailors, with his pencil and memorandum-book in hand. The crew were a buccaneering looking set; with hairy chests, purple shirts, and arms wildly tattooed. The mate had a wooden leg, and hobbled about with a crooked cane like a spiral staircase. There was a deal of swearing on board of this craft, which was rendered the more reprehensible when she came to moor alongside the Floating Chapel. This was the hull of an old sloop-of-war, which had been converted into a mariner\u0027s church. A house had been built upon it, and a steeple took the place of a mast. There was a little balcony near the base of the steeple, some twenty feet from the water; where, on week-days, I used to see an old pensioner of a tar, sitting on a camp-stool, reading his Bible. On Sundays he hoisted the Bethel flag, and like the muezzin or cryer of prayers on the top of a Turkish mosque, would call the strolling sailors to their devotions; not officially, but on his own account; conjuring them not to make fools of themselves, but muster round the pulpit, as they did about the capstan on a man-of-war. This old worthy was the sexton. I attended the chapel several times, and found there a very orderly but small congregation. The first time I went, the chaplain was discoursing on future punishments, and making allusions to the Tartarean Lake; which, coupled with the pitchy smell of the old hull, summoned up the most forcible image of the thing which I ever experienced. The floating chapels which are to be found in some of the docks, form one of the means which have been tried to induce the seamen visiting Liverpool to turn their thoughts toward serious things. But as very few of them ever think of entering these chapels, though they might pass them twenty times in the day, some of the clergy, of a Sunday, address them in the open air, from the corners of the quays, or wherever they can procure an audience. Whenever, in my Sunday strolls, I caught sight of one of these congregations, I always made a point of joining it; and would find myself surrounded by a motley crowd of seamen from all quarters of the globe, and women, and lumpers, and dock laborers of all sorts. Frequently the clergyman would be standing upon an old cask, arrayed in full canonicals, as a divine of the Church of England. Never have I heard religious discourses better adapted to an audience of men, who, like sailors, are chiefly, if not only, to be moved by the plainest of precepts, and demonstrations of the misery of sin, as conclusive and undeniable as those of Euclid. No mere rhetoric avails with such men; fine periods are vanity. You can not touch them with tropes. They need to be pressed home by plain facts. And such was generally the mode in which they were addressed by the clergy in question: who, taking familiar themes for their discourses, which were leveled right at the wants of their auditors, always succeeded in fastening their attention. In particular, the two great vices to which sailors are most addicted, and which they practice to the ruin of both body and soul; these things, were the most enlarged upon. And several times on the docks, I have seen a robed clergyman addressing a large audience of women collected from the notorious lanes and alleys in the neighborhood. Is not this as it ought to be? since the true calling of the reverend clergy is like their divine Master\u0027s;—not to bring the righteous, but sinners to repentance. Did some of them leave the converted and comfortable congregations, before whom they have ministered year after year; and plunge at once, like St. Paul, into the infected centers and hearts of vice: then indeed, would they find a strong enemy to cope with; and a victory gained over him, would entitle them to a conqueror\u0027s wreath. Better to save one sinner from an obvious vice that is destroying him, than to indoctrinate ten thousand saints. And as from every corner, in Catholic towns, the shrines of Holy Mary and the Child Jesus perpetually remind the commonest wayfarer of his heaven; even so should Protestant pulpits be founded in the market-places, and at street corners, where the men of God might be heard by all of His children. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2832/78290.html","bookId":1239,"book":{"id":1239,"title":"Redburn. His First Voyage","description":"简介： Wellingborough, as you are going to sea, suppose you take this shooting-jacket of mine along; it\u0027s just the thingtake it, it will save the expense of another. You see, it\u0027s quite warm; fine long skirts, stout horn buttons, and plenty of pockets.Out o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2832","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
