{"id":21818,"no":13,"title":"CHAPTER 13","content":"Shortly after the sailing of the great fleet the Private Secretary engaged in a speculation which was rather more successful than any one contained in his pamphlet on ‘The Present State of the Western Republics.’ One morning, as he and Popanilla were walking on a quay, and deliberating on the clauses of the projected commercial treaty between Vraibleusia and Fantaisie, the Secretary suddenly stopped, as if he had seen his father’s ghost or lost the thread of his argument, and asked Popanilla, with an air of suppressed agitation, whether he observed anything in the distance. Popanilla, who, like all savages, was long-sighted, applying to his eye the glass which, in conformity to the custom of the country, he always wore round his neck, confessed that he saw nothing. The Secretary, who had never unfixed his glass nor moved a step since he asked the question, at length, by pointing with his finger, attracted Popanilla’s attention to what his Excellency conceived to be a porpoise bobbing up and down in the waves. The Secretary, however, was not of the same opinion as the Ambassador. He was not very communicative, indeed, as to his own opinion upon this grave subject, but he talked of making farther observations when the tide went down; and was so listless, abstracted, and absent, during the rest of their conversation, that it soon ceased, and they speedily parted. The next day, when Popanilla read the morning papers, a feat which he regularly performed, for spelling the newspaper was quite delicious to one who had so recently learned to read, he found that they spoke of nothing but of the discovery of a new island, information of which had been received by the Government only the preceding night. The Fantaisian Ambassador turned quite pale, and for the first time in his life experienced the passion of jealousy, the green-eyed monster, so called from only being experienced by green-horns. Already the prominent state he represented seemed to retire to the background. He did not doubt that the Vraibleusians were the most capricious as well as the most commercial nation in the world. His reign was evidently over. The new island would send forth a Prince still more popular. His allowance of pink shells would be gradually reduced, and finally withdrawn. His doubts, also, as to the success of the recent expedition to Fantaisie began to revive. His rising reminiscences of his native land, which, with the joint assistance of popularity and philosophy, he had hitherto succeeded in stifling, were indeed awkward. He could not conceive his mistress with a page and a poodle. He feared much that the cargo was not well assorted. Popanilla determined to inquire after his canoe. His courage, however, was greatly reassured when, on reading the second edition, he learned that the new island was not of considerable size, though most eligibly situate; and, moreover, that it was perfectly void of inhabitants. When the third edition was published he found, to his surprise, that the Private Secretary was the discoverer of this opposition island. This puzzled the Plenipotentiary greatly. He read on; he found that this acquisition, upon which all Vraibleusia was congratulated in such glowing terms by all its journals, actually produced nothing. His Excellency began to breathe; another paragraph, and he found that the rival island was, a rock! He remembered the porpoise of yesterday. The island certainly could not be very large, even at low water. Popanilla once more felt like a Prince: he defied all the discoverers that could ever exist. He thought of the great resources of the great country he represented with proud satisfaction. He waited with easy, confidence the return of the fleet which had carried out the most judicious assortment with which he had ever been acquainted to the readiest market of which he had any knowledge. He had no doubt his mistress would look most charmingly in a barege. Popanilla determined to present his canoe to the National Museum. Although his Excellency had been in the highest state of astonishment daring his whole mission to Vraibleusia, it must be confessed, now that he understood his companion’s question of yesterday, he particularly stared. His wonder was not decreased in the evening, when the ‘Government Gazette’ appeared. It contained an order for the immediate fortification of the new island by the most skilful engineers, without estimates. A strong garrison was instantly embarked. A Governor, and a Deputy-Governor, and Storekeepers, more plentiful than stores, were to accompany them. The Private Secretary went out as President of Council. A Bishop was promised; and a complete Court of Judicature, Chancery, King’s Bench, Common Pleas, and Exchequer, were to be off the next week. It is only due to the characters of courtiers, who are so often reproached with ingratitude to their patrons, to record that the Private Secretary, in the most delicate manner, placed at the disposal of his former employer, the Marquess Moustache, the important office of Agent for the Indemnity Claims of the original Inhabitants of the Island; the post being a sinecure, the income being considerable, and local attendance being unnecessary, the noble Lord, in a manner equally delicate, appointed himself. ‘Upon what system,’ one day inquired that unwearied political student, the Fantaisian Ambassador, of his old friend Skindeep, ‘does your Government surround a small rock in the middle of the sea with fortifications, and cram it full of clerks, soldiers, lawyers, and priests?’ ‘Why, really, your Excellency, I am the last man in the world to answer questions; but I believe we call it THE COLONIAL SYSTEM!’ Before the President, and Governor, and Deputy-Governor, and Storekeepers had embarked, the Vraibleusian journals, who thought that the public had been satiated with congratulations on the Colonial System, detected that the present colony was a job. Their reasoning was so convincing, and their denunciations so impressive, that the Managers got frightened, and cut off one of the Deputy-Storekeepers. The President of Council now got more frightened than the Managers. He was one of those men who think that the world can be saved by writing a pamphlet. A pamphlet accordingly appeared upon the subject of the new colony. The writer showed that the debateable land was the most valuable acquisition ever attained by a nation famous for their acquisitions; that there was a spring of water in the middle of the rock of a remarkable freshness, and which was never dry except during the summer and the earlier winter months; that all our outward-bound ships would experience infinite benefit from this fresh water; that the scurvy would therefore disappear from the service; and that the naval victories which the Vraibleusians would gain in future wars would consequently be occasioned by the present colony. No one could mistake the felicitous reasoning of the author of ‘The Present State of the Western Republics!’ About this time Popanilla fell ill. He lost his appetite and his spirits, and his digestion was sadly disordered. His friends endeavoured to console him by telling him that dyspepsia was the national disease of Vraibleusia; that its connection with civil and religious liberty was indissoluble; that every man, woman, and child above fifteen in the island was a martyr to it; that it was occasioned by their rapid mode of despatching their meals, which again was occasioned by the little time which the most active nation in the world could afford to bestow upon such a losing business as eating. All this was no consolation to a man who had lost his appetite; and so Popanilla sent for a gentleman who, he was told, was the most eminent physician in the island. The most eminent physician, when he arrived, would not listen to a single syllable that his patient wished to address to him. He told Popanilla that his disorder was ‘decidedly liver;’ that it was occasioned by his eating his meat before his bread instead of after it, and drinking at the end of the first course instead of the beginning of the second; that he had only to correct these ruinous habits, and that he would then regain his tone. Popanilla observed the instructions of the eminent physician to the very letter. He invariably eat his bread before his meat, and watched the placing of the first dish of the second course upon the table ere he ventured to refresh himself with any liquid. At the end of a week he was infinitely worse. He now called in a gentleman who was recommended to him as the most celebrated practitioner in all Vraibleusia. The most celebrated practitioner listened with great attention to every particular that his patient had to state, but never condescended to open his own mouth. Popanilla was delighted, and revenged himself for the irritability of the eminent physician. After two more visits, the most celebrated practitioner told Popanilla that his disorder was ‘unquestionably nervous;’ that he had over-excited himself by talking too much; that in future he must count five between each word he uttered, never ask any questions, and avoid society; that is, never stay at an evening party on any consideration later than twenty-two minutes past two, and never be induced by any persuasion to dine out more than once on the same day. The most celebrated practitioner added that he had only to observe these regulations, and that he would speedily recover his energy. Popanilla never asked a question for a whole week, and Skindeep never knew him more delightful. He not only counted five, but ten, between every word he uttered; and determining that his cure should not be delayed, whenever he had nobody to speak to he continued counting. In a few days this solitary computation brought on a slow fever. He now determined to have a consultation between the most eminent physician and the most celebrated practitioner. It was delightful to witness the meeting of these great men. Not a shade of jealousy dimmed the sunshine of their countenances. After a consultation, they agreed that Popanilla’s disorder was neither ‘liver,’ nor ‘nervous,’ but ‘mind:’ that he had done too much; that he had overworked his brain; that he must take more exercise; that he must breathe more air; that he must have relaxation; that he must have a change of scene. ‘Where shall I go?’ was the first question which Popanilla had sent forth for a fortnight, and it was addressed to Skindeep. ‘Really, your Excellency, I am the last man in the world to answer questions; but the place which is generally frequented by us when we are suffering from your complaint is Blunderland.’ ‘Well, then, to Blunderland let us go!’ Shortly before Popanilla’s illness he had been elected a member of the Vraibleusian Horticultural Society, and one evening he had endeavoured to amuse himself by reading the following CHAPTER ON FRUIT.","sourceLink":"http://novel.tingroom.com/duanpian/2869/79292.html","bookId":1179,"book":{"id":1179,"title":"The Voyage of Captain Popanilla","description":"简介： There is an island in the Indian Ocean, so unfortunate as not yet to have been visited either by Discovery Ships or Missionary Societies. It is a place where all those things are constantly found which men most desire to see, and with the sight of wh...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2869","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
