{"id":69856,"no":29,"title":"Page 29","content":"“San Francisco?”\\n\\n “Near there.”\\n\\n “What a pretty place.” She sighs, and then, “I guess.”\\n\\n “Where are you going?”\\n\\n “To Portland.”\\n\\n “Is that where this train is going?” I ask.\\n\\n “I hope so,” she says.\\n\\n “Are you from L.A.?” I ask, buzzed from Valium, Tanqueray.\\n\\n “Reseda.”\\n\\n “That’s nice,” I murmur, leafing through the magazine, tranquil, having no real idea where exactly Reseda is, only a partial understanding. My eyes skim pages of advertisements that show me the best way to live. “That’s so nice.” I slowly hand the magazine to the woman, who takes it from me in the same spirit in which it is offered even though it looks as if she doesn’t want to.\\n\\n 6\\n\\n WATER FROM THE SUN\\n\\n Danny is on my bed and depressed because Ricky was picked up by a break-dancer at the Odyssey on the night of the Duran Duran look-alike contest and murdered. It seems that Biff, Ricky’s current lover, called Danny after getting my number from someone at the station and told him the news. I walk in and all Danny says is “Ricky’s dead. Throat slit. All of his blood drained from his body. Biff called.” Danny doesn’t move or explain the tone in which Biff relayed this news and he doesn’t take off the Wayfarer sunglasses he’s wearing even though he’s inside and it’s almost eight. He just lies there watching some religious show on cable and I don’t know what to say. I’m just relieved that he’s still here, that he hasn’t left.\\n\\n Now, in the bathroom, unbuttoning my blouse, unzipping my skirt, I call out, “Did you tape the newscast?”\\n\\n “No,” Danny says.\\n\\n “Why not?” I ask, pausing before putting on a robe.\\n\\n “Wanted to tape ‘The Jetsons,’ ” he says dully.\\n\\n I don’t say anything coming out of the bathroom. I walk over to the bed. Danny is wearing a pair of khaki shorts and a FOOTLOOSE T-shirt he got the night of the premiere party at the studio his father is executive in charge of production at. I look down at him, see my reflection, distorted, warped, in the lenses of the sunglasses, and then, carrying my blouse and skirt, walk into the closet and toss them into a hamper. I close the closet door, stand over the bed.\\n\\n “Move over,” I tell him.\\n\\n He doesn’t move over, just lies there. “Ricky’s dead. All of his blood drained out of him. He looked black. Biff called,” he says again, coldly’\\n\\n “And I thought I told you to keep the phone off the hook or unplug it or something,” I say, sitting down anyway. “I thought I told you that I’ll take all my calls at the station.”\\n\\n “Ricky’s dead,” Danny mutters.\\n\\n “Someone snapped off my windshield wipers today, for some reason,” I say after a while, taking the control box from him and changing the channel. “They left a note. It said ‘Mi hermana.”’\\n\\n “Biff,” he sighs, and then, “What did you do? Rip off a Taco Bell?”\\n\\n “Biff snapped off my windshield wipers?”\\n\\n Nothing.\\n\\n “Why didn’t you tape the newscast tonight?” I ask softly, trying not to press too hard.\\n\\n “Because Ricky’s dead.”\\n\\n “But you taped ‘The Jeffersons,’” I say accusingly, trying not to lose patience. I turn the channel to MTV, a lame attempt to please him. Unfortunately, a Duran Duran video is on.\\n\\n ” ‘The Jetsons,’ ” he says. “Not ‘The Jeffersons.’ I taped ‘The Jetsons.’ Turn that off.”\\n\\n “But you always tape the newscasts,” I’m whining, trying not to. “You know I like to watch them.” Pause. “I thought you’ve seen all ‘The Jetsons.’ “\\n\\n Danny doesn’t say anything, just recrosses long, sculpted legs.\\n\\n “And what was the phone doing on the hook?” I ask, trying to sound amused.\\n\\n He gets up from the bed so suddenly that it startles me. He walks over to the glass doors that open onto the balcony and looks out over the canyons. It’s light outside and warm and beyond Danny it’s still possible to see heat rising up off the hills and then I’m saying “Just don’t leave” and he says “I don’t even know what I’m doing here” and I ask, almost dutifully, “Why are you here?” and he says “Because my father kicked me out of the house” and I ask “Why?” and Danny says “Because my father asked me ‘Why don’t you get a job?’ and I said ‘Why don’t you suck my dick?”’ He pauses and, having read about Edward, I wonder if he actually did, but then Danny says, “I’m sick of having this conversation. We’ve had it too many times.” \\n\\n","sourceLink":"https://allnovel.net/the-informers/page-29.html","bookId":2685,"book":{"id":2685,"title":"The Informers","description":"Storyline: Set in Los Angeles, in the recent past. The birthplace and graveyard of American myths and dreams, the city harbours a group of people trapped between the beauty of their surroundings and their own moral impoverishment. This novel is a chronicle of their voices.\\n","cover":"https://allnovel.net/images/the-informers.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-informers.html","creation":"Oct 5, 2019 8:59:07 AM","modification":"Oct 5, 2019 10:13:49 AM"}}
