{"id":69865,"no":38,"title":"Page 38","content":"In the dream I’m sitting in the restaurant on top of the hotel near a wall of windows and staring out over the blanket of neon lights that pass for a city. I’m drinking a Kamikaze and sitting across from me is the young Oriental girl from Hustler but her smooth brown face is covered with geisha makeup and the geisha makeup and the tight, fluorescent-pink dress and the expression creasing her flat, soft features and the gaze in the blank dark eyes are predatory, making me uneasy, and suddenly the entire blanket of lights flickers, fades, sirens are wailing and people I never noticed are running out of the restaurant, screams, shouts from the black city below, and huge arcs of flame, orange and yellow highlighted against a black sky, shoot up from points on the ground and I’m still staring at the geisha girl, the arcs of flame reflected in her black eyes, and she’s mumbling something to me and there’s no fear in those large and slanted wet eyes because she’s smiling warmly now, saying the same word again and again and again but the sirens and screams and various explosions drown the word out and when I’m shouting, panicked, asking her what she’s saying, she just smiles, blinking, and takes out a paper fan and her mouth keeps moving, forming the same word, and I’m leaning toward her to hear the word but a huge claw bursts through the window, showering us with glass, and it grabs me and the claw is warm, pulsing with anger and covered with a slime that drenches the suit I’m wearing and the claw pulls me out the window and I twist toward the girl, who says the word again, this time clearly. “Godzilla … Godzilla, you idiot … I said Godzilla …” Screaming silently, I’m lifted toward its mouth, eighty, ninety stories up, looking through what’s left of the smashed wall of glass, a cold black wind whipping furiously around me, and the Oriental girl with the pink dress on is now standing on the table, smiling and waving her fan at me, crying out “Sayonara” but it doesn’t mean goodbye. Sometime later, after I climb nude and sobbing from the bathtub, after Roger calls on one of the extensions and tells me that my father has called seven times in the last two hours (something about an emergency), after I tell Roger to tell my father that I’m asleep or out or anything or in another country, after I smash three champagne bottles against one of the walls in the suite, I’m finally able to sit in a chair I’ve moved over to a window and look out over Tokyo. I’m holding a guitar, trying to write a song, because for the past week a number of chord progressions have been repeating themselves in my head but I’m having a hard time sorting them out and then I’m playing old songs I wrote when I was playing with the band and then I stare at broken glass on the floor that surrounds the bed, thinking: that’s a cool album cover. Then I’m picking up a half-empty package of M\u0026M’s and washing them down with some vodka and then since it makes me sick I have to head for the bathroom but I trip over the telephone cord and my hand slams into a thick piece of champagne-bottle glass and for a long time I’m staring at my palm, at a thin rivulet of blood racing down my wrist. Unable to shake the glass out, I pull it out and the hole in my hand looks soft and safe and I take the jagged stained piece of glass that still has part of a Dom Perignon label on it and seal the wound by placing it back into it where it looks complete, but the glass falls out and streaming blood covers the guitar I’m beginning to strum and the bloodied guitar will make a pretty good record cover too and I’m able to light a cigarette, blood soaking it only a little. More Librium and I’m asleep but the bed shakes and the earth moving is part of my dream, another monster approaching. The phone starts ringing at what I can only guess is noon. “Yeah?” I ask, eyes closed. “It’s me,” Roger says. “I’m sleeping, Lucifer.” “Come on, get up. You’re having lunch with someone today.” “Who?” “Someone,” Roger says, irritated. “Come on, let’s play.” “I need, like, something,” I mumble, opening my eyes, the sheets, the guitar next to the sheets, covered with brown dried blood, some of it in patches so thick it moves me to open my mouth, then swallow. “I need something, man.” “What?” Roger’s saying. “Your Mr. Potato Head broke? What?” “No, a doctor, man.” “Why?” Roger sighs. “Cut my hand.” “Really?” Roger sounds bored. “It was bleeding, um, pretty bad.” “Oh, I’m sure it was. How did you do this?” Roger asks. “In other words: did you have help?”","sourceLink":"https://allnovel.net/the-informers/page-38.html","bookId":2685,"book":{"id":2685,"title":"The Informers","description":"Storyline: Set in Los Angeles, in the recent past. The birthplace and graveyard of American myths and dreams, the city harbours a group of people trapped between the beauty of their surroundings and their own moral impoverishment. This novel is a chronicle of their voices.","cover":"https://allnovel.net/images/the-informers.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-informers.html","creation":"Oct 5, 2019 8:59:07 AM","modification":"Oct 5, 2019 10:13:49 AM"}}
