{"id":69880,"no":53,"title":"Page 53","content":"Randy is still going through rough times. He still feels “in limbo.” He’s laying right next to me now. Well, actually he’s on the floor and I’m in the bed. Carlos is outside trying to get what sun is left. I deal with Randy as best I can. He’s getting so thin. Randy’s laughing right now. Wait … okay, he’s all right now. Oh, Sean, I don’t know if I’m going back to Camden. The thought of going back to all those stupid pseudo-intellectuals sounds terrible. I don’t think I can handle it. There’s really no reason for me to go back to school. I mean, I’d absolutely love to see you. But going back to New Hampshire seems like a bummer.\\n\\n Is there anything you’d like me to send you? How about a big supply of Valium (which everyone seems to have). No—I won’t contribute to your drug habit (ha ha). Randy seems to have everything here. Stuff I don’t even know the names of. (Los Angeleans aren’t very shy about their pills.)\\n\\n We (Randy, Carlos, someone named Wallace the Roachclip and I) might be going to Palm Springs for Christmas. It depends on how Randy is feeling. My grandparents want me to stay with them but I don’t know if I’m going to. I might. I might not.\\n\\n It seems so easy to stay here in L.A. and get into the record industry or work at my grandfather’s studio (I don’t know yet—even if I haven’t been there a whole lot in the last month). But my grandparents don’t really notice my absence. They’re both tranquilizer addicts. I recently found out they’re both heavily into Librium. Carlos just came in—Carlos says “hi” and is asking if you are cute. What do you think I told him? You’ll never know.\\n\\n I’ll be 21 when you get this or 18—depending on who you ask. Where will we be in ten years? I wonder what’s going to be happening then? I wonder what’s happening now.\\n\\n A friend of Carlos was found dead in a garbage can in Studio City. He had been shot in the head and skinned. How awful, huh? Carlos doesn’t seem very sad but Carlos is a very strong person so that doesn’t surprise me. Carlos just put in a new videotape. We’ve been watching Night of the Living Dead and Dawn of the Dead. Have you ever seen them? Randy plays them all the time. I’ve seen them a lot since I’ve been here. They’re both really fun. Carlos is trying to wake Randy up to watch the movie. Carlos says L.A. is swarming with vampires. I’m taking a Valium.\\n\\n Listen, Sean. I’ve decided that I’m not going to write to you anymore unless I get a letter from you in return. I’m not going to plead anymore. If you don’t write me, I simply won’t write back. So write me and take care.\\n\\n Love,\\n\\n Anne\\n\\n Dec 26 1983\\n\\n Dear Sean,\\n\\n I just reread a first draft of this letter and realized that it says nothing about what’s happening specifically. Sorry, I seem to be incapable of writing a newsy letter. Descriptions bore me, I guess, and the best I can do are these scribbles, which may not make much sense to you. How’s ‘everything with you? How was your Christmas? I hope you’re enjoying yours. I’m at Christie’s right now, sitting by the pool. I went shopping earlier and bought earrings, two pairs of slippers, a bag of oranges and then had lunch with someone from the studio, who juggled for me, then peed on a potted palm.\\n\\n Randy OD’d a week ago (I think it was a week ago). Well, at least that’s what they say he died of. They all told me that Randy OD’d, but Sean, I saw the room where they found him and there was so much blood. It was everywhere. There was blood on the ceiling, Sean. How can blood get on the ceiling if you OD? How can it get there anyway? (Scotty says only if you explode.) Well, I went to the beach with Lance (this really gorgeous punker who works at Poseur on Melrose) and Lance gave me some Seconal, which helped a lot. I feel much better now. I really do.\\n\\n I’ve been talking to my stepmother about staying here. I won’t be living with my grandparents but at Randy’s place (it’s all cleaned up, so don’t worry) with Carlos. And I also get Randy’s Ferrari, so it’s not like I’m left empty-headed. But nothing is definite yet. Haven’t been thinking too much about it. Are you going to write?\\n\\n Love,\\n\\n Anne\\n\\n Jan 29 1984\\n\\n Dear Sean,\\n\\n Doesn’t it seem like a long time since I’ve written you? I guess I’m not much into it anymore. Well, I’m still around and alive, so don’t worry. Can you believe I’m actually staying here? That I’ve already been here five months? Oh God. Well, I guess I won’t be going back to Camden in the fall. I’ve gotten so used to things out here. I’ve been driving around a lot and I go to the studio sometimes. Sometimes I go out to Palm Springs. It’s quiet at night. \\n\\n","sourceLink":"https://allnovel.net/the-informers/page-53.html","bookId":2685,"book":{"id":2685,"title":"The Informers","description":"Storyline: Set in Los Angeles, in the recent past. The birthplace and graveyard of American myths and dreams, the city harbours a group of people trapped between the beauty of their surroundings and their own moral impoverishment. This novel is a chronicle of their voices.\\n","cover":"https://allnovel.net/images/the-informers.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-informers.html","creation":"Oct 5, 2019 8:59:07 AM","modification":"Oct 5, 2019 10:13:49 AM"}}
