{"id":69891,"no":64,"title":"Page 64","content":"“Marsha for the longest time was only into animals, right?” I ask. “Cows? Horses, birds, dogs, pets, you name it, right?” “Who do you think controlled the coyote population last summer,” Miranda says. “Yeah, I heard about that,” I murmur. “Baby, she would go to Calabasas, out to the stables, and bleed a f**king horse in thirty minutes flat,” Miranda says. “I mean, holy shit, baby, things were getting ridiculous for a while.” “I personally cannot stand horses’ blood,” I’m saying. “It’s way too thin, too sweet. Other than that, I can deal with just about anything, but only when I’m feeling gloomy.” “The only animal I cannot abide is a cat,” Miranda says, chewing. “That’s because so many of them have leukemia and lots of other poo-poo diseases.” “Dirty, filthy creatures.” I shudder. We order two more drinks and split another steak before the kitchen closes and then Miranda confides to me that she almost got herself into a gang bang the other night over at Tuesday’s place with all these frat boys from USC. “I’m, like, completely taken aback by this,” I say. “Miranda, you can be so lousy.” I drink the rest of the spritzer, which is a little too bubbly tonight. “Darling, believe me, it was some kind of accident. A party. Lots of young gorgeous men.” She winks, fingering a tall glass of Moët. “I’m sure you can guess how that turned out.” “You’re just, like, wicked,” I tell her, chuckling. “How did you extract yourself from the … situation?” “What do you think I did?” she says teasingly, gulping down the rest of the champagne. “I sucked the living shit right out of them.” She looks around the mostly empty patio, waves over to Walter as he steps into his limo with a girl who looks about six, and Miranda savs, softly, “Semen and blood is a delightful combo, and do you know what?” “I’m captivated.” “Those ridiculous USC boys loved it.” She laughs, throwing her head back. “Lined up again and I of course was only too happy to please them again and they all passed out.” She laughs harder and I’m laughing too and then she stops, looking up at a helicopter crossing the sky, a searchlight sending down a cone of white. “The one I liked lapsed into a coma.” She looks sadly out onto Robertson at a small tumbleweed the valets are playing soccer with. “His neck fell apart.” “Don’t be sad,” I say. “It’s been a delightful evening.” “Let’s catch a midnight flick in Westwood,” she suggests, eyes brightening at her own suggestion. We go to the movies after dinner but we first buy two large raw steaks at a Westward Ho and eat them in the front row and I flirt with a couple of sorority girls, one of whom asks me where I got my vest, meat hanging from my mouth, and Miranda even bought napkins. “I adore you,” I tell her, once the previews start. “Because you’ve got the right idea.” I’m at another club, Rampage (but pronounce it French), and I find a pseudo-hot-looking Valley bitch and she seems really slow and stupid like she’s completely stoned or drunk or something but she’s got great tits and a pretty hot body, not too heavy, maybe a little too skinny, and basically her emptiness thrills me. “I usually hate skinny chicks,” I’m telling her. “But you look great.” “Skinny chicks suck?” she asks. “Hey—that’s pretty funny,” I tell her. “Is it?” she asks, slack, washed out. “I’m into you anyway. We take my car and drive over to the Valley, into Encino. I tell her a joke. “What do you call an Ethiopian wearing a turban?” “Is this a joke?” “Q-Tip,” I say. “That really cracks me up. Even you must admit it’s riotous.” The girl is too stoned to respond to the joke but she manages to ask, “Does Michael Jackson live around here?” “Yep,” I say. “He’s a buddy.” “I’m really impressed,” she says ungratefully. “I only went to one party after the Victory tour and it was really shitty,” I tell her. “I hate hanging out with niggers anyway.” “That’s not exactly the nicest thing you could say.” “Mellow out,” I groan. In my room she’s into it and we’re f**king wildly and when she starts to come I begin to lick and chew at the skin on her neck, panting, slavering, finding the jugular vein with my tongue, and I start bleeding her and she’s laughing and moaning and coming even harder and blood is spurting into my mouth, splashing the roof, and then something weird starts to happen and I get really tired and nauseous and I have to roll off her and that’s when I realize that this girl is not drunk or stoned but that she’s on some, as she puts it now, “way-out f**king drugs.”","sourceLink":"https://allnovel.net/the-informers/page-64.html","bookId":2685,"book":{"id":2685,"title":"The Informers","description":"Storyline: Set in Los Angeles, in the recent past. The birthplace and graveyard of American myths and dreams, the city harbours a group of people trapped between the beauty of their surroundings and their own moral impoverishment. This novel is a chronicle of their voices.","cover":"https://allnovel.net/images/the-informers.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-informers.html","creation":"Oct 5, 2019 8:59:07 AM","modification":"Oct 5, 2019 10:13:49 AM"}}
