{"id":85468,"no":16,"title":"Page 16","content":"SIXTEEN\n Marcie was waiting for me on the front porch, sitting on the top step, her elbows resting on her knees, a gin and tonic the size of a fireman\u0027s bucket cupped in her little pink hands. On first glance she looked like she was just enjoying a well-deserved drink after a tough day\u0027s work.\n As I walked closer I saw a different story. Her hair was messed up. The top two buttons of her blouse had been torn off. Her bottom lip was swollen and purple.\n I looked down at her, touched her lip gently with two fingers. I was shaking, not with fear this time but with anger. \"Who did this?\"\n \"I don\u0027t know his name.\" Her voice was a little loose. Probably not her first gin and tonic. Probably not her last.\n \"What did he look like? What did he want?\" I\u0027d find him. I\u0027d find whoever did this and plant him in the ground six feet under.\n Marcie raised an eyebrow. \"You want to know what he looked like?\" She curled a finger at me. \"Follow me.\"\n I followed. She led me through the kitchen and out to the garage where she kept her giant, dead polar bear.\n She pointed at the dead body on the floor. \"That\u0027s what he looks like. Familiar?\"\n \"What the fuck happened?\"\n \"I-\" Her voice caught. When she started talking again, she didn\u0027t sound so casual. \"He came in looking for you, came to the door and- he pushed me in, it was so f-fast-\" She began crying, moved forward into my arms. I hugged. She hugged back tight, burying her face into my chest. I stroked her hair.\n I recognized the guy bleeding on the floor. Vincent, one of the goons who worked for Beggar. He\u0027d been there when I\u0027d passed off Sanchez\u0027s body as Rollo Kramer. I didn\u0027t think it would help Marcie to know his name, so I just kept hugging.\n Abruptly, she pushed back from me, wiped the tears from her eyes. She frowned then laughed. \"I hate you seeing me like this.\" She sniffed. \"Damn it, I feel like such a little idiot.\"\n \"It\u0027s okay.\"\n \"It\u0027s not okay. I\u0027m too old to act like some little crybaby bitch.\" She squared her shoulders, took a long pull at her gin and tonic. And just like that she was a rock, totally in control of herself, confident. At least that\u0027s the show she was putting on. I\u0027d seen past that to the fragile woman behind the tough shell. I\u0027d seen it, if only for a few seconds.\n I put on a pot of coffee, and we sat at the kitchen table. When it was ready, I poured myself a cup. I offered her some, but she shook her head and fixed herself another gin and tonic. I thought about telling her to ease up, but then I figured she probably knew what she was doing.\n \"Let\u0027s hear about it,\" I said.\n \"Sure.\" She took one more big gulp before starting.\n \"I was just sitting around watching television,\" said Marcie. \"I was hoping you\u0027d call, actually. There was a knock on the door, and I saw him through the peephole. I\u0027d never seen him before, so I asked who he was through the door. He said he was a friend of yours and he had a message for me. I was so eager to get the message I didn\u0027t even stop to think it was a trick.\"\n She slapped the palm of her hand against her forehead. \"Stupid. I can\u0027t believe I was so dumb.\"\n \"It\u0027s okay.\"\n \"Will you stop saying it\u0027s okay? It\u0027s not fucking okay. It was stupid. I wasn\u0027t born yesterday, you know. I know how things work.\"\n Right.\n She jumped back into her story. Once the guy had gotten inside, he grabbed her. She tried to get away, but he convinced her to cooperate by getting rough. That\u0027s where the torn buttons and purple lip came in. She\u0027d had too much experience with tough guys from her marriage to Rollo, so she knew she\u0027d have to play along or get another knuckle job. But she was still thinking, her mind always working.\n The tough guy came straight out and said he was looking for a set of accounting books, and he had a pretty good idea that Marcie\u0027s boyfriend had hidden them with her someplace.\n I cringed inwardly. That\u0027s almost what had happened. I\u0027d almost left the books parked under a raccoon in Marcie\u0027s freezer.\n The guy asked Marcie if she\u0027d heard of Beggar Johnson.\n She\u0027d said she had.\n Then he asked her if she knew what Beggar would have him do to her if she jerked us around.\n Marcie said she knew.\n \"Okay, then,\" the guy had said. \"Now be a good girl and take me to those books, and I can let you get back to your life.\"\n \"But I knew it didn\u0027t work that way,\" said Marcie. \"These kind of guys use you up until there\u0027s nothing left you can do for them. Then they get rid of you. So I kept thinking how was I going to get myself out of this mess. I told him the books were in the garage. I figured I could get ahold of a rake or a hammer or something, maybe hit him in the head or... I don\u0027t know what I was thinking really, but I had to try something.\"\n She was right, of course. Vincent almost certainly had instructions to get rid of Marcie after he\u0027d found the books. I sipped my coffee.\n \"So we go into the garage.\" Marcie finished her drink, started chewing the ice. \"But the guy must\u0027ve sensed I was getting ready to try something, or maybe he was just the suspicious type. He grabbed me and pulled me behind him, said he wanted to go in first- except the garage is dark. He felt along the wall for the light switch, and when he didn\u0027t find it, I told him there was a string hanging down from the ceiling to turn on the lights.\"\n Suddenly I knew how this story was going to end, and I couldn\u0027t help smiling to myself.\n Marcie saw me, and her lips curled into a smile too. She was trying to be serious about telling me what happened, but her knowing that I knew what was coming made it morbidly funny, and we were both grinning big as she told me what happened.\n \"So he takes these careful steps forward into the dark garage so he doesn\u0027t walk into something,\" said Marcie. \"And he\u0027s swinging his hand back and forth trying to catch the string. When he finally gets it, he says \u0027got it\u0027 like he\u0027s so proud of himself.\" Marcie giggled, but tears rimmed her eye. \"And then he jerked that string.\" She laughed hard now, had to catch her breath before she could continue. \"And then- and then he saw the bear, and he screamed-\" Big laughs now, her whole body shaking. \"I mean, like a little girl, he\u0027s screaming. He backs right into me, our feet tangle up, and we both go down in a pile. But he drops the gun.\" Her laughter trailed off. \"I scrambled after it. He tried to grab at my legs, hold me back, but I\u0027d already grabbed the gun. It was heavy.\"\n No laughter now at all. Her face was blank. \"And he lunged for me, and I pulled the trigger, and just like that he was dead. He fell over, blood spreading on his chest.\" She heaved a big sigh. \"One minute he was walking and talking, and the next he was just meat, like something I\u0027d brought home from the zoo to stuff and mount.\"\n \"I\u0027m sorry, Marcie. It\u0027s my fault. I put you in a bad position.\"\n \"You sure as hell did.\" She tried to make a joke out of it, and the smile returned to her lips for a split second, but it couldn\u0027t hang on, and her face was blank again.\n This was why guys like me and Bob Tate and even Rollo Kramer always lost wives and girlfriends. We were walking danger zones, and everyone around us suffered. Then I had a bad thought and I told Marcie I had to use the kitchen phone.\n I dialed Ma, and Danny picked up after three rings. \"Yo.\"\n \"Danny, it\u0027s Charlie.\"\n \"Jesus, Charlie, where the hell you been? Some guy named Lou Morgan\u0027s been ringing the phone off the hook for you.\"\n \"Later,\" I said. \"Right now I want to know what\u0027s going on over there.\"\n \"Over here? Nothing. Amber and I are watching television, and Ma-\"\n \"What\u0027s Amber doing there?\"\n \"You said to stick around the house and keep an eye on Ma,\" Danny reminded me. \"Since I couldn\u0027t go to Amber\u0027s place, she came here.\"\n \"Listen to me. I want you to tell Ma to pack a suitcase. No, make that two suitcases.\"\n \"Huh? What for? Charlie, what\u0027s going on?\"\n \"We\u0027re playing it safe. That\u0027s all. Put Ma on the phone.\"\n I heard Danny yell at Ma to come in the living room. I waited. She picked up after a few seconds.\n \"Charlie?\"\n \"Ma, pack up whatever you think is important and get to the airport. I want you to stay with Aunt Irene, okay?\" Aunt Irene was Ma\u0027s younger sister.\n \"Is there trouble, Charlie?\" Ma sounded suddenly sharp. She walked around all day doing her old lady act, but when the heat was on she knew better than to argue. Ma wasn\u0027t stupid.\n \"There might be, Ma. I\u0027m sorry. Better if you\u0027re in Michigan with Irene.\"\n \"I understand. You make it right while I\u0027m gone.\"\n \"Sure, Ma. Put Danny back on will you?\"\n \"Charlie?\"\n \"Yes?\"\n \"You\u0027re my son.\"\n \"I know, Ma.\"\n \"Be careful.\"\n \"I will.\"\n She put Danny back on the phone.\n \"What do I do?\" he asked.\n \"I want you out of there in thirty minutes. Call me here right before you leave so I\u0027ll know you\u0027re away.\" I told him Marcie\u0027s number. \"You got that?\"\n \"Right. Thirty minutes. I\u0027m on it.\"\n \"Good. I got to go.\" I started to hang up.\n \"Charlie, wait.\"\n \"What?\"\n \"What about this Morgan guy? He keeps calling for you.\"\n Shit. I\u0027d forgotten all about Lou. Marcie kept a pen and a basket of scrap paper near the phone. I picked out a piece and grabbed the pen. \"Did he leave a number?\"\n \"Sure.\"\n \"Give.\"\n Danny told me the number, and I wrote. I didn\u0027t recognize it.\n \"Thanks, Danny. Call ahead and book a flight into Detroit while Ma\u0027s packing.\"\n \"Check. Call you in thirty.\"\n We hung up, and I felt a little better. Marcie had almost been killed because of her association with me. I didn\u0027t want any of Beggar\u0027s goons showing up to Ma\u0027s house because they thought I might have hidden the ledgers there. But if they did, I wanted Ma long gone. I didn\u0027t tell Danny or Ma, but I sort of had the idea Ma would run out the clock in Michigan. Orlando was all done with the Swift family.\n Marcie must have had similar notions, because she came out of her bedroom with a suitcase in each hand, pantyhose streaming from the bags where she hadn\u0027t zipped them up all the way.\n I scrunched my face at her. \"What the hell\u0027s this?\"\n \"What does it look like? I\u0027m getting out of here.\"\n \"What? Where?\"\n \"Someplace where my getting killed doesn\u0027t happen,\" she said. She threw the suitcases down hard, went into the bedroom, and came back again with a garment bag. \"I still have the five thousand from Rollo. I\u0027ll call after I find someplace, arrange for a real estate agent to dump the house on someone.\"\n \"Marcie.\"\n \"Maybe I\u0027ll go to New Mexico. I\u0027ve always wanted to try the desert.\"\n \"Marcie.\"\n \"I could try stuffing prairie dogs. Oh, buffalo! I could do a lot with a buffalo.\"\n \"Marcie!\" She stopped, looked at me. I spread my hands, my face a raw question mark. \"What about me?\" And as soon as the question left my mouth, I felt like some little kid left out in the cold, standing there the first day of kindergarten as my mom pulled away in the car.\n \"You? What about you?\" Marcie threw her garment bag down on the other bags, kicked the whole pile of luggage with a savage grunt. \"You. All those guys working for Beggar are you. Rollo, he was you too. I married him. Where\u0027d that get me? And it was you that tried to kill me today. It was you I shot dead. That\u0027s what about you!\"\n \"Okay, okay.\" I was nodding my head up and down fast while she was talking, trying to show real hard I understood what she meant. \"I don\u0027t blame you. But I\u0027m going to fix it. I\u0027m going to wipe the whole slate clean, and we can go anyplace you want and start over.\"\n \"Bullshit.\"\n \"No. Really.\" I moved forward quick, grabbed up both of her hands between mine, searched her eyes with my own. \"We haven\u0027t known each other long, but I want to be with you. I\u0027m going to do some things, set them right, but when that\u0027s finished I\u0027m starting all over. I won\u0027t have anything. I want to have you.\"\n She sighed, heavy and tired. \"You\u0027re such a corny dumbass.\"\n \"It\u0027s all true.\"\n \"What\u0027s this stuff you need to set right?\"\n \"Stan.\" And as soon as I said it, I knew I\u0027d go all the way. It wasn\u0027t a loose end I could live with.\n \"He\u0027s probably dead, you know.\" Marcie wasn\u0027t trying to be insensitive, just frank.\n \"I know. But I have to know what happened. And I have to do what I can about it. He was like a dad. What if it was your dad?\"\n She nodded, chewed her lip thinking about it, looked down at her shoes. \"I understand.\" Then she looked back up at me, hard, that toughness coming back into her eyes. \"But I\u0027ll be damned if I\u0027m going to sit around this house and wait for some wise guy to come and put a bullet in my head.\"\n \"No.\" I took out my rapidly dwindling roll of cash, peeled off a wad of fifties, and handed her the bills. \"Get a hotel, a good one.\"\n \"Where?\"\n \"Near the airport. We might be leaving in a hurry.\"\n \"Okay.\" She made the money disappear into her blouse, and we stepped toward each other. We hugged long and with the relief of decisions made. She knew where she stood now, and I knew what I had to do.\n She broke the embrace and said, \"Come on. You\u0027ve got to help me before you go.\"\n I followed her into the garage, and she picked up the dead guy by the ankles. \"Get the other end, will you?\"\n I gripped him under the shoulders and lifted. \"This is how we met, isn\u0027t it?\" I grinned.\n She batted her eyes at me. \"You\u0027re so fucking romantic.\"\n \"What are we going to do with this bastard?\"\n \"Get him over to my worktable,\" she said. \"I\u0027ll cut up some trash bags to put around him. We\u0027ll wrap the whole thing in duct tape. You can do anything with duct tape.\"\n It was then I knew I was in love with her. \n","sourceLink":"https://allnovel.net/gun-monkeys/page-16.html","bookId":2246,"book":{"id":2246,"title":"Gun Monkeys","description":"Storyline: \n Charlie Swift just pumped three .38-caliber bullets into a dead polar bear in his taxidermist girlfriend’s garage. But he’s a gun monkey, and no one can blame him for having an itchy trigger finger. Ever since he drove down the Florida Turnpike with a headless body in the trunk of a Chrysler, then took down four cops, Charlie’s been running hard through the sprawling sleaze of central Florida. And to make matters worse, he’s holding on to some crooked paperwork that a lot of people would like to take off his hands. Now, with his boss disappeared and his friends dropping like flies, Charlie has got his work cut out just to survive. If he wants to keep the money and get the girl too, he’s really going to have to go ape... \n Nominated for the Edgar Award for Best First Novel, Gun Monkeys is a fast, furious collage of wit and wise guys, violence and thrills—and a full-throttle run through the dark side of the Sunshine State.\n \n","cover":"https://allnovel.net/images/gun-monkeys.jpg","author":"Victor Gischler","type":"Thriller","source":"allnovel","link":"https://allnovel.net/gun-monkeys.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:06:34 PM"}}
