{"id":90667,"no":3,"title":"Page 3","content":"\\n\\n She’d wondered if the others were going to be involved, but she was sitting here alone with Logan.\\n\\n She had all but forgotten her strange dream of the night before. And now, even as it seemed to come crashing down around her, she wondered what a storm at sea could have to do with Amun Mopat.\\n\\n The curse. She’d heard the words in her dream. Egyptian entities always seemed to come with curses!\\n\\n “Go figure. After all this—Amun Mopat. In Chicago,” Logan said in a dry voice.\\n\\n “Yeah, go figure. Chicago,” she repeated blankly.\\n\\n Logan Raintree was her superior, the head of their team. Their actual boss was the elusive Adam Harrison, who had begun this excursion into the unknown—and the known—combining FBI technology and certain…unusual talents. Logan worked loosely with the head of the first team, Jackson Crow, evaluating information from those who sought help and deciding which cases truly called for their unique abilities. Since the original group of special investigators had become known as the Krewe of Hunters, they’d unofficially been dubbed the Texas Krewe. Their first case had been in San Antonio, home to many of them. Working with Logan and the other team members was thrilling and gratifying at once; it felt as if they spoke an ancient and secret language, and had come together as nationals from the same foreign country.\\n\\n At the moment, she wasn’t feeling especially thrilled. Or gratified. She wished she was back at the Tar Pits.\\n\\n “And you want me to go out there now?” Kat asked. She didn’t add alone.\\n\\n Logan glanced at his watch.\\n\\n “Yes. It could be nothing.” He shrugged. “And it could be something. But we’re talking about a dead body, and the autopsy is probably being performed as we speak.”\\n\\n “Chicago is a big city, and I’m sure they have a fine staff of medical examiners and pathologists,” Kat said.\\n\\n “I’m sure they do, too. But before too much time goes by, I want you in on it. Even the best people in their fields can miss little signs and clues, especially when they’re convinced by the circumstances that they’re looking at an accidental death.”\\n\\n Everyone on the Krewe had his or her technical or “real world” specialty.\\n\\n Hers was forensic pathology.\\n\\n “Amun Mopat,” Kat said again. “In Chicago.”\\n\\n Logan leaned forward. “As I said, this could be nothing—nothing at all. That’s why I need you there first. Sean is still out in Hawaii, but he’s been alerted,” he said, referring to another of their team members, Sean Cameron, who had been most heavily involved in the recent occurrences. “And we still have a few loose ends here—the last of the legal documents, another deposition—so I’m keeping Kelsey, Jane and Tyler with me. If it’s a tragic but simple case of drowning, there’ll be no need for the whole team. In that case, we’ll meet back at headquarters. But if it’s something else…”\\n\\n Kat nodded dully. There was a dead body. She was a medical examiner. The dead body, of course, wasn’t an ancient Egyptian priest. It was a historian and diver.\\n\\n Who had died. Searching for a sunken ship in Lake Michigan.\\n\\n “I dreamed I was on a ship last night,” she told Logan.\\n\\n “Really?”\\n\\n “And the passengers were talking about a curse.”\\n\\n His expression was serious. “Maybe you’ll be able to use that,” he said.\\n\\n She smiled. “Maybe it was to warn me I was about to head off—to Chicago. And a sunken ship. And a curse.”\\n\\n “I think in our line of work,” he said, eyebrows raised, “we’ve learned that curses are pretty much things people invent when they want to do something evil for their own gain. And you may only be there a few hours. Who knows? The situation might just be that this diver went overboard in his excitement when he should have waited for the other researchers. The entire discovery was supposed to be filmed. But, like I said, he didn’t wait. His excitement might have led to carelessness, which is probably what happened. And there’s always competition to salvage the treasure on a sunken trip. But because we’ve been helped by the documentary crew in question, I feel it’s important that we help out in return.”\\n\\n “Who’s doing the documentary?” Kat asked.\\n\\n “Alan King. We barely saw him when we were in San Antonio, but he had a bad time with the documentary there, especially losing his star. Apparently the Chicago Ancient History Preservation Center—where our dead man worked—is struggling like the rest of the world. They need funding.” He studied his papers. “One of the staff, Dr. Amanda Channel, sent out queries to various film people and hit upon some friends of ours—you remember Bernie Firestone, right?”\\n\\n “Of course,” Kat said.\\n\\n “Yes, well, he’s frequently hired by Alan King, who can make films whenever he wants because he has billions—no, he didn’t make his billions in film. He’s able to do documentary films because he does have billions. Bernie approached Alan, who loved the idea, and there you have it.”\\n\\n “Sean should be available soon,” Kat murmured. “He’s worked with them before.”\\n\\n “If he’s needed, he’ll be there. Remember—we don’t know if this is anything at all. Anyway, if you do end up staying, you’ve at least met Alan and you know Bernie and his cameraman, Earl Candy. Right now, you’ll take a look at the deceased, read the autopsy report, talk with a few people—and, if there’s nothing, we’ll all meet back in Virginia. Requests for our expertise are already piling up back at headquarters.” Logan paused. “But like I said, I feel we’re in debt on this one. There’s also the fate of a historical institute on the line, not to mention an incredible discovery.”\\n\\n “I still say…”\\n\\n “That it’s ironic?” Logan asked. “I thought that, too, but then, not so much. Not really. When the original Sam Stone was filmed in the early forties, the sinking of the ship in Lake Michigan had occurred half a century earlier. A writer, one who was fascinated by Egyptology, would readily have seized upon a real priest for his story. I looked into it and found out that the original screenplay was by a man named Harold Conway—who was born in Chicago. He grew up going to the Field Museum and hearing stories about the Jerry McGuen. The priest’s actual mummy, with the inner and outer sarcophagi, as well as other treasures, went down with the ship. So our screenwriter would definitely have known about Amun Mopat, and he was obviously interested enough in the historical character to use him in a movie.”\\n\\n “Great,” Kat muttered.\\n\\n “Hey, it could be an M.E.’s dream,” he said.\\n\\n “A mummy? An anthropologist’s dream, not mine,” she retorted. “But…all right, so I’m to examine the body and try to discern if he died by natural means, or…”\\n\\n She let her voice trail off.\\n\\n They dealt with the unknown, the world that lay beyond the veil. Their “sixth sense.”\\n\\n But Logan had a point. In her experience, and in that of the others, they’d never come across a ghost or a curse that killed.\\n\\n It was human beings who killed other human beings.\\n\\n “They’re not expecting to find much left of the people who went down with the ship,” Logan was saying. “According to the records, there were no survivors, and no bodies rose to the surface—or none that were found or recognized. But I’ve read that time would have destroyed even their skeletons by now. Is that true?”\\n\\n Kat nodded. “Unless someone was caught in a sealed area, it’s unlikely that there’d be any remains. Time and sea creatures take their toll. They may find skeletal remnants, but only once they’re into the bowels of the ship.”\\n\\n “So, it really is one big watery grave.”\\n\\n “It does seem respectful to salvage what might be important to history and the living, and then let the ship itself stay where it sank, a memorial to those who were lost.”\\n\\n “I believe that’s the eventual plan.” Logan flipped a page in the file that lay before him on the table. “You won’t be alone,” he told her, grinning as if he’d read her mind. She wasn’t afraid of being alone, nor was she unaccustomed to the strange and unusual.\\n\\n “Oh?”\\n\\n “A member of the original Krewe is out there now. He happened to be visiting an old buddy in Chicago when this came down. You’ll meet up with him. His name is Will Chan. He’ll stop by to see Alan, Bernie and Earl this afternoon, and he has an appointment with the people at the Preservation Center bright and early tomorrow morning. He’ll meet you at the morgue at 10:00 a.m.”\\n\\n “Okay, but do I need to reach him first?”\\n\\n “No. Head straight to the morgue. Will’s going to catch up with you there.” Logan handed her the folder. “His contact information is in here. Between the two of you, we’ll have a good sense of what’s going on, be it too much enthusiasm by a diving historian—or a predator with an enthusiasm for murder. Oh, and Alan King has hired private security to guard the dive site.”\\n\\n “You can guard a dive site?”\\n\\n “I thought you were a diver?”\\n\\n “Yes, but I dive because I love it, not because I’m looking for lost treasures.” Kat offered him a wry smile. “I’ve seen salvage from the Titanic and the Atocha in museums. I never went looking for them. And I usually dive in nice warm water in the Caribbean or the Gulf.”\\n\\n “Salvage rights are complicated. Federal law says that all wrecks belong to the state that claims the waters. Depending on what’s found, ownership of artifacts and the wreck itself may wind up in court for years. But the Preservation Center did file papers for the right to dive and work on the wreck. However, it’s not the legal aspect that people worry about as much as the black market.”\\n\\n “Other divers stripping the site and selling salvage illegally?” Kat asked.\\n\\n “You can’t begin to imagine what can be bought and sold on the black market.” \\n\\n","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-3.html","bookId":2281,"book":{"id":2281,"title":"The Unspoken (Krewe of Hunters #7)","description":"Storyline: The Unspoken (Krewe of Hunters #7) \\n 1898: Bound for Chicago, the freighter Jerry McGuen goes down in Lake Michigan, taking with it every man aboard. But what other fate could befall a vessel carrying the ill-gotten sarcophagus of an Egyptian sorcerer? Now: A veteran diver and ?ghost ship? expert is exploring the legendary wreck for a documentary. He dies inexplicably inside the freighter\u0027s main saloon. Then another diver is killed and panicked rumors rise like bubbles from the lake: ancient demons have awakened below! The expedition\u0027s beleaguered financier calls paranormal investigator Katya Sokolov to Chicago to save the film ? and perhaps some innocent lives. Along with media forensics guru Will Chan, Kat plumbs the depths of an evil that may date back to the time of the Pharaohs. But some secrets are best drowned in the seas of the past...\\n","cover":"https://allnovel.net/images/the-unspoken-krewe-of-hunters-7.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-unspoken-krewe-of-hunters-7.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:43:03 PM"}}
