{"id":89854,"no":23,"title":"Page 23","content":"“Well, yes, there’s Dawn,” I say, trying to keep the irritation out of my voice. As we slow, stuck in traffic, I add, “Believe me, I know. I bear the burden of her name.” A lot of people have issues with Buffy’s sister. But kleptomania aside, Dawn always tried to be one of the good guys. And every once in a while she was really brave. “Are you familiar with the usenet group alt.dawn.die.die.die?” Eric asks. At my nod, he announces, “I founded it.” I give him a long, considering glare and try to decide if he’s trying to piss me off or whether he just doesn’t have any social skills. “Look, Dawn Summers was thematic,” I tell him. “Summers blood. Saving the world, again. It made sense. Besides, it’s not like those monks asked Dawn if she wanted to be transformed from a ball of energy into Buffy’s little sister.” “Oh, my God!” Megan interrupts with a bark of laughter. “No wonder neither of you can get dates by yourselves.” “Honestly,” I say, “was Dawn really all that bad?” “She whines,” Eric replies. “All of the pseudo-siblings whine.” “Not Tim Drake Robin,” I shoot back, although, to be fair, he didn’t start out as Dick Grayson’s sibling (or Bruce Wayne’s son) per se. “Jason Todd Robin?” “He deserved to die,” I admit. I hold my breath, worried Eric will counter with the abomination that was Spock’s half-brother, Sybok. Even I don’t have a defense for that. A light changes, and we’re moving again. “Why do you two know all this?” Megan asks. I glance over my shoulder. “Who won the third American Idol?” As we turn into the parking lot, she says, “That’s different. It’s popular.” Waterloo Cinema isn’t like other movie theaters. The auditoriums have great stadium seats with long tables secured in front of each row. Even better, they have actual waiters who serve food and drink during the film itself. We take in the crowd and settle into our seats about five minutes before the show starts. I’m oddly pleased by how packed the theater is. How popular the show is, even after all this time. As we sit down, we’re given bottles of soap bubbles, plastic vampire teeth, and cigarette lighters. Megan examines hers like they’re the unclean symbols of a mysterious, foreign, and possibly dangerous culture. She gives up when her boyfriend Ryan takes our orders—Greek salad with chicken for Megan, burger and fries for Eric, a flaming chocolate bomb for me. I ignore my stepsister’s look of horror as a cheer rises and the overture begins. It’s an interactive show. When Tara serenades Willow, we blow magic bubbles. When Buffy walks through the fire, we raise our lighters high. And we sing. We sing along. Except when Dawn appears on screen. At the urging of the host, the audience boos, hisses, and glories in attacking her (even though it was Xander who summoned the tap-dancing demon in the first place). You can’t even hear the soundtrack. Megan looks baffled. Eric, though, has to be the loudest person in the building. “Go away, Dawn!” he shouts, cupping his hands over his mouth like a megaphone. “Loser!” Very mature. He’s definitely trying to piss me off. Who the hell does he think he is? What makes him think he’s so cool, anyway? Besides, it’s not just my name he’s jeering. It’s every newbie, every little sister who wasn’t there before. It’s the lesser sibling…the one blamed for everything…my God, it’s me. Not that anyone else seems to care. “Get off the screen!” shouts the guy behind me. “Screw you, Dawn!” screams a girl down in front. “Die, Dawn, die!” someone yells from down the aisle. At that, I decide I’ve had it. I’ve had it with Eric. I’ve had it with Megan. I’ve had it with everything. I’m frustrated. I’m furious. And I’m wired on sugar. I drop my spoon and wipe chocolate from my lips. I duck beneath the long table in front of my row and run to the stage, snatching the wireless microphone from the host on my way. “You can’t do that!” Ryan exclaims, snagging my arm. “Get the hell out of my way,” I say, enunciating carefully, “or I’ll tell Colonel Green you deflowered his daughter in the backseat of your Volvo last fall after the A\u0026M game.” Ryan turns pale—brow ridge, square jaw and all, and for the first time, he really sees me. “Okay.” “I need the stage.” “Okay,” he says again, backing away. As I block the screen, the hisses and boos grow louder, and for a moment, I’m blinded by the projector light. Then I’m in the spotlight. “My name is Dawn!” I shout into the microphone, and my voice sounds loud, louder than I expected. Loud enough to be heard over the soundtrack. “Your name is Dawn.” I go on, in an only slightly more sane tone, realizing as I say it that metaphor isn’t my best hope. “So what if she’s awkward? So what if she whines about her sister? Are you honestly telling me that you have never whined?” The crowd’s reply? More jeers, laughter, and a possible death threat from a man wielding a quesadilla. “Come on!” I try again. “A lot of people didn’t like Wesley in the beginning. A lot of people didn’t like Tara in the beginning.” I scan the crowd again. The hardcore Angel fans are listening now. The Willow–Tara ’shippers, too. “We’ve all been like Dawn,” I argue. “We’ve all felt out of place. Sure, here, here, you belong. Here you’re among your own. But what about out there?” “Out there, people like her”—I point to Megan—“look down on you, judge you, and scorn you. She isn’t even here for Buffy! She’s here for her waiter-boyfriend!” Is it working? It’s not working. Is it? No. Only a few heads are nodding. I’m not sure what I was expecting. I don’t know what I was thinking. My sugar high has worn off. “We must stand together!” I raise my fist, defiant. It’s my last, best shot to convince them. “We must embrace our inner Dawn!” Silence. Gaping, lonely silence. It feels like the end of the world. Just as I’m ready to hand off the mic and slink away, Megan stands and begins to clap. Slowly at first, but loud. Really loud. She looks me in the eye, then gives a small nod and a knowing, appreciative smile. Like we’re sisters or something. In the next moment, Eric is standing beside her. And he’s cheering, too. Then Megan offers up this amazing two-fingers-in-her-mouth piercing whistle. I didn’t even know she could do that. It’s gloriously non-prissy. It’s fantastic! That’s when it happens. Maybe it was my argument. Maybe it was my scary zeal. Whatever the reason, as soon as Megan whistles, the crowd is on its feet. They’re blowing bubbles. They’re raising their lighters high. They’re cheering through their fangs… For Dawn Summers, for themselves and each other, for every sibling who got tossed into a situation beyond her control. For me. And for my sister, who whistles again… Once more with feeling. Greg Leitich Smith channeled his student days at a math-science magnet high school into the Peshtigo School novels Ninjas, Piranhas, and Galileo, which won a Parents’ Choice Gold Award, and Tofu and T. rex, both published by Little, Brown. Greg has long been a fan of Star Trek, although he was disappointed as a child when he found out it was fiction and that we had only recently made it to the moon. The starship Enterprise (NCC-1701E) adorned his wedding cake. (The actual ceremony, alas, was not performed in Klingon.) His Web site is www.gregleitichsmith.com. Cynthia Leitich Smith is the author of Tantalize, which was a Borders Original Voices selection and a New York Public Library Book for the Teen Age, and its companion novel, Eternal. Blessed, a third book set in the universe, and a Tantalize graphic-novel adaptation are in the works. Cynthia also has written several YA short stories and award-winning books for younger readers. She teaches in the MFA program in Writing for Children and Young Adults at Vermont College. Back in the day, Cynthia and her husband Greg made a twice-weekly ritual out of each all-new Buffy: The Vampire Slayer or Angel episode and are now addicted to the comic adaptations. They both speak fluent “Scooby.” Her Web site is www.cynthialeitichsmith.com. Text by Holly Black and Cecil Castellucci. Illustrations by Bryan Lee O’Malley. QUIZ BOWL ANTICHRIST by david levithan I am haunted at times by Sung Kim’s varsity jacket. He had to lobby hard to get it. Nobody denied that he had talent—in fact, he was the star of our team. But for a member of our team to get a jacket was unprecedented. Our coach backed him completely, while the other coaches in the school nearly choked on their whistles when they first heard the plan. The principal had to be called in, and it wasn’t until our team made Nationals that Sung’s request was finally heeded. Four weeks before we left for Indianapolis, he became the first person in our school’s history to have a varsity jacket for quiz bowl. I, for one, was mortified. This mortification was a complete betrayal of our team, but if anyone was going to betray the quiz bowl team from the inside, it was going to be me. I was the alternate. I had been drafted by the coach, who also happened to be my physics teacher, because while the four other members of the team could tell you the square root of the circumference of Saturn’s orbit around the sun in the year 2033, not a single one of them could tell you how many Brontë sisters there’d been. In fact, the only British writer they seemed familiar with was Monty Python—and there weren’t many quiz bowl questions about Monty Python. There was a gaping hole in their knowledge, and I was the best lit-boy plug the school had to offer. While I hadn’t read that many of the classics, I was extraordinarily aware of them. I was a walking CliffsNotes version of the CliffsNotes versions; even if I’d never touched Remembrance of Things Past or Cry, the Beloved Country or Middlemarch, I knew what they were about and who had written them. I could only name about ten elements on the periodic table, but that hardly mattered—my teammates had the whole thing memorized. They told jokes where “her neutrino!” was the punch line.","sourceLink":"https://allnovel.net/geektastic-stories-from-the-nerd-herd/page-23.html","bookId":2793,"book":{"id":2793,"title":"Geektastic: Stories from the Nerd Herd","description":"Storyline: Geektastic: Stories from the Nerd Herd by Holly Black (Editor), Cecil Castellucci (Editor), M.T. Anderson, Libba Bray , Cassandra Clare , John Green , Cynthia Leitich Smith, Greg Leitich Smith , David Levithan , Kelly Link, Barry Lyga , Tracy Lynn, Wendy Mass, Garth Nix , Scott Westerfeld, Lisa Yee , Sara Zarr, Hope Larson (Illustrator), Bryan Lee O\u0027Malley (Illustrator) … Acclaimed authors Holly Black (Ironside) and Cecil Castellucci (Boy Proof) have united in geekdom to edit short stories from some of the best selling and most promising geeks in young adult literature: M.T. Anderson, Libba Bray, Cassandra Clare, John Green, Tracy Lynn, Cynthia and Greg Leitich Smith, David Levithan, Kelly Link, Barry Lyga, Wendy Mass, Garth Nix, Scott Westerfield, Lisa Yee, and Sara Zarr. With illustrated interstitials from comic book artists Hope Larson and Bryan Lee O\u0027Malley, Geektastic covers all things geeky, from Klingons and Jedi Knights to fan fiction, theater geeks, and cosplayers. Whether you\u0027re a former, current, or future geek, or if you just want to get in touch with your inner geek, Geektastic will help you get your geek on!","cover":"https://allnovel.net/images/geektastic-stories-from-the-nerd-herd.jpg","author":"Holly Black","type":"Humorous","source":"allnovel","link":"https://allnovel.net/geektastic-stories-from-the-nerd-herd.html","creation":"Oct 5, 2019 8:59:23 AM","modification":"Oct 5, 2019 5:37:41 PM"}}
