{"id":63869,"no":15,"title":"Page 15","content":"“No kidding.” “No, besides the usual. Remember the view from their apartment? If she’d been at the window she could have seen him on the corner. She might even have witnessed the shooting.” “Assuming the angles were right and the view wasn’t ob-structed. I doubt you could make much out at that distance, anyway.” “I guess not. You think she’ll keep the apartment?” “I have no idea.” “Would you like to live there? Not that particular apart-ment, necessarily, but something like it?” “Way up in the sky, you mean?” “Way up in the sky with a drop-dead view. If and when we get around to moving in together—but maybe you don’t feel like talking about it now.” “No, I don’t mind.” “Well, I love this apartment, but I was thinking we might be better off someplace new. This place has an awful lot of history.” “All the times we’ve made love here.” “That’s not what I was thinking of.” “I know.” “I’m not in the game anymore, and I’m still living in the same apartment. I’m not sure that’s such a good idea. Even if we didn’t move in together, I’m not sure it’s a good idea.” “Would you sell this place?” “I could. The way the market is now, I’d probably be bet-ter off renting it out. The company that manages my other real estate holdings could take care of it.” “Ms. Rich Bitch.” “Well, I’m not going to apologize for it. I didn’t steal it and nobody left it to me. I made it the old-fashioned way.” “I know you did.” “I fucked for it. So? It’s honest work. It may not be legal but it’s honest. I worked hard and saved my money and in-vested it wisely. Are those things to be ashamed of?” “Of course not.” “I sound defensive, don’t I?” “A little,” I said, “but so what? Nobody’s perfect. Where would you want to live?” “I’ve been trying to ﬁgure that out. I like this neighbor-hood, but if the apartment’s got a history so does the neigh-borhood. What about you? You might want to keep your hotel room as an ofﬁce.” “Some ofﬁce.” “It’s a place to meet clients.” “I used to meet them in bars,” I said, “and now I meet them in coffee shops.” “Would you want to give it up?” “I don’t know.” “It’s so cheap,” she said. “Rent-controlled and all. It might be worth keeping just so that you’d have some private space when you wanted it. Living together might be less threatening if you knew you had a place of your own nearby.” “What would it be, an escape hatch?” “Maybe.” “You’d have one, too, if you rented this place instead of selling it.” “No,” she said. “Once I’m out of here, that’s it. Fifty-ﬁrst Street won’t see me again. Even if things don’t work out, even if we ﬁnd out we can’t, uh, live together, I’m never coming back here. As a matter of fact—” “Yes?” “Well, even if we’re not ready to live together, maybe I ought to think about getting out of here. It seems silly to go to the trouble of ﬁnding some interim place if we’re going to be looking for an apartment together, but I think it’s time I got the hell out.” “Why the urgency?” “I don’t know.” “Oh?” After a moment she said, “I got a phone call today. One of my old regulars.” “He didn’t know you’d retired?” “He knew.” “Oh?” “He’s called a few times over the past year. To make sure this retirement hadn’t turned out to be a passing fancy.” “I see.” “It’s understandable. Somebody sells her ass for twenty years, then takes it off the market, you don’t assume it’s permanent.” “I suppose.” “A few times he called just to chat. So he said. Well, we knew each other for years, and it was a friendly relationship, so you don’t like to tell a guy like that to shit in his hat. But I don’t need chatty conversations with former johns, either, so I always managed to cut it short. No hard feelings, gotta go, ’bye.” “Good.” “Today he asked if he could come over. No, I said, you can’t. Just to talk, he said, because he’s going through some-thing difﬁcult and he needs to talk to somebody who really knows him. Which is bullshit, because I don’t. Really know him, I mean. So I said no, you can’t come over, I’m very sorry but that’s the way it is. I’ll pay you, he says. I’ll give you two hundred dollars, just let me come over and talk.” “What did you do?” “I told him no. I told him I wasn’t in the therapy business, either, and I told him not to call me anymore. He didn’t just want to talk. You probably ﬁgured that much out on your own.” “Yes.” “He ﬁgured once he got in the door he could get in the bedroom. He ﬁgured once I took money I’d do something to earn it. But it wasn’t really about sex, it was about power. He liked the idea of getting me to do something I didn’t want to do.” “Who is he?” “What’s the difference?” “I could have a talk with him.” “No, Matt. Absolutely not.” “All right.” “If I hear further from him, but I don’t think I will, not more than once every couple of months and I can live with that. No, I don’t need to be protected. Not from this particu-lar jerk.” “If you’re sure.” “I’m sure.” “But I think you should change your number.” “When I move. New apartment, new phone number.” “Both at once.” “Right.” I thought about it. I said, “Maybe we should start looking for a new place.” “Or at least think about it. You’d prefer the neighborhood where you are now, wouldn’t you?” “Well, I’m used to it,” I said, “the same way you’re used to Turtle Bay. I’ve got certain restaurants and coffee shops I go to, and of course I’ve got my regular meetings. Mick’s joint is a short walk from me. So are Lincoln Center and Carnegie Hall and most of the city’s theaters, not that we go all that often, but it’s nice to know they’re there. “But it’s not the only part of town I like, or even my fa-vorite in a lot of ways. I like the West Village, I like Chelsea, I like Gramercy Park.” “Or farther downtown. SoHo, Tribeca.” But those places had a history of their own. “Or a little far-ther up on the West Side,” I went on. “Say the West Seven-ties. I’d be an easy walk or a short bus ride from where I am now, so I could keep the hotel room as an ofﬁce and still go to the same AA meetings. Now that I think about it, though, the possibilities are vast. We could live almost anywhere.” “Not out of Manhattan, though.” “No, deﬁnitely not.” “Unless we move to Albuquerque.” Shortly before Christmas I’d had a windfall; I took a case on a contingency basis and it paid off. When her school’s se-mester break came around after the ﬁrst of the year we’d ﬂown out to New Mexico and spent two weeks driving around the northern part of the state, much of it among the Indian pueblos. We’d both responded to the adobe architec-ture in Albuquerque and Santa Fe. “We could have a whole house there,” I said, “with swirls and minarets and curved walls. And it wouldn’t matter where it was, because we’d have to drive everywhere any-way, and whatever neighborhood we picked would be safer and more comfortable than anywhere in New York.” “Would you like to do that?” “No.” “Thank God,” she said, “because neither would I. The whole country’s full of places that are much nicer than New York and I wouldn’t want to live in any of them. And you’re the same way, aren’t you?” “I’m afraid so.” “It’s good we found each other. And if we start to yearn for the sight of adobe, we can always ﬂy out to Albuquerque for a visit, can’t we?” “Anytime we want,” I said. “It’s not going anywhere.” It must have been around midnight when we went to bed. An hour later I gave up on sleep and tiptoed out to the living room. There was a rack full of magazines and a bookcase full of books, and of course there was always the TV, but I was too restless to sit still. I got dressed and stood at the liv-ing-room window, looking at the red neon Pepsi-Cola sign across the river. New buildings had eclipsed much of her view since Elaine moved in, but you could still see the Pepsi ad. Would I miss it if we moved? Would she? Downstairs the doorman nodded wordlessly, then re-turned his gaze to the middle distance. He was a young fel-low, a recent immigrant from somewhere in the Arab world, and he always had a Walkman headset plugged into his ears. I’d assumed he was hooked on Top 40 radio until I found out one night that he listened relentlessly to self-improvement tapes that exhorted him to take charge of his life, boost his money-generating capacity, and lose weight and keep it off. I walked down First Avenue, past the UN building, clear to Forty-second Street. There I turned right, walked a block, and headed back uptown on Second Avenue. I passed a few saloons, and while they did not call to me I cannot say I was entirely unaware of their appeal. I could have looked for Mick at Grogan’s, but if I found him it meant a late night, and even if we cut it short I’d be clear over on the West Side and not much inclined to come all the way back to East Fifty-ﬁrst. Living together would solve that problem. And bring what others in its place? There’s an all-night coffee shop at the corner of Second and Forty-ninth. I took a seat at the counter and ordered a prune Danish and a glass of milk. Someone had left an early edition of the Times behind, and I started to read it but couldn’t keep my mind on what I was reading. Maybe I needed some self-improvement tapes. Develop the Hidden Powers of Your Mind! Take Charge of Your Life! I didn’t need to develop any hidden powers. I had enough brain cells left to ﬁgure out what was going on. Jan Keane had come back into my life, even as she was nearing the end of her own. She and I had almost lived to-gether, had indeed been groping in that direction, and then the relationship had instead broken down, and we had lost each other. And now Elaine and I were in a similar situation, and at a similar stage. I had space in her closet, a drawer in her dresser, and a side of her bed on which I slept several nights a week. Because this stage was transitional, because it was undeﬁned and perhaps indeﬁnable, everything had to be considered and assessed. Should I automatically put on Call Forwarding when I was going to be spending the night on East Fifty-ﬁrst? Should I apologize fervently when I forgot to disconnect it afterward? Should we have a second line installed? Or should we move? Should I keep my hotel room? Should we choose my neighborhood, or her neighborhood, or some piece of neutral ground? Should we discuss it? Should we avoid discussing it? Ordinarily all of this was tolerable enough, and some-times even amusing. But Jan was dying, and that somehow cast a yellow shadow over everything. I was afraid, of course. I was afraid that what had hap-pened to one relationship would happen to another, and that one of these days I would come for my clothes, and leave my keys behind on the kitchen counter. I was afraid the shabby little hotel room I held on to like grim death would be my home for the rest of my life, that I’d be perched on the edge of my narrow bed in my underwear when Grim Death himself came calling. That they’d have to haul me out of there in a body bag.","sourceLink":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11/page-15.html","bookId":2329,"book":{"id":2329,"title":"The Devil Knows You\u0027re Dead (Matthew Scudder #11)","description":"Storyline: The Devil Knows You\u0027re Dead (Matthew Scudder #11) When Yuppie lawyer Glenn Holtzmann sits in his penthouse gazing at the setting sun, he little imagines that within half an hour he will be dead. Everyone believes it to be a clear-cut case, but Scudder isn\u0027t convinced that the evidence or the victim are what they seem.","cover":"https://allnovel.net/images/the-devil-knows-you-re-dead-matthew-scudder-11.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:52:13 AM"}}
