{"id":63858,"no":4,"title":"Page 4","content":"“But I don’t care,” she said. “You could ﬁnd a higher IQ growing in a petri dish. I wish he would smarten up or ship out. But then I feel that way about most of the people I meet. What do you want to do now? Is there a ball game on?”\n “Let’s watch the news.”\n And we did, half watching, half listening. I paid a little more attention when the perky anchorwoman began talking about a Midtown shooting, because I still respond to local crime news like an old Dalmatian to the ringing of the ﬁre bell. When she mentioned the site of the shooting Elaine said, “That’s your neighborhood.” The next thing I knew she was reading the victim’s name off the teleprompter. Glenn Holtzmann, thirty-eight, of West Fifty-seventh Street in Manhattan.\n They went to a commercial and I triggered the remote and turned off the set. Elaine said, “I don’t suppose there’s more than one Glenn Holtzmann on West Fifty-seventh Street.”\n “No.”\n “That poor girl. The last time I saw her she had a husband and a baby on the way, and now what has she got? Should I call her? No, of course not. I didn’t call her when she lost the baby and I shouldn’t call her now. Or should I? Is there any-thing we can do?”\n “We don’t even know her.”\n “No, and she’s probably surrounded by people right now. Cops, reporters, ﬁlm crews. Don’t you think?”\n “Either that or she hasn’t heard yet.”\n “How could that be? Don’t they hold back the name of the victim pending notiﬁcation of next of kin? You hear them say that all the time.”\n “They’re supposed to,” I said, “but sometimes somebody screws up. It’s not supposed to happen that way, but lots of things happen that aren’t supposed to.”\n “Isn’t that the truth. He wasn’t supposed to get shot.”\n “What do you mean?”\n “Well, for God’s sake,” she said. “He was a bright young guy with a good job and a great apartment and a wife who was crazy about him, and he went out for a walk and—did they say he was making a phone call?”\n “Something like that.”\n “Probably to ﬁnd out if she needed anything from the cor-ner deli. God, do you ﬁgure she heard the shots?”\n “How do I know?”\n She frowned. “I just ﬁnd the whole thing very disturbing,” she said. “It’s different when you know the person, isn’t it? But that’s not all. It just seems wrong.”\n “Murder’s always wrong.”\n “I don’t mean morally wrong. I mean in the sense of a mistake, a cosmic error. He wasn’t the kind of person who gets shot down on the street. Do you know what this means? It means we’re all in trouble.”\n “How do you ﬁgure that?”\n “If it could happen to him,” she said, “it could happen to anybody.” The whole city saw it that way.\n The morning papers were full of the story. The tabloids led with it, and even the Times stuck it on the front page. Lo-cal television stations gave it the full treatment; several of them had studios within a few blocks of the murder scene, which gave it a little added impact for their employees, if not for their viewers.\n I didn’t stay glued to the set myself, but even so I saw in-terviews with Lisa Holtzmann, with people from the neigh-borhood, and with various police ofﬁcials, including a detective from Manhattan Homicide and the precinct com-mander at Midtown North. All the cops said the same thing—that this was a terrible crime, that such outrages could not be allowed to go unpunished, and that all available police personnel would be working the case in around-the-clock shifts until the killer was in custody.\n It didn’t take long. The ofﬁcial estimate of the time of death was 9:45 Thursday night, and within twenty-four hours they were able to announce an arrest. “Suspect charged in Hell’s Kitchen homicide,” the newsbreaks chirped. “Film at eleven.”\n And at eleven we watched the ﬁlm. We saw the suspect with his hands cuffed behind him, his face pointed toward the camera, his eyes wide and staring.\n “Jesus, will you look at him,” Elaine said. “The man’s a walking nightmare. Honey, what’s the matter? You can’t possibly know him.”\n “I don’t know him,” I said, “but I recognize him from the neighborhood. I think his name is George.”\n “Well, who is he?”\n I couldn’t answer that, but they could and did. His name was George Sadecki, and he was forty-four years old, unem-ployed, indigent, a Vietnam veteran, a ﬁxture in the West Fifties. He had been charged with second-degree murder in the shooting death of Glenn Holtzmann.\n Chapter 4\n Saturday morning I rented a car and we got out of the city and drove a hundred miles up the Hudson. We stayed three nights at a refurbished colonial inn in Columbia County, sleeping in a canopied four-poster bed in a room that had a dry sink and a porcelain chamber pot, but no television. We didn’t look at TV or read a newspaper all the time we were there.\n It was Tuesday afternoon by the time we got back to New York. I dropped Elaine and turned in the car, and when I got to my hotel there were two old guys in the lobby discussing the Holtzmann shooting. “I seen the killer around for years,” one was saying. “Wiping windshields, hustling spare change. All along I said there was something wrong with the son of a bitch.You live in this town, you develop an instinct.”\n The Slaughter on Eleventh Avenue, as one of the tabloids felt compelled to call it, was still very much in the news, even in the absence of continuing developments in the case. Two elements combined to give it a hold on the public imag-ination: The victim was a young urban professional, the sort of person to whom such things were not supposed to hap-pen, and the killer was a particularly unattractive soldier in the vast army of the homeless.\n The homeless had been with us a little too long, and their numbers had grown too great. What charity fund-raisers call “compassion fatigue” had long since set in. Something within us made us long to hate the homeless, and now we had been given good reason. We had always sensed that they represented some sort of low-grade danger. They smelled bad, they had diseases, they were louse-ridden. Their pres-ence gave rise to guilt, coupled with the disquieting intima-tion that the whole system was failing, that they were in our midst because our civilization was falling apart around them.\n But who would have dreamed that they might be armed and dangerous, apt to come out shooting?\n Round ’em up, for God’s sake. Get them off the streets. Get rid of them.\n The story stayed in the news all week, but lost some of its hold when the suicide of a prominent real estate developer took over the headlines. (He invited his attorney and two close friends to his penthouse apartment, served them a round of drinks, said, “I wanted you here as witnesses, so there won’t be any of the usual horseshit about foul play.” Then, before they’d had time to digest what he’d said, he walked out onto the terrace and vaulted the railing, plunging sixty-two stories in utter silence.)\n Friday night Elaine and I wound up at her place. She made pasta and a salad and we ate in front of the television set. A woman on the late news tried to segue from one story to the other by contrasting the developer, who presumably had everything to live for but took his own life, and George Sadecki, who had nothing to live for yet took another man’s life. I said I didn’t quite see the connection, and Elaine said it was the only way to get both men into the same paragraph.\n Then they ran a taped interview with a man identiﬁed only as Barry, a rawboned black man with white hair and hornrimmed glasses, whom they described as a friend of the alleged killer.\n George, he said, was a mellow dude. Liked to sit on benches, go for walks. Didn’t bother people and didn’t care for people to bother him.\n “What a revelation,” Elaine said.\n George didn’t like panhandling, Barry went on. Didn’t like to ask nobody for nothing. When he wanted money for beer he’d collect aluminum cans and bring them back for de-posit. He always put the rest of the trash back neat so folks wouldn’t get upset.\n “An environmentalist,” she said.\n And he was always peaceable, Barry said. Had George ever said anything about owning a gun? Well, Barry thought he might have said something along those lines. But, see, George said a lot of stuff. George’d been in Vietnam, see, and sometimes he got confused about then and now. He might be saying he did something, and it sounds like he’s talking about yesterday, and it’s something he maybe did twenty years ago, if he even did it at all. Like what? Well, like burning up huts with a ﬂamethrower. Like shooting peo-ple. When it came down to huts and ﬂamethrowers you knew it was twenty years ago if it happened at all, because huts and ﬂamethrowers didn’t turn up much around West Fifty-seventh Street. But shooting people, well, that was something else.\n “This is Amy Vassbinder in Hell’s Kitchen,” the reporter said, “where there are no huts and ﬂamethrowers, but where shooting people is something else.”\n Elaine hit the Mute button. “I notice they’re calling it Hell’s Kitchen again,” she said. “What happened to Clin-ton?”\n “When it’s a story about rising property values,” I said, “then the neighborhood is Clinton. That’s when they’re talk-ing gentriﬁcation and tree planting. When it’s gunshots and crack vials, then it’s Hell’s Kitchen. Glenn Holtzmann lived in a luxurious high-rise apartment in Clinton. He died a cou-ple of blocks away in Hell’s Kitchen.”\n “I ﬁgured it was something like that.”\n “I’ve seen Barry before,” I said. “George’s friend.”\n “Around the neighborhood?”\n “And at meetings.”\n “He’s in the program?”\n “Well, he’s been around it. Obviously he’s not sober. You just saw him drinking a beer on camera. He may be one of those guys who stays sober between drunks or he may just come around now and then for the coffee and the compan-ionship.”\n “Do a lot of people do that?”\n “Sure, and some of them wind up getting sober. Some aren’t alcoholic at all, they’re just looking to get in out of the cold. That’s a problem for some AA groups, especially now that there are so many people living on the street. They’ve stopped serving coffee and cookies at certain meetings be-cause the refreshments tend to draw too many people who don’t belong. It’s a tough one, because you don’t want to ex-clude anybody, but you want to make sure there’s a seat available for the alcoholic who wants help.”\n “Is Barry an alcoholic?”\n “Probably,” I said. “You heard him tell the world how he spends his life on a park bench with a beer in his ﬁst. On the other hand, the acid test is whether or not alcohol makes your life unmanageable, and only Barry could tell you that. He might say he’s managing just ﬁne, and maybe he is. Who am I to say?”\n “What about George?”\n I shrugged. “I don’t think I ever saw him at a meeting. I guess we can call his life unmanageable. His dress and grooming might pass for eccentricities, but when you gun down strangers on the street it tends to suggest that some-thing’s not working. But was it the beer that did it? I have no idea. I suppose he could have scavenged enough empty cans to drink himself into a blackout, but he could just as easily have been cold sober and decided that Glenn Holtzmann was Ho Chi Minh’s kid sister. The poor son of a bitch.”\n “Barry said he was mellow.”\n “He probably was,” I said. “Until last week, when he got a little tense.”\n I stayed the night and didn’t get back to my hotel until some-time the following afternoon. I stopped at the desk for my mail and messages and went on up to my room. A Mr. Thomas had called twice, once the night before and again at ten-thirty that morning. He had left a number with a 718 ex-change, which would put him in Brooklyn or Queens. I didn’t recognize the number, nor did the name mean any-thing to me.\n The other message, logged at eleven the previous evening, was from Jan Keane, and the number she had left was one I recognized. I spent a long moment looking at the eight let-ters of her name, the seven digits of her number. I hadn’t di-aled that number in quite a while, but if she hadn’t left it I don’t think I would have had to look it up.\n I wondered what she wanted.\n It could be anything at all, I told myself. It was probably\n AA-related. Maybe she was serving as program chairman at a meeting in SoHo or Tribeca and wanted to book me to speak. Maybe she’d run into a newcomer whose story was similar to mine and thought I might be able to help him.\n Or maybe it was personal. Maybe she was getting married and wanted to let me know.\n Maybe she’d ended a relationship, and for some reason wanted me to know that.\n Easy enough to ﬁnd out. I picked up the phone and dialed her number. Her machine kicked in on the fourth ring, and her recorded voice invited me to leave a message at the tone. I had just started to do so when her actual unrecorded voice cut in. I waited while she disengaged the machine and then she was back on the line, asking me how I was.\n “Alive and sober,” I said.\n “ ‘Alive and sober.’ Is that still your standard response?”\n “Only to you.” \n","sourceLink":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11/page-4.html","bookId":2329,"book":{"id":2329,"title":"The Devil Knows You\u0027re Dead (Matthew Scudder #11)","description":"Storyline: \n The Devil Knows You\u0027re Dead (Matthew Scudder #11) \n When Yuppie lawyer Glenn Holtzmann sits in his penthouse gazing at the setting sun, he little imagines that within half an hour he will be dead. Everyone believes it to be a clear-cut case, but Scudder isn\u0027t convinced that the evidence or the victim are what they seem.\n \n","cover":"https://allnovel.net/images/the-devil-knows-you-re-dead-matthew-scudder-11.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:52:13 AM"}}
