{"id":63895,"no":41,"title":"Page 41","content":"“No, but I’ve been busy. But I suppose it can wait until tomorrow.”\n “No,” she said. “It’s all right.”\n “Are you sure?”\n “It’s all right,” she said.\n Chapter 25\n “He was killed by accident,” I told Elaine. “That’s how it looked from the beginning, that’s how the police saw it. A guy from the twenty-eighth ﬂoor in the wrong place at the wrong time, a guy in a suit taking a walk on the wild side.\n “They thought he ran into George Sadecki, and no matter how hard I tried I could never completely rule that out. But there was something wrong about Glenn Holtzmann, and the more I learned about him the more likely it seemed that he’d furnished somebody with a much better reason to kill him than poor George ever had. And the killing certainly felt purposeful to me. That last shot into the back of the head didn’t seem characteristic of a mugging gone wrong, or a panhandler turned nasty. It was an execution. It was the sort of thing you don’t do unless you damn well want some-body dead.”\n “And that’s what it was after all,” she said.\n “That’s exactly what it was. Nicholson James had what he must have felt was a very good reason to take out Roger Prysock, and that’s what he thought he was doing when he killed Glenn. Then, when George shufﬂed along to take the rap for him, he must have felt God was watching over him. And of course he never went and told anyone what he’d done, because shooting the wrong fellow by mistake isn’t good bragging material in the bars. He’d killed a stranger and another stranger was in custody for it, so it was the eas-iest thing in the world to pretend it never happened.\n “Then Prysock turned up, ﬁguring it was safe to come home, and Nicholson James found out about it and hit the Replay button. Same M.O., pay phone, three in the chest and a coup de grâce, only this time he got the right guy.”\n “And nobody made the connection?”\n “No reason they should,” I said. “There have been close to ﬁve hundred homicides in the ﬁve boroughs between Holtz-mann’s murder and Prysock’s. Most of those have come as the result of gunﬁre, and a lot of them have taken place on the street. The similarities are striking, but you only see them if the Holtzmann killing is in the forefront of your mind, and every cop involved had other things to think about. Remember, Prysock was killed on the other side of town. Nobody on that case had had any connection to the Holtzmann case. And don’t forget, Holtzmann’s death was history. The case was closed, the perpetrator had not only been arrested but he was actually dead and gone. If you found a husband and wife murdered with an ax, you might think of Lizzie Borden. But you wouldn’t try to make a case against her.”\n “I see what you mean.”\n “There was really only one person around who should have heard the penny drop. That was me, because I never really bought the idea that George did it. And, no matter how many homicides there’d been in the past few months, I had only one of them on my mind. So if anyone was going to draw a connection between Holtzmann and Prysock, it was me.”\n “And you did.”\n “No,” I said, “that’s the point. I didn’t. The report of the Prysock killing ran in all four local papers, so I read it at least once. I obviously read it, because I remembered it a couple of days later. It even rang a bell, but I managed not to hear it.”\n “Why?”\n “Because I went conveniently deaf. Irish deaf, my aunt Peg used to say. That’s when you don’t hear what you don’t want to hear.”\n “Why didn’t you want to hear it?”\n “I’ll tell you how I overcame my Irish deafness, and that should give you an idea of what caused it. After I left here last night I went to the midnight meeting at Alanon House. Then I went over to see Mick.”\n I told her about the hours I’d spent at Grogan’s, and re-capped the part of our conversation that had to do with Glenn Holtzmann. And I told her how the two of us had watched the sky turn light, and how we’d gone to St. Bernard’s for the butchers’ mass.\n “But Mick was the only man there in a white apron,” I said. “It was pretty much just us and the nuns.”\n “You thought he’d killed Holtzmann,” she said.\n “I was afraid of it. It was one of the ﬁrst thoughts that struck me when I ﬁnally reached somebody in Altoona who could tell me where the money for law school came from. Here was Holtzmann, a career rat, and here was my friend Mick, with his car and his home and his place of business all deeded to other people so the government couldn’t seize them. And he talked about it all the time, how they’d conﬁs-cate your assets if they could prove you had any, how his lawyer wanted him to make sure he didn’t lose the farm if his tenants died on him and willed it to somebody else.\n “I ran into Glenn once at Grogan’s. I was drinking a Coke at the bar and he thought it was a glass of Guinness, which shows how well he blended in at your basic Hell’s Kitchen saloon. But he knew who owned the place, and he was full of questions about Butcher Ballou until I told him it was bad form to ask them. But that didn’t mean he wouldn’t have asked other people, and he might have learned something, and might have tried to use what he’d learned.\n “Now it didn’t really make sense to ﬁgure Mick killed him. Glenn did what he did in the shadows, and the two peo-ple he screwed that we know about never even knew what hit them. He certainly wouldn’t have exposed himself to a man known to all as a stone killer. And if Mick did somehow get wind of what he was up to, it would have been the easi-est thing in the world to warn him off.\n “Here’s where I went wrong,” I said. “Instead of thinking it through, I shut down. I grabbed hold of the idea that my work was complete because I’d done all I could for both my clients. Lisa Holtzmann’s money was safe and there was nothing more I could do for George Sadecki. And I had no leads to the real killer, so I could stop looking for him.\n “Meanwhile, it gnawed at me. I couldn’t stay out of Gro-gan’s. I was seeking out Mick’s company every couple of days, and I would sit up with him and never talk about what was foremost on my mind. And, as far as that goes, it wasn’t foremost on my mind, not consciously, because I wasn’t let-ting myself think about it.\n “Then Nicholson James shot Roger the Dodger. And I read the goddamn story, and it didn’t even register.”\n “And then you went and talked with Mick.”\n “I went and talked with him,” I said, “and somehow the subject of Glenn Holtzmann came up.” No need to say how that had come about. “And what he said made it abundantly clear that I’d let my anxiety keep me from thinking straight. And, miraculously, I began to remember that I’d read some-thing recently that rang a bell. I didn’t know what it was, butI knew it was something.”\n “Funny how minds work.”\n “You said it.”\n “Suppose he’d done it,” she said.\n “Mick?”\n She nodded. “Suppose he admitted it, or suppose you came across some evidence that was absolutely unequivocal. Then what?”\n “You mean what would I have done about it?”\n “Uh-huh.”\n I didn’t have to think it through. “I wouldn’t have done a thing,” I said. “The case was closed and I was through with it.”\n “It wouldn’t have bothered you that he was getting away with murder?”\n “I’d hate to guess how many murders Mick has gotten away with,” I said. “I was an eyewitness to one of them and he’s told me about plenty of others. If I can swallow all that, why should one more killing stick in my throat?”\n “Even if it’s one that involves you?”\n “How am I involved? Because I was vaguely acquainted with the victim? Because the case dropped into my lap after the fact? It’s not as though he would have killed somebody close to me, or as if the act itself were particularly repre-hensible. If he had killed Glenn, I’d have said he had good reason.”\n “So suspecting him didn’t change how you felt toward him.”\n “Not really, no.”\n “And it didn’t affect your relationship.”\n “Why should it?”\n “But you went to mass with him this morning,” she said.\n “And you haven’t done that in a long time.”\n “You Jewish girls,” I said. “You don’t miss a trick.”\n “Well?”\n “I guess you’re right,” I said. “I guess I wouldn’t allow myself to participate in that little ritual of ours as long as I suspected him. And once the suspicion was lifted I guess I felt a need to mark the occasion.”\n “And then you remembered the news item.”\n “I remembered that there was an item, and that it was re-cent. I read through back issues until I found what I was looking for. Then I started digging. The minute Julia men-tioned a pimp named Zoot, I thought of the one person I re-membered seeing in a zoot suit. That was Nicholson James, and I’d seen him talking with Danny Boy when I was work-ing that abduction case. Kenan Khoury’s wife. You remem-ber.”\n “Of course.”\n “I talked to Danny Boy afterward, and he didn’t even know there was bad blood between the two pimps, so it was good luck that Julia happened to know. But this whole busi-ness hasn’t exactly been overﬂowing with good luck, so I’ll take it.”\n “I don’t blame you,” she said. “God, you look tired, honey. I’d offer you more coffee but that’s probably the last thing you need.”\n “You’re probably right.”\n “I’m tired myself,” she said. “I didn’t get much sleep last night. I’ve had a lot on my mind lately.”\n “I know.”\n “I got scared when you called. Saying you’d been up all night and that you needed to talk to me. I was afraid of what you were going to say.”\n “I just wanted to tell you what happened.”\n “I know.”\n “And I didn’t want to go to sleep by myself.”\n “Well, you don’t have to,” she said. When I got into bed the thought came to me that, tired as I was, I was going to have trouble drifting off. The next thing I knew, sunlight was streaming in the bedroom window and the smell of fresh coffee permeated the apartment.\n I was having my second cup when the phone rang. Elaine answered it, and I looked over at her and watched her face change. “Just a moment,” she said. “He’s right here.”\n She covered the mouthpiece and said, “It’s for you. It’s Janice Keane.”\n “Oh?”\n She handed me the phone and stalked out of the room. I’d have gone after her but I had the goddamn telephone in my hand. I said, “Hello?”\n “Matthew, I’m sorry, I picked a bad time, didn’t I?”\n “It’s all right.”\n “Do you want to call me back?”\n “No,” I said. “It’s okay.”\n “If you’re sure,” she said. “Because it’s nothing urgent, except insofar as everything has acquired a certain urgency. I had a moment of what I’d have to call enlightenment yes-terday, not long after you left. I almost called you then but I wanted to sleep on it and see if it was still there in the morning.”\n “And is it?”\n “Uh-huh. And I wanted to share it with you, because it in-volves you, sort of.”\n “Oh?”\n “I’m not going to kill myself,” she said. “I’m not going to use that gun you brought me.”\n “Really.”\n “Yes. Do you want to know what happened? After you left I looked in the mirror, and I couldn’t believe how lousy I looked. And I thought, well, so what? I can live with it. And I suddenly realized that I could live with whatever came along, for as long as I had to. I might not be able to do anything about it, but I could live with it, I could endure it.\n “And this was news,” she said. “There are things I can’t control, like the pain and my appearance, and the com-pletely unacceptable fact that I’m not going to be able to get out of this one alive. The gun gave me a kind of control. If I didn’t like the way things were going I could always pull the plug. But who says I have to be in control, and who ever controls anything in this life in the ﬁrst place? Oh, hell, I can stand a little pain. You never get more than you can handle, isn’t that what they say?” \n","sourceLink":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11/page-41.html","bookId":2329,"book":{"id":2329,"title":"The Devil Knows You\u0027re Dead (Matthew Scudder #11)","description":"Storyline: \n The Devil Knows You\u0027re Dead (Matthew Scudder #11) \n When Yuppie lawyer Glenn Holtzmann sits in his penthouse gazing at the setting sun, he little imagines that within half an hour he will be dead. Everyone believes it to be a clear-cut case, but Scudder isn\u0027t convinced that the evidence or the victim are what they seem.\n \n","cover":"https://allnovel.net/images/the-devil-knows-you-re-dead-matthew-scudder-11.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:52:13 AM"}}
