{"id":10059,"no":27,"title":"CHAPTER XXVI. THE COUNT’S SECRET.","content":"On the morning after Alphonso Jones had enjoyed his memorable interview with the Count Ernest de Montmorency, he bore himself in a loftier and more consciously superior manner than usual. He felt that he was entitled to a larger measure of consideration, on account of his intimacy with one of the nobility. \n \n “The count must have seen something in me, or he would not have invited me to visit him at his chateau,” reflected Alphonso. \n \n It was natural that Mr. Jones should wish his friends to be aware of his social distinction. \n \n “Good-morning, Mr. Kidder,” he said, in a patronizing manner, to his fellow-clerk. “How did you enjoy the theatre last evening?” \n \n “Very well. The play was a good one, and well performed.” \n \n 237“I also passed the evening in a very agreeable manner,” remarked Alphonso, complacently. \n \n “Where were you?” \n \n “In Mr. Ingalls’ room.” \n \n “Oh, yes, I forgot. What company did he have in? Didn’t you say something of a French count being expected?” \n \n “The Count Ernest de Montmorency was present,” said Alphonso, dwelling with unction on the high-sounding syllables. \n \n “How did you like him?” asked Kidder, who had received a brief note from Mr. Ingalls, letting him into the secret. \n \n “I never met a more high-toned gentleman,” said Mr. Jones, enthusiastically. “His manners were most courtly, and I may add that he was very affable to me.” \n \n “Ingalls ought to have invited me,” said Mr. Kidder, affecting to feel slighted. \n \n “He will doubtless remember you another time,” said Alphonso; “probably the count does not like a large company.” \n \n 238“I suppose he is just like other men,” said Kidder, by way of drawing out his fellow-clerk. “If you hadn’t known him to be a count, you wouldn’t have seen anything particular in him.” \n \n “I beg to differ with you,” said Alphonso, with an air of superior information. “Some persons might have thought so; but I claim to be a judge of men, and I at once saw that he was a high-toned aristocrat.” \n \n “What did you judge from, now?” asked Kidder, amused. \n \n “I cannot explain what,—it was that the French call je ne sais quoi,” answered Mr. Jones, who had been studying up some French phrases that very morning. \n \n “Genesee squaw!” echoed Kidder, purposely misunderstanding him. “What on earth has a French count to do with a Genesee squaw?” \n \n “I pity your ignorance, Mr. Kidder,” said Alphonso, mildly. “The words I used were French, and mean, ‘I don’t know what.’” \n \n “You don’t know what they mean? Then why do you use them?” \n \n 239“You misunderstand me again. Je ne sais quoi means I—do—not—know—what. Do you see it now?” \n \n “Oh, that’s it. I didn’t know you were such a French scholar, Mr. Jones.” \n \n “I am a poor French scholar,” said Alphonso, modestly; “but I shall try to make myself familiar with the language before I go to France.” \n \n “Are you going to France? How long has that been in your mind?” \n \n “To tell the truth, Mr. Kidder, I never thought seriously of it till last evening. But since the Count de Montmorency has been kind enough to invite me to visit him at his chateau, and become acquainted with his noble family, I feel that it is quite worth my while to prepare myself to converse with them.” \n \n “You don’t say so! What a lucky fellow you are! Did the count really invite you?” \n \n “He invited me in the most affable and friendly—I may say urgent manner,” said Alphonso, complacently. \n \n “Couldn’t you get me an invitation, too?” asked 240Kidder, in pretended anxiety. “I’ve been long wanting to go abroad, and I think my father would consent, if I received such an invitation as that.” \n \n “I should like to oblige you, Mr. Kidder, but really I couldn’t venture on such a liberty,” said Alphonso, decidedly; for he feared that his fellow-clerk, who was better-looking than himself, might interfere with his matrimonial designs upon the count’s high-born sister. \n \n “Perhaps the count will invite me himself. I’ll get Ingalls to introduce me.” \n \n “Possibly,” said Alphonso, coldly; “but I wouldn’t obtrude myself upon his lordship.” \n \n “I don’t see why I shouldn’t be introduced as well as you.” \n \n Alphonso, who privately considered himself more high-toned than Kidder, felt that there was good reason, but did not think it policy to pursue the subject. \n \n Probably Mr. Jones referred to the Count Ernest de Montmorency at least thirty times that day, and succeeded in arousing the curiosity and envy of such 241of his acquaintances as were not in the secret. He indulged in many a gorgeous day-dream, in which he figured as the brother-in-law of the count, with a beautiful chateau of his own, and this continued for several days. But his dreams were destined to a rude awakening. \n \n One evening, in passing through Bleeker Street, Mr. Jones strolled into a barber shop, which he had never before entered. He glanced carelessly about him, when he made a sudden start, and gasped for breath. There, behind a barber’s chair, in the act of shaving a red-headed man, was the elegant Count Ernest de Montmorency! \n \n The count looked up and met Alphonso’s astonished gaze. \n \n “Good-evening, M. Alphonse,” he said, with a nod and a smile. \n \n “Good-evening,” ejaculated Alphonso, with difficulty. \n \n How could he say “my lord count” to a barber? \n \n “Are you the—the—gentleman I met at the room of my friend, Mr. Ingalls?” asked Mr. Jones. \n \n 242“The same. I will explain hereafter,” said the count, mysteriously. \n \n Alphonso succeeded the red-headed man in the chair presided over by the count. \n \n “I am incognito,” said the latter, in a low voice. “I have been reduced to poverty by the rascality of a relative. They don’t know me here in the shop.” \n \n “You don’t say so!” ejaculated Mr. Jones, much impressed. \n \n “They think I am a common man. It would not do to tell them.” \n \n “Does Mr. Ingalls know?” asked Alphonso. \n \n “Yes, he knows how I am reduced; but he does not respect me the less. May I rely upon your secrecy, also?” \n \n “Certainly, my lord—I mean, sir,” said Mr. Jones, beginning to think it was all right again. “Do you think you will ever recover your estates?” \n \n “Don’t speak so loud! Yes, I am almost sure of it. In that case, I shall expect you to visit me at my chateau.” \n \n 243“Thank you. I shall be most happy.” \n \n “How strange it seems to be shaved by a count!” thought Alphonso. “But I really wish he wasn’t a barber. Couldn’t he get something else to do?” \n \n “How is your friend, the Count de Montmorency, Mr. Jones?” asked Mr. Kidder, the next morning. \n \n “I believe he is well,” said Alphonso, shortly. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1888/54507.html","bookId":793,"book":{"id":793,"title":"Shifting For Himself","description":"简介： Shifting for Himself records the experiences of a boy who, in the course of a preparation for college, suddenly finds himself reduced to poverty. He is obliged to leave his books, and give up his cherished plans. How cheerfully Gilbert Greyson accept...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1888","creation":"Aug 1, 2019 12:19:31 AM","modification":"Aug 1, 2019 12:19:31 AM"}}
