{"id":68048,"no":40,"title":"Page 40","content":"Briefly, his eyes met Heather’s. After all this time, she still couldn’t quite believe that he had planned Panic, or forgive him for not having told her. She would never have guessed in a million years: her Bishop, her best friend, the boy who used to dare her to eat her scabs and then almost throw up when she did.\\n\\n But that was the point. He was the same, and different. And that made her hopeful in a way. If people changed, it meant that she was allowed to change too. She could be different.\\n\\n She could be happier.\\n\\n Heather would be happier—was happier already.\\n\\n “It isn’t that high,” Lily said. She squinted. “How’d you get all the way up there?”\\n\\n “Climbed,” Heather said. Lily opened her mouth soundlessly.\\n\\n “Come on, Lily!” Nat was standing by the water, shimmying out of her shorts. Dodge stood a short distance away, smiling out over the river, watching her. “Race you into the water!”\\n\\n “No fair!” Lily ran, kicking up sand, struggling out of her T-shirt at the same time.\\n\\n Heather and Bishop lay down on the blanket together, on their backs. She rested her head on his chest. Every so often, he ran his fingers lightly through her hair. For a while they didn’t speak. They didn’t need to. Heather knew that no matter what, he would always be hers, and they would always have this: a perfect day, a temporary reprieve from the cold.\\n\\n Heather had started to drift off to sleep when Bishop stirred. “I love you, Heather.”\\n\\n She opened her eyes. She was warm and lazy. “I love you, too,” she said. The words came with no trouble at all.\\n\\n He had just kissed her—once, lightly, on the top of her head; and then, when she tilted her face to his, harder, on the lips—when Lily began to shout.\\n\\n “Heather! Heather! Look at me! Heather!”\\n\\n Lily was standing at the very top of the rocks. Heather hadn’t seen her climbing; she must have been quick. Heather felt a pulse of fear.\\n\\n “Get down!” she called.\\n\\n “She’s fine,” Dodge said.\\n\\n He was now standing in the water with Nat—Heather couldn’t believe Nat had managed to convince him to swim, or that he even owned a bathing suit. One arm was wrapped around Nat’s waist. They looked amazing together, like statues carved from different-colored rocks.\\n\\n “Watch me!” Lily crowed. “I’m going to jump!”\\n\\n She did; without hesitating, Lily threw herself into the air. For a second she seemed to be suspended there, legs and arms splayed, mouth open and laughing. Then she was hitting the water and surfacing, spitting out a mouthful of water, calling, “Did you see? I wasn’t scared. Not at all.”\\n\\n A feeling of joy flooded Heather, made her feel light and dizzy. She was on her feet and plunging into the water before Lily could reach the shore, splashing past Nat, who shrieked, tackling her sister as she tried to stand up and dragging her back into the water.\\n\\n “You weren’t scared, huh?” Heather attacked Lily’s bare stomach as Lily wriggled away from her, squealing with laughter, calling for Bishop’s help. “Are you scared of being tickled, huh? Are you?”\\n\\n “Bishop, help me!” Lily screamed, as Heather wrapped her in a bear hug.\\n\\n “I’m coming, Bill!” Then Bishop was sloshing in after them, pulling Heather backward so they collapsed together into the water. She came up spluttering, laughing, pushing him off.\\n\\n “You can’t get rid of me that easily,” Bishop said. He kept his arms around her waist. His eyes were the same blue-green as the water. Her Bishop. Her best friend.\\n\\n “Children, children, don’t fight,” Nat said, teasing.\\n\\n The wind lifted goose bumps on Heather’s skin, but the sun was warm. She knew that this day, this feeling, couldn’t last forever. Everything passed; that was partly why it was so beautiful. Things would get difficult again. But that was okay too.\\n\\n The bravery was in moving forward, no matter what. Someday, she might be called on to jump again. And she would do it. She knew, now, that there was always light—beyond the dark, and the fear, out of the depths; there was sun to reach for, and air and space and freedom.\\n\\n There was always a way up, and out, and no need to be afraid. \\n\\n","sourceLink":"https://allnovel.net/panic/page-40.html","bookId":1721,"book":{"id":1721,"title":"Panic","description":"Storyline: Panic began as so many things do in Carp, a dead-end town of 12,000 people in the middle of nowhere: because it was summer, and there was nothing else to do. \\n Heather never thought she would compete in Panic, a legendary game played by graduating seniors, where the stakes are high and the payoff is even higher. She’d never thought of herself as fearless, the kind of person who would fight to stand out. But when she finds something, and someone, to fight for, she will discover that she is braver than she ever thought. \\n Dodge has never been afraid of Panic. His secret will fuel him, and get him all the way through the game, he’s sure of it. But what he doesn\u0027t know is that he’s not the only one with a secret. Everyone has something to play for. \\n For Heather and Dodge, the game will bring new alliances, unexpected revelations, and the possibility of first love for each of them—and the knowledge that sometimes the very things we fear are those we need the most.\\n","cover":"https://allnovel.net/images/panic.jpg","author":"Lauren Oliver","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/panic.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:07:07 AM"}}
