{"id":66544,"no":14,"title":"Page 14","content":"40 I came out of the front of the hotel and looped back through the dog-leg alley between the pharmacy and the hardware store and came out the other end between the loan office and Brannan\u0027s bar. Where Janice May Chapman\u0027s body had been found. The sand pile was still there, dry and crusted and powdery and a little redistributed by the breeze. I stepped around it and checked activity on the one-sided street. Not much was going on. Some of the bars were closed, because the base was closed. No point in opening without customers. A simple economic calculation. But Brannan\u0027s bar was open. Defiantly optimistic, or maybe just maintaining some longstanding tradition. I went in and found nobody there except two similar guys fussing with stuff in the drinks well. They looked like brothers. Middle thirties, maybe two years apart, like Joe and me. Wise to the ways of the world, which was going to give me the advantage. Their place was like a thousand base-town bars I had seen before, a complex boxed-in machine designed to turn boredom into cash. It was a decent size. I guessed it had been a small restaurant in the past, but small restaurants make big bars. The decor was maybe a little better than most. There were travel posters on the walls, of the world\u0027s great cities photographed at night. No local stuff, which was smart. If you\u0027re stuck for six months in the back of beyond, you don\u0027t want to be reminded of it at every turn. \"Got coffee?\" I asked. They said no, which didn\u0027t surprise me very much. I said, \"My name is Jack Reacher and I\u0027m an MP with a dinner date coming up.\" They didn\u0027t follow. I said, \"Which means that usually I\u0027d have time to hang around all night and weasel stuff out of you in the normal course of conversation, but I don\u0027t have time for that on this occasion, so we\u0027ll have to rely on a straightforward question-and-answer session, OK?\" They got the message. Base-town bar owners worry about MPs. Easiest thing in the world to put a particular establishment on a local no-go list, for a week, or a month. Or forever. They introduced themselves as Jonathan and Hunter Brannan, brothers, inheritors of a business started by their grandmother back in the railroad days. She had sold tea and fancy cakes, and she had made a nice living. Their father had switched to alcohol when the trains stopped and the army arrived. They were a nice enough pair of guys. And realistic. They ran the best bar in town, so they couldn\u0027t deny they saw everybody from time to time. \"Janice Chapman came here,\" I said. \"The woman who got killed.\" They agreed that yes, she did. No evasion. Everyone comes to Brannan\u0027s. I asked, \"With the same guy every recent time?\" They agreed that yes, that was the case. I asked, \"Who was he?\" Hunter Brannan said, \"His name was Reed. Don\u0027t know much about him apart from that. But he was a big dog. You can always tell, by the way the others react.\" \"Was he a regular customer?\" \"They all are.\" \"Was he in here that night?\" \"That\u0027s a tough question. This place is usually packed.\" \"Try to remember.\" \"I would say he was. For the early part of the evening, at least. I don\u0027t recall seeing him later.\" \"What car does he drive?\" \"Some old thing. Blue, I think.\" I asked, \"How long has he been coming here?\" \"A year or so, I guess. But he\u0027s one of the in-and-out guys.\" \"What does that mean?\" \"They\u0027ve got a couple of squads over there. They go somewhere, and then they come back. A month on, a month off.\" \"Did you see him with previous girlfriends?\" Jonathan Brannan said, \"A guy like that, he always has arm candy.\" \"Who in particular?\" \"Whoever was the prettiest. Whoever was willing to put out, I guess.\" \"Black or white?\" \"Both. He\u0027s pretty much an equal opportunities type of guy.\" \"Remember any names?\" \"No,\" Hunter Brannan said. \"But I remember feeling pretty jealous a couple of times.\" I went back to the hotel. Two hours until dinner. I spent the first hour taking a nap, because I was tired, and because I was figuring I wouldn\u0027t be sleeping again too soon. Hoping I wouldn\u0027t be, anyway. Hope springs eternal. I woke myself up at eight o\u0027clock and unpacked my new shirt. I brushed my teeth with water and chewed some gum. Then I took a long hot shower, plenty of soap, plenty of shampoo. I put on my new shirt and rolled the sleeves level with my elbows. The shirt was tight across the shoulders, so I left the top two buttons undone. I tucked the tails into my pants and put my shoes on and shined them one at a time against the backs of my calves. I checked the mirror. I looked exactly like a guy who wants to get laid. Which I was. There was nothing to be done about it. I dumped my old shirts in the trash can and left my room and went down the stairs and stepped out to the darkness of the street. A voice from the shadows behind me said, \"Hello again, soldier boy.\" 41 Ahead of me across the street were three pick-up trucks parked at the curb. Two that I recognized, and one that I didn\u0027t. All the doors were open. Legs were dangling. Cigarettes were glowing. Smoke was drifting. I stepped left and half-turned and saw the alpha dog. The McKinney cousin. His face was still a mess. He was standing under one of the hotel\u0027s busted lamps. His arms were down by his sides, and his hands were away from his hips, and his thumbs were away from his fingers. He was all fired up and ready. Across the street five guys slipped out of the pick-up trucks. They started toward me. I saw the beta dog, and the beer-for-breakfast guy, and the biker with the bad back, and two guys I hadn\u0027t seen before, each of them looking like the other four. Same region, same family, or both. I stayed on the sidewalk. With six guys, I didn\u0027t want any of them behind me. I wanted a wall at my back. The alpha dog stepped off the sidewalk into the gutter and met the others as the right-hand item in a neat six-man arc. They all stayed in the street, eight or ten feet from me. Out of reach, but I could smell them. They were all doing the ape thing with their arms and hands and thumbs. Like gunfighters with no guns. \"Six of you?\" I said. \"Is that it?\" No answer. \"That\u0027s kind of incremental, isn\u0027t it?\" I said. \"I was hoping for something a little more radical. Like the difference between an airborne company and an armored division. I guess we were thinking along different lines. I have to say, I\u0027m kind of disappointed.\" No answer. I said, \"Anyway, guys, I\u0027m sorry, but I have a dinner date.\" They all took a step forward, bringing them closer to each other and closer to me. Six pale faces, sallow in what little light there was. I said, \"I\u0027m wearing a brand new shirt.\" No answer. Basic rule of thumb with six guys: you have to be quick. You can\u0027t spend more than the bare minimum of time on any one individual. Which means you have to hit each of them one time only. Because that\u0027s the minimum. You can\u0027t hit a guy less than once. I rehearsed my moves. I figured I would start in the middle. One two three, bang bang bang. The third hit would be the hardest. The third guy would be moving. The first two wouldn\u0027t. They would be rooted to the spot. Shock and surprise. They would go down easy. But the third guy would be reacting by the time I got to him. And unpredictably. He might have a coherent plan in mind, but it wouldn\u0027t be in motion yet. He would still be jerking around with uncontrolled reflex panic. So I was prepared to miss out on the third guy. Maybe jump straight to the fourth. The third guy might run. Certainly at least one of them would. I have never seen a pack that stayed together after the first few heads hit the pavement. I said, \"Guys, please, I just took a shower.\" There was no answer, which was what I had privately predicted. They all stepped forward again, which is what I expected them to do. So I met them halfway, which seemed polite. I took two long strides, the second of them powering off the edge of the curbstone, two hundred and fifty pounds of moving mass, and I hit the third guy from the left with a straight right that would have taken his teeth out if he\u0027d had any to start with. As it was it snapped his head back and turned his spine and shoulders to jelly and he was gone, from the fight and from my vision, because by then I was already jerking left and scything my right elbow into the second guy, horizontal across the bridge of his nose, a colossal blow full of torque from my waist and full of force from the fact that I was basically falling into him. I saw blood in the air and stamped down hard and reversed my momentum and used the same elbow backward on a guy I sensed behind me. I could tell by the impact he was flinching away and I had caught him on the ear, so I made an instantaneous mental note he might need more attention later, and then I jerked forward again and changed the angle of attack by kicking the fourth guy full-on in the groin, a satisfying bone-and-flesh crunch that simultaneously folded him in half and lifted him off his feet. Three seconds, three down, one taking an eight count. Nobody ran. Another mental note: Mississippi hooligans are made of sterner stuff than most. Or else they\u0027re just plain dumber. The fifth guy got as far as scrabbling at my shoulder. Some kind of an attempt at a punch, or maybe he was going for a choke hold. Maybe he planned to keep me still while the sixth guy landed some blows. I couldn\u0027t tell. But whatever, he was sorely disappointed in his ambitions. I exploded backward at him, my whole body moving, my torso twisting, my elbow whipping back, and I caught him in the cheek, and then I used the bounce to jam forward once more, in search of the lone survivor. The sixth guy. He caught his heel on the curb and his arms came up like a scarecrow, which I took as an invitation to pop him in the chest, right in the solar plexus, which was like plugging him into an electrical outlet. He hopped and danced and went down in a heap. The guy I had hit on the ear was pawing at it like it was coming off. His eyes were closed, which made it not much of a fair fight, but those are always my favorite kind. I lined up and smacked a left hook into his chin. He went down like a dropped marionette. I breathed out. Six for six. End of story. I coughed twice and spat on the ground. Then I hustled north. I had a block to go and the clock in my head said it was already one minute past nine. 42 I pushed in through the diner door and found the place empty apart from the waitress and the old couple from Toussaint\u0027s. They looked to be about halfway through their nightly marathon. The woman had a book, the man had a paper. Deveraux wasn\u0027t there yet. I told the waitress I was expecting company. I asked her for a table for four. I figured the tables for two would be cramped for a long social engagement. She set me up in a spot near the front and I headed for the bathroom. I rinsed my face and washed my hands and forearms and elbows with hot water and soap. I ran wet fingers through my hair. I breathed in and breathed out. Adrenaline is a bitch. It doesn\u0027t know when to quit. I flapped my hands and rolled my shoulders. I took a look in the mirror. My hair was OK. My face was clean. There was blood on my shirt. On the pocket. And above. And below. Not much, but some. A definite comma-shaped curl of droplets. Like it had been flung at me. Or like I had walked into a mist. Which I had. The second guy. I had hit him on the bridge of his nose. His nose had bled like a flushing toilet. I said, \"Shit,\" quietly, to myself. My old shirts were in the trash in my room. The stores were all closed. I edged closer to the sink and took another look in the mirror. The droplets were already drying. Turning brown. Maybe they would end up looking deliberate. Like a logo. Or a pattern. Like a single element taken from a swirling fabric. I had seen similar things. I wasn\u0027t sure what they were called. Paisley? I breathed in, breathed out. Nothing to be done. I headed back to the dining room and got there just as Deveraux stepped in through the door. She wasn\u0027t in uniform. She had changed her clothes. She was wearing a silver silk shirt and a black knee-length skirt. High heeled shoes. A silver necklace. The shirt was thin and tight and tiny. It was open at the top. The skirt sat at her waist. I could have spanned her waist with my hands. Her legs were bare. And slim. And long. Her hair was wet from the shower. It was loose on her shoulders. It was spilling down her back. No ponytail. No elastic band. She was smiling, all the way up to her amazing eyes. I showed her to our table and we sat down facing each other. She was small and neat, centered on her bench. She was wearing perfume. Something faint and subtle. I liked it. She said, \"I\u0027m sorry I\u0027m late.\" I said, \"No problem.\" She said, \"You have blood on your shirt.\" I said, \"Is that what it is?\" \"Where did you get it?\" \"Across the street from the hotel. There\u0027s a store.\" \"Not the shirt,\" she said. \"The blood. You didn\u0027t cut yourself shaving.\" \"You told me not to.\" \"I know,\" she said. \"I like you like that.\" \"You look great too.\" \"Thank you. I decided to quit early. I went home to change.\" \"I see that.\" \"I live in the hotel.\" \"I know.\" \"Room seventeen.\" \"I know.\" \"Which has a balcony overlooking the street.\" \"You saw?\" \"Everything,\" she said. \"Then I\u0027m surprised you didn\u0027t break the date.\" \"Is it a date?\" \"It\u0027s a dinner date.\" She said, \"You didn\u0027t let them hit you first.\" \"I wouldn\u0027t be here if I had.\" \"True,\" she said, and smiled. \"You were pretty good.\" \"Thank you,\" I said. \"But you\u0027re killing my budget. Pellegrino and Butler are getting overtime to haul them away. I wanted them gone before the hotel folks finish their dinner. Voters don\u0027t like mayhem in the streets.\" The waitress came by. She brought no menus. Deveraux had been eating there three times a day for two years. She knew the menu. She asked for the cheeseburger. So did I, with coffee to drink. The waitress made a note and went away. I said, \"You had the cheeseburger yesterday.\" Deveraux said, \"I have it every day.\" \"Really?\" She nodded. \"Every day I do the same things and eat the same things.\" \"How do you stay thin?\" \"Mental energy,\" she said. \"I worry a lot.\" \"About what?\" \"Right now about a guy from Oxford, Mississippi. That\u0027s the guy who got shot in the thigh. The doctor brought his personal effects to my office. There was a wallet and a notebook. The guy was a journalist.\" \"Big paper?\" \"No, freelance. Struggling, probably. His last press pass was two years old. But Oxford has a couple of alternative papers. He was probably trying to sell something to one of them.\" \"There\u0027s a school in Oxford, right?\" Deveraux nodded again. \"Ole Miss,\" she said. \"About as radical as this state gets.\" \"Why did the guy come here?\" \"I would have loved the chance to ask him. He might have had something I could use.\" The waitress came back with my coffee and a glass of water for Deveraux. Behind my back I heard the old guy from the hotel grunt and turn a page in his paper. I said, \"My CO still denies there are boots on the ground outside the fence.\" Deveraux asked, \"How does that make you feel?\" \"I don\u0027t know. If he\u0027s lying to me, it will be the first time ever.\" \"Maybe someone\u0027s lying to him.\" \"Such cynicism in one so young.\" \"But don\u0027t you think?\" \"More than likely.\" \"So how does that make you feel?\" \"What are you, a psychiatrist now?\" She smiled. \"Just interested. Because I\u0027ve been there. Does it make you angry?\" \"I never get angry. I\u0027m a very placid type of a guy.\" \"You looked angry twenty minutes ago. With the McKinney family.\" \"That was just a technical problem. Space and time. I didn\u0027t want to be late for dinner. I wasn\u0027t angry, really. Well, not at first. I got a bit frustrated later. You know, mentally. I mean, when there were four of them, I gave them the chance to come back in numbers. And what did they do? They added two more guys. That\u0027s all. They showed up with a total of six. What is that about? It\u0027s deliberate disrespect.\" Deveraux said, \"I think most people would consider six against one to be fairly respectful.\" \"But I warned them. I told them they\u0027d need more. I was trying to be fair. But they wouldn\u0027t listen. It was like talking to the Pentagon.\" \"How\u0027s that going, by the way?\" \"Not good. They\u0027re as bad as the McKinney family.\" \"Are you worried?\" \"Some people are.\" \"They should be. The army is going to change.\" \"The Marines too, then.\" She smiled. \"A little, maybe. But not much. The army is the big target. And the easy target. Because the army is boring. The Marines aren\u0027t.\" \"You think?\" \"Come on,\" she said. \"We\u0027re glamorous. We have a great dress uniform. We do great close-order drill. We do great funerals. You know why we do all that? Because Marines are very good at PR. And we get good advice. Our consultants are better than yours, basically. That\u0027s what I\u0027m saying. That\u0027s what it comes down to. So you\u0027ll lose a lot, and we\u0027ll lose a little.\" \"You have consultants?\" I said. \"And lobbyists,\" she said. \"Don\u0027t you?\" \"I don\u0027t think so,\" I said. I thought about my old pal Stan Lowrey, and his want ads. The waitress brought our meals. Just like the night before. Two big cheeseburgers, two big tangles of fries. I had had the same thing for lunch. I hadn\u0027t remembered that. But I was hungry. So I ate. And I watched Deveraux eat. Which was some kind of a threshold. It has to mean something, if you can stand to watch another person eat. She chewed and swallowed and said, \"Anyway, what else did your CO tell you?\" \"That he\u0027s having you checked out.\" She stopped eating. \"Why would he?\" \"To give me something to use against you.\" She smiled. \"There\u0027s not much there, I\u0027m afraid. I was a good little jarhead. But don\u0027t you see? They\u0027re proving my case for me. The more desperate they get, the more I know for sure it\u0027s some Kelham guy\u0027s ass on the line.\" She started eating again. I said, \"My CO was also quizzing me on my mail.\" \"They\u0027re reading your letters?\" \"A postcard from my brother.\" \"Why?\" \"They must think it might help.\" \"Did it?\" \"Not in the least. It was nothing.\" \"They are desperate, aren\u0027t they?\" \"My CO kept apologizing about it.\" \"So he should.\" \"He asked if there was a code in the postcard. But really I think he was talking in code. I think he has been all along. Right back at the beginning he wasted ten minutes giving me a hard time about my hair. That\u0027s not like him, which I think was the point. He\u0027s telling me this isn\u0027t him. He\u0027s telling me he\u0027s in the dark, under orders, doing something he doesn\u0027t want to do.\" \"Nice of him to dump his problems on you. He could have sent someone else.\" \"Could he, though? Maybe this whole thing was a package deal, soup to nuts, planned up above. Like when the owner picks the team. Me and Munro. Maybe they\u0027re getting ready to thin the herd, and we\u0027re being given a loyalty test.\" \"Munro told me he knows you by reputation.\" I nodded. \"We\u0027ve never met.\" \"Reputations are dangerous things to have, in times like these.\" I said nothing. She said, \"If I asked my old buddies to check you out, what would they find?\" \"Parts of it aren\u0027t pretty,\" I said. \"So this is payback time,\" she said. \"It\u0027s a win-win for somebody. Either they break you or they get rid of you. You\u0027ve got an enemy somewhere. Any idea who?\" \"No,\" I said. We ate in silence for a moment, and finished up. Clean plates. Meat, bread, cheese, potatoes, all gone. I felt full. Deveraux was half my size. Or less. I didn\u0027t know how she did it. She said, \"Anyway, tell me about your brother.\" \"I\u0027d rather talk about you.\" \"Me? There\u0027s nothing to say. Carter Crossing, the Marine Corps, Carter Crossing again. That\u0027s the story of my life. No sisters, no brothers. How many do you have?\" \"Just the one.\" \"Older or younger?\" \"Two years older. Born way far away in the Pacific. I haven\u0027t seen him for a long time.\" \"Is he like you?\" \"We\u0027re like two alternative versions of the same person. We look alike. He\u0027s smarter than me. I get things done better. He\u0027s more cerebral, I\u0027m more physical. He was good and I was bad, according to our parents. Like that.\" \"What does he do for a living?\" I paused. \"I can\u0027t tell you that,\" I said. \"His job is classified?\" \"Not really,\" I said. \"But it might give you a clue about one of the things the army is worried about here.\" She smiled. She was a very tolerant woman. She said, \"Should we get pie?\" We ordered two peach pies, the same as I had eaten the night before. And coffee, for both of us, which I took to be a good sign. She wasn\u0027t worried about being kept awake. Maybe she was planning on it. The old couple from the hotel got up and left while the waitress was still in the kitchen. They stopped by our table. No real conversation. Just a lot of nodding and smiling. They were determined to be polite. Simple economics. Deveraux was their meal ticket, and I was temporarily the icing on their cake. The clock in my head hit ten in the evening. The pies arrived, and so did the coffee. I didn\u0027t pay much attention to either. I spent most of my time looking at the third button on Deveraux\u0027s shirt. I had noticed it before. It was the first one that was done up. Therefore it was the first one that would need to be undone. It was a tiny mother-of-pearl thing, silvery gray. Behind it was skin, neither pale nor dark, and very three dimensional. Left to right it curved toward me, then away from me, then toward me again. It was rising and falling as she breathed. The waitress came by and offered more coffee. For possibly the first time in my life I turned it down. Deveraux said no, too. The waitress put the check on the table, face down, next to me. I flipped it over. Not bad. You could still eat well on a soldier\u0027s pay, back in 1997. I dropped some bills on it and looked across at Deveraux and said, \"Can I walk you home?\" She said, \"I thought you\u0027d never ask.\"","sourceLink":"https://allnovel.net/the-affair-jack-reacher-16/page-14.html","bookId":2349,"book":{"id":2349,"title":"The Affair (Jack Reacher #16)","description":"Storyline: The Affair (Jack Reacher #16) March 1997. A woman has her throat cut behind a bar in Carter Crossing, Mississippi. Just down the road is a big army base. Is the murderer a local guy - or is he a soldier? Jack Reacher, still a major in the military police, is sent in undercover. The county sheriff is a former US Marine - and a stunningly beautiful woman. Her investigation is going nowhere. Is the Pentagon stonewalling her? Or doesn\u0027t she really want to find the killer?","cover":"https://allnovel.net/images/the-affair-jack-reacher-16.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-affair-jack-reacher-16.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:01:15 AM"}}
