{"id":66545,"no":15,"title":"Page 15","content":"43\\n\\n Pellegrino and Butler had done their work. They had earned their overtime payments. The McKinney boys were gone. Main Street was silent and completely deserted. The moon was out and the air was soft. Deveraux was taller in her heels. We walked side by side, close enough for me to hear the whisper of silk on skin, and to catch the scent of her perfume.\\n\\n We got to the hotel and went up the worn steps and crossed the porch. I held the door for her. The old guy was working behind the counter. We nodded goodnight to him and headed for the stairs. At the top Deveraux paused and said, \"Well, goodnight, Mr. Reacher, and thanks again for your company at dinner.\"\\n\\n Loud and clear.\\n\\n I just stood there.\\n\\n She crossed the corridor.\\n\\n She took out her key.\\n\\n She put it in room seventeen\u0027s lock.\\n\\n She opened the door.\\n\\n Then she closed it again loudly and tiptoed back to me and stretched up and put her hand on my shoulder. She put her lips close to my ear and whispered, \"That was for the old man downstairs. I have to think about my reputation. Mustn\u0027t shock the voters.\"\\n\\n I breathed out.\\n\\n I took her hand and we headed for my room.\\n\\n We were both thirty-six years old. All grown up. Not teenagers. We didn\u0027t rush. We didn\u0027t fumble. We took our time, and what a time it was. Maybe the best ever.\\n\\n We kissed as soon as my door was closed. Her lips were cool and wet. Her teeth were small. Her tongue was agile. It was a great kiss. I had one hand in her hair, and one on the small of her back. She was jammed hard against me, and moving. Her eyes were open. So were mine. We kept that first kiss going for whole minutes. Five of them, or maybe ten. We were patient. We took it slow. We were very good at it. I think we both understood that the first time happens only once. We both wanted to savor it.\\n\\n Eventually we came up for air. I took my shirt off. I didn\u0027t want McKinney blood between us. I have a big shrapnel scar low down on my front. It looks like a pale octopus crawling up out of my waistband. Ugly white stitches. Usually a conversation starter. Deveraux saw it and ignored it. She moved right along. She was a Marine. She had seen worse. Her hand went to her top button.\\n\\n I said, \"No, let me.\"\\n\\n She smiled and said, \"That\u0027s your thing? You like undressing women?\"\\n\\n \"More than anything in the world,\" I said. \"And I\u0027ve been staring at that particular button since a quarter past nine.\"\\n\\n \"Since ten past nine,\" she said. \"I paid attention to the time line. I\u0027m a cop.\"\\n\\n I took her left hand and got her to hold it out, palm up. She kept it there, patiently. I undid her cuff button. I did the same with her right hand. The silk fell back over slim wrists. She put her hands on my chest. She slid them up behind my head. We kissed again, five whole minutes. Another great kiss. Better than the first.\\n\\n We came up for air again and I moved on to the button on the front of her shirt. Like all the others it was small. And slippery. My fingers are big. But I got the job done. The button popped open, helped on its way by the swell of her breasts. I moved down to the fourth button. Then the fifth. I eased the silk out of the waistband of her skirt, all the way around, little by little, slowly and carefully. She was looking at me and smiling the whole time. Her shirt fell open. She was wearing a bra. A tiny black thing, with lace, and delicate straps. It barely covered her nipples. Her breasts were fantastic.\\n\\n I eased the shirt back off her shoulders and it sighed and parachuted to the floor behind her. Her scent came up at me. We kissed again, long and hard. I kissed the curve where her neck met her shoulder. She had a cleft down her back. Her bra strap spanned it like a little bridge. She put her head back and her hair spilled everywhere. I kissed her throat.\\n\\n \"Now your shoes,\" she said, and her throat buzzed against my lips.\\n\\n She turned me around and pushed me backward and sat me down on the edge of the bed. She knelt in front of me. She untied my right shoe, and then my left. She eased them off. She hooked her thumbs in my socks and peeled them down.\\n\\n \"PX for sure,\" she said.\\n\\n \"Less than a dollar,\" I said. \"Couldn\u0027t resist.\"\\n\\n We stood up again and kissed again. By that point in my life I had kissed hundreds of girls, but I was ready to admit Deveraux was the finest of them all. She was spectacular. She moved and quivered and trembled. She was strong, but gentle. Passionate, but not aggressive. Hungry, but not demanding. The clock in my head took a break. We had all the time in the world, and we were going to use every last minute of it.\\n\\n She hooked her fingers behind the front of my waistband. She tugged on it. She undid the button, one finger, one thumb. We kept on kissing. She found my zipper tab and eased it down, slowly, slowly, small hand, neat thumb, precise finger. She put her hands flat on my shoulder blades and slid them side to side, warm, dry, soft, and then she moved them down, slowly, to my waist, and then down again. She slid the tips of her fingers under my loosened waistband and tented the fabric. She went deeper. She pushed back and down and my pants slid over my hips. We were still kissing.\\n\\n We came up for air and she turned me around and sat me down again. She pulled my pants off and dumped them on top of her shirt. She left me on the bed and stepped back a pace and held her arms out wide and said, \"Tell me what to take off next.\"\\n\\n \"I get to pick?\"\\n\\n She nodded. \"Your choice.\"\\n\\n I smiled. A hell of a choice. Bra, skirt, shoes. I figured she could keep her shoes on. For a spell, anyway. Maybe all night long.\\n\\n I said, \"Skirt.\"\\n\\n She obliged. There was a button and a zipper at the side. She popped the button and slid the zipper down, slowly, an inch, two inches, three, four. I heard its sound quite clearly in the silence. The skirt fell to the ground. She stepped out of it, one foot, then the other. Her legs were long and smooth and toned. She was wearing tiny black panties. Not much to them. Just a wisp of dark fabric.\\n\\n Bra, panties, shoes. I was still sitting on the bed. She climbed into my lap. I lifted her hair away and kissed her ear. I traced its shape with my tongue. I could feel her cheek against mine. I could feel the smile. I kissed her mouth, she kissed my ear. We spent twenty minutes learning every contour above our necks.\\n\\n Then we moved lower.\\n\\n I unsnapped her bra. It fell away, insubstantial. I ducked my head. Her head went back, arching her breasts toward me. They were firm and round and smooth. Her nipples were sensitive. She moaned a little. So did I. She moved and kissed my chest. I lifted her off my lap and rolled her on her back on the bed. Then she rolled me. Twenty fabulous minutes, spent getting to know each other above the waist.\\n\\n Then we moved lower.\\n\\n I was on my back. She knelt over me and slid my boxers down. She smiled. So did I. Ten amazing minutes later we changed places. Her panties came down over her hips, and then she lifted her knees to let me finish the job. I buried my face between her thighs. She was wet and sweet. She moved, uninhibited. She rolled her head from side to side and squirmed her shoulders and pressed herself down on the mattress. She ran her fingers through my hair.\\n\\n Then it was time. We started tenderly. Long and slow, long and slow. Deep and easy. She flushed and gasped. So did I. Long and slow, long and slow.\\n\\n Then faster and harder.\\n\\n Then we were panting.\\n\\n Faster, harder, faster, harder.\\n\\n Panting.\\n\\n \"Wait,\" she said.\\n\\n \"What?\"\\n\\n \"Wait, wait,\" she said. \"Not now. Not yet. Slow down.\"\\n\\n Long and slow, long and slow.\\n\\n Breathing hard.\\n\\n Panting.\\n\\n Long and slow.\\n\\n \"OK,\" she said. \"OK. Now. Now. Now!\"\\n\\n Faster and harder.\\n\\n Faster, harder, faster, harder.\\n\\n The room began to shake.\\n\\n Just very faintly at first, like a mild constant tremor, like the edge of a far distant earthquake. The French door ticked in its frame. A glass rattled on the bathroom shelf. The floor quivered. The hall door creaked and stuttered. My shoes hopped and moved. The bed head hammered against the wall. The floor shook hard. The walls boomed. Coins in my abandoned pocket tinkled. The bed shook and bounced and walked tiny fractions across the moving floor.\\n\\n Then the midnight train was gone, and so were we.\\n\\n 44\\n\\n Afterward we lay side by side, naked, breathing hard, sweat pooling, holding hands. I stared up at the ceiling. Deveraux said, \"I\u0027ve wanted to do that for two whole years. That damn train. Might as well make use of it.\"\\n\\n I said, \"If I ever buy a house it\u0027s going to be next to a railroad track. That\u0027s for damn sure.\"\\n\\n She moved her position and snuggled next to me. I put my arm around her. We lay quiet, and spent, and satisfied. I heard Blind Blake in my head. I had once listened to a cassette tape of all his songs, transferred from beat-up old 78s, the absurd roar and scratch of ancient shellac surface noise almost drowning out the quiet, wistful voice and the agile guitar, as it picked out the rhythms of the railroad. A blind man. Blind from birth. He had never seen a train. But he had heard plenty. That was clear.\\n\\n Deveraux asked me what I was thinking about, and I told her. I said, \"That\u0027s the guy my brother\u0027s note was about.\"\\n\\n \"Are you still mad about it?\"\\n\\n \"I\u0027m sad about it,\" I said.\\n\\n \"Why?\"\\n\\n \"This mission was a mistake,\" I said. \"They shouldn\u0027t have put me on the outside. Not for this kind of thing. It\u0027s making me think of them as ... them. Not us anymore.\"\\n\\n * * *\\n\\n Later we had a languid conversation about whether she should go back to her own room. Reputations. Voters. I said the old guy had come upstairs for me when Garber had called. He had gotten a good look inside the room. She said if that happened again I could delay a second and she could hide in the bathroom. She said they rarely knocked on her door. And if by some chance they did the next morning and there was no reply, they would assume she was out on a case. Which would be entirely plausible. She wasn\u0027t short of work to do, after all.\\n\\n Then she said, \"Maybe Janice Chapman was doing what we just did. With the gravel scratches, I mean. With her boyfriend, whoever he was. Out in her back yard, at midnight. Under the stars. The railroad track is pretty close by. Must be amazing out of doors.\"\\n\\n \"It must be,\" I said. \"I was right next to the track at midnight last night. It\u0027s like the end of the world.\"\\n\\n \"Would the timing work? With the scabs?\"\\n\\n \"If she had sex at midnight she was killed about four in the morning. What time was she found?\"\\n\\n \"Ten the next evening. That\u0027s eighteen hours. I guess there would have been some decomposition by then.\"\\n\\n \"Probably. But bled-out bodies can look pretty weird. It would have been fairly hard to tell. And your department doctor isn\u0027t exactly Sherlock Holmes.\"\\n\\n \"So it\u0027s possible?\"\\n\\n \"We\u0027d have to explain why she put on a nice dress and pantyhose sometime between midnight and four in the morning.\"\\n\\n We pondered that for a moment. Then we surrendered to inertia. We said nothing more, about dresses or pantyhose, or voters or rooms or reputations, and then we fell asleep, in each other\u0027s arms, outside the covers, naked, in the still silence of the Mississippi night.\\n\\n Four hours later I was awake again and confirming my longest-held belief: there is no better time than the second time. All the first time\u0027s semi-formal niceties can be forgotten. All the first time tricks we use to impress each other can be abandoned. There\u0027s new familiarity, and no loss of excitement. There\u0027s a general sense of what works and what doesn\u0027t. Second time around, you\u0027re ready to rock and roll.\\n\\n And we did.\\n\\n Afterward Deveraux yawned and stretched and said, \"You\u0027re not bad for a soldier boy.\"\\n\\n I said, \"You\u0027re excellent for a Marine.\"\\n\\n \"We better be careful. We might develop feelings for each other.\"\\n\\n \"What are those?\"\\n\\n \"What are what?\"\\n\\n \"Feelings.\"\\n\\n She paused a beat.\\n\\n She said, \"Men should be more in touch with their feelings.\"\\n\\n I said, \"If I ever have one, you\u0027ll be the first to know, I promise.\"\\n\\n She paused again. Then she laughed. Which was good. This was already 1997, remember. It was touch and go in those days.\\n\\n I woke up for the second time at seven o\u0027clock in the morning, thinking about pregnancy.\\n\\n 45\\n\\n Elizabeth Deveraux was sitting upright in the bed when I woke. She was on my left, in the center of her space, facing me, back straight, legs crossed, like yoga. She was naked and unselfconscious. She was very beautiful. Just spectacularly good looking. One of the best looking women I had ever seen, and certainly the best looking I had ever seen naked, and definitely the best looking I had ever slept with.\\n\\n But by that point she was mentally preoccupied. Seven o\u0027clock in the morning. The start of the work day. No third time lucky for me. Not right then. She said, \"They must have had something else in common. Those three women, I mean.\"\\n\\n I said nothing.\\n\\n \"Beauty is too nebulous,\" she said. \"It\u0027s too subjective. It\u0027s just an opinion.\"\\n\\n I said nothing.\\n\\n She said, \"What?\"\\n\\n \"It\u0027s not just an opinion,\" I said. \"Not with those three.\"\\n\\n \"Then we\u0027re looking for two factors. Two things that interacted. They were beautiful and they were also something else.\"\\n\\n \"Maybe they were pregnant,\" I said.\\n\\n * * *\\n\\n We examined the proposition. They were girlfriend material. It was a base town. These things happen. Mostly by accident, but sometimes on purpose. Sometimes women think that moving from one base town to another with a baby is better than living alone in the base town where they were born. A mistake, probably, but not for all of them. My own mother had been OK with it, for instance.\\n\\n I said, \"Shawna Lindsay was desperate to get out, according to her kid brother.\"\\n\\n Deveraux said, \"But I can\u0027t see why Janice May Chapman would have been. She wasn\u0027t born here. She chose this place. And she wouldn\u0027t have needed a guy to get her out anyway. She could have just sold up and driven away in her Honda.\"\\n\\n \"Accident, then,\" I said. \"With her, anyway. One other thing we didn\u0027t see in her house was birth control. Nothing in the medicine cabinet.\"\\n\\n No response.\\n\\n I asked, \"Where do you keep yours?\"\\n\\n \"Bathroom shelf,\" she said. \"There are no medicine cabinets here.\"\\n\\n \"Did Rosemary McClatchy want to get out of town?\"\\n\\n \"I don\u0027t know. Probably. Why wouldn\u0027t she?\"\\n\\n \"Did the doctor test for pregnancy?\"\\n\\n \"No,\" Deveraux said. \"I\u0027m sure they would have in a big city. But not here. Merriam signed the certificate and gave us the cause of death, that\u0027s all. The fifty-cent opinion.\"\\n\\n I said, \"Chapman didn\u0027t look pregnant.\"\\n\\n \"Some women don\u0027t, for months.\"\\n\\n \"Would Rosemary McClatchy have told her mother?\"\\n\\n \"I can\u0027t ask her,\" Deveraux said. \"Absolutely not. No way. I can\u0027t put that possibility into Emmeline\u0027s mind. Because suppose Rosemary wasn\u0027t pregnant? It would taint her memory.\"\\n\\n \"There was something Shawna Lindsay\u0027s brother wasn\u0027t telling me. I\u0027m sure of it. Maybe something big. You should talk to him. His name is Bruce. He wants to join the army, by the way.\"\\n\\n \"Not the Marines?\"\\n\\n \"Apparently not.\"\\n\\n \"Why? Did you trash the Marines to him?\"\\n\\n \"I was very fair.\"\\n\\n \"Would he talk to me? He seems very hostile.\"\\n\\n \"He\u0027s OK,\" I said. \"Ugly, but OK. He seems drawn toward the military. He seems to understand command structure. You\u0027re a Marine and a sheriff. Approach it right and he might stand up and salute.\"\\n\\n \"OK,\" she said. \"Maybe I\u0027ll try it. Maybe I\u0027ll go see him today.\"\\n\\n \"All three of them could have been accidental,\" I said. \"The big decisions might have come afterward. About what to do, I mean. If they all three liked the status quo they might have chosen a different route. Or they might have been persuaded.\"\\n\\n \"Abortion?\"\\n\\n \"Why not?\"\\n\\n \"Where would they get an abortion in Mississippi? You\u0027d have to drive north for hours.\"\\n\\n \"Which is maybe why Janice Chapman got dressed before four in the morning. An early start. Maybe she had a long trip ahead of her. Maybe her boyfriend was driving her somewhere. For an afternoon appointment, perhaps. Then an overnight stay. Maybe she was thinking ahead, to the reception counter. The waiting room. So she put on something appropriate. Stylish, but reasonably demure. And maybe she packed a bag. That\u0027s something else we didn\u0027t see in her house. Suitcases.\"\\n\\n \"We\u0027ll never know for sure,\" Deveraux said. \"Unless we find the boyfriends.\"\\n\\n \"Or the boyfriend, singular,\" I said. \"It might have been the same guy.\"\\n\\n \"With all three of them?\"\\n\\n \"It\u0027s possible.\"\\n\\n \"But it makes no sense. Why would he set up an appointment at an abortion clinic for them and then murder them before they got a mile down the road? Why not just go through with the appointment?\"\\n\\n \"Maybe he\u0027s the kind of guy who can\u0027t afford either a pregnant girlfriend or an association with an abortion clinic.\"\\n\\n \"He\u0027s a soldier. Not a preacher. Or a politician.\"\\n\\n I said nothing.\\n\\n Deveraux said, \"Maybe he wants to be a preacher or a politician later.\"\\n\\n I said nothing.\\n\\n \"Or maybe he\u0027s got preachers or politicians in the family. Maybe he has to avoid embarrassing them.\"\\n\\n There was a creak from a floorboard outside in the hall, and then a soft knock on my door. I recognized the sound immediately. The same as the morning before. The old guy. I pictured his slow shuffling tread, the slow tentative movement of his arm, the muted low-energy impact of his papery knuckles on the wood.\\n\\n Deveraux whispered, \"Oh, shit.\"\\n\\n Now we were like teenagers. Now we were rushing and fumbling. Deveraux rolled off the bed and grabbed an armful of clothing, which happened to include my pants, so I had to wrestle them back from her, which spilled the other garments all over the place. She tried to collect them and I tried to get my pants on. I got tangled up and fell back on the bed and she made it to the bathroom but left a breadcrumb trail of socks and underwear behind her. I got my pants more or less straight and the old guy knocked again. I limped across the floor and kicked clothes toward the bathroom as I went. Deveraux darted out and collected them up. Then she ducked back in again and I opened the door.\\n\\n The old guy said, \"Your fiancee is on the phone for you.\"\\n\\n Loud and clear. \\n\\n","sourceLink":"https://allnovel.net/the-affair-jack-reacher-16/page-15.html","bookId":2349,"book":{"id":2349,"title":"The Affair (Jack Reacher #16)","description":"Storyline: The Affair (Jack Reacher #16) \\n March 1997. A woman has her throat cut behind a bar in Carter Crossing, Mississippi. Just down the road is a big army base. Is the murderer a local guy - or is he a soldier? \\n Jack Reacher, still a major in the military police, is sent in undercover. The county sheriff is a former US Marine - and a stunningly beautiful woman. Her investigation is going nowhere. Is the Pentagon stonewalling her? Or doesn\u0027t she really want to find the killer?\\n","cover":"https://allnovel.net/images/the-affair-jack-reacher-16.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-affair-jack-reacher-16.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:01:15 AM"}}
