{"id":66883,"no":19,"title":"Page 19","content":"\"We\u0027ll have to get him out of there,\" Arnold said. \"With what?\" Muldoon said. \"We haven\u0027t got anything to use on a rex. I\u0027ll fix this fence, but I\u0027m not going in there until daylight.\" \"Hammond won\u0027t like it.\" \"We\u0027ll discuss it when I get back,\" Muldoon said. \"How many sauropods will the rex kill?\" Hammond said, pacing around the control room. \"Probably just one,\" Harding said. \"Sauropods are big; the rex can feed off a single kill for several days.\" \"We have to go out and get him tonight,\" Hammond said. Muldoon shook his head. \"I\u0027m not going in there until daylight.\" Hammond was rising up and down on the balls of his feet, the way he did whenever he was angry. \"Are you forgetting you work for me?\" \"No, Mr. Hammond, I\u0027m not forgetting. But that\u0027s a full-grown adult tyrannosaur out there. How do you plan to get him?\" \"We have tranquilizer guns.\" \"We have tranquilizer guns that shoot a twenty-cc dart,\" Muldoon said. \"Fine for an animal that weighs four or five hundred pounds. That tyrannosaur weighs eight tons. It wouldn\u0027t even feel it.\" \"You ordered a larger weapon. . . .\" \"I ordered three larger weapons, Mr. Hammond, but you cut the requisition, so we got only one. And it\u0027s gone. Nedry took it when he left.\" \"That was pretty stupid. Who let that happen?\" \"Nedry\u0027s not my problem, Mr. Hammond,\" Muldoon said. \"You\u0027re saying,\" Hammond said, \"that, as of this moment, there is no way to stop the tyrannosaur?\" \"That\u0027s exactly what I\u0027m saying,\" Muldoon said. \"That\u0027s ridiculous,\" Hammond said. \"It\u0027s your park, Mr. Hammond. You didn\u0027t want anybody to be able to injure your precious dinosaurs. Well, now you\u0027ve got a rex in with the sauropods, and there\u0027s not a damned thing you can do about it.\" He left the room. \"Just a minute,\" Hammond said, hurrying after him. Gennaro stared at the screens, and listened to the shouted argument in the hallway outside, He said to Arnold, \"I guess you don\u0027t have control of the park yet, after all.\" \"Don\u0027t kid yourself,\" Arnold said, lighting another cigarette. \"We have the park. It\u0027ll be dawn in a couple of hours. We may lose a couple of dinos before we get the rex out of there, but, believe me, we have the park.\" Dawn Grant was awakened by a loud grinding sound, followed by a mechanical clanking. He opened his eyes and saw a bale of bay rolling past him on a conveyor belt, up toward the ceiling. Two more bales followed it. Then the clanking stopped as abruptly as it had begun, and the concrete building was silent again. Grant yawned. He stretched sleepily, winced in pain, and sat up. Soft yellow light came through the side windows. It was morning: he had slept the whole night! He looked quickly at his watch: 5:00 a.m. Still almost six hours to go before the boat had to be recalled. He rolled onto his back, groaning. His head throbbed, and his body ached as if he had been beaten up. From around the corner, he heard a squeaking sound, like a rusty wheel. And then Lex giggling. Grant stood slowly, and looked at the building. Now that it was daylight, he could see it was some kind of a maintenance building, with stacks of hay and supplies. On the wall he saw a gray metal box and a stenciled sign: SAUROPOD MAINTENANCE BLDG (04). This must be the sauropod paddock, as he had thought. He opened the box and saw a telephone, but when he lifted the receiver he heard only hissing static. Apparently the phones weren\u0027t working yet. \"Chew your food,\" Lex was saying. \"Don\u0027t be a piggy, Ralph.\" Grant walked around the corner and found Lex by the bars, holding out handfuls of bay to an animal outside that looked like a large pink pig and was making the squeaking sounds Grant had heard. It was actually an infant triceratops, about the size of a pony. The infant didn\u0027t have horns on its head yet, just a curved bony frill behind big soft eyes. It poked its snout through the bars toward Lex, its eyes watching her as she fed it more hay. \"That\u0027s better,\" Lex said. \"There\u0027s plenty of hay, don\u0027t worry.\" She patted the baby on the head. \"You like hay, don\u0027t you, Ralph?\" Lex turned back and saw him. \"This is Ralph,\" Lex said. \"He\u0027s my friend. He likes hay.\" Grant took a step and stopped, wincing. \"You look pretty bad,\" Lex said. \"I feel pretty bad.\" \"Tim, too. His nose is all swollen up.\" \"Where is Tim?\" \"Peeing,\" she said. \"You want to help me feed Ralph?\" The baby triceratops looked at Grant. Hay stuck out of both sides of its mouth, dropping on the floor as it chewed. \"He\u0027s a very messy eater,\" Lex said, \"And he\u0027s very hungry.\" The baby finished chewing and licked its lips. It opened its mouth, waiting for more. Grant could see the slender sharp teeth, and the beaky upper jaw, like a parrot. \"Okay, just a minute,\" Lex said, scooping up more straw from the concrete floor, \"Honestly, Ralph,\" she said, \"You\u0027d think your mother never fed you.\" \"Why is his name Ralph?\" \"Because he looks like Ralph. At school.\" Grant came closer and touched the skin of the neck gently. \"It\u0027s okay, you can pet him,\" Lex said. \"He likes it when you pet him, don\u0027t you, Ralph?\" The skin felt dry and warm, with the pebbled texture of a football. Ralph gave a little squeak as Grant petted it. Outside the bars, its thick tail swung back and forth with pleasure. \"He\u0027s pretty tame.\" Ralph looked from Lex to Grant as it ate, and showed no sign of fear. It reminded Grant that the dinosaurs didn\u0027t have ordinary responses to people. \"Maybe I can ride him,\" Lex said. \"Let\u0027s not.\" \"I bet he\u0027d let me,\" Lex said. \"It\u0027d be fun to ride a dinosaur.\" Grant looked out the bars past the animal, to the open fields of the sauropod compound. It was growing lighter every minute. He should go outside, he thought, and set off one of the motion sensors on the field above. After all, it might take the people in the control room an hour to get out here to him. And he didn\u0027t like the idea that the phones were still down. . . . He heard a deep snorting sound, like the snort of a very large horse, and suddenly the baby became agitated. It tried to pull its head back through the bars, but got caught on the edge of its frill, and it squeaked in fright. Tle snorting came again. It was closer this time. Ralph reared up on its hind legs, frantic to get out from between the bars, It wriggled its head back and forth, rubbing against the bars. \"Ralph, take it easy,\" Lex said. \"Push him out,\" Grant said. He reached up to Ralph\u0027s head and leaned against it, pushing the animal sideways and backward. The frill popped free and the baby fell outside the bars, losing its balance and flopping on its side. Then the baby was covered in shadow, and a huge leg came into view, thicker than a tree trunk. The foot had five curved toenails, like an elephant\u0027s. Ralph looked up and squeaked. A head came down into view: six feet long, with three long white horns, one above each of the large brown eyes and a smaller horn at the tip of the nose. It was a full-grown triceratops. The big animal peered at Lex and Grant, blinking slowly, and then turned its attention to Ralph. A tongue came out and licked the baby. Ralph squeaked and rubbed up against the big leg happily. \"Is that his mom?\" Lex said. \"Looks like it,\" Grant said. \"Should we feed the mom, too?\" Lex said. But the big triceratops was already nudging Ralph with her snout, pushing the baby away from the bars. \"Guess not.\" The infant turned away from the bars and walked off. From time to time, the big mother nudged her baby, guiding it away, as they both walked out into the fields. \"Goodbye, Ralph,\" Lex said, waving. Tim came out of the shadows of the building. \"Tell you what,\" Grant said. \"I\u0027m going up on the hill to set off the motion sensors, so they\u0027ll know to come get us. You two stay here and wait for me.\" \"No,\" Lex said. \"Why? Stay here. It\u0027s safe here.\" \"You\u0027re not leaving us,\" she said. \"Right, Timmy?\" \"Right,\" Tim said. \"Okay,\" Grant said. They crawled through the bars, stepping outside. It was just before dawn. The air was warm and humid, the sky soft pink and purple. A white mist clung low to the ground. Some distance away, they saw the mother triceratops and the baby moving away toward a herd of large duckbilled hadrosaurs, eating foliage from trees at the edge of the lagoon. Some of the hadrosaurs stood knee-deep in the water. They drank, lowering their flat heads, meeting their own reflections in the still water. Then they looked up again, their heads swiveling. At the water\u0027s edge, one of the babies ventured out, squeaked, and scrambled back while the adults watched indulgently. Farther South, other hadrosaurs were eating the lower vegetation. Sometimes they reared up on their hind legs, resting their forelegs on the tree trunks, so they could reach the leaves on higher branches. And in the far distance, a giant apatosaur stood above the trees, the tiny head swiveling on the long neck. The scene was so peaceful Grant found it bard to imagine any danger. \"Yew!\" Lex shouted, ducking. Two giant red dragonflies with six-foot wingspans bummed past them. \"What was that?\" \"Dragonflies,\" he said. \"The Jurassic was a time of huge insects.\" \"Do they bite?\" Lex said. \"I don\u0027t think so,\" Grant said. Tim held out his band. One of the dragonflies lighted on it. He could feel the weight of the huge insect. \"He\u0027s going to bite you,\" Lex warned. But the dragonfly just slowly flapped its red-veined transparent wings, and then, when Tim moved his arm, flew off again, \"Which way do we go?\" Lex said. \"There.\" They started walking across the field. They reached a black box mounted on a heavy metal tripod, the first of the motion sensors. Grant stopped and waved his band in front of it back and forth, but nothing happened. If the phones didn\u0027t work, perhaps the sensors didn\u0027t work, either. \"We\u0027ll try another one,\" he said, pointing across the field. Somewhere in the distance, they heard the roar of a large animal. \"Ah hell,\" Arnold said. \"I just can\u0027t find it.\" He sipped coffee and stared bleary-eyed at the screens. He had taken all the video monitors off line. In the control room, he was searching the computer code. He was exhausted; he\u0027d been working for twelve straight hours. He turned to Wu, who had come up from the lab. \"Find what?\" \"The phones are still out. I can\u0027t get them back on. I think Nedry did something to the phones.\" Wu lifted one phone, heard hissing. \"Sounds like a modem.\" \"But it\u0027s not,\" Arnold said. \"Because I went down into the basement and shut off all the modems. What you\u0027re hearing is just white noise that sounds like a modem transmitting.\" \"So the phone lines are jammed?\" \"Basically, yes. Nedry jammed them very well. He\u0027s inserted some kind of a lockout into the program code, and now I can\u0027t find it, because I gave that restore command which erased part of the program listings. But apparently the command to shut off the phones is still resident in the computer memory.\" Wu shrugged. \"So? Just reset: shut the system down and you\u0027ll clear memory. \"I\u0027ve never done it before,\" Arnold said. \"And I\u0027m reluctant to do it. Maybe all the systems will come back on start-up-but maybe they won\u0027t. I\u0027m not a computer expert, and neither are you. Not really. And without an open phone line, we can\u0027t talk to anybody who is.\" \"If the command is RAM-resident, it won\u0027t show up in the code. You can do a RAM dump and search that, but you don\u0027t know what you\u0027re searching for. I think all you can do is reset.\" Gennaro stormed in. \"We still don\u0027t have any telephones.\" \"Working on it.\" \"You\u0027ve been working on it since midnight. And Malcolm is worse. He needs medical attention.\" \"It means I\u0027ll have to shut down,\" Arnold said. \"I can\u0027t be sure everything will come back on.\" Gennaro said, \"Look. There\u0027s a sick man over in that lodge. He needs a doctor or he\u0027ll die. You can\u0027t call for a doctor unless you have a phone. Four people have probably died already. Now, shut down and get the phones working!\" Arnold hesitated. \"Well?\" Gennaro said. \"Well, it\u0027s just . . . the safety systems don\u0027t allow the computer to be shut down, and-\" \"Then turn the goddamn safety systems off! Can\u0027t you get it through your head that he\u0027s going to die unless he gets help?\" \"Okay,\" Arnold said. He got up and went to the main panel. He opened the doors, and uncovered the metal swing-latches over the safety switches. He popped them off, one after another. \"You asked for it,\" Arnold said. \"And you got it.\" He threw the master switch. The control room was dark. All the monitors were black, The three men stood there in the dark. \"How long do we have to wait?\" Gennaro said. \"Thirty seconds,\" Arnold said. \"P-U!\" Lex said, as they crossed the field. \"What?\" Grant said. \"That smell!\" Lex said. \"It stinks like rotten garbage.\" Grant hesitated. He stared across the field toward the distant trees, looking for movement. He saw nothing. There was hardly a breeze to stir the branches. It was peaceful and silent in the early morning. \"I think it\u0027s your imagination,\" he said. \"Is not-\" Then he heard the honking sound. It came from the herd of duckbilled hadrosaurs behind them. First one animal, then another and another, until the whole herd had taken up the honking cry. The duckbills were agitated, twisting and turning, hurrying out of the water, circling the young ones to protect them. . . . They smell it, too, Grant thought. With a roar, the tyrannosaur burst from the trees fifty yards away, near the lagoon. It rushed out across the open field with huge strides. It ignored them, heading toward the herd of hadrosaurs. \"I told you!\" Lex screamed. \"Nobody listens to me!\" In the distance, the duckbills were honking and starting to run. Grant could feel the earth shake beneath his feet. \"Come on, kids!\" He grabbed Lex, lifting her bodily off the ground, and ran with Tim through the grass. He had glimpses of the tyrannosaur down by the lagoon, lunging at the hadrosaurs, which swung their big tails in defense and bonked loudly and continuously. He heard the crashing of foliage and trees, and when he looked over again, the duckbills were charging. In the darkened control room, Arnold checked his watch. Thirty seconds. The memory should be cleared by now. He pushed the main power switch back on. Nothing happened. Arnold\u0027s stomach heaved. He pushed the switch off, then on again. Still nothing happened. He felt sweat on his brow. \"What\u0027s wrong?\" Gennaro said. \"Oh hell,\" Arnold said. Then he remembered you had to turn the safety swiitches back on before you restarted the power. He flipped on the three safeties, and covered them again with the latch covers. Then he held his breath, and turned the main power switch. The room lights came on. The computer beeped. The screens hummed. \"Thank God,\" Arnold said. He hurried to the main monitor. There were rows of labels on the screen: [picture] Gennaro reached for the phone, but it was dead. No static hissing this time-just nothing at all. \"What\u0027s this?\" \"Give me a second,\" Arnold said. \"After a reset, all the system modules have to be brought on line manually.\" Quickly, he went back to work. \"Why manually?\" Gennaro said. \"Will you just let me work, for Christ\u0027s sake?\" Wu said, \"The system is not intended to ever shut down. So, if it does shut down, it assumes that there is a problem somewhere. It requires you to start up everything manually, Otherwise, if there were a short somewhere, the system would start up, short out, start up again, short out again, in an endless cycle.\" Okay,\" Arnold said. \"We\u0027re going.\" Gennaro picked up the phone and started to dial, when he suddenly stopped. \"Jesus, look at that,\" he said. He pointed to one of the video monitors. But Arnold wasn\u0027t listening, He was staring at the map, where a tight cluster of dots by the lagoon had started to move in a coordinated way. Moving fast, in a kind of swirl. \"What\u0027s happening?\" Gennaro said. \"The duckbills,\" Arnold said tonelessly. \"They\u0027ve stampeded.\" The duckbills charged with surprising speed, their enormous bodies in a tight cluster, honking and roaring, the infants squealing and trying to stay out from underfoot. The herd raised a great cloud of yellow dust. Grant couldn\u0027t see the tyrannosaur. The duckbills were running right toward them. Still carrying Lex, he ran with Tim toward a rocky outcrop, with a stand of big conifers. They ran hard, feeling the ground shake beneath their feet. The sound of the approaching herd was deafening, like the sound of jets at an airport. It filled the air, and hurt their ears. Lex was shouting something, but he couldn\u0027t hear what she was saying, and as they scrambled onto the rocks, the herd closed in around them. Grant saw the immense legs of the first hadrosaurs that charged past, each animal weighing five tons, and then they were enveloped in a cloud so dense he could see nothing at all. He had the impression of huge bodies, giant limbs, bellowing cries of pain as the animals wheeled and circled. One duckbill struck a boulder and it rolled past them, out into the field beyond. In the dense cloud of dust, they could see almost nothing beyond the rocks. They clung to the boulders, listening to the screams and honks, the menacing roar of the tyrannosaur. Lex dug her fingers into Grant\u0027s shoulder. Another hadrosaur slammed its big tail against the rocks, leaving a splash of hot blood. Grant waited until the sounds of the fighting had moved off to the left, and then he pushed the kids to start climbing the largest tree. They climbed swiftly, feeling for the branches, as the animals stampeded all around them in the dust. They went up twenty feet, and then Lex clutched at Grant and refused to go farther. Tim was tired, too, and Grant thought they were high enough. Through the dust, they could see the broad backs of the animals below as they wheeled and bonked. Grant propped himself against the coarse bark of the trunk, coughed in the dust, closed his eyes, and waited. Arnold adjusted the camera as the herd moved away. The dust slowly cleared. He saw that the hadrosaurs had scattered, and the tyrannosaur had stopped running, which could only mean it had made a kill. The tyrannosaur was now near the lagoon. Arnold looked at the video monitor and said, \"Better get Muldoon to go out there and see how bad it is.\" \"I\u0027ll get him,\" Gennaro said, and left the room. The Park A faint crackling sound, like a fire in a fireplace. Something warm and wet tickled Grant\u0027s ankle. He opened his eyes and saw an enormous beige head. The head tapered to a flat mouth shaped like the bill of a duck. The eyes, protruding above the flat duckbill, were gentle and soft like a cow\u0027s. The duck mouth opened and chewed branches on the limb where Grant was sitting. He saw large flat teeth in the check. The warm lips touched his ankle again as the animal chewed. A duckbilled hadrosaur. He was astonished to see it up close. Not that he was afraid; all the species of duckbilled dinosaurs were herbivorous, and this one acted exactly like a cow. Even though it was huge, its manner was so calm and peaceful Grant didn\u0027t feel threatened. He stayed where he was on the branch, careful not to move, and watched as it ate. The reason Grant was astonished was that he had a proprietary feeling about this animal: it was probably a maiasaur, from the late Cretaceous in Montana. With John Horner, Grant had been the first to describe the species. Maiasaurs had an upcurved lip, which gave them the appearance of smiling. The name meant \"good mother lizard\"; maiasaurs were thought to protect their eggs until the babies were born and could take care of themselves. Grant heard an insistent chirping, and the big head swung down. He moved just enough to see the baby hadrosaur scampering around the feet of the adult. The baby was dark beige with black spots. The adult bent her head low to the ground and waited, unmoving, while the baby stood up on its hind legs, resting its front legs on the mother\u0027s jaw, and ate the branches that protruded from the side of the mother\u0027s mouth. The mother waited patiently until the baby had finished eating, and dropped back down to all fours again. Then the big head came back up toward Grant. The hadrosaur continued to eat just a few feet from him. Grant looked at the two elongated airholes on top of the flat upper bill. Apparently the dinosaur couldn\u0027t smell Grant. And even though the left eye was looking right at him, for some reason the hadrosaur didn\u0027t react to him. He remembered how the tyrannosaur had failed to see him, the previous night. Grant decided on an experiment. He coughed. Instantly the hadrosaur froze, the big head suddenly still, the jaws no longer chewing. Only the eye moved, looking for the source of the sound. Then, after a moment, when there seemed to be no danger, the animal resumed chewing. Amazing, Grant thought. Sitting in his arms, Lex opened her eyes and said, \"Hey, what\u0027s that?\" The hadrosaur trumpeted in alarm, a loud resonant bonk that so startled Lex that she nearly fell out of the tree. The hadrosaur pulled its head away from the branch and trumpeted again. \"Don\u0027t make her mad,\" Tim said, from the branch above. The baby chirped and scurried beneath the mother\u0027s legs as the hadrosaur stepped away from the tree. The mother cocked her head and peered inquisitively at the branch where Grant and Lex were sitting. With its upturned smiling lips, the dinosaur had a comical appearance. \"Is it dumb?\" Lex said. \"No,\" Grant said. \"You just surprised her.\" \"Well,\" Lex said, \"is she going to let us get down, or what?\" The hadrosaur had backed ten feet away from the tree. She bonked again. Grant had the impression she was trying to frighten them away. But the dinosaur didn\u0027t really seem to know what to do. She acted confused and uneasy. They waited in silence, and after a minute the hadrosaur approached the branch again, jaws moving in anticipation. She was clearly going to resume eating. \"Forget it,\" Lex said. \"I\u0027m not staying here.\" She started to climb down the branches. At her movement, the hadrosaur trumpeted in fresh alarm. Grant was amazed. He thought, It really can\u0027t see us when we don\u0027t move. And after a minute it literally forgets that we\u0027re here. This was just like the tyrannosaur-another classic example of an amphibian visual cortex. Studies of frogs had shown that amphibians only saw moving things, like insects. If something didn\u0027t move, they literally didn\u0027t see it. The same thing seemed to be true of dinosaurs. In any case, the maiasaur now seemed to find these strange creatures climbing down the tree too upsetting. With a final honk, she nudged her baby, and lumbered slowly away. She paused once, and looked back at them, then continued on. They reached the ground. Lex shook herself off. Both children were covered in a layer of fine dust. All around them, the grass had been flattened. There were streaks of blood, and a sour smell. Grant looked at his watch. \"We better get going, kids,\" he said. \"Not me,\" Lex said. \"I\u0027m not walking out there any more.\" \"We have to.\" \"Why?\" \"Because,\" Grant said, \"we have to tell them about the boat. Since they can\u0027t seem to see us on the motion sensors, we have to go all the way back ourselves. It\u0027s the only way.\" \"Why can\u0027t we take the raft?\" Tim said. \"What raft?\" Tim pointed to the low concrete maintenance building with the bars, where they had spent the night. It was twenty yards away, across the field. \"I saw a raft back there,\" he said. Grant immediately understood the advantages. It was now seven o\u0027clock in the morning. They had at least eight miles to go. If they could take a raft along the river, they would make much faster progress than going overland. \"Let\u0027s do it,\" Grant said. Arnold punched the visual search mode and watched as the monitors began to scan throughout the park, the images changing every two seconds. It was tiring to watch, but it was the fastest way to find Nedry\u0027s Jeep, and Muldoon had been adamant about that. He had gone out with Gennaro to look at the stampede, but now that it was daylight, he wanted the car found. He wanted the weapons. His intercom clicked. \"Mr. Arnold, may I have a word with you, please?\" It was Hammond. He sounded like the voice of God. \"You want to come here, Mr. Hammond?\" \"No, Mr. Arnold,\" Hammond said. \"Come to me. I\u0027m in the genetics lab with Dr. Wu. We\u0027ll be waiting for you.\" Arnold sighed, and stepped away from the screens. Grant stumbled deep in the gloomy recesses of the building. He pushed past five-gallon containers of herbicide, tree-pruning equipment, spare tires for a Jeep, coils of cyclone fencing, hundred-pound fertilizer bags, stacks of brown ceramic insulators, empty motor-oil cans, work lights and cables. \"I don\u0027t see any raft.\" \"Keep going.\" Bags of cement, lengths of copper pipe, green mesb . . . and two plastic oars bung on clips on the concrete wall. \"Okay,\" he said, \"but where\u0027s the raft?\" \"It must be here somewhere,\" Tim said. \"You never saw a raft?\" \"No, I just assumed it was here.\" Poking among the junk, Grant found no raft. But he did find a set of plans, rolled up and speckled with mold from humidity, stuck back in a metal cabinet on the wall. He spread the plans on the floor, brushing away a big spider. He looked at them for a long time. \"I\u0027m hungry. . . .\" \"Just a minute.\" They were detailed topographical charts for the main area of the island, where they now were. According to this, the lagoon narrowed into the river they had seen earlier, which twisted northward . . . right through the aviary . . . and on to within a half-mile of the visitor lodge. He flipped back through the pages. How to get to the lagoon? According to the plans, there should be a door at the back of the building they were in. Grant looked up, and saw it, recessed back in the concrete wall. The door was wide enough for a car. Opening it, he saw a paved road running straight down toward the lagoon. The road was dug below ground level, so it couldn\u0027t be seen from above. It must be another service road. And it led to a dock at the edge of the lagoon. And clearly stenciled on the dock was RAFT STORAGE.","sourceLink":"https://allnovel.net/jurassic-park-jurassic-park-1/page-19.html","bookId":1711,"book":{"id":1711,"title":"Jurassic Park (Jurassic Park #1)","description":"Storyline: Jurassic Park (Jurassic Park #1) An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Creatures once extinct now roam Jurassic Park, soon-to-be opened as a theme park. Until something goes wrong...and science proves a dangerous toy.","cover":"https://allnovel.net/images/jurassic-park-jurassic-park-1.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jurassic-park-jurassic-park-1.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:02:14 AM"}}
