{"id":66884,"no":20,"title":"Page 20","content":"\"Hey,\" Tim said, \"look at this.\" He held out a metal case to Grant. Opening it, Grant found a compressed-air pistol and a cloth belt that held darts. There were six darts in all, each as thick as his finger. Labeled MORO-709. \"Good Work, Tim.\" He slung the belt around his shoulder, and stuck the gun in his trousers. \"Is it a tranquilizer gun?\" \"I\u0027d say so.\" \"What about the boat?\" Lex said. \"I think it\u0027s on the dock,\" Grant said. They started down the road. Grant carried the oars on his shoulder. \"I hope it\u0027s a big raft,\" Lex said, \"because I can\u0027t swim.\" \"Don\u0027t worry,\" he said. \"Maybe we can catch some fish,\" she said. They walked down the road with the sloping embankment rising up on both sides of them. They heard a deep rhythmic snorting sound, but Grant could not see where it was coming from. \"Are you sure there\u0027s a raft down here?\" Lex said, wrinkling her nose. \"Probably,\" Grant said. The rhythmic snorting became louder as they walked, but they also heard a steady droning, buzzing sound. When they reached the end of the road, at the edge of the small concrete dock, Grant froze in shock. The tyrannosaur was right there. It was sitting upright in the shade of a tree, its hind legs stretched out in front. Its eyes were open but it was not moving, except for its head, which lifted and fell gently with each snorting sound. The buzzing came from the clouds of flies that surrounded it, crawling over its face and slack jaws, its bloody fangs, and the red haunch of a killed hadrosaur that lay on its side behind the tyrannosaur. The tyrannosaur was only twenty yards away. Grant felt sure it must have seen him, but the big animal did not respond. It just sat there. It took him a moment to realize: the tyrannosaur was asleep. Sitting up, but asleep. He signaled to Tim and Lex to stay where they were. Grant walked slowly forward onto the dock, in full view of the tyrannosaur. The big animal continued to sleep, snoring softly. Near the end of the dock, a wooden shed was painted green to blend with the foliage. Grant quietly unlatched the door and looked inside. He saw a half-dozen orange life vests hanging on the wall, several rolls of wire-mesh fencing, some coils of rope, and twob ig rubber cubes sitting on the floor. The cubes were strapped tight with flat rubber belts. Rafts. He looked back at Lex. She mouthed: No boat He nodded, Yes. The tyrannosaur raised its forelimb to swipe at the flies buzzing around its snout. But otherwise it did not move. Grant pulled one of the cubes out onto the dock. It was surprisingly heavy. He freed the straps, found the inflation cylinder. With a loud hiss, the rubber began to expand, and then with a hiss-whap! it popped fully open on the dock. The sound was fearfully loud in their ears. Grant turned, stared up at the dinosaur. The tyrannosaur grunted, and snorted. It began to move. Grant braced himself to run, but the animal shifted its ponderous bulk and then it settled back against the tree trunk and gave a long, growling belch. Lex looked disgusted, waving her hand in front of her face. Grant was soaked in sweat from the tension. He dragged the rubber raft across the dock. It flopped into the water with a loud splash. The dinosaur continued to sleep. Grant tied the boat up to the dock, and returned to the shed to take out two life preservers. He put these in the boat, and then waved for the kids to come out onto the dock. Pale with fear, Lex waved back, No. He gestured: Yes. The tyrannosaur continued to sleep. Grant stabbed in the air with an emphatic finger. Lex came silently, and he gestured for her to get into the raft; then Tim got in, and they both put on their life vests. Grant got in and pushed off. The raft drifted silently out into the lagoon. Grant picked up his paddles and fitted them into the oarlocks. They moved farther from the dock. Lex sat back, and sighed loudly with relief. Then she looked stricken, and put her band over her mouth. Her body shook, with muffled sounds: she was suppressing a cough. She always coughed at the wrong times! \"Lex,\" Tim whispered fiercely, looking back toward the shore. She shook her head miserably, and pointed to her throat. He knew what she meant: a tickle in her throat. What she needed was a drink of water. Grant was rowing, and Tim leaned over the side of the raft and scooped his hand in the lagoon, holding his cupped hand toward her. Lex coughed loudly, explosively. In Tim\u0027s ears, the sound echoed across the water like a gunshot. The tyrannosaur yawned lazily, and scratched behind its ear with its hind foot, just like a dog. It yawned again. It was groggy after its big meal, and it woke up slowly. On the boat, Lex was making little gargling sounds. \"Lex, shut up!\" Tim said. \"I can\u0027t help it,\" she whispered, and then she coughed again. Grant rowed hard, moving the raft powerfully into the center of the lagoon. On the shore, the tyrannosaur stumbled to its feet. \"I couldn\u0027t help it, Timmy!\" Lex shrieked miserably. \"I couldn\u0027t help it!\" \"Shhhh!\" Grant was rowing as fast as he could. \"Anyway, it doesn\u0027t matter,\" she said. \"We\u0027re far enough away. He can\u0027t swim. \"Of course he can swim, you little idiot!\" Tim shouted at her. On the shore, the tyrannosaur stepped off the dock and plunged into the water. It moved strongly into the lagoon after them. \"Well, how should I know?\" she said. \"Everybody knows tyrannosaurs can swim! It\u0027s in all the books! Anyway, all reptiles can swim!\" \"Snakes can\u0027t.\" \"Of course snakes can. You idiot!\" \"Settle down,\" Grant said. \"Hold on to something!\" Grant was watching the tyrannosaur, noticing how the animal swam. The tyrannosaur was now chest-deep in the water, but it could hold its big head high above the surface. Then Grant realized the animal wasn\u0027t swimming, it was walking, because moments later only the very top of the head-the eyes and nostrils-protruded above the surface. By then it looked like a crocodile, and it swam like a crocodile, swinging its big tail back and forth, so the water churned behind it. Behind the head, Grant saw the hump of the back, and the ridges along the length of tail, as it occasionally broke the surface. Exactly like a crocodile, he thought unhappily. The biggest crocodile in the world. \"I\u0027m sorry, Dr. Grant!\" Lex wailed. \"I didn\u0027t mean it!\" Grant glanced over his shoulder. The lagoon was no more than a hundred yards wide here, and they had almost reached the center. If he continued, the water would become shallow again. The tyrannosaur would be able to walk again, and he would move faster in shallow water. Grant swung the boat around, and began to row north. \"What are you doing?\" The tyrannosaur was now just a few yards away. Grant could hear its sharp snorting breaths as it came closer. Grant looked at the paddles in his hands, but they were light plastic-not weapons at all. The tyrannosaur threw its head back and opened its jaws wide, showing rows of curved teeth, and then in a great muscular spasm lunged forward to the raft, just missing the rubber gunwale, the huge skull slapping down, the raft rocking away on the crest of the splash. The tyrannosaur sank below the surface, leaving gurgling bubbles. The lagoon was still. Lex gripped the gunwale handles and looked back. \"Did he drown?\" \"No,\" Grant said. He saw bubbles-then a faint ripple along the surface-coming toward the boat- \"Hang on!\" he shouted, as the head bucked up beneath the rubber, bending the boat and lifting it into the air, spinning them crazily before it splashed down again. \"Do something!\" Alexis screamed. \"Do something!\" Grant pulled the air pistol out of his belt. It looked pitifully small in his hands, but there was the chance that, if he shot the animal in a sensitive spot, in the eye or the nose- The tyrannosaur surfaced beside the boat, opened its jaws, and roared. Grant aimed, and fired. The dart flashed in the light, and smacked into the cheek. The tyrannosaur shook its head, and roared again. And suddenly they heard an answering roar, floating across the water toward them. Looking back, Grant saw the juvenile T-rex on the shore, crouched over the killed sauropod, claiming the kill as its own. The juvenile slashed at the carcass, then raised its head high and bellowed. The big tyrannosaur saw it, too, and the response was immediate-it turned back to protect its kill, swimming strongly toward the shore. \"He\u0027s going away!\" Lex squealed, clapping her hands. \"He\u0027s going away! Naah-naah-na-na-naah! Stupid dinosaur!\" From the shore, the juvenile roared defiantly. Enraged, the big tyrannosaur burst from the lagoon at full speed, water streaming from its enormous body as it raced up the hill past the dock. The juvenile ducked its head and fled, its jaws still filled with ragged flesh. The big tyrannosaur chased it, racing past the dead sauropod, disappearing over the hill. They heard its final threatening bellow, and then the raft moved to the north, around a bend in the lagoon, to the river. Exhausted from rowing, Grant collapsed back, his chest heaving. He couldn\u0027t catch his breath. He lay gasping in the raft. \"Are you okay, Dr. Grant?\" Lex asked. \"From now on, will you just do what I tell you?\" \u0027Oh-kay, \" she sighed, as if he had just made the most unreasonable demand in the world. She trailed her arm in the water for a while. \"You stopped rowing,\" she said. \"I\u0027m tired,\" Grant said. \"Then how come we\u0027re still moving?\" Grant sat up. She was right. The raft drifted steadily north. \"There must be a current.\" The current was carrying them north, toward the hotel. He looked at his watch and was astonished to see it was fifteen minutes past seven. Only fifteen minutes had passed since he had last looked at his watch. It seemed like two hours. Grant lay back against the rubber gunwales, closed his eyes, and slept. FIFTH ITERATION [picture] \"Flaws in the system will now become severe.\" IAN MALCOM Search Gennaro sat in the Jeep and listened to the buzzing of the flies, and stared at the distant palm trees wavering in the heat. He was astonished by what looked like a battleground: the grass was trampled flat for a hundred yards in every direction. One big palm tree was uprooted from the ground. There were great washes of blood in the grass, and on the rocky outcropping to their right. Sitting beside him, Muldoon said, \"No doubt about it. Rexy\u0027s been among the hadrosaurs.\" He took another drink of whiskey, and capped the bottle. \"Damn lot of flies,\" he said. They waited, and watched. Gennaro drummed his fingers on the dashboard. \"What are we waiting for?\" Muldoon didn\u0027t answer immediately. \"The rex is out there somewhere,\" he said, squinting at the landscape in the morning sun. \"And we don\u0027t have any weapons worth a damn.\" \"We\u0027re in a Jeep.\" \"Oh, he can outrun the Jeep, Mr. Gennaro,\" Muldoon said, shaking his head. \"Once we leave this road and go onto open terrain, the best we can do in a four-wheel drive is thirty, forty miles an hour. He\u0027ll run us right down. No problem for him.\" Muldoon sighed. \"But I don\u0027t see much moving out there now. You ready to live dangerously?\" \"Sure,\" Gennaro said. Muldoon started the engine, and at the sudden sound, two small othnielians leapt up from the matted grass directly ahead. Muldoon put the car in gear. He drove in a wide circle around the trampled site, and then moved inward, driving in decreasing concentric circles until he finally came to the place in the field where the little othnielians had been. Then he got out and walked forward in the grass, away from the Jeep. He stopped as a dense cloud of flies lifted into the air. \"What is it?\" Gennaro called. \"Bring the radio,\" Muldoon said. Gennaro climbed out of the Jeep and hurried forward. Even from a distance he could smell the sour-sweet odor of early decay. He saw a dark shape in the grass, crusted with blood, legs askew. \"Young hadrosaur,\" Muldoon said, staring down at the carcass. \"The whole herd stampeded, and the young one got separated, and the T-rex brought it down.\" \"How do you know?\" Gennaro said. The flesh was ragged from many bites. \"You can tell from the excreta,\" Muldoon said. \"See those chalky white bits there in the grass? That\u0027s hadro spoor. Uric acid makes it white. But you look there\"-he pointed to a large mound, rising knee-high in the grass-\"that\u0027s tyrannosaur spoor.\" \"How do you know the tyrannosaur didn\u0027t come later?\" \"The bite pattern,\" Muldoon said. \"See those little ones there?\" He pointed along the belly. \"Those are from the othys. Those bites haven\u0027t bled. They\u0027re postmortem, from scavengers. Othys did that. But the hadro was brought down by a bite on the neck-you see the big slash there, above the shoulder blades-and that\u0027s the T-rex, no question.\" Gennaro bent over the carcass, staring at the awkward, trampled limbs with a sense of unreality. Beside him, Muldoon flicked on his radio. \"Control. \" \"Yes,\" John Arnold said, over the radio. \"We got another hadro dead. Juvenile.\" Muldoon bent down among the flies and checked the skin on the sole of the right foot. A number was tattooed there, \"Specimen is number HD/09.\" The radio crackled. \"I\u0027ve got something for you,\" Arnold said. \"Oh? What\u0027s that?\" \"I found Nedry.\" The Jeep burst through the line of palm trees along the east road and came out into a narrower service road, leading toward the jungle river. It was hot in this area of the park, the jungle close and fetid around them. Muldoon was fiddling with the computer monitor in the Jeep, which now showed a map of the resort with overlaid grid lines. \"They found him up on remote video,\" he said. \"Sector 1104 is just ahead.\" Farther up the road, Gennaro saw a concrete barrier, and the Jeep parked alongside it. \"He must have taken the wrong turnoff,\" Muldoon said. \"The little bastard.\" \"What\u0027d he take?\" Gennaro asked. \"Wu says fifteen embryos. Know what that\u0027s worth?\" Gennaro shook his head. \"Somewhere between two and ten million,\" Muldoon said. He shook his head. \"Big stakes.\" As they came closer, Gennaro saw the body lying beside the car. The body was indistinct and green-but then green shapes scattered away, as the Jeep pulled to a stop. \"Compys,\" Muldoon said. \"The compys found him,\" A dozen procompsognathids, delicate little predators no larger than ducks, stood at the edge of the jungle, chittering excitedly as the men climbed out of the car. Dennis Nedry lay on his back, the chubby boyish face now red and bloated. Flies buzzed around the gaping mouth and thick tongue. His body was mangled-the intestines torn open, one leg chewed through. Gennaro turned away quickly, to look at the little compys, which squatted on their hind legs a short distance away and watched the men curiously. The little dinosaurs had five-fingered hands, he noticed. They wiped their faces and chins, giving them an eerily human quality which- \"I\u0027ll be damned,\" Muldoon said. \"Wasn\u0027t the compys.\" \"What?\" Muldoon was shaking his head. \"See these blotches? On his shirt and his face? Smell that sweet smell like old, dried vomit?\" Gennaro rolled his eyes. He smelled it. \"That\u0027s dilo saliva,\" Muldoon said. \"Spit from the dilophosaurs. You see the damage on the corneas, all that redness. In the eyes it\u0027s painful but not fatal. You\u0027ve got about two hours to wash it out with the antivenin; we keep it all around the park, just in case. Not that it mattered to this bastard. They blinded him, then ripped him down the middle. Not a nice way to go. Maybe there\u0027s justice in the world after all.\" The procompsognatbids squeaked and hopped up and down as Gennaro opened the back door and took out gray metal tubing and a stainless-steel case. \"It\u0027s all still there,\" he said. He handed two dark cylinders to Gennaro. \"What\u0027re these?\" Gennaro said. \"Just what they look like,\" Muldoon said. \"Rockets.\" As Gennaro backed away, he said, \"Watch it-you don\u0027t want to step in something.\" Gennaro stepped carefully over Nedry\u0027s body. Muldoon carried the tubing to the other Jeep, and placed it in the back. He climbed behind the wheel. \"Let\u0027s go.\" \"What about him?\" Gennaro said, pointing to the body. \"What about him?\" Muldoon said. \"We\u0027ve got things to do.\" He put the car in gear. Looking back, Gennaro saw the compys resume their feeding. One jumped up and squatted on Nedry\u0027s open mouth as it nibbled the flesh of his nose. The jungle river became narrower. The banks closed in on both sides until the trees and foliage overhanging the banks met high above to block out the sun. Tim heard the cry of birds, and saw small chirping dinosaurs leaping among the branches. But mostly it was silent, the air hot and still beneath the canopy of trees. Grant looked at his watch. It was eight o\u0027clock. They drifted along peacefully, among dappled patches of light. If anything, they seemed to be moving faster than before. Awake now, Grant lay on his back and stared up at the branches overhead. In the how, he saw her reaching up. \"Hey, wbat\u0027re you doing?\" he said. \"You think we can eat these berries?\" She pointed to the trees. Some of the overhanging branches were close enough to touch. Tim saw clusters of bright red berries on the branches. \"No,\" Grant said. \"Why? Those little dinosaurs are eating them.\" She pointed to small dinosaurs, scampering in the branches. \"No, Lex.\" She sighed, dissatisfied with his authority. \"I wish Daddy was here,\" she said. \"Daddy always knows what to do.\" \"What\u0027re you talking about?\" Tim said. \"He never knows what to do.\" \"Yes, he does,\" she sighed. Lex stared at the trees as they slid past, their big roots twisting toward the water\u0027s edge. \"Just because you\u0027re not his favorite . . .\" Tim turned away, said nothing. \"But don\u0027t worry, Daddy likes you, too. Even if you\u0027re into computers and not sports.\" \"Dad\u0027s a real sports nut,\" Tim explained to Grant. Grant nodded. Up in the branches, small pale yellow dinosaurs, barely two feet tall, hopped from tree to tree. They had beaky heads, like parrots. \"You know what they call those?\" Tim said. \"Microceratops.\" \"Big deal,\" Lex said. \"I thought you might be interested.\" \"Only very young boys,\" she said, \"are interested in dinosaurs.\" \"Says who?\" \"Daddy.\" Tim started to yell, but Grant raised his band. \"Kids,\" he said, \"shut up.\" \"Why?\" Lex said, \"I can do what I want, if I-\" Then she fell silent, because she heard it, too. It was a bloodcurdling shriek, from somewhere downriver. Well, where the hell is the damn rex?\" Muldoon said, talking into the radio. \"Because we don\u0027t see him here.\" They were back at the sauropod compound, looking out at the trampled grass where the hadrosaurs had stampeded. The tyrannosaur was nowhere to be found. \"Checking now,\" Arnold said, and clicked off. Muldoon turned to Gennaro. \"Checking now,\" he repeated sarcastically. \"Why the hell didn\u0027t he check before? Why didn\u0027t he keep track of him?\" \"I don\u0027t know,\" Gennaro said. \"He\u0027s not showing up,\" Arnold said, a moment later. \"What do you mean, he\u0027s not showing up?\" \"He\u0027s not on the monitors. Motion sensors aren\u0027t finding him.\" \"Hell,\" Muldoon said. \"So much for the motion sensors. You see Grant and the kids?\" \"Motion sensors aren\u0027t finding them, either.\" \"Well, what are we supposed to do now?\" Muldoon said. \"Wait,\" Arnold said. \"Look! Look!\" Directly ahead, the big dome of the aviary rose above them. Grant had seen it only from a distance; now he realized it was enormous-a quarter of a mile in diameter or more. The pattern of geodesic struts shone dully through the light mist, and his first thought was that the glass must weigh a ton. Then, as they came closer, he saw there wasn\u0027t any glass-just struts. A thin mesh hung inside the elements. \"It isn\u0027t finished,\" Lex said. \"I think it\u0027s meant to be open like that,\" Grant said. \"Then all the birds can fly out.\" \"Not if they\u0027re big birds,\" Grant said. The river carried them beneath the edge of the dome. They stared upward. Now they were inside the dome, still drifting down the river. But \u0027thin minutes the dome was so high above them that it was hardly visible in the mist. Grant said, \"I seem to remember there\u0027s a second lodge here.\" Moments later, he saw the roof of a building over the tops of the trees to the north. \"You want to stop?\" Tim said. \"Maybe there\u0027s a phone. Or motion sensors.\" Grant steered toward the shore. \"We need to try to contact the control room. It\u0027s getting late.\" They clambered out, slipping on the muddy bank, and Grant hauled the raft out of the water. Then he tied the rope to a tree and they set off, through a dense forest of palm trees. Aviary \"I just don\u0027t understand,\" John Arnold said, speaking into the phone. \"I don\u0027t see the rex, and I don\u0027t see Grant and the kids anywhere, either.\" He sat in front of the consoles and gulped another cup of coffee. All around him, the control room was strewn with paper plates and half-eaten sandwiches. Arnold was exhausted. It was 8:00 a.m. on Saturday. In the fourteen hours since Nedry destroyed the computer that ran Jurassic Park, Arnold had patiently pulled systems back on line, one after another. \"All the park systems are back, and functioning correctly. The phones are working. I\u0027ve called for a doctor for you.\" On the other end of the line, Malcolm coughed. Arnold was talking to him in his room at the lodge. \"But you\u0027re having trouble with the motion sensors?\" \"Well, I\u0027m not finding what I am looking for.\" \"Like the rex?\" \"He\u0027s not reading at all now. He started north about twenty minutes ago, following along the edge of the lagoon, and then I lost him. I don\u0027t know why, unless he\u0027s gone to sleep again.\" \"And you can\u0027t find Grant and the kids?\" \"No.\" \"I think it\u0027s quite simple,\" Malcolm said. \"The motion sensors cover an inadequate area.\" \"Inadequate?\" Arnold bristled. \"They cover ninety-two-\" \"Ninety-two percent of the land area, I remember,\" Malcolm said. \"But if you put the remaining areas up on the board, I think you\u0027ll find that the eight percent is topologically unified, meaning that those areas are contiguous. In essence, an animal can move freely anywhere in the park and escape detection, by following a maintenance road or the jungle river or the beaches or whatever.\" \"Even if that were so,\" Arnold said, \"the animals are too stupid to know that.\" \"It\u0027s not clear how stupid the animals are,\" Malcolm said. \"You think that\u0027s what Grant and the kids are doing?\" Arnold said. \"Definitely not,\" Malcolm said, coughing again. \"Grant\u0027s no fool. He clearly wants to be detected by you. He and the kids are probably waving at every motion sensor in sight. But maybe they have other problems we don\u0027t know about. Or maybe they\u0027re on the river.\" \"I can\u0027t imagine they\u0027d be on the river. The banks are very narrow. It\u0027s impossible to walk along there.\" \"Would the river bring them all the way back here?\" \"Yes, but it\u0027s not the safest way to go, because it passes through the aviary. . . .\" \"Why wasn\u0027t the aviary on the tour?\" Malcolm said. \"We\u0027ve had problems setting it up. Originally the park was intended to have a treetop lodge built high above the ground, where visitors could observe the pterodactyls at flight level. We\u0027ve got four dactyls in the aviary now-actually, they\u0027re cearadactyls, which are big fish-eating dactyls.\" \"What about them?\" \"Well, while we finished the lodge, we put the dactyls in the aviary to acclimate them. But that was a big mistake. It turns out our fish-hunters are territorial.\" \"Territorial?\" \"Fiercely territorial,\" Arnold said. \"They fight among themselves for territory-and they\u0027ll attack any other animal that comes into the area they\u0027ve marked out.\" \"Attack?\" \"It\u0027s impressive,\" Arnold said. \"The dactyls glide to the top of the aviary, fold up their wings, and dive. A thirty-pound animal will strike a man on the ground like a ton of bricks. They were knocking the workmen unconscious, cutting them up pretty badly.\" \"That doesn\u0027t injure the dactyls?\"","sourceLink":"https://allnovel.net/jurassic-park-jurassic-park-1/page-20.html","bookId":1711,"book":{"id":1711,"title":"Jurassic Park (Jurassic Park #1)","description":"Storyline: Jurassic Park (Jurassic Park #1) An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Creatures once extinct now roam Jurassic Park, soon-to-be opened as a theme park. Until something goes wrong...and science proves a dangerous toy.","cover":"https://allnovel.net/images/jurassic-park-jurassic-park-1.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jurassic-park-jurassic-park-1.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:02:14 AM"}}
