{"id":94600,"no":25,"title":"Page 25","content":"\\n\\n \"You okay, buddy?\" Rhys asked.\\n\\n \"Yeah, sure. Sounds like a close call.\"\\n\\n \"Too damn close!\"\\n\\n \"I always said you needed better security around here. A baby could break into this place.\"\\n\\n \"How did they know where to find me?\" Rhys asked, his voice sharp. \"That\u0027s what I want to know.\"\\n\\n \"You think I sent them?\" Erik asked, his tone equally sharp.\\n\\n \"I don\u0027t know.\" Rhys stared at him, his eyes narrowed with suspicion. \"You\u0027re the only one who knows I rest here from time to time.\"\\n\\n \"It wouldn\u0027t take a genius to figure it out. Anyway, I\u0027m probably the only one on the West Coast who doesn\u0027t want you dead. The rest of them would be fighting to take your place before your ashes were cold.\"\\n\\n Rhys grunted softly, and then chuckled. \"Come on,\" he said, his good nature restored. \"Let\u0027s go find you some dinner, and then we\u0027ll have dessert.\"\\n\\n Chapter 20\\n\\n \"Daisy! Dammit, Daisy, where are you?\"\\n\\n \"I\u0027m up here. What\u0027s wrong?\" She peered over the banister, startled to see Erik moving swiftly toward the foot of the stairs, so swiftly he was little more than a blur.\\n\\n \"Get your things together. We\u0027re leaving.\"\\n\\n \"Leaving? Why? Where are we going?\"\\n\\n \"Rhys knows what you look like. He\u0027s tasted your brother\u0027s blood. How long do you think it will take him to track the two of you down?\"\\n\\n \"So he\u0027s still alive,\" she murmured.\\n\\n \"Very much so.\"\\n\\n Daisy felt the blood drain from her face. All too clearly she recalled the fury blazing in the vampire\u0027s hell-red eyes when he had whirled around to face her. She had seen death in those eyes. Her death.\\n\\n \"We need to go, Daisy. Now.\"\\n\\n \"You\u0027re right, of course. Alex...\"\\n\\n \"What about him?\"\\n\\n \"We can\u0027t tell him that you\u0027ve talked to Rhys.\"\\n\\n \"Right.\"\\n\\n Daisy chewed on her lower lip thoughtfully. \"I\u0027ll just tell him that I think we need to get out of LA, that I\u0027ve got a bad feeling about staying here any longer since I\u0027m not sure that I destroyed Rhys.\"\\n\\n \"Will he buy that?\"\\n\\n \"I think so.\"\\n\\n \"Tell him whatever you need to, but do it now.\"\\n\\n While Daisy went to talk to Alex, Erik went upstairs to his room. He threw a change of clothes and a long, black hooded cloak into a suitcase, packed his laptop, and shoved a pair of sunglasses into his pocket. As an afterthought, he grabbed a T-shirt and a pair of gray sweatpants for Alex and headed downstairs to the guest room, wondering, as he did so, how he had gotten so tangled up in the affairs of the O\u0027Donnell family. Of course, he knew the answer, and her name was Daisy.\\n\\n Alex was sitting up in bed when Erik entered the room. Daisy glanced at him over her shoulder, her expression telling him that she had explained things to her brother.\\n\\n Erik tossed the T-shirt and sweats on the bed. \"Are you strong enough to get dressed on your own?\"\\n\\n \"Damn right!\"\\n\\n \"Then do it. We\u0027re leaving in five minutes.\" With another glance at Daisy, Erik left the room.\\n\\n She followed him into the living room.\\n\\n \"Have you got everything?\" Erik asked.\\n\\n She nodded. She hadn\u0027t had anything with her other than her handbag, her cell phone, and her kit when they arrived. \"You don\u0027t think we waited too long, do you? You don\u0027t think he\u0027s out there?\"\\n\\n \"No, but we need to put some miles behind us before sunrise.\"\\n\\n Daisy glanced at her watch. It would be light in a few hours. \"Does Rhys...can he be out during the day?\"\\n\\n \"Not in direct sunlight.\" He looked past Daisy as Alex entered the room. \"Are we ready?\"\\n\\n \"I think so,\" Daisy said. \"Let\u0027s go.\"\\n\\n \"We\u0027ll take my car,\" Erik said.\\n\\n \"Hey, what about my Lexus?\" Alex asked.\\n\\n \"Leave it,\" Erik said. \"You\u0027re in no condition to drive.\"\\n\\n As they left the relative safety of Erik\u0027s house, Daisy felt a rush of anxiety. What if Erik was wrong? What if Rhys was outside, waiting for them? If he attacked, could the three of them fight him off? Alex looked better, but she could tell by the fine lines around his mouth that he hadn\u0027t yet regained his full strength. As for herself, she was out of holy water and the last time she had seen her hawthorn stake, it had been sticking out of Rhys Costain\u0027s chest.\\n\\n She glanced at Erik, who was helping Alex, none too gently, into the backseat of his car. Erik was their only hope.\\n\\n She climbed into the front seat, thinking it was a bit ironic that she had spent her adult life hunting vampires, and now the oldest vampire in the city was hunting her.\\n\\n \"What?\" She glanced at Erik, realizing he had asked her a question.\\n\\n \"I asked if there\u0027s anywhere in particular you want to go?\"\\n\\n \"Home,\" she said. \"I want to go home to Boston.\"\\n\\n \"Do you think that\u0027s a good idea?\" Erik asked.\\n\\n \"I don\u0027t know. I don\u0027t care. I just want to go home.\" She glanced over her shoulder. \"Alex?\"\\n\\n \"We should go home,\" he agreed. \"Safety in numbers and all that.\"\\n\\n Erik grunted softly, wondering if he had made a mistake in letting Daisy decide where she wanted to go. Under the circumstances, returning the brother and sister to their vampire-hunting parents didn\u0027t seem like the wisest thing for him to do.\\n\\n They drove in silence for the next hour or so.\\n\\n Daisy sighed as she stared out the window at the passing scenery. Alex had fallen asleep. Erik appeared to be deep in thoughts he didn\u0027t seem inclined to share. It was probably just as well. She had caused him nothing but trouble. He was probably regretting the fact that he had ever met her. Well, there was nothing she could do about that now. He would probably take her home and drop her off and she would never see him again. Sadly, she knew that was probably for the best.\\n\\n As the miles slipped by, Daisy found herself constantly looking behind them, expecting to see Rhys right on their tail, his eyes glowing like twin coals from the pit of hell.\\n\\n Daisy woke when the car came to a stop. She hadn\u0027t meant to fall asleep. Sitting up, she saw that they were parked behind the Big Top Motel. The sky was growing light in the east.\\n\\n \"Stay here,\" Erik said. \"I\u0027m going to get a couple of rooms.\"\\n\\n She nodded, her gaze following him as he got out of the car and walked around the building. Two rooms, she thought, and wondered who was sleeping with whom.\\n\\n Erik returned a short time later. Opening her car door, he handed her a room key. \"You and Alex are in twelve,\" he said. \"I\u0027m right next door.\"\\n\\n After getting out of the car, Daisy shook her brother\u0027s shoulder. \"Alex?\"\\n\\n He muttered something unintelligible, but didn\u0027t wake up.\\n\\n \"What\u0027s wrong with him?\" Daisy asked.\\n\\n \"Nothing. He\u0027s still healing. I\u0027ll carry him inside. He\u0027ll be fine when he wakes up.\"\\n\\n With a nod, Daisy stepped out of the car and opened the back door. Erik lifted Alex as if he weighed no more than a child, carried him into the room, and settled him on one of the twin beds.\\n\\n \"I guess I don\u0027t have to tell you to keep the window closed and the door locked,\" Erik said, turning to face her.\\n\\n \"Will you be all right?\" Daisy asked. \"Wouldn\u0027t it be better if we all stayed together?\"\\n\\n \"Probably, but I think I\u0027ll live longer if your brother goes on thinking I\u0027m an artist.\"\\n\\n \"Probably,\" Daisy said, grinning. \"Although he\u0027s going to wonder why we\u0027re spending the day here.\"\\n\\n \"Just tell him I drove all night and I needed the rest.\"\\n\\n \"All right.\" She looked up at him, wishing he would take her in his arms. Right or wrong, she felt safe in his embrace.\\n\\n Her stomach tingled with anticipation when his gaze moved over her face, lingering on her lips. He was going to kiss her.\\n\\n Murmuring her name, he pulled her roughly into his arms. \"What am I going to do with you, Daisy, darlin\u0027?\"\\n\\n She looked up at him, drowning in the depths of his deep black eyes. He could do anything he wanted with her, she thought. Didn\u0027t he know that?\\n\\n Her eyelids fluttered down as his mouth covered hers. She pressed against him, wanting to be closer, wanting to feel his skin against hers, his hands on her flesh. In his arms, she could face anything, be anything. She wanted to be a part of him, to give him everything she was, everything she would ever be.\\n\\n She moaned softly as his hand moved restlessly up and down her spine, his touch somehow erotic, even through her clothing. She wanted to touch him, needed to feel his skin beneath her hand. Tugging his shirt from his jeans, she pressed her palms to his back. His skin was smooth and cool.\\n\\n \"My turn,\" he whispered.\\n\\n She gasped his name when his hands slid under her sweater. He walked her backward until she was against the wall, and then he leaned into her, letting her feel his desire. She writhed against him, aching and needy, willing, at that moment, to do anything he wanted if he would satisfy the ache building deep inside.\\n\\n She might have surrendered to him then and there if Alex hadn\u0027t cleared his throat. \"Do you guys think I could get some breakfast before you devour each other?\"\\n\\n Erik drew back, his eyes hot. He stared at Daisy a moment, then pressed his car keys and a handful of cash into her hand. \"Get him something to eat,\" he said, his voice ragged. \"But have it delivered. I\u0027ll see you tonight.\"\\n\\n Before Daisy could say ah, yes, or no, Erik was gone.\\n\\n Daisy glared at her brother. Couldn\u0027t he have stayed asleep for another hour or two?\\n\\n \"Maybe you two had better get a room of your own,\" Alex said dryly.\\n\\n \"Oh, shut up!\" Daisy said irritably.\\n\\n Muttering under his breath, Erik darted from Daisy\u0027s room to his own. The rising sun burned his eyes, but it was nothing to the fire burning in his loins. Damn her brother\u0027s untimely interference!\\n\\n Slamming the door, Erik stood with his back against it for a moment, cursing his bad luck. Another five minutes and he would have had Daisy in his arms, in his bed. \\n\\n","sourceLink":"https://allnovel.net/everlasting-kiss-everlasting-1/page-25.html","bookId":2303,"book":{"id":2303,"title":"Everlasting Kiss (Everlasting #1)","description":"Storyline: Everlasting Kiss (Everlasting #1) \\n Daisy O\u0027Donnell doesn\u0027t get the attraction some women feel for vampires. She likes her men with a heartbeat. And she\u0027s just met one who\u0027s full of life: Erik Delacourt, the unreasonably sexy man she keeps meeting at a popular L.A. nightclub called the Crypt. She barely knows him, but there\u0027s no resisting the connection she feels. . . \\n There\u0027s one important detail Erik hasn\u0027t gotten around to telling her yet. He\u0027s a powerful vampire out to hunt the Blood Thief who is draining young vampires all over the city--and who has just raised the stakes by destroying one of Erik\u0027s friends. To Erik, Daisy is a bright spot of innocence in a world of darkness and menace. He\u0027ll do anything--even lie to her--to keep her safe and pure. \\n If only he knew that Daisy has something of her own to hide. . .\\n","cover":"https://allnovel.net/images/everlasting-kiss-everlasting-1.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-kiss-everlasting-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:08:15 PM"}}
