{"id":94622,"no":47,"title":"Page 47","content":"\\n\\n Rhys nodded. \"So they say.\"\\n\\n \"They also say that too much will kill you, and that some people come down hard, and some never come down.\" Just his luck, Alex thought. The one and only time he\u0027d had a chance to find out what it was like, and he\u0027d been unconscious.\\n\\n \"So they say.\" Rhys bared his fangs. \"It\u0027s better straight from the source.\"\\n\\n Alex stared at the vampire, at the gleaming white fangs. What would it be like to taste vampire blood? He had tasted his own blood. What human hadn\u0027t pricked a finger or received a small cut and licked the blood away? It was a natural reaction. But to drink vampire blood--Undead blood--to feel what it was like to be a vampire--the power...the invincibility...he wasn\u0027t unconscious now. What would it be like?\\n\\n With a shake of his head, Alex sat back in his chair. What the hell was he thinking?\\n\\n Rhys laughed. \"Where\u0027s your courage, hunter?\"\\n\\n Erik stared at the woman lying so trustingly in his arms. Never in all his existence had he expected to feel this way about a mortal woman. With Daisy, he felt anything was possible. Almost, he could believe he was just an ordinary man in love with a woman, that they could have a future together. A nice dream, but that\u0027s all it was. There was no place for them in the world he lived in, and certainly no place for him in hers.\\n\\n She smiled up at him, a sleepy, satisfied smile, one that stroked his ego because he had put that smile on her face.\\n\\n \"What are you thinking about?\" she asked.\\n\\n \"How incredible you are.\"\\n\\n \"You are.\"\\n\\n \"There is something I\u0027ve been wondering about,\" Erik said. \"How did you find me at La Morte Rouge?\"\\n\\n \"I felt your pain, and I followed it.\" She frowned at the memory, then reached up to cup his cheek. \"How did you stand it? I\u0027ve never experienced anything so awful, so...I don\u0027t know. I can\u0027t describe it.\"\\n\\n Erik shook his head. \"How could you feel it? I blocked the link between us so that you wouldn\u0027t.\"\\n\\n \"Well, I guess it didn\u0027t work.\"\\n\\n \"You really are incredible.\" He kissed her lightly. He hadn\u0027t wanted her to know what he was going through, had been afraid she would do exactly what she had done and ride to his rescue. \"My brave, foolish flower.\" He glanced out the window. It was time to go. \"It\u0027s a quarter after eleven, Daisy darlin\u0027.\"\\n\\n \"I wish you didn\u0027t have to go.\"\\n\\n \"I know.\" Erik trailed his fingertips down her cheek. \"Don\u0027t you think I\u0027d rather stay here with you?\"\\n\\n With a sigh, Daisy snuggled closer to his side. Some people were addicted to vampire blood, she thought, but not her. She was addicted to a vampire. Just looking at him made her high. His kisses were as intoxicating as the touch of his hand--that big, powerful hand that was gently stroking her thigh, making her quiver for more.\\n\\n She sat up, reluctant to let him go, but knowing she couldn\u0027t ask him to stay. She didn\u0027t trust Rhys Costain to watch out for Alex, but she knew Erik would take care of him, not because Erik cared whether her brother lived or died, but because he loved her.\\n\\n It was eleven forty-five when Erik followed Daisy into the living room. Rhys was stretched out on the floor in front of the TV. Alex sat on the sofa, going through his vampire hunting kit.\\n\\n Erik felt the tension in the room rising with each tick of the mantel clock.\\n\\n He glanced from Rhys to Alex and back again. \"So, what have you two been doing?\"\\n\\n \"Not much,\" Rhys said with a shrug. \"We spent some time comparing the merits of being a vampire as opposed to being a mortal.\"\\n\\n \"Is that so?\" Erik looked at Alex, one brow raised. \"Don\u0027t tell me you\u0027re thinking about joining the ranks of the Undead?\"\\n\\n \"Hardly.\" Alex glanced at his watch. \"Isn\u0027t it about time we were going?\"\\n\\n \"Finally.\" Rhys stood and moved toward the door in a single fluid movement.\\n\\n Daisy took Erik\u0027s hand in hers. \"You\u0027ll be careful, won\u0027t you? You won\u0027t let anything happen to Alex?\"\\n\\n \"Stop worrying.\" Erik slipped his arm around Daisy\u0027s shoulders and gave her a squeeze. \"We\u0027ll be back before you know it.\"\\n\\n \"That\u0027s right, kid,\" Rhys added as he went out the door. \"And your brother will be two hundred grand richer.\"\\n\\n Chapter 35\\n\\n Daisy blew out a sigh as the door closed behind Rhys Costain. She tried to tell herself there was nothing to worry about. Rhys was a powerful vampire. Erik was a powerful vampire. Between them, they would make sure that nothing happened to Alex.\\n\\n But what if Rhys was just stringing them along?\\n\\n What if Rhys couldn\u0027t be trusted?\\n\\n What if he intended to kill whoever it was who had put the hit out on him, then kill Alex, and maybe Erik, too?\\n\\n What if the man who had hired the hit brought backup with him?\\n\\n She told herself she was worrying for nothing, that she was just letting her imagination run wild.\\n\\n What if she wasn\u0027t?\\n\\n Was she just going to sit home and wait and worry?\\n\\n \"No.\"\\n\\n She filled her pockets with vials of holy water, grabbed a handful of sharp stakes, a silver-bladed knife, and her keys, and left the house.\\n\\n Whatever happened tonight, she was going to be there, hopefully only as an observer.\\n\\n A light rain began to fall as Alex pulled up in front of La Morte Rouge. He had dropped Costain and Delacourt off a few blocks back, just in case the man he was supposed to meet was holed up somewhere nearby, watching.\\n\\n After killing the engine, Alex spent a few minutes checking the place out. It looked deserted. No lights shone from inside. There were no other cars along the curb; from where he sat, he couldn\u0027t see any cars parked in the lot.\\n\\n He glanced behind him, wondering where Costain and Delacourt were hiding. Damn! How had he gotten mixed up in all this? Maybe it was time to rethink his career choice. He had always loved the excitement of the hunt, but lately...hell, he had put Daisy\u0027s life in danger, not to mention his own. He\u0027d wager he\u0027d had more close calls in the last month than he\u0027d had since he staked his first vampire. His hands tightened on the steering wheel. Putting his own life in danger had been one thing, but now Brandon was dead and Alex couldn\u0027t help feeling it was his fault. And if that wasn\u0027t bad enough, he owed his life to a stinkin\u0027 bloodsucker. He pounded his fist on the steering wheel. A bloodsucker who was in love with his sister. And, worst of all, Daisy was in love with him.\\n\\n Alex glanced out the window. He\u0027d farted around long enough. It was time to go. Muttering, \"Ready or not, here I come,\" he stepped out of the car. Turning his collar up against the rain, he reached into the backseat for his backpack. After slinging it over his shoulder, he slammed the door shut, then sprinted across the parking lot. He paused a moment at the top of the stone stairway, wishing, however briefly, that he possessed a vampire\u0027s enhanced sense of sight and smell.\\n\\n Screwing up his courage, he walked cautiously down the rain-slick stone steps that led to the club\u0027s back door. He knew it was only his imagination, but the night seemed to grow darker and more ominous with every step he took.\\n\\n He saw the figure near the back door as soon as he rounded the corner of the building. Even in the dark, he could see that it was a woman. A beautiful woman, he thought as he closed the distance between them. Her skin was pale, almost translucent. Wisps of light blond hair peeked out from the hood of her long red cloak.\\n\\n \"Alex?\"\\n\\n His surprise turned to uneasiness when he looked into her eyes. Dark brown eyes with a hint of madness. \"You\u0027re MC?\"\\n\\n \"Mariah, actually.\"\\n\\n \"But...you\u0027re one of them. A vampire.\" Alex didn\u0027t know what shocked him more, the fact that MC was a female, or the fact that he knew she was a vampire. He frowned inwardly, wondering how he knew, and then realized it had to have something to do with the fact that Erik\u0027s blood was running in his veins. But there was no time to think about that now. \"Why do you want to kill Costain?\"\\n\\n \"What difference does that make to you?\"\\n\\n \"None,\" Alex said, shrugging. As inconspicuously as possible, he checked the surrounding area. Where the hell were Costain and Delacourt?\\n\\n \"Where\u0027s the proof?\"\\n\\n \"What? Oh, right.\" Alex delved into his backpack for the jar filled with ashes from Daisy\u0027s fireplace. \"Where\u0027s the money?\"\\n\\n She held out her hand. \"Give it to me.\"\\n\\n Alex hesitated, then offered her the jar. Dammit, where was his backup?\\n\\n Mariah unscrewed the cap. She looked at Alex, then sniffed the jar\u0027s contents. \"What kind of joke are you playing?\"\\n\\n \"What do you mean?\"\\n\\n Mariah hurled the jar against the side of the building, where it shattered. \"You fool! Did you think I wouldn\u0027t know the difference?\"\\n\\n Alex took a step backward as her eyes blazed red.\\n\\n Mariah glided toward him, her hands curled into claws, her fangs running out.\\n\\n Muttering an oath, Alex turned on his heels and sprinted toward the staircase. And barreled into one very angry vampire.\\n\\n She hissed at him as she dug her claws into his shoulders. \"You stupid, puny mortal. Did you really think you could get away from me?\"\\n\\n Alex glared at her. Swallowing his fear, he lifted his chin defiantly. \"Kill me if you want. It won\u0027t save you. Rhys knows all about you.\"\\n\\n A flicker of fear sparked in her eyes. \"I don\u0027t believe you.\"\\n\\n \"He\u0027s here,\" Alex said, praying he was right.\\n\\n Mariah\u0027s gaze darted from right to left. \"Lies won\u0027t save you.\"\\n\\n \"Nothing will save you,\" Alex said with more bravado than he felt.\\n\\n \"Let him go!\"\\n\\n Alex\u0027s head jerked around. \"Daisy! What the hell are you doing here?\"\\n\\n Daisy waved the wooden stake in her hand. \"Backing you up, of course.\"\\n\\n An unladylike snort rose in Mariah\u0027s throat. \"You think you can save him with that sliver of wood?\"\\n\\n \"Just let him go!\" Daisy said, her voice rising. \"Let him go now!\"\\n\\n Mariah snorted with disdain. \"Stop waving that silly thing around. I can rip his throat out before you reach me, and kill you before you realize what\u0027s happened.\" \\n\\n","sourceLink":"https://allnovel.net/everlasting-kiss-everlasting-1/page-47.html","bookId":2303,"book":{"id":2303,"title":"Everlasting Kiss (Everlasting #1)","description":"Storyline: Everlasting Kiss (Everlasting #1) \\n Daisy O\u0027Donnell doesn\u0027t get the attraction some women feel for vampires. She likes her men with a heartbeat. And she\u0027s just met one who\u0027s full of life: Erik Delacourt, the unreasonably sexy man she keeps meeting at a popular L.A. nightclub called the Crypt. She barely knows him, but there\u0027s no resisting the connection she feels. . . \\n There\u0027s one important detail Erik hasn\u0027t gotten around to telling her yet. He\u0027s a powerful vampire out to hunt the Blood Thief who is draining young vampires all over the city--and who has just raised the stakes by destroying one of Erik\u0027s friends. To Erik, Daisy is a bright spot of innocence in a world of darkness and menace. He\u0027ll do anything--even lie to her--to keep her safe and pure. \\n If only he knew that Daisy has something of her own to hide. . .\\n","cover":"https://allnovel.net/images/everlasting-kiss-everlasting-1.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-kiss-everlasting-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:08:15 PM"}}
