{"id":94581,"no":6,"title":"Page 6","content":"\"Who\u0027s going to protect you while you\u0027re vulnerable?\" Erik asked, not bothering to mask the disdain in his tone. Damon shrugged. \"Rhys?\" Of those present, Rhys was the only one who was old enough and powerful enough to venture outside his lair during the day, even if it was only for a short time. \"He can\u0027t be in more than one place at a time,\" Erik pointed out. \"Yeah, I didn\u0027t think about that,\" Damon admitted, looking sheepish. \"A trap is still a good idea,\" Mariah insisted. She fixed Erik with a hard look. \"You can be awake during the day. You can be the bait. Rhys can back you up.\" \"We don\u0027t need to set any traps,\" Erik said. \"The Blood Thief isn\u0027t having any trouble finding us.\" \"What\u0027s the matter, Erik?\" Mariah asked, her brown eyes narrowed with contempt. \"Don\u0027t tell me you\u0027re afraid?\" \"Why don\u0027t you worry about your own head,\" he retorted, \"and let me worry about mine?\" \"That\u0027s enough,\" Rhys said, glancing from one to the other. \"Erik\u0027s right. The Blood Thief isn\u0027t having any trouble finding us. He found Tina. He found Saul. And even if we set a trap, there\u0027s no guarantee that the thief will fall for it. And while I\u0027m guarding the trap, there\u0027s nothing to stop the thief from attacking someone else.\" \"Perhaps a different kind of trap,\" Erik suggested. Rupert leaned forward in his chair. \"What kind of trap?\" \"Cameras. If we each set up a motion camera in our lair, we can catch the thief on tape.\" \"That might work,\" Nicholas remarked. \"I agree,\" Rupert said. \"The thief is using modern technology to mask his presence. I say we use it to catch him.\" \"We\u0027re in agreement, then,\" Rhys said. \"I expect you all to have cameras in place by tomorrow night.\" He thumped Erik on the back. \"Good thinking, buddy. Let\u0027s go out and get a drink to celebrate!\" Chapter 8 With a low groan, Daisy opened her eyes and checked the time, twice. It was almost two o\u0027clock in the afternoon. Little wonder she had slept so late. She didn\u0027t think she had gotten more than a few minutes of sleep last night. Every time she had closed her eyes, the image of the red-haired vampire had risen, sharp and clear, across the canvas of her mind. She could still feel the stake in her hand, the way it had slid into his flesh, like a knife through butter. See the look of astonishment on his face as it pierced his heart, see his body disintegrate into a pile of gray ash. The crimson robe, like a splash of bright blood, against the white satin. Gagging, she scrambled out of bed and into the bathroom. Dropping to her knees, she leaned over the toilet, grateful that she had very little in her stomach. Rising, she rinsed her mouth, then stripped off her pj\u0027s and stepped into the shower. She stood there, her forehead pressed against the glass, until the water grew cool. Washing quickly, she stepped out of the stall and wrapped a towel around her middle, then padded downstairs. Coffee. She needed coffee. And chocolate. The world and all of its problems always looked better after a quick jolt of caffeine. Minutes later, she sat at the table with a cup of coffee in one hand and a chocolate buttermilk doughnut in the other. For the first time, she found no comfort in caffeine or chocolate, but it didn\u0027t stop her from drinking the coffee or eating the doughnut. With a sigh, she went upstairs to dress. She couldn\u0027t sit in the house and mope all day. She couldn\u0027t stay in here and hide from her fears. She had to get out on the street again. But not today. Today, she was taking a vacation. She spent the early part of the afternoon sitting outside working on her tan. She took a nap. She read a book. She drove into town and treated herself to a full-body massage. She went to dinner at a nice restaurant. And then, feeling the need to be around a lot of people, she changed clothes, checked her make-up, and drove to the Crypt. She sensed Erik\u0027s presence the minute she stepped into the club. He must have been looking for her, she thought, because he was at her side before the door closed behind her. \"I was worried when you didn\u0027t show up last night,\" he said, his gaze moving over her face. \"Is everything all right?\" \"It is now,\" she said, and meant it. Just the sound of his voice, and suddenly all was right with the world again. Oh, Daisy, she thought, you\u0027ve got it really bad. Curling his fingers around hers, Erik led her to a secluded booth in the back and slid in beside her. Little frissons of heat raced across her skin when his thigh brushed hers. \"I\u0027m sorry I didn\u0027t make it last night,\" she said. \"Something unexpected came up.\" Or woke up, she thought, suppressing a shudder. \"I was afraid you were still angry because I stood you up the other night.\" \"No.\" \"We don\u0027t seem to have much luck arranging dates.\" He took her hand in his again, raised it to his lips, and brushed his lips across her palm. \"But we\u0027re together now. How about a late movie?\" Her heartbeat kicked up a notch at the thought of sitting beside him in a dark theater. \"All right.\" They left the club hand in hand. Erik paused at the curb. \"We can take my car,\" he said. \"Or we can walk.\" \"It\u0027s such a beautiful night,\" Daisy said. \"Why don\u0027t we walk?\" \"As you wish.\" His gaze rested lightly on her face, his expression clearly saying exactly what she was thinking--that she didn\u0027t feel comfortable getting into a car with a man she hardly knew. And yet it seemed right to be walking down the street by his side. \"Do you have family here in town?\" They were stopped at a corner, waiting for the light to change. \"No.\" Or anywhere else on earth, he thought. \"Have you lived in California very long?\" \"Three or four years.\" \"Where did you live before that?\" Erik chuckled. Technically, he hadn\u0027t \"lived\" anywhere for over three hundred years. \"I move around a lot. I\u0027ve lived in New York, Chicago, New Orleans, Atlanta, Nashville.\" And Rome, Paris, Transylvania, and just about every other city in the world. She looked up at him as they crossed the street. \"Got itchy feet, do you?\" \"You could say that.\" It didn\u0027t pay for a vampire to stay in one place too long. People got curious, and then suspicious, about neighbors who were never seen during the day, and who never got any older. \"What about you?\" he asked. \"Are you a California girl?\" \"I am now, but I was born in Oregon. We lived there until I was six, and then we moved to Boston.\" \"Why did you leave home?\" \"I like the West Coast. And I wanted to be on my own.\" They were at the theater now. Erik bought two tickets and they went inside. \"Do you want anything to eat?\" he asked as they neared the snack bar. \"Just a Coke.\" They entered the theater just as the lights went down. Moments later, they were sitting side by side in the dark while movie trailers flashed across the screen. Daisy knew a little thrill of excitement when Erik reached for her hand. Just a simple touch, his fingers curling lightly around hers, and yet it made her feel safe, protected. Which was odd, she thought, since she wasn\u0027t in any danger. She glanced at Erik. His profile was sharp and clean. He was easily the most handsome man she had ever met. And the sexiest. Just looking at him aroused a longing deep within her. A longing to feel his body against hers, to run her hands over his shoulders, to wrap her fingers around his biceps, to run her tongue over his skin, to touch him and taste him...all of him. A rush of heat warmed her cheeks when she realized he was watching her. Thank goodness he couldn\u0027t read her mind! Dragging her gaze from his, she turned her attention to the screen, surprised to see that the movie had started. How much had she missed? How long had she been staring at Erik like some lovesick calf? Leaning toward her, he whispered, \"I like the way you look, too.\" Startled, Daisy drew back. Lordy, maybe he could read her mind. She met Erik at the Crypt the following night. As always, just seeing him made her heart skip a beat. Tonight, he wore a pair of snug black jeans that hugged his long legs, a navy blue striped shirt unbuttoned over a white tee, and a pair of scuffed black boots. Just looking at him made her mouth water. If she had created him, he couldn\u0027t have been more perfect. He smiled when he saw her. \"You\u0027re early.\" Daisy glanced at her watch. \"So are you.\" He closed the distance between them. She could see the heat in his eyes now, feel it as his gaze moved over her. Her stomach quivered in response. \"I guess I was anxious to see you again.\" His voice poured over her like honey. \"You guess?\" She had intended to sound flippant and worldly wise; instead, her voice came out in a breathy whisper. \"All right, I admit it. I couldn\u0027t wait. So, what would you like to do this evening?\" \"I don\u0027t know.\" His nearness, the warmth in his eyes, made it hard to think of anything but her yearning to be in his arms. \"Anything you want to do is fine with me.\" He smiled, as if he knew exactly what she was thinking. \"How about a moonlight swim?\" \"I didn\u0027t bring a bathing suit.\" \"It\u0027s dark.\" His gaze moved over her from head to foot. \"No one will know.\" The words \"but me\" hovered in the air between them. For once in her life, she decided to be daring, spontaneous. Foolish, maybe. Throwing caution to the wind, she said, \"Let\u0027s go!\" \"That\u0027s my girl.\" Taking her by the hand, Erik led her outside to his car. He drove a sleek black Trans Am convertible with black leather interior. Daisy grinned inwardly as she settled into the front seat. Everything about the man was dark and sexy, including his car. She watched him slide behind the wheel. He moved with a grace and economy of motion she had rarely seen in a man of his size.","sourceLink":"https://allnovel.net/everlasting-kiss-everlasting-1/page-6.html","bookId":2303,"book":{"id":2303,"title":"Everlasting Kiss (Everlasting #1)","description":"Storyline: Everlasting Kiss (Everlasting #1) Daisy O\u0027Donnell doesn\u0027t get the attraction some women feel for vampires. She likes her men with a heartbeat. And she\u0027s just met one who\u0027s full of life: Erik Delacourt, the unreasonably sexy man she keeps meeting at a popular L.A. nightclub called the Crypt. She barely knows him, but there\u0027s no resisting the connection she feels. . . There\u0027s one important detail Erik hasn\u0027t gotten around to telling her yet. He\u0027s a powerful vampire out to hunt the Blood Thief who is draining young vampires all over the city--and who has just raised the stakes by destroying one of Erik\u0027s friends. To Erik, Daisy is a bright spot of innocence in a world of darkness and menace. He\u0027ll do anything--even lie to her--to keep her safe and pure. If only he knew that Daisy has something of her own to hide. . .","cover":"https://allnovel.net/images/everlasting-kiss-everlasting-1.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-kiss-everlasting-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:08:15 PM"}}
