{"id":2966,"no":7,"title":"Chapter vii. The Great Fire of Chicago.","content":"I wish I could persuade myself that I was capable of picturing the events of the week after we reached Chicago. We arrived, if I remember rightly, on a Wednesday and put our cattle and horses in the stockyards near the Michigan Street depot. As I have related, we sold on Thurday and Friday about three-fifths of the cattle. I wanted to sell all, but followed the judgment of the Boss and sold three hundred head and put a little over fiwe thousand dollars in my banking account. On Saturday night the alarm bells began to ring and awoke me. I slipped into my breeches, shirt and boots and a youthful curiosity exciting me, I raced downstairs, got Blue Devil from the stable and rode out to the fire. I was infinitely impressed by the rapidity with which the firemen acted and the marvellous efficiency of the service. Where in England there would have been perhaps half a dozen fire-engines, the Americans sent fifty, but they all found work and did it magnificently. At one o’clock the fire was out and I returned to the hotel through two or three miles of uninjured streets. Of course, I told Reece and Ford all about it the next day. To my astonishment, no one seemed to pay much attention; a fire was so common a thing in the wooden shanties on the outskirts of American towns that nobody cared to listen to my epic. Next night, Sunday, the alarm bell began ringing about eleven o’clock: I was still dressed in my best. I changed into my working clothes, I do not know why, put my belt about me with a revolver in it and again took out the mare and rode to the fire. When still a quarter of a mile away, I realized that this fire was much more serious than that of the previous night: first of all, a gale of wind was blowing right down on the town. Then, when I wondered why there were so few fire-engines, I was told that there were two other fires and the man with whom I talked did not scruple to ascribe them to a plot and determination to burn down the town! “Them damned foreign anarchists are at the bottom of it,” he said, “three fires do not start on the very outskirts of the town with a gale of wind blowing, without some reason.” And indeed, it looked as if he were right. In spite of all the firemen could do, the fire spread with incredible rapidity. In half an hour I saw they were not going to master it soon or easily and I rode back to get Reece, who had told me that he would have come with me the previous night if he had known where the fire was. When I got back to the hotels Reece had gone out on his own and so had Dell and the Boss. I went back to the fire. It had caught on in the most extraordinary way. The wooden streets now were all blazing; the fire was swallowing block after block and the heat was so tremendous that the fire-engines could not get within two hundred yards of the blaze. The roar of the fire was unearthly. Another thing I noticed almost immediately: the heat was so terrific that the water decomposed into its elements and the oxygen gas in the water burned vehemently on its own account. The water, in fact, added fuel to the flames. As soon as I made sure of this, I saw that the town was doomed and walked my pony back a block or two to avoid flying sparks. This must have been about three or four o’clock in the morning. I had gone back about three blocks when I came across a man talking to a group of men at the corner of a street. He was the one man of insight and sense I met that night. He seemed to me a typical, down-east Yankee: he certainly talked like one. The gist of his speech was as follows: “I want you men to come with me right now to the Mayor and tell him to give orders to blow up at least two blocks deep all along this side of the town; then, if we drench the houses on the other side, the flames will be stopped: there’s no other way.” “That’s sense”, I cried, “that’s what ought to be done at once. There’s no other way of salvation; for the heat is disintegrating the water and the oxygen in the water is blazing fiercely, adding fuel to the flames.” “Gee! that’s what I have been preaching for the last hour”, he cried. A little later fifty or sixty citizens went to the Mayor, but he protested that he had no power to blow up houses and evidently, too, shirked the respon sibility. He decided, however, to call in some of the councilmen and see what could be done. Meanwhile I went off and wandered towards the Randolph Street bridge and there saw a scene that appalled me. Some men had caught a thief, they said, plundering one of the houses and they proceeded to string the poor wretch up to a lamp-post. In vain I pleaded for his life, declared that he ought to be tried, that it was better to let off ten guilty men than hang one innocent one, but my foreign accent robbed my appeal, I think, of any weight and before my eyes the man was strung up. It filled me with rage; it seemed to me a dreadful thing to have done: the cruelty of the executioners, the hard purpose of them, shut me away from my kin. Later I was to see these men from a better angle. By the early morning the fire had destroyed over a mile deep of the town and was raging with unimaginable fury. I went down on the lakeshore just before daybreak. The scene was one of indescribable magnificence: there were probably a hundred and fifty thousand homeless men, women and children grouped along the lake shore. Behind us roared the fire; it spread like a red sheet right up to the zenith above our heads, and from there was borne over the sky in front of us by long streamers of fire like rockets: vessels four hundred yards out in the bay were burning fiercely, and we were, so to speak, roofed and walled by flame. The danger and uproar were indeed terrifying and the heat, even in this October night, almost unbearable. I wandered along the lake shore, noting the kind way in which the men took care of the women and children. Nearly every man was able to erect some sort of shelter for his wife and babies, and everyone was willing to help his neighbor. While working at one shelter for a little while, I said to the man i wished I could get a drink. “You can get one”, he said, “right there”, and he pointed to a sort of makeshift shanty on the beach. I went over and found that a publican had managed to get four barrels down on the beach and had rigged up a sort of low tent above them; on one of the barrels he had nailed his shingle, and painted on it were the words, “What do you think of our hell? No drinks less than a dollar!” The wild humor of the thing amused me infinitely and the man certainly did a roaring trade. A little later it occurred to me that our cattle might possibly burn, so I went out and hurried back to the Michigan Street stockyards. An old Irishman was in charge of the yard, but though he knew me perfectly well, he refused to let me take out a steer. The cattle were moving about wildly, evidently in a state of intense excitement. I pleaded with the man and begged him, and at length tied my mare up to the lamp-post at the corner and went back and got into the stockyard when he wasn’t looking. I let down two or three of the bars and the next moment started the cattle through the opening. They went crazy wild and choked the gateway. In five minutes there were ten or twelve dead cattle in the entrance and the rest had to go over them. Suddenly, just as I got through the gap, the mad beasts made a rush and carried away the rails on both sides of the gateway. The next moment I was knocked down and I had just time to drag myself through the fence and so avoid their myriad trampling heels. A few minutes later, I was on Blue Devil, trying to get the cattle out of the town and on to the prairie. The herd broke up at almost every corner but I managed to get about six hundred head right out into the country. I drove them on the dead run for some miles. By this time it was daybreak and at the second or third farmhouse I came to, I found a farmer willing to take in the cattle. I bargained with him a little and at length told him I would give him a dollar a head if he kept them for the week or so we might want to leave them with him. In two minutes he brought out his son and an Irish helper and turned the cattle back and into his pasture. There were six hundred and seventy-six of them, as near as I could count, out of practically two thousand head. By the time I had finished the business and returned to the hotel, it was almost noon and as I could get nothing to eat, I wandered out again to see the progress of the fire. Already I found that relief trains were being sent in with food from all neighboring towns and this was the feature of the next week in starving Chicago. Strangely enough, at that time the idea was generally accepted that a man or woman could only live three days without food. It was years before Dr. Tanner showed the world that a man could fast for forty days or more. Everyone I met acted as if he believed that if he were fully three days without food, he must die incontinently. I laughed at the idea which seemed to me absurd, but so strong was the universal opinion and the influence of the herd-sentiment, that on the third day I too felt particularly empty and thought I had better take my place in the bread line. There were perhaps five thousand in front of me and there were soon fifty or sixty thousand behind me. We were five deep moving to the depot where the bread trains were discharging, one after the other. When I got pretty close to the food wagons, I noticed that the food supply was coming to an end, and next moment I noticed something else. Again and again women and girls came into our bread line and walked through the lines of waiting men, who, mark you, really believed they were going to die that night if they could not get food, but instead of objecting they one and all made way for the women and girls and encouraged them: “Go right on, Madam, take all you want:” “This way, Missee, you won’t be able to carry much, I’m afraid”; — proof on proof, it seemed to me, of courage, good humor and high self-abnegation. I went into that bread line an Irish boy and came out of it a proud American, but I did not get any bread that night or the next. In fact, my first meal was made when I ran across Reece on the Friday or Saturday after: Reece, as usual, had fallen on his feet and found a hotel where they had provisions — though at famine prices. He insisted that I should come with him and soon got me my first meal. In return, I told him and Ford of the cattle I had saved. They were, of course, delighted and determined next day to come out and retrieve them. “One thing is certain,” said Ford, six hundred head of cattle are worth as much today in Chicago as fifteen hundred head were worth before the fire, so we hain’t lost much.” Next day I led Reece and the Boss straight to the farmer’s place, but to my surprise he told me that I had agreed to give him two dollars a head, whereas I had bargained with him for only one dollar. His son backed up the farmer’s statement and the Irish helper declared that he was sorry to disagree with me, but I was mistaken; it was two dollars I had said. They little knew the sort of men they had to deal with. “Where are the cattle?” Ford asked, and we went down to the pasture where they were penned. “Count them, Harris,” said Ford, and I counted six hundred and twenty head. Fifty odd had disappeared, but the farmer wanted to persuade me that I had counted wrongly. Ford went about and soon found a rough lean-to stable where there were thirty more head of Texan cattle. These were driven up and soon disappeared in the herd; Reece and I began to move the herd towards the entrance. The farmer declared he would not let us go, but Ford looked at him a little while and then said very quietly, “You have stolen enough cattle to pay you. If you bother with us, I will make meat of you — see! — cold meat”, and the farmer moved aside and kept quiet. That night we had a great feast and the day after Ford announced that he had sold the whole of the cattle to two hotel proprietors and got nearly as much money as if we had not lost a hoof. My five thousand dollars became six thousand, five hundred. The courage shown by the common people in the fire, the wild humor coupled with the consideration for the women, had won my heart. This,is the greatest people in the world, I said to myself, and was proud to feel at one with them.","sourceLink":"http://novel.tingroom.com/mingren/987/29786.html","bookId":116,"book":{"id":116,"title":"My Life and Loves","description":"简介： Long banned in the United States and England, My Life and Loves is one of the most notorious autobiographies ever written. Famous for its erotic passages, it is also one of the richest and most entertaining views ever of fin-de-sicle literary and soc...","cover":"http://novel.tingroom.com/file/upload/201403/06/09-47-08-87-1.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/987","creation":"Aug 1, 2019 12:18:17 AM","modification":"Aug 1, 2019 12:18:17 AM"}}
