{"id":108048,"no":27,"title":"Page 27","content":"names and went up to the Communications Centre to get on the teleprinter to Station Z.\n M would have preferred to live by the sea, near Plymouth perhaps or Bristol - anywhere where he could see the stuff whenever he wanted to and could listen to it at night. As it was, and since he had to be within easy call of London, he had chosen the next best thing to water, trees, and had found a small Regency manor-house on the edge of Windsor Forest. This was on Crown Lands, and Bond had always suspected that an ounce of\u0027Grace and Favour\u0027 had found its way into M\u0027s lease. The head of the Secret Service earned £5,000 a year, with the use of an ancient Rolls Royce and driver thrown in. M\u0027s naval pay (as a Vice-Admiral on the retired list) would add perhaps another £1,500. After taxes, he would have about £4,000 to spend. His London life would probably take at least half of that. Only if his rent and rates came to no more than £500, would he be able to keep a house in the country, and a beautiful small Regency house at that.\n These thoughts ran again through Bond\u0027s mind as he swung the clapper of the brass ship\u0027s-bell of some former HMS Repulse, the last of whose line, a battle-cruiser, had been M\u0027s final sea-going appointment. Hammond, M\u0027s Chief Petty Officer in that ship, who had followed M into retirement, greeted Bond as an old friend, and he was shown into M\u0027s study.\n M had one of the stock bachelor\u0027s hobbies. He painted in water-colour. He painted only the wild orchids of England, in the meticulous but uninspired fashion of the naturalists of the nineteenth century. He was now at his painting-table up against the window, his broad back hunched over his drawing-board, with, in front of him, an extremely dim little flower in a tooth-glass full of water. When Bond came in and closed the door, M gave the flower one last piercingly inquisitive glance. He got to his feet with obvious reluctance. But he gave Bond one of his rare smiles and said, \u0027Afternoon,\n James.\u0027 (He had the sailor\u0027s meticulous observance of the exact midday.) \u0027Happy Christmas and all that. Take a chair.\u0027 M himself went behind his desk and sat down. He was about to come on duty. Bond automatically took his traditional place across the desk from his Chief.\n M began to fill a pipe. \u0027What the devil\u0027s the name of that fat American detective who\u0027s always fiddling about with orchids, those obscene hybrids from Venezuela and so forth? Then he comes sweating out of his orchid house, eats a gigantic meal of some foreign muck and solves the murder. What\u0027s he called?\u0027\n \u0027Nero Wolfe, sir. They\u0027re written by a chap called Rex Stout. I like them.\u0027\n \u0027They\u0027re readable,\u0027 condescended M. \u0027But I was thinking of the orchid stuff in them. How in hell can a man like those disgusting flowers? Why, they\u0027re damned near animals, and their colours, all those pinks and mauves and the blotchy yellow tongues, are positively hideous! Now that\u0027 - M waved at the meagre little bloom in the tooth-glass -\u0027that\u0027s the real thing. That\u0027s an Autumn Lady\u0027s Tresses - spiranthes spiralis, not that I care particularly. Flowers in England as late as October and should be under the ground by now. But I got this forced-late specimen from a man I know - assistant to a chap called Summerhayes who\u0027s the orchid king at Kew. My friend\u0027s experimenting with cultures of a fungus which oddly enough is a parasite on a lot of orchids, but, at the same time, gets eaten by the orchid and acts as its staple diet. Mycorhiza it\u0027s called.\u0027 M gave another of his rare smiles. \u0027But you needn\u0027t write it down. Just wanted to take a leaf out of this fellow Nero Wolfe\u0027s book. However\u0027 - M brushed the topic aside - \u0027can\u0027t expect you to get excited about these things. Now then.\u0027 He settled back. \u0027What the devil have you been up to?\u0027 The grey eyes regarded Bond keenly. \u0027Looks as if you haven\u0027t been getting much sleep. Pretty gay these winter sport places, they tell me.\u0027\n Bond smiled. He reached into his inside pocket and took out the pinned sheets of paper. \u0027This one provided plenty of miscellaneous entertainment, sir. Perhaps you\u0027d like to have a look at my report first. \u0027Fraid it\u0027s only a draft. There wasn\u0027t much time. But I can fill in anything that isn\u0027t clear.\u0027\n M reached across for the papers, adjusted his spectacles, and began reading.\n Soft rain scratched at the windows. A big log fell in the grate. The silence was soft and comfortable. Bond looked round the walls at M\u0027s treasured collection of naval prints. Everywhere there were mountainous seas, crashing cannon, bellying sails, tattered battle pennants - the fury of ancient engagements, the memories of ancient enemies, the French, the Dutch, the Spaniards, even the Americans. All gone, all friends now with one another. Not a sign of the enemies of today. Who was backing Blofeld, for instance, in the inscrutable conspiracy in which he was now certainly engaged? The Russians? The Chinese? Or was it an independent job, as Thunderball had been? And what was the conspiracy? What was the job for the protection of which six or seven of Blofeld\u0027s men had died within less than a week? Would M read anything into the evidence? Would the experts who were coming that afternoon? Bond lifted his left wrist. Remembered that he no longer had a watch. That he would certainly be allowed on expenses. He would get another one as soon as the shops opened after Boxing Day. Another Rolex? Probably. They were on the heavy side, but they worked. And at least you could see the time in the dark with those big phosphorus numerals. Somewhere in the hall, a clock struck the half-hour. 1.30. Twelve hours before, he must have just set up the trap that killed the three men in the Mercedes. Self-defence, but the hell of a way to celebrate Christmas!\n M threw the papers down on his desk. His pipe had gone out and he now slowly lit it again. He tossed the spent match accurately over his shoulder into the fire. He put his hands fiat on the desk and said - and there was an unusual kindness in his voice - \u0027Well, you were pretty lucky to get out of that one, James. Didn\u0027t know you could ski.\u0027\n \u0027I only just managed to stay upright, sir. Wouldn\u0027t like to try it again.\u0027\n \u0027No. And I see you say you can\u0027t come to any conclusions about what Blofeld is up to?\u0027\n \u0027That\u0027s right, sir. Haven\u0027t got a clue.\u0027\n \u0027Well, nor have I. I just don\u0027t understand any part of it. Perhaps the professors\u0027ll help us out this afternoon. But you\u0027re obviously right that it\u0027s SPECTRE all over again. By the way, your tip about Pontresina was a good one. He was a Bulgar. Can\u0027t remember his name, but Interpol turned him up for us. Plastic explosives expert. Worked for KBG in Turkey. If it\u0027s true that the U2 that fellow Powers was piloting was brought down by delayed charges and not by rockets, it may be this man was implicated. He was on the list of suspects. Then he turned free-lance. Went into business on his own. That\u0027s probably when SPECTRE picked him up. We were doubtful about your identification of Blofeld. The Pontresina lead helped a lot. You\u0027re absolutely sure of him, are you? He certainly seems to have done a good job on his face and stomach. Better set him up on the Identicast when you get back this evening. We\u0027ll have a look at him and get the views of the medical gentry.\u0027\n \u0027I think it must be him, sir. I was really getting the authentic smell of him on the last day - yesterday, that is. It seems a long time ago already.\u0027\n \u0027You were lucky to run into this girl. Who is she? Some old flame of yours?\u0027 M\u0027s mouth turned down at the corners.\n \u0027More or less, sir. She came into my report on the first news we got that Blofeld was in Switzerland. Daughter of this man Draco, head of the Union Corse. Her mother was an English governess.\u0027\n \u0027Hm. Interesting breeding. Now then. Time for lunch. I told Hammond we weren\u0027t to be disturbed.\u0027 M got up and pressed the bell by the fire-place. \"Fraid we\u0027ve got to go through the turkey and plum pudding routine. Mrs Hammond\u0027s been brooding over her pots and pans for weeks. Damned sentimental rubbish.\u0027\n Hammond appeared at the door, and Bond followed M through and into the small dining-room beyond the hall whose walls glittered with M\u0027s other hobby, the evolution of the naval cutlass. They sat down. M said, with mock ferocity, to Hammond, \u0027All right, Chief Petty Officer Hammond. Do your worst.\u0027 And then, with real vehemence, \u0027What in hell are those things doing here?\u0027 He pointed at the centre of the table.\n \u0027Crackers, sir,\" said Hammond stolidly. \u0027Mrs Hammond thought that seeing as you have company...\u0027\n \u0027Throw them out. Give \u0027em to the schoolchildren. I\u0027ll go so far with Mrs Hammond, but I\u0027m damned if I\u0027m going to have my dining-room turned into a nursery.\u0027\n Hammond smiled. He said, \u0027Aye, aye, sir,\u0027 gathered up the shimmering crackers and departed.\n Bond was aching for a drink. He got a small glass of very old Marsala and most of a bottle of very bad Algerian wine.\n M treated his two glasses as if they had been Chateau Lafitte. \u0027Good old “Infuriator”. Staple drink for the fleet in the Mediterranean. Got real guts to it. I remember an old shipmate of mine, McLachlan, my Chief Gunnery Officer at the time, betting he could get down six bottles of the stuff. Damn fool. Measured his length on the wardroom floor after only three. Drink up, James! Drink up!\u0027\n At last the plum pudding arrived, flaming traditionally. Mrs Hammond had implanted several cheap silver gewgaws in it and M nearly broke a tooth on the miniature horseshoe. Bond got the bachelor\u0027s button. He thought of Tracy. It should have been the ring!\n 21\n The Man from Ag, and Fish.\n THEY HAD coffee in M\u0027s study and smoked the thin black cheroots of which M allowed himself two a day. Bond burnt his tongue on his. M continued with his stories about the Navy which Bond could listen to all day - stories of battles, tornadoes, bizarre happenings, narrow shaves, courts martial, eccentric officers, neatly-worded signals, as when Admiral Somerville, commanding the battleship Queen Elizabeth, had passed the liner Queen Elizabeth in mid-Atlantic and had signalled the one word \u0027SNAP\u0027! Perhaps it was all just the stuff of boys\u0027 adventure books, but it was all true and it was about a great navy that was no more and a great breed of officers and seamen that would never be seen again.\n It was three o\u0027clock. A car\u0027s wheels scrunched on the gravel outside. Dusk was already creeping into the room. M got up and switched on the lights and Bond arranged two more chairs up against the desk. M said, \u0027That\u0027ll be 501. You\u0027ll have come across him. Head of the Scientific Research Section. And a man called Franklin from the Ministry of Agriculture. 501 says he\u0027s the top on his subject - Pest Control. Don\u0027t know why Ag. and Fish, chose to send him in particular, but the Minister told me they\u0027ve got a bit of trouble on their hands, wouldn\u0027t tell even me what it is, and they think you may have run into something pretty big. We\u0027ll let them have a look at your report and see what they make of it. All right?\"\n \u0027Yes, sir.\u0027\n The door opened and the two men came in.\n Number 501 of the Secret Service, whose name Bond remembered was Leathers, was a big-boned, rangy man with the stoop and thick spectacles of the stage scientist. He had a pleasant, vague smile and no deference, but only politeness, towards M. He was appropriately dressed in shaggy tweeds and his knitted woollen tie didn\u0027t cover his collar stud. The other man was small and brisk and keen-looking, with darting, amused eyes. As became a senior representative of a Ministry who had received his orders from his Minister in person and who knew nothing of Secret Services, he had put on a neat dark-blue pin-stripe and a stiff white collar. His black shoes gleamed efficiently. So did the leather of his fat brief-case. His greeting was reserved, neutral. He wasn\u0027t quite sure where he was or what this was all about. He was going to smell his way carefully in this business, be wary of what he said and how far he committed his Ministry. Of such, Bond reflected, is \u0027Government\u0027. \n","sourceLink":"https://allnovel.net/on-her-majesty-s-secret-service-james-bond-11/page-27.html","bookId":1553,"book":{"id":1553,"title":"On Her Majesty\u0027s Secret Service (James Bond #11)","description":"Storyline: \n On Her Majesty\u0027s Secret Service (James Bond (Original Series) #11) \n A Lancia Spyder with its hood down tore past him, cut in cheekily across his bonnet and pulled away, the sexy boom of its twin exhausts echoing back at him. It was a girl driving, a girl with a shocking pink scarf tied round her hair. And if there was one thing that set James Bond really moving, it was being passed at speed by a pretty girl. \n When Bond rescues a beautiful, reckless girl from self-destruction, he finds himself with a lead on one of the most dangerous men in the world—Ernst Stavro Blofeld, the head of SPECTRE. In the snow-bound fastness of his Alpine base, Blofeld is conducting research that could threaten the safety of the world. To thwart the evil genius, Bond must get himself and the vital information he has gathered out of the base and keep away from SPECTRE\u0027s agents.\n \n","cover":"https://allnovel.net/images/on-her-majesty-s-secret-service-james-bond-11.jpg","author":"Ian Fleming","type":"Adventure","source":"allnovel","link":"https://allnovel.net/on-her-majesty-s-secret-service-james-bond-11.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:13:51 PM"}}
