{"id":93756,"no":17,"title":"Page 17","content":"\\n\\n “I… I’m sorry, Ewen. I just assumed …I mean, you have a son, right? But I guess if you need a nanny maybe that means… oh. ” She hated how she always rambled when nervous. Then, under her breath, “I was just trying to make some pleasant conversation. Sorry. ”\\n\\n An excruciating silence hung between them as Ewen continued to make camp. Gathering the tartan that he had dropped to the ground, he returned to the bank of the lake and proceeded, inexplicably, to wet the long swath of wool. Lily almost yelled at him to stop it—what was he thinking, soaking their only source of warmth? But looking at the angry set of his shoulders she quickly thought the better of it and bit back any protests.\\n\\n As if he read her mind, without turning Ewen said, “ Stop fretting. It makes the wool warmer. If you dampen it. ” Well, it wasn ’t much, but it was a start at communication. Deep in thought, he walked slowly back up to their camp.\\n\\n “Sorry, lass. I ’d not meant to get so angry. Aye, I was married once. And what a bonny lass she was. Bonny, and hell-sent. ” They had only spent a short time together, but Lily had already noted that Ewen’s brogue got thicker, with more Gaelic inflections, when speaking with emotion. Despite her desire to keep him at arm’s length, Lily couldn’t help but find it endearing, albeit more difficult to comprehend.\\n\\n He reached out for his saddlebag and removed a small leather flagon. He drew a deep gulp and Lily could smell the tang of Scotch whisky. “Would you cock your wee finger with me?” Sprawling onto his side he offered her the leather flask.\\n\\n Though at that moment she would’ve preferred some thing a bit more refreshing—a nice, cold beer perhaps—she accepted the drink readily. The adrenalin of the day had worn off and she thought her foot would explode from the pain pulsing from her toes up to her calf.\\n\\n It was harder than she thought to manage the flask and more whisky than she intended rushed down her throat. She strangled a cough and forced herself to continue breathing. It was like drinking pure heat. This was no Dewar’s. She supposed that the days of refined sipping whisky hadn ’t yet hit Scotland. She surreptitiously wiped the tears from her eyes and the whisky from her chin and whispered a choked thanks.\\n\\n Ewen smiled. If he could tell the whisky was more than she bargained for, he didn ’t let on. He stayed reclined on the tartan and took the flagon back out of her hands. Taking one more drag on the whisky, he continued, “ She died in childbirth. A sad thing, that. My John killed her, and the lad has been making my life a misery ever since.\\n\\n “My grandfather had insisted on the match. My father passed when I was but a lad, so I was next in line to be laird. He said the clan needed me to marry young. His body was starting to fail him, and he knew he’d not make it another winter. My grandfather was a man of tradition, believed every clan chief needs a wife, he did. So he married me off like a horse to stud. With a wife like Mairi, though… Och, I could have done better marrying a MacKintosh, the battles we fought. ”\\n\\n Brow furrowed, he was silent for a moment then continued, “She was unfaithful to me. To the clan too, you could say. No regard for honor. She lay with other men. With my tacksman. With a MacKintosh even. ” Lily could tell by the gravity in his voice that the last one was a real transgression. He looked into the distance. “ Och, but she could drive a man to madness. Smooth like silk until she had you in her palm, then she ’d laugh you right out the room. ”\\n\\n Shaking his head, he continued, “She was such a bonny one. Long black hair, tiny white hands. Such a delicate lass. It’s what killed her in the end. Not made for birthing bairns. But she had my grandfather charmed. She likely warmed his bed as well. To get what she wanted. ”\\n\\n Lily shivered at the thought of a pretty, young girl bedding an aged Scottish laird. She never understood how people were able to use their bodies as tools to get what they wanted.\\n\\n Ewen thought he understood the look that passed over her face and he explained, “I was in line to be chief and that was an exceeding good match for her. Bedding the men she did, she cleared a number of paths for herself, I see it plain now. If anything had happened to me, she ’d have been like to find favor with the next man in line for Lochiel. ” He noted Lily’s quizzical look and added, “That’s what the Camerons call their clan chief, lass. Lochiel. I ’m the Lochiel, as my grandfather was, and John will be after I ’m gone.”\\n\\n Ewen adjusted the damp tartan underneath their makeshift shelter and, with a heavy sigh, shifted to a seated position. “She wanted to be a chief’s wife, but her father hadn’t much to offer a potential husband but his daughter’s charms. Nay, all he had to offer was a sporran full of debt, I’ve since discovered. And so it was her charms that were offered to us tenfold. ” He snorted a laugh, tinged with more than a little disgust. “ She wasn’t worth the price. No lass is. ” Lily was annoyed at his poor regard for women, but curiosity won over and she let Ewen continue.\\n\\n “I was just a young lad who didn’t know better, and my grandfather was an old man flattered by the attentions of a comely lass. He arranged our marriage, and she wasn’t the same after. A shrew to everyone, especially me. It’s as well I grew to see her for what she was. A tiny black heart she had. Cruel to every living thing. ”\\n\\n A clipped bitter laugh escaped him. “Cruel to all but her horse that is. I ’ll still not understand it. She ’d beat the groom with her whip then stroke that mare for hours. ” He added as an afterthought, “We had to put the mare down last fall. Lamed herself kicking another mount. Took after her owner till the end, I suppose. I wasn ’t grieved to say good-bye to that one. It was the last ghost of Mairi left on Cameron lands.\\n\\n “Except for our son John. His wickedness tries me as much as his mother ever did …” Ewen’s voice trailed off.\\n\\n Lily was overwhelmed. She could tell that Ewen had been hurt more deeply by this woman than he was letting on. It wasn ’t the agony of a lost love she heard in his voice, though. No, it was clear his feelings for his former wife could, at most, be summed up as young lust. What she did hear there was isolation. Being a leader like Ewen must mean standing alone, never allowing yourself to trust another, never letting any emotion or vulnerability show through. At a young age, he had discovered the hard lesson that when you have power, people rarely approach you with more than selfish intentions. Lily knew it was so in modern America and imagined it was no different in seventeenth-century Scotland.\\n\\n “I… I’m so sorry, Ewen. That sounds horrible. ”\\n\\n “Och, I had my youth and learned what lust will get me. Nay, I ’ll not marry again. I have my heir. ”\\n\\n “But not all women are like that! ”\\n\\n “Aye, lass, some women are soft and kind. ” He laughed and winked roguishly at her, and Lily felt her face flame crimson to her ears.\\n\\n “But when it comes to pledging my troth to a woman, aye, I ’ve done my duty as Lochiel. John as my heir will take over when I’m gone. No need for me to marry again. Ever. ” He finished his diatribe as if it was the last thing to be said on the subject and quickly changed the topic.\\n\\n “But what of you, lass? Why’ve you no husband then?”\\n\\n His tone was incredulous, and Lily bridled at the implication that she was somehow aberrant not to have a man in her life. She replied, “It never came up. ”\\n\\n “Your family did not find you a good match, is it?”\\n\\n “That’s not really how it goes in my time, ” she answered coolly. “Many women don’t marry until well into their thirties, or later. Besides, my family wasn ’t really in the picture.”\\n\\n Ewen considered her intently, as if studying some foreign creature. “I don ’t ken your meaning … in the picture ”\\n\\n “Oh, that’s just a saying …it’s that … well, it was mostly just my grandmother and me. My mom wasn ’t around much, and I never had a real father to speak of. ”\\n\\n Ewen stared at her solemnly, and Lily fumbled to fill the uncomfortable silence. “My mom took off when I was young. She came back years later with some new husband, and I just, well, I just didn’t want to have much to do with them. ”\\n\\n “You had a choice?” He continued indignantly, “And what of your mother to disappear so? What sort of a woman quits her wean?”\\n\\n Lily felt strangely defensive of the woman she ’d spent a lifetime deriding. “It happens. Some women leave their children. ”\\n\\n “Och,” Ewen hissed, “not in Scotland. ”\\n\\n “Oh, it’ll happen. ”\\n\\n “Nay in the Highlands,” the laird replied dismissively.\\n\\n “Lass,” Ewen ’s affronted tone softened, as if he lamented Lily’s worldview, even felt sorrow for her, “there ’s no other thing than family. ”\\n\\n “I … the thing is ” Lily struggled for words “it’— — s just different, is all. In modern times. People move away from their families, husbands and wives divorce, we even have special homes for grandparents. ” Her cataloguing became more confident, even though deep down she wasn’t so certain. “People change and move on and it’s …okay. ”\\n\\n Lily had never given much thought to it. Of course, she had regretted the absence of her mother. And envied her friends at school who had big, bustling holidays at home with relatives. But Gram was her only family really, and to discount her as somehow not enough felt dreadful, and traitorous.\\n\\n “To… move on from your bairn, to abandon your flesh and blood, och, lass, if that’s to be accepted in the future, then I ’ll have nothing of it.\\n\\n “The whole clan is a family. ” He grew impassioned, nearly pleading with Lily. “Like the Camerons, aye? We call ourselves sons of the hound, and ’… tis like that. With the laird at the head, faithful to kin as a hound to the pack. The laird … I… I take care with mine own. And I expect mine to care for theirs in turn, aye?” \\n\\n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-17.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: Master of the Highlands (Highlands #1) \\n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \\n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\\n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
