{"id":93761,"no":22,"title":"Page 22","content":"\n To add to the challenge, Lily found herself in the position of teaching subjects she hadn’t thought of in years. She had once cursed her high school Latin teacher but now found she was thankful that cruel old Mr. Crabtree had been so mercilessly thorough. She had no idea that all of those tedious Latin declensions were still in her brain after all those years. Geography, too, was a tough one. Not only did she have to familiarize herself with what countries were where in the seventeenth-century world, Lily also had to interpret the ornate and barely legible script that detailed Ewen ’s various globes and tattered nautical maps.\n Aside from the obvious differences she would expect, like the roles of women, class structure, and so on, Lily was startled daily at the tremendous gulf between the world she had experienced as a child and John ’s reality. She clung to those differences in attempts to find some modicum of sympathy for the boy. The thought that this youngster, still shy of his eleventh birthday, would likely be sent to battle in the next five years sobered Lily and renewed her lagging reserves of patience. She wanted to do right by him, and for as long as she was trapped where she was, she would put her all into his schooling. Regardless of the fact that his wicked behavior had her fantasizing about taking a good old seventeenth- century switch to his rear end.\n She announced her intentions to the boy that morning over breakfast. Ewen had gone out early, so she figured that even if the laird found some complaint or other about her leaving the Cameron keep, he wouldn ’t have the chance to voice it.\n “John?” Lily inquired in a sweet but firm tone. She started every day off anew, willing herself to an even temper.\n He sat silently, wolfing down his runny eggs. She could feel her patience wearing thin already.\n Kat entered the dining room with a fresh pot of tea. She looked at the two of them, sitting across from each other at the enormous black oak dining table and gave Lily a sympathetic smile.\n Feeling bolstered, Lily set her shoulders and tried again.\n “John.”\n Pretending not to hear her, the boy merely continued to mop up eggs with a wilted triangle of toast.\n Telling herself that being a governess was not a democracy, she announced, “We will not be having lessons today. ”\n That got his attention. Lily continued, “Instead, you will show me village life outside this castle. ”\n She had awoken that sunny morning thinking a change of pace would do them good. A day spent walking through the village just outside the keep, which she learned was known as Tor Castle, might be a pleasant way to make some inroads with the boy and expend a bit of his abundant youthful energy to boot. Besides, it would give her a chance to scope out the lay of the land and maybe give some clue as to the location of the labyrinth. The days were flying by, and Ewen still hadn’t tracked down this\n Gorm-whatever-her-name-was witch whom he said could help her return to her own time. Lily thought familiarizing herself with the surrounding countryside probably wouldn’t help, but it couldn’t hurt either.\n “My da won’t like me not having lessons today. ” He made the announcement gravely, as if to inspire fear of the dark laird in the heart of his governess. Lily was having none of it.\n The great laird Cameron could just live with it, she thought. He wasn’t the one who had to deal with this monstrous boy day in and day out.\n Kat diffused the situation. “Oh lad, you’re just being contrarian. You’ll not tell me that you don’t want to get out into the fresh air for the day. Aye, and you can point out the glen’s plants and animals to our Miss Lily so the day’s learning isn’t wasted.”\n It was the most Lily had ever heard come out of Kat’s mouth, and she gave her an eternally grateful look. “She ’s right, John. Today is about learning. Just not sums and Latin. Today we will study the flora and fauna of the surrounding environment. ”\n John looked pained.\n “I’m not so sure what those are,” Kat interjected, continuing to manage the tense situation, “but I do ken that Glen Albyn is the most beautiful of Lochaber glens. Aye, with lochs all around and Ben Nevis looking down on the lot of us. ” The maid beamed and Lily realized how lovely she must have been before the years of tending the castle became etched so deeply on her kind face.\n “Aye, give me but a moment and I ’ll pack some food for the pair of you explorers today. ”\n John seemed to forget his contrary mood and was suddenly energized by the prospect of spending the day roaming. Pushing his chair out from the table with a loud screech, he raced out of the room mumbling something about getting a coat.\n “Thank you,” Lily sighed.\n “For what lass? Don’t be troubled by the lad. He ’s the image of his da at that age. Folk say wild geese don’t lay tame eggs. Hellfire, our Lochiel was as a mite. And could charm the horns off the devil to boot. But mind you, the laird is a soft one deep down, and the son is no different. ” Lily couldn ’t imagine what the maid could be referring to. Soft and Ewen were two words that she would never think to use in the same breath.\n John raced ahead of her, kicking rocks, swatting tree branches, and racing to and fro on the road. Lily enjoyed the opportunity to really take in the sights around her. She had only been outside the keep once, and, as she had been frantically trying to flee in the night, she hadn’t really noted much of anything about the surroundings. Now, though, she found herself utterly charmed. The village wasn’t large, yet the warmth and broad smiles of the people she encountered on the road made it feel as if it was humming with life.\n The air was sweet, like rich earth and heather, and the contrast between the crisp breeze on her cheeks and uncharacteristically warm sun at her back invigorated Lily. Small cottages dotted the countryside. They looked to be no larger than one-room shelters, the gray stone of their walls barely peeking out from thickly applied mortar, cheered by squat wooden doors painted in shades of yellow, red, or green. Lazy plumes of dark peat smoke rose from the small chimneys, dissipating over the thatched roofs.\n Some of the homes were nestled in their own modest valleys, with clusters of sheep and cattle grazing on small tracts of lush, green grass. Others were separated by small moors, tangles of purple and brown and red creating makeshift fences between them. White and wine-colored heather dotted the land. Lily also spotted numerous clusters of bittersweet, and its sprawling vines put her in mind of the labyrinth. She made a mental note to keep her eyes peeled for a wall of those telltale black berries like the one from the maze.\n “Hello?” Out of nowhere, a woman’s voice purred from behind Lily, startling her.\n “Oh! ” Lily yelped.\n “Oh my, ” the woman said, placing her hand on her heart to affect dismay. “Do accept my apologies for surprising you. ” Her tone of voice suggested that some sort of minor victory had been won.\n Lily turned to see a young woman, lips pressed into a regal smile, with the fragile beauty of a fairy-tale princess. Two flawless and impossibly yellow ringlets framed a creamy complexion. She wore a rose -colored dress, and her corset was drawn so tightly that her petite, perfectly rounded bosom seemed as though it would burst out at any moment. Not one speck of dust clung to her rose brocade skirt or to the yellow silk slippers that just happened to match exactly the color of her hair.\n Lily quickly scanned her own clothes and noted in dismay that she was already somehow covered in a thin film of soot, even though they had left the castle but an hour past. Lily stifled a grimace and thought that this was the kind of woman who got winded after an afternoon of too much embroidery.\n “Rowena!” John suddenly appeared and threw his arms around the woman’s surprisingly tiny waist.\n “I didn’t know you were coming! Why are you here? How long are you to stay? Can we go for a picnic?” John’s barrage of questions elicited a prim grin from the china doll ’s face.\n “Oh my, did your father not tell you I was coming?” She tsked and heaved an exaggerated sigh. “He can be so forgetful sometimes! ” Rowena shot a proprietary look at Lily, and, despite her better judgment, Lily felt a pang of angry jealousy prickle down her spine.\n “You, my handsome laddie, will have the pleasure of my company, staying in your very own keep! ” Rowena tittered at her own merriness. “Isn’t it grand?\n “Oh! But where are my manners? Aren’t you going to introduce me to your village friend?” If Lily thought at first sight that she wasn’t going to like this woman, now she knew for certain. She recognized her type in an instant. Coy was unfortunately not limited to a particular century.\n “Aye, her. No, she ’s not from the village. My da took her in.\n She’s my new governess.”\n “Oh, how very pleasant for both of you! ”\n Lily grimaced at her false enthusiasm—especially when she could see the bemused glint in Rowena’s eye. The woman was clearly tickled by the prospect of another one of John ’s victims, and likely relished it all the more since the boy plainly adored her.\n Rowena stood for a moment in haughty silence, then announced impatiently, “Well, I am assuming your friend has a name other than just”—she turned to Lily and, with raised eyebrows and pursed lips, chirped “governess?”—\n “Yes, of course. ” Lily nodded slightly, as if to shake off her distraction, and attempted a smile. “My name is Lily.”\n “Just Lily?” Rowena asked, with a playfulness that didn’t entirely mask her mockery.\n “Nooo, ” Lily spoke as if to a misbehaving child, “it’s Lily…”\n She cursed herself for stumbling, then added with bravado, “Lily Cameron. ”\n Rowena’s imperious attitude cracked for a moment, revealing something wicked roiling beneath the surface.\n “Cameron?”\n “Yes. I’m a distant cousin from France. ”\n “France?” Scowling, Rowena assessed Lily from head to toe then asked with thinly veiled skepticism, “Really?” A venomous smile turned the corners of her mouth. “Well then, enchanté ”. \n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-22.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: \n Master of the Highlands (Highlands #1) \n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\n \n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
