{"id":93768,"no":29,"title":"Page 29","content":"\n Once she had finished her sketch, he had reclasped the necklace about her throat himself. As he had run his hand over her shoulders, a bolt of heat had run through him. He had to steel himself from looking at that neck again, at its creamy expanse underneath the gold of the necklace, at the fullness of her bosom just visible underneath the froth of lace at her chest. A body like that deserved more decoration than such humble jewelry.\n Ewen chided himself. This was not the way a laird should be comporting himself. He had learned his lessons with Mairi. He had an heir and did not need the complications in his life that a woman would bring. No matter how genuine that woman seemed to be.\n Nor how tempting.\n Chapter 18\n “I’ve been wondering if you’d recovered. ” Lily came upon Robert on her way back from the stables. The walk, not to mention patting a few horses, was always good to clear her mind. And she found herself needing to clear her mind more than usual.\n “Hmm?”\n “The other night. A little too much veni vidi vino, as I recall. ”\n Robert blushed. “Yes, well … but what of you?” He quickly changed the subject.\n “Me? I wasn’t the one hitting the Bordeaux. In my time, there ’s a rule against something called ‘drinking and dialing. ’ I think you discovered its seventeenth-century evil twin, ‘drinking and discoursing. ’”\n “Dialing?”\n “It’s a phone thing. A phone, well a phone is …” Flustered, she said, “Oh never mind. ”\n “I do know what a telephone is, Lily.”\n She looked at him as if she had just discovered a plasma TV on the wall of her castle bedroom. “You do?”\n “Aye, ” he laughed. “I ’ve been wondering why you’ve never asked me about my time, knowing as you did that I too went through the labyrinth. ”\n “Yes, I, well … it seemed too personal a thing to ask about.”\n “Wouldn’t you say we ’re past that now?” Robert asked mischievously. He added in a comically thick Scots brogue,\n “I mean, you have seen me piss drunk off my rocker, aye?” She laughed. Hearing such modern slang come out of his mouth was refreshing. It was a sudden rush of her own time, a reminder of its quirks and most of all its ease.\n A pang of nostalgia for the modern world straightened her features. She said, “But when we spoke that first day, it didn ’t seem like you were from my time. And, well, you’re always wearing those clothes. ”\n “Ah, but you said the twenty -first century. I ’m of the twentieth. As for my clothing, I confess, I enjoy walking about the keep feeling as if I were Copernicus occupied with my scholarly inquiries. ”\n They laughed, but then Robert’s smile faded. He looked for a moment into the distance, as if concentrating on a faraway place. “No, I hail from a more modern era. To be precise, 1916.”\n Lily stared at him, silently, expectantly, so he continued, “I told you that I was but fifteen when I found the maze.”\n “But where are you from?” Lily pressed. “What of your family?”\n “They were …where to begin? I lived with my father, he was an archaeologist. ” A distant smile lit his face. “And you think me a bookish soul. If only you were acquainted with my father! ”\n “So, I take it we have him to blame for all of that Latin of yours?”\n “Oh yes, ” he laughed with uncharacteristic ease, “but I have spared you my Greek, have I not? Though I ’ve been meaning to dust it off and—”\n “Just do continue, ” Lily interrupted. She ’d had a lifetime ’s worth of Latin aphorisms already—she didn’t need any Greek at the moment. “Your father?” She prompted.\n “Ah yes, my father. ” He nodded. “I didn’t have a mum, you see. ”\n “Robert, everybody had a mother at some point,” Lily chided. Now that he was speaking so freely, she couldn’t help but pry a bit.\n “You ’re a vexatious woman.” He shot her a playfully annoyed look. “You speak truly. I did indeed have a mother, but she died when I was quite young. ”\n Robert’s voice became suddenly serious. “I have no recollection of her. I once had a photograph …” His voice trailed, and his smile faded into a look of regret. “I do wish I still had that. ” He shrugged. “We had lavatories, newspapers, medicines. But my pictures. I had but a few, yet they are what I truly miss. ” His voice was distant as he mused, “I was told I have her hair. But, you know, you can never really tell from a photograph, can you?”\n “No. ” Lily paused. “I suppose you couldn ’t tell with the old black and whites, could you?” Puzzled, he looked at her for a moment, as if considering a different question.\n A sudden shouting interrupted them, and they looked in the distance to see John attacking a lone tree with his wooden practice sword. The dull clack of wood striking wood echoed through the glen as the boy feinted, thrusted, and whirled about like a young berserker, hollering unintelligible, but clearly dire threats.\n Lily laughed. “He is his father’s son sometimes, isn’t he?”\n “You speak truly,” Robert replied. “I feel a special tie to young John, you know.”\n Lily looked confused, so he explained, “Because of his mother. I also know what it is to live without a woman’s presence. ”\n He shut his book and placed it in the grass. “Most difficult was how my mother’s loss defined my father. I see that too with Ewen.\n “Mind you, ” he quickly clarified, “Ewen didn’t care for that woman, Mairi. But still …” Robert became thoughtful. “I see it in him. That small part of a man left hollow from want of a woman. ”\n Lily felt a quick spark of jealousy, and unwittingly let confusion and envy flash across her face. Robert addedquickly, “Not from want of Mairi. ” He studied Lily as if noticing something for the first time. “But from want of a woman. ”\n He sighed. “I sometimes fancy the different turns my own life would have taken, had my father remarried. I wonder the same of John ”. Robert hesitated for a moment, scrutinizing her reaction. “The boy would flourish under a woman ’s hand. Do you not agree?” His eyes twinkled as he added, “If only our bullheaded Lochiel would take himself a new bride.”\n Uncomfortable, Lily quickly redirected the conversation.\n “So what happened to your father then?”\n “Well, he was quite broken up when my mother died. It was the typhus that got her. In Persia. He specialized in Persian prehistory, you see. My father never forgave himself. ” Robert’s voice was detached as he rattled off the rest. “So he trundled us back to Scotland, returned to his dig, and immersed himself in his work. He’d come back for holidays, otherwise it was just me, Gordon—he was my brother—and my uncle. ”\n He gave a bitter laugh. “I had always thought, if I were good at my studies, perhaps I ’d catch my father’s eye. ”\n “Were you and … Gordon, is it? Were you close?”\n “Ha! ” The dark look on Robert’s face chilled her. “That’s just it, Lily. We were not close. He was older than me, enough to remember my mother, aye? Gordy hated our father, blamed him. And so I hated Gordon. ” He snatched a tuft of grass and began twirling it in his hands.\n “I can’t imagine you hating anybody, Robert. ”\n “Oh no,” he countered dourly, “I despised him. He was such a strapping lad. Sports and lasses came with ease. ” Robert added acidly, “And then the war broke out, and he couldn’t sign up fast enough.”\n “Oh,” Lily gasped, sensing what was to come. She shook her head, “World War I and the trenches … that was a horrible time. Historians came to call it the ‘Great War. ’”\n “Great, eh?” Robert snarled in disgust, and Lily immediately regretted having interrupted him.\n She quickly asked, “Where did he die?”\n “In Picardy. France, aye?”\n “Yes, ” Lily said quietly, “I know Picardy. ”\n “And do you know what I found in his kit? ” Grief thickened Robert’s voice. “A picture of us as lads. ”\n His voice grew louder as he elaborated, “No letter from some lass. Not some book. A photograph. Of him and me. ” Robert was silent for a moment, and then added gravely, “I’m ashamed. I should have been with him. ”\n “But you were too young! ”\n “No,” Robert spat, “that didn’t stop any number of other lads. I could have been with him, could have doctored my papers, passed for eighteen. The soldiers from the west, where we lived, aye? They formed what they called a ‘pal’s battalion, ’ so the Highland boys could fight together. ” A look of self-loathing twisted his features.\n They were both silent for a moment. Lily wanted to cry out: But you were only fifteen, there was nothing you could have done! But she knew she couldn ’t convince him. She sat silently, waiting for Robert to finish.\n “And it was that day that it happened. Traveling here, I mean. The day I found that photo of Gordy and me. ” He looked at her imploringly. “I had to walk it off, you see, that feeling. Like to betrayal it was. ”\n He shook his head, “Dear braw, fool Gordon. ” He added distantly, “It had to have hurt, living all those years and no parent there but for the memories of our mum. ”\n He sighed. “Walking that day, that ’s when I found the labyrinth. And …you know the rest. ”\n Robert cleared his throat and, with that, his voice assumed its usual formal tone. “And so, fair Lily…”\n Lily was startled back into the moment. “ So what?”\n “And so now it’s your turn. ”\n “My turn for what?”\n “You must tell me, ” he tsked, “what of the future, then? Did we win the war?” \n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-29.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: \n Master of the Highlands (Highlands #1) \n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\n \n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
