{"id":93770,"no":31,"title":"Page 31","content":"\\n\\n She shook her head at the direction her thoughts were taking. The laird and his inner life had to be of no concern to her.\\n\\n The son’s feelings, however, all of a sudden were. If nobody at the keep was going to take an active interest in John, well, she certainly would. She caught up to John on the garden path, resolved to be as patient and as loving a tutor as she possibly could be.\\n\\n That is, until the time was right for her to go.\\n\\n She was brimming with pride at the sight of John working intently over his collage, arranging and rearranging feathers, leaves, and a good number of mysterious scraps mined from their garden excursion. Lily had never seen him so silent for nearly so long before.\\n\\n She had remembered a few tips from a crafts course she took in college where students were taught to make things like paper, glue, and dye without relying on modern materials. At the time, Lily had thought it a waste of time. Some of her peers had loved steeping themselves in obscure craft-related arts like bookbinding, paper making, or encaustic painting using just wax and pure pigments. She had not been one of them, however. Lily had wanted to be a painter using the usual techniques and she figured she would rely on her local art supply store for whatever she needed, just as she always had.\\n\\n Lily had experienced a moment of panic remembering that there was no Elmer’s in seventeenth-century Scotland. Glue was as old as the Egyptians, though, and she was so thankful to her alma mater that what she had thought of as Artinsanity 101 instead of Artisanship 101 had been a core course on the way to her degree. John had loved their fishing expedition to Loch Linnhe, but even more he loved that the goop he made from boiling their catch would actually make things stick to paper.\\n\\n Considering the extracurricular fishing, the whole enterprise took three days. Though she would never admit it to John, Lily had been delighted to have a few glorious days with no Latin, sums, or geography to speak of. John had even shocked her by requesting they stay up late together after supper to complete his masterpiece.\\n\\n “Done. ” The glee that had been clearly writ on John’s face during the past days was now muted. Lily sensed some trepidation on his part at revealing his finished artwork. She could understand, though. After all, she was the one with a closet full of canvases at home that she ’d never shown to anybody.\\n\\n “I would love to see it, if you ’re ready to show me. ” Remembering more than a few public humiliations during art department critiques, Lily tried her best to be gentle. John screwed up his face, visibly mustering his courage, and silently placed his artwork on the table in front of Lily. She had been prepared to feign appreciation for the thing, but what she saw startled her. She exclaimed with total sincerity, “It’s wonderful! ” She was amazed at his sense of composition; bits of garden refuse were arranged on the page in an abstract—though clearly visible—seascape. Lily was also impressed by his creative use of materials. She had been uneasy to discover that he had stolen a handful of flour from the kitchens, but all of her concern disappeared to see it put to use so ingeniously spattered in the corner and across the picture as the sun and its reflection on the water.\\n\\n “Truly, John, this is beautiful. ”\\n\\n The anxiety on his face melted and the boy just beamed. Lily was overwhelmed. It thrilled her to have such an impact on him with something so simple. John had finally discovered something that interested him and that he was good at. Even if he dabbled in the arts for just a couple of months, it would be a perfect opportunity for him to learn more focus when approaching his tasks. Lily was already thinking of ways she could integrate other lesson plans based on the arts—calligraphy instead of penmanship, dye making instead of ecology. And best of all, they were all things that involved getting their hands dirty. She was no professional, but Lily knew dirt was something every boy loved.\\n\\n “Let’s go show your father! ”\\n\\n Anxiety appeared anew in John ’s furrowed brow. He seemed afraid of Ewen. Or rather, afraid of disappointing him. Well it was no surprise, she thought with a swell of anger. The laird could be impossible sometimes: he was a formidable man, powerful clan leader, and, from what she gathered, a fierce warrior. In other words, not the most approachable dad.\\n\\n Lily, feeling like an angry bear protecting her cub, was determined to see Ewen forge a loving and open relationship with his son. Something more than just the laird and his heir. Ire prickled through her as she considered the dangerously narrow “fearsome sons of the hound” attitude. Every kid needed the nurturing support of their family, even if that kid is the future Lochiel of Clan Cameron.\\n\\n As it turned out, Ewen was nowhere to be found and the late hour forced John back to his rooms. He had worked himself up to see his father that evening, going from roomto room, anxiety growing at every turn, and it seemed as if they kept just missing the elusive laird. They never could find him, and by bedtime, the poor boy was still tense from the missed encounter.\\n\\n John jumped at the sound of a light rapping on his door.\\n\\n “Da?”\\n\\n “Nay, just me, lad.” The door creaked open to reveal Kat ’s face. She turned to Lily and added, “I’ve come to settle the boy into bed. ”\\n\\n Deflated, John sank onto the side of his bed, and without thinking, Lily placed her hand on his back to comfort him. The thought of parting with the boy now left her feeling empty and she surprised herself by saying, “No, Kat, I’ve got this one.”\\n\\n A startled grin shone on John’s face, and Lily knew she had made the right decision. “I’d like to see him into bed tonight. ” She wrapped her arm around his shoulder and laughed. “I think we can handle it, don’t you think, John?”\\n\\n “Aye, lass” Kat paused, a slow smile warming her face “I — —think you ’ve more than the handle of it. Goodnight then to you both. ” The maid nodded meaningfully and, just before pulling the door shut, added, “And I thank you, Lily. ”\\n\\n Lily wanted to tuck him into bed and give him the kind of soothing bedtime ritual that her Gram used to give her. John never knew his mother and probably the only female nurturing he had ever experienced was at the hands of a household employee.\\n\\n “So, then. ”\\n\\n “So?” John asked timidly.\\n\\n “So what do we do to get you into bed? You must have jammies or something. ”\\n\\n “I don’t know jammies, but I’ve a flannel gown I wear for sleeping. ” A look of mischief lit his eyes. “And once in bed, I ’m told many stories. ”\\n\\n “Many stories, huh?”\\n\\n “Aye. ” He nodded gravely. “Dozens of them. Yarns about knights and fighting and such. ”\\n\\n “Oh really?”\\n\\n “Aye, mum. ”\\n\\n “Alright, young man, get into that gown and into bed with you. ”\\n\\n John scampered off to retrieve his dressing gown, and as he dressed, Lily was lost in thought. She found herself fighting back an inexplicable wave of melancholy. That her relationship with John had found such ease should have cheered her, but instead their bond grieved Lily. She dashed away a tear at the thought that she would have to leave this boy who had somehow sidled into her heart.\\n\\n He ran into the room and dove under his covers, shy to show himself in his pajamas. Lily couldn ’t help but beam at him. “No stories tonight,”she announced.\\n\\n “No?” John looked crestfallen.\\n\\n “No. ” She leaned over and ruffled his hair in what was fast becoming an easy gesture between the two of them. “And don’t fret. We ’re doing something different. I ’m going to sing you a song. ”\\n\\n The boy snuggled deep under his quilts, looking hopeful but a little uncertain.\\n\\n “My Gram used to sing to me on nights I couldn ’t fall asleep, and I think it’s time we add a little history of music to your curriculum.”\\n\\n He hesitated for a moment, suddenly uneasy at being treated like the child he was instead of the laird ’s almost-grown son. Lily also thought she read a trace of the skepticism he felt at being treated with such outright affection.\\n\\n “I never knew my mam. ”\\n\\n “Yes, I know that. I ’m sorry. ”\\n\\n “Seems my da didn’t fancy her overmuch.” He looked distant for a moment then focused his intent gaze on her.\\n\\n “You said your Gram. Didn’t you have a mam neither?”\\n\\n “Well” —Lily was taken aback at first at the frankly personal question “I did have a mother. Or, I still do, I guess. She — left when I was very young, though. ”\\n\\n John looked eager for the connection that she was offering and Lily found herself willing to share. “Even though my Gram raised me and I loved her very, very much, I never got over feeling mad at my Mom. ”\\n\\n John looked relieved. “I ken your meaning. I get mad at my own mam sometimes too, though I never knew her. ”\\n\\n “Yea … my mom found some new man to marry.” Lily was quiet for a moment then added “I felt very lonely for a long , time. ”\\n\\n “A bit like me, aye?”\\n\\n “I suppose you ’re right. I never thought of it that way. ”\\n\\n “Do you still feel it? The lonely part, I mean? ” The boy looked desperate for a magic answer, and, after truly considering her solitude for the first time in many years, she realized she couldn ’t give him one.\\n\\n She didn’t know why she was being so honest with him. Perhaps it was the culmination of an emotional day: watching him pour himself so completely into his project; sensing all the buried anxieties around his father; or seeing him—normally just a young troublemaker—so vulnerable for the first time.\\n\\n “Yes, John. ” Sighing, she sat down on the edge of his bed and found she had to look away for a moment. “I do still feel lonely. A lot. ”\\n\\n John’s eyes met hers and he gave her a warm, albeit unreadable, smile. He snuggled deeper into the four-poster bed and Lily tucked him tightly under his heavy quilts.\\n\\n She waited to make sure John was finished asking questions. Lily knew she was probably done answering them. She hadn’t thought about her own situation in some time. Work had been so crazy up until the end, she ’d never considered her solitude much. Lily dated like the other single women in the city and tried not to admit the fact that she could see somebody every night of the week and still feel acutely alone. John ’s question forced her to ponder why it was she had forgotten about her loneliness of late. Since she had arrived in Ewen ’s household to be precise. She tried to stop that line of thought and asked abruptly, “Hmm …which song? \\n\\n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-31.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: Master of the Highlands (Highlands #1) \\n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \\n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\\n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
