{"id":93774,"no":35,"title":"Page 35","content":"\\n\\n Gormshuil looked up, feeling the charged white light of the moon on her face, and studied the stars in the sky. She looked down to arrange the papers, and back up then down again, ordering the charts just so.\\n\\n Dropping a page from her hand, the old woman froze. She canted her head, her face a still mask. The witch ’s unfocused eyes turned sightlessly to the black woods around her.\\n\\n “Ah!” A small gasp of surprise escaped her.\\n\\n “I see now, lass, ” she said. A knowing smile eased over her features, creasing her aged skin, thin like parchment. “And so it is.”\\n\\n Chapter 21\\n\\n Lily slowly became aware of the world around her. She was in a bed. Securely bound in sheets or restrained somehow, yet she was oddly comfortable. Cozy even. She nestled deeper and remembered the river. Her hair was still damp but she was now blessedly warmer. Almost hot, in fact. She slowly opened her eyes and looked around. She was in a room that was not her own. It was large, with a row of glorious stained glass lining the upper wall. She was transfixed by the light shining through the windows, casting fragmented patches of green, blue, red, and orange light across the floor and along the surface of the bed. In that fog between sleep and waking, her eyes filled inexplicably with tears—it was the most beautiful thing she had seen in a very long time.\\n\\n Her senses began to clear, and she was startled to find that she wasn’t restrained at all. She was lying on her side and there was a large muscled arm wrapped snugly around her shoulders. She tried to shift, but the owner of the arm pulled her more closely along his body, pushing an iron -hard leg between hers to come to rest atop her own, much smaller one. She felt the tickle of short, coarse hairs and realized in shock that both the leg and the owner were naked.\\n\\n “Let go of me!”\\n\\n Lily heard a chuckle as he nestled in even closer. She paused for a moment to savor the heat emanating from him into her once-chilled body and then, with a start, felt a slight movement along the small of her back.\\n\\n She knew she had to get out of this man ’s bed and his sudden hardness clinched it for her. “What do you think you ’re doing?” she yelled as she tore herself out of her warm cocoon. She turned to see Ewen lying there, face dangerously still.\\n\\n “I’m saving your life, lass. You might thank me. ”\\n\\n “Thank you? Thank you for, for…” Lily glanced down in horror at the recognition that she too was completely naked.\\n\\n She pulled the sheet up under her chin and felt her temper rumbling like a volcano about to go. “I’ll thank you to get out of here is what I ’ll thank you for. What the hell do you think you’re doing anyway? Or do you enjoy taking advantage of unconscious women?”\\n\\n A dark cloud passed over Ewen’s face. He spoke quietly and deliberately as if he were trying to explain something to an unruly child. “You were freezing to death. If you don’t remember correctly, you fainted on the riverbank, lass. You rather I ’d left you to die, is it? I brought you here and heating water for a tub would have taken too long. You ’d no time to spare, and the fastest way to restore your body heat was with my own. ”\\n\\n “Well …well ” … , she stammered. He had a point. She had been dangerously chilled by the time she got out of the water. It was a wonder she’d had the energy to revive John.\\n\\n “How chivalrous of you to take this burden on yourself instead of having some woman revive me. ”\\n\\n Ewen glared at her. “Would you rather I had one of the maids strip down to warm you? Aye, they could have done the job well, though you might have been infested with a few wee fleas afterward.”\\n\\n She had seen some of the scullery maids about the castle and supposed he might have a point.\\n\\n “Besides, your shift isn ’t the most seemly thing, and I spied an odd mark on your back. I thought best to hide it from the slack-jawed servants about the keep. ”\\n\\n “What? Oh, you mean my tattoo. ” Lily chuckled. She had forgotten about that. A small, colorful butterfly in the small of her back leftover from her college days. Because she couldn’t see it herself and it felt like years since a man had gotten close enough to notice the thing, she had all but forgotten it was there.\\n\\n “A, what did you call it, tattoo, eh? I ’d see it. ”\\n\\n Before she could protest, two strong hands deftly manipulated her shoulder and hip and she was lying on her stomach. A mischievous light came into Ewen ’s eyes, giving Lily butterflies in more places than just her tattoo. He dragged the sheet lightly down her back and folded it over her buttocks. Lily wasn ’t sure if she hated this or loved it, so she just lay there silently, mesmerized, curious as to just what Ewen would do next.\\n\\n His hand traced gently up and down her back then came to rest on her tattoo. “Aye, it ’s a beauty, it is. I’ve seen sailors with crude marks on their skin, but none so fine as this. ” He traced around and around the wings of the butterfly.\\n\\n “So, this is what they learn to do so many years hence? And do all women get them? Is it a mark of your family?” Lily felt a slow throbbing begin between her legs and stammered, “Um, yes, they have machines that do this. They can do very delicate work with many colors. Not many people get them. Well, men have always gotten them, but only recently have women started to get them. It ’s fashionable for college kids especially. The butterfly doesn’t have anything to do with my family. It doesn ’t mean anything really, I just liked the image that’s all. ”\\n\\n Lily was rambling in a way that she only did when she was nervous around a man.\\n\\n He began stroking her back again, only this time his hand began to reach both higher and lower along her back. Up to her shoulders, down to the small of her back. Up to Lily’s neck, down to just beneath the sheet. Up to tangle lightly in Lily’s hair, then ever so slowly down, beneath the sheet. Ewen ’s hand ran lightly along the velvety soft skin, his thumb barely grazing along the line of her bottom, his hand pausing to gently cup the round flesh there.\\n\\n Lily swallowed hard. This really was completely unacceptable, but she was frozen to the spot. She forced herself to speak. “You really need to get out of here now. I do thank you for heating, I mean, saving me, but I would like to be alone now to dress. ”\\n\\n Ewen had a devilish smirk on his face that was making Lily more flustered by the second.\\n\\n “Really, please get out of bed now. This isn ’t proper at all.” Lily was getting nervous. She was in way over her head. She wasn’t about to surrender to him for a third time. God only knew what he would decide to do—or not do—at the last moment, and Lily did have some semblance of pride to uphold.\\n\\n “Out of bed?” Ewen smiled outright. “Well all right lassie, if that’s what you want. ”\\n\\n He swung his legs over the side of the bed, and Lily finally got Ewen’s little joke. He rose up like a panther, turned, and stood towering over the bed, body tensed as if ready to pounce. He was fully erect, extending out of the tangle of black hair at his groin.\\n\\n The delicious ache that Lily had felt earlier was nothing compared to the yearning that pounded between her legs, tightening her belly, making her breasts taut with need. Ewen ’s naked form was like nothing Lily had ever laid eyes on. His dark hair fell loosely across his shoulders. His body rippled with power and the muscles earned from years of fighting for his life, training day in, day out along the unforgiving Highland terrain, swinging an immense claymore over his head as if it were no more than a kitchen knife.\\n\\n He used his body to protect his people, and Lily found herself devouring every inch with her eyes. The smooth, broad chest. The silvery webs of scars from old battles that marked his right breast, his abdomen, his left forearm. She wanted to trace them, to run her tongue lightly along each one as if she could somehow absorb the pain of wounds past.\\n\\n She looked up at Ewen. His face lost all humor as he looked down at her gravely, the desire clear in his eyes.\\n\\n This had gone way too far now. “No,” she forced the word out in a whisper. “I need you to leave. Now. ”\\n\\n Ewen ’s voice was surprisingly gentle considering the driven look in his eyes and his otherwise rigid state. As he murmured to her, his Scottish brogue became even more pronounced, more sensual as he let the words roll slowly from his mouth. “Lass, you see I want you. And I think you want me. I’ve never wanted a woman like this and I’ll fight it no longer. ”\\n\\n He sat on the edge of the bed and tangled his fingers in her hair. His voice lowered to a husky whisper. “I ’d give you anything, lass. I’ll bring you all of Scotland. But please just say yes to me, sweet Lil’ ”.\\n\\n This seduction was more than she could take. Ewe n was supposed to be helping her find her way back. To surrender to him now had a feeling of finality, as if she ’d be turning her back for good on the place she came from. His words sounded so beautiful. She wanted him. Of course she did. But she was suddenly unsure.\\n\\n Flares of panic alarmed her. Who was this man who killed his enemies with ease? Who might even have a little romance going with that nasty Rowena. Whose words of love tumbled easily from his mouth.\\n\\n “No. Please just get out.”\\n\\n “Just tell me why, Lil’ ”.\\n\\n It had been so long since she’d made herself vulnerable to another. It made her afraid now, and uncertain. Not knowing what else to do, Lily found herself lashing out.\\n\\n “Don’t call me that, ” she snapped. Ewen looked as if he had been slapped. “I don’t trust you, Master Cameron. You or your flowery words. ”\\n\\n “Trust?” He looked bewildered. “Och, what have I done to fail your trust?”\\n\\n “Seducing women seems far too easy for you, Ewen. ” She wasn ’t sure where she was going, but Lily plowed ahead anyway. “You should think less about carnal matters and more about … well, about other things. ”\\n\\n Ewen looked at her in disbelief. “Seducing women? I haven ’t spoken so to a woman since I was a lad, and then I was but trying on the words of a man, not giving voice to my heart.”\\n\\n His gaze grew gentle again. “Who are these women you’re so intent on, Lil’?” \\n\\n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-35.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: Master of the Highlands (Highlands #1) \\n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \\n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\\n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
