{"id":93784,"no":45,"title":"Page 45","content":"\\n\\n “What bloody nuisance these redcoats are, aye?” Malcolm smiled weakly, his eyes gentle even in death. “You’ll take care of them for me, Lochiel? My lassies?” A spasm in his belly doubled the clansman, and he collapsed onto his back. “My sweet Una has a house full of mouths to feed. ”\\n\\n “Och, Malcolm” —grief ripped through the laird, and made his voice hoarse “— your family will not go hungry. ”\\n\\n Ewen clasped Malcolm ’s hand firmly in his. “I ’ll tell them how proud you made me, man. You fought well. And you die a hero’s death. ”\\n\\n Malcolm stilled, his features serene, green eyes gazing into an unseen distance.\\n\\n “ Guidh soirbheachadh Dhé le, Malcolm. ” Ewen’s voice cracked as he pulled his clansman ’s bonnet over those vivid eyes and his ruddy, freckled face. “Godspeed.”\\n\\n “Cameron men! ” Ewen rose to his feet, renewed fury in his voice. “A ’ slàraigeadh!”\\n\\n The camp fell into chaos as the clansmen methodically split small clusters of redcoats apart from the larger group like stripping boughs from a tree, and all the while the raging Highlanders darted in and out of the woods, appearing more like one hundred men than their meager thirty-two. When reaching the end of a battle frenzy, Ewen never knew if a quarter of an hour or a quarter of a day had passed. As he watched the tails of no less than fifty redcoats flee through the trees and away from the onslaught of his men, a grim smile chiseled into his stilled, clenched features.\\n\\n “Uncle, to me! ” The laird’s smile faded when he caught sight of Donald and the reddish brown blood smudged across his cheek and staining the entire left shoulder of his shirt.\\n\\n Donald laughed off his concern. “Och, lad, ’twas only a scratch on my cheek. I ’m thankful too, aye? I needed a braw shave this morning.”\\n\\n He clapped his nephew on the shoulder. “It ’ll take more than a young redcoat to fell me. ” Donald’s laughter boomed and in his voice erupted an unmistakable note of relief, sounding a release from the single-minded gravity of combat. “Though, the clever laddie did miss my neck by a whisker. ”\\n\\n “You ’re like a lad after his first kiss, uncle. I ’m glad of it.” Affection shown clearly in Ewen’s eyes. “Our work’s not yet done, but you shouldn ’t find it too wearisome. A bald head is soon shaved, aye?” They shared a quick laugh, the tension of battle still needing an outlet. The laird continued, “Tell the men to root out what remains of our wee red squirrels and round them together for me. ”\\n\\n “Aye, ” Donald said, “I spied some what thought to get to the sea and leave the way they came. I ’ll give them chase, you see to the woods. A few got away through the trees like ewes afraid of a shearing. ”\\n\\n Ewen was picking his way through the forest, hunting for the last of the retreating redcoats when he heard a familiar voice.\\n\\n “Greetings, Lochiel. ”\\n\\n He turned and recognized his enemy at once. Despite his stocky build, Monk had an effortless elegance, and appeared all the more so for his pristine uniform. The general smiled and shook his head at Ewen as if he h ad caught the laird in some naughty prank.\\n\\n “Och,” Ewen spat, “I see you chose to wear a uniform this morn, instead of that bonny blue topper you donned when last we met. Tell me, Monk, it that what makes your men call you general? You’ve the coat for it?”\\n\\n Monk ignored his comment and said genially, “ Shan’t we settle this like gentlemen over a brandy? It’s not too late, Lochiel. You can save your clansmen. ”\\n\\n A man emerged from the trees and glowered dramatically at Ewen. Though his tartan and bonnet proclaimed him a Scotsman, he stood—legs apart and hand poised over sword hilt—directly behind Monk, in a manner that announced his true allegiance.\\n\\n Ewen inclined his head toward the man. “A MacKintosh, is\\n\\n it?” Shaking his head, the laird looked to Monk and mused,\\n\\n “I see the way of it, then. You ’ve men to cook for you, men to bow to you, and you’re also a coward who ’d hire men to die for you?”\\n\\n “I’ll not soil myself with your savage blood.” Monk laughed.\\n\\n “This man goes willingly to fight for me. But to die for me? That is not necessary. No, Ewen, you are the only one who will be dying today. ”\\n\\n Monk turned and appraised the man behind him. The Scotsman grabbed his sword hilt and gave Ewen an exaggerated scowl, bearing a set of uneven and much -decayed teeth.\\n\\n The general chuckled. “Ah, Ewen, do not imply I send my man to his death. Do you really think I ’d waste a youngster on such an enterprise as this? To kill the laird of Clan Cameron—what a magnificent trophy! No, I rely on only the best to kill you. ”\\n\\n “Now, sirrah?” the Scotsman hissed.\\n\\n “Yes, and do let me know when you ’ve dispensed with the Cameron. I ’ll make certain your Lauchlan MacKintosh knows that I am well pleased with your efforts. ” Monk examined Ewen thoughtfully, a slight smile on the edge of his lips. “Good day to you, Lochiel. It is a shame you neglected to do business with me. ” The general made a slight bow and disappeared back into the trees.\\n\\n “I ken you, man.” Ewen spat by his feet. “You go by Allen, aye? Word is, your laird sent one of his men to the Cameron keep, but your pursuit ’s in vain. Once I ’m done with you, I ’m back home to kill your kinsman. ”\\n\\n “Nay in vain, Ewen.” Allen’s voice was a hoarse whisper, as if his throat had never recovered from a long- ago injury. “’Tis my laird himself in your keep, and by now Lauchlan has killed your boy and taken your woman. ” He gave a toss to his tangled mat of mud brown hair. “I’m not knowing if he ’ll keep her or not. Depends on how much she pleases him, aye?” The man sucked on his teeth a moment, then asked, “What say you, Ewen? Is she pleasing? ’Tis a shame she ’s not here to see you die like a dog. ” Allen MacKintosh began to circle the laird. “She might could save her own skin if she pleases Lauchlan. He ’s done dallying with that Rowena. The yellow- haired wench thought to wed you, Cameron. ” He barked out a laugh. “Now there ’s a lark. ” Allen began passing his sword from hand to hand, continuing to crouch and circle the laird. “I’ve a thought to give Rowena a ride myself. But maybe I won ’t waste my time on a used parcel like her and save myself for your Lily.\\n\\n That’s her name, aye?”\\n\\n The laird stepped forward and strolled almost lazily toward the man. Allen baited, “ Some distant French relation, is she? Curious lass, I hear. But no matter. I ’ll just keep her in a vase like, in my rooms, and none the wiser for her peculiar ways. ”\\n\\n Ewen exploded in a forward dash, the blur of his claymore startling his opponent, despite his readied posture. The metal of their swords crashed and sang through the air and crashed again, hammering a furious beat. The two Scotsmen were evenly matched, and Ewen ’s nonchalance rapidly morphed into acute focus.\\n\\n Though somewhat shorter, the MacKintosh man was built like a bull, and his barrel-chest and arms like small trees slammed his sword down upon Ewen’s again and again in an avalanche of hatred and vengeance.\\n\\n Allen’s attack was unrelenting. Ewen fought for calm, hoping to gain the upper hand. “Why would you do it, Allen?” he asked in a voice as casual as he could muster.\\n\\n “Why would you play traitor to the Highlands?”\\n\\n “You don’t see the way of it, do you, Cameron? ” The man was big but slow, and the rapidity with which Ewen countered his attack was beginning to wind Allen. He huffed, “The MacKintosh clan will play hired sword if it means getting our lands back. ” Although he thrust his sword with renewed effort, Allen’s shortness of breath betrayed increasing fatigue.\\n\\n “Lands …rightfully … MacKintosh.”\\n\\n “Ah, is that what this is about then! ” the laird exclaimed. He saw his opportunity. Lacking Allen’s girth, Ewen was the more agile of the two and used that to his advantage by making his opponent come to him, all the while carrying on with the conversation. “Your laird saddles up with Monk, the general helps your clan slay me and my son, and the MacKintosh takes my lands neat as a pin, is it?”\\n\\n “That’s our lands, Cameron! ”\\n\\n The laird forced a smile, never wavering in his attack. “ So the MacKintosh has said all these years. And his father, and his father’s father. ” Ewen’s feet were moving more quickly now. “But it matters not how many Cameron men your clan may kill” the laird dashed around to Allen ’— s side, momentarily confusing him—“you’ll never be able to take what is ours. ” In the split second that he had gained, the laird flicked Allen ’s sword from his hand.\\n\\n “You ’ve joined the redcoats,” Ewen shouted, as his opponent’s sword clattered across the craggy hillside, “and sullied your soul for naught! ”\\n\\n Allen bellowed, “My soul ’s not done yet, Cameron bastard! ” and charged Ewen, barreling him to the ground. Ewen ’s sword was flung from his hand as the men plunged backward, tumbling down a small ravine into a dry riverbed. They wrestled for dominance, ignoring the sharp stones and stinging nettles that had found purchase beside the dry bank.\\n\\n The MacKintosh clansman heaved his enormous weight and flung himself atop the laird, pummeling Ewen’s head into the rocks, briefly stunning him. Seizing his advantage, Allen braced Ewen ’s throat with his forearm and snatched a dagger from his belt, but they were too close and the laird struggling too violently for the man’s weapon to do more than graze flesh. Allen shifted his weight to better leverage his knife arm and, arching his back, separated the men just enough to strike a death blow.\\n\\n Ewen ’s vision dimmed as he labored for what small breaths of air he could. In that instant the laird’s fate flashed before him. Rage and a violent desire to survive boiled in him, and for less than the span of a heartbeat he saw his opponent as defenseless, torso and arm fully extended for the dagger thrust. It was in that desperate moment that Ewen struck. Grabbing Allen’s collar in his hand, Ewen pulled himself up, and using the only weapon left to him, sank his teeth into the MacKintosh kinsman ’s throat. \\n\\n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-45.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: Master of the Highlands (Highlands #1) \\n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \\n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\\n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
