{"id":93786,"no":48,"title":"Page 48","content":"\\n\\n “Lass?”\\n\\n “Hmm? Oh, sorry, did you say something?”\\n\\n “Och, I told you not to fret so. Now up you get, there ’s still work to be done and I’d do it while the lad sleeps. ” Kat rustled the overstuffed pocket of her green striped apron.\\n\\n “I’ve some sugar; I ’ll be needing to pack up his head tight. ”\\n\\n “Sugar?”\\n\\n “Aye, sugar, and what else?” Kat stared incredulously. “You don’t use sugar where you’re from?”\\n\\n “Are you sure that ’s an okay thing to do?”\\n\\n “’Tis the only thing to do. ” Kat shooed her off the bed. “The sugar halts the bleeding and keeps the wound clean. ”\\n\\n Lily had been relieved to find that, once cleaned up, the boy’s injuries weren ’t as dire as they had originally seemed. The alarming amount of blood aside, the gash on John’s head was shallow and only a few inches long, a small half-moon in his scalp echoing the lip of the tankard t hat struck him.\\n\\n Kat set to work drizzling spoonfuls of sugar into the gash and wrapping it tight with strips of linen. “A bhobain! ” the maid mumbled. “You wee rascal, I kent you ’d look trouble in the eye one of these days. But who’d figure that trouble would appear in a kirtle and petticoat? Och, that girl. ” She knotted the bandage emphatically and wiped her hands on her apron. “That girl! And to clout the lad on his head with a tappit hen? Losh! I kent from the start that girl wasn’t right. But she came round to curry favor with the Lochiel. He’d have nothing of her, aye? He ’s no time for the jillets who try to catch his eye with flattery and their sighs and pouts. But he saw how the lad took a notion to her so Ewen opened his doors. But give a beggar a be d and he ’ll pay you with a louse. Aye it’s true,” Kat responded to Lily’s widened eyes, “and that Rowena is a beggar if I ’ve seen a one. But what can’t be helped must be endured, and I did endure that lass and her mischief for long enough. ”\\n\\n John moaned and shifted in his sleep. “Och, I’m riling the lad. ” Kat gently pushed the hair away from his face. She whispered, “You sleep now, Johnnie, caidil gu math my darling. Sleep and I ’ll be here when you wake.”\\n\\n “Come lass, we ’ve things to discuss. ” The maid whisked her into the hallway. Lily began to follow dutifully behind, but what she had to say couldn’t wait. She grabbed the maid’s arm. “Kat”—Lily’s voice threatened to crack—“I ’ve made a total mess of things. ”\\n\\n Kat turned and studied her for a moment. “ Oh, you sweet, gypit girl. How’ve you made a mess? You saved the lad’s life is what you’ve done. And proud you should be. As I am. And as the laird will be when he hears tell of it. ”\\n\\n “But that’s just it, Kat. Ewen’s in trouble, and Robert too probably. Rowena said the MacKintosh man has fled the castle, and he’s surely on his way to find Ewen. MacKintosh wants him dead”—Lily felt her chin start to tremble—“if the redcoats don ’t get to him first. ” She vowed not to cry. The strangeness and intensity of her situation suddenly overwhelmed her. Lily took a deep breath to gather herself. “I just…what should I do, Kat?”\\n\\n “Lily,” Kat tsked, “you ’ve a stouter heart than this, aye? What you’ll do now is what you’ve been doing since you set foot in Tor Castle. ” Kat cradled Lily’s face in her calloused hands. “You’ll be the braw lass I ken you to be. You ’ll fight for those you love. As you did for John. And as you will for your Ewen. ” Kat tightened her grip and smiled. “Aye, lass, don’t look from me now. I ken that you love our laird. Just as he loves you. And love you he does. I can see it in his way, how he looks at you, speaks with you. Och, the man can be as stubborn as a mule but I ’ve kent him since he was a wee laddie and I can tell you true, Lily, I ’ve never seen it and never thought to see it, but you ’ve our Ewen ’s heart. ”\\n\\n “Thanks, Kat.” Lily beamed, and was filled with the feeling that she could conquer anything in her path. Redcoats or mysterious clan enemies, bring them on. “With the MacKintosh gone, ” she added, “you and John should be safest here. Now, I think I ’ve got me a laird to save. ”\\n\\n “Why, Mistress Rowena! ” Lennox swayed easily in the saddle, a look of befuddlement spreading across his worn face. “Is that you?”\\n\\n The stableman flung down his rusted pitchfork and it landed prong-first into the muck. Swinging his leg over the side of a disinterested old mare, he babbled cheerfully,\\n\\n “Miss Kat wanted that I should muck some of the larger bits into yon burn. So it can wash away like. The midden has got quite sour, aye?”\\n\\n He laughed knowingly, as if privy to some precious inside knowledge. “Lochiel himself says a feckful stench has been blowing in the windows. ”\\n\\n Rowena shot him a withering look. She had managed to roll onto her side, but had been unable to loosen her ties. Lennox warily approached her. “Just what are you about out here, mum?” Concern filled his voice. “Were you for another picnic, is it?”\\n\\n Confounded, he studied her. The front of her dress was sodden with filth, but her bound hands and feet remained obscured by her shredded clothing and the sludge that she had been rolling in. “Don ’t you know you’re in the middens, mum? You ’d best watch that the muck-fleas don’t get you. Them’s worse than midges. ”\\n\\n “Ist! ” Rowena struggled to release her wrists but only soiled herself further. She jeered, “You bloody tumfie, don’t stand there dumb. ” She flipped onto her belly and bucked her legs, revealing the bonds on her filthy calf. “Help me out of this! ”\\n\\n “Och, mum. ” Panicked, Lennox circled around Rowena ’s prostrate figure. He mumbled, “I cannot, mum.”\\n\\n “What?” she shrieked.\\n\\n Lennox cleared his throat, and his usual merriment was replaced by dread, which now paralyzed his features. He warbled uneasily, “But your legs, mum. ” He added in a whisper, “I can see your legs. It’s not proper like. ”\\n\\n “You ’ll be seeing the bottom of the loch if you don ’t get me untied, you worthless nit! ”\\n\\n “Aye, mum. ” Lennox scuttled quickly to Rowena’s side and began worrying the knot. “Yes, mum. ”\\n\\n Minutes had passed when the stableman hesitated. “The knot’s in a snarl, mum, I can ’t get it unstuck. ” He added hopefully, “But I might could unstick it with the prong of my dung fork.”\\n\\n “Don’t you dare touch me with that thing, ” Rowena hissed.\\n\\n “Haven’t you a knife, you imbecile? Get a bloody blade and cut me loose! Or,” she added in an ominously low voice, “I ’ll fell you like a lame horse. ”\\n\\n Obediently, Lennox knelt and removed a small dagger from his belt. “I ken it’s not of my concern, but who was it to tie you up so?” The stableman set to work shearing through her restraints, looking as if he would cry, so dismayed at the impropriety of handling Rowena ’s legs.\\n\\n “Don’t be fashed, mum,” he said weakly, “just a blink now and you ’ll be freed. ”\\n\\n He continued, “You should tell the laird, mum, and I ’ll wager he ’ll tan who ’s done this to you. Lochiel ’s a good man, he is, you’ll see. He ’ll not let this pass, aye? ”\\n\\n Rowena flailed her arms and legs free from the last of her bonds. Kicking herself away from Lennox, she spat, “You’re right, fool, it ’s not of your concern. ”\\n\\n She stood and spent a moment visibly collecting herself, then shook her arms and stomped her legs back to life. Gathering her skirts in her hands, Rowena slipped and stumbled away from Lennox toward the trees on the far edge of the loch.\\n\\n “Mum! ” he shouted, alarm in his voice. “Where ’re you off to? What should I tell the laird of you?”\\n\\n She sped into a run. “You can tell your cursed laird anything you like, you daft amadan ”.\\n\\n Halting at the forest’s edge, Rowena turned back to Lennox and shrilled, “Nay, tell him this. Tell your Lochiel to tread in fear. ” She cackled gleefully. “The MacKintosh comes even now to claim vengeance.”\\n\\n She spun, and disappeared into the woods.\\n\\n Chapter 29\\n\\n “Salve! Salve! ” Robert’s voice pierced the silence, startling Lily. She stopped and leaned down in the saddle, as if getting closer to the ground would improve her hearing. After the incident with John, she had abandoned the notion of taking a boat anywhere, frantic to find Ewen and his foster brother, and see with her own eyes that they were safe. And now she was hallucinating Robert ’s voice. In Latin, no less.\\n\\n She’d been riding for just over a mile now, carefully picking her way along the shores of Loch Linnhe. It was a rarely used route away from the keep, secluded by forested Lochaber land on one side and the glassy lake on the other. Lennox had been mysteriously absent from the stables, and she regretted her choice of mounts. The gray mare seemed docile and large enough for a smo oth gait—she’d vowed never again to sit one of the smaller ponies—but the old nag was plodding too slowly for Lily’s patience to bear. She strained to hear, the sounds of nature growing loud in her ears as she focused, the chirrup of birds, rustle of tree s in the breeze, and the gentle sloshing of the lake against the rocky muck of its shores. It had been a long day, but surely she was not yet fatigued enough to hallucinate Robert’s voice among them, no matter how badly she wished he were with her.\\n\\n “Haloo ! ” There it was again, clearer now, and definitely Robert. “Just here, Lily! ” She scanned the horizon and imagined every large shrub and small rock, all uniformly gray in the distance, to be Robert. Hope swelled in her chest. The burst of courage she had felt with Kat had started to waver with each lonely step, and she would have loved to have a friendly face with her as she traipsed through the countryside, alone and unarmed, into the lap of redcoats, a rival clan, and who knew what else. \\n\\n","sourceLink":"https://allnovel.net/master-of-the-highlands-highlands-1/page-48.html","bookId":1615,"book":{"id":1615,"title":"Master of the Highlands (Highlands #1)","description":"Storyline: Master of the Highlands (Highlands #1) \\n Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. \\n Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don\u0027t want her to go back to her own time. But with battles brewing, staying is a gamble.\\n","cover":"https://allnovel.net/images/master-of-the-highlands-highlands-1.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/master-of-the-highlands-highlands-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:03:10 PM"}}
