{"id":103761,"no":12,"title":"Page 12","content":"\n \"So they covered it all up. Hid it. Pretended they didn\u0027t fuck up the clones and that the clones got out and started eating people. Cause the clones were all fucked up!\" The old guy pointed to his head and then leaned close to the camera again. \"All fucked up in the head. And you know why?\"\n Eric and Pepe looked at each other then back at the TV.\n \"Aliens.\"\n \"I kinda knew he was going that way,\" Eric said.\n Pepe barked in agreement.\n \"They\u0027re making deals with the Amazonian queen. They want this planet. They want its resources. So by letting those clones out, they get what they want. And you know what I say?\" The old man leaned closer to the camera so only his mouth full of gnarled teeth was showing. At the top of his lungs, he shouted, \"Fuck you, aliens!\"\n Eric fell back against the bed and began to laugh.\n The old guy looked quite indignant and a cat sauntered past the camera and looked into it for a long moment, then walked on. Once the screen was clear of the cat, the old guy came into view sitting at his mish-mash of equipment.\n \"I\u0027m watching them, survivors. Oh, yeah. I’m watching them. I know what\u0027s going on. I can\u0027t keep broadcasting forever to you ‘cause they\u0027ll find me sooner or later, but I\u0027m telling you, I got my eye on them. Oh, yeah,\" he said reassuringly.\n Suddenly the lights in the bunker turned bright red as an alarm started to peal.\n \"Gawddamn, clones!\"\n The old guy sprang to his feet, ran to the camera, picked it up and ran back to his desk. Propping up the camera so it was filming what appeared to be a security monitor, the old guy\u0027s long dirty finger came into view as he pointed out what was happening.\n \"See, there come the clones again. Always coming up on the east side of my property. I\u0027m telling you, they know where I am. And they\u0027re sending their damn messed up clones.\"\n On the screen a bunch of the dead were pushing against a barbwire fence.\n \"Hate those guys,\" the old guy muttered as he pointed to each zombie individually on the monitor. \"All screwed up and spilling guts on my land.\"\n Though Eric couldn\u0027t see what he was doing, he could hear the old man typing away on a keyboard.\n To his amazement, on the monitor screen, what looked like some sort of robotic arm made out of farm equipment rose out of a haystack and opened fire on the zombies with an Uzi.\n \"Gawdamn clones,\" the old man was muttering angrily. \"Good thing I got my security system up before it all went to shit. And that is where they fucked us, didn\u0027t they? They didn\u0027t tell us they were out there. The clones. Doing what they do. They hid it ‘cause that\u0027s what they were supposed to do. But I knew! I knew!\"\n The camera continued to film the scene on the monitor as the robotic arm swept back and forth with the Uzi strafing anything standing outside the fence. In just a few short minutes, all the zombies were dead.\n \"Gotta go, kiddies. Gotta go put more ammo in the Uzi. Gotta keep alert. Don\u0027t let the government do nothing for ya. Don\u0027t go to those rescue shelters. Keep hiding. Stock up on food and ammo, cause boys and girls, them clones are doing the work of the Amazonian Queen and her alien overlords and we gotta be ready to fight back.\" The old guy swiveled the camera so his face filled the screen again. \"Calhoun, over and out.\"\n The screen switched to what looked like a cardboard box that had the words \"Truth is Here\" written in magic marker on it.\n Eric sat on the floor for a long moment then began to howl with laughter. He didn\u0027t stop for a long time.\n Chapter Thirteen\n An Unexpected Turn\n The hope that was born in Eric when he first made communication with what was being called \"the Fort\" in Ashley Oaks, Texas, grew each day that his surroundings remained zombie free. It was also a relief to talk to Peggy on the Internet. She was funny and warm in her chat and he felt comforted by the fact she was out there. When she told him the fort was actually talking to quite a few people that were holed up in their part of Texas, it was an enormous relief to know that pockets of humanity was still surviving. Even though the phones were down in the area of the fort, the cable was still working and Peggy explained they had a communication center up where they were talking to survivors over CBs and ham radios as well as the Internet.\n At one point, Peggy grouped all the survivors that still had access to the Internet into a chat room to explain what was going on at \"the fort\" and Eric was amazed to see twenty different people pop onto his list. After that, he never felt alone again as he chatted occasionally with the others. But mostly, he talked to Peggy. She was obviously the town gossip and had all the news about what was going on in the fort. She began to feel like an old friend as they chatted on and off during the day.\n \"You still free and clear over there,\" she asked one morning.\n \"Yeah, so far,\" Eric typed back. \"They\u0027re all still in the community center. I don\u0027t think they\u0027re getting out any time soon.\"\n \"That\u0027s good. When we come pick you up, we shouldn\u0027t have any major problem there. Some of the other survivors are surrounded and that ain\u0027t going to be an easy rescue,\" Peggy wrote back.\n Even though he had a renewed sense of hope, he felt overwhelmed at times with the loss of Brandy and his family. He would sit at Brandy’s grave while Pepe did his business and tell her how sorry he was. Sometimes, he could not even speak he was so overcome with emotion, but he knew in his heart that she was at peace now even if he was not.\n He kept trying to call his family, but no one ever answered at his sister or brother\u0027s place. The phone\u0027s busy signal at his parent\u0027s house told a sad story he did not want to consider for long. None of his friends wrote back and his email box remained empty. A few messages from old school chums were posted on his MySpace, but most of them were holed up and fighting to survive. The questions on the boards and chat rooms for survivors were the same.\n Was the army coming soon?\n How long before FEMA would open secure shelters?\n Was the government up and running?\n Was anyone getting updated news reports in their area?\n He watched Calhoun\u0027s regular broadcasts every night while eating dinner. The old guy always rambled on about clones, aliens and Amazons, but he was highly amusing. His instructional video on how to kill a zombie was fairly disgusting, but darkly humorous at the same time.\n \"Cutting off their arm does you no damn good if they got the other arm,\" Calhoun said at one point during the demonstration. He danced around a zombie caught in the barbed wire fence surrounding his property as chickens and a dog wandered past not seeming to notice the moaning, hungry zombie. \"See?\" Calhoun whacked off one arm with a machete and the zombie kept reaching with the other one. \"It still gots the other one to get ya. You gotta smack em in da damn head.\" With a deft whack of the machete, the zombie was no more.\n \"Public access was never this exciting back in the old days,\" Eric decided and looked down at Pepe who was still hell-bent on destroying the antique toy.\n The dog eyeballed him for a moment then went back to gnawing.\n The next day, Eric made sure to find a machete in the tool barn and rig a holster for it.\n Every day he took Pepe on a walk down the driveway. He was always sure that Pepe was calm and not bothered by their surroundings before they would start down the road that would take them to the accident site where Brandy had died. It bothered Eric to see the car, but at the same time, it was a good location to take a look at the community center through the binoculars.\n Despite the danger that he knew lurked near by, he was growing bolder. One day, he and Pepe rode down in the ATV to load up at the corner store on supplies. He had broken out the window with an ax he had taken with him and hurriedly grabbed things he needed. He had been terrified the entire time, but when no zombies ever appeared, he began to sincerely believe they were all trapped inside of the community center. Pepe had enjoyed riding on his lap and Eric made sure to gas up the ATV before returning it to where he had it parked under the window where the fire retardant slide was rigged.\n \"Travis and Katie are due back tomorrow with the guns,\" Eric said to Pepe one day as they took their walk. \"Peggy says they went to Ralph\u0027s store to get more ammunition and they are coming back tomorrow because Juan corralled all the zombies somehow so they can get in. That means we can get in soon, too.\"\n Pepe glanced up at him nonchalantly as he trotted along.\n Speaking of the people he would soon meet was reassuring and made him feel less alone. \"Peggy says this girl named Jenni got all the zombies to move to one spot on the road and they dropped containers down to make this t-shaped corral so Travis and Katie can drive in safely on the other side of the containers.\" Eric paused, trying to imagine this in his mind. \"Not quite sure how that works, but sounds interesting.\"\n The names came easily to him. He imagined faces behind the names and wondered what it would feel like to be a part of that community. Peggy seemed positive that once the zombies were cleared out around the fort someone would come out to get him and Pepe. Speaking to her each day gave him a sense of community. Though the conditions did not sound as nice as the farmhouse, they sounded much safer and he was more than willing to rough it to be part of the fort. Besides, Peggy said there was a massive old-fashioned hotel to one side of the fort they were planning on occupying in the near future. \n","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-1/page-12.html","bookId":2484,"book":{"id":2484,"title":"As the World Dies: Untold Tales Volume 1","description":"Storyline: \n THE FIRST DAYS: AS THE WORLD DIES introduced Jenni and Katie and their harrowing journey to the makeshift fort in the Texas Hill Country. But theirs is not the only tale to be told. In the first volume of the AS THE WORLD DIES UNTOLD TALES experience three terrifying tales of those who are forced to face the unrelenting and hungry walking dead. \n Deep in the Texas Hill Country, a man and his little dog takes refuge in a bed and breakfast located in the hills above a doomed town where an infested rescue center might unleash the hungry undead… \n On a deserted highway slicing through the desolation of West Texas, a woman struggles to survive as she faces the horrifying aftermath of the rise of the zombies… \n And finally, discover what happens on the first day to Katie’s beloved wife, Lydia, as the world dies…\n \n","cover":"https://allnovel.net/images/as-the-world-dies-untold-tales-volume-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/as-the-world-dies-untold-tales-volume-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:30:31 PM"}}
