{"id":103755,"no":6,"title":"Page 6","content":"\\n\\n He pulled the door open and Pepe rushed down the stairs again.\\n\\n \"Dammit, Pepe,\" Eric exclaimed and hurried after the dog. If anything happened to his little companion, it would devastate him. But Pepe was fearless and that terrified him. He would have to keep a leash on him at all times.\\n\\n Pepe had stopped on a step above the window and was barking down at the dead solider still systematically banging its head against the now broken window. The pane had shattered in the corner and only a few large pieces had fallen out of the frame. The rest of the window was still intact. The pale dead eye of the solider fastened on Eric and it began an ungodly howl.\\n\\n \"Crap,\" Eric muttered and scooted down the stairs, hugging the wall to keep far away from the bloodied creature. He had nothing to fear since it had no arms, but he just didn’t want to even get near it.\\n\\n He ran down the hallway of the slowly darkening farmhouse, feeling lightheaded and a little sick. He hadn\u0027t eaten all day and his brain was foggy and his body sluggish. As soon as he dealt with the creature outside, he would need to eat something and get his wits about him.\\n\\n The kitchen was dark and foreboding when he entered. The warmth and beauty of the room was now lost as the late afternoon shadows filled it. Swallowing hard once more, he glanced toward the back door and saw it was firmly shut with the locks engaged. Hoisting the poker up in one hand he slowly approached the closed door of the large pantry. Was there a window to the outside in there? He hadn\u0027t noticed before. What if something was in there waiting for him?\\n\\n Pepe skittered into the kitchen and rushed up to the pantry and waited for him expectantly.\\n\\n \"Anyone in there, boy,\" he asked the dog.\\n\\n The dog yawned in response.\\n\\n \"Okay, I\u0027m trusting you on this,\" Eric said.\\n\\n He took a deep breath and whipped the pantry door open. It was filled with darkness and the dim light from the kitchen barely made a dent. With a trembling hand, he fumbled for the light switch and quickly flipped it on. Light flooded the pantry and revealed its many shelves nicely stocked, no window to the outside, and a huge case of diet cokes on the floor.\\n\\n With a little bark, Pepe darted in and began to chew at the bottom of a bag of dog food resting under a bottom shelf.\\n\\n \"In a moment, Pepe,\" Eric told him.\\n\\n Reaching up, he fumbled for the shotgun Mrs. Waskom had shown him and drew it down. It felt odd in his hands and he took a deep breath. Breaking open the action of the shotgun, he checked the breach of the barrels to make sure the weapon was loaded. To his relief, it was. Snapping the action back into place, he took another shivering breath and tried to steady his nerves. A trickle of sweat slid down his nose and he brushed it away then pushed his glassed back up his nose.\\n\\n \"Okay, Pepe, you stay here and eat. I\u0027ll go kill the zombie,\" Eric said to the dog.\\n\\n He stepped out of the pantry and meant to lock Pepe in it, but the little dog went running past him and down the hall. Within seconds he heard Pepe barking again at the zombie. He quickly followed, holding the shotgun tightly in his moist hands.\\n\\n \"You can do this,\" he said to himself. \"You can do this.\"\\n\\n His thumb played lightly with the safety catch as he moved toward the front door. He could see Pepe back on the stairs barking at the zombie angrily. He would step out, shoot the zombie to kill it, then head back inside to start boarding up the windows. It was a simple plan. It was an easy plan.\\n\\n The steady pounding of the zombie\u0027s forehead against the window assured him it hadn\u0027t moved. As a precaution, Eric looked out another window and scanned the front yard and porch. There was no sign of any other undead creatures.\\n\\n \"Okay, Pepe, you keep him distracted and I\u0027m going to shoot him,\" Eric said to the dog.\\n\\n Unlocking the door, he gulped hard and tried to steady his nerves. The sound of the zombie banging against the window ended abruptly and Pepe scampered down the stairs.\\n\\n \"Shit!\" Eric wrenched the door open and stepped outside in one swift motion.\\n\\n The zombie was staggering toward him. An eerie howl rose from its throat and it\u0027s tongue lolled in its open mouth.\\n\\n Pepe hustled his little body over to the zombie and grabbed the shoelaces of its combat boot and began to try and wrestle it as Eric fought the instinct to just run. He raised the shotgun with trembling hands and fired. The recoil sent him stumbling backwards a few feet.\\n\\n The buckshot hit the zombie\u0027s bare chest and it jerked back for a moment, then continued toward Eric determinedly. Pepe\u0027s growls distracted Eric for a moment as he tried to figure out what he had done wrong. The zombie was closing in and Eric raised the shotgun again, prepared himself for the recoil, and fired.\\n\\n This time the buckshot ripped through the thing\u0027s neck and the lower half of its face. The zombie kept coming.\\n\\n \"Oh, God,\" Eric prayed and tried to fire again.\\n\\n The shotgun clicked empty.\\n\\n He hadn\u0027t brought any more shells with him.\\n\\n \"Oh, crap,” he exclaimed.\\n\\n Pepe suddenly cried out in pain and Eric\u0027s gaze dropped quickly to the little guy. The zombie\u0027s foot had caught one of Pepe\u0027s paws and the little dog darted back, favoring its front leg.\\n\\n The zombie walked straight into the end of the shotgun and snapped its bloodied teeth at Eric. Acting on instinct, Eric shoved it hard into the creature’s mouth and pushed the creature back away from him. The zombie staggered back, struggling to keep its balance, but it had no arms to steady itself and it toppled over onto the porch.\\n\\n \"Pepe, back!\" Eric ordered the dog and to his surprise the little dog stopped in mid-attack on the zombie\u0027s shoelaces.\\n\\n Grabbing up a heavy iron chair, Eric approached the zombie that was wildly thrashing, trying to get back up onto its feet. Grimacing, Eric tried hard not to look at its battered flesh as he brought the chair leg down hard on the creature’s head. There was a sickening sucking sound as the metal leg sank through one eye socket and into the zombie\u0027s head. Pushing down hard, Eric felt bone and brain matter give way as the metal sank all the way down into the thing\u0027s skull. The body spasmed a few times then was quiet.\\n\\n Eric staggered back from the dead solider, gasping for air, and collapsed onto the porch. Pepe sauntered over Eric looking quite satisfied with the whole situation. He wiggled onto Eric\u0027s lap and gave him a few licks with his pink tongue. His owner, overwhelmed at what had just happened, kept staring at the zombie\u0027s still form.\\n\\n \"It\u0027s really happening,\" he said finally.\\n\\n Pepe looked at him with an exasperated look then skipped off back into the house to make a run at the pantry and the dog food.\\n\\n Eric slowly climbed to his feet and looked around. There was no one else in sight and the clouds overhead looked ominous. He had maybe two hours of light left and he realized he needed to do some serious planning. His eyes slowly swept over the farmhouse and he realized he had completely overlooked the old fashioned storm shutters locked in place next to all the windows.\\n\\n Excited at the discovery, he quickly moved to slam the shutters closed over the broken window and slid the securing bar into place.\\n\\n \"Freaking perfect!\"\\n\\n Deciding to hurry while he had no unwanted visitors, he closed the front door then ran around the bottom floor of the house closing all the shutters and securing them firmly. He wasn\u0027t too sure if zombies would figure out how to open them, but it would take some work for them to do so and he would hear them. Keeping a sharp eye on his surroundings, he made his way around the house. His heart was thumping so hard in his chest, it hurt, but it felt good to be actually doing something productive.\\n\\n Once the windows were all secured, he slipped back into the house and locked the door once more. The power was still on, which he hoped was a good sign, and he flipped lights on as he went to the kitchen. The house was very dark with all the windows shuttered and the gloom was a little frightening, but he knew the house was now secure.\\n\\n He exhaled slowly with relief and moved to the pantry. Pepe was still in the pantry eating out of the torn bottom of the dog food bag and Eric snagged the box of shotgun shells off the top shelf. Pepe barely acknowledged him and kept eating.\\n\\n After loading the gun, Eric laid it on the counter and took several deep breaths. He needed to eat. He was dizzy. He found a loaf of multi-grain bread in the breadbox; old fashioned peanut butter swimming in oil in the pantry and homemade strawberry preserves in the fridge. He could not make his sandwiches fast enough and he ate them down with desperate bites. He put a bowl of water down for Pepe and gulped milk directly from the jug.\\n\\n When the phone rang, he jumped and almost choked on his sandwich. He chewed quickly and swallowed then grabbed the phone off the hook.\\n\\n \"Hello?\"\\n\\n \"Who\u0027s this,\" a gruff voice said. \"Where is Mrs. Waskom?\"\\n\\n \"Fort Hood. She went to be with her husband. I\u0027m one of the guests. Who\u0027s this?\"\\n\\n \"Sheriff Davis. I am trying to account for all the people not down here at the shelter.\"\\n\\n \"The shelter?\" Eric swallowed down more milk to clear his throat.\\n\\n \"Yes, the shelter. We\u0027re at the community center. You should get down here as soon as possible. We got a doctor here to treat the wounded and we\u0027re armed and ready to stand until the army gets here.\" \\n\\n","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-1/page-6.html","bookId":2484,"book":{"id":2484,"title":"As the World Dies: Untold Tales Volume 1","description":"Storyline: THE FIRST DAYS: AS THE WORLD DIES introduced Jenni and Katie and their harrowing journey to the makeshift fort in the Texas Hill Country. But theirs is not the only tale to be told. In the first volume of the AS THE WORLD DIES UNTOLD TALES experience three terrifying tales of those who are forced to face the unrelenting and hungry walking dead. \\n Deep in the Texas Hill Country, a man and his little dog takes refuge in a bed and breakfast located in the hills above a doomed town where an infested rescue center might unleash the hungry undead… \\n On a deserted highway slicing through the desolation of West Texas, a woman struggles to survive as she faces the horrifying aftermath of the rise of the zombies… \\n And finally, discover what happens on the first day to Katie’s beloved wife, Lydia, as the world dies…\\n","cover":"https://allnovel.net/images/as-the-world-dies-untold-tales-volume-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/as-the-world-dies-untold-tales-volume-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:30:31 PM"}}
