{"id":76927,"no":24,"title":"Page 24","content":"“What would you like to know?” Catherine asked.\n “When did you first learn that you needed spectacles?”\n “I was five or six. My parents and I lived in Holborn, in a tenement at Portpool Lane. Since girls couldn’t go to school at the time, a local woman tried to teach a few of us. She told my mother that I was very good at memorization, but I was slow-witted when it came to reading and writing. One day my mother sent me on an errand to fetch a parcel from the butcher. It was only two streets away, but I got lost. Everything was a blur. I was found wandering and crying a few streets away, until finally someone led me to the butcher’s shop.” A smile curved her lips. “What a kind man he was. When I told him I didn’t think I could find my way home, he said he had an idea. And he had me try on his wife’s spectacles. I couldn’t believe how the world looked. Magical. I could see the pattern of bricks on walls, and birds in the air, and even the weave of the butcher’s apron. That was my problem, he said. I just hadn’t been able to see. And ever since then I’ve worn spectacles.”\n “Were your parents relieved to discover their daughter wasn’t slow-witted after all?”\n “Quite the opposite. They argued for days about which side of the family my weak eyes had come from. My mother was quite distressed, as she said spectacles would mar my appearance.”\n “What rot.”\n She looked rueful. “My mother did not possess what one would call a great depth of character.”\n “In light of her actions—abandoning a husband and son, running to England with her lover—I wouldn’t have expected a surfeit of principles.”\n “I thought they were married, when I was a child,” she said.\n “Was there love between them?”\n Considering that, she chewed her lower lip, drawing his attention to the enticing softness of her mouth. “They were attracted to each other in a physical sense,” she admitted. “But that’s not love, is it?”\n “No,” he said softly. “What happened to your father?”\n “I’d rather not discuss that.”\n “After all I’ve confided in you?” He gave her a chiding glance. “Be fair, Marks. It can’t be any more difficult for you than it was for me.”\n “All right.” Catherine took a deep breath. “When my mother fell ill, my father felt it as a great burden. He paid a woman to look after her until the end, and sent me away to live with my aunt and grandmother, and I never heard from him again. He may be dead, for all I know.”\n “I’m sorry,” Leo said. And he was. Genuinely sorry, wishing he could somehow have gone back in time to comfort a small girl in spectacles, who had been abandoned by the man who should have protected her. “Not all men are like that,” he felt the need to point out.\n “I know. It would hardly be fair of me to blame the entire male population for my father’s sins.”\n Leo became uncomfortably aware that his own behavior hadn’t been any better than her father’s, that he had indulged in his own bitter grief to the point of abandoning his sisters. “No wonder you’ve always hated me,” he said. “I must remind you of him. I deserted my sisters when they needed me.”\n Catherine gave him a clear-eyed stare, not pitying, not censorious, just … appraising. “No,” she said sincerely. “You’re not at all like him. You came back to your family. You’ve worked for them, cared for them. And I’ve never hated you.”\n Leo stared at her closely, more than a little surprised by the revelation. “You haven’t?”\n “No. In fact—” She broke off abruptly.\n “In fact?” Leo prompted. “What were you going to say?”\n “Nothing.”\n “You were. Something along the lines of liking me against your will.”\n “Certainly not,” Catherine said primly, but Leo saw the twitch of a smile at her lips.\n “Irresistibly attracted by my dashing good looks?” he suggested. “My fascinating conversation?”\n “No, and no.”\n “Seduced by my brooding glances?” He accompanied this with a waggish swerving of his brows that finally reduced her to laughter.\n “Yes, it must have been those.”\n Settling back against the pillows, Leo regarded her with satisfaction.\n What a wonderful laugh she had, light and throaty, as if she had been drinking champagne.\n And what a problem this could become, this madly inappropriate desire for her. She was becoming real to him, dimensional, vulnerable in ways he had never imagined.\n As Catherine read aloud, the ferret emerged from beneath the dresser and climbed onto her lap. He fell asleep in an upside-down circle, his mouth open. Leo didn’t blame Dodger in the slightest. Catherine’s lap looked like a lovely place to rest one’s head.\n Leo feigned interest in the complex and detailed narrative, while his mind occupied itself with the question of what she would look like naked. It seemed tragic that he would never see her so. But even by Leo’s dilapidated code of ethics, a man did not take a virgin unless he had serious intentions. He had tried it once, letting himself fall madly in love, nearly losing everything as a result.\n And there were some risks a man couldn’t take twice.\n Chapter Ten\n It was past midnight. Catherine woke to the sound of a baby’s whimpering. Little Rye was teething, and the usually sweet-natured cherub had been fretful of late. \n","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-24.html","bookId":1784,"book":{"id":1784,"title":"Married By Morning (The Hathaways #4)","description":"Storyline: \n He is everything she wants to avoid... \n For two years, Catherine Marks has been a paid companion to the Hathaway sisters—a pleasant position, with one caveat. Her charges\u0027 older brother, Leo Hathaway, is thoroughly exasperating. Cat can hardly believe that their constant arguing could mask a mutual attraction. But when one quarrel ends in a sudden kiss, Cat is shocked at her powerful response—and even more so when Leo proposes a dangerous liaison. \n She is not at all what she seems... \n Leo must marry and produce an heir within a year to save his family home. Catherine\u0027s respectable demeanor hides a secret that would utterly destroy her. But to Leo, Cat is intriguing and infernally tempting, even to a man resolved never to love again. The danger Cat tried to outrun is about to separate them forever—unless two wary lovers can find a way to banish the shadows and give in to their desires...\n \n","cover":"https://allnovel.net/images/married-by-morning-the-hathaways-4.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/married-by-morning-the-hathaways-4.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:51 AM"}}
