{"id":76964,"no":63,"title":"Page 63","content":"“I’m not sleepy,” she whispered, and he grinned. “Neither am I.” Taking her hand, he drew her out of the room. “Now about those buttons…” Chapter Twenty-three In the morning, Catherine was awakened by a maid who lit a fire in the grate and brought breakfast. One of the joys of staying at the Rutledge was the delicious food prepared by the talented Chef Broussard. Catherine sighed in enjoyment as she saw the contents of the tray: tea, fresh eggs coddled in cream and sided with pistolettes, small oval-shaped rolls, and a dish of ripe berries. “There was a note under the door, miss,” the maid said. “I put it on the side of the tray.” “Thank you.” Picking up the small sealed card, Catherine felt a twinge of pleasure when she saw her name written in Leo’s unmistakable style, the neat, semi-joined italic of a trained architect. “Ring when you’re finished with the tray, miss, and I’ll run up to get it. And if you need help dressing or arranging your hair, I’m a fair hand at that too.” Catherine waited until the maid had left before opening the note. Mysterious outing planned for this morning. Be ready at ten o’clock sharp. Wear walking shoes. —R A smile broke out on Catherine’s face. “Mysterious outing,” she said, watching as Dodger hoisted himself up on the bed, his tiny nose working appreciatively as he detected food nearby. “What could he be planning? No, Dodger, don’t even think of disturbing my breakfast. You’ll have to wait till I’m done. I draw the line at sharing a plate with you.” Seeming to understand her stern tone, Dodger stretched and rolled slowly, completing three revolutions across the mattress. “And don’t expect this to be a permanent arrangement,” Catherine added, stirring sugar in her tea. “I’m only taking care of you until you go back to Beatrix.” She was so hungry that she ate every morsel on her plate, except for the small portion she reserved for the ferret. The eggs were perfect, the steaming yellow centers perfect for dipping the crisp pistolette crusts. When she was done, she spooned a coddled egg into a saucer for Dodge, placed a few berries on the side, and went to set it on the floor for him. Happily Dodger circled her, paused for a petting, and went to devour his food. Catherine had just finished washing and brushing out her hair when there came a knock at the door. It was Poppy, accompanied by the housemaid she had seen earlier. Poppy was carrying at least three dresses draped across her arms, while the maid held a large basket filled with what appeared to ladies’ linens, stockings, gloves, and other fripperies. “Good morning,” Poppy said cheerfully, coming in to lay the gown across the bed. Glancing at the ferret eating in the corner, she shook her head and grinned. “Hello, Dodger.” “Are all those things for me?” Catherine asked. “I don’t need so much, truly—” “I’m forcing it on you,” Poppy informed her, “so don’t dare try to give anything back. I’ve included a few new underthings from the dressmaker, and a ‘reform’ corset—do you remember when we saw them displayed at the ladies’ outfitter stand at the Great Exhibition?” “Of course.” Catherine smiled. “Impossible to forget a collection of women’s private garments being hung out for all the world to view.” “Well, there was a good reason why Madame Caplin won the prize medal at the exhibition. The Caplin corsets are much lighter than the usual ones, and they don’t have nearly as many poky, pointy stays, and the whole thing adjusts to the body rather than molding you into an uncomfortable shape. Harry told the hotel housekeeper, Mrs. Pennywhistle, that any of the maids who wished to wear one could charge it to the Rutledge.” Catherine’s brows lifted. “Truly?” “Yes, because it allows them so much more freedom of movement. And you can breathe.” Poppy lifted a pale seafoam-green dress from the bed and showed it to her. “You must wear this today. I’m sure it will fit you—we’re the same height, only you’re slimmer, and I have to tight-lace to fit into it.” “You are too generous, Poppy.” “Nonsense, we’re sisters.” She sent Catherine an affectionate glance. “Whether or not you marry Leo, we’ll always be sisters. Leo told me about your outing at ten o’clock. Did he tell you where you’re going?” “No, did he tell you?” “Yes.” Poppy grinned. “Where is it?” “I’ll let him surprise you. However, I will say that the expedition has my—and Harry’s—full approval.” After the combined efforts of Poppy and the maid, Catherine was dressed in a pale seafoam gown, neither blue nor green but some perfect shade between the two. The bodice was close-fitting, stylishly cut without a waist seam, the skirts plain until the knee, where they draped in rows of flounces. The matching jacket, tailored to the waist, was trimmed with silk fringe in interwoven shades of blue, green, and silver-gray. A small, flirtatious hat was set on the upsweep of her hair, which had been done in a waterfall chignon with the ends tucked up and pinned beneath. To Catherine, who had gone so long without wearing anything pretty or modish, the effect was disconcerting. She saw a stylishly turned-out woman in the looking glass, decidedly feminine and dashing. “Oh, miss, you’re as pretty as the girls they paint on tins of sweets,” the housemaid exclaimed.","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-63.html","bookId":1784,"book":{"id":1784,"title":"Married By Morning (The Hathaways #4)","description":"Storyline: He is everything she wants to avoid... For two years, Catherine Marks has been a paid companion to the Hathaway sisters—a pleasant position, with one caveat. Her charges\u0027 older brother, Leo Hathaway, is thoroughly exasperating. Cat can hardly believe that their constant arguing could mask a mutual attraction. But when one quarrel ends in a sudden kiss, Cat is shocked at her powerful response—and even more so when Leo proposes a dangerous liaison. She is not at all what she seems... Leo must marry and produce an heir within a year to save his family home. Catherine\u0027s respectable demeanor hides a secret that would utterly destroy her. But to Leo, Cat is intriguing and infernally tempting, even to a man resolved never to love again. The danger Cat tried to outrun is about to separate them forever—unless two wary lovers can find a way to banish the shadows and give in to their desires...","cover":"https://allnovel.net/images/married-by-morning-the-hathaways-4.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/married-by-morning-the-hathaways-4.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:51 AM"}}
