{"id":76974,"no":73,"title":"Page 73","content":"His mouth glided across the vulnerable softness of her groin to her inner thighs, his tongue playing gently on either side … everywhere except the wet pulsing center.\n “Leo,” she panted. “This … is not very nice of you.”\n “I know,” he said. “Move your legs apart.”\n She obeyed with a shudder, letting him guide her, opening her body in ever more revealing positions. He used his mouth in ways that infuriated and aroused her … nibbling along her thigh, investigating the ticklish hollows behind her knees, stringing kisses around her ankles, sucking lazily on her toes. She swallowed back a supplicating moan, and another, impatience thumping through her body.\n After an eternity, Leo had finally progressed all the way back to her neck. Catherine parted her thighs, dying for him to take her, but instead he rolled her to her stomach. She whimpered in frustration.\n “Impatient wench.” Leo’s hand smoothed over her bottom and slipped between her thighs. “There, will this satisfy you for now?” She felt him parting her swollen flesh. Her body stiffened in bliss as his fingers entered her, slipping into the wetness. He held them there, deep and flexing, while he kissed along her spine. She found herself grinding against his hand, gasping in pleasure. Closer … closer … and yet the cl**ax shimmered just out of reach.\n Finally Leo turned her to her back again, his features hard and sweat-misted, and it was only then that she realized he had been torturing himself as well as her. He pinned her arms over her head and spread her legs. For an instant she knew a flare of panic at her own helplessness, seeing his powerful body above hers. But then he entered her in a hard, slick plunge, and the fear vanished in a flood of pleasure. He slipped his free arm beneath her neck. Her eyes closed, and her head lolled as he bent to kiss her throat.\n She was nothing but feeling, heat coming through her in waves, stronger and stronger as he took her with slow, luscious drives. He rolled his h*ps with each forward pitch, repeating the movement until she went crimson and whimpered in a last burst of release. And he stayed with her, riding every drawn-out spasm until she was limp and quiet. Murmuring to her, he coaxed her to wrap one leg around his waist, and he lifted her other leg until it hooked over his shoulder. The position opened her, changed the angle between them, so that when he thrust again, it caressed a new place inside her. Another rush of pleasure started, surging so high and fast that she could hardly breathe. She lay still beneath him, her legs trembling as she took him more deeply than she had thought possible. She was propelled into another cl**ax, strong and dizzying, but before the last tremors had faded, he withdrew abruptly to take his own release, his sex throbbing viciously against her stomach.\n “Oh, Cat,” he said after a while, still over her, his hands gripped in the bedclothes.\n She turned her face until her lips brushed the rim of his ear. The erotic perfume of sex and damp skin filled her nostrils. Her palm went to his back, smoothing over the taut surface, and she felt him shiver in pleasure at the gentle scratch of her nails. How remarkable it was to lie with a man, feeling him soften inside her as their pulses slowed. What an astonishing assimilation of flesh and moisture and sensation, the lingering twinges and pulses in the places they pressed together.\n Leo lifted his head and looked down at her. “Marks,” he said, his voice uneven, “you are not a perfect woman.”\n “I’m aware of that,” she said.\n “You have an evil temper, you’re as blind as a mole, you’re a deplorable poet, and frankly, your French accent could use some work.” Supporting himself on his elbows, Leo took her face in his hands. “But when I put those things together with the rest of you, it makes you into the most perfectly imperfect woman I’ve ever known.”\n Absurdly pleased, she smiled up into his face.\n “You are beautiful beyond words,” Leo went on. “You are kind, amusing, and passionate. You also have a keen intellect, but I’m willing to overlook that.”\n Her smile faded. “Are you leading to another marriage proposal?”\n His gaze was intent. “I have a special license from the Archbishop’s Court of Faculties. We could wed at any church, whenever we please. We could be married by morning, if you say yes.”\n Catherine turned her face away from his, pressing a frown into the mattress. She owed him an answer—she owed him honesty. “I’m not certain I’ll ever be able to say yes to that.”\n Leo was very still. “Do you mean only when I propose, or if any man did?”\n “Any man,” she admitted. “It’s only that with you, it’s very difficult to refuse.”\n “Well, that’s encouraging,” he said, although his tone conveyed the opposite.\n Leo left the bed and went to get a damp cloth for her. Returning, he stood beside the bed and watched her. “Think of it this way,” he said. “Marriage would change hardly anything between us, except that we would end our arguments in a much more satisfying way. And of course I would have extensive legal rights over your body, your property, and all your individual freedoms, but I don’t see what’s so alarming about that.”\n His quip almost made Catherine smile again, despite her encroaching despair. Finishing her ablutions, she set the cloth on the bedside table and pulled the bed linens up to her br**sts. “I wish people were like the clocks and mechanisms that Harry is so clever at constructing. Then I could have whatever is wrong with me repaired. As it is, though, I have some parts that aren’t working properly.” \n","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-73.html","bookId":1784,"book":{"id":1784,"title":"Married By Morning (The Hathaways #4)","description":"Storyline: \n He is everything she wants to avoid... \n For two years, Catherine Marks has been a paid companion to the Hathaway sisters—a pleasant position, with one caveat. Her charges\u0027 older brother, Leo Hathaway, is thoroughly exasperating. Cat can hardly believe that their constant arguing could mask a mutual attraction. But when one quarrel ends in a sudden kiss, Cat is shocked at her powerful response—and even more so when Leo proposes a dangerous liaison. \n She is not at all what she seems... \n Leo must marry and produce an heir within a year to save his family home. Catherine\u0027s respectable demeanor hides a secret that would utterly destroy her. But to Leo, Cat is intriguing and infernally tempting, even to a man resolved never to love again. The danger Cat tried to outrun is about to separate them forever—unless two wary lovers can find a way to banish the shadows and give in to their desires...\n \n","cover":"https://allnovel.net/images/married-by-morning-the-hathaways-4.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/married-by-morning-the-hathaways-4.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:51 AM"}}
