{"id":76492,"no":8,"title":"Page 8","content":"“Why did she go into service, if she had no need of money?” Harry shrugged. “She wanted to experience what a family was like, if only as an outsider. Cat believes she’ll never have a family of her own.” Leo’s brows drew together as he tried to make sense of that. “Nothing is stopping her,” he pointed out. “You think not?” A hint of mockery varnished Harry’s hard green eyes. “You Hathaways would find it impossible to understand what it’s like to be brought up in isolation, by people who don’t give a damn about you. You have no choice but to assume it’s your fault, that you’re unlovable. And that feeling wraps around you until it becomes a prison, and you find yourself barricading the doors against anyone who wants to come in.” Leo listened intently, perceiving that Harry was talking about himself as well as Catherine. Silently he acknowledged that Harry was right: even in the worst despair of Leo’s life, he had always known that his family loved him. For the first time he understood fully what Poppy had done for Harry, how she had broken through the invisible prison he had described. “Thank you,” Leo said quietly. “I know it wasn’t easy for you to talk about this.” “Certainly.” And in absolute seriousness, Harry murmured, “One thing I should make clear, Ramsay: If you hurt Cat in any way, I will have to kill you.” Dressed in her nightgown, Poppy sat in bed with a novel. She heard someone enter the elegantly appointed private apartments, and she looked up with a smile as her husband came into the room. Her pulse quickened pleasurably at the sight of him, so dark and graceful. Harry was an enigmatic man, dangerous even in the view of those who professed to know him well. But with Poppy, he relaxed and showed his gentle side. “Did you talk with Leo?” she asked. “Yes, love.” Harry shrugged out of his coat, draped it over the back of a chair, and approached the bedside. “He wanted to discuss Cat, as I expected. I told him as much about her past—and mine—as I could.” “What do you make of the situation?” Poppy knew that Harry was brilliant at discerning other people’s thoughts and motives. Harry untied his cravat, letting it hang on either side of his neck. “Ramsay is more concerned for Cat than he’d like to be, that’s clear. And I don’t like it. But I won’t interfere unless Cat asks for help.” He reached down to the exposed line of her throat, drawing the backs of his fingers over her skin with a sensitive lightness that caused her breath to quicken. His fingertips rested on the rapid tattoo of her pulse, and caressed softly. Watching a delicate tide of pink rise in her face, he said in a low voice, “Put the book aside.” Poppy’s toes curled beneath the bed linens. “But I’ve reached a very interesting part,” she said demurely, teasing him. “Not half so interesting as what’s about to happen to you.” Drawing the covers back with a deliberate sweep that left her gasping, Harry lowered his body over hers … and the book dropped to the floor, forgotten. Chapter Four Catherine hoped that Leo, Lord Ramsay, would stay away from Hampshire for a good long while. Perhaps if enough time passed, they would be able to pretend the kiss in the garden had never happened. But in the meantime, she couldn’t help but wonder … why had he done it? Most likely he had merely been amusing himself with her, finding a new way to set her off balance. If life were at all fair, she thought dourly, Leo would have been pudgy, pockmarked, and bald. But he was a handsome man with a strapping six-foot build. He had dark hair and light blue eyes and a dazzling smile. The worst part was that Leo didn’t look at all like the rogue he was. He looked wholesome and clean and honorable, the nicest gentleman one could ever hope to meet. The illusion was dispelled as soon as he opened his mouth. Leo was a thoroughly wicked man, articulate in all circumstances. His irreverence spared no one, least of all himself. In the year since they had first met, he had exhibited nearly every objectionable quality a man could possess, and any attempt to correct him only made him worse. Especially if that attempt had been made by Catherine. Leo was a man with a past, and he didn’t even have the decency to try and hide it. He was frank about his dissolute history, the drinking and skirt-chasing and brawling, the self-destructive behavior that had nearly brought catastrophe to the Hathaway family on more than one occasion. One could only conclude that he liked being a scoundrel, or at least being known as one. He played the part of jaded aristocrat to perfection, his eyes glinting with the cynicism of a man who, at the age of thirty, had managed to outlive himself. Catherine wanted nothing to do with any man, least of all one who radiated such dangerous charm. One could never trust such a man. His darkest days might still be ahead of him. And if not … it was entirely possible that hers were. Approximately a week after Leo had left Hampshire, Catherine spent an afternoon outside with Beatrix. Unfortunately these outings were never the kind of well-regulated walk that Catherine preferred. Beatrix didn’t walk, she explored. She liked to go deep into the forest, investigating flora, fungi, nests, webs, and holes in the ground. Nothing delighted the youngest Hathaway so much as the discovery of a black newt, a lizard’s nest, or a rabbit warren, or the tracking of badgers’ marks. Injured creatures were caught, rehabilitated, and set free, or if they could not fend for themselves, they became part of the Hathaway household. And the family had become so accustomed to Beatrix’s animals that no one so much as batted an eye when a hedgehog waddled through the parlor or a pair of rabbits hopped past the dinner table.","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-8.html","bookId":1784,"book":{"id":1784,"title":"Married By Morning (The Hathaways #4)","description":"Storyline: He is everything she wants to avoid... For two years, Catherine Marks has been a paid companion to the Hathaway sisters—a pleasant position, with one caveat. Her charges\u0027 older brother, Leo Hathaway, is thoroughly exasperating. Cat can hardly believe that their constant arguing could mask a mutual attraction. But when one quarrel ends in a sudden kiss, Cat is shocked at her powerful response—and even more so when Leo proposes a dangerous liaison. She is not at all what she seems... Leo must marry and produce an heir within a year to save his family home. Catherine\u0027s respectable demeanor hides a secret that would utterly destroy her. But to Leo, Cat is intriguing and infernally tempting, even to a man resolved never to love again. The danger Cat tried to outrun is about to separate them forever—unless two wary lovers can find a way to banish the shadows and give in to their desires...","cover":"https://allnovel.net/images/married-by-morning-the-hathaways-4.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/married-by-morning-the-hathaways-4.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:51 AM"}}
