{"id":76989,"no":89,"title":"Page 89","content":"“We’ll be finished soon,” Leo called back to her, scowling. “Go back to bed.”\\n\\n The prostitute continued to lean out. “What are you doin’ wiv a girl on the bleedin’ roof?”\\n\\n “None of your business,” Leo said curtly.\\n\\n A few more windows opened, and more heads stuck out, with incredulous exclamations.\\n\\n “’Oo is he?”\\n\\n “Is she goin’ to jump?”\\n\\n “Gor, what a filfy mess that would be.”\\n\\n Catherine didn’t seem to notice the audience they had attracted, her squinting gaze fastened on Leo. “Did you mean it?” she asked. “What you said?”\\n\\n “We’ll talk about it later,” Leo said, straddling the windowsill, holding on to the frame. “For now, I want you to put your hand against the side of the house and step onto the sill. Carefully.”\\n\\n “Did you mean it?” Catherine repeated, unmoving.\\n\\n Leo gave her an incredulous glance. “Good God, Marks, do you have to be stubborn now, of all times? You want me to declare myself in front of a chorus of prostitutes?”\\n\\n She nodded emphatically.\\n\\n One of the whores called out, “Go on an’ tell ’er, dearie!”\\n\\n The others joined in enthusiastically. “Go on, luv!”\\n\\n “Let’s ’ear it, ’andsome!”\\n\\n Harry, who was standing just behind Leo, was shaking his head slowly. “If it will get her to come in off the blasted roof, just say it, damn it.”\\n\\n Leo leaned farther out the window. “I love you,” he said shortly. As he stared at Catherine’s small, shivering figure, he felt his color run high, and his soul open with an emotion deeper than he had ever imagined could reside in him. “I love you, Marks. My heart is completely and utterly yours. And unfortunately for you, the rest of me comes with it.” Leo paused, struggling for words, when they had always come so easily to him. But these had to be the right words. They meant too much. “I know I’m a bad bargain. But I’m begging you to have me anyway. Because I want the chance to make you as happy as you make me. I want to build a life with you.” He fought to steady his voice. “Please come to me, Cat, because there’s no surviving you. You don’t have to love me back. You don’t have to be mine. Just let me be yours.”\\n\\n “Ohhh…” one of the prostitutes sighed.\\n\\n Another blotted her eyes. “If she won’t ’ave ’im,” she sniffled, “I’ll take ’im.”\\n\\n Before Leo had even finished, Catherine had gotten to her feet and was creeping to the sill. “I’m coming,” she said.\\n\\n “Slowly,” Leo cautioned, tightening his grip on the rope as he watched the movements of her small, bare feet. “Do it exactly the way you did before.”\\n\\n She inched toward him, her back to the wall. “I don’t remember doing it before,” she said breathlessly.\\n\\n “Don’t look down.”\\n\\n “I can’t see anyway.”\\n\\n “That’s just as well. Keep moving.” Gradually Leo gathered the excess rope, as if he were reeling her in. Closer and closer she came, until she was finally within arm’s reach. Leo stretched his hand as far as possible, his fingers trembling with effort. Another step, another, and then he finally had his arm around her, and he dragged her inside.\\n\\n Cheers erupted from the brothel, and the multitude of windows began to close.\\n\\n Leo sank to the floor with his knees splayed, his face buried in Catherine’s hair. Tremors of relief ran through his body, and he let out a shuddering sigh. “I have you. I have you. Oh, Marks. You’ve just put me through the worst two minutes of my entire life. And for that you’re going to spend years atoning.”\\n\\n “It was only two minutes,” she protested, and he choked on a laugh.\\n\\n Fumbling at his pocket, he pulled out her spectacles, and placed them carefully on her nose. The world became clear again.\\n\\n Harry knelt beside them and touched Catherine’s shoulder. She turned and put her arms around him, hugging him tightly. “My big brother,” she whispered. “You came for me again.”\\n\\n She felt Harry smile against her hair. “Always. Whenever you need me.” Lifting his head, he glanced ruefully at Leo as he continued, “You’d better marry him, Cat. Any man willing to put himself through that is probably worth keeping.”\\n\\n It was with the greatest reluctance that Leo surrendered Catherine to Poppy and Mrs. Pennywhistle when they arrived back at the hotel. The two women brought her to her room and helped her to bathe and wash her hair. She was exhausted and disoriented, and infinitely grateful for the soothing attention. Clad in a fresh nightgown and dressing robe, she sat before the fire while Poppy combed out her hair.\\n\\n The room had been cleaned and tidied, the bed changed and freshly made. The housekeeper left with an armload of damp toweling, allowing Catherine and Poppy some privacy.\\n\\n There was no sign of Dodger anywhere. Remembering what had happened to him, Catherine felt her throat clench in grief. Tomorrow she would ask about the gallant little creature, but for now she couldn’t quite bring herself to face it.\\n\\n Hearing her sniffle, Poppy reached around to give her a handkerchief. The comb moved gently through her hair. “Harry told me not to bother you with this tonight, dear, but if it were me, I would want to know. After you left with Leo, Harry stayed behind until the police came to your aunt’s house. They went upstairs to find your aunt, but she was dead. They found raw opium paste in her mouth.” \\n\\n","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-89.html","bookId":1784,"book":{"id":1784,"title":"Married By Morning (The Hathaways #4)","description":"Storyline: He is everything she wants to avoid... \\n For two years, Catherine Marks has been a paid companion to the Hathaway sisters—a pleasant position, with one caveat. Her charges\u0027 older brother, Leo Hathaway, is thoroughly exasperating. Cat can hardly believe that their constant arguing could mask a mutual attraction. But when one quarrel ends in a sudden kiss, Cat is shocked at her powerful response—and even more so when Leo proposes a dangerous liaison. \\n She is not at all what she seems... \\n Leo must marry and produce an heir within a year to save his family home. Catherine\u0027s respectable demeanor hides a secret that would utterly destroy her. But to Leo, Cat is intriguing and infernally tempting, even to a man resolved never to love again. The danger Cat tried to outrun is about to separate them forever—unless two wary lovers can find a way to banish the shadows and give in to their desires...\\n","cover":"https://allnovel.net/images/married-by-morning-the-hathaways-4.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/married-by-morning-the-hathaways-4.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:51 AM"}}
