{"id":110165,"no":25,"title":"Page 25","content":"Sometimes you wake up from a dream. Sometimes you wake up in a dream. And sometimes, every once in a while, you wake up in someone else\u0027s dream. \"If he wanted to carry me off and make me his love slave, I\u0027d do it, so long as I got advance copies of his books.\" My first words spoken to Seth as I passionately discussed his work. Seth\u0027s initial impression of me. Head held high, hair tossed over my shoulder. A flippant remark always at the ready. Grace under fire. A cool social confidence introverted Seth could never muster but envied. How can she do that? Never miss a beat? Later, my rambling explanation of the five-page rule, a goofy habit he found infinitely endearing. Someone else who appreciated literature, viewing it like fine wine. Smart and deep. And beautiful. Yes, beautiful. I saw myself now as Seth had seen me that night: the short skirt, the racy purple top, brilliant as a bird\u0027s plumage. Like some exotic creature, hopelessly out of place in the bookstore\u0027s dreary landscape. All of this was in Seth, the past of his growing feelings for me mingling with the present, and I drank everything up. Not just beautiful. Sexy. Sensual. A goddess made flesh whose every move hinted at passion to come. The dress strap slipping off my shoulder. Faint beads of perspiration on my cleavage. Standing in his kitchen, clad only in that ridiculous Black Sabbath shirt. No underwear on under that. Wonder what it\u0027d be like to wake up with her next to me, messy and untamed. It all spilled into me. More and more. He would watch me at the bookstore. Loved watching me interact with customers. Loved that I seemed to know something about everything. The witty dialogue he pondered for his characters coming to my lips without hesitation. Amazing. Never met anyone who talks like that in real life. My bartering with the used book store owner. A charisma that drew in shy, quiet Seth, made me glow in his eyes. Made him feel more confident. Still his feelings rushed through me. I had never felt anything like it. Certainly I had felt attraction and fondness in my victims, but never such love, not directed at me. Seth thought I was sexy, yes. Desired me. But that raw lust juxtaposed with something softer too. Something sweeter. Kayla sitting on my lap, small blond head against my chest as I braided her hair. A brief shifting of the image as he momentarily considered his own daughter on my lap. Fierce and witty on one hand, gentle and vulnerable on the other. My inebriated state at his condo. A swell of protectiveness as he led me to bed, watching me hours after I\u0027d gone to sleep. He thought no less of me for the weakness, for my lapse of control and judgment. It was a letting down of my walls for him, a sign of imperfection that made him love me more. Further and further I drank, my desperate and weakened state unable to stop. \"Why doesn\u0027t she date?\" Seth asked Cody. Cody? Yes, there he was, in the back of Seth\u0027s mind. A memory. Cody secretly giving Seth swing lessons, neither of them telling me, instead making up vague excuses for why they always had to be \"somewhere.\" Seth, trying so hard to make his feet obey so he could dance with me and be closer to me. \"She\u0027s afraid,\" the vampire replied. \"She thinks love causes pain.\" Love causes pain. Yes, Seth loved me. Not the crush I\u0027d imagined. Not a superficial attraction I thought I\u0027d dissuaded. It was more, so much more. I embodied everything in a woman he could ever imagine: humor, beauty, intelligence, kindness, strength, charisma, sexuality, compassion... His soul seemed to have recognized mine, drawn uncontrollably toward me. He loved me with a depth of feeling I could not even begin to tap into, though believe me, I tried. I wanted it. I wanted to feel it all, to suck up that burning within him. To consume it. Set myself on fire with it. Georgina! Somewhere far away, someone called to me, but I was too into Seth. Too into absorbing that strength within him, that strength fused with his feelings for me. Feelings brought on, amplified even, by kissing. Lips soft and eager. Hungry. Demanding. Georgina! I wanted to become one with Seth. I needed to. I needed him to fill me up... physically, mentally, spiritually. There was something there... something concealed inside him I couldn\u0027t quite reach, hovering in the background. A tantalizing piece of knowledge I should have long since recognized. You are my life. I needed to get in farther, reach out for more. Find out what was hiding from me. That kiss was my lifeline, my connection with something bigger than myself, something I had been aching for all my life but never known. I couldn\u0027t stop. Couldn\u0027t stop kissing Seth. Couldn\u0027t stop. Couldn\u0027t - \"Georgina! Let go!\" Rough hands tore me away from Seth, like flesh ripping from my own body. I cried out in agony at the broken connection, fighting the hands that pulled me and held me. I clawed at my captor, needing to find out the secret lurking beyond that kiss, yearning for the completeness of that union with Seth - Seth. My hands dropped, and I blinked, bringing the world back into focus. Reality. I was no longer inside Seth\u0027s head; I was still in my apartment. A feeling of solidness settled in me, and I didn\u0027t have to look down to know my body had stopped its shifting, my form snapping back to a short, slim woman with honeyed brown hair. The girl I had been long ago was buried within me once more, never to come out if I could help it. Seth\u0027s life force now filled me to overflowing. \"Georgina,\" murmured Hugh behind me, letting his hands ease up on my arms. \"Christ, you scared me.\" Looking across the room, I saw Carter, bedraggled as usual, leaning over Seth\u0027s body. \"Oh God - \" I sprang up and moved to them, kneeling beside the angel. Seth lay on the floor, skin pale and clammy. \"Oh God. Oh God. Oh God. Is he... ?\" \"He\u0027s alive,\" Carter told me. \"Barely.\" Stroking Seth\u0027s cheek, feeling the fine golden-red haze of his near-beard, I felt tears brimming in my eyes. His breathing came shallow and jagged. \"I didn\u0027t mean to. I didn\u0027t mean to take so much...\" \"You did what you had to do. You were in bad shape, could have died.\" \"And now Seth might...\" Carter shook his head. \"No. He won\u0027t. He\u0027ll need recovery time, but he\u0027ll pull through.\" I drew my hand back, half-afraid my touch might harm Seth more. Glancing around, I became aware of the disheveled state of my apartment. It looked worse than Jerome\u0027s. Smashed china and glass. Broken tables. Overturned chairs and couch. The unstable bookshelf in pieces at last. From the kitchen, Aubrey hunkered down under the kitchen table, wondering what was going on. I wondered myself. The nephilim were nowhere in sight. What had happened? Had I really missed it all? The epic, divine battle of the century, and I had missed it for a kiss? Admittedly, a really good kiss, but still... \"Where is... everyone else?\" \"Jerome\u0027s off doing, uh, damage control with your neighbors.\" \"That doesn\u0027t sound good.\" \"Standard practice. Supernatural battles aren\u0027t exactly quiet, you know. He\u0027ll do a little mind erasing, make sure no authorities get notified.\" I swallowed, afraid to ask my next question. \"What about... what about the nephilim ?\" Carter studied me, gray eyes holding me long and hard. \"I know, I know,\" I said at last, looking down, unable to return that gaze. \"There\u0027s no ten years and parole, right? You destroyed them.\" \"We destroyed... one of them.\" I looked up sharply. \"What? What about the other one?\" \"He got away.\" He.My looming tears slipped out now; I could not control them. For you, I\u0027ll walk away. \"How?\" Carter laid a hand on Seth\u0027s forehead as though taking vital stats and then turned back to me. \"It all happened really fast. He masked and went invisible in the confusion, while we were taking on the other one. And honestly...\" The angel looked at my closed front door, then at Hugh and me. \"What?\" I whispered. \"I\u0027m not... I\u0027m not entirely convinced Jerome didn\u0027t let him get away. He wasn\u0027t expecting two. I wasn\u0027t either, though I should have, in retrospect. After killing the first one...\" Carter shrugged. \"I don\u0027t know. Hard to say what happened. \" \"Then he\u0027ll be back,\" I realized, fear and relief blending weirdly in me over the thought of Roman\u0027s escape. \"He\u0027ll be back... and he won\u0027t be happy with me.\" \"I don\u0027t think that\u0027ll be a problem,\" the angel observed. Gently, he lifted Seth up and walked to my overturned couch. A moment later, it flipped over untouched, righting itself. Carter laid Seth on it and continued speaking. \"He took a real beating - the other nephilim. A really bad beating. I can\u0027t believe he had the power left to hide himself from us; I still keep expecting to feel him again any minute. If he\u0027s smart, he\u0027s running as fast and far from us as he can right now, getting out of our range - out of any immortal\u0027s range - so he can drop his shields and rest.\" \"Then what?\" asked Hugh. \"He\u0027s in bad shape. It\u0027ll take him a long time to recover. When he does, he knows he doesn\u0027t have the backup to return here again.\" \"He could still take on me,\" I noted, shivering as I remembered Roman\u0027s wrath toward me at the end. It was hard to believe we\u0027d been wrapped in each other\u0027s arms, caught in the throes of passion, less than twenty-four hours ago. \"He could take you on,\" agreed Carter. \"But he can\u0027t take me on. Or Jerome. He certainly can\u0027t take both of us on. That was what decided it, in the end. They didn\u0027t expect that. Us teamed together. It\u0027ll give him pause to just come bursting back here, even if you alone pose no threat.\" I didn\u0027t find that reassuring in the least. I thought of Roman, passionate and rebellious, always eager to make a point against the system. That personality type lent itself well to revenge. I had tricked him, made love to him, and then betrayed him, resulting in the annihilation of his plans - and his sister. Thank God for my sister. She\u0027s the only one I have, the only mainstay in my life. He might pause, as Carter had suggested, but not for long. Of that, I was certain. \"He\u0027ll be back,\" I whispered, more to myself. \"Someday he\u0027ll be back.\" Carter gave me a steady look. \"Then we will deal with him then.\" My front door opened, and Jerome entered. He looked neat and prim, hardly like he\u0027d just been in an apocalyptic battle with his own offspring. \"Housekeeping all done?\" asked Carter. \"Yes.\" The demon\u0027s eyes darted over to Seth. \"He\u0027s alive?\" \"Yes.\" Angel and demon locked eyes then, and a tense moment of palpable silence hung between them. \"How fortuitously unexpected,\" Jerome murmured at last. \"I could have sworn he was dead. Well. Miracles happen every day. I suppose we\u0027ll have to wipe him now.\" I stood up. \"What are you talking about?\" \"Nice to have you back with us again, Georgie. You look lovely, by the way.\" I glared at him, angry at his joke, knowing it was Seth\u0027s energy giving me the succubus glamour now. \"What do you mean you have to \u0027wipe\u0027 him?\" \"What do you think? We can\u0027t let him walk away after everything he\u0027s seen. I\u0027ll diminish a little of his affection for you while I\u0027m at it; he\u0027s a liability to you.\" \"What? No. You can\u0027t do that.\" Jerome sighed, putting on the look of one who suffered long and hard. \"Georgina, do you have any idea what he was just exposed to? He has to be wiped. We can\u0027t let him know about us.\" \"How much of me will you take from him?\" Pieces of Seth\u0027s memories - my memories, now - glittered in my head like jewels. \"Enough so that he forgets he has any more than a passing knowledge of you. You\u0027ve been even more negligent with your job than usual these last few weeks.\" I hardly thought that was Seth\u0027s fault; Roman had helped too. \"Both of you will function much better if he finds some mortal woman to obsess on instead.\" Don\u0027t you want to stand out in some way? Carter\u0027s taunting question from what seemed like an eternity ago whispered in my head. \"You don\u0027t have to do this. You don\u0027t have to take me out with the rest.\" \"If I\u0027m already in there, I might as well clear you too. There\u0027s no way he can just go on as usual after being exposed to denizens of the divine realms. Even you have to agree with that.\" \"Some mortals know about us,\" I argued. \"Like Erik. Erik knows, and he keeps it to himself.\" In fact, I realized suddenly, Erik had kept Helena\u0027s secret to himself as well. He had figured it out after working with her over the years but had never revealed the full truth, only doling out small clues for me. \"Erik is a special case. He has a gift. An ordinary mortal like this one couldn\u0027t handle it.\" Jerome walked over to my couch, looking at Seth dispassionately. \"It\u0027s better this way.\" \"No. Please,\" I cried, running over to Jerome and pulling his sleeve. \"Please don\u0027t.\" The archdemon turned to me, dark eyes cold and shocked that I would dare grab hold of him like that. I knew then, cringing under that gaze, that something in our fond, indulgent relationship had changed forever - something small, but important nonetheless. I didn\u0027t know what had done it. Maybe it had been Seth. Maybe it had been Roman. Maybe it had been something else altogether. All I knew was that it had happened. \"Please,\" I begged, ignoring how desperate I must sound. \"Please don\u0027t. Don\u0027t take me from him... out of his head like that. I\u0027ll do anything you want. Anything.\" I brushed a hand over my eyes, attempting to look calm and in control, knowing I was failing. One eyebrow shifted ever so slightly on Jerome\u0027s face, the only hint that I had piqued his interest. The term \"deal with the devil\" had not arisen lightly; few demons could resist a bargain. \"What could you possibly offer me? The sex thing only worked on my son, so don\u0027t even think about trying it now.\" \"Yes,\" I agreed, voice growing stronger as I plunged forward. \"It worked on him. It works on all sorts of men. I\u0027m good, Jerome. Better than you know. Why do you think I\u0027m the only succubus in this city? It\u0027s because I\u0027m one of the best. Before I hit this funk... this, I don\u0027t know, whatever mood I\u0027ve been in for a while now, I could have any man I wanted. And not just simply for their strength and life force. I could manipulate them. Make them do anything I asked, talk them into acts of sin they never would have dreamed of before meeting me. And they would do it. They\u0027d do it, and they\u0027d like doing it.\" \"Go on.\" I took a deep breath. \"You\u0027re tired of the \u0027all lowlifes, all the time,\u0027 right? Me being negligent? Well, I can change that. I can raise your stock higher than you\u0027ve ever dreamed. I\u0027ve done it before. All you have to do is let Seth go. Let him keep his memories intact. All of them.\" Jerome studied me a moment, mind working. \"All the \u0027stock\u0027 in the world won\u0027t do me any good if he runs around blathering about what he\u0027s seen.\" \"Then we\u0027ll see if he can handle it first. When he recovers and wakes up, we\u0027ll talk to him. If he doesn\u0027t look like he\u0027ll be able to cope with it all... well, then you can erase his memories.\" \"Who will make the call if he can cope or not?\" I hesitated, not wanting that decision in the demon\u0027s hands. \"Carter will. Carter can tell if someone\u0027s telling the truth.\" I looked at the angel. \"You\u0027ll know if it\u0027s okay, right? Okay for him to know... about us?\" Carter gave me an odd look, one I could not interpret. \"Yes,\" he finally admitted. \"What about your end?\" asked Jerome. \"Will you hold it up - even if Carter decides he\u0027s unsafe?\" That was harsh. I had a feeling Jerome wouldn\u0027t negotiate on this one, but I was willing to risk it, so confident did I feel about Seth\u0027s capacity to process immortal activity. I opened my mouth, about to agree, when I caught Hugh shaking his head at me out of the corner of my eye. Frowning, he tapped his watch, mouthing something I couldn\u0027t understand at first. Then, it clicked. Time. I had listened to the imp talk about his job enough to know the rules of negotiation: never make an open-ended deal with a demon. \"If Seth keeps his memories, I\u0027ll walk the succubus straight and narrow for a century. If they have to be erased anyway, then I\u0027ll still do it for... a third of that.\" \"Half,\" countered Jerome. \"We aren\u0027t mortal. Even a century is nothing on the face of eternity.\" \"Half,\" I agreed dully, \"but no more than survival dictates. I\u0027m not going to do this every day, if that\u0027s what you\u0027re thinking. I\u0027ll only get fixes as I need them, but they\u0027ll be strong ones. Very strong - loaded with sin. With men of good caliber, that\u0027ll be... oh, every four to six weeks.\" \"I want better than that. Extra credit. Every couple of weeks, whether you need it or not.\" I closed my eyes, unable to fight anymore. \"Every couple of weeks.\" \"Very well,\" said Jerome, a warning note in his voice. \"But you will be held to this agreement unless I choose to terminate it for some reason. Not you. There will be no wiggling out for you.\" \"I know. I know, and I accept.\" \"Shake then.\" He extended his hand to me. Not hesitating, I took it, and power crackled briefly around us. The demon smiled thinly. \"We have a deal.\"","sourceLink":"https://allnovel.net/succubus-blues-georgina-kincaid-1/page-25.html","bookId":2054,"book":{"id":2054,"title":"Succubus Blues (Georgina Kincaid #1)","description":"Storyline: Georgina Kincaid Book 1: Succubus Blues We first meet Georgina Kincaid when she is asked by her friend Hugh the imp to sleep with a virgin who has bargained to give up his soul in exchange for a hot and heavy fantasy encounter with a demoness. So as a favor to her friend she agrees to shape shift into a demonic outfit complete with wings and a tail and sleep with the 34 year old man. We are then told that she is a succubus who takes the life force from men to survive through sex. The better character the man has the more energy she gets from him. The more immoral the man the less energy she gets from him. After sex with the man she goes to her car where she is accosted by a vampire named Duane who tries to force himself on her when she fights back he is angered but when a car driven by it allows her a distraction to get away. She gets a call from her demon boss Jerome who got a call from Duane saying she attacked him and threatened him, which she did in self defense.","cover":"https://allnovel.net/images/succubus-blues-georgina-kincaid-1.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/succubus-blues-georgina-kincaid-1.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 5, 2019 11:53:09 PM"}}
