{"id":98899,"no":8,"title":"Page 8","content":"Brett tasted a sip from his spoon.\\n\\n Delicious!\\n\\n \"The air is dry enough for you?\" Scudi asked.\\n\\n He nodded, his mouth full of soup.\\n\\n \"My room is small but that makes it easier to keep the air the way I like it. And easier to keep clean. I work topside very often. Dry is comfort to me now and I don\u0027t feel comfortable with the humidity in passages and public places.\" She put the bowl to her lips and drained it.\\n\\n Brett copied her, then asked, \"What will happen to me? When will I go back topside?\"\\n\\n \"We\u0027ll talk of this after food,\" she said. She brought up two more bowls and uncovered them, revealing bite-sized chunks of fish in a dark sauce. With the bowl she handed him a pair of carved bone chopsticks.\\n\\n \"After food,\" he agreed and took a bite of the sauced fish. It was peppery hot and brought tears to his eyes but he found the aftertaste pleasant.\\n\\n \"It is our custom,\" Scudi said. \"Food sets the body at ease. I can say, \u0027Brett Norton, you are safe here and well.\u0027 But I know down under is alien to you. And you have been in danger. You must speak to your body in the language it understands before sense returns to you. Food, rest - these are what your body speaks.\"\\n\\n He liked the rational sense of her words and returned to the fish, enjoying it more with each bite. Scudi, he saw, was eating as much as he even though she was much smaller. He liked the delicate flick of her chopsticks into the bowl and at the edge of her mouth.\\n\\n What a beautiful mouth, he thought. He remembered how she had given him that first breath of life.\\n\\n She caught him staring and he quickly returned his attention to his bowl.\\n\\n \"The sea takes much energy, much heat,\" she said. \"I wear a dive suit as little as possible. Hot shower, much hot food, a warm bed - these are always needed. Do you work the Islander subs topside, Brett?\"\\n\\n Her question caught him off guard. He\u0027d begun to think that she had no curiosity about him.\\n\\n Maybe I\u0027m just some kind of obligation to her, he thought. If you save someone, maybe you\u0027re stuck with them.\\n\\n \"I\u0027m a surface fisherman for a contractor named Twisp,\" he said. \"He\u0027s the one I most want to get word to. He\u0027s a strange man, but the best in a boat that I\u0027ve seen.\"\\n\\n \"Surface,\" she said. \"That\u0027s much danger from dashers, isn\u0027t it? Have you seen dashers?\"\\n\\n He tried to swallow in a suddenly dry throat. \"We carry squawks. They warn us, you know.\" He hoped that she wouldn\u0027t notice the dodge.\\n\\n \"We\u0027re afraid of your nets,\" she said. \"Sometimes visibility is bad and they can\u0027t be seen. Mermen have been killed in them.\"\\n\\n He nodded, remembering the thrashing and the blood and Twisp\u0027s stories of other Mermen deaths in the nets. Should he mention that to Scudi? Should he ask about the strange reaction of the Maritime Court? No ... she might not understand. This would be a barrier between them.\\n\\n Scudi sensed this, too. He could tell because she spoke too quickly. \"Would you not prefer to work in your subs? I know they are soft-bellied, not like ours at all, but ...\"\\n\\n \"I think ... I think I\u0027d like to stay with Twisp unless he goes back to the subs. I\u0027d sure like to know if he\u0027s all right.\"\\n\\n \"We will rest and when we wake, you will meet some of our people who can help. Mermen travel far. We pass along the word. You will hear of him and he of you ... if that\u0027s your wish.\"\\n\\n \"My wish?\" He stared at her, absorbing this. \"You mean I could choose to ... disappear?\"\\n\\n She shrugged her eyebrows, accenting the gamin look. \"Where you want to be is where you should be. Who you want to be is the same, not so?\"\\n\\n \"It can\u0027t be that simple.\"\\n\\n \"If you have not broken the law, there are possibilities down under. The Merman world is big. Wouldn\u0027t you like to stay here?\" She coughed and he wondered if she had been about to say \"stay here with me?\" Scudi suddenly seemed much older, more worldly. Talk among the Islanders gave Brett the impression that Mermen had an extra sophistication, a sense of belonging anywhere they went, of knowing more than Islanders.\\n\\n \"Do you live alone?\" he asked.\\n\\n \"Yes. This was my mother\u0027s place. And it\u0027s close to where my father lived.\"\\n\\n \"Don\u0027t Merman families live together?\"\\n\\n She scowled. \"My parents ... stubborn, both of them. They couldn\u0027t live together. I lived with my father for a long time, but ... he died.\" She shook her head and he saw the memories pain her.\\n\\n \"I\u0027m sorry,\" he said. \"Where\u0027s your mother?\"\\n\\n \"She is dead too.\" Scudi looked away from him. \"My mother was net-bound less than a year ago.\" Scudi\u0027s throat moved with a convulsive swallow as she turned back to him. \"It has been difficult ... there is a man, GeLaar Gallow, who became my mother\u0027s ... lover. That was after ...\" She broke off and shook her head sharply.\\n\\n \"I\u0027m sorry, Scudi,\" he said. \"I didn\u0027t mean to bring back painful -\"\\n\\n \"But I want to talk about it! Down here, there is no one I can ... I mean, my closest friends avoid the subject and I ...\" She rubbed her left cheek. \"You are a new friend and you listen.\"\\n\\n \"Of course, but I don\u0027t see what ...\"\\n\\n \"After my father died, my mother signed over ... You understand, Brett, that my father was Ryan Wang, there was much wealth?\"\\n\\n Wang! he thought. Merman Mercantile. His rescuer was a wealthy heiress!\\n\\n \"I ... I didn\u0027t ...\"\\n\\n \"It is all right. Gallow was to be my stepfather. My mother signed over to him control of much that my father left. Then she died.\"\\n\\n \"So there\u0027s nothing for you.\"\\n\\n \"What? Oh, you mean from my father. No, that is not my problem. Besides, Kareen Ale is my new guardian. My father left her ... many things. They were friends.\"\\n\\n \"What ... you said there\u0027s a problem.\"\\n\\n \"Everyone wants Kareen to marry Gallow and Gallow pursues this.\"\\n\\n Brett noted that Scudi\u0027s lips tightened every time she spoke Gallow\u0027s name. \"What is wrong with this Gallow?\" he asked.\\n\\n Scudi spoke in a low voice. \"He frightens me.\"\\n\\n \"Why? What\u0027s he done?\"\\n\\n \"I don\u0027t know. But he was on the crew when my father died ... and when my mother died.\"\\n\\n \"Your mother ... you said a net ...\"\\n\\n \"An Islander net. That is what they said.\"\\n\\n He lowered his gaze, remembering his recent experience with a Merman in the net.\\n\\n Seeing the look on his face, Scudi said: \"I have no resentment toward you. I can see that you are sorry. My mother knew the danger of nets.\"\\n\\n \"You said Gallow was with your parents when they died. Do you ...\"\\n\\n \"I have never spoken of this to anyone before. I don\u0027t know why I say it to you, but you are sympathetic. And you ... I mean ...\"\\n\\n \"I owe you.\"\\n\\n \"Oh, no! It is nothing like that. It\u0027s just ... I like your face and the way you listen.\"\\n\\n Brett lifted his gaze and met her staring at him. \"Is there no one who can help you?\" he asked. \"You said Kareen Ale ... everyone knows about her. Can\u0027t she -\"\\n\\n \"I would never say these things to Kareen!\"\\n\\n Brett studied Scudi for a moment, seeing the shock and fear in her face. He already had a sense of the wildness in Merman life from the stories told among Islanders. Violence was no stranger down here, if the stories were to be believed. But what Scudi suggested ...\\n\\n \"You wonder if Gallow had anything to do with the deaths of your parents,\" he said.\\n\\n She nodded without speaking.\\n\\n \"Why do you suspect this?\"\\n\\n \"He asked me to sign many papers but I pleaded ignorance and consulted Kareen. I don\u0027t think the papers he showed her were the same ones he brought to me. She has not said yet what I should do.\"\\n\\n \"Has he ...\" Brett cleared his throat. \"What I mean is ... you are ... that is, sometimes Islanders marry young.\"\\n\\n \"There has been nothing like that, except he tells me to hurry and grow up. It is all a joke. He says he is tired of waiting for me.\"\\n\\n \"How old are you?\"\\n\\n \"I will be sixteen next month. You?\"\\n\\n \"I\u0027ll be seventeen in five months.\"\\n\\n She looked at his net-calloused hands. \"Your hands say you work hard, for an Islander.\" Immediately, she popped a hand over her mouth. Her eyes went wide.\\n\\n Brett had heard Merman jokes about lazy Islanders sunning themselves while Mermen built a world under the sea. He scowled.\\n\\n \"I have a big mouth,\" Scudi said. \"I find someone at last who can really be my friend and I offend him.\"\\n\\n \"Islanders aren\u0027t lazy,\" Brett said.\\n\\n Scudi reached out impulsively and took his right hand in hers. \"I have only to look at you and I know the stories are lies.\"\\n\\n Brett pulled his hand away. He still felt hurt and bewildered. Scudi might say something soothing to smooth it over, but the truth had come out involuntarily.\\n\\n I work hard, for an Islander!\\n\\n Scudi got to her feet and busied herself removing the dishes and the remains of their meal. Everything went into a pneumatic slot at the kitchen wall and vanished with a click and a hiss.\\n\\n Brett stared at the slot. The workers who took care of that probably were Islanders permanently hidden from view.\\n\\n \"Central kitchens and all this space,\" he said. \"It\u0027s Mermen who have things easy.\"\\n\\n She turned toward him, an intent expression on her face. \"Is that what Islanders say?\"\\n\\n Brett felt his face grow hot.\\n\\n \"I don\u0027t like jokes that lie,\" Scudi said. \"I don\u0027t think you do, either.\"\\n\\n Brett swallowed past a sudden lump in his throat. Scudi was so direct! That was not the Islander way at all, but he found himself attracted by it.\\n\\n \"Queets never tells those jokes and I don\u0027t either,\" Brett said.\\n\\n \"This Queets, he is your father?\"\\n\\n Brett thought suddenly about his father and his mother - the butterfly life between intense bouts of painting. He thought about their downcenter apartment, the many things they owned and cared for - furniture, art work, even some Merman appliances. Queets, though, owned only what he could store in his boat. He owned what he truly needed - a kind of survival selectivity.\\n\\n \"You are ashamed of your father?\" Scudi asked.\\n\\n \"Queets isn\u0027t my father. He\u0027s the fisherman who owns my contract - Queets Twisp.\"\\n\\n \"Oh, yes. You do not own many things, do you, Brett? I see you looking around my quarters and ...\" She shrugged.\\n\\n \"The clothes on my back were mine,\" Brett said. \"When I sold my contract to Queets, he took me on for training and gave me what I need. There isn\u0027t room for useless stuff on a coracle.\"\\n\\n \"This Queets, he is a frugal man? Is he cruel to you?\"\\n\\n \"Queets is a good man! And he\u0027s strong. He\u0027s stronger than anyone I\u0027ve ever known. Queets has the longest arms you\u0027ve ever seen, perfect for working the nets. They\u0027re almost as long as he is tall.\"\\n\\n A barely perceptible shudder crossed Scudi\u0027s shoulders. \"You like this Queets very much,\" she said.\\n\\n Brett looked away from her. That unguarded shudder told it all. Islanders made Mermen shudder. He felt the pain of betrayal deep in his guts. \"You Mermen are all the same,\" he said. \"Mutants don\u0027t ask to be that way.\"\\n\\n \"I don\u0027t think of you as a mutant, Brett,\" she said. \"Anyone can see that you\u0027re normalized.\"\\n\\n \"There!\" Brett snapped, glaring at her. \"What\u0027s normal? Oh, I\u0027ve heard the talk: Islanders are having more \u0027normal\u0027 births these days ... and there\u0027s always surgery. Twisp\u0027s long arms offend you? Well, he\u0027s no freak. He\u0027s the best fisherman on Pandora because he fits what he does.\"\\n\\n \"I see that I\u0027ve learned many wrong things,\" Scudi said, her voice low. \"Queets Twisp must be a good man because Brett Norton admires him.\" A wry smile touched her lips and was gone. \"Have you learned no wrong things, Brett?\"\\n\\n \"I\u0027m ... after what you did for me, I should not be talking to you this way.\"\\n\\n \"Wouldn\u0027t you save me if I were caught in your net? Wouldn\u0027t you ...\"\\n\\n \"I\u0027d go in after you and damn the dashers!\"\\n\\n She grinned, an infectious expression that Brett found himself answering in kind.\\n\\n \"I know you would, Brett. I like you. I learn things about Islanders from you that I didn\u0027t know. You are different, but ...\"\\n\\n His grin vanished. \"My eyes are good eyes!\" he snapped, thinking this was the difference she meant.\\n\\n \"Your eyes?\" She stared at him. \"They are beautiful eyes! In the water, I saw your eyes first. They are large eyes and ... difficult to escape.\" She lowered her gaze. \"I like your eyes.\"\\n\\n \"I ... I thought ...\"\\n\\n Again, she met his gaze. \"I\u0027ve never seen two Islanders exactly alike, but Mermen are never exactly alike, either.\"\\n\\n \"Everyone down under won\u0027t feel that way,\" he accused.\\n\\n \"Some will stare,\" she agreed. \"It is not normal to be curious?\"\\n\\n \"They\u0027ll call me Mute,\" he said.\\n\\n \"Most will not.\"\\n\\n \"Queets says words are just funny ripples in the air or printed squiggles.\"\\n\\n Scudi laughed. \"I would like to meet this Queets. He sounds like a wise man.\"\\n\\n \"Nothing much ever bothered him except losing his boat.\"\\n\\n \"Or losing you? Will that bother him?\"\\n\\n Brett sobered. \"Can we get word to him?\"\\n\\n Scudi touched the transphone button and voiced his request over the grill in the wall. The response was too quiet for Brett to hear. She did it casually. He thought then that this marked the difference between them more firmly than his own overlarge eyes with their marvelous night vision.\\n\\n Presently, Scudi said: \"They will try to get word to Vashon.\" She stretched and yawned.\\n\\n Even yawning, she was beautiful, he thought. He glanced around the room, noting the closeness of the two cots. \"You lived here with just your mother?\" he asked. Immediately, he saw the sad expression return to Scudi\u0027s face and he cursed himself. \"I\u0027m sorry, Scudi. I should not keep reminding you of her.\"\\n\\n \"It\u0027s all right, Brett. We are here and she is not. Life continues ... and I do my mother\u0027s work.\" Again, that gamin grin twisted her mouth. \"And you are my first roommate.\"\\n\\n He scratched his throat, embarrassed, not knowing the moral rules between the sexes down under. What did it mean to be a roommate? Stalling for time, he asked: \"What is this work of your mother\u0027s that you do?\"\\n\\n \"I told you. I mathematic the waves.\"\\n\\n \"I don\u0027t know what that means.\"\\n\\n \"Where new waves or wave patterns are seen, I go. As my mother did and both her parents before her. It is a thing for which our family has a natural talent.\"\\n\\n \"But what do you do?\"\\n\\n \"How the waves move, that tells us how the suns move and how Pandora responds to that movement.\"\\n\\n \"Oh? Just from looking at the waves, you ... I mean, waves are gone just like that!\" He snapped his fingers.\\n\\n \"We simulate the waves in a lab,\" she said. \"You know about wavewalls, I\u0027m sure,\" she said. \"Some go completely around Pandora several times.\"\\n\\n \"And you can tell when they\u0027ll come?\"\\n\\n \"Sometimes.\"\\n\\n He thought about this. The extent of Merman knowledge suddenly daunted him.\\n\\n \"You know we warn the Islands when we can,\" she said.\\n\\n He nodded.\\n\\n \"To mathematic the waves, I must translate them,\" she said. She patted her head absently, exaggerating her gamin appearance. \"Translate is a better word than mathematic,\" she said. \"And I teach what I do, of course.\"\\n\\n Of course! he thought. An heiress! A rescuer! And now an expert on waves!\\n\\n \"Who do you teach?\" he asked, wondering if he could learn this thing she did. How valuable that would be for the Islands!\\n\\n \"The kelp,\" she said. \"I translate waves for the kelp.\"\\n\\n He was shocked. Was she joking, making fun of Islander ignorance?\\n\\n She saw the expression on his face because she went on, quickly: \"The kelp learns. It can be taught to control currents and waves ... when it returns to its former density, it will learn more. I teach it some of the things it must know to survive on Pandora.\"\\n\\n \"This is a joke, isn\u0027t it?\" he asked.\\n\\n \"Joke?\" She looked puzzled. \"Don\u0027t you know the stories of the kelp as it was? It fed itself, it moved gases in and out of the water. The hylighters! Oh, I would love to see them! The kelp knew so many things, and it controlled the currents, the sea itself. All of this the kelp did once.\"\\n\\n Brett gaped at her. He recalled schooltime stories about the sentient kelp, one creature alive as a single identity in all of its parts. But that was ancient history, from the time when men had lived on solid land above Pandora\u0027s sea.\\n\\n \"And it will do this again?\" he whispered.\\n\\n \"It learns. We teach it how to make currents and to neutralize waves.\"\\n\\n Brett thought about what this might mean to Island life - drifting on predictable currents in predictable depths. They could follow the weather, the fishing ... An odd turn of thought put this out of his mind. He considered it almost unworthy, but who could know for certain what an alien intelligence might do?\\n\\n Scudi, noting his expression, asked: \"Are you well?\"\\n\\n He spoke almost mechanically. \"If you can teach the kelp to control the waves, then it must know how to make waves. And currents. What\u0027s to prevent it from wiping us out?\"\\n\\n She was scornful. \"The kelp is rational. It would not further the kelp to destroy us or the Islands. So it will not.\"\\n\\n Again, she stilled a yawn and he recalled her comment that she had to go back to work soon.\\n\\n The ideas she had put into his head whirled there, though, leaving him on edge, driving away all thought of sleep. Mermen did so many things! They knew so much!\\n\\n \"The kelp will think for itself.\" He recalled hearing someone say that, a conversation at the quarters of his parents - important people talking about important matters.\\n\\n \"But that could not happen without Vata,\" someone had said in response. \"Vata is the key to the kelp.\"\\n\\n That had begun what he remembered as a sprightly and boo-inspired conversation, which, as usual, ran from speculative to paranoid and back.\\n\\n \"I\u0027ll turn out the light for your modesty,\" Scudi said. She giggled and touched the light down through dim to barely shadow. He watched her fumble her way to her bed.\\n\\n It\u0027s dark to her, he thought. For me she just turned down the glare. He shifted on the edge of his bed.\\n\\n \"You have a girlfriend topside?\" Scudi asked.\\n\\n \"No ... not really.\"\\n\\n \"You have never shared a room with a girl?\"\\n\\n \"On the Islands, you share everything with everyone. But to have a room, two people alone, that\u0027s for couples who are new to each other. For mating. It is very expensive.\"\\n\\n \"Oh, my,\" she said. In the shadow-play of his peculiar vision he watched her fingers dance nervously over the surface of her cot.\\n\\n \"Down under we share for mating, yes, but we also share rooms for other reasons. Work partners, schoolmates, good friends. I mean only for you to have one night of recovery. Tomorrow there will be others and questions and tours and much noise ...\" Still her hands moved in that nervous rhythm.\\n\\n \"I don\u0027t know how I can ever repay you for being so nice to me,\" he said.\\n\\n \"But it is our custom,\" she said. \"If a Merman saves you, you can have what the Merman has until you ... move on. If I bring life into this compound, I\u0027m responsible for it.\"\\n\\n \"As though I were your child?\"\\n\\n \"Something like.\" She sighed, and began undressing. \\n\\n","sourceLink":"https://allnovel.net/the-lazarus-effect-destination-void-3/page-8.html","bookId":2171,"book":{"id":2171,"title":"The Lazarus Effect (Destination: Void #3)","description":"Storyline: The Lazarus Effect (Destination: Void #3) \\n The Histories assert that a binary system cannot support life. But we found life here on Pandora. Except for the kelp, it was antagonistic and deadly, but still it was life. Ship\u0027s judgment is upon us now because we wiped out the kelp and unbalanced this world. We few survivors are subject to the endless sea and the terrible vagaries of the two suns. That we survive at all on our fragile Clone-rafts is as much a curse as a victory. This is the time of madness. Hali Ekel, the Journals Duque smelled burning flesh and scorched hair. He sniffed, sniffed again, and whined. His one good eye watered and pained him when he tried to knuckle it open. His mother was out. Out was a word he could say, like hot and Ma. He could not precisely identify the location and shape of out. He knew vaguely that his quarters were on a Clone-raft anchored off a black stone pinnacle, all that remained of Pandora\u0027s land surface.\\n","cover":"https://allnovel.net/images/the-lazarus-effect-destination-void-3.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-lazarus-effect-destination-void-3.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:37:04 PM"}}
