{"id":28913,"no":12,"title":"CHAPTER XII TEARS","content":"Everell’s last meal at Foxwell Court was not marked by lively conversation. He had his own thoughts, or, rather, his own confused and whirling state of mind, so that he scarce knew whether the others spoke or were silent. Outwardly he still maintained a brave face, so that Georgiana might not yet be alarmed. The young lady herself had never taken much part in the table talk. Lady Strange and Rashleigh felt the occasion too sensibly to be capable of easy discourse, and Foxwell knew a gentleman’s part too well to intrude a gaiety either real or feigned. He quietly kept the ball rolling, however, with Mrs. Winter, who alone—save Georgiana—seemed untouched by the shadow of coming events. \\n\\n \\n\\n As soon as the ladies had finished, Georgiana left the room for the library. Everell, with a bow to the company, turned to follow her. \\n\\n \\n\\n Lady Strange, already risen, laid a gentle hand upon his sleeve and said, softly: “Upon my soul, sir, I pity you!” \\n\\n \\n\\n He looked at her a moment; then, summoning a smile, answered: “I thank you from my heart; but ’tis not near ten o’clock. I have some hours yet remaining. Ladies, your servant.” \\n\\n \\n\\n When he had gone out, Mrs. Winter said: “So you may keep your pity till ten o’clock, Diana. Sure the young fellow carries it off well. ’Twill be worth seeing if he does so to the end. Ten o’clock—’tis several hours off, and card-playing begins to be tedious. What a long evening ’twill be!” \\n\\n \\n\\n “Short enough for those two young lovers,” said Lady Strange, with a sigh, as she passed to the drawing-room. \\n\\n \\n\\n “I suppose you have made your arrangements, Bob,” said Rashleigh, when the two gentlemen were alone; “for delivering him up, I mean.” \\n\\n \\n\\n “They are very simple. I will send Joseph with a message to Jeremiah Filson an hour or so before ten o’clock. Filson will require a little time to muster the justice’s men; he may have to go to Thornby Hall—no doubt Thornby’s clerk will command the party, to make sure that all is regular. So ’twill scarce be possible for them to arrive before ten: in any case, I’ll warn Filson they mustn’t do so. Till ten I may not call the rebel from Georgiana’s presence. I hope he will leave her in ignorance. Well, we shall see.” \\n\\n \\n\\n In the library Georgiana sat reading to her lover. What the words meant, what the book was, he hardly knew; she would have preferred to be the listener, but in that case he would have had to keep his eyes upon the page, and he would rather keep them upon her face. He could interrupt when he chose, and then her eyes rose to meet his; so that he often interrupted. Suddenly he remembered the miniature she had started to get for him in the afternoon; and now the desire to possess it—to have that image of her beauty to carry with him to the end—grew strong in a moment. He reminded her. \\n\\n \\n\\n She rose at once to go to her room for it, saying, as before, that only she could find it. He followed her through the dining-room; which was now deserted, as Foxwell and Rashleigh had soon joined the ladies in the drawing-room. In the wide entrance-hall, as Everell could accompany her no farther, he caught her hand lightly, and said: \\n\\n \\n\\n “Don’t be long in finding it, I pray. Remember, every moment—” He checked himself, and turned the supplication to gaiety by a smile. “Be considerate of my impatience, dear.” \\n\\n \\n\\n Struck by his manner, she looked searchingly at his face. But he kissed her hand in a playful way, and gave it a little toss toward the stairway; up which she hastened a moment later, reassured. \\n\\n \\n\\n There was a footman stationed in the entrance-hall, and Everell, not wishing his mood to be observed, went back into the dining-room to await Georgiana’s return. He still held in one hand the book from which she had been reading. He turned the pages, gazing at the words, but receiving no impression from them. The table remained as the gentlemen had left it, except that the candelabrum had been removed, only two candles in wall-sconces remaining to light the room. The fire in the chimney-place was low, and the air rather chill, for the evening had set in with a cold wind. “Little do I care, though it freeze and blow,” thought Everell, standing by the fireplace. “Why does she delay? Cruel!—but she knows not. The minutes!—the minutes I am losing!” \\n\\n \\n\\n But in truth she was expeditious, and so quiet in her return that she entered the room before he had heard her step. He went to her with a subdued cry, seized the miniature from her hand, and pressed it—and then the hand itself—with passionate tenderness to his lips. \\n\\n \\n\\n “It shall never leave me,” he said. “It shall be the last thing I look upon—it shall feel the last beat of my heart.” \\n\\n \\n\\n “But that will be many, many years in the future,” said Georgiana, with a half-comic air of complaint, “and meanwhile you don’t even look at the picture now!” \\n\\n \\n\\n “Time enough for that!—Let me look only at you now.” \\n\\n \\n\\n “What do you mean? There is time enough for looking at me, too. Tell me if the likeness flatters me.” \\n\\n \\n\\n “Nothing could do that. ’Tis a lovely portrait—never was a lovelier; but the eyes are not as sweet as the original’s—nor the face as angelic—nor the hair as soft—nor the colour as fair—nor the look as tender. ’Tis nothing to the life—and yet ’tis adorable. ’Twas kindly thought, to give it me,—more kindly than you know, dear.” \\n\\n \\n\\n He kissed it once more; then, having placed it carefully in the breast pocket of his waistcoat, took both her hands, and regarded her with an intentness that reawoke the vague alarm she had felt in the hall. \\n\\n \\n\\n “Why do you look in that manner, Everell? Why do you speak so strangely this evening? You make me almost afraid—for you, that is—nay, for both of us. What is it?” \\n\\n \\n\\n “Nothing—nothing, sweet!” But whatever he might say, it was no longer possible for him to counterfeit either gaiety or unconcern with any success. “God knows, I would be the same now—I would have us both be the same now—as we have been all this week. I grudge every thought that we give to anything but our love. Let us have the full worth of each moment, to the very end.—Nay, what am I saying? I rave, I think. Yes, yes, dear, I speak strangely—strangely was well said.” \\n\\n \\n\\n “Everell, you frighten me! What is behind all this?—what is it you have in mind?” \\n\\n \\n\\n “Only you, dear: you, as you are at this instant. There is nothing but this instant—no past, no future!—there is only now, with you in my arms, and your eyes looking into mine. Oh, if the course of time could be stopped, and this moment last for ever!” \\n\\n \\n\\n “I should be content,” said Georgiana, taking refuge in the possibility that his manner might be the effect of a transient excess of emotion, such as ardent lovers sometimes experience. “But haven’t we all our lives in which to love each other? We must only guard against your being taken. But you’ll be safe once you are out of England—as you will be by and by—not yet, of course. And then after awhile we shall meet again in France. My only dread is of the separation meanwhile—’tis fearful to think of separation, even for a short time, but doubtless it must be—” She broke off, with a sigh. \\n\\n \\n\\n “Ay, must be!” Everell replied, in a low voice. \\n\\n \\n\\n “But it must not be long. I believe my uncle will be glad of an occasion to visit France. And then, when danger and separation are past, what happiness!” \\n\\n \\n\\n She had, it will be seen, formed her own plans for the future; and had talked of them, too, more than once in the last few days, taking her lover’s acquiescence for granted, as indeed his manifestations of love gave her full right to do. Such initiative on the woman’s side is, by a convention of romancers, assumed to be indelicate; if it be so, then the world must grant that real women are not the delicate creatures they have been taken for. Be that as it may, Georgiana’s dreams of the future had been bitter-sweet hearing to Everell, though he saw nothing indelicate in her mentioning them. Yet he could not bring himself to disillusion her. But now at last, when the hour was drawing near— \\n\\n \\n\\n “Nay, talk not of the future, dear,” he said, holding her close in his arms, and endeavouring to speak without wildness. “There is only the present, I say. Life is full of uncertainty. Who can tell? This separation—it may be final—we may not see each other again.” \\n\\n \\n\\n “Now you start my fears again!” cried Georgiana. “You puzzle me to-night, Everell. There’s something in your thoughts—something in your heart. Look at me: you are pale—one would suppose a calamity was before us. What is it? Oh, in the name of heaven, tell me!” \\n\\n \\n\\n “Nay, ’tis nothing, I protest.—And yet you must know too soon. Why not from me? Who has such love for you as I have? who can feel for you as I can? who would try so fondly to console?” \\n\\n \\n\\n “You are right, Everell; let me hear it from you! Oh, speak, dear!” \\n\\n \\n\\n “’Tis—only this, sweetheart,” he said, when he could command his voice: “we are to part soon. I am going away.” \\n\\n \\n\\n “Soon? How soon? Certainly, you must go to France—but not yet.” \\n\\n \\n\\n “Ay, that is it, dear: I must go, I know not how soon. Perhaps—this very night.” \\n\\n \\n\\n “This night? Impossible! You have said nothing to me of going—’tis too unexpected!” \\n\\n \\n\\n “Forgive me, dear,” he pleaded, simply. “I wished not to cloud our happiness with any thought of separation; so I never spoke of—my day of departure.” \\n\\n \\n\\n “Nay, but I must have time—to strengthen my heart! And we have arranged nothing yet—in regard to meeting again—no particulars. There is everything to be discussed before you go. This separation—how long is it to last?” Her voice and eyes were on the verge of tears. \\n\\n \\n\\n “Longer, dear, than I have the heart to tell!—Oh, sweet, forgive, forgive me! When I bargained for one blissful week, ’twas only of myself I thought—I weighed my happiness against only the price I was to pay. I considered not what you might feel—that a week might turn your fancy into love, and make our parting as cruel for you as for me. Forgive me, dearest, and charge the sin to my love of you—my unthinking, inconsiderate love!” \\n\\n \\n\\n “Nay, dear, there is nothing to forgive,” she said, with sorrowful compassion. “Parting will be hard—heaven knows it will!—but I must set my thoughts on our next meeting. The separation will be—somewhat long, do you say?—ah, that’s sad to hear. How long, Everell?” \\n\\n \\n\\n He turned his face from her. \\n\\n \\n\\n “Speak, Everell,” she pleaded; “how long?—a year?” \\n\\n \\n\\n “Longer than that,” he whispered. \\n\\n \\n\\n “Longer!—oh, pity me, heaven!” \\n\\n \\n\\n Besides the doors at either end of this dining-parlour, to the library and the hall, there was at one side a third, which led to the drawing-room. This door now opened, and Lady Strange appeared: seeing the lovers, she closed it gently behind her. They stood clinging to each other, with looks sorrowful and distraught. \\n\\n \\n\\n “You have told her, then?” she said, in a tone softened by compassion. \\n\\n \\n\\n “Almost,” replied Everell; and Georgiana began to sob. \\n\\n \\n\\n “My poor child,” said Lady Strange, “from my heart I grieve for you. Sir, we are all much to blame. Had we foreseen this a week ago!—Would that this week could be recalled, for the sake of this child’s happiness! I have pleaded with Foxwell; but he is determined to deliver you up.” \\n\\n \\n\\n “What!—deliver—” Georgiana became for a moment speechless; then uttered a scream, and was like to have fallen to the floor, had not Everell grasped her more tightly in his arms. \\n\\n \\n\\n “Heaven pity her!—my dear love!” \\n\\n \\n\\n “Why, then—did she not know?” cried Lady Strange. \\n\\n \\n\\n “Not the whole truth—only that I was going away.” \\n\\n \\n\\n He was about to carry Georgiana to a chair, but she suddenly regained her strength. \\n\\n \\n\\n “Deliver you up!” she said, excitedly. “My uncle shall not! You shall put it out of his power! Escape now, while you may! Go—we’ll meet again.” She essayed to push him toward the hall, keeping her glance the while on the drawing-room door by which her uncle might enter. \\n\\n \\n\\n “I cannot,” said Everell. “I’ve given him my word—’twas to purchase this week of love, sweet.” \\n\\n \\n\\n “Your word! He shall not claim it of you! Your word!—oh, heaven help me, you would keep your word though it broke my heart!—honour, you call it!—’tis men’s madness, women are no such fools!—Nay, forgive me, I would not love you else. But he shall not hold you to your word. He shall not deliver you up. He shall release you.” She broke from Everell’s clasp, and flung open the drawing-room door, calling, “Uncle! Uncle!” \\n\\n \\n\\n Foxwell appeared, with some playing cards in his hand. He was slightly pallid, and wore the frown of one to whom has fallen a vexation he has dreaded. \\n\\n \\n\\n “Uncle, you will not deliver him up? You will release him from his word? You will let him go free, will you not? ’Tis no gain to you that he should die. Speak!—uncle, tell me you’ll not deliver him up.” \\n\\n \\n\\n “My child, you do not understand these matters,” replied Foxwell, patiently resorting to a judicial softness of speech. “Mr. Everell himself, as a soldier, who assumed the chance of war and lost, knows what my duty is—knows I once even offered to forget that duty, had he but accepted the condition.” \\n\\n \\n\\n “Certainly I have but myself to blame,” said Everell. “For myself I make no complaint. For her, alas! my heart bleeds. I can but pray she will soon forget.” \\n\\n \\n\\n “Forget!” cried Georgiana. “Indeed, no! I say you shall not die, Everell. Uncle, I beg you, on my knees—his life! Sure you can’t be my kinsman and refuse—you can’t be a sharer of the same blood as flows in me, and be so cruel. Answer me, uncle!—you will spare him, will not you? You say you once offered to forget your duty: if you could forget it once, you can again, cannot you?” \\n\\n \\n\\n “‘UNCLE, I BEG YOU, ON MY KNEES—HIS LIFE!’” \\n\\n \\n\\n “Nay, ’tis not possible now, niece; circumstances have altered. ’Twould be useless for me to explain. I can only beg you to end this supplication, Georgiana,—it will not serve you. I am not to be moved. Mr. Everell will say whether I have dealt fairly with him—would have dealt more than fairly, had he but willed. ’Tis all vastly to be regretted. Had he chosen so a week since, your sorrow had been much less. Had you bestowed your confidence upon me when he first came here, you might have been spared all sorrow. As it is, events must take their course.” \\n\\n \\n\\n “Oh, my God, can one’s own kin be so heartless? To send him to death, who is more than life to me! What has he done?—what injury to you? He only fought for the prince in whose right he believed. Had his side won, he would have been merciful. What harm will it do you to let him go?—what harm to the kingdom, now the rebellion is put down? ’Tis profitless, ’tis needless, ’twill serve nothing, that he should die.—Oh, heaven, soften my uncle’s heart!—let him see as I see, feel as I feel!” \\n\\n \\n\\n Foxwell, little relishing these vehement appeals, or the sight of the kneeling girl with supplicating hands, turned to Everell: \\n\\n \\n\\n “Sir, this can accomplish nothing. I will leave you with her till the appointed time—though perhaps it were more kind to—” \\n\\n \\n\\n “No, no!” cried Georgiana, grasping her uncle’s coat-skirt as he made to step back into the drawing-room. “Do not go!—uncle, hear me! Anything for his life!—only his life! I will do anything, give anything—only that he may not die!” \\n\\n \\n\\n Foxwell looked down at her. The birth of a thought showed on his face, clearing away his frown of annoyance. Again he turned to Everell, and said, quietly: \\n\\n \\n\\n “Sir, will you grant me a few minutes alone with my niece? The time shall be made up after, if you choose.” \\n\\n \\n\\n Everell stood hesitating. \\n\\n \\n\\n “Go, Everell,” said Georgiana, eagerly; “’tis for our advantage.” \\n\\n \\n\\n “I pray it may be for yours, sweet,” replied Everell, gently, and went into the library, closing the door after him. \\n\\n \\n\\n Lady Strange, conceiving herself not wanted, would have passed Foxwell to retire to the drawing-room; but he softly closed that door, and said: \\n\\n \\n\\n “Nay, Lady Strange, don’t go. I had as lief you heard this. Georgiana, you ask for this gentleman’s life: now if that were all—” He paused for effect. \\n\\n \\n\\n “All!” echoed Georgiana, now risen to her feet; “’tis everything! I ask no more. You will grant it, then?—you will make me happy?” \\n\\n \\n\\n “If you would indeed be content with that—and his freedom—” Foxwell still seemed to halt in doubt. \\n\\n \\n\\n “I will be,” Georgiana declared, emphatically; “only say he shall live.” \\n\\n \\n\\n “If you would abandon any dreams you may have entertained of marriage—of future meetings with him—of correspondence, in the event of my saving him from the gallows—” \\n\\n \\n\\n “I will abandon whatever you require,—only to know that he goes free, only to feel that somewhere in the world he lives!” \\n\\n \\n\\n “Well,” said Foxwell, slowly, “I will let him go free—” \\n\\n \\n\\n Georgiana uttered a cry of joy. \\n\\n \\n\\n “—if,” continued Foxwell, “you will accept the proposal—the very advantageous proposal—which Mr. Thornby has done you the honour of making.” \\n\\n \\n\\n “Accept the proposal—of Mr. Thornby?” repeated Georgiana, in utter surprise. \\n\\n \\n\\n “Yes—give your consent to the marriage, of your own free will, letting it be clear that there has been no force or compulsion to influence you.” \\n\\n \\n\\n “But,” Georgiana faltered, looking distressedly toward the door by which Everell had left the room, “I cannot love Mr. Thornby.” \\n\\n \\n\\n “’Tis not absolutely necessary you should love him,” replied Foxwell, dryly. \\n\\n \\n\\n “Oh, no, no!” cried Georgiana, as her imagination fully mastered the case. “I cannot! ’Twould be like—’twould be horrible!” \\n\\n \\n\\n “’Twould be saving your Everell’s life,” said Foxwell, dispassionately. \\n\\n \\n\\n “’Tis an excellent match, dear,” put in Lady Strange, softly, “if Mr. Thornby’s estate is what I take it to be.” \\n\\n \\n\\n “Oh, but, Lady Strange,—you are a woman—you should understand.” \\n\\n \\n\\n “I do, child,” replied the elder lady, with an inward sigh, “but—these matters reconcile themselves in time. ’Twill not be so intolerable, believe me. And who knows—” Whatever it was that who knew, Lady Strange abruptly broke off to another line of thought. “The point is, to save your lover’s life, my dear.” \\n\\n \\n\\n “Ay,” said Foxwell, beginning to show impatience, “ere the opportunity is gone. Now lookye, Georgiana, I must hear your answer without more ado. I am going to have a horse saddled at once. It shall carry either your acceptance to Mr. Thornby, or word of this rebel to those who will not be slow in securing him. ’Tis for you to say which, and before many minutes.” \\n\\n \\n\\n Instead of calling a servant, Foxwell went out to the hall to give the order, consigning Georgiana by a look to the persuasions of Lady Strange. \\n\\n \\n\\n “Come, my dear,” said that lady, bending kindly over Georgiana, who had sunk weeping into a chair by the table; “’tis but marrying him you love not, for the sake of him you love.” \\n\\n \\n\\n “’Tis being false to him I love,” sobbed the girl. \\n\\n \\n\\n “False to him, but to save his life—a loyal kind of falseness, poor child!” \\n\\n \\n\\n She continued in this strain, though with no apparent effect upon Georgiana, who presently flung her arms upon the table and, bowing her head upon them, shook with weeping. In this attitude her uncle found her when he returned from ordering the horse. \\n\\n \\n\\n “Nay, persuade her no more, Lady Strange,” said he, testily. “God’s name, miss!—be true to your lover, if you think it so, and send him to die for your truth. I am going now to write a line for my messenger to carry. It might have been a line to Thornby, accompanied by a few words of your own inditing. But, as it cannot be so, it must be to those who want news of the rebel.” With that, Foxwell was about to go to the drawing-room. \\n\\n \\n\\n “No, no!” exclaimed Georgiana, rising to stop him. “I will consent—I will save the rebel. False to him, for love of him!—he will understand.” \\n\\n \\n\\n “Nay, but he is not to understand,” objected Foxwell. “He is to know nothing of this. Do you not see, he might rather give himself up than have you marry another?—might refuse to be saved by such means. For his own sake, he mustn’t know the condition. You had best not see him again: leave me to dismiss him. I make no doubt he will accept his liberty now for your sake, and agree to the voiding of our compact, whereof he has had near the full benefit. Best not see him: you might betray all.” \\n\\n \\n\\n “Not see him!” wept Georgiana. \\n\\n \\n\\n “’Tis best not. If he stand to our agreement and demand to see you, why, then, so it must be, and I know not what will ensue. Do not fear I shall misrepresent you to him. He shall know you have won his life by your pleading, upon condition he goes away forthwith—that is all. ’Tis agreed to, then?” \\n\\n \\n\\n “Yes,” said Georgiana, faintly; and added as if speaking to herself, “I shall know that somewhere he lives!” \\n\\n \\n\\n At this instant the door from the library opened, whereupon Foxwell looked around sharply, thinking Everell had taken it upon himself to reappear unbidden. But the intruder proved to be the waiting-woman Prudence, who had fallen asleep over her sewing while Georgiana was reading to Everell, and whom the lovers had left unnoticed in her corner. Having just now wakened, and seen Everell alone before the fireplace, looking strangely pale and excited, she had come forth in quest of her mistress. In obedience to Foxwell’s imperious motion, she shut the door, and hastened to the half-swooning niece. \\n\\n \\n\\n “Then,” said Foxwell to Georgiana, “I beg you will go to your room and write a brief letter to Mr. Thornby, informing him you accept his proposal of marriage, conditionally upon such terms as your representative—and so forth. Lady Strange will perhaps be so kind as to advise you in the wording—the form matters little, only let it be plain you act of your free will.” \\n\\n \\n\\n “Of my free will—yes,” murmured Georgiana, wearily, accepting the guidance of Lady Strange’s hand. \\n\\n \\n\\n “When the letter is finished, send it down to me straightway; and best keep to your room for the rest of the evening,” added Foxwell, as Lady Strange and the girl passed out to the hall. \\n\\n \\n\\n Prudence followed them up the stairs, but stopped for a moment outside Georgiana’s anteroom, to give oral expression to her feelings: “Marry Mr. Thornby! Oh, lor! What will the Jacumbite say to this, I wonder?” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1956/56109.html","bookId":748,"book":{"id":748,"title":"The Flight of Georgiana","description":"简介： A little before noon one gray day in September, 1746, a well-made young fellow, in appearance and fact a gentlemans servant, rode up the High Street of a town in the North of England, and through the passageway of an inn to the yard. Having entrusted...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1956","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
