{"id":111311,"no":1,"title":"Page 1","content":"FOLIO XI\n Judecca\n IF HE WAS ONCE AS BEAUTIFUL AS HE IS UGLY NOW,\n AND LIFTED UP HIS BROWS AGAINST HIS MAKER,\n WELL MAY ALL AFFLICTION COME FROM HIM.\n —DANTE, THE INFERNO\n Canto 1\n ONE\n I reach for the end, though the end will not reach for me.\n It has already reached for him.\n He is gone\n while I, locked in Judecca’s ice,\n If I could name the nameless thing\n My father burns, and living worms fall from his eyes.\n They spew from his sundered flesh.\n They pour from his open mouth.\n It burns, my father cries. It burns!\n His contagion, my inheritance.\n If I could face the faceless thing\n From the fire’s depths, I hear the discordant duet of their screams. I watch them dance in the final, fiery waltz.\n My mother and father, dancing in flames.\n If I could pull the two apart\n If I could untangle the knot\n Find one errant strand to tug\n And lay out the thing from end to end\n But there is no beginning nor ending nor anything in between\n Beginnings are endings\n And all endings are the same.\n Time is a line\n But we are circles.\n TWO\n After they died, I was taken to the constable’s house.\n Clutching my father’s gift to me, a tiny hat that reeked of wood smoke. And the constable’s wife washing my face with a cool cloth, and my voice silenced by the ones who dance in fire and the stench of their burning flesh and the crunch of ravenous red jaws and the naked stars above me as I ran. Red jaws, white eyes, and the worms that mocked the sacred temple: white worm, pale flesh, red jaws, white eyes.\n Their end my beginning.\n Time in a knot.\n And the evening and the morning were the first day.\n I hear his voice before I spy his face:\n I have come for the boy.\n And his shadow falling hard upon me. His face a cipher, his voice the manacles clamping down.\n Do you know who I am?\n Clenching the little hat to my chest.\n Nodding. Yes, I know who you are.\n You are the monstrumologist.\n You have no claim to him, Pellinore.\n And who else might, Robert? His father died in service to me. It is my debt. I did not ask for it, but I shall repay it or perish in the attempt.\n Forgive me, Pellinore, I do not wish to insult you, but my cat would make a better guardian. The orphanage . . .\n I will not see the only child of James Henry consigned to that horrible place. I shall claim the child, as unfortunate circumstances have now claimed his parents.\n Bending over me, shining a bright light into my eyes, the monstrumologist the shadow behind the light:\n He may be doomed; you’re right. In that case, his blood too will be on my hands.\n Those long, nimble fingers, pressing against my abdomen, beneath my jaw.\n But what shall you do with him, Pellinore? He is only a boy, hardly suited for your work—or whatever you call it.\n I shall make him suited.\n “You will sleep up here,” the monstrumologist said. “Where I slept when I was your age. I always found it a cozy little nook. What is your name again? William, yes? Or do you prefer Will? Here, give me that hat; you don’t need it at the moment. I’ll hang it on the peg here. Well? Why do you stare at me? Did you forget my question? Do I call you William or Will or which is it? Speak! What is your name?”\n “My name is William James Henry, sir.”\n “Hmm. That could prove rather unwieldy in a pinch. Could we shorten it a bit?”\n I turned my head away. There was a window above the attic bed, and through the window the stars turned in the night sky, the same unblinking eyes that had watched as I ran from the fiery beast that consumed them.\n “William . . . James . . . Henry,” I whispered. “Will.” Nearly choking, something caught in my throat. “James . . .” I tasted smoke. “Hen . . . Hen . . .”\n He sighed long and loud. “Well. I don’t suppose we must settle on a name tonight. Good night, Will—”\n “Henry!” I finished, and he took it as a decision, which it was not—and yet it was, for it had been decided.\n “Very well, then,” he said, nodding somberly, appreciating something that I could not. “Good night, Will Henry.”\n And the evening and the morning were the second day.\n He was a tall man, lean of frame, with dark, deep-set eyes that seemed to burn with their own backlit fire. Careless in appearance and forever, it seemed, in need of a shave and a trim. Even when still, he seemed to vibrate with hardly contained energy. He did not walk; he strode. He did not speak; he orated. Ordinary conversation—like almost every other ordinary thing—did not come naturally to him.\n “Your father was a steadfast companion, Will Henry, as discreet as he was loyal, so I doubt he spoke much about my work in your presence. The study of aberrant life forms is not something particularly well suited to children, though James said that you are a clever boy, in possession of a quick, if not particularly well-disciplined, mind. Well, I don’t require genius of you. I require but one thing, now and always: unquestioning, unhesitating, unwavering loyalty. My instructions must be followed to the letter, without fault, immediately. You will come to understand why as time goes along.”\n He drew me to his side. I flinched and tried to pull away as the needle came close.\n “Really? Afraid of needles? You shall have to overcome that fear—as well as nearly every other one—if you are to serve me. There are much greater things to fear in the divine creation than this little needle, Will Henry.”\n The name of my contagion scrawled in his nearly illegible hand upon the file beside his elbow. My blood smeared upon the glass slide. And a soft, self-satisfied grunt as he squinted at the sample through the magnifying lens.\n “Is it there? Do I have it too?”\n Worms spilling from my father’s bleeding eyes, boiling from his bleeding boils.\n “No. And yes. Would you like to see?”\n No.\n And yes.\n THREE\n When he spoke of it, and that was not often, he called it my “peculiar blessing.” His chief piece of advice was this:\n Never fall in love, Will Henry. Never. Love, marriage, family, all would be disastrous. The organism that lives within you, if the population remains stable and you do not suffer the fate of your father, will grant you unnaturally long life, long enough to see your children’s children pass into oblivion. Everyone you come to love is doomed to die before you. They will go, and you will go on.\n I took his advice to heart—for a little while, at least—until my heart betrayed me, as the heart will do.\n I still carry her picture, the one she gave me when I left her to follow the monstrumologist to the Isle of Blood. For luck, she had said. And for when you are lonely. It’s cracked and faded now, but over the years I have stared at it so many times that her face is indelibly stamped into my memory. I do not need to look at her to see her.\n Three years passed between the day she gave it to me and the evening when I saw her again. Three years: an eternity in the life of a sixteen-year-old. A blink of an eye for a resident of Judecca, trapped in the infernal ice.\n “I have determined that this will be my last pre-congress soiree,” Warthrop remarked on that night, raising his voice to be heard over the music. The band was not very good—it never was—but the food was abundant, and, to add to its irresistibility (for the doctor, at least), entirely free. He displayed a truly monstrous appetite when not on a case; like a wild animal Warthrop tended to gorge in preparation for leaner times. At the moment he was polishing off a platter of oysters, melted butter dripping from his freshly shaven (by me) chin.\n He waited for me to ask why and, when I declined, went on: “A roomful of dancing scientists! It would be humorous if it weren’t so painful to watch.”\n “I rather enjoy it,” I said. “It’s the one evening of the year when monstrumologists actually bathe.”\n “Ha! Well, you don’t act as if you are enjoying it, glowering in this corner as if you’ve lost your best friend.” Crinoline skirts trailed across the gleaming boards, hiding the delicate toes stepping quickly to avoid being squashed by the clumsy feet of dancing scientists. “Though I beg you to hold your temper in check until ten forty.” He checked his pocket watch. Warthrop had not won the pool in more than sixteen years—longer than I’d been alive—and clearly hoped his time had come. So desperate was he to win, I think, that cheating was not out of the question. Starting the fight himself would disqualify him from the pool, but there was nothing in the rules to prevent his faithful assistant from throwing the first punch.\n The lights sparking in the chandelier. The clinking of silver against porcelain. The red curtains and florid necks above stiff white collars and bare shoulders gleaming golden-skinned and bouquets in crystal vases and everywhere the scent of possibility, of unfulfilled promises and the way a woman’s hair falls against her back.\n “I have no temper to check,” I protested.\n Warthrop would have none of it. “You may be indecipherable to most, but not to me, Mr. Henry! You noticed her from the moment you walked through the door and haven’t taken your eyes off her since.”\n I looked him squarely in the eye and said, “That isn’t true.”\n He shrugged. “As you wish.”\n “I was a bit taken aback, that’s all. I thought she was in Europe.”\n “I was mistaken. Forgive me.”\n “She is a very annoying person and I don’t like her.”\n “More trouble than she’s worth, I agree.” He tipped back his head to down another oyster, his sixth. “Writing you long letters while she’s been away, each one requiring your response, taking up time better spent on your duties to me. I have nothing against women in general, but they can be quite . . .” Searching for the word. “Time-consuming.”\n She wore a purple gown with a matching ribbon in her hair, which she had let grow while she was away; it cascaded down her back in a waterfall of corkscrew curls. She was taller, thinner, a chubby little girl no longer. The sun has risen, I thought, rather incoherently.\n “It is the ancient call,” he murmured beside me. “The overarching imperative. And we alone have the ability to recognize it. And, by recognizing it, we can control it.”\n “I have no idea what you’re talking about,” I said.\n “I am speaking as a student of biology.”\n “Do you ever speak as anything else?” I asked crossly. I grabbed a glass of champagne from the tray of a passing waiter: my fourth. Warthrop shook his head. He never partook of spirits and considered those who did mentally, if not morally, weak.\n “Not any longer.” He smiled wanly. “But I was a poet once, as you may recall. Do you know the difference between science and art, Will?”\n “I am not as experienced as you in either,” I responded. “But my sense is you cannot reduce love to a biological necessity. It cheapens the one and demeans the other.”\n “Love, did you say?” He seemed astonished.\n “I am speaking in the abstract. I do not love Lilly Bates.” \n","sourceLink":"https://allnovel.net/the-final-descent-the-monstrumologist-4/page-1.html","bookId":2549,"book":{"id":2549,"title":"The Final Descent (The Monstrumologist #4)","description":"Storyline: \n The Final Descent (The Monstrumologist #4) \n Will Henry and Dr. Warthrop have encountered many horrors together—but can Will endure a monstrumological terror without his mentor? \n Will Henry has been through more that seems possible for a boy of fourteen. He’s been on the brink of death on more than one occasion, he has gazed into hell—and hell has stared back at him, and known his face. But through it all, Dr. Warthrop has been at his side. \n When Dr. Warthrop fears that Will’s loyalties may be shifting, he turns on Will with a fury, determined to reclaim his young apprentice’s devotion. And so Will must face one of the most horrific creatures of his monstrumology career—and he must face it alone. \n Over the course of one day, Will’s life—and Pellinor Warthrop’s destiny—will lie in balance. In the terrifying depths of the Monstrumarium, they will face a monster more terrible than any they could have imagined—and their fates will be decided.\n \n","cover":"https://allnovel.net/images/the-final-descent-the-monstrumologist-4.jpg","author":"Rick Yancey","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-final-descent-the-monstrumologist-4.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:20:17 AM"}}
