{"id":111326,"no":17,"title":"Page 17","content":"I could not go on. My thoughts would not hold still. It burns, it burns, and the worms that fell from his eyes and afraid of needles are you and what would you do, and Lilly, Lilly, do not suffer me to live past you, do not suffer me to see you suffer, and the thing in the jar and the thing in the thief his chest splitting open like the T. cerrejonensis shell splitting open and the unblinking amber eye, and the infestation this is my inheritance and each kiss the bullet, each kiss the dagger plunging home and I would die, I would die and never fall in love, Will Henry, never, never and the insubstantiality of water and she the cup, Lilly the vessel that bears the uncountable years, do not suffer do not suffer do not suffer. “Good-bye, William James Henry.” SIX A burly figure stepped from the shadows pooled at the base of the stairs. He wisely spoke up before I blew his misshapen head off his shoulders. “I say, put that gun away, old chum. It’s me, Isaacson.” “What are you doing in the Monstrumarium?” I snapped. “I thought your master’s work here was done.” He cocked his head inquisitively, like a crow eying a tasty bit of carrion. “I was told to meet you here.” “By whom? And to what purpose?” “Dr. von Helrung—to help in the disposal of the evidence.” “I don’t need any help.” “No? But many hands make light work.” “Yes, and too many cooks spoil the broth. Next inanity, please.” I brushed past him; he trailed behind. Stopped when I stopped at the storage closet for the bucket and mop. Stopped again at the sink while I stopped to fill the bucket. “I can’t help but feel that we got off on the wrong foot, Will. I really had no idea you even knew Lilly—she never mentioned you, at any rate, in all the time we’ve spent together in London.” “That’s odd. I’ve known her since we were children and we correspond regularly and she never mentioned you either.” “Do you think we’re being played for fools?” “I doubt it. Lilly likes a challenge.” He remained several paces behind me as I trudged with bucket and mop to the Locked Room. I could have found it with my eyes closed: The stench of decay increased with every step. “She’s a good girl, not like any other girl her age, in my experience. Fierce. Wouldn’t you say that’s the perfect word for her? Fierce?” “She is brimming with ferocity.” “Oh, she’s a capital girl, not anything like the girls from my country. So much more—how do I put it?—unrestrained.” I stopped. He stopped. If I brought the mop handle round against his swollen jaw, the blow would more than merely drop him; it would shatter the bone, imbedding the shards in his cheek and gums, perhaps his tongue. Permanent disfigurement would not be unexpected, and the odds of a life-threatening infection would not be out of the question. I could say we’d been waylaid by more thieves or that I had struck him down in self-defense. In the shadowy outlands of the world in which we lived, few would question my story. Von Helrung had articulated it: When I was younger, I often wondered if monstrumology brought out the darkness in men’s hearts or if it attracted men with hearts of darkness. “What is it?” Isaacson whispered. I shook my head and murmured, “Das Ungeheuer.” “What?” I turned back to him. His face was grotesque in the dim light, monstrous. “Do you know how it kills you, Isaacson? Not the bite; that’s to paralyze you, to separate your brain from your muscles. You don’t lose consciousness, however. You are fully aware of what’s happening as its jaw unhinges to accommodate you whole. You die slowly by asphyxiation; you suffocate to death because there’s no oxygen in its gut. But you’re alive long enough to feel the horrendous pressure that crushes your bones; you feel your rib cage breaking apart and the contents of your stomach being forced up through the esophagus, filling your mouth; you choke on your own vomit, and every inch of your body burns as if you’ve been dropped into a vat of acid, which, in a sense, you have been. You could think of it that way: a forty-foot sack of causticity, the anti-womb of your conception.” He said nothing for a long moment. Then he whispered, “You’re mad.” And I replied, “I don’t know what that means. If you define madness as the opposite of sane, you are forced into providing a definition of sanity. Can you define it? Can you tell me what it is to be sane? Is it to hold no beliefs that are contrary to reality? That our thoughts and actions contain no absurd contractions? For example, the hypocrisy of believing that killing is the ultimate sin while we slaughter each other by the thousands? To believe in a just and loving God while suffering that is imaginable only to God goes on and on and on? If that is your criterion, then we are all mad—except those of us who make no claim to understand the difference. Perhaps there is no difference, except in our own heads. In other words, Isaacson, madness is a wholly human malady borne in a brain too evolved—or not quite evolved enough—to bear the awful burden of its own existence.” I forced myself to stop; I was enjoying myself too much. “I can’t be absolutely certain, Henry,” he said. “But I believe you’ve just proved my point.” “How long have you been Sir Hiram’s apprentice, Isaacson?” I asked. “Nine months. Why do you ask?” “You haven’t been at it long enough.” “Long enough for what?” I continued down the corridor. His voice scampered along the winding passageway, chasing me. “Henry! Long enough for what?” The metal bucket would be better, I thought. It was heavier. I pictured it smashing into the side of his head. Unrestrained. Ha! He turned the corner after me and drew up short of the body sprawled before the Locked Room. Frantically, he dug into his coat pocket for a handkerchief. He pressed the starched white fabric against his face, gagging at the smell that hung in the still air like a noxious fog. “Where is that man’s face?” he choked out, eyes cutting away, cutting back again: the urge to turn aside, the compulsion to look, the unspooling of the coiled thing, the nameless not-me, das Ungeheuer. “All around you. I believe you are standing in some of it.” He wasn’t. But my “observation” caused him to stumble backward, hand clamped tight against the handkerchief. I set down the bucket, leaned the mop against the wall, and went to the stack of empty crates on the other side of the door. “Allow me to hazard a guess about your studies in the dark art of monstrumology, Isaacson. For the past nine months you have been ensconced in some musty library in Sir Hiram’s ancestral home, your nose buried in arcane texts and obscure treatises, far from the field or the laboratory.” He nodded quickly. “How did you know?” I was shoving crates around, looking for the proper size. I tossed the smaller ones aside; they smacked against the hard floor with a satisfying wallop. “Well, this is unfortunate,” I told him. “There’s none quite large enough, and these are the only empties I know of. I’m sure there are larger ones somewhere down here, but I’ll be damned if I’m going to hunt half the night for them.” I looked over at him and said very deliberately, “We’ll have to size him to fit.” “S-size him?” “Adolphus keeps the instruments in his office. A long black case beneath the worktable against the right wall, going in.” “A long black case . . . ?” “Beneath the worktable—the right wall—as you face the desk. Well, Isaacson, what are you waiting for? Many hands make light work. Snap to!” I was still chuckling to myself when he returned lugging the instrument case. He had tied the handkerchief around his face like a bandit. I motioned him to drop the case beside the body. He leaned against the wall; I could hear him breathing through his mouth, and the makeshift mask billowed with each shallow breath. “The boxes are not long, but they’re fairly deep,” I said, throwing back the lid. It clanged against the floor, causing him to jump. “We can fold the arms if he isn’t too stiff, so just the legs, I think, which we’ll lay on top.” “On top?” “Of him.” I pulled the saw from its compartment and ran the pad of my thumb along its serrated edge. Wickedly sharp. Next the shears, which I clicked open and shut several times. With each snick-snick Isaacson flinched. “All right, Isaacson,” I said briskly. “Let’s get these trouser legs off.” He didn’t move an inch. His face had turned the color of the handkerchief. “Can you tell me the difference between a monstrumologist and a ghoul?” I asked. He shook his head soundlessly, wide-eyed, watching me cut away the trousers, exposing the pale leg beneath. “No?” I sighed. “I was hoping one day to find someone who could.” I explained that it was a simple below-the-knee amputation as I forced the man’s heel back toward his rump, raising the knee several inches off the ground. “Both hands firmly around the ankle, Isaacson, so it doesn’t sway on me. The blade is very sharp, and I shall hold you responsible if I cut myself.” The pale flesh parting like a mouth coming open and the bloody drool dripping and the protesting whine of bone when the blade bites. I don’t know what he was expecting, but when the leg came free in his hand, Isaacson gave a strangled cry and flung the limb away; it smacked into the wall with a sickening thunk. He scuttled a few feet on his hands and knees. His back arched, and I thought, There is only one smell on earth worse than death, and that’s vomit. I rested for a moment, studying my blood-encrusted fingernails. Why hadn’t I thought to bring along some gloves? “It isn’t going to work, you know,” I said quietly. “What?” he gasped, wiping his mouth with the handkerchief. He eyed it with dismay: Now what would he do? “It might have, if he had picked Rojas—or even von Helrung; the old man isn’t as quick as he used to be. But Pellinore Warthrop is the last one I would choose to hoodwink.” “I don’t know what the bloody hell you’re talking about, Henry.” “Not that he couldn’t be hoodwinked—he has blind spots like any man—but the fact is Pellinore Warthrop is no ordinary man: He is the prince of aberrant biology, and you remember your Machiavelli, don’t you?” “Oh, bugger off.” He waved his hanky in my direction. “You’ve gone daft.” “He’ll find you out, both of you, and what do you think will happen to you when he does? You’ve said it yourself: ‘Warthrop’s attack dog.’ You know what happened in Aden. You know about the Isle of Blood.” “Is that a threat? Are you threatening me, Henry?” He did not seem afraid. I found his incredulous reaction curious. “It was Hiram Walker who sent the prize to him. So he would bring it here. So Walker could steal it back again, sweetening his profit with a heaping spoonful of humiliation and revenge. Am I not correct? Tell me the truth and I’ll spare you. I make no promises regarding your master, but you have my word as a scientist and a gentleman that I won’t touch a hair on your slightly misshapen head.”","sourceLink":"https://allnovel.net/the-final-descent-the-monstrumologist-4/page-17.html","bookId":2549,"book":{"id":2549,"title":"The Final Descent (The Monstrumologist #4)","description":"Storyline: The Final Descent (The Monstrumologist #4) Will Henry and Dr. Warthrop have encountered many horrors together—but can Will endure a monstrumological terror without his mentor? Will Henry has been through more that seems possible for a boy of fourteen. He’s been on the brink of death on more than one occasion, he has gazed into hell—and hell has stared back at him, and known his face. But through it all, Dr. Warthrop has been at his side. When Dr. Warthrop fears that Will’s loyalties may be shifting, he turns on Will with a fury, determined to reclaim his young apprentice’s devotion. And so Will must face one of the most horrific creatures of his monstrumology career—and he must face it alone. Over the course of one day, Will’s life—and Pellinor Warthrop’s destiny—will lie in balance. In the terrifying depths of the Monstrumarium, they will face a monster more terrible than any they could have imagined—and their fates will be decided.","cover":"https://allnovel.net/images/the-final-descent-the-monstrumologist-4.jpg","author":"Rick Yancey","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-final-descent-the-monstrumologist-4.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:20:17 AM"}}
