{"id":11933,"no":5,"title":"Book IV","content":"3. Sylvia emerged upon the “gallery,” clad in dainty pink muslin, her beautiful shiny hair arranged under a semi-invalid’s cap of pink maline. Her face was pale, and the big red-brown eyes were hollow; but she was quiet, and apparently mistress of herself again. She even humoured Aunt Varina by leaning slightly upon her feeble arm, while the maid hastened to place her chair in a shaded spot. Her husband came, and the doctors; the tea-things were brought, and Aunt Varina poured tea, a-flutter with excitement. They talked about the comparative temperatures of New York and the Florida Keys, and about hedges of jasmine to shade the gallery from the evening sun. And after a while, Aunt Varina arose, explaining that she would prepare Elaine for her father’s visit. In the doorway she stood for a moment, smiling upon the pretty picture; it was all settled now—the outward forms had been observed, and the matter would end, as such matters should end between husband and wife—a few tears, a few reproaches, and then a few kisses. The baby was made ready, with a new dress, and a fresh silk bandage to cover the pitiful, lifeless eyes. Aunt Varina had found pleasure in making these bandages; she made them soft and pretty—less hygienic, perhaps, but avoiding the suggestion of the hospital. When Sylvia and her husband came into the room, the faces of both of them were white. Sylvia stopped near the door-way; and poor Aunt Varina fluttered about, in agony of soul. When van Tuiver went to the cradle, she hurried to his side, and sought to awaken the little one with gentle nudges. Quite unexpectedly to her, van Tuiver sought to pick up the infant; she helped him, and he stood, holding it awkwardly, as if afraid it might go to pieces in his arms. So any man might appear, with his first infant; but to Sylvia it seemed the most tragic sight she had ever seen in her life. She gave a low cry, “Douglas!” and he turned, and she saw his face was working with the feeling he was ashamed for anyone to see. “Oh, Douglas,” she whispered, “I’m so sorry for you!” At which Aunt Varina decided that it was time for her to make her escape. 4. But the trouble between these two were not such as could be settled by any burst of emotion. The next day they were again in a dispute, for he had come to ask her word of honour that she would never see me again, and would give him my letters to be returned unopened. This last was what she had let her father do in the case of Frank Shirley; and she had become certain in her own mind that she had done wrong. But he was insistent in his demand; declaring that it should be obvious to her there could be no peace of mind for him so long as my influence continued in her life. “But surely,” protested Sylvia, “to hear Mary Abbott’s explanation——” “There can be no explanation that is not an insult to your husband, and to those who are caring for you. I am speaking in this matter not merely for myself, but for your physicians, who know this woman, heard her menaces and her vulgarity. It is their judgment that you should be protected at all hazards from further contact with her.” “Douglas,” she argued, “you must realize that I am in distress of mind about this matter——” “I certainly realize that.” “And if you are thinking of my welfare, you should choose a course that would set my mind at rest. But when you come to me and ask me that I should not even read a letter from my friend—don’t you realize what you suggest to me, that there is something you are afraid for me to know?” “I do not attempt to deny my fear of this woman. I have seen how she has been able to poison your mind with suspicions——” “Yes, Douglas—but now that has been done. What else is there to fear from her?” “I have no idea what. She is a bitter, jealous woman, with a mind full of hatred; and you are an innocent girl, who cannot judge about these matters. What idea have you of the world in which you live, of the slanders to which a man in your husband’s position is exposed?” “I am not quite such a child as that——” “You have simply no idea, I tell you. I remember your consternation when we first met, and I told you about the woman who had written me a begging letter, and got an interview with me, and then started screaming, and refused to leave the house till I had paid her a lot of money. You had never heard such stories, had you? Yet it is the kind of thing that is happening to rich men continually; it was one of the first rules I was taught, never to let myself be alone with a strange woman, no matter of what age, or under what circumstances.” “But, I assure you, I would not listen to such people——” “You are asking right now to listen! And you would be influenced by her—you could not help it, any more than you can help being distressed about what she has already said. She intimated to Dr. Perrin that she believed that I had been a man of depraved life, and that my wife and child were now paying the penalty. How can I tell what vile stories concerning me she may not have heard? How could I have any peace of mind while I knew that she was free to pour them into your ear?” Sylvia sat dumb with questions she would not utter, hovering on the tip of her tongue. He took her silence for acquiesence, and went on, quickly, “Let me give you an illustration. A friend of mine whom you know well—I might as well tell you his name, it was Freddie Atkins—was at supper with some theatrical women; and one of them, not having any idea that Freddie knew me, proceeded to talk about me, and how she had met me, and where we had been together—about my yacht, and my castle in Scotland, and I don’t know what all else. It seems that this woman had been my mistress for several years; she told quite glibly about me and my habits. Freddie got the woman’s picture, on some pretext or other, and brought it to me; I had never laid eyes on her in my life. He could hardly believe it, and to prove it to him I offered to meet the woman, under another name. We sat in a restaurant, and she told the tale to Freddie and myself together—until finally he burst out laughing, and told her who I was.” He paused, to let this sink in. “Now, suppose your friend, Mary Abbott, had met that woman! I don’t imagine she is particularly careful whom she associates with; and suppose she had come and told you that she knew such a woman—what would you have said? Can you deny that the tale would have made an impression on you? Yet, I’ve not the least doubt there are scores of women who made such tales about me a part of their stock in trade; there are thousands of women whose fortunes would be made for life if they could cause such a tale to be believed. And imagine how well-informed they would be, if anyone were to ask them concerning my habits, and the reason why our baby is blind! I tell you, when the rumour concerning our child has begun to spread, there will be ten thousand people in New York city who will know of first-hand, personal knowledge exactly how it happened, and how you took it, and everything that I said to you about it. There will be sneers in the society-papers, from New York to San Francisco; and smooth-tongued gentlemen calling, to give us hints that we can stop these sneers by purchasing a de-luxe edition of a history of our ancestors for six thousand dollars. There will be well-meaning and beautiful-souled people who will try to get you to confide in them, and then use their knowledge of your domestic unhappiness to blackmail you; there will be threats of law-suits from people who will claim that they have contracted a disease from you or your child—your laundress, perhaps, or your maid, or one of these nurses——” “Oh, stop! stop!” she cried. “I am quite aware,” he said, quietly, “that these things are not calculated to preserve the peace of mind of a young mother. You are horrified when I tell you of them—yet you clamour for the right to have Mrs. Abbott tell you of them! I warn you, Sylvia—you have married a rich man, who is exposed to the attacks of cunning and unscrupulous enemies. You, as his wife, are exactly as much exposed—possibly even more so. Therefore when I see you entering into what I know to be a dangerous intimacy, I must have the right to say to you, This shall stop, and I tell you, there can never be any safety or peace of mind for either of us, so long as you attempt to deny me that right.” 5. Dr. Gibson took his departure three or four days later; and before he went, he came to give her his final blessing; talking to her, as he phrased it, “like a Dutch uncle.” “You must understand,” he said, “I am almost old enough to be your grandfather. I have four sons, anyone of whom might have married you, if they had had the good fortune to be in Castleman County at the critical time. So you must let me be frank with you.” Sylvia indicated that she was willing. “We don’t generally talk to women about these matters; because they’ve no standard by which to judge, and they almost always fly off and have hysterics. Their case seems to them exceptional and horrible, their husbands the blackest criminals in the whole tribe.” He paused for a moment. “Now, Mrs. van Tuiver, the disease which has made your baby blind is probably what we call gonorrhea. When it gets into the eyes, it has very terrible results. But it doesn’t often get into the eyes, and for the most part it’s a trifling affair, that we don’t worry about. I know there are a lot of new-fangled notions, but I’m an old man, with experience of my own, and I have to have things proven to me. I know that with as much of this disease as we doctors see, if it was a deadly disease, there’d be nobody left alive in the world. As I say, I don’t like to discuss it with women; but it was not I who forced the matter upon your attention——” “Pray go on, Dr. Gibson,” she said. “I really wish to know all that you will tell me.” “The question has come up, how was this disease brought to your child? Dr. Perrin suggested that possibly he—you understand his fear; and possibly he is correct. But it seems to me an illustration of the unwisdom of a physician’s departing from his proper duty, which is to cure people. If you wish to find out who brought a disease, what you need is a detective. I know, of course, that there are people who can combine the duties of physician and detective—and that without any previous preparation or study of either profession.” He waited for this irony to sink in; and Sylvia also waited, patiently. At last he resumed, “The idea has been planted in your mind that your husband brought the trouble; and that idea is sure to stay there and fester. So it becomes necessary for someone to talk to you straight. Let me tell you that eight men out of ten have had this disease at some time in their lives; also that very few of them were cured of it when they thought they were. You have a cold: and then next month, you say the cold is gone. So it is, for practical purposes. But if I take a microscope, I find the germs of the cold still in your membranes, and I know that you can give a cold, and a bad cold, to some one else who is sensitive. It is true that you may go through all the rest of your life without ever being entirely rid of that cold. You understand me?” “Yes,” said Sylvia, in a low voice. “I say eight out of ten. Estimates would differ. Some doctors would say seven out of ten—and some actual investigations have shown nine out of ten. And understand me, I don’t mean bar-room loafers and roustabouts. I mean your brothers, if you have any, your cousins, your best friends, the men who came to make love to you, and whom you thought of marrying. If you had found it out about any one of them, of course you’d have cut the acquaintance; yet you’d have been doing an injustice—for if you had done that to all who’d ever had the disease, you might as well have retired to a nunnery at once.” The old gentleman paused again; then frowning at her under his bushy eye-brows, he exclaimed, “I tell you, Mrs. van Tuiver, you’re doing your husband a wrong. Your husband loves you, and he’s a good man—I’ve had some talks with him, and I know he’s not got nearly so much on his conscience as the average husband. I’m a Southern man, and I know these gay young bloods you’ve danced and flirted with all your young life. Do you think if you went probing into their secret affairs, you’d have had much pleasure in their company afterwards? I tell you again, you’re doing your husband a wrong! You’re doing something that very few men would stand, as patiently as he has stood it so far.” All this time Sylvia had given no sign. So the old gentleman began to feel a trifle uneasy. “Mind you,” he said, “I’m not saying that men ought to be like that. They deserve a good hiding, most of them—they’re very few of them fit to associate with a good woman. I’ve always said that no man is really good enough for a good woman. But my point is that when you select one to punish, you select not the guiltiest one, but simply the one who’s had the misfortune to fall under suspicion. And he knows that’s not fair; he’d have to be more than human if deep in his soul he did not bitterly resent it. You understand me?” “I understand,” she replied, in the same repressed voice. And the doctor rose and laid his hand on her shoulder. “I’m going home,” he said—“very probably we’ll never meet each other again. I see you making a great mistake, laying up unhappiness for yourself in the future; and I wish to prevent it if I can. I wish to persuade you to face the facts of the world in which we live. So I am going to tell you something that I never expected I should tell to a lady.” He was looking her straight in the eye. “You see me—I’m an old man, and I seem fairly respectable to you. You’ve laughed at me some, but even so, you’ve found it possible to get along with me without too great repugnance. Well, I’ve had this disease; I’ve had it, and nevertheless I’ve raised six fine, sturdy children. More than that—I’m not free to name anybody else, but I happen to know positively that among the men your husband employs on this island there are two who have the disease right now. And the next charming and well-bred gentleman you are introduced to, just reflect that there are at least eight chances in ten that he has had the disease, and perhaps three or four in ten that he has it at the minute he’s shaking hands with you. And now you think that over, and stop tormenting your poor husband!” 6. One of the first things I did when I reached New York was to send a little love-letter to Sylvia. I said nothing that would distress her; I merely assured her that she was in my thoughts, and that I should look to see her in New York, when we could have a good talk. I put this in a plain envelope, with a typewritten address, and registered it in the name of my stenographer. The receipt came back, signed by an unknown hand, probably the secretary’s. I found out later that the letter never got to Sylvia. No doubt it was the occasion of renewed efforts upon her husband’s part to obtain from her the promise he desired. He would not be put off with excuses; and at last he got her answer, in the shape of a letter which she told him she intended to mail to me. In this letter she announced her decision that she owed it to her baby to avoid all excitement and nervous strain during the time that she was nursing it. Her husband had sent for the yacht, and they were going to Scotland, and in the winter to the Mediterranean and the Nile. Meantime she would not correspond with me; but she wished me to know that there was to be no break in our friendship, and that she would see me upon her return to New York. “There is much that has happened that I do not understand,” she added. “For the present, however, I shall try to dismiss it from my mind. I am sure you will agree that it is right for me to give a year to being a mother; as I wish you to feel perfectly at peace in the meantime, I mention that it is my intention to be a mother only, and not a wife. I am showing this letter to my husband before I mail it, so that he may know exactly what I am doing, and what I have decided to do in the future.” “Of course,” he said, after reading this, “you may send the letter, if you insist—but you must realize that you are only putting off the issue.” She made no reply; and at last he asked, “You mean you intend to defy me in this matter?” “I mean,” she replied, quietly, “that for the sake of my baby I intend to put off all discussion for a year.” 7. I figured that I should hear from Claire Lepage about two days after I reached New York; and sure enough, she called me on the ‘phone. “I want to see you at once,” she declared; and her voice showed the excitement under which she was labouring. “Very well,” I said, “come down.” She entered my little living-room. It was the first time she had ever visited me, but she did not stop for a glance about her; she did not even stop to sit down. “Why didn’t you tell me that you knew Sylvia Castleman?” she cried. “My dear woman,” I replied, “I was not under the least obligation to tell you.” “You have betrayed me!” she exclaimed, wildly. “Come, Claire,” I said, after I had looked her in the eye a bit to calm her. “You know quite well that I was under no bond of secrecy. And, besides, I haven’t done you any harm.” “Why did you do it?” I regret to add that she swore. “I never once mentioned your name, Claire.” “How much good do you imagine that does me? They have managed to find out everything. They caught me in a trap.” I reminded myself that it would not do to show any pity for her. “Sit down, Claire,” I said. “Tell me about it.” She cried, in a last burst of anger, “I don’t want to talk to you!” “All right,” I answered. “But then, why did you come?” There was no reply to that. She sat down. “They were too much for me!” she lamented. “If I’d had the least hint, I might have held my own. As it was—I let them make a fool of me.” “You are talking hieroglyphics to me. Who are ‘they’?” “Douglas, and that old fox, Rossiter Torrance.” “Rossiter Torrance?” I repeated the name, and then suddenly remembered. The thin-lipped old family lawyer! “He sent up his card, and said he’d been sent to see me by Mary Abbot. Of course, I had no suspicion—I fell right into the trap. We talked about you for a while—he even got me to tell him where you lived; and then at last he told me that he hadn’t come from you at all, but had merely wanted to find out if I knew you, and how intimate we were. He had been sent by Douglas; and he wanted to know right away how much I had told you about Douglas, and why I had done it. Of course, I denied that I had told anything. Heavens, what a time he gave me!” Claire paused. “Mary, how could you have played such a trick upon me?” “I had no thought of doing you any harm,” I replied. “I was simply trying to help Sylvia.” “To help her at any expense!” “Tell me, what will come of it? Are you afraid they’ll cut off your allowance?” “That’s the threat.” “But will they carry it out?” She sat, gazing at me resentfully. “I don’t know whether I ought to trust you any more,” she said. “Do what you please about that,” I replied. “I don’t want to urge you.” She hesitated a bit longer, and then decided to throw herself upon my mercy. They would not dare to carry out their threat, so long as Sylvia had not found out the whole truth. So now she had come to beg me to tell no more than I had already told. She was utterly abject about it. I had pretended to be her friend, I had won her confidence and listened to her confessions; how did I wish to ruin her utterly, to have her cast out on the street? Poor Claire! I said in the early part of my story that she understood the language of idealism; but I wonder what I have told about her that justifies this. The truth is, she was going down so fast that already she seemed a different person; and she had been frightened by the thin-lipped old family lawyer, so that she was incapable of even a decent pretence. “Claire,” I said, “there is no need for you to go on like this. I have not the slightest intention of telling Sylvia about you. I cannot imagine the circumstances that would make me want to tell her. Even if I should do it, I would tell her in confidence, so that her husband would never have any idea——” She went almost wild at this. To imagine that a woman would keep such a confidence! As if she would not throw it at her husband’s head the first time they quarreled! Besides, if Sylvia knew this truth, she might leave him; and if she left him, Claire’s hold on his money would be gone. Over this money we had a long and lachrymose interview. And at the end of it, there she sat gazing into space, baffled and bewildered. What kind of a woman was I? How had I got to be the friend of Sylvia van Tuiver? What had she seen in me, and what did I expect to get out of her? I answered briefly; and suddenly Claire was overwhelmed by a rush of curiosity—plain human curiosity. What was Sylvia like? Was she as clever as they said? What was the baby like, and how was Sylvia taking the misfortune? Could it really be true that I had been visiting the van Tuivers in Florida, as old Rossiter Torrance had implied? Needless to say, I did not answer these questions freely. And I really think my visitor was more pained by my uncommunicativeness than she was by my betrayal of her. It was interesting also to notice a subtle difference in her treatment of me. Gone was the slight touch of condescension, gone was most of the familiarity! I had become a personage, a treasurer of high state secrets, an intimate of the great ones! There must be something more to me than Claire had realized before! Poor Claire! She passes here from this story. For years thereafter I used to catch a glimpse of her now and then, in the haunts of the birds of gorgeous plumage; but I never got a chance to speak to her, nor did she ever call on me again. So I do not know if Douglas van Tuiver still continues her eight thousand a year. All I can say is that when I saw her, her plumage was as gorgeous as ever, and its style duly certified to the world that it had not been held over from a previous season of prosperity. Twice I thought she had been drinking too much; but then—so had many of the other ladies with the little glasses of bright-coloured liquids before them. 8. For the rest of that year I knew nothing about Sylvia except what I read in the “society” column of my newspaper—that she was spending the late summer in her husband’s castle in Scotland. I myself was suffering from the strain of what I had been through, and had to take a vacation. I went West; and when I came back in the fall, to plunge again into my work, I read that the van Tuivers, in their yacht, the “Triton,” were in the Mediterranean, and were planning to spend the winter in Japan. And then one day in January, like a bolt from the blue, came a cablegram from Sylvia, dated Cairo: “Sailing for New York, Steamship ‘Atlantic,’ are you there, answer.” Of course I answered. And I consulted the sailing-lists, and waited, wild with impatience. She sent me a wireless, two days out, and so I was at the pier when the great vessel docked. Yes, there she was, waving her handkerchief to me; and there by her side stood her husband. It was a long, cold ordeal, while the ship was warped in. We could only gaze at each other across the distance, and stamp our feet and beat our hands. There were other friends waiting for the van Tuivers, I saw, and so I held myself in the background, full of a thousand wild speculations. How incredible that Sylvia, arriving with her husband, should have summoned me to meet her! At last the gangway was let down, and the stream of passengers began to flow. In time came the van Tuivers, and their friends gathered to welcome them. I waited; and at last Sylvia came to me—outwardly calm—but with her emotions in the pressure of her two hands. “Oh, Mary, Mary!” she murmured. “I’m so glad to see you! I’m so glad to see you!” “What has happened?” I asked. Her voice went to a whisper. “I am leaving my husband.” “Leaving your husband!” I stood, dumbfounded. “Leaving him for ever, Mary.” “But—but——” I could not finish the sentence. My eyes moved to where he stood, calmly chatting with his friends. “He insisted on coming back with me, to preserve appearances. He is terrified of the gossip. He is going all the way home, and then leave me.” “Sylvia! What does it mean?” I whispered. “I can’t tell you here. I want to come and see you. Are you living at the same place?” I answered in the affirmative. “It’s a long story,” she added. “I must apologise for asking you to come here, where we can’t talk. But I did it for an important reason. I can’t make my husband really believe that I mean what I say; and you are my Declaration of Independence!” And she laughed, but a trifle wildly, and looking at her suddenly, I realized that she was keyed almost to the breaking point. “You poor dear!” I murmured. “I wanted to show him that I meant what I said. I wanted him to see us meet. You see, he’s going home, thinking that with the help of my people he can make me change my mind.” “But why do you go home? Why not stay here with me? There’s an apartment vacant next to mine.” “And with a baby?” “There are lots of babies in our tenement,” I said. But to tell the truth, I had almost forgotten the baby in the excitement of the moment. “How is she,” I asked. “Come and see,” said Sylvia; and when I glanced enquiringly at the tall gentleman who was chatting with his friends, she added, “She’s my baby, and I have a right to show her.” The nurse, a rosy-cheeked English girl in a blue dress and a bonnet with long streamers, stood apart, holding an armful of white silk and lace. Sylvia turned back the coverings; and again I beheld the vision which had so thrilled me—the comical little miniature of herself—her nose, her lips, her golden hair. But oh, the pitiful little eyes, that did not move! I looked at my friend, uncertain what I should say; I was startled to see her whole being aglow with mother-pride. “Isn’t she a dear?” she whispered. “And, Mary, she’s learning so fast, and growing—you couldn’t believe it!” Oh, the marvel of mother-love, I thought—that is blinder than any child it ever bore! We turned away; and Sylvia said, “I’ll come to you as soon as I’ve got the baby settled. Our train starts for the South to-night, so I shan’t waste any time.” “God bless you, dear,” I whispered; and she gave my hand a squeeze, and turned away. I stood for a few moments watching, and saw her approach her husband, and exchange a few smiling words with him in the presence of their friends. I, knowing the agony that was in the hearts of that desperate young couple, marvelled anew at the discipline of caste. 9. She sat in my big arm-chair; and how proud I was of her, and how thrilled by her courage. Above all, however, I was devoured by curiosity. “Tell me!” I exclaimed. “There’s so much,” she said. “Tell me why you are leaving him.” “Mary, because I don’t love him. That’s the one reason. I have thought it out—I have thought of little else for the last year. I have come to see that it is wrong for a woman to live with a man she does not love. It is the supreme crime a woman can commit.” “Ah, yes!” I said. “If you have got that far!” “I have got that far. Other things have contributed, but they are not the real things—they might have been forgiven. The fact that he had this disease, and made my child blind——” “Oh! You found out that?” “Yes, I found it out.” “How?” “It came to me little by little. In the end, he grew tired of pretending, I think.” She paused for a moment, then went on, “The trouble was over the question of my obligations as a wife. You see, I had told him at the outset that I was going to live for my baby, and for her alone. That was the ground upon which he had persuaded me not to see you or read any of your letters. I was to ask no questions, and be nice and bovine—and I agreed. But then, a few months ago, my husband came to me with the story of his needs. He said that the doctors had given their sanction to our reunion. Of course, I was stunned. I knew that he had understood me before we left Florida.” She stopped. “Yes, dear,” I said, gently. “Well, he said now the doctors were agreed there was no danger to either of us. We could take precautions and not have children. I could only plead that the whole subject was distressing to me. He had asked me to put off my problems till my baby was weaned; now I asked him to put off his. But that would not do, it seemed. He took to arguing with me. It was an unnatural way to live, and he could not endure it. I was a woman, and I couldn’t understand this. It seemed utterly impossible to make him realize what I felt. I suppose he has always had what he wanted, and he simply does not know what it is to be denied. It wasn’t only a physical thing, I think; it was an affront to his pride, a denial of his authority.” She stopped, and I saw her shudder. “I have been through it all,” I said. “He wanted to know how long I expected to withhold myself. I said, ‘Until I have got this disease out of my mind, as well as out of my body; until I know that there is no possibility of either of us having it, to give to the other.’ But then, after I had taken a little more time to think it over, I said, ‘Douglas, I must be honest with you. I shall never be able to live with you again. It is no longer a question of your wishes or mine—it is a question of right or wrong. I do not love you. I know now that it can never under any circumstances be right for a woman to give herself in the intimacy of the sex-relation without love. When she does it, she is violating the deepest instinct of her nature, the very voice of God in her soul.’ “His reply was, ‘Why didn’t you know that before you married?’ “I answered, ‘I did not know what marriage meant; and I let myself be persuaded by others.’ “‘By your own mother!’ he declared. “I said, ‘A mother who permits her daughter to commit such an offence is either a slave-dealer, or else a slave.’ Of course, he thought I was out of my mind at that. He argued about the duties of marriage, the preserving of the home, wives submitting themselves to their husbands, and so on. He would not give me any peace——” And suddenly she started up. I saw in her eyes the light of old battles. “Oh, it was a horror!” she cried, beginning to pace the floor. “It seemed to me that I was living the agony of all the loveless marriages of the world. I felt myself pursued, not merely by the importunate desires of one man—I suffered with all the millions of women who give themselves night after night without love! He came to seem like some monster to me; I could not meet him unexpectedly without starting. I forbade him to mention the subject to me again, and for a long time he obeyed. But several weeks ago he brought it up afresh, and I lost my self-control completely. ‘Douglas,’ I said, ‘I can stand it no longer! It is not only the tragedy of my blind child—it’s that you have driven me to hate you. You have crushed all the life and joy and youth out of me! You’ve been to me like a terrible black cloud, constantly pressing down on me, smothering me. You stalk around me like a grim, sepulchral figure, closing me up in the circle of your narrow ideas. But now I can endure it no longer. I was a proud, high-spirited girl, you’ve made of me a colourless social automaton, a slave of your stupid worldly traditions. I’m turning into a feeble, complaining, discontented wife! And I refuse to be it. I’m going home—where at least there’s some human spontaneity left in people; I’m going back to my father!’—And I went and looked up the next steamer!” She stopped. She stood before me, with the fire of her wild Southern blood shining in her cheeks and in her eyes. I sat waiting, and finally she went on, “I won’t repeat all his protests. When he found that I was really going, he offered to take me in the yacht, but I wouldn’t go in the yacht. I had got to be really afraid of him—sometimes, you know, his obstinacy seems to be abnormal, almost insane. So then he decided he would have to go in the steamer with me to preserve appearances. I had a letter saying that papa was not well, and he said that would serve for an excuse. He is going to Castleman County, and after he has stayed a week or so, he is going off on a hunting-trip, and not return.” “And will he do it?” “I don’t think he expects to do it at present. I feel sure he has the idea of starting mamma to quoting the Bible to me, and dragging me down with her tears. But I have done all I can to make clear to him that it will make no difference. I told him I would not say a word about my intentions at home until he had gone away, and that I expected the same silence from him. But, of course—” She stopped abruptly, and after a moment she asked: “What do you think of it, Mary?” I leaned forward and took her two hands in mine. “Only,” I said, “that I’m glad you fought it out alone! I knew it had to come—and I didn’t want to have to help you to decide!” 10. She sat for a while absorbed in her own thoughts. Knowing her as I did, I understood what intense emotions were seething within her, what a terrific struggle her decision must have represented. “Dear Friend,” she said, suddenly, “don’t think I haven’t seen his side of the case. I try to tell myself that I dealt with him frankly from the beginning. But then I ask was there ever a man I dealt with frankly? There was coquetry in the very clothes I wore! And now that we are so entangled, now that he loves me, what is my duty? I find I can’t respect his love for me. A part of it is because my beauty fascinates him, but more of it seems to me just wounded vanity. I was the only woman who ever flouted him, and he has a kind of snobbery that made him think I must be something remarkable because of it. I talked that all out with him—yes, I’ve dragged him through all that humiliation. I wanted to make him see that he didn’t really love me, that he only wanted to conquer me, to force me to admire him and submit to him. I want to be myself, and he wants to be himself—that has always been the issue between us.” “That is the issue in many unhappy marriages,” I said. “I’ve done a lot of thinking in the last year,” she resumed—“about things generally, I mean. We American women think we are so free. That is because our husbands indulge us, give us money, and let us run about. But when it comes to real freedom—freedom of intellect and of character, English women are simply another kind of being from us. I met a cabinet minister’s wife—he’s a Conservative in everything, and she’s an ardent suffragist; she not merely gives money, she makes speeches and has a public name. Yet they are friends, and have a happy home-life. Do you suppose my husband would consider such an arrangement?” “I thought he admired English ways,” I said. “There was the Honorable Betty Annersley—the sister of a chum of his. She was friendly with the militants, and I wanted to talk to her to understand what such women thought. Yet my husband tried to stop me from going to see her. And it’s the same way with everything I try to do, that threatens to take me out of his power. He wanted me to accept the authority of the doctors as to any possible danger from venereal disease. When I got the books, and showed him what the doctors admitted about the question—the narrow margin of safety they allowed, the terrible chances they took—he was angry again.” She stopped, seeing a question in my eyes. “I’ve been reading up on the subject,” she explained. “I know it all now—the things I should have known before I married.” “How did you manage that?” “I tried to get two of the doctors to give me something to read, but they wouldn’t hear of it. I’d set myself crazy imagining things, it was no sort of stuff for a woman’s mind. So in the end I took the bit in my teeth. I found a medical book store, and I went in and said: ‘I am an American physician, and I want to see the latest works on venereal disease.’ So the clerk took me to the shelves, and I picked out a couple of volumes.” “You poor child!” I exclaimed. “When Douglas found that I was reading these books he threatened to burn them. I told him ‘There are more copies in the store, and I am determined to be educated on this subject.’” She paused. “How much like my own experience!” I thought. “There were chapters on the subject of wives, how much they were not told, and why this was. So very quickly I began to see around my own experience. Douglas must have figured out that this would be so, for the end of the matter was an admission.” “You don’t mean he confessed to you!” She smiled bitterly. “No,” she said. “He brought Dr. Perrin to London to do it for him. Dr. Perrin said he had concluded I had best know that my husband had had some symptoms of the disease. He, the doctor, wished to tell me who was to blame for the attempt to deceive me. Douglas had been willing to admit the truth, but all the doctors had forbidden it. I must realise the fearful problem they had, and not blame them, and, above all I must not blame my husband, who had been in their hands in the matter.” “How stupid men are! As if that would excuse him!” “I’m afraid I showed the little man how poor an impression he had made—both for himself and for his patron. But I had suffered all there was to suffer, and I was tired of pretending. I told him it would have been far better for them if they had told me the truth at the beginning.” “Ah, yes!” I said. “That is what I tried to make them see; but all I got for it was a sentence of deportation!” 11. When Sylvia’s train arrived at the station of her home town, the whole family was waiting upon the platform for her, and a good part of the town besides. The news that she had arrived in New York, and was coming home on account of her father’s illness, had, of course, been reproduced in all the local papers, with the result that the worthy major had been deluged with telegrams and letters concerning his health. Notwithstanding, he had insisted upon coming to the train to meet his daughter. He was not going to be shut up in a sickroom to please all the gossips of two hemispheres. In his best black broad-cloth, his broad, black hat newly brushed, and his old-fashioned, square-toed shoes newly shined, he paced up and down the station platform for half an hour, and it was to his arms that Sylvia flew when she alighted from the train. There was “Miss Margaret,” who had squeezed her large person and fluttering draperies out of the family automobile, and was waiting to shed tears over her favourite daughter; there was Celeste, radiant with a wonderful piece of news which she alone was to impart to her sister; there were Peggy and Maria, shot up suddenly into two amazingly-gawky girls; there was Master Castleman Lysle, the only son of the house, with his black-eyed and bad-tempered French governess. And finally there was Aunt Varina, palpitating with various agitations, not daring to whisper to anyone else the fears which this sudden home-coming inspired in her. Bishop Chilton and his wife were away, but a delegation of cousins had come; also Uncle Mandeville Castleman had sent a huge bunch of roses, which were in the family automobile, and Uncle Barry Chilton had sent a pair of wild turkeys, which were soon to be in the family. Behind Sylvia stalked her cold and haughty husband, and behind him tripped the wonderful nursemaid, with her wonderful blue streamers, and her wonderful bundle of ruffles and lace. All the huge family had to fall upon Sylvia and kiss and embrace her rapturously, and shake the hand of the cold and haughty husband, and peer into the wonderful bundle, and go into ecstasies over its contents. Rarely, indeed, did the great ones of this earth condescend to spread so much of their emotional life before the public gaze; and was it any wonder that the town crowded about, and the proprieties were temporarily repealed? It had never been published, but it was generally known throughout the State that Sylvia’s child was blind, and it was whispered that this portended something strange and awful. So there hung about the young mother and the precious bundle an atmosphere of mystery and melancholy. How had she taken her misfortune? How had she taken all the great events that had befallen her—her progress through the courts and camps of Europe? Would she still condescend to know her fellow-townsmen? Many were the hearts that beat high as she bestowed her largess of smiles and friendly words. There were even humble old negroes who went off enraptured to tell the town that “Mi’ Sylvia” had actually shaken hands with them. There was almost a cheer from the crowd as the string of automobiles set out for Castleman Hall. 12. There was a grand banquet that evening, at which the turkeys entered the family. Not in years had there been so many people crowded into the big dining-room, nor so many servants treading upon each other’s toes in the kitchen. Such a din of chatter and laughter! Sylvia was her old radiant self, and her husband was quite evidently charmed by the patriarchal scene. He was affable, really genial, and won the hearts of everybody; he told the good major, amid a hush which almost turned his words into a speech, that he was able to understand how they of the South loved their own section so passionately; there was about the life an intangible something—a spell, an elevation of spirit, which set it quite apart by itself. And since this was the thing which they of the South most delighted to believe concerning themselves, they listened enraptured, and set the speaker apart as a rare and discerning spirit. Afterwards came the voice of Sylvia: “You must beware of Douglas, Papa; he is an inveterate flatterer.” She laughed as she said it; and of those present it was Aunt Varina alone who caught the ominous note, and saw the bitter curl of her lips as she spoke. Aunt Varina and her niece were the only persons there who knew Douglas van Tuiver well enough to appreciate the irony of the term “inveterate flatterer.” Sylvia realized at once that her husband was setting out upon a campaign to win her family to his side. He rode about the major’s plantations, absorbing information about the bollweevil. He rode back to the house, and exchanged cigars, and listened to stories of the major’s boyhood during the war. He went to call upon Bishop Chilton, and sat in his study, with its walls of faded black volumes on theology. Van Tuiver himself had had a Church of England tutor, and was a punctilious high churchman; but he listened respectfully to arguments for a simpler form of church organization, and took away a voluminous exposé of the fallacies of “Apostolic Succession.” And then came Aunt Nannie, ambitious and alert as when she had helped the young millionaire to find a wife; and the young millionaire made the suggestion that Aunt Nannie’s third daughter should not fail to visit Sylvia at Newport. There was no limit, apparently, to what he would do. He took Master Castleman Lysle upon his knee, and let him drop a valuable watch upon the floor. He got up early in the morning and went horse-back riding with Peggy and Maria. He took Celeste automobiling, and helped by his attentions to impress the cocksure young man with whom Celeste was in love. He won “Miss Margaret” by these attentions to all her children, and the patience with which he listened to accounts of the ailments which had afflicted the precious ones at various periods of their lives. To Sylvia, watching all these proceedings, it was as if he were binding himself to her with so many knots. She had come home with a longing to be quiet, to avoid seeing anyone. But this could not be, she discovered. There was gossip about the child’s blindness, and the significance thereof; and to have gone into hiding would have meant an admission of the worst. The ladies of the family had prepared a grand “reception,” at which all Castleman County was to come and gaze upon the happy mother. And then there was the monthly dance at the Country Club, where everybody would come, in the hope of seeing the royal pair. To Sylvia it was as if her mother and aunts were behind her every minute of the day, pushing her out into the world. “Go on, go on! Show yourself! Do not let people begin to talk!” 13. She bore it for a couple of weeks; then she went to her cousin, Harley Chilton. “Harley,” she said, “my husband is anxious to go on a hunting-trip. Will you go with him?” “When?” asked the boy. “Right away; to-morrow or the next day.” “I’m game,” said Harley. After which she went to her husband. “Douglas, it is time for you to go.” He sat studying her face. “You still have that idea?” he said, at last. “I still have it.” “I was hoping that here, among your home-people, your sanity would partially return.” “I know what you have been hoping, Douglas. And I am sorry—but I am quite unchanged.” “Have we not been getting along happily here?” he demanded. “No, I have not—I have been wretched. And I cannot have any peace until you no longer haunt me. I am sorry for you, but I must be alone—and so long as you are here the entertainments will continue.” “We could make it clear that we did not care for entertainments. We could find some quiet place near your people, where we could live in peace.” “Douglas,” she said, “I have spoken to Cousin Harley. He is ready to go hunting with you. Please call him up and make arrangements to start to-morrow. If you are still here the following day, I shall leave for one of Uncle Mandeville’s plantations.” There was a long silence. “Sylvia,” he said, at last, “how long do you imagine this behaviour of yours can continue?” “It will continue forever. My mind is made up. It is necessary that you make up yours.” Again he waited, while he made sure of his self-control. “You propose to keep the baby with you?” he asked, at last. “For the present, yes. The baby cannot get along without me.” “And for the future?” “We will make a fair arrangement as to that. Give me a little time to get myself together, and then I will come and live somewhere near you in New York, and I will arrange it so that you can see the child as often as you please. I have no desire to take her from you—I only want to take myself from you.” “Sylvia,” he said, “have you realized all the unhappiness this course of yours is going to bring to your people?” “Oh, don’t begin that now!” she pleaded. “I know,” he said, “how determined you are to punish me. But I should think you would try to find some way to spare them.” “Douglas,” she replied, “I know exactly what you have been doing. I have watched your change of character since you came here. You may be able to make my people so unhappy that I must be unhappy also. You see how deeply I love them, how I yield everything for love of them. But let me make it clear, I will not yield this. It was for their sake I went into this marriage, but I have come to see that it was wrong, and no power on earth can induce me to stay in it. My mind is made up—I will not live with a man I do not love. I will not even pretend to do it. Now do you understand me, Douglas?” There was a silence, while she waited for some word from him. When none came, she asked, “You will arrange to go to-morrow?” He answered calmly, “I see no reason why I, your husband, should permit you to pursue this insane course. You propose to leave me; and the reason you give is one that would, if it were valid, break up two-thirds of the homes in the country. Your own family will stand by me in my effort to prevent your ruin.” “What do you expect to do?” she asked in a suppressed voice. “I have to assume that my wife is insane; and I shall look after her till she comes to her senses.” She sat watching him for a few moments, wondering at him. Then she said, “You are willing to stay on here, day after day, pursuing me in the only refuge I have. Well then, I shall not consider your feelings. I have a work to do here—and I think that when I begin it, you will want to be far away.” “What do you mean?” he asked—and he looked at her as if she were really a maniac. “You see my sister Celeste is about to marry. That was the wonderful news she had to tell me at the depot. It happens that I have known Roger Peyton all my life, and know he has the reputation of being one of the ‘fastest’ boys in the town.” “Well?” he asked. “Just this, Douglas—I do not intend to leave my sister unprotected as I was. I am going to tell her about Elaine. I am going to tell her all that she needs to know. It is bound to mean arguments with the old people, and in the end the whole family will be discussing the subject. I feel sure you will not care to be here under such circumstances.” “And may I ask when this begins?” he inquired, with intense bitterness in his tone. “Right away,” she said. “I have merely been waiting until you should go.” He said not a word, but she knew by the expression on his face that she had carried her point at last. He turned and left the room; and that was the last word she had with him, save for their formal parting in the presence of the family. 14. Roger Peyton was the son and heir of one of the oldest families in Castleman County. I had heard of this family before—in a wonderful story that Sylvia told of the burning of “Rose Briar,” their stately mansion, some years previously: how the neighbours had turned out to extinguish the flames, and failing, had danced a last whirl in the ball-room, while the fire roared in the stories overhead. The house had since been rebuilt, more splendid than ever, and the prestige of the family stood undiminished. One of the sons was an old “flame” of Sylvia’s, and another was married to one of the Chilton girls. As for Celeste, she had been angling for Roger the past year or two, and she stood now at the apex of happiness. Sylvia went to her father, to talk with him about the difficult subject of venereal disease. The poor major had never expected to live to hear such a discourse from a daughter of his; however, with the blind child under his roof, he could not find words to stop her. “But, Sylvia,” he protested, “what reason have you to suspect such a thing of Roger Peyton?” “I have the reason of his life. You know that he has the reputation of being ‘fast’; you know that he drinks, you know that I once refused to speak to him because he danced with me when he was drunk.” “My child, all the men you know have sowed their wild oats.” “Papa, you must not take advantage of me in such a discussion. I don’t claim to know what sins may be included in the phrase ‘wild oats.’ Let us speak frankly—can you say that you think it unlikely that Roger Peyton has been unchaste?” The major hesitated and coughed; finally he said: “The boy drinks, Sylvia; further than that I have no knowledge.” “The medical books tell me that the use of alcohol tends to break down self-control, and to make continence impossible. And if that be true, you must admit that we have a right to ask assurances. What do you suppose that Roger and his crowd are doing when they go roistering about the streets at night? What do they do when they go off to Mardi Gras? Or at college—you know that Cousin Clive had to get him out of trouble several times. Go and ask Clive if Roger has ever been exposed to the possibility of these diseases.” “My child,” said the major, “Clive would not feel he had the right to tell me such things about his friend.” “Not even when the friend wants to marry his cousin?” “But such questions are not asked, my daughter.” “Papa, I have thought this matter out carefully, and I hava something definite to propose to you. I have no idea of stopping with what Clive Chilton may or may not see fit to tell about his chum. I want you to go to Roger.” Major Castleman’s face wore a blank stare. “If he’s going to marry your daughter, you have the right to ask about his past. What I want you to tell him is that you will get the name of a reputable specialist in these diseases, and that before he can have your daughter he must present you with a letter from this man, to the effect that he is fit to marry.” The poor major was all but speechless. “My child, who ever heard of such a proposition?” “I don’t know that any one ever did, papa. But it seems to me time they should begin to hear of it; and I don’t see who can have a better right to take the first step than you and I, who have paid such a dreadful price for our neglect.” Sylvia had been prepared for opposition—the instinctive opposition which men manifest to having this embarrassing subject dragged out into the light of day. Even men who have been chaste themselves—good fathers of families like the major—cannot be unaware of the complications incidental to frightening their women-folk, and setting up an impossibly high standard in sons-in-law. But Sylvia stood by her guns; at last she brought her father to his knees by the threat that if he could not bring himself to talk with Roger Peyton, she, Sylvia Castleman, would do it. 15. The young suitor came by appointment the next day, and had a session with the Major in his office. After he had gone, Sylvia went to her father and found him pacing the floor, with an extinct cigar between his lips, and several other ruined cigars lying on the hearth. “You asked him, papa?” “I did, Sylvia.” “And what did he say?” “Why, daughter——” The major flung his cigar from him with desperate energy. “It was most embarrassing!” he exclaimed—“most painful!” His pale old face was crimson with blushes. “Go on, papa,” said Sylvia, gentle but firm. “The poor boy—naturally, Sylvia, he could not but feel hurt that I should think it necessary to ask such questions. Such things are not done, my child. It seemed to him that I must look upon him as—well, as much worse than other young fellows——” The old man stopped, and began to walk restlessly up and down. “Yes, papa,” said Sylvia. “What else?” “Well, he said it seemed to him that such a matter might have been left to the honour of a man whom I was willing to think of as a son-in-law. And you see, my child, what an embarrassing position I was in; I could not give him any hint as to my reason for being anxious about these matters—anything, you understand, that might be to the discredit of your husband.” “Go on, papa.” “Well, I gave him a fatherly talking to about his way of life.” “Did you ask him the definite question as to his health?” “No, Sylvia.” “Did he tell you anything definite?” “No.” “Then you didn’t do what you had set out to do!” “Yes, I did. I told him that he must see a doctor.” “You made quite clear to him what you wanted?” “Yes, I did—really, I did.” “And what did he say?” She went to him and took his arm and led him to a couch. “Come, papa, let us get to the facts. You must tell me.” They sat down, and the major sighed, lit a fresh cigar, rolled it about in his fingers until it was ruined, and then flung it away. “Boys don’t talk freely to older men,” he said. “They really never do. You may doubt this——” “What did he say, papa?” “Why, he didn’t know what to say. He didn’t really say anything.” And here the major came to a complete halt. His daughter, after studying his face for a minute, remarked, “In plain words, papa, you think he has something to hide, and he may not be able to give you the evidence you asked?” The other was silent. “You fear that is the situation, but you are trying not to believe it.” As he still said nothing, Sylvia whispered, “Poor Celeste!” Suddenly she put her hands upon his shoulders, and looked into his eye. “Papa, can’t you see what that means—that Celeste ought to have been told these things long ago?” “What good would that have done?” he asked, in bewilderment. “She could have known what kind of man she was choosing; and she might be spared the dreadful unhappiness that is before her now.” “Sylvia! Sylvia!” protested the other. “Surely such things cannot be discussed with innocent young girls!” “So long as we refuse to do it, we are simply entering into a conspiracy with the man of loose life, so that he may escape the worst penalty of his evil-doing. Take the boys in our own set—why is it they feel safe in running off to the big cities and ‘sowing their wild oats’—even sowing them in the obscure parts of their own town? Is it not because they know that their sisters and girl friends are ignorant and helpless; so that when they are ready to pick a wife, they will be at no disadvantage? Here is Celeste; she knows that Roger has been ‘wild,’ but no one has hinted to her what that means; she thinks of things that are picturesque—that he’s high-spirited, and brave, and free with his money.” “But, my daughter,” protested the major, “such knowledge would have a terrible effect upon young girls!” He rose and began to pace the floor again. “Daughter, you are letting yourself run wild! The sweetness, the virginal innocence of young and pure women—if you take that from them, there’d be nothing left to keep men from falling to the level of brutes!” “Papa,” said Sylvia, “all that sounds well, but it has no meaning. I have been robbed of my ‘innocence,’ and I know that it has not debased me. It has only fitted me to deal with the realities of life. And it will do the same for any girl who is taught by earnest and reverent people. Now, as it is, we have to tell Celeste, but we tell her too late.” “But we won’t have to tell her!” cried the major. “Dear papa, please explain how we can avoid telling her.” “I will inform her that she must give the young man up. She is a good and dutiful daughter——” “Yes,” replied Sylvia, “but suppose on this one occasion she were to fail to be good and dutiful? Suppose the next day you learn that she had run away and married Roger—what would you do about it then?” 16. That evening Roger was to take his fiancée to one of the young people’s dances. And there was Celeste, in a flaming red dress, with a great bunch of flaming roses; she could wear these colours, with her brilliant black hair and gorgeous complexion. Roger was fair, with a frank, boyish face, and they made a pretty couple; but that evening Roger did not come. Sylvia helped to dress her sister, and then watched her wandering restlessly about the hall, while the hour came and went. Later in the evening Major Castleman called up the Peyton home. The boy was not there, and no one seemed to know where he was. Nor the next day did there come any explanation. At the Peytons it was still declared that no one had heard from Roger, and for another day the mystery continued, to Celeste’s distress and mortification. At last, from Clive Chilton, Sylvia managed to extract the truth. Roger was drunk—crazy drunk, and had been taken off by some of the boys to be straightened out. Of course this rumour soon got to the rest of the family and they had to tell Celeste, because she was frantic with anxiety. There were grave consultations among the Castleman ladies. It was a wanton affront to his fiancée that the boy had committed, and something must be done about it quickly. Then came the news that Roger had escaped from his warders, and got drunker than ever; he had been out at night, smashing the street lamps, and it had required extreme self-control on the part of the town police force to avoid complications. “Miss Margaret” went to her young daughter, and in a tear-flooded scene informed her of the opinion of the family, that her self-respect required the breaking of the engagement. Celeste went into hysterics. She would not have her happiness ruined for life! Roger was “wild,” but so were all the other boys—and he would atone for his recklessness. She had the idea that if only she could get hold of him, she could recall him to his senses; the more her mother was scandalised by this proposal, the more frantically Celeste wept. She shut herself up in her room, refusing to appear at meals, and spending her time pacing the floor and wringing her hands. The family had been through all this with their eldest daughter several years before, but they had not learned to handle it any better. The whole household was in a state of distraction, and the conditions grew worse day by day, as bulletins came in concerning the young man. He seemed to have gone actually insane. He was not to be restrained even by his own father, and if the unfortunate policemen could be believed, he had violently attacked them. Apparently he was trying to break down the unwritten law that the sons of the “best families” are not arrested. Poor Celeste, with pale, tear-drenched face, sent for her elder sister, to make one last appeal. Could Sylvia not somehow get hold of Roger and bring him to his senses? Could she not interview some of the other boys, and find out what he meant by his conduct? So Sylvia went to her cousin Clive, and had a talk with him—assuredly the most remarkable talk that that young man had ever had in his life. She told him that she wanted to know the truth about Roger Peyton, and after a cross-examination that would have made the reputation of a criminal lawyer, she got what she wanted. All the young men in town, it seemed, knew the true state of affairs, and were in a panic concerning it; that Major Castleman had sent for Roger and informed him that he could not marry his daughter, until he produced a certain kind of medical certificate. No, he couldn’t produce it! Was there a fellow in town who could produce it? What was there for him to do but to get drunk and stay drunk, until Celeste had cast him off? It was Clive’s turn then to do some plain speaking. “Look here, Sylvia,” he said, “since you have made me talk about this——” “Yes, Clive?” “Do you know what people are saying—I mean the reason the Major made this proposition to Roger?” She answered, in a quiet voice: “I suppose, Clive, it has something to do with Elaine.” “Yes, exactly!” exclaimed Clive. “They say—” But then he stopped. He could not repeat it. “Surely you don’t want that kind of talk, Sylvia?” “Naturally, Clive, I’d prefer to escape that kind of talk, but my fear of it will not make me neglect the protection of my sister.” “But Sylvia,” cried the boy, “you don’t understand about this! A woman can’t understand about these things——” “You are mistaken, my dear cousin,” said Sylvia—and her voice was firm and decisive. “I do understand.” “All right!” cried Clive, with sudden exasperation. “But let me tell you this—Celeste is going to have a hard time getting any other man to propose to her!” “You mean, Clive, because so many of them are——?” “Yes, if you must put it that way,” he said. There was a pause, then Sylvia went on: “Let us discuss the practical problem, Clive. Don’t you think it would have been better if Roger, instead of going off and getting drunk, had set about getting himself cured?” The other looked at her, with evident surprise. “You mean in that case Celeste might marry him?” “You say the boys are all alike, Clive; and we can’t turn our girls into nuns. Why didn’t some of you fellows point that out to Roger?” “The truth is,” said Clive, “we tried to.” There was a little more cordiality in his manner, since Sylvia had shown such a unexpected amount of intelligence. “Well?” she asked. “What then?” “Why, he wouldn’t listen to anything.” “You mean—because he was drunk?” “No, we had him nearly sober. But you see—” And Clive paused for a moment, painfully embarrassed. “The truth is, Roger had been to a doctor, and been told it might take him a year or two to get cured.” “Clive!” she cried. “Clive! And you mean that in the face of that, he proposed to go on and marry?” “Well, Sylvia, you see—” And the young man hesitated still longer. He was crimson with embarrassment, and suddenly he blurted out: “The truth is, the doctor told him to marry. That was the only way he’d ever get cured.” Sylvia was almost speechless. “Oh! Oh!” she cried, “I can’t believe you!” “That’s what the doctors tell you, Sylvia. You don’t understand—it’s just as I told you, a woman can’t understand. It’s a question of a man’s nature——” “But Clive—what about the wife and her health? Has the wife no rights whatever?” “The truth is, Sylvia, people don’t take this disease with such desperate seriousness. You understand, it isn’t the one that everybody knows is dangerous. It doesn’t do any real harm——” “Look at Elaine! Don’t you call that real harm?” “Yes, but that doesn’t happen often, and they say there are ways it can be prevented. Anyway, fellows just can’t help it! God knows we’d help it if we could.” Sylvia thought for a moment, and then came back to the immediate question. “It’s evident what Roger could do in this case. He is young, and Celeste is still younger. They might wait a couple of years and Roger might take care of himself, and in time it might be properly arranged.” But Clive did not seem too warm to the proposition, and Sylvia, who knew Roger Peyton, was not long in making out the reason. “You mean you don’t think he has character enough to keep straight for a year or two?” “To tell you the honest truth, we talked it out with him, and he wouldn’t make any promises.” To which Sylvia answered: “Very well, Clive—that settles it. You can help me find some man for Celeste who loves her a little more than that!” 17. That afternoon came Aunt Nannie, the Bishop’s wife, in shining chestnut-coloured silk to match a pair of shining chestnut-coloured horses. Other people, it appeared, had been making inquiries into Roger Peyton’s story, and other people besides Clive Chilton had been telling the truth. Aunt Nannie gathered the ladies of the family in a hurried conference, and Sylvia was summoned to appear before it—quite as in the days of her affair with Frank Shirley. “Miss Margaret” and Aunt Varina were solemn and frightened, as of old; and, as of old, Aunt Nannie did the talking. “Sylvia, do you know what people are saying about you?” “Yes, Aunt Nannie” said Sylvia. “Oh, you do know?” “Yes, of course. And I knew in advance that they would say it.” Something about the seraphic face of Sylvia, chastened by terrible suffering, must have suggested to Mrs. Chilton the idea of caution. “Have you thought of the humiliation this must inflict upon your relatives?” “I have found, Aunt Nannie,” said Sylvia, “that there are worse afflictions than being talked about.” “I am not sure,” declared the other, “that anything could be worse than to be the object of the kind of gossip that is now seething around our family. It has been the tradition of our people to bear their afflictions in silence.” “In this case, Aunt Nannie, it is obvious that silence would have meant more afflictions, many more. I have thought of my sister—and of all the other girls in our family, who may be led to sacrifice by the ambitions of their relatives.” Sylvia paused a moment, so that her words might have effect. Said the bishop’s wife: “Sylvia, we cannot undertake to save the world from the results of its sins. God has his own ways of punishing men.” “Perhaps so, but surely God does not wish the punishment to fall upon innocent young girls. For instance, Aunt Nannie, think of your own daughters——” “My daughters!” broke out Mrs. Chilton. And then, mastering her excitement: “At least, you will permit me to look after my own children.” “I noticed, my dear aunt, that Lucy May turned colour when Tom Aldrich came into the room last night. Have you noticed anything?” “Yes—what of it?” “It means that Lucy May is falling in love with Tom.” “Why should she not? I certainly consider him an eligible man.” “And yet you know, Aunt Nannie, that he is one of Roger Peyton’s set. You know that he goes about town getting drunk with the gayest of them, and you let Lucy May go on and fall in love with him! You have taken no steps to find out about him—you have not warned your daughter—” Mrs. Chilton was crimson with agitation. “Warned my daughter! Who ever heard of such a thing?” Said Sylvia, quietly: “I can believe that you never heard of it—but you will hear soon. The other day I had a talk with Lucy May—” “Sylvia Castleman!” And then it seemed Mrs. Chilton reminded herself that she was dealing with a dangerous lunatic. “Sylvia,” she said, in a suppressed voice, “you mean to tell me that you have been poisoning my young daughter’s mind—” “You have brought her up well,” said Sylvia, as her aunt stopped for lack of words. “She did not want to listen to me. She said that young girls ought not to know about such matters. But I pointed out Elaine, and then she changed her mind—just as you will have to change yours in the end, Aunt Nannie.” Mrs. Chilton sat glaring at her niece, her bosom heaving. Then suddenly she turned her indignant eyes upon Mrs. Castleman. “Margaret, cannot you stop this shocking business? I demand that the tongues of gossip shall no longer clatter around the family of which I am a member! My husband is the bishop of this diocese, and if our ancient and untarnished name is of no importance to Sylvia van Tuiver, then, perhaps the dignity and authority of the church may have some weight——” “Aunt Nannie,” interrupted Sylvia, “it will do no good to drag Uncle Basil into this matter. I fear you will have to face the fact that from this time on your authority in our family is to be diminished. You had more to do than any other person with driving me into the marriage that has wrecked my life, and now you want to go on and do the same thing for my sister and for your own daughters—to marry them with no thought of anything save the social position of the man. And in the same way you are saving up your sons to find rich girls. You know that you kept Clive from marrying a poor girl in this town a couple of years ago—and meantime it seems to be nothing to you that he’s going with men like Roger Peyton and Tom Aldrich, learning all the vices the women in the brothels have to teach him——” Poor “Miss Margaret” had several times made futile efforts to check her daughter’s outburst. Now she and Aunt Varina started up at the same time. “Sylvia! Sylvia! You must not talk like that to your aunt!” And Sylvia turned and gazed at them with her sad eyes. “From now on,” she said, “that is the way I am going to talk. You are a lot of ignorant children. I was one too, but now I know. And I say to you: Look at Elaine! Look at my little one, and see what the worship of Mammon has done to one of the daughters of your family!” 18. After this, Sylvia had her people reduced to a state of terror. She was an avenging angel, sent by the Lord to punish them for their sins. How could one rebuke the unconventionality of an avenging angel? On the other hand, of course, one could not help being in agony, and letting the angel see it in one’s face. Outside, there were the tongues of gossip clattering, as Aunt Nannie had said; quite literally everyone in Castleman County was talking about the blindness of Mrs. Douglas van Tuiver’s baby, and how, because of it, the mother was setting out on a campaign to destroy the modesty of the State. The excitement, the curiosity, the obscene delight of the world came rolling back into Castleman Hall in great waves, that picked up the unfortunate inmates and buffeted them about. Family consultations were restricted, because it was impossible for the ladies of the family to talk to the gentlemen about these horrible things; but the ladies talked to the ladies, and the gentlemen talked to the gentlemen, and each came separately to Sylvia with their distress. Poor, helpless “Miss Margaret” would come wringing her hands, and looking as if she had buried all her children. “Sylvia! Sylvia! Do you realise that you are being DISCUSSED?” That was the worst calamity that could befal a woman in Castleman County—it summed up all possible calamities that could befal her—to be “discussed.” “They were discussing you once when you wanted to marry Frank Shirley! And now—oh, now they will never stop discussing you!” Then would come the dear major. He loved his eldest daughter as he loved nothing else in the world, and he was a just man at heart. He could not meet her arguments—yes, she was right, she was right. But then he would go away, and the waves of scandal and shame would come rolling. “My child,” he pleaded, “have you thought what this thing is doing to your husband? Do you realise that while you talk about protecting other people, you are putting upon Douglas a brand that will follow him through life?” Uncle Mandeville came up from New Orleans to see his favourite niece; and the wave smote him as he alighted from the train, and he became so much excited that he went to the club and got drunk, and then could not see his niece, but had to be carried off upstairs and given forcible hypodermics. Cousin Clive told Sylvia about it afterwards—how Uncle Mandeville refused to believe the truth, and swore that he would shoot some of these fellows if they didn’t stop talking about his niece. Said Clive, with a grim laugh: “I told him: ‘If Sylvia had her way, you’d shoot a good part of the men in the town.’” He answered: “Well, by God, I’ll do it—it would serve the scoundrels right!” And he tried to get out of bed and get his pants and his pistols—so that in the end it was necessary to telephone for the major, and then for Barry Chilton and two of his gigantic sons from their plantation. Sylvia had her way, and talked things out with the agonised Celeste. And the next day came Aunt Varina, hardly able to contain herself. “Oh, Sylvia, such a horrible thing! To hear such words coming from your little sister’s lips—like the toads and snakes in the fairy story! To think of these ideas festering in a young girl’s brain!” And then again: “Sylvia, your sister declares she will never go to a party again! You are teaching her to hate men! You will make her a STRONG-MINDED woman!”—that was another phrase they had summing up a whole universe of horrors. Sylvia could not recall a time when she had not heard that warning. “Be careful, dear, when you express an opinion, always end it with a question: ‘Don’t you think so?’ or something like that, otherwise, men may get the idea that you are ‘STRONG-MINDED’!” Sylvia, in her girlhood, had heard vague hints and rumours which now she was able to interpret in the light of her experience. In her courtship days she had met a man who always wore gloves, even in the hottest weather, and she had heard that this was because of some affliction of the skin. Now, talking with the young matrons of her own set, she learned that this man had married, and had since had to take to a wheel-chair, while his wife had borne a child with a monstrous deformed head, and had died of the ordeal and the shock. Oh, the stories that one uncovered—right in one’s own town, among one’s own set—like foul sewers underneath the pavements! The succession of deceased generations, of imbeciles, epileptics, paralytics! The innocent children born to a life-time of torment; the women hiding their secret agonies from the world! Sometimes women went all through life without knowing the truth about themselves. There was poor Mrs. Valens, for example, who reclined all day upon the gallery of one of the most beautiful homes in the county, and showed her friends the palms of her hands, all covered with callouses and scales, exclaiming: “What in the world do you suppose can be the matter with me?” She had been a beautiful woman, a “belle” of “Miss Margaret’s” day; she had married a man who was rich and handsome and witty—and a rake. Now he was drunk all the time, and two of his children had died in hospital, and another had arms that came out of joint, and had to be put in plaster of Paris for months at a time. His wife, the one-time darling of society, would lie on her couch and read the Book of Job until she knew it by heart. And could you believe it, when Sylvia came home, ablaze with excitement over the story, she found that the only thing that her relatives were able to see in it was the Book of Job! Under the burden of her afflictions the woman had become devout; and how could anyone fail to see in this the deep purposes of Providence revealed? “Verily,” said “Miss Margaret,” “‘whom the Lord loveth, He chasteneth.’ We are told in the Lord’s Word that ‘the sins of the fathers shall be visited upon the children, even unto the third and fourth generations,’ and do you suppose the Lord would have told us that, if He had not known there would be such children?” 19. I cannot pass over this part of my story without bringing forward Mrs. Armistead, the town cynic, who constituted herself one of Sylvia’s sources of information in the crisis. Mrs. Sallie Ann Armistead was the mother of two boys with whom Sylvia, as a child, had insisted upon playing, in spite of the protests of the family. “Wha’ fo’ you go wi’ dem Armistead chillun, Mi’ Sylvia?” would cry Aunt Mandy, the cook. “Doan’ you know they granddaddy done pick cottin in de fiel’ ‘long o’ me?” But while her father was picking cotton, Sallie Ann had looked after her complexion and her figure, and had married a rising young merchant. Now he was the wealthy proprietor of a chain of “nigger stores,” and his wife was the possessor of the most dreaded tongue in Castleman County. She was a person who, if she had been born a duchess, would have made a reputation in history; the one woman in the county who had a mind and was not afraid to have it known. She used all the tricks of a duchess—lorgnettes, for example, with which she stared people into a state of fright. She did not dare try anything like that on the Castlemans, of course, but woe to the little people who crossed her path! She had an eye that sought out every human weakness, and such a wit that even her victims were fascinated. One of the legends about her told how her dearest foe, a dashing young matron, had died, and all the friends had gathered with their floral tributes. Sallie Ann went in to review the remains, and when she came out a sentimental voice inquired: “And how does our poor Ruth look?” “Oh,” was the answer, “as old and grey as ever!” Now Mrs. Armistead stopped Sylvia in the street: “My dear, how goes the eugenics campaign?” And while Sylvia gazed, dumbfounded, the other went on as if she were chatting about the weather: “You can’t realise what a stir you are making in our little frog pond. Come, see me, and let me tell you the gossip! Do you know you’ve enriched our vocabulary?” “I have made someone look up the meaning of eugenics, at least,” answered Sylvia—having got herself together in haste. “Oh, not only that, my dear. You have made a new medical term—the ‘van Tuiver disease.’ Isn’t that interesting?” For a moment Sylvia shrivelled before this flame from hell. But then, being the only person who had ever been able to chain this devil, she said: “Indeed? I hope that with so fashionable a name the disease does not become an epidemic!” Mrs. Armistead gazed at her, and then, in a burst of enthusiasm, she exclaimed: “Sylvia Castleman, I have always insisted that one of the most interesting women in the world was spoiled by the taint of goodness in you.” She took Sylvia to her bosom, as it were. “Let us sit on the fence and enjoy this spectacle! My dear, you can have no idea what an uproar you are making! The young married women gather in their boudoirs and whisper ghastly secrets to each other; some of them are sure they have it, and some of them say they can trust their husbands—as if any man could be trusted as far as you can throw a bull by the horns! Did you hear about poor Mrs. Pattie Peyton, she has the measles, but she sent for a specialist, and vowed she had something else—she had read about it, and knew all the symptoms, and insisted on having elaborate blood-tests! And little Mrs. Stanley Pendleton has left her husband, and everybody says that’s the reason. The men are simply shivering in their boots—they steal into the doctor’s offices by the back-doors, and a whole car-load of the boys have been shipped off to Hot Springs to be boiled—” And so on, while Mrs. Armistead revelled in the sensation of strolling down Main Street with Mrs. Douglas van Tuiver! Then Sylvia would go home, and get the newest reactions of the family to these horrors. Aunt Nannie, it seemed, made the discovery that Basil, junr., her fifth son, was carrying on an intrigue with a mulatto girl in the town; and she forbade him to go to Castleman Hall, for fear lest Sylvia should worm the secret out of him; also she shipped Lucy May off to visit a friend, and came and tried to persuade Mrs. Chilton to do the same with Peggy and Maria, lest Sylvia should somehow corrupt these children. The bishop came, having been ordered to preach religion to his wayward niece. Poor dear Uncle Basil—he had tried preaching religion to Sylvia many years ago, and never could do it because he loved her so well that with all his Seventeenth Century theology he could not deny her chance of salvation. Now the first sight that met his eyes when he came to see her was his little blind grand-niece. And also he had in his secret heart the knowledge that he, a rich and gay young planter before he became converted to Methodism, had played with the fire of vice, and been badly burned. So Sylvia did not find him at all the Voice of Authority, but just a poor, hen-pecked, unhappy husband of a tyrannous Castleman woman. The next thing was that “Miss Margaret” took up the notion that a time such as this was not one for Sylvia’s husband to be away from her. What if people were to say that they had separated? There were family consultations, and in the midst of them there came word that van Tuiver was called North upon business. When the family delegations came to Sylvia, to insist that she go with him, the answer they got was that if they could not let her stay quietly at home without asking her any questions, she would go off to New York and live with a divorced woman Socialist! “Of course, they gave up,” she wrote me. “And half an hour ago poor dear mamma came to my room and said: ‘Sylvia, dear, we will let you do what you want, but won’t you please do one small favour for me?’ I got ready for trouble, and asked what she wanted. Her answer was: ‘Won’t you go with Celeste to the Young Matrons’ Cotillion tomorrow night, so that people won’t think there’s anything the matter?’” 20. Roger Peyton had gone off to Hot Springs, and Douglas van Tuiver was in New York; so little by little the storms about Castleman Hall began to abate in violence. Sylvia was absorbed with her baby, and beginning to fit her life into that of her people. She found many ways in which she could serve them—entertaining Uncle Mandeville to keep him sober; checking the extravagrance of Celeste; nursing Castleman Lysle through green apple convulsions. That was to be her life for the future, she told herself, and she was making herself really happy in it—when suddenly, like a bolt from the blue, came an event that swept her poor little plans into chaos. It was an afternoon in March, the sun was shining brightly and the Southern springtime was in full tide, and Sylvia had had the old family carriage made ready, with two of the oldest and gentlest family horses, and took the girls upon a shopping expedition to town. In the front seat sat Celeste, driving, with two of her friends, and in the rear seat was Sylvia, with Peggy and Maria. When an assemblage of allurements such as this stopped on the streets of the town, the young men would come out of the banks and the offices and gather round to chat. There would be a halt before an ice-cream parlour, and a big tray of ices would be brought out, and the girls would sit in the carriage and eat, and the boys would stand on the curb and eat—undismayed by the fact that they had welcomed half a dozen such parties during the afternoon. The statistics proved that this was a thriving town, with rapidly increasing business, but there was never so much business as to interfere with gallantries like these. Sylvia enjoyed the scene; it took her back to happy days, before black care had taken his seat behind her. She sat in a kind of dream, only half hearing the merriment of the young people, and only half tasting her ice. How she loved this old town, with its streets deep in black spring mud, its mud-plastered “buck-boards” and saddle horses hitched at every telegraph pole! Its banks and stores and law offices seemed shabbier after one had made the “grand tour,” but they were none the less dear to her for that. She would spend the rest of her days in Castleman County, and the sunshine and peace would gradually enfold her. Such were her thoughts when the unforeseen event befel. A man on horse-back rode down a side-street, crossing Main Street a little way in front of her; a man dressed in khaki, with a khaki riding hat pulled low over his face. He rode rapidly—appearing and vanishing, so that Sylvia scarcely saw him—really did not see him with her conscious mind at all. Her thoughts were still busy with dreams, and the clatter of boys and girls; but deep within her had begun a tumult—a trembling, a pounding of the heart, a clamouring under the floors of her consciousness. And slowly this excitement mounted. What was the matter, what had happened? A man had ridden by, but why should a man—. Surely it could not have been—no. There were hundreds of men in Castleman County who wore khaki and rode horse-back, and had sturdy, thick-set figures! But then, how could she make a mistake? How could her instinct have betrayed her so? It was that same view of him as he sat on a horse that had first thrilled her during the hunting party years ago! He had gone West, and had said that he would never return. He had not been heard from in years. What an amazing thing, that a mere glimpse of a man who looked and dressed and rode like him should be able to set her whole being into such a panic! How futile became her dreams of peace! She heard the sound of a vehicle close beside her carriage, and turned and found herself looking into the sharp eyes of Mrs. Armistead. It happened that Sylvia was on the side away from the curb, and there was no one talking to her; so Mrs. Armistead ran her electric alongside, and had the stirring occasion to herself. Sylvia looked into her face, so full of malice, and knew two things in a flash: First, it really had been Frank Shirley riding by; and second, Mrs. Armistead had seen him! “Another candidate for your eugenics class!” said the lady. Sylvia glanced at the young people and made sure they were paying no attention. She might have made some remark that would have brought them into the conversation, and delivered her from the torments of this devil. But no, she had never quailed from Mrs. Armistead in her life, and she would not now give her the satisfaction of driving off to tell the town that Sylvia van Tuiver had seen Frank Shirley, and had been overcome by it, and had taken refuge behind the skirts of her little sisters! “You can see I have my carriage full of pupils” she said, smilingly. “How happy it must make you, Sylvia—coming home and meeting all your old friends! It must set you trembling with ecstasy—angels singing in the sky above you—little golden bells ringing all over you!” Sylvia recognised these phrases. They were part of an effort she had made to describe the raptures of young love to her bosom friend, Harriet Atkinson. And so Harriet had passed them on to the town! And they had been cherished all these years. She could not afford to recognise these illegitimate children of romance. “Mrs. Armistead,” she said, “I had no idea you had so much poetry in you!” “I am simply improvising, my dear—upon the colour in your cheeks at present!” There was no way save to be bold. “You couldn’t expect me not to be excited, Mrs. Armistead. You see, I had no idea he had come back from the West.” “They say he left a wife there.” remarked the lady, innocently. “Ah!” said Sylvia. “Then he will not be staying long, presumably.” There was a pause; all at once Mrs. Armistead’s voice became gentle and sympathetic. “Sylvia,” she said, “don’t imagine that I fail to appreciate what is going on in your heart. I know a true romance when I see one. If only you could have known in those days what you know now, there might have been one beautiful love story that did not end as a tragedy.” You would have thought the lady’s better self had suddenly been touched. But Sylvia knew her; too many times she had seen this huntress trying to lure a victim out of his refuge. “Yes, Mrs. Armistead,” she said, gently. “But I have the consolation at least of being a martyr to science.” “In what way?” “Have you forgotten the new medical term that I have given to the world?” And Mrs. Armistead looked at her for a moment aghast. “My God, Sylvia!” she whispered; and then—an honest tribute: “You certainly can take care of yourself!” “Yes,” said Sylvia. “Tell that to my other friends in town.” And so, at last, Mrs. Armistead started her machine, and this battle of hell-cats came to an end. 21. Sylvia rode home in a daze, answering without hearing the prattle of the children. She was appalled at the emotions that possessed her—that the sight of Frank Shirley riding down the street could have affected her so! She forgot Mrs. Armistead, she forgot the whole world, in her dismay over her own state of mind. Having dismissed Frank from her life and her thoughts forever, it seemed to her preposterous that she should be at the mercy of such an excitement. She found herself wondering about her family. Did they know that Frank Shirley had returned? Would they have failed to mention it to her? For a moment she told herself it would not have occurred to them she could have any interest in the subject. But no—they were not so naive—the Castleman women—as their sense of propriety made them pretend to be! But how stupid of them not to give her warning! Suppose she had happened to meet Frank face to face, and in the presence of others! She must certainly have betrayed her excitement; and just at this time, when the world had the Castleman family under the microscope! She told herself that she would avoid such difficulty in future; she would stay at home until Frank had gone away. If he had a wife in the West, presumably he had merely come for a visit to his mother and sisters. And then Sylvia found herself in an argument with herself. What possible difference could it make that Frank Shirley had a wife? So long as she, Sylvia, had a husband, what else mattered? Yet she could not deny it—it brought her a separate and additional pang that Frank Shirley should have married. What sort of wife could he have found—he, a stranger in the far West? And why had he not brought his wife home to his people? When she stepped out of the carriage, it was with her mind made up that she would stay at home until all danger was past. But the next afternoon a neighbour called up to ask Sylvia and Celeste to come and play cards in the evening. It was not a party, Mrs. Witherspoon explained to “Miss Margaret,” who answered the ‘phone; just a few friends and a good time, and she did so hope that Sylvia was not going to refuse. The mere hint of the fear that Sylvia might refuse was enough to excite Mrs. Castleman. Why should Sylvia refuse? So she accepted the invitation, and then came to plead with her daughter—for Celeste’s sake, and for the sake of all her family, so that the world might see that she was not crushed by misfortune! There were reasons why the invitation was a difficult one to decline. Mrs. Virginia Witherspoon was the daughter of a Confederate general whose name you read in every history-book; and she had a famous old home in the country which was falling about her ears—her husband being seldom sober enough to know what was happening. She had also three blossoming daughters, whom she must manage to get out of the home before the plastering of the drawing-room fell upon the heads of their suitors; so that the ardour of her husband-hunting was one of the jokes of the State. Naturally, under such circumstances, the Witherspoons had to be treated with consideration by the Castlemans. One might snub rich Yankees, and chasten the suddenly-prosperous; but a family with an ancient house in ruins, and with faded uniforms and battle-scarred sabres in the cedar-chests in its attic—such a family can with difficulty overdraw its social bank account. Dolly Witherspoon, the oldest daughter, had been Sylvia’s rival for the palm as the most beautiful girl in Castleman County. And Sylvia had triumphed, and Dolly had failed. So, in her secret heart she hated Sylvia, and the mother hated her; and yet—such was the social game—they had to invite Sylvia and her sister to their card-parties, and Sylvia and her sister had to go. They had to go and be the most striking figures there: Celeste, slim and pale from sorrow, virginal, in clinging white chiffon; and Sylvia, regal and splendid, shimmering like a mermaid in a gown of emerald green. The mermaid imagined that she noticed a slight agitation underneath the cordiality of her hostess. The next person to greet her was Mrs. Armistead; and Sylvia was sure that she did not imagine the suppressed excitement in that lady’s manner. But even while she was speculating and suspecting, she was led toward the drawing-room. It was late, her hostess explained; the other guests were waiting, so if they did not mind, the play would start at once. Celeste was to sit at that table over there, with Mr. Witherspoon’s crippled brother, and old Mr. Perkins, who was deaf; and Sylvia was to come this way—the table in the corner. Sylvia moved toward it, and Dolly Witherspoon and her sister, Emma, greeted her cordially, and then stepped out of the way to let her to her seat; and Sylvia gave one glance—and found herself face to face with Frank Shirley! 22. Frank’s face was scarlet; and Sylvia had a moment of blind terror, when she wanted to turn and fly. But there about her was the circle of her enemies; a whole roomful of people, breathless with curiosity, drinking in with eyes and ears every hint of distress that she might give. And the next morning the whole town would, in imagination, attend the scene! “Good-evening, Julia,” said Sylvia, to Mrs. Witherspoon’s youngest daughter, the other lady at the table. “Good-evening, Malcolm”—to Malcolm McCallum, an old “beau” of hers. And then, taking the seat which Malcolm sprang to move out for her, “How do you do, Frank?” Frank’s eyes had fallen to his lap. “How do you do?” he murmured. The sound of his voice, low and trembling, full of pain, was like the sound of some old funeral bell to Sylvia; it sent the blood leaping in torrents to her forehead. Oh, horrible, horrible! For a moment her eyes fell like his, and she shuddered, and was beaten. But there was the roomful of people, watching; there was Mrs. Armistead, there were the Witherspoon women gloating. She forced a tortured smile to her lips, and asked, “What are we playing?” “Oh, didn’t you know that?” said Julia. “Progressive whist.” “Thank-you,” said Sylvia. “When do we begin?” And she looked about—anywhere but at Frank Shirley, with his face grown so old in four years. No one said anything, no one made a move. Was everybody in the room conspiring to break her down? “I thought we were late,” she said, desperately; and then, with another effort—“Shall I cut?” she asked, of Julia. “If you please,” said the girl; but she did not make a motion to pass the cards. Her manner seemed to say, You may cut all night, but it won’t help you to rob me of this satisfaction. Sylvia made a still more determined effort. If the game was to be postponed indefinitely, so that people might watch her and Frank—well, she would have to find something to talk about. “It is a surprise to see you again, Frank Shirley!” she exclaimed. “Yes,” he said. His voice was a mumble, and he did not lift his eyes. “You have been in the West, I understand?” “Yes,” again; but still he did not lift his eyes. Sylvia managed to lift hers as far as his cravat; and she saw in it an old piece of imitation jewelry which she had picked up once on the street, and had handed to him in jest. He had worn it all these years! He had not thrown it away—not even when she had thrown him away! Again came a surge of emotion; and out of the mist she looked about her and saw the faces of tormenting demons, leering. “Well,” she demanded, “are we going to play?” “We were waiting for you to cut,” said Julia, graciously; and Sylvia’s fury helped to restore her self-posession. She cut the cards; and fate was kind, sparing both her and Frank the task of dealing. But then a new difficulty arose. Julia dealt, and thirteen cards lay in front of Frank Shirley; but he did not seem to know that he ought to pick them up. And when the opposing lady called him to time, in what seemed an unnecessarily penetrating voice, he found that he was physically unable to get the cards from the table. And when with his fumbling efforts he got them into a bunch, he could not straighten them out—to say nothing of the labour of sorting them according to suit, which all whist-players know to be an indispensable preliminary to the game. When the opposing lady prodded him again, Frank’s face changed from vivid scarlet to a dark and alarming purple. Miss Julia led the tray of clubs; and Frank, whose turn came next, spilled three cards upon the table, and finally selected from them the king of hearts to play—hearts being trumps. “But you have a club there, Mr. Shirley,” said his opponent; something that was pardonable, inasmuch as the nine of clubs lay face up where he had shoved it aside. “Oh—I beg pardon,” he stammered, and took back his king, and reached into his hand and pulled out the six of clubs, and a diamond with it. It was evident that this could not go on. Sylvia might be equal to the emergency, but Frank was not. He was too much of a human being and too little of a social automaton. Something must be done. “Don’t they play whist out West, Mr. Shirley,” asked Julia, still smiling benevolently. And Sylvia lowered her cards. “Surely, my dear, you must understand,” she said, gently. “Mr. Shirley is too much embarrassed to think about cards.” “Oh!” said the other, taken aback. (L’audace, touljours l’audace! runs the formula!) “You see,” continued Sylvia, “this is the first time that Frank has seen me in more than three years. And when two people have been as much in love as he and I were, they are naturally disturbed when they meet, and cannot put their minds upon a game of cards.” Julia was speechless. And Sylvia let her glance wander casually about the room. She saw her hostess and her daughters standing watching; and near the wall at the other side of the room stood the head-devil, who had planned this torment. “Mrs. Armistead,” Sylvia called, “aren’t you going to play to-night?” Of course everybody in the room heard this; and after it, anyone could have heard a pin drop. “I’m to keep score,” said Mrs. Armistead. “But it doesn’t need four to keep score,” objected Sylvia—and looked at the three Witherspoon ladies. “Dolly and Emma are staying out,” said Mrs. Witherspoon. “Two of our guests did not come.” “Well,” Sylvia exclaimed, “that just makes it right! Please let them take the place of Mr. Shirley and myself. You see, we haven’t seen each other for three or four years, and it’s hard for us to get interested into a game of cards.” The whole room caught its breath at once; and here and there one heard a little squeak of hysteria, cut short by some one who was not sure whether it was a joke or a scandal. “Why—Sylvia!” stammered Mrs. Witherspoon, completely staggered. Then Sylvia perceived that she was mistress of the scene. There came the old rapture of conquest, that made her social genius. “We have so much that we want to talk about,” she said, in her most winning voice. “Let Dolly and Emma take our places, and we will sit on the sofa in the other room and chat. You and Mrs. Armistead come and chaperone us. Won’t you do that, please?” “Why—why——” gasped the bewildered lady. “I’m sure that you will both be interested to hear what we have to say to each other; and you can tell everybody about it afterwards—and that will be so much better than having the card-game delayed any more.” And with this side-swipe Sylvia arose. She stood and waited, to make sure that her ex-fiancé was not too paralysed to follow. She led him out through the tangle of card-tables; and in the door-way she stopped and waited for Mrs. Armistead and Mrs. Witherspoon, and literally forced these two ladies to come with her out of the room. 23. Do you care to hear the details of the punishment which Sylvia administered to the two conspirators? She took them to the sofa, and made Frank draw up chairs for them, and when she had got comfortably seated, she proceeded to talk to Frank just as gently and sincerely and touchingly as she would have talked if there had been nobody present. She asked about all that had befallen him, and when she discovered that he was still not able to chat, she told him about herself, about her baby, who was beautiful and dear, even if she was blind, and about all the interesting things she had seen in Europe. When presently the old ladies showed signs of growing restless, she put hand cuffs on them and chained them to their chairs. “You see,” she said, “it would never do for Mr. Shirley and myself to talk without a chaperon. You got me into this situation, you know, and papa and mamma would never forgive you.” “You are mistaken, Sylvia!” cried Mrs. Witherspoon. “Mr. Shirley so seldom goes out, and he had said he didn’t think he would come!” “I am willing to accept that explanation,” said Sylvia, politely, “but you must help me out now that the embarrassing accident has happened.” Nor did it avail Mrs. Witherspoon to plead her guests and their score. “You may be sure they don’t care about the score,” said Sylvia. “They’d much prefer you stayed here, so that you can tell them how Frank and I behaved.” And then, while Mrs. Witherspoon was getting herself together, Sylvia turned upon the other conspirator. “We will now hold one of my eugenics classes,” she said, and added, to Frank, “Mrs. Armistead told me that you wanted to join my class.” “I don’t understand,” replied Frank, at a loss. “I will explain,” said Sylvia. “It is not a very refined joke they have in the town. Mrs. Armistead meant to say that she credits a disgraceful story that was circulated about you when we were engaged, and which my people made use of to make me break our engagement. I am glad to have a chance to tell you that I have investigated and satisfied myself that the story was not true. I want to apologise to you for ever having believed it; and I am sure that Mrs. Armistead may be glad of this opportunity to apologise for having said that she believed it.” “I never said that I believed it!” cried Sallie Ann. “No, you didn’t, Mrs. Armistead—you would not be so crude as to say it directly. You merely dropped a hint, which would lead everybody to understand that you believed it.” Sylvia paused, just long enough to let the wicked lady suffer, but not long enough to let her find a reply. “When you tell your friends about this scene,” she continued, “please make clear that I did not drop hints about anything, but said exactly what I meant—that the story is false, so far as it implies any evil done by Mr. Shirley, and that I am deeply ashamed of myself for having ever believed it. It is all in the past now, of course—we are both of us married, and we shall probably never meet again. But it will be a help to us in future to have had this little talk—will it not, Frank?” There was a pause, while Sallie Ann Armistead recovered from her dismay, and got back a little of her fighting power. Suddenly she rose: “Virginia,” she said, firmly, “you are neglecting your guests.” “I don’t think you ought to go until Frank has got himself together,” said Sylvia. “Frank, can you sort your cards now?” “Virginia!” commanded Sallie Ann, imperiously. “Come!” Mrs. Witherspoon rose, and so did Sylvia. “We can’t stay here alone,” said she. “Frank, will you take Mrs. Witherspoon in?” And she gently but firmly took Mrs. Armistead’s arm, and so they marched back into the drawing-room. Dolly and Emma had progressed to separate tables, it developed, so that the ordeal of Frank and Sylvia was over. Through the remainder of the evening Sylvia chatted and played, and later partook of refreshments with Malcolm McCallum, and mildly teased that inconsolable bachelor, quite as in the old days. Now and then she stole a glance at Frank Shirley, and saw that he was holding up his end; but he kept away from her, and she never even caught his eye. At last the company broke up, and Sylvia thanked her hostess for a most enjoyable evening. She stepped into the motor with Celeste, and sat with compressed lips, answering in monosyllables her “little sister’s” flood of excited questions—“Oh, Sylvia, didn’t you feel perfectly terrible? Oh, sister, I felt thrills running up and down my back! Sister, what did you say to him? Sister, do you know old Mr. Perkins kept leaning over me and asking what was happening; and how could I shout into his deaf ear that everybody was stopping to hear what you were saying to Frank Shirley?” At the end of the ride, there was Aunt Varina waiting up as usual—to renew her own youth in the story of the evening, what this person had worn and what that person had said. But Sylvia left her sister to tell the story, and fled to her room and locked the door, and flung herself upon the bed and gave way to a torrent of weeping. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3243/88895.html","bookId":644,"book":{"id":644,"title":"Sylvia\u0027s Marriage","description":"简介： I am telling the story of Sylvia Castleman. I should prefer to tell it without mention of myself; but it was written in the book of fate that I should be a decisive factor in her life, and so her story pre-supposes mine. I imagine the impatience of a...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3243","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
