{"id":9081,"no":6,"title":"Chapter IV Going the Rounds","content":"Shortly after ten o’clock the singing-boys arrived at the tranter’s house, which was invariably the place of meeting, and preparations were made for the start. The older men and musicians wore thick coats, with stiff perpendicular collars, and coloured handkerchiefs wound round and round the neck till the end came to hand, over all which they just showed their ears and noses, like people looking over a wall. The remainder, stalwart ruddy men and boys, were dressed mainly in snow-white smock-frocks, embroidered upon the shoulders and breasts, in ornamental forms of hearts, diamonds, and zigzags. The cider-mug was emptied for the ninth time, the music-books were arranged, and the pieces finally decided upon. The boys in the meantime put the old horn-lanterns in order, cut candles into short lengths to fit the lanterns; and, a thin fleece of snow having fallen since the early part of the evening, those who had no leggings went to the stable and wound wisps of hay round their ankles to keep the insidious flakes from the interior of their boots. \\n\\n \\n\\n Mellstock was a parish of considerable acreage, the hamlets composing it lying at a much greater distance from each other than is ordinarily the case. Hence several hours were consumed in playing and singing within hearing of every family, even if but a single air were bestowed on each. There was Lower Mellstock, the main village; half a mile from this were the church and vicarage, and a few other houses, the spot being rather lonely now, though in past centuries it had been the most thickly-populated quarter of the parish. A mile north-east lay the hamlet of Upper Mellstock, where the tranter lived; and at other points knots of cottages, besides solitary farmsteads and dairies. \\n\\n \\n\\n Old William Dewy, with the violoncello, played the bass; his grandson Dick the treble violin; and Reuben and Michael Mail the tenor and second violins respectively. The singers consisted of four men and seven boys, upon whom devolved the task of carrying and attending to the lanterns, and holding the books open for the players. Directly music was the theme, old William ever and instinctively came to the front. \\n\\n \\n\\n “Now mind, neighbours,” he said, as they all went out one by one at the door, he himself holding it ajar and regarding them with a critical face as they passed, like a shepherd counting out his sheep. “You two counter-boys, keep your ears open to Michael’s fingering, and don’t ye go straying into the treble part along o’ Dick and his set, as ye did last year; and mind this especially when we be in ‘Arise, and hail.’ Billy Chimlen, don’t you sing quite so raving mad as you fain would; and, all o’ ye, whatever ye do, keep from making a great scuffle on the ground when we go in at people’s gates; but go quietly, so as to strike up all of a sudden, like spirits.” \\n\\n \\n\\n “Farmer Ledlow’s first?” \\n\\n \\n\\n “Farmer Ledlow’s first; the rest as usual.” \\n\\n \\n\\n “And, Voss,” said the tranter terminatively, “you keep house here till about half-past two; then heat the metheglin and cider in the warmer you’ll find turned up upon the copper; and bring it wi’ the victuals to church-hatch, as th’st know.” \\n\\n * * * \\n\\n \\n\\n Just before the clock struck twelve they lighted the lanterns and started. The moon, in her third quarter, had risen since the snowstorm; but the dense accumulation of snow-cloud weakened her power to a faint twilight, which was rather pervasive of the landscape than traceable to the sky. The breeze had gone down, and the rustle of their feet and tones of their speech echoed with an alert rebound from every post, boundary-stone, and ancient wall they passed, even where the distance of the echo’s origin was less than a few yards. Beyond their own slight noises nothing was to be heard, save the occasional bark of foxes in the direction of Yalbury Wood, or the brush of a rabbit among the grass now and then, as it scampered out of their way. \\n\\n \\n\\n Most of the outlying homesteads and hamlets had been visited by about two o’clock; they then passed across the outskirts of a wooded park toward the main village, nobody being at home at the Manor. Pursuing no recognized track, great care was necessary in walking lest their faces should come in contact with the low-hanging boughs of the old lime-trees, which in many spots formed dense over-growths of interlaced branches. \\n\\n \\n\\n “Times have changed from the times they used to be,” said Mail, regarding nobody can tell what interesting old panoramas with an inward eye, and letting his outward glance rest on the ground, because it was as convenient a position as any. “People don’t care much about us now! I’ve been thinking we must be almost the last left in the county of the old string players? Barrel-organs, and the things next door to ’em that you blow wi’ your foot, have come in terribly of late years.” \\n\\n \\n\\n “Ay!” said Bowman, shaking his head; and old William, on seeing him, did the same thing. \\n\\n \\n\\n “More’s the pity,” replied another. “Time was — long and merry ago now! — when not one of the varmits was to be heard of; but it served some of the quires right. They should have stuck to strings as we did, and kept out clarinets, and done away with serpents. If you’d thrive in musical religion, stick to strings, says I.” \\n\\n \\n\\n “Strings be safe soul-lifters, as far as that do go,” said Mr. Spinks. \\n\\n \\n\\n “Yet there’s worse things than serpents,” said Mr. Penny. “Old things pass away, ’tis true; but a serpent was a good old note: a deep rich note was the serpent.” \\n\\n \\n\\n “Clar’nets, however, be bad at all times,” said Michael Mail. “One Christmas — years agone now, years — I went the rounds wi’ the Weatherbury quire. ’Twas a hard frosty night, and the keys of all the clar’nets froze — ah, they did freeze! — so that ’twas like drawing a cork every time a key was opened; and the players o’ ’em had to go into a hedger-and-ditcher’s chimley-corner, and thaw their clar’nets every now and then. An icicle o’ spet hung down from the end of every man’s clar’net a span long; and as to fingers — well, there, if ye’ll believe me, we had no fingers at all, to our knowing.” \\n\\n \\n\\n “I can well bring back to my mind,” said Mr. Penny, “what I said to poor Joseph Ryme (who took the treble part in Chalk-Newton Church for two-and-forty year) when they thought of having clar’nets there. ‘Joseph,’ I said, says I, ‘depend upon’t, if so be you have them tooting clar’nets you’ll spoil the whole set-out. Clar’nets were not made for the service of the Lard; you can see it by looking at ’em,’ I said. And what came o’t? Why, souls, the parson set up a barrel-organ on his own account within two years o’ the time I spoke, and the old quire went to nothing.” \\n\\n \\n\\n “As far as look is concerned,” said the tranter, “I don’t for my part see that a fiddle is much nearer heaven than a clar’net. ’Tis further off. There’s always a rakish, scampish twist about a fiddle’s looks that seems to say the Wicked One had a hand in making o’en; while angels be supposed to play clar’nets in heaven, or som’at like ’em, if ye may believe picters.” \\n\\n \\n\\n “Robert Penny, you was in the right,” broke in the eldest Dewy. “They should ha’ stuck to strings. Your brass-man is a rafting dog — well and good; your reed-man is a dab at stirring ye — well and good; your drum-man is a rare bowel-shaker — good again. But I don’t care who hears me say it, nothing will spak to your heart wi’ the sweetness o’ the man of strings!” \\n\\n \\n\\n “Strings for ever!” said little Jimmy. \\n\\n \\n\\n “Strings alone would have held their ground against all the new comers in creation.” (“True, true!” said Bowman.) “But clarinets was death.” (“Death they was!” said Mr. Penny.) “And harmonions,” William continued in a louder voice, and getting excited by these signs of approval, “harmonions and barrel-organs” (“Ah!” and groans from Spinks) “be miserable — what shall I call ’em? — miserable —” \\n\\n \\n\\n “Sinners,” suggested Jimmy, who made large strides like the men, and did not lag behind like the other little boys. \\n\\n \\n\\n “Miserable dumbledores!” \\n\\n \\n\\n “Right, William, and so they be — miserable dumbledores!” said the choir with unanimity. \\n\\n \\n\\n By this time they were crossing to a gate in the direction of the school, which, standing on a slight eminence at the junction of three ways, now rose in unvarying and dark flatness against the sky. The instruments were retuned, and all the band entered the school enclosure, enjoined by old William to keep upon the grass. \\n\\n \\n\\n “Number seventy-eight,” he softly gave out as they formed round in a semicircle, the boys opening the lanterns to get a clearer light, and directing their rays on the books. \\n\\n \\n\\n Then passed forth into the quiet night an ancient and time-worn hymn, embodying a quaint Christianity in words orally transmitted from father to son through several generations down to the present characters, who sang them out right earnestly: \\n\\n \\n\\n “Remember Adam’s fall, \\n\\n \\n\\n O thou Man: \\n\\n \\n\\n Remember Adam’s fall \\n\\n \\n\\n From Heaven to Hell. \\n\\n \\n\\n Remember Adam’s fall; \\n\\n \\n\\n How he hath condemn’d all \\n\\n \\n\\n In Hell perpetual \\n\\n \\n\\n There for to dwell. \\n\\n \\n\\n Remember God’s goodnesse, \\n\\n \\n\\n O thou Man: \\n\\n \\n\\n Remember God’s goodnesse, \\n\\n \\n\\n His promise made. \\n\\n \\n\\n Remember God’s goodnesse; \\n\\n \\n\\n He sent His Son sinlesse \\n\\n \\n\\n Our ails for to redress; \\n\\n \\n\\n Be not afraid! \\n\\n \\n\\n In Bethlehem He was born, \\n\\n \\n\\n O thou Man: \\n\\n \\n\\n In Bethlehem He was born, \\n\\n \\n\\n For mankind’s sake. \\n\\n \\n\\n In Bethlehem He was born, \\n\\n \\n\\n Christmas-day i’ the morn: \\n\\n \\n\\n Our Saviour thought no scorn \\n\\n \\n\\n Our faults to take. \\n\\n \\n\\n Give thanks to God alway, \\n\\n \\n\\n O thou Man: \\n\\n \\n\\n Give thanks to God alway \\n\\n \\n\\n With heart-most joy. \\n\\n \\n\\n Give thanks to God alway \\n\\n \\n\\n On this our joyful day: \\n\\n \\n\\n Let all men sing and say, \\n\\n \\n\\n Holy, Holy!” \\n\\n \\n\\n Having concluded the last note, they listened for a minute or two, but found that no sound issued from the schoolhouse. \\n\\n \\n\\n “Four breaths, and then, ‘O, what unbounded goodness!’ number fifty-nine,” said William. \\n\\n \\n\\n This was duly gone through, and no notice whatever seemed to be taken of the performance. \\n\\n \\n\\n “Good guide us, surely ‘tisn’t a’ empty house, as befell us in the year thirty-nine and forty-three!” said old Dewy. \\n\\n \\n\\n “Perhaps she’s jist come from some musical city, and sneers at our doings?” the tranter whispered. \\n\\n \\n\\n “‘Od rabbit her!” said Mr. Penny, with an annihilating look at a corner of the school chimney, “I don’t quite stomach her, if this is it. Your plain music well done is as worthy as your other sort done bad, a’ b’lieve, souls; so say I.” \\n\\n \\n\\n “Four breaths, and then the last,” said the leader authoritatively. “‘Rejoice, ye Tenants of the Earth,’ number sixty-four.” \\n\\n \\n\\n At the close, waiting yet another minute, he said in a clear loud voice, as he had said in the village at that hour and season for the previous forty years —“A merry Christmas to ye!” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1382/41450.html","bookId":1429,"book":{"id":1429,"title":"绿茵树下 Under the Greenwood Tree","description":"简介： 《绿林荫下》(Under the Greenwood Tree)是托马斯哈代于1872年匿名发表的一部小说，这是他的第二部小说，也是他威塞克斯系列小说的第一部。这本小说的情节围绕着教堂圣乐团展开。梅尔斯托克教区圣乐团于圣诞前夜挨家挨户巡回演出，乐团成员包括年轻人迪克杜威、他的父亲...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1382","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
