{"id":83731,"no":14,"title":"Page 14","content":"Her legs are trembling and a moment later, she goes limp and releases my hair. Her breathing deepens and slows, a contrast to the panting of just moments ago. One down. I lick my lips to collect the last taste of Laurelyn before I sit up to remove my T-shirt. I toss it to the floor and slide off the edge of the bed so I can remove my pants and undies. When I\u0027m as naked as she is, I crawl up her body, stopping along my way to place another kiss against her belly. God, I wish I knew if there was a little miracle growing inside her right now. I settle between her legs and we\u0027re face to face. Heart to heart. Skin on skin. She reaches for my face and strokes her fingertips down my cheeks. \"This scruff is extra…stimulating.\" I\u0027m pretty sure that\u0027s a good thing. Maybe even great. \"More stimulating, huh? Does that mean you want me to keep it?\" \"Abso-fucking-lutely,\" she says with a mischievous grin. \"I would have hidden your razors had I known what that kind of scruff would feel like when you went down.\" She\u0027s being funny but what I\u0027m about to say isn\u0027t at all comical. I prop on my elbows so I\u0027m not crushing her with my weight, and I take her face in my hands so we\u0027re eye to eye. \"I love you, Laurelyn Paige Prescott.\" Her eyes tear up and I press my forehead to hers because I can\u0027t watch. I\u0027ve never been able to stand seeing her cry. \"Please don\u0027t cry, baby.\" She grabs my head and pushes it away from hers. I\u0027m forced to look at her and watch the tears roll down the sides of her face. \"They\u0027re happy tears—the best kind—because I love you too and I\u0027m so very happy.\" She has a million and one reasons to tell me to fuck off—and she probably should—but I can see that she isn\u0027t going to. By some miracle, she still loves me. \"You\u0027re the only angel in my life, Laurelyn.\" She grabs me behind my neck and brings my mouth down to hers. She kisses me softly and slowly and when she releases me, her mouth is still against mine so I feel the movement of her lips. \"Make love to me.\" I\u0027m still nestled between her legs. She brings them up and parts them wider for me to get closer. I\u0027m hard and ready against her drenched entrance, but I don\u0027t know if I should use a condom. I don\u0027t want to ruin the moment by asking and frankly, I don\u0027t want her to tell me I need one. I want to be inside her without anything between us, so I relinquish the entire control of contraception to this woman I absolutely adore. She knows I\u0027m about to go in. If she doesn\u0027t tell me we need a condom, then there\u0027s only two options: she\u0027s either back on track with her pills or she\u0027s already pregnant with my baby. As if she senses the battle raging inside my head, she lifts her hips against me and coaxes my tip inside of her. She rocks her hips and it\u0027s all the invitation I need. I slide my remaining length into her until I\u0027m as deep as I can be in this position. Oh, fuck! She feels so good. I have missed being inside of her so much. I\u0027ve only made love to Laurelyn one other time. I didn\u0027t realize how I felt about her then. But now, I know I love her. There\u0027s not a bit of doubt in my mind. \"It\u0027s been so long since I felt you—far too long.\" I\u0027m sliding in and out of her and I\u0027m overcome by the need to tell her what she means to me. I trail kisses up her neck until my mouth hovers over her ear. \"I love you so much, Laurelyn. I swear I do.\" I can\u0027t stop feeling like I need to tell her over and over to make up for all the times I didn\u0027t. Her hands leave my back and she runs her fingers through my hair. Her nails gently scrape my scalp and goosebumps form all over my body. \"I love you too, Jack Henry. So very much.\" I slow my thrusts because I want this to go on forever and ever. My hands find hers and I bring them above her head where I lace our fingers together tightly. She is my everything and I\u0027m never letting her get away again. She opens her eyes and they watch mine as I move above her. As I\u0027m sliding in and out, I can\u0027t help but notice how incredibly tight she is. There\u0027s not a doubt in my mind—no other man has been inside her. I believed her when she said that there hadn\u0027t been another, but feeling her like this gives me a bit more satisfaction. And pleasure. I thrust the last few times before I\u0027m about to come. I don\u0027t ask her if I need to pull out. I\u0027m sure she\u0027d tell me if she wanted me to. \"Oh, Laurelyn,\" I groan as I squeeze her hands and thrust one last time as I come inside her. She brings her legs up around my waist and crosses her ankles behind my back. She uses the strength in her legs to bring me closer until there\u0027s not a bit of space between us. Mmm. Coming inside her. That\u0027s something else I\u0027ve missed. I pull out after I\u0027m completely emptied and satiated. I roll to my back and pull Laurelyn to lie against my chest. I rub my hand up and down her arm. She\u0027s still cold, so I reach for the covers and bring them up over us. I\u0027m still catching my breath as I kiss the top of her head and hold her tightly. This is the place I want to be always—anywhere that includes my American girl wrapped in my arms. \"It was a mistake to not tell you how I felt. It\u0027s haunted me since the day I came home and found you gone. You\u0027ll never know how sorry I am for letting you slip through my fingers. But it won\u0027t happen again because I\u0027m never letting you go. Ever.\" She has no idea about the future I want with her—that I want her to be my wife—but I don\u0027t dare bring that up right now. I don\u0027t want to frighten her with talk of marriage. She can\u0027t possibly be in a place where she\u0027d trust me enough, so I choose to postpone that conversation for another time. Her hand is on my chest and she\u0027s rubbing it back and forth over my nipple. \"If you knew you loved me, why couldn\u0027t you say it?\" \"I denied what I was feeling for you. I told myself I didn\u0027t know what my feelings were. It all felt so complex at the time, and I wanted to avoid the complications. But as hard as I tried, I couldn\u0027t evade loving you. You made me fall hard. I\u0027ve never loved a woman until you.\" She lifts her face from my chest to look up at me. \"It took everything in me to not come running back to Australia to beg you to have me. I know I wasn\u0027t supposed to, but I had the number to the phone you used for calling me. I can\u0027t tell you how many times I thought about calling it, just to see if you would answer. But I was terrified of you turning me away. I couldn\u0027t have taken it if you had.\" Incredible! All this time we were only one phone call away from one another. \"I\u0027ve carried your mobile with me every day since you left. I knew you had the number because you used it to transfer our photos to your personal phone. I got your number from the phone records and tried calling you, but I was too late. You\u0027d already canceled your service.\" \"Yeah. I had to switch and get a new number.\" I don\u0027t want to hear the story behind that right now. I know it isn\u0027t going to sit well with me and I just want to enjoy this time together. \"I never stopped hoping you\u0027d call and I\u0027d hear your voice on the other end.\" \"I wish I had. If I\u0027d known how you felt, I would\u0027ve called. Hell, I would\u0027ve never left you in the first place. God, that must\u0027ve been bad when you found my letter.\" It was awful—the absolute worst day of my life. There have been so many mistakes made between us, on my part and hers, and saying I love you didn\u0027t automatically mean she\u0027d agree to live happily ever after with me. \"What if I\u0027ve changed my mind and decided I want complicated? What if I want to try?\" Her finger is on my stomach and she\u0027s tracing that invisible infinity symbol like she always does when she\u0027s nervous. \"When I fell before, you didn\u0027t catch me.\" She\u0027s right. She told me she loved me and I let her down. But never again. Never. \"I\u0027ll always be sorry for that, Laurelyn. You\u0027ve never had a single person in your life who didn\u0027t let you down, but that\u0027s not who I\u0027m going to be. I swear I\u0027ll be there for you, if you\u0027ll let me.\" Because of the men in Laurelyn\u0027s past, she\u0027s destined to have trust issues and she\u0027s never hidden this from me. We didn\u0027t have problems with it when our agreement defined very clear expectations, but a normal relationship will be different. I\u0027m certain it won\u0027t come easy for us, but I\u0027m prepared to do anything it takes to be with her. \"I can\u0027t lie. This—me and you—scares the shit out of me.\" I\u0027d be worried if she weren\u0027t frightened. \"Me too, but wouldn\u0027t you rather be scared together than be miserable apart? Because I know that\u0027s what I\u0027d be without you.\" \"You\u0027re right. I\u0027ve done the being-miserable-apart thing for the last three months and it blows. I\u0027m ready to try the scared-shitless-together part.\" Chapter Nine I turn my back to Jack Henry and snuggle against him. It hasn\u0027t been quite long enough but I know he\u0027s going to have me again as soon as he\u0027s ready. I\u0027m definitely willing whenever all systems are go. His hand slides around my waist and he rubs it in a circular motion on my stomach again. He seems to be hung up on that area tonight for some reason. I cup my hand over his. \"Are you discovering a second time how much you like my belly-button piercing? You can\u0027t seem to stay away from it tonight.\" \"Your piercing isn\u0027t what I\u0027m fixated on.\" Hmm…that sounds interesting. Maybe he\u0027s already revving up for round two. That was quicker than expected, but it has been a long time. I scoot back so I\u0027m pressed against him. \"Then what has you so mesmerized tonight?\" He doesn\u0027t make a move or answer right away. \"I found your birth control pills after you were gone.\" \"Oh.\" I knew I\u0027d left them somewhere in the bedroom, so I\u0027m not at all surprised by him bringing that up. I suspect he probably had quite the come-apart when he found them since I already know how badly he wants to avoid a pregnancy. \"There were two nights we didn\u0027t use condoms about the time you missed your pills. I didn\u0027t even attempt to pull out, so you can understand why I would\u0027ve spent the last three months wondering if you were pregnant.\" He pushes my hair aside and kisses the back of my neck. \"Don\u0027t be afraid to tell me if you are because of that fucked-up misunderstanding we had at my parents\u0027 house.\" His mouth is hovering over my ear and he sucks my lobe. \"I love you so much and I swear I\u0027d love our baby too.\"","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-14.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: Beauty from Surrender (Beauty #2) How do you move on when he’s every song you sing? After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
