{"id":83732,"no":15,"title":"Page 15","content":"\\n\\n Just when I think I can\u0027t love this man more, he says something like that and I fall even deeper.\\n\\n I reach for his hand splayed on my stomach and lace my fingers through his. He clenches it tightly as he waits for me to answer his question. \"I\u0027m not pregnant.\"\\n\\n But right now he sure makes me wish I were.\\n\\n \"I caught up on the pills I missed with a new pack as soon as I got home.\"\\n\\n He doesn\u0027t act relieved the way I\u0027d expect. Did he want me to be pregnant? Before this moment, I thought he would\u0027ve freaked out big time over a pregnancy, but his telling me that he\u0027d love our baby makes me think otherwise.\\n\\n \"I had to ask, Laurelyn. It was driving me crazy thinking you might have our baby growing inside you but were too afraid to tell me because of how foolish I acted before.\"\\n\\n \"I probably would\u0027ve been scared to tell you.\" Hell, who am I kidding? I would\u0027ve been petrified to tell him I was having his baby. \"Just so you know, I\u0027m not on the pill anymore because of my migraines. I had an IUD placed since it didn\u0027t look like I\u0027d be wanting to have children any time in the near future.\"\\n\\n \"I would\u0027ve been okay with it if you were. I meant what I said. I love you and I\u0027d love our baby.\"\\n\\n It never ceases to amaze me how much this man can make me desire him. I\u0027m not sure if it\u0027s his hands on my body or hearing him promise to love our baby that never was, but one of the two has me wanting him fiercely.\\n\\n I\u0027m already grinding my bottom against his groin when I realize what I\u0027m doing and I feel how hard he is against me. Yeah, it\u0027s been long enough for him to be ready again. He slides his hand from my stomach to between my legs and I feel his mouth against the skin on my neck.\\n\\n He cups his hand between my legs and rubs me until he ignites each and every nerve ending from my waist down. I have no doubt that he remembers exactly what my body needs as he circles the area around my most sensitive spot.\\n\\n When I rock my hips against his hand, he glides two fingers inside me and uses his thumb to slowly massage my ecstasy controller and the responsive area around it. I begin to feel those earth-shattering contractions as they initiate deep inside me. The sensations are coming hard and fast because he\u0027s too damn good at this. I think he suspects the rush coming over me because he slows the motion of his fingers, but it only ends up applying more deliberate pressure and I spiral even faster. The escalating pleasure is everywhere—in my groin, down my legs, making them stiffen, even radiating to my toes, curling them. In this moment, Jack Henry holds total power over me, which I have a feeling he covets, and I freely give myself to him.\\n\\n When I reach the end of my orgasm, I melt against him. \"Woo. That was another pleasant reminder.\"\\n\\n \"You know that I\u0027m not even close to being done yet, baby.\"\\n\\n Of course he isn\u0027t. My caveman never is. \"Good.\"\\n\\n He kisses the back of my neck as his hands gently explore my body. But I want…more. I reach over my head so I can touch him behind me and he kisses the side of my face. \"Jack Henry, you\u0027ve already made love to me—and it was absolutely wonderful—but it\u0027s been three months since we were together and I really just need you to fuck me hard.\"\\n\\n I hear his husky laughter next to my ear. \"Baby, you don\u0027t have to tell me twice.\" He takes my hands and lifts both of them above my head as he uses his hips to coax me onto my stomach. \"Face down.\"\\n\\n Face down. It sounds so dirty the way he says it. And I love it. From behind—it\u0027s one of his favorite positions and he\u0027s incredibly talented at it, so I know this is going to be great.\\n\\n I roll with him and he\u0027s holding my arms captive above my head. He scoots me up in the bed and places my palms flat against the headboard. He nips at my earlobe and whispers, \"Whatever you do, don\u0027t bend your arms.\"\\n\\n \"Whatever you say.\" I\u0027ll do anything this man tells me to in this moment.\\n\\n His knees are on the outside of my thighs forcing my legs together—not his usual method at all—and I feel him pushing against my bottom as he grips my hips. I\u0027m still slick from his semen so he easily slides inside me after he finds the perfect angle.\\n\\n Oh my…this is different. We\u0027ve never done it like this before.\\n\\n The position is unexpected because he\u0027s pushing my legs together instead of apart but it feels incredible. He presses my hips into the bed, pounding me into the mattress each time he thrusts deeper. Now I know why he wanted my arms locked. He knew he\u0027d slam my head into the headboard and give me a concussion if I didn\u0027t give him some resistance.\\n\\n Jack Henry follows instructions well. I tell him to fuck me hard and he doesn\u0027t disappoint. He never does.\\n\\n I feel his warm skin all over my back when he lowers his body against mine. I hear his ragged breath in my ear. His thrusts are slower but still hard and deep. I know what that means; he\u0027s already close to coming so I wait to hear him call out my name. But he doesn\u0027t. Instead, I hear him groan into my ear, \"Ohh, I fucking love you,\" as he pushes deep inside me one last time.\\n\\n I don\u0027t think those words are supposed to go together, or that I\u0027m supposed to like hearing them this much, but Jack Henry totally makes it work for me.\\n\\n He\u0027s catching his breath as he kisses my shoulder over the patches of freckles he told me he missed. I peer back at him. \"I fucking love you too.\"\\n\\n He laughs as he kisses my back between my shoulder blades. He pulls out and trails kisses down my spine. I innately arch my back as chills erupt over my skin. His mouth moves to my lower back and I feel his tongue sweep across the dip he loves so much. His little back fetish can be so weird sometimes but I must admit, I love feeling his wet tongue on my skin. \"I\u0027ve had withdrawals from not being able to taste this little salty spot after I\u0027ve finished fucking you.\"\\n\\n \"You\u0027re such a weirdo.\" I wonder if there\u0027s a name for his strange obsession.\\n\\n \"I know but you love it.\" His mouth moves down to my ass cheek and he bites it playfully.\\n\\n \"A sweat-licking, ass-biting freak—that\u0027s what you are,\" I laugh as I turn over to face him.\\n\\n He rolls with me and brings my head to rest against his chest. I hitch my leg over him and he rubs his hand up and down my thigh until he reaches my cheek and squeezes. \"It\u0027s true. I\u0027m a confirmed sweat-licking arse-biter. But that only applies to this sweet bum, baby.\"\\n\\n Only my sweet bum, huh?\\n\\n I\u0027m in total bliss but I know what a highly sexual being Jack Henry is and I can\u0027t stop myself from wondering if there have been other women in his bed the last three months. He asked me if I\u0027d been with Charlie, so don\u0027t I have the right to know if he\u0027s been with other women?\\n\\n Hell yeah, I have every right to know, but does that mean I can handle it if there have been women taking my place? I don\u0027t know. Not knowing is torture but I also know I\u0027d be in agony if he told me he\u0027d been intimate with another woman. I\u0027m not sure I can stand hearing those words, so I debate if I want to go to that place with no return.\\n\\n I have to know. \"You asked me if I\u0027d been with Charlie. Now I\u0027m asking you the same question. Have you been with others?\"\\n\\n He laughs but I don\u0027t because I find no humor in my question. \"I ask you if you\u0027ve been with one man and you ask me if I\u0027ve been with others. Plural, as in more than one.\"\\n\\n \"Or plural as in many.\"\\n\\n He slaps my ass and squeezes it hard as he pulls me near. \"Baby, my cock has only been acquainted with Mrs. Palmer and her five sisters.\"\\n\\n He didn\u0027t say there hadn\u0027t been women in his bed. \"Answer me. Does that mean there haven\u0027t been other women over the last three months?\"\\n\\n He rubs his palm over my ass cheek where he slapped me. \"I haven\u0027t been inside another woman since you.\"\\n\\n I\u0027m not sure I\u0027ve ever felt more relieved. \"Good. Let\u0027s keep it that way.\"\\n\\n Chapter Ten\\n\\n As I tell her that I haven\u0027t been inside another woman, I\u0027m being honest, but it\u0027s only a half-truth. There has been another woman and it was a close call. It\u0027s true that I didn\u0027t fuck her, but I have no doubt in my mind that what I did with her will count for something in Laurelyn\u0027s book. I\u0027ll have to tell her about it at some point, but now isn\u0027t the time. Right now, I just want to hold her in my arms and make up for lost time.\\n\\n I\u0027m trailing my fingertips softly up and down her spine when she lifts her face from my chest. I think she\u0027s searching my eyes for the truth. \"I believe you.\"\\n\\n Now I feel even worse as I look at her smiling up at me. Just like that, she believes me so easily. I\u0027m such a selfish dick because I choose to have this perfect time with her rather than man up and be totally honest.\\n\\n She puts her face back on my chest and I\u0027m grateful because I don\u0027t want her looking into the windows of my soul. I\u0027m afraid she\u0027ll see my deceit.\\n\\n She places her palm flat on my chest and begins moving her hand in a slow circular motion. \"Tell me about everyone back home.\"\\n\\n I start my family update by telling her about the morning Mum stormed into my place at Sydney and beat me with her purse after I confessed the truth about our relationship. Laurelyn shoots straight up in the bed and twists to look at me. \"Your mother knows about our agreement?\"\\n\\n \"Yeah, and she was none too happy with me about it.\"\\n\\n She covers her eyes with her hand and scrunches her nose. \"Oh, God. Margaret has to think I\u0027m the biggest whore for sharing a bed with you for three months without telling you my name.\"\\n\\n \"Mum thinks no such thing. She loves you.\"\\n\\n She takes her hand from her eyes. \"I\u0027d think I was a slut if I were her.\"\\n\\n \"But she doesn\u0027t think that about you at all.\" I debate saying the next words but decide I want to so I can see her reaction. \"She wants me to bring you back and make you her daughter-in-law.\" I\u0027m quite certain Mum would also settle for me making Laurelyn her daughter-in-law and then bringing her back.\\n\\n I don\u0027t come right out and say that I want to marry her. I don\u0027t even say I\u0027m the one who wants it, but I do. I really do and I can\u0027t mistake the shocked expression on Laurelyn\u0027s face. She clearly wasn\u0027t expecting me to say anything remotely close to talk of making her my wife. \\n\\n","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-15.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: Beauty from Surrender (Beauty #2) \\n How do you move on when he’s every song you sing? \\n After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? \\n Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?\\n","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
