{"id":83733,"no":16,"title":"Page 16","content":"\n I told myself I wouldn\u0027t mention marriage for fear of scaring her off, but I don\u0027t see fear in her eyes. It\u0027s something entirely different and it gives me hope—hope that she might have me as her husband.\n She\u0027s doing that thing again where she\u0027s searching my face. I think she\u0027s looking for a clue as to what\u0027s on my mind so she\u0027ll know how to respond. \"Umm…those sound like some pretty big plans Margaret has for me.\"\n That is such a Laurelyn move. She answers me without answering me, and I recognize that as her signature defense mechanism. She\u0027s using it because she\u0027s afraid, so I owe it to her to take the first step. I love this woman and I can do it for her if she needs me to.\n There was a time when she was able to bare her heart and soul to me, and I\u0027ll make sure she trusts me that way again.\n \"Laurelyn, I never expected to love you but I do…with every fiber of my being.\" She breaks into a huge grin when she recognizes my use of her words from the letter she left for me. \"I\u0027ve spent the last three months learning how me without you feels, and I\u0027ve hated every minute. I never want to do it again.\" I reach for her hand and lace my fingers through hers. This isn\u0027t me proposing—because I want that to be something unforgettable—but I\u0027m going to tell her how much I want to marry her one day soon so we can talk about our future and how we\u0027ll compromise to make things work. \"I want…,\" I start but I\u0027m interrupted by my mobile ringing—Margaret McLachlan\u0027s ringtone. Her timing couldn\u0027t be worse and she\u0027d keel over if she knew what she\u0027d just prevented me from doing.\n \"Who\u0027d be calling you this time of night?\" I wasn\u0027t planning to take my mum\u0027s call because I don\u0027t want this time interrupted, but I hear the suspicion in Laurelyn\u0027s voice and know I\u0027m left without a choice. I have to take Mum\u0027s call so I can put Laurelyn\u0027s unease to rest. It has no place between us.\n \"It\u0027s my mum. She doesn\u0027t always consider the time change between Sydney and Nashville.\" But I know the real reason behind her call. She knew I was going after a big lead tonight to locate the woman I thought was Laurelyn. She\u0027s checking in to see if all is well.\n I slide out of bed, completely naked, to retrieve my phone. Laurelyn props up on one elbow to watch me cross the room. \"That\u0027s a mighty fine view I\u0027ve been missing.\"\n \"I\u0027m going to show you some other things you\u0027ve been missing too,\" I laugh before I take Margaret McLachlan\u0027s call. \"Hi, Mum.\"\n She cuts straight to the chase. \"I know it\u0027s late where you are, but I couldn\u0027t stand it. I have to know if you found her.\"\n \"Yes, Mum. She\u0027s with me now.\"\n She squeals like a child. \"Oh, that\u0027s wonderful news—exactly what I was hoping to hear. Are things going as you hoped they would?\"\n This is Margaret\u0027s code for asking, without actually asking, if we\u0027re making up for lost time. \"They were.\"\n \"I interrupted whatever you were doing?\"\n \"Indeed you did.\"\n \"Son, if you stopped to answer the phone, then you weren\u0027t doing whatever well enough and you need to get back to her and do it better. Don\u0027t answer the phone next time.\"\n Damn. I just got zinged by my mum. \"I\u0027m gonna let that one slide, old girl. We\u0027ll call you later when we\u0027re finished doing whatever.\"\n \"Please do, because I want to know everything.\" She can forget that. \"I love you, son, and I\u0027m so proud of you. I won\u0027t ask to talk to her now, but please tell Laurelyn how happy I am and that I miss her terribly.\"\n \"I will and I love you too.\"\n I end the call and silence my phone before I drop it on the couch. There\u0027ll be no more interruptions from that little noisemaker tonight.\n I return to bed and slide in next to Laurelyn. She doesn\u0027t hesitate in scooting closer to put her head on my chest, wrapping her arm and leg around me. \"I presume Margaret is pleased?\"\n \"Yes. She\u0027s satisfied with me for the first time in months. She asked me to tell you how happy she is and that she misses you.\" I thought she\u0027d lose her mind when we figured out that finding Laurelyn wasn\u0027t going to be as easy as originally thought.\n \"I miss her too and I\u0027m glad she\u0027s so easy to please.\"\n Easy is a subjective word. \"I don\u0027t know that I\u0027d call her easily pleased. I\u0027m certain her preoccupation with Em being pregnant again is the only thing that saved me from getting my neck wrung.\"\n Her face lights up in a way that I only see when she talks about babies. \"Aww, Emma and Evan are having a third. When?\"\n \"She\u0027s not due until mid-September but she always has preterm labor and delivers about six weeks early, so we\u0027re predicting sometime in August.\"\n \"She told me they were finished having babies,\" she laughs.\n \"They were but they had an oops.\" As soon as I say the word oops, I realize my mistake because Laurelyn was an unplanned pregnancy.\n \"Then this baby and I already have one thing in common.\"\n I feel like such an arse. \"I\u0027m sorry. Oops was a bad choice of words. He was a surprise, one that they are both very happy about now.\"\n She quickly gets that glow back. \"It\u0027s a boy?\"\n \"That\u0027s what they tell us.\"\n \"Two girls and a boy. That sounds like a perfect little family to me.\"\n I remember her saying she wanted at least two. \"You think three is a good number?\"\n \"Yeah, I think three sounds wonderful.\"\n Hmm. Three. I never even saw myself with one until a few months ago. Now, I have to get used to the idea of three. But I can and I will for Laurelyn. If she wants three, then that\u0027s how many she\u0027ll have.\n I wake from the best night\u0027s sleep I\u0027ve had in months, and it\u0027s because my beloved is by my side. I didn\u0027t wake in a panic and reach out for her in the night only to find her side of the bed empty. In fact, I don\u0027t recall waking at all until this moment.\n I feel like a trellis the way Laurelyn\u0027s wrapped around me. It\u0027s a first because she hates being touched while she sleeps. She has always insisted on having her space, preferably while she is lying on her stomach with the covers riding low to expose her lower back.\n Although I lie perfectly still, it\u0027s as if she can sense my brain waking and her eyes flutter open. When I see her caramel eyes staring back at me, I can\u0027t stop the smile that spreads across my face or resist kissing the top of her brunette head. \"Good morning.\"\n \"Why, yes—it is a very good morning indeed. And it\u0027ll get even better if you\u0027ll give me a second in the bathroom.\"\n She gives me a quick kiss on the mouth and I think she\u0027s going to jump up for the bathroom but she doesn\u0027t. Instead, she strokes her hand along my jawline. \"I\u0027ve missed feeling the roughness of your face against my skin in the mornings, but this is even better than before.\"\n That\u0027s all it takes for me, reminded of our early morning naughties, to get ready for what I want to do to her. \"Don\u0027t linger in the bathroom for long or I\u0027ll come in after you.\"\n She has that look in her eye—a challenge—daring me. \"You wouldn\u0027t.\"\n I grab her hand and bring it down to wrap around my cock so she can feel how hard it is for her. \"You better believe I\u0027ll be busting through that door in two minutes if you don\u0027t have your sweet arse back out here.\"\n \"Then maybe I need to work on this before I get out of bed.\"\n She slides up and over until she\u0027s on top of me. I feel her warm breath beneath my ear where she\u0027s kissing my neck. \"Do you like it when my mouth is on your neck right here?\"\n \"Yes.\" And I do because she knows exactly how to hit that sensitive spot with her tongue.\n \"Good. I like it too.\"\n She takes her time migrating down my body and stops when her mouth is in the center of my stomach. She scrapes her nails down my chest until she reaches the small patch of hair below my belly button. \"Do you like my tongue here?\"\n \"Yes,\" I hiss through gritted teeth because her fingers have wandered over to the ticklish spot on each side of my groin. She flattens her tongue against my stomach and drags it in one slow, upward motion and then drags her fingernails down through my happy trail. \"But this isn\u0027t really where you want my mouth right now, is it?\"\n \"No.\" It definitely is not the place I\u0027m craving her lips most.\n \"Tell me where you want my mouth.\"\n I reach for my cock and stroke it under her chin in a come hither motion. \"Baby, I\u0027m dying for it to be all over this.\"\n \"Please don\u0027t die. You wouldn\u0027t get to enjoy this if you did,\" she says. A naughty grin spreads across her face as she goes down.\n I feel her tongue sweeping over my tip and my body shudders involuntarily. I think I\u0027ve grown more sensitive to the feel of her wet tongue while we\u0027ve been apart. \"Baby, that feels so damn good.\"\n The curtains are pulled closed but there\u0027s a crack where they meet, allowing the proof of morning into the room. The daylight peeking through illuminates the room just enough for me to be able to see Laurelyn and the motions of what she\u0027s doing—sort of.\n Her hair has fallen forward, blocking my view, so I reach down and gather her long brown locks into a fisted ponytail on the back of her head. Mmm. That\u0027s a beautiful sight.\n I hold her hair in one hand and massage the back of her neck with my other while she performs what can only be described as an oral pole dance on my cock. That\u0027s my girl. Her body slides up, down, and around in a beautifully sexy way on a pole; her mouth does the same during a blowjob.\n \"You don\u0027t have a clue how fucking hot you look when you\u0027re doing that.\" She lifts her eyes and makes contact with mine. And that winds it up for me. I\u0027m a goner. \"I\u0027m about to come,\" I warn her in case she doesn\u0027t want me to go in her mouth. But just like always, she keeps going. \"Fuck,\" I groan as I release. \"You give amazing head.\"\n When she\u0027s finished, she inches up my body and makes a show of licking her lips. I can\u0027t resist asking, \"Still tastes like chicken?\" \n","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-16.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: \n Beauty from Surrender (Beauty #2) \n How do you move on when he’s every song you sing? \n After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? \n Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?\n \n","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
