{"id":83745,"no":28,"title":"Page 28","content":"\"Anything you want. How about the day after tomorrow? Then you can be back to have the weekend to rest before you\u0027re in the studio Monday.\" \"Let\u0027s do it.\" I\u0027ve never been to Las Vegas. Until I started touring with Southern Ophelia, Australia and New Zealand had been the extent of my travels—and those were on someone else\u0027s dime. I guess this trip is too, but I don\u0027t feel quite so dependent. I could afford this trip if Jack Henry would let me pay. But he won\u0027t because that\u0027s just how he is. We check into our hotel and of course, he\u0027s booked the most luxurious suite they have—the presidential, I\u0027m certain. It\u0027s enormous and the decor is extravagant with no shortage of luxurious furnishings in shades of gold and taupe. The bathroom is majestic in matching tones of gold and the frisky girl inside me can\u0027t wait to see what Jack Henry comes up with for us to do in the gigantic jetted tub the size of a small swimming pool. Maybe we should stay more than two days. I can see how this could be relaxing. Maybe I shouldn\u0027t be in such a hurry to get back since Jack Henry and I can have way more fun in that double shower with a gazillion faucet heads than in my apartment\u0027s small fiberglass tub. \"What do you want to do first?\" I\u0027m hoping he\u0027ll say we\u0027ll soak in the tub together. We haven\u0027t done that in so long. He taps me on the end of my nose. \"You, my dear, have an appointment in fifteen minutes.\" \"For what?\" \"A little well-deserved pampering. I scheduled you an hour and a half in the spa for all those girlie things you like so much, and then an hour with a masseuse—a woman, per my request. I don\u0027t want any man putting his hands on you, especially your back. That\u0027s mine and no other man touches it.\" It\u0027s a back, not a vagina. \"You can be such a caveman sometimes.\" \"I won\u0027t argue with that.\" He puts his arms around my waist and I feel his warm breath against my ear as he huskily says, \"I\u0027m going to have you on that table in my wine cave again one day, but next time, I\u0027m fucking you until you scream.\" \"I think I recall some screaming at some point,\" I remind him. \"Yeah, but not the kind I have in mind for next time.\" \"Promise?\" \"Abso-fucking-lutely.\" He grabs both of my butt cheeks and playfully growls. \"Now, get your perfect little bum downstairs for some pampering.\" \"Yes, sir.\" He kisses the side of my face where I\u0027m still sporting a dark bruise. \"I have a conference call so I\u0027ll be here in the room tending to business back home if you should need me for any reason.\" \"Okay.\" \"Enjoy yourself.\" As if there\u0027s a chance I wouldn\u0027t. \"Don\u0027t worry. I have a feeling I will.\" I enter the spa and the receptionist heads me off before I can say a word. \"Mrs. McLachlan?\" I\u0027m taken aback by the Mrs. part. I\u0027m used to being called Miss McLachlan, but I like the sound of it so much that I don\u0027t correct her. \"Yes.\" \"We are ready for you. Right this way.\" I follow the small brunette into a room at the back of the spa. She places a velour robe on the chair as she directs me on what we\u0027ll be doing. Once I\u0027m changed, I\u0027m taken to a private room where the magic begins. I\u0027m mannied, peddied, scrubbed, and buffed to perfection. My hour and a half ends too soon but then I\u0027m taken to another room where I\u0027m placed face down on a table and draped only across my bottom. I\u0027ve never had a massage but I see why Jack Henry wouldn\u0027t want a masseur for me. I\u0027m all but naked. The next hour flies entirely too quickly, but I\u0027m feeling refreshed and relaxed when I leave. I pass several shops in our hotel lobby as I\u0027m walking toward the elevator. Something in the window of a shop catches my eye—a showgirl costume. It\u0027s a black bustier, trimmed in red with a bow sitting directly between the breasts. There are black and red feathers forming a skirt across the back and a small matching headpiece. The look is complete with black fishnet stockings. It\u0027s hot. He\u0027d love it. Hmm…I brought lingerie with me but that sort of stops being a surprise when I wear it every time. There\u0027s no way he\u0027d be expecting to see me looking like a burlesque showgirl. When in Vegas… I go inside the boutique for a closer look and a saleswoman immediately asks how she can help me. I point to the costume in the window. \"How much is this?\" \"Umm…I believe it\u0027s fifteen hundred.\" Shit! Fifteen hundred bucks for that tiny little outfit? I\u0027m still not used to having extra money to spend, so it feels like a lot to blow on something like that. I stand there looking at it and although it\u0027s the most ostentatious purchase I\u0027ll have ever made, I want it for my caveman. \"I\u0027ll take it.\" I ease the door open and hold it as it closes. I want to sneak inside the suite without Jack Henry knowing so I can hide my purchase. I hear him talking in the living room, so I tiptoe past the doorway and then make a run for the bedroom. I quickly look around, searching for the perfect hiding spot. Rats. There\u0027s not a lot of hiding places so I opt for putting it on the shelf in the closet. Maybe he won\u0027t have reason to go digging around in there. I nonchalantly walk out of the bedroom into the living room and Jack Henry notices me. He\u0027s talking to Clyde from the Chalice Vineyard but motions with his hand for me to join him on the couch. He inspects my nails and removes my sandals so he can see my toes better. I giggle when he brings my foot to his mouth and sucks my big toe, all while never missing a beat as he talks business. That is so damn hot. I feel that familiar stirring deep down in my groin when he gives me those eyes—the ones that tell me he wants to do something very naughty to me as soon as he\u0027s finished with his conference call—but I want to save it all for tonight when I\u0027m wearing my surprise for him. I turn my head from side to side and give him the I don\u0027t think so finger shake. He counters with a slow nod and a look of determination. He hates when I tell him no, but he\u0027s just going to have to not like it because I\u0027m saving all my love for tonight. I want his anticipation to be at its highest. \"No,\" I whisper. \"There will be none of that until later.\" \"That sounds good, Clyde. I\u0027ll call you in a few days and we\u0027ll discuss it further.\" I know he\u0027s cutting off his call sooner than he would have because of my rejection. \"And just why not?\" \"You\u0027re not the only one who can come up with surprises. I have plans for you later tonight, mister, and they don\u0027t include getting it on right now.\" \"Getting it on,\" he laughs. \"I call it getting off.\" \"Getting on. Getting off. Whatever you want to call it, we\u0027re not getting any right now. You\u0027re waiting.\" \"I don\u0027t like waiting,\" he whines, still sexy as hell. \"Well, tough. You are because I said so.\" I must remain firm and resist anything he throws my way. \"But just think…it\u0027ll be so damn good when you finally get it.\" \"I don\u0027t want to think about how damn good it\u0027ll be. If I do, I\u0027ll get hard with no relief in sight,\" he complains. \"You\u0027re right. Don\u0027t think about it.\" I kiss him quickly. \"I\u0027m going to get ready.\" \"So I can\u0027t join you in there?\" I knew he\u0027d try. \"No.\" \"Shit, Laurelyn. You\u0027re being pretty cold to the guy who just had you pampered for two and a half hours.\" \"It\u0027ll be worth it. I promise.\" \"I\u0027m holding you to that.\" And I have no doubt he will. \"I would expect nothing less.\" I walk into the suite\u0027s living room, ready for the night. I\u0027m wearing a black one-shouldered minidress and mile-high fuck-me pumps. Yep. They\u0027re definitely devil shoes but I\u0027ll gladly take the discomfort because I love the way Jack Henry looks at me when I wear them. I\u0027m also wearing my diamond star pendent because I never take it off and the diamond stud earrings he gave me the night we went to the opera. I reach up to touch them as I enter the room and I\u0027m reminded of some fond memories at the Opera House. \"Baby, you look so fucking hot.\" See? Another example of how he adds fucking to a sentence and makes my panties want to melt away. \"Thank you.\" \"But you\u0027re missing something,\" he hints. I\u0027ve fallen for this trick in the past, but I know what it means when he says that. He has a gift for me—an expensive one—and I feel the little girl in me jumping up and down impatiently to see what her present is. \"What do you have for me?\" He walks over to the coffee table and picks up a long skinny black box. \"I had this made for you.\" He pops it open and inside is one of the most beautiful diamond bracelets I\u0027ve ever seen. \"It\u0027s beautiful.\" It\u0027s a continuous pattern of diamond stars, identical to my pendant, alternating with infinity symbols. \"It\u0027s beautiful.\" \"Do you want to guess the significance?\" He does that—always giving me jewelry with significance. \"I understand the stars but I don\u0027t know what the infinity sign is about.\" \"It symbolizes two different things. First, you always use your finger to trace an imaginary infinity symbol when you\u0027re nervous about something.\" I had no idea I did that. \"I do?\" \"Yes. And the second part symbolizes my love for you. It\u0027s infinite—limitless and impossible to measure.\" I run my finger over one of the infinity links. He doesn\u0027t have a lot of competition but this is by far the sweetest thing anyone\u0027s ever done for me. \"My love for you is endless and you never cease to amaze me.\" I suddenly feel very guilty for denying him what I know he wants. \"I\u0027ll get naked for you right now if that\u0027s what you want. I won\u0027t make you wait until later.\" \"I didn\u0027t take you for one to bend so easily to my will, Miss McLachlan,\" he laughs.","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-28.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: Beauty from Surrender (Beauty #2) How do you move on when he’s every song you sing? After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
