{"id":83752,"no":35,"title":"Page 35","content":"\\n\\n My parents have invited me to dinner at my mom\u0027s place. It\u0027s official. They\u0027re no longer a thing in private. They\u0027re an item in the eyes of the world but the media is so bad that none of us can go out in public anymore.\\n\\n Becoming a star isn\u0027t what I thought it would be.\\n\\n My front door is clear for the first time in weeks. I guess there are only so many pictures you can take of a person leaving their apartment before that becomes uninteresting.\\n\\n Dinner is intriguing—some sort of casserole. I\u0027m not really certain what kind and I choose to not ask. My mom\u0027s never been much of a cook.\\n\\n We\u0027re busy discussing the schedule for the band and the new music I\u0027m working on when my mom spies the ring on my finger. \"What is that?\"\\n\\n She isn\u0027t going to like this. \"It\u0027s a ring.\"\\n\\n \"What kind of ring?\"\\n\\n She knows. She doesn\u0027t have to ask. \"Engagement.\"\\n\\n \"So he asked you to marry him?\"\\n\\n I\u0027m not going there with the whole in a roundabout way issue. \"Yes. Jack Henry has asked me to marry him.\"\\n\\n My mother huffs as she looks at my dad. A look passes between them and I\u0027m not sure how to decipher its meaning, but it pisses me off. I know it means they\u0027ve been discussing us. \"Laurie, you can\u0027t marry him.\"\\n\\n I\u0027m absolutely, positively, one hundred percent not shocked by this. \"And why not?\"\\n\\n \"Because he\u0027ll have you moving to Australia. If you do, your career is over, plain and simple.\"\\n\\n I\u0027m beginning to care less and less about this career of mine. \"Would that be so bad if I was with the man I love?\"\\n\\n \"Are you kidding? Of course it would be bad. It would be terrible to watch you walk away from this success after such a short time. If you\u0027re this big today, think of where you\u0027ll be in a year from now.\"\\n\\n It doesn\u0027t take a genius to figure that one out. \"I already know where I\u0027ll be—on a tour bus traveling from one show to the next. I\u0027ve already been doing that, Mom, and I know what it\u0027s like. It\u0027s not great.\" I look at my dad. \"Does it ever get easier?\"\\n\\n He looks at my mom and they have a silent conversation as they sit across the table from one another. \"It takes some getting used to, but it gets better with time.\" I strongly suspect he\u0027s saying that because it\u0027s what she wants him to tell me.\\n\\n I should tell them the way I feel so they\u0027ll understand. \"It\u0027s like this. If Jack Henry hadn\u0027t come back into my life, I\u0027d probably be thrilled to spend every day on the road, but that isn\u0027t the way it went. He came looking for me because he loves me. And I love him. I know what my life feels like without him in it, and I hated every moment of it.\"\\n\\n \"He just left. You haven\u0027t had time to get used to him not being here, but that\u0027ll get better in time.\" She\u0027s grasping at straws.\\n\\n \"I don\u0027t want it to get better. I want to be with him.\"\\n\\n \"Baby, being with him means you don\u0027t get to have a career and you don\u0027t get to be with me or your dad. We\u0027ll never see each other. Would you walk away from singing? And from us?\"\\n\\n That\u0027s not how it would be. \"I would come back to see you when I could and you could come to Australia to visit us. You\u0027d love it. It\u0027s beautiful and the people are so friendly.\"\\n\\n \"No, you shouldn\u0027t count on me coming down there because I won\u0027t.\"\\n\\n My heart plummets when I hear my mom say she wouldn\u0027t visit me. I see the look on my dad\u0027s face and I think her resolution even surprises him, but he attempts to cover for her. \"I think your mom\u0027s just not excited about flying over the ocean.\"\\n\\n \"Sure.\" I\u0027m certain she wouldn\u0027t hesitate to fly anywhere with him if he asked. Nothing has changed. I\u0027m still taking a back seat to Jake Beckett like I always have. Why would I give up the man I love when it\u0027s obvious she\u0027ll always put the one she loves ahead of me?\\n\\n \"I gotta go.\"\\n\\n \"Baby, you want to say yes. I can see it in your eyes, but it would be a mistake to give up your career and family for this man. You can find someone else to love—someone from here. Maybe even a man in the music industry who will understand what this kind of life is like.\"\\n\\n She\u0027s such a hypocrite. \"Oh, you mean find someone else the way you did?\" She gives me that look that says she doesn\u0027t like what I\u0027m saying—and it\u0027s because it\u0027s the truth. \"Wait. I got that all wrong, didn\u0027t I? You didn\u0027t find anyone else because you could never move past loving him.\"\\n\\n My dad puts his hands up. \"Maybe we should all take a step back for a minute.\"\\n\\n His role isn\u0027t to referee. I\u0027m still undecided about what I think his part is here, but I\u0027ve been handling this woman by myself for twenty-three years and I don\u0027t need his help now. \"I\u0027m outta here.\"\\n\\n I don\u0027t have time for this shit. I have a decision to make and not with any of her kind of help.\\n\\n I leave my mom\u0027s house and end up driving around for an hour before I park my car in front of Charlie\u0027s apartment. His living room light is on, so I take it as a good sign that he\u0027s probably home.\\n\\n I sit in my car for at least fifteen minutes trying to decide if I want to do this—tell him I\u0027m leaving the band. He\u0027s going to be so disappointed in me. I feel terrible doing this to them after they took me in the way they did. He was there for me when I needed him most, and now I\u0027m going to abandon him just as things are really taking off.\\n\\n I can\u0027t keep having these kinds of thoughts. I have to start living for me at some point and to hell with what\u0027s best for everyone else. They can figure that out on their own. I\u0027m the only person in control of my destiny.\\n\\n I\u0027m nervous as I stand on Charlie\u0027s doorstep and want to run away when he opens the door. \"Hey. What are you doing here?\"\\n\\n \"I\u0027m sorry. I know I should\u0027ve called first, but I was out driving and found myself in front of your place. Can I come in?\"\\n\\n \"Of course.\" He opens the door wide for me and I walk into his living room. My eyes go for the couch immediately to check for a chick and then I remember that\u0027s probably not where she\u0027d be if he had a girl over. \"You don\u0027t have company tonight?\"\\n\\n \"Nah. I have a friend coming over in a while, but it\u0027s just me for the next little bit.\" He gestures for me to sit on the couch and I can\u0027t help but think how his apartment looks so bachelor. None of Jack Henry\u0027s houses look like this—like a bunch of guys should be sitting around drinking beer, watching sports. \"Did everything go okay with Jack leaving today?\"\\n\\n \"Yes and no.\" Charlie looks at me and I can tell by his expression that he\u0027s waiting for an explanation. \"I let him board his plane, if that\u0027s what you mean. He should be arriving in Sydney in a few hours.\"\\n\\n \"I was wondering if you\u0027d let him go,\" he laughs. \"So what is the part that didn\u0027t go okay?\"\\n\\n \"He wants me to marry him.\" I wait a moment before I drop the next bomb, but Charlie saves me from saying the words.\\n\\n \"And he wants you to move to Australia.\"\\n\\n \"Yes. But I haven\u0027t given him an answer.\" I think he\u0027s waiting for the rest of the story. \"I love him and I know what being apart from him feels like. It\u0027s terrible and I don\u0027t want to do it again.\"\\n\\n \"So this is you telling me you\u0027re leaving the band?\"\\n\\n I tell myself to be strong because I\u0027m doing this for Jack Henry and me. \"It is.\"\\n\\n \"Randy\u0027s gonna flip out.\"\\n\\n Flip out is probably putting it gently. \"I know. I hate doing this to you, but I can\u0027t stay when my heart isn\u0027t in it.\"\\n\\n \"I understand. And I\u0027m not mad. I\u0027d do the same thing if the situation were reversed. There\u0027s nothing I wouldn\u0027t do to have a love like what you have with Jack.\"\\n\\n He doesn\u0027t seem disappointed or shocked. \"Thank you for not making me feel like a asshat.\"\\n\\n \"I could never make you feel bad about loving Jack, but you may think I\u0027m a huge ass after you hear the request I have for you.\"\\n\\n What kind of request could make me think poorly of sweet Charlie? \"I could never think that about you. You\u0027re too adorable for that.\"\\n\\n \"We\u0027ll see how you feel after I ask.\"\\n\\n Now I\u0027m a little frightened. \"Okay…\"\\n\\n \"Will you stay through the next tour so we don\u0027t have to cancel?\"\\n\\n That means I\u0027d have to stay until the end of October. \"That\u0027s over three months away.\"\\n\\n \"We don\u0027t have time to find a replacement for the tour, but we could start fresh with someone after we finish the tour and get back in the studio.\"\\n\\n I don\u0027t want to do it. But I sort of owe them that after the way they took me in when I didn\u0027t have a chance in hell. \"I can do that.\"\\n\\n If Jack Henry knows I\u0027ve decided to marry him, he\u0027ll want me to leave the band immediately. So I can\u0027t tell him yet. He won\u0027t care or understand my reasoning behind my obligation to help my band.\\n\\n Besides…after what he did to me, he deserves to do a little ass-kissing.\\n\\n Chapter Twenty-Six\\n\\n I\u0027m still in bed when I hear the annoying sound of my doorbell ringing over and over. Because of the time change, it was really late—or really early—when I arrived home. I\u0027m jet-lagged and I prefer to lie in bed so the perpetrator will leave, but there\u0027s one problem with that idea: I can predict with one hundred percent accuracy who it is and I already know she won\u0027t go away.\\n\\n Margaret McLachlan is here to see Laurelyn.\\n\\n I disarm the security system and open the door to my mum\u0027s smiling face. No surprise there. \"Mum. Couldn\u0027t you have waited until a little later? I\u0027ve only been home a few hours.\"\\n\\n \"No. I couldn\u0027t wait or I would have. I\u0027m here to see my future daughter-in-law. Where is she?\"\\n\\n I probably should\u0027ve called and warned her ahead of time that Laurelyn wasn\u0027t coming with me, but I didn\u0027t want to be hassled or forced to explain the situation over the phone. \"She didn\u0027t come back with me.\" \\n\\n","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-35.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: Beauty from Surrender (Beauty #2) \\n How do you move on when he’s every song you sing? \\n After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? \\n Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?\\n","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
