{"id":83721,"no":4,"title":"Page 4","content":"\n Fuck, Mum\u0027s gonna be pissed. \"I have to tell you something and you\u0027re not going to be happy with me about it.\"\n She\u0027s glaring at me. \"I\u0027m quite put out with you already, son.\"\n \"I know, and it\u0027s about to get worse.\" I feel like a kid again, fessing up about something juvenile. Only this isn\u0027t juvenile. It\u0027s adult and very serious. \"When Laurelyn and I began dating, we had no expectations of ever becoming more than a temporary relationship. We both knew she was in Australia for three months so we agreed to date and have fun together during that time. No strings attached.\"\n She looks annoyed. \"You\u0027ve already told me that.\"\n I brace myself for the worst. \"I did but that\u0027s not all of it. I didn\u0027t tell her my real name when we met. I didn\u0027t want her to know because I didn\u0027t want contact of any kind with her after our relationship ended. Using an alias was the one way I could ensure she wouldn\u0027t track me down afterward. She was pretty pissed when I first told her what I wanted, but she eventually agreed. Since she didn\u0027t know my real name, she chose to not tell me hers.\"\n \"Laurelyn isn\u0027t her name?\" she asks, her expression puzzled.\n \"Laurelyn is her first name. I accidentally discovered it when her friend let it slip, but her last name, Beckett, is an alias. She never told me her last name.\"\n I can almost see my mum\u0027s brain in action as she pieces everything together. \"But you brought her home to meet us and she called you Jack Henry.\"\n \"There was no hiding my identity when we came to see Dad at the hospital, so I told her the truth about myself later that night,\" I explain. \"From that moment on, she knew everything about me.\"\n \"But you never thought she was important enough to ask her last name?\" She\u0027s raising her voice at me. \"Even after she knew who you were?\"\n I hesitate in answering because she isn\u0027t going to like my response. \"Her last name didn\u0027t matter to me because I didn\u0027t intend on changing our plans just because she knew who I was. I didn\u0027t love her then.\"\n \"Bullshit!\" she yells at me. \"You were in love with that girl when you brought her into my house. I knew it the minute I saw the two of you together. And she was so obviously in love with you. She might not have told you yet, but you\u0027d have to be a fool to not see it.\"\n I can\u0027t argue with her assessment because I\u0027ve most certainly been a fool.\n I prop my arms on the cold granite countertop and lean over, closing my eyes. I\u0027d like to put my head down against the cool to see if I can find some relief because it hurts like a motherfucker. \"I chose to not see it because I didn\u0027t want to fall in love with her.\"\n \"But you did anyway.\"\n \"Yeah, I did, and she left without saying goodbye, before I could tell her.\"\n \"I can not believe you, Jack Henry!\" Mum picks up her purse to smack me several good times. Hard. She\u0027s the only mother I know who would use her handbag to beat her thirty-year-old son. \"She lived with you and shared your bed and you never asked her last name?\" She draws back and whacks me again. Shit! She\u0027s really mad.\n I don\u0027t deflect the purse flying at me because it\u0027s her way of releasing her anger. It\u0027s really sort of humorous, but I\u0027d never make the mistake of laughing at Margaret McLachlan when she\u0027s in one of her fits. \"That poor girl must\u0027ve been so hurt. I can\u0027t say I really blame her for slipping away without a goodbye. I\u0027d have probably done the same thing if I\u0027d told a man I loved him and he stared blankly at me.\"\n \"I didn\u0027t stare blankly at her.\"\n \"Then what did you do?\"\n I hang my head in shame with the thought of how I fucked her afterward. \"You don\u0027t want to know.\" I go to the drawer where I keep the medicines so I can get something for my headache. \"I know how stupid I\u0027ve been, Mum. But I\u0027m gonna make it right with Laurelyn. I know lots of other things about her life that will lead us to her.\"\n \"Who\u0027s us?\"\n \"I\u0027ve hired someone to go to the States to find her. A private investigator.\" I leave off the particulars about my extensive use of his services and why I know he\u0027ll find her for me in no time at all.\n \"You should be the one to go after Laurelyn. It\u0027ll mean more to her if you do,\" she argues.\n \"I wish I could, but I don\u0027t have the necessary skills to track her down.\"\n \"Son, I\u0027m not sure finding her is going to be your biggest problem. You\u0027ve hurt her in a terrible way. She may not forgive you, so it might be smart to prepare yourself for rejection.\"\n The thought of Laurelyn rejecting me is painful but it\u0027s a reality I can\u0027t ignore. \"I\u0027m going to do everything in my power to make it up to her because I hate what me without her looks like. I\u0027m going to win her back, and when I do, I\u0027m never letting her go again.\"\n I think she suspects what I\u0027m implying but I decide to clear it up for her so there\u0027s no misunderstanding. \"I don\u0027t want to ever spend another day without Laurelyn. When I find her, I\u0027m going to ask her to be my wife.\"\n Chapter Three\n I stand in front of the mirror and look at myself. I look like hell.\n I smudge coverup under my eyes to disguise the dark circles but there\u0027s no hiding the misery there. No amount of makeup is going to camouflage that. I pointlessly sweep some blush across my cheeks, but it only makes my face appear more sunken and my eyes bigger. I don\u0027t have to get on the scales to know I\u0027ve lost weight. If my face doesn\u0027t prove it, my loose clothes do.\n My food situation is almost nonexistent but I can\u0027t make myself go grocery shopping. It doesn\u0027t matter anyway. I can\u0027t eat. The pizza I ordered two nights ago is still sitting almost untouched in the fridge. A few bites—that\u0027s all I could force down before it almost sent me running to the bathroom. That\u0027s what I\u0027m reduced to. I miss him so badly, the misery of being away from him makes me sick.\n I know I can\u0027t continue like this. I\u0027m still waiting for it to get better. Come on, it has to get better at some point, right?\n I\u0027ve survived almost two weeks without Jack Henry. It\u0027s day twelve I\u0027ve been without his touch, without hearing his voice, without feeling him next to me in bed at night. It hasn\u0027t been easy. If I\u0027m being truthful, it\u0027s been the worst hell I\u0027ve ever experienced in my life—well beyond any pain I\u0027ve ever felt before.\n My mother has begged me all week to come over to see her—and my father. She\u0027s so happy about being reunited with his married ass. Even having not been taught how wrong it is to be with a married man, I still know it\u0027s not right. The only good part of her obsession is that she\u0027s been too wrapped up in him to come by to check on me.\n I sigh as I finish my makeup and assess the situation. It\u0027s a poor one, I\u0027m afraid. I look miserable and I\u0027m certain Blake is going to believe it\u0027s all for him. It sickens me to think of seeing him today, but I can\u0027t hide in this apartment for the rest of my life. I have a career that requires attention. My manager, David, was very clear when he told me to get my ass straightened out and down to the label to salvage what career I have left. It\u0027s either do as he says, or he\u0027s dropping me. I can\u0027t allow that to happen.\n I recall his words and want to puke. Laurelyn, you kiss Blake\u0027s ass or whatever it takes to make this right.\n Nothing is going to make this right. It sickens me further that my future and career is dependent on Blake Phillips. He holds the power to ruin me if he tells the right industry people that I walked out on him during the recording. No one will care about the circumstances leading up to why I did it.\n I make the drive to the studio and sit in my car for a few minutes gathering my thoughts—and strength—before I get out. It\u0027s not Blake I\u0027m nervous about. It\u0027s the idea of reentering my old life, my life before Jack Henry. I\u0027m overwhelmed by the thought of entering that building because it feels like I\u0027m going backward. I hate it.\n I look at his picture on my phone, stroking my finger over his five o\u0027clock shadow and remembering how stubbly his face would feel at the end of the day, especially by the time he came to bed. Oh, how I miss its roughness against my face. My stomach. My inner thighs. My…\n I have to stop this. As much as I\u0027d like to, I can\u0027t sit in my car outside the studio and mind-fuck Jack Henry all day.\n I take a deep breath and straighten my shoulders before I walk into the building leading to my past. I\u0027m waiting for the elevator when I feel a presence behind me. I know it\u0027s him—Blake. I don\u0027t have to look to know but I pretend I don\u0027t realize anyone is there. He doesn\u0027t say a word and I wonder if it\u0027s because he didn\u0027t know I was coming and he\u0027s shocked to see me. I hope he\u0027s speechless because he\u0027s ashamed of what he did to me.\n When the doors ding open, I step inside and he follows me. We\u0027re alone in the small space. Thank God it\u0027s only for the brief ride up to the twelfth floor because the tension is suffocating.\n My eyes are locked straight ahead and I say nothing. I see him in my peripheral vision, blatantly staring at me, but I don\u0027t acknowledge him. I pretend he\u0027s invisible—because that\u0027s what he is to me.\n \"Laurelyn,\" he says as he reaches for my arm. I step back so he misses it. \"Don\u0027t be this way. I\u0027ve missed you.\"\n I escape him through the opening doors without uttering a word. We\u0027ll speak soon enough when I\u0027m forced to talk to him about our recording contract—and I will talk business—but I refuse to address personal things or our past. As far as I\u0027m concerned, there\u0027s nothing to discuss.\n David is waiting in the studio, and he crosses the distance between us. Despite his anger, he embraces me. \"Laurelyn, I\u0027m very happy you came. I wasn\u0027t sure you\u0027d show but I\u0027m glad to see you\u0027re here.\"\n It\u0027s good to see David. He has been a presence in my life for a long time and I\u0027ve missed him. He knows nothing about the things that occurred between Blake and me, and that\u0027s the way I plan to keep it. I don\u0027t want him to be disappointed in me for jeopardizing my career by becoming involved with my producer—married or not. \n","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-4.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: \n Beauty from Surrender (Beauty #2) \n How do you move on when he’s every song you sing? \n After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? \n Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?\n \n","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
