{"id":83757,"no":40,"title":"Page 40","content":"\n I shrug. \"I guess I\u0027m as ready as I\u0027ll ever be.\"\n He leans over and cradles my face with his hands before kissing me. It\u0027s so soft and sweet that I feel like I\u0027d float away if he weren\u0027t holding on to me. \"Don\u0027t worry. They love you and they\u0027re going to be thrilled for us.\"\n \"I know. I\u0027m not worried. I think excited is a better word.\"\n \"I agree. Come on. Let\u0027s go make Margaret McLachlan\u0027s life complete.\"\n Jack Henry knocks on the door but doesn\u0027t wait for anyone to answer before he opens it. He ushers me in first and we stand in the foyer. \"Mum? Dad?\"\n \"In the living room,\" I hear Henry call out.\n He squeezes my hand. \"Let\u0027s do this thing.\"\n The scene in the living room is a surreal vision for what life with this family will be like. Henry is sitting in his recliner. Evan is in the floor with the girls and the new baby, Aidan. The women are absent and I assume they\u0027re in the kitchen finishing up dinner. Celia squeals with delight when she sees me, \"Law-re-ren!\" I love the way she says my name and I\u0027m so happy she remembers me.\n She races across the floor and I bend down to catch her in my arms. \"Hey, girlie girl. Look at you and how much you\u0027ve grown.\"\n \"Where you been?\" she asks as only a child can.\n \"I had to go to my house for a little while, but I\u0027m back and I\u0027ll be here from now on.\"\n She claps her hands and screams, \"Yay!\"\n Mila toddles over to get in on a little of the action and I know Jack Henry is having a fit to get me into the kitchen, but I can\u0027t resist picking her up for just a minute. \"And look at you. You\u0027ve grown so much and you\u0027re walking now.\" She stares at my face and touches it with her sticky hand. I know she doesn\u0027t remember me but it looks like we\u0027ll be fast friends again.\n \"Baby,\" she says as she points to Aidan on the blanket in the floor and wiggles to get down.\n \"I see your new baby brother,\" I tell her as I put her back on the floor.\n Evan gets up with Aidan and comes over to hug me and I get my first good look at the baby. He has a headful of dark curls and I can easily see that his eyes are a blue-gray color like Evan\u0027s, instead of Emma\u0027s brown. \"I see we have another handsome McLachlan man.\"\n Evan holds him out for me. \"We do. He\u0027s ten weeks old.\" I take him in my arms and he smells so good—that sweet little fragrance that only a baby has.\n Henry is up from his chair and hugging me as I hold Aidan. \"We had no idea you were back.\"\n He hugs Jack Henry next. \"I know, Dad. We wanted her return to be a surprise for Mum.\"\n \"It certainly will be and probably couldn\u0027t have come at a better time. She\u0027s close to giving up on you, missy.\"\n I feel like I need to explain my absence. \"I had some things to take care of before I could free myself to come back, but it\u0027s all cleared up now.\"\n \"Whatever it was doesn\u0027t matter now. Please don\u0027t waste another second in here with us. I want Margaret to see you. She\u0027s going to be thrilled.\"\n I pass Aidan back to Evan and we walk to the kitchen with Henry ahead of us. \"Margaret, Jack is here and I hope you prepared enough for an extra guest. He brought company.\"\n She\u0027s standing in front of the sink washing her hands. She reaches for a dishtowel. \"Henry, I always cook more than we need. Of course, I…\" She trails off when she sees me. \"Laurelyn!\" she says and drops the towel and hurries over to me. She puts her arms around me and squeezes tightly as she plants a kiss on my cheek. \"You\u0027re here. Finally. I\u0027d almost decided you weren\u0027t going to come.\"\n \"It took a little longer than I liked, but I made it.\"\n She releases me so she can see my face. \"Is this a visit?\"\n \"No. I\u0027m here to stay.\" It feels good to say the words.\n \"So, it\u0027s official now? He finally asked you the way he should have months ago and you\u0027re engaged to be married?\" She takes my left hand and brings it up for a look. She reaches for her glasses on top of her head and pushes them to her nose. \"A cushion-cut diamond with a pavé halo in platinum. My boy did good.\"\n \"Your boy did excellent. His taste is impeccable.\" I\u0027m very glad he showed some restraint when choosing my ring. We all know he could\u0027ve bought a diamond the size of my head, but he knew that wouldn\u0027t be me. \"His choice is perfect and couldn\u0027t suit me better if I\u0027d chosen it myself.\"\n Emma and Chloe hug me and look at my ring while Margaret quizzes me. \"Have you picked a date?\"\n \"Not yet, but we\u0027re keeping it small and want to do it soon, so we were hoping we could depend on all of you to help plan it.\" I see the sheer joy on her face.\n \"Of course, we\u0027ll help. How soon is soon?\"\n We look at one another and shrug because we\u0027ve not gotten that far. I think he has an idea in his head but is afraid to say it, so I speak up. \"I know six weeks would be pushing it, but maybe it could be accomplished since it\u0027ll be small.\"\n He frowns at me. \"That\u0027s five weeks longer than I was planning.\"\n Chloe punches him in the arm. \"I don\u0027t think we can put a wedding together in a week unless it\u0027s at the courthouse, dummy.\"\n \"I\u0027m okay with that.\"\n Margaret puts up her hands. \"Well, I\u0027m not and I\u0027m guessing Laurelyn isn\u0027t, either.\"\n \"Laurelyn, you have to let me help organize the catering,\" Chloe offers. \"I have all kinds of new and innovative ideas for us to try.\"\n \"Absolutely, Chloe. I wouldn\u0027t dream of attempting it without your help.\" And it\u0027s the truth. I have no idea where I\u0027d begin.\n \"Would you mind if I organize a dinner for next weekend?\" Margaret interjects. \"Just a few friends and family to celebrate?\"\n Jack Henry doesn\u0027t let me answer. \"We should\u0027ve done it in Vegas while we were there.\"\n His mom whirls around on him. \"I would\u0027ve killed you if you had. I want to see my son get married.\"\n \"I know, Mum.\" He\u0027s laughing as he elbows her. I love their relationship—it\u0027s not like anything I\u0027ve ever seen before. \"I was kidding. And the dinner is fine with me if it\u0027s all right with Laurelyn.\"\n I have no objection. \"Of course that\u0027s fine. I need to start meeting your friends and family.\"\n \"Can we take you dress shopping tomorrow?\" Emma asks. \"You can\u0027t really plan anything until you have that because everything revolves around its style.\"\n I\u0027m certain dress choices in Wagga Wagga will be limited, and shopping in Sydney sounds like fun. \"Sure. I\u0027d love that.\" I always thought wedding dress shopping would be something I\u0027d do with my mom, but quite honestly, I think I\u0027d be more disappointed if my future mother-in-law didn\u0027t come to help me make my decision. \"Will you come with us, Margaret? I\u0027d really love for you to help me choose.\"\n \"Absolutely. I wouldn\u0027t miss it for anything.\"\n Jack Henry is driving us home when he reaches for my hand and gives it a squeeze. I love when he does that. \"You\u0027re very quiet. Everything okay with you or should I be worried?\"\n \"No worries. I was just thinking about the wedding. How would you feel about having it at Avalon? I think the vineyard would be beautiful and the wine cave would be perfect for the reception with the long banquet tables.\" He grins, and I suspect he\u0027s remembering what he did to me on one of those.\n \"I think you can have anything you desire. If you want to get married at Avalon, I\u0027ll make sure it happens.\" Will he always be this way? Giving in to my every whim?\n \"I think it\u0027s very fitting to be married there because it\u0027s the place so many firsts happened for us. It\u0027s where we came to know one another. And where we fell in love.\" Quite honestly, I can\u0027t think of anywhere else I\u0027d want to be married.\n \"And we don\u0027t have to worry about booking it, so that means we can make this happen sooner.\"\n As much as I\u0027d like to, I hope he\u0027s not thinking we could do it in a week. \"Not five weeks sooner like you suggested.\"\n \"Maybe not. What about having it a month from Saturday?\"\n \"The second weekend in December?\" I take out my phone and look at the date. \"The fourteenth?\"\n \"Why not? If we waited six weeks, that falls a few days after Christmas. I can\u0027t imagine that being a good time for anyone.\" He\u0027s right.\n \"Six weeks is pushing it, and four will be even tougher. But planning a wedding a few days after Christmas would be a nightmare. I can handle the fourteenth.\" I always wanted a summer wedding anyway. Looks like I\u0027ll get one in December.\n \"And it\u0027ll be our anniversary—a whole year since I met you.\"\n I didn\u0027t even think about that. \"Amazing. I can\u0027t believe it\u0027s been a year.\"\n \"That\u0027s because we\u0027ve spent most of it apart.\"\n So true. \"Well, that\u0027s never happening again. I don\u0027t ever want to be away from you. I\u0027m already contemplating never letting you leave to go to the other vineyards without me. I\u0027ll probably go with you every time and you\u0027ll be sick of me.\"\n \"I could never be sick of you, but I have been thinking about how we\u0027d handle me going out of town for so long.\" He takes his eyes from the road for only a second and glances at me before he looks back. \"I\u0027ve especially thought about how to handle it after we have kids. I know we have plenty of time before we have to worry about that, but I\u0027ve been thinking about selling some of the vineyards. I have too many anyway. And I want to spend time with you. All of this money means nothing if I can\u0027t be with you and our little ones when they get here.\"\n Sometimes I can\u0027t believe how lucky I am to have him. He says I\u0027m his dream come true, but it\u0027s the other way around. \"You\u0027re absolutely amazing. I\u0027d rip your clothes off and do dirty things to you if you weren\u0027t driving.\"\n \"This car has pull-over capability,\" he laughs, but something inside tells me he isn\u0027t kidding. \n","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-40.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: \n Beauty from Surrender (Beauty #2) \n How do you move on when he’s every song you sing? \n After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? \n Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?\n \n","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
