{"id":83766,"no":49,"title":"Page 49","content":"\"You want your mom and Margaret in here to help?\" It wouldn\u0027t feel right if they weren\u0027t. \"Yeah, I do.\" After Addison retrieves them, I stand in my robe by the bed as they work to remove my dress from the garment bag. My mom sighs when she sees it. \"Oh, Laurie. It\u0027s beautiful.\" It is the most beautiful wedding dress I\u0027ve ever seen. The perfect in-between shade of creamy vanilla lace over champagne charmeuse—something I never imagined myself choosing. I always thought lace was old-timey, but not in this case. It\u0027s a modern sleeveless trumpet gown with a romantic plunging-V neckline. My favorite part, and probably the reason I chose it, is the thick champagne sash around the waist adorned with a floral embellishment that matches the one in my hair. I step into my gown and Addison pulls it up. I suck in so she can zip me because it\u0027s a little snug in the waist. \"Sweetie, your seamstress didn\u0027t cut you any slack here.\" I work to situate my cleavage. \"No, she didn\u0027t. I said that I wanted it to be fitted and she did exactly as I told her, so I can\u0027t complain.\" It\u0027s even a little tighter in the chest than I thought it\u0027d be. \"Jack\u0027s going to be a huge fan of the boobage you have going on here. They look great.\" \"I just hope I manage to not pop one—or both—out during the reception when we dance.\" She reaches up and bounces them. \"Nah, you\u0027re good. Those puppies aren\u0027t going anywhere.\" I do a spin around and look at my mom and Margaret. \"What do you think?\" Margaret, being the courteous person she is, allows my mom to speak first. \"You\u0027re gorgeous, baby girl. Never doubt how proud I am of you or your decisions. Jack is a fine man and lucky to be making you his wife.\" \"You\u0027re a beautiful bride. Jolie will always be your mum, but I couldn\u0027t be more thrilled about being your other mother. You\u0027re one of my own from this day forward. Today you become Laurelyn McLachlan, my son\u0027s wife and the mother of my future grandchildren.\" Margaret puts her arms around and squeezes me. \"I love you. But please, don\u0027t make me wait long on a baby.\" \"I don\u0027t think you have to worry about that,\" I laugh. I see the surprised expression on her face. \"Are you pregnant?\" \"Not yet, but we\u0027ve been talking about it. A lot. Jack Henry\u0027s done a one-eighty. He told me he never wanted children after we first met, and now almost every other conversation is about kids.\" \"I thought he\u0027d never marry or want children, but then you came along and everything changed. You don\u0027t know how happy it makes me to know you\u0027re already talking about having sweet babies.\" \"Okay, ladies,\" Addison cuts in, \"I hate to be the one to interrupt, but we need to get Laurie rolling with the photographer so she\u0027ll be on time marrying Jack Henry if she wants to get to work on having those babies you\u0027re talking about.\" \"She\u0027s right. It\u0027s not that long until the ceremony begins.\" My mom passes me the bouquet of white roses. \"I love you, baby girl. Don\u0027t be nervous.\" \"I\u0027m not. I can\u0027t be because everything is perfect.\" And it is. I\u0027m marrying the man I love and every person who means something to me is here to witness and celebrate the beginning of our lives as Mr. and Mrs. Jack Henry McLachlan. Chapter Thirty-Six I\u0027m waiting for my bride in the heart of Avalon under a grapevine canopy covered with white roses and sheer white fabric. When the carriage stops, I can easily see Jake and Addison, but Laurelyn is hidden from view behind her father. He steps down from the carriage to assist Addison and that\u0027s when I get my first look at her. She\u0027s so beautiful, it takes my breath away. I\u0027ve always heard people say that, but it literally happens. She\u0027s proof of it. My chest is heavy like something is sitting on it. I inhale deeply because I\u0027m so short of breath. My heart is racing and my palms are tingly. I make fists and release them because they feel so strange. \"Don\u0027t lock your knees, bro,\" Evan whispers in my ear. \"What?\" He leans over. \"I see what you\u0027re doing with your hands. They\u0027re tingling because you\u0027re about to pass out. Unlock your knees.\" \"Oh.\" I do as Evan says and shift my weight from side to side. \"Now you look like you\u0027re doing Celia\u0027s pee-pee dance.\" \"Shut the fuck up.\" I turn to look at the minister because I know he heard me. \"Sorry.\" He shrugs as he shakes his head. Great. He thinks he\u0027s about to marry this beautiful woman off to a heathen. The music begins and Addison walks the rose petal-covered aisle first. Celia is next and skips down the aisle, making a game of throwing petals on the path. She then barrels over to sit in Emma\u0027s lap instead of taking her spot next to Addison. Our guests stand when the bridal chorus begins. I see Jake and Laurelyn at the other end of the path. Her arm is looped through her father\u0027s and they begin their walk toward us. I had no idea what her dress looked like or how she would wear her hair, but everything about her is perfect. I wouldn\u0027t change a thing. Once the music stops, the minister says far too many words and then Jake finally hands Laurelyn off to me. She passes her bouquet of white roses to Addison and I take her hands in mine. I slowly rub my thumbs back and forth over the top of her hands as the minister speaks. I have no idea what he\u0027s saying because I only want to get to the part where he says, \"I now present to you, Mr. and Mrs. Jack Henry McLachlan.\" She squeezes my hands as my cue because it\u0027s time for me to say my vows. We decided to write our own because nothing about us has been traditional thus far—why would we start now? I look into her caramel eyes. \"Today I lay at your feet the man I\u0027ve been so I may become the man you need me to be: your husband. Your lover. Your best friend. A father to our children. I promise to cherish and respect you, to care for and protect you, to comfort and encourage you, and stay with you for all eternity. I surrender my all to you this day and every one hereafter.\" Tears form in her eyes as I speak; I catch them with my thumb before they roll down her cheek. The minister then asks Laurelyn to recite her vows and I\u0027m surprised to see Chloe appear with L.\u0027s Martin. She takes it from my sister and watches my face while drawing a deep breath and slowly releasing it. It takes a moment before I realize what\u0027s going on here—she\u0027s going to sing her vows to me. \"I take you to be my best friend, my lover, my husband, and the father of our children. I will cherish our union and love you more each day than I did the day before. I will trust you and respect you, laugh with you and cry with you, loving you faithfully through good times and bad, regardless of the obstacles we may face together. I give you my hand, my heart, and my love from this day forward, for as long as we both shall live. You will always be every song I sing.\" \"That was beautiful, L.…and so unexpected.\" We exchange rings and the minister rambles on for too long as I anxiously wait to hear him tell me to kiss my bride. When he finally does, I do exactly what Laurelyn warned me not to do. I sweep her backward and pash her with all I have. When I pull her up, I expect to be chastised but all she has for me is a big, beautiful smile. And then comes my favorite part. \"I now present to you, Mr. and Mrs. Jack Henry McLachlan.\" We\u0027re in the air on the private jet I booked to Hawaii. Laurelyn has no idea where we\u0027re going, but I\u0027m taking her to our newly acquired private estate on the beach in Maui. It\u0027s one of my wedding gifts to her, and I know she\u0027s going to love it. But not as much as the music studio the architect is in the process of planning for her. Music will always be a part of her life, and I won\u0027t have her give it up because she thinks it\u0027s the only way we can be together. \"Thank you again for having the guys fly down to play at the reception. It was a wonderful surprise, almost as good as Margaret surprising me with my family.\" \"You\u0027re so very welcome, love.\" I bring her hand to my lips. I can\u0027t seem to stop kissing her since we officially became husband and wife. \"I didn\u0027t know your parents and grandparents were coming, and I wanted you to have someone there you considered family.\" She brings our clasped hands to her mouth. \"You are the best. I couldn\u0027t ask for more—unless you felt like telling me where we\u0027re going.\" \"Nope—only that we have almost eleven hours of flight time ahead of us.\" We\u0027re still buckled into our seats from takeoff, but I put my hand on her knee and begin sliding it up her leg. \"What ever shall we do with all this time we have on our hands?\" She pushes my hand down her leg. \"Jack Henry! You really have no shame, do you?\" \"Were you really ever under the impression that I did, Mrs. McLachlan?\" \"We\u0027ve barely even gotten off the ground and the flight attendants could walk this way any minute.\" The captain announces overhead that we are free to move about the cabin. I wag my eyebrows at my wife. \"That means we can take this to the bedroom.\" The flight attendants enter the cabin but I stop them in their tracks. \"You may leave the food and champagne. We\u0027ll serve ourselves and call if we need anything.\" \"Yes, sir,\" they say in unison before exiting the cabin. \"Well, you\u0027re going to make this the easiest assignment they\u0027ve ever had.\" If I don\u0027t see them again, that\u0027ll be just fine. \"That works for me.\" I\u0027m out of my seat and pulling her up from hers. \"Come on, L. Let\u0027s consummate this marriage in the sky so it\u0027ll be something we\u0027ll never forget.\" She rises from her seat. \"You are something else.\" \"I think you\u0027ve told me that before.\" She stops at the door and puts her finger against my chest. \"Can I at least have a minute to get ready?\" \"So you can slip into something special for me?\" \"Yes. And take care of the birth control issue before you have a chance to negate it since you\u0027ve proven to be a repeat offender.\"","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-49.html","bookId":1880,"book":{"id":1880,"title":"Beauty from Surrender (Beauty #2)","description":"Storyline: Beauty from Surrender (Beauty #2) How do you move on when he’s every song you sing? After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?","cover":"https://allnovel.net/images/beauty-from-surrender-beauty-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-surrender-beauty-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:53:20 PM"}}
