{"id":42989,"no":109,"title":"The Whirligig of Life","content":"JUSTICE-OF-THE-PEACE Benaja Widdup sat in the door of his office smoking his elder-stem pipe. Halfway to the zenith the Cumberland range rose blue-gray in the afternoon haze. A speckled hen swaggered down the main street of the \"settlement,\" cackling foolishly. Up the road came a sound of creaking axles, and then a slow cloud of dust, and then a bull-cart bearing Ransie Bilbro and his wife. The cart stopped at the Justice\u0027s door, and the two climbed down. Ransie was a narrow six feet of sallow brown skin and yellow hair. The imperturbability of the mountains hung upon him like a suit of armour. The woman was calicoed, angled, snuff-brushed, and weary with unknown desires. Through it all gleamed a faint protest of cheated youth unconscious of its loss. The Justice of the Peace slipped his feet into his shoes, for the sake of dignity, and moved to let them enter. \"We-all,\" said the woman, in a voice like the wind blowing through pine boughs, \"wants a divo\u0027ce.\" She looked at Ransie to see if he noted any flaw or ambiguity or evasion or partiality or self-partisanship in her statement of their business. \"A divo\u0027ce,\" repeated Ransie, with a solemn Dod. \"We-all can\u0027t git along together nohow. It\u0027s lonesome enough fur to live in the mount\u0027ins when a man and a woman keers fur one another. But when she\u0027s a-spittin\u0027 like a wildcat or a-sullenin\u0027 like a hoot-owl in the cabin, a man ain\u0027t got no call to live with her.\" \"When he\u0027s a no-\u0027count varmint,\" said the woman, \"without any especial warmth, a-traipsin\u0027 along of scalawags and moonshiners and a-layin\u0027 on his back pizen \u0027ith co\u0027n whiskey, and a-pesterin\u0027 folks with a pack o\u0027 hungry, triflin\u0027 houn\u0027s to feed!\" \"When she keeps a-throwin\u0027 skillet lids,\" came Ransie\u0027s antiphony, \"and slings b\u0027ilin\u0027 water on the best coon-dog in the Cumberlands, and sets herself agin\u0027 cookin\u0027 a man\u0027s victuals, and keeps him awake o\u0027 nights accusin\u0027 him of a sight of doin\u0027s!\" \"When he\u0027s al\u0027ays a-fightin\u0027 the revenues, and gits a hard name in the mount\u0027ins fur a mean man, who\u0027s gwine to be able fur to sleep o\u0027 nights?\" The Justice of the Peace stirred deliberately to his duties. He placed his one chair and a wooden stool for his petitioners. He opened his book of statutes on the table and scanned the index. Presently he wiped his spectacles and shifted his inkstand. \"The law and the statutes,\" said he, \"air silent on the subjeck of divo\u0027ce as fur as the jurisdiction of this co\u0027t air concerned. But, accordin\u0027 to equity and the Constitution and the golden rule, it\u0027s a bad barg\u0027in that can\u0027t run both ways. If a justice of the peace can marry a couple, it\u0027s plain that he is bound to be able to divo\u0027ce \u0027em. This here office will issue a decree of divo\u0027ce and abide by the decision of the Supreme Co\u0027t to hold it good.\" Ransie Bilbro drew a small tobacco-bag from his trousers pocket. Out of this he shook upon the table a five-dollar note. \"Sold a b\u0027arskin and two foxes fur that,\" he remarked. \"It\u0027s all the money we got.\" \"The regular price of a divo\u0027ce in this co\u0027t,\" said the Justice, \"air five dollars.\" He stuffed the bill into the pocket of his homespun vest with a deceptive air of indifference. With much bodily toil and mental travail he wrote the decree upon half a sheet of foolscap, and then copied it upon the other. Ransie Bilbro and his wife listened to his reading of the document that was to give them freedom: \"Know all men by these presents that Ransie Bilbro and his wife, Ariela Bilbro, this day personally appeared before me and promises that hereinafter they will neither love, honour, nor obey each other, neither for better nor worse, being of sound mind and body, and accept summons for divorce according to the peace and dignity of the State. Herein fail not, so help you God. Benaja Widdup, justice of the peace in and for the county of Piedmont, State of Tennessee.\" The Justice was about to hand one of the documents to Ransie. The voice of Ariela delayed the transfer. Both men looked at her. Their dull masculinity was confronted by something sudden and unexpected in the woman. \"Judge, don\u0027t you give him that air paper yit. \u0027Tain\u0027t all settled, nohow. I got to have my rights first. I got to have my ali-money. \u0027Tain\u0027t no kind of a way to do fur a man to divo\u0027ce his wife \u0027thout her havin\u0027 a cent fur to do with. I\u0027m a-layin\u0027 off to be a-goin\u0027 up to brother Ed\u0027s up on Hogback Mount\u0027in. I\u0027m bound fur to hev a pa\u0027r of shoes and some snuff and things besides. Ef Rance kin affo\u0027d a divo\u0027ce, let him pay me ali-money.\" Ransie Bilbro was stricken to dumb perplexity. There had been no previous hint of alimony. Women were always bringing up startling and unlooked-for issues. Justice Benaja Widdup felt that the point demanded judicial decision. The authorities were also silent on the subject of alimony. But the woman\u0027s feet were bare. The trail to Hogback Mountain was steep and flinty. \"Ariela Bilbro,\" he asked, in official tones, \"how much did you \u0027low would be good and sufficient ali-money in the case befo\u0027 the co\u0027t.\" \"I \u0027lowed,\" she answered, \"fur the shoes and all, to say five dollars. That ain\u0027t much fur ali-money, but I reckon that\u0027ll git me to up brother Ed\u0027s.\" \"The amount,\" said the Justice, \"air not onreasonable. Ransie Bilbro, you air ordered by the co\u0027t to pay the plaintiff the sum of five dollars befo\u0027 the decree of divo\u0027ce air issued.\" \"I hain\u0027t no mo\u0027 money,\" breathed Ransie, heavily. \"I done paid you all I had.\" \"Otherwise,\" said the Justice, looking severely over his spectacles, \"you air in contempt of co\u0027t.\" \"I reckon if you gimme till to-morrow,\" pleaded the husband, \"I mout be able to rake or scrape it up somewhars. I never looked for to be a-payin\u0027 no alimoney.\" \"The case air adjourned,\" said Benaja Widdup, \"till to-morrow, when you-all will present yo\u0027selves and obey the order of the co\u0027t. Followin\u0027 of which the decrees of divo\u0027ce will be delivered.\" He sat down in the door and began to loosen a shoestring. \"We mout as well go down to Uncle Ziah\u0027s,\" decided Ransie, \"and spend the night.\" He climbed into the cart on one side, and Ariela climbed in on the other. Obeying the flap of his rope, the little red bull slowly came around on a tack, and the cart crawled away in the nimbus arising from its wheels. Justice-of-the-peace Benaja Widdup smoked his elderstem pipe. Late in the afternoon he got his weekly paper, and read it until the twilight dimmed its lines. Then he lit the tallow candle on his table, and read until the moon rose, marking the time for supper. He lived in the double log cabin on the slope near the girdled poplar. Going home to supper he crossed a little branch darkened by a laurel thicket. The dark figure of a man stepped from the laurels and pointed a rifle at his breast. His hat was pulled down low, and something covered most of his face. \"I want yo\u0027 money,\" said the figure, \"\u0027thout any talk. I\u0027m gettin\u0027 nervous, and my finger\u0027s a-wabblin\u0027 on this here trigger.\" \"I\u0027ve only got f-f-five dollars,\" said the Justice, producing it from his vest pocket. \"Roll it up,\" came the order, \"and stick it in the end of this here gun-bar\u0027l.\" The bill was crisp and new. Even fingers that were clumsy and trembling found little difficulty in making a spill of it and inserting it (this with less ease) into the muzzle of the rifle. \"Now I reckon you kin be goin\u0027 along,\" said the robber. The Justice lingered not on his way. The next day came the little red bull, drawing the cart to the office door. Justice Benaja Widdup had his shoes on, for he was expecting the visit. In his presence Ransie Bilbro handed to his wife a five-dollar bill. The official\u0027s eye sharply viewed it. It seemed to curl up as though it had been rolled and inserted into the end of a gun-barrel. But the Justice refrained from comment. It is true that other bills might be inclined to curl. He handed each one a decree of divorce. Each stood awkwardly silent, slowly folding the guarantee of freedom. The woman cast a shy glance full of constraint at Ransie. \"I reckon you\u0027ll be goin\u0027 back up to the cabin,\" she said, along \u0027ith the bull-cart. There\u0027s bread in the tin box settin\u0027 on the shelf. I put the bacon in the b\u0027ilin\u0027-pot to keep the hounds from gittin\u0027 it. Don\u0027t forget to wind the clock to-night.\" \"You air a-goin\u0027 to your brother Ed\u0027s?\" asked Ransie, with fine unconcern. \"I was \u0027lowin\u0027 to get along up thar afore night. I ain\u0027t sayin\u0027 as they\u0027ll pester theyselves any to make me welcome, but I hain\u0027t nowhar else fur to go. It\u0027s a right smart ways, and I reckon I better be goin\u0027. I\u0027ll be a-sayin\u0027 good-bye, Ranse - that is, if you keer fur to say so.\" \"I don\u0027t know as anybody\u0027s a hound dog,\" said Ransie, in a martyr\u0027s voice, \"fur to not want to say good-bye -- \u0027less you air so anxious to git away that you don\u0027t want me to say it.\" Ariela was silent. She folded the five-dollar bill and her decree carefully, and placed them in the bosom of her dress. Benaja Widdup watched the money disappear with mournful eyes behind his spectacles. And then with his next words he achieved rank (as his thoughts ran) with either the great crowd of the world\u0027s sympathizers or the little crowd of its great financiers. \"Be kind o\u0027 lonesome in the old cabin to-night, Ranse,\" he said. Ransie Bilbro stared out at the Cumberlands, clear blue now in the sunlight. He did not look at Ariela. \"I \u0027low it might be lonesome,\" he said; \"but when folks gits mad and wants a divo\u0027ce, you can\u0027t make folks stay.\" \"There\u0027s others wanted a divo\u0027ce,\" said Ariela, speaking to the wooden stool. \"Besides, nobody don\u0027t want nobody to stay.\" \"Nobody never said they didn\u0027t.\" \"Nobody never said they did. I reckon I better start on now to brother Ed\u0027s.\" \"Nobody can\u0027t wind that old clock.\" \"Want me to go back along \u0027ith you in the cart and wind it fur you, Ranse?\" The mountaineer\u0027s countenance was proof against emotion. But he reached out a big hand and enclosed Ariela\u0027s thin brown one. Her soul peeped out once through her impassive face, hallowing it. \"Them hounds shan\u0027t pester you no more,\" said Ransie. \"I reckon I been mean and low down. You wind that clock, Ariela.\" \"My heart hit\u0027s in that cabin, Ranse,\" she whispered, \"along \u0027ith you. I ai\u0027nt a-goin\u0027 to git mad no more. Le\u0027s be startin\u0027, Ranse, so\u0027s we kin git home by sundown.\" Justice-of-the-peace Benaja Widdup interposed as they started for the door, forgetting his presence. \"In the name of the State of Tennessee,\" he said, \"I forbid you-all to be a-defyin\u0027 of its laws and statutes. This co\u0027t is mo\u0027 than willin\u0027 and full of joy to see the clouds of discord and misunderstandin\u0027 rollin\u0027 away from two lovin\u0027 hearts, but it air the duty of the co\u0027t to p\u0027eserve the morals and integrity of the State. The co\u0027t reminds you that you air no longer man and wife, but air divo\u0027ced by regular decree, and as such air not entitled to the benefits and \u0027purtenances of the mattermonal estate.\" Ariela caught Ransie\u0027s arm. Did those words mean that she must lose him now when they had just learned the lesson of life? \"But the co\u0027t air prepared,\" went on the Justice, \"fur to remove the disabilities set up by the decree of divo\u0027ce. The co\u0027t air on hand to perform the solemn ceremony of marri\u0027ge, thus fixin\u0027 things up and enablin\u0027 the parties in the case to resume the honour\u0027ble and elevatin\u0027 state of mattermony which they desires. The fee fur performin\u0027 said ceremony will be, in this case, to wit, five dollars.\" Aricla caught the gleam of promise in his words. Swiftly her hand went to her bosom. Freely as an alighting dove the bill fluttered to the Justice\u0027s table. Her sallow cheek coloured as she stood hand in hand with Ransie and listened to the reuniting words. Ransie helped her into the cart, and climbed in beside her. The little red bull turned once more, and they set out, hand-clasped, for the mountains. Justice-of-the-peace Benaja Widdup sat in his door and took off his shoes. Once again he fingered the bill tucked down in his vest pocket. Once again he smoked his elder-stem pipe. Once again the speck-led hen swaggered down the main street of the \"settlement,\" cackling foolishly.","sourceLink":"http://novel.tingroom.com/shuangyu/42/1343.html","bookId":617,"book":{"id":617,"title":"The Stories Of O.Henry欧亨利短篇小说集","description":"简介： O. Henry was the pen name of American writer William Sydney Port- er (September 11, 1862 – June 5, 1910). O. Henry short stories are known for wit, wordplay, warm characterization and clever twist endings....","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/42","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
