{"id":111600,"no":13,"title":"Page 13","content":"\n He reached down to the passengers and said, “Let’s go. Let’s send some people up and over. You. English fella. You first.”\n “Why me first?”\n “Because you ain’t hurt, and you can help catch the rest. And Ernie’s got his hand all tore up.”\n “Fine,” Gordon Rand relented, and began the tricky work of climbing a ladder that leaned out over his head. But he was game for it, and more nimble than the tailored foreign clothes let on. Soon he was out through the portal and standing atop the Zephyr, then sliding down its side, down to the ground.\n Mercy heard him land with a plop and a curse, but he followed through by saying to someone, “That wasn’t so bad.”\n That someone asked, “How many are there inside?”\n “The captain, the copilot, and half a dozen passengers and crew. Not too many.”\n “All right. Let’s get them down, and out.”\n Someone else added, “And out of here. Bugle and tap says the line’s shifting. Everybody’s got to move—we might even be in for a retreat to Fort Chattanooga.”\n “You can’t be serious!”\n “I’m serious enough. That’s what the corporal told me, anyway.”\n “When?”\n “Just now.”\n “Son of a bitch. They’re right on top of us!”\n Mercy wished she could see the speakers, but she could see only the frightened faces of her fellow passengers. No one was moving yet; even Robert was listening to the gossip outside. So she took it upon herself to move things along.\n “Ma’am? Sir?” she said to the older couple. “Let’s get you up out of here next.”\n The woman looked like maybe she wanted to argue, but she didn’t. She nodded and said, “You’re right. We’ll be moving slowest, wherever we go, or however we get there. Come along, dear.”\n Her dear said, “Where are we going?”\n “Out, love.” She looked around. “I can make it up on my own, but he’ll need some assistance. Captain? Or Mr. . . . Mr. First Mate?”\n “Copilot,” he corrected her as he climbed into the cabin. “I’d be happy to help.”\n Together they wrested and wrangled the somewhat reluctant old man and his insistent wife up the concave ladder and out the hatch. Then went the clubfooted student; and then Ernie, with a little help from Robert; and then Mercy, who couldn’t get off the thing fast enough. Finally, the other student and the rest of the crew members extracted themselves, leaving the Zephyr an empty metal balloon lying tipped and steaming on the ground.\n Five\n A message had come and gone to someone, somewhere, and two more gray-uniformed men came running up to the group, leading a pair of stamping, snorting horses and a cart. The man holding the nearest horse’s lead said to the group, “Everyone on board. Line’s shifting. Everybody’s got to go while the going’s good.”\n “Where are we going?” demanded Gordon Rand even as he hastened to follow instructions.\n He was helping the elderly woman up the back gate and into the makeshift carriage when the second newcomer replied. “Fort Chattanooga.”\n “How far away is that?” he inquired further.\n “Better part of thirty miles.”\n Larsen exclaimed, “We’re going to ride thirty miles in that?”\n And the first man answered, “No, you’re going to ride two miles in this, and then the rail will take you the rest of the way.”\n “We’re outside Cleveland? That’s what the captain said,” Mercy said, fishing for confirmation of anything at all.\n “That’s right.” The second Reb had hair so dark, it gleamed blue in the light of the lanterns. He gave her a wink and a nod that were meant to be friendly. “But come on, now. Everybody aboard.”\n The captain lingered by the Zephyr while the elderly couple settled in. The students climbed over the cart’s edge behind them. “I need to reach a telegraph. I’ll have to tell my dispatcher that the ship is down, and give them coordinates to retrieve it,” the captain said plaintively.\n But Mercy saw the artillery flashes and heard the earsplitting pops of gunfire through the trees, and she answered with a guess before anyone else could say it. “There won’t be anything left of her by morning.”\n “One bullet,” Gordon Rand said softly from his spot in the cart. “That’s all it’ll take, on her side, with her tanks exposed like that.”\n “Damn straight,” said the blond who’d first communicated through the windshield. “All the more reason to hit the road, sooner rather than later. We don’t want to be anywhere near her when she goes up in flames. She’ll take a quarter mile of forest and everything in it.”\n Ernie gave a yelp when he was hauled onboard, prompting the dark-haired private—Mercy thought he was a private, anyway—to ask if anyone else was hurt. “Does anyone need any help? Is this everybody?”\n “This is everybody,” the captain confirmed. “We weren’t traveling full. And the line wasn’t supposed to move this far south; they told me at Richmond that it hadn’t come this far,” he complained even as he climbed aboard to join the rest of his passengers and crew.\n The private reached for the reins and held on to them as he climbed up onto the steering seat. His companion leaped up to take a spot beside him, and with a crack of the reins, the cart was turning around to go back the way it had come. The private continued, raising his voice to make himself heard over the background roar of fighting, “We were holding ’em back real good, up until tonight. We’d cut ’em off from their cracker line, and the Chatty trains were keeping us in food and bullets, while they were running low on both.”\n Mercy didn’t see the blond soldier who’d been first on the scene—he had either stayed on the scene or gone in some other direction. The other blond had left the driving to the private, and was scanning the trees with a strange scope layered with special lenses, the nature of which Mercy could only guess.\n The captain asked, “Then what happened, man? What turned the tide so fast that the taps couldn’t catch up?”\n Over his shoulder, the driver said, “They brought in an engine. That thing tore right through our blockades like they were made of pie dough. Killed a score every half a mile. Eventually we just had to let them have it.”\n Mercy said, “An engine? Like a train engine? I don’t understand.”\n The blond lowered his scope and said, “The rail lines around here, they run crisscross, all over each other, every which-a-direction. We commandeered the switches and posted up our lads to keep the Yanks’ cracker line squeezed off shut. But then they brought—”\n The private interrupted him. “The Dreadnought. That’s what they call it.”\n “My CO said he thought the damn thing was back east, over in D.C., watching over the capital after our rally there last month. But no! Those bastards brought that unholy engine all the way out here, and it mowed us right down. They took back their line in under an hour, and now they’re pushing us back. They’re pushing us back good,” he emphasized, and drew the lenses back up to his face. “Veer us left, Mickey,” he said to the driver. “I don’t like the look of the smoke kicking up to the east.”\n “We’re going to run out of road.”\n “Better that than running into artillery, eh?”\n The Zephyr’s copilot was sour looking, squatting next to the captain. He asked, “How do you know it’s artillery? I can’t see a damn thing past the lanterns on the cart.”\n The navigator gave the copilot a look like he must be the stupidest man alive and waggled his scope, with its myriad jingling lenses. “They’re the latest thing. They ain’t perfect, but they do all right.” One more glance through the lenses, and he said, “But we gotta get rid of our lights or they’ll spot us over there. Mickey, the lanterns. Kill ’em. Kill all of ’em.”\n “Clinton, I swear to God—”\n “I’m not asking you a favor, you nitwit, I’m telling you—”\n “I’m working on it!” Mickey cut him off. “Who’s holding the other one?”\n “I am,” the captain said. “And I’m trimming the wick right now.”\n “Not enough,” insisted Clinton. “Turn it off. Damp the whole thing down.”\n Mickey’s lantern had already been snuffed, so when the captain reluctantly killed the light he held, the forest swallowed them whole. The horses slowed without being told, whinnying and neighing their displeasure and their nervousness. Mickey told them, “Hush up, you two.” Then, to the people in the back, he said, “Down, all of you. Get as low as you can go. Cover your heads.”\n The old man, who had been silent against his wife thus far, instead asked, in a voice far too loud for anyone’s comfort, “Why did it get so dark and quiet?”\n Gordon Rand slapped his hand firmly over the old man’s mouth and whispered, “Because none of us want to die. Now contain yourself, sir.”\n The old man did not so much contain himself as begin to giggle, but it was a quiet giggle, and no one chided him for it. All of them crouched down low, hunkering as deeply as possible against the floor of the cart as it rattled, jostled, and bounced them along the nearly invisible road between the trees . . . then off to the left where the road was less distinct, and rougher. It was also harder to bear for the folks whose knees, elbows, and ribs battered against the wood-slat bottom.\n Nearby, a tree exploded, casting splinters as large as arms and legs through the darkness. The old woman muffled her own scream, and everyone else flattened even lower, as if they could meld themselves with the floor of the cart.\n Mickey groaned. When Mercy looked up, she could see something dark and shiny all over his face and side, but he stayed upright and flipped the reins at the horses, yelling “Yah!” \n","sourceLink":"https://allnovel.net/dreadnought-the-clockwork-century-2/page-13.html","bookId":2551,"book":{"id":2551,"title":"Dreadnought (The Clockwork Century #2)","description":"Storyline: \n Dreadnought (The Clockwork Century #2) \n Nurse Mercy Lynch is elbows deep in bloody laundry at a war hospital in Richmond, Virginia, when Clara Barton comes bearing bad news: Mercy’s husband has died in a POW camp. On top of that, a telegram from the west coast declares that her estranged father is gravely injured, and he wishes to see her. Mercy sets out toward the Mississippi River. Once there, she’ll catch a train over the Rockies and—if the telegram can be believed—be greeted in Washington Territory by the sheriff, who will take her to see her father in Seattle. \n Reaching the Mississippi is a harrowing adventure by dirigible and rail through war-torn border states. When Mercy finally arrives in St. Louis, the only Tacoma-bound train is pulled by a terrifying Union-operated steam engine called the Dreadnought. Reluctantly, Mercy buys a ticket and climbs aboard. \n What ought to be a quiet trip turns deadly when the train is beset by bushwhackers, then vigorously attacked by a band of Rebel soldiers. The train is moving away from battle lines into the vast, unincorporated west, so Mercy can’t imagine why they’re so interested. Perhaps the mysterious cargo secreted in the second and last train cars has something to do with it? \n Mercy is just a frustrated nurse who wants to see her father before he dies. But she’ll have to survive both Union intrigue and Confederate opposition if she wants to make it off the Dreadnought alive.\n \n","cover":"https://allnovel.net/images/dreadnought-the-clockwork-century-2.jpg","author":"Cherie Priest","type":"Horror","source":"allnovel","link":"https://allnovel.net/dreadnought-the-clockwork-century-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:25:59 AM"}}
