{"id":111627,"no":40,"title":"Page 40","content":"\n Sunset took forever; with no mountains or hills for it to fall behind, the orb only sank lower and lower in the sky, creeping toward a horizon line that never seemed to come. The warm light belied the chill outside, and the passenger cars were bathed in a rose-colored glow even as the riders rubbed their hands together and breathed into their fingers, or gathered over the steam vents.\n Porters came through on the heels of the sun’s retreating rays, lighting the gas lamps that were placed on either side of each door, protected by reinforced glass so the light wouldn’t blow out with the opening and closing of these same portals. The burning yellow and white lights brightened the seating areas even as the sun outside began to set.\n “Isn’t that something!” Mercy said, leaning her head to see more directly west out the window.\n Rowena asked, “The sunset?”\n “I don’t think I’ve ever seen a prettier one.”\n She kept her stare fixed out the window even as the effects of the evening’s lovely onset waned. She couldn’t quite be certain, but she was almost . . . nearly . . . just about positive she could see something shadowed in black leaping and loping up toward the train.\n Judith followed her gaze and likewise tried to focus on the dark dots of peculiar shape and size, out to the south and incoming—until, yes, they were both convinced of it. And when Rowena added her eyes to the concentrated staring, she, too, wondered if there wasn’t something approaching, and approaching fast.\n “Mercy—” Judith said her name like a question or a prayer. “Mercy, what on earth is that?”\n Mercy demurred, “I couldn’t say. . . .”\n And it didn’t matter what she said, or if she said it. Even from her limited view at the window, she could see four . . . no, five . . . bouncing, rolling things coming across the plains at a pace that confounded the three women.\n Someone in a seat behind them breathed, “Monstrous!”\n Before much else could be added to that assessment, soldiers came running in through the forward door, toward the aft and the next car, shouting, “Everyone stay calm!” at a group of people who were too confused to be very panicked yet. But as order went out, and uniformed men went tearing to and fro in small groups, the passengers experienced earnest concern, followed by excessive fright.\n Judith asked, “What do we do?” and no one seemed to know. She and Rowena both looked at Mercy as if the nurse ought to have some idea. She didn’t, but she’d learned over long shifts at the hospital that if people looked to you for directions, you gave them some directions, even if all you were doing was getting them out of the way.\n Remembering the previous, abortive raid, Mercy pointed up at the luggage bays high overhead, and to the storage blocks to either side of the compartment. “Get all your stuff down,” she said. Barricade yourselves in, and keep your head low.”\n Rowena squeaked, “What about you?”\n “I’m going to head back to my compartment,” she said. “Stay down. When the shooting starts—”\n “When the shooting starts?” Judith asked.\n “That’s right, when it starts. You don’t want to have your pretty face up like a big old target, now do you?” She stood up straight and stared out the window at the machines, which were definitely rolling, driving up over the uneven plains and bouncing as they approached, popping over the prairie dog mounds and jostling airward after clipping small gullies or ravines.\n As the raiders drew closer, Mercy could see that their machines were three-wheeled on triangle-shaped frames, with bodies like beetles and glass windshields that looked as if they might’ve been scavenged from an airship. The windows were thick and cloudy, revealing little of the men inside except for foggy shapes, at least at their present distance.\n She turned away from the window and looked around at the rest of the passengers in the car. “Y’all heard me, too, didn’t you? Get all your things out of the luggage bays and make a fort. Do it! All of you!” she barked when some of the men just stared, or the women were sluggish. “We don’t have but a few minutes before they’re on us!”\n Watching the windows with one eye, she began a sideways run for the aft door; and as she made her first steps, she heard a rushing roar, and felt the train surge forward. Someone had thrown on more coal or squeezed more diesel into the engine, and they were definitely moving at a swifter clip.\n In the next car she found more soldiers, more passengers, and more restless fear. She didn’t see the captain or the Texian or anyone else she might’ve looked for in case of an emergency, but Malverne Purdue was wrestling into a holster and fiddling with guns, as if he had used them before, but not too often or too expertly.\n A little girl in a corner was clinging to the hand of a woman who must be her grandmother, who looked every bit as terrified as the child. The older woman caught Mercy’s eyes and asked, “What’s going on? Dear, what should we do?”\n The soldiers were shouting orders back and forth at one another, or confirming orders, or spreading information up and down the line. Whatever they were doing, they did it loudly, and they did not address the passengers even when directly asked to do so. Mercy understood the necessity, whether she liked it or not, so she reiterated her instructions from the previous car. Then, after a pounding of feet that took most of the soldiers out the forward door, she held up her hands.\n “Folks, we’re going to need to keep the aisles clear, you understand me? Did everyone hear what I told this lady here, and this little girl? About getting down your luggage and ducking down behind it?”\n Murmurs and nods went around, and some of the faster listeners began opening bays and storage panels; hauling out suitcases, satchels, boxes, bags, and anything else large enough to cover any part of any body; and throwing them into the compartments.\n “Everyone, now, you understand? Stay out of the aisles, and don’t do any peeking out the windows.”\n Malverne Purdue, who was now fighting with the buckle of a gunbelt, raised his voice and said, “I want everyone to listen to this lady. She’s giving you good advice.” Once the belt was secured, and he was wearing no fewer than four guns up front, and one tucked into the back of his pants like a pirate, he said to Mercy, “I know I’m not an officer and it’s not your job to obey me, so don’t remind me, but: take what you’re saying from car to car. Keep these people out of the path; there’s going to be plenty of coming and going.”\n She nodded and they headed off in opposite directions—him to the front, after his fellows, and she to the rear, toward her own compartment.\n The wind between the cars was ice on her ears and in her lungs as she breathed one shocked chestful of air that made her eyes water. The train was moving so fast that the tracks underneath the couplers poured past as smoothly as a ribbon of water. If Mercy looked at it for more than a fraction of a second, it made her dizzy.\n She gripped the rails and stepped onto the next small platform, then yanked the door open.\n By the time she was back in her own car, she was breathless, disheveled, and half frozen. She said, “Excuse me,” and pushed past Mrs. Butterfield, who was perched on the edge of her compartment seat and demanding of Miss Clay, “What do you see? What are they doing?”\n Theodora Clay had her hands and face pressed against the window, her breath fogging the pane and the tip of her nose going red with the cold. She said, “I see five of those bizarre contraptions. They’re gaining ground, but not very quickly.”\n “How many men, do you think?” asked her aunt.\n Mercy knelt down on her seat beside Miss Clay so she could see. Though the question had not been directed at her, she answered. “I can’t imagine those things hold more than three at a time.”\n To which Miss Clay said, “I suspect you’re right. Those . . . those . . . carts, or mechanized wagons, or whatever they are . . . they look like they’re made for speed, not for military transport.”\n The nurse added, “And they’re made for assault. Look at their guns.” She pointed, jamming her knuckle against the breath-slick glass.\n Theodora Clay tried to follow the indication and agreed. “Yes, I see two Gatling-form spritzers mounted above each front axle, and small-caliber repeating cannon on the rear axle.”\n Mercy looked at her with a puzzled frown. “You know something about artillery, do you?”\n She said, “A bit,” which was such a useless contribution to the conversation that it may as well not have been offered at all.\n “All right. Do you think we’re in range?”\n “Depends on what you mean by that. They could likely hit the side of a barn at this distance, but they couldn’t hit it twice in a row, not at the speeds they’re coming.” Miss Clay looked back down at her aunt and said, “But we should do what Mercy’s been telling everyone. Get your luggage, Aunt Norene.”\n “I’ll do no such thing!”\n Miss Clay gave the old woman a scowl. She said, in a level, angry voice, “Then go help other people get their luggage out and sorted, if you’re too much a soldier to cover your own hide.”\n Mrs. Butterfield sniffed disdainfully and flounced out of her compartment into the aisle. Once there, she immediately spotted the widower trying to wrangle his two boys, and set to assisting him.\n Miss Clay returned her attention to the window and said, almost to herself, “They’re gaining. Not by much, but they’re gaining.”\n Mercy was still looking after Mrs. Butterfield and could therefore see out the other side of the train. She said, “And they’ve got friends, coming at us from the north.”\n “Goddammit,” said Miss Clay. Mercy wasn’t sure why the blasphemy surprised her. “How many do you think that makes?”\n “I haven’t the foggiest. I can’t see very far the other way,” she said, though she dashed across the aisle and leaned her face against the window. There, she could spot at least three, and a dust trail that might indicate a fourth somewhere just beyond her range of vision. “Maybe the same number?” \n","sourceLink":"https://allnovel.net/dreadnought-the-clockwork-century-2/page-40.html","bookId":2551,"book":{"id":2551,"title":"Dreadnought (The Clockwork Century #2)","description":"Storyline: \n Dreadnought (The Clockwork Century #2) \n Nurse Mercy Lynch is elbows deep in bloody laundry at a war hospital in Richmond, Virginia, when Clara Barton comes bearing bad news: Mercy’s husband has died in a POW camp. On top of that, a telegram from the west coast declares that her estranged father is gravely injured, and he wishes to see her. Mercy sets out toward the Mississippi River. Once there, she’ll catch a train over the Rockies and—if the telegram can be believed—be greeted in Washington Territory by the sheriff, who will take her to see her father in Seattle. \n Reaching the Mississippi is a harrowing adventure by dirigible and rail through war-torn border states. When Mercy finally arrives in St. Louis, the only Tacoma-bound train is pulled by a terrifying Union-operated steam engine called the Dreadnought. Reluctantly, Mercy buys a ticket and climbs aboard. \n What ought to be a quiet trip turns deadly when the train is beset by bushwhackers, then vigorously attacked by a band of Rebel soldiers. The train is moving away from battle lines into the vast, unincorporated west, so Mercy can’t imagine why they’re so interested. Perhaps the mysterious cargo secreted in the second and last train cars has something to do with it? \n Mercy is just a frustrated nurse who wants to see her father before he dies. But she’ll have to survive both Union intrigue and Confederate opposition if she wants to make it off the Dreadnought alive.\n \n","cover":"https://allnovel.net/images/dreadnought-the-clockwork-century-2.jpg","author":"Cherie Priest","type":"Horror","source":"allnovel","link":"https://allnovel.net/dreadnought-the-clockwork-century-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:25:59 AM"}}
