{"id":92977,"no":18,"title":"Page 18","content":"“What?” I ask, scared he might eat it himself. “We don’t have enough food to last, after all?” “No. These.” He scowls at the disk. “They’re for Fecs. And beasts. It is a flavored calorie tablet with an appetite suppressant, emotion inhibitor, and tranquilizer. And they’re mildly addictive.” I stare at the disk, thinking of the pleasant, heavy exhaustion that filled me each time I ate one and made life seem more bearable. I should be angry, furious, that he was drugging me. Instead, I want to snatch up the disk and eat it before he has a chance to feel guilty for feeding them to me. Bowen’s fingers curl around it, and I reach my hand out with a small whimper. He looks at me and puts it back in the backpack. “Wait here.” He crosses the empty floor and disappears behind the stairs. I sit on the ground and stare at the backpack, tempted to find the wafer. I’m so hungry. Peering toward the stairs, I place my hand on the pack’s zipper. “Don’t eat it,” Bowen calls. I jump and pull my hand away. Taking a resigned breath, I turn away from the backpack and, in the dim light, pull the medical tape from my hand and study my scabbed-over palm. Only, the scab isn’t red. It’s chalky white. After a minute Bowen returns with a can in each hand. He holds them out for me to see, and I forget about the disk and my palm. “Spam and peaches in light syrup. Worth almost as much as honey,” he says, sitting on the ground beside me. He pops open the lids on the cans, and my mouth fills with saliva. I swallow and take a deep breath, and smell the memory of flowers and breakfast and juice. He takes a knife from his pocket and slices a gelatinous chunk of pink Spam from the can and hands it to me. I put the meat into my mouth and am transported to a world long gone. Tears of yearning for the past sting my eyes, so I close them and chew. My stomach heaves and jumps, trying to get the meat into it as quickly as possible. I can almost hear the clatter of silverware on plates, hear the quiet sound of classical music in the background, see my family gathered around the dining room table, sunlight streaming through the windows. When I open my eyes, Bowen is staring at me, a ghost of a smile on his mouth. “Good?” he asks. “So good,” I say, wiping the tears from my lashes. He hands me the other can without a word. I take a sip of the syrup and slurp a slice of peach into my mouth. I want to melt into the floor. “Heaven,” I say. “Where did you find them?” “I’ve been storing food here for a while. Just in case …” He trails off. “What?” He shrugs and slices off another piece of Spam. “In case I ever decide to go rogue. Permanently. Colorado isn’t the only state out there that cut itself off from the rest of the country and made its own government in an effort to survive. The rumor is, there’s a place—a settlement—in Wyoming, where anyone’s welcome. I figure one day I might want to see if the rumors are true. I don’t have anyone holding me here—you know?” He puts the meat into his mouth and sighs. I pass him the peaches and take the knife from his hand, slicing more cold Spam. “What happened to your mom?” I pop the meat into my mouth and force myself to chew when my stomach begs me to swallow it whole. “She died. So I joined the militia,” he says. The muscles in his jaw pulse, and he won’t look at me. “How did she die?” I ask, Spam momentarily forgotten. His gaze doesn’t leave the can of peaches in his hand. Juice sloshes out of the can, and he gently sets it down. His hand trembles, and he tucks it into his lap. “What about your dad?” I ask, trying to change the subject. I hardly ever saw his dad. He drove a semi and was gone for months at a time. “My dad’s not worth talking about. He abandoned us,” Bowen snaps. “Where’s your brother?” Bowen’s shoulders relax a bit. “He’s inside the wall, making babies with a sweet sixteen-year-old wife.” “Sixteen?” I squeak. Bowen laughs. “Yeah, sixteen. He loved her enough to wait a whole year for her. Fifteen is the new legal age. When you turn fifteen, you join the militia if you’re a boy, and get married if you’re a girl. The number-one priority right now is repopulation. Number two is to protect those repopulating the world, from the rest of the world.” I study his face—his green eyes, angled cheekbones, and soft mouth—and my skin suddenly feels too warm as my blood heats beneath the surface. “Why aren’t you married, then?” I ask, finding an imaginary spot on the floor to scratch. “And making babies?” He exhales, and I feel the air stir against my burning skin, feel his body shift in the space next to mine. “It feels wrong, looking at twelve-, thirteen-, and fourteen-year-olds as possible wives—not that I get to look, since they’re all inside the wall and I’m stuck out here.” Bowen picks up the can of peaches and hands it to me. When I take it, our fingertips touch and mine explode with fire. Bowen doesn’t let go of the can. His eyes meet mine, and the factory air seems unbearably hot, too hot to breathe. After a heartbeat, he releases the can and turns away from me. I peer into the can of peaches, wondering if the heat of my hand will make the sticky-sweet syrup boil. “I need to get some sleep,” Bowen says, his voice rough. I set the peaches down and study his silhouette, bracing myself for the zing of my ankle cuffs. But the zing doesn’t come. “You forgot my cuffs,” I say. My sweaty skin itches beneath the metal. Bowen bites his bottom lip and stares at the cuffs for a minute. He lifts the remote and points it at my legs. I clench my teeth, waiting for the magnetic pull and discomfort of immobility. The remote clicks, metal clangs, and cool air swirls around my damp calves. I look at the cuffs, sitting useless on the cement floor beside me. I look at Bowen. He shrugs and lies on the cool cement ground, wadding the sleeping bag up for a pillow. “You’re not restraining me?” I whisper, afraid if I say it too loud, he’ll remember I’m a Ten. His eyes flicker to mine. “Do you feel like you’re about to turn?” I mentally tune in to every single part of my body. “No.” “I trust you, Fo,” he says. He puts his gun over his chest and cuddles it, then shuts his eyes. The air temperature seems to drop ten degrees, going from unbearably hot to just uncomfortably warm, and I can breathe again. Bowen has a talent for falling asleep the minute his eyes close. His face goes soft, his lips part, and quiet snores fill the warehouse. I sit cross-legged in front of him and stare at his sleeping face while I eat the rest of the food, remembering how he looked when he was a kid. He always seemed two weeks overdue for a haircut, with scraggly bangs forever in his eyes. And his cheeks were rounder, though typically pale. As a kid he seemed thin to the point of malnourished, with knobby knees and gangly arms. Whenever my mom baked, if she saw him outside riding his bike, she’d call him over and give him a plate of warm cookies or a slice of pie. Now he’s filled out, grown into his body, the perfect image of golden-tan health and strength. He stirs and shuts his mouth, as if he can sense my eyes on him. Were I brave, I would reach out and touch him, brush his bangs away from his sweaty forehead or trace the line of his jaw. But the thought steals my breath, so I lean my back against the wall and spread my fingers, plucking a tune out of the air, hearing notes in my head. My fingers remember exactly where to touch, as if I’d played the tune yesterday. Chopin’s Nocturne no. 2 replaces thoughts of Bowen. Chapter 19 By late afternoon, the air is so heavy that if I cry, I’m certain my tears will hang suspended before my face. I wipe the back of my hand over my forehead, pushing my bangs from my sweaty skin, and try to hold back the tears. Bowen murmurs, thrashing about in his sleep. This has been going on for hours, since shortly after he fell asleep. And when his nightmares peak, he mumbles my name—Fiona, not Fo—and clutches the gun tighter to his chest, or spreads his palm over his chest, right above his heart. I can imagine his dreams—my claws in his skin, my teeth gnawing his shoulder, gnawing his chest to get to his heart. I am the source of his nightmares. He gasps my name and whimpers. This time I can’t stop them. Tears fill my eyes and my heart constricts. I rest my forehead on my knees, listening to the agonizing sound of my name on his restless lips. Lips I have been studying for hours. Something thumps. I jump, my heart jumps, my stomach jumps, and I look at Bowen. Something thumps again on the other side of the factory. A soft fist on the metal door? I stand and tiptoe to the door, pressing my ear against the sun-heated steel. Deep voices, barely more than whispers, carry through to my ear. And scratching, the sound of a match against stone. I sprint to Bowen and touch his shoulder. His entire body lurches as if electricity has tensed every muscle in one swift jolt. Eyes wide, teeth bared, he digs the end of his gun into my chest right above my stuttering heart. I flinch and get ready to die. Recognition softens his wild eyes, and the gun falls to his side. “What’s wrong?” he whispers. “The door. Someone’s here,” I answer, pressing a hand over my ballistic heart. Bowen jumps to his feet and crams all our belongings into our backpacks—the empty cuffs, the sleeping bag, even the empty peach and Spam cans. He takes my hand in his, and we run to the stairs, but instead of going up, we go behind them. The wall below the stairs swings open, revealing a secret room. Bowen throws the packs inside, then grabs my shoulder and turns me to face him, pushing me into the room until my back presses against something hard and uneven. He presses the length of his body against mine, his feet snug in between my feet, and pulls the secret door shut behind us. “Sorry about the tight fit,” he whispers, his mouth against my temple. “I never thought I’d be stuck in here with another person.” Bowen shifts, his body moving against mine, and something clunks. “Ow!” he whispers.","sourceLink":"https://allnovel.net/stung-stung-1/page-18.html","bookId":1608,"book":{"id":1608,"title":"Stung (Stung #1)","description":"Storyline: Stung (Stung #1) Fiona doesn’t remember going to sleep. But when she opens her eyes, she discovers her entire world has been altered—her house is abandoned and broken, and the entire neighborhood is barren and dead. Even stranger is the tattoo on her right hand—a black oval with five marks on either side—that she doesn’t remember getting but somehow knows she must cover at any cost. She’s right. Those bearing the tattoo have turned into mindless, violent beasts that roam the streets and sewers, preying upon the unbranded while a select few live protected inside a fortress-like wall, their lives devoted to rebuilding society and killing all who bear the mark. Now Fiona has awakened branded, alone—and on the wrong side of the wall.","cover":"https://allnovel.net/images/stung-stung-1.jpg","author":"Bethany Wiggins","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/stung-stung-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:58:53 PM"}}
