{"id":92993,"no":34,"title":"Page 34","content":"I shudder and move away from the door, swallowing down bile as I try to forget what I just saw. Yet, even over the thunderous cheering, sounds of the fight reach my ears—wet, smacking sounds and grunting. I press my hands against my ears and hum Beethoven’s Fifth as loud as I can. And all I can think is, Bowen, come and get me! After I’ve hummed the entire song, the deep buzz of the voice echoes into my room. I cautiously take my damp hands from my ears, braced for the disturbing sounds of fighting. “… in your seats! I know how eager you all are, but you need to wait to collect your winnings until after the second fight. Now, if you voted Beast One in this round, you … lose, lose, LOSE!” he yells. The crowd groans. “And now, we’ll take a quick moment to clean up the pit before we get on to what you really came here for. So, use the bathroom, place more bets, or just hunker down in your seats and give us a moment to prepare the pit.” I mentally brace myself for something horrible and peer through the crack in the door again. Both beasts are in the bright room, one lying motionless on the floor, the other hunched over it and panting. Both are covered with streaks of blood. My cuffs zing with a surge of electricity, and the sitting beast’s arm and ankle cuffs snap together. He snarls and writhes, tipping over onto the floor. Two men come into view and approach the beast with their hands up, palms forward. The beast lunges to his feet, and I gag. His face is nothing but scratches with eyes peering out. My cuffs fill with electricity again, and the beast topples to the floor, his body convulsing, his stringy hair standing straight up with electricity. When the electricity stops, his eyes are shut and he doesn’t move. His unconscious body is lifted from the floor, placed into a wheelchair, and locked into place with metal bars identical to those that were on my wheelchair. His head lolls to the side as they push the chair out of the room. The other beast, the one lying on the floor, is zipped into a black bag. I have seen enough. Too much. So I lean against the wall and close my eyes. I have just witnessed my first pit fight. And now I understand. Unless Bowen shows up with his promised rescue, I am going to fight next. And I am going to die. The door with the light seeping through—my door—swings open. I flinch and cover my eyes. The door behind me, the door I came in through, moves toward me. It presses against my back and I dig my shoes into the ground. I do not want to go into the pit! But it sweeps me, forces me out of my tiny room and into blinding light. I fall to my knees and stare at the floor—pale-blue cement smeared with streaks of brick red and brown. The air explodes with cheering, and the commentator’s booming voice echoes over the sound. “Isn’t she a doozy? Our first Level Ten of the day! Of the year! Our first Level Ten … ever!” The crowd goes wild. “Don’t be fooled by her submissive appearance, folks. She might be on her knees right now, but it is all an act. She’s been living outside the wall. She’s tough. She’s a survivor. And she’s a Ten. She’s got the mark on her hand to prove it!” I glance at my hand, at the oval with ten legs, and shudder. The cheering grows louder and I look up. I am in the bottom of the indoor swimming pool—the deep end where the diving boards and platforms used to be. Above me is a thick sheet of Plexiglas, a seal locking me in. Around the glass seal are stadium seats crammed with people—sitting in laps, spilling over the edges, lining the walkways. And they are all staring at me and cheering. In the front row sits a man dressed in a suit and tie, with a white-collared shirt. He is flanked on both sides by four short-haired men in black uniforms, with automatic weapons in their hands. I have seen this guarded man before. In a fire lit alley. The man who told the raiders to catch me and keep me, and kill me. His eyes are locked on mine. I stare into his narrowed eyes and slowly climb to my feet. He is the governor. “Now that you’ve clapped eyes on this beastly sweetie, you might want to change your bets. Or increase them,” the commentator says, the timbre of his voice niggling at my memory. I break eye contact with the governor and look around but can’t see the commentator. The noise dies down as people scramble to give slips of paper to several men dressed in black, wearing black caps. “And now. Brace yourselves! Men, cover your wives’ eyes! The moment you’ve all been waiting for is here.” Everyone leans forward in their seats. “It is time,” the commentator continues in a quiet voice, “to introduce the other three before we open their doors. Door number one holds a Level Three male. Don’t let his small size fool you, my friends. We’ve been trying to catch this wily Fec for years. He’s the craftiest, fastest thing on two legs that has ever come from the tunnels. In fact, get this. He’s the Fec that usually sells the other Fecs to the pits! What a cruel turn of fate for him.” The commentator chuckles, and I recognize his voice. He is the man from the tunnels who always hid in the shadows. Shadow Man. “Door number three,” the commentator continues, “holds our second female. She’s only a Five, but you know how female beasts are—they kill all other females so they can be queen bee. She’s clawing at the door to get to our Ten as I speak! “And from door number four, you’ll see our second Ten. He’s …” The crowd shrieks so loudly, the commentator’s voice is completely swallowed. Even the black-dressed guards in the front row lean forward to peer down into the pool. Only the governor seems unaffected. When the frenzy dies down, the commentator continues, “This Ten is a male with a broken ankle and some superficial skin wounds. But don’t let that stop you from betting on him. He’s the strongest beast we have ever seen. He bent the bars of his cage trying to get at our little Level Ten female down there. Steel bars, mind you! No beast has ever done that.” I grit my teeth and force my legs not to buckle. Why does it have to be him in here with me? What kind of sick and twisted reality have I been thrown into? I wonder. And where are you, Bowen? The ground beneath my feet rumbles as the crowd stomps their feet on the bleachers in unison. Stomp, stomp, stomp. Just like at a high school basketball game. “And now. Silence, please. We will open the other three doors,” the commentator says, his voice reverent. The noise disappears, as if it has been clapped beneath a hand. My ears ring with its aftermath. Slowly, one of three doors built into the side of the pool slides open. A person is shoved into the light. It’s Arrin, cuffed hands shading her face. She uncovers her eyes and squints. Her face has been scrubbed clean, her hair isn’t in her face, and her clothes are dripping. With her face clean, and her—my—clothes plastered to her body, she looks … male—square shoulders, hairy legs, and a beaky nose too big for her face. I can see it, now, what Bowen has said all along. I am looking at Arris—not Arrin. She is male. He grins at me and I shiver. Arris’s eyes flicker away from mine, up to the bleachers above, and lock onto the governor’s face. He mouths the words, Kill her and I’ll get you out. Arris nods and grins. The other two doors open, and two freshly scrubbed beasts, wearing scraps of damp clothing and bound by ankle and wrist cuffs, are pushed out into the pool. One is the female beast that had been kept in the cage beside mine. I press my back to the wall and pray she doesn’t see me. Or smell me. Or whatever they do. When I look at the other beast, I can’t breathe, wonder again what kind of sick and twisted reality I exist in, that I am facing my own twin brother in a death match. Jonah. He hovers on one foot, the other hanging at an odd angle just above the ground, his ankle swollen and purple beneath the cuff. His skin is slashed and scabbed over, and around his neck, ankles, and wrists are chafed bruises from the restraints that have been holding him. He glances at me—a flash of dark irises—so quickly I wonder if I’ve imagined it, and then his full attention is on the female beast. So is mine. She hisses. At me. And fights against the cuffs on her legs. She lunges for me and falls onto the pale-blue, bloodstained cement. Like a worm, she begins inching her way in my direction. I press my back harder against the wall. Movement catches my eye, something bright, and I look away from the beast, squinting. Arris holds a knife in his clean hand, wiggling it so the bright new blade catches the light and reflects it into my eyes. He grins a brown-toothed grin and slashes at the air. Memories flash in my head—my father, forever stuck in his wheelchair, teaching me how to defend myself. Never get in a knife fight. You’ll get cut. Like that’s going to help me now. If your attacker grips your arm, twist toward his thumb. Don’t punch—grab the soft flesh of the inner arm or thigh with your nails. Bite. Stomp on the instep or kick the Achilles tendon. Go for the eyes. Use your elbows in place of punching. His voice floods my brain, an onslaught of information in the blink of an eye that makes my heart ache for his presence. His protection. Gathering up all the bravery I possess, I take a step away from the wall, balance on the balls of my feet, and wait. The crowd applauds my bravery. I will not die without fighting for a life I am not yet done living. Chapter 34 The commentator’s voice rumbles, but I don’t take my eyes from the others in the arena. “At a down-count of ten, we will release the cuffs and the fight will begin!” he roars. The air trembles with an explosion of noise, and the count starts, shouted by the spectators as well as the commentator. “Ten! Nine …” The numbers pulse against me, hammer my eardrums, and then fade to gibberish in my ringing ears. Until they get to … “ONE!” And then the arena explodes with action. Cuffs release. Everyone leaps but me. Before I can move, before I can put my hands up to protect my face, I am buried beneath three bodies. My head smacks the pool floor, though I don’t feel it, only hear the crunch of skull on cement, see stars in front of my open eyes. I cannot move. Jonah throws Arris aside and then rips the female from me, rolling with her into the center of the pool, a thrashing ball of limbs and skin.","sourceLink":"https://allnovel.net/stung-stung-1/page-34.html","bookId":1608,"book":{"id":1608,"title":"Stung (Stung #1)","description":"Storyline: Stung (Stung #1) Fiona doesn’t remember going to sleep. But when she opens her eyes, she discovers her entire world has been altered—her house is abandoned and broken, and the entire neighborhood is barren and dead. Even stranger is the tattoo on her right hand—a black oval with five marks on either side—that she doesn’t remember getting but somehow knows she must cover at any cost. She’s right. Those bearing the tattoo have turned into mindless, violent beasts that roam the streets and sewers, preying upon the unbranded while a select few live protected inside a fortress-like wall, their lives devoted to rebuilding society and killing all who bear the mark. Now Fiona has awakened branded, alone—and on the wrong side of the wall.","cover":"https://allnovel.net/images/stung-stung-1.jpg","author":"Bethany Wiggins","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/stung-stung-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:58:53 PM"}}
