{"id":92966,"no":7,"title":"Page 7","content":"\n “No. No mark. He’s clean, sir.”\n I peer at Gray Hair through my thick bangs. He studies me with eyes as mistrusting as Arrin’s, and his lips grow thin. “Bring him to central. I’m going to do a scan.”\n A militia man escorts me through a throng of men with wary eyes, to the center of their camp and into a spacious wooden structure—a log cabin—with a row of empty tables and a paper-strewn desk. Overhead, lights hum and buzz. Electrical lights.\n “Uncuff him, Rory, so I can get a pure read,” Gray Hair says. There are lines shaved into his hair above his left ear. Six of them. He has a star on his brown coat. Embroidered above the star is the name Micklemoore.\n “Yes, sir.” My hands are lifted, along with my cuffs, and then the cuffs snap free of my arms. I let my hands hang casually at my sides and try to appear like I am not searching for an escape. The other man, Rory, steps in front of me and aims a Taser at my chest. There are only three lines shaved into his blond hair.\n Micklemoore walks to the desk and opens a drawer, removing a metal box the size of my palm. Rory turns from me, hand out held for the metal box. And I run.\n Micklemoore yells. Rory turns and clutches my shirt, but I tear away from him. The outside darkness fills the log cabin’s door, and I know it’s my only hope.\n I pass from light into dark and slam into something hard and warm. We topple to the ground, and the unpleasant smell of digesting garlic and onions tickles my nose. Rough hands grapple against my body and latch onto my hips, flinging me aside. The icy barrel of a gun finds my temple, and I squeeze my eyes shut. Instead of feeling my head explode, I hear a low, humorless chuckle.\n “Len, you always seem to be in the right place at the right time,” Micklemoore says, still chuckling. He crouches beside me, lifts my right hand, and holds out the metal box. The box lights up, a cool, soothing blue that makes my skin crawl. And when the light touches my hand, my tattoo shines through the layers of dirt and blood and makeup like a bike reflector. The box wails a warning siren.\n Micklemoore drops the box and lurches away from me faster than anyone with gray hair should be able to move. And then I can’t see anyone, because a hundred automatic weapons are pointed at every inch of my body, blocking my view.\n Like Arrin’s brother, I wait to explode.\n Chapter 8\n “Bowen!” The name echoes and I flinch, expecting gunfire. “Electromagnetic wrist cuffs and ankle cuffs! Now! We got us a Ten!” Micklemoore barks.\n A moment later, a small section of guns part and a square-shouldered man fills the space. Darkness hides the features of his face, but his voice resonates deep and soft and soothing, just a tremor above a whisper. “I won’t hurt you if you hold still,” he says, kneeling beside me.\n What he doesn’t know is that I couldn’t move even if I wanted to. My whole body has turned numb with fright, right down to my lips. He leans over me and an image of a high-mountain lake settles behind my eyes. Or, more accurately, the giant pine trees that encircle the lake and sway in the wind and smell … just like this man. I stare at him and breathe, and a temporary calm settles over me.\n “That’s it, kid. You got a name?” He lifts one of my arms and clamps something onto it, something that stretches from my wrist to just below my elbow and is cool against my skin. “I’m Bowen.” He takes my other wrist and clamps the same thing onto my forearm. I open my eyes and lift my head to look at my arms. Bowen leaps away from me, points something in my direction, and the devices on my arms hum to life and of their own will meet, like two magnets attracting each other. I try to pull my arms apart but can’t.\n Bowen kneels beside me once more and lets out a deep breath of air. “Don’t. Move.” His voice has turned hard and cold. “I will kill you if you do.” With damp, unsteady hands, he lifts my ankle and pushes the pants up around my knee, then attaches a cool metal casing around my calf and shin. He puts one on the other leg, and when it clamps into place, he scrambles away from me like I’m liable to explode at any moment. From a few feet away, he points something at me again. My legs slide together and fuse into one.\n The crowd sighs and gasps, and then some men start laughing, like they just witnessed a lion tamer caging his fiercest beast.\n “That was awesome, man,” someone says, patting Bowen on the back. “First Ten we’ve ever caught! Must be beginner’s luck.” The hundred guns disappear, replaced by the starry sky, as men move away. But not Bowen.\n “Kid, if you move I’ll release a current of electricity through you that’ll stop your heart before it can finish a beat. Got it?” he warns.\n I don’t dare answer. Don’t dare to move my jaw—just shift my eyes to stare at Bowen’s silhouette.\n “Unless you need to talk. Or grunt, or whatever a Ten does,” Bowen says, like he can read my mind. He leans a little closer to me, body still tense. “Can. You. Understand. What. I’m. Saying?” He overenunciates each word.\n My stomach growls. “I’m hungry,” I whisper.\n Bowen jumps at the sound of my voice, and his pale eyes catch moonlight. “Whoa. You can talk?” He looks from side to side, then reaches into his pants pocket. “You bite me, I shock the crap out of you,” he says. “Open your mouth.”\n I obey. Bowen places a large round disk on my tongue. It dissolves into foam, and I taste pork chops and gravy and green beans. I sigh and close my eyes, and the world wavers beneath me and disappears.\n Voices tug at my sleep, whispers dancing with my hazy dreams.\n “Come on, man. I’ll keep him until Sunday and then take him to the lab. You can have the pay,” someone says, his voice hushed.\n “Why?” another voice asks.\n “I don’t know. ’Cause you’re new at this job? And I don’t want to see someone as young and healthy as you dead. How ’bout I give you eight ounces?”\n “For a Fec? You want to buy him from me?” the other man answers, his voice deep and distinct. I know this voice—Bowen. I try to open my eyes, but my body is as unresponsive as stone.\n “Sure,” the first voice says.\n “Why?”\n My dreams overpower the voices, dreams of a world lush with budding plants and birdsong, as if the dead summer has turned to spring.\n Chapter 9\n A smell wafts at me, burning my sinuses and making me gag—a smell like rotting meat, morning breath, and dog crap—pulling me out of a deep, troubled sleep. I turn my head to the side and gasp for fresh air.\n I am lying on my back, on something hard, and my muscles feel as if I haven’t moved them in a year. I try to stretch, but my forearms are stuck together, from my elbows to my wrists. My legs, too.\n A breeze stirs the air, and the rancid smell surrounds me again. I gag and open my heavy eyes. A low army-green canvas roof stretches overhead, bright with sunlight. A threadbare sleeping bag is zipped around me, pulled snug at my neck. I try to move again, and when the sleeping bag shifts, a gust of air escapes it. My eyes water and I gag again, my hollow stomach clenching. The nasty smell that pulled me from sleep? It’s me. My smell.\n I cough and wheeze, stretching my head as far to the side as it will go. Someone throws the tent flap open, and a black man whose shoulders fill the entire tent opening sticks his head inside. Covering his mouth and nose with his hand, he glowers down at me.\n “Tell Bowen it’s awake,” the man says, his voice muffled beneath his hand. “And it needs a hose down.” He drops the tent flap back into place.\n I clench my stomach muscles and do a shaky sit-up, and the sleeping bag falls around my waist. The tent flap opens again. I try to twist around and see who is there but can’t.\n Someone gasps. “Don’t move a muscle, kid.”\n I recognize this smooth, deep voice—Bowen—and do what he says, turning my aching body to virtual stone. He coughs and then squats beside me, unzipping the sleeping bag. He hooks his hands under my armpits and drags me into sunlight. Four armed guards move from the four corners of my tent and point their guns at me.\n “If I release your legs, you must not attack,” Bowen says from behind me, emphasizing each word like I’m dense. “Nod once if you understand the meaning of my words.” I nod once and Bowen sighs. “Shoot him if he does anything, boys.”\n Without warning, my ankle cuffs separate from each other. I twist my ankles and point my toes. Hands are in my armpits again, lifting. Someone groans behind me. “Better burn his sleeping bag, guys. I don’t think anything will remove the smell,” Bowen says. He coughs and gags. “Walk,” he commands, shoving me forward. On legs stiff and awkward, I put one foot in front of the other. Bowen walks behind me, his voice directing me through the camp with the command “left” or “right.”\n The entire camp stares as I wind past tents and burning fires. Words follow me. Security hazard. Level Ten. Mark of the beast. 8 ounces. Black market. Fight. Honey. The pits.\n “Stop,” Bowen orders. I am at the log cabin from the night before. I freeze, my back to the camp, and stare at a knot in one of the round logs that make the cabin’s walls. Out of the corner of my eye I see a garden hose being pulled from a hook on the cabin.\n Water hits me from behind, and I gasp as a shiver makes its way from my scalp to my feet. I guess I’m taking a shower. In frigid water that sprays so hard against my shoulders I almost fall forward. But I can feel the layers of grit and sewage and blood and Arrin dripping off my skin and clothing, and welcome the cold water. A puddle forms beneath my feet—hazy gray swirled with deep brown.\n Squinting, I slowly turn into the spray, ducking my head into it, letting it drench my thick bangs and squirt them out of my face. Next, I bring my shackled forearms to my face and, coughing and spluttering, scrub my skin.\n By the time the water stops, my entire body is trembling with cold and covered with goose bumps, my clothes are soaked, and the tattoo on my hand is a dark, visible warning. I shake my head from side to side, flinging drops of water from my hair. \n","sourceLink":"https://allnovel.net/stung-stung-1/page-7.html","bookId":1608,"book":{"id":1608,"title":"Stung (Stung #1)","description":"Storyline: \n Stung (Stung #1) \n Fiona doesn’t remember going to sleep. But when she opens her eyes, she discovers her entire world has been altered—her house is abandoned and broken, and the entire neighborhood is barren and dead. Even stranger is the tattoo on her right hand—a black oval with five marks on either side—that she doesn’t remember getting but somehow knows she must cover at any cost. She’s right. \n Those bearing the tattoo have turned into mindless, violent beasts that roam the streets and sewers, preying upon the unbranded while a select few live protected inside a fortress-like wall, their lives devoted to rebuilding society and killing all who bear the mark. \n Now Fiona has awakened branded, alone—and on the wrong side of the wall.\n \n","cover":"https://allnovel.net/images/stung-stung-1.jpg","author":"Bethany Wiggins","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/stung-stung-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:58:53 PM"}}
