{"id":93149,"no":24,"title":"Page 24","content":"CADAVERI ECCELLENTI\\n\\n Her holding cell was underground, like Dracula\u0027s tomb. Kate supposed Silvestri intended she be reminded of the bloody pit. The strategy didn\u0027t work. She remembered the little devil girl\u0027s terrifying smile and being hauled out of a pool of blood by Genevieve, but everything between was a red mist. She tried and tried, but a murderous hangover blotted out her mind. If it hurt this much, she didn\u0027t want to remember.\\n\\n She had been questioned several times. Someone was supposed to be getting in touch with the Irish Embassy. Mostly, she was left alone, with orders to think hard.\\n\\n For the moment, she was a witness. Not a suspect.\\n\\n When they had told her Dracula was dead, she\u0027d let out an instinctive hallelujah of unlovely gloating. That hadn\u0027t made a good impression, especially since she was still plastered with the deceased\u0027s congealing blood. Even now, the last rinds clung stubbornly to her hair and under her nails.\\n\\n She didn\u0027t even know whether she was guilty or not.\\n\\n Objectively, she was the assassin type: idealistic, obsessive, frustrated, prone to fits of emotion, equipped for violence. On the night of the murder, hundreds of witnesses saw her pick a drunken fight with the dead man\u0027s fiancee. She had a long history of enmity with the House of Dracula. As a reporter, she\u0027d have picked herself as the likely killer.\\n\\n But surely she would remember?\\n\\n No news was allowed through to her, but she could imagine how the world was reacting. Those who thought her guilty would be sharply divided: Dracula\u0027s supporters calling for her public impalement on television, his enemies hailing her as a heroine and a saint. It should have been Genevieve. She was better fit to handle all this.\\n\\n What stopped Silvestri charging her? The pounding in her head didn\u0027t entirely blank her intuition. The Inspector didn\u0027t think she\u0027d done it. Marcello had told her the policeman specialised in those very Italian murder cases where nothing was ever what it seemed and weird combinations of suspects with twisted motivations perpetrated unwieldy, unlikely and baffling atrocities. His usual quarry were black-gloved, hooded fiends who took straight razors or strangling cords to fashion models or nightclub hostesses to pose as sex killers but actually sought contested inheritances, double indemnity insurance claims or to preserve the reputations of even more unpleasant relatives. To Silvestri, the victim\u0027s worst enemy found at the scene of the crime covered with his blood and with the deceased\u0027s wallet in his back pocket was obviously an innocent red herring.\\n\\n She tried to think back.\\n\\n Dracula\u0027s tomb was elusive, but more and more she found herself going over the past. It was all there somewhere.\\n\\n In 1943, she had walked across most of Sicily in the wake of General Patton\u0027s armoured forces. \u0027Operation Husky\u0027 met little resistance from Italian troops on the island - King Victor Emmanuel had just dismissed Mussolini, and Pietro Badoglio was negotiating Italy\u0027s change of sides - but 40,000 German soldiers put up a desperate fight.\\n\\n The press tagged along with the second or third wave of liberators. Chain of command wouldn\u0027t let Kate up front in the fighting like Ernie Pyle. By the time she got anywhere, it was supposed to be pacified, suitable for writing-up as a morale-boosting victory. She was encouraged to file stories about Sicilian-American GIs visiting relatives in the old country, being welcomed as saviours with picturesque peasant feasts.\\n\\n Actually, she saw the bureaucratic mess of a changeover from failing fascist authorities to a provisional Allied military government and then to whoever could best exploit the situation. Most of the partisans who assisted the Allies turned out to be mafia soldati, clawing back territories Il Duce had wrested from them. In order to make the campaign swift and successful, the Allies were prepared to make use of the likes of the bandit Salvatore Giuliano and the gangster Charles \u0027Lucky\u0027 Luciano. She saw unsmiling Sicilian villagers waving flags at gunpoint to give a welcome to \u0027exile son\u0027 Luciano, and wept to see not liberation but an exchange of oppressors.\\n\\n \u0027You brought them back,\u0027 spat an old woman.\\n\\n Kate always remembered that peasant, face worn, back bent, sons and grandsons dead on all sides. To her, the Germans (only recently hostile) were alien beings, unpredictable and implacable as the weather. The mafia, whom she was now expected to welcome, had been around all her life. They were people she could hate, arrogant and quixotic, suddenly violent, always demanding more tribute.\\n\\n An American officer confided in Kate that he couldn\u0027t understand these people. \u0027They\u0027re free. What more do they want, blood?\u0027 Then he realised what he had said and tried to apologise. Two nights later, she bled him anyway, though she never slept with him.\\n\\n The disbelief and disgust of the old woman stayed with her.\\n\\n In the Balkans, it must have been worse. There, the Allies installed not mafia capi but elder vampires, grave-mould scum out to reclaim their castles and feed off the grandchildren of the villagers they\u0027d slaughtered in years gone by.\\n\\n \u0027You brought them back.\u0027\\n\\n She still shuddered at that.\\n\\n \u0027Have you found the little girl?\u0027\\n\\n Inspector Silvestri had heard that before.\\n\\n \u0027It was the girl from Piazza di Trevi. She must be a part of this. I think she\u0027s mixed up with the Crimson Executioner.\u0027\\n\\n The policeman sighed.\\n\\n \u0027Il principe Dracula was not killed by il Boia Scarlatto.\u0027\\n\\n He stated it as a matter of fact. Kate was surprised.\\n\\n \u0027On the night of the party, the night Dracula died, il Boia Scarlatto was seen more than a dozen times in Rome. He was in a frenzy. Seven elder vampiri, all on their way to or just returned from Fregene, are dead by his hand. He has grown bold. Most were killed in public. The assassin and an elder named Anton Voytek fought like wrestlers in Piazza dei Qinquecento, outside the railway station, causing much damage. Voytek\u0027s heart was torn out and tossed to the dogs. The other dead are il conte Mitterhouse, Webb Fallon, Richmond Reed, il conte Oblensky, Lady Luna Mora, and a Madame Cassandra. There may be more. It\u0027s difficult to identify heaps of ashes. The thing is that all these died in Rome, not the Palazzo Otranto.\u0027\\n\\n \u0027How convenient.\u0027\\n\\n \u0027Indeed. It has occurred to us that there might be an army of identical assassins. In that case, who is their generale? This lost child of yours?\u0027\\n\\n \u0027She wasn\u0027t a vampire.\u0027\\n\\n And yet, she wasn\u0027t warm either, not in the sense Kate understood.\\n\\n \u0027Sometimes the Devil looks like a little girl,\u0027 she said.\\n\\n Silvestri threw up his hands. \u0027You can\u0027t expect me to arrest il diavolo. Besides, he was put on trial once before and sentenced. The American law of Double Jeopardy must apply.\u0027\\n\\n \u0027Very well, I confess. I am the mastermind. I decreed the deaths of all elders in Rome. I personally destroyed the King Vampire. Now I am Queen of the Cats and shall reign throughout the eternal night.\u0027\\n\\n Silvestri chuckled.\\n\\n \u0027But you are innocent, Signorina Reed.\u0027\\n\\n \u0027Prove it.\u0027\\n\\n \u0027Show me your hands.\u0027\\n\\n Surprised, Kate laid her hands on the desk between them. The Inspector took her hands and turned them palm up.\\n\\n \u0027A silver scalpel was stuck into Dracula\u0027s heart. Argento. That killed him. The decapitation was only a flourish. He was killed by another vampiro - which also rules out il Boia Scarlatto - and your hands aren\u0027t scarred. Silver is like hot iron to the undead.\u0027\\n\\n \u0027I could have worn gloves.\u0027\\n\\n \u0027And still got your hands bloody? So bloody that you would have red stuff under your nails?\u0027\\n\\n Kate was self-conscious and made fists, trapping Silvestri\u0027s thumbs. She could have ripped them off if she\u0027d been so inclined. She let him go.\\n\\n \u0027There was also skin on the scalpel. A residue.\u0027\\n\\n \u0027I heal fast. Even after silver.\u0027\\n\\n \u0027You didn\u0027t have any weal on your palm when we found you that night. I observe too.\u0027\\n\\n \u0027I take it you\u0027ve asked for a show of hands?\u0027\\n\\n \u0027Many vampiri were at the engagement ball. Few have chosen to remain in Italy for the funeral. And who can blame them? Il Boia Scarlatto is the Grim Reaper with a silver scythe. Incidentally, are you an elder?\u0027\\n\\n \u0027I should think not. I\u0027m not even a hundred.\u0027\\n\\n \u0027A thousand pardons, Signorina. But the question had to be asked. I should not care to release you into peril.\u0027\\n\\n \u0027You\u0027re releasing me?\u0027\\n\\n \u0027Discreetly. Your name has not been made public.\u0027\\n\\n Kate was grateful for that. She knew the pandemonium her life would become if her part in this were generally known. Her colleagues of the Fourth Estate would scent blood in the water and descend on her in a feeding frenzy of pestering questions.\\n\\n \u0027Thank you, Inspector. You are a wise and a good man.\u0027\\n\\n \u0027Perhaps. I am also, unless these murders are cleared up, soon to be a traffic policeman on the island of Lampedusa.\u0027\\n\\n He shrugged, and let her out of the interview room.\\n\\n Someone - Marcello? Genevieve? Genevieve - had retrieved some clothes from the pensione and sent them to the police station on Piazza Venezia, so she did not have to change into the remains of her party dress to be let out.\\n\\n It was early evening, the sky purple. On the steps of the police station, she drew breath. She had looked forward to something other than the stale air of the cell.\\n\\n A cry went up from across the piazza. A horde of pressmen, who had been lounging by the Victor Emmanuel Monument, rushed up at her, hastily grabbing cameras, microphones, and notebooks. Flashbulbs exploded, questions were gabbled in many languages. Light and noise assaulted her.\\n\\n She covered her eyes. \\n\\n","sourceLink":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3/page-24.html","bookId":2295,"book":{"id":2295,"title":"Dracula Cha Cha Cha (Anno Dracula #3)","description":"Storyline: Anno Dracula: Dracula Cha Cha Cha (Anno Dracula #3) \\n Rome. 1959. Count Dracula is about to marry the Moldavian Princess Asa Vajda - his sixth wife. Journalist Kate Reed flies into the city to visit the ailing Charles Beauregard and his vampire companion Geneviève. Finding herself caught up in the mystery of the Crimson Executioner who is bloodily dispatching vampire elders in the city, Kate discovers that she is not the only one on his trail...\\n","cover":"https://allnovel.net/images/dracula-cha-cha-cha-anno-dracula-3.jpg","author":"Kim Newman","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:59:00 PM"}}
