{"id":93168,"no":43,"title":"Page 43","content":"Arc-lights rigged inside the police perimeter made the building site seem like a film location. The harsh, fizzing glare hurt less than the sun. At midnight, Kate felt sharper, less muddy-headed than at dawn.\\n\\n Griffin lifted the smeared polythene as if it were a see-through shroud. Laura Jane Bellows was folded up inside a wheelbarrow. She had long dark hair and white, white skin.\\n\\n \u0027Gawd,\u0027 said Bellaver.\\n\\n Rogers looked critically, as if judging the murderer\u0027s aesthetic sense in posing the corpse. Dried blood was smeared around the girl\u0027s throat. Whoever had bitten her made a mess of it. On her last night out, Laura had worn a black bikini, black thigh-boots and a black crochet poncho. Witnesses would remember the outfit.\\n\\n The dead girl had been identified quickly. Her dabs were on file from a pot bust. She hadn\u0027t paid her fine. So far as anyone could tell from a quick ring-round, Laura was an ordinary flower child. From Hatfield, originally - where was that? - she\u0027d shared a flat off the King\u0027s Road with two other girls. After dropping out of college, she\u0027d worked in a coffee bar and a travel agents but hadn\u0027t stuck to either long. She\u0027d been scrounging rent money from her parents and going to parties she wasn\u0027t really invited to. Kate recognised her as one of the incidental pretty faces in Nolan\u0027s photos of the Fevre Dream bacchanal. Girls like Laura Bellows were welcome anywhere. Heavies who might resolutely guard a door against speccy reporters would step aside at the flash of a smile and the twirl of a poncho-fringe. There was a downside. Girls like Laura Bellows and Carol Thatcher weren\u0027t in short supply. Their murderer wasn\u0027t alone in seeing them as disposable, to be used once or twice and thrown away.\\n\\n Laura\u0027s friends admitted she\u0027d been knocking about with Clive Landseer, who\u0027d soon be quizzed about his unfortunate habit of knowing murder victims. As a paid-off parasite, Landseer\u0027s duties included trawling for biddable popsies to dress any social occasion. On Saturday, he\u0027d roped Laura in to decorate Syrie Van Epp\u0027s boat bash. She told her sceptical flatmates she was only expected to dance on the Fevre Dream. Kate knew how the game worked. Have a drink, have a pill, have some more, they\u0027re just like Smarties... This is an MP, be nice to him, chicken... yes, he likes you, who wouldn\u0027t?... Go into a cabin and have some fun... you\u0027ve seen him in the papers and on the telly, and he likes you loads... We\u0027re all fancy-free, chicken... have another drink, another pill... three\u0027s not a crowd, you know, it\u0027s an experience... Try this, it\u0027s called a purple passion... you\u0027ve no hang-ups, love, you\u0027re not square, you\u0027re an angel, a princess... nothing you don\u0027t want to do, and I\u0027ll make it up to you, but I\u0027d appreciate it... another drink, another pill, another man... hang loose, babe.\\n\\n Some time last night, Laura Bellows had been bitten and bled out. Some time today, she had been dumped in a wheelbarrow.\\n\\n \u0027We were supposed to find her tomorrow morning when work started,\u0027 said Bellaver. \u0027But kids \"playing\" turned her up. Probably on the scrounge for stuff to nick, bless \u0027em.\u0027\\n\\n They were in Deptford, not far from Maryon Park.\\n\\n Five streets of back-to-back houses had been flattened, wrecking balls from Langly Construction accomplishing what the Luftwaffe couldn\u0027t. Three tower blocks were due up here. Currently, it was a ghost community: the shells of homes, a bulldozered playground, street-signs thrown in a pile, rubble and rubbish. She\u0027d been at the press launch where Sir Billy Langly proudly showed off the plans for his high-rises. Critics likened them to vertical rabbit hutches or battery farms in the sky. To Kate, they looked like coffins. She\u0027d spent decades trying to stay out of coffins.\\n\\n The dead girl had been left in place until B Division took a gander at her in situ. The discovery of a body on the site wouldn\u0027t hold up work. The police - and Laura - should be gone before the builders brewed up their first Monday morning round of tea.\\n\\n The body was supposed to be found. Whoever the killer was, he didn\u0027t care about secrecy. He might want a high profile. These maniacs were often frustrated showmen. He\u0027d copyright a \u0027trade-name\u0027 next, like Jack the Ripper or the Steel Claw or the Peeping Tom.\\n\\n The Super told Griffin to take away the polythene.\\n\\n A St Bartolph\u0027s scarf was knotted round Laura Bellows\u0027 white arm.\\n\\n \u0027There it is, Katie,\u0027 Bellaver said. \u0027You were asking.\u0027\\n\\n \u0027Funny place to wear a scarf, Super,\u0027 said Griffin.\\n\\n \u0027The murderer must have tied it there,\u0027 said Rogers.\\n\\n \u0027I hate the ones who play parlour games,\u0027 said Bellaver. \u0027The silly buggers imagine they\u0027re matching wits with you, sending their darling little messages, planting clues all over the place. It means they think you can\u0027t touch them.\u0027\\n\\n \u0027Sometimes they\u0027re right,\u0027 said Rogers.\\n\\n Bellaver shook his head. \u0027Anybody can be nicked. Maybe not for what they\u0027ve done, but for something.\u0027\\n\\n That chilled rather than cheered Kate. She remembered other policemen with that attitude.\\n\\n \u0027Caleb Croft teaches at St Bartolph\u0027s,\u0027 she said, neutrally. \u0027That\u0027s a St Bartolph\u0027s scarf.\u0027\\n\\n \u0027You think Croftie\u0027s a drinka pinta nighta man?\u0027 asked Bellaver. \u0027Two pintas, one nighta?\u0027\\n\\n \u0027He\u0027d drain London dry if he could get away with it.\u0027\\n\\n \u0027Leaving the empties tied up with a bow?\u0027\\n\\n She shrugged. That didn\u0027t seem like the grey eminence she knew. But the scarf meant something.\\n\\n Was she acting like a Black and Tan? Trying to fit up someone she didn\u0027t like even if it meant the real culprit went free? She worried about such niceties. That told her she was still herself, still Katie Reed. She wasn\u0027t (yet?) only the Vampire Katharine. She held herself to a higher standard than she expected of the monsters. Which didn\u0027t mean Croft wasn\u0027t guilty, just that a case against him had to be based on more than prejudice. She wouldn\u0027t frame him, even if he was the worst vampire unimpaled in Britain.\\n\\n Laura Bellows might have been killed before Carol Thatcher. The girls had certainly been exsanguinated within an hour of each other. Kate\u0027s first thought was feeding frenzy. A pack of leeches, battening on the victims. Your basic blood orgy. The Living Dead, the vampire bike club, supposedly enjoyed regular Gang Fangs, to initiate new members or get rid of wasted groupies. In that scenario, the girls would have suffered multiple bites. Carol and Laura had only the classic neck punctures. Autopsies would have to confirm it, but that suggested a single biter. So: one killer, wolfing two victims at a time. That indicated an overpowering red thirst. Nolan\u0027s photos suggested Carol died where she was found. Laura was killed somewhere other than the building site where she was dumped. Maryon Park? Leaving the bodies in different places didn\u0027t fit the profile of a vamp gone blood simple. Spree-killers weren\u0027t hard to catch: they kept tearing into people until they were brought down with silver or the stake. This monster wasn\u0027t going to make it easy. They were dealing with a cunning, ruthless, experienced murderer. Bellaver was right: that scarf was a message... an invitation.\\n\\n In the daytime, St Bartolph\u0027s College was within sight of this place.\\n\\n The Super chewed the trailing ends of his moustache, thinking it over.\\n\\n \u0027Tell you what, Katie - you go, with the blessings of B Division, and beard the beast in his den. If you can make a case against Croftie, bully for you.\u0027\\n\\n \u0027If not, you haven\u0027t pissed off a member of the Establishment for no good reason? It\u0027ll have been radical muckraker Katie Reed barking up the wrong tree?\u0027\\n\\n Bellaver gave a \u0027take it or leave it\u0027 shrug.\\n\\n \u0027I daresay the Diogenes Club could shoulder some of the blame,\u0027 he said.\\n\\n \u0027While I go back to school, where will enquiries take you?\u0027\\n\\n \u0027Chummy Clive Landseer is an obvious first port of call. He smells like as right a tree to bark up as any. Fact: he knew both women. Fact: he\u0027s a new-born vampire. Fact: he\u0027s an excessive little shit.\u0027\\n\\n Kate couldn\u0027t disagree. Past the dome of artificial light, she saw the silhouette of a spire. St Bartolph\u0027s chapel. She was being reeled in. It was as if that scarf were knotted around her neck. \\n\\n","sourceLink":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3/page-43.html","bookId":2295,"book":{"id":2295,"title":"Dracula Cha Cha Cha (Anno Dracula #3)","description":"Storyline: Anno Dracula: Dracula Cha Cha Cha (Anno Dracula #3) \\n Rome. 1959. Count Dracula is about to marry the Moldavian Princess Asa Vajda - his sixth wife. Journalist Kate Reed flies into the city to visit the ailing Charles Beauregard and his vampire companion Geneviève. Finding herself caught up in the mystery of the Crimson Executioner who is bloodily dispatching vampire elders in the city, Kate discovers that she is not the only one on his trail...\\n","cover":"https://allnovel.net/images/dracula-cha-cha-cha-anno-dracula-3.jpg","author":"Kim Newman","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:59:00 PM"}}
