{"id":93174,"no":49,"title":"Page 49","content":"Word got out to the press. Mrs Craven\u0027s story was worth more now her precious boy was not just a vampire slayer but a vampire victim. Fullalove had a note smuggled into the station, offering Kate a column in the Gazette if she\u0027d write up the killing. If she took him up on it, she\u0027d never get access to B Division again. However, judging from Bellaver\u0027s face after a phone call from the Home Secretary, there might not be a B Division after this hash. The story had changed and not in any useful way. Vampires were monsters. Julian Griffin\u0027s death wouldn\u0027t get an inch under the racing results. Donna Rogers and Peter Craven would be on the front page for weeks. \u0027Bellaver,\u0027 Kate called, getting his attention, \u0027give Craven\u0027s mug shot to the papers.\u0027 \u0027Why on Earth should we do that?\u0027 he asked. \u0027The only other photos of him will come from his mum. He\u0027ll be in school uniform. He\u0027ll be the naughty, cheeky lad who sits at the back of the class. At least the picture you took last night makes him look like a murdering thug.\u0027 \u0027If our press officers thought like you, they\u0027d run the Yard.\u0027 \u0027It\u0027ll come,\u0027 she said. The Super took her advice. He also ordered Dixon to find \u0027couply\u0027 snaps of Donna Rogers and Julian Griffin from before they turned to release to the press. Though policy was to discourage relationships between officers serving in the same unit and he wasn\u0027t supposed to know they were going out. Things were escalating. Griffin for Laura and Carol. Craven for Griffin. Someone had to put Rogers under arrest, for form\u0027s sake. During the hub-bub, Sergeant Lynch clocked off and Kate\u0027s old playmate Tom Choley showed up bright and early. He couldn\u0027t stop smiling as he went through the formalities of booking Rogers. The WPC hadn\u0027t wiped her face. She looked like an Apache squaw after scalping the Cavalry troop who massacred her village. Handcuffs hung loose on her thin wrists. Jasper Lakin gave her his card. Choley had scared up a Shooter\u0027s Hill plod to escort Rogers down to the holding cells. Kate caught the ice glint in her eye. \u0027Unless the bars are silver, you\u0027re putting her within reach of the rest of Van Helsing\u0027s mob,\u0027 she warned Bellaver. \u0027She\u0027ll be out of her cell and in theirs in seconds.\u0027 The Super thumped his forehead. \u0027Damn, Katie... are you the only one here thinking?\u0027 Bellaver had Dixon take Rogers away from the local woodentops. \u0027Give her a wash and haul her back to Holborn.\u0027 Dixon fetched a wet towel and dabbed the blood off Rogers\u0027 face like a Bank Holiday mum cleaning a mucky lad with the spit-wet corner of a hankie. She didn\u0027t resist. \u0027Neither of you are to talk to the reptiles outside,\u0027 said Bellaver. \u0027Rogers, you are ordered not to say you\u0027ve been arrested. You\u0027re just another plonk, savvy?\u0027 Plonk. Person of limited or no knowledge. Prejudiced male officers called policewomen plonks. She\u0027d never heard Bellaver use the word before. Rogers nodded. She felt no guilt over murder, but her Super\u0027s disapproval stung. Bellaver had hopes for Donna Rogers. Had had hopes. Dixon took out the key to take her cuffs off. She broke them before he could get to the lock and gave him the pieces. \u0027Enjoying yourself?\u0027 Bellaver asked, incensed. Rogers was sobered. It was all crashing in on the woman now. She hadn\u0027t thought past the killing. Which made her just like Peter Craven. Dixon and Rogers left through the front doors, despite Choley\u0027s protests about Rogers being a Shooter\u0027s Hill catch not B Division\u0027s. With the sun up, Rogers had to roll down her veil. Kate looked through the open doors as Dixon and Rogers went into the harsh light. The reporters were baying. On the steps, Rogers\u0027 sleeve was tugged by Mrs Craven. \u0027When can I see my lad, miss?\u0027 Rogers laughed in Mrs Craven\u0027s face. Mrs Craven screamed and tore away the veil. Rogers\u0027 red eyes shrank in the dazzle of sunlight and her face steamed. A monster being dragged to the stake. Cameras went off. Rogers had better pray she didn\u0027t show up in photographs. She was not displaying the ideal front page face. The police station was in chaos. The shift change made things worse. Everyone had heard different versions of the night\u0027s events. Choley was putting in multiple complaints about the vampire invasion. After this shambles, he\u0027d be listened to. Breach of the peace, grievous bodily harm and accessory to murder charges still had to be laid against Van Helsing\u0027s Circle of Light. Now that booking Craven for the murder of a police officer would be problematic, his mates\u0027 crimes risked being viewed as high-spirited misdemeanours. As Bellaver said, \u0027Who doesn\u0027t want to set fire to a long-haired guitar player?\u0027 Then, Norman Pilcher of the Drug Squad arrived, with his best hippie-kicking size elevens on, fired up to raid St Bartolph\u0027s. When told circumstances had intervened and that little adventure would have to be postponed, he was gutted. He threatened to make complaints. Bellaver laughed and told him to queue up behind Sergeant Choley and every other bugger in London. \u0027You can\u0027t let these addicts win,\u0027 said Pilcher. \u0027Or society falls, mark my words. Look at her...\u0027 Pilcher meant Kate. His nostrils twitched, like a bloodhound\u0027s. \u0027This is a police station and she\u0027s \"on\" something. Out with it, \"flower-child\"? What\u0027s your \"bag\"?\u0027 \u0027Sunshine, man,\u0027 she said, flashing the peace sign. \u0027Sunshine.\u0027","sourceLink":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3/page-49.html","bookId":2295,"book":{"id":2295,"title":"Dracula Cha Cha Cha (Anno Dracula #3)","description":"Storyline: Anno Dracula: Dracula Cha Cha Cha (Anno Dracula #3) Rome. 1959. Count Dracula is about to marry the Moldavian Princess Asa Vajda - his sixth wife. Journalist Kate Reed flies into the city to visit the ailing Charles Beauregard and his vampire companion Geneviève. Finding herself caught up in the mystery of the Crimson Executioner who is bloodily dispatching vampire elders in the city, Kate discovers that she is not the only one on his trail...","cover":"https://allnovel.net/images/dracula-cha-cha-cha-anno-dracula-3.jpg","author":"Kim Newman","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:59:00 PM"}}
