{"id":93134,"no":9,"title":"Page 9","content":"LIVE AND LET DIE\\n\\n He knew he was being followed. Three of them, two large, one small. Bond, on foot today, took the opportunity to dawdle in the Parco di Traiano, to smoke them out.\\n\\n Strewn about were all manner of ancient things worth a touristy look-see. Whenever he peered at a plaque, or pondered a chunk of broken statue, he enjoyed the thought of his tails getting uncomfortable under their collars. Each stop made them more conspicuous. Actually, they were about as unobtrusive as a Korean wrestler at an English golf clubhouse. He wondered why they\u0027d got into this business in the first place. The point, as he\u0027d been told many times, was to blend in, not stand out. Then again, Bond liked a dash of the ostentatious. It wasn\u0027t exactly easy to overlook an Aston Martin, for instance. And his other car was a Bentley.\\n\\n He guessed they were from the Other Side, the people Anibas had thrown in with. They wouldn\u0027t be happy to lose a valuable vixen like her, and might even be inclined - somewhat unfairly, but what could you expect from that shower? - to blame him for their loss. Another possibility was that the larger of the two large fellows was this Crimson Executioner, to whom he owed his life but whom he wouldn\u0027t be especially keen on tangling with again. After all, the vampire killer might not always confine his garrotting activities to elders. The situation in Rome was complicated, as Winthrop had warned him. He needed to consult the old man again.\\n\\n From the park, he could see Beauregard in his bath chair on his balcony, nodding perhaps in sleep, sometimes looking out at the view. In the Diogenes Club, the old man was a legend. Youngsters who\u0027d come up in the war tended to get a touch fed up when fossils of Edwin Winthrop\u0027s generation harped on about the daring exploits of Charles Beauregard, the man who faced Dracula in his lair and lived to tell of it. Having met the fellow, Bond began to understand what all the fuss was about.\\n\\n He stopped dead and lit a cigarette, fixing his tails\u0027 positions in his mind.\\n\\n The larger of the two large ones was very tall, well over seven feet, anchored by clumping asphalt-spreader\u0027s boots. His complexion was a greenish-grey, not very healthy. The oversize bowler perched on his flattish head, shaded heavily lidded, watery eyes. His teeth, glimpsed when thin black lips stretched in an approximate smile, flashed steel. The collar of his black duffel coat bunched up around his neck, covering protuberances. He moved slowly, lumbering, and his long, scarred hands seemed spindly. But there was great strength there. He would not be easy to kill.\\n\\n The other large one - Bond assumed it was human - was broader, bundled up in a clay-stained overcoat, legs like stiff tree trunks, doughy face the brown of freshly scooped mud. On a head the shape of a plum pudding was a strange wig-hat, somewhere between a page-boy bob and an upturned flowerpot. A Star of David hung around its throat, perhaps to ward off vampires.\\n\\n These were not undead in any sense he understood, but he was convinced they weren\u0027t exactly alive either.\\n\\n At least, they clod-hopped enough to be obvious. They\u0027d picked him up a few streets away from the Inghilterra and trudged purposefully after him all afternoon and into the evening, making a bad job of loitering aimlessly whenever he slowed down.\\n\\n The third was the most interesting, a long-necked ballerina with a doll-like white face and porcelain arms. She drifted along on her points like a stray from a commedia dell\u0027arte troupe, skirts slightly bedraggled. He hadn\u0027t been sure of her at first, but she definitely triangulated with the others.\\n\\n A team of three meant something serious. If he was only to be tailed, less noticeable agents would have been deployed. And if he were to be assassinated, a sniper with a silver bullet could handle the job. Considering how often the Other Side had decreed he should be truly dead, it was a surprise they hadn\u0027t yet called in an East German Ladies\u0027 Rifle Champion to get him cleanly out of the way. It was always nonsense with venomous spiders under the eiderdown or bizarre strong-arm characters. Like these.\\n\\n He left the park and looked up at Beauregard\u0027s balcony. The old man saw him at once and dropped something over the parapet. Bond\u0027s hand snaked out instinctively. He snatched the keys from the air. He was being invited up.\\n\\n He assumed Beauregard\u0027s vampire companion wasn\u0027t at home. That might be a good thing. The Dieudonne woman didn\u0027t care for him much. Which was a shame, since she was interesting, with arresting eyes and an electric grace. A fiery spirit burned inside her supple body. It would be an interesting challenge to bend spirit and body both to his will, to unleash centuried passions and join them to his own relentless hunger.\\n\\n On the stoop of the apartment building, he paused and looked around. His three tails converged, striding or tripping through the low mist of the park.\\n\\n The weight of his Walther was comforting under his armpit. Whatever these characters were, a silver bullet or two in the head or heart ought to see them off. He hoped it wouldn\u0027t come to that. Having a licence to kill was all well and good, but he had to fill in forms in triplicate whenever it was exercised. And even friendly foreign governments, like whoever was running Italy this week, whinged when British Intelligence killed folk on their patches.\\n\\n He yawned with calculation, exposing fangs to the night air, tasting the breeze. He was still quickened by Anibas\u0027s potent blood. Sometimes, he felt an enemy\u0027s fear on the tip of his tongue, could suck out of evaporated sweat an idea of purpose. Now, there was a riot of Roman senses, but nothing from the three comrades.\\n\\n Nothing at all.\\n\\n Not vampire, not warm.\\n\\n He let himself in to the large, dark lobby and took the cage lift up to Beauregard\u0027s landing. It rose with a satisfying clunking and rattling of chains.\\n\\n He unlocked the door of Beauregard\u0027s flat and stepped inside. The old man called to him to come through to the study. Bond found Beauregard wheeling in from the balcony, exerting himself a little.\\n\\n \u0027You must excuse me, Commander Bond. Gene is not at home. She\u0027s out picking a dress for a special occasion.\u0027\\n\\n \u0027A wedding?\u0027 he ventured.\\n\\n \u0027Yes, but it\u0027ll have to do for a funeral too. So our Crimson Executioner has destroyed the Lady Anibas?\u0027\\n\\n He wasn\u0027t surprised Beauregard should know. The man still had his sources of information.\\n\\n \u0027You were in Rome to see her, I presume? To turn her, as it were. One of Edwin\u0027s little operations. As might be predicted, she wasn\u0027t quite prepared to sign up. What happened? Did the Russians get to her with a better offer?\u0027\\n\\n He only had to confirm Beauregard\u0027s suppositions.\\n\\n The old man shook his head knowingly. Still obviously frail, he was a little flushed too. He might be a warm man, but he\u0027d picked up - from his vampire mistress? - the trick of sapping energy from associates.\\n\\n \u0027Their section chief in Rome is very able,\u0027 said Beauregard. \u0027You\u0027ve been briefed on him.\u0027\\n\\n \u0027Gregor Brastov.\u0027\\n\\n \u0027Count Gregor Brastov, he was once. A proper Carpathian. Not many of the breed in Smert Spionem. Over centuries, he\u0027s developed the skills one needs to survive successive purges. They call him the Cat Man. Always lands on his paws.\u0027\\n\\n Smert Spionem - Death to Spies! - was Lavrenti Beria\u0027s Soviet Intelligence department. The Other Side\u0027s equivalent of the Diogenes Club. Bond had tangled with their long-range employees before, and was fascinated by the colourless Beria\u0027s love of eccentric and flamboyant lieutenants.\\n\\n \u0027Winthrop says Brastov is one of the most dangerous creatures in Europe.\u0027\\n\\n \u0027Typically acute,\u0027 concurred Beauregard. \u0027Brastov is more isolated in Rome than he might be. Mario Balato, a local Communist Party bigwig, is a vampire-hater of the first water. He is forever citing passages in Marx to justify the prejudice. Aristocrats draining the lifeblood of the noble peasantry, dead labour leeching off the living. Our American cousins think, in their slightly simple-minded manner, that Moscow runs all foreign Communist Parties with an iron hand. Certainly, Khrushchev wishes that were true, as much as Stalin did. But the Italian reds are too bolshy, as it were, to go along with Comintern more than half the time. Brastov imports his own people, and there\u0027s been friction with Balato\u0027s crowd - factional killings, safe houses blown up, that sort of thing. One theory has the Crimson Executioner as literally a Red Vampire Killer, acting on Balato\u0027s orders.\u0027\\n\\n \u0027Liquidating Anibas was as much an attack on Brastov as on the House of Vajda, then. She was a prize. Three unique individuals have stumped around after me all afternoon, which suggests Smert Spionem are rather upset.\u0027\\n\\n The old man\u0027s thin hands darted like birds, waving away the theory\\n\\n \u0027The Executioner\u0027s too theatrical to be one of Balato\u0027s knifemen. To be honest, his activities strike me as being more in our line.\u0027\\n\\n It had occurred to him, of course. The Crimson Executioner had saved his life, eliminating someone who was on the point of killing him. Winthrop could be running another agent in Rome without letting Bond in on it. That sort of \u0027need to know\u0027 trickery wouldn\u0027t be surprising from Diogenes.\\n\\n Beauregard wheeled backwards, heels trailing on the carpet. He rolled over to a low table and offered brandy from a decanter.\\n\\n Bond accepted.\\n\\n \u0027I have to watch my measures,\u0027 Beauregard admitted, \u0027but I can derive vicarious pleasure from your enjoyment.\u0027\\n\\n It was a good, not quite excellent, Courvoisier. He let it sing on his tongue for a moment. Since turning, his palate had become extraordinarily sensitive. He feared he was spoiled for anything less than truly first rate.\\n\\n Beauregard took a Havana cigar from a box and accepted a light. He puffed, and looked a little sad.\\n\\n \u0027I\u0027ve lost surprisingly little in extreme old age,\u0027 he said, with quiet pride. \u0027But taste is going.\u0027\\n\\n Bond knew he was unlikely to last, even as a vampire, to the age Charles Beauregard had attained. He was not the type to rise, as Winthrop had done and Beauregard before him, to the Ruling Cabal. Few field agents went on much beyond forty. It was a question of nerve, not willingness. As a vampire, he might have four or five more decades in the game than a warm man, though he risked, in the picturesque phrase of a colleague from the CIA, \u0027going blood simple\u0027. One of the less comfortable factors of turning was that it was never certain what exactly one would turn into.\\n\\n \u0027Did you see the Crimson Executioner?\u0027 Beauregard asked.\\n\\n \u0027Just his hands. They were red.\u0027\\n\\n \u0027Bloody?\u0027\\n\\n \u0027No. Well, yes. There was blood. He had a silver wire, thick with the stuff. But his hands were red. Dye, or some sort of stain.\u0027\\n\\n \u0027Witnesses describe a red face. Not just a mask, though he wears a domino and a cowl. That used to be a fashion among the more unusual criminals of Paris - Fant?mas, Irma Vep, Flambeau. Now, it\u0027s a European tendency - Kriminal, Diabolik, Satanik, Killing. Absurd names, leotards, masks. A little like us, I suppose. These fellows never grew out of dressing up and playing pirates.\u0027\\n\\n \u0027He wasn\u0027t playing. He was being.\u0027\\n\\n \u0027Yes, yes. Quite, quite. This one is of a different order. He\u0027s not a thief. He takes no souvenirs. I don\u0027t think he\u0027s working through a private pattern, like most mad murderers. I believe him to be an assassin. He is the catspaw of a faction or individual. He kills because he is told to, and he spares some - like you or my old friend Kate Reed - because their deaths have not been included in a well worked-out plan.\u0027\\n\\n \u0027Who do you think is behind him?\u0027\\n\\n Beauregard smiled. \u0027Now that\u0027s the question, Commander Bond. If it\u0027s not Smert Spionem and it\u0027s not us, who does that leave? It\u0027s a dreadful temptation to rope in Dracula, isn\u0027t it?\u0027\\n\\n \u0027The victims are his friends.\u0027\\n\\n \u0027Friends? I doubt if he can have friends. But that\u0027s a question for another night. Certainly, the dead elders are his contemporaries, even his supporters, connections, retainers. Il principe is capricious. He spread vampirism throughout the world, made it safe for the undead to live openly. Perhaps he has changed his mind and wishes to drive the undead back into the shadows.\u0027\\n\\n \u0027Anibas would have betrayed him.\u0027\\n\\n \u0027So would any of the dead elders. As a breed, they aren\u0027t long on loyalty. Dracula has always commanded through fear, not love. He expects treachery at every turn, even feels there\u0027s something wrong if it isn\u0027t constantly lurking. Elders have strength of will, not personality.\u0027\\n\\n \u0027What about...?\u0027\\n\\n \u0027Genevieve? She\u0027s unique. Haven\u0027t you noticed?\u0027\\n\\n He had.\\n\\n \u0027There are other players,\u0027 Beauregard continued, \u0027waiting in the wings, shuffling in the dark. Literally dozens of domestic political or religious factions. Leagues of Vampire Killers, underground or semi-public. Churches and banks and faiths and fancies. The Pope of Rome and the Mother of Tears. The victims are all elders. There are other ancients in the world, institutions which prize their histories. Perhaps some are jealous and wish to be unrivalled in their longevity. Now, there are only a handful of elders. Soon, there will be a great many more, as the new-borns of the \u002780s and \u002790s settle into permanence. Vampire elders will then be a very significant force. They might even be the ones to decide the shape of human history in the next millennium. We have always feared the rule of the dead.\u0027\\n\\n He swallowed brandy, and pondered.\\n\\n There was a crash outside, in the hallway. The front door burst in.\\n\\n The Walther PPK was out of its holster and in his hand. He crouched cat-like, alert. Beauregard rolled backwards, into shadow. Bond would have to look out for the old man. They might use him as a hostage.\\n\\n Someone heavy lumbered down the corridor and stood at the door to the study. Clayface entirely filled the door-frame. It had no weapons but its own huge, thick-fingered hands. They were probably deadly enough. Bond fired twice into the fudgy mass of its head. Silver bullets hit with a sound like pebbles thrown into mud, and had about as much effect. The holes closed over. He tried firing at the heart area. No result, either.\\n\\n \u0027The Star of David,\u0027 shouted Beauregard.\\n\\n He took aim on the amulet but something fast slammed his arm, bowling him over. His hand was stamped on and he lost the gun. A sharp toe-point jammed into the side of his head.\\n\\n The ballerina had come over the balcony.\\n\\n She kicked him, many times. It was a strange dance, frenzied but poised. He felt jabs of real pain as some sort of razor sliced through his clothes, stinging.\\n\\n He rolled with the kicks and grabbed an ankle. Her leg felt like cold china. Her pump was tipped with a two-inch silver blade, smeared with garlic.\\n\\n The knife neared his face. He needed all his strength to hold her off.\\n\\n Looking up, he saw her pretty, blank face. Dots of red on bone-white cheeks, eyes blinking slowly like clockwork, sausage curls bobbing.\\n\\n There was inhuman strength in this frail doll.\\n\\n His elbows bent outwards. The knife almost touched his eye.\\n\\n They must have a detailed dossier on him. He was of a bloodline susceptible to garlic.\\n\\n \u0027Excuse me, Miss,\u0027 Beauregard said.\\n\\n The old man had scooped up the Walther and rolled his chair across the room, rucking up the carpet. He tapped the ballerina\u0027s outstretched leg with the pistol, and held the barrel to her knee.\\n\\n The ballerina\u0027s painted expression didn\u0027t change.\\n\\n Beauregard pulled the trigger. The explosion of the gunshot was enormous, ear-ringing. The gun kicked in the old man\u0027s hands and pushed him back in his wheelchair.\\n\\n The ballerina\u0027s knee exploded. Shards of china blasted all around. Oiled wires worked up and down inside her wound. Gears and cogs spilled out of the rupture. Her lower leg came loose.\\n\\n She hopped back, still perfectly balanced. Wires unrolled from her loose shin, stretched tight, and yanked the lower leg and foot out of his hands. Clear oil spilled on the carpet.\\n\\n The ballerina was a mechanical toy. All three of the team were artificial to some extent.\\n\\n Bond climbed swiftly to his feet. Instinct had taken over. His fangs were fully extended and his bloodlust was up. Having escaped death, he must feed soon. In turning and training, his circuits had been rewired. After danger, he must have blood.\\n\\n The ballerina, damaged but incapable of feeling pain, was still dangerous. The third assassin clambered over the balcony, snarling anger.\\n\\n Beauregard\u0027s chair was trapped by folds of carpet. The centenarian was out of the game, befuddled by the noise of the gun, and the suddenness of the whole thing.\\n\\n Clayface had come into the room, and blocked the door.\\n\\n Being big was no guarantee of toughness. Bond launched himself into the air and sank talons into the lumpy ruff that passed for a neck. He gripped the broad waist with his knees, opened wide his maw, and sank fangs into thick flesh, anticipating the rush of blood into his throat.\\n\\n A muddy, dirty ichor trickled into his mouth. It was not blood.\\n\\n Heavy arms clamped around him, holding him in an inescapable embrace. He felt strain in his lower back. He was about to be snapped in half.\\n\\n The impression of a face was close to him. He saw the mouth was just a line scored in mud. The eyes were glittering pebbles in holes. There was life here, but nothing he could feed off or overwhelm. Knowing few men could best Bond, Brastov had sent inhuman assassins.\\n\\n Beauregard shouted something.\\n\\n Bond\u0027s ears rang with the blood squeezed into his head. The throbbing was the low bass-line of an electric guitar, rumbling ominous yet driving chords, a signature-tune for death and danger.\\n\\n He couldn\u0027t understand. What was the old man yelling about?\\n\\n The Star of David amulet was in front of his face. The assassin\u0027s shoulder was ripped open, indented with the marks of his teeth. Inside, the flesh was wet soil, swarming to fill the hole and smooth over.\\n\\n A few of Bond\u0027s ribs snapped. Stabs of agony ran up his body.\\n\\n \u0027The Star of David,\u0027 Beauregard shouted again.\\n\\n Bond had no feeling at all below the waist. His ribs knit together with the accelerated healing prowess of a vampire, but broke again and knitted out of true. Jagged pain scratched his heart and lungs.\\n\\n He spat and spewed, voiding his mouth, and bit into the amulet. A mild sensitivity to religious objects stung his mouth. Clayface\u0027s grip froze. Bond worried at the amulet, pulling it this way and that. He got a better mouth-grip and tore it away completely.\\n\\n The semblance of life fled. Clayface became a soft statue.\\n\\n Bond was dropped. He spat out the amulet and took a deep breath, inflating his lungs, expanding his ribcage. He hoped the bones would settle into their proper places.\\n\\n The ballerina still hopped around, and the third assassin, the flatheaded man, was in the room. He took off his bowler hat.\\n\\n Bond stood up, stepping to one side.\\n\\n The bowler flew across the room like a razored discus. The assassin\u0027s snarl showed steel. The hat smashed into the clay statue, embedding itself. The brim must have been reinforced.\\n\\n Bond took the hat out of the mud wall of the statue\u0027s chest and spun it back. The assassin batted it aside with a growl and loped across the room, arms outstretched. His boot-falls shook the floor.\\n\\n Beauregard must have imperturbable neighbours.\\n\\n The assassin paused a moment by the old man, looking down at him, thinking. He was the one with flickers of independent animal intelligence, able to deviate from the plan to take into account unforeseen factors. If it hadn\u0027t been for Beauregard, either of the other killers would have finished Bond.\\n\\n The assassin raised a hand, prepared to land a killing blow.\\n\\n Calmly, Beauregard tossed the remainder of the brandy at the greenish face. The tall man shook his head like a dog, blinking and spitting. He was confused. Beauregard blew on his glowing cigar and flicked it up into the man\u0027s face.\\n\\n A puff of flame engulfed the assassin\u0027s head, singeing his lank black hair to stubble. He clawed at the fire with black-nailed hands, roaring like an animal in pain, blundering around in a blazing panic.\\n\\n Bond pushed over the statue, which shattered on the polished wood floor of the hallway, then waded through clay fragments towards the exploded front door.\\n\\n He\u0027d only just made it out of the flat when something landed on his back and clung. A leg wrapped around him, scissoring his ribs, abusing his recently broken bones.\\n\\n Cold, stiff fingers took his head and shook it, as if trying to wrest it from his shoulders.\\n\\n The ballerina sang as she tried to kill him, a high, perfect ululation. It blended with the thrumming of his blood, producing an exotic, threatening, promising song. A crimson wash rose over his vision. White porcelain arms, stained with trickling red, writhed to the blood-music.\\n\\n He threw himself around the landing, slamming his back into the walls, trying to get rid of this strange toy.\\n\\n The tall assassin, face blackened, stalked out of the flat. His steel teeth clicked together in a slow castanet rattle of death.\\n\\n Bond floundered back and collided with the barred door of the lift cage.\\n\\n Had the thug killed Beauregard before coming after him? That old man was the best in the business. He had understood what he was facing and known what to do. If Bond lived to be a hundred, he\u0027d never match that.\\n\\n He was unlikely to live to a hundred. Ten dagger-point nails were working their way through his gullet. He was on his knees, bent over backwards.\\n\\n With his free hands, he scrabbled as far behind him as possible, reaching for the lift doors. His fingers brushed the loose bars. He stretched, extending his nails, and got a grip.\\n\\n The doors parted and he heaved his shoulders, jamming the ballerina into the shaft. She freed one hand from his throat and grabbed a bar, bracing herself. He wriggled and pushed but couldn\u0027t shift her further.\\n\\n The tall assassin watched with malign interest, cunning sparking in his pained eyes.\\n\\n There was a rattle inside the liftshaft. Someone was coming up. \\n\\n","sourceLink":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3/page-9.html","bookId":2295,"book":{"id":2295,"title":"Dracula Cha Cha Cha (Anno Dracula #3)","description":"Storyline: Anno Dracula: Dracula Cha Cha Cha (Anno Dracula #3) \\n Rome. 1959. Count Dracula is about to marry the Moldavian Princess Asa Vajda - his sixth wife. Journalist Kate Reed flies into the city to visit the ailing Charles Beauregard and his vampire companion Geneviève. Finding herself caught up in the mystery of the Crimson Executioner who is bloodily dispatching vampire elders in the city, Kate discovers that she is not the only one on his trail...\\n","cover":"https://allnovel.net/images/dracula-cha-cha-cha-anno-dracula-3.jpg","author":"Kim Newman","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:59:00 PM"}}
