{"id":16950,"no":17,"title":"CHAPTER XVII THE WAY OF THE WORLD","content":"Frank felt like an impostor when he discovered that his cordial reception was wholly owing to the belief that he was his mother\u0027s heir. The situation was unpleasant, and he was impatient to have Mr. Tarbox undeceived. He was sure that Pliny would lose no time in revealing his true position, and decided not to return to the house of Mr. Tarbox till nine o\u0027clock, when the story would have been told. He wandered about aimlessly till he heard the city clocks strike nine, and then rang the bell at his relation\u0027s house. The family, with the exception of the two younger children, were assembled in the common sitting room. As Frank entered, instead of the cordial welcome he had previously received, he noticed a look of coldness and constraint on the faces of Mr. and Mrs. Tarbox, while Pliny looked as if some stupendous joke was being perpetrated. \"Good-evening!\" said Frank, politely. \"I have been taking a walk.\" \"My son Pliny tells me,\" said Mr. Tarbox, \"that you have not inherited your mother\u0027s property.\" Frank bowed. \"And that it has gone to your stepfather.\" \"It seems so.\" \"I am amazed.\" \"So was I, sir.\" \"Your mother has practically disinherited you?\" \"It was not my mother, sir,\" said Frank, hastily. \"I can\u0027t explain it, but I\u0027m sure she would not will away everything from me.\" \"Do you suspect your stepfather of anything irregular?\" asked Mr. Tarbox, briskly. \"I would rather not answer your question, sir. I don\u0027t care to make any charges which I cannot prove.\" \"And so Mr. Manning has sent you out into the world to earn your own living, has he?\" \"No, sir. He has consented that I may do so. It was my own plan.\" Much as Frank was prejudiced against his stepfather, his natural sense of justice would not allow him to accuse him unjustly. \"Did he suggest that you should come to me?\" asked Mr. Tarbox, in a tone which Frank did not like. \"No, sir.\" \"So that was your idea, too,\" continued Mr. Tarbox, with a palpable sneer. \"Yes, sir,\" answered Frank. \"You are not a very near relative, but the nearest I know of, and I supposed you would be willing to give me some advice about the best means of earning my living. I remembered,\" he could not help adding, \"that my mother received you all as guests for a considerable time, and I thought I might take the liberty.\" \"Oh, certainly!\" returned Mr. Tarbox, rather abashed. \"I am, of course, ready to give you advice, and my first advice is to seek a lawyer and let him institute a suit against your stepfather, on speculation. That is, he gets nothing if he fails, but obtains a commission if he succeeds. I could myself recommend a reliable man.\" \"Thank you, sir; but I have no present thought of contesting the will.\" \"I think you make a mistake. Do I understand that you expect to earn your own living?\" \"I shall try to do so.\" \"You will find it very difficult. You may expect me to take you into my own store, but there is no vacancy, and—\" Frank hastily assured Mr. Tarbox that he had no such expectations. He had no wish to deprive the errand boy of the two dollars a week, which he probably richly earned. \"Situations in Newark are not easily obtained,\" proceeded Mr. Tarbox. \"I am willing that you should stay with us a day or two, but I don\u0027t think you will find it worth your while to stay here.\" Mr. Tarbox feared that his young relative might expect to find a home free of charge in his house, and such an arrangement did not suit his economical ideas. There was no profit in it, but, on the contrary, a positive loss. Frank read clearly the thoughts of his host, with the help of what Pliny had told him, and, expressing his thanks very briefly, announced his intention to go to New York the next morning. \"It may be the best thing you can do!\" said Mr. Tarbox, relieved. \"New York opens a much wider field to a boy of enterprise than Newark, and probably you will pick up something to do.\" \"It won\u0027t be my fault, if I don\u0027t,\" said Frank. \"You have my best wishes,\" said Mr. Tarbox. \"The demands of my family forbid me offering you any pecuniary assistance, but—\" \"I don\u0027t stand in need of it, sir. I have money enough to keep me till I get started in something.\" \"Really, I am very glad to hear it!\" And there is no doubt that Mr. Tarbox was sincere. \"I wonder how much money he has got?\" thought Pliny. \"Perhaps he\u0027d lend me two dollars. I\u0027ll ask him, if I have a chance.\" Pliny proposed to borrow, not because he needed the money, but because he liked to levy contributions upon any available party, with a very faint idea of repaying the same. The money would go to swell his deposit at the savings bank. It was very commendable, of course, to save his money, but not at the expense of others, as Pliny too frequently did. \"I have moved you out of the spare room,\" said Mrs. Tarbox, when our hero asked permission to retire, \"and put you in the same room with Pliny. I suppose you won\u0027t mind?\" \"Just as you please, Mrs. Tarbox,\" said Frank, though he would have preferred to have passed the night alone. \"Could you make it convenient to lend me two dollars?\" asked Pliny, as they went up to bed together. \"Not just now,\" answered Frank. \"When I get something to do I shall not need to be so careful of my money.\" \"One dollar would answer,\" persisted Pliny. Without a word, Frank drew a dollar bill from his pocketbook and handed it to Pliny. \"Now,\" he thought, \"I shall not feel under any obligations to the family.\" \"You\u0027re a good fellow, even if you are poor,\" said Pliny, in high good humor. Frank was tired, and it was not long before all his anxieties for future were lost sight of in a sound and refreshing slumber. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2988/82394.html","bookId":324,"book":{"id":324,"title":"Making His Way Frank Courtney\u0027s Struggle Upward","description":"简介： Two boys were walking in the campus of the Bridgeville Academy. They were apparently of about the same agesomewhere from fifteen to sixteenbut there was a considerable difference in their attire....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2988","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
