{"id":16954,"no":21,"title":"CHAPTER XXI THE CAPTURE","content":"At the hour named, Frank repaired to the Astor House, and took a position on the steps. He looked about him for his street acquaintance, but could see no one who bore any resemblance to him. Finally, a man dressed in a gray suit with a pair of green glasses, walked carelessly up to our hero and said, in a low voice: \"Have you got the money?\" Frank looked at him in surprise. This man had thick, black whiskers, while the man who had employed him had none at all, so far as he could remember. Besides, the green glasses altered him considerably. To make sure that he was not deceived he inquired: \"What money?\" \"You know very well,\" said the man, impatiently. \"You are the boy whom I employed to sell some bonds this morning.\" \"You don\u0027t look like the same man,\" said Frank. \"Because of my glasses. I have to wear them at times on account of the weakness of my eyes.\" While he was speaking, a quiet-looking man approached and listened to the conversation. \"Then,\" said Frank, \"you can tell me how many bonds you handed me.\" \"They were two five-twenty government bonds of a hundred dollars each.\" \"Correct, sir.\" \"Then hand me the money and be quick about it, for I have no time to waste! You shall have the dollar I promised you.\" But here the quiet-looking man took a part in the conversation. Passing his arm through that of the man with the green glasses, he said: \"I will trouble you to come with me.\" \"How dare you touch me? Do you mean to insult me?\" demanded the other, struggling with captor. \"I will make all clear in due time. You must come with me and explain how you came in possession of the bonds you gave this boy.\" \"They were put in my hands by an acquaintance. If there is anything wrong, I am not to blame.\" \"In that case no harm will come to you; but now you must come along.\" After his experience, Frank walked to his boarding place. He was quite ready for six o\u0027clock. When he entered the dining room, his hostess introduced him to all. A young man sat next to him and entered into conversation. \"What do you do, Mr. Courtney?\" \"I have taken an agency to sell tea for the Great Pekin Tea Company. I am to begin to-morrow.\" \"I am afraid you won\u0027t like it. A friend of mine tried it once and came near starving.\" This was not encouraging, but Frank was not going to despair before he had fairly begun his work. \"I find that boys receive such small wages,\" Frank continued, \"that I preferred to try an agency.\" \"Quite true,\" said Mr. Preston, condescendingly. \"When I started I was paid a paltry sum; now I am not paid what I am worth. Still, twenty-five dollars a week is fair.\" \"Quite fair,\" responded Frank, who could not, of course, know that Mr. Preston did not receive one-half of this sum, though he chose to give that impression. After dinner, Preston was obliged to go back to the store where he was employed. By invitation, Frank walked with him. Turning into Sixth Avenue they passed a saloon. \"Won\u0027t you have something to drink, Courtney?\" said Preston. \"No, thank you, I never drink,\" answered Frank. \"It will brace you up, and make you feel jolly. Better come in!\" \"I don\u0027t need bracing up,\" answered Frank, quietly. \"Well, perhaps you are right,\" said Mr. Peter Preston. \"I don\u0027t indulge very often, but sometimes I feel like it.\" Some boys might have yielded to the temptation, but Frank had determined that he would abstain from liquor, and kept his resolution. A boy who comes to the city is exposed at every step to this peril, and needs a firm will to withstand it. It is the fruitful source of crime and misery, and does more to fill our prisons than any other cause. \"This is my store,\" said Preston, as he pointed to a modest-looking shop on the west side of the avenue. \"I wish I could keep you company longer, but business before pleasure, you know.\" Before returning to his boarding house, Frank sat down for a short time in Washington Park, and reviewed his plans and prospects. He could not tell how he would succeed in his tea agency; but if that failed, he was resolved to try something else. He didn\u0027t feel homesick, for since his mother\u0027s death he had no longer any home ties. Young as he was, he felt that one part of his life was at an end, and that a new life and a new career were before him. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2988/82398.html","bookId":324,"book":{"id":324,"title":"Making His Way Frank Courtney\u0027s Struggle Upward","description":"简介： Two boys were walking in the campus of the Bridgeville Academy. They were apparently of about the same agesomewhere from fifteen to sixteenbut there was a considerable difference in their attire....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2988","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
