{"id":16970,"no":37,"title":"CHAPTER XXXVII FRANK RECEIVES A LETTER FROM MR. PERCIVAL","content":"While Frank was waiting for an answer to a letter to Mr. Percival he devoted part of his time to the business which was supposed to be his only reason for remaining in Jackson. I am bound to say that as regards this business his trip might be pronounced a failure. There was little ready money in Jackson. Many of the people were tenants of Mr. Percival, and found it difficult to pay the excessive rents demanded by his agent. Of course, they had no money to spare for extras. Even if they had been better off, there was little demand for stationery in the village. The people were chiefly farmers, and did not indulge in much correspondence. When Frank returned to his boarding place on the afternoon of the first day, Mr. Hamlin asked him, not without solicitude, with what luck he had met. \"I have sold twenty-five cents\u0027 worth of note paper,\" answered Frank, with a smile. Mr. Hamlin looked troubled. \"How many places did you call at?\" he inquired. \"About a dozen.\" \"I am afraid you will get discouraged.\" \"If you don\u0027t do better, you won\u0027t begin to pay expenses.\" \"That is true.\" \"But perhaps you may do better to-morrow.\" \"I hope so.\" \"I wish you could find something in Jackson that would induce you to remain here permanently, and make your home with us. I would charge you only the bare cost of board.\" \"Thank you very much, Mr. Hamlin. I should enjoy being with you, but I don\u0027t believe I shall find any opening here. Besides, I like a more stirring life.\" \"No doubt—no doubt! Boys like a lively place. Well, I am glad you feel independent of your business.\" \"For a little time. I am afraid it wouldn\u0027t do for me to earn so little for any length of time.\" Frank enjoyed the society of Dick Hamlin. Together they went fishing and hunting, and a mutual liking sprang up between them. \"I wish you were going to stay longer, Frank,\" said Dick. \"I shall feel very lonely when you are gone.\" \"We may meet again under different circumstances,\" said Frank. \"While I am here, we will enjoy ourselves as well as we can.\" So the days passed, and at length a letter came from Mr. Percival. I append the most important passages: \"Your report is clear, and I have perfect confidence in your statement. Mr. Fairfield has abused my confidence and oppressed my tenants, and I shall dismiss him. I am glad you have found in Jackson a man who is capable of succeeding him. Solely upon your recommendation, I shall appoint Mr. Hamlin my resident agent and representative for the term of six months. Should he acquit himself to my satisfaction, he will be continued in the position. I am prepared to offer him one hundred dollars a month, if that will content him. \"Upon receipt of this letter, and the accompanying legal authority, you may call upon Mr. Fairfield and require him to transfer his office, and the papers and accounts connected with it, to Mr. Hamlin. I inclose a check for three hundred dollars, payable to your order, which you may make payable to him, in lieu of three months\u0027 notice, provided he immediately surrenders his office. Should he not, I shall dismiss him summarily, and proceed against him for the moneys he has misappropriated to his own use, and you may so inform him.\" With this letter was a letter to Mr. Fairfield, of the same purport, and a paper appointing Mr. Hamlin agent. When this letter was received, Frank was overjoyed, knowing how much pleasure he was about to give his new friends. With this appointment and salary, Mr. Hamlin would consider himself a rich man, and Dick\u0027s hope for a liberal education might be realized. The letter came just before supper, and, at the close of the evening meal, Frank determined to inform his friends of their good fortune. \"Mr. Hamlin,\" said he, \"I have some good news for you.\" \"Indeed!\" said the farmer, surprised. \"Your rent will not be increased.\" \"But how do you know this! Has Mr. Fairfield told you so?\" \"No,\" answered Frank. \"I have a question to ask. Would you be willing to take Mr. Fairfield\u0027s place at a hundred dollars a month?\" \"Willing? I should be delighted to do so. But why do you say this?\" \"Because,\" answered Frank, quietly, \"I am authorized to offer it to you at that salary.\" The whole family looked at Frank in bewildered surprise. It occurred to them that he might have become crazy. \"You!\" exclaimed the farmer. \"What can you have to do with the agency?\" Frank explained to a very happy family group and then he and Mr. Hamlin set out for the house of the agent.","sourceLink":"http://novel.tingroom.com/ertong/2988/82414.html","bookId":324,"book":{"id":324,"title":"Making His Way Frank Courtney\u0027s Struggle Upward","description":"简介： Two boys were walking in the campus of the Bridgeville Academy. They were apparently of about the same agesomewhere from fifteen to sixteenbut there was a considerable difference in their attire....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2988","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
