{"id":33106,"no":6,"title":"Chapter 6","content":"　　FRANCESCA (V.O.)\"The following week was the IllinosState Fair. The two of you were goingwith dad to exhibit Carolyn\u0027s prizesteer. It was the Sunday night youleft. I know it sounds awful but Icouldn\u0027t wait for you all to leave.\n 　　You were going to be gone untilFriday. Four days...\n 　　(beat)Just four days...\"Francesca\u0027s expression looks as if she needs a break from herfamily for more like four years.\n 　　FRANCESCA (cont\u0027d)Michael! Carolyn! Richard! Dinner!\n 　　She sets down a bowl of potatoes, a plate of sausages, coffeeand corn as one by one her family enters and sits down.\n 　　Michael enters through a screen door from the back, lettingthe DOOR SLAM SHUT.\n 　　FRANCESCAMichael, what did I tell you aboutthat door?\n 　　Richard enters after Michael, letting the door SLAM THE sameway. Francesca is about to say something, but gives up.\n 　　Everyone begins eating -- in complete silence.\n 　　When Michel can\u0027t open the ketchup bottle, Francesca grabsit, palms the top skillfully and twists it off. She hands itback to Michael who makes no comment.\n 　　When Richard scans the table for something that obviouslyisn\u0027t there, Francesca is up out of her seat before he canask, at the fridge, grabbing the sour cream, closing thefridge and back at the table with incredible swiftness.\n 　　When Michel moves his big arm to reach for the salt, heknows over his cup and saucer, which Francesca catches withboth hands before they hit the floor. Her reflexes are likea trained athlete.\n 　　Finally, Francesca is able to sit and sip her coffee. Shewatches her teenage daughter fill her plate with a blankexpression that lets nothing slip through -- no indication ofall the tempests of emotions that go through a teenage girl.\n 　　FRANCESCAYou excited about going, Carolyn?\n 　　Without looking up, Carolyn fakes a smile. Looking at her,Francesca remembers Carolyn as a three-year-old girl:\n 　　FLASHBACK.\n 　　In the same kitchen, THREE-YEAR-OLD CAROLYN runs around hermother\u0027s feet completely naked, squealing with delight asFrancesca flicks her water from the tap.\n 　　FLASHBACK ENDS.\n 　　Francesca watches as Carolyn eats in silence, distant, lockedin her own secret teenage thoughts and dreams.\n 　　Francesca then looks to her son, shoveling food into hismouth at an alarming rate. She attempts a conversation.\n 　　FRANCESCA (cont\u0027d)How was your date last night?\n 　　MICHAEL(w/o looking at her)Okay.\n 　　FRANCESCAWhat\u0027s her name?\n 　　MICHAELBetty.\n 　　FRANCESCAWhat\u0027s she like?\n 　　MICHAELOkay.\n 　　Silence. Frustrated, Francesca has a fantasy -FANTASY:\n 　　Francesca picks up a blunt butter knife, rises out of her seat,grabs her son and shoves the knife at his throat:\n 　　FRANCESCADo you like her?\n 　　Michael finally reacts with more than one word -- frightenedfor his life.\n 　　MICHAELUh... Yeah. Yeah. She\u0027s real nice.\n 　　FRANCESCAWell, what\u0027s nice about her? Tell us!\n 　　MICHAELWell, she\u0027s... she\u0027s real pretty and... and she\u0027s got a cute shape...\n 　　she\u0027s a good sport, ya know, forlaughs and(desperate)... she loves fried chicken wings andbeer.\n 　　FRANCESCAIsn\u0027t that nice? You should bring herhome to meet us!\n 　　FANTASY ENDS.\n 　　Francesca looks at Michael in disgust.\n 　　RICHARDWe better get moving.\n 　　(to Francesca)You sure you don\u0027t want to come?\n 　　Francesca looks at Richard with complete conviction.\n 　　FRANCESCAI\u0027m positive.\n 　　RICHARDI\u0027m going to miss you.\n 　　FRANCESCAIt\u0027s only four days.\n 　　He gives her a sweet peck on the lips. Francesca smiles,anxious for them all to leave.\n 　　INT. JOHNSON HOUSE - LATER THAT NIGHTAlone, dressed in her bathrobe, Francesca checks the frontdoor. She crosses to the living. Noticing two throw pillowson the floor, she arranged them neatly on the couch. She sitsherself in an easy chair then flicks on a reading lamp andopens her book. After five seconds, she closes the book. Shecrosses to the TV and turns it on, then turns it off beforethe picture tuned in.\n 　　She turns and leans on the TV, flicking the ON/OFF switch onand off as her mind wanders. She gets an idea. She crosses tothe hi-fi and looks through several albums she got from herColumbia Record Club. But nothing inspires her and shequickly loses the desire for music. She\u0027s antsy. She has thistime alone and she doesn\u0027t know how to spend it.\n 　　She walks through the dining room, passing a china closetfilled with fancy dishes and glasses. She stops. Shoved inthe corner behind is an old, un-opened bottle of BRANDY. Sheremoves up, setting atop the dining table to open it.\n 　　But when she catches a reflection of herself in the windowopposite her, she stops. She sees a lonely, frustrated womanin a tattered bathrobe anxious to open a bottle of liquor.\n 　　Deflated, she returns the brandy to the cupboard and exits.\n 　　EXT. BACK PORCH - NIGHTFrancesca sits on the porch with a book in her lap, gazingout over the pasture. It\u0027s a hot night. She opens the top ofher rope a bit. Feeling the air against her skin, she decidesto open it a bit more. She gets an idea.\n 　　Standing, she looks to see if anyone is around -- thoughrationally she knows there isn\u0027t a soul for miles. She turnsoff the porch light. With a brave and daring impulse, shesheds her bathrobe and stand naked under the night sky. Theair feels good against her body. She opens her arms upagainst the night sky and moon like an Indian priestess.\n 　　Suddenly, she starts hitting her body as mosquitoes beginattacking her bare torso. Thwarted, she quickly coversherself with a robe and runs into the house.\n 　　CUT TO:\n 　　INT. KITCHEN - MORNINGFrancesca trudges into the kitchen. As if on automatic, shetakes the coffee pot and fills it with water. She gets thecoffee and begins spooning it out. She stops. She gets theidea of taking herself out for breakfast and dumps the coffeepot out.\n 　　CUT TO:\n 　　EXT. MAIN STREET; WINTERSET - MORNINGA one street town. On either side are rows of storefronts, anold coffee shop/diner, a bank, a medical center, a newspaperbuilding, a courthouse and a movie theater showing CAT BALLOU.\n 　　The steeple of the local church is the highest structure,towering over the town from the end of Main Street. 　　后来,他告诉她他自己也莫名其妙，那天看着她脱靴子的时候是他记忆中最肉感的时刻.为什么,这不重要.这不是他对待生活的态度.\"分析破坏完整性.有些事物,有魔力的事物,就是得保持完整性.如果你把它一个部件一个部件分开来看,它就消失了.\"他是这样说的.\n 　　她坐在桌旁,一只脚蜷在下面,把一缕落在脸上在头发拢回去,用那玳瑁梳子重新别好.然后又想起来,到最靠近的柜子上头拿下一个烟灰缸放在桌上他能够得着的地方.\n 　　得到这一默许之后,他拿出一包骆驼牌香烟来,向她伸过去.她拿了一支,并注意到微微点潮湿,是他出汗浸的.同样的程序.他拿着金色吉波打火机,为稳住打火机碰到了他的手,指间触到了他的皮肤,然后坐回去.香烟味道美妙无比,她微微笑了.你到底是做什么的-我是说摄影做什么?\n 　　他看着他的香烟静静地说:\"我是一个合同摄影师--给\u003c地理杂志\u003e摄影,是部分时间,有时我有了想法,卖给杂志,然后给他们拍照,或者他们需要什么,就找我让我为他们拍照.那是一个相当保守的刊物,没有很多发挥艺术表现力的余地.但是报酬不错,不算特别优厚,可是相当不错,而且稳定.其余时间我就自己写,自己拍,然后把作品寄给其他杂志.生活发生困难的时候我就做合作项目,不过我觉得那种工作太束缚人.有时我写诗,那纯粹是给自己写的.时不时的也写写小说,不过我好像没有写小说的气质.我住在西雅图北部,相当多的时间在那一带工作.我喜欢拍渔船.印地安人聚居区和风景.\u003c地理杂志\u003e常常把我派到一个地方去一两月,特别是制作一项大的作品,例如亚马逊河的一部分,或是北非沙漠.平常在这种情况下我都乘飞机去,在当地租一辆车.但是我有时想要开车经过一些地方作些侦察,以为将来的参考.我是沿苏必利尔湖开车来的,准备穿过黑山陵回去,你怎么样?\"弗朗西丝卡没有准备他问问题.她到吾了一会儿说:\"咳,我跟你做的可不一样.我得的学位是比较文学.我一九四六年到这里时温特塞特正找不到教师.我嫁给了个当地人而且还是个退伍军人,这使我能被接受.于是我得了一张教师执照,在中学教了几年英文.但是理查德不喜欢让我出去工作.他说他能养活我们,不需要我去工作,特别是当时两个孩子正在成长.于是我就辞了工作,从此成为专职农家妇.就这样.\"她注意到他的冰茶差不多喝完了,又给从大口杯里倒了一点.谢谢.你觉得依阿华怎么样?\n 　　这一瞬间这句问话是真诚的,她心里明白.标准的答话应该是:\"很好,很宁静.这里的人的确善良.\"她没有立即回答.:我能再要一到烟蚂?\"又是那包骆驼牌,又是那打火机,又是轻轻碰了一下手.阳光在后廊地板上移过,照在那狗身下,它爬起来,走出视线之外.弗朗西丝卡第一次看着罗伯特金凯的眼睛.我应该说:\u0027很好,很宁静.这里的人的确善良.\u0027这些大部分都是真的.这里是很宁静.当地人在某种意义上是很善良.我们都互相帮助,如果有人病了,受伤了,邻居就会进来帮着拣玉米,收割燕麦,或者是做任何需要做的事.在镇上,你可以不锁车,随便让孩子到处跑,也不必担心.这里人有很多优点,我敬重他们的品质.\u0027但是,终于坦白了.这句话已存了多年,但是从来没有说出来过.现在,她对一个从华盛顿贝灵汉来的有一辆绿色卡车的男人说出来了.\n 　　他一时间没说什么.然后说:\"我那天在笔记本里记下一些话以备将来用.是开车时临时想到的,这是常有的事.是这样说的:\u0027旧梦是好梦,没有实现,但是我很高兴我有过这些梦.\u0027我说不上来这是什么意思,但是我准备用到什么地方.所以我想我能理解你的感觉.\"弗朗西丝卡向他笑了,她第一次笑得热情而深沉.接着赌徒的冲动占了上风.\"你愿意留下来吃晚饭吗?我全家都到外地去了,所以家里疫什么东西,不过我总可以弄出一点来.\"我确实对杂货铺.饭馆已经厌倦了.如果不太麻烦的话,我愿意.你喜欢猪排吗?我可以从园子里拨点新鲜菜来配着做.素菜就好.我不吃肉,已多年了.不是什么大不了的事.就是觉得那样更舒服.\n 　　弗朗西丝卡又笑了.\"此地这个观点可不受欢迎.理查德和他的朋友们会说你破坏他们生计.我也不大吃肉,不知为什么,就是不喜欢.但是每当我在家试着做一顿无肉饭菜时,就会引起反抗的吼声.所以我已放弃尝试了.现在想法儿换换口味是挺好玩的.\"好的.不过别为我太麻烦.听着,我的冷藏箱里有一包胶卷,我得去倒掉化了的冰水,整理一下.这要占时间.\"他站起来喝完了剩茶.\n 　　他看着他走出厨房门,穿过游廊走进场院.他不像别人那样让百叶门砰一声弹回来,而是轻轻关上.他走出去前蹲下拍拍那小狗,小狗舐了几下他胳膊表示对这一关注领情.\n 　　弗朗西丝卡上楼匆匆洗了一个澡,一边擦身一边从短窗帘的上面向场院窥视.他的衣箱打开着,他正在用那旧的手压水泵洗身.她原该告诉他如果需要可以用房子里的蓬蓬头洗澡她原是想说的,又觉得这样似乎超过了熟悉的程度,以后自己心情恍惚,把这事忘了.\n 　　可是罗伯特金凯在这恶劣得多的条件下都洗漱过.在虎乡用腥臭的水洗.在沙漠中用自已罐头筒盛水洗.他在她的场院脱到腰部,用旧衬衣当毛巾使.\"一条毛巾,\"她自责的说,\"至少一条毛巾,我这点总可以为他做的.\"\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/158/6087.html","bookId":328,"book":{"id":328,"title":"廊桥遗梦 The Bridges of Madison County","description":"简介： 卡洛琳和迈克是姐弟俩，他们婚姻生活很糟糕，都面临着家庭离异的困扰。正当他们不知何去何从时，突然收到了消息母亲弗朗西斯卡去世了，两个人急急忙忙赶回了童年时生活的乡村。在收拾母亲的遗物时，他们发现了母亲给他们留下的一封长信，深埋在她心底的一段感情秘密让姐...","cover":"http://novel.tingroom.com/uploads/allimg/101230/129246664320ad4.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/158","creation":"Aug 1, 2019 12:18:34 AM","modification":"Aug 1, 2019 12:18:34 AM"}}
