{"id":54972,"no":1027,"title":"Chapter 1023 Perfect Sevenfall","content":"Chapter 1023 – Perfect Sevenfall\\n\\n …\\n\\n …\\n\\n …\\n\\n Within the long history of the Ancient Phoenix Clan, there had indeed been geniuses that were able to form an origin energy cloud before they reached Ninefall. But, that only happened at Eightfall. For someone to condense an origin energy cloud at Sevenfall, that was almost impossible to imagine!\\n\\n After Monarch Sweetyfox and Duke Golden Sword realized what happened, the other young disciples all began to catch on. It had to be known that most of the disciples present hadn’t been able to achieve the ninth stage of Life Destruction. They had only reached the eighth stage of Life Destruction before stepping into the Divine Sea realm.\\n\\n To reach Ninefall and form the lowest level of origin energy clouds was a dream that many of these disciples wished for, much less forming an origin energy cloud at Sevenfall.\\n\\n This meant that in the future when Lin Ming stepped into the eighth and ninth stages of Life Destruction, the origin energy clouds he formed would be far greater, and the baptism of Laws he would bathe in would be that much more intense!\\n\\n To an ordinary disciple, being able to undertake a baptism of Laws was an unbelievable luxury, much less being able to do so three times. That was a feat that others simply couldn’t compete with.\\n\\n As the surging origin energy clouds reflected in Yan Littlemoon’s bright pupils, she sighed again and again. She had a faint premonition in her heart that Lin Ming was destined to shine in radiant glory within the Ancient Phoenix Clan. He would take that as his foundation, and move towards the greater stage of the Divine Realm’s 3000 great worlds…\\n\\n ……………..\\n\\n The turbulent origin energy cloud in the sky continued for a quarter hour. It finally gathered in a radius of three miles; this was also called a Single Layered Heavens.\\n\\n The origin energy cloud of a Single Layered Heavens wasn’t considered much at all. However, Lin Ming was only at the seventh stage of Life Destruction. This three mile radius origin energy cloud actually represented the beginning of everything.\\n\\n As they said, the Dao gave birth to one, one gave birth to two, two gave birth to three, and three gave birth to all of creation!\\n\\n Three was the beginning of all things and also the foundation of the world. This numeral in itself contained the great truths of the universe.\\n\\n “A three mile origin energy cloud…” Monarch Sweetyfox gulped. As she looked up at the skies, she was actually glad that Lin Ming hadn’t been able to reach four or five Layered Heavens in a single go, otherwise she really wouldn’t know what expression to make.\\n\\n However, she soon discovered that the origin energy cloud Lin Ming formed was not ordinary at all. Rather, a thin layer of fog fluttered around the origin energy cloud. This fog seemed common and ordinary, but it actually gave off a boundless and ancient feeling. Just by looking at it, one could feel the breath of the Great Dao blowing down at them.\\n\\n “What is that?”\\n\\n Monarch Sweetyfox was startled. Even with her understandings of the Laws, she still found it difficult to see through that thin layer of fog. As she continued gazing at it, she found that the breath of the Great Dao Laws had simply vanished, as if it had never been there to begin with.\\n\\n This fog was the elementary form of grandmist energy. When Lin Ming had perceived the chaos stones, he had incorporated the Grandmist Laws within him. Thus, the origin energy cloud he formed naturally carried with it the aura of the Grandmist Laws.\\n\\n The Grandmist Laws were derived from the changes that happened when the universe first formed. Because that time was too far away, grandmist energy had all but disappeared from the world. It could only be found in some black holes as well as some extremely mystical stars. Even if one found grandmist energy, that grandmist energy would have already lost its vibrancy, and thus it would have also lost the aura of its Laws.\\n\\n Lin Ming’s flesh and blood particles, the fragments of his soul, all of it shot upwards through the massive energy funnel and into the origin energy cloud.\\n\\n Here, the heaven and earth origin energy had already condensed into countless postcelestial dao diagrams. These postcelestial dao diagrams were incomparably mysterious and exquisite. They condensed, shattered, reformed, and then cracked apart once again in a never ending cycle. Lin Ming’s flesh and blood particles wrapped around these postcelestial dao diagrams. His entire body was subtly sifted through by the Laws; the advantages he obtained from this were immeasurable.\\n\\n When a martial artist crossed Life Destruction and had to withstand a baptism of Laws from within the origin energy cloud, that was the same as directly thrusting the Heavenly Dao into their body. One was a memory of the brain, and the other was having the Heavenly Dao plunge into the body. The differences between these two methods could be imagined!\\n\\n This baptism continued for two hours. Lin Ming’s physical body finally began to slowly reform. First was the black hole revolving core. Then, with the revolving core as the foundation, countless particles gathered, forming the skeleton, organs, bones, and finally the muscles and skin…\\n\\n The spiritual sea also began to slowly condense. Those soul waves that were reverberating within the origin energy cloud began to gather within Lin Ming’s mortal body, forming a complete soul.\\n\\n As Lin Ming’s body formed, many of the postcelestial dao diagrams formed by the Laws buried themselves into Lin Ming’s body, becoming a part of him.\\n\\n If someone were to cut apart Lin Ming’s body now, they would be able to find fragments of Laws and postcelestial dao diagrams formed from Laws within him. Not just that, but there were also the Law runes that had deeply engraved themselves into the very marrow of his bones.\\n\\n This was also a manifestation of the postcelestial Great Dao.\\n\\n The process of his body reforming continued for several hours. Because a massive amount of the phoenix bloodline had been integrated into him, Lin Ming’s physical body had become far more tenacious and clear like crystal, like the purest jade that contained not a single impurity. His compatibility with the Fire Laws had also been raised to a nearly unimaginable degree.\\n\\n His hair was tinged with red. Every single strand of hair was like a thread of silk, glossy and lustrous, yet incomparably tough. Even a saber wouldn’t be able to cut a strand of hair apart.\\n\\n If someone was able to obtain a single strand of Lin Ming’s hair, they could absolutely refine it into a top quality rope-class treasure. If this treasure were placed in the world of mortals, it would cause even Divine Sea powerhouses to struggle for it.\\n\\n Lin Ming slowly opened his eyes. A brief brilliant flame flashed in his clear pupils. With a thought, the fire origin energy around him transformed into a red silk robe that wrapped round his body. In the next moment, the entire three mile origin energy cloud also completely gathered towards the center and submerged into Lin Ming’s body.\\n\\n Lin Ming had used around two whole days to complete this seventh stage of Life Destruction!\\n\\n As the red-robed Lin Ming slowly fell down from the sky, the incomparably wild and violent fiery astral winds that blew towards him suddenly became inexplicably quiet and gentle around him, as if Lin Ming had become their master.\\n\\n Dressed in red, his clothes floating in the wind and his long hair wildly waving around, Lin Ming’s two pupils shined like twin moons in the night sky. As he stepped onto the wind, every step he took formed a blue lotus of heaven and earth origin energy underneath his feet. These blue lotuses blazed like flames, lingering for a long period of time, clearly far more wondrous and profound than the blue lotuses Yan Littlemoon had formed. As he walked onto these blossoming flowers, it was like he was stepping on the road to heaven.\\n\\n In this moment, Lin Ming seemed as if he had come from the heavens, an immortal ruler descended to the world!\\n\\n As the martial artists present saw Lin Ming, all of them were shocked from the depths of their hearts. It was as if Lin Ming himself was a condensation of the Heavenly Dao. Every step he took brought with it the aura of the Laws!\\n\\n With a single order, with the slightest movement, the Laws moved at his command!\\n\\n “Perfect seventh stage Life Destruction…” Monarch Sweetyfox gazed at Lin Ming with some envy in her eyes. “Because of his gold battle spirit, he was able to break down his soul into the tiniest soul waves, thoroughly tempering himself. In addition to that, he was also baptized by the Laws of the world. If he rushes into the 18 Hells of Flame again, he might not be able to make it to the eighth level, but he can at least approach the seventh level 5000 mile distance!”\\n\\n The 18 Hells of Flame mainly tested a martial artist’s understandings of the Laws; cultivation had a much smaller influence. In truth, regardless of whether Lin Ming was at the sixth or seventh stage of Life Destruction when he entered the Hells of Flame, the difference wouldn’t be much. The reason was that at this depth, the fiery astral winds were too violent and dangerous. Even a Divine Transformation realm powerhouse would find it difficult to withstand it if they didn’t use the power of Laws. Compared to a Divine Transformation powerhouse, the difference between the sixth and seventh stage of Life Destruction was just too minor.\\n\\n But when Lin Ming had crossed the seventh stage of Life Destruction, he had withstood a baptism of the world’s Laws. His understanding of the Laws was already destined to become far more profound, and the distance he could reach would also be much deeper!\\n\\n Duke Golden Sword’s voice was thick with feeling as he said, “When Lin Ming crossed the seventh stage of Life Destruction, the impact this will have on his results in the 18 Hells of Flame won’t be that great. But, the influence it will have in the Illusionary God Combat Array will be remarkable. The Illusionary God Combat Array only tests one’s talent in true combat ability. Whether the enemies are weak or strong, that will depend on Lin Ming’s age. When Lin Ming crossed the seventh stage of Life Destruction his age didn’t change, thus his enemies’ strength will not have increased. But, Lin Ming’s strength actually rose by a large margin! I fear even the set standard of the Thousand Slaughter cannot hold him back!”\\n\\n Duke Golden Sword originally held a great appreciation towards Lin Ming. But now, his appreciation seemed far too insufficient. Lin Ming’s talent was over a 100 times what he had dared to imagine!\\n\\n He feared that within a thousand years, rather than him appreciating Lin Ming, he would be hoping that Lin Ming appreciated him instead.\\n\\n “In any case, Lin Ming’s Fire Spirit Star smelting trial will shock the entire Ancient Phoenix Clan. All of the great noble families will extend an olive branch to him. Lin Ming will step to the height of his fame, wielding great power. At that time, which family Lin Ming chooses to side with will become a vital matter that the entire Ancient Phoenix Clan will be focusing on!”\\n\\n “That’s right. Another tumultuous storm will come to the Ancient Phoenix Clan. The Xiao Family has Xiao Chuji and the Huang Family has Huang Yuefeng. Only the Huo Family’s current generation is a bit weak. I think that the Huo Family will do everything in their power, no matter how unsavory, in order to win over Lin Ming. They may even think of raising Lin Ming to be their next candidate for the throne of the Patriarch, so that they can compete with the Huang Family and Xiao Family!”\\n\\n In order to raise a Divine Realm Holy Lord level extreme talent, a tremendous amount of resources was necessary. There were even many resources that there was only a single portion of. If someone used it, no one else would be able to. Thus, even in the three great noble families that had such a deep background, they could only focus their strength and raise one genius at a time.\\n\\n The Xiao Family and Huang Family already possessed an extreme genius in their ranks, so it was impossible for them to do everything in their power to raise Lin Ming. Moreover, even if they decided to raise Lin Ming, they still wouldn’t push him into struggling for the position of Patriarch. First they would place the greatest consideration on their own direct descendent disciples. This meant that the Huo Family would have an even greater superiority in winning over Lin Ming!\\n\\n Monarch Sweetyfox said, “I fear that the Huo Family will have to hemorrhage a great deal of wealth this time. Lin Ming’s existence is too important to them. In order to win over Lin Ming, they will put forth endless benefits! Even if they will bear a great deal of resistance in pushing Lin Ming to become the next Patriarch, and even if they fail in the end, if they managed to gain a Vice Patriarch with the strength of a Holy Lord level master, that will also be greatly significant to the Huo Family!”\\n\\n Although the Ancient Phoenix Clan only had a single Patriarch at any given time, there were actually multiple Holy Lord level powerhouses. For instance, the Highest Elders that had withdrawn from their position of Patriarch or Vice Patriarch. There were even some divinely gifted extreme geniuses that had become Vice Patriarchs after failing for some reason in their struggle for the throne of the Patriarch. Even so, their combat strength wasn’t necessarily any worse than the current Patriarch’s.\\n\\n “Send this news out. I think that the Huo Family needs it the most. I believe that before the Fire Spirit Star smelting trial ends, they will already have sent out a messenger to contact Lin Ming. Golden Sword, aren’t you also someone of the Huo Family? Your father-in-law should be very happy to hear this news.”\\n\\n Monarch Sweetyfox teased as she suddenly remembered something.\\n\\n Duke Golden Sword glared back at Monarch Sweetyfox. He grouchily said, “I am of the Golden Family. I only married a daughter of the Huo Family. Only someone like you would use such a matter to pick on me.”\\n\\n Although Golden Sword seemed angry, he actually didn’t mind that much. He understood how important it was to seek the shelter of a distinguished family. If he hadn’t married a talented young woman of the Huo Clan, he would never have managed to reach this step.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1023","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
