{"id":54978,"no":1033,"title":"Chapter 1029 World of Will Projection","content":"Chapter 1029 – World of Will Projection\\n\\n …\\n\\n …\\n\\n …\\n\\n 650 people, 680 people, 700 people!\\n\\n As the seventh star on the portal’s arch lit up, this signified that Lin Ming had cut down 700 enemies. At the same time, the number of opponents he faced at once suddenly increased to 21 people.\\n\\n With every 100 people slain, the difficulty of the Illusionary God Combat Array would sharply increase. Upon reaching 600, the difficulty wasn’t too great. But from going to 600 to 700, the difficulty would double!\\n\\n All 21 opponents that showed up were eighth stage Life Destruction powerhouses. In the future, they would be characters that would step into Ninefall. If the 21 of them combined their strengths, uniting their combat techniques together, the pressure they placed on Lin Ming would increase by another level!\\n\\n Lin Ming grasped the Phoenix Blood Spear in his hands, his nerves as sharp as steel wire. Up until now, he had been focusing on saving as much true essence and energy as possible. If he could use just one move to defeat his opponent then he wouldn’t use a second. If he could depend on the Phoenix Blood Spear then he wouldn’t need to use his own true essence.\\n\\n Using various methods to reserve his strength also meant that he was limiting his combat prowess. This caused his battles to seem on the edge of danger.\\n\\n And as Lin Ming was buried in this battle, he forced himself to his limit again and again. He lowered his strength and true essence usage to just the amount required, tempering his own fighting style.\\n\\n After cutting down 700 enemies, every subsequent one had their own intelligence and mind, and their combat methods also came in an endlessly shifting variety. Lin Ming suspected that all of these people were once absolutely genius martial artists. When the supreme elder built the Illusionary God Combat Array, he had also used some special method to input all of these genius’ information into the array formation, reproducing the glory of their past!\\n\\n These energy bodies were all outstanding heroes of their own era. All of them excelled in combat, and all of them had rich experience in life or death trials. Although their cultivation was only at the eighth stage of Life Destruction, it still wasn’t easy for Lin Ming to slay them in a situation where he was trying to conserve his true essence! In particular, when he went to kill someone, he would encounter the coordinated counterattack of the others; he had to be extremely careful in his movements.\\n\\n But in such a brutal melee, Lin Ming also obtained enormous benefits. He was absorbing everything around him, experiencing for himself the countless fighting methods of past combat crazy geniuses.\\n\\n 730 people…\\n\\n 740 people…\\n\\n 750 people…\\n\\n Although the opponents past 700 were more powerful than those that had come before, none of them were able to stop Lin Ming’s footsteps. He killed his way through the crowd of opponents until he had finally cut down 800 in total!\\n\\n At this time, from the point when Lin Ming had entered the Illusionary God Combat Array, nearly six hours had passed.\\n\\n “800 Slaughter!”\\n\\n As everyone outside looked at the light screen in the sky, all of them gulped. They had discovered that their thoughts of the Illusionary God Combat Array had been far too simple. Not to mention that Lin Ming was undergoing a frigid battle inside, even they who were watching from the outside felt their minds strained as they lay witness to this never ending battle. \\n\\n “Mm? That person is… Ninefall cultivation!”\\n\\n After killing 800 people, Lin Ming now faced 24 opponents at once. And among them was a single Ninefall powerhouse!\\n\\n Lin Ming was currently 29 years old, so his opponent was naturally also 29 years old. What sort of concept was a 29 year old Ninefall martial artist? That was a cultivation speed almost the same as Yan Littlemoon’s. Although Yan Littlemoon had the appearance of a young girl, the truth was that she was 27 years old. She would soon step into Eightfall, and she would reach Ninefall when she was 28 or 29 years of age.\\n\\n For such a monstrous genius with an amazingly high cultivation speed, even if their strength couldn’t exceed Yan Littlemoon’s because of the difference in their bloodlines, the difference was probably not too far off.\\n\\n After cutting down 800 people, the crowd of enemies he faced now could be called truly terrifying!\\n\\n As these 24 opponents appeared, they didn’t immediately attack. Instead, they carefully observed Lin Ming. Their eyes didn’t seem like those of an energy body that didn’t possess life. Instead, a vibrant intelligence glimmered behind their pupils. They were looking for Lin Ming’s weakness.\\n\\n As one went further into the Illusionary God Combat Array, the opponents would become increasingly intelligent. At the very start, the energy forms that the Illusionary God Combat Array produced seemed no different from puppets that didn’t have a mind of their own. Thus, they didn’t understand anything that was happening. But now, nearing the end, these opponents all had varied mystical combat methods. Their attacks were cunning and filled with guile, and their defenses were tightly guarded. These were extremely difficult opponents!\\n\\n “It looks like what I’ve heard before wasn’t wrong. The Illusionary God Combat Array is a special memory-type array formation system. The world inside is a projection of a will world. Every genius that enters is recorded by the array formation. Now, the opponents that Lin Ming has to face are all true geniuses that were recorded down inside the array formation’s memory. If any one of these people were to be placed in the 72 branch palaces, they would be extremely outstanding characters, leaders of their own generation. If they went to somewhere like Saint Artifact Pavilion, they would even be able to take their own top grade saint artifact!”\\n\\n The one who spoke was White Daohong. He had also rushed through the Illusionary God Combat Array several times in the past. But, for him to have an achievement like killing 700 or even 600 people, that was simply impossible. He could only feel powerless and bitter in the face of such a hurdle. Thus, the opponents White Daohong faced inside were usually energy form puppets that the Illusionary God Combat Array produced, beings without a mind of their own. Their fighting techniques were rigid and they were easy to kill. There was no way to compare them with the opponents that Lin Ming was currently facing.\\n\\n “800 Slaughter… this brat has finally reached this step. In the past when I was at the Divine Transformation realm, I was also stranded here. At the end, I managed to kill 882 people, but I never managed to break through 900 people. It looks like this brat Lin Ming is still holding himself back, so surpassing me shouldn’t be a problem for him. However, after 900 people, that is when the true difficulty begins!”\\n\\n Huo Violentstone thought out loud. And as he spoke, Lin Ming began fighting these 24 opponents.\\n\\n Woosh –\\n\\n As 24 people attacked him together, all of their attacks locked onto Lin Ming’s vital points. At 600 people, Lin Ming was still able to rely on his extraordinary speed to dodge through the gaps produced by the difference in weapon speeds. But now, after slaying 800 opponents, all of these attacks were like bolts of lightning, far too difficult to avoid. He immediately fell into a siege on all sides.\\n\\n Lin Ming’s pupils shrank. With a loud shout, the gold battle spirit in his spiritual sea howled out, forming a world of will projection around him.\\n\\n A gold battle spirit’s world of will was able to suppress the real world to an extent. When one’s will was formidable enough, they could pour their will into anything within their world of will, making it indestructible and impenetrable.\\n\\n For instance, the air and heaven and earth origin energy within the world of will projection.\\n\\n If he fused his will with the air, he could make the air as hard as divine steel, crushing to death all enemies that stepped into his world of will.\\n\\n If he poured his will into the heaven and earth origin energy, he could cause it to become as wild and fiery as a volcano, making it so that enemies couldn’t use it.\\n\\n Peng! Peng!\\n\\n In front of Lin Ming, two sword lights were directly blown up by a single thought from him!\\n\\n Although it seemed as if Lin Ming had only glanced at the two sword lights to destroy them, the truth was that in that brief flash, he had disturbed the composition of origin energy that served as the foundation for the sword lights, causing them to not be cohesive anymore and naturally disperse. Such a move wasn’t light on Lin Ming’s consumption of soul force.\\n\\n Then, Lin Ming took advantage of this opportunity he created by ripping apart the two attacks, and flushed out.\\n\\n Chasing Thunder!\\n\\n Without using the energy attack of the Phoenix Blood Spear, Lin Ming directly used his true essence. Although Chasing Thunder couldn’t compare with the might of the nine through nine rebirthed to one array formation in the Phoenix Blood Spear, in terms of speed it was far faster. At this moment, what Lin Ming needed the most was speed!\\n\\n Ca!\\n\\n There was a flash of purple light, a saber-using black-clothed man was directly stabbed through the stomach by Lin Ming. A flash of lightning swept over him, instantly crushing his dantian into pieces. The black-clothed man died where he stood.\\n\\n After Lin Ming instantly killed one person, he took this chance to kill another. However, he was blocked by others and forced away by their attacks. But, the wave of electricity still surged over that second person, causing their entire body to be briefly paralyzed.\\n\\n This brief moment was all Lin Ming needed.\\n\\n Purple Lion Thunder Source!\\n\\n Roar!\\n\\n The Heretical God Sprout’s second thunder leaf began to shine with a blazing light. With a loud lion’s roar, a purple lion shot out like a bolt of lightning. With the support of the gold battle spirit, the purple lion’s speed instantly reached an unbelievable degree, a velocity so fast that even the surrounding space twisted!\\n\\n Puff!\\n\\n The purple lion turned into a bolt of light that broke into the second black-clothed man’s body, searing his organs and instantly killing him!\\n\\n Although he had killed two people in the blink of an eye, Lin Ming’s battle in this brief moment was not easy at all. If his response had been slightly slower or if his attacks didn’t connect correctly, then the results would have been drastically different. After slaying 800 people, the enemies Lin Ming faced had slowly begun to truly threaten him. He had no choice but to reveal more and more of his strength, consuming more energy in the process.\\n\\n Lin Ming began to admire the Battle King that had completed the Thousand Slaughter 40,000 years ago. Completing the Illusionary God Combat Array’s Thousand Slaughter was much more difficult than how Lin Ming imagined it would be. Although Lin Ming was still holding back, he expected that once he had slain 900 people and neared the Thousand Slaughter, the enemies he faced would be far more terrifying. In order to confront them he would have to fight with everything he had.\\n\\n The Illusionary God Combat Array’s Thousand Slaughter surpassed even the 18 Hells of Flame’s seventh level in difficulty. There was a reason that only one person in the Ancient Phoenix Clan had managed to overcome this pass in over 40,000 years!\\n\\n It had to be known that the Ancient Phoenix Clan had over 100 billion clansmen. In 40,000 years, over a trillion geniuses had probably emerged. And among these geniuses were countless ones that had come from great noble families, and also countless ones that had gone through epic adventures and encountered unbelievable lucky chances. But even then, in front of completing the Thousand Slaughter, all of these countless geniuses had been defeated!\\n\\n After killing two people, Lin Ming immediately felt the pressure on him reduce by a great amount. He combined his attacks with the gold battle spirit and easily followed up by killing a third, fourth, and fifth person.\\n\\n After killing the eighth person, a third of the 24 man formation had been killed off. The combined combat technique completely shattered! Following that was a scene of massacre. Lin Ming put forth all kinds of moves and killed one after another until all 24 had died!\\n\\n From killing 800 to killing 900, there would only be four waves of enemies. Lin Ming had exterminated a wave and clearly had plenty of strength left over. No one suspected that he would have trouble slaying 900 enemies.\\n\\n “I never thought that Junior-apprentice Brother Lin would have such achievements in the Concept of Thunder!”\\n\\n “He has a dual-attribute physique. His compatibility with the Thunder Laws must be beyond our imaginations!”\\n\\n Like this, Lin Ming slaughtered wave after wave, all the way until he cut down the 890th person. He easily surpassed Huo Violentstone’s past results.\\n\\n At this time, the number of opponents he faced at once increased by three yet again, turning into 27!\\n\\n 27 was originally three sets of nine. This numeral it itself contained a truth of the world that was difficult to describe.\\n\\n As long as he could pass through this checkpoint of 900 people, he would reach the Thousand Slaughter!\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1029","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
