{"id":55042,"no":1097,"title":"Chapter 1093 Ambush","content":"Chapter 1093 – Ambush\\n\\n …\\n\\n …\\n\\n …\\n\\n They walked for several breaths of time as Lin Ming led the disciples of Carefree Island to the back of a giant crag.\\n\\n “Stay here and hide. Don’t move!”\\n\\n “This is… what are we doing?”\\n\\n Many disciples were confused. But they were used to obeying orders, and in this sandstorm, they were no different from being blind. It was simpler to do whatever Lin Ming asked of them.\\n\\n “Do you guys know how to use attack array formations?” Lin Ming suddenly asked, remembering something. \\n\\n When he was in the God Beast Mystic Realm, the battle formation the Ancient Dragon Clan used had left a deep impression on Lin Ming. If it weren’t for that terrifying combined combat strength that forcefully diverted the Asura King’s attention, there was no way Lin Ming could have obtained the supreme dragon bone and helped Mo Eversnow reawaken.\\n\\n If the disciples of Carefree Island could form an array formation, their striking power could multiple by several times. That would be a great help in this situation!\\n\\n After all, there were many enemies this time. In such a battle, the role of the individual was inevitably lessened.\\n\\n “We do.” Ye Rosewater nodded. These disciples were her subordinates and they had trained in some offensive array formations together.\\n\\n “Good. First wait here and restrain your senses. Wait for my order, and on my command, launch your array formation attack!”\\n\\n “Okay!”\\n\\n Like this, the Carefree Island direct disciples hid behind the rock crag, waiting in ambush. Lin Ming was clear that in such horrible weather, Splintersoul Mountain and the Occult Bone Clan wouldn’t randomly attack. Once the disciples of Carefree Island scattered in all directions to escape into the sandstorm, there would be no hope of chasing after all of them.\\n\\n The enemy would definitely wait until the sandstorm stopped before they began their assault.\\n\\n At this time, six or seven miles away from Lin Ming and the Carefree Island disciples, a group of black-cloaked martial artists were completely buried in the blood sands. They didn’t even need to dig their way down. The sand falling down from the storm was enough to bury them. These people were all disciples from Splintersoul Mountain.\\n\\n Not too far away from them, the disciples from the Occult Bone Clan were also lying in wait. There were around 20 of them, and there was even a late Divine Sea master leading them.\\n\\n “Hehe, that’s the pit. I can already smell the delicious scent of prey. Ye Rosewater, I’m really looking forwards to you!”\\n\\n The Occult Bone Clan and Splintersoul Mountain sent two late Divine Sea disciples to lead this expeditionary group to kill Lin Ming. The two late Divine Sea disciples were specifically to suppress Ye Rosewater. It would be two against one, and in a situation where they had the advantage due to a sneak attack, the result of the battle could be imagined.\\n\\n “I have no idea if White Mirrorjade’s information is reliable. It might be a trap.”\\n\\n “It shouldn’t be. I caught a sandworm around here and read its memories. There were truly only over a dozen direct disciples that walked towards the direction of the purple mountain. The intel shouldn’t be wrong. These disciples are nothing but fish on the chopping block, and White Mirrorjade’s main force is a thousand miles away, so how could he possibly ambush us?” the Occult Bone Clan captain said with a proud expression.\\n\\n Those from Splintersoul Mountain couldn’t help but praise the special skills of the Occult Bone Clan. Because the Occult Bone Clan was skilled in the Laws of Life, they were even able to read the memories of sandworms. This method of detection was nearly impossible to guard against. Of course, this technique also had its limitations. One could only see places were the target had passed through, and if one really controlled a sandworm, a master would be able to discover the traces of divine sense left behind in the sandworm.\\n\\n “Why won’t this sandstorm end already? I just can’t wait!” The late Divine Sea Occult Bone Clan martial artist greedily rubbed his hands together. The Occult Bone Clan focused on sexual obscenity and gluttony; through these two vices, they were able to perceive the Laws of Life. The women that were in the ranks of their enemies often ended up with a miserable fate. He especially wouldn’t miss out on such a top grade beauty like Ye Rosewater.\\n\\n “Calm down. The sandstorms in the Red Desolate Mystic Realm appear in a very ordered fashion. They don’t last too long each time; this one should end soon,” the late Divine Sea Splintersoul Mountain disciple said with a true essence sound transmission. “Hehe, speaking of which, although we can kill Ye Rosewater, trying to capture her alive with her level of cultivation won’t be easy. I think you shouldn’t keep your hopes up. That is, unless you’re interested in her corpse.”\\n\\n “Humph! My Occult Bone Clan is focused on perceiving the essence of life. A corpse has already lost all hints of life. Even if she is far more beautiful, I still wouldn’t be interested. Only you cultivators from Splintersoul Mountain are so interested in gross things like corpses and ghosts. You don’t need to worry about me, I already have a method to capture her alive. With so many people and surprise on our side, this should be absolutely easy. Moreover, I also have a final killing move!” the late Divine Sea Occult Bone Clan martial artist said with confidence.\\n\\n “Hehe, I’m not interested in arguing with you. I don’t care what you do as long as you don’t take too long. Once the storm dies down, we’ll only have half an hour to attack! Afterwards, we have to hurry back and support the main force. They should have already started their assault against Carefree Island by then. With several thousand of Carefree Island’s disciples here, the harvests will be enormous.”\\n\\n The main team White Mirrorjade brought with him was too large. There was no way to hide even if he tried.\\n\\n As the two late Divine Sea martial artists were talking, the sandstorm gradually diminished. The endless amounts of red sand fell down from the sky, forming a terrifying deluge of sand, enough that it blocked out the heavens themselves. If a mortal were here, they would have been buried alive.\\n\\n “Pay attention! The sandstorm is about to end!”\\n\\n “Haha, it’s finally time! Everyone, listen up, prepare the array formation and ready yourselves to attack. We’re going to give it everything we’ve got!”\\n\\n The eyes of the Occult Bone Clan martial artists began to shine. They sensed that there was a great deal of women in this small group of martial artists. The process in which they had sex with women was not called dual cultivation nor was it to steal their energy, but rather to ‘perceive’.\\n\\n With extremely talented and beautiful women to help them ‘perceive’ the Laws of Life, they could further understand the mysteries of the essence of life.\\n\\n The sand in the sky slowly dispersed, and the wind speed already dropped a great deal. They could make out the giant mining pit just 10 miles away!\\n\\n In the sandstorm, 10 miles was a great enough distance that the disciples of Carefree Island wouldn’t be able to sense them. But once the sandstorm stopped, to a martial artist, 10 miles simply wasn’t anything to them at all. Their attacks could cross 10 miles in just the blink of an eye!\\n\\n “Attack!”\\n\\n The captains of the Occult Bone Clan and Splintersoul Mountain shouted out together. In unison, nearly 40 martial artists emerged from the red sands, and the light from all sorts of attacks shot out together!\\n\\n After gathering their attacks with an array formation, their combined striking power doubled. This was an attack they were preparing for some time already!\\n\\n The first strike had to be the strongest. The greater their opponents were damaged, the easier it would be for them to win. They put forth everything they had, even overdrawing on their strength to attack.\\n\\n Bang bang bang!\\n\\n In that instant, the earth shook and the mountain trembled. All of the attacks crashed into the mining pit where they exploded together. In that confined space, the force of the detonation was even greater. Even though the purple mountain was hard to an unimaginable degree, it still began to collapse under the attacks of so many masters!\\n\\n “This - !!”\\n\\n Ye Rosewater and the other direct disciples’ eyes shot open. The surprise attack of the Occult Bone Clan and Splintersoul Mountain gave them a fright.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1093","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
