{"id":55059,"no":1114,"title":"Chapter 1110 The World’s Most Aggrieving Matter","content":"Chapter 1110 – The World’s Most Aggrieving Matter\\n\\n …\\n\\n …\\n\\n …\\n\\n Seeing White Mirrorjade looking like a piece of rotten meat in front of Lin Ming, all of the Elders present were stunned, their eyebrows jumping up. They could already approximate just what had happened. Lin Ming and Ye Rosewater were ambushed by Splintersoul Mountain and the Occult Bone Clan in a secret mining pit. Then, Lin Ming suspected that someone had betrayed them, and they obtained information on who had done it from an enemy combatant they captured. The enemy then revealed that it was White Mirrorjade.\\n\\n Obviously, Lin Ming didn’t manage to obtain any tangible evidence from this enemy. Only after searching White Mirrorjade’s soul would the full truth be known. Of course, this sort of tyrannical and cruel move like the soul searching technique could destroy a person’s spiritual sea; it was impossible to use twice, thus Lin Ming hadn’t searched White Mirrorjade’s soul.\\n\\n Without searching White Mirrorjade’s soul, Lin Ming wouldn’t have absolute assurance that he was the traitor.\\n\\n In this situation, he had still beaten up White Mirrorjade to this state, and then brought him to Carefree Palace on the brink of death, asking others to search his soul here.\\n\\n This method caused the Elders present to feel a bit unwell. White Mirrorjade was still a disciple of Carefree Island after all, yet he had been killed without any real evidence by Lin Ming.\\n\\n “This brat is too sadistic!”\\n\\n “Truly vicious! With his talent and his character, it will be unbelievable once he has grown. He will be a demon even amongst those demonic realm cultivators!”\\n\\n Forgetting Lin Ming’s ruthlessness, just his strength alone was enough for all the Elders to feel some fear. White Mirrorjade was a genius that could escape an encirclement of several late Divine Sea martial artists together, yet he was still captured alive and in this state by Lin Ming! This clear difference in strength was seen by everyone here!\\n\\n “Lin Ming, you relied on just the words of a few Occult Bone Clan disciples to kill White Mirrorjade!? If I was Elder White, I would also be angry!”\\n\\n “Indeed. This boy came to my Carefree Island for the Ten Severing Dao Fruit Tree to begin with. He needs help from us and yet he dares be so arrogant.”\\n\\n All of the Elders used true essence sound transmissions to discuss this. Lin Ming had come to their Carefree Island to take away the Ten Severing Dao Fruit Tree, but now he had even killed White Mirrorjade. This caused all of the Elders present to have a poor opinion of Lin Ming.\\n\\n “Lin Ming, so that’s what happened! You did not have true evidence and yet you attacked Mirrorjade! Just who gave you this authority!? Where is the Disciplinary Elder!” White Brook angrily shouted, and a tall dark-faced man stood up from another mountain peak.\\n\\n “Elder White, subordinate is here.” This person’s voice didn’t seem to have any emotion to it at all. He had an impartial and stoic look; he was Carefree Island’s Disciplinary Elder.\\n\\n “Lin Ming killed a direct disciple without permission in a situation where he didn’t have any tangible evidence at all. According to the laws of Carefree Island, what is the punishment for such a crime?”\\n\\n “Reporting to Elder White, according to Carefree Island’s sect punishment laws, killing a direct disciple is worthy of the death penalty. Or, the guilty party’s martial arts will be completely wasted and they will be reduced to a mortal!”\\n\\n “Hahahaha! Good! Well said!” White Brook laughed, his voice ringing throughout the entire mystic realm space.\\n\\n He maliciously looked at Lin Ming. “Did you hear that? I can search White Mirrorjade’s soul, but first I must follow the sect’s punishment laws and waste all of your martial arts! You sure feel relieved that I will allow you to keep one final breath of life, so that you can die after learning the results of the soul search! Xiao Skywhite, did you hear the words of the Disciplinary Elder? You said that in front of the sect laws, everyone is equal! You are the Island Master, so how could you possibly look down on the laws of your own sect? Do you even know what you are doing? You are protecting an outsider who killed an outstanding genius of your own sect! It’s incredible that someone like you is the Island Master!”\\n\\n Just what sort of strongman figure was White Brook that he could be led around by the nose by a junior like Lin Ming? Even if he was willing to use the soul search technique to verify the innocence of his own family, he still wouldn’t obediently accept Lin Ming’s arrangements. Otherwise, just what sort of face would he have left?\\n\\n And facing Xiao Skywhite, who was protecting Lin Ming, White Brook laid down the gauntlet. Indeed, Xiao Skywhite frowned. In this case, there was a great deal of pressure on him for still protecting Lin Ming.\\n\\n At this time, Great Elder Xiao Haogan stood up. He fakely smiled and said, “Island Master, what Elder White says is reasonable and true. Even if you will conduct a soul search, you must deal with Lin Ming first! But Island Master Xiao, it seems as if you are purposefully favoring Lin Ming. You are the Island Master and yet you disregard your own disciples to help an outsider, not even hesitating to use Carefree Palace’s array formations to confront Elder White. Just what sort of reasoning is this?”\\n\\n Xiao Haogan was from the Xiao Family. However, the reason that he became the Great Elder was that he had been defeated in the struggle to become the Island Master by Xiao Skywhite, thus the reason for him being biased towards his own master, White Brook. The relations between him and Xiao Skywhite had never been smooth.\\n\\n In Carefree Island, the status of a Great Elder was second only to the Highest Elders’ and the Island Master. Thus, this was why Xiao Haogan waited for a suitable time to speak. Not just that, but there were also several Elders present that weren’t too pleased by Lin Ming’s methods. They began to stand up and say, “Great Elder is right!”\\n\\n “We should handle everything according to the rules first. Otherwise, what if someone tried to copy Lin Ming in the future and kill any disciple they suspected, then asking to search their soul later? Everything would fall into chaos!”\\n\\n Xiao Skywhite took a deep breath, feeling as if he had hopped onto the tiger and could no longer back down. And at this time, Lin Ming began to speak from underneath the energy barrier Xiao Skywhite had created. “You want to waste all of my martial arts? How interesting. You say that I’m not a disciple of your Carefree Island and yet you still want to deal with me according to your sect rules?\\n\\n “Could it be that if your White Family wants to kill me, I should stretch out my neck and let you do so, but if I kill White Mirrorjade instead, you want me to be handled by your sect rules and also waste all of my martial arts? What a strong sense of righteousness you have!”\\n\\n White Brook laughed as he listened to Lin Ming’s response, “Why do I use the rules of my Carefree Island to handle you? Do you still need to ask this? It is because I am stronger than you, it is because my cultivation is higher than yours! In my eyes, what can you even be considered as? If I kill you, that is no different from butchering a chicken or slaughtering a dog. With just a single thought I can kill you, and who here can stop me? Do you think you can resist even if you don’t stretch out your neck? Whether it is Mirrorjade’s life or the reputation of my White Family, both are thousands and tens of thousands of times more precious than your life! Now that you’ve killed Mirrorjade, I don’t care what reason it is but you will be buried along with him! You want to speak of reasoning to me? That is simply ridiculous! How much do you think you are worth? Do you really think you have the capital to discuss anything with me!?”\\n\\n As White Brook spoke to here, he began to step towards Lin Ming. Ye Rosewater and Xiao Raingem were both frightened. As for Xiao Skywhite, he deeply frowned. At this time, the situation had already spiraled out of his control.\\n\\n “Senior Mo! Senior Mo!” Xiao Skywhite called out in his heart.\\n\\n Then, a sigh resounded in the void, followed by a faint fluctuation in the mystic realm space.\\n\\n “Who is it!?”\\n\\n White Brook was suddenly shocked. He immediately turned, his eyes widened to their limit. He watched on blankly as the space in front of him distorted and a white-clothed woman emerged from nowhere. She sat on the void, her body floating in the midst of countless silks. Her entire being exuded an elegant and compelling aura. Her face was covered with a dim light, making it so that no one could fully make out her appearance.\\n\\n She didn’t come from outside but had rather been here the entire time. She had hidden in space, observing this Council of Elders. But, no one had been able to discover her at all!\\n\\n “This… this is…”\\n\\n White Brook drew a step backwards. He could feel a terrifying pressure from this woman. Her strength was unfathomable. She was absolutely a Holy Lord level character, and she was also more powerful than any Holy Lord White Brook had ever seen before. As for just how formidable she was, White Brook had no way of knowing. As for White Brook himself, even though he was Carefree Island’s strongest powerhouse, he could only barely be considered a Holy Lord level powerhouse, and even then he was the weakest amongst them all!\\n\\n It wasn’t just White Brook, but all of the Elders present were dumbfounded. This mysterious woman was actually hiding in Carefree Palace just a short distance away from them, and yet none of them knew! From this alone, one could imagine just how great her strength was!\\n\\n “You… who are you?”\\n\\n Without knowing why, White Brook was able to feel a familiar breath from this woman in front of him. However he couldn’t identify just where he had encountered her before.\\n\\n This white-clothed woman was Mo Riverbliss. She stood up from her wreath of silks, her appearance still covered in a dim light, not allowing anyone to see her. She naturally couldn’t expose her own appearance before these people. After all, she had to be careful of her Verdant Feather Holy Lands’ greatest blood enemy, Tian Mingzi.\\n\\n “I originally didn’t want to appear in front of you all. But because some matters still aren’t concluded yet and there are actually some here that think themselves so righteous and infallible, I had to suddenly appear because of such a minor matter… well, before anything else, search his soul first.”\\n\\n Mo Riverbliss calmly instructed. Out of all the high level Carefree Island figures present, only Xiao Skywhite knew of her. Even so, her commands were impossible to violate.\\n\\n White Brook’s eyelids jumped up. Facing this woman’s terrifying pressure, he clenched his fists and said, “Minor matter? Search his soul? Humph! You think that just because you say to search his soul we will search his soul? Just who are you? This is my Carefree Island’s territory and yet you barge in here. What gives you the right to order us around?” If it weren’t for Mo Riverbliss’ horrifying aura, White Brook would have already attacked her.\\n\\n Mo Riverbliss turned her head and stared at White Brook, her vision sharp and dangerous. She unhurriedly said, “Why can I give you orders? Do you still need to ask this? It is because I am stronger than you, it is because my cultivation is higher than yours! In my eyes, what can you even be considered as? If I kill you, that is no different from butchering a chicken or slaughtering a dog. With just a single thought I can kill you, and who here can stop me? Do you think you can resist even if you don’t want to follow my command?”\\n\\n Mo Riverbliss’ aura suddenly rose. The words that White Brook said to Lin Ming just now were completely tossed back into his face, causing his complexion to twist.\\n\\n “You… you…!”\\n\\n White Brook trembled with rage. One of the most aggrieving matters in this world was to have one’s own words used in reverse and also have no way of refuting them.\\n\\n Just now he had ruthlessly mocked Lin Ming, but now the roles had switched and he was the one being mocked instead. The words that he had been so proud of now caused his entire face to be swollen with shame! In particular, he was being mocked under the eyes of many of Carefree Island’s juniors and Elders!\\n\\n White Brook bit his lips and clenched his fists, his nails digging into the flesh of his palms. He was thinking of attack Mo Riverbliss right now. However, estimating it, he knew that his chances of victory were impossibly slim!\\n\\n “Now search his soul. As for you… White Brook, whether you want to be the one to do so is up to you.”\\n\\n Mo Riverbliss coldly said. Under the suppression of absolute strength, no one dared to refute her.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1110","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
