{"id":55077,"no":1132,"title":"Chapter 1128 Spirit Artifact Spear","content":"Chapter 1128 – Spirit Artifact Spear\n …\n …\n …\n The Phoenix Blood Spear seemed to develop a mind of its own. It cried, rapidly oscillating as if it wanted to fly out. This was beyond what a normal top grade saint artifact could achieve!\n Although a peak saint artifact had wisdom, that was only spiritual wisdom; it didn’t possess true self-awareness, otherwise that would be a spirit artifact.\n The core of a spirit artifact was the ‘spirit’. It had a spiritual will of its own. It could move, it could fly away to escape, it could automatically attack the enemy, and for a spirit artifact that reached a high boundary, it could even draw array formations on its own and utilize the Heavenly Dao Laws.\n A saint artifact did not possess such abilities. Even moving on its own was impossible. The only chance for that to happen was if its master had died and sealed a part of their fading will and soul into the saint artifact to control it. For instance, the Argent White Sword found in the 8000 Mile Black Swamp was such an example.\n Now, the Phoenix Blood Spear in Mo Riverbliss’s hand was clearly not the same situation as the Argent White Sword, otherwise that would mean Lin Ming had died.\n “An intelligent saint artifact… is this a spirit artifact!? No, it’s still a tiny step away from reaching such a boundary. It hasn’t formed a complete artifact spirit; this could only be considered an elementary artifact spirit! But, becoming a true and complete spirit artifact is only a matter of when! Heavens! How could this be!?”\n Mo Riverbliss was shaken. In that moment, the Phoenix Blood Spear had actually formed the source elementary artifact spirit and evolved into a spirit artifact!\n In order to forge a saint artifact into a spirit artifact, one had to first have it achieve the material quality of a spirit artifact. And, if it lacked an artifact spirit, it could only be called a transcendent saint artifact.\n A transcendent saint artifact was relatively easy to forge. As long as one used up enough valuable materials and there was a grandmaster refiner using high level techniques, they could always produce one. But, an artifact spirit was extremely hard to create, especially a source artifact spirit!\n The so-called source artifact spirit was an artifact spirit bred from within the artifact itself; it was also called a true artifact spirit. The birth of a true artifact spirit required infinite effort, sacrifice, and even more resources. One needed hundreds of thousands of years or even millions of years to form one. A master had to unite their will with their weapon, fusing in their own true essence and bloodline, and also experience numerous lucky chances before forming one!\n A true artifact spirit was far too difficult to create. Thus, many grandmaster refiners would choose another path and create a false artifact spirit. They would take the soul of a powerful vicious beast, demonic spirit, ghost, or even the soul of a martial artist, and then forcibly refine that soul into an artifact spirit and seal it into the artifact. This sort of artifact spirit was not completely compatible with a spirit artifact, thus it wouldn’t allow the spirit artifact to display its full might. Moreover, such an artifact spirit would contain resentment in its heart, and it wouldn’t put forth its full effort. If one didn’t sign some sort of contract with it, then there was even the possibility that this artifact spirit would rebel at a critical moment.\n A true artifact spirit and a false artifact spirit were of completely different qualities.\n Thus, this was why Mo Riverbliss was so shocked as she saw the Phoenix Blood Spear evolve!\n Not only was an elementary artifact spirit born, but even the material quality of the Phoenix Blood Spear itself had leapt up to the degree of a spirit artifact!\n This was all created by the heavenly tribulation!\n Mo Riverbliss suddenly realized what had happened. The Phoenix Blood Spear had experienced the nine heavenly tribulations together. Whether it was the five elements tribulation, the wind and thunder tribulation, or even the current yin yang tribulation, Lin Ming had used the Phoenix Blood Spear to resist them all. As the nine heavenly tribulations fell, the quality of the Phoenix Blood Spear was incomparable to that of the past!\n Especially this final tribulation. This could be called a calamity upon the Phoenix Blood Spear, but it was also a baptism. It had hastened the birth of an artifact spirit!\n And in that final moment, Lin Ming’s will had condensed, bringing with it an infinitely heated spirit and daring valor that seemed capable of resisting the Heavenly Dao. The Phoenix Blood Spear had also withstood being flooded by Lin Ming’s will, and then, at the end when Lin Ming had given up the Phoenix Blood Spear to protect it, this had thoroughly awakened the elementary artifact spirit that had been formed within the heavenly tribulation!\n This could be called a spirit artifact that was completely formed by Lin Ming. It was not forged by a grandmaster refiner, but had been created by Lin Ming. From the time when it was a saint artifact it had been nourished by Lin Ming’s true essence and will, and at the end it had even experienced the nine levels of heavenly tribulation with him and had been doused in his flesh and blood. The Phoenix Blood Spear could now be considered his life’s weapon!\n Such a weapon could display combat strength that other weapons could not compare with. And more importantly, the Phoenix Blood Spear was psychically linked with Lin Ming, becoming one with him, thus there would never be a situation in which he couldn’t use it.\n And how could a normal Divine Sea realm genius use a spirit artifact? A top grade saint artifact or transcendent saint artifact was their limit!\n Although every spirit artifact that formed its own source artifact spirit had experienced its own lucky chances, each one could only be produced through a stroke of fate. And something like the Phoenix Blood Spear was supremely unique, even rarer than a once in a billion situation! This sort of lucky chance could not be duplicated!\n If Lin Ming could withstand this heavenly tribulation, then just the enhancement of the Phoenix Blood Spear would allow his strength to dramatically rise to another level. But, the question was, could he survive the final tribulation?\n Mo Riverbliss prayed deep within her heart. So many lucky chances, so many great results, if he survived then he would inevitably become one of the Divine Realm’s peak characters! If he failed, then all would turn to nothing!\n Mo Riverbliss felt her heart racing. Lin Ming’s Ninefall had brought with it an unfathomably great momentum. This sort of scene would be a truly unforgettable experience!\n At this time, all of Lin Ming’s flesh had broken, his organs were completely smashed apart, and his meridians and blood vessels were torn. Shining white bone revealed itself from his body. These bones dazzled with layers upon layers of dao patterns. These were the Heavenly Dao Laws that Lin Ming had absorbed and imprinted into his very body. Just his bones alone were precious heavenly treasures!\n In addition, the energy from the yin yang primal chaos diagrams had broken into Lin Ming’s body, savagely destroying his meridians. Lin Ming was already unable to revolve his energy to help, and this added an even greater injury atop all his other injuries. He was no longer able to suppress the massive amount of thunder and fire heavenly tribulation within the Heretical God Sprout!\n There was no other Life Destruction martial artist that could look like Lin Ming and still be alive. Nearly all that was left of him was his bones and brain! He was completely supporting himself with his tenacious life vitality and willpower!\n “This is too miserable, so miserable that it’s hard to look at. Lin Ming is barely supporting himself with his will.”\n “This is his unyielding will. But even so, his life will be severed soon…”\n “The heavens never seal off all roads, but… what can Lin Ming do in this state…”\n Several Elders of Carefree Island felt that Lin Ming was too pitiful. But Xiao Haogan and White Brook were actually enjoying the show. When Lin Ming was full of spirit and strength they had both been restrained, but now they saw that Lin Ming’s current condition was extremely poor, they began to mock and make casual talk at his misfortune.\n “This brat’s bones are quite hard, hah. They haven’t even been crushed by the heavenly tribulation, they should be valuable treasures!” Xiao Haogan said, noticing Lin Ming’s bones.\n “Indeed. Look at those brilliant runes on his bones and those countless traces of dao patterns. Those bones are absolutely a treasure. Once he dies, we’ll take his bones and perceive the dao patterns from them, and then we can refine them into transcendent saint artifacts. That should be enough to make up for the loss of the Ten Severing Dao Fruit Tree.” White Brook stroked his beard, speaking in a smug tone.\n “Haha, Honorable Master’s ideas are truly great!” Xiao Haogan and White Brook’s eyes shined as they greedily stared at Lin Ming’s exposed bones.\n At this time, Lin Ming’s fires of life were growing increasingly weak and nearly all of his blood had been drained out. His organs had stopped moving and even his dantian felt as if it would break soon. The power of thunder and fire heavenly tribulation suppressed within the Heretical God Sprout was ready to erupt at any moment. Once it exploded, his body would completely burst apart and become a pile of scattered bones and flesh. Then, even his remains would be crushed into nothing by the primal chaos dao diagrams.\n At that time, Lin Ming would be deader than dead!\n Even so, he was unwilling to accept this fate! He would not give up!\n At the precipice of death, Lin Ming felt as if time slowed to a crawl. Everything fell into his senses as he reached a state of incomparable clarity!\n His heart was extremely tranquil! He still searched for a hope of survival. He knew that the heavens never sealed off all exits; there was only a faint chance to survive!\n The Heavenly Dao was cruel and merciless. In front of the Heavenly Dao, whether it was common mortals, supreme elders, or even ants, everything was equal in its eyes.\n In this world, there were very few existences that were able to defy the Heavenly Dao. There was only one exception, and that was those existences that were capable of surviving through heavenly tribulation!\n For instance, a transcendent divine pill that was capable of defying the heavens and changing one’s life, rewriting one’s destiny, and resurrecting the dead!\n For instance, a transcendent divine might that could control or even dominate the Heavenly Dao!\n And also for instance, a peerless talent like Lin Ming, someone who had done all sorts of things that defied the will of the heavens, thus summoning heavenly tribulation. These sorts of geniuses were Great World Kings and even Empyreans!\n Lin Ming did not have a transcendent divine pill that allowed him to defy the heavens and change his fate, nor did he have an unrivalled powerhouse capable of helping him cross heavenly tribulation.\n He just had two transcendent divine mights, and was only able to use these two transcendent divine mights to resist the heavenly tribulation. But, he had already used the Prime Emperor Lotus Flower and the Heretical God Force. Now, the true essence within his body was in utter chaos and energy was running rampant within him. His body was ready to blow up at any moment, so it was simply impossible for him to use a transcendent divine might.\n Then, what could he rely on? What had crossed heavenly tribulation without dying that he could use as his final card?\n All sorts of thoughts blazed through Lin Ming’s mind. Finally, he remembered something…\n Dragon bone relics!\n Mo Riverbliss had spent a portion of her cultivation, changing the flow of time to help Lin Ming refine that 1000 foot supreme dragon bone into 108 dragon bone relics. Lin Ming had swallowed a third of them to open the Gate of View, but he still had 72 left.\n A True Dragon was a God Beast, and even ordinary dragons were considered part of the monster race. A powerful grown dragon was even mightier than a Great World King! In order for the monster race to transform, they had to undergo heavenly tribulation. And, a dragon was so powerful that they had no choice but to experience heavenly tribulation. As they grew up, they would have to experience multiple heavenly tribulations!\n The God Beasts among the dragon race were even capable of resisting the Heavenly Dao Laws!\n Yes, that was it! The dragon bone relics were refined from the supreme dragon bone and they existed outside of the Heavenly Dao. They were objects capable of changing the Heavenly Dao to a certain extent!\n Lin Ming’s mind shook as he recalled all of this. This was his final ray of hope!\n Mo Eversnow had already said Lin Ming could only swallow 36 dragon bone relics before he reached the Divine Sea; his body wouldn’t be able to withstand more. But then, Mo Eversnow didn’t imagine that Lin Ming’s Ninefall could reach such a degree. And beyond even that, if he didn’t swallow the dragon bone relics he would die, but if he did swallow them he would have a faint chance of surviving, so how could he not try?\n “Dragon bone relics!”\n Lin Ming’s hands had been completely torn apart and his meridians were surging with a tyrannical and uncontrollable energy. The bones of his arms were entirely exposed; it was impossible for him to take out the dragon bone relics with them. But luckily, Lin Ming still had his battle spirit. His large success gold battle spirit was nearly undamaged.\n If a battle spirit was poured into a leaf, that leaf could be used to kill others. If it could change the position of objects, it could naturally take things out of a spatial ring. Lin Ming had never used a battle spirit to take objects out of his spatial ring so he wasn’t skilled at this task. Moreover, he was also in a hurry at this time. Thus, he took out all the round bead-shaped objects that resembled a dragon bone relic.\n 72 dragon bone relics. Mm… 73… there was one more? This was…\n Lin Ming looked at that last black bead that resembled a dragon bone relic, immediately stunned.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1128","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
