{"id":55249,"no":1304,"title":"Chapter 1300 Heaven Swallowing Demon Art","content":"Chapter 1300 – Heaven Swallowing Demon Art\\n\\n …\\n\\n …\\n\\n …\\n\\n Dragon Fang put away his sword. He deeply looked at Lin Ming, saying, “I have convincingly lost this battle, but next time I shall be the victor!”\\n\\n Lin Ming replied, “I’ve heard those words far too many times before, but up until now, no one has ever managed to fulfill them.”\\n\\n As Lin Ming spoke, the entire audience was secretly dumbfounded.\\n\\n These words were a bit too arrogant…\\n\\n “Dragon Fang is crazy, but Lin Ming is even crazier!”\\n\\n “You’re wrong. It isn’t that they are arrogant, but only a truthful reflection of their history. When we listen to it, it seems exaggerated thus we think they are arrogant, but in truth the two of them have similar personalities. They are both characters that will patiently wait, but when they attack, what they do will often be fatal!”\\n\\n Dragon Fang didn’t answer again. He only turned around and left the stage.\\n\\n Lin Ming looked at his back as he departed. He was well aware that Dragon Fang’s potential far surpassed that of any genius he had ever defeated before.\\n\\n Dragon Fang had just opened the Three Lives Pupils and his strength was just at the beginning of the period where it would rapidly rise. He hadn’t had time to fully realize his potential yet. In the future, he would inevitably become an extreme character of the Divine Realm.\\n\\n Of course, even though Lin Ming believed that Dragon Fang would rapidly grow, he himself would also quickly grow. On the Divine Seal Altar’s 33 steps he had comprehended the Concept of the 33 Heavens. This was a Concept that no one else possessed.\\n\\n “Lin Ming, in this battle you nearly used everything at your disposal, but there are still several unfathomable geniuses waiting for you. If you fight them, victory won’t come easily.\\n\\n Mo Eversnow’s voice resounded in Lin Ming’s mind.\\n\\n Originally, Mo Eversnow didn’t believe that Lin Ming would be able to rise into the top three rankings, but afterwards Lin Ming’s strength had far surpassed her calculations. Even so, at the same time, the strength of Lin Ming’s opponents also exceeded her anticipation.\\n\\n Now, facing the one or two peak characters of the Divine Seal 10 Children, Lin Ming still didn’t have confidence he could win.\\n\\n “Dragon Fang is strong. If I didn’t use Heavenly Dao Judgment then I wouldn’t have been able to defeat him.”\\n\\n Ever since Lin Ming joined the First Martial Meeting, this was the first time he had used Heavenly Dao Judgment under the public gaze. It was simply impossible for him to continue holding back.\\n\\n “I wonder just who my next opponent will be… I shouldn’t face Xiao Moxian, Hang Chi, or Frost Dream yet, but Jun Bluemoon might be a possibility.”\\n\\n Of the Divine Seal 10 Children, after deducting Shiku and Hua Xuan, it was impossible to tell who was stronger or weaker amongst the several top characters. They would only be able to find out after fighting.\\n\\n If he really had to fight Jun Bluemoon then Lin Ming would need to give it his everything. Jun Bluemoon’s 64 eight-trigrams sword where he fused together all of that strength was far too terrifying.\\n\\n “The second match of the second round – Xiao Moxian against Lord Monster!”\\n\\n The name that the Monster Prince signed up with was Lord Monster, thus Vast Cosmos deferred to the registered name to announce the match. The original intent behind Lord Monster was to imply a lord of all monsters, in other words a Monster Empyrean.\\n\\n Luckily, the Monster Prince had the vigorous bloodline of his race. Even after being brutally beaten up by Lin Ming, he only needed several hours and some valuable medicines to restore himself to peak condition where he was bursting with energy.\\n\\n His figure flashed as he seemed to teleport on stage. And in front of him, countless black feathers emerged from thin air. A halo of dim light shimmered and Xiao Moxian appeared in the arena like a dark fairy. This beautiful entrance scene left the audience mesmerized and crying out in acclaim.\\n\\n Xiao Moxian was the dream lover of far too many heroic young elites.\\n\\n Frost Dream and Xiao Moxian were the two unquestionable goddesses of the Divine Realm. Frost Dream was mysterious and holy while Xiao Moxian was cute and lovable. There were countless young elites that yearned for them from the bottom of their hearts. Moreover, Xiao Moxian possessed the Dark Phoenix bloodline – the true bloodline of a Dark Phoenix! If one could obtain her primordial yin then the benefits would be unimaginable.\\n\\n Not only could someone greatly improve their physique but their talent would rise to new levels. Moreover, they could directly engrave runes of the Darkfire Laws into their body. In the future, even if they were eating or sleeping, their strength would still be rising!\\n\\n Who would not desire such benefits?\\n\\n Not just that, but Xiao Moxian herself was as beautiful as an immortal fairy and her grandfather was Empyrean Demondawn. If one could marry Xiao Moxian then they could ascend to heaven in a single step!\\n\\n The Monster Prince laughed, “Xiao Moxian, heh, you are truly a beauty! Let me tell you something. The reason that someone like me would join such a boring First Martial Meeting is all in order to see you. I have admired you for a long time!”\\n\\n As the Monster Prince spoke, the many young elites in the audience suddenly widened their eyes.\\n\\n The Monster Prince’s face was really thicker than the walls of a city. If he had won all of his matches and then called this First Martial Meeting boring then no one would have said anything. But, he had been beaten up so badly by Lin Ming that not even his mother would recognize him and yet he still dared to say that the First Martial Meeting was boring?\\n\\n This was simply the same as him stretching his face out and saying ‘I am cheap, slap me, slap me!’\\n\\n “This idiot, I have never heard anyone so stupid before in my life!”\\n\\n “To be honest, if I were him, I would find myself hard-pressed to do anything after being beaten up so miserably by Lin Ming. Even standing on stage right now is a type of courage. I have to say I admire how thick his skin is!”\\n\\n “Don’t try to use your own logic upon those from the monster race or you’ll go crazy. For them, the strong win and the weak lose; all they care about is the law of the jungle. Anything they do is based on their own whims. To them, the concept of face doesn’t exist at all.”\\n\\n The audience noisily discussed. No matter how arrogant one was or how thick their face was, they would still lose in this regard to the Monster Prince.\\n\\n Xiao Moxian tapped her chin as she looked at the Monster Prince with interest in her eyes. Her expression was just like a little imp looking at their favorite toy.\\n\\n “Are you saying that I should be honored?”\\n\\n “Haha, far from that. I am only hoping that you can understand the depth of my feelings towards you within my heart. You are also considered a part of our monster race. If you continue mixing with these riffraff humans all the time then that will dilute your bloodline and cause your future descendants to become increasingly weak. Rather, wouldn’t it be better to return to the monster race with me? In the future, once I become the Monster Emperor, you will be the Empress.”\\n\\n “Fuck off!”\\n\\n In the audience, someone had already stormed away in a rage.\\n\\n “I can’t stand this! Gods, please save me!”\\n\\n “Someone hurry up and sweep this idiot away!”\\n\\n The Monster Prince had actually dared to proposition Xiao Moxian and wanted to marry her and bring her back to the monster race. In front of everyone, he was actually trying to dig in their corner. This fellow was simply out of his mind! And, most importantly, he actually dared to say such things after being beaten up so miserably by Lin Ming. All the young elites present felt as if they were going to collapse from second-hand embarrassment.\\n\\n As Xiao Moxian heard that the Monster Prince wanted to marry her, she wasn’t angry at all. Instead, she teasingly smiled and said, “Okay. But… my future husband has to be able to defeat me. Moreover, he has to be the top genius of the Divine Realm! If you defeat me then I will marry you! However… if you lose to me, will you be my slave for life?”\\n\\n This Xiao Moxian was not easy to deal with. To lose was to be her slave – who would agree to that?\\n\\n Even if the Monster Prince was beyond arrogant, he still wasn’t dumb enough to agree to something like that. His voice turned gloomy as he said, “My royal bloodline has yet to awaken. But once it does, my cultivation will rise 10,000 miles every day. My current achievements do not represent my future limits. One day, I will become the strongest Monster Emperor that our monster race has ever seen!”\\n\\n “Hehehe, then I’ll wait for you… but now, how about you withstand three of my strikes before you continue speaking.”\\n\\n As Xiao Moxian spoke she suddenly attacked.\\n\\n With a resonant phoenix cry, a massive Dark Phoenix phantom appeared behind Xiao Moxian. Black feathers, black flames, soaring into the sky!\\n\\n At that moment, a vast and hallowed aura covered the entire martial field!\\n\\n “What an amazing phoenix race aura. Even my bloodline is resonating with it!”\\n\\n Lin Ming was surprised. He could feel a burning heat on his forehead. The Ancient Phoenix mark on his forehead began to shimmer, beating in tandem with that sublime aura. Both of their bloodlines came from a similar origin, but in terms of bloodline density, Lin Ming was far from being able to compare with Xiao Moxian. This caused the bloodline within his body to be suppressed by Xiao Moxian.\\n\\n And this was occurring to Lin Ming even though he had absorbed a massive amount of Ancient Phoenix blood essence. The other powerhouses of the Ancient Phoenix Clan were likely feeling an even greater suppression.\\n\\n Facing Xiao Moxian in such a state, the Monster Prince didn’t dare to hold back. In truth, he was well aware that he wasn’t Xiao Moxian’s match.\\n\\n The desolate halberd in his hand thrust out. The power of space revolved.\\n\\n “Rule the World!”\\n\\n Kacha!\\n\\n The power of space came shrouding down. The Monster Prince wanted to use the power of space to bind that Dark Phoenix, but the difference in strength was far too great. The Dark Phoenix spread its wings, ripping apart all of the surrounding power of space!\\n\\n “Halberd Shattering the Universe!”\\n\\n The Monster Prince thrust out his halberd once more. Xiao Moxian chuckled as she took out a thin black whip from her spatial ring. This whip was 30 feet long and was completely pitch black all over, without a single hint of luster, as if all light was absorbed by it.\\n\\n “Dragon Tendon Whip!”\\n\\n In the honored seating area, an old man couldn’t help but cry out in alarm.\\n\\n Many weapons were crowned with the title of dragon, for instance, Dragon Tendon Whip and Dragon Hair Whip. But, those were only exaggerated examples to highlight the strength of the whip; they weren’t truly related to a dragon.\\n\\n But Xiao Moxian’s whip was an exception: it was truly crafted and refined from a dragon tendon! It was naturally indestructible, and after being struck by this whip, not only could it easily break through one’s true essence but the force would pass through one’s bones, even injuring their soul. This was a truly terrifying weapon.\\n\\n Ping!\\n\\n The Dragon Tendon Whip struck the Monster Prince’s desolate halberd. The whip bypassed the halberd shaft and slashed towards the Monster Prince.\\n\\n The Monster Prince was shocked. His entire body erupted with energy as he hastily withdrew.\\n\\n However, this whip was like a viper. It chased straight after him at an unimaginable speed, instantly reaching the front of the Monster Prince!\\n\\n “Hah!”\\n\\n The Monster Prince shouted out loud. He wanted to use his halberd to defend himself but it was too late.\\n\\n Xiao Moxian’s figure flashed. She pumped her thin arms and the long whip in her hand instantly tore through the Monster Prince’s protective true essence and struck his body!\\n\\n Puff!\\n\\n The whip tail slashed across the Monster Prince’s shoulder, causing blood to rain down!\\n\\n To the monster race, this level of injury wasn’t anything at all. However, Xiao Moxian devilishly smiled. She reversed her true essence and the whip wrapped around the Monster Prince as if it had a mind of its own.\\n\\n “Heaven Swallowing Demon Art!”\\n\\n In that moment, for hundreds of miles around, all of the surrounding heaven and earth origin energy gathered towards Xiao Moxian. From the Monster Prince’s body, his true essence, blood vitality, and even the Law fragments embedded within him were sucked towards Xiao Moxian by the Heaven Swallowing Demon Art, rolling towards her like a storm!\\n\\n As these energies gathered within Xiao Moxian’s body, the Monster Prince was suddenly horrified!\\n\\n “What!??!”\\n\\n He felt his strength rapidly fading away. This was not a temporary fading, but a permanent loss!\\n\\n Xiao Moxian was sucking up all his true essence and world power!\\n\\n This Heaven Swallowing Demon Art was the transcendent divine might created by Empyrean Demondawn. It could permanently absorb an opponent’s true essence for herself, and it could even reduce an opponent’s cultivation, all of this permanent!\\n\\n Everyone thought that Xiao Moxian was a cute and lovable young woman, but they forgot that she was also the granddaughter of Empyrean Demondawn. She was a true sorceress!\\n\\n The Monster Prince had dared to offend Xiao Moxian with his words, and now this was his fate!\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1300","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
