{"id":55270,"no":1325,"title":"Chapter 1320 The Final Pass","content":"Chapter 1320 – The Final Pass\n …\n …\n …\n For Frost Dream to possess such talent was simply unbelievable. The hundreds of millions of people present had no idea how Frost Dream was so powerful. If a normal extreme genius was born in Divine Dream Heavenly Palace and was personally guided by Empyrean Divine Dream, they still wouldn’t be able to grow to such a degree.\n Frost Dream was far too mysterious; no one knew just what secrets she was relying on to grow.\n Standing deep within the Immortal Melody Pure Lands, Frost Dream seemed as if she was in a completely different space and time. Even though she was standing there, it was like she was separated by the vast river of time, simply unable to be touched.\n When Hang Chi’s six phantoms broke into the Immortal Melody Pure Lands, water splashed into the skies. The phantoms from the three evil paths, the path of hell, the path of hungry ghosts, and the path of beasts, were all purified by these waters, their bodies instantly vanishing into nothing. As for the asura phantom that was neither good nor evil, it completely paused. Its once wild eyes lost all their light.\n The phantoms of the path of heaven and path of mortals still rushed towards Frost Dream. As for Frost Dream, she simply switched her tune and a completely different sound emerged, turning into a brutal Buddha-slaying song, filled with murderous intent that rushed forth, splitting apart the earth and heavens!\n A terrifying killing intent filled this music, as wild and crazy as a rabid wolf!\n Even though the spectating young elites were dozens of miles away, in the face of this murder-filled sound, all of them found it hard to withstand this pressure. It was like their bodies could collapse and their organs break apart at any moment.\n After the phantom from the path of mortals entered the Immortal Melody Pure Lands, it emitted a sound like shattering glass as it was forcefully shattered by that savage dirge!\n As for the phantom from the path of heaven, it was clearly much stronger. It forcefully resisted that tremendous killing intent and shot towards Frost Dream!\n Frost Dream’s expression was indifferent. As the phantom from the path of heaven rushed at Frost Dream, her hand swiped across the strings. Then, 18 strings shot out, and with a popping sound the phantom was pierced through 18 times! It emitted a painful growl before disintegrating with a loud explosion.\n Like this, the six phantoms were all killed off by Frost Dream!\n The entire process appeared easy and simple, as if there hadn’t been any difficulties at all. Moreover, when this was accompanied by the beautiful picturesque scene of the Immortal Melody Pure Lands, it was like Frost Dream wasn’t killing these phantoms, but purifying evil.\n As all of this was done, Frost Dream’s expression was calm. She still quietly played her zither as before. All of her energy was placed into playing her zither, as if nothing around her was able to influence her.\n She had played two-thirds of the Dreamsoul Immortal Melody. After the final third, the song would be completed!\n Frost Dream said that as long as the Dreamsoul Immortal Melody was completed, Hang Chi would absolutely be defeated. Many people in the audience wanted to know; just what would happen once the Dreamsoul Immortal Melody reached its end?\n “Does Hang Chi have some other method to stop the Dreamsoul Immortal Melody?”\n Many people looked at Hang Chi, waiting to see if he had another final last resort.\n “He shouldn’t. During Hang Chi’s battle with Lin Ming, he also used the Lotus Heart Bodhi. At that time, he could be described as going all-out against Lin Ming. Now, he even used the Six Paths of Samsara, a technique that is unique to the Lotus Heart Bodhi. I fear that even if Hang Chi uses another move, he still won’t be Frost Dream’s match.”\n “I want to know just what will happen when the Dreamsoul Immortal Melody is finished. Frost Dream said that once the Dreamsoul Immortal Melody was over, Hang Chi would definitely be defeated.”\n It had to be said that when the Dreamsoul Immortal Melody wasn’t filled with a Buddha-slaying killing intent, it was extremely pleasant to listen to, just like blissful sounds from heaven. Moreover, the Immortal Melody Pure Lands that were created were as beautiful as a poem. Just looking at it was intoxicating to the senses.\n Everyone wanted to experience the complete Immortal Melody Pure Lands. However, Hang Chi might not be able to persist until the Dreamsoul Immortal Melody ended.\n A thousand feet away, Hang Chi’s complexion was pale. In a situation where he used the Lotus Heart Bodhi along with Downfall of the Six Paths, that created a tremendous pressure on him.\n After watching with his own eyes as Frost Dream’s Dreamsoul Immortal Melody began percolating with its final crescendo of killing intent, Hang Chi smiled, “I admit defeat.”\n These words were not loud, but they spread through the entire audience.\n The audience, although they had long expected this result, were still somewhat disappointed as they listened to Hang Chi. To not be able to listen to the complete Dreamsoul Immortal Melody and see just what phenomenon would occur at the end was truly regrettable.\n “Frost Dream is too terrifying. Hang Chi actually couldn’t persist until Frost Dream finished the Dreamsoul Immortal Melody.”\n “Frost Dream’s strength has already far surpassed those of her generation by an unbelievable degree. I really have no idea how she managed to cultivate to this state. I hear she is only 35 years old.”\n 35 years. Compared to the hundred million years of life that an Empyrean lived, that was a timespan unworthy of mentioning. If it were converted to mortal terms, that wouldn’t even be a baby that was an hour old. Her future was limitless!\n In the contestant area, Jun Bluemoon quietly looked at Frost Dream, deep in thought. When he and Frost Dream fought, he had also been defeated!\n At this time, an old voice sounded out in Jun Bluemoon’s mind. “Bluemoon, Frost Dream is no mortal. I fear that within the younger generation, there is no one that possesses the ability to defeat her. You do not need to think about it too much. Work hard and surpass Lin Ming and Hang Chi; that is the orthodox path. Those two are people you should still be able to overtake. As for Xiao Moxian, she will be extremely difficult to overcome. She is someone who is loved by destiny and her talent has also reached an incredibly high degree!\n “Even that Dragon Fang isn’t someone you can underestimate. He may have lost to you this time, but that is because he has comprehended the Three Lives Pupils far too recently and is only able to open the state of All Existence to Void. Given enough time, even he may surpass you.”\n This old man apparently understood a great deal about every situation. He even knew about the Three Lives Pupils.\n “I understand, Old Sword.” Jun Bluemoon nodded. For him to refer to someone as Old Sword, it was clearly the artifact spirit in his divine sword.\n Like this, the Divine Realm First Martial Meeting had basically ended. There was only a single match left in the tournament – that was Frost Dream against Lin Ming.\n However, most of the audience didn’t care for this match. After all, to them this was nothing more than a passing match for formality’s sake, not to mention that Lin Ming might not even wake up.\n Of course, there were also many people hoping that this match could be fought for several moves. These people were Frost Dream’s diehard fans. They were willing to watch all of Frost Dream’s matches, even if it was a match against Lin Ming that held no suspense at all.\n After Frost Dream defeated Hang Chi, her fame had finally reached its peak!\n Her mysteriousness, her holiness, her beauty, as well as her formidable strength, all of that together caused the countless young elites to go berserk for her.\n Of course, all of these young disciples, no matter what background they came from, could only secretly yearn for and admire Frost Dream from afar. No one was truly stupid enough to imagine they could one day obtain her favor. Frost Dream was an untouchable goddess in their hearts. They were all well aware that even if they were 10 times stronger or their background was 10 times deeper, it would still be impossible to match up to Frost Dream. The difference was simply too great.\n “Big Sister Frost Dream, have you seen? They’re going crazy outside!”\n In the resting room of Vast Universe Empyrean Palace, Xiao Moxian spoke with exaggerated gestures. The First Martial Meeting finals had ended but people still hadn’t left Vast Universe World, in particular Frost Dream’s fanatical fans. They gathered around the resting area hoping to see her beauty once more.\n Frost Dream only gently smiled. Towards all of these fans that were rabidly chasing after her, she had no feeling at all. She suddenly asked Xiao Moxian, “Little Sister, how is Lin Ming doing?”\n “Lin Ming?” Xiao Moxian was startled. She had no idea why Frost Dream suddenly cared about Lin Ming so much. “I’m not too sure. He seems to be heavily wounded; he still hasn’t woken up in the time enchantment. Big Sister, how come you’re worried about him so much?”\n “No reason.” Frost Dream lightly shook her head. The reason she asked about Lin Ming was only because her master Divine Dream had said to her that she must fight Lin Ming during this First Martial Meeting.\n And at this time, within the time enchantment, Lin Ming had already reached the final stage of his training. He had stayed here for 500 days, nearly a year and a half in total.\n When Lin Ming entered the time enchantment he was under 32 years of age. Now that a year and a half had passed, he was 33 years old.\n Whether it was an unintentional coincidence or the hand of fate at work, the age of 33 years just happened to match with the number of the 33 Layered Heavens.\n One year for one Layered Heavens!\n “Let’s begin…”\n Lin Ming took a deep breath. He had now completed all of his preparations. The only step remaining was the final pass.\n Within his mind, he had already deduced the Divine Seal Art again and again. He was revolving all of his energy according to the Divine Seal Art. The sphere of energy within his body formed from his true essence and world power began to rapidly inflate.\n “Heretical God Tree!”\n Hu - !\n The phantom of the Heretical God Tree appeared within Ming’s inner world. The power of thunder and fire flashed atop the crown of the tree!\n “Thunder heavenly tribulation, fire heavenly tribulation!”\n Lin Ming had used two types of heavenly tribulation at once, plunging them both into that sphere of energy!\n The power of thunder and fire were the wildest two of the five elements. Moreover, this was thunder heavenly tribulation and fire heavenly tribulation!\n The sphere of energy was already extremely unstable. With the massive amount of energy contained within, if Lin Ming couldn’t control it, then his inner world would be instantly destroyed. At that time, his fate could be imagined!\n But now, Lin Ming still wasn’t satisfied with the amount of energy before that explosion occurred. He even added thunder and fire heavenly tribulation to the mix!\n Without a doubt, the explosion would be even fiercer. But, Lin Ming had seen the formation of a black hole, and he knew that the more energy and matter contained within that star before it erupted, the more violent the explosion would be, but at the same time, after that explosion, the gravitational suction force of the black hole that formed would be even more terrifying!\n A black hole could swallow even a sun!\n After the power of thunder and fire was absorbed by that sphere of energy, it became increasingly unstable, as if it were about to go crazy and explode at any moment.\n “Still not enough!”\n Lin Ming’s eyes sharpened. All of his muscles were pulled tight and great drops of sweat were running down his forehead.\n At this stage, even the smallest error would bring him beyond redemption!\n The Divine Seal Art was a cultivation method created by Empyrean Divine Seal, so how could it be easy? If even someone with Lin Ming’s talent was having so much trouble, then anyone else that attempted this would simply be committing suicide.\n The energy became increasingly brutal. The sphere of energy was about to lose control at any moment!\n “Three Essences as One!”\n In one breath, Lin Ming poured his astral essence and spirit essence into his inner world. Three energies gathered as one, barely neutralizing the rampant energy and forming a delicate balance. This was already the final stage and this balance would only persist for a few breaths of time. But to Lin Ming, this was more than enough.\n He took a deep breath, his eyes shining like stars burning in the deep dark night. “Bloom in full, beautiful flower…”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1320","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
