{"id":55351,"no":1406,"title":"Chapter 1401 Sneak Attack","content":"Chapter 1401 – Sneak Attack … … … “What!?” With this word, the entire audience was shocked. It wasn’t just the saint Empyreans, but even the human Empyreans were lost for a moment. Empyrean Divine Dream’s rejection had been too sudden. Her words had carried a tone implying that she had no plans of bargaining. The Good Fortune Saint Son’s smile was frozen for the briefest moment before he coldly sneered. “Are you not satisfied with the conditions? We can hash out the details.” Empyrean Divine Dream indifferently looked at the Good Fortune Saint Son, contempt thick in her eyes. “There is no need to discuss anything. I refuse any and all contents of this treaty.” Hearing Empyrean Divine Dream’s words, the Good Fortune Saint Son’s complexion became increasingly dark. The human Empyreans were all panicked and began to constantly discuss amongst themselves with true essence sound transmissions. Divine Dream was too forceful. Although this brash nature made many of the human Empyreans feel proud and elated, they still lacked courage when thinking back to how formidable the saints were, and they also feared that they had offended the Good Fortune Saint Son and taken this too far. “Divine Dream, do you know what you are saying?” The Good Fortune Saint Son’s hands both grasped his fan. As the end of his fan scraped across the stone table, it made a high pitch squeaking noise. The Good Fortune Saint Son had originally given space in the conditions to bargain with Empyrean Divine Dream. But, he never imagined that she would not bother bargaining at all and would flat out refuse him! “Divine Dream…” Skyrend Godlord and Empyrean Vast Universe spoke to Divine Dream with a sound transmission. They were afraid that such an absolute rejection would provoke the saint race too far. If an all-out battle broke out, the consequences would be unimaginable! “Divine Dream, you must endure the sword above your head; showing the necessary patience is what we must do here. Although we will shoulder the sins of humanity, that isn’t anything compared to the fate of humanity.” As Skyrend Godlord said this, he and the others didn’t say anything more. Then, Empyrean Divine Dream actually waved her hand, “I understand.” These words left Skyrend Godlord and the others without any avenue to speak further. Even so, they had no confidence about what was happening here. “Is this what they mean by saying it is better to live as pieces of jade than to live as tiles on the ground?” The Good Fortune Saint Son demonically grinned and stood up. Beside him, the four saint race Protectors also stepped forwards. Astral essence swirled about their bodies, causing the earth to vibrate. The human side refused to admit to being inferior. Although the 100 plus Empyreans here were weaker overall compared to those from the saint race, they still had the support of Mount Potala’s array formation. If a true battle began, even if they were defeated they would be able to cause deep losses to the saints. With Divine Dream at the lead, there were also the great masters Skyrend Godlord, Emperor Shakya, and Great Limitless Buddha. Ka ka ka! The void shook. The four great masters of humanity stood in sharp opposition to the four Protectors of the saint race! The eight auras smashed together. Of these, Divine Dream’s icy blue aura was the largest and most magnificent. With her strength alone, she forcefully withstood the pressure of two Protectors! As for Skyrend Godlord, Emperor Shakya, and Great Limitless Buddha, the three of them joined forces and withstood the aura of the remaining two Protectors. “How interesting!” The black-armored leader of the four Protectors diabolically grinned. The astral essence swirling about him became increasingly wild. At the same time, from between the four of them, a golden shining dharmic wheel took form and began spinning below their feet. The human side refused to show weakness. Great Limitless Buddha smashed his staff against the ground. With a loud peal of thunder, the floor made of timeless god stone exploded beneath the staff. A massive amount of golden energy began to gather towards him from all direction, turning into Buddhist seals and symbols that gathered towards Great Limitless Buddha’s body! For a time, Buddhist prayers echoed throughout the world. It was like a great bell had been rung, enlightening all! This was the power saved within Mount Potala’s array formation and now directed by Great Limitless Buddha. By borrowing the battlefield of Mount Potala, he could multiply his strength. Even if the four saint Protectors joined together in an array formation, it was impossible for them to shake Great Limitless Buddha’s aura. “Mm?” The black-armored man’s complexion changed. He hadn’t truly started fighting. He had only used his aura to probe his enemies’ respective strengths. The human Empyreans were far stronger than he had imagined. This also meant that if they were to truly fight, it would be hard for either side to gain an advantage. Such a situation had never appeared since the negotiations had started. They had lost control of the negotiations. Once the negotiations fell apart, the saint race would be unable to obtain any benefits. They didn’t want to fight here nor did they dare to fight upon returning. Like this, the saint race’s plan to put forth their strength and threaten humanity would completely fail. The Good Fortune Saint Son’s complexion grew increasingly gloomy. Suddenly, he looked at Lin Ming. Recalling the previous events, when the saint race had revealed their great strength, the humans had already acquiesced. Even that Skyrend Godlord had tacitly agreed to sign the treaty and was ready to bargain about the details of the treat. Even Empyrean Divine Dream hadn’t opposed this. But then, Lin Ming had appeared from nowhere and had spoken some unknown words with Empyrean Divine Dream in a true essence sound transmission. Following that, Empyrean Divine Dream’s attitude had taken a complete 180 degree turn and she had ended up rejecting all conditions that the saint race had put forth. If someone said that none of this had anything to do with Lin Ming, the Good Fortune Saint Son wouldn’t believe them at all. “Brat! Just what have you said to Divine Dream!?” A deep cruel light of hatred flashed through the Good Fortune Saint Son’s eyes. This peace treaty with the humans involved a tremendous amount of benefits. If they signed it, then that was the same as grasping all the benefits of the Divine Realm without losing a single soldier! Not only did this affect the benefits of the entire saint race, but to a certain degree it also affected the final result of the war between the saints and the spiritas. And, most importantly, the vast majority of the benefits would have flowed into Good Fortune Divine Palace, where he would have been able to use them. These benefits would have become a stepping stone that paved the way for him to become a True Divinity in the future. Now, because of Lin Ming’s appearance, all of this had disappeared in a puff of smoke. How could he not hate Lin Ming! And faintly, the Good Fortune Saint Son had a premonition that this Lin Ming would become a scourge upon him in the future. If he were to ruin the long-laid plans of the saint race once, he might do it again in the future! As the Good Fortune Saint Son thought of this, he took out the Demon Bead from his spatial ring and began to galvanize its strength with his bloodline. With a horrifying roar, the phantom of a demon king flew out from the Demon Bead, hurtling straight towards Lin Ming! This was not the Good Fortune Saint Son’s strength, but was the power that the Good Fortune Saint Sovereign had sealed within the Demon Bead. The Good Fortune Saint Son had only spurred this power. But with his current strength, he was only able to animate a tenth of this energy. Even so, a tenth of this energy was amazing enough! The Good Fortune Saint Son’s plan was simple. These negotiations were not going to progress anywhere, and since the humans dreaded a battle just as much as the saints did, it was impossible for them to start a battle first. Even if he did anything too excessive, the humans wouldn’t do anything to him. If this was the case, he might as well be excessive to the limit and kill off Lin Ming! At this time, Empyrean Divine Dream and the others were all resisting the pressure of the saints. Even the other Empyreans had joined the fray. No one thought that the Good Fortune Saint Son would launch a sudden attack, and that his goal would be Lin Ming! Seeing that black demon phantom rush towards him, Lin Ming was greatly shocked. He rapidly drew backwards, extracting the Phoenix Blood Spear from his spatial ring at the same time. He could feel a terrifying strength approaching him, just hundreds of feet away. Lin Ming felt as if all the blood essence within his body was being pulled out. His body began to crack, as if he would be mercilessly crushed to death under this pressure! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1401","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
