{"id":55370,"no":1425,"title":"Chapter 1420 Raging Undercurrents","content":"Chapter 1420 – Raging Undercurrents\n …\n …\n …\n The Divine Realm’s 3000 great worlds also included many medium and small worlds. Although these medium and small worlds weren’t as large as a great world, they reached a terrifying quantity. When their total area was added together, they were even broader than the total area of the 3000 great worlds.\n Within these worlds lived many other races. Lots of these races weren’t purebred humans. There were goliaths, gores, imps, monsters, and even clans like the Occult Bone Clan were included.\n Out of all these different races, the monster race was the most powerful.\n The monster race had their own great world as well as countless medium and small worlds. Their population was extremely high and they had many World Kings and Empyreans in their ranks.\n The members of the monster race naturally had an inborn martial arts talent. According to the quality of their bloodline, different Law runes were inscribed into their bones and flesh. They were a brave and fierce race, a truly terrible force to be reckoned with.\n At this time, in the monster race’s Monster Emperor Palace, in a vast hall, there was a rectangular stone table.\n More than 10 people were sitting around it. The one sitting in the honored seat of this stone table was a large middle-aged man.\n This man was 15 feet tall, twice the height of an adult male. His hair was icy blue, his face was handsome, and his eyes were as deep as pure sapphires. Looking into his eyes made one feel trapped and unable to look away.\n As he sat there in his seat, he was like an unfathomable sea that gave off an unpredictable feeling.\n This middle-aged man was the monster race’s Monster Emperor!\n In the past, when a Monster Prince joined the Divine Realm First Martial Meeting and ended up being horrendously defeated by Lin Ming, that Monster Prince had been the grandson of the Monster Emperor.\n This middle-aged man was the absolute king of the monsters. The several other monster Empyreans looked to him as their leader.\n Sitting at the other end of the table was a white-clothed youth. This youth was tall, but compared to the Monster Emperor he seemed as small as a child. This youth held a cup of wine in his hands and his legs were relaxed outwards in a completely comfortable and leisurely posture. He didn’t have the least bit of respect towards this dignified occasion.\n This white-clothed youth was the Good Fortune Saint Son.\n The reason he came to the headquarters of the monster race today was to work together with the monsters.\n The atmosphere of this meeting hall was solemn. Currently, many other supreme elders of the monster race were respectfully sitting here. It was only the Good Fortune Saint Son’s posture which was disrespectful. In this situation, lifting his legs and drinking wine was extremely impolite.\n “Your Highness Saint Son…”\n The enchanting woman who followed the Good Fortune Saint Son reminded him.\n The Good Fortune Saint Son faintly smiled. “It’s no problem at all. We came here to work together and thus what matters is our mutual interests and not whether or not I am respectful. If the monsters were to reject me just because of my manners then they would have never been able to last in the Divine Realm for so long. For the monsters to maintain their own lands in a universe where humanity is over ten times stronger isn’t easy at all.”\n The Good Fortune Saint Son smiled, not bothering to conceal anything.\n At the other end, the Monster Emperor laughed as he listened to the Good Fortune Saint Son’s words.\n The monster race was truly at odds with the humans.\n Both of them shared the same universe and thus it was inevitable that both sides came into conflict over various benefits and resources. In history, there were even great wars that were waged between the humans and the monsters.\n It wasn’t wrong to say that the humans were powerful, but the monsters were equally deep in their background. If humans really wished to start an absolute genocide against the monsters, then although they would win, they would have to pay a deep price and lose several Empyreans in the process. These were consequences that even the humans dreaded.\n Beneath the cover of this fear, the monster race was able to continue onwards.\n For the last several hundred million years, the humans and monsters were actually able to peacefully coexist.\n The Monster Emperor didn’t mention the deep history that the monsters shared with the humans. He merely took out a jade slip from his spatial ring and tossed it at the Good Fortune Saint Son, “Saint Son, take a look at this. If you came here to cooperate with us then I’m afraid you’re one step too late.”\n The Good Fortune Saint Son took the jade slip and swept his divine sense through it. This jade slip was the handiwork of Divine Dream.\n This was a treaty between the humans and the monsters.\n The summary of it was that the humans and monsters would join forces to withstand this great calamity.\n The treaty set forth many terms. In general, humans would pay even more, and in the future after the saints were defeated, the humans would hand over even more benefits to the monster race. All of this was taken with a heart demon oath by Divine Dream; she would not renege on her promise.\n As the Good Fortune Saint Son saw this jade slip, he wasn’t surprised at all. He merely smirked and tossed the jade slip onto the table. “Divine Dream, she truly is a woman with charm.”\n He described Divine Dream not by her ability to lead nor her great strength, but by her ‘charm’. To him, Divine Dream seemed like nothing but a little game that was waiting to be conquered.\n As the preparations for the great war between the human race and saint race were beginning, whether it was the Good Fortune Saint Son or Divine Dream, neither of them neglected the other races of the Divine Realm. They were a considerable fighting force.\n For the humans, even if they didn’t think they could obtain the support of these different races, they at least had to avoid them being swept up by the saints.\n If that happened then humanity would be stabbed in the back by their enemy, leading to their inevitable defeat!\n As for the monsters, whether it was the saints or humans, they were all alien races. The monsters didn’t care which one of them ruled the Divine Realm. All that mattered to them was who could give the monster race the greatest benefits.\n These benefits were all protected by heart demon oaths.\n In a sense, this great calamity could even be called an opportunity for the monsters.\n They could take this chance to search for the greatest benefits to allow their race to prosper into the future.\n “These terms aren’t bad.”\n The Good Fortune Saint Son put down his cup of red wine and stood up. He was well aware that the reason the Monster Emperor took out Divine Dream’s jade slip was because he didn’t fully reject cooperating with the saints.\n The Monster Emperor did this purely because he wanted to bargain.\n Only if the humans and saints competed against each other could the monsters attempt to gain even greater benefits.\n The Good Fortune Saint Son had already guessed this. No matter what the terms were, the Monster Emperor would not immediately agree. Rather, he would find another offer and then ask for a counter offer from Divine Dream. At that time, Divine Dream might lay out even more exaggerated conditions.\n In this way, the saints would fall into a never-ending game with the humans. The final outcome of this was that the conditions would become increasingly rich for the monsters. The monster race might not even need to take action in the war, but after the war ended they could still enjoy tremendous benefits.\n This was a truly well thought out plan!\n “Your Highness Holy Son, this old fox wants us to struggle with the humans. He wants to fish for benefits from the chaos.”\n During these negotiations there were a great number of followers that accompanied the Good Fortune Saint Son. There were even a considerable number of saint Empyrean powerhouses attending this event. The reason they came here was to increase their weight in these negotiations as well as to protect the Good Fortune Saint Son.\n After all, if the current Good Fortune Saint Son were to run into an Empyrean powerhouse, he wouldn’t even have the ability to escape.\n The Good Fortune Saint Son grinned. Then, he coldly replied with a sound transmission, “His plan is well thought out but I won’t let him do as he wishes. If we continue struggling with the humans then there won’t be any advantages for us and it will simply help the monsters in vain.”\n The Good Fortune Saint Son seemed to gain a great sense of confidence. He picked up his wine cup once more and said, “Your Majesty Monster Emperor, according to what I know, your people and the humans have always been enemies, right?”\n “There are no eternal enemies nor are there eternal friends. There are only eternal interests.” The Monster Emperor replied, his answer watertight.\n “Yes… that’s right, there are only eternal interests. For the glory that is the word interests, let us take a drink.” The Good Fortune Saint Son raised his cup of wine and swallowed down a great gulp.\n This sort of behavior left everyone puzzled.\n After drinking, the Good Fortune Saint Son licked his lips and said, “Your Majesty Monster Emperor, how about we both go straight to the point and be honest with each other. If you think that we will be your allies in competing with the human race then I must say you are mistaken. We are different from the humans because our saint race is far more formidable than the human race! You might have guessed it by now, but there are some reasons as to why we cannot wage all-out war with the humans yet. But, this temporary ceasefire won’t last for much longer. At that time, do you really think that you are a match for my saint race even if you join forces with the humans?\n “The terms of the humans are generous, but, you must realize that the premise of all this is that you can win! However, what if you don’t win? What do you think will be the fate of the monster race?”\n As the Good Fortune Saint Son spoke to here his words turned cold. The Monster Emperor frowned; these words had struck at his weak point.\n If the combined armies of the humans and monsters were defeated then the saints would simply directly exterminate their monster race! They would not leave behind any chance for the monster race to continue existing.\n “Your Majesty Monster Emperor, let me be honest. The strength of your monster race is weak when compared to the humans. Even if you joined forces with the humans, how much help could you offer them? Do you think you can change the overall situation of this war? It is inevitable that my saint race will unify this universe under our control. If we sign a contract now then I can make an oath on my heart demons. I will make sure to leave behind resources and lands to your monster race that are at least 10 times larger and more plentiful than what they are now!\n “Of course, Your Majesty must not forget that there is also a monster race within my Saint Convocation Heaven. Us saints have been able to coexist harmoniously with the monster race of Saint Convocation Heaven, and they are also much stronger than your Divine Realm’s monster race. In the future, you and them may even communicate with each other, joining into one large group to ensure 10 billion years of prosperity for the monster race!”\n The Good Fortune Saint Son’s words were filled with confidence. It was like he was not talking about possible futures but absolute certainties.\n As if everything that would happen was already taken for granted.\n This was the confidence that belonged to a true leader. It was also extremely persuasive.\n As the Good Fortune Saint Son spoke to here, he suddenly changed the topic. His expression also became much gentler. “Your Majesty Monster Emperor, if you are unsatisfied with the terms of the proposal then we can speak further on the topic. I will try to satisfy Your Majesty’s requests as much as possible. How about it?”\n After the stick was the carrot. This was a very ordinary negotiation method. But, when the Good Fortune Saint Son used this method it was very natural, as if everything he did was justified by the heavens and earth and absolutely couldn’t be refused.\n The Monster Emperor was silent. He couldn’t help but consider the Good Fortune Saint Son’s words.\n The monster race of Saint Convocation Heaven was indeed a tremendous influencing factor in the decision he had to make. The Divine Realm’s monster race was far too weak. If they wanted to further develop, they needed the support of a more stable foundation.\n The Good Fortune Saint Son smiled as he saw the Monster Emperor wavering. He took out more wine from his spatial ring and began to serve it to himself. He didn’t disturb the Monster Emperor and only waited for his reply.\n The atmosphere was silent for a long time. The Monster Emperor wasn’t speaking out loud, but he was silently communicating with a sound transmission, “Demondawn… what do you think?”\n Within a hidden chamber of Monster Emperor Heavenly Palace, there was a tall black-robed man. This person was who the Monster Emperor had been speaking to with sound transmissions.\n This black-robed man was Empyrean Demondawn.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1420","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
