{"id":55383,"no":1438,"title":"Chapter 1433 The Hunter Game","content":"Chapter 1433 – The Hunter Game\\n\\n …\\n\\n …\\n\\n …\\n\\n In the platform at the center of the level, Dugu Li thrust out his hand, pouring the entirety of his astral essence into the Wheel of Destiny. The runes atop the Wheel of Destiny began to emit a bright luster, unpredictably changing.\\n\\n Everyone’s eyes were locked onto the Wheel of Destiny.\\n\\n Runes lit up one by one. As Dugu Li looked at these flashing lights, his mind tightened.\\n\\n As the runes began to dim down, the last shining rune would be the one which Dugu Li drew.\\n\\n Although this drawing only occurred for several breaths of time, to Dugu Li, each second seemed as long as a year.\\n\\n Finally, the last lit up rune lay above a shield badge.\\n\\n At the end of the draw, this shield was the first reward possibility – a rare mission badge.\\n\\n This was the worst of the three possibilities but also the likeliest. Most people drew this result.\\n\\n Dugu Li’s lips twitched, a bit of regret in his heart. After coming this far he couldn’t help but fantasize that he would draw out the third possibility and ascend to the heavens in a single leap. However, the fantasy was shattered.\\n\\n “Congratulations Lord Dugu Li!”\\n\\n “That’s right, Lord Dugu Li truly has a wonderful destiny upon him. A rare blue soul badge is of inestimable value.”\\n\\n Everyone began to congratulate Dugu Li. His status was high to begin with, and now he could go even higher.\\n\\n “Lord Dugu Li, do you have any intention of transferring this badge?”\\n\\n Someone asked. However, Dugu Li immediately rejected this idea. “I definitely won’t transfer this blue soul badge.”\\n\\n Dugu Li said, leaving no room for argument. Although he currently didn’t possess the ability to complete this blue soul badge’s mission, he could have this badge temporarily held at Black God Fort until he made a breakthrough before returning at a later date to complete it. If he sold it to others then that would be far too wasteful. After all, this type of rare badge couldn’t be purchased with money.\\n\\n Dugu Li looked at the one who spoke up and said, “If you want one, you can participate in the trial yourself!”\\n\\n The Black God Fort’s smelting trial was open all year round but there weren’t many people who participated in it. This was because those that didn’t possess an Asura title would find it nearly impossible to gain any advantages in the trial. Even for those with an Asura title, wanting to complete the checkpoints would require a significant amount of strength and luck.\\n\\n Moreover, every time one participated in this trial, there was an admission fee of 100,000 origin energy runes. For many martial artists, this amount of money left them feeling overly nervous.\\n\\n But today, because many people had been roused by Dugu Li, they began to stand up in abundance. “Haha, since that’s the case, I will participate once!”\\n\\n “I also want to give it a try. I’ve never participated in Black God Fort’s trial before. Although the admission fee is a bit steep, I still want to experience it once.”\\n\\n “Me too!”\\n\\n In a short period of time, seven or eight people had signed up.\\n\\n These seven or eight people were all outstanding individuals amongst their level. Many of them were just a single step away from becoming an Asura. As long as they had another year or so, they would be able to complete the necessary steps to obtain an Asura title.\\n\\n Upon seeing this scene, the three Black Iron Ghosts that came into conflict with Lin Ming were also enthused. They all looked eager to give this a try.\\n\\n “Big Brother, let’s go and try too!”\\n\\n “300,000 origin energy runes isn’t a small number, but if we can pass the trial our gains will be great. Still, the chances of us passing this trial are extremely slim. Currently, there are a lot of people participating and before the trial really begins we will have to struggle against these trial challengers, making things even harder for us. After all, none of these challengers are weaker than we are. If we lose, we’ll have lost 300,000 origin energy runes. That will take a great deal of work and time for us to earn back…”\\n\\n The leader of the three Black Iron Ghosts hesitated. In truth, he understood that even if the three of them worked together in the trial, their chances of success were nearly zero.\\n\\n However, after some others heard these words they were left speechless. The so-called ‘great deal of work and time’ was actually extorting, robbing, strong-arming, and murdering others.\\n\\n As the three Black Iron Ghosts were wavering, not too far away, a human youth raised his hand and said, “I would also like to participate.”\\n\\n “Mm?” The three Black Iron Ghosts were shocked.\\n\\n “This boy, isn’t he the fellow who bought the blue soul mission badge!”\\n\\n “This little beast is far too rowdy, to think that he would dare scold us Black Iron Ghost Triad in front of so many people! In all these years, those arrogant fools that dared to provoke us have all died.”\\n\\n The boss of the three Black Iron Ghosts sneered. He wanted to wait until they left to deal with Lin Ming, but he never imagined Lin Ming would jump into the tiger’s den.\\n\\n “Hehe, he also wants to enter the trial. How interesting. He doesn’t know the rules of this area and yet he dares to participate in the Black God Fort smelting trial. In this world how can there be someone who attacks those that are stronger than themselves?”\\n\\n Even a one-star Asura could fail this sort of trial. Moreover, Lin Ming didn’t have too many runes on him right now. For him to toss out 100,000 origin energy runes to participate in the Black God Fort trial was far too conspicuous.\\n\\n Many people looked over to Lin Ming, including even the ogre vendor who sold Lin Ming the blue soul mission badge. In his eyes, Lin Ming seemed like a pretty little flower that wasted money everywhere and anywhere.\\n\\n “Hehe, if he participates then this trial might be fun. We should make sure to ‘look after’ him.”\\n\\n “Haha, third brother is right. Big Brother, we also need to participate.”\\n\\n “Mm…” The boss of the three Black Iron Ghosts was originally unsure, but now that he was provoked by Lin Ming he directly raised his hand and said, “We will register too!”\\n\\n “The three Black Iron Ghosts are also entering!”\\n\\n “After that human boy decided to participate the three Black Iron Ghosts also decided to join in. This is clearly because of him. It seems they want to mess with him in the trial.”\\n\\n “That’s right. This Black God Fort trial isn’t something that just any ordinary martial artist can play around in. That human youth is far too young and naïve, and now he also has to deal with the Black Iron Ghost Triad.”\\n\\n Everyone began to discuss amongst each other. None of them thought that Dugu Li’s drawing would cause so many hopeless trial challengers to lose their minds and register. This would only make the trial even more intense and difficult to complete.\\n\\n “What a pity. They should have given me those origin energy runes instead of just throwing them away here.” Some martial artists sighed.\\n\\n Lin Ming’s thoughts stirred as he heard all of this. “Soulwhite, where do the origin energy runes used to purchase mission badges and pay for the trial entrance fee go? Are they taken by the City of Discord’s City Lord?”\\n\\n Soulwhite shook his head. “It’s not like that. If that were the case then the City Lord would have accumulated an unimaginable amount of wealth. All of the origin energy runes are completely recycled by the Asura Road’s Heavenly Dao. It seems as if these origin energy runes are used to support the continued revolution of power for the Heavenly Dao here. Some people even suspect that the entire Asura Road is an incomparably massive array formation and the trial challengers are placed in this array formation and have to follow its rules.”\\n\\n “This is…” Lin Ming was stunned. Although this sort of perspective was shocking, the more he thought about it the more reasonable it sounded.\\n\\n “Master, the three Black Iron Ghosts are specifically targeting you. Although they cannot do anything to you in Black God Fort, the trial is different. Master must be extra careful.”\\n\\n “Mm, I got it.” Lin Ming chuckled.\\n\\n “Is there no one else registering? Then… all registered martial artists, please step up to the platform.” A silver-armored martial artist said from above the platform. He was part of the Silver Snow Corps.\\n\\n At the end, there were a total of 15 martial artists that had registered.\\n\\n Lin Ming quietly stepped onto the platform. Beside him were the three Black Iron Ghosts. It could only be said that enemies often crossed paths.\\n\\n “Hehe, little boy from the human race, us grandpas will take good, good care of you.”\\n\\n “You should try to put up a little struggle. Don’t give up so fast, hahaha!”\\n\\n On the platform, the three Black Iron Ghosts were sinisterly smiling. And at this time, the Silver Snow Corps martial artist stepped in front of the martial artists. He said without any expression, “Now I shall announce the rules. There are some among you who already know them, but I shall repeat them anyways.\\n\\n “The trial you shall be participating in is in truth a game! This game is called the Hunter Game. After 20 breaths of time, all of you will be transmitted to a separate dimensional realm. There, all of you are hunters and all of you are prey. Your goal is to hunt as many prey down as possible and obtain the trophies from their bodies!\\n\\n “These are the trophies!”\\n\\n As the Silver Snow Guard spoke, he flung several black objects towards the participants.\\n\\n Lin Ming took the trophy in his hand and looked at it. It was actually a black skull. This black skull was very heavy and exuded an extremely fierce feeling.\\n\\n The Silver Snow Guard continued to say, “This is a skull badge. The trial challengers that join this game may hunt each other and steal each other’s skull badges. In addition, within this dimensional realm there are many prey that come in all different shapes and abilities. If you kill them you may also obtain skull badges!\\n\\n “Of course, these prey may be hunters themselves that hunt you instead! Their strength is decided by the strongest amongst you. Once a trial challenger loses all their skull badges or they are severely wounded and unable to fight, they will be considered as eliminated from the game and directly transmitted out of the dimensional realm.\\n\\n “Within the dimensional realm you may freely fight. However, you may not kill others. For every person you kill, that will subtract two skull badges from your count. Consider your actions before you take them.\\n\\n “Alright, I have finished explaining the rules. When the game ends, your result will be judged based on the number of badges you have collected. If you surpass 50 skull badges then you will have the chance to draw a blue soul level mission badge. If you surpass 100 badges, then you will obtain a blue soul level draw chance as well as a zenith black draw chance!”\\n\\n The Silver Snow Guard and the other participants didn’t have any reaction to this, but Lin Ming was startled. “You can also qualify for a zenith black drawing?”\\n\\n “Yes Master. If you perfectly complete the Black God Fort smelting trial then you will obtain a zenith black draw chance. But, I haven’t heard of anyone managing to accomplish this in all these years…”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1433","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
