{"id":55390,"no":1445,"title":"Chapter 1440 Gathering the Badges","content":"Chapter 1440 – Gathering the Badges … … … Lin Ming wasn’t surprised to see the Concept of the 33 Layered Heavens in the final pass of this Hunter Game. In his eyes, the Concept of the 33 Layered Heavens represented the peak of the universe. Besides the Divine Realm there were 32 other Heavens, but these Heavens only stood on equal ground to the Divine Realm, not dominating it. The Concept of the 33 Layered Heavens was also the highest supreme Concept formed by gathering together essence, energy, and divine. The supreme being who created the Asura Road was absolutely someone who had reached the pinnacle of this aspect. But now, there were 36 golden-armored martial artists in front of Lin Ming, three more than he thought there would be. Even so, when everything added together it exuded an extremely harmonious feeling, as if nothing was out of balance. Hu - ! A massive circular postcelestial dao diagram appeared beneath the 36 golden-armored warriors. At the same time, an invisible force covered Lin Ming, surrounding him. This is… a domain? Lin Ming’s mind turned cold. This was not just a domain – it was an extremely high rank domain. This domain consisted of three different kinds of power – spirit essence, true essence, and astral essence. These three powers perfectly fused with each other and flooded the surrounding space. At this time, the 36 golden-armored warriors split up into three groups, each group consisting of 12 of them. For each group of 12 there was a leader, with the other 11 standing in different positions around this person. Their positions each contained profound and wonderful truths that were difficult to explain. “This array formation diagram is extremely skillful. This should be the first threshold in the Asura Road that has a sense of difficulty.” During his time in the Asura Road, Lin Ming could feel that this world’s checkpoints were divided into many, many ranks. A trial challenger had to complete these checkpoints one after another in order to fully complete this trial. In the last 100 million years, only the saints’ Good Fortune Saint Son and the spiritas’ young genius girl were able to surpass 80% in completing these checkpoints. And now, this trial challenger game in front of Lin Ming was definitely the first checkpoint that branched out from the previous difficulty. Lin Ming absolutely had to complete this in the most perfect manner he could. As Lin Ming was thinking this, the 36 golden-armored warriors began to move. They attacked together. With 12 people to a group, their attacks gathered into three torrential currents that flooded towards Lin Ming. Lin Ming revolved the energy within his body. The grandmist energy from his inner world flooded outwards. Grandmist space! Hah - ! A heavy and boundless aura covered the void. As those raging currents of energy entered the grandmist space they were immediately weakened by the heavy grandmist energy. By the time these attacks reached Lin Ming they had less than a third of their original strength. Basically, they weren’t able to pose a threat to Lin Ming. “Break!” Spear light swept out. These three strengths were crushed by Lin Ming’s azure spear light with overwhelming force! At the same time, Lin Ming stepped forwards, hurtling straight into one of the groups of golden-armored warriors! This group of golden-armored warriors were essence gathering system martial artists. Lin Ming was well aware of the balance within this grand array of 36 golden-armored warriors. As long as he could kill any one of these warriors, he would be able to break the perfection of the array formation and they would no longer be able to pose a threat to him. And of these three great cultivation systems, the one Lin Ming was most familiar with and the one that humanity excelled in the most was the essence gathering system. Thus, he didn’t fear that his opponent was skilled in the essence gathering system. If his opponent used the Laws, he could use his own Laws to counter. Attacking the group of essence gathering system warriors was the easiest as well as fastest route. As for the body transformation system warriors, their defensive ability was formidable. Even three rounds of attacks might not result in any true damage done to them. As for the soul forging system warriors, there was no need to speak of them. Their mysterious and strange soul attacks held too many unknown variables for Lin Ming. Hah - ! The phantom of the Heretical God Tree appeared behind Lin Ming. The massive Heretical God Tree rose straight into the skies. The wild power of thunder and fire raged down it, pouring into Lin Ming’s Phoenix Blood Spear. For a time, a purple and red sun seemed to appear within the void. Lin Ming thrust his spear out and a divine light swept over the world. Lin Ming’s attack was far too strong. Even though 12 golden-armored warriors united together, they still found it difficult to withstand the impact of this spear strike. Lin Ming’s attack had disrupted their formation! Bang! The postcelestial array diagram beneath the 12 golden-armored warriors paled. A bright light cut through Lin Ming’s eyes. This was his chance! Just as Lin Ming was about to attack them, the other 24 golden-armored warriors came hurtling towards him. If he were to turn to deal with them then the brief advantage he gained from his attack just now would be lost! Lin Ming didn’t plan to let his opponents have any time to recover. He shouted out loud, galvanizing the grandmist space to the peak. At the same time, he opened the Eight Inner Hidden Gates, increasing his defensive power to the limit. He actually planned to forcefully resist the attacks of the two other groups of golden-armored warriors and then quickly exterminate the essence gathering system group. If he could do this then their array formation would be broken! Ka ka ka! Two beams of energy fiercely collided with the grandmist space. This placed a great pressure on Lin Ming, but he didn’t care at all. Instead, he thrust out his spear. Three Essences As One, Eternal Darkness! In that instant, essence, energy, and divine strength fused within Lin Ming. The Phoenix Blood Spear emitted a clarion cry as an absolute dark black hole seed was shot out. A black hole seed could absorb all matter and energy. Now that Lin Ming was using the grandmist space to suppress the movements of the 12 golden-armored warriors in front of him, he could only use this strike. Bang! A horrifying explosion of energy rang out. The black hole seed caused a massive black vortex to appear. Two golden-armored warriors were caught up in this vortex and were completely split up from the postcelestial dao diagram beneath their feet. Then, their bodies were sucked into that twisting black vortex and torn into pieces, instantly dying! Woosh! Woosh! Two skull badges dropped into Lin Ming’s hands. He took a deep breath. In that attack just now he had been forced to make a quick decision and as a result he had withstood the strikes of two other attacks, leaving him with some wounds. But to his powerful mortal body, this degree of injury wasn’t anything at all. “It’s over.” Now that two of the 36 golden-armored warriors were gone, the array formation was no longer in balance. The remaining golden-armored warriors were not Lin Ming’s match. Everything else was simply a matter of time. Lin Ming suppressed the slightly restless energy and blood within himself. He grasped the Phoenix Blood Spear and hurtled forwards like a tiger rushing into a flock of sheep. An essence gathering system golden-warrior bore the brunt of this attack and was sent flying away by Lin Ming, losing all contact with the postcelestial dao diagram beneath him. The golden-armored warrior tried to use the Space Laws to return to his position in the array diagram, but Lin Ming’s Space Laws were even more profound. In just a split second, he immediately teleported behind that golden-armored warrior and stabbed his spear through his chest, immediately killing him! Lin Ming didn’t stop here. He swept out his spear and shattered the neck of a golden-armored warrior behind him. And at this time, other golden-armored warriors began to slowly encircle Lin Ming. However, now that they had lost the balance of their perfect array formation, they were like tigers without fangs in front of Lin Ming, unable to pose any threat. Two more golden-armored warriors were exploded into pieces by Lin Ming’s Heavenly Dao Judgment! The more warriors that died, the less pressure he faced and the faster he killed them. In a quarter hour, all 36 golden-armored warriors were annihilated by Lin Ming, turning into 36 skull badges that fell into his hands. Like this, he had perfectly finished this trial! “It’s done. 100 skull badges. According to the difficulty of this trial, Dragon Fang and Hang Chi should also be able to complete it. They would only need to spend some effort. Even for someone a bit weaker, they could also complete it with a bit of luck. As long as they kill one person then everything would be much easier.” Lin Ming appraised the difficulty of this trial. In order to finish it, one would need to be a top genius of their race. However, they didn’t need to be the most extreme of geniuses. “Now that it’s over I should leave.” As Lin Ming was thinking of exiting, the space in front of him suddenly twisted. A series of god runes began to appear in front of him. Within Lin Ming’s mind, a mental sound transmission spoke to him. “You have shattered the golden-armored warriors within 300 breaths of time. Due to this, you may choose to participate in the second challenge or leave the world of the Hunter Game.” “Another challenge?” Lin Ming was startled. He could challenge this trial a second time? That battle right now could be said to be very easy for Lin Ming. When he killed those 36 warriors he had done it in less than 300 breaths of time. It had only taken around eight or nine breaths of time to kill each one of them. If he participated in the second challenge, just what would he win if he passed? Would it be additional rewards? What kind of rewards? According to the information he knew from the start, the zenith black level drawing he gained from having 100 skull badges was the highest reward available. Lin Ming was a bit puzzled, but without a doubt, his choice was to participate in the next challenge! After Lin Ming made his choice, the surrounding heaven and earth origin energy began to surge all around him. At the same time, a massive number of runes fell down from the clouds until they linked into a single stream. It was hard to estimate how many there were. Lin Ming took a closer look. These runes were origin energy runes, the currency of the Asura Road. Whether it was the fee to enter the Hunter Game trial or purchasing mission badges, one needed origin energy runes. And now, these origin energy runes tumbled down from the sky in a massive deluge and then burned in the air. Hu – Hu – Hu – Brilliant flames burned. These were flames formed by heaven and earth origin energy. Every breath of time, over a thousand origin energy runes were burnt up. The horrifying conflagration burned through the skies. “There are so many origin energy runes being burned. It seems my previous guess was right. The origin energy runes that we pay are indeed used to maintain the revolution of the Asura Road’s array formations. If this array formation burns so many of these runes then it’s hard to say just how powerful it will become!” Without a doubt, the difficulty of the challenge would rise to an all new level. Perhaps even Hang Chi and Dragon Fang wouldn’t be able to complete this challenge. “Is this a test aimed at extreme geniuses? I wonder whether or not the Good Fortune Saint Son experienced this sort of challenge? What was his result?” Lin Ming’s lips curved up in a smile. The more difficult a challenge was, the more it caused his blood to boil over with fighting spirit. And at this time, in the outside world, only two to four hours had passed. In the past, martial artists would normally need 14 to 16 hours to gather the 50 mission badges needed for the blue soul level reward. However, in reaching the final checkpoint, Lin Ming had only used two to four hours. To have such a horrifying speed was because of his overwhelming strength and his sharp and powerful divine sense. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1440","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
