{"id":55428,"no":1483,"title":"Chapter 1478 - 10,000 Corpse Flowers","content":"Chapter 1478 - 10,000 Corpse Flowers\\n\\n …\\n\\n …\\n\\n …\\n\\n “What’s wrong Sage Zhou!?”\\n\\n Everyone here in God Burying Ridge could be described as frightened birds. Now that they heard Fatty Zhou say such words, all of them raised their guard.\\n\\n “Don’t breathe in that fragrance, it is the fragrance of 10,000 corpse flowers!”\\n\\n Fatty Zhou shouted out. However, as he did so a martial artist was covered by this fragrance. In that moment, the martial artist seemed to lose consciousness as his eyes became lost. Flower petals began to fall down from the air like butterflies, landing on this person’s skin. Then, these flower petals melted, turning into a bright blood red liquid than sank into his body.\\n\\n The martial artist’s body shook. In the next moment, a macabre and gruesome scene occurred. More and more flower petals fell onto this martial artist and more and more red liquid seeped into his body, spreading all over. Finally, even the martial artist himself began to melt apart into red liquid. Then, those bright blood red flowers began to germinate within him, sprouting out enchanting buds.\\n\\n The roots of these flowers greedily absorbed the liquefied body of the martial artist; they were actually using the martial artist as nourishment!\\n\\n This caused a tingling chill to crawl up the scalps of these people.\\n\\n “Don’t let those flower petals touch you. This is how the 10,000 corpse flowers reproduce. A single flower petal can grow into a 10,000 corpse flower!”\\n\\n Fatty Zhou rapidly said with a sound transmission. 10,000 corpse flowers were the most common type of creature in this Paradise Reborn land that used powerhouses as nourishment. They were extremely valuable for medicinal purposes. However, if someone wished to pluck these flowers, the price might be their life.\\n\\n At this time the entire sky was filled with drifting flower petals. The bursts of flower fragrance met the senses and this flower fragrance actually had the effect of attacking one’s divine sense. By smelling this fragrance one’s thoughts would slow down, making it much harder to avoid the flower petals!\\n\\n “Damnit!”\\n\\n “Stand back to back! We’ll win if we can withstand this for a short time!”\\n\\n Fatty Zhou rapidly cried out. At the same time he drew a thick cleaver and slashed out without holding anything back. Torrents of cleaver light fell downwards, each ray cutting through four or five flower petals, causing those flower petals to dissolve into red liquid that sprinkled onto the ground.\\n\\n However, after every flower petal was cut apart the cleaver light would greatly weaken. After breaking through a fifth flower petal, the cleaver light would break apart. There were simply far too many flower petals dancing in the air!\\n\\n “Everyone attack together!”\\n\\n Dragon Cloud and Dragon Moon attacked with their spears. Their strength was not weak at all. Facing one side, they were able to destroy all of the incoming flower petals with their spear light.\\n\\n Several other martial artists stood back to back, relying on each other to resist the attacks of these flower petals. If any one of them were to fall, all of them would die!\\n\\n And at this time, Lin Ming and Xian Moxian were by themselves, soon covered in this rain of red flower petals.\\n\\n “Junior-apprentice Sister!” Monster Prince Duyu shouted.\\n\\n “Leave them be, we can’t even take care of ourselves!” A martial artist rapidly said. The martial artists that entered God Burying Ridge had extremely fragile relations to begin with, so who could care about others when disaster befell them?\\n\\n Woosh! Woosh! Woosh!\\n\\n Bright red flower petals were like flying knives that spun towards Lin Ming and Xiao Moxian. This beautiful, fairy tale-like scene was actually filled with a thick killing intent. The two of them were instantly blocked in by over a hundred flower petals.\\n\\n The results of this scenario could be imagined. Once these flower petals touched the body, the consequences would be horrifying.\\n\\n After falling into such a dangerous situation, Lin Ming wasn’t hurried at all. He poured his strength into his inner world, causing a boundless aura to surge out from within himself!\\n\\n “Grandmist space!”\\n\\n Hu - !\\n\\n Star-heavy grandmist energy recklessly swept outwards, causing the space around Lin Ming and Xiao Moxian to immediately become as hard as a wall. The terrifying pressure pushed upon the flower petals, making them as slow as if they had fallen into a lake of molasses.\\n\\n “What strange flower petals.” Through his formidable divine sense, Lin Ming discovered that every flower petal contained a resentful spirit! Moreover, these flowers were filled with blood vessels. Rather than flowers, they were more like condensed flesh and blood essence.\\n\\n The 10,000 corpse flower was a flower of flesh and blood!\\n\\n “Three Essences As One, Heretical God Force!”\\n\\n Lin Ming revolved his strength to the limit. With a loud series of explosive sounds, a massive number of flower petals imploded upon themselves underneath the pressure of the grandmist space!\\n\\n Simultaneously, Xiao Moxian formed a series of seals with her hands. Black flames blew outwards, setting the remaining flower petals on fire. As the flesh and blood was scorched away, the resentful spirits also disintegrated. In just several breaths of time, Lin Ming and Xiao Moxian’s combined attack completely eliminated the hundred plus flower petals!\\n\\n “This is…”\\n\\n Even Fatty Zhou and the others who were still surrounded by flower petals were shocked speechless. They knew that Lin Ming and Xiao Moxian were strong, but it was bizarre to be strong to such a degree. It seemed that the two of them alone were stronger than the rest of them combined.\\n\\n In truth, the fact that Lin Ming could easily obtain victory was because his grandmist space was best suited to such a combat environment. As for Xiao Moxian’s flames, they inherently restrained all ghosts and spirits.\\n\\n “30 feet to the front left, behind that gray rock, attack together!”\\n\\n Lin Ming rapidly said to Xiao Moxian with a true essence sound transmission. As the many flower petals burst apart, he spread his formidable sense and quickly found the hiding spot of the 10,000 corpse flower’s main body.\\n\\n The main body of the 10,000 corpse flower was extremely skilled at hiding. Even an experienced God Burying Ridge guide would find it difficult to locate it.\\n\\n The reason that Lin Ming could accomplish this was because of the Divine Dream Law and his powerful divine sense. Moreover, it was also because when those many flower petals exploded, the main body of the 10,000 corpse flower received a backlash of energy, causing the energy fluctuations around it to wildly pulse about.\\n\\n Hearing Lin Ming’s words, Xiao Moxian didn’t hesitate in the least. She slashed out with her whip, stirring up a terrifying wave of phoenix true fire!\\n\\n At the same time, Lin Ming also followed up with his spear!\\n\\n At that moment, from behind Lin Ming, the phantom of the Heretical God Tree appeared. The power of thunder and fire heavenly tribulation came tyrannically crashing down.\\n\\n Bang!\\n\\n A terrifying noise sounded out as a large chunk of this beautiful paradise was ripped apart. Then, a giant scarlet root that looked like a ginseng was raised out of the ground by this explosion. For a time, it was unknown how many root hairs were torn up.\\n\\n Squee - !\\n\\n The bright red root began to emit mouse-like screams in the air. It seemed to have a spiritual intelligence of its own and was struggling around in the force field in an attempt to escape.\\n\\n “The 10,000 corpse flower was found by that youth?”\\n\\n Fatty Zhou was completely shocked. Not only had Lin Ming broken through the besiegement of the 10,000 corpse flower but he had also dug out its main body.\\n\\n The main body of the 10,000 corpse flower was not powerful at all; it only excelled in hiding. Once its hiding spot was found out, even a half-step Holy Lord powerhouse would be able to kill it.\\n\\n Squeek! Squeek!\\n\\n Beneath the horrifying pressure of the grandmist force field, the 10,000 corpse flower emitted waves of miserable screams. Its root body looked like an overfilled water bag, about to explode at any moment!\\n\\n “Brother Lin, don’t destroy it! That is a precious type of raw medicinal material!”\\n\\n Fatty Zhou quickly reminded Lin Ming as he saw the 10,000 corpse flower about to explode beneath the force field.\\n\\n Lin Ming’s mind stirred. Without removing the grandmist force field he formed hundreds of seals with his hand that flew into the 10,000 corpse flower root.\\n\\n “Divine Seal Art – God Forbidding Seal!”\\n\\n Puff! Puff! Puff!\\n\\n The aura of a black hole came shrouding over the 10,000 corpse flower, locking down the flow of energy within it! The 10,000 corpse flower wildly cried out as it was being imprisoned by the God Forbidding Seals, but soon after that there was no more sound as it was completely sealed away.\\n\\n As the 10,000 corpse flower died, the remaining flower petals withered and fell. They slowly decayed, turning into red liquid that soaked into the ground.\\n\\n The remaining survivors eyed Lin Ming and also the blood red 10,000 corpse flower in his hands.\\n\\n This human youth was too terrifying! Such a dreadful disaster was easily solved by him!\\n\\n Fatty Zhou knew that the reason Lin Ming was able to accomplish this was because he could be called perfect in all aspects. He had used that strange force field to break through the attack of the 10,000 corpse flower’s flower petals, and then he had used his far superior sense to immediately lock onto the position of the 10,000 corpse flower’s main body.\\n\\n There was no weakness in the methods that Lin Ming had used. And thinking about his other aspects, he also surpassed everyone by far, far enough that they couldn’t look up to him. This was a true extreme genius!\\n\\n “Little Sister… it seems we were mistaken about something… he does have the blood of an Azure Dragon within his body, but his achievements are not because of this blood. Rather, this bloodline is simply something that improves upon his perfection.” Dragon Cloud looked at Lin Ming, a strange feeling in his heart. As someone who was proud of his dragon clan bloodline, he was thoroughly overwhelmed by Lin Ming.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1478","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
