{"id":54104,"no":159,"title":"Chapter 158 - Thunder Valley","content":"Chapter 158 Thunder Valley. Chapter 158 – Thunder Valley … … … “This doesn’t matter; I do not need you to kill him. I only need a favor from you; I have already sent for someone to kill him. If this is successful, then I will have my uncle speak a few good words to your master so that he’ll pass on some cultivation methods to you.” In the Seven Profound Valleys, a deputy house master was considered a disciple of relatively low status and thus was less valued. This was the reason Ouyang Dihua had used his uncle as a lure. Bi Luo cheerfully said, “Haha, then I will first apologize to Junior Apprentice Brother. But why did you ask someone to assassinate Lin Ming? Can you not do it yourself?” Ouyang Dihua said, “Killing Lin Ming isn’t a trivial matter. Even if I have my uncle supporting me and I do not leave any evidence that could be used against me, it’s still better to not be public and arouse suspicious. When I send someone to kill Lin Ming, I’ll attend some banquets and stay out of sight. As long as the matter is cleanly executed, no one will dare to question me.” Bi Luo licked his lips, “Who did you prepare to go? If their strength is too weak, it will just be like meat dumplings attacking a dog; once they go they won’t return.” “Don’t worry. I’ve already asked a nearby senior apprentice brother in the Sky Fortune Kingdom. He used to be in the Refiner Faction, but he violated the sect rules and was expelled from the Seven Profound Valleys. I have some friendship with him and his cultivation has already reached the peak Pulse Condensation Period, and his battle strength is not underneath mine. As long as I promise him some benefits and he does this, then that would be for the best. What’s even better is that he is someone who was originally a loner, and likes to wander around aimlessly. At that time, even if they find him, they won’t be able to discover anything from him. In terms of cultivation, Ouyang Dihua was at the middle Pulse Condensation Period. But, the cultivation methods that he studied in the Acacia Faction were mostly to fight and kill others. His senior apprentice brother was from the Refiner Faction, and he was best at refining; his fighting technique was a bit lacking. So because of this, their combat efficiency was similar. “Peak Pulse Condensation Period?” Haha, you actually want to use a peak Pulse Condensation Period master to deal with a little child who has just entered the Altering Muscle stage? You must think very highly of Lin Ming.” Ouyang Dihua said, “Lin Ming is not a normal boy at the Altering Muscle stage. Not only that, but he also has the Thunderbolt Devilfire bead in his possession; that weapon can kill an early Pulse Condensation Period martial artist. Although it isn’t easy to use the Thunderbolt Devilfire Bead to strike a Pulse Condensation Period martial artist, I still have to be careful, so I’m using my full force against him. If it wasn’t for the fact that it was difficult to find a Houtian realm martial artist on such short notice, I would have already asked a Houtian realm martial artist to deal with him! “Mm… it seems that as long as you can get Lin Ming alone, then he will die. But how do you plan on creating the opportunity to kill Lin Ming? “Don’t worry about that, I have my ways. Let me ask you first, what relation does Qin Ziya have with Lin Ming?” “What kind of relation? Well, Qin Ziya thinks highly of Lin Ming and has high hopes for his future achievements. He thinks that he will be able to find a new friend and helper for the future. Soon, the Seven Profound Valleys will send down someone to take in the core disciples of the nearby Martial Houses. Qin Ziya is anxiously in a hurry to raise up Lin Ming. I believe he thinks that Lin Ming will be able to give a good performance at the Grand Tournament so that it will pave his way when he wants to be promoted to an elder in the future. “Although Qin Ziya highly regards Lin Ming, his movements are erratic and he likes to travel. He might not even come back to the Seven Profound Martial House once a year. In these past ten years, he has been walking through the deep valleys to cultivate his zither heart. It’s impossible for him to be constantly protecting Lin Ming, their relation is not that deep.” “Mm. Good, as long as Qin Ziya is not at the Seven Profound Martial House, then I have complete confidence.” Ouyang Dihua evilly grinned. It was as if Lin Ming’s life was already within his grasp. ……………. It was early in the morning and the sun had just risen up beyond the horizon and covered Zhou Mountain in a thin layer of morning dew. The withered fall leaves on the ground were already glazed with a bit of night frost. Lin Ming held the Heavy Profound Soft Spear in his hand, quietly feeling the power of the Flame Essence within the Heretical God Seed. After a period of time, his body suddenly moved and his fist struck the trunk of a large tree. There was a dull thumping sound as the sky began to rain withered leaves as they rustled like a whirlwind. Lin Ming shook the Heavy Profound Soft Spear, ‘Flowers in the Storm!’ There was only the sound of a spear piercing through the air. The Heavy Profound Soft Spear seemed to turn into a ghostly illusion and pierced all of the swirling leaves. After every leaf was pierced, a small amount of fire would be emitted and it would instantly burn the leaf into ash. Ever since the Heretical God Seed had undergone a minor transformation, Lin Ming hadn’t found any difference when he had revolved the ‘Heretical God Force’. It was only that there was a small fire attribute imbued into his true essence. There were a portion of martial artists whose true essence had a special attribute. For instance, Bai Jingyun’s true essence was of the water attribute. This was the reason she had paid a steep price to request Lin Ming draw up a water attribute inscription symbol for herself. The Flame Essence within the Heretical God Seed allowed Lin Ming to freely use the power of fire. Lin Ming had already expected this. After all, there were some refiners and alchemists who had subdued a Flame Essence and then were able to freely use the flame. These days, Lin Ming had been tempering his body’s true essence and ridding it of impurities. Every day he would stay in the Lava Cave for 5 to 6 hours. Today, the impurities within his body had finally been burned away. With the suppressive power of the Heretical God Seed, the seemingly violent and dangerous lava fire became very docile. Otherwise, there was no way he could have refined out the impurities in his body so quickly. The Heretical God Seed was now the size of a mung bean. It was impossible for the lava fire to meet the needs of the Heretical God Seed. Lin Ming put away the Heavy Profound Soft Spear in his spatial ring, and prepared to go to Thunder Valley. This idea had already been floating in his mind for several days. Thunder Valley was located in a valley at the back of a distant mountain. The entire mountain valley was filled with magnetic darksteel ore. Magnetic darksteel ore had a positive and a negative pole, so it was able to attract lightning from the sky and even store the power of lightning. It was a commonly used material in refining. Because of this, at every thunderstorm, there would be roaring sounds of rolling thunder, and then countless lightning bolts would fall into Thunder Valley. Looking from afar, it was just like purple snakes chaotically dancing, it was very spectacular. After the Seven Profound Martial House was established, a Xiantian master had created the array formation of Thunder Valley. Now, thunder and lightning would rain down unceasingly, and the array formation had enclosed the power of the thunder and lightning inside special chambers so that one could use it for cultivation. Thus it had become one of the seven major killing arrays; the thunder array! The thunder array was the most mysterious of the seven major killing arrays. Only those disciples in the top 20 rankings would dare enter. It was also quite different from the other six major killing arrays; Thunder Valley only had two difficulties, the eleventh and twelfth. In the seven major killing arrays, the twelfth level of difficulty was basically useless; not even Ling Sen could persist inside. This was especially true of Thunder Valley; the twelfth level of difficulty was completely abnormal. Not even a veteran Pulse Condensation Period martial artist would be able to stay inside for too long. This was the reason that Hong Xi had initially asked new disciples to not choose Thunder Valley. There was no need to mention the twelfth level of difficulty; even the eleventh level of difficulty had thunder and lightning that would be able to instantly char a martial artist at the Flesh Training stage. When Lin Ming arrived at the entrance of Thunder Valley, he could already hear the rumbling of thunder from within. “Junior Apprentice Brother Lin!” The Thunder Valley deacon senior apprentice brother stepped out from afar to greet Lin Ming. “Senior Apprentice Brother.” “This is the first time that Junior Apprentice Brother Lin has come to Thunder Valley. This Thunder Valley has a total 6 magnetic chambers. The first five are at the eleventh level of difficulty and the last is at the twelfth level of difficulty. Junior Apprentice Brother Lin may choose as he likes. But I recommend that you choose the eleventh level of difficulty. As for that last magnetic chamber, even a Pulse Condensation Period martial artist may not be able to withstand it.” “Mm. Thank you Senior Apprentice Brother.” Lin Ming had already decided that he would select the eleventh level of difficulty. He had even hoped for a lower degree of difficulty. A softer thunder would be easier to control, so as to avoid any random happenings like the Heretical God Seed exploding within him. Every magnetic chamber was 10 feet by 10 feet. The ground and walls of the magnetic chamber were completely formed from magnetic darksteel, and they shined with a deep blue light. Because the magnetic chamber was a completely enclosed space, the sound of the terrifying thunderclaps echoed in the room. If an ordinary person was to enter the room and be struck by these sound waves, their ears would bleed and their eardrums would rupture. It was even possible for low frequency waves to shatter their organs so they died a violent death right where they stood. The sound of this thunder had specific names. it was called tiger leopard thunder. This name was because when a tiger or leopard would growl or purr, if one placed a hand on their body, they could feel their arms vibrating. It was possible for one to borrow the power of this tiger leopard thunder to penetrate into the body and exercise the bones. This was why the bones of tigers were so formidable, and tiger-bone wine was the most nourishing. A sign of a martial artist reaching the Bone Forging stage was tiger leopard thunder. When they raised their head they could roar like a tiger, and when they lowered their head they could purr like a leopard. Before Lin Ming entered the magnetic chamber, he had already used true essence to seal off his ears. Purple lighting crazily danced through the air and on the walls of the magnetic chamber. The rumbling sounds of the thunderclaps were able to manifest into shockwaves. If one stood in such a shock wave, they would have a clear feeling of their heartbeat rising and the organs of their body being driven into motion by the low and deep sound waves. This kind of feeling was very uncomfortable. Even if one’s organs were protected by true essence, they would feel tightness in their chest and have difficulty breathing. This sort of low and deep sound wave was able to silently and invisibly kill people. This was because the frequency was too low for a person to hear it, but it would still dangerously resonate within the organs of a human body. Finally, a human could be split apart by this sound. Sssi-! A beam of electricity rushed towards Lin Ming like some sort of poisonous snake. The bolt of electricity moved at lightning speed, and before Lin Ming could react to this electric light, he already felt his entire body go numb. Like this, the energy of thunder had already entered into Lin Ming’s meridians. Lin Ming’s spirits immediately lifted. He carefully manipulated this electric light to flow towards his heart. Watching with his soul force, the electric light entered into the Heretical God Seed. Lin Ming immediately became tense. His soul force was linked to the Heretical God Seed, and he was carefully aware of every slight change of energy within the Heretical God Seed. If anything seemed amiss, Lin Ming was prepared to immediately extinguish this wisp of thunder with all of his strength. However, what really happened was that this wisp of electric thunder submerged into the Heretical God Seed like a heavy rock into the ocean, and there was simply no change. “Mm? Nothing happened.” When the power of lightning entered into the Heretical God Seed, it did not result in any change. So Lin Ming began to introduce more and more threads of thunder and lightning into his body, and the result was that all of it was absorbed by the Heretical God Seed. This had freed Lin Ming’s courage; he directly walked into a dancing electric snake. Lin Ming immediately felt his entire body go numb and the power of the lightning was like a gush of water that poured into his body. The power of lightning was a very mysterious power. Rumors said that lightning itself was the source of all life. In the ancient texts, during ancient times when the heavens and earth had just opened and the land began to stabilize, the sky would shine with countless shimmering clouds of thunder. This thundercloud had sent out lightning that had split apart the ancient oceans and resulted in the first life. It can be said that the only reason there was the flesh and blood of today was because of the lightning of the past. This was why the power of thunder and lightning was best to train the strength of one’s own body. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-158","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
