{"id":55544,"no":1599,"title":"MW Chapter 1594","content":"Chapter 1594 – Quiet Training\n …\n …\n …\n News of Lin Ming establishing his own divine runic arts room and an alchemy room soon spread throughout the entire Blue Moon Sect.\n This was extremely fresh and novel news. In the Asura Road, alchemists were not rare, but the occupation of divine runic master was considered a noble career throughout the entire Asura Road. Divine runic masters would only gather in peak great influences as well as large cities devoted to the divine runic arts like Divine Rune City.\n But to the Blue Moon Sect, these peak great influences were simply legends amongst legends; it was impossible for them to ever come into contact with them. As for Divine Rune City, only the most amazing elites of the Blue Moon Sect were able to enter; ordinary disciples wouldn’t even be able to step past the city gates.\n Thus, the occupation of divine runic master was something that the disciples of the Blue Moon Sect had only heard of but had never seen before. As they suddenly heard that a divine runic master had appeared in their sect, all of them ran over to Lin Ming’s residence to take a look and see just what a divine runic master looked like and what type of work they did.\n However, this disciple called Lin Ming didn’t seem willing to communicate with others. When the average person entered his residence he would actually remain in his alchemy room or divine runic arts room, tinkering with something, without any intention of coming out to greet guests.\n Even if he wasn’t refining pills or practicing divine runic arts, he would often be quietly meditating in his room. Or, he would sometimes be holding a blood red jade slip. This jade slip was extremely strange. It was far larger than an ordinary jade slip and had a very heavy and solemn appearance to it. It was unknown just what was recorded within it.\n This youth called Lin Ming would look at this jade slip every day. His straight eyebrows often rose up and wrinkled like he was puzzled. But sometimes he would have an extremely happy appearance as if he was suddenly enlightened.\n These actions left his visiting guests feeling awkward and embarrassed. Others asked Lin Ming how he had come into contact with the divine runic arts, what his divine runic arts level was, or whether he had a true divine runic arts master as his teacher. But, Lin Ming either remained silent or immersed in his blood red jade slip, without seeming as if he heard anything at all. This caused those disciples that were extremely interested in the divine runic arts to feel snubbed, as if they were making themselves unwelcome.\n There were many female disciples within the Blue Moon Sect. Many of these young girls were well known for their beauty within several hundred thousand or even millions of miles. However, no matter how outstanding their appearance or how amazing their talent was, they were all denied by Lin Ming.\n Slowly, no one came to visit Lin Ming anymore.\n And Lin Ming also began his quiet days of training.\n After practicing martial arts for so many years, Lin Ming had never been like he was today, truly settling down his mind and heart, not needing to think about matters or worrying every day. Instead, he calmly and peacefully trained.\n With Xiao Moxian, they were like an ordinary mortal couple. Every day was filled with ease and enjoyment.\n Here there were no battles, no dangers, no mystic realms that he had to risk his life in, and no people with dark intentions that coveted his treasures.\n Life and death dangers and slaughter battles were undoubtedly helpful for making breakthroughs in cultivation.\n But to practice the divine runic arts and accumulate cultivation, a peaceful environment was much more suitable. Many heroic young elites often spent several thousand years or even over 10,000 years to break into the Divine Lord realm.\n Of these thousands upon thousands of years, only a minor period of time would be spent searching for lucky chances and adventuring through dangers. Most of the time would be spent tempering one’s state of mind and accumulating one’s cultivation and consolidating one’s foundation. This was the life Lin Ming was living now.\n Although his cultivation progressed extremely slowly during this time, this was an essential process of walking down the road of martial arts. All martial artists had to experience it and Lin Ming was no exception.\n Spring became autumn and then back again. In the blink of an eye, a year had passed.\n If Lin Ming wasn’t practicing the divine runic arts or alchemy, he could be found with that blood red jade slip in his hands.\n This jade slip was the Nine Stars of the Dao Palace section of the Celestial Tyrant Manual.\n As Lin Ming was reading through this jade slip he didn’t conceal anything. This was because no one would be able to recognize anything about this jade slip to begin with.\n After diligently meditating for a year, Lin Ming gradually found clues about refining the Ravenous Wolf Heaven Pill.\n Of the Nine Stars of the Dao Palace, the second Dao Palace corresponded to the Ravenous Wolf Star.\n The Nine Stars of the Dao Palace, seven bright and two dark. They were – Ravenous Wolf, Titan Gate, Cherished Kismet, Merciful Song, Ardent Virtue, Martial Song, Army Breaker, Left Aide, and Right Support.\n The first Dao Palace that Lin Ming opened was the Purple Temple Dao Palace, corresponding to the Army Breaker Star.\n The function of the Purple Temple Dao Palace was to gather the power of the nine stars and massively increase the strength of Lin Ming’s astral essence. This sort of increase could enhance Lin Ming’s bodily strength by three or four times to eight or nine times. All of this depended on a martial artist’s own foundation and the degree to which they had opened the Nine Stars of the Dao Palace.\n As for the second Dao Palace, that was named Heavenly Retribution Dao Palace, and corresponded to the Ravenous Wolf Star.\n Lin Ming revolved his astral essence every day according to the Celestial Tyrant Manual. In addition to dual cultivating with Xiao Moxian, Lin Ming estimated that in another 20-30 years, he would finally reach the level where he could attempt to break into the Heavenly Retribution Dao Palace.\n And in these 20-30 years, Lin Ming had to bring his divine runic arts and alchemy up to the level where he could refine the Ravenous Wolf Heavenly Pill.\n Otherwise, if he spent an unimaginable amount of wealth and time to collect the materials for the Ravenous Wolf Heaven Pill but failed in refining it, that would truly be a hopelessness beyond crying.\n Although there seemed to be plenty of time with the opening of the final trial being 50 years from now, the truth was that time was of the essence. There were far too many matters for Lin Ming to process.\n Like this, a few more years passed. Lin Ming continuously practiced alchemy and the divine runic arts. The massive amount of materials he had purchased from Divine Rune City was slowly used up.\n His skill in the divine runic arts and alchemy also steadily increased.\n During this time, Lin Ming refined a mind-boggling amount of low level pills and divine runic symbols.\n Lin Ming’s soul force far surpassed that of others at his level. In addition to his understanding of the Asura Heavenly Dao, whether it was refining pills or drawing up divine runic symbols, he was much faster than the average person would be.\n However, even though Lin Ming had inherited the memories of three alchemists and divine runic masters, this didn’t mean his alchemy technique and divine runic arts technique was flawless.\n On this day, as Lin Ming was halfway through refining a furnace full of pills, there was a massive bang as the entire pill furnace exploded.\n Even though Lin Ming reacted extremely fast, half the room still collapsed. The carefully arranged alchemy room was also left in an utter mess.\n As a Divine Transformation outer court Elder of the Blue Moon Sect heard this news, he quickly went to personally check it out.\n He inspected Lin Ming’s body. Then, after making sure that Lin Ming was uninjured he gave him several words of advice. In short, he hinted that Lin Ming need not worry about such useless things and only needed to practice martial arts; that was the true, orthodox path.\n In the eyes of these numerous Elders, experimenting with alchemy and divine runic arts was simply a wasteful occupation where one idled their time away. This was because with Lin Ming’s current conditions it would be impossible for him to make any progress.\n Moreover, the divine runic arts had too high a requirement on a martial artist’s talent. Almost only spiritas martial artists were able to be divine runic masters. For a human martial artist to become a divine runic master, that was far, far, far too difficult.\n To put it rudely, it was the dreams of a fool.\n But Lin Ming didn’t heed the advice of the Elder and the Elder couldn’t force him. After all, if Lin Ming joined the Blue Moon Sect, he could also leave.\n If they wanted to retain the mind and hearts of people, they needed to give them more freedom.\n The Blue Moon Sect Elder sent a low level disciple to clean up the room. Soon, three outer court disciples came to Lin Ming’s residence to clean his room.\n These outer court disciples were in their teens and their cultivation was at the Pulse Condensation realm. They had just joined the Blue Moon Sect and had been chosen from the mortal world.\n In the Blue Moon Sect, their status was low. Although they were called outer court disciples, the truth was that they weren’t much different from maids.\n Lin Ming glanced at these three female disciples. All of them looked naïve and adorable, like lovely young girls.\n Lin Ming also knew that although these young girl disciples seemed to be living through many hardships, the truth was that their families were proud to have daughters who managed to pass the standards to join a large martial arts sect. The family and friends of these young girls were filled with pride and joy, and even the royalty of the mortal world had to show courtesy to their parents.\n This was the deterrence brought about by a martial arts sect!\n However, the road of martial arts was well known as being extremely rough and filled with bumps. Although the families of these young girls were living bright and glorious lives, who knew what would happen to their daughters in the end? Perhaps they might be abducted by others to become living furnaces, or perhaps after a little bit of success they would perish in a mystic realm, or perhaps they might even be murdered for their possessions…\n Thinking of this, Lin Ming lightly sighed. In the past when he first stepped onto the road of martial arts, he also suffered many difficulties.\n Seeing the three young girls giving their best to clean up the room, Lin Ming’s thoughts stirred. He waved his hand, beckoning them over.\n These young girls froze. Lin Ming was a core disciple and his cultivation had reached the late Divine Sea realm. To them, he was an impossibly lofty character. Their difference in status couldn’t even be described as clouds and mud.\n Moreover, Lin Ming’s manner was indifferent, and even when inner court disciples came to visit he still didn’t respond to them. Even those amazingly talented and beautiful senior-apprentice sisters had to eat closed doors when they tried to approach Lin Ming.\n But Lin Ming was actually calling them over. This made them all feel extremely flustered and flattered.\n They stepped over, a bit shy, a bit nervous. Lin Ming took out some bottles. The contents of these bottles were some of the pills that Lin Ming had refined over the past few years.\n As Lin Ming was practicing the divine runic arts and alchemy he had produced far too many pills and divine runic symbols. To Lin Ming, these things didn’t have any value at all. They weren’t even worth his time or effort selling them.\n However, throwing them away was also a pity. Thus, Lin Ming suddenly had the idea to give these things to others.\n This was also for the benefit of the Blue Moon Sect.\n After all, for these past years the Blue Moon Sect had treated him considerably well. After determining that Lin Ming’s background had no problems, the Elders of the Blue Moon Sect would send someone over to deliver pills, origin energy runes, and other such resources. To the Blue Moon Sect that could be called poor, these things were worth a good amount of wealth.\n These things were for the benefit of the inner court disciples. And because Lin Ming and Xiao Moxian had extremely high levels of talent, the benefits they received were higher than others’. But, Lin Ming also knew that he would have to eventually leave the Blue Moon Sect. If the Blue Moon Sect was depending on him to break through to the Divine Lord realm and become a pillar of the sect, they would be disappointed.\n Thus, Lin Ming decided to give away all of these pills and divine runic symbols that didn’t have much value to him to the disciples of the Blue Moon Sect.\n The Blue Moon Sect was a small sect to begin with and he didn’t fear arousing suspicions or causing waves by bringing out these items.\n It wouldn’t be an exaggeration to say that Lin Ming could raze a sect of this level to the ground with a single hand.\n “These are for you.” Lin Ming placed the bottles of pills in a jade box and passed it to the three Pulse Condensation realm outer court disciples. These disciples were lost in a daze, not sure what was in the jade box.\n And at this time, Lin Ming said, “Go and call your sisters here as well as the male disciples you know. Call all of them here together.”\n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1594","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
