{"id":55615,"no":1670,"title":"MW Chapter 1664","content":"Chapter 1664 – Receiving the Ravenous Wolf\\n\\n …\\n\\n …\\n\\n …\\n\\n Ka ka ka!\\n\\n The skies were shattered by Lin Ming and a terrifying explosive sound tore through space. The moment that Lin Ming broke the nine star dao diagram, a surging force came gushing out from it like a thick purple python that rumbled into Lin Ming’s body.\\n\\n As this strength entered Lin Ming’s body, it was like withered grasslands in a spell of drought finally receiving rainwater. In an instant, the massive blood vitality that he had used up was suddenly refilled by this strength. At the same time, a strange rhythm plunged into Lin Ming’s body, causing the runes that marked his flesh and bones to shine.\\n\\n But at this moment, in the battle between the endless black turtle death energy and the golden giants formed from the residual will and spiritual strength of the ancient bronze coffins, as they were fighting against the phantoms of Empyrean Divine Dream and Empyrean Primordius, that battle finally came to a conclusion.\\n\\n After all, the phantoms of Empyrean Primordius and Empyrean Divine Dream were only simulations created by the Heavenly Dao Laws; how could their strength be compared to true Empyreans?\\n\\n The two phantom Empyreans were finally savagely suppressed by the world momentum Lin Ming had borrowed from the black turtles and the ancient bronze coffins.\\n\\n In instant that the Empyreans phantoms were crushed apart, the Laws that formed them were also shattered.\\n\\n These Laws belonged to humanity’s body transformation system and could be called the Nine Star Heavenly Dao Laws.\\n\\n From an external appearance, the essence gathering system and body transformation Laws were highly different. The essence gathering system Laws were infinitely complex and diverse Heavenly Dao runes, but as for body transformation’s Nine Star Heavenly Dao Laws, they were like a roiling galaxy of stars. As starlight shined down, monstrous blood energy would cloud out the skies, filled with vibrant vitality!\\n\\n These Laws appeared to resemble the power of stars.\\n\\n At this time, the Ravenous Wolf Star above Lin Ming began to shine with an ever brighter light. The shattered half of the Heavenly Dao array diagram fiercely shook as a giant whirlpool of starlight appeared around it, seeming as if it would sweep up all the strength of these Laws back to where they were.\\n\\n “I don’t think so!”\\n\\n Lin Ming sneered. In order to attack the second Dao Palace he had made preparations for a long time. How could he allow the Nine Star Heavenly Dao array diagram to reabsorb the Laws and restore its strength?\\n\\n In the brief flash his fingers flew and lines of the Asura Heavenly Dao Laws flew out, creating a giant net.\\n\\n As this net appeared it began to absorb all of the surrounding spiritual energy, becoming increasingly solid and bright.\\n\\n The Nine Star Heavenly Dao Laws were one of the Laws of the 33 Heavens. But as for the Asura Heavenly Dao Laws, they did not belong to the 33 Heavens, but were a set of Laws that the Asura Road Master created himself. Even so, the Asura Heavenly Dao Laws were no weaker than the 33 Heaven Laws. After all, the Asura Road that was supported by the Asura Laws could stand on par with the 33 Heavens.\\n\\n The Asura Heavenly Dao instantly stopped the vortex that was caused by the nine star dao diagram.\\n\\n Lin Ming was like a flash of electricity as he plunged towards the shattered Nine Star Heavenly Dao Laws. All of the acupoints over his body opened and his mouth spread as he suddenly swallowed in this starlight.\\n\\n Xiu –\\n\\n It was like the galaxy was being sucked in. Lin Ming was pulling in the surroundings so hard that even space distorted. The absorption force was incredible.\\n\\n Immediately, the pure power of the Nine Star Heavenly Dao Laws was continuously swallowed into Lin Ming’s body.\\n\\n Bang –\\n\\n Lin Ming’s inflated body began to crack open once more.\\n\\n But this time blood didn’t shoot out. All that happened was his muscles and blood emitting a brilliant light. Within his body, on his bones, it was like stars had branded him, making him shine with splendor!\\n\\n The light of these stars held a deep and profound meaning. Behind Lin Ming, phantasmal specks of light wove into a river of stars that poured down behind him like a silver waterfall.\\n\\n Lin Ming’s body was immediately filled with vitality. Waves of blood energy surged within him.\\n\\n Currently, Lin Ming had yet to open the second Dao Palace. But just by swallowing a little bit of the strength from the Nine Stars Heavenly Dao Laws, this was incomparably better than swallowing spiritual medicines.\\n\\n As his strength wildly surged upwards, Lin Ming soared through the skies. His body emitted a blinding light as if he were the sun itself.\\n\\n His body seemed as if it would explode at any moment, but it remained extremely tough and tenacious throughout.\\n\\n Finally, the True Dragon blood within him shot into the heavens.\\n\\n The Heretical God Tree appeared behind him, a lifelike image nearly substantialized into reality. It towered high and lofty, a fire dragon and thunder dragon dancing atop the crown. They were the true meaning of thunder and fire that he had grasped.\\n\\n Waves of strength radiated out from the pores of his skin, causing ripples to spread through the void and even piercing through space.\\n\\n When the last of the Heavenly Dao’s vitality was swallowed up by Lin Ming, at this time, when he stepped forwards the sound of muffled thunder exploded through space. With another step, he shot upwards once again.\\n\\n In the blink of an eye, Lin Ming arrived in front of the dao diagram. The Purple Temple Dao Palace opened. He grasped the Phoenix Blood Spear, his strength revolving to the limit as he solidly smashed his spear into the cracked nine star dao diagram!\\n\\n The cracked nine star dao diagram violently trembled, like an iceberg on the verge of collapse.\\n\\n Sharp cracks appeared in the dao diagram, followed by a piercing sound. These sound waves condensed into reality, escaping into the real world where they slashed into the earth and left fissures thousands of miles long in the Forsaken Mortal Tomb.\\n\\n However, on that seemingly limitless dao diagram, a clear crack appeared, a deep ravine hundreds of miles deep.\\n\\n “Still not enough!”\\n\\n Lin Ming cried out, thrusting his spear forth once more. The True Dragon blood condensed into the shape of a True Dragon. Following this spear, it clawed towards the dao diagram, throwing itself at the crack.\\n\\n One strike –\\n\\n Two strikes –\\n\\n ….\\n\\n 1000 strikes –\\n\\n …\\n\\n All of Lin Ming’s bodily strength gushed out like an exploding volcano. In an instant, thousands and tens of thousands of spear strikes were thrust out, each spear puncturing the center of the dao diagram’s crack, constantly expanding it.\\n\\n The center of that crack was the epicenter of an earthquake. More and more ruptures spread out for thousands of miles in all directions.\\n\\n The entire dao diagram violently trembled, emitting loud creaking noises like shattering glass.\\n\\n Finally, explosive sounds echoed out from Lin Ming’s joints, and carrying winds manifested from the dragon energy around him. He hurtled towards the dao diagram.\\n\\n Traces of the Great Dao and the destroyed bits of starlight were fractured into even smaller spots of luminous light.\\n\\n Rumble! Rumble! Rumble! The entire dao diagram finally burst apart.\\n\\n Shimmering starlight leaked out from the cracks of the dao diagram, falling down in raging torrents. Massive pieces of it fell onto Lin Ming’s body.\\n\\n Lin Ming’s continuously shining body shined with an even brighter light, like a supernova, blinding to the eyes.\\n\\n His bodily strength began to climb and climb again.\\n\\n When the last wisp of starlight was absorbed into his body, Lin Ming was able to summon sounds of wind and thunder by raising his hand. The space around him constantly shook.\\n\\n With his increasing strength, his confidence also rose.\\n\\n In that moment, Lin Ming was confident that a punch of his would be able to tear apart the world, crushing all of existence.\\n\\n Even Xiao Moxian who was watching all of this from below felt frightened.\\n\\n Just by seeing Lin Ming’s body she felt an inexplicable feeling of dread – this was a dread against a powerful blood vitality that originated from her half God Beast bloodline.\\n\\n Of course, this was also because Xiao Moxian hadn’t undergone enough nirvanas. If Xiao Moxian were to complete nine nirvanas then she could easily achieve a terrifying boundary that surpassed an Empyrean.\\n\\n Lin Ming stepped in the void and with an explosive sound his figure flashed and disappeared. In an instant, he tore through the void, arriving in front of the glorious Ravenous Wolf Star!\\n\\n That incomparably massive Ravenous Wolf Star was only the size of a ruler now. It was like the Ravenous Wolf Star had sensed Lin Ming’s arrival and had hidden itself in the deep darkness.\\n\\n But with Lin Ming’s profound understanding of the Asura Heavenly Dao Laws, he was able to instantly perceive the Ravenous Wolf Star.\\n\\n Without looking, he thrust his hands into the void. Instantly, his hands felt as if they were submerged in roiling magma.\\n\\n What he touched in that moment was the core of the Ravenous Wolf Star.\\n\\n In that moment, even though his body surged with the power of life, he still felt the unusual aura within the Ravenous Wolf Star.\\n\\n He directly grasped this star and swallowed it into his body.\\n\\n Bang!\\n\\n It was like being submerged into an endless sea filled with violent clouds of thunder, like being dropped in infinite volcanoes, like falling into an impenetrable black hole…\\n\\n An incomparably powerful aura, one that carried with it boundless majesty and rage, one that caused the heart to race, suddenly submerged into Lin Ming’s body and exploded.\\n\\n The Ravenous Wolf Star, sly and cunning. At the same time, it also represented the Heavenly Retribution Dao Palace!\\n\\n This Dao Palace communicated with the world, casting down punishment on behalf of the heavens.\\n\\n Now, this punishment descended on Lin Ming.\\n\\n The Heretical God Tree phantom behind Lin Ming was whipped about by violent winds. The dragon phantom formed by the True Dragon blood was torn asunder by the black hole. The heavenly tribulation fire of the seven different true meanings was suffocated by the meaning of deep water of heavenly tribulation…\\n\\n The runes in his blood and flesh were attracted by the black hole and began to savagely break apart.\\n\\n Within Lin Ming’s body, everything turned chaotic. Even his soul force came under influence. As waves of heavenly retribution struck Lin Ming his blood vitality swelled up.\\n\\n This was the final meeting on their narrow path and the final revolt of the Ravenous Wolf Star. After coming this far, how could Lin Ming let all his efforts go to waste?\\n\\n Countless lines of the Asura Heavenly Dao laws were pulled up by Lin Ming’s soul force, thrusting into his body and rumbling into the midst of the power of heavenly retribution.\\n\\n Immediately, these Asura Heavenly Dao Law lines were like a giant net that trapped the beast, stubbornly stopping the final crazy attack of the Ravenous Wolf Star.\\n\\n Bang! The Ravenous Wolf Star exploded.\\n\\n Beneath the purest and most glorious starlight, black star-like runes were contained within. They melted into Lin Ming’s flesh and blood, fusing together with him.\\n\\n “This… this is a part of the Heavenly Dao Laws, representing the power of heavenly retribution, the true meaning of heavenly retribution…”\\n\\n Lin Ming’s entire body was immersed in pain but also a strange twinge of joyful pleasure.\\n\\n The Great Dao’s true meaning of heavenly tribulation; this made his soul shiver and his body quake in excitement.\\n\\n At the same time, the faint traces of pain began to spread throughout his body. This was the mark of the Great Dao entering his body, an impact that even caused pain to his divine soul.\\n\\n But with the passing of time, all of the power of starlight began to revolve in Lin Ming’s body, forming a mysterious and marvelous Dao Palace.\\n\\n This Dao Palace had a magnificent hall that shined with a blazing light. Within it, black energy filled the air and cracks of lightning whipped about. There were even waves of horrifying fire, burning so hot it seemed that they could burn down the universe.\\n\\n This extreme majesty represented the punishment of the Heavenly Dao. It connected together with Lin Ming’s flesh and blood foundation and even his divine soul.\\n\\n This allowed Lin Ming to feel a powerful aura. All of those black runes in his flesh and blood began to sparkle, resonating with him.\\n\\n The Heavenly Retribution Dao Palace had finally opened!\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1664","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
