{"id":55618,"no":1673,"title":"MW Chapter 1667","content":"Chapter 1667 – Soul Empress Sheng Mei … … … In an endless sea of clouds, a deep blue palace floated. This palace was like a crystal sculpture and its walls were inlaid with rows of soul crystals. These soul crystals were similar to nine sun jades in value. To the spiritas, they were extremely luxurious cultivation goods. But now, just on the outer walls of this palace, there were tens of thousands of them. Just by walking in this soul crystal palace, one could feel a rich soul origin energy spreading out in all directions. Even if a mortal with no martial talent were to live here, they would slowly be nourished by the energy of the soul crystals and transform into someone with an incredible soul force. Their thoughts would be quick, their memory photographic, and their words wise. At this time, within this Soul Palace, there was another world. This world wasn’t solemn and dignified, but a lush green paradise with spirit trees wildly growing everywhere and with flowers in full bloom. Rivers of water fell down celestial mountains in waterfalls, like hundreds of thousands of threads of white silk. Even spiritual birds and beasts flew through the air and ran on the ground, their calls delightful to the ears. In a peach garden within this paradise, a blue-clothed woman stepped on the wind. Beside her was a blue phoenix. This blue phoenix had already shrunk to 100 feet long and its entire body burned with blue flames. One didn’t feel a burning heat from these flames. Rather, as one approached it, they would feel their soul freezing. This sort of blue flame was called deep blue ice flames, a terrifying fire no weaker than Xiao Moxian’s nirvanic flames. They were flames exclusive to the phoenix race. Nirvanic flames were possessed by the Fire Phoenixes whereas deep blue ice flames were possessed by the Ice Phoenixes. This deep blue ice flame was incomparably terrifying. Moreover, this blue phoenix was nearly grown up and its bloodline was part of the phoenix race’s royalty. If a martial artist were to approach the flames on its body, their body would be frozen into an ice sculpture by the terrifying cold even as their soul was burned by the flames and turned to ashes. As this floating blue-clothed woman stepped into this otherworldly paradise, four young beautiful girls wearing veils and standing gracefully bowed to her. These young girls didn’t know the status of this blue-clothed woman, but if Soul Emperor Divine Void were to personally welcome her in Divine Void Heavenly Palace, then her status could be imagined! Many maids in Divine Void Heavenly Palace were secretly speculating on who this blue-clothed woman was. Many of them believed that someone who was taken so seriously by Soul Emperor Divine Void might have the chance of being a True Divinity level existence. However, within the entire Asura Road, spiritas True Divinities were unfathomably rare. Moreover, these rare people only included a few amongst their numbers. And, if one looked beyond Soul Emperor Divine Void, all of the other characters were nothing more than legends. Some of these people had legends tracing back a billion years, and now these people had likely died. Not just that, but even their legends were unreliable. It was unknown whether these people were truly True Divinities or not. But, as everyone considered all the legends they knew of every single spiritas True Divinity to exist, none of them matched this blue-clothed woman. This woman resembled someone that was 17 or 18 years old. It was hard to imagine that someone so youthful could be a True Divinity. Walking alone, all maids within Divine Void Heavenly Palace fell to their knees. Among these people there were even high level figures of Divine Void Heavenly Palace. But, even Great World King powerhouses had to bow before this woman. “This woman, just who is she?” After this blue-clothed woman walked past, the Vice Internal Affairs Envoy of Divine Void Heavenly Palace asked with a sound transmission. “I have no idea… she might be a True Divinity, right? At the very least she should be an extreme Empyrean!” “Impossible. I could feel that she is only at the early Empyrean realm. The only possibility is if she is hiding her cultivation and only then would she have the chance of being at the True Divinity realm. But, I don’t think a True Divinity would do something so boring as hiding their cultivation in front of us.” Although the blue-clothed woman had a mysterious status she didn’t hide her soul sea. It wasn’t difficult for those at the World King realm or above to see her cultivation boundary. But this boundary of just barely having entered the Empyrean realm, that left everyone puzzled. How could a low level Empyrean possibly receive such a courteous reception from Soul Emperor Divine Void? As everyone was discussing with sound transmissions, the blue-clothed woman continued forwards. The entire ground was covered with a spring that shined like diamonds. Water trickled out and flowers bloomed. The blue-clothed woman went straight to the deepest parts of the palace. Here, a white-clothed middle-aged man was already waiting. This man was handsome, with skin as fair as gems. He wore his hair up and adorned with a star crown. His eyebrows were smooth and gentle and his hands were slender and filled with power. All of the energy within him was gathered tight without any being leaked out. From appearances, he seemed like a poor scholar of the mortal world. However, with every step he took, every flower and tree in this world, all the birds, and spirit beasts would look towards this man with awe in their eyes as if they saw their own sovereign king. Wherever this man went, flowers would bend over, birds would land, and spirit beasts would kneel! This man was the master of Divine Void Divine Kingdom and within the Asura Road, disregarding the legendary existences that may or may not exist, he was the sole spiritas True Divinity supreme elder known by all! Because of this he was titled the Soul Emperor of the Asura Road. This meant that he was the number one existence amongst all spiritas that lived in the Asura Road! “Sheng Mei…” The man turned around, looking at the blue-clothed woman moving slowly towards him. His eyes flashed with a brilliant light. “It seems your Grand Reincarnation Art has already reached the sixth revolution. As long as you have enough time you’ll reach perfection of the sixth revolution sooner or later…” The blue-clothed woman remained silent. Sheng Mei was her name, but she also had a title – that was, Soul Empress Sheng Mei! However, Soul Empress Sheng Mei did not come from the Asura Road, but came from the 33 Heavens! “Six revolutions isn’t difficult. What is difficult is the final three revolutions, the seventh, eighth, and ninth…” Sheng Mei’s voice was calm and her expression placid. “Haha! Six revolutions isn’t difficult?” The man shook his head as he laughed. “Only you would dare to say such words. Once you complete your nine revolutions and your deep blue ice phoenix completes its nine nirvanas, I fear that within the great heavens and earth, there won’t be a single person that can hinder your step!” Soul Emperor Divine Void gave Sheng Mei an incredibly high evaluation. However, Sheng Mei only lightly sighed, as if there was some knot she couldn’t untie in her heart. She didn’t reveal any joy at the grand future that Soul Emperor Divine Void painted for her. Soul Emperor Divine Void’s heart moved and he seemed to realize something. He hesitated for a moment and then said with a gentle cajoling tone, “Sheng Mei, I’ve never understood something. With your talent and ability, why do you place yourself under the yoke of that person, helping that old geezer who has already lived for several hundreds of millions of years? You can absolutely establish your own sect. If you and I join together, then by relying on our strength, ruling over the entire 33 Heavens won\u0027t be difficult at all!” Soul Emperor Divine Void had great ambitions. This wasn’t the first time that he had said such words to Soul Empress Sheng Mei. Towards Soul Empress Sheng Mei he felt a great deal of admiration and respect. There was even… adoration and desire! When Soul Emperor Divine Void was young he had indulged in his carnal nature before. But after stepping into the True Divinity realm, there was no woman that was able to enter his eyes. Right now, within his harem, there was not a single person left. If there was a person that could draw the admiration of someone as proud and arrogant as Soul Emperor Divine Void, that person’s perfection and magnificence could be imagined. However, in front of Sheng Mei, Soul Emperor Divine Void had never revealed any of this to her. He was well aware that wanting to pursue Soul Empress Sheng Mei was impossibility difficult. She was someone whose heart was higher than the heavens, and wanting to intrude on her life wasn’t easy. Even the ‘old geezer’ who Soul Emperor Divine Void referred to was only someone that Sheng Mei assisted; they were in no way dual cultivation companions. It was just that Soul Emperor Divine Void was confused this entire time. Why was someone so proud like Soul Empress Sheng Mei assisting some old fellow who was over a hundred times older than she was? “I need… three spots.” Sheng Mei suddenly said. The reason she came to Divine Void Heavenly Palace this time was for these three spots. “Spots for the final trial? Although these spots are precious, to me, giving away a few isn’t difficult at all. If you ask then let alone three, I can even give you 10! The only thing I don’t like is that after you increase your strength, you will still desperately work for that old thing…” Soul Emperor Divine Void’s voice was indifferent. In such a scene, anyone else would have felt uncomfortable. Sheng Mei was silent for a moment. After several breaths of time, she emotionlessly said, “Even without you, I can still obtain spots for the final trial. It would only be much more difficult. For these three spots, I can provide you with adequate rewards. If you still refuse then I can only bid my farewells.” Even if Sheng Mei needed help, her tone still wouldn’t be that of defeat. Soul Emperor Divine Void reluctantly shook his head, saying, “Fine, then there’s nothing I can do… three spots, I’ll give them to you. Are these three spots to help you prepare for the completion of the sixth revolution?” “Yes…” Sheng Mei’s cultivation method, the Grand Reincarnation Art, was unique and special. Every revolution of the Grand Reincarnation Art was to live a new life, starting from zero. After reincarnating, her cultivation boundary would drop by several large realms. Then, she would have to re-cultivate! This sort of cultivation method could not be practiced unless one was a peerless genius. It required that one have a cultivation speed at least 10 times that of an ordinary genius. Otherwise, if one’s cultivation speed couldn’t keep up, there would be a situation in which their boundary would actually drop lower overall. “If you can complete the sixth revolution, then your talent, foundation, and accumulation of Laws will reach an unimaginable boundary… in the past, you created a record with an 83% completion rate, even surpassing the saint race’s Good Fortune Saint Son, Wumo, and becoming the highest completion percent that the entire 33 Heavens and Asura Road have seen in the last 100 million years! “This time, I fear you will shatter your own record. Perhaps… you can achieve 90%?” Soul Emperor Divine Void smiled, shaking his head. Every time Soul Empress Sheng Mei reincarnated, her talent would gather and increase! This sort of freakish cultivation method originated from only the heavens knew where. Perhaps even the Asura Road Master hadn’t anticipated such a situation when he created the final trial. Soul Emperor Divine Void had some faint speculations on where this Grand Reincarnation Art came from, but he couldn’t confirm his suspicions. “90?” Sheng Mei’s eyebrows shot up. She calmly shook her head. “How could I achieve 90% completion… that is a number that only exists in legends. Let alone the sixth revolution, I doubt I will achieve that even at the seventh revolution. I suspect that ever since the Asura Road smelting trial appeared, no one has ever managed to break through this number 90. My goal this time is only 85 or 86%...” Sheng Mei’s tone was bleak and indifferent. Soul Emperor Divine Void gently chuckled. “Even an 85% completion rate is unprecedented. There is no one that can match you in the past and no one that will surpass you in the future!” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1667","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
