{"id":55624,"no":1679,"title":"MW Chapter 1673","content":"Chapter 1673 – Completion Percent … … … At this time, in front of Lin Ming and his group, four dark gold skeletons appeared. Each skeleton was filled with a tyrannical and horrifying aura. The void of their sockets shined with a dark reddish black light and they held blood-rusted bone knives in their hands. With a simple slash, even the void was split asunder. A space storm formed, sweeping towards Fanny Fafa. This sudden change caught Fanny Fafa by surprise. He released countless milky white threads of spiritual strength that condensed in the air like iron, forming layers and layers around his body. Clang! Clang! Clang! The barrier of spiritual strength collided with these bone knives that had torn apart space. A grating metallic sound filled the air as sparks flew out. At this time, Lin Ming’s figure flushed forwards. With a rumbling sound his fist crashed into the skull of one of the skeletons. After breaking into the Heavenly Retribution Dao Palace, a single wave of his hand could summon 10 billion jins of strength. Even an ancient vicious beast would have been ripped asunder. Dong - ! As the fist came crashing down, the air blocking its path was squeezed so hard that it became like iron, solidly forming a column of air. The incomparably tough bones shattered like tofu. Soon after, a second fist came smashing out, even extinguishing the dark ruby flames in the sockets of the skeleton. Soon after, the Phoenix Blood Spear came thrusting out. In the blink of an eye, thousands upon thousands of spear strikes pierced out, each spear bringing with it enough strength to crush a planet. The bones they struck were directly blown away. At this time, Mo Brightmoon also attacked. Her fingers waved and a strange crescent moon-shaped rune appeared atop her fingertips. The rune slashed out into the wind, breaking through the void, the enormous pressure imprisoning a skeleton. With a loud shout, the crescent moon rune shined with an incandescent brilliance. The sharp blade of the rune tore through the skeleton, the slicing maelstrom of energy turning it into powder. Thousand Slaughter’s figure flashed and he disappeared like gods and ghosts, immediately reappearing behind another skeleton warrior. His golden saber was able to find the weakness of the skeleton warriors in a single stroke – the little wisp of will hidden deep in its body. The deep black aura of a taotie sparked and an immense swallowing force spread out, swallowing up that wisp of will. The skeleton warrior’s body immediately disintegrated, vanishing into the wind. The entire process lasted only several breaths of time. The four skeleton warriors were destroyed and the space in front of the group began to peel apart, breaking down. Jet black runes began to scatter out. Those distant mountain peaks and the raging black rivers all vanished from sight. The surroundings also began to dim down. The boundless death energy and cold yin energy around them suddenly surrounded them from all directions. Beneath their feet, they were stepping on seals designed in the images of different kinds of vicious beast, some of them still glowing with a strange and fantastic light. The entire atmosphere became grim and gloomy. “This sort of place…” Looking at the pitch black darkness in front of them that seemed to have no end, Xiao Moxian immediately lit a little flame. Light spread out, scattering all the shadows. Everyone was startled. They could see that in front of them was a vast tunnel extending to forever, one with scattered skeletons lying all around it. Each skeleton glowed with its own color. Some were dark gold and some were purple gold. The purer gold-colored the skeletons, the thicker the death energy emanating from them. “This should be an ancient grave…” Lin Ming slowly said as he looked at the various sacrificial patterns engraved upon the walls. “Those mountain peaks and rivers, they should have been an illusion…” Fanny Fafa frowned; he had been completely unable to see through the illusion. Luckily, the golden skeletons weren’t too strong. If they were comparable to a World King, then the battle just now would have been dangerous. “There are hidden spatial array formations everywhere – do not act rashly. A moment ago, you touched an array formation that transmitted us here.” Lin Ming calmly judged the situation. Now, he finally knew why he had a restless feeling ever since he arrived. This was because he discovered that everywhere here vaguely conformed to the Asura Heavenly Dao Laws. Moreover, he didn’t understand many of the Laws here. These Laws were closely related to the array formations arranged all over this place. If they were even slightly touched, there would be tremendous problems. Everyone felt a chill crawl up their backs as they heard Lin Ming speak. If there were array formation traps everywhere then they had to be especially careful as they walked forwards. However, the Lin Ming standing in front of them seemed to have some strange ability to sense these array formations, as if he had some safeguard against them… Fanny Fafa and Thousand Slaughter couldn’t help but look towards Lin Ming. Although they didn’t want to admit it, they had to. This young divine runic master who invented the ‘Lin’ divine runic symbols was far different from any other divine runic master they had encountered. “Follow close behind me and pay careful attention to my steps. This array formation… I’ve seen it in an ancient text before…” Lin Ming thoughtlessly came up with a reason. Although the others felt that this so-called ‘ancient text’ that Lin Ming spoke of was a bit odd, at this time they had no reason to doubt him. Sensing the strange array formation rules around him and also fusing in the power of the Asura Heavenly Dao and the power of illusions, Lin Ming led the way for the group. After all, his comprehensions of the Asura Heavenly Dao Laws became increasingly profound with every year. Using these comprehensions he was able to break through some of these array formation traps. Thousand Slaughter followed close behind Lin Ming, maintaining full vigilance of his surroundings even as he guarded Lin Ming’s rear. In this final trial, only perfect cooperation would allow them to go further. Mo Brightmoon was originally an outstanding killer. A crescent moon-shaped ring appeared on her hand, sparkling with light and emitting traces of spiritual energy that seemed to cut through the void. It was clear that this was a powerful spirit treasure. As the group followed close behind Lin Ming, they carefully made their way through the tunnel. As they walked forwards, by relying on Lin Ming’s exceptional senses, they were able to discover and avoid several strange space traps. The pitch black and gloomy road was filled with a pervasive death energy that lingered about. In the tunnel, the fierce cracks and bloodstains covered the walls. The bloodstains had already dried up and were difficult to discern. It was clear that they had originated from countless years ago. It was unknown just how many times fierce life or death battles had been fought in this tunnel. Kacha – After some time, at a wall in front of them not too far away, an unusual sound echoed out. There was an extremely strange image on this wall. The image was painted with a special kind of liquid and was over 30 feet tall. The image showed several demonic beings, all of them with two horns and cruel crimson fangs. This was an image of man-eating fierce ghosts. Although this was a mere painting, Lin Ming didn’t know why but he felt the crimson-eyed fierce ghosts were looking at them, their eyes blazing with green. “Sir Lin?” Fanny Fafa suddenly asked. Lin Ming thought for a moment, looking at the fierce ghost drawing in front of him. The Asura Road Master’s methods were beyond mortal comprehension. In this final trial, any strange and unusual matter could occur. Lin Ming and Fanny Fafa could both feel something off with the painting. And as they were looking carefully at it, the panting began to slowly move towards them. It drew closer and closer. Everyone raised their guard. Puff! Puff! Suddenly, a terrifying black energy burst out from the fierce ghost drawing. Then, the group of demonic fierce ghosts actually leapt out from the drawing. The air was immediately filled with the thick and pungent scent of blood. At this time, from the walls around and above them… fierce ghosts popped out from all directions, immediately surrounding Lin Ming, Mo Brightmoon, and everyone else. Originally they thought there were only several fierce ghosts but there were actually far more than they imagined. Moreover, the way they hid themselves surprised Lin Ming. Of course, this was only surprise. The power of the Heretical God Tree began to crazily swell up from within Lin Ming. A bolt of lightning shot out from Lin Ming’s palm, rumbling into the fierce ghosts and blowing up a good number of them. At this time, the crescent moon ring on Mo Brightmoon’s hand also emitted a brilliant cyan light. Each beam of cyan light emitted crackling sounds in the air. As they struck the fierce ghosts, they emitted heaven-shaking explosive sounds. Fanny Fafa flung his voluminous sleeves forwards. Like a sharp blade, a beam of energy cleaved ahead, sweeping out. As this beam of energy struck the fierce ghosts they were cut in half… After a moment of chaos, the tunnel was suddenly peaceful. The drawing of fierce ghosts and the blood red lights in their eyes had dimmed down. “Let’s go.” Lin Ming rushed ahead, deeper into the tunnel. Along the way, the group encountered several more waves of danger. But before each battle, Lin Ming was always able to sense it happening and would promptly warn the group. All of these traps and hidden attacks that were originally impossible to guard against suddenly became far less dangerous. And, the power of these sneak attacks was inferior to the squad of five. None of them thought that there were any difficulties in the first level of the trial. But, what they didn’t know was that in other places, there were some weaker squads that were finding it extremely difficult to move forwards. They were given headaches by the illusion array formations here, and some of them had even suffered casualties. Hu - ! After chopping down a giant-sized bloated corpse, Lin Ming’s palms tingled with numbness. Beside him, Thousand Slaughter and Fanny Fafa were also gasping for breath in great heaving gulps. They moved forward faster and faster, and the things they met became increasingly dangerous. Just now they finished dealing with a wave of corpses summoned by an array formation. This attack nearly caused some of them to be injured. However, luckily Lin Ming’s body was incredibly tough and Fanny Fafa also had a strange supernatural talent that allowed him to imprison his opponents with spiritual power. With these two abilities, it became much easier for them to deal with these brainless corpses. Woong – Woong – Woong – Suddenly, the sound of crashing tides appeared from not too far away. Everyone look forwards to see a black vortex of energy appear in front of them, just like when they first entered the final trial. As everyone saw this they were overjoyed. This must be the entrance leading from the first level to the second level! Everyone quickly leapt forwards. Within this vortex of energy, there was also a wild flow of energy. But with the experiences of the past, none of them were affected at all by it. As the waves of energy flowed over Lin Ming, he felt something strange in his mind. Final trial, completion rate – 20% Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1673","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
