{"id":55634,"no":1689,"title":"MW Chapter 1683","content":"Chapter 1683 – Trial of Laws … … … Lin Ming had slowly studied alchemy over a period of dozens of years, and had some knowledge of rare materials that came from spiritual lands. As he sniffed the air, he could smell that the liquid flowing out from the frost giant’s lips was nine yin ice marrow, an extremely precious alchemy material. Was this frost giant formed from nine yin ice marrow? Before Lin Ming could finish his thoughts, the frost giant rushed forwards like a wild beast. All over its ghostly skin, snow-white runes began to appear like drifting snowflakes falling atop its body. Every rune shined, emitting bursts of the power of ice and snow that left the heart racing. The frost giant punched out again and again at the earth. With every strike, the ice runes on its body would pierce through the ground like the roots of a tree, beginning to spread through the frozen earth, constantly expanding… Just as Lin Ming realized what was happening, there were movements beneath his feet. A massive ice spike broke through the ground and shot towards Lin Ming. Lin Ming was startled. He flipped himself over, easily dodging this ice spike. Woosh! Woosh! Woosh! Numerous dense ice spikes shot out from the ground, shooting through the void and chasing him as if they were manipulated by countless hands. Every ice spike was covered with shining ice runes. These ice spikes blocked all the surrounding space, giving Lin Ming no chance to evade! Seeing so many ice spikes chasing after him, Lin Ming grit his teeth and the grandmist space erupted out from his body. The star-heavy grandmist energy overwhelmed all! Ka ka ka! A massive number of ice spikes exploded within the grandmist space. However, pieces of the broken ice spikes still thrust into Lin Ming’s body! Blood rained into the air! This battle was abnormally brutal! As the frost giant saw that Lin Ming was wounded, an icy light shined in its eyes. It stepped forwards, wanting to tear Lin Ming to pieces. But at this time its body stiffened. It looked down with incredulity towards its chest. At its chest, at the area where Lin Ming’s last spear strike had created a crack in the armor, there was a massive wound. A black-clothed martial artist had sneak attacked it and thrust a spear through its chest! Ka ka ka! Countless shards of ice burst to pieces. The black-clothed martial artist’s spear was unstoppable! Billions of jins of strength pushed forwards, tearing open that impossibly hard ice armor and piercing all the way through the back! “Roarr!” The frost giant pitifully cried out, its large body shaking in the air. The one who sneak attacked it was a black-clothed martial artist completely similar to Lin Ming in appearance; it was Lin Ming’s avatar, the Essence Spirit Embryo Stone! Within the rules of this mystic realm, no external items could be used. But, this Essence Spirit Embryo Stone wasn’t counted among these objects and was considered a part of Lin Ming’s natural combat strength, allowing him to summon it at will. A moment before now, while Lin Ming’s true self was attacking the frost giant, the Essence Spirit Embryo Stone was lying in wait, waiting to strike at the frost giant’s weak point and bring it down in a single strike! Rumble rumble rumble! Chunks of ice fell to the earth. From within the disintegrating body of the frost giant, a rich aura of Ice Laws began to pour out. However, Lin Ming didn’t cultivate the Ice Laws. Even if he tried to perceive it, he still wouldn’t obtain any good harvests. Lin Ming wasn’t interested in these Ice Laws. Rather, he looked at the pile of scattered ice chunks and reached out his hand. With a wave, he grasped at the void and grabbed onto a mass of thick milky white liquid, as if it were milk from 10,000 year stalactites. Then, without further ado, Lin Ming swallowed it all down! This was the nine yin ice marrow that was contained within the frost giant. Swallowing it down like this could be called a waste of heaven’s resources. If it were used in alchemy, the results would be much better. But Lin Ming had no choice. He had to rapidly restore his strength and there was no time for him to rest. In this situation, he definitely wouldn’t let go of this nine yin ice marrow. At this time, with a loud rumbling sound, the silver door that Lin Ming just entered began to slowly dim down and fade away. As Lin Ming blinked, he had once again returned to the ancient continent. In front of him, countless numbers of golden gates stood once more! In just several breaths of time, with a creaking sound, another gate turned silver and began to rumble open in front of him! Past the entrance of this gate, another completely different world appeared. Here, green trees towered to the skies, filled with vibrantly lush tones and vitality. But, this vivid vitality also contained a wild killing intent. “The second gate…” Lin Ming took a deep breath. His body was still dripping blood. And because he just had just eaten the nine yin ice marrow, a terrifying cold energy was still recklessly surging through his body. He hadn’t had enough time to absorb it all. And now, a new gate had opened before him. Lin Ming knew that he would have to face another battle! Without a doubt, from all the golden gates atop this floating ancient continent, he would have to battle through every one that turned silver! And, he was afraid that he wouldn’t be given any time to rest at all. This would be an arduous and difficult protracted battle! And within each gate, the Laws contained inside were different. Whether it was the elemental Laws of metal, wood, water, fire, earth, thunder, or wind, or perhaps the Laws of Yin and Yang, the Laws of the divine soul, the Laws of body transformation, God Beasts, Nine Stars, divine runes, every Law possible was contained here. These were fully comprehensive Gates of Laws! The Laws here were not just the Asura Laws, but all the Laws within the 33 Heavens. Thus, this was why the gate leading from the second level to the third level was called the Gate of Laws! To fight here was not just a test of a trial challenger, but also a lucky chance. By passing through battles of these different Laws, one could temper their own cultivation and comprehensions. If an unrivalled genius were to fight here, they would become stronger with every successive battle! This required that a trial challenger have formidable strength, rich combat experience, infinite endurance, and a monstrous comprehension of the Laws. Moreover, it required that a trial challenger have exceptional perception where they could constantly perceive and absorb what was happening during battle. Only with all of this could one pass this test! As Lin Ming fought to here, he could faintly feel the difficulty in this trial slowly increasing. If he couldn’t adapt to this increasing difficulty then he would sooner or later be eliminated. The world of Laws didn’t give Lin Ming a chance to rest. A blue light shot out from the silver gate, wrapping him within and sucking him inside. Past this gate was a vast primitive jungle. Any casual tree was as thick as dozens of people and a thousand of feet high! A blue flood dragon circled above the crown of a 1000 foot high great tree, its greedy eyes locked onto Lin Ming! Lin Ming wiped the blood from the corners of his mouth, a brilliant fighting intent flashing in his eyes. “Roar!!” The blue flood dragon roared and came hurtling towards Lin Ming! Lin Ming’s thoughts focused. Atop his head, the phantoms of nine celestial stars hung high in the skies. A grand and magnificent Heavenly Retribution Dao Palace floated within the sea of Lin Ming’s inner world. In the midst of this Dao Palace, the power of heavenly retribution contained within the myriad beings in existence sparked to life. There was crackling thunder, blazing heavenly fire, and even the icy yin chill of the nether world… “Momentum of the world, gather unto my body!” Lin Ming growled. The Heavenly Retribution Dao Palace suddenly rose up in the space of Lin Ming’s inner world, spanning through the heavens and earth, emitting brilliant beams of radiance. For a time, with the Heavenly Retribution Dao Palace as the medium, the power of the heavens and earth poured into Lin Ming’s mortal body! The Heavenly Retribution Dao Palace was able to connect to the momentum of the world and wield the power of heavenly retribution. Within the small universe that was a person’s body, it was able to correspond with the true, boundless universe, communing with the heavens and earth, allowing a martial artist to become one with the world. When this Dao Palace opened to the extreme and displayed its true potential, the heavens would rain blood, the earth would shatter, the void would tear apart, and even gods and ghosts would cry! In that moment, Lin Ming felt his strength erupt to the limits. Starlight from the highest nine heavens gathered into Lin Ming’s inner world, carrying with it a heavy and titanic potential as it went slashing towards the blue flood dragon, suppressing it. The ultimate death energy contained within the Heavenly Retribution Dao Palace, the symbol of heaven’s punishment, was like the ultimate poison as it invaded the life-filled aura of the blue flood dragon. Rumble rumble rumble! The blue flood dragon’s body slowed as it faced a grave situation. The vigorous life-force energy it erupted with had been stopped and suppressed. This blue flood dragon was like a sly fish, leaping up and around, searching for openings, wanting to swim against this river of energy and attack Lin Ming! However, Lin Ming had passed through innumerable fights before. How could he give this blue flood dragon any chances to do that? In a battle, if Lin Ming found the method to seize the flow of battle and defeat his enemy, he absolutely wouldn’t let them go. With a loud shout, all of his true essence crazily revolved. His two hands flashed, forming countless seals that carried with them the aura of the Asura Heavenly Dao Laws, all of them hurtling towards the blue flood dragon. Myriad Demon Karmic Wheel! Whorl whorl whorl whorl – A dense and thick death energy turned into a black vortex that went crashing into the blue flood dragon. The blue flood dragon had already been unable to handle the power of heavenly retribution. In this situation, it had been smashed into by the Myriad Demon Karmic Wheel. The Myriad Demon Karmic Wheel was refined with the spirits of evil ghosts and demon kings. It was a gathering of extreme yin energy and slaughter energy. It was a power that suppressed the blue flood dragon’s wood-attribute life aura to the extreme. Moreover, the Myriad Demon Karmic Wheel originated from the Asura Sutra. It was one of Lin Ming’s strongest attacks! Immediately, beneath the dual barrage of the Heavenly Retribution Dao Palace and the Myriad Demon Karmic Wheel, the blue flood dragon howled in pain again and again. Its radiant blue body dimmed as it wildly struggled! Xiu! Lin Ming took this chance to hurtle forwards along with the Essence Spirit Embryo Stone. In tandem, two spears thrust into the blue flood dragon! Puff! Spear light exploded. The blue flood dragon was nearly ripped in half by Lin Ming’s attack. Its blood rained to the earth! Within the hail of rain that covered the world, Lin Ming grabbed onto a bright blue flood dragon gallbladder. This fist-sized blue flood dragon gallbladder wildly beat like a living heart. Without hesitation, Lin Ming swallowed this blue flood dragon gallbladder. This battle was too brutal. He had to find some way to sustain himself through these battles, otherwise even with his endurance he still wouldn’t be able to last much longer. As the blue flood dragon gallbladder entered his stomach, it turned into a rich and pure wood-attribute origin energy that flooded his body, revitalizing him. This blue flood dragon was not a true flood dragon, but one that was manifested from a wooden spirit root. This blue flood dragon gallbladder wasn’t a true blue flood dragon gallbladder either, but the essence of the wooden spirit root. Now, the essence of the wooden spirit root had been eaten up by Lin Ming. As Lin Ming was engaged in a series of brutal battles, Xiao Moxian and Soul Empress Sheng Mei, who had both chosen the heaven-step difficulty, were also engaged in fierce combat. The Gate of Laws contained every Law within the 33 Great Daos. Every Law condensed into an enemy and in order to pass through the trial, one had to strike down every opponent. Xiao Moxian was younger than Lin Ming thus her difficulty was a bit lower. The enemies she faced were naturally much weaker than the ones Lin Ming faced. But Sheng Mei was different. Although she had chosen a lower difficulty, because of her skeletal age, the enemies she had to face were dozens or hundreds of times stronger than Lin Ming’s opponents! In Sheng Mei’s trial, every time she fought, the void would shatter and the earth would shake! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1683","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
