{"id":55679,"no":1734,"title":"MW Chapter 1726","content":"Chapter 1726 – Lin Ming Makes His Move … … … Facing this terrifying attack, Suya, Mo Brightmoon, and the others had already lost their use. As long as they took a single step outside of the Umbral Heaven Ice Array then they would undoubtedly die! Dragonscar’s muscles were also frozen all over and he had nearly exhausted his soul force, thus the role he could play now was limited. During the battle with Undying Polar Ice he had been the closest to it, thus he had withstood the most ice energy. As for Moonpond, who came from Divine Mist Divine Kingdom, she was on the verge of unconsciousness and had lost all combat strength. She could no longer help support the Umbral Heaven Ice Array! If so, then the only one everyone could depend on was Sheng Mei! In that moment, Sheng Mei’s slim figure faced the horrifying ice explosion. This ice explosion swept out for 80,000 miles, seeming as if it was able to destroy the world. The two were completely disproportionate! But because she had withstood the previous attack, Sheng Mei’s complexion was pale. However, her back was straight and firm, like a proud plum blossom in a blizzard! Her ten fingers moved and within the pitch black vortex of her eyes, countless crystalline ice flowers seemed to fall, as if her pupils contained a world where it was snowing. “Empress…” Dragonscar gnashed his teeth, his voice trembling. He watched helplessly on as the delicate Sheng Mei, surrounded by a faint icy haze, faced the might and momentum of the world! Bang! A terrifying explosion completely enveloped the Umbral Heaven Ice Array. The entire world violently shook and countless glaciers split apart and were sent flying hundreds of thousands of feet into the air! In this horrifying ice storm, a strange and wistful song spread out, touching and sweet. This song was ethereal and untouched, like the sounds of nature. Even the sparse plant life of this world seemed to rise up in excitement. The song was melodious and deep. The countless glaciers began to disintegrate and scatter, filling the world with endless falling snowflakes. The raging tide of ice had passed and the frozen sky also revealed itself once more. The people within the Umbral Heaven Ice Array that were covered by countless glaciers became visible again. This Umbral Heaven Ice Array was already covered by the all-consuming cold energy of the Undying Polar Ice and a thick layer of frost had formed over it. The barrier was frail, on the verge of shattering at any moment, A misty blue light shimmered. Sheng Mei stood proud and inviolable in the snow. Behind her, the phantom of a goddess appeared. This goddess’ appearance was blurry and her appearance was vague. Her entire body was surrounded by drifting ice and blue silk ribbons. The beautiful and haunting song that was sung just now had come from the lips of this goddess. Bright red blood flowed out from the corners of Sheng Mei’s mouth, winding down like a snake and contrasting with her pale porcelain skin. It was like a red plum blossom in the snow, infinitely beautiful and sorrowful. Sheng Mei… was injured… From the moment the final trial began until now, this was Sheng Mei’s first injury! At this moment, for some unknown reason, just looking at Sheng Mei made one feel an inexplicable ache in their heart. “Empress, quickly take away the World Apotheosis!” Dragonscar begged with tears in his eyes. Although he was only Sheng Mei’s servant, in his heart, her safety was far more important than his life! The World Apotheosis that Dragonscar spoke of was the goddess phantom behind Sheng Mei. It was summoned by her and was a manifestation of her divine soul. Some of the most talented spiritas martial artists were able to create an incarnation of their soul that would appear behind them. This was called a World Apotheosis. Each person’s World Apotheosis was different. A spiritas’ World Apotheosis was similar to the indestructible diamond vajra body that a saint martial artist could cultivate; it was an extremely higher boundary of cultivation within the spiritas. However, because Sheng Mei’s cultivation was limited to the Holy Lord realm, in addition to the massive amount of energy she consumed in facing the Undying Inferno, it was exceedingly difficult for her to summon her World Apotheosis. To do so affected her soul source. Sheng Mei shook her head, “The Undying Polar Ice will likely attack one more time…” Everyone already realized that the cold air within the world had weakened by a great deal. That previous strike just now had used up a great deal of the Undying Polar Ice’s strength and it had begun to weaken. Even so, it hadn’t used up all of its strength. It still had enough power for one final strike, and this strike absolutely would not be easy to withstand! “But, Empress…” Dragonscar was at a loss for words. He could only grit his teeth, heft the heavy sword in his hands and move by her side. He knew that Sheng Mei would not heed his words and that further arguing would only affect her mood. Terrifying cold energy started to ferment in the skies once more. The Undying Polar Ice raised its head to the heavens and let out a clarion cry. Its body started to shrink more and more. From the size of a mountain, it rapidly shrunk to a hundred foot wide. This was also because the Undying Polar Ice had used up a great deal of its strength. It began to compress its strength and reduce the range of attack. By doing so, the might of its attack would naturally be higher. At this time, the goddess phantom behind Sheng Mei produced an ice blue divine sword. Together with Sheng Mei, it faced the impact of the Undying Polar Ice! A World Apotheosis was a part of a spiritas martial artist’s soul. Once it was injured, it would also injure the soul source of the martial artist. As for Mo Brightmoon, Suya, and the others, they also gripped the few remaining divine runic symbols they had, ready to face the final strike of the Undying Polar Ice. Although it was hard to say if the divine runic symbols in their hands would be able to play any useful role, it was better to do something than nothing. No one wanted to stand there and wait for death. The many trial challengers were all in a perilous situation. They focused everything they had to resist this strike! Cold energy compressed more and more. The Ice Phoenix circled in the skies. Then, it opened its beak and a blade-sharp beam of icy light began to form in it. “You lowly, pathetic ants. Do you really believe you can withstand my anger? Keep on dreaming!” For a time, the Ice Phoenix’s body lit up with a divine ice blue light! All of its energies began rapidly fusing into this attack! Ka ka ka! The space near the phoenix’s beak began to crack apart. A terrifying ice energy gathered, forming a thin beam of potent energy that shot forwards like the blade of a divine god! This divine light recklessly cut forwards, ripping through the void. Although it seemed infinitely slow, it was actually faster than lightning! This sort of strange visual illusion occurred only because this icy blue light was able to freeze even time! “This… this power!!” Dragonscar’s mind shook! Dragonscar was also someone that had climbed up the 33 steps of the Divine Seal Altar. Although it had been difficult for him, he was still undoubtedly a heroic elite. His talent far surpassed Bigflame and the Divine Void Crown Prince’s and his sight was equally fantastic. With just a glance he was able to see how terrifying this Undying Polar Ice’s attack truly was! “How can we possibly block this?” Everyone’s minds trembled. Facing this blue light, the pressure upon them all was unbelievable! Sheng Mei’s pupils shrank and her palms became wet with sweat. The was the Undying Polar Ice’s final strike and the power behind it had surpassed her imagination. She could feel that her own Umbral Heaven Ice Array would definitely be pierced through by this beam of light! If the Undying Polar Ice continued using the same attacks as before, Sheng Mei was confident she could block it even if she was injured in the process. But, the Undying Polar Ice had condensed its final attack into a beam of light that was only as thick as a rice bowl. Once struck, her Umbral Heaven Ice Array would shatter! If the ice array shattered, the consequences would be inconceivable. Most martial artists present would die, at most three of them leaving. Even if Dragonscar didn’t perish here he would be grievously wounded! In that moment, Sheng Mei clenched her teeth, a rare look of hesitation in her eyes. Then, they focused like she had come to a resolution of her thoughts. Over her entire body, icy blue flames ignited. “Empress, you… you… you are burning your source soul force!?” Dragonscar cried out from beside Sheng Mei. The higher one’s cultivation, the more talented one was, the more precious their source soul force and blood essence were. Sheng Mei’s source soul force had already reached an unimaginably precious degree. Once she lost some, not even a transcendent divine pill would be able to make up for a tiny bit! But now, she planned to burn her own soul and possibly even discard a portion of her World Apotheosis in order to incite her greatest strength and engage in a life or death battle with the Undying Polar Ice! If Sheng Mei did this then her divine soul was bound to suffer massive damage! And Sheng Mei’s soul was extremely unique. Even with Divine Sovereign Soul Rapture’s astonishing methods, it was likely he wouldn’t be able to fully cure her. This would cause her future achievements to be affected! “Empress, have you gone mad!?” Dragonscar’s eyes turned blood red. He was well aware that if Sheng Mei didn’t burn her source soul force, the Umbral Heaven Ice Array definitely wouldn’t be able to withstand the Undying Polar Ice’s final strike! If that happened, then everyone else besides Sheng Mei in the Umbral Heaven Ice Array would die. Maybe even Dragonscar would perish here. However, even if Dragonscar had to give his life, he didn’t wish to see Sheng Mei receive the smallest wound! In Dragonscar’s eyes, Sheng Mei’s source soul force was far more precious than everyone else’s lives added together. The truth was that with Sheng Mei’s cultivation and talent, she was absolutely able to retreat and avoid this strike. Although this would signal her end in the final trial, she could return next time. But, she had no intention of doing this. “Get out of my way!” Sheng Mei’s icy voice shouted out! She had already firmed her resolve. She didn’t know whether it was because she had fought side-by-side with these people or because she felt some faint sympathy towards one or two people here. Normally Sheng Mei couldn’t care less about the lives of inferior martial artists, but today she hoped that this group wouldn’t die. Moreover, she had a faint premonition that if she were to run away by herself, it would bring about a loss that she would forever regret. This inexplicable feeling forced her to stay and not retreat! In that moment, between Sheng Mei’s eyebrows, the mark of a six-leaf snow flower appeared. This mark was like a third eye, shining with a blazing light and surging with wild origin energy. Sheng Mei’s hair began to wildly sweep up all around her. As the icy blue flames burned on Sheng Mei’s body, as her divine soul was soaking in these flames, within the group, Lin Ming’s eyes suddenly flashed open! His eyes were like two bolts of lightning crashing down in an ice storm, piercing through all! Even with her back to Lin Ming, Sheng Mei could still feel this intense substantialized vision. “Lin Ming? You - !” Sheng Mei was startled. She didn’t know why Lin Ming had woken up from his meditation, but when he opened his eyes, his body had already hurtled forwards. He was like a dormant great dragon that had awoken from slumber. His body shot into the skies! At this time, he ran out of the Umbral Heaven Ice Array and directly faced that terrifying ice blue light. “Lin Ming!!” Sheng Mei was bewildered. No matter how strong Lin Ming was, it was impossible for him to withstand that freezing blue light. That beam of light had reached a preposterous level of strength. Even Sheng Mei had to admit that it would be difficult to resist even after burning her soul force. Seeing the freezing blue light howl towards him, Lin Ming’s gaze was cold and decisive. Within his eyes, an inverted image of the blue light appeared, shooting out like a pair of divine blue swords! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1726","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
