{"id":55693,"no":1748,"title":"MW Chapter 1740","content":"Chapter 1740 – Legend\\n\\n …\\n\\n …\\n\\n …\\n\\n “What did you say?” Imperial Scholar Sun’s eyes widened as he glowered at the disciples of Heaven Union Divine Kingdom.\\n\\n “I said that the Divine Void Third Crown Prince has also gone missing and neither he nor our Senior-apprentice Brother Bigflame have been seen since the fourth level. From Senior’s response, it seems that the Third Crown Prince hasn’t appeared yet. If so… then… his fate is likely no better…”\\n\\n A Heaven Union Divine Kingdom disciple said. But, his words had touched upon Imperial Scholar Sun’s reverse scale.\\n\\n Imperial Scholar Sun hissed, “Stop speaking nonsense!”\\n\\n Although his words were rough, a strong sense of unease had appeared in his mind. Even though the disciples of Heaven Union Divine Kingdom were hostile towards the Divine Void Divine Kingdom, he didn’t think that they would speak recklessly about such things, because these types of matters were too easily seen through. If they were to speak lies then their words would eventually come back to haunt them.\\n\\n The several disciples of Heaven Union Divine Kingdom had ‘believe it or not’ expressions on their faces and didn’t argue back. At this time, someone standing near Imperial Scholar Sun said, “Lord Imperial Scholar, Senior-apprentice Brother Yang has returned!”\\n\\n Just as this voice spoke out, Imperial Scholar Sun grabbed onto it like a life-saving thread. He quickly turned and saw five people flying towards them from the far off horizon.\\n\\n These people were the trial challengers that Divine Void Divine Kingdom had sent out. One of them was the one referred to as Senior-apprentice Brother Yang.\\n\\n The first thing Imperial Scholar Sun did was try to search for the Third Crown Prince amongst the group. However, he didn’t see him.\\n\\n This caused his heart to turn as cold as ice.\\n\\n “Where is the Third Crown Prince!?”\\n\\n He didn’t wait for the Divine Void disciples to steady themselves before he aggressively approached them and asked.\\n\\n “The Crown Prince, he…”\\n\\n After having Imperial Scholar Sun ask them this question right to their faces, the several disciples were dazed for a moment, not knowing how to respond.\\n\\n “Where did he go!?”\\n\\n Imperial Scholar Sun was breathless. Right now he didn’t care about the Third Crown Prince’s completion percentage; he just wanted to see the live person.\\n\\n “Well…” The several Divine Void Divine Kingdom disciples looked at each other in dismay. Finally, Senior-apprentice Brother Yang said with fear in his voice, “Reporting to the Imperial Scholar, his Highness the Crown Prince… as well as Duke Fullmoon… disappeared on the fourth level and their whereabouts are unknown. We tried looking for them but… afterwards, there was a giant staircase of 33 steps leading from the fourth level to the fifth level, and after I climbed to the 31st step I entered the fifth level, and after that I didn’t see the Crown Prince.”\\n\\n The Senior-apprentice Brother Yang was one of those people who had followed Lin Ming and the others to fifth level and helped confront of the Undying Inferno. But, he was also one of those that were afraid of the Undying Polar Ice that appeared afterwards and left the group at a critical moment.\\n\\n “He’s missing…”\\n\\n Imperial Scholar Sun mumbled to himself. He fell back into his wooden chair, a stunned expression on his face.\\n\\n The Divine Void Third Crown Prince was of their Sun Family bloodline and was also the most outstanding disciple from their family. Because of this reason, Imperial Scholar Sun had been chosen to lead the delegation to greet the Third Crown Prince. But now, he discovered that the Crown Prince was missing and had likely suffered some fatal accident. This information was naturally a great attack to him.\\n\\n For a time, Imperial Scholar Sun had no interest at all in bickering with High Prince White Feather.\\n\\n At the same time, High Prince White Feather had no intention of kicking Imperial Scholar Sun while he was down. Right now, they could be called fellow sufferers grieving together. Because Bigflame was missing, he too had fallen into despondency.\\n\\n Originally, the Divine Void Divine Kingdom and Heaven Union Divine Kingdom were the stars of the final trial. With their overly dramatic and tragic end, this caused more and more martial artists to notice them.\\n\\n Everyone now realized that two of the most outstanding disciples from Divine Void Divine Kingdom and Heaven Union Divine Kingdom, Bigflame and the Third Crown Prince, had gone missing in the final trial and had likely suffered some tragic end!\\n\\n The two of them had been the main leads of the final trial and they had even made a bet based on their results. But currently, the final trial’s exit had been open for some time already and seemed to be closing soon, and yet the two of them hadn’t appeared. The hopes of them showing up became more and more uncertain, and the surrounding people couldn’t help but start speaking in hushed whispers.\\n\\n “Bigflame and the Third Crown Prince both perished?”\\n\\n “Unbelievable… that two extremely talented individuals with chances of becoming Empyreans in the future would die here. The final trial is far too dangerous!”\\n\\n “Indeed… although many people survived, the truth is that most of them don’t have a high completion percentage. Many of them had given up on the fourth level. If they really had to struggle for great lucky chances then that would have been extremely perilous for them. Before, I envied those people who found such great lucky chances but now that I see it, if we were to go it’s unknown whether we could come back out.”\\n\\n As everyone was speaking, an enchanting blue light shot over their heads, followed by a faint cold wind.\\n\\n As everyone was startled, they looked up to see a blue beam of light arcing across the endless skies and disappearing into Boundless Divine Mountain. The speed was so fast that some people even wondered whether or not that was an illusion just now.\\n\\n The cold wind gradually dissipated, but a vague and ethereal pressure remained in the air, not fading for a long time.\\n\\n “Soul Empress Sheng Mei!”\\n\\n “Yes, she seems to have entered Boundless Divine Mountain…”\\n\\n Everyone took a deep breath, their words filled with reverence.\\n\\n For the last 100 million years, Soul Empress Sheng Mei had maintained the top final trial record of 83% completion, even suppressing the Good Fortune Saint Son and leaving behind a legend that would last for a hundred generations.\\n\\n And this time, without a doubt, Soul Empress Sheng Mei had created an even higher record!\\n\\n It was horrifying just thinking about it. Outstanding young elites like the Divine Void Third Crown Prince and Bigflame had likely perished in the final trial, yet Sheng Mei had not only easily returned, but created new records!\\n\\n This difference was simply far too great.\\n\\n “Soul Empress… what was her completion percentage?”\\n\\n Someone couldn’t help but ask. They began looking towards the several Divine Void Divine Kingdom disciples that had returned from the final trial.\\n\\n Of these disciples, some of them had joined with Sheng Mei in combatting the Undying Inferno. Because of their hesitancy and fear, they had been a single step away from entering the sixth level and becoming legends in their own right. Otherwise, they could have easily obtained a completion percentage in the seventies.\\n\\n Hearing this question, Senior-apprentice Brother Yang replied, “The Soul Empress, she is likely at… 89%...”\\n\\n On the fifth level, when Sheng Mei, Lin Ming, Xiao Moxian, Dragonscar, and the others had killed the Undying Polar Ice, the ones who had left weren’t too far away. With their extremely keen hearing, they were able to hear what was happening far away. Thus, when Sheng Mei, Lin Ming, and Xiao Moxian joined forces to create a miracle, they had faintly heard what Sheng Mei’s completion percentage was. To them, this hadn’t been too shocking, but had seemed perfectly normal.\\n\\n But when this information fell into the ears of those present, it was like a bolt of lightning smashing down from nowhere.\\n\\n “W-what… what!? 89%!? Are you joking with me?”\\n\\n The one who asked was shocked. Let alone them, even Imperial Scholar Sun and High Prince White Feather suddenly regained their composure from their sorrow of losing their top disciples. They both looked towards the disciple who had been speaking with disbelief etched on their features.\\n\\n This number was far too bewildering. For a time, all of them were unable to accept it.\\n\\n “89%... are you sure?”\\n\\n “It’s true…” Senior-apprentice Brother Yang gulped, a bitter smile on his face. He had been just a step away from leaving behind his own legend; how could he not be filled with regret?\\n\\n “How can it be so high!? Do you know what sort of concept that number is? In the stories, even those who become True Divinities will only reach 85% or above! She… how… how can her score be so high?”\\n\\n Imperial Scholar Sun muttered to himself again and again. He simply couldn’t regain his wits.\\n\\n Senior-apprentice Brother Yang helplessly said, “It wasn’t so high to begin with, but because they killed the fifth level Overlord they were able to enter the sixth level and thus their score increased by several points. Originally, the Soul Empress’ completion percentage wasn’t so exaggerated…”\\n\\n The more Senior-apprentice Brother Yang spoke, the more bitter he felt. Speaking these words was the same as picking at his scabs.\\n\\n “Killing the fifth level Overlord and entering the sixth level?”\\n\\n Imperial Scholar Sun and the others sucked in a breath of cold air. Although they didn’t know what the fifth level Overlord was, they did know that the sixth level was a legend. In the last billion years, there hadn’t been anyone who managed to accomplish the magnificent feat of entering that mysterious land.\\n\\n “The Soul Empress is really fierce, she actually killed the fifth level Overlord…”\\n\\n High Prince White Feather gulped. Even though the saints were hostile to Sheng Mei’s spiritas race, he couldn’t help but admire such a powerful woman.\\n\\n However, these words caused a strange look to appear on Senior-apprentice Brother Yang’s face.\\n\\n “This is…” Although he didn’t want to, he couldn’t help but say, “The one who killed the fifth level Overlord wasn’t the Soul Empress…”\\n\\n “Mm?”\\n\\n Everyone paused. They all looked towards this Senior-apprentice Brother Yang.\\n\\n “If it wasn’t Sheng Mei then who was it?” High Prince White Feather asked, puzzlement on his face.\\n\\n “It… it was that fellow called Lin Ming.”\\n\\n Speaking Lin Ming’s name, Senior-apprentice Brother Yang couldn’t help but sigh in his heart. Really, this was what it meant to be inferior to others. Lin Ming’s horrifying performance on the fifth level had left him shocked and awed, and he knew he could never catch up to this Lin Ming no matter how hard he tried.\\n\\n “Lin Ming? You’re speaking of…” Imperial Scholar Sun was stunned. He queerly said, “Are you telling me it’s that boy from the Divine Runic Masters Guild?”\\n\\n Many people hadn’t heard Lin Ming’s name before. Although he could be called a celebrity within the Asura Road, the truth was that Lin Ming was only a big figure within the professional circles of divine runic masters, so it wasn’t strange if others didn’t know of him. But, when he entered the final trial, there had been a good number of people that recognized him.\\n\\n Because a divine runic master invested so much time into studying the divine runic arts, their combat ability was normally nothing to mention at all. It was already fantastic for young divine runic masters to be able to follow the cultivation pace of their peers, let alone participate in the ruthless final trial.\\n\\n Thus, when Lin Ming appeared many people had started to talk about him and so others knew of his existence.\\n\\n And now they were being informed that Lin Ming had killed the fifth level Overlord. They couldn’t help but glance at each other, dumbfounded. What was the meaning of this?\\n\\n “Do you need to use the divine runic arts to kill the fifth level Overlord?”\\n\\n Some people couldn’t help but make this association. They didn’t believe that Lin Ming surpassed Sheng Mei in strength.\\n\\n But these people were soon disappointed. Senior-apprentice Brother Yang shook his head and said, “No… in order to kill the fifth level Overlord what you need is strength. When the fifth level Overlord was in the state of the Undying Polar Ice, only Lin Ming had the ability to kill it. He really did have the true ability to kill the fifth level Overlord. Moreover… his completion percentage was even more exaggerated…”\\n\\n As the disciple spoke to here, he slowly said, “…He had 92% completion.”\\n\\n With this number, the entire audience of martial artists fell into a deep silence.\\n\\n “…92%?”\\n\\n Everyone held their breath, unable to believe this…\\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1740","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
