{"id":55726,"no":1781,"title":"MW Chapter 1773","content":"Chapter 1773 – The Eruption Within the Silence … … … Strong winds howled. The giant island had already been sundered apart. Lin Ming and the Good Fortune Saint Son faced each other in the skies, and between them the black Grandmist Spirit Bead floated, shimmering with a divine light as if it were a black sun, making one unable to look at it. “Lin Ming, if you cannot win, then admit defeat. The tide flows in but it will also flow out. Your talent surpasses that of the Good Fortune Saint Son and you will definitely catch up to him in the future. Do not try to put on some brave front!” At this time, Empyrean Vast Universe’s sound transmission echoed in Lin Min Ming’s ears, filled with a nervous and worried tone. After the Good Fortune Saint Son took out the Grandmist Spirit Bead, a heaven-shaking reversal in the battle had occurred! “I thank you for your concern Senior, but this junior knows what he is doing.” Lin Ming rapidly replied. His mind was completely focused on the Good Fortune Saint Son, staring at him with unblinking eyes. Lin Ming could feel the terrifying strength of the Grandmist Spirit Bead. As the one facing the Good Fortune Saint Son, he had to bear the full brunt of the Grandmist Spirit Bead’s vast pressure! All of his blood vitality and essence energy seemed to be affected by the Grandmist Spirit Bead, restlessly moving within his body as if everything wanted to rush out! Lin Ming grimaced. He could faintly feel that after summoning the Grandmist Spirit Bead, the Good Fortune Saint Son had experienced a qualitative change. The Good Fortune Saint Son’s ability to utilize the Grandmist Spirit Bead in truth surpassed Lin Ming’s ability to utilize the Magic Cube! This was also within reason. Because the Good Fortune Saint Son was a body transformation martial artist and the Grandmist Spirit Bead was also a divine body transformation treasure, the two of them complemented each other! Moreover, the Good Fortune Saint Son had the guidance of the Good Fortune Saint Sovereign. Lin Ming simply couldn’t compare with these advantages. “Lin Ming, you have lost! Because with the blood energy support of the Grandmist Spirit Bead I can use my Sovereign Blood body metamorphosis! Do you know why, within the saint race that is filled with countless heroes, I alone have become the singular Good Fortune Saint Son? That is because my bloodline is the supreme Sovereign Bloodline. Out of all the bloodlines of the saints it is ranked number one!” The Good Fortune Saint Son growled. The saints were a race that possessed a variety of different bloodline variations. In this way, they were similar to the monster race. The monster race possessed the phoenix bloodline, hydra bloodline, black turtle bloodline, and so forth. Each bloodline gave one a different corresponding talent and ability. This was the same amongst the saints. The most common and visible manifestation of a saint martial artist’s bloodline to aid in their combat strength was – body metamorphosis! A bloodline body metamorphosis would stimulate the greatest potential of a saint martial artist’s mortal body, allowing their combat strength to increase by several times! When Lin Ming fought Naqi, this was the also the same. The reason that the Good Fortune Saint Son hadn’t used his body metamorphosis so far in the battle was not because he wanted to save his strength but because his bloodline was simply far too formidable. Once he used his body metamorphosis, he would rapidly use up his energy and even affect his life source. In addition, the Good Fortune Saint Son’s weapon was a True Divinity spirit treasure. That meant that no matter how much energy the Good Fortune Saint Son poured into his weapon, the weapon would absorb all without reserve. The result of this was that the Good Fortune Saint Son would only be able to attack several times before exhausting his energy. If he couldn’t defeat Lin Ming by then, the result could be imagined. But now, with the support of the Grandmist Spirit Bead, everything was different. The Good Fortune Saint Son could rely on support from the Grandmist Spirit Bead to maintain the Sovereign Blood body transformation for an extended period of time and defeat Lin Ming! As he spoke, the power of good fortune within the world once more swept towards the Good Fortune Saint Son! The great desert beneath them began to expand! Even the sea was affected. Once the fish lurking in the sea were caught in the scope of the Good Fortune Divine Art, they all lost their strength and life and slowly floated up to the surface, dead. Then, the bodies of these fish and sea beasts disintegrated, turning into a blood fog that was absorbed by the Good Fortune Saint Son. The power of good fortune completely fused into the Good Fortune Saint Son’s body. At that same time, the Grandmist Spirit Bead also burst out with brilliant black beams of light. Within this light was a billowing blood energy. It erupted from the Grandmist Spirit Bead and poured into the body of the Good Fortune Saint Son. For a time, the Good Fortune Saint Son’s entire body was covered with a flaming gold divine light. His body emitted explosive crackling sounds and his tall figure began to grow! His muscles inflated and golden scales covered his body. Strange runes were etched onto the surface of these scales, making them look like the scales of a dragon. His hair also turned pure gold. From his elbows and knees, ferocious bone spikes jutted out, looking incomparably vicious! After the Good Fortune Saint Son transformed, the power of his blood energy was like a roaring conflagration, burning into the deep blue skies! “Hahaha! I can feel this power once more, what an intoxicating feeling! Soon, even without the help of the Grandmist Spirit Bead I will still possess this strength. At that time I will even be able to contend with a half-step Empyrean!” The Good Fortune Saint Son’s head fell back as he roared out to the skies. His joints cracked again and again. His aura was like that of an unrivalled war god, unsurpassed in the world! Seeing this scene, the human powerhouses all held their breath. Now, they were worried that Lin Ming would perish here! Although there were many human Empyreans present, the Good Fortune Saint Son after transforming was simply far too strong. Moreover, the Grandmist Spirit Bead was a spirit treasure that surpassed the boundary of True Divinity. They were all afraid that Lin Ming would be directly swallowed up by it and even an Empyrean wouldn’t be quick enough to save him. The loss to humanity would be far too great! “This damned Good Fortune Saint Son! His own strength wasn’t enough to suppress Lin Ming so he has to bring out this Grandmist Spirit Bead divine tool. If Lin Ming loses here, there is no justice at all!” Some young human elites said as they gnashed their teeth. The inside background of humanity was far too poor. Growing up, the young human elites were far too lacking compared to the young elites of the saints when they had to compare resources, inheritances, and other aspects. But as everyone was worrying over Lin Ming, he actually took a deep breath and put the Purple Gold Spear back into his spatial ring. He turned his hand and a black spear appeared in his hand. This spear was as heavy as a planet and its appearance alone caused the surrounding space to faintly twist. This was the Black Dragon Spear! Seeing Lin Ming suddenly take out the Black Dragon Spear, the young elites watching all felt their eyes go as round as full moons. “Black Dragon Spear! Lin Ming finally took out that Black Dragon Spear, a peak True Divinity spirit treasure!” A young elite cried out in alarm. “Wasn’t it said that Lin Ming couldn’t use the Black Dragon Spear?” “There should be some sort of limit, otherwise Lin Ming would have used it already!” In battling the Good Fortune Saint Son, Lin Ming had cut off all roads of retreat and had resolved to fight to the end. Tactics, skills, strength, he used everything at his disposal. It was impossible for him to hold back his strength. If the Black Dragon Spear appeared only now, that meant Lin Ming’s control of the spear was far from enough. “Three moves… I can only use the Black Dragon Spear three times…” Lin Ming whispered to himself as he glared at the Good Fortune Saint Son’s altered form. If he couldn’t beat the Good Fortune Saint Son in three moves, then all that awaited him was defeat! “Haha! You want to use the Black Dragon Spear to face the Grandmist Spirit Bead? You are far too naïve! That spear is indeed a peak True Divinity spirit treasure, but just how much of its strength can you use? How many spear strikes can you thrust out? You have already used up far too much of your bodily strength. When you tried to fight me with that golden spear of yours, you barely managed to hold on as it was. Now that you’ve brought out the Black Dragon Spear, your defeat is imminent!” As the Good Fortune Saint Son spoke, he lifted his black sword and strode forwards. After using the Grandmist Spirit Bead, the Good Fortune Saint Son had no more reservations. Since he had already lost face anyways, he might as well quickly settle this battle! The Good Fortune Saint Son stepped forwards in space, one step at a time. As he did, his momentum grew stronger and stronger, his steps seeming to drum along with the hearts of those present. “He is gathering his momentum!” An Empyrean said. Through movements or attacks, one could gather their momentum, slowly pushing their strength to the limit and then striking out with the final fatal blow! There were many specific martial skills that could achieve this effect, and it was clear that the Good Fortune Saint Son was doing so. If one couldn’t break his gathered momentum then they would have to face a terrifying attack. For the current Lin Ming, that meant defeat! As for Lin Ming, he actually grew more and more silent. He even closed his eyes, constraining all of his aura to his body so he resembled an ancient bell. One that was extremely showy and one that was extremely restrained, the two martial artists formed a sharp contrast with each other. In that moment, the terrifying aura that the Good Fortune Saint Son sent out completely surrounded Lin Ming. This was a completely crushing momentum! The Empyreans present all burned with anxiousness! Pressing forwards a step at a time, the Good Fortune Saint Son’s momentum had nearly reached the peak. A grin appeared on the corners of his lips – he was almost ready to attack. But in this instant, the silent Lin Ming suddenly erupted! All of the energies within his inner world, in that moment, poured into the Asura blood that was sealed in his body! An indescribably terrifying fighting intent shot out from Lin Ming’s body! Piki paka! Lin Ming’s entire body emitted explosive crackling sounds. The boundless and vigorous Asura power rushed into Lin Ming’s skin and muscles like a raging tide. In that moment, it was like a True Dragon was reviving within him! For a time, the mystical power of Laws dissipated into the air, surging around Lin Ming’s body. His body began to grow taller and the lines of his muscles grew even more perfect. His hair turned as red as blood. Even his looks changed, becoming far more resolute, far more murderous! A limitless furiously raging aura stormed out from his body. After this transformation, he was like an Asura that had climbed out from the depths of hell! The power of the mysterious Asura Laws condensed on Lin Ming’s face, turning into Law curse seals. Black dragon scales jutted out from his skin, forming a solid layer of armor! Chi chi chi! Thunder and fire howled out from within his inner world, twining around the black dragon scale armor, making him seem like a war god of thunder and fire. And behind Lin Ming, Law runes and mystical strengths condensed, forming a massive Asura phantom. This Asura phantom had three heads and six arms, each arm grasping a different weapon as it blocked out the skies. An incalculable and majestic fighting intent erupted from the Asura phantom. This fighting intent completely overwhelmed the momentum gathered by the Good Fortune Saint Son, instead forming a counter suppression! In just an instant, all of the Good Fortune Saint Son’s gathered momentum had shattered! This is… Whether it was the human Empyreans or the masters of the monster and demon races, or whether it was the saints present or the young elites present, all of them stared with utter disbelief at Lin Ming. Lin Ming, he… could also undergo body metamorphosis!? Body metamorphosis was not just a change in appearance. The main factor was that Lin Ming’s strength took a tremendous leap forwards! In terms of momentum, he even suppressed the Good Fortune Saint Son! Seeing this scene, the Monster Emperor gulped, his throat twitching. He looked at Empyrean Demondawn with incredulous eyes and said. “I… why do I feel that Lin Ming’s body metamorphosis is… is even stronger than the Good Fortune Saint Son’s Sovereign Blood body metamorphosis that he relied upon the Grandmist Spirit Bead to use? How is this possible? Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1773","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
