{"id":55812,"no":1867,"title":"MW Chapter 1858","content":"Chapter 1858 – The Old Youth … … … This youth didn’t have the aura of Laws around his body and his foundation was ordinary. His cultivation wasn’t high, but as he sat there fishing, he seemed to meld together with the surrounding environment in perfect harmony. Lin Ming hesitated for a moment and then walked towards the youth. The youth clearly sensed Lin Ming approach. However, he continued fishing as before, sitting on the side of this lake which was like a well that had never been touched. “Are there fish here?” Lin Ming suddenly asked. His understanding towards the Laws of Existence had reached an extremely high boundary and he could feel that this lake lacked any vitality at all. There was no life within it, and there weren’t even plants in the water or shrimp or fish within. It was just impossible to fish for anything here. “There aren’t.” The youth’s voice was a little dreary, without any emotion at all. As the youth spoke, he didn’t turn his head. Lin Ming could see the youth’s hands that were grasping the fishing pole. His hands were as beautiful as a woman’s, his ten fingers were slender and his nails seemed made of crystal. As he held the fishing pole he seemed as stable as a sculpture. On his right thumb, there was a simple jade ring. This ring had Law runes carved within it, seeming mysterious yet exceedingly simple. “If there aren’t any fish, what are you fishing for?” Lin Ming asked, puzzled. He could confirm that this youth wasn’t ordinary at all. This was a thought purely based on his intuition. “Fishing for a Concept.” The same dreary voice said. Listening to the youth made one feel strange. “The Concept of Death?” Lin Ming asked in return. In this lake that had no vitality at all, what it possessed the most was the Concept of Death. If one tried to comprehend the Concept of Death here, that was actually possible. But, there was only a possibility. Compared to the shrine platforms of the Fallen God Mountain Range, the difference in the Concept of Death present there and here couldn’t even be described as the heavens and earth. The Concept of Death here was just far too shallow. The youth in front of him had a mysterious identity and was clearly no ordinary mortal. Yet, he was still fishing here for a Concept. This left Lin Ming confused. What could be perceived here? This was only a dead lake. But Lin Ming didn’t rashly respond. He carefully felt the surrounding Laws and determined that there wasn’t anything strange about them. The location of this area was ordinary, near the outer boundaries of the forest, and the soul beasts nearby weren’t powerful either. At the bottom of the lake there were some corpses of dead animals, but most had been dead for hundreds of thousands of years and had turned into fragile fossils. Those animals had also been ordinary creatures when they were still alive. Combining all of these factors together, this was still only an extremely ordinary dead lake. Although Lin Ming had already determined the specifics of the lake, he didn’t randomly draw a conclusion. He just asked in response, “Is there something special about this lake?” The youth shook his head, “There isn’t anything special; it’s quite ordinary.” Then, the youth laid down the fishing pole and turned around. Seeing this youth’s face, a look of amazement flashed in Lin Ming’s eyes. The youth’s eyes were glazed and incomparably dirty. Only an old man on the verge of death would have such eyes. Although the youth had fair and crystal-bright skin, Lin Ming could feel the endless years exuding from his body, as if he had walked here from the beginning of time. As if… hidden within this youth, there was an unbelievably old soul. “You are…” Lin Ming subconsciously stepped backwards, maintaining absolute guard of his surroundings. He felt that it wasn’t an accident that he ran into this old youth here. But, he had no idea just who this old youth was. The youth looked towards Lin Ming and didn’t respond to his surprise. Rather, he began to say, “Your sense of purpose is too strong. Things that are valuable to you, you will pursue. But things that are worthless, you will give up. For instance, this lake. If you had passed by this lake I’m afraid you wouldn’t even have spared it a single glance…” Lin Ming fell silent. This was how things should be. It wasn’t just him, but every normal person in the world was basically the same. Even for those eminent monks of Mount Potala that had obtained enlightenment, even though they stood aloof from the world and didn’t pursue any desires or emotions, that journey in itself could be called a pursuit. The youth looked at Lin Ming. Although Lin Ming’s image didn’t even reflect in his dirty eyes, Lin Ming still felt as if he had been completely seen through. Lin Ming held his breath, completely restraining his mind and raising his guard to the limit. “Senior, who are you?” Lin Ming changed his greeting. The youth only looked at Lin Ming and shook his head. “Your life could be called breaking through all obstacles in your way, moving forwards with unstoppable momentum. You desperately rush towards the peak of martial arts and you far surpass all others of your generation. From the time you bloomed, you took few detours. “But to gain this you also lost something. The road of martial arts is more than the most mysterious and the greatest of the Heavenly Dao Laws. There are also ordinary, everyday experiences. You are missing a section of your path…” “Such as this lake?” Lin Ming quietly asked. He could feel that this old youth’s words contained some of the highest truths. But, he wasn’t able to immediately comprehend them all. The so-called ordinary things, just what were they? The youth gently smiled, not directly replying, “Your road might be called too smooth. In the past you might have experienced some setbacks, but those are far from enough. You are invincible amongst your peers. In battle you sing nothing but victory and have defeated countless rivals. It could even be said that you have never experienced true defeat. But, that might become your limitation, making it impossibly difficult for you to step onto the peak of martial arts!” The youth’s words were like a bolt of lightning that lashed through Lin Ming’s mind. Never experienced true defeat? In Green Mulberry City, he had lost in emotions to Zhu Yan and had lost Lan Yunyue. At Divine Phoenix Island he was forced to flee by Xuan Wuji and become a fugitive at the Holy Demon Continent. Afterwards, when he visited the four Divine Kingdoms he had been plotted against by Yang Yun and nearly had his body wrested away by the Ancient Devil. And when he reached the Divine Realm, he had fought with Tian Mingzi twice, knocking on death’s door both times. And from the youth’s words, these weren’t true defeats, but only minor setbacks. “For one whose road of martial arts is too smooth, for one who isn’t forced to take detours, for one who sings nothing but hymns of victory, it is instead easy to fall into a bottleneck, making one forever unable to step onto the peak of martial arts.” Lin Ming realized what this youth was saying and didn’t continue trying to find out who he was. He knew that if this other person intended to reveal his status, he would naturally know. And at this time, the youth had already stood up. He lifted the fishing pole. The ring on his thumb emitted a phantasmal green light. As he looked at Lin Ming, a thoughtful and intriguing light shined in his eyes. Lin Ming and the youth looked at each other. This other person’s dirty eyes left a profound impression upon him. “Were you especially waiting for me here?” Lin Ming’s thoughts chilled. To come face to face with someone of unknown origins whose strength far surpassed his own, he naturally felt uneasy about it. But the youth only gently smiled and disappeared without another word. He stepped onto the lake and vanished into the fog. Lin Ming took a deep breath. This mysterious old youth filled him with a deep sense of dread and apprehension. “Brother Lin, that person is… terrifying…” After the old youth left, Lin Ming heard a timid voice echo in his mind; it was Ruby. “What did you see?” Lin Ming asked. Perhaps Ruby had seen things he could not. “I don’t know… I didn’t even dare to look at him. I hid away and was too scared to breathe, because he might have discovered me…” Ruby said, trying to gather her scattered wits. “Mm… I understand. Don’t show up so frequently in the future…” Ruby’s words left Lin Ming with some faint guesses. He quickly asked a trial challenger in the Akashic Dream Battlefield and confirmed when the Akashic Dream Battlefield would be opening once more. He also discovered he had been here in seclusion for a full 16 years. In other words, adding in the time he was on the shrine platform grasping the principles as well as the three years he spent in the Akashic Dream Battlefield, he had been at the Akashic Dream Universe for 32 years already. To Lin Ming and other martial artists that lived long lives, 32 years was only a brief flicker of time. But, this was actually almost half the time until the great calamity of humanity would descend. War could erupt at any moment. Lin Ming left the Akashic Dream Battlefield and re-entered the Fallen God Mountain Range. This was the meeting area he had arranged with Sheng Mei. As long as he returned here, Sheng Mei would obtain news of it. Lin Ming and Sheng Mei’s meeting was so that he could return the golden pages to her. “You saw him?” Sheng Mei arrived in the deep of night, appearing right behind Lin Ming. Lin Ming’s eyebrows arched up. He turned to look at her. At this time, Sheng Mei was wearing long robes of deep dark red, her eyes seeming to contain shattered stars. Against the backdrop of the night, she was like a umbral goddess, exuding a mystical and noble air. The night wind gently blew. Sheng Mei’s cloak fluttered about her. The atmosphere was chilling. It was hard for Lin Ming to tell what she was thinking from her expression. “Him? That mysterious youth?” Sheng Mei’s question confirmed Lin Ming’s guess. But, this confirmation sent a chill crawling up his spine. Sheng Mei’s silence was the same as nodding her head. “I saw him…” Lin Ming took a deep breath. He looked at Sheng Mei, his complexion having changed. “That old youth… is the Soul Emperor?” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1858","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
