{"id":55848,"no":1903,"title":"MW Chapter 1893","content":"Chapter 1893 – Six Supreme Treasures\n …\n …\n …\n After Lin Ming absorbed the blood essence from the Holy Scripture creator, the earth began to shake. The massive Cold Ice Mirror that stood tall in the world started to descend, falling back into the earth.\n And at the same time, in front of Lin Ming and the others’ eyes, a blue stone road appeared. This blue stone road rose into the skies, and at the end, a shrine emerged.\n This shrine was old, emitting the aura of endless years. It had floated in the skies for an unimaginable span of time.\n Around the shrine was a giant array formation. This array formation contained a terrifying energy. Thick chains wrapped around the shrine like black dragons, fixing the shrine in the skies.\n The shrine should have already existed here, but it was covered by the Cold Ice Mirror before.\n Everyone glanced at each other. Just what was in this shrine?\n “This is the final road. If I’m not wrong, then this is the Asura Shrine recorded in the ancient texts of my god race. If there is a path to salvation in the Asura forbidden land, then it should be sealed within that Asura Shrine!”\n Diwuhen suddenly said, his voice quivering. With the end so close, he couldn’t contain his excitement!\n He felt a deep anticipation but also a deep fear.\n He anticipated that there was something within the Asura Shrine which could turn the tide of war. But, he also feared that this was nothing but a one-sided wish from their side; he was afraid that there was no way to save their primal god race.\n “This blue stone road, can we go up?”\n Smokeless frowned. She felt that only Lin Ming had managed to pass the test of the Cold Ice Mirror and she had barely been able to mix herself into the pool of victors. As for the others, they weren’t close at all.\n In this situation, did they have the qualifications to step into the final shrine?\n Smokeless’ words caused Diwuhen to hesitate for a moment. He paused at the blue stone road and then carefully said, “The ancestors are merciful. Even if I have lost honor for the god race, I am still their flesh and blood descendant. With the destruction of our race arriving, even if we are useless trash the ancestors still shouldn’t be indifferent towards us and let us perish…”\n As he spoke, Diwuhen raised his robes and knelt on the floor, deeply bowing towards the shrine.\n Behind Diwuhen, Shenku, Lanlu, and the others also knelt, all of them deeply bowing towards the shrine.\n After kneeling for ten breaths of time they stood up. Then, Diwuhen took a slow and careful step forwards and stepped onto the blue stone road. Finally, he discovered that he wasn’t forced back by the array formation.\n Diwuhen was overjoyed. He stepped forwards, allowing the others to step onto the blue stone road.\n “We can go.”\n On this road, Diwuhen was covered with a strange feeling. It was like his entire being had become ethereal, as if he were withstanding a baptism of the endless Laws of the universe.\n Shenku, Lanlu, and the others also followed up on the blue stone road.\n Then there was Lin Ming. He looked at the blue stone road, finding it similar to the blue stone road he had encountered in the Asura Road’s final trial, within the planet-sized heavenly palace. The blue stone there had also contained the aura of Laws.\n Everyone carefully moved towards the Asura Shrine.\n The road didn’t seem too long, but everyone walked for an entire day.\n They walked extremely slowly, allowing themselves to become aware of the Laws here as much as possible.\n Finally, the six people neared the shrine.\n Lifting their eyes, they saw the entire temple shrouded in blue light. There was a formidable energy contained within that grew endlessly, not seeming like it had experienced 10 billion years at all.\n The great doors of the shrine were shut tight. But as the group neared, the doors swung open.\n Diwuhen and To Bagui walked at the front, cautiously leading the way into the Asura Shrine.\n There were no dangers within the shrine. Lin Ming could feel that the Laws here were peaceful; most of them were defensive array formations. As long as no one tried to destroy the shrine then there wouldn’t be any killing intent.\n The passage leading into the shrine wasn’t too long. The six stepped in, their feet walking on tiles that had been untouched for countless hundreds of millions of years. Light pattering sounds echoed within.\n At the end of the passage was a vast grand hall. This grand hall was over a thousand feet long and wide, similar to a city square.\n The light of the Laws illuminated this hall, making the entire hall shine as if it were daytime within.\n As the six people entered the grand hall, they could see an altar at the center.\n This altar was only several dozen feet high, but had a stairway of nine steps. Each step was carved with beautiful images with faint, multi-hued lights sparkling from them, bursting with auspicious sights.\n But at this time, no one bothered with the stairs. Instead, all of their eyes were focused on the skies above the altar.\n There, floating in the air, were six items, each one of them completely different from the others.\n Standing outside the altar, because of the light of the Laws and their shadows, it was hard for people to immediately discern what these six items were.\n “What a powerful aura. These were left behind by the Asura Road Master!”\n Lin Ming could confirm that these six items were not ordinary treasures at all!\n Beside Lin Ming, Shenku, To Bagui, and the others were all panting loudly. Because of these precious treasures it was hard for them to suppress their mood.\n These were supreme treasures from 10 billion years ago. Any one of them was countless times more precious than a True Divinity spirit treasure.\n “Mm? There are words here…”\n Smokeless suddenly said. Everyone followed her gaze to see that somewhere on the altar, there were words of the primal god race carved onto it.\n No one present had a problem understanding the primal god race language; they soon understood what it meant.\n It was the division of treasure.\n Of the six treasures, only three could be chosen.\n Of these three, one belonged to them all.\n But as for two others, they belonged solely to the person who had passed the Cold Ice Mirror. In other words, they belonged to Lin Ming!\n Seeing the rules of assignment, everyone glanced at Lin Ming with envy. To choose three treasures and for two of them to go to Lin Ming, this was truly enough to arouse one’s envy.\n Of course, because of the protection of Laws in the Asura forbidden land, as well as the old God Sovereign’s support of Lin Ming, and also the immeasurable function that Lin Ming had in helping the ancient races survive this great calamity, no matter how much anyone envied Lin Ming, none of them would think about plotting against him.\n “Choosing treasures!”\n Diwuhen sucked in a deep breath, his voice shaking. The reason they came to the Asura forbidden land was for this moment.\n Whether or not they could see a ray of hope in the dark, all of that would depend on what these treasures were.\n The group slowly flew towards the altar. They could feel the vast power of Laws swell towards them like a wave.\n The first treasure was facing the group; it was a large furnace.\n This furnace was 30 feet high and had a simple and plain design. There were runes carved onto it, with a taotie diagram and all sorts of other flowers and birds.\n These carvings didn’t seem exquisite at all. In fact, they appeared rather rough. Looking at the furnace there didn’t seem to be anything special about it, as if it were some common bronze antique found within the mortal world.\n However, for this furnace to be placed here, everyone knew that it had to be some uncommon treasure. Without a doubt, it was likely some supreme magic tool that the Asura Road Master carried with him in the past.\n “There are markings within the furnace!”\n Smokeless suddenly said. Everyone looked in to see that within the furnace, there were dense small writings. These writings were in the language of the primal god race, each word flooded with the power of mystical Law runes. They were faint, seemingly covered with fog, making one unable to see them clearly.\n “This furnace is a Beyond Divinity level supreme treasure.”\n A brilliant light flashed in Lin Ming’s eyes. This furnace – he wanted it!\n Not to mention the terrifying strength of the furnace itself, just the runes and writings within the furnace left him blinded with desire. If he could perceive them then the advantages would be unimaginable.\n “What an excellent furnace…”\n Diwuhen sighed in praise. But, he only looked. This furnace was precious, but it wasn’t enough to save their god race. Not to mention anything else, just its terrifying grade of Beyond Divinity meant that it wasn’t something the average person could operate.\n Perhaps even an extreme Empyrean might only be able to display a few percent of the furnace’s power. How could anyone think of killing the Good Fortune Saint Sovereign with this alone?\n The group continued to look.\n On the side of the furnace was a pill box.\n The pill box was completely sealed, as if there was a separate universe within.\n Lin Ming didn’t know what pill it was nor could he smell the medicinal fragrance. Everything had been blocked out.\n But, Lin Ming could faintly feel that there seemed to be the rhythm of a heartbeat echoing from the pill box, exuding an incredible life force as if there was some spiritual existence being bred within.\n “The pill has manifested spirituality?”\n The Asura Road Master has left behind a pill that had been enshrined on this altar for 10 billion years. Just what would it be like now?\n This pill had likely become an existence similar to the Essence Spirit Embryo Stone. Upon opening this pill box, the pill might fly out into the skies, developing its own mind and intelligence, even being able to cultivate on its own!\n Such a pill left everyone shocked. Shenku and Lanlu even wondered whether they would be able to keep the pill from running with their current level of strength after opening the box.\n Wanting to prevent it from escaping wouldn’t be easy, and as for swallowing it, the difficulty of that task could be imagined.\n “A pill on this level, would swallowing it cause the body to explode with energy?”\n As To Bagui spoke, he looked at Diwuhen. Diwuhen shook his head, indicating that he wouldn’t choose this pill, because the pill wasn’t enough to save their people.\n Diwuhen looked at Lin Ming. Lin Ming was silent. He alone could choose two items, so he wasn’t in a hurry.\n The third item was a black symbol paper. This symbol paper had dense and complex runes drawn across it.\n This was a divine runic symbol as well as a so-called god decree.\n This was different from the god decrees Lin Ming had seen before that had already turned yellow. This god decree contained an incomparably horrifying strength. The power of Laws within hadn’t faded in the slightest even after 10 billion years, and instead faintly enhanced.\n “This god decree…”\n Lin Ming’s eyes brightened. He looked at the lines atop the god decree, slowly analyzing its function…\n The fourth supreme treasure was a small green bottle. This bottle exuded a halo of light. As Lin Ming probed it with his sense, he felt a familiar aura.\n He had felt an aura like this before, in the planet-sized heavenly palace at the Asura Road’s final trial. He would absolutely not mistake what this was – it was the aura of Asura blood.\n This green bottle contained a drop of Asura blood. And from the aura it exuded, it was even beyond that of the drop of blood within the planet-sized heavenly palace!\n “This doesn’t seem like an object of salvation either…”\n As Diwuhen spoke, he felt his heart tighten. In this Asura forbidden land, would there not be anything that could save their people?\n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1893","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
