{"id":55888,"no":1943,"title":"MW Chapter 1931B","content":"Chapter 1931B – Love and Hate\n …\n …\n …\n In the universe, in the boundless darkness, two figures stood high in space.\n These two people were wrapped in black robes. But, one was a beautiful woman and the other was an old youth.\n They were Sheng Mei and the Soul Emperor.\n “Are you satisfied…?”\n The old youth had a taunting smile.\n Sheng Mei’s expression was cold. She didn’t respond.\n “I agreed with your final condition. I did not use a dreamland soul refining technique but instead allowed you to conjure up all of this. You gave the primordial yin of your seven reincarnations as well as your body and mind to him, freely offering it all to obtain his Eternal Soul. You gave Lin Ming your most precious treasures, but in the end, his judgment of you came down to nothing but a single word… whore.”\n The Soul Emperor’s tone was thoughtful. Indeed, the Eternal Soul had to be voluntarily offered by Lin Ming, but in this universe, the Soul Emperor was the one with the highest attainments in the complexities of the soul and the spiritual sea. He had his own methods he could use, such as creating a dreamland and using illusions to easily deceive Lin Ming. To trick Lin Ming into offering up everything of his own will wouldn’t have been difficult at all.\n “You understood all that has happened and all that you have done, but yet you still chose to pour your emotions into him and offer the primordial yin of your seven reincarnations to him… just what use is that? His soul force has been sucked dry by you… oh, there seems to be a little left, enough for him to live for another short span of time, but in the end he will die no matter what. This is just like taking your most precious treasure and tossing it into the trash. Did you do all this just to satisfy your own obsessions?”\n The Soul Emperor slowly said. But at this time, Sheng Mei’s complexion had become colder than ice.\n She clearly and unhurriedly said, “You… shut up!”\n The Soul Emperor was stunned for a brief moment, but he still coldly sneered as before.\n Sheng Mei coldly said, “Do not forget that we have an agreement. Do not force me, otherwise, I will die against you! And if I die, all your plans will come to nothing!”\n A thick killing intent and hate flashed in Sheng Mei’s eyes. This killing intent left the Soul Emperor frowning, but he immediately chuckled. “It’s these eyes again. That is, I am the most hated person in your life, a person that you want to slice into a million pieces. However… you may hate me, but doesn’t Lin Ming also hate you? You took away his everything and left him nothing but a cheap life… oh, that’s right, you did offer your sincere feelings to him, but what significance is there in that? It is worthless!”\n “I never imagined that even after seven reincarnations, you would still be so mesmerized by that word ‘love’. You are just like a little girl with your naïve little expectations of others. Since you want to maintain that fragile and ridiculous bubble in your heart, then I won’t pop it for you. I want something else, bring it here…”\n The Soul Emperor put out a hand. Sheng Mei grit her teeth, her eyes thick with murderous thoughts. But in the end, she composed herself and completely opened her spiritual sea.\n Slowly, from between her eyebrows, countless motes of light condensed, finally forming into a bean-sized deep red and purple sphere of light.\n This sphere of light slowly floated away. In the void of space, a constant flow of energy came from this small sphere of light, as if it contained an infinite universe within.\n This was… Lin Ming’s Eternal Soul. Unless it was offered voluntarily, it could not be taken.\n When Lin Ming and Sheng Mei had made love, his mind had completely fallen into her hands. At the pinnacle of joy and passion, he had voluntarily handed it over.\n And now, Sheng Mei was giving this Eternal Soul to the Soul Emperor on her own volition.\n It was different than what Lin Ming had thought. Sheng Mei didn’t retain half of the Eternal Soul but gave it all to the Soul Emperor.\n In the boundless starry skies, it was like a mystical seed. As if it could form a world just by being planted.\n “The Eternal Soul, it’s finally mine!”\n Looking at this Eternal Soul, the Soul Emperor’s eyes shined with incomparable excitement.\n “I did everything in my power in order to nourish it! And now, I have obtained it.”\n The Soul Emperor licked his lips. He waved his hands and the Eternal Soul fell into his grasp. He smiled, revealing brutally white teeth. Combined with his horrifying face, his smile left one shuddering with fear.\n The Soul Emperor excitedly looked at the soul seed in his hands.\n He first investigated it with his sense. Once he was sure that it hadn’t been tampered with, he slowly pressed this soul seed into the point between his eyebrows.\n He was always careful in order to not give anyone a chance to harm him.\n As the Eternal Soul entered his body, the Soul Emperor seemed to have obtained the most wonderful thing in the world. He was like an opium addict that had been denied his drugs, finally obtaining a box of the most precious drugs. He was like a sexual deviant who had been deprived of the joys of the flesh for years, finally obtaining the most beautiful woman in the world.\n Because of the Soul Emperor’s extreme excitement, his face turned fierce.\n His filthy old eyes slowly changed, filling with a profoundly pure brightness.\n This process continued for two hours.\n The Soul Emperor looked more and more like a youth. The depressing atmosphere around him had also dissipated by a great deal.\n It was just that his face was still pale white without a trace of blood, so drained that it left one’s heart chilled.\n “Good, very good!”\n The Soul Emperor stretched out his right hand, cracking his knuckles.\n “I will agree to your request. As for Soaring Feather God King, I will deal with her myself. Of course, this is also for myself… right now, I don’t want the saints to notice anything out of the ordinary!”\n The Eternal Soul couldn’t be directly absorbed by the Soul Emperor. Rather, it had been sealed into his spiritual sea and wrapped in layers of bindings.\n Absorbing a soul was easier said than done.\n The complex spirit marks would cause the person absorbing it to lose themselves and form split personalities.\n Empyrean Primordius was an extremely good example.\n Even though the Soul Emperor had profound understandings of the soul, he still couldn’t accomplish this. In fact, it would be an extremely long process for the Soul Emperor to refine the Eternal Soul; he would need at least 100 thousand years.\n Beside the Soul Emperor, Sheng Mei formed seals with her hands, creating layers of illusion space that completely sealed away the Sky Spill Planet.\n This enchantment she casually created could last for tens of thousands of years.\n The Soul Emperor disdainfully smiled. “You want to protect this planet? The saints may have invaded the Divine Realm, but they are only interested in the Divine Realm itself, not the mortal realms. At least, this will be true for the next several tens of thousands of years…”\n Sheng Mei didn’t speak. She quietly turned around, tore open the void and departed.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1931-2","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
