{"id":55929,"no":1984,"title":"MW Chapter 1969","content":"Chapter 1969 – World Seed\n …\n …\n …\n This separate space was something Lin Ming was already familiar with. It was filled with a faint mist.\n The mist wasn’t ordinary; it consisted of the three great source energies of the universe – grandmist energy, genesis energy, and spirit source.\n Just a single wisp was incredibly valuable. Even this immortal palace didn’t hold too much of it.\n But at this time, these three great source energies wasn’t the noticeable treasure within the void. Within these twining energies, a crystal was quietly suspended in the air.\n This crystal emitted a dark black light as if it were a black hole. Any light that flowed towards the crystal was drawn towards it, and even the three great source energies began to slowly merge towards it.\n As if it was the source of all Laws in the universe.\n Lin Ming cautiously stretched out his divine sense towards this crystal. To his amazement, even his sense was absorbed by it.\n He quickly drew back his sense. But after a brief probe, Lin Ming was able to grasp the strange aura around the crystal.\n This sort of aura was actually somewhat similar to the Magic Cube’s!\n But compared to the Magic Cube, the aura of this crystal was far, far weaker.\n “Just what is this…?”\n Lin Ming was at a loss for what to do. But at this time, the ancient voice echoed within his spiritual sea once more.\n “What lies before you is the condensed source energies of the universe. At a certain day, at a certain time, let it absorb the scattered world power from a shattered world. It will slowly store power, and when it reaches a critical point, it will completely explode. All of the matter, energy, and Heavenly Dao Laws stored within will spill out, slowly evolving into a new universe. This is the big bang of a universe.\n “Devour the old world and allow it to perish, giving birth to a new world. This is the future evolution of this crystal – you can call it a world seed!”\n As the Asura Road Master’s voice echoed out, his heart shook. World seed!\n This mysterious crystal could evolve into its own world!\n Lin Ming faintly recalled that in the past, there were people who speculated that the three divine tools, the Magic Cube, Grandmist Spirit Bead, and Purple Card, were all world seeds.\n If the three of them could evolve into true worlds, they could turn the universes of the 33 Heavens into 36 Heavens!\n If so, then it wasn’t strange for this world seed in Lin Ming’s hand to have an aura similar to that of the Magic Cube.\n It was only that the black crystal’s aura was much weaker than the Magic Cube’s.\n If the Magic Cube was able to evolve into a massive universe the size of one of the 33 Heavens, then this black crystal could only evolve into a sub-universe, such as one of the Divine Realm’s 3000 great worlds.\n But even this sub-universe was amazing enough. Out of the Divine Realm’s 3000 great worlds, each one contained countless planets and stars. Even if an Empyrean level powerhouse were to spend the entirety of their life exploring such a sub-universe, they would never be able to explore every area.\n “The reward for this Gate of Laws is actually a world seed. It seems that Senior Asura has already seen my road of martial arts…”\n Lin Ming touched his own stomach. This was where his own self-created universe was biding.\n During his last several reincarnations, his inner universe had grown stronger and larger. And after being compressed by the Laws, this inner universe would surely develop into a terrifying world in the future!\n If Lin Ming could reach the boundary of the Asura Road Master or the Holy Scripture creator, then this universe would turn into a world on par with the Asura Road or the Akashic Dream Universe!\n And if Lin Ming could surpass the boundary of those two existences, then this universe would become even more unimaginable!\n But in order for Lin Ming’s universe to develop to that level it required a tremendous period of time as well as a massive amount of world power!\n To breed a universe, it would take billions of years as the base numeral.\n If Lin Ming had to rely only on himself to absorb world power, then his speed would be extremely slow. Moreover, the world power that Lin Ming absorbed would be impure, far inferior to this world seed in front of him.\n “Senior Asura saw that I was breeding a world within me and thus he gave me a world seed. If I were to place this world seed in my own inner universe, then cultivating my inner universe would be twice as fast with half the effort!”\n Thinking of this, Lin Ming was overjoyed, as well as grateful towards the Asura Road Master.\n For him, this was an impossibly good reward!\n Lin Ming brought his hands together. Beneath the movement of his fingers, flows of energy and Asura Law runes fluttered about, wrapping around this world seed.\n The Asura Laws pulled the world seed into Lin Ming’s inner universe.\n When this world seed completely sank into Lin Ming’s body, he suddenly felt his inner universe begin to form a vortex of matter, energy, and Laws.\n Originally, if Lin Ming wanted to absorb world power he had to sit down and meditate, breathing in and out the strength around him. He would choose the core of a large planet and meditate within where the world power was the richest and purest.\n But now, Lin Ming seemed to have gained a black hole within his body. The world seed spontaneously absorbed world power from his surroundings; there was no need for Lin Ming to control it.\n However, this world power not only flowed into Lin Ming’s inner universe. A greater portion of it was directly sucked into the world seed.\n Even a part of strength that was originally Lin Ming’s own world power was swallowed up by this world seed.\n Seeing this, Lin Ming hesitated for a moment.\n This world seed was in truth an extremely dangerous item. It could be called a growing black hole. It would absorb a massive amount of world power in order to prepare for the big bang explosion of a universe.\n If he couldn’t control it well enough then his own inner universe would be swallowed by it.\n “I must refine it before it grows up and have it serve me completely. Finally, I should fuse it into my own inner world and turn it into a part of my body.”\n Lin Ming thought, forming a clear direction in his mind. However, wanting to refine this world seed wasn’t simple at all. It would require a great amount of time and energy and would take at least several hundred years…\n “It’s time to go to the next level.”\n As Lin Ming thought this, he stepped out of the planet-sized immortal palace.\n The back exit of every immortal palace in the third level corresponded to the entrance to the fourth level.\n At the fourth level, the dangers would rise to a whole new degree.\n Of course, to Lin Ming, this wasn’t a problem at all.\n Space and time turned upside down. The planet-sized immortal palace vanished and Lin Ming found himself floating above a vast wilderness.\n Taking a broad view of everything, it was all gloomy lands and exposed rocks.\n The thin and sparse grass covered the land like cracked skin, making this world seem bleak and desolate.\n The moment Lin Ming stepped onto this wilderness, he felt a suppression from the Laws. His inner world was imprisoned and his cultivation was pushed down.\n Lin Ming ruefully smiled at this.\n In the past when he came out to adventure, he had done so with the status of a junior, and was even considered young amongst all juniors.\n As for smelting trials, they often compared talent but not absolute strength. Thus, a suppression that came from skeletal age was relatively common amongst them. But to Lin Ming, the suppression that came from these Laws was advantageous to him instead. Many opponents that were more powerful than he was were forced onto an even ground, and on even terms, even Soul Empress Sheng Mei was inferior to Lin Ming.\n But now that several millennia had passed, Lin Ming had actually become a senior instead, and now he was the one being suppressed by the Laws.\n Lin Ming slowly walked into the wilderness, looking for the entrance to the fifth level.\n As long as he passed the fifth level then there would be the mysterious sixth level. And to open that, he needed the three emperor jades of fate.\n Lin Ming had already collected all three!\n This was also the ultimate goal, the reason he came to the Asura Road’s final trial!\n ……….\n As Lin Ming was exploring the fourth level, in an area thousands of miles away, a group of saint race disciples in uniform outfits were carefully searching a swamp.\n These saint race disciples were from the Good Fortune Saint Palace.\n This swamp was extremely muddy and thick. In the past, it might have been the core of a lush and vibrant forest. But after 10 billion years the forest had long since vanished, leaving behind nothing but thick mud. This decaying mud was already as deep as a sea and also exuded bubbles of rancid poisonous gas.\n These poisonous gases were formed when variation plant species or powerful poisonous spirit insects or beasts died. If a Divine Sea martial artist were to take a single breath of this then they would die a violent and gruesome death.\n “Is it really here?” A Good Fortune Saint Palace disciple frowned. Even though a martial artist was capable of adapting to their environment, it was still incredibly difficult to withstand such an atmosphere for several days on end. Every day they would have to battle with the tarry mud and poisonous insects, and also guard against the toxic bugs and sneak attacks from snakes that appeared from time to time. The excessive mental tension easily left one in an exhausted state.\n And even after searching for so many days, they still hadn’t found what they wanted. This made them all wonder: could something on the level of what they wanted to find actually be buried in such a disgusting swamp?\n “Shut up! Do you want to die!?”\n The fat man said. His normally lazy and half-closed eyes suddenly burst open with a terrifying light!\n This disciple who spoke fell silent. He followed behind the fat man, holding a small red ball in his hand as he continued his search.\n This small red ball was the searching tool that the Good Fortune Saint Palace disciples used.\n Upon closer inspection, one would see that this small red ball was alive. It wriggled around, a mass of flesh and blood!\n Everyone here was well aware that this mission was the main and most important reason they were at this final trial!\n Once they completed it and the Good Fortune Saint Sovereign rewarded them, all of them would prosper and rise. Moreover, they would even obtain a special reward. This ‘special reward’ was something they longed for even in their dreams.\n But if they failed, the consequences would be unthinkable. These disciples were not ordinary saint race martial artists; they had a great and horrifying secret in their bodies.\n This was a special measure they had also taken in order to increase their strength as much as possible, but it was also because of this that there was a ‘hidden danger’ within them.\n If the Good Fortune Saint Sovereign didn’t help and this ‘hidden danger’ were to erupt, then they would live lives worse than death.\n Thus, all of them had already burned away all paths of retreat. They would either succeed or they would die doing so.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1969","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
