{"id":56014,"no":2069,"title":"MW Chapter 2050","content":"Chapter 2050 – Never Abandon\\n\\n …\\n\\n …\\n\\n …\\n\\n When Lin Ming emerged from the Magic Cube space, his heart had become filled with worries.\\n\\n It had to be known that the Good Fortune Saint Sovereign was only one of the enemies he was destined to face. But just the Good Fortune Saint Sovereign alone played such a grand and complex game.\\n\\n In the eyes of the Good Fortune Saint Sovereign, the only person capable of playing against him was the Soul Emperor.\\n\\n Just what was the Soul Emperor plotting?\\n\\n As Lin Ming thought of the Soul Emperor, he inevitably recalled Sheng Mei.\\n\\n Lin Ming had met with Sheng Mei over 6,000 years ago in the Soul World. There, he had wanted to pay a price in order to facilitate an alliance between humanity and the spiritas. But the result was that his proposal had been refused by Sheng Mei. Now that he thought of it, this was also completely normal. Whether it was the Soul Emperor or Good Fortune Saint Sovereign, both of them thought that humanity was nothing but a tiny chess piece within the grand game they were playing. If humanity were to undergo a great apocalyptic calamity in which they went extinct, this would be no different from a chess piece being taken off the board.\\n\\n Lin Ming fell silent as he thought of the words he spoke to Sheng Mei, his mind in deep contemplation, as if his thoughts were wrapped in fog…\\n\\n “Why are you sighing?”\\n\\n “I’m sighing over your destiny…”\\n\\n …..\\n\\n “Lin Ming… you are like a moth drawn to the flame. Even though you know a raging fire is in front of you, you still desperately plunge into the roaring flames. Me, I am also a moth.”\\n\\n …..\\n\\n “Lin Ming, let me ask you one more time. Are you willing to abandon humanity, abandon everything, and follow me in reaching the peak of martial arts, probing the limits of the road of martial arts, establishing a vast world that lies separate from the 33 Heavens, and become rulers of that world?”\\n\\n …..\\n\\n “Forget the words I’ve said tonight.”\\n\\n …..\\n\\n Lin Ming thought back to the words they shared. He thought of the thoughts he had at the time, the thought of being hunted down by Soaring Feather God King and then being shifted into the Sky Spill Planet by Sheng Mei, and even the sad face she had when she left after stealing away his source soul force…\\n\\n Without a doubt, Sheng Mei had her own story, and it was because of the Soul Emperor that her story was filled with sorrow and pain.\\n\\n She didn’t wish to, but she eventually had to make a choice.\\n\\n It was just that Lin Ming didn’t know the secrets behind her choices…\\n\\n “Brother Lin, what is it?” Xiao Moxian asked as she saw the peculiar expression on Lin Ming’s face. Lin Ming shook his head. “It’s nothing. I was just recalling some past events… I’m worried about what the spiritas are planning…”\\n\\n When Lin Ming met up with Xiao Moxian, Mu Qianyu, and Qin Xingxuan, he had six hours before his battle with the Good Fortune Saint Son. During this time, Lin Ming recounted his experiences to them, and Xiao Moxian also learned about Sheng Mei and the Soul Emperor.\\n\\n Xiao Moxian didn’t continue this topic. She instead said, “Dragon Fang has arrived…”\\n\\n “Dragon Fang?” Lin Ming was startled. He suddenly remembered that in the backup troops that came, there were few ships but their war strength was incredible. Yes, in the Hidden Dragon Galaxy there was not just Xiao Moxian but also Dragon Fang.\\n\\n During these past years, both forces had worked together to harass and divert Good Fortune Saint Son. Dragon Fang was slightly weaker than Xiao Moxian and Xiao Moxian also had Lin Huang at her side. It was obvious that Dragon Fang had a much more difficult time surviving in the Hidden Dragon Galaxy.\\n\\n Thinking about it, Dragon Fang shouldn’t have been too far away from this area. So, when he saw the light from the massive explosion, he rushed over.\\n\\n “Dragon Fang broke into the Empyrean realm.” Xiao Moxian suddenly said.\\n\\n Lin Ming was bewildered to hear this. Dragon Fang was about his age, and to break into the Empyrean realm at 6,000-7,000 years of age was a bit too exaggerated.\\n\\n However, this was likely because of the great calamity. With the arrival of disaster, many geniuses grew rapidly. If this calamity continued on and more and more human martial artists perished, there would also be more powerhouses that rose from their ashes.\\n\\n After the tides washed the sand away, true gold would emerge. To the weak this great calamity was a living hell, but to geniuses this great calamity was a stage set for their growth.\\n\\n Lin Ming thought for a moment and then took out a jade slip from his spatial ring. This was the sound transmission mark of the Mount Potala Wartime Alliance.\\n\\n It was about time for humanity to reunite.\\n\\n Currently, the invincible forces of the saints had been slowly whittled away. Although humanity couldn’t engage in a counterattack, they could at least resist the saints head-on before the Good Fortune Saint Sovereign left seclusion.\\n\\n Moreover, there was something else he wanted to do. Lin Ming wanted to find out news about Mo Eversnow through the human intelligence network. According to what Xiao Moxian knew, Mo Eversnow had left early on in the great calamity, and as for where she went, Xiao Moxian didn’t know. But Mo Eversnow had brought Fishy away with her.\\n\\n There might be some human Empyreans that would know where Mo Eversnow had gone…\\n\\n “Let’s go. We’re returning to the base of Demon Fairy Palace,” Lin Ming said.\\n\\n …..\\n\\n “Lin Ming, hahaha!” Within a brightly lit hall of Demon Fairy Palace. A tall and robust middle-aged man strode in, a group of silver-armored warriors following close behind him. As these silver-armored warriors saw Lin Ming, visible excitement shined in their eyes.\\n\\n This middle-aged man was Empyrean Vast Universe. Empyrean Vast Universe stretched out a hand and slapped Lin Ming’s shoulder. “I knew it! I knew a brat like you wouldn’t have died so easily! It’s been 6,500 years and you’ve finally returned! Good! Too good! This is just far too good!” Empyrean Vast Universe shouted, his complexion beaming.\\n\\n In the past, he and Divine Dream were the human Empyreans who had noticed Lin Ming’s capabilities first. At the time, Empyrean Vast Universe only thought Lin Ming was a genius with excellent talent who would become an Empyrean in the future. He even believed he had underestimated in his judgment of Lin Ming, but he never thought that his underestimation would be so great. Now, Lin Ming was already able to create the miracle of reversing this war.\\n\\n Who would have thought that the somewhat naïve and childish youth of the past would become the great hero that reversed the great calamity?\\n\\n “Senior Vast Universe!”\\n\\n Seeing Empyrean Vast Universe, Lin Ming was also excited. When the saints began their full invasion of humanity, the human elites had to evacuate the Divine Realm to guarantee the continuation of their inheritance. In order to safely arrive at the wild universe, the armies of the human Empyreans, led by Divine Dream, had to go to Bright Luster World to block the advance of the saints.\\n\\n And Empyrean Vast Universe had been one of these brave Empyreans. Lin Ming knew that Empyrean Vast Universe’s strength wasn’t considered strong amongst the many human Empyreans and he worried that Empyrean Vast Universe would perish in battle. After all, this was an elder that he respected and he also appreciated Empyrean Vast Universe for having recognized him in the past.\\n\\n As Lin Ming saw Empyrean Vast Universe standing alive in front of him, he was overjoyed from the depths of his heart.\\n\\n “Haha, don’t call me senior anymore! Boy, you are the hero of humanity. If Divine Dream were to see you now, she would definitely be happy.”\\n\\n “Senior Divine Dream…” Lin Ming’s thoughts stirred. “I heard Senior Divine Dream was fighting two other saint True Divinities in a different wild universe. How is the current situation?”\\n\\n Empyrean Vast Universe shook his head. “I don’t have much of an understanding about how she is doing. When Divine Dream sent a message to me, she instructed me on how humanity should continue the war… and she also conveniently mentioned that she was engaged in battle with two True Divinities…”\\n\\n “Oh? What instructions did Senior Divine Dream give?”\\n\\n “It was very simple, just a single word – endure. Divine Dream wants the various human forces to go into hiding and not to directly confront the saints. We’re to use guerilla tactics to engage them in order to drag out as much time as we can. Now, it seems that we really managed to wait for our favorable turn to appear!” Empyrean Vast Universe laughed once more. Lin Ming’s appearance had truly been their favorable turn.\\n\\n “As for Divine Dream’s current situation, I only know the approximate difference in strength between her and the other two True Divinities. If Divine Dream and Soaring Feather God King were to be compared alone, it’s hard to say if either of them could truly harm the other. But if Divine Dream were to face Astral Vault God King, she has a considerable superiority over him. This is mainly due to the height of the Laws they cultivated when they stepped into True Divinity and also because her cultivation methods naturally restrain his. Astral Vault God King has a formidable mortal body, but he is weak when it comes to the spiritual sea and mental strength. Against someone like Divine Dream who is familiar with illusions and soul attacks, he suffers far too great a loss. Divine Dream said she used her divine dream space to trap Astral Vault God King and then she was able to lead Soaring Feather God King around. Like this, she was able to fight one against two.”\\n\\n “But this is also because Astral Vault God King and Soaring Feather God King have no intentions of going all out against Divine Dream. If they did, Astral Vault God King could simply burn his blood essence and even if he can’t see through the illusions of the divine dream space, he can still use brute force to break through the divine dream space’s force field enchantment.”\\n\\n “I see…” Lin Ming let out a sigh of relief. He was originally afraid something might have happened to Divine Dream since she was fighting one against two, but it seems the situation was better than he hoped.\\n\\n “Haha, you don’t need to worry about Divine Dream. I’ve known her for more than 10 million years and I personally know just how fierce she is. In the past, she and I both participated in a great tournament similar to the Divine Realm First Martial Meeting. Afterwards, we adventured together, passed through dangers together, and explored mystic realms together. She has always been creating miracles. Between her and I, our relationship is just like…” As Empyrean Vast Universe spoke to here, a thoughtful expression crossed his face. He laughed and said, “It’s just like you and Hang Chi. You always seem to be making moves that defy all common sense, and when it comes to you, there doesn’t seem like there is anything that is impossible. As for Hang Chi, he’s an honest and diligent person who works hard on his cultivation, just like me! These days, honest people like me really find it hard to keep up, haha!”\\n\\n From the time he saw Lin Ming, Empyrean Vast Universe didn’t stop laughing. In the last six thousand some years, he hadn’t smiled so brightly and openly.\\n\\n “Well, enough of me. Let’s go, there are many other people waiting to see you.”\\n\\n Lin Ming contacted Emperor Shakya who in turn contacted the different human influences through the sound transmission marks he had. For a long time, innumerable human influences started gathering at the Hidden Dragon Galaxy.\\n\\n At this time, outside of Demon Fairy Palace, a massive number of ordinary warriors gathered. A part of them were Holy Lords, some were young Divine Lord powerhouses, and there were even some Divine Transformation realm juniors who weren’t strong enough to enter the battlefield and were only part of the reserve forces.\\n\\n Seeing Lin Ming appear, all these warriors began to crazily cheer.\\n\\n When a nation was in danger, whether it was warriors seeing a beloved leader or the common people seeing their warriors return in triumph, it was difficult for them to suppress the excitement in their hearts.\\n\\n “Lin Ming undying! Humanity forever!”\\n\\n It was unknown who started shouting this, but others also began shouting it in agreement.\\n\\n “Lin Ming undying! Humanity forever!”\\n\\n “Lin Ming undying! Humanity forever!”\\n\\n The cheers were like tsunamis crashing into each other. A million martial artists shouting out at the top of their lungs created a terrifying roar that echoed into the heavens, shaking the vast starry skies!\\n\\n Warriors yelled with arms raised high. Some people couldn’t help but happily lift their weapons. Young girls openly sobbed and held onto each other. At this time, everyone’s hearts were joined as one, beating in unison.\\n\\n Every person, whether they were ordinary warriors, officers of the army, Empyreans with long lives who had passed through the difficulties of wind and rain, or even Lin Ming who stood above the walls of Demon Fairy Palace looking down at the world below, at this moment, everyone seemed infected by this atmosphere. Their blood boiled over as they shouted out loud, their voices brimming with joy and excitement that they were unable to restrain.\\n\\n They all deeply felt that in these dangerous times, humanity was joined together in an unprecedented moment of unity and bravery!\\n\\n At this time, even Lin Ming couldn’t help but feel hot tears stream down his face. In his heart, he knew that this was the race he would belong to forever and he would also fight for his people forever. His friends, his family, his descendants, they were all part of the human race and were something he could never abandon…\\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-2050","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
