{"id":56119,"no":2174,"title":"MW Chapter 2154","content":"Chapter 2154 – Awakened Dream … … … “This sword is quite good! The rate of your rising strength is such a pleasant surprise!” The Soul Emperor laughed. At the same time, a horrifying force field spread out from him. It covered Sheng Mei’s entire body, instantly freezing her so that she couldn’t move an inch! As for the Soul Emperor’s palm, after pausing for a moment, it continued to crash down on Sheng Mei’s belly with unstoppable momentum! Roiling death energy swelled up beneath the Soul Emperor’s palm, causing the blood in Sheng Mei’s body to freeze over! She struggled to break free from the force field, however… Peng! A dull sound echoed out, as if something had been broken. Sheng Mei spat out a mouthful of blood as she tumbled backwards like a butterfly with torn wings. In that moment, what was strange was that she didn’t feel pain in her body. Rather, she felt as if in her life she had lost something of extreme importance, something that left her despondent and utterly discouraged… Over? It was all over… This was originally nothing but an impossible dream to begin with… Sheng Mei could feel her consciousness blur. As for the pain in her belly, it couldn’t compare to even the tiniest percentage of the pain that wracked her heart. She felt as if her entire life was laughable. She was well aware that from start to finish, she was only a tool. She wanted to leave behind something in the senseless life she lived. She had once placed hopes in Lin Ming, but Lin Ming had actually been personally destroyed by her. She thought that there would never be color again in her life. But, when she left the Sky Spill Continent, departed the 33 Heavens and arrived at the Dark Abyss, she suddenly discovered that she was pregnant. This was a matter that left Sheng Mei’s heart completely bewildered. Her state of mind was incomparably complicated. She never thought that she would experience such a day. She never imagined that after sealing away her heart, dooming herself to a life of loneliness and sorrow, vowing to never contaminate herself with useless feelings and emotions, there would actually be a day when she was a prospective mother. Lin Ming and Sheng Mei were different races to begin with, so the chances of her becoming pregnant after sex was incredibly low. However, she had underestimated the strength of Lin Ming’s bloodline. The appearance of this child left Sheng Mei at a loss for what to do. The father of this child had been personally destroyed by its mother. Moreover, because of a variety of reasons, there was no way she could somehow allow this child a chance to survive. But at this time the Soul Emperor just happened to go into seclusion to refine the Eternal Soul. Sheng Mei could temporarily guarantee this child\u0027s safety. However, she knew that once this child was truly born, it would inevitably stir up the mark and energy that the Soul Emperor had left in her spiritual sea. Then the Soul Emperor would surely know what was happening. Although he might not be able to immediately catch up to her because he was in seclusion, once he emerged she would surely have to withstand his rage. And this child would undoubtedly die. Sheng Mei once thought she could let this child live the life of a thorough mortal. In the Dark Abyss, she could open up a beautiful world like one from the 33 Heavens. She could buy up numerous ancient race slaves, allowing them to become residents in this world and to thrive and live on. Then, she could allow her child to be born. She could accompany her child, gazing at the clouds, watching flowers bloom and fade. She could satisfy all her child’s desires and live a life of good fortune and happiness. Watching her child from birth, she could watch her child slowly grow, learn to walk, marry someone, age, and eventually pass on in their sleep… She could only give this child of hers a short and brief life, a full and complete life before the Soul Emperor left seclusion. She could have her child believe themselves a mortal, living in their own idealistic dreamland… However… when Sheng Mei decided to do this, she hesitated once more. She couldn’t imagine what would happen once she poured all of her love and joy into this child, and what would be left of her after her child died… To live on through memories? A small bug that lived amongst the withered leaves and branches would never know the true beauty and greatness of the world. If one wished to see all the world had to offer, they had to step towards the peak of martial artists. But because there were too many fetters, it was impossible to strengthen one’s heart… However… If one were to abandon all their fetters, what would be left over of life? In these days, Sheng Mei was lost in a helpless daze. She watched the child grow in her belly with every passing day, and she knew she couldn’t sit back and allow this to continue. Thus, she sealed away the growth of that child. She found it hard to imagine her future, nor did she want to so easily arrange the future fate of her child. But if this continued and the Soul Emperor were to leave seclusion, everything would be doomed to tragedy. Sheng Mei felt as if she had rushed into a dead end. Would she also have to lose the only sustenance of her life…? “Mama… why are you worried?” As Sheng Mei was lost in confusion, a supple and weak child’s voice echoed in her ears. This voice seemed to touch the softest parts of Sheng Mei’s heart. Sheng Mei trembled! She lowered her head and stared at her belly, her mind violently shaking like turbulent waves. She could feel faint life fluctuations coming from her stomach. This was her child, her flesh and blood! In an instant, all the faith and will she had built up over the tens of thousands of years of her life instantly collapsed upon hearing the weak and tender voice of this child. “Mama… I am so hot…” The child’s voice blurred, seeming as if it were in extreme pain. “There is a fire burning me, I can’t open my eyes…” Fire? Where did fire come from!? Sheng Mei was left panic-stricken. She probed her belly with her divine sense, and what she saw left her drowning in a nine nether abyss! There was a dark and ominous strength in her belly, like abyssal flames that burned away all. This strength wrapped around her child, wanting to melt away this tiny life! This was the strength that the Soul Emperor had left in that palm just now! “No!” Sheng Mei felt as if someone were cutting open her heart with an axe. She placed her hands on her belly, using the power of her cold ice to neutralize the Soul Emperor’s evil strength and protect her child! However, when Sheng Mei’s cold ice strength touched those dreadful abyssal flames, it was like snowflakes dropped in boiling water, instantly melting away. The Soul Emperor’s strength was far too powerful. With her strength it was impossible to shake him. The disparity was too great! “Mama, I think I will die, it hurts so much…” “No… no… my child, mama will save you. You must persist, you must fight on…” Listening to the continually weakening child\u0027s voice, Sheng Mei’s heart was already crushed to pieces. She hated her herself, hated herself for being weak! What a ridiculous so-called proud daughter of heaven, what a pathetic peak of martial arts; she couldn’t even protect her own child! “Mama… I can’t… last much longer… I have been inside mama for so long that I can’t remember… but I actually want to be born… I want to see mama… “My mama… surely must be beautiful…” That blurry child’s voice stopped here, like a dream that was suddenly shattered. Sheng Mei’s hands trembled and her soul shivered… but, there was no longer the tiniest sound coming from her belly, no longer the weakest life fluctuations. Everything seemed as if it never existed to begin with… “No… no… no!!!” Sheng Mei grasped her belly with all her strength. Her nails pierced through her smooth flesh and dripped with blood. Her eyes turned blood red and her hair scattered out, like a demon of the night! Her child had died. In her life, she no longer had her final sustenance! Sheng Mei looked up. From her eyes, two trails of blood red tears flowed out! Soul Emperor! She wished to eat his raw meat, drink his fresh blood! In that moment, Sheng Mei burnt all the strength of her soul. Like an erupting volcano, it broke into her spiritual sea, forming a terrifying storm! Kacha! Kacha! Kacha! With the sound of something breaking apart, in Sheng Mei’s mind, she burned away at everything with the horrifying storm formed by her soul. She constantly attacked a black rune. This black rune formed a net of light that imprisoned this storm. However, a crack suddenly appeared above this net of light! The black rune couldn’t persist for much longer! Ka ka ka ka! More and more cracking sounds filled the air and the rune became increasingly dim. This storm was unleashed and could no longer be tamed; it became increasingly powerful. Cracks spread throughout the net of light, and then, the strength it locked in suddenly erupted. Peng! With a loud explosive sound, strength crazily swelled outwards. The net of light as well as the black rune were torn to shreds! The black rune was a spirit mark that had been sealed away in Sheng Mei’s spiritual sea. But at this moment, it blew apart to pieces! Meanwhile, separated by endless space and time, in a dry and desolate soul sea of torment that seethed with innumerable bones… Above this sea of torment sat a pale youth with snow-white hair. He sat on an island formed from piles of bones, meditating in quiet. He had the appearance of a youth, but his body emitted a death energy that only a corpse should have. This was the 33 Heavens’ Soul Emperor! After stealing Lin Ming’s Eternal Soul in the Sky Spill Planet, he had gone into seclusion for nearly 10,000 years. No matter how the waves of the soul sea stirred up, no matter how the bones floated, he was like a stone sculpture that remained unmoved for 10,000 years. But today, his eyes flashed open. He looked somewhere in the void, his filthy eyes flashing with profound astonishment. “How… is this possible?” The old youth stood up. His snow white hair fell down his back like a waterfall, making him look like a ghost. His expression that was like a clear mirror that never saw any violent fluctuations of emotions for hundreds of millions of years, was now actually filled with amazement and disbelief. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-2154","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
