{"id":56152,"no":2207,"title":"MW Chapter 2187","content":"Chapter 2187 – The Limit of Pain\\n\\n …\\n\\n …\\n\\n …\\n\\n Over a hundred giant beams of world strength shrouded in the aura of demons came crashing down, each one dazzling, their brilliance spreading out for tens of thousands of miles.\\n\\n It was like a river of stars came falling down from the skies, their massive momentum slamming into the earth, causing the world to shake.\\n\\n The Emperor Bone Sea began to boil over as monstrous demonic auras filled the air. The mysterious rules and the countless remnant traces of ancient demons were quickened.\\n\\n Steaming black energy filled the air, seemingly filled with the forms of ancient demons. They formed a storm that raged out in all directions.\\n\\n Bang!\\n\\n Lin Ming bore all of this immense world strength. His body that glistened like jade was suddenly curved by the impact into a tightened bow. His skin, his skeleton, everything emitted creaking sounds that blasted out like the roars of dragons and cries of phoenixes.\\n\\n Beneath this tremendous pressure, he remained unyielding. His tendons twisted over the surface of his body like snakes. He raised his arm and hands up and roared into the heavens.\\n\\n At the same time, Sheng Mei was also joined together with him. Her strength blended together with Lin Ming’s and together they withstood this baptism of world strength!\\n\\n Ka ka ka!\\n\\n Lin Ming’s muscles and blood vessels began to rapidly crack. An indescribable pain shot into his spiritual sea.\\n\\n This sort of feeling was as if his mortal body had been tossed beneath a stone mill, forcefully grinded down by it!\\n\\n However, Lin Ming’s consciousness remained clear and sober the entire time.\\n\\n Sheng Mei held tightly onto Lin Ming’s hand, blood flowing down from her lips. She withstood less energy than Lin Ming but she was also weaker than Lin Ming. In terms of the pain she withstood, it was no less than Lin Ming.\\n\\n And at this time, not too far away, Immortal Sovereign was watching all of this occur with a calm expression. A treasure sword had to be tempered and sharpened and the fragrance of plum blossoms only emerged after the bitter cold. Compared to the upcoming apocalypse of existence, what Lin Ming and Sheng Mei withstood was nothing.\\n\\n Weng –\\n\\n Weng –\\n\\n Weng –\\n\\n Between Lin Ming and Sheng Mei, the blending of energy became increasingly intense.\\n\\n This strength was several times greater than an ordinary occurrence of the abyssal ritual.\\n\\n Although Lin Ming and Sheng Mei were withstanding it together and dividing the pressure between the two of them, this still far outstripped an ordinary abyssal ritual.\\n\\n In particular, Lin Ming withstood the majority of the energy. He clenched his teeth and persisted.\\n\\n There were too many things he carried on his shoulders. He had experienced countless tribulations, countless perilous life and death situations, and had even experienced the boundless ups and downs of life. Pushing his way through all of that he arrived here today, shouldering the destiny and hopes of innumerable people. Because of that, he absolutely could not allow himself to fail here!\\n\\n Beneath the galvanization of the world strength, Lin Ming’s body instinctively evolved strands of the Great Dao Laws that he excelled in the most to compete with the world strength, making it even better to swallow and refine them.\\n\\n As these Laws appeared, the raging world strength seemed to solidify, the essence condensing into little droplets that slowly revolved around Lin Ming.\\n\\n The strength of the world slowly steadied, forming a sealed space where they circulated within.\\n\\n As the 100 demons watching from the side saw this, their eyes began to shine.\\n\\n At this time no one was mad anymore. In fact, there was even a hint of heated fanaticism in their hearts!\\n\\n Lin Ming and Sheng Mei were truly able to withstand the baptism of the Emperor Bone Sea’s world potential. Perhaps they could truly rise from here and help them exact vengeance upon their enemy!\\n\\n “Everyone, let us transfer the world strength of the Emperor Bone Sea together and stabilize that force field.”\\n\\n “There might be feuds between us and we may be at odds with each other, but let us work together today and give this our everything!”\\n\\n Of the 100 some demons, no one dared to slack off. Even the six demons who clashed with Lin Ming had slowly put away their embarrassment and rage towards him. First, they didn’t want to do anything that would offend the other demons here, and secondly they truly, truly wished to break from these cages and take revenge against the Soul Emperor to obtain true freedom, true relief from this hell.\\n\\n Beneath the joint efforts of all the demons, they began to gather all the world strength they could summon to the area around Lin Ming and Sheng Mei.\\n\\n An invisible force field completely covered Lin Ming and Sheng Mei. This force field was like a giant cocoon that isolated the Laws and formed a sealed space, allowing Lin Ming and Sheng Mei to live in an independent world. And this independent world contained an incredibly rich world strength!\\n\\n The abyssal ritual was an extremely long process but it only took the 100 some demons several hours to contribute their world strength. Afterwards, the world strength would seal itself into a force field and the trial challengers would soak within it to slowly refine it.\\n\\n After the force field was completely sealed up, Lin Ming and Sheng Mei felt the excruciating pain rise by several degrees.\\n\\n This world strength continually crushed and pulverized their mortal bodies, soul, and even inner worlds. Burning hot energy raced through their pores, acupoints, breaking into their meridians and blood vessels as it recklessly galloped about.\\n\\n If the pain before was like being thrown beneath a grinding pan, then now, while their bodies were being grinded away, they were also being boiled in scalding oil!\\n\\n Beneath the tremendous impact of energy, their flesh and blood started to tear open and flip over!\\n\\n However, within this force field, special Laws existed in the rich world strength that increased the rate at which Lin Ming and Sheng Mei’s cracked flesh regenerated.\\n\\n Their flesh cracked open and regenerated again and again. The two of them had incredibly powerful mortal body foundations, but even so, this sort of endless cracking and regeneration consumed a mind-boggling amount of energy!\\n\\n They did not take pills nor did they drink spiritual liquids. The energy they needed to consume would have to be derived from the surrounding world strength.\\n\\n In this repeated tempering, their bodies absorbed the surrounding world strength without end. By letting their bodies crack open and regenerate again, they used this method to consume this strength!\\n\\n And, this process would continue for years!\\n\\n Pain. If pain only lasted for a while, then many people could grit their teeth and bear it. But to withstand such pain for dozens of years or even hundreds of years, it was enough to make one go crazy!\\n\\n When trial challengers were placed in the abyssal ritual, this was the test of their will, the test of withstanding the massive level of pain!\\n\\n If their potential was lacking, then their bodies would explode from being unable to withstand the great volume of energy.\\n\\n If their willpower was lacking, then they would go crazy from the pain!\\n\\n If their souls weren’t strong enough, then the continuous impact of pain would turn their souls to ashes.\\n\\n Lin Ming and Sheng Mei existed at the peak when it came to these three aspects. Even so, to withstand such agonizing pain for such a long time was still a difficult challenge for them.\\n\\n “You must both remember a single word – endure!”\\n\\n Immortal Sovereign’s words pierced through the boundaries of the force field and entered into Lin Ming and Sheng Mei’s ears.\\n\\n “Gather your will and never lose your consciousness. Imagine yourself as the deep and heavy earth. No matter what pain you experience, you must remain motionless! Defend your minds at all costs. If your willpower ever fails then the world strength that is in your body will no longer be controlled by you. Once that happens, not only will your body not regenerate but you will be torn to shreds. If that happens you will be deader than dead. You will become a lonely soul here that is suppressed in the great array formation beneath us, becoming nourishment for the Demon God’s Tomb!\\n\\n “What you need is to forget this pain and control your nerves, even treating this pain as pleasure. Only like this can you last for a hundred years or even hundreds of years!”\\n\\n Endure!\\n\\n Forget the pain. That was easy to say, but how difficult was it to do!?\\n\\n However, no matter how difficult it was, Lin Ming and Sheng Mei would still give it a try. With the massive levels of soul force they possessed they would continually push at their boundaries and try to transform themselves.\\n\\n “Control my nerves, drive out the pain, and even treat this pain as pleasure!”\\n\\n These thoughts raced through Lin Ming’s mind.\\n\\n He tried his best to forget this pain. But, with the feeling of being drowned in boiling oil and crushed beneath a grinding pan coursing through his body, how could it be so easy to forget?\\n\\n Slowly, Lin Ming endured such pain for a month. But no matter how powerful his divine soul was, it would still slowly weaken.\\n\\n At this time Lin Ming’s face was as pale as paper. Although he had plenty of energy, he had to sit motionlessly and be tormented by agonizing pain, so how could he have a happy expression?\\n\\n “Pain comes from the body, but it actually reflects in the soul and mind… if I can control my soul, then no matter how painful it is it cannot be this fierce…”\\n\\n As Lin Ming was pushed to the limits of what he could bear, this thought flashed in his mind.\\n\\n “My soul, because it has been solidified by the Magic Cube and after having been cultivated through seven reincarnations, has already re-entered the realm of the Eternal Soul. If I had to describe it in words, it should be unchangeable and immutable.\\n\\n “To have an unchangeable and immutable soul, I should be as steady as the great earth. How could I not be able to withstand such trivial pain of the flesh?”\\n\\n Lin Ming roared out in his heart. In this moment, his consciousness became crystal clear and he felt the pain in his body reduce by a great deal.\\n\\n His mortal body was still being torn apart and energy was still burning through his meridians, but all of that lessened with this new comprehension.\\n\\n Lin Ming could feel that the tearing pain of his mortal body caused a faint excitement to stir in his soul. And the feeling of his meridians being burned was similar to soaking in a hot spring bath. Although it still hurt, it was no longer unbearable like before.\\n\\n He felt as if he truly turned into the deep and steady earth, capable of withstanding the baptism of world strength without a single movement.\\n\\n This sort of comprehension had only just begun. But as his comprehensions deepened, Lin Ming’s abyssal ritual would become increasingly smooth until he absorbed all the world strength he could!\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-2187","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
