{"id":56154,"no":2209,"title":"MW Chapter 2189","content":"Chapter 2189 – Demon Lord … … … Weng - ! The 30 level demon pagoda began to quietly shiver, as if some incomprehensible being was emerging. Even the demon pagoda itself seemed to find this existence difficult to suppress. “It’s actually him?” “The master of the 30 level demon pagoda! Heavens! He must have been in deep slumber for the last 20 billion years. I even thought he had been freed from this hell and no longer existed…” “He also wants to help?” The numerous ancient demon emperors were bewildered. The Emperor Bone Sea had already existed for over 100 billion years, and throughout this time, countless great demons were imprisoned here. They had to endure endless pain and loneliness in the form of remnant souls. And in the Emperor Bone Sea, there was a supreme ruling powerhouse that appeared 20 billion years ago. He had been locked inside the 30 level demon pagoda around the dark altars. Because it had been so long ago, not even the ancient demons remembered his true name. They only knew his title – Demon Lord. He was once the ruler of the Dark Abyss. He didn’t rely on the abyssal ritual to become a totem level abyssal, but instead used his own strength and talent to step into the realm Beyond Divinity. The truth was that even during the time he was alive, no one would mention his name. Because of his great strength and the world’s awe towards him, his name had become taboo, and all demons would forever refer to him as the Demon Lord. In the Emperor Bone Sea, there was no one who dared disrespect the Demon Lord. The abyssals revered powerhouses. However, although Immortal Sovereign was powerful, he was still from an alien race. As for this Demon Lord, he was from their own race. Moreover, although the Demon Lord’s demon pagoda was slightly shorter, the truth was that his strength wasn’t necessarily any weaker than Immortal’s; perhaps he was even stronger. This was even more true when considering that just before Immortal Sovereign perished, he transferred a massive amount of his life essence and strength of his Laws to his daughter. The reason Immortal Sovereign was locked into the 33 level demon pagoda was because the Demon Lord had arrived at the Emperor Bone Sea at an even earlier time. And when Immortal Sovereign entered the Emperor Bone Sea, the Demon Lord had already fallen into a deep slumber. The two of them had never had direct contact with each other. Immortal had always sensed the existence of the Demon Lord and knew that he had not vanished. However, the Demon Lord’s heart and mind had entered a state of deathly stillness, and thus he faced the Emperor Bone Sea and all else with nothing but passive indifference. The Demon Lord was already used to his deep slumber. But today, as Lin Ming and Sheng Mei reached the critical point in their breakthrough, he had finally awoken. Immortal Sovereign slowly turned around and looked at the 30 level demon pagoda. A smile curved up on his handsome features. “Immortal!” The Demon Lord called out Immortal Sovereign’s title. As the two greatest powerhouses of the Emperor Bone Sea, they were able to speak through their divine souls and sense each other’s presence. As for the third and also the highest 36 level demon pagoda, the truth was that it was empty. In other words, these two were the masters of the Emperor Bone Sea. “Demon Lord! Well met!” “Hahahaha!” The Demon Lord suddenly laughed, his voice loud and filled with the changes of time, like a great bell that smashed into the minds of the demons present. “We come from different races and different times, yet today we can join forces!” “Perhaps this is our predestined fate!” “What you said is right, this is fate! But the reason we join forces is to break out of the shackles of fate!” As the Demon Lord spoke, an incomparably thick demonic aura gushed out from the 30 level demon pagoda as if it would swallow the world. Turbulent waves of energy began to emit from the pagoda. And at this time, Immortal Sovereign also moved. For these last several hundred years he had been saving his strength to help Lin Ming and Sheng Mei close this final distance! Together, the Demon Lord and Immortal Sovereign gathered their strength into the independent world where Lin Ming and Sheng Mei were. A wild and tyrannical world strength, in addition to the strength of the books of ceremonial rites, rushed into the independent space over twice as strong as the previous saturated state of world strength! For a time, the independent world Lin Ming and Sheng Mei were in began to rapidly expand. The void turned into chaos and countless divine chains of order tore through the endless skies like bolts of raging thunder. Brilliant hues of primordial energy began to revolve into towering mountains and rushing rivers. Mighty demon dragons growled at the air and kirins roared into the skies as this mysterious world began to take full shape. Lin Ming and Sheng Mei suddenly felt an immense pressure. But at this time, they were breaking into the True Divinity realm, and what they needed was an incomparably large flood of energy! Whorl – Whorl – Whorl – A shocking strength appeared from the deepest depths of Lin Ming’s body. This was an unknown world. It contained perfect Great Dao Laws, mountains, rivers, and life forms evolved from spiritual energy. Boundless continents and surging oceans existed, and even celestial bodies hung high in the heavens, casting down their brilliance. This was Lin Ming’s inner world. Currently, he needed to use this world to link to the world strength of the Emperor Bone Sea, evolving the hidden meanings within this world and taking it into his own body to finally reach True Divinity. As Lin Ming’s inner world appeared, it seemed to become the center of all. Weng – Weng – Countless divine chains of Laws wove together, extracting all the surrounding energies. For a time, behind Lin Ming and Sheng Mei, giant Supreme phantoms appeared! When a martial artist reached the boundary of the Nine Divine Shifts, they could evolve their own inner world, and by developing their inner world they could increase their strength. At the World King boundary, that was to refine a world to enter their body and fuse with their inner world. At the half-step Empyrean realm, one evolved a Supreme phantom within their inner world. At the Empyrean realm, the Supreme phantom condensed into essence, and the Supreme phantom stretched through the heavens and earth of the inner world, thus being called an Empyrean! As for the True Divinity realm, that was to fuse the inner world’s Supreme phantom into one’s flesh and blood and divine soul, merging together into one singular being! Like this, one was the divine god of the world, and the divine god of the world was themselves! This was a true divine god, a True Divinity! Lin Ming and Sheng Mei had incomparably deep backgrounds. The Supreme phantoms they formed had developed features that were completely similar to themselves. The only difference was that the expressions of these phantoms were filled with the cold indifference of a god. It could be said that these Supreme phantoms were the ‘godheads’ of Lin Ming and Sheng Mei. Lin Ming leapt upwards, gathering the surrounding stable world strength, bringing it all into his inner world with his Supreme phantom. Bang! As energy collided, countless divine chains of order formed in this world, all of them wrapping around Lin Ming and Sheng Mei’s supreme phantoms, locking them down! These divine chains were heavy and profound, countless and complex. They formed a giant cocoon of chains made from numerous overlapping layers. However, as Lin Ming and Sheng Mei saw this, neither of them was surprised or overjoyed. Behind them, their Supreme phantoms began to move. They erupted with a terrifying strength as they struggled to break free from these divine chains and absorb them into their bodies for their own use! To become the one controlling these divine chains, that was one of the necessary symbols of a True Divinity! However, the divine chains that formed when Lin Ming and Sheng Mei were breaking into True Divinity far outstripped an ordinary True Divinity’s, whether it was in quantity or quality. In the hazy world, bolts of lightning shuttled through space. Time and Space Laws shattered into fragments after being destabilized by the momentous impact of energy. All the Great Dao rules lost their source strength. Only Lin Ming and Sheng Mei’s will and the will of the Emperor Bone Sea’s world strength began to mutually crash and push each other forwards! Runes collided in the air, battling each other. The excessively rich world strength finally turned into an ancient divine demon that hurtled towards Lin Ming and Sheng Mei! Lin Ming and Sheng Mei’s eyes blazed with burning fighting spirit. They stepped through the void and fought with the ancient divine demon! Rumble! Rumble! Rumble! Energy exploded. Laws danced in the air. Lin Ming’s newborn lossless body was wet with blood. However, the ancient divine demon formed by the massive amount of world strength was finally routed by the joint efforts of Lin Ming and Sheng Mei and turned into a wonderful and auspicious strength that was absorbed by the two of them. The True Divinity boundary was close at hand! The two Supreme phantoms behind them also started to slowly fuse into their mortal bodies. Bang! Bang! Bang! In that moment, Lin Ming’s bones seemed to be blasted with countless thunderbolts. Every explosion deafened the ears, every one leaving behind flashing runes. In the middle of these runes, they were either occupied by god kings or demons. Some god kings formed seals in their hands with towering trees standing tall behind them, thrusting into the clouds. Countless jewels seemed to drape down amongst them, wrapping them in solemn visage. There were also peerless death gods that grasped bloodied and ominous weapons. They stepped upon countless bones, filled with a grim and threatening atmosphere. These were the manifestations of the power of divinity and demons within Lin Ming’s body, and represented his greatest strength. And, these phantoms of divinity and demons that appeared were close to the source of the Great Dao. Even the many ancient demons that were watching were also able to gain some comprehensions from witnessing this, and all of them couldn’t help but exclaim in admiration at Lin Ming’s Laws. At this time, behind Lin Ming, a massive wheel appeared and an Asura with overwhelming slaughter energy stood atop it. Its head reached the skies and its feet stepped on the earth. It was huge and without limit. Countless stars lingered about this giant wheel. As the Asura appeared, yin and yang manifested beneath its influence and chaos wrapped around all, seeming to shroud over the entirety of the cosmos. It was as if the Great Dao of life and death was being interpreted here, shocking to the extreme. This contained the mighty aura of the Asura Road Master, and was a peak manifestation of Lin Ming’s comprehensions of the Asura Laws. On some stars, dao palaces appeared. These dao palaces were extraordinary and ancient, communing in resonant with the world as they appeared. Starlight from trillions of stars appeared, blooming and falling down. They resonated together, weaving into vibrant galaxies. Each galaxy had celestial mountains floating within, had ancient nations overflowing with spirit, had trillions upon quadrillions of people living freely and sounds of distant sutras that shook into the past and future – these were the recitations of countless supreme beings chanting in unison. This was the Nine Stars of the Dao Palace, another road that Lin Ming had walked to the peak. Atop these stars, red lotuses began to slowly bloom. Atop these red lotuses, the Concepts of Life and Death evolved, fading away and then being reborn. This was the essence of Lin Ming’s understandings of the samsara of life and death. Even the creator of the Holy Scripture, Immortal Sovereign, admired the comprehensions that Lin Ming added in. At this time, Immortal Sovereign knew that the Supreme phantom behind Lin Ming had fused with his flesh and blood. Now, it was only a matter of time. In at most several hours, Lin Ming would reach True Divinity! At that time it was unknown just what level of strength he would reach! After this, he would bring the hundreds of ancient demon emperors that even though they had gone crazy over the years, still managed to retain their intelligence, and they would fight the Soul Emperor together! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-2189","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
