{"id":56197,"no":2252,"title":"MW Chapter 2232","content":"Chapter 2232 – A Different World\n …\n …\n …\n One’s fighting spirit was aroused by the first call, faded by the second, and then exhausted by the third. If the first strike wasn’t able to heavily wound the Soul Emperor then the following battle would become far more difficult!\n “You have really left me surprised…”\n In the distant void, the Soul Emperor’s hair was scattered all about him. A macabre smile spread across his features. In these years of seclusion Sheng Mei’s strength had risen by an astronomical degree. In addition to Fishy and the Purple Card, when they gathered all of their potential to attack together, even though the Soul Emperor was prepared he had still been injured.\n The arm he used to block the Purple Card had already broken and was now hanging limp at a strange angle. But although the Soul Emperor had been wounded, a happy expression spread wildly across his face.\n “I expected you to take advantage of my weakest moment to risk your life in a desperate attack, but I didn’t expect your strike to be so powerful. You have progressed far too quickly. In the past I only wanted to train you to open the Eternal Wall, but I never imagined I would create such a perfect work of art. If you didn’t betray me, just how wonderful would that have been?”\n The Soul Emperor’s voice overflowed with killing intent. Although he thought it was a pity that he would have to destroy Sheng Mei, he didn’t have any intention of showing mercy or forgiveness.\n And, ruining the most perfect thing could also bring him pleasure.\n Ka ka ka!\n The Soul Emperor’s broken arm was rapidly regenerating.\n At the same time, beneath the Soul Emperor, the Eternal Wall continued to break down and explode. Violent flows of energy smashed into his body, but the Soul Emperor seemed mindless of it all. His gaze and sense were still completely locked onto the Amethyst Origin Crystal that was not too far away. He knew that Sheng Mei still had strength remaining and wouldn’t give up here; she would continue attacking.\n But her attacks wouldn’t have any great effect on him.\n This was the disparity between their boundaries.\n The Soul Emperor moved towards the Amethyst Origin Crystal, one step at a time. With the Soul Emperor as the center, a force field projection of the Demon God’s Tomb shot out, blocking the surrounding void.\n Bang!\n The explosions all around the Soul Emperor became increasingly fierce and crazy. Beneath his feet, the Eternal Wall was falling downwards. Without the support of the force field, the dark earth collapsed beneath its own weight. It began to fall into the Dark Abyss in massive chunks. This apocalyptic sight was as if the end of times had come!\n A terrifying energy erupted from the Eternal Wall. Originally, the Eternal Wall was linked together with the void. And now because the Eternal Wall had collapsed, a massive chunk of space was torn apart and an unexpected scene occurred.\n A spatial fissure over a thousand miles long appeared after the space tore. And within this spatial fissure, the aura of the world was hazy and ethereal, as if… it were a completely different world.\n “Mm?”\n Seeing this massive spatial fissure, the Soul Emperor was stunned.\n This is…\n This world was clearly different from the world of the Demon God’s Tomb, and the Soul Emperor also felt that this wasn’t the 33 Heavens.\n Such a world was hiding within the Dark Abyss? How could this be possible?\n But at the same time, as Sheng Mei saw this within the amethyst space, tumultuous waves rose up in her heart.\n She had seen this piece of world before!\n She didn’t know what this world was or where it had come from. But over 10,000 years ago, she had discovered the entrance to this world by accident.\n Within this world, all rules were different. These rules seemed completely independent from the system that constituted the 33 Heavens and Dark Abyss.\n In truth, the Dark Abyss and 33 Heavens came from the same roots. The Dark Abyss was the predecessor of the 33 Heavens, the remains of the previous universal era. From this aspect, the two worlds were originally one body.\n But this other world was actually completely different!\n Sheng Mei didn’t know why the entrance to such a world would appear in the Dark Abyss nor did she know what it was. After she accidentally discovered this world, she hid away this secret.\n This world’s mysterious Laws caused Sheng Mei to have a foreboding feeling the first time she saw it.\n That was… she felt that the entrance to this world only went one way, and after leaving to enter this world, there was no coming back.\n Sheng Mei’s original plan was to use this world as her escape route. If her contradictions with the Soul Emperor truly rose to an irreconcilable level, then she would simply leave. At that time, Sheng Mei hadn’t known of her dark and dire fate, nor did she know what the Soul Emperor was planning to do with her. Although she and the Soul Emperor were like water and fire, that wasn’t a good enough reason for her to flee to a different world which she wouldn’t be able to return from.\n But afterwards, Sheng Mei discovered that the entrance to this world was slowly closing. It wouldn’t be long before it completely disappeared…\n Thus, she mentioned this world to someone, and that person was… Lin Ming!\n 12,000 years ago, Lin Ming was at the Holy Lord realm. He had just defeated the Good Fortune Saint Son and humanity would soon face a great war with the saints.\n In order to save humanity, Lin Ming ventured out in all directions in search of all possibilities. He even held onto the faintest glimmer of hope that he could come to the Soul World to look for Sheng Mei and negotiate with her. If possible, humanity could ally with the spiritas to deal with a ‘common enemy’ in the saints.\n At that time, Sheng Mei already knew the truth that the Soul Emperor was an abyssal. In her eyes, humanity’s war with the saints was basically meaningless, and even weak. And as she saw Lin Ming toiling so hard for a race that didn’t have any ability to resist the great calamity they were about to suffer, she simply sighed. She sympathized greatly with Lin Ming and even felt… pity.\n Lin Ming asked why Sheng Mei sighed, and her reply was – “Sighing for your destiny.”\n Lin Ming was puzzled. However, Sheng Mei didn’t fully explain anything to him. Instead, she simply asked him whether or not he wanted to follow her to some place. They wouldn’t go to the Divine Realm nor would they go to the Soul World. Once they left, they would go for a hundred million years!\n The so-called hundred million years was in truth a lifetime. They would go far away from the great vortex of the great calamity, leaving everything behind so that they could pursue the road of martial arts with all their hearts.\n At that time, Sheng Mei still had her own ambitions. She hoped that one day she would be able to step Beyond Divinity and create her own world.\n She thought that Lin Ming was a suitable companion as he had enough talent to grow to such heights. If they could cultivate to the peak of martial arts together then they could imitate the Immortal Sovereign and his wife from 10 billion years ago, stepping Beyond Divinity together.\n Moreover, once they went to that mysterious world that was about to be sealed up, they could rid themselves of the Soul Emperor’s control just like that, completing everything in a single swoop!\n Of course, going to a completely unknown world already meant tremendous risks. These risks didn’t come from the original dangers of that world, but whether or not that world was suitable for them to cultivate.\n But, when Sheng Mei asked Lin Ming, his reply had actually been…\n Refusal.\n Sheng Mei wasn’t surprised. She believed that her and Lin Ming’s fate would end there, and if they met in the future it would only be as enemies.\n She never thought that all sorts of things would happen between her and Lin Ming in the future, and the two of them would even have a daughter…\n Life was like a dream and perhaps fate was already an established road. But for those that continued to look forwards into the future, everything still seemed too inconceivable and incredible…\n All of these thoughts instantly flashed through Sheng Mei’s mind. In the next moment, she instantly sent Fishy a sound transmission.\n “We’re rushing over! Give everything we have and fly into that world!”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-2232","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
