{"id":54307,"no":362,"title":"Chapter 360 - Don’t Worry","content":"Chapter 360 Don’t Worry.\n Chapter 360 – Don’t Worry\n …\n …\n …\n Although the banquet stage was brimming with tension, that didn’t mean everyone would lose their sense of decorum or reasoning. Those offensive words that Ma Junhui had said a moment ago were brainless; they were words that a mentally normal person would never say.\n Lin Ming didn’t have any past enmity with Ma Junhui, nor any injustice. In fact, Lin Ming had never met Ma Junhui. Ma Junhui was just like a rabid dog that was randomly biting others; If he wasn’t instigated by others, this was still his personality.\n Ma Junhui laughed as he sneered, saying, “You’re right, I really am trying to provoke you. Those superficial skill matches that have happened so far are just too boring. However, I wasn’t lying when I said that you whored yourself out to become a Divine Phoenix Island core disciple; there really is a rumor that is spreading around like that. As they say, where there’s smoke there’s fire. Today, how about I be your touchstone to see just how true this rumor is, hmm?”\n “Touchstone? You really think highly of yourself.” Lin Ming jeered, “I’m afraid your touchstone will break with just a little touch!”\n As Lin Ming spoke he took out the Heaven Profound Soft Spear from his spatial ring. Ever since he had acquired the Purple Comet Spear, he hadn’t used this silver spear of his.\n However, the Purple Comet Spear was a top high-grade earth-step treasure, it was just too shocking. Ancestor Chi Yan had left behind a camouflage array on the Purple Comet Spear, and no one below Ancestor Chi Yan’s cultivation should be able to see the truth. However, there were many old Sovereigns here that had keen eyesight and perception, so surely there would be those that recognized it.\n A top high-grade earth-step treasure was something that even a Revolving Core master would covet. Although Lin Ming had Divine Phoenix Island backing him and didn’t fear exposing the Purple Comet Spear, it was best to keep this news as quiet as possible. With so many people here, it would undoubtedly spread in less than a day.\n Ma Junhui saw Lin Ming take out a medium-grade human-step silver spear from his spatial ring and laughed, “Am I seeing things? You are a core disciple of Divine Phoenix Island, but you actually use such a trashy weapon? Even a third-grade sect’s direct disciple can obtain an earth-step weapon, but here you are using a medium-grade human-step weapon? Are you joking with me?”\n Lin Ming’s lips curled up in a smile. If everyone was being friendly and having a nice match, then he wouldn’t mind leaving his opponent some face. But now this idiot was being so aggressive and was obviously being strung on by someone else. Naturally, he wouldn’t forgive him so lightly.\n “To deal with low-level trash like you, my empty hands would have been enough. But now my spear wants to see a drop of blood. After five spear moves, if you can still stand, then consider me having lost.”\n Lin Ming’s words shocked everyone present.\n His empty hands were enough?\n He took out the spear to see a drop of blood?\n Defeat Ma Junhui in five moves or it would be his loss?\n Zhan Yunjian looked at Lin Ming with relish; this boy was truly confident in himself. He turned to glance at the Thundercrest Sect’s Zhou Xiaoling, and saw that the little girl appeared extremely excited, obviously looking forward to watching this match.\n “Oh? You also think Lin Ming will win in five moves?” Zhan Yunjian asked with a true essence sound transmission.\n “Hehe, I don’t know if he’ll win or not, but whatever the outcome, things will be very interesting after five moves. There will definitely be a side that suffers a miserable loss. I’m looking forward to seeing the loser’s face. The loser might even lose his confidence and ruin his path of martial cultivation, and never be able to recover. How can I not be excited about something so fun?\n As Zhan Yunjian heard the innocent tone in which Zhou Xiaoling spoke, he felt chills crawl up his spine. When this little girl grew up, she would definitely be a grade A disaster.\n Of those present, the disciples of the Five Element Region were mostly watching for fun. But as for the disciples of Divine Phoenix Island, they had a variety of thoughts. There were some that were worried for Lin Ming like Zhang Zhen, but there were also those that were extremely jealous and angry, and wanted to see Lin Ming beaten into the ground, such as Yan Fuhong.\n Yan Fuhong had a gloating smile strung across his face, and he fiddled with his ring finger as he thought to himself, ‘He truly came from a poor land, he actually took out a medium-grade human-step treasure to disgrace himself. I had just wanted to have someone cripple you for a bit so that you’d miss out on the chance to enter the Divine Phoenix Mystic Realm, but now it seems that even your heart of martial arts will be damaged. What an idiot, you actually dug your own grave.’\n Mu Yuhuang was silent. She looked at Mu Qianyu, an obvious question in her eye.\n Mu Qianyu was speechless; this Lin Ming really made one worry. It was fine to just beat this fellow up, but now Lin Ming drew himself into a corner. Facing Mu Yuhuang’s questioning gaze, Mu Qianyu clenched her teeth and nodded. She still had full faith in Lin Ming.\n Mu Yuhuang frowned, “Didn’t you say that that old fool Chi Yan made a top high-grade earth-step treasure spear for Lin Ming? And it was also better than your Vermillion Bird sword? How come he isn’t using it?”\n “This…” Mu Qianyu forced a smile. “He probably doesn’t want to stir up any trouble by revealing it…”\n Mu Yuhuang coldly said, “If he stirs up any trouble, he still has our Divine Phoenix Island supporting him. At least it’s much better than losing. Taking out such a trashy spear is truly disgraceful, what is he going to do if it breaks? Once his weapon breaks, he might not even be able to settle the match in five moves. Even if his strength is greater than his opponent’s, he’ll still be laughed at by others. I hope he knows what he’s doing and doesn’t make himself into the butt of a joke.”\n After Ma Junhui listened to Lin Ming’s words, he didn’t even get mad – he just laughed. He looked at Lin Ming like he was an idiot and said, “Have you gone dumb today? I’ll stand here and see just how you will defeat me!”\n Lin Ming held the spear in his right hand and used his left hand to trace the cool shaft, a familiar feeling spreading through his body. He had used this Heavy Profound Soft Spear for the longest time. It had been with him when he defeated Zhang Guanyu, when he had fled through the Southern Wilderness, and it had even accompanied him throughout the entire Seven Profound Valleys’ Total Faction Martial Meeting.\n When Lin Ming had said he would defeat Ma Junhui in five moves, he had already left a great deal of room for himself. When Lin Ming had just started Tempering Marrow, he was already able to totally defeat the peak Houtian Huang Zixuan. But this Ma Junhui was only a half-step Houtian. So what if he was a fourth-grade sect’s talent? Not just that, but Lin Ming had already completed 20% of Tempering Marrow.\n As Lin Ming’s feet trod the floor, under the support of Golden Roc Shattering the Void, his speed instantly reached the limit. His body became a series of phantoms as an azure light condensed on the spearpoint, shooting straight towards Ma Junhui’s chest!\n “I’ll cut your stupid garbage spear!” Ma Junhui shouted and slashed with his blue sword, seven or eight wind blades howled forth. These wind blades whistled through the air with a grating sound like a saber carving through glass. \n Facing these wind blades, Lin Ming neither blocked nor evaded; he thrust his spear straight through.\n The endless azure true essence carried the vibrating power of Flow like Silk; it smashed against the wind blades!\n Ping ping ping ping ping ping!\n With a series of sounds like crystal breaking, all of Ma Junhui’s wind blades were shattered. But, Lin Ming’s spear potential didn’t diminish at all; the spear light was only ten feet away from Ma Junhui.\n “Mm!?”\n Ma Junhui was shocked. He stretched out his hand and blue wind origin energy gathered around him, forming a whirlwind around his body.\n “Wind Shadow Shield!”\n Peng!\n Ma Junhui hadn’t even finished yelling ‘Wind Shadow Shield’ when the Heavy Profound Soft Spear smashed into the whirlwind, creating a whistling sound that pierced the ears. The Heavy Profound Soft Spear only slowed down for the tiniest bit, but then continued piercing through!\n “What!?”\n Mu Junhui’s complexion finally completely changed. His defensive power was outstanding, and he was even able to borrow the power of wind to create the Wind Shadow Shield, yet he couldn’t even block a single attack? He retreated, but the Heavy Profound Soft Spear homed in on him!\n “Cool Breeze Cut!”\n Ma Junhui’s eyes were cold. He gave a loud shout and slashed at the Heavy Profound Soft Spear. The sword in his hand was a low-grade earth-step treasure. Even if he didn’t use any true essence, it could still cut a medium-grade human-step treasure in half!\n Now that he had even used a sword skill, he should have been able to cut apart Lin Ming’s spear like a candle. But he never thought that as he cut down on the Heavy Profound Soft Spear, his sword would be mired by the endlessly strong azure true essence, and that even the true essence he had poured into his sword would all be scattered by a strange vibrating strength.\n What the hell kind of cultivation method was this?\n Ma Junhui couldn’t believe what was happening. He didn’t even have time to think as this spear potential rushed towards him like a massive tsunami. Even after he had tried to cancel it out with three moves, it still contained a terrifying power.\n All of the space around him seemed to be locked down, and the wind origin energy ran wild. The overwhelming spear light smashed into Ma Junhui, hitting him and his flexible armor.\n In that moment, Ma Junhui felt like he had been struck by a massive hammer. A giant gaping hole was twisted into his high-grade human-step flexible armor, and even the true essence in his body was smashed apart like broken porcelain. Ma Junhui spat out a mouthful of blood before flying several dozens of feet backwards. There was only a banging sound as Ma Junhui struck several birthday banquet tables. His entire body was covered with wine and food, and also small bits of broken jade dishes.\n Because the spear light had been countered a great deal, Ma Junhui hadn’t been severely injured. However, his pride had been ruined and brought to the ground. He crawled up from the floor, his lips twitching, his eyes red with blood, and his face flushed with anger.\n The entire hall was quiet, even the disciples of the Five Element Region were stunned silly. They hadn’t expected such a scene to happen. In just a single move, Ma Junhui had been struck backwards like an insect. Although he wasn’t wounded too seriously, Ma Junhui had used three moves to block Lin Ming’s spear, yet the end result was this. This gap in their strength was obvious. They were simply on completely different levels.\n As the entire audience was silent, a bright laughter like the jingling of silver bells resounded at this untimely moment. Zhou Xiaoling laughed as she slapped her table, tears almost running down her cheeks.\n “Senior-apprentice Brother Ma, hurry up and take off those noodles around your neck, I’m going to die laughing here! Hahaha!”\n At this time, a bowl of birthday noodles hung around his neck. These noodles were made with special spirit valley ingredients and were especially chewy; they hadn’t even broken yet. There were even drops of sauce streaming down the ends.\n Ma Junhui looked like he had been bitten by a snake. He tore off the noodles around his neck, his face turning from red to purple.\n Seeing this, many Divine Phoenix Island disciples wanted to laugh, but it was quite contemptible to laugh in this sort of situation, so they restrained themselves even though it was hard to endure.\n However, those that repressed their laughs didn’t include Zhang Zhen. Zhang Zhen’s eyes were wide as he stared at Lin Ming, a bit stunned. Out of all the disciples of Divine Phoenix Island, he had been the one that had been in contact with Lin Ming the most. He had brought him through the mountain gate, eaten with him, and had taught him most things. He had been leading Lin Ming around for several days, but had no idea just what kind of monstrous genius he had been bringing around.\n Mu Qianyu let out a long breath of relief, wanting to rebuke Lin Ming a bit. Although she had confidence in Lin Ming, she wasn’t sure what sort of progress he had made these past months, and was a little doubtful of what could happen.\n “This Lin Ming, he really does make one worry for him.”\n \n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-360","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
