{"id":54328,"no":383,"title":"Chapter 381 - Netherworld Emperor’s Descendant","content":"Chapter 381 Netherworld Emperor’s Descendant. Chapter 381 – Netherworld Emperor’s Descendant … … … In the brief time that Lin Ming was lost in thought, Mu Xiaoqing’s ice lotus had already been crushed by Lei Mubai’s blood claw! After the blood claw tore apart the icy blue lotus, it continued on, striking at Mu Xiaoqing. Mu Xiaoqing flew backwards, her blue sword shining with a keen cold light as she thrust it out. Ding ding ding! There was the sound of metal colliding. Mu Xiaoqing let out countless sword lights that pierced the blood claw, sparking a cloud of bloody flog. Bang! The blood claw finally exploded, the blood mixing with the crimson lightning to splash onto Mu Xiaoqing. Mu Xiaoqing’s clothes and body were completely stained red with blood. Her face paled. She took several heavy steps backwards, each step creating a bloody footprint on the stage. Lin Ming could clearly see that the truth was, this blood was generated from the Blood Extinguishing Demon Thunder’s blood essence that it had absorbed after it was stimulated with true essence. This was real blood! This Blood Extinguishing Demon Thunder truly seemed like an evil weapon. Mu Xiaoqing looked at the bloodstains on the ground and then at Lei Mubai’s grinning face. A sense of deep humiliation surged within her heart. She knew that she had already lost, Lei Mubai was simply playing with her. In that single strike from a moment ago, if Lei Mubai hadn’t stood idly by afterwards, there was nothing she could have done to defend against it! It wasn’t just Mu Xiaoqing who realized this, many of the Five Element Region disciples also saw what was happening. Many of them begin to feel pity towards Mu Xiaoqing. Anger, shame, and unwillingness swelled up within Mu Xiaoqing’s heart. She knew that she was inferior to Lei Mubai, but in this situation, how could she possibly allow herself to admit defeat? She clenched her teeth, sending a true essence sound transmission, “You and I have no past hatred or injustice against each other, so why are you demeaning me like this?” “Haha, if you want to blame anyone then blame your master. She suppressed me, frustrating my spirit, so naturally I must retaliate against her. I don’t have to the ability to directly oppose her, but within the rules of this banquet I can still ruin you. Having her feel sick and nauseous also isn’t a bad idea. Since this is all done within the proper rules, all she can do is swallow her insults. As for you, just consider it a stroke of bad luck!” “So that’s the reason.” Mu Xiaoqing dismally smiled. “Not just that. Since I’ve resolved myself to become a Peerless Emperor, in order to walk that road I must step over the corpses of a massive number of geniuses, and etch onto my bones the belief that I am at the apex of existence. As chief disciples of a top fourth-grade sect, you reluctantly qualify to be a body that paves the road for me. After I become a Peerless Emperor in the future, you can also consider this an honor.” These words caused Mu Xiaoqing to be thoroughly incensed. “Die!” Mu Xiaoqing attacked, her figure rapidly rushing forwards. With every step she took, ice lotuses bloomed on the ground. She slashed out her sword, and a strong wind howled, carrying a terrifyingly freezing ice energy. “Hey! Anything you do is useless!” Lei Mubai disdainfully smiled. His eyes filled with pity as he looked at Mu Xiaoqing. Then, he spread out his arms, and a deep crimson light erupted outwards. “Blood Prison!” Hoo! A massive amount of blood essence gushed out like a tide. All the space within dozens of feet around Lei Mubai seemed to thicken as if it were overflowing with sticky blood. As Mu Xiaoqing rushed in, she felt as if there was a pressure bearing down on her chest. She found it difficult to breathe. Lei Mubai cruelly smiled as he thrust a palm towards Mu Xiaoqing. In the moment that the Blood Prison erupted forth, Lin Ming suddenly remembered something. When Lin Ming had first swallowed the Shattered Demon Heart Crystal to break into the Tempering Marrow boundary, he had seen a true illusion. This was the evil will that the Netherworld Great Emperor had left within the Shattered Demon Heart Crystal. And the feeling that the Netherworld Great Emperor’s soul had given him was somewhat similar to Lei Mubai’s soul fluctuations! Could it be… Lin Ming was alarmed. After he had swallowed the Shattered Demon Heart Crystal, he had borne witness to the endless war that followed. It had left a very deep impression within Lin Ming’s mind. The Netherworld Great Emperor was similar to an ancient demon god. He held a large bloody red axe in his hand, the shaft over ten feet long and as thick as an arm. The axe blade was three feet wide, and with a single cut it was able to slice a devil in half! Every time he killed a devil, the Netherworld Great Emperor would drink its blood! Until now, Lin Ming wasn’t able to understand what the devils that the Netherworld Great Emperor killed were. These devils were naked, their skin a dark blue and gray metallic color, their entire bodies threaded with thick and angry muscles. Their entire bodies were clasped with large hoops, and there were even those that were wrapped in chains. They had devilish, exaggerated features and were incomparably ugly beings. They weren’t human at all. As for the Netherworld Great Emperor, he was actually over 10 feet tall. His hair was a deep red, his skin a pale blue, and pupils a dark gold. Although he had the face of a human, his height, skin, eyes… could there really be humans that grew up into that sort of appearance? Lin Ming could never be sure if the Netherworld Great Emperor was human or not. Or perhaps, was this appearance the result of deeply cultivating the devil arts? At the time, this scene had etched itself onto Lin Ming’s heart. The Netherworld Great Emperor’s great axe pointed to the heavens, his feet stepped upon the earth. Within the universe, he alone ruled all! This overwhelmingly lordly spirit had caused Lin Ming’s heart to race. And now, Lin Ming had truly felt the same kind of energy coming from Lei Mubai’s body. This was demon energy… although it was very faint, there was no way he was wrong! Was he… the descendant of the Netherworld Great Emperor? This thought suddenly appeared in Lin Ming’s heart, leaving him absentminded for a moment. If he was the descendant of the Netherworld Great Emperor, then what sort of concept would that be? Was he… someone from the South Sea Demon Region!?!? As Lin Ming thought of this possibility, all sorts of scenarios flashed in his mind. From Lei Jingtian’s destruction of the proposed alliance, to his self-confident smile, to when he had even supported Lei Mubai to propose marriage to Divine Phoenix Island… and all the way to now, Lei Mubai had even used the Blood Extinguishing Demon Thunder! The Blood Extinguishing Demon Thunder didn’t have a problem in itself. Although it was considered evil, the evil factions within the Sky Spill Continent weren’t too clear. For instance, the Seven Profound Valleys’ Acacia Faction and Puppet Faction both practiced devil arts. As for Lin Ming, his Heretical God Force wasn’t an orthodox ability either. But with the Blood Extinguishing Demon Thunder added with all the previous issues, Lin Ming had a guess! And that was that this pale youth’s real name wasn’t Lei Mubai. In fact, that was just an alias he used within the Thundercrest Sect. He was most likely a very important character within the South Sea Demon Region! There was too much at stake on this speculation; even Lin Ming couldn’t easily confirm it. If he were right, then there would be nothing left of Lei Mubai. But if he were wrong, it would create a horrible mess. It might even cause the Thundercrest Sect to ally with the South Sea Demon Region! Lin Ming suppressed his desire to tell Mu Qianyu of his guess. Instead, he calmed his mind and closed himself off until there was nothing left but his sense, using this to observe each and every action of Lei Mubai. On the stage, Lei Mubai and Mu Xiaoqing’s battle was reaching its conclusion. Mu Xiaoqing was obviously not anywhere near being Lei Mubai’s match. She was stuck within the Blood Prison, and was completely unable to free herself. As Lin Ming compared the aura that Lei Mubai emitted to the residual will of the Netherworld Great Emperor within the Shattered Demon Heart Crystal, he was increasingly sure that this Lei Mubai had a very close relation with the Netherworld Great Emperor, and was most likely a descendant of some sort. At the very least, he would be a person who cultivated the same kinds of devil arts as the Netherworld Great Emperor! The South Sea Demon Region was at war with Divine Phoenix Island and would soon invade. Now, Lei Mubai had suddenly appeared at this time. In addition to all of Lei Jingtian’s various actions, this was enough to confirm the relation between Lei Mubai and the South Sea Demon Region. Otherwise, how could there be such a perfect coincidence in this world? As Lin Ming made up his mind, he opened his eyes. At this time, he witnessed Lei Mubai’s final strike. Bang! The crimson blood claw burst apart. Mu Xiaoqing spat out a mouthful of blood, and she flew backwards like a broken kite, her face paler than paper. This was the home of Divine Phoenix Island. No matter how brave Lei Mubai was, he still wouldn’t dare to suck out Mu Xiaoqing’s blood essence. But this level of injury was enough for her to be bedridden for at least ten days. The truth was that being bedridden for 10 days wasn’t too big of a deal. The crux of the issue was that Mu Xiaoqing’s confidence had suffered a heavy blow. In the future, this could possibly affect her cultivation. Mu Yuhuang was pale. No matter how she justified matters, in this case her disciple was simply weaker, thus she had been humiliated. There was nothing she could say. Otherwise this so-called competition of learning from each other was meaningless. Lei Mubai wickedly smiled at Mu Xiaoqing. Then, he swept his eyes across the entire audience. “Who’s next?” All of the Divine Phoenix Island disciples had extremely ugly complexions. Their hearts were filled with extreme resentment, and they wished that they could rip apart this Lei Mubai. But this time, who would dare to go up? That would simply be disgracing themselves! Lei Mubai smiled as he glanced at Mu Dingshan. As for Lin Ming, he wanted to save him for last. The one that was the greatest eyesore to him here was Lin Ming. “Brother Dingshan, if you don’t come up then how can we have a match?” Mu Dingshan’s expression was pale. He tightly clenched his fists together. Ever since he was born, when had he been oppressed like this? Someone was looking down their nose at him, openly provoking him, and yet he was helpless in this situation. However, this time, he had to step up no matter what. In the end, he was the elder senior-apprentice brother of all the direct disciples. He grit his teeth, and was about to step onto the stage when he was stopped by a firm hand on his shoulder. He turned and saw that the one who stopped him was Lin Ming. “Senior-apprentice Brother Mu, I’ll do it.” Lin Ming frankly said. There was much at stake. Through an actual battle, he would be able to more precisely determine Lei Mubai’s true identity. Mu Dingshan’s heart filled with a tender and touching emotion as he looked at Lin Ming. This Lei Mubai was simply too strong. Even Saint rank talents were separated by the disparity in their talents. He feared that this Lei Mubai was much stronger than Mu Qianyu and Mu Bingyun when they were at this age. Even if Lin Ming was also a Saint rank talent, he was just 16 and a half years old. Not only that, but there was a great gap in their cultivation. Mu Dingshan didn’t believe that Lin Ming had the assurance to deal with Lei Mubai. Lei Mubai had defeated Mu Xiaoqing and hadn’t even used his weapon. Who knew what else he had up his sleeve. He was simply an unfathomable character. There was no way that Lin Ming was able to completely understand the enemy’s full strength. In order to challenge Lei Mubai, one needed have considerable courage. But, since this competition had progressed to this stage, a loss would be a great blow to one’s confidence. Could Lin Ming win? To Mu Dingshan, this hope was too faint and uncertain. He heartily patted Lin Ming’s shoulder, a bit like he was stepping onto an execution stage. “Brother Lin, please be silent. You are the last hope of my Divine Phoenix Island, so let me go up first. My cultivation is higher than Xiaoqing’s, so I should be able to test out some of the cards he has in his hand. With that, it will be easier for you to deal with him.” Lin Ming faintly smiled, no longer attempting to persuade Mu Dingshan. Instead, he took out his Purple Comet Spear and directly leapt onstage. “Divine Phoenix Island’s Lin Ming, please advise!” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-381","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
