{"id":54342,"no":397,"title":"Chapter 395 - Fallen Star Flame","content":"Chapter 395 Fallen Star Flame.\n Chapter 395 – Fallen Star Flame\n …\n …\n …\n “Hou!”\n Under the thrust of the spear, the tide of surging lava was like a tsunami that was split in half!\n “Phoenix Wings Ascending Sky!”\n A blazing crimson phoenix soared into the skies. This phoenix’s body was actually several times more powerful than the one displayed at the banquet competition! And the flames the flickering on its body were also several times more luminous!\n Without a doubt, this was related to breaking through to the peak Pulse Condensation period and also gaining a deeper understanding of the ‘Vermillion Bird Forbidden Divine Chronicle’. But the greatest factor was that Lin Ming had suddenly touched upon the origin of fire, and had now comprehended the Concept of Fire!\n With the Concept of Fire supporting the ‘Vermillion Bird Forbidden Divine Chronicle’, his move now seemed to contain a soul!\n The long spear sliced through the lava, spear light shining through. Lin Ming’s spear skills were becoming increasingly swift and increasingly fierce. With each thrust of his spear, flames howled as they burned. In that moment, the Purple Comet Spear itself seemed to have turned a fiery force of nature, unstoppable!\n Lin Ming’s mind flashed through the formulas and laws of the ‘Vermillion Bird Forbidden Divine Chronicle’. Then, his spear potential turned, “10,000 Flames Burning World!”\n This was another fire martial skill contained within the ‘Vermillion Bird Forbidden Divine Chronicle’ that was a level harder than Phoenix Wings Ascending Sky. In order to use it, one would normally need to reach Perfection of the second layer of the ‘Vermillion Bird Forbidden Divine Chronicle’. But, with the help of the Vermillion Bird blood essence and the Concept of Fire, he was able to use this technique.\n “Hou!”\n Dozens of true essence flames shot out, piercing through the wall of lava like arrows. The flames split in all directions, incinerating the void!\n 10,000 Flames Burning World could be used in a large area attack, but it could also be concentrated all onto a single target. It was the strongest move within the second layer of the ‘Vermillion Bird Forbidden Divine Chronicle’.\n As Lin Ming continuously used 10,000 Flames Burning World, at this time, the shower of meteorites began to thin. At the final moment, Lin Ming suddenly felt a terrifying oppressive presence falling down towards his head. As he looked up, he gasped. Far in the sky, there was a giant flaming meteor that was dozens of feet wide, wantonly smashing down. It had dozens of flaming tails that trailed its presence!\n Without regard for anything else, Lin Ming instantly turned around and bolted away. This massive meteor would undoubtedly be able to shatter even a mountain.\n The moment that the meteor landed, Lin Ming plunged headfirst into a pool of lava.\n Bang!!!\n The collision was as if the hand of a god had struck the earth, completely tearing apart the land. Lava everywhere flew thousands of feet into the sky, breaking through the clouds.\n Lin Ming hid within the lava while stimulating the azure true essence to protect himself, also releasing his perception to investigate what was happening on the surface. The final meteor had impacted around five or six miles away from Lin Ming, and the intense damage had caused a massive amount of rocks to swell back like a wave, forming a crater in the earth. The lava around it began to flow into this crater.\n Lin Ming gasped, and then jumped out from the lava.\n If someone were to be hit directly by such a giant meteor, even a Revolving Core elder would perish.\n As the last meteor fell, the meteor shower completely stopped. Unfortunately, even though the last meteor had caused a massive explosion, Lin Ming had to hastily dodge and hadn’t been able to release his perception to sense the Concept of Fire.\n The fires still raged as before, and the ground was left in a complete mess. The choppy lava boiled up, and scorching waves of heat erupted.\n Lin Ming stood on the hot rocks, carefully feeling and grasping what he had just experienced. The faint touch he had of the Concept of Fire was becoming increasingly clear.\n “The Divine Phoenix Mystic Realm is truly wonderful. Without being able to witness such a rare and fantastic scene, wanting to touch upon such an ethereal Concept of Fire would be far too difficult!”\n Comprehending the Concept of Fire was more difficult than comprehending the Concept of Wind. One needed a fire-attribute physique that had a high fusion compatibility, perception that was higher than others’, and also years of practicing with fire origin energy. This was the only way to gain a bit of insight into the Concept of Fire. For instance, the Sunfire Princess was a character on this level.\n Concepts were an idea that could not be explained, only personally understood. Lin Ming had relied on simulating the meteorites smashing into the ground with his true essence in order to understand the Concept of Fire. But in truth, this was only a single kind of comprehension of the Concept of Fire. Even if he were to tell others, they wouldn’t be able to imagine this, and they also wouldn’t be able to simulate this scene with their true essence. They would most likely blindly attempt and waste their time, ultimately amounting to nothing.\n After Lin Ming received his spear, he was about to leave when he had a very strange feeling come over him.\n ‘Mmm? This is…’\n The Heretical God Seed began to restlessly move in agitation. The surrounding fire origin energy trembled. The source of all of this seemed to be from the impact site of that giant meteor.\n Lin Ming couldn’t help but take a couple of steps towards this peculiar sensation. Suddenly, he heard the wind whistle, and all of the surrounding fire origin energy seemed to be pulled in by some absorbing force, flowing past him and into that giant meteor crater.\n The fire origin energy began to speed past him faster and faster. The cries of the Heretical God Seed became increasingly rapid. A moment later, a giant vortex of fire origin energy formed within the meteor crater, crazily absorbing the fire origin energy from a massive radius. A strong wind picked up from this vortex, scraping past Lin Ming’s body like a knife across his skin.\n “What a horrifying absorbing force!” Lin Ming could even feel the fire origin energy within his own body being hauled towards this force. But, under the pressure of the Heretical God Seed, the fire origin energy was eventually contained within him.\n The absorption was becoming increasingly wild. Even the lava ponds began to seethe and boil in excitement, and the giant bubble of lava became increasingly violent, the level of the lava pools rising by a great deal.\n Bang!\n With a muffled sound, a column of lava burst dozens of feet into the air, and was pulled in by the absorbing force, rushing towards the meteorite crater.\n After this first column of lava burst out, more and more columns of lava began to erupt into the sky, all of them flowing into the central crater. The crater was like a whale that greedily absorbed everything. The red rocks on the floor were broken apart by the raging fires, and shattered pieces of stone flew into the air. The entire earth began to collapse as avalanches occurred all over.\n Lin Ming was stunned; just what was going on? The Heretical God Seed in his body was screaming in an increasingly urgent manner. He helplessly watched as lava filled the giant crater that was produced by the meteor collision, and then even began overflowing past the high ridges. In the heart of the lava lake, a deep blazing crimson light shot into the sky. This blazing crimson light was only a foot thick, but was like a divine sword that stabbed the vault of heaven.\n This shining crimson light began to slowly coalesce into a fist-sized object. Within this red light, Lin Ming felt a terrifyingly rich and pure fire origin energy.\n This… this… this was…\n Flame Essence!?\n Lin Ming’s mind shook, was he witnessing the birth of a Flame Essence?\n The flames of the world had spirit. In some strange and dangerous lands with an incomparably rich fire origin energy, it was possible that a Fire Essence would be born. The requirements for a Flame Essence to be born were extremely harsh; it was similar to the qualifications a martial artist needed in order to become an Emperor level powerhouse. Not only did there need to be an exceedingly rich fire origin energy, but it also required the hand of destiny.\n The birth of a Flame Essence often required many different coincidences to coincide together into an accidental result; this was simply impossible to duplicate.\n In many cases, lands where special types of fire had existed for thousands of years would be unable to give birth to a Flame Essence.\n Witnessing the creation of a Flame Essence was thousands of times more difficult than finding a Flame Essence!\n Thus, as Lin Ming watched this Flame Essence continuously grow with wide eyes, he was beyond shocked.\n This was the Fallen Star Flame, a Flame Essence that was born from the combustion of a meteor. The amount of this type of Flame Essence that existed in the world was rare to the point of sending those who searched for it into despair; it was nearly a unique existence in the Sky Spill Continent.\n The Divine Phoenix Mystic Realm originally contained an incomparably rich fire origin energy. As the lava surged for countless years, undoubtedly many types of Flame Essences had been born. And in this place, a Flame Essence was already being formed. But, it was far from completion.\n And then a miracle had happened. The massive meteor had smashed the ground, and terrifyingly high temperatures had skyrocketed along with a fervid impact, becoming the primer to manifest the gathering of the power of fire.\n However, the original Flame Essence that was brewing here was still unable to form. As the Fallen Star Flame absorbed the fire origin energy that had gathered here for tens of thousands of years, a new Flame Essence was born!\n The Flame Essence that was being born had actually become the nutrition of the Fallen Star Flame. In turn, the Fallen Star Flame’s grade had climbed to an even higher level.\n Lin Ming was short of breath. Just what grade was this Fallen Star Flame?\n Lin Ming took out his Purple Comet Spear. He tread his feet, flying forwards until he reached where the Fallen Star Flame was. The speed at which he flew was very slow; he was being vigilant of any and all dangers.\n “The energy of the flame is increasing, it’s already at the medium-grade earth-step level!” Lin Ming’s eyebrows shot up. A medium-grade earth-step Flame Essence would be intelligent. Combined with its extremely fiery power of fire, he didn’t know whether or not he would be able to deal with it.\n Lin Ming approached a foot at a time. When he was only 200 feet away from the Fallen Star Flame, a sudden change occurred!\n The Fallen Star Flame violently trembled, and suddenly the lava pool exploded. A thin column of lava shot towards Lin Ming’s chest like an arrow.\n “It’s quite intelligent, it even knows to attack me!”\n Lin Ming drew back, circulating the true essence in his body. The Purple Comet Spear slashed down, and the thin column of lava was dispersed. However, the lava pool growled again, and dozens of the small magma columns shot up, striking towards Lin Ming like a fiery python. Lin Ming calmly wielded the Purple Comet Spear in his hand and thrust out at each lava column. Every spear strike contained the Concept of Fire, and the columns of lava broke one after another!\n Lin Ming launched Golden Roc Shattering the Void and gradually moved forwards, slowly approaching the Fallen Star Flame.\n When he was once again 200 feet away, this time, another change occurred!\n The Fallen Star Flame suddenly issued a sharp wailing scream that caused one’s scalp to tingle! The vortex of origin energy suddenly began to violently move, the absorbing power increasing. The ground was crushed, and huge holes appeared. Large chunks off rocks flew into the air until there were hundreds, then thousands, all shooting towards the Fallen Star Flame.\n Ka ka ka ka –\n The pieces of rocks constantly fell onto the Fallen Star Flame. Because the speed of the rocks was so fast, a whistling sound rang in the air.\n The fire of the Fallen Star Flame was extremely hot and savage. All of the rocks that touched it were instantly refined, turning all of the impurities into black smoke with only the purest essence left behind. This rock essence constantly gathered and compressed until it completely wrapped the Fallen Star Flame. The volume continued to increase.\n Gradually, it unexpectedly cemented into a rock beast. Its body was 100 feet long and 50 to 60 feet tall. It was a deep crimson red all over, and had the appearance of a leopard.\n Lin Ming sucked in a breath. What was this?\n Roar!\n The crimson rock leopard let loose an earth-shattering roar, and the ground trembled beneath Lin Ming’s feet.\n \n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-395","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
