{"id":54348,"no":403,"title":"Chapter 401 - Seven Days","content":"Chapter 401 – Seven Days\n …\n …\n …\n “Do you insist?” The Palace Spirit said as it apathetically looked at Lin Ming.\n “Everything depends on effort!”\n “Trying to complete the smelting trial hastily will only make it easier for you to die in the middle of the trials! However, since you insist, I will not stop you.” The Palace Spirit icily said. As a being from the Spirit race, it naturally lacked emotions. “I will be going to sleep. If you can survive and complete the fifth smelting trial, then you shall obtain a midway reward. At that time, I will awaken.”\n After speaking these words, the Palace Spirit instantly vanished.\n “The fifth smelting trial?” Lin Ming’s mind stirred. It seemed that the general level smelting trail was itself divided into different levels. With his current strength, just how far would he be able to reach in a single go?\n As Lin Ming was thinking, the entire land beneath him began to tremble. Rocks rolled down the hills and a moment later, in the distance plains, red symbols began to light up. These red symbols were several dozen feet high and were crowded together, creating a long length of light. There were hundreds and thousands of them, extending all the way to the end of the horizon!\n “This is… an array formation?” Lin Ming was shocked, this was truly a terrifying array formation. The area it covered was at least a hundred miles; this was a massive display of power!\n As the array formation appeared, the origin energy of the world began to fiercely shake. The ground began to increasingly vibrate, rocks broke in half, land cracked, and giant fissures began to spring up, creating mounds of rocks as if the earth itself was bubbling.\n Lin Ming gripped his spear; he felt the killing intent that the array formation was releasing.\n This was a true killing array. Once he was killed, he would die!\n Peng! Peng! Peng!\n The mounds of rocks exploded, and puppets made of black rock emerged from the ground. There were several hundred of them, and there were even many of these rock puppets that burned with fire. Without a doubt, these flaming rock puppets were much stronger than the rest.\n “These are the enemies of the smelting trial? The enemies of the first trial should always be the weakest. The enemies behind will become increasingly strong!” Lin Ming revolved true essence in his body, his heart brimming with warrior spirit. All of these puppets were no weaker than a Houtian realm martial artist, and there were several hundred that came up at once!\n Although this was difficult, it wasn’t enough to trap Lin Ming for more than a year. That could only mean that the strength of the enemies behind them would rapidly increase!\n Lin Ming left the resting cave and stepped onto the plains, walking into the massive array formation.\n Roar!\n Roar!\n The rock puppets issued earthshaking bellows, and the several hundred rock puppets rushed towards Lin Ming to kill him. These rock puppets were all more than ten feet tall and weighed several thousands of jins! When they ran together, the earth would shake, and their loud cries resounded through the skies!\n Lin Ming grasped his long spear. He was one man alone facing such a mighty force. Such a scene caused the blood in his heart to burn and his soul to seethe with boiling excitement!\n “I never thought that I would have to face so many enemies that are comparably to Houtian realm martial artists. When I fought in the beast tide at Green Mulberry City, most of the beasts that I killed were weak vicious beasts! This is also only the first step of the general level smelting trial. Above this is also the king level smelting trial! No matter what, I cannot fall here!”\n Lin Ming grit his teeth, and his eyes flashed with a cold and brutal killing intent! He could already see the bloodthirsty and crazed crimson eyes of the rock puppets, and the ferocious spikes that covered their body.\n “Die!”\n Lin Ming rushed into the first rock puppet. With a loud shout, azure true essence erupted. His figure was like a leopard that leapt into the air, and the Purple Comet Spear was as nimble as a whip. He directly smashed down on the rock puppet’s forehead.\n Kacha!\n Rock exploded, and fire-attribute energy that formed its eyes shot out.\n “First!”\n Lin Ming borrowed the recoil of smashing the rock puppet’s head and flew off to another side. The Purple Comet Spear in his hand lashed out like a serpent and stabbed a second rock puppet in the eyes!\n Bang!\n As its eyes exploded, Lin Ming was pushed flying backwards by the impact, the Purple Comet Spear bending like a crescent moon as he offset most of the impact. Otherwise, with Lin Ming’s flesh and blood body, his wrist would still shake with numbness.\n After killing two rock puppets, Lin Ming fell into a group of rock puppets. In this situation, Lin Ming remained incomparably calm, sending out his sense to capture the movement of every rock puppet. He was like a gust of wind as he swiftly dashed through the openings between the rock puppets.\n With every thrust of Lin Ming’s spear, almost every rock puppet that he attacked would die!\n The eyes were the weakness of the rock puppets. Every time Lin Ming thrust out, his spear would contain vibrating true essence. His attack would smash apart the fire origin energy within the eyes!\n “Mm? Not good!”\n At the moment that Lin Ming jumped, two columns of fire suddenly shot out from the puppet group, swiping by Lin Ming as they directly shot past him and into the sky. Although Lin Ming had dodged this sneak attack, the space he had dodged into was also locked down by a pillar of fire.\n Roar! Roar!\n A three headed rock puppet instantly came into a pincer position, surrounding Lin Ming. A big fist came crashing down, blocking every direction he could dodge in!\n At this critical moment, Lin Ming’s pupils contracted. The Divine Demon Thunder Soul howled as it flew out!\n Puff! Puff! Puff!\n With a series of light sounds, all three eyes on all three heads of the rock puppet exploded. Lin Ming took advantage of this opportunity to heavily punch the rock puppet’s chest. The power of vibration erupted, directly shattering its body.\n As the rock puppet fell over, Lin Ming rushed forth and out of the circle. His feet trod with Golden Rock Shattering the Void, and he flew into the sky!\n “So close!”\n The blood in his body tumbled. If he had been struck by several fists at once, he would have been severely injured. That would have been very dangerous.\n However, there was no time for Lin Ming to relax. With several ‘shoo shoo shoo’ sounds, dozens of columns of flames were shot out by the rock puppet group, aiming at Lin Ming.\n “This is bad! If I fly then I’ll just become a target!”\n Lin Ming dived down, escaping the columns of flame that came at him. Once again, he was caught in a brutal melee.\n With just him against several hundred Houtian realm rock puppets, if he wasn’t careful he would be caught in an endless siege from all sides! Even with Lin Ming’s strength, if there was an accident, he would be severely wounded. But, if he was wounded to that extent, that would spell death in the midst of so many rock puppets!\n The probability of dying within this general level smelting trial was absolutely higher than the sergeant level! In order to create a general, one had to undergo numerous life and death challenges! This was also a matter of last resort. In an army, it was difficult to find true leaders. The position of a general was much more important than that of a soldier!\n ………………………\n Quickly, seven days passed.\n In a dark chamber in the Ancient Phoenix Main Hall, a light flashed and a ragged and bloodstained youth appeared, sprawled on the floor. \n “That was a close call!” The youth let out a long sigh of relief. This youth was Mu Dingshan.\n He took out pills from his spatial ring to swallow and also smeared medicine on his wounds. Mu Dingshan couldn’t resist the temptation to accept the smelting trial that was at the limit of his strength. It had been incomparably difficult to complete, and he had fallen into many dangerous situations. Finally, his potential had erupted and he was able to pass through danger after danger to complete the smelting trail. Not only that, but his cultivation had broken through to the middle Houtian realm!\n “I’ve finally broken through.”\n Mu Dingshan sighed. With just this, everything was worth it.\n “I hope that the other junior-apprentice brothers and junior-apprentice sisters weren’t as reckless as I was. But… with such an opportunity laid in front of them, there are few people that would be able to resist the temptation. If they were to repeatedly avoid danger for the comforts of safety, they might never achieve anything great in their lives. I can only hope that they return safely.\n As Mu Dingshan was thinking, he saw a blue light flash, and Mu Xiaoqing appear. She was also bloodied, but her overall appearance was much better than Mu Dingshan’s.\n Mu Dingshan felt relief as some weight came off his shoulders. In this smelting trial, her importance was only inferior to Lin Ming’s. It was wonderful that she could safely return.\n Then, more lights began to shine, and disciples came popping out one after another. Some were completely find, and some were wounded. There was even one who was grievously injured, and his entire body covered with blood.\n Mu Dingshan hurried over and helped him swallow some pills.\n “Junior-apprentice Brother Song, did you break through to the Houtian realm?” Mu Dingshan said with astonishment. This Junior-apprentice Brother Song was only 18 years old, and his strength placed him at the bottom end of the direct disciples. Before he entered the Ancient Phoenix Main Hall, his cultivation head been at a half-step Houtian. But now, he had managed to break through to the Houtian realm. An 18 year old with a Houtian realm cultivation was an extremely good result.\n “A lucky breakthrough.” Although the youth surnamed Song was covered in blood, he couldn’t conceal the happy smile on his face. Entering this time was truly worth it. Now that he had reached the Houtian realm at 18 years of age, entering the Revolving Core realm in the future was nearly guaranteed.\n The other disciples had various degrees of benefits. Some had broken through to the next stage, and most of them hadn’t been able to break through, but their strength had increased by a great deal.\n The disciples excitedly chattered with each other, “Senior-apprentice Brother Mu, you are the fiercest one here. Now that you’ve reached the middle Houtian realm, none of those other Five Element Region chief disciples will be your match!”\n As several disciples congratulated Mu Dingshan, he smiled, but felt somewhat uneasy in his heart.\n Why hadn’t Lin Ming come out?\n According to his past experiences, in another quarter of an hour they should all be sent out. But where was Lin Ming?\n “Mm? Junior-apprentice Brother Lin? Junior-apprentice Brother Lin hasn’t come out yet?” The youth surnamed Song said with surprise as he suddenly discovered this fact.\n Now the disciples found out that there were 15 of them altogether; they were only missing Lin Ming.\n The disciples in the chamber stared in a daze.\n “There’s still time.” Mu Dingshan frowned. He would not believe that Lin Ming couldn’t pass the smelting trial.\n ……………………………….\n At this time, at the Divine Phoenix Island’s back mountains, the Saintess’ Palace –\n Mu Qianyu was holding onto an ancient book. While she was reading it, she was also recording her thoughts in a jade slip.\n “Yu’er, from what I calculate, the disciples that have entered the Divine Phoenix Mystic Realm should leave today or tomorrow.”\n Mu Qianyu glanced up. The one who had spoken was her master, Mu Yuhuang.\n “Of the disciples that had gone into the Divine Phoenix Mystic Realm, we’ve already lost one. I hope that this time there won’t be any losses of those that entered the Ancient Phoenix Main Hall.” Mu Yuhuang shook her head, her voice filled with lament.\n “Mm…” Mu Qianyu placed the jade slip down, looking lost in thought…\n “Yu’er, are you worrying about Lin Ming?” Mu Yuhuang asked with a smile.\n “A bit…” Mu Qianyu nodded. That fellow Lin Ming was too adventurous, he liked taking risks too much. This was what she was worried about.\n Mu Yuhuang laughed, smiling as she said, “Be relieved. Lin Ming’s talent is heaven defying. Not only that, but the High Ancestor has said that a great destiny has fallen upon Lin Ming. He will not fall in the Ancient Phoenix Main Hall.”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-401","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
