{"id":54466,"no":521,"title":"Chapter 520 - Step Onto the Killing Path","content":"Chapter 520 - Step Onto the Killing Path\n …\n …\n …\n “So that’s how it is…”\n The ‘Great Desolate Halberd Art’. The Blood Drinking Seals that were formed from the blood of Giant Demons were much more powerful than those from humans. This four star Demon General was only equal to a mid to late Xiantian human martial artist. But, the Blood Drinking seal condensed from his blood was not much worse than one condensed from a human Revolving Core martial artist…\n Lin Ming muttered as he looked at the Blood Drinking Seal in his hand that had been formed by the guard leader. But the more he thought about it, the more normal it seemed. Compared to humans, Giant Demons had superior physical attributes and a much more vibrant vitality. Their strength was higher than that of humans at the same level, so naturally Blood Drinking Seals that were formed from their blood essence would also be stronger.\n “The Demon Emperor cultivated the ‘Great Desolate Halberd Art’ with the blood of his own race… these truly are a bloodthirsty race.” Lin Ming didn’t have much ill will towards the Giant Demon race. The conflicts between the Giant Demons and humans were only because of their race and other minor differences.\n He reached out his hand and Blood Drinking Seals floated up from all the corpses. They were like red petals dancing in the warm spring wind.\n At this time, the slower Huo Yuan finally arrived at the slave registration office. As he arrived, all he saw was a completely destroyed tent as well as torn corpses scattered everywhere.\n And in this pile of corpses, there was Lin Ming, calmly standing there with his entire body dyed a deep blood red. Over a dozen bloody seals danced around him; he was no different from an Ashura demon.\n Huo Yuan was shocked speechless. He was just a few steps late, but the entire place had been razed to the ground!\n “Heavens! There has been a rebellion! The slave registration office has been turned upside down!”\n “So many guards died!”\n “Who is that young man!?”\n Outside of the slave registration office, many people saw Lin Ming kill numerous guards. This scene was simply too shocking. The ground was littered with corpses and the air was thick with the smell of blood. Only he stood there, his body stained in blood, as if he had just brutally slain the gods.\n “He is a Xiantian martial artist! The early Xiantian realm…”\n “He definitely had some argument with those fellows from the registration office which led to him going mad with anger and killing them. How come he hasn’t run? He’s just waiting for death here!”\n As the surrounding martial artists and commoners discussed this, the more timid among them had already turned around and fled, for fear that they would be caught up with Lin Ming’s actions. Everyone sighed with regret. For such a genius to be caught and turned into a slave for the Silent Green Tribe… that was just too pitiful.\n “A general has arrived!”\n As everyone was talking, a group of Giant Demon riders rode in from around the tribe. They were riding on jet black wolves that were 20 feet long and came billowing in like a gust of wind. These were the guard group that escorted the elders, and were also the elite among the elite in the Silent Green Tribe.\n This squad of riders all had a cultivation at the Demon General level. As for the leader of this squad, he was wearing compact plated armor. He was holding onto a thick war spear, and the wolf he rode was much larger than the others. He had long and majestic hair that rolled down his back, and his limbs were strong and healthy like a galloping horse.\n This black-armored general had a helmet with a faceguard that covered his face. A heavy murderous intent flowed out from his body.\n “So it was you!”\n The black-armored general sneered. He slowly took off his faceguard. This Giant Demon general was Mo Da!\n This area was originally managed by Mo Da. All of the surrounding slaves were also under the command of Mo Da. Thus, when some incident occurred, Mo Da was the first to rush in.\n “It’s General Mo Da!”\n “The five-star Demon General, General Mo Da! Everything is over! There’s no way that boy will be able to escape!”\n “Even if General Mo Da didn’t come, he still wouldn’t be able to escape. There is a tracing mark on his body.”\n In this part of the tribe, Mo Da’s influence and strength were too great. Although his cultivation was only equal to a mid to late Xiantian martial artist, because of the fierce talent of a Giant Demon, even human extreme Xiantian martial artists weren’t a match for him.\n A year ago, there had been a human late Xiantian martial artist that had rebelled against Mo Da. The result of this was that he had been split in half by Mo Da’s spear, and suffered a miserable death.\n “I didn’t think that I would be mistaken in my estimation of you; you are actually a Xiantian realm martial artist.” Mo Da leapt off his wolf and casually flicked up his faceguard, revealing his deep amber eyes. “To reach the Xiantian realm at such a young age, what a great talent! It is truly brave of you to rebel, but… also very stupid!”\n Mo Da grinned demonically as he looked at Lin Ming. He had no love for Lin Ming. This was a deeply ingrained contempt that came from the heart. Lin Ming was a human, and as such was a mortal enemy of the Giant Demons. The geniuses of humanity had to be exterminated, lest they inevitably become a catastrophe.\n Lin Ming calmly looked at Mo Da. Several Blood Drinking Seals slowly floated around him. Just what sort of Blood Drinking Seal would a five-star Demon General’s blood essence be able to create? Lin Ming discovered that after arriving at this Giant Demon world, this was simply a natural slaughtering land to cultivate the ‘Great Desolate Halberd Art’.\n “Although we are enemies, I still appreciate you. I will give you a fair chance in this battle. If you can withstand my attacks for 20 breaths of time, then I will give you a way out! Otherwise, according to the rules of my Giant Demon tribe, you will be flayed alive for revolting against your master!” As Mo Da spoke, his fierce aura erupted. All of the surrounding martial artists were suppressed by this aura and they all fell back.\n They all knew the truth. Mo Da was only being magnanimous to allow others to see the supreme authority that he commanded here and also the results of being defiant. Within human Xiantian martial artists, he could be considered invincible. Even a human extreme Xiantian martial artist would find it difficult to deal with Mo Da’s attacks, much less a young man who was only at the early Xiantian realm. Even if this young man was much stronger than a martial artist at the same level, it was still meaningless.\n Twenty breaths of time were already more than enough for Mo Da to display his utter strength; this young man was a dead man standing.\n All of the surrounding human martial artists couldn’t help but sigh. What a pity. What sort of future could such a talented young man have? If he were raised in a human tribe, then it was highly possible that he could reach the Revolving Core realm in the future. If he did, he could be a powerhouse that created his own tribe.\n A 13 foot long spear swept out. The snake-like point was now a white beam of chilling cold. Standing there with his heavy black armor, Mo Da was like a dark iron tower; even the sunlight was hidden by him!\n This imposing aura had formed over many years. The slave martial artists felt a suffocating sense of pressure. The female slave that had been saved by Lin Ming had already fled from his side, her face pale. As for Huo Yuan, who stood not too far away, he stared at Lin Ming with wide eyes. Lin Ming’s strength had already exceeded his expectations. If Lin Ming had ran away with him, then there would have been a 60% chance that he could have successfully escaped and become a fugitive. He could have become someone who was able to resist the Silent Green Tribe…\n “You won’t use a weapon? Do you not have one?” Mo Da frowned as he saw Lin Ming with empty hands as before.\n Lin Ming expressionlessly opened his hands. He murmured to himself, “In the future, I will inevitably step onto the killing path, then, let me take that first step today…”\n As he spoke, his ten fingers flicked out. The several Blood Drinking Seals shot outwards!\n Blood-red lights cut through the void. They issued a teeth-grinding sound, piercing straight towards Mo Da!\n “Humph! You can’t even see your own weakness!” Mo Da could see that this was only a casual strike that Lin Ming had used. If Lin Ming believed that this could kill him, then that was simply laughable!\n “Break for me!” Mo Da shouted. The demon essence from his demon crystal erupted and he slashed out with his spear! This spear would cut down those Blood Drinking Seals and also cut down Lin Ming!\n “Haa!”\n The energy on the black spear gathered together, forming a mad wolf that rushed towards the Blood Drinking Seals. From the outside, this was a completely disproportionate collision of energy. But, the result was shocking enough to make one’s eyes blow up!\n With a loud ‘kacha’, the Blood Drinking Seals crashed into the energy that had formed a crazy black wolf and directly sliced it to shreds! Then, the Blood Drinking Seals didn’t slow down for even a bit as they shot towards Mo Da!\n “What!?”\n In that moment, Mo Da could only feel a cold sweat down his back like his soul had fled his body. In those dozen or so Blood Drinking Seals, he could feel a fatal portent!\n At this critical moment, Mo Da cried out and the energy in his demon crystal gushed out. The demonic essence wrapped around his hands as he punched at the Blood Drinking Seals. At the same time, the demon essence that protected his body was galvanized to the limit!\n Cha cha cha!\n Mo Da’s protective demon essence was like thin paper that was sliced apart by the Blood Drinking Seals. His fists that were comparable to steel were torn open by the Blood Drinking Seals, crushing his bones and causing blood to fly out!\n Mo Da screamed in pain. A dozen holes appeared in his body. He had lost his spear and his hands were completely destroyed. His entire body, from top to bottom, was gushing blood!\n If one didn’t personally see this shocking scene, then it was simply unbelievable. A five-star Demon General was actually brought to the brink of death by an early Xiantian realm youth with just a wave of the hand! It had to be known that in this Giant Demon world, the Giant Demons had always been a step higher and victorious over humans. There were very few times when a human had been able to leap realms in order to defeat a Giant Demon, much less with such an exaggerated difference in their abilities!\n The originally noisy scene was instantly silenced. All of the martial artists, whether they were humans or Giant Demons, had their mouths hanging wide open. They were unable to close them for a long time.\n Huo Yuan was stunned for a long time. Then, he suddenly remembered something. He took out a sound transmitting talisman that had been especially hidden away within his spatial ring. He gulped, spoke a message, and then lit the sound transmitting talisman, releasing it.\n Maybe… maybe the Silent Green Tribe could truly be destroyed… as Huo Yuan thought of this, his heart trembled.\n “Mm? His heart was pierced and he still isn’t dead?” Lin Ming was surprised. The Blood Drinking Seals had shot through several vital areas of Mo Da’s body, yet it wasn’t enough to instantly kill him. The life force of a Giant Demon was truly powerful.\n He casually stretched out his right hand, and suddenly gripped his hands together again.\n Ca!\n The dozen or so Blood Drinking Seals flew back and shot through Mo Da once more.\n Pu pu pu!\n After talking a dozen more wounds, Mo Da suddenly shook, and the luster faded from his eyes. As he tumbled onto the floor, his body was like an iron tower that had been destroyed!\n Bang!\n In the instant that Mo Da fell, all of the martial artists present felt like they were in a dream. Mo Da, who had ruled this section of the tribe for over 20 years, had died like this? Not only had he died at the hands of a youth who looked like he was 20 years old, but he didn’t even have the strength to resist! This young man hadn’t even taken out his weapon!\n Lin Ming flexed his fingers, and a scarlet arc of lightning sunk into Mo Da’s corpse. The lightning made a quick circle, bringing out a rain of blood. Then, a new Blood Drinking Seal slowly formed together. Compared to the previous ones, this one was even more beautiful and dazzling!\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-520","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
