{"id":54475,"no":530,"title":"Chapter 529 - Polar Skysplit Tower","content":"Chapter 529 Polar Skysplit Tower.\n Chapter 529 – Polar Skysplit Tower\n …\n …\n …\n “Mm?”\n The moment when the Heavenly Demon Tattoo manifested on his arm, Lin Ming found that just in front of him was an Imp with a curved dagger looking at him. His eyes shined, as if he thought Lin Ming were his prey. Beside him were also several other Imps.\n The Imp with the curved dagger giggled and smiled. “Oh, a newcomer and he’s also a human. My favorite are the humans. This newbie’s cultivation is also only at the Xiantian realm… keke, he’s only 20 some years old. He must be quite tasty.”\n As the Imp with the curved dagger spoke, the other Imps surrounding him laughed and whistled at Lin Ming.\n Once the Blood Slaughter Token was activated, it would temporarily merge with the martial artist, helping to form the Heavenly Demon Tattoo.\n If someone were killed outside of the arena battlefield, then they wouldn’t be able to steal away their infernal energy. Thus, none of the Imps attacked Lin Ming.\n Lin Ming glanced at the Imp with the curved dagger. This Imp was particularly short. Most Imps were around six feet tall, but this one was five and a half. His face was full of black, dry folds that were covered with long hairs. It caused anyone who saw him to feel disgusted.\n Lin Ming didn’t bother with them and directly walked over to the arena battlefield.\n Standing at the entrance of the arena battlefield were seven or eight guards. They directly stood in front of Lin Ming, blocking him. “Admission to Polar Skysplit Tower is one medium-grade Blood Demon Crystal.”\n Polar Skysplit Tower?\n The name of this arena battlefield was quite aggressive. But what was really staggering was the expensive price of admission. It had to be said that the cost of the Divine Blood Pill which was sold at Sun Flood City was 100 medium-grade Blood Demon Crystals. But, this was only enough for 100 individuals to enter the arena battlefield; this was absolutely squandering resources.\n Although those that came to Polaris City were most often the talents of their sects, they would still feel pain if they frequently passed in and out of the arena battlefield.\n “Low-grade Blood Demon Crystal?” Lin Ming asked.\n The arena guard looked at Lin Ming with contempt and coldly said, “200 low-grade!”\n A medium-grade Blood Demon Crystal was worth around 100 low-grade Blood Demon Crystals. But, this guard had actually opened his loud mouth and said 200, and his attitude was indifferent. Obviously he preferred not to take low-grade Blood Demon Crystals.\n Lin Ming thought for a moment and then took out some low-grade Blood Demon Crystals from his spatial ring. He hadn’t obtained too many Blood Demon Crystals from the Silent Green Tribe, and their quality wasn’t too high either. After he had killed the six Great Elders, he had gained several thousand low-grade Blood Demon Crystals. To the martial artists of Bewitching Cloud Prairie, this was an obscenely great wealth. However, once he came to the Blood Slaughter Steppes, he was about to run out even though he just used them a few times. The difference between martial artists from one land to another was simply too great.\n Lin Ming took out 300 low-grade Blood Demon Crystals and gave them to the guard.\n The guard impatiently received these 300 low-grade Blood Demon Crystals and then let Lin Ming into the arena battlefield.\n “You’re letting a beggar like that go through?” Another guard asked.\n “Heh, since he wants to go die, then he can go ahead. These people always think that Skysplit Tower is some casual place they can go to adventure in. They will only realize that they are nothing but insignificant fertilizer after entering.” The guard responded with disdain.\n ………..\n As Lin Ming walked into the main hall of the arena battlefield, he sucked in a deep breath as he was able to see the tall walls that surrounded the area. He finally realized why this place was called the Polar Skysplit Tower. This arena battlefield was thousands upon thousands of feet high. It was originally built atop this 60 to 70 thousand foot high cliff. In addition to the central pagoda that was thousands of feet high, it was truly worthy of being called the Skysplit Tower.\n Skysplit tower was thick at the bottom and thin at the top; it was shaped like a cone. The higher floors were hidden in a hazy, disturbing red fog. This fog was condensed from a great amount of infernal energy. Because the higher levels were concealed by the infernal energy, it was impossible to see just how high Skysplit Tower was.\n Lin Ming walked into the first level of Skysplit Tower. He discovered that the internal structure of this arena battlefield was much more complex than he had imagined. As he strolled along, he saw that there were a variety of bars, inns, restaurants, and even brothels.\n Lin Ming had only taken a few steps when a gaudily dressed prostitute slyly winked at him. There were many human and Fey prostitutes, and some of them were even martial artists. These martial artists’ talent was simply too poor, and their cultivation was too low. In their lives, they wouldn’t have any great achievements in the path of martial arts. However, if they engaged in the sex trade, they could still gain some Blood Demon Crystals for their own use.\n It was fine when the human and Fey prostitutes solicited him, but when Lin Ming saw that there were also Giant Demon and Imp prostitutes giving him flirty winks, he almost tripped. His stomach turned. Luckily, he had a solid psychological foundation, otherwise he might have vomited.\n The Giant Demon prostitutes were all taller than Lin Ming by at least a head, and their breasts were like two giant rubber balls hanging on their chests. Their blue skin was smeared in a coat of thick powder. It was quite nauseating. There was no need to mention the Imps. They were short, their faces were full of creases and their skin was dark; they looked no different from granny monsters.\n If Lin Ming had just seen these types of prostitutes, then he would still have been able to reluctantly accept it. After all, there were many Giant Demons and Imps here, and their aesthetic standards might be different.\n However… when Lin Ming watched with his own eyes as a male Fey martial artist pulled a Giant Demon prostitute into a room, he was left speechless.\n “A Fey martial artist… their tastes should run…” Lin Ming mumbled under his breath. He imagined that the life within Polaris City was just too difficult. Coupled with the constant hostility that filled the air and distorted the hearts, it forced others to have to vent out these feelings. For some, it might make them do abnormal things.\n “This Skysplit Tower is too large. It occupies an area over several miles long and there are all sorts of facilities inside. Once I pay the admission fee, I can live here as long as I want. No wonder there were so few people outside.”\n Lin Ming arrived at an arena area of Skysplit Tower’s first floor. He pushed open the door, and a surge of humidity and noise rushed past him.\n Lin Ming had seen a number of martial stages before. The arena was in the center, and it was surrounding by a ring of stands. The audience politely sat in the stands where they could comment on the battle or even cheer. But here, this concept of fighting was completely subverted.\n These were true killing grounds. The air was suffocating and fanatical. The arena was filled with tens of thousands of seats. However, very few of these people were sitting. Most of those there stood on their feet, screaming, laughing bawdily, or even waving around weapons in their hands.\n There was a massive number of individuals here from all races. There were Giant Demons, humans, Fey…\n The Giant Demon martial artists were originally cruel and brutal. This sort of environment naturally suited their disposition. They crazily howled and roared like mad beasts.\n In other areas, there were youthful Fey woman. Their beauty was enough to cause the downfall of a nation; they were fairy princesses that had stepped out of a book. But even they had taken off their coats, exposing their luscious skin and shapely bodies. They held glasses of bright red wine in their hands, and it looked like the corners of their mouths were overflowing with blood. It was strangely beautiful.\n Lin Ming even saw a Giant Demon martial artist push down a Fey woman on the spot and brutally ravage her as the battle onstage was reaching its climax. But, this Fey woman looked as if she was enjoying this as she wantonly screamed.\n On the martial stage, there weren’t just martial artists, but also a massive number of beautiful slaves. They carried drinks and wore little clothing; it wasn’t even enough to wrap up their butts. They delivered wine and water to the stands as they endured the abuse and groping of the martial artists.\n This atmosphere where alcohol and sexual desires mixed together continually provoked the taut nerves of the martial artists present.\n Hong hong hong!\n In the center of the martial stage, a Giant Demon was holding an axe as he recklessly attacked a large human fellow. This human was nine foot tall and his arms were thick and around. But, compared to the Giant Demon, he was rather small and his strength was also inferior. He had already been forced back by the Giant Demon several times, and was in increasing danger.\n “Kill! Kill him!”\n “Kill! Kill! Kill!”\n A strong manic sense filled air. With the thick infernal energy here, in addition to the catalyst of alcohol and obscene desires, it was easy for a person to lose their reasoning and fall into madness.\n “Die! Die! Haha!” The Giant Demon roared. He kicked the human onto the floor and then chopped down his axe on him.\n Kacha!\n The human\u0027s spine was severed and his heart was cut open from behind. The human martial artist gave a pitiful wail as he died!\n “Yes!”\n “Well fought!”\n “Zha Na, you are too fierce, too brave!” A female Giant Demon screamed. From her zealous expression, it seemed she was about to rush on stage and ravage Zha Na herself.\n Zha Na was obviously this large Giant Demon fellow. At the moment that he killed the human martial artist, a thick dark and bloody energy escaped from the human’s corpse. Some of it dissipated, but the large majority of it was absorbed into Zha Na’s body.\n After absorbing this infernal energy, Zha Na felt like he had smoked a great deal of opium. His entire body felt great, and he couldn’t help but howl out like a wolf.\n “Haha! Awesome! Who wants to come up next!?” Zha Na shouted to the clamoring crowd in the stands.\n A friend of that human martial artist that had died raged in anger to the point where his eyes almost popped out. He wanted to run onstage and tear that Zha Na into pieces, but he held back and didn’t go. He clearly knew that he wasn’t his match. If he went up, then his fate would be the same.\n “All you Feral and human garbage, you are all cowards! None of you dare to come up? Hurry and come up so I can taste your delicious blood! For trash like you lot to die at my hands, that is already your honor! Haha!”\n Zha Na cruelly laughed. As he laughed, so did all the other Giant Demons present, as they enjoyed ridiculing the Ferals and humans together. In Polaris City, only those with strength and power had the qualifications to be respected by others. Otherwise, their fate was only to be trampled and killed by everyone else.\n But whether they were humans or Ferals, they were synonymous with cowards.\n “F*ck, he’s too arrogant!” A human martial artist wanted to go up but he was stopped by his friend. “Don’t be so impulsive. He already has a five match win streak. Within Skysplit Tower’s first floor, that fellow strength is definitely at the top. He just killed three human martial artists a moment ago, and two Feral martial artists also died under his axe. We aren’t much stronger than those that just went on stage. If we go up, we are just sending ourselves to die.”\n “F*ck!” That human martial artist cursed. Finally, he was able to suppress himself.\n Lin Ming was standing beside this human martial artist and clearly heard their conversation.\n “That person just said that Zha Na’s strength is at the top of Skysplit Tower’s first floor. So, the higher I go in Skysplit Tower, the stronger the martial artists are…” Lin Ming muttered, “I’ll have to pass this first floor as soon as possible. I have to go to a higher level so I can hone my strength.”\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-529","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
