{"id":54490,"no":545,"title":"Chapter 544 - Measure for Measure","content":"Chapter 544 – Measure for Measure\\n\\n …\\n\\n …\\n\\n …\\n\\n Ka ka ka…\\n\\n The amethyst armor that covered Lan Xing’s body began to gradually sink back into his body, and the arcane runes on his face began to fade away until he appeared like the unbearably handsome Fey youth from before. But, blood still stained his face, giving him a fierce look.\\n\\n As Lan Xing looked at Lin Ming, his eyes were filled with pride and an intention to fight.\\n\\n “Young Hero Lan has obtained an 11 win streak. He has officially gained one slaughter point as well as two slaughter points from his gamble with Huyan Luo. Would Young Hero Lan like to continue battling?”\\n\\n “No,” Lan Xing shook his head, “I will rest for two hours before I begin my 12th match.”\\n\\n Everyone had thought that Lan Xing would continue and try for a 12 win streak in a single go. But his words had surprised them.\\n\\n “This boy! From his gamble with Huyan Luo, I had the sense that he was incredibly brazen, but now it seems that he is actually quite calm. He has consumed just a bit of energy but hasn’t gotten carried away by his victories. He actually decided to take a rest for two hours before continuing.”\\n\\n “Mm. It looks like it wasn’t a moment of impulse that caused him to make a bet with Huyan Luo. It’s likely that he investigated Huyan Luo ahead of time and believed he had a high chance of winning.”\\n\\n “Hehe, did you notice that Lin Ming also arrived? Do you think that Lin Ming will dare to stay here for two hours?”\\n\\n “This isn’t a question of whether he dares to but rather if he’s an idiot and will be swayed by his mood. Lin Ming arrived just in time to see Lan Xing’s last fight; that Fey King Battle Body is no joke. Lan Xing’s combat prowess has already reached the first tier of Skysplit Tower’s second floor, and not just that, but he can’t be considered too weak amongst the first tier!”\\n\\n As the audience spoke, many of those present were looking at Lin Ming. They were looking forward to seeing how Lin Ming would respond to this.\\n\\n Under the watchful eyes of the audience, Lin Ming didn’t have much of an expression. Instead, he calmly walked onstage.\\n\\n ‘Mm? Lin Ming is stepping onstage?’\\n\\n People had just had this thought when Lin Ming leapt up. Slowly, he fell onto the arena like a dragonfly on a still lake.\\n\\n Lin Ming glanced at the black-clothed referee and calmly said, “I would like to fight.”\\n\\n “Ah!”\\n\\n Many of the audience gasped in surprise and excitement. Lin Ming hadn’t left nor did he meditate to rest. Instead, he had entered the arena stage to fight. Was he trying to prove a point here?\\n\\n Lan Xing was also a bit stunned. He immediately smirked and then closed his eyes, returning to meditation to restore his mind.\\n\\n He didn’t need to look before realizing that Lin Ming wouldn’t encounter any decent opponents. Although there was a great deal of masters that were present today, none of them would make a move against Lin Ming, and this was simply because there was no advantage in doing so.\\n\\n At most, some of the weaker second tier human martial artists would come to challenge Lin Ming. These individuals came to gain experience as well as to challenge the gap between them and others. The martial arena of the second floor was never lacking in these types of martial artists, thus it was never difficult for one to gain a ten win streak. But, for those above a ten win streak, there were mighty masters everywhere. This was because they could gain slaughter points by ending someone else’s winning streak.\\n\\n And because the strength of these individuals might be too close, when a heated battle occurred, oftentimes death would accompany it.\\n\\n “White Wind Sect’s Zhou Tianyu kindly requests Sir Lin’s guidance!”\\n\\n A human martial artist jumped onstage. He wasn’t some random nobody. In fact, he had condensed a two-winged Heavenly Demon Tattoo; his strength could be considered decent.\\n\\n There were many martial artists on the second floor that would condense a Heavenly Demon Tattoo and then lose a round. They would then have to spend another period of time condensing it again, and repeat this process many times. But as long as they kept their life then failure wasn’t much at all.\\n\\n As the referee announced the start of the match, Zhou Tianyu’s sword flashed towards Lin Ming’s chest like a serpent. His sword strike contained a vague hint of the Concept of Water. His sword energy was long, liquid, and couldn’t be cut.\\n\\n However, this was completely nothing to Lin Ming. As soon as his spear power was displayed, a vibrating wave of true essence erupted. That wave of endless true essence smashed into the sword energy, shattering it into nothing.\\n\\n A spear thrust out, the tip like a bolt of lightning. It seemed to disappear into the void and instantly appeared between Zhou Tianyu’s eyebrows.\\n\\n Chi!\\n\\n Infernal energy suddenly converged on him. Zhou Tianyu felt a chilling cold between his eyebrows, and the hairs on his back began to stand on end. In that moment, he felt as if Lin Ming’s spear would cut through his head.\\n\\n “I… I’ve lost.”\\n\\n Zhou Tianyu was secretly relieved, but he discovered that his back was wet with sweat. Just then, he almost thought that he would die.\\n\\n “Well fought.”\\n\\n Lin Ming withdrew the Purple Comet Spear, and a surge of infernal energy within Zhou Tianyu rolled out and into Lin Ming’s body. Although it wasn’t much, it was still able to make Lin Ming’s Heavenly Demon Tattoo a bit more solid.\\n\\n “Lin Ming, victory!” The referee loudly announced.\\n\\n “What a powerful spear. Whether it’s his spear power or infernal energy, he can freely use them with skill and ease. I wonder if Lin Ming is hiding any more strength.”\\n\\n “Mm. Lin Ming is indeed powerful, but his opponents are too weak. Even if he wins beautifully it doesn’t mean much. If Lin Ming wants to defeat Lan Xing… the chances aren’t too high.”\\n\\n Zhou Tianyu wasn’t even at the same level as Huyan Luo. There were very few people that believed Lin Ming would win.\\n\\n However, in a corner of the martial arena, a white-haired middle-aged man was deep in thought. In that split-second, his sense of space and time seemed to have been mixed up. “Was that an illusion? That seemed like just a casual strike from that boy, but if I were to face it, even I would find it difficult to avoid…”\\n\\n Four win streak, five win streak, six win streak…\\n\\n Lin Ming obtained an eight win streak in a single go. Every match didn’t exceed three moves. He was like an unstoppable juggernaut that mowed down everyone before him.\\n\\n Although none of Lin Ming’s opponents were masters, every battle was easily won. In all these rounds, Lin Ming’s breathing hadn’t even quickened. This secretly startled some people present.\\n\\n “Eight matches, eight victories. This is Young Hero Lin’s fifth match today. Do you wish to continue with a sixth match?” The black-clothed referee asked.\\n\\n Within Skysplit Tower, a martial artist normally wouldn’t fight more than three battles a day. The truth was that this was for the sake of caution. They wanted to avoid seeming too arrogant and cocky, thus drawing out some masters to suppress them.\\n\\n As Lin Ming was now, he could breeze through these past five matches like nothing.\\n\\n “Perhaps.” Lin Ming glanced over at Lan Xing, thinking about how much time was left. He, like Lan Xing, wouldn’t underestimate his opponent. Lin Ming was looking forwards to seeing just what this Fey King Battle Body was all about.\\n\\n After Lin Ming stepped offstage, everyone’s eyes were on him. They wanted to see whether he would leave or stay in the martial arena.\\n\\n Lin Ming was a pure newcomer, much newer than Lan Xing. Lan Xing had already practiced on the second floor for an entire year. At this time, facing this sort of opponent, it wouldn’t be a shame if Lin Ming avoided battle.\\n\\n However, Lin Ming only silently walked over to a seat and sat down. These several matches hadn’t really tired him, he was only sitting to adjust his mentality.\\n\\n “He sat down! Heh, the newborn calf really doesn’t fear the tiger!”\\n\\n “He’s only treating him equally. He’s already aware that Lan Xing will challenge him yet he doesn’t care. Instead, he calmly welcomes Lan Xing’s challenge.”\\n\\n “This is quite fun to watch!”\\n\\n When masters fought, especially two rising star talents, it often drew a great crowd. The news of the potential battle spread out, and more and more people crowded into the arena. There was constantly people streaming through the entrance of the martial arena. Soon, there were 4000 to 5000 people in the stands. Besides some martial artists that had gone into closed-door seclusion, most of the other martial artists had come. There were even some lower level martial artists that mainly did business on the second floor who also came, hoping to see the fun.\\n\\n The entire martial arena was filled with people. As for the center stage of the martial arena, there actually wasn’t anybody fighting. They were all waiting for Lin Ming and Lan Xing to fight.\\n\\n Time slowly passed. Lin Ming was like a monk as he sat in meditation, and Lan Xing wasn’t in an hurry either.\\n\\n The crowd around the two began to loudly shout in their discussions.\\n\\n In truth, Lan Xing didn’t even need an hour to restore his peak condition. But even so, he still stayed in meditation without any desire to stand up. In this situation, a normal person would inevitably become patient and jump onstage for the waiting audience. But, Lan Xing completely disregarded all of this. Since he said he would rest for two hours, he would rest for two hours.\\n\\n The mental stability was startling.\\n\\n “It’s time.” Two full hours later, Lan Xing opened his eyes from his quiet meditative state. His voice was calm like a placid lake.\\n\\n “What a strong mentality!”\\n\\n Some people in the audience couldn’t help but cry out in acclaim. People with this sort of disposition could maintain their peak battle condition at all times. There were very few external factors that would be able to affect their state of mind.\\n\\n “This fellow is quite scary. Not only is his strength heaven-defying, but he also has a calm personality.”\\n\\n Lan Xing looked over to Lin Ming, the corners of his lips rising in a grin, “Since you’ve been waiting here for me, it looks like you’ve already decided to fight me. Since that’s the case, let’s go onstage!”\\n\\n Lan Xing’s figure blurred and he appeared on the arena stage. Lin Ming followed, lightly falling onto the stage.\\n\\n “Lin Ming, during my match with Huyan Luo, I made a bet with slaughter points. Do you dare to follow my gamble?” Lan Xing taunted.\\n\\n “How many do you want to bet?” Lin Ming asked.\\n\\n “The same, two. If you can defeat me, not only will you obtain slaughter points from stopping my winning streak, but you can also win two slaughter points from a bet. Of course, this all depends on whether or not you can win.”\\n\\n “Then let’s do it!” Lin Ming readily agreed.\\n\\n “Haha, great! Wonderful! Then I won’t be polite!” As Lan Xing spoke, he extracted a longsword from his spatial ring. The blade began to hum in the wind.\\n\\n This was the achievement of integrating the Concept of Wind into one’s sword skill.\\n\\n In terms of the Concept of Wind, Lan Xing’s understand far surpassed that of Lin Ming.\\n\\n Lin Ming also took out the Purple Comet Spear. A tranquil yet indomitable aura suddenly burst out from him. He was like a towering mountain, unreachable and unattainable.\\n\\n Chi chi chi!\\n\\n The two hadn’t even fought but their auras were already colliding with each other. Compared to Lin Ming’s steady aura, Lan Xing’s aura was like flying arrows, both sharp and penetrating.\\n\\n “Heh! You are truly extraordinary. Then I will see just how much of my strength you will be able to pull out!” As Lan Xing spoke, his expression changed. His eyes flashed like cold stars in the sky, a chilling light emanating from them.\\n\\n “Sword of Wind!”\\n\\n As Lan Xing finished speaking, the sword in his hand disappeared. His sword had fused into the wind. One could only see the wind, but not the sword.\\n\\n In that instant, countless sword lights wove into a net that covered the sky, falling down onto Lin Ming.\\n\\n “Golden Roc Shattering the Void!”\\n\\n Lin Ming instantly vanished. The tiles that were underneath his feet were sliced into pieces by that the sword energy!\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-544","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
