{"id":54512,"no":567,"title":"Chapter 566 - Into the Third Floor","content":"Chapter 566 – Into the Third Floor … … … Lin Ming hadn’t opened the Gate of Healing, it was just that there was a faint hazy blue mist near it. This was the way it was. Every time Lin Ming attacked, he could clearly feel the heaven and earth origin energy pass through this mist and into his clavicles, converging into his meridians and dispersing through his body. It was like an invisible origin energy vortex had appeared near the Gate of Healing. With a constant supply of origin energy, Lin Ming’s long-term combat efficiency had greatly increased. This was also the reason that the Heretical God Force could now last for an incense stick of time. From the point that Lin Ming began to rise, the Heretical God Force had helped him countless times to reverse the flow of battle. However, the Heretical God Force had a fatal flaw, and that was that it couldn’t last for an extended period. After he used it, it would consume a great deal of his energy; this was the reason that Lin Ming didn’t dare to easily open the Heretical God Force in a fight, instead saving it as his final move. When Lin Ming first entered Skysplit Tower, his Heretical God Force could only last for several dozen breaths of time. Not just that, but once he opened it he couldn’t close it. After entering Skysplit Tower and practicing here for a long time, the Heretical God Force had taken another step further. Lin Ming could now momentarily open and close the Heretical God Force. After touching upon the threshold for the Gate of Healing, the duration of the Heretical God Force had also lengthened to an incense stick of time. It could be said that the practical usability of the Heretical God Force had been greatly enhanced. After putting away the Cosmic Melting Furnace, with his whole body exhausted and aching, Lin Ming fell into a wonderful sleep. It had been a long time since he was able to relax in sleep. During his stay so far in this top-grade practice area, he had even spent his sleep time cultivating. With this comfortable feeling, Lin Ming slept well, resting for an entire day and night. After waking up he took a bath and switched into a new set of clothes, and then made a detour to the city square in order to pick up any new Blood Demon Crystals that were traded in. It was time to go to the third floor. Without knowing, Lin Ming had already stayed on the second floor for over half a year of time. It had been nearly a year since he arrived at the Holy Demon Continent. One year. How were Miss Mu and Xingxuan doing? Was Divine Phoenix Island able to defend itself? How were his parents? How was his little sister? Lin Ming was filled with worries. ……………………… “This is the opening token for the transmission array to the third floor. Please take it.” Nearby the second floor’s transmission array, a guard responsible for handling challengers said to Lin Ming as he respectfully handed the token to him. “Thank you.” Lin Ming received the token and placed it into the transmission array. A white light flashed around him. In the next instant, Lin Ming arrived at the third floor; this was also the final floor for Skysplit Tower’s challengers. Skysplit Tower was shaped like a cone. The further up it went, the smaller it was. The third floor was barely half the size of the second floor. As Lin Ming stepped forth from the transmission array, a young Fey girl was already waiting there. “Young Hero Lin? My name is Linlin, I have been waiting here for you for a long time.” Starting from the second floor, every new arriving challenger would have a reception with a servant. This person could introduce them to the practice areas or show them to the martial arena location in order to avoid trouble. “That’s me!” Lin Ming cupped his fists together. The young girl named Linlin was surprised and then quickly covered her mouth as she chuckled. Martial artists that came to the third floor were normally around 26 or 27 years of age. Not just that, but they were always extremely prideful and arrogant in their behavior, mostly disdaining to talk to such a low level character like her. It was surprising to meet such a well-mannered and polite young man like Lin Ming. “Young Hero Lin, I can serve you for these next few days. Practice place, arena, city square, entertainment area; where would you like to go?” “Practice place!” Lin Ming replied without hesitation. After his conversation with Muk Gu, Lin Ming was interested in the practice areas on the third floor. He especially wanted to know what resources were here that would cause so many outstanding young elites to rush to the third floor like a pack of ducks. “Mm. Please follow me.” The third floor was much lonelier than the second floor. Walking through the roads here, it was rare to see a martial artist. Most of them were in closed-door seclusion. On Skysplit Tower’s third floor, the pressure was great. The martial artists that made it here were not common within their generation. Every single person that practiced here was like a boat going against the current of the ocean. If they couldn’t move forwards then they would fall behind, and once they did, they would inevitably fall into the abyss without any chance of redemption. This great pressure spurred on every martial here. If they couldn’t become an Emperor, then they would become a ghost. ………….. The third floor’s practice area and city square bordered each other. When Linlin brought Lin Ming close to the third floor’s city square, he finally began to see more martial artists in his surroundings. It was similar to the second floor; there were many martial artists that had set up a stall here. Lin Ming glanced over. Most of the martial artists’ cultivation were at the early Xiantian realm, and there were even some at the Houtian realm. Lin Ming was a bit surprised. “These people are…” “Oh, they are employees of the challengers here. They are specifically responsible for setting up stalls and making sales. The challengers of the third floor just don’t have time to idle around for business. The city square and practice area on the third floor prohibit fighting, so vendors here can do business without danger even if their cultivation is low.” Lin Ming nodded. Truly, the third floor was different from the second floor. Here, every second counted. One had to seize every chance possible. Hiring someone to work for them and handle their affairs was the most reasonable approach. Lin Ming swept over several of the items on sale here and noticed that everything was much more expensive than on the second floor. But, Lin Ming was already used to seeing such rare and valuable treasures, so he wasn’t too interested in them. As he was about to exit the city square, Lin Ming suddenly felt someone’s attention lock onto him. Lin Ming stopped his footsteps and turned around. Behind him, several dozen feet away, there was an Imp sitting at a square table. He was swinging a folding fan in his hand, slyly smiling. Although his smiling expression appeared very amiable, Lin Ming actually had a feeling that he was being stared at by a viper. ‘This person… is strong!’ Lin Ming took a deep breath, his expression solemn. This person had completely restrained their aura within their body, giving off an unfathomably deep feeling. Skysplit Tower’s third floor was truly a den of crouching tigers and hidden dragons. Masters were simply everywhere here. Feeling potential hostility in this person’s smiling expression, Lin Ming decided that he didn’t want to cause unnecessary complications. Just as he was about to turn and leave, a true essence sound transmission sounded in his ears. “Stop right there!” This order carried an imperious tone to it. Lin Ming frowned. As he turned again, he saw that the Imp had closed his folding fan. The Imp said, “Come, let’s have a chat.” The Imp nodded at a stool across from him – he wanted Lin Ming to walk over and sit there. “What?” Lin Ming asked. Anybody who was commanded to walk over by someone they didn’t know wouldn’t be feeling too good about it. But at this moment, as Linlin saw this Imp, her expression changed. She hurriedly bowed and respectfully said, “So it’s the Heavenly Demon Seven Stars’ Sir Kai Yang. This young girl greets Sir Kai Yang.” Heavenly Demon Seven Stars? Lin Ming had already heard this title before. It seemed that the Heavenly Demon Seven Stars were famous on the third floor. So this Imp was apparently one of the Heavenly Demon Seven Stars. No wonder he had been so arrogant, that was because he had the strength to back it up. Lin Ming was silent for a moment, but at this time, Linlin’s panicked true essence sound transmission reached his ears. “Young Hero Lin, don’t look at Sir Kai Yang’s friendly expression, in truth he is a cruel and bloodthirsty individual. He uses extremely wicked and sadistic means. Young Hero Lin, you should quickly go over. If you anger him, he will keep a grudge in his heart. It will be dangerous to you in the future…” As Linlin saw Lin Ming not responding, she became a bit impatient. She feared that he would somehow offend Kai Yang. She had a very good impression of Lin Ming, so she didn’t want him to suffer a loss in the future because of this. Sure enough, as Kai Yang saw Lin Ming’s indifferent look, he glowered. Then, as if he suddenly thought of something, Kai Yang’s amiable smile returned and he took initiative to stand up instead. “If you don’t want to come over, it’s fine that I come over instead.” Kai Yang slowly walked over to Lin Ming as he swung his fan. Linlin was afraid. She had heard that Kai Yang was subject to wildly swinging moods. If he smiled, it was likely that he wanted to kill someone. She subconsciously stepped back. Then again, this was the city square. Fighting was prohibited here. No matter how great Kai Yang’s courage was, he would not randomly kill someone here. This thought calmed her down somewhat. But she couldn’t be blamed for shrinking back. On the third floor, it was normal for a challenger to kill a servant because they were displeased by something. Lin Ming’s mind went on alert though he remained calm and collected on the surface. He knew that when he arrived here, it was likely that he would meet someone who was aiming at him. When Kai Yang approached, Lin Ming cupped his fists together and said, “Can I help you?” This question that was neither humble nor arrogant caused the Imp to smile. When he smiled, the wrinkly folds on his face bunched up even further, causing him to look even more disgusting. “Lin Ming?” “I am Lin Ming!” “Mm, I heard that you killed Xing Tian?” Lin Ming raised his eyebrows. “Yes. Are you thinking of taking revenge for him?” “Revenge? Hehe, I don’t have that much time to waste. But… when you killed Xing Tian, you should have obtained his spatial ring?” Lin Ming’s mind went cold. This Imp had come here for this? He nodded. It was impossible to hide something like this. “Haha…” The Imp chuckled twice. Then, he switched to a true essence sound transmission and said, “In Xing Tian’s spatial ring, if I’m not wrong, there should be a black, glass-like bead, around the size of a pigeon egg. It’s covered in impurities and is cool to the touch, right?” Lin Ming remained silent. There really was this sort of bead within Xing Tian’s spatial ring. It had been cleverly hidden within a normal looking pill bottle by a spell. If he hadn’t carefully looked through Xing Tian’s ring, then he would have really missed it. Although Lin Ming didn’t completely understand the function of this bead, he could tell from how Xing Tian had carefully treated it, in addition to a faint intuitive feeling he had, that this bead was something extraordinary. Seeing Lin Ming’s silence, the Imp smiled. In truth he didn’t need Lin Ming to reply. He could approximately guess that this bead had fallen into Lin Ming’s hands. “1000 Blood Demon Crystals! I’ll buy that from you!” The Imp tossed out a price tag. These 1000 Blood Demon Crystals were naturally high-grade Blood Demon Crystals. It was equal to more than 100,000 medium-grade Blood Demon Crystals. “I’m sorry, but it’s not for sale.” Lin Ming flatly refused. He could earn Blood Demon Crystals again, but this bead was most likely something that couldn’t be bought. Naturally Lin Ming wasn’t do something so stupid as selling it. “Mm?” Kai Yang frowned. He didn’t become angry but instead coldly said, “Then how much do you want? Name a price!” Lin Ming said, “I just said that I will not sell this bead.” Kai Yang glowered. “So you would rather do things the hard way, huh!?” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-566","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
