{"id":54532,"no":587,"title":"Chapter 586 - Chaos Prison","content":"Chapter 586 – Chaos Prison\\n\\n …\\n\\n …\\n\\n …\\n\\n From the late Xiantian to extreme Xiantian, this increase in cultivation wouldn’t cause Lin Ming’s relative strength to rise by much.\\n\\n But from extreme Xiantian to Revolving Core, that was a massive leap!\\n\\n Within the Sky Spill Continent, a Xiantian martial artist could be haughty and arrogant within a small mortal country. But, a Revolving Core master could actually dominate their own area, creating their own sect.\\n\\n After swallowing down some recovery pills, Lin Ming didn’t even have time to heal before a new cage came shrouding down on him, closing him in once more.\\n\\n But the Heavenly Demon force field hadn’t weakened in the slightest. It still enveloped Lin Ming, making it difficult for him to even regenerate his wounds.\\n\\n “Once this Heavenly Demon force field comes down, it won’t weaken even if I break apart the cage. As long as I stay in the King’s Cage, every day I do means I will have to withstand the pressure of the Heavenly Demon force field for another day!”\\n\\n This covered every tiny unit in his body, and even his soul came under heavy pressure. This feeling left one gasping for breath. And what was most frightening was that the Heavenly Demon force field slowly strengthened over time.\\n\\n This was why even a top talent like Feng Shen could only stay within the King’s Cage for 28 days.\\n\\n He was too exhausted.\\n\\n If this was normal practice, then after someone exhausted all of their true essence they could just sit in meditation for several hour and then take a long sleep to recover all their physical strength.\\n\\n But in the King’s Cage, they had to resist the pressure of the Heavenly Demon force field even when they were sleeping, constantly consuming true essence.\\n\\n If a martial artist with a poor recovery rate came and his rate of true essence consumption was higher than what he could recover in meditation, how could he persist in the King’s Cage?\\n\\n However, consumption of energy was not a problem to Lin Ming. In terms of endurance and resilience, he was superior to even those old first stage Life Destruction monsters! Of course, his strength was far weaker than theirs.\\n\\n Time passed day by day. Lin Ming didn’t know how much time passed, but no matter how prodigious his resilience was, after facing such heavy pressure constantly in this environment, he still felt his mind and body sliding into collapse.\\n\\n Of his entire body, there was no point that wasn’t distressed. Even his spiritual sea was bearing this tremendous pressure.\\n\\n This caused Lin Ming to be especially startled. His soul defensive strength was in no way inferior to a Life Destruction powerhouse’s, but if even he felt such a weight on his soul, then other people’s situations could be inferred.\\n\\n “This is truly worthy of a Titled Asura smelting trial. If the Eightfall War Emperor could last for two whole months here, then he was certainly a proud son of heaven amongst his generation…”\\n\\n ……………\\n\\n Skysplit Tower, special practice area.\\n\\n A light flashed and a white-robed youth left the practice area, silently looking at the King’s Cage. This young man was the first ranked master of Skysplit Tower’s third floor, Feng Shen.\\n\\n At this time, the door of light leading to the King’s Cage was calmly flowing, like a ocean weave in a gentle breeze.\\n\\n However, under this seemingly calm appearance, Feng Shen was well aware as to how great the pressure within the King’s Cage would rise to be.\\n\\n Today was already the 40th day!!!\\n\\n When Feng Shen entered the King’s Cage, he had only been able to stay within for 28 days.\\n\\n The duration that one could persist inside had nothing to do with one’s individual cultivation. Rather, it looked at a martial artist\u0027s talent, tenacity, perseverance, will, cultivation, and other factors that affected it.\\n\\n Thinking back to his experience in the King’s Cage, Feng Shen still had a lingering fear. As he nearly finished the 28th day, the pressure suddenly rose by another level. It was horrible to the point of tearing his meridians and crushing his soul.\\n\\n As a last resort, Feng Shen had to use the escape talisman to leave.\\n\\n “40 days… that already approaches the level of the Netherworld Asura. This is a talent that challenges the heavens themselves. Him and I were both born in the same era. I don’t know whether that is luck or misfortune…”\\n\\n Feng Shen shook his head, turned his eyes and walked away.\\n\\n Five days passed in a flash.\\n\\n 45 days!\\n\\n This was a time equal to the Netherworld Asura. The news quickly spread through the third floor like wildfire.\\n\\n This implication of this was that Lin Ming’s talent already surpassed the Netherworld Asura’s!\\n\\n This was truly a legendary achievement. Towards Lin Ming, the martial artists of the third floor felt admiration, envy, jealousy, veneration, love, every single viewpoint could be found.\\n\\n Lately, a great number of martial artists either wittingly or unwittingly passed by the special practice area every day, wanting to see if that was the time that Lin Ming would come out.\\n\\n The number of days continued to increase.\\n\\n 46 days, 47 days, 48 days… 50 days!\\n\\n As long as he could stay within for another 10 days, then that was the record of the Eightfall War Emperor!\\n\\n If so, then that was truly a heaven-piercing achievement!\\n\\n To this extent, the number of people jealous of Lin Ming actually grew smaller and smaller.\\n\\n When Lin Ming’s lofty star far surpassed them, their jealous hearts paled. This was because they were simply not on the same level, so there was no point in competing with him. Instead, these individuals would rather witness the birth of a miracle in front of them.\\n\\n “Humph! What a group of idiots! Do they really think that Lin Ming has lasted until now?” In a luxurious restaurant in the vicinity of the practice area, Yan Chi was drinking wine, sneering at the crowd gathered outside the special practice area.\\n\\n In front of him were Maha and Kai Yang.\\n\\n These three people had pledged their allegiance to Skysplit Tower one year ago. Because they signed a soul contract, they were loyal to Skysplit Tower. Naturally, High Lord Heian had no need to hide the truth from them.\\n\\n They were already aware that Lin Ming would never emerge from the King’s Cage.\\n\\n “50 days. Lin Ming most likely died inside. Although he was a truly prodigious character, he was still not on the same level as the Eightfall War Emperor. Even if he could compare with the Eightfall War Emperor, it wouldn’t matter anyway. High Lord Heian has already decided to seal the King’s Cage for eight months. Even if Lin Ming was the reincarnation of a demon god, there’s nothing he could do about it.” Maha sneered from the side while throwing some dried fruits into his mouth.\\n\\n “Hehe, I really want to see these people’s expressions after another three or four months; I will be ecstatic. They all think that Lin Ming can create some sort of miracle, but none of them will know that Lin Ming has already died. A Titled Asura level talent has actually died in Skysplit Tower, how ironic is that!” Kai Yang repulsively grinned as he stroked his wrinkled chin. In his heart, he was thinking it was unfortunate that there was a Demon God Bone in Lin Ming’s spatial ring.\\n\\n Kai Yang had also seen this Demon God Bone before. It was the size of pigeon’s egg. For it to be left within the King’s Cage without knowing whether or not it would ever come out was simply a great waste.\\n\\n “Let’s go. The High Lord has made an exception and opened up the Divine Image Hall for us. We will each have 10 days to meditate inside and learn as much as we can. Let’s go back and prepare so that we’re in our best condition for it. We can’t miss this opportunity.”\\n\\n “Mm, let’s go.”\\n\\n …………………….\\n\\n In the King’s Cage, the Heavenly Demon force field’s pressure rose another level. These past days, Lin Ming had discovered another rule, and that was that the Heavenly Demon force field’s pressure would rise another level every 10 days!\\n\\n During this grueling process, Lin Ming’s body was constantly adapting towards this higher pressure. His body, meridians, all of these were being tempered and unceasingly strengthening.\\n\\n As the Heavenly Demon force field grew stronger, so did Lin Ming.\\n\\n “Mm… this is?”\\n\\n When a new cage came falling down, Lin Ming was startled. This time, the cage was completely different from the usual barriers of light.\\n\\n Fu---!\\n\\n Everything in front of him turned pitch-black, chaotic. He couldn’t see anything at all!\\n\\n A thick darkness manifested into reality, fusing together with the Heavenly Demon force field. An overwhelming force enveloped everything, making Lin Ming feel as if he were suffocating!\\n\\n This chaotic darkness contained a great resistance. Even moving was extremely difficult.\\n\\n Lin Ming felt as if he had sunk deep into a quagmire. He couldn’t see anything. Even when he released his perception, it was blocked by this chaotic darkness.\\n\\n His perception could only extend a single inch outwards from his body!\\n\\n To a martial artist, this was no different than blinding them.\\n\\n Lin Ming’s chest ached. He tried to breathe, but the amount of air he inhaled was pathetic.\\n\\n Could the Eightfall War Emperor have been defeated at this pass?\\n\\n Lin Ming carefully thought back. When he had first entered the King’s Cage, it had been around 10 days before he encountered the bitter taste of the Heavenly Demon force field.\\n\\n This could also explain why the worst of all martial artists could only last 10 days in the King’s Cage before they were defeated. This was probably because they couldn’t withstand the beginning of the Heavenly Demon force field.\\n\\n Then, Lin Ming began to count. The Heavenly Demon force field had strengthened around five times by now. If he wasn’t wrong, then 50 days had passed. In addition to the 10 days at the start, this was his 60th day. This was the same time that the Eightfall War Emperor had forced out!\\n\\n What kind of amazing character was the Eightfall? He had crossed eight stages of Life Destruction while grasping the Concepts of Space and Time, then becoming a great Emperor that was peerless within his level. As a human, he overcame all odds and earned the title of 12-winged Heavenly Demon within Skysplit Tower!\\n\\n But he had been defeated at this stage! This proved just how difficult this part of the trial was!\\n\\n “Senior Eightfall was defeated here. Then, let me see just how far I can go!”\\n\\n Lin Ming roared out and the Heretical God Seed erupted. His skeletons began to issue popping sounds as the faint cry of a dragon emerged from within his body.\\n\\n The Purple Comet Spear lay horizontal. On the spear point, the power of thunder and fire wove together.\\n\\n Penetrating Rainbow!\\n\\n A spear thrust out. A radiant spear cut through the stick black chaos, a ripple shaped thrust penetrating dozens of feet far away!\\n\\n However, this strike ended here. The spear light was eventually swallowed by the black chaos. The three foot wide hole and the spiral ripples that extended dozens of feet out slowly vanished.\\n\\n Lin Ming’s eyes flashed. He took an immediate step forwards and crashed into that spiral shaped tunnel he had formed. In a single step, he jumped a hundred feet forwards. But then, he was suddenly engulfed once more by that black chaos!\\n\\n The resistance suddenly increased. Every step Lin Ming took was beset with hardship!\\n\\n Without a doubt, this sticky black chaos was the King’s Cage of this round!\\n\\n In the last cage, as long as one had enough striking power, they could break through it sooner or later. But now this current cage, no matter how fierce one’s attack was, it would eventually fade away into this regenerating darkness that had manifested into existence.\\n\\n He could only rely on his own two feet to leave!\\n\\n Lin Ming took out several dozen high-grade Blood Demon Crystals from his spatial ring. In a single breath he sucked dry all of their heaven and earth origin energy as well as their blood vitality.\\n\\n Eight Inner Hidden Gates – Gate of Healing, open!\\n\\n Bang!\\n\\n Between Lin Ming’s clavicles, a white light began to shine!\\n\\n Lin Ming had only touched upon the threshold of the Gate of Healing – he hadn’t actually opened it yet. If he forcefully used the Gate of Healing’s strength, then it would instantly place a great burden on his body.\\n\\n After touching the Gate of Healing, a powerful resiliency and strength came gushing out.\\n\\n Lin Ming aimed at the direction he started moving in and thrust out his spear!\\n\\n The spear light pierced through the black chaos. Lin Ming moved forwards, one step at a time.\\n\\n Lin Ming didn’t know how large this black chaos was, or whether this was the correct method to leave this chaos prison. But he had no choice.\\n\\n All he could do was move forwards!\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-586","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
