{"id":54536,"no":591,"title":"Chapter 590 - Betting It All","content":"Chapter 590 – Betting It All\n ….\n ….\n ….\n The transmission array would only appear once this space cage was broken and it would only appear for a short period of time. If Lin Ming wanted to break open the space locking array during that brief period of time, then that was simply unrealistic!\n Thinking of this, Lin Ming felt his back go cold.\n The tiny space fragments were hidden around him, appearing and disappearing; he simply couldn’t evade them all. If this continued then he would die without a doubt!\n Chi!\n With a light din, Lin Ming felt a cool touch upon his ear. A space fragment had scraped his ear as it flew by!\n Caught up in a space vortex, blood shot out from his ear!\n He had been completely unaware of this small fragment. Fortunately, it had brushed past his ear with only a bit of the power of space spreading out. If it had shot into his eyes then the consequences would be have been disastrous!\n “What can I do?”\n Lin Ming’s mind went into overdrive as he went on full alert.\n As he noticed several more tiny space fragments disappear from the field of his perception, a flash of inspiration went off in Lin Ming’s mind – the Cosmic Melting Furnace!\n That was it! The Cosmic Melting Furnace had its own world within. He could enter it!\n The top treasure of the Demon God Imperial Palace was invaluable; it was at least a heaven-step treasure.\n Lin Ming could only open the first layer of the Cosmic Melting Furnace. But… that was enough!\n Lin Ming summoned the Cosmic Melting Furnace with the quickest speed possible. He opened the lid and directly rushed in!\n Now, this furnace was all he could depend on.\n Kacha!\n With a snapping sound, the Cosmic Melting Furnace gently quivered. A space fragment struck the side of the Cosmic Melting Furnace, breaking into smaller pieces!\n But the Cosmic Melting Furnace only vibrated, not a single mark left on it.\n This could be called an artifact treasure. It was naturally not something that a space fragment could break.\n Lin Ming let out a cold breath of relief. He was now hidden within the first layer of the Cosmic Melting Furnace. With the lid closed, this was a completely enclosed and separate space. Originally, Lin Ming had also absorbed the Nirvana Dragon Root here.\n “Although I can’t use this Cosmic Melting Furnace to attack, it can actually be used to defend in this way.”\n Until now, Lin Ming truly hadn’t used the Cosmic Melting Furnace. He didn’t think that it would have uses like this.\n “The Heavenly Demon force field’s pressure has also weakened a bit…”\n Although Lin Ming was currently within the Cosmic Melting Furnace, he could still clearly feel the pressure from the Heavenly Demon force field, though a majority of it had been isolated.\n This pressure was truly pervasive!\n Thinking of it, the 12 Skysplit Towers, Blood Slaughter Steppes, and Eternal Demon Abyss were a much more terrible relic of the past than the Demon God Imperial Palace. Otherwise, 12 Emperor level powerhouses wouldn’t have instantly died here. The Six-fingered Sin Fey, who had obtained the title of twelve-winged Heavenly Demon and became the greatest powerhouse of the Holy Demon Continent, had come here on his own volition after experiencing a bottleneck in his 6000 years of cultivation. He had come to the Eternal Demon Abyss to seek his own lucky chances, but had also died inside like everyone else, without even his corpse left.\n On the other hand, the Demon God Imperial Palace was much calmer. If a Life Destruction powerhouse went in, then they had a 90% chance of leaving alive.\n After all, in the past when the Demon Emperor had founded the Demon God Imperial Palace, he still hadn’t soared up into the Realm of the Gods. No matter how powerful he was, he wouldn’t be more formidable than the mystical force that existed in the Eternal Demon Abyss.\n From Da Gu’s description, a massive earth-shattering claw had risen up and instantly killed 12 Emperor level powerhouses, one of them who was a legendary Hallowed Lord. Just thinking about this was horrifying!\n Feeling the space fragments strike the Cosmic Melting Furnace, Lin Ming’s eyebrows wrinkled together.\n Although he could hide in the Cosmic Melting Furnace for now, he couldn’t do so forever.\n If he couldn’t break apart the dimensional fragment cage, then he couldn’t return. Not just that, but the force field pressure in the Cosmic Melting furnace would also be constantly rising. If he retreated into this furnace and wasted his time here, then that was the same as drinking poison to slake his thirst!\n When the pressure became stronger, it would be even more difficult to break through the space cage.\n What could he do?\n Lin Ming was silent for a moment, and then he clenched his teeth. He pulled out a black glass bead from his spatial ring.\n This was the Demon God Bone!\n According to Da Gu, these were the remnants of Emperor level powerhouses. When an Emperor level Supreme Elder died within the Eternal Demon Abyss, the energy within their body would condense into this essence!\n Like pine sap that became amber after being buried in the ground for hundreds of thousands of years, the rich energies in the Eternal Demon Abyss condensed into substantive energy. After an immeasurably long period of time, this energy would naturally crystallize.\n This sort of crystal, if he melted it into his life source and used it to nourish the fires of his life, let alone raising his strength, it was even enough for a Demon King powerhouse to break through to become a Demon Emperor. This was a heavenly treasure that a Demon King level martial artist would go crazy over!\n Of course, he could also use it to temper his body, but this was an extremely wasteful method. Even a Giant Demon martial artist wouldn’t use it in such an extravagant way.\n Tempering the body…\n Lin Ming muttered to himself. He had some understandings about the usage of the Demon God Bone from Da Gu, as well as gaining some insights from Maha. This was to integrate the energy of the Demon God Bone into his own life source.\n To a human martial artist, this so-called life source was the dantian.\n To a Giant Demon martial artist, the life source was their demon crystal.\n Lin Ming cultivated humanity’s essence gathering system. Logically, if he absorbed the Demon God Bone then he should absorb it into his dantian.\n But Lin Ming didn’t want to do this. He was preparing to use the Demon God Bone to temper his body. This was also called the most wasteful method.\n He wanted to take the incomparably rich energy within the Demon God Bone and fuse it into the Gate of Healing, using this to break through the final boundary of the Eight Inner Hidden Gates!\n This was the fastest way Lin Ming could think of to make a breakthrough in his strength.\n “With my current strength, it shouldn’t be a problem to swallow the Demon God Bone.”\n Lin Ming also had some understandings towards the Demon God Bone. Since the Heavenly Demon Seven Stars could use them, he shouldn’t have a problem either.\n Of course, swallowing the Demon God Bone was not a problem, but whether he could borrow its power to open the Eight Inner Hidden Gates, he was completely unsure. From Tempering Marrow to the Eight Inner Hidden Gates, that was equal to a large increase in realms. There was a gap in the middle of these two that was nearly insurmountable.\n From all the brutal requirements Lin Ming needed to complete Tempering Marrow in the past, one could see just how difficult it would be to open the Eight Inner Hidden Gates.\n Although he had just barely traced upon the threshold, it was at most equal to being a half-step into the Eight Inner Hidden Gates. It was the same as being a half-step Xiantian or half-step Revolving Core. Even though it was just that minor bit, the difference from truly being at the Xiantian realm or Revolving Core realm was huge.\n Success or defeat, all would be bet on this!\n With teeth clenched, Lin Ming poured his true essence into the Demon God Bone. As true essence flowed into it, the Demon God Bone gradually softened. It turned into a squishy oblong sphere and then completely turned into liquid.\n This black liquid was like ink, but also carried a glassy sheen.\n Lin Ming flicked his finger and divided the black liquid in half. Half was swallowed by him, and the other half was placed in the center of his clavicles where the Gate of Healing resided.\n When the liquid black Demon God Bone first entered, it was icy cold. But as it entered into his belly, it turned into a blazing fire.\n The liquid black Demon God Bone that Lin Ming had placed between his clavicles also felt as if it had caught one fire. With a ‘chi chi’ sound, this black mercurial liquid quickly seeped into his body.\n It quickly permeated through his pores and deep into his clavicles where the Gate of Healing was.\n The Demon God Bone was originally a supremely tyrannical medicine. With Xing Tian’s strength, he simply wasn’t able to use it.\n Lin Ming’s strength naturally far surpassed Xing Tian’s at this moment. By reason, it shouldn’t be a problem for him to use it.\n However, what actually happened was beyond Lin Ming’s expectations. He was still under the Heavenly Demon force field, and every cell in his body was resisting this force field. It was impossible for his condition to be at its peak.\n While resisting the Heavenly Demon force field, the maddening power of the Demon God Bone manically flowed into his body!\n These two forces came from the same source. When the Demon God Bone’s energy merged into Lin Ming’s body, it actually fused together with the force field into one whole. Instantly, Lin Ming felt as if his throat was smoking and there was a demonic fire combusting within his body!\n Lin Ming’s cells were originally under a heavy pressure. Now, with the sudden increase in force, some of Lin Ming’s cells directly burst open!\n Puff!\n Lin Ming coughed up a mouthful of blood. This was blood that was coming from his body bursting apart at the seams!\n “Damnit!”\n To use the Demon God Bone to open the Eight Inner Hidden Gates was originally a sudden inspiration idea that Lin Ming had. But what would really happen after he swallowed the Demon God Bone was simply unpredictable.\n He never thought that the Demon God Bone would actually work so well together with the Heavenly Demon force field. Both of these stemmed from the Eternal Demon Abyss; there simply wasn’t any problem in them fusing together, creating a force that wildly rampaged through Lin Ming’s body.\n This was the same as Lin Ming’s body having to withstand double the energy pressure.\n Too hot!\n This was Lin Ming’s greatest thought. It was like his body had caught on fire. His meridians, dantian, organs, everything surged with a agonizing heat.\n It felt like magma was flowing through his body. Lin Ming wanted to use the ‘Chaotic Virtues Combat Meridians’ to forcefully suppress this feeling and absorb this manic energy, but he had already consumed over 50% of his true essence and now he was powerless to do any of this.\n Puff!\n A fog of blood burst out from Lin Ming’s arm. After his blood left the protection of his true essence, it was instantly scorched to ash. Lin Ming’s insides had become a stove.\n The energy grew hotter and hotter like a growing inferno. On the other hand, Lin Ming was quickly consuming true essence. Soon, everything would go completely out of control. When this happened, it was possibly that Lin Ming’s body would be completely burnt down by this berserk energy!\n Chi chi chi…\n That was the sound of the periphery of his meridians being burnt.\n “Too hot… too thirsty…”\n Clutching his throat, he felt like his clavicles had been incinerated. And this heat had already spread to his throat.\n With great effort, he fumbled around his spatial ring hoping to take out some water. But when he reached in, he actually touched something cold.\n This is…\n Lin Ming took out this object, and was startled to see it was a jade box. Around this jade box there was a faint chill in the air, and a layer of frost was condensing around it.\n Opening the jade box, there was a cocoon of electricity. And in this cocoon was the Nameless Divine Pill refined from the Nirvana Dragon Root!\n When Lin Ming had first attempted to open the Eight Inner Hidden Gates, he had melted a small part of this Nameless Divine Pill’s efficacy and swallowed it. He took what was left over and sealed it away in this jade box.\n The smaller Nameless Divine Pill was covered with a blue layer of ice cold frost. Even placed in the jade box one could feel an implicit terrifying ice cold energy. This ancient air that emitted from it seemed to have experienced tens of thousands of years, making one feel suffocated.\n Lin Ming could clearly recall that when he had placed this pill into the solar origin spring water, the spring water had directly turned into a lump of ice.\n An absolute cold. The piercing cold in that water seemed as if it could freeze his soul.\n When he approached it before, his muscles had begun to shiver, and when he touched it, his body was frozen and almost shattered!\n Extreme cold! Extreme heat!\n Two polar extremes!\n Lin Ming suddenly grit his teeth, raised the Nameless Divine Pill and prepared to swallow it!\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-590","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
