{"id":54553,"no":608,"title":"Chapter 607 - A Beautiful Spear","content":"Chapter 607 – A Beautiful Spear\\n\\n …\\n\\n …\\n\\n …\\n\\n As the half-dead black python flew out, Lin Ming’s eyes flashed with a brilliant killing intent. He flicked his fingers and over a hundred Blood Drinking Seals shot towards the grievously wounded black python like a locust swarm, intending to completely destroy it!\\n\\n The martial arena audience was completely shocked. Those several dozen martial artists that thought they would die under Lin Ming’s spear had turned silly with fear. In that instant, before they had enough time to realize what had just happened, High Lord Heian had arrived.\\n\\n Seeing his contract beast damaged to such a pitiful state, High Lord Heian’s eyes turned blood-red.\\n\\n “Die!”\\n\\n A sword broke through space, carrying with it all of High Lord Heian’s true essence as it thrust towards Lin Ming!\\n\\n This sword speed had reached the limit. At this time, because Lin Ming had attacked the Isolation Dragon, his back was open to High Lord Heian!\\n\\n High Lord Heian’s sword had already reached Lin Ming’s back. The sword energy tore apart Lin Ming’s bodily defensive true essence!\\n\\n Lin Ming’s lips curved up in a grin. With the power of space unsealed, true essence moved under his feet.\\n\\n Golden Roc Shattering the Void!\\n\\n Ca!\\n\\n High Lord Heian’s sword passed through Lin Ming’s back. However, Lin Ming’s figure disappeared, vanishing like a fading plume of smoke. That had been nothing but an afterimage!\\n\\n Meanwhile, a few hundred feet away in the air, the Isolation Dragon had been shredded to bits by the Blood Drinking Seals, its entire body dripping with blood. This time, the Isolation Dragon didn’t even have the strength to scream. It was already at death’s door!\\n\\n Seeing this black python pouring blood in midair, the surrounding martial artists were shocked speechless. Although none of them comprehended the Concept of Space, they could still see what had happened with their eyes.\\n\\n Lin Ming’s spear just now had stabbed into a space gap where the Isolation Dragon was hiding, thus shattering the lock of sealed space.\\n\\n “Too strong! In such a fierce battle, Lin Ming can even branch out his perception to find the black python’s hiding place!”\\n\\n “Perception? Don’t be stupid. The black python had sealed itself into a space gap. That is a completely different level of space that is cut off from all perception. How could one possibly sense it?”\\n\\n “Then how did he find the black python?”\\n\\n “How the hell would I know? If I knew the way to do it then I would also comprehend the Concept of Space.” The martial artist who just spoke curled his lips in disdain, not bothering to say anything else.\\n\\n The space gap was truly able to isolate all perception. Even Lin Ming was no exception. However, Lin Ming had sensed the fluctuations in the power of space and found a point where it seemed out of tune with everywhere else. If the power of space was compared to waves, then the position where the black python hid had produced small ripples. These ripples had exposed the black python’s position.\\n\\n Lin Ming was highly sensitive to the power of space. Once he captured the exact location, he had infused his spear with the Concept of Space. With his spear piercing the void, it then pushed the black python out of its space gap.\\n\\n If Lin Ming hadn’t entered the King’s Cage, then his comprehension of the Concept of Space would never have reached this degree.\\n\\n Xiu!\\n\\n High Lord Heian put out his hand, turning the dying black python into a stream of black light that submerged into his body.\\n\\n As he inspected the black python’s condition, High Lord Heian’s face sank.\\n\\n The black python was ruined. Flesh wounds weren’t anything, and damage to meridians and organs could be cured. But, the core of the black python had been crushed. This basically meant that the black python no longer held any value. Once the core was shattered, it would never be able to grow again.\\n\\n Lin Ming’s guess was correct. This black python was truly an ancient beast brought out from the Eternal Demon Abyss by High Lord Heian, containing an inborn ability to use the Law of Space. However, it had grown for less than ten years and its strength was limited. This was the first time that High Lord Heian had actually brought it out for battle, but he never imagined that Lin Ming would be able to attack the Isolation Dragon in its hiding spot, ruining it for forever.\\n\\n The Isolation Dragon was an extremely rare contract vicious beast. Its combat strength wasn’t too great, but its supportive abilities were wonderful. High Lord Heian had carefully raised it for ten years and had invested a massive amount of resources into it, but as soon as it appeared it had been ruined. High Lord Heian felt his heart dripping blood. His eyes burned with a blazing killing intent!\\n\\n “Lin Ming! I will kill you!”\\n\\n “Word are useless. If you have any other moves then bring them out, I’m waiting right here.” Facing High Lord Heian’s killing intent, Lin Ming simply wasn’t affected at all.\\n\\n In fact, he hadn’t even completely used the power of the Gate of Healing. Since this was the first time using the Eight Inner Hidden Gates in actual combat, his body was still adapting to it.\\n\\n And most importantly, Lin Ming now realized that even if he erupted his complete power, he still wouldn’t be able to kill High Lord Heian. At most, he would be able to just barely beat him. But, if he wanted to kill him, then he would need to create an opportunity to do so.\\n\\n …....\\n\\n Woosh!\\n\\n High Lord Heian’s figure instantly vanished, appearing right beside Lin Ming. “Don’t think that only you are fast! I too am confident in my speed! I will end this fight soon. Since you want to compare speed, then come at me!”\\n\\n Ca!\\n\\n High Lord Heian’s sword pierced forth.\\n\\n Lin Ming’s figure was like a puff of smoke as he vanished once more. Spear light wove into a net that fell over High Lord Heian!\\n\\n “You want to fight a battle of attrition? Then let’s see who consumes all their energy first!” High Lord Heian grinned like a madman. He thrust out the Crimson Ruby Snake Sword in his hand, tearing apart the spear light.\\n\\n Demon essence and true essence fiercely collided. The ruined arena stage underneath their feet had already ceased to exist.\\n\\n Bang bang bang!\\n\\n The two engaged in a battle of speed. Whether it was attack moves, dodging, or even head on melee confrontations, everything they did raised great waves of surging true essence, forcing all of the martial artists in the stands to retreat once more!\\n\\n “This is amazing! He’s fighting equally with High Lord Heian!”\\n\\n “If this battle continues… I fear that Lin Ming won’t be able to last much longer. His cultivation is too low, and he has already consumed a great deal of true essence before this.”\\n\\n In the view of these people, the degree to which Lin Ming’s true essence had thickened had far surpassed all other martial artists at his level. But, it was still a bit lacking compared to High Lord Heian. The reason that Lin Ming could fight evenly with High Lord Heian was all due to his comprehension of Concepts, his sharp and amazing moves, and the strange cultivation methods he used.\\n\\n If this battle was drawn out until the end, then Lin Ming must lose!\\n\\n In nearly every aspect of one’s combat prowess, Lin Ming was in no way inferior to High Lord Heian. It was just that his cultivation and total amount of true essence was lower. Even so, Lin Ming’s strength was hard to measure with common sense.\\n\\n “If Lin Ming had another year, or even half a year, he would probably be able to defeat High Lord Heian!” A martial artist sighed with emotion. Lin Ming’s rise was unstoppable.\\n\\n On the arena stage, High Lord Heian and Lin Ming had already fought for an entire half incense stick of time, exchanging almost a hundred moves!\\n\\n “Demonic Windstorm!”\\n\\n High Lord Heian calculated where Lin Ming would land. He thrust out his sword and demon essence rolled up into a billowing red cloud.\\n\\n “Blood Seal Twisting Murder!”\\n\\n The moves that Lin Ming used to strike back came from the ‘Great Desolate Halberd Art’. If this style was combined with the Blood Drinking Seals, then that would save the greatest amount of true essence. The Concept of Thunderfire simply used too much energy.\\n\\n Lin Ming’s total amount of true essence was truly inferior to High Lord Heian’s. But, by depending on the Gate of Healing, his endurance far surpassed High Lord Heian’s!\\n\\n But lasting to the final moment was not what Lin Ming wanted. What he wanted was to… make a killing strike!\\n\\n By conserving the greatest amount of true essence that he could, that combined with the terrifying regenerative abilities of the Gate of Healing allowed him to maintain his peak condition.\\n\\n Boom!\\n\\n Spear and sword intersected, true essence exploding. Lin Ming’s body flew backwards, blood dribbling down the sides of his mouth. But High Lord Heian wasn’t any better off. After Lin Ming’s spear light broke through his sword light, a leftover wisp had pierced his chest, breaking past his bodily protective true essence and causing an arrow of blood to shoot out.\\n\\n The battle of these two had already reached a catastrophic degree.\\n\\n Lin Ming had been wounded several times, both heavily and lightly. But Lin Ming didn’t care about injuries, what he desired was making sure that High Lord Heian was also injured in the process.\\n\\n At this time, some people gradually felt that something was wrong. Although Lin Ming’s total amount of true essence was obviously lower than High Lord Heian’s, for some unknown reason, he was always able to maintain his extreme speed and the power behind his moves!\\n\\n In comparison, High Lord Heian had weakened somewhat.\\n\\n “Heavens! There have already been over 200 moves. Although these are small moves, how can he withstand such consumption of energy!? Is he a puppet or something?”\\n\\n “Don’t forget that before this he also fought in three continuous battles, successively defeating Kai Yang, Maha, and Yan Chi, yet now he can still fight High Lord Heian to this degree!”\\n\\n “High Lord Heian’s breath is already weakening! What is going on? Is Lin Ming really a Xiantian realm martial artist!?”\\n\\n The martial artists in the audience discovered this rapidly changing situation and found it incomprehensible.\\n\\n High Lord Heian also discovered this. He no longer attacked Lin Ming. After another sword strike, he retreated several hundred feet back and stood there.\\n\\n “You…” High Lord Heian’s expression was dismal. He had already consumed almost half his demon essence, but Lin Ming hadn’t used as much. In fact, his bodily true essence was still extremely thick like it was before!\\n\\n How could it be like this? What sort of freak was this boy? Was his true essence regenerative ability really that strong?\\n\\n ‘I can’t drag this on anymore. I have to finish this fight as soon as possible. Otherwise, if this continues then I will lose!’\\n\\n Losing to a mere 20-some year old human boy. High Lord Heian never imagined this day would ever come.\\n\\n “Lin Ming. I never thought that you could force me to this step. I don’t know what sort of strong cultivation method you’ve practiced to have this degree of endurance, but I will not give you any more chances to consume my strength!”\\n\\n As High Lord Heian finished speaking he gave a loud shout. He bit down on his tongue and spat out blood essence onto the blade of his sword. The curved crimson snake sword became an even more beautiful red. Soon after, High Lord Heian’s face flashed with an abnormal blush. In order to use this strongest strike of his, he had obviously overdrawn his strength.\\n\\n “Bloodstained Blue Skies!”\\n\\n A sword thrust forth, the void trembled! The entire arena seemed to be dyed red with blood, everyone’s vision filling with a dazzling scarlet light. This was an extremely oppressive feeling. It was like they had fallen into a bloody pond in the pits of hell, and now they faced a strike from a death god!\\n\\n Just looking at this sword made one hallucinate that their heart had been chopped in half.\\n\\n ‘Final strike? What a pity!’\\n\\n Lin Ming drearily sighed in his mind. He had wanted to slowly consume High Lord Heian’s strength to its lowest point while maintaining his own strength at around 90%. Then, at that final moment, he could flare out with all the power of the Eight Inner Hidden Gates and kill High Lord Heian in a single stroke.\\n\\n But presently, High Lord Heian no longer gave him that chance. It was time to advance to the final battle!\\n\\n “Heavenly Demon force field – completely open!”\\n\\n A stormy energy field surged out from Lin Ming’s body. Although Lin Ming had used the Heavenly Demon force field at the very start of the battle, that was when he hadn’t yet opened the Eight Inner Hidden Gates, only using regular true essence to drive it, otherwise it would have consumed too much true essence. But now that Lin Ming was in his peak condition, he erupted with the strongest possible Heavenly Demon force field!\\n\\n A vast pressure gushed out in all directions. With a snapping sound, the ground underneath Lin Ming’s feet began to completely crack open from this pressure. The broken fragments of profound gold flooring flew up into the air, and a massive crack spread out like a growing spider web!\\n\\n As far as a 1000 feet away, the audience instantly felt a pressure that was several times more terrifying than before. Those with weaker cultivations vomited blood, and even those with higher cultivations paled!\\n\\n How was this possible?\\n\\n The fight had reached this degree, but Lin Ming was still able to erupt with such an aura?\\n\\n This people completely didn’t understand the Heavenly Demon force field. They only thought that this was the imposing aura that came from Lin Ming.\\n\\n “Thunder and fire, fuse for me… Penetrating Rainbow!”\\n\\n The power of the Eight Inner Hidden Gates was revolved to the limit. Between his eyebrows, the blood of the Ancient Phoenix combusted. Lin Ming’s strength instantly doubled!\\n\\n The Thunder Soul and Flame Essence within him began to violently tremble. The power of thunder and fire burst out like a volcanic eruption!\\n\\n Above the Purple Comet Spear, thunder and fire struggled together. Thick arcs of lightning recklessly danced on the spear, mixing with the surging inferno of flames, burning down the void.\\n\\n Lin Ming took a step forwards, his spear pointed straight towards High Lord Heian. Spear and man became one, and the horrifying sound of thunderfire reverberated in the air. Lin Ming became a flaming meteor wrapped with thunder as he shot forth!\\n\\n “What!?!?”\\n\\n High Lord Heian was impossibly shocked. He had never, ever imagined that Lin Ming could produce such a terrifying combat strength at such a moment. As that aura suddenly burst out and enveloped him, his demon essence that had been like a raging river had suddenly reduced by 20%!\\n\\n ‘This boy! He’s always been hiding this! He wanted to save this for the final strike, he doesn’t want to just defeat me, he wants to kill me!’\\n\\n As High Lord Heian suddenly realized this, his eyes flashed with the light of lunacy!\\n\\n This was the final move! If this failed then he would die. Everything was bet on this last desperate attack!\\n\\n High Lord Heian revolved his demon essence to the limit and spat out more blood essence. The Crimson Ruby Snake Sword in his hand combusted with a flaming light, the sword sending out excited cries.\\n\\n As the sword light and spear light struck each other, it was like a meteor smashing into another meteor!\\n\\n “This isn’t good!”\\n\\n After seeing this collision, the martial artists that had already retreated to 1000 feet didn’t say anything further, only launching their movement techniques to escape as far as possible!\\n\\n Bang!\\n\\n In that instant, a glaring flash burst out, forcing everyone in the entire martial arena to blink as if they were blinded. True essence violently swept up into swirling storms, melting every chair in the first several rows and sending chairs flying away like molten arrows. Luckily, several of the stronger martial artists suddenly took action, using their treasures and skills to send these metal chairs flying back. However, the impact of these chairs still caused their arms to shake with numbness.\\n\\n What a terrifying strength!\\n\\n The flash only lasted for a single breath of time before disappearing. The entire arena stage was completely razed to the ground, and not even a single piece of profound gold flooring was left behind.\\n\\n Lin Ming and High Lord Heian staggered opposite of each other.\\n\\n Lin Ming knelt on the ground, using the Purple Comet Spear to support himself. His entire body was dyed crimson with blood, and on his right shoulder was a ghastly wound. His right shoulder had nearly been split apart and his clavicle was broken.\\n\\n But behind Lin Ming, High Lord Heian was blankly standing there. The left half of his body had… completely disappeared!\\n\\n Left lung, heart, left arm… in that desperate collision with Lin Ming, all of it had been disintegrated to ashes by the crazy and violent power of thunder and fire.\\n\\n All of the present martial artists were beyond shocked. They stood there, disbelief in their eyes as they looked at High Lord Heian on the remains of the arena stage. The left half of his body had completely vanished, and one could see that the organs of his right half had been charred black.\\n\\n High Lord Heian… died?\\n\\n With unfathomable strength, that overweeningly arrogant High Lord of Skysplit Tower who seemed all-powerful had actually died…\\n\\n Died under the hands of Lin Ming, a mere human boy…\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-607","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
