{"id":54572,"no":627,"title":"Chapter 626 - The Door In Space","content":"Chapter 626 – The Door In Space … … … ‘These High Lords’ middle ten-winged Heavenly Demon Tattoos were originally condensed within the Eternal Demon Abyss… but I remember that the Polaris Tower Master already has a peak ten-winged Heavenly Demon Tattoo. How come that old man hasn’t dispersed his infernal energy yet?’ Lin Ming could faintly feel that the Polaris Tower Master’s identity wasn’t so simple. As Lin Ming was thinking about the Polaris Tower Master, the Polaris Tower Master’s voice suddenly sounded in his mind, “This time entering the Eternal Demon Abyss, you will go into the 1200 mile periphery to seek lucky chances for me. Understood?” ‘Go into the 1200 mile area to seek lucky chances for you?’ This was a land where the chances of dying were extremely high. After entering, he would also have to risk his life and desperately battle with others, and this fellow wanted Lin Ming to struggle for him? Lin Ming sneered. He began to agree, “I understand, but… in the range of 1200 miles there are many dangers abound. I wonder whether Tower Master has a jade slip map or something similar so that I don’t enter a danger zone by mistake.” Hearing Lin Ming ask this, the Polaris Tower Master hesitated. The 12 Skysplit Towers had many maps about the Eternal Demon Abyss, but the truth was that the vast majority of these maps had problems and omissions. After all, every time the Eternal Demon Abyss erupted, there would be great changes concerning the locations and kind of danger zones that there were. However, the Polaris Tower Master had a relatively accurate map. This map was created through many years and the sacrifice of countless lives who had explored the area; it was extremely valuable. The reason that the Polaris Tower Master could obtain this map was all because his father was the ruler of the Blood Slaughter Steppes as well as the only twelve-winged Heavenly Demon. There were only a few copies of this map. He hadn’t intended on giving it to Lin Ming because he feared that Lin Ming would die within the Eternal Demon Abyss and the map would be revealed to others. If those Holy Land descendants were to obtain this map then it would be much easier for them to find and obtain resources from the Eternal Demon Abyss in the future. This was certainly a scenario that the Polaris Tower Master didn’t wish to see. After a brief hesitation, the Polaris Tower Master said, “Lin Ming, I truly have one copy of such a map, but, you cannot ever reveal this map. If you meet a fatal danger within the Eternal Demon Abyss and are close to death, you must first destroy this map. Am I clear?” “I am clear.” Lin Ming expressionlessly said. This Polaris Tower Master relied on the slave seal he thought he had planted within Lin Ming and didn’t even try to dress up his words. He directly told him to destroy the map before he died. The Polaris Tower Master touched his hand atop Lin Ming’s palm and with a gentle wipe, inserting a jade slip into Lin Ming’s spatial ring. With a quick sweep with his sense, Lin Ming determined that this truly was a map of the Eternal Demon Abyss. “If you are prepared, then I shall open the array formation. Everyone is limited to six months within the Eternal Demon Abyss. If you do not emerge after six months, then you will have to stay in the Eternal Demon Abyss until the next time the array formation opens. But… since ancient times, if a martial artist did not come out before six months, they would completely vanish with no one ever knowing where they went. In this half year, everyone please keep this in mind. As the old man finished speaking, he took out three black glass beads from his spatial ring and began to arrange them on the floor. Lin Ming discovered that not too far from the open area he was standing in, there were small grooves in the floor that these black glass beads were inserted into, perfectly matching them. Lin Ming was very familiar with these black glass beads – they were Demon God Bones. After the three Demon God Bones were inserted into the floor, the earth suddenly began to shake. Not too far away, the space in front of everyone began to distort. A moment later, space itself seemed to melt away as a spatial door suddenly opened within the void. Behind this spatial gate was a grey space. This strange world was filled with a endless mist. In the next instant, Lin Ming felt like an esoteric gate opened wide in front of him. A boundless, ancient, and pure death energy surged out from this space, extremely shocking and oppressive to the heart. “So it’s this place… I, I’ve come here before.” Demonshine’s voice sounded out in Lin Ming’s mind. “Oh? You’ve come here before?” Lin Ming was startled but immediately calmed down. The Demon Emperor had been through the Road of Emperor, so it wasn’t strange if he had gone to the Eternal Demon Abyss too. “Do you remember any dangerous zones inside?” “I remember a little, but not too much. It was my big brother who followed master here. According to my big brother’s memories, master stayed here for 20 some years…” “Twenty some years?” Lin Ming was stunned. “Wasn’t it said that those that don’t come out in half a year never emerge again? How could the Demon Emperor actually stay here for 20 some years?” Demonshine chortled and then shook his doggy head, saying, “In the past, master was a twelve-winged Heavenly Demon. He had already broken through the Emperor boundary several hundred years before. After experiencing a deep and painful bottleneck, he only then returned to the Eternal Demon Abyss, exploring this land for 20 some years. Naturally, he’s not someone you juniors can compare with. The so-called 1000 mile absolute death danger zone around the Eternal Demon Abyss is only applicable to you juniors.” “He broke through the Emperor boundary before returning to the Eternal Demon Abyss…” Lin Ming suddenly became aware. Normally speaking, after the change to the Blood Slaughter Steppes, there were very few Emperor level powerhouses that came to the Eternal Demon Abyss. This was because only twelve-winged Heavenly Demon Emperor level powerhouses could step into the Blood Slaughter Steppes without dying to the strange curse that permeated the land. Thus, in the vast majority of situations, those martial artists that entered the Eternal Demon Abyss were extraordinary young elites. As for the Six-fingered Sin Fey, Demon Emperor, and other such Supreme Elders, they became twelve-winged Heavenly Demons in the Skysplit Towers before returning to the Eternal Demon Abyss as Emperor level powerhouses. With their strength, as long as they didn’t directly enter the Eternal Demon Abyss, they could still explore along the edges of the Eternal Demon Abyss with relative ease. After the spatial gate fully opened, the old man responsible for opening the Eternal Demon Abyss said, “Now we shall begin dividing the teams. Every Skysplit Tower will send one or two people to form a 10 man squad. A supervisory deacon from the Blood Slaughter Divine Temple will lead that group 1500 miles from the edge of the Eternal Demon Abyss. Afterwards, the supervisory deacon will return on the route he came from. At that point, whether you wish to return or continue forwards will all be up to you. First, it will be my squad. Who will go with me?” As the old man spoke, Lin Ming was startled for a moment. Using a squad as a forward unit? If every Skysplit Tower sent out one or two people, then they would be able to mutually supervise each other. Then, at least at the very beginning, the killings wouldn’t start. And with a supervisory deacon at the start, that also stopped some martial artists from trying to secretly become a twelve-winged Heavenly Demon. The six Skysplit Towers each sent out one or two people, quickly forming a squad of 10. With a word from the old man, everyone set off. They walked through the illusory spatial gate, their forms vanishing into the endless gray fog. “Lin Ming, you and Bloodfire will go with that Imp supervisory deacon. He is the most experienced here and can guarantee your safety the most to the 1500 mile range. Afterwards, you will begin to move alone.” The Polaris Tower Master’s true essence sound transmission sounded in Lin Ming’s ear. “Understood.” Lin Ming responded, glancing at the short old Imp among the supervisory deacons. The Imp looked old to begin with. Lin Ming didn’t know how old this fellow was, but he could see that the dark black skin on his face was all scrunched up together; he looked like an old mortal man who had experienced great hardships and suffering in his life. Quickly, the old Imp walked out in front of everyone and said, “I am Sada, Who would like to go with me?” From Polaris Tower, Lin Ming and High Lord Bloodfire both stepped out. Obviously, High Lord Bloodfire had also received the Polaris Tower Master’s orders. “There are still seven spots. Who would like to come from the other Skysplit Towers?” “Hehe, count me in.” From the Heavenly Cloud Tower, High Lord Black Ash stepped forwards, grinning as he looked at Lin Ming. Lin Ming remembered this fellow. When he arrived, this fellow was eagerly looking at him, not even masking the killing intent in his eyes. Against this sort of self-important loser, Lin Ming was disinclined to even look at him. “There are still six spots.” Sada called out again. “Me.” With the crisp voice of a woman, Lan Xin from the Blue Silver Holy Land stepped out. As Lan Xin stepped out, several young Fey men from White Stone Tower and Five Color Tower were instantly excited. They scrambled forwards to join the team, and Sada’s squad was instantly full. In fact, there was even one more. Lin Ming was left speechless. At this time, there were still some people that had the state of mind to chase after girls? This was just too ridiculous! But as he thought more carefully about it, Lan Xin originated from a Holy Land, and an upper ranked Holy Land at that. Her background even surpassed that of Feng Shen. To other Fey martial artists, if they could ever obtain Lan Xin’s heart and marry her, then who cared about love? Resources were much more important! Moreover, all these martial artists that pursued Lan Xin were originally Emperor level talents. Besides their relatively normal backgrounds, they were matched with Lan Xin in other aspects; they all held out on some hope. Although they were far from comparable with Duanmu Qun, Duanmu Qun was an even more outstanding character than Lan Xin, thus it was impossible for him to marry and join his wife’s sect, the Blue Silver Holy Lands. Only Lan Xin could marry and join him, but, this was the same as the Blue Silver Holy Lands letting a future Emperor Level Powerhouse slip out of their grasp. Naturally, the Blue Silver Holy Lands would not allow this to happen. On the other hand, if Lan Xin chose one of her pursuers, then it was likely that the Blue Silver Holy Land would gain another Emperor level powerhouse in the future. Between the two choices, the better one was clear at a glance. The young outstanding Fey of Skysplit Tower had all calculated this point, thus they all tried to woo Lan Xin so that they would have to struggle for a few hundred years less. Lin Ming quickly realized the reason behind all this. In fact, this scene could be described as quite reasonable. “There’s one too many!” Sada said, frowning. “Hey, this brother, could you help me out here and…” The slowest Fey martial artist to scramble out gave Lin Ming a friendly smile, hoping that Lin Ming could drop out and give him his spot. Lin Ming thought this was funny. He had never met this fellow, so on what basis would he give up his spot to him? “You talk too much!” Sada grew a bit angry. He pointed at the Fey youth and said, “According to order, you will step out!” The words were like a cold bucket of water directly poured over the flames of the Fey youth’s hope, extinguishing them. The Fey youth felt wronged, but he didn’t speak out. Lin Ming could see that four or five of these Fey youth were Heavenly Demon Seven Stars and not High Lords. Some of them might even have pledged themselves to the High Lords and become their dogs. After all, their talent was decent and they were young; all of them were generally below 30 years of age. ‘In terms of strength and experience, these people are far inferior to the High Lords. If I’m in the same squad as these fellows, it’s actually much better than being in a squad with High Lords…’ Lin Ming thought as he traced his chin. Actually, it seemed that he needed to thank Lan Xin. “Let’s go!” Sada brought everyone and stepped into the spatial gate. Lin Ming followed, and his form quickly disappeared into the hazy dark fog. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-626","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
