{"id":54582,"no":637,"title":"Chapter 636 - Battle Spirit Protection","content":"Chapter 636 – Battle Spirit Protection\n …\n …\n …\n The condensing of Lin Ming’s Revolving Core had galvanized a mighty phenomenon. The surrounding true essence was stirred into a massive vortex of heaven and earth origin energy, forming massive purple clouds of energy several dozen miles wide. For such a sight to appear within the Eternal Demon Abyss, the results could be imagined.\n Within Lin Ming’s spiritual sea, Demonshine could only helplessly watch as more and more evil spirits gathered, crying and groaning over the situation. Now, he finally understood what it was like to be surrounded by wolves.\n But, there was still a silver lining to this horrible situation. These evil spirits were all of the low-level variety. They weren’t those freakish existences that were shot out from deep within the Eternal Demon Abyss.\n Demonshine didn’t have a physical form and his real world striking strength was weak. He could only release his soul force to form an energy field, using this to deter these evil spirits.\n Demonshine’s energy field was truly powerful. It brought with it a vast and ancient atmosphere that could only come from someone from the Realm of the Gods. However, the temptation of Lin Ming’s bubbling blood vitality was too great. These evil spirits incomparably desired this blood essence. Under the direction of their most primal nature, these evil spirits slowly approached Demonshine.\n Demonshine could scare off three or five, but not a group. After these evil spirits gathered\n together, they launched an attack on Lin Ming!\n And at this time, Lin Ming had both his eyes closed, his senses completely cut off from the outside world. He had entered into a deep meditative state; it was unknown just how long this would continue for.\n “Ohh!”\n The first evil spirit plunged towards Lin Ming. With one at the lead, another evil spirit rushed in. Demonshine concentrated and a brilliant light flashed out from his eyes…\n Mind control!\n An evil spirit suddenly shook, and its savage crimson eyes suddenly became dazed and empty. In midair, it suddenly twisted around and shot toward the second evil spirit. Without time to respond, the second evil spirit was smashed into the ground, injured.\n Soon, these two evil spirits began to engage in a brutal melee on the ground. A moment later, the evil spirit that was controlled by Demonshine ripped the other one to shreds.\n “Just using mind control once already consumes so much of my soul force; I absolutely can’t last too long. Lin Ming, oh good brother Lin Ming, please wake up now!”\n Demonshine was nervous. This was truly a dragon being played around with by shrimp. To think that there would be a day where he, a noble and awesome Hollowed Lord from the Realm of the Gods, would actually be bullied around by such a group of piddling low-level evil spirits!\n After destroying an evil spirit, three or four immediately replaced it. Seeing this, Demonshine felt bitterness swell in his heart.\n “OhhhHH!”\n Two more evil spirits rushed forth. These two evil spirits were stronger than the last two. Demonshine grit his teeth and consumed 20% of his willpower to control these two evil spirits.\n “Ahhhhhhhh!”\n More and more evil spirits threw themselves forwards. Taking control of three evil spirits, Demonshine waged a vicious war with them. However, it was difficult to face so many with so few and Demonshine’s current ability was limited. Two evil spirits dodged around Demonshine and ran towards Lin Ming, biting onto his bodily true essence protection.\n Before Lin Ming had entered into meditation, he had arranged an energy defense within his body. As an evil spirit rushed at him, an arc of purple thunder erupted from his body. This thunder was composed of the Disenchanting Dream Light and the Purple Flood Dragon Divine Thunder. The Disenchanting Dream Light could overturn the soul and mind, and the Purple Flood Dragon Divine Thunder was especially useful in subduing ghosts and demons.\n These evil spirits gave miserable shouts and were bounced off!\n However, there were far too many evil spirits. As one was sent flying away, another one took its place.\n As Lin Ming’s body sparkled with the light of thunder, some evil spirits were burnt into gray smoke by the power of thunder. But, this pain only aroused the bloodthirsty and vicious nature of these evil spirits. All of the evil spirits crazily rushed towards Lin Ming. Demonshine’s capacity to block them all was limited!\n The energy of the protective layer of thunder was rapidly consumed. A moment later, it could not avert any more evil spirits.\n A massive number of evil spirits hung off Lin Ming’s body. It was like a pack of wolves that had bitten and clawed onto a giant beast.\n Within Lin Ming’s spiritual sea, Demonshine was panicking.\n “F*ck! Boy, consider that I must have owed you in some past life! Remember this!”\n It wasn’t that Demonshine couldn’t fight with his full force, it was just that this soul was damaged. Once he did something, his soul would be injured. Back when Lin Ming was travelling through the ancient transmission array and was suffering through the space storms, there had been a time where he had completely exhausted all of his energy. It was only with Demonshine’s help that Lin Ming had been able to barely pass that crisis.\n However, the price of this was that Demonshine had fallen into a deep slumber for nearly two whole years.\n Now, Demonshine had finally woken up after much hardship. If it wasn’t for the nourishment of the infernal energy as well as the Blood Demon Bone, Demonshine absolutely wouldn’t be willing to expend his full strength to help, injuring his soul even further. But, he had no choice now. Once Lin Ming died, he would have to follow him into death!\n From Demonshine’s body, a small portion of his divine soul began to burn. Massive rays of light suddenly shout out from all over Lin Ming’s spiritual sea! These golden lights were like sharp swords, instantly piercing through over a dozen evil spirits and burning them into smoke!\n This was Demonshine’s materialized divine soul attack.\n This sort of divine soul attack was a double edged soul. To use the soul to struggle, damaging oneself to kill the enemy. Especially in a situation where the defense in soul force wasn’t that great, the damage incurred would be higher. This was why the Imps who excelled at soul attacks always brought soul recovery medicines with them.\n Demonshine’s soul was originally incomplete to begin with. After using such a soul attack, the damage to his own soul could be imagined.\n After killing over a dozen evil spirits at once, the damage to Demonshine’s soul was not minor. Fortunately, he had recovered a great deal of his strength these past two years, otherwise using an attack that consumed so much soul force would have caused him to fall unconscious again.\n And as Demonshine was groaning in his heart, not sure of what to do, he suddenly noticed that not too far away, there were two Giant Demons and a Goliath martial artists staring at Lin Ming, an eerie expression on their faces.\n In that instant, Demonshine’s heart fell to subzero temperatures!\n Of these three people, Demonshine had some knowledge of two of them. They were High Lords from the other Skysplit Towers!\n One wave hadn’t ended and another one came! Demonshine wasn’t naïve enough to believe that these people had come to lend a helping hand!\n In fact, these three High Lords might be thinking that this was their lucky chance!\n “Isn’t that Lin Ming?” After the Goliath High Lord carefully led the other two to the center of the twisting python terrain, he didn’t find any lucky chance. Instead, he found that someone was making a breakthrough here!\n “That really is Lin Ming. He’s breaking through to Revolving Core? Is he crazy?”\n “This stupid idiot. He actually tried to make a breakthrough here and brought a group of low-level evil spirits to surround him! This is just looking to die!” A Giant Demon High Lord sneered. In his opinion, this was no different than suicide!\n “Maybe Lin Ming came across some lucky chance and couldn’t suppress his true essence, leaving him with no choice but to make a breakthrough here. I remember before that his cultivation was still a great distance from Revolving Core; he should still have had half a year at least before having any chance of making a breakthrough. If he didn’t come across some lucky chance then this would be completely impossible!” The Goliath High Lord’s eyes flashed with naked desire. A lucky chance that could allow a martial artist to make a breakthrough… this was exactly his greatest wish!\n “He doesn’t have anyone with him, he’s alone. Something must be strange. And not just that, but the momentum from his breakthrough is so abnormally great. If an average person were to break through to Revolving Core, there definitely wouldn’t be such a scene.”\n “There’s definitely something wrong!”\n The three High Lords instantly agreed that Lin Ming must have come across some great lucky chance within the Eternal Demon Abyss, thus the reason for such a massive momentum when breaking through. As for Lin Ming’s squad, they had probably died or scattered away, thus this lucky chance had fallen completely into Lin Ming’s hands alone.\n This sort of thing, just whose eyes wouldn’t turn red with greed?\n These three people looked at each other, each seeing a thick killing intent in the other.\n If they killed Lin Ming, there was an extremely high probability they would be able to obtain his lucky chance!\n Let alone that Lin Ming was in his most critical moment in his breakthrough to Revolving Core, but even if Lin Ming had made a breakthrough his strength wouldn’t be stable for a short period after that. Also, these three people were all masters among the High Lords. They had complete confidence in their own individual strength. As for Lin Ming’s strength, they only had heard limited rumors about it.\n “Kill him! No mercy!” The Goliath High Lord said.\n Now Lin Ming was surrounded by evil spirits; it would have been better for them to wait until their battle was done so they could swoop in afterwards. But, Lin Ming’s breakthrough had reached the crescendo. Who knew when Lin Ming would make a breakthrough to Revolving Core? It was best to take action earlier lest there be even more problems later!\n These three people all revolved their demon essence and rushed out together. One of the Giant Demon martial artists took out a long saber and slashed down at Lin Ming’s chest!\n Kacha!\n The saber directly killed four or five evil spirits and completely broke through Lin Ming’s protective true essence!\n The evil spirits grew enraged by these actions and rushed at the three High Lords!\n “Out of my way!”\n The Goliath High Lord gave a loud shout and swept out the massive staff in his hands, directly sweeping out all these low-level evil spirits. Three of the evil spirits bore the brunt of the attack and were directly twisted into pieces by the energy storm, vanishing into blue smoke!\n “I’ll send you along the way!”\n The last Giant Demon loudly laughed. Grasping a hammer, he slammed it down towards Lin Ming’s chest!\n Seeing this massive hammer come down, Demonshine’s pupils shrank. This time, he had consumed too much of his soul force; he was unable to mount a defense against these three High Lord’s attacks.\n Lin Ming’s bodily true essence protection was broken, how could his mortal body defend against these attacks…\n Would he die like this?\n As this thought flashed through Demonshine’s mind, all he heard was a muffled thump as Lin Ming was smashed by the hammer and sent flying backwards!\n The true essence funnel twisted. Lin Ming’s body fell hundreds of feet away, his fate unknown.\n “Haha! What kind of so-called ten thousand year number one talent is this! What a load of crap! He still dies at this father’s hand!” A Giant Demon martial artist who had attacked laughed impudently. After being hit by his hammer, anyone’s ribs who would all be broken apart, their organs smashed to bits!\n To kill a Titled Asura, the Giant Demon High Lord only felt that his thoughts were incomparably smooth as he was filled with a great sense of accomplishment.\n However, after a few more loud laughs, his laughter began to die down. He looked at the sight in front of him with disbelief. Even the two other High Lords were shocked.\n A few hundred feet away, Lin Ming’s breath was steady. He simply didn’t seem like someone that\n had been heavily wounded.\n ……………..\n Sweeping out with his divine sense, he saw that the clothes and flexible armor on Lin Ming’s chest had been completely smashed apart. As for his body, there was only some broken skin and flesh; the ribs were completely fine and intact!\n “This… how is this possible?”\n The Giant Demon martial artist’s eyes widened as he gripped his hammer. To be hit by his hammer, even a block of profound gold would be smashed flat. But, Lin Ming had only been slightly injured?\n Was this a human body? It was even more resilient than profound gold?\n At this time, within Lin Ming’s spiritual sea, even Demonshine was incomparably amazed. He had also been wallowing in dashed hopes. If it was just one person, they he could seize their body. With his soul force, stealing the body of a High Lord was in fact easy.\n But, the problem was that there were three people. If he stole one of their bodies and was killed by the other two, then his divine soul would shatter. Thus, seizing a body was the same as suicide to Demonshine.\n In his despair, he never imagined that Lin Ming would actually be able to withstand this attack.\n This wasn’t just the bodily defensive power that came from Tempering Marrow; that Giant Demon High Lord’s striking power was not a joke.\n This was… could it be… battle spirit protection?\n A light went off in Demonshine’s mind and he was instantly stunned.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-636","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
