{"id":54623,"no":678,"title":"Chapter 676 - Revolving Core Mu Bingyun","content":"Chapter 676 – Revolving Core Mu Bingyun\n …\n …\n …\n “Sovereign Xuan, to deal with just a mere Lin Ming, not only will you yourself go, but you must also send out the Giant Leviathan? Isn’t that just making a big deal out of nothing?”\n An Elder couldn’t help but suggest.\n The Giant Leviathan was the super weapon of the South Sea Demon Region.\n Within the Sky Spill Continent, there was a wide range and variety of Saint Beasts and there was no uniform classification; it was all a fuzzy and jumbled mess. A Flood Dragon, a Vermillion Bird – these creatures could be called Saint Beasts, but all of these Saint Beasts had differing degrees of bloodline purity and richness.\n These were divisions formed by limited vision. To the martial artists of the Sky Fortune Kingdom and even the Seven Profound Valleys, to them a Vermillion Bird was an unattainable sacred existence. Thus, being labeled a Saint Beast was undeniable.\n However, within the Realm of the Gods, the Vermillion Bird of Divine Phoenix Island was barely passable to be called a Saint Beast at all. As for the God Beasts of the Realm of the Gods, those were existences that could destroy worlds at whim.\n The title of a Saint Beast was a bit ambiguous; it wasn’t a completely appropriate term to describe the Giant Leviathan. The Giant Leviathan was in many ways even more powerful than a high stage Life Destruction powerhouse.\n Especially when it was used for frontal combat or for capturing a sect, the power it could display was simply terrifying. During these times, it would be like a massive juggernaut battleship, unstoppable and overwhelming.\n During these months while Xuan Wuji had gone into closed-door seclusion to bet his life against reaching the fourth stage of Life Destruction, the Giant Leviathan was naturally managed by Xuan Yuqie.\n Xuan Yuqie glanced at the Elder who spoke and said, “Even a lion would use its full force to capture a rabbit, much less this boy Lin Ming is not as simple as he seems! During the trip into the Demon God Imperial Palace, I was also present and yet I still have no idea how he managed to steal the Nirvana Dragon Root. Moreover, Lin Ming’s strength is no longer the same as it was in the past. It’s unimaginable that in just a short two and a half years, his strength has risen to such a horrifying degree!”\n The demon region Elder thought otherwise, “Sovereign Xuan, this old man things that those rumors of Lin Ming’s strength are simply rumors – they might not necessarily be true. Those scattered minions, in order to avoid responsibility, would naturally exaggerate Lin Ming’s strength and the events that happened…”\n “Elder Sun!” Xuan Yuqie’s slender eyebrows rose and she coldly said, “If you underestimate the enemy then the one to suffer will be you! Lin Ming is not easy to handle!”\n After she finished speaking she turned to everyone else and continued to say, “I have already issued an order that all information related to Lin Ming will now be restricted; nobody may spread out anything at all. Right now, I can control the Giant Leviathan by myself, but if I want to chase Lin Ming, that will be a bit difficult. I ask for two Elders to come and support me. Who is willing to join me?”\n As Xuan Yuqie spoke, her eyes swept over each Elder one at a time. In such an important matter like capturing Lin Ming, failure was not allowed.\n There could only be success.\n “Alright. Count me as one.”\n A black-robed Elder stood up. He was someone from the Xuan Clan. His name was Xuan Zhongshan and his cultivation was at the first stage of Life Destruction. If he didn’t worry that he would fail crossing into the second stage of Life Destruction then he would have become a second stage Life Destruction master long ago.\n “I will go too.” An Elder said…\n …………..\n At this time in the distant Five Element Region, there was a great mountain peak that was several hundred thousand feet high. Atop this mountain was a forest of maple trees that seemed like a sea of fire. The name of this mountain was Sunfire Mountain. Looking from afar, this mountain seemed like a picturesque land filled with poetry and wonders. But, very few knew that one of the seven sects of the Five Element Region, the Sunfire Sect, was actually located here.\n Although the maple tree forest atop Sunfire Mountain seemed ordinary, it actually contained an exquisite array formation. If one didn’t understand the method of entry and wandered in, then it would be easy for them to be trapped inside.\n At a great temple at the summit of Sunfire Mountain, the Sunfire Sect Sovereign sat on a grand throne, wearing a long red robe. In front of him was a young and beautiful girl. She was the chief disciple of the Sunfire Sect, the Sunfire Princess.\n And standing in front of those two was a blue-clothed old woman. This old woman was elderly, but her temperament was extraordinary. From the fading outlines of her face, one could imagine that she was a remarkable peerless beauty as a youth. She was the Valley Master of one of the Five Element Region’s seven great sects, Storm Valley’s Zhan Youyun.\n Beside this old woman was a handsome youth in his mid-twenties. He was the chief disciple of Storm Valley, Zhan Yunjian.\n Four years ago, Zhan Yunjian and the Sunfire Princess had both participated in Revered Master Tianguang’s birthday banquet, shining in the spotlight there. It was only afterwards, because of Lei Mubai and Lin Ming’s appearance, that both of their halos were overshadowed.\n At this moment, the sound of footsteps echoed in the great temple as a blue-clothed woman slowly walked in. This woman only looked to be just over twenty years old, but her cultivation was astonishingly at the Revolving Core realm. Not just that, but her appearance was alluring and her figure outstanding. From top to bottom she emitted a chilling energy, as if no one could ever dare to sully her.\n If Lin Ming were here, he would immediately recognize her. She was the Divine Phoenix Island Blue Luan Faction’s Saintess and also Mu Qianyu’s little sister, Mu Bingyun!\n “Fairy Maiden Bingyun, it’s been awhile since we last saw each other.” Sage Sunfire and Storm Valley’s old woman rose up in greeting as they saw Mu Bingyun arrive.\n It had to be known that although Mu Bingyun was a junior, her cultivation had broken through to the Revolving Core realm and her total comprehensive combat strength was equal to that of an ordinary middle Revolving Core master. In terms of strength, she wasn’t that much worse than Sage Sunfire and Storm Valley’s Zhou Youyun. Like this, even though they were Elders, they still had to give several points of respect to Mu Bingyun.\n “Sage Sunfire, Valley Master Zhan.” Mu Bingyun nodded and then walked straight to her seat.\n After everyone greeted each other and sat down, Zhan Youyun glanced at the Sunfire Sect Sovereign and Mu Bingyun, smiling as she said, “Brother Sunfire, Fairy Maiden Bingyun, one of the scouting parties we arranged within the South Sea sent back some very unusual news yesterday.”\n “Oh? Unusual news?” Sage Sunfire revealed a faintly interested look, “Since the South Sea Demon Region united all those different deep sea races of the South Sea into an alliance, I have yet to hear any extraordinary news. All I’ve heard was constant defeat on the South Sea battlefield. If this continues, then I fear that our Five Element Region’s seven great sects will also be swallowed up! What is this unusual news? I’m very much interested in hearing about it.”\n The Five Element Region and the South Horizon Region were over a million miles apart. If the South Sea Demon Region became a Holy Land, it naturally wouldn’t encroach onto the Five Element Region’s territory. But in this South Sea war, the South Sea Demon Region had gathered many allies together, and now the cake that was the South Sea was naturally not enough to divvy up for everyone.\n Now the flames of war had already burnt their way to the edge of the Five Element Region; it was only a matter of time until the entire Five Element Region was occupied. The seven sects of the Five Element Region were already weaker than Divine Phoenix Island. Facing the allied armies of the South Sea, they were nothing but lambs waiting to be slaughtered.\n Hearing Sage Sunfire mention his concerns, the old woman sighed. The South Sea Demon Region’s appetite was just too great. They apparently wanted to gobble up the two great territories that lay at the edge of the South Sea, the Five Element Region and the South Horizon Region.\n With their strength, it truly was difficult to resist the South Sea Demon Region. Their only chance was if the Great Zen Region were to help. But even after dispatching several messengers, they were still unable to persuade the Great Zen Temple to intervene in the South Sea war. Compared to the Five Element Region and South Horizon Region that were located at the edge, the Great Zen Region was located inland. Thus, they had no reason to help.\n “Valley Master Zhou, we can worry over these matters later. First, please speak of the strange news you’ve obtained.”\n “Mm, this news is that the Divine Phoenix Island Branch of the south Sea Demon Region has been captured. Their means were thorough and even the guardian Elder Hong Qi was killed.” As Zhan Youyun spoke, her eyes swept over Mu Bingyun.\n “Oh? Seriously?” Sage Sunfire was bewildered.\n As for Mu Bingyun, her eyebrows shot up. Divine Phoenix Island falling to the hands of her enemies had been a pain that forever lived on in her heart. After Divine Phoenix Island was occupied by the scum of the South Sea Demon Region, they had captured and tormented the girls of the island. All of this had made Mu Bingyun’s heart bleed with pain and anguish.\n Now that she heard that the Divine Phoenix Island Branch of the South Sea Demon Region had been completely expunged, even someone as indifferent as her showed a completely changed expression.\n “Who did this?” A light flashed in Mu Bingyun’s eyes.\n It had to be known that Divine Phoenix Island Branch’s managing Elder was Hong Qi, a genuine first stage Life Destruction master. As for Sage Sunfire and Zhan Youyun, both of them were at the late Revolving Core realm. The difference in strength was just too great. It wasn’t an exaggeration to say that just the Divine Phoenix Island Branch of the South Sea Demon Region was enough to completely sweep away the Sunfire Sect and Storm Valley!\n This was not a small force. Yet, no matter how strong they were, they had actually been annihilated? Who had such great ability to do so?\n Sage Sunfire thought for a moment, then asked, a bit puzzled, “Since the Wartime Alliance was destroyed, who else could organize such a force?”\n Zhan Youyun shook her head, “I’m not too clear about this. The information blockade of the South Sea Demon Region is simply too watertight. Because they have demonic path abilities like the soul searching technique, trying to place a spy in their ranks is far too difficult. There simply isn’t any information about what happened. Ever since the Divine Phoenix Island Branch was attacked, the South Sea Demon Region has blocked all information from leaving. All we know is that there were only four martial artists that attacked the Divine Phoenix Island Branch, and all of them were around 20 to 30 years old.\n “20 to 30 years old? Impossible!” Sage Sunfire couldn’t believe this. Even 29 or 30 was just too young. At such an age, they were already a peak Saint level talent if they could reach the Revolving Core realm. For example, Mu Bingyun. She had reached Revolving Core at 30 years of age.\n As for Elder Hong Qi, his cultivation was not at the Revolving Core realm but at Life Destruction!\n Generally, if a genius was able to reach Life Destruction before they were 50 years old then there was a slim glimmer of hope that they could become a Peerless Emperor. But, if what Zhan Youyun said was true and those young people weren’t even 30 years old, yet they could kill a Life Destruction Elder, that just seemed too exaggerated!\n Mu Bingyun only remained silent. For the South Sea Demon Region’s Divine Phoenix Island Branch to be completely eradicated… this news was just too shocking for her!\n And as Zhan Youyun had said, for these martial artists that killed Hong Qi to not even be 30 years old, this had already gone beyond her understanding.\n Zhan Youyun spread out her hands and said, “In truth, I also don’t believe the information the scouting party sent over that these young people weren’t over 30 years old.\n In fact, the original information on Lin Ming had reported that he was a young man just over 20 years old. But, the scouts that Zhan Youyun sent out simply found this information too outrageous, and instead reported the age as between 20 and 30. Once this news reached Zhan Youyun’s ears, and she heard that the young people were between 20 and 30 years old, she naturally assumed they were 28 or 29 years old.\n However, even so, this was completely unbelievable.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-676","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
