{"id":54632,"no":687,"title":"Chapter 685 - Today My Only Goal Is To Kill","content":"Chapter 685 Today My Only Goal Is To Kill.\n \n …\n \n \n …\n \n \n …\n \n \n As Xuan Yuqie saw this, her beautiful face paled. However, it was beyond her power to change anything.\n \n \n The Giant Leviathan’s one on one combat efficiency couldn’t be considered too great. Its speed, both in attacks and movement, couldn’t be considered too fast. Its attack methods were also too uniform and predictable. As long as one was prepared, then a high level powerhouse simply didn’t need to fear the Giant Leviathan.\n \n \n But, for killing martial artists below the Life Destruction realm, it was far too powerful. Especially in a massive group war!\n \n \n To a second or third stage Life Destruction powerhouse, killing one or two late Revolving Core realm martial artists was no different than chopping vegetables. But, for them to kill a few hundred Revolving Core martial artists was impossible. Their opponents could simply flee in separate directions, and if they concentrated all of their efforts into a massive barrage of attacks, it was also possible to wound a Life Destruction master.\n \n \n But for the Giant Leviathan, killing one or two late Revolving Core martial artists – or even killing several hundred late Revolving Core martial artists – was not difficult at all.\n \n \n A Revolving Core martial artist couldn’t be considered too rare within the South Sea Demon Region, but they also weren’t some random cabbage. They were considered the backbone of the South Sea Demon Region.\n \n \n As Xuan Yuqie saw Lin Ming drive the Giant Leviathan into the great fleeing groups of South Sea Demon Region martial artists, how could she not be anxious!\n \n \n However, there was nothing she could do to the Giant Levithan – it was simply too large! Its naturally tough skin was several hundred feet thick. Even if it lay there motionlessly and allowed Xuan Yuqie to hit it as she wished, she would still need an entire hour of effort to even scratch it!\n \n \n This was the advantage of size. If the Giant Leviathan was scaled down to just 100 feet it still might be able to defeat a first stage Life Destruction Elder. But it was actually 90 miles long!\n \n \n Woosh woosh woosh!\n \n \n With the sound of air being sliced apart, several thousand tentacles lashed out like whips, enveloping all of the Demon Region martial artists that were escaping this calamity!\n \n \n “Ahh!”\n \n \n With a shrill scream, the first martial artist had his back pierced through with a tentacle. All of his organs were completely smashed apart as he instantly died on the spot!\n \n \n That martial artist was only at the early Revolving Core. In front of the Giant Leviathan, he simply didn’t have the ability to resist.\n \n \n This martial artist was only the beginning. Follow this, countless screams of anguish and pain filled the air. Tentacles repeatedly pierced through the fleeing martial artists’ bodies en masse, their blood filling the skies with crimson rain!\n \n \n Even Life Destruction Elders like Xuan Yuqie were not ignored. Instead, they became the focus of Lin Ming’s attention.\n \n \n Bang!!\n \n \n Several dozen tentacles rushed towards Xuan Yuqie before being sent flying away by her sword. At this time, her hair was a mess and her face was pale, “Lin Ming! I know you can hear me! Stop this immediately! Otherwise, I will have you regret everything!”\n \n \n Xuan Yuqie angrily shouted. But after Lin Ming heard this, he actually smirked, smiling as if he had heard the funniest joke of all.\n \n \n “Regret? On what basis will you have me regret anything? On what basis do I have to negotiate anything? When you used the Giant Leviathan to exterminate the Wartime Alliance and crush Divine Phoenix Island, did you give them a chance to negotiate?\n \n \n “Don’t bother trying to delay for time so that your disciples and subordinates can escape; I am not so naïve. Today my goal here is clear, and that is to kill! If I see one then I will kill one, if I see two then I will kill two! All men and all women here today will die and not even dogs or chickens will be left alive! I want you to taste just what it feels like to have everything you’ve known be annihilated by the Giant Leviathan! I will show you what retribution is, I will show you what an eye for an eye truly means! With the blood of your South Sea Demon Region’s martial artists, I will soothe the souls of all the heroes that perished in the South Sea war!”\n \n \n As Lin Ming spoke, killing intent erupted from his entire body. Within his spiritual sea, the spear-shaped battle spirit began to shake. His soul force divided into several thousand strands as it completely sunk into the Giant Leviathan’s tentacles.\n \n \n He launched a maddening all-out attack on the South Sea Demon Region martial artists!\n \n \n Now he no longer aimed at the Life Destruction Elders and Xuan Yuqie. Dealing with a Life Destruction Elder would require hundreds or thousands of the tentacles, and even if he tried wholeheartedly, he still might not be able to kill Xuan Yuqie and that masked man. If those two second stage Life Destruction masters flew away at full speed, they might not be any slower than the Giant Leviathan.\n \n \n Then, it was better and far more effective to kill the ordinary martial artists of the South Sea Demon Region.\n \n \n Mobilizing his soul force to the limit and with his battle spirit and also Demonshine’s support, this became a completely one-sided massacre. The South Sea Demon Region martial artists simply had no ability to resist. Some frightened Revolving Core martial artists tried to fight back against the tentacles, but none of their attacks were even able to make a dent in the tentacles’ skin.\n \n \n With Revolving Core martial artists like this, there was no need to even mention the Xiantian and Houtian martial artists. A single strike from a tentacle was enough to kill a Xiantian realm martial artist. As for Houtian realm martial artists, as long as they were even touched by the aftershocks of energy they would simply perish where they stood!\n \n \n After giving up his attacks on the Life Destruction Elders, Lin Ming’s killing efficiency multiplied!\n \n \n In just a short 10 breaths of time, several hundred South Sea Demon Region martial artists died, their corpses turning into bits of ground meat and blood that covered the skies.\n \n \n Those that died were all the core of the South Sea Demon Region and Lin Ming’s killing speed was far too terrifying. Xuan Yuqie felt her heart chill. She had personally controlled the Giant Leviathan so she naturally knew just how difficult it was to manipulate the Giant Leviathan’s tentacles. To use several thousand tentacles at once, every one required its own separate conscious control.\n \n \n When Xuan Yuqie had controlled the Giant Leviathan’s tentacles to try to just kill Lin Ming by himself, that was already very difficult. But now, Lin Ming was able to control thousands of tentacles to simultaneously chase after thousands of people!\n \n \n The difficulty of this was several times higher than what she had ever done!\n \n \n And now, in Lin Ming’s hand, this horrifying scene played out in front of her. These several thousand tentacles seemed to have their own eyes, searching for targets on their own initiative. This accurate attack was enough to make one’s scalp tingle with dread!\n \n \n What sort of terrifying control was this?\n \n \n “Just how can Lin Ming achieve this?” Xuan Yuqie’s mind raced. Lin Ming’s soul force was strong to the point of surpassing her understanding. She couldn’t help but admit that in Lin Ming’s hands, the strength that the Giant Leviathan was able to display was several times what she was capable of. This made her feel both incomparably depressed and incomparably spooked.\n \n \n She had a faint feeling that ever since the war in the South Sea started, the greatest error that the South Sea Demon Region had ever made was not by the hands of others, but only by Lin Ming!\n \n \n At this time, within the dimension of the Giant Leviathan, it wasn’t as difficult as Xuan Yuqie imagined for Lin Ming to reach this degree of control. It was true that to simultaneously control thousands of tentacles together required a massive amount of soul force. But, Lin Ming’s soul force was already extremely formidable to begin with. With Demonshine supporting him and also having a much more efficient way to control the Giant Leviathan, these three factors combined together allowed him to easily do this.\n \n \n No matter how the Demon Region martial artists in the sky cried or wailed, Lin Ming didn’t hesitate once in his actions. He simply didn’t need to worry about killing all of these martial artists. When these Demon Region martial artists had chosen their path, they were already destined to do evil in the world. Moreover, for them to be able to cultivate to such a degree, who knew how many women’s Primordial Yin essence energy they had snatched away.\n \n \n In the Seven Profound Valleys, a mere Acacia Faction had already ruined the lives of so many women, much less the South Sea Demon Region.\n \n \n But, these little fish and shrimp underlings weren’t the goal that Lin Ming most wanted to deal with. What Lin Ming wanted to affect was Xuan Wuji, who was in closed-door seclusion as he tried to reach the fourth stage of Life Destruction.\n \n \n In the process of a human martial artist crossing the fourth stage of Life Destruction, they had to destroy their entire body and reform their Revolving Core after shattering it into fragments. In the first three stages of Life Destruction, one only had to destroy and reform the body. But, in the fourth stage of Life Destruction, one had to destroy and reform both the body and Revolving Core. This was an extremely dangerous process; the risks entailed were much higher than in the first three stages of Life Destruction. If there was even the slightest accident and any part of the process of reforming the body or Revolving Core failed, they would fail to cross Life Destruction, instantly perishing!\n \n \n During this closed-door seclusion to cross the fourth stage of Life Destruction, Xuan Wuji was at his weakest period. As long as he could find Xuan Wuji during this time, then he could seriously wound him or even kill him.\n \n \n Lin Ming was well aware that he wasn’t able to stand against Xuan Wuji when he was at his pinnacle. Once he successfully crossed the fourth stage of Life Destruction, then without a doubt he would organize a final total assault. Whether it was him or Divine Phoenix Island, everyone would be in danger.\n \n \n Lin Ming certainly wouldn’t sit back and let this happen. He had to take advantage of Xuan Wuji’s weak period and strike the first blow. But, Xuan Wuji was exceptionally sly and cunning. Elder Sun and Elder Zhou simply didn’t know where he was in closed-door seclusion, thus Lin Ming didn’t even know where to begin looking for him.\n \n \n If he couldn’t find Xuan Wuji, then he would deal with his disciples and followers instead. Even if he couldn’t force that old geezer out of seclusion, he would still be able to severely damage the South Sea Demon Region so they wouldn’t be able to organize a large scale attack any time soon.\n \n \n Woosh woosh woosh!\n \n \n Several thousand tentacles were like pythons and they shot towards everyone. In just a short half incense stick of time, these tentacles had swallowed the lives of nearly a thousand Demon Region martial artists!\n \n \n And this number would still rise! The Giant Leviathan’s reputation as a top beast of war was not for nothing!\n \n \n As the masked Elder saw this happen, his eyes grew so red from anger that they nearly popped out of his head. However, he simply couldn’t stop Lin Ming.\n \n \n “Lin Ming, you remember this old man!”\n \n \n With a shout, the masked Elder left behind a threat and then flew away. He didn’t do anything nor could he.\n \n \n Lin Ming didn’t even care about him. As a second stage Life Destruction master, even if Lin Ming tried his best to keep him here, it would be nearly impossible to stop him.\n \n \n At this time, Lin Ming’s speed of killing had slowed down. Most of the fleeing martial artists had escaped the hunting range of the Giant Leviathan and had reached relatively safe areas.\n \n \n Because these South Sea Demon Region martial artists had scattered away, no matter how powerful Lin Ming was, it was impossible to keep them here.\n \n \n Finding the direction with the highest concentration of martial artists, Lin Ming chased them for another hundred miles. After he killed another hundred martial artists, the battle began to wind down.\n \n \n In this battle, the South Sea Demon Region martial artists had left more than 1000 corpses behind. This could be called an extremely desolate and tragic battle.\n \n \n The most that died were the Houtian martial artists. They were the slowest and also had the weakest defenses. Just by being caught up in the true essence energy fluctuations they were ground to death.\n \n \n A good number of Revolving Core martial artists had died because Lin Ming had focused his attention on them. In fact, it wasn’t much harder for the Giant Leviathan to kill Revolving Core martial artists than Xiantian martial artists. Thus, Lin Ming certainly decided to kill the more powerful ones.\n \n \n In the air, the Life Destruction Elders of the South Sea Demon Region had already escaped. After Xuan Yuqie left behind some vicious curses, she also fled. They were all aware that none of them could defeat Lin Ming, thus, staying here just because they were emotionally affected by all this destruction was simply idiotic.\n \n \n This caused Lin Ming to feel some regret. Originally, he had wanted to play a bit with the masked Elder or Xuan Yuqie; he wanted to see how good the Giant Leviathan was at killing second stage Life Destruction powerhouses.\n \n \n The entire South Sea Demon Region was nearly emptied of people. But, Xuan Wuji hadn’t shown up from start to finish.\n \n \n Lin Ming didn’t know whether that old fellow could see this scene. But if he could, what expression would he have? Would he be so apoplectically angry, frothing with so much hate that he failed to cross Life Destruction?\n \n \n As Lin Ming maliciously thought this, he began to use the Giant Leviathan to pick through all the corpses on the islands.\n \n \n To more accurately say it, he was collecting their spatial rings.\n \n \n The current Lin Ming no longer desired the wealth of these low level martial artists. But, although a single martial artist wasn’t worth too much, 1000 of them was different.\n \n \n There were also the buildings throughout the South Sea Demon Region. Lin Ming didn’t plan on letting them go – he’d loot them too.\n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-685","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
