{"id":54637,"no":692,"title":"Chapter 690 - Kiss","content":"Chapter 690 – Kiss\n \n …\n \n \n …\n \n \n …\n \n \n Ever since Lin Ming left and Divine Phoenix Island had encountered disaster after disaster, Mu Qianyu had imagined countless times in her mind just what her reunion with Lin Ming would be like.\n \n \n In her most ideal dreams, it was nothing more than Lin Ming returning back stronger. He would return to her, help her hold up the skies, shelter her from wind and rain, and do his best to turn the tide.\n \n \n However, this was nothing but her wishes.\n \n \n When Lin Ming left, he had only been at the Xiantian realm. As for Xuan Wuji, he would soon reach the fourth stage of Life Destruction. If just a short 10 years, even if Lin Ming’s talent far surpassed everyone else within the Sky Spill Continent, a genius that had never been seen since ancient times, it would still be impossible to reach such a formidable degree.\n \n \n 10 years was simply too short a time for the growth of a top master. Moreover, there was the possibility that Lin Ming’s potential would be exhausted. After all, there were many variables in the growth of a genius. Just because they were rising stars in their youth didn’t mean they would absolutely become top masters in the future.\n \n \n What Mu Qianyu cared about was not what degree of strength Lin Ming could obtain, but whether or not he would be able to return safe and sound. With Lin Ming’s personality, she knew that he wasn’t someone that would resign himself to mediocrity.\n \n \n On this journey that he traveled alone, he would undoubtedly enter into all sorts of mystic realms and danger zones. The risks and perils he would encounter could be imagined.\n \n \n Mu Qianyu feared that if Lin Ming left, she would never hear from him again.\n \n \n In that case, she would really perish from her suffocating sadness.\n \n \n She was looking forward to meeting after this 10 year promise, but at the same time she was also scared. She was scared that 10 years from now, she would go to Thundercrash Mountain to wait for something that was only a dream!\n \n \n She never imagined that in just a short two and a half years of time, Lin Ming would actually appear in front of her, well and safe. Compared to when he left, his appearance hadn’t changed much. It was just that the temperament and aura revealed between his brows was different from before. He had lived through many great changes, and the air around him seemed much sharper and fiercer than before.\n \n \n Although his temperament was different, he still gave off an incomparably familiar feeling that absolutely proved it was him beyond a shadow of any doubt.\n \n \n Mu Qianyu’s soul trembled.\n \n \n This time, she no longer cared about what he had experienced or how strong he had become. A single thought echoed out again and again in her mind…\n \n \n He returned! He had safely returned!\n \n \n Mu Qianyu covered her mouth. She didn’t know why, but at the moment she saw Lin Ming, all the grievances and pained she had suffered for this past two and a half years, all of that pressure she had to bear, all of it seemed to be washed away from her heart.\n \n \n As she saw Lin Ming, her heart and mind filled with an overwhelming joy, so great that she couldn’t help but burst into tears.\n \n \n Was this a dream?\n \n \n Lin Ming stopped a few dozen feet in front of Mu Qianyu, neither of them speaking.\n \n \n When Lin Ming first saw Mu Qianyu, it was like their souls connected, blending together, allowing him to experience everything she was feeling.\n \n \n He could feel her helplessness and her fragileness. He could feel that the walls she had set up to support herself had come tumbling down, all of her emotions pouring out from her.\n \n \n Lin Ming felt fortunate. He was glad that he had come back early. Otherwise, if seven and a half years of time passed again, he couldn’t imagine just what would have happened.\n \n \n He subconsciously opened his arms, wanting to hold her. But, he actually stopped halfway, stiffening a bit.\n \n \n His love towards Mu Qianyu was intermingled with respect, a sense that came from Mu Qianyu’s otherworldly temperament that seemed to defy being defiled or blasphemed by anyone.\n \n \n This was also the reason that Lin Ming referred to Mu Qianyu as Miss Mu and Senior-apprentice Sister.\n \n \n However, Lin Ming hadn’t thought that just as he opened his arms, he would see a flash of red in front of him, and suddenly a warm and fragrant body came rushing into his embrace.\n \n \n Smooth arms were like snakes that wrapped around Lin Ming’s back and neck. Mu Qianyu seemed to exhaust all of her strength as she hugged Lin Ming without reservation, as if she wanted to meld her body into his.\n \n \n Lin Ming could even feel a slight ache from his back from the force of those two arms.\n \n \n “Hold me…”\n \n \n Mu Qianyu whispered into Lin Ming’s ear, as if she was afraid he would disappear once she let go.\n \n \n Lin Ming hugged Mu Qianyu. As he ran his hands down her back, he could feel her smooth and tender body through the silk fabric of her clothes. As they held onto each other with no space between them, he could feel the touch of a beautiful woman’s breasts against his own chest.\n \n \n The light fragrance of a woman filled his senses. He could hear Mu Qianyu’s heartbeat and feel her breath.\n \n \n This sort of wonderful feeling held an incomparably charming and tender warmth. Ever since those three sweet days at Thundercrash Mountain, Lin Ming hadn’t had such intimate contact with Mu Qianyu.\n \n \n In this moment, in the entire world it was as if only the two of them existed. In the silence of the mountains, as the stars brightly shimmered in the night sky, their two lonely hearts seemed to support each other.\n \n \n Mu Qianyu quietly fell into Lin Ming’s arms. From when she was born until now, she had never felt as fragile or happy as she did today. She wanted to hug Lin Ming and place everything she had with him.\n \n \n In this brief instant, all she felt was him. Any sort of rain or wind or disaster, nothing mattered anymore.\n \n \n The two of them hugged for an entire quarter of an hour. When Mu Qianyu’s tears finally stopped flowing, she said in a quiet voice, “I’ve missed you…”\n \n \n These simple words, without an embellishment, actually contained all of her true feelings for these last two and a half years.\n \n \n “I know.” Lin Ming gently said. As he looked down, he could see Mu Qianyu looking up at him. A crystal clear tear still shined at the corner of her eyes, sparkling like radiant silver underneath the moonlight, like bright pearls blooming in the deep sea.\n \n \n In this cold moonlight, with this beautiful woman looking at him, everything seemed hazy as if it were a perfect dream.\n \n \n Lin Ming felt his heart throb.\n \n \n He cradled Mu Qianyu’s face in his hands, he paused for several breaths of time.\n \n \n Then, he kissed her.\n \n \n Mu Qianyu’s body trembled. The world faded away. Her arms instantly tightened around his body and her entire body seemed to soften into his. She closed her eyes as her long lashes gently trembled, lost in this deep abyss of this kiss.\n \n \n This was Lin Ming’s first kiss, and it was also Mu Qianyu’s first kiss.\n \n \n He greedily nibbled on her cherry-red lips, sucking on the tip of her wet tongue until Mu Qianyu’s entire being shivered. Only then did the two of them reluctantly break away from each other.\n \n \n “Everything will be fine now.” Lin Ming whispered in Mu Qianyu’s ear. These words were not empty words of comfort. This was a vow. A vow he made from the confidence in his own strength.\n \n \n As long as he was here, everything would be fine!\n \n \n However, Mu Qianyu could no longer tell the difference between these words now. She gave a soft cry of pleasure as her face flushed red with blood. Her cheeks seemed like a ripe peach right now, wet enough that they would drip water with just a little pinch.\n \n \n She softly poured herself into Lin Ming’s chest, allowing her entire body to weigh down on Lin Ming’s shoulder. Her breath caught in her chest and she exhaled. Ever since Mu Qianyu was young, she had rarely come into contact with men at Divine Phoenix Island. Thus, she was unfamiliar with the relations between men and women. Within Thundercrash Mountain, although it was an ambiguous time, that was only a chance meeting that Mu Qianyu had with Lin Ming; it was impossible for her heart to be affected. That sort of ambiguous encounter had allowed left her shy and embarrassed, charmed by Lin Ming. It wasn’t like now, where her heart throbbed and she was unable to stop her actions.\n \n \n “Senior-apprentice Sister, how are Xingxuan and my parents?” Lin Ming suddenly asked. Besides Mu Qianyu, his greatest worries were Qin Xingxuan and his parents.\n \n \n Mu Qianyu said, “When Divine Phoenix Island was destroyed, the sect was in a very precarious situation. Honorable Sect Master asked the disciples of Divine Phoenix Island whether or not they were willing to go to Ying Yang Profound Palace. Many of the lower level disciples left because of this… and as for Xingxuan… she originally wanted to come with us, but I was worried that she might have an accident if she stayed with us. I arranged for her to secretly go to a mortal country in the Five Element Region where your parents are also staying.\n \n \n For a martial artist’s cultivation, they needed spiritual lands, resources, practice arrays, and so forth. Normally, a martial artist wouldn’t go to a mortal country. But, Mu Qianyu believed that what Qin Xingxuan needed the most was not cultivation, but to go on living in peace and safety. If Qin Xingxuan went to a mortal country, then with her Houtian realm strength, that was enough to guarantee her and Lin Ming’s parents’ safety. As for the South Sea Demon Region, it was impossible for them to chase down a single unknown Houtian realm martial artist over a million miles away.\n \n \n “I see…” Hearing that Qin Xingxuan and his parents were safe, Lin Ming let out a sigh of relief. As long as they were safe and alive then it was great. As for everything else that was lost, it could be taken back.\n \n \n At this time, Mu Qianyu finally discovered Lin Ming’s cultivation. Her eyes widened as she said with disbelief, “Lin Ming… you… you’ve broken through to Revolving Core?”\n \n \n “Yes. Just several days ago I made a lucky breakthrough.”\n \n \n “This…”\n \n \n Mu Qianyu covered her mouth, shocked speechless. Two and a half years ago, Lin Ming was at the early Xiantian realm. After leaving for such a short time, he actually managed to break through to Revolving Core!\n \n \n And looking at Lin Ming’s dantian, the energy was collected, the origin energy was dense, and a faint vortex could be vaguely seen. This was not an ordinary Revolving Core!\n \n \n Although Mu Qianyu was also at the Revolving Core realm, this was far too different compared to Lin Ming!\n \n \n “How could… this be so fast…”\n \n \n With Mu Qianyu’s talent, she broke through to the Xiantian realm when she was 22 years old and then to Revolving Core when she was 30. This had taken a full eight years. But, Lin Ming had only used two and a half years, and he wasn’t even 21 years old yet!\n \n \n When Mu Qianyu was Lin Ming’s age, she was only at the peak Houtian realm!\n \n \n This was simply the difference between the heavens and earth.\n \n \n This was no longer something that could be described as just an Emperor level talent.\n \n \n “Lin Ming… how strong are you now?” Mu Qianyu asked with wide eyes. When Lin Ming had left, he was at the early Xiantian realm and Mu Qianyu was at the extreme Xiantian realm. The difference between their strength hadn’t been too great.\n \n \n Now Lin Ming had jumped an entire boundary. By all reasoning he should have strength at least equal to a late Revolving Core master. Or perhaps he could even compare with the weakest of Life Destruction powerhouses.\n \n \n Lin Ming naturally didn’t need to hide anything from Mu Qianyu. “I’m not too sure what the limits of my strength are. It’s only a rough estimate, but I can kill a first stage Life Destruction master. As for Xuan Yuqie and other second stage Life Destruction powerhouses, I’m probably not their match yet.”\n \n \n “You can kill a first stage Life Destruction powerhouse?” Mu Qianyu’s heart jumped. Lin Ming’s strength was far more terrifying than what she had imagined.\n \n \n In truth, Life Destruction was equal to the extreme Revolving Core. It was a very special stage within the Revolving Core realm. For Life Destruction martial artists, their true essence was also located in their dantian’s Revolving Core. It was only because they experienced a remolding and transformation of their bodies and dantian that a Life Destruction martial artist’s strength far surpassed that of a Revolving Core martial artist.\n \n \n If Lin Ming could kill a first stage Life Destruction martial artist, what would happen once he reached Life Destruction?\n \n \n As Mu Qianyu thought of this, she was suddenly startled. She seemed to think of something. If Lin Ming could kill a first stage Life Destruction martial artist…\n \n \n She looked towards Lin Ming, an expression of disbelief on her face as she asked, “Lin Ming… 10 days ago, the one who pillaged and razed the South Sea Demon Region… that couldn’t have been you right…”\n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-690","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
