{"id":54693,"no":748,"title":"Chapter 746 - The Disparity Between Them","content":"Chapter 746 – The Disparity Between Them … … … Xuan Wuji cultivated the Ancient Devil Arts. He could directly sacrifice his own blood essence to his lance to further temper it, obtaining an even greater attack power. However, a martial artist had a limited quantity of blood. He would undoubtedly lose part of his blood vitality because of this move. Xuan Wuji had no choice. He had to make a blood sacrifice to his lance in this battle with Lin Ming. The main reason was not to increase his striking power, but instead to reinforce his lance. If he hadn’t done so, then his lance would have been cut off by Lin Ming’s spear in just several collisions. This sort of disadvantage didn’t originate from the difference in ranks of their treasures but from the existence of a battle spirit. In a battle between heaven-step treasures, when there was only a small difference in rank, there wouldn’t be an obvious inferiority if Xuan Wuji’s lance struck Lin Ming’s spear. But, Lin Ming’s spear had a battle spirit poured into it. This caused the sharpness and hardness of his spear to rise by an unbelievably large degree. In the past, when Lin Ming had poured his battle spirit into his high-grade earth-step Purple Comet Spear, he had been able to pierced through the body of a corpse devil which had been tempered by the profound gold divine fruit so that its body stood on par with a heaven-step treasure. In addition to that, he had received a medium-grade heaven-step spear from the Timeworn Phoenix City that could stand on par with a high-grade heaven-step treasure in terms of hardness. If a battle spirit were to be attached to such a weapon, the degree of sharpness could be imagined. Xuan Wuji did not have a battle spirit, thus he did not have the qualifications to directly confront Lin Ming. Thus, Xuan Wuji could either use a massive amount of true essence to protect his lance or make a blood sacrifice to his lance, injuring himself to attack his enemy. Blood smeared the corners of Xuan Wuji’s mouth. He pointed his lance straight at Lin Ming and said, “In that lance strike just now, I was forced to withdraw my attack midway. Now, I will use everything I have!” Now that Xuan Wuji and Lin Ming’s battle had reached this boiling point, there was no longer any path of retreat! Xuan Wuji had to fight, and this was because he was a man whose heart was filled with ambition. If it was possible, he wanted to not only reach the Divine Sea but also ascend into the Realm of the Gods, seeing and adventuring through a much broader world! Now, with this lucky chance standing right in front of him, if he didn’t fight now, then he was destined to die in another thousand years, his body reduced to ashes by the endless expanse of time! “Blood Waves Drowning the Skies!” Xuan Wuji grasped his lance. Because of the wisp of blood essence he sacrificed to his spear, his originally white face was now flushed red, making him look like a demonic blood monster and the spear in his hands like the scarlet tongue of a devil. Xuan Wuji waved his lance, and a roiling red energy cut towards Lin Ming. Facing this attack from Xuan Wuji, Lin Ming held his spear flat in his hands, revolving his true essence to the limit. His spear potential and battle spirit constantly rose. In the heavy water pressure hundreds of thousands of feet under the sea, every single move had to be made through the dense water, causing one to use up even more energy and stamina! Law of Annihilation, Chain of Stars! As Lin Ming held the red spear shaft, he swept it downwards! This spear strike was a move that Lin Ming had comprehended after reversing the chain of stars in the God Transforming Mirror’s second world. It had no name, but rather contained a trace of the Concept of Annihilation. As his spear cut out, it tore apart the deep sea, fiercely colliding with Xuan Wuji’s lance strike. Bang! The entire sea trembled and monstrous surging currents rolled up into a vortex. Thousands of feet away from the battle, a massive amount of sediment was stirred up into gray storms. Several deep sea vicious beasts that were hiding in the sand were frightened, fleeing in a panic. Clang clang clang clang clang clang! In this storm of sand and water, Lin Ming and Xuan Wuji engaged in a brutal melee! The two heaven-step treasure weapons fiercely collided, causing the sea current to violently surge. In the high pressure of the deep seas, the water still wouldn’t vaporize even when heated to a temperature comparable to molten magma. Every single strike from Lin Ming contained the power of his battle spirit and every single lance strike from Xuan Wuji contained his blood essence! Demon God force field of the Heavenly Demon martial intent! As Lin Ming fought, the killing intent on his body became increasingly thick and pure, starting to overwhelm Xuan Wuji with a terrifying oppressive force. The Death God force field was formed from the will of a martial artist’s killing intent. If a martial artist didn’t have a firm will and they were covered by the Death God force field, then it was possible that the fires of their life would be directly snuffed out. Even a powerful master would be affected by the Death God force field, unable to utilize their full strength. “Mm? This brat!” Xuan Wuji was shocked. Lin Ming actually had this type of domain ability!? Just what had this boy experienced in his life that he had so many abilities that others could only wish for? “Endless Ghosts Scream, break for me!” Xuan Wuji turned his lance. On the lance point, a wisp of eerie dark purple flame appeared. For a moment, it was as if countless spirits were crying out in unison, it was as if this wisp of dark purple fire was condensed from the infinite spirits of tortured souls! Xuan Wuji’s lance had killed countless martial artists. It was similar to the Great Desolate Blood Halberd; it used the blood essence and souls of martial artists as nourishment to strengthen itself! The tortured spirits were constantly melted away by the Death God force field. But the dark purple flame on Xuan Wuji’s lance became increasingly vivid! “Demon God Flash!” The muscles on Xuan Wuji’s face fiercely twisted as he struck out at Lin Ming’s head. But, Lin Ming actually didn’t dodge or evade this strike. Instead, he thrust out his own spear, straight towards Xuan Wuji’s chest. Law of Annihilation! Xuan Wuji was startled. Lin Ming completely disregarded a fatal attack to his head and still attacked him. It was like he didn’t care for his own life! With a turn of his lance, the energy that Xuan Wuji poured into it suddenly exploded. With a loud bang, true essence violently surged out. Lin Ming’s purely offensive attack had caused both him and Xuan Wuji to be injured. Lin Ming was sent flying a thousand feet away by the true essence explosion, but Xuan Wuji was no better off. Although he had blocked Lin Ming’s spear, the battle spirit infused spear light still continued unabated, piercing through his layers of protective true essence and into his chest. Around 10% of the strike’s strength roared into his meridians, recklessly destroying everything there! Xuan Wuji paled and suppressed this true essence with a great deal of effort. Blood dripped down the corners of his lips. He was injured! Xuan Wuji grimaced. Although this was only a minor would, Lin Ming hadn’t even defended and yet he himself had been injured. But no matter how it had happened, the truth was that he had been injured at the hands of a junior only a fraction of his age! A fourth stage Life Destruction martial artist had been wounded by a mere 20 some year old Revolving Core boy. If the world learned of this, they would say he was nothing more than a joke! “Boy, since you couldn’t dodge my strike you wanted to engage in a suicidal trade instead! Dream on!” Xuan Wuji sneered. Sometimes, when a martial artist was weaker the others and didn’t have the confidence to defend against another’s moves, they might instead decide to trade injury for injury, forcing the other to withdraw. But, Xuan Wuji was deeply experienced in combat. He could freely receive and change his strength, always able to change his attack. He simply wouldn’t fall for such tricks. A moment ago, he had temporarily changed the direction of his attack, blocking the majority of the attack. Since Lin Ming hadn’t changed his attack, his injuries should be much worse. However, Xuan Wuji’s taunting smile only lasted for several breaths of time, before it froze on his face. He looked at Lin Ming with wide eyes. At Lin Ming’s chest, the clothing had been ripped apart by the true essence explosion. However, there was only a shallow bloody wound on his chest that was regenerating at a speed visible to the naked eye. “How is this possible?” Xuan Wuji was bewildered. His lance light had obviously struck Lin Ming. Even if it was weakened by Lin Ming’s bodily true essence protection it should still be able to grievously wound him. How could it only cause such a minor wound? Xuan Wuji didn’t even have time to think about what had just happened; Lin Ming’s spear was already shooting towards him once again! This spear strike contained all of Lin Ming’s true essence. It caused all the heaven and earth origin energy in a scope of 10 miles to spin around. In that moment, space twisted and the sea boiled! As this spear thrust out, the high pressure sea water was split apart, forming a vacuum tunnel. Within Lin Ming’s body, the Heretical God Seed howled as the Burning Star Flame surged outwards. Bury the Heavens! In this strike, the power of space fused with the Concept of Fire. Using the tempestuous space flows like a wind, it helped to increase the power of fire! Xuan Wuji’s expression became ferocious. He stabbed out his lance again and again! “Emperor Arriving In the World!” Ka ka ka! Xuan Wuji’s lance issued out a keening cry as if it couldn’t support itself much longer. But Lin Ming’s spear shot forwards with unstoppable force, arriving right in front of Xuan Wuji. Around the edge of the spear, space tore apart and countless space fragments flew out like steel needles, cutting through the deep sea! “This move is!?” Xuan Wuji’s pupils shrank. His lance had reached the limit yet again! Turning the lance, Xuan Wuji bit down on his tongue, forcefully spitting out more blood essence onto the lance edge! Peng! A massive amount of sea water vaporized, turning the entire seabed into a world of hazy fog. Xuan Wuji had drawn back more than 200 feet, his face flushed red with blood as he gasped for breath in deep, heaving gulps. Hundreds of thousands of feet under the deep sea, every ability used here would consume over twice the energy it took on the surface. In this fierce battle, Xuan Wuji had already consumed a great deal of his true essence. Because Lin Ming was still over an entire boundary lower than Xuan Wuji, he had been forced back 1000 feet. But, compared to Xuan Wuji, his complexion still hadn’t changed. There was not a single drop of sweat on his body; he still had plenty of strength left! Even after using Chasing Sun, Penetrating Rainbow, the Laws of Annihilation, Bury the Heavens, and engaging in a brutal melee for a short period of time, he still had plenty of energy. It had to be known that in the later parts of the God Transforming Mirror’s second world, when the meteors there reached a mile and a half wide in diameter, Lin Ming would have to use Bury the Heavens to defend against them. As for the two mile wide meteors, Lin Ming would have to reverse the chain of stars. Even in this case, if Lin Ming was completely earnest in his battle, he could last for over a 100 breaths of time! This had caused Realm of the Gods powerhouses like Fairy Feng to praise him and for young elites like Huo Wenlong to fall into crippling despair from his success! The reason that Lin Ming had such a great endurance was because he had opened the Eight Inner Hidden Gates. With the tempering of the Ancient Phoenix bloodline, his blood vitality now greatly exceeded even an extraordinary individual’s! In these aspects, Xuan Wuji simply couldn’t compare to Lin Ming. Not only did Lin Ming dominate in endurance, but he dominated in terms of defensive ability too. With 100% Tempering Marrow along with the tempering from the profound gold divine fruit, Lin Ming’s body was similar to a high-grade earth-step treasure. He could easily engage Xuan Wuji in a battle of attrition. Thus, even if Lin Ming’s striking power was below Xuan Wuji’s, if they continued fighting, then Xuan Wuji would no longer be able to support himself after another half incense stick of time! Raising his spear, Lin Ming attacked again. Bury the Heavens! This was the same move as the last. True essence erupted from the red spear and space fragments cut out like shredding knives. Sea water was twisted into a giant whirlpool as the entire seabed vaporized. As Xuan Wuji saw Lin Ming’s attack only increase in aura and potential, his eyes finally flashed with a trace of fear. How was this possible? Was this boy’s body a puppet or something!? Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-746","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
