{"id":54720,"no":775,"title":"Chapter 772 Skyflower Stones","content":"Chapter 772 – Skyflower Stones\n …\n …\n …\n “Skyflower stones?” The young maid asked, stunned. These were extremely rare objects. Heavencraft Pavilion had just managed to obtain several skyflower stones recently. Because they were high level alchemy materials, they were very popular in the Nine Furnace Divine Kingdom, and their price was also correspondingly sky high.\n She never thought that Lin Ming, who seemed so young, who immediately ask for skyflower stones.\n The young maid hesitated for a moment, suspecting that Lin Ming was simply messing around and just wanted to see the beautiful skyflower stones. Then, he would just make an excuse and decide not to buy them.\n Although she had her doubts she still reported this information over. A moment later, a black-clothed old woman walked down from upstairs.\n The black-clothed old woman narrowed her eyes as she sized up Lin Ming. With her experience she could naturally see that Lin Ming’s foundation was exceedingly stable. In addition to his age and cultivation, he should definitely be some extraordinary junior of his generation.\n This sort of person truly might be able to afford skyflower stones.\n “This little brother, please come along with me.”\n The old woman turned around and walked upstairs with Lin Ming following close behind her. As Lin Ming stepped onto the staircase, he discovered that between the floors of Heavencraft Pavilion, there were actually invisible layers of resistance similar to when he was flying up. Except, the resistance from this level to the next was twice as much. Perhaps even a normal early Revolving Core martial artist wouldn’t be able to walk up.\n When he turned around to look at the young maid behind him, he saw that she had a shining token on her waist. It was clear that this token let this Houtian level maid freely traverse the Heavencraft Pavilion.\n There were even less people on the Heavencraft Pavilion’s second floor. After Lin Ming sat down, two maids set a plate of snacks down in front of him. Not too far away from Lin Ming, there was a red-clothed old man sitting down at another table. This red-clothed old man had a second stage Life Destruction cultivation.\n The old man was holding a teacup in one hand while slowly fiddling with a cover in the other. He glanced up at Lin Ming, all smiles.\n Lin Ming nodded politely in return. This red-clothed old man should also be a guest of the Heavencraft Pavilion.\n At this time, from a side hall of the second floor, a purple-veiled slender woman walked out. “Two guests, you’ve waited for a long time.”\n Her melodious voice that was like tinkling bells immediately attracted both Lin Ming and the old man’s attention.\n The woman looked to be just over 20 years old, and although she had veil over her face, one could clearly make out that the woman underneath was a simple yet exquisite beauty. Her stature was elegant, and her skin glittered like a translucent crystal. She was a stunning specimen of femininity that was easy for others to be lost in.\n The woman opened her mouth and said, “I’ve heard that both honored guests are here to purchase skyflower stones. The truth is, these skyflower stones only arrived at the Heavencraft Pavilion’s Headquarters five days ago, yet 20-30 people have already come to see them. However, no one has been able to purchase them. This is mainly because….”\n As the purple-clothed woman spoke up to here, she smiled and continued, “This is mainly because these skyflower stones don’t belong to our Heavencraft Pavilion, but instead have been placed here on commission by another esteemed guest. This guest wishes to use the skyflower stones to trade for some equally rare materials. If you two honored guests are unable to bring out an item that can satisfy that guest, then no amount of spirit essence stones will be enough.”\n “Oh, so it’s like that. I was wondering why such valuable alchemical materials had remained within the Heavencraft Pavilion for so long. May I inquire as to which martial cultivator it was? Perhaps this old man might know him!” The red-clothed old man asked as he stroked his beard, smiling. He obviously had the intention of trading for the skyflower stones by directly establishing his relationship with the owner.\n The purple-clothed spoke with no intentions of hiding the truth, “It’s Grandmaster Zhuan Bixian.”\n “Zhuan Bixian!” The red-clothed old man revealed a look of shock, “So it’s Grandmaster Zhuan Bixian, who’s ranked in the Destiny Decree’s top 150! Then, this is truly out of this old man’s league.”\n The red-clothed old man shook his head over and over again.\n From the Houtian realm to the Life Destruction realm, the difference was only equal to a single boundary within the Life Destruction realm. This was also the reason that there was such a huge disparity in strength between martial artists of different stages in the Life Destruction realm. The red-clothed old man was at the second stage of Life Destruction; that was an entire four boundaries away from the sixth stage Life Destruction Zhuan Bixian. Not just that, but every boundary within the Life Destruction stage carried with it an enormous risk of death.\n This caused the red-clothed old man’s status difference with Zhuan Bixian to be even greater than a Xiantian realm martial artist and Revolving Core martial artist in the South Horizon Region. Especially since this Zhuan Bixian was a master listed on the Destiny Decree.\n As the red-clothed old man spoke, a handsome 17 to 18 year old youth stepped down from the stairs. He faintly looked over Lin Ming and the red-clothed old man, then said, “I am Grandmaster Zhuan’s disciple. Grandmaster’s time is precious, so if you have any precious treasures that you’d like to trade with, please bring them out for me too look at.”\n This handsome youth was young, but his tone of voice was quite arrogant. His words carried a hint of superiority and impatience. In truth, this was also understandable. During the past days, dozens of guests had come to the Heavencraft Pavilion to personally request the skyflower stones. Every time this happened, this youth would have to come downstairs to meet them. He’d run down here over and over again, yet no one had been able to bring out anything that could attract his attention. How could anyone else not be impatient at this point?\n The red-clothed man laughed, thinking little of it. He sent a true essence sound transmission towards the handsome youth. If he dared to come here to buy skyflower stones, then he naturally had to have some valuable possessions to trade with, and was currently listing them out to the youth.\n After the handsome youth finished listening to the red-clothed old man, his face changed and he icily said, “I apologize, but my Master already has many of these things, and has no interest in obtaining any more of them. In fact, his are even more precious.”\n The red-clothed old man’s smile froze on his face. The handsome youths haughty and indifferent tone obviously brooked no room for negotiation.\n Lin Ming watched all of this happen while thinking about it. He’d expected this. After all, a Revolving Core martial artist wouldn’t have any interest in the possessions of a Xiantian martial artist.\n “And you?”\n The handsome youth glanced over at Lin Ming. When he saw that Lin Ming only had a Revolving Core level of cultivation, he didn’t hold out much hope that Lin Ming would have anything interesting.\n Lin Ming was silent for a moment. He’d been thinking about what items he could bring out that would interest Zhuan Bixian. In fact, he did have a great number of incomparably valuable treasures that could interest him. For instance, the heaven-step Demon God’s Bone, the Concept of Fire jade slips from Timeworn Phoenix City, the remaining six drops of Ancient Phoenix Blood, the Void Tempered Root, the Five Color Fruit, and so on.\n However, it was naturally impossible for Lin Ming to take these items out. And even if he did, it wasn’t something that just some skyflower stones could possibly trade for.\n After deducting these items, Lin Ming’s leftover possessions weren’t very valuable.\n Seeing that Lin Ming hadn’t spoken, the handsome youth appeared a bit annoyed. “Do you have anything or not? If you don’t, then please don’t waste my time; I’m very busy.”\n As Zhuan Bixian’s direct disciple, the handsome youth had a bit of a sense of superiority. Lin Ming didn’t seem much older than him, and no matter what angle he looked at it from, it was impossible that someone so young could be a true customer of the skyflower stones. This sort of top alchemical material could normally only be purchased by an older, more powerful alchemist.\n Lin Ming faintly smiled, finally remembering something. He replied, “I do have something, but I fear that you won’t be able to recognize it, and thus won’t be able to complete the transaction.”\n The handsome youth deeply frowned. He glumly said, “I might be young, but I’ve followed Master ever since I was a child. I’ve had to remember a massive number of materials every day. I’ve read countless ancient books detailing heavenly materials from the four Divine Kingdoms. Underneath the heavens and earth, I dare to say that there’s nothing I won’t be able to recognize. If I can’t recognize something, then that item would be something that even a Divine Sea Supreme Elder wouldn’t want to have, and you naturally wouldn’t either. If you have anything then take it out. I fear that whatever you think might be precious and rare, as you’re saying, will just be an ordinary good in my eyes!”\n The handsome youth had a good deal of experience and insight, otherwise Zhuan Bixian would never have sent him here to supervise the transaction.\n “Alright.” Lin Ming nodded, and calmly took out a jade box from his spatial ring. When he opened the jade box, one could see a red plant with a meat-like consistency. On top of its roots was a distorted face; it looked like a ghost that was being tortured.\n Underneath the face was a fist-sized crown of meat that was pulsating like a rapidly beating heart. The entire plant looked like a mouse that had just been born; it’s flesh was a light yellowish-pink, and there were also some light hairs decorating it. It was an atrocious thing that was quite difficult to look at.\n Zi zi zi!\n When the handsome youth saw this plant he paused, completely stunned. Was this a plant or an animal? How could something grow into such a disgusting, nauseating appearance? And what was this even called? It was simply to bizarre to the extreme.\n “This item, would Grandmaster Zhuan need it? I’d like to ask you to appraise it for me.”\n Lin Ming pushed the jade box forwards the handsome youth. This plant was the 10,000 Year Old Corpse Grass that Lin Ming had found in the Eternal Demon Abyss.\n 10,000 Year Old Corpse Grass was similar to caterpillar fungus from the mortal world. It was a parasitic plant that would attach itself to the corpse of an Emperor level powerhouse, and would then use the skeleton as nourishment. As it grew, it would have to constantly devour the vitality of martial artists in order to mature.\n When Lin Ming had adventured into the Eternal Demon Abyss, he’d seen Highlord Sandlight and Higbnhlord Sky Eye trick and kill their companions, turning them into flesh and blood sacrifices for the 10,000 Year Corpse Grass. They did so in order to feed the plant until it was satiated, and to let it then enter a deep hibernative state where it would be easier to capture.\n Finally, Highlord Sandlight and Highlord Sky Eye had tried to kill Lin Ming, and were in turn turned into nourishment for the 10,000 Year Corpse Grass. Thus, the 10,000 Year Corpse Grass had fallen into Lin Ming’s hands.\n This was something that could only grow in the strange environment of the Eternal Demon Abyss. It was the same as extinct within the entire Sky Spill Continent.\n Mainly looking at its wonderfully ugly appearance, coupled with the screeching and harsh sounds it emitted, this created an absolutely shocking effect that left the handsome youth speechless.\n In fact, not only was the handsome youth dumbfounded, even the purple-veiled woman and the black-clothed old woman were bewildered. They were both high level figures within the Heavencraft Pavilion. They were both well read, and had experiencd with a great number of treasures before.\n Still, they’d never seen something like this.\n Lin Ming asked, “What does Young Hero think of this?”\n The handsome youth didn’t reply for the longest time. He didn’t even know what this thing was called, much less how valuable it was, so how could he possibly reply to Lin Ming.However, what he could determine from this thing, was that he sure was an animal or plant, it had an extraordinary powerful blood vitality! If it were used to refine a medicinal supplement towards one’s life force, it would certainly have miraculous effects.\n In the face of Lin Ming’s question, the handsome youth was left embarrassed. He had just spoken so proudly of his skills and with such gusto too, and yet in the blink of an eye he encountered something he couldn’t identify. The loss of his face here had been immense.\n The handsome youth grit his teeth and said, “I’ll look for my Master.”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-772","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
