{"id":54857,"no":912,"title":"Chapter 909 Sixth Opening of the Magic Cube","content":"Chapter 909 – Sixth Opening of the Magic Cube\\n\\n …\\n\\n …\\n\\n …\\n\\n The dozens of miles of chaotic and convoluted roads within Skysplit Tower had all lost their meaning underneath Lin Ming’s steps. He flashed through in just a few fleeting moments, leaving nothing behind but a phantom of thunder!\\n\\n “Transmission array! I’ve arrived!”\\n\\n As the old Imp saw that transmission array, his eyes brightened with joy. He would already be lucky to escape from here with his life; how would he still care about his battle spirit being weakened?\\n\\n The battle with Lin Ming had already cost him 200-300 years of his lifespan. But even when this was taken from the 1000 years of life remaining, he still had a great deal of time to live. How could the old Imp possibly give any of this up?\\n\\n Hundreds of miles would only take a few breaths of time for an Emperor level powerhouse to travel. But with a dark killing star chasing from behind, the old Imp simply wouldn’t give him that much time.\\n\\n But as he turned his head, he saw Lin Ming grasping the Great Desolate Blood Halberd, flitting forwards with the speed of ghosts and gods. He had already caught up to him!\\n\\n “What!?!? How could you be so fast!?” As the old Imp saw Lin Ming barreling towards him, both of his eyes widened like full moons. A look of disbelief flashed across his face. He had run out for just one or two breaths of time, and yet he was overtaken by Lin Ming already? Was this kind of speed even possible?\\n\\n “Wait… wait wait wait!” The old Imp’s eyes nearly popped out of his head with despair. He anxiously blurted out, “I don’t have any enmity or injustice with you, I was only helping out others for some wealth. I was only working for Luosha and I have no conflict of interests with you. If you let me go then there are massive benefits I can give you. I can teach you the High Chaos Devil Arts of my Imp race, and I can tell you where the greatest treasures of our Imp race are located! I can even give you massive amounts of Demon God Bones! If you kill me then you will only be able to obtain the items in my spatial ring, and as for all of those hidden treasures I just mentioned, you will never be able to obtain them, even if you search my soul. My soul force is powerful. Before I die, I can definitely self-destruct my spiritual sea. If you kill me, you will not obtain any of my secrets at all!”\\n\\n The old Imp immediately threw out several conditions that he thought were quite tempting. Especially the High Chaos Devil Arts; he believed Lin Ming would be particularly interested in that. The High Chaos Devil Arts was a soul attack technique. The old Imp discovered that even though Lin Ming had a strong soul force, he still hadn’t cultivated any soul attack martial skills. If he had this High Chaos Devil Arts then he could increase his number of attack methods.\\n\\n Hearing the old Imp’s conditions, Lin Ming only chuckled, “I don’t want any of that. All I want is one thing.”\\n\\n “What do you want then?” The old Imp’s mind raced. As long as Lin Ming was willing to put forth some conditions then there would be hope and he could bargain with him. If the old Imp could keep his life, then giving everything he had to Lin Ming would be worth it.\\n\\n Lin Ming grinned. “I only want… all of your blood essence. I wish to use it to open something.”\\n\\n Steppes Master Luosha’s body had disintegrated to nothing in the grandmist space and had been completely destroyed; there was no blood essence left over to open the Magic Cube with. Fortunately, the old Imp was still here. As a three-star Demon Emperor, his blood essence was of a higher quality anyway.\\n\\n “You are seeking death!”\\n\\n The old Imp’s heart burned with a rage. If all of his blood essence was drawn out then his fires of life would also be extinguished. This Lin Ming was simply playing with him.\\n\\n “Then I’ll bet everything against you! Let’s perish together!”\\n\\n The old Imp burst out with a loud roar, suddenly biting down on his tongue and spitting out blood essence. Behind him, the chaos demon spirit phantom appeared once more, except this time it was much weaker and fainter than before. The High Chaos Devil Arts were his life’s greatest supernatural power, but this strongest soul attack of his was actually suppressed by Lin Ming. Now, he could only use material attacks.\\n\\n “Heavenly Demon Suppression!”\\n\\n The old Imp stretched out a withered palm and slashed at Lin Ming. Lin Ming raised the Great Desolate Blood Halberd and the Prime Emperor Lotus Flower bloomed once more. He intended to use the force field to avoid the old Imp’s true body and attack the chaos demon spirit phantom behind him.\\n\\n Peng!\\n\\n Cracks began to appear in the chaos demon spirit phantom behind the old Imp; this caused the old Imp’s attack to weaken by over half.\\n\\n By not fully activating the Prime Emperor Lotus Flower with his complete strength, this left enough energy for Lin Ming to attack.\\n\\n “Concept of Thunderfire – Penetrating Rainbow!”\\n\\n A highly compressed power of thunder and fire crazily gushed out from the Heretical God Sprout. The Great Desolate Blood Halberd came falling down, crashing into the chaos demon spirit phantom.\\n\\n In that instant, the scene was similar to sledgehammer striking a thin pane of glass. The chaos demon spirit phantom directly exploded, and Lin Ming’s Great Desolate Blood Halberd continued with vigor, crashing into the old Imp’s chest.\\n\\n The old Imp’s protective true instantly exploded as Lin Ming’s halberd smashed into his chest, creating a large dent and forcing the old Imp to vomit out a mouthful of blood.\\n\\n As this strike succeeded, Lin Ming didn’t give his enemy a chance to escape. The Prime Emperor Force Field dispersed, and he waved the blood halberd in his hands, space cracking around it.\\n\\n “Law of Annihilation, Chain of Stars!”\\n\\n Ca!\\n\\n Countless space fragments stabbed into the old Imp’s body like innumerable sharpened knives. Blood splashed into the air. The old Imp’s supernatural powers had been shattered by Lin Ming’s battle spirit, and his own battle spirit had fallen by two small boundaries because of it. He had been injured in the grandmist space and his origin of life was greatly damaged. Now that he faced Lin Ming, who his most skilled soul attacks were useless against, he simply didn’t have the strength to resist.\\n\\n “You…” The old Imp’s face was covered in blood. His body was like a broken water bag filled with space shards. He looked like a grieving spirit that had been dismembered during life; it was beyond miserable.\\n\\n “If you want me to die, then I won’t let you be any better off!”\\n\\n The old Imp fiercely slammed down on his tongue, directly biting it off. He spat out blood essence as energy erupted from his body! He wanted to burn all of the blood essence within him, so that even if Lin Ming killed him, he still wouldn’t have any blood essence to open the Magic Cube!\\n\\n And an Emperor level powerhouse, even if their body was crushed, could instantly mobilize the energy in their body even if they had just a small amount of consciousness left over. Wanting to instantly kill them wasn’t easy.\\n\\n Lin Ming sneered as he saw this. His fist came pounding out, surrounded by a dim silver gray light. This was his grandmist battle spirit.\\n\\n “Concept of Stagnation!”\\n\\n At that moment, the flow of time around the old Imp suddenly slowed down. He felt as if his body had been petrified, and even his thoughts slowed down. The energy circulating in his meridians slowed down to a crawl. He wanted to burn all of his blood essence to commit suicide, but he lacked the force to do so!\\n\\n The old Imp’s eyes widened with unwillingness and despair.\\n\\n The Concept of Time… he had comprehended the Concept of Time…\\n\\n Body Tearing Bone Shattering Fist!\\n\\n Peng!\\n\\n Lin Ming’s fist smashed into the old Imp’s forehead and thousands of vibrating true essence filaments imbued with his grandmist battle spirit broke into the old Imp’s body. All of the old Imp’s meridians shattered, and even his spiritual sea collapsed!\\n\\n With Lin Ming’s current understanding towards the Concept of Stagnation, he could bring the flow of time to nearly a standstill for a split-second. It was enough to completely kill the old Imp and even disintegrate his soul.\\n\\n No matter how powerful the vitality of a Demon Emperor was, they were finished once their spiritual sea shattered.\\n\\n Plop!\\n\\n When the effects of the Concept of Stagnation ended, the old Imp fell onto the ground like a pile of crushed meat, blood splashing everywhere.\\n\\n As Lin Ming saw the old Imp thoroughly die but still retain 90% of his blood essence, he relaxed. If the old Imp had really burned off all his blood essence, then that would really have been troublesome. In order to open the Magic Cube again, he would have to find some other Emperor level powerhouse in the Holy Demon Continent and kill them. But Lin Ming wasn’t a bloodthirsty killer. He needed a reason to kill others – he wouldn’t slaughter innocents.\\n\\n “I never thought that the Prime Emperor Force Field obtained through the Road of Emperor could combine with the Asura Force Field and Death God Force Field, and massacre Emperor level powerhouses in such a manner. In the grandmist space, all Laws are annihilated, all energy is annihilated, and even all life and matter is annihilated, forcing all to return to the nothingness of chaos. But what a pity, this is truly a thorough killing method. After killing someone, nothing will be left behind. Even a spatial ring will be annihilated…”\\n\\n Before Lin Ming obtained the Prime Emperor martial intent, he never thought that the so-called ability to massacre Emperor level powerhouses would be like this.\\n\\n “I can’t indiscriminately use this killing method too much. Besides some tougher Saint artifacts, nothing else would remain.” Lin Ming shook his head. He hadn’t fused the three martial intents together, he had only superimposed them on top of each other. The power was already very strong, and in addition with the grandmist battle spirit fused into it, and the support of the Heretical God Force and the combusting Ancient Phoenix blood, it was able to massacre all Emperor level powerhouses weaker than himself.\\n\\n As for those opponents that were stronger than him or were equally as strong as him, the grandmist space could still weaken their strength, increasing his chances of victory.\\n\\n To weaken an enemy’s offensive power and defensive power by 60-70%, the result of a fight could be imagined. But, the only problem was that stimulating the complete Heavenly Demon martial intent consumed a massive amount of true essence. It was not easy for Lin Ming to do.\\n\\n Lin Ming took out a small jade bottle from the Extreme Violet Ring and received all of the old Imp’s blood essence into it. Then, he wiped this blood essence onto the area of his chest where the Magic Cube was.\\n\\n Until now, Lin Ming still couldn’t activate the Magic Cube with his strength. He could only let the Magic Cube act as a passive form of defense.\\n\\n Lin Ming was very clear that the Magic Cube was a divine treasure that countless powerhouses within the Divine Realm had desperately struggled for, even paying with their lives in the process. Its function was certainly not so simple as holding soul fragments. As for what other uses it had, that still remained unknown to Lin Ming.\\n\\n Hiss… hiss…\\n\\n The old Imp’s blood essence was absorbed by the Magic Cube. In the next moment, Lin Ming felt a bit dizzy before he arrived at the space within the Magic Cube once again.\\n\\n Since the time when Lin Ming killed a Life Destruction powerhouse to open the Magic Cube, over six years had passed!\\n\\n In these six years, Lin Ming’s strength had crossed over the Life Destruction realm and reached the Divine Sea! It had to be known that Lin Ming had only obtained the Magic Cube when he was 15 years old. In the 10 years since then, Lin Ming had cultivated from Body Transformation to the Revolving Core realm in four years. But for his strength to rise from Life Destruction to the Divine Sea, that had taken a full six years. It was obvious just how difficult that step was to take!\\n\\n The space within the Magic Cube was still dim and hazy as before. Countless soul fragments floated around like stars, slowly orbiting a central sphere of light. It looked like a wonderful and strange galaxy.\\n\\n Lin Ming swept his perception through the area and quickly found two of the largest soul fragments. They were over a foot wide, much larger than the head of an average person.\\n\\n These two soul fragments were naturally left behind from the Ancient Devil that resided within Yang Yun’s body. They contained exquisite Time Laws, Darkness Laws, and also fairly complete memories. This likely included the Ancient Devil’s weaknesses or secrets of the Eternal Demon Abyss.\\n\\n The soul fragment that Lin Ming wished to choose this time was naturally a soul fragment of the Ancient Devil.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-909","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
