{"id":54878,"no":933,"title":"Chapter 929 To Another Level","content":"Chapter 929 – To Another Level\n …\n …\n …\n “The Heretical God Sprout grew.”\n Lin Ming was overjoyed as he saw the Heretical God Sprout that had grown by an inch. He could clearly feel that the Heretical God Sprout’s strength increased by a great deal. This would help him to perceive the Concepts of Thunder and Fire to an even higher degree in the future. It was as if there was some divine power assisting him. After he ascended to the Divine Realm, chances were likely that he would join the Ancient Phoenix Clan and receive the direction of Fairy Feng. At that time, with the support of the Heretical God Sprout, his strength would surely rapidly rise.\n After the Purple Lion Thunder Source was completely absorbed, lightning began to twinkle above the Heretical God Sprout. Lin Ming closed his eyes and sensed within himself, nodding with satisfaction. The Heretical God Sprout’s control of energy was far better than what he had imagined. After the Purple Lion Thunder Source entered the Heretical God Sprout, most of its energy was absorbed by the Heretical God Sprout and the control of that energy also fell into Lin Ming’s hands.\n If the Purple Lion Thunder Source’s spiritual wisdom was a general, then the energy of its body was the army. But now, all military power was held by Lin Ming.\n This feeling of controlling all was very gratifying. As Lin Ming’s strength grew, the chances of the Purple Lion Thunder Source betraying him would also become increasingly low.\n “Demonshine, after absorbing the Purple Lion Thunder Source, I feel as if my entire body is flooded with energy. Breaking through to the fifth stage of Life Destruction shouldn’t be difficult!”\n “You want to break through to the fifth stage of Life Destruction? You haven’t even entered the fourth stage of Life Destruction for a full year, and you want to break through to the fifth stage? Your cultivation has been far too fast recently. If you don’t suppress this speed it’ll cause your foundation to be shakier and make it harder for you to advance in the future.”\n A general Emperor level talent would step into Life Destruction at 50 years of age. From that point on, they would pass a stage of Life Destruction every 7-8 years, finally reaching a maximum of six or seven stages.\n But for Lin Ming, he nearly crossed a stage of Life Destruction every year. In less than five years he had crossed four stages of Life Destruction and was about to cross the fifth.\n Lin Ming’s cultivation had risen too quickly, and more importantly, for these last five years, Lin Ming hadn’t experienced true combat too much. Without tempering himself in the fires of the battlefield, this would cause his comprehension of Laws and martial skills to be flawed and imperfect, resulting in further instability within his foundation.\n Lin Ming said, “I know, but I can still make up for it in the future. As long as I break through to the Divine Sea realm and calmly cultivate, I’ll be able to calm down and solidify my energy. Although it will be a great deal of work, I’ll face Yang Yun soon and I must increase my strength as much as possible before then. A year from now, Yang Yun’s strength will absolutely surpass Whitedemon’s. With my current cultivation, even if I absorb the Purple Lion Thunder Source, I don’t think I’ll be able to defeat him.”\n “Indeed. Yang Yun is proficient in the Concept of Time. If he changes the flow of time and seals himself up within a space, he might be able to train for ten years in this one year. I fear he might even break into the middle Divine Sea.”\n Demonshine said with a bit of worry. Eight stages of Life Destruction, breaking into the middle Divine Sea, as well as Yang Yun’s cultivation methods not being too bad to begin with, if all of these factors were combined together then Lin Ming truly was in a dangerous position.\n “Yang Yun can indeed change the flow of time, but to change the flow of time in an enchantment requires a martial artist to constantly revolve the power of Laws to maintain it. If he wishes to put forth his full heart and effort, completely investing in cultivating his supernatural powers, it’s actually difficult to maintain the change in time flow to a 10 to 1 degree.”\n A martial artist had to wholeheartedly devote their attention to cultivating. The reason that Lin Ming’s ethereal martial intent was so amazing was because it allowed him to eliminate all distractions from his mind.\n The best condition for cultivation was to remain in a selfless state, free of all distractions. To cultivate in such a manner and also maintain the enchantment was extremely difficult. When Old Man Good Fortune had done so in the past, it was because he had reached a bottleneck in his cultivation for thousands of years already. The so-called closed door seclusion was actually sitting in meditation, self-cultivation his soul, becoming aware of the Laws, and tempering his will. It was incomparable to what Yang Yun needed to do.\n In order to cultivate in a 10:1 time flow enchantment, he would have to have another powerhouse devote themselves to maintaining the revolution of Laws. This was the only way in which he would be able to completely invest himself in cultivating. But wasn’t it easier said than done to find a powerhouse like that, who would also serve him for so many years?\n In truth, Lin Ming could accomplish his. With his current understandings into the Concept of Time, he could also achieve this point to a degree. Although he couldn’t change the flow of time to a 10:1 ratio, 5:1 or even 6:1 wasn’t a problem.\n Lin Ming received the grandmist space and flew straight to the cave dwelling that the Eightfall Thunder Emperor had opened in the past.\n This cave dwelling was located on one of the floating islands. But, this floating island was actually not located in the 100 mile Thunder Dominion, but within the 90 mile Thunder Dominion.\n This was the only floating island within the 90 mile Thunder Dominion. As for the islands in the 100 mile Thunder Dominion, even the Eightfall Thunder Emperor didn’t have the ability to approach them.\n Lin Ming flew into the Eightfall Thunder Emperor’s cave dwelling. The plain and simple cave revealed an ancient and timeless atmosphere, no different from the last time that Lin Ming was here. The stone tablet within the cave dwelling stood tall, with the same words engraved on it as before.\n “If fate will not accommodate my clan, then I shall break the shackles of fate. If the heavens will not accommodate my clan, then I shall go against heaven’s will and cut down all immortals!”\n These words contained a thrilling sword intent, causing those who saw it to feel awe in their hearts.\n As Lin Ming’s boundary grew, he could increasingly feel just how powerful the Eightfall Thunder Emperor of the past was.\n “Since ancient times, several unrivalled powerhouses appeared from the Sky Spill Continent that have been given the highest under the heavens title. Even amongst all of them, the Eightfall Thunder Emperor was outstanding.\n The so-called highest under the heavens was someone that had the ability to instantly kill off all other powerhouses from their era. This was not merely defeating them, but killing them.\n Before the appearance of Yang Yun and Whitedemon, even Old Man Good Fortune wasn’t able to achieve this degree of strength. This was why he was only considered the quasi strongest under the heavens.\n Among the several highest under the heavens that had appeared throughout the years, there existed the strong and the weak amongst them. Whitedemon could only be considered as being on the weaker end.\n Lin Ming sucked in a deep breath and sighed, “Even though I absorbed the Purple Lion Thunder Source, I shouldn’t be much stronger than him. Defeating him should be easy, killing him is extremely difficult though. If this were in ancient times, I could only be considered the lowest level of the highest under the heaven individuals within the Sky Spill Continent.”\n In terms of pure quantity of peerless powerhouses, the Sky Spill Continent was far inferior to the Holy Demon Continent. Correspondingly, the Holy Demon Continent’s highest under the heavens was much stronger.\n And above the Holy Demon Continent, there was also the endless sea that existed around the two continents. That boundless area was over 10 times larger than the Sky Spill Continent and Holy Demon Continent combined! The number of powerhouses that existed there could be imagined.\n Even such a vast world was an insignificant speck of sand in the three thousand boundless universes. There were countless worlds and dimensions that were far more powerful than the Sky Spill Continent.\n And beyond all of that, there was the far more terrifying Divine Realm!\n As Lin Ming thought of this, he deeply felt that the road he walked upon still had a near infinite distance to go. Becoming the highest under the heavens within the Sky Spill Continent wasn’t anything special.\n After his battle with Yang Yun, he brought to completion all of his ties to this world. He would ascend into the Divine Realm, stepping onto a wider stage and meet even greater challenges.\n Lin Ming set down an array formation in the Eightfall Thunder Emperor’s cave dwelling. With his current understandings into the Concept of Thunder, he was already able to isolate the ruinous lightning from the 90 mile Thunder Dominion.\n The 8000 Mile Black Swamp was a land filled with great dangers. There would always be some risks if Lin Ming were to cultivate here. When laying down array formations, he did so diligently and meticulously.\n After a full day passed, Lin Ming fused the Laws of the grandmist space into the array formations he recalled from the Ancient Devil’s memories, arranging three layers of great formations. He sat down on the Eightfall Thunder Emperor’s stone bed and took out the 12 thunder dao fruits as well as the 20 top grade spirit essence stones from his spatial ring.\n Of these 12 thunder dao fruits, one of them had already been eaten up by Lin Ming, leaving behind only the peel that contained the marks of the mysterious Thunder Concepts. Up until now, Lin Ming hadn’t managed to find the time to thoroughly perceive them.\n This time, Lin Ming picked up a thunder dao fruit and used a dagger to slowly peel off the skin near the stalk, revealing a red fruit flesh that glowed a beautiful red.\n The fragrance of wine drifted upwards, the aroma sharp and refreshing. It smelled like millennium aged wine, and the highest quality aged wine at that.\n “Mm? This thunder dao fruit seems different from the one I ate before. That fruit was cream colored and white, but this one seems bright red like flesh and blood.”\n The crystalline fruit flesh actually had bright red vessels that ran through it. The intoxicating aroma assaulted his senses, tantalizing and sweet.\n Lin Ming cut off a piece of the fruit with his dagger and gently touched it with his fingers. It was bouncy and thick. He swallowed it down. As the fruit flesh entered his mouth, it melted without him even needing to chew. The fragrance dissipated down his throat, turning into a refreshing energy that filled his limbs, flowing to his heart, his dantian, and his head.\n In that moment, Lin Ming felt as if he was drunk. His mind was dizzy and his arms and legs turned soft. All of his bones loosened, as if he would melt to the ground.\n The second thunder dao fruit had an effect that was completely different from the first. It caused Lin Ming to feel as if he were floating on clouds; light and satisfied.\n “What a strong and strange medicinal efficacy. It seems every thunder dao fruit is different.”\n Lin Ming took advantage of the time before the medicinal efficacy of the thunder dao fruit faded and began to revolve a Divine Realm thunder cultivation method that was left behind on one of Jiang Ziji’s jade slips – ‘Thunder Sovereign Edict’. Within Jiang Ziji’s great collection, it was of the few cultivation methods that could be practiced without the Electric Violet Kirin bloodline.\n Thunder energy mixed with true essence, circulating around and around again.\n Lin Ming hadn’t entered the ethereal martial intent, but although he was half-drunk and half-awake and his mind seemed to be blank, his thoughts were incomparably clear. Although his actions were slow, energy crazily swelled up within his body.\n This strange condition was similar to when a mortal martial artist drank wine to utilize the drunken fist. It was a cultivating state that was superior to the ethereal martial intent, similar to being hypnotized. In this state, there was no fear, no astonishment. In this state, one felt as if they had dug out their full potential and that any impossible matter had become possible.\n Two hours. \n Four hours.\n Lin Ming digested the energy from the thunder dao fruit. As he was finished absorbing the energy, he would wake up from that strange state and eat another slice of the thunder dao fruit’s bright red flesh.\n This fruit flesh contained an extremely great deal of energy. A normal thunder-attribute martial artist would be able to eat no more than 4, maybe 5 slices, otherwise their bodies would burst apart from all the energy. To eat more, they would have to discharge all the excess energy, but doing so was a complete waste.\n Lin Ming didn’t have such a problem. The Heretical God Sprout had risen to another level and it swallowed up all the energy it was offered.\n During such a high intensity training period, Lin Ming’s understandings towards the Thunder Laws became increasingly clear. Light shimmered around his body, brilliant and dazzling, as if he were about to turn into an immortal. And behind Lin Ming, dao diagrams began to partially reveal themselves, looming over him. They were abstruse and mystical, etched with lines that seemed to contain the most mysterious Thunder Laws.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-929","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
