{"id":54891,"no":946,"title":"Chapter 942 Coiling Martial Divine Furnace","content":"Chapter 942 – Coiling Martial Divine Furnace\\n\\n …\\n\\n …\\n\\n …\\n\\n Yang Yun’s expression was fierce. After fusing with the Ancient Devil’s soul, he was no longer the temperate and chivalrous person he once was. He had truly become demonic.\\n\\n A bass roar rang out and he stabbed his finger out. He aimed between his eyebrows and thrust downwards!\\n\\n Between Yang Yun’s eyebrows was his third eye, the Blood Law Eye. But now, Yang Yun had actually crushed this eyeball apart with his finger!\\n\\n Peng!\\n\\n The Blood Law Eye that was wrapped in a crystalline layer suddenly burst apart. A faint trace of blood essence swelled forth, flowing dark crimson.\\n\\n To pierce through one’s own eye required a ruthless resolve. Yang Yun’s face twisted as his aura suddenly soared upwards.\\n\\n After the Blood Law Eye was broken, the blood essence energy that dissipated from it was completely swallowed into Yang Yun’s mouth. His body began to change, becoming larger and thicker. Dragon-like muscles wrapped around his body. From his back, red tentacles burst out, freely waving about. His skeleton and muscles were dyed with a bright blood red light as the red tentacles extended thousands of feet into the sky before they completely sunk into his body.\\n\\n Yang Yun’s cultivation had infinitely approached the middle Divine Sea realm. It could even be said that he had managed to step into that realm for a brief period of time.\\n\\n He had to destroy the Blood Law Eye and deplete the supernatural powers that he had arduously cultivated for so many years. Only then could he completely erupt with the energy of the Great Blood Refining Art, causing his Great Blood Refining Art to forcefully enter completion!\\n\\n If Yang Yun had cultivated the Great Blood Refining Art to the highest level he wouldn’t have been forced to this step. But he was severely wounded and was suppressing the injuries with an arcane technique. He now also knew that Lin Ming thoroughly comprehended all of his weaknesses. Moreover, he was covered in this grandmist space. Whether it was time, terrain, or individually, Yang Yun was in the worst state possible. If he didn’t fight Lin Ming with every ounce of strength he had, he really would perish here.\\n\\n “I destroyed my own Blood Law Eye, ruining three years of my hard work just so I can have the power of blood in my body reach the limit. But if I can kill you, everything I’ve done will be worth it!\\n\\n To kill Lin Ming and obtain his secrets was Yang Yun’s only chance of ascending and breaking past the Divine Sea, then the Divine Transformation, and then becoming an overlord of the Divine realm. Yang Yun’s talent by itself was nothing when placed within the endless universe. There were countless people like him, more people than there were grains of sand in the desert. And yet, they all died on their road of martial arts. To them, reaching the peak of martial arts was only a dream.\\n\\n Yang Yun violently bit down on his tongue and spat out a mouthful of blood. This blood turned into a blood rain that sprinkled down.\\n\\n The sky filled with the blood rain. Ghostly wails filled the air, as if a trillion ghosts were weeping through the heavens and earth.\\n\\n “Slaughter Demon Blood Rain! That’s a vicious and cruel martial skill within the Great Blood Refining Art. To use this move, you have to burn away your own blood essence and life force, costing a hundred years of lifespan!”\\n\\n Lin Ming’s mind flashed. He knew every single one of Yang Yun’s tricks from start to finish. Life was extremely precious to a martial artist; they would only use an ability that cost life at their most desperate moments. And now, Yang Yun was using such a martial skill to bet everything he had against Lin Ming.\\n\\n Every drop of the blood rain contained a primordial soul; this was from the countless beings that Yang Yun had killed to practice his Great Blood Refining Art and it contained endless resentment. If this blood rain were able to invade the divine soul it would make a person go crazy, falling into insanity until they died.\\n\\n The blood rain fell like a torrential storm, recklessly pouring into the grandmist space.\\n\\n The grandmist space annihilated all energy and annihilated the Laws of all existences. This naturally included blood.\\n\\n With a sparking sound, drops of blood were burned away as the endless resentment was destroyed, vanishing into nihility! However, the grandmist space wasn’t invincible. To keep up its annihilating strength also consumed Lin Ming’s energy.\\n\\n As Yang Yun saw large traces of his blood rain being swallowed up, he didn’t feel pained at all. He bit on his tongue once more and spat out three more masses of blood. These three masses of blood were each 100 years of his life. Combined with the previous mouthful of blood, Yang Yun had instantly burned away 400 years of his life.\\n\\n More and more blood rain appeared, flooding downwards, it’s momentum increasing every second. Finally, it became like a waterfall of blood pouring down from the heavens!\\n\\n As the blood rain poured down on the grandmist space, the grandmist space began to contract, shrinking more and more. As for Lin Ming, he felt energy rapidly depleting from his body!\\n\\n The grandmist space was powerful, but its consumption of energy was also equally terrifying. If it weren’t Lin Ming and instead a normal martial artist, let alone massacring Divine Sea powerhouses, merely attempting to activate the grandmist space would suck their body dry of energy.\\n\\n As the grandmist space was suppressed, Yang Yun felt his own strength returning to him, flooding back into him like a returning tide. At this time, after displaying arcane techniques without caring about the cost, he had finally restored his combat strength to the strongest point it had been so far.\\n\\n “Hahaha! This is my greatest strength! Now, I’ll show you just how strong I am! If it weren’t for your villainous plot ruining my Great Blood Refining Art from reaching completion, I would’ve fought with you in such a condition in just a few months! But now, I’ve spent a total of 1000 years of life in order to reach this state!”\\n\\n A middle Divine Sea martial artist was far different from the Life Destruction martial artist; they would have 4000-7000 years of life. But when Yang Yun was young, in order to rapidly increase his strength, he had used secret demonic arcane skills under the supervision of the Ancient Devil, costing him 2000 years of his life. Now he spent another 1000 years of his life in a single go. His fires of life already begun diminishing; it was equal to him reaching middle age. If he couldn’t kill Lin Ming and find some way to restore his life force, his potential would gradually fade away and he would never be able to make another breakthrough in his cultivation.\\n\\n It could be said that Yang Yun had burned away every path to retreat.\\n\\n Yang Yun revolved his energy to the limits, erupting with the strength of a middle Divine Sea martial artist as he slashed out with his sword. With his eighth stage Life Destruction as a foundation in addition to all the resources of the Ancient Devils as well as the Divine Realm cultivation methods he had practiced, it was incomparable to what a martial artist from the Sky Spill Continent could accomplish. He was even slightly superior to the Eightfall Thunder Emperor from tens of thousands of years ago.\\n\\n Now with an attack that contained his complete strength, the heavens and earth seemed to lose their luster. Wind and clouds vanished and endless blood ponds from an Asura hell seemed to appear in the world.\\n\\n Facing this strike, Lin Ming shouted out, “Yang Yun, even if you burn away all of your life, all you have studied is a second-rate cultivation method from the Divine Realm, even if you overturned the heavens just how much strength can you display? As for me, I have two different transcendent divine mights, I cultivate dual body and essence, and I also possess a grandmist battle spirit! My background, my Concepts, my will, everything I have is far from what the likes of you can compare with. You doing everything you can to defeat me only causes my blood to boil in excitement!”\\n\\n “Burn for me, blood of the Ancient Phoenix!”\\n\\n A brilliant flaming red light burst out from between Lin Ming’s eyebrows, burning the heavens and earth! Behind him, the phantom of an Ancient Phoenix appeared and soared straight into the skies!\\n\\n Lin Ming grasped the Great Desolate Blood Halberd and thrust out. Even the slaughter blood energy on the halberd was burnt away!\\n\\n Bang!\\n\\n With an earthshaking explosion, Yang Yun’s sword light was shattered by the Great Desolate Blood Halberd. But at this time, Yang Yun extracted a three-legged furnace from his spatial ring. This furnace was engraved with countless images, and among these images were an azure dragon, vermillion bird, white tiger, and black turtle. These were the four different great Saint Beasts. This ancient furnace was stained with blood as if it had passed through countless years!\\n\\n As Lin Ming saw this divine furnace, he didn’t recall anything about it. But the surrounding 50 some Divine Sea powerhouses all changed complexions.\\n\\n “That is the Coiling Martial Divine Furnace! The number one divine weapon of the Sky Spill Continent!”\\n\\n “Yes, that is indeed the Coiling Martial Divine Furnace, the saint artifact used to stabilize the destiny of the Nine Furnace Divine Kingdom. It’s quality even surpasses the Great Desolate Blood Halberd and the complete Demon Emperor Armor. It was originally in Yang Laotian’s possession, but since he died, the Coiling Martial Divine Furnace naturally fell into Yang Yun’s hands.”\\n\\n “I’ve heard rumors that this saint artifact weights 2.16 million jins. This is my first time seeing it. It’s more accurate to say that this divine furnace hasn’t appeared in the world for the last 5000 years. There has never been an event dire enough for the Nine Furnace Divine Kingdom to bring it out.”\\n\\n As the Coiling Martial Divine Furnace appeared, Yang Yun used the power of blood to wrap around the furnace and bring it smashing down at Lin Ming!\\n\\n At 2.16 million jins, this furnace was nearly four times the weight of the great Desolate Blood Halberd. And because it was refined by Yang Yun, he was able to freely control it with his thoughts and without the need to expend too much energy. This attack was similar to an ancient meteor crashing into the world. If an ordinary Divine Sea master were to be struck, their physical bodies would instantly turn to ash!\\n\\n Lin Ming’s pupils shrank. He completely opened the four of the Eight Inner Hidden Gates. After opening the four gates, his strength was still only at 2 million jins; it was simply not enough to counter the Coiling Martial Divine Furnace.\\n\\n But he still had his true essence as well as his battle spirit.\\n\\n “Grandmist battle spirit, fuse!”\\n\\n The silver gray spear-shaped battle spirit shot forth from his spiritual sea and combined with the Great Desolate Blood Halberd. Lin Ming roared out, lifted his hand and threw the Great Desolate Blood Halberd!\\n\\n Rumble, rumble, rumble!\\n\\n As the blood halberd flew, space trembled, like 10,000 thunderclaps exploding together.\\n\\n On one side was the 2.16 million jin divine furnace and other the other side was the 800,000 jin Great Desolate Blood Halberd. With both weapons flying at velocities that surpassed the speed of sound, just how terrifying would the collision be?\\n\\n Dang!\\n\\n The blood halberd smashed into the divine furnace. The sound of deafening thunder and drums filled the air, as space collapsed several miles around.\\n\\n The Coiling Martial Divine Furnace suddenly trembled as it was bounced away. But the Great Desolate Blood Halberd also ricocheted backwards. One could see that a deep dent had appeared on the surface of the Coiling Martial Divine Furnace. This had clearly been left by the Great Desolate Blood Halberd!\\n\\n As for the Great Desolate Blood Halberd, it wasn’t damaged too much. This was the power of a battle spirit. With the grandmist battle spirit supporting the Great Desolate Blood Halberd, it could be called indestructible!\\n\\n “The Coiling Martial Divine Furnace was damaged!?”\\n\\n “To use the 800,000 jin Great Desolate Blood Halberd to resist the 2.16 million jin Coiling Martial Divine Furnace, the one that was actually damaged was the Coiling Martial Divine Furnace!?”\\n\\n As everyone saw this deep dent, they felt as though they were dreaming. This was unbelievable. The number one saint artifact of the Sky Spill Continent, the founding treasure of the Nine Furnace Divine Kingdom, the divine treasure that stabilized the destiny of the nation, such a weapon was actually damaged? Just how terrifying had the impact been?\\n\\n In that split second, no one was able to respond properly. After Yang Yun threw out the Coiling Martial Divine Furnace, he didn’t bother with it any further. He grasped his blood sword and flashed in front of Lin Ming, his sword blade snapping forth like a biting viper as it shot towards Lin Ming’s throat.\\n\\n This sword pierced through the void, its speed reaching the extreme. Lin Ming coldly sneered and retreated backwards. With a flick of his right hand, a milky white thunder ball appeared above his palm.\\n\\n This was the divine thunder that Lin Ming had picked up from the 100 mile Thunder Dominion.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-942","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
