{"id":54043,"no":98,"title":"Chapter 97 - Seven Kinds of Martial Intent","content":"Chapter 97 – Seven Kinds of Martial Intent\\n\\n …\\n\\n …\\n\\n …\\n\\n Lin Ming listened to Hong Xi’s words and his heart filled with joy. Until now, he only had the ‘Foundation Spear Technique’, and could only study the foundation. If he were to have guidance, then his progress would be much quicker.\\n\\n Hong Xi said, “I once joined the army for ten years. I only started learning the spear in my ten year career. Before that, I used the sword. The spear is the king of a hundred soldiers! I have not reached the stage of Large Success in spear play, but what I have learned, I can teach you. However, before we begin, I have a question. Were you able to comprehend a special cultivation state?”\\n\\n Lin Ming paused. He didn’t expect that Hong Xi knew about this matter. He nodded and said, “Yes.”\\n\\n “I thought so. Your perception is good. This cultivation state of yours can probably be compared to the best among its kind, otherwise with your talent, it would be impossible for you to have such great results in such a short time! This is a benefit of your pure and strong heart of martial arts. But even if you have an extraordinary heart of martial arts, you still might not have that lucky opportunity to comprehend such a cultivation state. This state is called martial intent!”\\n\\n “Those who have a martial intent are very few. Even in the place like the Seven Profound Martial House where talents gather, in the last several dozen years there has only been Ling Sen! I did not expect that now there would be you also!”\\n\\n “Oh? So few?” Lin Ming suddenly understood. No wonder he had never heard of this before.\\n\\n “Yes, that is why the existence of martial intent is so mystical and mysterious, because there are too few people who are able to comprehend it. There aren’t many descriptions of it in the ancient texts, and not only that, but each martial artist’s martial intent is not the same; each has a different effect.”\\n\\n Lin Ming said, “Instructor, I don’t understand. Since Senior Apprentice Brother Ling has comprehended such a rare skill like a martial intent, and his strength is known throughout the Sky Fortune Kingdom as being invincible within his cultivation stage, why was he not selected as a core disciple? What kind of monstrous geniuses are the core disciples of the Seven Profound Martial House?”\\n\\n Hong Xi said, “Those of the Seven Profound Valleys have paid careful attention to Ling Sen. However, for him to be selected as a core disciple, he has to pass a test. Ling Sin was eventually unable to pass the inspection, so he was rejected. He had missed only one step.”\\n\\n “Mm? Test?” Lin Ming’s heart moved as he heard this.\\n\\n “Yes. Some do not conform to the rigid standards of the Seven Profound Martial House, and wish to become a core disciple through a test. When Lin Sen had faced the test, he had to defeat someone of the same age, or an older core disciple, and also reach the peak Fourth Stage of Body Transformation by the time he was 17.”\\n\\n “Ling Sen was able to defeat a core disciple who was half a year older than him. Unfortunately, his cultivation was unable to reach the peak Fourth Stage of Body Transformation before he was 17, and therefore he failed due to this.”\\n\\n “Is this because Senior Apprentice Brother Ling’s cultivation talent was not good enough?”\\n\\n “Yes. As I said, there are many different kinds of martial intent. Ling Sen’s martial intent is ‘Ashura’. In the Ashura battlefield, he can experience endless slaughter and battle. With this kind of martial intent, the main function is to enhance a martial artist’s instincts, explosive force, and killing ability. However it is not really that useful for to improve a martial artist’s cultivation. But, it does provide a few benefits in breaking through bottlenecks.\\n\\n Hong Xi said this with a look of regret. A martial artist’s combat prowess and cultivation were two different matters. Combat prowess was their strength, but cultivation was judged through stages, for instance, Body Transformation’s First Stage, Second Stage, Pulse Condensation Period, and Houtian stage.\\n\\n Cultivation was the most important factor in a martial artist’s combat prowess, but it was not the only factor. Martial skills, fighting instincts, combat skills, field experience, the degree of true essence thickness, all of these could affect one’s combat ability, therefore one could fight one above their cultivation realm.\\n\\n But, to a martial artist, their cultivation was the fundamental basis for all. If they could not improve their cultivation, then whatever your combat power really was, it would not matter. A martial artist at the First Stage of Body Transformation would never defeat someone at the Pulse Condensation Stage. This was the absolute disparity that was created through cultivation!\\n\\n Moreover, to a martial artist, their lives were inextricably linked to their cultivation. Ling Sen’s main strength was his combat ability, his cultivation was actually not very high. If he had no chance of reaching the Xiantian stage, then to the large sects, he had no value whatsoever.\\n\\n Therefore, Ling Sen was rejected!\\n\\n Hong Xi said, “If Ling Sen’s talent were increased half a step, for instance to a medium fourth-grade talent, then he would have an enormous chance of being selected to enter the Seven Profound Valleys. His ‘Ashura’ martial intent can let a person dance on the edge of life and death for a long time, and it also favors breaking through bottlenecks. This is of value to the Seven Profound Valleys. Unfortunately, the ‘Ashura’ martial intent has no advantages in helping one accumulate true essence.”\\n\\n Lin Ming asked, “Instructor Hong, does Senior Apprentice brother Ling Sen not have any more chances of being selected to enter into the Seven Profound Valleys?”\\n\\n “There is, but it is just far too difficult. One possibility is that he must break through to the Pulse Condensation Period before he is 22 years old. This is the most rigid criteria of the Seven Profound Valleys. As long as you are able to break through to the Pulse Condensation Period before 22 years of age, you may enter the Seven Profound Valleys. However with Ling Sen’s current cultivation progress, it is impossible. The second possibility is if Ling Sen is able to comprehend another kind of martial intent. It would be better if this was one which helped increase his cultivation progress. If such a thing happened, then the entire Seven Profound Valleys would value Ling Sen. A person that can comprehend two kinds of martial intent is just too rare.\\n\\n “Two kinds of martial intent? You can also have two different kinds of martial intent?” Lin Ming was surprised.\\n\\n “Mm. But it is very difficult, difficult enough to cause anyone to lose all hope. In the entire Sky Fortune Kingdom, or even the entire realm of the Seven Profound Martial House and its surrounding hundreds of thousands of miles, there isn’t a single one. I have heard about them in the ancient texts, for instance, legends passed down that told of ‘sudden enlightenment’. There is a story of a mighty power who was called Emperor Shakya, that had seven different kinds of martial intent! Three thousand years ago, he meditated under a Bodhi tree for seven days and seven nights. In his body these seven kinds of martial intent actually fused together, and Emperor Shakya underwent a great awakening and achieved supreme enlightenment. He broke the countless shackles of martial arts and reached nirvana to become a golden immortal, piercing through the martial void!”\\n\\n As Lin Ming heard Hong Xi’s story, he felt a great shock!\\n\\n Seven kinds of martial intents!\\n\\n What concept was that? Moreover, these seven kinds of martial intents had even fused into one! This kind of person was truly a mythical heavenly being!\\n\\n As he listened to the legend of the Bodhi tree, Lin Ming held an ounce of disbelief. To sit in meditation for seven days and seven nights and achieve supreme enlightenment, break the countless shackles of martial arts and pierce through the martial void, that just seemed a bit too exaggerated.\\n\\n It had to be known that in the path of martial arts; the higher you went, the more difficult it was! Some people often needed upwards of a hundred years to break through a bottleneck! But this Emperor Shakya had actually broken through the bottleneck of martial arts, and rise up countless stages at once. Wasn’t this just nonsense?\\n\\n But as he listened to Hong Xi’s description, Lin Ming began to believe. To combine seven kinds of martial intent into one, that thought alone was just far too terrifying.\\n\\n Hong Xi said, “Lin Ming, describe your martial intent to me, so I can determine what sort it is. This will be very important to your future development!”\\n\\n Lin Ming nodded and began to describe his ‘ethereal’ martial intent.\\n\\n Hong Xi mulled over this, and then said, “This ‘ethereal’ martial intent that you have should be a kind that increases your cultivation. Your consciousness leaves your body and your true essence begins to spontaneously revolve according to its own instincts. With this, the true essence can achieve a perfect circulatory path within your body. There are too many kinds of martial intent, and they are different from person to person and there aren’t also many records. This is the first time I have heard of your kind of martial intent. I cannot judge its specific effects, but looking at how your cultivation increases by leaps and bounds, the effect should be very good. Your martial intent should also be superior to Ling Sen’s. You maybe even have the possibility to be elected as a core disciple in the Seven Profound Valleys! Certainly, like Ling Sen, you must pass through the test. This test is difficult; it will depend on your martial intent to go against heaven’s will.”\\n\\n Core disciple… Lin Ming silently thought.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-97","bookId":1508,"book":{"id":1508,"title":"Martial World","description":"In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.\\n","cover":"http://cunovel.com/img/MW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/martial-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:18 AM"}}
