{"id":86711,"no":5,"title":"Page 5","content":"That’s when he finally zoned in on the conversation going on around him.\n The girl was saying, “I know, right? I heard there’s a reward for the person who outs him.”\n Trystan’s gaze snapped toward her, “Outs who?”\n Regan beamed, glad that he noticed her. Her inky hair gleamed in the dim light, falling over her shoulders as she leaned closer to him. “Day Jones. Who else? The guy’s a shadow. Every time someone thinks they got a line on him, he vanishes. Poof.” She lifted her hand, making the fingers of her fist fly open. Her dark brows rose as if it were impressive.\n Another voice spoke and Trystan turned to see Jamie, a coppery-haired girl with olive skin. “There’s a reward, and it’s huge. That rich dude said he’d offer a million bucks to the person who finds him. Something about wanting Day to sing at his kid’s birthday.” She shrugged like it was a normal thing to do. Trystan never celebrated his birthday. Actually, he spent it as far away from his dad as he could manage. It was a reminder of everything they lost, of everything he’d never have.\n Trystan’s skin prickled as ice filled his stomach. He shifted in his seat, hiding behind that cool smile he always wore. “Are you serious?” he was shocked, but he hid it like he hid everything.\n What the hell was wrong with people? Why couldn’t they admire a song and leave a guy alone?\n “Totally,” Regan replied. She laughed and turned toward Tessa behind her. “Did you see that Day-Tracker site? The one with all the leads and how they panned out?”\n Tessa laughed, “Yeah, that was awesome,” she leaned forward. “That last guy they tracked seemed like a good fit, but in the end, it wasn’t him. I was totally hoping they’d find him. I can’t wait to see what he’ll do—and what he looks like. With a voice like that, he has to be hot. The shy thing just makes him more appealing.”\n “I know, right?” Regan smiled, nodding in agreement.\n “Hey, did you see the Facebook page for Find Day?” Tessa continued, “It’s hysterical.”\n Regan nodded, smiling huge. “I know right? And the pictures were an awesome touch.” She turned to look at Trystan, adding, “It’s like the ultimate Where’s Waldo of hot guys. Girls have been uploading pics of what they think Day looks like and where they think he is. I’m totally uploading my guess later.”\n “And, what’s that?” Trystan asked, a smirk on his face. He folded his arms over his chest while they were speaking and sat up a little bit. His stomach was tangling into a knot. They were looking for him.\n Regan giggled, “Well, with a song like that there’s no question that he’s been playing for a long time. His accent sounded a little Cajun, and based on the way he plays, I’m thinking New Orleans.” She turned quickly and pointed a finger at the others, “You better not steal my idea. Post your own city.”\n “He’s not in New Orleans,” Tessa whispered as Tucker looked back at them, a clear signal to shut up, but they kept talking. “Cajun accent,” she mimicked and rolled her eyes. “What the hell is wrong with you? He’s clearly from Long Island. Did you hear the way he said his G’s?”\n Regan contested, “Yeah, but he didn’t put W’s in the middle of everything. There’s no way he’s from around there. You’d hear it.”\n “Scott!” Tucker yelled. “Silence your posse or get out.”\n Trystan stood, heart racing, all too happy to flee. The girl’s looked up at him as he rose. “Mr. Tucker, you know as well as I do that there’s nothing that will get them to stop talking, short of the apocalypse, and even then I imagine that they’ll be pointing out which zombie is wearing what, so I’ll take you up on your offer and leave.” The girl’s watched him slack-jawed, admiring him and then bursting into giggles at the zombie fashion reference.\n Trystan headed out the back door, his head spinning. People were looking for him, trying to discover Day Jones’ identity. The thought never occurred to him, not in his wildest dreams. Dread pooled in his stomach as he walked to his locker and opened the metal door. Staring into space, he wondered if there was anything telling on the video—any signs of who he was or where he was. Trystan admitted he wasn’t very careful. When he made the video he was only thinking of Mari. He leaned his head against the cold metal and took a deep breath. He’d have to watch the video later to make sure there was nothing identifiable. Although he’d done it already, he felt like there was something there, something that would lead them to him. Trystan was certain that their only real clue was the YouTube account and his user name. Even if someone managed to track the IP address, it would show his neighbor, not Trystan’s home. The thought still made him squirm. That was too close.\n Trystan grabbed his leather jacket and slammed the locker door. As he headed outside, a cool burst of wind caught his jacket and Trystan tugged it shut. Night was falling. Practice was running longer and longer, as it normally did, up until the day of the dress-rehearsal. Trystan walked down the street. Car horns blared on the busy road next to him. The scent of exhaust mingled with the crisp autumn air filled his lungs.\n Passing store fronts, he walked to the diner to meet Seth and his date. Trystan cringed inside. Maybe it wouldn’t be so bad. He laughed hollowly. Yeah right. Knowing Seth, there wasn’t really another option. He sighed, his breath coming out in a white cloud. Sometimes he wished he had a different life, a different father, a different past.\n Maybe it wouldn’t be so bad if people knew he wrote that song, but the thought made him cringe. What would his life be like if people knew he was Day Jones? What would they think when they found out his mother ran out on him and that his dad hated him? Trystan hung his head, his gaze intent on the sidewalk in front of him. He could see it, picture it in his mind’s eye—everything everyone ever thought about him was a lie. He wasn’t anyone special. He wasn’t anyone at all. Revealing Day Jones’ identity would destroy him. It would strip away the little parts of his life that mattered.\n Frustration shot through Trystan. Moving his feet faster, he came up with a plan for the date. He’d have dinner with Seth, so he didn’t get grilled with more Mari questions, and then get rid of the girl. There was no way he could feel okay. Not tonight. Not after today. Everything had started off so promising, before it derailed and turned to ash in his hands.\n CHAPTER 6\n ~MARI~\n Katie got my text and met me at the diner in ten minutes flat. She must have hitched a ride, since she didn’t have a car and there was no other way she could have arrived so quickly. I didn’t expect her to get there so fast.\n She slipped into the booth across from me, gasping like she was out of breath, “What the hell happened? I ran out after stuffing dinner down my throat. My parents think I’m a lunatic as it is. After tonight, they’re gonna have me committed.” I was near tears. “Awh, damn. It’s Trystan, isn’t it?”\n I nodded and started spilling my guts, telling her how that kiss felt—the way it seemed like it was tailored just for me. Seeing him kiss Brie like that in front of everyone, giving her my kiss, shattered the illusion.\n “It was a lie,” I finished up, slumping back in the booth, folding my arms over my chest. I let my dark hair fall forward to hide my face and cast a shadow over the pain in my eyes. “He used me. No—he was running lines. The entire thing was fake and I was too stupid to notice.”\n It felt like Trystan wrapped his fingers around my heart and squeezed. I couldn’t stand it. I didn’t know what I wanted to do, but suddenly sitting in the booth felt uncomfortable. I wiggled in my seat, trying to slink out of sight when some girls who knew Brie walked by. Katie shot daggers at them and they passed without comment, which was good because I couldn’t take anything else today.\n A waiter came by again and asked for our order. When I first sat down, he tried to get my order, but I said I was waiting for someone. He huffed and walked off, like I screwed up his night. It’s not like I was rude. I didn’t understand people sometimes.\n Katie ordered for both of us. “Two sides of fries and two chocolate milkshakes—tall with extra whipped cream. And she wants a cherry on top.” Katie winked at me and the strangle-hold on my heart lessened. She always knew how to make me feel better. She dug through her purse and pulled out a ponytail holder. She pulled back her hair as she spoke, “I’m sorry this happened, that you found out this way, but at least now you know. Before you couldn’t tell what he was doing. Now you know he’s a goddamn liar.”\n “An actor—”\n “Same thing,” Katie said. When she finished tugging the ponytail tight, she leaned forward saying, “Listen, if anything, that thespian genius makes it harder to see through his little flirtations. There’s no way to know if things are real with a guy like that. He’s always acting.” Her head tilted to the side and her eyebrows crept up her face. It was her uh-durrr face, she was just too kind to actually say it to me.\n Some of what she said seemed true, but my mind rebelled against it. My voice was flat. I wasn’t defending him, but I had to point it out, “We’re all always acting. What the hell do you think high school is? You really think I strut around being myself all day? Come on, Katie. You have to do better than that.”\n She cocked her head at me like I was retarded. Leaning forward she said, “You don’t get it. Actors don’t just hide who they are, they manipulate people. They carefully construct a false facade and use emotions to do it.”\n “Nice alliteration,” I interrupted.\n She smirked. Katie was always a poet and totally bent on making her point. \"People like that make you love them. They make you laugh. He’s an expert at pulling emotional strings and he pulled all of yours. He did it knowing that a kiss meant something to you, and he stole one. He’s an asshole.”\n I didn’t know what to think of that. It was true. Trystan could make anyone love him. He had that ability, which was why he was such a good actor. It was throwing me off, because the time I spent with him felt real. They weren’t conflicting versions of Trystan, and I’d seen how he acted around other guys and love-struck girls. He didn’t change over the years. Actually, scratch that—the first major change I’d seen was that Trystan was in love. Descending the staircase and hearing him tell Seth that some girl had turned him inside out was the first change. The second was the revelation that he was Day Jones, and that he wrote a song that said he was in love.\n Something changed Trystan, no, someone changed him—that girl he loves—she altered him.\n The waiter put the plates of fries and milkshakes down in front of us. Sighing, I looked up at Katie. Sitting up straighter in the booth, I pushed my hair out of my face. I felt less fragile and more like I could handle this, and whatever else was thrown in my face tonight. “Thanks for meeting me here so fast.”\n She plucked a fry from the plate, swiped it through the whipped cream, and popped it in her mouth. “Sure, what are friends for?” she grinned at me. \n","sourceLink":"https://allnovel.net/backdraft-the-secret-life-of-trystan-scott-2/page-5.html","bookId":2774,"book":{"id":2774,"title":"Backdraft (The Secret Life of Trystan Scott #2)","description":"Storyline: \n Backdraft (The Secret Life of Trystan Scott #2) \n When Mari realizes that Trystan is the internet megastar, Day Jones, she can’t speak. Every time she listens to his song, it leaves her feeling so much. That song is bewitching. Everyone she knows heard it. As soon as it appeared on YouTube, it went viral, and then the guy who wrote it disappeared. Despite agents and record labels trying to lure Day5705 out, he remains anonymous. No one knows who Day Jones really is—except Mari. \n To Trystan’s relief, Mari agrees to keep his secret. Part of him regrets uploading the song, but when he sings to Mari the song that once brought him solace, it fills him joy. In a life like his, joy is fleeting and Trystan plans on grabbing hold whenever a shot at happiness appears. To his surprise, Mari doesn’t realize the song is about her. When Trystan tries to push her to see, he jeopardizes losing her entirely. \n One misplaced kiss topples the fragile relationship, leaving Trystan reeling, trying to assemble the pieces and convincing Mari that she’s not just another conquest, even though everything he did—everything he said—makes it seem like she is. It isn’t until Mari decides that being the good girl isn’t working that things steam up. Trystan knows she wants to hook up with someone, and he doesn’t know if he should stop her. Every attempt he makes to win her over goes bad and pushes her further away. \n As the world gets one day closer to tracking down Day Jones, Trystan is one day closer to graduation and leaving this life forever. If Mari doesn’t realize he loves her by then, she never will.\n \n","cover":"https://allnovel.net/images/backdraft-the-secret-life-of-trystan-scott-2.jpg","author":"H.M. Ward","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/backdraft-the-secret-life-of-trystan-scott-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:17:34 PM"}}
