{"id":1705,"no":97,"title":"Part 3 Chapter 31","content":"In the meantime, however, Asa\u0027s condition had remained serious, and it was four entire months before it waspossible for him to sit up again or for Mrs. Griffiths to dream of resuming her lecturing scheme. But by that time,public interest in her and her son\u0027s fate was considerably reduced. No Denver paper was interested to finance herreturn for anything she could do for them. And as for the public in the vicinity of the crime, it remembered Mrs.\\n\\n 　　Griffiths and her son most clearly, and in so far as she was concerned, sympathetically--but only, on the otherhand, to think of him as one who probably was guilty and in that case, being properly punished for his crime-thatit would be as well if an appeal were not taken--or--if it were--that it be refused. These guilty criminals withtheir interminable appeals!\\n\\n 　　And with Clyde where he was, more and more executions--although as he found--and to his invariable horror, noone ever became used to such things there; farmhand Mowrer for the slaying of his former employer; officerRiordan for the slaying of his wife--and a fine upstanding officer too but a minute before his death; andafterwards, within the month, the going of the Chinaman, who seemed, for some reason, to endure a long time(and without a word in parting to any one--although it was well known that he spoke a few words of English).\\n\\n 　　And after him Larry Donahue, the overseas soldier--with a grand call--just before the door closed behind: \"Goodbyboys. Good luck.\"And after him again--but, oh--that was so hard; so much closer to Clyde--so depleting to his strength to think ofbearing this deadly life here without--Miller Nicholson--no less. For after five months in which they had beenable to walk and talk and call to each other from time to time from their cells and Nicholson had begun to advisehim as to books to read--as well as one important point in connection with his own case--on appeal--or in theevent of any second trial, i.e.,--that the admission of Roberta\u0027s letters as evidence, as they stood, at least, bedesperately fought on the ground that the emotional force of them was detrimental in the case of any juryanywhere, to a calm unbiased consideration of the material facts presented by them--and that instead of theletters being admitted as they stood they should be digested for the facts alone and that digest--and that onlyoffered to the jury. \"If your lawyers can get the Court of Appeals to agree to the soundness of that you will winyour case sure.\"And Clyde at once, after inducing a personal visit on the part of Jephson, laying this suggestion before him and hearing him say that it was sound and that he and Belknap would assuredly incorporate it in their appeal.\\n\\n 　　Yet not so long after that the guard, after locking his door on returning from the courtyard whispered, with a nodin the direction of Nicholson\u0027s cell, \"His next. Did he tell you? Within three days.\"And at once Clyde shriveling--the news playing upon him as an icy and congealing breath. For he had just comefrom the courtyard with him where they had walked and talked of another man who had just been brought in--aHungarian of Utica who was convicted of burning his paramour--in a furnace--then confessing it--a huge, rough,dark, ignorant man with a face like a gargoyle. And Nicholson saying he was more animal than man, he wassure. Yet no word about himself. And in THREE DAYS! And he could walk and talk as though there wasnothing to happen, although, according to the guard, he had been notified the night before.\\n\\n 　　And the next day the same--walking and talking as though nothing had happened--looking up at the sky andbreathing the air. Yet Clyde, his companion, too sick and feverish--too awed and terrified from merely thinkingon it all night to be able to say much of anything as he walked but thinking: \"And he can walk here. And be socalm. What sort of a man is this?\" and feeling enormously overawed and weakened.\\n\\n 　　The following morning Nicholson did not appear--but remained in his cell destroying many letters he hadreceived from many places. And near noon, calling to Clyde who was two cells removed from him on the otherside: \"I\u0027m sending you something to remember me by.\" But not a word as to his going.\\n\\n 　　And then the guard bringing two books--Robinson Crusoe and the Arabian Nights. That night Nicholson\u0027sremoval from his cell--and the next morning before dawn the curtains; the same procession passing through,which was by now an old story to Clyde. But somehow this was so different--so intimate--so cruel. And as hepassed, calling: \"God bless you all. I hope you have good luck and get out.\" And then that terrible stillness thatfollowed the passing of each man.\\n\\n 　　And Clyde thereafter--lonely--terribly so. Now there was no one here--no one--in whom he was interested. Hecould only sit and read--and think--or pretend to be interested in what these others said, for he could not really beinterested in what they said. His was a mind that, freed from the miseries that had now befallen him, wasnaturally more drawn to romance than to reality. Where he read at all he preferred the light, romantic novel thatpictured some such world as he would have liked to share, to anything that even approximated the hard reality ofthe world without, let alone this. Now what was going to become of him eventually? So alone was he! Onlyletters from his mother, brother and sisters. And Asa getting no better, and his mother not able to return as yet-thingswere so difficult there in Denver. She was seeking a religious school in which to teach somewhere--whilenursing Asa. But she was asking the Rev. Duncan McMillan, a young minister whom she had encountered inSyracuse, in the course of her work there, to come and see him. He was so spiritual and so kindly. And she wassure, if he would but come, that Clyde would find him a helpful and a strong support in these, his dark and wearyhours when she could no longer be with him herself.\\n\\n 　　For while Mrs. Griffiths was first canvassing the churches and ministers of this section for aid for her son, andgetting very little from any quarter, she had met the Rev. Duncan McMillan in Syracuse, where he wasconducting an independent, non-sectarian church. He was a young, and like herself or Asa, unordained ministeror evangelist of, however, far stronger and more effective temperament religiously. At the time Mrs. Griffiths appeared on the scene, he had already read much concerning Clyde and Roberta--and was fairly well satisfiedthat, by the verdict arrived at, justice had probably been done. However, because of her great sorrow andtroubled search for aid he was greatly moved.\\n\\n 　　He, himself, was a devoted son. And possessing a highly poetic and emotional though so far repressed orsublimated sex nature, he was one who, out of many in this northern region, had been touched and stirred by thecrime of which Clyde was presumed to be guilty. Those highly emotional and tortured letters of Roberta\u0027s! Herseemingly sad life at Lycurgus and Biltz! How often he had thought of those before ever he had encounteredMrs. Griffiths. The simple and worthy virtues which Roberta and her family had seemingly represented in thatromantic, pretty country world from which they had derived. Unquestionably Clyde was guilty. And yet here,suddenly, Mrs. Griffiths, very lorn and miserable and maintaining her son\u0027s innocence. At the same time therewas Clyde in his cell doomed to die. Was it possible that by any strange freak or circumstance--a legal mistakehad been made and Clyde was not as guilty as he appeared?\\n\\n 　　The temperament of McMillan was exceptional--tense, exotic. A present hour St. Bernard, Savonarola, St.\\n\\n 　　Simeon, Peter the Hermit. Thinking of life, thought, all forms and social structures as the word, the expression,the breath of God. No less. Yet room for the Devil and his anger--the expelled Lucifer--going to and fro in theearth. Yet, thinking on the Beatitudes, on the Sermon on the Mount, on St. John and his direct seeing andinterpretation of Christ and God. \"He that is not with me is against me; and he that gathereth not with me,scattereth.\" A strange, strong, tense, confused, merciful and too, after his fashion beautiful soul; sorrowing withmisery yearning toward an impossible justice.\\n\\n 　　Mrs. Griffiths in her talks with him had maintained that he was to remember that Roberta was not whollyguiltless. Had she not sinned with her son? And how was he to exculpate her entirely? A great legal mistake. Herson was being most unjustly executed--and by the pitiful but none-the-less romantic and poetic letters of this girlwhich should never have been poured forth upon a jury of men at all. They were, as she now maintained,incapable of judging justly or fairly where anything sad in connection with a romantic and pretty girl wasconcerned. She had found that to be true in her mission work.\\n\\n 　　And this idea now appealed to the Rev. Duncan as important and very likely true. And perhaps, as she nowcontended, if only some powerful and righteous emissary of God would visit Clyde and through the force of hisfaith and God\u0027s word make him see--which she was sure he did not yet, and which she in her troubled state, andbecause she was his mother, could not make him,--the blackness and terror of his sin with Roberta as it related tohis immortal soul here and hereafter,--then in gratitude to, reverence and faith in God, would be washed away,all his iniquity, would it not? For irrespective of whether he had committed the crime now charged against himor not--and she was convinced that he had not--was he not, nevertheless, in the shadow of the electric chair--indanger at any time through death (even before a decision should be reached) of being called before his maker-andwith the deadly sin of adultery, to say nothing of all his lies and false conduct, not only in connection withRoberta but that other girl there in Lycurgus, upon him? And by conversion and contrition should he not bepurged of this? If only his soul were saved--she and he too would be at peace in this world.\\n\\n 　　And after a first and later a second pleading letter from Mrs. Griffiths, in which, after she had arrived at Denver,she set forth Clyde\u0027s loneliness and need of counsel and aid, the Rev. Duncan setting forth for Auburn. And oncethere--having made it clear to the warden what his true purpose was--the spiritual salvation of Clyde\u0027s soul, for his own, as well as his mother and God\u0027s sake, he was at once admitted to the death house and to Clyde\u0027spresence-- the very door of his cell, where he paused and looked through, observing Clyde lying most wretchedlyon his cot trying to read. And then McMillan outlining his tall, thin figure against the bars and withoutintroduction of any kind, beginning, his head bowed in prayer:\\n\\n 　　\"Have mercy upon me, O God, according to Thy loving-kindness; according unto the multitude of Thy tendermercies, blot out my transgressions.\"\"Wash me thoroughly from my iniquity and cleanse me from my sin.\"\"For I acknowledge my transgressions, and my sin is ever before me.\"\"Against Thee, Thee only have I sinned, and done this evil in Thy sight, that Thou mightest be justified whenThou speakest and be clear when Thou judgest.\"\"Behold, I was shapen in iniquity; and in sin did my mother conceive me.\"\"Behold, Thou desireth truth in the inward parts; and in the hidden part Thou shalt make me to know wisdom.\"\"Purge me with hyssop, and I shall be clean; wash me, and I shall be whiter than snow.\"\"Make me to hear joy and gladness; that the bones which Thou hast broken may rejoice.\"\"Hide Thy face from my sins, and blot out all mine iniquities.\"\"Create in me a clean heart, O God; and renew a right spirit within me.\"\"Cast me not away from Thy presence; and take not Thy holy spirit away from me.\"\"Restore unto me the joy of Thy salvation, and uphold me with Thy free spirit.\"\"Then will I teach transgressors Thy ways; and sinners will be converted unto Thee.\"\"Deliver me from blood guiltiness, O God, thou God of my salvation, and my tongue shall sing aloud of Thyrighteousness.\"\"O Lord, open Thou my lips; and my mouth shall show forth Thy praise.\"\"For Thou desirest not sacrifice; else would I give it; Thou delightest not in burnt offering.\"\"The sacrifices of God are a broken spirit; a broken and a contrite heart, O God, Thou wilt not despise.\"He paused--but only after he had intoned, and in a most sonorous and really beautiful voice the entire 51st Psalm.\\n\\n 　　And then looking up, because Clyde, much astonished, had first sat up and then risen--and curiously enticed by the clean and youthful and vigorous if pale figure had approached nearer the cell door, he now added:\\n\\n 　　\"I bring you, Clyde, the mercy and the salvation of your God. He has called on me and I have come. He has sentme that I may say unto you though your sins be as scarlet, they shall be white--like snow. Though they be red,like crimson, they shall be as wool. Come now, let us reason together with the Lord.\"He paused and stared at Clyde tenderly. A warm, youthful, half smile, half romantic, played about his lips. Heliked the youth and refinement of Clyde, who, on his part was plainly taken by this exceptional figure. Anotherreligionist, of course. But the Protestant chaplain who was here was nothing like this man--neither so arrestingnor attractive.\\n\\n 　　\"Duncan McMillan is my name,\" he said, \"and I come from the work of the Lord in Syracuse. He has sent me-justas he sent your mother to me. She has told me all that she believes. I have read all that you have said. And Iknow why you are here. But it is to bring you spiritual joy and gladness that I am here.\"And he suddenly quoted from Psalms 13:2, \"\u0027How shall I take counsel in my soul, having sorrow in my heart,daily.\u0027 That is from Psalms 13:2. And here is another thing that now comes to me as something that I should sayto you. It is from the Bible, too--the Tenth Psalm: \u0027He hath said in his heart, I shall not be moved, for I shallnever be in adversity.\u0027 But you are in adversity, you see. We all are, who live in sin. And here is another thingthat comes to me, just now to say. It is from Psalm 10:11: \u0027He hath said in his heart, God hath forgotten. Hehideth His face.\u0027 And I am told to say to you that He does not hide His face. Rather I am told to quote this to youfrom the Eighteenth Psalm: \u0027They prevented me in the day of my calamity, but the Lord was my stay. He sentfrom above, He took me, He drew me out of many waters.\u0027\\n\\n 　　\"\u0027He delivered me from my strong enemy.\\n\\n 　　\"\u0027And from them which hated me, for they were too many for me.\\n\\n 　　\"\u0027He brought me forth also unto a large place.\\n\\n 　　\"\u0027He delivered me because He delighted in me.\u0027\\n\\n 　　\"Clyde, those are all words addressed to you. They come to me here to say to you just as though they were beingwhispered to me. I am but the mouthpiece for these words spoken direct to you. Take counsel with your ownheart. Turn from the shadow to the light. Let us break these bonds of misery and gloom; chase these shadows andthis darkness. You have sinned. The Lord can and will forgive. Repent. Join with Him who has shaped the worldand keeps it. He will not spurn your faith; He will not neglect your prayers. Turn--in yourself--in the confines ofthis cell--and say: \u0027Lord, help me. Lord, hear Thou my prayer. Lord, lighten mine eyes!\u0027\\n\\n 　　\"Do you think there is no God--and that He will not answer you? Pray. In your trouble turn to Him--not me--orany other. But to Him. Pray. Speak to Him. Call to Him. Tell Him the truth and ask for help. As surely as you arehere before me--and if in your heart you truly repent of any evil you have done--TRULY, TRULY, you will hearand feel Him. He will take your hand. He will enter this cell and your soul. You will know Him by the peace andthe light that will fill your mind and heart. Pray. And if you need me again to help you in any way--to pray with you--or to do you any service of any kind--to cheer you in your loneliness--you have only to send for me; dropme a card. I have promised your mother and I will do what I can. The warden has my address.\" He paused,serious and conclusive in his tone--because up to this time, Clyde had looked more curious and astonished thananything else.\\n\\n 　　At the same time because of Clyde\u0027s extreme youthfulness and a certain air of lonely dependence which markedhim ever since his mother and Nicholson had gone: \"I\u0027ll always be in easy reach. I have a lot of religious workover in Syracuse but I\u0027ll be glad to drop it at any time that I can really do anything more for you.\" And here heturned as if to go.\\n\\n 　　But Clyde, now taken by him--his vital, confident and kindly manner--so different to the tense, fearful and yetlonely life here, called after him: \"Oh, don\u0027t go just yet. Please don\u0027t. It\u0027s very nice of you to come and see me andI\u0027m obliged to you. My mother wrote me you might. You see, it\u0027s very lonely here. I haven\u0027t thought much ofwhat you were saying, perhaps, because I haven\u0027t felt as guilty as some think I am. But I\u0027ve been sorry enough.\\n\\n 　　And certainly any one in here pays a good deal.\" His eyes looked very sad and strained.\\n\\n 　　And at once, McMillan, now deeply touched for the first time replied: \"Clyde, you needn\u0027t worry. I\u0027ll come to seeyou again within a week, because now I see you need me. I\u0027m not asking you to pray because I think you areguilty of the death of Roberta Alden. I don\u0027t know. You haven\u0027t told me. Only you and God know what your sinsand your sorrows are. But I do know you need spiritual help and He will give you that--oh, fully. \u0027The Lord willbe a refuge for the oppressed; a refuge in time of trouble.\u0027\"He smiled as though he were now really fond of Clyde. And Clyde feeling this and being intrigued by it, repliedthat there wasn\u0027t anything just then that he wanted to say except to tell his mother that he was all right--and makeher feel a little better about him, maybe, if he could. Her letters were very sad, he thought. She worried too muchabout him. Besides he, himself, wasn\u0027t feeling so very good--not a little run down and worried these days. Whowouldn\u0027t be in his position? Indeed, if only he could win to spiritual peace through prayer, he would be glad to doit. His mother had always urged him to pray--but up to now he was sorry to say he hadn\u0027t followed her advicevery much. He looked very distrait and gloomy--the marked prison pallor having long since settled on his face.\\n\\n 　　And the Reverend Duncan, now very much touched by his state, replied: \"Well, don\u0027t worry, Clyde.\\n\\n 　　Enlightenment and peace are surely going to come to you. I can see that. You have a Bible there, I see. Open itanywhere in Psalms and read. The 51st, 91st, 23rd. Open to St. John. Read it all--over and over. Think and pray-andthink on all the things about you--the moon, the stars, the sun, the trees, the sea--your own beating heart,your body and strength--and ask yourself who made them. How did they come to be? Then, if you can\u0027t explainthem, ask yourself if the one who made them and you--whoever he is, whatever he is, wherever he is, isn\u0027t strongand wise enough and kind enough to help you when you need help--provide you with light and peace andguidance, when you need them. Just ask yourself what of the Maker of all this certain reality. And then askHim--the Creator of it all--to tell you how and what to do. Don\u0027t doubt. Just ask and see. Ask in the night--in theday. Bow your head and pray and see. Verily, He will not fail you. I know because I have that peace.\"He stared at Clyde convincingly--then smiled and departed. And Clyde, leaning against his cell door, began towonder. The Creator! His Creator! The Creator of the World! . . . Ask and see--!\\n\\n 　　And yet--there was still lingering here in him that old contempt of his for religion and its fruits ,--the constantand yet fruitless prayers and exhortations of his father and mother. Was he going to turn to religion now, solelybecause he was in difficulties and frightened like these others? He hoped not. Not like that, anyway.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/815/16849.html","bookId":55,"book":{"id":55,"title":"An American Tragedy 美国悲剧","description":"简介： 德莱塞在《美国悲剧》中描写了主人公克莱德格里菲思受到社会上邪恶影响，逐渐蜕变、堕落为凶杀犯、最后自我毁灭的全过程。小说共分三卷。第一卷描写克莱德这个天真幼稚的青年...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/815","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
