{"id":97817,"no":19,"title":"Page 19","content":"Bloody hell \u0026#148; William whispered, and a ripple of fear went through him. These knights would be harmless to most living beings, but he was a creature of magic. If they focused enough, they could hurt him. And what of Bodicea and Horatio? What might the ghostly knights do to them?\n He lifted his hand to begin another spell, but was interrupted by Bodicea\u0026#146;s loud, inhuman battle cry. She darted past him, having transformed the spirit-substance of her spear into a sword. She swung the spectral blade above her as she charged. The knights were startled for a moment by the appearance of this screaming, naked madwoman, and Bodicea used that moment of confusion to her advantage. The queen floated and danced among them, hacking them apart.\n \u0026#147;For England! For Victoria! For Albion!\u0026#148; Horatio shouted as he joined the fray.\n \u0026#147;For Arthur!\u0026#148; he added with a triumphant laugh.\n The admiral used his longer, thinner sword to stab through the gaps in his opponents\u0026#146; armor, disabling them quickly. Horatio always surprised William with his skill as a swordsman.\n One of the knights roared and charged at William, who completed the spell he\u0026#146;d begun earlier. The greenish light sprang from his fingers like darts and a swarm of them flew at his attacker. They struck the ghost, tearing holes in his phantom armor, in his very spiritual essence, and the knight shouted in pain and fell to the ground, dissipating like mist burned away by the rising sun.\n After a few minutes of heavy battle the three of them had decimated their opponents. Bodicea hacked away at one of the knights even as he vanished into nothingness. The cries from the battlefield faded, but there were still a few knights left standing.\n Pendragon\u0026#146;s knights.\n They moved closer so they could watch Bodicea as she whooped and howled over her victories. Now that the last of her foes was vanquished, one of Pendragon\u0026#146;s knights stepped forward, removing his blood-spattered helmet. He was a handsome man with long dark hair, piercing blue eyes, and an aquiline nose.\n He lowered his head in deference to Bodicea. She nodded in return as she held her sword down at her side.\n \u0026#147;I am Sir Yvain,\u0026#148; the knight began. \u0026#147;These good knights and I serve Arthur, King of Britain, called the Pendragon, and owe you our thanks for your aid against Mordred\u0026#146;s horde.\u0026#148;\n William cleared his throat. \u0026#147;It was our great pleasure and duty, Sir Yvain. I am William Swift, Protector of Albion. It is my honor to introduce Lord Admiral Horatio Nelson and her majesty, Queen Bodicea of the Iceni.\u0026#148;\n The knights bowed as one.\n \u0026#147;We fight this battle for eternity. For this moment you have given us a reprieve from the tedium of its sameness,\u0026#148; Sir Yvain said, as he and the other knights began to fade into the ether. \u0026#147;We thank you for your help, Lord Protector William, Admiral Nelson, your majesty \u0026#148;\n \u0026#147;Wait!\u0026#148; William called, before they had completely disappeared. Sir Yvain and the others manifested again, though the sun streamed through them as if they were the merest suggestions of men.\n \u0026#147;How may we help you, Lord William?\u0026#148; Sir Yvain said graciously.\n \u0026#147;Tell me,\u0026#148; William asked, \u0026#147;the witches that haunt this place: what is it exactly they are looking for?\u0026#148;\n The dead knight\u0026#146;s blue eyes sharpened at the mere mention of the word witch. He hung his head.\n \u0026#147;They seek to raise the dead, my lord,\u0026#148; the knight said softly. He looked up. \u0026#147;To bring back to wretched life the murderer of the Pendragon, the regicide and patricide \u0026#148;\n He paused as if his own words pained him.\n \u0026#147;You don\u0026#146;t mean ?\u0026#148; William whispered.\n Sir Yvain nodded.\n \u0026#147;Mordred, my lord. Arthur\u0026#146;s bastard son. Morgan le Fey always intended her child to be king of Britain, to use him to give the witches reign over us all. Even as he himself died, Arthur slew the boy, forestalling such darkness from befalling the land. We knights, we few, drove the witches from Britain and many thought their line extinguished. But such was not to be. For long centuries the daughters of Morgan le Fey, these witches, have waited for the perfect night to raise Mordred from the dead. Now they have come. Whatever signs and portents they watch, be they in the stars or in the earth, they believe the time is nigh.\u0026#148;\n Horatio\u0026#146;s ghost drifted forward, eyes intense, staring at Yvain. \u0026#147;Then help us, good knight. Aid us in our battle and together we will prevent this terrible resurrection, and destroy the witches.\u0026#148;\n A murmur ran through the knights. None of them wanted to look at the newcomers. At last Sir Yvain shook his head.\n \u0026#147;We cannot, Admiral. To our endless shame, we cannot. There is nothing in life or the afterlife that my men and I would like better than to aid you in your quest, but were we to even attempt it, you would only be placed in greater peril.\u0026#148;\n William shook his head. \u0026#147;What do you mean? What peril? I don\u0026#146;t understand.\u0026#148;\n The knights began to fade once again, dissipating in the morning light until only Sir Yvain remained.\n And then even the last visible trace of that noble ghost vanished.\n \u0026#147;There are curses on the living,\u0026#148; a disembodied voice said, \u0026#147;and there are curses on the dead. The battle is ended, for now, but you have stopped nothing. Tomorrow, it will begin again.\u0026#148;\n Then they were gone.\n A breeze blew across the field.\n William could hear Bodicea and Horatio talking quietly, but the words were lost on him. He could not tear his gaze from the place where the knights had been, this phantom battlefield. Nothing remained to indicate that combat had taken place, yet the fight went on.\n Forever.\n TAMARA DID NOT TRUST THE FAIRIES. Even though they had pledged their help to the Protectors of Albion, she still felt certain that they had only their own best interests at heart. She worried that they would not hold up their end of the bargain\u0026#151; not unless their hands were forced.\n She tried to focus on the positives of the alliance. In the spirit of their agreement, the Council of Stronghold had appointed a fairy girl called Edrell to assist the Protectors in their research, and to act as liaison between the Swifts and Stronghold. A slight, ethereal thing with sharp, intelligent features, Edrell had proven quite knowledgeable.\n For hours she had worked with Tamara and Serena, helping them as they paged through dozens of arcane volumes and magical histories in search of any spell or passage that might provide some edge in combat with the witches, which were notoriously difficult to kill.\n Tamara had translocated back to Ludlow House and retrieved every book of arcane lore she thought might contain some reference or spell that could help them. William had asked her to go quietly and be careful not to let Sophia know that she had been there. Tamara inquired about this strange request, but his response had been only a sad, troubled expression, and so she decided to wait until this crisis had been averted to ask him again.\n As quietly as possible, she had retrieved those texts. They were piled about her room at the inn and, thus far, had proven useless.\n As it spirited her away across the sky, the witch that had abducted her had told her the only reason they had not killed her was because she was a virgin, that she would be the tenth and that three more had to be gathered. Tamara had escaped, but the witches had been quite busy. Six fairies had been abducted, and with the vanishing of Katherine Monroe, a total of five human girls. That made eleven virgins.\n Tamara had no doubt that the witches would find two more by the appointed time.\n It had been quite awkward to explain to William, but the detail of the girls\u0026#146; virginity was too important to be ignored. Serena had confirmed that Aine was a virgin, and Edrell knew Tamsyn well enough to make the same assertion of her. The truth was inescapable. Brother and sister agreed that the virgin girls, both human and fairy, were being gathered for some sort of ritual sacrifice to be conducted on the night of the solstice.\n Their research had turned up nothing that might hint at the purpose of that ritual. Now Tamara, Edrell, and Serena focused on attempting to find any information that might help them destroy the witches.\n Some of the books were too heavy for the sprite to lift and Serena had grown snappish and cold. Tamara did not like the way sprite and fairy glared at each other when they thought she wasn\u0026#146;t looking, but it couldn\u0026#146;t be helped. The only way to repair the damage to the relationship between Serena and the fairies of Stronghold was to get the missing fairy girls back, safe and sound, Aine in particular.\n The work here was all that mattered.\n They pored over the books until dawn, but with each passing hour Tamara became more agitated. She did not want to think about the outcome if they could find nothing that would help them against the witches. The creatures were so powerful that she could conceive of no plan that did not involve terrible casualties on her side.\n Her research had not taught her much, however.\n The ordinary world had many tales of witchcraft that confused the creatures with more mundane practitioners of sorcery. As a result, there was sparse information about true witches. What bits she found helped her little. True witches were unsociable creatures that did not take kindly to outsiders who invaded their territory, and they sought only to destroy what they did not know or understand. Half-human and half-demon, they combined their innate demonic power with skilled spellcraft.\n Most of what she found regarding true witches consisted of the mythology of their creation, and a few tales of their supposed end. It seemed that a group of true witches had attempted to conquer Albion centuries before, and had been stopped only through an alliance of all of the supernatural races in Britannia. One of the tomes Tamara had read referred to this conflict as the Second War of Smythe.\n She had never heard of the first war of Smythe, nor of Smythe himself, for that matter.\n Dawn came and went, the morning was two hours old, and Tamara began to fear for herself and her friends, and even more for the fairy and human girls who had been abducted by the witches. When darkness fell again, the solstice would be only hours away. The girls were doomed if she could not find something.\n Frustrated, she closed her book and put her head down on the table. She shut her eyes and felt the morning light beginning to filter through the windows of the room. In the stillness, she heard a soft, unmistakable whistling sound. She lifted her head to see that Serena had fallen asleep inside one of her dresser drawers. The sound was the drone of the sleeping sprite\u0026#146;s breathing.\n Tamara pulled a chemise from the back of the drawer and covered the little sprite with it to keep her warm.\n She took a deep breath and blinked, forcing herself to stay awake. Edrell did not look at all tired. She bent over the thick, leather-bound volume she was presently reading, thoroughly engrossed. She was roughly Tamara\u0026#146;s height, and her alabaster skin and golden eyes shone brightly in the morning light. Her long, swanlike neck was craned forward as she studied the pages while she turned them. Her long red hair was tied securely in a knot, to keep it out of her eyes.\n As if sensing Tamara\u0026#146;s gaze, Edrell looked up and smiled. She had a more amiable demeanor than the other fairies Tamara had met. If she would only be kinder to Serena, Tamara thought, she might even come to like her.\n \u0026#147;Anything?\u0026#148; Tamara asked, though she knew the answer.\n Edrell shook her head, putting down her book. \u0026#147;Nothing, Protector.\u0026#148;\n She insisted on calling Tamara \u0026#147;Protector,\u0026#148; even though Tamara had specifically asked her not to do so. It was meant as a sign of respect, but somehow it just made her feel old.\n Tamara stood and stretched, wincing with pain from the bruises she had sustained in her brief captivity, and still quite drained from the ordeal. She wished she had taken Farris up on his offer to help. She could at least have had him fetching coffee for them as they worked. Instead, he and Richard Kirk were out looking for the master of the hounds. The man and his dogs had gone missing the night before, while out looking for Richard\u0026#146;s sister. Richard had insisted on joining the search to help find him.\n Tamara thought that the smartest thing to do was to keep Farris by the young man\u0026#146;s side. If they stayed together and were careful, she thought they would stand a chance of remaining safe and alive. She just hoped none of the human search party came across the witches. It would surely be the end of any who did.\n Though she had not wanted to say so, she imagined that was precisely what had happened to Peter David.\n A knock came upon the door, startling her.\n Tamara shot a warning glance at Edrell, who nodded in understanding. She then intoned a hasty cloaking spell, and the fairy and the sprite vanished from view, no longer visible to human eyes.\n Tamara went to unlock the door and swung it inward. Of all the visitors she might have expected John Haversham would never have even made her list.\n She let go of the door and it began to creak slowly forward, until it was about to close in his face. Remembering herself, she caught it again.\n \u0026#147;John? Whatever are you doing here?\u0026#148;\n Haversham smiled, causing Tamara\u0026#146;s heart to skip.\n \u0026#147;You don\u0026#146;t look happy to see me, Tamara,\u0026#148; he said softly, reaching out to move a tendril of loose hair that had fallen across her cheek.\n Tamara sucked in her breath. His nearness always seemed to make her a bit woozy. She hoped it didn\u0026#146;t show.\n \u0026#147;We were\u0026#151; I mean, I was in the middle of doing some research.\u0026#148;\n John laughed. The sound was rich and mellow, somehow quelling her nervousness a bit.\n \u0026#147;May I come in?\u0026#148; he asked, stepping over the threshold as she nodded. He looked around the room, and one eyebrow raised.\n \u0026#147;So many books, Tamara,\u0026#148; he said as he made his way to the table. He picked one up, flipping through the pages, then turned, his eyes searching hers. \u0026#147;I\u0026#146;ve come to help. You don\u0026#146;t need to hide anything or anyone from me.\u0026#148;\n \u0026#147;Oh,\u0026#148; she said, a bit flustered. \u0026#147;Of course.\u0026#148; She lifted the cloaking spell, revealing Edrell and Serena, who was just waking, and cast a wary glance at the new arrival.\n Edrell studied John curiously, but there was no hostility in her gaze.\n \u0026#147;John, you know Serena, and this is Edrell. The Council of Stronghold has agreed to an alliance so that we can find the missing girls, and stop the\u0026#151; \u0026#148;\n \u0026#147;Witches?\u0026#148; he finished for her.\n Her mouth fell open in surprise. \u0026#147;How did you know? Every arcane scholar believes them extinct. How could\u0026#151; \u0026#148;\n \u0026#147;The Algernon Club has its eyes everywhere. They learned of your predicament and have sent me to offer whatever assistance I can.\u0026#148; John executed an elegant bow. \u0026#147;I am at your service, Miss Swift.\u0026#148;\n Edrell giggled, obviously taken with John\u0026#146;s charm. Tamara felt a small stab of jealousy, but quickly pushed it away. She was here to find the missing girls, not to attract John Haversham\u0026#146;s attention.\n \u0026#147;Wonderful. You can be of great service by burying your nose in these texts,\u0026#148; she said as she saddled him with two of the heaviest volumes from the table.\n John took them effortlessly, winking at her when their fingers accidentally brushed in the exchange. Tamara felt her face growing hot but fought the blush, trying to hold onto a bit of her composure. What was he up to, she wondered, after the way he had parried all of her romantic interest thus far?\n She returned to the table, focusing on the books that lay in front of her. John settled on the edge of her bed, and she tried to blot out the tantalizing images that rushed across her mind.\n Stop it, she chided herself. What are you? Some sort of rutting animal?\n Tamara returned her attention to the last book she had been reading. Just as she had managed to reimmerse herself in the text, she heard John adjust his position on the mattress. Its creak seemed to call to her.\n She gritted her teeth.\n Before she could berate herself again, she heard a slight stirring in the air around her. There was an almost imperceptible tearing noise, and then William and the ghosts appeared within what was fast becoming a very crowded room.\n Her brother began even before the ghosts had completely manifested.\n \u0026#147;Tam, you won\u0026#146;t believe it, but we\u0026#146;ve discovered the witches\u0026#146; plan. Do you realize who the ghost knights are? They\u0026#146;re the Pendragon\u0026#146;s men! We met Sir Yvain\u0026#146;s ghost and\u0026#151; \u0026#148;\n William stopped dead, and clamped his mouth shut the moment he saw John Haversham sitting on his sister\u0026#146;s bed.\n \u0026#147;Hello, Willy boy,\u0026#148; John said, standing up, a sly grin spreading across his face. \u0026#147;Fancy meeting you here.\u0026#148;\n JOHN HAD TO APOLOGIZE TWICE to get William to open his mouth again. If things hadn\u0026#146;t been so tense, and time had been on their side, Tamara would have just left William mute. But things were precarious and they had no time for pettiness.\n \u0026#147;It is a ritual, Tamara, just as we suspected,\u0026#148; William said.\n \u0026#147;A ritual requiring the blood of thirteen virgin girls, some fairy and some human,\u0026#148; Edrell interrupted.\n \u0026#147;Yes, according to that witch,\u0026#148; Tamara agreed, then looked at William, attempting not to blush at the way John Haversham scrutinized her after this revelation. \u0026#147;Though we haven\u0026#146;t found anything to tell us how many of each.\u0026#148;\n William had the gleam of amazement in his eyes. Tamara looked at the ghosts of Bodicea and Horatio, then stared at her brother again.\n \u0026#147;Well? What is the ritual for?\u0026#148;\n \u0026#147;They intend to use the virgins\u0026#146; blood to resurrect Mordred, the bastard son of Arthur Pendragon. That\u0026#146;s why the stories of the witches say they haunt the woods around Slaughterbridge. They were seeking Mordred\u0026#146;s grave.\u0026#148;\n \u0026#147;That\u0026#146;s Are you sure?\u0026#148; Tamara asked.\n \u0026#147;We have it from the ghosts of Arthur\u0026#146;s knights themselves,\u0026#148; Bodicea declared.\n \u0026#147;Though they won\u0026#146;t lend a hand, the lily-livered cowards,\u0026#148; Horatio sneered.\n \u0026#147;Not cowards,\u0026#148; Tamara said. \u0026#147;During our battle at Slaughterbridge, I saw what happened to those homunculi when we destroyed them. There were ghosts of knights trapped within. That\u0026#146;s why they fear going near the witches, because their spirits would be captured and used against us.\u0026#148;\n Edrell stood perfectly still, lithe and ethereal, almost like a ghost herself. \u0026#147;Where does that leave us?\u0026#148; she asked.\n \u0026#147;We fights, is where it leaves us!\u0026#148; Serena cried in her tiny, piping voice, wings blurring as she darted around above their heads.\n \u0026#147;We must fight, of course,\u0026#148; Tamara said, slowly. \u0026#147;But I\u0026#146;m afraid we haven\u0026#146;t found a single spell or enchantment or reference to a weapon that would help us kill the witches. Had we another dozen Protectors or equally powerful sorcerers, perhaps \u0026#148;\n They all stood together in Tamara\u0026#146;s room\u0026#151; fairy, human, ghost, and sprite\u0026#151; and stared at one another in silence.\n \u0026#147;If we cannot find anything to aid us against the witches, some advantage, the outlook is very bleak,\u0026#148; Edrell said. \u0026#147;I have no doubt, great Protectors, that with your power and the valiant efforts of your ghostly comrades, combined with the might of the warriors of Stronghold, we will be able to kill some of the witches. But unless we destroy them all, we shall not prevail. We must have an advantage.\u0026#148;\n William stroked his chin, glancing at each of the figures in the room in turn. At last he turned his attention on Bodicea.\n \u0026#147;You\u0026#146;ve fought them before, you said. This description of them as half-human and half-demon, is that accurate?\u0026#148;\n The ghostly queen nodded gravely. \u0026#147;As far as I know.\u0026#148;\n Edrell stood not far from William. She fluttered her wings as she spoke and would not meet his gaze.\n \u0026#147;Oh, it\u0026#146;s true, Protector,\u0026#148; the fairy girl said. \u0026#147;All the tales of conflict between witches and fairies speak of them this way.\u0026#148;\n \u0026#147;True, true it is!\u0026#148; Serena piped up.\n \u0026#147;All right,\u0026#148; William said with a nod. \u0026#147;Perhaps we ought to consider focusing on one element of their nature. What might we do to the human or the demon part of them, to overcome their witchery?\u0026#148;\n Tamara stared at him, nodding. \u0026#147;Yes, of course. Damn me for a fool, how could I not have considered it? But we haven\u0026#146;t time, now. The solstice is this evening. If I\u0026#146;d thought of it before, we could have focused our research on\u0026#151; \u0026#148;\n \u0026#147;Wait a moment!\u0026#148; William cried, turning from her toward the ghosts. \u0026#147;Horatio, do you remember coming across that bit on demonic possession in The Lesser Key of Solomon, when we were researching ways to drive Oblis from my father?\u0026#148;\n Horatio nodded, his brow furrowed.\n \u0026#147;Yes \u0026#148;\n Smiling, William began to pace, engaging in his best professorial discourse. \u0026#147;It was useless in driving the demon from Father\u0026#146;s body but it may be precisely what we need.\u0026#148;\n Tamara saw Edrell and Serena exchange a brief glance, no doubt thinking that William had lost his grip on sanity.\n Horatio had his remaining hand behind his back, as though he was standing at attention even as he drifted toward William. \u0026#147;My young friend, I\u0026#146;m afraid you misremember. The spell was useless to us because it was the reverse of our goal. It provided the magical process for purging a human soul from the body of a demon.\u0026#148;\n Tamara let out a little cry, and everyone turned to look at her.\n \u0026#147;Oh, William, that\u0026#146;s just mad enough to work,\u0026#148; Tamara whispered, turning to her brother even as the beginnings of a plan began to germinate in her mind.\n The rest of those gathered in the room still looked mystified.\n \u0026#147;You\u0026#146;ll pardon us if we\u0026#146;re all just a bit further behind in your deductive process,\u0026#148; John Haversham said, looking from William to Tamara and back. \u0026#147;What are the two of you raving about?\u0026#148;\n \u0026#147;You don\u0026#146;t see it?\u0026#148; William asked him, and he sounded almost gleeful. \u0026#147;The witches are half human and half demon. So what happens if we remove the human element from them, Haversham? What then?\u0026#148;\n Bodicea whooped in triumph.\n \u0026#147;Excellent, my friends! Without their human souls, what are witches, but demon scourge? And we know very well how to deal with the likes of those!\u0026#148;\n \u0026#147;I will translocate to Ludlow House, get Grandfather\u0026#146;s copy of The Lesser Key of Solomon, and return here as fast as I can,\u0026#148; William declared.\n \u0026#147;Go on, then, Will,\u0026#148; Tamara said. \u0026#147;The rest of us will prepare so that we can begin searching for Mordred\u0026#146;s grave immediately upon your return. Most likely the abducted girls will be kept near there. We haven\u0026#146;t a moment to lose.\u0026#148;\n William smiled warmly and took Tamara\u0026#146;s hands in his. They had hope now. He stepped back, and began the incantation of the spell of translocation.\n \u0026#147;Under the same sky \u0026#148;\n He\u0026#146;d barely gotten the words out when the air shimmered around him and he disappeared.\n \u0026#147;All right,\u0026#148; Tamara said, turning to the others. \u0026#147;William will only be a few minutes. Let\u0026#146;s be ready. Edrell, you and Serena must go and inform the Council at Stronghold, and enlist them in the search.\n \u0026#147;The rest of us will split up. Horatio, you and William should take the southwest of Slaughterbridge, while John and I will scour the area northwest. With William and myself separated, if either of us finds anything we can cast a spell that will signal our location. If Bodicea discovers the grave she can find us easily enough. And I imagine the fairies will be able to track us in their own forest.\n \u0026#147;Bodicea, go to Farris and Richard. They\u0026#146;re out in the woods looking for the master of the hounds and the missing girls, along with the rest of the village. Enlist them to your search. Perhaps if you can find the knights they can tell us where Mordred\u0026#146;s grave is. Otherwise, search the area to the east of Slaughterbridge.\u0026#148;\n Tamara took a deep breath before adding her final thought.\n \u0026#147;We may have a chance after all, my friends. But we must find the grave and stop the witches before midnight. If we fail, many will die.\u0026#148;\n WILLIAM DID NOT WANT TAMARA to go off into the woods alone with Haversham. He had tried to talk her into taking Bodicea with them, but Tamara pointed out that someone had to find Farris, and brief him on the plan. He had then offered Horatio\u0026#146;s services, but she simply shook her head.\n \u0026#147;I am not a child, William,\u0026#148; she said. \u0026#147;I can take care of myself.\u0026#148;\n \u0026#147;It isn\u0026#146;t that I don\u0026#146;t trust you, Tamara. It\u0026#146;s that rogue Haversham who gives me pause. You simply don\u0026#146;t understand what a threat he is to your virtue.\u0026#148;\n \u0026#147;Farewell, brother. Godspeed.\u0026#148;\n William hesitated only a moment, and then, resigned, he called to Horatio and they departed to begin the search for Mordred\u0026#146;s grave.\n LATER IN THE DAY, doubts began to creep into Tamara\u0026#146;s thoughts. She would never admit it to William, but she could not dismiss the fear that he might be right.\n All through the afternoon, as she and John searched the woods, she felt slightly uncomfortable. It wasn\u0026#146;t anything he did, exactly; it was the way he was looking at her, as though he was well hungry.\n As night fell, and the shadows in the forest grew deeper, Tamara began to lose hope.\n \u0026#147;Do you suppose they\u0026#146;ve hidden the grave with their witchery?\u0026#148; Tamara asked her companion. \u0026#147;Perhaps that\u0026#146;s why we can\u0026#146;t find it.\u0026#148; She had been thinking this for some time, but hadn\u0026#146;t wanted to admit it. If it were so, then it would be nearly impossible to find the place without research they simply didn\u0026#146;t have time for.\n John shrugged. \u0026#147;I don\u0026#146;t know, Tam. Maybe so.\u0026#148;\n Tamara glanced curiously at him. Had she heard correctly? John had referred to her by her pet name. No one called her Tam, except for William and\u0026#151; once upon a time\u0026#151; her grandfather, Ludlow. She was surprised, but pleasantly so. \n","sourceLink":"https://allnovel.net/witchery-a-ghosts-of-albion-novel-ghosts-of-albion-2/page-19.html","bookId":2604,"book":{"id":2604,"title":"Witchery: A Ghosts of Albion Novel (Ghosts of Albion #2)","description":"Storyline: \n Witchery: A Ghosts of Albion Novel (Ghosts of Albion #2) \n William and Tamara Swift’s newfound sorcerous powers as Protectors of Albion pale before the demonic forces threatening Britannia. But William and Tamara have formidable allies in Lord Byron, Queen Bodicea, and Lord Admiral Nelson–England’s noble, notorious Ghosts of Albion. \n Responding to a plea from Cornwall, Tamara discovers that the rumors of young women, both human and fairy, vanishing without a trace are horribly true. Instead of hard clues, she uncovers only whispers of witches, infernal abductions, and a pyre of innocents planned for the solstice. Indeed, Tamara has never faced a more dangerous task–for the legendary land of King Arthur’s Camelot also harbors dark, bloody deeds and a waking evil. Soon nothing, not even mighty Albion, will be safe from the deadly peril.\n \n","cover":"https://allnovel.net/images/witchery-a-ghosts-of-albion-novel-ghosts-of-albion-2.jpg","author":"Amber Benson","type":"Horror","source":"allnovel","link":"https://allnovel.net/witchery-a-ghosts-of-albion-novel-ghosts-of-albion-2.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:29:43 PM"}}
