{"id":97819,"no":21,"title":"Page 21","content":"Right, let\u0026#146;s move quickly now,\u0026#148; he whispered, turning to the others who had gathered around him. \u0026#147;We must work together, fairy, ghost, and human alike.\u0026#148;\n Farris and Richard Kirk stood close by, grim purpose etched upon their features. Serena flitted through the air above Farris\u0026#146;s head and then settled upon his shoulder. Her tiny wings fluttered so quickly that he imagined her as a brutal wasp, ready to attack. The savage expression on her face did nothing to dispel the impression.\n Rhosynn, Fyg, and Ghillie stood nearby, so close to one another that they appeared to grow from the same root. The fairies watched William for a moment, then turned and gestured to the others in the woods. As one, the sisters of Stronghold began to move into the trees, spreading out across the hill without so much as the snap of a twig or the rustle of branches. The only sound was the whisper of the wind through the leaves.\n \u0026#147;Bodicea. Horatio. Quickly now, the other side of the hill. Watch for me to move, and then attack. For the lives of these unfortunate girls. And for Albion. Should Mordred live again, none of us shall be safe. The kingdom itself will be in peril.\u0026#148;\n \u0026#147;For Albion,\u0026#148; Horatio said, chin raised. He dared not raise his voice, and so it was not a proper battle cry, but the dignity engraved upon his spectral features communicated the gravity of his intent.\n The ghosts departed, splitting up, with Bodicea taking the westward route around the base of the hill and Horatio the east.\n William nodded in approval and gestured for Farris and Richard to spread out as well, to either side. The sprite took flight, but kept close to the man who had become far more than a butler to the Swifts.\n In the center, William started up the hill. He narrowed his eyes and peered into the darkness, wary of witches or the strange homunculi they had created from the earth, using the trapped ghosts of Pendragon\u0026#146;s knights. He passed beneath branches that creaked in the wind, and he flinched, staring upward, expecting dark figures to leap down upon him from the trees.\n But there was nothing. Only darkness and the wind.\n Whatever evil unfolded here tonight, it centered upon the clearing at the top of the hill. Tamara had surmised that the ritual would require the witches\u0026#146; entire focus, and it appeared that she was correct.\n Then something shifted in the trees behind him. William turned, tensed to defend himself, but again saw nothing. He paused there on the hill, heart pounding and throat dry with fright, and then he saw that his allies had all spread out to circle the cliff and advance to its top.\n And in the darkness, back the way he had come, several new figures now appeared. At first he felt a wave of fear, that these were enemies. Then he recognized the wavering specters of men in armor, grim knights whose immortal souls could not rest until they were certain that Mordred could not rise again.\n William wished for their aid, but he could not compel them. And he understood that it wasn\u0026#146;t cowardice which held them back. If the witches were to gain control of them, pervert them into homunculi and enslave them, the knights would become a danger to the Protectors and their allies, rather than a help.\n For a moment he gazed at them, though. A grizzled, bearded knight held his helmet beneath his arm. He was but a trace upon the darkness, an outline in the air, yet he offered a small bow.\n William returned the gesture, then turned to continue up the hill.\n Only then, alone in the darkness, maneuvering through the trees with what stealth he could manage, did he realize that there was one among his allies who was unaccounted for.\n John Haversham had disappeared.\n A shiver went through William. He knew he ought to be able to trust the man by now, but he simply could not.\n THE WIND DIED as Tamara stepped out of the trees and into the clearing at the top of the hill. The music of grief surrounded her, the high, mournful moaning of the six abducted fairies and the desperate, fearful, whispered prayers of the human girls who\u0026#146;d been snatched from Camelford.\n Their captivity was grotesque. The sacrifices were bound to the rowan trees that surrounded the clearing, not by rope or chain, but by magic. Their flesh had been subsumed by the wood and bark of the trees themselves; hands and faces and in some cases pale legs thrust from the wood, but their bodies were trapped within the very trunks of the trees.\n It was obscene. Unnatural.\n The clearing was alive with shifting shadows. The moon burned brightly above, yet dark shapes drifted across the sky, eclipsing it moment after moment. One by one the witches descended, alighting upon the ground around her.\n Tamara tried to focus on the nearest rowan tree and the familiar face there, the pale, freckled features of Christine Lindsay, cheeks streaked with tears and eyes wide with numb terror.\n \u0026#147;Protector,\u0026#148; whispered an insidious voice that crept beneath her skin. \u0026#147;We are honored.\u0026#148;\n One of the witches stepped nearer. Her hood obscured her face but what little of that long, twisted face Tamara could see was terrible enough. The wraithlike creature stalked toward her, impossibly thin beneath her robe, as though she was only skeleton and cloth.\n \u0026#147;You knew I would come,\u0026#148; Tamara said firmly.\n The witch bowed her head in acknowledgment. The others began to shift in a macabre dance around her, drifting toward one another, the cloth of their robes creating a horrid shushing, a rasp in the darkness. Their voices were the night itself, muttering and moaning, the wind in the eaves of a decrepit house.\n \u0026#147;It is your duty to come,\u0026#148; said the witch before her. \u0026#147;We had only to wait. The Protector could not turn away.\u0026#148;\n The demon-woman raised her head and now Tamara saw the eyes in that long, distended visage, each with a corona of gleaming yellow encircling a blackness darker than the devil\u0026#146;s heart.\n For a moment Tamara felt very small, like a little girl again, and she wished for nothing more than to be able to go back to the bedroom of her childhood and curl up beneath the lovely, thick blankets to watch the sun rise on the gardens of Ludlow House. She would always be that little girl. She had no business being here, throwing herself upon the mercy of these things, defying the powers of the darkness. It would swallow her, just as she had feared in those childhood days when shadowed dreams had woken her at night.\n Witches, she thought. Oh, what have I done?\n \u0026#147;Will you fight us now, Tamara?\u0026#148; whispered the witch.\n The others continued their dance and the susurrus of their voices began to drown out the cries and moans of their captives. Soft, cruel laughter came from everywhere and nowhere.\n \u0026#147;You cannot defeat us,\u0026#148; the monster said. \u0026#147;You must know that.\u0026#148;\n Tamara nodded. \u0026#147;I know.\u0026#148; She stared into those bottomless black eyes and held the witch\u0026#146;s gaze, becoming resigned. Then she stepped to one side and went around the witch, walking slowly. The whispering shadows of the daughters of Morgan le Fey parted to let her by. A sea of darkness, they shifted with her as she walked.\n \u0026#147;The grave is here, then? In this clearing? Mordred\u0026#146;s grave?\u0026#148;\n The witches began to laugh again, but there came no answer.\n They swept across the clearing and Tamara steeled herself, tried to clear her mind. She glanced around at the rowan trees. Some of the captive girls, fairy and human alike, stared at her from out of the wood with only vacant madness in their eyes. Tamara shivered and would not look at them.\n \u0026#147;The solstice approaches,\u0026#148; whispered the darkness. \u0026#147;Midnight is almost here.\u0026#148;\n The wraiths flowed to the center of the clearing and she understood then that they had never touched the ground. They were in flight, always, moving just above the earth like ghosts. The witches raised their hands in unison, extending long, gnarled talons. For the first time she could get a sense of how many there were, and thought perhaps thirty or forty at least.\n Thirty-nine would be three times thirteen, and that seemed right. Magical covens were purported to consist of thirteen.\n Could she and William destroy thirty-nine? Tamara bit her lower lip, and a terrible sadness washed over her, for she thought not.\n At the center of the clearing, the spot around which the witches gathered was slightly raised. The grave of Mordred. Tamara held her breath and stared at it, for until this moment she had been unsure that it was real. Even with the spectral knights they had encountered, this bern, beneath which lay ancient bones, was the first solid proof she had seen. All of the stories, all of the legends, were real.\n The blood of myth had soaked into the soil of Cornwall centuries ago. A dream had come to life, and the soul of Albion had gleamed brightly before the darkness had snuffed out its light.\n The darkness was called Mordred, and this night, the breeze came alive again, and it whispered his name.\n The witches opened their mouths grotesquely wide and then began to wail. Hands held high, they summoned ancient magic and the ground in which Mordred had been buried burst into flame. Fire erupted there, flames licking the sky. The blaze raged at the center of the clearing, casting a sickly orange light upon the black folds of the witches\u0026#146; robes and reaching into the darkness of the forest around them.\n The faces of the captive girls, human and fairy, stretched into masks of terror, creating a horrible tableau.\n Witches surrounded Tamara. She saw the half-melted face of Morveren, the witch that had guarded her the first time she had been brought here. Then two others grasped her arms. On instinct Tamara reached down into herself, then farther down into the soul of the land, and summoned the magical power that was hers to command. Her muscles tensed, her hands clenched into fists, and the magic began to spill out.\n \u0026#147;Too late for that,\u0026#148; one of the wraiths whispered into her ear, her breath cold on her skin, and stinking of rot.\n A terrible lethargy swept over her then. All of the strength left her, and the cold of the thing\u0026#146;s breath penetrated her flesh, straight to the bone. It moved through her like poison. Dread filled her, and sorrow, as the touch of the witches drew up from within her every moment of grief and doubt and anguish she had ever experienced or imagined.\n Darkness.\n Mordred, the shadows said in her mind.\n Brother.\n The witches considered themselves daughters of Morgan le Fey, and Mordred was her son. Their brother. A part-man with the blood of Albion on his hands.\n And Tamara\u0026#146;s death would help to restore him to life.\n The witches darted across the clearing, hurrying now. The fire blazed higher, roaring with infernal power. The wraiths went to each of the rowan trees and thrust their hideous fingers into the wood as though it were water, drawing out the girls, one by one. Six fairies. Five human girls.\n Tamara made six.\n \u0026#147;That\u0026#146;s twelve,\u0026#148; she said. \u0026#147;Not thirteen?\u0026#148;\n The witches drew them all toward the fire. They dragged Tamara now, since her legs were too weak to hold her, and her feet dug furrows in the ground. Her vision blurred, leaving nothing but flame and faces, the girls, the fairies, the witches\u0026#146; endless black eyes.\n \u0026#147;You are a clever girl, Tamara,\u0026#148; said a voice, sweet and familiar.\n She blinked and raised her head, then managed to stand. The heat from the fire seared her cheeks and dried her eyes. The stink of sulphur filled her nostrils and she breathed through her mouth.\n At the edge of the blaze stood a single witch, a figure with a strangely regal bearing. The others kept back ten feet or more from the fire, but this creature came close and faced Tamara. The witch laughed softly, an odd melancholy in the sound, and drew back her hood.\n A shushing went through the others and they shuddered. Tamara wondered if it was the beauty of this bright-eyed, blond-haired figure that troubled them, and she knew it must be a glamour.\n \u0026#147;We have met before, Protector of Albion. I am Viviane, witch queen.\u0026#148;\n Viviane, Tamara thought. But before, she was hideous. What\u0026#151;\n \u0026#147;You are wise not to fight, girl. You may touch the soul of Albion, but we are the black poison in its heart. We have slain Protectors in the past. You could not hope to stand against us.\u0026#148;\n Viviane smiled, the firelight raging behind her, casting her in shadow and silhouette. She moved ever closer. The other witches began to chant softly so that the sound crept across Tamara\u0026#146;s skin.\n The fire leaped and crackled in rhythm with their voices. The wraiths gripped the fairies and the village girls tightly, but they all seemed as disoriented as Tamara herself, so that they were just hanging in the grasp of their captors.\n \u0026#147;You are clever, though,\u0026#148; the witch queen said. \u0026#147;And correct. The ritual requires six human girls, six fairy girls, and a thirteenth. A virgin witch.\u0026#148;\n Tamara blinked, mustering what lucidity she could. \u0026#147;You? You\u0026#146;re going to just give yourself to burn?\u0026#148;\n The chanting grew louder. The hellish blaze roared; the entire clearing became a scene from the inferno.\n The witches began to drag the innocents toward the flames.\n Viviane stepped in close to Tamara. The witches gripping her arms tensed at the sudden nearness of their queen, but Viviane\u0026#146;s wide blue eyes were locked upon Tamara\u0026#146;s.\n Tamara breathed in and inhaled the sickly sweet breath of the witch queen, and she shivered with the intimacy of it.\n \u0026#147;Tamara,\u0026#148; Viviane whispered, her voice somehow very close, so soft despite the chanting and the crackling blaze.\n \u0026#147;Tam.\u0026#148;\n Blinking, Tamara tried to focus on the beautiful monster in front of her. As she did, Viviane\u0026#146;s face changed. For just a glimmer of a moment, Tamara was looking at John Haversham.\n She gasped.\n John gazed at her with sad eyes.\n \u0026#147;You ought not to have fought the enchantment I put on you, girl. So beautiful and clever and brave. I wanted to touch and taste you, to feel the softness of your skin.\u0026#148;\n Flesh and bone shifted, the glamour wavered, and again she was Viviane, the witch queen. Her smile had become a snarl.\n \u0026#147;But most of all, I wanted to live.\n \u0026#147;I told my sisters that I would bring you to them, that in the guise of your heart\u0026#146;s desire I would lead you here. I insisted that we have you, and only you. Foolish girl, if you had only let me take your maidenhood, then neither of us would have to die tonight, don\u0026#146;t you see? I don\u0026#146;t want to burn.\u0026#148;\n Masked in her glamour of beauty, Viviane slid her fingers behind Tamara\u0026#146;s head and bent to her. The witch queen brushed her lips against Tamara\u0026#146;s, and the kiss was electric. Tamara gasped, and an erotic wave swept over her.\n A cry of protest rose up in her mind, but she could not escape the truth. She had been enchanted into seduction before, but not by John Haversham. John had never come to Cornwall. It had been Viviane all along, who had inflamed her, entranced her.\n Touched her. The idea repulsed her, but the thrill of that kiss upon her lips was undeniable.\n \u0026#147;It was so perfect,\u0026#148; Viviane whispered. \u0026#147;Wait until the very last moment and then seduce you. The enchantment released you from your inhibitions, or it should have, but even under my spell you fought against your passion. I nearly tried to force you, but then the damned fairies arrived, and the moment had passed.\u0026#148;\n Once more, softly, Viviane kissed her. Tamara did not try to turn away.\n \u0026#147;And now we die,\u0026#148; the witch queen said.\n The witches holding Tamara hissed and began to drag her back, away from the fire, away from Viviane. The witch queen smiled at Tamara, and then her face changed again, the glamour gone, her flesh now gray and twisted, face long and cruel.\n She turned away, gesturing to her sisters to begin bringing the girls toward the flames.\n Tamara gritted her teeth. Viviane had ensorcelled her before, and now once again the witches had disoriented her with a beguiling spell. But they had underestimated her. These girls were about to burn. She herself would die. Viviane might be willing to sacrifice herself rather than admit to her sisters that she did not want to die, but the fairies and human girls did not have a choice.\n Viviane had attempted to use her, and her cheeks burned with the blush of embarrassment. But that was nothing next to the fear and fury in her at the thought of the people the witches had already murdered, and these other girls about to die. And what of Albion? What would happen to the soul of England if they succeeded, and Mordred rose again?\n \u0026#147;No,\u0026#148; she whispered, under her breath.\n The witches holding her stiffened and turned to study her closely. Their arrogance would be their undoing. Once before she had shattered the control of Viviane\u0026#146;s witchery.\n She was the Protector of Albion.\n Tamara bared her teeth in fury. The ground here was steeped in the black magic of witchcraft, but the land was still Albion. Closing her eyes, Tamara reached down into the earth with her very soul and a peaceful calm filled her, along with magic that raced through her veins and made her feel as though her entire body glowed with power.\n Her eyes snapped open. She turned to look at the witch on her right, twisted her wrist in the creature\u0026#146;s grip, and opened her hand. A spear of brilliant golden light erupted from her palm and impaled the witch. The creature howled as she was thrown back to the ground.\n Tamara glanced at the other, uttered a spell, and branches burst from the ground and punched upward through the witch\u0026#146;s flesh, pushing out from her throat and eyes, from her belly and legs, tearing her flesh and wrapping around her, huge, razor thorns glistening with black blood.\n Yet still she was not dead. She screamed and writhed. The one Tamara had first attacked was climbing to her knees.\n The chanting stopped. The virgin captives collapsed to the ground as the wraithlike witches abandoned them. Screaming in fury, they rushed toward her.\n Viviane spun and glared at her, but then a look of madness spread across her face and she grinned.\n The witch queen bent and grabbed one of the human girls by a fistful of her hair, then turned and hurled her into the fire. Shrieking in agony, the girl tried to pull herself from the flames, blackening, skin splitting, burning too quickly in the heat of that arcane blaze.\n \u0026#147;No!\u0026#148; Tamara screamed in anguish.\n Viviane glanced at her, a sad sort of merriment in her eyes. Then her expression flickered and Tamara thought she saw surrender there. Not to her, but to fate.\n \u0026#147;The time has come!\u0026#148; Viviane cried. \u0026#147;There is no turning back!\u0026#148;\n \u0026#147;William, on your life, come to me now, or all is lost!\u0026#148; Tamara screamed.\n The witches circled around her and she clapped her hands to her ears to keep them from bursting, so horrible was their screeching. Several of the black wraiths flowed across the clearing and surrounded Viviane, their queen. At her command, they began to lift the bewitched girls from the ground and turn toward the flames.\n Staring in horror, Tamara could barely draw a breath as she raised her hands, chanting a spell. Serpents of silver light darted across the night and coiled around one of the witches. A blond girl fell from her arms, near the fire, and began to crawl weakly away. From the cast of her features, Tamara knew it must be Sally Kirk, Richard\u0026#146;s sister.\n One of the fairy girls was next into the fire. Even as the witch hurled her onto the conflagration, she tried to break the bewitchment upon her. Beautiful, gossamer wings appeared on her back, but their purple hue burned black in an instant and they crinkled to ash.\n Tamara wept, even as the witches surrounding her moved in closer, blocking her view of the fire. She turned, furious, and lashed out with another spell, an arrow of golden light spearing the nearest of those wraithlike creatures.\n The spell. She could not kill them without that spell from The Lesser Key of Solomon. In the madness and horror of the moment, she struggled to find the words.\n Then William cried her name and she turned to see her brother rushing into the clearing, with the fairies at his side. In their shimmering gowns and with translucent wings painting the darkness in soft colors, they ought to have been beautiful and elegant, but there was something in their aspect that was just as terrible as the witches.\n A man shouted and raced in from her left, and she saw that it was Farris, with Serena flitting about his head and Rhosynn and a cadre of other fairies flying just above the ground, rushing at the witches. From her right she saw Richard Kirk enter the clearing with still more of Stronghold\u0026#146;s daughters.\n \u0026#147;Sally!\u0026#148; Richard called, his voice desperate as he rushed toward the nearest of the fallen girls, searching for his sister. \u0026#147;Sally!\u0026#148;\n The sound of his voice cut through the shrieks of the witches and first one, then another and another of them turned away from Tamara.\n One of the wraiths separated from the others, and in the firelight Tamara had a glimpse of the half-melted face of Morveren.\n The witch started toward her. \u0026#147;Still pure, you are,\u0026#148; she said. \u0026#147;Midnight hasn\u0026#146;t come yet, and we\u0026#146;ve already performed the first sacrifice. It\u0026#146;s not too late.\u0026#148;\n Tamara shook with rage and revulsion. Past Morveren, she saw William running toward her. No, not toward her, but toward Viviane and the other witches who even now were carrying fairies and human girls to the fire.\n The fairies rushed to aid their kin.\n When Viviane saw the attacking force, she turned and gestured for the witches to put the girls down. For the moment, the ritual was interrupted. The witch queen glanced across the clearing at her, and Tamara was sure it was a knowing grin upon Viviane\u0026#146;s features.\n She had been well aware of the forces massing against her and her sisters, and yet she had not warned the other witches. Girls were burning, fairies screaming, witches were wounded, ruined, and Viviane had not bothered to try to stop it.\n Tamara flinched with understanding. Viviane had not been willing to openly defy her sisters, the daughters of Morgan le Fey, but they had consigned her to death by fire, chosen her for their sacrifice. She would not stand against them, but she was not going to help them end her life, either.\n Betrayal. Vengeance.\n Witchery.\n Farris stalked toward the witches around Tamara, both pepperbox revolvers drawn.\n \u0026#147;Get them out of here!\u0026#148; Tamara shouted. \u0026#147;Take the girls to safety!\u0026#148;\n Fingers contorted, twisted like the talons of a witch, she shouted the spell from The Lesser Key of Solomon. The magic was summoned up inside her in an instant, and she felt it rush from her, blowing her hair back. Crimson light, red as blood in the gleam of moon, erupted from her hands and coiled around Morveren as the scarred witch lunged at her.\n The creature screamed, threw back her head, and once again opened her hideous mouth grotesquely wide. Something raced up out of her mouth, a swift, twisting thing, withered and thin but still bright as starlight.\n It was all of her that was human, and Tamara had just torn it out of her, so that only demon remained.\n Morveren bent over, face even more hideous now. The demon opened her maw and flames licked the back of her throat. Those black eyes were sunken more deeply and the skin at her temples split as small horns burst through.\n \u0026#147;Foolish girl, do you know what you\u0026#146;ve done?\u0026#148;\n Tamara smiled. \u0026#147;Oh, yes. I know precisely what I\u0026#146;ve done. I\u0026#146;ve made you stronger, uglier, and more terrible and you\u0026#146;re not a witch, anymore. No magic, darling.\u0026#148;\n The demon raised her gnarled hands and stared at them. She snarled, opened her mouth, and thrust her head forward. Flame roared from her gullet, but Tamara threw up a protective ward that dispelled it easily.\n Howling in fury, the thing lunged at her, flying through the air. Demons had hellish power of their own, but when they appeared in the flesh that power was limited, and Morveren was only a newly formed demon.\n Tamara raised her hands, spheres of golden light forming around them.\n A pair of shimmering ghosts darted through the air above the clearing.\n \u0026#147;A curse upon your souls!\u0026#148; screamed the specter of Queen Bodicea, and she descended from the night sky and brought her sword sweeping around to slash into the nearest witch.\n The ghost of Admiral Nelson appeared at Tamara\u0026#146;s side and slid past her, his translucent form nevertheless formidable.\n \u0026#147;Allow me, my dear!\u0026#148; Horatio cried, and he impaled the demon-Morveren upon his blade.\n The creature screamed, unused to such agony. Horatio thrust deeper and twisted the blade. The demon began to claw at his spectral flesh, slashing through it, but Horatio drove Morveren to the ground and withdrew the blade. The ghost raised it high and as the demon tried to rise, he hacked off her head.\n Morveren struck the ground with a thump that seemed to shake the very hill itself.\n Bodicea struggled with one of the witches. Black ribbons of hatred, of poisonous sorcery, wrapped themselves around her, but the spectral queen fought on. The other witches rose into the air, shrieking horribly, faces distorted, and started to rush at the fairies and their human allies who were trying to drag the confused and terrified girls from the clearing.\n Tamara glanced at the moon, wondering how long it was until midnight.\n This wasn\u0026#146;t over yet.\n The fire still burned over Mordred\u0026#146;s grave.\n RHOSYNN OF STRONGHOLD DASHED through the air, all else forgotten. Lorelle lay on the earth, so fragile, so small.\n The witches were screaming, rising up. The Protectors were fighting. Their ghostly allies had arrived. The stench of foul blood filled the clearing, mixing with the sulphur of their hellish blaze.\n The fairy warriors attacked the witches. They spread out, as archers drew back their bowstrings and let fly arrows enchanted with all of the magic of Faerie, of the homeland. As Rhosynn ran to Lorelle\u0026#146;s side she heard a cry as of the anguished damned above her, and looked up to see a witch flailing in the air, gripping a fairy arrow that jutted from her heart. The thing plunged into the fire over Mordred\u0026#146;s grave and her hands beat at the flames for a moment before she was engulfed entirely. She writhed in the fire, still alive. \n","sourceLink":"https://allnovel.net/witchery-a-ghosts-of-albion-novel-ghosts-of-albion-2/page-21.html","bookId":2604,"book":{"id":2604,"title":"Witchery: A Ghosts of Albion Novel (Ghosts of Albion #2)","description":"Storyline: \n Witchery: A Ghosts of Albion Novel (Ghosts of Albion #2) \n William and Tamara Swift’s newfound sorcerous powers as Protectors of Albion pale before the demonic forces threatening Britannia. But William and Tamara have formidable allies in Lord Byron, Queen Bodicea, and Lord Admiral Nelson–England’s noble, notorious Ghosts of Albion. \n Responding to a plea from Cornwall, Tamara discovers that the rumors of young women, both human and fairy, vanishing without a trace are horribly true. Instead of hard clues, she uncovers only whispers of witches, infernal abductions, and a pyre of innocents planned for the solstice. Indeed, Tamara has never faced a more dangerous task–for the legendary land of King Arthur’s Camelot also harbors dark, bloody deeds and a waking evil. Soon nothing, not even mighty Albion, will be safe from the deadly peril.\n \n","cover":"https://allnovel.net/images/witchery-a-ghosts-of-albion-novel-ghosts-of-albion-2.jpg","author":"Amber Benson","type":"Horror","source":"allnovel","link":"https://allnovel.net/witchery-a-ghosts-of-albion-novel-ghosts-of-albion-2.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:29:43 PM"}}
