{"id":62506,"no":16,"title":"Page 16","content":"Karen\u0027s Aerie - Harry at Perchorsk\\n\\n \u0027First of all, let me explain that no human being could ever adequately describe an aerie of the Wamphyri. I don\u0027t think our language, or any language of the old world, has the right words for it. Or if there are such words, then the description would become so repetitious - so laced with grisly-sounding adjectives - that the entire exercise would soon become a bore.\\n\\n That\u0027s why I\u0027ll tell it as I saw it, like describing a picture or series of pictures, without putting too much emphasis on the grotesque anomalies and abnormalities of the ... but there! - do you see what I mean?\\n\\n \u0027The Lady Karen\u0027s aerie had belonged to Dramal Doombody, and so it has to be fairly representative of all the aeries, or castles if you wish, where they sit atop those fantastic stacks. So let\u0027s begin with the stacks themselves:\\n\\n \u0027As far as I was able to tell they\u0027re natural, weathered out from the mountains in their slow retreat. Why the stacks should remain while the earth around them crumbled... I\u0027m no geologist. Maybe they were once the cores of a series of volcanoes, choked with a basalt magma which was tougher than the surrounding cones. The craters have long gone but these titan plugs remain. That\u0027s theory, of course, and anyway it doesn\u0027t matter. The stacks are real, and since time immemorial the Wamphyri have built their aeries on them.\\n\\n \u0027But just looking at a stack from a distance, you don\u0027t see the entire picture. By that I mean that you don\u0027t see the actual stack. It\u0027s there, inside the shell, but what you see is that shell, which through the ages the Wamphyri have built around the inner core. So ... the next question has to be: what is this artificial \"skin\" made of?\\n\\n \u0027Well, I think the best way to answer that would be to liken a stack to coral on a submarine shelf. The stone is there, and the living coral forms a skin on it, and the skin dies and itself becomes stone. So on the submarine shelf the \"skin\" is dead coral. And on the stacks... it\u0027s dead flesh.\\n\\n \u0027When an aerie requires repairs or extensions, the Wamphyri breed cartilage creatures whose sole function is to bridge a gap, form a section of wall, roof over a new hall or causeway. Which is to say, their living bodies form the building or repair materials. Except I said \"breed\" and that\u0027s the wrong word. They don\u0027t really breed anything, they merely change what already is. They take out of storage a troglodyte, perhaps, or punish a vampir-ized henchman who has been remiss in some way, or maybe steal a Traveller or two from Sunside. All human or sub-human flesh is the same to the Wamphyri. They can take it, change it, mould it to their individual needs. These cartilage things lock themselves in position wherever they\u0027re required, die and eventually fossilize there. Being of vampiric origin - having been vampirized - they take a long time to die; maybe they don\u0027t die as we understand it, but simply age and become... fixed.\\n\\n \u0027So what I\u0027m saying is this: when you walk through an aerie, as often as not you\u0027re surrounded by the fused, polished bones and the hard, leathery hides of what were once men. And if you look closely enough - which is something you very quickly learn not to do - then you start to recognize the shapes of altered rib-cages, thigh bones, spinal columns and even... but I think you get the picture.\\n\\n \u0027The Wamphyri can stand extremes of cold. That\u0027s not to say they prefer it, simply that they seem inured. Except when under siege, they do heat their stacks with a complicated sort of central heating. Gasses are burned in the base of the stack and the hot air is channelled through pipes - great, hollow bones, usually - to every level. Other pipes carry the gas itself, which may then be burned as required. There are two sources for these gasses.\\n\\n \u0027Each aerie has its refuse pit. \"Refuse\" to a Wamphyri Lord can be anything from bodily wastes to wasted bodies. You know what vampires feed on. Well, they\u0027re not obliged to (indeed they can go without blood, without sustenance generally, indefinitely) and they do vary their diets with vegetable fibers, various oils, even fruits which are gathered during sundown on Sunside. They have vast storehouses of foods such as these, not to mention larders of suspended troglodytes and Travellers. In this instance, let\u0027s consider their \"usual\" fare.\\n\\n \u0027If a person is eaten and it is not desired that he or she becomes a vampire, then the remains of the meal go to the refuse pit along with all other garbage. Consider that a stack or aerie may house a thousand or more - creatures - and you get something of an idea of the contents of a refuse pit. Gasses are of course generated in large volumes. These are the gasses which are usually burned close to their source, in the bowels of the stack. Wamphyri conduits are leaky systems at best, and if gasses such as these were allowed to escape... the atmosphere in the rest of the aerie would be quite intolerable.\\n\\n \u0027Also to be found in the lower levels are the stables of the gas-beasts. These are what their name describes them to be: living gas bladders, as mindless as the cartilage creatures. Their single function is the production of gas. They are fed on coarse grasses and a little grain; obviously, the gas these beasts produce is close to methane; I don\u0027t think I need to explain further than that...\\n\\n \u0027Water:\\n\\n \u0027Now, I said that in their way the Wamphyri are scrupulous. The Lady Karen bathed frequently, as often as I myself. I watched her bathing and it was as if she tried to scrub the taint out of herself, which of course she never could. But she didn\u0027t stop trying. Oh, she talked hard to her retainers, but what was she inside but a poor frightened girl? At least, she had been.\\n\\n \u0027Anyway, you\u0027ll appreciate that water does not rise as readily as gas. In our world it has to be pumped uphill, or \"rammed\" under pressure, or else it arrives by aqueduct from a source higher still. The aeries have their catchment areas, inward-sloping skins on all levels, channelling rain water into great barrels with overflow systems into other barrels. In the event of a great downpour, wells at the foot of the stacks are filled to brimming. When all reservoirs are filled, then the skins are allowed to hang loose like flags. In fact they\u0027re woven with the various Wamphyri sigils and so act as their banners as well. But the rains are infrequent and if an aerie were under siege this system alone would be unreliable. That\u0027s why there\u0027s a back-up.\\n\\n \u0027You\u0027ll understand the meaning of \"capillary attraction\"? The way sap rises through a stem, or water between sheets of glass? The Wamphyri use capillary attraction to lift water from their wells to the tops of their aeries. The tubes through which the water passes are quite literally capillaries - those same narrow tubes which connect veins and arteries. Real capillaries, Jazz, whose owners lie in placid heaps of pseudolife in secret rooms high in the aeries. Secret because the Wamphyri will not tolerate their creatures except in their proper places. They know the difference between acceptable and unacceptable, you see. And the proper place for a thing whose veins hang down inside pipes through half a mile or more of stack is, obviously, at the top of such a stack. And so, because they\u0027re unseemly, the Wamphyri hide them away.\\n\\n \u0027I stumbled across just such a room and its inhabitants in the Lady Karen\u0027s aerie. That\u0027s all I can remember of it: that I found it, and then that someone found me and took me out of there. I had fainted. My mind hasn\u0027t retained anything of the episode except the fact that it happened. And this was only retained - as a warning, I suppose - in case I should forget totally and wander back that way again. Needless to say, I never did wander back that way again.\\n\\n \u0027Also to be found in the lower regions: the pens of the warriors. The warrior creatures are kept, like lions in a Roman amphitheatre, close to starvation. Or they would be except for one thing: like the Wamphyri, they don\u0027t need to eat. When they do eat, their food is invariably meat, preferably living. They are pure carnivores, created to tear, maim, kill - and devour. Their reward in battle is to be allowed to glut themselves. They fly into battle, launching themselves from the stacks and squirting through the sky like giant squids; but if they\u0027re victorious, they soon become far too bulky to fly back again to their aerie and so return across the boulder plains as best they can. Apart from battle proper, the Wamphyri also use them during sundown for the rounding up of Travellers. Then, too, if they are successful, they\u0027re allowed the occasional titbit.\\n\\n \u0027But enough about them. Just pray God, if you\u0027re a believer, that you never see one. And especially that you never see one in battle...\\n\\n \u0027Flying beasts are stationed at various levels. You\u0027ve seen them and know what they look like. They aren\u0027t especially dangerous, not on their own. Grounded they\u0027re clumsy, stupid; aloft they are graceful in their own alien sort of way. For control they are linked closely with their masters - by telepathy. It has to be that way when the Wamphyri ride them to battle. They are the sky-floating command-posts of their masters.\\n\\n \u0027One other thing about the Wamphyri in battle: they | have their own codes of combat, their own warped i \"values\" and ideas about valour, chivalry and such! Can you imagine that? But each one of them changes these values to suit himself, to his own advantage. If ever it gets down to hand-to-hand combat, one against one, the single weapon deemed allowable by high-ranking aerie masters - the Lords and their aides or lieutenants - is the war-gauntlet. Somewhere in the east, in a small Gypsy settlement, those hideous weapons are made to order for the Wamphyri. All metal things are made for them; they have no understanding of metalworking, or more correctly, they have a general dislike for metals. Silver is a poison, iron despised, only gold is relatively acceptable.\\n\\n \u0027So, I\u0027ve covered a few points, helped to give you something of a picture of Wamphyri life and how their aeries operate. It\u0027s all too complicated for me to be more specific than that. Now, if you still want to hear it, I\u0027ll go on and tell you about my own experiences in the Lady Karen\u0027s aerie\\n\\n Jazz had finished bathing and now climbed out of the river. He felt a lot easier, relaxed; the water had washed away most of his coiled-spring tension. He squeegeed the water from his body with the hard edges of his hands, shivered a little in the oh-so-gradually fading rays of the sun where it sat over the horizon\u0027s edge. As he began to dress and before Zek could continue her story, they spotted Lardis returning across the rim of the riverbank.\\n\\n Jazz had disassembled most of his combat-suit harness, leaving only the belt and upper cross-straps with their various attachments. As Lardis arrived and cast a speculative eye over the several items of gear where they lay spread out, so Zek gave Jazz a helping hand to get himself kitted-up again. He preferred to sleep fully-rigged, or at the very least in \u0027skeleton order\u0027, so that he could wake up ready for any eventuality.\\n\\n Finally, taking out a cigarette and lighting it, Jazz turned to the Gypsy leader - in time to see him twist and yank the pin from a fragmentation grenade!\\n\\n Jazz drew air in a gasp, threw Zek aside and down, leaped toward Lardis. The other had not yet seen the consternation on Jazz\u0027s face. He frowned at the grenade in his left hand and the pin in his right. Jazz snatched the grenade away from him. He\u0027d been counting in his head: one, two, three -\\n\\n He hurled the grenade out over the river. Four, five -\\n\\n It made a small splash - and immediately made a much larger one!\\n\\n The detonation thundered, but most of the razor-sharp shrapnel was lost in the river. Some fragments whistled where they slashed the air overhead; a fountain of water rose up, sprayed out, fell back; the echoes of the detonation came back from the foothills and the water of the river slapped in wavelets against the bank. Dozens of stunned or dead fish were already floating to the surface.\\n\\n Lardis closed his mouth, looked at the firing-pin in his hand - hurled it violently away. \u0027Eh?\u0027 he said then. \u0027What - ?\u0027\\n\\n Jazz scowled at him, said: \u0027Pretty effective fishing!\u0027\\n\\n His sarcasm was lost on Lardis. \u0027Eh? Oh, yes, I suppose it is!\u0027 The squat, bemused man turned away, went to climb the riverbank and calm his people where they came running. \u0027Indeed it is!\u0027 he finally, emphatically, agreed. \u0027But I think I prefer to do it my way.\u0027 He glanced at Jazz\u0027s weaponry laid out on the riverbank. \u0027Er, show me these interesting things of yours some other time. Right now I\u0027ve much to do.\u0027 Jazz and Zek watched him walk away...\\n\\n As Jazz packed his kit again and settled down comfortably where he intended to sleep, Zek continued her story:\\n\\n \u0027I had my own room in Karen\u0027s aerie. She and I shared the topmost level - literally acres of rooms, all of them enormous - where we were the only human creatures. Remember, the Wamphyri are human; it\u0027s the vampire in each one of them which makes him alien, and Karen\u0027s vampire had yet to gain total ascendancy. So we were the only people up there, but there was a warrior. It was a small one of its sort, which is to say it was about as big as an armoured personnel carrier and just as deadly! It guarded the stairwell to the next lower level. That was how well Karen trusted her aides.\\n\\n \u0027Then there were the water-drawing creatures, which I\u0027ve already mentioned. And that was all, nothing and no one else.\\n\\n \u0027Every so often (I calculated at the time that it was about every twenty-four hours) Karen would hold audience. She\u0027d call her lieutenants up from below, all seven of them, none of them having an egg, and apportion the aerie\u0027s duties or check on orders already issued. Then they\u0027d make their reports, warn of any deviations in the balance which the aerie maintained, detail their recommendations, and so forth. It was like a military \"O\"-group, in a way, with Karen as the C-in-C. And she carried it off very well. These were the only occasions when I saw Karen\u0027s men without their gauntlets. Her warrior had orders - direct from her mind -to savage anyone who attempted to enter her level wearing a gauntlet.\\n\\n \u0027But don\u0027t be misled by anything I\u0027ve said about her. Don\u0027t in any way make the error of believing she was vulnerable. For she wasn\u0027t; not physically, anyway. She was Wamphyri! - the real thing - and her lieutenants knew it. She looked, and for the moment perhaps still thought like a young woman, yes, but that was only the shell.\\n\\n \u0027Within her she had a vampire and its strengths were hers, growing stronger every day. If she appeared weak it was simply that she didn\u0027t want her underlings to test her, didn\u0027t want to have to punish them as she\u0027d been obliged to punish Corlis, for that might mean calling again upon the monster within her for its assistance. And she was dedicated to her stance, which was to hold it at bay. Let it gain true ascendancy just once... she believed it would dominate her always. And eventually it will, of course, for that is the nature of the vampire. Karen is doomed to change, to metamorphosis, to the gradual deterioration of what she was into what she must become...\\n\\n \u0027I remember that toward the end of my captivity there in her aerie, I asked her what Corlis could have done that she\u0027d wished to banish him to the hell-lands. Perhaps because I was the only one she could talk to without worrying about their motives, she told me all about it.\\n\\n \u0027Corlis had been the biggest of Karen\u0027s men, both in size and in the aerie\u0027s pecking order. He was also surly, a troublemaker, the Wamphyri equivalent of a male chauvinist whatever - in spades! Even as a Traveller he\u0027d been a brute, but that had been forty years ago. Then he had been taken in a raid, since when he\u0027d served Dramal Doombody - if \"served\" is the right word for it. God knows why Dramal suffered him, but the ways of the Wamphyri are never easy to figure out. Maybe at one time Dramal intended that Corlis should have his egg. But that\u0027s pure guesswork, of course.\\n\\n \u0027Let me explain Corlis like this: he wasn\u0027t true Wamphyri, but if ever a man should have been then he was that man. And he knew it.\\n\\n \u0027Most men would shrink from the idea, but not Corlis. He wanted an egg - and the power it would bring. He wanted to be master of the aerie, a Wamphyri Lord. He would like nothing better than to ride to war on the back of a flying beast, and command his warriors in their terrifying aerial battles. But while he and the others called themselves Wamphyri, they knew that in fact they were merely the undead servants of their true vampire mistress. And that was the great thorn in Corlis\u0027s side.\\n\\n \u0027He had asked the Lady Karen that she make him the aerie\u0027s warlord. To which she\u0027d replied that she had no need of a warlord, for there was no war. He had demanded rank and position above his fellows, only to be told he had no right to such honours. There was room for only one master (or mistress) in an aerie, and in this aerie that one was the Lady Karen herself. Then Corlis had offered himself as Karen\u0027s consort and protector - at which she\u0027d lost her temper and told him she\u0027d rather sleep with a warrior! As for his protection: he should worry about protecting himself, especially if he intended to continue his current campaign of mischief and annoyance.\\n\\n \u0027But Corlis wasn\u0027t to be put off lightly. He\u0027d argued heatedly that the other Wamphyri Lords were plotting for war, that now that Dramal was dead the aerie was vulnerable, and that Karen, a mere woman, could never hope to achieve any sort of effective command of her army in battle. She should choose her champion now, without delay, and the champion she chose had better be him!\\n\\n \u0027At that Karen had ordered him out of her presence, Corlis and the other six with him. Four of them had made to obey her, but the others...\\n\\n They had sided with Corlis. And warning off the four who remained half-loyal to her, Corlis and his two (for surely he\u0027d suborned them) had surrounded her where she sat upon her throne of office, which had once been Dramal Doombody\u0027s \"bone-throne\", made of the curved, fossilized jaw of a vast cartilage creature. From under his jacket, one of these traitors produced a stake of wood, forbidden in every aerie since time immemorial, and sprang at her. The second produced chains of iron, to bind her. As for Corlis:\\n\\n \u0027He stood, arms akimbo, and watched. His plan was this: to stake Karen through her vampire heart and then, when she lay helpless, to threaten her with decapitation and fire. This threat, he hoped, would drive her vampire to produce its egg, for even immature vampires will do this when true death seems imminent. The egg would be his, for he intended to be in such a position as to leave no alternative host. Namely: fused sexually with his victim!\\n\\n \u0027But Karen had divined his purpose. Being Wamphyri, she\u0027d been gifted with an element of telepathic talent. Now, in her hour of need, that talent worked for her not only in reading Corlis\u0027s intentions, but also to call her warrior creature from its vigil at the top of the stairwell. The creature came - and swiftly!\\n\\n \u0027Corlis and his two now held Karen down. She was not wearing her gauntlet, but still she put up a fight. She wouldn\u0027t lie still long enough for the one with the chains to bind her; her nails opened up Corlis\u0027s face; she kicked the one with the stake repeatedly in the groin! And the four who were half-faithful were torn two ways: they danced here and there, undecided, not knowing what to do for best. But then, when they saw Karen\u0027s warrior coming... Ah! - but then they knew what to do for best!\\n\\n Two of them leaped on the one with the stake and dragged him away. The enraged warrior took him from them and that was the end of him. He had no egg; he was just flesh, however vampirized; the warriors know how to deal with mere flesh. The other two more-or-less-faithful ones fell on Corlis where he tried in vain to rape Karen, and finally they pinned him down. That left the Lady herself to deal with the one who had tried to chain her. Unlike Corlis this one was small, and Karen\u0027s full vampire fury had been roused!\\n\\n \u0027She dragged him screaming to her throne and drove his face down on the jagged cartilage finial which formed the grip at the end of an arm rest. The finial was the eye-tooth of the creature whose massive jaw formed the throne; it entered the traitor\u0027s mouth and came out at the base of his skull, so that he kneeled there and flopped about like a speared fish. He was taken to the refuse pit.\\n\\n \u0027And Corlis, of course, was taken to the Gate\\n\\n Zek looked at Jazz where he lay awake and listening. But she saw that he was blear-eyed and close to the edge of sleep. \u0027I\u0027m tired, too,\u0027 she said. \u0027Let\u0027s sleep now, and I\u0027ll finish up on the next leg of our journey. We\u0027ll be spending the long night in the caves, I should think. You can ask me any questions then. And by then, too, you\u0027ll know just about as much as I do.\u0027\\n\\n Jazz nodded. \u0027You\u0027re doing a great job,\u0027 he said, watching her lie back in her sleeping-bag. Then he stifled a yawn, said: \u0027Zek?\u0027\\n\\n \u0027Yes?\u0027 she turned her head and looked at him, her face a strange mixture of mystique and ingenue.\\n\\n \u0027If and when this is ever finished, I think maybe you and I -\u0027\\n\\n She shook her head, cutting him short. \u0027We\u0027re drawn to each other because we\u0027re all we have,\u0027 she said. \u0027In the caves we can be together, if that\u0027s what you want. But don\u0027t think I\u0027m being generous, for I want it too. Just don\u0027t make me any promises about if and when, OK? We don\u0027t know \"if\" - and we certainly don\u0027t known \"when\"! Going home, should we ever be so fortunate, will be like stepping out of darkness into light. We might see each other very differently. Let\u0027s leave it at that.\u0027\\n\\n He smiled, yawned again and nodded. A hell of a woman! \u0027OK, but I\u0027ve always been an optimist, Zek. Take my word for it: we\u0027ll make it!\u0027\\n\\n She lay back, closed her eyes, said: \u0027Well, here\u0027s to optimism, and to the conclusion of a trouble-free trek -and to the Dweller, and, oh - \u0027\\n\\n The future?\u0027\\n\\n The future, yes,\u0027 she agreed. \u0027I\u0027ll drink to that. God knows it has to be better than the past.\\n\\n From Leipzig, Harry Keogh returned direct to E-Branch HQ in London. He materialized in the armoury, a room not much bigger than a cupboard, took a 9mm Browning automatic and three full magazines (and signed for them) and was out of the place almost before the alarms could start up.\\n\\n Then back to Jazz Simmons\u0027s flat where he donned a black shirt, pullover and slacks, and finally to Bonnyrigg near Edinburgh to visit his mother. This last wasn\u0027t absolutely necesary, for once Harry had communicated with a dead person he could usually speak to that person again even over great distances, but whenever possible it seemed only polite and much more private and personal to go to them in their final resting places or the places where they had died.\\n\\n \u0027Ma,\u0027 he said, the moment after emerging onto the riverbank above the place where the water gurgled dark and deep. \u0027Ma, it\u0027s Harry.\u0027\\n\\n Harry! she answered at once. I\u0027m so glad you\u0027ve come. I was just about to start looking for you.\\n\\n \u0027Oh? Is there something, Ma?\u0027\\n\\n You asked about people dying in the Upper Urals.\\n\\n \u0027Jazz Simmons?\u0027 For a moment Harry felt like the ground had been ripped out from under him. If Simmons was dead after all, here in this world, it rubbished all of Harry\u0027s and Mobius\u0027s theories. And it left Brenda and Harry Jnr stranded .... wherever.\\n\\n But: Who? his mother seemed taken by surprise. But only for a moment. Oh! No, not him. We couldn\u0027t find him. This is someone else. Someone who knew him.\\n\\n \u0027Someone who knew Jazz Simmons? At Perchorsk?\u0027 Relief flooded through Harry. \u0027Who are you talking about, Ma?\u0027\\n\\n A different voice spoke in Harry\u0027s head. A voice that was new to him. She means me, Harry. Kazimir Kirescu. I knew Jazz, yes, and now I\u0027m paying for it. Oh, I don\u0027t blame him, but someone is to blame. Several people. So... if you can help me, son, then I\u0027ll be very glad indeed to help you.\\n\\n \u0027Help you?\u0027 Harry stood on a riverbank in Scotland and talked to a dead person two and a half thousand miles away, and it seemed perfectly natural to him. \u0027But how can I help you, Kazimir? You\u0027re dead, after all.\u0027\\n\\n Ah! But it\u0027s how I died, and it\u0027s where I am now.\\n\\n \u0027You want revenge, through me?\u0027\\n\\n That\u0027s part of it, yes, but mainly I want... to be still!\\n\\n Harry frowned. Often the dead were more vague than the living. \u0027Maybe I\u0027d better come and see you. I mean, this is sort of impersonal. Is it safe where you are?\u0027\\n\\n It\u0027s never safe here, Harry, Kazimir told him. And where I am it\u0027s always horrible. I can tell you this much: I\u0027m in a room at the Perchorsk Projekt, and at the moment I\u0027m alone. At least there are no people with me. But... do you have a strong stomach, Harry? How are your nerves?\\n\\n Harry smiled briefly. \u0027Oh, my stomach\u0027s strong enough, Kazimir. And I think my nerves will hold up.\u0027 Then the smile slipped from his face. What was the other\u0027s situation, he wondered?\\n\\n Then come, by all means, said the old man. Only don\u0027t say I didn\u0027t warn you!\\n\\n Harry grew cautious. It had been his intention to visit Perchorsk anyway. That was why he had come to see his mother; so that with the aid of her friends she could guide him there. But now... \u0027Just tell me this,\u0027 he said. \u0027If I come, right now, will my life be endangered?\u0027\\n\\n No, nothing like that. I\u0027ve been told you can come and go as you wish, and in any case we\u0027re not likely to be disturbed - though there is always that possibility. But... I\u0027m with something that isn\u0027t pleasant. The old man\u0027s mental voice was full of shudders.\\n\\n \u0027I\u0027ll come,\u0027 said Harry. \u0027Just keep talking to me and I\u0027ll home in on you.\u0027 He conjured a Mobius door and followed Kazimir\u0027s thoughts to their source...\\n\\n At Perchorsk it was an hour after midnight. The room of the thing was in darkness, where only the red ceiling lights gave any illumination. Harry emerged from the Mobius Continuum there, stared all about in the red-tinged gloom and felt the sinister heart of the place throbbing through the floor under his feet. Then he saw the tank, and the shape inside it, but for the moment he couldn\u0027t quite see what that shape was.\\n\\n Me! said Kazimir Kirescu. My resting place. Except it doesn\u0027t rest.\\n\\n \u0027Doesn\u0027t rest?\u0027 Harry repeated him, but softly. There were dimmer switches on the wall, a nest of them. Harry reached for them, went to turn up the lights. They came up slowly. \u0027Oh, my God!\u0027 said Harry in a shaky whisper. \u0027Kazimir?\u0027\\n\\n That\u0027s what ate me! the other answered, in a voice horrified as Harry\u0027s own. That\u0027s where I am. I don\u0027t mind being dead so much, Harry, but I would like to lie still.\\n\\n Harry moved uncertainly across the room toward the creature in the tank. It seemed slug- or snail-like; its corrugated \u0027foot\u0027 or lower body pulsated where it adhered to the glass wall; atop its lolling neck sat an almost human head with the face of an old man. Flaccid \u0027arms\u0027 hung down bonelessly from rubbery \u0027shoulders\u0027, and several rudimentary eyes gazed wetly, vacantly from where they opened like suckers in the thing\u0027s dark skin. Its normal eyes - those in the old man\u0027s face - moved to compensate for the languid lolling of the head, remained firmly fixed upon Harry. But they were only normal in that they occupied a face. Other than that, they were uniformly scarlet.\\n\\n My face, said Kazimir with a sob. But not my eyes, Harry. And dead or alive, no man should be part of this thing.\\n\\n And then, while Harry continued to stare at the monstrosity, Kazimir told him all he knew about the Perchorsk Projekt, and of the events leading to his current predicament...\\n\\n Fifteen minutes later and a mere fifty yards away:\\n\\n Major Chingiz Khuv, KGB, came awake, sat up jerkily in his bed. He was hot, feverish. He\u0027d been dreaming, nightmaring, but the dreams were quickly receding in the face of reality. Reality, as Khuv was well aware, was often far more nightmarish than any dream. Especially here in Perchorsk. But it was as if the unremembered dreams were premonitory; Khuv\u0027s nerves were already jangling to the buzzing of his doorbell. He got up, threw on a dressing-gown and went to the door.\\n\\n It was Paul Savinkov, puffing and panting from his exertions, his fat hands fluttering.\\n\\n \u0027What is it, Paul?\u0027 Khuv brushed sleep from the corners of his eyes.\\n\\n \u0027We\u0027re not sure, Major. But... Nik Slepak and I - \u0027\\n\\n Khuv came fully awake on the instant. Savinkov and Slepak were both ESP-sensitives; they could detect and recognize foreign telepathic sendings, psychic emanations, anything of a paranormal nature. And in the event of ESPionage, they were adept at intercepting and scrambling alien probes.\\n\\n \u0027What is it, Paul?\u0027 Khuv demanded this time. \u0027Are they spying on us again?\u0027\\n\\n Savinkov gulped. \u0027It could be worse than that,\u0027 he said. \u0027We think ... we think something is here!\u0027\\n\\n Khuv\u0027s jaw dropped. \u0027You think something is - ?\u0027 he grabbed the other\u0027s arm. \u0027Something from the Gate, do you mean?\u0027\\n\\n Savinkov shook his head. His fat face was shiny, eyes very bright. \u0027No, not from the Gate. Those things that come through the Gate, they leave a slimy trail in the mind. They\u0027re alien - to this world, I mean. This thing we can sense here, it isn\u0027t that sort of alien. It might even be a man; Nik Slepak thinks so. But it - he, whatever - has no right to be here. Two things we\u0027re sure of: whatever it is, it\u0027s powerful! And it is here.\u0027\\n\\n \u0027Where?\u0027 Khuv threw back the top half of his dressing-gown, thrust his left arm through the leather loop of a shoulder-holster hanging from a peg inside the door. The holster contained Khuv\u0027s KGB-issue automatic. Belting his dressing-gown savagely about his waist, he shoved Savinkov ahead of him down the exterior corridor.\\n\\n \u0027Where?\u0027 he shouted now. \u0027What, are you deaf as well as queer? Has Slepak also been struck dumb?\u0027\\n\\n \u0027We don\u0027t know where, Major,\u0027 the fat esper gasped. \u0027We\u0027ve got our locator on it, Leo Grenzel.\u0027 As he stuttered his apologies, so Slepak and Grenzel came hurrying round the bend of the corridor. They saw Khuv and Savinkov, hurried to meet them.\\n\\n \u0027Well?\u0027 said Khuv to Grenzel, a small, sharp-featured East German.\\n\\n \u0027Encounter Three,\u0027 Grenzel whispered. His eyes were an incredibly deep grey and very large in his small face. Never larger than right now.\\n\\n Khuv frowned at him. \u0027The thing in the glass tank? What about it?\u0027\\n\\n That\u0027s where he is,\u0027 Grenzel nodded. His face was pale, strangely serene, like the mask of a sleep-walker. His talent affected him that way.\\n\\n Khuv turned sharply to Savinkov. \u0027You - hurry, get Vasily Agursky.\u0027 Savinkov made off down the corridor. \u0027I said hurry.\u0027 Khuv called after him. \u0027Meet us in the room of the creature, and make sure you\u0027re both armed!\u0027\\n\\n Harry had listened to Kazimir\u0027s grim tale. He now knew about the fate of the old man\u0027s family, especially Tassi. He knew a little about Chingiz Khuv, too, about his espers and handful of KGB thugs; but he still didn\u0027t know the Projekt\u0027s secret, which lay in the heart of the place.\\n\\n Kazimir had not been privy to that, had no knowledge of it.\\n\\n \u0027This... thing,\u0027 said Harry. \u0027Do you know what it is?\u0027 No, only that it\u0027s horrible! Kazimir answered in Harry\u0027s mind. \u0027It\u0027s a vampire,\u0027 Harry told him. \u0027At least, I think it is.\\n\\n And you don\u0027t know how it got here? Was it perhaps made here?\u0027\\n\\n I know nothing about it.\\n\\n Harry nodded, chewed his lip. \u0027About your daughter: do you know where she is? Show me a plan of this place in your mind. Or as much as you know of it.\u0027\\n\\n Kazimir was glad to co-operate, said: She was in the cell next to mine.\\n\\n Again Harry\u0027s nod, and: \u0027Kazimir, you have my word that if I can find her, I\u0027ll take her out of this. More than that, if I can find her mother I\u0027ll reunite them in a safe place.\u0027\\n\\n The old man\u0027s mental sigh of relief was almost audible. If you can do that, then it\u0027s enough. Don\u0027t worry about me.\\n\\n \u0027But I do. Kazimir, this thing isn\u0027t you. You were dead when it ... when you... you were already dead.\u0027\\n\\n I feel part of it. I\u0027m being absorbed by it.\\n\\n Harry chewed harder on his lip. He\u0027d seen the room\u0027s equipment. He had a plan but wasn\u0027t sure if it would work. \u0027What if I could kill this thing? You can\u0027t die twice, Kazimir.\u0027\\n\\n Destroy it and I\u0027ll be free, I\u0027m sure! Renewed hope rang in the old man\u0027s mental voice. But... how can you destroy it?\\n\\n Harry knew how: the stake, the sword and the fire. If this creature had a vampire in it, then these things would kill it. So ... why not skip the first two steps and go straight to the third?\\n\\n Outside, ringing faintly, running footsteps sounded. And somewhere an alarm bell had started to gong its raucous warning through the bowels of the subterranean complex.\\n\\n They know I\u0027m here,\u0027 Harry said. \u0027This has to be quick.\u0027\\n\\n He wheeled Agursky\u0027s shock-box over to the tank. It was an electrical transformer on wheels, with a flexible heavy-duty cable to a wall socket. It had a pair of clamps on coiled extension leads, which Harry quickly made fast to terminals on the side of the tank. Watching him, the creature came to life, changing colour and shape as it began to work through several rapid metamorphoses. It knew what the shock-box was, knew what was coming. Or it thought it did.\\n\\n Harry didn\u0027t have time to watch its contortions, and in any case he didn\u0027t want to. Feeling slightly sick he turned on the current - and the thing at once went berserk!\\n\\n Harry wasted no time but turned the current up all the way. The clamps sputtered and issued blue sparks, smoke and a heavy ozone reek. The room\u0027s lights flickered momentarily, then steadied and brightened again. High-voltage current flowed through electrical cables in the glass walls of the tank, and the creature took the full charge. It became a writhing puppet of a man, small, with one tiny arm and hand and one huge one. It balled a massive fist, a fist almost as big as Harry\u0027s head, and slammed it again and again at the glass wall of its prison -the wall of its incinerator.\\n\\n The thing was melting, mewling and melting. Steam poured off it as its liquids boiled. Its corrugated skin blistered, cracked open, blackened. Gusts of vile vapour escaped in jets from its rupturing pores. It screamed and screamed with old Kazimir\u0027s face, through his mouth, but its voice wasn\u0027t human. Then the glass shattered and its great black steaming fist came through - at which the thing curled up on itself and gave up the ghost.\\n\\n It collapsed, half-in, half-out of the shattered tank, became still. Then -\\n\\n The blackened, smoking flesh of its head split open like an overripe pomegranate. A cobra\u0027s head writhed in the mush of boiling, steaming brains .\u0027The vampire! And it too died even as Harry watched.\\n\\n Free! said Kazimir. Free!!!\\n\\n Behind Harry the room\u0027s great door sighed open. He conjured a door of his own and stepped through it ... \\n\\n","sourceLink":"https://allnovel.net/necroscope-iii-the-source-necroscope-3/page-16.html","bookId":1518,"book":{"id":1518,"title":"Necroscope III: The Source (Necroscope #3)","description":"Storyline: The series starts to explore the origins of the Wamphyri manifestation on Earth. Years after Harry\u0027s son left, Harry has left E-Branch and has spent years searching the world for them. The new head of E-Branch, Darcy Clarke, recruits him in a case of a British spy (Micheal Jazz Simmons) who similarly disappeared, while investigating a Russian base.\\n","cover":"https://allnovel.net/images/necroscope-iii-the-source-necroscope-3.jpg","author":"Brian Lumley","type":"Adventure","source":"allnovel","link":"https://allnovel.net/necroscope-iii-the-source-necroscope-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:40:19 AM"}}
