{"id":62509,"no":19,"title":"Page 19","content":"The End of Zek\u0027s Story - Trouble at Sanctuary Rock - Events at Perchorsk By now the dome of the sanctuary rock had risen up to a towering two hundred feet or more. It was a light, patchy ochre - an enormous sandstone pebble lying on its side -protruding from a hillside that rose through pines, oaks, bramble and blackthorn. Above, the belt of trees was narrow, dark now, rising steeply to cliffs and mountainside; below, the forest spread downward into a thin rising mist, levelled out where the foothills met the plain, disappeared in milky distance. A faint light came from the south, like a false dawn. It wasn\u0027t dawn, however, but sundown. Looking up at the rock as they followed flowing contours to its flank, Jazz asked Zek: \u0027Have you been here before?\u0027 \u0027No, but I\u0027ve been told about it,\u0027 she answered. \u0027It\u0027s wormy as some vast blue cheese, left forgotten on a shelf. There are tunnels and caves right through it, enough room for Lardis\u0027s entire tribe and twice as many Travellers again. You could hide a small army in there!\u0027 They paused fifty yards from the boulder\u0027s base where the hillside fell away and a great cave opened, watched the stream of Travellers entering, taking travois, caravans, wolves and all with them. In a little while orange lights became flickeringly visible (and were quickly hooded) in \u0027window\u0027 holes higher up, where lamps or torches were lighted; and still Jazz and Zek stood there in the gathering gloom. Lardis came looking for them, said: \u0027Give them a little longer to settle in and choose their places, then I\u0027ll meet you in there - \u0027 he pointed, \u0027 - just inside the main entrance, which we call the hall. But if you like your air fresh, best get your share of it now. It gets smoky later. By the time you see sunup again, you\u0027ll be ready to barter your eyes for one good deep breath of clean mountain air!\u0027 He took up the handles of Jazz\u0027s travois. \u0027Here, I\u0027ll take this the rest of the way.\u0027 \u0027Wait!\u0027 said Jazz. He dipped into an easily accessible bundle, came out with two full magazines for his gun. \u0027Just in case,\u0027 he said. Lardis made no comment, went off toward the cavern entrance where now moving lights flickered here and there. \u0027Lardis is right,\u0027 Zek said. They\u0027ll take some time to get themselves settled in and the place fortified. Let\u0027s climb up, behind the rock. We might still be able to see the rim of the sun from up there. I don\u0027t like it when the sun goes down.\u0027 \u0027Are you sure you\u0027re not just putting something off?\u0027 Jazz answered. \u0027Zek, I\u0027ll not hold you to any promises. I mean, I know you\u0027re right: this isn\u0027t our world, and so we\u0027re drawn together.\u0027 She linked arms with him. \u0027Actually,\u0027 she tossed back her hair, \u0027I think I\u0027d be drawn to you in any world. No, it\u0027s just a feeling, that\u0027s all. Those caves look totally uninviting to me. See, even Wolf would prefer to stay out here with us.\u0027 The great wolf padded along behind them where they climbed through trees along the steeply sloping base of the rock. For fifteen minutes they climbed, until Jazz said: \u0027Far enough, I think. It\u0027ll take us just as long to get down again. This rock\u0027s bigger than it looks. Come sunup, then maybe we\u0027ll climb it to the top.\u0027 They found a ledge in the rock and sat there close together, Jazz with his arm around her. She leaned back against the coarse sandstone and toward him, sighed tiredly. \u0027Why do they call you Jazz?\u0027 \u0027Because my middle name is Jason,\u0027 he said. \u0027And I hate it! Don\u0027t make any cracks about the golden fleece, for God\u0027s sake!\u0027 \u0027Jason is a hero of my homeland,\u0027 she told him. \u0027I wouldn\u0027t joke about him.\u0027 Wolf whined a little where he sat at their feet looking up at them. Zek snuggled closer. Conscious of her warmth, and of her shape against him, Jazz said: \u0027Zek, finish your story.\u0027 It sounded abrupt, but he knew it wouldn\u0027t do to get caught up in something he couldn\u0027t control. Not now, up here with night settling fast. \u0027What?\u0027 she said, her tone surprised. Then... perhaps she sensed, or read, his thoughts. \u0027Oh, that! It was almost finished anyway. But... where was I?\u0027 A little angry with himself, angry with everything, Jazz reminded her... \u0027I\u0027ll make it short,\u0027 Zek said, her voice a little cooler now. \u0027Then we can get on back down. \u0027The Wamphyri Lords were there in Karen\u0027s aerie to talk about The Dweller. But Karen had been right: it wasn\u0027t only The Dweller that concerned them. They wanted Karen\u0027s stack. Shaithis wanted me, too, for my magic - God knows for what else! The rest of the bunch would dice for Karen; the winner would put her to whatever use; afterwards ... she would be burned. They feared that her vampire was a Mother. If it was and if she should vampirize her entire aerie - give all of her lieutenants eggs, and others to freshly selected, stolen Travellers - why then, with all of her \"children\" in thrall to her, there\u0027d be no stopping her! She had to go before things went that far. \u0027As for her aerie: Fess Ferenc, Volse Pinescu and one of the lesser Lords were of a mind to produce their own eggs. With Karen out of the way they would do so; their \"progeny\" would fight it out and the winner become Lord of Karen\u0027s aerie. The losers would remain in thrall to their masters until new opportunities presented themselves. Wamphyri \"children\" in thrall, by the way, don\u0027t have an easy time of it; there\u0027s nothing a Lord enjoys more than using his own child, male or female, for his own satisfaction. The blood of one\u0027s own kin, especially of the vampire in him, is the greatest delicacy of all! If Dramal Doombody hadn\u0027t been done for, Karen\u0027s life would have been an unending nightmare. The deed itself - the taking of Karen and her properties - that was to come before her vampire reached full maturity and took ascendancy. Patently it was a slow developer, but the Lords knew from their history and legends that Ladies were hard to get rid of once they achieved full flower. The \"female of the species\", so to speak. So ... she would be invited to join with the Wamphyri Lords in their attack upon The Dweller. Her forces would be used as cannon-fodder; when the battle was over, and without pause, her depleted units would be crushed in their turn, wiped out, and Karen herself taken. \u0027If she refused to join in the attack on The Dweller, that would be seen as a rebuke, an insult; it would warrant a full-scale, subsequent attack on her stack. But it was hoped she would join in, for if her aerie could be taken intact, undamaged - simply walked into - so much the better. \u0027All of this I got in bits and pieces from the minds of Shaithis, Volse, Menor Maimbite and one or two others. I dared not stay with any mind too long, in case they should become aware of me. But Karen had been quite right: in protecting themselves against her probing, they had left themselves wide open to me. I can tell you now, Jazz, that there are many hells. And if one of them is that place we were told about as children, where if we\u0027re not careful we go for our sins, then be sure that the others are the minds of Wamphyri Lords! There\u0027s little enough to distinguish between them... \u0027Anyway, finally the meeting was over and Shaithis stood and made a closing speech. As best I can remember it went like this: \u0027\"Lords, and Lady: \u0027\"With one exception - the exception of one vote, that of our... charming hostess, who will, she assures us, give the matter her most earnest consideration - we are all agreed on a punitive expedition against The Dweller. The hour of that effort against our great and mutual enemy is still to be set, but until it is decided, all are to stand forewarned and prepared. We all have valid reasons to wish to be rid of him. Apart from the fact that he has set up house in our territory - I take it we are agreed that the mountains are ours? - very well; apart from that fact, and that he gives succor to Travellers, who are our traditional prey, some of us have more personal grievances. \u0027\"Some hundred sundowns past, Lesk sent one of his men to parley with The Dweller. Only to parley, mind you, as we have heard from the lips of Lesk himself, most lucid of Lords. The man did not return. Angered (quite rightly), Lesk sent a warrior to test The Dweller\u0027s mettle. The Dweller contrived to trap rays of the recently sunken sun in mirrors, with which he burned Lesk\u0027s warrior to a crisp! Lesk, whose reasoning occasionally differs from that of, er, less sensitive minds, sent a second warrior -but not directly against The Dweller. For Lesk had determined that The Dweller was a hell-lander, sent here to spy on us and provoke us, perhaps preparing the way for large-scale invasion. The idea became obsessive - that is, he was convinced of its logic - especially so considering that immediately after Lesk\u0027s initial attacks upon The Dweller, the gate to the hell-lands was seen to rise up into the very mouth of its crater! Surely as preamble to the feared attack? And so he sent the second warrior directly into the hell-lands, through the gate, to let any would-be invaders see for themselves something of the might of the Wamphyri. Needless to say, the second warrior did not return. But then, no one ever has... \u0027\"Volse Pinescu, having heard of Lesk\u0027s losses, determined a more subtle approach: he activated and armed a hundred trogs to send against The Dweller\u0027s garden. They were to sack, burn, rape any women to the death and murder any men. They were raw, these trogs, with nothing of the Wamphyri in them; which is to say that while they did not much care for the sun, still its rays would not harm them. The Dweller\u0027s vile mirrors would not avail him here! But... they, too, failed to return. Apparently they were suborned: The Dweller found caves in which to house them, placed them under his protection! \u0027\"Grigis of Grigis, being the son of the much-fabled Grigis the Gouge, thought to enrich his struggling stack with The Dweller\u0027s wealth - perhaps even to steal his entire garden, which commands a lofty view, as we are all aware. Or maybe Grigis thought to do something more than this; for if he could gain some understanding of The Dweller\u0027s magic and his cursed machines, then his own currently - er, middling station? - his circumstances, let us say, would be that much more improved and enhanced. Indeed, with The Dweller\u0027s weapons at his command, the Lord Grigis might even lord it over all of us! But of course, we can be certain that this was not his intention. Alas, he lost three fine warriors, one hundred and fifty trogs and Travellers, two lieutenants. His stack is now inadequate to his needs. Let us be honest at least with ourselves: if not for the menace posed by The Dweller, one of us by now might well have found the resources to diminish Grigis\u0027s lot further yet... \u0027\"My own interest is easy to explain: it is interest pure and simple. Curiosity! I desire to know who this Dweller is. Wamphyri? - a new breed born of the swamps, perhaps? If so, how came he by his knowledge of weapons, machines, foul magic? What does he there, in his garden? And why are we scorned and so rudely ignored? \"This, then, is the plan: \u0027\"We watch The Dweller! Nothing more, simply that -for now. Covertly, in the darkness of sundown - however many sundowns are required - we watch him. How? Through the eyes of our familiar creatures. Through bats great and small. From below, in stealth, where trogs shall crouch in shadows and observe; from above, even so high as they may glide, where our flyers may relay his every move; in our very minds, with which unceasingly we will spy upon him! \"The extent of his garden, dwellers therein other than he himself, the locations of his mirrors, weapons, the numbers of his retainers - until we know as much of him as is required. And when we know all of these things and can concert our attack accordingly - \" \"Then you strike?\" This last from Karen. And all eyes turning her way where she sat at the head of the long table facing the bone-throne. \u0027Shaithis eyed her leeringly. \"Then we strike, Lady, surely? Unless you\u0027ve already made up your mind not to be with us?\" \u0027But she merely smiled at him, saying: \"Fear not, Lord Shaithis, for I shall be there.\" \u0027A sigh went up. All were in accord. And the Lady neatly netted. So it appeared. Then they took their leave; Shaithis and Lascula being first away, then Lesk, Volse, Belath, Fess, Menor and all the rest, and lastly Grigis. The reverse order in which they\u0027d arrived, leaving their least till last. And when Karen called me out of my hiding place, to attend her by a window, the sky was acrawl with them. They circled outwards, dark clouds of ill-omen in the lesser darkness, each swooping back to his own place, returning to his personal hell. \u0027I turned to her. \"Lady, you may not go with them against The Dweller!\" And I told her all I had read in their minds. \u0027She smiled a strange, sad, knowing smile. \"But did you not hear me? I said I shall be there.\" \u0027\"But-\" \u0027 \"Be still! Why, I could swear you actually care for me! Aye, and perhaps I care for you. So make ready what weapons you desire to take with you. If you need something, ask for it. Make provision of whatever I have to offer. Now I rest me. When I awake, before sunup, then I keep my promise.\" \u0027And she did. She went with me for my safe conduct; we had a flyer each; she flew us direct over the mountains and down onto Sunside. And with the new sun rising she bade me farewell and raced her beasts home again. That was the last time I saw her. Watching her flyer out of sight, I couldn\u0027t help but feel sorry for her. \u0027Some time later Lardis and his Travellers found me, and now I\u0027ve told you everything...\u0027 In a little while Jazz said, There are a couple of other things I\u0027d intended asking you. One of them was about that warrior creature which caused all the destruction at Perchorsk. Well, you\u0027ve answered that - it was Lesk\u0027s creature - but there are other things. The great bat, the wolf, the thing in the tank.\u0027 Zek shrugged. \u0027Maybe the bat and wolf got through accidentally. Blinded by the light, the bat flew into the sphere. Like us, it was guided one way through the gate. Similarly the wolf, which was old, nearly blind. As for the thing in the tank: it was a vampire. As coincidence would have it, it numbered among its ancestors both a wolf and a bat. In its metamorphic state, it was likely to take on characteristics of both. The slug characteristics are typical of its swamp origin. Maybe it entered the gate looking for prey. I don\u0027t know...\u0027 Jazz blinked tired eyes, said: Too deep for me. I begin to half-understand, but then I bog down. I suppose I\u0027m just weary. One last thing. What about the others from Perchorsk, the men who came through before you?\u0027 \u0027I wasn\u0027t told about them,\u0027 she grimaced. \u0027Khuv - the lying dog - didn\u0027t mention them! But I did learn about them from Karen. Belath took the first of them; mutated, he\u0027s now one of Belath\u0027s warriors. The other was a man called Kopeler. I used to know him.\u0027 \u0027Ernst Kopeler, yes,\u0027 Jazz said. \u0027An esper.\u0027 Zek nodded. \u0027He could read the future. When he came through the gate Shaithis\u0027s familiar bats saw him. Shaithis took him, but before he could make use of him Kopeler shot himself dead. If I\u0027d been able to read the future, maybe I\u0027d have done the same.\u0027 Jazz nodded his agreement, said, \u0027It\u0027s time we got on down. I\u0027ve still got a spot of weapon-training to do. And after that ... I want you very much. That\u0027s assuming I can still manage it, of course.\u0027 He grinned - but only for a moment. Wolf, who had been still and silent for some time, began to growl low and throatily. His ears twitched nervously, went flat to his head. \u0027What - ?\u0027 Zek stiffened, looked startled; and for the first time Jazz noticed how quiet it had gone, and the thickness of the mist where it rolled down from the mountains. Zek clutched at him, her eyes suddenly flown wide. \u0027What is it?\u0027 he husked. \u0027Jazz,\u0027 she whispered. \u0027Oh, Jazz!\u0027 She half-closed her eyes, put a slim hand to her forehead. Thoughts...\u0027 she said. \u0027Whose thoughts?\u0027 Gooseflesh rose on his spine, his forearms. \u0027 Theirs .r Panicked shouts came echoing up to them; shockingly, an explosion tore the night: one of Jazz\u0027s grenades, left with Lardis. A weird, bestial roaring commenced: a primal sound. \u0027What the hell - ?\u0027 Jazz lifted Zek down from their niche in the rock, turned from her to begin making the descent. \u0027No, Jazz!\u0027 she cried, then clapped a hand to her mouth. And: \u0027Oh, be quiet.,\u0027\u0027 she whispered. More explosions followed, hideous screaming, then shouting in blunt, commanding tones. Following which all was a tumult of sounds - battle sounds, and desperate! \u0027They were waiting for us!\u0027 Zek hissed. \u0027Shaithis, his lieutenants, a warrior, hidden away in the deepest recesses of the rock. And there are other warriors out here!\u0027 Something huge launched itself from a position higher than their own. It throbbed in the thin mist that curled over the treetops, a dark shape speeding down the sky, trailing appendages which tore through the higher branches of the trees almost directly overhead. It, too, began to roar. Jazz took his SMG from behind his back, automatically loaded up. \u0027We have to help,\u0027 he said. \u0027No, I have to help. You stay here.\u0027 \u0027Don\u0027t you understand?\u0027 she clutched at him, stopped him before he could get started. \u0027It\u0027s all over! You can\u0027t help. That was a warrior, one of several. If you had a tank and crew you still couldn\u0027t help!\u0027 As she spoke there came a last, booming explosion and dull orange fire blazed momentarily through the screen of trees and mist. There sounded a fresh bout of screaming: human screaming, nerve-shattering, from many terrified throats. Then through a barrage of lesser shouts and yelps, Shaithis\u0027s booming voice, reaching up through drifting cordite-stink and mist: \u0027Find them! Find Lardis and the hell-landers! As for the rest: destroy them all! But don\u0027t let the warriors glut themselves. I have been hurt, and now I take my vengeance. Now it is my turn to inflict pain! Now find the ones I want, and bring them to me!\u0027 \u0027So much for Lardis\u0027s defences,\u0027 Jazz groaned. \u0027He was ambushed,\u0027 Zek sobbed. \u0027His people didn\u0027t stand a chance. Come on, we have to get out of here.\u0027 Torn two ways, Jazz ground his teeth, turned his head this way and that. \u0027Please, Jazz!\u0027 Zek dragged at him. \u0027We have to save our own lives - if we can.\u0027 They couldn\u0027t go down, so they started up. But - Before they could take more than two paces there came a hoarse panting from below, a scrabbling amidst the shrubbery. White-faced, Jazz and Zek shrank back into the shadow of the rock, stared at each other. A figure came reeling up through the trees, clawing at the base of the rock, thrusting itself from bole to bole. In Zek\u0027s ear, Jazz whispered: \u0027A Traveller?\u0027 Her face strained in concentration. The panting was louder, frightened, almost a sobbing. Jazz thought: it has to be a Traveller. He let the stumbling figure come closer, reached out from cover and grabbed him. At the same time he heard Zek\u0027s hiss of warning: \u0027No, Jazz! It\u0027s - \u0027 Karl Vyotsky! Vyotsky, seizing his one chance to make a break for it - or perhaps simply fleeing from the horror of what was happening below. The two men recognized each other in the same moment. Their eyes bulged. Vyotsky\u0027s mouth flew open in a gasp of complete astonishment; he started to bring up his gun, drew breath for a mighty shout - which went unuttered. Jazz clubbed him in the throat with the butt of his SMG, tried to kick him and missed, slammed a blow to his face. Vyotsky\u0027s head rocked on his shoulders; he went crashing backwards, off-balance, probably unconscious, into brambles and mist-damp shrubbery. The ground mist rolled over him as he went sliding out of sight. Jazz and Zek listened with bated breath, their hearts pounding. They heard only the hoarse, unending screams from below, a gigantic snuffling and bellowing, loud crunching sounds. And in another moment they started in again to climb. They forced aching muscles to the limits of effort, drew level with the dome of the rock and climbed above it, ran waist-deep through clinging mist and tearing undergrowth where the ground levelled out a little. Then they were climbing again, still not daring to pant too loudly, hearts and lungs straining as they forced weary legs to pump and tired arms to drag them through the foliage. But the sounds from below were gradually fading, and trees and mist both were thinning out. \u0027A vampire mist,\u0027 Zek gasped. \u0027They cause it to happen. Don\u0027t ask me how. I should have known, should have heard them in my head. But they knew about me and were shielding themselves. Wolf knew, I think. Oh! -where is he?\u0027 She needn\u0027t have worried; the animal hounded her heels like a faithful dog. \u0027Save your breath,\u0027 Jazz growled. \u0027Climb!\u0027 \u0027But I might have heard them, might have given a warning if I wasn\u0027t so tired. And if- \u0027 \u0027If your mind hadn\u0027t been on other things? You\u0027re only human, Zek. Don\u0027t blame yourself. Or if you must blame someone, blame me.\u0027 Jazz dragged her up onto a shale-covered ledge in a slippery rock-face. They had come through the tree-line to the cliffs, the feet of the very mountains themselves. Clear of the mist, they could see a fading orange glow far to the south. It was the sun, and it was down. Sundown, and nowhere was safe now. But at least in the clean light of the stars they could see where they were going. The ledge was wide but sloped outwards a little; it ran crookedly, steeply upwards. Echoing cries still rang from far below where the mist boiled as before; fewer screams now, mainly the signal calls of monstrous searchers and the answers of their fellows. Then - Zek gave a massive start, drew air in a plainly audible gasp of terror. \u0027Vyotsky - he\u0027s coming!\u0027 she said. \u0027He\u0027s following us - and Shaithis himself is not far behind him!\u0027 \u0027Keep still!\u0027 Jazz grabbed her. \u0027Shhh!\u0027 They listened, watched. Down below at the edge of the tree-line, the mist parted and Vyotsky came into view. He looked left and right but not up, started toward the base of the cliffs. Perhaps he thought they\u0027d skirted the cliffs, and maybe they should have. But at least on the ledge no one was going to surprise them. Jazz aimed his SMG, scowled and lowered it. \u0027Can\u0027t be sure of hitting him!\u0027 he whispered. \u0027These things are for close-quarters fighting - street fighting. Also, the shot would be heard.\u0027 Again the mists parted and the awesome cloaked figure of Shaithis flowed out of them. He looked neither left nor right but inclined his head back to stare directly at the fugitives. His eyes glowed like small fires under the stars. \u0027There they are!\u0027 the vampire Lord shouted, pointed. \u0027On the ledge, under the cliff. Get after them, Karl. And if you\u0027d be my man, don\u0027t let me down...\u0027 As Shaithis glided forward, Vyotsky passed out of sight into the angles of the cliff face. Jazz and Zek heard shale sliding, Vyotsky\u0027s surprised yelp and his cursing. He was on the ledge and had discovered how slippery it was. \u0027Move!\u0027 said Jazz. \u0027Quick - climb! And pray this ledge goes somewhere. Anywhere!\u0027 But if Zek did pray, then her prayers weren\u0027t answered. Where the cliff was notched and bent back sharply on itself, the ledge narrowed to an uneven eighteen inches. In the \u0027V of the notch a chimney of rock had weathered free, leaning outward over dizzy heights. Behind the chimney scree had gathered, forming the floor of a cave. The stars gleamed down on the ledge, but in the deeps of the cave all was inky blackness. Shaithis, too, was on the ledge now; his commands came echoing: \u0027Karl, I want them alive. The woman for what she may be able to do for me, the man for what he has already done to me.\u0027 Edging along the ledge toward the chimney and the cave behind it, Jazz asked Zek: \u0027Why hasn\u0027t Shaithis called up more help?\u0027 \u0027Probably because he\u0027s sure he doesn\u0027t need it,\u0027 she groaned. Even as she spoke a knob of rock crumbled underfoot where she stepped, causing her feet to slip. Her legs and lower body shot sideways, out over empty space. Jazz let his weapon swing from its sling, grabbed Zek\u0027s flying hand. He dropped to one knee, raked the cliff with his free hand to find a hold. His fingers contacted, grasped a tough root in the instant before the girl\u0027s weight fell on him. Zek was dangling now, one elbow hooked over the rim of the ledge, the rest of her kicking and swinging. Only Jazz\u0027s grip on her offered any stability at all. \u0027Oh, God!\u0027 she sobbed. \u0027Oh, my God!\u0027 \u0027Drag yourself up,\u0027 Jazz groaned through gritted teeth. \u0027Try not to put too much leverage on me. Use your elbows. Squirm, for Christ\u0027s sake!\u0027 She did as he said, came slithering up onto the ledge in front of him. He grabbed her belt, hauled her unceremoniously against the face of the cliff. \u0027Now go on all fours,\u0027 he said. \u0027Don\u0027t try to stand up or you\u0027ll be over again. If we can just make that chimney...\u0027 Oh, and then what? But he refused to think about that. Finally Zek crawled onto the scree beneath the overhang, collapsed face-down there and spread-eagled herself, dug her fingers deep into loose rock fragments and hung on. Jazz stooped, caught her under the arm and drew her upright. \u0027We have to get under cover, he said, \u0027otherwise -\u0027 Ch-ching! came that unmistakable sound from behind them. Jazz half-turned. Vyotsky had appeared round the sharp corner. His cruel lips drew back from his teeth as he lined-up his SMG on the pair he pursued. But from behind him: \"Alive, Karl, do you hear?\u0027 Shaithis\u0027s voice warned, that much closer now. Vyotsky\u0027s eyes went wide with fear. He glanced back. Jazz took the opportunity to swing his own weapon in Vyotsky\u0027s direction, squeezed the trigger. To hell with keeping quiet! The gun chattered, and whining bullets chewed at the cliff like metal wasps, hurling chippings in Vyotsky\u0027s face. Instinctively he fired back, and a lucky round snatched Jazz\u0027s gun from his hands, sent it spinning out over the abyss. As the sling was yanked from his shoulder, only the chimney of rock stopped him from being drawn after it. Zek clutched at Jazz and they clung together. And - \u0027Step over here,\u0027 said a cool, low voice from the shadows. A figure was there, in the cave under the overhang, tall, slim, cloaked. Male, he wore an impassive golden mask over his face. Starlight gleamed on the gold. Jazz was struck with the thought that he looked like the Phantom of the Opera! \u0027Who - ?\u0027 he gasped. \u0027Quickly!\u0027 said the newcomer. \u0027If you want to live.\u0027 \u0027Stand still!\u0027 Vyotsky shouted, but Jazz and Zek were already moving to obey the stranger. As they stepped toward the cave, so he came out to meet them. Vyotsky saw him. Because of his cloak, at first the Russian mistook him for one of Shaithis\u0027s lieutenants. The stranger held out an urgent hand to the pair, held up his cloak almost as if to shield them. He drew them toward him... So much Vyotsky saw, but in the next moment... the big Russian blinked, used his free hand to rub furiously at his eyes. They\u0027d gone - all three, gone! But he hadn\u0027t seen them step back into the cave. A huge hand fell on Vyotsky\u0027s shoulder and he froze. Shaithis\u0027s monstrous voice hissed in his ear: \u0027Where are they? Did your weapon strike them? I hope for your sake it did not!\u0027 Vyotsky didn\u0027t look back, simply continued to gape at the empty ledge ahead. \u0027Well?\u0027 Shaithis\u0027s fingers dug into Vyotsky\u0027s shoulder. \u0027I didn\u0027t hit them, no,\u0027 the Russian gulped, shook his head. \u0027There was someone else. A man in a cloak, and a mask. He came... and he took them!\u0027 \u0027Took them? A man in a cloak and - ?\u0027 Shaithis\u0027s breath was hot on Vyotsky\u0027s neck. \u0027A mask of gold, perhaps?\u0027 Now Vyotsky looked at him - and at once shrank back, cringing from the horror of his face. \u0027Why... why, yes. He came - and he went! And they went with him...\u0027 \u0027Ahhh!\u0027 Shaithis hissed. \u0027The Dweller!\u0027 His fingers were like the jaws of a steel clamp, crushing Vyotsky\u0027s shoulder. For a moment the Russian thought he intended to hurl him down from the ledge. \u0027It ... it wasn\u0027t my fault!\u0027 he gibbered. \u0027I found them, followed them. Maybe they slipped into the cave there. Maybe all three of them are there!\u0027 Shaithis sniffed the air, his blunt snout quivering. \u0027No,\u0027 he finally said. \u0027Nothing. No one. You failed me.\u0027 \u0027But -\u0027 Shaithis released him. \u0027I won\u0027t kill you, Karl. Your spirit is puny but your flesh is strong. And there are uses to which good strong flesh can be put in the aerie of Shaithis of the Wamphyri.\u0027 He turned away. \u0027Now follow me down. And be warned: do not try to run away. For if you do that a second time it will make me very, very angry. I would give you to my favourite warrior. All except your quivering heart, which I would eat myself!\u0027 Vyotsky watched him commence the descent, gritted his teeth and slowly lifted the barrel of his gun. Without looking back, Shaithis said: \u0027Yes, by all means do, Karl - and we shall see which one of us is caused the most pain.\u0027 The Russian\u0027s tense expression slowly slackened, relaxed. How could you fight beings like these? What hope did any man have of ever defeating or even damaging something like Lord Shaithis? He let out his pent breath, gulped, put his weapon on safe and followed timidly on behind the other where he made his way down from the ledge. Below in the woods a great wolf howled piteously - Zek\u0027s Wolf, who knew that his mistress was now removed from him and gone far away. He lifted his head and howled again, the cry rippling from his taut throat. Then he sniffed the air and looked north and a little west, across the mountains. She was there, yes. That was the way he must go. Grey as the night, Wolf began to climb through the trees. Two figures passed him going down. He curled his upper lip back, writhing from his carnivore teeth. But he made no sound. They passed out of sight into the misty woods. Wolf let them go and continued on his way. The siren call of his mistress was strong in his mind... It was noon at Perchorsk, but in the metal and plastic bowels of that place it could be midnight and nothing would be changed. One change at least was occurring, however, and Direktor Luchov and Chingiz Khuv were watching as a team of workmen fitted pipes high in the wall of the perimeter corridor. The pipes were maybe seventy millimeters in diameter, made of black plastic, and might in other circumstances be conduits for heavy-duty electrical cable. But that was not their purpose. \u0027A failsafe?\u0027 Khuv said. He looked flustered. \u0027But I know nothing about this. Perhaps you\u0027d explain?\u0027 Luchov looked at him, tilted his head on one side a little. \u0027You work here,\u0027 he shrugged, \u0027and I have no reason to keep it from you. I proposed this mechanism some time ago. It is simplicity in itself, and quite foolproof. What\u0027s more, it\u0027s cheap and very quick and easy to install - as you can see. If you follow these pipes you\u0027ll see that they go straight back to the loading bays inside the main doors. There you\u0027ll find a fifteen-thousand-litre container on the back of a truck. The truck is locked in position with its brakes on, rotor arm removed. That, too, is a failsafe. The pipes connect directly to the truck and they\u0027re being laid throughout the Projekt.\u0027 Khuv\u0027s frown grew deeper. \u0027I\u0027ve seen the truck,\u0027 he said. \u0027It\u0027s a military supply vehicle, carrying chemical fuel for flame-throwers. Are you telling me that these pipes will carry that stuff? But it\u0027s highly corrosive! Man, it would eat through this plastic in a matter of minutes!\u0027 Luchov shrugged. \u0027By which time it wouldn\u0027t matter anyway,\u0027 he said. \u0027A failsafe only has to work once, Major, and that\u0027s the beauty of this one. Gravity fed, fifteen thousand litres of highly combustible fuel will rush downward through these pipes and circulate right through the Projekt in less than three minutes. As it courses along its way there are sprinklers. They will spray the fuel under pressure into every corner. Its fumes are heavy but they\u0027ll spread very rapidly. The Projekt has laboratories, boiler rooms, electrical fires, workshops, a thousand naked flames of one sort or another.\u0027 He shrugged again. \u0027But I\u0027m sure you can see what I\u0027m getting at. We can sum it up in one very descriptive word: inferno!\u0027 A short distance away, Vasily Agursky had paused to listen. Khuv had noticed him and now he deliberately stared at him. Still looking at Agursky, Khuv said: \u0027I take it this information is not sensitive? If it is, you should know we are being eavesdropped.\u0027 \u0027Sensitive?\u0027 Luchov glanced along the corridor, saw Agursky. \u0027Ah, but it is sensitive, yes! Everyone who works here in the Projekt will soon be aware exactly how sensitive it is. It would be criminally irresponsible for anyone to try to keep it a secret. There will be notices posted everywhere explaining the system in great detail. This is not a matter for the KGB, Major, but for humanity. It is not your sort of \"security\" but mine - and my superiors\u0027. And your superiors\u0027!\u0027 Agursky came closer, joined Khuv and Luchov. \u0027If this system is ever used,\u0027 he said, in a strange, emotionless voice, \u0027the Projekt would be destroyed utterly.\u0027 \u0027Correct, Vasily,\u0027 Luchov turned to him. That is its purpose. But it will only be used if another horror like Encounter One should ever escape from the Gate!\u0027 Agursky nodded. \u0027Of course, for fire destroys them. It\u0027s the only way we can be sure that nothing like that ever gets out into the world again.\u0027 \u0027More than that,\u0027 said Luchov. \u0027It\u0027s the only way we can be certain that this place never becomes the focal point of World War III!\u0027 \u0027What?\u0027 Khuv snapped. Luchov rounded on him. \u0027Oh? And do you think the Americans will sit still for a second of those nightmares launched from here into their airspace? Man, you know as well as I do that they think we\u0027re manufacturing them!\u0027 Khuv drew air in a gasp, became suspicious in a moment. \u0027Who have you been talking to, Viktor? That sounded very much like something the British spy Michael Simmons once said to me. I hope you haven\u0027t been interfering in things which don\u0027t concern you. I accept that this failsafe of yours is probably necessary, but I will not accept anyone meddling in my work!\u0027 \u0027Are you accusing me of something?\u0027 Luchov kept his anger under control. \u0027Maybe I am,\u0027 Khuv\u0027s tone was icy. \u0027We still don\u0027t know where you disappeared to for three hours when that damned esper ran amok in here. Is that it? Has Alec Kyle been talking to you?\u0027 Luchov scowled, the veins in his seared skull pulsing. \u0027I\u0027ve told you, I don\u0027t know what happened to me that night. I suppose I was unconscious. Maybe it was an attempt to kidnap me - bungled, as it turns out. As for this - Alec Kyle? - I\u0027ve not only never met him, I\u0027ve never even heard of him!\u0027 Which was true enough, for the man he\u0027d spoken to was called Harry Keogh. Agursky had turned away, leaving them to their argument. Khuv watched him go, staring hard after his departing, white-smocked figure. Was there something wrong with the peculiar little scientist? Or ... not wrong but different? Something... different about him? \u0027Aren\u0027t you interested how it\u0027s triggered?\u0027 Luchov asked, still glaring. \u0027Eh? Oh, yes, very interested. I\u0027d also like to know if there\u0027s a failsafe for your failsafe!\u0027 Khuv\u0027s attention was back on the Projekt Direktor. \u0027This place houses some hundred and eighty scientists, technicians, soldiers at any given time of the day and night, and it contains many millions of roubles\u0027 worth of equipment. If there was an accident -\u0027 \u0027Oh, there\u0027ll be no accident,\u0027 Luchov shook his head. \u0027If it\u0027s ever used it will be a very deliberate act, I assure you. Let me tell you how it works. \u0027There\u0027s empty accommodation close to mine. That becomes the failsafe control centre, with access only to the officer on duty and round the clock access to myself. Oh, and yourself, too, I suppose, since you\u0027ll probably insist upon it. However, I shall expect you to make your name available for the duty roster, as mine will be.\u0027 \u0027Control centre?\u0027 said Khuv. \u0027And what will this control centre contain?\u0027 \u0027A closed circuit TV monitor panel with three screens. One will watch the Gate and the others the stairwell through the shaft and the exit from it into the Projekt proper. There will be evacuation alert klaxons, too, though I admit a man will have to be pretty nimble to get out once they start sounding. As for the failsafe mechanism: two buttons and a heavy electrical switch. Button one will sound the evacuation alert in the upper levels the very moment that the Duty Officer sees anything come through the Gate. Button two will only be used if the creature is of that sort, and if the electrical fence, flamethrowers and Katushevs don\u0027t stop it. The button will control subordinate machinery: the alarms will sound more urgently, and steel doors will close in the ventilator shafts. If and when the creature passes from the core area, through the magmass levels and into the complex itself... then the switch is thrown. This cannot be done accidentally, or until the two buttons have been pressed. The switch, of course, opens the stopcocks on the tanker.\u0027 \u0027Huh.r Khuv grunted. \u0027I note that your quarters - and the control centre - are not far removed from the loading bays and the main entrance.\u0027 \u0027Your own quarters are similarly situated, albeit on a different bearing,\u0027 Luchov pointed out. \u0027We would have equal chances. So would anyone in that area, including your KGB men and parapsychologists.\u0027 Khuv grudgingly conceded that. \u0027And you think it\u0027s a wise move to tell everyone just exactly how this failsafe operates? You don\u0027t think it will scare them witless?\u0027 \u0027I think it probably will,\u0027 Luchov answered, \u0027but I see no alternative. In the event of ... a disaster, as many as possible should have the chance to live. And where the military is concerned: well, they are the only ones who can\u0027t run when the alarms start sounding. The Katushev crews and the flame-thrower squads. And here I\u0027m afraid I begin to sound too much like you for my own liking -but at least they now have the ultimate incentive to stop any emergence from the sphere!\u0027 Khuv pursed his lips, made no reply. \u0027And now that I have satisfied your curiosity,\u0027 Luchov continued, \u0027perhaps you\u0027d be so good as to tell me how your - experiments? - are proceeding? Have you had any message from those poor bastards you hurled through the Gate? Or have you simply written them off? And what about your investigations into this intruder affair? Do you know how he got in? What have you discovered about him?\u0027 Khuv scowled, turned on his heel and strode away. Over his shoulder he called back: \u0027At this moment in time I have no information for you, Direktor. But when I have all the answers, and when they make sense, then rest assured that you will be among the first to know of it.\u0027 He paused in his striding and looked back. \u0027But you are not the only one who has been busy, Comrade, and I have made certain recommendations of my own. So far you have only considered an invasion from the other side, but my imagination is more wide-ranging. In a few days you will more fully comprehend my meaning, with the arrival of a platoon of crack assault troops - under my command!\u0027 Before Luchov could enquire further, Khuv had passed through a bulkhead door and so out of sight... In his private quarters, Vasily Agursky stared at himself in a mirror on his toilet wall. He stared, and had difficulty believing what he saw. As yet no one else appeared to have noticed, but then no one took a great deal of interest in him. But Agursky knew himself very well indeed, and he also knew that what he saw in the mirror was more than the sum total of his parts. Of his parts. His first reaction, when he\u0027d noticed the early changes, had been to distrust the mirror, a distrust which had quickly turned to a strong dislike. Ridiculous for a man to dislike a mirror, but it was true, he did. He disliked all mirrors, probably because they reminded him of certain undeniable alterations, which he\u0027d be only too happy to forget about. The changes were... weird! He wouldn\u0027t have believed them possible. He had positioned this mirror on the wall himself, so that his face would be exactly centered in the glass. But now he had to bend his knees a little to get the same effect. He had gained two or more full inches in height. That fact should have delighted him, who had always considered himself as being little more than a dwarf, but instead it terrified him. For he could actually feel the ability of his body to be tall! And if the vampiric growth continued - then someone would notice. His hair, too, was undergoing something of a metamorphosis. Its dirty-grey down was darkening, showing signs of a long-delayed virility, and the halo was contracting toward the centre of his head\u0027s dome, filling itself in. No one had noticed that, either, but he supposed they must when finally the growth was complete. Why, already he looked - and felt - years younger. Felt ready now for ... almost anything. And yet for a little while longer he must continue to play the part of the old Vasily. The old, despised, neglected and contemptuously treated Vasily... Still gazing at himself, Agursky was surprised to feel a growl rising unbidden in his throat. It came up soft, purring from his chest, then thickened to a snarl. His lips curled back from his teeth - from his strong, white, animal teeth, whose canines had grown so as to interlock with each other more surely than they ever had in all his previous life - and he snarled like a beast! But he cut it off right there, took a grip on himself. For a moment there\u0027d been a power in him like none he\u0027d ever known before; and knowing where it came from, he knew too that he must control it. As long as he could. For at the Perchorsk Projekt, they had this habit of burning things like Vasily Agursky. Finally he took off his thick-lensed spectacles. The old curved lenses were gone now, removed from their frames and disposed of. In their place, flat discs of common glass which he\u0027d cut in the workshop: \u0027eyepieces for my instruments,\u0027 as he\u0027d explained it. No need now for aids to eyesight which had improved to an entirely incredible degree. Why, he could even see in the dark! But in connection with his eyes, there was something else which might soon begin to show, though what he could do about that was quite beyond him to imagine. Contact lenses? By the time he could order and receive them it might well be too late. In a way that frightened him, too, but in another way ... it was fascinating. Slowly he reached out a hand to the cord of the light-switch, gave it a single sharp tug. Click! - and the light went out. But in the mirror two lesser lights had taken its place. Agursky couldn\u0027t suppress the strange smile, the wolfish grin, which spread over his darkly-mirrored features then. A smile in which the pupils of his eyes burned like tiny censers, filled with hell\u0027s own sulphur...","sourceLink":"https://allnovel.net/necroscope-iii-the-source-necroscope-3/page-19.html","bookId":1518,"book":{"id":1518,"title":"Necroscope III: The Source (Necroscope #3)","description":"Storyline: The series starts to explore the origins of the Wamphyri manifestation on Earth. Years after Harry\u0027s son left, Harry has left E-Branch and has spent years searching the world for them. The new head of E-Branch, Darcy Clarke, recruits him in a case of a British spy (Micheal Jazz Simmons) who similarly disappeared, while investigating a Russian base.","cover":"https://allnovel.net/images/necroscope-iii-the-source-necroscope-3.jpg","author":"Brian Lumley","type":"Adventure","source":"allnovel","link":"https://allnovel.net/necroscope-iii-the-source-necroscope-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:40:19 AM"}}
