{"id":62496,"no":6,"title":"Page 6","content":"Harry Keogh: Necroscope Harry sat on the rim of the river and talked to his mother. He believed he was alone and unobserved, but it would make no difference anyway: no one would object to a crazy hermit sitting on a riverbank talking to himself. He suspected that a handful of locals thought of him that way, as an eccentric recluse: someone to be regarded warily, but mainly harmless. He suspected it and didn\u0027t much care one way or the other. In their position he\u0027d probably feel the same way about it. Indeed he sometimes wished he was in their position: normal, common-or-garden, everyday people. Homo sapiens, with normal lives to lead. But he wasn\u0027t in their position, he was in his, and it could hardly be described as normal. He was a Necroscope and as far as he knew he was the only Necroscope in the world. There should be at least one other like him, his son, but Harry Jnr was no longer in the world. Or if he was, Harry didn\u0027t know where. Harry looked down between his knees and dangling legs at his own face mirrored on the surface of the water. He watched its blank expression turn to a cynical scowl. \u0027His own face\u0027, indeed! For to complicate matters, it wasn\u0027t his face at all! Or it was - now. But it had been the face of Alec Kyle, one-time head of British E-Branch. And yet Harry also seemed to see himself - the Harry Keogh he\u0027d once been - superimposed over the stranger\u0027s face, making up a composite mask which wasn\u0027t really strange at all. Not any longer. But it had taken him eight long years to get used to it. Eight years of waking up in the mornings, of looking in the mirror and thinking: Jesus! Who\u0027s this? Until in the end the question had been merely academic. He\u0027d known who it was: himself, in mind if not in body. \u0027Harry?\u0027 his mother\u0027s suddenly anxious voice broke in on his mental paradox. \u0027You know you really shouldn\u0027t worry any more about things like that. That side of your life is over, done with. You were called to do a job and you did it. You did more than any other man could possibly have done. And for all that there have been... well, changes, you know that you\u0027re still you.\u0027 \u0027But in another man\u0027s body,\u0027 he answered, wryly. \u0027Alec was dead, Harry,\u0027 she made the point bluntly, for there was no other way to make it. \u0027He was worse than dead, for there was nothing left of his mind at all - not even of his soul. And anyway, you had no choice.\u0027 Harry\u0027s thoughts, spurred by his mother\u0027s words, carried him back, back to that time eight years ago: Alec Kyle had been on a mission to Romania - to destroy the remains of a human vampire in the ground there. Thibor Ferenczy had been dead, but he\u0027d left part of himself in the earth to pollute it, and to pollute anyone who went near it. Kyle had succeeded, burned the thing, and was on the point of returning to England when Soviet espers had picked him up. Flown in secrecy to Russia, to the Chateau Bronnitsy, the then HQ of Soviet E-Branch, he\u0027d been subjected to a particularly horrific method of brain-washing. His mind had been electronically drained, his brain literally emptied of knowledge. All knowledge. It wasn\u0027t merely a question of hot white lights, the rubber hose, truth-drugs and the like: the very contents of his mind had been forcibly, needlessly extracted, like a good tooth, and thrown away. And in the process Soviet telepaths had stolen the bits that were useful to them, all the secrets of their enemies, the British espers. When they\u0027d finished with Kyle he\u0027d been alive -been kept alive, for the time being - but his brain had been completely vacant, dead. Taken off life-support, his body too would die. And that had been the intention of his tormentors: to let him die and have his corpse dumped in West Berlin. There wouldn\u0027t be a pathologist in the whole wide world who could state with any certainty what had killed him. That was to have been the scenario. Except... while Alec Kyle had been a husk, an empty mind in a living body, the then Harry Keogh had been mind alone! Incorporeal, a bodiless inhabitant of the Mobius Continuum, Harry had searched for Kyle, found him, and the rest had been almost beyond his control. Nature abhors a vacuum, whether in the physical or metaphysical worlds. The normal universe had no use for an incorporeal being. And Kyle\u0027s brain had been an aching void. Thus Harry\u0027s mind had become one with Kyle\u0027s body. Since then ... a great deal had happened since then. Harry forced the scowl from his face, stared harder at his image in the calm river water. His hair (or Alec\u0027s?) was russet-brown, plentiful and naturally wavy; but in the last eight years a lot of the lustre had disappeared, and streaks of grey had become very noticeable. It would not be too long before the grey overtook and ruled the brown, and Harry not yet thirty. His eyes, too, were honey-brown; very wide, very intelligent, and (strange beyond words) very innocent! Even now, for all he\u0027d seen, experienced and learned, innocent. It could be argued that certain murderers have the same look, but in Harry the innocence was mainly genuine. He had not asked to be what he was, or to be called upon to do the things he\u0027d done. His teeth were strong, not quite white, a little uneven; they were set in a mouth which was unusually sensitive but could also be cruel, caustic. He had a high brow, which now and then he\u0027d search for freckles. The old Harry used to have freckles, but no longer. As for the rest of Harry\u0027s body: it had been well-fleshed, maybe even a little overweight, once. With its height, however, that hadn\u0027t mattered a great deal. Not to Alec Kyle, whose job with E-Branch had been in large part sedentary. But it had mattered to Harry. He\u0027d trained his new body down, got it to a peak of condition. It wasn\u0027t bad for a forty-year-old body. But better if it was only thirty, like Harry himself. \u0027You\u0027re at odds with yourself again, Harry,\u0027 said his mother. \u0027What\u0027s bothering you, son? Is it Brenda still, and little Harry?\u0027 \u0027No use denying it,\u0027 he gruffly answered, with something of an irritable shrug. \u0027You never met him, did you? He\u0027d have been able to talk to you too, you know. But ... I still can\u0027t get over the way he did it. It\u0027s one thing to lose somebody - or even two somebodies - but quite another to be left wondering why. He could have told me where he was taking her, could have explained his reasons. After all, it wasn\u0027t my fault she was like she was -was it? Maybe it was,\u0027 (again his shrug) \u0027I don\u0027t know any more...\u0027 His mother had heard all of this before; she knew what he meant, intimately understood his otherwise vague words and expressions, even his tone of voice. For while he didn\u0027t need to, he usually spoke out loud to her. He didn\u0027t need to because he was a Necroscope (no, the Necroscope, the man who communicated with the dead) and also because she was dead, and had been since Harry was an infant. She was down there, where she\u0027d been for more than twenty-seven years, in the mud and the weeds of the river, murdered all that time ago by Harry\u0027s stepfather. Yes, and now that same traitor was down there with her, put there by Harry, but he\u0027d stopped speaking to anybody long ago. \u0027Why not look at it from their point of view?\u0027 his mother said, reasonably. \u0027Brenda had been through an awful lot for a small village girl. Maybe she simply... well, wanted to get away from it all. For a while, anyway.\u0027 \u0027For eight years?\u0027 There was a brittle edge to Harry\u0027s voice. \u0027But having made the break,\u0027 his mother hurriedly went on, at her diplomatic best, \u0027she found she was happier. And he could see she was happier, and so they didn\u0027t come back. After all\u0027s said and done, your main concern was for their happiness, wasn\u0027t it, Harry? And you\u0027d be the first to admit that you weren\u0027t the man she\u0027d married. Well, not exactly. Oh.r And he could picture her hand flying to her mouth, even though he knew she no longer had either of those things. Alas, she\u0027d stumbled over her own argument, speaking not only her mind but Harry\u0027s, too. \u0027I mean - \u0027 \u0027It\u0027s all right,\u0027 he stifled her. \u0027I know what you mean. And you\u0027re right - as far as you go.\u0027 But because she had tried to be diplomatic, she hadn\u0027t gone far enough. And Harry knew that, too. What had happened back then, eight years ago, was this: In the Mobius Continuum, Harry had discovered by chance the elements of an insidious plot which was unfolding in the mundane world. The vampire Thibor Ferenczy had set in motion a gradual metamorphosis in a child as yet unborn. He had physically (and psychically, spiritually) defiled an innocent unsuspecting mother-to-be, causing something of himself to attach and cling to her foetal child. Now that child was grown to a youth, Yulian Bodescu, and as he had developed so his potential for evil had outstripped his human and humane side to achieve a monstrous vampire dominance. The task of the British E-Branch had been twofold: to seek out and destroy whatever remained of lingering vampire influences (especially what remained of Thibor) in the USSR and her satellites, and so ensure that the \u0027Bodescu situation\u0027 could never arise again; also to destroy Yulian Bodescu himself, through whom Thibor had determined to terrorize the world anew. But Bodescu had discovered the covert workings of E-Branch, specifically their plot and determination to put him down, and had turned his awesome emerging vampire powers and cold, cruel fury upon them. His principal adversary in the Branch had been the incorporeal Harry Keogh, who at that time was trapped in the psyche of his own infant son. Kill Harry Jnr and Bodescu would also rid himself of Harry. After that... the remaining members of E-Branch could be tracked down and picked off one by one, at the vampire\u0027s discretion. This was a scheme monstrous enough in itself, but the true horror of the situation would lie in the aftermath of such a bloodbath; for then there would be no stopping Bodescu, who could create almost at will an army of undead followers which would spread like a dark plague across the face of the entire earth! And this was a very real possibility, for while Bodescu had become one of the Wamphyri, he did not have their self-discipline. They were essentially territorial; they had their cold pride; they were solitary and cautious, and usually firmly in control of their own destinies. Most of all, they were jealous of their powers, deviously protective of their Wamphyri nature and history, aware and appreciative of human skills and ingenuity. Only let mankind become aware that they were real and not merely creatures of myth and legend, and men would strive to hunt them down and destroy them forever! But Yulian Bodescu was \u0027self-taught\u0027; he had had no Wamphyri instruction. He was none of the things which had made them what they were and possessed none of their dubious qualities. He was only a vampire, and he was insane! Brenda and her months-old infant son Harry Jnr were living in a garret flat in Hartlepool on the north-east coast of England when matters finally came to a head. Leaving a trail of bloodshed and destruction behind him, Bodescu evaded E-Branch\u0027s attempts at entrapment, fled his home in Devon and travelled north. Having inherited his mentor\u0027s expertise in hideous necromancy, he could \u0027examine\u0027 the desecrated corpses of his victims and read in their brains and blood and guts all of their innermost secrets. This was his intention in respect of the two Harrys, father and son: to murder them and steal the secrets of the Necroscope, and so discover the nature and properties of the metaphysical Mobius Continuum. E-Branch, closing on the Devon house to destroy it, missed their main quarry but discovered unthinkable horror there. Bodescu\u0027s aunt, uncle and cousin had been tortured and vampirized; his huge black dog was something more than a mere dog; a semi-plastic thing inhabited the earth under the extensive cellars, and Bodescu\u0027s mother was quite out of her mind from the unbearable knowledge of what Yulian had become. The house and all who dwelled in it were put to the torch. E-Branch had men in Hartlepool, psychically talented people who were keeping a low profile in and around the Edwardian building which housed Brenda\u0027s flat. The local police and Special Branch had also been informed (however guardedly, so as not to panic the populace) that the woman and child in the garret rooms were possible targets for an \u0027escaped lunatic\u0027. Their presence hardly deterred the vampire; he invaded the building, killed all who stood before him mercilessly and with dreadful efficiency, and finally reached his objective. But where the incorporeal Harry Keogh himself had been impotent, his infant son was anything but. His father\u0027s freakish powers had come down to him; he could talk to the dead, could even call them up from their graves in the cemetery across the road from the house. Harry Snr had considered himself \u0027trapped\u0027 in the baby\u0027s psyche, but this had not been the case. The infant had held him there for one reason only: to explore Harry\u0027s mind and learn from it. Physically he was a baby, apparently helpless, but mentally - Harry Jnr\u0027s talents were already vaster far than anything his father possessed or ever dreamed of achieving. And his potential was enormous. All the theory was there in the child\u0027s mind and only practical application, experience, was missing. But not for long. Brenda, attempting to protect her infant son from the incredible nightmare which was Yulian Bodescu, had been tossed aside by the vampire. Unconscious, she had not seen the final confrontation. Thinking back on that scene in the flat now, Harry remembered it as vividly as if it were yesterday: The two Harrys had looked out through the infant\u0027s eyes into the face of terror itself, the face of Yulian Bodescu. Crouched over the baby\u0027s cot, the leering malignancy of his eyes spoke all too clearly of his intentions. Finished! Harry had thought. All done, and it ends like this. No, another voice, not his own, had spoken in his mind. No, it doesn\u0027t. Through you I\u0027ve learned what I had to learn. I don\u0027t need you that way any more. But I do still need you as a father. So go, save yourself. It could only have been one person speaking to him, doing it now, for the first time, when there was no longer any time to question the hows and whys of it. Then... Harry had felt the child\u0027s restraints falling from him like broken chains, leaving him free again. Free to will his incorporeal mind into the safety of the Mobious Continuum. He could have gone, right there and then, leaving his son to face whatever was coming. He could have gone - but he couldn\u0027t! Bodescu\u0027s jaws had yawned open like a pit, revealing a snake\u0027s tongue flickering behind gleaming dagger teeth. Go! little Harry had said again, with more urgency. You\u0027re my son! Harry had cried. Damn you, I can\u0027t go! I can\u0027t leave you to this! Leave me to this? It had been as if the infant couldn\u0027t follow his reasoning. But then he had, and said: But did you think I was going to stay here? The beast\u0027s taloned hands were reaching for the child in his cot. Little Harry had seen the lust in the monster\u0027s eyes; he turned his small round head this way and that, seeking a Mobius door. A door had appeared, floating up out of his pillows. It was easy, instinct, in his genes. It had been there all along. His control over his mind was awesome; over his body, much less certain. But he\u0027d been able to manage this much. Bunching inexpert muscles, he\u0027d curled himself up, rolled into and through the Mobius door. The vampire\u0027s hands and jaws had closed on thin air! After that it had been all up for Yulian Bodescu. Harry had not called up the dead from the local graveyard, but his son had. For the dead had learned to love this child who talked to them, who had talked to them even from the womb! They loved him even as they loved and trusted his father; and if Harry Jnr was in trouble, that was all the incentive they needed to move limbs stiffened by death, to will back into pseudolife tissues and sinews long turned to leather and ravaged by the worm. They had pinned the vampire down, staked him out between their own yawning graves, lopped his harshly screaming head from his body and burned him to ashes. And Harry Snr, no longer imprisoned but once more master of the Mobius Continuum, had watched them do it and instructed them when they faltered. Later... Harry had discovered that his infant son had not only saved his own life but also removed his unconscious mother from danger. The child had used Mobius or Zollnerist metaphysics to move both himself and Brenda to a place of safety - indeed, to the safest possible place: E-Branch HQ in London! And Harry had been left to pursue his own destiny and inhabit the shell of the once-Alec Kyle. This he had done, and in the process destroyed the KGB\u0027s new toy, the Soviet ESPionage centre at the Chateau Bronnitsy. After that... it should have been a time for relaxation, a time to pause and take stock, make adjustments, realign lives. But the staff of E-Branch, jubilant over their triple success - the elimination of Yulian Bodescu, the termination of residual vampire sources abroad, and the destruction of Russia\u0027s KGB-corrupted esper corps -hadn\u0027t fully appreciated the stresses Harry and his family had suffered. Now that the job was done they wanted the entire thing pegged out, mapped, recorded, studied and more fully understood; and the only man who understood all of it was Harry. For a month he gave them what they wanted, even considered taking on the job of Director of E-Branch; but over that same period of time it had become increasingly apparent that all was not well with Brenda. As Harry\u0027s mother had so recently pointed out, there was hardly any mystery that anyone could attach to that; indeed Brenda\u0027s breakdown was only to have been expected, might even have been anticipated. After all, she\u0027d only recently become a mother and was still recovering from an uncomfortable confinement and difficult birth. Indeed, for a little while the doctors had thought they\u0027d lost her. Add to this the fact of her husband\u0027s talent (that he was a Necroscope) which she had known and which had preyed on her mind for months; the fact that her infant child seemed to possess similar and even more frightening powers, so that even in the midst of E-Branch men, who were themselves ESP-endowed, he was looked upon as something of a freak; the fact that Harry was now (literally) a different person, a person who was Harry, with all of his past, his memories and mannerisms, but living in a total stranger\u0027s body; the fact of the absolute terror she had endured through that night, face to face with the monster Yulian Bodescu, whose like she couldn\u0027t possibly have imagined even in her worst nightmares... Little wonder the poor girl\u0027s mind had started to give way under the strain! On top of all of which she hated London and couldn\u0027t return to Hartlepool; her old flat was poison to her now, where monstrous memories dwelled. And gradully, as her mental connections with the real world were eroded, so her visits to various specialists and psychiatric clinics increased - until one morning she and the baby... They\u0027d gone!\u0027 Harry said it out loud. \u0027They weren\u0027t there. They weren\u0027t anywhere that I\u0027ve been able to discover. And what gets to me most is that there was no warning, no hint. He simply up and took her... somewhere. And you know, he never spoke to me? After that first time in the flat, when Yulian Bodescu almost had us, he never once spoke to me! He could have; he\u0027d look at me in that way babies have, and I knew he could have spoken to me. But he never did.\u0027 Harry sighed, shrugged. \u0027So maybe he blamed me, too. Maybe they both did. And who can say they weren\u0027t right to blame me? If I hadn\u0027t been the way I was - \u0027 \u0027Oh?\u0027 his mother was angry now. She didn\u0027t like the tone of self-pity which had started to creep into Harry\u0027s voice. Where was all that quiet strength he\u0027d used to have? \u0027If you hadn\u0027t been what you were? And Boris Dragosani still alive in Russia? And Yulian Bodescu, spreading heaven-only-knows what evil through the world? And the myriad dead, cast off and forgotten, lost and lonely, thinking their dead thoughts forever in the cold earth and never knowing that they weren\u0027t really alone at all? But you\u0027ve changed all that, Harry. And there\u0027s no way back. Hah! If you weren\u0027t what you are, indeed!\u0027 He nodded to himself, thinking that of course she was right, then picked up a pebble and tossed it in the water so that its ripples shivered his image into ribbons. \u0027Still,\u0027 he said as his face slowly reformed. \u0027I\u0027d like to know where they went. I\u0027d like to be sure they\u0027re OK. Are you certain, Ma, that you haven\u0027t heard anything?\u0027 \u0027From the dead? Harry, there\u0027s not one of us who doesn\u0027t want to help. Believe me, if Brenda and little Harry were ... with us, you\u0027d be the first to know of it. Wherever they are, they\u0027re alive, son. You can rely on that.\u0027 He frowned and tiredly rubbed at his forehead. \u0027You know, Ma, I can\u0027t figure it out. If anyone could find them it has to be me. And I haven\u0027t even found a trace of them! When they disappeared, I got those people at E-Branch on it. They couldn\u0027t find them. A couple of them even approached me cautiously with the idea - and with a little sensitivity, you understand - that maybe Brenda and the baby were dead. By the time I handed the job over to Darcy Clarke six months later, everyone seemed sure they were dead. \u0027Now E-Branch has people who could find anybody anywhere - spotters who can pick up psychic emanations on the other side of the world - but they couldn\u0027t find my son. And little Harry\u0027s talent was far and away greater than mine. But your people,\u0027 (he was talking about the Great Majority, the countless dead) \u0027they say they\u0027re alive, that they have to be alive because they don\u0027t number amongst the dead. And I know that none of you would ever lie to me. So I think to myself: if they\u0027re not dead, and they\u0027re not here where I can find them - then where the hell are they? That\u0027s what\u0027s eating away at me.\u0027 He could sense her nod, feel how sad she was for him. \u0027I know, son, I know.\u0027 \u0027And as for physically searching for them - \u0027 he went on, as if he hadn\u0027t heard her, \u0027 - is there anywhere in this world where I didn\u0027t look? But if E-Branch couldn\u0027t find them, what chance did I stand?\u0027 Harry\u0027s mother had heard all of this before. It was his obsession now, his one passion in life. He was like a gambler hooked on roulette, whose one dream is to find \u0027the system\u0027 where none exists. He\u0027d spent almost five years searching, and nearly three more planning the various stages of the search. To no avail. She had tried to help him every step of the way, but so far it had been a long, bitterly disappointing road. Harry stood up, dusted a little soil from his trousers. \u0027I\u0027m going back to the house now, Ma. I\u0027m tired. I feel like I\u0027ve been tired for a long time. I think I could use a good long rest. Sometimes I think it would be good if I could just stop thinking... about them, anyway.\u0027 She knew what he meant: that he\u0027d reached the end of the road, that there was nowhere else he could look. That\u0027s right,\u0027 he said, turning away from the riverbank, \u0027nowhere else to look, and not much purpose to it anyway. Not much purpose to anything any more...\u0027 Head down, he bumped into someone who at once took his arm to steady him. At first Harry didn\u0027t recognize the man, but recognition quickly followed. \u0027Darcy? Darcy Clarke?\u0027 Harry began to smile, only to feel the smile turning sour on his face. \u0027Oh, yes - Darcy Clarke,\u0027 he said, more slowly this time. \u0027And you wouldn\u0027t be here if you didn\u0027t want something. I thought I\u0027d already made it clear to you people, I\u0027m through with all of that.\u0027 Clarke studied his face, a face he\u0027d known well from the old days, when it had belonged to someone else. There were more lines than there used to be, and there was also something more of character. Not that Alec Kyle had been without character, but Harry\u0027s had gradually imprinted itself on the flesh. Also, there was weariness in that face, and signs that there\u0027d been a lot of pain, too. \u0027Harry,\u0027 Clarke said, \u0027did I hear you telling yourself just now that there\u0027s no purpose to anything? Is that how you\u0027re feeling?\u0027 Harry glanced at him sharply. \u0027How long were you spying on me?\u0027 Clarke was taken aback. \u0027I was standing there by the wall,\u0027 he said. \u0027I wasn\u0027t spying, Harry. But ... I didn\u0027t want to disturb you, that\u0027s all. I mean,\u0027 he nodded toward the river, \u0027this is where your mother is, isn\u0027t it?\u0027 Harry suddenly felt defensive. He looked away, then looked back and nodded. He had nothing to fear from this man. \u0027Yes,\u0027 he said, \u0027she\u0027s here. It was my mother I was talking to.\u0027 Without thinking, Clarke glanced quickly all about. \u0027You were talking to - ?\u0027 Then he looked once more at the quiet flowing river and his expression changed. In a lowered voice, he said: \u0027Of course, I\u0027d almost forgotten.\u0027 \u0027Had you?\u0027 Harry was quick off the mark. \u0027You mean that isn\u0027t what you came to see me about?\u0027 Then he relented a little. \u0027OK, come on back to the house. We can talk as we go.\u0027 As they made their way through brittle gorse and wild bramble, Clarke unobtrusively studied the Necroscope. Not only did Harry seem a little vacant, abstracted, but his style in general seemed to have suffered. He wore an open-necked shirt under a baggy grey pullover, thin grey trousers, scuffed shoes on his feet. It was the attire of someone who didn\u0027t much care. \u0027You\u0027ll catch your death of cold,\u0027 Clarke told him, with genuine concern. The E-Branch head forced a smile. \u0027Didn\u0027t anyone tell you? We\u0027ll soon be into November...\u0027 They walked along the riverbank toward the large Victorian house brooding there behind its high stone garden wall. The house had once belonged to Harry\u0027s mother, then to his stepfather, and now it had come down naturally to Harry. \u0027Time\u0027s not something I worry about a lot,\u0027 Harry eventually answered. \u0027When I feel it\u0027s getting colder I\u0027ll put more clothes on.\u0027 \u0027But it doesn\u0027t matter much, right?\u0027 said Clarke. \u0027There doesn\u0027t seem to be much purpose to it. Or to anything. Which means you haven\u0027t found them yet. I\u0027m sorry, Harry.\u0027 Now it was Harry\u0027s turn to study Clarke. The head of E-Branch had been chosen for that job because after Harry he was the obvious candidate. Clarke\u0027s talent guaranteed continuity. He was what they called a \u0027deflector\u0027, the opposite of accident-prone. He could walk through a minefield and come out of it unscathed. And if he did step on one it would turn out to be a dud. His talent protected him, and that was all it did. But it would ensure that he\u0027d always be there, that nothing and no one would ever take him out, as two heads before him had been taken out. Darcy Clarke would die one day for sure - all men do - but it would be old age that got him. But to look at Clarke without knowing this ... no one would ever have guessed he was in charge of anything, and certainly not the most secret branch of the Secret Service. Harry thought: he\u0027s probably the most perfectly nondescript man! Middle-height (about five-eight or -nine), mousey-haired, with something of a slight stoop and a tiny paunch, but not overweight either: he was just about middle-range in every way. And in another five or six years he\u0027d be just about middle-aged, too! Pale hazel eyes stared back at Harry from a face much given to laughter, which Harry suspected hadn\u0027t laughed for quite some little time. Despite the fact that Clarke was well wrapped-up in duffle-coat and scarf, still he looked cold. But not so much physically as spiritually. \u0027That\u0027s right,\u0027 the Necroscope finally answered. \u0027I haven\u0027t found them, and that\u0027s sort of killed off my drive. Is that why you\u0027re here, Darcy? To supply me with a new purpose, a new direction?\u0027 \u0027Something like that,\u0027 Clarke nodded. \u0027I certainly hope so, anyway.\u0027 They passed through a door in the wall into Harry\u0027s unkempt back garden, which lay gloomy in the shade of gables and dormers, where the paint was flaking and high windows looked down like frowning eyes in a haughty face. Everything had been running wild in that garden for years; brambles and nettles grew dense, crowding the path, so that the two men took care where they stepped along the crazy-paving to a cobbled patio area, beyond which sliding glass doors stood open on Harry\u0027s study. The room looked dim, dusty, foreboding: Clarke found himself hesitating on the threshold. \u0027Enter of your own free will, Darcy,\u0027 said Harry - and Clarke cast him a sharp glance. Clarke\u0027s talent, however, told him that all was well: there was nothing to drive him away from the place, no sudden urgency to depart. The Necroscope smiled, if wanly. \u0027A joke,\u0027 he said. Tastes are like attitudes, given a different perspective they change.\u0027 Clarke stepped inside. \u0027Home,\u0027 said Harry, following him and sliding the doors shut in their frames. \u0027Don\u0027t you think it suits me?\u0027 Clarke didn\u0027t answer, but he thought: well, your taste was never what I would have called flamboyant. Certainly the place suits your talent! Harry waved Clarke into a cane chair, seated himself behind a blocky oak desk dark with age. Clarke looked all about and tried to draw the room into focus. Its gloom was unnatural; the room was meant to be airy, but Harry had put up curtains, shutting out most of the light except through the glass doors. Finally Clarke could keep it back no longer. \u0027A bit funereal, isn\u0027t it?\u0027 he said. Harry nodded his agreement. \u0027It was my stepfather\u0027s room,\u0027 he said. \u0027Shukshin - the murdering bastard! He tried to kill me, you know? He was a spotter, but different to the others. He didn\u0027t just smell espers out, he hated them! Indeed, he wished he couldn\u0027t smell them out! The very feel of them made his skin crawl, drove him to rage. Drove him in the end to kill my mother, too, and to have a go at me.\u0027 Clarke nodded. \u0027I know as much about you as any man, Harry. He\u0027s in the river, isn\u0027t he? Shukshin? So if it bothers you, why the hell do you go on living here?\u0027 Harry looked away for a moment. \u0027Yes, he\u0027s in the river,\u0027 he said, \u0027where he tried to put me. An eye for an eye. And the fact that he lived here doesn\u0027t bother me. My mother\u0027s here, too, remember? I\u0027ve only a handful of enemies among the dead; the rest of them are my friends, and they\u0027re good friends. They don\u0027t make any demands, the dead...\u0027 He fell silent for a moment, then continued: \u0027Anyway, Shukshin served his purpose: if it hadn\u0027t been for him I might never have gone to E-Branch - and I mightn\u0027t be here now, talking to you. I might be out there somewhere, writing the stories of dead men.\u0027 Clarke, like Harry\u0027s mother, felt and was disturbed by his gloomy introspection. \u0027You don\u0027t write any more?\u0027 \u0027They weren\u0027t my stories anyway. Like everything else, they were a means to an end. No, I don\u0027t write any more. I don\u0027t do much of anything.\u0027 Abruptly, he changed the subject: \u0027I don\u0027t love her, you know.\u0027 \u0027Eh?\u0027 \u0027Brenda,\u0027 Harry shrugged. \u0027Maybe I love the little fellow, but not his mother. See, I remember what it was like when I did love her - of course I do, because I haven\u0027t changed - but the physical me is different. I\u0027ve a new chemistry entirely. It would never have worked, Brenda and me. No, that\u0027s not what\u0027s wrong with me, that isn\u0027t what gets to me. It\u0027s not knowing where they are. Knowing that they\u0027re there but not knowing where. That\u0027s what does it. There were enough changes in my life at that time without them going off, too. Especially him. And you know, for a while I was part of him, that little chap? However unwillingly - unwittingly? - I taught him much of what he knows. He got it from my mind, and I\u0027m interested to know what use he\u0027s made of it. But at the same time I realize that if they hadn\u0027t gone, she and I would have been finished long ago anyway. Even if she\u0027d recovered fully. And sometimes I think maybe it\u0027s best they did go away, and not only for her sake but his, too.\u0027 All of this had flooded out of Harry, poured out of him without pause. Clarke was pleased; he believed he glimpsed a crack in the wall; maybe Harry was discovering that sometimes it was good to talk to the living, too. \u0027Without knowing where he\u0027d gone, you thought maybe it was the best thing for him? Why\u0027s that?\u0027 he said. Harry sat up straighter, and when he spoke his voice was cold again. \u0027What would his life have been like with E-Branch?\u0027 he said. \u0027What would he be doing now, aged nine years old, eh? Little Harry Keogh Jnr: Necroscope and explorer of the Mobius Continuum?\u0027 \u0027Is that what you think?\u0027 Clarke kept his voice even. \u0027What you think of us?\u0027 It could be that Harry was right, but Clarke liked to see it differently. \u0027He\u0027d have led whatever life he wanted to lead,\u0027 he said. This isn\u0027t the USSR, Harry. He wouldn\u0027t have been forced to do anything. Have we tried to tie you down? Have you been coerced, threatened, made to work for us? There\u0027s no doubt about it but that you\u0027d be our most valuable asset, but eight years ago when you said enough is enough... did we try to stop you from walking? We asked you to stay, that\u0027s all. No one applied any pressure.\u0027 \u0027But he would have grown up with you,\u0027 Harry had thought it all out many, many times before. \u0027He\u0027d have been imprinted. Maybe he could see it coming and just wanted his freedom, eh?\u0027 Clarke shook himself, physically shrugged off the mood the other had begun to impose upon him. He\u0027d done part of what he came to do: he\u0027d got Harry Keogh talking about his problems. Now he must get him talking, and thinking, about far greater problems - and one in particular. \u0027Harry,\u0027 he said, very deliberately, \u0027we stopped looking for Brenda and the child six years ago. We\u0027d have stopped even sooner, except we believed we had a duty to you - even though you\u0027d made it plain you no longer had one to us. The fact is that we really believed they were dead, otherwise we\u0027d have been able to find them. But that was then, and this is now, and things have changed...\u0027 Things had changed? Slowly Clarke\u0027s words sank in. Harry felt the blood drain from his face. His scalp tingled. They had believed they were dead, but things had changed. Harry leaned forward across the desk, almost straining toward Clarke, staring at him from eyes which had opened very wide. \u0027You\u0027ve found... some sort of clue?\u0027 Clarke held up placating hands, imploring restraint. He gave a half-shrug. \u0027We may have stumbled across a parallel case - \u0027 he said, \u0027 - or it may be something else entirely. You see, we don\u0027t have the means to check it out. Only you can do that, Harry.\u0027 Harry\u0027s eyes narrowed. He felt he was being led on, that he was a donkey who\u0027d been shown a carrot, but he didn\u0027t let it anger him. If E-Branch did have something... even a carrot would be better than the weeds he\u0027d been chewing on. He stood up, came round the desk, began pacing the floor. At last he stood still, faced Clarke where he sat. Then you\u0027d better tell me all about it,\u0027 he said. \u0027Not that I\u0027m promising anything.\u0027 Clarke nodded. \u0027Neither am I,\u0027 he said. He glanced with disapproval all about the room. \u0027Can we have some light in here, and some air? It\u0027s like being in the middle of a bloody fog!\u0027 Again Harry frowned. Had Clarke got the upper hand as quickly and as easily as that? But he opened the glass doors and threw back the curtains anyway. Then: Talk,\u0027 he said, sitting down carefully again behind his desk. The room was brighter now and Clarke felt he could breathe. He filled his lungs, leaned back and put his hands on his knees. There\u0027s a place in the Ural Mountains called Perchorsk,\u0027 he said. That\u0027s where it all started...\u0027","sourceLink":"https://allnovel.net/necroscope-iii-the-source-necroscope-3/page-6.html","bookId":1518,"book":{"id":1518,"title":"Necroscope III: The Source (Necroscope #3)","description":"Storyline: The series starts to explore the origins of the Wamphyri manifestation on Earth. Years after Harry\u0027s son left, Harry has left E-Branch and has spent years searching the world for them. The new head of E-Branch, Darcy Clarke, recruits him in a case of a British spy (Micheal Jazz Simmons) who similarly disappeared, while investigating a Russian base.","cover":"https://allnovel.net/images/necroscope-iii-the-source-necroscope-3.jpg","author":"Brian Lumley","type":"Adventure","source":"allnovel","link":"https://allnovel.net/necroscope-iii-the-source-necroscope-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:40:19 AM"}}
