{"id":82089,"no":8,"title":"Page 8","content":"I can\u0027t lose this fight. Suddenly that was the only thought in Jez\u0027s mind. She couldn\u0027t afford to be hurt or scared-or stupid. There was too much riding on it. And since Morgead had the advantages of telepathy and strength on her at the moment, she was going to have to come up with some clever way to beat him. It only took a moment to come up with a plan. And then Jez was carrying it out, every ounce of her concentration focused on tricking him. She stopped backing up and took a step sideways, deliberately putting herself in a position where she could make only a clumsy block. Then she gave him an opening, holding her stick awkwardly, its tip toward him but drooping too far down. You see-it\u0027s my elbow, she thought to him, knowing he couldn\u0027t hear her, but willing him to take the bait. My elbow hurts too much; I\u0027m distracted; the stick is no longer an extension of me. My right side is unprotected. She was as good at it as any mother bird who pretends to have a broken wing to lure a predator away from her nest. And she could see the flash of triumph in Morgead\u0027s eyes. That\u0027s it; don\u0027t waste time injuring me anymore ... come in for the kill. He was doing it. He\u0027d stopped trying to get her into a corner. With his handsome face intent, his eyes narrowed in concentration, he was maneuvering for a single decisive strike; a takedown to end the combat. But as he raised his fighting stick to make it, Jez pulled her own stick back as if she were afraid to block, afraid of the jarring contact. This was the moment. If he caught on now, if he realized why she was positioning her stick this way, he\u0027d never make the move she wanted him to. He\u0027d go back to disarming her. I\u0027m too hurt to block properly; my arm\u0027s too weak to raise, she thought, letting her shoulders droop and her body sway tiredly. It wasn\u0027t hard to pretend. The pain in various parts of her body was real enough, and if she let herself feel it, it was very nearly disabling. Morgead fell for it. He made the strike she wanted; straight down. At that instant Jez slid her leading foot back, shifting just out of range. His stick whistled by her nose-missing. And then, before he could raise it again, while he was unguarded, Jez lunged. She put all the power of her body behind it, all her strength, slipping in between Morgead\u0027s arms and driving the stick to his midsection. The air in his lungs exploded out in a harsh gasp and he doubled over. Jez didn\u0027t hesitate. She had to finish him instantly, because in a second he would be fully recovered. By the time he was completely bent over she was already whipping her stick out and around to strike him behind the knee. Again, she put her whole weight behind the blow, following through to scoop him onto his back. Morgead landed with a thud. Before he could move, Jez snap-kicked hard, catching his wrist and knocking his stick away. It clattered across the floor, oak on oak. Then she held the pointed end of her own stick to his throat \"Yield or die,\" she said breathlessly, and smiled. Morgead glared up at her. He was even more breathless than she was, but there was nothing like surrender in those green eyes. He was mad. \"You tricked me!\" \"All\u0027s fair.\" He just looked at her balefully from under the disordered hair that fell across his forehead. He was sprawled flat, long legs stretched out, arms flung to either side, with the tip of the snakewood fighting stick resting snugly in the pale hollow of his throat. He was completely at her mercy-or at least that was how it seemed. Jez knew him better. She knew that he never gave up, and that when he wasn\u0027t too mad to think, he was as smart as she was. And as sneaky. Right now the helpless act was about as sincere as her wounded bird routine. So she was ready when he threw another blast of Power at her. She saw his pupils dilate like a cat\u0027s about to pounce, and she braced herself, shifting the stick minutely to push into his collarbone as she leaned forward. The energy smashed into her. She could almost see it now, with the sixth sense that was part of her vampire heritage. It was like the downrush of a nuclear cloud, the part that went flowing along the ground, destroying everything in its path, spreading in a circle from the point of impact. It seemed to be faintly green, the color of Morgead\u0027s eyes. And it packed quite a punch. Jez gritted her teeth and hung on to the fighting stick, keeping it in place, letting the Power wash through her. It blew her hair back to stream in a hot wind and it seemed to last forever. But finally it was over, and she was tingling with pain, with a metallic feeling in her teeth. And Morgead was still trapped. He hissed at her, an amazingly reptilian sound. \"Got anything else?\" Jez said, grinning down at him with narrowed eyes. Every bruise on her body hurt afresh in the aftermath of the blast-but she wasn\u0027t going to let him see that. \"No? I didn\u0027t think so.\" Morgead\u0027s upper lip lifted. \"Drop dead, Jezebel.\" Nobody was allowed to use her full name. \"You first, Morgy,\" she suggested, and leaned harder on the stick. The green eyes were beautifully luminous now, with sheer anger and hatred. \"So kill me,\" he said nastily. \"Morgead-\" \"It\u0027s the only way you\u0027re going to win. Otherwise I\u0027m just going to lie here and wait to recharge. And when I\u0027ve got enough Power I\u0027ll hit you again.\" \"You never know when it\u0027s over, do you?\" \u0027It\u0027s never over.\" Jez bit down on a rush of fury and exasperation. \u0027I didn\u0027t want to have to do this,\" she snarled, \"but I will.\" She didn\u0027t kill him. Instead, she hurt him. She grabbed his wrist and locked it, with her hand holding his and her stick on top of his wrist. She could use leverage here to cause severe pain- or to break the bone. \"Give up, Morgead.\" \"Bite me.\" \"I\u0027m going to break your wrist.\" \u0027Tine. I hope you enjoy it.\" He kept glaring. Like a little kid threatening to play on the freeway, Jez thought, and suddenly, inexplicably she was almost overcome by laughter. She choked it back. She didn\u0027t want to break his wrist. But she knew she had to. And she had to do it soon, before he regenerated enough Power to hit her again. She couldn\u0027t take another of those blasts. \"Morgead, give!\" She put enough pressure on his wrist that it really hurt. He gave her the evil eye through dark lashes. \"You\u0027re so stubborn!\" Jez put on more pressure. She could tell it was hurting him. It was hurting her to keep the steady pressure up. Shooting stars of pain were zinging in her elbow. Jez\u0027s heart was beating hard and her muscles were beginning to tremble with fatigue. This was much more difficult for both of them than a clean break would have been. And he was a vampire- his wrist would heal in a few days. She wouldn\u0027t be injuring him permanently. I have to do it, she told herself. She tensed her muscles- And Morgead took a little quick breath, an indrawn hiss of pain. For just an instant his green eyes lost their gemlike clarity, unfocusing a bit as he winced. Jez let go of his wrist and collapsed to sit beside him, breathing hard. You are so stupid, her mind told her. She shook her hair out and shut her eyes, trying to deal with the fury. Beside her, Morgead sat up. \"What are you doing?\" \"I don\u0027t know!\" Jez snarled without opening her eyes. Being weak and idiotic, she answered herself. She didn\u0027t even know why she couldn\u0027t go through with it. She killed vampires-and less obnoxious ones than Morgead-all the time. \"I didn\u0027t yield,\" Morgead said. His voice was flat and dangerous. \"So it\u0027s not over.\" \u0027Tine, blast me.\" Tm going to.\" \"So do it.\" \"What, you like it so much?\" Jez snapped. She grabbed her stick off the ground and turned to look at him for the first time since she\u0027d sat down. \"Yeah, I love it, Morgead! I\u0027m crazy about pain! So do it, and then I\u0027m going to hit you over your thick head so hard you won\u0027t wake up until next week!\" She might have said more, but the look in his eyes stopped her. He was staring at her intently, not simply belligerently as she\u0027d imagined. His green eyes were narrow and searching. \"You\u0027re just crazy period,\" he said, sitting back, his gaze still probing. In a different tone he said softly, \"So why didn\u0027t you do it?\" Jez lifted her shoulders and dropped them. There was a pit of anger and misery in her stomach. \u0027I suppose because then I\u0027d have to break every bone in your body, you jerk. You\u0027d never give up, not with that new power you\u0027ve got.\" \"I could teach it to you. The others aren\u0027t strong enough to learn it, but you are.\" That forced a short laugh out of Jez. \"Yeah, right.\" She shut her eyes briefly, wondering what Morgead would say if she were to tell him why she could never learn it. He\u0027d squash me like a bug, she thought, and laughed again. \"You laugh weird, Jez.\" \"I have a twisted sense of humor.\" She looked at him, blinking wetness out of her lashes. Where had that come from? There must be something in her eye. \"So. Want to start this fight again?\" He was staring at her hand gripping the snakewood stick. Jez tried to keep that hand steady, but she could feel the fine tremors in the muscles. She took a deep breath and clenched her teeth, making her gaze challenging. I can fight again. I can do it because I have to, and this time I won\u0027t let any stupid sympathy get in the way of beating him. I have to win. Everything depends on it. Morgead looked back at her face. \"No,\" he said abruptly. \"We don\u0027t have to do it again. I yield.\" Jez bunked in shock. It was the last thing she\u0027d expected. Morgead\u0027s expression was cold and unreadable. Jez got mad. \"Why?\" she blazed at him. \"Because I\u0027m tired? Because you don\u0027t think I can take you?\" She whipped the stick up, ready to split his stupid skull. \"Because you\u0027re crazy!\" Morgead yelled. \"And because-\" He stopped dead, looked furious. Then he said curtly, \"Because you won fair the first time.\" Jez stared at him. Slowly she lowered the stick. Morgead\u0027s expression was still distinctly unfriendly. But he\u0027d just made an almost unbelievable admission. \"You just don\u0027t want me to whop you anymore,\" she said. He gave her a sideways look that would kill pigeons in midair. Jez let out her breath. Her heart was just beginning to settle down and relief was spreading through her. I did it I really did it. I\u0027m not going to die today. \"So it\u0027s over,\" she said. \"I\u0027m back in.\" \"You\u0027re leader,\" Morgead said sourly. \"Enjoy it, because I\u0027m going to be right behind you every step, just waiting for my chance.\" \"I wouldn\u0027t expect anything else,\" Jez said. Then she blinked. \"What are you doing?\" \"What do you think?\" His face set, his eyes on the far wall, Morgead was tugging his shirt away from his neck, and leaning his head back. \"I have no idea-\" Then Jez realized. She went cold to the tips of her fingers. I didn\u0027t think. I should have remembered, but I didn\u0027t, and I didn\u0027t plan for this.... \"Blood in, blood out,\" Morgead said shortly. Why didn\u0027t I remember? Panic was stirring inside Jez. She couldn\u0027t see any way to get out of it. For human gangs \"blood in, blood out\" meant you got beat up when you were jumped in, and you didn\u0027t leave until you were dead. But for vampire gangs... I can\u0027t bite him. The most frightening thing was that something inside her wanted to do it. Her entire skin was tingling, and it suddenly seemed as if it was only yesterday that she\u0027d had her last blood meal. She could remember exactly how it felt, sinking her teeth into smooth skin, piercing it easily, feeling the warm flow start. And Morgead\u0027s blood would be dark and sweet and powerful. Vampire blood wasn\u0027t life-sustaining like human blood, but it was rich with the hidden promise of the Night World. And Morgead was one of the strongest vampires she\u0027d ever met. His blood would be full of the mastery of that new attack, full of raw, vital young energy. But I don\u0027t drink blood. I\u0027m not a vampire! Not anymore. Jez was trembling in shock. In the entire year since she\u0027d stopped drinking blood, she\u0027d never been so tempted. She had no idea why it had come on like this now, but it was almost out of her control. She pressed her tongue against one sharpening canine, trying to restrain it, trying to get some relief from the stress. Her upper and lower jaws were aching fiercely. I can\u0027t. It\u0027s unthinkable. If I do it once, I\u0027ll never be able to stop. I\u0027ll become-what I was back then. I\u0027ll be lost I can\u0027t-but I have to. I need to get back in the gang. Morgead was staring at her. \"Now what\u0027s wrong with you?\" \"I. . .\" Jez was dizzy with fear and longing and the sense of danger. She couldn\u0027t see any way out.... And then she saw it. \"Here,\" she said, unbuttoning the collar of her shirt. \"You bite me.\" \"What?\" \u0027It satisfies the requirement. Blood has to be spilled. And it\u0027s the leader who does it\" \u0027You\u0027re the leader, idiot.\" \"Not until I\u0027m back in the gang. And I\u0027m not back in the gang until blood is spilled.\" He was staring at her, his eyes hard and demanding and not amused at all. \"Jez... that\u0027s ridiculous. Why?\" He was too smart. She didn\u0027t dare let him keep thinking about it. \"Because I think it\u0027s the proper procedure. And because-I overfed last night. I don\u0027t want anymore.\" She stared straight into his eyes, not allowing a muscle to quiver. Trying to force her version of the truth into his brain. Morgead blinked and looked away. Jez allowed herself to relax minutely. She had one advantage over Morgead; there was no way he could even imagine her real motives. She just hoped he wouldn\u0027t discern the human flavor to her blood. \u0027If you won\u0027t tell me, I give up.\" He shrugged. \"So, fine. If that\u0027s the way you want it...\" \"It is.\" \"Whatever.\" He turned back to her and reached for her shoulders. A new shock rocked Jez. Morgead never hesitated once he made up his mind, but this was a little unnerving. His grip was a bit too firm and authoritative; Jez felt out of control. And how am I going to shield myself? she thought wildly, clamping down on a new wave of fear. He\u0027s already a powerful telepath and sharing blood increases rapport How am I supposed to block that-? Everything was happening too fast; she didn\u0027t have time to plan or think. All she could do was try not to panic as Morgead drew her close. Jerk... he\u0027s had too much experience at this, part of her thought furiously. At subduing any kind of prey. At gentling scared girls-human girls. He was holding her lightly and precisely; he was tilting her chin back. Jez shut her eyes and tried to blank her mind. And now she could feel the warmth of his face near her skin; she could feel his breath on her throat. She knew his canine teeth were extending, lengthening, thinning to needle points. She tried to control her breathing. She felt a swathe of warmth as he licked her throat once, and then a pain that made her own teeth ache. His teeth had pierced her skin, sharp as obsidian. Then the release of blood flowing. Her life, spilling out The instinctive twinge of fear Jez felt had nothing to do with him invading her mind. No vampire liked to make this kind of submission. Letting someone drink your blood meant you were weaker, it meant you were willingly making yourself prey. Everything inside Jez protested at just relaxing and letting Morgead do this. And maybe that was the answer, she thought suddenly. A wall of turmoil to cover her thoughts. Pretend to be too agitated to let him make contact. ... But his lips were surprisingly soft on her throat, and the pain was gone, and he was holding her more like a lover than like a predator. She could feel his mind all around her, strong, demanding. He wasn\u0027t trying to hurt her. He was trying to make it not-terrible for her. But I want it to be terrible. I don\u0027t want to feel like this.... It didn\u0027t matter. She felt as if she were being pulled by a swift current, dragged and tumbled into some place she had never been before. Sparkling lights danced behind her closed eyelids. Electricity crackled through her body. And then she felt his mouth moving gently on her throat, and the world fell away....","sourceLink":"https://allnovel.net/night-world-huntress-night-world-7/page-8.html","bookId":1863,"book":{"id":1863,"title":"Night World : Huntress (Night World #7)","description":"Storyline: Huntress (Night World Book 7) Jez Redfern is unique. She\u0027s a vampire hunter...who\u0027s half vampire. Raised in the Redfern family, the girl with fiery hair and silvery-blue eyes was the undisputed leader of a gang of vampire raiders. Then came the discovery that shattered her life - her mother was a human. Now, Jez hunts her former friends, protecting humans from the Night World. But when Circle Daybreak sends her on a search for one of the legendary Wild Powers, Jez has to rejoin her old gang. They want her back -- especially Morgead, the gorgeous green-eyed vampire who used to be her second-in-command. Jez wants to stay faithful to Hugh Davis, the human she loves. But Morgead swears he\u0027s her soulmate and he\u0027ll do anything to lure her back to the old ways. With danger and temptation around, Jez finds herself irresistibly drawn to him. And she\u0027s afraid that if she tastes blood again, she\u0027ll become the evil huntress she once was...","cover":"https://allnovel.net/images/night-world-huntress-night-world-7.jpg","author":"L.J. Smith","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/night-world-huntress-night-world-7.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:39:55 PM"}}
