{"id":40206,"no":41,"title":"CHAPTER XLI — DUTY","content":"It was not now a very cold night. There were fleecy clouds thrown like puffs of smoke against the western sky. The moon, on the wane,—a small crescent lying on its back,—was lowering toward the horizon. The thermometer had risen since sunset, as it often does in March. There was a suggestion of spring in the air. It seemed that at last the long winter was drawing to a close; that the iron grip of frost was relaxing. Paul went out and inspected the harness by the light of a stable lantern held in the mittened hand of a yemschick. He had reasons of his own for absenting himself while Catrina bade her mother farewell. He was rather afraid of these women. The harness inspected, he began reckoning how many hours of moonlight might still be vouchsafed to him. The stableman, seeing the direction of his gaze, began to talk of the weather and the possibilities of snow in the near future. They conversed in low voices together. Presently the door opened and Catrina came quickly out, followed by a servant carrying a small hand-bag. Paul could not see Catrina’s face. She was veiled and furred to the eyelids. Without a word the girl took her seat in the sleigh, and the servant prepared the bear-skin rugs. Paul gathered up the reins and took his place beside her. A few moments were required to draw up the rugs and fasten them with straps; then Paul gave the word and the horses leaped forward. As they sped down the avenue Catrina turned and looked her last on Thors. Before long Paul wheeled into the trackless forest. He had come very carefully, steering chiefly by the moon and stars, with occasional assistance from a bend of the winding river. At times he had taken to the ice, following the course of the stream for a few miles. No snow had fallen; it would be easy to return on his own track. Through this part of the forest no road was cut. For nearly half an hour they drove in silence. Only the whistle of the iron-bound runners on the powdery snow, the creak of the warming leather on the horses, the regular breathing of the team, broke the stillness of the forest. Paul hoped against hope that Catrina was asleep. She sat by his side, her arm touching his sleeve, her weight thrown against him at such times as the sleigh bumped over a fallen tree or some inequality of the ground. He could not help wondering what thoughts there were behind her silence. Steinmetz’s good-natured banter had come back to his memory, during the last few days, in a new light. “Paul,” said the woman at his side quite suddenly, breaking the silence of the great forest where they had grown to life and sorrow almost side by side. “Yes.” “I want to know how this all came about. It is not my father’s doing. There is something quick, and practical, and wise which suggests you and Herr Steinmetz. I suspect that you have done this—you and he—for our happiness.” “No,” answered Paul; “it was mere accident. Your father heard of our trouble in Kiew. You know him—always impulsive and reckless. He never thinks of the danger. He came to help us.” Catrina smiled wanly. “But it is for our happiness, is it not, Paul? You know that it is—that is why you have done it. I have not had time yet to realize what I am doing, all that is going to happen. But if it is your doing, I think I shall be content to abide by the result.” “It is not my doing,” replied Paul, who did not like her wistful tone. “It is the outcome of circumstances. Circumstances have been ruling us all lately. We seem to have no time to consider, but only to do that which seems best for the moment.” “And it is best that I should go to America with my father?” Her voice was composed and quiet. In the dim light he could not see her white lips; indeed, he never looked. “It seems so to me, undoubtedly,” he said. “In doing this, so far as we can see at present, it seems certain that you are saving your father from Siberia. You know what he is; he never thinks of his own safety. He ought never to have come here to-night. If he remains in Russia, it is an absolute certainty that he will sooner or later be rearrested. He is one of those good people who require saving from themselves.” Catrina nodded. At times duty is the kedge-anchor of happiness. The girl was dimly aware that she was holding to this. She was simple and unsophisticated enough to consider Paul’s opinion infallible. At the great cross-roads of life we are apt to ask the way of any body who happens to be near. Catrina might perhaps have made a worse choice of counsel, for Paul was honest. “As you put it,” she said, “it is clearly my duty. There is a sort of consolation in that, however painful it may be at the time. I suppose it is consolatory to look back and think that at all events one did one’s duty.” “I don’t know,” answered Paul simply; “I suppose so.” Looking back was not included in his method of life, which was rather characterized by a large faith and a forward pressure. Whenever there was question of considering life as an abstract, he drew within his shell with a manlike shyness. He had no generalities ready for each emergency. “Would father have gone alone?” she asked, with a very human thrill of hope in her voice. “No,” answered Paul steadily, “I think not. But you can ask him.” They had never been so distant as they were at this moment—so cold, such mere acquaintances. And they had played together in one nursery. “Of course, if that is the case,” said the girl, “my duty is quite clear.” “It required some persuasion to make him consent to go, even with you,” said Paul. A rough piece of going—for there was no road—debarred further conversation at this time. The sleigh rolled and bumped over one fallen tree after another. Paul, with his feet stretched out, wedged firmly into the sleigh, encouraged the tired horses with rein and voice. Catrina was compelled to steady herself with both hands on the bar of the apron; for the apron of a Russian sleigh is a heavy piece of leather stretched on a wooden bar. “Then you think my duty is quite clear?” repeated the girl at length. Paul did not answer at once. “I am sure of it,” he said. And there the question ended. Catrina Lanovitch, who had never been ruled by those about her, shaped her whole life unquestioningly upon an opinion. They did not speak for some time, and then it was the girl who broke the silence. “I have a confession to make and a favor to ask,” she said bluntly. Paul’s attitude denoted attention, but he said nothing. “It is about the Baron de Chauxville,” she said. “Ah!” “I am a coward,” she went on. “I did not know it before. It is rather humiliating. I have been trying for some weeks to tell you something, but I am horribly afraid of it. I am afraid you will despise me. I have been a fool—worse, perhaps. I never knew that Claude de Chauxville was the sort of person he is. I allowed him to find out things about me which he never should have known—my own private affairs, I mean. Then I became frightened, and he tried to make use of me. I think he makes use of every-body. You know what he is.” “Yes,” answered Paul, “I know.” “He hates you,” she went on. “I do not want to make mischief, but I suppose he wanted to marry the princess. His vanity was wounded because she preferred you, and he wanted to be avenged upon you. Wounds to the vanity never heal. I do not know how he did it, Paul, but he made me help him in his schemes. I could have prevented you from going to the bear hunt, for I suspected him then. I could have prevented my mother from inviting him to Thors. I could have put a thousand difficulties in his way, but I did not. I helped him. I told him about the people and who were the worst—who had been influenced by the Nihilists and who would not work. I allowed him to stay on here and carry out his plan. All this trouble among the peasants is his handiwork. He has organized a regular rising against you. He is horribly clever. He left us yesterday, but I am convinced that he is in the neighborhood still.” She stopped and reflected. There was something wanting in the story, which she could not supply. It was a motive. A half-confession is almost an impossibility. When we speak of ourselves it must be all or nothing—preferably, nothing. “I do not know why I did it,” she said. “It was a sort of period I went through. I cannot explain.” He did not ask her to do so. They were singularly like brother and sister in their mental attitude. They had driven through twenty miles of forest which belonged to one or other of them. Each was touched by the intangible, inexplicable dignity that belongs to the possession of great lands—to the inheritance of a great name. “That is the confession,” she said. He gave a little laugh. “If none of us had worse than that upon our consciences,” he answered, “there would be little harm in the world, De Chauxville’s schemes have only hurried on a crisis which was foreordained. The progress of humanity cannot be stayed. They have tried to stay it in this country. They will go on trying until the crash comes. What is the favor you have to ask?” “You must leave Osterno,” she urged earnestly; “it is unsafe to delay even a few hours. M. de Chauxville said there would be no danger. I believed him then, but I do not now. Besides, I know the peasants. They are hard to rouse, but once excited they are uncontrollable. They are afraid of nothing. You must get away to-night.” Paul made no answer. She turned slowly in her seat and looked into his face by the light of the waning moon. “Do you mean that you will not go?” He met her glance with his grave, slow smile. “There is no question of going,” he answered. “You must know that.” She did not attempt to persuade. Perhaps there was something in his voice which she as a Russian understood—a ring of that which we call pig-headedness in others. “It must be splendid to be a man,” she said suddenly, in a ringing voice. “One feeling in me made me ask you the favor, while another was a sense of gladness at your certain refusal. I wish I was a man. I envy you. You do not know how I envy you, Paul.” Paul gave a quiet laugh—such a laugh as one hears in the trenches after the low hum of a passing ball. “If it is danger you want, you will have more than I in the next week,” he answered. “Steinmetz and I knew that you were the only woman in Russia who could get your father safely out of the country. That is why I came for you.” The girl did not answer at once. They were driving on the road again now, and the sleigh was running smoothly. “I suppose,” she said reflectively at length, “that the secret of the enormous influence you exercise over all who come in contact with you is that you drag the best out of every one—the best that is in them.” Paul did not answer. “What is that light?” she asked suddenly, laying her hand on the thick fur of his sleeve. She was not nervous, but very watchful. “There—straight in front.” “It is the sleigh,” replied Paul, “with your father and Steinmetz. I arranged that they should meet us at the cross-roads. You must be at the Volga before daylight. Send the horses on to Tver. I have given you Minna and The Warrior; they can do the journey with one hour’s rest, but you must drive them.” Catrina had swayed forward against the bar of the apron in a strange way, for the road was quite smooth. She placed her gloved hands on the bar and held herself upright with a peculiar effort. “What?” said Paul. For she had made an inarticulate sound. “Nothing,” she answered. Then, after a pause, “I did not know that we were to go so soon. That was all.”","sourceLink":"http://novel.tingroom.com/duanpian/2779/76957.html","bookId":1313,"book":{"id":1313,"title":"The Sowers","description":"简介： The speaker finished his remark with a short laugh. He was a big, stout man; his name was Karl Steinmetz, and it is a name well known in the Government of Tver to this day. He spoke jerkily, as stout men do when they ride, and when he had laughed his...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2779","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
