{"id":80368,"no":18,"title":"Page 18","content":"PART FOUR: WAMPHYRI: ANCIENT AND MODERN I MORE OF RADU\u0027S STORY. BONNIE JEAN: SHE VISITS HER MASTER In those days if you would live, the high mountains were most probably the safest place to do it. And for the time being the werewolf Radu Lykan had had his fil of war. In the last quarter of the year 467 AD, he and his small pack wintered down in what was to be their lair for the next sixty years. The place was a great cavern in the mountains of western Moldavia, not far from a scrabbled-together \u0027town\u0027 or village, more properly a makeshift encampment of refugees, caled Krawlau by its one hundred and fifteen polyglot inhabitants. As to why he chose this place: Radu\u0027s reasons were several. For one, the heights were inhospitable and almost inaccessible. To gradually establish oneself there would be one thing, but for any would-be invader to launch an attack, or even want to? ... That seemed unlikely. Two: being simply a holow crag, the redoubt would not invite attack in the manner of an \u0027aerie\u0027 or castle; and at its rear, its lowest crevice exits opened on the shore of a broad, bitterly cold lake. In the event that he was attacked, Radu could easily slip away by boat to the far shore. For while it was a time of relative quiet, there would continue to be sporadic invasions from the east (Radu\u0027s dreams were full of them) ... Three: while a true aerie would be his first choice for a permanent dweling place, its construction would prove prohibitively expensive. The cavern on the other hand required no actual or external building as such but only some interior works, and what monies Radu had amassed were better put aside against the vagaries of an uncertain future - his precognition was by no means infallible. Four: an entire work-force, with which to make the crag habitable, was immediately to hand in the shape of the folk of Krawlau. These former farmers -driven into the mountains by war and the collapse of the Eastern Empire\u0027s borders in the face of invading Asiatics - had no work. Like Radu, they were simply wintering out the bad times. In order to survive they\u0027d become scavengers, hunting the land and fishing the lake for food. Which was why, when first Radu found them, they saw him as a godsend. \u0026#8226; At first, aye ... And when he was established ... then they saw him almost as a god! Oh, it was in his bearing when he walked among them: his penetrating gaze and lordly mode of speech, his attire and generosity. Obviously, with his dark, wolfish good looks - standing tall and lean as a tree, and equally strong - this was no ignorant, guttural farmer born in the fields but a gentleman landowner, a boyar removed from his own place by those same savage forces that had removed them. And he had gold, and the wit to fashion himself a fortress from a raw crag! His money was of little value now - not in these naked mountains where there was nothing to buy - but it would be when the land was quiet again. As for Radu\u0027s cavern: when all of the work was finished and if the winters were hard, then it would provide refuge for all of them. This was his promise. Oh, Radu knew he shouldn\u0027t bring himself into prominence, but up here in the heights that was in any case a near-impossibility. Who was there to see him or his, or know what they were about? No one but these low persons in their sod-roofed, timber huts. Radu hired them by the dozen, and chose men to watch over them while they turned the great cavern into a lair. When a man joined him, Radu would state his wages and promise him a bonus if he should later decide to go his own way, perhaps back down to his ruined fields to start again. In that first winter, when the snow lay deep, a good many of them did just that: approached Radu and told him they\u0027d left families in Moldavia, and would now return to see if they survived ... and if so provide for them out of the monies Radu had paid them, and the bonus he stil owed them. For his part, he would always require one last day\u0027s work of them before paying them their due, wishing them wel and seeing them on their way in the dusk of evening. But in the dark of night he would send members of his pack loping after them, to make certain no word of him and his works - and none of his money - found its way down out of the mountains. And because new refugees were arriving day after day, and others trying to leave, there was a steady turnover of workers and no lack of... provisions. (Likewise, there was no gradual trickling away of Radu\u0027s funds). The keep took shape. He would go among the workers directing them, so that every stone was laid in accordance with his design (even as it had been in Wolfsden in Starside in another world). Massive timber lintels for the several \u0027doors\u0027 that he left open, and piled boulders in other holes that Radu desired closed; archways with keystones to bolster the dripstone ceilings where they were eaten with rot, and stone staircases leading to ledges, lesser caves or high \u0027window\u0027 observation ports in the rough outer walls; the levelling of various floors, and laying of an uneven but serviceable paving of slate slabs. And so to the fireplaces and ovens, and the flues to channel smoke to the rear of the crag, there to drift with the mists rising off the lake. And while all such works were in progress to make the cavern liveable if not \u0027comfortable,\u0027 Lord Radu was not remiss in seeing to its defences: Outside, between the natural spurs of the crag, he built awesome death-trap gantlets for would-be invaders; on high, he piled rocks behind logs stopped with chocks that were easily knocked away in the event of an invasion. And at last Radu saw that his lair was safe. But in any case these were no puny castle\u0027s wals to fal to the first assault of an enemy\u0027s battering rams - they were the wals of the mountain itself! And as each external work was completed, so Radu would disguise it as living rock, in imitation of its surrounding formations. But inside: In strategic places Radu buttressed certain works of stone with good timber; which would seem odd to some, for obviously the wood could not outlast the stone. But Radu reasoned that when the time came for him to leave his mountain fastness, then by lighting a handful of fires behind him he could easily topple it, or at least reduce it to the original shell. Wamphyri and savagely territorial, he could not bear the thought of another dweling in a place that his hands had wrought! But by the same token he also knew that if ever he desired to return, then that he had the knowledge and skill to put the place back to rights. Radu\u0027s \u0027pups\u0027 worked side by side with the men of Krawlau, showing never a sign of their lupine natures except perhaps in their silence and the feral intelligence of their eyes. The ex-farmers saw nothing peculiar in it; they\u0027d seen wave after wave of slant-eyes (and of yellow-eyes, and -skins, too) long before Radu came on the scene. He and his retainers were from foreign parts, that was al. Plainly this rangy boyar in his fur boots and jacket, with his long, grey-to-white hair faling on his colar, and golden crescent moons in his fleshy ears, was some rich expatriate. Certainly he was \u0027Lord\u0027 Radu to his men! And he was fair to a fault. When his hunters went out and kiled a pig in the night (though where they were able to find such game up here in the mountains was a mystery) then there\u0027d be meat off the bone for the common workers too, be sure! And Lord Radu laughing and joking with them as they sucked at the sweet, smoking flesh. Radu \u0027recruited\u0027 the strongest of them - but by the light of a full moon, and not as workers! For while earlier he\u0027d determined to \u0027make no more werewolves,\u0027 still he was on the lookout for men of quality. The ones he chose from these ex-farmers were hard as men come; they\u0027d make superb lieutenants when next he went out into the world ... So the dog-Lord proceeded. A long, hard winter came and went, and several more like it, before finally \u0027Wolfscrag\u0027 was finished to Radu\u0027s satisfaction. But only Radu himself, and those who were his, knew what he\u0027d named it. By then the men of Krawlau were much reduced in numbers; they worried about the fact that of all their fellows who had left Radu\u0027s employ, not a one had been known to return to it. They went down from the mountains to the steppes -aye, allegedly - but they never came back! Not a one? And this so-called \u0027Lord\u0027 in his lair of a cavern: why, his looks were more wolfish than ever! And his men ... their looks, too. The way they loped like upright dogs! As for the three or four ex-Krawlau men who had actually joined Radu and dwelled with him now in his great cavern: why, they were visibly changed! As quickly as that, they had become indistinguishable from the rest of his retainers. Loping, long-haired and wild ... their eyes were feral in the night... and when they grinned their upper lips wrinkled back, curling like the muzzles of snarling wolves! Thus legends that were already one hundred years old - which had been almost but not quite forgotten - were re-born and lived anew. Radu heard their whispers where the men of Krawlau crept about like so many mice, putting the final touches to his den. Well, let them whisper; he had other problems. The sixth winter was on its way, provisions were low, and the dog-Lord had no more use for clods such as these ... ... No, not so: there was one more use for them, yes! As to why they\u0027d so suddenly become aware or at least suspicious of their danger: Radu had relaxed certain strictures on himself and his pups both, until they went about more nearly as \u0027nature\u0027 intended. Now it was plain to see that nature had not intended, that these were by no means natural men. Yet in some respects they were all too natural. For years now they had gone without good wine and woman-flesh, and all the other small comforts that men - even men of war - might easily grow accustomed to when they are not about their business. Radu was scarcely ignorant of his men\u0027s needs, for he felt them, too. But now that he was set up ... Earlier in the year, aware that the Huns had had the run of the Moldavian steppe for decades and wondering if their supremacy was holding, Radu had dispatched scouts east to discover the state of things. He had also sent men west through the high passes and all along the twin spurs of the horseshoe range, and a spy into a handful of villages where they clung to the flanks of the mountains not too far removed from Wolfscrag. These latter places were small, isolated, self-supporting townships. But if Radu\u0027s long-term plan was of merit, in time they might also support him. Now he waited for his scouts to return and report to him ... When the first snows came, Radu went down into Krawlau personally, to invite the last half-dozen of his former workers into the great cave for the winter. They thanked him, however cautiously, and told him they would take advantage of his offer ... perhaps tomorrow? Radu sat by their fire a while - long enough that they noted the red cores of his eyes, and his talon hands which he made no effort to hide - and when all grew silent he left. But within the hour, panting as they dragged their scant belongings behind them on makeshift sledges, the ragged survivors of Krawlau were off down the mountain trails. Except they were survivors no longer. They got to the first pass ... where they found Radu and the pack waiting for them. Which saw to the provisioning ... for the next week or so, at least. One by one as winter laid its white cloak on the land, Radu\u0027s scouts returned. Utterly in thrall to their dog-Lord, they had given him away neither by word nor deed. But they brought home to him various items of information and al manner of rumours. Information: There were trappers, at least four teams of them, working along the river where it wound to lasi in the east. These were good clean, hardy folk; they\u0027d make for good recruiting ... or eating, whichever. They\u0027d made their winter camps, and because the Moldavian steppe was still volatile they had brought their families - and more especially their women -with them! There was a man with his two sons - aye, and a fine fat daughter, too. Another couple had two grown girls, who helped out with the skinning, curing and what all. Oh, and there were others, eating good red meat and taking pelts for the trading. Radu\u0027s informant had seen these people from the tree-line over the river. He had noted their locations, discovered their rude lodges in the rocks, but done nothing to alert them to his presence. They were only a few miles away, seven at a guess. Why, he could lead a party back there this very night... Radu himself led the raiding party, and at last there was woman-flesh in the dog-Lord\u0027s cavern manse. Naturally, he took \u0027first fruits\u0027 of the women; he had all of them that were worth having, kept the one he considered best for himself -the only one who\u0027d tried to have his eyes out... at first, anyway - and gave the rest to his men. They\u0027d fight over them, he knew that, but it was only to be expected. Indeed, Radu watched the rough-and-tumbling with great interest, in order to discover the most worthy fighters. These were his lieutenants, after all... Another scout came in, bringing more information: He had gone into the mountain hamlets in the guise of a beggar (but in fact as a spy) and seen how they were ripe for conquest and destruction. Why, the people were so soft he had no doubt they could even be herded, like so many cattle! Isolationists, pacifists, they had cut themselves off completely from the outside world, from all the surrounding war-torn regions of Dacia and the great battlefields under the mountains. Radu couldn\u0027t really say he blamed them, and in any case it wasn\u0027t conquest that was on his mind; or perhaps ... a very subtle conquest? No, these people didn\u0027t need a conqueror but a saviour! He would not kill them, not yet, but instead offer them his services as a mercenary warrior, their Voevod against who or whatever might brave these mountains and attack them. A grand scheme, and a safe one at that; for indeed it seemed that the dog-Lord had been right and the mountains were impregnable. What? But only thirty years earlier Attila himself had had his headquarters at the foot of these very mountains - but even he had skirted them to continue his assault on the west! And since Radu first commenced building Wolf scrag here? Six years sped by, and not a single invader had ventured into these heights. Or perhaps ... could it be that the threat from the east was finally over? Uneasy precognitive dreams told him \u0027no, not yet!\u0027 But Radu\u0027s dreams weren\u0027t always right. Or they were, but rarely worked out the way he thought they would. The future seemed a very devious thing. And just how long was the future, anyway ... ? Finaly al of Radu\u0027s scouts returned, including the man he\u0027d sent down onto the steppes to see how things stood. And now it was known for a fact: the last of the Huns had either retreated back into the east or settled the plains to the north. For the time being, locally at least, the fighting was over. Wherefore it seemed a good time for expansion. Now Radu\u0027s Wamphyri territorialism could come into play. Obviously these mountains belonged to no one. They might be temporarily \u0027annexed\u0027 now and then, by this or that regime, but no one held physical sway over them. It could be said that they belonged to the Dacians, the Ungars, the Romans, whoever; but who was there here to protect them? No man ... except Radu Lykan. And what is a mountain if not an aerie? And these horseshoe mountains, rearing like a buttress against the east? Inhospitable, were they? What, like the colossal stacks of Starside? Ah, but there\u0027s inhospitable and there\u0027s inhospitable! By comparison, these mountains were sheerest luxury. And inaccessible? Aye, to an invader - but not to a man already in residence. And Radu was that man. Very wel. Hamlet by hamlet, vilage by vilage, town by town, these unconquered Dacian mountains would come under his control. At first he\u0027d be the Voevod Radu, then a princeling, finaly a king of his own land - this land! It might take al of fifty years, even longer, but what was that to Radu? Wamphyri, he had hundreds of years behind him, and an incalculable number ahead. His original men, those thrals and lieutenants who had come through the Gate with him: where were they? Gone down into the earth, or gone up in smoke and reek on some batlefield, that\u0027s where. Why, even the longest-lasting of them had been dead for twenty years! But Radu - he looked a young thirty; younger, if it so pleased him! Anonymity? Bah to anonymity ... for now, anyway. But insularity? Ah, yes! He would protect the mountains, and the mountains would protect him. So be it... Rumours. One of Radu\u0027s scouts had heard it that a Ferenczy was in league with the Vandals. Hah! Wel good luck to him, whoever he was, be it Nonari the Gross -if in fact he still lived - or this son of his, this Belos Pheropzis. For if that bastard Gaeseric dealt as badly with al of his mercenaries as he\u0027d dealt with Radu ... wel, that was one Ferenczy he needn\u0027t hunt down! As for the Drakuls: They held fortress castles (\u0027aeries,\u0027 of course) in the western reaches of Dacia: in the Zarundului Mountains and the northern Carpathians. Perhaps they were enemies now; certainly they had put space between them! Al the beter when the time came for Radu to deal with them; he could take them out one at a time. And because they\u0027d brought themselves into prominence and were become \u0027legends\u0027 - viesky or vrykoulakas, who descend like bats in the night, to drink their victim\u0027s blood or steal his wife and children - it shouldn\u0027t prove too hard to recruit an army of locals to go against their castles. Oh, Radu looked forward to it! But al in good time. And meanwhile he had work to do ... Radu had reckoned on fifty or more years to make himself Lord or \u0027king\u0027 of the horseshoe mountains. It took al of that and would have taken more, if ever he\u0027d been able to complete the job. But fate, history, and ancient enmities intervened. Despite earlier vows, he brought himself into prominence, became less than anonymous, set himself up as a target. Fifty years to spread out into al the mountain hamlets, vilages, towns. A half-century to become Voevod of the horseshoe range - in its eastern reaches, anyway - during a period in history when warlords or princelings were the last thing it needed. He had werewolf lieutenants in every town, with dozens of thralls to back them up. He knew every pass, track, route, and short-cut through the eastern heights, and could move his men with incredible speed from place to place. Of course he could, for there was that of the wolf in al of them. And indeed Radu and the pack were fearsome warriors ... or would be. But where was the war? Never up here. And Radu had been wrong, too, in his belief that the Drakuls would be hated. They were, by those they wronged, but they were worshipped by others! Indeed, in a hundred and fifty years they had infiltrated, corrupted and vampirized the populace of their own western mountain areas to such an extent that entire townships were now in thrall to them, including all of the hamlets on the approaches to their aeries! Moreover, the Drakuls had recruited and turned loose many thralls to become their \u0027emissaries\u0027 or servants (or more properly their spies) abroad in the world. These had become wanderers, Gypsies, and \u0027Travellers\u0027 here no less than in Starside, in another world. And the Drakuls had engineered all of this a hundred years ago, when the Empire held sway over these Dacian parts. Why, men of the Drakuls had even crossed the borders to become true citizens of Rome -\u0027sleepers,\u0027 as it were, in the so-called \u0027civilized\u0027 regions of a barbaric world. Romans, aye ... or Romani? Romany! The source of yet another legend. And so the Drakuls had become almost invulnerable, impervious to attack except perhaps in the drone of hot summer days when they slept in the deeps of their castles, in \u0027native soil\u0027 brought with them out of Starside. But Radu knew none of that, not then. He knew where they were situated, but not their situation, how powerful they\u0027d become. He might have guessed something of it when, well past the fifty years of his earlier reckoning, he sent spies to map out the land in the heart of Drakul territory ... and they never returned. But Radu had grown powerful in his own right, until he believed that he was invulnerable. And perhaps this had made him lax ... Meanwhile, in the outside world beyond the mountains - beyond Dacia, beyond the Danube - history was passing him by. The Western Empire had crumbled away entirely; an Ostrogothic kingdom had been established in Italy; only the Eastern, \u0027Byzantine\u0027 Empire, with its capital at Constantinople, survived intact. He knew of these things, for he was not without external inteligence; perhaps he even pined a little, for al the blood spiled on the reeking batlefields of the world. And al gone to waste, without that he\u0027d been part of it. And Gaeseric the Vandal king: dead and gone these forty-odd years; and Radu\u0027s Wamphyri vow of vengeance gone with him, for he\u0027d not been a part of that either! Oh, it was maddening! Which was when he realized how bored he\u0027d become. Well, enough of all that! And he promised himself that when finally he was established throughout the mountains, and not just in the east, then he\u0027d find time to venture forth and play the warrior again. But now, in order to bring that time forward - also as an exercise in preparation for it - now it was surely time for a grand expansion west, against the Drakuls! Except... the Drakuls moved first, against him. There had been warnings. In retrospect, looking back on the far past -still dreaming his unquiet dreams in the semi-solid matrix of his resin \u0027tomb,\u0027 - Radu knew it well enough: that there had been unsettling occurrences in his many outposts strung out north and south along the legs of the horseshoe range ... In the northern Carpathians, the Voevod Radu (occasionally \u0027the Wolf) held sway in villages as far removed as Rakhov, and in the south as far as Turnu Rosu, where the hurtling waters of the Oltul had long since carved a pass through the mountains on their way to the Danube more than a hundred miles farther south. But many miles inside these far boundaries - deep in the Wolfs heartland - even there his outposts had had their problems. And not hard to guess what sort of problems. He prepared expeditions to lacobani in the north and Ruckar in the south, to see what could be done. Radu himself would lead the southern expedition; it would consist of some forty of his men, and one hundred more to be gathered along the way. Two of his bravest lieutenants -true werewolves or \u0027pups\u0027 - would head north for lacobani, and likewise collect a small army en-route. These detachments of Radu\u0027s main mercenary force, whose nucleus was still centred in Wolfscrag and the hamlets around, should suffice to sort out the problem. Which was this: Villagers and their wives and children in Ruckar, lacobani and neighbouring towns were being picked off by the viesky, the Drakul who fell upon his prey out of the night sky. People - mainly women, but occasionally children - had vanished without trace; other victims had been found drained of their life\u0027s blood. Mumbled prayers were said over them before they were put down into the ground ... but they would not stay down! Those of Radu\u0027s lieutenants who were perma nently stationed in the plague towns knew wel enough how to deal with these undead \u0027droppings\u0027 of the Drakuls - the stake, the sword, and the fire - but were at a loss as to what to do about the nightly attacks. They were werewolves and ran on the ground, while the Drakuls were flying creatures who struck out of the sky! And so it was seen how the Drakuls\u0027 methods were the very opposite of Radu\u0027s. For despite that he was no longer \u0027anonymous,\u0027 still he kept the facts of his vampirism - the fact that he was Wamphyri, and especially the fact of his lycanthropy - fairly wel hidden; whereas the Drakuls scathed openly abroad as vampires and revelled in their power. And where he used his military might and prowess to keep a tight rein on the peoples who came under his control and within his sphere of influence, they used fear pure and simple. Also, where Radu recruited men only in such numbers as were sufficient to resupply or complement the pack, and kiled only strangers, wanderers, outsiders, and beasts of the wild for the provisioning - but never people under his \u0027protection\u0027; or rarely, when they were rebellious, or openly suspicious of him - the Drakuls not only recruited their thralls in outrageous numbers but were using their vampirism to infiltrate the enemy camp and destroy opposition from within. So that in a way their blunt methods were subtle after al: first convert Radu\u0027s people, and when his power base had been destroyed ... then attack him! These had been the Wolfs thoughts on the mater, and in his mind\u0027s eye he\u0027d seen the gradual eastward creep of the Drakuls -their eating-up of his towns and villages - until at the last, as leaders of two vast vampire hordes, they\u0027d join forces in a mass attack on Wolfscrag itself ... and discover Radu and the remnants of his pack trapped in the cavern manse. Then ... ... Perhaps it was only the morbidity of Radu\u0027s old memories (for in their subconscious minds, even creatures who are grown evil and monstrous beyond words may be terrified anew by nightmares out of their past; even the horrific may be horrified) but suddenly he gave an involuntary shudder; a tremor ran through him in the semi-solid resin of his vat. Or was the tremor in the resin itself? What? A sound! A reverberation, however faint - or furtive? Now surely the Drakuls were upon him ... .\u0027/.\u0027 But no, no, for that was only an old dream out of the distant past, while the sound had been here and now ... immediate and threatening. And this time he could not be mistaken. There was someone here! Or... someone coming? Well, of course someone was coming, eventually. A delicious someone who always came. So perhaps that was it: anticipation, or wishful thinking. Imagination. Ah, yesss! But it was much too early ... she wouldn\u0027t be here yet awhile. Anticipation, yesss. But not yet... awhile. No, not yet... a ... while ... Slowly Radu relaxed into resurgent dreams, alowing them to foam up again over his anxieties to drown them. And however uncertainly, however reluctantly - having come that much closer to a true awakening this time - his mind returned to its state of hibernation, its contemplation of bygone centuries ... At that time, in the mountains of Moldavia, Radu had scarcely realized the urgency of his situation; he had seen the gradual encroachment of the Drakuls across the Transylvanian mountains into Moldavia as just that: gradual. But in fact their plan had been more immediate, and their campaign not merely one of territorialism but also of destruction. Radu\u0027s destruction, and now! Partly, it was the enmity which exists between al great vampires. A hatred which had existed since the building of the first Starside aeries, which had been wrought in al the bloodwars of a paralel world, and which would now continue in this world until the end of time, or until no one was left to carry it on. It was the knowledge in the dark heart of every Lord of the Wamphyri that if he would live he must do to others of his kind before they did to him. But from the Drakuls\u0027 point of view, it was also the need to clear the way for expansion. For it seemed to them that they had proved a point: that they could live as vampires here without hiding themselves away. Anonymity was no longer a requirement, no longer synonymous with longevity - but invincibility was! They were not visionaries, the Drakuls, no; but planners, certainly. For the time being, for now, these soaring mountains were vast. But in some future time, would there be room for al the Wamphyri yet to come, those as yet unsired out of women, or brought about by transfusion of vampire eggs or poisoned blood? Which of them were destined to inherit this earth, these gaunt and gloomy mountains? The egg- and blood-sons of noble Drakuls, or the spawn of miserable dog-Lords? And what of the Ferenczys? Wel, for the moment the Ferenczys were not part of the equation, but Radu Lykan most definitely was ... Radu\u0027s expeditionary forces were ready; he was on the point of sending them westward through the high passes when he heard a rumour - but such a rumour that it at once rooted in his imagination and grew there until he couldn\u0027t ignore it. Then, sending the lacobani contingent north, he took his own party with him down into the steppe, to Bacau where this whisper had its origin. And now the truth was learned: how the Emperor Justinian had commissioned a fleet under the general Belisarius, to strike at the Vandals even across the Mediterranean, in north Africa and other parts ... and take back the Western Empire. The Vandals! and Radu\u0027s old vow still unfulfiled! And a Ferenczy among the treacherous scum at that! Old Gaeseric may have gone the way of al - or most -flesh, but at least one Ferenczy remained. And even after al this time any surviving member of the Ferenczy dynasty was far and away Radu\u0027s direst enemy, spawn of those olden destroyers of his dearest love in another world, another time. And all of it like yesterday to Radu. His blood was up at once; he saw al kinds of possibilities: join with the Byzantines as a mercenary under Belisarius, distinguish himself in the field of battle, eventually return to these desolate heights, but as Voevod of al Dacia - and al with the Emperor\u0027s approval! And then see to the Drakuls, with an entire legion, perhaps, to back him up. Grand schemes, except ... no, it could never be. For his plans were made and his mind set. And in the west the Drakuls were waiting even now. Also, who could say how the Byzantines would come out of this new venture? What if they should lose? Indeed, it would be to Radu\u0027s advantage if that were the case (especially if he was not with them), for he would rather protect his mountain territories against some future invasion by Vandals than the reborn, restructured might of Rome! And so, torn two ways, Radu returned to Wolfscrag in the heights. Or to what had been Wolfscrag. But now ... It might easily be a different place. Radu scarcely recognized it. But he did recognize his error, or something of it. His dreams of warfare in these mountains: not against invaders out of the east but the Drakuls; not against a horde of nomad warriors but a swarm of vampires! Under the grey cloud ceiling of early winter, there had been no sun to fear; they had flown by day, attacked by night. And, but for the fact that he\u0027d gone down into the plain, Radu would have been part of it. But from the sheer scale of the devastation he knew that even he could never have survived it. The gantlets were undermined, toppled inwards. In several places the ceilings - even the sides of the crag, of the mountain peak itself -had falen in, where black smoke roiled and the occasional tongue of flame stil belched up from the fires within. Fifty years\u0027 work gone up in smoke. The scene was very nearly volcanic; certainly it burned in Radu\u0027s heart. The Drakuls! Evidence of them and theirs was everywhere, but they had not had it all their own way. A half-dozen common thralls stood gaunt as sentinels in the early morning light, like mind-blasted, yellow-eyed totems on the slopes of ruined Wolfscrag; but a handful of grim, grimy, surviving lieutenants tumbled mangled vampire bodies down into the fiery vents, the while inhaling gustily on the reek of their burning. Ah, Radu\u0027s dream was real as life, as death, as undeath! So that he sniffed, too - with his mind, for his great wolfs nostrils were plugged with resin - and for a moment he could even smell the roasting meat... ... Until he smelted something else! Smelled - heard - sensed - something else! A presence! An intelligence! And this time he simply could not be mistaken. Footsteps, running. A mouth, gasping. A heart, pounding. Radu\u0027s heart pounded, too, but just once: a single great throb in his breast, finaly bringing him awake ... Bonnie Jean came to the place of her Master. She came panting, with pictures of the vat-creature\u0027s slit of an alien eye still burning on the eye of her own mind. And she came pondering the question of her own presence here. It was hardly the first time she\u0027d so pondered, and it wouldn\u0027t be the last. But did it constitute uncertainty, making her unworthy? Surely not. Surely it was part of the ritual: not only to perpetuate Him but her own faith in Him. For after al she was of Rim, however many times removed. And the creature in the vat? Was that o/Him, too? Bonnie Jean knew that it was, and once more was set to wondering: what sort of a future world would it be, when He came up to elevate mankind into His kind? What part could a Thing or things such as the vat-creature play in the dark and deadly future world of her Master\u0027s forevisioning? His guardian creatures? But against what, in a world where the dog-Lord was the ultimate power? At the western extreme of the lair she recognized her location, came to a halt, controled her breathing. It would never do to approach Him in this agitated state, showing signs of her uncertainty. But as she waxed more and more like Him, the more fearful she grew ... ... And that was a thought to give pause, too! What, Bonnie Jean Mirlu, His from birth, fearful? And of Him? Ridiculous! It was this place, playing on her nerves, her mind; it was the creature in its resin vat; it was ... anxiety, yes! The advent of Harry Keogh, and the watcher in Edinburgh, and recent events in general. But most of al it was awareness of the fast-approaching time of her Master\u0027s awakening, when He would be up again. A time of change, when her oh-so-long established way of life must of necessity change, to accommodate His. For at present He was only her Master in absentia, and she was the \u0027wee mistress.\u0027 But... how much influence would Bonnie Jean retain when the Master was back? And if it\u0027s true that when the cat\u0027s away the mice wil play, how \u0027playful\u0027 the cub when the Wolf is not to house? Would her Master have given thought to such, or was it beneath Him? Could He consider such things, in His long sleep, and why did she give thought to it? Had she been unfaithful, if only in her mind, in her thoughts? Bonnie Jean didn\u0027t think so; but in any case never seriously, and never maliciously! But then, she would be Wamphyri! And they were ever prideful, territorial... and this had been her territory for close on two hundred years! What!? She couldn\u0027t go to Him thinking these thoughts! She hadn\u0027t intended to think them! It was this place, her mood, the question of her own continuity, when al that should concern her was His! How would it be when He was up? What would be alowed, and what disalowed? Men? Oh, she\u0027d known men over the years. But that had been entirely compatible with her faithfulness to Him. Indeed He had required that she know men, so that she might be experienced in al things. He wished no wilting, virginal hand-maiden sitting at His right hand in that dark, future world of His visions but an experienced woman. No naive, blushing bumpkin but a scholar in al Man\u0027s ways, in his emotions as wel as his sciences. For the more a man (or a woman, or a changeling creature out of the myths and legends of the past) knows his enemy, the more easily he may dispose of him. Intelligence ... Aye, intelligence, that was it! ... To gather knowledge of the world around, for His sake. And surely to have intelligence was to be intelligent and to question things? Even such questions as Bonnie Jean had asked herself? But they were not symptomatic of treachery. Never that. Intelligence? ... A presence? ... Bonnie! Bonnie Jean! (A grunt, almost of pain, finaly of recognition, but sounding in her mind!) And then B.J. reeled as if struck in the forehead, as she knew that the words in her head were not hers but His. She was the intelligence, that presence He referred to; for her Master had sensed her here! But how long had He been listening, while she thought... such thoughts? She cleared her mind; indeed her thoughts were driven out, if only by her utter confusion. And: \u0027Master, I am here.\u0027 She gasped the words out, concentrating only on Him. Bonnie! Bonnie Jeeeeean! (A grunt, a snarl, finaly a sigh. Then a vast and terrible sniffing, like that of a great hound - the Great Hound - as He tracked her essence through the shuddering vaults of her mind). And echoing there: But I had thought... an intruuuuder! She was in control of herself now. \u0027No intruder, no.\u0027 She shook her head, then lifted her gaze up, up, taking in the outline of his great stone sarcophagus, like an altar at the apex of a granite jumble: the source of these, His thoughts. \u0027No intruder, my Master. Just me.\u0027 (Another rumbling sigh, and His thoughts coming clearer to her as the mental connection strengthened, as His concentration centered upon her). Ahhhh! Bonnie Jeeeean! But... did I cal you? It seems ... too soon? \u0027You did not cal me, my Master.\u0027 (Bonnie Jean had caught her breath now; she was fully in command of the situation, of her words and thoughts alike). \u0027But I came in a hurry, before my time. If I have disturbed you, then I am sorry, but events were such ...\u0027 Eventsss? \u0027Yes,\u0027 she nodded, climbing the crazily-angled jumble of the steps. \u0027Yes, there have been ... occurrences. A watcher in Edinburgh -some kind of spy, perhaps - and a mysterious stranger. Perhaps these things mean nothing, I can\u0027t yet say, but I thought it best that you should know.\u0027 But just as quickly as Bonnie Jean had regained command of her senses, so Radu had come fully awake. And as she stepped up onto the platform of his sarcophagus, so she felt the intensity of his thoughts -his mental frown - right through the stone slab walls of his coffin. A spy, in Edinburgh? (His \u0027voice\u0027 was sharp, severe). And a mysterious stranger? And yet you saw fit to come here? What, and would you place me in jeopardy, Bonnie Jean? \u0027Never that, my Master!\u0027 She shrank back from his severity. \u0027For am I not your guardian, set to watch over you? And I have watched most diligently. I have served you faithfully. Why, my blood is in you, as yours is in me! But now I need advice, and who else can I go to?\u0027 (Radu\u0027s grunt by way of reply. And after a moment\u0027s consideration): First tell me about this watcher, this spy. Could it be . . . Them? Do you think they seek me out? \u0027I think it must be them, yes,\u0027 she answered, and she told him what Harry Keogh had told her. It wasn\u0027t much, but it worried him nevertheless. When she was done: But what if you were followed on your way here? How do you know your precautions were sufficient? At least one Drakul survives; so I believe, for I have dreamed it. Aye, and more than one Ferenczy! And here am I, a weak, shrivelled old thing like ... why, like a fly in amber! I am not ready to be up, Bonnie Jean. I cannot protect myself. And you ... are only a girl. At which she bridled a very little, and knew that he would sense it as surely as if they were face to face. Then, climbing onto the piled slabs towards one end of the sarcophagus, she leaned over the rim to gaze down on him; so that now they were face to face. But his form was indistinct, obscured by the resin where dust had setled on its crusted, wrinkled surface. She stared harder, until slowly the thing in the resin took on an awesome outline. His eyes were closed, of course, as they had been for all of the two hundred years she\u0027d known and served him. But behind them, as ever, Bonnie Jean saw, sensed, but couldn\u0027t quite feel their heat. Oh, but it was there, subdued but not quenched: the nickering heat of life - or undeath - suspended to the limit. Moreover, it was as if something of the fire of those eyes had spilled out onto their sunken orbits, to turn them and his hollow cheeks ruddy against the sick-yellow pallor of his face in general. Her Master, despite that he was not all man, was a veritable giant of a man. He must be almost seven feet tal, and in his heyday, full-fleshed, he had been more physically powerful - and more dangerous, certainly -than any intelligent creature the world had ever known. He\u0027d had the speed and cunning of the wolf, the intelligence of man, the strength of the Wamphyri! And will again, Bonnie Jean, and will again, he told her. And in a moment: Very well, I can see that I have offended you. And I accept that you came here in all good faith, and that you have taken all necessary measures to keep me safe. And truth to tell, I have been feeling... weak. Which has made me impatient and less than agreeable. Is that so hard to understand? I think not. The years of waiting have been long, and what am I become but a wraith of my former self? And you are right: your blood has kept me warm, kept me alive. So, this time you are early; perhaps it is as well, for my spark flickers low, Bonnie Jean. But you ... shall rekindle it yet again. At that last Radu\u0027s \u0027voice\u0027 had fallen to a low, guttural, almost a lustful growl, which Bonnie Jean had answered with an involuntary shudder (of immeasurable horror ... or unthinkable pleasure? She couldn\u0027t say), for his meaning was clear enough. That, however, will have to keep for now, the thing in the resin quickly went on, and his voice was normal again. Aye, for we have other things to do, to discuss. Problems have presented themselves; but until I know their extent, I cannot know how to counter them. And there have been other problems, which remain ... unresolved? What about the girl? A whole year, Bonnie Jean. Is she still missing? Is there no news of her? If not, we must assume the worst: that They took her! Wherefore, they could be that much closer to you, and to me ... But: \u0027No,\u0027 B.J. shook her head, and knew he would sense it. \u0027She didn\u0027t know this place; she\u0027d never been here. Nor did she know you, my Master.\u0027 But she knew of me. And certainly she knew of you. \u0027She was sworn to silence,\u0027 B.J. countered. \u0027She was beguiled, hypnotized ... she could not speak! None of us can, and myself least of aU; you vowrself have seen to that, my Master. An enemy might contrive to steal me away -though not without a fight - but he could never make me talk ... \" Huh! (A wry, dry, barking chuckle). But you do not know the Wamphyri, Bonnie Jean. With them, you must always assume the worst. However, let us put that aside for now and go on to this other thing. You have told me about the watcher. We will talk about him - what to do about him - again. But you also made mention of a mysterious stranger. What, and have you let a man into your life, Bonnie Jean? Into our lives? Ah, and you seem to consider him important! I can even feel your ... what, excitement? Very well, and now perhaps you will tell me about him. Yesss, tell me all about your mysterious stranger. Or better still, show meeee. And she did. For long minutes the story flowed from her mind to his, just as she remembered it. And while it answered certain questions he hadn\u0027t yet asked - such as the result of her quest for a bogus werewolf in London, which she had undertaken on his behalf- it prompted others which he\u0027d scarcely conceived ever to ask her. And now Radu\u0027s excitement was as great as hers ...","sourceLink":"https://allnovel.net/necroscope-the-lost-years-necroscope-9/page-18.html","bookId":2453,"book":{"id":2453,"title":"Necroscope: The Lost Years (Necroscope #9)","description":"Storyline: Necroscope: The Lost Years Volume I (Necroscope #9) Vampires never rest, and neither does Harry Keogh, the world\u0027s greatest vampire hunter, the Necroscope, the man who can talk to the dead. Right now, he\u0027s desperately searching for his wife and son, who disappeared in the midst of Harry\u0027s war against the undead monsters that plague mankind. Others will to carry on that fight until the Necroscope has been reunited with his beloved family. But it\u0027s not that easy to leave the vampire war behind. The bloodsuckers know that the Necroscope is their deadliest enemy and will do anything to destroy him. Harry struggles to locate his missing family, not realizing that he has become a pawn in the battle between two powerful vampires. When one has slain the other, the Necroscope will be the next to die.","cover":"https://allnovel.net/images/necroscope-the-lost-years-necroscope-9.jpg","author":"Brian Lumley","type":"Horror","source":"allnovel","link":"https://allnovel.net/necroscope-the-lost-years-necroscope-9.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:25:51 PM"}}
