{"id":79699,"no":11,"title":"Page 11","content":"“Think so?”\n “How long are you going to stay here in Eclipse Bay?”\n He shrugged and turned back to finish the coffee. “As long as it takes.”\n “You can afford to just drop everything and move back here to Eclipse Bay for an unspecified period of time?”\n “Nothing holding me in San Diego.”\n “That’s where you’ve been all these years?” Her tone was one of unwilling curiosity.\n Just had to ask, he thought. As if she couldn’t help herself. Good sign. Maybe.\n “For the most part,” he said easily.\n He pressed the plunger down to trap the grounds in the bottom of the pot. Then he glanced at Hannah over his shoulder. She was watching him with an enigmatic expression.\n “What about you?” he prodded softly. “How long do you intend to stay here in Eclipse Bay?”\n Her brows rose. “For as long as it takes.”\n “There are three floors. Plenty of bedrooms and baths. Take your pick.”\n “You’re staying here?”\n “Sure, why not?”\n “Then I think I’ll use my folks’ place,” she said coolly.\n What had he expected? That would have been too easy, anyway. Nothing ever came easy to him. He had a talent for doing things the hard way.\n “Suit yourself,” he said. “But this is Eclipse Bay. You’re a Harte and I’m a Madison, and by now everyone knows Isabel left Dreamscape to both of us.”\n “So?”\n “So, people are going to talk, regardless of where you choose to sleep.”\n She watched him pour the coffee. When he handed her the mug, her fingers brushed against his. He savored the small thrill, wondered if she felt anything at all.\n She turned away a little too quickly and paced to the far end of the counter.\n “Let’s go back into the solarium.” He led the way out of the kitchen. “We can sit down out there.”\n Hannah said nothing, but she trailed after him. He watched her settle neatly onto a cushioned white wicker lounger. Winston sauntered into the sunroom, found a satisfactory place near the window, and flopped down on his belly. He rested his muzzle on his front paws and watched Rafe through feathery brows.\n Hannah turned the mug between her palms. “What exactly do you plan to do with Dreamscape?”\n “I’m going to open an inn and restaurant.”\n Her mouth fell open. She stared at him, her eyes widening in astonishment.\n “You’re going to do what?” Somewhere between a screech and a choking sound.\n “You heard me,” he said mildly.\n “You can’t be serious,” she sputtered. “That’s my plan. At least, the inn part is my plan.” She hesitated, frowning. “I hadn’t thought about adding a restaurant.”\n “You should have thought about it. The reputation of any hotel is greatly enhanced by a high-quality restaurant.”\n “No offense, but as I recall, your idea of a high-class establishment when you lived here was the Total Eclipse Bar and Grill. I seriously doubt that any place that uses the slogan Where the sun don’t shine is going to show up in your better grade of guidebook.”\n “The Total Eclipse has its place in the grand scheme of things.”\n “I’ll take your word for it.” She eyed him. “Just what do you know about running an inn and a restaurant?”\n “I worked at a five-star place down in San Diego for a while.”\n “Terrific.” She gave him an icy look. “You’ve worked in a hotel, so you think you can run one?”\n “I’ll admit I’m stronger in the food-and-beverage area than I am on the innkeeping side.”\n “What did you do at this five-star place in San Diego? Wait tables?”\n “Among other things,” he said. “What about you? Know anything about the innkeeping business?”\n “As a matter of fact, I’ve been taking intensive classes in hotel management for nearly a year. Ever since I got the idea of turning Dreamscape into an inn.”\n “Is that so? And just where did you get the brilliant notion of converting this place into a hotel?”\n She hesitated. “Aunt Isabel and I started talking about it a year ago.”\n He whistled softly. “What an astonishing coincidence.”\n “Don’t tell me.” Hannah’s jaw was very tight now. “She mentioned the idea to you at about the same time, right?”\n “Right.”\n Hannah tapped a neatly manicured nail against the side of her glass. “Let me make something very clear. This isn’t an impulse or a flash-in-the-pan idea for me. I’ve done a lot of thinking and planning during the past year. I’ve made my decision. I’m going to sell Weddings by Harte and open this inn. I’m absolutely committed to this project.”\n “What a coincidence,” he said again.\n “Let’s get real here. Sooner or later we’re going to have to come to some agreement about what to do with Dreamscape.”\n He settled deeper into his chair and looked out over the bay. “I’m in no rush.”\n She gave him a frozen smile. “I noticed.”\n Chapter 3\n Snow’s Café had changed little in eight years. Whenever she stepped inside, Hannah always felt as if she had entered a time warp. The colorful posters on the walls were always the same—a mix of classic rock band ads and pithy sayings that reflected the conspiracy theories of the owner, Arizona Snow. The large one over the cash register summed up Arizona’s worldview. The illustration showed two bug-eyed space aliens in heavy-metal attire. They were armed with futuristic weaponry. The slogan underneath read, We’re from the government and we’re here to help.\n The café was the main hangout for the faculty and students of nearby Chamberlain College. The Eclipse Bay Policy Studies Institute was not far away, but the think tank staff tended to avoid Snow’s. It was no secret that since the day the institute had opened its doors Arizona had viewed the facility with deep suspicion. She was convinced that whatever was going on there constituted a dangerous threat to all those who cherished a free society.\n “Over here, Hannah.” Pamela’s face lit up in welcome. Pamela McCallister was now on the faculty of the English department at Chamberlain, and over the years her upwardly mobile path through the thorny territory of higher education had been marked by subtle but highly significant changes of fashion. She still wore a lot of black, but there was less of the romantic poetess about her now and more of the trendy professional. Her hair was much shorter, marking her shift from student to faculty status. The voluminous bag she carried was made of much more expensive material than the one she had favored eight years ago. \n","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-11.html","bookId":1795,"book":{"id":1795,"title":"Eclipse Bay (Eclipse Bay #1)","description":"Storyline: \n Eclipse Bay has grown and flourished on the rugged Oregon coast, where the shore can be rocky and forbidding, full of sharp cliffs and hidden coves. In Eclipse Bay by Jayne Ann Krentz, this small town is also filled with secrets as treacherous as the landscape and rivalries as fierce as an ocean storm. \n Their grandfathers hated each other. \n Their fathers hated each other. \n And as the next generation of the Hartes and Madisons, Hannah and Rafe are expected to hate each other too. But Hannah Harte, a successful wedding consultant with a skeptical view of marriage, remembers the long-ago night on the beach that revealed Rafe as much more than just \"that disreputable Madison boy.\" And Rafe remembers the heroic gesture that proved Hannah\u0027s fierce spirit was stronger than any feud and saved him from near-certain imprisonment. \n Now reunited by a surprising inheritance after years of living their separate lives, Rafe and Hannah return to Eclipse Bay, and the hostilities that still divide, and bind, their families. And they are discovering something that is at once delightful and deeply disturbing ... \n They don\u0027t hate each other. Not at all.\n \n","cover":"https://allnovel.net/images/eclipse-bay-eclipse-bay-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/eclipse-bay-eclipse-bay-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:17:38 PM"}}
