{"id":79716,"no":28,"title":"Page 28","content":"When Rafe and Hannah had walked into the reception together shortly after eight, they had caused any number of heads to swivel and jaws to drop. A ripple of murmurs had spread through the crowd. An amazing number of people had found an excuse to cross the room to greet them and make conversation.\\n\\n Definitely not a banner night for Thornley, Rafe thought. How could his staff have known that their man’s forthcoming announcement of his intention to run for the U.S. Senate seat would take second place to the latest development in the Harte-Madison feud?\\n\\n Jed munched a cracker slathered in cream cheese and smoked salmon. “Thornley might be the next senator from the great state of Oregon, but he’s having a hard time getting anyone’s attention tonight.”\\n\\n “Only so far as the locals are concerned. The out-of-town crowd hasn’t got a clue about the reason for the buzz.”\\n\\n “True, but almost everyone here is from Eclipse Bay.” Jed eyed Perry and Hannah with an assessing gaze. “Decatur certainly doesn’t look thrilled. Probably didn’t expect you to show up with Hannah.”\\n\\n Rafe watched Perry and Hannah come to a halt on the dance floor. “I’m not real concerned with Decatur’s feelings.”\\n\\n “From what I hear, he’s got a lot at stake tonight too. Word is he’s trying to position himself to take over the institute next year.”\\n\\n “Not my problem.” Rafe picked up a feathered toothpick that had an olive, a bit of cheese, and a mushroom impaled on it. He put the tiny skewer in his mouth and removed the edible portions with his teeth.\\n\\n Jed shot him a curious look. “So what’s up with you and Hannah, anyway?”\\n\\n “We’re conducting negotiations.”\\n\\n Jed looked amused. “Yeah, I heard about that. Your Porsche was spotted at the Harte place night before last. Word is you’re doing your negotiating in bed.”\\n\\n Very deliberately, Rafe turned to look at him. He said nothing.\\n\\n Jed grimaced and put up a hand, palm out. “Sorry. Can’t help the curiosity. I’m a reporter, remember?”\\n\\n “Yeah,” Rafe said, “I remember.”\\n\\n “I get the message. No more questions of a personal nature about you and Hannah Harte. But speaking as an old friend, I’ll just say that you’d better hope that her family doesn’t get wind of the talk that’s going around town.”\\n\\n “I’m not worried about the rest of the Hartes. This is between Hannah and me.”\\n\\n “Sure. Whatever you say.” Jed reached for another canapé and another topic of conversation. “Some big bucks in this crowd tonight. Just saw Tom Lydd and his new bride arrive. I understand the head of the institute is hoping Lydd will endow a research fund.”\\n\\n Rafe followed his gaze to the man with the boyish face and the techie glasses on the far side of the room. Tom Lydd was not yet thirty, but he was already worth millions. “Very smart guy. Took his company public at the right time. His security software is some of the best on the market. Wouldn’t be surprised if there’s a buyout on the horizon.”\\n\\n Jed glanced at him. “You follow that kind of business news?”\\n\\n Rafe shrugged. “It’s a hobby.”\\n\\n Jed nodded, satisfied. He turned back to his survey of the crowd. “Not a bad turnout for the institute. A rising politician, a sprinkling of big money, and the right people from the political end of the spectrum. Got to admit, this operation has come a long way since it first opened its doors.”\\n\\n Rafe glanced at the tall, photogenic man talking to Tom Lydd. “And so has Trevor Thornley.”\\n\\n “You can say that again. He’ll do okay in Washington. He’s got all the right instincts, including good timing.”\\n\\n “You always said that timing was everything.”\\n\\n “It sure as hell is in politics. Thornley is also into long-range planning. Another big asset. In addition, he’s smart enough not to neglect his home base here in Eclipse Bay. Pols that take their local support for granted always get into trouble fast.”\\n\\n “The fact that he married Marilyn Caldwell didn’t hurt him either,” Rafe said dryly.\\n\\n Jed grunted. “You can say that again. Her father’s money has come in real handy. Like I said, the guy knows how to plan.”\\n\\n “He sure pays a lot of attention to the institute.”\\n\\n “With good reason. He was its first important political client, and he’s still the most faithful. The higher he climbs, the more prestige and power this place acquires.”\\n\\n “And the more it backs him.”\\n\\n “That’s how it works.” Jed swirled the wine in his glass. “I remember covering his first public relations events here. I knew even then that he had what it takes to make it big in politics.”\\n\\n Rafe thought about the night he had walked Hannah home. The institute had been ablaze with lights that evening. He had seen them from Bayview Drive. Hannah had mentioned that her parents were attending a reception for a politician named Thornley who had just announced that he was running for the state legislature.\\n\\n Rafe hadn’t paid much attention. Politics had been of little interest to him in those days. In any event, he had been too busy obsessing on Hannah’s list of criteria for Mr. Right that night.\\n\\n The memory made him look around for his date. He spotted her coming toward him through the crowd. The sight of her sparked a thrill of intense awareness deep in his gut. She looked great, he thought. The snug-fitting little black number she was wearing underscored a whole lot of her best assets, including the neatly curved br**sts, slim waist, and full hips. Her hair swung in a sleek, gleaming curve every time she moved her head. Her legs were incredibly sexy in dark stockings and black high heels.\\n\\n The most exciting woman in the room, no doubt about it. At least so far as he was concerned.\\n\\n He watched her weave her way toward him. She had Decatur in tow, but Perry looked more irritated than ever, so that was okay for now, Rafe concluded. Irritated was good. Irritated meant that Decatur had not liked the fact that Hannah had brought her own date tonight. The jerk had probably counted on taking her home after the reception, maybe even planned to take up where he had left off that night in the front seat of his car eight years ago.\\n\\n Not bloody likely.\\n\\n Hannah came to a halt in front of Rafe. She looked flushed and glowing, and there was a sparkle in her eye. He was almost positive that Decatur had nothing to do with the look. She was up to something. He had sensed it when he’d picked her up earlier. She had a scheme cooking tonight. He was content to stand back and watch it unfold. \\n\\n","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-28.html","bookId":1795,"book":{"id":1795,"title":"Eclipse Bay (Eclipse Bay #1)","description":"Storyline: Eclipse Bay has grown and flourished on the rugged Oregon coast, where the shore can be rocky and forbidding, full of sharp cliffs and hidden coves. In Eclipse Bay by Jayne Ann Krentz, this small town is also filled with secrets as treacherous as the landscape and rivalries as fierce as an ocean storm. \\n Their grandfathers hated each other. \\n Their fathers hated each other. \\n And as the next generation of the Hartes and Madisons, Hannah and Rafe are expected to hate each other too. But Hannah Harte, a successful wedding consultant with a skeptical view of marriage, remembers the long-ago night on the beach that revealed Rafe as much more than just \"that disreputable Madison boy.\" And Rafe remembers the heroic gesture that proved Hannah\u0027s fierce spirit was stronger than any feud and saved him from near-certain imprisonment. \\n Now reunited by a surprising inheritance after years of living their separate lives, Rafe and Hannah return to Eclipse Bay, and the hostilities that still divide, and bind, their families. And they are discovering something that is at once delightful and deeply disturbing ... \\n They don\u0027t hate each other. Not at all.\\n","cover":"https://allnovel.net/images/eclipse-bay-eclipse-bay-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/eclipse-bay-eclipse-bay-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:17:38 PM"}}
