{"id":79692,"no":4,"title":"Page 4","content":"“Uh-huh.”\\n\\n “He’ll also get along well with my family, love animals, and be very supportive of my career.”\\n\\n Rafe lounged back on his elbows. “But other than that, just an ordinary guy?”\\n\\n For some inexplicable reason his mockery hurt. “You think I’m asking too much?”\\n\\n He smiled faintly. “Get real. The guy you’re looking for doesn’t exist. Or if he does, he’ll have some fatal flaw that you didn’t expect.”\\n\\n “Is that so?” She narrowed her eyes. “How about your Ms. Right? Got any idea of what she’ll be like?”\\n\\n “No. Doubt if there is one. Not that it matters.”\\n\\n “Because you’re not interested in a monogamous commitment?” she asked acidly.\\n\\n “No, because the men in my family aren’t much good when it comes to marriage. Figure the odds are against me getting lucky.”\\n\\n She could hardly argue that point. His grandfather’s four spectacularly failed marriages were common knowledge. Rafe’s father, Sinclair, had had two wives before he had engaged in the tumultuous affair with his model that had produced his sons. The assumption was that if he had not died in the motorcycle accident, Sinclair would have racked up a string of divorces and affairs that would have made Mitchell’s record pale in comparison.\\n\\n “Marriage should not be viewed as a lottery or a crap-shoot,” she said sternly. “It’s a serious step, and it should be treated in a logical, rational manner.”\\n\\n “You think it’s that easy?”\\n\\n “I never said it’s easy. I said it should be approached with intelligence and sound common sense.”\\n\\n “Where’s the fun in that?”\\n\\n She gritted her teeth. “You’re teasing me again.”\\n\\n “Face it—we Madisons don’t usually do things that involve common sense. We probably lack that gene.”\\n\\n “Don’t give me that garbage. I’m serious about this, Rafe. I refuse to believe that you can’t change what you see as your destiny.”\\n\\n He slanted her an appraising glance. “You really think I could be the one to break the mold?”\\n\\n “If you want to break it badly enough, yes, I really think you can do it.”\\n\\n “Amazing. Who would have thought a Harte would be such a dreamer?”\\n\\n “All right, what are you going to do with your life?”\\n\\n “Well,” he drawled, “I’ve noticed that the cult and guru businesses are profitable.”\\n\\n “Get serious. You’ve got your whole life ahead of you. Don’t throw it away. Think about what you want. Make some concrete plans. Develop solid goals and then work toward them.”\\n\\n “You don’t think my present career objective is a worthy goal?”\\n\\n “Staying out of jail is okay as far as it goes. But it’s not enough, Rafe. You know it isn’t enough.”\\n\\n “Maybe not, but it’s all I’ve got at the moment.” He glanced at his watch. The dial glowed in the moonlight. “I think it’s time that you went home.”\\n\\n Automatically she looked at her own watch. “Good grief, it’s after one. It’s going to take at least half an hour to walk home from here. I’ve got to get going.”\\n\\n He came up off the rock in a fluid movement. “I’ll walk with you.”\\n\\n “That’s not necessary.”\\n\\n “Yes it is. I’m a Madison and you’re a Harte.”\\n\\n “So what?”\\n\\n “So, if something were to happen to you between here and your place and your folks found out that I was the last guy to see you, I’d get the blame, for sure.”\\n\\n She smiled. “And maybe get tossed into jail by Chief Yates?”\\n\\n “Yeah. And that would put a real crimp in the only viable career plan I’ve got at the moment.”\\n\\n The broad, semicircular sweep of the bay began in the distance behind Hannah, near the treacherous waters of Hidden Cove. It ended somewhere up ahead in the darkness, at a jutting piece of land known as Sundown Point. There were no streetlamps on the long, curving bluff road that rimmed the restless waters of Eclipse Bay. The sparse lights of the pier, the marina, and the town’s tiny business district lay more than two miles to the rear, in the direction of Hidden Cove.\\n\\n Up ahead, Hannah could make out only a vast pool of darkness. Sundown Point was invisible in the all-enveloping night. She knew that a handful of cottages and homes were scattered along the heavily wooded bluffs, but she saw no illuminated windows. Her family’s summer place was nearly a mile from here, perched over a small, sheltered cove. Her aunt’s big house, Dreamscape, was at least another half mile beyond that.\\n\\n It was, indeed, going to be a long walk.\\n\\n She glanced back over her shoulder. The faint glare of a well-lit parking lot could be seen on the hillside. It emanated from a clearing in the trees above the town. The parking facility belonged to the Eclipse Bay Policy Studies Institute, a recently established think tank that had been built close to Chamberlain College.\\n\\n “My parents are up there at the institute tonight,” she said at one point, just for something to say. “They’re attending the reception for Trevor Thornley.”\\n\\n “The hotshot who’s running for the state legislature?”\\n\\n “Yes.” She was surprised that he was aware of Thornley’s campaign. He didn’t seem like the type who paid attention to politics. But she refrained from making that observation aloud. “It looks like the event is running late. I may even get home ahead of Mom and Dad.”\\n\\n “Lucky for you, hmm? You won’t have to go into a lot of awkward explanations about why you came home with me instead of the jerk tonight.”\\n\\n She glanced at him, surprised. “I’ll tell them what happened in the morning.”\\n\\n He slapped his forehead with the heel of his palm. “That’s right, I keep forgetting. I’m with Ms. Goody Two-Shoes here. Of course you’ll tell your parents that you spent the night on the beach with me.”\\n\\n Shock brought her to a sudden halt. “I did not spend the night on the beach with you, Rafe Madison. And if you dare tell your friends down at the Total Eclipse Bar and Grill that I did, I swear I will… I will sue you. Or something.”\\n\\n “Don’t worry,” he muttered. “I’m not planning to announce to the whole town that we did it under Eclipse Arch.”\\n\\n “You’d better not.” She gripped her purse more tightly and started walking quicker. The sooner she got back to the house, the better. \\n\\n","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-4.html","bookId":1795,"book":{"id":1795,"title":"Eclipse Bay (Eclipse Bay #1)","description":"Storyline: Eclipse Bay has grown and flourished on the rugged Oregon coast, where the shore can be rocky and forbidding, full of sharp cliffs and hidden coves. In Eclipse Bay by Jayne Ann Krentz, this small town is also filled with secrets as treacherous as the landscape and rivalries as fierce as an ocean storm. \\n Their grandfathers hated each other. \\n Their fathers hated each other. \\n And as the next generation of the Hartes and Madisons, Hannah and Rafe are expected to hate each other too. But Hannah Harte, a successful wedding consultant with a skeptical view of marriage, remembers the long-ago night on the beach that revealed Rafe as much more than just \"that disreputable Madison boy.\" And Rafe remembers the heroic gesture that proved Hannah\u0027s fierce spirit was stronger than any feud and saved him from near-certain imprisonment. \\n Now reunited by a surprising inheritance after years of living their separate lives, Rafe and Hannah return to Eclipse Bay, and the hostilities that still divide, and bind, their families. And they are discovering something that is at once delightful and deeply disturbing ... \\n They don\u0027t hate each other. Not at all.\\n","cover":"https://allnovel.net/images/eclipse-bay-eclipse-bay-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/eclipse-bay-eclipse-bay-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:17:38 PM"}}
