{"id":79752,"no":64,"title":"Page 64","content":"“Rafe and Hannah aren’t kids anymore. They’re full-grown adults. They’ll make their own decisions.”\n “Huh. Far as I’m concerned, Rafe’s already made his, and he’s by God gonna follow through if I have anything to say about it. Hannah’s a nice young woman, even if she is a Harte. If he thinks he can fool around with her and then walk away, he’s got another thing coming.”\n Bev peered at him with a mixture of amusement and curiosity. “Are you saying you feel Rafe ought to marry Hannah?”\n Mitchell balanced the cup and saucer on the broad leather arm of the big chair. “Yep. That’s exactly what I think.”\n “Since when did you become such a zealous believer in old-fashioned morality?”\n “Since I started watching the two of ’em together. You ought to see the way he looks at her, Bev. Damn near painful.”\n “What about Hannah?”\n “She looks at him the same way. Thing is, they’re scared to death of each other.”\n “You think you can play Cupid?”\n “Figure it’s my responsibility to straighten things out.” Mitchell looked at the river. “I put my son, Sinclair, through hell when he was a boy. Set a real bad example. Sure enough, he turned right around and did the same thing to Rafe and Gabe. I figure it’s up to me to stop this cycle before it goes on to another generation.”\n “And you’re going to do it by marrying Rafe off to Hannah?”\n “If I can.” Mitchell paused to take another swallow of coffee. “But before I can see about getting Rafe to the altar, I’ve got to help him and Hannah fix another little problem that’s come up.”\n “What’s that?”\n Mitchell looked at her. “Rafe has convinced himself that someone may have tried to kill Hannah and her dog a couple of nights ago.”\n Bev’s shock left her mouth hanging open for a few seconds.\n “Are you serious?” she finally managed.\n “On the surface, it looks like some bastard tried to drown her dog, but Rafe thinks it may have been an attempt to get Hannah, too. He’s sure it’s got some tie back to what happened to Kaitlin Sadler.”\n “But that’s ridiculous,” Bev sputtered. “Kaitlin’s death was an accident. Everyone knows that. And if it had been something worse, heaven forbid, why would the killer make a move against Hannah now?”\n “Ever since Rafe and Hannah returned to Eclipse Bay to sort out the business with Dreamscape, there’s been talk. Some of it is about the fact that they’re carrying on together, naturally. But some of it is about the past. Rafe and Hannah have started asking questions themselves, and now, what with the incident involving the mutt, they’re beginning to dig a little deeper.” Mitchell met her gaze. “To tell you the truth, I’m afraid they just might uncover some old bones that would probably be better off left buried.”\n “But Rafe, being Rafe, won’t listen to your advice to leave well enough alone, is that it?”\n Mitchell shrugged. “He never did listen.”\n “So you’ve decided to help him look into the matter?”\n “That’s about the size of it.”\n Bev studied him for a long moment. Then she gave him a knowing smile. “You’re enjoying yourself, aren’t you? I think you like the idea of playing Dr. Watson to Rafe’s Sherlock Holmes.”\n “Be the first thing Rafe and I have done together since he was a kid.” Mitchell was aware of an oddly wistful feeling. “We got along pretty good for a few years after he and Gabe came to live with me. But from the day Rafe hit his mid-teens, he and I locked horns. It’s been a little better in the past few years, but it’s like we’re walking on eggshells. Doesn’t take much for either one of us to set the other off. My fault, I reckon.”\n “Don’t be too hard on yourself, Mitch. You did all right by your grandsons. Sinclair wasn’t much of a father to his boys.”\n Mitchell gripped the mug hard. “That’s because he had me for an example.”\n “The point is that after your son’s death, you stepped in and did what you had to do. You stopped your running around—”\n “Well—”\n Bev chuckled. “All right, let’s just say you cut way down on your running around. You paid attention to the job of raising Rafe and Gabe, and neither one of them has screwed up his life. I’d say you did okay.”\n Bev always had a way of making him feel better about things, Mitchell thought. She had a way of giving him a slightly different perspective.\n “Let’s get back to the reason you’re here.” Bev put her coffee aside and sat forward. “You say you want to help Rafe find out what really happened to the Sadler woman. But what if there isn’t any conspiracy to uncover? What if Chief Yates was right about her death being an accident?”\n Mitchell shook his head. “I started into this thinking that Rafe and Hannah were going off the deep end. But now I’m not so sure. Bev, you knew everything that Ed knew about the goings-on in Eclipse Bay, and Ed knew a hell of a lot. If I said that there’s a possibility that Kaitlin Sadler might have been having an affair with someone who wanted to keep it a big, dark secret, do any names come to mind?”\n “Kaitlin got involved with more than one married man.” Bev made a face. “She was not very popular with the ladies of Eclipse Bay, I can tell you that.”\n “How about if I throw in some dirty movies and some female underwear in a man’s size? Does that narrow the list a bit?”\n Bev angled her chin. “Hmm,” she said thoughtfully.\n Mitchell waited.\n “Unfortunately,” Bev said slowly, “there is one name that does come to mind. Ed once told me about some rumors he’d heard shortly before Kaitlin’s death. Naturally he ignored them. Ed was an old-fashioned kind of journalist. Unlike this modern bunch, he didn’t believe in printing the details of people’s sex lives on the front page of a family newspaper.”\n Mitchell could feel himself getting revved up. This investigating business was fun. He was starting to understand why Rafe was so eager to poke a stick into this particular varmint hole. “Can I have the name of this guy Ed didn’t want to put on the front page?”\n Bev hesitated. “I’ll give it to you, but it won’t do you any good. He has an ironclad alibi for that night.” \n","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-64.html","bookId":1795,"book":{"id":1795,"title":"Eclipse Bay (Eclipse Bay #1)","description":"Storyline: \n Eclipse Bay has grown and flourished on the rugged Oregon coast, where the shore can be rocky and forbidding, full of sharp cliffs and hidden coves. In Eclipse Bay by Jayne Ann Krentz, this small town is also filled with secrets as treacherous as the landscape and rivalries as fierce as an ocean storm. \n Their grandfathers hated each other. \n Their fathers hated each other. \n And as the next generation of the Hartes and Madisons, Hannah and Rafe are expected to hate each other too. But Hannah Harte, a successful wedding consultant with a skeptical view of marriage, remembers the long-ago night on the beach that revealed Rafe as much more than just \"that disreputable Madison boy.\" And Rafe remembers the heroic gesture that proved Hannah\u0027s fierce spirit was stronger than any feud and saved him from near-certain imprisonment. \n Now reunited by a surprising inheritance after years of living their separate lives, Rafe and Hannah return to Eclipse Bay, and the hostilities that still divide, and bind, their families. And they are discovering something that is at once delightful and deeply disturbing ... \n They don\u0027t hate each other. Not at all.\n \n","cover":"https://allnovel.net/images/eclipse-bay-eclipse-bay-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/eclipse-bay-eclipse-bay-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:17:38 PM"}}
