{"id":79757,"no":69,"title":"Page 69","content":"Hannah turned to Rafe. “Got any more bright ideas?”\\n\\n “Let me think.” He rubbed the back of his neck. “Jed Steadman mentioned that he might be able to dig up an institute guest list for that night.”\\n\\n “Checking the whereabouts of everyone on the list for that two-hour window would take days and days of work,” Hannah said. “Even assuming it could be done at all. And we couldn’t ever be sure of the accuracy. Like Arizona said, it’s been eight years. No one’s going to recall many details.”\\n\\n Rafe studied the large topographic map of Eclipse Bay and the surrounding vicinity that was laminated to the surface of the war room table. “Jed might be able to help us out there, too. He covered the reception. He might still have his notes.”\\n\\n Hannah thought about that approach and shook her head. “He might have some old notes regarding the most newsworthy people in attendance. But he certainly wouldn’t have kept tabs on everyone in the crowd.”\\n\\n “If we’re right, we’re looking for someone who may have been newsworthy, or at the very least, attached to the Thornley campaign.” Rafe rose from his chair. “It’s just barely possible Jed will be able to help us. Worth a try.”\\n\\n “Well, it’s not like we have anything else to go on.” Hannah started to rise. “Without Arizona’s log for that night—”\\n\\n “Didn’t say there wasn’t a log for that night,” Arizona drawled.\\n\\n Halfway to her feet, Hannah paused. “What?”\\n\\n Rafe planted both hands on the laminated map and leaned across the table. “A.Z. ? You told us that log was missing from your file.”\\n\\n A deep, hoarse chuckle rumbled through Arizona. “The original was stolen, like I told you.”\\n\\n “Original?” Rafe waited.\\n\\n “I didn’t just fall off the turnip truck,” Arizona said with cool satisfaction. “I’ve been in this business a long time. First thing I do when I get back from a recon job is make a copy of my log.”\\n\\n Rafe started to grin. “I should have guessed.”\\n\\n Hannah felt a small flicker of hope. “Where’s the copy of your missing log, Arizona?”\\n\\n “Hidden in the bunker along with all the other copies.” Arizona glanced at the massive multifunctional steel watch on her wrist. “Take a couple of hours to drive to the site, dig out the log, and get back to town. What d’ya say we meet up out at Dreamscape at 1100 hours?”\\n\\n “We’ll be waiting.” Rafe straightened. “Thanks, A.Z. I really appreciate this.”\\n\\n “Sure. Any time.” Arizona gripped the arms of her desk chair and shoved herself to her feet. “Just glad to see some folks from around here finally start paying attention to what’s going on up there at the institute.”\\n\\n “Innocent dupes of the world, arise,” Hannah murmured. “You have nothing to lose but your innocence.”\\n\\n Rafe took her arm and headed toward the door. “We’ll keep you informed of everything we discover, A.Z.”\\n\\n “You do that.” Arizona hesitated, concern furrowing her forehead. “And you two take care, hear? You’re tangling with the institute crowd now. That means you’re dealing with some ruthless types. Someone up there ordered the Sadler’s girl’s death to cover up something. Whoever did it might be willing to kill again.”\\n\\n A chill went through Hannah. She cleared her throat. “Well, on that cheerful note—”\\n\\n “By the way,” Arizona interrupted rather casually, “how long are you two gonna shack up together out there at Dreamscape?”\\n\\n Anger surged, temporarily submerging the little thrill of dread Hannah had felt a few seconds ago. She jerked to a halt, spun around, and glared at Arizona.\\n\\n “We are not shacking up.”\\n\\n Rafe tightened his grip on her arm. “Hannah, this isn’t the time to go into it.”\\n\\n “The heck it isn’t.” Hannah grabbed the edge of the door as Rafe tried to haul her forcibly out into the hall. “I want to set the record straight before we leave. Listen, Arizona, Rafe and I are sharing Dreamscape until we negotiate a way out of the mess Isabel left us in. We are not shacking up there.”\\n\\n “Sorta hard to tell the difference,” Arizona answered through a cloud of smoke.\\n\\n “Not from where I stand,” Hannah retorted. “We’re sleeping on separate floors.”\\n\\n “Sounds uncomfortable,” Arizona said.\\n\\n Hannah was a bundle of simmering outrage. Rafe could feel her vibrating on the seat beside him. Winston had draped himself over the back of the seat and licked her ear repeatedly in an effort to console her, but she refused to be restored to a more reasonable mood.\\n\\n Rafe tried distraction first.\\n\\n “A.Z.’s got a strange view of the world, but she doesn’t make things up out of thin air,” he said. “She thinks that logbook was stolen. I’m inclined to believe her.”\\n\\n “It’s been eight years. She probably misplaced it.”\\n\\n “Not A.Z. She’s one well-organized conspiracy theorist. Trust me.” He downshifted as he drove past the pier. “Makes you wonder, doesn’t it?”\\n\\n “I’ll say it does. It was bad enough when people suspected that we were having an affair. But now the whole town apparently thinks that we’re living together openly out there at Dreamscape.”\\n\\n “We are. Sort of.”\\n\\n “Doesn’t it bother you?”\\n\\n “Well, no, not really. Hannah, I’m trying to hold a rational conversation here. We were discussing the missing logbook, if you will recall.”\\n\\n “It bothers me. I realize that you Madisons are accustomed to being gossiped about here in Eclipse Bay. But we Hartes try to avoid being the subject of idle rumors and speculation.”\\n\\n She was tight and wired, Rafe realized. Her arms were crossed beneath her br**sts. Her face was pinched with irritation.\\n\\n “People have been talking about us since the day we arrived,” he said evenly. “It didn’t seem to bother you so much at first. Why are you going ballistic now?”\\n\\n “I’m getting tired of it.” She looked out at the bay. “I thought everything would be settled by now. It all seemed so simple back at the beginning. I would buy out your share of Dreamscape and start work on my inn. But things just keep getting more complicated.”\\n\\n “By ‘things,’ ” he said carefully, “I assume you are talking about our relationship, not the possibility that we may have awakened a sleeping murderer?” \\n\\n","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-69.html","bookId":1795,"book":{"id":1795,"title":"Eclipse Bay (Eclipse Bay #1)","description":"Storyline: Eclipse Bay has grown and flourished on the rugged Oregon coast, where the shore can be rocky and forbidding, full of sharp cliffs and hidden coves. In Eclipse Bay by Jayne Ann Krentz, this small town is also filled with secrets as treacherous as the landscape and rivalries as fierce as an ocean storm. \\n Their grandfathers hated each other. \\n Their fathers hated each other. \\n And as the next generation of the Hartes and Madisons, Hannah and Rafe are expected to hate each other too. But Hannah Harte, a successful wedding consultant with a skeptical view of marriage, remembers the long-ago night on the beach that revealed Rafe as much more than just \"that disreputable Madison boy.\" And Rafe remembers the heroic gesture that proved Hannah\u0027s fierce spirit was stronger than any feud and saved him from near-certain imprisonment. \\n Now reunited by a surprising inheritance after years of living their separate lives, Rafe and Hannah return to Eclipse Bay, and the hostilities that still divide, and bind, their families. And they are discovering something that is at once delightful and deeply disturbing ... \\n They don\u0027t hate each other. Not at all.\\n","cover":"https://allnovel.net/images/eclipse-bay-eclipse-bay-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/eclipse-bay-eclipse-bay-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:17:38 PM"}}
