{"id":14069,"no":32,"title":"CHAPTER XXXI MYSTICISM, PRAYER, CONVERSION, AND METAPHYSICS","content":"The psychology of mysticism and conversion is a fascinating subject. This is not the place to go into detail or even adequately cover the subject which is as extensive as it is important. I can only touch the matter in a superficial way—enough to answer the present purpose. \\n\\n \\n\\n The state of mysticism is essentially a hypnoidal trance state, and its traits are the characteristics of the hypnoidal consciousness. Like the hypnoidal state, that of the mystic state may pass into waking, sleep, or into the hypnotic condition. \\n\\n \\n\\n James marks off mystic states, by the traits of Ineffability, Transciency, Passivity, and Noetic Quality. These traits are just the ones found in the deeper states of the hypnoidal consciousness, especially the ones which approximate and pass into the hypnotic condition. In the mystical state, as in the hypnoidal state, there is a delicious languor, a lack of tension to the stimulation of the external environment which retreats in the distance; there is[313] the instability of the hypnoidal consciousness which soon passes into the other forms such as sleep, hypnosis, or waking. There is also present the refreshing, invigorating condition of the whole individuality on emerging from those peculiar subconscious states. The lethargic and cataleptic states often present in states of ecstasy, in which the mystics fall, depend entirely on states of the hypnoido-hypnotic trance. \\n\\n \\n\\n The mystic consciousness and the hypnoidal one are not identical. The mystic consciousness is a species of the hypnoidal consciousness. What are then its special features? In the first place, the mystic consciousness has a negative and a positive aspect, depression and exaltation. In the second place, mysticism expresses a definite reaction of the individual to the conditions of his external environment. This reaction is one of retraction from the miseries and fears of life. \\n\\n \\n\\n If we examine closely the type of consciousness characteristic of the state preceding the onset of the mystic condition, we find that it is essentially that of suffering, of misery, of disappointment, of despair, of inability to meet fairly, squarely, and courageously the experiences of life. There is a strong feeling of insecurity, a feeling of anxiety as to self and the world. A feeling of intense anguish seizes on the individual that he and the world are going to perdition, that on such terms life is not worth living. The instinct of fear penetrates every[314] pore of his being, and inspires the individual with dread, horror, and terror. Terrorized by the wild evils of life, the personality becomes benumbed and paralyzed, and ready to succumb. This state of intense depression is not simply related to fear, it is fear. It is the status melancholicus often preceding states of exaltation. The individual reaches a critical condition where life becomes impossible. The whole universe holds for him nothing but terrors and horrors. \\n\\n \\n\\n Carlyle expresses this attitude when he makes Teufeldroeckh say: “I live in a continual, indefinite, pining fear; tremulous, pusillanimous, apprehensive of I know not what: it seems as if things, all things in the heavens above and the earth beneath would hurt me; as if the heavens and the earth were but boundless jaws of a devouring monster, wherein I, palpitating, lie waiting to be devoured.” \\n\\n \\n\\n In this state of agony of fear, the individual looks for salvation in fleeing from the terrors of the world to the arms of the divinity. \\n\\n \\n\\n In his terror the individual passes through a second stage, he becomes “converted,” he turns with prayers to the divine power to which he looks for shelter from the dangers of life. He appeals to the divinity for protection from the evils of the day and from the terrors of the night. This second stage is often preceded by a period of subconscious incubation which sometimes gives rise to sudden conscious[315] explosions, conscious conversions, or sudden onset of mystic state of ecstasy. \\n\\n \\n\\n In the library of Ashburbanipal, king of Assyria, there are found “penitential psalms” much alike to our own, but some millenniums older than the Biblical psalms. These Assyro-Babylonian penitential psalms, inscribed in cuneiform script on clay tablets, clearly express the attitude of the worshipper or suppliant: \\n\\n \\n\\n “O Goddess, in the anguish of my heart have I raised cries of anguish to thee; declare forgiveness. \\n\\n \\n\\n May thy heart be at rest. \\n\\n \\n\\n May thy liver be pacified. \\n\\n \\n\\n The sin which I have committed I know not. \\n\\n \\n\\n The Lord in the anger of his heart hath looked upon me. \\n\\n \\n\\n The goddess hath become angry and hath stricken me grievously. \\n\\n \\n\\n I sought for help, but no one taketh my hand. \\n\\n \\n\\n I wept, but no one cometh to my side. \\n\\n \\n\\n I utter cries, but no one harkens to me. \\n\\n \\n\\n I am afflicted, I am overcome. \\n\\n \\n\\n Unto my merciful god I turn. \\n\\n \\n\\n I kiss the feet of my goddess. \\n\\n \\n\\n How long, known and unknown god, until the anger of thy heart be pacified? \\n\\n \\n\\n How long, known and unknown goddess, until thy unfriendly heart be pacified? \\n\\n \\n\\n Mankind is perverted, and has no judgment, \\n\\n \\n\\n Of all men who are alive, who knows anything? \\n\\n \\n\\n They do not know whether they do good or evil. \\n\\n \\n\\n O Lord, do not cast aside thy servant! \\n\\n \\n\\n He is cast into the mire; take his hand. \\n\\n \\n\\n The sin which I have sinned turn to mercy! \\n\\n [316] \\n\\n \\n\\n Known and unknown goddess, my sins are seven times seven; \\n\\n \\n\\n Forgive my sins! \\n\\n \\n\\n Forgive my sins, and I will humble myself before thee. \\n\\n \\n\\n May thy heart, as the heart of a mother who hath borne children, be glad! \\n\\n \\n\\n As a father who hath begotten them, may it be glad!” \\n\\n \\n\\n In this respect we agree with Ribot. “Depression,” says Ribot, “is related to fear.... Does not the worshipper entering a venerated sanctuary show all the symptoms of pallor, trembling, cold sweat, inability to speak—all that the ancients so justly called sacer horror? The self abasement, the humility of the worshipper before the deity supposed to be possessed of magic power, is essentially one of fear.” With the anthropologist we may refer this awe or fear to the terror which the savage mind feels in the presence of the magician, the witch, the medicine man, the man-god, and the woman-deity. \\n\\n \\n\\n The Mithraic religion, which for some time has been the great rival of Christianity for the salvation of the individual from the terrors of the world, played a great r?le in the mystic ceremonies of the cult. In fact, the dying and the resurrection of a god-man for the salvation of the worshippers constituted a cardinal principle in the actual practices or rites of barbarous nations and savage tribes. The man-god or woman-deity had to die, had to be[317] sacrificed by the community. The sins of the savages were redeemed by the divine flesh and blood of “the man-god.” \\n\\n \\n\\n In describing the life and theological doctrines of St. Paul, Professor Pfleiderer says: “Perhaps Paul was influenced by the popular idea of the god who dies and returns to life, dominant at that time in the Adonis, Attis, and Osiris cults of Hither Asia (with various names and customs, everywhere much alike). At Antioch, the Syrian capital, in which Paul had been active for a considerable period, the main celebration of the Adonis feast took place in the spring time. On the first day, the death of ‘Adonis,’ the Lord, was celebrated, while on the following day, amid the wild songs of lamentations sung by the women, the burial of his corpse (represented by an image) was enacted. On the next day (in the Osiris celebration it was the third day after death, while in the Attis celebration it was the fourth day) proclamation was made that the god lived and he (his image) was made to rise in the air. It is noteworthy that the Greek Church has preserved a similar ceremony in its Easter celebration down to our own day. \\n\\n \\n\\n “During the joyous feast of the resurrection of the god in the closely related Attis celebration, the priest anointed the mouths of the mourners with oil, and repeated the formula: \\n\\n \\n\\n [318] \\n\\n \\n\\n ‘Good cheer, ye pious! As our god is saved, \\n\\n \\n\\n So shall we, too, be saved in our distress.’ \\n\\n \\n\\n “The rescue of the god from death is the guarantee of a like rescue for the adherents of his cult. In the mysteries of Attis, Isis, and Mithra, the fact that the worshippers partook of the god’s life by the mystical participation in his death, was visualized by such rites, which employed symbols showing the death of the initiate, his descent into Hades, and his return. Hence, this ceremony was called the ‘re-birth to a career of new salvation,’ a ‘holy birthday.’ In one Mithra liturgy, the newly initiated pray: ‘Lord, reborn, I depart; in that I am lifted up, I die; born by that birth which produces life, I will be saved in death, and go the way which thou hast established, according to thy law and the sacrament which thou hast created.’” \\n\\n \\n\\n In all those mysteries the central note is the salvation of the worshipper from the “perils of the soul.” \\n\\n \\n\\n In some cases the terrorized individual is driven to the mystic state. He falls into a sort of trance. The world of fears becomes veiled from him, and recedes in a mist, and even completely disappears from his view. He finds repose in his god. This is the positive stage of mental exaltation, of ecstasy; it figures as “the union” of the worshipper with his god or goddess. It is this oblivion in the depths of[319] the hypnoidal and the hypnotic states, it is this relapse into the regions of the subconscious that brings about relief from all fears of life. The bliss felt in these dim regions of mental life refreshes and invigorates the wearied soul. The coming in contact with new vast stores of subconscious reserve energy may once more vitalize and supply with new energy the fear stricken personality. This is the inspiration of those who have experienced the mystical power of “conversion.” \\n\\n \\n\\n In a later chapter I take up the subject of subconscious reserve energy advanced by James and myself, independently. Meanwhile, we may say that the phenomena of prayer, conversion, and especially of mysticism belong fundamentally to the manifestations of self-preservation and the fear instinct on the one side and to subconscious reserve energy on the other. \\n\\n \\n\\n Of course, we must add the fact that certain historical and social conditions are apt to give rise to phenomena of mysticism, the conditions of social unrest being especially favorable. When social life begins to decay, when the protection of society is weakened, and the individual is set loose, and left to stand alone, something that especially terrorizes the social brute, then nothing is left to the individual bereft of his social stays and social stimulants, but to turn inward and upward, that is to turn mystic. In his states of desolation and fear-obsession the[320] individual is inclined to turn to the stimulating, narcotizing influence of the deity which puts the soul in a state of transcendental bliss, thus hiding the terrorized soul in a misty and mystic cloud, so that he no longer sees the terrors and horrors of life. \\n\\n \\n\\n Such mystic states are found in periods of social and moral decay. Instance the decaying Roman empire, the Hellenistic period, the Middle Ages, and in fact, any period in which security, safety, and social stability are on the ebb, while fears and perils are on the increase. Mysticism, Salvation of the soul, under all their guises, are interrelated with the primordial fear instinct which dominates the hunted beast and the terror-stricken neurotic patient. \\n\\n \\n\\n If we turn to philosophical and metaphysical speculations, we find, on examination from a pragmatic point of view, that their essential differences revolve on the security and safety of the world scheme. From Plato and Aristotle to Seneca, Epictetus, Marcus Aurelius, down to Schopenhauer, Hegel, and our American thinkers Royce and James, as well as from the Bible to Brahmanism and Buddhism, we find the same valuation of world safety, based on the vital impulse of self-preservation and its fundamental fear instinct. The Salvation of the World and the Individual is the fundamental keynote of theological metaphysics and metaphysical religion. \\n\\n \\n\\n Professor Royce, the representative of transcendental,[321] monistic idealism in America, thus summarizes his philosophical and religious attitude: “It is God’s true and eternal triumph that speaks to us ‘In this world ye shall have tribulations. But fear not; I have overcome the world.’” This reminds one of the ancient Assyrian cuneiform oracles addressed to the Assyrian kings: “To Esarhaddon, king of countries, Fear not! I am Ishtar of Arbela. Thine enemies I will cut off, fear not!” “Fear not, Esarhaddon, I, Bel, am speaking with thee. The beams of thy heart I will support.” “Fear not, you are saved by Faith. Fear thy Lord only, He is your Rock and Salvation,” says the Bible. “Fear not!” teaches the Buddhist, “Nirvana, the Absolute, is your refuge.” \\n\\n \\n\\n Professor James in his inimitable way summarizes the difference between his pluralism and idealistic monism: “What do believers in the Absolute mean by saying that their belief affords them comfort? They mean that since in the Absolute finite evil is ‘overruled’ already, we may, therefore, whenever we wish, treat the temporal as if it were potentially the eternal, be sure that we can trust its outcome, and, without sin, dismiss our fear and drop the worry of our finite responsibility.... The universe is a system of which the individual members may relax their anxieties....” James contrasts his empirical, pragmatic pluralism with the idealistic monism. \\n\\n \\n\\n In another place James says: “Suppose that the[322] world’s author put the case before you before creating, saying: ‘I am going to make a world not certain to be saved, a world, the perfections of which shall be conditioned merely, the condition being that each several agent “does his level best.” I offer you the chance of taking part in such a world. Its safety, you see, is unwarranted. It is a real adventure, with real danger, yet it may win through.... Will you join the procession? Will you trust yourself and trust the other agents enough to face the risk?’ Should you in all seriousness, if participation in such a world were proposed to you, feel bound to reject it as not safe enough? Would you say that rather than be part and parcel of so fundamentally pluralistic and irrational a universe, you preferred to relapse into the slumber of nonentity from which you had been aroused by the tempter’s voice? \\n\\n \\n\\n “Of course, if you are normally constituted, you would do nothing of the sort. There is a healthy-minded buoyancy in most of us which such a universe would exactly fit.... The world proposed would seem ‘rational’ to us in the most living way. \\n\\n \\n\\n “Most of us, I say, would, therefore, welcome the proposition, and add our fiat to the fiat of the creator. Yet perhaps some would not; for there are morbid minds in every human collection, and to them the prospect of a universe with only a fighting chance of safety would probably not appeal. There are moments of discouragement in us all, when we[323] are sick of self, and tired of vainly striving. Our own life breaks down, and we fall into the attitude of the prodigal son. We mistrust the chance of things. We want a universe where we can just give up, fall on our father’s neck, and be absorbed into the absolute life as a drop of water melts into the river or the sea. \\n\\n \\n\\n “The peace and rest, the security desiderated at such moments is security against the bewildering accidents of so much finite experience. \\n\\n \\n\\n “Nirvana means safety from this everlasting round of adventure of which the world of sense consists. The Hindoo and the Buddhist, for this is essentially their attitude, are simply afraid, afraid (my italics) of more experience, afraid of life.... \\n\\n \\n\\n “Pluralistic moralism simply makes their teeth chatter, it refrigerates the very heart within their breast.” \\n\\n \\n\\n Thus we find that at the bottom of philosophical, metaphysical, and religious speculations there are present the same primitive impulse of self-preservation and fear instinct. \\n\\n \\n\\n While there are some other important factors in that theological and metaphysical problem which has agitated humanity for ages, a problem which I expect to discuss some other time in another place, there is no doubt that James with his great psychological genius has laid his finger on fundamental factors of human life,—self-preservation and the fear instinct. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2061/58693.html","bookId":537,"book":{"id":537,"title":"Nervous Ills","description":"简介： In this volume I give a brief, popular account of some of my work in Psychopathology, or Abnormal Psychology for the last quarter of a century. I do not refer to my work on psychopathic reflexes, moment-consciousness, moment-thresholds, multiple pers...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2061","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
