{"id":21410,"no":10,"title":"Chapter 10","content":"\\n\\n The interim between the death of Peter\u0027s father and Peter\u0027s ascent into Oxford was filled with small events which impertinently buzzed about him. Even his father\u0027s funeral left no deep impression. It was formal and necessary. Peter was haunted, as the ceremony dragged on, with a reproachful sense that he was not, as he should, responding to its solemnity. Passion, of love or grief or adoration, came to Peter by inspiration. He could not punctually answer. He marvelled how easily at the graveside the tears of his friends and neighbours were able to flow. He himself had buried his father upon the night of his father\u0027s death, and had started life anew. The funeral was for him no more than the ghost of a dead event. \\n\\n \\n\\n Next came the removal of Mrs. Paragon into the well-appointed house of Uncle Henry. Henry had arranged that henceforth his sister should live with him; that Peter should look to him as a guardian, and think of himself as his uncle\u0027s inheritor. All these new arrangements passed high over Peter\u0027s head. They were a background of rumour and confusion to days of exquisite sensibility and peace. Only one thing really mattered. Uncle Henry\u0027s house was in the fashionable road that ran parallel to that in which Peter was born,[Pg 65] so that Peter could reach Miranda by way of the garden, which met hers at the wall\u0027s end. \\n\\n \\n\\n Adolescence carried him high and far, winging his fancy, giving to the world forms and colours he had never yet perceived. His passion, unaware of its physical texture, had almost disembodied him. Miranda focussed the rays of his soul, and drew his energy to a point. He was pure air and fire. Standing on the high balcony of his new room, he felt that, were he to leap down, he must float like gossamer. Or, as he lay in the grass beside Miranda, staring almost into the eye of the sun, he acknowledged a kinship with the passing birds, imagined that he heard the sap of the green world ebb and flow; or, pressing his cheeks to the cool earth, he would seem to feel it spinning enormously through space. \\n\\n \\n\\n They talked hardly at all, and then it was of some small intrusion into their happy silence—the chatter of a bird in distress or the ragged flying of a painted moth. Only seldom did Peter turn to assure himself that Miranda was still beside him. He was absorbed with his own vast content and gratitude for the warm and lovely world, his precious agony of aspiration towards the inexpressible, his sense of immense, unmeasured power. Miranda was his precious symbol. Uttered in her, for his intimate contemplation, he spelled the message with which the air was burdened, which shivered on the vibrating leaves, and burned in the summer heat. When, after long[Pg 66] gazing into blue distances of air, he turned to find Miranda, it seemed that the blue had broken and yielded its secret. \\n\\n \\n\\n From the balcony of his room at night he saw things so lovely that he stood for long moments still, as though he listened. The trees, massed solemnly together, waited sentiently to be stirred. The stars drew him into the deep. Voices broke from the street. Light shining from far windows, and the smoke of chimneys fantastically grouped, filled him with a sense of pulsing, intimate life; a world of energy whose stillness was the measure of its power, the slumber of a bee\u0027s wing. \\n\\n \\n\\n One of the far lighted windows belonged to Miranda. He was content to know she was there, and recalled, clear in his mind\u0027s eye, the lines and gestures of her face. The beauty he saw there had seemed almost to break his heart. It wavered upon him alternate with the stars and the dark trees of the garden. Loveliness and a perpetual riddle delicately lurked in the corners of her mouth. Sometimes, when they were together, he would lay his finger very softly on Miranda\u0027s lips. \\n\\n \\n\\n He rarely kissed her. The flutter of his pulse died under an ecstasy bodiless as his passion for the painted sky. He did not yet love the girl who sometimes with a curious ferocity flung her arms about him and crushed his face against her shabby dress. Rather he loved the beauty of the world and his inspired ability, through her, to embrace it. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2063/58741.html","bookId":535,"book":{"id":535,"title":"Peter Paragon","description":"简介： Peter might justly have complained that his birth was too calmly received. For Peter\u0027s mother accepted him without demur. Women who nurse themselves more thoroughly than they nurse their babies will incredulously hear that Mrs. Paragon made little di...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2063","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
