{"id":21417,"no":17,"title":"Chapter 17","content":"Peter spent the vacation at home solidly reading and digesting without enthusiasm the Oxford books. He soon heard from his friends that the Junior Prior had vanished, and that he himself would be invited to return. He spent his days regularly between classical literature for a task and modern literature for pleasure. \\n\\n \\n\\n Mrs. Paragon gravely listened to Peter\u0027s story of his indiscipline. She did not, of course, find it in any way ridiculous. She brooded upon it as evidence of Peter\u0027s abounding life, and she instinctively trembled. Peter\u0027s energy was beginning to be dangerous. \\n\\n \\n\\n Peter\u0027s uncle flung up his great head and laughed. He made Peter, to Peter\u0027s rage, recur to the story again and again, asking for unspeakable details. His red face shone and twinkled. He roared with delight. \\n\\n \\n\\n In the middle of the vacation the author who first had stirred Peter to intellectual enthusiasm came to Hamingburgh, and talked Socialism to a local branch of the Superior Socialists. Peter was wrought to so high an admiration of the art with which the great man handled his audience, by the clarity, vigour, and wit of his speaking, that he dared at the end to ask publicly some very pertinent and searching questions. The speaker could[Pg 115] not answer him immediately; but afterwards promised to write to Peter if Peter would remind him. \\n\\n \\n\\n Peter thus became one of the fortunate correspondents of an author whose private letters were better than his published works. Before he returned to Oxford he already had a small pile, thumbed with continuous reading. \\n\\n \\n\\n Peter acquitted himself reasonably to the satisfaction of his masters when he returned to Gamaliel. He wrote without vigour or interest, but his grim industry saved him from absolute failure. All through the term he stuck hard at the necessary books, and trained hard for the summer eights. His spare energy now went into socialist oratory, blue books, and public speaking. He made sudden appearances at the Oxford union, cutting into the debates with ferocious contempt for the politics there discussed. To Peter the world was very wrong, and it seemed easy to put it right. He denounced the imbecility of the party game—played in the midst of so much urgently calling to be done. He drowned his audiences in terrible figures and unanswerable economy. He extirpated landlords and destroyed wagery. He abolished the oldest profession in the world as accidental to a society badly run. Peter became famous as an orator. It was confidently said that next term he would be given a place on the Committee of the union. One evening he was taken by the Proctors, prophesying from a cart in the Broad. He was[Pg 116] fined, ostensibly for appearing ungowned in the streets at an unlawful hour. \\n\\n \\n\\n Peter\u0027s access of political fervour was aggravated this term by an unfortunate accident. He sprained a tendon of his leg, and had to drop out of the boat a few days before the races. The effect of this physical relaxation was to increase his energy for discontent. For several blissful days he lay upon his back in a punt upon the Char, happy to be lazy, to breathe the heavy scent of hawthorn, to be rocked by noises of water and of voices over the water. Then he began to dream; and blue books marched in the avenues of his brain, mocking the elaborate idleness of the afternoon. The week itself of the races forced once again upon his imagination the contrasts he had seen in London. The merry pageant of the river, brilliant with summer dresses; the pleasant evening parties at the Old Mitre where his mother and uncle were staying; everywhere an expensive and careless life accepted as normal—these things were bright against a dark background of neglect and oppression. Peter was now a very serious young man. \\n\\n \\n\\n His brooding at this time was only lightened during the summer week by the presence in Oxford of his mother and uncle. There was much to arrange and to observe. Peter had been afraid of his uncle. How would his uncle behave among the Oxford people? Peter was not really happy until he had dined very near Dundoon and his[Pg 117] party. The father of Dundoon was a nobleman with 10,000 acres of urban land. Yet, Peter cynically reflected, you could scarcely distinguish him from Uncle Henry. He, too, had a large red face, ate with more heartiness than delicacy, and talked in an accent entirely his own. Peter breathed more freely. Instinctively he began a peroration as to aristocracy true and false, with interpolated calculations as to the possible unearned increment upon 10,000 acres conveniently near London. \\n\\n \\n\\n Uncle Henry, of course, had to be shown exactly where the Junior Prior had fallen; and Peter had to stand by, embarrassed and fuming, while Uncle Henry rehearsed the scene in pantomime. \\n\\n \\n\\n Peter was proud and glad to see how rapidly his friends came to praise and admire his mother. They instinctively felt her strength and peace. They began at once to confide in her, though her answers were rarely of more than one syllable. Of all Peter\u0027s friends Lord Marbury liked her best. \\n\\n \\n\\n Marbury was at this time Peter\u0027s nearest friend at Gamaliel. Peter had met Marbury only this last term. He had one day sat next to a stranger at dinner. Finding the stranger to be a man of excellent intelligence Peter had begun vigorously to denounce the aristocracy of England. The stranger had mildly protested that English lords were rather more various in character than Peter supposed, and that perhaps they had a use in politics and society. Peter contested this, [Pg 118]overwhelming his new friend with facts, figures, arguments, and devices for buying out all the vested interests of the nobility at a reasonable figure. Two days after, at a college ceremony which required the men to answer to their names, Peter heard with distaste that a new title was being called. He looked contemptuously round, and to his dismay saw his new friend rise in answer. Marbury smiled pleasantly at Peter and chaffed him in the best of humour. \\n\\n \\n\\n The friendship rapidly grew. Marbury was all that a man of lively interest and fancy can be who has mixed from a boy with polite citizens of the world. He knew all that Peter had yet to learn; but Peter\u0027s world of ideas attracted him as a country unexplored. Peter less consciously drew towards Marbury as one who seemed, in all but purely intellectual things, unaccountably wise. He really felt the curb of Marbury\u0027s knowledge of things as they are, whereas Marbury delighted in Peter\u0027s enthusiasm for things as they should be. \\n\\n \\n\\n Marbury\u0027s charm for Peter rested, too, upon his ability to talk in a perfectly natural and unaffected way of intimate and simple things. Marbury at once declared his pleasure in Peter\u0027s mother. His own people had not come to Oxford for the races, and he devoted himself almost entirely to Mrs. Paragon. \\n\\n \\n\\n \"It\u0027s pleasant just to carry her mackintosh,\" he said to Peter one evening after they had come from the hotel. \\n\\n \\n\\n [Pg 119] \\n\\n \\n\\n \"I\u0027m glad you like her.\" \\n\\n \\n\\n \"Like her?\" protested Marbury. \"Don\u0027t be inadequate. She is simply wonderful.\" \\n\\n \\n\\n Peter asked himself how Marbury had discovered this. \\n\\n \\n\\n \"What have you been talking about all the evening?\" he inquired. \\n\\n \\n\\n \"I haven\u0027t the least idea. Mostly nonsense.\" \\n\\n \\n\\n \"Then how do you know she is wonderful?\" \\n\\n \\n\\n \"Peter,\" said Marbury, \"sometimes you annoy me. It\u0027s true that I haven\u0027t the least idea what your mother thinks about the English aristocracy or George Meredith. I simply know that your mother is wonderful.\" \\n\\n \\n\\n Peter leant eagerly forward: \\n\\n \\n\\n \"I understand how you feel.\" \\n\\n \\n\\n \"Good,\" jerked Marbury. \"I\u0027m glad you are not quite insensible.\" \\n\\n \\n\\n He looked reflectively at Peter, and continued: \\n\\n \\n\\n \"I am almost hopeful about you now that I\u0027ve met your mother. I cannot help feeling there must be some sanity in you somewhere. But where did you get all your nonsense?\" \\n\\n \\n\\n \"My father was shot down in the street,\" said Peter briefly. \\n\\n \\n\\n \"I\u0027m sorry,\" said Marbury after a pause. \"I did not know.\" \\n\\n \\n\\n The summer races were run to an end, and only three weeks of term remained. Peter, physically unemployed, accumulated stores of energy. He became insufferably violent in conversation, and[Pg 120] Marbury, after telling him to put his head in ice, said he would have no more to do with him till he no longer addressed his friends as if they were a public meeting. \\n\\n \\n\\n That Peter did not that term fly into flat rebellion was due to a lack of opportunity. For a similar reason he continued to get through another year between Oxford and Hamingburgh. His weeks at home with his mother were like deep pools of a stream between troubled reaches. At Oxford Marbury, with his imperturbable sanity and good humour, kept him a little in check. They were inseparable. Peter would not again go on the river. He bought a horse and rode with Marbury through the winter and spring in the country about Oxford, or sailed with him in the desolate river beyond Port Meadow. Meantime he gored at his books like an angry bull, was the favourite hot gospeller of the Oxford Socialists, and was elected Secretary of the union as an independent candidate—a fact recorded with misguided enthusiasm in the Labour press. Peter\u0027s first summer term was the model of the two which followed; and his second summer term might harmlessly have passed like the first had not Marbury been called away. Marbury was his uncle\u0027s heir, and his uncle was not expected to live through the year. Henceforth Marbury would have to spend most of his time upon his uncle\u0027s estate. Thus, in the singing month of May, and in his second year, Peter was left unbridled. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2063/58748.html","bookId":535,"book":{"id":535,"title":"Peter Paragon","description":"简介： Peter might justly have complained that his birth was too calmly received. For Peter\u0027s mother accepted him without demur. Women who nurse themselves more thoroughly than they nurse their babies will incredulously hear that Mrs. Paragon made little di...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2063","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
