{"id":21431,"no":31,"title":"Chapter 31","content":"Peter\u0027s appearance at Covent Garden precipitated in Wenderby an action upon whose brink he had stood for several weeks. He called upon Lady Mary in the morning and asked for her. She came into the room bravely affecting surprise. But too well she knew what was coming. \\n\\n \\n\\n \"Lord Wenderby,\" she began, \"this is wonderful.\" \\n\\n \\n\\n \"That I should come to see you?\" \\n\\n \\n\\n \"I read in the Times that a Cabinet was called for this morning. Surely you should be there.\" \\n\\n \\n\\n Wenderby shrugged his shoulders. \\n\\n \\n\\n \"The Cabinet,\" he said, \"will be happier as they are.\" \\n\\n \\n\\n \"You say that bitterly.\" \\n\\n \\n\\n \"It\u0027s bitter truth,\" he answered. \"I\u0027m in the wrong set.\" \\n\\n \\n\\n There was a short silence, and Lady Mary found it intolerable. \\n\\n \\n\\n \"Have you come just to grumble and go?\" she inquired at last. \\n\\n \\n\\n Wenderby paused a moment, as if looking for a way to open his mind; then he said abruptly: \\n\\n \\n\\n \"I\u0027m going to rat.\" \\n\\n \\n\\n \"To leave the Cabinet?\" Lady Mary exclaimed. She was now sincerely astonished. \\n\\n \\n\\n \"Perhaps,\" said Wenderby, looking at her [Pg 231]intently. \"It\u0027s in my mind. Politics are going to be very violent during these next years. All my friends are with the Opposition. My position will be dreary and difficult.\" \\n\\n \\n\\n Lady Mary began to see his drift, and was dismayed at the sudden sinking of her spirit. \\n\\n \\n\\n \"Why do you tell me this?\" she asked. \\n\\n \\n\\n \"I want you to help me,\" said Wenderby, and again he looked at her. \\n\\n \\n\\n \"How can that be?\" she protested, avoiding his eyes. \\n\\n \\n\\n \"I\u0027m not yet sure what I ought to do. I shall be giving up a great deal in leaving the Cabinet. I\u0027m the youngest minister with a platform following. In a few years I should be leading the Party.\" \\n\\n \\n\\n \"What would become of your principles?\" Lady Mary objected. \\n\\n \\n\\n \"They would suffer,\" he curtly replied. \"But I should do my best for them. At any rate, I should do less harm than any other conceivable head of a Liberal Cabinet.\" \\n\\n \\n\\n \"You would be a fraud,\" she flashed. \\n\\n \\n\\n \"Not without justification,\" he coolly answered. \\n\\n \\n\\n \"Sophistry.\" \\n\\n \\n\\n \"Not at all. Making the best of a bad business.\" \\n\\n \\n\\n Again there was silence. Wenderby found it difficult to come to the point. It was again Lady Mary who spoke. \\n\\n \\n\\n \"Have you come to me for advice?\" she asked. \\n\\n \\n\\n [Pg 232] \\n\\n \\n\\n \"Partly that.\" \\n\\n \\n\\n \"Then I advise you to follow your conscience,\" she said decisively. \\n\\n \\n\\n \"That is just the difficulty,\" he pleaded. \"My conscience is vague.\" \\n\\n \\n\\n \"It tells you to come over.\" \\n\\n \\n\\n Wenderby smiled. \"Naturally you say that. My desertion now would shake the Government. Perhaps we might even pull them down. There\u0027s a chance.\" \\n\\n \\n\\n \"Your duty is clear,\" she insisted. \\n\\n \\n\\n \"I do not think so,\" he objected. \"The Government may stand in spite of me. Then my moderating influence is destroyed. Is it my duty to put this uncertain thing to the proof?\" \\n\\n \\n\\n There was a short silence. Lady Mary saw Wenderby\u0027s logical trap closing about her. He bent eagerly towards her, and a pleading note came into his voice. Lady Mary could not deny that it pleasurably moved her to detect under the steel of his manner the suspense of entire sincerity. He utterly depended upon her answer. \\n\\n \\n\\n \"My conscience,\" he said, \"does not help me. I cannot balance the right and wrong of this business. I want a better reason. I want the best reason in the world. I want you to be my wife.\" \\n\\n \\n\\n Lady Mary did not move. Wenderby\u0027s sincerity saved him from the protest with which she had thought to meet it. Nearly a minute passed. \\n\\n \\n\\n \"You understand?\" said Wenderby at last. \\n\\n \\n\\n [Pg 233] \\n\\n \\n\\n \"I think I understand,\" she slowly answered, \"that this is not exactly what it seems.\" \\n\\n \\n\\n \"Does it seem so terrible?\" he pleaded. \"Consider it from my point of view.\" \\n\\n \\n\\n \"You say that, if I marry you, you will leave the Cabinet. That is my price.\" \\n\\n \\n\\n \"Obviously, if you consented to marry me, it would be my crowning motive for coming to your people. It is a natural consequence.\" \\n\\n \\n\\n \"It is my price,\" she insisted. \\n\\n \\n\\n \"You are brutal,\" he said in a low voice. \\n\\n \\n\\n Lady Mary flushed a little. \"You do not like my word. Shall we say inducement? You tell me you will leave the Cabinet, but you do not trouble to ask me whether I care for you.\" \\n\\n \\n\\n \"Is that necessary?\" said Wenderby, quite simply. \"I know you too well. You like me and trust me. I think you admire me a little. I am forty-seven. I do not urge you to passion. I have appealed to you as a woman who can weigh the things of youth against other things, more important perhaps, certainly more enduring. I have been candid with you.\" \\n\\n \\n\\n Lady Mary sighed. \\n\\n \\n\\n \"I wonder,\" she said, \"how many English girls have been talked to in this way?\" \\n\\n \\n\\n \"You are not just an English girl. You are Lord Haversham\u0027s sister.\" \\n\\n \\n\\n \"You mean,\" said Lady Mary sadly, \"that I have no right to be loved in the common way?\" \\n\\n \\n\\n Again there was a short silence. Wenderby[Pg 234] then rose, and put his hand upon Lady Mary\u0027s arm. He spoke now as one who loved her and understood. \\n\\n \\n\\n \"I know,\" he said, \"exactly what this choice means. I want you to be my wife, and I mean to use every argument to persuade you. But I am going to be quite frank. When you marry me you will be turning away from a great deal. But I will hold you very precious. We shall always be comrades. Can you do this? To me it seems a choice between marrying for yourself and marrying for all that we hold most dear. Realise what our marriage would mean. Already we have wealth and social leading. Soon we should have supreme political office. There is no really able man of my age on the Tory side. Our house would be the absolute fortress of all we hold precious in the country. There is no one in whom I could so confidently trust as you.\" \\n\\n \\n\\n Lady Mary looked steadily at this vision. She knew it could be realised. She measured the full stature of Wenderby, and answered the call of her own talent. At last she spoke, rather as though she wondered to herself than talked with another: \\n\\n \\n\\n \"But our marriage. What would our marriage be?\" \\n\\n \\n\\n \"Always entirely as you wished. I should wait for you still, and hope to win you. I should never put away that hope. But I should not take you for granted.\" \\n\\n \\n\\n \"I cannot do things by half,\" she said, bravely[Pg 235] meeting him. \"If I marry you, I shall accept all the consequences.\" \\n\\n \\n\\n Wenderby bent his head. \\n\\n \\n\\n \"You do not want to answer me now?\" he suggested. \\n\\n \\n\\n \"Come for my answer in twelve months.\" \\n\\n \\n\\n \"It is a long time.\" \\n\\n \\n\\n \"All my life hangs upon this decision. Twelve months is nothing at all.\" \\n\\n \\n\\n \"Meantime,\" said Wenderby, \"we meet as usual.\" \\n\\n \\n\\n \"Of course.\" \\n\\n \\n\\n \"You will tell no one of this?\" \\n\\n \\n\\n \"I reserve the right to tell my brother.\" \\n\\n \\n\\n Wenderby rose to go. He hesitated as they stood together. \\n\\n \\n\\n \"Mary,\" he said, \"I have talked coolly and sensibly. It was not easy. Try and believe that.\" His voice sank under the burden of his sincerity. \\n\\n \\n\\n \"I care with my whole soul,\" he added abruptly. \\n\\n \\n\\n She met his look with understanding and compassion. \\n\\n \\n\\n He took the hand Peter had touched and lifted it. She drew it impulsively away, giving him the other hand. \\n\\n \\n\\n \"A year from now,\" he said, and, kissing her fingers, went quickly from the room. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2063/58762.html","bookId":535,"book":{"id":535,"title":"Peter Paragon","description":"简介： Peter might justly have complained that his birth was too calmly received. For Peter\u0027s mother accepted him without demur. Women who nurse themselves more thoroughly than they nurse their babies will incredulously hear that Mrs. Paragon made little di...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2063","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
