{"id":82338,"no":7,"title":"Page 7","content":"REID ‘Ready?’ I ask her, and it won’t be the last time tonight I do so. We’re in a short line of cars waiting for the valet. Unhooking her seat belt, she takes a deep breath and squares her shoulders, as if she’s preparing for a challenging Olympic performance instead of a night out. Her huge brown eyes turn to me as she nods. ‘Ready.’ I suppress a laugh and lean to kiss her temple. ‘This will all be over soon, and we’ll be old news. I promise.’ These words have a fifty-fifty chance of becoming truth. Same chance of turning out to be entirely false … but I prefer to be optimistic about my promises. ‘Okay,’ she says, so very serious. And trusting. Which is why tonight, I chose one of the places celebrities go when we want to feel a bit like ordinary people – ordinary, wealthy people who don’t have to endure being photographed everywhere they go: Chateau Marmont. Paparazzi aren’t allowed into the long bricked drive, let alone up the steps or inside. Cameras are completely prohibited in the restaurant, in fact – and unlike some Hollywood spots, that decree is strictly enforced. Not that obsessive fans don’t ever break the rules and get away with it – but dinner on the patio is a dark, candlelit affair. Good luck getting off a perfect shot with a cell phone and no flash. The valet exchanges keys and a ticket with the driver in front of us and I slide my fingers down Dori’s arm, taking her hand. ‘Have you been here before?’ She laughs as though that’s the most ridiculous question ever posed. ‘Uh, no. I’ve heard about it, though. Does that count?’ ‘Hmm. I’ll allow half a point for knowledge of it. Sounds like we might need to schedule a weekend in the penthouse, though. Or maybe you’d prefer one of the cottages.’ She smiles up at me. ‘A cottage?’ Of course she’d be more intrigued by a creaky, cloistered 1930s bungalow than a sumptuous, high-ceilinged suite with patio views of Sunset and the West Hollywood hillside. ‘That sounds like a storybook suggestion. Should I bring my red hoodie and a picnic basket?’ ‘Only if you’re going to say, Oh, Reid, what a big –’ ‘Stop!’ she laughs, pressing her hand to my mouth. ‘Don’t you dare finish that thought!’ I run a finger over the curve of her ear, knowing it would be bright pink if I could discern the colour in the dim confines of the car. ‘I’m afraid it’s too late for that …’ Adorably prim, she purses her lips and changes the subject. ‘Staying at a hotel in the city where you live seems like an impractical thing to do, though I guess that’s normal for celebrities.’ ‘You’ve never done that?’ My last in-LA hotel stay was at Brooke’s insistence, when her whole convoluted plan to lure Graham away from Emma blew up in her face. Dori shrugs lightly, glancing forward as I pull up to the valet stand and remember that her high-school jerk of a boyfriend took her to a motel when she turned fifteen, and then dumped her a month later – when he turned eighteen and she became jailbait. I’d like to beat the shit out of that guy, even if it has been nearly four years. ‘Looks like I have a new goal: teach Dori to be impractical.’ She shakes her head, bemused. ‘I don’t know, Reid – that sounds like an unattainable goal.’ The valet opens her door and she starts before taking another deep breath and accepting his hand. She’s a bundle of nerves. I doubt she’s going to relax all evening, and God knows I probably won’t be able to talk her into loosening up the Reid Alexander way – with a shot of something old and expensive. ‘Challenge accepted, Dorcas Cantrell,’ I murmur, jumping out of my side of the car and coming around to encircle her shoulders and lead her inside. Challenge accepted. I order the chilled crab and avocado for an appetizer, and a bottle of Torrontés. Dori asks for a glass of water. At my nod, the waiter fetches a trendy bottled water, decanting and pouring it into her glass while maintaining a perfectly blank expression. Dori arches a brow and mouths impractical at me with a smirk. I smirk back. She has no idea what impractical things I can come up with where she’s concerned. By the end of the meal, she’s more relaxed. Despite the crush of people, the lush vegetation and flickering candles render the patio cosy and intimate instead of congested. There’ve been no camera flashes, of course, and no one’s paid us any particular attention, other than the waiting staff – all of them serving us with the same pleasant but impassive expressions. It won’t be this way in other LA haunts. At some point soon, Dori will be fully initiated into the public scrutiny that comes with being or dating a celebrity. She had a minor taste of it last summer, after the patio incident – but that was nothing. Not that I’m telling her that. John’s high-rise apartment is bursting at the seams by the time we arrive, which wasn’t exactly what we agreed on when he begged me to let him host Dori’s coming-out party. (Another thing I’m not telling her – that John and I devised the party specifically to introduce her to our crowd in a less public venue.) ‘Wow,’ Dori murmurs, leaning close. ‘Your friend has lots of friends.’ John doesn’t have friends as much as he has a network of useful acquaintances, and those acquaintances are all not-so-slyly eyeballing us the moment we hand our jackets to the girl at the door and begin to make our way through the crowd. I follow the sound of John’s laughter over the music, feeling Dori’s hand clamped to mine like our palms are permanently bonded. ‘Reid – hey, dude. Where’s –? Oh, there she is,’ he smiles, spotting her behind me. ‘Even smaller than I remembered.’ Dori has only the vaguest of memories of John, since their only meeting occurred during the most inebriated night of her life – if not the only inebriated night of her life. She smiles back at him, but her grip on my hand doesn’t loosen. I bend that arm behind her back so I can pull her closer. She may be curvy and strong, but John’s right, she feels small tucked to my side. ‘Hey, John. Lots of people here,’ I say pointedly. We’d agreed on twenty or so, and there’s easily two or three times that many wandering around his place and spilling on to the balcony. He shrugs and grins. ‘What can I say? I’m a popular guy.’ Snatching two champagne flutes from the bar’s countertop, he hands them to us. ‘Welcome, Dori. I hear you’ve made an honest man of my bro, here.’ I take one glass while Dori shakes her head infinitesimally. ‘Oh – I don’t –’ Deftly separating her from me, John smiles and leans close, pressing the glass into her hand. ‘Just hold it. You can sip it. Or not.’ His hand at her lower back, he says over his shoulder, ‘I’ll return her in a bit, dude. Maybe.’ His brows waggle and I glare at him. ‘John …’ My voice has an edge, but he’s set on ignoring me, damn him. Stopping at the first huddle of people, he asks, ‘Claude and Nichole – have you met Reid’s girlfriend? This is Dori. LA native, Cal undergrad, way too smart for him. I’m just waiting for her to wise up so I can swoop in.’ Eyebrows rise, eyes widen, and a couple of mouths fall open. I hear my name whispered, along with the repetition of the word girlfriend and speculations of Who is she? John is strategically blocking Dori’s view of a couple of girls whose eyes run over her, one whispering to the other, their joint scorn palpable. I’m pretty sure I’ve slept with at least one of them. Shit. The couple he addressed, though, smile and recover quickly. They’re both semi-working actors, each patiently awaiting a turn in the spotlight, and it’s standard John to keep his eye on up-and-comers like that. Just as he did with me. ‘Oh! Dori? So nice to meet you,’ Nichole says. ‘Thank you.’ Dori smiles, holding that glass of champagne like an ornamental shield. John’s still got her opposite arm tucked into the crook of his elbow. ‘I didn’t know Reid had a girlfriend,’ Claude says, addressing her with curiosity. ‘This is recent?’ ‘Not only recent, but virtually unprecedented,’ John answers, proud to be the one to divulge this newsflash. As he escorts her to the next group, she throws an amused glance over her shoulder, and I’m convinced she can handle just about anything. 6 BROOKE Kathryn offered to drive in and pick me up, but the flight is due to land close to midnight, and I have a downtown appointment at 9:00 a.m. There’s no reason to trek out to the sticks just to turn around in a few hours and come right back, in rush-hour traffic, no less. I set up car service and a hotel with an open-ended checkout instead – something my agent or manager would normally do, but I’m not even telling either of them I’m leaving LA, let alone the reason why. They’d freak out and blow up my phone with all the reasons I shouldn’t go. What’s that thing they say about apologizing later instead of asking permission now? That could be the official Brooke Cameron motto. My favourite part of flying first class is that I’m first on and first off – which means little to no interaction with my fellow passengers. That’s a luxury I’m happy to pay for. Tonight, my rowmate is some musician’s kid. I vaguely recognize him, but can’t recall which legendary lead-man-whore fathered him. He ogles me with interest, but I’m not sure if he recognizes me. I check him out while he’s engrossed in an argument with the flight attendant over whether or not he can be served alcohol (‘But this is first class!’ he whines, as if she isn’t aware of that), and my short perusal leads to the conclusion that he can’t be a day over sixteen. I slip my earbuds in, stare out the window and ignore him. Soon he’s playing an all-boobs-and-blood video game on his laptop, confirming his probable age. By the time we land, all the airport shops are closed and the linked seating outside every gate is empty, the wide expanse of polished floor reflecting the methodical dots of yellow lighting in the main concourse. A large metal sign under a colourful collection of guitar art declares my hometown the ‘Music Capital of the World’. Pieces of this collection stand watch over empty baggage carousels, all but one of them motionless – probably my flight. I didn’t check a bag, so I don’t have to stop. I’m creeped out in such a huge, nearly unpopulated place, and my absurd imagination – courtesy two hours’ worth of gory video game imagery – suggests a zombie apocalypse. I hightail it through the nearly deserted airport to the appointed exit, where a car waits at the kerb to transport me into the city I used to know so well. I’ve only been back three times in the past six years – the first to give birth to River, the second to film School Pride and the third to do a photo shoot promoting the film. Austin and I have grown and changed since I lived here, whether we welcomed those transformations or not. I might be able to retrace my steps, but I can’t go back and choose an alternate path. Far too late for that.","sourceLink":"https://allnovel.net/here-without-you-between-the-lines-4/page-7.html","bookId":2742,"book":{"id":2742,"title":"Here Without You (Between the Lines #4)","description":"Storyline: Here Without You (Between the Lines #4) Everyone has secrets. Some are buried so deep, their existence is forgotten. But a secret never told can turn into a lie. And in love, a lie is one thing: Poison. Reid\u0027s in love with Dori, though she hasn\u0027t told her parents that she\u0027s fallen hard for the guy they\u0027d forbidden her to see. Now she\u0027s leaving for college, and Reid\u0027s promise not to push her to go public is wearing thin, especially when she can\u0027t - or won\u0027t - return those three important words he wants to hear. Five years ago, Brooke and Reid were a Thing. That relationship is long gone, detonated amid allegations of cheating - but they still share a secret that would stun everyone they know and alter public perception of them both if it ever comes out. And it\u0027s about to do just that. Here Without You is the fourth, final installment in the Between the Lines series, which includes: Between the Lines, Where You Are, and Good For You.","cover":"https://allnovel.net/images/here-without-you-between-the-lines-4.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/here-without-you-between-the-lines-4.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:42:09 PM"}}
