{"id":91072,"no":18,"title":"Page 18","content":"They came in under the cover of a violent squall line that swept down upon Ten-Towns from the open east. Ironically, they followed the same trail along the side of Kelvin\u0027s Cairn that Drizzt and Wulfgar had traveled just two weeks earlier. This band of verbeeg, though, headed south toward the settlements, rather than north to the open tundra. Though tall and thin - the smallest of the giants - they were still a formidable force. A frost giant led the advanced scout of Akar Kessell\u0027s vast army. Unheard beneath the howling blasts of wind, they moved with all speed to a secret lair that had been discovered by orc scouts in a rocky spur on the southern side of the mountain. There was barely a score of the monsters, but each carried a huge bundle of weapons and supplies. The leader pressed on with all speed toward its destination. Its name was Biggrin, a cunning and immensely strong giant whose upper lip had been torn away by the ripping maw of a huge wolf, leaving the grotesque caricature of a smile forever stamped upon its face. This disfigurement only added to the giant\u0027s stature, instilling the respect of fear in its normally unruly troops. Akar Kessel had personally hand-picked Biggrin as the leader of his forward scouts, though the wizard had been counseled to send a less conspicuous party, some of Heafstaag\u0027s people, for the delicate mission. But Kessell held Biggrin in high regard and was impressed with the enormous amount of supplies the small band of verbeeg could carry. The troop settled into their new quarters before midnight and immediately went about fashioning sleeping areas, storage rooms, and a small kitchen. Then they waited, silently poised to strike the first lethal blows in Akar Kessell\u0027s glorious assault on Ten-Towns. An orc runner came every couple of days to check on the band and deliver the latest instructions from the wizard, informing Biggrin of the progress of the next supply troop that was scheduled to arrive. Everything was proceeding according to Kessell\u0027s plan, but Biggrin noted with concern that many of his warriors grew more eager and anxious every time a new runner appeared, hoping that the time to march to war was finally upon them. Always the instructions were the same, though: Stay hidden and wait. In less than two weeks in the tense atmosphere of the stuffy cave, the comradery between the giants had disintegrated. Verbeeg were creatures of action, not contemplation, and boredom led them inescapably to frustration. Arguments became the norm, often leading to vicious fights. Biggrin was never far away, and the imposing frost giant usually managed to break up the scuffles before any of the troops were seriously wounded. The giant knew beyond any doubt that it could not keep control of the battlehungry band for much longer. The fifth runner slipped into the cave on a particularly hot and uncomfortable night. As soon as the unfortunate orc entered the common room, it was surrounded by a score of grumbling verbeeg. \"What\u0027s the news, then?\" one of them demanded impatiently. Thinking that the backing of Akar Kessell was sufficient protection, the orc eyed the giant in open defiance. \"Fetch your master, soldier,\" it ordered. Suddenly a huge hand grabbed the orc by the scruff of the neck and shook the creature roughly. \"Yous was asked a question, scum,\" said a second giant. \"What\u0027s the news?\" The orc, now visibly unnerved, shot back an angry threat at its giant assailant. \"The wizard will peel the skin from your hide while you watch!\" \"I heared enough,\" growled the first giant, reaching down to clamp a huge hand around the orc\u0027s neck. It lifted the creature clear off the ground, using only one of its massive arms. The orc slapped and twisted pitifully, not bothering the verbeeg in the least. \"Aw, squeeze its filthy neck!\" came one call. \"Put its eyes out an\u0027 drop it in a dark hole!\" said another. Biggrin entered the room, quickly pushing through the ranks to discover the source of the commotion. The giant wasn\u0027t surprised to find the verbeeg tormenting an orc. In truth, the giant leader was amused by the spectacle, but it understood the danger of angering the volatile Akar Kessell. It had seen more than one unruly goblin put to a slow death for disobeying, or simply to appease the wizard\u0027s distorted taste for pleasure. \"Put the miserable thing down,\" Biggrin ordered calmly. Several groans and angry grumbles sprang up around the frost giant. \"Bash its \u0027ead in!\" cried one. \"Bites its nose!\" yelled another. By now, the orc\u0027s face had grown puffy from lack of air, and it hardly struggled at all. The verbeeg holding it returned Biggrin\u0027s threatening stare for a few moments longer, then tossed its helpless victim at the frost giant\u0027s booted feet. \"Keep it then,\" the verbeeg snarled at Biggrin. \"But if it wags its tongue at me agin, I\u0027ll eats it fer sure!\" \"I\u0027ve \u0027ad too much o\u0027 this hole,\" complained a giant from the back of the ranks. \"An\u0027 a whole dale o\u0027 filthy dwarfs fer the taken\u0027!\" The grumbling renewed with heightened intensity. Biggrin looked around and studied the seething rage that had crept into all of the troops, threatening to bring down the whole lair in one sudden fit of irrepressible violence. \"Tomorrow night we starts goin\u0027 out t\u0027 see whats about us,\" Biggrin offered in response. It was a dangerous move, the frost giant knew, but the alternative was certain disaster. \"Only three at a time, an\u0027 no one\u0027s to know!\" The orc had regained a measure of composure and heard Biggrin\u0027s proposal. It started to protest, but the giant leader silenced it immediately. \"Shut yer mouth, orc dog,\" Biggrin commanded, looking to the verbeeg that had threatened the runner and smiling wryly. \"Or I\u0027ll lets me friend eat!\" The giants howled their glee and exchanged shoulderclaps with their companions, comrades again. Biggrin had given them back the promise of action, though the giant leader\u0027s doubts about its decision were far from dispelled by the lusty enthusiasm of the soldiers. Shouts of the various dwarven recipes the verbeegs had concocted - \"Dwarf o\u0027 the Apple\" and \"Bearded, Basted, an\u0027 Baked\" to name two - rang out to overwhelming hoots of approval. Biggrin dreaded what might happen if any of the verbeeg came upon some of the short folk. Biggrin let the verbeeg out of the lair in groups of three, and only during the nighttime hours. The giant leader thought it unlikely that any dwarves would travel this far north up the valley, but knew that it was taking a huge gamble. A sigh of relief escaped from the giant\u0027s mouth whenever a patrol returned without incident. Simply being allowed out of the cramped cave improved the verbeeg\u0027s morale tenfold. The tension inside the lair virtually disappeared as the troops regained their enthusiasm for the coming war. Up on the side of Kelvin\u0027s Cairn they often saw the lights of Caer-Konig and Caer-Dineval, Termalaine across the way to the west, and even Bryn Shander far to the south. Viewing the cities allowed them to fantasize about their upcoming victories, and the thoughts were enough to sustain them in their long wait. Another week slipped by. Everything seemed to be going along well. Witnessing the improvement the small measure of freedom had brought to his troops, Biggrin gradually began to relax about the risky decision. But then two dwarves, having been informed by Bruenor that there was some fine stone under the shadow of Kelvin\u0027s Cairn, made the trip to the north end of the valley to investigate its mining potential. They arrived on the southern slopes of the rocky mountain late one afternoon, and by dusk had made camp on a flat rock beside a swift stream. This was their valley, and it had known no trouble in several years. They took few precautions. So it happened that the first patrol of verbeeg to leave the lair that night soon spotted the flames of a campfire and heard the distinctive dialect of the hated dwarves. On the other side of the mountain, Drizzt Do\u0027Urden opened his eyes from his daytime slumber. Emerging from the cave into the growing gloom, he found Wulfgar in the customary spot, poised meditatively on a high stone, staring out over the plain. \"You long for your home?\" the drow asked rhetorically. Wulfgar shrugged his huge shoulders and answered absently, \"Perhaps.\" The barbarian had come to ask many disturbing questions of himself about his people and their way of life since he had learned respect for Drizzt. The drow was an enigma to him, a confusing combination of fighting brilliance and absolute control. Drizzt seemed able to weigh every move he ever made in the scales of high adventure and indisputable morals. Wulfgar turned a questioning gaze on the drow. \"Why are you here?\" he asked suddenly. Now it was Drizzt who stared reflectively into the openness before them. The first stars of the evening had appeared, their reflections sparkling distinctively in the dark pools of the elf\u0027s eyes. But Drizzt was not seeing them; his mind was viewing long past images of the lightless cities of the drow in their immense cavern complexes far beneath the ground. \"I remember,\" Drizzt recalled vividly, as terrible memories are often vivid, \"\u0027the first time I ever viewed this surface world. I was a much younger elf then, a member of a large raiding party. We slipped out from a secret cave and descended upon a small elven village.\" The drow flinched at the images as they flashed again in his mind. \"My companions slaughtered every member of the wood elf clan. Every female. Every child.\" Wulfgar listened with growing horror. The raid that Drizzt was describing might well have been one perpetrated by the ferocious Tribe of the Elk. \"My people kill,\" Drizzt went on grimly. \"They kill without mercy.\" He locked his stare onto Wulfgar to make sure that the barbarian heard him well. \"They kill without passion.\" He paused for a moment to let the barbarian absorb the full weight of his words. The simple yet definitive description of the cold killers had confused Wulfgar. He had been raised and nurtured among passionate warriors, fighters whose entire purpose in life was the pursuit of battle-glory - fighting in praise of Tempos. The young barbarian simply could not understand such emotionless cruelty. A subtle difference, though, Wulfgar had to admit. Drow or barbarian, the results of the raids were much the same. \"The demon goddess they serve leaves no room for the other races,\" Drizzt explained. \"Particularly the other races of elves.\" \"But you will never come to be accepted in this world,\" said Wulfgar. \"Surely you must know that the humans will ever shun you.\" Drizzt nodded. \"Most,\" he agreed. \"I have few that I can call friends, yet I am content. You see, barbarian, I have my own respect, without guilt, without shame.\" He rose from his crouch and started away into the darkness. \"Come,\" he instructed. \"Let us fight well this night, for I am satisfied with the improvement of your skills, and this part of your lessons nears its end.\" Wulfgar sat a moment longer in contemplation. The drow lived a hard and materially empty existence, yet he was richer than any man Wulfgar had ever known. Drizzt had clung to his principles against overwhelming circumstances, leaving the familiar world of his own people by choice to remain in a world where he would never be accepted or appreciated. He looked at the departing elf, now a mere shadow in the gloom. \"Perhaps we two are not so different,\" he mumbled under his breath. \"Spies!\" whispered one of the verbeeg. \"Stupid fer spyin\u0027 with a fire,\" said another. \"Lets go squash \u0027em!\" said the first, starting toward the orange light. \"The boss said no!\" the third reminded the others. \"We\u0027s to watch, but no squashin\u0027!\" They started down the rocky path toward the small camp of the dwarves with as much stealth as they could muster, which made them about as quiet as a rolling boulder. The two dwarves were well aware that someone or something was approaching. They drew their weapons as a precaution, but figured that Wulfgar and Drizzt, or perhaps some fishermen from Caer-Konig, had seen their light and were coming to share dinner with them. When the camp came into sight just below, the verbeeg could see the dwarves standing firm, weapons in hand. \"They\u0027s seen us!\" said one giant, ducking into the darkness. \"Aw, shut up,\" ordered the second. The third giant, knowing as well as the second that the dwarves could not as yet know who they were, grasped the second\u0027s shoulder and winked evilly. \"If they\u0027s seen us,\" it reasoned, \"we\u0027s got no choice but to squash \u0027em!\" The second giant chuckled softly, poised its heavy club on its shoulder, and started for the camp. The dwarves were completely stunned when the verbeeg came bounding around some boulders just a few yards from their camp and closed in on them. But a cornered dwarf is pound for pound as tough as anything in the world, and these were of the clan from Mithril Hall who had been waging battles on the merciless tundra for all of their lives. This fight would not be as easy as the verbeeg had expected. The first dwarf ducked a lumbering swing from the lead verbeeg and countered by slamming his hammer onto the monster\u0027s toes. The giant instinctively lifted its injured foot and hopped on one leg, and the seasoned dwarf fighter promptly cut it down by bashing him in the knee. The other dwarf had reacted quickly, launching his hammer with pinpoint accuracy. It caught another giant in the eye and spun the creature crashing into some rocks. But the third verbeeg, the smartest of the three, had picked up a stone before it had charged and returned the dwarf\u0027s throw with tremendous force. The stone deflected off the unfortunate dwarf\u0027s temple, snapping his neck violently to the side. His head lolled about uncontrollably on his shoulders as he fell dead to the ground. The first dwarf would have soon finished off the giant he had felled, but the last of the monsters was upon him at once. The two combatants parried and countered, with the dwarf actually gaining a bit of an advantage. An advantage that lasted only until the giant who had been struck in the eye by the thrown hammer recovered enough to jump in. The two verbeeg rained blow after heavy blow at the dwarf. He managed to dodge and deflect them for a short while, but then one landed squarely on his shoulder and dropped him to his back. He found his breath in a short time, for he was as tough as the stone he had landed on, but a heavy boot stomped on him and held him prone. \"Squish \u0027im!\" begged the injured giant the dwarf had cut down. \"Then we takes \u0027im to the cook!\" \"We does not!\" growled the giant above the dwarf. It ground its huge boot into the earth, slowly pressing the life from the unfortunate victim. \"Biggrin\u0027ll take us to the cook if \u0027e finds us out!\" The other two grew genuinely afraid when they were reminded of the wrath of their brutal leader. They looked helplessly to their more cunning companion for a solution. \"We puts \u0027em an\u0027 their filthy things in a dark hole and says nothin\u0027 more o\u0027 this!\" Many miles to the east, in his solitary tower, Akar Kessell waited patiently. In the autumn, the last - and largest - of the trading caravans would roll back into Ten-Towns from Luskan, laden with riches and supplies for the long winter. His vast armies would be assembled and on the move by then, marching gloriously to destroy the pitiful fishermen. The mere thought of the fruits of his easy victory sent shivers of delight through the wizard. He had no way of knowing that the first blows of the war had already been struck.","sourceLink":"https://allnovel.net/the-crystal-shard-the-icewind-dale-trilogy-1/page-18.html","bookId":2102,"book":{"id":2102,"title":"The Crystal Shard (The Icewind Dale Trilogy #1)","description":"Storyline: The Crystal Shard(The Icewind Dale Trilogy 1) This new release of the classic R.A. Salvatore novel continues the classic tale of Salvatore\u0027s signature dark elf character Drizzt Do\u0027Urden. Although this was the first title actually published about Drizzt, it has now been placed in its proper chronological order as fourth in the series. Each title in The Legend of Drizzt series showcases the classic dark elf novels in new, deluxe hardcover editions. Each title will feature all new cover art and new introductions written by those who have become familiar with Salvatore and Drizzt over the years.","cover":"https://allnovel.net/images/the-crystal-shard-the-icewind-dale-trilogy-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crystal-shard-the-icewind-dale-trilogy-1.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:46:09 PM"}}
