{"id":96008,"no":7,"title":"Page 7","content":"The next day, after the second bell before language arts class, Becky was reviewing her completed essay, while I was trying to keep my weary eyes open long enough to finish mine. Our teacher, Mr. Kensy, a dour man with a devilish mustache, was taking attendance when the announcements came on. \"Viva las Valentines,\" a perky teen girl\u0027s voice began over the classroom loudspeaker. \"Prom is just around the corner. Don\u0027t forget to purchase tickets at the gymnasium door during lunch period. Also cast your ballots for Prom King and Queen. His and Her Majesty will get a spotlight dance and a picture in the Chatterbox!\" Our class treasurer, a blond with a bob, wearing a pink-and- white-striped polo shirt and jeans, rose and shyly walked down the classroom aisles, handing a red valentine to each student. Becky began to scribble pensively, as if she were voting in her first presidential election. As the other students whispered and wrote down their choices, I quickly filled out my form. \"I\u0027ll show you mine if you show me yours,\" I said to Becky when I\u0027d finished. Becky nodded eagerly. I held out my valentine--next to King I\u0027d written \"Matt Wells,\" and next to Queen I\u0027d written \"Becky Miller.\" A huge smile lit up my best friend\u0027s face. Becky showed me her ballot. Next to King she\u0027d written with perfect penmanship \"Alexander Sterling.\" Next to Queen it read \"Raven Madison.\" \"I like the sound of it,\" I announced. \"But Alexander doesn\u0027t attend our school.\" We folded our ballots and as the treasurer walked back up the row we stuck them in a homemade aluminum-foil-covered box resembling something children make in elementary school. \"We each got one vote,\" I said proudly. \"Now we just need three hundred ninety-nine more!\" My mom was so overjoyed that I\u0027d be attending prom, she ducked out of work early, picked me up from school in her SUV, and drove me to Jack\u0027s department store. Jack\u0027s department store was originally owned by Jack Patterson\u0027s father and was now run by Jack, a handsome crush- worthy guy five years my senior. When I was twelve, I\u0027d snuck into the Mansion for him so he could pass an initiation for his high school buddies. He remembered me ever since and always wore a smile for me when I visited the department store. Jack\u0027s sold everything from socks to scooters, Fiestaware to Waterford crystal, and generic wallets to Prada purses. My mom and I entered the store, breezing past the linen department. Designer towels in every color on an artist\u0027s palette were neatly stacked on white shelves. Focused on a fashion mission, my mom headed straight for the escalators. \"Juniors are on this floor,\" I instructed, pointing past Bedding. \"We\u0027re going to Juniors Boutique,\" she said. I\u0027d hardly been in the Juniors, much less Juniors Boutique. We rode the ascending escalator, peering down on shoppers perusing fine jewelry. We reached the second floor, walked past Designer Women\u0027s Petites, and arrived at Juniors Boutique. Cashmere sweaters, designer blouses, and jeans were perfectly displayed. Anorexic mannequins flaunted size zero skirts and hundred-dollar tank tops. About a dozen or so girls and their mothers were picking through the rows of dresses--pink, purple, violet, gray, red, green, lavender, black, some with rhinestones or lace, plunging necklines or conservative ones, sleeveless or strapless, floor-length or knee-length hems. Each daughter was a Xerox copy of her mom. Except for our brunette hair, which my mother regularly colored, my mom and I appeared to be polar opposites. One by one, my mother pulled dresses off the racks until she had two armfuls. One by one, I glanced over dresses and moved to another rack, empty-handed. A seasoned sales manager, wearing a name tag that read MADGE and exuding the confidence of a sea captain effortlessly managing a vessel on the high seas, approached my mom. \"Here, let me take those,\" she said. This obviously wasn\u0027t her first prom season and it wasn\u0027t going to be her last. \"I\u0027ll start a dressing room for you.\" We followed the woman into the dressing room already flooded with prom babes strutting their gowns like they were on a Paris catwalk. I disrobed, taking off my wide-bottom black jeans and Hello Batty T-shirt, and stepped into a pink satin number. I stared into the full-length mirror. I didn\u0027t even recognize my own reflection. \"Let me see!\" I heard my mother say. Reluctantly, I opened the dressing-room door. \"Take off those boots!\" she scolded. \"This isn\u0027t a heavy metal concert.\" As I untied my laces, Madge appeared and within moments she was back with pink rhinestone stilettos, size seven. I stepped before the three-way dressing-room mirror. I felt like a bridesmaid, but to my mother, I must have looked like the bride. \"You are beautiful!\" she gushed. Even Madge agreed. \"You look like a model,\" she declared, and waited for my reaction. I could see myself reflected in my mother\u0027s eyes, slowly transforming into the daughter she had always wanted. The prom babes sized me up. A few smiled; a few giggled. I must have looked quite the sight, pretty in pink with my multiple ear piercings, temporary bat tattoos, and black lipstick and fingernail polish. I imagined how much better I\u0027d look if this prom dress had a few holes, black seams, or was dyed bloodred. \"Before you decide...,\" Madge declared briskly. She returned to the counter to replace my black rubber bracelets with rhinestone ones. Just then Jack Patterson stepped into view. \"Raven, it\u0027s Jack,\" my mother said, and excitedly exited the dressing room. As my mother greeted Jack and they continued on with their pleasantries, I raced back to my dressing-room stall and locked the door. Then she did something only a mother would do. \"Raven! Come out here,\" she called to me. I had nowhere to run. I wasn\u0027t ready for anyone to see me like this, much less Jack Patterson. I slunk out of the dressing room, through Juniors Boutique, trying to balance myself on the tiny stiletto heels. The other girls scrutinized me as they continued to shop. My mother signaled for me to twirl around and model the dress for Jack. I awkwardly spun like an inexperienced model. Jack smiled. \"You look beautiful.\" I couldn\u0027t help but feel proud, even though I felt like an ornament on top of a sweet sixteen birthday cake. \"I have more to try on...,\" I finally said, heading back to the dressing room. After I tried on a dress in every color of the rainbow, the Madison mother-and-daughter Prom Dress Finding Team were growing weary. I got dressed in my black-on-black threads. \"So which one do you like?\" my mom asked, holding up a pink dress in one hand and a blue one in the other. \"I think they are both wonderful.\" \"Uh...can we keep looking?\" I just imagined Alexander, sporting a midnight black tux, arriving at my house to find me all puffed up in pink. \"Why are you frowning?\" my mother chided. \"They may be wonderful...But they\u0027re not...me.\" My mother sighed. \"For my senior prom, Grandma bought me what she wanted me to wear--a lavender satin dress with a white sweater and brand-new crisp white gloves.\" \"Gloves? But you were a hippie.\" \"Exactly.\" \"So you wore them?\" \"I did until I got to the prom. Then I switched into a sundress I had hanging in my locker. Now I\u0027m doing the same thing to you. Insisting you dress the way I\u0027d like you to dress instead of the way that makes you comfortable.\" I was impressed that my mother had such insight. \"Let\u0027s give it one more try,\" she continued. There was a simple black strapless dress, lined with lace, on a mannequin. I could accessorize it with an onyx choker, black studded bracelets, and spiderweb earrings. Jennifer Warren, a varsity cheerleader, stood behind me as I studied the dress, glaring at me as if I wasn\u0027t worthy of eyeing such a beautiful gown. \"Hey, Mom,\" I called, catching up to her at the accessory counter. \"I think I\u0027ve found a dress that fits both our tastes.\" I led my mother back through the maze of satiny garments. We reached the mannequin, only to find a salesgirl unzipping the black dress and handing it to Jennifer. \"Mom,\" Jennifer exclaimed to a delighted woman. \"It\u0027s stunning.\" My heart sank. I tugged at my hair and dug my boots into the masonite tiled floor. My eyes couldn\u0027t help but well up with tears. My mother\u0027s smile strained, as if she were as heartbroken as I was. \"That\u0027s fine,\" I managed to say. \"I don\u0027t have to go.\" \"What do you mean you\u0027re not going?\" Jack asked from behind the sales counter. \"They just sold the perfect dress,\" I admitted. \"You mean you didn\u0027t like the pink one?\" he asked, helping a salesgirl with the register. \"It looked gorgeous.\" \"Well...\" \"Not your taste...I understand.\" Jack thought for a moment as he finished the transaction. \"Why don\u0027t you come with me...\" Jack motioned us behind the sales counter and we followed him down a hallway. \"A few gowns just arrived this afternoon. It\u0027s been so busy, we haven\u0027t even had the chance to put them on the floor,\" he whispered. He unlocked a storeroom and led us through boxes of merchandise and hanging layaways to a rack of fancy junior dresses. \"Take your time. If you are interested in anything, bring it to the sales desk.\" \"What are these?\" I asked, pointing to a rack of costumes. \"Inventory from Halloween,\" he answered, heading for the door. \"Halloween?\" my mother asked, horrified. \"You\u0027re going to prom, not a Monster Mash.\" \"Please. Let me see!\" I said, pushing past a rack of men\u0027s suits. \"Thank you, Jack!\" \"Yes, Jack. Thank you for all your help,\" my mother added. I was as happy as a bat in a dusty old attic. I rummaged through the hanging costumes--a fairy costume, a firefighter uniform, and a mermaid outfit. \"This is cool,\" I said, holding up a red devil dress. \"Absolutely not!\" my mother said. I frowned and returned it to the rack. \"This is not what I had in mind when I said let\u0027s buy a dress for prom. Shopping in a storeroom,\" she said, continuing her search. \"However...take a look at this one.\" I didn\u0027t even notice what my mom was holding up. At the end of the rack, I saw a blood red skirt with black lace calling my name. I pulled the dress out and gasped. On a hanger hung a dark red corset with black lace, black strings, and a matching ankle-length skirt. Attached to the hanger was the most fabulous accessory I\u0027d ever seen: a gloomy parasol. \"I love it!\" I exclaimed, showing it to my mother. \"It\u0027s not torn, and it doesn\u0027t have staples or safety pins.\" My mother paused. \"It\u0027s not really what I had in mind...\" I modeled it over my clothes and danced around. \"I wanted you to look like a modern-day princess, not a Victorian vampire.\" \"Isn\u0027t it wonderful?\" I gave my mother a huge squeeze. Madge had sold hundreds of dresses in her time at Jack\u0027s, but by the way she forced her smile, I don\u0027t think she\u0027d ever rung up a Halloween outfit for prom. However, the old woman did her best to mask her shock and dismay. \"You can be confident that no one else will be wearing this dress,\" she proclaimed. Between my mother and me, we finally compromised on a dress that suited her budget and wasn\u0027t one I\u0027d have to change out of as soon as I got to prom. That evening, Alexander was waiting for me outside the Mansion door, the serpent knocker eyeing me like an old friend. My vampire boyfriend was sporting tight black drill jeans with black buckles running down the side, a Crow T-shirt, and his backpack slung over one shoulder. He gave me a sweet hello kiss. \"Are we going back to the treehouse? Or going camping?\" I asked coyly. \"Last night I returned to the treehouse to retrieve Jagger\u0027s gravestone etchings. They were gone.\" \"Valentine?\" I asked. \"I assume so. Valentine won\u0027t be back to the treehouse for a while. It would be too risky for him.\" \"Then how will we ever find him?\" \"We\u0027ll have to lead him to us. Remember the box of blood-filled amulets that Jagger received from the Coffin Club that I found in the cemetery? Jagger used them to sustain himself so he\u0027d go unnoticed here in Dullsville. I\u0027ve got some in here,\" Alexander said, patting his backpack. \"We can leave a few for Valentine at a couple locations. That way we can tell where he\u0027s been.\" We tied several amulets to one of the limbs of the treehouse before heading off in the Mercedes to Dullsville\u0027s cemetery. \"Valentine has to be hiding out somewhere,\" Alexander stated as he parked the car beside the cemetery. Alexander held my hand as we headed up the sidewalk to the graveyard\u0027s entrance. \"I shouldn\u0027t be on sacred ground, should I?\" I asked when we reached the iron gates. \"If he did bite me, not only would he turn me into a vampire, but I\u0027d be bonded to him for eternity.\" Alexander paused. \"I guess you\u0027re right,\" he agreed. \"I forget that Valentine is a...It\u0027s best you stay behind.\" \"Stay behind?\" I asked with a puppy dog face, quickly changing my tune. \"But Valentine isn\u0027t here to bond with a mate, is he?\" Alexander shook his head. \"I\u0027m not sure why he\u0027s here.\" My boyfriend started over the fence. \"But if Valentine isn\u0027t after an eternal partner, it couldn\u0027t hurt,\" I said, pulling myself over the fence. I followed Alexander through the aisles of tombstones, past the caretaker\u0027s shed. We checked out a freshly dug grave. \"Nothing here,\" he declared as we looked into the empty grave. We reached the sycamore where we originally found the box of amulets. Alexander placed five amulets on the ground-- haphazardly, so they wouldn\u0027t appear to be a trap. \"We\u0027ll wait for a few minutes.\" We snuck behind the caretaker\u0027s shed. Alexander put his arm around me and we huddled together underneath the glow of the moonlight. \"Tell me about your day. I feel there is so much in your life that I am missing,\" Alexander began. \"Biology? Or algebra? You aren\u0027t missing a thing.\" \"I imagine you doodling in your notebooks, skipping class, eating with Matt and Becky.\" \"What do I look like?\" \"Beautiful, like a dark angel glowing in the daylight that streams into the classroom. Like the picture of you I have beside my coffin.\" I sighed. \"Becky put up some photos in her locker yesterday that she and Matt had taken in a photo booth. I wish I had a picture of you.\" Alexander gazed at me, his dark eyes sad. \"There are certain things I can never give you,\" he admitted, \"that other guys at your school can.\" \"You give me so much more than any mortal can,\" I said reassuringly. Alexander squeezed my hand. I could tell he felt lonely and wanted to join my world as much as I wanted to join his. \"It\u0027s getting late,\" he said. \"If we leave now, we may miss Valentine,\" I complained. \"I have a feeling he won\u0027t be back for a while. We can return tomorrow, together.\" That night I was modeling my corseted prom dress in my bedroom and trying to match accessories from my Mickey Malice jewelry box. I put my onyx choker on and gazed into the mirror. I wondered how Alexander would prepare for prom without being able to see his reflection. Would I give up seeing my reflection forever to have the chance to be with Alexander for eternity? I wasn\u0027t sure how I\u0027d adapt to not performing the tasks I\u0027d grown accustomed to doing for the past sixteen years. If Dullsvillians thought I was a freak now, I\u0027m sure they would have a field day when I applied my lipstick and eyeliner without the use of a mirror. The following day Matt, Becky, and I met at our lockers, then headed to the gymnasium to purchase prom tickets. We squeezed through the claustrophobically crowded bustling hallways, past the main entrance, and turned the corner to the gym. There I saw something I\u0027d never imagined--a huge line of kids snaking through the hall like the Loch Ness monster. \"Are they selling Rolling Stones tickets, too?\" I joked. \"If so, I\u0027m buying,\" Matt replied as we joined the end of the line. Every Dullsville High student must have been attending the upcoming prom. Some couples were holding hands, a few girls were on cell phones, another pair was having a fight. Matt put his arm around Becky and her face lit up like the New Year\u0027s Eve crystal ball at Times Square. I felt a pang in my heart because Alexander wasn\u0027t here to put his arm around me. From my vantage point, I could barely see the entrance to the gym where several student ticket sellers were seated behind a folding table. Fortunately, the line seemed to be moving steadily along toward the destination. Our class treasurer was off to the side holding a clipboard like she was taking a survey. \"Sign-up sheet for volunteers. We need extra hands for the decorations,\" she said as we proceeded forward. Becky waved over the girl in charge of our sophomore funds. \"Are you going to sign up?\" Becky asked me as she scribbled her name on the paper. \"I don\u0027t have much free time these days.\" When Becky was finished, the treasurer glared at me, quickly withdrew her clipboard before I had the chance to change my mind, and moved to the end of the line. \"Have you heard about a creepy-looking kid hanging out in town?\" I overheard a couple say behind me as we moved a few feet ahead. I angled my head slightly to get an earful. \"Yes,\" the other answered. \"I think he\u0027s related to those freaks from Romania that were at Trevor\u0027s Graveyard Gala. Supposedly he wanders the streets at night looking for souls.\" I leaned back a little farther. \"I heard he was a ghost,\" the guy gossiped. \"Apparently the caretaker has been finding empty candy wrappers in the cemetery--\" \"He wears that nasty goth clothing,\" she whispered, loud enough for me to hear. I continued to lean back--this time a little too far. I lost my balance and stumbled back. \"Ouch,\" Heather Ryan complained. \"That was my foot.\" \"Sorry,\" I said genuinely as I regained my footing. If I had been a prep like her, she probably would have laughed it off. But instead she looked at me as if I, too, had just climbed out of the cemetery looking for souls. \"These are brand-new Pradas,\" she whined. \"Well, these are vintage Doc Martens. What\u0027s the big deal?\" \"I think you may have scuffed them,\" she said, scowling at me. I stared at her bright white shoes. \"You should be thanking me. I\u0027d be glad to scuff them some more, if you like.\" Her boyfriend laughed. \"It\u0027s not nice to eavesdrop,\" she reprimanded me as if she were a teacher. \"It\u0027s even worse to gossip,\" I snarled. \"And very tacky to designer-name drop.\" We were fast approaching the ticket table. \"You still have time to ask someone else,\" I whispered to her boyfriend. He laughed again and she slugged him in the arm. \"Come on, Raven,\" Becky ordered, pulling me away. \"It\u0027s our turn.\" I left the gossipmongers and approached the ticket table. Becky beamed as Matt bought two tickets. I pulled out a wad of cash from my Olivia Outcast purse. \"No cutting,\" I heard the couple say in back of me. I turned around. Trevor Mitchell was standing behind me. \"So have you found a date, Corpse Bride?\" he asked in a seductive voice. \"Yes, I have,\" I said, putting the tickets safely in my purse. \"Your father? Or your first cousin?\" \"Alexander,\" I said confidently. \"That\u0027s a shame. I would have escorted you. I could have used it for my community service hours.\" Trevor handed the cashier a hundred-dollar bill as Matt, Becky, and I made our exit. On the way home from school, Becky agreed to stop off at Henry\u0027s house. \"Billy Boy left something in the backyard. I\u0027ll only be a minute,\" I said, getting out of her pickup truck. I raced up the driveway. No lights in Henry\u0027s house were lit. I peeked into the garage, empty of his parents\u0027 cars. Henry and Billy Boy were at Math Club, so the coast was clear. I hurried past his gigantic pool and gazebo and ran through the pristinely mowed lawn. I climbed the treehouse ladder, the rungs creaking with every step of my boots. I reached the treehouse deck and inspected the door. The amulets were gone. Shortly after sunset, Alexander arrived at my house to find me pacing on the front walkway. I kissed him, bursting to tell him my news. \"I went to the treehouse. The amulets--they\u0027re gone!\" I proclaimed, leading him inside. \"Valentine has been back to the treehouse.\" \"Then we can set a trap. This time, I\u0027ll be waiting,\" Alexander said. Alexander was giving me a huge squeeze when Billy Boy burst through the front door. \"Look what Henry and I found at the treehouse,\" my brother declared. In his smarmy little palm he held two shining amulets. My heart dropped. \"Those aren\u0027t yours!\" \"Well, they certainly aren\u0027t yours. Finders keepers.\" \"Let me see those,\" I said, reaching for them. \"Here,\" he said, holding the clasps and letting the amulets swing, as if trying to hypnotize me. \"See with your eyes, not with your--\" I tried to grab them, but my brother pulled them away. \"There were four,\" I said. \"How do you know?\" \"Uh...amulets come in four; don\u0027t you know anything?\" I stumbled. \"Henry kept the other two.\" \"Well, I think they are more my style than yours. Let me have them.\" \"Forget it. It looks like they\u0027re filled with blood,\" Billy Boy said with delight. \"Henry plans to test them.\" I paused. \"Then what will you do with them?\" \"Use them for our Project Vampire.\"","sourceLink":"https://allnovel.net/dance-with-a-vampire-vampire-kisses-4/page-7.html","bookId":2143,"book":{"id":2143,"title":"Dance with a Vampire (Vampire Kisses #4)","description":"Storyline: Dance with a Vampire (Vampire Kisses #4) There\u0027s a new vampire in town. His name is Valentine Maxwell. Goth-girl Raven knows this latest intruder can only mean trouble--he\u0027s the younger sibling of two vampires she fought to drive out of Dullsville. But when her brother, Billy, befriends this dangerous tween night prowler, the stakes are suddenly higher. Though torn by the excitement of every teen girl\u0027s fantasy--attending the prom with her boyfriend--Raven must do everything she can to protect Billy. Valentine\u0027s appearance may pose even further threats. Could he somehow know Raven\u0027s innermost feelings about becoming immortal for her true love, Alexander? The far-from-ordinary romance of these two teen outsiders takes another surprise-filled spin in the fourth book of Ellen Schreiber\u0027s applauded Vampire Kisses series.","cover":"https://allnovel.net/images/dance-with-a-vampire-vampire-kisses-4.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dance-with-a-vampire-vampire-kisses-4.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:17:49 PM"}}
