{"id":96717,"no":15,"title":"Page 15","content":"15 THE FOLLOWING NIGHT I went to the city of Florence. It was of course splendid to see it quite recovered from the ravages of the Black Death, and indeed a city of greater prosperity and greater ingenuity and energy than Rome. I soon learnt what I had suspected\u0026iexcl;\u0026ordf;that having grown up around commerce, the city had not suffered the ruin of a classical era, but had rather grown progressively strong over the centuries, as its ruling family, the Medici, maintained power by means of a great international bank. Everywhere about me there were elements of the place\u0026iexcl;\u0026ordf;its growing architectural monuments, its interior paintings, its clever scholars\u0026iexcl;\u0026ordf;that drew me fiercely, but nothing really could keep me away from discovering the identity of Botticelli, and seeing for myself not only his works, but the man. Nevertheless, I tormented myself slightly. I took rooms in a palazzo near the main piazza of the city, hired a bumbling and remarkably gullible servant to lay in lots of costly clothes for me, all made in the color red as I preferred it, and still do to any other, and I went at once to a bookseller\u0027s and knocked and knocked until the man opened his doors for me, took my gold, and gave me the latest books which \"everyone was reading\" on poetry, art, philosophy and the like. Then retiring to my rooms, I sat down by the light of one lamp and devoured what I could of my century\u0027s thinking, and at last I lay flat upon the floor, staring at the ceiling, overwhelmed by the vigor of the return to the classical, by the passionate enthusiasm for the old Greek and Roman poets, and by the faith in sensuality which this age seemed to hold. Let me note here that some of these books were printed books, thanks to the miraculous invention of the printing press, and I was quite amazed by these though I preferred the beauty of the old handwritten codexes, as did many men of the time. In fact, it is an irony that even after the printing press was very well established, people still boasted of having handwritten libraries, but I digress. I was talking of the return to the old Greek and Roman poets, of the infatuation of the era with the times of my birth. The Roman church was overwhelmingly powerful as I have suggested. But this was an age of fusion, as well as inconceivable expansion\u0026iexcl;\u0026ordf; and it was fusion which I had seen in the painting of Botticelli\u0026iexcl;\u0026ordf;so full of loveliness and natural beauty though created for the interior of the Pope\u0026iexcl;\u0026macr;s, own chapel in Rome. Perhaps near to midnight, I stumbled out of my quarters, finding the city under curfew, with the taverns which defied it and the inevitable ruffians roaming about. I was dazed as I made my way into a huge tavern full of gleeful young drunkards where a rosy-cheeked boy sang as he played the lute. I sat in the corner thinking to control my overwrought enthusiasms, my crazed passions, yet I had to find the home of Botticelli. I had to. I had to see more of his work. What stopped me from it? What did I fear? What was going on in my mind? Surely the gods knew I was a creature of iron control. Had I not proven it a thousand times? For the keeping of a Divine Secret had I not turned my back on Zenobia? And did I not suffer routinely and justly for having abandoned my incomparable Pandora whom I might never find again? At last I could endure my confused thoughts no longer. I came close to one of the older men in the tavern who was not singing with the younger ones. \"I\u0027ve come here to find a great painter,\" I told him. He shrugged and took a drink of his wine. \"I used to be a great painter,\" he said, \"but no more. All I do is drink.\" I laughed. I called for the tavern maid to serve him another cup. He gave a nod of thanks to me. \"The man I\u0027m looking for\u0026iexcl;\u0026ordf;he\u0027s called Botticelli, or so I\u0027m told.\" Now it was his turn to laugh. \"You\u0027re seeking the greatest painter in Florence,\" he said. \"You won\u0027t have any trouble finding him. He\u0027s always busy, no matter how many idlers hang about in his workshop. He may be painting now.\" \"Where is the workshop?\" I asked. \"He lives in the Via Nuova, right before the Via Paolino.\" \"But tell me\u0026iexcl;\u0026ordf;.\" I hesitated. \"What sort of man is he? I mean to you?\" Again, the man shrugged. \"Not bad, not good, though he has a sense of humor. Not one to make an imprint on your mind except through his painting. You\u0027ll see when you meet him. But don\u0027t expect to hire him. He has much work already to do.\" I thanked the man, laid down money for more wine if he wanted it, and slipped out of the tavern. With a few questions I found the way to the Via Nuova. A night watchman gave me the way to the home of Botticelli, pointing to a sizable house, but not a great palazzo, where the painter lived with his brother and his brother\u0027s family. I stood before this simple house as if it were a shrine. I could see where the workshop most certainly was by its large doors to the street which were inevitably open by day, and I could see that all the rooms both on the main floor and above it were dark. How could I go into this workshop? How could I see what work was being done there now? Only by night could I come to this place. Never had I cursed the night so much. Gold had to do this for me. Gold and the Spell Gift, though how I would dare to daze Botticelli himself I had no idea. Suddenly, unable to control myself any longer I pounded on the door of the house. Naturally enough, no one answered, so I pounded again. Finally a light brightened in the upstairs window, and I could hear footfall within. At last a voice demanded: Who was I, and what did I want? What was I to answer to such a question? Was I to lie to someone whom I worshiped? Ah, but I had to get in. \"Marius de Romanus,\" I answered, making up the name at that very moment. \"I\u0027ve come with a purse of gold for Botticelli. I\u0027ve seen his paintings in Rome, and I greatly admire him. I must put this purse into his own hand-\" There was a pause. Voices behind the door. Two men conferring with each other as to who I might be, or why such a lie might be told. One man said not to answer. The other man said it was worth a brief look, and it was he who pulled back the latch and opened the door. The other held the lamp behind him, so I saw only a shadowy face. \"I am Sandro,\" he said simply, \"I\u0027m Botticelli. Why would you bring me a purse of gold?\" For a long moment I was speechless. But in this speechlessness, I had the sense to produce the gold. I handed the purse over to the man, and I watched silently as he opened it and as he took out the gold florins and held them in his hand. \"What do you want?\" he asked. His voice was as plain as his manner. He was rather tall. His hair was light brown and already threaded with gray though he was not old. He had large eyes that appeared compassionate, and a well-formed mouth and nose. He stood looking at me without annoyance or suspicion, and obviously ready to return my gold. I didn\u0027t think he was forty years old. I tried to speak and I stammered. For the first time in all my memory I stammered. Finally I managed to make myself plain: \"Let me come into your workshop tonight,\" I said. \"Let me see your paintings. That\u0027s all I want.\" \"You can see them by day.\" He shrugged. \"My workshop\u0027s always open. Or you can go to the churches in which I\u0027ve painted. My work is all over Florence. You don\u0027t have to pay me for such a thing.\" What a sublime voice; what an honest voice. There was something patient and tender in it. I gazed upon him as I had gazed on his paintings. But he was waiting for an answer. I had to pull myself together. \"I have my reasons,\" I said. \"I have my passions. I want to see your work now, if you\u0027ll let me. I offer the gold.\" He smiled and he gave a little even laugh. \"Well, you come like one of the Magi,\" he said. \"For I can certainly use the payment. Come inside.\" That was the second time in my long years that I had been compared to the Magi of Scripture and I loved it. I entered the house which was by no means luxurious, and as he took the lamp from the other man, I followed him through a side door into his workshop where he put the lamp on a table full of paints and brushes and rags. I couldn\u0027t take my eyes off him. This was the man who had done the great paintings in the Sistine Chapel, this ordinary man. The light flared up and filled the place. Sandro, as he had called himself, gestured to his left, and as I turned to my right, I thought I was losing my mind. A giant canvas covered the wall, and though I had expected to see a religious painting, no matter how sensual, there was something else there, altogether different, which rendered me speechless once more. The painting was enormous as I\u0027ve indicated, and it was composed of several figures, but whereas the Roman paintings had confused me in the question of their subject matter, I knew very well the subject matter of this. For these were not saints and angels, or Christs and prophets\u0026iexcl;\u0026ordf;no, far from it. There loomed before me a great painting of the goddess Venus in all her glorious nudity, feet poised upon a seashell, her golden hair torn by faint breezes, her dreamy gaze steady, her faithful attendants the god Zephyr who blew the breezes which guided her landward, and a nymph as beautiful as the goddess herself who welcomed her to the shore. I drew in my breath and put my hands over my face, and then when I uncovered my eyes I found the painting there again. A slight impatient sigh came from Sandro Botticelli. What in the name of the gods could I say to him about the brilliance of this work? What could I say to him to reveal the adulation I felt? Then came his voice, low and resigned. \"If you\u0027re going to tell me it\u0027s shocking and evil, let me tell you, I have heard it a thousand times. I\u0027ll give you back your gold if you want. I\u0027ve heard it a thousand times.\" I turned and went down on my knees, and I took his hands and I kissed them with my lips as closely as I dared. Then I rose slowly like an old man on one knee before the other and I stood back to gaze at the panel for a long time. I looked at the perfect figure of Venus again, covering her most intimate secret with locks of her abundant hair. I looked on the nymph with her outstretched hand and her voluminous garments. I looked on the god Zephyr and the goddess with him, and all of the tiny details of the painting came to reside in my mind. \"How has it come about? \" I asked. \"After so long a time of Christs and Virgins, that such a thing could be painted at last? \" From the quiet figure of the uncomplaining man there came another little laugh. \"It\u0027s up to my patron,\" he said. \"My Latin is not so good. They read the poetry to me. I painted what they said to paint.\" Fie paused. He looked troubled. \"Do you think it\u0027s sinful?\" \"Certainly not,\" I responded. \"You ask me what I think? I think it\u0027s a miracle. I\u0027m surprised that you would ask,\" I looked at the painting- \"This is a goddess,\" I said. \"How could it be other than sacred? There was a time when millions worshiped her with all their hearts. There was a time when people consecrated themselves to her with all their hearts.\" \"Well, yes,\" he answered softly, \"but she\u0027s a pagan goddess, and not everyone thinks that she is the patron of marriage as some say now. Some say this painting is sinful, that I shouldn\u0027t be doing it.\" He gave a frustrated sigh. He wanted to say more, but I sensed that the arguments were quite beyond him. \"Don\u0027t listen to such things,\" I said. \"It has a purity I\u0027ve almost never seen in painting- Her face, the way you\u0027ve painted it, she\u0027s newborn yet sublime, a woman, yet divine. Don\u0027t think of sin when you work on this painting. This painting is too vital, too eloquent. Put the struggles of sin out of your mind.\" He was silent but I knew he was thinking. I turned and tried to read his mind. It seemed chaotic, and full of wandering thoughts and guilt. He was a painter almost entirely at the mercy of those who hired him, but he had made himself supreme by virtue of the particularities that all cherished in his work. Nowhere were his talents more fully expressed than in this particular painting and he knew this though he couldn\u0027t put it into words. He thought hard on how to tell me about his craft and his originality, but he simply couldn\u0027t do it. And I would not press him. It would be a wicked thing to do. \"I don\u0027t have your words,\" he said simply. \"You really believe the painting isn\u0027t sinful?\" \"Yes, I told you, it\u0027s not sinful. If anyone tells you anything else they\u0027re lying to you.\" I couldn\u0027t stress it enough. \"Behold the innocence in the face of the goddess. Don\u0027t think of anything else.\" He looked tormented, and there came over me a sense of how fragile he was, in spite of his immense talent and his immense energy to work. The thrusts of his art could be utterly crushed by those who criticized him. Yet he went on somehow every day painting the best pictures that he knew how to paint. \"Don\u0027t believe them,\" I said again, drawing his eyes back to me. \"Come,\" he said, \"you\u0027ve paid me well to look at my work. Look at this tondo of the Virgin Mary with Angels. Tell me how you like this.\" He brought the lamp to the far wall and held it so that I might see the round painting which hung there. Once again I was too shocked by the loveliness of it to speak. But it was plainly obvious that the Virgin was as purely beautiful as the goddess Venus, and the Angels were sensual and alluring as only very young boys and girls can be. \"I know,\" he said to me. \"You don\u0027t have to tell me. My Venus looks like the Virgin and the Virgin looks like the Venus and so they say of me. But my patrons pay me.\" \"Listen to your patrons,\" I said. I wanted so to clasp his arms. I wanted to gently shake him so that he would never forget my words. \"Do what they tell you. Both paintings are magnificent. Both paintings are finer than anything I\u0027ve ever seen.\" He couldn\u0027t know what I meant by such words. I couldn\u0027t tell him. I stared at him, and for the first time I saw a little apprehension in him. He had begun to notice my skin, and perhaps my hands. It was time to leave him before he became even more suspicious, and I wanted him to remember me kindly and not with fear. I took out another purse which I had brought with me. It was full of gold florins. He gestured to refuse it. In fact, he gave me a very stubborn refusal. I placed it on the table. For a moment we merely looked at each other. \"Good-bye, Sandro,\" I said. \"Marius, was it? I\u0027ll remember you.\" I made my way out the front door and into the street. I hurried for the space of two blocks and then I stopped, breathing too hurriedly, and it seemed a dream that I had been with him, that I had seen such paintings, that such paintings had been created by man. I didn\u0027t go back to my rooms in the palazzo. When I reached the vault of Those Who Must Be Kept, I fell down in a new kind of exhaustion, crazed by what; I had beheld. I couldn\u0027t get the impression of the man out of my mind. I couldn\u0027t stop seeing him with his soft dull hair and sincere eyes. As for the paintings, they haunted me, and I knew that my torment, my obsession, my complete abandonment to the love of Botticelli had only just begun.","sourceLink":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8/page-15.html","bookId":2594,"book":{"id":2594,"title":"Blood And Gold (The Vampire Chronicles #8)","description":"Storyline: Blood And Gold (The Vampire Chronicles #8) Here is the gorgeous and sinister story of Marius, patrician by birth, scholar by choice, one of the oldest vampires of them all, which sweeps from his genesis in ancient Rome, in the time of the Emperor Augustus, to his meeting in the present day with a creature of snow and ice. Thorne is a Northern vampire in search of Maharet, his \u0027maker\u0027, the ancient Egyptian vampire queen who holds him and others in thrall with chains made of her red hair, \u0027bound with steel and with her blood and gold\u0027. When the Visigoths sack his city, Marius is there; with the resurgence of the glory that was Rome, he is there, still searching for his lost love Pandora, but bewitched in turn by Botticelli, the Renaissance beauty Bianca, with her sordid secrets, and the boy he calls Amadeo (otherwise known as the Vampire Armand). Criss-crossing through the stories of other vampires from Rice\u0027s glorious Pantheon of the undead, haunted by Pandora and by his alter ego Mael, tracked by the Talamasca, the tale of Marius, the self-styled guardian of \u0027those who must be kept\u0027 is the most wondrous and mind-blowing of them all.","cover":"https://allnovel.net/images/blood-and-gold-the-vampire-chronicles-8.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:21:53 PM"}}
