{"id":96735,"no":33,"title":"Page 33","content":"33\n FOR THREE LONG NIGHTS I pleaded with her not to go as she made her preparations. I went down on my knees. I swore to her that I had said only what needed to be said to make Pandora remain with me.\n I told her in every way I knew how that I loved her, and would never have abandoned her.\n I told her that she would never be able to survive alone, and that I feared for her.\n But nothing would turn her from her decision.\n Only on the beginning of the third night did I realize that she was really going. Up until then, I had thought that such was absolutely inconceivable. I couldn\u0027t lose her. No, such a thing could not happen.\n At last, I begged her to sit down and listen to me as I poured out my honest heart, confessing every bad thing which I had said, every cheap denial of her which had come from my lips, every desperate foolish thing I\u0027d said to Pandora.\n \"But what I want now is to talk of you and me,\" I said, \"and how it\u0027s always been between us.\"\n \"Yes, you may do that if you wish,\" she said, \"if it makes the pain less for you, but Marius, I am going.\"\n \"You know how it was with me and Amadeo,\" I said. \"I took him into my house when he was very young and gave him the Blood when mortality gave me no quarter. We were Master and pupil always, and there was mockery and a dark division. Perhaps you never saw this, but it was there, I assure you.\"\n \"I saw it,\" she said. \"But I knew your love was greater.\"\n \"And so it was,\" I said. \"But he was a child, and my man\u0027s heart always knew there was something finer and greater. Much as I cherished him, much as the mere sight of him delighted me, I could not confide to him my worst fears or pains. I could not tell him the tales of my life. They were too big for him.\"\n \"I understand you, Marius,\" she said gently. \"I always have.\"\n \"And Pandora. You saw it with your own eyes. The bitter quarrel again, just as it had been so many centuries ago, the bitter fighting in which no real truth can be discovered.\"\n \"I saw it,\" she said in her quiet way. \"I follow your meaning.\"\n \"You saw her fear of the Mother and the Father,\" I pleaded. \"You heard her say that she couldn\u0027t come into the house. You heard her speak of her fear of everything.\"\n \"I did,\" she answered.\n \"And what was this one night between me and Pandora but misery, as it had been long ago, misery and misunderstanding.\"\n \"I know, Marius,\" she answered.\n \"But Bianca, what has it always been with you and me but harmony?\n Think of our long years when we dwelt in the shrine, and went out on the night winds where I could carry us. Think of the quiet between us, or the long conversations in which I talked of so many things and you listened. Could two beings have been closer than we were?\"\n She bowed her head. She didn\u0027t answer.\n \"And these last years,\" I pleaded. \"Think of all the pleasures we have shared, our secretive hunting in the forests, our visits to the country festivals, our quiet attendance in the great cathedrals when the candles burn and the choirs sing, our dancing at the Court Balls. Think of all of it.\"\n \"I know, Marius,\" she said. \"But you lied to me. You didn\u0027t tell me why we were coming to Dresden.\"\n \"I confess, it\u0027s true. Tell me what I can do to make up for it?\"\n \"Nothing, Marius,\" she answered. \"I\u0027m going.\"\n \"But how will you live? You can\u0027t live without me. This is madness.\"\n \"No, I shall live quite well,\" she said. \"And I must go now. I must travel many miles before dawn.\"\n \"And where will you sleep? \"\n \"That is my worry now.\"\n I was almost on the point of frenzy.\n \"Don\u0027t follow me, Marius,\" she said, as if she could read my mind which she could not.\n \"I can\u0027t accept this,\" I responded.\n A silence fell between us, and I realized she was looking at me, and I looked at her, unable to hide a particle of my unhappiness.\n \"Bianca, don\u0027t do this,\" I pleaded.\n \"I saw your passion for her,\" she whispered, \"and I knew that in a moment you would cast me aside. Oh, don\u0027t deny it. I saw it. And something in me was crushed. I couldn\u0027t protect that thing. I couldn\u0027t prevent its destruction. We were too close, you and I. And though I have loved you with my whole soul, so I believed I knew you completely, I didn\u0027t know the being you were with her. I didn\u0027t know the being whom I saw in her eyes.\"\n She rose from the chair and moved away from me. She looked out the window.\n \"I wish I had not heard all those many words,\" she said, \"but we have such gifts, we blood drinkers. And do you think I don\u0027t realize that you would never have made me your child except for the fact that you needed me? Had you not been burnt and helpless, you would never have given me the Blood.\"\n \"Will you listen to me when I tell you that\u0027s not so? When first I saw you I loved you. It was only out of respect for your mortal life that I didn\u0027t share these cursed gifts with you! It was you who filled my eyes and heart before I ever found Amadeo. I swear this to you. Don\u0027t you remember the portraits I painted of you? Do you remember the hours I spent in your rooms? Think now on all that we\u0027ve given each other.\"\n \"You deceived me,\" she said.\n \"Yes, I did,\" I said. \"And I admit it, and I swear that I shall never do it again. Not for Pandora or for anyone.\"\n On and on I pleaded.\n \"I can\u0027t stay with you,\" she said. \"I must go now.\"\n She turned around and looked at me. She seemed wrapped in quiet and resolution.\n \"I\u0027m begging you,\" I said again. \"Without pride, without reserve, I\u0027m begging you, don\u0027t leave me.\"\n \"I must go,\" she said. \"And now, please, let me go down to take my leave of the Mother and the Father. I would do this alone if you would allow it.\"\n I nodded.\n It was a long time before she came up from the shrine. She told me quietly that she would leave on the following sunset.\n And true to her word, she did, her coach and four pulling out of the gates, as she began her journey.\n I stood at the top of the stairs watching her go. I stood listening until the coach was deep into the forest. I stood unbelieving and unable to accept that she was gone from me.\n How could this horrid disaster have occurred\u0026iexcl;\u0026ordf;that I lose Pandora and Bianca both? That I should be alone? And I was powerless to stop it.\n For many months after that, I could scarcely believe what had befallen me.\n I told myself that a letter would soon come from Pandora, or that she herself would return with Arjun, that Pandora would will it so.\n I told myself that Bianca would realize that she could not exist without me. She would come home, eager to forgive me, or she would send some hasty letter asking me to come to her.\n But these things did not happen.\n A year passed and these things did not happen.\n And another year and then fifty. And these things did not happen.\n And all the while, though I moved deeper into the woods surrounding\n Dresden, in another more fortified castle, I remained near at hand in the hopes that one or both of my loves would come back to me.\n For a half century I remained, waiting, not believing, and weighed down with a sorrow I couldn\u0027t share with anyone.\n I think I had ceased to pray in the shrine though I tended it faithfully.\n And I had begun, in a confidential manner, to talk to Akasha. I had begun to tell her my woes in a more informal manner than before, to tell her of how I had failed with those whom I had loved.\n \"But I shall never fail with you, my Queen,\" I said, and I said it often.\n And then as the 17008 commenced, I prepared to make a daring move to an island where I would rule supreme in the Aegean Sea, surrounded by mortals who would easily accept me as their lord, in a stone house which I had prepared for me by a host of mortal servants.\n All who have read The Vampire Lestat\u0027s tale of his life know of this immense and unusual place because he vividly described it. It far exceeded in grandeur any other palace in which I had ever lived, and its remoteness was a challenge to my ingenuity.\n But I was most purely alone now, alone as I had ever been before the love of Amadeo, or Bianca, and I had no hope of an immortal companion. And perhaps in truth I wanted none.\n It had been centuries since I had heard of Mael. I knew nothing of Avicus or Zenobia. I knew nothing of any other Child of the Millennia.\n I wanted only a great and gorgeous shrine for the Mother and Father, and as I have said, I spoke to Akasha constantly.\n But before I go on to describe this last and most important of all my European dwellings, I must include one last tragic detail in the story of those who were lost to me.\n As my many treasures were moved to this Aegean palace, as my books, my sculptures, my fine tapestries and rugs and other such were shipped and uncrated by unsuspecting mortals, there came to light one final piece of the story of my beloved Pandora.\n In the bottom of a packing case, one of the workers discovered a letter, written on parchment, and folded in half, and addressed quite simply to Marius.\n I was on the terrace of this new house, gazing out at the sea and over the many small islands that surrounded me, when the letter was brought to me.\n The page of parchment was thick with dust, and as soon as I opened it, I read a date inscribed in old ink which affirmed that it had been written the night I parted with Pandora.\n It was as if the fifty years separating me from that pain meant nothing.\n My beloved Marius,\n It is almost dawn and I have only a few moments in which to write to you. As we have told you, our coach will leave within the hour carrying us away and towards the eventual destination of Moscow.\n Marius, I want nothing more than to come to you now, but I cannot do it. I cannot seek shelter in the same house with the Ancient Ones.\n But I beg you, my beloved, please come to Moscow. Please come and help me to free myself from Arjun. Later you can judge me and condemn me.\n I need you, Marius. I shall haunt the vicinity of the Czar\u0027s palace and the Great Cathedral until you come.\n Marius, I know I ask of you that you make a great journey, but please come.\n Whatever I have said of my love of Arjun, I am his slave now too completely, and I would be yours again.\n Pandora.\n For hours I sat with the letter in my hand, and then slowly I rose and went to my servants and asked them that they tell me where the letter had been found.\n It had been in a packing case of books from my old library.\n How had I failed to receive it? Had Bianca hidden this letter from me? That I couldn\u0027t believe. It seemed some simpler more haphazard cruelty had taken place\u0026iexcl;\u0026ordf;that a servant had laid it on my desk in the early hours, and I myself had swept it aside into a heap of books without ever seeing it.\n But what did it matter?\n The awful damage was done.\n She had written to me, and I had not known it. She had begged me to come to Moscow and I, not knowing, had not gone. And I did not know where to find her. I had her avowal of love, but it was too late.\n In the following months I searched the Russian capital. I searched in the hope that she and Arjun had for some reason made their home there.\n But I found no trace of Pandora. The wide world had swallowed her as it had swallowed my Bianca.\n What more can I say to reveal the anguish of these two losses\u0026iexcl;\u0026ordf;that of Pandora whom I\u0027d sought for so long, and my sweet and lovely Bianca?\n With these two losses my story comes to a close.\n Or rather I should say we have come full circle.\n We now return to the story of the Queen of the Damned and of The Vampire Lestat who waked her. And I shall be brief as I revisit that story. For I think I see most clearly what it is that would heal my miserable soul more than anything. But before I can move on to that, we must revisit Lestat\u0027s antics and the story of how I lost my last love, Akasha. \n","sourceLink":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8/page-33.html","bookId":2594,"book":{"id":2594,"title":"Blood And Gold (The Vampire Chronicles #8)","description":"Storyline: \n Blood And Gold (The Vampire Chronicles #8) \n Here is the gorgeous and sinister story of Marius, patrician by birth, scholar by choice, one of the oldest vampires of them all, which sweeps from his genesis in ancient Rome, in the time of the Emperor Augustus, to his meeting in the present day with a creature of snow and ice. Thorne is a Northern vampire in search of Maharet, his \u0027maker\u0027, the ancient Egyptian vampire queen who holds him and others in thrall with chains made of her red hair, \u0027bound with steel and with her blood and gold\u0027. When the Visigoths sack his city, Marius is there; with the resurgence of the glory that was Rome, he is there, still searching for his lost love Pandora, but bewitched in turn by Botticelli, the Renaissance beauty Bianca, with her sordid secrets, and the boy he calls Amadeo (otherwise known as the Vampire Armand). Criss-crossing through the stories of other vampires from Rice\u0027s glorious Pantheon of the undead, haunted by Pandora and by his alter ego Mael, tracked by the Talamasca, the tale of Marius, the self-styled guardian of \u0027those who must be kept\u0027 is the most wondrous and mind-blowing of them all.\n \n","cover":"https://allnovel.net/images/blood-and-gold-the-vampire-chronicles-8.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:21:53 PM"}}
