{"id":96707,"no":5,"title":"Page 5","content":"THE STORY\n 5\n As I HAVE TOLD YOU, I was born in the Roman times, in the age of Augustus when the Roman Empire was immense and powerful, though the Northern tribes of barbarians who would eventually overrun it had long been fighting on its Northern frontiers.\n Europe was a world of big and powerful cities just as it is now.\n As for me, as I\u0027ve said I was a bookish individual, and it had been my bad luck to be stolen from my world, taken into Druid precincts and there delivered to a blood drinker who believed himself to be a sacred God of the Grove and gave me nothing but superstition along with the Dark Blood.\n My journey to Egypt to find the Mother was for myself. What if this fire described by the blackened and suffering god should come again?\n Well, I found the Divine Pair and I stole them from those who had long been their guardians. I did it not only to possess the Sacred Core of the Divine Queen but because of my love of Akasha, my belief that she had spoken to me and commanded me to rescue her, and because she had given me her Precious Blood.\n Understand there was nothing as strong as that primal fount. The blood rendered me a formidable blood drinker who could fight off any of the old burnt gods who came after me in the years to come.\n But you must also understand: no religious impulse guided me. I had thought the \"god\" of the Druid woods to be a monster. And I understood that in her own way Akasha was a monster. I was a monster as well. I had no intention of creating a devotion for her. She was a secret. And from the moment she came into my hands she and her consort were most truly Those Who Must Be Kept.\n This did not stop me from adoring her in my heart, and creating the most lavish shrine for her, and dreaming that, having spoken to me once with the Mind Gift, she would speak to me again.\n The first city to which I took the mysterious pair was Antioch, a most marvelous and interesting place. It was in the East as we said in those days, yet it was a Roman city and had been shaped by the tremendous influence of Hellenism\u0026iexcl;\u0026ordf;that is, the philosophy and ideas of the Greeks. It was a city of new and splendid Roman buildings, and it was a city of great libraries and schools of philosophy, and though I haunted it by night, the ghost of my former self, there were brilliant men to be spied upon and wondrous things to be heard.\n Nevertheless my first years as the keeper of the Mother and the Father were bitter in my loneliness, and the silence of the Divine Parents struck me often as particularly cruel. I was pitifully ignorant as to my own nature, and perpetually brooding on my eternal fate.\n Akasha\u0027s silence struck me as terrifying and confusing. After all, why was I asked by Akasha to take her out of Egypt if she meant only to sit upon her throne in eternal stillness? It seemed sometimes that self-destruction was preferable to the existence I endured.\n Then came the exquisite Pandora into my midst, a woman I\u0027d known since her girlhood in Rome. Indeed, I\u0027d once gone to her father to seek her hand in marriage when she\u0027d been only a precocious child. And here she was in Antioch, as lovely in the prime of life as she\u0027d been in her youth, flooding my thoughts with impossible desire.\n Our lives became fatally intertwined. Indeed the speed and violence with which Pandora was made a blood drinker left me weak with guilt and confusion. But Pandora believed that Akasha had willed our union; Akasha had hearkened to my loneliness; Akasha had drawn Pandora to me\n If you saw our council table, round which we sat when Akasha rose, then you have seen Pandora, the tall white-skinned beauty with the distinct rippling brown hair, one who is now a powerful Child of the Millennia just as you are and just as I am.\n Why am I not with her now, you may ask? What is it in me that will not acknowledge my admiration for her mind, her beauty, her exquisite understanding of all things?\n Why can\u0027t I go to her!\n I don\u0027t know. I know only that a terrible anger and pain divides us just as it did so many years ago. I cannot admit how much I have wronged her. I cannot admit how much I have lied about my love of her and my need of her. And this need, perhaps this need is the thing which keeps me at a distance, where I am safe from the scrutiny of her soft and wise brown eyes.\n It\u0027s also true that she judges me harshly for things I have lately done. But this is too difficult to explain.\n In those ancient times, when it was scarce two centuries that we lived together, it was I who destroyed our union in a foolish and dreadful way. We had spent almost every night of our lives quarreling, and I could not admit her advantages, and her victories, and it was as the result of my weakness that I foolishly and impetuously left her when I did.\n This was the single worst mistake of all my long years.\n But let me tell quickly the little tale of how we came to be divided by my bitterness and pride.\n Now as we kept the Mother and the Father, the old gods of the dark groves of the North woods died out. Nevertheless an occasional blood drinker would discover us and come to press his suit for the blood of Those Who Must Be Kept.\n Most often such a monster was violent and easily dispatched in the heat of anger, and we would return to our civilized life.\n One evening, however, there appeared in our villa outside Antioch a band of newly made blood drinkers, some five in number, all dressed in simple robes.\n I was soon amazed to discover that they perceived themselves as serving Satan within a Divine Plan that held the Devil to be equal in power to the Christian God.\n They did not know of the Mother and the Father, and understand, the shrine was in that very house, down, beneath the floor. Yet they could hear no inkling of the Divine Parents. They were far too young and too innocent. Indeed, their zeal and sincerity was enough to break one\u0027s heart.\n But though deeply touched by their mishmash of Christian and Persian ideas, of their wild notions, and by their curious appearance of innocence, I was also horrified by the fact that this was a new religion among the blood drinkers, and they spoke of other adherents. They spoke of a cult.\n The human in me was revolted; and the rational Roman was more confused and alarmed than I can express.\n It was Pandora who quickly brought me to my senses and gave me to know that we must slaughter the whole band. Were we to let them go, others would come to us, and soon the Mother and Father might fall into their hands.\n I, who had slain old pagan blood drinkers with ease, seemed somehow unable to obey her, perhaps because I realized for the first time that if we remained in Antioch, if we maintained our household and our lives, more and more blood drinkers would come and there would be no end to killing them in order to protect our fine secret. And my soul suddenly could not endure this possibility. Indeed I thought once more of death for myself and even for Those Who Must Be Kept.\n We slaughtered the zealots. It was a simple thing to do for they were so young. It took only moments with torches and with our swords. We burnt them to ashes and then scattered those ashes as, I\u0027m sure you know, must be done.\n But after it was over, I lapsed into a terrible silence and for months would not leave the shrine. I abandoned Pandora for my own suffering.\n I couldn\u0027t explain to her that I had foreseen a grim future, and when she had gone out to hunt the city or to do whatever amused her, I went to Akasha.\n I went to my Queen. I knelt before her and I asked her what she meant for me to do.\n \"After all,\" I said, \"these are your children, are they not? They come in new battalions and they don\u0027t know your name. They likened their fangs to those of serpents. They spoke of the Hebrew prophet Moses, holding up the serpent staff in the desert. They spoke of others who might come.\"\n No answer came from Akasha. No real answer was to come from Akasha for two thousand years.\n But I was only beginning my awful journey then. And all I knew in those anxious moments was that I had to conceal my prayers from Pandora, that I couldn\u0027t let her see me\u0026iexcl;\u0026ordf;Marius, the philosopher\u0026iexcl;\u0026ordf;on bended knee. I went on with my praying, I went on with my feverish worship. And as always happens when one prays to an immobile thing, the light played upon the face of Akasha; the light gave some semblance of life.\n Meantime, Pandora, as embittered by my silence as I was by Akasha\u0027s silence, became utterly distraught.\n And one night she hurled at me a simple household insult, \"Would that I were rid of them and rid of you.\"\n She left the house and she did not return the next night or the night after that.\n As you can see, she was merely playing the same game with me that I had played with her. She refused to be a witness to my hardness. But she could not understand how desperately I needed her presence, and even her vain pleas.\n Oh, it was so shamefully selfish of me. It was such a needless disaster but powerfully angry with her, I took the irrevocable step of arranging for my departure from Antioch by day.\n Indeed, by the light of the dim lamp, so as not to arouse my mortal agents, I gave orders for myself and Those Who Must Be Kept to be transported in three immense sarcophagi to Rome by sea. I abandoned my Pandora. I took with me all that was mine and left her only the empty villa, with her own possessions strewn rather carelessly and insultingly around it. I left the only creature in the world who could have patience with me, who could give me understanding, and who had done so, no matter how often or how hard we had fought.\n I left the only being who knew what I was!\n Of course I didn\u0027t know the consequences. I didn\u0027t realize that I would not find Pandora for hundreds of years. I didn\u0027t know that she would become a goddess in my mind, a being as powerful in my memory as Akasha was to me night after night.\n You see, it was another lie, like unto the lie I\u0027ve told about Akasha. I loved Pandora and I needed her. But in our verbal combat, I had always, no matter how emotional, played the role of the superior mind who was in no need of her seemingly irrational discourse and always evident affection. I remember the very night that I gave her the Dark Blood how she had argued with me.\n She said, \"Don\u0027t make a religion of reason and logic. Because in the passage of time reason may fail you and when it does, you may find yourself taking refuge in madness.\" I was so offended by these words coming from the mouth of this beautiful woman whose eyes so entranced me that I could scarce follow her thoughts.\n Yet in those months of silence, after we had slain the New Believers, this was precisely what had happened. I had lapsed into a form of badness and refused to speak a word.\n And only now can I admit the full folly of it, that my own weakness was unsupportable to me, and that I could not endure having her as the witness of the melancholy which shrouded my soul.\n Even now, I cannot have her as a witness to my suffering. I live here alone, with Daniel. I speak to you because you are a new friend and can take from me fresh impressions and fresh suggestions. You don\u0027t look at me with old knowledge and old fear. But let me go on with my tale.\n Our ship arrived at the port of Ostia in good order, and once we had been transported in three sarcophagi to the city of Rome, I rose from my \"grave,\" made arrangements for an expensive villa just outside the city walls, and arranged an underground shrine for Those Who Must Be Kept in the hills well away from the house.\n A great guilt weighed me down that I had placed them at such a distance from the place in which I lived, read my books, and took to my crypt at night. After all, they had been within my very house in Antioch, though safely beneath it, and now they were some miles away.\n But I wanted to live close to the great city, and indeed within a few short years, the walls of Rome were built out and around my house so that Rome enclosed it. I had a country villa in town.\n It was no safe place for Those Who Must Be Kept. So it proved most wise that I had created their shrine well away from the burgeoning city, and settling into my villa, I played \"a Roman gentleman\" to those around me, the loving master of several simple-minded and gullible slaves.\n Now understand that I had been away from Rome for over two hundred years.\n Glorying in the cultural riches of Antioch, a Roman city, yes, but an Eastern city, listening to her poets and teachers in the Forum, roaming her libraries by torchlight, I had been horrified by descriptions of the latest Roman Emperors who had disgraced the title altogether by their antics and inevitably been murdered by their bodyguards or their troops.\n But I was far wrong that the Eternal City had fallen into degradation.\n Great Emperors of the past hundred years there had been such as Hadrian and Marcus Aurelius, and Septimius Severus, and there had been an enormous number of monumental buildings added to the capital as well as a great increase of population. Not even a blood drinker such as myself could have inspected all of Rome\u0027s temples, amphitheaters and baths.\n Indeed Rome was more than likely the largest and most impressive city in the world. Some two million people made up the populace, many of the plebs, as the poor were called, receiving a daily ration of corn and wine.\n I yielded to the spell of the city immediately. And shutting out the horrors of the Imperial quarrels and continuous war along the frontiers\n I diverted myself by studying the intellectual and aesthetic handiwork of mankind as I\u0027ve always done.\n Of course I went immediately to play the hovering ghost about the town houses of my descendants, for I had kept some track of them, though never admitting it to Pandora, and I found them to be good members of the old Senatorial class, striving desperately to maintain some order in government, while the army elevated Emperor after Emperor in a desperate attempt to secure power for this or that faction in this or that far-flung place.\n It broke my heart actually to see these young men and women whom I knew to have come down from my uncles and aunts, from my nieces and nephews, and it was during this period that I broke my record of them forever, though why precisely I cannot say.\n It was a time for me of breaking all ties. I had abandoned Pandora. I had put Those Who Must Be Kept at some remove from me, and now I came home one night, from spying upon a supper party at the house of one of my many descendants, and I took out of a wooden chest all the scrolls in which I had written the names of these young people, gleaned from letters to various agents, and I burnt them, feeling rather wise in my monstrosity, as though this would prevent me from further vanity and pain.\n After that, I haunted the precincts of strangers to gain knowledge. With vampiric dexterity I slipped into shadowy gardens and listened at the open doorways of the dimly lighted villas as those inside talked softly over dinner or listened to the delicate music of a young boy accompanying himself with a lyre.\n I found the old conservative Romans very touching, and though the libraries were not as good here as they had become in Antioch, I found much to read. There were of course schools of philosophy in Rome, and though they too were not as impressive as those in Antioch, I was interested in listening to what I could.\n But understand, I did not really enter into the mortal world. I made no friendships with mortals. I did not converse with them. I only read them, as I had always done in Antioch. I did not believe then could penetrate with any true success into their natural realm.\n As for my blood thirst, I hunted furiously in Rome. I kept to the Evil Doer always, which was a simple matter, I can assure you, but I fed my hunger far more than I needed to feed it. I bared my fangs cruelly to those I killed. The huge population never left me hungry. I was more the blood drinker than ever in my existence up to that time.\n It was a challenge to me to do it properly, to sink my teeth but once and cleanly, and to spill not a drop as I took the death along with the blood.\n There was no need in such a place as Rome of those times to hide the bodies for fear of discovery. Sometimes I threw them in the Tiber. Sometimes I did nothing but leave them in the street. I loved particularly to kill in taverns which is something I like even now, as you know.\n There is nothing like the long passage through the damp dark night, and then the sudden opening of the door of the tavern upon an entire little universe of light and warmth and singing and laughing humans. I found taverns very enticing indeed.\n Of course, all this ravening, this endless killing\u0026iexcl;\u0026ordf;it was on account of my grief for Pandora, and it was because I was alone. Who was there to restrain me? Who was there to outdo me? No one at all.\n And understand, during the first few months, I might have written to her! There was surely a chance that she had remained in Antioch, in our house, waiting for me to come to my senses, but I did no such thing.\n A fierce anger, the very anger I fight now, welled up in me, and it made me weak, as I\u0027ve already told you. I couldn\u0027t do what I had to do\u0026iexcl;\u0026ordf;bring her back to me. And sometimes my loneliness pushed me to take three and four victims in a night, until I was spilling blood I couldn\u0027t drink.\n Sometimes in the early hours of the morning my rage was quieted, and I went back to my historical writing, something which I had begun in Antioch and never revealed to a single soul.\n I described what I saw in Rome of progress or failure. I described the buildings in ponderous detail. But then there came nights when I thought that everything I\u0027d written was useless. After all, what was the purpose? I could not enter these descriptions, these observations, these poems, these essays, into the mortal world!\n They were contaminated in that they came from a blood drinker, a monster who slew humans for his own survival. There was no place for the poetry or history which had come from a greedy mind and heart.\n And so I began to destroy not only my fresh writings, but even the old essays which I had written in Antioch in the past. I took the scrolls out of the chests one by one and burnt them as I had burnt the records of my family. Or I merely kept them, locked up tight, and away from my eyes, so that nothing I\u0027d written could spark in me anything new.\n It was a great crisis of the soul.\n Then something happened which was totally unforeseen.\n I came upon another blood drinker\u0026iexcl;\u0026ordf;indeed I came upon two of them in dark streets of the late night city as I was coming down a hill.\n The moon had gone behind the clouds at that moment, but naturally\n I could see quite perfectly with my preternatural eyes.\n The two creatures were approaching me rapidly with no knowledge that I stood against the wall, trying not to block their path.\n At last the first of the pair lifted his head and I recognized the face at once. I knew the hawk nose and deep-set eyes. I knew the gaunt cheeks. In fact I recognized everything about him, the slope of his shoulders, his long blond hair, and even the hand that held the cloak at his throat.\n This was Mael, the Druid priest who had long ago captured me and taken me prisoner, and fed me alive to the burnt and dying God of the Grove. This was Mael who had kept me in captivity for months as he prepared me for the Dark Magic. This was Mael, the pure of heart, and the fearless one, whom I had come to know so very well.\n Who had made Mael a blood drinker? In what grove had Mael been consecrated to his old religion? Why was he not shut up in some oak tree in Gaul, there to preside over the feasts of his fellow Druids?\n Our eyes met, but I experienced no alarm. In fact, I had assessed his strength and found it wanting. He was as old as I was, yes, that was plain, but he had not drunk as I had from Akasha. I was by far the stronger. There was nothing he could do to me.\n And so at this moment, I looked away and to the other blood drinker who was much taller, and infinitely stronger, and whose skin was a dark-brown color, surely from having been burnt in the Terrible Fire.\n This one had a large face of rather agreeable and open features, with large questioning black eyes, a thick and well-proportioned mouth, and a head of wavy black hair.\n I looked back to this blond-headed one who had taken my mortal life with such religious conviction.\n It occurred to me that I could destroy him by ripping his head from his body, and by keeping possession of his head and then placing it somewhere in my garden where the sun would inevitably find it and burn it black. It occurred to me that I ought to do this, that this creature deserved no better. Yet there were other thoughts working in my mind.\n I wanted to talk to this being. I wanted to know him. I wanted to know the other being with him, this brown-skinned blood drinker who stared at me with such a mixture of innocence and warmth. This blood drinker was much older. This blood drinker was like no being who had ever come at me in Antioch, crying for the Mother and Father. This being was an entirely new thing.\n It was in this moment that I understood perhaps for the first time that anger was weak. Anger had robbed me of Pandora over a sentence of less than twenty words. Anger would rob me of Mael if I destroyed him. Also, I thought, I can always delay the murder. I can talk with Mael now. I can let my mind have this company it craves and I can always kill him later on.\n But I\u0027m sure you know such reasoning is false, because once we grow to love a person we are not likely to want that person\u0027s death.\n As these thoughts raced through my mind, words suddenly spilled from my lips.\n \"I\u0027m Marius, don\u0027t you remember me?\" I said. \"You took me to the Grove of the Old God, you gave me to him, and I escaped.\" I was appalled at the hostility with which I\u0027d spoken.\n He cloaked his thoughts completely, and I couldn\u0027t tell whether he had known me by my appearance or not. He spoke quickly in Latin.\n \"Yes, you abandoned the grove. You abandoned all those who worshiped you. You took the power given you, and what did you leave for the Faithful of the Forest? What did you give back?\"\n \"And you, my precious Druid priest,\" I said, \"do you serve your old gods? Is that what has brought you to Rome?\" My voice was quaking with anger, and I felt the weakness of it. I struggled to regain clarity and strength. \"When I knew you, you were pure of heart. Seldom have I ever known any creature more deluded, more given over to comforts and illusions of religion as you were.\" I stopped. I had to check myself, and I did.\n \"The old religion is gone,\" he said furiously. \"The Romans have taken even our most secret places. Their cities are everywhere. And thieving barbarians swoop down upon us from across the Danube. And the Christians, the Christians come into places where the Romans are not. There is no stopping the Christians.\"\n His voice grew louder, even though it had taken on the tone of a whisper.\n \"But it was you, Marius,\" he said, \"you, who corrupted me. It was you, Marius, who poisoned me, it was you who divided me from the Faithful of the Forest, you who gave me dreams of greater things!\"\n He was as angry as I was. He was trembling. And as often happens with two people who are quarreling, this anger produced a good calm in me. I was able to sink my enmity down into myself with that little resolve, You can always kill him later, and so I went on.\n The other creature looked quite surprised by all this and fascinated with an almost childlike expression on his face.\n \"What you\u0027re saying is nonsense,\" I answered. \"I ought to destroy you. It would be an easy thing for me to do.\"\n \"Very well then, try,\" he answered.\n The other one reached from behind and put his hand on that of Mael.\n \"No, listen to me, both of you,\" he said in a kindly rather deep voice. \"Don\u0027t go on with this quarrel. However we came to the Dark Blood, either through lies or violence, it has made us immortal. Are we to be so ungrateful?\"\n \"I\u0027m not ungrateful,\" I said, \"but I owe my debt to fate, not to Mael. Nevertheless, I\u0027m lonely for your company. That\u0027s the truth of it. Come to my house. I\u0027ll never harm anyone who comes as a guest under my roof.\"\n I had quite surprised myself by this little speech but it was the truth. \"You have a house in this city?\" asked Mael. \"What do you mean by a house?\"\n \"I have a house, a comfortable house. I bid you to come and talk to me. I have a pleasant garden with beautiful fountains. I have slaves. They are simple-minded. The light is pleasant. The garden is full of night-blooming flowers. Come.\"\n The one with the black hair was openly surprised as he had been before.\n \"I want to come,\" he said, glancing at Mael, though he still stood behind him. His voice had an authority to it, a pure strength, though it was soft.\n Mael was rigid and helpless in his anger. With his hawk nose and frightful eyes, he reminded me of a wild bird. Men with such noses always do. But in truth, he possessed a rather unusual beauty. His forehead was high and clear, and his mouth was strong.\n But to go on with my tale, it was only now that I noticed that both men wore rags like beggars. They were barefoot, and though blood drinkers are never truly soiled, for no soil clings to them, they were unkempt.\n Well, I could soon remedy that if they would allow. I had trunks of garments as always. Whether I went out to hunt or to study some fresco in a deserted house, I was a well-dressed Roman, and often carried dagger and sword.\n At last they agreed to come, and with a great act of will, I went ahead, turning my back on them to lead them, using the Mind Gift to maximum effect to watch over them that neither tried to strike out at me.\n Of course I was profoundly grateful that Those Who Must Be Kept were not in the house where either of these two might have detected their powerful heartbeats, but I could not allow myself to visualize these beings. On we walked.\n Finally, they came into my house, looking about themselves as though they were among miracles when all that I possessed were the simple furnishings of a rich man. They gazed hungrily at the bronze oil lamps that filled the marble-floored rooms with brilliant light, and the couches and chairs they hesitated to touch.\n I cannot tell you how often this has happened me over the centuries, that some wandering blood drinker, bereft of all human attachments, has come into my house to marvel at simple things.\n This is why I had a bed for you when you came here. That is why I had clothes.\n \"Sit down,\" I said to them, \"there\u0027s nothing here that can\u0027t be cleaned or thrown away. I insist that you be comfortable. I wish we had some gesture that I might give, equal to that which mortals make when they offer guests a cup of wine.\"\n The larger taller man was the first to be seated in a chair, rather than a couch. Then I followed taking a chair as well, and bidding Mael please to be seated to my right.\n I could see now quite clearly that the bigger blood drinker possessed infinitely more power than Mael. Indeed he was much older. He was older than me. That was why he had healed after the Terrible Fire, though that had been two hundred years ago, I had to admit. But I sensed no menace from this creature, and then quite unexpectedly, indeed, silently, he gave me his name.\n \"Avicus.\"\n Mael gazed at me with the most venomous expression. He did not sit back as he might have done, but kept himself bitterly erect and ready as if for a brawl.\n I sought to read his mind but this was useless.\n As for me, I considered myself the consummate master of my hatred and my rage, but when I saw the anxious look on the face of Avicus I thought perhaps I was wrong.\n Suddenly, this blood drinker spoke.\n \"Lay down your hatred, each for the other,\" he said in Latin, though he spoke with an accent, \"and perhaps a battle of words will put all to right.\"\n Mael didn\u0027t wait for my agreement to this plan.\n \"We brought you to the grove,\" he told me, \"because our god told us we must do this. He was burnt and dying, but he would not tell us why. He wanted you to go to Egypt, but he wouldn\u0027t tell us why. There must be a new god, he said, but he didn\u0027t tell us why.\"\n \"Calm yourself,\" said Avicus softly, \"so that your words truly speak for your heart.\" Even in his rags he looked rather dignified and curious as to what would be said.\n Mael gripped the arms of the chair and glared at me, his long blond hair hanging over his face.\n \"Bring a perfect human for the old god\u0027s magic, we were told. And that our legends told us was true. When an old god is weak there must be a new one. And only a perfect man can be given over to the dying god for his magic in the oak.\"\n \"And so you found a Roman,\" I said, \"in the prime of life, happy and rich, and dragged him off against his will. Were there no men among you who were fit and right for your own religion? Why come to me with your wretched beliefs? \"\n Mael wasn\u0027t slowed in the slightest. At once he continued.\n \" \u0027Bring me one who is fit,\u0027 said the god, \u0027one who knows the languages of all kingdoms!\u0027 That was his admonition. Do you know now long we had to search for such a man as you? \"\n \"Am I to feel sorry for you? \" I said sharply and foolishly.\n He went on.\n We brought you to the oak as we were told to do. Then when you came out of the oak, to preside over our great sacrifice, we saw that you had been made into a gleaming god of shimmering hair and eyes that frightened us.\n \"And without a word of protest, you raised your arms so that the Great Feast of Sanhaim could begin. You drank the blood of the victims given you. We saw you do it! The magic was restored in you. We felt we would prosper, and it was time to burn the old god as our legends told us we must do.\n \"It was then that you fled.\" He sat back in his chair as though this long speech had taken the strength out of him. \"You didn\u0027t return,\" he said disgustedly. \"You knew our secrets. But you didn\u0027t return.\" A silence fell.\n They didn\u0027t know of the Mother and the Father. They knew nothing of the old Egyptian lore. I was too relieved for a long moment to say anything. I felt more calm and controlled than ever. Indeed, it seemed rather absurd that we were having this argument, for as Avicus had said, we were immortal.\n But we were human still, each in his own way. Finally I realized that Mael was looking at me, and his eyes were as charged with rage as before. He looked pale, hungry, wild as I\u0027ve said. But both of these creatures were waiting upon me to speak or do something, and it did seem the burden lay with me. At last, I made a decision which seemed to me to be its own form of reckoning, and its own form of triumph.\n \"No, I didn\u0027t come back,\" I said to Mael squarely. \"I didn\u0027t want to be the God of the Grove. I cared nothing for the Faithful of the Forest. I made my choice to wander through time. I have no belief in your gods or your sacrifices. What did you expect of me?\" \"You took the magic of our god with you.\"\n \"I had no choice,\" I said. \"If I had left the old burnt god without taking his magic, you would have destroyed me, and I didn\u0027t want to die. Why should I have died? Yes, I took the magic that he gave me and yes, I presided over your sacrifices and then I fled as anyone of my nature would do.\"\n He looked at me for a long time, as if trying to decide whether or not I wanted to quarrel further.\n \"And what do I see now in you?\" I demanded. \"Haven\u0027t you fled your Faithful of the Forest? Why do I come upon you in Rome? \" He waited a long moment.\n \"Our god,\" he said, \"our old burnt god. He spoke of Egypt. He spoke of our bringing him one who could go down into Egypt. Did you go to Egypt? Did you seek there the Good Mother?\"\n I cloaked my mind as best I could. I made my face severe, and I tried to figure how much I should confess and why.\n \"Yes I went to Egypt,\" I said. \"I went to find the cause of the fire that had burnt the gods all through the North lands.\"\n \"And what did you find?\" he demanded.\n I glanced from him to Avicus and I saw that he too waited upon my answer.\n \"I found nothing,\" I responded. \"Nothing but burnt ones who pondered the same mystery. The old legend of the Good Mother. Nothing further. It is finished. There is no more to tell.\"\n Did they believe me? I couldn\u0027t tell. Both seemed to harbor their own secrets, their own choices made long ago.\n Avicus looked ever so slightly alarmed for his companion.\n Mael looked up slowly and said with anger,\n \"Oh, that I had never laid eyes upon you. You wicked Roman, you rich Roman with all your splendor and fine words.\" He looked about the house, at its wall paintings, at its couches and tables, at the marble floors.\n \"Why do you say this?\" I asked.\n I tried not to despise him but to see him, and understand him, but my hatred was too great.\n \"When I took you prisoner,\" he said, \"when I sought to teach you our poetry and our songs, do you remember how you tried to bribe me? You spoke of your beautiful villa on the Bay of Naples. You said that you would take me there if only I would help you escape. Do you remember these awful things?\"\n \"Yes, I remember,\" I said coldly. \"I was your prisoner! You had taken me deep into the forest against my will. What did you expect of me? And had you let me escape, I would have taken you to my house on the Bay of Naples. I would have paid my own ransom. My family would have paid it. Oh, it\u0027s too foolish to speak of these things.\"\n I shook my head. I grew too agitated. My old loneliness beckoned to me. I wanted silence in these rooms again. What need had I of these two?\n But the one called Avicus appealed to me silently with his expression.\n And I wondered who he might be.\n \"Please, keep your temper,\" said Avicus. \"I\u0027m the cause of his suffering.\"\n \"No,\" said Mael quickly. Fie glanced at his companion. \"That can\u0027t be.\"\n \"Oh, but it is,\" declared Avicus, \"and always has been, ever since I have you the Dark Blood. Gain the strength either to remain with me or to leave me. Things cannot remain as they are.\"\n He reached out and put his hand on his companion\u0027s arm. \"You\u0027ve found this strange being, Marius,\" he said, \"and you\u0027ve told Marius of the last years of your strong belief. You\u0027ve relived that awful misery. But don\u0027t be so foolish as to hate him for what happened. He was right to seek his freedom. As for us, the old faith died. The\n Terrible Fire destroyed it, and nothing more could be done.\" Mael looked as dejected as any creature I\u0027ve ever seen. Meantime my heart was fast catching up with my mind. I was thinking:\n Here are two immortals but we cannot solace one another; we cannot have friendship. We can only part after bitter words. And then I\u0027ll be alone again. I\u0027ll be proud Marius who left Pandora. I shall have my beautiful house and all my fine possessions to myself.\n I realized Avicus was staring at me, trying to probe my mind, but failing though his Mind Gift was quite terrifically strong. \"Why do you live as vagabonds? \" I asked.\n \"We don\u0027t know how to live as anything else,\" said Avicus. \"We\u0027ve never tried. We shy away from mortals, except when we hunt. We fear discovery. We fear fire.\" I nodded.\n \"What do you seek other than blood?\"\n A miserable expression passed over his face. He was in pain. He tried to hide it. Or perhaps he tried to make the pain go away.\n \"I\u0027m not sure that we seek anything,\" he said. \"We don\u0027t know how.\"\n \"Do you want to stay with me,\" I asked, \"and learn? \" I felt the boldness, the presumptuousness of this question, but the words had already been said.\n \"I can show you the Temples of Rome; I can show you the big palaces, the houses that make this villa appear quite humble indeed. I can show you how to play the shadows so that mortals never see you; how to climb walls swiftly and silently; how to walk the roofs at night all over the city, never touching the ground.\" Avicus was amazed. He looked to Mael. Mael sat slumped, saying nothing. Then he pulled himself up. In a weak voice he continued his condemnation. \"I would have been stronger if you hadn\u0027t told me all those marvelous things,\" he said, \"and now you ask if we want to enjoy the same pleasures, the pleasures of a Roman.\"\n \"It\u0027s what I have to offer,\" I said. \"Do what you wish.\"\n Mael shook his head. He began to speak again, for the benefit of whom I don\u0027t know.\n \"When it was plain that you wouldn\u0027t return,\" he said, \"they chose me. I was to become the god. But for this to happen we had to find a God of the Grove who had not been burnt to death by the Terrible Fire. After all, we had destroyed our own gentle god foolishly! A creature who had had the magic to make you.\"\n I gestured as if to say, It was indeed a shame.\n \"We sent word far and wide,\" he said. \"At last an answer came from Britain. A god survived there, a god who was most ancient and most strong.\"\n I looked to Avicus, but there was no change in his expression.\n \"However we were warned not to go to him. We were told that it was perhaps not something we should do. We were confused by these messages, and at last we set out for we felt that we must try.\"\n \"And how did you feel,\" I asked cruelly, \"now that you had been chosen, and you knew that you would be shut up in the oak, never to see the sun again, and only to drink blood during the great feasts and during the full moon?\"\n He looked straight ahead as if he couldn\u0027t give me a decent answer to this, and then he replied.\n \"You had corrupted me as I told you.\"\n \"Ah,\" I said, \"so you were afraid. The Faithful of the Forest couldn\u0027t comfort you. And I was to blame.\"\n \"Not afraid,\" he said furiously, clenching his teeth. \"Corrupted as I said.\" He flashed his small deep-set eyes on me. \"Do you know what it means to believe absolutely nothing, to have no god, no truth!\"\n \"Yes, of course I know,\" I answered. \"I believe nothing. I consider it wise. I believed nothing when I was mortal. I believe nothing now.\"\n I think I saw Avicus flinch.\n I might have said more brutal things, but I saw that Mael meant to go on.\n Staring forward in the same manner he told his tale: \"We made our journey,\" he said. \"We crossed the narrow sea to Britain and went North to a land of green woods and there we came upon a band of priests who sang our hymns and knew our poetry and our law. They were Druids as we were Druids, they were the Faithful of the Forest as were we. We fell into each other\u0027s arms.\"\n Avicus was watching Mael keenly. My eyes were more patient and cold, I was sure. Nevertheless the simple narrative drew me, I have to confess.\n \"I went into the grove,\" said Mael. \"How huge the trees were. How ancient. Any one of them might have been the Great Tree. At last I was led to it. And I saw the door with its many iron locks. I knew the god was inside.\"\n Suddenly Mael glanced anxiously to Avicus, but Avicus gestured for him to go on.\n \"Tell Marius,\" he said gently, \"and in telling Marius, you tell me.\" It had such a soft sound to it, this utterance. I felt a shiver on the surface of my skin, my lonely and perfect skin.\n \"But these priests,\" said Mael, \"they warned me. \u0027Mael, if there is any lie or imperfection in you, the god will know it. He will merely kill you and you will be a sacrifice and nothing more than that. Think deep because the god sees deep. The god is strong but the god would be feared rather than adored and takes his vengeance, when aroused, with great pleasure.\u0027\n \"The words shook me. Was I truly prepared for this strange miracle to come upon me?\" He glared savagely at me.\n \"I thought over everything. Your word pictures came back to me! The beautiful villa on the Bay of Naples. How you had described your rich rooms. How you had described the warm breezes and the sound of the water on the rocky shore. How you had described your gardens. You had spoken of gardens. Ah, could I endure the darkness of the oak, I thought, the drinking of blood, the starvation between sacrifices, for what would this be?\"\n He paused as if he couldn\u0027t continue. Again he glanced at Avicus. \"Go on,\" said Avicus calmly in his deep voice. Mael continued:\n \"Then one of these priests accosted me and took me aside and he said, \u0027Mael, this is an angry god. This is a god who begs for blood when he shouldn\u0027t want it. Do you have the strength to present yourself to him?\u0027\n \"I had no chance to answer him. The sun had just gone down. The grove was full of lighted torches. The Faithful of the Forest had assembled. All my fellow priests who had come with me surrounded me. They were pushing me towards the oak.\n \"When I reached it, I insisted that they free me. I put my hands upon the bark, and I closed my eyes and in the silent voice, as I had prayed in my home grove, I prayed to this god. I said \u0027I am of the Faithful of the Forest. Will you give me the Sacred Blood so that I might return home and do what my people wish me to do?\u0027 \"\n Again he stopped speaking. It was as if he was staring at something dreadful that I could not see.\n Avicus spoke up again. \"Continue,\" he said.\n Mael sighed.\n \"There came a silent laugh from inside the oak, a silent laugh and an angry voice! It went inside my head, and I was shaken by it. And the god said to me, \u0027Bring me a blood sacrifice first. Then and only then will I have the strength to make you a god.\u0027 \"\n Again Mael broke off. Then, \"Surely you know, Marius,\" he said, \"how gentle our god was. When he made you, when he spoke to you there was nothing of anger or hate in him, but this god was full of wrath.\"\n I nodded.\n \"I told the priests what the god had said to me. They drew back in a group, all afraid and disapproving.\n \" \u0027No,\u0027 they said, \u0027he has been asking for blood too much. It is not fitting that he should have it. He is to starve now as always between each full moon and until the yearly rituals so that he comes from the oak thin and ravenous, like the dead fields, ready to drink the blood of sacrifice and become plump with it, like the bounty of the coming spring.\u0027\n \"What was I to say?\" asked Mael. \"Finally I tried to reason with some of them. \u0027To make a god, surely he needs strength,\u0027 I explained. \u0027And he himself is burned from the Terrible Fire, and perhaps the blood helps him and heals him. Why not give him sacrifice? Surely you have a condemned man in one of the villages or settlements who can be brought to the oak?\u0027\n \"They drew back altogether, and they stared at the tree and its door and its locks. And I realized they were afraid.\n Then a dreadful thing occurred, which changed me utterly. There came from the oak a stream of enmity that I could feel as though someone full of rancor were staring at me!\n \"I could feel it as though the being looked upon me with all his rage, his sword raised to destroy me. Of course it was the power of the god, using his mind to flood mine with his hatred. But so strong was it that I could not think of what it was, or what to do.\n \"The other priests ran. They had felt this anger and hatred as well. I couldn\u0027t run. I couldn\u0027t move. I stared at the oak. I think the old magic had caught me. God, poems, songs, sacrifice\u0026iexcl;\u0026ordf;those things did not matter to me suddenly. But I knew a powerful creature was inside the oak. And I didn\u0027t run from it. And at that moment my evil plotting soul was born!\"\n Mael gave another very dramatic sigh. He was silent, his eyes fixed on me.\n \"How so?\" I asked. \"What did you plot? You had spoken through the mind with the gentle god of your own grove. You had seen him at the full moon take sacrifice, both before and after the Terrible Fire. You saw me when I was changed. You\u0027ve just said so. What struck you so about this god?\"\n He looked overwhelmed for a moment.\n Finally, gazing ahead of him again as if he had to, he continued.\n \"This god was more than angry, Marius. This god meant to have his way!\"\n \"Then why weren\u0027t you afraid?\"\n A silence fell in the room. I was truly a bit perplexed.\n I looked at Avicus. I wanted to confirm: Avicus was this god, no? But to ask such a question was crude. It had been said earlier that Avicus gave the Dark Blood to Mael. I waited, as it was proper for me to do.\n Finally Mael looked at me in the most sly and strange fashion.\n His voice dropped, and he smiled venomously.\n \"The god wanted to get out of that oak,\" he said, glaring at me, \"and I knew that if I helped him, he would give me the Magic Blood!\"\n \"So,\" I said smiling, because I couldn\u0027t help it. \"He wanted to escape the oak. But of course.\"\n \"I remembered you when you escaped,\" Mael said, \"the mighty Marius, blooming from blood sacrifice, running so speedily from us! Well, I would run like you! Yes, and yes, and as I thought these things, as I plotted, as I thought, I heard the voice from the oak again, directed soft and secretive, only to me:\n \" \u0027Come closer,\u0027 it commanded me, and then as I pressed my forehead to the tree it spoke. \u0027Tell me of this Marius, tell me of his escape,\u0027 it said. \u0027Tell me and I will give you the Dark Blood and we will flee this place together, you and I.\u0027 \"\n Mael was trembling. But Avicus looked resigned to these truths as though he had pondered them many times.\n \"It does become clearer,\" I said.\n \"There is nothing that is not connected with you,\" Mael said. He shook his fist at me. It reminded me of a child.\n \"Your own doing,\" I said. \"From the moment you stole me from the tavern in Gaul. You brought us together. Remember that. You kept me prisoner. But your unfolding story calms you. You need to tell us. Tell more.\"\n It seemed for a moment he would fly at me, desperate in his rage, but then there came a change in him. And shaking his head a little, he grew calm, scowling and then went on:\n \"When this confirmation came to me from the god\u0027s own mind,\" he said, \"I was fatally set upon my course. I told the other priests immediately that they were to bring a sacrifice. We had no time for quarreling, and that I should see that the condemned man was given to the god. I should go into the tree with the condemned man. I had no fear to do it. And they must hasten with all things, as the god and I might need the night for our magic to be done.\n \"It seemed an hour passed before they found the wretched man who was to die in the tree, but at last they brought him forward, bound and weeping, and very fearfully they unlocked the mighty door.\n \"I could feel the mounting rage of the god inside. I could feel his hunger. And pushing this poor condemned wretch before me, I entered, torch in hand to stand inside the hollowed chamber of the tree.\"\n I nodded with a small smile to say only I know.\n Meantime Mael\u0027s eyes had shifted to Avicus.\n \"There stood Avicus much as you see him now,\" Mael said, still looking at his companion. \"And at once, he fell upon the condemned man. He drank the blood of this piteous victim with merciful speed, and then he cast the body away.\n \"Then Avicus fell upon me, taking the torch from me, hanging it up on the wall so that it seemed dangerously near the wood, and grasping me tight by the shoulders he said,\n \" \u0027Tell me of Marius, tell me how he escaped the Sacred Oak. Tell me the story or I\u0027ll kill you now.\u0027 \"\n Avicus listened to all this with a calm face. He nodded as if to say, that was how it took place.\n Mael turned away from him and looked forward again. \"He was hurting me,\" Mael said. \"If I hadn\u0027t said something quickly he would have broken my shoulder, so I spoke up, knowing how well he might search my thoughts, and I said, \u0027Give me the Dark Blood and we shall escape together as you have promised. There is no great secret to what I know. It is a matter of strength and speed. We take to the tree limbs, which they cannot do so easily who follow us, and then we move through the trees.\u0027\n \" \u0027But you know the world,\u0027 he said to me. \u0027I know nothing. I have been imprisoned for hundreds of years. I only dimly remember Egypt. I only dimly remember the Great Mother. You must guide me. And so I\u0027ll give you the magic and do it well.\u0027\n \"He was true to his promise. I was made strong from the start. Then together, we listened with minds and ears for the gathered\n Faithful of the Forest and the Druid priests, and finding them quite unprepared for our departure, we forced the door with our united strength.\n \"At once we took to the treetops, as you had done, Marius. We put our pursuers far behind us, and before dawn we were hunting a settlement many many miles away.\"\n He sat back as though exhausted by his confession. And as I sat there, still too patient and too proud to destroy him, I saw how he had woven me into all of it, and I wondered at it, and I looked to Avicus, the god who for so long had lived in the tree. Avicus looked calmly at me.\n \"We have been together since that time,\" Mael said in a more subdued voice. \"We hunt the great cities because it is simpler for us, and what do we think of Romans who came as conquerors? We hunt Rome because it is the greatest city of all.\" I said nothing.\n \"Sometimes we meet others,\" Mael continued. His eyes shot towards me suddenly. \"And sometimes we are forced to fight them, for they will not leave us in peace.\" \"How so? \"I asked.\n \"They are Gods of the Grove, the same as Avicus, and they are badly burnt and weak and they want our strong blood. Surely you\u0027ve seen them. They must have found you out. You cannot have been hiding all these years.\" I didn\u0027t answer.\n \"But we can defend ourselves,\" he went on. \"We have our hiding places, and with mortals we have our sport, our games. What more is there for me to say?\"\n He had indeed finished.\n I thought of my own existence, my life crowded with so much reading and wandering and with so many questions, and I felt utter pity for him along with my contempt.\n Meanwhile the expression on the face of Avicus touched me.\n Avicus looked thoughtful and compassionate when he looked at Mael; but then his eyes fell on me and his face quickened.\n \"And how does the world seem to you, Avicus?\" I asked.\n At once Mael shot me a glance and then he rose from his chair and came towards me, bending over me, his hand out as if he would strike me.\n \"This is what you have to say to my story?\" he demanded. \"You ask of him how he sees the world?\"\n I didn\u0027t answer. I saw my blunder, and had to admit to myself that it wasn\u0027t deliberate. But I did wish to hurt him, there was no doubt of it. And this I had done.\n Avicus had risen to his feet.\n He came to Mael and guided him back, away from me.\n \"Quiet, my beloved one,\" he said gentry to Mael. He drew Mael back to his chair. \"Let us talk some more before we part with Marius. We have till morning. Please, be calm.\"\n I realized then what had so infuriated Mael. It was not that he thought I had ignored him. He knew better. It was jealousy. He thought that I was trying to woo away from him his friend.\n As soon as Mael had taken his chair again, Avicus looked to me almost warmly.\n \"The world is marvelous, Marius,\" he said placidly. \"I come to it as a blind man after a miracle. I remember nothing of my mortal life except that it was in Egypt. And that I was not myself from Egypt. I am afraid now to go there. I am afraid old gods linger there. We travel the cities of the Empire, except for the cities of Egypt. And there is much for us to see.\"\n Mael was still suspicious. He drew his ragged and filthy cloak up around him as though he might at any moment take his leave.\n As for Avicus he looked more than ever comfortable, though he was barefoot and as dirty as Mael. \"Whenever we have come upon blood drinkers,\" said Avicus, \"which isn\u0027t often, I have feared them, that they would know me for a renegade god.\"\n He said this with considerable strength and confidence so it surprised me.\n \"But this is never the case,\" he continued. \"And sometimes they speak of the Good Mother and the old worship when the gods would drink the blood of the Evil Doer, but they know less of it than me.\" \"What do you know, Avicus?\" I asked boldly. He considered as if he weren\u0027t quite sure that he wanted to answer me with truth. Then he spoke.\n \"I think I was brought before her,\" he said, his dark eyes rather open and honest.\n Mael turned to him sharply, as if he meant to strike him for his frankness, but Avicus went on.\n \"She was very beautiful. But my gaze was lowered. I couldn\u0027t really see her. And they were saying words, and the chanting was frightening to me. I was a grown man, that much I know, and they humiliated me. They spoke of honors that were curses. I may have dreamt the rest.\"\n \"We\u0027ve been here long enough,\" said Mael suddenly. \"I want to go.\"\n He rose to his feet and quite reluctantly Avicus followed. There passed between us, Avicus and me, something silent and secretive, which Mael could not interrupt. Mael knew it, I think, and he was in a sustained fury, but he couldn\u0027t prevent it. It was done.\n \"Thank you for your hospitality,\" said Avicus, reaching out to take my hand. He looked almost cheerful for a moment. \"Sometimes I remember little mortal customs. I remember touching hands in this way.\"\n Mael was in a pale rage.\n Of course there was much I wanted to say to Avicus but I knew now that such was very simply impossible.\n \"Remember,\" I said to both of them, \"I live as a mortal man lives, with the same comforts. And I have my studies always, my books here, you see. Eventually I will travel the Empire, but for now Rome, the city of my birth, is my home. What I learn is what matters to me. What I see with these eyes.\"\n I looked from one to the other of them.\n \"You can live in this way if you like,\" I said. \"Surely you must take fresh garments from me now. I can so easily provide them. And fine sandals for your feet. If you would have a house, a fine dwelling in which to enjoy your leisure hours, I can assist you in obtaining it. Please take this from me.\"\n Mael\u0027s eyes were blazing with hatred.\n \"Oh, yes,\" he whispered at me, too angry for a full voice. \"And why not offer us a villa on the Bay of Naples, with marble balustrades overlooking the blue sea!\"\n Avicus looked directly at me. He appeared quiet in his heart and genuinely moved by my words.\n But what was the use? I said no more.\n My proud calm was suddenly broken. The anger returned along with its weakness. I remembered the hymns of the grove, and I wanted to move against Mael, for all the ugliness of it, to quite literally tear him limb from limb.\n Would Avicus move to save him? It was likely. But what if he did not? And what if I proved stronger than both of them, I who had drunk from the Queen?\n I looked at Mael. He wasn\u0027t afraid of me, which I found interesting.\n And my pride returned. I could not stoop to a common physical battle, especially one which might become hideously awkward and ugly, one which I might not win.\n No, I was too wise for it. I was too good of heart. I was Marius, who slew the Evil Doer, and this was Mael, a fool.\n They made to walk away through the garden and I could find no words to say to them, but Avicus turned to me and said quickly, \"Farewell, Marius. I thank you and I will remember you.\"\n And I found myself struck by the words.\n \"Farewell, Avicus,\" I answered. And I listened as they disappeared into the night.\n I sat there, feeling a crushing loneliness.\n I looked at my many bookcases, and at my writing table. I looked at my inkstand. I looked at the paintings on the walls. I should have tried to make peace with Mael, surely, to have Avicus as my friend.\n I should go after them both. I should implore them to remain with me.We had so much more to say to one another. I needed them as they needed each other. As I needed Pandora. But I lived the lie. I lived it out of anger. This is what I\u0027m trying to tell you. I have lived lies. I have done it again and again. I live lies because I cannot endure the weakness of anger, and I cannot admit the irrationality of love.\n Oh, the lies that I have told myself and others. I knew it yet I didn\u0027t know. \n","sourceLink":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8/page-5.html","bookId":2594,"book":{"id":2594,"title":"Blood And Gold (The Vampire Chronicles #8)","description":"Storyline: \n Blood And Gold (The Vampire Chronicles #8) \n Here is the gorgeous and sinister story of Marius, patrician by birth, scholar by choice, one of the oldest vampires of them all, which sweeps from his genesis in ancient Rome, in the time of the Emperor Augustus, to his meeting in the present day with a creature of snow and ice. Thorne is a Northern vampire in search of Maharet, his \u0027maker\u0027, the ancient Egyptian vampire queen who holds him and others in thrall with chains made of her red hair, \u0027bound with steel and with her blood and gold\u0027. When the Visigoths sack his city, Marius is there; with the resurgence of the glory that was Rome, he is there, still searching for his lost love Pandora, but bewitched in turn by Botticelli, the Renaissance beauty Bianca, with her sordid secrets, and the boy he calls Amadeo (otherwise known as the Vampire Armand). Criss-crossing through the stories of other vampires from Rice\u0027s glorious Pantheon of the undead, haunted by Pandora and by his alter ego Mael, tracked by the Talamasca, the tale of Marius, the self-styled guardian of \u0027those who must be kept\u0027 is the most wondrous and mind-blowing of them all.\n \n","cover":"https://allnovel.net/images/blood-and-gold-the-vampire-chronicles-8.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:21:53 PM"}}
