{"id":33658,"no":16,"title":"CHAPTER XVI A DARING EXPLOIT","content":"On reaching Sheerness the captain at once went ashore, accompanied by Will, and they proceeded to London. Will took up his quarters at the Golden Cross, and next day called at the Admiralty, where he sent in his name to the First Lord. “I have received a most favourable report from Captain Knowles of your conduct in landing on the coast of Holland, and of obtaining despatches of much value. How were you taken prisoner?” “At the attack by a force from the Tartar on some batteries on one of the Isles d’Hyères. I was hit in the leg, and, being left behind in the confusion of the retreat, fell into the hands of the French. I was imprisoned for four months at Toulon, and then sent to Verdun. Six months after leaving Toulon I effected my escape in a disguise procured for me by a French girl. I had learned the language while in prison, and, travelling through France in the disguise of a pedlar, reached Dunkirk. There I worked in a fishing-boat for a month, and then, seeing the Artemis cruising off the town, I shut up two of the [pg 301]sailors in their cabin, and frightened the other two into taking me off to her.” “In consideration of the valuable services you have rendered I have much pleasure in appointing you master’s mate.” “Thank you, sir! but I own I had rather hopes of obtaining a lieutenancy.” “A lieutenancy!” the admiral said in a changed tone. “I am surprised to hear you say so, when you have had no service as a master’s mate. What makes you entertain such a hope?” “My past services, sir,” Will said boldly. “Captain Purfleet, will you hand me down the volume of services under the letter G. Ah! here it is.” He glanced at it cursorily at first, and then read it carefully. “You were right, Mr. Gilmore, in entertaining such a hope. I see that you have been highly spoken of by the various officers under whom you have served; that you were most strongly recommended by the admirals both at Malta and in the West Indies for your singular services, and also by Lord Hood for your conduct in Corsica. You were in command of a small craft for nearly a year, and in that capacity you not only took a number of prizes, some of them valuable, but actually captured, in one hard-fought action, two pirates, each of which was stronger than yourself. You have, therefore, well shown your capacity to command. Captain Purfleet, have any appointments been made yet to the Jason?” “No, sir.” “Very well, then appoint Mr. Gilmore to be second lieutenant of her. You need not thank me, sir; you owe your commission [pg 302]to your own gallantry and good conduct. I don’t know that I have at any time seen such strong testimonials and so good a record for any officer of your age and standing. I am quite sure that you will do full justice to the appointment that I have made. As the Jason will not be ready for two months I can grant you six weeks leave.” No sooner was this matter settled than Will took the coach to Fairham. Thence he drove to the village of Porchester, where Marie’s fiancé was confined. Here he put up at a little inn. He had, before starting from London, bought and put on the disguise of a countryman, as he could hardly have stayed in the village as a gentleman without exciting remark or suspicion. He had, however, brought other clothes with him, so that if necessary he could resume them, and appear either as a naval officer or as a civilian. His first step was to make a tour of the great wall which enclosed the castle and the huts in which the prisoners were confined. He saw at once that any attempt to scale the wall would be useless. At the inn he gave out that by the death of a relative he had just come into a few pounds and meant to enjoy himself. The inn he had selected was scarcely more than a tavern, and he had chosen it because he thought it probable that it would be frequented by the soldiers whose camp stood near the walls, and who supplied the guards in the castle. This expectation was fulfilled a short time after his arrival by four or five soldiers coming in. “Will you drink a glass with me?” he said. “I have been telling the landlord that I have come into a little brass, and mean to spend it.” [pg 303] The soldiers, not unwillingly, accepted the invitation, and sat down at a table with him. “It must be slow work,” he said, “keeping guard here, and I expect you would sooner be out at the war.” “That we should,” one of them replied; “there is nothing to do here but to drill all day, and stare across the water when we are off duty, and wish we were at Portsmouth, where there is something to do and something to amuse one. This is the dullest hole I ever was quartered in. Cosham on one side and Fairham on the other are the only places that one can walk to. We expect, however, to be relieved before long, and I never want to see the place again.” “I suppose you take recruits here?” Will said. “Oh yes, we take recruits when we can get them.” “How long is a recruit before he begins to be a soldier, and takes his regular turn as guard and so on?” “Two or three months,” the man said; “that is long enough to get them into something like shape.” “I should like to go in and have a look at the prisoners,” Will said after a little chat. “Well, there is no chance of your doing that,” the soldier replied. “Orders are very strict, and only three or four hucksters are allowed to go in, to sell things to them.” “How many are there of them?” “About three thousand.” He chatted for some time, and then, after calling for another pint of beer all round, sauntered out, leaving the soldiers to finish it. He saw at once that his only possible plan in the time he had at his command was either to bribe some of the guards, which appeared to him too hazardous a plan to [pg 304]adopt, and not likely to lead to success, or to get at one or other of the people who were allowed in. He spent two days watching the gate of the prison. During that time five people in civilian dress went in. One of these was a short fat woman, who carried a large basket with cakes and other eatables. Another was similarly laden. A third, a man of about his own height, took in a variety of material used by the prisoners for making articles for sale. He had needles and thread, scraps of materials of many colours for making patchwork quilts, blocks of wood for carving out model ships, straw dyed various colours for making fancy boxes, glass beads, and other small articles. Will at once fixed on him as being the most likely of the visitors to serve his purpose. He spoke to him after he had left the prison. “My friend,” he said, “do you want to earn fifty pounds?” The man opened his eyes in surprise. “I should certainly like to,” he said, “if I could see my way to do it.” “Well, I will double that if you do as I tell you. I want you, in the first place, to find out the hut in which Lucien Dupres is confined, and give him a letter.” “There will be no great difficulty about that,” the man said. “I only have to whisper to the first prisoner I meet that I want to find a man, and have got a letter from his friends for him, and if he doesn’t know him he will find him out for me. That is not much to do for a hundred pounds.” “No; but in the next place I want you to keep out of the way for a week, and to lend me your clothes and pass. I want to go in and see the man.” [pg 305] “Well, that is a more dangerous business. How could you pass for me?” “I think I could do that without fear. We are about the same height. I should have a wig made to imitate your hair, and should, I imagine, have no difficulty in getting my face made up so as to be able to pass for you. You must be so well known that they will do no more than glance at me as I go in. The only alternative to that will be for you to take to him a rope and other things I will give you. I tell you frankly I want to aid his escape. Mind, a hundred pounds is not to be earned without some slight risk.” “Of the two things I would rather risk carrying the rope and the tools, if they are not too bulky. Mind you, it is a big risk, for I should be liable to be shot for aiding in the escape of a prisoner.” “Well, look here,” Will said, “I will go into Portsmouth this afternoon and find some man who can fake me up. There are sure to be two or three men who make that their business, for young naval officers are constantly getting into scrimmages, and must want to have their eyes painted before they go back on board. Do you go to the prison to-morrow morning. Find out the man, and deliver this letter to him. Then come into Portsmouth in the coach. I will be waiting there till it arrives, and you can go with me, and when I have got myself made up you shall judge for yourself whether I shall pass muster for you. There will be no difficulty in getting whiskers to match yours.” “Very well,” the man said, “I will be on the coach to-morrow.” Will at once changed his clothes to an ordinary walking [pg 306]suit, and went into town. On making enquiries he found that there was a barber who made it his business to paint black eyes and to remove the signs of bruises. He went to him and said: “I hear you are an artist in black eyes.” The man smiled. “You don’t look as if you wanted my services, sir.” “No, not in that way, but I suppose you could make up a face so as to resemble another.” “Yes, sir, I was at one time engaged at a theatre in London in making up the performers, and feel sure that I could accomplish such a job to your satisfaction.” “I have made a bet,” Will said, “that I could disguise myself as a certain man so well that I could take my friends in. Have you a sandy wig in your shop?” “Yes, sir, half a dozen.” “And whiskers?” “I have several sets, sir, and I dare say one would be the right colour.” “Very well, then, I will bring the man here to-morrow, and you shall paint me so as to resemble him as closely as possible. I don’t mind giving you a five-pound note for the job.” “Well, sir, if I am not mistaken I can paint you so that his own mother wouldn’t know the difference.” Will took a bed at the George, and at mid-day went to the inn where the coach stopped. The man was on the outside. “Well, sir, I have found the Frenchman, and given him the letter, so that part of the business is done.” “That is good. What is the number of the man’s hut?” [pg 307] “Number sixty-eight;” and the man carefully described its position. “Very well. Now we will set about the second part.” When they arrived at the shop the barber seated them in two chairs next to each other, in a room behind the shop, and set to work at once. He first produced a wig and whiskers, which, with a little clipping, he made of the size and shape of the hair on the huckster’s face. Then he set to work with his paints, first staining Will’s face to the reddish-brown of the man’s complexion, and then adding line after line. After two hours’ work he asked them to stand together before a glass, and both were astonished; the resemblance was indeed perfect. Will’s eyebrows had been stained a grayish white, and some long hairs had been inserted so as to give them the shaggy appearance of the pedlar. A crow’s foot had been painted at the corner of each eye, and a line drawn from the nose to the corners of the lips. The chin and lower part of the cheeks had been tinted dark, to give them the appearance of long shaving. Both of them burst into a laugh as they looked at the two faces in the mirror. “You will do, sir,” the man said. “It would need a sharp pair of eyes to detect the difference between us.” “Yes, I think that will do,” Will said, “and to aid the deception I will, as I go in, use my handkerchief and pretend to have a bad cold.” “Is there a basket-maker’s near?” Will asked the barber. “Yes, sir, first turning to the right, and first to the left, two or three doors down, there is a small shop.” “I want you at once to go and choose one the size and shape of your own,” Will said to his companion. “When [pg 308]you see one, set the man to work to weave a false bottom to it. I want it to lodge so as to leave a recess four or five inches deep. Have it made with two handles, so that it can be lifted in and out. How long would he be doing it, do you think?” “About an hour and a half, I should say.” “Very well; order the man to send it round to the George, wrapped up in paper, to the address of Mr. Earnshaw. When you have done this, come back here. We cannot go into the street together; our singular resemblance would at once be noticed.” “Now,” Will said to the pedlar when he returned, “meet me on the road a hundred yards from where it turns down to Porchester; bring a stock of goods with you, and I will put them in my basket. Of course you will bring your pass, and the clothes you now have on in a bundle. I will change there; as far as I have seen it is very seldom that anyone passes that way.” Will then went for a walk, and when it became quite dark he took off his wig and whiskers and went into the town again. Here he bought a long rope, very slender, but still strong enough to support a man’s weight, and a grapnel which folded up flat when not in use. Then he went to the George, having wrapped a muffler round his face as if he were suffering with toothache. His basket was standing in the hall. “I shall not return this evening,” he said, “so I will pay my bill.” Then, having bought a suit of ready-made sailor’s clothes, with hat complete, he put them into his basket, hired a vehicle, and drove to Fairham. In the morning at nine [pg 309]o’clock he walked along the main road towards Cosham till he reached the turning to Porchester, went down it a couple of hundred yards, and sat on a grassy bank till he saw the pedlar approaching. “It is a foggy morning,” the huckster said when he came up. “So much the better. I hope it will last over to-morrow, and then they won’t be able to signal the news of the prisoner’s escape. It is only in clear weather that the semaphores can be made out from hill to hill.” The goods were changed from the pedlar’s basket to the one Will had brought. “There, then, is the hundred pounds I promised you; I hope you are perfectly satisfied?” “Perfectly, sir; it is the best two days’ work I have ever done.” “Now for my clothes,” Will said; and no one being in sight he quickly changed into the clothes the pedlar had brought. “We are more alike than ever,” the man said with a laugh, “but you will have to remember that I walk with a limp. I got a ball in my leg in the fighting at Trinidad, and was discharged as being unfit for service. But I got a small pension, and the right to sell things to the prisoners in Porchester Castle.” “I noticed the limp when I saw you first,” Will said, “and there will be no great difficulty in copying it. I regarded it as rather fortunate, as when the soldiers see me limp along they will not look farther.” “Well, sir, I wish you luck. You are the freest-handed gentleman I ever came across.” [pg 310] Will hid his own clothes in a neighbouring bush, and then started, imitating the pedlar’s limp so exactly that the man laughed as he looked after him before starting for Fairham. There were few people in the streets of the quiet little village as Will passed through it. When he neared the castle he overtook the fat apple-woman, who hailed him as a friend, and they walked together into the castle. They showed their passes to the guard at the gate, but he scarcely looked at them. They then separated, and Will, stopping now and then to sell small articles, made his way at last to Lucien’s hut. He had in his letter informed Lucien of his reasons for trying to get him free, and had directed him to be leaning at that hour against the corner of the hut. When Lucien saw the pedlar approaching, if all was clear he was to retire into it, but if there were others inside he was to shake his head slightly. As Will approached the hut he saw a prisoner standing there according to his instructions, but he gave the danger signal and Will passed on. This he did twice, but when Will returned the third time the man went quietly into the hut. “There is not a moment to lose,” Will said as he followed, and he at once lifted up the false bottom and pulled out the rope and grapnel. He had knotted the rope about every foot, to assist the prisoner in climbing, and had covered the iron of the grapnel with strips of flannel so that it would make no noise when it struck the wall. “Hide them in your bed. It will be a very dark night, and you must steal out and make your way to the middle of the south wall. There fling your grapnel up and scale the wall. [pg 311]I shall be there waiting for you. It looks as if it will be very wet as well as very dark, so you ought to be able to avoid the sentinel.” At this moment he heard someone at the door, and adroitly changing his tone said: “You do not like these colours for a bed-quilt? Very well, I am getting a fresh stock from London in a few days, and I have no doubt you will be able to suit yourself. Good-morning!” He then turned and offered some of his goods to the new-comer, who bought a block for carving out a ship, and some twine and other things for rigging her. When he left the hut he went about the yard till he had disposed of a considerable amount of his goods, and then left the prison and made his way back to the spot where he had hidden his clothes. On arriving there he changed at once, rubbed the pigment from his face, threw away the wig and whiskers, hid the basket in a place which he and the pedlar had agreed upon, with the clothes in it and the pass in one of the pockets, and then went back into the village, where he hired a chaise and drove to Fairham. “Landlord,” he said, as he drew up at the principal hotel, “I shall want a post-chaise to-night for London. I shall be at a party to-night and cannot say at what time I may get away, but have the horses ready to put in at twelve o’clock. If they have to wait an hour or two you shall not be the loser.” After ordering dinner, he strolled about the town till he thought it would be nearly ready. Then he asked for a room, and there changed into his naval uniform, which he had brought with him. He ate a good dinner, and then, putting on his cloak, started to walk back to Porchester, carrying [pg 312]with him a bag in which was the sailor’s suit he had bought for Lucien. The night was pitch dark, and the rain had set in heavily, but although his walk was not an agreeable one he was in high spirits. In his letter to Lucien he had told him that if anything should prevent him from making his way to the wall that night he would expect him on the following one. Nevertheless he felt sure that in such favourable circumstances he would be able to get through the sentries without difficulty. He took up a position as near as he could guess at the centre of the south wall, on the narrow strip of ground between it and the lake. He had waited about an hour when he heard a slight noise a few yards on one side of him. He moved towards the sound, and was just in time to see Lucien alight. He grasped him by the hand. Illustration: “HE WAS JUST IN TIME TO SEE LUCIEN ALIGHT” “HE WAS JUST IN TIME TO SEE LUCIEN ALIGHT” “Thank heaven,” he said in French, “that I have got you free, as I promised your sweetheart I would! Now let us first make our way up the village. I have a suit of sailor’s clothes for you in this bag; you can change into them when we get beyond the houses, and throw those you are wearing into the pond there, with a few stones in them to make them sink.” “Ah, monsieur, how can I thank you?” Lucien said. “I am only paying a debt. Marie risked a good deal to aid me, and I promised solemnly that I would, if it were at all possible, get you out of prison in return, so there is no occasion for any thanks.” Few words passed between them as they walked through the village, and when they had left it behind, Lucien changed his clothes and disposed of his old ones as Will had suggested. [pg 313] “It was necessary to get rid of them,” Will said, “because if they were found in the morning it would show that you had got a change, and instead of looking for someone in a well-worn uniform they would direct their attention to other people.” They tramped along to Fairham, and reached the hotel just as it was about to be shut up, the stage-coach having passed a few minutes before. They had some refreshments, and then took their seats in the chaise. At once the postilions cracked their whips, and the four horses started at a gallop. “We are absolutely safe now,” Will said; “they will not discover that you have gone until the roll-call in the morning, and by that time we shall be within a few miles of London. In such weather as this they will be unable to signal. Before we arrive I will put on civilian clothes again, and as soon as we have discharged the chaise we will go to a clothier’s and get a suit for you. There are so many emigrants in London that your speaking French will attract no attention.” The journey was quickly accomplished. Will was very liberal to the postilions at the first stage, and these hurried up those who were to take the next, and so from stage to stage they went at the top of the horses’ speed, the ninety miles being covered in the very fast time, for the period, of ten hours. At the last stage Will asked for a room to himself for a few minutes and there changed his clothes. They were put down in front of a private house, and, having seen the post-chaise drive off, took their bags and walked on until they reached a tailor’s shop. “I want to put my man into plain clothes while he is with me in town,” Will said to the shopman. [pg 314] “Yes, sir. What sort of clothes?” “Oh, just private clothes, such as a valet might wear when out of livery!” Lucien was soon rigged out in a suit of quiet but respectable garments, and, putting his sailor suit into his bag, they went on. They looked about for a considerable time before they found a suitable lodging, but at last they came upon a French hotel. Entering, Will asked in French for two rooms. They were at once accommodated, and after washing and dressing they went down to the coffee-room, where several French gentlemen were breakfasting. It had been arranged that Will should say that they were two emigrants who had just effected their escape from France. The next day they took the coach to Weymouth, the port from which at that time communication was kept open with France by means of smugglers and men who made a business of aiding the French emigrants who wanted to escape, or the Royalists who went backwards and forwards trying to get up a movement against the Republic. On making enquiries they heard of a man who had a very fast little vessel, and they at once looked him up. “This gentleman wants to go across,” Will said. “What would you do it for?” “It depends whether he will wait till I get some more passengers or not.” “He is pressed for time,” Will said; “what will you run him over for alone?” “Fifty pounds,” the man said. Will thought it advisable not to appear to jump at the offer. “That is rather stiff,” he said; “I should think thirty-five would be ample.” [pg 315] “It seems a good sum,” the man said; “but you see there are dangers. I might be overhauled by a British cruiser.” “You might,” Will said; “but when they learned your business they would not interfere with you.” “Then there are the port authorities,” the man said. “Yes, but a few francs would prevent them from asking inconvenient questions. Besides, my friend is not a royalist, he is only going over to see his friends.” “Well, we will say thirty-five,” the man said with a smile. “When will you want to start?” “He doesn’t care whether he sails this evening or to-morrow morning.” “Well, we will say to-morrow morning at daybreak.” “Where will you land him?” “At Cherbourg or one of the villages near; most likely at Cherbourg if the coast is clear, for I have friends there who work with me.” They went to an hotel for the night. In the morning Will gave Lucien a small package containing a very handsome gold watch and chain which he had bought in London. “Give this to Marie from me,” he said; “I promised that she should have one for her wedding-day. Here are a thousand francs of French money, which will carry you comfortably from Cherbourg to Verdun and give you a bit of a start there. No, you need not refuse it, I am a rich man, and can afford it without in the least hurting myself. Give my love to Marie,” he said, “and tell her that I shall never forget her kindness.” Lucien was profuse in his gratitude, but Will cut him short by hurrying him down to the boat, which was lying at the [pg 316]quay with her sails already hoisted. Will watched the boat till it was well out to sea, and then took the next coach back to London, filled with pleasure that he had been able to carry out his plan and to repay the kindness that Marie had shown him. He had given Lucien the address of his London agent, so that on his arrival at Verdun he could write him a letter saying how he had fared, and when he and Marie were to be married. This letter he received on his return from the next cruise. It contained the warmest thanks of Marie and her lover, and the information that they were to be married the following week, and that the young man had an offer of good employment in the town. When he reached London, Will obtained the address of a respectable solicitor, and called upon him to ask his advice as to advertising to try to discover a family bearing the arms on his seal. “I should advise you,” the lawyer said, “to leave the matter until you return from sea again. Questions of this sort always require a good deal of time to answer. You would have to be present to give information, and when the matter is taken up it should be pressed through vigorously. Of course there would be difficulties to face. The mere fact of this seal being in the possession of your father, that is, if he was your father, would not be sufficient to prove his identity, and there would be all sorts of investigations to make, which would, of course, take time. If you will leave the matter in my hands I will cause enquiries to be made as to the arms. That will probably only take a day or two, and it would perhaps be a satisfaction to you to know the family with which you might [pg 317]be connected. It will be in the subsequent steps that delays will occur.” “Thank you, sir! I should certainly like to know, though I quite see that, as you say, it will be very difficult for me to establish my connection.” The lawyer then took down what particulars Will could give him of his early history. When he returned a week later the lawyer gave him a cordial reception. “I congratulate you, Mr. Gilmore,” he said. “The head of the family carrying those arms is Sir Ralph Gilmore, one of our oldest baronets. He has no male issue. He had one son who died six years ago. There was another son, a younger one, of whom there is no record. He may be alive and he may be dead; that is not known. It is, of course, possible that you were stolen as a child by your reputed father, and that he gave you the family name in order that when the time came he could produce you, but of course that is all guesswork. When you return from sea again I will set people to work to trace, if possible, the wanderings of this person; but as I said, this will take time, and as you will be going to sea in a fortnight the matter can very well stand over. So long as you are on board a ship your parentage can make very little difference to you.” Will had still a fortnight of his leave remaining. He wandered about London for a couple of days, but he found it rather dull now that he had finished his business, as he had no friends in town. On the second day he was walking along one of the fashionable streets of Bloomsbury, considering whether he should not go down by the next coach to Portsmouth, where he was sure of meeting friends, [pg 318]when a carriage passed him, drawn by a pair of fine horses. A young lady who was sitting in it happened to notice him. She glanced at him carelessly at first, and then with great interest. She stopped the carriage before it had gone many yards, and when Will came up, looked at him closely. “Excuse me, sir,” she said as he was passing; “but are you not Mr. Gilmore?” Greatly surprised he replied in the affirmative. “I thought so!” she exclaimed. “Do you not remember me?” He looked at her hard. “Why—why,” he hesitated, “surely it is not—” “But it is!” she cried. “I am Alice Palethorpe!” “Miss Palethorpe!” he exclaimed, grasping the hand she held out. “Is it possible?” “Not Miss Palethorpe,” she said. “To you I am Alice, as I was nearly four years ago. Get into the carriage. My father will be delighted to see you. We have talked of you so often. He made enquiries at the Admiralty when he came home, but found that you were a prisoner in France, and he has been trying to get your name down in the list of those to be exchanged, but he had so little interest that he could not succeed, and, indeed, for the past two years no exchange had taken place.” By this time he was in the carriage, and they were driving rapidly along the busy streets. Presently they stopped before a large house in Bedford Square. “This is our home, for the present at any rate,” she said. “Now come in.” She ran upstairs before him and signed to him to wait at the [pg 319]top. “Father,” she said, bursting into a room, “I have taken a captive; someone you certainly don’t expect to see. Now, you must guess.” “How can I, my dear, when you say I don’t expect to see him? Is it—?” and he mentioned five or six of his friends in Jamaica, any of whom might be returning. “No, father. You are out altogether.” “Then I give it up, Alice.” “It is Will,” she said. Will heard him spring to his feet and hurry to the door. “My dear young friend!” he exclaimed. “At least I suppose it is you, for you have grown out of all recognition.” “Ah, father!” the girl broke in. “You see, he hadn’t changed so much as to deceive me. I felt sure of him the moment I set eyes upon him.” “Well, then, your eyes do you credit,” her father said. “Certainly I should not have recognized him. He has grown from a lad into a man since we saw him last. He has widened out tremendously. He was rather one of the lean kind at that time.” “Oh, father, how can you say so? I consider that he was just right.” “Yes, my dear, I quite understand that. At that time he was perfect in your eyes, but for all that he was lean.” “You are quite right, sir, I was, and I really wonder that I have put on flesh so much. The diet of a French prisoner is not calculated to promote stoutness. But your daughter was not only sharper-sighted than you, but even than myself. Till she spoke to me I had not an idea who she was. I saw that she thought she recognized me, but I was afraid it would [pg 320]be rude on my part to look at her closely. Of course now I do see the likeness to the Alice I knew, but she has changed far more than I have. She was a little girl of fourteen then, very pretty, certainly, I thought, but still quite a girl—” and he stopped. “Now, you mean that I have grown into a young woman, and have lost my prettiness?” “I think your looking-glass tells you another story,” he laughed. “If it doesn’t, it must be a very bad one.” “Well, now, do sit down,” her father said. “You must have an immense deal to tell us.” “It is a longish story,” Will replied, “too long to tell straight off. Besides, I want to ask some questions. When did you come home? Have you come for good? If not, how long are you going to stay? though I am sorry to say that the length of your visit can affect me comparatively little, for I am appointed second-lieutenant of the Jason, and must join in a few days.” “I congratulate you very heartily, Will,” Mr. Palethorpe said. “You are fortunate indeed to get such promotion so early.” “I am most fortunate, sir. Though just at present I feel inclined to wish that it hadn’t come quite so soon.” “In answer to your question, Will, I can say that we are home for good. I have disposed of my estate and wound up my business, principally, I think, because this little girl had made up her mind that she should like England better than Jamaica.” “I am glad to hear that, sir. I shall have something to look forward to when I return to England.” [pg 321] “Where are you staying?” “At the Golden Cross.” “Well, then, you must go and fetch your luggage here at once. It would be strange indeed if you were to be staying at any house but mine while you are in London.” As he saw that the planter would not hear of a refusal, Will gladly accepted the invitation, and, taking a fly, drove to the hotel, paid his bill, and took his things away. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3152/86571.html","bookId":781,"book":{"id":781,"title":"By Conduct and Courage","description":"简介： A wandering musician was a rarity in the village of Scarcombe. In fact, such a thing had not been known in the memory of the oldest inhabitant. What could have brought him here? men and women asked themselves. There was surely nobody who could dance...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3152","creation":"Aug 1, 2019 12:19:30 AM","modification":"Aug 1, 2019 12:19:30 AM"}}
