{"id":108959,"no":36,"title":"Page 36","content":"“See you then.” Click. “Who was that?” Kat asked. “Do you remember the SUV that followed us that day with Reeve?” “The one you threw knives at? Nope. I’ve totally forgotten.” Har-har. “The old guy... He gave me his card. I called him. He called me back. And so on and so forth. We’ve now set up a meeting.” Paling, Kat tightened her hands on the steering wheel. “Ali, you don’t know this man.” “Yeah, but I know I need answers and he might have them.” “Answers about...the dark side?” “Yes,” I replied softly. She reached over and patted my knee. “You’re going to overcome this. I just know it. You’re strong. You’ve lost so much, and you’re going to fight with everything you’ve got to keep from losing more.” I wanted to believe her, but I was fast losing hope. She parked in front of— Colluctor Park, I realized. It was a Tuesday, close to dinnertime and as cold as ice. No one walked the manicured lawn. The trees were barren, but there were benches, a swing set and monuments. There was also a creepy mausoleum. “How is this punishment?” I asked as I unbuckled. “You planning to make me strip and streak?” “You’ll see,” she said in a singsong tone. We stepped into the harsh winter winds, and I shivered. Someone had staked Merry Christmas signs along the side of the cobbled path leading from the parking lot to the park. Another holiday fast approaching. I’d do better with this one, I vowed, and make sure Nana had a fabulous time. Of course, I would need to buy her a present. And one for Kat. And maybe Cole. No, not Cole. Kat linked our arms at the elbows and tugged me forward. “Something wrong? Your face got all pinchy.” “Is pinchy even a word?” “If it’s not, it should be. And don’t think I don’t know you avoided my question. I know you’re nervous about what I have planned, and you totally should be. Behold.” Over the hill, she pointed to— A moan slipped from me. Reeve sat on a bench, Ethan beside her. The two were talking and laughing, happy to be together. “You have to face her sometime,” Kat said sternly. “She has no interest in a reunion,” I whispered. “Only because her dad told her you hated living with them and had demanded your own space.” He’d what? Well, that altered things, didn’t it? I marched forward, determined. “—you will love her,” she was saying. “Everyone does. Just ask her yourself,” she added with an affectionate chuckle. Ethan glanced up, saw me and stiffened. “Can I help you?” I ignored him, saying, “Hey, Reeve.” She twisted to look up at me and flinched. “Ali,” she said with a reluctant nod. Then, as Kat moved up beside me, “Kat. You were supposed to come alone.” Kat shrugged. “I’m supposed to do a lot of things. That doesn’t mean I do them.” Ethan stood. I was five-ten, and he was a few inches taller than me. His hair was disheveled from the breeze, and his features now closed off. He held out his hand to shake. “I’m Ethan. It’s nice to meet you.” His grip was weak, as if he was afraid he’d break me if he squeezed too hard. “You, too. I’m Ali.” He turned to Kat, shook her hand, as well. “Reeve’s told me so much about you guys,” he said as he sat back down. Kat claimed the spot next to him, but I remained standing, suspecting Reeve would throw a fit if I encroached. “Look, I’m sorry I moved out without saying goodbye.” I hated doing this in front of a guy I didn’t know, but I wasn’t sure when I’d have another opportunity. “And I didn’t move out to get away from you. I loved living with you.” Dark fire snapped to life in her eyes. “Are you calling my father a liar?” Yes! “I’m saying he was protecting you from the truth.” “And just what, exactly, is the truth?” Ethan’s attention zinged between us. I remained silent. There were some things I still couldn’t share. “Of course. More secrets,” she muttered, the fire in her dark eyes replaced by hurt. She looked at Ethan. “Do you see? This is what I have to deal with every day.” She gathered her purse and stood. “Let’s go, Ethan.” Stay calm. “Please, don’t go.” Ethan reached out and tugged the lapels of Reeve’s jacket closer, a total boyfriend move. “She’s your friend, sweetheart. I’ve had to hold you while you’ve cried about her. Stay and hear her out.” The support surprised me. “Hey, Eth—you don’t mind if I call you Eth, do you?” Kat asked. “Why don’t you escort me to the pond? I want to see the ducks, but I’ll need someone to throw in their path if they turn violent.” He looked at Reeve, then looked at me. Reeve, me. As if he was considering every possible thing that could go wrong, and wanted to take measures to prevent it. Finally he nodded. “It would be my pleasure,” he said and offered his arm. The two strode away, and Ethan only glanced back twice to check on his girlfriend. Sighing, I took his seat and removed the bag from around my shoulder and waist. “Look, Reeve. I moved out because...I’m sick. Really, really sick, and I have these violent episodes.... We don’t know a lot about what’s going on, and your dad wants you safe. I want you safe. It’s not contagious, or anything like that, but...it’s just better this way.” Her features immediately softened, and she eased beside me. “Oh, Ali. I had no idea. I’m so sorry.” “I’m sorry, too.” “I just wish you’d told me. I would have told you not to go,” she said, patting the top of my hand. “I don’t care about any violent episodes, and I know my dad won’t, either, if I talk to him.” “No,” I said, shaking my head. “Please, don’t talk to him. Don’t talk to anyone about this.” “But—” “Your dad will be mad that I told you this much, and—” “Why would he be mad?” she interjected. “Unless something else is going on. And there must be. There’s a reason Bronx runs so hot and cold. A reason so many of my friends go to bed without any injuries, but wake up covered with them. A reason my dad has a horror dungeon below the house. A reason he tolerates Cole’s dad—a man he once hated.” Mr. Ankh and Mr. Holland had once hated each other? “Look, Reeve—” “No. I’m tired of being in the dark, Ali. So very tired. I need to be enlightened. I crave it. It’s become an obsession.” Dark. Light. Lies. Truth. “If I tell you, you might long for the days of blissful ignorance, and I think that’s what your father fears most.” But then, she’d finally know what was out there and would be able to take measures to protect herself. Measures Mr. Ankh would never be able to take from her. “Please,” she said. “Let me think about it, okay?” I said. “I could get a lot of people in trouble.” That was more than I’d ever offered before, and she nodded gratefully. “So...Ethan seems nice,” I said, taking the conversation in another direction. I was relieved when she said, “He is, he really is,” without pressing me for more. There was no dreamy sigh from her, no smile. “I sense a but coming on.” Her shoulders sagged the slightest bit. “He really likes me. He’s sweet, attentive and last year his mother died, and now his little sister is dealing with leukemia, so he’s learned to appreciate life and live every day to the fullest, but...I can’t get you know who out of my head.” Yeah. “Believe me, I get it. When it comes to Cole, I’m the same way.” Kat cleared her throat. “We’re, uh, back. Ethan was missing his girl.” Reeve jumped guiltily, her cheeks flushing. “You guys make up?” Ethan claimed the seat on the other side of her and snuggled up, offering his warmth. If he’d heard Reeve’s words about Bronx, he didn’t act like it. “We did,” she replied. “Thank God,” Kat said. “It’s about time, and seriously, go me for setting it up.” Ethan nodded, kissed Reeve’s temple. “I agree.” It was obvious he cared for her, and I could see why she had chosen him. Despite her feelings for Bronx, they could have something normal. No secrets. No midnight battles with the undead. No suspecting everyone they met of foul play. No worrying if the other would come home every night—or be eaten. Hungry...so hungry... As the words whispered through my mind, I jolted to my feet and spun, searching, trying to squash a sudden bead of panic. My emotions had been under control. This shouldn’t be happening. “What’s wrong?” Kat asked. Hungry, hungry, hungry. HUNGRY. Hurt. Maim. Kill. Soon... “Ali, your eyes,” she said. No! I gasped for breath as I stumbled away from the group. Reeve stood, already reaching for me. Ethan grabbed her by the wrist and jerked her behind him, as if I’d sprouted horns, fangs and a tail. Maybe I had. HUNGRYHURTMAIMKILLSOON. The whispers... So loud... Blending together, somehow calling me, drawing me. Kat withdrew her phone and started typing. Texting Frosty to come help me? “No. Don’t,” I said, and tried to turn left. Somehow I’d lost control of my body and turned right. My feet moved one in front of the other without any command from my brain. I drew closer and closer to a creepy mausoleum, the whispers continuing to escalate. Surely my eardrums would burst, unable to withstand the chatter. “Syringe. Purse.”","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-36.html","bookId":2521,"book":{"id":2521,"title":"Through the Zombie Glass (White Rabbit Chronicles #2)","description":"Storyline: Through the Zombie Glass (White Rabbit Chronicles #2) Zombies stalk the night. Forget blood and brains. These monsters hunger for human souls. Sadly, they\u0027ve got mine... Alice Bell has lost so much. Family. Friends. A home. She thought she had nothing else to give. She was wrong. After a new zombie attack, strange things begin to happen to her. Mirrors come to life, and the whispers of the dead assault her ears. But the worst? A terrible darkness blooms inside her, urging her to do very wicked things. She\u0027s never needed her team of zombie slayers more, but ultra bad-boy Cole Holland, the leader and her boyfriend, suddenly withdraws from her...from everyone. Now, with her best friend Kat at her side, Ali must kill the zombies, uncover Cole\u0027s secret and learn to fight the darkness. But the clock is ticking...and if she fails at a single task, they\u0027re all doomed.","cover":"https://allnovel.net/images/through-the-zombie-glass-white-rabbit-chronicles-2.jpg","author":"Gena Showalter","type":"Horror","source":"allnovel","link":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:28:26 PM"}}
