{"id":108967,"no":44,"title":"Page 44","content":"“I’ll tell him.” My pronouncement was quickly met with inquiring glances. “I know what it’s like to lose your family. And I know you guys do, too,” I added in a rush. They’d all lost someone in the war. “But with me, the loss is fresh. Jaclyn was his twin, and he loved her more than he loved himself. I felt the same way about Emma.” Mr. Ankh sighed. “Very well.” Cole made the call. It wasn’t long before Mr. Holland was escorting Justin to my bedside. He sat down opposite Cole, his expression closed off. He had no idea why he was here. My chin trembled as I said, “Justin, I met with a man named Dr. Bendari.” He nodded. “You’ve mentioned him before.” “Yes. He was...he was killed in front of me.” Tears streamed down my cheeks, burning, leaving track marks, I was sure. Justin softened. “I’m sorry.” “Before he died, he told me that your sister—” With a pained groan, he jumped up, the chair skidding behind him. “I know. Don’t say it. Don’t you dare say it.” “You know?” Cole asked. Justin closed his eyes, drew in a shaky breath. But that was it, his only reaction. And yet my heart broke for him. I knew what he was doing, because I’d done the same thing. I’d boxed up my grief and shoved it deep, deep inside. He would feel better for a little while. Then, one day, someone would come along and say something, or he would see something, and the box would begin to open. All of those negative emotions would come pouring out, and he’d be helpless to stop them. He would break down. “The leader, Mr. K, showed me pictures.” “Mr. K?” Mr. Holland said. “What does the K stand for?” “I don’t know. It’s all anyone ever calls him.” He lifted his chin. “Mr. K told me you were responsible, and it was my job to exact revenge. But I couldn’t kill you, he said. Just had to spy on you.” He offered us a cold smile. “He didn’t realize I knew you better than that and knew you’d never hurt my sister—that he was responsible. So I’ve given him information, but nothing damaging. Just enough to make him think I’m playing his game.” “So you’re the spy,” Cole gritted out. “And you dared to send me on a wild chase? Why? To distract me?” “Spy?” Mr. Ankh and Mr. Holland said in unison. “No.” Justin shoved his hands into his pockets. “You’ve got a traitor in your midst. I never lied about that, I just don’t know who it is. Every bit of information I gave you is true. I want Anima taken down, and I want to help you do it.” The fierceness of his expression...the chilling determination in his voice...the hatred oozing off him all combined to scream I’m telling the truth. “Spy,” Mr. Holland repeated. “I’ll talk to you about it later.” Cole nodded stiffly to Justin, a silent command to continue. “My parents think Jace ran away. They worry about her, my mom even cries, but I can’t bring myself to tell them that she’s...that she’s... Because I can’t prove it, and I can’t answer their questions. And now you know everything I know. So we’re done here.” Justin turned and stalked from the room. Cole stepped forward, intending to chase, but I grabbed his arm. “Let him go. He needs to be alone right now.” Mr. Ankh and Mr. Holland watched as Cole settled back in his seat. “Some privacy,” Cole said, waving them away. Mr. Holland rolled his eyes and left. Mr. Ankh opened his mouth, closed it. Then he, too, took off. “I know you probably have more questions, but I want to talk to you about Veronica first. About what happened with her after our breakup.” “No,” I said, anger suddenly rising. He continued anyway. “I told you she went down on me, and I wasn’t lying, but I didn’t tell you that I stopped her before...just before. And I don’t think you have any idea how difficult that was. With something like that, it doesn’t always matter if a guy likes the girl or wants someone else.” “Should I give you a medal?” I snapped. I still hated the image of what they’d done. “Yes. No.” He banged his head against the side of my bed. “I’m screwing this up. Again.” “There’s no reason to hash this out—” He looked up, his gaze beseeching me. “There is. When you called me, I was with her.” He latched onto my hand, holding tight enough to ensure I couldn’t break free. “Nothing was going on, I promise you. I was telling her I wasn’t over you, I wouldn’t be getting over you and that I would be with no one but you.” My heart dropped into my feet. I wanted to give in—so bad. Can’t give in. I’d warned him. Take your refusal one step at a time. Otherwise I’d crumble like a cookie. First step. “Cole,” I said, plucking at the sheet covering me. “No. We’re not going there. You’re a relationship runner, not a sticker, and I can’t go through another breakup.” He held me tighter. “Correction. I was a runner. I’m now a sticker. I get it now. I was letting fear make my decisions for me. I was so afraid of losing someone else, I was always looking for the expiration date. Not just with you, but with all my girlfriends.” Could a girl dance for joy and sob with despair at the same time? Second step. “I’m glad you realize that, and that you’re determined to move forward, but what happens if you also realize you never got over some of those other girls?” “That’s not possible. I want you. And I know you warned me, told me not to even think about crawling back. I know I messed up in the worst possible way, something I can promise you will never happen again. I know, but I’m still coming after you with everything I’ve got.” I might have sobbed. Third step, the hardest. “Cole—” “Shh, baby. Please. Listen to me. You’re a part of me, and I’ll take whatever you’re willing to give me, for however long you’re willing to give it.” He rushed on, adding, “I’ve walked away from a lot of girls. Sometimes it hurt. Sometimes it didn’t. But I always got over it, and thought I was better for it. I haven’t gotten over you, Ali, and I’m definitely not better. I need you. Please,” he repeated. Another attempt at that third step. “No,” I whispered. Together, we were a roller coaster. Up and down, up and down. Sometimes you just had to stay off the ride. “My answer is no.” He wasn’t deterred. “I gave up too easily, and I’m not making that mistake again. I should have fought for you, just like you said. I realize that now. I didn’t trust you. Well, I’m going to trust you now, because I can’t live with the results of not trusting you.” As he spoke, every word wrapped in longing, he leaned forward, toward me. I absorbed the words, such beautiful, needed words. Soothing words. I wanted so badly to meet him halfway. Tears filled my eyes, spilled over. Fourth step. The final. “I’m sorry. I can’t. I just can’t.” “Baby, don’t cry. It hurts me to know I’ve upset you.” He wiped the droplets away with his thumb. “Okay, we won’t talk about this right now.” He drew in a breath, released it. “Let’s talk about the spy.” Definitely sobbed. “Yes. Okay.” “I know we suspect Gavin and Veronica—” “I don’t,” I said, doing my best to remain calm. “Everything inside me says they’re innocent.” He nodded. “Okay. I told you I trust you, and I do. I will. In everything, in every way.” I...didn’t know what to say. I gulped. “That leaves Kat, Reeve and Ethan,” he added, filling the silence. “Ethan is the only unknown.” “Then we’ll start with him.” We, he’d said. A waft of air hit me, and I shivered with cold. “May I hold you?” he asked. I tried to say no, I really did. “Yes.” I’d had a last kiss. Now I would have a last embrace. He climbed into bed with me, gathered me against him. I’d missed him. I’d missed this. His warmth enveloped me, and his strength soothed me. Meaningless... Right. “We found your phone in the woods when we swept the area for more photos. You can text your grandmother.” He pulled the device from his pocket. I accepted gratefully and shot Nana a text to tell her I was okay, I loved her and I would be home by eleven, just as Cole had promised. Her response was immediate. Don’t ever worry me like that again. Me: Will try my best. “Ask me something,” Cole said after I’d set the phone on the cart beside the bed. “Like what?” I said, confused. “Anything you want to know. You ask, and I’ll answer. I want you to get to know me better. Before, you said we didn’t know each other well enough, that the vision brought us together.” Carte blanche? Yes, please. So sure this is meaningless? “Who was your first time?” I asked. He snorted, saying, “Wow, okay. You aren’t messing around, are you? And just so you know, I don’t usually discuss these kinds of details with anyone. For you, though... I was fifteen, and she was twenty-one, the daughter of one of my mother’s friends. I lasted about five seconds.” I tried to swallow my giggles, failed. “Ugh, I shouldn’t be laughing at your extremely poor seduction skills. Because, Cole, that pervy woman totally took advantage of your childhood innocence.” He barked out a laugh, the sound rusty but so danged welcome. “You are too adorable for words.” “Why? It’s true.” “Maybe.” Not maybe. “If a twenty-one-year-old man had sex with me when I was fifteen, would you be laughing?”","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-44.html","bookId":2521,"book":{"id":2521,"title":"Through the Zombie Glass (White Rabbit Chronicles #2)","description":"Storyline: Through the Zombie Glass (White Rabbit Chronicles #2) Zombies stalk the night. Forget blood and brains. These monsters hunger for human souls. Sadly, they\u0027ve got mine... Alice Bell has lost so much. Family. Friends. A home. She thought she had nothing else to give. She was wrong. After a new zombie attack, strange things begin to happen to her. Mirrors come to life, and the whispers of the dead assault her ears. But the worst? A terrible darkness blooms inside her, urging her to do very wicked things. She\u0027s never needed her team of zombie slayers more, but ultra bad-boy Cole Holland, the leader and her boyfriend, suddenly withdraws from her...from everyone. Now, with her best friend Kat at her side, Ali must kill the zombies, uncover Cole\u0027s secret and learn to fight the darkness. But the clock is ticking...and if she fails at a single task, they\u0027re all doomed.","cover":"https://allnovel.net/images/through-the-zombie-glass-white-rabbit-chronicles-2.jpg","author":"Gena Showalter","type":"Horror","source":"allnovel","link":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:28:26 PM"}}
