{"id":108935,"no":9,"title":"Page 9","content":"\n “I’m actually seeing someone else,” Reeve admitted quietly.\n “What!” Kat gasped. “And you didn’t tell me? Who is it? How long has this been going on?”\n “I’ll share if you will.”\n Kat’s excitement deflated. “I’m not sure I know what you’re talking about.”\n From the corner of my eye, I spotted Wren Kyler and Poppy Verdeck making their way toward the concession stand. They made a striking pair, the beautiful black girl and the delicate redhead. A few weeks ago, Kat, Reeve and I would have been with them.\n The moment I’d started dating Cole and she’d gotten back together with Frosty, they’d dropped us. We were now considered troublemakers, a bad bet, and they’d thought their futures would be brighter without us.\n They were probably right.\n Justin was dating Wren, and he walked behind the pair. He looked up, his gaze landing on me as if he’d known where I was all along. Just like before, his eyes pleaded at me.\n I broke the connection.\n “Hey, can I talk to you?” Gavin asked me. “Alone?”\n Hillary/Belinda opened her mouth to protest, quickly closed it.\n My palms began to sweat. Gavin wanted to find out if we’d have another vision, didn’t he?\n I nodded, trying to sound normal as I said, “Sure. Why not?”\n We stood in unison. He led me up the bleachers, his hand on my lower back, making me uncomfortable.\n “Here’s good.” He stopped at a secluded spot overlooking the parking lot, then motioned to the section we’d just abandoned. “I need to be able to see the girls.”\n Agreed. Emma hadn’t formed a rabbit cloud, so I wasn’t worried about an attack, but I’d learned to err on the side of caution.\n “Before you ask,” I said, still not meeting his gaze. “I don’t know what causes the visions—or, apparently, what stops them. I thought building emotional walls was the key, but I’d built what I considered an impenetrable fortress against you before Hearts and yet we had another one.”\n He pushed out a heavy breath. “Note to self. Take Prozac before talking to Ali.”\n That probably wasn’t a bad idea. “I don’t think we should look at each other. Not here. Just in case.”\n “All right. Where? When?”\n How about...never? I ignored the questions, saying, “Have you experienced a vision with anyone else?”\n “No. But you have.”\n “Yes.” And I was clearly the only unchanging variable. Somehow, this was all my fault. “What did you see in the barn?” Maybe he’d seen something different. Maybe—\n “I saw you tasting my neck.”\n I gulped. No maybe. We’d seen the same thing. “That’s never going to happen.”\n “That’s not what Cole said.”\n Fury rose inside me, even though I’d already suspected Gavin had spilled the worst of the details. “You told him?”\n “Of course. I had to. He’s my friend. You’re his girl.”\n Was I? I licked my lips. “When did you do it? What’d he say?”\n “The day after the incident at the club. And nothing. He stormed off.”\n Why hadn’t he called me?\n I had to talk to him. I had to explain...what? What could I say to make this better?\n “I feel the need to reiterate—I’m never going to lick you or throw you on my bed,” I said.\n Gavin fingered a lock of my hair. “Honey, I have to agree with you on that one. You’re not even close to being my type.”\n “What type is that? Easy?”\n “Among other things,” he said unabashedly.\n I stepped away from him and gripped the railing in front of me. In the parking lot, darkness was chased away by the occasional streetlamp, revealing car after car.\n “I just want to figure out what’s going on,” he said.\n “Me, too. And by the way, you’re not my type, either.”\n “You don’t like sexy?”\n I rolled my eyes. “I just like Cole.”\n “So you like moody and broody.”\n I kind of wanted to smile at that. “I—” The scent of rot hit me, and I wrinkled my nose. Stiffening, I searched for any other sign of the zombies. They couldn’t be here. They—\n Were here.\n Red eyes cut through the night, and my heart skittered into a wild beat. Anyone who wandered through the parking lot would be unable to see the evil lurking nearby, and the odds were good they’d become dinner.\n “They’re here,” I said, trying not to panic. “The zombies are here.”\n Chapter 4\n Blood and Tears\n I beat feet to my friends. “Stay here. No matter what you see or hear, don’t leave the bleachers until I come back to get you, okay?” The zombies might have braved the parking lot, but their sensitive flesh would sizzle up here in the lights.\n Kat paled—she knew what was happening. “Okay.”\n “What’s going on?” Reeve demanded. “I’ve seen Bronx, Frosty and Cole act this way. Heard them say these things.”\n Unfazed, Gavin pointed a finger in her face. “Do as you’ve been told or I’ll make sure you regret it.” He switched his attention to his two-night stand. “You, too.”\n We didn’t say anything else to the girls. There just wasn’t time. Together, we pounded down the rest of the bleacher steps.\n “You up for this, cupcake?” Gavin asked.\n “Always. Jack-hole.”\n He laughed.\n As I ran, I withdrew my phone and dialed Frosty. There was no reason to try to reach Cole right now. He’d just send me to voice mail. But Frosty failed to answer, as well. I left a message. “We’re at the game. The enemy has entered the parking lot. Send backup ASAP.”\n Justin appeared at my side, keeping pace as we closed in on the darkness. “How many?” he demanded.\n “Go home,” I snapped. “We don’t need your kind of help. You’ll feed us to the Hazmats the moment we’re distracted.” He had before.\n “I won’t. Trust me.”\n Trust him, when I was struggling to trust Cole?\n “He works with the Hazmats?” Gavin slowed down, moving behind us. Without any more warning than that, he punched Justin in the back of the head, knocking the boy forward. “Then he doesn’t work with us.”\n Justin tripped over his own feet and went down, his hands and knees absorbing most of the impact. He could have recovered, but Gavin kicked him in the center of his back, sending him flying onto his stomach. Then Gavin stomped over his body and continued onward.\n Part of me wanted to protest his methods. I wasn’t Justin’s friend, but wow. The other part of me was kind of impressed. He-slut had skills.\n The moment we hit the parking lot, I withdrew my favorite daggers from the purse hanging at my side, then dropped the purse on the ground, not wanting to give the zombies anything extra to grab onto. There were streetlamps to my far left and right, illuminating sections of the lot. Four kids I recognized from school were climbing into a red truck. Another two were standing in front of a sedan, a girl leaning against the hood, a boy leaning against her.\n “Get out of here,” I shouted, cruel to be kind. Contrary to popular opinion, stupidity did not make a less-than-delicious brain.\n A strip of darkness consumed the center, and that was where we headed. I looked for the glow of the Blood Lines, but...found none. Very well. None of the cars would be solid to us when we entered the spirit realm. We could ghost through—and so could the zombies.\n The closer we drew, the stronger the scent of rot became, and I gagged.\n “Let’s do this,” Gavin said, and stepped out of his body as if it were a suit of armor he’d gotten tired of wearing.\n As Cole had once told me, people were spirits. We had a soul, and we lived in a body. The spirit was the power source. The soul was the mind, will and emotions, and linked to the power. The body was the house.\n I, too, forced my spirit and soul to split from my body, and my body froze in place, unable to move until I reentered it. If anyone stumbled upon the motionless shell, well, they’d get no response and I was sure there would be trouble. Can’t be helped.\n Instantly the air became colder, and the light I’d admired only a few seconds ago was too bright, making my eyes water. A typical reaction to leaving the natural realm and entering the spiritual.\n “Shout if you get into trouble,” Gavin called.\n I didn’t reply. Sometimes it was just better to remain silent.\n Whatever a slayer said while in spirit form came true. Well, mostly. There were two caveats. We had to believe it, and we couldn’t violate someone else’s free will.\n Some things happened instantly. Some took a while. As long as the words met the requirements, they happened. No exceptions.\n Gavin picked up speed and moved in front of me. He extended both his arms, fired two SIG Sauers—and bonus points to me for knowing the type...or brand...whatever! Sparks exploded from the barrels, and the ensuing boom, boom made me cringe. Not that anyone around us would hear it.\n The fight was on.\n The two zombies closest to us went down. But a heartbeat later, they were climbing back to their feet, ready for more. I frowned. The bullets should have slowed them, at least a little. Zombies felt no pain, but their spiritual bodies were subject to injury, just like ours.\n “I didn’t miss,” Gavin gritted. He fired the guns until they ran out of bullets.\n He reached the creatures first, using the two he’d decorated with holes as punching bags.\n I reached my own target and gave a wide slash of my dagger, clipping his spine, nearly removing his head. An action that would merely disable. There was only one thing that could forever end these creatures, and it was the fire from a slayer’s hands. But I could have a lot of fun beforehand.\n I kicked the next one in the stomach, knocking him backward and revealing the zombie coming in behind him. Too late. He moved too quickly. The new addition pushed me, and I pinwheeled over a body, landing with a hard thud, my side throbbing. I was jumped and pinned a second later, teeth going for my neck. I broke his nose and his jaw and wiggled out from under him; he ended up gnawing on pavement. \n","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-9.html","bookId":2521,"book":{"id":2521,"title":"Through the Zombie Glass (White Rabbit Chronicles #2)","description":"Storyline: \n Through the Zombie Glass (White Rabbit Chronicles #2) \n Zombies stalk the night. Forget blood and brains. These monsters hunger for human souls. Sadly, they\u0027ve got mine... \n Alice Bell has lost so much. Family. Friends. A home. She thought she had nothing else to give. She was wrong. \n After a new zombie attack, strange things begin to happen to her. Mirrors come to life, and the whispers of the dead assault her ears. But the worst? A terrible darkness blooms inside her, urging her to do very wicked things. \n She\u0027s never needed her team of zombie slayers more, but ultra bad-boy Cole Holland, the leader and her boyfriend, suddenly withdraws from her...from everyone. Now, with her best friend Kat at her side, Ali must kill the zombies, uncover Cole\u0027s secret and learn to fight the darkness. \n But the clock is ticking...and if she fails at a single task, they\u0027re all doomed.\n \n","cover":"https://allnovel.net/images/through-the-zombie-glass-white-rabbit-chronicles-2.jpg","author":"Gena Showalter","type":"Horror","source":"allnovel","link":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:28:26 PM"}}
