{"id":35462,"no":29,"title":"Part 2 Chapter 12 In which Mrs. Macwhirter has a New Bonnet","content":"Now though the unhappy Philip slept quite soundly, so that his boots, those tramp-worn sentries, remained en faction at his door until quite a late hour next morning; and though little Charlotte, after a prayer or two, sank into the sweetest and most refreshing girlish slumber, Charlotte’s father and mother had a bad night; and, for my part, I maintain that they did not deserve a good one. It was very well for Mrs. Baynes to declare that it was MacWhirter’s snoring which kept them awake (Mr. and Mrs. Mac being lodged in the bed-room over their relatives) — I don’t say a snoring neighbour is pleasant — but what a bedfellow is a bad conscience! Under Mrs. Baynes’s night-cap the grim eyes lie open all night; on Baynes’s pillow is a silent, wakeful head that hears the hours toll. A plague upon the young man! (thinks the female bonnet de nuit); how dare he come in and disturb everything? How pale Charlotte will look to-morrow when Mrs. Hely calls with her son! When she has been crying she looks hideous, and her eyelids and nose are quite red. She may fly out, and say something wicked and absurd, as she did to-day. I wish I had never seen that insolent young man, with his carroty beard, and vulgar blucher boots! If my boys were grown up, he should not come hectoring about the house as he does; they would soon find a way of punishing his impudence! Baulked revenge and a hungry disappointment, I think, are keeping that old woman awake; and, if she hears the hours tolling, it is because wicked thoughts make her sleepless. As for Baynes, I believe that old man is awake, because he is awake to the shabbiness of his own conduct. His conscience has got the better of him, which he has been trying to bully out of doors. Do what he will, that reflection forces itself upon him. Mac, Bunch, and the doctor all saw the thing at once, and went dead against him. He wanted to break his word to a young fellow, who, whatever his faults might be, had acted most nobly and generously by the Baynes family. He might have been ruined but for Philip’s forbearance; and showed his gratitude by breaking his promise to the young fellow. He was a henpecked man — that was the fact. He allowed his wife to govern him: that little old plain, cantankerous woman asleep yonder. Asleep. Was she? No. He knew she wasn’t. Both were lying quite still, wide awake, pursuing their dismal thoughts. Only Charles was owning that he was a sinner, whilst Eliza, his wife, in a rage at her last defeat, was meditating how she could continue and still win her battle. Then Baynes reflects how persevering his wife is; how, all through life, she has come back and back and back to her point, until he has ended by an almost utter subjugation. He will resist for a day: she will fight for a year, for a life. If once she hates people, the sentiment always remains with her fresh and lively. Her jealousy never dies; nor her desire to rule. What a life she will lead poor Charlotte now she has declared against Philip! The poor child will be subject to a dreadful tyranny: the father knows it. As soon as he leaves the house on his daily walks, the girl’s torture will begin. Baynes knows how his wife can torture a woman. As she groans out a hollow cough from her bed in the midnight, the guilty man lies quite mum under his own counterpane. If she fancies him awake, it will be his turn to receive the torture. Ah, Othello, mon ami! when you look round at married life, and know what you know, don’t you wonder that the bolster is not used a great deal more freely on both sides? Horrible cynicism! Yes — I know. These propositions served raw are savage, and shock your sensibility; cooked with a little piquant sauce, they are welcome at quite polite tables. “Poor child! Yes, by George! What a life her mother will lead her!” thinks the general, rolling uneasy on the midnight pillow. “No rest for her, day or night, until she marries the man of her mother’s choosing. And she has a delicate chest — Martin says she has; and she wants coaxing and soothing, and pretty coaxing she will have from mamma!” Then, I daresay, the past rises up in that wakeful old man’s uncomfortable memory. His little Charlotte is a child again, laughing on his knee, and playing with his accoutrements as he comes home from parade. He remembers the fever which she had, when she would take medicine from no other hand; and how, though silent with her mother, with him she would never tire of prattling, prattling. Guilt-stricken old man! are those tears trickling down thy old nose? It is midnight. We cannot see. When you brought her to the river, and parted with her to send her to Europe, how the little maid clung to you, and cried, “Papa, papa!” Staggering up the steps of the ghaut, how you wept yourself — yes, wept tears of passionate, tender grief at parting with the darling of your soul. And now, deliberately, and for the sake of money, you stab her to the heart, and break your plighted honour to your child. “And it is yonder cruel, shrivelled, bilious, plain old woman who makes me do all this, and trample on my darling, and torture her!” he thinks. In Zoffany’s famous picture of Garrick and Mrs. Pritchard as Macbeth and Lady Macbeth, Macbeth stands in an attitude hideously contorted and constrained, while Lady Mac is firm and easy. Was this the actor’s art, or the poet’s device? Baynes is wretched, then. He is wrung with remorse, and shame, and pity. Well, I am glad of it. Old man, old man! how darest thou to cause that child’s tender little bosom to bleed? How bilious he looks the next morning! I declare as yellow as his grim old wife. When Mrs. General B. hears the children their lessons, how she will scold them! It is my belief she will bark through the morning chapter, and scarce understand a word of its meaning. As for Charlotte, when she appears with red eyes, and ever so little colour in her round cheek, there is that in her look and demeanour which warns her mother to refrain from too familiar abuse or scolding. The girl is in rebellion. All day Char was in a feverish state, her eyes flashing war. There was a song which Philip loved in those days: the song of Ruth. Char sate down to the piano, and sang it with a strange energy. “Thy people shall be my people” — she sang with all her heart — “and thy God my God!” The slave had risen. The little heart was in arms and mutiny. The mother was scared by her defiance. As for the guilty old father: pursued by the fiend remorse, he fled early from his house, and read all the papers at Galignani’s without comprehending them. Madly regardless of expense, he then plunged into one of those luxurious restaurants in the Palais Royal, where you get soup, three dishes, a sweet, and a pint of delicious wine for two frongs, by George! But all the luxuries there presented to him could not drive away care, or create appetite. Then the poor old wretch went off, and saw a ballet at the Grand Opera. In vain. The pink nymphs had not the slightest fascination for him. He hardly was aware of their ogles, bounds, and capers. He saw a little maid with round, sad eyes; — his Iphigenia whom he was stabbing. He took more brandy-and-water at cafés on his way home. In vain, in vain, I tell you! The old wife was sitting up — for him, scared at the unusual absence of her lord. She dared not remonstrate with him when he returned. His face was pale. His eyes were fierce and bloodshot. When the general had a particular look, Eliza Baynes cowered in silence. Mac, the two sisters, and, I think, Colonel Bunch (but on this point my informant, Philip, cannot be sure) were having a dreary rubber when the general came in. Mrs. B. knew by the general’s face that he had been having recourse to alcoholic stimulus. But she dared not speak. A tiger in a jungle was not more savage than Baynes sometimes. “Where’s Char?” he asked in his dreadful, his Bluebeard voice. “Char was gone to bed,” said mamma, sorting her trumps. “Hm! Augoost, Odevee, Osho!” Did Eliza Baynes interfere, though she knew he had had enough? As soon interfere with a tiger, and tell him he had eaten enough sepoy. After Lady Macbeth had induced Mac to go through that business with Duncan, depend upon it she was very deferential and respectful to her general. No groans, prayers, remorses could avail to bring his late majesty back to life again. As for you, old man, though your deed is done, it is not past recalling. Though you have withdrawn from your word on a sordid money pretext; made two hearts miserable; stabbed cruelly that one which you love best in the world; acted with wicked ingratitude towards a young man, who has been nobly forgiving towards you and yours; and are suffering with rage and remorse, as you own your crime to yourself; — your deed is not past recalling as yet. You may soothe that anguish, and dry those tears. It is but an act of resolution on your part, and a firm resumption of your marital authority. Mrs. Baynes, after her crime, is quite humble and gentle. She has half murdered her child, and stretched Philip on an infernal rack of torture; but she is quite civil to everybody at madame’s house. Not one word does she say respecting Mrs. Colonel Bunch’s outbreak of the night before. She talks to sister Emily about Paris, the fashions, and Emily’s walks on the Boulevard and the Palais Royal with her major. She bestows ghastly smiles upon sundry lodgers at table. She thanks Augoost when he serves her at dinner, and says, “Ah, madame, que le boof est bong aujourdhui, rien que j’aime comme le potofou.” Oh, you old hypocrite! But you know I, for my part, always disliked the woman, and said her good humour was more detestable than her anger. You hypocrite! I say again; ay, and avow that there were other hypocrites at the table, as you shall presently hear. When Baynes got an opportunity of speaking unobserved, as he thought, to madame, you may be sure the guilty wretch asked her how his little Charlotte was. Mrs. Baynes trumped her partner’s best heart at that moment, but pretended to observe or overhear nothing. “She goes better — she sleeps,” madame said. “Mr. the Doctor Martin has commanded her a calming potion.” And what if I were to tell you that somebody had taken a little letter from Charlotte, and actually had given fifteen sous to a Savoyard youth to convey that letter to somebody else? What if I were to tell you that the party to whom that letter was addressed, straightway wrote an answer — directed to Madame de Smolensk, of course? I know it was very wrong; but I suspect Philip’s prescription did quite as much good as Dr. Martin’s, and don’t intend to be very angry with madame for consulting the unlicensed practitioner. Don’t preach to me, madam, about morality, and dangerous examples set to young people. Even at your present mature age, and with your dear daughters around you, if your ladyship goes to hear the Barber of Seville, on which side are your sympathies — on Dr. Bartolo’s , or Miss Rosina’s? Although, then, Mrs. Baynes was most respectful to her husband, and by many grim blandishments, humble appeals, and forced humiliations, strove to conciliate and soothe him, the general turned a dark, lowering face upon the partner of his existence: her dismal smiles were no longer pleasing to him: he returned curt “Oh’s !” and “Ah’s!” to her remarks. When Mrs. Hely and her son and her daughter drove up in their family coach to pay yet a second visit to the Baynes’ family, the general flew in a passion and cried, “Bless my soul, Eliza, you can’t think of receiving visitors, with our poor child sick in the next room? It’s inhuman!” The scared woman ventured on no remonstrances. She was so frightened that she did not attempt to scold the younger children. She took a piece of work, and sat amongst them, furtively weeping. Their artless queries and unseasonable laughter stabbed and punished the matron. You see people do wrong, though they are long past fifty years of age. It is not only the scholars, but the ushers, and the head-master himself, who sometimes deserve a chastisement. I, for my part, hope to remember this sweet truth, though I live into the year 1900. To those other ladies boarding at madame’s establishment, to Mrs. Mac and Mrs. Colonel Bunch, though they had declared against him, and expressed their opinions in the frankest way on the night of the battle royal, the general was provokingly polite and amiable. They had said, but twenty-four hours since, that the general was a brute; and Lord Chesterfield could not have been more polite to a lovely young duchess than was Baynes to these matrons next day. You have heard how Mrs. Mac had a strong desire to possess a new Paris bonnet, so that she might appear with proper lustre among the ladies on the promenade at Tours? Major and Mrs. Mac and Mrs. Bunch talked of going to the Palais Royal (where MacWhirter said he had remarked some uncommonly neat things, by George! at the corner shop under the glass gallery). On this, Baynes started up, and said he would accompany his friends, adding, “You know, Emily, I promised you a hat ever so long ago!” And those four went away together, and not one offer did Baynes make to his wife to join the party; though her best bonnet, poor thing, was a dreadfully old performance, with moulting feathers, rumpled ribbons, tarnished flowers, and lace bought in St. Martin’s Alley months and months before. Emily, to be sure, said to her sister, “Eliza, won’t you be of the party? We can take the omnibus at the corner, which will land us at the very gate.” But as Emily gave this unlucky invitation, the general’s face wore an expression of ill-will so savage and terrific, that Eliza Baynes said, “No, thank you, Emily; Charlotte is still unwell, and I— I may be wanted at home.” And the party went away without Mrs. Baynes; and they were absent I don’t know how long; and Emily MacWhirter came back to the boarding-house in a bonnet — the sweetest thing you ever saw! — green piqué velvet, with a ruche full of rosebuds, and a bird of paradise perched on the top, pecking at a bunch of the most magnificent grapes, poppies, ears of corn, barley, all indicative of the bounteous autumn season. Mrs. General Baynes had to see her sister return home in this elegant bonnet; to welcome her; to acquiesce in Emily’s remark that the general had done the genteel thing; to hear how the party had further been to Tortoni’s , and had ices; and then to go upstairs to her own room, and look at her own battered, blowsy old chapeau, with its limp streamers, hanging from its peg. This humiliation, I say, Eliza Baynes had to bear in silence, without wincing, and, if possible, with a smile on her face. In consequence of circumstances before indicated, Miss Charlotte was pronounced to be very much better when her papa returned from his Palais Royal trip. He found her seated on madame’s sofa, pale, but with the wonted sweetness in her smile. He kissed and caressed her with many tender words. I daresay he told her there was nothing in the world he loved so much as his Charlotte. He would never willingly do anything to give her pain, never! She had been his good girl, and his blessing, all his life! Ah! that is a prettier little picture to imagine — that repentant man, and his child clinging to him — than the tableau overhead, viz. Mrs. Baynes looking at her old bonnet. Not one word was said about Philip in the talk between Baynes and his daughter, but those tender paternal looks and caresses carried hope into Charlotte’s heart; and when her papa went away (she said afterwards to a female friend), “I got up and followed him, intending to show him Philip’s letter. But at the door I saw mamma coming down the stairs; and she looked so dreadful, and frightened me so, that I went back.” There are some mothers I have heard of, who won’t allow their daughters to read the works of this humble homilist, lest they should imbibe “dangerous” notions, My good ladies, give them Goody Twoshoes if you like, or whatever work, combining instruction and amusement, you think most appropriate to their juvenile understandings; but I beseech you to be gentle with them. I never saw people on better terms with each other, more frank, affectionate, and cordial, than the parents and the grown-up young folks in the United States. And why? Because the children were spoiled, to be sure! I say to you, get the confidence of yours — before the day comes of revolt and independence, after which love returneth not. Now, when Mrs. Baynes went in to her daughter, who had been sitting pretty comfortably kissing her father, on the sofa in madame’s chamber, all those soft tremulous smiles, and twinkling dew-drops of compassion and forgiveness which anon had come to soothe the little maid, fled from cheek and eyes. They began to flash again with their febrile brightness, and her heart to throb with dangerous rapidity. “How are you now?” asks mamma, with her deep voice. “I am much the same,” says the girl, beginning to tremble. “Leave the child; you agitate her, madam,” cries the mistress of the house, coming in after Mrs. Baynes. That sad, humiliated, deserted mother goes out from her daughter’s presence, hanging her head. She put on the poor old bonnet, and had a walk that evening on the Champs Elysées with her little ones, and showed them Guignol. She gave a penny to Guignol’s man. It is my belief that she saw no more of the performance than her husband had seen of the ballet the night previous, when Taglioni, and Noblet, and Duvernay, danced before his hot eyes. But then, you see, the hot eyes had been washed with a refreshing water since, which enabled them to view the world much more cheerfully and brightly. Ah, gracious heaven, give us eyes to see our own wrong, however dim age may make them; and knees not too stiff to kneel, in spite of years, cramps, and rheumatism! That stricken old woman, then, treated her children to the trivial comedy of Guignol. She did not cry out when the two boys climbed up the trees of the Elysian Fields, though the guardians bade them descend. She bought pink sticks of barley-sugar for the young ones. Withdrawing the glistening sweetmeats from their lips, they pointed to Mrs. Hely’s splendid barouche as it rolled citywards from the Bois de Boulogne. The grey shades were falling, and Auguste was in the act of ringing the first dinner bell at Madame Smolensk’s establishment, when Mrs. General Baynes returned to her lodgings. Meanwhile, aunt MacWhirter had been to pay a visit to little Miss Charlotte, in the new bonnet which the general, Charlotte’s papa, had bought for her. This elegant article had furnished a subject of pleasing conversation between niece and aunt, who held each other in very kindly regard, and all the details of the bonnet, the blue flowers, scarlet flowers, grapes, sheaves of corn, lace, were examined and admired in detail. Charlotte remembered the dowdy old English thing which aunt Mac wore when she went out? Charlotte did remember the bonnet, and laughed when Mrs. Mac described how papa, in the hackney coach on their return home, insisted upon taking the old wretch of a bonnet, and flinging it out of the coach window into the road, where an old chiffonnier passing picked it up with his iron hook, put it on his own head, and walked away grinning. I declare, at the recital of this narrative, Charlotte laughed as pleasantly and happily as in former days; and, no doubt, there were more kisses between this poor little maid and her aunt. Now, you will remark, that the general and his party, though they returned from the Palais Royal in a hackney coach, went thither on foot, two and two — viz. Major MacWhirter leading, and giving his arm to Mrs. Bunch (who, I promise you, knew the shops in the Palais Royal well), and the general following at some distance, with his sister-in-law for a partner. In that walk a conversation very important to Charlotte’s interests took place between her aunt and her father. “Ah, Baynes! this is a sad business about dearest Char,” Mrs. Mac broke out with a sigh. “It is indeed, Emily,” says the general, with a very sad groan on his part. “It goes to my heart to see you, Baynes; it goes to Mac’s heart. We talked about it ever so late last night. You were suffering dreadfully; and all the brandypawnee in the world won’t cure you, Charles.” “No, faith,” says the general, with a dismal screw of the mouth. “You see, Emily, to see that child suffer tears my heart out — by George, it does. She has been the best child, and the most gentle, and the merriest, and the most obedient, and I never had a word of fault to find with her; and — poo-ooh!” Here the general’s eyes, which have been winking with extreme rapidity, give way; and at the signal pooh! there issue out from them two streams of that eye-water which we have said is sometimes so good for the sight. “My dear kind Charles, you were always a good creature,” says Emily, patting the arm on which hers rests. Meanwhile Major-General Baynes, C.B., puts his bamboo cane under his disengaged arm, extracts from his hind pocket a fine large yellow bandana pocket-handkerchief, and performs a prodigious loud obligato — just under the spray of the Rond-point fountain, opposite the Bridge of the Invalides, over which poor Philip has tramped many and many a day and night to see his little maid. “Have a care with your cane, then, old imbecile!” cries an approaching foot-passenger, whom the general meets and charges with his iron ferule. “Mille pardong, mosoo, je vous demande mille pardong,” says the old man, quite meekly. “You are a good soul, Charles,” the lady continues; “and my little Char is a darling. You never would have done this of your own accord. Mercy! And see what it was coming to: Mac only told me last night. You horrid, blood-thirsty creature! Two challenges — and dearest Mac as hot as pepper! Oh, Charles Baynes, I tremble when I think of the danger from which you have all been rescued! Suppose you brought home to Eliza — suppose dearest Mac brought home to me killed by this arm on which I am leaning. Oh, it is dreadful, dreadful! We are sinners all, that we are, Baynes!” “I humbly ask pardon for having thought of a great crime. I ask pardon,” says the general, very pale and solemn. “If you had killed dear Mac, would you ever have had rest again, Charles?” “No; I think not. I should not deserve it,” answers the contrite Baynes. “You have a good heart. It was not you who did this. I know who it was. She always had a dreadful temper. The way in which she used to torture our poor dear Louisa who is dead, I can hardly forgive now, Baynes. Poor suffering angel! Eliza was at her bed-side nagging and torturing her up to the very last day. Did you ever see her with her nurses and servants in India? The way in which she treated them was — ” “Don’t say any more. I am aware of my wife’s faults of temper. Heaven knows it has made me suffer enough!” says the general, hanging his head down. “Why, man — do you intend to give way to her altogether? I said to Mac last night, ‘Mac, does he intend to give way to her altogether? The Army List doesn’t contain the name of a braver man than Charles Baynes, and is my sister Eliza to rule him entirely, Mac!’ I said. No; if you stand up to Eliza, I know from experience she will give way. We have had quarrels, scores and hundreds, as you know, Baynes.” “Faith, I do,” owns the general, with a sad smile on his countenance. “And sometimes she has had the best and sometimes I have had the best, Baynes! But I never yielded, as you do, without a fight for my own. No, never, Baynes! And me and Mac are shocked, I tell you, fairly, when we see the way in which you give up to her!” “Come, come. I think you have told me often enough that I am henpecked,” says the general. “And you give up not yourself only, Charles, but your dear, dear child — poor little suffering love!” “The young man’s a beggar!” cries the general, biting his lips. “What were you, what was Mac and me when we married? We hadn’t much besides our pay, had we? we rubbed on through bad weather and good, managing as best we could, loving each other, God be praised! And here we are, owing nobody anything, and me going to have a new bonnet!” and she tossed up her head, and gave her companion a good-natured look through her twinkling eyes. “Emily, you have a good heart! that’s the truth,” says the general. “And you have a good heart, Charles, as sure as my name’s MacWhirter; and I want you to act upon it, and I propose — ” “What?” “Well, I propose that — ” But now they have reached the Tuileries garden gates, and pass through, and continue their conversation in the midst of such a hubbub that we cannot overhear them. They cross the garden, and so make their way into the Palais Royal, and the purchase of the bonnet takes place; and in the midst of the excitement occasioned by that event, of course, all discussion of domestic affairs becomes uninteresting. But the gist of Baynes’s talk with his sister-in-law may be divined from the conversation which presently occurred between Charlotte and her aunt. Charlotte did not come in to the public dinner. She was too weak for that; and “un bon bouillon” and a wing of fowl were served to her in the private apartment, where she had been reclining all day. At dessert, however, Mrs. MacWhirter took a fine bunch of grapes and a plump rosy peach from the table, and carried them to the little maid, and their interview may be described with sufficient accuracy, though it passed without other witnesses. From the outbreak on the night of quarrels, Charlotte knew that her aunt was her friend. The glances of Mrs. MacWhirter’s eyes, and the expression of her bonny, homely face, told her sympathy to the girl. There were no pallors now, no angry glances, no heartbeating. Miss Char could even make a little joke when her aunt appeared, and say, “What beautiful grapes! Why, aunt, you must have taken them out of the new bonnet!” “You should have had the bird of paradise, too, dear, only I see you have not eaten your chicken! She is a kind woman, Madame Smolensk. I like her. She gives very nice dinners. I can’t think how she does it for the money, I am sure!” “She has been very, very kind to me; and I love her with all my heart!” cries Charlotte. “Poor darling! We have all our trials, and yours have begun, my love!” “Yes, indeed, aunt!” whimpers the young person; upon which osculation possibly takes place. “My dear! when your papa took me to buy the bonnet, we had a long talk, and it was about you.” “About me, aunt!” warbles Miss Charlotte. “He would not take mamma; he would only go with me, alone. I knew he wanted to say something about you; and what do you think it was? My dear, you have been very much agitated here. You and your poor mamma are likely to disagree for some time. She will drag you to those balls and fine parties, and bring you those fine partners.” “Oh, I hate them!” cries Charlotte. Poor little Hely Walsingham, what had he done to be hated? “Well. It is not for me to speak of a mother to her own daughter. But you know mamma has a way with her. She expects to be obeyed. She will give you no peace. She will come back to her point again and again. You know how she speaks of some one — a certain gentleman? If ever she sees him, she will be rude to him. Mamma can be rude at times — that I must say of my own sister. As long as you remain here — ” “Oh, aunt, aunt! Don’t take me away, don’t take me away!” cries Charlotte. “My dearest, are you afraid of your old aunt, and your uncle Mac, who is so kind, and has always loved you? Major MacWhirter has a will of his own, too, though of course I make no allusions. We know how admirably somebody has behaved to your family. Somebody who has been most ungratefully treated, though of course I make no allusions. If you have given away your heart to your father’s greatest benefactor, do you suppose I and uncle Mac will quarrel with you? When Eliza married Baynes (your father was a penniless subaltern then, my dear, — and my sister was certainly neither a fortune nor a beauty), didn’t she go dead against the wishes of our father? Certainly she did! But she said she was of age — that she was, and a great deal more, too — and she would do as she liked, and she made Baynes marry her. Why should you be afraid of coming to us, love? You are nearer somebody here, but can you see him? Your mamma will never let you go out, but she will follow you like a shadow. You may write to him. Don’t tell me, child. Haven’t I been young myself; and when there was a difficulty between Mac and poor papa, didn’t Mac write to me, though he hates letters, poor dear, and certainly is a stick at them? And, though we were forbidden, had we not twenty ways of telegraphing to each other? Law! your poor dear grandfather was in such a rage with me once, when he found one, that he took down his great buggy whip to me, a grown girl!” Charlotte, who has plenty of humour, would have laughed at this confession some other time, but now she was too much agitated by that invitation to quit Paris which her aunt had just given her. Quit Paris? Lose the chance of seeing her dearest friend, her protector? If he was not with her, was he not near her? Yes, near her always! On that horrible night, when all was so desperate, did not her champion burst forward to her rescue? Oh, the dearest and bravest! Oh, the tender and true! “You are not listening, you poor child!” said aunt Mac, surveying her niece with looks of kindness. “Now listen to me once more. Whisper!” And sitting down on the settee by Charlotte’s side, aunt Emily first kissed the girl’s round cheek, and then whispered into her ear. Never, I declare, was medicine so efficacious, or rapid of effect, as that wondrous distilment which aunt Emily poured into her niece’s ear! “Oh, you goose!” she began by saying, and the rest of the charm she whispered into that pearly little pink shell round which Miss Charlotte’s soft, brown ringlets clustered. Such a sweet blush rose straightway to the cheek! Such sweet lips began to cry, “Oh, you dear, dear aunt,” and then began to kiss aunt’s kind face, that, I declare, if I knew the spell, I would like to pronounce it right off, with such a sweet young patient to practise on. “When do we go? To-morrow, aunt, n’est-ce pas? Oh, I am quite strong! never felt so well in my life! I’ll go and pack up this instant,” cries the young person. “Doucement! Papa knows of the plan. Indeed, it was he who proposed it.” “Dearest, best father!” ejaculates Miss Charlotte. “But mamma does not; and if you show yourself very eager, Charlotte, she may object, you know. Heaven forbid that I should counsel dissimulation to a child; but under the circumstances, my love — At least I own what happened between Mac and me. Law! I didn’t care for papa’s buggy whip! I knew it would not hurt; and as for Baynes, I am sure he would not hurt a fly. Never was man more sorry for what he has done. He told me so whilst we walked away from the bonnet-shop, whilst he was carrying my old yellow. We met somebody near the Bourse. How sad he looked, and how handsome, too! I bowed to him and kissed my hand to him, that is, the knob of my parasol. Papa couldn’t shake hands with him, because of my bonnet, you know, in the brown-paper bag. He has a grand beard, indeed! He looked like a wounded lion. I said so to papa. And I said, ‘It is you who wound him, Charles Baynes!’ ‘I know that,’ papa said. ‘I have been thinking of it. I can’t sleep at night for thinking about it: and it makes me dee’d unhappy.’ You know what papa sometimes says? Dear me! You should have heard them, when Eliza and I joined the army, years and years ago!” For once, Charlotte Baynes was happy at her father’s being unhappy. The little maiden’s heart had been wounded to think that her father could do his Charlotte a wrong. Ah! take warning by him, ye greybeards; and however old and toothless, if you have done wrong, own that you have done so; and sit down and say grace, and mumble your humble pie! The general, then, did not shake hands with Philip; but Major MacWhirter went up in the most marked way, and gave the wounded lion his own paw, and said, “Mr. Firmin. Glad to see you! If ever you come to Tours, mind, don’t forget my wife and me. Fine day. Little patient much better! Bon courage, as they say!” I wonder what sort of a bungle Philip made of his correspondence with the Pall Mall Gazette that night? Every man who lives by his pen, if by chance he looks back at his writings of former years, lives in the past again. Our griefs, our pleasures, our youth, our sorrows, our dear, dear friends, resuscitate. How we tingle with shame over some of those fine passages! How dreary are those disinterred jokes! It was Wednesday night, Philip was writing off at home, in his inn, one of his grand tirades, dated “Paris, Thursday” — so as to be in time, you understand, for the post of Saturday, when the little waiter comes and says, winking, “Again that lady, Monsieur Philippe!” “What lady?” asks our own intelligent correspondent. “That old lady who came the other day; you know.” “C’est moi, mon ami!” cries Madame Smolensk’s well-known grave voice. “Here is a letter, d’abord. But that says nothing. It was written before the grande nouvelle — the great news — the good news!” “What good news?” asks the gentleman. “In two days miss goes to Tours with her aunt and uncle — this good Macvirterre. They have taken their places by the diligence of Lafitte and Caillard. They are thy friends. Papa encourages her going. Here is their card of visit. Go thou also; they will receive thee with open arms. What hast thou, my son?” Philip looked dreadfully sad. An injured and unfortunate gentleman at New York had drawn upon him, and he had paid away everything he had but four francs, and he was living on credit until his next remittance arrived. “Thou hast no money! I have thought of it. Behold of it! Let him wait — the proprietor!” And she takes out a bank-note, which she puts in the young man’s hand. “Tiens, il l’embrasse encor c’te vicille!” says the little knife-boy. “J’aimerai pas ?a, moi, par examp!”","sourceLink":"http://novel.tingroom.com/lizhi/609/398.html","bookId":288,"book":{"id":288,"title":"The Adventures of Philip on his way through the World","description":"简介： Not attend her own son when he is ill! said my mother. She does not deserve to have a son! And Mrs. Pendennis looked towards her own only darling whilst uttering this indignant exclamation. As she looked, I know what passed through her mind...","cover":"https://cunovel.com/defaultCover.png","type":"Inspirational","link":"http://novel.tingroom.com/lizhi/609","creation":"Aug 1, 2019 12:18:30 AM","modification":"Aug 1, 2019 12:18:30 AM"}}
