{"id":109794,"no":9,"title":"Page 9","content":"CHAPTER 18\n Shadowphobia\n Saturday morning Josh Spagnola was sleeping in and dreaming of putting shampoo into bunnies\u0027 eyes when the Harley-Davidson crashed through his front door carrying a 270-pound, pissed-off, speed-crazed biker named Tinker. With the crash and thunder of the bike in his living room, Spagnola sat up in his nest of satin sheets thinking earthquake, listening for the sounds of his burglar alarms, which did not come. Spagnola\u0027s house was wired six ways to stop an elegant picklock or spry cutpurse from entering by stealth, sneak, or cat\u0027s-paw; he had, in fact, protected himself against someone exactly like himself. That anyone would break in on a battering ram of Milwaukee iron, in broad daylight, had never occurred to him.\n Tinker, on the other hand, took the words breaking and entering quite literally, and found entering a rather empty experience without substantial breaking. He carried on his belt a policeman\u0027s riot baton, a blackjack, two hunting knives, and a set of brass knuckles. In a rare moment of sanity he had left his guns at home. His lawyer had advised against guns while on probation.\n Tinker had received an early-morning call from Lonnie Ray, one of his brothers in the Guild.\n \"You want him dead?\" Tinker had asked Lonnie.\n \"No, just fuck him up. And don\u0027t wear your colors. I don\u0027t want any connection to me.\"\n \"Is he big?\" Tinker had a deep-seated fear of someday meeting someone as large and violent as himself.\n \"I don\u0027t know. Just wait until I call. You\u0027ll see the black Mercedes.\"\n \"You got it, bro,\" Tinker said, and hung up.\n Tinker tried to wait for Lonnie\u0027s call, but he\u0027d been up all night cooking up a batch of methedrine in the Guild\u0027s lab, and had lost his patience after sampling the product in order to take the edge off the case of beer he\u0027d drunk. At daybreak his bloodlust got the better of him and he left.\n In the bedroom, hearing a Harley do burnouts on his Berber carpet, Spagnola finally realized that something was seriously wrong. He leapt from bed and began searching through a trail of clothes he had left last night on the way to bed with the Tuesday-Thursday-Saturday masseuse from the Cliffs. He remembered kicking his gun belt away from the bedroom door when he sent her home at midnight and scrambled to the door. He was bending to unholster the gun when Tinker kicked the door open, catching Spagnola square in the forehead, knocking him cold.\n Tinker looked down at the naked, unconscious little man and let out a sigh. The absence of terror was wildly unsatisfying for him. As a gesture of brotherhood to Lonnie he pulled the baton from his belt and with two vicious blows broke both of Spagnola\u0027s legs, then he sulked out of the bedroom, mounted his bike, and rode to the Guild\u0027s clubhouse to watch Saturday-morning cartoons.\n -\u003d*\u003d-\n Sam awoke to Yiffer yelling, \"Get down! Don\u0027t let them see you!\"\n Sam looked around the room. Calliope and Grubb were gone. He got up and reached for his watch on the dresser while shouts and whispers continued from the living room. Six in the morning. It must have gone on all night: the shouting, the pounding, the babies crying. He was lucky to have slept at all. He dressed and walked into the living room.\n \"Get down,\" Yiffer said. \"Don\u0027t let them see you.\" Sam dropped to a crouch in the doorway. Nina and Calliope were huddled under the front windows holding the babies. Yiffer was crouched by the door that led to the balcony. He rose up to peek out the window, then instantly dropped to cover.\n \"What is it?\" Sam said. \"Is someone shooting?\"\n Nina said, \"No, it\u0027s the garage sale people. Stay down.\"\n \"Good morning,\" Calliope said. \"Did you sleep well?\"\n \"Fine. Who are the garage sale people?\"\n \"They\u0027re fucking predators,\" Yiffer said. \"They keep circling like sharks. Look.\" Yiffer gestured to the window.\n Sam duck-walked to the window and peeked over the edge. Dodge Darts and Ford Escorts were cruising slowly by, stopping in front of the house, then moving slowly on.\n Nina said, \"Yiffer put the ad in the paper for our yard sale with the wrong date. They\u0027re all looking for us.\"\n \"Five of them have been to the door already,\" Yiffer said. \"Whatever you do, don\u0027t answer it. They\u0027ll tear us apart.\"\n \"Probably ten of them went to Lonnie\u0027s door and left when he didn\u0027t answer,\" Calliope said.\n \"What happened with Lonnie?\" Sam said.\n Yiffer rose up and peeked out the window. \"Christ! There\u0027s a whole van full of them outside.\" He dropped to a sitting position, his back to the door. To Sam he said, \"Lonnie didn\u0027t answer when I went down there last night. As soon as he heard me come back upstairs he got on his bike and left.\"\n Nina said, \"How long are they going to circle? I have to go to work today.\"\n \"They\u0027re never going to leave,\" Yiffer wailed hopelessly. \"They\u0027re going to just wait and pick us off one by one. We\u0027re doomed. We\u0027re doomed.\"\n Nina slapped Yiffer across the face. \"Get a grip.\"\n Sam could think of only one thing, the cigarettes on the seat of his car. He had gone sixteen hours without a smoke and was feeling as if he would snap like Yiffer in a few minutes if he didn\u0027t get some nicotine into his system. \"I\u0027m going out there,\" he said. He felt like John Wayne - before the lung cancer.\n \"No, dude. Don\u0027t do it,\" Yiffer pleaded.\n \"I\u0027m going.\" Sam stood up and Yiffer covered his head as if expecting an explosion. Sam picked up Grubb\u0027s plastic donut on wheels. \"Can I borrow this?\"\n \"Sure,\" Calliope said. \"Are you coming back?\"\n Sam paused for a minute, then smiled and took her hand. \"Definitely,\" he said. \"I just need to take a shower and handle a few things. I\u0027ll call you, okay?\" Calliope nodded.\n \"You\u0027ll never see him alive again,\" Yiffer whined.\n Nina looked up apologetically. \"He had a lot to drink last night. I\u0027m sorry if our fighting disturbed you.\"\n \"No problem,\" Sam said. \"Nice meeting you both.\" He turned and walked through the kitchen and out the door.\n As he went down the steps, the van that Yiffer had spotted screeched to a halt in front of the duplex and a dozen gray-haired ladies piled out and rushed him. They met at the bottom of the steps.\n \"Where\u0027s the sale?\" one said.\n \"This is the right address. We checked it twice.\"\n \"Where\u0027s the bargains? The ad said bargains.\"\n Sam held the plastic donut up before them. \"This is it, ladies. I\u0027m sorry, but everything was gone but this when I got here. We were all too late. The quick and the dead, you know.\"\n A collective moan came from the mob, then one shouted, \"I\u0027ll give you ten bucks for it!\"\n \"Twelve!\" another shouted.\n \"Twelve fifty.\"\n Sam gestured for them to be quiet. \"No, I need this,\" he said solemnly. He hugged the donut to his chest.\n Their purpose gone, they milled around for a moment, then gradually wandered back to the van. Sam stood for a moment watching them. The other garage sale people who had been circling the block saw them leaving, and Sam could almost feel the disappointment settling into their collective consciousness as they broke pattern and drove off.\n \"Great night,\" Coyote said.\n Sam\u0027s nerves had been so worn from the night and morning that he didn\u0027t even jump at the voice by his ear. He looked over his shoulder to see Coyote in his black buckskins and a huge, white ten-gallon cowboy hat. \"Nice hat,\" Sam said.\n \"I\u0027m in disguise.\"\n \"Swell,\" Sam said. \"I can\u0027t get rid of you, can I?\"\n \"Can you wipe off your shadow?\"\n \"That\u0027s what I thought,\". Sam said. \"Let\u0027s go.\"\n -\u003d*\u003d-\n The shogun of the Big Sky Samurai Golf Course and Hot Springs was worried. His name was Kiro Yashamoto. He was driving his wife and two children in a rented Jeep station wagon up a winding mountain road to look at an ancient Indian medicine wheel. The day before, Kiro had purchased two thousand acres of land (with hot springs and trout stream) near Livingston, Montana, for roughly the price he would have paid for a studio apartment in Tokyo. The deal did not worry him; after the golf course and health club were built he would recoup his investment in a year from the droves of Japanese tourists who would come there. His children worried him.\n During this trip Kiro\u0027s son, Tommy, who was fourteen, and his daughter, Michiko, who was twelve, had both decided that they wanted to attend American universities and live in the United States. Tommy wanted to run General Motors and Michiko wanted to be a patent attorney. As he drove, Kiro listened to his children discussing their plans in English; they paused only when Kiro pointed out some natural wonder, at which time they would dutifully acknowledge the interruption before returning to their conversation. It had been the same at the Custer Battlefield, the Grand Canyon, and even Disneyland, where the children marveled at the machinations of commerce and missed those of magic.\n My children are monsters, Kiro thought. And I am responsible. Perhaps if I had read them the haikus of Basho when they were little instead of that American manifesto of high-pressure sales, Green Eggs and Ham...\n Kiro steered the jeep around a long gradual curve that rounded the peak of the mountain and the medicine wheel came into view: huge stones formed spokes almost two hundred feet long. In the center of the wheel a tattered figure lay prostrate in the dirt.\n \"Look, father,\" Michiko said. \"They have hired an Indian to take tickets and he has fallen asleep on the job.\"\n Kiro got out of the Jeep and walked cautiously toward the center of the wheel. He\u0027d learned a lesson in caution when Tommy had nearly been trampled in Yellowstone National Park while trying to videotape a herd of buffalo. Tommy and Michiko ran to their father\u0027s side while Mrs. Yashamoto stayed in the car and checked off the medicine wheel on the itinerary and maps.\n Tommy panned the camcorder as he walked. \"It\u0027s just rocks, Father.\"\n \"So is the Zen garden at Kyoto just rocks.\"\n \"But you could make a wheel of rocks at your golf course and people wouldn\u0027t have to drive up here to see them. You could hire a Japanese to take tickets so you wouldn\u0027t lose revenue.\"\n They reached the Indian and Tommy put the camcorder on the macro setting for a close-up. \"Look, he has fallen asleep with his face on the ground.\"\n Kiro bent and felt the Indian\u0027s neck for a pulse. \"Michiko, bring water from the Jeep. Tommy, put down that camera and help me turn this man over. He is sick.\"\n They turned the Indian over and cradled his head on Kiro\u0027s rolled-up jacket. He found a beaded wallet in the Indian\u0027s overalls and handed it to Tommy. \"Look for medical information.\"\n Michiko returned with a bottle of Evian water and handed it to her father. \"Mother says that we should leave him here and go get help. She is worried about a lawsuit for improper care.\"\n Kiro waved his daughter away and held the water to the Indian\u0027s lips. \"This man will not live if we leave him now.\"\n Tommy pulled a square of paper from the beaded wallet. He unfolded it and his face lit up. \"Father, this Indian has a personal letter from Lee Iacocca, the president of Chrysler.\"\n \"Tommy, please look for medical information.\"\n \"His name is Pokey Medicine Wing. Listen:\n \u0027Dear Mr. Medicine Wing:\n \u0027Thank you for your recent suggestion for the naming of our new line of light trucks. It is true that we have had great success with our Dakota line of trucks, as well as the Cherokee, Comanche, and Apache lines of our Jeep/Eagle division, but after investigation by our marketing department we have found that the word Crow has a negative connotation with the car-buying public. We also found that the word Absarokee was too difficult to pronounce and Children of the Large-Beaked Bird was too long and somewhat inappropriate for the name of a truck.\n \u0027In answer to your question, we are not aware of any royalties paid to the Navaho tribe by the Mazda Corporation for the use of their name, and we do not pay royalties to the Comanche, Cherokee, or Apache tribes, as these words are registered trademarks of the Jeep Corporation.\n \u0027While your proposed boycott of Chrysler products by the Crow tribe and other Native Americans saddens us deeply, research has determined that they do not represent a large enough demographic to affect our profits.\n \u0027Please accept the enclosed blanket in thanks for bringing this matter to our attention.\n \u0027Sincerely, Lee Iacocca\n \u0027CEO, Chrysler Corporation. \"\n Kiro said, \"Tommy, put down the letter and help me sit him up so he can drink.\"\n Tommy said, \"If he knows Lee Iacocca he will be good to have as a contact, Father.\"\n \"Not if he dies.\"\n \"Oh, right.\" Tommy dropped to his knees and helped Kiro lift Pokey to a sitting position. Kiro held the bottle to Pokey\u0027s lips and the old man\u0027s eyes opened as he drank. After a few swallows he pushed the bottle away and looked up at Tommy. \"I burned the blanket,\" he said. \"Smallpox.\" Then he passed out.\n CHAPTER 19\n Five Faces of Coyote Blue\n Ever since the morning Adeline Eats had found the frost-covered liar in the grass behind Wiley\u0027s Food and Gas there had been a screech owl sitting atop the power pole in front of her house, sitting there like feathered trouble. In addition, Black Cloud Follows had blown a water pump, all of her kids were coming down with the flu, her husband, Milo, had gone off to a peyote ceremony, and she was trying desperately to stay out of Hell. It was unfair, she thought, that her new faith was being tested before the paint was even dry.\n She wanted the owl to go away and take her bad luck with it. But to a good Christian, an owl was just an owl. Only a traditional Crow believed in the bad luck of owls. A good Christian would just go out there and shoo that old owl away. Of course, it wouldn\u0027t bother a good Christian.\n Adeline had come to Christianity the same way she had come to sex and smoking: through peer pressure. Thinking about her six kids and her smoker\u0027s hack, she wondered if perhaps peer pressure didn\u0027t always lead to the best habits. Her sisters had all converted and they had referred to her as the heathen of the family until she caved in and accepted Christ. Now, only three weeks after being washed in the blood of the Lamb, she was already backsliding like a dog surprised down a skunk hole. The owl.\n Adeline looked out the front window to check on the owl; he was still there. Had he winked at her? She had pinned up her hair and was wearing sunglasses and a pair of Milo\u0027s overalls, hoping the owl wouldn\u0027t recognize her until she figured out what to do. She was tempted to pray to Jesus to make the owl go away, but if she did that, she would be admitting that she believed in the old ways and she\u0027d go to Hell. There was no Hell in the old ways. Then again, she could load up Milo\u0027s shotgun, walk out in the yard, and turn that old owl into pink mist. She couldn\u0027t see herself doing that either - no telling what kind of trouble that would unleash. And she couldn\u0027t wait for Milo and ask him for help: not after weeks of working on him to leave the Native American church and trade in his peyote buttons for wafers and wine.\n She ducked away from the window. One of the kids coughed in the other room. Eventually she was going to have to take them down to the clinic for treatment. But she was afraid to pass by the owl. According to the priest, God knew everything. The sunglasses and hairdo wouldn\u0027t fool God. God knew she was afraid, so He knew she still had faith in the old ways, so she was going to Hell as sure as if she\u0027d been out all morning worshiping golden calves and graven images.\n \"I got bad medicine from being Crow,\" she thought. \"And I\u0027m going to Hell for being Christian. I should have let that old liar Pokey freeze to death.\" She slapped herself on the forehead. \"Damn! Another Hell thought.\"\n -\u003d*\u003d-\n A nun with an Uzi popped up on the parapet of Notre Dame like a ninja penguin. Coyote shot from the hip, winging her before she could fire. She tumbled over the side, bounced off a gargoyle, and splattered on the sidewalk below. A synthesized Gregorian chant began to play as her spirit rose to heaven, a steel ruler in hand. Coyote strafed a stained-glass window and took out a bazooka-wielding bishop for two thousand penance points.\n Sam walked into the bedroom, hair wet, a towel wrapped around his hips. \"Nice shot,\" Sam said.\n Coyote glanced up from the video game. \"The red ones have killed me three times.\"\n \"Those are cardinals. You have to hit them twice to kill them. Wait until you get to the Vatican level. The pope has guilt-beam vision.\"\n Before Coyote could look back to the screen the cathedral doors flew open and St. Patrick fired a wiggling salvo of heat-seeking vipers.\n \"Hit your smart bomb,\" Sam said.\n Coyote fumbled with the control, but was too late. A snake latched onto his leg and exploded. The screen flashed GAME OVER, and a synthesized voice instructed Coyote to \"go to confession.\"\n Coyote dropped the control onto the bed with a sigh.\n Sam said, \"You did good. Gunning for Nuns is a hard game for beginners.\"\n \"I should have brought some cheating medicine. My cheating medicine never fails.\"\n \"This isn\u0027t like the hand game. This is a game of skill.\"\n \"Who needs skill when you can have luck?\"\n Sam shook his head and turned to go back to the bathroom. During the night something inside him had changed. Each time he thought things had reached a plateau of weirdness, something even weirder had happened. The result, he realized, was that he was now accepting anything that happened, no matter how weird, without resistance. Chaos was the new order in his life.\n The phone rang and Sam, hoping it was Calliope, grabbed the receiver off the vanity. \"Samuel Hunter,\" he said.\n \"You low-life, scum-sucking shithead!\"\n \"Good morning to you too, Josh.\"\n \"You win, dickhead. There\u0027ll be a meeting of the co-op association tonight. They\u0027ll vote you back in. You can keep your apartment, but I want your guarantee that this is over.\"\n \"Okay.\"\n \"I hope you know I\u0027ve lost all respect for you as a professional, Sam. The doctor says I\u0027m going to walk with a limp for the rest of my life.\"\n \"There was a crooked man who had a crooked-\"\n \"You broke my legs! My house is destroyed.\"\n Sam peeked into the bedroom where Coyote was attacking the Sistine Chapel with a helicopter gunship. \"Josh, I don\u0027t know what you\u0027re talking about, but I\u0027m glad you came to your senses.\"\n \"Fuck you. I\u0027m using up years of collected dirt to get your apartment back.\"\n \"Townhouse,\" Sam corrected. \"Not apartment.\"\n \"Don\u0027t fuck with me, Sam. I\u0027m in a cast up to my nipples and a sadistic nurse has been force-feeding me green Jell-O for an hour. Just tell me it\u0027s over.\"\n \"It\u0027s over,\" Sam said.\n The phone clicked. Sam walked back into the bedroom. \"What did you do to Spagnola?\"\n Coyote was rolling on the bed in exaggerated body English to tilt the gunship. \"These birds are eating my tail rotor. I can\u0027t control it.\"\n \"Uh-oh, St. Francis released the doves of death. You\u0027re dead meat.\" Sam took a cigarette from the pack on the dresser and offered one to Coyote. \"What did you do to Spagnola?\"\n \"You said you wanted your old life back.\"\n \"So you broke Spagnola\u0027s legs?\"\n \"It was a trick.\"\n \"You can\u0027t just go around breaking people\u0027s legs like some Mafioso fairy godmother.\"\n The gunship spun out of control and crashed on the mezzanine. Coyote threw the joystick at the screen and turned to Sam. \"How can I win if you keep talking to me? You whine like an old woman. I got you your house back!\"\n \"I wouldn\u0027t have lost it if you had left me alone. Be logical.\"\n \"What gods do you know that are logical? Name two.\"\n \"Never mind,\" Sam said. He went to the closet and pulled his clothing out for the day.\n Coyote said, \"Do you have a light?\"\n \"No.\"\n \"No? After I stole fire from the sun and gave it to your people?\"\n \"Why, Coyote? Why did you do that?\" Sam turned to point out the lighter on the dresser, but the trickster was gone.\n -\u003d*\u003d-\n Calliope\u0027s upbringing in the Eastern religions, with their emphasis on living in the now - of acting, not thinking - had left her totally unprepared to do battle with the future. She\u0027d tried to ignore it, even after Grubb was born, but it had become more and more difficult to function on karmic autopilot. Now, Sam had entered her life and she felt like she had something to lose. The future had a name. She wondered what she had done to manifest the curse of a nice guy.\n \"It feels wonderful, but I want more,\" Calliope said.\n \"I don\u0027t get it,\" Nina said. They were cleaning up the kitchen. Grubb was scooting around on the linoleum at their feet, tasting the baseboards, a table leg, a slow-moving bug.\n \"I\u0027ve always felt separate from men, even during sex. It\u0027s like there\u0027s this part of me that watches them and I\u0027m not really involved. But it wasn\u0027t that way with Sam. It was like we were really together, no barriers. I wasn\u0027t watching him, I was with him. When we were finished I lay there watching the pulse on his neck, and it was like we had gone to some other world together. I wanted more.\"\n \"So you\u0027re saying you\u0027re a hosebeast.\"\n \"Not like that. It was just that I want to feel that way all the time. I want my whole life to feel - complete.\"\n \"I\u0027m sorry, Calliope, I don\u0027t get it. I\u0027m happy if Yiffer doesn\u0027t pass out before we finish.\"\n \"I guess it\u0027s not a sexual thing. It\u0027s a spiritual thing. Like there\u0027s a part of life that I can touch but I can\u0027t live in.\"\n \"Maybe we just need to find a house where your ex doesn\u0027t live downstairs.\"\n \"That was pretty awful. I couldn\u0027t believe Sam didn\u0027t just leave.\"\n Nina threw a dish towel at Calliope and missed. \"You had a little good luck for a change, accept it. Not every guy has to be a creep like Lonnie.\"\n \"I\u0027m a little afraid to leave Grubb with him when I go to work today.\"\n \"Lonnie won\u0027t hurt Grubb. He was just pissed that you were with someone else. Men are like that. Even when they don\u0027t want you, they don\u0027t want anyone else to have you.\"\n \"Nina, do you think there\u0027s something wrong with me?\"\n \"No, you\u0027re just not very good at worrying. You\u0027ll get the hang of it.\"\n -\u003d*\u003d-\n \"I\u0027ve got to get back to the house,\" Lonnie said to Cheryl, who was pouring peroxide on his damaged chest. She wiped away the foam with a tissue, then poked the wound with a broken black fingernail.\n \"Ouch! What are you doing, bitch?\"\n Cheryl got up from the bed and pulled on a pair of leather pants. Lonnie could see her hipbones and shoulder blades pushing against her pale skin as if they would poke through any second.\n \"You\u0027re always thinking of her. Never me. What the hell is wrong with me?\"\n She turned to face him and he stared at her breasts lying like flaps against her ribs. She pulled back her lips in a snarl and Lonnie knew his face had betrayed him. \"Fucking asshole,\" she said, pulling on a black Harley-Davidson T-shirt.\n \"It\u0027s not her, it\u0027s the kid. He\u0027s my kid. I have to watch him when she goes to work.\"\n \"Bullshit. Then why won\u0027t you fuck me?\" She tossed her head and her long black hair fell into her face like seaweed on the drowned.\n Because you look like you just escaped from fucking Auschwitz, Lonnie thought. He\u0027d been with Cheryl for three months and had never seen her eat. As far as he could figure she lived on speed, come, and Pepsi. He said, \"I worry about the kid.\"\n \"Then get custody. I can take care of him. I\u0027d make a good mother.\"\n \"Right.\"\n \"You don\u0027t think so? You think that vegetarian bitch is a better mother than me?\"\n \"No...\"\n \"You start treating me right or I\u0027m gone.\" Cheryl took a purse from the floor and began digging in it. \"Where the fuck is my stash?\" She threw the purse aside and stormed out of the room.\n Lonnie followed her, carrying the denim vest sporting the Guild\u0027s colors. \"I\u0027ve got to go,\" he said.\n Cheryl was dumping a bindle of white powder into a can of Pepsi. \"Bring back some crank,\" she said.\n As Lonnie walked out she added, \"Tink called while you were sleeping. He said to tell you he took care of things.\"\n Outside Lonnie fired up his Harley and pulled out into the street. Tinker\u0027s news should have cheered him up, but it didn\u0027t. He felt empty, like he needed to get fucked up. He always felt that way lately. At one time being a brother in the Guild, being accepted for who he was, had been enough. Having all the women and drugs and money and power he needed had been enough. But since Grubb was born he felt like he was supposed to be doing something, and he didn\u0027t know what it was.\n Maybe the bitch is right, he thought. As long as the kid tied him to Calliope he was going to feel shitty. It was time to feel good again.\n -\u003d*\u003d-\n Frank Cochran, the cofounder of Motion Marine, Inc., had spent most of the morning in his office milling over the bane of his existence: the human factor. Frank loved organization, routine, and predictability. He liked his life to be linear, moving forward from event to event without the nasty backtracking caused by surprises. The human factor was his name for the variable of unpredictability that was added to the equation of life by human beings. Today, the human factor was represented by his partner, Jim Cable, who was in the hospital after being attacked by an Indian.\n Frank\u0027s thinking went thus: If Jim dies there\u0027ll be insurance hassles, legal battles with the family, and someone will have to comfort Jim\u0027s mistress. But if Jim lives - maybe Jim\u0027s mistress should be comforted anyway....\n His train of thought was broken by the buzz of the intercom on his desk. \"Mr. Cochran,\" his secretary said, \"there\u0027s a man from NARC here to see you.\"\n \"I don\u0027t have any appointments until after lunch, do I?\"\n The office door burst open and Cochran looked up to see an Indian in black buckskins striding toward him. His secretary was shouting protests from her desk.\n Cochran spoke into the intercom, \"Stella, do I have an appointment with this man?\"\n \"Native American Reform Coalition,\" Coyote said. \"I understand that some insurance agent is taking credit for what happened to your partner.\"\n Cochran had a very bad feeling about this. \"Look, I don\u0027t know who you are, but I don\u0027t like surprises.\"\n \"Then this is going to be a very bad day for you.\" Coyote slammed the door behind him. \"A very bad day.\" The trickster extended his right hand. \"Nice to meet you.\"\n Cochran watched in horror as the Indian\u0027s hand began to sprout fur and claws. \n","sourceLink":"https://allnovel.net/coyote-blue/page-9.html","bookId":2046,"book":{"id":2046,"title":"Coyote Blue","description":"Storyline: \n This is an accelerating comedy with shadows setting off the wry, polished humor. Trickster deities thrive on contrariety, which is why one finds them bringing life into dead landscapes and disorder into order. A Santa Barbara insurance salesman\u0027s too-tidily-contained lifestyle, far from the Crow reservation he grew up on, is an irresistible target for Coyote, who wants to make sure his chosen people don\u0027t forget him. Coyote descends on Sam Hunter like one of Job\u0027s plagues, albeit a charmingly disingenuous one. \"Why me? Why not someone who believes?\" asks Sam, suffering from god-induced chaos. \"This is more fun,\" says Coyote. He\u0027s right.\n \n","cover":"https://allnovel.net/images/coyote-blue.jpg","author":"Christopher Moore","type":"Humorous","source":"allnovel","link":"https://allnovel.net/coyote-blue.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:42:53 PM"}}
