{"id":84586,"no":19,"title":"Page 19","content":"“Why do you hate Juliet?” I ask Lindsay. It’s strange to me that I’ve never thought of asking until recently. I always just accepted it.\n Elody snorts and almost coughs up her Diet Coke. “Are you serious?”\n Lindsay’s clearly not prepared for the question. She opens her mouth, closes it, and then tosses her hair and rolls her eyes like she can’t believe I’m even asking. “I don’t hate her.”\n “Yes, you do.” It was Lindsay who found out that Juliet wasn’t sent a single rose freshman year, and Lindsay’s idea to send her a Valogram. It was Lindsay who nicknamed her Psycho, and who, all those years ago, spread the story of Juliet peeing on the Girl Scout camping trip.\n Lindsay stares at me like I’ve lost my mind. “Sorry,” she says, shrugging. “No breaks for mental-health patients.”\n “Don’t tell me you feel bad for her or something,” Elody says. “You know she should be locked up.”\n “Bellevue.” Ally giggles.\n “I was just wondering,” I say, stiffening when Ally says the B-word. There’s still always the possibility that I’ve gone totally, clinically cuckoo. But somehow I don’t think so anymore. An article I once read said that crazy people don’t worry about being crazy—that’s the whole problem.\n “So are we really staying in tonight?” Ally says, pouting. “The whole night?”\n I suck in my breath and look at Lindsay. Ally and Elody look at her too. She has final say on all of our major decisions. If she’s hell-bent on going to Kent’s, I’ll have a hard time getting out of it.\n Lindsay leans back in her chair and stares at me. I see something flicker in her eyes, and my heart stops, thinking that she’ll tell me to suck it up, that a party will do me good.\n But instead she cracks a smile and winks at me. “It’s just a party,” she says. “It’ll probably be lame anyways.”\n “We can rent a scary movie,” Elody pipes up. “You know, like we used to.”\n “It’s up to Sam,” Lindsay says. “Whatever she wants.”\n I could kiss her right then.\n I cut English with Lindsay again. We pass Alex and Anna in Hunan Kitchen, but today Lindsay doesn’t even pause, probably because she’s trying extra hard to be nice to me and she knows I hate confrontations.\n I hesitate, though. I think of Bridget putting her arms around Alex and looking at him like he’s the only guy on earth. She’s annoying, okay, but she deserves way better than him. It’s too bad.\n “Hello? Stalk much?” Lindsay says.\n I realize I’m just standing there staring past the ripped-up flyers advertising five-dollar lunch specials and local theater groups and hair salons. Alex Liment has spotted me through the window. He’s staring straight back at me.\n “I’m coming.” It is too bad, but really, what can you do? Live and let live.\n In The Country’s Best Yogurt, Lindsay and I both get heaping cups of double chocolate with crushed peanut butter cups, and I add sprinkles and Cap’n Crunch cereal. I have my appetite back, that’s for sure. Everything is working out the way I planned it. There won’t be any party tonight, at least not for us; there won’t be any driving or cars. I’m sure that this will fix everything—that the kink in time will be ironed out, that I’ll wake up from whatever nightmare I’ve been living. Maybe I’ll sit up, gasping, in a hospital bed somewhere, surrounded by friends and family. I can picture the scene perfectly: my mom and dad tearful, Izzy crying while she hangs on my neck, Lindsay and Ally and Elody and—\n An image of Kent flashes through my head and I push it away quickly.\n —And Rob. Of course Rob.\n But this is the key, I’m sure of it. Live the day out. Follow the rules. Stay away from Kent’s party. Simple.\n “Careful.” Lindsay grins, shoveling a huge spoonful of yogurt into her mouth. “You don’t want to be fat and a virgin.”\n “Better than fat with gonorrhea,” I say, flicking a chocolate chip at her.\n She flicks one back. “Are you kidding? I’m so clean you could eat off me.”\n “The Lindsay buffet. Does Patrick know you’re giving it up like that?”\n “Gross.”\n Lindsay is wrestling with her jumbo cup, trying to dig out the perfect bite. But we’re both laughing, and she ends up lobbing a full spoonful of yogurt at me. It hits me right above the left eye.\n She gasps and claps one hand over her mouth. The yogurt slides down my face and lands with a plop right on the fur covering my left boob.\n “I am so, so sorry,” Lindsay says, her voice muffled by her hand. Her eyes are wide, and it’s obvious she’s trying not to laugh. “Do you think your shirt is ruined?”\n “Not yet,” I say, and dig out a big scoop of yogurt and flick it at her. It hits her in the side of her head, right in her hair.\n She shrieks, “Bitch!” and then we’re ducking around the TCBY hiding behind chairs and tables, digging big scoops of double chocolate and using our spoons like catapults to peg each other.\n YOU CAN’T JUDGE A GYM TEACHER BY HIS HANDLEBAR MUSTACHE\n Lindsay and I can’t stop cracking up on the way back to school. It’s hard to explain, but I’m feeling happier than I have in years, like I’m noticing everything for the first time: the sharp smell of winter, the light strange and slanted, the way the clouds are drawing over the sky slowly. The fur of our tank tops is completely matted and gross, and we have water stains everywhere. Cars keep honking at us, and we wave and blow them all kisses. A black Mercedes rolls by, and Lindsay bends over, smacks her butt, and screams, “Ten dollar! Ten dollar!”\n I punch her in the arm. “That could be my dad.”\n “Sorry to break it to you, but your dad does not drive a Mercedes.” Lindsay pushes her hair out of her face. It’s stringy and wet. We had to wash off in the bathroom as the woman at TCBY screamed at us and threatened to call the police if we ever stepped foot in the store again.\n “You’re impossible,” I say.\n “You know you love me,” she says, grabbing my arm and huddling up next to me. We’re both freezing.\n “I do love you,” I say, and I really mean it. I love her, I love the ugly mustard yellow bricks of Thomas Jefferson and the magenta-tinted halls. I love Ridgeview for being small and boring, and I love everyone and everything in it. I love my life. I want my life.\n “Love you too, babes.”\n When we get back to school Lindsay wants to have a cigarette, even though the bell for eighth is going to ring any second.\n “Two drags,” Lindsay says, widening her eyes, and I laugh and let her pull me along because she knows I can never say no to her when she makes that face. The Lounge is empty. We stand right next to the tennis courts, huddled together, while Lindsay tries to get a match lit.\n Finally she does, and she takes a long drag, letting a plume of smoke out of her mouth.\n A second later we hear a shout from across the parking lot: “Hey! You! With the cigarette!”\n We both freeze. Ms. Winters. Nic Nazi.\n “Run!” Lindsay screams after a split second, dropping her cigarette. She takes off behind the tennis courts even though I yell, “Over here!” I see the big blond pouf of Ms. Winters’s hair bobbing over the cars—I’m not sure if she’s seen us or just heard us laughing. I duck behind a Range Rover and cut across Senior Alley to one of the back doors in the gym as Ms. Winters keeps screaming, “Hey! Hey!”\n I grab the handle and rattle it, but the door sticks. For a second my heart stops, and I’m sure it’s locked, but then I slam up against it and it opens into a storage closet. I jump inside and close the door behind me, heart thumping in my chest. A minute later I hear feet pound past the door. Then I hear Ms. Winters mutter, “Shit,” and the footsteps start retreating backward.\n The whole thing—the day, the fight in The Country’s Best Yogurt, the almost-bust, the idea of Lindsay crouching somewhere in the woods in her skirt and new Steve Madden boots—strikes me as so funny I have to clap my hand over my mouth to keep from laughing. The room I’m standing in smells like soccer cleats and jerseys and mud, and with the stack of orange cones and bag full of basketballs piled in the corner, there’s barely enough room for me to stand. One side of the room is windowed and it looks into an office: Otto’s, probably, since he basically lives in the gym. I’ve never actually seen his office. His desk is piled with papers, and there’s a computer flashing a screen saver that looks like it’s a cheesy picture of a beach. I inch closer to the window, thinking how hilarious it would be if I could bust him with something dirty, like some underwear peeking out of a desk drawer or a porn mag or something, when the door of his office swings open and there he is.\n Instantly I drop to the ground. I have to scrunch up in a ball, and even then I’m paranoid that my ponytail might be peeking up over the windowsill. It sounds stupid considering everything that’s been happening, but all I can think in that moment is, If he sees me, I’m really dead. Good-bye, Ally’s house; hello, detention.\n My face is sandwiched up next to a half-open duffel bag that looks like it’s full of old basketball jerseys. I don’t know if they’ve never been washed or what, but the smell makes me want to gag.\n I hear Otto moving around his desk, and I’m praying—praying—that he doesn’t come close enough to the desk to see me bellying up to a bunch of old sports equipment. I can already hear the rumors: Samantha Kingston found humping driver’s ed cones.\n There’s a minute or two of shuffling, and my legs start cramping. The first bell has already rung for eighth—less than three minutes to class—but there’s no way for me to sneak out. The door is noisy, and besides, I have no way to know which direction he’s facing. He could be staring at the door.\n My only hope is that Otto has class eighth, but it doesn’t sound like he’s in a hustle to be anywhere. I imagine being trapped here until school ends. The stink alone will finish me off.\n I hear Otto’s door creak open again, and I perk up, thinking he’s leaving after all. But then a second voice says, “Damn. I missed them.”\n I would recognize that nasal whine anywhere. Ms. Winters.\n “Smokers?” Otto says. His voice is almost as high-pitched as hers. I had no idea they even knew each other. The only times I’ve ever seen them in the same room are at all-school assemblies, when Ms. Winters sits next to Principal Beneter looking like someone just set off a stink bomb directly under her chair, and Otto sits with the special ed teachers and the health instructor and the driver’s ed specialist and all the other weirdos who are on faculty but aren’t real teachers.\n “Do you know that the students call that little area the ‘Smokers’ Lounge’?” I can almost hear Ms. Winters pinching her nose.\n “Did you get a look at them?” Otto asks, and my muscles tense.\n “Not a good one. I could hear them and I smelled the smoke.” \n","sourceLink":"https://allnovel.net/before-i-fall/page-19.html","bookId":2757,"book":{"id":2757,"title":"Before I Fall","description":"Storyline: \n For popular high school senior Samantha Kingston, February 12—\"Cupid Day\"—should be one big party, a day of valentines and roses and the privileges that come with being at the top of the social pyramid. And it is…until she dies in a terrible accident that night. \n However, she still wakes up the next morning. In fact, Sam lives the last day of her life seven times, until she realizes that by making even the slightest changes, she may hold more power than she ever imagined.\n \n","cover":"https://allnovel.net/images/before-i-fall.jpg","author":"Lauren Oliver","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/before-i-fall.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 4:59:35 PM"}}
