{"id":84597,"no":31,"title":"Page 31","content":"His mouth falls open. “I never said—”\\n\\n “It’s not my fault I can’t be like you, okay? I don’t get up in the morning thinking the world is one big shiny, happy place, okay? That’s just not how I work. I don’t think I can be fixed.” I mean to say, I don’t think “it” can be fixed, but it comes out wrong, and suddenly I’m on the verge of crying. I have to take big gulping breaths to try to keep the tears down. I turn away from Kent so he won’t see.\\n\\n There’s a moment of silence that seems to last forever. Then Kent rests his hand on my elbow just for a second, his touch like the wings of something brushing me. Just that one little touch gives me the chills.\\n\\n “I was going to tell you that you look beautiful with your hair down. That’s all I was going to say.” Kent’s voice is steady and low. He moves around me to the head of the stairs, pausing just at the top. When he turns back to me he looks sad, even though he’s smiling the tiniest bit.\\n\\n “You don’t need to be fixed, Sam.” He says the words, but it’s like I don’t even hear them; it’s like they go through my whole body at the same time, like I’m absorbing them from the air. He must know it’s untrue. I open my mouth to tell him so, but he’s already disappearing down the stairs, melting into the crowd of people flowing into the house. I’m a nonperson, a shadow, a ghost. Even before the accident I’m not sure that I was a whole person—that’s what I’m realizing now. And I’m not sure where the damage begins.\\n\\n I take a big swig of beer, wishing I could just go blotto. I want the world to drop away. I take another big gulp. The beer is cold, at least, but tastes like moldy water.\\n\\n “Sam!” Tara’s coming up the stairs, her smile like the beam of a flashlight. “We’ve been looking for you.” When she gets to the top she pants a little, putting her right hand on her stomach and bending over. In her left hand she’s holding a cigarette, half smoked. “Courtney did recon. She found the good stuff.”\\n\\n “Good stuff?”\\n\\n “Whiskey, vodka, gin, cassis, the works. Booze. The good stuff.”\\n\\n She grabs my hand and we go back down the stairs, which are slowly getting clogged with people. Everyone’s moving in the same direction: from the entrance to the beer and then up the stairs. In the kitchen we push through the clot of people gathered by the keg. On the opposite side of the kitchen there’s a door with a handwritten sign on it. I recognize Kent’s handwriting.\\n\\n It says: PLEASE DO NOT ENTER.\\n\\n There’s a footnote written in tiny letters along the bottom of the page: SERIOUSLY, GUYS. I’M HOSTING THE PARTY AND IT’S THE ONE THING I ASK. LOOK! THERE’S A KEG BEHIND YOU!\\n\\n “Maybe we shouldn’t—” I start to say, but Tara has already slipped through the door so I follow her.\\n\\n It’s dark on the other side of the door, and cold. The only light comes from two enormous bay windows that face out onto the backyard.\\n\\n I hear giggling from somewhere deeper in the house, then the sound of someone bumping into something. “Careful,” someone hisses, and then I hear Courtney say, “You try to pour in the dark.”\\n\\n “This way,” Tara whispers. It’s weird how people’s voices get softer in the dark, like they can’t help it.\\n\\n We’re in the dining room. There’s a chandelier drooping from the ceiling like an exotic flower, and heavy curtains pooling at either side of the windows. Tara and I skirt around the dining room table—my mom would have a coronary from excitement, it must seat at least twelve—and out into a kind of alcove. This is where the bar is. Beyond the alcove is another dark room: from the sofas and bookshelves I can just make out, it looks like a library or a living room. I wonder how many rooms there are. The house seems to extend forever. It’s even darker here, but Courtney and Bethany are rooting around in some cabinets.\\n\\n “There must be fifty bottles in here,” Courtney says. It’s too dark to read labels, so she opens each bottle and sniffs it, guessing at the contents. “This is rum, I think.”\\n\\n “Freaky house, huh?” Bethany says.\\n\\n “I don’t mind it,” I say quickly, not sure why I feel defensive. I bet it’s beautiful during the day: room after room of light. I bet Kent’s house is always quiet, or there’s always classical music playing or something.\\n\\n Glass shatters next to me and something wet splatters on my leg. I jump as Courtney whispers, “What did you do?”\\n\\n “It’s not me,” I say as Tara says, “I didn’t mean to.”\\n\\n “Was that a vase?”\\n\\n “Ew. Some of it got on my shoe.”\\n\\n “Let’s just take the bottle and get out of here.”\\n\\n We slip back into the kitchen just as RJ Ravner yells, “Fire in the hole!” Matt Dorfman takes a cup of beer and starts chugging it. Everyone laughs and Abby McGail claps when he’s drained the cup. Someone turns up the music, and Dujeous comes on and everyone starts singing along. All MCs in the house tonight, if your lyrics sound tight then rock the mic….\\n\\n I hear high-pitched laughter. Then a voice from the front hallway: “God, I guess we came at the right time.”\\n\\n My stomach jumps into my throat. Lindsay’s here.\\n\\n THERE ARE CERTAIN THINGS YOU NEVER SAY\\n\\n Here’s Lindsay’s big secret: when she came back from visiting her stepbrother at NYU our junior year, she was awful for days—snapping at everybody, making fun of Ally for having weird food issues, making fun of Elody for being such a lush and a pushover, making fun of me for always being the last to do things, from picking up on trends to going to third base (which I didn’t do until late sophomore year). Elody, Ally, and I knew something must have happened in New York, but Lindsay wouldn’t tell us when we asked her, and we didn’t push it. You don’t push things with Lindsay.\\n\\n Then one night toward the end of the school year, we were all at Rosalita’s, this crappy Mexican restaurant one town over where they don’t card, having margaritas and waiting for our dinners to come. Lindsay wasn’t really eating—hadn’t really been eating since returning from New York. She wouldn’t touch the free chips, saying she wasn’t hungry, and instead kept dipping a finger into the salt that was rimming her margarita glass and eating the crystals one by one.\\n\\n I don’t remember what we were talking about, but all of a sudden Lindsay blurted out, “I had sex.” Just like that. We all stared at her in silence, and she leaned forward and told us in a breathless rush how she’d been drunk and how because her stepbrother wasn’t ready to leave the party the guy—the Unmentionable—offered to walk her back to the dorm where she was staying with her stepbrother. They’d had sex on her stepbrother’s twin long bed with Lindsay fading in and out, and the guy—the Unmentionable—was gone even before Lindsay’s brother got back from the party.\\n\\n “It was only, like, three minutes,” she said at the end, and I knew then she was already filing it away under Things We’ll Never Talk About, tucking it back in some far corner of her mind and building other, alternate stories on top of it, better stories: I went to New York and had a great time. I’m totally going to move there one day. I kissed a guy, and he wanted to come home with me, but I wouldn’t let him.\\n\\n Right after that our food came. Lindsay was hugely relieved after telling us—even though she swore us on pain of death to absolute secrecy—and her whole mood changed instantly. She sent back the salad she’d ordered (“Like I want to choke down that rabbit crap”) and ordered cheese-and-mushroom quesadillas, pork-stuffed burritos with extra sour cream and guacamole, an order of chimichangas for the table to split, and another round of margaritas. It was like a weight had been lifted, and we had the best dinner we’d had in years. All of us were stuffing our faces, even Ally, and drinking margarita after margarita in different flavors—mango, raspberry, orange—and laughing so loudly at least one table asked to be moved to a different part of the restaurant. I don’t remember what we were even talking about, but at one point Ally took a picture of Elody wearing a flour tortilla on her head and holding up a bottle of hot sauce. In the corner of the frame, you can see a third of Lindsay’s profile. She’s doubling over, cracking up, her face a bright purple. One hand is clutching her stomach.\\n\\n After dinner Lindsay threw down her mom’s credit card to pay for the whole thing. She’s only supposed to use it for emergencies, but she leaned forward over the table and made us all grab hands like we were praying. “This, my friends, was an emergency,” she said, and we all laughed because she was being melodramatic as usual. The plan was to go off to a party in the arboretum: a tradition on the first warm weekend of the year. We had the whole night ahead of us. Everyone was in a good mood. Lindsay was being normal again.\\n\\n Lindsay went to the bathroom to fix her makeup, and five seconds after she left the table, all those margaritas and all that laughing hit me at once: I’d never had to pee so bad in my life. I sprinted to the bathroom, still laughing, while Elody and Ally pegged me with half-eaten chips and crumpled napkins and yelled, “Send us a postcard from the Niagara Falls” and “If it’s yellow, keep it mellow!” so that yet another table asked to be moved.\\n\\n The bathroom was single-person, and I leaned up against the door, calling for Lindsay to let me in, rattling the handle at the same time. I guess she’d been in a rush to get in there because she hadn’t locked the door correctly and it opened as I was leaning against it. I tumbled into the bathroom, still laughing, expecting to find Lindsay standing in front of the mirror with her lips puckered, applying two coats of MAC Vixen lip gloss.\\n\\n Instead she was kneeling on the floor in front of the toilet, and the remains of the quesadillas and the pork-stuffed burrito were floating on the surface of the water. She flushed but not quickly enough. I saw two whole undigested tomato pieces swirl down the toilet bowl.\\n\\n All the laughter left me instantly. “What are you doing?” I asked, even though it was obvious.\\n\\n “Shut the door,” she hissed.\\n\\n I closed it quickly, the noise of the restaurant vacuumed away, leaving silence.\\n\\n Lindsay got up from her knees slowly. “Well?” she said, looking at me like she was already preparing her arguments—like she expected me to accuse her of something.\\n\\n “I had to pee,” I said. It’s so lame, but I couldn’t think of anything else. There was a tiny piece of food clinging to a strand of hair and seeing it made me feel like bursting into tears. She was Lindsay Edgecombe: she was our armor.\\n\\n “Pee then,” she said, looking relieved, though I thought I saw a flicker of something else—maybe sadness.\\n\\n I did. I peed while Lindsay bent over the sink, cupping her hands and sipping water from them, rolling it around in her mouth and gargling. That’s a funny thing: you think, when awful things happen, everything else just stops, like you would forget to pee and eat and get thirsty, but it’s not really true. It’s like you and your body are two separate things, like your body is betraying you, chugging on, idiotic and animal, craving water and sandwiches and bathroom breaks while your world falls apart. \\n\\n","sourceLink":"https://allnovel.net/before-i-fall/page-31.html","bookId":2757,"book":{"id":2757,"title":"Before I Fall","description":"Storyline: For popular high school senior Samantha Kingston, February 12—\"Cupid Day\"—should be one big party, a day of valentines and roses and the privileges that come with being at the top of the social pyramid. And it is…until she dies in a terrible accident that night. \\n However, she still wakes up the next morning. In fact, Sam lives the last day of her life seven times, until she realizes that by making even the slightest changes, she may hold more power than she ever imagined.\\n","cover":"https://allnovel.net/images/before-i-fall.jpg","author":"Lauren Oliver","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/before-i-fall.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 4:59:35 PM"}}
