{"id":32431,"no":29,"title":"CHAPTER XXIX. THE LOST BANK BOOK.","content":"Carl was not long in concluding that he had been robbed by his roommate. It was hard to believe that a Stuyvesant—a representative of one of the old Dutch families of New Amsterdam—should have stooped to such a discreditable act. Carl was sharp enough, however, to doubt the genuineness of Mr. Stuyvesant’s claims to aristocratic lineage. Meanwhile he blamed himself for being so easily duped by an artful adventurer. To be sure, it was not as bad as it might be. His pocketbook only contained ten dollars in small bills. The balance of his money he had deposited for safe keeping in the inside pocket of his vest. This he had placed under his pillow, and so it had escaped the notice of the thief. The satchel contained a supply of shirts, underclothing, etc., and he was sorry to lose it. The articles were not expensive, but it would cost him from a dozen to fifteen dollars to replace them. Carl stepped to the door of his stateroom and called a servant who was standing near. “How long have we been at the pier?” he asked. “About twenty minutes, sir.” “Did you see my roommate go out?” “A tall young man in a light overcoat?” “Yes.” “Yes, sir. I saw him.” “Did you notice whether he carried a valise in his hand?” “A gripsack? Yes, sir.” “A small one?” “Yes, sir.” “It was mine.” “You don’t say so, sir! And such a respectable-lookin’ gemman, sir.” “He may have looked respectable, but he was a thief all the same.” “You don’t say? Did he take anything else, sir?” “He took my pocketbook.” “Well, well! He was a rascal, sure! But maybe it dropped on the floor.” Carl turned his attention to the carpet, but saw nothing of the lost pocketbook. He did find, however, a small book in a brown cover, which Stuyvesant had probably dropped. Picking it up, he discovered that it was a bank book on the Sixpenny Savings Bank of Albany, standing in the name of Rachel Norris, and numbered 17,310. “This is stolen property, too,” thought Carl. “I wonder if there is much in it.” Opening the book he saw that there were three entries, as follows: 1883. Jan. 23. Five hundred dollars. “ June 10. Two hundred dollars. “ Oct. 21. One hundred dollars. There was besides this interest credited to the amount of seventy-five dollars. The deposits, therefore, made a grand total of $875. No doubt Mr. Stuyvesant had stolen this book, but had not as yet found an opportunity of utilizing it. “What’s dat?” asked the colored servant. “A savings bank book. My roommate must have dropped it. It appears to belong to a lady named Rachel Norris. I wish I could get it to her.” “Is she an Albany lady, sir?” “I don’t know.” “You might look in the directory.” “So I will. It is a good idea.” “I hope the gemman didn’t take all your money, sir.” “No; he didn’t even take half of it. I only wish I had been awake when the boat got to the dock.” “I would have called you, sir, if you had asked me.” “I am not much used to traveling. I shall know better next time what to do.” The finding of the bank book partially consoled Carl for the loss of his pocketbook and gripsack. He was glad to be able to defeat Stuyvesant in one of his nefarious schemes, and to be the instrument of returning Miss Norris her savings bank book. When he left the boat he walked along till he reached a modest-looking hotel, where he thought the charges would be reasonable. He entered, and, going to the desk, asked if he could have a room. “Large or small?” inquired the clerk. “Small.” “No. 67. Will you go up now?” “Yes, sir.” “Any baggage?” “No; I had it stolen on the boat.” The clerk looked a little suspicious. “We must require pay in advance, then,” he said. “Certainly,” answered Carl, pulling out a roll of bills. “I suppose you make special terms to commercial travelers?” “Are you a drummer?” “Yes. I represent Henry Jennings, of Milford, New York.” “All right, sir. Our usual rates are two dollars a day. To you they will be a dollar and a quarter.” “Very well; I will pay you for two days. Is breakfast ready?” “It is on the table, sir.” “Then I will go in at once. I will go to my room afterwards.” In spite of his loss, Carl had a hearty appetite, and did justice to the comfortable breakfast provided. He bought a morning paper, and ran his eye over the advertising columns. He had never before read an Albany paper, and wished to get an idea of the city in its business aspect. It occurred to him that there might be an advertisement of the lost bank book. But no such notice met his eyes. He went up to his room, which was small and plainly furnished, but looked comfortable. Going down again to the office, he looked into the Albany directory to see if he could find the name of Rachel Norris. There was a Rebecca Norris, who was put down as a dressmaker, but that was as near as he came to Rachel Norris. Then he set himself to looking over the other members of the Norris family. Finally he picked out Norris \u0026 Wade, furnishing goods, and decided to call at the store and inquire if they knew any lady named Rachel Norris. The prospect of gaining information in this way did not seem very promising, but no other course presented itself, and Carl determined to follow up the clew, slight as it was. Though unacquainted with Albany streets, he had little difficulty in finding the store of Norris \u0026 Wade. It was an establishment of good size, well supplied with attractive goods. A clerk came forward to wait upon Carl. “What can I show you?” he asked. “You may show me Mr. Norris, if you please,” responded Carl, with a smile. “He is in the office,” said the clerk, with an answering smile. Carl entered the office and saw Mr. Norris, a man of middle age, partially bald, with a genial, business-like manner. “Well, young man?” he said, looking at Carl inquiringly. “You must excuse me for troubling you, sir,” said Carl, who was afraid Mr. Norris would laugh at him, “but I thought you might direct me to Rachel Norris.” Mr. Norris looked surprised. “What do you want of Rachel Norris?” he asked, abruptly. “I have a little business with her,” answered Carl. “Of what nature?” “Excuse me, but I don’t care to mention it at present.” “Humph! you are very cautious for a young man, or rather boy.” “Isn’t that a good trait, sir?” “Good, but unusual. Are you a schoolboy?” “No, sir; I am a drummer.” Mr. Norris put on a pair of glasses and scrutinized Carl more closely. “I should like to see—just out of curiosity—the man that you travel for,” he said. “I will ask him to call whenever he visits Albany. There is his card.” Mr. Norris took it. “Why, bless my soul!” he exclaimed. “It is Henry Jennings, an old schoolmate of mine.” “And a good business man, even if he has sent out such a young drummer.” “I should say so. There must be something in you, or he wouldn’t have trusted you. How is Jennings?” “He is well, sir—well and prosperous.” “That is good news. Are you in his employ?” “Yes, sir. This is the first time I have traveled for him.” “How far are you going?” “As far as Chicago.” “I don’t see what you can have to do with Rachel Norris. However, I don’t mind telling you that she is my aunt, and—well, upon my soul! Here she is now.” And he ran hastily to greet a tall, thin lady, wearing a black shawl, who at that moment entered the office. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2963/81571.html","bookId":388,"book":{"id":388,"title":"Driven From Home Carl Crawford\u0027s Experience","description":"简介： A boy of sixteen, with a small gripsack in his hand, trudged along the country road. He was of good height for his age, strongly built, and had a frank, attractive face. He was naturally of a cheerful temperament, but at present his face was grave, a...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2963","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
