{"id":32410,"no":8,"title":"CHAPTER VIII. CARL FALLS UNDER SUSPICION.","content":"To a person of any age such a sight as that described at the close of the last chapter might well have proved startling. To a boy like Carl it was simply overwhelming. It so happened that he had but twice seen a dead person, and never a victim of violence. The peculiar circumstances increased the effect upon his mind. He placed his hand upon the man’s face, and found that he was still warm. He could have been dead but a short time. “What shall I do?” thought Carl, perplexed. “This is terrible!” Then it flashed upon him that as he was alone with the dead man suspicion might fall upon him as being concerned in what might be called a murder. “I had better leave here at once,” he reflected. “I shall have to go away without paying for my meal.” He started to leave the house, but had scarcely reached the door when two persons—a man and a woman—entered. Both looked at Carl with suspicion. “What are you doing here?” asked the man. “I beg your pardon,” answered Carl; “I was very hungry, and seeing no one about, took the liberty to sit down at the table and eat. I am willing to pay for my dinner if you will tell me how much it amounts to.” “Wasn’t my husband here?” asked the woman. “I—I am afraid something has happened to your husband,” faltered Carl. “What do you mean?” Carl silently pointed to the chamber door. The woman opened it, and uttered a loud shriek. “Look here, Walter!” she cried. Her companion quickly came to her side. “My husband is dead!” cried the woman; “basely murdered, and there,” pointing fiercely to Carl, “there stands the murderer!” “Madam, you cannot believe this!” said Carl, naturally agitated. “What have you to say for yourself?” demanded the man, suspiciously. “I only just saw—your husband,” continued Carl, addressing himself to the woman. “I had finished my meal, when I began to search for some one whom I could pay, and so opened this door into the room beyond, when I saw—him hanging there!” “Don’t believe him, the red-handed murderer!” broke out the woman, fiercely. “He is probably a thief; he killed my poor husband, and then sat down like a cold-blooded villain that he is, and gorged himself.” Things began to look very serious for poor Carl. “Your husband is larger and stronger than myself,” he urged, desperately. “How could I overpower him?” “It looks reasonable, Maria,” said the man. “I don’t see how the boy could have killed Mr. Brown, or lifted him upon the hook, even if he did not resist.” “He murdered him, I tell you, he murdered him!” shrieked the woman, who seemed bereft of reason. “I call upon you to arrest him.” “I am not a constable, Maria.” “Then tie him so he cannot get away, and go for a constable. I wouldn’t feel safe with him in the house, unless he were tied fast. He might hang me!” Terrible as the circumstances were, Carl felt an impulse to laugh. It seemed absurd to hear himself talked of in this way. “Tie me if you like!” he said. “I am willing to wait here till some one comes who has a little common sense. Just remember that I am only a boy, and haven’t the strength of a full-grown man!” “The boy is right, Maria! It’s a foolish idea of yours.” “I call upon you to tie the villain!” insisted the woman. “Just as you say! Can you give me some rope?” From a drawer Mrs. Brown drew a quantity of strong cord, and the man proceeded to tie Carl’s hands. “Tie his feet, too, Walter!” “Even if you didn’t tie me, I would promise to remain here. I don’t want anybody to suspect me of such a thing,” put in Carl. “How artful he is!” said Mrs. Brown. “Tie him strong, Walter.” The two were left alone, Carl feeling decidedly uncomfortable. The newly-made widow laid her head upon the table and moaned, glancing occasionally at the body of her husband, as it still hung suspended from the hook. “Oh, William, I little expected to find you dead!” she groaned. “I only went to the store to buy a pound of salt, and when I come back, I find you cold and still, the victim of a young ruffian! How could you be so wicked?” she demanded fiercely of Carl. “I have told you that I had nothing to do with your husband’s death, madam.” “Who killed him, then?” she cried. “I don’t know. He must have committed suicide.” “Don’t think you are going to escape in that way. I won’t rest till I see you hung!” “I wish I had never entered the house,” thought Carl, uncomfortably. “I would rather have gone hungry for twenty four hours longer than find myself in such a position.” Half an hour passed. Then a sound of voices was heard outside, and half a dozen men entered, including besides the messenger, the constable and a physician. “Why was he not cut down?” asked the doctor, hastily. “There might have been a chance to resuscitate him.” “I didn’t think of it,” said the messenger. “Maria was so excited, and insisted that the boy murdered him.” “What boy?” Carl was pointed out. “That boy? What nonsense!” exclaimed Dr. Park. “Why, it would be more than you or I could do to overpower and hang a man weighing one hundred and seventy-five pounds.” “That’s what I thought, but Maria seemed crazed like.” “I tell you he did it! Are you going to let him go, the red-handed murderer?” “Loose the cord, and I will question the boy,” said Dr. Park, with an air of authority. Carl breathed a sigh of relief, when, freed from his bonds, he stood upright. “I’ll tell you all I know,” he said, “but it won’t throw any light upon the death.” Dr. Park listened attentively, and asked one or two questions. “Did you hear any noise when you were sitting at the table?” he inquired. “No, sir.” “Was the door closed?” “Yes, sir.” “That of itself would probably prevent your hearing anything. Mrs. Brown, at what hour did you leave the house?” “At ten minutes of twelve.” “It is now five minutes of one. The deed must have been committed just after you left the house. Had you noticed anything out of the way in your—husband’s manner?” “No, sir, not much. He was always a silent man.” “Had anything happened to disturb him?” “He got a letter this morning. I don’t know what was in it.” “We had better search for it.” The body was taken down and laid on the bed. Dr. Park searched the pockets, and found a half sheet of note paper, on which these lines were written: “Maria:—I have made up my mind I can ive no longer. I have made a terrible discovery. When I married you, I thought my first wife, who deserted me four years ago, dead. I learn by a letter received this morning that she is still living in a town of Illinois. The only thing I can do is to free you both from my presence. When you come back from the store you will find me cold and dead. The little that I leave behind I give to you. If my first wife should come here, as she threatens, you can tell her so. Good-by. “William.” The reading of this letter made a sensation. Mrs. Brown went into hysterics, and there was a scene of confusion. “Do you think I can go?” Carl asked Dr. Park. “Yes. There is nothing to connect you with the sad event.” Carl gladly left the cottage, and it was only when he was a mile on his way that he remembered that he had not paid for his dinner, after all. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2963/81550.html","bookId":388,"book":{"id":388,"title":"Driven From Home Carl Crawford\u0027s Experience","description":"简介： A boy of sixteen, with a small gripsack in his hand, trudged along the country road. He was of good height for his age, strongly built, and had a frank, attractive face. He was naturally of a cheerful temperament, but at present his face was grave, a...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2963","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
