{"id":65216,"no":12,"title":"Page 12","content":"They finished and Yugo urged him into a ground-pod. They fol lowed a complicated path, alive with noise and smells and vigor. Here orderly traffic disintegrated. Instead of making an entire layer one way, local streets intersected at angles acute and oblique, sel dom rectangular. Yugo seemed to regard traffic intersections as rude interruptions.\\n\\n They sped by buildings at close range, stopped, and got out for a walk to a slideway. The Specials were right behind and without any transition Hari found himself in the middle of chaos. Smoke enveloped them and the acrid stench made him almost vomit.\\n\\n The Specials captain shouted to him, “Stay down!” Then the man shouted to his men to arm with anamorphine. They all bristled with weapons.\\n\\n Smoke paled the overhead phosphors. Through the muggy haze Hari saw a solid wall of people hammering toward them. They came out of side alleys and doorways and all seemed to bear down on him. The Specials fired a volley into the mass. Some went down. The captain threw a canister and gas blossomed farther away. He had judged it expertly; air circulation carried the fumes into the mob, not toward Hari.\\n\\n But anamorphine wasn’t going to stop them. Two women rushed by Hari, carrying cobblestones ripped from the street. A third jabbed at Hari with a knife and the captain shot her with a dart. Then more Dahlites rushed at the Specials and Hari caught what they were shouting: incoherent rage against tiktoks.\\n\\n The idea seemed so unlikely to him at first he thought he could not have heard rightly. That deflected his attention, and when he looked back toward the streaming crowd the captain was down and a man was advancing, holding a knife.\\n\\n What any of this had to do with tiktoks was mysterious, but Hari did not have time to do anything except step to the side and kick the man squarely in the knee.\\n\\n A bottle bounced painfully off his shoulder and smashed on the walkway. A man whirled a chain around and around and then to ward Hari’s head. Duck. It whistled by and Hari dove at the man, tackling him solidly. They went down with two others in a swearing, punching mass. Hari took a slug in the gut.\\n\\n He rolled over and gasped for air and clearly, only a few feet away, saw a man kill another with a long, curved knife.\\n\\n Jab, slash, jab. It happened silently, like a dream. Hari gasped, shaken, his world in slow motion. He should be responding boldly, he knew that. But it was so overwhelming—\\n\\n —and then he was standing, with no memory of getting there, wrestling with a man who had not bothered with bathing for quite some while.\\n\\n Then the man was gone, abruptly yanked away by the seethe of the crowd.\\n\\n Another sudden jump—and Specials were all around him. Bodies sprawled lifeless on the walkway. Others held their bloody heads. Shouts, thumps—\\n\\n He did not have time to figure out what weapon had done that to them before the Specials were whisking him and Yugo along and the whole incident fled into obscurity, like a 3D program glimpsed and impatiently passed by.\\n\\n The captain wanted to return to Streeling. “Even better, the palace.”\\n\\n “This wasn’t about us,” Hari said as they took a slideway.\\n\\n “Can’t be sure of that, sir.”\\n\\n 10.\\n\\n Hari batted away all suggestions that they discontinue their journey. The incident had apparently begun when some tiktoks malfed.\\n\\n “Somebody accused Dahlites of causing it,” Yugo related. “So our people stood up for themselves and, well, things got out of hand.”\\n\\n Everyone near them was alive with excitement, faces glowing, eyes white and darting. He thought suddenly of his father’s wry saying, Never underestimate the power of boredom.\\n\\n In human affairs, spirited action relieved dry tedium. He re membered seeing two women pummel a Spook, slamming away at the spindly, bleached-white man as though he were no more than a responsive exercise machine. A simple phobia against sun light meant that he was of the hated Other, and thus fair game.\\n\\n Murder was a primal urge. Even the most civilized felt tempted by it in moments of rage. But nearly all resisted and were better for the resistance. Civilization was a defense against nature’s raw power.\\n\\n That was a crucial variable, one never considered by the econom ists with their gross products per capita, or the political theorists with their representative quotients, or the sociosavants and their security indices.\\n\\n “I’ll have to keep that in, too,” he muttered to himself.\\n\\n “Keep what?” Yugo asked. He, too, was still agitated.\\n\\n “Things as basic as murder. We get all tied up in Trantor’s eco nomics and politics, but something as gut-deep as that incident may be more important, in the long run.”\\n\\n “We’ll pick it up in the crime statistics.”\\n\\n “No, it’s the urge I want to get. How does that explain the deeper movements in human culture? It’s bad enough dealing with Trantor—a giant pressure cooker, forty billion sealed in together. We know there’s something missing, because we can’t get the psychohistorical equations to converge.”\\n\\n Yugo frowned. “I was thinkin’ it was, well, that we needed more data.”\\n\\n Hari felt the old, familiar frustration. “No, I can feel it. There’s something crucial, and we don’t have it.”\\n\\n Yugo looked doubtful and then their off-disk came. They changed through a concentric set of circulating slideways, reducing their velocity and ending in a broad square. An impressive edifice dom inated the high air shafts, slender columns blooming into offices above. Sunlight trickled down the sculpted faces of the building, telling tales of money: Artifice Associates.\\n\\n Reception whisked them into a sanctum more luxurious than anything at Streeling. “Great room,” Yugo said with a wry slant of his head.\\n\\n Hari understood this common academic reflection. Technical workers outside the university system earned more and worked in generally better surroundings. None of that had ever bothered him. The idea of universities as a high citadel had withered as the Empire declined, and he saw no need for opulence, particularly under an Emperor with a taste for it. 2\\n\\n The staff of Artifice Associates referred to themselves as A and seemed quite bright. He let Yugo carry the conversation as they sat around a big, polished pseudowood table; he still pulsed with the zest of the earlier violence. Hari sat back and meditated on his surroundings, his mind returning as always to new facets which might bear upon psychohistory.\\n\\n The theory already had mathematical relationships between technology, capital accumulation, and labor, but the most important driver proved to be knowledge. About half the economic growth came from the increase in the quality of information, as embodied in better machines and improved skills, building efficiency.\\n\\n Fair enough—and that was where the Empire had faltered. The innovative thrust of the sciences had slowly ground down. The Imperial Universities produced fine engineers, but no inventors. Great scholars, but few true scientists. That factored into the other tides of time.\\n\\n Only independent businesses such as this, he reflected, continued the momentum which had driven the entire Empire for so long. But they were wildflowers, often crushed beneath the boot of Im perial politics and inertia.\\n\\n “Dr. Seldon?” a voice asked at his elbow, startling Hari out of his rumination. He nodded.\\n\\n “We do have your permission as well?”\\n\\n “Ah, to do what?”\\n\\n “To use these.” Yugo stood and lifted onto the table his two carry-cases. He unzipped them and two ferrite cores stood revealed.\\n\\n “The Sark sims, gentlemen.”\\n\\n Hari gaped. “I thought Dors—”\\n\\n “Smashed ’em? She thought so, too. I used two old, worthless data-cores in your office that day.”\\n\\n “You knew she would—”\\n\\n “I gotta respect that lady—quick and strong-minded, she is.” Yugo shrugged. “I figured she might get a little…provoked.”\\n\\n Hari smiled. Suddenly he knew that he had been repressing real anger at Dors for her high-handed act. Now he released it in a fit of hearty laughter. “Wonderful! Wife or not, there are limits.”\\n\\n He howled so hard tears sprang to his eyes. The guffaws spread around the table and Hari felt better than he had in weeks. For a moment all the nagging University details, the ministership, everything—fell away.\\n\\n “Then we do have your permission, Dr. Seldon? To use the sims?” a young man at his elbow asked again.\\n\\n “Of course, though I will want to keep close tabs on some, ah, research interests of mine. Will that be possible, Mr.…?”\\n\\n “Marq Hofti. We’d be honored, sir, if you could spare the project some time. I’ll do my best—”\\n\\n “And I.” A young woman stood at his other elbow. “Sybyl,” she said, and shook hands. They both appeared quite competent, neat, and efficient. Hari puzzled at the looks bordering on reverence they gave him. After all, he was just a mathist, like them.\\n\\n Then he laughed again, heartily, a curiously liberating bark. He had just thought of what it would be like to tell Dors about the data-cores.\\n\\n PART 2\\n\\n THE ROSE MEETS THE SCALPEL\\n\\n COMPUTATIONAL REPRESENTATION—…it is clear that, except for occasional outbursts, the taboos against advanced, artificial intelligences head throughout the Empire through the great sweep of historical time. This uniformity of cultural opinion probably reflects tragedies and traumas with artificial forms far back in pre-Empire ages. There are records of early transgressions by self-aware programs, including those by “sims,” or self-organizing simulations. Apparently the pre-ancients enjoyed recreating personalities of their own past, perhaps for instruction or amusement or even research. None of these are known to survive, but tales persist that they were once a high art. Of darker implication are the narratives which hypothesize self-aware intelligences lodged in bodies resembling human. While low-order mechanical forms are customarily allowed throughout the Empire, these “tiktoks” constitute no competi tion with humans, since they perform only simple and often disagreeable tasks….\\n\\n —ENCYCLOPEDIA GALACTICA\\n\\n 1.\\n\\n Joan of Arc wakened inside an amber dream. Cool breezes caressed her, odd noises reverberated. She heard before she saw—\\n\\n —and abruptly found herself sitting outdoors. She noted things one at a time, as though some part of herself were counting them.\\n\\n Soft air. Before her, a smooth round table.\\n\\n Pressing against her, an unsettling white chair. Its seat, unlike those in her home village of Domremy, was not hand-hewn of wood. Its smooth slickness lewdly aped her contours. She reddened.\\n\\n Strangers. One, two, three…winking into being before her eyes.\\n\\n They moved. Peculiar people. She could not tell woman from man, except for those whose pantaloons and tunics outlined their intimate parts. The spectacle was even more than she’d seen in Chinon, at the lewd court of the Great and True King.\\n\\n Talk. The strangers seemed oblivious of her, though she could hear them chattering in the background as distinctly as she sometimes heard her voices. She listened only long enough to conclude that what they said, having nothing to do with holiness or France, was clearly not worth hearing.\\n\\n Noise. From outside. An iron river of self-moving carriages muttered by. She felt surprise at this—then somehow the emotion evaporated.\\n\\n A long view, telescoping in—\\n\\n Pearly mists concealed distant ivory spires. Fog made them seem like melting churches.\\n\\n What was this place?\\n\\n A vision, perhaps related to her beloved voices. Could such ap paritions be holy?\\n\\n Surely the man at a nearby table was no angel. He was eating scrambled eggs—through a straw.\\n\\n And the women—unchaste, flagrant, gaudy cornucopias of hip and thigh and breast. Some drank red wine from transparent gob lets, different from any she’d seen at the royal court.\\n\\n Others seemed to sup from floating clouds—delicate, billowing mousse fogs. One mist, reeking of beef with a tangy Loire sauce, passed near her. She breathed in—and felt in an instant that she had experienced a meal.\\n\\n Was this heaven? Where appetites were satisfied without labor and toil?\\n\\n But no. Surely the final reward was not so, so…carnal. And perturbing. And embarrassing.\\n\\n The fire some sucked into their mouths from little reeds—those alarmed her. A cloud of smoke drifting her way flushed birds of panic from her breast—although she could not smell the smoke, nor did it burn her eyes or sear her throat.\\n\\n The fire, the fire! she thought, heart fluttering in panic. What had…?\\n\\n She saw a being made of breastplate coming at her with a tray of food and drink—poison from enemies, no doubt, the foes of France! she thought in churning fright—she at once reached for her sword. \\n\\n","sourceLink":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1/page-12.html","bookId":1697,"book":{"id":1697,"title":"Foundation\u0027s Fear ( Second Foundation Trilogy #1)","description":"Storyline: Foundation\u0027s Fear (Second Foundation Trilogy #1) \\n Isaac Asimov\u0027s Foundation Trilogy is one of the high-water marks of science fiction. It is the monumental story of a Galactic Empire in decline, and the secret society of scientists who seek to shorten the inevitable Dark Age with the science of psychohistory. Now, with the permission -- and blessing -- of the Asimov estate, the epic saga continues. \\n Fate -- and a cruel Emperor\u0027s arbitrary power -- have thrust Hari Seldon into the First Ministership of the Empire against his will. As the story opens, Hari is about to leave his quiet professorship and take on the all but impossible task of administering 25 million inhabited worlds from the all-steel planet of Trantor. With the help of his beautiful bio-engineered \"wife\" Dors and his alien companion Yugo, Seldon is still developing the science that will transform history, never dreaming that it will ultimately pit him against future history\u0027s most awesome threat.\\n","cover":"https://allnovel.net/images/foundation-s-fear-second-foundation-trilogy-1.jpg","author":"Gregory Benford","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:56:15 AM"}}
