{"id":65226,"no":22,"title":"Page 22","content":"“Yes, but—why are we getting smarter tiktoks now? They’re not\\n\\n that hard to make.”\\n\\n “Old prohibitions wearing out, my friend. And it has come up, many times. Just got knocked down, is all.”\\n\\n “By what?”\\n\\n Nim shrugged. “Politics, social forces—who knows? I mean, people feel edgy about machines that think. Can’t trust them.”\\n\\n “What if you couldn’t even tell they were machines?”\\n\\n “Huh? That’s crazy.”\\n\\n “Maybe a really smart machine doesn’t want any competition.”\\n\\n “Smarter than good ol’ Marq? Doesn’t exist.”\\n\\n “But they could…eventually.”\\n\\n “Never. Forget it. Let’s get to work.”\\n\\n 18.\\n\\n Sybyl sat anxiously beside Monsieur Boker in the Great Coliseum. They were near the Imperial Gardens and an air of importance seemed to hover over everything.\\n\\n She could not stop tapping her nails—her best full formal set—on her knees. Among the murmur of four hundred thousand other spectators in the vast bowl, she anxiously awaited the appearance of the Maid and Voltaire on a gigantic screen.\\n\\n Civilization, she thought, was a bit boring. Her time with the sims had opened her eyes to theforce, the heady electricity, of the dark past. They had fought wars, slaughtered each other, all—supposedly—for ideas.\\n\\n Now, swaddled in Empire, humanity was soft. Instead of bloody battles, satisfyingly final, there were “fierce” trade wars, athletic head-buttings. And lately, a fashion for debates.\\n\\n This collision of sims, touted everywhere on Trantor, would be watched by over twenty billion households. And it was beamed to the entire Empire, wherever the creaky funnels of the wormhole network went. The rude vigor of the prehistoric sims was undeni able; she felt it herself, a quickening in her pulse.\\n\\n The merest few interviews and glimpses of the sims had intrigued the 3D audience. Those who brought up the age-old laws and prohibitions got shouted down. The air crackled with the zest for the new. No one had anticipated that this debate would balloon into this.\\n\\n This could spread. Within weeks, Junin could inflame all Trantor into a renaissance.\\n\\n And she was going to take every scrap of credit for it that she could, of course.\\n\\n She looked around at the president and other top-ranking exec utives of Artifice Associates, all chattering away happily.\\n\\n The president, to demonstrate neutrality, sat between Sybyl and Marq—who had not spoken to each other since the last meeting.\\n\\n On Marq’s far side his client, the Skeptics’ representative, scanned the program; next to him, Nim. Monsieur Boker gave Sybyl a nudge. “That can’t be what I think it is,” he said.\\n\\n Sybyl followed his eyes to a distant row at the back where what looked like a mechman sat quietly beside a human girl. Only licensed mech vendors and bookies were al lowed in the stadium.\\n\\n “Probably her servant,” Sybyl said.\\n\\n Minor infractions of the rules did not disturb her as they did Monsieur Boker, who’d been especially testy since a 3D caster leaked the news that Artifice Associates was representing both the Preservers and Skeptics. Fortunately, the leak occurred too late for either party to do anything about it.\\n\\n “Mechserves aren’t allowed,” Monsieur Boker observed.\\n\\n “Maybe she’s handicapped,” Sybyl said to placate him. “Needs help in getting around.”\\n\\n “It won’t understand what’s going on anyway,” said Marq, dir ecting his remark to Monsieur Boker. “They’re truncated. Just a bunch of decision-making modules, really.”\\n\\n “Precisely why it has no business here,” replied Monsieur Boker.\\n\\n Marq beeped the arm of his chair and ostentatiously placed a bet on Voltaire to win.\\n\\n “He’s never won a bet in his whole life,” Sybyl told Monsieur Boker. “No head for the math.”\\n\\n “Is that so?” Marq shot back, leaning forward to address Sybyl directly for the first time. “Why don’t you put your money where your lovely mouth is?”\\n\\n “I’ve got the probabilities on this one bracketed,” she said primly.\\n\\n “You couldn’t solve the integral equation.” Marq snorted deris ively.\\n\\n Her nostrils flared. “A thousand.”\\n\\n “Mere tokenism,” Marq chided her, “considering what you’re being paid for this project.”\\n\\n “The same as you,” said Sybyl.\\n\\n “Will you two cut it out,” Nim said.\\n\\n “Tell you what,” said Marq. “I’ll bet my entire salary for the project on Voltaire. You bet yours on your anachronistic Maid.”\\n\\n “Hey,” Nim said. “Hey.”\\n\\n The president deftly addressed Marq’s client, the Skeptic. “It’s this keen competitive spirit that’s made Artifice Associates the planet’s leader in simulated intelligences.” Artfully he turned to the rival, Boker. “We try to—”\\n\\n “You’re on!” cried Sybyl.\\n\\n Her dealings with the Maid had convinced her that the irrational must have a place in the human equation, too. She remained con vinced for about three quick eye-blinks, and then began to doubt.\\n\\n 19.\\n\\n Voltaire loved audiences. And he had never appeared before one like this ocean of faces lapping at his feet.\\n\\n Although tall in his former life, he felt that only now, gazing down at the multitudes from his hundred-meter height, had he achieved the stature he deserved. He patted his powdered wig and fussed with the shiny satin ribbon at his throat. With a gracious flourish of his hands, he made a deep bow to them, as if he’d already given the performance of his life. The crowd murmured like an awakening beast.\\n\\n He glanced at the Maid, concealed from the audience behind a shimmering partition in the far corner of the screen. She folded her arms, pretending to be unimpressed.\\n\\n Delay only excited the beast. He let the crowd cheer and stamp, ignoring boos and hisses from approximately half of those present.\\n\\n At least half of humanity has always been fools, he reflected. This was his first exposure to the advanced denizens of this colossal Empire. Millennia had made no difference.\\n\\n He was not one to prematurely cut off adulation he knew was his due. Here he stood for the epitome of the French intellectual tradition, now vanquished but for him.\\n\\n He gazed again at Joan—who was, after all, the only other sur viving member of their time, quite obviously the peak in human civilization. He whispered, “’Tis our destiny to shine; theirs, to applaud.”\\n\\n When the moderator finally pleaded for silence—a bit too soon; Voltaire would take that up with him later—Voltaire endured Joan’s introduction with what he hoped was a stoic smile. He elaborately insisted that Joan make her points first, only to have the moderator rather rudely tell him that here, they flipped a coin.\\n\\n Voltaire won. He shrugged, then placed his hand over his heart. He began his recital in the declamatory style so dear to eighteenth-century Parisian hearts: no matter how defined the soul, like a deity, could not be shown to exist; its existence was inferred.\\n\\n Truth of the inference lay beyond rational proof. Nor was there anything in Nature that required it.\\n\\n And yet, Voltaire continued to pontificate, there was nothing more obvious in Nature than the work of an intelligence greater than man’s—which man is able, within limits, to decipher. That man can decode Nature’s secrets proved what the Church fathers and all the founders of the world’s great religions had always said: that man’s intelligence is a reflection of that same Divine Intelligence which authored Nature.\\n\\n Were this not so, natural philosophers could not discern the laws behind Creation, either because there would be none, or because man would be so alien to them that he could not discern them. The very harmony between natural law, and our ability to discover it, strongly suggested that sages and priests of all persuasions are essentially correct!—in arguing that we are but the creatures of an Almighty Power, whose Power is reflected in us. And this reflection in us of that Power may be justly termed our universal, immortal, yet individual souls.\\n\\n “You’re praising priests!” the Maid exclaimed. She was swamped by the pandemonium that broke out in the crowd.\\n\\n “The operation of chance,” Voltaire concluded, “in no way proves that Nature and Man—who is part of Nature and as such a reflection of its Creator—are somehow accidental. Chance is one of the principles through which natural law works. That principle may correspond with the traditional religious view that man is free to chart his own course. But this freedom, even when apparently random, obeys statistical laws in a way that man can comprehend.”\\n\\n The crowd muttered, confused. They needed an aphorism, he saw, to firm them up. Very well. “Uncertainty is certain, my friends. Certainty is uncertain.”\\n\\n Still they did not quiet, to better hear his words. Very well, again.\\n\\n He clenched both fists and belted out in a voice of surprising bass power, “Man is, like Nature itself, free and determined both at once—as religious sages have been telling us for centuries though, to be sure, they use a different vocabulary, far less precise than ours. Much mischief and misunderstanding between religion and science stem from that.\\n\\n “I’ve been greatly misunderstood,” Voltaire resumed. “I’d like to take this opportunity to apologize for distortions resulting because all I said and wrote focused only on errors of faith, not on its intuited truths. But I lived during an era in which errors of faith were rife, while reason’s voice had to fight to be heard. Now, the opposite appears to be true. Reason mocks faith. Reason shouts while faith whispers. As the execution of France’s greatest and most faithful heroine proved—” a grand, sweeping gesture to Joan “—faith without reason is blind. But, as the superficiality and vanity of much of my life and work prove, reason without faith is lame.”\\n\\n Some who had booed and hissed now blinked, mouths agape—and then cheered…while, he noticed, those who had ap plauded, now booed and hissed. Voltaire stole a look at the Maid.\\n\\n 20.\\n\\n Far below in the rowdy crowd, Nim turned to Marq. “What?”\\n\\n Marq was ashen. “Damned if I know.”\\n\\n “Yeah,” Nim said, “maybe literally.”\\n\\n “Divinity won’t be mocked!” Monsieur Boker cried out. “Faith shall prevail!”\\n\\n Voltaire was relinquishing the podium to his rival, to the amazed delight of the Preservers. Their shouts were equaled by the horrified disbelief of Skeptics.\\n\\n Marq recalled the words he had spoken at the meeting. He muttered, “Voltaire, divested of his anger at authority, is and is not Voltaire.” He turned to Monsieur Boker. “My Lord!—you may be right.”\\n\\n “No, my Lord!” snapped Monsieur Boker. “He is never wrong.” The Maid surveyed the masses of this Limbo from her high angle. Strange small vessels for souls they were, swaying below like wheat in a summer storm.\\n\\n “Monsieur is absolutely right!” she thundered across the stadium.\\n\\n “Nothing in nature is more obvious than that both nature and man do indeed possess a soul!”\\n\\n Skeptics hooted. Preservers cheered. Others—who equated the belief that nature has a soul with paganism, she saw in a flash—scowled, suspecting a trap.\\n\\n “Anyone who has seen the countryside near my home village, Domremy, or the great marbled church at Rouen will testify that nature, the creation of an awesome power, and man, the creator of marvels—such as this place, of magical works—both possess in tense consciousness, a soul!”\\n\\n She waved a gentle hand at him while the mass—did the size of them betray how tiny were their souls?—calmed themselves.\\n\\n “But what my brilliant friend has not addressed is how the fact of the soul relates to the question at hand: whether clockwork intel ligences, such as his own, possess a soul.”\\n\\n The crowd stamped, booed, cheered, hissed, and roared. Objects the Maid could not identify sailed through the air. Police officers appeared to pull some men and women, who appeared to be having fits, or else sudden divine visitations, from the crowd.\\n\\n “The soul of man is divine!” she cried out.\\n\\n Screams of approval, shouts of denial.\\n\\n “It is immortal!”\\n\\n The din was so great people covered their ears with their hands to muffle the noise, of which they themselves were the source.\\n\\n “And unique,” Voltaire whispered. “I certainly am. And you.”\\n\\n “It is unique!” she shouted, eyes ablaze.\\n\\n Voltaire shot to his feet beside her. “I agree!”\\n\\n The congregation frothed over, like a pot left to boil, she ob served. \\n\\n","sourceLink":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1/page-22.html","bookId":1697,"book":{"id":1697,"title":"Foundation\u0027s Fear ( Second Foundation Trilogy #1)","description":"Storyline: Foundation\u0027s Fear (Second Foundation Trilogy #1) \\n Isaac Asimov\u0027s Foundation Trilogy is one of the high-water marks of science fiction. It is the monumental story of a Galactic Empire in decline, and the secret society of scientists who seek to shorten the inevitable Dark Age with the science of psychohistory. Now, with the permission -- and blessing -- of the Asimov estate, the epic saga continues. \\n Fate -- and a cruel Emperor\u0027s arbitrary power -- have thrust Hari Seldon into the First Ministership of the Empire against his will. As the story opens, Hari is about to leave his quiet professorship and take on the all but impossible task of administering 25 million inhabited worlds from the all-steel planet of Trantor. With the help of his beautiful bio-engineered \"wife\" Dors and his alien companion Yugo, Seldon is still developing the science that will transform history, never dreaming that it will ultimately pit him against future history\u0027s most awesome threat.\\n","cover":"https://allnovel.net/images/foundation-s-fear-second-foundation-trilogy-1.jpg","author":"Gregory Benford","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:56:15 AM"}}
