{"id":65230,"no":26,"title":"Page 26","content":"“Him, most especially.”\\n\\n PART 3\\n\\n BODY POLITICS\\n\\n FOUNDATION, EARLY HISTORY—…first public intimations of psychohistory as a possible scientific discipline surfaced during the poorly documented early period of Seldon’s polit ical life. While the Emperor Cleon set great store in its possib ilities, psychohistory was viewed by the political class as a mere abstraction, if not a joke. This may have resulted from maneuverings by Seldon himself, who never referred to the subject by the name he had given it. Even at this early stage, he seems to have realized that widespread knowledge of psy chohistory and any movement founded upon it would enjoy little predictive success, since many would then be able to act to offset its predictions, or take advantage of them. Some have “condamned” Seldon as “selfish” for “hoarding” the psychohis torical method, but one must remember the extreme rapacity of political life in these waning years….\\n\\n —ENCYCLOPEDIA GALACTICA\\n\\n 1.\\n\\n Hari Seldon’s desksec chimed and announced, “Margetta Moonrose desires a conversation.”\\n\\n Hari looked up at the 3D image of a striking woman hovering before him. “Um? Oh. Who’s she?” His sec would not interrupt him amid his calculations unless this were somebody important.\\n\\n “Cross-check reveals that she is the leading interviewer and political maven in the multimedia complex—”\\n\\n “Sure, sure, but why is she consequential?”\\n\\n “She is considered by all cross-cultural monitors to be among the fifty most influential figures on Trantor. I suggest—”\\n\\n “Never heard of her.” Hari sat up, brushed at his hair. “I suppose I should. Full filter, though.”\\n\\n “I fear my filters are down for recalibration. If—”\\n\\n “Damn it, they’ve been out for a week.”\\n\\n “I fear the mechanical in charge of the new calibrations has been defective.”\\n\\n Mechs, which were advanced tiktoks, were failing often these days. Since the Junin riots, some had even been attacked. Hari swallowed and said, “Put her through anyway.”\\n\\n He had used filters on holophones for so long, he could not now disguise his feelings. Cleon’s staff had installed software to render the fitting, preselected body language for him. With some sprucing up by the Imperial Advisors, it now modulated his acoustic signa ture for a full, confident, resonant tone. And if he wanted, it edited his vocabulary; he was always lapsing into technospeak when he should be explaining simply.\\n\\n “Academician!” Moonrose said brightly. “I would so much like to have a little talk with you.”\\n\\n “About mathematics?” he said blandly.\\n\\n She laughed merrily. “No no!—that would be far over my head. I represent billions of inquiring minds who would like to know your thoughts on the Empire, the Quathanan questions, the—”\\n\\n “The what?”\\n\\n “Quathanan—the dispute over Zonal alignment.”\\n\\n “Never heard of it.”\\n\\n “But—you’re to be First Minister.” She seemed genuinely sur prised, though Hari reminded himself that this was probably a su perbly adept filter-face.\\n\\n “So I am—perhaps. Until then, I will not bother.”\\n\\n “When the High Council selects, they must know the views of the candidates,” she said rather primly.\\n\\n “Tell your viewers that I do my homework only just before it’s due.”\\n\\n She looked charmed, which made him certain that she was filtered. He had learned from many collisions with them that media mavens were easily irked when brushed aside. They seemed to feel it quite natural that, since an immense audience saw through their eyes, they carried all the moral heft of that audience.\\n\\n “What about a subject you certainly must know—the Junin disaster? And the loss—some say escape—of the Voltaire and Joan of Arc sims?”\\n\\n “Not my department,” Hari said. Cleon had advised him to keep his distance from the entire sim issue.\\n\\n “Rumors suggest that they came from your department.”\\n\\n “Certainly, one of our research mathists found them. We leased rights to those people—what was their name…?”\\n\\n “Artifice Associates, as I am sure you know.”\\n\\n “Um, yes.”\\n\\n “This distracted professor role is not convincing, sir.”\\n\\n “You’d rather I spent my time running for office—and then, presumably, running for cover?”\\n\\n “The world, the whole Empire, has a right to know—”\\n\\n “So I should stand only for what the people will fall for?”\\n\\n Her mouth twisted, coming through her filters, so apparently she had decided to play this interview as a contest of wills. “You’re hiding the peoples’ business from—”\\n\\n “My research is my own business.”\\n\\n She waved this aside. “What do you say, as a mathematician, to those who feel that deep sims of real people are immoral?”\\n\\n Hari wished fervently for his own face filters. He was sure he was giving away something, so he forced his face to stay blank. Best to deflect the argument. “How real were those sims? Can anybody know?”\\n\\n “They certainly seemed real and human to the audience,” Moonrose said, raising her eyebrows.\\n\\n “I’m afraid I didn’t watch the performance,” Hari said. “I was busy.” Strictly true, at least.\\n\\n Moonrose leaned forward, scowling. “With your mathematics? Well, then, tell us about psychohistory.”\\n\\n He was still keeping his face wooden—which gave the wrong signal. He made himself smile. “A rumor.”\\n\\n “I have it on good authority that you are favored by the Emperor because of this theory of history.”\\n\\n “What authority?”\\n\\n “Now sir, I should ask the questions here—”\\n\\n “Who says? I’m still a public servant, a professor. And you, madam, are taking up time I could be devoting to my students.”\\n\\n With a wave Hari cut off the link. He had learned, since bandying words with Lamurk in clear view of an unsuspected 3D snout, to chop off talk when it was going the wrong way.\\n\\n Dors came through the door as he leaned back into his airchair. “I got a hail, said somebody important was grilling you.”\\n\\n “She’s gone. Poked at me about psychohistory.”\\n\\n “Well, it was bound to get out. It’s an exciting synthesis of terms. Appeals to the imagination.”\\n\\n “Maybe if I’d called it ‘sociohistory’ people would think it more boring and leave me alone.”\\n\\n “You could never live with so ugly a word.”\\n\\n The electroshield sparkled and snapped as Yugo Amaryl came through. “Am I interrupting anything?”\\n\\n “Not at all.” Hari leapt up and helped him to a chair. He was still limping. “How’s the leg?”\\n\\n He shrugged. “Decent.”\\n\\n Three thuggos had come to Yugo on the street a week ago and explained the situation very calmly. They had been commissioned to do him damage, a warning he would not forget. Some bones had to be broken; that was the specification, nothing he could do about it. The leader explained how they could do this the hard way. If he fought, he would get messed up. The easy way, they would break his shin bone in one clean snap.\\n\\n Describing it afterward, Yugo had said, “I thought about it some, y’know, and sat down on the sidewalk and stuck my left leg out straight. Braced it against the curb, below the knee. The leader kicked me there. A good job; it broke clean and straight.”\\n\\n Hari had been horrified. The media latched onto the story, of course. His only wry statement to them was, “Violence is the dip lomacy of the incompetent.”\\n\\n “Medtech tells me it’ll heal up in another week,” Yugo said as Hari helped him stretch out, the airchair shaping itself subtly.\\n\\n “The Imperials still haven’t a clue who did it,” Dors said, pacing restlessly around the office.\\n\\n “Plenty of people will do a job like this.” Yugo grinned, an effect somewhat offset by the big bruise on his jaw. The incident had not been quite as gentlemanly as he described it. “They kinda liked doing it to a Dahlite, too.”\\n\\n Dors paced angrily. “If I’d been there…”\\n\\n “You can’t be everywhere,” Hari said kindly. “The Imperials think\\n\\n it wasn’t really about you, anyway, Yugo.”\\n\\n Yugo’s mouth twisted ruefully at Hari. “I figured. You, right?”\\n\\n Hari nodded. “A ‘signal,’ one of them said.”\\n\\n Dors turned sharply from her pacing. “Of what?”\\n\\n “A warning,” Yugo said. “Politics.”\\n\\n “I see,” she said quickly. “Lamurk cannot strike at you directly, but he leaves—”\\n\\n “An unsubtle calling card,” Yugo finished for her.\\n\\n Dors smacked her hands together. “We should tell the Emperor!”\\n\\n Hari had to chuckle. “And you, a historian. Violence has always played a role in issues of succession. It can never be far from Cleon’s mind.”\\n\\n “For emperors, yes,” she countered. “But in a contest for First Minister—”\\n\\n “Power is gettin’ scarce ’round here,” Yugo drawled sarcastically. “Pesky Dahlites makin’ trouble, Empire itself slowin’ down, too. Or spinnin’ off into loony ‘renaissances.’ Probably a Dahlite plot, that, righto?”\\n\\n Hari said, “When food gets scarce, table manners change.”\\n\\n Yugo said, “I’ll just bet the Emperor’s got this all analyzed.”\\n\\n Dors began pacing again. “One of history’s lessons is that emper ors who overanalyze fail, while those who oversimplify succeed.”\\n\\n “A neat analysis,” Hari said, but she did not catch his irony.\\n\\n “Uh, I actually came in to get some work done,” Yugo said softly. “I’ve finished reconciling the Trantorian historical data with the modified Seldon Equations.”\\n\\n Hari leaned forward, though Dors kept pacing, her hands clasped behind her back. “Wonderful! How far off are they?”\\n\\n Yugo grinned as he slipped a ferrite cube into Hari’s desk display slot. “Watch.”\\n\\n Trantor had endured at least eighteen millennia, though the pre-Empire period was poorly documented. Yugo had collapsed the ocean of data into a 3D. Economics lay along one axis, social in dices along another, with politics making up the third dimension. Each contributed a surface, forming a solid shape that hung above Hari’s desk. The slippery-looking blob was man-sized and in con stant motion—deforming, caves opening, lumps rising. Color-coded internal flows were visible through the transparent skin.\\n\\n “It looks like a cancerous organ,” Dors said. When Yugo frowned, she added hastily, “Pretty, though.”\\n\\n Hari chuckled; Dors seldom made social gaffes, but when she did, she had no idea of how to recover. The lumpy object hanging in air throbbed with life, capturing his attention. The writhing manifold summed up trillions of vectors, the raw data drawn from countless tiny lives.\\n\\n “This early history had patchy data,” Yugo said. The surfaces jerked and lurched. “Low resolution, too, and even low population size—a problem we won’t have in Empire predictions.”\\n\\n “See the two-dee socio-structures?” Hari pointed.\\n\\n “And this represents everything in Trantor?” Dors asked.\\n\\n Yugo said, “To the model not all detail is equally important. You don’t need to know the owner of a starship to calculate how it will fly.”\\n\\n Hari said helpfully, pointing at a quick jitter in social vectors, “Scientocracy arose here third millennium. Then an era in which stasis arose from monopolies. That fed rigidity.”\\n\\n The forms steadied as the data improved. Yugo let it run, time-stepping quickly so that they saw fifteen millennia in three minutes. It was startling, the pulsing solid growing myriad offshoots, struc ture endlessly proliferating. The madly burgeoning patterns spoke of the Empire’s complexity far more than any emperor’s lofty speech.\\n\\n “Now here’s the overlay,” Yugo said, “showing how the Seldon Equations post-dict, in yellow.”\\n\\n “They aren’t my equations,” Hari said automatically. Long ago he and Yugo had seen that to predict with psychohistory first de manded that they post-dict the past, for verification. “They were—”\\n\\n “Just watch.”\\n\\n Alongside the deep blue data-figure, a yellow lump congealed. It looked to Hari like an identical twin to the original. Each went through contortions, seething with history’s energy. Each ripple and snag represented many billions of human triumphs and tragedies. Every small shudder had once been a calamity.\\n\\n “They’re…the same,” Hari whispered. \\n\\n","sourceLink":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1/page-26.html","bookId":1697,"book":{"id":1697,"title":"Foundation\u0027s Fear ( Second Foundation Trilogy #1)","description":"Storyline: Foundation\u0027s Fear (Second Foundation Trilogy #1) \\n Isaac Asimov\u0027s Foundation Trilogy is one of the high-water marks of science fiction. It is the monumental story of a Galactic Empire in decline, and the secret society of scientists who seek to shorten the inevitable Dark Age with the science of psychohistory. Now, with the permission -- and blessing -- of the Asimov estate, the epic saga continues. \\n Fate -- and a cruel Emperor\u0027s arbitrary power -- have thrust Hari Seldon into the First Ministership of the Empire against his will. As the story opens, Hari is about to leave his quiet professorship and take on the all but impossible task of administering 25 million inhabited worlds from the all-steel planet of Trantor. With the help of his beautiful bio-engineered \"wife\" Dors and his alien companion Yugo, Seldon is still developing the science that will transform history, never dreaming that it will ultimately pit him against future history\u0027s most awesome threat.\\n","cover":"https://allnovel.net/images/foundation-s-fear-second-foundation-trilogy-1.jpg","author":"Gregory Benford","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:56:15 AM"}}
