{"id":65265,"no":61,"title":"Page 61","content":"The small black hole they had seen only an hour before had trapped a few stellar masses. At True Center, a million suns had died to feed gravity’s gullet.\n The orderly arrays of radiance were thin, only a light-year across. Yet they sustained themselves along hundreds of light-years as they churned with change. Hari switched the polarized walls to see in different frequency ranges. Though hot and roiling in the visible, human spectrum, the radio revealed hidden intricacy. Threads laced among convoluted spindles. He had a powerful impression of layers, of labyrinthine order descending beyond his view, beyond simple understanding.\n “Particle flux is high,” Dors said tensely. “And rising.”\n “Where’s our junction?”\n “I’m having trouble vector-fixing—ah! There.”\n Hard acceleration rammed him back into his flow-couch. Dors took them diving down into a mottled pyramid-shaped wormhole.\n This was an even rarer geometry. Hari had time to marvel at how accidents of the universal birth pang had shaped these serene geometries, like exhibits in some god’s Euclidean museum of the mind.\n And then they plunged through, erasing the stunning views.\n They popped out above the gray-brown mottled face of Trantor. A glinting disk of satellites, factories and habitats fanned out in the equatorial plane.\n The wild worm they had used fizzed and glowed behind them. Dors took them swiftly toward the ramshackle, temporary worm-yard. He said nothing, but felt her tense calculations. They nudged into a socket, seals sighed, his ears popped painfully.\n Then they were out, arms and legs wooden from the cramped pencil ship. Hari coasted in zero-g toward the flex-lock. Dors glided ahead of him. She motioned him for silence as pressures pulsed in the lock. She peeled her skinsuit down, exposing her breasts.\n A finger’s touch opened a seam below her left breast. She plucked a cylinder out. A weapon? She resealed and had her skinsuit back in place before the staging diaphragm began to open.\n Beyond the opening iris Hari saw Imperial uniforms.\n He crouched against the lock wall, ready to launch himself backward to avoid capture—but the situation looked hopeless.\n The Imperials looked grim, determined. They clasped pistols. Dors coasted between Hari and the squad. She tossed the cylinder at them—a pressure wave knocked him back against the wall. His ears clogged. The squad was an expanding cloud of…debris.\n “What—?”\n “Shaped implosion,” Dors called. “Move!”\n The injured men had been slammed into each other. How any thing could shape a pressure wave so compactly he could not imagine. In any case he had no time. They shot past the tangled cloud of men. Weapons drifted uselessly.\n A figure erupted from the far diaphragm. A man in a brown work sheath, middle-sized, unarmed. Hari shouted a warning. Dors showed no reaction.\n The man flicked his wrist and a snout appeared from his sleeve. Dors still coasted toward him.\n Hari snagged a handhold and veered to his right.\n “Stay still!” the man yelled.\n Hari froze, dangling by one hand. The man fired—and a silvery bolt fried past Hari.\n He turned and saw that one of the Imperials had recovered his weapon. The silver line scratched fire across the Imperial’s arm. He screamed. His weapon tumbled away.\n “Let’s go. I have the rest of the way secured,” the man in the work sheath called.\n Dors followed him without a word. Hari pushed off and caught up to them as the diaphragm irised for them.\n “You return to Trantor at the crucial moment,” the man said.\n “You—who—”\n The man smiled. “I have changed myself. You do not recognize your old friend, R. Daneel?”\n R. Daneel gazed at Dors without expression, letting his body go slack.\n Dors said, “We must defend him against Lamurk. You could re appear, come out in favor of him. As former First Minister, your public endorsement and support—”\n “I cannot reappear as Eto Demerzel, ex-important person. That would compromise my other tasks.”\n “But Hari has to have—”\n “As well, you mistake my power as Demerzel. I am now history. Lamurk will care nothing about me, for I have no legions to com mand.”\n Dors fumed silently. “But you must—”\n “I shall move more of us into Lamurk’s inner circle.”\n “It’s too late to infiltrate.”\n Daneel activated his expressive programs and smiled. “I planted several of our kind decades ago. They shall all be in position soon.”\n “You’re using…us?”\n “I must. Though your implication is correct: we are few.”\n “I need help protecting him, too.”\n “Quite right.” He produced a thick disk, this time from a compart ment beneath his armpit. “This will identify the Lamurk agents for you.”\n She looked doubtful. “How? This looks like a chem snooper.”\n “I have agents of my own. They can in turn label Lamurk’s agents. This device will pick up their tags. Other encoded messages will ride on the marking signal.”\n “And Lamurk’s specialists won’t pick up the tags?”\n “This device uses methods lost for six millennia. Install it in your right arm, at station cut six. Interface with apertures two and five.”\n “How will I—”\n “Specs and expertise will flow to your long-term memory upon connection.”\n She installed the device as he watched. His grave presence made silence natural. Olivaw never wasted a movement or made idle conversation. Finally, intricacies done, she sighed and said, “He’s interested in those simulations, the ones which escaped.”\n “He is following the best line of attack for psychohistory.”\n “There’s this tiktok problem, too. Do you understand—”\n “The social taboos against simulations inevitably break down during cultural resurgences,” Daneel said.\n “So tiktoks—?”\n “They are inherently destabilizing if they become too developed. After all, we cannot condone a new generation of robots, or the rediscovery of the positronic process.”\n “There are signs in the historical record that this has happened before.”\n “You are an insightful scholar.”\n “There were only a few traces, but I suspect—”\n “Suspect no further. You are correct. I could not expunge every scrap of data.”\n “You disguised such events?”\n “And much else.”\n “Why? As an historian—”\n “I had to. Humanity is best served by Imperial stability. Tiktoks, sims—these accompany movements such as this ‘New Renaissance,’ feeding the fire.”\n “What’s to be done?”\n “I do not know. Matters are slipping beyond my ability to pre dict.”\n She frowned. “How do you predict?”\n “In the first millennia of the Empire, our kind developed the simple theory I have mentioned before. Useful, but crude. It led me to expect the reemergence of these simulations as a side effect of the Sarkian ‘Renaissance’ and its turmoil.”\n “Does Hari understand this?”\n “Hari’s psychohistory is vastly superior to our models. He lacks certain vital historical data, however. When it is eventually included, he will be able to accurately anticipate the Empire’s devolution.”\n “You do not mean ‘evolution’?”\n “Quite. That is a major reason why we devote such resources to helping Hari.”\n “He is crucial.”\n “Of course. Why do you think I assigned you to him?”\n “Does it matter that I’ve fallen in love with him?”\n “No. But it helps.”\n “Helps me? Or him?”\n Daneel smiled thinly. “Both, I should hope. But mostly, it helps me.”\n PART 8\n THE ETERNAL EQUATIONS\n THE GENERAL THEORY OF PSYCHOHISTORY\n PART 8a: Mathematical Aspects—…as the crisis deepens, the deep systemic learning loops falter. The system drifts out of tune. Such drifts, particularly if diffusive, call for funda mental systemic restructuring. This is termed the “macro de cision phase” in which the loops must find fresh configurings in the N-dimensional landscape.\n …All visualizations can be understood in thermodynamic terms. The statistical mechanics involved are not those of particles and collisions, as in a gas, but in the language of social macro-groups, acting through “collisions” with other such macro-groups. Such impacts produce much human debris…\n —ENCYCLOPEDIA GALACTICA\n 1.\n Hari Seldon stood alone in the lift, thinking.\n The door slid open. A woman asked if this elevator was going up or down. Distracted, he answered, “Yes.” Her surprised look told him that somehow his reply was off target. Only after the door closed on her puzzled stare did he see that she meant which way, not if.\n He was in the habit of making precise distinctions; the world was not.\n He walked into his office, still barely aware of his surroundings, and Cleon’s 3D blossomed in the air before he could sit down. The Emperor awaited no filter programs.\n “I was so happy to hear you had returned from holiday!” Cleon beamed.\n “Pleased, sire.” What did he want?\n Hari decided not to tell him all that had transpired. Daneel had stressed secrecy. Only this morning, after a zigzag route down from the wormyards, had Hari let his presence be known even to the Imperial Specials.\n “I fear you arrive at a difficult time.” Cleon scowled. “Lamurk is moving for a vote in the High Council on the First Ministership.”\n “How many votes can he muster?”\n “Enough that I cannot ignore the Council. I will be forced to appoint him despite my own likes.”\n “I am sorry for that, sire.” In fact, his heart leaped.\n “I have maneuvered against him, but…” An elaborate sigh. Cleon chewed at his ample lower lip. Had the man gained weight again? Or were Hari’s perceptions altered by his time of shortened diet on Panucopia? Most Trantorians looked pudgy to him now. “Then, too, is this irritating matter of Sark and its confounded New Renaissance. The muddle grows. Could this spread to other worlds in their Zone? Would those throw in with them? You have studied this?”\n “In detail.”\n “Using psychohistory?”\n Hari gave way to his gut instinct. “Unrest will grow there.”\n “You’re sure?”\n He wasn’t, but—“I suggest you move against it.”\n “Lamurk favors Sark. He says it will bring new prosperity.”\n “He wants to ride this discord into office.” \n","sourceLink":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1/page-61.html","bookId":1697,"book":{"id":1697,"title":"Foundation\u0027s Fear ( Second Foundation Trilogy #1)","description":"Storyline: \n Foundation\u0027s Fear (Second Foundation Trilogy #1) \n Isaac Asimov\u0027s Foundation Trilogy is one of the high-water marks of science fiction. It is the monumental story of a Galactic Empire in decline, and the secret society of scientists who seek to shorten the inevitable Dark Age with the science of psychohistory. Now, with the permission -- and blessing -- of the Asimov estate, the epic saga continues. \n Fate -- and a cruel Emperor\u0027s arbitrary power -- have thrust Hari Seldon into the First Ministership of the Empire against his will. As the story opens, Hari is about to leave his quiet professorship and take on the all but impossible task of administering 25 million inhabited worlds from the all-steel planet of Trantor. With the help of his beautiful bio-engineered \"wife\" Dors and his alien companion Yugo, Seldon is still developing the science that will transform history, never dreaming that it will ultimately pit him against future history\u0027s most awesome threat.\n \n","cover":"https://allnovel.net/images/foundation-s-fear-second-foundation-trilogy-1.jpg","author":"Gregory Benford","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:56:15 AM"}}
