{"id":30427,"no":1,"title":"CHAPTER I “WHY DON’T YOU LAUGH?”","content":"POLLY leaned back against the great oak, her eyes bent on David’s face. She wondered—and wondered hard. If she could only fathom that inscrutable expression! The young man, stretched on the grass among the waving shadows, was gazing across the valley to the hills in their soft afternoon veiling. It was a June picture beautiful enough to hold the attention of any one, yet it was plain that David’s thoughts were not on the landscape. They had come out for a walk, which had led them miles to the south and finally to the top of Chimney Hill, where they had stopped to rest. At the start David had been talkative enough, in fact unusually merry; then, from no discernible cause, his lips had shut gravely and Polly had not been able to draw out more than monosyllables and short, matter-of-fact sentences. As she watched the unreadable face she tried to guess what the trouble might be. As in the old days before college, her lover had his occasional jealous[2] moods, and although they were less frequent they grew more and more bitter. Still, during the happy intervals Polly would coax herself to believe that they were past forever. Now she thought over the route, bit by bit, trying to find something which could have disturbed him. At last, baffled in her endeavors, she ventured suddenly:— “David, why don’t you laugh?” He turned instantly. “At what?” “Anything—nothing,” she answered lightly. “You seemed to be weighing some heavy matter.” “No, I was only—” He halted, then went on without completing his sentence. “I am going away to-morrow,” he announced. Polly’s smile vanished in surprise. “Where?” she asked with her usual eagerness. “Spitzbergen or the South Pole?” David did not appear to notice her pleasantry. “To the Adirondacks,” he said simply. “Oh!” Polly exclaimed. “Were you just making up your mind?” David reddened. “N-no,” he denied; “but Converse invited me only a day or two ago, and I didn’t decide at once.” “Going with Child Converse?” queried Polly’s lips, while her thoughts ran along, “Why didn’t he tell me sooner? We were together all yesterday morning and this afternoon—never a word until now!” “Yes,” David was saying, “he is going to take[3] me up to their camp. His father and mother are in Seattle, you know.” “M-h’m,” she bowed. “How long you going to stay?” “I don’t know. He hasn’t set any time.” “It’ll be great, won’t it?” Polly smiled in her friendliest way. He nodded gravely, slipping abruptly into complaint. “You do not like Converse. You have never taken the trouble to know him.” The girl’s eyes twinkled. “I certainly ought to adore him,” she said; “it is the first time you ever wanted me to look at any boy except Your Royal Highness.” “Oh, you don’t understand!” sighed David. “I am always wondering,” Polly went on, a tiny scowl wrinkling her smooth forehead, “how it is that Converse happens to attract you.” “He is a good fellow,” said David positively. “But he has no stock of prittle-prattle.” “It isn’t his lack of nonsense,” Polly smiled. “He is too pretty. That combined with his name—but he can’t help either, poor boy! Anyway, he looks like a nice baby—” “Baby!” sniffed David. “Well, he does. With his round face and rosy cheeks and curly hair—honestly, I always want to take him on my knee and trot him.” David laughed, though as if against his will. [4] “There’s nothing of the baby about him,” he asserted, “and a fellow can’t help his looks.” Polly shook her head. “No,” she agreed. “If only he and his sister could exchange faces! Maybe, after all, it is she that flavors my opinion of him.” “Marietta?” “Yes.” She was making little jabs in the soft moss with her slender forefinger, and a faint smile began to curve her lips. “She is a brainy girl,” was the somewhat stiff response, “and she has always been very pleasant to me.” “She is brainy enough,” replied Polly; “the trouble is, she knows it and she shows that she knows it.” “If she did not know it, there would be nothing to know,” said David severely. Polly’s smile broadened. “I was thinking,” she resumed, “of what Patricia said the other day. Marietta has just been elected president of the Much Ado Club in place of Ruth Mansfield. You know the Mansfields are going to live in California. Ruth has grown pretty stout, and Marietta looks as if she would blow away. Somebody was wondering if she could fill Ruth’s place, and Patricia said very soberly, ‘I think she’ll wabble about a little.’ Wasn’t that bright?” “Unkind,” he answered forbiddingly. “Oh, David!” she sighed, “you are so matter-of-fact. You don’t like Patty any better than ever.” [5] “There is not much of her to like,” he said quietly. “David Collins!” “It is true.” “Every one but you thinks she is lovely,” asserted Polly. “Probably they don’t require depth.” “Patricia isn’t shallow,” she retorted. “It appears so to an outsider. Look at her and her gang!” “Gang!—David!” He gave a short laugh. “The truth is, Polly, seeing we are talking plainly, I don’t like the girls with whom you are so popular—the girls that have made you their queen. They—” “Queen! What are you talking about, David?” Polly broke in without ceremony. Her voice was scornful. “Yes, queen,” reiterated the young man. “Only they rule you, not you them.” “You don’t like it because I said yesterday I hadn’t time to have a flower garden,” accused Polly. “No,” denied David, “I was thinking of something else. You have too many clubs on your hands.” “They don’t amount to much in the way of time,” returned Polly. “They must be a great bore.” [6] “No; they keep me out of a rut, put me in touch with everything.” “H’m!” scorned David. “I am glad I don’t need a posse of chattering girls to keep me up to date. Not a single club for me in vacation! Cut them out, Polly, every one! Why not?” The girl laughed. “What a queer fellow you are! I’ll write to you every day if you wish,” she added with seeming irrelevance, remembering a certain request when they had separated at the beginning of the last college year. David brightened perceptibly—until a sparkle of fun in her brown eyes swiftly altered his expression. “Yes, you will have as much as three minutes a day to give to me, won’t you!” he flashed, a tinge of bitterness in his tone. “No, truly, David, I am in earnest,” smiled Polly. “My clubs don’t take up nearly as much of my time as you think. If you would join some of them—the College, for instance—you would change your mind. You stand outside and criticize; you don’t get the right viewpoint. Try it, David! You won’t be sorry. I’ll propose your name at the next meeting.” “No, you will not!” was the prompt reply. “Nice time to join, while I am off in an Adirondack camp.” “Oh, well, you are not going to stay all summer, are you?” [7] “I may.” Polly looked straight into the blue eyes opposite. “Do you mean it?” He bowed gravely. “It is more than possible.” He pulled out his watch. “Time we were on the march,” he said, springing to his feet. The walk home was like many another walk. Polly tried to make talk, with poor results. There were long silences, while she, watching her companion’s face, longed with all her heart to read what was being written behind those unreadable eyes. She felt a relief when the hospital was sighted. “You’ll be up in the morning, shan’t you?” she asked. “I think there will not be time,” David answered quietly. “Converse wishes to make an early start. I would better say good-bye now.” He took her hand in his strong grasp, held it a moment as if words were not ready, then said calmly, “I hope you will have a pleasant summer.” “Just as if I were some ordinary acquaintance he had met on the street,” Polly told herself in the seclusion of her own room. “What does ail him!” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2764/76269.html","bookId":1338,"book":{"id":1338,"title":"When Polly was Eighteen","description":"简介： The young man, stretched on the grass among the waving shadows, was gazing across the valley to the hills in their soft afternoon veiling. It was a June picture beautiful enough to hold the attention of any one, yet it was plain that Davids thoughts...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2764","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
