{"id":30439,"no":13,"title":"CHAPTER XIII WHAT SARDIS SAID","content":"POLLY was preparing the chosen ones of her small flock for a ride. Of late automobile rides had been few, the driver’s time having been too full of indoor work. “They will live outdoors in a few days,” she told herself, when her conscience had pricked her for keeping them in the heat of Paradise Ward. But this morning no pressing task was at hand, and she happily made ready for a short ride into the country, planning to call for Dolly Merrifield on the way. “Miss Dudley, there’s a woman downstairs who wants to see you,” announced Andrew, one of the orderlies. “Didn’t she give her name?” “No, ma’am, she didn’t. I’ll step down and find out.” “No, no,” returned Polly. “Probably it’s about one of the patients, and it isn’t I she wants at all. If you’ll see to the ward a minute, Andrew, I’ll be right back.” As Polly entered the reception room a plump little woman arose and greeted her. “Why, good-morning, Mrs. Edmonson,” cried Polly. “I was just going out to your house, to take Dolly to ride.” [94] The woman shook her head sadly. “I’m afraid she won’t be able to go. Thank you just the same; but she isn’t a bit well.” “Oh, I’m sorry,” responded Polly. “Yes, it’s too bad. I think it may be the heat, we’ve had such awful weather; but I don’t know. It’s about her I’ve come down this morning. I didn’t know but your father would go up and see her some day; I felt he’d be better than anybody else.” “Oh, yes, of course,” returned Polly, “and he’ll be glad to come. What seems to be the matter—just weakness?” “Yes. She sits there looking like a little angel, and growing whiter and whiter every day. I carry her out to the doorstep after the sun is gone, but it don’t seem to do her much good. I’m afraid she’s just fading away. If anything does happen, I don’t know what Sardis will do. That child is the very apple of his eye.” “I’m so sorry, so sorry,” Polly sighed. “I’m sure father will come to see her right away—I’ll find out.” She stepped to a telephone and took up the receiver. “Is father there?... Will you please say that Polly wishes to speak with him.” Presently she came back. “Father says he will drive up to see her at five o’clock this afternoon. Now, don’t worry another bit. I feel sure that he will bring her out all right.[95] You think she couldn’t bear even a short ride? Well, perhaps we’d better wait and see.” Dr. Dudley was a little late to dinner. Polly waited for him anxiously. She had become attached to little Dolly Merrifield, for helplessness always appealed to her, and the tiny girl was rarely attractive. Presently she heard a step in the hall, and the Doctor walked in. “I stayed too long to visit with my patient,” he said as he sipped his soup. “Have I kept you waiting? Where is your mother?” “Why, mother’s at the church to-night. Don’t you remember? She told you she shouldn’t be home. No, dinner hasn’t waited a great while. I am glad you were only visiting. I was afraid Dolly might be worse—how is she?” “I couldn’t discover any urgent need for alarm. The child is in a bad way; but we must remedy that. She needs good country air and food. I fancy Mrs. Edmonson doesn’t set a hotel table. Evidently there is not too much money. What does the son do, did you say?” “The son? Oh, Dolly’s brother! He is a minister away up in New Hampshire, graduated from Yale two years ago.” “Probably he isn’t making a fortune, then,” he smiled. “I wish the child was up there with him. But I don’t see why you can’t take her along with you. It will be better than any tonic I could give her.” [96] “To Overlook? Oh, I wish I could!” “Why can’t you?” “In the first place, I didn’t suppose they’d let her go, and then when I heard how weak she is I thought it wouldn’t be of any use even to think of it.” “’Twon’t hurt her a mite—do her good.” “You think she can bear that long trip?” The Doctor nodded. “She might have to lie down on the way, but that would be easy enough.” Polly’s face had grown very bright. “I should love to have her with us,” she responded. “What did they say? Or didn’t you speak of it?” Dr. Dudley shook his head. “I said nothing of Overlook. Probably they will be glad to have her go; they ought to be. You’d better see Mrs. Edmonson at once. The time is getting short.” Dolly’s aunt did not receive the proposition as gladly as had been expected. “You see,” she explained, “I’m afraid Sardis wouldn’t hear to letting her go so far with strangers. Of course,” she hastened to add, “I’d be willing enough; it might do her no end of good. But Sardis, he is so afraid something will happen to her. It’s nice of you to want to take her, and I’ll write him to-day; though I haven’t much hope he’ll let her go.” As for Dolly herself, she sat in her cushioned chair, eager-eyed at first, but disappointed as she listened to her aunt’s objections. [97] “Why, Aunt Sophie,” she once ventured to pipe, in her tired little voice, “I do guess it would make me ’most well, same as Miss Dudley says. I know I could coax Sardis to say yes, if I only had him here.” “I don’t doubt you could,” returned her aunt with a little laugh; “Sardis would tear the house down and make a bonfire of it if you wanted him to; but he ain’t here, and I don’t know. I expect, though, he’ll be against it, he’s so careful.” Polly went over and sat down by the little girl before leaving. “Don’t worry, dear! Maybe Sardis will say yes—who knows!” “He would if he was some folks,” returned Mrs. Edmonson; “but he isn’t. I know just what his answer will be.” The brightness which had come into Dolly’s face vanished and left it listless and dull. Aunt Sophie, also, grew sad. “I hated to say that,” she whispered to Polly as she stood on the doorstep; “but I couldn’t let her go on hoping and hoping, as I was afraid she would. I wish she could go; but Sardis, though he’s smart as all creation, acts kind o’ foolish sometimes. I’ll let you know soon ’s I hear. I can telephone from the grocery store.” Polly was more disappointed than she at first realized. She was indignant with this brother of the queer name. To think anybody could be so[98] pig-headed as to refuse to believe what her father asserted as truth. If it were only he that would suffer through hot August, instead of sweet, frail little Dolly! He must be an ignorant fellow, this Sardis. Polly said to herself that she would like to tell him what she thought. It wouldn’t be very flattering to his judgment. She wondered if she could induce him to be sensible if she should write herself; but finally she decided to wait. Nearly a week passed, but no word came from the little far-away New Hampshire town to the Children’s House of Joy. At last Polly was so anxious that two days before the morning of starting for Overlook she drove out to Prattsboro. Mrs. Edmonson had received no answer to her letter. Perhaps Sardis had been too busy to go to the post-office, his aunt thought likely. He lived quite a distance from the center, she said. She did not appear to be much disturbed; but little Dolly looked whiter and wispier than ever. Polly’s heart ached to see her. “It won’t make any difference whether we hear or not,” Mrs. Edmonson said dully. “I know Sardis well enough to know he would not do anything about it. So don’t let it change your plans in the least. I may get a letter to-morrow. He’ll answer—he always does.” Polly drove sadly home and told her father the disappointing news. He was sorry and said so. “Probably,” he[99] added, “the child won’t live through the summer if she stays here.” Polly went back to her duties, almost wishing that she had never seen Dolly Merrifield. The next day went its hot, lagging way, and Paradise Ward prepared for an early morning start. Polly put her little folks to bed early, and when they were asleep she went downstairs, leaving a young nurse in charge. “No message from Prattsboro, I suppose,” she said to her mother. “Not a word. It is too bad.” “I’d like to give that Sardis a shaking,” said Polly grimly. “When the dear child could be so comfortable and happy up on Overlook!” The two were still talking when eleven strokes from the clock in the next room started Polly to her feet. “And I meant to be asleep by this time!” she laughed. One of the hospital orderlies appeared at the door, an envelope in his hand. “Dr. Dudley wished me to give you this. He will be down in a few minutes.” Polly took the telegram wonderingly, then opened it. “Mother!” she cried—“listen!” Raineville, New Hampshire, July— To Robert Dudley, M.D., Children’s House of Joy, Fair Harbor, Conn. Your letter received. A big Yes. Everlasting thanks to you. Sardis Merrifield \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2764/76281.html","bookId":1338,"book":{"id":1338,"title":"When Polly was Eighteen","description":"简介： The young man, stretched on the grass among the waving shadows, was gazing across the valley to the hills in their soft afternoon veiling. It was a June picture beautiful enough to hold the attention of any one, yet it was plain that Davids thoughts...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2764","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
