{"id":30454,"no":28,"title":"CHAPTER XXVIII BENEDICTA’S OPPORTUNITY","content":"IT was not until Polly returned from taking her last guests to the Overlook train that she inquired of Esther Tenniel about the note with which David had entrusted her. At the start the little girl smiled into Polly’s eyes in happy forgetfulness of her failure in duty until suddenly memory asserted itself. Then she hid her face in her little hands and broke into a wailing cry. “Oh, Miss Dudley, I forgot! I forgot! I never did think of it till this minute! I told that sweet young man I would give it to you, and now I don’t know where it is. Oh, Miss Dudley!” “Hush, dear,” said Polly soothingly. “It isn’t of the least consequence. I think it is not lost, and if it is, I shall not shed a single tear. Don’t cry another bit.” The child continued to sob, while Polly, with her usual practicality, went on:— “You were playing with your paper dolls that morning, weren’t you?” “Yes, Miss Dudley—the beautiful ones—that the Butterfly Lady gave us.” Polly went to the cupboard where they were[240] kept and looked through the envelopes. The note was not among the dolls. “Do you remember what you wore that day?” Esther reflected. “I think I had on my blue gingham and the white pinafore that goes with it.” Polly examined Esther’s wardrobe, but did not see the white “pinafore.” Then she went to the big laundry hamper and looked over the clothes. The missing apron soon was in her hands, and down in the depths of the little pocket was the note. Esther smiled wanly when she saw it, and began to cry. “I want to tell you a secret,” said Polly. “You’ll promise not to repeat it to anybody?” Then said Polly, “I am glad you forgot! I would a great deal rather have the note now than when it was given you.” Esther looked at her doubtingly. “Glad?” she queried. “Yes, really and truly glad,” laughed Polly. “Now go and play and forget all about it.” “And I needn’t feel sorry?” questioned the little girl. “No, you are to be glad, too.” Esther smiled and flung her arms about Polly’s neck, whispering, “You are the nicest lady that ever was!” Alone with the note, Polly did not open it at[241] once. She sat still with her own thoughts. Finally she unfolded the paper, and read:— Dear Polly: I must see you alone, and somebody is always tagging you round. Please arrange your work so as to meet me up in the grove this evening. I shall be there directly after tea. Sincerely David Polly looked away to the far distant hills—wondering about David. What did he come for? What had he to say to her? Would it have been better if she had let him talk with her, as he wished—as Nita had suggested? No, she could not! She knew well enough what it would have led to. She shook her head, and a shiver ran over her—anything but that! Yes, she had done right. Rosalind Ferne improved daily, and the gain was not microscopic. Even Benedicta spoke of it. “That Ferne kid’s comin’ up,” she said. “Isn’t she!” exulted Polly. “She’ll never walk,” the housekeeper went on, “it’s against nature; but she’ll get stronger and healthier. She won’t go through life so puny.” “Or crooked,” added Polly. “I do’ know!” Benedicta shook her head doubtfully. “I s’pose I ought not to go in opposition to your father, but it ain’t reasonable to think she will walk and be straight after all these years of idleness.” [242] “She will be straight and she will walk,” Polly asserted smilingly. “Father knows what he says. He never makes a statement that he is not able to back up with results.” “Well”—Benedicta drew a long, doubtful breath—“if she ever should—but I don’t b’lieve she will!—it will be a real authentic miracle.” “It will seem so,” agreed Polly, “yet it is just such things that father is doing every day.” The housekeeper looked at her with unbelieving eyes. “Do you mean that your father has ever cured anybody that was like that little Ferne kid?” “A good many of them. You know about Doodles?” “No. What?” “When he was three or four years old he had a fall and could never walk a step afterwards until father operated upon him some six years ago.” “Well, that’s amazin’ly marvelous, of course; but they’ve taken that kid to piles of doctors, and every one of ’em said she couldn’t be cured.” “Yes,” smiled Polly. “And Doodles was examined by a famous New York surgeon just before father saw him; his verdict was that the case was utterly hopeless.” “He did! Sinners and snobs! Why in the universe don’t you do some braggin’? Bet I would, if it was my father.” The girl laughed. “I believe in him thoroughly,”[243] she said. “That’s better than braggardism.” “My! but that’s a lovely word!” cried Benedicta. “Say it again, please; I never heard it.” Polly repeated it. “When I was a child,” she laughed, “I used to say ‘superbondonjical.’ Maybe that would suit you.” “Fine! What does it mean?” “I used it for anything that especially pleased me,” Polly replied. “All right,” returned Benedicta. “I think, then, that you are superbondonjical.” Clementina came to see what they were laughing at, and Polly took the opportunity to escape into the ward. She found Rosalind crying softly because a little toy dog which she had wound up refused to bark. Polly looked it over. “It is out of order,” she concluded. “That is the reason it doesn’t work.” Rosalind was thoughtful. “Daddy doesn’t work on Sunday,” she said. “Is he out of order?” Polly was about to explain, when the little one wailed out, “I want my daddy! I want to see my daddy!” It was the first time she had shown any sign of homesickness. For a moment Polly was at a loss for comforting words. She well knew that it would be a hard matter to persuade Mr. Wheatley to come up to the[244] house. She was spared from speaking, however, for Clementina and Benedicta walked in. “What’s the matter?” inquired the latter. “I want—my daddy!—I want—my—dad-dy!” sobbed Rosalind. “You poor little kid!” crooned Benedicta. And gently pushing Polly aside she sat on the edge of the bed and held the child close. “Poor little kid!” The sobbing lessened, but still kept on. “Now, see here!” began Benedicta in a coaxing tone, “you just be a good girl and stop crying, and pretty soon we’ll have a regular superbondonjical time.” “I don’t know what kind of a time that is—I guess I never had one.” The mite was interested at once. “Oh, it’s lovely, amazin’ly lovely, a superbondonjical time is!” The voice was inspiring. Rosalind smiled. “Will we have it now?” she asked. “Just as soon as I can get it ready; I guess about the time you’ll sit up to your little table in your little chair.” This was a wonderfully satisfying answer, and Rosalind closed her eyes with a breath of content. She was constantly looking forward to ten o’clock in the morning and six o’clock in the afternoon, those being the hours when she was taken up for a short time and allowed to sit in the small chair[245] that “daddy” had made for her and to eat her luncheon or supper upon the pretty table which Grandpa Wheatley had fashioned to match the chair. Benedicta held her a moment longer and then laid her tenderly upon her pillow. The child opened her eyes and gazed up into the kind, homely face. “You look like daddy,” she said thoughtfully. The housekeeper drew back with a start. “I—I must go see to—” Nobody found out just what she was going to “see to,” for she was gone. Soon a sweet, spicy odor floated into the ward, which caused the little folks to sniff delightedly and to wonder among themselves what was in store for them. It was not long before Benedicta and the “superbondonjical” luncheon came in. On the tray were freshly baked oatmeal macaroons, little cooky girls with wide skirts, and glasses of creamy milk. Rosalind smiled up at the housekeeper, and said again, “You do look like daddy!” This time, however, Benedicta did not run away. Instead, she responded, “Do I?” and went on to tell of a little girl that was lost and who was finally restored to her friends because of her likeness to one of her sisters. Polly, musing over this, wondered what relation Benedicta bore to the Wheatley family. Perhaps[246] in time the truth would come out. It did come—and sooner than she had expected. She awoke early one morning and went downstairs to find Benedicta in the midst of a big baking. “Teeters and tongs!” ejaculated the housekeeper, “what in the universe are you up at five o’clock for? I calculated on havin’ the kitchen to myself for two hours longer.” She stood and viewed Polly dejectedly. The girl laughed. “I’m going right away,” she said. “I won’t hinder you a minute. If I can help,” she added, “I’ll stay.” Benedicta shook her head, as Polly turned to the piazza door. “Hold on!” she called in a hushed tone: “I might as well stop now and tell you. The cookies are baked, the bread’s goin’ all right, and the pies are ready—wait a minute and I’ll put the bread in.” She came from the oven, laid her holder on the only empty corner of the table, and glanced around. “Huh,” she muttered, “looks as if the Devil was havin’ an auction!” Then she sat down. “I s’pose you know all about Sereno Wheatley and me.” “No,” answered Polly. Benedicta looked at her with her eyes narrowed. “Do you mean to say, Miss Polly, that you haven’t asked what anybody in town could communicate?” [247] “I have made no inquiries,” Polly replied. “I thought if there was anything that you wished me to know you would tell me.” “Well, if you aren’t the nicest! The idea of your not askin’! I s’posed you knew the whole story from A to Z. Dear me, I must tell it quick, for I’ve got lots of bakin’ to do before breakfast. “Sereno Wheatley is my half-brother. My mother married twice. Sereno was Wheatley’s child and I was a Clapperton. He’s considerable older ’n I am, but we were always chummy, some way—we liked each other, or did till he got married. We all s’posed he was goin’ to marry Isabel Lockwood, the prettiest girl in town; but if he didn’t go to Boston an’ get acquainted with Lily Starr, an’ before we knew anything about it he brought her home—married! We never liked her, not one of us. My father wouldn’t have ’em at home, so off they went, and I guess they had a hard time gettin’ along. She was pretty enough, but she’d been brought up different from what he had, and I s’pose I kept comparin’ her with Isabel Lockwood—Isabel was my chum. She died young. Lily was called a beauty, but she wasn’t a circumstance to Isabel. Anyway, she was a Democrat! That was enough for my father. But I d’n’ know. It looks different now from what it did then. I—I guess it’s partly that little Ferne kid an’ partly you, Miss Polly—anyway, I feel somehow different. [248] “An’ that makes me think of one thing more I’ve got to tell you. I didn’t lie when I broke your car and said I ran into my Miss Flora and Mr. Aimé. I did, but I didn’t make any remarks about what started my doin’ it. Oscarlucy was takin’ Rosalind to ride in her little cart—she was always peregrinatin’ round with that kid—and I turned the corner an’ come on them so sudden, I almost run ’em down! I was ’bout scared to death, and then I swung out so far I just scooted into my other folks! That’s the truth and every mite I’ve got to confess. Well, I heard las’ night that his wife’s sick—it’s a fever—and they can’t get a soul to come an’ help. So there they are, Sereno and that ten-year-old Oscarlucy. If she’s like most children she’s worse ’n nobody, an’ when it comes to nursin’, a man ain’t in it, no matter how good he is. So I’ve got to go! I said to myself ’t I couldn’t, ’t my place was here with you and the kids. And I went to bed. But then I got to thinkin’ till I ’most jumped up an’ started off. You see, I—well, I’d been prayin’ the Lord to give me an opportunity to kind o’ make up with Sereno, for I couldn’t just go walkin’ in there after all these years and say, ‘Brother Sereno and Sister Lily, I’ve come to be reconciled’! I couldn’t fire off such a thing at ’em, could I? Well, when it come to me that here was the opportunity I’d been prayin’ for, I made up my mind I’d better get down there as quick as I could. But I wasn’t[249] goin’ to leave you in the lurch! So I set my alarm-clock and got up at half-past three—” “Why, Benedicta,” broke in Polly, “you shouldn’t have thought of me! I can cook—a little, and so can Lilith. We’ll get along all right.” “Then you don’t blame me for going?” The housekeeper eyed the girl keenly. “Blame you!” Polly took the reddened hands in her own. “It is the very thing I want you to do. I am proud of you to know that you are ready to go—just when you are needed.” Benedicta shook her head slowly. “Thank you, Miss Polly. I’m goin’ sure, though”—a flush stole over her face—“I’d rather be horsewhipped than to do it! Las’ night, at first, I almost hoped you wouldn’t let me off!” “I know how you feel,” returned Polly; “but when it is over with, you wouldn’t have missed it for a farm. You’ll be so glad. It will pay—if only for that.” Benedicta looked at Polly through a mist of tears. “It’s just you and that little Ferne kid that’s done it,” she said. “You are so good!” “Nonsense! I’m not good at all!” Benedicta smiled as a tear ran down her cheek. “I do hope, Miss Polly, that I’ll get to heaven before you do—I shall be amazin’ly disappointed if I don’t—for I’m countin’ on bein’ there when your crown is brought in. You’ll look so astonished, for it’ll be full of stars—bright ones,[250] too!—and you’ll say, ‘Oh, no, that isn’t mine! That can’t be for me! There must be some mistake!’ Oh, I know just what you’ll say, and it’ll be such fun to hear you say it!” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2764/76296.html","bookId":1338,"book":{"id":1338,"title":"When Polly was Eighteen","description":"简介： The young man, stretched on the grass among the waving shadows, was gazing across the valley to the hills in their soft afternoon veiling. It was a June picture beautiful enough to hold the attention of any one, yet it was plain that Davids thoughts...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2764","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
