{"id":22448,"no":8,"title":"CHAPTER VII. AT THE OLD BAILEY.","content":"\"George William Foote, William James Ramsey, and Henry Arthur Kemp,\" cried the Clerk of the Court at the Old Bailey. It was Thursday morning, March 1, 1883, and as we stepped into the dock the clock registered five minutes past ten. We were provided with chairs, and there were pens and ink on the narrow ledge before us. It was not large enough, however, to hold all my books, some of which had to be deposited on the floor, and fished up as I required them. Behind us stood two or three Newgate warders, who took quite a benevolent interest in our case. Over their heads was a gallery crammed with sympathisers, and many more were seated in the body of the court. Mr. Wheeler occupied a seat just below me, in readiness to convey any messages or hand me anything I might require. Between us and the judge were several rows of seats, all occupied by gentlemen in wigs, eager to follow such an unusual case as ours. Sir Hardinge Giffard lounged back with a well-practised air of superiority to the legal small-fry around him, and near him sat Mr. Poland and Mr. Lewis, who were also retained by the prosecution. Justice North was huddled in a raised chair on the bench, and owing perhaps to the unfortunate structure of the article, it seemed as though he was being shot out every time he leaned forward. His countenance was by no means assuring to the \"prisoners.\" He smiled knowingly to Sir Hardinge Giffard, and treated us with an insolent stare. Watching him closely through my eye-glass, I read my fate so far as he could decide it. His air was that of a man intent on peremptorily settling a troublesome piece of business; his strongest characteristic seemed infallibility, and his chief expression omniscience. I saw at once that we should soon fall foul of each other, as in fact we did in less than ten minutes. My comportment was unusual in the Old Bailey dock; I did not look timid or supplicating or depressed; I simply bore myself as though I were doing my accustomed work. That was my first offence. Then I dared to defend myself, which was a greater offence still; for his lordship had not only made up his mind that I was guilty, but resolved to play the part of prosecuting counsel. We were bound to clash, and, if I am not mistaken, we exchanged glances of defiance almost as soon as we faced each other. His look said \"I will convict you,\" and mine answered \"We shall see.\" Sir Hardinge Giffard\u0027s speech in opening the case for the prosecution was brief, but remarkably astute. He troubled himself very little about the law of Blasphemy, although the jury had probably never heard of it before. He simply appealed to their prejudices. He spoke with bated breath of our ridiculing \"the most awful mysteries of the Christian faith.\" He described our letterpress as an \"outrage on the feelings of a Christian community,\" which he would not shock public decency by reading; and our woodcuts as \"the grossest and most disgusting caricatures.\" And then, to catch any juryman who might not be a Christian, though perhaps a Theist, he declared that our blasphemous libels would \"grieve the conscience of any sincere worshipper of the great God above us.\" This appeal was made with uplifted forefinger, pointing to where that being might be supposed to reside, which I inferred was near the ceiling. Sir Hardinge Giffard finally resumed his seat with a look of subdued horror on his wintry face. He tried to appear exhausted by his dreadful task, so profound was the emotion excited even in his callous mind by our appalling wickedness. It was well acted, and must, I fancy, have been well rehearsed. Yes, Sir Hardinge Giffard is decidedly clever. It is not accident that has made him legal scavenger for all the bigots in England. Mr. Poland and Mr. Lewis then adduced the evidence against us. I need not describe their performance. It occupied almost two hours, and it was nearly one o\u0027clock when I rose to address the jury. That would have been a convenient time for lunch, but his lordship told me I had better go on till the usual hour. As I had only been speaking about thirty minutes when we did adjourn for lunch, I infer that his lordship was not unwilling to spoil my defence. How different was the action of Lord Coleridge when he presided at our third trial in the Court of Queen\u0027s Bench! The case for the prosecution closed at one o\u0027clock, exactly as it did on our first trial at the Old Bailey. But the Lord Chief Justice of England, with the instinct of a gentleman and the consideration of a just judge, did not need to be reminded that an adjournment in half an hour would make an awkward break in our defence. Without any motion on our part, he said: \"If you would rather take your luncheon first, before addressing the jury, do so by all means.\" Mr. Ramsey, who preceded me then, had just risen to read his address. After a double experience of Judge North, and two months\u0027 imprisonment like a common thief under his sentence, he was fairly staggered by Lord Coleridge\u0027s kindly proposal, and I confess I fully shared his emotion. Sir Hardinge Giffard had grossly misled the jury on one point. He told them that even in \"our great Indian dominions, where Christianity was by no means the creed of the majority of the population, it had been found necessary to protect the freedom of conscience and the right of every man to hold his own faith, by making criminal offenders of those who, for outrage and insult, thought it necessary to issue contumelious or scornful publications concerning any religious sect.\" In reply to this absolute falsehood, I pointed out that the Indian law did not affect publications at all, but simply punished people for openly desecrating sacred places or railing at any sect in the public thoroughfare, on the ground that such conduct tended to a breach of the peace; and that under the very same law members of the Salvation Army had been arrested and imprisoned because they persisted in walking in procession through the streets. Under the Indian law, no prosecution of the Freethinker could have been initiated; and, in support of this statement, I proceeded to quote from a letter by Professor W. A. Hunter, in the Daily News. Judge North doubtless knew that I could cite no higher authority, and seeing how badly his friend Sir Hardinge was faring, he prudently came to his assistance. Interrupting me very uncivilly, he inquired what Professor Hunter\u0027s letter had to do with the subject, and remarked that the jury had nothing to do with the law of India. \"Then, my lord,\" I retorted, \"I will discontinue my remarks on this point, only expressing my regret that the learned counsel should have thought it necessary to occupy the time of the court with it.\" Whereat there was much laughter, and his lordship\u0027s face was covered with an angry flush. Later in my address I had a long altercation with his lordship. I wanted to show the jury that such heresy as I had published in the Freethinker abounded in high-class publications, but Justice North endeavoured (vainly enough) to prevent me. The verbatim report of what occurred is so rich that I give it here instead of a summary version: \"Now, gentlemen, I told you before that one of the reasons, in my opinion, why the present prosecution was commenced, was that the alleged blasphemous libels were published in a cheap paper, and I asked you to bear in mind that there was plenty of heresy in expensive books, published at 10s., 12s., and even as much as L1 and more. I think I have a right to ask that you should have some proof of this statement. I think I can show you that similar views are expressed by the leading writers of to-day—not, perhaps, in precisely the same language— for it is not to be expected that the paper which is addressed to the many will be conducted on just the same level, either intellectually or aesthetically speaking, as a publication, in the form of an expensive book, which is only intended for men of education, intelligence and leisure; but such views are put before the public by the most prominent writers of the day. You will, of course, expect to find differences in the mode of expression, and as a matter of course, differences of taste; but I submit that differences of taste affect the question very little unless, as I have said, they actually lead to breaches of the peace. But in a case like this there ought to be no distinction on grounds of taste. Surely the man who says a thing in one way is not to be punished, while the man who says the same thing in another way is to go scot free. You cannot make a distinction between men on grounds of taste. I can imagine that if there were a parliament of aesthetic gentlemen, and Mr. Oscar Wilde were made Prime Minister, some such arrangement as that would find weight before the jury; but, in the present state of enlightened opinion, I do not think that any such arrangement would be accepted by you. Now, gentleman, I shall call your attention first of all to a book which is published by no less a firm than the old and well-established house of Longmans. The author of the book—— Mr. Justice North: What is the name of the book? Mr. Foote: The book is the \u0027Autobiography of John Stuart Mill.\u0027 Mr. Justice North: What are you going to refer to it for? Mr. Foote: I am going to refer to one page of it, my lord. Mr. Justice North: What for? Mr. Foote: To show that identical views to those expressed in the cheap paper before the court are expressed in expensive volumes. Mr. Justice North: I shall not hear anything of that sort. I am not trying the question, nor are the jury, whether the views expressed by other persons are sound or right. The question is whether you are guilty of a blasphemous libel. I shall direct them that it will be for them to say whether the facts are proved in this case. Mr. Foote: I will call your attention, my lord, to the remarks of Lord Justice Cockburn in a similar case. Mr. Justice North: I will hear anything relevant to the subject. My reason for asking you was to find out whether you were going to quote a law book. Mr. Foote: I will quote a verbatim report. Mr. Justice North: I can hear that. Mr. Foote: It is the case against Charles Bradlaugh and Annie Besant. Mr. Justice North: By whom is your report published? Mr. Foote: It is a verbatim report published by the Freethought Publishing Company—the shorthand notes of the full proceedings, with the cross-examination and the judgment of the court. Mr. Justice North: There is no evidence of that. Did you hear it? Mr. Foote: I did not personally hear it, but my co-defendants did. Mr. Justice North: I will hear you state anything you suggest as being said by Lord Chief Justice Cockburn. Mr. Foote: Mrs. Besant was about to read a passage from \u0027Tristram Shandy\u0027—— Mr. Justice North: You have not proved the publication. Mr. Foote: Quite so, my lord; but although this is not formal evidence, and only the report of a case, I thought your lordship would not object to hear it. [Mr. Foote here handed in a copy of the report to the judge, and pointed out that the Lord Chief Justice had said he could not prevent Mrs. Besant from committing a passage to memory, or from reading books as if reciting from memory]. Mr. Justice North: I will allow you to go on, either quoting from memory or reading from the book; but I cannot go into the question of whether this is right or not. Mr. Foote: I am not proposing that. I am only going to show that opinions like those expressed here extensively prevail. Mr. Justice North: That is not the question at all. If they extensively prevail, so much the worse. What somebody else has said, whoever that person may be, cannot affect the question in this case. Mr. Foote: But, my lord, might it not affect the question of whether a jury might not themselves, by an adverse verdict, be far more contributing to a breach of the peace than the publication on which they are asked to adjudicate? Mr. Justice North: I think not, and it shall not do so if I can help it. It is a mere waste of time to attempt to justify anything that has been said in the alleged libel by showing that someone else has said the same thing. Mr. Foote: In all trials the same process has been allowed. Mr. Justice North: It will not be allowed on this occasion. Mr. Foote: If your lordship will pardon me for calling attention to the famous case of the King against William Hone, I would point out that there Hone read extracts to the jury. Mr. Justice North: Very possibly it might have been relevant in that case. Mr. Foote: But, my lord, it was precisely a similar case—it was a case of blasphemous libel. Lord Ellenborough sat on the bench. Mr. Justice North: Possibly. Mr. Foote: And Lord Ellenborough allowed Mr. Hone to read what he considered justificatory of his own publication. The same thing occurred in the case of the Queen against Bradlaugh and Besant. Mr. Justice North: We have nothing to do to-day with the question whether any author has taken the views which are taken in these libels, whoever the author was. Mr. Foote: Does your lordship mean that I am to go on reading or not? Mr. Justice North: Go on with your address to the jury, sir; that\u0027s what I wish you to do. But you cannot do what you were about to do—refer to the book you mentioned for any such purpose as you indicated. Mr. Foote: I hope your lordship does not misunderstand me. I am simply defending myself against a very grave charge under an old law. Mr. Justice North: Go on, go on, Foote. I know that. Go on with your address. Mr. Foote: Your lordship, these questions are part of my address. Gentlemen (turning to the jury), no less a person than a brother of one of our most distinguished judges has said—— Mr. Justice North: Now, again, I cannot have you quoting books not in evidence, for the sake of putting before the jury the matters they state. The passage you referred to is one in which the Lord Chief Justice pointed out that that could not be done. Mr. Foote: But the action, my lord, of the Lord Chief Justice did not put a stop to the reading. He said he would allow Mrs. Besant to quote any passage as a part of her address. Mr. Justice North: Go on. Mr. Foote: No less a person than the brother of one of our most learned—— Mr. Justice North: Now did I not tell you that you could not do that? Mr. Foote: Will your lordship give me a most distinct ruling in this case? Mr. Justice North: I am ruling that you cannot do what you are trying to do now. Mr. Foote: I am sorry, my lord, I cannot understand. Mr. Justice North: I am sorry for it. I have tried to make myself clear. Mr. Foote: Does your lordship mean that I am not to read from anything to show justification of the libel? Mr. Justice North: There is no justification in the case. The question the jury have to decide is whether you, and the persons present with you, are guilty of a libel or not. For that purpose they will have to consider whether the matters in question are a libel. If so, they will have also to consider whether you and the other defendants are guilty of having published it. If they think it a libel, and that you have published it, they will have answered the only two questions they will have to put to themselves. Mr. Foote: My lord, in an ordinary libel case justification can be shown. Mr. Justice North: Go on. Mr. Foote: I do not wish to occupy the time of the court unnecessarily, but really I think your lordship ought to remember the grave position in which I stand, and not stand in the way of anything which I consider to be of vital importance to my defence. Mr. Justice North: I have pointed out to you what I consider to be the question the jury have got to decide. I hope you will not go outside the lines I have pointed out to you; but, with these remarks, I am very reluctant to interfere with any prisoner saying anything which he considers necessary, and I will not stop you. I hope you will not abuse the concession I consider I am making to you. Mr. Foote: I should be very sorry, my lord. I am only stating what I consider necessary.\" This is a very fair specimen of his lordship\u0027s manners. Unfortunately, it is also a fair specimen of his lordship\u0027s law. When I read similar extracts in the Court of Queen\u0027s Bench, Lord Coleridge never interrupted me once; nay, he told the jury that I had very properly brought those passages before their notice, that I had a perfect right to do so, and that it was a legitimate part of my defence. Since then I have conversed with many gentlemen who were present, some of them belonging to the legal profession, and I have heard but one opinion expressed as to Judge North\u0027s conduct. They all agree that it was utterly undignified, and a scandal to the bench. Perhaps it had something to do with his lordship\u0027s removal, a few weeks afterwards, to the Chancery Court, where his eccentricities, as the Daily News remarked at the time, will no longer endanger the liberty and lives of his fellow-subjects. When I cited Fox\u0027s Libel Act and asked that my copy, purchased from the Queen\u0027s printers, might be handed to the jury for their guidance, his lordship sharply ordered the officer not to pass it to them. \"I shall tell them,\" he said, \"what points they have to decide,\" as though I had no right to press my own view. He would never have dared to treat a defending counsel in that way, and he ought to have known that a defendant in person has all the rights of a counsel, the latter having absolutely no standing in court except so far as he represents a first party in a suit. \"May they not have a copy of the Act, my lord?\" I inquired. \"No,\" replied his lordship, \"they will take the law from the directions I give them; not from reading Acts of Parliament.\" This is directly counter to the spirit and letter of Fox\u0027s Act; and I suspect that Judge North would have expressed himself more guardedly in a higher court. If juries have nothing to do with Acts of Parliament, why are statutes enacted? Judge North would be ashamed and afraid to speak in that way before his superior brother judges at the Law Courts; but at the Old Bailey he was absolute master of the situation, and he abused his power. He knew there was no court of criminal appeal, and no danger of his being checked by either of the fat aldermen on the bench. They were in fact our prosecutors, and they appeared to enjoy their paltry triumph. As I have said, I began my address to the jury at one o\u0027clock, and at half-past we adjourned for lunch. Mr. Wheeler ran across the road and ordered some refreshment for us, and pending its arrival we descended the dock-stairs and entered a subterranean passage, which was lit by a single gas-jet. On each side there was a little den with an iron gate. One of these was filled with prisoners awaiting trial or sentence, who gazed through the bars at us with mingled glee and astonishment. They were chatting merrily, and I imagine from their free and easy manner that most of them were old gaol-birds. Perhaps there were some forlorn, miserable creatures cowering in the darkness behind, with throbbing brows and hearts like lead, on whose ears the light laughter of their callous companions grated even more harshly than it did on ours. The left-hand den was empty, and into it we were ushered by the aged janitor, who regarded us with looks of mute reproach. He was evidently subdued to what he worked in. His world consisted of two classes—criminals and police; and without any further ceremony of trial and sentence, the very fact of our descending into his Inferno was clear evidence that we belonged to the former class. As the den was only illuminated by a few straggling gleams from the gas-jet outside, we were unable to discriminate any object until our eyes grew accustomed to the gloom. While we were in this state of semi-blindness, something stirred. I wondered whether it was a dog or a rat. The doubt was soon resolved. A human form reared itself up from the bench against the wall, where it had been lying, not asleep indeed, but half unconscious; and to our great surprise, it turned out to be Mr. Cattell, who had surrendered to his bail at the same time as we did, and had been shivering there ever since ten o\u0027clock. After we left him he continued shivering for three or four hours longer in that black-hole of the Old Bailey, which struck a chill into our very bones even in the brief period of our tenancy, and which could hardly be warmed by any conflagration short of the last. It appeared damp as well as cold, and a sinister effluvium came from a place of necessity at the back. Six or seven hours\u0027 incarceration in such a place might injure a strong constitution and seriously damage a weak one. Surely it is scandalous that unconvicted prisoners, some of whom are eventually acquitted, should suffer this unnecessary hardship and incur this unnecessary risk. Presently our lunch arrived. The platefuls of meat and vegetables had a savory smell, our appetites were keen, and our stomachs empty. But a difficulty arose. There were forks, but no knives; those lethal instruments being forbidden lest prisoners should attempt to cut their throats. I subsequently had the use of a tin knife in Newgate, but even that, which used to be common in prisons, is now proscribed. The only carving instruments allowed the guests in her Majesty\u0027s hotels is a wooden spoon, although the tin knife still lingers in the Houses of Detention. Among other elaborate precautions against suicide, I found that the prisoners awaiting trial were furnished with quill pens. Steel pens had been banished after the desperate exploit of one poor wretch, who had stabbed away at his windpipe with one, and inflicted such grave injuries that the officials had great difficulty in saying his life. But revenons a nos moutons, or rather our forks. We disposed of the vegetables somehow, and as for the meat, we were obliged to split and gnaw it after the fashion of our primitive ancestors. We drank out of the mouth of the claret bottle, passing it round till it was emptied. It was probably a good honest bottle, but in the circumstances it seemed a despicable fraud. We tried hard for another supply, but we failed. Being anxious to prevent a display of inebriety in the dock, or desirous to repress rather than stimulate our audacity, the venerable janitor interposed the most effectual obstacles, and we were constrained to reason down the remnant of our thirst, which, if I may infer from my own case, was almost as insensible to argument as the judge himself. Feeling very cold, we essayed a little exercise. The dimensions of our den, which were three steps each way, did not allow much play for individuality. Erratic pedestrianism was clearly dangerous, so we rushed round in Indian file, like braves on the warpath; and, by way of relieving the tedium, we speculated on the number of laps in a mile. Our proceedings seemed to strike the wild beasts in the opposite den as unaccountable imbecility. They grinned at us through the bars with as much delight as children might evince in the Zoological Gardens at a performance of insane monkeys. But their amusement was suddenly arrested. St. Peter appeared at the gate, flourishing his keys. It was two o\u0027clock. What a strange sensation it was, mounting those dock stairs! More loudly than my experiences below, it said—\"You are a prisoner.\" The court was densely crowded, and as I emerged into it, the sea of faces, suddenly caught en masse, seemed cold and alien. The feeling was only momentary, but I fancy it resembled the weird thrill that must have swept through the ancient captive as he entered the Roman arena from his dark lair, and confronted the vague host of indifferent faces that were to watch his fight for life. I resumed my address to the jury at two o\u0027clock, and concluded it at four. A considerable portion of that time was spent in altercations with the judge, of which I have already given some striking specimens. Let me now give another. It excited great laughter in court, and I confess the situation was so comic that I could scarcely preserve my own gravity. After quoting a number of \"blasphemous\" passages from the writings of Professor Clifford, Lord Amberley, Matthew Arnold, the author of \"The Evolution of Christianity,\" Swinburne, Byron and Shelley, I proceeded thus: \"Now, gentlemen, I have given you a few illustrations of permitted blasphemy in expensive books, and I will now trouble you with a few instances of permitted blasphemy in cheap publications, which are unmolested because they call themselves Christian, and because those who conduct them are patronised by ecclesiastical dignitaries.\" Here I produced a copy of the War Cry, in which I had marked a piece of idiotic \"blasphemy.\" Judge North scented mischief, and gestured to the officer behind me. But that functionary was too deeply interested in the case to make much haste, and, not wishing to be frustrated, I read as rapidly as I could. Before he could arrest me I had finished the extract. My auditors were all convulsed with laughter, except the judge, who was convulsed with rage. As soon as he could articulate he addressed me as follows: Mr. Justice North: Now, Foote, I am going to put a stop to this. I will not allow any more of these illustrations of what you call permitted blasphemy in cheap publications. I decline to have any more of them put before me. Mr. Foote: My Lord, I will use them for another purpose, if you will allow me. Mr. Justice North: You will not use them here at all, sir. Mr. Foote: May they not be used, my lord to show that an equally free use of religious symbols, and religious language, prevails widely in all classes of literature and society? Mr. Justice North: No they may not. I decline to hear them read. They are not in evidence, and I refuse to allow you to quote from such documents as part of your speech. Mr. Foote: Well, gentlemen, I will now ask your attention very briefly to another branch of the subject. The fact is, I was perfectly satisfied. I had purposely kept the War Cry till the last. It naturally ended my list of citations, and his lordship\u0027s victory was entirely specious. Those who may wish to read my address in its entirety will find it in \"The Three Trials for Blasphemy.\" For those, however, who are not so curious or so painstaking, I give here the peroration only, to show what sentiments I appealed to in the breasts of the jury, and how far my defence was from boastfulness or servility: \"Gentlemen,—I told you at the outset that you, are the last Court of Appeal on all questions affecting the liberty of the press and the right of free speech and Freethought. When I say Freethought, I do not refer to specific doctrines that may pass under that name: I refer to the great right of Freethought, that Freethought which is neither so low as a cottage nor so lofty as a pyramid, but is like the soaring azure vault of heaven, which over-arches both with equal case. I ask you to affirm the liberty of the press, to show by your verdict that you are prepared to give to others the same freedom that you claim for yourselves. I ask you not to be misled by the statements that have been thrown out by the prosecution, nor by the authority and influence of the mighty and rich Corporation which commenced this action, has found the money for it, and whose very solicitor was bound over to prosecute. I ask you not to be influenced by these considerations, but rather to remember that this present attack is made upon us probably because we are connected with those who have been struck at again and again by some of the very persons who are engaged in this prosecution; to remember that England is growing day by day in its humanity and love of freedom; and that, as blasphemy has been an offence less and less proceeded against during the past century, so there will probably be fewer and fewer proceedings against it in the next. Indeed, there may never be another prosecution for blasphemy, and I am sure you would not like to have it weigh on your minds that you were the instruments of the last act of persecution— that you were the last jury who sent to be caged like wild beasts men against whose honesty there has been no charge. I am quite sure you will not allow yourselves to be made the agents of sending such men to herd with the lowest criminals, and to be subjected to all the indignities such punishment involves. I am sure you will send me, as well as my co-defendants, back to our homes and friends, who do not think the worse of us for the position in which we stand: that you will send us, back to them unstained, giving a verdict of Not Guilty for me and my co-defendants, instead of a verdict of Guilty for the prosecution; and thus, as English juries have again and again done before, vindicate the glorious principle of the freedom of the press, against all the religious and political factions that may seek to impugn it for their own ends.\" The court officials could not stifle the burst of applause that greeted my peroration. I had flung all my books and papers aside and faced the jury. I spoke in passionate accents. My expression and gestures were doubtless full of that dramatic power which comes of earnest sincerity. I felt every sentiment I uttered, and I believe I made the jury feel it too, for they were visibly impressed, and their emotion was obviously shared by the crowd of listeners who represented the greater jury of public opinion. Mr. Ramsey followed me with a speech which he read from manuscript. It occupied half an hour in delivery. It was terse and vigorous, and it really covered most of the ground in debate. I listened to it with pleasure as an admirable summary of our position. But it lost much of its force in being read instead of spoken extemporaneously, and its very virtues as a paper were its defects as an address. The points wanted elaboration. Before they had fairly mastered one argument, the jury were hurried on to another. Mr. Ramsey is by no means incapable of making a forcible speech, and I think he should have trusted to his power of improvisation. There was no need for a long effort. He might have concentrated himself on a few salient points of our defence, and pressed them on the jury with all his might. His own sentiments, naturally expressed, in homely language, would have had a greater effect than any literary composition. After an experience of three trials, I would give this advice to every man who has to defend himself before a jury on a charge of blasphemy or sedition—\"Write out on a sheet of paper the heads of your defence. Number them in the order you think they should be treated, so that your address may have a logical continuity. Fill in your sub-divisions, similarly numbered, under the chief heads, beginning the lines half-way across the page, so as to catch the eye readily. Think every clause out carefully. Fix every illustration in your mind until it becomes almost a fact of memory. Don\u0027t write out fine passages and try to remember them verbally. Write nothing; it will only confuse you, unless you have long practised that method. When you have systematised your thoughts, and think your written arrangement is complete, ponder it clause by clause with the paper at hand for constant reference. No matter if your thoughts seem to wander, and the subject appears to grow vague; your mind is dwelling on it, and ideas will fructify in your mind unconsciously as seeds sprout in the dark. When the hour of trial arrives, arm yourself with the familiar paper, trust to your own courage, and speak out. You will have thoughts, and nature will find you words.\" Justice North\u0027s summing-up was simply a clever and unscrupulous bit of special pleading. Sir Hardinge Giffard had left the court, and his friend on the bench conducted his case for him. He told the jury that I had wasted their time, and indulged in a number of other insults, which might be pardonable in a legal hack bent on earning his client\u0027s fee, but were scarcely consistent with the dignity and impartiality of a judge. His tone was even worse than his words. He had no sympathy with us in our desperate effort to defend our liberty against such overwhelming odds, nor did we solicit any; but we had a right to expect him to refrain from constant expressions of antipathy. That, however, was not the whole of his offence against the rules of justice. He recurred to the bad old example of Lord Ellenborough in devoting most of his time to answering my arguments. Lord Coleridge remarked in the Court of Queen\u0027s Bench that such a task was not for the judge, but for the counsel on the other side of the case. I wish his lordship had read a lesson to Justice North on that subject before he presided at our trial. There is only one passage of his summing-up that I wish to criticise fully. It contains his statement of the Law of Blasphemy. But as he made a very different statement four days later on at our second trial, I prefer to wait until, by placing these discrepant utterances together, I can give the reader a fair idea of Justice North\u0027s authority as a legal oracle. The jury retired at five o\u0027clock. Justice North kept his seat, probably fancying they would soon agree to a verdict of Guilty. But as the minutes went by, and the result seemed after all dubious, he resorted to a paltry trick. Notwithstanding the late hour, he had Mr. Cattell brought into the dock for trial. By procuring a verdict against him our jury might be influenced. According to theory, of course, the jury hold no communication with the world while in deliberation; but it is well known that officers of the court have access to them, and tidings of Mr. Cattell\u0027s fate could be easily conveyed. We stepped down the stairs, out of sight but not out of hearing, and made way for Mr. Cattell to take our place in the dock. He was very pale with cold and apprehension, and too timid to take a seat, he stood with his hands resting on the top ledge. The evidence against him was very brief. Instead of defending himself he had employed counsel. That gentleman admitted the \"horrible character of the publication, so eloquently denounced by the learned judge.\" He said that his client could not for a moment think of defending it; in fact, he had only sold it in ignorance, and he would never repeat the offence. On the ground of that ignorance and that promise, it was hoped that the jury would return a verdict of Not Guilty. Mr. Cattell declares that he never instructed his counsel to say anything of the kind; but all I know is that it was said, and that while our cheeks were tingling with shame and indignation, he heard it all without a word of protest. Judge North acted openly as counsel for the prosecution in this trial. There was not the slightest disguise. He took the case completely into his own hands, examined and cross-examined. His summing-up was a disgusting exhibition. Naturally enough the jury returned a verdict of Guilty without leaving the box; but sentence was deferred until our jury had also agreed. By this time, I felt convinced they would not agree, and every minute strengthened my belief. While they deliberated we were all conducted to the subterranean den, where we kept each other in good spirits. St. Peter brought us some water to drink in a dirty tin can. We tasted it, found that a little of it was more than enough, and declined to hazard a further experiment on our health. At last, after two hours and ten minutes\u0027 waiting, we were summoned back to the dock. There was profound silence in court, and as the jury filed into their seats a painful sense of expectation pervaded the assembly. His lordship said that he had called them into court to see whether he could assist them in any way, and especially by explaining the law to them again. The foreman, in a very quiet, composed manner, replied that they all understood the law, but there was no chance of their agreeing. His lordship invited them to try a further consultation, to which the foreman replied that it would be useless. \"Then,\" said his lordship, \"I am very sorry to say I must discharge you, and have the case tried again.\" Then, turning to the Clerk of Arraigns, he added, \"I will attend here on Monday and try the case again with a different jury.\" This was against the ordinary rule of the court, and the sessions had to be prolonged into the next week for our sakes; but his lordship could not deny himself the luxury of sentencing us. He had set his heart on sending us to gaol, and would not be baulked. We naturally expected to be liberated till Monday, and I formally applied for a renewal of our bail. But his lordship refused my application in the most peremptory and insulting manner. I pointed out that I should require a proper opportunity to prepare another defence for the second trial, to which his lordship replied, \"You will have the same opportunity then that you have now.\" He then hurriedly left the bench, and we were in custody of the Governor of Newgate. Several friends rushed forward to shake hands with us over the dock rail, and there were loud cries of \"Bravo, jury!\" Presently we descended to the Inferno again, from which we were conducted by a long subterranean passage to Newgate prison. Judge North\u0027s action was simply vindictive. Even if we were guilty our offence was only a misdemeanor. We had been out on bail from the beginning of the prosecution, we had duly surrendered to trial, after the jury\u0027s disagreement we really stood in a better position than before, and there was not the slightest reason to suppose that we might abscond. On the other hand, it was clear that we were fighting against long odds. The rich City Corporation was prosecuting us regardless of expense, and their case was conducted by three of the most skilful lawyers in London. Reason, justice and humanity, alike demanded that we should enjoy freedom and comfort while marshalling our resources for a fresh battle. Judge North, however, thought otherwise; in his opinion we required a different kind of \"opportunity.\" He locked us up in a prison cell, excluded us from light and air, deprived us of all communication with each other, and debarred us from all intercourse with the outside world except during fifteen minutes each day through an iron grating. Such malignity is an unpardonable crime in a judge. There may have been some bad criminals in Newgate when I entered it, but I would rather have embraced the worst of them than have touched the hand of Judge North. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3222/87843.html","bookId":704,"book":{"id":704,"title":"Prisoner for Blasphemy","description":"简介： This little volume tells a strange and painful story; strange, because the experiences of a prisoner for blasphemy are only known to three living Englishmen; and painful, because their unmerited sufferings are a sad reflection on the boasted freedom...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3222","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
