{"id":9290,"no":15,"title":"14 THE EASTERN SEA; THE CAPTAIN’S STORY","content":"A frond of white had spread across the sky as they talked. Lalette went to her room in the round covered-house that rose from the deck, and applied herself to the needle. Making the new dress right was a problem, since she had done little but broidery before, and she became so taken with fitting and clipping as not to note the tick of time; then felt drowsy, and lay down to be roused by a knock at the door. It was Tegval, third mate. “May I lead you to supper?” The ship had no motion when they reached air; here they were in the middle of a brown-blue tide, with flat shores stretching to green-blue on either flank. Tegval helped her graciously down the stair, and was this time prompt enough so that all of them were waiting when Captain Mülvedo came in. This officer was now at ease, cracking his face into a smile for Lalette and trying to converse with her about people a demoiselle of condition might be expected to know. Some of them she did know, but was forced to avoid the issue lest he learn the falsity of her name. 322 Tegval offered her his arm after the meal, and showed her around the deck as far forward as the tri-mast, his discourse being of the parts of the ship and the beauty of the sea. He would answer little when she asked him about Brog, the Captain and other personalities, and as evening was now beginning to grow shadowy, with a hint of chill, she announced an early return to her cabin. He leaned close as he handed her in the door and said in a low voice that he would knock at the fourth glass of night with a book, then tipped a finger to his lips to prevent questions (and she realized that even on a ship trading to Mancherei, it was not too well to be an Amorosian). With no desire for sleep, she stretched out on the bed and tried to solve her riddles—how it was that her mind should turn to the seldom-felt nearness of Rodvard. There had been about him the faintest trace of some odor like that of old leather, masculine and comforting. She was a little irritated at herself for feeling the lack of it, and her mind drifted off through other angers till she lay there in the dark, simmering with wordless fury over many things; the ship began to move. The change in circumstance made her conscient of what she was doing; she began to weep for her own troubles, the tears trickling into the hard pillow where her face was buried, thinking that after all Rodvard had perhaps been right to slip away from a witch with so vile a temper. There was a lamp hanging from a kind of pivoted chandelier. She swung out of the bed to light it, but had to strike more than once to obtain a good spark. By this time there was the queerest feeling in her stomach as though it were turning; she lay down again, not sure whether this was the over-robust supper she had eaten or the veritable malady of the sea. Orderly stampings and the sound of shouts drifted through the cabin’s small window as her illness declared itself more firmly; she was miserable, her mind going round like a rat in a slat trap until a whistle was blown four times and someone knocked at the door. Tegval, of course, with an overjacket on that swung as he stood balancing to the motion of the ship on widespread feet. “We sail on a fair and rising wind,” said he, in a lilt. “Good fortune. Are you troubled by the sea, demoiselle?” “I am—ill.” (Hating to confess it.) “No matter. Give me your hand.” 323 It was taken in both his in a manner curiously impersonal, the eyes were closed and his lips moved. They opened pale blue. “You will be well,” said he and sat down on the chair which, for the first time, she noted as bolted to the floor. She did not believe him and the swing of the lamp made her dizzy (and now she could feel his personality reaching out toward her with an effort almost physical, and was enough ashamed of her former angers to put into her tone some of the kindness now felt toward the race of man): “You are most good. I was told you would have a book for me.” He undid his lacings and produced from beneath the jacket a volume, large, flat and all bound in blue leather with the royal coat of arms of Dossola on it to indicate who was the author. “You should not let it be seen,” he said. “Our cargo-overseer takes the law’s letter so seriously that he would denounce his best friend—which I am not.” “You may count on me.” Their fingers touched as he handed it to her, no longer impersonal, and she let the contact linger for a brief second, before leafing over the pages. They were printed in heavy-letter with red initials. “What a beautiful book!” she said. “It is the word of love,” he said. “A true word, a good word—” chopping off suddenly as though there were more it would be imprudent to tell. “I will read it.” She did not want him to go quite yet and sought for words. “God knows, I need some help in the tangle of my life.” Said he: “We make a distinction between the god of evil and the God of love, in whose arms we may lie secure from the savagery that infests the world. Ah, inhumanity! Today a plover lit in the rigging, and what must they do but net that bird to be eaten by the captain. I could barely consume my supper for thinking of it.” Lalette stirred. “I do not understand this feature of your doctrine. One must often go hungry by thinking so, it seems to me. Do we not all live by the death of other beings, and even a plant suffer when it is devoured?” Tegval stood up. “In true love, as you will learn, all are parts of one body, and must give whatever another needs for sustenance. Read the book and sleep well, demoiselle.” He was gone, and to Lalette’s surprise, so was her illness. II It was a strange book, cast in the form of a marvellous tale about a young man whose troubles were manifold, and only because he sought at each step to control his actions by reason, as he had been taught; it seemed that reason forever deceived him, because something would arise that was not comprehended in his philosophy, but was born from the natural constitution of an imperfect world. Thus reason always led him into doing evil, from which he would only be rescued by rejecting reason for affection to his fellow-men. Lest the reader should miss any part of the thought, he who had set this down abandoned his romance from time to time to draw a moral, as: “None can turn from vileness to virtue but those unbound by the teaching of the academies that consistency is a virtue.” 324 Lalette found such interjections an annoyance, but forgave many of them for the beauty of the words, which were like a music; and the great glory of the descriptions of clouds, trees, brilliant night, and all the things that one person may share with all others, but were polluted (said the author) when the one would hold them to himself. Yet the type of the volume made it hard reading, the swing of the lamp made it flicker, so after a time she turned out the light and drifted to sleep. By morning the ship was leaning through long surges under a grey sky with all her sails booming. It was hard to keep food on the table; at breakfast Captain Mülvedo rallied Lalette hilariously, saying she was so good a sailor he must send her to the masthead to run ropes. Brog smiled at her paternally; the first mate, whose ears moved at the end of a long jaw as he chewed, laughed aloud at the Captain’s light jest, and offered to teach her to direct the steering-yoke. On the deck she felt like a princess (that this adventure would succeed after all, glad that she had done with tortured Rodvard), with her hair blowing round her face and salt spray sweet on her lips. The waters set forth an entrancing portrait of sameness and change; she turned from the rail to see Tegval all jaunty, with his eye fixed bow-ward, balancing lightly. Said Lalette; “I would be glad to know what witchcraft it was you used to cure me so quickly.” “No witchcraft, demoiselle,” said he, not turning his head, “but the specific power of love, which wipes out misery in joy. And now no more of this.” The ship heaved; she would have lost her balance but that he put out a hand to sustain her, and the Captain’s voice bellowed: “Tegval! I will thank you to remember that an officer’s duty is to watch his ship and not the pretty ladies. You will do better in the forward head.” 325 He had come unobserved upon them; now as the third mate made a croak of assent, he touched his cap to the girl. “No disrespect to you, demoiselle. You know the legend old seamen have, ha, ha, of sea-witches with green hair that speak to the spirit of a ship and witch her to a doom that is yet ecstasy for her crew? Be careful how you handle the people of my ship; for at sea I have the rights of justice and can diet you on bread and water.” He shook a finger and ruffled like a cock, laughing till all the loose muscles of his face pulled in loops. “But my hair is not green,” said she, falling into the spirit of his words for very joy of the morning (but thinking with the back of her mind—what if he knew I am a witch? and—this one can do nothing for me; why am I here?). “There was a mate with me once,” he said, “in the old Quìnada at the time of the Tritulaccan war, which you are too young to remember, demoiselle.” He ducked his head in a kind of bow to emphasize the compliment. “Yeh, what a time of it we had in those days, always dodging from one port to another, and afraid we’d be caught by a rebel cruiser or one of those Tritulaccans and finish our years pulling an oar under the lash in the galleys of an inshore squadron. A dangerous time and a heavy time; you cannot imagine the laziness of some of these sailors, demoiselle, who will see their own lives sacrificed rather than keep a sharp watch. I do remember now how we were making into the Green Islands in broad daylight, when I found one of them sound asleep, cradled in the capon-beam forward, where he had been set as a lookout—and in the Green Islands, mind you, where armed vessels would lie in among the branches to pounce on you. “Yet you shall not think it was an exciting life, demoiselle, for the thing no one will ever believe is that in war you go and go, attending death with breakfast and nothing ever happening, so that it is almost a relief to fight for life. This mate now—what was his name? He was always called Rusty for no reason I could ever plumb, since his head was not rusty at all, but dark as yours—well, Rusty, the mate, you could hardly call him handsome, but he was gay and lively and had a good tongue. Always telling stories he was, of things that happened, and the good half of them happened to other people, though he took the name of it. But bless you, nobody minded, he could carry off the tale so well. I call to mind how one night when we were both together at the home of Ser Lipon, that was our factor, Rusty started right in with the story of a polar-bear hunt in the ice beyond Kjermanash that I had no more than finished telling him about the day before, just as though he had been in the center of it. “I sat with my mouth open, but never saying a word, because it had not happened to me, neither, and beside, the Lipons had a daughter, a pretty little thing named Belella, who seemed as much doting on Rusty as he on her, and it was no part of my game to spoil him, since I was spoken for already, y’ see? So he told the story of the polar-bear hunt and soon enough the two of them were off in an angle of the parlor, and within a week they were married.” 326 Brog approached, touching his cap. “Your pardon, Captain,” he said. “There is a trouble among those bales of wool. I can find but six marked for your account, whereas by the papers it should be thrice that number.” Mülvedo frowned. “Ah, pest, I am engaged.” He took Lalette’s arm tight under his own. “See me later, Brog.” They moved a few steps away, the captain steadying her against the shuddering heave of the sea. “That was his name now, Piansky, though why he should have been called Rusty I never could see. They were married, as I said, after one of those lightning courtships we sailors have to make because we have no time for any others, and they went to live in a big house in Candovaria Square, which the old man had built, and some said it was a cruel waste of money for just the two of them. But I could never follow that, since she was the only daughter, so she would have come into the whole inheritance in time, and she was only getting what would be hers. “One voyage Rusty missed while they were building their nest, but after that he came back to us, happy as a rabbit, and well he might be with a fine wife, a good home and his fortune made. It was about that time my own wife died; Rusty took me home to be with him while the ship lay over for a new cargo. Dame Belella always had a great deal of wine and a house full of people, different ones always, to whom Rusty must forever be telling some tale of his adventures. She would laugh at the ridiculous parts and look proud over him. They were very gay; at least up to the time of the Tritulaccan war, which I was speaking of. “I remember going to Rusty’s house after the second or third voyage in that war, and a dangerous running passage it was, too, out with wool to the south and back with goods for the army, but our captain had judged where the Tritulaccans would be, and we never saw a sail of them. That was the passage where we slipped through the Green Islands, as I have said. We reached Rusty’s house late in the evening; the parlor was already full with people sitting drinking round the fire, and Dame Belella stumbled as she got up to embrace him, which shows how much cargo she had taken aboard already, ha, ha. She let him take her place while she sat down on his lap, saying we must be quiet because here was Ensign Glaverth of the Red Shar, who had been on a raid right through the Ragged Mountains, and was just telling about it. I did not think a thing at the time, since this Glaverth was sitting on the floor with his back to a red leather hassock, and besides he was one of those Glaverths from Ainsedel, the family they call the mountain Glaverths, to distinguish them from the ducal branch. 327 “He was telling how he had requisitioned a bed in a Tritulaccan farmhouse where there was a daughter, and made love to her, so that she told him of an ambush that had been set for the Shar. As I said, I had no hint that Rusty would take it ill till he suddenly interrupted the tale by throwing his cup into the fire and crying that he would have no more of this southern red, which he called hog’s water and traitors’ wine, but wanted the honest fiery beverage of the north. “Two or three of them laughed and Dame Belella put her finger over his lips, and after that she had called the servitor for fired-wine, she begged this Glaverth to go on with his tale. When he had done and they were all murmuring to ask him questions, Rusty pushed his wife off his lap as though she had been a sack of meal and stood up next to the fireplace, with his own cup in his hand. “‘You sows of soldiers,’ he said (begging your grace, demoiselle, but he said it so); ‘You sows of soldiers talk of your perils, but they are not real dangers at all, only what you could meet with on a city street and solve with a strong arm or a little straight talk, or’—well, I will not say what else he said, demoiselle, but it was something that made all those in the room to gasp, if you know what I mean, and at least a third of them wearing coronet badges. “‘Yah!’ Rusty said, ‘Your Tritulaccan wenches! What could they do at the worst but slip a steel splinter in your back, so that you go to Heaven with the Church’s blessing for the glory of old Dossola? But the harridans we seamen must deal with could cost a man his soul and eternal agony. Even now I may be a lost man—a lost man.’ I remember how he said it, putting both hands to his face with a sob, and somebody dropped a cup. They all thought Rusty taken with wine, d’you see, and so did I, but now he began to tell a long tale, with no sign of winishness at all in his voice. 328 “It was all of our voyage to the south through the Green Islands and I swear to you, demoiselle, had I heard it before I sailed, I would not have sailed at all, so gruesome he made it, with escapes from storm and Tritulaccan raiders and all this only a prelude to telling of a thing he said happened in the Green Islands, where we lay becalmed one night, and he walked the deck. He said then he heard a sound like far-away singing, and the ship began to move without a wind. Going forward, he said, he saw something like pools of green fire in the water; therefore knew the ship was approached of sea-witches who were carrying her on. Would have let go the brow-anchor, he would, but all the men of the deck watch were staring over the side, so little obeying him that they even shook off the hands he laid on them. The song went to his own heart and he knew that the ship and all in it must soon be doomed; therefore, he, Rusty, who still had some part of his wits, conceived the measure of going forward to say they could have him as a willing victim if they would release the rest. This was accepted, he said. One of the demon women clambered to the ship through the rope-hangings and companioned with him all night, then bade him farewell with the word that he must come to her again. “Demoiselle, I do tell you that never have I heard Rusty give a tale better. But when it was finished, the Ensign Glaverth took Dame Belella’s hand to bid her good night, saying that he would bring his young cousin over to hear some more of Rusty’s tales, and all the others began to go as well. When all were departed, Dame Belella came to sit on the hassock where the Ensign had been, staring into the fire for a while. ‘Will you never become a man?’ she asked her husband when he would have touched her. “He looked at her a little. ‘Have I said the wrong thing?’ he asked, and was that not a strange question to put? “‘The wrong thing, yes,’ she said, looking away into the fire, without as much as turning her head. ‘I couldn’t like it any more, even if it were not true, Rusty.’ I remember that, because I did not understand and still do not. “He did not say anything more at that time, but I noticed that people were not coming to the house so often as before during this stay of ours in port, and while we were on the next voyage, she sold the place and went out in the west to live. So I think perhaps, it was a good fortune to lose my own wife, though a great sorrow at the time, because people do change and grow apart instead of together.” A wave-crest came across the bulwarks and wetted the edge of Lalette’s dress a little, so that she moved against the supporting arm. Said she (wondering why he had told her this tale); “But she must have known that he only made it up about the sea-witches.” “That could be, could be, now. Could be that she was angry with him for saying so much to a coronetted man like that Ensign Glaverth. But I think more like that just all of us want a new bed-partner now and again, and she could not bear it that he thought of it before her.”","sourceLink":"http://novel.tingroom.com/jingdian/2059/58595.html","bookId":569,"book":{"id":569,"title":"The Blue Star","description":"简介： Penfield twirled the stem of his port-glass between thumb and finger....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2059","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
