{"id":9305,"no":30,"title":"29 NO AND YES","content":"“You helped me so much before,” said Lalette. \\n\\n \\n\\n The widow Domijaiek contemplated her tranquilly from among the husks of characters who never lived. “Yet you are again in need of help.” \\n\\n \\n\\n “The Myonessae. I could not—” \\n\\n 419 \\n\\n \\n\\n “You could not give up the desires of this false, material world for the God of love. However, it is not necessary to agree with everything that is done under the rule of the Prophet, and when the mattern and the diaconals tried to force you to an advancement for which you were not ready, they were also submitting to the rule of Evil. It is asked only to take steps we are prepared for.” \\n\\n \\n\\n “Yes,” said Lalette. \\n\\n \\n\\n “I do not know whether I can help you. Let us examine circumstance. Are you still stricken by lack of money?” \\n\\n \\n\\n “I had not thought of it. Rodvard touches the fees of the court where he is writer. Our needs are small.” \\n\\n \\n\\n The widow’s smile was approving. “That is an element of progress. But he receives these fees because he uses the witchery of the Blue Star, does he not?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “Then that is an element contrary to progress and very dangerous.” \\n\\n \\n\\n Lalette looked at the floor. “I know. Everything seems to be a danger. I am so afraid of Mathurin. He keeps those guards around Rodvard, but I think they are more like jailers.” \\n\\n \\n\\n “One thing you must not do is let fear enter your heart; for it will breed fearful things. Remember that all in this false material world is only the reflection of your thoughts. Have you any word from your mother?” \\n\\n \\n\\n “Yes. A man brought a note. She wants me to escape and join her at the court.” \\n\\n \\n\\n “Do you wish to go?” \\n\\n \\n\\n “I would like to see her again. . . .” Lalette looked up to see Dame Domijaiek watching her attentively, though she remained very quiet, and under the pressure of that silent scrutiny, the girl moved. “She is under Count Cleudi’s protection. And I told you about Demadé; he is very kind and gay, and I think he is in love with me, but—” \\n\\n \\n\\n “Go on.” \\n\\n \\n\\n “He told Mathurin about the little girl, the heiress.” \\n\\n \\n\\n “He was also trying to do the best for you, in his own way. Do you want to go? Or would you rather stay with Rodvard?” \\n\\n \\n\\n In a small voice, Lalette said; “I think I would rather stay with him. Is it wrong?” \\n\\n \\n\\n “Not if it is done in love and good will, rather than for any hope of gain. Have you asked him to take you away from the city?” \\n\\n \\n\\n “No. This—regency is so much to him.” \\n\\n \\n\\n The widow stirred. “You will find help, child. Come to me again when he makes a plan.” \\n\\n 420 \\n\\n \\n\\n She stood up, but before the words of farewell could be pronounced, the door was flung open and the boy Laduis burst in, crying; “Mother! I was at the market, and—” \\n\\n \\n\\n “Laduis, we have a guest.” \\n\\n \\n\\n He looked embarrassed and made to Lalette the bow of a miniature courtier. “Oh, I remember you,” he said. “You are the Princess Sunimaa, only you are not cold any more. I am glad to see you.” He turned again. “Mother, everybody at the market is excited. They say there has been a battle in the Ragged Mountains, and Prince Pavinius has beaten the Tritulaccans and taken three of their generals, and the rest of them are all running away.” \\n\\n II \\n\\n \\n\\n She had gone quietly to sleep; Rodvard had to rouse her with the finger-touch behind the right ear that wakens without shock. Even then, she tried for a moment to draw him close until he whispered; “We must hurry.” \\n\\n \\n\\n Beyond the window there was only cold wintry starshine and little enough of that; but Rodvard had hoped for snow or rain. Lalette gathered her smallest of bundles; he led along the balcony three windows down, to where the trellis was, and stepped off backward into night, resting a moment on each step before taking the next. Lalette’s dresses almost made her stumble on the last steps; she sank into his arms with a little gasp at the bottom. They had carefully worked out the matter of getting over the garden-wall, from the barrel to the shed-roof, the shed-roof to the wall itself. \\n\\n \\n\\n It was too late for the bracket-torch on the back street to have remained alight. As soon as she was down, they dodged shivering past the plane-trees, across, around a corner and into the appointed alley. Something jingled; the man said; “Are you the travellers?” \\n\\n \\n\\n “Dame Domijaiek’s travellers,” said Rodvard, as agreed, and; “Here is your horse and your let-pass,” the other. \\n\\n \\n\\n Rodvard got up first; the man, whose features remained indistinguishable, helped Lalette up behind and gave them a farewell in tones not unfriendly. Rodvard had seldom followed the maze of streets toward the northwest quarter, but it was fairly easy to maintain direction, and there was only one gate leading to the Archer’s Highroad. The horse walked, and Lalette felt so sleepy that it was almost agony to keep her place. \\n\\n 421 \\n\\n \\n\\n There was no one moving on any street and hardly a light at any window. Once a wrong turn led into a blind alley, but that did not hold them back long, and now they were in the shadow of the gate, with a sentry barring the path with a pike and another holding up a lantern. \\n\\n \\n\\n “This is a fine hour to be leaving the city,” grumbled the first. \\n\\n \\n\\n “All hours are fine when one must go,” said Rodvard, and produced his paper; this was the moment of test. \\n\\n \\n\\n The sentry puzzled over it a moment, looked back at them, to the paper again, and said; “Pass friends.” As he turned back to the sentry-cachet with his pike-bearing companion, Rodvard caught a fragment of words “. . . won’t be too glad to see that couple,” and wondered what the paper had said. \\n\\n \\n\\n As they reached the far end of the bridge, where the ancient stone leopard stands, he urged his mount to trot, but the pace was too fast for Lalette, she had to beg him not to. They moved for a long time through a space without figures until, like a conjurer’s trick, trees and houses began to appear in grey outline around them, and then slowly to take on color. The road turned leftward, and the river was beyond, with ice on it. Lalette said; “Rodvard.” \\n\\n \\n\\n He did not turn his head. “What will you have?” \\n\\n \\n\\n “Can you forgive me?” \\n\\n \\n\\n “For what?” \\n\\n \\n\\n “Taking you away from—everything. Your new day, the work.” \\n\\n \\n\\n “There is nothing to forgive. I had to go.” \\n\\n \\n\\n They were silent again, and in that silence the sun grew behind streaked clouds. Lalette was so tired and sore that she felt she must say something about it, but just before endurance reached its limit, they came to the famous bridge of boats at Gogau, with its inn on the opposite bank, and Rodvard said; “Let us rest here and take refreshment.” \\n\\n \\n\\n He helped her down and inside to a seat, still without words, and a round-cheeked innkeeper came to them with a good morning. After he had gone, Rodvard said: \\n\\n \\n\\n “No . . . I do not know quite what I wished or what I wish now; but I am sure it is not to be compelled to use all I have in Mathurin’s way. . . .” \\n\\n \\n\\n He stared across the room away from her, and she (grateful that he was not looking to read her thought with the Blue Star) said; “Do you think he can make his regency stand?” \\n\\n \\n\\n “I do not know, but I think not in the long run. If Prince Pavinius has beaten the Tritulaccans so badly . . .” He touched the jacket where the cold stone lay. “This is not me, and I’ll not be ruled by it, no more than you by your gift of witchery.” \\n\\n \\n\\n She shuddered slightly. “It is a gift I never wished.” \\n\\n 422 \\n\\n \\n\\n Now his face showed trouble. He stood up and paced the floor, then turned to the inn portal, where after a moment she joined him, looking out. The sun had daunted down the clouds, picking everything out in winter’s white gold; beneath them the river hurried past, carrying little pieces of ice against the black boats. At last he said; “Somewhere I have lost the line. . . . I suppose that the most we can do is try to use the lesser evil to overcome the greater, forgiving what we can. . . . It is I who ask you to forgive me.” \\n\\n \\n\\n She put an arm around his waist. “You do not need to. I think I love you.” \\n\\n \\n\\n For an enchanted moment they stood so. Then Rodvard’s hands went to his neck, and with a swift motion, he drew out the Blue Star, over his head and holding it in his hand, glanced at the stream and then at Lalette. \\n\\n \\n\\n “Yes,” she said. It made only a small splash where it struck the water. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2059/58610.html","bookId":569,"book":{"id":569,"title":"The Blue Star","description":"简介： Penfield twirled the stem of his port-glass between thumb and finger....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2059","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
