{"id":45020,"no":15,"title":"SECOND BOOK “Antichrist shall go from land to land and give bread to the poor” I A GREAT MAN’S WIFE","content":"It was in February, and the almond-trees were beginning to blossom on the black lava about Diamante. \n \n Cavaliere Palmeri had taken a walk up Etna and had brought home a big almond branch, full of buds and flowers and put it in a vase in the music-room. \n \n Donna Micaela started when she saw it. So they had already come, the almond-blossoms. And for a whole month, for six long weeks, they would be everywhere. \n \n They would stand on the altar in the church; they would lie on the graves, and they would be worn on the breast, on the hat, in the hair. They would blossom over the roads, in the heaps of ruins, on the black lava. And every almond-flower would remind her of the day when the bells rang, when Gaetano was free and happy, and when she dreamed of passing her whole life with him. \n \n [186] \n \n It seemed to her as if she never before fully understood what it meant that he was shut in and gone, that she should never see him again. \n \n She had to sit down in order not to fall; her heart seemed to stop, and she shut her eyes. \n \n While she was sitting thus she had a strange experience. \n \n She is all at once at home in the palace in Catania. She is sitting in the lofty hall reading, and she is a happy young girl, Signorina Palmeri. A servant brings in a wandering salesman to her. He is a handsome young fellow with a sprig of almond-blossoms in his button-hole; on his head he carries a board full of little images of the saints, carved in wood. \n \n She buys some of the images, while the young man’s eyes drink in all the works of art in the hall. She asks him if he would like to see their collections. Yes, that he would. And she herself goes with him and shows him. \n \n He is so delighted with what he sees that she thinks that he must be a real artist, and she says to herself that she will not forget him. She asks where his home is. He answers: “In Diamante.”—“Is that far away?”—“Four hours in the post-carriage.”—“And with the railway?”—“There is no railway to Diamante, signorina.”—“You must build one.”—“We! we are too poor. Ask the rich men in Catania to build us a railway!” \n \n When he has said that he starts to go, but he turns at the door and comes and gives her his almond-blossoms. It is in gratitude for all the beautiful things she has let him see. \n \n When Donna Micaela opened her eyes she did[187] not know whether she had been dreaming or whether perhaps once some such thing had really happened. Gaetano could really have been some time in the Palazzo Palmeri to sell his images, although she had forgotten it; but now the almond-blossoms had recalled it. \n \n But it was no matter, no matter. The important thing was that the young wood-carver was Gaetano. She felt as if she had been talking to him. She thought she heard the door close behind him. \n \n And it was after that that it occurred to her to build a railway between Catania and Diamante. \n \n Gaetano had surely come to her to ask her to do it. It was a command from him, and she felt that she must obey. \n \n She made no attempt to struggle against it. She was certain that Diamante needed a railway more than anything else. She had once heard Gaetano say that if Diamante only possessed a railway, so that it could easily send away its oranges and its wine and its honey and its almonds, and so that travellers could come there conveniently, it would soon be a rich town. \n \n She was also quite certain that she could succeed with the railway. She must try at all events. It never occurred to her not to. When Gaetano wished it, she must obey. \n \n She began to think how much money she herself could give. It would not go very far. She must get more money. That was the first thing she had to do. \n \n Within the hour she was at Donna Elisa’s, and begged her to help her arrange a bazaar. Donna Elisa lifted her eyes from her embroidery. “Why[188] do you want to arrange a bazaar?”—“I mean to collect money for a railway.”—“That is like you, Donna Micaela; no one else would have thought of such a thing.”—“What, Donna Elisa? What do you mean?”—“Oh, nothing.” \n \n And Donna Elisa went on embroidering. \n \n “You will not help me, then, with my bazaar?”—“No, I will not.”—“And you will not give a little contribution towards it?”—“One who has so lately lost her husband,” answered Donna Elisa, “ought not to trifle.” \n \n Donna Micaela saw that Donna Elisa was angry with her for some reason or other, and that she therefore would not help her. But there must be others who would understand; and it was a beautiful plan, which would save Diamante. \n \n But Donna Micaela wandered in vain from door to door. However much she talked and begged, she gained no partisans. \n \n She tried to explain, she used all her eloquence to persuade. No one was interested in her plans. \n \n Wherever she came, people answered her that they were too poor, too poor. \n \n The syndic’s wife answered no. Her daughters were not allowed to sell at the bazaar. Don Antonio Greco, who had the marionette theatre, would not come with his dolls. The town-band would not play. None of the shop-keepers would give any of their wares. When Donna Micaela was gone they laughed at her. \n \n A railroad, a railroad! She did not know what she was thinking of. There would have to be a company, shares, statutes, concessions. How should a woman manage such things? \n \n [189] \n \n While some were content to laugh at Donna Micaela, some were angry with her. \n \n She went to the cellar-like shop near the old Benedictine monastery, where Master Pamphilio related romances of chivalry. She came to ask him if he would come to her bazaar and entertain the public with Charlemagne and his paladins; but as he was in the midst of a story, she had to sit down on a bench and wait. \n \n Then she noticed Donna Concetta, Master Pamphilio’s wife, who was sitting on the platform at his feet knitting a stocking. As long as Master Pamphilio was speaking, Donna Concetta’s lips moved. She had heard his romances so many times that she knew them by heart, and said the words before they had passed Master Pamphilio’s lips. But it was always the same pleasure to her to hear him, and she wept, and she laughed, as she had done when she heard him for the first time. \n \n Master Pamphilio was an old man, who had spoken much in his day, so that his voice sometimes failed him in the big battle-scenes, when he had to speak loud and fast. But Donna Concetta, who knew it all by heart, never took the word from Master Pamphilio. She only made a sign to the audience to wait until his voice came back. But if his memory failed him, Donna Concetta pretended that she had dropped a stitch, raised the stocking to her eyes, and threw him the word behind it, so that no one noticed it. And every one knew that although Donna Concetta perhaps could have told the romances better than Master Pamphilio, she would never have been willing to do such a thing, not only because it was not fitting for a woman, but also because it[190] would not give her half so much pleasure as to listen to dear Master Pamphilio. \n \n When Donna Micaela saw Donna Concetta, she fell to dreaming. Oh, to sit so on the platform, where her beloved was speaking; to sit so day in and day out and worship. She knew whom that would have suited. \n \n When Master Pamphilio had finished speaking Donna Micaela went forward and asked him to help her. It was hard for him to say no, on account of the thousand prayers that were written in her eyes. But Donna Concetta came to his rescue. “Master Pamphilio,” she said, “tell Donna Micaela of Guglielmo the Wicked.” And Master Pamphilio began. \n \n “Donna Micaela,” he said, “do you know that once there was a king in Sicily whose name was Guglielmo the Wicked? He was so covetous that he took all his subjects’ money. He commanded that every one possessing gold coins should give them to him. And he was so severe and so cruel that they all had to obey him. \n \n “Well, Donna Micaela, Guglielmo the Wicked wished to know if any one had gold hidden in his house. Therefore he sent one of his servants along the Corso in Palermo with a beautiful horse. And the man offered the horse for sale, and cried loudly: ‘Will be sold for a piece of gold; will be sold for a piece of gold!’ But there was no one who could buy the horse. \n \n “Yet it was a very beautiful horse, and a young nobleman, the Duke of Montefiascone, was much taken by him. ‘There is no joy for me if I cannot buy the horse,’ said he to his steward. ‘Signor[191] Duca,’ answered his steward, ‘I can tell you where you can find a piece of gold. When your noble father died and was carried away by the Capucins, according to the ancient custom I put a piece of gold in his mouth. You can take that, signor.’ \n \n “For you must know, Donna Micaela, that in Palermo they do not bury the dead in the ground. They carry them to the monastery of the Capucins, and the monks hang them up in their vaults. Ah, there are so many hanging in those vaults!—so many ladies, dressed in silk and cloth of silver; so many noble gentlemen, with orders on their breasts; and so many priests, with cloak and cap over skeleton and skull. \n \n “The young duke followed his advice. He went to the Capucin monastery, took the piece of gold from his father’s mouth and bought the horse with it. \n \n “But you understand that the king had only sent his servant with the horse in order to find out if any one still had any money. And now the duke was taken before the king. ‘How does it happen that you still have gold pieces?’ said Guglielmo the Wicked.—‘Sire, it was not mine; it was my father’s.’ And he told how he had got the piece of gold. ‘It is true,’ said the king. ‘I had forgotten that the dead still had money.’ And he sent his servants to the Capucins and had them take all the gold pieces out of the mouths of the dead.” \n \n Here old Master Pamphilio finished his story. And now Donna Concetta turned to Donna Micaela with wrathful eyes. “It is you who are out with the horse,” she said. \n \n “Am I? am I?” \n \n [192] \n \n “You, you, Donna Micaela! The government will say: ‘They are building a railway in Diamante. They must be rich.’ And they will increase our taxes. And God knows that we cannot pay the tax with which we are already loaded down, even if we should go and plunder our ancestors.” \n \n Donna Micaela tried to calm her. \n \n “They have sent you out to find out if we still have any money. You are spying for the rich; you are in league with the government. Those bloodsuckers in Rome have paid you.” \n \n Donna Micaela turned away from her. \n \n “I came to talk to you, Master Pamphilio,” she said to the old man. \n \n “But I shall answer you,” replied Donna Concetta; “for this is a disagreeable matter, and such things are my affair. I know what is the duty of the wife of a great man, Donna Micaela.” \n \n Donna Concetta became silent, for the fine lady gave her a look which was so full of jealous longing that it made her sorry for her. Heavens, yes, there had been a difference in their husbands; Don Ferrante and Master Pamphilio! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1787/52028.html","bookId":1081,"book":{"id":1081,"title":"The Miracles of Antichrist","description":"简介： It happened once upon a time that a very great and holy night sank down over the earth. It was the darkest night ever seen by man; it seemed as if the whole earth had passed under a vault. It was impossible to distinguish water from land, or to find...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1787","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
