{"id":91884,"no":56,"title":"Page 56","content":"\\n\\n The screaming only lasted a few minutes. He cut a look at the only other house within sight of this one, but it was four hundred yards away and no extra lights had come one, there were no yells, no inquiring calls. With this many trees around even screams didn’t carry well. Vic knew that from long experience. He took a last drag, then ground out the coal on the heel of his shoe, put the butt in his shirt pocket, and stood up. It was a pretty night.\\n\\n Turning, he reached into the bed and took hold of the corner of the topmost of the stacked body bags, braced his feet against the weight, and pulled. Though the carcass inside was two months dead it still had some weight, so he was careful of his lower back as he pulled it off the truck. He took his time hauling the others down, too, and laid them in a row. One for each of them, stolen from cemeteries around the county. A little bit of selective grave robbing. One here, a couple there, and some caretakers’ palms greased along the way so no police reports ever got filed, no relatives notified. Some quick excavation with a backhoe, and then the empty coffin reburied with all of the sod neatly put back afterward. All told Vic had close to a hundred bags like these, piled like cordwood in a refrigerated storage unit he rented out on Route 202. The manager there has been receiving five large a week in cash since the first week of September, and was an old friend of Vic’s. It wasn’t the first time Vic had used the place to keep something fresh, and he’d swung by there tonight to get what he needed so there would be bones found in the ashes once this place was torched. The proper amount of bones. Residential fire like this, there was little chance of anyone ordering a DNA analysis of the remains. Or, what was the word? Cremains? Yeah, that was it, and Vic liked the word. Cremains.\\n\\n He pulled down the last two—kid-sized bags. Just about the size of Adrian and Darien. The devil was in the details.\\n\\n PART THREE\\n\\n LITTLE HALLOWEEN\\n\\n October 10th to October 13th\\n\\n “There was about him a suggestion of lurking ferocity, as though the Wild still lingered in him and the wolf in him merely slept.”\\n\\n —Jack London, White Fang\\n\\n I went Trick-or-Treating in a suburb once. One lady gave me The Look; One old cuss gave me a hard time; One beautiful girl gave me the cold shoulder, And one son of a bitch gave me the willies.\\n\\n —Indigo Heart, “Monolog on Halloween”\\n\\n Chapter 19\\n\\n (1)\\n\\n In movies it always rains at funerals. The crowds all stand around dressed in black, their umbrellas forming a ceiling above them. Maybe the hero stands hatless in the rain, too tough to need any umbrella. Either way, the skies weep at death and the hiss of rain is like the white noise that will be the only sound at the end of the universe. Crow thought about this as he stood holding hands with Val under a brilliant blue sky in the big field behind the Guthrie house. The sunshine was rich and warm and the shadows cast by the line of towering elms was soft and cool. Birds sang in the trees whose tops were riffled by a gentle easterly breeze. Crow thought that it should rain, that the heavens should indeed weep literally as well as symbolically when someone like Henry Guthrie passes out of the world, but there wasn’t a speck of a cloud in the vast blue sky.\\n\\n In accordance with his wishes, Henry had been cremated. There would be no tombstone, no marker, no specific anchor for his body; his ashes would be spread over the farm and that would create the link he wanted between his soul and the land he had loved so dearly. The ashes currently rested in a large silver urn that stood on a long table draped with white and crowded with flower arrangements sent by friends and family and business associates; scalloped along the edge of the table was the Guthrie family tartan, the greens and reds bright in the sunshine. Around the table were concentric circles of folding chairs and behind the table stood Rev. Donald MacTeague, who had gone to high school with Henry, had performed the wedding service for Henry and his wife, Bess, had baptized Val, and who had presided over the funeral of Roger Guthrie back in 1976, over Henry’s brother George eight years ago, over Bess two years ago, and now over Henry. Mac, as he was called by everyone in town, looked very old to Crow, and he could see that Henry’s death had taken a lot out of him.\\n\\n As Mac slowly went through his homily, Crow surreptitiously looked around at the crowd. Nearly five hundred people had showed up for the service, a hundred of them standing after all the chairs were taken. Beyond the rings of guests there was a second ring of less formally dressed spectators made up of reporters from all over the county. Crow figured that no one beyond the fifth or sixth row could hear a word that Mac was saying, but no one had thought to bring a microphone for him, and when one of the press reps had asked if they could hang a lavaliere mike on him Val had withered him with a look that would have turned a stallion into a gelding.\\n\\n Scanning the crowd though the opaque barrier of his sunglasses, Crow could see that anyone of any importance in town was there, from the selectmen and grower’s commission chair to the owner of the tractor dealership on Harvest Hill Road near the Crescent Bridge. Gus Bernhardt was there, sweating in his ill-fitting uniform, and next to him were the four Philadelphia cops, Ferro, LaMastra, Jerry Head, and Coralita Toombes, who had carpooled out for the occasion. It was the first of three funerals they’d be attending this month, he knew, with burials for Nels Cowan and Jimmy Castle pending the release of their bodies from the morgue. Crow thought it very decent of them to show up here, since none of them had actually known Henry. When Ferro saw Crow looking in his direction he gave a small, curt nod. There were a few other officers present, but they were mostly local blues working security.\\n\\n Mac concluded his remarks and indicated that everyone should sit down. While they were sitting, Crow leaned close to Val and whispered. “You okay, baby?”\\n\\n She just squeezed his hand, keeping her eyes fixed on the urn and her mouth locked in a hard straight line. A soprano from First Methodist stood up and began to sing “Amazing Grace” while a bagpiper played along. When that was done they segued into another hymn that Crow didn’t know. He lost interest in it and went back to checking out the crowd. Near the front, Terry and Sarah Wolfe sat next to Saul Weinstock and his wife, Rachel. At one point Mark, who was only one day home from the hospital and seated in front of them, began to cry quietly, and Terry reached out and massaged his shoulders briefly and then leaned close and said something in his ear. Mark nodded, sniffed, wiped his eyes, and let out a deep breath. When Terry sat back, Crow could see Sarah lean over and kiss his cheek.\\n\\n What held his interest, however, was not this simple kindness, or Mark showing some emotion other than bullish hostility, but the haggard look on Terry’s face and the shell-shocked expression Weinstock wore. If there was a competition for the most demonstrably stressed-out man in Pine Deep, Crow wouldn’t have known who to bet on. Crow could understand Terry’s stress, but why Weinstock looked so battered was an unknown. He tried to catch his friend’s eye, but Weinstock just stared at the soprano with utter rigid indifference.\\n\\n A flash of light caught his eye and he looked past the crowd and the press to the winding path that led past the field and back onto the road. He could see a kid standing there, with one sneakered foot on the gravel of the road and the other on the pedal of his bicycle, a hand raised to shade his eyes from the intense sun glare, light sparking off of the bike’s reflectors. Mike. Good kid, nice of him to show up, even at a distance.\\n\\n The soprano concluded her song and sat down while Mac stood up again, holding his hands wide as he blessed the crowd and then invited everyone to come up and file past the urn to pay their last respects. As soon as the service was concluded, Val turned to Crow and he took her in his arms and held her while she wept. He fumbled for a pack of Kleenex, peeled one out for each of them; she dabbed at her eyes and blew her nose. Crow got to his feet and took Val’s arm, leading her over to where Connie and Mark stood. Crow shook Mark’s hand and kissed Connie, whose eyes were nearly vacant. Crow wondered what pill she had popped before the service, but he was sure that if he knocked nobody would be home.\\n\\n The four of them stood to one side of the table, and Mac came to stand with them as the tide of mourners funneled into a single file and came past, paused briefly before the urn, and then came down the line to say a word to Val or Mark, shake Crow’s hand, and shuffle off. Terry and Sarah were the first ones there, and as Sarah leaned in to hug Val, she said, “Look, honey, the caterers have probably already set up by now, so if you don’t mind I’m going to take over and run things up there. I don’t want you to have to be bothered with nonsense like how many canapés are left. You just stick close to Crow and every else will be taken care of.”\\n\\n “You’re a doll, Sarah. I appreciate it,” Val said, looking greatly relieved, and kissed her.\\n\\n Terry shook Mark’s hand and then Crow’s. “You holding up okay?” he asked.\\n\\n “Yeah,” Crow said, “I’m good. You?”\\n\\n Terry made a ghastly attempt at a lighthearted smile. “Life’s a real peach. See you up at the house.”\\n\\n Saul Weinstock appeared next, smiling a tight and humorless smile that made him look pained. Unlike Terry, Weinstock’s grip was desperately strong and he gave Crow a quick hard pump, then used the grip to lean in close as he said, very quietly, “Let’s find a place later to have a word. Okay?” He moved on before Crow could answer.\\n\\n The rest of the crowd was like a blur of handshakes and careful smiles. When it was over Val looked exhausted, and Crow wrapped his arm around her as they walked slowly up to the house.\\n\\n (2)\\n\\n It was a typical post-funeral affair, with small conversational groups forming, breaking, reforming. Crow wandered through, shaking hands, exchanging bits and pieces of conversation with some of the distant Guthrie relatives and the general Who’s Who of Pine Deep. The Philly cops were clustered together in a corner looking out of place; Crow saw Saul Weinstock come up and lead Ferro away for a private chat. They stood with their heads bowed together for five minutes.\\n\\n While he was watching the crowds a couple of folks asked him for drinks and Crow realized that he had been standing by the small wet bar. Usually he avoided getting within sniffing distance of it, but he mixed and poured and tried not to remember their old familiar tastes. \\n\\n","sourceLink":"https://allnovel.net/dead-man-s-song-pine-deep-2/page-56.html","bookId":2568,"book":{"id":2568,"title":"Dead Man\u0027s Song (Pine Deep #2)","description":"Storyline: Dead Man\u0027s Song (Pine Deep #2) \\n From the powerful imagination of a new horror master comes a bone-chilling tale set in a small town where good and evil are joined in a terrifying, deadly battle... \\n Evil Endures \\n Once an idyllic Pennsylvania village, Pine Deep awoke one morning to find itself bathed in a massive bloodletting. Twice in thirty years the townsfolk have endured the savage hungers of a murderous madman...but if the residents think the death of serial killer Karl Ruger put an end to the carnage, they\u0027re dead wrong. \\n The Nightmare Never Ends \\n Bodies mutilated beyond description, innocents driven to acts of vicious madness. A monstrous evil is preying on the living--and the dead--and turning the quiet little town into hell on earth. Their only hope is to find the source. But the secrets that lurk in the heart of Pine Deep are twisted into its very roots. This time the townspeople aren\u0027t just fighting for their lives, but for their very souls...\\n","cover":"https://allnovel.net/images/dead-man-s-song-pine-deep-2.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/dead-man-s-song-pine-deep-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:51:56 PM"}}
