{"id":83385,"no":28,"title":"Page 28","content":"In a house at the far end of Brazos Street, Daufin listened while Sarge remembered. \"Scooter brought the stick,\" he whispered as the dark things moved in his mind. Over the steady tolling of the Catholic church\u0027s bell, he thought he heard gunshots: the rapid cracks of a carbine, like brittle sticks being trod upon. The memories were coming to life, and one half of his brain itched like a wound that must be torn open and scratched. \"Belgium,\" he said. His hands kneaded the air where Scooter had been, just a minute before. \"Three-ninety-third infantry regiment, Ninety-ninth Infantry Division, Sergeant Tully Dennison, all present and accounted for, sir!\" His eyes were wet, his face strained with internal pressures. \"Diggin\u0027 in, sir! Hard ground, ain\u0027t iti Mighty hard. Froze almost solid. They heard some noise out over the ridge last night. Down there in the deep woods. Recon heard trucks movin\u0027 around. Maybe tanks too. Get that telephone cable laid down, yes sir!\" He blinked, lifting his chin as if startled by the presence of Daufin. \"Who... who are youi\" \"Your new friend,\" she said quietly, standing between the light and the dark. \"Little girl shouldn\u0027t be out here. Too cold. Snow in them clouds. You speak englishi\" \"Yes,\" she said, aware that he was staring right through her, into that hidden dimension. \"Who is Scoot-eri\" \"Old dog just took up with me. Crazy ol\u0027 thing, but Lord can he run. I throw a stick, and he scoots after it. Throw it again, off he goes. Scooter, that\u0027s what he is. Can\u0027t be still. Skinny thing, about half dead when I found him. Gonna take good care of you, Scooter. You and me, we\u0027ll gonna be all right.\" He crossed his arms over his chest and began to rock. \"Put my head on Scooter\u0027s side at night. Good ol\u0027 pillow. Keeps the foxhole warm. Man, he loves to chase those sticks. Run fetch it, Scooter! Lord, can he run!\" Sarge\u0027s breath had quickened. \"Lieutenant says if there\u0027s any action we won\u0027t see it. No way. Says it\u0027ll be to the north or the south. Not our position. I just got here, I ain\u0027t killed nobody yet. I don\u0027t want to. Scooter, we\u0027re gonna keep our heads low. We\u0027re gonna bury our heads in the ground, ain\u0027t wei Just let all that metal fly right over us, huhi\" He shuddered, curled his knees up, stared past Daufin. His mouth worked for a few seconds, his eyes full of violet light, but no sound came out. Then a whisper: \"Incomin\u0027 mail. artillery openin\u0027 up. Long way off. Gonna go over our heads. Over our heads. Should\u0027ve dug my foxhole deeper. Too late now. Incomin\u0027 mail.\" He moaned as if struck, squeezing his eyes shut. Tears crept from them. \"Make it stop. Make it stop. Please oh Jesus make it stop.\" Sarge\u0027s eyes flew open. \"Here they come! Ready on the right, sir!\" It had been a hoarse cry. \"Scooter! Where\u0027s Scooteri God a\u0027mighty, where\u0027s my dogi Here come the Krauts!\" He was shaking now, his body curled up in the chair, the pulse throbbing at his temple like the rhythm of a runaway machine. \"They\u0027re throwin\u0027 potato mashers! Get your heads down! Oh Jesus... oh Christ... help the wounded... his arm\u0027s blown off. Medic... Medic!\" He clasped his hands to his skull, fingers gripping into the flesh. \"Got blood on me. Somebody\u0027s blood. Medic, move your ass! They\u0027re comin\u0027 again! Throwin\u0027 grenades! Get your heads down!\" Sarge stopped his frantic rocking. His breath caught. Daufin waited. \"One fell short,\" he whispered. \"Fell short, and still smokin\u0027. Potato-masher grenade. Got a wooden handle. and there he is. Right there.\" He stared at a point on the wall: the point where the past\u0027s shadows were emerging, ghostly scenes coagulating and rippling through the grenade smoke of more than forty years before. \"There\u0027s Scooter,\" Sarge said. \"Gone crazy. I can see it in his eyes. Gone crazy. Just like me.\" He slowly thrust his hand forward, fingers outspread. \"No,\" the whisper came. \"No. Don\u0027t bring the stick. Don\u0027t...\" a hiss of breath between his teeth: \"I haven\u0027t killed yet... don\u0027t make me kill...\" His hand contorted; now it was clenched around an invisible pistol, the finger gripping the trigger. \"Don\u0027t bring the stick.\" The finger twitched. \"Don\u0027t bring the stick.\" Twitched again. \"Don\u0027t bring the stick.\" a third and fourth times. He was crying, silently, as the finger continued to twitch. \"Had to stop him. Had to. Would\u0027ve fetched me the stick. Dropped it right into my foxhole. But... I killed him... before the grenade went off. I know I did. I saw his eyes go dead. and then the grenade blew. Didn\u0027t make a loud noise. Not loud. and then there was nothin\u0027 left of him... except what was all over me.\" His hand lowered, dangled at his side. \"My head. Hurts.\" Slowly, his hand relaxed, and the invisible gun went away. His eyes had closed again. He sat without moving for a time, just the rise and fall of his chest and the tears that crawled through the lines on his face. There was nothing more. Daufin walked to the front door and looked through the screen at the skygrid. She was trying to put her thoughts together, analyze and categorize what had just been said; she could make no sense of it, but pain and loss lay at its core, and those things she understood very, very well. She sensed a weariness coming over her, enfolding her; it was a weakness of muscles, sinews, and bones - the fabric that held this daughter\u0027s body together. She clicked through her memory and came up with the symbol N and, behind it, among the neatly assembled subjects: Nutrition. This daughter\u0027s body needed nutrition; it was running down and soon would approach collapse. The Sarge creature had mentioned food. She focused on F and found flat images of Food in her memory: Meat Groups, Vegetable Groups, Cereal Groups. all of them appeared sickening, but they would have to do. The next problem was locating these food groups. Surely they must be close at hand, stored somewhere in the Sarge creature\u0027s box. She walked to his side and plucked at his sleeve. He didn\u0027t respond. She tried again, a little harder. His eyes opened. The last firing of the spark plug in his brain was going out; he felt whole again, the cold tingling sensation gone. He thought he remembered having a terrible nightmare, but that was all gone too. \"Food,\" she said. \"Do you have food herei\" \"Yeah. Pork \u0027n beans. In the kitchen.\" He placed his hand against his forehead. He was trembling all over, and in his mouth there was a taste like bitter smoke. \"Get you somethin\u0027 to eat, and then I\u0027ll take you home.\" He tried to stand up, had difficulty at first, then got to his feet. \"Lord, I feel funny. Shakin\u0027 like a wild weed.\" Terror gripped him. Where was Scooteri There was a movement in the corner, behind Mr. Hammond\u0027s little girl. Over where the shadows lay. Scooter padded out of the corner and looked expectantly at him, like old friends do. \"Mighty prancy, aren\u0027t youi\" Sarge asked, and smiled. \"Let\u0027s crack open a can of pork \u0027n beans for our new friend, okayi\" He picked up the oil lamp and headed to the kitchen. Daufin followed behind, thinking that sometimes the hidden dimension was best left unfathomed.","sourceLink":"https://allnovel.net/stinger/page-28.html","bookId":2477,"book":{"id":2477,"title":"Stinger","description":"Storyline: In the remote Texas town of Inferno, a creature of evil beyond anything the world has ever encountered descends. He traps the town and ravages the land with grisly executions and horrible mutations . . . until the people rise up in a final, desperate battle. From the author of Swan Song. Original.","cover":"https://allnovel.net/images/stinger.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/stinger.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:50:34 PM"}}
