{"id":83361,"no":4,"title":"Page 4","content":"\"Christ\u0027s drawers, what a racket!\" the white-haired woman wearing a pink silk sleep mask cried out, sitting up in her canopied bed. The entire house seemed to be vibrating with noise, and she angrily pulled the mask off to reveal eyes the color of arctic ice. \"Tania! Miguel!\" she shouted in a voice made husky by too many unfiltered cigarettes. \"Get in here!\" She reached for the bell cord beside her bed and started yanking it. Down in the depths of the Preston mansion, the bell clamored for the servants\u0027 attention.\n But the horrendous, roaring noise was gone now; it had only lasted a few seconds, but long enough to shock her awake. She threw the covers back, got out of bed, and strode to the balcony doors like a tornado on legs. When she flung them open, the heat almost sucked the breath right out of her lungs. She went out, squinting toward Cobre Road with one hand warding off the glare. She was fifty-three years old, but even without glasses her vision was sharp enough to see what had passed dangerously near the house: three helicopters, racing away toward the southwest and raising a storm of dust beneath them. They vanished behind that dust after a few more seconds, and Celeste Preston was so mad she could\u0027ve spat nails.\n Stout, moon-faced Tania came to the balcony doors. She was braced for the onslaught. \"Si, Seiora Prestoni\" \"Where were youi I thought we were bein\u0027 bombed! What the hell\u0027s goin\u0027 oni\" \"I don\u0027t know, seiora. I think - \" \"Oh, just get me a drink!\" she snapped. \"My nerves are shot!\" Tania retreated into the house for her mistress\u0027s first drink of the day. Celeste stood on the high balcony, its floor a mosaic of red Mexican clay tiles, and grasped the ornate wrought-iron railing. From this vantage point she could see the estate\u0027s stables, the corral, and the riding track - useless, of course, since all the horses had been auctioned off. The blacktopped driveway circled a large bed of what had once been peonies and daisies, now burned brown since the sprinkler system was inoperative. Her lemon-yellow gown was sticking to her back; the sweat and heat rekindled her fury. She returned to the cooler temperature of the bedroom, picked up the pink telephone, and punched the numbers with a manicured fingernail.\n \"Sheriff\u0027s office,\" a drawling voice answered. a boy\u0027s voice. \"Deputy Chaffin speak - \" \"Put Vance on the phone,\" she interrupted.\n \"Uh... Sheriff Vance is on patrol right now. Is this - \" \"Celeste Preston. I want to know who\u0027s flyin\u0027 helicopters over my property at\" - her eye located the clock on the white bedstand - \"at seven-twelve in the mornin\u0027! The bastards almost took my roof off!\" \"Helicoptersi\" \"Clean the wax out of your ear, boy! You heard me! Three helicopters! If they\u0027d been any closer, they could\u0027ve folded my damn sheets! What\u0027s goin\u0027 oni\" \"Uh... I don\u0027t know, Mrs. Preston.\" The deputy\u0027s voice sounded more alert now, and Celeste imagined him sitting at attention behind his desk. \"I can get Sheriff Vance over the radio for you, if you want.\" \"I want. Tell him to get out here pronto.\" She hung up before he could reply. Tania had come in and offered the woman a Bloody Mary on one of the last sterling silver trays. Celeste took it, stirred up the hot peppers with a celery stick, and took most of it down in a couple of swallows. Tania had added more Tabasco than usual today, but Celeste didn\u0027t wince. \"Who do I have to jaw with todayi\" She ran the glass\u0027s frosty rim over her high, lined forehead.\n \"No one. Your schedule\u0027s clear.\" \"Thank God and jingle my spurs! Bunch of damned bloodsuckers gonna let me rest a spell, huhi\" \"You have appointments with Mr. Weitz and Mr. O\u0027Connor on Monday morning,\" Tania reminded her.\n \"That\u0027s Monday. I might be dead by then.\" She finished off her drink and plunked the glass back on the silver tray. The thought of returning to bed entered her mind, but she was too keyed up now. The last six months had been one legal headache after another, not to mention the damage done to her soul. Sometimes she felt like God\u0027s punching bag, and she knew she\u0027d done a lot of down-and-dirty things in her life, but she was paying for her sins in spades.\n \"Is there anything elsei\" Tania asked, her dark eyes steady and impassive.\n \"No, that\u0027s it.\" But Celeste changed her mind before Tania could reach the massive, polished redwood door. \"Wait a minute. Hold on.\" \"Yes, seiorai\" \"I didn\u0027t mean to jump down your throat awhile ago. It\u0027s just... you know, times bein\u0027 what they are.\" \"I understand, seiora.\" \"Good. Listen, anytime you and Miguel want to unlock the bar for yourselves, might as well go ahead.\" She shrugged. \"ain\u0027t no sense lettin\u0027 the liquor go to waste.\" \"I\u0027ll remember that, Mrs. Preston.\" Celeste knew she wouldn\u0027t. Neither Tania nor her husband drank, and anyway somebody had to stay clearheaded around here, if just to keep the human vultures away. Her flinty gaze locked with Tania\u0027s. \"You know, in thirty-four years you\u0027ve always called me either \u0027Mrs. Preston\u0027 or \u0027seiora.\u0027 Haven\u0027t you once wanted to call me \u0027Celeste\u0027i\" Tania hesitated. Shook her head. \"Not once, seiora.\" Celeste laughed; it was the hearty laughter of a woman who was no stranger to the hard life, who once had been proud of the rodeo dirt under her fingernails and knew that winning and losing were two sides of the same coin. \"You\u0027re a card, Tania! I know you\u0027ve never liked me worth a buzzard\u0027s fart, but you\u0027re all right.\" Her smile faded. \"I appreciate your stayin\u0027 on these last few months. You didn\u0027t have to.\" \"Mr. Preston was always very kind to us. We wanted to repay the debt.\" \"You have.\" Her eyes narrowed slightly. \"But tell me one thing, and tell me true: would the first Mrs. Preston have handled this shit mess any betteri\" The other woman\u0027s expression was flat and without emotion. \"No,\" she said finally. \"The first Mrs. Preston was a beautiful, gracious woman - but she didn\u0027t have your courage.\" Celeste grunted. \"Yeah, and she wasn\u0027t crazy, either. That\u0027s why she hightailed it out of this hellhole forty years ago!\" Tania abruptly veered back to familiar ground: \"Will there be anything else, seiorai\" \"Nope. But I\u0027m expectin\u0027 the sheriff pretty soon, so listen up.\" Her back straight and stiff, Tania left the bedroom. Her footsteps clicked away on the oak floor in the long corridor outside.\n Celeste listened, realizing how empty a house without furniture sounded. There were a few pieces left, of course, like the bed and her dressing table and the dining-room table downstairs, but not much. She walked across the room, took a thin black cheroot from a silver filigreed case. The French crystal lighter had already gone to the auction house, so Celeste lit her cigar with a pack of matches that advertised the Bob Wire Club on Highway 67. Then she went out again to the balcony, where she exhaled the pungent smoke and lifted her face toward the brutal sun.\n Going to be another god-awful hot one, she thought. But she\u0027d lived through worse. and would again. all this tangled-up mess with the lawyers, the state of Texas, and the Internal Revenue Service was going to pass like a cloud in a high wind, and then she\u0027d get on with her life.\n \"My life,\" she said, and the lines around her mouth etched deep. She\u0027d come a long way from a bayside shack in Galveston, she mused. Now she was standing on the balcony of a thirty-six-room Spanish-style hacienda on a hundred acres of land - even if the house was without furniture and the land was rocky desert. In the garage was a canary-yellow Cadillac, the last of the six cars. On the mansion\u0027s walls were empty spaces where Miro, Rockwell, and Dali paintings used to hang; those were among the first to be auctioned, along with the French antique furniture and Wint\u0027s collection of almost a thousand stuffed rattlesnakes.\n Her bank account was frozen tighter than an eskimo\u0027s balls, but a regiment of Dallas lawyers was working on the problem and she knew that any day now she\u0027d get a call from that office with the seven names; they\u0027d say, \"Mrs. Prestoni Good news, hon! We\u0027ve tracked down the missing funds, and the IRS has agreed to take their back taxes in monthly payments. You\u0027re out of the woods! Yes, ma\u0027am, old Wint took care of you after all!\" Old Wint, Celeste knew, had been slicker than owl shit. He\u0027d danced around government safety regulations and tax codes, corporate laws and bank presidents like a Texas whirlwind, and the stroke that had kicked him out of this world on the second day of December, at the age of eighty-seven, had left her to pay the band.\n She looked east, toward Inferno and the mine. Over sixty years ago, Winter Thedford Preston had come south from Odessa with a mule called Inferno, searching for gold in the scrub lands. The gold had eluded him, but he\u0027d found a crimson mountain that the Mexicali Indians had told him was made of sacred, healing dust. Wint had a knack for metallurgy - though his formal education had ended at the seventh grade - and his nose had not picked up the scent of sacred dust but of rich copper ore. Wint had started his mining company with a single clapboard shack, fifty or so Mexicans and Indians, a couple of trucks, and a whole lot of shovels. The first day of digging had turned up a dozen skeletons, and it was then that Wint realized the Mexicalis had been burying their dead in the mountain for over a hundred years.\n and then one day a Mexican with a pickax had uncovered a sparkling vein of high-grade ore a hundred feet wide. That was the first of many. The new Texas companies that were stringing telephone wires, electric lines, and water pipes across the state came knocking at Wint\u0027s door. and just beyond the mountain of ore a few tents sprang up, then clapboard and adobe houses, followed by stone structures, churches, and schools. Dirt roads were covered with gravel, then pavement. Celeste recalled that Wint had told her he\u0027d looked over his shoulder one day and seen a town where there used to be tumbleweeds. The townspeople, most of them mine workers, had elected him mayor, and under the influence of tequila Wint had christened the town Inferno and vowed to build a statue of his faithful old mule at its center.\n But, though there\u0027d been plenty of fits and starts, Inferno had never grown much beyond a one-mule town. It was too hot and dusty, too far from the big cities, and when the water pipeline ruptured, people got thirsty in a mighty big hurry. The copper mine had remained the only real industry. But folks kept coming in, the Ice House plugged into the pipeline and froze water into blocks, the church bells rang on Sunday mornings, the shopkeepers made money, the telephone company strung lines and trained operators, the high school lettered the football and basketball teams, and a concrete bridge replaced the shaky wooden one that spanned the Snake River. The first nails were driven into the boards of Bordertown. Walt Travis was elected sheriff, and in his third month was shot dead on the street that was thereafter named for him. The next man stuck with the job until he was beaten within a finger of St. Peter\u0027s handshake and woke up on a northbound train. Gradually, year after year, Inferno sank its roots. But just as gradually, the Preston Copper Mining Company was chewing away the red mountain where the dead Indians of a hundred years slept.\n Celeste Street used to be called Pearl Street, after Wint\u0027s first wife. Between wives, it was known as Nameless Street. Such was the power of Wint Preston\u0027s influence.\n She took one last pull on the cheroot, crushed it out on the railing, and flicked it into space. \"We had some high old times, didn\u0027t wei\" she said softly. But they\u0027d fought like cats and dogs too, ever since Celeste had met him when she was singing with a cowboy band at a little dive in Galveston. Celeste hadn\u0027t minded; she had a holler like a cement mixer and could cuss Satan into church. The truth was that she\u0027d fallen in love with Wint over the years, in spite of his womanizing and drinking and gambling. In spite of the fact that he kept her in the dark about his business affairs for more than thirty years. and when the machines had begun scraping bottom less than three years ago and frantic dynamiting uncovered no new veins, Wint Preston had seen his dream dying. What Celeste realized now was that Wint had gone nutty; he\u0027d started pulling money out of his accounts, selling his stocks and bonds and gathering cash in a maniacal frenzy. But what he\u0027d done with almost eight million dollars remained a mystery. Maybe he\u0027d opened up new accounts under false names; maybe he\u0027d put all that cash into tin boxes and buried them in the desert. In any case, the money of a lifetime was gone, and when the IRS had swooped down demanding a huge chunk of back taxes and penalties, there was nothing to pay with.\n The lawyers had the mess now. Celeste knew full well that she was simply a caretaker, en route back to the dives of Galveston.\n She saw the sheriff\u0027s blue-and-gray patrol car turning off Cobre Road and coming slowly along the blacktop. She gripped the railing with both hands and waited, a tough one-hundred-and-ten-pound figure backed by a hollow three-thousand-ton house. She stood without moving as the car made the driveway\u0027s circle and stopped.\n The car\u0027s door opened, and a man who more than doubled her weight got out in sweat-saving slow motion. The back of his pale blue shirt was drenched, as was the sweatband of his beige cowboy hat. His belly flopped over his jeans, and he wore a gunbelt and lizard-skin boots.\n \"You took your damned time, didn\u0027t youi\" Celeste called sharply. \"If the house had been on fire, I\u0027d be standin\u0027 in ashes right now!\" Sheriff ed Vance stopped, looked up, and found her on the balcony. He was wearing sunglasses with mirrored lenses, just like his favorite bad-ass in the movie Cool Hand Luke. Last night\u0027s dinner of enchiladas and refried beans gurgled in his bulging belly. He showed his teeth in a tight grin. \"If the house had been on fire,\" he said, his drawl as sugary as hot molasses, \"I hope you would\u0027ve had the good sense to call the fire department, Miz Preston.\" She said nothing, just stared holes through him. \"Deputy Chaffin gave me a call,\" he continued. \"Said you was gettin\u0027 buzzed by helicopters.\" He made a big show of inspecting the cloudless sky. \"Nary a one around here.\" \"There were three. They flew over my property, and I\u0027ve never heard such a noise in all my life. I want to know where they came from and what\u0027s goin\u0027 on.\" He shrugged his thick shoulders. \"Don\u0027t seem like much is goin\u0027 on anywhere, if you ask me. Seems like a pretty peaceful day.\" His grin widened; now it was more of a grimace. \"Up till now, that is.\" \"They went that way.\" Celeste pointed toward the southwest.\n \"Well, maybe if I hurry I can head \u0027em off at the pass. Just what is it you expect me to do, Miz Prestoni\" \"I expect you to earn your pay, Sheriff Vance!\" she replied coldly. \"That means bein\u0027 on top of what goes on around here! I\u0027m tellin\u0027 you that three helicopters almost knocked me out of my bed, and I want to know who they belonged to! Does that spell it out any clearer for youi\" \"a mite.\" The grimace remained locked on his square, heavily jowled face. \"\u0027Course, they\u0027re probably in Mexico by now.\" \"I don\u0027t care if they\u0027re in Timbuktu! Those damned things could\u0027ve crashed into my house!\" Vance\u0027s obstinacy and slowness infuriated her; if it had been her decision, Vance would never have been reelected sheriff, but he\u0027d ingratiated himself to Wint over the years and had easily beaten the Hispanic candidate. She saw clear through him, though, and knew that Mack Cade pulled his strings; and, like it or not, she realized Mack Cade was now Inferno\u0027s ruling power.\n \"Better calm down. Take a nerve pill. That\u0027s what my ex-wife used to do when - \" \"She saw youi\" Celeste interrupted.\n He laughed, hollowly and without mirth. \"No call to get nasty, Miz Preston. Don\u0027t suit a lady like you.\" Showed your true stripe, didn\u0027t you, bitchi he thought. \"So what is it you\u0027re sayin\u0027i\" he prodded. \"You want to file a disturbin\u0027 the peace charge against some unknown persons in three helicopters, point of origin unknown and destination unknowni\" \"That\u0027s right. Is it too much of a job for youi\" Vance grunted. He couldn\u0027t wait for the woman to be tossed out on her ass; then he was going to start digging up those cashboxes old Wint must\u0027ve hidden. \"I think I can handle it.\" \"I hope you can. That\u0027s what you\u0027re paid for.\" Lady, he thought, it sure ain\u0027t you who writes my ticket! \"Miz Preston,\" he said quietly, as if speaking to a retarded child, \"you\u0027d best get on inside now, out of this hot sun. You don\u0027t want your brain gettin\u0027 baked. Wouldn\u0027t want you to have a stroke now, would wei\" He gave her his best, most innocent smile.\n \"Just do it!\" she snapped, and then she turned away from the railing and stalked back into the house.\n \"Yes, ma\u0027am!\" Vance gave a mock salute and got behind the wheel again, his wet shirt immediately leeching to the seat. He started the engine and drove away from the hacienda, back to Cobre Road. The knuckles of his large, hairy hands were white on the steering wheel. He turned left, toward Inferno, and as he picked up speed he shouted out the open window, \"I ain\u0027t your goddamned monkey!\" \n","sourceLink":"https://allnovel.net/stinger/page-4.html","bookId":2477,"book":{"id":2477,"title":"Stinger","description":"Storyline: \n In the remote Texas town of Inferno, a creature of evil beyond anything the world has ever encountered descends. He traps the town and ravages the land with grisly executions and horrible mutations . . . until the people rise up in a final, desperate battle. From the author of Swan Song. Original.\n \n","cover":"https://allnovel.net/images/stinger.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/stinger.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:50:34 PM"}}
