{"id":78997,"no":12,"title":"Page 12","content":"Sam thought the snake was the coolest thing he\u0027d ever seen. He wasn\u0027t at all scared and didn\u0027t hesitate to wrap her around his neck like a scarf. He asked a bunch of questions: How long was she, what did she eat, how often did she shed her skin, where was she from, how fast could she move?\\n\\n Evra answered all of Sam\u0027s questions. He was a snake expert. There wasn\u0027t a thing he didn\u0027t know about the serpent kingdom. He was even able to tell Sam roughly how many scales the snake had!\\n\\n We gave Sam a guided tour of the campsite after that. We took him to see the wolf-man (Sam was pretty quiet outside of the hairy wolf-man\u0027s van, totally frightened by the snarling creature inside). We introduced him to Hans Hands. Then we ran into Rhamus Twobellies practicing his act. Evra asked if we could watch, and Rhamus let us. Sam\u0027s eyes almost popped out of his head when he saw Rhamus chew a glass into tiny pieces, swallow it, piece it back together inside his belly, and bring it up his throat and out his mouth.\\n\\n I was going to grab Madam Octa and show Sam some of the tricks I could do with her, but I didn\u0027t feel too great. The lack of human blood in my diet was getting to me; my stomach grumbled a lot, no matter how much food I ate, and I sometimes got sick or had to sit down suddenly. I didn\u0027t want to faint or get sick with the tarantula out of her cage; I knew from experience how deadly she could be if you lost control of her for even a couple of seconds.\\n\\n Sam would have stayed forever, but it was getting dark and I knew Mr. Crepsley would be waking soon. Evra and me had jobs to do, so we told him it was time he went home.\\n\\n \"Can\u0027t I stay a little longer?\"he pleaded.\\n\\n \"Your mother\u0027s probably looking for you for dinner,\"Evra said.\\n\\n \"I can eat with you guys,\"Sam said.\\n\\n \"There isn\u0027t enough food,\"I lied.\\n\\n \"Well, I\u0027m not very hungry, anyway,\"Sam said. \"I already ate most of my pickled onions.\"\\n\\n \"Maybe he could stay,\"Evra said. I stared at him, surprised, but he winked to show he was only pretending.\\n\\n \"Could I?\"Sam asked, psyched.\\n\\n \"Sure,\"Evra said. \"But you\u0027ll have to help us with our jobs.\"\\n\\n \"I\u0027ll do anything,\"Sam said. \"I don\u0027t mind. What is it?\"\\n\\n \"The wolf-man needs to be fed, washed, and brushed,\"Evra said.\\n\\n Sam\u0027s smile went away.\\n\\n \"The wuh-wolf-muh-man?\"he asked nervously.\\n\\n \"It\u0027s no problem,\"Evra told him. \"He\u0027s pretty quiet once he\u0027s been fed. He hardly ever bites his helpers. If he does attack, keep your head away from his mouth and stick an arm down his throat. It\u0027s better to lose an arm than your -\"\\n\\n \"You know,\"Sam said quickly, \"I think I do have to go home. My mother said something about friends coming over tonight.\"\\n\\n \"Oh. That\u0027s a pity.\"Evra grinned.\\n\\n Sam backed away, gazing in the direction of the wolf-man\u0027s cage. He looked sad to be going, so I told him to stop.\\n\\n \"What are you doing tomorrow?\"I asked.\\n\\n \"Nothing,\"he said.\\n\\n \"Do you want to come over in the afternoon and hang out with us?\"\\n\\n \"Yeah!\"Sam said right back, then paused. \"I won\u0027t have to help feed and clean the...?\"He gulped loudly.\\n\\n \"No,\"Evra said, still smiling.\\n\\n \"Then I\u0027ll be here. See you tomorrow, guys.\"\\n\\n \"See you, Sam,\"we said together.\\n\\n He waved, turned, and left.\\n\\n \"Sam\u0027s cool, isn\u0027t he?\"I said to Evra.\\n\\n \"He\u0027s a good guy,\"Evra agreed. \"He could lose the whole sounding smart thing, and he\u0027s kind of a scaredy-cat, but otherwise he\u0027s cool.\"\\n\\n \"Do you think he\u0027d fit in if he did join the show?\"I asked.\\n\\n Evra snorted sarcastically. \"Like a mouse in a house full of cats!\"\\n\\n \"What do you mean?\"I asked.\\n\\n \"This life isn\u0027t for everyone. A few weeks away from his family, having to clean toilets and cook for thirty or forty people... He\u0027d be running for the hills.\"\\n\\n \"We do all right,\"I said.\\n\\n \"We\u0027re different,\"Evra said. \"We\u0027re not like other people. This is what we\u0027re cut out for. Everybody has a place where they belong. This is ours. We\u0027re meant to...\"\\n\\n He stopped and began to frown. He was looking over my head at something in the distance. I turned to see what was bothering him. For a few seconds I couldn\u0027t make out anything, but then, somewhere far off, coming through the trees to the east, I saw the flickering light of a burning torch.\\n\\n \"What is that?\"I asked.\\n\\n \"I\u0027m not sure,\"Evra said.\\n\\n We watched for a few minutes as the torch came closer. I saw figures moving beneath the branches of the trees. I couldn\u0027t tell how many there were, but it had to be at least six or seven. Then, as they came out from under the trees, I saw who they were, and goose-bumps sprang to life all over my neck and arms.\\n\\n They were the small, blue-hooded people that Steve and I had seen the night of the show, the ones who helped sell sweets and toys to the crowd and assisted with the acts. I\u0027d forgotten about those strange blue-hooded helpers. It had been a few months since that night, and I\u0027d had so many other things on my mind.\\n\\n They came out of the woods in pairs, one set after the other. I counted twelve in all, though there was a thirteenth member, a taller person walking behind the rest. He was the one carrying the torch.\\n\\n \"Where did they come from?\"I asked Evra quietly.\\n\\n \"I don\u0027t know,\"he answered. \"They left the show a few weeks ago. I have no idea where they went. They kept to themselves mostly.\"\\n\\n \"Who are they?\"I asked.\\n\\n \"They\u0027re -,\"he began to answer, but stopped all of a sudden. His eyes widened with fear.\\n\\n It was the man bringing up the rear, the thirteenth, taller member of the group - visible now that he was closer - who scared Evra.\\n\\n The blue-hooded people passed by silently. As the mysterious thirteenth person approached, I noticed he was dressed differently from the others. He wasn\u0027t very tall; he just looked big in comparison to the blue-hoods. He had short white hair, a thick pair of glasses, a sharp yellow suit, and long green rubber boots. He was pretty fat and walked with a weird waddle.\\n\\n He smiled pleasantly at us as he passed. I smiled back, but Evra looked paralyzed, unable to move the muscles in his mouth.\\n\\n The blue-hoods and the man with the torch walked farther into the campsite, all the way to the back, where they found a large clear spot. Then the blue-hoods began putting up a tent - they must have been carrying the equipment underneath their capes - while the larger man headed for Mr. Tall\u0027s van.\\n\\n I studied Evra. He was shaking all over, and even though his face could never turn white - because of its natural color - it was paler than it had ever been before.\\n\\n \"What\u0027s wrong?\"I asked.\\n\\n He shook his head silently, unable to reply.\\n\\n \"What is it? Why are you so scared? Who was that man?\"\\n\\n \"He... It...\"Evra cleared his throat and took a deep breath. When he spoke, it was in a low, trembling voice, filled with sheer terror.\\n\\n \"That was Mr. Tiny ,\"he said, and I couldn\u0027t get any more out of him for a long time after that. \\n\\n","sourceLink":"https://allnovel.net/the-vampire-s-assistant-the-saga-of-darren-shan-2/page-12.html","bookId":2438,"book":{"id":2438,"title":"The Vampire\u0027s Assistant (The Saga of Darren Shan #2)","description":"Storyline: The Saga of Darren Shan #2 : The Vampire\u0027s Assistant \\n The story begins with the main protagonist of the last adventure, Darren Shan, and his guardian Larten Crepsley moving in for a drink of blood from an ex-scout. Darren is beginning to cope with life as a vampire\u0027s assistant though he still refuses to drink human blood and hates his companion, Mr. Crepsley, for turning him into a half vampire which has led him to faking his own death. Although he is far stronger than any human, and a shotput world champion, as he discovers, he is still finding it hard to adjust to his new life. His unchallenged strength causes him to be alone, as he can not make any human friends without breaking their hands. Larten teaches Darren all about vampirism and sometimes is shown regreting for blooding Darren and decides to take him to the Cirque du Freak.\\n","cover":"https://allnovel.net/images/the-vampire-s-assistant-the-saga-of-darren-shan-2.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vampire-s-assistant-the-saga-of-darren-shan-2.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:11:49 PM"}}
