{"id":70077,"no":9,"title":"Page 9","content":"The spaceship leaked, as the saying goes, like a sieve. It was supposed to. In fact, that was the whole idea. The result, of course, was that during the journey from Ganymede to Jupiter, the ship was crammed just as full as it could be with the very hardest space vacuum. And since the ship also lacked heating devices, this space vacuum was at normal temperature, which is a fraction of a degree above absolute zero.\\n\\n This, also, was according to plan. Little things like the absence of heat and air didn\u0027t annoy anyone at all on the particular spaceship.\\n\\n The first near vacuum wisps of Jovian atmosphere began percolating into the ship several thousand miles above the Jovian surface. It was practically all hydrogen, though perhaps a careful gas analysis might have located a trace of helium as well. The pressure gauges began creeping skyward.\\n\\n That creep continued at an accelerating pace as the ship dropped downward in a Jupiter-circling spiral. The pointers of successive gauges, each designed for progressively higher pressures, began to move until they reached the neighborhood of a million or so atmospheres, where figures lost most of their meaning. The temperature, as recorded by thermocouples, rose slowly and erratically, and finally steadied at about seventy below zero, Centigrade.\\n\\n The ship moved slowly toward the end, plowing its way heavily through a maze of gas molecules that crowded together so closely that hydrogen itself was squeezed to the density of a liquid. Ammonia vapor, drawn from the incredibly vast oceans of that liquid, saturated the horrible atmosphere. The wind, which had begun a thousand miles higher, had risen to a pitch inadequately described as a hurricane.\\n\\n It was quite plain long before the ship landed on a fairly large Jovian island, perhaps seven times the size of Asia, that Jupiter was not a very pleasant world.\\n\\n And yet the three members of the crew thought it was. They were quite convinced it was. But then, the three members of the crew were not exactly human. And neither were they exactly Jovian.\\n\\n They were simply robots, designed on Earth for Jupiter. ZZ Three said, \"It appears to be a rather desolate place.\" ZZ Two joined him and regarded the wind-blasted landscape somberly. \"There are structures of some sort in the distance,\" he said, \"which are obviously artificial. I suggest we wait for the inhabitants to come to us.\"\\n\\n Across the room ZZ One listened, but made no reply. He was the first constructed of the three, and half experimental. Consequently he spoke a little less frequently than his two companions.\\n\\n The wait was not long. An air vessel of queer design swooped overhead. More followed. And then a line of ground vehicles approached, took position, and disgorged organisms. Along with these organisms came various inanimate accessories that might have been weapons. Some of these were borne by a single Jovian, some by several, and some advanced under their own power, with Jovians perhaps inside.\\n\\n The robots couldn\u0027t tell. ZZ Three said, \"They\u0027re all around us now. The logical peaceful gesture would be to come out in the open. Agreed?\"\\n\\n It was, and ZZ One shoved open the heavy door, which was not double or, for that matter, particularly airtight.\\n\\n Their appearance through the door was the signal for an excited stir among the surrounding Jovians. Things were done to several of the very largest of the inanimate accessories, and ZZ Three became aware of a temperature rise on the outer rind of his beryllium-iridium-bronze body.\\n\\n He glanced at ZZ Two. \"Do you feel it? They\u0027re aiming heat energy at us, I believe.\"\\n\\n ZZ Two indicated his surprise. \"I wonder why?\"\\n\\n \"Definitely a heat ray of some sort. Look at that!\" One of the rays had been jarred out of alignment for some undiscernible cause, and its line of radiation intersected a brook of sparkling pure ammonia- which promptly boiled furiously.\\n\\n Three turned to ZZ One, \"Make a note of this, One, will you?\"\\n\\n \"Sure.\" It was to ZZ One that the routine secretarial work fell, and his method of taking a note was to make a mental addition to the accurate memory scroll within him. He had already gathered the hour-by-hour record of every important instrument on board ship during the trip to Jupiter. He added agreeably, \"What reason shall I put for the reaction? The human masters would probably enjoy knowing.\"\\n\\n \"No reason. Or better,\" Three corrected himself, \"no apparent reason. You might say the maximum temperature of the ray was about plus thirty, Centigrade.\"\\n\\n Two interrupted, \"Shall we try communicating?\"\\n\\n \"It would be a waste of time,\" said Three. \"There can\u0027t be more than a very few Jovians who know the radio-click code that\u0027s been developed between Jupiter and Ganymede. They\u0027ll have to send for one, and when he comes, he\u0027ll establish contact soon enough. Meanwhile let\u0027s watch them. I don\u0027t understand their actions, I tell you frankly.\"\\n\\n Nor did understanding come immediately. Heat radiation ceased, and other instruments were brought to the forefront and put into play. Several capsules fell at the feet of the watching robots, dropping rapidly and forcefully under Jupiter\u0027s gravity. They popped open and a blue liquid exuded, forming pools which proceeded to shrink rapidly by evaporation.\\n\\n The nightmare wind whipped the vapors away and where those vapors went, Jovians scrambled out of the way. One was too slow, threshed about wildly, and became very limp and still.\\n\\n ZZ Two bent, dabbed a finger in one of the pools and stared at the dripping liquid. \"I think this is oxygen,\" he said.\\n\\n \"Oxygen, all right,\" agreed Three. \"This becomes stranger and stranger. It must certainly be a dangerous practice, for I would say that oxygen is poisonous to the creatures. One of them died!\"\\n\\n There was a pause, and then ZZ One, whose greater simplicity led at times to an increased directness of thought, said heavily, \"It might be that these strange creatures in a rather childish way are attempting to destroy us.\"\\n\\n And Two, struck by the suggestion, answered, \"You know, One, I think you\u0027re right!\"\\n\\n There had been a slight lull in Jovian activity and now a new structure was brought up. It possessed a slender rod that pointed skyward through the impenetrable Jovian murk. It stood in that starkly incredible wind with a rigidity that plainly indicated remarkable structural strength. From its tip came a cracking and then a Bash that lit up the depths of the atmosphere into a gray fog.\\n\\n For a moment the robots were bathed in clinging radiance and then Three said thoughtfully, \"High-tension electricity! Quite respectable power, too. One, I think you\u0027re right. After all, the human masters have told us that these creatures seek to destroy all humanity, and organisms possessing such insane viciousness as to harbor a thought of harm against a human being\"-his voice trembled at the thought-\"would scarcely scruple at attempting to destroy us.\"\\n\\n \"It\u0027s a shame to have such distorted minds,\" said ZZ One. \"Poor fellows!\"\\n\\n \"I find it a very saddening thought,\" admitted Two. \"Let\u0027s go back to the ship. We\u0027ve seen enough for now.\"\\n\\n They did so, and settled down to wait. As ZZ Three said, Jupiter was a roomy planet, and it might take time for Jovian transportation to bring a radio code expert to the ship. However, patience is a cheap commodity to robots.\\n\\n As a matter of fact, Jupiter turned on its axis three times, according to chronometer, before the expert arrived. The rising and setting of the sun made no difference, of course, to the dead darkness at the bottom of three thousand miles of liquid-dense gas, so that one could not speak of day and night. But then, neither Jovian nor robot saw by visible light radiation and that didn\u0027t matter.\\n\\n Through this thirty-hour interval the surrounding Jovians continued their attack with a patience and persevering relentlessness concerning which robot ZZ One made a good many mental notes. The ship was assaulted by as many varieties of forces as there were hours, and the robots observed every attack attentively, analyzing such weapons as they recognized. They by no means recognized all.\\n\\n But the human masters had built well. It had taken fifteen years to construct the ship and the robots, and their essentials could be expressed in a single phrase- raw strength. The attack spent itself uselessly and neither ship nor robot seemed the worse for it.\\n\\n Three said, \"This atmosphere handicaps them, I think. They can\u0027t use atomic disruptors, since they would only tear a hole in that soupy air and blow themselves up.\"\\n\\n \"They haven\u0027t used high explosives either,\" said Two, \"which is well. They couldn\u0027t have hurt us, naturally, but it would have thrown us about a bit.\"\\n\\n \"High explosives are out of the question. You can\u0027t have an explosive without gas expansion and gas just can\u0027t expand in this atmosphere.\"\\n\\n \"It\u0027s a very good atmosphere,\" muttered One. \"I like it.\"\\n\\n Which was natural, because he was built for it. The ZZ robots were the first robots ever turned out by the United States Robots and Mechanical Men Corporation that were not even faintly human in appearance. They were low and squat, with a center of gravity less than a foot above ground level. They had six legs apiece, stumpy and thick, designed to lift tons against two and a half times normal Earth gravity. Their reflexes were that many times Earth-normal speed, to make up for the gravity. And they were composed of a berylliam-iridium-bronze alloy that was proof against any known corrosive agent, also any known destructive agent short of a thousand-megaton atomic disruptor, under any conditions whatsoever.\\n\\n To dispense with further description, they were indestructible, and so impressively powerful that they were the only robots ever built on whom the roboticists of the corporation had never quite had the nerve to pin a serial-number nickname. One bright young fellow had suggested Sissy One, Two, and Three-but not in a very loud voice, and the suggestion was never repeated.\\n\\n The last hours of the wait were spent in a puzzled discussion to find a possible description of a Jovian\u0027s appearance. ZZ One had made a note of their possession of tentacles and of their radial symmetry-and there he had struck. Two and Three did their best, but couldn\u0027t help.\\n\\n \"You can\u0027t very well describe anything,\" Three declared finally, \"without a standard of reference. These creatures are like nothing I know of-completely outside the postitronic paths of my brain. It\u0027s like trying to describe gamma light to a robot unequipped for gamma-ray reception.\"\\n\\n It was just at that time that the weapon barrage ceased once more. The robots turned their attention to outside the ship.\\n\\n A group of Jovians were advancing in curiously uneven fashion, but no amount of careful watching could determine the exact method of their locomotion. How they used their tentacles was uncertain. At times the organisms took on a remarkable slithering motion, and then they moved at great speed, perhaps with the wind\u0027s help, for they were moving downwind.\\n\\n The robots stepped out to meet the Jovians, who halted ten feet away. Both sides remained silent and motionless.\\n\\n ZZ Two said, \"They must be watching us, but I don\u0027t know how. Do either of you see any photosensitive organs?\"\\n\\n \"I can\u0027t say,\" grunted Three in response. \"I don\u0027t see anything about them that makes sense at all.\"\\n\\n There was a sudden metallic clicking from among the Jovian group and ZZ One said delightedly, \"It\u0027s the radio code. They\u0027ve got the communications expert here.\"\\n\\n It was, and they had. The complicated dot-dash system that over a period of twenty-five years had been laboriously developed by the beings of Jupiter and the Earthmen of Ganymede into a remarkably flexible means of communication was finally being put into practice at close range.\\n\\n One Jovian remained in the forefront now, the others having fallen back. It was he that was speaking. The clicking said, \"Where are you from?\"\\n\\n ZZ Three, as the most mentally advanced, naturally assumed spokesmanship for the robot group. \"We are from Jupiter\u0027s satellite, Ganymede.\"\\n\\n The Jovian continued, \"What do you want?\"\\n\\n \"Information. We have come to study your world and to bring back our findings. If we could have your cooperation-\"\\n\\n The Jovian clicking interrupted. \"You must be destroyed!\"\\n\\n ZZ Three paused and said in a thoughtful aside to his two companions, \"Exactly the attitude the human masters said they would take. They are very unusual.\"\\n\\n Returning to his clicking, he asked simply, \"Why?\"\\n\\n The Jovian evidently considered certain questions too obnoxious to be answered. He said, \"If you leave within a single period of revolution, we will spare you- until such time as we emerge from our world to destroy the un-Jovian vermin of Ganymede.\"\\n\\n \"I would like to point out,\" said Three, \"that we of Ganymede and the inner planets-\"\\n\\n The Jovian interrupted, \"Our astronomy knows of the Sun and of our four satellites. There are no inner planets.\"\\n\\n Three conceded the point wearily, \"We of Ganymede, then. We have no designs on Jupiter. We\u0027re prepared to offer friendship. For twenty-five years your people communicated freely with the human beings of Ganymede. Is there any reason to make sudden war upon the humans?\"\\n\\n \"For twenty-five years,\" was the cold response, \"we assumed the inhabitants of Ganymede to be Jovians. When we found out they were not, and that we had been treating lower animals on the scale of Jovian intelligences, we were bound to take steps to wipe out the dishonor.\"\\n\\n Slowly and forcefully he finished, \"We of Jupiter will suffer the existence of no vermin!\"\\n\\n The Jovian was backing away in some fashion, tacking against the wind, and the interview was evidently over.\\n\\n The robots retreated inside the ship.\\n\\n ZZ Two said, \"It looks bad, doesn\u0027t it?\" He continued thoughtfully, \"It is as the human masters said. They possess an ultimately developed superiority complex, combined with an extreme intolerance for anyone or anything that disturbs that complex.\"\\n\\n \"The intolerance,\" observed Three, \"is the natural consequence of the complex. The trouble is that their intolerance has teeth in it. They have weapons- and their science is great.\"\\n\\n \"I am not surprised now,\" burst out ZZ One, \"that we were specifically instructed to disregard Jovian orders. They are horrible, intolerant, pseudo-superior beings!\" He added emphatically, with robotical loyalty and faith, \"No human master could ever be like that.\"\\n\\n \"That, though true, is beside the point,\" said Three. \"The fact remains that the human masters are in terrible danger. This is a gigantic world and these Jovians are greater in numbers and resources by a hundred times or more than the humans of the entire Terrestrial Empire. If they can ever develop the force field to the point where they can use it as a spaceship hull- as the human masters have already done- they will overrun the system at will. The question remains as to how far they have advanced in that direction, what other weapons they have, what preparations they are making, and so on. To return with that information is our function, of course, and we had better decide on our next step.\"\\n\\n \"It may be difficult,\" said Two. \"The Jovians won\u0027t help us.\" Which, at the moment, was rather an understatement.\\n\\n Three thought awhile. \"It seems to me that we need only wait,\" he observed. \"They have tried to destroy us for thirty hours now and haven\u0027t succeeded. Certainly they have done their best. Now a superiority complex always involves the eternal necessity of saving face, and the ultimatum given us proves it in this case. They would never allow us to leave if they could destroy us. But if we don\u0027t leave, then rather than admit they cannot force us away, they will surely pretend that they are willing, for their own purposes, to have us stay.\"\\n\\n Once again they waited. The day passed. The weapon barrage did not resume. The robots did not leave. The bluff was called. And now the robots faced the Jovian radio-code expert once again.\\n\\n If the ZZ models had been equipped with a sense of humor, they would have enjoyed themselves immensely. As it was, they felt merely a solemn sense of satisfaction.\\n\\n The Jovian said, \"It has been our decision that you will be allowed to remain for a very short time, so that you see our power for yourself. You shall then return to Ganymede to inform your companion vermin of the disastrous end to which they will unfailingly come within a solar revolution.\"\\n\\n ZZ One made a mental note that a Jovian revolution took twelve earthly years.\\n\\n Three replied casually, \"Thank you. May we accompany you to the nearest town? There are many things we would like to learn.\" He added as an afterthought, \"Our ship is not to be touched, of course.\"\\n\\n He said this as a request, not as a threat, for no ZZ model was ever pugnacious. All capacity for even the slightest annoyance had been carefully barred in their construction. With robots as vastly powerful as the ZZ\u0027s, unfailing good temper was essential for safety during the years of testing on Earth.\\n\\n The Jovian said, \"We are not interested in your verminous ship. No Jovian will pollute himself by approaching it. You may accompany us, but you must on no account approach closer than ten feet to any Jovian, or you will be instantly destroyed.\"\\n\\n \"Stuck up, aren\u0027t they?\" observed Two in a genial whisper, as they plowed into the wind.\\n\\n The town was a port on the shores of an incredible ammonia lake. The external wind whipped furious, frothy waves that shot across the liquid surface at the hectic rate enforced by the gravity. The port itself was neither large nor impressive and it seemed fairly evident that most of the construction was underground.\\n\\n \"What is the population of this place?\" asked Three.\\n\\n The Jovian replied, \"It is a small town of ten million.\"\\n\\n \"I see. Make a note of that, One.\"\\n\\n ZZ One did so mechanically, and then turned once more to the lake, at which he had been staring in fascination. He pulled at Three\u0027s elbow. \"Say, do you suppose they have fish here?\"\\n\\n \"What difference does it make?\"\\n\\n \"I think we ought to know. The human masters ordered us to find out everything we could.\" Of the robots, One was the simplest and, consequently, the one who took orders in the most literal fashion.\\n\\n Two said, \"Let One go and look if he likes. It won\u0027t do any harm if we let the kid have his fun.\"\\n\\n \"All right. There\u0027s no real objection if he doesn\u0027t waste his time. Fish aren\u0027t what we came for-but go ahead, One.\"\\n\\n ZZ One made off in great excitement and slogged rapidly down the beach, plunging into the ammonia with a splash. The Jovians watched attentively. They had understood none of the previous conversation, of course.\\n\\n The radio code expert clicked out, \"It is apparent that your companion has decided to abandon life in despair at our greatness.\"\\n\\n Three said in surprise, \"Nothing of the sort. He wants to investigate the living organisms, if any, that live in the ammonia.\" He added apologetically, \"Our friend is very curious at times, and he isn\u0027t quite as bright as we are, though that is only his misfortune. We understand that and try to humor him whenever we can.\"\\n\\n There was a long pause, and the Jovian observed, \"He will drown.\"\\n\\n Three replied casually, \"No danger of that. We don\u0027t drown. May we enter the town as soon as he returns?\"\\n\\n At that moment there was a spurt of liquid several hundred feet out in the lake. It sprayed upward wildly and then hurtled down in a wind-driven mist. Another spurt and another, then a wild white foaming that formed a trail toward shore, gradually quieting as it approached.\\n\\n The two robots watched this in amazement, and the utter lack of motion on the part of the Jovians indicated that they were watching as well.\\n\\n Then the head of ZZ One broke the surface and he made his slow way out on to dry land. But something followed him! Some organism of gigantic size that seemed nothing but fangs, claws, and spines. Then they saw that it wasn\u0027t following him under its own power, but was being dragged across the beach by ZZ One. There was a significant flabbiness about it.\\n\\n ZZ One approached rather timidly and took communication into his own hands. He tapped out a message to the Jovian in agitated fashion. \"I am very sorry this happened, but the thing attacked me. I was merely taking notes on it. It is not a valuable creature, I hope.\"\\n\\n He was not answered immediately, for at the first appearance of the monster there had been a wild break in the Jovian ranks. These reformed slowly, and cautious observation having proven the creator to be indeed dead, order was restored. Some of the bolder were curiously prodding the body.\\n\\n ZZ Three said humbly, \"I hope you will pardon our friend. He is sometimes clumsy. We have absolutely no intention of harming any Jovian creature.\"\\n\\n \"He attacked me,\" explained One. \"He bit at me without provocation. See!\" And he displayed a two-foot fang that ended in a jagged break. \"He broke it on my shoulder and almost left a scratch. I just slapped it a bit to send it away- and it died. I\u0027m sorry!\"\\n\\n The Jovian finally spoke, and his code clicking was a rather stuttery affair. \"It is a wild creature, rarely found so close to shore, but the lake is deep just here.\"\\n\\n Three said, still anxiously, \"If you can use it for food, we are only too glad-\"\\n\\n \"No. We can get food for ourselves without the help of verm-without the help of others. Eat it yourselves.\"\\n\\n At that ZZ One heaved the creature up and back into the sea, with an easy motion of one arm. Three said casually, \"Thank you for your kind offer, but we have no use for food. We don\u0027t eat, of course.\"\\n\\n Escorted by two hundred or so armed Jovians, the robots passed down a series of ramps into the underground city. If, above the surface, the city had looked small and unimpressive, then from beneath it took on the appearance of a vast megalopolis.\\n\\n They were ushered into ground cars that were operated by remote control-for no honest, self-respecting Jovian would risk his superiority by placing himself in the same car with vermin-and driven at frightful speed to the center of the town. They saw enough to decide that it extended fifty miles from end to end and reached downward into Jupiter\u0027s crust at least eight miles.\\n\\n ZZ Two did not sound happy as he said, \"If this is a sample of Jovian development then we shall not have a hopeful report to bring back to the human masters. After all, we landed on the vast surface of Jupiter at random, with the chances a thousand to one against coming near any really concentrated center of population. This must be, as the code expert says, a mere town.\"\\n\\n \"Ten million Jovians,\" said Three abstractedly. \"Total population must be in the trillions, which is high, very high, even for Jupiter. They probably have a completely urban civilization, which means that their scientific development must be tremendous. If they have force fields-\"\\n\\n Three had no neck, for in the interest of strength the heads of the ZZ models were riveted firmly onto the torso, with the delicate positronic brains protected by three separate layers in inch-thick iridium alloy. But if he had had one, he would have shaken his head dolefully.\\n\\n They had stopped now in a cleared space. Everywhere about them they could see avenues and structures crowded with Jovians, as curious as any terrestrial crowd would have been in similar circumstances.\\n\\n The code expert approached. \"It is time now for me to retire until the next period of activity. We have gone so far as to arrange quarters for you at great inconvenience to ourselves for, of course, the structure will have to be pulled down and rebuilt afterward. Nevertheless, you will be allowed to sleep for a space.\"\\n\\n ZZ Three waved an arm in deprecation and tapped out, \"We thank you but you must not trouble yourself. We don\u0027t mind remaining right here. If you want to sleep and rest, by all means do. We\u0027ll wait for you. As for us,\" casually, \"we don\u0027t sleep.\"\\n\\n The Jovian said nothing, though if it had had a face, the expression upon it might have been interesting. It left, and the robots remained in the car, with squads of well-armed Jovians, frequently replaced, surrounding them as guards.\\n\\n It was hours before the ranks of those guards parted to allow the code expert to return. Along with him were other Jovians, whom he introduced.\\n\\n \"There are with me two officials of the central government who have graciously consented to speak with you.\"\\n\\n One of the officials evidently knew the code, for his clicking interrupted the code expert sharply. He addressed the robots, \"Vermin! Emerge from the ground car that we may look at you.\"\\n\\n The robots were only too willing to comply, so while Three and Two vaulted over the right side of the car, ZZ One dashed through the left side. The word through is used advisedly, for since he neglected to work the mechanism that lowered a section of side so that one might exit, he carried that side, plus two wheels and an axle, along with him. The car collapsed, and ZZ One stood staring at the ruins in embarrassed silence.\\n\\n At last he clicked out gently, \"I\u0027m very sorry. I hope it wasn\u0027t an expensive car.\"\\n\\n ZZ Two added apologetically, \"Our companion is often clumsy. You must excuse him,\" and ZZ Three made a halfhearted attempt to put the car back together again.\\n\\n ZZ One made another effort to excuse himself. \"The material of the car was rather flimsy. You see?\" He lifted a square-yard sheet of three-inch-thick, metal-hard plastic in both hands and exerted a bit of pressure. The sheet promptly snapped in two. \"I should have made allowances,\" he admitted.\\n\\n The Jovian government official said in slightly less sharp fashion, \"The car would have had to be destroyed anyway, after being polluted by your presence.\" He paused, then, \"Creatures! We Jovians lack vulgar curiosity concerning lower animals, but our scientists seek facts.\"\\n\\n \"We\u0027re right with you,\" replied Three cheerfully. \"So do we.\" The Jovian ignored him. \"You lack the mass-sensitive organ, apparently. How is it that you are aware of distant objects?\"\\n\\n Three grew interested. \"Do you mean your people are directly sensitive to mass?\"\\n\\n \"I am not here to answer your questions- your impudent questions- about us.\"\\n\\n \"I take it then that objects of low specific mass would be transparent to you, even in the absence of radiation.\" He turned to Two, \"That\u0027s how they see. Their atmosphere is as transparent as space to them.\"\\n\\n The Jovian clicking began once more, \"You will answer my first question immediately, or my patience will end and I will order you destroyed.\"\\n\\n Three said at once, \"We are energy-sensitive, Jovian. We can adjust ourselves to the entire electromagnetic scale at will. At present, our long-distance sight is due to radio-wave radiation that we emit ourselves, and at close range we see by-\" He paused, and said to Two, \"There isn\u0027t any code word for gamma ray, is there?\"\\n\\n \"Not that I know of,\" Two answered.\\n\\n Three continued to the Jovian, \"At close range we see by other radiation for which there is no code word.\"\\n\\n \"Of what is your body composed?\" demanded the Jovian.\\n\\n Two whispered, \"He probably asks that because his mass sensitivity can\u0027t penetrate past our skin. High density, you know. Ought we to tell him?\"\\n\\n Three replied uncertainly, \"Our human masters didn\u0027t particularly say we were to keep anything secret.\" In radio code, to the Jovian he said, \"We are mostly iridium. For the rest, copper, tin, a little beryllium, and a scattering of other substances.\"\\n\\n The Jovians fell back and by the obscure writhing of various portions of their thoroughly indescribable bodies gave the impression that they were in animated conversation, although they made no sound.\\n\\n And then the official returned. \"Beings of Ganymede! It has been decided to show you through some of our factories that we may exhibit a tiny part of our great achievements. We will then allow you to return so that you may spread despair among the other verm-the other beings of the outer world.\"\\n\\n Three said to Two, \"Note the effect of their psychology. They must hammer home their superiority. It\u0027s still a matter of saving face.\" And in radio code, \"We thank you for the opportunity.\"\\n\\n But the face saving was efficient, as the robots realized soon enough. The demonstration became a tour, and the tour a Grand Exhibition. The Jovians displayed everything, explained everything, answered all questions eagerly, and ZZ One made hundreds of despairing notes.\\n\\n The war potential of that single so-called unimportant town was greater by several times than that of all Ganymede. Ten more such towns would outproduce all the Terrestrial Empire. Yet ten more such towns would not be the fingernail fragment of the strength all Jupiter must be able to exert.\\n\\n Three turned as One nudged him. \"What is it?\"\\n\\n ZZ One said seriously, \"1f they have force fields, the human masters are lost, aren\u0027t they?\"\\n\\n \"I\u0027m afraid so. Why do you ask?\"\\n\\n \"Because the Jovians aren\u0027t showing us through the right wing of this factory. It might be that force fields are being developed there. They would be wanting to keep it secret if they were. We\u0027d better find out. It\u0027s the main point, you know.\"\\n\\n Three regarded One somberly. \"Perhaps you\u0027re right. It\u0027s no use ignoring anything.\"\\n\\n They were in a huge steel mill now, watching hundred-foot beams of ammonia-resistant silicon-steel alloy being turned out twenty to the second. Three asked quietly, \"What does that wing contain?\"\\n\\n The government official inquired of those in charge of the factory and explained, \"That is the section of great heat. Various processes require huge temperatures which life cannot bear, and they must all be handled indirectly.\"\\n\\n He led the way to a partition from which heat could be felt to radiate and indicated a small round area of transparent material. It was one of a row of such, through which the foggy red light of lines of glowing forges could be made out through the soupy atmosphere.\\n\\n ZZ One fastened a look of suspicion on the Jovian and clicked out, \"Would it be all right if I went in and looked around? I am very interested in this.\"\\n\\n Three said, \"You\u0027re being childish, One. They\u0027re telling the truth. Oh well, nose around if you must. But don\u0027t take too long; we\u0027ve got to move on.\"\\n\\n The Jovian said, \"You have no understanding of the heat involved. You will die.\"\\n\\n \"Oh no,\" explained One casually. \"Heat doesn\u0027t bother us.\"\\n\\n There was a Jovian conference, and then a scene of scurrying confusion as the life of the factory was geared to this unusual emergency. Screens of heat-absorbent material were set up, and then a door dropped open, a door that had never before budged while the forges were working. ZZ One entered and the door closed behind him. Jovian officials crowded to the transparent areas to watch.\\n\\n ZZ One walked to the nearest forge and tapped the outside. Since he was too short to see into it comfortably, he tipped the forge until the molten metal licked at the lip of the container. He peered at it curiously, then dipped his hand in and stirred it awhile to test the consistency. Having done this, he withdrew his hand, shook off some of the fiery metallic droplets and wiped the rest on one of his six thighs. Slowly he went down the line of forges, then signified his desire to leave.\\n\\n The Jovians retired to a great distance when he came out of the door and played a stream of ammonia on him, which hissed, bubbled and steamed until he was brought to bearable temperature once more.\\n\\n ZZ One ignored the ammonia shower and said, \"They were telling the truth. No force fields.\"\\n\\n Three began, \"You see-\" but One interrupted impatiently, \"But there\u0027s no use delaying. The human masters instructed us to find out everything and that\u0027s that.\"\\n\\n He turned to the Jovian and clicked out, without the slightest hesitation, \"Listen, has Jovian science developed force fields?\"\\n\\n Bluntness was, of course, one of the natural consequences of One\u0027s less well developed mental powers. Two and Three knew that, so they refrained from expressing disapproval of the remark.\\n\\n The Jovian official relaxed slowly from his strangely stiffened attitude, which had somehow given the impression that he had been staring stupidly at One\u0027s hand-the one he had dipped into the molten metal. The Jovian said slowly, \"Force fields? That, then, is your main object of curiosity?\"\\n\\n \"Yes,\" said One with emphasis.\\n\\n There was a sudden and patent gain in confidence on the Jovian\u0027s part, for the clicking grew sharper. \"Then come, vermin!\"\\n\\n Whereupon Three said to Two, \"We\u0027re vermin again, I see, which sounds as if there\u0027s bad news ahead.\" And Two gloomily agreed.\\n\\n It was to the very edge of the city that they were now led- to the portion which on Earth would have been termed the suburbs- and into one of a series of closely integrated structures, which might have corresponded vaguely to a terrestrial university.\\n\\n There were no explanations, however, and none was asked for. The Jovian official led the way rapidly, and the robots followed with the grim conviction that the worst was just about to happen.\\n\\n It was ZZ One who stopped before an opened wall section after the rest had passed on. \"What\u0027s this?\" he wanted to know.\\n\\n The room was equipped with narrow, low benches, along which Jovians manipulated rows of strange devices, of which strong, inch-long electromagnets formed the principal feature.\\n\\n \"What\u0027s this?\" asked One again.\\n\\n The Jovian turned back and exhibited impatience. \"This is a students\u0027 biological laboratory. There\u0027s nothing there to interest you.\"\\n\\n \"But what are they doing?\"\\n\\n \"They are studying microscopic life. Haven\u0027t you ever seen a microscope before?\"\\n\\n Three interrupted in explanation, \"He has, but not that type. Our microscopes are meant for energy-sensitive organs and work by refraction of radiant energy. Your microscopes evidently work on a mass-expansion basis. Rather ingenious.\"\\n\\n ZZ One said, \"Would it be all right if I inspected some of your specimens?\"\\n\\n \"Of what use will that be? You cannot use our microscopes because of your sensory limitations and it will simply force us to discard such specimens as you approach for no decent reason.\"\\n\\n \"But I don\u0027t need a microscope,\" explained One, with surprise. \"I can easily adjust myself for microscopic vision.\"\\n\\n He strode to the nearest bench, while the students in the room crowded to the corner in an attempt to avoid contamination. ZZ One shoved a microscope aside and inspected the slide carefully. He backed away, puzzled, then tried another...a third...a fourth.\\n\\n He came back and addressed the Jovian. \"Those are supposed to be alive, aren\u0027t they? I mean those little worm things.\"\\n\\n The Jovian said, \"Certainly.\"\\n\\n \"That\u0027s strange- when I look at them, they die!\"\\n\\n Three exclaimed sharply and said to his two companions, \"We\u0027ve forgotten our gamma-ray radiation. Let\u0027s get out of here, One, or we\u0027ll kill every bit of microscopic life in the room.\"\\n\\n He turned to the Jovian, \"I\u0027m afraid that our presence is fatal to weaker forms of life. We had better leave. We hope the specimens are not too difficult to replace. And, while we\u0027re about it, you had better not stay too near us, or our radiation may affect you adversely. You feel all right so far, don\u0027t you?\" he asked.\\n\\n The Jovian led the way onward in proud silence, but it was to be noticed that thereafter he doubled the distance he had hitherto kept between himself and them.\\n\\n Nothing more was said until the robots found themselves in a vast room. In the very center of it huge ingots of metal rested unsupported in mid-air-or, rather, supported by nothing visible-against mighty Jovian gravity.\\n\\n The Jovian clicked, \"There is your force field in ultimate form, as recently perfected. Within that bubble is a vacuum, so that it is supporting the full weight of our atmosphere plus an amount of metal equivalent to two large spaceships. What do you say to that?\"\\n\\n \"That space travel now becomes a possibility for you,\" said Three. \"Definitely. No metal or plastic has the strength to hold our atmosphere against a vacuum, but a force field can- and a force-field bubble will be our spaceship. Within the year we will be turning them out by the hundreds of thousands. Then we will swarm down upon Ganymede to destroy the verminous so-called intelligences that attempt to dispute our dominion of the universe.\"\\n\\n \"The human beings of Ganymede have never attempted-\" began Three, in mild expostulation.\\n\\n \"Silence!\" snapped the Jovian. \"Return now and tell them what you\u0027ve seen. Their own feeble force fields- such as the one your ship is equipped with- will not stand against us, for our smallest ship will be a hundred times the size and power of yours.\"\\n\\n Three said, \"Then there\u0027s nothing more to do and we will return, as you say, with the information. If you could lead us back to our ship, we\u0027ll say good-by. But by the way, just as a matter for the record, there\u0027s something you don\u0027t understand. The humans of Ganymede have force fields, of course, but our particular ship isn\u0027t equipped with one. We don\u0027t need any.\"\\n\\n The robot turned away and motioned his companions to follow. For a moment they did not speak, then ZZ One muttered dejectedly, \"Can\u0027t we try to destroy this place?\"\\n\\n \"It won\u0027t help,\" said Three. \"They\u0027d get us by weight of numbers. It\u0027s no use. In an earthly decade the human masters will be finished. It is impossible to stand against Jupiter. There\u0027s just too much of it. As long as Jovians were tied to the surface, the humans were safe. But now that they have force fields. All we can do is to bring the news. By the preparation of hiding places, some few may survive for a short while.\"\\n\\n The city was behind them. They were out on the open plain by the lake, with their ship a dark spot on the horizon, when the Jovian spoke suddenly:\\n\\n \"Creatures, you say you have no force field?\" Three replied without interest, \"We don\u0027t need one.\"\\n\\n \"How then does your ship stand the vacuum of space without exploding because of the atmospheric pressure within?\" And he moved a tentacle as if in mute gesture at the Jovian atmosphere that was weighing down upon them with a force of twenty million pounds to the square inch.\\n\\n \"Well,\" explained Three, \"that\u0027s simple. Our ship isn\u0027t airtight. Pressures equalize within and without.\"\\n\\n \"Even in space? A vacuum in your ship? You lie!\"\\n\\n \"You\u0027re welcome to inspect our ship. It has no force field and it isn\u0027t airtight. What\u0027s marvelous about that? We don\u0027t breathe. Our energy is obtained through direct atomic power. The presence or absence of air pressure makes little difference to us and we\u0027re quite at home in a vacuum.\"\\n\\n \"But absolute zero!\"\\n\\n \"It doesn\u0027t matter. We regulate our own heat. We\u0027re not interested in outside temperatures.\" He paused. \"Well, we can make our own way back to the ship. Good-by. We\u0027ll give the humans of Ganymede your message- war to the end!\"\\n\\n But the Jovian said, \"Wait! I\u0027ll be back.\" He turned and went toward the city.\\n\\n The robots stared, and then waited in silence. It was three hours before he returned and when he did, it was in breathless haste. He stopped within the usual ten feet of the robots, but then began inching his way forward in a curious groveling fashion. He did not speak until his rubbery gray skin was almost touching them, and then the radio code sounded, subdued and respectful.\\n\\n \"Honored sirs, I have been in communication with the head of our central government, who is now aware of all the facts, and I can assure you that Jupiter desires only peace,\"\\n\\n \"I beg your pardon?\" asked Three blankly. The Jovian drove on hastily. \"We are ready to resume communication with Ganymede and will gladly promise to make no attempt to venture into space. Our force field will be used only on the Jovian surface.\"\\n\\n \"But-\" Three began. \"Our government will be glad to receive any other representatives our honorable human brothers of Ganymede would care to send. If your honors will now condescend to swear peace-\" a scaly tentacle swung out toward them and Three, quite dazed, grasped it. Two and One did likewise as two more were extended to them.\\n\\n The Jovian said solemnly: \"There is then eternal peace between Jupiter and Ganymede.\"\\n\\n The spaceship which leaked like a sieve was out in space again. The pressure and temperature were once more at zero, and the robots watched the huge but steadily shrinking globe that was Jupiter.\\n\\n \"They\u0027re definitely sincere,\" said ZZ Two, \"and it\u0027s very gratifying, this complete about-face, but I don\u0027t get it.\"\\n\\n \"It is my idea,\" observed ZZ One, \"that the Jovians came to their senses just in time and realized the incredible evil involved in the thought of harm to a human master. That would be only natural.\"\\n\\n ZZ Three sighed and said, \"Look, it\u0027s all a matter of psychology. Those Jovians had a superiority complex a mile thick and when they couldn\u0027t destroy us, they were bound to save face. All their exhibitions, all their explanations, were simply a form of braggadocio, designed to impress us into the proper state of humiliation before their power and superiority.\"\\n\\n \"I see all that,\" interrupted Two, \"but-\" Three went on, \"But it worked the wrong way. All they did was to prove to themselves that we were stronger, that we didn\u0027t drown, that we didn\u0027t eat or sleep, that molten metal didn\u0027t hurt us. Even our very presence was fatal to Jovian life. Their last trump was the force field. And when they found out that we didn\u0027t need them at all, and could live in a vacuum at absolute zero, they broke.\" He paused and added philosophically, \"When a superiority complex like that breaks, it breaks all the way.\"\\n\\n The other two considered that, and then Two said, \"But it still doesn\u0027t make sense. Why should they care what we can or can\u0027t do? We\u0027re only robots. We\u0027re not the ones they have to fight.\"\\n\\n \"And that\u0027s the whole point, Two,\" said Three softly. \"It\u0027s only after we left Jupiter that I thought of it. Do you know that through an oversight, quite unintentionally, we neglected to tell them we were only robots.\"\\n\\n \"They never asked us,\" said One. \"Exactly. So they thought we were human beings and that all the other human beings were like us!\"\\n\\n He looked once more at Jupiter, thoughtfully. \"No wonder they decided to quit!\" \\n\\n","sourceLink":"https://allnovel.net/the-complete-robot-robot-0-3/page-9.html","bookId":1740,"book":{"id":1740,"title":"The Complete Robot (Robot #0.3)","description":"Storyline: The Complete Robot (Robot 0.3) \\n THE COMPLETE ROBOT is the definitive anthology of Asimov\u0027s stunning visions of a robotic future… \\n In these stories, Isaac Asimov creates the Three Laws of Robotics and ushers in the Robot Age: when Earth is ruled by master-machines and when robots are more human than mankind. \\n As well as TN-3 (Tony), AL-76 and other robots, the stories feature the staff of US Robots and Mechanical Men Inc., and in particular the chief robot-psychologist, the steely Dr Susan Calvin who is in many ways more robot-like than her subjects. \\n THE COMPLETE ROBOT is the ultimate collection of timeless, amazing and amusing robot stories from the greatest science fiction writer of all time, offering golden insights into robot thought processes. Asimov\u0027s Three Laws of Robotics were programmed into real computers thirty years ago at the Massachusetts Institute of Technology - with surprising results. Readers of today still have many surprises in store...\\n","cover":"https://allnovel.net/images/the-complete-robot-robot-0-3.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-complete-robot-robot-0-3.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:15:05 AM"}}
