{"id":80636,"no":8,"title":"Page 8","content":"“Gus?”\\n\\n “Your mark? I don’t understand.”\\n\\n “I met my mark. The man closest to Travis. Or at least I think he is. He at least works for him. We’re going out on a date tonight.”\\n\\n “Who is he?”\\n\\n “His name is Javier Bernal,” I told him, his name sounding thick on my tongue.\\n\\n “Mexican?”\\n\\n “Yeah, so?” I was feeling slightly defensive over his disapproving tone of voice.\\n\\n “Ellie…I don’t know what to say, this is not sitting well with me.”\\n\\n “Well you knew what I was coming here to do.”\\n\\n “Yeah, but those Mexicans—”\\n\\n “Well aren’t you being a little racist!”\\n\\n “Ellie,” he barked, and I clamped my mouth shut. “This isn’t being racist. My ex-wife was Mexican. I don’t really care. But if he’s Mexican, he’s probably directly linked to the cartel.”\\n\\n “Again, so? We know that Travis is the head of one of them.”\\n\\n “He’s the head of an off-shoot cartel. They control the south. This Javier might have ties to another, the ones in Mexico, where they get their supplies. The Loz Zetas, Sinaloa. This is much more dangerous. You’ve heard of the beheadings on the news. These people mean serious business.”\\n\\n I rolled my eyes. “I’m aware of that. Hello, you don’t think what Travis did to me wasn’t serious business? And just because he happens to be Mexican…”\\n\\n “You better watch yourself.”\\n\\n “I am. And I will. And you know what, yeah maybe he has some ties to a cartel somewhere, or maybe it’s just Travis’s. But he’s only twenty-three. How much damage can a twenty-three year old do?”\\n\\n The words hung in the air. I felt like I was tempting fate.\\n\\n The twenty-three year old showed up at my apartment in his GTO, calling my cell and letting me know he was downstairs. I was relieved that he didn’t ask to come up and see the place. I had nothing to show for Eden White at the moment, unless he wanted to browse my internet history which consisted of Mexican drug cartels and more porn.\\n\\n The porn didn’t help me at all. All it did was turn me on, and when I was turned on it seemed my brain cells went out the window. I’d wanted some pointers in seduction but it was pretty obvious I didn’t have to do anything to seduce Javier; now it was just overkill that made me squirm against the seam of my jeans.\\n\\n Even so, I came prepared. I had a couple of condoms in my purse and I’ll also admit I watched a YouTube video of how to put one on. It scared the shit out of me and I decided that though I’d push the condom usage if it came to that point, he could handle the mechanics of it all himself.\\n\\n The air was muggy despite the clear sunshine and I was glad I swapped my usual jeans for a pair of A-line linen pants. I wore a coral-colored tube top that showed off my tanned shoulders and matched my new lip gloss. Spending your teen years in jeans and boots meant I had turned into somewhat of a tomboy, so it felt a bit weird to get dolled up for someone. Weird, but surprisingly good, like a taste of a new dish you could see yourself getting addicted to.\\n\\n I spied his car by the road and he immediately got out when he saw me. He was just wearing a white t-shirt and black jeans; on his feet were dark boat shoes. It was a casual look that still managed to look elegant on him. Perhaps it was the way he walked, effortlessly, like a stalking tiger. It was the first time I got a good look at his body too and was surprised at how muscular he was. His forearms were pleasantly large, his chest toned, the rest of him very trim and lean. He looked athletic and fast, which shouldn’t have surprised me after what happened last night.\\n\\n “Hello, angel,” he said with a grin, his arms spread wide for an embrace. This was the drug cartel leader? I didn’t think so.\\n\\n I laughed nervously and he swept me into his arms, holding me close to him. That familiar smell drifted over me, bringing back the feeling of his lips at my ear. Today though, he didn’t kiss my cheek but still held on to my hand.\\n\\n “You brought out the sunshine, I’m glad,” he said, looking me up and down. His lilting accent was creating pleasure waves down my back. “Come on.” He gave my hand a tight squeeze. Even more pleasure waves formed. “We should enjoy the weather while we can.”\\n\\n We got into his car and I was immediately in love with it.\\n\\n “It’s beautiful,” I said, running my hands over the smooth dash, marveling at how well-maintained it looked despite its age, the perfect blend of polished chrome and retro fittings.\\n\\n “It has a name,” he said, buckling himself in. He caught my eyes and explained. “Jose. I brought him all the way from Mexico.”\\n\\n I kept smiling back at him, although my brain was already going back over what Gus had said and what I had learned about cartels on the internet. I hoped the wheels in my head had been hidden from him, but the man was so damned perceptive.\\n\\n “What, you didn’t know I was from Mexico?” he asked, still smiling, though he slipped on a pair of dark shades that covered up his all-seeing eyes. We turned onto the road and headed toward the highway. The windows were all rolled down, messing up our hair, which made me suspect the air conditioner wasn’t working.\\n\\n “No, I figured you were from Mexico,” I said. “I just thought it was cute that you named your car.”\\n\\n He laughed. “Cute? Maybe. Dorky? Yes. But what can I say, I’m sentimental. This old machine has been with me longer than anyone I know.”\\n\\n I wanted to know how that could be, considering he would have only been of driving age for about eight years or so, but I didn’t press it. I wanted information from him, but I wanted it slowly.\\n\\n “Well, it’s one hell of a sexy car. I love vintage models,” I said.\\n\\n He tilted his head down and eyed me over his glasses. “Were you ever a model?”\\n\\n I let out a loud and rather awkward guffaw. I immediately covered up my mouth, shooting him a sheepish smile. “Sorry, no.”\\n\\n “I don’t see how it’s a funny question,” he said rather seriously.\\n\\n “Well, for one, I’m not tall enough,” I rattled off, ticking my fingers. “For two, I’m clumsy as hell. For three, I don’t have the confidence.”\\n\\n “And for four?”\\n\\n For four? Well, for four there was no way they’d hire a gimpy, scarred model for anything except the before and after effects of battery acid usage gone wrong, and they’d have to Photoshop the before picture.\\n\\n “I walk with a slight limp,” I admitted. “It gets worse when I’m not paying attention.”\\n\\n “I’d say I haven’t noticed,” he said sincerely.\\n\\n “Well, I’ve been paying attention.”\\n\\n “Isn’t that tiring? To hide it? To pretend?”\\n\\n I sucked on my lip and stared at the industrial buildings zipping past. “Yes, it is.”\\n\\n “Then how about you don’t pretend with me? You’re going to need all the energy you can get.”\\n\\n I raised my brow and looked back at him. “Is that so?”\\n\\n He grinned, a stunning smile that lifted his whole face. “You will find out very soon.”\\n\\n Though he just warned me not to hide anything from him, I turned my head and hid the stupid schoolgirl look on my face. Besides, I was hiding so much already.\\n\\n We drove past dilapidated buildings and ravished oceanfront, and Javier explained the effects of Hurricane Katrina. I’d watched the whole thing on the news two years earlier, but Javier had been here, riding the whole thing out.\\n\\n “Was your place damaged?” I asked, almost saying house but then catching myself. To him, I had no reason to suspect he lived in a house.\\n\\n He shook his head. “I was staying in an apartment at the time; there was just some water damage on the first floor. Many homes were absolutely wrecked, which in time ended up being a good thing. For me, anyway. I bought a seaside home late last year; it was damaged but it was cheap, and I spent a lot of time fixing it up.”\\n\\n “And that’s in Ocean Springs?”\\n\\n “I love the town so much more than Biloxi and Gulfport. Blegh. So impersonal. But in Ocean Springs, people know your name.”\\n\\n “And that’s a good thing?” I asked, totally surprised. I would have thought laying low was rule number one for those involved in illegal activities. At least, that’s what I’d been taught.\\n\\n His wide mouth twitched with amusement. “Yes, that’s a good thing. In Mexico, where I’m from, La Cruz, everyone knows your name. Everyone is there to help you, to support you. It’s one big family. You get that here in the south, sometimes, but in Ocean Springs it’s just so small and community oriented.”\\n\\n “It’s kind of a rich place, isn’t it? That’s at least what I gathered.”\\n\\n “It is and it isn’t. But I feel at home, and to feel you’re at home when you’re so far away from home, that’s very important.”\\n\\n “So you’re from La Cruz, huh?”\\n\\n He shot me a sideways glance. “Do you know where that is, girl who has never left Arizona?”\\n\\n I smiled. “No, actually I don’t. It just has a nice ring to it.”\\n\\n “Eden White has a nice ring to it too.”\\n\\n I fidgeted in my seat. “Sounds like home?”\\n\\n “Yes. It does.” There was a hint of melancholy in his inflection and a hush gripped us in the car until the town of Ocean Springs was upon us.\\n\\n While he brought the car down the main street I said to him, “Where are we going? Are you taking me out for coffee?”\\n\\n He laughed. “That would be boring, don’t you think? No, I’m taking you to my house.”\\n\\n I gulped down the knot in my throat. I knew it was only about four in the afternoon now, but thank God I had brought the condoms.\\n\\n Soon we pulled up to the very place I had been watching all those weeks before. The whiteboard outside, curved stained-glass windows, and huge porch. I used to sit up the street in the truck and watch him, wondering what his name was, if he had friends, what he did when he wasn’t with Travis. I was lucky I had done most of my staking out at night, otherwise he would have grown pretty suspicious of my truck. How silly to have your cover blown just because of a car.\\n\\n Now, finally, I was going to get the tour inside. Of course I had to act like I’d never seen the place before.\\n\\n “This is lovely,” I said, staring up at the house, my hand shielding the late sun from my eyes. “And the beach is all yours?”\\n\\n “Mas o menos,” he said. He held out his hand for me and I took it with glee. “Come, I’ll give you the grand tour.”\\n\\n We had parked in the spots that were underneath half the house, the back end on stilts. Javier explained to me that all the support beams had collapsed from the hurricane and the house was slanted. They basically had to raise the thing back up. We ignored the door in the garage area and he took me to where wooden steps led up to the porch up top. Around us, white beach sand was blowing across the driveway and a breeze was rustling the palm fronds and twisted live oak trees. Everything here was glowing in the sunshine, the humidity being swept away. \\n\\n","sourceLink":"https://allnovel.net/on-every-street-the-artists-trilogy-0/page-8.html","bookId":2731,"book":{"id":2731,"title":"On Every Street (The Artists Trilogy #0)","description":"Storyline: On Every Street (The Artists Trilogy 0.5) \\n When young con artist Ellie Watt decides to call herself Eden White and go after the drug lord who ruined her as a child, she never expects to fall for one of his henchmen. But Javier Bernal is no ordinary man. Subtly dangerous and overwhelmingly seductive, Eden finds herself passionately in love with Javier, the very person she\u0027s set-up to betray. With her body and heart in a heated battle against her deep need for revenge, no one will walk away from this con a winner. \\n Takes place six years before Sins \u0026 Needles. It can be read before or after Sins \u0026 Needles and may also be read as a standalone.\\n","cover":"https://allnovel.net/images/on-every-street-the-artists-trilogy-0.jpg","author":"Karina Halle","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/on-every-street-the-artists-trilogy-0.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:27:53 PM"}}
