{"id":77283,"no":47,"title":"Page 47","content":"Connor weighed the damnation of his soul for eternity against the temporary pleasure he would get if he throttled a man of the cloth.\\n\\n \"With your permission, Laird?\" Niell asked.\\n\\n \"What is it?\"\\n\\n \"I don\u0027t think the priest knew she was following him. He went out first, riding his speckled gelding, and pulling the reins of a packhorse behind him. The second priest walked well behind the horses.\"\\n\\n \"And you didn\u0027t think this was peculiar behavior?\" Alec roared.\\n\\n \"He was small, Laird. I thought he was yet to be ordained and that he was required to walk as penance.\"\\n\\n \"Now all we have to do is find out where the priest was going,\" Alec said.\\n\\n \"Dunkady Abbey,\" Jamie blurted out.\\n\\n \"You\u0027re certain?\" Connor asked.\\n\\n \"Yes,\" she answered.\\n\\n \"If he was telling the truth,\" her husband said.\\n\\n \"For heaven\u0027s sake, Alec. He\u0027s a man of God. Of course he was telling the truth.\"\\n\\n \"I\u0027ll leave immediately,\" Connor said.\\n\\n \"I\u0027m going with you,\" Alec and Jamie both announced at the same time.\\n\\n Connor shook his head. \"I have to do this alone.\"\\n\\n \"Not without your men, you don\u0027t,\" Alec warned.\\n\\n Because he didn\u0027t want to waste time arguing with his brother, he told Quinlan to go to the keep and get the others. \"You can catch up with me,\" he told him.\\n\\n The monastery was only a short day\u0027s ride away by his measure. If Brenna was riding the packhorse, God only knew how long it would take her to get there.\\n\\n He forced himself to block all thoughts but one. He had to get to his own sweet Brenna. He was lost without her.\\n\\n Brenna was inconsolable. She couldn\u0027t eat, couldn\u0027t sleep, and couldn\u0027t stop crying long enough to make any sense to her sister.\\n\\n Faith soon threw her hands up in despair. After she handed Brenna a dry cloth to wipe away her tears, she tossed the soaked square in the laundry box with the others, and then sat down next to her sister on the narrow cot in her bedroom. For what she swore was going to be the last time, she tried to get her sister to listen to reason.\\n\\n \"You really have to stop this mourning. We\u0027ve already been thrown out of chapel because you were making so much noise.\"\\n\\n \"We weren\u0027t thrown out. We were just encouraged to go back to our rooms.\"\\n\\n \"What about dear Father Sinclair? He can\u0027t pay attention to his daily vespers, thanks to you. Why won\u0027t you listen to us? You told me you love your husband.\"\\n\\n \"Don\u0027t you understand? He made his choice when he left me. He doesn\u0027t want me or my love. He never did. She\u0027s part of his past, and he\u0027s never going to let go of what happened. No, I can\u0027t go back. It would hurt too much.\"\\n\\n The need to blow her nose ended her protests. Faith still didn\u0027t understand. \"You never used to cry. If loving someone makes a woman miserable, I swear I\u0027m never going to fall in love. I wish I never had to get married either. For the love of God, will you stop crying? Perhaps if you went back and tried once more… If you told him how you feel…\"\\n\\n \"He knows how I feel even though I didn\u0027t give him my declaration. He\u0027s intelligent, Faith. And so am I,\"\\n\\n she added. \"I know when I\u0027m not wanted. I can\u0027t talk about this anymore.\"\\n\\n \"What if he comes for you?\"\\n\\n She shook her head. \"He won\u0027t.\"\\n\\n \"But what if he does?\"\\n\\n She let out a sigh. \"I would think his pride forced him to come here. I wouldn\u0027t go back with him. Can\u0027t we talk about something else?\"\\n\\n Faith ignored her suggestion. \"Gillian might not let you come back with us. Then what will you do? Stay in the abbey for the rest of your life, making these poor monks miserable?\"\\n\\n \"My brother won\u0027t deny me. Did I tell you Connor doesn\u0027t even know how many brothers and sisters I have?\"\\n\\n \"Yes, you\u0027ve mentioned that fact to me about a hundred times now. You want children, don\u0027t you? If you go back…\"\\n\\n \"I do want children, but I\u0027m not about to leave them with Connor.\"\\n\\n \"Now what are you talking about? Go back to him, Brenna. Please, before it\u0027s too late. He\u0027s your husband.\"\\n\\n \"Must you nag me?\"\\n\\n Faith decided she had pressed enough for the moment. \"Perhaps some fresh air will make you feel better.\\n\\n Let\u0027s go outside and stroll about the gardens.\"\\n\\n \"If we stray from the path, we aren\u0027t on sacred ground anymore.\"\\n\\n \"I don\u0027t understand.\"\\n\\n \"The path in front of the abbey. There\u0027s a wooden cross where it ends on the south side and another on the north side. If we step off the path, we aren\u0027t safe. I think we should just stay here. Besides, Gillian should be here any time now if Father Sinclair\u0027s estimation was right.\"\\n\\n \"If you insist on hiding here, then we\u0027ll hide. At least pull the fur coverings off the windows so the sun can come inside. It\u0027s like a tomb in here.\" Faith didn\u0027t wait for her sister to agree or disagree with her. She ran to the window, unhooked the cotton loops, and pulled the thick fur down.\\n\\n Closing her eyes against the bright sun, she reached behind her head and lifted her hair away from the nape of her neck. \"The breeze feels wonderful,\" she whispered, her face aglow with pleasure. She stayed silhouetted against the light until her arms began to ache. And then she looked out at the landscape.\\n\\n \"Oh… my… God… they\u0027re… they\u0027re… huge.\"\\n\\n \"Is something wrong?\" Brenna asked.\\n\\n Mesmerized by the sight before her, Faith couldn\u0027t even manage a nod. At the northern end of the abbey were giants for as far as the eye could see. Faith guessed at least forty men rode with the fierce-looking warrior who had separated himself from the others and had ridden closer to the path. Every one of the men was bare-kneed and would have been bare-chested as well if it weren\u0027t for the wide strip of material that was pulled up from one side of his waist and draped over his opposite shoulder. Some of them were scarred; others were not. All of them were in dire need of a good scrubbing, haircuts, and decent clothes.\\n\\n Saints above, they were savages.\\n\\n Faith whirled around. \"You can\u0027t possibly go back. Thank heavens you came to your senses. No, no, you can\u0027t go back to your husband. You should live with Gillian. He\u0027ll be happy to have you. He loves you dearly. Why didn\u0027t you tell me they were… they were… Oh, Brenna, how did you ever manage to stay alive all this while?\"\\n\\n \"What are you rambling about?\"\\n\\n Worried she might come to the window and see who was outside, Faith frantically shook her head. Her sister had had enough upsets to last her a lifetime. The proof was there for anyone to see. She had a scar on her forehead, and another on her arm.\\n\\n In her haste to make amends because she hadn\u0027t had any idea what Brenna had been up against, she stammered out her apology. \"I\u0027m so sorry. I didn\u0027t know… until I saw them, I didn\u0027t know. No, it\u0027s out of the question.\"\\n\\n \"What\u0027s out of the question?\" Brenna asked. She stood up to join her sister at the window.\\n\\n Faith ran over to her and shoved her back down on the cot. Then she raced to the door and threw the lock into place.\\n\\n \"It\u0027s out of the question to… to go outside. Yes, it\u0027s out of the question. My, but it\u0027s gotten chilly in here. I believe I\u0027ll put the fur back up.\"\\n\\n She went back to the window and peeked out, hoping she had only imagined the savages were there.\\n\\n No, they were there all right, looking just as frightening as before.\\n\\n Her hands shook while she tried to rehook the loops. \"Brenna, tell me what your husband looks like.\"\\n\\n \"Why?\"\\n\\n \"I\u0027m curious, that\u0027s all,\" she answered. She stared at the leader and tried to finish rehanging the fur at the same time. He really was scary.\\n\\n \"He\u0027s handsome.\"\\n\\n \"You\u0027re jesting.\"\\n\\n \"No, I\u0027m not. He is handsome.\"\\n\\n \"But what exactly does he look like? Describe him for me.\"\\n\\n \"Dark hair and eyes, a straight nose. He\u0027s tall, and very strong. Does that satisfy you?\"\\n\\n \"Long hair?\"\\n\\n \"All the MacAlister men have long hair. What are you looking at?\"\\n\\n \"Father Sinclair,\" she answered, which wasn\u0027t a lie, because the priest was running down the path toward the warrior in front of the other savages. Father should have been running the other way, shouldn\u0027t he?\\n\\n Surely he noticed they were all armed for battle.\\n\\n Brenna went to the water basin to wash her face and hands. \"If Father\u0027s outside, it\u0027s safe for us to go out.\\n\\n He won\u0027t let you wander off the path.\"\\n\\n \"Was it safe for the two of you to come here without an escort?\"\\n\\n \"No, but it was necessary. It isn\u0027t now. Besides, I was dressed as a monk, and all the Highlanders respect men of the cloth. None would harm them. Right now, however, you are the one I\u0027m concerned about. Once you make up your mind to do something, you do it, no matter what the risk, and if you decide to pick flowers up on the hill, I know Father won\u0027t let you.\"\\n\\n \"You taught me how to take a risk,\" Faith protested. \"Oh, dear, the fur just fell out the window.\"\\n\\n Leaning out, she watched the covering drop down with a shush to land on the stone path just a step away from the priest. Startled by the near miss, Sinclair glanced up at the window.\\n\\n \"I\u0027m so sorry, Father. It slipped,\" she called out before she jumped back so he wouldn\u0027t lecture her in front of the savages. Besides, she knew she was going to laugh, and she really didn\u0027t want to hurt the priest\u0027s feelings.\\n\\n He heard her, of course, and so did the MacAlisters. Everyone but Quinlan pretended not to notice. He grinned with obvious approval.\\n\\n Curious, Crispin turned to him. \"You find her amusing?\"\\n\\n \"I find her enchanting.\"\\n\\n Crispin shook his head to let his friend know he thought he was demented. Quinlan nodded, and then declared his intention, \"I mean to have her.\"\\n\\n \"She\u0027ll run from you.\"\\n\\n \"I hope so. It wouldn\u0027t be any fun if she didn\u0027t. She\u0027s bonny, isn\u0027t she?\"\\n\\n \"Marriage?\"\\n\\n \"Eventually.\"\\n\\n Connor suddenly raised his hand. His friends thought he wanted them to be silent so that he could hear what the priest was telling him. Then their laird gave the signal to let them know the enemy was near. He simply put his hand on the hilt of his sword. Englishmen were approaching.\\n\\n Gillian and his soldiers were coming up the hill. From the sound their horses made, Connor estimated approximately sixty soldiers rode with their baron. Crispin and Quinlan immediately moved to flank their laird to protect him from an attack from either side.\\n\\n Father Sinclair didn\u0027t notice the MacAlisters were tensed to fight. He was explaining once again that he hadn\u0027t helped Brenna leave the Kincaid holding, hadn\u0027t had the slightest inkling that she had such a plan in mind, and it was only after they had entered the forest and she called out to him that he knew she was chasing after him.\\n\\n \"Don\u0027t you ever look behind you?\" Connor asked.\\n\\n \"Not when I\u0027m on your land or Kincaid\u0027s, because I know I\u0027m safe. I assure you I took every precaution once your wife alerted me to her presence. I tried to talk her into going back, but she wouldn\u0027t listen to me, Laird. I couldn\u0027t let her go on without me, could I?\"\\n\\n Connor shook his head. \"You have assured me she\u0027s all right, and that\u0027s all I care about now. Tell her to come to me.\"\\n\\n \"She\u0027ll deny the request,\" he said. \"I\u0027ll try, of course.\"\\n\\n \"She won\u0027t deny me.\" He took his dagger from his belt and cut the threads Jamie had used to sew the medallion to the side of his plaid. \"Give her this.\"\\n\\n The priest accepted the medallion with a nod. \"And your message?\"\\n\\n \"The medallion is my message. She\u0027ll understand. She can\u0027t deny me, Father.\"\\n\\n \"If you leave your sword at the door, you could come inside,\" he offered.\\n\\n Connor\u0027s answer was to suggest the priest look behind him.\\n\\n \"Oh, Good Lord. Gillian\u0027s here. I\u0027ll hurry,\" he whispered. \"Don\u0027t do anything rash before I return.\"\\n\\n \"We won\u0027t,\" Connor assured him, \"unless, of course, we\u0027re provoked.\"\\n\\n The priest picked up the hem of his robe and went racing back toward the abbey.\\n\\n \"You might as well stop brushing your hair, Brenna. Father\u0027s coming back inside. He\u0027s running, as a matter of fact. I wonder…Uh oh.\"\\n\\n \"What\u0027s wrong?\"\\n\\n \"Gillian\u0027s here.\"\\n\\n Brenna dropped her brush and sat down on the cot. The time had come for her to leave the Highlands forever. Oh, God, why did it hurt so much?\\n\\n Tears gathered in her eyes. She bowed her head in surrender and began to pray. \"Why is this so hard?\"\\n\\n she cried out. She doubled over and rocked back and forth, acting as though the pain were physical now instead of inside her heart.\\n\\n Faith didn\u0027t know what she could say to her. \"I don\u0027t know, Brenna. If I could help you, I would. Your husband might be able to make you feel better.\"\\n\\n \"No.\"\\n\\n \"He\u0027s here, Brenna.\"\\n\\n Other than straightening up again until she was rigid, she didn\u0027t say anything or show any other reaction.\\n\\n \"Surely that means…\"\\n\\n \"He\u0027s here because of his pride.\"\\n\\n \"I knew you\u0027d say that,\" Faith said. She leaned back out the window and waved to her brother. Gillian and his men all looked so shiny and new in their hauberks and helmets. She turned then and looked at the MacAlisters again. They looked… \"Like savages.\"\\n\\n \"Come away from the window.\"\\n\\n \"I think I should wave to your husband. It would be rude to ignore him. I already waved to Gillian, and I shouldn\u0027t slight him.\"\\n\\n \"I assure you he won\u0027t care.\"\\n\\n She waved anyway. \"He didn\u0027t wave back. Gillian did.\"\\n\\n \"Get away from there,\" Brenna demanded.\\n\\n \"Come and look.\"\\n\\n \"No.\"\\n\\n A knock sounded at the door, followed by loud panting. Father Sinclair had run up the steps to get to Brenna\u0027s room.\\n\\n Faith let him in. \"She won\u0027t go out to him, Father. I tried to convince her, but she refuses to have anything to do with him.\"\\n\\n The priest nodded before he rushed over to the cot. \"Your husband told me you would come to him, mi\u0027lady. He was certain this would force you to,\" he added as he dropped the medallion into her lap. \\n\\n","sourceLink":"https://allnovel.net/the-wedding-lairds-fiancees-2/page-47.html","bookId":1845,"book":{"id":1845,"title":"The Wedding (Lairds\u0027 Fiancees #2)","description":"Storyline: It\u0027s a classic plot: a marriage of convenience that lays the groundwork for true love. \\n 1119. Journeying from England to Scotland to wed a highlander, Lady Brenna had resigned herself to the arranged match. But when a band of fierce, painted warriors captured her en route, she fearlessly met their demand to marry their leader -- the quick-tempered laird Connor MacAlister. She couldn\u0027t know that her capture was merely the first act of vengeance against her betrothed, Connor\u0027s sworn enemy. \\n Brenna harbored no illusions that her husband was in love with her; after a hasty forest wedding, MacAlister assured her she could return home once she had borne him a son. But she could not deny that she had once proposed to MacAlister -- ten years ago, when she was just a child, and the visitor to her father\u0027s castle charmed her with his dazzling, unexpected smile. Now, as she sets out to win the brave chieftain whom she has come to adore, a legacy of revenge ensnares Brenna in a furious clan war -- and only her faith in her gallant hero can save her...\\n","cover":"https://allnovel.net/images/the-wedding-lairds-fiancees-2.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-wedding-lairds-fiancees-2.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:35:17 PM"}}
