{"id":20588,"no":13,"title":"CHAPTER XII. THE NEWSBOYS\u0027 LODGING HOUSE.","content":"When Mother Watson had turned the corner, Mark breathed a sigh of relief. \"Don\u0027t you think she\u0027ll come back again?\" he asked anxiously of Ben Gibson. \"No,\" said Ben, \"she\u0027s scared of the copp. If she ever catches you alone, and tries to come any of her games, just call a copp, and she\u0027ll be in a hurry to leave.\" \"Well,\" said Mark, \"I guess I\u0027ll try to sell the rest of my matches. I haven\u0027t got but a few.\" \"All right; I\u0027ll try for another shine, and then we\u0027ll go and have some dinner. I\u0027d like to get hold of another greeny.\" Mark started with his few remaining matches. The feeling that he was his own master, and had a little hoard of money for present expenses, gave him courage, and he was no longer deterred by his usual timidity. In an hour he had succeeded in getting rid of all his matches, and he was now the possessor of two dollars and seventy-five cents, including the money Ben Gibson owed him. Ben also was lucky enough to get two ten-cent customers, which helped his receipts by twenty cents. Ben, it may be remarked, was not an advocate of the one-price system. He blacked boots for five cents when he could get no more. When he thought there was a reasonable prospect of getting ten cents, that was his price. Sometimes, as in the case of the young man from the rural districts, he advanced his fee to twenty-five cents. I don\u0027t approve Ben\u0027s system for my part. I think it savors considerably of sharp practice, and that fair prices in the long run are the best for all parties. The boys met again at one o\u0027clock, and adjourned to a cheap underground restaurant on Nassau Street, where they obtained what seemed to them a luxurious meal of beefsteak, with a potato, a small plate of bread, and a cup of what went by the name of coffee. The steak was not quite up to the same article at Delmonico\u0027s, and there might be some reasonable doubts as to whether the coffee was a genuine article; but as neither of the boys knew the difference, we may quote Ben\u0027s familiar phrase, and say, \"What\u0027s the odds?\" Indeed, the free and easy manner in which Ben threw himself back in his chair, and the condescending manner in which he assured the waiter that the steak was \"a prime article,\" could hardly have been surpassed in the most aristocratic circles. \"Well, Mark, have you had enough?\" asked Ben. \"Yes,\" said Mark. \"Well, I haven\u0027t,\" said Ben. \"I guess I\u0027ll have some puddin\u0027. Look here, Johnny,\" to the colored waiter, \"just bring a feller a plate of apple dump with both kinds of sauce.\" After giving this liberal order Ben tilted his chair back, and began to pick his teeth with his fork. He devoted himself with assiduity to the consumption of the pudding, and concluded his expensive repast by the purchase of a two-cent cigar, with which he ascended to the street. \"Better have a cigar, Mark,\" he said. \"No, thank you,\" said the match boy. \"I think I\u0027d rather not.\" \"Oh, you\u0027re feared of being sick. You\u0027ll come to it in time. All business men smoke.\" It is unnecessary to dwell upon the events of the afternoon. Mark was satisfied with the result of his morning\u0027s work, and waited about with Ben till the close of the afternoon, when the question came up, as to where the night should be passed. \"I guess we\u0027d better go to the Lodge,\" said Ben. \"Were you ever there?\" \"No,\" said Mark. \"Well, come along. They\u0027ll give us a jolly bed, all for six cents, and there\u0027s a good, warm room to stay in. Then we can get breakfast in the mornin\u0027 for six cents more.\" \"All right,\" said Mark. \"We\u0027ll go.\" The down-town Newsboys\u0027 Lodging House was at that time located at the corner of Fulton and Nassau Streets. It occupied the fifth and sixth stories of the building then known as the \"Sun\" building, owned by Moses S. Beach, the publisher of that journal. In the year 1868 circumstances rendered it expedient to remove the Lodge to a building in Park Place. It is to be hoped that at some day not far distant the Children\u0027s Aid Society, who carry on this beneficent institution, will be able to erect a building of their own in some eligible locality, which can be permanently devoted to a purpose so praiseworthy. Ben and Mark soon reached the entrance to the Lodge on Fulton Street. They ascended several flights of narrow stairs till they reached the top story. Then, opening a door at the left, they found themselves in the main room of the Lodge. It was a low-studded room of considerable dimensions, amply supplied with windows, looking out on Fulton and Nassau Streets. At the side nearest the door was a low platform, separated from the rest of the room by a railing. On this platform were a table and two or three chairs. This was the place for the superintendent, and for gentlemen who from time to time address the boys. The superintendent at that time was Mr. Charles O\u0027Connor, who still retains the office. Probably no one could be found better adapted to the difficult task of managing the class of boys who avail themselves of the good offices of the Newsboys\u0027 Home. His mild yet firm manner, and more than all the conviction that he is their friend, and feels a hearty interest in their welfare, secure a degree of decorum and good behavior which could hardly be anticipated. Oaths and vulgar speech, however common in the street, are rarely heard here, or, if heard, meet with instant rebuke. The superintendent was in the room when Ben and Mark entered. \"Well, Ben, what luck have you had to-day?\" said Mr. O\u0027Connor. \"Pretty good,\" said Ben. \"And who is that with you?\" \"Mother Watson\u0027s nephew,\" said Ben, with a grimace. \"He\u0027s only joking, sir,\" said Mark. \"My name is Mark Manton.\" \"I am glad to see you, Mark,\" said the superintendent. \"What is your business?\" \"I sell matches, sir.\" \"Have you parents living?\" \"No, sir; they are both dead.\" \"Where have you been living?\" \"In Vandewater Street.\" \"With any one?\" \"Yes, with a woman they call Mother Watson.\" \"Is she a relation of yours?\" \"No, sir,\" said Mark, hastily. \"What sort of a woman is she?\" \"Bad enough, sir. She gets drunk about every day and used to beat me with a strap when I did not bring home as much money as she expected.\" \"So you have left her?\" \"Yes, sir.\" \"Have you ever been up here before?\" \"No, sir.\" \"I suppose you know the rules of the place.\" \"Yes, sir; Ben has told me.\" \"You had better go and wash. We shall have supper pretty quick. Have you any money?\" \"Yes, sir.\" Mark took out his hoard of money, and showed it to the superintendent, who was surprised at the amount. \"How did you get so much?\" he asked. \"Part of it was given me,\" said Mark. \"What are you going to do with it? You don\u0027t need it all?\" \"Will you keep it for me, sir?\" \"I will put as much of it as you can spare into the bank for you. This is our bank.\" He pointed to a table beside the railing on the outside. The top of it was pierced with narrow slits, each having a number attached. Each compartment was assigned to any boy who desired it, and his daily earnings were dropped in at the end of the day. Once a month the bank was opened, and the depositor was at liberty to withdraw his savings if he desired it. This is an excellent arrangement, as it has a tendency to teach frugal habits to the young patrons of the Lodge. Extravagance is one of their besetting sins. Many average a dollar and over as daily earnings, yet are always ragged and out at elbows, and often are unsupplied with the small price of a night\u0027s lodging at the Home. The money is squandered on gambling, cigars, and theatre-going, while the same sum would make them comfortable and independent of charity. The disposition to save is generally the first encouraging symptom in a street boy, and shows that he has really a desire to rise above his circumstances, and gain a respectable position in the world. Ben, who had long frequented the Lodging House off and on, led the way to the washing-room, where Mark, to his satisfaction, was able to cleanse himself from the dust and impurity of the street. At Mother Watson\u0027s he had had no accommodations of the kind, as the old lady was not partial to water either internally or externally. He was forced to snatch such opportunities as he could find. \"Now,\" said Ben, \"we\u0027ll go into the gymnasium.\" A room opposite the main room had been fitted up with a few of the principal appliances of a gymnasium, and these were already in use by quite a number of boys. Mark looked on, but did not participate, partly from bashfulness, and partly because he did not very well understand the use of the different appliances. \"How do you like it?\" asked Ben. \"Very much,\" said Mark, with satisfaction. \"I\u0027m glad you brought me here.\" \"I\u0027ll show you the beds by and by,\" said Ben. The rooms on the floor below were used for lodging. Tiers of neat beds, some like those in a steamboat or a hospital, filled a large room. They were very neat in appearance, and looked comfortable. In order to insure their continuing neat, the superintendent requires such as need it to wash their feet before retiring to bed. The supper was of course plain, but of good quality and sufficient quantity. About nine o\u0027clock Mark got into the neat bed which was assigned him, and felt that it was more satisfactory even than the cabin of a Brooklyn ferry-boat. He slept peacefully except towards morning, when he dreamed that his old persecutor, Mother Watson, was about to apply the dreaded strap. He woke up terrified, but soon realized with deep satisfaction that he was no longer in her clutches.","sourceLink":"http://novel.tingroom.com/ertong/2990/82470.html","bookId":322,"book":{"id":322,"title":"Mark the Match Boy or Richard Hunter\u0027s Ward","description":"简介： Mark, the Match Boy, is the third volume of the Ragged Dick Series, and, like its predecessors, aims to describe a special phase of street life in New York. While it is complete in itself, several characters are introduced who have figured conspicuou...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2990","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
