{"id":20592,"no":17,"title":"CHAPTER XVI. MARK\u0027S FIRST IMPRESSIONS.","content":"Probably my readers already understand that the bookstore in which Mark has secured a place is the same in which Roswell Crawford is employed. This circumstance, if Mark had only known it, was likely to make his position considerably less desirable than it would otherwise have been. Mr. Baker, the proprietor of the store, was very considerate in his treatment of those in his employ, and Mr. Jones, his chief clerk, was good-natured and pleasant. But Roswell was very apt to be insolent and disagreeable to those who were, or whom he considered to be, in an inferior position to himself, while his lofty ideas of his own dignity and social position as the \"son of a gentleman,\" made him not very desirable as a clerk. Still he had learned something from his bad luck thus far. He had been so long in getting his present place, that he felt it prudent to sacrifice his pride in some extent for the sake of retaining it. But if he could neglect his duties without attracting attention, he resolved to do it, feeling that six dollars was a beggarly salary for a young gentleman of his position and capacity. It was unfortunate for him, and a source of considerable annoyance, that he could get no one except his mother to assent to his own estimate of his abilities. Even his Cousin Gilbert, who had been Rockwell \u0026 Cooper\u0027s book-keeper before Richard Hunter succeeded to the position, did not conceal his poor opinion of Roswell; but this the latter attributed to prejudice, being persuaded in his own mind that his cousin was somewhat inclined to be envious of his superior abilities. At the time that Mark was so suddenly engaged by Mr. Baker, Roswell had gone out to dinner. When he returned, Mark had gone out with the parcel to West Twenty-first Street. So they missed each other just at first. \"Well, Crawford,\" said Mr. Jones, as Roswell re-entered the store, \"Mr. Baker has engaged a new boy.\" \"Has he? What sort of a fellow is he?\" \"A little fellow. He doesn\u0027t look as if he was more than ten years old.\" \"Where is he?\" \"Mr. Baker sent him on an errand to Twenty-first Street.\" \"Humph!\" said Roswell, a little discontented, \"I was going to recommend a friend of mine.\" \"There may be a chance yet. This boy may not suit.\" In about five minutes Mr. Baker and Mr. Jones both went out to dinner. It was the middle of the day, when there is very little business, and it would not be difficult for Roswell to attend to any customers who might call. As soon as he was left alone, Roswell got an interesting book from the shelves, and, sitting down in his employer\u0027s chair, began to read, though this was against the rules in business hours. To see the pompous air with which Roswell threw himself back in his chair, it might have been supposed that he was the proprietor of the establishment, though I believe it is true, as a general rule, that employers are not in the habit of putting on so many airs, unless the position is a new one, and they have not yet got over the new feeling of importance which it is apt to inspire at first. While Roswell was thus engaged Mark returned from his errand. He looked about him in some uncertainty on entering the store, not seeing either Mr. Baker or the chief clerk. \"Come here,\" said Roswell, in a tone of authority. Mark walked up to the desk. \"So you are the new boy?\" said Roswell, after a close scrutiny. \"Yes.\" \"It would be a little more polite to say \u0027Yes sir.\u0027\" \"Yes, sir.\" \"What is your age?\" \"Ten years.\" \"Humph! You are rather young. If I had been consulted I should have said \u0027Get a boy of twelve years old.\u0027\" \"I hope I shall suit,\" said Mark. \"I hope so,\" said Roswell, patronizingly. \"You will find us very easy to get along with if you do your duty. We were obliged to send away a boy this morning because he played instead of going on his errands at once.\" Mark could not help wondering what was Roswell\u0027s position in the establishment. He talked as if he were one of the proprietors; but his youthful appearance made it difficult to suppose that. \"What is your name?\" continued Roswell. \"Mark Manton.\" \"Have you been in any place before?\" \"No, sir.\" \"Do you live with your parents?\" \"My parents are dead.\" \"Then whom do you live with?\" \"With my guardian.\" \"So you have a guardian?\" said Roswell, a little surprised. \"What is his name?\" \"Mr. Hunter.\" \"Hunter!\" repeated Roswell, hastily. \"What is his first name?\" \"Richard I believe.\" \"Dick Hunter!\" exclaimed Roswell, scornfully, \"Do you mean to say that he has charge of you?\" \"Yes,\" said Mark, firmly, for he perceived the tone in which his friend was referred to, and resented it. Moreover the new expression which came over Roswell\u0027s face brought back to his recollection the evening when, for the first time in his life, he had begged in Fulton Market, and been scornfully repulsed by Roswell and his mother. Roswell\u0027s face had at first seemed familiar to him, but it was only now that he recognized him. Roswell, on the other hand, was not likely to identify the neatly dressed boy before him with the shivering little beggar of the market. But it recurred to him all at once that Dick had referred to his ward as a match boy. \"You were a match boy?\" he said, in the manner of one making a grave accusation. \"Yes, sir.\" \"Then why didn\u0027t you keep on selling matches, and not try to get a place in a respectable store?\" \"Because Mr. Hunter thought it better for me to go into a store.\" \"Mr. Hunter! Perhaps you don\u0027t know that your guardian, as you call him, used to be a boot-black.\" \"Yes, he told me so.\" \"They called him \u0027Ragged Dick\u0027 then,\" said Roswell, turning up his nose. \"He couldn\u0027t read or write, I believe.\" \"He\u0027s a good scholar now,\" said Mark. \"Humph! I suppose he told you so. But you mustn\u0027t believe all he tells you.\" \"He wouldn\u0027t tell anything but the truth,\" said Mark, who was bolder in behalf of his friend than he would have been for himself. \"So he did tell you he was a good scholar? I thought so.\" \"No, he told me nothing about it; but since I have lived with him I\u0027ve heard him read French as well as English.\" \"Perhaps that isn\u0027t saying much,\" said Roswell, with a sneer. \"Can you read yourself?\" \"Yes.\" \"That is more than I expected. What induced Mr. Baker to take a boy from the street is more than I can tell.\" \"I suppose I can run errands just as well, if I was once a match boy,\" said Mark, who did not fancy the tone which Roswell assumed towards him, and began to doubt whether he was a person of as much importance as he at first supposed. \"We shall see,\" said Roswell, loftily. \"But there\u0027s one thing I\u0027ll advise you, young man, and that is, to treat me with proper respect. You\u0027ll find it best to keep friends with me. I can get you turned away any time.\" Mark hardly knew whether to believe this or not. He already began to suspect that Roswell was something of a humbug, and though it was not in his nature to form a causeless dislike, he certainly did not feel disposed to like Roswell. He did not care as much for any slighting remarks upon himself, as for the scorn with which Roswell saw fit to speak of his friend, Richard Hunter, who by his good offices had won the little boy\u0027s lasting gratitude. Mark did not reply to the threat contained in these last words of Roswell. \"Is there anything for me to do?\" he asked. \"Yes, you may dust off those books on the counter. There\u0027s the duster hanging up.\" This was really Roswell\u0027s business, and he ought to have been at work in this way instead of reading; but it was characteristic of him to shift his duties upon others. He was not aware of how much time had passed, and supposed that Mark would be through before Mr. Barker returned. But that gentleman came in while Roswell was busily engaged in reading. \"Is that the way you do your work, Roswell?\" asked his employer. Roswell jumped to his feet in some confusion. \"I thought I had better set the new boy to work,\" he said. \"Dusting the books is your work, not his.\" \"He was doing nothing, sir.\" \"He will have plenty to do in carrying out parcels. Besides, I don\u0027t know that it is any worse for him to be idle than you. You were reading also, which you know is against the rules of the store.\" Roswell made no reply, but it hurt his pride considerably to be censured thus in presence of Mark, to whom he had spoken with such an assumption of power and patronage. \"I wish I had a store of my own,\" he thought, discontentedly. \"Then I could do as I pleased without having anybody to interfere with me.\" But Roswell did not understand, and there are plenty of boys in the same state of ignorance, that those who fill subordinate positions acceptably are most likely to rise to stations where they will themselves have control over others. \"I suppose you have not been to dinner,\" said Mr. Baker, turning to Mark. \"No, sir.\" \"You board in St. Mark\u0027s Place, I think you said?\" \"Yes, sir.\" \"Very well, here is a parcel to go to East Ninth Street. You may call and leave that at the address marked upon it, and may stay out long enough for dinner. But don\u0027t be gone more than an hour in all.\" \"No, sir.\" \"I am glad that boy isn\u0027t my employer,\" thought Mark, referring of course to Roswell Crawford, who, by the way, would have been indignant at such an appellation. \"I like Mr. Baker a great deal better.\" Mark was punctual to his appointment, and in a little less than an hour reported himself at the store again for duty. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2990/82474.html","bookId":322,"book":{"id":322,"title":"Mark the Match Boy or Richard Hunter\u0027s Ward","description":"简介： Mark, the Match Boy, is the third volume of the Ragged Dick Series, and, like its predecessors, aims to describe a special phase of street life in New York. While it is complete in itself, several characters are introduced who have figured conspicuou...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2990","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
