{"id":20596,"no":21,"title":"CHAPTER XX. THE MADISON CLUB.","content":"Two days afterwards, when Roswell as usual met his friend Ralph, the latter said, with an air of importance:— \"I\u0027ve got news for you, Roswell.\" \"What is it?\" inquired Roswell. \"You\u0027ve been unanimously elected a member of our club.\" \"Your club?\" \"Yes; didn\u0027t I ever mention it to you?\" \"No.\" \"Well, I believe I didn\u0027t. You see I intended to propose your name as a member, and not feeling certain whether you would be elected, I thought I had better not mention it to you.\" \"What is the name of the club?\" asked Roswell, eagerly. \"The Madison Club.\" \"What made you call it that?\" \"Why, you see, there\u0027s one fellow in the club that lives on Madison Avenue, and we thought that would be an aristocratic name, so we chose it.\" Roswell liked whatever was aristocratic, and the name pleased him. \"Did you say I was unanimously elected, Ralph?\" he asked. \"Yes; I proposed your name at our meeting last night. It was on account of that, that I couldn\u0027t meet you as usual. But hereafter we can go together to the meetings.\" \"How many fellows belong?\" \"Twenty. We don\u0027t mean to have more than twenty-five. We are quite particular whom we elect.\" \"Of course,\" said Roswell, in a tone of importance. \"You wouldn\u0027t want a set of low fellows like that Dick Hunter.\" \"No. By the way, I\u0027ve got somewhere your notification from the secretary. Here it is.\" He drew from his pocket a note adorned with a large and elaborate seal, which Roswell, opening found read as follows:— \"MADISON CLUB. \"Mr. Roswell Crawford. \"Sir:—I have the honor of informing you that at the last regular meeting of the Madison Club you were unanimously elected a member. \"Yours respectfully, \"James Tracy.\" This document Roswell read with much satisfaction. It sounded well to say that he was a member of the Madison Club, and his unanimous election could only be regarded as a high compliment. \"I will join,\" he said, pompously. \"When is the next meeting?\" \"Next Tuesday evening.\" \"Where does the society meet?\" \"In a room on Fourth Avenue. You can come round early, and we will go together.\" \"All right. What do you do at the meetings?\" \"Well, we smoke, and tell stories, and have a good time. Generally there are some eatables provided. However, you\u0027ll know all about it, when you join. Oh, by the way, there\u0027s one thing I forgot to tell you,\" added Ralph. \"There\u0027s an initiation fee of five dollars.\" \"A fee of five dollars!\" repeated Roswell, soberly. \"Yes.\" \"What is it for?\" \"To defray expenses, of course. There\u0027s the rent, and lights, and stationery, and the eatables. They always, I think, have an initiation fee at clubs.\" \"Are there any other expenses?\" \"Not much. There\u0027s only a dollar a month. That isn\u0027t much.\" \"I don\u0027t know how I\u0027m going to raise the five dollars,\" said Roswell, soberly. \"I could manage the dollar a month afterwards.\" \"Oh, you\u0027ll think of some way,\" said Ralph. \"My mother wouldn\u0027t give it to me, so there\u0027s no use asking her.\" \"Why can\u0027t you pay it out of your extra wages?\" said Ralph, significantly. \"I shouldn\u0027t dare to take such a large sum,\" said Roswell. \"They would find me out.\" \"Not if you\u0027re careful.\" \"They don\u0027t keep but a few dollars in the drawer at one time.\" \"But didn\u0027t you tell me there was another drawer?\" \"Yes; but that is always kept locked.\" \"Open it then.\" \"I have no key.\" \"Get one that will fit it then.\" \"I don\u0027t like to do that.\" \"Well, it\u0027s nothing to me,\" said Ralph, \"only I should like to have you belong to the club, and you can\u0027t unless you are able to pay the initiation fee.\" \"I would like very much to belong,\" said Roswell, irresolutely. \"I know you would enjoy it. We have splendid times.\" \"I\u0027ll see what I can do to raise the money,\" said Roswell. \"That\u0027s the way to talk. You\u0027ll manage to get it some way.\" It was a great temptation to Roswell. The more he thought of it, the more he thought he should like to say that he was a member of the Madison Club. He had a weak love of gentility, and he was persuaded that it would improve his social standing. But he did not wish to adopt the course recommended by Ralph if there was any other way of getting the money. He determined, therefore, first to make the effort to obtain the money from his mother on some pretext or other. By the time he reached home, which was at an earlier hour than usual, he had arranged his pretext. \"I am glad you are home early,\" said Mrs. Crawford. \"Yes, I thought I\u0027d come home early to-night. Mother, I wish you\u0027d let me have four dollars.\" \"What for, Roswell?\" \"I want to buy a new hat. This one is getting shabby.\" Roswell\u0027s plan was, if he could obtain the four dollars from his mother, to make up the extra dollar out of sales unaccounted for. As to the failure to buy the hat, he could tell his mother that he had lost the money, or make some other excuse. That thought did not trouble him much. But he was not destined to succeed. \"I am sorry you are dissatisfied with your hat, Roswell,\" said Mrs. Crawford, \"for I cannot possibly spare you the money now.\" \"So you always say,\" grumbled Roswell. \"But it\u0027s true,\" said his mother. \"I\u0027m very short just now. The rent comes due in a few days, and I am trying hard to get together money enough to pay it.\" \"I thought you had money coming in from your lodgers.\" \"There\u0027s Mr. Bancroft hasn\u0027t paid me for six weeks, and I\u0027m afraid I am going to lose his room-rent. It\u0027s hard work for a woman to get along. Everybody takes advantage of her,\" said Mrs. Crawford, sighing. \"Can\u0027t you possibly let me have the money by Saturday, mother?\" \"No, Roswell. Perhaps in a few weeks I can. But I don\u0027t think your hat looks bad. You can go and get it pressed if you wish.\" But Roswell declared that wouldn\u0027t do, and left the room in an ill-humor. Instead of feeling for his mother, and wishing to help her, he was intent only upon his own selfish gratifications. So much, then, was plain,—in his efforts to raise the money for the initiation fee at the club, he could not expect any help from his mother. He must rely upon other means. Gradually Roswell came to the determination to follow the dangerous advice which had been proffered him by Ralph Graham. He could not bear to give up the project of belonging to the club, and was willing to commit a dishonest act rather than forego the opportunity. He began to think now of the manner in which he could accomplish what he had in view. The next day when noon came he went round to the locked drawer, and, lighting a piece of sealing-wax which he had taken from one of the cases, he obtained a clear impression of the lock. \"I think that will do,\" thought Roswell. At that moment a customer entered the store, and he hurried the stick of sealing-wax into his pocket. When the store closed, Roswell went round to a locksmith, whose sign he remembered to have seen in Third Avenue. He entered the shop with a guilty feeling at his heart, though he had a plausible story arranged for the occasion. \"I want a key made,\" he said, in a business-like manner; \"one that will fit this lock.\" Here he displayed the wax impression. \"What sort of a lock is it?\" asked the locksmith, looking at it. \"It is a bureau drawer,\" said Roswell. \"We have lost the key, and can\u0027t open it. So I took the impression in wax. How soon can you let me have it?\" \"Are you in a hurry for it?\" \"Yes; didn\u0027t I tell you we couldn\u0027t open the drawer?\" \"Well, I\u0027ll try to let you have it by to-morrow night.\" \"That will do,\" said Roswell. He left the locksmith\u0027s shop with mixed feelings of satisfaction and shame at the thought of the use to which he was intending to put the key. It was a great price he had determined to pay for the honor of belonging to the Madison Club. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2990/82478.html","bookId":322,"book":{"id":322,"title":"Mark the Match Boy or Richard Hunter\u0027s Ward","description":"简介： Mark, the Match Boy, is the third volume of the Ragged Dick Series, and, like its predecessors, aims to describe a special phase of street life in New York. While it is complete in itself, several characters are introduced who have figured conspicuou...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2990","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
