{"id":71010,"no":10,"title":"Page 10","content":"When Sean didn’t answer, she dialed her home number into his cell phone. It rang and rang, not going to voice mail—they hadn’t set up the answering machine yet. Next she dialed her dad’s number at school—it was almost five, and he had posted his 3:30–5:30 office hours on the refrigerator. It rang and rang too.\n The spots started to flash in front of Aria’s eyes again as she imagined where he could be…or who he could be with. She leaned forward over her bare legs, trying to breathe deeper. Frère Jacques, she chanted silently.\n “Whoa,” Sean said, his voice sounding very far away.\n “I’m all right,” Aria called, her voice muffled in her legs. “I just have to…”\n She heard Sean fumbling around. Then he pressed a Burger King bag into her hands. “Breathe into this. I think there were some fries in there. Sorry about that.”\n Aria put the bag over her mouth and slowly inflated and deflated it. She felt Sean’s warm hand on the middle of her back. Slowly, the dizziness started to fade. When she raised her head, Sean was looking at her anxiously.\n “Panic attacks?” he asked. “My stepmom gets them. The bag always works.”\n Aria crumpled the bag in her lap. “Thanks.”\n “Something bothering you?”\n Aria shook her head quickly. “No, I’m cool.”\n “C’mon,” Sean said. “Isn’t that, like, why people get panic attacks?”\n Aria pressed her lips together. “It’s complicated.” Besides, she wanted to say, since when are typical Rosewood boys interested in weird girls’ problems?\n Sean shrugged. “You were friends with Alison DiLaurentis, right?”\n Aria nodded.\n “It’s weird, isn’t it?”\n “Yeah.” She cleared her throat. “Although, um, it’s not weird in the way you might think. I mean, it is weird in that way, but it’s weird in other ways, too.”\n “Like how?”\n She shifted; her wet underwear was starting to itch. Today at school it had felt like everyone was speaking to her in babyish whispers. Did they think that if they spoke in normal-person volume, Aria would have an insta-breakdown?\n “I just wish everyone would leave me alone,” she managed. “Like last week.”\n Sean flicked the pine tree air freshener that hung from the rearview mirror, making it swing. “I know what you mean. When my mom died, everyone thought that if I had a second to myself, I’d lose it.”\n Aria sat up straighter. “Your mom died?”\n Sean looked at her. “Yeah. It was a long time ago. Fourth grade.”\n “Oh.” Aria tried to remember Sean from fourth grade. He had been one of the shortest kids in the class, and they’d been on the same kickball team a bunch of times, but that was it. She felt bad for being so oblivious. “I’m sorry.”\n A silence passed. Aria crossed and uncrossed her bare legs. The car had begun to smell like her skirt’s wet wool. “It was tough,” Sean said. “My dad went through all these girlfriends. I didn’t even like my stepmom at first. I got used to her, though.”\n Aria felt her eyes well up with tears. She didn’t want to get used to her family changing. She let out a loud sniff.\n Sean leaned forward. “You sure you can’t talk about it?”\n Aria shrugged. “It’s supposed to be a secret.”\n “Tell you what. How about if you tell me your secret, I’ll tell you mine?”\n “All right,” Aria quickly agreed. The truth was, she was dying to talk about this. She would’ve admitted it to her old friends, but they were so tight-lipped about their own A secrets, it made Aria feel even weirder about revealing hers. “But you can’t say anything.”\n “Absolutely.”\n And then Aria told him about Byron and Ella, Meredith, and what she and Mike had seen at the bar yesterday. It all just came spilling out. “I don’t know what to do,” she finished. “I feel like I’m the one who has to keep everyone together.”\n Sean was quiet, and Aria was afraid he’d stopped listening. But then he raised his head. “Your dad shouldn’t be putting you in that position.”\n “Yeah, well.” Aria glanced at Sean. If you got past his tucked-in shirt and khaki shorts, he was actually pretty cute. He had really pink lips and knobby, imperfect fingers. From the way his polo shirt fit snugly against his chest, she guessed he was in tip-top soccer boy shape. She suddenly felt incredibly self-conscious. “You’re easy to talk to,” Aria said shyly, staring at her naked knees. She’d missed a few hairs on her knees when shaving. It usually didn’t matter, but it sort of did now. “So, um, thanks.”\n “Sure.” When Sean smiled, his eyes got crinkly and warm.\n “This definitely isn’t how I imagined spending my afternoon,” Aria added. The rain was still pelting the windshield, but the car had gotten really warm while she’d been talking.\n “Me neither.” Sean looked out the window. The rain had started to subside. “But…I don’t know. It’s kind of cool, right?”\n Aria shrugged. Then she remembered. “Hey, you promised me a secret! It better be good.”\n “Well, I don’t know if it’s good.” Sean leaned toward Aria, and she scooted closer. For a crazy second, she thought they might kiss.\n “So, I’m in this thing called V Club,” Sean whispered. His breath smelled like Altoids. “Do you know what that is?”\n “I guess.” Aria tried to keep her lips from wriggling into a smirk. “It’s the no-sex-till-marriage thing, right?”\n “Right.” Sean leaned back. “So…I’m a virgin. Except…I don’t know if I want to be one anymore.”\n 9\n SOMEONE’S ALLOWANCE JUST GOT A WHOLE LOT SMALLER\n On Wednesday afternoon, Mr. McAdam, Spencer’s AP economics teacher, strolled up and down the aisles, peeling papers off a stack and putting them facedown on each student’s desk. He was a tall man with bulging eyes, a sloped nose, and a paunchy face. A few years ago, one of his top students had remarked that he looked like Squidward from SpongeBob SquarePants, and the name stuck. “A lot of these quizzes were very good,” he murmured.\n Spencer straightened up. She did what she always did when she wasn’t sure how she’d done on a test: She thought of the rock-bottom grade she could get, a grade that would still ensure she had an A for the class. Usually, the grade in her mind was so low—although low for Spencer was a B plus or, at the very worst, a B—that she ended up being pleasantly surprised. B plus, she told herself now, as Squidward put the test on her desk. That’s rock-bottom. Then she turned it over.\n B minus.\n Spencer dropped the paper to her desk as if it were on fire. She scanned the quiz for answers that Squidward had graded incorrectly, but she didn’t know the answers to the questions that had big red X marks next to them.\n Okay, so maybe she hadn’t studied enough.\n When they’d taken the quizzes yesterday, all she’d been able to think about while filling in the multiple choice bubbles were a) Wren and how she could never see him, b) her parents and Melissa and how she could get them to love her again, c) Ali, and d), e), f), and g), her festering Toby secret.\n The Toby torture was insane. But what could she do—go to the cops? And tell them…what? Some kid said, I’ll get you, to me four years ago, and I think he killed Ali and I think he’s going to kill me? I got a text that said my friends and I were in danger? The cops would laugh and say she’d been snorting too much Ritalin. She was afraid, too, to tell her friends what was going on. What if A was serious and something happened to them if she did?\n “How’d you do?” a voice whispered.\n Spencer jumped. Andrew Campbell sat next to her. He was as big an overachiever as she was. He and Spencer were ranked number one and number two in the class, and they were always switching positions. His quiz was proudly faceup on his desk. A big red A plus was at the top of it.\n Spencer pulled her own quiz to her chest. “Fine.”\n “Cool.” A lock of Andrew’s long lion’s mane of blond hair fell in his face.\n Spencer gritted her teeth. Andrew was notoriously nosy. She’d always thought it was just a symptom of his über-competitiveness, and then last week, she wondered if he might be A. But while Andrew’s earnest interest in the minutiae of Spencer’s life was suspect, she didn’t think he had it in him. Andrew had helped Spencer the day the workers discovered Ali’s body, covering her up with a blanket when she was in shock. A wouldn’t do something like that.\n As Squidward gave them their homework assignment, Spencer looked at her notes. Her handwriting, which was normally squeezed neatly in the lines, had wavered all over the page. She began to quickly recopy the notes, but the bell interrupted her, and Spencer sheepishly rose to leave. B minus.\n “Miss Hastings?”\n She looked up. Squidward was gesturing her toward his desk. She walked over, straightening her navy Rosewood Day blazer and taking extra caution not to trip in her caramel-colored kidskin riding boots. “You’re Melissa Hastings’s sister, yes?”\n Spencer felt her insides wilt. “Uh-huh.” It was obvious what was coming next.\n “This is quite a treat for me, then.” He tapped his mechanical pencil on his desk. “It was such a pleasure to have Melissa in class.”\n I’m sure, Spencer growled to herself.\n “Where is Melissa now?”\n Spencer gritted her teeth. At home, hogging up all our parents’ love and attention. “She’s at Wharton. Getting her MBA.”\n Squidward smiled. “I always knew she’d go to Wharton.” Then he gave Spencer a long look. “The first set of essay questions is due next Monday,” he said. “And I’ll give you a hint: the supplemental books I’ve mentioned on the syllabus will help.”\n “Oh.” Spencer felt self-conscious. Was he giving her a tip because she’d gotten a B minus and he felt sorry for her, or because she was Melissa’s sister? She squared her shoulders. “I was planning to get them anyway.”\n Squidward looked at her evenly. “Well, good.”\n Spencer trudged into the hall, feeling unhinged. Normally, she could kiss ass with the best of them, but Squidward made her feel like she was at the bottom of the class.\n It was the end of the day. Rosewood students were bustling around their lockers, dragging books into their bags, making plans on their cell phones, or getting their gear for sports practice. Spencer had field hockey at three, but she wanted to hit Wordsmith’s for Squidward’s books first. Then, after that, she had to check in with the yearbook staff, see what was up with the Habitat for Humanity volunteer list, and say hi to the drama club advisor. She might be a couple minutes late to hockey, but what could she do?\n As she pushed through the door of Wordsmith’s Books, she instantly felt calmer. The store was always quiet, with no obsequious salespeople shooing you out. After Ali disappeared, Spencer used to come in here and read Calvin and Hobbes comic books just to be alone. The staff didn’t get pissy when cell phones rang, either, which was exactly what Spencer’s was doing right now. Her heart pounded…and then pounded in a different way when she saw who it was. \n","sourceLink":"https://allnovel.net/flawless-pretty-little-liars-2/page-10.html","bookId":2379,"book":{"id":2379,"title":"Flawless (Pretty Little Liars #2)","description":"Storyline: \n Flawless (Pretty Little Liars #2) \n In the exclusive town of Rosewood, Pennsylvania, where the sweetest smiles hide the darkest secrets, four pretty little liars--Spencer, Aria, Emily, and Hanna--have been very bad girls. . . . \n Spencer stole her sister\u0027s boyfriend. Aria is brokenhearted over her English teacher. Emily likes her new friend Maya . . . as much more than a friend. And Hanna\u0027s obsession with looking flawless is literally making her sick. But the most horrible secret of all is something so scandalous it could destroy their perfect little lives. \n And someone named \"A\" is threatening to do just that. \n At first they thought A was Alison, their friend who vanished three years ago . . . but then Alison turned up dead. So could A be Melissa, Spencer\u0027s ultracompetitive sister? Or Maya, who wants Emily all to herself? What about Toby, the mysterious guy who left town right after Alison went missing? \n One thing\u0027s for certain: A\u0027s got the dirt to bury them all alive, and with every crumpled note, wicked IM, and vindictive text message A sends, the girls get a little closer to losing it all.\n \n","cover":"https://allnovel.net/images/flawless-pretty-little-liars-2.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/flawless-pretty-little-liars-2.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:18:33 AM"}}
