{"id":71031,"no":31,"title":"Page 31","content":"Emily couldn’t believe all that had just spilled from her mouth. She turned to Toby. His mouth was a fixed, impassive line. She thought maybe that if there was a time to admit that he’d been Ali’s boyfriend, now would be it. Instead, he said quietly, “Why are you so afraid to admit that?” “Because!” Emily laughed. Wasn’t it obvious? “Because I don’t want to be…you know. Gay.” And then, in a quieter voice: “Everyone would make fun of me.” They rolled up to a deserted two-way stop sign. Instead of pausing and rolling through, Toby put the car into park. Emily was puzzled. “What are we doing?” Toby took his hands off the steering wheel and stared at Emily for a long time. So long, Emily began to feel uncomfortable. He seemed upset. She touched the back of her neck, then turned away and looked out the window. The road was silent and dead and paralleled yet another cornfield, one of Rosewood’s biggest. The rain was coming down harder now, and because Toby didn’t turn on the windshield wipers, everything was blurry. She wished, suddenly, for civilization. For a car to drive by. A house to appear. A gas station. Something. Was Toby upset because he liked her, and she’d just come halfway out of the closet? Was Toby homophobic? This was what she would have to deal with, if she really thought she was gay. People would probably do this to her every day of her life. “You’ve never been on that end of it, have you?” Toby finally asked. “You’ve never had anyone make fun of you.” “N-No…” She searched Toby’s face, trying to understand his question. “I guess not. Well, not until Ben, anyway.” Thunder cracked overhead, and she jumped. Then she saw a zigzag of lightning, slashing across the sky a few miles ahead of them. It lit things up for a moment, and Emily could see Toby frowning, picking at a button on his jacket. “Seeing all those people tonight just made me realize how hard it used to be, living in Rosewood,” he said. “People used to really hate me. But tonight, everyone was so nice—all these people who used to make fun of me. It was sickening. It was like it had never happened.” He wrinkled his nose. “Do they not realize what assholes they were?” “I guess not,” Emily said, feeling uneasy. Toby glanced at her. “I saw one of your old friends there. Spencer Hastings.” Lightning flashed again, making Emily jump. Toby smiled crookedly. “You guys were such a clique, back then. You really let people have it. Me…my sister…” “We didn’t mean to,” Emily said, on instinct. “Emily.” Toby shrugged. “You did. And why not? You were the most popular girls in school. You could.” His voice was sharply sarcastic. Emily tried to smile, hoping that this was a joke. Only Toby didn’t smile back. Why were they talking about this? Weren’t they supposed to be talking about Emily being gay? “I’m sorry. We just…We were so stupid. We did what Ali wanted us to do. And I mean, I thought you were over that, since you and Ali got together that next year—” “What?” Toby interrupted sharply. Emily backed against the window. Her chest burned with adrenaline. “You…you weren’t fooling around with Ali in, um, seventh grade?” Toby looked horrified. “It was hard for me even to see her,” he said quietly. “Now it’s hard for me even to hear her name.” He put his palms to his forehead and let out a huge breath. When he faced her again, his eyes were dark. “Especially after…after what she did.” Emily stared at him. Lightning flashed again, and a stiff wind kicked up, making the cornstalks sway. They looked like hands, desperately reaching out for something. “Wait, what?” She laughed, hoping—praying—she’d heard him wrong. Praying that she’d blink, and the night would right itself and go back to being normal. “I think you heard me,” Toby said in a flat, emotionless tone. “I know you were friends and you loved her and whatever, but personally, I’m glad that bitch is dead.” Emily felt like someone had sucked all the oxygen out of her body. Something’s going to happen to you tonight. Something life-changing. You really let people have it. Me…my sister… It’s hard for me even to hear her name. Especially after what she did… AFTER WHAT SHE DID. I’m glad that bitch is dead. Toby…knew? A crack started to form in her brain. He did know. She was sure of it, more certain than she’d ever been of anything in her life. Emily felt as if she’d always known this, that it had been right in front of her face, but she’d been trying to just ignore it. Toby knew what they’d done to Jenna, but A hadn’t told him. He’d known for a very long time. And he must have hated Ali for it. He must have hated all of them, if he knew they were all involved. “Oh my God,” Emily whispered. She pulled at the door handle, gathering her dress in her hands as she stepped out of the car. The rain hit her immediately and felt like needles. Of course there was something suspicious about Toby being friendly to her. He wanted to ruin Emily’s life. “Emily?” Toby unbuckled his seat belt. “Where are you—” Then she heard the engine roar. Toby was driving down the road toward her, the passenger door wide open. She looked right and left, and then, hoping she knew where she was, she dove into the cornfield, not even caring that she was getting absolutely soaked. “Emily!” Toby called again. But Emily kept running. Toby killed Ali. Toby was A. 31 LIKE HANNA WOULD STEAL AN AIRPLANE—SHE DOESN’T EVEN KNOW HOW TO FLY! Hanna pushed her way through crowds of kids, hoping to see Emily’s familiar reddish-blond hair. She found Spencer and Aria by the oversize windows, talking to Gemma Curran, one of Emily’s swimming teammates. “She was here with that guy from Tate, right?” Gemma pursed her lips and tried to think. “I’m pretty sure I saw them leave.” Hanna exchanged uneasy glances with her friends. “What are we going to do?” Spencer whispered. “It’s not like we have any idea where they’re going.” “I tried calling her,” Aria said. “But her phone just kept ringing.” “Oh my God,” Spencer said, her eyes filling up with tears. “Well, what did you expect?” Aria said through her teeth. “You’re the one who let this happen.” Hanna couldn’t remember Aria ever being this angry. “I know,” Spencer repeated. “I’m sorry.” A huge boom interrupted them. Everyone looked outside to see the trees blowing sideways and rain coming down in sheets. “Shit,” Hanna heard a girl say next to her. “My dress is going to be ruined.” Hanna faced her friends. “I know someone who can help us. A cop.” She looked around, half-expecting Officer Wilden, the guy who’d arrested Hanna for stealing a Tiffany bracelet and Mr. Ackard’s car and who’d gotten it on with her mom—to be at Foxy tonight. But the guys guarding the exits and the jewelry auction were the Foxhunting League’s private security team—only if something devastating happened would they call in the cops. Last year, a Rosewood Day senior drank too much and ran off with a David Yurman bracelet that was up for auction, and even then they’d only left a tactful message on the boy’s family’s voice mail, saying that they’d like it back by the next day. “We can’t go to the cops,” Spencer hissed. “The way the one cop was acting with me this morning, I wouldn’t be surprised if they thought we killed Ali.” Hanna stared up at the giant crystal chandelier on the ceiling. A couple kids were tossing their napkins at it, trying to get the crystals to swing. “But I mean, your note pretty much says, I’m gonna hurt you, right? Isn’t that enough?” “It’s signed A. And it said that we hurt him. How would we explain that?” “But how do we make sure she’s all right?” Aria asked, pulling up her polka-dotted dress. Hanna noted bitterly that the side zipper was still partially down. “Maybe we should drive by her house,” Spencer suggested. “Sean and I could go right now,” Aria volunteered. Hanna’s jaw dropped. “You’re telling Sean about this?” “No,” Aria shouted, over the swells of Natasha Bedingfield and the pounding rain. Hanna could even see it fogging up the hall’s skylight, thirty feet above their heads. “I won’t tell him anything. Or I don’t know how I’ll explain it. But he won’t know.” “So are you and Sean going to any after-parties?” Hanna pried. Aria looked at her crazily. “You think I’d go to an after-party after all this?” “Yeah, but if this hadn’t happened, would you have gone?” “Hanna.” Spencer put her cool, thin hand on Hanna’s shoulder. “Let it go.” Hanna gritted her teeth, grabbed a glass of champagne from a waitress’s tray, and belted it down. She couldn’t let it go. It wasn’t possible. “You check out Emily’s house,” Spencer said to Aria. “I’ll keep calling her.” “What if we drive by Emily’s and Toby is with her?” Aria asked. “Do we confront him? I mean…if he is A…?” Hanna exchanged an uneasy glance with the others. She wanted to kick Toby’s ass—how had he found out about Kate? Her father? Her arrests? How Sean had broken up with her and that she made herself puke? How dare he try to bring her down! But she was also afraid. If Toby was A—if he knew—then he really would want to hurt them. It made…sense. “We should just concentrate on making sure Emily’s safe,” Spencer said. “How about, if we don’t hear from her soon, we call the police and leave an anonymous tip. We could say we saw Toby hurt her. We wouldn’t have to get into the specifics.” “If the cops come looking for him, he’ll know it was us,” Hanna reasoned. “And then what if he tells them about Jenna?” She could picture herself in juvenile hall, wearing an orange jumpsuit and talking to her father through a wall of glass. “Or what if he comes after us?” Aria asked. “We’ll have to find her before that happens,” Spencer interrupted. Hanna looked at the clock. Ten-thirty. “I’m out.” She strode toward the door. “I’ll call you, Spencer.” She didn’t say anything to Aria. She couldn’t even look at Aria. Or the giant hickey on her neck. As she was leaving, Naomi Zeigler grabbed her hand. “Han, about what you said to me yesterday at the soccer game.” She had the large-eyed, empathetic look of a talk-show host. “There are bulimia support groups. I could help you find one.” “Fuck off,” Hanna said, and brushed past her. By the time Hanna collapsed on the Philadelphia-bound SEPTA train, totally soaked from running from the cab to the train, her head felt heavy. In every reflection, a shadowy chimera of her seventh-grade self winked back. She shut her eyes.","sourceLink":"https://allnovel.net/flawless-pretty-little-liars-2/page-31.html","bookId":2379,"book":{"id":2379,"title":"Flawless (Pretty Little Liars #2)","description":"Storyline: Flawless (Pretty Little Liars #2) In the exclusive town of Rosewood, Pennsylvania, where the sweetest smiles hide the darkest secrets, four pretty little liars--Spencer, Aria, Emily, and Hanna--have been very bad girls. . . . Spencer stole her sister\u0027s boyfriend. Aria is brokenhearted over her English teacher. Emily likes her new friend Maya . . . as much more than a friend. And Hanna\u0027s obsession with looking flawless is literally making her sick. But the most horrible secret of all is something so scandalous it could destroy their perfect little lives. And someone named \"A\" is threatening to do just that. At first they thought A was Alison, their friend who vanished three years ago . . . but then Alison turned up dead. So could A be Melissa, Spencer\u0027s ultracompetitive sister? Or Maya, who wants Emily all to herself? What about Toby, the mysterious guy who left town right after Alison went missing? One thing\u0027s for certain: A\u0027s got the dirt to bury them all alive, and with every crumpled note, wicked IM, and vindictive text message A sends, the girls get a little closer to losing it all.","cover":"https://allnovel.net/images/flawless-pretty-little-liars-2.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/flawless-pretty-little-liars-2.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:18:33 AM"}}
