{"id":92495,"no":54,"title":"Page 54","content":"\\n\\n One of the residents put five stitches in the glass cut on LaMastra’s jaw, and nurses handed out ice packs to Crow and Ferro. Val was hurt, too, but not in a way that required treatment. She sat in Crow’s ER unit and just stared into the middle distance, and Crow could guess what she was seeing. When the ER docs were done with him, Crow dragged a chair over and sat down next to Val, pulling her close, whispering soothing words to her over and over again.\\n\\n “I’m so sorry, baby…but you did what you had to do.”\\n\\n It was maybe the fiftieth time he said that during the four hours they were in the ER, and Val finally pushed herself back and Crow could see the fierce hurt in her eyes. Pitching her voice low, she said, “I know that, damn it!”\\n\\n Crow’s next words died on his tongue.\\n\\n “I know what I did was right. God, Crow…do you think I’m sitting here torn up with self-loathing for what happened? I thought you knew me by now.”\\n\\n She turned her angry face away and stared at the wall for a while.\\n\\n Crow almost said, “I’m sorry,” but didn’t. He was learning.\\n\\n After a while she turned back. Her eyes were as cold as any Crow had ever seen.\\n\\n “Honey…listen to me. Do you understand what I’m feeling? Can you guess what’s tearing me up inside?”\\n\\n He took a moment with that, then said, “Yeah, I think I can.” He licked his lips. “You want to find Ruger, don’t you?”\\n\\n “Yes,” she said in an almost inhuman whisper, filled with urgency. “If he’s still alive, if he’s one of them, then yes, I want to find him.”\\n\\n “And Griswold?”\\n\\n “Yes!” she hissed, and took his hands in hers, squeezing them with painful force. “Dear God in Heaven, but I want to find them and I want to make them pay!”\\n\\n Crow nodded slowly and bent and kissed her hands.\\n\\n “Then that’s what we’re going to do.”\\n\\n 3\\n\\n Newton and Jonatha left the hospital and headed back to her hotel room. During the short drive neither said a word, and they remained silent until she had closed and locked her door. She engaged both locks and then stepped aside as Newton dragged over one of the room’s two overstuffed chairs and wedged its back under the doorknob. When he gave it a shake and saw how steady it was, she nodded. Then they checked the window. It was a big picture window and was not designed to be opened. The glass was thick and heavy; there was no balcony, so no need for a sliding door. There were no other windows or doors in the room.\\n\\n Jonatha went around and turned on all the lights. They turned on the television and sat there, she on the edge of her bed, Newton on the other chair. Newton channel surfed. They watched Everybody Hates Chris and even though the studio audience was howling, neither of them cracked so much as a smile. They watched some of Deal or No Deal. They watched ten minutes of a Patriots-Vikings game on ESPN though neither of them knew a thing about football. They watched The Dog Whisperer. They took none of it in. They didn’t speak at all.\\n\\n At around ten-thirty Jonatha got up and went into the bathroom. She closed the door and was in there for a long time. Newton could hear the shower running and it made him look at his own hands and clothes. He was filthy. He reeked of garlic and stank of sweat and dried blood. His head hurt terribly where he had struck the floor. He hurt all over. Inside and out.\\n\\n They had seen a vampire. An actual vampire. Not a hypothetical one, but right there in the flesh. It had touched him. Newton felt unbearably unclean.\\n\\n In his mind it wasn’t Val’s brother—Newton had only ever seen him a few times around town and didn’t know him—but even if he had he was sure that what he had seen tonight was not Mark Guthrie. This had been a monster.\\n\\n He shivered once, then again, and the second time it was a whole frigid body ripple that popped gooseflesh along his skin, stood his hair up on end, and made him feel desperately cold to the core of his being. “Oh God…,” he moaned, but his teeth were chattering so bad they sounded like knuckles knocking on glass.\\n\\n Newton didn’t hear the bathroom door open. “Newt…?”\\n\\n He turned at the sound of her voice; Jonatha stood there in a blue terrycloth robe that was pulled close at the throat and cinched tight around her waist. She came and knelt next to him. “What’s wrong?”\\n\\n He opened his mouth, tried to tell her that he was cold, tried to tell her that she looked beautiful, tried to tell her that it was all over, tried to tell her that he was sorry. A dozen thoughts collided in his head and none of them made it to his lips. His teeth were chattering so bad he couldn’t talk.\\n\\n Jonatha grabbed the comforter off the bed and wrapped it around Newton even as she pulled him down out of the chair and onto the floor, pulled him close, wrapped him up in a cocoon of the blanket and her own radiant heat. He did not embrace her, or cling to her; but he let himself be gathered in, shivering and shaking as the waves of shock crashed over him. She kept pulling him close and kept shimmying away from the chair until they were both tucked into the corner formed by the big wooden breakfront that served as TV stand and bureau and the wall. Jonatha pulled the blanket tighter and tighter around them and then pulled it over their heads just as the shivers started to hit her, too.\\n\\n 4\\n\\n Ten-thirty on Mischief Night, and the town was lost in a sea of sound and movement. Beyond the parking lot and the iron fences the town was in full revel as Mischief Night burned its way toward midnight. Music blared from the streetlight-hung speakers. Traffic was stopped on Corn Hill to allow a continuous rolling block party. It was Mischief Madness \u0026 Mayhem, Pine Deep’s legendary night before Halloween blast, modeled after Mardi Gras and powered by the lingering real-world adrenaline rush of the post–Ruger and Boyd massacre. Instead of driving tourists away, now that the killings were over, the town attracted three times the usual number of merrymakers; everyone wanted to suck in a chestful of real danger, real mystery, real frights—so long as they didn’t actually get hurt and there was beer.\\n\\n The entire starting lineup of the Pine Deep Scarecrows, wearing only their football helmets, streaked down ten blocks of Corn Hill and then scattered into the crowds, which opened to receive them. Everyone loved it.\\n\\n BK and Billy Christmas held court at the banquet hall at Harvestman Inn. BK was at the head table, flanked by two screenwriters—Stephen Susco and James Gunn. The three of them were shouting over the noise to discuss Quentin Tarantino’s flick, Grindhouse. Across from him, Billy was in his glory, with Brinke Stevens on his left and Debbie Rochon on his right. He looked like a kid on Christmas morning. Brinke was a petite brunette with big dark eyes and a wicked smile; Debbie was bustier and had an infectious laugh. Both of them had a stack of racy studio 8x10s in front of them and there were lines of eager fans stretching all the way down the hall and out into the street. Next to Debbie sat John Bloom who, as faux redneck Joe Bob Briggs, wrote reviews of classic drive-in movies that were legendary. He kept telling jokes in his lazy Texas drawl that had the other three laughing so hard they looked like they were going to stroke out.\\n\\n Jim O’Rear, a stuntman and fight choreographer who also freelanced as a haunted attraction consultant, was talking movie fight scenes with Sam and Mischa, two of the kids who played monsters at the Hayride. The two adjoining tables were packed with members of the Horror Writers Association and a delegation from the Garden State Horror Writers, all of whom were firing horror trivia at each other faster than automatic gunfire. Whoever lost had to do a shot of tequila. Nobody minded losing.\\n\\n The other corner of the room had a small stage where Mem Shannon and the Membership were whipping out down-and-dirty blues that had over two hundred people dancing and sweating.\\n\\n On all four walls there were huge rear projection screens on which horror films played. Susco’s The Grudge 2 on one screen; Gunn’s Slither on another; the original Dawn of the Dead played out over the table where its star, Ken Foree, sat in sober conversation with two theater grad students from the college; and opposite that Brinke Stevens was losing her clothes in the legendary B-film, Sorority Babes in the Slime-ball Bowl-O-Rama, an event that sent up a howl from the audience loud enough to rattle the windows.\\n\\n Outside the Inn, the party rolled back and forth, up and down every side street and out into the countryside. There were continuous horror movie marathons at the Dead End Drive-In and on the grounds of the Hayride, and the campus football field was one big blues-rock slam party as Al Sirois and Kindred Spirit set fire to the night.\\n\\n The members of BK’s team who didn’t draw the long straws that allowed them to come to the gala at the Harvestman Inn were patrolling in pairs on the campus and at the Hayride. A few of them, despite all warnings and threats from BK, were drunk, and the rest were feeling lighthearted and loose. There were a few trouble spots—a pickpocket working the crowds at the concert, a few shoving matches between irritable drunks, some pranks that got out of hand—but nothing the team couldn’t handle. Everything got handled.\\n\\n Every time BK used his cell phone to call one of his team the only response he ever got was “It’s all good.”\\n\\n Karl Ruger made damn sure that was all that got onto the radar. Wearing a Count Dracula rubber mask and costume, he wandered through the revelers. His own point men—Golub, Carby, McVey, and a few others—were positioned in key spots around town. Even Polk walked the streets, wriggling through the crowds, keeping an eye out, reporting in as ordered. Lois Wingate, dressed as Buffy the Vampire Slayer, walked arm in arm with Ruger. They made a charming couple.\\n\\n The Dead Heads were all locked up safe and sound. The vampires who couldn’t pass for human were in the nests. Ruger’s orders for the evening were simple: “Nobody hunts, nobody dies.”\\n\\n Not tonight; not on Mischief Night.\\n\\n Tomorrow was Halloween and that was when the killing would begin again. Yeah, Ruger thought as he walked hand in hand with Lois, that’s when the real party starts.\\n\\n Chapter 31\\n\\n Midnight\\n\\n 1\\n\\n Crow and Val sat on opposite sides of Weinstock’s bed. They were dressed in clean hospital scrubs—a loan from one of the many doctors they’d gotten to know during their recent stays. Their own soiled clothes were in a plastic bag. \\n\\n","sourceLink":"https://allnovel.net/bad-moon-rising-pine-deep-3/page-54.html","bookId":2569,"book":{"id":2569,"title":"Bad Moon Rising (Pine Deep #3)","description":"Storyline: Bad Moon Rising (Pine Deep #3) \\n FROM A FUNFEST... \\n Each year, the residents of Pine Deep host the Halloween Festival, drawing tourists and celebrities from across the country to enjoy the deliciously creepy fun. Those who visit the small Pennsylvania town are out for a good time, but those who live there are desperately trying to survive... \\n TO A BLOODFEST \\n For a monstrous evil lives among them, a savage presence whose malicious power has grown too powerful even for death to hold it back. Only a handful of brave souls stand against the King of the Dead and a red wave of destruction. Daylight is fading and a bad moon is rising over Pine Deep. Keep watching the shadows...\\n","cover":"https://allnovel.net/images/bad-moon-rising-pine-deep-3.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/bad-moon-rising-pine-deep-3.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:54:10 PM"}}
