{"id":91925,"no":11,"title":"Page 11","content":"Somehow, I got through the rest of the party. The only thing that saved me from my obsessive thoughts was Violet. She was enchanted by everything, and Damon\u0027s friends seemed equal y enchanted by her. They thought her accent was bewitching, and Charlotte and her actress friends enjoyed the hero worship that Violet bestowed upon them. Damon, for his part, kept his distance, and spent the majority of the party smoking with Samuel on the sidelines. I sat apart from everyone, reading the letter from the kil er over and over again, hoping there was some clue in the words. The Ripper had sent the letter along with what he\u0027d said was a kidney of one of his victims. My stomach turned, but not so much as it did when I read the last line of his letter.\n Catch me while you can.\n It had been addressed to a newspaper reporter, so the kil er had to have known that the letter would appear in the paper. Was it some sort of coded message for me, or Damon? Was it a chal enge?\n And was I up for it?\n That\u0027s what I didn\u0027t know as I sat in the Ten Bel s that night. I\u0027d escorted Violet to her shift, not wanting her to venture across London in the dark on her own. She\u0027d insisted on wearing her new dress so she\u0027d be prepared if we received a last-minute invitation to a party from Damon. But even though she was wearing an apron, the dress was already covered in stains from beer and whiskey. I could tel she was miserable. But at least she was safe.\n I shifted uneasily in my chair and glared darkly toward the entrance. Every time the bel would ring announcing a new client I perked up, sure it was Damon, only to see yet another drunk builder or overly perfumed woman stagger in. Of course he wasn\u0027t going to come. I\u0027d been foolish to believe him, and more foolish stil to have sat waiting for him for the past several hours. When would I stop trying to depend on him?\n \"Hi, Stefan. Would you like anything?\" Violet asked as she trudged toward my table, her shoulders slumped morosely. Her hair was sweaty and pul ed back, her lipstick had smeared, and she looked nothing like her glamorous American actress alter ego. Worse stil , she knew it.\n \"A dark ale, please,\" I said when I caught her eye. I offered a smile, but it didn\u0027t make a difference in her mood.\n She nodded. \"I can\u0027t wait to get out of here,\" she said, her voice dropping to a whisper. \"Before, I never knew what I was missing, so it didn\u0027t seem so terrible. But now, knowing everyone is drinking and dancing while I\u0027m here . . .\" She sighed, her pale pink lower lip trembling.\n \"Al that glitters is not gold,\" I murmured, pul ing a half-remembered Shakespeare phrase from my memory. Something about the language soothed me, and I hoped it would soothe Violet.\n \"Al that glitters is not gold,\" Violet said, testing out the phrase. She smiled wryly. \"That\u0027s pretty,\" she said, half to herself. \"I don\u0027t mean to complain, it\u0027s just . . .\"\n \"I know,\" I said. \"But this won\u0027t last forever.\"\n \"How do you know? Stefan, this is who I am. I can pretend and dress up, but that\u0027s just playacting. This is real,\" she said sadly. \"I\u0027l get your drink,\" she said as she turned and walked off.\n I thought of what she\u0027d said. She was wise for her age. Wasn\u0027t I stil learning the same lesson?\n I leaned back in my chair. About an hour ago, when Violet was busy serving a large group of men playing poker, I\u0027d stolen outside to hunt. Just on the edge of Dutfield Park, I\u0027d managed to kil a fat pigeon by catching it unawares as it pecked on a filthy crust of bread lodged in the cobblestones. The sour taste stuck to my taste buds. The blood had been cold and thin, and I\u0027d had to resist the urge to gag, but it was the sustenance I needed to make me stop staring longingly at the sleek necks of the ladies circulating the tavern.\n Over the din, I heard the bel signaling another customer\u0027s entrance. I didn\u0027t even bother to look up. Of course it wouldn\u0027t be Damon. He didn\u0027t care about the kil ings, and it was clear he didn\u0027t care about Klaus or any of the Originals. He was perfectly content getting drunk and feeding off Charlotte. Maybe that was better . . .\n \"Murder!\" A red-faced man staggered in, his bulk practical y fal ing against the bar. He was the same drunk from the other night who had claimed to know me. I felt my stomach clench as the tavern became quiet as a church. \"Murder!\" he croaked again. \"In the square!\" The man col apsed, women shrieked, and before I could stop myself, I was moving at vampire speed out of the bar, knocking over one of the tables as I did so. When I emerged on the street, the scent of iron was everywhere, fil ing my nostrils and causing my chest to burn. The scent was coming from the east. I took off toward it, already feeling my fangs bulge, pushing away any fear from my brain.\n Then I pul ed up short at the sight in front of me. There, just a few paces away, lit by the moon and crumpled on the ground, was a girl in a red dress. Her skirts were askew, her upturned face was pale, and her blue eyes were fixed toward the sky. I recognized her as one of the girls who\u0027d been in the tavern two nights ago. I sank to my knees by her side, relieved when I saw her chest rising and fal ing.\n I licked my fangs and leaned down, eager to taste the warm, rich blood trickling from her neck and matting into her hair. The trail glittered like liquid rubies, and I wanted more than anything to just have a taste, a second to quench my never-ending hunger.\n \"No,\" I said out loud, wil ing my rational brain to take control over my instincts. I leaned back on my heels, the spel between my nature and her blood broken. I knew what I had to do to save her. Without flinching, I brought my wrist to my mouth and ripped my flesh with my fangs. Wincing, I pressed the wound to the girl\u0027s pink lips.\n \"Drink,\" I said, glancing up to see if there were any signs of commotion. I\u0027d gotten to the girl far faster than anyone would have if they were traveling at normal, human speed, but it wouldn\u0027t be long before more bystanders from the tavern found us. And I couldn\u0027t have anyone see what I was doing. But without my blood, she\u0027d die.\n Far off in the distance, I heard the loud, clanging bel s of a police wagon. I needed to leave soon. If the police saw me in this position, they\u0027d assume that I was the attacker. \"Drink,\" I said even more forceful y, pushing my wrist up against the girl\u0027s open mouth.\n The girl coughed before greedily sucking on my wrist.\n \u0027\u0027Shhh, that\u0027s enough,\" I said, pul ing my arm away and hoisting her into a sitting position.\n Just then, I saw a shadow hulking behind us. I whirled around, fear icing my veins. Brick buildings surrounded the al ey, boxing us in.\n \"Who goes there?\" I asked, my voice echoing off the wal s of the al ey.\n Then, I heard a long, low, al -too-familiar laugh, and Damon strol ed around the corner, a lit cigar in his mouth.\n \"Saving the day again,\" he said, a bemused grin on his face. He dropped the cigar on the ground, and the ashes glinted in the darkness. Next to me, the girl stirred, moaning and sighing as though she were in the grips of a terrible nightmare.\n \"He\u0027s here,\" I said, my voice fal ing to a whisper.\n \"Who, the murderer?\" Damon dropped to his knees and glanced at the girl. His fingers brushed against the wound on her neck. \"This is amateur work. Just a baby vampire who doesn\u0027t know better. If we find him, we\u0027l stake him for the pesky trouble he\u0027s causing. But he\u0027s not a threat,\" Damon said, smiling as he wiped a trickle of blood from the side of the girl\u0027s mouth.\n \"More . . .\" the girl gasped, clawing the empty air in front of her. \"More!\" she yel ed in a strangled cry, before col apsing back against the pavement.\n \"My type of girl.\" Damon smiled. \"Sadly, no more. Stefan\u0027s decided you\u0027ve had enough,\" he said in a singsong voice. \"Stefan always likes to control people,\" he added cryptical y.\n I glanced at him in suspicion. Could this have been a trap set up by Damon? He\u0027d done it before - half-kil ed a girl, only to ensnare me into rescuing her. That had been back in New York City, shortly before Klaus and Lucius had beaten Damon at his own game, nearly kil ing both of us in the process. I was about to remind him of that when a wavering shadow caught my eye.\n It was the figure of a man, wearing a top hat, al the way at the far end of the al ey. I shot up.\n \"Did you see that?\"\n Damon nodded, his eyes widening slightly. \"Go. I\u0027l take care of her.\"\n I made a split-second decision to trust my brother. He was al I had.\n I lunged toward the shadow, only several meters away from where Damon and I were crouched over the girl.\n The shadow bolted as wel , stealing around the corner toward the river. I took off after it. My legs were pumping like pistons, and I was running faster and faster, my feet barely hitting the cobblestones. Stil , the figure stayed ever so slightly ahead of me, darting this way and that, closer to the rushing Thames.\n Faster, I whispered to myself, wil ing myself to run. Buildings were passing me in the blink of an eye, and I knew I was going as fast I possibly could. Debris blew in my face and caused my eyes to burn, and wind was whistling by my ears. Stil , no matter how fast I urged myself to run, I couldn\u0027t catch up to the shadow\u0027s creator, a tal , thin man who I now knew without a doubt was no human.\n We ran, faster and faster, toward the river. I could hear a mob of people far off in the distance, but I didn\u0027t look over my shoulder. Al my attention was directed at the shadowy man, who was speeding up with every step. The river was now in ful sight, the moon casting a dul sheen on the pitch black water. We were one hundred yards away, then fifty . . . would he jump?\n \"Stop!\" I cal ed, my voice ringing like a clarion bel in the darkness. My feet hit the uneven boards of a dock, but the vampire had disappeared.\n An abandoned pier stood on one side of me, a warehouse on the other, but no sign of the kil er. Police bel s were clanging from the al eys. I gazed wildly in al directions.\n \"Show yourself!\" I cal ed. My gaze fixed on the warehouse. Could he have ducked in there? I picked my way toward it, stepping on an overturned milk crate to get a view inside one of the windows.\n The window was frosted and filthy. I squinted, but even with my heightened senses, I couldn\u0027t make out anything within, though I knew the vampire was in there. He had to be. I didn\u0027t want to break in and find myself in a death trap. And I knew that if I stayed here, the police would soon find me - and the vampire. A cornered vampire could easily take on the police, and that would lead to more bloodshed. But I couldn\u0027t go into the warehouse on my own. There was nothing to do except turn back and get Damon to devise a plan.\n I kicked the side of the warehouse in frustration, but then I heard a sound. It was so subtle, I thought it was the waves of the river lapping against the dock until I realized that wasn\u0027t it at al .\n It was the sound of laughter.\n Turning, I trudged back to the tavern.\n Unlike an hour earlier, a sober atmosphere had taken over at the Ten Bel s when I returned. Candles had been lit, brandy had been poured, and almost every table was occupied by a policeman taking a report from the various revelers who\u0027d been in the tavern when the drunk had come in screaming bloody murder.\n \"I saw the girl. She was lying in her blood,\" the man kept saying, his face red. \"I told you, there was no one else.\" Eliza walked up to me, holding a snifter of brandy. \"I was worried about you!\" she said. \"You ran out, and I thought, that bloke\u0027s going to get himself kil ed, he is. \u0027Ow\u0027s Martha doing?\" she asked.\n \"I don\u0027t know,\" I said. Martha must have been the girl. Had Damon brought her back? I caught a glimpse of Violet, fil ing brandy glasses as quickly as she could behind the bar. Her face was white with fright.\n \"Violet!\" I cal ed, relieved to see her. \"Where is the girl? Is she alive?\" I asked brusquely.\n \"U-u-upstairs,\" she stuttered, sounding scared and exhausted. \"Damon took her up to my old chambers. The d-d-doctor is supposed to be here any minute,\" she explained.\n \"Very good,\" I said. I clasped her hand and she flinched, clearly on edge. \"I\u0027m sorry. I want to let you know . . .\"\n \"What?\" Violet asked.\n \"Where\u0027s your vervain?\" I asked, suddenly in a panic.\n \"\u0027Vervain\u0027?\" she parroted.\n \"Yes. The charm I gave you.\"\n \"It\u0027s here!\" Violet said, pul ing it out of her pocket. \"It\u0027s a rough crowd here, so I don\u0027t like wearing jewelry. But I do like it.\"\n \"Good. I was afraid you\u0027d lost it,\" I said. I leaned down and planted a kiss on her forehead. \"Stay brave,\" I said.\n \"Okay,\" Violet said, eyes wide, without any idea of what she was agreeing to.\n Hurrying upstairs, I clambered the wooden steps two at a time until I reached a door that led to a tiny room with a slanted roof. Two thin cast-iron beds were on opposite sides of the room, and a single candle was burning in a pewter holder that was precariously placed on an overturned orange crate. Damon was nowhere to be found. In the melee, everyone seemed to have forgotten about Martha. She was lying alone on one of the beds. Although her neck had been bandaged, blood was stil seeping out of the wound, forming a sticky red puddle by her ear.\n I perched on the edge of the tattered flannel coverlet and smoothed my cracked hand against the girl\u0027s forehead. It didn\u0027t take a doctor to know that she was stil deathly il . Her breath would catch, then she\u0027d gasp. Al I could hear was an ever so faint thump-da-thump coming from her chest.\n I looked down at my wrist. Already, the wound I\u0027d created less than an hour ago had faded. But although the mark had healed, I stil felt depleted, and I knew I had to be very careful with my own reserves of blood. Even so, she needed something more than I\u0027d given her. I brought my other wrist to my mouth and dug my teeth into my flesh, flinching as I felt my mind go woozy.\n \"Here,\" I said, cradling the back of the girl\u0027s head in my hand. \"Drink.\" I put my wrist up to her lips.\n Guided by instinct, the girl tentatively began to suck until I pul ed my wrist away. Her head lol ed back, and a smile of sleepy satisfaction played on her lips.\n Just then a door opened and a man wearing a white coat walked in, carrying a basin of water.\n \"Are you a friend?\" he asked firmly.\n \"I\u0027m Stefan,\" I said, putting my hand behind my back and pressing it into the fabric of my coat, hoping he wouldn\u0027t notice my wound. \"I found her.\"\n \"Very wel ,\" the man said. \"You can stay for a moment, but I\u0027l need some time alone with the patient.\"\n \"Yes, of course,\" I said, relieved he didn\u0027t find it odd I was up here. The girl was starting to stir. She\u0027d wake up soon. I hung back as he approached, wanting to make sure she was al right.\n The doctor took a towel and dipped it into the basin, then held it against the girl\u0027s forehead. As her eyes snapped open, they locked with mine.\n Then, her features froze and an unholy shriek emerged from her lips.\n \"Murderer!\" she screamed.\n The doctor pul ed away in shock, almost dropping the basin. His eyes went immediately to the door, as if he was considering yel ing for help.\n \"Shhh, you\u0027re safe,\" I hissed. \"I\u0027m your friend. I\u0027m her friend!\" I added desperately, turning to the doctor.\n \"Murderer!\" she yel ed again, tears springing from her eyes. \"Help!\"\n \"She must be in shock,\" I said to the doctor, hoping there was a medical explanation for her behavior, and not what I feared: that she thought I was her attacker.\n The doctor nodded, although I couldn\u0027t be sure he wasn\u0027t just agreeing to appease a suspected criminal.\n A starry blackness was forming at the edge of my brain, threatening to overtake me into a faint, but I summoned al my strength. She needed to calm down. Whether she thought I was the murderer because she remembered me kneeling by her side, saving her, or whether she thought I was the murderer because someone had compel ed her to think that way, I needed to correct her.\n \"Listen to me,\" I said to the girl, forcing my Power into the words. She stopped mid-scream. The room was suddenly so quiet you could hear a pin drop. \"I\u0027m your friend. I\u0027m Stefan. I found you. I saved you. You\u0027re safe now. There\u0027s no murderer here.\" It took everything I had to keep my gaze on the girl. Thankful y, her weakened state made the compulsion possible. She nodded, then turned to look at the doctor.\n \"Good girl,\" I murmured.\n \"She\u0027s al yours,\" I told the doctor. I had just narrowly escaped that one and I didn\u0027t want to push my luck by staying a second longer. The look on his face made me think compel ing him wouldn\u0027t be necessary. He was starting to relax and get back to his work.\n I marched down the stairs and into the tavern, where I caught sight of my brother, laughing as if he\u0027d never been more amused in his life. \n","sourceLink":"https://allnovel.net/stefan-s-diaries-the-ripper-the-vampire-diaries-4/page-11.html","bookId":2112,"book":{"id":2112,"title":"Stefan\u0027s Diaries: The Ripper (The Vampire Diaries #4)","description":"Storyline: \n The Ripper (The Vampire Diaries: Stefan\u0027s Diaries #4) \n The year is 1888, and the scent of blood lingers heavy in the London air. Stefan Salvatore thought he could escape his violent origins by settling in the peaceful countryside of England, but when a heinous murderer named Jack the Ripper surfaces, Stefan fears darkness will always follow him. Drawn into the investigation, Stefan assumes the worst: This is the work of a vampire. And the more he learns, the more he becomes convinced that the killer is someone close to him - and that he can never outrun his past. Based on the popular CW TV show inspired by the bestselling novels, Stefan\u0027s Diaries reveals the truth about what really happened between Stefan, Damon, and Katherine - and how the Vampire Diaries love triangle began.\n \n","cover":"https://allnovel.net/images/stefan-s-diaries-the-ripper-the-vampire-diaries-4.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-the-ripper-the-vampire-diaries-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:53:39 PM"}}
