{"id":91919,"no":5,"title":"Page 5","content":"The longer I spent at the pub, the more crowded it became - but there was no sign of Damon. I told myself I was staying to try to find more clues. But the truth was, I didn\u0027t know what I could do. Stand outside the supper club? Plod up and down the streets of London until I happened to run into Damon? Sit in Dutfield Park myself until another attack happened? The last was the one idea I kept toying with. But it was ludicrous. For one, why would the murderer strike twice at the same place? For another, what would I do if I saw the murder? Scream? Cal the police? Find a stake and hope for the best? None of the options seemed ideal. And if the murderer wasn\u0027t Damon . . . wel , then I could be dealing with a fiend from hel . I was strong, but not that strong. I needed a plan. I watched as customers poured in. Each seemed seedier than the last, but al were reassuringly human. Some men, the ones with cracked nails and dirty shirts, had obviously just gotten off their construction jobs, while others, reeking of cologne and furtively glancing at the women at the corner tables, were clearly there to consort with ladies of the night. And indeed, I couldn\u0027t help but notice each time a garishly garbed woman stepped into the tavern, the crowd surveyed her as if they were gamblers at the racetrack sizing up the horses. These women stood in stark contrast to the serving girl who seemed in charge of the entire room. She couldn\u0027t have been older than sixteen or seventeen, and skinny as a jaybird, but every time I saw her, her arms were laden with plates and pint glasses. At one point, I watched her hurry toward the kitchen, but before she got there, she paused to clear the plates from a nearby table. Al that remained on one plate were a few scraps of meat, some potatoes, and a half-eaten rol . She stared hard at the plate, before cautiously grabbing the meat and slipping it into her pocket. Then, she crammed the rol into her mouth, her cheeks puffing like a chipmunk\u0027s, before scurrying back to the kitchen. I closed my eyes. I\u0027d long ago given up praying, and I didn\u0027t think any sort of God would want to hear my requests, but I did wish that no matter what happened, that this helpless seventeen-year-old would stay far, far away from Dutfield Park. Or, for that matter, any bloodthirsty vampire. \"Lookin\u0027 for a good time, love?\" A woman with blond curled hair and crooked teeth perched on the wooden seat opposite me. Her white bosom was overflowing from her bodice. \"No. Sorry,\" I said roughly, waving my hand away. A memory from New Orleans flooded back to me. It had been in my first few weeks as a vampire, when I\u0027d been bloodthirsty and bul headed, and had dragged Damon to a house of il repute. There, I\u0027d feasted on a young girl, sure that no one would notice or care that she\u0027d disappeared. I couldn\u0027t even remember her name now, and I wondered if I\u0027d ever even bothered to learn it in the first place. It was details like those that would cause me to sink into the depths of misery, and here, in this dank tavern, I couldn\u0027t escape these split-second flashbacks. Al of them were reminders that no matter what I did, and no matter who I helped, I\u0027d never do enough good deeds to wash away al the blood I was responsible for - and would be for eternity - off my hands. Al I could do was try. And I would do anything to ensure that these women would not die at the hands of a demon. I glanced back down at the paper, now creased and smudged from my hands. I could almost recite every word of the article, and none of it seemed to make sense. Why had the kil er just left her like that? It was almost as if he\u0027d wanted her to be found. But if the kil er had wanted her to be found, he had to be very, very careful to cover his own tracks. \"What would you like to eat, love?\" a lilting voice asked. I looked up to see the skinny, wide-eyed serving girl. She was wearing a tattered and stained rose-colored dress that was covered by a filthy white apron. She had wide blue eyes and long auburn hair that hung in a single braid down her back. A smattering of freckles dusted her angular face, and her skin was as smooth and pale as ivory. She kept nervously biting her lips, a habit that reminded me a bit of Rosalyn, my fiancee back in Virginia. But even Rosalyn\u0027s extreme caution hadn\u0027t prevented her from getting kil ed by a vampire. My heart went out to this girl. \"Whatever you recommend,\" I said, putting down the paper. \"Please,\" I added. My stomach was growling, but what I most wanted wasn\u0027t on any menu. \"Wel , a lot of people have ordered the fish . . .\" she said, trailing off. Even from where I was sitting, I could hear her heart beating, as fast and lightly as a swal ow\u0027s. \"That sounds fine,\" I said. I tried not to think of the dwindling coins in my pocket. \"Yes, sir,\" the girl said, turning quickly on her heel. \"Wait!\" I cal ed. \"Yes?\" she asked, concern in her eyes. She looked so much like Oliver when he was worried that Mrs. Duckworth would scold him. There was something about the deliberate way she spoke, her ultra-cautious movements, and those wide, seeking eyes that made me feel she\u0027d seen or heard something in connection to the murder. It was more than just an air of teenage self-consciousness. She seemed haunted. \"Yes?\" she asked again, her eyes furrowing. \"You don\u0027t have to order the fish if you don\u0027t like. We also have steak-and-kidney pie . . .\" \"No, fish is fine,\" I said. \"But may I ask you a question?\" She glanced at the bar. Once she saw Alfred was deep in conversation with a patron, she tiptoed a few steps closer. \"Sure.\" \"Do you know Count DeSangue?\" I asked steadily. \"Count DeSangue?\" she repeated. \"We don\u0027t get counts here, no.\" \"Oh,\" I said, disappointed. Of course they didn\u0027t. She kept glancing between me and Alfred. \"Did you know . . . the girl who was murdered?\" I asked. I felt like I was at a church social in Mystic Fal s, wondering which cousin of Clementine\u0027s knew which cousin of Amelia\u0027s. \"Mary Ann? No.\" The girl set her mouth in a tight line and took a step away from me. \"I\u0027m not like that.\" \"Violet?\" Alfred cal ed from the bar. \"Yes, sir!\" Violet squeaked. \"He don\u0027t have to eat my head off,\" she murmured under her breath. She pul ed a pad of paper from her pocket and hastily scribbled on it, as if she were taking down an order. Then, she put the paper on the table and hurried away. Are you the police? My sister is gone. Cora Burns. Please help. I think she may have been killed. I shuddered as I read the words. Moments later, the girl reemerged from the kitchen, a steaming plate in her hand. \"Here\u0027s your food, sir,\" she said, curtseying as she placed the plate on the table. A grayish slab of fish was covered in heavy gelatinous cream. \"I\u0027m not the police,\" I said, staring into her eyes. \"Oh. Wel , I thought you might have been. You were just asking so many questions, you see,\" the girl said, color appearing high on her cheekbones. \"I\u0027m sorry, I shouldn\u0027t have troubled you.\" She took a few suspicious steps away from me, and I realized she probably thought I was just like the other louts who frequented the bar, who only offered initial kindness and interest in order to have their way with her later. \"Wait!\" I said. \"I might be able to help you. But can we talk?\" \"I don\u0027t know,\" she said. Her eyes darted nervously around the tavern. \"Have a seat,\" I said. Nervously, she perched on the stool. I nudged the plate over toward her. \"Would you like it?\" I asked, locking eyes with her. I could hear her heart beating faster against her rib cage. She must have been starving. \"Here,\" I added encouragingly, pushing the plate closer to her. \"I don\u0027t need charity,\" she said insistently, a hint of pride in her voice. Stil , I noticed her eyes continue to dart from my dinner to me. \"Please take it. You look hungry, and I\u0027d like you to have it.\" She eyed the plate suspiciously. \"Why?\" \"Because I\u0027m not hungry anymore. And it sounds like you\u0027re having a hard day,\" I said gently. \"My name\u0027s Stefan. And you are . . . ?\" \"V-V-Violet,\" she said final y. She picked up a fork and took one bite, then another, of the fish. Catching me staring, she picked up a napkin and shyly dabbed her mouth. \"You\u0027re a good man, Stefan.\" \"I try to be.\" I shrugged as I gave her a smal smile. She was quieter than Cal ie had been, but had far more spunk than Rosalyn did. I\u0027d inwardly cheered when she told Alfred off under her breath. She had pluck, and I just knew that, more than anything else, would save her. \"So about Cora - \" \"Shhh!\" Violet interrupted me. I turned over my shoulder and saw Alfred storm out from around the bar toward our table. Before I could react, he\u0027d grabbed Violet\u0027s long hair and yanked it, causing her to yelp. \"What are you doing, girl?\" he growled, his face showing none of the earlier jocularity he\u0027d had behind the bar. \"Begging for food like a mongrel?\" \"No, sir, let her go. I invited her to dine with me!\" I said, quickly standing up. I clenched my hands into fists and stared into Alfred\u0027s beady eyes. \"She\u0027s not good enough to dine with my customers. Out on the street is where you belong,\" Alfred yel ed, his voice rising as he ignored my protests. \"You\u0027re worse than them ladies over there,\" he said, jutting his chin at the trio of women who stil seemed to be surveying the crowd. \"At least they\u0027ve got something to offer,\" he said, his face turning red. \"Please, sir!\" Violet said, her entire frame shaking. Alfred loosened his grip on her hair, but his mouth was stil set in a firm line. \"I\u0027l do anything. Please don\u0027t take away my job.\" \"What job? Your sister doesn\u0027t come in, so she sends you. You\u0027re too smal to lift anything and not pretty enough to keep the customers coming back. So I give you one task. Take the orders and bring them to the cook. And you can\u0027t even do that!\" Alfred boomed. \"Please!\" I interjected desperately, placing a hand on his arm. I\u0027d only meant for the gesture to stop him from grabbing Violet again, but in the moment, I\u0027d forgotten my strength. His arm flew back, propel ing him away from Violet. I watched as he staggered backward into the table. The plate of fish landed upside down on the floor with a clatter. Violet looked terrified and I realized that the normal din had quieted to a churchlike hush. Al eyes were on us. Alfred scowled at me, rubbing his arm, as if debating whether or not to start a fight. \"Wel ,\" he said, clearing his throat. \"I apologize, but she wasn\u0027t doing anything wrong. I asked her to join me. I offered her my meal,\" I said in a smooth, low voice. I was furious, but I needed to control my temper. \"Do you understand me?\" I asked. \"Yes,\" Alfred said, jerking his gaze away. He turned toward Violet. \"That true, girl?\" he asked roughly. \"Yes,\" Violet said in a smal voice. \"And I said no, but you say the customer is always right, and I thought that you\u0027d want me to do what he said, so . . .\" Alfred raised his hand to cut her off and turned toward me. \"Now I don\u0027t know what you were trying to do, but Violet is not on offer,\" Alfred said stiffly, stil rubbing his arm. \"If you wish to meet a lady, there are ones I\u0027d be delighted to introduce to you. I know you\u0027re not from around here, but this is my bar and my rules. Are we agreed? Now you,\" he said, turning to Violet. \"Out!\" He pointed toward the door. \"Love, I can keep you warm tonight, if you know what I mean!\" one of the bar patrons yel ed as he reached to pinch her rear end. Another man fol owed suit, pawing at her. But she stared straight ahead, even as tears fel down her cheeks, and walked toward the front door. \"It\u0027s for the best,\" Alfred said roughly, crossing his beefy arms over his chest as the door closed with a thud. \"You don\u0027t run this bar. I do. And she was bothering you.\" \"She wasn\u0027t bothering me!\" I said, angrily throwing a few shil ings on the table before stepping menacingly toward him. A flicker of fear registered in Alfred\u0027s face. I considered taking my frustrations out on him, but it was no use. Violet was gone. And every second she was outside meant she was in danger. I stormed out of the bar without a second glance and walked into darkness. Only a few stars peeked through the tattered gray blanket of the London evening. I pul ed out my pocket watch, a gift from Winfield Sutherland back in New York. After al those years, it stil worked. It was nearly midnight. The witching hour. A sliver of a moon hung high in the sky, and a layer of fog, so thick I could feel dewy condensation on my skin, swirled around the dilapidated buildings surrounding me. I cocked my head like a hunting dog. I could hear laughter emanating from the tavern, but no matter how hard I tried, I couldn\u0027t hear the ba-da-bump, ba-da-bump gal op of Violet\u0027s heartbeat. I\u0027d lost her. I glanced around, trying to get my bearings. Even though the tavern had been bustling, the rest of the area seemed desolate. It reminded me a bit of some of the towns I\u0027d seen when I\u0027d taken a train from New Orleans to New York City - places so decimated by the war that no one was left. I walked through the maze of streets, unsure of where I was going. I wanted to find Violet. I had some money from my wages, and I was sure I could settle the price of a rooming house for her. But how could I find her in an unfamiliar city with streets and al eys that seemed to number in the mil ions? It was impossible. After a few moments, I came to a park. Or rather, I came to a patch of greenery that at one point might have been a park. Now, the grass was yel owed, the trees were sickly, paint was peeling from the wrought-iron benches, and none of the gas lamps were lit. I shivered. If this was Dutfield Park, then it was the ideal place for a murder. I tilted my head. I could hear heartbeats - of rabbits, and squirrels, and even a fox - but then I heard it: ba-da-bump, ba-da-bump. \"Violet!\" I cal ed, my voice cracking. I easily jumped over the peeling fence and ran toward the woods in the center of the park. \"Violet!\" I cal ed again, the ba-da-bump getting closer. And then, a shriek pierced the air, fol owed by deafening silence. \"Violet!\" I yel ed, my fangs bulging. I pelted through the trees as if my feet were running on air, not gravel, expecting to see Damon feasting on Violet\u0027s neck. Damon, turning toward me with blood dripping down his chin. Damon arching his eyebrow and greeting me with the one word that made my brain almost explode with anger . . . \"Help!\" a girl\u0027s voice screamed. \"Violet!\" I cal ed, tearing through the trees, in one direction, then another, listening wildly for the ba-da-bump, ba-da-bump of her heart. And then I saw her, standing shakily near a dark streetlight. Her face was as white as her apron, but she was alive. There was no blood. \"Violet?\" I asked, slowing down to a walk. My feet crunched against the dry underbrush. The path in the woods had obviously, in happier times, been designed for a Sunday afternoon strol . A smal brick building, most likely a groundskeeper\u0027s cottage, long since abandoned, stood at the crest of a gentle hil . Violet was staring at it, her mouth formed into an O of horror. I fol owed her gaze, the sliver of the moon providing just enough light that I could see red letters written on the side of the building, each oxidized character standing out against the muted brick as if it were il uminated from behind by candlelight: SALVATORE - I SHALL HAVE MY REVENGE I glanced at the words, feeling as though the wind had been knocked out of me. This was a chal enge, as real as if I\u0027d been dealt a blow by an unseen hand. Someone was after us. And that someone wasn\u0027t Damon. Worse stil , what if Damon was the one in trouble? I wouldn\u0027t put it past my brother to find himself at the center of a deadly vampire disagreement. After al , that\u0027s what had happened in New York. I blinked. I\u0027d only seen a gruesome message like that once in my infinite lifetime - at the Sutherlands\u0027 in New York, when Lucius, Klaus\u0027s minion, was fulfil ing the Original\u0027s desire for vengeance against me and my brother. Twenty years ago, we\u0027d just narrowly escaped him. Could he be back for more? If Klaus had returned, I owed it to my brother to warn him. Suddenly everything - my terrifying dreams, my unsettled feelings - made sense. Damon was in trouble. And like it or not, I\u0027d heard the message and come running. No matter what, my connection to the murder was no longer just a hunch - I was a part of this now. There was no going back. \"Help! Anyone!\" Violet shrieked. She was starting to panic, her eyes wide. I ran toward her and clapped my hand over her mouth to keep her from crying out again. I may have been hunting Damon, but now I was being hunted. Together, we were just two foxes, desperately darting through the city, unsure whether the hunter in charge of our fates was in front of us or behind us or lying in wait, ready to strike when we least expected it.","sourceLink":"https://allnovel.net/stefan-s-diaries-the-ripper-the-vampire-diaries-4/page-5.html","bookId":2112,"book":{"id":2112,"title":"Stefan\u0027s Diaries: The Ripper (The Vampire Diaries #4)","description":"Storyline: The Ripper (The Vampire Diaries: Stefan\u0027s Diaries #4) The year is 1888, and the scent of blood lingers heavy in the London air. Stefan Salvatore thought he could escape his violent origins by settling in the peaceful countryside of England, but when a heinous murderer named Jack the Ripper surfaces, Stefan fears darkness will always follow him. Drawn into the investigation, Stefan assumes the worst: This is the work of a vampire. And the more he learns, the more he becomes convinced that the killer is someone close to him - and that he can never outrun his past. Based on the popular CW TV show inspired by the bestselling novels, Stefan\u0027s Diaries reveals the truth about what really happened between Stefan, Damon, and Katherine - and how the Vampire Diaries love triangle began.","cover":"https://allnovel.net/images/stefan-s-diaries-the-ripper-the-vampire-diaries-4.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-the-ripper-the-vampire-diaries-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:53:39 PM"}}
