{"id":101404,"no":11,"title":"Page 11","content":"I should have known my brother would come to see me. I should only have felt surprised that he hadn\u0027t appeared earlier. When I got up the next day at noon, feeling as relaxed as a cat in a pool of sunshine, Jason was in the backyard on the chaise I\u0027d used the day before. I thought it was smart of him not to come inside, considering we were at odds with each other.\n Today wasn\u0027t going to be nearly as warm as the day before. It was cold and raw. Jason was bundled in a heavy camo jacket and a knit cap. He was staring up into the cloudless sky.\n I remembered the twins\u0027 warning, and I looked at him carefully; but no, it was Jason. The feel of his mind was familiar, but maybe a fairy could impersonate even that. I listened in for a second. No, this was definitely my brother.\n It was strange to see him sitting idle and even stranger to see him alone. Jason was always talking, drinking, flirting with women, working at his job, or working on his house; and if he wasn\u0027t with a woman, he nearly always had a male shadow - Hoyt (until he\u0027d been preempted by Holly) or Mel. Contemplation and solitude were not states I associated with my brother. Watching him stare at the sky as I sipped my mug of coffee, I thought,Jason\u0027s a widower now .\n That was a strange new identity for Jason, a heavy one he might not be able to manage. He\u0027d cared for Crystal more than she\u0027d cared for him. That had been a new experience for Jason, too. Crystal - pretty, stupid, and faithless - had been his female counterpart. Maybe her infidelity had been an attempt to reassert her independence, to struggle against the pregnancy that had tied her more securely to Jason. Maybe she\u0027d just been a bad woman. I\u0027d never understood her, and now I never would.\n I knew I\u0027d have to go talk to my brother. Though I\u0027d told Jason to stay away from me, he wasn\u0027t listening. When had he ever? Maybe he\u0027d taken the temporary truce caused by Crystal\u0027s death as a sign of a new state of things.\n I sighed and went out the back door. Since I\u0027d slept so late, I\u0027d showered before I\u0027d even made my coffee. I grabbed my old quilted pink jacket off the rack by the back door and pulled it over my jeans and sweater.\n I put a mug of coffee on the ground by Jason, and I sat on the upright folding chair close to him. He didn\u0027t turn his head, though he knew I was there. His eyes were hidden behind dark glasses.\n \"You forgiven me?\" he asked after he\u0027d taken a gulp of coffee. His voice sounded hoarse and thick. I thought he\u0027d been crying.\n \"I expect that sooner or later I might,\" I said. \"But I\u0027ll never feel the same about you again.\"\n \"God, you\u0027ve gotten hard. You\u0027re all the family I\u0027ve got left.\" The dark glasses turned to face me.You have to forgive me, because you\u0027re all I have who can forgive .\n I looked at him, feeling a little exasperated, a little sad. If I was getting harder, it was in response to the world around me. \"If you need me so much, I guess you should have thought twice before you set me up like that.\" I rubbed my face with my free hand. He had some family he didn\u0027t know about, and I wasn\u0027t going to tell him. He would only try to use Niall, too.\n \"When will they release Crystal\u0027s body?\" I asked.\n \"Maybe in a week,\" he said. \"Then we can have the funeral. Will you come?\"\n \"Yes. Where will it be?\"\n \"There\u0027s a chapel out close to Hotshot,\" he said. \"It doesn\u0027t look like much.\"\n \"The Tabernacle Holiness Church?\" It was a peeling, white ramshackle building way out in the country.\n He nodded. \"Calvin said they do the burials for Hotshot from there. One of the guys in Hotshot is the pastor for it.\"\n \"Which one?\"\n \"Marvin Norris.\"\n Marvin was Calvin\u0027s uncle, though he was four years younger.\n \"I think I remember seeing a cemetery out back of the church.\"\n \"Yeah. The community digs the hole, one of them puts together the coffin, and one of them does the service. It\u0027s real homey and personal.\"\n \"You\u0027ve been to a funeral there before?\"\n \"Yeah, in October. One of the babies died.\"\n There hadn\u0027t been an infant death listed in the Bon Temps paper in months. I had to wonder if the baby had been born in a hospital or in one of the houses in Hotshot; if any trace of its existence had ever been recorded.\n \"Jason, have the police been by any more?\"\n \"Over and over. But I didn\u0027t do it, and nothing they say or ask can make that change. Plus, the alibi.\"\n I couldn\u0027t argue that.\n \"How are you fixed as far as work goes?\" I wondered if they would fire Jason. It wasn\u0027t the first time he\u0027d been in trouble. And though Jason was never guilty of the worst crimes attributed to him, sooner or later his reputation as being a generally okay guy would simply crumple for good.\n \"Catfish said to take time off until the funeral. They\u0027re going to send a wreath to the funeral home when we get her body back.\"\n \"What about Hoyt?\"\n \"He hasn\u0027t been around,\" Jason said, sounding puzzled and hurt.\n Holly, his fianc¨¦e, wouldn\u0027t want him hanging around with Jason. I could understand that.\n \"Mel?\" I asked.\n \"Yeah,\" Jason said, brightening. \"Mel comes by. We worked on his truck yesterday, and this weekend we\u0027re going to paint my kitchen.\" Jason smiled at me, but it faded fast. \"I like Mel,\" he said, \"but I miss Hoyt.\"\n That was one of the most honest things I\u0027d ever heard Jason say.\n \"Haven\u0027t you heard anything about this, Sookie?\" Jason asked me. \"You know - the way you hear things? If you could steer the police in the right direction, they could find out who killed my wife and my baby, and I could get my life back.\"\n I didn\u0027t think Jason was ever going to get his old life back. I was sure he wouldn\u0027t understand, even if I spelled it out. But then I saw what was in his head in a moment of true clarity. Though Jason couldn\u0027t verbalize these ideas, he did understand, and he was pretending, pretending hard, that everything would be the same ... if only he could get out from under the weight of Crystal\u0027s death.\n \"Or if you tell us,\" he said, \"we\u0027ll take care of it, Calvin and me.\"\n \"I\u0027ll do my best,\" I said. What else could I say? I climbed out of Jason\u0027s head and swore to myself I wouldn\u0027t get inside again.\n After a long silence, he got up. Maybe he\u0027d been waiting to see if I\u0027d offer to make lunch for him. \"I guess I\u0027ll go back home, then,\" he said.\n \"Good-bye.\"\n I heard his truck start up a moment later. I went back in, hanging the jacket back where I\u0027d gotten it.\n Amelia had left me a note stuck to the milk carton in the refrigerator. \"Hey, roomie!\" it said by way of opening. \"Sounded like you had company last night. Did I smell a vampire? Heard someone shut the back door about three thirty. Listen, be sure and check the answering machine. You got messages.\"\n Which Amelia had already listened to, because the light wasn\u0027t blinking anymore. I pressed the Play button.\n \"Sookie, this is Arlene. I\u0027m sorry about everything. I wish you\u0027d come by to talk. Give me a call.\"\n I stared at the machine, not sure how I felt about this message. It had been a few days, and Arlene had had time to reconsider stomping out of the bar. Could she possibly mean she wanted to recant her Fellowship beliefs?\n There was another message, this one from Sam. \"Sookie, can you come in to work a little early today or give me a call? I need to talk to you.\"\n I glanced at the clock. It was just one p.m., and I wasn\u0027t due at work until five. I called the bar. Sam picked up.\n \"Hey, it\u0027s Sookie,\" I said. \"What\u0027s up? I just got your message.\"\n \"Arlene wants to come back to work,\" he said. \"I don\u0027t know what to tell her. You got an opinion?\"\n \"She left a message on my answering machine. She wants to talk to me,\" I said. \"I don\u0027t know what to think. She\u0027s always on some new thing, isn\u0027t she? Do you think she could have dropped the Fellowship?\"\n \"If Whit dropped her,\" he said, and I laughed.\n I wasn\u0027t so sure I wanted to rebuild our friendship, and the longer I thought about it, the more doubtful I became. Arlene had said some hurtful and awful things to me. If she\u0027d meant them, why would she want to mend fences with a terrible person like me? And if she hadn\u0027t meant them, why on earth had they passed her lips? But I felt a twinge when I thought of her children, Coby and Lisa. I\u0027d kept them so many evenings, and I\u0027d been so fond of them. I hadn\u0027t seen them in weeks. I found I wasn\u0027t too upset about the passing of my relationship with their mother - Arlene had been killing that friendship for some time now. But the kids, I did miss them. I said as much to Sam.\n \"You\u0027re too good,cher ,\" he said. \"I don\u0027t think I want her back here.\" He\u0027d made up his mind. \"I hope she can find another job, and I\u0027ll give her a reference for the sake of those kids. But she was causing trouble before this last blowup, and there\u0027s no point putting all of us through the wringer.\"\n After I\u0027d hung up, I realized that Sam\u0027s decision had influenced me in favor of seeing my ex-friend. Since Arlene and I weren\u0027t going to get the opportunity to gradually make peace at the bar, I\u0027d try to at least fix things so we could nod at each other if we passed in Wal-Mart.\n She picked up on the first ring. \"Arlene, it\u0027s Sookie,\" I said.\n \"Hey, hon, I\u0027m glad you called back,\" she said. There was a moment of silence.\n \"I thought I\u0027d come over to see you, just for a minute,\" I said awkwardly. \"I\u0027d like to see the kids and talk to you. If that\u0027s okay.\"\n \"Sure, come over. Give me a few minutes, so I can pick up the mess.\"\n \"You don\u0027t need to do that for me.\" I\u0027d cleaned Arlene\u0027s trailer many a time in return for some favor she\u0027d done me or because I didn\u0027t have anything else to do while she was out and I was there to babysit.\n \"I don\u0027t want to slide back into my old ways,\" she said cheerfully, sounding so affectionate that my heart lifted ... for just a second.\n But I didn\u0027t wait a few minutes.\n I left immediately.\n I couldn\u0027t explain to myself why I wasn\u0027t doing what she\u0027d asked me to do. Maybe I\u0027d caught something in Arlene\u0027s voice, even over the phone. Maybe I was recalling all the times Arlene had let me down, all the occasions she\u0027d made me feel bad.\n I don\u0027t think I\u0027d let myself dwell on these incidents before, because they revealed such a colossal pitifulness on my part. I\u0027d needed a friend so badly I\u0027d clung to the meager scraps from Arlene\u0027s table, though she\u0027d taken advantage of me time after time. When her dating wind had blown the other way, she hadn\u0027t thought twice about discarding me to win favor with her current flame.\n In fact, the more I thought, the more I was inclined to turn around and head back to my house. But didn\u0027t I owe Coby and Lisa one more try to mend my relationship with their mom? I remembered all the board games we\u0027d played, all the times I\u0027d put them to bed and spent the night in the trailer because Arlene had called to ask if she could spend the night away.\n What the hell was I doing? Why was I trusting Arlene now ?\n I wasn\u0027t, not completely. That\u0027s why I was going to scope out the situation.\n Arlene didn\u0027t live in a trailer park but on an acre of land a little west of town that her dad had given her before he passed away. Only a quarter acre had been cleared, just enough for the trailer and a small yard. There was an old swing set in the back that one of Arlene\u0027s former admirers had assembled for the kids, and there were two bikes pushed up against the back of the trailer.\n I was looking at the trailer from the rear because I\u0027d pulled off the road into the overgrown yard of a little house that had stood next door until its bad wiring had caused a fire a couple of months before. Since then, the frame house had stood half-charred and forlorn, and the former renters had found somewhere else to live. I was able to pull behind the house, because the cold weather had kept the weeds from taking over.\n I picked a path through the fringe of high weeds and trees that separated this house from Arlene\u0027s. Working through the thickest growth, I made my way to a vantage point where I could see part of the parking area in front of the trailer and all of the backyard. Only Arlene\u0027s car was visible from the road, since it had been left in the front yard.\n From my vantage point, I could see that behind the trailer was parked a black Ford Ranger pickup, maybe ten years old, and a red Buick Skylark of approximately the same vintage. The pickup was loaded down with pieces of wood, one long enough to protrude beyond the truck bed. They measured about four by four, I estimated.\n As I watched, a woman I vaguely recognized came out of the back of the trailer onto the little deck. Her name was Helen Ellis, and she\u0027d worked at Merlotte\u0027s about four years before. Though Helen was competent and so pretty she\u0027d drawn the men in like flies, Sam had had to fire her for repeated lateness. Helen had been volcanically upset. Lisa and Coby followed Helen onto the deck. Arlene was framed in the doorway. She was wearing a leopard print top over brown stretch pants.\n The kids looked so much older than the last time I\u0027d seen them! They looked reluctant and a little unhappy, especially Coby. Helen smiled at them encouragingly and turned back to Arlene to say, \"Just let me know when it\u0027s over!\" There was a pause while Helen seemed to struggle with how to phrase something she didn\u0027t want the kids to understand. \"She\u0027s only getting what she deserves.\" I could see Helen only in profile, but her cheerful smile made my stomach heave. I swallowed hard.\n \"Okay, Helen. I\u0027ll call you when you can bring \u0027em back,\" Arlene said. There was a man standing behind her. He was too far back in the interior for me to identify with certainty, but I thought he was the man I\u0027d hit on the head with a tray a couple of months back, the man who\u0027d been so ugly to Pam and Amelia. He was one of Arlene\u0027s new buddies.\n Helen and the kids drove off in the Skylark.\n Arlene had closed the back door against the chill of the day. I shut my eyes and located her inside the trailer. I found there were two men in there with her. What were they thinking about? I was a little far, but I stretched out with my extra sense.\n They were thinking about doing awful things to me.\n I crouched under a bare mimosa, feeling as bleak and miserable as I\u0027ve ever felt. Granted, I\u0027d known for some time that Arlene wasn\u0027t truly a good person or even a faithful person. Granted, I\u0027d heard her rant and rave about the eradication of the supernaturals of the world. Granted, I\u0027d come to realize that she\u0027d slipped into regarding me as one of them. But I\u0027d never let myself believe that whatever affection she\u0027d ever felt for me had slipped away entirely, transmuted by the Fellowship\u0027s policy of hate.\n I pulled my cell phone out of my pocket. I called Andy Bellefleur.\n \"Bellefleur,\" he said briskly.\n We were hardly buddies, but I sure was glad to hear his voice.\n \"Andy, it\u0027s Sookie,\" I said, taking care to keep my voice quiet. \"Listen, there are two guys in Arlene\u0027s trailer with her, and there\u0027re some long pieces of wood in the back of their pickup. They don\u0027t realize I know they\u0027re in the trailer with Arlene. They\u0027re planning on doing the same thing to me that was done to Crystal.\"\n \"You got anything I could take to court?\" he asked cautiously. Andy had always been a closet believer in my telepathy, though that didn\u0027t mean he was necessarily a fan of mine.\n \"No,\" I said, \"they\u0027re waiting for me to show up.\" I crept closer, hoping like hell they weren\u0027t looking out the back windows. There was a box of extra-long nails in the pickup bed, too. I had to close my eyes for second as the horror crawled all over me.\n \"I\u0027ve got Weiss and Lattesta with me,\" Andy said. \"Would you be willing to go in if we were there to back you up?\"\n \"Sure,\" I said, feeling anything but. I simply knew I was going to have to do this. It could be the end of any lingering suspicion of Jason. It could mean recompense or at least retribution for the death of Crystal and the baby. It could put at least a few of the Fellowship fanatics behind bars and maybe serve as a good lesson to the rest. \"Where are you?\" I asked, shaking with fear.\n \"We were already in the car to go to the motel. We can be there in seven minutes,\" Andy said.\n \"I parked behind the Freer house,\" I said. \"I gotta go. Someone\u0027s coming out the back of the trailer.\"\n Whit Spradlin and his buddy, whose name I couldn\u0027t recall, came down the steps and unloaded the wood beams from the pickup. The pieces were already formed into the correct lengths. Whit turned to the trailer and called something, and Arlene opened the door and came down the back steps, her purse over one shoulder. She walked toward the cab of the pickup.\n Dammit, she was going to get in and drive away, leaving her car parked in front as though she were there! Any lingering tenderness I\u0027d harbored in my heart burned away at that moment. I looked at my watch. Maybe three more minutes until Andy arrived.\n She kissed Whit and waved at the other man, and they went into the trailer to hide so I wouldn\u0027t see them. According to their plan, I\u0027d come to the front, knock on the door, and one of them would fling it open and drag me in.\n Game over.\n Arlene opened the truck door, the keys in her hand.\n She had to stay. She was the weak link. I knew this in every way I could know it - intellectually, emotionally, and with my other sense.\n This was going to be awful. I braced myself.\n \"Hi, Arlene,\" I said, stepping out of my cover.\n She shrieked and jumped. \"Jesus Christ, Sookie, what are you doing in my backyard?\" She made an elaborate fuss of collecting herself. Her head was a snarled tangle of anger and fear and guilt. And regret. There was some, I swear.\n \"I\u0027ve been waiting to see you,\" I said. I had no idea what to do now, but I\u0027d slowed her down a little. I might have to physically tackle her. The men inside hadn\u0027t noticed my abrupt appearance, but that wouldn\u0027t last long unless I got extremely lucky. And I hadn\u0027t had a run of luck, much less extreme luck, lately.\n Arlene was standing still, keys in hand. It was easy to get inside her head and rummage around, reading the awful story in there.\n \"What you doing, getting ready to go, Arlene?\" I asked, keeping my voice very quiet. \"You\u0027re supposed to be inside, waiting for me to get here.\"\n She saw everything, and her eyes closed. Guilty, guilty, guilty. She had tried to construct a bubble to keep the men\u0027s intent hidden from herself, to keep it from touching her heart. That hadn\u0027t worked - but it hadn\u0027t stopped her treachery today, either. Arlene stood exposed to herself.\n I said, \"You got in too deep.\" My own voice sounded detached and level. \"No one will understand that or forgive it.\" Her eyes went wide with the knowledge that what I was saying was true.\n But I was in for my own kind of shock. I knew, suddenly and surely, that she had not killed Crystal and neither had these men; they\u0027d planned to crucify me in emulation of Crystal\u0027s death because it seemed like such a great idea, such an open statement of their opinion of the shapeshifters\u0027 announcement. I\u0027d been selected as the sacrificial lamb, despite the fact that they knew for sure I wasn\u0027t a shapeshifter; in fact, they thought I wouldn\u0027t put up as much of a fight since I was only a shapeshifter sympathizer, not one of the two-natured. I wouldn\u0027t be as strong, in their opinion. I found this incredible.\n \"You\u0027re a poor excuse for a woman,\" I said to Arlene. I couldn\u0027t seem to stop, and I couldn\u0027t seem to sound anything but matter-of-fact. \"You\u0027ve never told the truth to yourself in your whole life, have you? You still see yourself as a pretty, young thing of twenty-five, and you still think some man will come along and recognize that in you. Someone will take care of you, let you quit working, send your kids to private schools where they\u0027ll never have to talk to anyone different from them. That\u0027s not gonna happen, Arlene. This is your life.\" And I swept an open hand at the trailer in its weedy yard, the old truck. It was the meanest thing I\u0027d ever said, and every word of it was true.\n And she screamed. She couldn\u0027t seem to stop screaming. I looked into her eyes. She kept trying to look away, but she couldn\u0027t seem to do that. \"You witch!\" she sobbed. \"You\u0027re a witch. There are such things, and you\u0027re one of \u0027em!\"\n If she\u0027d been right, I could have prevented what happened next.\n At that moment, Andy pulled into the Freer yard, just as I had. For all he knew, there was still time to creep up on the trailer. I heard his car more or less at my back. My whole attention was concentrated on Arlene and the rear door of the trailer. Weiss, Lattesta, and Andy came up behind me just as Whit and his friend burst from the back door of the trailer, rifles in hands.\n Arlene and I were standing between two armed camps. I felt the sun on my arms. I felt a cold breeze pick up my hair and toss a lock playfully across my face. Over Arlene\u0027s shoulder, I saw the face of Whit\u0027s friend, and I finally remembered his name was Donny Boling. He\u0027d had a recent haircut. I could tell from the white half inch at the base of his neck. He was wearing an Orville\u0027s Stump Grinding T-shirt. His eyes were a muddy brown. He was aiming at Agent Weiss.\n \"She has children,\" I called. \"Don\u0027t do it!\"\n His eyes widened with fright.\n Donny swung the rifle toward me. He thought,Shoot HER .\n I flung myself to the ground as the rifle went off.\n \"Lay down your arms!\" Lattesta screamed. \"FBI!\"\n But they didn\u0027t. I don\u0027t think his words even registered.\n So Lattesta fired. But you couldn\u0027t say he hadn\u0027t warned them. \n","sourceLink":"https://allnovel.net/dead-and-gone-sookie-stackhouse-9/page-11.html","bookId":2199,"book":{"id":2199,"title":"Dead and Gone (Sookie Stackhouse #9)","description":"Storyline: \n Dead and Gone (Sookie Stackhouse #9) \n Except for Sookie Stackhouse, folks in Bon Temps, Louisiana, know little about vamps-and nothing about weres. \n Until now. The weres and shifters have finally decided to reveal their existence to the ordinary world. At first all goes well. Then the mutilated body of a were-panther is found near the bar where Sookie works-and she feels compelled to discover who, human or otherwise, did it. \n But there\u0027s a far greater danger threatening Bon Temps. A race of unhuman beings-older, more powerful, and more secretive than vampires or werewolves-is preparing for war. And Sookie finds herself an all-too human pawn in their battle.\n \n","cover":"https://allnovel.net/images/dead-and-gone-sookie-stackhouse-9.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dead-and-gone-sookie-stackhouse-9.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:02:12 PM"}}
