{"id":79958,"no":25,"title":"Page 25","content":"5\\n\\n When Alexander walked into his quarters, Dimitri was lying down in his top bunk.\\n\\n “What’s going on?” said Alexander tiredly.\\n\\n “You tell me,” said Dimitri.\\n\\n “Let’s see. Didn’t I just see you? I’m going to sleep. I have to wake up at five tomorrow.”\\n\\n “I’ll get to the point, then,” Dimitri said, hopping off the bunk. “I want you to end the charade you’re playing with my girl.”\\n\\n “What are you talking about?”\\n\\n “Can’t I just have this one thing for myself? You already have a good life, don’t you? Think about all the things you have that you want. You’re a lieutenant in the Red Army. You have a company of men obeying your every order. I’m not in your company—”\\n\\n “No, but you’re in mine, Private,” said Anatoly Marazov, jumping off the bunk next to Alexander’s. “It’s late, and we all have long days ahead of us. You shouldn’t be here raising your voice. You’re here by privilege.”\\n\\n Dimitri saluted him. Alexander stood by quietly.\\n\\n “At attention, Private,” Marazov said, coming up to Dimitri. “I thought when you came here you were just relaxing, waiting for your friend.”\\n\\n “It’s just a small matter between me and the lieutenant, sir,” said Dimitri.\\n\\n “It’s only a small matter, Private, when I’m not woken up out of a much-needed sleep. As soon as I’m awake, it ceases to be a small matter and becomes something else entirely. Now, at ease.” Marazov, who was in his long johns, walked around Dimitri, who was fully uniformed, and said, “Can this small matter wait till morning?”\\n\\n Alexander stepped in. “Lieutenant, can you give us a few minutes?”\\n\\n Trying not to smile, Marazov bowed his head. “As you wish, Lieutenant.”\\n\\n “We will take it out in the hall.”\\n\\n They stepped out into the corridor; Alexander closed the door behind him. “Dima, what’s the problem? Don’t get yourself into trouble with your commanding officer.”\\n\\n “Cut the shit. Tell me, when is it enough for you?” Remaining at a distance from Alexander, Dimitri hissed, “You can have any girl in the world. Why do you want mine?”\\n\\n It took all of Alexander’s strength not to ask Dimitri the same question. “I have no idea what you’re talking about. She was getting hurt. I helped her.”\\n\\n Dimitri continued, “I’m just a grunt. I have to follow everybody’s orders and eat everybody’s shit. She is the only one who treats me like a human being.”\\n\\n She can’t help it. She treats everybody like that. “But, Dima,” Alexander said, “you also have your life. Think of all the things you don’t have that you don’t want. You have not been sent down south, where men are falling into Hitler’s meat grinder. Marazov’s unit is staying here until the front comes to Leningrad. I’ve taken care of that. To help you.” He paused. “Because I’m your friend.” He took a step toward Dimitri. “I have been very good to you over the years. What has happened to our friendship?”\\n\\n “Love happened,” snapped Dimitri. “She is more important to me now. I want to survive this f*cking war — for her.”\\n\\n “Oh, Dimitri,” said Alexander and fell silent. “So survive — for her. Who’s stopping you?”\\n\\n Dimitri whispered, “Whatever silly crush she might have, it’s not real. How could it be? She doesn’t know who you are.” Dimitri paused. “Or does she?”\\n\\n Alexander’s heart skipped erratically before he answered. The lightbulb next to them was broken. The one down the hall flickered on and off. Sounds of men laughing came from some of the rooms. Water was running. And still they stood silently across from one another. Alexander wondered what Dimitri was referring to. His indiscreet past? America? He glared at Dimitri. “Of course she doesn’t,” he said at last. “She knows absolutely nothing.”\\n\\n “Because if she did, Alexander, it would make things very dangerous, don’t you think? For us.”\\n\\n Alexander took a step toward Dimitri, who put out his palms and backed into the wall. “Dimitri,” said Alexander, “don’t f*ck with me. I told you, she knows nothing.”\\n\\n “I don’t want to hurt anyone,” Dimitri said in a small voice, his hands up. “I just want my chance with Tania.”\\n\\n His teeth clenched, Alexander turned away and went back to his quarters.\\n\\n Lying on his bed with his arms behind his head, Marazov said casually, “Alexander, you want me to take care of Chernenko for you? Is he giving you trouble?”\\n\\n Alexander shook his head. “Don’t worry. I can handle him.”\\n\\n “We could reassign him.”\\n\\n “He’s already been reassigned. Four times.”\\n\\n “Oh, nobody wants him, so you give him to me?”\\n\\n “Not to you, to Kashnikov.”\\n\\n “Yes, and Kashnikov is mine.”\\n\\n Getting out a flask and taking a swig of vodka, then passing it to Alexander, Marazov said, “We don’t have enough men to throw in front of Hitler’s tanks to hold Leningrad. We are going to have to surrender, aren’t we?”\\n\\n “Not if I can help it,” said Alexander. “We’re going to fight on the streets with rocks, if we have to.” He smiled.\\n\\n Marazov saluted him from across the bunks and fell down onto his pillow. “Lieutenant Belov, I haven’t seen much of you off duty. You can’t believe some of the girls that are coming to the club lately.” He grinned.\\n\\n Alexander grinned back and shook his head. “No more for me.”\\n\\n Marazov lifted his head in surprise. “I don’t understand the words that are coming out of your mouth, Lieutenant. I hear you. I think you’re speaking Russian, but I just can’t believe what I’m hearing. What in f*ck’s name is going on?”\\n\\n When Alexander didn’t answer, Marazov said, “Wait, wait. You’re not . . . oh, no!” He laughed infectiously. “Now I know you’re full of shit. What happened to you? You’re not dying, are you?”\\n\\n “I’m not sleeping, that’s for f*cking sure,” said Alexander.\\n\\n “Who can I wake up? I can’t keep this to myself.”\\n\\n He leaned over his bunk and hit the sleeping soldier beneath him with a pillow. “Grinkov, wake up. You won’t believe it when I tell you—”\\n\\n “F*ck off,” Grinkov said, throwing the pillow to the floor and turning away.\\n\\n Alexander laughed. “Stop it, you crazy bastard,” he said to Marazov. “Stop it before I have you reassigned.”\\n\\n “Who is it?”\\n\\n “Don’t know what you’re talking about,” said Alexander, putting a pillow over his face.\\n\\n “Wait, is it the girl you keep muttering about in your sleep?”\\n\\n Taking the pillow off his face, Alexander said with surprise, “I don’t mutter in my sleep.”\\n\\n “Oh, yes you do,” said Marazov. “And how. Grinkov, what does Belov mutter when he is sleeping?”\\n\\n “F*ck off,” Grinkov said again, turning to the wall.\\n\\n “No, that’s not it. It’s some girl’s name. It’s . . . it’s . . . Alexander, you’re a fiend for keeping it from your fellow officers.”\\n\\n “Yes, because you can be trusted,” said Alexander, turning on his side.\\n\\n Marazov clapped his hands. “I want to meet this one,” he said. “I need to meet the girl who has taken our wandering Alexander’s horse and cart.”\\n\\n Later, as he lay with a heavy chest, unable to sleep, Alexander knew that it was not as easy as a walk in the fields to reconstruct your heart. If his life in the Soviet Union had taught him anything, it had taught him that. But he was going to try — after he had spoken to her. Everything would be easier to carry after he had spoken to her.\\n\\n Alexander knew that before he had light instead of darkness, he had to deserve light instead of darkness. The time for him had obviously not come. He still had to earn his stars. \\n\\n","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-25.html","bookId":1855,"book":{"id":1855,"title":"The Bronze Horseman (The Bronze Horseman #1)","description":"Storyline: Called “a Russian Thorn Birds,” The Bronze Horseman by Paullina Simons is a sweeping saga of love and war that has been a monumental bestseller all over the world. The acclaimed author of Tully, Simons has written a stirring tale of devotion, passion, secrets, betray, and sacrifice. “A love story both tender and fierce” (Publishers Weekly ) that “Recalls Dr. Zhivago” (People Magazine), The Bronze Horseman is rich and vivid historical fiction at its finest.\\n","cover":"https://allnovel.net/images/the-bronze-horseman-the-bronze-horseman-1.jpg","author":"Paullina Simons","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:19:41 PM"}}
