{"id":79979,"no":47,"title":"Page 47","content":"6\n “What are we going to do?” said Mama one evening when Babushka was in the other room and the girls were all in bed.\n “About what?” asked Dasha.\n “About Babushka,” she said. “Now that she doesn’t go across the Neva anymore, she’s home all day.”\n “Yes,” said Marina, “and now that she’s home all day, she eats what’s left of Alexander’s flour one spoonful at a time.”\n “Marina, shut up,” said Tatiana. “We have no flour left. Babushka eats the sweepings from the bottom of the bag.”\n “Oh?” Marina changed the subject. “Tania, do you think it’s true? Have all the rats left the city?”\n “I don’t know, Marina.”\n “Have you seen any cats or dogs?”\n “There aren’t any left,” Tatiana said. “That I know.” She had looked.\n Coming up to the girls’ bed and crouching beside it, Mama shook her head. “Listen to me, all of you,” she said. Mama’s voice was not boisterous anymore; it was not strident, it was not loud. It was barely even a voice, certainly not a voice Tatiana recognized as being her mother’s. The kerchief still tied Mama’s hair back from her head. “I’m talking about the cold. She is here all day; do we have enough wood to heat the bourzhuika for her all day?”\n “No,” said Dasha, propping herself up on one elbow. “I know we don’t. We need all the wood we have to heat the bourzhuika at night. We barely have enough for that. Look how long it’s been since we properly heated our rooms from the big stove.”\n Since Alexander was here last, thought Tatiana. He always gets the wood and builds the fire and makes the room warm.\n Wringing her hands, Mama said, “We’re going to have to tell her to keep the bourzhuika on all day.”\n “We’ll tell her that Mama,” said Tatiana, “but soon we will have no wood.”\n “Tania, she is freezing in the apartment. Do you see how slowly she is moving?”\n Dasha nodded. “She used to go to the public canteen and spend all day there waiting for some soup, some porridge. Today I never saw her get up from the couch once, not even to eat dinner with us. Tania, can we get her into your hospital?”\n “We can try,” said Tatiana from her wall. “But I don’t think there are any spare beds. The children have them all. And the wounded.”\n “Let’s try tomorrow, all right?” said Mama. “At least in the hospital she’ll be warmer. They’re still heating the hospitals, right?”\n “They’ve closed three wings of the hospital,” Tatiana replied, crawling out of bed. “They’re keeping just one open. And it’s full.”\n She went to see her grandmother. The blankets had fallen off Babushka Maya, who lay on the sofa covered by just her coat. Tania picked up the blankets and covered Babushka thoroughly, up to her neck, tucking the blankets all around her. She knelt on the floor. “Babushka,” she whispered, “talk to me.”\n Babushka groaned faintly. Tatiana put her hand on her grandmother’s head. “No strength left?” she asked.\n “Not much . . .”\n Tatiana managed a smile. “Babushka, I remember sitting by you when you painted; the smells of the paint were very strong, and you were always covered with it, and I used to sit so close to you that I would become covered by it, too. Do you remember?”\n “I remember, sunshine. You were the sweetest child.” She smiled. Tatiana’s hand remained on her.\n “You taught me how to draw a banana when I was four. I had never seen a banana and couldn’t draw one, remember?”\n “You drew a very good banana,” Babushka said, “even though you had never seen one. Oh, Tanechka . . .” She broke off.\n “What, Babushka?”\n “Oh, to be young again . . .”\n “I don’t know if you’ve noticed,” Tatiana whispered, “but the young ones aren’t doing so well either.”\n “Not them,” Babushka said, opening her eyes briefly. “You.”\n The next morning Tatiana fetched the two buckets of water and then went to get the rations, and when she came back, Babushka was dead. She was lying on the couch, covered by Tatiana’s blankets and a coat, still and cold. Marina, crying, said, “I went in to wake her, and she wasn’t moving.”\n Tatiana and her family stood over Babushka.\n Sniffling, shrugging, turning toward the dining table, Marina said, “Come on, let’s eat.”\n And Mama, nodding her head and turning herself, agreed. “Yes, let’s have the morning bread. I already made a little chicory to drink. Sarkova warmed up the kitchen stove for breakfast with her own wood. There was a little heat left for me.”\n They sat down at the table, and Tatiana cut their ration into two halves — just over half a kilo for now, just over half a kilo for later. She divided the half-kilo into four pieces, and they ate, 125 grams each. “Marina,” Tatiana said firmly, “bring your bread home, you hear?”\n “What about Babushka’s share?” said Marina. “Let’s divide it up and eat it now.” And they did. And then Marina and Dasha and Mama ate the chicory grinds from which they had just made a liquid that looked and smelled like coffee. Tatiana said no to the grinds.\n She told her mother she would go to the local Soviet council to notify them of Babushka’s death so the burial crew could come and take her body. Mama placed her hand on Tatiana. “Wait,” she said. “If the council comes, they’ll know she is dead.”\n “Yes?”\n “And her rations? They’ll stop.”\n Tatiana got up from the table. “Mama, we’ll still have the coupons until the end of the month. That’s ten more days of her bread.”\n “Yes, but then what?”\n Clearing the table, Tatiana said, “Mama, you know what? I’m not really thinking that far ahead.”\n “Stop clearing, Tania,” said Dasha. “There is no water to wash anything with. Leave the dishes. All they had was bread on them. We’ll reuse them tonight.” Turning to her mother, Dasha said, “Besides, Mama, if not the council, then who? We can’t move her ourselves. We can’t leave her here. Can we?” She paused. “We can’t continue to eat dinner and sew with our grandmother on the couch.”\n Mama stared at Babushka. “Better for her to be here than lying out in the street,” she said faintly.\n Tatiana stopped clearing the table and went to get a white sheet from the dresser. “Mama, no, we can’t leave her here. A body needs to be buried. Even in the Soviet Union,” she said sadly. “Dasha, help me, will you? We need to wrap her before they take her. We’ll wrap her in this.”\n Taking the coat and the blankets off Babushka, Dasha said, “We’ll keep the blankets. We’ll need them.”\n Tatiana looked around the room. She saw pockets of disarray: books off the shelves, clothes on the floor, plates on the table. Where was the thing she was looking for? Ah, there. She went to the window and picked up a small drawing. It was a charcoal sketch of a latticed apple pie that Babushka had drawn back in September. Tatiana picked it up and placed it gently on Babushka’s chest. “All right, let’s go,” she said.\n After the girls wrapped Babushka in the sheet, Mama sewed up the top and the bottom, making a sack. Tatiana crossed herself, quickly wiped her tears, and went to the council.\n Later that afternoon two men from the council came. Mama paid them with two shots of vodka each. “Can’t believe you still have vodka, comrade,” one of the men said. “You’re the first one so far this month.”\n “Did you know vodka is the number-one trading item?” said the other man. “You can get yourself some nice bread if you’ve got any more.”\n The Metanov women exchanged looks. Tatiana knew they had two bottles left. After Papa died, and with Dimitri away, no one drank the vodka except Alexander when he came, and he drank only a little.\n “Where are you taking her?” Mama asked. “We’ll come with you.” They had all stayed home from work.\n The council men said, “We’ve got a full truck waiting outside. There is no room for you on this truck. We’ll be taking her to the closest cemetery. That would be Starorusskaya. Go and see her there.”\n “What about a grave?” Mama said. “A casket?”\n “Casket?” The man opened his mouth and silently laughed. “Comrade, give me the rest of your vodka and I still won’t be able to get you a casket. Who is going to make them? And out of what?”\n Tatiana nodded. She would take a casket and burn it for firewood herself before she used it to bury her grandmother. She shivered, buttoning up her coat.\n “What about a grave?” asked Mama, her face ashen and her voice cracking.\n “Comrade,” the council man exclaimed, “have you seen the snow, the frozen ground? Come outside with us, come and take a look, and while you’re at it, take a look at our truck.”\n Tatiana stepped forward, putting her hand on the man’s arm. “Comrade,” she said quietly, “just get her downstairs for us. That’s the hardest thing. Get her downstairs and we’ll take care of her from there.”\n She went to the attic, where once upon a time they used to hang their washing. There was no washing there now, but she did find what she was looking for — her childhood sled. It was a brightly painted blue sled with red runners. She carried it downstairs to the street, careful not to slip. Babushka’s body had already been taken down and left on the snowy pavement. “Come on, girls, on one-two-three,” Tatiana said to Marina and Dasha. Marina was too weak to help. Tatiana and Dasha lifted Babushka onto the sled and pulled her three blocks to Starorusskaya, with Mama and Marina following. Tatiana did reluctantly glimpse in the back of the open council truck. The bodies were piled three meters tall, one on top of another.\n “These are all the people who died today?” she asked the driver.\n “No,” he said. “That’s just what we picked up this morning.” He bent toward her. “Yesterday we picked up fifteen hundred bodies off the streets. Sell your vodka, girl, sell it and buy yourself some bread.”\n The entrance to the cemetery was barricaded with corpses, some in white sheets, some without.\n Tatiana saw a mother with a young child who had been pulling their dead father to the cemetery when they themselves froze in the entrance, in the snow. Closing her eyes, Tatiana shook the image out of her head. She wanted to get home. “We can’t get through. We can’t clear the path. Let’s leave our Babushka,” Tatiana said. “What else can we do?” She and Dasha took Babushka’s body and laid it gently in the snow next to the cemetery gates. They stood over her for a few minutes.\n Then they went home.\n They sold their two bottles of vodka and received only two loaves of white bread for it on the black market. Now that Tikhvin had gone to the Germans, there was no bread even on the black market. \n","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-47.html","bookId":1855,"book":{"id":1855,"title":"The Bronze Horseman (The Bronze Horseman #1)","description":"Storyline: \n Called “a Russian Thorn Birds,” The Bronze Horseman by Paullina Simons is a sweeping saga of love and war that has been a monumental bestseller all over the world. The acclaimed author of Tully, Simons has written a stirring tale of devotion, passion, secrets, betray, and sacrifice. “A love story both tender and fierce” (Publishers Weekly ) that “Recalls Dr. Zhivago” (People Magazine), The Bronze Horseman is rich and vivid historical fiction at its finest.\n \n","cover":"https://allnovel.net/images/the-bronze-horseman-the-bronze-horseman-1.jpg","author":"Paullina Simons","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:19:41 PM"}}
