{"id":79981,"no":49,"title":"Page 49","content":"FORTRESS PIECES\\n\\n THE flip side of white nights — Leningrad’s December. White nights — light, summer, sunshine, a pastel sky. December — darkness, blizzards, cloud cover, a hunkering sky. An oppressive sky.\\n\\n Bleak light appeared at around ten in the morning. It hovered around until about two, then reluctantly vanished, leaving darkness once more.\\n\\n Complete darkness. In early December the electricity was turned off in Leningrad not for a day but seemingly for good. The city was plunged into perpetual night. Trams stopped running. Buses hadn’t run in months because there was no fuel.\\n\\n The workweek was reduced to three days, then two days, then one day. Electricity was finally restored to a few businesses essential to the war effort: Kirov, the bread factory, the waterworks, Mama’s factory, a wing in Tatiana’s hospital. But the trams had stopped running permanently. There was no electricity in Tatiana’s apartment and no heat. Water remained only on the first floor, down the icy slide.\\n\\n These days brought a pall with the morning that blighted Tatiana’s spirit. It became impossible to think about anything but her own mortality — impossible as it was.\\n\\n At the beginning of December, America finally entered the war, something about the island of Hawaii and the Japanese. “Ah, maybe now that America is on our side . . .” said Mama, sewing.\\n\\n A few days after news of America, Tikhvin was recaptured. Those were words Tatiana understood. Tikhvin! It meant railroad, meant ice road, meant food. Meant an increase in ration?\\n\\n No, it didn’t mean that.\\n\\n A hundred and twenty-five grams of bread.\\n\\n When the electricity went out, the radio stopped working. No more metronome, no more news reports. No light, no water, no wood, no food. Tick tock. Tick tock.\\n\\n They sat and stared at each other, and Tatiana knew what they were thinking.\\n\\n Who was next?\\n\\n “Tell us a joke, Tania.”\\n\\n Sigh. “A customer asks the butcher, ‘Can I have five grams of sausage, please?’\\n\\n “ ‘Five grams?’ the butcher repeats. ‘Are you mocking me?’\\n\\n “ ‘Not at all,’ says the customer. ‘If I were mocking you, I would have asked you to slice it.’ ”\\n\\n Sighs. “Good joke, daughter.”\\n\\n Tatiana was coming back to the rooms dragging her bucket of water behind her through the hall. Crazy Slavin’s door was closed. It occurred to Tatiana that it had been closed for some time. But Petr Petrov’s door was open. He was sitting at his small table trying unsuccessfully to roll a cigarette.\\n\\n “Do you need help with that?” she asked, leaving her bucket on the floor and coming in.\\n\\n “Thank you, Tanechka, yes,” he said in a defeated voice. His hands were shaking.\\n\\n “What’s the matter? Go to work, there’ll be something there for lunch. They still feed you at Kirov, don’t they?”\\n\\n Kirov had been nearly destroyed by German artillery from just a few kilometers south in Pulkovo, but the Soviets had built a smaller factory inside the crumbled fa?ade, and until a few days ago Petr Pavlovich took tram Number 1 all the way to the front.\\n\\n Tatiana faintly remembered tram Number 1.\\n\\n “What’s the matter?” she asked. “You don’t want to go?”\\n\\n He shook his head. “Don’t worry about me, Tanechka. You’ve got enough to worry about.”\\n\\n “Tell me.” She paused. “Is it the bombs?”\\n\\n He shook his head.\\n\\n “Not the food, not the bombs?” She looked at his bald shrunken head and went to close the door to his room. “What is it?” she asked, quieter.\\n\\n Petr Pavlovich told her that he was moved to Kirov only recently to fix the motors of tanks that had broken down. There were no shipments, no new parts, and no actual tank motors.\\n\\n “I figured out a way to make airplane motors fit the tanks. I figured out how to repair them to use in the tanks, and then I fix them for airplanes, too.”\\n\\n “That sounds good,” she said. “For that you get a worker’s ration, right?” She added, “Three hundred and fifty grams of bread?”\\n\\n He waved at her and took a drag of the cigarette. “That’s not it. It’s the Satan spawn, the NKVD.” He spit with malice. “They were ready to shoot the poor bastards before me who couldn’t fix the engines. When I was brought in, they stood over me with their f*cking rifles to make sure I could fix the equipment.”\\n\\n Tatiana listened to him, her hand on his back, her bones chilled, her heart chilled. “But you did fix them, comrade,” she breathed out.\\n\\n “Yes, but what if I didn’t?” he said. “Isn’t the cold, the hunger, the Germans enough? How many more ways are there to kill us?”\\n\\n Tatiana backed away. “I’m sorry about your wife,” she uttered, opening the door.\\n\\n That afternoon as she was coming back home, his door was still open. Tatiana glanced in. Petr Pavlovich Petrov was still sitting behind his desk, the half-smoked cigarette Tatiana had rolled for him in his hands. He was dead. With trembling fingers Tatiana made the sign of the cross and closed the door.\\n\\n They stared at each other from the couch, from the bed, across the room. The four of them. They slept and ate in one room now. They would put the plates on their laps and they would have their evening bread. And then they would sit in front of the bourzhuika and watch the flames through the small window in the stove. That was the only light in the room. They had plenty of wick, and they had matches, but they had nothing to burn. If only they had some—\\n\\n Nothing to burn. Oh, no. Tatiana remembered.\\n\\n The motor oil. The motor oil Alexander had told her to buy on the Sunday in June when there was still ice cream, and sunshine, and a glimmer of joy. He had told her — and she hadn’t listened.\\n\\n And now look.\\n\\n No tick tock, tick tock anymore.\\n\\n “Marina, what are you doing?”\\n\\n Marina was peeling the wallpaper off the wall one December afternoon. Ripping off a chunk, she went to the bucket of water, dipped her hand in it, and moistened the backing.\\n\\n “What are you doing?” Tatiana repeated.\\n\\n Taking a spoon, Marina started to scrape off the wallpaper paste. “The woman in front of me in line today said some of the wallpaper paste was made with potato flour.” She was scraping frantically at the paper.\\n\\n Carefully Tatiana took the paper away from Marina. “Potato flour and glue,” Tatiana said.\\n\\n Marina ripped the paper back from Tatiana. “Don’t touch that. Get your own.”\\n\\n Tatiana repeated, “Potato flour and glue.”\\n\\n “So?”\\n\\n “Glue is poison.”\\n\\n Marina laughed soundlessly, scraping off the damp paste and spooning it into her mouth.\\n\\n “Dasha, what are you doing?”\\n\\n “I’m lighting the bourzhuika.” Dasha was standing in front of the stove window, throwing books onto the flames.\\n\\n “You’re burning books?”\\n\\n “Why not? We have to be warm.”\\n\\n Tatiana grabbed Dasha’s hand. “No, Dasha. Stop. Don’t burn books, please. We haven’t been reduced to that.”\\n\\n “Tania! If I had more energy, I would kill you and slice you open and eat you,” Dasha said, throwing another book onto the fire. “Don’t tell me—”\\n\\n “No, Dasha,” Tatiana said, holding on to her sister’s wrist. “Not books.”\\n\\n “We have no wood,” said Dasha matter-of-factly.\\n\\n As quickly as she could, Tatiana went and checked under her bed. Her Zoshchenko, John Stuart Mill, the English dictionary. She remembered that on Saturday afternoon she had been reading Pushkin and had carelessly left the precious volume by the couch. She turned to Dasha, who kept relentlessly throwing more books onto the fire.\\n\\n In horror, Tatiana saw The Bronze Horseman in her sister’s hands. “Dasha, no!” she screamed, and lunged at her sister. Where did she find the strength to scream, to lunge? Where did she find the strength for emotion?\\n\\n She grabbed it, YANKED it out of Dasha’s hands. “No!” She clutched her book to her chest. “Oh, my God, Dasha,” Tatiana said trembling. “That’s my book.”\\n\\n “They’re all our books, Tania,” Dasha said apathetically. “Who cares now? To stay warm is everything.”\\n\\n Licking her lips, Tatiana couldn’t speak for a while, she was so shaken. “Dasha, why books? We have the whole dining room set. A table and six chairs. It will last us the winter if we’re careful.” She wiped her mouth and stared at her hand. It was streaked with blood.\\n\\n “You want to saw up the dining room set?” Dasha said, throwing Karl Marx’s Communist Manifesto onto the fire. “Be my guest.”\\n\\n Something was happening to Tatiana. She didn’t want to scare her mother or her sister. She knew that Marina was beyond fear. Tatiana waited for Alexander. She would ask him what was happening to her. But before he came back and she had a chance to ask him, she noticed that Marina, too, was bleeding from her mouth. “Let’s go, Marina,” she said. “Let’s go to the hospital.”\\n\\n Finally a doctor came to take a look at them. “Scurvy,” the doctor said flatly. “It’s scurvy, girls. Everybody has it. You’re bleeding from the inside out. Your capillaries are getting too thin, and they’re breaking. You need vitamin C. Let’s see if we can get you a shot.”\\n\\n They both got a shot of vitamin C.\\n\\n Tatiana got better.\\n\\n Marina didn’t.\\n\\n In the night she whispered to Tatiana, “Tania, you listening?”\\n\\n “What, Marinka?”\\n\\n “I don’t want to die,” she whispered, and if she could have cried, she would have. She was barely able to emit a low wail. “I don’t want to die, Tania! If I hadn’t stayed here with Mama, I would be in Molotov right now with Babushka, and I wouldn’t die.”\\n\\n “You’re not going to die,” said Tatiana, putting her hand on Marina’s head.\\n\\n “I don’t want to die,” whispered Marina, “and not feel just once what you feel.” She struggled for her breath. “Just once in my life, Tania!”\\n\\n As if from a distance, Dasha’s voice came at them. “What does Tania feel?”\\n\\n Marina didn’t reply. “Tanechka . . .” she whispered. “What does it feel like?”\\n\\n “What does what feel like?” asked Dasha. “Indifference? Cold? Wasting away?”\\n\\n Tatiana continued to gently caress Marina’s forehead. “It feels,” she whispered, “as if you’re not alone. Now, come on, where is your strength? Do you remember us with Pasha, me rowing and you and Pasha swimming alongside trying to keep up? Where is that strength, Marinka?”\\n\\n The next morning Marina lay dead beside Tatiana.\\n\\n Dasha said, “We have her rations until the end of the month,” barely blinking at the sight of her dead cousin.\\n\\n Tatiana shook her head. “As you know, she has already eaten them. It’s the middle of the month. She’s got nothing left until the end of December.”\\n\\n Tatiana wrapped her cousin in a white sheet, Mama sewed up the top and bottom, and they slid Marina down the stairs and onto the street. They tried to put her in the sled, but they couldn’t lift her. After Tatiana made the sign of the cross on Marina, they left her on the snowy pavement. \\n\\n","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-49.html","bookId":1855,"book":{"id":1855,"title":"The Bronze Horseman (The Bronze Horseman #1)","description":"Storyline: Called “a Russian Thorn Birds,” The Bronze Horseman by Paullina Simons is a sweeping saga of love and war that has been a monumental bestseller all over the world. The acclaimed author of Tully, Simons has written a stirring tale of devotion, passion, secrets, betray, and sacrifice. “A love story both tender and fierce” (Publishers Weekly ) that “Recalls Dr. Zhivago” (People Magazine), The Bronze Horseman is rich and vivid historical fiction at its finest.\\n","cover":"https://allnovel.net/images/the-bronze-horseman-the-bronze-horseman-1.jpg","author":"Paullina Simons","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:19:41 PM"}}
