{"id":17202,"no":10,"title":"Chapter 10","content":"DICK’S life was now a monotonous nightmare. The same impossible situation was repeated again and again. If it were not for the fact that he knew Pearl Bellairs to be entirely devoid of humour, Dick might have suspected that she was having a little quiet fun with him, so grotesque were the anomalies of his double life. Grotesque, but dreary, intolerably dreary. Situations which seem, in contemplation, romantic and adventurous have a habit of proving, when actually experienced, as dull and daily as a bank clerk’s routine. When you read about it, a Jekyll and Hyde existence sounds delightfully amusing; but when you live through it, as Dick found to his cost, it is merely a boring horror. [Pg 83] In due course Dick was called up by the Military Authorities. He pleaded conscientious objection. The date of his appearance before the Tribunal was fixed. Dick did not much relish the prospect of being a Christian martyr; it seemed an anachronism. However, it would have to be done. He would be an absolutist; there would be a little buffeting, spitting, and scourging, followed by an indefinite term of hard labour. It was all very unpleasant. But nothing could be much more unpleasant than life as he was now living it. He didn’t even mind very much if they killed him. Being or not being—the alternatives left him equally cold. The days that preceded his appearance before the Tribunal were busy days, spent in consulting solicitors, preparing speeches, collecting witnesses. “We’ll give you a good run for your money,” said Hyman. “I hope they’ll be feeling a little uncomfortable by the time they have done with you, Greenow.” “Not nearly so uncomfortable as I [Pg 84]shall be feeling,” Dick replied, with a slightly melancholy smile. The South Marylebone Tribunal sat in a gloomy and fetid chamber in a police station. Dick, who was extremely sensitive to his surroundings, felt his fatigue and nervousness perceptibly increase as he entered the room. Five or six pitiable creatures with paralytic mothers or one-man businesses were briskly disposed of, and then it was Dick’s turn to present himself before his judges. He looked round the court, nodded to Hyman, smiled at Millicent, who had so far thawed their wartime coolness as to come and see him condemned, caught other friendly eyes. It was as though he were about to be electrocuted. The preliminaries passed off; he found himself answering questions in a loud, clear voice. Then the Military Representative began to loom horribly large. The Military Representative was a solicitor’s clerk disguised as a lieutenant in the Army Service Corps. He spoke in an accent that was more than genteel; it was rich, noble, aristocratic. Dick tried to remember where he had heard a [Pg 85]man speaking like that before. He had it now. Once when he had been at Oxford after term was over. He had gone to see the Varieties, which come twice nightly and with cheap seats to the theatre after the undergraduates have departed. One of the turns had been a Nut, a descendant of the bloods and Champagne Charlies of earlier days. A young man in an alpaca evening suit and a monocle. He had danced, sung a song, spoken some patter. Sitting in the front row of the stalls, Dick had been able to see the large, swollen, tuberculous glands in his neck. They wobbled when he danced or sang. Fascinatingly horrible, those glands; and the young man, how terribly, painfully pathetic. . . . When the Military Representative spoke, he could hear again that wretched Nut’s rendering of the Eton and Oxford voice. It unnerved him. “What is your religion, Mr. Greenow?” the Military Representative asked. Fascinated, Dick looked to see whether he too had tuberculous glands. The Lieutenant had to repeat his question [Pg 86]sharply. When he was irritated, his voice went back to its more natural nasal twang. Dick recovered his presence of mind. “I have no religion,” he answered. “But, surely, sir, you must have some kind of religion.” “Well, if I must, if it’s in the Army Regulations, you had better put me down as an Albigensian, or a Bogomile, or, better still, as a Manichean. One can’t find oneself in this court without possessing a profound sense of the reality and active existence of a power of evil equal to, if not greater than, the power of good.” “This is rather irrelevant, Mr. Greenow,” said the Chairman. “I apologize.” Dick bowed to the court. “But if,” the Military Representative continued—“if your objection is not religious, may I ask what it is?” “It is based on a belief that all war is wrong, and that the solidarity of the human race can only be achieved in practice by protesting against war, wherever it appears and in whatever form.” [Pg 87] “Do you disbelieve in force, Mr. Greenow?” “You might as well ask me if I disbelieve in gravitation. Of course, I believe in force: it is a fact.” “What would you do if you saw a German violating your sister?” said the Military Representative, putting his deadliest question. “Perhaps I had better ask my sister first,” Dick replied. “She is sitting just behind you in the court.” The Military Representative was covered with confusion. He coughed and blew his nose. The case dragged on. Dick made a speech; the Military Representative made a speech; the Chairman made a speech. The atmosphere of the court-room grew fouler and fouler. Dick sickened and suffocated in the second-hand air. An immense lassitude took possession of him; he did not care about anything—about the cause, about himself, about Hyman or Millicent or Pearl Bellairs. He was just tired. Voices buzzed and drawled in his ears—sometimes his own voice, sometimes other people’s. He did not listen to [Pg 88]what they said. He was tired—tired of all this idiotic talk, tired of the heat and smell. . . . Tired of picking up very thistly wheat sheaves and propping them up in stooks on the yellow stubble. For that was what, suddenly, he found himself doing. Overhead the sky expanded in endless steppes of blue-hot cobalt. The pungent prickly dust of the dried sheaves plucked at his nose with imminent sneezes, made his eyes smart and water. In the distance a reaping-machine whirred and hummed. Dick looked blankly about him, wondering where he was. He was thankful, at any rate, not to be in that sweltering court-room; and it was a mercy, too, to have escaped from the odious gentility of the Military Representative’s accent. And, after all, there were worse occupations than harvesting. Gradually, and bit by bit, Dick pieced together his history. He had, it seemed, done a cowardly and treacherous thing: deserted in the face of the enemy, betrayed his cause. He had a bitter letter [Pg 89]from Hyman. “Why couldn’t you have stuck it out? I thought it was in you. You’ve urged others to go to prison for their beliefs, but you get out of it yourself by sneaking off to a soft alternative service job on a friend’s estate. You’ve brought discredit on the whole movement.” It was very painful, but what could he answer? The truth was so ridiculous that nobody could be expected to swallow it. And yet the fact was that he had been as much startled to find himself working at Crome as anyone. It was all Pearl’s doing. He had found in his room a piece of paper covered with the large, flamboyant feminine writing which he knew to be Pearl’s. It was evidently the rough copy of an article on the delights of being a land-girl: dewy dawns, rosy children’s faces, quaint cottages, mossy thatch, milkmaids, healthy exercise. Pearl was being a land-girl; but he could hardly explain the fact to Hyman. Better not attempt to answer him. Dick hated the manual labour of the farm. It was hard, monotonous, dirty, and depressing. It inhibited almost completely [Pg 90]the functions of his brain. He was unable to think about anything at all; there was no opportunity to do anything but feel uncomfortable. God had not made him a Caliban to scatter ordure over fields, to pick up ordure from cattle-yards. His r?le was Prospero. “Ban, Ban, Caliban”—it was to that derisive measure that he pumped water, sawed wood, mowed grass; it was a march for his slow, clotted feet as he followed the dung-carts up the winding lanes. “Ban, Ban, Caliban—Ban, Ban, Ban . . .” “Oh, that bloody old fool Tolstoy,” was his profoundest reflection on a general subject in three months of manual labour and communion with mother earth. He hated the work, and his fellow-workers hated him. They mistrusted him because they could not understand him, taking the silence of his overpowering shyness for arrogance and the contempt of one class for another. Dick longed to become friendly with them. His chief trouble was that he did not know what to say. At meal-times he would spend long minutes in cudgelling his brains for some suitable remark to make. And even if [Pg 91]he thought of something good, like—“It looks as though it were going to be a good year for roots,” he somehow hesitated to speak, feeling that such a remark, uttered in his exquisitely modulated tones, would be, somehow, a little ridiculous. It was the sort of thing that ought to be said rustically, with plenty of Z’s and long vowels, in the manner of William Barnes. In the end, for lack of courage to act the yokel’s part, he generally remained silent. While the others were eating their bread and cheese with laughter and talk, he sat like the skeleton at the feast—a skeleton that longed to join in the revelry, but had not the power to move its stony jaws. On the rare occasions that he actually succeeded in uttering something, the labourers looked at one another in surprise and alarm, as though it were indeed a skeleton that had spoken. He was not much more popular with the other inhabitants of the village. Often, in the evenings, as he was returning from work, the children would pursue him, yelling. With the unerringly cruel instinct of the young they had recognized in him a fit object for abuse and lapidation. [Pg 92]An outcast member of another class, from whom that class in casting him out had withdrawn its protection, an alien in speech and habit, a criminal, as their zealous schoolmaster lost no opportunity of reminding them, guilty of the blackest treason against God and man—he was the obviously predestined victim of childish persecution. When stones began to fly, and dung and precocious obscenity, he bowed his head and pretended not to notice that anything unusual was happening. It was difficult, however, to look quite dignified. There were occasional short alleviations to the dreariness of his existence. One day, when he was engaged in his usual occupation of manuring, a familiar figure suddenly appeared along the footpath through the field. It was Mrs. Cravister. She was evidently staying at the big house; one of the Manorial dachshunds preceded her. He took off his cap. “Mr. Greenow!” she exclaimed, coming to a halt. “Ah, what a pleasure to see you again! Working on the land: so Tolstoyan. But I trust it doesn’t affect your ?sthetic ideas in the same way [Pg 93]as it did his. Fifty peasants singing together is music; but Bach’s chromatic fantasia is mere gibbering incomprehensibility.” “I don’t do this for pleasure,” Dick explained. “It’s hard labour, meted out to the Conscientious Objector.” “Of course, of course,” said Mrs. Cravister, raising her hand to arrest any further explanation. “I had forgotten. A conscientious objector, a Bible student. I remember how passionately devoted you were, even at school, to the Bible.” She closed her eyes and nodded her head several times. “On the contrary——” Dick began; but it was no good. Mrs. Cravister had determined that he should be a Bible student and it was no use gainsaying her. She cut him short. “Dear me, the Bible. . . . What a style! That alone would prove it to have been directly inspired. You remember how Mahomet appealed to the beauty of his style as a sign of his divine mission. Why has nobody done the same for the Bible? It remains for you, Mr. Greenow, to do so. You will [Pg 94]write a book about it. How I envy you!” “The style is very fine,” Dick ventured, “but don’t you think the matter occasionally leaves something to be desired?” “The matter is nothing,” cried Mrs. Cravister, making a gesture that seemed to send all meaning flying like a pinch of salt along the wind—“nothing at all. It’s the style that counts. Think of Madame Bovary.” “I certainly will,” said Dick. Mrs. Cravister held out her hand. “Good-bye. Yes, I certainly envy you. I envy you your innocent labour and your incessant study of that most wonderful of books. If I were asked, Mr. Greenow, what book I should take with me to a desert island, what single solitary book, I should certainly say the Bible, though, indeed, there are moments when I think I should choose Tristram Shandy. Good-bye.” Mrs. Cravister sailed slowly away. The little brown basset trotted ahead, straining his leash. One had the impression of a great ship being towed into harbour by a diminutive tug. [Pg 95] Dick was cheered by this glimpse of civilization and humanity. The unexpected arrival, one Saturday afternoon, of Millicent was not quite such an unmixed pleasure. “I’ve come to see how you’re getting on,” she announced, “and to put your cottage straight and make you comfortable.” “Very kind of you,” said Dick. He didn’t want his cottage put straight. Millicent was in the Ministry of Munitions now, controlling three thousand female clerks with unsurpassed efficiency. Dick looked at her curiously, as she talked that evening of her doings. “To think I should have a sister like that,” he said to himself. She was terrifying. “You do enjoy bullying other people!” he exclaimed at last. “You’ve found your true vocation. One sees now how the new world will be arranged after the war. The women will continue to do all the bureaucratic jobs, all that entails routine and neatness and interfering with other people’s affairs. And man, it is to be hoped, will be left free for the important statesman’s business, [Pg 96]free for creation and thought. He will stay at home and give proper education to the children, too. He is fit to do these things, because his mind is disinterested and detached. It’s an arrangement which will liberate all man’s best energies for their proper uses. The only flaw I can see in the system is that you women will be so fiendishly and ruthlessly tyrannical in your administration.” “You can’t seriously expect me to argue with you,” said Millicent. “No, please don’t. I am not strong enough. My dung-carrying has taken the edge off all my reasoning powers.” Millicent spent the next morning in completely rearranging Dick’s furniture. By lunch-time every article in the cottage was occupying a new position. “That’s much nicer,” said Millicent, surveying her work and seeing that it was good. There was a knock at the door. Dick opened it and was astonished to find Hyman. “I just ran down to see how you were getting on,” he explained. [Pg 97] “I’m getting on very well since my sister rearranged my furniture,” said Dick. He found it pleasing to have an opportunity of exercising his long unused powers of malicious irony. This was very mild, but with practice he would soon come on to something more spiteful and amusing. Hyman shook hands with Millicent, scowling as he did so. He was irritated that she was there; he wanted to talk with Dick alone. He turned his back on her and began addressing Dick. “Well,” he said, “I haven’t seen you since the fatal day. How is the turnip-hoeing?” “Pretty beastly,” said Dick. “Better than doing hard labour in a gaol, I suppose?” Dick nodded his head wearily, foreseeing what must inevitably come. “You’ve escaped that all right,” Hyman went on. “Yes; you ought to be thankful,” Millicent chimed in. “I still can’t understand why you did it, Greenow. It was a blow to me. I didn’t expect it of you.” Hyman [Pg 98]spoke with feeling. “It was desertion; it was treason.” “I agree,” said Millicent judicially. “He ought to have stuck to his principles.” “He ought to have stuck to what was right, oughtn’t he, Miss Greenow?” Hyman turned towards Millicent, pleased at finding someone who shared his views. “Of course,” she replied—“of course. I totally disagree with you about what is right. But if he believed it right not to fight, he certainly ought to have gone to prison for his belief.” Dick lit a pipe with an air of nonchalance. He tried to disguise the fact that he was feeling extremely uncomfortable under these two pairs of merciless, accusing eyes. “To my mind, at any rate,” said Millicent, “your position seems quite illogical and untenable, Dick.” It was a relief to be talked to and not about. “I’m sorry about that,” said Dick rather huskily—not a very intelligent remark, but what was there to say? “Of course, it’s illogical and untenable. [Pg 99]Your sister is quite right.” Hyman banged the table. “I can’t understand what induced you to take it up——” “After you’d said you were going to be one of the absolutes,” cried Hyman, interrupting and continuing Millicent’s words. “Why?” said Millicent. “Why, why, why?” Hyman echoed. Dick, who had been blowing out smoke at a great rate, put down his pipe. The taste of the tobacco was making him feel rather sick. “I wish you would stop,” he said wearily. “If I gave you the real reasons, you wouldn’t believe me. And I can’t invent any others that would be in the least convincing.” “I believe the real reason is that you were afraid of prison.” Dick leaned back in his chair and shut his eyes. He did not mind being insulted now; it made no difference. Hyman and Millicent were still talking about him, but what they said did not interest him; he scarcely listened. They went back to London together in the evening. [Pg 100] “Very intelligent woman, your sister,” said Hyman just before they were starting. “Pity she’s not on the right side about the war and so forth.” Four weeks later Dick received a letter in which Hyman announced that he and Millicent had decided to get married. “I am happy to think,” Dick wrote in his congratulatory reply, “that it was I who brought you together.” He smiled as he read through the sentence; that was what the Christian martyr might say to the two lions who had scraped acquaintance over his bones in the amphitheatre. One warm afternoon in the summer of 1918, Mr. Hobart, Clerk to the Wibley Town Council, was disturbed in the midst of his duties by the sudden entry into his office of a small dark man, dressed in corduroys and gaiters, but not having the air of a genuine agricultural labourer. “What may I do for you?” inquired Mr. Hobart. “I have come to inquire about my vote,” said the stranger. “Aren’t you already registered?” [Pg 101] “Not yet. You see, it isn’t long since the Act was passed giving us the vote.” Mr. Hobart stared. “I don’t quite follow,” he said. “I may not look it,” said the stranger, putting his head on one side and looking arch—“I may not look it, but I will confess to you, Mr.—er—Mr.—er——” “Hobart.” “Mr. Hobart, that I am a woman of over thirty.” Mr. Hobart grew visibly paler. Then, assuming a forced smile and speaking as one speaks to a child or a spoiled animal, he said: “I see—I see. Over thirty, dear me.” He looked at the bell, which was over by the fireplace at the other side of the room, and wondered how he should ring it without rousing the maniac’s suspicions. “Over thirty,” the stranger went on. “You know my woman’s secret. I am Miss Pearl Bellairs, the novelist. Perhaps you have read some of my books. Or are you too busy?” “Oh no, I’ve read several,” Mr. Hobart replied, smiling more and more [Pg 102]brightly and speaking in even more coaxing and indulgent tones. “Then we’re friends already, Mr. Hobart. Anyone who knows my books, knows me. My whole heart is in them. Now, you must tell me all about my poor little vote. I shall be very patriotic with it when the time comes to use it.” Mr. Hobart saw his opportunity. “Certainly, Miss Bellairs,” he said. “I will ring for my clerk and we’ll—er—we’ll take down the details.” He got up, crossed the room, and rang the bell with violence. “I’ll just go and see that he brings the right books,” he added, and darted to the door. Once outside in the passage, he mopped his face and heaved a sigh of relief. That had been a narrow shave, by Jove. A loony in the office—dangerous-looking brute, too. On the following day Dick woke up and found himself in a bare whitewashed room, sparsely furnished with a little iron bed, a washstand, a chair, and table. He looked round him in surprise. Where had he got to this time? He went to the [Pg 103]door and tried to open it; it was locked. An idea entered his mind: he was in barracks somewhere; the Military Authorities must have got hold of him somehow in spite of his exemption certificate. Or perhaps Pearl had gone and enlisted. . . . He turned next to the window, which was barred. Outside, he could see a courtyard, filled, not with soldiers, as he had expected, but a curious motley crew of individuals, some men and some women, wandering hither and thither with an air of complete aimlessness. Very odd, he thought—very odd. Beyond the courtyard, on the farther side of a phenomenally high wall, ran a railway line and beyond it a village, roofed with tile and thatch, and a tall church spire in the midst. Dick looked carefully at the spire. Didn’t he know it? Surely—yes, those imbricated copper plates with which it was covered, that gilded ship that served as wind vane, the little gargoyles at the corner of the tower there could be no doubt; it was Belbury church. Belbury—that was where the . . . No, no; he wouldn’t believe it. But looking down again into that high-walled courtyard, [Pg 104]full of those queer, aimless folk, he was forced to admit it. The County Asylum stands at Belbury. He had often noticed it from the train, a huge, gaunt building of sausage-coloured brick, standing close to the railway, on the opposite side of the line to Belbury village and church. He remembered how, the last time he had passed in the train, he had wondered what they did in the asylum. He had regarded it then as one of those mysterious, unapproachable places, like Lhassa or a Ladies’ Lavatory, into which he would never penetrate. And now, here he was, looking out through the bars, like any other madman. It was all Pearl’s doing, as usual. If there had been no bars, he would have thrown himself out of the window. He sat down on his bed and began to think about what he should do. He would have to be very sane and show them by his behaviour and speech that he was no more mad than the commonalty of mankind. He would be extremely dignified about it all. If a warder or a doctor or somebody came in to see him, he would rise to his feet and say in [Pg 105]the calmest and severest tones: “May I ask, pray, why I am detained here and upon whose authority?” That ought to stagger them. He practised that sentence, and the noble attitude with which he would accompany it, for the best part of an hour. Then, suddenly, there was the sound of a key in the lock. He hastily sat down again on the bed. A brisk little man of about forty, clean shaven and with pince-nez, stepped into the room, followed by a nurse and a warder in uniform. The doctor! Dick’s heart was beating with absurd violence; he felt like an amateur actor at the first performance of an imperfectly rehearsed play. He rose, rather unsteadily, to his feet, and in a voice that quavered a little with an emotion he could not suppress, began: “Pray I ask, may . . .” Then, realizing that something had gone wrong, he hesitated, stammered, and came to a pause. The doctor turned to the nurse. “Did you hear that?” he asked. “He called me May. He seems to think everybody’s a woman, not only himself.” [Pg 106] Turning to Dick with a cheerful smile, he went on: “Sit down, Miss Bellairs, please sit down.” It was too much. Dick burst into tears, flung himself upon the bed, and buried his face in the pillow. The doctor looked at him as he lay there sobbing, his whole body shaken and convulsed. “A bad case, I fear.” And the nurse nodded. For the next three days Dick refused to eat. It was certainly unreasonable, but it seemed the only way of making a protest. On the fourth day the doctor signed a certificate to the effect that forcible feeding had become necessary. Accompanied by two warders and a nurse, he entered Dick’s room. “Now, Miss Bellairs,” he said, making a last persuasive appeal, “do have a little of this nice soup. We have come to have lunch with you.” “I refuse to eat,” said Dick icily, “as a protest against my unlawful detention in this place. I am as sane as any of you here.” [Pg 107] “Yes, yes.” The doctor’s voice was soothing. He made a sign to the warders. One was very large and stout, the other wiry, thin, sinister, like the second murderer in a play. They closed in on Dick. “I won’t eat and I won’t be made to eat!” Dick cried. “Let me go!” he shouted at the fat warder, who had laid a hand on his shoulder. His temper was beginning to rise. “Now, do behave yourself,” said the fat warder. “It ain’t a bit of use kicking up a row. Now, do take a little of this lovely soup,” he added wheedlingly. “Let me go!” Dick screamed again, all his self-control gone. “I will not let myself be bullied.” He began to struggle violently. The fat warder put an arm round his shoulders, as though he were an immense mother comforting an irritable child. Dick felt himself helpless; the struggle had quite exhausted him; he was weaker than he had any idea of. He began kicking the fat man’s shins; it was the only way he could still show fight. “Temper, temper,” remonstrated the [Pg 108]warder, more motherly than ever. The thin warder stooped down, slipped a strap round the kicking legs, and drew it tight. Dick could move no more. His fury found vent in words—vain, abusive, filthy words, such as he had not used since he was a schoolboy. “Let me go,” he screamed—“let me go, you devils! You beasts, you swine! beasts and swine!” he howled again and again. They soon had him securely strapped in a chair, his head held back ready for the doctor and his horrible-looking tubes. They were pushing the horrors up his nostrils. He coughed and choked, spat, shouted inarticulately, retched. It was like having a spoon put on your tongue and being told to say A-a-h, but worse; it was like jumping into the river and getting water up your nose—how he had always hated that!—only much worse. It was like almost everything unpleasant, only much, much worse than all. He exhausted himself struggling against his utterly immovable bonds. They had to carry him to his bed, he was so weak. [Pg 109] He lay there, unmoving—for he was unable to move—staring at the ceiling. He felt as though he were floating on air, unsupported, solid no longer; the sensation was not unpleasant. For that reason he refused to let his mind dwell upon it; he would think of nothing that was not painful, odious, horrible. He thought about the torture which had just been inflicted on him and of the monstrous injustice of which he was a victim. He thought of the millions who had been and were still being slaughtered in the war; he thought of their pain, all the countless separate pains of them; pain incommunicable, individual, beyond the reach of sympathy; infinities of pain pent within frail finite bodies; pain without sense or object, bringing with it no hope and no redemption, futile, unnecessary, stupid. In one supreme apocalyptic moment he saw, he felt the universe in all its horror. They forcibly fed him again the following morning and again on the day after. On the fourth day pneumonia, the result of shock, complicated by [Pg 110]acute inflammation of the throat and pleura, set in. The fever and pain gained ground. Dick had not the strength to resist their ravages, and his condition grew hourly worse. His mind, however, continued to work clearly—too clearly. It occurred to him that he might very likely die. He asked for pencil and paper to be brought him, and putting forth all the little strength he had left, he began to make his testament. “I am perfectly sane,” he wrote at the top of the page, and underlined the words three times. “I am confined here by the most intol. injust.” As soon as he began, he realized how little time and strength were left him; it was a waste to finish the long words. “They are killing me for my opins. I regard this war and all wars as utter bad. Capitalists’ war. The devils will be smashed sooner later. Wish I could help. But it won’t make any difference,” he added on a new line and as though by an afterthought. “World will always be hell. Cap. or Lab., Engl. or Germ.—all beasts. One in a mill. is GOOD. [Pg 111]I wasn’t. Selfish intellect. Perhaps Pearl Bellairs better. If die, send corp. to hosp. for anatomy. Useful for once in my life!” Quite suddenly, he lapsed into delirium. The clear lucidity of his mind became troubled. The real world disappeared from before his eyes, and in its place he saw a succession of bright, unsteady visions created by his sick fantasy. Scenes from his childhood, long forgotten, bubbled up and disappeared. Unknown, hideous faces crowded in upon him; old friends revisited him. He was living in a bewildering mixture of the familiar and the strange. And all the while, across this changing unsubstantial world, there hurried a continual, interminable procession of dromedaries—countless high-domed beasts, with gargoyle faces and stiff legs and necks that bobbed as though on springs. Do what he could, he was unable to drive them away. He lost his temper with the brutes at last, struck at them, shouted; but in vain. The room rang with his cries of, “Get away, you beasts. Bloody humps. None of your nonconformist faces here.” And while [Pg 112]he was yelling and gesticulating (with his left hand only), his right hand was still busily engaged in writing. The words were clear and legible; the sentences consecutive and eminently sane. Dick might rave, but Pearl Bellairs remained calm and in full possession of her deplorable faculties. And what was Pearl doing with her busy pencil, while Dick, like a frenzied Betsy Trotwood, shouted at the trespassing camels? The first thing she did was to scratch out all that poor Dick had said about the war. Underneath it she wrote: “We shall not sheathe the sword, which we have not lightly . . .” And then, evidently finding that memorable sentence too long, particularly so since the addition of Poland and Czecho-Slovakia to the list of Allies, she began again. “We are fighting for honour and the defence of Small Nationalities. Plucky little Belgium! We went into the war with clean hands.” A little of Pearl’s thought seemed at this moment to have slopped over into Dick’s mind; for he suddenly stopped abusing his dromedaries and began to cry [Pg 113]out in the most pitiable fashion, “Clean hands, clean hands! I can’t get mine clean. I can’t, I can’t, I can’t. I contaminate everything.” And he kept rubbing his left hand against the bed-clothes and putting his fingers to his nose, only to exclaim, “Ugh, they still stink of goat!” and then to start rubbing again. The right hand wrote on unperturbed. “No peace with the Hun until he is crushed and humiliated. Self-respecting Britons will refuse to shake a Hunnish hand for many a long year after the war. No more German waiters. Intern the Forty-Seven Thousand Hidden Hands in High Places!” At this point, Pearl seemed to have been struck by a new idea. She took a clean page and began: “To the Girls of England. I am a woman and proud of the fact. But, girls, I blushed for my sex to-day when I read in the papers that there had been cases of English girls talking to Hun prisoners, and not only talking to them, but allowing themselves to be kissed by them. Imagine! Clean, healthy British girls allowing themselves to be kissed by the swinish and [Pg 114]bloodstained lips of the unspeakable Hun! Do you wonder that I blush for my sex? Stands England where she did? No, emphatically no, if these stories are true, and true—sadly and with a heavy bleeding heart do I admit it—true they are.” “Clean hands, clean hands,” Dick was still muttering, and applying his ringers to his nose once more, “Christ,” he cried, “how they stink! Goats, dung . . .” “Is there any excuse for such conduct?” the pencil continued. “The most that can be said in palliation of the offence is that girls are thoughtless, that they do not consider the full significance of their actions. But listen to me, girls of all ages, classes and creeds, from the blue-eyed, light-hearted flapper of sixteen to the stern-faced, hard-headed business woman—listen to me. There is a girlish charm about thoughtlessness, but there is a point beyond which thoughtlessness becomes criminal. A flapper may kiss a Hun without thinking what she is doing, merely for the fun of the thing; perhaps, even, out of misguided pity. Will she repeat the offence if she realizes, as she [Pg 115]must realize if she will only think, that this thoughtless fun, this mawkish and hysterical pity, is nothing less than Treason? Treason—it is a sinister word, but . . .” The pencil stopped writing; even Pearl was beginning to grow tired. Dick’s shouting had died away to a hoarse, faint whisper. Suddenly her attention was caught by the last words that Dick had written—the injunction to send his body, if he died, to a hospital for an anatomy. She put forth a great effort. “NO. NO,” she wrote in huge capitals. “Bury me in a little country churchyard, with lovely marble angels like the ones in St. George’s at Windsor, over Princess Charlotte’s tomb. Not anatomy. Too horrible, too disgus . . .” The coma which had blotted out Dick’s mind fell now upon hers as well. Two hours later Dick Greenow was dead; the fingers of his right hand still grasped a pencil. The scribbled papers were thrown away as being merely the written ravings of a madman; they were accustomed that sort of thing at the asylum. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3086/85170.html","bookId":958,"book":{"id":958,"title":"Limbo","description":"简介： THE most sumptuous present that Millicent received on her seventh birthday was a dolls house. With love to darling little Mill from Aunty Loo. Aunt Loo was immensely rich, and the dolls house was almost as grandiose and massive as herself....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3086","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
