{"id":17198,"no":6,"title":"Chapter 6","content":"“WHAT a life!” said Dick, with a sigh of weariness as the train moved out of Euston. Not a bad life, Millicent thought. “But horribly fatiguing. I am quite outreined by it.” “Outreined” was Dick’s translation of éreinté. He liked using words of his own manufacture; one had to learn his idiom before one could properly appreciate his intimate conversation. [Pg 49] Dick had every justification for being outreined. The spring and summer had passed for him in a whirl of incessant activity. He had written three long chapters of the New Synthetic Philosophy, and had the material for two more ready in the form of notes. He had helped to organize and bring to its successful conclusion the great carpenters’ strike of May and June. He had written four pamphlets and a small army of political articles. And this comprised only half his labour; for nightly, from twelve till two, Pearl Bellairs emerged to compose the masterpieces which supplied Dick with his bread and butter. Apes in Purple had been published in May. Since then she had finished La Belle Dame sans Morality, and had embarked on the first chapters of Daisy’s Voyage to Cythera. Her weekly articles, “For the Girls of Britain,” had become, during this period, a regular and favourite feature in the pages of Hildebrand’s Sabbath, that prince of Sunday papers. At the beginning of July, Dick considered that he had earned a holiday, and now they were off, he and Millicent, for the North. [Pg 50] Dick had taken a cottage on the shore of one of those long salt-water lochs that give to the west coast of Scotland such a dissipated appearance on the map. For miles around there was not a living soul who did not bear the name of Campbell—two families only excepted, one of whom was called Murray-Drummond and the other Drummond-Murray. However, it was not for the people that Dick and Millicent had come, so much as for the landscape, which made up in variety for anything that the inhabitants might lack. Behind the cottage, in the midst of a narrow strip of bog lying between the loch and the foot of the mountains, stood one of the numerous tombs of Ossian, a great barrow of ancient stones. And a couple of miles away the remains of Deirdre’s Scottish refuge bore witness to the Celtic past. The countryside was dotted with the black skeletons of medi?val castles. Astonishing country, convulsed into fantastic mountain shapes, cut and indented by winding fiords. On summer days the whole of this improbable landscape became blue and remote and [Pg 51]aerially transparent. Its beauty lacked all verisimilitude. It was for that reason that Dick chose the neighbourhood for his holidays. After the insistent actuality of London this frankly unreal coast was particularly refreshing to a jaded spirit. “Nous sommes ici en plein romantisme,” said Dick on the day of their arrival, making a comprehensive gesture towards the dream-like scenery, and for the rest of his holiday he acted the part of a young romantic of the palmy period. He sat at the foot of Ossian’s tomb and read Lamartine; he declaimed Byron from the summit of the mountains and Shelley as he rowed along the loch. In the evening he read George Sand’s Indiana; he agonized with the pure, but passionate, heroine, while his admiration for Sir Brown, her English lover, the impassive giant who never speaks and is always clothed in faultless hunting costume, knew no bounds. He saturated himself in the verses of Victor Hugo, and at last almost came to persuade himself that the words, Dieu, infinité, eternité, with which the works of that deplorable genius are so profusely sprinkled, actually [Pg 52]possessed some meaning, though what that meaning was he could not, even in his most romantic transports, discover. Pearl Bellairs, of course, understood quite clearly their significance, and though she was a very poor French scholar she used sometimes to be moved almost to tears by the books she found lying about when she came into existence after midnight. She even copied out extracts into her notebooks with a view to using them in her next novel. “Les plus désespérés sont les chants les plus beaux, Et j’en sais d’immortels qui sont de purs sanglots,” was a couplet which struck her as sublime. Millicent, meanwhile, did the housekeeping with extraordinary efficiency, took a great deal of exercise, and read long, serious books; she humoured her brother in his holiday romanticism, but refused to take part in the game. The declaration of war took them completely by surprise. It is true that a Scotsman found its way into the cottage by about lunch-time every day, but it was never read, and served only to light fires and wrap up fish and things of that [Pg 53]sort. No letters were being forwarded, for they had left no address; they were isolated from the world. On the fatal morning Dick had, indeed, glanced at the paper, without however noticing anything out of the ordinary. It was only later when, alarmed by the rumours floating round the village shop, he came to examine his Scotsman more closely, that he found about half-way down the third column of one of the middle pages an admirable account of all that had been so tragically happening in the last twenty-four hours; he learnt with horror that Europe was at war and that; his country too had entered the arena. Even in the midst of his anguish of spirit he could not help admiring the Scotsman’s splendid impassivity—no headlines, no ruffling of the traditional aristocratic dignity. Like Sir Rodolphe Brown in Indiana, he thought, with a sickly smile. Dick determined to start for London at once. He felt that he must act, or at least create the illusion of action; he could not stay quietly where he was. It was arranged that he should set out that afternoon, while Millicent should follow [Pg 54]a day or two later with the bulk of the luggage. The train which took him to Glasgow was slower than he thought it possible for any train to be. He tried to read, he tried to sleep; it was no good. His nervous agitation was pitiable; he made little involuntary movements with his limbs, and every now and then the muscles of his face began twitching in a spasmodic and uncontrollable tic. There were three hours to wait in Glasgow; he spent them in wandering about the streets. In the interminable summer twilight the inhabitants of Glasgow came forth into the open to amuse themselves; the sight almost made him sick. Was it possible that there should be human beings so numerous and so uniformly hideous? Small, deformed, sallow, they seemed malignantly ugly, as if on purpose. The words they spoke were incomprehensible. He shuddered; it was an alien place—it was hell. The London train was crammed. Three gross Italians got into Dick’s carriage, and after they had drunk and eaten with loud, unpleasant gusto, they prepared themselves for sleep by taking off their [Pg 55]boots. Their feet smelt strongly ammoniac, like a cage of mice long uncleaned. Acutely awake, while the other occupants of the compartment enjoyed a happy unconsciousness, he looked at the huddled carcasses that surrounded him. The warmth and the smell of them was suffocating, and there came to his mind, with the nightmarish insistence of a fixed idea, the thought that every breath they exhaled was saturated with disease. To be condemned to sit in a hot bath of consumption and syphilis—it was too horrible! The moment came at last when he could bear it no longer; he got up and went into the corridor. Standing there, or sitting sometimes for a few dreary minutes in the lavatory, he passed the rest of the night. The train roared along without a stop. The roaring became articulate: in the days of his childhood trains used to run to the tune of “Lancashire, to Lancashire, to fetch a pocket-handkercher; to Lancashire, to Lancashire . . .” But to-night the wheels were shouting insistently, a million times over, two words only—“the War, the War; the War, the War.” He tried [Pg 56]desperately to make them say something else, but they refused to recite Milton; they refused to go to Lancashire; they went on with their endless Tibetan litany—the War, the War, the War. By the time he reached London, Dick was in a wretched state. His nerves were twittering and jumping within him; he felt like a walking aviary. The tic in his face had become more violent and persistent. As he stood in the station, waiting for a cab, he overheard a small child saying to its mother, “What’s the matter with that man’s face, mother?” “Sh—sh, darling,” was the reply. “It’s rude.” Dick turned and saw the child’s big round eyes fixed with fascinated curiosity upon him, as though he were a kind of monster. He put his hand to his forehead and tried to stop the twitching of the muscles beneath the skin. It pained him to think that he had become a scarecrow for children. Arrived at his flat, Dick drank a glass of brandy and lay down for a rest. He felt exhausted—ill. At half-past one he got up, drank some more brandy, and crept [Pg 57]down into the street. It was intensely hot; the pavements reverberated the sunlight in a glare which hurt his eyes; they seemed to be in a state of grey incandescence. A nauseating smell of wetted dust rose from the roadway, along which a water-cart was slowly piddling its way. He realized suddenly that he ought not to have drunk all that brandy on an empty stomach; he was definitely rather tipsy. He had arrived at that state of drunkenness when the senses perceive things clearly, but do not transmit their knowledge to the understanding. He was painfully conscious of this division, and it needed all the power of his will to establish contact between his parted faculties. It was as though he were, by a great and prolonged effort, keeping his brain pressed against the back of his eyes; as soon as he relaxed the pressure, the understanding part slipped back, the contact was broken, and he relapsed into a state bordering on imbecility. The actions which ordinarily one does by habit and without thinking, he had to perform consciously and voluntarily. He had to reason out the problem of walking—first the left foot [Pg 58]forward, then the right. How ingeniously he worked his ankles and knees and hips! How delicately the thighs slid past one another! He found a restaurant and sat there drinking coffee and trying to eat an omelette until he felt quite sober. Then he drove to the offices of the Weekly International to have a talk with Hyman, the editor. Hyman was sitting in his shirt-sleeves, writing. He lifted his head as Dick came in. “Greenow,” he shouted delightedly, “we were all wondering what had become of you. We thought you’d joined the Army.” Dick shook his head, but did not speak; the hot stuffy smell of printer’s ink and machinery combined with the atrocious reek of Hyman’s Virginian cigarettes to make him feel rather faint. He sat down on the window-ledge, so as to be able to breathe an uncontaminated air. “Well,” he said at last, “what about it?” “It’s going to be hell.” [Pg 59] “Did you suppose I thought it was going to be paradise?” Dick replied irritably. “Internationalism looks rather funny now, doesn’t it?” “I believe in it more than ever I did,” cried Hyman. His face lit up with the fervour of his enthusiasm. It was a fine face, gaunt, furrowed, and angular, for all that he was barely thirty, looking as though it had been boldly chiselled from some hard stone. “The rest of the world may go mad; we’ll try and keep our sanity. The time will come when they’ll see we were right.” Hyman talked on. His passionate sincerity and singleness of purpose were an inspiration to Dick. He had always admired Hyman—with the reservations, of course, that the man was rather a fanatic and not so well-educated as he might have been—but to-day he admired him more than ever. He was even moved by that perhaps too facile eloquence which of old had been used to leave him cold. After promising to do a series of articles on international relations for the paper, Dick went home, feeling better than he had done all day. He decided that he would begin writing his articles at once. He collected pens, [Pg 60]paper, and ink and sat down in a business-like way at his bureau. He remembered distinctly biting the tip of his pen-holder; it tasted rather bitter. And then he realized he was standing in Regent Street, looking in at one of the windows of Liberty’s. For a long time he stood there quite still, absorbed to all appearance in the contemplation of a piece of peacock-blue fabric. But all his attention was concentrated within himself, not on anything outside. He was wondering—wondering how it came about that he was sitting at his writing-table at one moment, and standing, at the next, in Regent Street. He hadn’t—the thought flashed upon him—he hadn’t been drinking any more of that brandy, had he? No, he felt himself to be perfectly sober. He moved slowly away and continued to speculate as he walked. At Oxford Circus he bought an evening paper. He almost screamed aloud when he saw that the date printed at the head of the page was August 12th. It was on August 7th that he had sat down at his writing-table to compose those articles. [Pg 61]Five days ago, and he had not the faintest recollection of what had happened in those five days. He made all haste back to the flat. Everything was in perfect order. He had evidently had a picnic lunch that morning—sardines, bread and jam, and raisins; the remains of it still covered the table. He opened the sideboard and took out the brandy bottle. Better make quite sure. He held it up to the light; it was more than three-quarters full. Not a drop had gone since the day of his return. If brandy wasn’t the cause, then what was? As he sat there thinking, he began in an absent-minded way to look at his evening paper. He read the news on the front page, then turned to the inner sheets. His eye fell on these words printed at the head of the column next the leading article: “To the Women of the Empire. Thoughts in War-Time. By Pearl Bellairs.” Underneath in brackets: “The first of a series of inspiring patriotic articles by Miss Bellairs, the well-known novelist.” Dick groaned in agony. He saw in a [Pg 62]flash what had happened to his five missing days. Pearl had got hold of them somehow, had trespassed upon his life out of her own reserved nocturnal existence. She had taken advantage of his agitated mental state to have a little fun in her own horrible way. He picked up the paper once more and began to read Pearl’s article. “Inspiring and patriotic”: those were feeble words in which to describe Pearl’s shrilly raucous chauvinism. And the style! Christ! to think that he was responsible, at least in part, for this. Responsible, for had not the words been written by his own hand and composed in some horrible bluebeard’s chamber of his own brain? They had, there was no denying it. Pearl’s literary atrocities had never much distressed him; he had long given up reading a word she wrote. Her bank balance was the only thing about her that interested him. But now she was invading the sanctities of his private life. She was trampling on his dearest convictions, denying his faith. She was a public danger. It was all too frightful. [Pg 63] He passed the afternoon in misery. Suicide or brandy seemed the only cures. Not very satisfactory ones, though. Towards evening an illuminating idea occurred to him. He would go and see Rogers. Rogers knew all about psychology—from books, at any rate: Freud, Jung, Morton Prince, and people like that. He used to try hypnotic experiments on his friends and even dabbled in amateur psychotherapy. Rogers might help him to lay the ghost of Pearl. He ate a hasty dinner and went to see Rogers in his Kensington rooms. Rogers was sitting at a table with a great book open in front of him. The reading-lamp, which was the only light in the room, brightly illumined one side of the pallid, puffy, spectacled face, leaving the other in complete darkness, save for a little cedilla of golden light caught on the fold of flesh at the corner of his mouth. His huge shadow crossed the floor, began to climb the wall, and from the shoulders upwards mingled itself with the general darkness of the room. “Good evening, Rogers,” said Dick [Pg 64]wearily. “I wish you wouldn’t try and look like Rembrandt’s ‘Christ at Emmaus’ with these spectacular chiaroscuro effects.” Rogers gave vent to his usual nervous giggling laugh. “This is very nice of you to come and see me, Greenow.” “How’s the Board of Trade?” Rogers was a Civil Servant by profession. “Oh, business as usual, as the Daily Mail would say.” Rogers laughed again as though he had made a joke. After a little talk of things indifferent, Dick brought the conversation round to himself. “I believe I’m getting a bit neurasthenic,” he said. “Fits of depression, nervous pains, lassitude, an?mia of the will. I’ve come to you for professional advice. I want you to nose out my suppressed complexes, analyse me, dissect me. Will you do that for me?” Rogers was evidently delighted. “I’ll do my best,” he said, with assumed modesty. “But I’m no good at the thing, so you mustn’t expect much.” “I’m at your disposal,” said Dick. Rogers placed his guest in a large arm-chair. [Pg 65]“Relax your muscles and think of nothing at all.” Dick sat there flabby and abstracted while Rogers made his preparations. His apparatus consisted chiefly in a notebook and a stop-watch. He seated himself at the table. “Now,” he said solemnly, “I want you to listen to me. I propose to read out a list of words; after each of the words you must say the first word that comes into your head. The very first, mind, however foolish it may seem. And say it as soon as it crosses your mind; don’t wait to think. I shall write down your answers and take the time between each question and reply.” Rogers cleared his throat and started. “Mother,” he said in a loud, clear voice. He always began his analyses with the family. For since the majority of kinks and complexes date from childhood, it is instructive to investigate the relations between the patient and those who surrounded him at an early age. “Mother.” “Dead,” replied Dick immediately. He had scarcely known his mother. “Father.” [Pg 66] “Dull.” One and a fifth seconds’ interval. “Sister.” Rogers pricked his ears for the reply: his favourite incest-theory depended on it. “Fabian Society,” said Dick, after two seconds’ interval. Rogers was a little disappointed. He was agreeably thrilled and excited by the answer he received to his next word: “Aunt.” The seconds passed, bringing nothing with them; and then at last there floated into Dick’s mind the image of himself as a child, dressed in green velvet and lace, a perfect Bubbles boy, kneeling on Auntie Loo’s lap and arranging a troop of lead soldiers on the horizontal projection of her corsage. “Bosom,” he said. Rogers wrote down the word and underlined it. Six and three-fifths seconds: very significant. He turned now to the chapter of possible accidents productive of nervous shocks. “Fire.” “Coal.” “Sea.” “Sick.” [Pg 67] “Train.” “Smell.” And so on. Dull answers all the time. Evidently, nothing very catastrophic had ever happened to him. Now for a frontal attack on the fortress of sex itself. “Women.” There was rather a long pause, four seconds, and then Dick replied, “Novelist.” Rogers was puzzled. “Breast.” “Chicken.” That was disappointing. Rogers could find no trace of those sinister moral censors, expurgators of impulse, suppressors of happiness. Perhaps the trouble lay in religion. “Christ,” he said. Dick replied, “Amen,” with the promptitude of a parish clerk. “God.” Dick’s mind remained a perfect blank. The word seemed to convey to him nothing at all. God, God. After a long time there appeared before his inward eye the face of a boy he had known at school and at Oxford, one Godfrey Wilkinson, called God for short. [Pg 68] “Wilkinson.” Ten seconds and a fifth. A few more miscellaneous questions, and the list was exhausted. Almost suddenly, Dick fell into a kind of hypnotic sleep. Rogers sat pensive in front of his notes; sometimes he consulted a text-book. At the end of half an hour he awakened Dick to tell him that he had had, as a child, consciously or unconsciously, a great Freudian passion for his aunt; that later on he had had another passion, almost religious in its fervour and intensity, for somebody called Wilkinson; and that the cause of all his present troubles lay in one or other of these episodes. If he liked, he (Rogers) would investigate the matter further with a view to establishing a cure. Dick thanked him very much, thought it wasn’t worth taking any more trouble, and went home.","sourceLink":"http://novel.tingroom.com/duanpian/3086/85166.html","bookId":958,"book":{"id":958,"title":"Limbo","description":"简介： THE most sumptuous present that Millicent received on her seventh birthday was a dolls house. With love to darling little Mill from Aunty Loo. Aunt Loo was immensely rich, and the dolls house was almost as grandiose and massive as herself....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3086","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
