{"id":17200,"no":8,"title":"Chapter 8","content":"THE months passed by. The longer the war lasted, the longer it seemed likely to last. Dick supported life somehow. Then came the menace of conscription. [Pg 72]The Weekly International organized a great anti-conscription campaign, in which Hyman and Dick were the leading spirits. Dick was almost happy. This kind of active work was new to him and he enjoyed it, finding it exciting and at the same time sedative. For a self-absorbed and brooding mind, pain itself is an anodyne. He enjoyed his incessant journeys, his speechmaking to queer audiences in obscure halls and chapels; he liked talking with earnest members of impossible Christian sects, pacifists who took not the faintest interest in the welfare of humanity at large, but were wholly absorbed in the salvation of their own souls and in keeping their consciences clear from the faintest trace of blood-guiltiness. He enjoyed the sense of power which came to him, when he roused the passion of the crowd to enthusiastic assent, or breasted the storm of antagonism. He enjoyed everything—even getting a bloody nose from a patriot hired and intoxicated by a great evening paper to break up one of his meetings. It all seemed tremendously exciting and important at the time. And yet when, in quiet moments, he came [Pg 73]to look back on his days of activity, they seemed utterly empty and futile. What was left of them? Nothing, nothing at all. The momentary intoxication had died away, the stirred ant’s-nest had gone back to normal life. Futility of action! There was nothing permanent, or decent, or worth while, except thought. And of that he was almost incapable now. His mind, when it was not occupied by the immediate and actual, turned inward morbidly upon itself. He looked at the manuscript of his book and wondered whether he would ever be able to go on with it. It seemed doubtful. Was he, then, condemned to pass the rest of his existence enslaved to the beastliness and futility of mere quotidian action? And even in action his powers were limited; if he exerted himself too much—and the limits of fatigue were soon reached—Pearl Bellairs, watching perpetually like a hungry tigress for her opportunity, leapt upon him and took possession of his conscious faculties. And then, it might be for a matter of hours or of days, he was lost, blotted off the register of living souls, while she performed, with intense and [Pg 74]hideous industry, her self-appointed task. More than once his anti-conscription campaigns had been cut short and he himself had suddenly disappeared from public life, to return with the vaguest stories of illness or private affairs—stories that made his friends shake their heads and wonder which it was among the noble army of vices that poor Dick Greenow was so mysteriously addicted to. Some said drink, some said women, some said opium, and some hinted at things infinitely darker and more horrid. Hyman asked him point-blank what it was, one morning when he had returned to the office after three days’ unaccountable absence. Dick blushed painfully. “It isn’t anything you think,” he said. “What is it, then?” Hyman insisted. “I can’t tell you,” Dick replied desperately and in torture, “but I swear it’s nothing discreditable. I beg you won’t ask me any more.” Hyman had to pretend to be satisfied with that.","sourceLink":"http://novel.tingroom.com/duanpian/3086/85168.html","bookId":958,"book":{"id":958,"title":"Limbo","description":"简介： THE most sumptuous present that Millicent received on her seventh birthday was a dolls house. With love to darling little Mill from Aunty Loo. Aunt Loo was immensely rich, and the dolls house was almost as grandiose and massive as herself....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3086","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
