{"id":20799,"no":2,"title":"Chapter 2","content":"I SEEMED SWINGING IN A mighty rhythm through orbit vastness. Sparkling points of light spluttered and shot past me. They were stars, I knew, and flaring comets, that peopled my flight among the suns. As I reached the limit of my swing and prepared to rush back on the counter-swing, a great gong struck, and thundered and reverberated through abysmal space. For an immeasurable period, quiescent, lapped in the rippling of placid centuries, I enjoyed and pondered my tremendous flight. \\n\\n \\n\\n But a change came over the face of the dream, for a dream I told myself it must be. My rhythm grew shorter and shorter. I was jerked from swing to counter-swing with irritating haste. I could scarcely catch my breath, so fiercely was I impelled through the heavens. The gong thundered more frequently and more furiously. I grew to await it with a nameless dread. Then it seemed as though I were being dragged over rasping sands, white and hot in the sun. This gave place to a sense of intolerable anguish. My skin was scorching in the torment of fire. The gong clanged and knelled. The sparkling points of light flashed past me in an interminable stream, as though the whole sidereal system were dropping into the void. I gasped, caught my breath painfully, and opened my eyes. Two men were kneeling beside me, working over me. My mighty rhythm was the lift and forward plunge of a ship on the sea. The terrific gong was a frying-pan, hanging on the wall, that rattled and clattered with each leap of the ship. The rasping, scorching sands were a man\u0027s hard hands chafing my naked chest. I squirmed under the pain of it and half lifted my head. My chest was raw and red, and I could see tiny blood-globules starting through the torn and inflamed cuticle. \\n\\n \\n\\n \u0027That\u0027ll do, Yonson,\u0027 one of the men said. \u0027Carn\u0027t yer see you\u0027ve bloomin\u0027 well rubbed all the gent\u0027s skin off?\u0027 \\n\\n \\n\\n The man addressed as Yonson, a man of the heavy Scandinavian type, ceased chafing me and arose awkwardly to his feet. The man who had spoken to him was clearly a Cockney, with the clean lines and weakly pretty, almost effeminate, face of the man who has absorbed the sound of Bow Bells with his mother\u0027s milk. A draggled muslin cap on his head, and a dirty gunny-sack about his slim hips, proclaimed him cook of the decidedly dirty ship\u0027s galley in which I found myself. \\n\\n \\n\\n \u0027An\u0027 \u0027ow yer feelin\u0027 now, sir?\u0027 he asked, with the subservient smirk which comes only of generations of tip-seeking ancestors. \\n\\n \\n\\n For reply, I twisted weakly into a sitting posture, and was helped by Yonson to my feet. The rattle and bang of the frying-pan was grating horribly on my nerves. I could not collect my thoughts. Clutching the woodwork of the galley for support,- and I confess the grease with which it was scummed put my teeth on edge,- I reached across a hot cooking-range to the offending utensil, unhooked it, and wedged it securely into the coal-box. \\n\\n \\n\\n The cook grinned at my exhibition of nerves, and thrust into my hand a steaming mug with an \u0027\u0027Ere, this\u0027ll do yer good.\u0027 \\n\\n \\n\\n It was a nauseous mess,- ship\u0027s coffee,- but the heat of it was revivifying. Between gulps of the molten stuff I glanced down at my raw and bleeding chest and turned to the Scandinavian. \\n\\n \\n\\n \u0027Thank you, Mr. Yonson,\u0027 I said; \u0027but don\u0027t you think your measures were rather heroic?\u0027 \\n\\n \\n\\n It was because he understood the reproof of my action, rather than of my words, that he held up his palm for inspection. It was remarkably calloused. I passed my hand over the horny projections, and my teeth went on edge once more from the horrible rasping sensation produced. \\n\\n \\n\\n \u0027My name is Johnson, not Yonson,\u0027 he said in very good, though slow, English, with no more than a shade of accent to it. \\n\\n \\n\\n There was mild protest in his pale-blue eyes, and, withal, a timid frankness and manliness that quite won me to him. \\n\\n \\n\\n \u0027Thank you, Mr. Johnson,\u0027 I corrected, and reached out my hand for his. \\n\\n \\n\\n He hesitated, awkward and bashful, shifted his weight from one leg to the other, then blunderingly gripped my hand in a hearty shake. \\n\\n \\n\\n \u0027Have you any dry clothes I may put on?\u0027 I asked the cook. \\n\\n \\n\\n \u0027Yes, sir,\u0027 he answered, with cheerful alacrity. \u0027I\u0027ll run down an\u0027 tyke a look over my kit, if you\u0027ve no objections, sir, to wearin\u0027 my things.\u0027 \\n\\n \\n\\n He dived out of the galley door, or glided, rather, with a swiftness and smoothness of gait that struck me as being not so much cat-like as oily. In fact, this oiliness, or greasiness, as I was later to learn, was probably the most salient expression of his personality. \\n\\n \\n\\n \u0027And where am I?\u0027 I asked Johnson, whom I took, and rightly, to be one of the sailors. \u0027What vessel is this? And where is she bound?\u0027 \\n\\n \\n\\n \u0027Off the Farralones, heading about sou\u0027west,\u0027 he answered slowly and methodically, as though groping for his best English, and rigidly observing the order of my queries. \u0027The schooner Ghost; bound seal-hunting to Japan.\u0027 \\n\\n \\n\\n \u0027And who is the captain? I must see him as soon as I am dressed?\u0027 \\n\\n \\n\\n Johnson looked puzzled and embarrassed. He hesitated while he groped in his vocabulary and framed a complete answer. \u0027The cap\u0027n is Wolf Larsen, or so men call him. I never heard his other name. But you better speak soft with him. He is mad this morning. The mate-\u0027 \\n\\n \\n\\n But he did not finish. The cook had glided in. \\n\\n \\n\\n \u0027Better sling yer \u0027ook out of \u0027ere, Yonson,\u0027 he said. \u0027The Old Man\u0027ll be wantin\u0027 yer on deck, an\u0027 this ayn\u0027t no d\u0027y to fall foul of \u0027im.\u0027 \\n\\n \\n\\n Johnson turned obediently to the door, at the same time, over the cook\u0027s shoulder, favoring me with an amazingly solemn and portentous wink, as though to emphasize his interrupted remark and the need for me to be soft-spoken with the captain. \\n\\n \\n\\n Hanging over the cook\u0027s arm was a loose and crumpled array of evil-looking and sour-smelling garments. \\n\\n \\n\\n \u0027They was put aw\u0027y wet, sir,\u0027 he vouchsafed explanation. \u0027But you\u0027ll \u0027ave to make them do while I dry yours out by the fire.\u0027 \\n\\n \\n\\n Clinging to the woodwork, staggering with the roll of the ship, and aided by the cook, I managed to slip into a rough woolen undershirt. On the instant my flesh was creeping and crawling from the harsh contact. He noticed my involuntary twitching and grimacing, and smirked: \\n\\n \\n\\n \u0027I only \u0027ope yer don\u0027t ever \u0027ave to get used to such as that in this life, \u0027cos you\u0027ve got a bloomin\u0027 soft skin, that you \u0027ave, more like a lydy\u0027s than any I know of. I was bloomin\u0027 well sure you was a gentleman as soon as I set eyes on yer.\u0027 \\n\\n \\n\\n I had taken a dislike to him at the first, and as he helped to dress me this dislike increased. There was something repulsive about his touch. I shrank from his hand; my flesh revolted. And between this and the smells arising from various pots boiling and bubbling on the galley fire, I was in haste to get out into the fresh air. Further, there was the need of seeing the captain about what arrangements could be made for getting me ashore. \\n\\n \\n\\n A cheap cotton shirt, with frayed collar and a bosom discolored with what I took to be ancient bloodstains, was put on me amidst a running and apologetic fire of comment. A pair of workman\u0027s brogans incased my feet, and for trousers I was furnished with a pair of pale-blue, washed-out overalls, one leg of which was fully ten inches shorter than the other. The abbreviated leg looked as though the devil had there clutched for the Cockney\u0027s soul and missed the shadow for the substance. \\n\\n \\n\\n \u0027And whom have I to thank for this kindness?\u0027 I asked, when I stood completely arrayed, a tiny boy\u0027s cap on my head, and for coat a dirty, striped cotton jacket which ended at the small of my back, and the sleeves of which reached just below my elbows. \\n\\n \\n\\n The cook drew himself up in smugly humble fashion, a deprecating smirk on his face. Out of my experience with stewards on the Atlantic liners at the end of the voyage, I could have sworn he was waiting for his tip. From my fuller knowledge of the creature I now know that the posture was unconscious. An hereditary servility, no doubt, was responsible. \\n\\n \\n\\n \u0027Mugridge, sir,\u0027 he fawned, his effeminate features running into a greasy smile. \u0027Thomas Mugridge, sir, an\u0027 at yer service.\u0027 \\n\\n \\n\\n \u0027All right, Thomas,\u0027 I said. \u0027I shall not forget you- when my clothes are dry.\u0027 \\n\\n \\n\\n A soft light suffused his face, and his eyes glistened, as though somewhere in the deeps of his being his ancestors had quickened and stirred with dim memories of tips received in former lives. \\n\\n \\n\\n \u0027Thank you, sir,\u0027 he said very gratefully and very humbly indeed. \\n\\n \\n\\n Precisely in the way that the door slid back, he slid aside, and I stepped out on deck. I was still weak from my prolonged immersion. A puff of wind caught me, and I staggered across the moving deck to a corner of the cabin, to which I clung for support. The schooner, heeled over far out from the perpendicular, was bowing and plunging into the long Pacific roll. If she were heading southwest, as Johnson had said, the wind, then, I calculated, was blowing nearly from the south. The fog was gone, and in its place the sun sparkled crisply on the surface of the water. I turned to the east, where I knew California must lie, but could see nothing save low-lying fog-banks- the same fog, doubtless, that had brought about the disaster to the Martinez and placed me in my present situation. To the north, not far away, a group of naked rocks thrust above the sea, on one of which I could distinguish a lighthouse. In the southwest, and almost in our course, I saw the pyramidal loom of some vessel\u0027s sails. \\n\\n \\n\\n Having completed my survey of the horizon, I turned to my more immediate surroundings. My first thought was that a man who had come through a collision and rubbed shoulders with death merited more attention than I received. Beyond a sailor at the wheel, who stared curiously across the top of the cabin, I attracted no notice whatever. \\n\\n \\n\\n Everybody seemed interested in what was going on amidships. There, on a hatch, a large man was lying on his back. He was fully clothed, though his shirt was ripped open in front. Nothing was to be seen of his chest, however, for it was covered with a mass of black hair, in appearance like the furry coat of a dog. His face and neck were hidden beneath a black beard, intershot with gray, which would have been stiff and bushy had it not been limp and draggled and dripping with water. His eyes were closed, and he was apparently unconscious; but his mouth was wide open, his breast heaving as though from suffocation as he labored noisily for breath. A sailor, from time to time and quite methodically, as a matter of routine, dropped a canvas bucket into the ocean at the end of a rope, hauled it in hand under hand, and sluiced its contents over the prostrate man. \\n\\n \\n\\n Pacing back and forth the length of the hatchway, and savagely chewing the end of a cigar, was the man whose casual glance had rescued me from the sea. His height was probably five feet ten inches, or ten and a half; but my first impression or feel of the man was not of this, but of his strength. And yet, while he was of massive build, with broad shoulders and deep chest, I could not characterize his strength as massive. It was what might be termed a sinewy, knotty strength, of the kind we ascribe to lean and wiry men, but which, in him, because of his heavy build, partook more of the enlarged gorilla order. Not that in appearance he seemed in the least gorilla-like. What I am striving to express is this strength itself, more as a thing apart from his physical semblance. It was a strength we are wont to associate with things primitive, with wild animals and the creatures we imagine our tree-dwelling prototypes to have been- a strength savage, ferocious, alive in itself, the essence of life in that it is the potency of motion, the elemental stuff itself out of which the many forms of life have been molded. \\n\\n \\n\\n Such was the impression of strength I gathered from this man who paced up and down. He was firmly planted on his legs; his feet struck the deck squarely and with surety: every movement of a muscle, from the heave of the shoulders to the tightening of the lips about the cigar, was decisive and seemed to come out of a strength that was excessive and overwhelming. In fact, though this strength pervaded every action of his, it seemed but the advertisement of a greater strength that lurked within, that lay dormant and no more than stirred from time to time, but which might arouse at any moment, terrible and compelling, like the rage of a lion or the wrath of a storm. \\n\\n \\n\\n The cook stuck his head out of the galley door and grinned encouragingly at me, at the same time jerking his thumb in the direction of the man who paced up and down by the hatchway. Thus I was given to understand that he was the captain, the \u0027Old Man,\u0027 in the cook\u0027s vernacular, the person whom I must interview and put to the trouble of somehow getting me ashore. I had half started forward, to get over with what I was certain would be a stormy quarter of an hour, when a more violent suffocating paroxysm seized the unfortunate person who was lying on his back. He writhed about convulsively. The chin, with the damp black beard, pointed higher in the air as the back muscles stiffened and the chest swelled in an unconscious and instinctive effort to get more air. \\n\\n \\n\\n The captain, or Wolf Larsen, as men called him, ceased pacing, and gazed down at the dying man. So fierce had this final struggle become that the sailor paused in the act of flinging more water over him, and stared curiously, the canvas bucket partly tilted and dripping its contents to the deck. The dying man beat a tattoo on the hatch with his heels, straightened out his legs, stiffened in one great, tense effort, and rolled his head from side to side. Then the muscles relaxed, the head stopped rolling, and a sigh, as of profound relief, floated upward from his lips. The jaw dropped, the upper lip lifted, and two rows of tobacco-discolored teeth appeared. It seemed as though his features had frozen into a diabolical grin at the world he had left and outwitted. \\n\\n \\n\\n Then a most surprising thing occurred. The captain broke loose upon the dead man like a thunderclap. Oaths rolled from his lips in a continuous stream. And they were not namby-pamby oaths, or mere expressions of indecency. Each word was a blasphemy, and there were many words. They crisped and crackled like electric sparks. I had never heard anything like it in my life, nor could I have conceived it possible. With a turn for literary expression myself, and a penchant for forcible figures and phrases, I appreciated as no other listener, I dare say, the peculiar vividness and strength and absolute blasphemy of his metaphors. The cause of it all, as near as I could make out, was that the man, who was mate, had gone on a debauch before leaving San Francisco, and then had the poor taste to die at the beginning of the voyage and leave Wolf Larsen short-handed. \\n\\n \\n\\n It should be unnecessary to state, at least to my friends, that I was shocked. Oaths and vile language of any sort had always been unutterably repellent to me. I felt a wilting sensation, a sinking at the heart, and, I might just as well say, a giddiness. To me death had always been invested with solemnity and dignity. It had been peaceful in its occurrence, sacred in its ceremonial. But death in its more sordid and terrible aspects was a thing with which I had been unacquainted till now. As I say, while I appreciated the power of the terrific denunciation that swept out of Wolf Larsen\u0027s mouth, I was inexpressibly shocked. But the dead man continued to grin unconcernedly with a sardonic humor, a cynical mockery and defiance. He was master of the situation. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/94/4913.html","bookId":293,"book":{"id":293,"title":"The Sea-Wolf海狼","description":"简介： The Sea-Wolf is a 1904 psychological adventure novel by American novelist Jack London about a literary critic and other survivors of an ocean collision who come under the dominance of Wolf Larsen, the powerful and amoral sea captain who rescues ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1289609238bf31c.jpg","type":"Inspirational","link":"http://novel.tingroom.com/jingdian/94","creation":"Aug 1, 2019 12:18:30 AM","modification":"Aug 1, 2019 12:18:30 AM"}}
