{"id":20834,"no":37,"title":"Chapter 37","content":"AT ONCE WE MOVED ABOARD the Ghost, occupying our old staterooms and cooking in the galley. The imprisonment of Wolf Larsen had happened most opportunely, for what must have been the Indian summer of this high latitude was gone, and drizzling, stormy weather had set in. We were very comfortable; and the inadequate shears, with the foremast suspended from them, gave a businesslike air to the schooner and a promise of departure. \n \n And now that we had Wolf Larsen in irons, how little did we need it! Like his first attack, his second had been accompanied by serious disablement. Maud made the discovery in the afternoon, while trying to give him nourishment. He had shown signs of consciousness, and she had spoken to him, eliciting no response. He was lying on his left side at the time, and in evident pain. With a restless movement he rolled his head around, clearing his left ear from the pillow against which it had been pressed. At once he heard and answered her, and at once she came to me. \n \n Pressing the pillow against his left ear, I asked him if he heard me, but he gave no sign. Removing the pillow and repeating the question, I was answered promptly that he did. \n \n \u0027Do you know you are deaf in the right ear?\u0027 I asked. \n \n \u0027Yes,\u0027 he answered in a low, strong voice, \u0027and worse than that. My whole right side is affected. It seems asleep. I cannot move arm or leg.\u0027 \n \n \u0027Feigning again?\u0027 I demanded angrily. \n \n He shook his head, his stern mouth shaping a strange, twisted smile. It was indeed a twisted smile, for it was on the left side only, the facial muscles of the right side moving not at all. \n \n \u0027That was the last stroke of the Wolf,\u0027 he said. \u0027I am paralyzed; I shall never walk again. Oh, only on the right side,\u0027 he added, as though divining the suspicious glance I flung at his left leg, the knee of which had just then drawn up and elevated the blankets. \n \n \u0027It\u0027s unfortunate,\u0027 he continued. \u0027I\u0027d like to have done for you first, Hump. And I thought I had that much left in me.\u0027 \n \n \u0027But why?\u0027 I asked, partly in horror, partly out of curiosity. \n \n Again his mouth framed the twisted smile, as he said: \n \n \u0027Oh, just to be alive, to be living and doing, to be the biggest big of the ferment to the end- to eat you. But to die this way-\u0027 \n \n He shrugged his shoulders, or attempted to shrug them, rather, for the left shoulder alone moved. Like the smile, the shrug was twisted. \n \n \u0027But how can you account for it?\u0027 I asked. \u0027Where is the seat of trouble?\u0027 \n \n \u0027The brain,\u0027 he said at once. \u0027It was those cursed headaches brought it on.\u0027 \n \n \u0027Symptoms,\u0027 I said. \n \n He nodded his head. \u0027There is no accounting for it. I was never sick in my life. Something\u0027s gone wrong with my brain. A cancer or tumor or something of that nature- a thing that devours and destroys. It\u0027s attacking my nerve centers, eating them up, bit by bit, cell by cell- from the pain.\u0027 \n \n \u0027The motor centers, too,\u0027 I suggested. \n \n \u0027So it would seem. And the curse of it is that I must lie here, conscious, mentally unimpaired, knowing that the lines are going down, breaking bit by bit communication with the world. I cannot see; hearing and feeling are leaving me: at this rate I shall soon cease to speak. Yet all the time I shall be here, alive, active, and powerless.\u0027 \n \n \u0027When you say you are here, I\u0027d suggest the likelihood of the soul,\u0027 I said. \n \n \u0027Bosh!\u0027 was his retort. \u0027It simply means that in the attack on my brain the higher psychical centers are untouched. I can remember, think, and reason. When that goes, I go. I am not. The soul?\u0027 \n \n He broke out in mocking laughter, then turned his left ear to the pillow as a sign that he wished no further conversation. \n \n Maud and I went about our work oppressed by the fearful fate which had overtaken him- how fearful we were yet fully to realize. There was the awfulness of retribution about it. Our thoughts were deep and solemn, and we spoke to each other scarcely above whispers. \n \n \u0027You might remove the handcuffs,\u0027 he said that night, as we stood in consultation over him. \u0027It\u0027s dead safe. I\u0027m a paralytic now. The next thing to watch out for is bedsores.\u0027 \n \n He smiled his twisted smile, and Maud, her eyes wide with horror, was compelled to turn away her head. \n \n \u0027Do you know that your smile is crooked?\u0027 I asked him; for I knew that she must attend him, and I wished to save her as much as possible. \n \n \u0027Then I shall smile no more,\u0027 he said calmly. \u0027I thought something was wrong. My right cheek has been numb all day. Yes, and I\u0027ve had warnings of this for the last three days, by spells: my right side seemed going to sleep, sometimes arm or hand, sometimes leg or foot. \n \n \u0027So my smile is crooked?\u0027 he queried, a short while after. \u0027Well, consider henceforth that I smile internally with my soul, if you please- my soul. Consider that I am smiling now.\u0027 \n \n And for the space of several minutes he lay there, quiet, indulging his grotesque fancy. \n \n The man of him was not changed. It was the old, indomitable, terrible Wolf Larsen imprisoned somewhere within that flesh which had once been so invincible and splendid. Now it bound him with insentient fetters, walling his soul in darkness and silence, blocking it from the world which to him had been a riot of action. No more would he \u0027conjugate the verb to do in every mood and tense.\u0027 \u0027To be\u0027 was all that remained to him- to be, as he had defined death, without movement; to will, but not to execute; to think and reason, and in his spirit to be as alive as ever, but in the flesh to be dead, quite dead. \n \n And yet, though I even removed the handcuffs, we could not adjust ourselves to his condition. Our minds revolted. To us he was full of potentiality. We knew not to expect of him next, what fearful thing, rising above the flesh, he might break out and do. Our experience warranted this state of mind, and we went about with anxiety always upon us. \n \n I had solved the problem which had arisen through the shortness of the shears. By means of the watch-tackle (I had made a new one) I heaved the butt of the foremast across the rail and then lowered it to the deck. Next, by means of the shears, I hoisted the main-boom on board. Its forty feet of length would supply the height necessary properly to swing the mast. By means of a secondary tackle I had attached to the shears, I swung the boom to a nearly perpendicular position, then lowered the butt to the deck, where, to prevent slipping, I spiked great cleats around it. The single block of my original shears- tackle I had attached to the end of the boom. Thus by carrying this tackle to the windlass I could raise and lower the end of the boom at will, the butt always remaining stationary, and by means of guys I could swing the boom from side to side. To the end of the boom I had likewise rigged a hoisting-tackle, and when the whole arrangement was complete I could not but be startled by the power and latitude it gave me. \n \n Of course two days\u0027 work was required for the accomplishment of this part of my task, and it was not till the morning of the third day that I swung the foremast from the deck and proceeded to square its butt to fit the step. Here I was especially awkward. I sawed and chopped and chiseled the weathered wood till it had the appearance of having been gnawed by some gigantic mouse. But it fitted. \n \n \u0027It will work- I know it will work!\u0027 I cried. \n \n Wolf Larsen had received another stroke. He had lost his voice, or was losing it. He had only intermittent use of it. As he phrased it, the wires were like the stock market, now up, now down. Occasionally the wires were up and he spoke as well as ever, though slowly and heavily. Then speech would suddenly desert him, in the middle of a sentence perhaps, and for hours, sometimes we would wait for the connection to be reestablished. He complained of great pain in his head, and it was during this period that he arranged a system of communication against the time when speech should leave him altogether- one pressure of the hand for \u0027yes,\u0027 two for \u0027no.\u0027 It was well that it was arranged, for by evening his voice had gone from him. By hand pressures, after that, he answered our questions, and when he wished to speak he scrawled his thoughts with his left hand, quite legibly, on a sheet of paper. \n \n The fierce winter had now descended upon us. Gale followed gale, with snow and sleet and rain. The seals had started on their great southern migration, and the rookery was virtually deserted. I worked feverishly. In spite of the bad weather, and of the wind which especially hindered me, I was on deck from daylight till dark, and making substantial progress. \n \n I profited by my lesson learned through raising the shears, and then climbed them to attach the guys. To the top of the foremast, which was lifted conveniently from the deck, I attached the rigging, stays, and throat-and peak-halyards. As usual, I had underrated the amount of work involved in this portion of the task, and two long days were necessary to complete it. And there was so much yet to be done: the sails, for instance, had to be made over. \n \n While I toiled at rigging the foremast, Maud sewed on the canvas, ready always to drop everything and come to my assistance when more hands than two were required. The canvas was heavy and hard, and she sewed with the regular sailor\u0027s palm and the three-cornered sail-needle. Her hands were soon sadly blistered, but she struggled bravely on, and, in addition, did the cooking and took care of the sick man. \n \n \u0027A fig for superstition,\u0027 I said on Friday morning. \u0027That mast goes in today.\u0027 \n \n Everything was ready for the attempt. Carrying the boom-tackle to the windlass, I hoisted the mast nearly clear of the deck. Making this tackle fast, I took to the windlass the shears-tackle (which was connected with the end of the boom), and with a few turns had the mast perpendicular and clear. \n \n Maud clapped her hands the instant she was relieved from holding the turn, crying: \n \n \u0027It works! It works! We\u0027ll trust our lives to it!\u0027 \n \n Then she assumed a rueful expression. \n \n \u0027It\u0027s not over the hole,\u0027 she said. \u0027Will you have to begin all over?\u0027 \n \n I smiled in superior fashion, and, slacking off on one of the boom-guys and taking in on the other, swung the mast perfectly in the center of the deck. Still it was not over the hole. Again the rueful expression came on her face, and again I smiled in a superior way. Slacking away on the boom-tackle and hoisting an equivalent amount on the shears-tackle, I brought the butt of the mast into position directly over the hole in the deck. Then I gave Maud careful instructions for lowering away, and went into the hold to the step on the schooner\u0027s bottom. \n \n I called to her, and the mast moved easily and accurately. Straight toward the square hole of the step the square butt descended; but as it descended it slowly twisted, so that square would not fit into square. But I had not even a moment\u0027s indecision. Calling to Maud to cease lowering, I went on deck and made the watch-tackle fast to the mast with a rolling hitch. I left Maud to pull on it while I went below. By the light of the lantern I saw the butt twist slowly around till its sides coincided with the sides of the step. Maud made fast and returned to the windlass. Slowly the butt descended the several intervening inches, at the same time slightly twisting again. Once more Maud rectified the twist with the watch-tackle, and once more she lowered away from the windlass. Square fitted into square. The mast was stepped. \n \n I raised a shout, and she ran down to see. In the yellow lantern-light we peered at what we had accomplished. We looked at each other, and our hands felt their way and clasped. The eyes of both of us, I think, were moist with the joy of success. \n \n \u0027It was done so easily, after all,\u0027 I remarked. \u0027All the work was in the preparation.\u0027 \n \n \u0027And all the wonder in the completion,\u0027 Maud added. \u0027I can scarcely bring myself to realize that that great mast is really up and in- that you have lifted it from the water, swung it through the air, and deposited it here where it belongs. It is a Titan\u0027s task.\u0027 \n \n \u0027And they made themselves many inventions-\u0027 I began merrily, then paused to sniff the air. \n \n I looked hastily at the lantern. It was not smoking. Again I sniffed. \n \n \u0027Something is burning,\u0027 Maud said with sudden conviction. \n \n We sprang together for the ladder, but I raced past her to the deck. A dense volume of smoke was pouring out of the steerage companionway. \n \n \u0027The Wolf is not yet dead,\u0027 I muttered to myself as I sprang down through the smoke. \n \n It was so thick in the confined space that I was compelled to feel my way; and, so potent was the spell of Wolf Larsen on my imagination, I was quite prepared for the helpless giant to grip my neck in a stranglehold. I hesitated, the desire to race back and up the steps to the deck almost overpowering me. Then I recollected Maud. The vision of her, as I had last seen her, in the lantern-light of the schooner\u0027s hold, her brown eyes warm and moist with joy, flashed before me, and I knew that I could not go back. \n \n I was choking and suffocating by the time I reached Wolf Larsen\u0027s bunk. I reached in my hand and felt for him. He was lying motionless, but moved slightly at the touch of my hand. I felt over and under his blankets. There was no warmth, no sign of fire. Yet that smoke which blinded me and made me cough and gasp must have a source. I lost my head temporarily, and dashed frantically about the steerage. A collision with the table partly knocked the wind from my body and brought me to myself. I reasoned that a helpless man could start a fire only near to where he lay. \n \n I returned to Wolf Larsen\u0027s bunk. There I encountered Maud. How long she had been there in that suffocating atmosphere I could not guess. \n \n \u0027Go up on deck,\u0027 I commanded peremptorily. \n \n \u0027But, Humphrey-\u0027 she began to protest in a queer, husky voice. \n \n \u0027Please! please!\u0027 I shouted at her, harshly. \n \n She drew away obediently; and then I thought, What if she cannot find the steps? I started after her, to stop at the foot of the companionway. Perhaps she had gone up. As I stood there, hesitant, I heard her cry softly: \n \n \u0027Oh, Humphrey, I am lost!\u0027 \n \n I found her fumbling at the wall of the after-bulkhead, and, half leading, half carrying her, I took her up the companionway. The pure air was like nectar. Maud was only faint and dizzy, and I left her lying on the deck when I took my second plunge below. \n \n The source of the smoke must be very close to Wolf Larsen: my mind was made up to this, and I went straight to his bunk. As I felt among his blankets, something hot fell on the back of my hand. It burned me, and I jerked my hand away. Then I understood. Through the cracks in the bottom of the upper bunk he had set fire to the mattress. He still retained sufficient use of his left arm to do this. The damp straw of the mattress, fired from beneath and denied air, had been smoldering all the while. \n \n As I dragged the mattress out of the bunk it seemed to disintegrate in mid-air, at the same time bursting into flames. I beat out the burning remnants of straw in the bulk, then made a dash for the deck for fresh air. \n \n Several buckets of water sufficed to put out the burning mattress in the middle of the steerage floor; and ten minutes later, when the smoke had fairly cleared, I allowed Maud to come below. Wolf Larsen was unconscious, but it was a matter of minutes for the fresh air to restore him. We were working over him, however, when he signed for paper and pencil. \n \n \u0027Pray do not interrupt me,\u0027 he wrote. \u0027I am smiling.\u0027 \n \n \u0027I am still a bit of the ferment, you see,\u0027 he wrote a little later. \n \n \u0027I am glad you are as small a bit as you are,\u0027 I said. \n \n \u0027Thank you,\u0027 he wrote. \u0027But just think of how much smaller I shall be before I die.\u0027 \n \n \u0027And yet I am all here, Hump,\u0027 he wrote with a final flourish. \u0027I can think more clearly than ever in my life before. Nothing to disturb me. Concentration is perfect. I am all here and more than here.\u0027 \n \n It was like a message from the night of the grave, for this man\u0027s body had become his mausoleum. And there, in so strange a sepulcher, his spirit fluttered and lived. It would flutter and live till the last line of communication was broken, and after that who was to say how much longer it might continue to flutter and live? \n \n","sourceLink":"http://novel.tingroom.com/jingdian/94/4948.html","bookId":293,"book":{"id":293,"title":"The Sea-Wolf海狼","description":"简介： The Sea-Wolf is a 1904 psychological adventure novel by American novelist Jack London about a literary critic and other survivors of an ocean collision who come under the dominance of Wolf Larsen, the powerful and amoral sea captain who rescues ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1289609238bf31c.jpg","type":"Inspirational","link":"http://novel.tingroom.com/jingdian/94","creation":"Aug 1, 2019 12:18:30 AM","modification":"Aug 1, 2019 12:18:30 AM"}}
