{"id":38561,"no":5,"title":"II. BIRD-STUDY IN A SOUTHERN STATE.","content":"The most interesting experience in several years of bird-study was a trip to a Southern State for the purpose of making acquaintance with the mocking-bird. Adventures began before the lights of New York sank below the horizon; adventures more strange than agreeable, for the journey was by steamer. Hardly had we passed out of the bay when there began a gentle roll which speedily sent passengers to bed. When we passed Long Branch the motion was a steady rock from side to side, that made one feel like a baby in a cradle, and before bedtime it was a violent swing that flung one about like a toy, and tossed the furniture around like doll-house belongings. Holding on to the side of the berth with both hands, I passed the night listening to the labored strokes of the engine and the crashing of the loosened freight in the hold, and entertained by the eccentric conduct of the loose articles in my state-room, a trunk, chair, life-preserver,[Pg 22] plate, saucer, and teaspoon, which with one accord, and in spite of all I could do by most ingenious wedging, joined in a peculiar dance between the outer wall and the inner partition of my room. At one moment they rested quietly in their several ways, against the wall; the steamer lurched, and all started madly across the floor, the heavy things first, and the lighter bringing up the rear, each banging violently against the partition, with thump, rattle, or jingle according to its nature, then in a moment dashing back so furiously that I feared to see the thin planks yield and my trunk go out to sea by itself. Not that I cared for my trunk—my life was the subject that interested me at the time. Outside, too, the doors and blinds rattled, the tiller-chain chattered and wailed and sobbed like a woman in distress, and above all other sounds rose the dismal fog horn, for a pall of mist had settled over us. Day differed from night only in being light, for the sole prospect from the guards was one moment the fog above, where the sky should be, the next the depths of the sea yawning as if to receive the ship into its bosom. In this manner, during two days and three nights, we rolled on to our destination, and for days after my feet touched blessed Mother Earth I reeled and staggered like a drunken man.[Pg 23] After the storm, the calm. There followed upon this rough voyage weeks of quiet, delightful bird-study, whose long sunny-days were passed in the fragrant depths of pine groves, under arching forest of sweet-gum trees, or on the shore of the salt marsh; but wherever, or however, always following and spying out the ways of the feathered world. The bird of the South—the mocking-bird, was the first object of study. By day he was watched and noted, during the long twilight he was listened to, and at midnight sleep was often banished by his wonderful and enchanting voice. Gray and inconspicuous in coloring, we all know him in the cage; but how different in freedom! how wild and bewitching his song! how wise and knowing his ways! how well worth weeks of study is this one bird! Here were dozens of other birds also. What keen delight to one fresh from the town, to look over the marsh where \"Leagues and leagues of marsh grass, waist high, broad in the blade, Green and all of a height, and unflecked with a light or a shade, Stretch leisurely off in a pleasant plain To the terminal blue of the main;\" to watch the great snowy heron sweeping over with broad white wing, tripping gracefully[Pg 24] about on the edges of the channels, and toward night betaking itself to a line of trees in the distance, that looked as if full of snowy blossoms that moved and changed about and at last settled for the night; to see the bald eagle catch a big fish and call his mate to help him eat it; to watch the lesser tern hover with yellow bill pointed downward and sharp eye fixed on the water, and at length stiffen his wings and dive head first into it, bringing out his prey, and filling the air with cries in a complaining, squealing tone that always reminds one of a young pig; to gaze fascinated at the bewitching flight of the ring-plover, sweeping low over the water in a small flock, now almost invisible as the sombre-colored backs turn toward you, now suddenly flashing bright as silver when the breasts come into sight, moving in perfect unison as if impelled by one will. More, many more birds of the marsh attract and draw one, but inland is the mocking-bird, and after a walk along the shore, always my feet turned to the groves and the fields where the matchless bird lives his life. To see, as well as hear a wild mocking-bird sing, is worth a journey, even over the rolling deep. I passed hours in a pleasant grove beyond the gardens and fields, watching and listening to one bird whose concert hall it was.[Pg 25] The grove was the audience room where one might be in the shade and not too conspicuous in watching him. His chosen place was in the sunshine, for this bird is a sun-worshiper. I always found him singing when I reached the spot. Perhaps on the top spike of a young pine-tree, balanced on one, or sometimes on two adjoining top twigs—which of course stand straight up—stood the singer, madly shouting his most peculiar medley. He looked at me as I passed near his perch, but did not pause in his song. After I had taken my seat he flew—singing as he went—alighted nearer, on the upper sprig of a cedar, turned his eyes upon me, and treated me to another performance, while I looked and listened enchanted. Nor was I the only listener. Ever and anon while absorbed in the entertainment, or waiting, breathless, for a new note, I was startled by a rustle, and a low \"Good evenin\u0027 Missis,\" and glanced up to see a negro stealing along in a stealthy way. It might be a woman with a big bundle or basket on her head, possibly a slouching young man or \"boy\" with an air of interest in my eccentric proceedings, or a group of youngsters with nothing particular to do, but one and all perfectly silent in movement. No wonder they know all about the birds, and lay violent hands on eggs, nests, or nestlings as[Pg 26] they choose, creeping around as they do without a sound. It is only surprising that a bird is left in the State, so persistently do they rob the nests. Naturally the mocking-bird, for which they can always find purchasers, is the most desirable, and white as well as black persecute that bird unceasingly. \"You can\u0027t keep them from the negroes,\" said a young white man. \"I\u0027ve often been watching a nest to get the young ones myself, but some nig was sure to take it before me.\" Speaking of negroes, I never saw so many idle men and grown boys. Not a spot could be found so secluded that one or more did not soon make his appearance. Selecting the quiet yard of a summer cottage, a deserted-looking place not yet opened for the season, in which to study the ways of the birds in peace, I was often disturbed by a negro passing across the lawn, taking no heed of fences, for there\u0027s no sort of a fence in that country that they will not pass over as if it were not there. Of course this always put to flight the dramatis person? of my study. One day an interesting (or interested) person of color appeared on the scene equipped for white-washing, and proceeded to adorn tree trunks, fences, buildings, etc., etc., relieving his labors by questioning me about northern manners and customs. On another[Pg 27] occasion when I was looking anxiously to see a certain family of nestlings make exit from the nest, a building that I supposed to be a shut-up store-room was thrown open, a wash-tub appeared before the door, and I found that a family of eight, including four children, had moved in, not thirty feet from my chosen seat, and of course to the utter destruction of any seclusion. I could not select a single spot in the neighborhood, favorable to quiet study, without having it made desolate or turned into a thoroughfare. The loveliest place I found at all was a footpath passing for about fifty feet through a fringe of low cedar, sweet gum trees, and shrubs loaded with pink lily-of-the-valley shaped blossoms. Across the path ran a brooklet, a mere thread of water, so shallow that small birds stood in the middle to bathe, though it deepened into a pool below, where frogs croaked and plunged. It was cool; it was quiet, far from the everywhere present negro hut; there was no sound but the trickle of the streamlet as it fell into the pool, and the softened roar of the ocean beyond the wide salt marsh. To this nook I went every day, always trying to surprise the birds at their usual occupations, but never quite succeeding; for steal in quietly as I might I always heard low remarks, a slight flutter of wings, and usually saw a dark form[Pg 28] or two departing near the ground behind some shrub. Slowly and quietly, however, I took my seat on a bank close under a thick bush,—while the silence around me was as profound as if no wing had ever fluttered there,—and became as motionless as circumstances would allow, for beside the birds there were other tenants not half so shy. After a few moments, when the ripple I caused had died away, sounds of life began again; unknown water creatures made queer noises in the pool below, low bird tones, unfamiliar scraps of song fell on the ear, ordinary ways were resumed. In this pleasant place I made acquaintance with the painted-finch, or nonpareil, who was least frightened of the small birds, and stood patiently on a cedar twig till I became quiet, then came down in plain sight, waded up to the tops of his firm little legs in the water, and deliberately took his bath before my very face. Here also I had a call from Bob White, who cautiously lifted a striped cap and a very bright eye above the grass tops to look at me. He did not introduce himself; indeed, after a moment\u0027s steady gaze his head dropped and I saw him no more, but I heard him rustle in the grass on the way to the strawberries, of which he demands—and gets—his share.[Pg 29] Ruin fell upon this charming retreat in this wise. One day on my approach I saw commotion in the shrubs and two negroes at work chopping great branches out on each side of the path, letting in the sun to my bank, and turning it into a hideous wreck. I protested. \"Why is this? What are you doing?\" \"Oh, we\u0027re just cuttin\u0027 some pea-poles!\" they replied calmly. They had been too lazy or too indifferent to step ten feet on one side into the thicker copse, and leave the pretty path in its beauty, and the mischief was done, and after all it was not my business. I passed on. Bird-study has other annoyances in that part of the world beside the human beings of whom I have spoken. Next, perhaps, are the sufferings which wring the heart all the while. John Burroughs has written the tragedies of the nests; he could add a chapter more tragical than all, should he visit the haunts of the mocking-bird. Nothing can be more dreadful than the systematic and persistent war made upon this bird, of which nevertheless every Southerner is proud. Lastly, the hindrances which Dame Nature herself throws around her mysteries. There are the prickly pears, sowed broadcast over the land so thickly that one can hardly avoid stepping on them, with thorns sharp as needles, and[Pg 30] as long. One of an inch in length that I had the curiosity to examine had forty-five thorns, equal to two papers of number six sharps, that stuck out in every direction, and would pass through an ordinary shoe with perfect ease. This interesting vegetable has no local attachments whatever, and readily clings to any part of one\u0027s garment. Then there are the mosquitoes with which the same careful mother peoples the groves, even in April, industrious little creatures not in the least enervated by the climate. But her grand dependence, judiciously settled indeed, is on the sand flies. Wherever there is not a howling gale—there are the flies in millions, most indefatigable and maddening of pests. And finally, to take home with you, to remind you pleasantly of her hospitalities when you have reached your own room, is the tick! Ties from the outer world began at last to draw. The birdlings in the nest were not ready to come out, and growing impatient I drew upon the knowledge—or rather the ignorance—of the residents and heard some surprising statements, which further observation, however, did not confirm. That the mocking-bird baby lives for three weeks in the nest; that part of that time the parents carry the nestlings about on their backs; that when old enough the young[Pg 31] are pushed out of their nest, and always fall to the ground. And the authors of these fables were grown-up, and had passed their lives among the mocking-birds. I curbed my impatience, stayed another week, and saw all the nestlings out, and the nest deserted. Another charge also fell to the ground on careful observation. The farmers complain—as farmers are apt to complain of their best friends, the birds—that the mocking-bird eats strawberries. I set myself to watch a fine patch full of ripe and tempting berries, several times when no one was near. Many birds came about, mocking-birds, crows, kingbirds, orchard orioles, and others. The mocking-birds ran down between the rows of vines catching grasshoppers, the crows did the same service, walking with dignity. The kingbirds chased flies, the orioles searched the fruit trees for insects. One and all were working in the interest of the strawberry grower. And while I watched, an hour or more at a time, not even for dessert after filling their stomachs with insects, did one take a berry, which I am sure they might be considered to have earned. I know one lady—would there were more like her—who owns a garden on Long Island, and when her gardener comes in and says something[Pg 32] must be done to prevent the birds destroying fruit, calmly says: \"Certainly, set out another row of plants. Let us have enough for the birds by all means, and for ourselves too.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3338/91306.html","bookId":353,"book":{"id":353,"title":"In Nesting Time","description":"简介： Ears have they, but they hear not, may be said of all the world. Tragedies and comedies go on continually before us which we neither see nor hear; cries of distress and prattle of infants, songs of love and screams of war, alike fall upon deaf ears,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3338","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
