{"id":96148,"no":11,"title":"Page 11","content":"“Keller,” she said, “it was just an idle remark, and I didn’t mean anything by it. Anyway, I’m no psychologist. I’m not even sure what the word means.”\n “Someone who lacks a sense of right and wrong,” he said. “He understands the difference but doesn’t see how it applies to him personally. He lacks empathy, doesn’t have any feeling for other people.”\n She considered the matter. “It doesn’t sound like you,” she said, “except when you’re working. Is it possible to be a part-time sociopath?”\n “I don’t think so. I’ve done some reading on the subject. Case histories, that sort of thing. The sociopaths they write about, almost all of them have the same three things in their childhood background. Setting fires, torturing animals, and wetting the bed.”\n “You know, I heard that somewhere. Some TV program about FBI profilers and serial killers. Do you remember your childhood, Keller?”\n “Most of it,” he said. “I knew a woman once who claimed she could remember being born. I don’t go back that far, and some of it’s spotty, but I remember it pretty well. And I didn’t do any of those three things. Torture animals? God, I loved animals. I told you about the dog I had.”\n “Nelson. No, sorry, that was the one you had a couple of years ago. You told me the name of the other one, but I can’t remember it.”\n “Soldier.”\n “Soldier, right.”\n “I loved that dog,” he said. “And I had other pets from time to time, the way kids do. Goldfish, baby turtles. They all died.”\n “They always do, don’t they?”\n “I suppose so. I used to cry.”\n “When they died.”\n “When I was little. When I got older I took it more in stride, but it still made me sad. But torture them?”\n “How about fires?”\n “You know,” he said, “when you talked about the leaves, and what happens if you don’t rake them, I remembered raking leaves when I was a kid. It was one of the things I did to make money.”\n “You want to make twenty bucks here and now, there’s a rake in the garage.”\n “What we used to do,” he remembered, “was rake them into a pile at the curb, and then burn them. It’s illegal nowadays, because of fire laws and air pollution, but back then it’s what you were supposed to do.”\n “It was nice, the smell of burning leaves on the autumn air.”\n “And it was satisfying,” he said. “You raked them up and put a match to them and they were gone. Those were the only fires I remember setting.”\n “I’d say you’re oh-for-two. How’d you do at wetting the bed?”\n “I never did, as far as I can recall.”\n “Oh-for-three. Keller, you’re about as much of a sociopath as Albert Schweitzer. But if that’s the case, how come you do what you do? Never mind, here’s your train. Have fun dishing out the lasagna tonight. And don’t torture any animals, you hear?”\n 12\n Two weeks later he picked up the phone on his own and told her not to turn down jobs automatically. “Now you tell me,” she said. “You at home? Don’t go anywhere, I’ll make a call and get back to you.” He sat by the phone, and picked it up when it rang. “I was afraid they’d found somebody by now,” she said, “but we’re in luck, if you want to call it that. They’re sending us something by Airborne Express, which always sounds to me like paratroopers ready for battle. They swear I’ll have it by nine tomorrow morning, but you’ll just be getting home around then, won’t you? Do you figure you can make the 2:04 from Grand Central? I’ll pick you up at the station.”\n “There’s a 10:08,” he said. “Gets to White Plains a few minutes before eleven. If you’re not there, I’ll figure you had to wait for the paratroopers, and I’ll get a cab.”\n It was a cold, dreary day, with enough rain so that she needed to use the windshield wipers but not enough to keep the blades from squeaking. She put him at the kitchen table, poured him a cup of coffee, and let him read the notes she’d made and study the Polaroids that had come in the Airborne Express envelope, along with the initial payment in cash. He held up one of the pictures, which showed a man in his seventies, with a round face and a small white mustache, holding up a golf club as if in the hope that someone would take it from him.\n He said the fellow didn’t look much like a labor leader, and Dot shook her head. “That was Portland,” she said. “This is Phoenix. Well, Scottsdale, and I bet it’s nicer there today than it is here. Nicer than Portland, too, because I understand it always rains there. In Portland, I mean. It never rains in Scottsdale. I don’t know what’s the matter with me, I’m starting to sound like the Weather Channel. You could fly, you know. Not all the way, but to Denver, say.”\n “Maybe.”\n She tapped the photo with her fingernail. “Now according to them,” she said, “the man’s not expecting anything, and not taking any security precautions. Other hand, his life is a security precaution. He lives in a gated community.”\n “Sundowner Estates, it says here.”\n “There’s an eighteen-hole golf course, with individual homes ranged around it. And each of them has a state-of-the-art home security system, but the only thing that ever triggers an alarm is when some clown hooks his tee shot through your living room picture window, because the only way into the compound is past a guard. No metal detector, and they don’t confiscate your nail clippers, but you have to belong there for him to let you in.”\n “Does Mr. Egmont ever leave the property?”\n “He plays golf every day. Unless it rains, and we’ve already established that it never does. He generally eats lunch at the clubhouse, they’ve got their own restaurant. He has a housekeeper who comes in a couple of times a week-they know her at the guard shack, I guess. Aside from that, he’s all alone in his house. He probably gets invited out to dinner a lot. He’s unattached, and there’s always six women for every man in those Geezer Leisure communities. You’re staring at his picture, and I bet I know why. He looks familiar, doesn’t he?”\n “Yes, and I can’t think why.”\n “You ever play Monopoly?”\n “By God, that’s it,” he said. “He looks like the drawing of the banker in Monopoly.”\n “It’s the mustache,” she said, “and the round face. Don’t forget to pass Go, Keller. And collect two hundred dollars.”\n She drove him back to the train station, and because of the rain they waited in her car instead of on the platform. He said he’d pretty much stopped working on the food ship. She said she hadn’t figured it was something he’d be doing for the rest of his life.\n “They changed it,” he said. “The Red Cross took it over. They do this all the time, their specialty’s disaster relief, and they’re pros at it, but it transformed the whole thing from a spontaneous New York affair into something impersonal. I mean, when we started we had name chefs knocking themselves out to feed these guys something they’d enjoy eating, and then the Red Cross took over, and we were filling their plates with macaroni and cheese and chipped beef on toast. Overnight we went from Bobby Flay to Chef Boyardee.”\n “Took the joy out of it, did it?”\n “Well, would you like to spend ten hours shifting scrap metal and collecting body parts and then tuck into something you’d expect to find in an army chow line? I got so I couldn’t look them in the eye when I ladled the slop onto their plates. I skipped a night and felt guilty about it, and I went in the next night and felt worse, and I haven’t been back since.”\n “You were probably ready to give it up, Keller.”\n “I don’t know. I still felt good doing it, until the Red Cross showed up.”\n “But that’s why you were there,” she said. “To feel good.”\n “To help out.”\n She shook her head. “You felt good because you were helping out,” she said, “but you kept going back and doing it because it made you feel good.”\n “Well, I suppose so.”\n “I’m not impugning your motive, Keller. You’re still a hero, as far as I’m concerned. All I’m saying is that volunteerism only goes so far. When it stops feeling good, it tends to run out of steam. That’s when you need the professionals. They do their job because it’s their job, and it doesn’t matter whether they feel good about it or not. They buckle down and get it done. It may be macaroni and cheese, and the cheese may be Velveeta, but nobody winds up holding an empty plate. You see what I mean?”\n “I guess so,” Keller said.\n Back in the city, he called one of the airlines, thinking he’d take Dot’s suggestion and fly to Denver. He worked his way through their automated answering system, pressing numbers when prompted, and wound up on hold, because all of their agents were busy serving other customers. The music they played to pass the time was bad enough all by itself, but they kept interrupting it every fifteen seconds to tell him how much better off he’d be using their website. After a few minutes of this he called Hertz, and the phone was answered right away by a human being.\n He picked up a Ford Taurus first thing the next morning and beat the rush hour traffic through the tunnel and onto the New Jersey Turnpike. He’d rented the car under his own name, showing his own driver’s license and using his own American Express card, but he had a cloned card in another name that Dot had provided, and he used it in the motels where he stopped along the way.\n It took him four long days to drive to Tucson. He would drive until he was hungry, or the car needed gas, or he needed a restroom, then get behind the wheel again and drive some more. When he got tired he’d find a motel and register under the name on his fake credit card, take a shower, watch a little TV, and go to bed. He’d sleep until he woke up, and then he’d take another shower and get dressed and look for someplace to have breakfast. And so on.\n While he drove he played the radio until he couldn’t stand it, then turned it off until he couldn’t stand the silence. By the third day the solitude was getting to him, and he couldn’t figure out why. He was used to being alone, he lived his whole life alone, and he certainly never had or wanted company while he was working. He seemed to want it now, though, and at one point turned the car’s radio to a talk show on a clear-channel station in Omaha. People called in and disagreed with the host, or a previous caller, or some schoolteacher who’d given them a hard time in the fifth grade. Gun control was the announced topic for the day, but the real theme, as far as Keller could tell, was resentment, and there was plenty of it to go around.\n Keller listened, fascinated at first, and before very long he reached the point where he couldn’t stand another minute of it. If he’d had a gun handy, he might have put a bullet in the radio, but all he did was switch it off. \n","sourceLink":"https://allnovel.net/hit-parade-keller-3/page-11.html","bookId":2314,"book":{"id":2314,"title":"Hit Parade (Keller #3)","description":"Storyline: \n Hit Parade (Keller #3) \n Keller is friendly. Industrious. A bit lonely, sometimes. If it wasn\u0027t for the fact that he kills people for a living, he\u0027d be just your average Joe. The inconvenient wife, the troublesome sports star, the greedy business partner, the vicious dog, he\u0027ll take care of them all, quietly and efficiently. If the price is right. \n Like the rest of us, Keller\u0027s starting to worry about his retirement. After all, he\u0027s not getting any younger. (His victims, on the other hand, aren\u0027t getting any older.) So he contacts his \"booking agent,\" Dot, up in White Plains, and tells her to keep the hits coming. He\u0027ll take any job, anywhere. His nest egg needs fattening up. \n Of course, being less choosy means taking greater risks—and that could buy Keller some big trouble. Then again, in this game, there are plenty of opportunities for some inventive improvisation . . . and a determined self-motivator can make a killing.\n \n","cover":"https://allnovel.net/images/hit-parade-keller-3.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-parade-keller-3.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:18:39 PM"}}
