{"id":96149,"no":12,"title":"Page 12","content":"The last thing he wanted, it turned out, was someone talking to him. He had the thought, and realized a moment later that he’d not only thought it but had actually spoken the words aloud. He was talking to himself, and wondered-wondered in silence, thank God-if this was something new. It was like snoring, he thought. If you slept alone, how would you know if you did it? You wouldn’t, not unless you snored so loudly that you woke yourself up. He started to reach for the radio, stopped himself before he could turn it on again. He checked the speedometer, saw that the cruise control was keeping the car at three miles an hour over the posted speed limit. Without cruise control you found yourself going faster or slower than you wanted to, wasting time or risking a ticket. With it, you didn’t have to think about how fast you were going. The car did the thinking for you. The next step, he thought, would be steering control. You got in the car, keyed the ignition, set the controls, and leaned back and closed your eyes. The car followed the turns in the road, and a system of sensors worked the brake when another car loomed in front of you, swung out to pass when such action was warranted, and knew to take the next exit when the gas gauge dropped below a certain level. It sounded like science fiction, but no less so in Keller’s boyhood than cruise control, or auto-response telephone answering systems, or a good 95 percent of the things he nowadays took for granted. Keller didn’t doubt for a minute that right this instant some bright young man in Detroit or Osaka or Bremen was working on steering control. There’d be some spectacular head-on collisions before they got the bugs out of the system, but before long every car would have it, and the accident rate would plummet and the state troopers wouldn’t have anybody to give tickets to, and everybody would be crazy about technology’s newest breakthrough, except for a handful of cranks in England who were convinced you had more control and got better mileage the old-fashioned way. Meanwhile, Keller kept both hands on the steering wheel. 13 Sundowner Estates, home of William Wallis Egmont, was in Scottsdale, an upscale suburb of Phoenix. Tucson, a couple hundred miles to the east, was as close as Keller wanted to bring the Taurus. He followed the signs to the airport and left the car in long-term parking. Over the years he’d left other cars in long-term parking, but they’d been other men’s cars, with their owners stuffed in the trunk, and Keller, having no need to find the cars again, had gotten rid of the claim checks at the first opportunity. This time was different, and he found a place in his wallet for the check the gate attendant had supplied, and noted the lot section and the number of the parking space. He went into the terminal, found the car rental counters, and picked up a Toyota Camry from Avis, using his fake credit card and a matching Pennsylvania driver’s license. It took him a few minutes to figure out the cruise control. That was the trouble with renting cars, you had to learn a new system with every car, from lights and windshield wipers to cruise control and seat adjustment. Maybe he should have gone to the Hertz counter and picked up another Taurus. Was there an advantage in driving the same model car throughout? Was there a disadvantage that offset it, and was some intuitive recognition of that disadvantage what had led him to the Avis counter? “You’re thinking too much,” he said and realized he’d spoken the words aloud. He shook his head, not so much annoyed as amused, and a few miles down the road realized that what he wanted, what he’d been wanting all along, was not someone to talk to him but someone to listen. A little ways past an exit ramp, a kid with a duffel bag had his thumb out, trying to hitch a ride. For the first time that he could recall, Keller had the impulse to stop for him. It was just a passing thought; if he’d had his foot on the gas, he’d have barely begun to ease up on the gas pedal before he’d overruled the thought and sped onward. Since he was running on cruise control, his foot didn’t even move, and the hitchhiker slipped out of sight in the rearview mirror, unaware what a narrow escape he’d just had. Because the only reason to pick him up was for someone to talk to, and Keller would have told him everything. And, once he’d done that, what choice would he have? Keller could picture the kid, listening wide-eyed to everything Keller had to tell him. He pictured himself, his soul unburdened, grateful to the youth for listening, but compelled by circumstance to cover his tracks. He imagined the car gliding to a stop, imagined the brief struggle, imagined the body left in a roadside ditch, the Camry heading west at a thoughtful three miles an hour above the speed limit. The motel Keller picked was an independent mom-and-pop operation in Tempe, which was another suburb of Phoenix. He counted out cash and paid a week in advance, plus a twenty-dollar deposit for phone calls. He didn’t plan to make any calls, but if he needed to use the phone he wanted it to work. He registered as David Miller of San Francisco and fabricated an address and zip code. You were supposed to include your license plate number, and he mixed up a couple of digits and put CA for the state instead of AZ. It was hardly worth the trouble, nobody was going to look at the registration card, but there were certain things he did out of habit, and this was one of them. He always traveled light, never took along more than a small carry-on bag with a shirt or two and a couple changes of socks and underwear. That made sense when you were flying, and less sense when you had a car with an empty trunk and backseat at your disposal. By the time he got to Phoenix, he’d run through his socks and underwear. He picked up two three-packs of briefs and a six-pack of socks at a strip mall, and was looking for a trash bin for his dirty clothes when he spotted a Goodwill Industries collection box. He felt good dropping his soiled socks and underwear in the box, though not quite as good as he’d felt dishing out designer food to the smoke-stained rescue workers at Ground Zero. Back at his motel, he called Dot on the prepaid cell phone he’d picked up on Twenty-third Street. He’d paid cash for it, and hadn’t even been asked his name, so as far as he could tell it was completely untraceable. At best someone could identify calls made from it as originating with a phone manufactured in Finland and sold at Radio Shack. Even if they managed to pin down the specific Radio Shack outlet, so what? There was nothing to tie it to Keller, or to Phoenix. On the other hand, cell phone communications were about as secure as shouting. Any number of listening devices could pick up your conversation, and whatever you said was very likely being heard by half a dozen people on their car radios and one old fart who was catching every word on the fillings in his teeth. That didn’t bother Keller, who figured every phone was tapped, and acted accordingly. He phoned Dot, and the phone rang seven or eight times, and he broke the connection. She was probably out, he decided, or in the shower. Or had he misdialed? Always a chance, he thought, and pressed Redial, then caught himself and realized that, if he had in fact misdialed, redialing would just repeat the mistake. He broke the connection again in midring and punched in the number afresh, and this time he got a busy signal. He redialed, got another busy signal, frowned, waited, and tried again. It had barely begun to ring when she picked up, barking “Yes?” into the phone, and somehow fitting a full measure of irritation into the single syllable. “It’s me,” he said. “What a surprise.” “Is something wrong?” “I had somebody at the door,” she said, “and the teakettle was whistling, and I finally got to the phone and picked it up in time to listen to the dial tone.” “I let it ring a long time.” “That’s nice. So I put it down and turned away, and it rang again, and I picked it up in the middle of the first ring, and I was just in time to hear you hang up.” He explained about pressing Redial, and realizing that wouldn’t work. “Except it worked just fine,” she said, “since you hadn’t misdialed in the first place. I figured it had to be you, so I pressed star sixty-nine. But whatever phone you’re on, star sixty-nine doesn’t work. I got one of those weird tones and a canned message saying return calls to your number were blocked.” “It’s a cell phone.” “Say no more. Hello? Where’d you go?” “I’m here. You said Say no more, and…” “It’s an expression. Tell me it’s all wrapped up and you’re heading for home.” “I just got here.” “That’s what I was afraid of. How’s the weather?” “Hot.” “Not here. They say it might snow, but then again it might not. You’re just calling to check in, right?” “Right.” “Well, it’s good to hear your voice, and I’d love to chat, but you’re on a cell phone.” “Right.” “Call anytime,” she said. “It’s always a treat to hear from you.” Keller didn’t know the population or acreage of Sundowner Estates, although he had a hunch neither figure would be hard to come by. But what good would the information do him? The compound was large enough to contain a full-size eighteen-hole golf course, and enough homes adjacent to it to support the operation. And there was a ten-foot adobe wall encircling the entire affair. Keller supposed it was easier to sell homes if you called it Sundowner Estates, but Fort Apache would have better conveyed the stockadelike feel of the place. He drove around the compound a couple of times, establishing that there were in fact two gates, one at the east and the other not quite opposite, at the southwest corner. He parked where he could keep an eye on the southwest gate, and couldn’t tell much beyond the fact that every vehicle entering or leaving the compound had to stop for some sort of exchange with the uniformed guard. Maybe you flashed a pass at him, maybe he called to make sure you were expected, maybe they wanted a thumbprint and a semen sample. No way to tell, not from where Keller was watching, but he was pretty sure he couldn’t just drive up and bluff his way through. People who willingly lived behind a thick wall almost twice their own height probably expected a high level of security, and a guard who failed to provide that would be looking for a new job. He drove back to his motel, sat in front of the TV, and watched a special on the Discovery Channel about scuba diving at Australia ’s Great Barrier Reef. Keller didn’t think it looked like something he wanted to do. He’d tried snorkeling once, on a vacation in Aruba, and kept having to stop because he was getting water in his snorkel, and under his mask. And he hadn’t been able to see much of anything, anyhow. The divers on the Discovery Channel were having much better luck, and there were plenty of colorful fish for them (and Keller) to look at. After fifteen minutes, though, he’d seen as much as he wanted to and was ready to change the channel. It seemed like a lot of trouble to go through, flying all the way to Australia, then getting in the water with a mask and fins. Couldn’t you get pretty much the same effect staring into a fish tank at a pet shop or a Chinese restaurant?","sourceLink":"https://allnovel.net/hit-parade-keller-3/page-12.html","bookId":2314,"book":{"id":2314,"title":"Hit Parade (Keller #3)","description":"Storyline: Hit Parade (Keller #3) Keller is friendly. Industrious. A bit lonely, sometimes. If it wasn\u0027t for the fact that he kills people for a living, he\u0027d be just your average Joe. The inconvenient wife, the troublesome sports star, the greedy business partner, the vicious dog, he\u0027ll take care of them all, quietly and efficiently. If the price is right. Like the rest of us, Keller\u0027s starting to worry about his retirement. After all, he\u0027s not getting any younger. (His victims, on the other hand, aren\u0027t getting any older.) So he contacts his \"booking agent,\" Dot, up in White Plains, and tells her to keep the hits coming. He\u0027ll take any job, anywhere. His nest egg needs fattening up. Of course, being less choosy means taking greater risks—and that could buy Keller some big trouble. Then again, in this game, there are plenty of opportunities for some inventive improvisation . . . and a determined self-motivator can make a killing.","cover":"https://allnovel.net/images/hit-parade-keller-3.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-parade-keller-3.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:18:39 PM"}}
