{"id":88432,"no":12,"title":"Page 12","content":"\\n\\n “Hello?” she murmured again.\\n\\n “Hi, yourself, lady.”\\n\\n She spun around. A filthy, toothless, long-haired bum was grinning as he stood behind her. “I mean, hello, honey,” he added.\\n\\n She looked him up and down, trying not to wrinkle her nose in distaste or scream in shock.\\n\\n “Uh, hi,” she said. “Bye.”\\n\\n With a wave, she fled back through the gate, taking a minute to latch it behind herself, and up the steps. Inside the house, she locked the door and keyed in the alarm, making a mental note to herself to start being really careful or people really would start thinking she was crazy.\\n\\n At nine o’clock on the nose, Joe Connolly was in the office of social services, speaking with the man who had been Genevieve’s boss, a harried, irritable curmudgeon named Manny Yarborough who didn’t seem inclined to be helpful.\\n\\n “I’ve already had an officer in here, and I can’t tell you anything else. The girl quit. Cleared out her desk and quit. That’s it.”\\n\\n “No, that’s not it. Did she say where she was going? Did she leave an address for her last check? Did she say that she’d be in to get it? May I see her desk, her work area, please?”\\n\\n “You know what, mister? I’m a really busy man. We’re always shorthanded around here, and Genevieve left us shorter. She didn’t say anything. When I asked her not to leave that way, told her she had to work with the system and give notice, that she couldn’t just quit, she just said, ‘Watch me.’ Then she grabbed her stuff and she walked. And you’re crazy if you think I didn’t put that desk right back to work the second she was out of this place. We need space, and we need help. This is New York!”\\n\\n “I’ll need whatever address you have on file, and I’d like to look at the desk anyway,” Joe said firmly.\\n\\n “You got a search warrant?”\\n\\n “Why—do you think this is going to turn into a homicide investigation? I told you. I’m not a cop, I’m working for the family, a family that helps support the city charities, and I’m sure you know that. How about you give me a hand, please?”\\n\\n The man looked at him in exasperation. “I’ll get you what I had for a phone and an address, and you can ask Alice over there if she minds if you look at her desk.”\\n\\n Alice was young and looked uneasy. She seemed exceptionally kind, though, the type of person who was meant for her line of work. She was still idealistic. Her eyes were big and blue, and she must have heard the conversation, because she jumped out of her chair when Joe approached, eager to be of assistance. “I can go get some coffee or something if you want. I mean, I can get out of your way.” She was thin, and a little like a nervous terrier.\\n\\n “I’d really appreciate it if you could stay and tell me what I’m looking at,” he told her, offering what he hoped was a reassuring smile.\\n\\n “Sure.”\\n\\n Manny walked away, as if disgusted with the whole thing.\\n\\n Joe sat at the desk.\\n\\n “The bottom drawer is files,” Alice offered. “I’ll go through them with you.”\\n\\n He quickly discovered that Genevieve’s work with the prostitutes seemed to have consumed her caseload, though, interestingly, she hadn’t labeled them as prostitutes. She had listed the women as “Working temporary jobs” or “Seeking better opportunities.” She had notes on all the children—babies, mostly—court documents listing when they had been taken by Children’s Services and where they’d been placed, and little notes everywhere. He found the file for Didi Dancer. Her baby girl had been taken six months ago. Maybe Dancer was her real name after all, because the child was listed as Dianna Dancer. There was one note in Didi’s file that wasn’t clipped to the others. It read, She has a chance. Go for the big guns.\\n\\n A second later, he heard a cough. He and Alice both looked up. Manny was back, scowling fiercely. “Mr. Connolly, here is the information I promised you. Now, I believe I’ve offered you every courtesy. We are an under-paid service here, and time is valuable.”\\n\\n “I haven’t minded helping Mr. Connolly at all,” Alice assured him, her eyes still innocently wide.\\n\\n “Yes, but you are due in court on the Blalock case in thirty minutes.”\\n\\n “In thirty minutes?” Alice said with dismay. She jumped up again. Joe decided she was more like a nervous hamster than a terrier. He stood, as well. As he rose, he palmed the scrap of paper with Genevieve’s note. Later, he could always say he hadn’t taken it on purpose.\\n\\n He managed to whisper to Alice, “Can you copy the files for me?” he asked.\\n\\n She looked delighted to be involved in a secret conspiracy against her boss. She nodded, eyes shining, a smile playing at her lips.\\n\\n “Alice, time is passing here,” Manny said.\\n\\n “Thank you both,” Joe said politely, adding, “I may be back.”\\n\\n Manny scowled.\\n\\n Joe decided to retreat and fight another day. He extended a hand to Manny. “Thanks. I’m praying I’ll find Miss O’Brien alive, and if I do, it will be in large part thanks to your help.” What a load of bullshit. Still, he’d learned over the years. He was never obsequious—that would be too much; he would have to vomit on the spot. But being cordial to guys like this one usually made them feel awkward and sometimes even more willing to help in the future.\\n\\n He extended a hand to Alice, as well, thanking her sincerely. She flushed and stuttered. “Y-you’re very welcome. I loved Genevieve. We all did. Do, I mean.”\\n\\n “Yes, and now we all need to get back to work,” Manny said.\\n\\n Joe gave Alice a wink, and she smiled broadly. He left.\\n\\n He had his cell phone out and was calling Robert Adair before he even left the building. Luck was with him. He didn’t lose his signal in the elevator, and Robert answered immediately.\\n\\n “I need to talk to you about Genevieve O’Brien and the missing prostitutes,” he said.\\n\\n “What?” Robert said.\\n\\n “I said—”\\n\\n “No, I heard you. But…Genevieve wasn’t a prostitute.”\\n\\n “I know. Humor me,” Joe said, quite sure that Robert had made the same connection he had but wasn’t about to give anything away.\\n\\n “All right. I’m at the site. Can you meet me here?”\\n\\n “What site?”\\n\\n “What do you mean, what site? The new dig site. The Big New York Dig, they’re calling it.” Robert was silent for a second, then added, “Down by Hastings House.”\\n\\n “I’ll be there in a few,” Joe said, and hung up.\\n\\n Leslie was filthy, but she barely noticed and certainly didn’t care. She was alive with the thrill of discovery that had been part of her chosen vocation from the very beginning. This place was an archaeological gold mine.\\n\\n In a matter of hours they had laid out their grid, and Laymon had taken on a number of professionals, using all the people from the museum who were already involved and twenty grad students from local universities. People were down on their knees with small trowels and delicate brushes, while heavy machinery stood silently by. Thus far, they had found shoe buckles, belt buckles and fragments of jewelry.\\n\\n Leslie was sure there would be lots more.\\n\\n At first she hadn’t known why she was drawn to a particular section of the grid. But then, as she dug and then dusted, she had looked up…\\n\\n And seen the child.\\n\\n She must have been about seven. She was hugging a handmade, unbleached muslin doll. Her hair was in a single braid. She was very thin, and her legs were slightly bowed. Rickets, Leslie thought. She had stared at the child for several seconds before she realized she was seeing someone none of the others could.\\n\\n A ghost child.\\n\\n She smiled, hoping no one noticed as she whispered, “Hello.”\\n\\n The little girl had huge brown eyes. She was dressed in a calico print dress and a spotless apron. She hugged the doll more tightly and mouthed back, “Hello. You can see me?”\\n\\n “Yes.”\\n\\n “What did you say, Leslie?” Brad, just a few feet away but luckily with his back to her, asked.\\n\\n “Uh, nothing. How are you doing?”\\n\\n “Fine,” he replied, then turned back to his work.\\n\\n Leslie smiled at the child again. “What’s your name?”\\n\\n “Mary.”\\n\\n “Beautiful name,” Leslie said.\\n\\n “What did you say?” Brad demanded again.\\n\\n “Nothing.”\\n\\n “You’re talking to yourself again,” Brad said with a sigh, staring at her.\\n\\n “I’m just singing. It passes the time.”\\n\\n “Oh. Well…you can’t carry a tune, you know.”\\n\\n “Thanks. I’ll avoid karaoke clubs, then.”\\n\\n He made a grunting sound of irritation, rolled his eyes and went back to work.\\n\\n She was afraid that Mary would be gone, but the ghostly child had remained. She was grinning. “I’m sure you sing just fine, miss.”\\n\\n “Thank you.” She hesitated. “Are you lost?”\\n\\n “I don’t know where my mother is.”\\n\\n “Was she…sick?”\\n\\n The little girl nodded gravely.\\n\\n “And were you sick, too?”\\n\\n She nodded and looked troubled. “I think my mother died. I think I came here with my father when she died. But I can’t find her now.”\\n\\n “Do you think that her grave was here…right here, where I am now?”\\n\\n The girl pointed a few feet away.\\n\\n “I’ll find her. When I do, Mary, they’ll take her away for a bit. But…I’ll find you, too. And I’ll make sure, in the end, that they keep you together.” She took a deep breath. “Mary…you know that you’re…”\\n\\n “I’m dead. Yes, I know. I just want my mother.”\\n\\n Despite herself and everything she knew, Leslie felt a terrible chill. The sun was bright. It was a beautiful day. She was glad she was surrounded by people. Real live people.\\n\\n Brad was standing, dusting his hands on his khakis. \\n\\n","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-12.html","bookId":2270,"book":{"id":2270,"title":"The Dead Room (Harrison Investigation #4)","description":"Storyline: The Dead Room (Harrison Investigation #4) \\n A year ago, archaeologist Leslie MacIntyre barely survived the explosion that took the life of her fiance, Matt Connolly. In the long months since, sh\u0027s slowly come to terms not only with her loss but with her unsettling new ability to communicate with ghosts, a dubious \u0027gift\u0027 received in the wake of her own brush with death. \\n Now sh\u0027s returned to lower Manhattan\u0027s historic Hastings House, site of the explosion, to conquer her fears and investigate a newly discovered burial ground. In this place restless spirits hold the secrets not only of past injustice but of a very real and very contemporary conspiracy with deadly designs on the city\u0027s women--including Leslie herself. \\n By night Matt visits her in dreams, warning her and offering clues to the truth, while by day she finds herself helped by--and attracted to-- his flesh-and-blood cousin Joe. Torn by her feelings for both men, caught between the worlds of the living and the dead, Leslie struggles against the encroaching danger that threatens to overcome her. As she is drawn closer to the darkness at the heart of Hastings House, she must ultimately face the power of an evil mind, alone in a place where not even the men she loves can save her.\\n","cover":"https://allnovel.net/images/the-dead-room-harrison-investigation-4.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-dead-room-harrison-investigation-4.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:28:02 PM"}}
