{"id":88433,"no":13,"title":"Page 13","content":"\n She made a face at him. “I think I’m going to move right over there. Want to give me a hand? We’ll need to dig a bit.”\n “How do you know?”\n “A hunch. Instinct. I don’t know. But I want to try over there.”\n He looked both skeptical and annoyed, but he joined her nonetheless.\n They began to work in silence. Leslie looked up, intending to smile and reassure the child again, but the little girl was gone.\n She didn’t know how long she worked, she was so absorbed in what she was doing. And then, at last, she hit a fragment of wood.\n “Brad.”\n “What?”\n “Look.” She dusted the piece and handed it to him. “Coffin?” she asked softly.\n “Let’s keep going.”\n A minute later he let out a hoarse cry. He’d come across a piece so big it could actually be termed a board.\n “We’re on it,” Leslie murmured.\n “Delicately, delicately now…just the brushes, no matter how long it takes.”\n “Yeah, yeah, I know. How long have we worked together?”\n He didn’t even look up.\n She found the first bone. A breastbone. They both stopped and looked at each other.\n “Let’s go a little farther,” he whispered.\n She nodded. They went back to work, meticulously, slowly. Her back ached, but she scarcely noticed the discomfort. Minutes passed. Eventually they revealed the skeletal remains of a woman. Bits and pieces of fabric had also survived the ravages of time and the worms of the grave. And a cross. A simple gold cross. Very tiny, a poor woman’s treasure.\n About to get up and summon the others, Leslie realized that they were already surrounded. Silently, and one by one, about twenty people, including Professor Laymon, Robert Adair and Hank Smith, had circled carefully around their position.\n “Um, well, it’s definitely a graveyard,” Leslie said.\n “We knew there was a church here. It’s a churchyard. There will be lots of graves, and, with luck, they’ll reveal volumes of new understanding about the area,” Professor Laymon said, pleased.\n Leslie wondered if Hank Smith felt happy. He shouldn’t. This would put his project on hold for some time.\n But Hank Smith was smooth, a man who had apparently learned never to give his true emotions away. His face revealed absolutely nothing of whatever he was feeling.\n Laymon, however, looked as if he were about to have an orgasm.\n “Oh. My. God,” he breathed. He sounded like a Valley girl, Leslie thought with a smile. “All right, we’ll need to get the photographers over here…and the news crews.” He frowned. He didn’t want anyone trampling on what he now considered to be his territory, but they could always use the publicity, and, anyway, there was no way not to allow the press at least some access, especially since it was the good PR that kept the developers happy. “Sergeant Adair, will you post a guard, please? And when we bring her up, I want her in situ…the dirt around her and beneath her.”\n Laymon definitely looked as if he belonged in a laboratory somewhere—or filming a mad scientist movie—Leslie thought. He was in a smudged white lab coat, his glasses were sitting halfway down his nose, and his hair was dusty and sticking out at odd angles. She smiled. The man certainly got into his work.\n Hank Smith reached down to help her up the little incline from where she’d been digging. She hesitated, worrying about leaving Mary’s mother alone.\n “Leslie, come on up. I promise, you’ll get to oversee as soon as the photographers are done,” Laymon said.\n She grinned at Hank Smith and accepted his hand, then found herself apologizing. He was wearing a suit that appeared to be the most haute of designer apparel, even if it had been designed for business. He looked like a million bucks in it. “I’m going to ruin your clothing. I’m a mess.”\n “You’re a beautiful mess,” he said politely, and grinned. “In fact, you can mess me up any time you like.”\n “Thanks,” she murmured, unsure just how to take his words.\n Brad had stepped up on his own; others were milling closer.\n Leslie noted that Robert Adair had walked off. She frowned, trying to see where he had gotten to.\n “Smile,” Hank whispered to her, drawing her close. A reporter had arrived. Leslie found herself standing between Hank and Laymon, and the men slipped their arms around her quickly. A flash went off.\n Great.\n “Hey, Miss MacIntyre, you’re getting famous for finding bones,” a slender young newswoman called to her. “How did you find this lady?”\n “The site was found for me,” she returned.\n “Want to escape?” Hank Smith whispered to her.\n “Yes,” she said. “Brad and Laymon can handle this.”\n “Miss MacIntyre—”\n “Talk to my partner, please, I’ve got to get…uh…”\n “Come on. There’s a trailer right over there,” Hank said. He waved a hand to the reporter. “Excuse us, please.”\n He led her firmly away from the crowd, maneuvering with a surprising expertise through the stakes and ropes that then divided the site until they reached the trailer, parked near the street. It had been put there originally for the convenience of the building crew, she realized as he ushered her in.\n The trailer was light and bright, offering a work station, kitchenette and table. “Take a seat, relax. I can get you water, soda, iced tea. Even wine, beer…”\n “Iced tea sounds really great.”\n He offered her a bottle and took one for himself, then crossed the trailer to open the plain cotton drapes. “I guess they’ll be there for a bit.” He let the drape fall. “Well.” He sat across from her at the work station. “You really do have a nose for homing in on the past, don’t you?”\n “Seriously, the site was there. And all those other sections of the grid? We’ll find more, believe me. I just happened to be in the right place at the right time, as they say.”\n “Sounds like you happen to be in the right place at the right time a lot,” he said pleasantly. Then he hesitated. “I’m sorry, you were in the hospital a long time, not in the right place at all the night that…I’m sorry. I didn’t mean to make you remember.”\n “It’s all right. I never really forget.”\n “Hey, I’d love to hear about Virginia sometime.”\n “It’s a great state.”\n “And you made a great find there.”\n “It was pretty exciting,” she admitted.\n “An old churchyard…and here you are, proving there’s another old churchyard right here. I’d love to hear more about how you do it sometime. Maybe you’ll go to lunch with me one day.”\n She started to protest, but he lifted a hand. “Look, you’re a bright and, let’s face it, gorgeous woman, but I know you’re not interested in dating. So I’m not asking you on a date. I’d just like to buy you lunch one of these days.”\n She nodded. “Yes, then. Someday you can take me to lunch.”\n “Since you won’t date, maybe you can teach me more about figuring out women,” he said, shaking his head in dramatic bewilderment.\n “Hank, you’re rich, important and a handsome guy,” she said dryly. “I’m sure your life is full of women.”\n “Yes, full, but…which one is the right one?”\n “I’m not sure I can help you with that. Hey, are you upset that we made the find? This has to be costing you, I know.”\n He shook his head. “Honestly, we can spin this so that every state in the union wants to see our bids when they have a project coming up. Some people get testy when a building is put on hold. I may think, ‘Damn, how did we pick another blankety-blank historic site?’ for a few minutes, but then I move on. The world is what it is. And yes, it runs on money, so I like money. But perception is important, and creating the perception that we’re humanitarians, conservationists, is good business.”\n “Well, here’s to your excellent spin-doctoring and perception, then. Cheers,” she said, lifting her bottle of tea to his.\n “Cheers. Though this should be champagne,” he said.\n “To tell you the truth, I like the taste of tea much better,” she said.\n “Are you a total teetotaler?” he asked with mock horror.\n “Not at all. Just give me a good beer and a slice of pizza any day,” she said.\n “A down-home girl, huh?”\n Hank was nice, she thought, but things were beginning to feel a little bit too chummy.\n She rose and walked over to the window, looking out. She could see Robert Adair standing out on the sidewalk, on the other side of the fence, talking earnestly to a tall, light-haired man. Her heart began to thud. Tall and light-haired—like Matt. His head was bowed in concentration, as Matt’s had so often been. He looked up. Matt’s features. Not…\n He said something to Robert, thanking him, she thought. Then he turned away.\n “Hey!” she cried.\n “What is it?” Hank demanded.\n “That man…Excuse me, Hank, but I have to get to Robert….” The trailer was narrow; she almost stumbled over him in her haste to get away.\n “Leslie—”\n “Thanks!” she called over her shoulder. “See you later.”\n She streaked across the site, avoiding the ropes and stakes of the grid out of habit. She headed straight for the fence.\n But Robert was gone.\n And the other man was gone, too.\n As if he had never been.\n As if he were…\n A ghost.\n 5\n T hat night, he came to her at last, but not as she could ever have expected.\n It was late when she left the dig. Her hasty exit from the trailer had exposed her to the reporters again, and there had been more pictures to be taken. This time she posed with Brad. Inevitably, there had been questions about the events of last year, and even some unexpected concern about her health. She was grateful to realize, during the course of the questioning, that no one had mentioned that she had chosen to stay at Hastings House, so she was spared any inquiries on that score. Still, the whole thing seemed to take forever, and she was longing for a shower and solitude. She realized, however, that she had been given an opportunity to remind everyone that this had been a graveyard and the remains found here deserved to be treated with respect and consideration. “I’m hoping we can put some families back together again,” she was able to say. \n","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-13.html","bookId":2270,"book":{"id":2270,"title":"The Dead Room (Harrison Investigation #4)","description":"Storyline: \n The Dead Room (Harrison Investigation #4) \n A year ago, archaeologist Leslie MacIntyre barely survived the explosion that took the life of her fiance, Matt Connolly. In the long months since, sh\u0027s slowly come to terms not only with her loss but with her unsettling new ability to communicate with ghosts, a dubious \u0027gift\u0027 received in the wake of her own brush with death. \n Now sh\u0027s returned to lower Manhattan\u0027s historic Hastings House, site of the explosion, to conquer her fears and investigate a newly discovered burial ground. In this place restless spirits hold the secrets not only of past injustice but of a very real and very contemporary conspiracy with deadly designs on the city\u0027s women--including Leslie herself. \n By night Matt visits her in dreams, warning her and offering clues to the truth, while by day she finds herself helped by--and attracted to-- his flesh-and-blood cousin Joe. Torn by her feelings for both men, caught between the worlds of the living and the dead, Leslie struggles against the encroaching danger that threatens to overcome her. As she is drawn closer to the darkness at the heart of Hastings House, she must ultimately face the power of an evil mind, alone in a place where not even the men she loves can save her.\n \n","cover":"https://allnovel.net/images/the-dead-room-harrison-investigation-4.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-dead-room-harrison-investigation-4.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:28:02 PM"}}
