{"id":88462,"no":42,"title":"Page 42","content":"\n Nikki turned, her delicate features forming an instant smile. Adam had his calm, fatherly look in place.\n She didn’t know who to hug first. “I can’t believe you’re here. Why are you here?” she demanded, hugging them each twice for good measure.\n “I guess you three really are old friends,” Professor Laymon said dryly. “I’ve been telling them about the remains in the basement,” he went on, then looked pointedly at his watch. “You are working today, aren’t you?”\n “Of course,” she assured him. “You’re not just dropping by and leaving, are you?” she asked, looking from Adam to Nikki. “And where’s Brent?” she asked Nikki.\n “He couldn’t come. He’s out in Los Angeles at the moment. Adam told me he was coming up here, so I decided to join him,” Nikki said. “I’m meeting Brent out west, but I have tonight.”\n “I’m leaving in the morning for London, but I’m here tonight, too,” Adam assured her.\n “Great.”\n “You didn’t call, so I assume things are going well,” Nikki said.\n “Going well? She’s incredible,” Laymon said. “She found a crypt that could have taken us forever to uncover. I’ve been champing at the bit to explore it, quite honestly. A ceiling came down almost immediately, but the workmen have shored everything up now. But, leave it to Leslie, she’s gone and found more bones here.”\n “Every discovery is an important one,” Nikki said.\n “Well, in this case, I’m trying very hard to see that the lady is given a proper Episcopalian burial,” Leslie said.\n “Have you done anything in that direction yet?” Adam asked.\n “No, but I’m sure we won’t have any problems.”\n “I have an old friend in the church,” Adam said. “I can cut through some of the red tape for you, since I take it you don’t want her sent out of the city?”\n Leslie smiled at Adam. The man was a veritable miracle worker.\n “Hey, maybe we could move this along some,” Brad said, walking over to join the conversation.\n As the introductions were made, Brad kept looking at the two newcomers strangely. “I’ve met you before,” he told Adam. “You were at the hospital last year, when Leslie…”\n “Yes, I was. Good to actually meet you,” Adam said, shaking Brad’s hand.\n “Why don’t you guys take a tour of this place this morning, then grab some lunch, and I’ll be back by late afternoon,” Leslie suggested to Adam and Nikki.\n “I love tours,” Nikki said.\n “She gives ghost tours in New Orleans,” Leslie explained.\n “I thought she worked for Mr. Harrison,” Brad said.\n “I do research. Adam has researchers working all over the country,” Nikki said.\n Brad continued to look suspicious, and Leslie decided that he must be feeling proprietorial. A half hour earlier, he would have been certain he knew all her friends, and she suspected he wasn’t enjoying knowing he’d been wrong.\n That guess proved to be correct. Down in the basement, the crates were ready, the tool boxes were open, and work had begun. Time had taken its bitter toll on the remains. Laymon had already given her a speech about how the removal of the bones should have been videotaped, but out of respect for her feelings, he had decided not to allow filming in the basement until after the remains had been taken away. After Nikki thanked him, he left to go back to the work he considered important, exploring the crypt. Leslie and Brad were busy at the delicate work of preparing the skeleton for removal. Down here, conditions hadn’t been kind. There were a few patches of hair on the skull and a few bits of fabric so blackened by time that they were barely identifiable as cotton.\n “Are we test-tubing anything?” Brad asked her.\n “No. Let’s just get her a real burial. Please?”\n “You know, someone with more power could step in on top of us.”\n “I have a feeling they won’t.”\n “Because of your friend?”\n “Adam, you mean?”\n “Who is that guy?”\n “An old friend.” Well, Adam was old, even if she hadn’t actually known him all that long.\n “I see. He has that air about him.”\n “What air?”\n “Like a guy who speaks softly but somehow everyone knows he’s carrying a really big stick.”\n Leslie shrugged. “He owns his own company, and he’s done work for the government.”\n Brad laughed. “He doesn’t look like an assassin.”\n “That’s because he’s not an assassin.”\n “Then what does he do for the government?”\n “Research.”\n “What kind of research?”\n “Historical, of course. Hand me that brush, please.”\n “You’re evading me.”\n “I’m telling you the honest-to-God truth,” she vowed.\n He held the brush for a minute, looking at her suspiciously, before finally handing it over.\n A few minutes later, as they worked in silence, Brad gasped.\n “What?”\n “There—on the floor.” He bent down to take a closer look. “I take it you won’t mind if we have this tested?”\n “What is it?” she asked.\n “The shot that killed her,” Brad said softly.\n When Joe got to the site he was glad to find out that Laymon and Brad had already gone on to Hastings House to oversee the removal of the bones by the basement hearth. He didn’t want to see either one of them.\n One of the workers directed him to the guard who had been on duty at the gate the day before. He remembered seeing Laymon early in the morning and Brad late in the afternoon.\n He went on to question the grad students. They, too, had seen Laymon early and Brad late.\n “How about Hank Smith? Was he around yesterday?” Joe asked two of the students, a married couple in their early thirties who had met as undergrads on a dig. It had been a life of digging in the dirt for the two of them ever since.\n “Calvin Klein, you mean?” the husband asked with a grin. “The guy with the suits?”\n “Right. Him.”\n “He hangs around here a lot,” the wife said. “Well, he hangs around for a while, goes to his trailer, comes out, hangs around…who knows what he does?”\n “But was he around yesterday?” Joe asked.\n They looked at each other, thinking. “I get busy with a dig, and…” The husband lifted his hands apologetically.\n “No,” the wife said decisively. “I know I didn’t see him. I actually look for him every day.”\n “Wendy!” her husband said, surprised and hurt.\n “It’s his clothes, Cal. I love to see what he’s going to wear next.”\n “Were any of the cops around yesterday?” Joe asked.\n They both stared at him. Cal cleared his throat. “Take a look around. There are always a ton of cops.”\n “I’m thinking of Robert Adair, older guy, heavy, but all muscle. And the good-looking one who does the public speaking.”\n “Did you see either of them?” Wendy asked Cal.\n “I don’t think so,” Cal said.\n “I’m not sure about the older guy, but I didn’t see the good-looking one.”\n “You’re sure?” Joe asked.\n “I would have noticed,” Wendy said.\n “Oh, so it’s not just the clothes?” Cal asked wryly.\n Joe left them to their friendly bickering and went on, still trying to put the pieces together in his mind.\n Leslie was anxious about how Elizabeth’s bones were being treated, but she was equally anxious to spend time alone with Adam and Nikki. For now, though, there was nothing more she could do for the evening. The bones were safely crated, and she and Brad had secured some of the fabric and surrounding earth for testing. In the morning, they would have to make a trip to the morgue, but once the remains were officially aged, Elizabeth could take her place in hallowed ground.\n Leslie tried hard not to be rude to Brad, though she was aware that he was angling for an invitation to join her and her friends. She gave him a quick hug. “Finish up with the tools, will you, please? I want to spend as much time as I can in with Adam and Nikki, and they both have to leave tomorrow.”\n “Sure. You guys going barhopping?”\n “No, we’re a sedate crowd.”\n “She’s pretty cute to be sedate.”\n “She’s married. Happily.”\n “Damn,” he said. Then, “I’m teasing!” he added when she stared at him. He let out a sigh. “Go on. Have fun. I’ll finish here.”\n She ran up the stairs, realizing that the basement had held no eerie mysteries all during the day. She hadn’t heard or felt anything. Did that simply mean that she had been letting her imagination run wild? Was she inventing half of what she had been told was a “talent”? Or maybe her mind had been so filled with the present today that she hadn’t had time to dwell on the past.\n She could hear two tours going on. Tandy was in the parlor, while Jeff had moved on to the dining room. She quickly popped her head into each room to see if Adam and Nikki were there, but there was no sign of them. She headed upstairs to her room. As she got ready to hit the shower, she remembered that she hadn’t spoken with Joe all day. She hesitated. She desperately wanted to speak with Nikki alone; she needed to ask her why she couldn’t communicate with Matt when she was awake. But she also felt she had to call Joe, given his concern for her welfare. And, whether it was because he was Matt’s cousin or not, she felt an affinity for him, as if she had known him, been close to him, for years, rather than just days.\n She called Joe, but he didn’t pick up. She left him a hasty message, telling him friends had unexpectedly showed up in town and she would be out with them, but to please call her cell when he could. She tried Nikki then, and Nikki did pick up. “We’re just down by City Hall, but we’ll head back now. Oh, and Adam saw his friend Father Behan. Burial is all set, just as soon as the remains are cleared.” \n","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-42.html","bookId":2270,"book":{"id":2270,"title":"The Dead Room (Harrison Investigation #4)","description":"Storyline: \n The Dead Room (Harrison Investigation #4) \n A year ago, archaeologist Leslie MacIntyre barely survived the explosion that took the life of her fiance, Matt Connolly. In the long months since, sh\u0027s slowly come to terms not only with her loss but with her unsettling new ability to communicate with ghosts, a dubious \u0027gift\u0027 received in the wake of her own brush with death. \n Now sh\u0027s returned to lower Manhattan\u0027s historic Hastings House, site of the explosion, to conquer her fears and investigate a newly discovered burial ground. In this place restless spirits hold the secrets not only of past injustice but of a very real and very contemporary conspiracy with deadly designs on the city\u0027s women--including Leslie herself. \n By night Matt visits her in dreams, warning her and offering clues to the truth, while by day she finds herself helped by--and attracted to-- his flesh-and-blood cousin Joe. Torn by her feelings for both men, caught between the worlds of the living and the dead, Leslie struggles against the encroaching danger that threatens to overcome her. As she is drawn closer to the darkness at the heart of Hastings House, she must ultimately face the power of an evil mind, alone in a place where not even the men she loves can save her.\n \n","cover":"https://allnovel.net/images/the-dead-room-harrison-investigation-4.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-dead-room-harrison-investigation-4.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:28:02 PM"}}
