{"id":36081,"no":43,"title":"BOOK VIII CHAPTER I","content":"April 20. As English history to the vast majority of Englishmen begins with the Norman, so does also the modern history of India begin with the Mohammedan, conquest. As early as in the eighth century Arab conquerors made incursions into Scinde as far as Hyderabad, only to be driven back by a revolt of Hindoos; but it was not until the eleventh century that Sultan Mahmoud, the second of the House of Ghuznee, established a Mohammedan garrison to the south of the Indus at Lahore, nor until the end of the twelfth century that Shahab-ud-din penetrated as far as Benares and fixed the seat of government at Delhi. It was at his death that India assumed the form of an independent kingdom distinct from the governments to the north of the Indus; and it was only a few years later that the invasion of the Moguls under Zinghis Khan heralded the approach of the race that was first to gather the greatest portion of the peninsula into a single empire, and to found a dynasty which should rule it. The battle of Delhi placed Baber, the first of this dynasty, in possession of the capital, and set up therein the throne of the Great Mogul. Baber\u0027s grandson, Akbar, after fifty years of conquest, wise policy and incessant labour, reduced the whole of Hindostan and great part of the Deccan under the Mogul Empire, dividing it for administrative purposes into eighteen provinces, each under the rule of a governor or subahdar. But the Deccan had never been firmly secured; and even after the Hindoos had submitted there were Mohammedan[168] chieftains who refused to acknowledge the supremacy of the Moguls. Too jealous, however, to unite in resistance, these chieftains allowed themselves to be crushed in detail; and in 1656 the Emperor Shah Jehan seemed to have established his authority over all the Mohammedan kingdoms of the Deccan. But even so the work of Shah Jehan did not endure. In the reign of his son Aurungzebe a new power appeared to dispute the rule of the Moguls in the Deccan. A race of Hindoo mountaineers, the Mahrattas, came down from their fastnesses in the Western Ghauts and hired themselves out as mercenary soldiers to the Mohammedan chiefs. Led by a man of genius, the famous Sevajee, the Mahrattas grew continually in strength, and at length fairly defeated the army of the Moguls in the open field. It was not until after the death of Sevajee that Aurungzebe was able to drive his followers back to the hills, and push his Empire to its farthest limits to southward, so far indeed as to include in it even a portion of Mysore. Never before, it should seem, had so much of the peninsula been united under the dominion of one man; but the Mahrattas none the less had laid the axe to the root of the Mogul Empire, and from the death of Aurungzebe the tree, though destined to totter for yet another fifty years, was already doomed. It must now be told how the foundation of a new Indian Empire fell not to the Mahrattas but to invaders from Europe. 1498. 1600, Dec. 31. The first of the European nations to gain a footing in the peninsula was of course the Portuguese. In 1493 Bartholemew Diaz doubled the Cape of Good Hope, and five years later Vasco da Gama arrived on the Western or Malabar coast, and after a second voyage obtained permission to establish a factory at Calicut. His work was continued by Albuquerque, under whose care the Portuguese power in India was more widely extended than at any time before or since. To him it was due that Goa was made the chief centre of Portuguese influence, and that Ceylon became tributary to[169] Portugal\u0027s king. It was not, however, conceivable that Portugal should long be allowed to enjoy the monopoly of this lucrative traffic; and competitors soon presented themselves from the maritime powers of Europe. Moreover, in 1580, Portugal passed under the crown of Spain, so that any encroachment on her East Indian trade inflicted also some damage on the detested Spaniard. In 1582 an Englishman, Edward Fenton, led the way by attempting a voyage direct to the east. The venture, however, was a failure, as was also a second attempt made by James Lancaster in 1589. Finally, a Dutchman, James Houtmann, sailed from the Texel in 1595, and presented himself as the first rival of the Portuguese by the establishment of a factory at Bantam in Java. But though thus distanced for a moment in the race for a new market the English speedily resolved to make up the lost ground; and in 1599 an association of Merchants Adventurers was formed in London with the object of prosecuting a voyage to the East Indies. In the following year they received a charter from Queen Elizabeth, and thus came into being the famous East India Company. 1607. 1611. 1612. 1628. 1651. The two first voyages of the new Company followed the track of the Dutch to Sumatra and Java, but in the third the ships were driven by stormy weather into Sierra Leone, whence one of them under Captain Hawkins sailed direct to Surat, and found there good promise of opening trade. In 1609 Hawkins visited Agra in person and obtained privileges from the reigning Mogul, eldest son of the great Akbar; but his influence was soon undermined by Portuguese Jesuits, and he was fain to return with little profit. Two years later, however, an English vessel touched at Point de Galle, sailed up the Coromandel, or eastern, coast of India as far as Masulipatam and founded the nucleus of a factory at Petapolee, the germ from which was to spring the trade of England in the Bay of Bengal. The jealousy of Dutch and Portuguese had by this time risen so high that the Company was obliged to employ[170] force against them. In 1612 Captain Best boldly attacked a superior Portuguese fleet in the Bay of Surat, and defeated it so thoroughly that the reigning Mogul disallowed the Portuguese claim to a monopoly of the trade, agreed to a treaty granting important privileges to the English, and consented to receive an ambassador from them at his Court. One formidable rival was thus crippled, but the Dutch were not so easily to be dealt with, more particularly since the troubles which followed on the accession of Charles the First in England left them little to fear from an armed force. The affairs of the Company began to languish, but fresh outlets for trade were none the less sought for. One factory was definitely established at Masulipatam, a second on the coast further northward, and finally, in 1640, a third was settled at Madras under the name of Fort St. George. This was the one gleam of sunshine at that period amid all the troubles of England at home and abroad. Then at last the cloud of the Civil War passed away; the power of England began to revive, and the Company addressed a petition to Parliament for redress of injuries received from the Dutch. Thereupon followed the Dutch war and the seven furious actions of Blake and Monk, which dealt Dutch maritime ascendency a blow from which it never recovered. A piece of unexpected good fortune, namely the recovery of Shah Jehan\u0027s daughter from dangerous sickness under the care of an English surgeon at Surat, procured for the Company free trade with Bengal. At the close of the Protectorate the Company had organised its markets into three divisions. A supreme presidency was established at Surat with special charge of the Persian trade, a subordinate presidency at Madras with control of the factories on the eastern coast and in Bengal, and a third presidency at Bantam for direction of the traffic with the Eastern Islands. 1660. 1661. Then came the Restoration, and with it a new charter empowering the Company to send ships of war, men, and arms to their factories for defence of the same,[171] and to make peace or war with any people not Christians. Authority was also granted for the fortification of St. Helena, which since 1651 had become the port of call on the voyage to India, and stringent provision was made for the maintenance of the Company\u0027s monopoly. The following year brought Bombay by dowry to the British Crown, and in 1662 Sir Abraham Shipman was sent out with four hundred soldiers to take possession and to remain as governor. These were the first British troops to land in India, but as there was a dispute with the Portuguese as to whether the word Bombay, as inscribed in the treaty of marriage, signified the island only or included its dependencies also, the poor fellows were landed on the island of Anjediva, near Goa, where they at once began to sicken. In 1664 they were transferred to Madras, in view of the war with Holland; but by the end of the year Shipman and a vast number of the men were dead, and when at last they landed in Bombay, in March 1665, the four hundred had dwindled to one officer and one hundred and thirteen men. Such was the first experience of the British Army in India.[235] 1668. In 1668 Bombay, together with the whole of its military stores, was made over to the Company for a rent of ten pounds a year; and authority was also given for the Company to enlist officers and men for their own service, as well as to call in certain garrisons of the King\u0027s troops at Bombay and Madras to fill up vacancies. Further, in order to form a local militia, half-pay was granted to all soldiers who would settle on the island, new settlers were promised from England, and a rule was made that not more than twenty soldiers should return to Europe in any one year. The men and officers of the King\u0027s troops at once took service with the Company under its own military code and articles of war, and thus was founded the first military establishment in Bombay. The men agreed, it seems,[172] to serve for three years only, which gives them an additional interest as the first English soldiers ever enlisted for short service. Having thus provided itself with men the Company proceeded next to the improvement and fortification of Bombay itself, and with such vigour that by 1674 no fewer than one hundred cannon were mounted for its defence. Finally, in 1683-84 the garrison was increased from four hundred to six hundred men, two companies of Rajpoots were embodied as an auxiliary force, and Bombay was made the headquarters of the Company in India. 1685. The Company thus strengthened forthwith became ambitious. Hitherto it had addressed the native princes in terms of humble submission: it now assumed the tone of an equal and independent power, able to command respect by force of arms. It also equipped a fleet of twelve powerful men-of-war, which was first to capture Chittagong and then to proceed up the eastern branch of the Ganges to seize Dacca. Hostilities were precipitated by a quarrel between English and native soldiers in the bazaar at Hooghly, wherein the forces of the nabob of the province were defeated. The nabob, however, avenged himself by pouncing upon the British factory at Patna; and the approach of Aurungzebe caused the British to withdraw from Hooghly to Chuttamuttee, the site of the present Calcutta. Thus the war against the Moguls ended in the utter humiliation of the Company. The period of conquest was not yet come. 1642. 1668. 1669. 1697. 1701. Meanwhile a new rival had sprung up in the East Indies. In 1609 a French East India Company had been formed, which after thirty years of ineffectual life at last gave definite evidence of vitality by the formation of a settlement at Madagascar. The venture was not a success; but the great minister Colbert, quickly awake to the advantages of an Indian trade, granted the help of the Government to form a new Company, which, after wasting some time and money on a second experiment in Madagascar, sent an expedition[173] to Surat. There in 1668 was established the first French factory in India, which was quickly followed by the erection of a second at Masulipatam. But, if the Company were to prosper, something more than a factory with a rival factory alongside it was needed; and this want was made good by the foundation of Pondicherry by Fran?ois Martin in 1674. Two or three years later a French fleet entered the Hooghly and disembarked a body of settlers at Chandernagore, which was finally granted to them by Aurungzebe in 1688. Meanwhile the foolish quarrel of the English Company with the Moguls had given the French an opportunity to take a share of the Indian trade, of which they did not fail to make good use. Their further progress was, however, checked for the moment through the capture of Pondicherry by the Dutch in 1693; but the settlement was restored at the Peace of Ryswick, and no time was lost in improving and fortifying it. Shortly afterwards the French abandoned their factory at Surat and transferred their headquarters to Pondicherry. On the whole they had made good use of their time. The settlements of the British Company after one hundred years of existence were set down, in contemporary spelling, as follows: Bombay, with factories at Surat, Swally, Broach, Amadavad, Agra, and Lucknow; on the Malabar coast the forts of Carwar, Tellicherry, and Anjengo, with the factory of Calicut; on the Coromandel coast Chinghee, Orixa, Fort St. George or Madras, Fort St. David (which had been purchased in 1692 as a counterpoise to Pondicherry), and the factories of Cuddalore, Porto Novo, Petapolee, Masulipatam, Madapollam, and Vizagapatam; in Bengal, Fort William (Calcutta), with factories at Balasore, Cossimbazar, Dacca, Hooghly, Moulda, Rajahmaul, and Patna. The French could show Pondicherry, with a factory at Masulipatam on the eastern coast, and Chandernagore and Cossimbazar on the Hooghly as the result of barely five-and-thirty years of work. Such competition as this might not at first appear[174] formidable to the English, but the comparative strength of the rival nations in India was not to be measured by mere counting of forts and factories. Fran?ois Martin had shown considerable dexterity in handling the native authorities during the negotiations by which he acquired Pondicherry, and had established good traditions for the management of similar business in future. All Frenchmen had and still have a passion for interference with the internal politics of any barbarous or semi-civilised races with which they may be brought into contact, and will spare no pains to gratify it. The emissaries of the most insolent nation in Europe approached the Indian princes with flattery of their self-esteem, deference for their authority, respect for their prejudices, conformity with their customs and imitation of their habits; while the French love of dramatic action and of display brought them at once into touch with the oriental character. They gave sympathy, sometimes in reality, always in appearance; and they obtained in return not only toleration but friendship and influence. Mere trading was sufficient for the English; it was not so for the French. Their ambition rose above the mere bartering of goods to the governing of men and the swaying of them by subtle policy to the glory of France. It was no ignoble aim, and might well lead to the making, if not to the keeping, of an Empire. 1707. 1719. Aurungzebe at his death divided his dominions among his three sons, who at once fell to fighting for the succession to the entire realm. The contest was decided after a year in favour of the eldest of them, Bahadur Shah, who hastened to make terms with the Mahrattas in the south, but secured a precarious peace in that quarter only to find himself confronted with an insurrection of Rajpoots and with the sudden and alarming rise of the Sikhs in the Punjaub. He died in 1712, when the succession after the inevitable dispute passed to his grandson Farokshir, who succeeded in crushing the Sikhs but made little head against the Mahrattas, whose territory continued to increase in the[175] south. Finally, on Farokshir\u0027s death in 1719 Nizam-ul-Mulk, the Governor of Malwa, rose in revolt against his successor, made terms with the Mahrattas, and was soon virtually master of the Deccan; to which, after a short-lived reconciliation with the Court of Delhi, he returned in 1724, openly and avowedly as an independent monarch. 1725. 1735. During this period the English Company acquired from Farokshir an extension of territory on the Hooghly, amounting to a tract of nearly ten miles on both sides of the river. The French, on the other hand, were declining owing to the virtual insolvency of the Company; nor was it until 1723, five years after the reconstruction of a new Company, that their prospects in India began to revive. But already, in 1720, a man had been appointed to high station in Pondicherry who was destined to raise French influence in India to a height undreamed of by friend or foe. This was Joseph Fran?ois Dupleix, son of a director of the French East India Company, who, though in boyhood averse to a mercantile life, had been converted by travel at sea to a passion for commercial enterprise and to a longing for a field wherein to indulge it. Such a field was now opened to him, when no more than twenty-three years of age, in India. His idea was to extend the operations of the Company beyond the mere trade between Europe and Pondicherry, and, by opening up traffic with the cities both inland and on the coast, to make Pondicherry the centre of the commerce of Southern India. To show, by example, that such a scheme was feasible, he embarked his own fortune in the trade and made a handsome profit. In 1731 he was sent to Chandernagore, then fast sinking into stagnation and decay, and by his energy soon raised it to the most important European centre in Bengal. Concurrently a second great Frenchman, who was also to leave his mark on India, had made his appearance in 1725. The occasion was the capture of Mahé, a little town on the western coast, where the French desired a[176] port to compensate them for the abandonment of Surat. The feat was accomplished by a captain in the French navy named Bertrand de la Bourdonnais. His next duty, though not performed in India, was none the less of high importance to it, namely the improvement of the island of Mauritius. The French attempts at colonisation in Madagascar had been foiled alike by the climate and by the hostility of the natives; and the settlers had perforce betaken themselves to the adjacent island of Bourbon. La Bourdonnais found Mauritius a mere forest, yet within two years he converted it into a flourishing settlement, well cultivated and well administered, with arsenals, magazines, barracks, fortifications, dockyards, and all that was necessary to make it not only a commercial station but a base for military operations in India. Meanwhile the confusion that accompanied the gradual dissolution of the Mogul Empire was turned to useful account by yet another Frenchman, Dumas, the Governor of Pondicherry. In 1732 the Nabob of the Carnatic died and was succeeded by his nephew Dost Ali, who however was on such ill terms with his superior, the viceroy Nizam-ul-Mulk of the Deccan, that he could not obtain from him authentic confirmation of his succession. He therefore courted the support of the Governor of Pondicherry, conceding to him substantial privileges in return, and soon formed intimate relations with him. Dost Ali, moreover, had a son, Sufder Ali, and two sons-in-law, Mortiz Ali and Chunda Sahib, of whom the last named was imbued with a particular admiration for the French. The extension of French influence through these new friendships advanced rapidly. In 1735 the death of the Hindoo Rajah of Trichinopoly was followed, as usual, by a quarrel over the succession. The widow of the Rajah, who was one of the claimants, took the fatal step of invoking the help of Dost Ali, who sent Chunda Sahib with an army to her assistance. Chunda Sahib, however, once admitted to the city refused to leave it,[177] but assumed the government in the name of Dost Ali; and thus Trichinopoly passed into the hands of a friend to the French. Adjoining Trichinopoly and between it and the eastern coast lay the Hindoo kingdom of Tanjore; the Coleroon river, which formed its northern boundary, running within thirty miles of Pondicherry. Here again the death of the Rajah in 1738 led to a dispute over the succession, and one of the competitors, named Sauhojee, offered Governor Dumas the town of Carical in the delta of the Cauvery and Coleroon, as the price of French assistance. Dumas promptly supplied money, arms, and ammunition; and when Sauhojee, having thus gained his kingdom, declined to fulfil his agreement, Chunda Sahib stepped in unasked to compel him. Thus Carical also was added to the French settlements in India. 1739. 1740. 1741, March. But now the Mahrattas, jealous of the advance of the Mohammedans in the south, gathered themselves together for the conquest of the Carnatic, defeated and killed Dost Ali, and spread panic from end to end of the province. Sufder Ali, thus become Nabob, and Chunda Sahib fell back on their French allies and sent their families and goods for security to Pondicherry. Dumas gave them asylum without hesitation, nor could all the threats of the Mahrattas shake his loyalty to his friends. He answered their menaces by strengthening the defences of the town, formed a body of European infantry, and by a happy inspiration armed four or five thousand Mohammedan natives and trained and drilled them after the European model. Thus was conceived in danger and emergency the embryo, now grown to such mighty manhood, of a Sepoy Army. Meanwhile Sufder Ali, after the Oriental manner, succeeded in purchasing immunity from the Mahrattas by secretly betraying Chunda Sahib into their hands; but none the less his gratitude to the French was extreme. He declared that from henceforth they should be as much masters of the Carnatic as himself, and granted to them additional territory on the southern bounds of Pondicherry.[178] The Mahrattas, pursuant to their agreement with Sufder Ali, then beleaguered Chunda Sahib in Trichinopoly, captured the city after a siege of three months, and carried him off as their prisoner. This done they turned again upon Dumas, and required of him, among other demands, the surrender of Chunda Sahib\u0027s property. Dumas received the Mahratta envoy with courtesy but refused inflexibly to comply; and having shown him the preparations which he had made for the defence of Pondicherry he dismissed him with the assurance that he would stand by the city so long as a man was left with him. This resolute bearing had its effect. The further wrath of the Mahratta chief was allayed by a present of French liqueurs; and the danger passed away. Dumas, as the man who had defied the dreaded Mahrattas, became the hero of Southern India. Presents and eulogies were showered on him by Sufder Ali and Nizam-ul-Mulk; and even the effete Mogul Emperor at Delhi conferred on him the title of Nabob, adding thereto the favour, conferred at Dumas\u0027s own request, that the rank should descend to his successor. Oct. Dumas then resigned and returned to France, leaving Dupleix to reign in his stead. The latter, after ten years\u0027 administration of Chandernagore, had raised it to the head of the European settlements in Bengal, and had concurrently amassed for himself an enormous fortune by private trading. He at once assumed all the pomp and circumstance of his rank of Nabob, caused himself to be installed with great ceremony at Chandernagore, and took pains to impress upon the neighbouring princes that he was one of themselves and armed with like authority from the court of Delhi. He could wear the dignity of his position the more naturally since he had an innate passion for display, and could turn the outward glitter to the better account for that he loved it for its own sake. But his was no spirit to be content with the mere robes of royalty. The weakness of the court of Delhi and his own[179] remoteness from it left him free from all restraint. He had the power, and he knew how to use it; and it had come to him in the nick of time, when hostilities between France and England were hastening to their development into avowed and open war. 1742, Sept. 1744. But meanwhile native affairs had undergone their usual swift changes in the Carnatic. Sufder Ali, once established as Nabob, refused to pay the revenue due from him to the viceroy Nizam-ul-Mulk, and, having little hope of French support in such defiance of authority, transferred his treasures from Pondicherry to the custody of the English at Madras. Shortly afterwards he was assassinated by his brother-in-law, Mortiz Ali, who thereupon proclaimed himself Nabob. His principal officers then appealed to the Mahratta chief, Morari Rao, to drive him out, and Mortiz Ali fled, leaving Sufder Ali\u0027s infant son to reign in his place. The whole province fell into anarchy, and in 1743 the viceroy Nizam-ul-Mulk appeared with a large army to restore order. The Mahrattas therefore retired from Trichinopoly; and, the infant ruler having been made away with, Anwarudeen, one of the viceroy\u0027s officers, was installed as Nabob. By this time Dupleix had received intelligence that war had been declared between France and England, and that a British squadron was on its way to destroy Pondicherry. The French squadron in East Indian waters had been recalled to France; the fortifications of the city were open to destruction by the cannon of men-of-war; and there were less than five hundred Europeans in garrison to defend it against a joint attack by sea and land. At this crisis Dupleix appealed to Anwarudeen for protection, pleading the friendship of the French with the Nabobs of the Carnatic in the past. The Nabob responded by sending a message to Madras that he intended to enforce strict neutrality within his province, and would permit no attack to be made on the French possessions on the coast of Coromandel. 1745. 1746, June 25 July 6. At the close of 1745 the British squadron duly[180] arrived, but found itself, through Anwarudeen\u0027s action, limited exclusively to operations by sea. Meanwhile, also La Bourdonnais, aided partly by the arrival of a few weak ships from France, but chiefly by his own amazing energy and resource, had fitted out a squadron at Mauritius, with which he appeared in July 1746 off the southern coast of Ceylon. An indecisive engagement followed, at the close of which the British commander, Commodore Peyton, with strange pusillanimity sailed to Trincomalee to repair the trifling damage sustained in the action, leaving Pondicherry untouched and Madras unprotected from French attack. The French therefore had won a first and most important point in the game: if the Nabob could be persuaded to let that game proceed without interference, the ultimate victory must lie with France. Aug. 18 29 . Sept. 3 14 . Sept. 10 21 . The town of Madras at that time consisted of three divisions; that on the south side, which was known as the White Town or Fort St. George, being inhabited by Europeans, that next to northward of it being given up to the wealthier class of Indian and Armenian merchants, while a suburb to the north of all was filled with all other classes of natives. Of these divisions the White Town, which was about four hundred yards long by one hundred broad, alone possessed defences worthy the name, being surrounded by a slender wall with four bastions and as many batteries. The total number of English did not exceed three hundred, two-thirds of which was made up of the soldiers of the garrison. The Directors of the East India Company had too often been neglectful of defences in the past, and had improved little in this respect during the past half century. They relied upon the British fleet and upon that alone. The Governor, Mr. Morse, was simply a merchant, a man of invoices and ledgers, with little knowledge of affairs beyond the scope of his business, and ignorant of the very alphabet of intercourse with native princes. There was, it is true, a clerk in his office named Robert Clive, who had arrived in India two years before; but[181] this clerk was known only as a quiet, friendless lad, not without spirit when provoked, but lonely and out of harmony with his environment, and grateful to be able to escape from it to the refuge of the Governor\u0027s library. On receiving intelligence of hostile preparations by the French at Pondicherry, Governor Morse appealed to the Nabob Anwarudeen to fulfil his determination of enforcing neutrality within the Carnatic; but his envoy, being unprovided with the indispensable credentials of a present, met with little success in his mission. On the 29th of August the French squadron appeared before Madras, cannonaded it for a time with little effect and sailed away again; but a fortnight later it reappeared with eleven hundred European soldiers and four hundred drilled natives, under the command of La Bourdonnais in person. The troops were at once landed, batteries were erected, and after a short bombardment Madras was forced to capitulate. The terms agreed on were, that all the English inhabitants should be prisoners on parole, and that negotiations might be reopened later for ransom of the town. Oct. 3 14 . Oct. 10 21 . The Nabob Anwarudeen no sooner heard that the French were actually besieging Madras than he sent a message to Dupleix that unless further operations were suspended he would put an end to them by force. Dupleix answered astutely that he was conquering the town not for France but for the Nabob himself, and would deliver it to him immediately on its surrender. Fortunately for England La Bourdonnais\u0027s views as to the future treatment of Madras differed materially from those of Dupleix. As conqueror of the settlement he claimed that the ultimate disposal of it lay with himself: Dupleix, intent above all things on conciliating the Nabob, as vehemently contended that his authority as Governor-General was supreme in such matters. The two masterful men fell bitterly at variance over the question, and lost sight of all greater interests in the acrimony of their quarrel. La Bourdonnais, fully aware of the danger of waiting on the coast when the[182] northern monsoon was due, but bent none the less on having his own way, lingered on and on before Madras, until on the 14th of October the monsoon suddenly burst upon him with the force of a hurricane, destroyed four of his eight ships utterly, and disabled the remainder. A week later he signed a treaty for the ransom of Madras and for its subsequent evacuation by the French; and this done he returned, as soon as his ships could be made seaworthy, to Pondicherry. There the quarrel with Dupleix was resumed face to face; and after only ten days\u0027 stay La Bourdonnais sailed from India never to return. Oct. 22 Nov. 2. Oct. 24 Nov. 4. Dupleix was now left in sole and unhampered command, with moreover a force of three thousand trained Europeans ready to his hand, some of them left behind by La Bourdonnais, some taken from the French squadron. Such an accession of strength was all important to him, for he had now to reckon with the Nabob, who growing suspicious over the long delay in the delivery of Madras had sent ten thousand men under his son Maphuze Khan to invest the town. Dupleix, who, if he had ever meant to give it up, had determined first to dismantle the fortifications, sent orders to D\u0027Espréménil, the officer in command, to hold the town at all hazards. D\u0027Espréménil finding himself hard pressed made a sortie with four hundred of his garrison, and boldly facing the masses of the enemy\u0027s cavalry opened on them so effective a fire from his field-guns that they fled with precipitation, abandoning their camp to the victor. With their own clumsy artillery, not yet advanced beyond the stage attained by European nations in the sixteenth century, the natives thought it good practice if a gun were discharged four times in an hour; and they were utterly confounded and dismayed by the rapidity with which the French pieces were served. This was one great lesson for Europeans in Indian warfare, but a second and a greater was to follow. After lingering for another day in the vicinity of Madras Maphuze marched to St.[183] Thomé, some four miles to southward of it, to intercept a French force which was on its way to relieve D\u0027Espréménil\u0027s garrison. On the morning of the 4th of November the expected detachment appeared, a mere handful of two hundred and thirty Europeans and seven hundred Sepoys, which had been sent up from Pondicherry under a Swiss officer named Paradis. The situation of Paradis was sufficiently perilous to have alarmed him. His orders were to open communications with Madras; and here was an army of ten thousand men, with artillery, drawn up on the bank of a river before him to bar his advance. Now, after a century and a half of fighting in India, no British officer would be for a moment at a loss as to the course to be pursued, but Paradis had neither tradition nor experience to guide him. However, whether by inspiration or from despair, he did exactly what he ought. Knowing the river to be fordable, he led his men without hesitation across it and straight upon the enemy, scrambled up the bank, gave them one volley, and charged with the bayonet. The effect of this bold attack was instantaneous. The Nabob\u0027s army was at once transformed into a disorganised mob, which fled headlong into the town of St. Thomé, only to be crowded and jammed in hopeless confusion in the streets. Paradis, following up his success, poured volley after volley into the struggling mass; while, to perfect the victory, a party which had been detached from Madras to join hands with him came up in rear of the fugitives and cut off their retreat. This attack in rear, always dreaded by Oriental nations, completed the rout. Maphuze Khan, who was mounted on an elephant, was one of the first to fly; and his army streamed away to westward, a helpless, terrified rabble, never pausing in its flight until it reached Arcot. With this action it may be said that the dominance of an European nation in India was assured. Hitherto the native armies had been treated with respect. Their numbers had given the impression of overwhelming[184] strength; and it had not occurred to Europeans that they could be encountered except with a force of man for man. Consequently all dealings of Europeans with native princes had been conducted in a spirit of humility and awe. Even Dupleix, while flaunting his dignity among his brother Nabobs, had courted the ruler of the Carnatic with deference and submission. Now the spell was broken, and Dupleix from the courtier had become the master; so momentous was the change wrought by a single Swiss officer, whose very name is hardly known to the nation which now rules India. Of all the fruits of the long friendship which French and Swiss sealed with each other\u0027s blood in the furious struggle of Marignano, none is more remarkable than this. The memory of Paradis should be honoured in England since he taught us the secret of the conquest of India. Nov. Dec. 6 17 . The victory swept away Dupleix\u0027s principal difficulties at a blow. He at once appointed Paradis to the chief command at Madras and bade him issue a manifesto repudiating La Bourdonnais\u0027s treaty as null and void, and declaring Madras to belong to the French by right of conquest. The English protested, but in vain. Morse and the rest of the officials were conducted to Pondicherry. A few only contrived to make their escape to Fort St. David, among them the man who was soon to make Dupleix smart for his ill-faith, the young writer Robert Clive. Fort St. David, situate about twelve miles south of Pondicherry, now became the rallying-point of the English. Since the fall of Madras the authorities there had taken over the general administration of British affairs on the coast of Coromandel; the fort, though small, was the strongest for its size that the British possessed in India; and they were determined to defend it to the last extremity. Dupleix on his side was equally resolved to strike at it without delay, and with this object he instructed Paradis to return to Pondicherry as soon as he should have settled the affairs of Madras. This duty, however, detained Paradis until December; and meanwhile the British[185] officials had invoked the aid of the Nabob Anwarudeen, who, smarting under the defeat of St. Thomé, agreed to send a force under Maphuze Khan and his brother Mohammed Ali to Fort St. David. Maphuze Khan, eager to wipe out his disgrace, attacked Paradis on his march down from Madras; but the French, though they were but three hundred strong and encumbered with the plunder of Madras, beat off his attack with little difficulty, and made their way, with trifling loss, to their destination of Ariancopang, a mile and a half from Pondicherry. Dec. 8 19 . 1747. Feb. The total force now gathered together by Dupleix at Ariancopang for the attack on Fort St. David consisted of about sixteen hundred men, nine hundred of them Europeans, with six field-pieces and as many mortars. Against these the British garrison could muster but two hundred Europeans and half as many natives. Unluckily, however, for the success of Dupleix\u0027s schemes, there were several French officers senior to Paradis, the chief of whom, General de Bury, took the command. On the 19th of December De Bury crossed the river Pennar and encamped in a walled garden about a mile and a half from Fort St. David. Though the Nabob\u0027s army was not five miles distant, neither picquets nor sentries were posted; and the French were dispersed and cooking their dinners when they were suddenly alarmed by the approach of the enemy. Panic-stricken the whole force rushed out of the garden to the river, each man anxious only to place the water between himself and the foe; and had not the artillery stood firm De Bury\u0027s troops would have fared badly indeed. As things fell out they escaped with the loss of a dozen Europeans killed and one hundred and twenty wounded, and made good their retreat to Ariancopang. For three weeks after this reverse the French remained inactive in their camp, but in January 1747 a squadron of French ships arrived on the coast, and Dupleix seized the opportunity offered by this display of force to reopen negotiations with the Nabob Anwarudeen. With[186] his usual dexterity he pointed out that the condition of the British was hopeless; and his arguments were not the less cogent for an accompaniment of gifts to the value of fifteen thousand pounds. The Nabob, already weary of the war, concluded a peace with the French and withdrew his army from Fort St. David. Feb. 19 Mar. 2. Mar. 2 13 . Dupleix seemed now to hold his rivals in his hand; and undoubtedly for the moment the outlook for the British was dark. One or two isolated ships despatched by the Company had arrived on the coast, but had either been captured or frightened away; and it was not until March that one of them succeeded in landing twenty men and sixty thousand pounds in silver at Fort St. David. Ten days later the French began a second attempt against the fort, but were compelled to beat a hasty retreat by the arrival of Admiral Griffin with a British squadron in the roadstead. Griffin landed a company of one hundred soldiers, and lent also marines and sailors from the fleet, as a temporary measure, to strengthen the garrison while he sailed with the fleet to blockade Pondicherry. Fresh reinforcements arrived at Fort St. David both from Europe and from some of the Company\u0027s settlements during May and June; and by July the garrison, including the naval brigade, had risen to twelve hundred Europeans and eight hundred natives. June 11 22 . 1748. The restoration of British supremacy at sea turned the tables against Dupleix, but he contrived none the less to despatch a message to Mauritius for reinforcements. The letter did not reach the island until December, nor was it possible until May 1748 to send off a squadron, which even then was inferior in strength to the blockading fleet under Griffin. By great dexterity, however, the French Admiral contrived to entice Griffin to sea and to slip past him in the night to Madras, where having landed three hundred European soldiers and a large sum of money he put to sea again, leaving Griffin to hunt for him where he would. Dupleix thereupon snatched the opportunity afforded[187] by Griffin\u0027s absence to make an attack on Cuddalore, an English fortified station about two miles south of Fort St. David, which he had already attempted once without success. The force that he had collected for this enterprise was large judged by the minute scale of the armies employed in these early Indian wars, consisting of eight hundred Europeans and one thousand Sepoys. But by this time the British had been strengthened not only by the reinforcements of the previous year but by the arrival in January of a competent commander. This officer, whose fame is far below his deserts, was Major Stringer Lawrence. June 17 28 . Dupleix\u0027s idea was to surprise Cuddalore by night, and with this view he sent his army by a circuitous route to some hills within three miles of the station, with orders to halt and remain concealed until the time should come for the attack. Lawrence, who had full intelligence of the design, ostentatiously removed the garrison and the guns from Cuddalore to Fort St. David during the day; but at nightfall sent them back again, with due precautions to conceal the fact from the French, together with a reinforcement of four hundred Europeans. At midnight the French advanced to the walls without thought of meeting with resistance, but had no sooner planted their scaling-ladders than they were saluted by a withering fire of musketry and grape. The whole body was instantly smitten with panic. Most of them flung down their arms without firing a shot, and one and all took to their heels and fled, not halting until they reached Pondicherry. So ended the first brush between French and English troops in India. June 23 July 4. July 31 Aug. 11. The result was a sad blow to Dupleix, for news had reached them that a powerful armament was on its way from England. In effect the British Government had determined to help the East India Company both with ships and men, and in November 1747 Admiral Boscawen had sailed with eight men-of-war and a convoy of fourteen hundred regular troops. By a novel arrangement, due doubtless to the sad experience of Carthagena, the[188] Admiral held sole command both of army and navy. The first object prescribed to the expedition was the capture of Mauritius and Bourbon, which islands, being within a month\u0027s sail of the coast of Coromandel, were of unspeakable value to the French as a base for their operations in India. The British possessed no such station. St. Helena was too remote, even supposing that a harbour comparable to Port Louis could have been found in it, and the Cape of Good Hope was in the hands of the Dutch. Boscawen arrived before Port Louis on the 4th of July, but found Mauritius strongly defended by forts and batteries at every spot which was suitable for a landing. After three days spent in vain endeavour to discover a weak point, the Admiral decided to push on without further loss of time to the ulterior goal appointed him by his instructions, Pondicherry. He set sail, therefore, for Fort St. David, and early in August effected his junction with Griffin. The combined squadrons formed the most powerful armament yet seen in East Indian waters. Aug. 8 19 . A fleet of thirty ships set Boscawen at ease as to his communications by sea; and as every preparation had been made at Fort St. David against his arrival, he was able within a week to march to the siege of Pondicherry. The King\u0027s regular troops consisted of twelve independent companies each one hundred strong, eight hundred marines, and eighty of the Royal Artillery, which, added to the Company\u0027s soldiers and a naval brigade, brought up the total to a strength of thirty-seven hundred Europeans. Two thousand Sepoys also accompanied the expedition, though as yet neither trained nor disciplined. But meanwhile Dupleix had not been idle. Desperate though his situation might appear, he had resolved to make the best of it, and had not only strengthened the defences of Pondicherry itself, but had added a strong fort at Ariancopang, which was constructed under the care of the indefatigable Paradis. This latter work was the first obstacle that presented itself to Boscawen\u0027s advance. No one in his camp knew[189] anything about it, because no one had been at any pains to find out. A deserter reported that it was held by a hundred natives only, and Boscawen without further ado resolved to carry it by storm. Seven hundred men were therefore launched against it, only to find that the defences were decidedly formidable and the garrison four times as strong as had been supposed. Moreover, owing to a neglect which, after the failure before St. Lazaro, seems perfectly unpardonable, no scaling-ladders had been prepared for the storming party. The troops, therefore, as at St. Lazaro, tried stubbornly to do impossibilities until nearly a fourth of their number had been killed or wounded, and then fell back not less mortified than dispirited by their repulse. Aug. 26 Sept. 6. It was then resolved to besiege Ariancopang in form; but here as at Carthagena the engineers proved to be utterly ignorant of their business, and blunder succeeded blunder. Paradis, who had a troop of sixty horse in addition to the infantry of his garrison, judged astutely of the moral effect which cavalry might produce on seafaring men, and sent his handful of troopers, with infantry in support, straight at the trenches of the naval brigade. The sailors were seized with panic; the panic spread to the regular troops, and the whole rushed headlong back to the camp, leaving their best officer, Stringer Lawrence, to be taken prisoner. Accident, however, came to the help of the British. A magazine at Ariancopang caught fire and exploded, disabling over one hundred men; and the garrison having dismantled the fortifications withdrew into Pondicherry. Boscawen accordingly moved forward from Ariancopang and opened his trenches against the north-western corner of the town. Then once more the ignorance of the engineers led to blunders and waste of time, for they opened their first parallel at a distance of fifteen hundred yards, or twice the distance prescribed by rule and common sense, from the covered way. Still fortune for the present favoured the British. A sortie made by the French was brilliantly repulsed, and Paradis, the[190] ablest of the French both as officer and engineer, was wounded to the death. The Englishman most distinguished in this affair was to prove himself Paradis\u0027s most brilliant pupil, an ensign in the Company\u0027s service, taken only twelve months before as a clerk from the Company\u0027s desks, Robert Clive. Sept. 26 Oct. 7. Sept. 30 Oct. 11. The success of the British now appeared so certain that the Nabob Anwarudeen, yielding to the repeated gifts and appeals of Boscawen, decided to throw in his lot with them and promised to furnish a body of two thousand horse. Still Dupleix was not discouraged. By the death of Paradis the chief burden of military as well as of civil command was thrown upon his shoulders, but he did not shrink from it. After all, if he were no soldier, neither was Boscawen. By immense labour the British trenches were carried forward to the position from which they should have been opened, eight hundred yards from the wall, and early in October two batteries at last opened on the town. They were answered by twice as formidable a fire from the guns of the besieged. Boscawen then ordered the fleet to open fire from the sea, but the ships being prevented by shoal water from approaching nearer than a thousand yards from the works, the cannonade was wholly ineffective. The fire of the British batteries ashore continued for three days with little result, while that of the besieged increased rather than languished. The rainy season then set in earlier than usual; the trenches were flooded, and disease began to rage in the British camp. Finally, on the 11th of October, Boscawen decided to raise the siege and the British retreated, leaving over one thousand Europeans dead behind them, while Dupleix remained proud and unconquered in Pondicherry. The failure of this enterprise was due to the same causes that had wrecked the expedition to Carthagena. In the first place, Boscawen arrived on the coast too late. In the second, he wasted nearly three weeks over the capture of Ariancopang, which was not[191] essential to the capture of Pondicherry. In the third, the unskilfulness of the engineers prolonged the operations, and occupied the troops with duties which kept them from active service in the trenches and harassed them to death for no purpose. The experiment of setting a naval officer in charge of highly technical military operations was probably due to the influence of Vernon; to which also may be traced Boscawen\u0027s readiness to attempt the storm of Ariancopang after Vernon\u0027s rough-and-ready manner. Against Spaniards in South America such methods might have succeeded; against Frenchmen they could not, least of all when commanded by a Dupleix with a Paradis for his military adviser. If the failure before Pondicherry had ended with the raising of the siege, the reverse would have been comparatively a trifling matter; but it told far and wide over India as a blow to British influence and prestige, and Dupleix was not the man to neglect to magnify the success and the greatness of his nation. The news of the peace of Aix-la-Chapelle some months later brought about a cessation of overt hostilities and the re-delivery of Madras to Boscawen; but still the war did not end. As in Europe French and English could fight fiercely as auxiliaries of an Elector of Bavaria and a Queen of Hungary, so in Asia they could carry on, as allies of native princes, the contest which was to determine the fate of India.","sourceLink":"http://novel.tingroom.com/jingdian/1993/57074.html","bookId":669,"book":{"id":669,"title":"A History of the British Army","description":"简介： The civilian who attempts to write a military history is of necessity guilty of an act of presumption; and I am not blind to my own temerity in venturing to grapple with such a task as the History of the British Army....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1993","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
