{"id":96577,"no":118,"title":"Page 118","content":"\"Oh right,\" I say. \"Of course... We had wanted Paul Owen to come,\" I say, nodding my head as if just realizing something. \"But he said he had plans...\" Then, lamely, \"I guess I had dinner with Victoria the... following night.\" \"Listen, like I said, I was just hired by Meredith.\" He sighs, closing his book. Tentatively, I ask, \"Did you know that Meredith Powell is dating Brock Thompson?\" He shrugs, sighs. \"I don\u0027t know about that. All I know is that Paul Owen owes her supposedly a lot of money.\" \"Oh?\" I say, nodding. \"Really?\" \"Personally,\" he says, confiding, \"I think the guy went a little nutso. Split town for a while. Maybe he did go to London. Sightseeing. Drinking. Whatever. Anyway, I\u0027m pretty sure he\u0027ll turn up sooner or later.\" I nod slowly, hoping to look suitably bewildered. \"Was he involved at all, do you think, in, say, occultism or Satan worship?\" Kimball asks seriously. \"Er, what?\" \"I know it sounds like a lame question but an New Jersey last month - I don\u0027t, know if you\u0027ve heard about this, but a young stockbroker was recently arrested and charged with murdering a young Chicano girl and performing voodoo rituals with, well, various body parts - \" \"Yikes!\" I exclaim. \"And I mean...\" He smiles sheepishly again. \"Have you heard anything about this?\" \"Did the guy deny doing it?\" I ask, tingling. \"Right.\" Kimball nods. \"That was an interesting case,\" I manage to say. \"Even though the guy says he\u0027s innocent he still thinks he\u0027s Inca, the bird god, or something,\" Kimball says, scrunching his features up. We both laugh out loud about this. \"No,\" I finally say. \"Paul wasn\u0027t into that. He followed a balanced diet and - \" \"Yeah, I know, and was into that whole Yale thing,\" Kimball finishes tiredly. There is a long pause that, I think, might be the longest one so far. \"Have you consulted a psychic?\" I ask. \"No.\" He shakes his head in a way that suggests he\u0027s considered it. Oh who cares? \"Had his apartment been burglarized?\" I ask. \"No, it actually hadn\u0027t,\" he says. \"Toiletries were missing. A suit was gone. So was some luggage. That\u0027s it.\" \"Do you suspect foul play?\" \"Can\u0027t say,\" he says. \"But like I told you, I wouldn\u0027t be surprised if he\u0027s just hiding out someplace.\" \"I mean no one\u0027s dealing with the homicide squad yet or anything, right?\" I ask. \"No, not yet. As I said, we\u0027re not sure. But...\" He stops, looks dejected. \"Basically no one has seen or heard anything.\" \"That\u0027s so typical, isn\u0027t it?\" I ask. \"It\u0027s just strange,\" he agrees, staring out the window, lost. \"One day someone\u0027s walking around, going to work, alive, and then...\" Kimball stops, fails to complete the sentence. \"Nothing,\" I sigh, nodding. \"People just... disappear,\" he says. \"The earth just opens up and swallows people,\" I say, somewhat sadly, checking my Rolex. \"Eerie.\" Kimball yawns, stretching. \"Really eerie.\" \"Ominous.\" I nod my agreement. \"It\u0027s just\" - he sighs, exasperated - \"futile.\" I pause, unsure of what to say, and come up with \"Futility is... hard to deal with.\" I am thinking about nothing. It\u0027s silent in the office. To break it, I point out a book on top of the desk, next to the San Pellegrino bottle. The Art of the Deal, by Donald Trump. \"Have you read it?\" I ask Kimball. \"No,\" he sighs, but politely asks, \"Is it any good?\" \"It\u0027s very good,\" I say, nodding. \"Listen.\" He sighs again. \"I\u0027ve taken up enough of your time.\" He pockets the Marlboros. \"I have a lunch meeting with Cliff Huxtable at The Four Seasons in twenty minutes anyway,\" I lie, standing up. \"I have to go too.\" \"Isn\u0027t The Four Seasons a little far uptown?\" He looks concerned, also getting up. \"I mean aren\u0027t you going to be late?\" \"Uh, no,\" I stall. \"There\u0027s one... down here.\" \"Oh really?\" he asks. \"I didn\u0027t know that.\" \"Yes,\" I say, leading him to the door. \"It\u0027s very good.\" \"Listen,\" he says, turning to face me. \"If anything occurs to you, any information at all...\"","sourceLink":"https://allnovel.net/american-psycho/page-118.html","bookId":2593,"book":{"id":2593,"title":"American Psycho","description":"Storyline: Patrick Bateman is handsome, well educated, intelligent. He works by day on Wall Street earning a fortune to complement the one he was born with. His nights he spends in ways we cannot begin to fathom. He is twenty-six years old and living his own American Dream.","cover":"https://allnovel.net/images/american-psycho.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/american-psycho.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:18:09 PM"}}
