{"id":96495,"no":36,"title":"Page 36","content":"Having no idea what her name is I sigh a muted \"Hello\" then very quickly mumble something that resembles a woman\u0027s name and then I just stare at her, stumped, drained, trying to control my viciousness, the Chinese woman still screeching behind me. Finally I clap my hands together and say, \"Well.\"\\n\\n She stands there, confused, until nervously moving toward the counter, ticket in hand. \"Isn\u0027t it ridiculous? Coming all the way up here, but you know they really are the best.\"\\n\\n \u0027Then why can\u0027t they get these stains out?\" I ask patiently, still smiling, both eyes closed until the Chinese woman has finally shut up and then I open them. \"I mean can you talk to these people or some thing?\" I delicately propose. \"I\u0027m not getting any where.\"\\n\\n She moves toward the sheet the old man holds up. \"Oh my, I see,\" she murmurs. The moment she tentatively touches the sheet the old lady starts jabbering away, and ignoring her, the girl asks me, \"What are those?\" She looks at the stains again and says, \"Oh my.\"\\n\\n \"Um, well...\" I look over at the sheets, which are really quite a mess. \"It\u0027s, um, cranberry juice, cranapple juice.\"\\n\\n She looks at me and nods, as if unsure, then timidly ventures, \"It doesn\u0027t look like cranberry, I mean cranapple, to me.\"\\n\\n I stare at the sheets for a long time before stammering, \"Well, I mean, um, it\u0027s really... Bosco. You know, like...\" I pause. \"Like a Dove Bar. It\u0027s a Dove Bar... Hershey\u0027s Syrup?\"\\n\\n \"Oh yeah.\" She nods, understanding, maybe a hint of skepticism. \"Oh my.\"\\n\\n \"Listen, if you could talk to them\" - I reach over, yanking the sheet out of the old man\u0027s hand - \"I would really appreciate it.\" I fold the sheet and lay it gently on the counter, then, checking my Rolex again, explain, \"I\u0027m really late. I have a lunch appointment at Hubert\u0027s in fifteen minutes.\" I move toward the door of the dry cleaners and the Chinese woman starts yapping again, desperately, shaking a finger at me. I glare at her, forcing myself not to mimic the hand gestures.\\n\\n \"Hubert\u0027s? Oh really?\" the girl asks, impressed. \"It moved uptown, right?\"\\n\\n \"Yeah, well, oh boy, listen, I\u0027ve got to go.\" I pretend to spot an oncoming cab across the street through the glass door and, faking gratitude, tell her, \"Thank you, uh... Samantha.\"\\n\\n \"It\u0027s Victoria.\"\\n\\n \"Oh right, Victoria.\" I pause. \"Didn\u0027t I say that?\"\\n\\n \"No. You said Samantha.\"\\n\\n \"\u0027Well, I\u0027m sorry.\" I smile. \"I\u0027m having problems.\"\\n\\n \"Maybe we could have lunch one day next week?\" she suggests hopefully, moving toward me while I\u0027m backing out of the store. \"You know, I\u0027m downtown near Wall Street quite often.\"\\n\\n \"Oh, I don\u0027t know, Victoria.\" I force an apologetic grin, avert my gaze from her thighs. \"I\u0027m at work all the time.\"\\n\\n \"Well, what about, oh, you know, maybe a Saturday?\" Victoria asks, afraid she\u0027ll offend.\\n\\n \"Next Saturday?\" I ask, checking my Rolex again.\\n\\n \"Yeah.\" She shrugs timidly.\\n\\n \"Oh. Can\u0027t, I\u0027m afraid. Matinee of Les Miserables,\" I lie. \"Listen. I\u0027ve really got to go. I\u0027ll...\" I run a hand over my hair and mutter \"Oh Christ\" before forcing myself to add, \"I\u0027ll call you.\"\\n\\n \"Okay.\" She smiles, relieved. \"Do.\"\\n\\n I glare at the Chinese woman once more and rush the hell out of there, dashing after a nonexistent cab, and then I slow down a block or two up past the cleaners and-\\n\\n . suddenly I find myself eyeing a very pretty homeless girl sitting on the steps of a brownstone on Amsterdam, a Styrofoam coffee cup resting on the step below her feet, and as if guided by radar I move toward her, smiling, fishing around in my pocket for change. Her face seems too young and fresh and tan for a homeless person\u0027s; it makes her plight all the more heartbreaking. I examine her carefully in the seconds it takes to move from the edge of the sidewalk to the steps leading up to the brownstone where she sits, her head bowed down, staring dumbly into her empty lap. She looks up, unsmiling, after she notices me standing over her. My nastiness vanishes and, wanting to offer something kind, something simple, I lean in, still staring, eyes radiating sympathy into her blank, grave face, and dropping a dollar into the Styrofoam cup I say, \"Good luck.\"\\n\\n Her expression changes and because of this I notice the book - Sartre - in her lap and then the Columbia book bag by her side and finally the tan-colored coffee in the cup and my dollar bill floating in it and though this all happens in a matter of seconds it\u0027s played out in slow motion and she looks at me, then at the cup, and shouts, \"Hey, what\u0027s your goddamn problem?\" and frozen, hunched over the cup, cringing, I stutter, \"I didn\u0027t... I didn\u0027t know it was... full,\" and shaken, I walk away, hailing a taxi, and heading toward Hubert\u0027s in it I hallucinate the buildings into mountains, into volcanoes, the streets become jungles, the sky freezes into a backdrop, and before stepping out of the cab I have to cross my eyes in order to clear my vision. Lunch at Hubert\u0027s becomes a permanent hallucination in which I find myself dreaming while still awake. \\n\\n","sourceLink":"https://allnovel.net/american-psycho/page-36.html","bookId":2593,"book":{"id":2593,"title":"American Psycho","description":"Storyline: Patrick Bateman is handsome, well educated, intelligent. He works by day on Wall Street earning a fortune to complement the one he was born with. His nights he spends in ways we cannot begin to fathom. He is twenty-six years old and living his own American Dream.\\n","cover":"https://allnovel.net/images/american-psycho.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/american-psycho.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:18:09 PM"}}
