{"id":96520,"no":61,"title":"Page 61","content":"\"Visitors to the Caribbean don\u0027t need a passport - just proof of U.S. citizenship - and even better, Taylor, is that language is no barrier. English is spoken everywhere, even on those islands where the local language is French or Spanish. Most of the islands are former British...\"\n \"My life is a living hell,\" I mention off the cuff, while casually moving leeks around on my plate, which by the way is a porcelain triangle. \"And there are many more people I, uh, want to... want to, well, I guess murder.\" I say this emphasizing the last word, staring straight into Armstrong\u0027s face.\n \"Service has improved to the islands as both American Airlines and Eastern Airlines have created hubs in San Juan where they have set up connecting flights to those islands they don\u0027t serve with direct flights. With additional service from BWIA, Pan Am, ALM, Air Jamaica, Bahamas Air and Cayman Airways, most islands are easy to reach. There are additional connections within the islands from LIAT and BWIA, which provide a series of scheduled island-hopping flights...\"\n Someone who I think is Charles Fletcher walks over while Armstrong keeps talking and he pats me on the shoulder and says \"Hey Simpson\" and \"See you at Fluties\" and then at the door meets up with a very attractive woman - big tits, blond, tight dress, not his secretary, not his wife - and they leave Duplex together in a black limousine. Armstrong is still eating, cutting into the perfectly square slices of calf\u0027s liver, and he keeps talking while I become increasingly mournful.\n \"Vacationers who can\u0027t take a full week away will find the Caribbean an ideal spot for the alternative weekend escape. Eastern Airlines has created its Weekender Club which includes many Caribbean destinations and enables members to visit many places at sharply reduced prices which I know doesn\u0027t matter but I still think people are going\n Concert\n Everyone is very uptight at the concert Carruthers drags us to in New Jersey this evening, an Irish band called U2 who were on the cover of Time magazine last week. The tickets were originally for a group of Japanese clients who canceled their trip to New York at the last minute, making it virtually impossible for Carruthers (or so he says) to sell these front-row seats. So it\u0027s Carruthers and Courtney, Paul Owen and Ashley Cromwell, and Evelyn and myself. Earlier, when I found out that Paul Owen was coming, I tried to call Cecilia Wagner, Marcus Halberstam\u0027s girlfriend, since Paul Owen seems fairly sure that I\u0027m Marcus, and though she was flattered by my invitation (I always suspected I was one of her crushes) she had to attend a black-tie party for the opening of the new British musical Maggie! But she did mention something about lunch next week and I told her I would give her a call on Thursday. I was supposed to have dinner with Evelyn tonight, but the thought of sitting alone with her during a two-hour meal fills me with a nameless dread and so I call and reluctantly explain the schedule changes and she asks if Tim Price is coming and when I tell her no, there is the briefest hesitation before she accepts and then I cancel the reservation Jean made for us at H2 0, the new Clive Powell restaurant in Chelsea, and leave the office early for a quick aerobics class before the concert.\n None of the girls are particularly excited about seeing the band and all have confided in me, separately, that they don\u0027t want to be here, and in the limousine heading toward somewhere called the Meadowlands, Carruthers keeps trying to placate everyone by telling us that Donald Trump is a big U2 fan and then, even more desperately, that John Gutfreund also buys their records. A bottle of Cristal is opened, then another. The TV is tuned to a press conference Reagan\u0027s giving but there\u0027s a lot of static and no one pays attention, except for me. The Patty Winters Show this morning was about Shark Attack Victims. Paul Owen has called me Marcus four times and Evelyn, much to my relief, Cecilia twice, but Evelyn doesn\u0027t notice since she\u0027s been glaring at Courtney the entire time we\u0027ve been in the limousine. Anyway, no one has corrected Owen and it\u0027s unlikely that anyone will. I even called her Cecilia a couple of times myself when I was sure she wasn\u0027t listening, while she was staring hatefully at Courtney. Carruthers keeps telling me how nice I look and complimenting my suit.\n Evelyn and I are by far the best-dressed couple. I\u0027m wearing a lamb\u0027s wool topcoat, a wool jacket with wool flannel trousers, a cotton shirt, a cashmere V-neck sweater and a silk tie, all from Armani. Evelyn\u0027s wearing a cotton blouse by Dolce do Gabbana, suede shoes by Yves Saint Laurent, a stenciled calf skirt by Adrienne Landau with a suede belt by Jill Stuart, Calvin Klein tights, Venetian-glass earrings by Frances Patiky Stein, and clasped in her hand is a single white rose that I bought at a Korean deli before Carruthers\u0027 limousine picked me up. Carruthers is wearing a lamb\u0027s wool sport coat, a cashmere/vicuna cardigan sweater, cavalry twill trousers, a cotton shirt and a silk tie, all from Hermes. (\"How tacky,\" Evelyn whispered to me; I silently agreed.) Courtney is wearing a triple-layered silk organdy top and a long velvet skirt with a fishtail hem, velvet-ribbon and enamel earrings by Jose and Maria Barrera, gloves by Portolano and shoes from Gucci. Paul and Ashley are, I think, a bit over dressed, and she has sunglasses on even though the windows in the limo are tinted and it\u0027s already dusk. She holds a small bouquet of flowers, daisies, Carruthers gave her, which failed to make Courtney jealous since she seems intent upon clawing Evelyn\u0027s face open, which right now, though it\u0027s the better-looking face, seems not a bad idea and one I wouldn\u0027t mind watching Courtney carry out. Courtney has a slightly better body, Evelyn nicer tits.\n","sourceLink":"https://allnovel.net/american-psycho/page-61.html","bookId":2593,"book":{"id":2593,"title":"American Psycho","description":"Storyline: \n Patrick Bateman is handsome, well educated, intelligent. He works by day on Wall Street earning a fortune to complement the one he was born with. His nights he spends in ways we cannot begin to fathom. He is twenty-six years old and living his own American Dream.\n \n","cover":"https://allnovel.net/images/american-psycho.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/american-psycho.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:18:09 PM"}}
