{"id":96526,"no":67,"title":"Page 67","content":"\"But there\u0027s a limit,\" Van Patten is saying. \"The point is, I mean, I don\u0027t want to spend the evening with the Cookie Monster.\"\\n\\n \"But you\u0027re still dating Meredith so, uh, what\u0027s the difference?\" I ask. Naturally he doesn\u0027t hear.\\n\\n \"But ditsy is cute,\" McDermott says. \"Ditsy is very cute.\"\\n\\n \"Bateman?\" Van Patten asks. \"Any style opinions on ditsiness?\"\\n\\n \"What?\" I ask, getting up.\\n\\n \"Ditsy? No?\" McDermott this time. \"Ditsy\u0027s desirable, comprende?\"\\n\\n \"Listen,\" I say, pushing my chair in. \"I just want everyone to know that I\u0027m pro-family and anti-drug. Excuse me.\"\\n\\n As I walk away Van Patten grabs a passing waiter and says, his voice fading, \"Is this tap water? I don\u0027t drink tap water. Bring me an Evian or something, okay?\"\\n\\n Would Courtney like me less if Luis was dead? This is the question I have to face, with no clear answer burning back across my mind, as I make my way slowly through the dining room, waving to someone who looks like Vincent Morrison, someone else who I\u0027m fairly sure is someone who looks like Tom Newman. Would Courtney spend more time with me - the time she now spends with Luis - if he was out of the picture, no longer an alternative, if he was perhaps... dead? If Luis were killed would Courtney be upset? Could I genuinely be of comfort without laughing in her face, my own spite doubling back on me, giving everything away? Is the fact that she dates me behind his back what excites her, my body or the size of my dick? Why, for that matter, do I want to please Courtney? If she likes me only for my muscles, the heft of my cock, then she\u0027s a shallow bitch. But a physically superior, near-perfect-looking shallow bitch, and that can override anything, except maybe bad breath or yellow teeth, either of which is a real dealbreaker. Would I ruin things by strangling Luis? If I married Evelyn would she make me buy her Lacroix gowns until we finalized our divorce? Have the South African colonial forces and the Soviet-backed black guerrillas found peace yet in Namibia? Or would the world be a safer, kinder place if Luis was hacked to bits? My world might, so why not? There really is no... other hand. It\u0027s really even too late to be asking these questions since now I\u0027m in the men\u0027s room, staring at myself in the mirror - tan and haircut perfect - checking out my teeth which are completely straight and white and gleaming. Winking at my reflection I breathe in, sliding on a pair of leather Armam gloves, and then make my way toward the stall Luis occupies. The men\u0027s room is deserted. All the stalls are empty except for the one at the end, the door not locked, left slightly ajar, the sound of Luis whistling something from Les Miserables getting almost oppressively louder as I approach.\\n\\n He\u0027s standing in the stall, his back to me, wearing a cashmere blazer, pleated wool trousers, a cotton-silk white shirt, pissing into the toilet. I can tell he senses movement in the stall because he stiffens noticeably and the sound of his urine hitting water stops abruptly in midstream. In slow motion, my own heavy breathing blocking out all other sounds, my vision blurring slightly around the edges, my hands move up over the collar of his cashmere blazer and cotton-flannel shirt, circling his neck until my thumbs meet at the nape and my index fingers touch each other just above Luis\u0027s Adam\u0027s apple. I start to squeeze, tightening my grip, but it\u0027s loose enough to let Luis turn around - still in slow motion - so he can stand facing me, one hand over his wool and silk Polo sweater, the other hand reaching up. His eyelids flutter for an instant, then widen, which is exactly what I want. I want to see Luis\u0027s face contort and turn purple and I want him to know who it is who is killing him. I want to be the last face, the last thing, that Luis sees before he dies and I want to cry out, \"I\u0027m f**king Courtney. Do you hear me? I\u0027m f**king Courtney. Ha-ha-ha,\" and have these be the last words, the last sounds he hears until his own gurglings, accompanied by the crunching of his trachea, drown everything else out. Luis stares at me and I tense the muscles in my arms, preparing myself for a struggle that, disappointingly, never comes.\\n\\n Instead he looks down at my wrists and for a moment wavers, as if he\u0027s undecided about something, and then he lowers \u0027his head and... kisses my left wrist, and when he looks back up at me, shyly, it\u0027s with an expression that\u0027s... loving and only part awkward. His right hand reaches up and tenderly touches the side of my face. I stand there, frozen, my arms still stretched out in front of me, fingers still circled around Luis\u0027s throat.\\n\\n \"God, Patrick,.. he whispers. \"Why here? \"\\n\\n His hand is playing with my hair now. I look over at the side of the stall, where someone has scratched into the paint Edwin gives marvelous head, and I\u0027m still paralyzed in this position and gazing at the words, confused, studying the frame surrounding the words as if that contained an answer, a truth. Edwin? Edwin who? I shake my head to clear it and look back at Luis, who has this horrible, love-struck grin plastered on his face, and I try to squeeze harder, my face twisted with exertion, but I can\u0027t do it, my hands won\u0027t tighten, and my arms, still stretched out, look ludicrous and useless in their fixed position. \\n\\n","sourceLink":"https://allnovel.net/american-psycho/page-67.html","bookId":2593,"book":{"id":2593,"title":"American Psycho","description":"Storyline: Patrick Bateman is handsome, well educated, intelligent. He works by day on Wall Street earning a fortune to complement the one he was born with. His nights he spends in ways we cannot begin to fathom. He is twenty-six years old and living his own American Dream.\\n","cover":"https://allnovel.net/images/american-psycho.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/american-psycho.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:18:09 PM"}}
