{"id":96530,"no":71,"title":"Page 71","content":"Girls\n Tonight an infuriating dinner at Raw Space with a vaguely ditzed-out Courtney who keeps asking me questions about spa menus and George Bush and Tofutti that belong only in someone\u0027s nightmare. I utterly ignore her, to no avail, and while she\u0027s in midsentence - Page Six, Jackie O - I resort to waving our waiter over and ordering the cold corn chowder lemon bisque with peanuts and dill, an arugula Caesar salad and swordfish meat loaf with kiwi mustard, even though I already ordered this and he tells me so. I look up at him, not even trying to feign surprise, and smile grimly. \"Yes, I did, didn\u0027t I?\" The Floridian cuisine looks impressive but the portions are small and costly, especially in a place with a dish of crayons on each table. (Courtney draws a Laura Ashley print on her paper place mat and I draw the insides of Monica Lustgarden\u0027s stomach and chest on mine and when Courtney, charmed by what I\u0027m drawing, inquires as to what it is, I tell her, \"Uh, a... watermelon\"). The bill, which I pay for with my platinum American Express card, comes to over three hundred dollars. Courtney looks okay in a Donna Karan wool jacket, silk blouse and cashmere wool skirt. I\u0027m wearing a tuxedo for no apparent reason. The Patty Winters Show this morning was about a new sport called Dwarf Tossing.\n In the limousine, dropping her off at Nell\u0027s, where we\u0027re supposed to have drinks with Meredith Taylor, Louise Samuelson and Pierce Towers, I tell Courtney that I need to score some drugs and I promise that I\u0027ll be back before midnight. \"Oh, and tell Nell I say hi,\" I add casually.\n \"Just buy some downstairs if you have to, for god\u0027s sake,\" she whines.\n \"But I promised someone I\u0027d stop by their place. Paranoia Understand?\" I whine back.\n \"Who\u0027s paranoid?\" she asks, eyes squinting. \"I don\u0027t get it.\"\n \"Honey, the drugs downstairs are usually a notch below NutraSweet in terms of potency,\" I tell her. \"You know.\"\n \"Don\u0027t implicate me, Patrick,\" she warns.\n \"Just go inside and order me a Foster\u0027s, okay?\"\n \"Where are you really going?\" she asks after a beat, now suspicious.\n \"I\u0027m going to... Noj\u0027s,\" I say. \"I\u0027m buying coke from Noj.\"\n \"But Noj is the chef at Deck Chairs,\" she says, as I\u0027m pushing her out of the limousine. \"Noj isn\u0027t a drug dealer. He\u0027s a chef!\"\n \"Don\u0027t have a hissy fit, Courtney,\" I sigh, my hands on her back.\n \"But don\u0027t lie to me about Noj,\" she whines, struggling to stay in the car. \"Noj is the chef at Deck Chairs. Did you hear me?\"\n I stare at her, dumbfounded, caught in the harsh lights hung above the ropes outside Nell\u0027s.\n \"I mean Fiddler,\" I finally admit, meekly. \"I\u0027m going to Fiddler\u0027s to score.\"\n \"You\u0027re impossible,\" she mutters, walking away from the limo. \"There is something seriously wrong with you.\"\n \"I\u0027ll be back,\" I call out after her, slamming the limo\u0027s door shut, then I cackle gleefully to myself while relighting a cigar, \"Don\u0027t you bet on it.\"\n I tell the chauffeur to head over to the meat-packing district just west of Nell\u0027s, near the bistro Florent, to look for prostitutes and after heavily scanning the area twice - actually, I\u0027ve spent months prowling this section of town for the appropriate babe - I find her on the corner of Washington and Thirteenth. She\u0027s blond and slim and young, trashy but not an escort bimbo, and most important, she\u0027s white, which is a rarity in these parts. She\u0027s wearing tight cutoff shorts, a white T-shirt and a cheap leather jacket, and except for a bruise over her left knee her skin is pale all over, including the face, though her thickly lipsticked mouth is done up in pink. Behind her, in four-foot-tall red block letters painted on the side of an abandoned brick warehouse, is the word M E A T and the way the letters are spaced awakens something in me and above the building like a backdrop is a moonless sky, which earlier, in the afternoon, was hung with clouds but tonight isn\u0027t.\n The limousine cruises up alongside the girl. Through its tinted windows, closer up, she\u0027s paler, the blond hair now seems bleached and her facial features indicate someone even younger than I first imagined, and because she\u0027s the only white girl I\u0027ve seen tonight in this section of town, she seems - whether she is or not - especially clean; you could easily mistake her for one of the NYU girls walking home from Mars, a girl who has been drinking Seabreezes all night while moving across a dance floor to the new Madonna songs, a girl who perhaps afterwards had a fight with her boyfriend, someone named Angus or Nick or... Pokey, a girl on her way to Florent to gossip with friends, to order another Seabreeze perhaps or maybe a cappuccino or a glass of Evian water - and unlike most of the whores around here, she barely registers the limousine as it pulls up next to her and stops, idling. Instead she lingers casually, pretending to be unaware of what the limousine actually signifies. \n","sourceLink":"https://allnovel.net/american-psycho/page-71.html","bookId":2593,"book":{"id":2593,"title":"American Psycho","description":"Storyline: \n Patrick Bateman is handsome, well educated, intelligent. He works by day on Wall Street earning a fortune to complement the one he was born with. His nights he spends in ways we cannot begin to fathom. He is twenty-six years old and living his own American Dream.\n \n","cover":"https://allnovel.net/images/american-psycho.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/american-psycho.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:18:09 PM"}}
