{"id":71972,"no":13,"title":"Page 13","content":"But then he’s pulling away, breathing profusely, with his jaw clenched shut. When he looks at me, his eyes are cold. “You need to go… I’m sorry, Callie.” He looks like he might cry. “I can’t be with you.” I try to tell myself that it’s because he’s hurting but suddenly I’m back in high school, back to being no one, back to being the invisible girl filled with shame. “Freak,” Daisy said as I walk down the hall with my head hung low. “Nobody wants you around.” I hurried down the hall, clutching my books as I ran outside. I kept running and running until I was safely underneath the bleachers near the football field where no one could see me. I shoved my finger down my throat and forced my lunch out of my stomach. Then I sat down in the dirt and through the cracks in the seats watched the football team practice, wishing I could stay there forever. My breath falters as I climb out of the car, into the snow and the wintry air. As soon as I slam the door, the tires spin in the slush as he peels away without looking back. Even though I feel like chasing after him, I turn around and walk back inside with my head hung low. Kayden I’m officially the world’s biggest asshole as I pull out of that parking lot. I’ve snubbed the world’s saddest girl not once but twice, and on top of that, I kissed her. I’m a fucking prick. I can see her watching the car as I peel out onto the road, her head hung low, and she probably feels like shit. But it’s for her own good; that’s what I have to keep telling myself. One day she’ll look back at all of this and be glad she didn’t have to deal with it her entire life. My burdens and problems should be mine and mine alone. Still… kissing her again has made it a huge problem. I’m driving away from the café, the slush on the roads whipping up against the windshield as I fly down the main road in my mom’s car. My heart is acting stupid, flying about as fast as the car is and my lips are burning from the feel of hers. The inside of the car smells like her too and I can’t stop thinking about how good she smells when I’m close to her and how it feels to touch her. I should have never left the house. My mom was wasted, though, and wanted something to eat. I didn’t want her driving drunk so I offered to go. But being out in public wasn’t a good idea. Too many people I know, and too much judgment. And then Callie… being there… seeing her… Tears threatened to come out of my eyes as I leave her behind at the café and the pain and sadness is making me want to pull over. I can’t let the feelings surface, not when I have no way to turn them off. I’ll have to deal with them and I can’t. But my eyes keep pooling with water and it’s become harder than hell to see. Everything looks white and sloshy and I can’t focus on the road. I need to stop the tight knot in my chest from tightening anymore. Holding onto the steering wheel, I reach across the console for the glove compartment, hoping my mom will have a screwdriver or something sharp inside there. I just need a quick fix to temporarily turn it off. I keep glancing up at the road as I dig through the glove box. There’s a stack of papers, a tube of lipstick, and a packet of air fresheners. “Fuck!” There’s nothing sharp. I slam the console and sit up just in time to see a small blue car stopped in the middle of the road with the exhaust huffing a cloud of dark smoke into the air. I slam my foot down on the pedal and my car screeches to a halt. Snow and slush flip up into the air as the back end of the car loses control and glides to the side. It stops sideways about a foot before ramming the other car. I slam my hands against the wheel as the car inches forward and angles to the side. I’m losing control over everything—over how I feel, and it’s going to end up killing me. The thing is I’m not sure if I’m terrified about that or relieved. Chapter 7 #2 Don’t overthink so many things Kayden It’s been a little over a week and a half since I got released and I’m fucking pissed. And shocked. And a whole lot of other stuff I can’t sort through. The last time I saw Callie was when I left her at the café. She’s tried to call and text me a few times since I ran away from her, but I never respond. Being stuck in the house is tough, though, and kind of depressing, especially since Christmas day was yesterday and it went unnoticed. But it’s always kind of been like that I guess. My mother has cleaned out the knives and razors and every sharp object in the house. Whether it’s for my dad’s benefit or my own, I’m not sure. My oldest brother, Tyler, is still hanging out. I guess he lost his job and house, so now he’s crashing in the downstairs room we used to hide out in when we were kids. He’s also drinking about as much as my mother. My father hasn’t been home since I came back. My mother says he’s on a business trip but I secretly wonder if he’s hiding until they can be sure I’m not going to talk about what happened that night. “Good news,” my mom says when I enter the kitchen. It’s early in the morning, but she’s dressed up, her hair’s done, and she’s already got her makeup on. She’s sitting at the table sipping coffee with a magazine in front of her and a half-empty wine bottle. I head for the cupboard. “Oh yeah.” She picks up the coffee mug. “Yes, if you consider not going to jail good news.” She takes a sip of the coffee and then puts the cup back down on the table. “I think Caleb and your father have come to an agreement. We’ll give him ten thousand dollars and in exchange he won’t press charges.” “Is that even legal?” “Does it matter if it is?” I open the cupboard and take out a box of Pop-Tarts. “Kind of… And besides, how do you know he won’t just take the money and still press charges. He’s not a good, honest guy.” “No, he’s the guy you beat up.” She picks up the creamer and pours some into her coffee. “Now quit arguing. This is how your father’s handling it. And be grateful that he’s handling it.” I unintentionally snort a laugh. “Be grateful.” I gesture at my side, which is starting to scar over. “For what? For this?” She raises the cup to her mouth and scowls at me over the brim. “What? The injuries you put there yourself?” I slam the cupboard and it makes her jump. “You know that’s not true… and I wish… I wish…” I wish for once she’d just admit that she knows but doesn’t care. It’d be better than her pretending that none of this exists. She lowers the cup to the table and flips a page of her magazine, shrugging nonchalantly. “All I know is that you cut yourself and that your father wasn’t even here that night.” “Mom, you are so full of—” She smacks her hand down on the table and her body is shaking. “Kayden Owens, we’re not going to talk about this anymore. It’s being taken care of and we’re moving on because that’s what we do.” I lean back against the corner, bend my arms behind my back, and grip the countertop. “Why are you always protecting him? You should be protecting your kids… but you won’t even admit the stuff that’s going on.” She shoves back from the table, grabs her magazine and coffee, and hurries toward the doorway. “Do you know what it’s like growing up so poor that your mother has to sell herself on the corner all so you can have a used pair of shoes from the local surplus store?” My mother has never really talked about her childhood or her mother, so I’m stunned. “No… but I’d rather grow up without good shoes than grow up getting my ass kicked every day.” She swings her arm back and throws the cup at me. It zips past my head and shatters against the wall. Sharp fragments sprinkle all over the floor and get stuck in the cracks of the tile. “You ungrateful little shit. You have no idea how lucky you are.” She’s shaking from her anger and her eyes are bulging. I glance from her to the shards on the floor and then back at her with my mouth hanging open. She’s never been this upset before. She’s usually subdued. But as quickly as the wildfire came, it’s gone and the flames and rage in her eyes dissipates. She runs her hands down her hair, combing it back into place before she walks out of the room and leaves me to clean up the mess. I get a broom from the closet and sweep it up, watching the broken pieces fall into the garbage can as I empty out the dust pan. I notice some travel itinerary to Paris and also Puerto Rico in the garbage and wonder if that’s where my dad went. These places seem more like a vacation, though, than a business trip. As I put the broom away, I get lost in that night, the uncontrollable anger in my father’s eyes, and the feeling of not knowing surfaces in my chest. What is going to happen to me? How do I make myself fit back into life when I thought I’d fallen into death? And will I even ever have a life to fit back into again? My mom can pretend all she wants that this is going to go perfectly—that they’ll pay off Caleb and he’ll keep his mouth shut—but I have my doubts and I won’t be the least bit surprised if he takes the money and still presses charges. I continue to analyze my plans as I go down to the room in the basement and sit in the quiet. I take my phone out of my pocket and stare at the screen with my finger hovering over the TALK button. I want to call Callie so fucking bad. Because it feels like she could help me, let me know some of the answers, give me a reason to revive again. “Hey, man.” Tyler stumbles into the room and slams the door shut with his elbow. He’s got a brown paper bag in his hand and he tips his head back and takes a swig from whatever is inside and then wipes his face with the sleeve of his shirt and directs the bag at me. I shake my head and put my phone away, taking Tyler’s interruption as a sign not to call Callie. “No thanks, man.” He shrugs and takes another gulp before flopping down in the leather sofa across from mine. He looks more like he’s in his late thirties than his twenties and his clothes are ragged and worn. He’s missing one of his teeth, which he says is from a fight, but I wonder if he’s a crack addict or something by all the sores on his face. His brown hair is cropped and it’s thinning out and he reeks of smoke and booze. “How long are you staying here?” He kicks his feet up on the table and there’s a hole in the bottom of his shoe. “I have no idea.” I pick up the remote from the coffee table and aim it at the television screen. “I guess it depends on what happens with this Caleb thing.” He removes the paper bag from the bottle of vodka and puts the tip of the bottle up to his mouth. “Yeah, what was that about?” He knocks a shot back and then slams the bottle down on the table. There’s a red ring around his mouth from pressing the bottle against it and I wonder if it hurt or if he even felt it. I turn on the TV and begin flipping through the channels. I don’t want to talk to him when he’s so trashed that he won’t remember a word. Even though it’s probably wrong, I still have bitter feelings toward him for bailing on me when I was a kid so he could turn into this. “It’s called life.”","sourceLink":"https://allnovel.net/the-redemption-of-callie-kayden-the-coincidence-2/page-13.html","bookId":1975,"book":{"id":1975,"title":"The Redemption of Callie \u0026 Kayden (The Coincidence #2)","description":"Storyline: The Redemption of Callie \u0026 Kayden (The Coincidence #2) The dark secret Kayden has kept hidden for years is out. Worse, he\u0027s facing charges for battery. The only way he stands a chance against the charges is if Callie speaks up, something he\u0027ll never ask her to do. Callie knows Kayden is going back to his dark place and desperately wants to save him. But saving him means admitting her secrets aloud. Callie and Kayden are stronger than they think, especially when they\u0027re together. Together they move forward, face their demons, and finally start to heal from their traumatic pasts.","cover":"https://allnovel.net/images/the-redemption-of-callie-kayden-the-coincidence-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-redemption-of-callie-kayden-the-coincidence-2.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:21:49 AM"}}
