{"id":72005,"no":46,"title":"Page 46","content":"“It’s private. Some of the stuff… you might think I’m crazy.”\n “I already think you’re crazy,” he jokes, lowering his arms onto his lap. He slides across the bed toward me until he’s right in front of me, and his face softens. “Please, just one page.” He’s using his sexy voice on me, the one I have a hard time saying no to.\n Sighing, I fan through the pages until I come across the nonfiction story I’ve been fighting to get out of my head and into coherent sentences. “This is the story I’ve been working on. I’m not very far into it and I’m not even sure if it makes sense yet.”\n He takes the journal from my unsteady hands. It’s the first time I’ve let anyone read anything I’ve written and it feels like I’m letting him have full insight into my head. Holding it in his hands, he clears his throat and begins to read aloud.\n “Where the Leaves Go.” He glances up at me and smiles.\n “Nice title.”\n I shake my head and lie down on my back, staring at the cracks in the ceiling and trying to still the tempestuous beat of my heart. “Please just hurry. You’re making me nervous.”\n He chuckles underneath his breath and then starts to read. “I remember when I was a child being fascinated by the leaves. They were always changing: green pink, orange, yellow, brown. And then eventually, when the air changed and chilled, they turned into nothing. They’d fall from the branches of the trees and either crumble and become a part of the ground or blow away in the wind. They never really had any power over their movements.\n They’d just go with the weather and wherever the wind would take them, helpless, weak, incapable of control.\n I remember when I was young, about thirteen. It was a rainy spring day and the raindrops were splattering fiercely against the earth and the wind was howling. I was sitting at my window, watching the street flood and the leaves get carried away with the rage of the water. They were all a flourishing green, in the prime of their life, just blooming, yet the rain and wind was destroying them.\n But there were these two leaves stuck to my bedroom window that wouldn’t budge. They remained in place through the windstorm and the temper of the rain, even when the water was falling so heavily I couldn’t see through the glass.\n I kept staring at the leaves, unable to take my eyes off them, fascinated by their determination, even when the sky darkened and the window howled so violently it shook the glass of the window. I kept thinking about how strong they were and how they were only leaves. Pieces of a tree, a plant, these little things that couldn’t think, make choices, do anything of their free will, yet they wouldn’t give in to the wind and rain and leave that damn window.\n In a strange way, I envied them, the determination, passion, sheer will not to give in and let something else take them to the end of their life.\n At the end of the storm, I fell asleep in my bed. When I woke up, the sun was out and the land was drying. The leaves that stayed attached to the tree branches were green and dewy. To my surprise the leaves were gone from the window and it made me kind of sad and I felt hopeless. The idea that they could survive against the storm was bringing me a sense of comfort.\n However, when I look back at it now, I wonder where they went. Maybe they didn’t give up and let the wind and rain take them away. Maybe they somehow found their way back to the trees. Maybe they reconnected themselves to the branches and continued to grow and flourish even after their temporary break.\n Maybe they were strong enough to take control of their lives again, revive themselves from their approaching death, force themselves to start breathing again…” Kayden stops reading and looks up at me with an undecipherable look.\n I take my journal from his hands and cuddle it against my chest. “I know it’s not really a story, just my thoughts. But it’s all I can come up with at the moment.”\n He nods and doesn’t say a word. He drapes an arm around my shoulder and steers me with him as he lies down on my bed and rests his head on my pillow. I nuzzle my face against his chest, breathing in the scent of him as I hug my notebook. I listen to his heart in his chest and shut my eyes and inhale and exhale with the sound of it.\n “Callie,” he says after a long stretch of silence has gone by.\n I inch my face closer to him and place a kiss on his chest.\n “Yeah.”\n “I think the leaves made it back to the trees.”\n Epilogue\n Three Weeks Later…\n Kayden\n Virginia is a pretty nice place, green, with lots of trees and wildlife roaming around. It’s a little warmer than in Wyoming. At least from what I can tell. I’ve only been here for about an hour and most of the time I was stuck in the airport. I flew out alone, even though Callie wanted to come with me. As much as I wanted her to, I didn’t need to disrupt her life and her progress. “I’m only going out for a week,” I told her. “And I think it might be something I need to do alone.” She seemed a little hurt, but she understood and let me go without any more discussion of it.\n After a very strange, somewhat awkward reunion with my brother at baggage claim, we got in his midsize SUV and headed out to the freeway. He looks a lot like me, only older with thinning hair and fewer scars on his face. He’s dressed in slacks and a polo shirt and the inside of his car smells like fast-food.\n We keep the conversation light for about the first ten minutes, talking about school and his family, and then suddenly I have to know.\n “Why didn’t you ever call?” I ask, holding onto the handle of the door for support.\n He looks at me with the same green eyes as mine. “I tried to, but mom and dad changed the number when I left. And then when I did get it, they would never answer and if they did they would hang up. I wanted to get ahold of you after you moved out… but I don’t know… life just kind of got in the way.” He pauses and his hands grip the steering wheel and he forces a lump down in his throat. “How bad was it?”\n I shrug, staring out at the warehouse lining the side of the freeway. “I don’t know.”\n He doesn’t press me for the details, but he can tell by my tone that it was bad. And he knows about what happened in the kitchen, when my father stabbed me, and that story tells a lot.\n “Have you heard from them at all since they took off?”\n I shake my head and place my hand over my side on the last scar my father ever gave me. “No, but I wonder why… and where they went. It’s like they were running away from something.”\n He nods, with a pensive look on his face. “Yeah, I know… I think it might be that they were worried you’d speak up.”\n “What would it matter if I did?” I question. “Even if I did, there isn’t a whole lot I could do. Even if the police believed me, and I could press assault charges, he could get off by only paying a fine. And he probably would, knowing him.”\n Dylan shakes his head as he turns the car for an off-ramp.\n “Try attempted murder or even manslaughter. He stabbed you, Kayden—beat the shit out of you. He beat the shit out of all of us.”\n He touches his cheekbone and runs his finger over a small straight scar on his cheek. “Someone should have spoken up a long time ago and not let him get away with it.”\n Silence takes over as we both drift back to our childhood. It’s weird being around someone who understands what it’s like.\n “We were all scared,” I say quietly and he nods in agreement, his eyes focused on the road. “How do you get over it? How did you move on with your life?”\n He shakes his head and slows the SUV at a stop sign. “I haven’t yet, but it gets easier with more time away from him. That stupid fucking power he has over you will go away.”\n I suck in a deep breath and then let it blow out. I tap my fingers on the door, watching the houses move by in a blur and wonder what his place will look like. I know he’s married and doesn’t have any kids. His wife is a teacher too. It seems so normal and strange to me, considering how Tyler turned out. But I guess that’s life. Not everyone ends up the same way, even if their circumstances are the same, because not everyone thinks and reacts the same.\n Finally, he pulls the vehicle to the side of the road in front of a field and shoves the shifter into park. I’m surprised though by where we are, not by houses but by a prison that’s hidden behind a tall chain-link fence with coils of barbed wire.\n “Ummm…” I glance at Dylan, perplexed. “What are we doing here?”\n He turns down the stereo and takes his seat belt off. He stares at the building for a really long time before he speaks. “You remember dad talking about his dad sometimes and it always kind of sounded like he pretty much treated dad the same as he did us?”\n I nod, staring at the guards outside. “Yeah, I guess.”\n “Well, you want to know the truth?” he asks and looks at me.\n His eyes are a little glossy and I wonder if he’s about to cry or something.\n “I guess so.”\n “He was actually worse, if you can believe it. Dad had a brother and his dad—our grandfather—killed him… beat him to death.”\n My heart stops beating inside my chest and for a moment I’m thrown back through time into the kitchen. The knife enters my side. It hurts. Not just the pain. It hurts because he’s my father.\n He’s not supposed to do this to me. He’s supposed to protect me, not destroy me.\n “And now he’s here,” my bother says, nodding his head at the jail.\n I pause as I take in the building and the fence around it.\n “How did you find this out?”\n “I wanted to know… where we came from. Why we had such a shitty life. Was it just a freakish fucking coincidence that we were born into a crappy home with crappy parents? Or was it inevitable?” He pauses, staring at the fence and the sharp barbed wire. Then finally he cranks the wheel to the side and flips a U-turn, the tires spinning as he floors the pedal and drives down the road.\n I’m not sure what to do with what he said or if there’s anything to do, but I have to wonder if I’ll end up just like my dad, just like he ended up like his. I wonder if Dylan thinks the same thing. I wonder if he prefers physical pain over feeling emotions. I wonder if my dad does. I wonder a lot of things at the moment and it starts to pile up on my chest. Everything I’ve worked so hard to get rid of over the last few months is returning, the silent storm stirring.\n But then I wonder if my dad could have changed his life, knowing the outcome. He could have made himself feel things and be a better person, just like I can. I don’t know why I choose that moment to do it. It’s probably a little fucked up and twisted, but the need to get it out of me is more overpowering than anything else. Instead of reaching for a sharp object, I reach for my phone. I dial Callie’s number and when I hear her voice the storm in my chest calms.\n “Are you having fun?” she asks with hope in her tone, wanting me to be happy.\n I take a deep breath and say it with all the emotion I have in me. “I love you.” \n","sourceLink":"https://allnovel.net/the-redemption-of-callie-kayden-the-coincidence-2/page-46.html","bookId":1975,"book":{"id":1975,"title":"The Redemption of Callie \u0026 Kayden (The Coincidence #2)","description":"Storyline: \n The Redemption of Callie \u0026 Kayden (The Coincidence #2) \n The dark secret Kayden has kept hidden for years is out. Worse, he\u0027s facing charges for battery. The only way he stands a chance against the charges is if Callie speaks up, something he\u0027ll never ask her to do. \n Callie knows Kayden is going back to his dark place and desperately wants to save him. But saving him means admitting her secrets aloud. Callie and Kayden are stronger than they think, especially when they\u0027re together. Together they move forward, face their demons, and finally start to heal from their traumatic pasts.\n \n","cover":"https://allnovel.net/images/the-redemption-of-callie-kayden-the-coincidence-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-redemption-of-callie-kayden-the-coincidence-2.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:21:49 AM"}}
