{"id":37356,"no":40,"title":"Chapter 18","content":"Grant was fully aware, on the afternoon before his return, that he had brought his mission to a most successful conclusion. The English Press was receiving the American attacks upon Lord Yeovil and his invitation with good-humoured magnanimity. He had collected more evidence—evidence of a very sinister nature—as to the brooding air of unrest which everywhere prevailed, and, in view of certain contingencies, firmly fixed in his own mind but only half believed in by other people, he had obtained pledges of the utmost value and importance. Yet, so far as he personally was concerned, he felt very strongly that his visit had been a failure. The more he thought of it, the more he became convinced that its failure had been inevitable, that his advertised delinquencies could have been looked upon in no other way. And yet he smarted under the judgment. The man in him rebelled. \n \n In Bond Street that afternoon, he heard his name pronounced by a woman alighting from a motor car just in front of him. He recognised her with some difficulty. It was indeed Gertrude, looking entirely her old self. \n \n “Still in London,” he remarked, as he stood by her side for a moment. \n \n “Still here,” she assented. “I had orders to wait—to meet my husband.” \n \n “Your husband!” \n \n She smiled with faint irony. \n \n “My husband. Are you surprised? He arrives to-day. He is quite excited at the idea of seeing me again.” \n \n “I can well believe it,” Grant observed, a little bewildered. \n \n “But you,” she went on. “You have not the appearance of amusing yourself at all. You are worn to a shadow, my dear Grant. Why do you worry so about this little game of politics? Believe me, for all your efforts, the world will be very much the same in five or ten years’ time.” \n \n “The philosophy of sloth,” he reminded her, smiling. \n \n “Perhaps so. But you seem, indeed, very miserable,” she continued, studying him for a moment. “What is the matter? Are your love affairs progressing ill?” \n \n “I have no love affair,” he answered. \n \n She looked at him for a moment searchingly, and her lips slowly parted. She laughed—laughed the more as his frown deepened. \n \n “You poor man!” she exclaimed. “And after all your sacrifices! Perhaps it was not so much of a sacrifice, though,” she went on, glancing unconsciously at her reflection in the plate-glass window of the shop in front of which they were standing. “I suppose I have gone off. What do you think, Grant?” \n \n “You looked ill upon the steamer,” he told her. “To-day you look as well as you ever have done in your life.” \n \n “I hope I do,” she murmured. “Otto would feel at once that he had been cheated out of something if I had lost my looks. I can never quite make up my mind,” she went on reflectively, “how much of my appearance I owe to my clothes. I have a wonderful flair for clothes, you know. Grant, and for wearing them.” \n \n “People have remarked upon it,” he agreed a little drily. \n \n She smiled. \n \n “You’re getting bored,” she declared. “The trouble about me is that I’m so self-centred. I’m always talking about myself, and, of course, I ought to be sympathising with you. But how can I, Grant? You fix your mind and affections upon an ingenue of the most British type and then you nurse a broken heart because the inevitable happens.” \n \n He broke away from the subject. \n \n “May I take it, then,” he asked, “that you and your husband are reconciled?” \n \n “We are about to be,” she admitted. “It is very amusing. I made the first overtures, or rather Mr. Cornelius Blunn made them on my behalf. He pleaded my cause most eloquently. I have been given to understand that I am forgiven. My husband arrives to-day. We are staying at the Ritz. I think I will not ask you to call.” \n \n She saw the displeasure in his face. For a moment she faltered. She was gripping her little gold purse tightly with the fingers of her left hand. \n \n “I seem to you flippant?” she went on. “Well!—you must make allowances for me. This is not exactly the happiest day of my life. I suppose really I should look for happiness in other ways—trying to do good and all that sort of thing. If I were to play the much admired part of long-suffering heroine in the cinema romance of life, I should, of course, put on my plainest clothes, wait mysteriously upon your young ingenue, confess the whole truth to her at the cost of my own undying humiliation, and not leave her until I had shown her the truth. Then I should telephone you. You would leap into a taxi and drive to Yeovil House. I should take a last look at your photograph and an overdose of veronal. Curtain to slow music!” \n \n Grant’s feelings had suddenly changed. He realised the state of strain in which she was. \n \n “You’re talking a great deal of nonsense, Gertrude,” he said. “I am glad to have seen you. I am glad to hear your news. If I may be allowed to say so, I do indeed wish you happiness. I wish that I could have had my share in bringing it to you.” \n \n He passed on a little abruptly, and Gertrude made her delayed entrance into the establishment where hovering satellites had been eagerly awaiting her. To Grant, the interview had been, in its way, a painful one. From a material point of view, Gertrude’s reconciliation with her husband was certainly the best thing that could have happened to her. Yet, during the whole of their conversation, he had been conscious of an uneasy environment of misery. The meeting, notwithstanding a certain sense of relief which it brought him, had only increased his depression. He strolled on without any particular idea as to where he was going. At the corner of Bond Street and Piccadilly he heard a familiar voice and felt a friendly hand upon his shoulder. \n \n “Why so woebegone, my young friend? You ought to be up in the seventh heavens to think of all the excitement you are causing.” \n \n Grant was suddenly down again in the world of real things. He shook hands heartily with his new friend. \n \n “Good morning, Admiral,” he said. “Do I look as though I were indulging in a fit of the blues?” \n \n “If I hadn’t been a brave man,” Sullivan declared—“we’re all brave in the navy!—I wouldn’t have ventured to speak to you. Come along and lunch.” \n \n Grant hesitated. His companion took him by the arm. \n \n “Ritz Grill Room—my favourite corner table,” he insisted. “We ought to have heaps to talk about—except that I am too hungry to talk at all. I’ve been up since five o’clock on your business—in the Marconi room at the Admiralty, most of the time.” \n \n “Any news?” \n \n “Not much that’s fresh, anyway. We’re getting things into shape for the moment we receive word from Washington. There’s a Cabinet Council to-day, you know. Lucky some of our friends can’t get hold of the agenda. We should have the whole world by its ears to-morrow.” \n \n They descended the stairs and remained for a moment in the lounge of the Grill Room, while Sullivan ordered luncheon from an attentive maitre d’h?tel. The barkeeper was content with a nod. \n \n “You like your cocktails dry, of course,” Sullivan went on. “I brought you here instead of the club because all the fellows would want to meet you and talk, and we’re not loquacious, just at present, except to one another.” \n \n “Very thoughtful of you,” Grant approved. “I had an idea that you might be coming across with us.” \n \n “Can’t be done. We shall work the show from here. All the same, I must confess I had rather be in Washington. Have you sent that cable?” \n \n “I’ve sent one a yard long. The trouble is the Government are pretty well convinced already. It’s the voters we want to get at. What I’m afraid of all the time is that the trouble will commence before the President has been empowered to sign.” \n \n The Admiral rose to his feet in reply to a summons from the maitre d’h?tel and led his guest towards the table which had been prepared for them. \n \n “Don’t worry too much about that, young fellow,” he enjoined cheerfully. “I’m a sailor, not a politician, but I can see my hand before my face in the daylight. If half the members of the pact go on the rampage—well, I shouldn’t be surprised if the other half didn’t follow suit. Now then, sit in that corner and try an English lobster.” \n \n “Another thing that rather puzzles me,” Grant remarked, as they proceeded with their luncheon, “is why our friends, the enemy, should have chosen for their enterprise the year in which England is policing the Asiatic seas on behalf of the Limitation of Armaments Committee. If it had been Germany’s year, for instance, they could have done what they liked.” \n \n “Well, there are two reasons for that,” his companion explained. “The first is that the most important year, so far as secrecy is concerned, was last year, when some of their phantom ships were actually laid down. Last year, as you know, Germany policed the whole of the eastern waters and reported everything O. K. Then, their second reason, no doubt, is that England polices very strongly, and it means at least two capital ships and subsidiary craft detached from the main fleet. They think they’ve got rid of those units in case, by any chance, we should break the Pact and intervene. As a matter of fact, we have made a few changes,” he went on, lowering his tone. “Our best battleship and three destroyers are on their way home now. Australia’s replacing them for us.” \n \n “I am going to ask you the most improper question a person in my position could ask of a person in yours,” Grant declared. “If the German fleet entered the Atlantic steaming westwards, before America had had time to join the Pact, should you interfere?” \n \n Sullivan grinned merrily. \n \n “The politicians have to decide that,” he reminded his guest. “But a look round our naval ports to-day would probably surprise you.” \n \n “How would your strength work out?” \n \n “A trifle to their advantage on paper,” the Admiral admitted, “if you count the Russians in. But there might be a little difficulty about Russia keeping her appointment. They have just been served with a notice to receive a police patrol of inspection for a report to the Limitation of Armaments Committee. They will either have to show their hand or stay in their harbour. Then there’s another point to be borne in mind. I am a terribly pigheaded and prejudiced Britisher, and I swear by our own forces, but the French submarines have gone one or two ahead of us. I had sooner face the devil himself than the flotilla which is collecting in Cherbourg harbour.” \n \n Grant’s eyes flashed for a moment. \n \n “You mean that France—” \n \n “Pooh! My dear fellow. I don’t mean anything,” Sullivan interrupted. “I’m a sailor, not a politician. But I’ll tell you this. France is very often misjudged. Thirty years ago the world thought her self-centred, selfish, neurotic. So would any of us have been after what she went through. You wait. Jove! There’s our hostess of last night. Ripping, isn’t she? She’ll be the partie of the season. They say young Suffolk’s making the running. Makes one wish one were young again. Why not an international alliance, Slattery? Why don’t you go in with your millions? Old Yeovil thinks no end of you.” \n \n Grant endured his companion’s careless banter without moving a muscle. Susan, the centre of a gay little party, looked round as she entered the inner room and nodded to the two men. There was a smile for each—the smile of a happy, light-hearted girl, who has nothing but good will for the whole world. And yet somehow or other it was a smile which Grant hated. He felt that it put the seal upon his ostracism. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1449/43606.html","bookId":1370,"book":{"id":1370,"title":"The Wrath to Come","description":"简介： It is a passage which might well be haunted with memories of the famous courtesans, dignitaries, criminals de luxe and aristocrats of the world,the long straight stretch of passage leading from the Hotel de Paris to the International Sporting Club of...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1449","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
