{"id":57548,"no":129,"title":"\u003cChapter 28. Kratia\u0027s Quest - 1\u003e","content":"\u003cChapter 28. Kratia\u0027s Quest - 1\u003e\\n\\n They had made one mistake in creating golems. Measuring out the materials that they would need for the golems\u0027 bodies.\\n\\n He had originally thought that the emeralds that they\u0027d mined would be enough to create all 277 golems, but because of the transformation, the Dark Emerald Bone was slightly reduced in size. Plus, in the process of slightly carving the bone, as well as combining them, there was some bone loss, so he ultimately ran out of raw materials when building Erem 250.\\n\\n [Master, please command me.]\\n\\n [Erem 178 is here.]\\n\\n \"This...\"\\n\\n Lee Shin Woo moved on from the 250th Erem and looked futilely at the pile of dense, dark green powder... that resulted from carving the Dark Emerald Bones. He didn\u0027t have enough raw materials to make the next 20 or so Erems but had more than enough powder.\\n\\n \"I guess it can\u0027t be helped. I suppose I\u0027ll have to use this for my Bone Gate or for regenerating.\"\\n\\n \"They\u0027re much too valuable to use for that... Give me half. I feel like I\u0027ll be able to use it for some special magic. If not, then maybe I can use it to make an artifact.\"\\n\\n \"You make artifacts?\"\\n\\n \"Haa. It\u0027s actually a specialty of mine.\"\\n\\n \"Yeah, alright. I\u0027ll give you some.\"\\n\\n Lee Shin Woo didn\u0027t have the time to listen to her boasts, so he obediently gave her half the gemstone bone powder. When he considered her contributions in making the golems, this was nothing.\\n\\n \"Now what are you going to do with the golems?\"\\n\\n \"They\u0027re like the other golems. I\u0027ll split them into a few groups and send them off to hunt.\"\\n\\n Kratia gaped at Lee Shin Woo, who had created 250 level 6 elite golems. It might make sense if he were to send them after one of the 12 generals, but why would he split them up!?\\n\\n \"You\u0027re just going to send these guys off to hunt?\"\\n\\n \"Then what, do you want me to just leave them to rot?\"\\n\\n \"No, but...\"\\n\\n Even while flustered, Kratia gave her opinion. Telling him that the vibe in the Empire was becoming increasingly uneasy, that the Emperor\u0027s undead were probably gritting their teeth at the golems, and that it would be dangerous to send the golems out right now.\\n\\n Everything she said was correct, and her inferences were correct as well. However, Lee Shin Woo was the one who originally told her all that. He just told her that they would have to take that risk.\\n\\n \"Yeah, it\u0027s dangerous, but sending something away from my grasp will always be dangerous. But Kratia, you have to invest for that capital to grow. And the more danger there is, the more there is to gain.\"\\n\\n \"Capital...\"\\n\\n It frustrated her, but he was right. That same principle applied to them: heroes couldn\u0027t grow if they didn\u0027t endure danger. Kratia acquiesced to his logic, and Lee Shin Woo smiled bitterly.\\n\\n \"Well, I don\u0027t really like investing in a loss. I made this decision after considering our chances of winning, so just watch.\"\\n\\n Lee Shin Woo created ten groups of 21, consisting of... 20 Dark Emerald Bone Golems, and 1 Silver Golem. The Silver Golems were a precious resource, as they possessed a moving warehouse.\\n\\n \"You\u0027ve probably already heard, but you don\u0027t need to fight against opponents that are much too strong for you. If you find troops under the Steelworker\u0027s, or any of the 12 generals\u0027 command, don\u0027t fight and report to me at once. If you cannot win and you\u0027re about to be destroyed, sending me that information is paramount.\"\\n\\n [I understand, Master.]\\n\\n A group of 21 level 6 elite golems would be able to tread through a level 3 danger zone without being on the receiving end. Moreover, even if they were discovered by heroes, the heroes wouldn\u0027t attack easily, as they would be on guard against them.\\n\\n \"Oh, and never go over here.\"\\n\\n [I\u0027ll keep that in mind.]\\n\\n Once he told them to go in the opposite direction of Ethan Cruz, they all dispersed.\\n\\n The Silver Golem not only possessed the subspace ability but could also move stealthily, so they should be able to teach the Erems the fundamentals of moving stealthily while leading them. He didn\u0027t send the Silver Golems along with them just for their subspace ability.\\n\\n \"You sent that many away, yet you still have 60 level 6 golems left...\"\\n\\n \"Alright, then you guys will...\"\\n\\n There were 10 Silver Golems and 50 Erems left. These guys would patrol inside and outside the base and would be on standby, in case they were needed as emergency reinforcements. Even a level 7 elite would have difficulties getting through them.\\n\\n \"Then Shin Woo, what are you going to do with the remaining cores? Are you going to make more golems after you procure the materials?\"\\n\\n \"Nope. Let\u0027s just leave them be for now.\"\\n\\n He had said that he would sell the wine to the secret shop and buy materials to make cores if he had any materials remaining; yet he didn\u0027t have any materials remaining nor could he absorb the cores. Lee Shin Woo was sure that it wouldn\u0027t be a good idea to scrape by by buying the materials he was lacking from the secret shop to make the remaining golems.\\n\\n \"In any case, I can always make golems whenever I want. I\u0027ll think about making more golems when I get my hands on some materials.\"\\n\\n In other words, the Solar Fossil. He thought about making golems with this unique and precious treasure, but Lee Shin Woo and Kratia didn\u0027t have the knowledge to make golems using the Solar Fossil. When he thought about that, he calmed down a bit. He still needed to work hard.\\n\\n \"And you never know, there might be a way to further strengthen these Original Cores.\"\\n\\n \"I can\u0027t even imagine that, but... In any case, if we go there, it might help improve your knowledge of magic, Shin Woo.\"\\n\\n \"You\u0027re talking about that magic training facility, right?\"\\n\\n \"Yeah.\"\\n\\n It seemed like she really wanted to bring him over there. Lee Shin Woo smiled bitterly, nodded his head, and spoke. He\u0027d fermented the wine and made the golems as well. He supposed he could follow her now.\\n\\n Lee Shin Woo looked around the base one more time and prepared to leave. He didn\u0027t know how they knew, but the moment he was about to leave, the Dryads came out. Once he finished with his goodbyes, he left their base.\\n\\n \"Where do we have to go?\"\\n\\n \"Mm, this way.\"\\n\\n Kratia shared her minimap with Lee Shin Woo and pointed towards a specific spot. Coincidentally, their destination was in the opposite direction, but if they took the golem train and departed from where it stopped, they would be able to reach it rather quickly.\\n\\n \"Then are we going to take the train?\"\\n\\n \"No. Not only are you with us right now... we also have to avoid the golems for the time being. But it\u0027s not like there\u0027s no way of getting there.\"\\n\\n Lee Shin Woo smiled (of course, from an outside view, it just looked like his jawbone moved downwards a little bit) elatedly at Kratia, who was tilting her head and took out a precious item from his inventory. It was the level 8 Bone Gate!\\n\\n [Bone Gate]\\n\\n [Lv8]\\n\\n [Durability - 1,550/1,550]\\n\\n [A treasure that sacrifices bone to create a gate that leads to a designated point. The gate can only be linked to a location that the user is completely familiar with, and it is impossible to cross dimensions. It is imperfect, so the amount of people who can utilize the gate is very limited.]\\n\\n From the outside, the Bone Gate just looked like an oval-shaped bone bracelet. But Kratia\u0027s eyes shined, as she could grasp a portion of the magic within, and asked.\\n\\n \"This is the Bone Gate?\"\\n\\n \"This is my first time using it.\"\\n\\n The reason he had suggested that they not use the golem train was because he wanted to use the Bone Gate. Lee Shin Woo looked at the Bone Gate with severe anticipation and gripped it.\\n\\n Was it because it was an item that was made of bone? He knew how to use it instinctually. Lee Shin Woo needed to focus on the image he wanted to go to and then infuse his mana into the Bone Gate!\\n\\n [Giiiiiiiiiiiii]\\n\\n The Bone Gate accepted his magic and he like felt it demanded a bone prior to activation. Because it felt like it would eat away at his hand if he let it be, he hurriedly opened his inventory and fed it the bone powder created from grinding level 1 and 2 bones.\\n\\n [Giiiiii]\\n\\n \"Damn, how long are you going to keep eating... Huh?\"\\n\\n The Bone Gate stuffed itself for quite a while, perhaps because the quality of bone was so low, and let out a bizarre sound as if it was saying \u0027give me more\u0027. If the bone powder wasn\u0027t enough this time too, then Lee Shin Woo was ready to sacrifice the gemstone bone powder, but then, it suddenly began to emit a white light!\\n\\n He was taken aback. When he lifted the Bone Gate, the radiating light formed a giant oval shape. It looked like around two people could easily fit through it.\\n\\n \"This is gate magic... It\u0027s ridiculously high rank magic. Even if it\u0027s a temporary gate, the level of magic is similar.\"\\n\\n Kratia gaped and verbalized her astonishment. It seems as though she\u0027d seen this kind of magic before.\\n\\n \"Alright, then shall we?\"\\n\\n \"Wait a sec, Shin Woo. It seems like only two people can go through.\"\\n\\n \"What...\"\\n\\n It\u0027d eaten that much bone powder and it would only let two people through!? But if they did nothing, then the gate would close on them and no one would be able to get through.\\n\\n Lee Shin Woo gritted his teeth and sent Kratia and Rem through the gate first. As he thought, Rem was considered a \u0027person\u0027 as the gate became faint and vanished. Immediately after, Kratia sent him a message.\\n\\n [Kratia Melloi: I arrived. It\u0027s awesome!]\\n\\n \"Yeah, I\u0027m glad you think so.\"\\n\\n He weakly replied and fed the Bone Gate bone powder again. Although he had collected a large quantity of bone powder from the few large battles he\u0027d been in, as well as the bones that the Pauls and golems had brought him, opening the gate twice had consumed 25% of his bone powder!\\n\\n \u0027I should probably just use high level bones instead... No, no I shouldn\u0027t. I can always get my hands on low level bones. Damn it. In any case, I need to find a solution soon.\u0027\\n\\n Lee Shin Woo gritted his teeth and at the same time, entered through the gate with Jin. Rem, who was waiting for them from beyond the gate, flew and perched itself on his shoulder, while Kratia rushed over to them, looking incredibly excited.\\n\\n \"A gate! Amazing! The Bone Gate\u0027s amazing!\"\\n\\n \"Yeah, yeah.\"\\n\\n Why is it that Kratia\u0027s personality does a 180 whenever magic is involved? Lee Shin Woo replied roughly and when he was about to put the Bone Gate into his inventory, Kratia suddenly spoke.\\n\\n \"If you absorb that, can\u0027t you use that ability, Shin Woo?\"\\n\\n \"Ah...\"\\n\\n \"You can\u0027t?\"\\n\\n \"No, well, you\u0027re probably right.\"\\n\\n \"Then!\"\\n\\n \"But...\"\\n\\n There was no way Lee Shin Woo wouldn\u0027t have thought of that. Moreover, Kratia probably wasn\u0027t aware of this, but he possessed the Bone Armory ability. If he succeeded in absorbing the Bone Gate, he would be able to reproduce its effects without fail. If he was sure he could absorb it, he wouldn\u0027t hesitate. Yeah, if he could that is.\\n\\n [You cannot absorb the Bone Gate through Bone Reinforcement. The level of Bone Reinforcement, Bone Armory, as well as your own level is much too low in comparison to Bone Gate.]\\n\\n \"Ah...\"\\n\\n \"Don\u0027t look at me with such disappointment.\"\\n\\n He placed the Bone Gate into his inventory, and Kratia rode behind him. He couldn\u0027t thank Jin enough for allowing both him and Kratia to ride him.\\n\\n \"You just need to go this way. Let\u0027s hurry.\"\\n\\n \"Roger.\"\\n\\n \"Wait a sec, you\u0027re too fas... Uweeehk.\"\\n\\n \"You can vomit if you want, but just don\u0027t vomit on my back.\"\\n\\n Jin\u0027s speed increased day by day. If he felt like he\u0027d barely adapted to his speed, then Jin would get faster the next day. The scary part was that even though Jin had two people riding him, plus a golem, he didn\u0027t seem to run any slower; instead, he seemed to gradually pick up speed.\\n\\n \"We should arrive within 5 minutes at this speed. So Kratia, how do we get in? It should have a secret code like our winery.\"\\n\\n \"It does. We can\u0027t just go in like this... Uweeehk.\"\\n\\n The effect of his sprint was amazing! Kratia was completely nauseated!\\n\\n Because Kratia was the only one with a permit, Jin had no choice but to slow down. Kratia slapped Jin\u0027s ass a few times (since he was garbed in steel armor, Kratia\u0027s hand was the only thing hurting), and after barely calming down, she checked her surroundings. She then ordered.\\n\\n \"Go a little more forward. Slowly!\"\\n\\n \"You can\u0027t even get used to that speed?\"\\n\\n \"You\u0027re just too fast, Jin!\"\\n\\n After five minutes of detailed adjustments, they barely arrived at the entrance to the training facility. While they did arrive, it was just an empty plain.\\n\\n \"It\u0027s not inside of a city or a dungeon, so where...\"\\n\\n \"Ah, I found it.\"\\n\\n \"Yeah, I thought you would say that about now, Shin Woo.\"\\n\\n Though he said there wasn\u0027t a dungeon around, its system was exactly like one. How did they hide a subspace? It wouldn\u0027t be wrong to say it was a type of dungeon, but its size, as well as the concentration of magic, was incomparable to a normal dungeon.\\n\\n \"But it\u0027s all oddly concealed, right? This is the Royal Magician Leader\u0027s ability.\"\\n\\n \"That means that there\u0027s no way I can fight him... Then can we really just relax and go on in?\"\\n\\n \"If you don\u0027t invest capital, then it won\u0027t grow. The more danger there is, the more there is to...\"\\n\\n \"Ah, fine. I got it.\"\\n\\n At least in terms of enthusiasm for magic, Kratia had him beat. Well, if things went bad, they could just get on Jin and run, so it wasn\u0027t that big of a deal.\\n\\n However, the moment they decided to enter the training facility...\\n\\n [Welcome, new trainees. There are a total of five trainees, including the other trainees.]\\n\\n \"...Five?\"\\n\\n \"Shin Woo!\"\\n\\n Lee Shin Woo\u0027s goblin fire twisted at the mechanical sound that surrounded them, and the moment that Kratia yelled...\\n\\n \"Who are you!?\"\\n\\n \"Keut.\"\\n\\n Someone appeared before them. He had lustrous, lively silver hair, pale skin, and rosy cheeks that shined a bit more than Pleine\u0027s...\\n\\n \"Who are you, and how did you get in here!? This is a place that I, Prince Altania, have conquered! Hey you, take off your helmet!\"\\n\\n A rude magician boy pointed his antique wooden staff at them and yelled.\\n\\n He had met the one senior he really didn\u0027t want to meet.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-129","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is. \\n","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
