{"id":57578,"no":159,"title":"\u003cChapter 32. Titan\u0027s Pride - 3\u003e","content":"\u003cChapter 32. Titan\u0027s Pride - 3\u003e Lee Shin Woo was walking into the inner part of the Giants\u0027 domain with one of the level 7 Giants. From an outside view, it looked like nothing more than an ordinary snow-covered field, but he felt like he was blocked by a barrier of mana around halfway through. Although he knew this barrier wasn\u0027t physically stopping him from entering, it was a barrier that would lead one astray and force them to go in another direction. In other words, it was similar to the spatial barrier that prevented access into the mountain range. [It\u0027s in here. You should be able to follow us through.] \"Of course.\" Due to the leading Giant, the barrier was temporarily removed, and the correct path appeared. Of course, a normal person would find it difficult to follow, but to Lee Shin Woo, who had figured out the right way to enter the mountain range, it wasn\u0027t very difficult. No, even if the Giant hadn\u0027t been here, he would\u0027ve been able to figure it out. \"The spatial divergence is severe, even within the Giants\u0027 domain...\" [It\u0027s a barrier created by the Titan\u0027s Heart itself. Only us Giants are permitted to enter.] \"As I thought. This is what it means to be descendants of the Titans…\" [Indeed.] As he followed the Giant, Lee Shin Woo felt apologetic to Kratia, as he\u0027d left her behind and was going to see the Titan\u0027s Heart without her. However... it couldn\u0027t be helped, as there was no way that the Giants, who hadn\u0027t yet fully overcome their instincts, would accept her. \"Do we have to walk for a while?\" [We\u0027ll be there soon.] The Giant really did stop soon. The snowy field had changed into a giant icy hill before their eyes. Lee Shin Woo felt a ridiculous amount of cold air and his body shook. \"As expected...\" [Did you hear everything from Fennos?] \"No, not everything.\" [I see...] The Giant muttered sadly and pointed towards the hill. It seemed preposterous, but it seemed like the root cause of the cold air that froze the entire mountain range was this hill. [The Titan\u0027s Heart is inside here. Originally, the Titan controlled overwhelming heat rather than cold, but so much time has passed since the Titan had died that the last remaining trace of that individual has, as you can see... it spews out cold air, rather than hot.] \"Hmm, how interesting...\" Lee Shin Woo didn\u0027t really know much about cold-related artifacts, aside from Kratia\u0027s orb. But why was it? He felt familiar energy coming from the center of the hill. He attempted to get closer and study the Titan\u0027s Heart buried within more in-depth. But at that moment... [Who has come?] [Who did you bring?] Two Giants suddenly ran down from the top of the hill, casting a dark shadow over Lee Shin Woo\u0027s head. When he raised his head, the Giants that lay before his eyes were the most powerful and largest Giants amongst all the Giants he\u0027d seen thus far. Of course, Lee Shin Woo wasn\u0027t surprised, as he knew who they were better than anyone else. [Lv7 Sealed Titan Zombie - Ellata] [Lv7 Sealed Titan Zombie - Arogan] Both of them were previously heroes, and they were probably made into heroes even earlier than Lee Man Bok... as heroes that were born on this planet. They survived through the day disaster befell the Empire, and they were picked by God and carried out her orders, but... they couldn\u0027t overcome the 12 generals and despite them being betrayed by their allies and becoming corpses, they regained their wills and had returned here. They had remained as Giants, not normal undead. [It\u0027s someone who can understand us, oh mother and father.] [Someone who can understand us...] \"I\u0027m Paul Zero.\" Lee Shin Woo confidently introduced himself to his two senior heroes, whereas the two undead heroes just kept watching the hill where the Titan\u0027s Heart was buried. He wouldn\u0027t be able to sleep until he could figure out what this familiar feeling was. Not that he could sleep. \"I have inherited Fenno\u0027s will, and have come here to retrieve the Titan\u0027s Pride.\" [To think you\u0027d speak the Titan\u0027s name.] [Fennos? What a nostalgic name. So you met him.] \"That\u0027s right.\" Surprisingly, the two Giants weren\u0027t really suspicious of him, nor did they reject him. They were the strongest of the Giants, those who scorned human beings, so it wouldn\u0027t have been strange at all if they were to have attacked him as soon as they saw him. Lee Shin Woo thought about it briefly and realized. They were probably helped by Lee Man Bok. If that was their last contact with a human being, then he could understand why they were acting this way. [Though you knew Fennos...] [It seems like you\u0027re quite close to this human, for you to suggest that he see the Titan\u0027s Heart. However, the Titan\u0027s Heart is the symbol of the Giants, so bringing him here was thoughtless of you.] [That\u0027s not the issue right now, mother, father.] [...What?] Ah, perhaps this guy is...? Hearing that, Lee Shin Woo looked at the level 7 Giant in astonishment. To think he\u0027d say that the Titan\u0027s Heart, which all the Giants treasured \u0027wasn\u0027t the issue right now\u0027? It was at that moment that Lee Shin Woo realized something. That this Giant hadn\u0027t brought him all the way over to just show him the Titan\u0027s Heart. Rather, the Titan\u0027s Heart was probably just an excuse to ask him for something. [What are you talking about? Explain in detail.] [I\u0027m not a very good speaker, so I\u0027ll let this human explain. This human knows how to honor our will, so please hear him out.] The level 7 Giants bowed its head towards the previous heroes. Lee Shin Woo thought \u0027as expected\u0027 and nodded his head. The level 7 Giant had brought him here to persuade these two Giants to fight against the Imperial Army with them. To think that the Giant that had ignored him at the beginning was doing so much for him now. [...I thought you\u0027d completely degenerated into the undead, but you\u0027ve regained your intellect.] [How surprising. Is this change your doing as well?] \"Yeah.\" Of course, Lee Shin Woo had no intention of doing exactly what the Giant wanted. He gave them suitable responses whilst quickly analyzing the Titan\u0027s Heart. He was finally getting a feel for it. If the Titan\u0027s Heart was indeed what Lee Shin Woo thought it was, then it would be a waste to just sit around doing this...! [Not only has a human come into a forbidden area, but we\u0027re listening to what he has to say as well...] [I\u0027m sure that something\u0027s going on. It\u0027s good that the messenger has regained a bit of his intellect, but he probably came with grave news as well.] \"You said this is a forbidden area, right?\" [That\u0027s right, human. We\u0027re thinking about whether we should punish this one for allowing you, a human, into the forbidden area, or if we should consider you friendly enough to allow you into this area.] [What exactly did you do to bring back their intellect? Although they\u0027re better off than the undead teeming within the Empire, they\u0027re ultimately still undead.] \"...Hoo.\" At that moment, Lee Shin Woo raised his head. His analysis of the Titan\u0027s Heart was complete. It was exactly as Lee Shin Woo had thought. He realized how to truly \u0027awaken\u0027 the Giants. \"There are those who are trying to invade that forbidden area. They are aiming for the Titan\u0027s Heart.\" It was the second act of his play. [And that\u0027s not you?] Mm, a logical response. Moreover, it\u0027s actually correct. However, Lee Shin Woo brushed it off and continued. \"I came here to protect that, or more specifically, the Giants themselves. If you\u0027re ready to hear me out, then I\u0027ll keep going.\" [...] [Let\u0027s hear him out. I feel a familiar energy from this guy. It\u0027s similar to Man Bok\u0027s. The energy similar to our friend, who rescued us and helped us regain our intellect.] [Ugh... Alright, let\u0027s hear him out.] They would be pissed if they found out that Lee Shin Woo had killed Lee Man Bok. Lee Shin Woo inwardly grinned and continued. \"It\u0027s the Imperial Army. One of the 12 generals is with them at that, the Mercenary King, Metafel. There are 50,000 troops coming this way. They\u0027ve come through the mountain range with a magical device that nullifies the spatial inference. I stole that away from them, but they\u0027re gathering through an innate ability.\" [Metafel Rerdan...!] [Grr... He\u0027s the guy who killed Meljoo...!] [1] \"I\u0027m helping the Giants stop them with my own forces, but there will be several casualties amongst the Giants in the ensuing battle. If they\u0027re unlucky, then they may be completely annihilated. We need your help in order to stop them.\" [Metafel... How dare he...!] [Even so, we have to protect the Titan\u0027s Heart.] [...Indeed. It\u0027s even more important that we stay here, knowing that Metafel is aiming for the Titan\u0027s Heart.] Despite their hatred of Metafel, they prioritized staying by the Titan\u0027s Heart and protecting it, rather than vengeance. It wasn\u0027t like they were scared of Metafel. That\u0027s just how important they considered the Titan\u0027s Heart. Lee Shin Woo realized just how important the Titan\u0027s Heart was to them. If that\u0027s the case, then... Lee Shin Woo lightly provoked them. \"Of course, you don\u0027t have to worry about it too much. Since I\u0027ll kill Metafel before you even get a chance to see him.\" [...If that\u0027s the case, then there\u0027s no reason for us to be even having this discussion.] Lee Shin Woo would kill Metafel, not the Giants. They understood what he had said and he\u0027d left an impression on them, but it\u0027s not like that would be enough for them to respond with \u0027I\u0027m going to kill Metafel myself!\u0027. So Lee Shin Woo furrowed his brow, nodded his head, and spoke. \"That\u0027s right. The Giants may perish, but you\u0027ll be able to protect the Titan\u0027s Heart.\" [That\u0027s our (the Giants\u0027) mission that has been passed down from generation to generation. Those who die shouldn\u0027t have any complaints.] [But still, father, mother...!] The level 7 Giant who was listening from beside them looked as though he were burning up. Now that he thought about it, the one who had been hit by the level 7 elite\u0027s arrow and had been complaining the entire time was this guy. As expected, at the time he was consumed by rage, but as time passed he came to realize that the level 7 elite was stronger than he was. \"Yeah, there\u0027s nothing for you to worry about. Until the next batter is up, that is.\" [The next batter?] Hearing that, the Giants flinched. Had they really not expected this? Lee Shin Woo snorted and continued. He hadn\u0027t planned on telling them this, but the situation was different now. \"Isn\u0027t it obvious? Would the Empire really give up on this place with just the loss of Metafel? Rather, they\u0027ll come out even more aggressively next time, as they\u0027d have lost one of the 12 generals. At the very least, Feotane Von Seldin would be included in the next punitive force.\" [...] If that happened, then the Giants would be exterminated for sure. No matter how much they used the terrain to their advantage, or how well they planned, they wouldn\u0027t be able to block that single absolute being, despite their best efforts. \"I\u0027ve come here to persuade you (the Giants) and retrieve the Titan\u0027s Pride. But I haven\u0027t come here to die. I\u0027m going to run before then. Moreover, now that I look at you guys... it seems like you\u0027ve become too greedy. You two, the leaders of the Giants, don\u0027t seem to know what\u0027s really important here.\" [It\u0027s the Titan\u0027s Heart. The most important thing to us is the Titan\u0027s Heart!] Yeah, that Titan\u0027s Heart. They\u0027d finally gotten to the key to the problem. Lee Shin Woo extended his hand, gestured to the icy hill, and smiled coldly. \"Of course, this is a great treasure. But right now, it\u0027s nothing more than an item that\u0027s emitting cold air and slightly boosting your energy.\" [How dare you!] The Giant on the left side, Ellata couldn\u0027t hold themselves back anymore and swung its greatsword at Lee Shin Woo. The giant weapon seemed to contain enough force to cleave through a mountain, yet... Lee Shin Woo blocked it with the Titan\u0027s Pride. [That shield...!?] Lee Shin Woo didn\u0027t even blink at the astonished reaction of the Giant. \"At this rate, you guys will be annihilated, and the Titan\u0027s Heart you hold so dear will be taken away from you. You said the thing most important to you is the Titan\u0027s Heart, right? What you’re doing is pretty much giving it to the Empire on a silver platter.\" [Keuk!] Kwang! The force behind the Giant\u0027s greatsword finally broke apart the Titan\u0027s Pride. Before the greatsword could continue on its course and break Lee Shin Woo as well, he summoned a second shield and blocked its strike once more. Lee Shin Woo saw the speechless, gaping Giant and smiled bitterly. \"If it\u0027s so precious to you, and if you truly want to protect it so badly, then you can\u0027t just be sitting here doing nothing. The Empire already knows where it is. They also have a way to find it. So do you really think you\u0027ll be able to protect the Titan\u0027s Heart on your own?\" [We ca...!] \"Can\u0027t.\" [Keuk...!] Lee Shin Woo mercilessly cut them down. A giant attempted to refute his claims, but when it saw his blazing goblin fire, it couldn\u0027t follow through. How could they stop the level 8 Archmage from taking the Titan\u0027s Heart when they couldn\u0027t even beat a weak skeleton? The intellect that he\u0027d barely been able to preserve was telling him. That the undead in front of him was telling the truth. Everything was over, so long as the Empire had a way of locating the Titan\u0027s Heart. \"So, our job isn\u0027t to stay here and protect this thing.\" [Our?] \"Yeah, \u0027our\u0027.\" Lee Shin Woo grinned. At some point, a gigantified Breath of the Lightning God floated in the air. The mana consumption was tremendous, as it had been gigantified, but its dignity was undeniable. \"Our job is...\" Lee Shin Woo dropped his hand lightly. At that moment, the Breath of the Lightning God shot out like an arrow and burrowed into the icy hill. Seeing that, the Giants were shocked and moved to stop him, but it was already too late. The tough ice it\u0027d burrowed into began to crack, and once the Breath of the Lightning God began to emit lightning, the cracks spread throughout the entirety of the hill. [Are you trying to break apart the Titan\u0027s Heart!?] \"Nope.\" The hill, which boasted an incredible toughness from the many years of repeated freezing, was broken in an instant. That ice was saturated in mana, which wasn\u0027t very important. What was important was what appeared inside. [Lv8 Damaged Titan Golem Core] \"Our job is...\" Lee Shin Woo looked at the \u0027Titan\u0027s Heart\u0027, which had been stripped of its outer coating and even now was releasing cold air... No, it was actually a golem core that was sucking all the heat from its surrounding, and he said. \"To revive the Titan.\" [1] T/N: Rather than a \u0027Grr\u0027 (a growl), it\u0027s more like the sound when you grind your teeth, but I don\u0027t know a suitable onomatopoeia for that. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-159","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is.","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
