{"id":57622,"no":203,"title":"\u003cChapter 39. New Party Member - 4\u003e","content":"\u003cChapter 39. New Party Member - 4\u003e Two weeks later, Lee Shin Woo returned to Kuroa\u0027s Glory, and his popularity was better than ever. \"It\u0027s the Sun God\u0027s hero!\" \"I heard he\u0027s traversed half of the Empire in less than a month. Is that true?\" \"Perhaps not half, but he saved several cities. He cleared 5 unconquered dungeons.\" Lee Shin Woo was able to clear so many dungeons due to the Sun God religion\u0027s resources and information gathering. As Lee Shin Woo had performed a never before seen feat and had returned in triumph, he did indeed look like a true hero. \"That man... Is he really human?\" \"He must\u0027ve conquered the dungeons with the Sun God religion\u0027s paladins and priests, but he\u0027s still amazing.\" \"I knew he was amazing since the first time I saw him spewing out those endless flames and burning the undead.\" He was indeed followed by a few of the Sun God religion\u0027s paladins and priests, but the Pope hadn\u0027t. In order to assert that Lee Shin Woo was conquering the dungeon of his own free will, the Pope remained behind, covertly directing his troops and supporting Lee Shin Woo. \"Is he level 8 by any chance?\" \"He\u0027s obviously level 8. Perhaps... Perhaps he\u0027s even reached level 9.\" \"Hey, you can\u0027t say that! What if His Majesty were to hear you!?\" He didn\u0027t know for sure, but the citizens of the Magic Empire spread rumors that the Emperor was level 9. And based on all the info he\u0027d gathered thus far, there was a high possibility that the Emperor was indeed level 9. So, calling someone level 9 was considered an act of treason, as it was essentially equating the individual with the Emperor himself. \u0027It\u0027s quite unreasonable, as it\u0027s not a unique title or anything... More importantly, the Undead Emperor must be level 9 if the Emperor on the surface is.\u0027 When he\u0027d first assessed Feotane Von Seldin\u0027s level, he assumed the Emperor would be level 9, and actually felt relieved at the news. He even thought he was lucky that he wasn\u0027t level 10. \u0027Putting aside the Emperors\u0027 strengths, the main issue is the curse.\u0027 When he\u0027d stopped the dungeon countercurrent, he felt a sense of foreboding, but of the dungeons he\u0027d conquered this time around, half of the bosses were undead. Some of the normal monsters would transform into the undead as well. If Jin hadn\u0027t sucked the death energy from them, then the paladins and the priests accompanying them might\u0027ve been affected. He felt as though half of the humans on the surface would become undead in just a few years rather than dozens of years, at this rate. He knew about this, so shouldn\u0027t the Emperor know about this as well? No, even an idiot would notice what was going on. If that\u0027s the case, then how would the Emperor react? No, how did he view the Underground Empire? Lee Shin Woo had to go to the capital, if for no other reason than to find that out. \"Sir Kay, are you going back home?\" \"No, I\u0027m going to the auction house.\" \"Ah, that\u0027s right. You were backing this auction.\" \"You never know what might happen, so we\u0027ll accompany you.\" One of the priests asked, and Lee Shin Woo replied nonchalantly and led Jin. Since news had spread that Lawrence was protected by the Sun God religion, there was a low chance of anything going wrong at the auction, but since this was the first \u0027main event\u0027 he\u0027d started on the surface, he\u0027d feel sad if he didn\u0027t witness it firsthand. Although the priests and paladins knew just how pointless guarding him was, as they\u0027d seen a glimpse of his strength by accompanying his dungeon conquests, it was still their duty, so they followed him quietly. \"Oh, it\u0027s already started.\" \"It\u0027s really big...\" They had originally planned to use the store building for the auction, but because so many people (it might\u0027ve been different if they were all peasants, but each and every one of them were high ranking aristocrats or the top business leaders) wished to participate, a huge auction house had been set up instead. What was most surprising was that the auction house was filled to the brim. When Lee Shin Woo stepped foot into the auction house, it was quite hot inside, so much so that he almost mistook it for the auction house burning down. [160,000 Perium! We have 160,000 Perium for this bottle of Kerr Century Elemental 451! Do we have 165,000!? Ah, we have 170,000 Perium! I repeat, we have 170,000 Perium!] Once he\u0027d entered the auction house, Lee Shin Woo heard the auctioneer’s resounding voice and wondered if he\u0027d misheard. He\u0027d sold a bottle to the Pope (at the special price) for 77,000 Perium. But what? One bottle is being sold for 170,000? \u0027I sold 1 liter of Kerr Century Dellocus 395 to Pleine for about 500,000 Perium, so a bottle (700 ml) should be worth about 350,000 Perium. Well, that\u0027s accounting for the steep premium due to its age. But what\u0027s going on...\u0027 Although he\u0027d revived the Kerr Century technique, he was only able to create the wine with an elf and the Dryads\u0027 help. But one bottle was being sold for 170,000 Perium? [We have 210,000 Perium!] Wait a sec. It just went over 200,000 Perium! [Ah, the first successful bid is 230,000 Perium! Please remain on edge, there are 49 more bottles left to auction off individually! After that, we\u0027ll be auctioning off at least 10 bottles at a time, so make sure you don\u0027t lose your chance!] Lee Shin Woo had prepared 1,500 bottles of Kerr Century Elemental 451 for the auction. He couldn\u0027t sell it all to one person, and he also couldn\u0027t sell them all individually, so the auction had become structured this way. He\u0027d been worried, wondering how it would turn out, but after seeing this, he realized how effective it was. In order to buy 10 bottles of Kerr Century wine, the buyer had to be extremely powerful. Following that logic, poorer buyers had no choice but to go for the individual bottles of wine. Because they had a limited supply of wine, whenever a bottle of wine was sold, the restlessness of the crowd would increase... In the end, the price of his wine increased exponentially. He\u0027d thought it wasn\u0027t a very good idea, but it was unexpectedly quite effective. Actually, if the product was good enough, then the seller could always raise the asking price. [330,000 Perium! Sold at 330,000 Perium!] While Lee Shin Woo was busy thinking, the fourth bottle of wine was sold for an additional 100,000 Perium. His contracted merchants had promoted the product and had even given wine tastings, but this had really far exceeded his expectations. Hey, wait a second. The last winning bidder was the Sun God religion\u0027s Pope! \"He\u0027s supposed to be sponsoring this event. What the hell is he doing?\" \"Perhaps he\u0027s sponsoring the event by buying it at such a high price...\" While Lee Shin Woo and the priests looked on vacantly, the auction began to heat up. Some of the participants grimaced at the increasing prices, but then, Lawrence\u0027s representative, Izuna (Ye Jin Jin) picked up one of the bottles. \"What a waste.\" \"Huh...?\" Of course, it wasn\u0027t up for sale, but a promotional item. Once she opened the top, the entire auction house was filled with the aroma of the wine, which meant that a magical device had been used. Lee Shin Woo took a whiff of the wine and even he was in awe of his product. It had been a long time since he\u0027d missed his sense of taste. \"T-This aroma... Ooh.\" \"Why did such a skilled winemaker have to go underground?\" \"Oh my god. Was this really made by a human?\" The wine\u0027s aroma had caused a huge commotion within the auction house, yet Ye Jin Jin, spoke calmly, unbefitting her. Of course, her voice resounded throughout the auction house as well. \"My magic device doesn\u0027t have the ability to magnify scents. This is simply the wine\u0027s natural aroma. Anyone who buys a bottle of wine is free to sample this promotional product.\" The effect was explosive. The flames of the auction had begun to die down, but her actions refueled the fires, causing all the participants to spend all their savings on the auction. After that, the winning bid for the fifth bottle of wine was more than 450,000 Perium, and the sixth had surpassed 500,000. It was madness. \"She\u0027s good...\" And Ye Jin Jin had been the orchestrator. He\u0027d trained her, of course, but she was the one who\u0027d intervened at just the right time. Anyone who\u0027d seen this wouldn\u0027t suspect her role as representative of the Lawrence shop. \"Sir Kay, the young silver-haired man sitting at the upper right is the Third Prince of the Empire.\" \"Even the Imperial family came. Though there\u0027s probably nothing I can learn from them...\" The Third Prince, who had likely come to figure out who was behind the Lawrence shop, had become intoxicated by the smell and was upping his bid. The high ranking nobles and the other high ranking priests of the other religious orders (who opposed the Sun God religion\u0027s sudden ascent in popularity) were no different. All these individuals, who each had their own reasons for coming here, had abandoned those goals and focused entirely on the wine. What a nice sight! \u0027Can\u0027t I gather all of the money on the surface with wine...? No, wait. I can get all this money without it, so why the hell am I posing as a hero!?\u0027 So much had happened that he hadn\u0027t expected, so Lee Shin Woo was dumbstruck. However, the auction continued on, and ultimately, he had sold all 1,500 bottles of the Kerr Century Elemental 451 for a whopping total of 670 million Perium. But the highlight of the event was Ye Jin Jin saying, \"We plan on introducing the Kerr Century Sparkling Elemental next season, so look forward to it.\" Once she said that, the participants began to fight desperately and scheme against each other so that they could participate in the next auction; it was something worth seeing, better than anything he\u0027d seen in the Underground Empire. \"Izuna.\" \"Sir Kay. I\u0027m glad you\u0027re alright.\" Once the auction was over and the goods were transferred, Lee Shin Woo found Ye Jin Jin and encouraged her. While they both looked after the Lawrence shop, Ye Jin Jin was Lawrence\u0027s representative and therefore knew she had to maintain a safe distance from Lee Shin Woo. However, she\u0027d managed to take care of everything quite well. \"Good work.\" \"You worked hard too, Sir Kay.\" She had already reached level 6 and looked much calmer than before. Perhaps her emotions had calmed down, as she knew that she was being helpful to him. He didn\u0027t pinpoint the exact reason, but he was satisfied, as Ye Jin Jin\u0027s condition seemed to have improved. Once he\u0027d looked around the auction house and confirmed that there was nothing amiss, he said. \"You can all go now.\" \"Sir Kay, when will the next auction be?\" \"I\u0027ve already told the Pope, but I\u0027d like to do it before things become worse.\" The auction had ended in a great success. Bisher Moon and Rem, both of which were in the capital right now, should be working together to create a foothold for him, and he had confirmed Ye Jin Jin\u0027s physical and mental growth, so... \"I guess I should go to the capital. On the way there, tell the Pope.\" \"Of what...?\" \"That I\u0027d like to start conquering level 7 dungeons.\" The priests simultaneously adopted an expression similar to Munch\u0027s \u0027The Scream\u0027 [1], but Lee Shin Woo just ignored them and hastened his pace. Then 20 minutes later, he got an unexpected report from Sinea. [1] E/N: https://i.imgur.com/nuPFwMz.jpg Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-203","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is.","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
