{"id":57646,"no":227,"title":"\u003cChapter 42. Sun God\u0027s Hero - 4\u003e","content":"\u003cChapter 42. Sun God\u0027s Hero - 4\u003e\n The Pope and the Evileye General had requested reinforcements from the other religious orders and the palace at the same time. However, the Evileye General delayed her reinforcements as long as possible; the Pope saw through her scheme and had asked the other religious orders for assistance in saving the hero Kay. Which turned out quite well for him.\n \"In the name of the Great God, we accept your call for help. It would be a waste to let the hero Kay die in a place like this. The Great God has also taken an interest in that man.\"\n \"You came, Bykel!\"\n It hadn\u0027t been long, yet the reinforcements from the Great God, Merciful God, and God of Life religions had come. They had probably come after weighing their own interests, but it meant they, like the Sun God religion, understood the severity of the situation!\n As proof of this, the Great God religion had sent their top level 6 Archbishop, Bykel Von Guraolit, while the Merciful God religion had sent their level 7 Paladin Leader, Maria Eldaletz, widely considered the Merciful God religion\u0027s deterrent against the 12 Generals. The God of Life religion had outright sent their entire Paladin order, which consisted of level 6s who specialized in defense.\n \"A level 8 dungeon... Now I\u0027ve seen everything. But I won\u0027t back down. Since the Merciful God will watch over all, even if they worship another God...!\"\n \"The God of Life is the same. His grace extends to all creation, and all living beings have the right to struggle until the end comes.\"\n \"Keuk.\"\n The Evileye General, Shurina Von Hegel, gritted her teeth as she saw the three religious orders ready to enter the dungeon without hesitation, despite it being a level 8 dungeon.\n If the level 7 Pope of the Sun God religion, as well as the Paladin Leader of the God of Mercy religion, worked together, then they might be able to save Kay from the level 8 dungeon! And if that happened, then the odds would be against the Emperor\u0027s side, or more specifically her, who was responsible for this area...\n \"Recklessly entering the dungeon is dangerous. As one of the 12 Generals who protect all the citizens of the Empire, I cannot let you enter the dungeon without His Majesty\u0027s explicit instruction, so long as it has become a level 8 dungeon!\"\n \"Sorry, but our hero is still fighting even now. We\u0027re just going to go in, save him, and come right out.\"\n \"You\u0027ll provoke the monsters inside more than is necessary if you go inside. You must go inside only after we\u0027ve established a line of defense!\"\n Those who heard her shook their heads. Her ability to escape reality was on the level of an innate skill.\n \"You\u0027re still uttering such nonsense. A line of defense? What do you think a line of defense will do against a level 8 dungeon!?\"\n \"What you\u0027re trying to do is so obvious that it\u0027s distasteful, Evileye General. If that\u0027s the case, then why hasn\u0027t the palace sent any reinforcements when it\u0027s so close to the capital? It makes no sense that our reinforcements arrived before yours when our religious orders are so far apart from each other.\"\n The Merciful God religion\u0027s Paladin Leader, Maria Eldaletz said harshly. Although the other religious orders weren\u0027t pleased with Kay\u0027s increasing fame, they decided to overlook it and agreed to work together in order to cut down the Emperor\u0027s authority.\n Moreover, there were rumors that Kay had become level 8, so someone as powerful as him may eventually be able to oppose the Emperor head-on. They couldn\u0027t lose someone so valuable here. No matter what!\n - Kwang!\n At that moment, the dungeon exploded. Those arguing were shocked and looked back. The dungeon began to collapse and the hot flames melted the ceiling, exposing the dungeon\u0027s interior.\n A giant firebird and giant were clashing against each other.\n \"T-That\u0027s...?\"\n \"The dungeon\u0027s collapsed!\"\n \"More importantly, those are...!? That giant bird and giant... what exactly are they...!?\"\n As they weren\u0027t within range of his Wild Card skill, they didn\u0027t see the countless greatswords; they merely saw the two of them confronting each other and igniting their flames. But that was plenty.\n \"T-The flames...\"\n \"They\u0027ve been sublimated. To the realm of the gods!\"\n The sight of the Dark Flame and Shining Flame clashing, exploding, and then vaporizing each other several times was overwhelming, regardless of whether they were fighting or not. The other religions, as well as the Evileye General\u0027s troops reacted similarly, but the members of the Sun God religion...!\n They, who could wield fire, albeit weakly, instinctively knew what the firebird and giant were, which shocked them.\n \"A greatsword! The size is different, but that\u0027s definitely what Sir Kay wielded...!\"\n \"Then is that giant Sir Kay!?\"\n \"Impossible. His flames have sublimated into something greater than mere flame. That\u0027s... the power of a god. Two gods are fighting against one another!\"\n \"Is that really... Kay...?\"\n He knew that Kay was strong. He also knew that Kay was hiding something. However, he\u0027d never thought that Kay was \u0027actually involved with the Sun God\u0027. The Pope just thought that Kay had some ulterior motive and was a clever individual that fit well with them. However...\n \"It\u0027s blinding. A truly blinding power... What else could you call that other than the sun?\"\n The Pope let his thoughts be known. Of course, Lee Shin Woo\u0027s Titan used Dark Flame as its main element, but he\u0027d added the Shining Flame that he\u0027d just acquired to his greatsword. And with his Dark Shadow, he had reversed the Dark Flame, coating both his greatsword and body in golden flames.\n Whereas the Garuda had, at first, expelled Shining Flame, but was now gradually being enveloped in darkness. It looked like it was currently encased in blackened flames. Their roles had completely flipped.\n \"Aaah.\"\n \"Sir Kay... He really was sent by God.\"\n \"How...?\"\n Even those from the other religions were speechless at the overwhelming sight. The Merciful God religion\u0027s Paladin Leader, Maria Eldaletz focused on Lee Shin Woo\u0027s transcendent element. As she was strong herself, she, more than the others, knew just how impossibly strong Lee Shin Woo currently was.\n And the Evileye General, Shurina Von Hegel was no exception. But the way she reacted was different from the others.\n \"A-Are the other 12 Generals not here yet!? No, one or two of them won\u0027t be enough to deal with that...\"\n \"There\u0027s no need to call reinforcements anymore, Evileye General.\"\n At some point, the Sun God religion\u0027s Pope had approached the panicking Evileye General. He was briefly captivated by the Titan, which exhibited greatness almost in line with the Sun God himself, but he got a hold of himself and looked more energetic than before.\n He was confident as he smiled at the Evileye General. It was the face of someone sure that God was by his side.\n \"Since it looks like Kay can deal with it himself.\"\n \"How foolish. That giant cannot be controlled by man! How can you be so sure that that giant won\u0027t attack us!?\"\n \"Haha. I suppose you can\u0027t see it. But we\u0027ve spent so much time with Kay that we see it clearly. Very clearly.\"\n \"That\u0027s impossible...\"\n That\u0027s right. Although he\u0027d changed into an enormous Titan, his moves were synonymous with Kay\u0027s, who they\u0027d spent more than a month with.\n It couldn\u0027t be controlled by man? No, if that were true, then they wouldn\u0027t need to be afraid. Since it would just be another powerful monster rampaging about. The reason they were in awe of Kay\u0027s new form was because he had full control of that tremendous power and was sublimating it with his own abilities. Kay had become the true master of that power.\n \"Oh Sun God, please grant your blessing to your loving children. And I thank you for your never-ending grace of sending him to us...\"\n After he\u0027d shut up the Evileye General, the Pope quietly prayed to the Sun God in thanks. No believer of the Sun God could bear witness to the sight and stay still!\n The Sun God\u0027s child was using His flames to exterminate the wicked flames that surged from beneath the ground, so they couldn\u0027t be a believer if they couldn\u0027t recognize their god\u0027s flames.\n \"Oh. Ooooh.\"\n \"Sir Kay is swinging his flaming greatsword... He\u0027s clashing with the firebird!\"\n \"R-Run away! The heat\u0027s spreading!\"\n \"Uaaaaaahk!\"\n The heat from the battle intensified. When the Garuda and Titan landed their final blows, the shock created a wavelength of mana that surpassed mere heat and spread throughout the entire area. However, they were completely oblivious to the fact.\n \"But this heat is...\"\n \"Uoh... Ooooh!?\"\n The others, aside from the Sun God religion, were shocked and avoided it, but the Sun God\u0027s devotees didn\u0027t move, as if they had been given a revelation from the Sun God himself.\n They couldn\u0027t oppose such heat... However, when they were struck by the heat, they started glowing with hot mana. The heat hadn\u0027t harmed them. Rather, it had stimulated their own mana and strengthened it!\n \"Fire is burning bright within my body.\"\n \"The Sun God is blessing us right now!\"\n \"No, this is Sir Kay\u0027s blessing...!\"\n Surprisingly, there were level 6 paladins and priests that grew to level 7 as a result. Three of them had leveled up at that! Those who hadn\u0027t found that their fire element and resistance had increased, and there were those who gained stats, a new title, and even a new skill!\n \"The Sun God.\"\n \"That man is undoubtedly the Sun God.\"\n \"Hoo...\"\n The Pope was no exception. While he hadn\u0027t leveled up, he had been stuck as a high rank level 7 for the longest time.\n But the heat had caused several skills to level up, and with his newly acquired title, his stats had increased significantly. He was shocked. He had long thought his advancement was hopeless, but now the path was wide open for him!\n \"Hoo. I\u0027m glad no one has died.\"\n While the members of the Sun God religion took control of their newfound power, the others were speechless at their sudden increase in strength, which had more than doubled collectively. Then, Lee Shin Woo came out from the explosion. Of course, this was after the Titan was released.\n \"Hello. I told you I\u0027d leave after I cleared the dungeon, but you called reinforcements anyway. You didn\u0027t need to.\"\n \"Haha. Hahahaha. You\u0027re right. You always say that, so I had no way of knowing whether you were telling the truth or not. So I ended up doing something I shouldn\u0027t have.\"\n The Pope couldn\u0027t help but laugh at the sight of Lee Shin Woo greeting him from atop a winged horse.\n The emergence of a level 8 dungeon, the advent of an absolute boss monster that couldn\u0027t be overcome, the giant that fought against it, and the flame of flames!\n The Sun God\u0027s believers had also awakened from just watching the mythical battle. Those were all unbelievable events, yet Lee Shin Woo, the source of all this, looked exactly the same as before.\n \"I\u0027ve never lied to you before. I\u0027m a bit sad that you thought that way.\"\n Lee Shin Woo\u0027s statement only caused the Pope\u0027s smile to widen further. He wanted to bow down before Lee Shin Woo but barely stopped himself. As he requested, the Pope decided to remain as a trader, an equal, and replied.\n \"Don\u0027t worry. I\u0027ll believe everything you say from now on. There\u0027s no one I trust more.\"\n \"Hoo. Good, that\u0027s plenty. And having an audience was kind of nice.\"\n Was the Pope satisfied? Lee Shin Woo grinned. Then, he nonchalantly dropped a bombshell that would surprise all the surface dwellers.\n \"I\u0027ve taken care of the tail end of the darkness that comes from the underground. You need an audience for a moment of history like this.\"\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-227","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is. \n","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
