{"id":57655,"no":236,"title":"\u003cChapter 43. Return - 6\u003e","content":"\u003cChapter 43. Return - 6\u003e He still had two pieces of loot left. One of them was the level 8 Sun Fossil, [1] which he\u0027d made before by using the Shard of the Sun Temple\u0027s Central Pillar. Lee Shin Woo wondered what he should do with this but ultimately used it on his Titan Core. Not only did the recharge time reduce by 2 weeks, but its growth (due to the Garuda\u0027s power) was accelerated as well. He touched it in satisfaction and turned his attention to the final piece of loot. This was the biggest issue here. It was just too good of an item. [Death God\u0027s Shining Bone Sword (+3)] [Lv8] [Durability: 5,000/5,000] [Attack Power: 2,500 - 2,750] [Element: Light Lv8] [Options: Strength +150, Magic +100, and when you attack, you sever your enemy\u0027s link between their Health and Magic] [Special passive skill: Smile of the Death God - When you are attacked or attack during battle, there is a high chance that the Shining Bone Sword will duplicate, which will automatically attack your foe. Once the duplicated Shining Bone Sword strikes, it disappears.] [Special active skill: Fury of the Death God - This ability can only be used by accumulating a large quantity of mana within the sword. Unleashes a slash at every foe within your sight, and severs all spatial and magical interference.] One might think that Lee Shin Woo wouldn\u0027t feel enthusiastic about the weapon, as he\u0027d given the Phoenix\u0027s Feather to Ye Jin Jin just a little while ago, but this was actually the first time he\u0027d ever gotten a level 8 weapon! As evidence of this, its attack power was ridiculously high, even when factoring in its evolution and the +3 tag. Plus, its max attack power was about 250 higher than his previous most powerful weapon, the level 7 Giant Drake Horn Lance. When he took into account the fact that the Death God\u0027s Shining Bone Sword could be wielded with one hand, while the Giant Drake Horn Lance required two and could only be used when charging, Lee Shin Woo could tell just how high-class this weapon was. \"If I fought the Emperor with this in hand, wouldn\u0027t I just win...?\" Lee Shin Woo briefly deluded himself, but soon shook his head. He wasn\u0027t sure about the Undead Emperor, but the Magic Emperor was no pushover. He could die if he was conceited. Even though he had 154 extra lives, it wouldn\u0027t change the gravity of death. \u0027Let\u0027s stop thinking about such pointless stuff and... absorb this.\u0027 His Bone Armory skill was now level 10. His weapons and armor were reinforced within his Bone Armory, as the equipments\u0027 info was shared with each other. In other words, if he were to absorb the Death God\u0027s Shining Bone Sword, then all of his stored equipment would be reinforced instantaneously! It was less burdensome to absorb equipment than bones, but absorbing such a high level weapon should take a lot out of him. Once he had prepared himself, he gripped the sword and absorbed it. [Storing the Death God\u0027s Shining Bone Sword in the Bone Armory. Strength has increased by 150 and Magic by 100. The Bone Armory skill has become Lv11, and Health and Magic have increased by 20. You can now summon and maintain twenty pieces of equipment at a time. All equipment stored within the Bone Armory have been reinforced.] [You can now summon the Lv7 Dead Bone Full Armor.] \"!?\" Lee Shin Woo had expected his Bone Armory to level up once he absorbed the Death God\u0027s Shining Bone Sword. Since this was his first time absorbing a level 8 artifact. But he didn\u0027t think his Bone Armory\u0027s summoning limit would double! When Bone Armory reached level 10, the skill had become much stronger, but Lee Shin Woo was shocked, as he didn\u0027t think one more level would make this much of a difference. By becoming level 8, Lee Shin Woo could use more mana at one time and could even draw in ambient mana, so this could be seen as his Bone Armory becoming two times as effective! Not only that, his armor set had been upgraded to level 7 as well. He had nothing else to ask for. Lee Shin Woo felt as though his Bone Armory skill was almost \u0027perfect\u0027 and shook. \"With this... Maybe I really should hold a ceremony for the Garuda... More importantly, are there no half-rotten mythological creatures in the Underground Empire?\" \"You\u0027re terrible.\" Jin, who\u0027d returned after becoming somewhat familiar with her new body and the light element, looked at Lee Shin Woo unkindly. Of course, Lee Shin Woo didn\u0027t pay her any mind and immediately swapped his armor. After that, he resummoned his Prayer of the Dead (the cape), which had become slightly stronger both in terms of its defense and subsequent properties. If he included Ye Jin Jin\u0027s javelin, then he had three slots used up right now. \"Alright. Then to fill up the other seventeen slots...\" He summoned two Giant Drake Horn Lances, two Fire Dragon\u0027s Scale Greatswords, two Light God\u0027s Fury, and two copies of the Titan\u0027s Fortress. After that, he summoned nine Death God\u0027s Shining Bone Swords and attached one of them to his waist. Lee Shin Woo\u0027s mana had bottomed out, as he had used so much at once, but by using his Mana Acceleration and Mana Bone skills, his mana was quickly replenished. Lee Shin Woo dominated the mana around him, which somewhat resembled the Archmage, Feotane Von Seldin. \"It would be a sight to see, shooting all the fully charged Death God\u0027s Shining Bone Swords.\" \"The fact that these weapons are going to be following us around everywhere is terrifying...\" Of course, charging level 7 and level 8 weapons was still an arduous task for Lee Shin Woo, but it would also be good mana practice for him. It would be his warm-up for his training in Manatization. \"Then, there\u0027s nothing else to do here, right? Jin, let\u0027s go inspect the troops.\" \"Inspecting the troops... What exactly do you mean by that?\" \"Moving a mountain with one finger, or making a tunnel, or setting up a barracks... You know, stuff like that.\" \"How are you going to move a mountain...? With a beam...?\" Lee Shin Woo climbed atop Jin, whose speed was incomparable to before (they both felt a bit awkward) and left the wine factory. They then went to one of the large cities (in the level 3 danger zone), where the Heaven Defying General\u0027s troops were divided and stationed, went down into the sewers, and checked on the condition of his troops. While he was on the surface, he had given his appointed commanders (the Giants\u0027 commanders were Ellata and Arogan, the Chimeras\u0027 commander was Chi Paul, and finally, the Avenger, Shino Rendu was the Paul Corps\u0027) orders to move around his troops in rotations. As they were undead, which didn\u0027t tire, there were a large number of bones gathered from each squad. [Lord Paul Zero, it seems like you\u0027ve become even stronger!] [That\u0027s not all. The power he\u0027s conveying is even stronger than before. The Titan has become even stronger!] [Ooooh. As expected of the Titan\u0027s second coming...!] [Look at me. I\u0027ve received the Titan\u0027s energy and can now wield flames!] \"You guys are no pushovers. I\u0027ll make you even stronger, so bring me all the bones you\u0027ve collected.\" The Giants were first. The conspicuously large Giants were forced to move carefully, killing everything in the area and then returning to hide within the sewers. Even so, they had collected the largest amount of bones amongst the squads. He used most of them to reinforce the Giants but kept the garbage bones to himself. Lee Shin Woo could always use them to either fuel the Heaven Door\u0027s Key or heal himself. Not only were they strengthened by Bone Reinforcement, but the reinforced Titan Core had strengthened the entire tribe once more. The Giants saw him off and Lee Shin Woo moved on to the next group. [Lord Paul Zero. I\u0027m glad you\u0027ve come back safely!] \"Yeah, I\u0027m glad you\u0027re safe too. You\u0027ve become a lot stronger, huh.\" Next up was Shino Rendu\u0027s squad, which consisted of the quickest of the Pauls. This squad was best suited for investigation or infiltration. They had found a hidden level 5 dungeon and had brought back a large number of elite bones. [I\u0027d like to become level 8 as soon as possible too...!] \"Don\u0027t be impatient. If you do your best, then you\u0027ll reach level 8 eventually.\" Shino Rendu, who thirsted for revenge, had inherited Metafel Rerdan\u0027s essence, and could thus develop his stats and skills separately without achieving a feat, using Bone Reinforcement, or leveling up his skills, by eating any monsters, including the undead. How much must he have eaten for him to possess an intermediate level 7\u0027s stats? Moreover, Lee Shin Woo had used only the elite bones to reinforce him, yet Shino hadn\u0027t had his fill. It seemed like he was excited by Lee Shin Woo\u0027s level up. \"What about the 12 Generals\u0027 movements?\" [Nothing much changed after my last report. But... we met the Annihilation Flame Sword God on our way back from a hunt.] \"The Annihilation Flame Sword God?\" Since coming to the Underground Empire, he\u0027d met several people with extremely chunni titles before, but this was the first time he\u0027d ever heard something as ridiculous as the Annihilation Flame Sword God. Lee Shin Woo tilted his head and Shino Rendu added. [He was definitely Seagald Von Retadane.] \"...Ah.\" As he thought. Seagald was one of the 12 Generals, so that must\u0027ve been the title he received from the Emperor. But he still had his doubts. It was way too much to give one of the 12 Generals a title like that. The Annihilation Flame Sword God? Would the Emperor really give one of his men the title of \u0027God\u0027? Lee Shin Woo felt like he\u0027d need to look into this further. But there was something more important than that to be done... \"So what happened? The fact that you\u0027re here means that he didn\u0027t kill you.\" [He asked us to join his troops, but I refused, saying that I already followed someone else. I was prepared to die, but surprisingly, he just let us go. I felt like he wasn\u0027t our enemy, for now at least.] \"...Yeah. As long as you came back alive, it\u0027s fine.\" When faced with an unbeatable foe, Lee Shin Woo\u0027s policy was to trick them and get out of there alive, but... It would\u0027ve been better had he gotten a spy to infiltrate Seagald\u0027s ranks. They had all survived though, so that was good enough. Lee Shin Woo tapped Shino Rendu\u0027s shoulder, who looked like he was saying \u0027I stayed loyal to you until the very end, Lord Paul Zero!\u0027. It seems like he\u0027s gotten smarter than before, but... perhaps this was as far as his intellect would go. [We exist for Lord Paul Zero!] [Uooooh! It\u0027s not Seagald who walks the righteous path, but Lord Paul Zero!] [Glory to Lord Paul Zero!] Moreover, Shino\u0027s Pauls were saying that they\u0027d follow Lee Shin Woo instead of General Seagald till the very end. They didn\u0027t even give Lee Shin Woo an opportunity to retort. Lee Shin Woo looked tepidly at Shino and asked. \"Did you hear anything out of the ordinary from him?\u0027 [He said that he could probably cooperate with you, Lord Paul Zero. He said that our enemies are the same.] \"Enemies, huh...\" He felt like he\u0027d heard that somewhere before. Now that he thought about it, it was the same thing that he, as the Heaven Defying General, had told the other heroes. He moaned automatically. In any case, so long as Seagald was aware of the Heaven Defying General, he would have an opportunity to meet with him in the not too distant future. Since Seagald\u0027s power was an unknown, he would have to approach him carefully. \"Alright. I may need your power soon, so rest up for now.\" [I understand!] Compared to the other squads, the golem squad had sustained more casualties, as they followed their master\u0027s orders to the letter. However, they were also easier to restore back to full strength, as they had brought back the cores. Once he\u0027d finished reinforcing the golems, he approached the Chimera squad. They had been using the underground waterworks of a city that bordered the level 4 danger zone as their base camp, and because their revenge was mostly focused on Arema Steelworker and the Emperor, they had been the most active. They also had some information they needed to share with him. [Arema Steelworker is on the move. He is heading towards the city in the level 4 danger zone... Bayran.] [1] T/N: I assume that this Sun Fossil and the Hands that Cover the Sun are equivalent. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-236","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is.","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
