{"id":57686,"no":267,"title":"\u003cChapter 49. Arranging the Stage - 1\u003e","content":"\u003cChapter 49. Arranging the Stage - 1\u003e\\n\\n Lee Shin Woo let the others rest (unlike before, the women complied, but considering the fact that Ye Jin Jin was shooting some kind of \u0027SOS\u0027 signal, something must\u0027ve gone down) and went to the Spirits\u0027 Spring with Dana. They were able to arrive quickly with the use of the Heaven Door\u0027s Key.\\n\\n \"T-This is...\"\\n\\n \"This is the Spirits\u0027 Spring. The real Spirits\u0027 Spring.\"\\n\\n \"The Spirits\u0027 Spring... I see, this truly is...\"\\n\\n The moment they entered, Dana realized that this was what she\u0027d been looking for. The Undead Emperor had tricked her into thinking that they were creating a paradise for the spirits, a place where they could relax and put them at ease. But this was the true Spirits\u0027 Spring! To think it existed on the surface!\\n\\n [Ah, the Contractor has arrived.]\\n\\n [It\u0027s been a while, Contractor. You\u0027ve gotten even stronger. I\u0027m always ready to fight.]\\n\\n [Someone tell her that he\u0027s here. The person she\u0027s been waiting for has come.]\\n\\n The spirits of the Spirits\u0027 Spring greeted him somewhat differently from the Dryads in the wine factory. The Dryads treated him as if he were their lover, their husband, or their father, but these spirits treated Lee Shin Woo as if he were their boss.\\n\\n \"Contractor...? You\u0027re contracted with this many spirits? Now that I think about it, I feel a faint connection between you and these spirits.\"\\n\\n Dana quickly noticed. How could he have formed a contract with several thousand spirits? She looked on in disbelief, but as she observed the spirits, she realized something even more astounding.\\n\\n \"No, wait. That\u0027s not it. Hero, did you form a contract with this entire space...?\"\\n\\n \"You (an Elementalist) catch on quick. You\u0027re right. I\u0027ve formed a contract with this space, the Spirits\u0027 Spring itself to be exact. It\u0027s less effective than forming a contract individually with each and every spirit, but... it\u0027s still a win-win.\"\\n\\n \"To think... that that was possible.\"\\n\\n She knew that Lee Shin Woo had done some amazing things, but of those achievements, this was the most surprising. Of course, she was already surprised about the fact that the Spirits\u0027 Spring even existed in the first place. But then...\\n\\n [Huh? That girl is...]\\n\\n [In terms of being an Elementalist, she\u0027s better than the Contractor!?]\\n\\n [Who exactly did the Contractor bring? Oh my god!]\\n\\n The spirits trickled in, one or two at a time, to greet Lee Shin Woo, but soon realized how skilled his companion was and were shocked. It was only natural. After all, she was the Underground Empire\u0027s greatest Elementalist.\\n\\n Lee Shin Woo was highly skilled in forming contracts rather than being an Elementalist, while Dana\u0027s ability to draw spirits to her was unmatched.\\n\\n The Emperor had bedded the most powerful of the exiled Elementalists, creating Dana in the process. She was born with high magic and a strong affinity with spirits! It was only natural that she would be loved by spirits. Moreover, by transforming her into an Immortal, she had gained the ability to use the darkness element. This allowed her to more easily form contracts with spirits.\\n\\n \"It\u0027s nice to meet you, everyone. My name is Dana.\"\\n\\n [A peculiar energy. She\u0027s not human, but something else. She\u0027s like us spirits.]\\n\\n [The contractor did something to her. If that\u0027s the case, then she is like us.]\\n\\n [Come in, friend of the spirits. We\u0027ll take you inside.]\\n\\n The spirits immediately swarmed Dana. Dana didn\u0027t know what to do and looked at Lee Shin Woo. He looked at her kindly and nodded his head.\\n\\n \"Go ahead and follow them. Since that was my intention from the very beginning.\"\\n\\n \"Hero...! I understand. Then, please excuse me for a bit!\"\\n\\n Dana bowed at Lee Shin Woo while looking overjoyed and went inside the cave with the spirits. Once he\u0027d given her away to the spirits, the Elder Dryad Princess Sinea appeared behind him and hugged him. It felt like she was hugging him tighter than normal; maybe he was imagining things.\\n\\n [Paul Zero, who\u0027s that pretty lady? I smell your scent on her.]\\n\\n \"Sinea, not you too. I\u0027m getting tired of it.\"\\n\\n [S-Sorry. That wasn\u0027t my intention... Are you tired? Come here, I\u0027ll give you a lap pillow.]\\n\\n While Dana was enjoying herself with the spirits, Lee Shin Woo rested on Sinea\u0027s lap. Her soft and refreshing scent really made him want to unwind and just keep resting.\\n\\n Of course, he didn\u0027t come here just to rest. He was able to assess the state of the spirits here through Sinea, who had taken over command of the Spirits\u0027 Spring as Zenon was still outside travelling with Ye Jin Jin. And he also briefly explained his plans from now on.\\n\\n [Will it go well? They\u0027re really strong.]\\n\\n \"If the stage is set properly. I\u0027m preparing just in case that doesn\u0027t go well, so don\u0027t worry. All you need to do is do your best.\"\\n\\n [I\u0027m ready to whatever you need me to do, Paul Zero. I\u0027m just... worried about you.]\\n\\n \"That\u0027s why I\u0027m preparing so much. And...\"\\n\\n Lee Shin Woo pointed at Dana, who was chatting and laughing along with the spirits.\\n\\n \"She\u0027s a good person. I\u0027m not good enough to command the spirits of the Spirits\u0027 Spring, but Dana should be able to draw more power from them than normal.\"\\n\\n [Are you going to make her form a contract with the spring?]\\n\\n \"Yeah.\"\\n\\n Lee Shin Woo\u0027s contract with the Spirits\u0027 Spring was very irregular. However, something that happened once could happen again. Thus, Lee Shin Woo would personally connect Dana, the princess who was universally beloved by spirits, and the Spirits\u0027 Spring together, allowing her to control the power of the spirits here.\\n\\n He had enough on his plate already, so it wasn\u0027t a good idea for him to command the spirits as well. So Dana\u0027s timing couldn\u0027t be better, as she had a strong affinity with spirits.\\n\\n [It can\u0027t be helped, I suppose. She seems capable of commanding the Spirits\u0027 Spring too...]\\n\\n \"If we add her power into the mix, then the spirits should no longer have to fear the undead curse. Since that\u0027s the base of her species.\"\\n\\n [Paul Zero, you did something incredible somewhere else again, didn\u0027t you?]\\n\\n \"Mm. I\u0027ll start telling you now.\"\\n\\n [Oh my. Hoo, hoo.]\\n\\n Lee Shin Woo noticed that Dana wouldn\u0027t be free of the spirits for a while, so he drew Sinea towards him. She obviously didn\u0027t resist. That sweet repose lasted another hour.\\n\\n \"Will I... really be able to do it?\"\\n\\n \"Think of it in more simple terms. I\u0027ve already formed a contract with the Spirits\u0027 Spring, and I\u0027ve formed a contract with you as well. It\u0027ll be easy to form a contract between you two.\"\\n\\n \"I\u0027ll form a contract with the Spirits\u0027 Spring... Me...\"\\n\\n After he\u0027d explained everything to her, Dana looked around the Spirits\u0027 Spring with bright eyes. He thought she would jump at the opportunity, but she seemed more deeply moved than he\u0027d expected. It felt like she could survive off spirits, rather than three meals a day.\\n\\n \"I see. So I will command this place together with you, Hero...\"\\n\\n [I\u0027m here too. Take care of me, Dana.]\\n\\n \"Keuk...\"\\n\\n Dana briefly glared at Sinea, who was still clinging onto Lee Shin Woo, but she still couldn\u0027t give up the opportunity that Lee Shin Woo was giving her. On the contrary...\\n\\n \"Alright. I\u0027ll be in your care!\"\\n\\n \"Ah, she\u0027s acting strange too. Why am I surrounded by weirdos?\"\\n\\n She\u0027d already made up her mind, so no matter how many rivals she had, she wouldn\u0027t lose! Dana shook Sinea\u0027s outstretched hand. At that moment, the Spirits\u0027 Spring reacted to her and began to brighten. The spirits within the Spirits\u0027 Spring did the same.\\n\\n [The Spirits\u0027 Spring is growing!]\\n\\n [Aah. Aaaaah.]\\n\\n [She\u0027s a descendant of one of the exiled Elementalists!]\\n\\n [We need to embrace her.]\\n\\n [We\u0027re so thankful that she came to lead us.]\\n\\n [The Spirits\u0027 Spring is so happy. The traces of the past contractors within her are resonating with us.]\\n\\n In a way, they were a lot happier than when Lee Shin Woo had formed a contract with them... He watched on unhappily; the light intensified and was eventually absorbed by Dana.\\n\\n She began to open her eyes slowly. Her golden eyes showed more life in them than before; radiating with various elements and magic.\\n\\n \"It\u0027s been a long time since I\u0027ve felt like this. I didn\u0027t think a day like this would come... It\u0027s all because of you, Hero. You so easily gave me back everything that I\u0027d lost.\"\\n\\n \"It\u0027s a coincidence. My ability was just good.\"\\n\\n \"Hero...\"\\n\\n Lee Shin Woo answered brusquely and realized that perhaps this was the core reason as to why she liked him so much. If she were alone, he would\u0027ve accepted her without hesitation...\\n\\n \u0027Well, that\u0027s that. Since it\u0027s best if I leave her like this for now.\u0027\\n\\n He knew that human emotion could yield immeasurable power. Of course, Lee Shin Woo wasn\u0027t going to just leave them (the women) like this.\\n\\n He couldn\u0027t understand why they liked him so much, but since they did, he could stimulate those emotions and use them to help them survive and kill the Magic and Undead Emperors.\\n\\n In the process, he\u0027d have to go through the trouble of taking care of any improper emotions, but he could deal with that later so long as they could make it through the battle. That was Lee Shin Woo\u0027s true intentions.\\n\\n \"...Huh? Ah.\"\\n\\n Lee Shin Woo had such a Joker-esque thought, but soon realized that Dana and all the spirits were staring at him. Sinea had probably explained his plans to them. He nodded his head and said.\\n\\n \"The time for your revenge is nigh. Did you hear? The spirits underground were sacrificed in vain. You have no allies underground nor on the surface. Ultimately, you have to save yourselves. It\u0027s almost time. ...You must create a place where you can live with your descendants yourselves. Can you do it?\"\\n\\n [Of course.]\\n\\n [I\u0027ve been waiting for you to say that.]\\n\\n [I\u0027ll cultivate a place like this, so that spirits like us can live peacefully, even if I have to risk my own life to do so!]\\n\\n \"Good. Then break it up. Prepare yourselves.\"\\n\\n After he\u0027d formed a contract between Dana and the Spirits\u0027 Spring, Lee Shin Woo parted ways with Sinea, who was weeping and clinging onto him, and returned to his house. The ragged Ye Jin Jin and the other angry women greeted him.\\n\\n \"Did you guys fight?\"\\n\\n \"We just drank some tea. ...Would you like some too?\"\\n\\n \"It\u0027s not some radioactive tea or something, is it...?\"\\n\\n \"Heuk, heuk. Mr. Shin Woo.\" [1]\\n\\n It was such a relief that Sinea wasn\u0027t here too. Ye Jin Jin hugged him and he began comforting her; this situation was ridiculous.\\n\\n If he slept with her that anger of theirs would probably spread to him as well, but... he couldn\u0027t leave a customer unhappy. Plus, he\u0027d have to increase her burden in the future.\\n\\n \"Then, rest up. I have something else I have to talk to Ye Jin Jin about.\"\\n\\n \"Something to talk about? Are you really just going to talk?\"\\n\\n \"No, I\u0027m going to do other stuff too.\"\\n\\n \"Keuk...!\"\\n\\n \"This is why men are...!\"\\n\\n \"A bad man. So cool.\"\\n\\n That night, Lee Shin Woo explained what would happen soon, as well as what she would have to do on the surface.\\n\\n Not only had she risen to level 7, she\u0027d also grown immensely in such a short time, so she was definitely qualified to handle things here.\\n\\n Ye Jin Jin couldn\u0027t readily believe what he was saying, but she ultimately nodded her head. The edge of the javelin he\u0027d given her was still sharp.\\n\\n \"Junior, I\u0027ll do my best here! I really like the Sun God religion!\"\\n\\n \"It\u0027s great that you like them and all, but please be wary of the pope. After all, he covets talented people.\"\\n\\n Prince impersonated a priest of the Sun God religion, and Dana temporarily stayed in the Spirits\u0027 Spring to get familiar with the spirits there. Now, he was done with everything he needed to do here.\\n\\n The next day, the party did some light shopping and then returned underground.\\n\\n \\n\\n \\n\\n [1] T/N: Heuk, heuk is equivalent to \u0027boo hoo\u0027 or sobbing.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-267","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is. \\n","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
