{"id":57422,"no":3,"title":"\u003cChapter 1. Reinforcement Hero - 2\u003e","content":"\u003cChapter 1. Reinforcement Hero - 2\u003e \n The moment he used his Bone Reinforcement skill, the skeleton\u0027s arm bone flickered with a weak flame and oxidized in the air, followed by a stinging feeling in his left arm. \n [You have reinforced your arm bone. Strength has increased by 1. Absorbing a portion of the Skeleton Soldier\u0027s memories and experiences.] [That spear isn\u0027t meant to be swung like that. Look. Though it may look like this, this is the spear technique that was taught to me by the strongest general of the Empire, General Leofield.] \n And that was it. \n \"...\" \n Um, alright. He didn\u0027t have high expectations from the get-go. On the contrary, he should be happy that his strength permanently increased by 1. He didn\u0027t know how long it would continue to increase his stats by 1 whole point, but if he put in the effort, step by step, he should be able to at least confront a Skeleton Soldier and win easily. Lee Shin Woo did his very best to appease his disappointment, grabbed the spear on one side, and stood up. However, at that very moment, he felt as if something had changed. \n \"Mm...?\" \n Did the spear change? No, that wasn\u0027t it. He himself had changed. Like he had done thus far, he grabbed the spear without thinking, and at that very moment, he was suddenly overcome with the thought that this wasn\u0027t the proper way of wielding a spear. If he wielded it like this, the spear would only be as effective as a club. In order to use a spear like a spear, he would need to hold it properly. He followed his instincts and changed his grip on the spear. Somewhere in that posture lay a similarity to the Skeleton Soldier\u0027s own. \n [Passive Skill, Beginner Spearmanship Lv1 has been learned.] \n \"...!\" \n At that moment, Lee Shin Woo\u0027s (nonexistent) eyes widened. He had learned spearmanship from just absorbing the Skeleton Soldier\u0027s memories of handling a spear! If that\u0027s the case, if he were to obtain another\u0027s bones who learned a different skill, wouldn\u0027t that mean that he\u0027d be able to learn that skill as well? His evaluation of the Bone Reinforcement skill drastically changed for the better. \n \u0027Good, I can accept this...\u0027 \n If he had a normal human body, he wouldn\u0027t even be able to dream of reinforcing his body through bones. The resurrection through his Invisible Heart was, of course, the same. These two skills were so powerful that he had no choice but to accept that he was a skeleton. If he had, at first, been like \u0027even so, how could you turn me into a skeleton, you necromancer bitch!\u0027, then now he was like \u0027now that it\u0027s become like this, I\u0027ll become the strongest skeleton!\u0027. Lee Shin Woo swung the spear a few times and nodded his head in satisfaction. \n \u0027My spearmanship\u0027s still lousy, but I can at least stab decently now.\u0027 \n He hadn\u0027t learned any martial arts before, but he could tell whether his motions were proper, or a mess. Since he had swung the spear in the desperate battle to his heart\u0027s content, he felt that the force behind his swing was incomparable to before. \n [Over there... Newbie...?] \"Yeah, newbie here! Good morning!\" \n Of course, Lee Shin Woo wasn\u0027t confident that he\u0027d be able to overpower a Skeleton Soldier in a frontal assault, so he acted like a merry skeleton when a new patrolling guard appeared, and slowly walked towards it. The Skeleton Soldiers here seemed to really like newbies, as they all greeted him without any suspicions. He was quite thankful for that. \n \"Nice to meet you, Paul!\" [My name\u0027s not Paul, but... it\u0027s nice to meet you...!] \n \u0027The quest comes later. For now, let\u0027s not leave this area, and grow in strength.\u0027 \n He greeted the Skeleton Soldier, and the tip of his spear flashed, falling diagonally. And thus, the Antlion of the external passageway was born. \n [T-Traitor...] \"It\u0027s unfortunate that you couldn\u0027t remember your past life, Paul. We were the best of friends...\" [Keuhak!] \n Lee Shin Woo stabbed the skull of the 138th Paul with his bone spear as hard as he could. The thickness and strength of his bone spear was incomparable to normal bone spears, and that bone spear cleanly smashed the skull of the 138th Paul. It left behind a bone, a bone spear, as well as 10 Perium before disappearing, just like the other Paul’s. \n \"Oh, this time it\u0027s a leg bone.\" \n It wasn\u0027t like all Skeleton Soldiers left behind arm bones. After experimenting over 100 times, Lee Shin Woo was able to conclude that they dropped an arm bone, a leg bone, or mixed bones (the description explained that it was a bone of unknown origin). Amongst these, the mixed bones was a dud that didn\u0027t increase stats, nor did it contain any skills, while the arm bone increased his proficiency in spearmanship and the leg bone... \n [You have reinforced your leg bone. You have acquired 5% proficiency in the skill, Beginner Sprint.] [No, I said now\u0027s not the time to be swinging a spear! Goodness, there\u0027s really an epidemic coming, I tell you! I\u0027m getting out of here first! Different from you guys, faster than anyone! - A nameless soldier] [The Beginner Sprint skill has become Lv3. Your sprinting speed has become slightly faster.] \n \"Nice.\" \n They had the effect of bestowing proficiency in the Skeleton Soldier\u0027s sole movement-type skill, Sprint. This skill allowed for a momentary, lightning-fast sprint, and was a skill that consumed a large amount of stamina, but to the undead which possessed the race characteristic of \u0027never tiring\u0027, it was a great skill he\u0027d be able to use again immediately after the skill delay. \n \u0027Anyway, my stats didn\u0027t increase again. Should I really get going now?\u0027 \n Arm bones and legs bones, not mixed bones, would originally increase strength or agility by 1 each time he reinforced them, but at some point, the frequency of that growth had decreased, and now his stats wouldn\u0027t rise even after absorbing 10 bones in a row. Though he had wanted to move after raising both his strength and agility to 100... Lee Shin Woo clicked his nonexistent tongue and checked his status. \n [Lee Shin Woo] [Normal Skeleton Blessed by God] [Lv - 1] [Strength - 57 Agility - 46 Health - 34 Magic - 6] [Passive skills - Invisible Heart Lv2, Beginner Spearmanship Lv3] [Active skills - Bone Reinforcement Lv1, Beginner Sprint Lv3] \n \u0027They\u0027re higher. They\u0027re definitely higher, but...\u0027 \n There were three things he wasn\u0027t satisfied with. First off, mixed bones weren\u0027t effective in improving his stats, which resulted in his health stat being lower than his strength or agility. He also hadn\u0027t found a way to increase his magic stat, nor did he know how to use it. Lastly, he was still level 1, despite hunting down so many Skeleton Soldiers. \n \u0027At this point, I might not be able to increase my level through normal hunting.\u0027 \n Certainly, the Skeleton Soldiers he had killed up until now had been much too strong, despite being level 1, and each Skeleton Soldier was different from the last. The fact that they were all level 1 was evidence that it wasn\u0027t easy leveling up in this world. \n \"All the more reason to level up at least once before moving forward, but... I suppose it can\u0027t be helped. Let\u0027s move on to the next step.\" \n Since he had moved around the passageway while hunting, he knew the approximate location of the hideout. He had felt an obviously disparate energy leaking from a crack in the corner of the passageway. He was sure, since the skeletons unconsciously avoided it, as they could feel the divine power within. \n \u0027Ah, before that.\u0027 \n He had a job to do before he got going. It was to upgrade his bone spear. \n [Would you like to sacrifice the Lv1 Bone Spear to reinforce the Lv1 Bone Spear (+9)?] \n \"Hoo...\" \n When Lee Shin Woo saw the message asking yes, or no, he took a short, deep breath. His hands trembled. He couldn\u0027t help but do so when he recalled the process of creating the Bone Spear (+9), as well as the several bone spears that went into making it. That\u0027s right. Unlike normal reinforcement, bone equipment reinforcement had a failure rate. Of course, even if the reinforcement were to fail, the performance of the equipment wouldn\u0027t drop, nor would it be damaged, but whenever he saw the bone spears disappearing for nothing, his heart would ache. Not that he had one. \n \"Ugh, reinforce...!\" \n But what could he do about it? Even though he realized, in his heart, that it\u0027d be more profitable to reinforce his bones rather than the spear at this point, he still couldn\u0027t give up! Since this would be the last Skeleton Soldier he\u0027d kill in the passageway anyway, he would let the spear cleanly oxidize for the last time and burn his own lingering attachment as well! \n [The reinforcement has succeeded. The Bone Spear has become Lv2.] \n ... was what he was thinking when the reinforcement succeeded. Moreover, the Bone Spear had leveled up before him as a result! He might have to call it Lord Bone Spear, rather than Bone Spear now. \n \"Ooooooh!\" \n Lee Shin Woo was deeply moved, cried (he couldn’t), and observed the reborn Lv2 Lord Bone Spear. The spear shaft had become around thirty centimeters longer than before, and the impressive blade gleamed with a menacing light. \n [Bone Spear] [Lv2] [Durability: 500/500] [Attack Power: 25 - 45] \n \"Oooooooh.\" \n The maximum attack power of the Lv 1 Bone Spear (+9) had been 30, but a single reinforcement had increased it by 1.5x all at once. Not to mention the increase in durability. As expected, his investment into his weapon had paid off. Lee Shin Woo rubbed his skull against the Lv2 Bone Spear\u0027s sleek handle, emitting a squeaky sound, and was satisfied. Since he had earned the Lv2 Lord Bone Spear, he had nothing to fear anymore! \n [An unforeseen quest has occurred!] \n At that very moment, a quest had occurred. Lee Shin Woo quickly began to resent Lord Bone Spear. \n [Ambush of the Treasure Eater] [Among the undead inhabiting the underground empire is a race called the Treasure Eaters that like to eat objects with magical energy within them. Normally, there isn\u0027t anything that piques their interest in the external passageways, but the Lv2 item that you have created ended up stimulating one of the Treasure Eaters\u0027 senses. It\u0027s much stronger than a normal Skeleton Soldier to the point that it\u0027s incomparable, but if you defeat it, you may be able to gain the treasure it has eaten.] [Quest Reward: The Treasure Eater\u0027s treasure?] \n [Guoooooooooh!] \n The moment that quest notification appeared, he heard a shriek from far beyond the passageways. At the same time, he heard something collapsing. There were also a few Skeleton Soldiers\u0027 screams mixed in as well. \n [Kuaooooooh!] \n The sound was coming closer by the second. A human... no, a skeleton... had just adapted to the situation, yet a new trial appeared as if to interfere with that adaptation. Perhaps that Treasure Eater didn\u0027t appear naturally, and had been sent by God herself to torment him? All sorts of doubts momentarily rushed through his mind, but the most important thing right now was deciding his course of action. Lee Shin Woo double checked the location of the hideout and quickly moved. First, he planned to check the Treasure Eater with his own two (nonexistent) eyes, and fight if it seemed doable. \n [Treasure Eater - Lv2] \n [Kuwoooooh!] \"Nope, I gotta run.\" \n But when he saw the bug that had broken through the passageway floor, Lee Shin Woo decided to run without hesitation. That thing\u0027s the same level as Lord Bone Spear! The moment he decided to flee, he activated his Sprint skill and ran towards the hideout. However, at that very moment, he got an announcement out of the blue. \n [Quest failed! However, the minimap has been added as a reward to the unforeseen quest.] \n \"What...?\" \n The warm light that leaked between the cracks in the passageway immediately disappeared. The implication was so clear that he wanted to cry. Hideouts could disappear!? Lee Shin Woo abruptly stopped and grit his teeth, and soon, the Treasure Eater had gotten close, greeting him by opening its mouth wide. \n [Kuhaaahk...!] \"Hi, Steve...?\" [Kuheeehk!] \n He did his best to greet it like a cheerful skeleton, but it seemed like it didn\u0027t like the name, Steve. Lee Shin Woo shrugged his shoulders and gripped Lord Bone Spear. It was another fight. \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stop-friendly-fire/sff-chapter-3","bookId":1511,"book":{"id":1511,"title":"Stop, Friendly Fire!","description":"The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is. \n","cover":"http://cunovel.com/img/SFF.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stop-friendly-fire","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:20 AM"}}
