{"id":88924,"no":19,"title":"Page 19","content":"“Oh, and I’ll go ahead and tell the police in Deadhorse that you’re coming. I want to tell them about the Coben brothers meeting Harrington, anyway. His death was ruled accidental, but they still might want to talk to the brothers. How long are you planning to stay? If you don’t mind, I’ll take some time off and show you around.”\n “That would be great—”\n “You’ll want to see where Harrington was camped, won’t you?”\n “Yes,” she said. “And while I’m up there, I’ll need to go to Barrow. My boss wants me to write a couple of articles about the high school football team he heard about.”\n “Barrow isn’t a hop and a skip away. You’ll have to fly there, but I can arrange that for you. You’ll fly right over the accident site,” he added. “You know, where Barry…”\n Snacked on William Harrington? “Yes, I know,” she said instead.\n He mentioned several other places he thought she should see while she was in the bay, as he called the massive northern area of the state. Umiat, the Topagoruk River, and Alaktak were just a few. She couldn’t spell the names let alone pronounce them, but Paul was familiar with all of them.\n “You’re going to see the Arctic Ocean. That alone is worth the trip.”\n Paul made it sound like such an adventure. Time to get educated, she decided. She still didn’t know much about Alaska. She went to her computer and started reading. The north shore fascinated her. Nights that lasted over fifty days, winter winds that could pick up a man and toss him around like tissue paper, and temperatures that could drop as low as 60 degrees below zero. Who in his right mind would live there?\n She called a travel agency to find the best way to get to Prudhoe Bay. After making her reservation, she called Paul Larson’s phone. It went right to voice mail.\n “Paul, this is Sophie Summerfield,” she said. “I’ll be on flight 459, Wednesday, five p.m. See you then.”\n She had much to do before leaving Chicago. Gathering all the folders into a pile, she stacked them on her dining room table and went to work on one of her assigned newspaper articles. When she finally turned off her computer, it was past midnight.\n Her mind was filled with images of Alaska, but when she finally curled up in bed and closed her eyes, her thoughts turned to Jack MacAlister and the kiss. That frickin’ kiss. Big, big mistake. Definitely. So how come she wanted to make the same mistake again?\n THE SECOND MISTAKE SHE MADE was forgetting about the gossip grapevine. Gil picked her up the next morning. He was her designated driver to the doctor to have her stitches removed, and on the way home she casually mentioned her travel plans. He seemed genuinely interested and asked a lot of questions about the places she hoped to visit.\n By the end of the day, Gil had a new name: Big Mouth.\n She hadn’t been home more than an hour when the phone calls started. She heard from Regan; Regan’s brother Aiden, who was calling from the airport while he waited for his flight home, which meant that Regan had already squealed to him; and she heard from Cordie, who had to limit her tirades to coincide with the five-minute breaks between classes. It took her three phone calls to finish.\n Sophie took the are-you-crazy calls in stride until she heard from Alec. Regan had obviously convinced her husband that it was his duty to keep Sophie from doing anything rash. He told her flat out that she couldn’t go. She didn’t get angry. She laughed and then reminded him that she would do whatever she wanted as long as it was legal. Then she lied. She told him she hadn’t made up her mind to go to Alaska and promised that he would be the first to hear, once she made the decision.\n Alec wasn’t buying the lie. He’d known Sophie a long time now and understood how her mind worked. He’d bet a month’s salary she already had her airline reservations, and just for the hell of it, he checked. He was right.\n He knew he couldn’t stop her, but he hated the idea of her going alone. Harrington had ended up stranded in the middle of nowhere, and he didn’t want that to happen to Sophie, too. It didn’t matter that Harrington’s death was ruled an accident. There was still something sinister in play, and knowing Sophie, she would want to find out what it was.\n Alec knew he could request assistance from the FBI office in Anchorage, but they couldn’t give Sophie twenty-four-hour protection, and she wouldn’t allow it anyway. Since he had married Regan, both Sophie and Cordie had become like sisters to him. Cordie was the more reasonable and practical of the three friends; Sophie, though sweet and charming, was the daredevil. She always ended up fighting for the wronged and the forgotten, and, despite the risk, usually she got them the justice they deserved. Sophie, he’d learned, was all about fairness.\n Alec didn’t care how Sophie felt about it. Someone had to go with her, and there was only one person he could think of who had the time and the mettle. He also had a gun and a badge, and both would certainly come in handy.\n Jack was the man for the job. Convincing him was going to require a little finesse and a whole lot of manipulation.\n Only one way to make it work. Emergency poker night.\n JOURNAL ENTRY 493\n ARCTIC CAMP\n Brandon and Kirk have returned home, and they believe Eric and I will be leaving the facility in the next few days.\n They are pleased with their work with the pack, and Brandon has become quite attached to this family. He is sorry to leave them, but he fully expects to see them again next year.\n Eric and I had our work cut out for us after they left. It took some time to locate all the wolves that were injected with K-74. They all seem to be as lively as when we last saw them. None has aged much at all.\n Too bad we had to end their lives while they were still in their prime, but a more thorough analysis is called for to determine the effect of K-74 on a cellular level.\n The most remarkable discovery we’ve made thus far is that the more stress an organism undergoes, the stronger and more youthful he becomes. How is this possible?\n TWENTY\n THEY WERE ALL IN ON IT.\n Gil couldn’t wait to brag. “I’m telling you, you should have seen Sophie. She split Wicker’s lip wide open, and I think she might have broken his nose. I sure hope she did. The scumbag howled like the mangy dog he is.”\n Gil sounded like a proud uncle boasting about a goal one of his nieces had made at a soccer game. He had just taken his seat at the poker table and was recounting the incident at Harrington’s apartment to the poker regulars: John, Alec, Jack, and Zahner.\n “Don’t mess with our Sophie,” John said. “She’ll take you down every time. Aiden made sure she and Regan and Cordie all knew how to take care of themselves.”\n Everyone at the table smiled and nodded, everyone but Jack. “That son of a bitch hit Sophie? Where were you, Gil? Why didn’t you stop him?”\n “Sophie didn’t need my help. By the time I was halfway across the room, she had already let him have it. It was funny how she did it, too. She put her hand right up in front of his face, then slowly made a fist, staring him in the eyes the whole time—”\n “She have rings on the hand she fisted?” John asked.\n “Sure did.”\n “Good for her. Do more damage when you’re wearing rings.”\n “Yeah,” Zahner agreed. “Have enough rings on, and it’s like you’re wearing brass knuckles.”\n “Okay, so Sophie made a fist…” John prodded Gil to continue.\n “She’s about two, maybe two and a half, feet away from him, and he’s wearing a real smart-ass expression, and then—bam!” Gil paused to smack his right fist into the palm of his left hand. “She goes straight at him. No swinging her arm up in an arch giving him time to duck. Nope, just straight on…hard…as quick as a cobra.”\n “She should have gotten him in the crotch,” Zahner said. “I always tell my girls, kick them in the crotch.”\n “What girls would those be?” John asked.\n “The working girls I’m trying to get off the street.”\n “You sound like a damned pimp,” Alec remarked.\n Zahner wasn’t offended. In fact, he had a good laugh. “I’d make a whole lot more money if I were.”\n “What the hell, Zahner?” Jack asked. “When did you get the gold tooth?”\n “It’s a snap-on,” he said. “My girls love it.”\n “Enough with the girls,” John said, chuckling.\n Alec’s brother-in-law, Aiden Hamilton, walked into the room just as Jack asked, “Is Sophie okay? Did that bastard hurt her?”\n “Someone hurt Sophie?” Aiden asked as he removed his suit jacket and casually draped it over a chair.\n “She’s fine,” Gil said, and then proceeded to tell the incident once again.\n When he was finished, Aiden asked, “Are the police going to be knocking on her door?”\n “No worries about that,” Gil told him.\n “Possibility of a lawsuit?” he asked.\n “Don’t think so,” Gil said.\n “What are you, her surrogate father?” Zahner asked Aiden.\n Alec answered. “Aiden was Sophie’s unofficial guardian for a while. He wasn’t quite twenty-two when he petitioned the court. Did you ever make that legal?” he asked.\n “What does it matter now? She’s over twenty-one,” Aiden pointed out.\n “I don’t get it,” Zahner said. “She has a father.”\n “Yeah, but he was a wanted man back then. Sophie could have gone into the foster care system if Aiden hadn’t stepped in,” Gil said.\n “Are you playing poker with us tonight, or are you just stopping by to say hello?” John asked.\n Aiden rolled up his shirtsleeves and smiled. “I’m playing.”\n A collective groan went around the table. A card shark, Aiden rarely lost.\n He pulled out a chair and sat. “You boys ready to lose your money?” He looked at Jack, then glanced over at Alec and gave a barely noticeable nod.\n The con was on.\n JOURNAL ENTRY 498\n CHICAGO\n We haven’t quite defined the correlation between stress and the effectiveness of our serum, but it appears that the adrenaline produced in a stressful situation can exponentially increase the potency of the drug.\n It is time to move to primates. Keeping our work a secret is the real challenge.\n TWENTY-ONE\n MARGARET PITTMAN CALLED JACK TO HER OFFICE FOR A sit-down. He passed Alec on his way, and from the sympathetic expression his partner gave him, Jack knew he was going to be hearing some unpleasant news.\n Nothing could be more unpleasant than where he was being forced to go, thanks to the poker bet he’d lost. Alaska may be a beautiful wilderness, but he couldn’t even say the name of the state without mentally shivering. He hated the cold. Always had, always would.\n As it turned out, Pittman also wanted to talk about his leave of absence. Wanting to get him away from the media, she had approved his vacation plans, but now he was asking for something different.\n By the time he finished explaining where he wanted to go and why, including everything he had learned about William Harrington, Pittman appeared interested. A little too interested, he thought, which put him on guard.\n “Uh-hum, uh-hum, I see, I see,” Maggie said briskly. “You want to start your leave today, and you’re going to northern Alaska?”\n “That’s right.”\n “You’re traveling with Miss Sophie Rose?”\n “Yes,” he answered. Sophie just didn’t know it yet.\n “Agent Buchanan was just in here giving me an update. He mentioned that Miss Rose has been doing a little investigative work. She’s determined to find out why William Harrington went to Alaska.” Pittman shook her head. “Death by polar bear. That’s a new one for me. I think Miss Rose could write several interesting stories about the Arctic. Don’t you agree?”\n The ten-second rule had passed and Pittman was still looking at him expectantly. She actually wanted him to answer the question.\n “Yes, I’m sure she could.”\n “You know, Miss Rose needs continued protection. Don’t you agree, Agent MacAlister? Of course you do. Now, it’s my understanding that Agent Buchanan and Aiden Hamilton have been paying for security; well, now it’s time for us to take over. The woman’s taken one bullet, and who’s to say she won’t be taking another if she stays in Chicago. I’ve spoken to Detective Steinbeck,” she added, “and he admits they don’t have any significant leads. The shooter’s still out there.”\n She put her hand up to block any interruptions Jack might have wanted to make and continued, “We’re not interfering in the investigation. We’re just…observing. Detective Steinbeck knows he can call on us to assist…” she paused to smile and said, “to take over the investigation if need be. We’re not good at assisting, are we? We like to take charge because we know what we’re doing, and we get the job done. Isn’t that right?”\n Jack didn’t bother to nod. He simply waited for her to tell him his answer.\n “Yes, it is right,” she said before abruptly changing the subject. “By the way, do you have any idea how many hits there have been on that video you starred in? We’re over two million now and still climbing. I’ve had three major networks hounding me for interviews with you.” She held up three fingers and wiggled them. “You’re the new American Idol.”\n He groaned, and Pittman reacted with a glare. “One of my assistants asked me why we didn’t just shut down the video. I told her, why bother? By the time we found out about the thing, it had been downloaded to about eight hundred sights,” she exaggerated. “It’s all over the Web now. And as you probably know, we did try the it’s all-a-hoax ploy, but that didn’t fly.”\n Pittman wasn’t one for idle chitchat. She’d brought up the video for a specific reason. Jack waited for her to tell him her real agenda.\n A knock sounded at the door, and Pittman’s assistant peeked in.\n “Is that the DVD?” Pittman asked. “Good…good. Thank you, Jennifer.”\n The woman handed Pittman a large manila envelope and left.\n She removed the disc from the envelope. “I want you to watch this in a minute. You’ll find it enlightening.”\n Jack hoped to God he wasn’t one of the stars on the DVD. His mind raced. He hadn’t shot anyone since the hamburger joint.\n “The video is the reason I’d like to start my leave today,” he reiterated. \n","sourceLink":"https://allnovel.net/fire-and-ice-buchanan-renard-7/page-19.html","bookId":1830,"book":{"id":1830,"title":"Fire and Ice (Buchanan-Renard #7)","description":"Storyline: \n Fresh from her incredible smash-hit historical romance Shadow Music, \"New York Times\" bestselling author Julie Garwood returns to contemporary romantic suspense with this wonderfully sexy, exhilarating blockbuster. Filled with sizzling passion and breathless adventure, Fire and Ice features a feisty heroine whom Garwood\u0027s devoted readers already know and love from her hugely popular novel Murder List. \n Sophie Rose, a tough and determined newspaper reporter, is the daughter of Bobby Rose, a suave, charming, and handsome gentleman who also happens to be a notorious big-time thief sought by every law-enforcement agency in the country. When the major Chicago daily where she works insists she write an expose about her roguish father, Sophie refuses, quits her job, and goes to work at a small newspaper. Far from her onetime high-powered crime beat, she now covers local personalities such as the quirky winner of several area 5K runs whose trademark is goofy red socks. \n Those red socks-with Sophie\u0027s business card neatly tucked inside-are practically all that\u0027s found after runner William Harrington is killed near Prudhoe Bay, Alaska, seemingly the victim of a brutal death by polar bear. The Alaska cops want to know why Harrington carried Sophie\u0027s card. With an unerring nose for a good story, she heads north. \n What Sophie doesn\u0027t realize is that on her journey from Chicago to Prudhoe Bay, danger follows in her wake. After one attempt on her life, she\u0027s been assigned brash but sexy Jack MacAlister as a bodyguard by the cautious FBI. Amid great peril and deadly intrigue in the unforgiving Alaskan terrain, she and Jack form an uneasy alliance sparked with sensual attraction. But they will soon be fighting more than their growing passion for each other. Powerful forces will stop at nothing to prevent the exposure of the sinister conspiracy Sophie and Jack are about to uncover. \n Captivating mystery, unyielding desire, unrelenting action in a setting both beautiful and lethal-Julie Garwood weaves these thrilling elements into a heat-generating masterpiece of romantic suspense.\n \n","cover":"https://allnovel.net/images/fire-and-ice-buchanan-renard-7.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/fire-and-ice-buchanan-renard-7.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:31:17 PM"}}
