{"id":25877,"no":4,"title":"THE GUDE WALLACE","content":"\"Would ye hear of William Wallace, An\u0027 sek him as he goes, Into the lan\u0027 of Lanark, Amang his mortal foes? \\n\\n There were fyfteen English sojers, Unto his ladye came, Said, \u0027Gie us William Wallace, That we may have him slain.\u0027\" \\n\\n \\n\\n I will tell you a tale of the Good Wallace, that brave and noble patriot who rose to deliver his country from the yoke of the English, and who spent his strength, and at last laid down his life, for that one end. \\n\\n \\n\\n As all the world knows, the English King, Edward I., had defeated John Baliol at Dunbar, and he had laid claim to the kingdom of Scotland, and had poured his soldiers into that land. \\n\\n \\n\\n Some of these soldiers, hearing of the strength, and wisdom, and prowess of the young champion who had arisen, like Gideon of old, for the succour of his people, determined to try to take him by stealth, before venturing to meet him in the open field. \\n\\n \\n\\n \u0027Twas known that Wallace was in the habit of visiting a lady, a friend of his, in the town of Lanark, so a band of these soldiers went to her house, and surrounded it, while the captain knocked at the door. When the lady opened it, and saw him, and saw also that her house was surrounded by his men, she was very much alarmed, which perhaps was not to be wondered at, for everyone was afraid of the English at that time. \\n\\n \\n\\n The officer spoke to her in quite a friendly manner, however, and began to tell her about his own country, and how much richer and finer everything was there than in Scotland, and at last, when she was thoroughly interested, he hinted that it was in her power to marry an English lord if she cared to do so, and go and live in England altogether. \\n\\n \\n\\n Now I am afraid that the lady was both silly and discontented, and it seemed to her that it would be a very fine thing indeed to be an English nobleman\u0027s wife, so she blushed and bridled, and looked up and down, and at last she asked how the thing could be managed. \\n\\n \\n\\n \"Well,\" said the officer cautiously, \"there is only one condition, and that doth not seem to me to be a very hard one. It hath been told me that there is a rough and turbulent fellow who visits this house. His name is William Wallace, and because he is likely to stir up riots among the common people, it seems good to His Majesty, King Edward, that he should be taken prisoner. Would it be possible,\" and here his voice became very soft and persuasive, \"for thee to let us know what night he intends to visit thee?\" \\n\\n \\n\\n At first the lady started back, and was very indignant with him for daring to suggest that she should do such a dishonourable thing. \\n\\n \\n\\n \"I am no traitor,\" she said proudly, \"nor am I like Jael of old, who murdered the man who took shelter in her tent.\" \\n\\n \\n\\n But the captain\u0027s voice was low and sweet, and the lady\u0027s nature was vain and fickle, and the prospect of marrying an English lord was very enticing, and so it came about that at last she yielded, and she told him how she was expecting young Wallace that very night at seven o\u0027clock, and she promised to put a light in the window when he arrived. \\n\\n \\n\\n Then the false woman went into her house and shut the door, and the soldiers set themselves to watch for the coming of their enemy. \\n\\n \\n\\n How it happened I know not, but Wallace came, and walked boldly into the house without one of them seeing him, and he ran upstairs and knocked at the door of his friend\u0027s room. \\n\\n \\n\\n When she opened it, he stood still, and stared at her in astonishment, for her face was pale and wild, and she looked at him with terror in her eyes. I warrant she had been wrestling with her conscience ever since she had spoken with the soldiers, and she had seen what an awful thing it is to be guilty of the blood of an innocent man. \\n\\n \\n\\n \"What ails thee?\" cried Wallace, in his bluff, hearty way. \"Thou lookest all distraught, as if thou hadst seen a ghost.\" \\n\\n \\n\\n Then he held out his hand as if to greet her, but she stretched forth hers and pushed him away. \\n\\n \\n\\n \"Touch me not. I am like Judas,—Judas,\" she moaned, \"who betrayed the innocent blood, and whose fate is written in the Holy Book for a warning to all poor recreants like to me.\" \\n\\n \\n\\n Sir William Wallace thought that she had gone mad. \"Vex not thyself,\" he said kindly. \"Methinks thou hast been reading, and thinking, till thou hast fevered thy poor brain. Thou art no Judas, but mine own true friend, in whose house I find safe shelter when I need to visit Lanark.\" \\n\\n \\n\\n \"Safe shelter!\" she cried, with a bitter laugh, and she dragged him to the window, and pointed out in the dusk the figures of four soldiers who were leaning against the garden gate. \"Safe shelter, say ye, when I have betrayed thee to the English; for this house is watched by fifteen soldiers; and I have but to put a lamp in the window, as a signal that thou art within, and they will come and slay thee.\" \\n\\n \\n\\n \"And what is thy reward for this deed of treachery?\" asked Wallace, a look of contempt coming over his open face. \"What pay did the English loons promise thee?\" \\n\\n \\n\\n \"They promised me an English lord for a husband,\" sobbed the wretched woman, who now would have done anything in her power to undo the wrong that she had done. \"But oh, sir, I fear me I have wrought sore dule to thee this day, and sore dule to Scotland. If thou canst get free from this house, which I fear me thou wilt never do, thou canst denounce me as a traitor. I care not if I die the death.\" \\n\\n \\n\\n \"Now Heaven forfend!\" said Wallace, whose kindly heart was touched by her distress, although he despised her for her false deed; \"it shall never be said that William Wallace avenged himself on a woman, no matter what her crime might be. I trusted thee, and thou hast proved false, and so from henceforth we must go our different ways; but if thou art truly sorry, thou mayest yet help me, and, as for me, if once I get clear away from these Southron knaves outside. I will think no more of the matter.\" \\n\\n \\n\\n \"But canst thou get clear away?\" questioned the lady anxiously. \"I fear me, now that it is past seven o\u0027clock, they will keep stricter watch than they did when thou camest in. \u0027Twill be impossible for thee to pass out in safety, and if thou remainest here, they will search the house when they tire of waiting for my signal.\" \\n\\n \\n\\n Wallace laughed. \\n\\n \\n\\n \"Impossible is not a word that I am well acquaint with, madam,\" he said, \"and if, for the sake of the friendship that was between us in the days that are gone, thou wilt lend me some of thine attire, a gown and kirtle maybe, and a decent petticoat of homespun, and a cap such as wenches wear to shield their faces from the sun, I hope I may make good my escape under the very noses of these fellows.\" \\n\\n \\n\\n Wondering to herself, the lady did as he asked her. She brought him a dark-coloured gown and kirtle, and a stout winsey petticoat, such as serving-maids wear, and after long search she found at the bottom of a drawer a milk-maid\u0027s cap. \\n\\n \\n\\n Wallace proceeded to dress himself in these, and, when he had put them all on, and had clasped a leather belt round his waist, and wound an apron about his head, as lassies do to protect themselves from the rain or sun, and put the milk-maid\u0027s bonnet on top of all, I warrant even his own mother would not have known him. \\n\\n \\n\\n \"Now fetch me a milk-can,\" he said, \"for I am no longer a soldier, but a modest maiden going to the well to draw water.\" \\n\\n \\n\\n When she had brought it he bent low over her hand and gave it one kiss for the sake of old times; then he said farewell to her for ever, and opened the door, and walked boldly down the garden. \\n\\n \\n\\n The four soldiers at the gate looked at one another in surprise when a tall damsel with a milk-can stood still at the foot of the garden path, and waited for them to open it. They had not known that the lady had a serving-maid. \\n\\n \\n\\n \"If it please thee, good sirs, to let me bye,\" broke in the maiden\u0027s voice in the gloom. \"My mistress hath a sharp temper, and this water ought to have been fetched an hour ago.\" \\n\\n \\n\\n She spoke with a lisp, and her accent was so outlandish that the men scarce understood what she said; but this they saw, that she wanted to go and draw water from the well, and they opened the gate to let her pass. \\n\\n \\n\\n \"If I dare leave my post, I would fain come and draw for thee,\" said one; \"shame is it that such a pretty wench be left to go to the well alone.\" \\n\\n \\n\\n The maiden paid no heed to the fellow\u0027s words, but tossed her head, and went quickly down the path to the well, taking such gigantic strides that the men gazed after her in wonder. \\n\\n \\n\\n \"Marry, but she covers the ground,\" said one. \\n\\n \\n\\n \"Certs, but I would rather walk one mile with her than two,\" said another. \\n\\n \\n\\n \"Methinks that we had better go after her and bring her back,\" cried a third. \"I have heard say that this William Wallace, whom we are in search of, hath mighty long legs.\" \\n\\n \\n\\n Horrified at the thought that they might have let the very man they were looking for escape, they hurried down the path after the serving-maid, and when they overtook her they found out in good sooth that she was William Wallace, for she drew a sword from under her kirtle, and killed all four of them, before they could lay hands on her. \\n\\n \\n\\n When the four men lay dead before him, Wallace wasted no time over their burial, but drawing their bodies under a bush, where they were somewhat hidden from the passers-by, he hung the milk-can on a branch of a tree, and walked quietly away in the gathering darkness. No one who met a simple country girl walking out into the country ever dreamt of asking her who she was, or where she was going, and ere morning came, I promise you, her garments had been cast, and buried in a hole in the ground, and Wallace was making his way northward as fast as ever he could. \\n\\n \\n\\n He had to be very careful which way he travelled, for there were soldiers quartered in many of the towns, who knew that there was a price set on his head, and who were only too anxious to catch him. \\n\\n \\n\\n So he dare not venture into the towns, or into the districts where there were many houses, and it came to pass that, as he was nearing Perth, he was like to famish for want of food. \\n\\n \\n\\n He had eaten almost nothing for three days, nor had he money wherewith to buy it. \\n\\n \\n\\n Now, near to Perth there is a beautiful haugh or common, called the North Inch, which stretches along the river Tay, and as he was crossing that, he saw a pretty, rosy country girl washing clothes under a tree, and spreading them out to bleach in the sun. She looked so kind and so good-tempered that he thought he would speak to her, and mayhap, if he found that she lived near, he would ask her to give him something to eat. \\n\\n \\n\\n So he went up to her, and greeted her pleasantly, and asked her what news there was in that part of the world. \\n\\n \\n\\n \"News,\" said she, looking up at him with a roguish smile, for it was not often that she had the opportunity of talking with such a gallant knight. \"Nay, by my troth, I have no news, for I am but a poor working maiden, who toils hard for her living; but one thing I can tell thee, an\u0027 if thou be a true Scot at heart, thou wilt do all in thy power to shield him.\" \\n\\n \\n\\n \"To shield whom?\" asked Wallace in surprise. \"I know not of whom thou speakest.\" \\n\\n \\n\\n \"Why! Sir William Wallace,\" answered the girl, \"that gallant man who will deliver this poor country of ours. \u0027Tis known that he is in these parts; he hath been traced from Lanark, and \u0027tis thought that he is making for the hills, where his followers are; and this very day a body of these cursed English have marched into the town, in order to search the country and take him. Look, seest thou that little hostelry yonder? There hath a band of them gone in there not half an hour ago. Certs, had I been a man, I would e\u0027en have gone myself, and measured my strength against theirs. I tell thee this, because thou seemest a gallant fellow, and perchance thou canst do something to save the knight.\" \\n\\n \\n\\n Wallace smiled. \"Had I but a penny in my pocket,\" he said, \"I would betake me to that little inn, just to see these English loons.\" \\n\\n \\n\\n The maiden hesitated. She was poor, as she had said, and had to work hard for her living, but it chanced that that day she had half a crown in her pocket, which she had intended to spend in the town on her way home. But her kind heart was stirred with pity at the thought of such a goodly young man having no money in his pocket, and at last she took out the half-crown and gave it to him. \\n\\n \\n\\n \"Take this,\" she said, \"and go and buy meat and drink with it, and if thou knowest where Wallace is, for the love of Heaven, betray him not to these English knaves.\" \\n\\n \\n\\n \"I will serve Wallace e\u0027en as I serve myself,\" he said, \"and more can no man promise,\" and, thanking her heartily for the piece of silver, he strode off in the direction of the little hostler-house, leaving her wondering what he meant by his strange answer. \\n\\n \\n\\n Wallace had not gone very far on his way before he met a beggar man, coming limping along, clad in an old patched cloak. This was the very thing the knight wanted. \\n\\n \\n\\n \"Hullo, old man,\" he said; \"how goes the world with thee, and what news is there abroad in Perth?\" \\n\\n \\n\\n \"News, master?\" said the beggar. \"No news that I know of, save that \u0027tis said that Sir William Wallace is somewhere hereabouts, and a party of English soldiers have come to hunt for him. As I craved a bite of bread at the door of that hostler-house down yonder, I saw fifteen of them within, eating and drinking.\" \\n\\n \\n\\n \"Say ye so, old man?\" said Wallace. \"That is right good news to me, for I have long had a desire to see an English soldier close at hand. See,\" and he drew the bright silver half-crown, which he had just received from the maiden, from his pocket, \"here is a piece of white money for thee, if thou wilt sell me that old cloak of thine, and thy wallet. Faith, there be as many holes as patches in the cloak; it can scarce serve thee for a covering, and \u0027twill answer my purpose right well.\" \\n\\n \\n\\n Joyfully the beggar agreed to the bargain, and Wallace was left with the cloak, which he threw over his shoulders, and which covered him from head to foot. Pulling his cap well over his eyes, and choosing a trusty thorn cudgel from a neighbouring thicket, he went limping up to the door of the little inn, and knocked. \\n\\n \\n\\n The captain who was with the English soldiers opened it. He looked the lame beggar up and down. \\n\\n \\n\\n \"What dost thou want, thou cruikit carle?\" he asked haughtily. \\n\\n \\n\\n \"An alms, master,\" answered the beggar humbly. \"I am a poor lame man, and unable to work, and I travel the country from end to end, begging my daily bread.\" \\n\\n \\n\\n \"Ah,\" thought the captain to himself, \"this man must hear all the country gossip. Likely enough he knows where Wallace is, or the direction in which \u0027tis thought he will travel.\" \\n\\n \\n\\n He took a handful of gold from his pouch, and held it before the beggar\u0027s eyes. \\n\\n \\n\\n \"Did you ever hear of a man called William Wallace?\" he asked slowly; \"the country folk hereabouts talk a great deal of him. They call him \u0027hero,\u0027 and such-like names. But he is a traitor to our rightful King, King Edward, and I am here to take him, alive or dead. Hast ever heard of the fellow?\" \\n\\n \\n\\n \"Ay,\" said the beggar, \"I have both heard of him and seen him. Moreover,\" and he looked at the gold, \"I know where he is to be found.\" \\n\\n \\n\\n An eager look came into the English knight\u0027s face. \"I will pay thee fifty pounds down,\" he said, \"fifty pounds of good red money, if thou wilt lead me to Sir William Wallace.\" \\n\\n \\n\\n \"Tell down the money on this bench,\" cried the beggar, \"for it is in my power to grant thy request, and verily, I will never have a better offer, no, not if I wait till King Edward comes himself.\" \\n\\n \\n\\n The English captain counted down the money on the old worm-eaten wooden bench that stood beside the door of the inn, and the beggar counted it after him, and picked it up, and put it carefully away in his wallet. Then he faced the Englishman with a strange gleam in his eyes. \\n\\n \\n\\n \"Thou wouldst fain see William Wallace,\" he said. \"Then see him thou shalt, and feel the might of his arm too, which is more, belike, than thou bargainedst for,\" and, before the astonished captain could grasp his sword, he had let the beggar\u0027s cloak fall to the ground, and, lifting his stout cudgel, he had given him such a clout over the head, that his skull cracked like a nut, and he fell dead at his feet. \\n\\n \\n\\n Without waiting to take breath, Wallace drew his sword, and, running lightly upstairs, he burst into the room where the soldiers were just finishing their meal, and before they could rise from the table and grasp their weapons, he had stabbed every one of them to the heart. \\n\\n \\n\\n The innkeeper\u0027s wife, who had just come from the kitchen, and was serving the men rather unwillingly, for she had no love for the English, stood still and stared in amazement. \\n\\n \\n\\n \"God save us!\" she said at last, as Wallace stopped and wiped his sword. \"But are ye a man, or do you come from the Evil One himself?\" \\n\\n \\n\\n \"I am William Wallace,\" said the stranger, \"and I wish that all English soldiers who are in Scotland were even as these men are.\" \\n\\n \\n\\n \"Amen to that,\" said the old woman heartily, and then she dropped down on her knees before the embarrassed knight. \"Hech, sirs,\" she said fervently, \"to think that my eyes are looking on the Gude Wallace!\" \\n\\n \\n\\n \"The Hungry Wallace, ye mean,\" said the knight with a laugh. \"If ye love me, woman, get up from thy knees, and set on meat and drink, for I have scarce tasted food these three days, and my strength is well-nigh gone.\" \\n\\n \\n\\n \"That will I, right speedily,\" she cried, and, jumping up, she ran to her husband and told him who the stranger was. \\n\\n \\n\\n With great goodwill they began to prepare a meal, but hardly had it been dished up, and placed upon the table, before another band of soldiers marched up and surrounded the house. The beggar man had gone into Perth, and told people about the mysterious knight who had bought his old cloak in order that he might go and see the English soldiers, and when the rest of the soldiers in the town got to hear of it, they had suspected at once who he really was, and had come to the help of their companions. \\n\\n \\n\\n Their suspicions proved true when they caught sight of Wallace through one of the windows. \\n\\n \\n\\n \"Come out, come out, thou false knight,\" they cried exultingly, \"and think not that thou canst escape out of our hands. The tod[1] is taken in his hole this time, and right speedily shall he die.\" \\n\\n \\n\\n [1] Fox. \\n\\n \\n\\n With that they entered the house, and rushed upstairs, thinking that it would be an easy matter to capture the Scottish leader, for they knew that he had no follower with him. But the weak things of this world are able sometimes to confound the mighty, and they had not reckoned that the two old people to whom the inn belonged were prepared to shed the last drop of their blood, rather than that Wallace should come to harm in their house. \\n\\n \\n\\n So the old man had taken down his broad claymore from the wall, and the old woman had seized a lance, and they stood one on each side of their guest, grasping their weapons with fevered zeal. \\n\\n \\n\\n Then began a fierce and deadly onslaught in that little room, and many a time it seemed as if the three brave defenders must go down; but Wallace\u0027s arm had the strength of ten, and the old man laid on right bravely, and the old woman gave many a deadly thrust with her lance from behind, where she saw it was needed, and so it came to pass that at last every Englishman was slain, and Wallace and his bold helpers were left triumphant. \\n\\n \\n\\n \"Now, surely, I can eat in peace,\" said he, sitting down to his sorely needed meal, \"and then must I begone. For, with thy help, I have done a work here this day that will raise all the English \u0027twixt Perth and Edinburgh. Mayhap, goodman, thou canst get help to throw these bodies into the river. \u0027Twill be better for thee that the English find them not in thy house, for I must up and away.\" \\n\\n \\n\\n \"That can I,\" said the old man, \"for the good folk of Perth think much of thee, and very little of the English, therefore will they give me a hand.\"[2] \\n\\n \\n\\n [2] Help me. \\n\\n \\n\\n So once more Wallace took the road to the North, and as he retraced his steps across the North Inch, he passed the rosy-cheeked maiden again, busy at her work. She was laying the clothes out to bleach now, and she gave him a friendly nod as he approached. \\n\\n \\n\\n \"I hope, fair sir, that thou hast seen the English,\" she said, \"and that thou hast come by food at the same time?\" \\n\\n \\n\\n \"That have I,\" said Wallace; \"thanks to thy gentle charity, I have eaten and drunk to my heart\u0027s content. I have seen the English soldiers too, and, by my troth, the English soldiers have also seen me. The day that I visited that little hostler-house is not likely to be forgotten by the English army.\" \\n\\n \\n\\n Then he put his hand in his pocket, and drew out twenty pounds in good red gold. \\n\\n \\n\\n \"Take that,\" he said to the astonished damsel, pressing the money into her hand as he spoke. \"Thy half-crown brought me luck, and this is but thy rightful share of it.\" \\n\\n \\n\\n So saying, he took his way quickly towards the hills, leaving the girl so bewildered, that, had it not been for the money in her hand, she would have been inclined to think that it was all a dream. \\n\\n \\n\\n As it was, she never quite believed that it was a human being who had taken away her silver half-crown, and brought her back twenty gold pieces, but talked of ghosts, and visions; and some people, when they heard of the thirty English soldiers who lay dead in the little hostler-house, were inclined to be of her opinion. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2359/65853.html","bookId":588,"book":{"id":588,"title":"Tales From Scottish Ballads","description":"简介： Once upon a time, there was an old man in Lochmaben, who made his livelihood by going round the country playing on his harp. He was very old, and very blind, and there was such a simple air about him, that people were inclined to think that he had no...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2359","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
