{"id":36758,"no":38,"title":"CHAPTER XVII. THE REIGN OF VICTORIA (continued).","content":"The Repeal Agitation—Debate in the Dublin Corporation—The Monster Meetings—O\u0027Connell\u0027s Speech at Tara—The Arms Bill—Dismissal of the Repeal Magistrates—Speeches of the Duke of Wellington—The Arms Bill becomes Law—Proclamation of the Clontarf Meeting—O\u0027Connell\u0027s Counter-Proclamation—Arrest and Trial of O\u0027Connell—The Sentence—It is reversed by the House of Lords—Rejoicings on O\u0027Connell\u0027s Liberation—The Excitement at Cork—Decline of O\u0027Connell—His Breach with the Young Ireland Party—Irish Debates in Parliament—Approach of the Irish Famine—The Devon Commission—Its Report—Arrival of the Potato Disease—The Famine—The Relief Committee of the Society of Friends—The Famine in Ulster—A Description of Cork and Skibbereen—Demoralisation of the Population—Policy of the Whig Cabinet—Lord George Bentinck\u0027s Railway Plan—Failure of the new Poor Law and of the Public Works—The Temporary Relief Act—Father Mathew—Private Benevolence—Munificence of the United States. \n \n The Repeal Agitation in Ireland, which had been thoroughly organised in 1842 by \"Repeal Missionaries\" who had visited every parish in the country, reached its culminating point in 1843. Early in February that year Mr. O\u0027Connell, who had filled the civic chair the previous year, and was then an alderman of the Dublin Corporation, gave notice that, on the 21st of that month, he would move a resolution, affirming the right of Ireland to a resident Parliament, and the necessity of repealing the union. Alderman Butt expressed his determination of opposing the motion. Mr. Butt was one of the ablest members of the Irish bar, and a leader of the Conservative party. The debate was therefore anticipated with the greatest interest, as it promised to be a very exciting political duel. The old Assembly House, since abandoned for the more commodious City Hall, was densely crowded by the principal citizens, while the street was thronged by the populace during the debate. Mr. O\u0027Connell marshalled his arguments under many heads: Ireland\u0027s capacity for independence—her right to have a Parliament of her own—the establishment of that right in 1782—the prosperity that followed—the incompetence of the Irish Parliament to destroy the Constitution—the corrupt means by which the union was carried—its disastrous results, and the national benefits that would follow its repeal. The speech, which lasted four hours, was mainly argumentative and statistical. It was accepted by his followers as an elaborate and masterly statement of the case. Mr. Butt replied with equal ability and more fervid eloquence. The debate was adjourned. Next day other members took part in it. It was again adjourned, and as the contest proceeded the public excitement rose to fever heat. At two o\u0027clock on the third day Mr. O\u0027Connell rose to reply. \"No report,\" says Mr. O\u0027Neil Daunt, \"could possibly do justice to that magnificent reply. The consciousness of a great moral triumph seemed to animate his voice, his[526] glance, and his gestures. Never had I heard him so eloquent, never had I witnessed so noble a display of his transcendent powers.\" The division showed that 41 were in favour of a domestic legislature and 15 were opposed to it. \n \n It has been remarked that the \"monster meetings\" could never have been conducted in the orderly manner for which they were distinguished, but for the Temperance reform which had been effected by Father Mathew, a benevolent, tolerant, and single-minded friar from Cork, who was known as the Apostle of Temperance, and who had induced vast numbers from all parts of the country to take the pledge, which the majority religiously kept for some years. The monster meetings, of which forty-five were held during the year, were vast assemblages whose numbers it was difficult to calculate, but they varied from 20,000 to 100,000 each. The people, generally well-dressed, came crowding to the appointed place from every direction, some on horseback, some on jaunting cars and carts, generally preceded by bands with immense banners, and sometimes marching in military order. O\u0027Connell, the \"uncrowned monarch,\" as his followers called him, arrived from Dublin, sitting on the dickey of a coach, usually drawn by four horses. He was always accompanied by his devoted friend, Tom Steel, the \"head pacificator,\" one of the most ardent of hero-worshippers, who looked up to his chief as a sort of demi-god. The first of the monster meetings was held at Trim, in the county Meath, on the 19th of March, and was said to have been attended by about 30,000 persons. A dinner took place in the evening, at which Mr. O\u0027Connell delivered an exciting speech. Referring to the bright eyes and hardy look of the multitudes that surrounded him that day, he asked, would they be everlasting slaves? They would answer \"No,\" and he would join in the response, and say, \"I shall be either in my grave or be a free man. Idle sentiments will not do. It will not do to say you like to be free. The man who thinks and does not act upon his thoughts is a scoundrel who does not deserve to be free.\" The monster meeting held at Mullingar on the 14th of May (Sunday) was attended by Dr. Cantwell and Dr. Higgins, two Roman Catholic bishops, and a great number of priests. This was one of the largest of the meetings, and was remarkable for the declaration made by Dr. Higgins, to the effect that \"every Roman Catholic bishop in Ireland, without exception, was a Repealer. He defied all the Ministers of England to put down the agitation. If they prevented them from assembling in the open fields, they would retire to their chapels, and suspend all other instruction, in order to devote all their time to teaching the people to be Repealers. They were even ready to go to the scaffold for the cause of their country, and bequeath its wrongs to their successors.\" This outburst excited tumultuous applause, the whole assembly rising and cheering for a considerable time. \n \n During the summer, meetings of a similar character were held at Cork, Longford, Drogheda, Kilkenny, Mallow, Dundalk, Baltinglass, Tara, and other places. At Tara, in the county Meath, on the 15th of August, an immense multitude was assembled—250,000, at the lowest estimate, but represented by the Repeal journals as four times that number. The place was selected because of its association with the old nationality of the country, where its ancient kings were elected and crowned. O\u0027Connell\u0027s speech on this occasion was defiant in tone, and in the highest degree inflammatory. Referring to a speech of the Duke of Wellington, he said, \"The Duke of Wellington is now talking of attacking us, and I am glad of it. The Queen\u0027s army is the bravest army in the world, but I feel it to be a fact that Ireland, roused as she is at the present moment, would, if they made war upon us, furnish women enough to beat the whole of the Queen\u0027s forces.\" The Lord Chancellor Sugden having recently deprived of the commission of the peace all magistrates who were members of the Repeal Association, Mr. O\u0027Connell announced that the dismissed magistrates would be appointed by the Repeal Association as arbitrators to settle all disputes among the people, who were not again to go to the petty sessions. He pronounced the union to be null, to be obeyed as an injustice supported by law, until they had the royal authority to set the matter right and substitute their own Parliament. In his speech after dinner to a more select audience, he said that the statesman was a driveller who did not recollect the might that slumbers in a peasant\u0027s arm, and who expected that 700,000 such men would endure oppression for ever. An outbreak would surely come, though not in his time, and then the Government and gentry would weep, in tears of blood, their want of consideration and kindness to the country whose people could reward them amply by the devotion of their hearts and the vigour of their arms. What were the gentry afraid of? It could not be of the people, for they were under the strictest discipline. No army was ever more submissive to its general than the[527] people of Ireland were to the wishes of a single individual. \n \n While the agitation was going forward in this manner in Ireland, the state of that country was the subject of repeated and animated debates in Parliament. One of the remedies proposed by the Government was an Arms Bill, which was opposed with great vehemence by the Irish Liberal members. Mr. Shaw, the Recorder of Dublin, in his speech on the second reading, described the condition of Ireland from the Conservative point of view; he considered that the country was in an alarming state, the lower classes extensively agitated, and the higher unusually dejected and depressed. Even the great benefit of the temperance movement had brought with it the evil of an organisation now turned to the most dangerous purposes. The real object of the Repeal agitation was to array the people and the priesthood against the property of the country. There was no class more alarmed at the progress of the movement than the respectable portion of the Roman Catholics, who dreaded lest they should be swept away by the tide. If the law did not put down the agitation, the agitation would put down the Constitution. Mr. C. Buller\u0027s remedy was \"to Canadianise\" Ireland, which meant to make Mr. O\u0027Connell Attorney-General, and substitute the titulars for the clergy of the Establishment. Mr. Roebuck thought \"there was no great difference between the late and the present Government. Neither of them had put down the giant evil of Ireland, her rampant Church. He would take away her revenue, and give it, if to any Church at all, to the Church of the Roman Catholics. The grand evil and sore of Ireland was the domination of the Church of the minority.\" \n \n In the House of Lords several discussions took place on the dismissal of the Repeal magistrates. Lord Clanricarde, on the 14th of July, moved resolutions declaring that act of the Lord Chancellor \"unconstitutional, unjust, and inexpedient.\" The Duke of Wellington met the motion by a direct negative. \"These meetings,\" he said, \"consisting of 10,000, 20,000, or 100,000 men—no matter the number of thousands—having been continued, I wish to know with what object they were continued? With a view to address Parliament to repeal the union? No, my lords; they were continued in order to obtain the desired repeal of the union by the terror of the people, and, if not by terror, by force and violence; and the persons calling these meetings were magistrates, the very men who must have been employed by the Government to resist such terror and violence, and to arrest those who were guilty of such breaches of the peace. That is the ground on which the Lord Chancellor of Ireland said to the magistrates, \u0027You must be dismissed if you attend, or invite attendance at such meetings.\u0027\" The Duke \"regretted to learn there was poverty in Ireland; but,\" he asked, \"was that poverty relieved by a march of twenty-five and thirty miles a day in spring and summer to hear seditious speeches? Was poverty relieved by subscribing to the Repeal rent?\" The resolutions were negatived by a majority of 91 to 29. In a subsequent debate, arising out of a petition presented by Lord Roden from 5,000 Ulster Protestants, complaining that they had been prevented from celebrating the Orange anniversary, while the most flagrant breaches of the law were passed over in the case of those who wanted to overthrow the Constitution, which the Orangemen were sworn to defend, the Duke of Wellington, on that occasion, said that \"nothing had been neglected by the Government that was necessary to preserve the peace of the country, and to meet all misfortunes and consequences which might result from the violence of the passions of those men who unfortunately guided the multitude in Ireland. He did not dispute the extent of the conspiracy or the dangers resulting from it; he did not deny the assistance received from foreigners of nearly all nations—disturbed and disturbing spirits, who were anxious to have an opportunity of injuring and deteriorating the great prosperity of this country—but he felt confident that the measures adopted by the Government would enable it to resist all, and preserve the peace.\" \n \n [528] \n \n O\u0027CONNELL AT THE MEETING AT TRIM. (See p. 526.) \n [See larger version] \n \n [529] \n \n Mr. Smith O\u0027Brien, early in July, gave occasion for another great debate on the state of Ireland, by moving that the House resolve itself into a committee for the purpose of taking into consideration the causes of the discontent prevailing there, with a view to the redress of grievances, and the establishment of a system of just and impartial government in that part of the United Kingdom. The honourable gentleman reviewed the history of the country since the union, discussed the questions of the National Debt and taxation, the Church Establishment, the position of the Roman Catholic hierarchy, Government appointments, Coercive Acts, and land tenure. Lord Eliot, then Chief Secretary of Ireland, answered his arguments at length. A great number of speakers followed, continuing the debate for five nights. At length the House divided, when the numbers were—against the motion for a committee, 243; for it, 164. The whole of these vexed questions again came up on the 9th of August, when the Irish Arms Bill was set down for the third reading. On this occasion Sir Robert Peel made some remarks, expressing the feeling of his Government with regard to Ireland, declaring that he viewed the state of things there with deep anxiety and pain. He had hoped that there was a gradual abatement of animosity on account of religious differences; that he saw the gradual influence of those laws which removed the political disabilities of Catholics and established civil equality. He thought he saw, in some respects, a great moral and social improvement; that there was a hope of increasing tranquillity, which would cause the redundant and superfluous capital of England, then seeking vent in foreign and precarious speculations, to flow into Ireland. But the agitation had, in his opinion, blasted all those hopes. \n \n SIR JAMES GRAHAM. \n [See larger version] \n \n The third reading of the Arms Bill passed by a majority of 66, and soon received the Royal Assent. In the Queen\u0027s Speech at the close of the Session there was a very pointed reference made to the state of Ireland. Her Majesty said that she had observed with the deepest concern the persevering efforts made to stir up discontent and disaffection among her subjects in Ireland, and to excite them to demand the repeal of the union; and from her deep conviction that the union was not less essential to the attainment of good government in Ireland than to the strength and stability of the empire, it was her firm determination, with the support of Parliament, and under the blessing of Divine Providence, to maintain inviolate that great bond of connection between the two countries. She thus concluded, \"I feel assured that[530] those of my faithful subjects who have influence and authority in Ireland will discourage to the utmost of their power a system of pernicious agitation which disturbs the industry and retards the improvement of that country, and excites feelings of mutual distrust and animosity between different classes of my people.\" \n \n This royal denunciation of the Repeal movement greatly exasperated O\u0027Connell. He had recently submitted a plan to the Repeal Association, recommended by a committee of which he was chairman, for the restoration of the Irish Parliament. In the document containing this plan it was declared that the people of Ireland finally insisted upon the restoration of the Irish House of Commons, consisting of 300 representatives, and claimed, in \"the presence of the Creator,\" the right of the Irish people to such restoration, stating that they submitted to the union as being binding in law, but solemnly denied that it was founded on right, or on constitutional principle, or that it was obligatory on conscience. The franchise was to be household suffrage, and the voting by ballot. It was also provided that the monarch or regent de jure in England should be the monarch or regent de facto in Ireland. This revolutionary scheme was to be carried into effect, \"according to recognised law and strict constitutional principle.\" The arbitration courts which O\u0027Connell had threatened to set up, in consequence of the superseding of magistrates connected with the Repeal Association, had actually been established; and the Roman Catholic peasantry, forsaking the regular tribunals, had recourse to them for the settlement of their disputes. \n \n The Repeal organisation had therefore become exceedingly formidable, and had been rendered still more so by what O\u0027Connell called \"the mighty moral miracle of 5,000,000 men pledged against intoxicating liquors.\" If he had to go to battle, he said, he should have the strong and steady teetotallers with him. The teetotal bands \"would play before them, and animate them in the time of peril; their wives and daughters, thanking God for their sobriety, would be praying for their safety; and he told them there was not an army in the world he could not beat with his teetotallers. Yes, teetotalism was the first sure ground on which rested their hope of sweeping away Saxon domination and giving Ireland to the Irish.\" O\u0027Connell had been in the habit of wearing a crown-like cap, richly ornamented, which had been presented to him at the monster meeting at the Rath of Mullaghmast, in the county Kildare. This symbol of sovereignty had its effect upon the masses, who began to cherish the idea that they might have ere long a king of their own. It was probably with a view to encourage this idea, and to raise their enthusiasm to the highest pitch, that he resolved to hold the last of the series of monster meetings at Clontarf, near Dublin, the scene of King Brian Boru\u0027s victory over the Danes. This meeting was to be held on Sunday, the 8th of October, and was to be the most imposing of all the demonstrations. But the Government was at last roused to action, and on the previous day a proclamation was issued by the Lord-Lieutenant in Council, prohibiting the assembly. The proclamation declared that whereas advertisements and placards had been printed and extensively circulated, calling on those who proposed to attend the meeting to come on horseback, to meet and form in procession, and to march in military order and array; and whereas the object of the meeting was to excite discontent and disaffection, hatred and contempt of the Government of the country, and to accomplish alterations in the laws and Constitution of the realm, by intimidation and the demonstration of physical force, tending also to serve the ends of factious and seditious persons, and violate the peace, the meeting was strictly prohibited. It was stated that those attending it should be prosecuted, and that effectual measures should be taken for its dispersion. \n \n This was no idle threat; the guards at Dublin castle and at the several barracks were doubled; Alborough House, commanding the road to Clontarf, was garrisoned; the streets on the north side of the city were patrolled by parties of soldiers during the night. Three war steamers were placed in the Liffey, with their guns run out, commanding the ground where the meeting was to be held; while the guns at the Pigeon House fort at the mouth of the river, right opposite Clontarf, were so placed as to sweep the road to it. The village was occupied by the 5th Dragoon Guards, the 60th Rifles, the 11th Hussars, the 54th Regiment of Infantry, and a brigade of Royal Horse Artillery; the infantry being commanded by Colonel Fane, the cavalry by Lord Cardigan, and the artillery by Colonel Higgins. The men and horses were provisioned for twenty-four hours, and each soldier was furnished with sixty rounds of ball cartridge. A crisis had now come; a collision between the troops and O\u0027Connell\u0027s army of teetotallers was imminent, and even he could have no doubt of the[531] issue. He seemed to stand appalled on the edge of the precipice to which he had brought his deluded followers, and shrinking from the consequences, he made all possible haste to save them. As soon as the proclamation was issued, he called a special meeting of the Repeal Association, and announced that in consequence of the measures taken by the Government, which he denounced as \"the most base and imbecile step ever taken,\" there would be no meeting at Clontarf the next day. He submitted a counter-proclamation, which was adopted and posted up that evening throughout the city beside the Government proclamation. It was also sent by special messengers to the neighbouring towns and villages. The preventive measures taken on both sides were completely successful. No mounted Repealers came in from the country, and though vast multitudes went out from Dublin to view the military demonstrations, their meeting with the Queen\u0027s forces was quite amicable. They were allowed to see the spectacle, but they were compelled to move on along the high road, which they did very good-humouredly. \n \n The Government now resolved to follow up the vigorous step they had so tardily taken, by the prosecution of O\u0027Connell and several leading members of the Association. They were arrested in Dublin on the 14th of October, charged with conspiracy, sedition, and unlawful assembly. The other gentlemen included in the prosecution were Mr. John O\u0027Connell, Mr. Thomas Steele, Mr. Ray, Secretary to the Repeal Association, Dr. Gray, proprietor of the Freeman\u0027s Journal, Mr. Charles Gavan Duffy, editor of the Nation, Mr. Barrett, of the Pilot, and the Rev. Messrs. Tyrrell and Tierney, Roman Catholic priests. Mr. O\u0027Connell, with his two sons and several friends, immediately on his arrest, went to the house of Mr. Justice Burton, and entered into recognisances, himself in ￡1,000, with two sureties of ￡500 each. The tone of Mr. O\u0027Connell was now suddenly changed. From being inflammatory, warlike, and defiant, it became intensely pacific, and he used his utmost efforts to calm the minds of the people, to lay the storm he had raised, and to soothe the feelings he had irritated by angry denunciations of the \"Saxon.\" That obnoxious word was now laid aside, being, at his request, struck out of the Repeal vocabulary, because it gave offence. Real conciliation was now the order of the day. \n \n The State prosecutions commenced in January, 1844, in the Court of Queen\u0027s Bench, before the Lord Chief Justice Penefather, and Justices Burton, Crampton, and Perrin. Besides the Attorney and Solicitor-General, there were ten counsel employed for the Crown, and there was an equal number on the side of the traversers, including Mr. Sheil, Mr. Hatchel, Mr. Moore, Mr. Whiteside, Mr. Monaghan, afterwards Chief Justice, Mr. O\u0027Hagan, and Mr. Macdonogh. This monster trial was remarkable in many respects. It excited great public interest, which pervaded all classes, from the highest to the lowest. It lasted from the 16th of January to the 12th of February; the speech of the Attorney-General occupied two days; the jury list was found to be defective, a number of names having been secretly abstracted; newspaper articles were admitted as evidence against men who never saw them; the Lord Chief Justice betrayed his partiality in charging the jury, by speaking of the traversers as \"the other side.\" The principal witnesses were shorthand writers from London, avowedly employed by the Government to report the proceedings of the monster meetings. Mr. Jackson, reporter for the Morning Herald, also placed his notes at the service of the Government. Mr. O\u0027Connell defended himself in a long argument for Repeal, and an attack on the Government. The most brilliant orations delivered on the occasion were those of Sheil and Whiteside. Mr. Fitzgibbon, one of the counsel for the traversers, made a remark offensive to the Attorney-General, Mr. T. C. B. Smith, who immediately handed him a challenge, in the presence of his wife, while the judges had retired for refreshment. The matter was brought before the court, and, after mutual explanations, was allowed to drop. \n \n All the traversers were found guilty. The Attorney-General did not press for judgment against the Rev. Matthew Tierney. Upon the rest Mr. Justice Burton, who was deeply affected, pronounced judgment on the 30th of May, in the following terms:—\"With respect to the principal traverser, the Court is of opinion that he must be sentenced to be imprisoned for the space of twelve calendar months; and that he is further to be fined in the sum of ￡2,000, and bound in his own recognisances in the sum of ￡5,000, and two sureties in ￡2,500, to keep the peace for seven years. With respect to the other traversers, we have come to the conclusion that to each shall be allotted similar sentences, namely, that they be imprisoned for the space of nine calendar months, each of them to pay ￡50 fine, and to enter into their own recognisances of ￡1,000 each, and two sureties of ￡500, to keep the peace for seven years.\" \n \n The prisoners were at once sent to Richmond[532] Bridewell, on the South Circular Road, where the Governor did all in his power to make them comfortable. Good apartments were assigned to them. They dined together every day, and they were permitted to receive, without restriction, the visits of their friends and admirers. The Government was the less disposed to interfere with these indulgences, as their object was not so much punishment as prevention, and besides, the traversers had appealed against the sentence. A majority of the twelve English judges affirmed the judgment of the Court of Queen\u0027s Bench, while condemning the counts on which the Irish court relied. An appeal was then made to the House of Lords. The decision was left to the five law lords—Lyndhurst, Brougham, Cottenham, Denman, and Campbell. The first two were for a confirmation of the judgment, the last three for reversal. Lord Denman, in pronouncing judgment, said, referring to the tampering with the panel, \"If such practices as had taken place in the present instance in Ireland should continue, the trial by jury would become a mockery, a delusion, and a snare,\" a sentence which was hackneyed by repetition for years afterwards. The news of the reversal reached Dublin on the afternoon of the 5th of September. Great crowds had assembled on the pier at Kingstown, and tremendous cheers broke forth from the multitude when the Holyhead packet approached, and they saw held up a white flag, with the inscription, \"Judgment reversed by the House of Lords. O\u0027Connell is free!\" The news was everywhere received by the Roman Catholics with wild excitement. \n \n Orders soon came from the Government for the liberation of the prisoners. After some consultation with their friends, it was resolved that there should be a public procession from the prison in the morning. Mr. O\u0027Connell, however, left that evening, and proceeded on foot to his house in Merrion Square. Before he had reached the square, the tidings spread abroad that he was out, and crowds rapidly assembled from all directions. The people leaped and danced about him, while their acclamations rent the air. When he placed his foot upon the step to ascend to his own door, the exulting shouts of some 10,000 or 15,000 people were almost deafening. Appearing on the balcony of his house, where he had often stood before, to address his followers, they could scarcely be got to keep silence while he spoke. The procession next day was, in point of magnitude, quite in keeping with the other \"monster\" proceedings. Twelve o\u0027clock was the time appointed to start from the prison, and at that hour the first part of the procession arrived. Its length may be inferred from the fact that it was not until two o\u0027clock that the triumphal car reached the prison gate. During those two hours thousands upon thousands defiled before it in one unbroken line of men, perfect order being kept, without the aid of a single policeman, and the marching mass being broken into sections only by the bands of music, preceding the flags or carriages of the different trades, which numbered about thirty. The bands were all dressed in fancy uniforms, bearing bright colours—blue, pink, and green—with banners of the most gorgeous description. There was such a demand for carriages and vehicles of all sorts, that Dublin alone could not meet it, and carriages were obtained from Bray, and various other places around the metropolis. The procession was composed of Repeal wardens, members of the Repeal Association, the Lord Mayor, aldermen, and town council, personal friends and political admirers of O\u0027Connell. \n \n The news of his liberation was carried that night by the mail coaches over all parts of the country, and produced extraordinary excitement throughout the south and west, particularly in Cork, which Mr. O\u0027Connell then represented. There the whole population seems to have turned out, some of the streets being so packed that it was impossible to get along. Processions were soon formed, with bands of music, and green boughs. Even the little children were furnished with the emblems of victory. Along the country roads, too, as well as in the towns and villages, every little cabin had its green boughs stuck up, and its group of inhabitants shouting for \"the Liberator.\" At night, in the towns, every house was illuminated, while bonfires blazed on the mountains, and the horizon seemed on fire in every direction. On the following Sunday the liberation of the prisoners was celebrated in the Metropolitan Church, Dublin. Archbishop Murray sat with his mitre on, and in his grandest robes, on an elevated throne, with crimson canopy. On the opposite side, beneath the pulpit, were chairs of state, on which sat O\u0027Connell and the rest of the \"Repeal martyrs.\" A Te Deum was sung for the deliverance of the liberator of his country; a sermon was preached by O\u0027Connell\u0027s devoted friend and chaplain, the Rev. Dr. Miley, who ascribed the liberation, not to the law lords, but to the Virgin Mary. \n \n [533] \n \n O\u0027CONNELL RETURNING HOME FROM PRISON. (See p. 532.) \n [See larger version] \n \n Notwithstanding these rejoicings, however, there is no doubt that the imprisonment completely broke the spirit of O\u0027Connell. During 1843 he had been urged forward by the impetuosity and warlike spirit of the Young Ireland party, and the excitement of the monster meetings seems to have filled his mind with the notion that he could really wield the physical power of the country in an actual contest with the Queen\u0027s forces. His prison reflections dissipated all such illusions. The enforced inactivity, at his time of life, of one accustomed to so much labour and to such constant speaking, no doubt affected his health. Probably the softening of the brain, of which he died, commenced about this time. At all events he was thenceforward an altered man, excessively cautious and timid, with a morbid horror of war and blood, and a rooted dislike of the Young Ireland leaders, which the Old Ireland party did all they could to strengthen. Mr. Smith O\u0027Brien had been the Conservative member for the county of Limerick, and had been opposed to the Repeal agitation; but the moment O\u0027Connell was arrested, he joined the Association, taking the vacant position of leader, and adopting the policy of the Young Ireland party, which avowedly tended to war and revolution. Boasting of a lineal descent from the conqueror of the Danes at Clontarf, and hailed by some of his admirers as one who had a right to wear his crown, the new convert to Repeal seemed determined to go all lengths for the liberation of[534] his country from the Saxon yoke. O\u0027Connell at first seemed to rejoice in the accession of strength to the cause, but signs of jealousy and dislike were soon manifested. In private there was a marked coolness between the two leaders, and when, at the meetings of the Association, any of the Young Ireland orators gave utterance to martial sentiments, they were promptly called to order by O\u0027Connell; but they revenged themselves by frequently outvoting him in committee, which was a grievous mortification to one so long accustomed to almost absolute rule among his followers. He attended Parliament during the Session of 1845-46, diligently performing his duties as a representative, sitting in committees, and taking part in the debates of the House. During his absence the Young Ireland party gained a complete ascendency in the Repeal Association. Mr. Smith O\u0027Brien, who refused to sit on any committee in the House of Commons not connected with Irish business, and was imprisoned in the cellar for his contumacy, made himself an idol with the revolutionary party at home by his refractory spirit and the perversity of his conduct. The other leaders of that party who exerted the greatest influence were Thomas Davis, Charles Gavan Duffy, D\u0027Arcy M\u0027Gee, and Thomas Meagher—all men of superior ability, whose organ, the Nation, exerted great influence throughout the country. Ultimately, a series of \"peace resolutions,\" which were proposed in the Repeal Association, pledging its members to abjure the sword as an instrument for redressing the grievances of Ireland, caused an open rupture between the two parties. The Young Irelanders seceded in a body from Conciliation Hall, and established an organisation of their own—\"The Irish Confederation.\" From this time the Repeal rent rapidly fell off, and when O\u0027Connell again returned to Dublin he found that the spell of his enchantment, once so potent, was broken; and the famine came soon after, to consummate his affliction and break his heart. Before the sad close of his public career had arrived, and pending the issue of the State trial, O\u0027Connell had a proof of the magnanimity of the English people, of those Saxons whose national character he had so often assailed and maligned. When he appeared at one of the Anti-Corn-Law meetings in Covent Garden Theatre, his reception by the assembled multitude is described as one of the most magnificent displays of popular enthusiasm ever witnessed. They remembered only that his jury was packed, that his judges were prejudiced, and that he had been for thirty years the able and consistent opponent of the Corn Laws. He declared himself that he was not prepared for such a demonstration, even by the experience of the monster meetings. This great triumph on English ground seemed to infuse new life into the veteran agitator, for his speech on that occasion was one of the finest and most effective he ever delivered. \n \n In the meantime the Irish State trial, and the affairs of Ireland generally, were the subject of frequent discussions in both Houses of Parliament. On the 13th of February the Marquis of Normanby moved a resolution condemnatory of the policy of the Government, contrasting it with his own Administration, with the treatment of Canada, and with the liberal policy by which, he said, Austria had conquered disaffection in Lombardy. He was answered by Lord Roden and others, and on a division his motion was rejected by a majority of 175 to 78. On the same day the state of Ireland was introduced by Lord John Russell, in a speech which occupied three hours. The debate that followed lasted for nine days. The principal speakers who took part in it were Mr. Wyse, Sir James Graham, Mr. Young, Sir George Grey, Lord Eliot, Mr. Shaw, the Recorder of Dublin, Lord Howick, Lord Stanley, Mr. Macaulay, Sir William Follett, Sir Thomas Wilde, Sir F. Pollock, the English Attorney-General, Mr. Roebuck, Mr. O\u0027Connell, Mr. Sheil, and Sir Robert Peel. The discussion turned mainly upon the question whether or not O\u0027Connell had had a fair trial, and upon this the lawyers and the House pronounced opinions in harmony with the interests of their respective parties. But nearly every topic that could be mentioned was brought up in the course of the monster debate. Sir Robert Peel concluded a long and able speech in defence of his Government with the following beautiful peroration:—\"I have a firm conviction that if there were calm and tranquillity in Ireland, there is no part of the British empire that would make such rapid progress in improvement. There are facilities for improvement and opportunities for it which will make the advance of Ireland more rapid than the advance of any other country. I will conclude, then, by expressing my sincere and earnest hope that this agitation, and all the evil consequences of it, may be permitted to subside; and hereafter, in whatever capacity I may be, I should consider that the happiest day of my life when I could see the beloved Sovereign of these realms fulfilling the fondest wishes of her heart, possessing a feeling of affection towards all her people, but mingling that[535] affection with sympathy and tenderness towards Ireland. I should hail the dawning of that auspicious day, when she could alight like some benignant spirit on the shores of Ireland, and lay the foundations of a temple of peace; when she could, in accents which proceeded from the heart—spoken to the heart rather than to the ear—call upon her Irish subjects of all classes and of all denominations, Protestants and Roman Catholics, Saxon and Celt, to forget the difference of creed and of race, and to hallow that temple of peace which she should then found, with sacrifices still holier than those by which the temples of old were hallowed—by the sacrifice of those evil passions that dishonour our common faith, and prevent the union of heart and hand in defence of our common country.\" \n \n We now arrive at the \"Irish Crisis,\" the famine of 1846 and 1847—one of the greatest calamities that ever afflicted the human race. In order to understand fully the events connected with this visitation, it is necessary to notice the social condition of the country which rendered its effects so destructive. Ireland had long been in a chronic state of misery, which has been ascribed by the most competent judges to the peculiar state of the land tenure in that country. It had often been predicted by writers on the state of Ireland, that, owing to this rottenness at the foundation of the social fabric, it would come down with a crash some day. The facts reported by the Census Commissioners of 1841 showed that this consummation could not be far off. Out of a population of 8,000,000, there were 3,700,000 above the age of five years who could neither read nor write; while nearly three millions and a half lived in mud cabins, badly thatched with straw, having each but one room, and often without either a window or a chimney. These figures indicate a mass of ignorance and poverty which could not be contemplated without alarm, and the subject was, therefore, constantly pressed upon the attention of Parliament. As usual in cases of difficulty, the Government, feeling that something should be done, and not knowing what to do, appointed, in 1845, a commission to inquire into the relations between landlord and tenant, and the condition of the working classes. At the head of this commission was the Earl of Devon, a benevolent nobleman, whose sympathies were on the side of the people. Captain Kennedy, the secretary to the Commissioners, published a digest of the report of the evidence, which presented the facts in a readable form, and was the means of diffusing a large amount of authentic information on the state of Ireland. The Commissioners travelled through the country, held courts of inquiry, and examined witnesses of all classes. As the result of their extensive intercourse with the farming classes and their own observations, they were enabled to state that in almost every part of Ireland unequivocal symptoms of improvement, in spite of many embarrassing and counteracting circumstances, continually presented themselves to the view, and that there existed a very general and increasing spirit and desire for the promotion of such improvement, from which the most beneficial results might fairly be expected. Indeed, speaking of the country generally, they add: \"With some exceptions, which are unfortunately too notorious, we believe that at no former period did so active a spirit of improvement prevail; nor could well-directed measures for the attainment of that object have been proposed with a better prospect of success than at the present moment.\" \n \n But this improvement produced no sensible effect upon the mass of labouring people. However brightly the sun of prosperity might gild the eminences of society, the darkness of misery and despair settled upon the masses below. The Commissioners proceed:—\"A reference to the evidence of most of the witnesses will show that the agricultural labourer of Ireland continues to suffer the greatest privations and hardships; that he continues to depend upon casual and precarious employment for subsistence; that he is still badly housed, badly fed, badly clothed, and badly paid for his labour. Our personal experience and observation during our inquiry have afforded us a melancholy confirmation of these statements; and we cannot forbear expressing our strong sense of the patient endurance which the labouring classes have generally exhibited under sufferings greater, we believe, than the people of any other country in Europe have to sustain.\" \n \n It was found that the potato was almost the only food of the Irish millions, and that it formed their chief means of obtaining the other necessaries of life. A large portion of this crop was grown under the conacre system, to which the poorest of the peasantry were obliged to have recourse, notwithstanding the minute subdivision of land. In 1841 there were 691,000 farms in Ireland exceeding one acre in extent. Nearly one-half of these were under five acres each. The number of proprietors in fee was estimated at 8,000—a smaller number in proportion to the extent of territory than in any other country of Western[536] Europe except Spain. In Connaught, several proprietors had 100,000 acres each, the proportion of small farms being greater there than in the rest of Ireland. The total number of farms in the province was 155,842, and of these 100,254 consisted of from one to five acres. If all the proprietors had resided among their tenantry, and been in a position to encourage their industry and care for their welfare, matters would not have been so bad; but most of the large landowners were absentees. It frequently happened that the large estates were held in strict limitation, and they were nearly all heavily encumbered. The owners preferred living in England or on the Continent, having let their lands on long leases or in perpetuity to \"middlemen,\" who sublet them for as high rents as they could get. Their tenants again sublet, so that it frequently happened that two, three, or four landlords intervened between the proprietors and the occupying tenant, each deriving an interest from the land. The head landlord therefore, though ever so well-disposed, had no power whatever to help the occupying tenants generally, and of those who had the power, very few felt disposed. There were extensive districts without a single resident proprietor, and when the absentees were appealed to by the local relief committees during the famine to assist the perishing people, they seldom took the trouble of answering the application. \n \n The minute subdivision of land which placed the population in a state of such complete dependence upon the potato was first encouraged by the landlords, in order to multiply the number of voters, and increase their Parliamentary interest; but subsequently, as the population increased, it became in a great measure the work of the people themselves. The possession of land afforded the only certain means of subsistence, and a farm was therefore divided among the sons of the family, each one, as he was married—which happened early—receiving some share, and each daughter also often getting a slice as her marriage-portion. In vain were clauses against subletting inserted in leases; in vain was the erection of new houses prohibited; in vain did the landlord threaten the tenant. The latter relied upon the sympathy of his class to prevent ejectment, and on his own ingenuity to defeat the other impediments to his favourite mode of providing for his family. This process was at length carried to an extreme that became perfectly ludicrous. Instead of each sub-tenant or assignee of a portion of the farm receiving his holding in one compact lot, he obtained a part of each particular quality of land, so that his tenement consisted of a number of scattered patches, each too small to be separately fenced, and exposed to the constant depredations of his neighbours\u0027 cattle, thus affording a fruitful source of quarrels, and utterly preventing the possibility of any improved system of husbandry. These small patches, however, were not numerous enough to afford \"potato gardens\" for the still increasing population, and hence arose the conacre system, by which those who occupied no land were enabled to grow potatoes for themselves. Tempted by the high rent, which varied from ￡8 to ￡14 an acre without manure, the farmers gave to the cottiers in their neighbourhood the use of their land merely for the potato crop, generally a quarter of an Irish acre to each. On this the cottier put all the manure he could make by his pig, or the children could scrape off the road during the year, and \"planted\" his crop of potatoes, which he relied upon as almost the sole support of his family. On it he also fed the pig, which paid the rent, or procured clothes and other necessaries if he had been permitted to pay the rent with his own labour. The labourer thus became a commercial speculator in potatoes. He mortgaged his labour for part of the ensuing year for the rent of his field. If his speculation proved successful, he was able to replace his capital, to fatten his pig, and to support himself and his family, while he cleared off his debt to the farmer. If it failed, his former savings were gone, his heap of manure had been expended to no purpose, and he had lost the means of rendering his pig fit for the market. But his debt to the farmer still remained, and the scanty wages which he could earn at some periods of the year were reduced, not only by the increased number of persons looking for work, but also by the diminished ability of the farmers to employ them. Speculation in potatoes, whether on a large or small scale, had always been hazardous in the southern and westerly portions of Ireland. There had been famines from the failure of that crop at various times, and a remarkably severe one in 1822, when Parliament voted ￡300,000 for public works and other relief purposes, and subscriptions were raised to the amount of ￡310,000, of which ￡44,000 was collected in Ireland. In 1831 violent storms and continual rain brought on another failure of the potato crop in the west of Ireland, particularly along the coast of Galway, Mayo, and Donegal. On this occasion the English public, with ready sympathy, again came forward, and subscriptions were raised, amounting to about[537] ￡75,000. On several other occasions subsequently, the Government found it necessary to advance money for the relief of Irish misery, invariably occasioned by the failure of the potatoes, and followed by distress and disease. The public and the Legislature had therefore repeated warnings of the danger of having millions of people dependent for existence upon so precarious a crop. \n \n FATHER MATHEW AND THE FAMINE-STRICKEN POOR. (See p. 537.) \n [See larger version] \n \n In the year 1845 marked symptoms appeared of the approaching total failure of the national food. The early crop had been saved, but throughout the whole country the late crop was lost. As, however, the grain crop was abundant, the loss was not so severely felt. But the Government were so alarmed that they appointed a commission, consisting of Professors Kane, Lindley, and Playfair, eminent chemists, to inquire into the cause of the failure; but all their skill was unavailing to discover the nature of the mysterious agency by which the destruction was effected. The farmers and peasantry were not deterred from putting in an abundant crop of potatoes next year. In the beginning of the season the crops seemed in excellent condition, and there was every prospect of a plentiful harvest; but suddenly the blight came, as if the crop had been everywhere smitten with lightning, or a withering blast had swept over the whole country. \"On the 27th of July,\" said Father Mathew, \"I passed from Cork to Dublin, and this doomed plant bloomed in all the luxuriance of an abundant harvest. Returning on the 3rd of August, I beheld one wide waste of putrefying vegetation. In many places the wretched people were seated on the fences of their decaying gardens, wringing their hands and bewailing bitterly the destruction that had left them foodless.\" First a brown spot appeared on the leaf; the spots gradually increased in number and size until the foliage withered, the stem became brittle, and snapped off immediately when touched. In less than a week the whole process of destruction was accomplished. The fields assumed a blackened appearance; the roots were like pigeons\u0027 eggs, which gradually rotted away, and were wholly unfit for food. In one week the chief support of the masses was utterly lost. \n \n [538] \n \n For a few weeks the cottiers and small farmers managed to eke out a subsistence by the sale of their pigs, and any little effects they had. But pigs, fowls, furniture, and clothing soon went, one after another, to satisfy the cravings of hunger. The better class of farmers lived upon their corn and cattle; but they were obliged to dismiss their servants, and this numerous class became the first victims of starvation; for when they were turned off, they were refused admission by their relations, who had not the means of feeding them. Tailors, shoemakers, and other artisans who worked for the lower classes, lost their employment and became destitute also. While the means of support failed upon every side, and food rose to such enormous prices that everything that could possibly be eaten was economised, so that the starving dogs were drowned from compassion, the famine steadily advanced from the west and south to the east and north, till it involved the whole population in its crushing grasp. It was painfully interesting to mark the progress of the visitation, even in those parts of the country where its ravages were least felt. The small farmer had only his corn, designed for rent and seed. He was obliged to take it to the mill, to ward off starvation. The children of the poor, placed on short allowance, were suffering fearfully from hunger. Mothers, heart-broken and worn down to skeletons, were seen on certain days proceeding in groups to some distant dep?t, where Indian meal was to be had at reduced prices, but still double that of the ordinary market. As they returned to their children with their little bags on their heads, a faint joy lit up their famine-stricken features. Those children, who had lived for two days and two nights on a dole of raw turnips, would now be relieved by a morsel of nourishing food. The fathers, who had absented themselves from home in order to avoid the agony of listening to their heart-piercing cries, might now sit down and look their little ones in the face. But, if the mother failed to obtain the relief for which she had travelled so far, what then? Yesterday no breakfast, no dinner, no supper; the same to-day; no prospect of better to-morrow. The destitute rushed to the workhouses, which soon became crowded to excess by those who had been able-bodied men and women, while the aged, the sickly, and the children were left to starve. Overpowered by hunger, they lay down helpless, the ready victims of the pestilence that walked close upon the footsteps of famine, and died in thousands. Let us consider the state of a population such as has been described. Scattered over remote districts, with no gentry resident within many miles, none to whom a complaint could be made but the clergyman, whose energies were overtaxed, how utterly helpless must have been the condition of those doomed people! \n \n A few sketches of the state of the population given by the agents of the Relief Committee of the Society of Friends, who exerted themselves nobly in relieving the distress, may help to give us a more vivid impression of the horrors of the famine. At Boyle they found numbers that had eaten nothing but cabbages or turnips for weeks. The children were in a condition of starvation, ravenous with hunger. At Carrick-on-Shannon a most painful and heartrending scene presented itself: poor wretches in the last stage of famine, imploring to be received into the house; women that had six or seven children begging that even two or three of them might be taken in, as their husbands were earning but eightpence a day. Famine was written in their faces. On bread being given to some of these poor creatures, many of them devoured it with ravenous voracity. But the mothers restrained themselves, and carried home portions to their children. The famine produced a peculiar effect on the appearance of the young. Their faces looked wan and haggard, seeming like old men and women, with an extraordinary sharpness of expression; they had lost all their natural sprightliness, making no attempt to play. In the crowded workhouses their bedding consisted of dirty straw, in which they were laid in rows on the floor, even as many as six persons being crowded under one rug—the living and the dying stretched side by side beneath the same miserable covering. The town of Westport was in itself a strange and fearful sight, like what we read of in beleaguered cities; its streets crowded with gaunt wanderers, sauntering to and fro with hopeless air and hunger-struck appearance; a mob of starved, almost naked women around the poor-house, clamouring for soup-tickets. \n \n When the visitors entered a village, their first question was, \"How many deaths?\" \"The hunger is upon us,\" was everywhere the cry; and involuntarily they found themselves regarding this hunger as they would an epidemic, looking upon starvation as a disease. In fact, as they passed along, their wonder was, not that the people died, but that they lived; and Mr. W. E. Forster, in his report, said, \"I have no doubt whatever that in any other country the mortality would have been far greater; and that many lives have been[539] prolonged, perhaps saved, by the long apprenticeship to want in which the Irish peasant has been trained, and by that lovely, touching charity which prompts him to share his scanty meal with his starving neighbour. But the springs of this charity must be rapidly dried up. Like a scourge of locusts, the hunger daily sweeps over fresh districts, eating up all before it. One class after another is falling into the same abyss of ruin.\" \n \n One of the most appalling of the narratives sent to the Central Committee of the Society of Friends was Mr. William Bennet\u0027s account of his journey in Ireland. He left Dublin on the 12th of January, and proceeded by coach to Longford, and thence to Ballina, from which he penetrated into remote districts of the county Mayo. In the neighbourhood of Belmullet he and his companion visited a district which may serve as a representation of the condition of the labouring class generally in the mountainous and boggy districts, where they burrowed and multiplied, more like a race of inferior animals than human beings. \"Many of the cabins,\" wrote Mr. Bennet, \"were holes in the bog, covered with a layer of turf, and not distinguishable as human habitations from the surrounding moors, until close down upon them. The bare sod was about the best material of which any of them were constructed. Doorways, not doors, were provided at both sides of the latter, mostly back and front, to take advantage of the way of the wind. Windows and chimneys, I think, had no existence. A second apartment or partition of any kind was exceedingly rare. Furniture properly so called, I believe, may be stated at nil. I cannot speak with certainty, and wish not to speak with exaggeration, we were too much overcome to note specifically; but as far as memory serves, we saw neither bed, chair, nor table at all. A chest, a few iron or earthen vessels, a stool or two, the dirty rags and night coverings, formed about the sum total of the best-furnished. Outside many were all but unapproachable from the mud and filth surrounding them; the scene inside is worse, if possible, from the added closeness, darkness, and smoke.... And now language utterly fails me in attempting to depict the state of the wretched inmates.... We entered a cabin. Stretched in one dark corner, scarcely visible from the smoke and rags that covered them, were three children huddled together, lying there because they were too weak to rise, pale and ghastly; their little limbs, on removing a portion of the covering, perfectly emaciated; eyes sunk, voice gone, and evidently in the last stage of actual starvation. Crouched over the turf embers was another form, wild and all but naked, scarcely human in appearance. It stirred not nor noticed us. On some straw, soddened upon the ground, moaning piteously, was a shrivelled old woman, imploring us to give her something, baring her limbs partly to show how the skin hung loose from her bones, as soon as she attracted our attention. Above her, on something like a ledge, was a young woman with sunken cheeks, a mother, I have no doubt, who scarcely raised her eyes in answer to our inquiries; but pressed her hand upon her forehead, with a look of unutterable anguish and despair.... Every infantile expression had entirely departed; and, in some, reason and intelligence had evidently flown. Many were remnants of families, crowded together in one cabin; orphaned little relatives taken in by the equally destitute, and even strangers—for these poor people are kind to each other, even to the end. In one cabin was a sister, just dying, lying beside her little brother, just dead. I have worse than this to relate; but it is useless to multiply details, and they are, in fact, unfit.\" \n \n It was not only in the wild and dreary west, always the most neglected part of Ireland, without resident gentry, without a middle class, without manufacturers, and almost without towns, that the desolating effects of the famine were felt. In Ulster, even in the best counties and most thriving manufacturing districts, where the people were intensely industrious, orderly, and thrifty, some of its worst horrors were endured. In the county of Armagh, where the very small farmers kept themselves in comfort by weaving linen in their own houses, they were obliged to work their looms by night as well as by day in order to keep hunger from their homes. They worked till, by exhaustion and want of sleep, they were compelled to lie down. Many of them were obliged to sell or pawn all their clothes. In many cases, and as a last resource, those stout-hearted Presbyterians had to sell their Bibles in order to purchase a meal of food for their children. A clergyman of the Church of England in that county wrote to the Committee of the Society of Friends that he had seen the living lying on straw by the side of the unburied dead, who had died three days before. Not only the aged and infirm, not only women and children, but strong men, he had known to pine away till they died of actual starvation. Strong, healthy girls became so emaciated that they could not stand or move a limb. He visited[540] houses, once comfortable homes, in which not an article of furniture remained. The poor-house of Lurgan was shut. Seventy-five persons died there in one day. In Armagh poor-house forty-five died weekly. The poor-houses became pest-houses, which sent forth the miasma of death into every parish, already full of dysentery and fever. The congregations in the various churches were reduced to almost nothing. Deaths occurred so rapidly that the Roman Catholic priest ceased to attend funerals in his graveyard. The most deplorable accounts came from Cork, and especially from Skibbereen, a remote district of that county. In December, 1846, Father Mathew wrote to Mr. Trevelyan, then Secretary of the Treasury, that men, women, and children were gradually wasting away. They filled their stomachs with cabbage-leaves, turnip-tops, etc., to appease the cravings of hunger. There were then more than 5,000 half-starved wretches from the country begging in the streets of Cork. When utterly exhausted they crawled to the workhouse to die. The average of deaths in that union were then over 100 a week. At Crookhaven the daily average of deaths was from ten to twelve; and as early as the first Sunday in September a collection was made to purchase a public bier, on which to take the coffinless dead to the grave, the means to procure coffins being utterly exhausted in that locality. Earlier still in Skibbereen numerous cases had occurred of the dead being kept for several days above ground for want of coffins. In some cases they were buried in the rags in which they died. Throughout the entire west of the county of Cork it was a common occurrence to see from ten to a dozen funerals in the course of the day during the close of 1846. \n \n FATHER MATHEW. \n [See larger version] \n \n Mr. J. F. Maguire, who writes as an eye-witness of the scenes he describes, referring to the spring of 1847, says:—\"The famine now raged in every[541] part of the afflicted country, and starving multitudes crowded the thoroughfares of the cities and large towns. Death was everywhere—in the cabin, on the highway, in the garret, in the cellar, and even on the flags or side-paths of the most public streets of the city. In the workhouses, to which the pressure of absolute starvation alone drove the destitute, the carnage was frightful. It was now increasing at prodigious pace. The number of deaths at the Cork workhouse in the last week of January, 1847, was 104. It increased to 128 in the first week in February, and in the second week of that month it reached 164; 396 in three weeks. During the month of April as many as thirty-six bodies were interred in one day in that portion of Father Mathew\u0027s cemetery reserved for the free burial of the poor; and this mortality was entirely independent of the mortality in the workhouse. During the same month there were 300 coffins sold in a single street in the course of a fortnight, and these were chiefly required for the supply of a single parish. From the 27th of December, in 1846, to the middle of April, in 1847, the number of human beings that died in the Cork workhouse was 2,130! And in the third week of the following month the free interments in the Mathew cemetery had risen to 277—as many as sixty-seven having been buried in one day. The destruction of human life in other workhouses of Ireland kept pace with the appalling mortality in the Cork workhouse. According to official returns, it had reached in April the weekly average of twenty-five per 1,000 inmates; the actual number of deaths being 2,706 for the week ending the 3rd of April, and 2,613 in the following week. Yet the number of inmates in the Irish workhouses was but 104,455 on the 10th of April, the entire of the houses not having then been completed. \n \n ON BOARD AN EMIGRANT SHIP AT THE TIME OF THE IRISH FAMINE. (See p. 542.) \n [See larger version] \n \n \"More than 100 workhouse officers fell victims to the famine fever during this fatal year, which also decimated the ranks of the Catholic clergy of the country. Mr. Trevelyan gives names of thirty English and Scottish priests who sacrificed their lives to their zealous attendance on the immigrant Irish, who carried the pestilence with them in their flight to other portions of the United Kingdom. Pestilence likewise slew its victims in the[542] fetid hold of the emigrant ship, and, following them across the ocean, immolated them in thousands in the lazar houses that fringed the shores of Canada and the United States. The principal business of the time was in meal, and coffins, and passenger ships. A fact may be mentioned which renders further description of the state of the country needless. The Cork Patent Saw Mills had been at full work from December, 1846, to May, 1847, with twenty pairs of saws, constantly going from morning till night, cutting planks for coffins, and planks and scantlings for fever sheds, and for the framework of berths for emigrant ships.\" \n \n At the Church of St. Anne, Shandon, under a kind of shed attached to a guard-house, lay huddled up in their filthy fetid rags about forty human creatures—men, women, children, and infants of the tenderest age—starving and fever-stricken, most of them in a dying state, some dead, and all gaunt, yellow, hideous from the combined effects of famine and disease. Under this open shed they had remained during the night, and until that hour—about ten in the morning—when the funeral procession was passing by, and their indescribable misery was beheld by the leading citizens of Cork, including the mayor, and several members of the board of guardians. The odour which proceeded from that huddled-up heap of human beings was of itself enough to generate a plague. \n \n Skibbereen was described as \"one mass of famine, disease, and death; the poor rapidly sinking under fever, dysentery, and starvation.\" There, as early as the first week in February, 1847, there was constant use for a coffin with movable sides, in which the dead were borne to the grave, and there dropped into their last resting-place. On the whole, the resignation of this stricken people was something wonderful. Outrage was rare, and the violations of the rights of property were not at all so numerous as might have been expected from persons rendered desperate by hunger; and where such things occurred, the depredators were not those who suffered the severest distress. But as the famine proceeded in its desolating course, and people became familiar with its horrors, the demoralising effects of which we have read in such visitations were exhibited in Ireland also. Next to the French, the Irish have been remarkable for their attention to the dead, as well as for the strength of their domestic affections. They had a decent pride in having a respectable \"wake\" and funeral when they lost any member of the family; and however great their privations were, they made an effort to spare something for the last sad tokens of respect for those they loved. But now there was no mourning for the dead, and but little attention paid to the dying. The ancient and deep-rooted custom with regard to funerals was \"swept away like chaff before the wind.\" The funerals were rarely attended by more than three or four relatives or friends. Sometimes the work of burial was left entirely to persons hired to do it, and in many cases it was not done at all for five or six days after death, and then it was only by threats and rewards that any persons could be got to perform the dangerous duty. \n \n The demoralisation appeared further in the abuses connected with the distribution of relief. The reports of the Commissioners have stated that, in those districts where the relief committees worked together with zeal and in good faith, the administration was excellent, checking fraud and imposture, while it relieved the really distressed. But in some districts this was unhappily not the case. Abuses existed, varying from apathy and neglect to connivance at frauds and misappropriation of the funds. Gross impositions were daily practised by the poor. The dead or absent were personated; children were lent for a few days in order to give the appearance of large families, and thus entitle the borrowers to a greater number of rations. Almost the whole population, in many cases, alleged poverty and looked for relief; and then, conceiving the receipt of cooked food a degradation, they endeavoured to compel the issue of raw meal. One universal spirit of mendicancy pervaded the people, to which in several places the committees offered no opposition. Yielding to intimidation, or seeking for popularity, they were willing to place the whole population indiscriminately on the lists to be supported by public charity. \n \n The Marquis of Lansdowne, the President of the Council in the Whig Ministry which had replaced that of Sir Robert Peel, in a speech delivered in the House of Lords on the 25th of January, 1847, gave an estimate, as accurate as the best calculation could make it, of the loss in money value that had been occasioned by the failure of the crops in Ireland. \"Taking a valuation of ￡10 per acre for potatoes, and ￡3 10s. for oats, the deficiency on the potato crop alone amounted to ￡11,350,000, while on the crop of oats it amounted to ￡4,660,000, or to a total value of ￡16,010,000 for the whole of a country which, if it could not be said to be the poorest, was certainty not one of the richest in the world. In[543] weight the loss was 9,000,000 or 10,000,000 tons of potatoes. The whole loss had been equivalent to the absolute destruction of 1,500,000 arable acres.\" On the same day, Lord John Russell, who had succeeded Peel as Prime Minister, gave a statement of what the Government had done during the recess for the relief of the Irish population, in pursuance of Acts passed in the previous Session. He stated that an immense staff of servants had been employed by the Board of Public Works—upwards of 11,000 persons—giving employment to half a million of labourers, representing 2,000,000 of souls; the expense for the month of January being estimated at from ￡700,000 to ￡800,000. \n \n It was proposed also to form, in certain districts, relief committees, which should be empowered to receive subscriptions, levy rates, and take charge of donations from the Government; and that out of the fund thus raised they should establish soup kitchens, and deliver rations to the famishing inhabitants. Sir John Burgoyne, Inspector-General of Fortifications, was appointed to superintend the works. Lord John Russell referred to measures for draining and reclaiming waste land in Ireland, and to advances of money for this purpose to the proprietors, to be repaid in instalments spread over a number of years. On a subsequent day, in answer to questions from Mr. Roebuck, the noble lord gave a statement of the sums that had already been advanced. ￡2,000,000 had been issued on account of the Poor Employment Act of the last Session. He expected that not less than ￡500,000 or ￡600,000 a month would be spent from the present time until August, and he calculated the whole expenditure would not be less than ￡7,000,000. There was great difference of opinion on the subject of the Government plans. A counter-scheme for the establishment of reproductive works deserves to be noticed for the interest it excited and the attention it occupied for years afterwards—namely, the railway plan of Lord George Bentinck. Acts of Parliament, he said, had been passed for 1,582 miles of railway in Ireland, of which only 123 miles had then been completed, while 2,600 miles had been completed in England. In order to encourage the formation of Irish railways, therefore, he proposed that for every ￡100 expended by the companies ￡200 should be lent by the Government at the same interest at which they borrowed the money, Mr. Hudson, who was \"chairman of 1,700 miles of railroad,\" pledging his credit that the Government would not lose a shilling by the transaction. By adopting this plan they could give reproductive employment to 109,000 men in different parts of the country, for earth-works, fences, drains, and watercourses connected with the lines. This would give support of 550,000 souls on useful work, tend to develop the resources of the country, and produce such improvement that the railways constructed would add ￡23,000,000 to the value of landed property in twenty-five years, and would pay ￡22,500 a year to the poor rates. The purchase of land for the railways would moreover place ￡1,250,000 in the hands of Irish proprietors, for the employment of fresh labour, and ￡240,000 in the hands of the occupying tenants for their own purposes. The Government also would reap from the expenditure of ￡24,000,000 on railways in Ireland, an enormous increase of revenue in the augmented consumption of articles of excise and customs. The noble lord\u0027s speech, which lasted two hours and a half, was received with cheers from both sides of the House. Leave was given to bring in the Bill, though it was strongly objected to by Lord John Russell, Mr. Labouchere, and other members of the Government. It was also opposed by Sir Robert Peel, who exposed the unsoundness of the economic principles involved in it. The Bill was rejected by a majority of 204, the numbers being 118 for the second reading, and 322 against it. Notwithstanding this decision, loans were subsequently advanced to certain Irish railways, amounting to ￡620,000, so that the objection of the Government was more to the extent than to the principle of Lord George Bentinck\u0027s measure. \n \n As in the whole history of the world, perhaps, so great a calamity as the Irish famine never called for sympathy and relief, so never was a more generous response elicited by any appeal to humanity. The Government and the Legislature did all that was possible with the means at their disposal, and the machinery that already existed, or could be hastily constructed, to meet the overwhelming emergency. The newly established Poor Law system, though useful as far as it went, was quite inadequate to meet such great distress. It had been passed while the country was comparatively prosperous, and contained no provision for such a social disorganisation as this famine. By the Acts of 1 and 2 Victoria, c. 56, no outdoor relief whatever could be given in any circumstances. The size of the unions was also a great impediment to the working of the Poor Law. They were three times the extent of the corresponding divisions in England. In Munster and[544] Connaught, where there was the greatest amount of destitution and the least amount of local agency available for its relief, the unions were much larger than in the more favoured provinces of Ulster and Leinster. The union of Ballina comprised a region of upwards of half a million acres, and within its desert tracts the famine assumed its most appalling form, the workhouse being more than forty miles distant from some of the sufferers. As a measure of precaution, the Government had secretly imported and stored a large quantity of Indian corn, as a cheap substitute for the potato, which would have served the purpose much better had the people been instructed in the best modes of cooking it. It was placed in commissariat dep?ts along the western coast of the island, where the people were not likely to be supplied on reasonable terms through the ordinary channels of trade. The public works consisted principally of roads, on which the people were employed as a sort of supplement to the Poor Law. Half the cost was a free grant from the Treasury, and the other half was charged upon the barony in which the works were undertaken. The expense incurred under the Labour Rate Act, 9 and 10 Victoria, c. 107,\" amounted to ￡4,766,789. It was almost universally admitted, when the pressure was over, that the system of public works adopted was a great mistake; and it seems wonderful that such grievous blunders could have been made with so many able statesmen and political economists at the head of affairs and in the service of the Government. The public works undertaken consisted in the breaking up of good roads to level hills and fill hollows, and the opening of new roads in places where they were not required—work which the people felt to be useless, and which they performed only under strong compulsion, being obliged to walk to them in all weathers for miles, in order to earn the price of a breakfast of Indian meal. Had the labour thus comparatively wasted been devoted to the draining, subsoiling, and fencing of the farms, connected with a comprehensive system of arterial drainage, immense and lasting benefit to the country would have been the result, especially as works so well calculated to ameliorate the soil and guard against the moisture of the climate might have been connected with a system of instruction in agricultural matters of which the peasantry stood so much in need, and to the removal of the gross ignorance which had so largely contributed to bring about the famine. As it was, enormous sums were wasted. Much needless hardship was inflicted on the starving people in compelling them to work in frost and rain when they were scarcely able to walk, and, after all the vast outlay, very few traces of it remained in permanent improvements on the face of the country. The system of Government relief works failed chiefly through the same difficulty which impedes every mode of relief, whether public or private—namely, the want of machinery to work it. It was impossible suddenly to procure an efficient staff of officers for an undertaking of such enormous magnitude—the employment of a whole people. The overseers were necessarily selected in haste; many of them were corrupt, and encouraged the misconduct of the labourers. In many cases the relief committees, unable to prevent maladministration, yielded to the torrent of corruption, and individual members only sought to benefit their own dependents. The people everywhere flocked to the public works; labourers, cottiers, artisans, fishermen, farmers, men, women, and children—all, whether destitute or not, sought for a share of the public money. In such a crowd it was almost impossible to discriminate properly. They congregated in masses on the roads, idling under the name of work, the really destitute often unheeded and unrelieved because they had no friend to recommend them. All the ordinary employments were neglected; there was no fishing, no gathering of seaweed, no collecting of manure. The men who had employment feared to lose it by absenting themselves for any other object; those unemployed spent their time in seeking to obtain it. The whole industry of the country seemed to be engaged in road-making. It became absolutely necessary to put an end to it, or the cultivation of the land would be neglected. Works undertaken on the spur of the moment—not because they were needful, but merely to employ the people—were in many cases ill-chosen, and the execution equally defective. The workers, desirous to protect their employment, were only anxious to give as little labour as possible, in which their overlookers or gangers in many cases heartily agreed. The favouritism, the intimidation, the wholesale jobbing practised in many cases were shockingly demoralising. The problem was to support 2,000,000 or 3,000,000 of destitute persons, and this was in a great measure effected, though at an enormous cost to the empire. \n \n [545] \n \n FIGHTING AT THE BARRICADES IN PARIS. (See p. 551.) \n [See larger version] \n \n The following statement of the numbers receiving rations, and the total expenditure under the Act in each of the four provinces, compared with the amount of population, and the annual value assessed for poor-rate, may serve to illustrate the[546] comparative means and destitution of each province:— \n Population. Valuation. Greatest number \n of rations \n given out. Total \n Expenditure. \n Ulster 2,386,373 ￡3,320,133 346,517 ￡170,598 \n Leinster 1,973,731 4,624,542 450,606 308,068 \n Munster 2,396,161 3,777,103 1,013,826 671,554 \n Connaught 1,418,859 1,465,643 745,652 526,048 \n 8,175,124 ￡13,187,421 2,556,601 ￡1,676,268 \n \n In order to induce the people to attend to their ordinary spring work, and put in the crops, it was found necessary to adopt the plan of distributing free rations. On the 20th of March, therefore, a reduction of twenty per cent. of the numbers employed on the works took place, and the process of reduction went on until the new system of gratuitous relief was brought into full operation. The authority under which this was administered was called the \"Temporary Relief Act,\" which came into full operation in the month of July, when the destitution was at its height, and three millions of people received their daily rations. Sir John Burgoyne truly described this as \"the grandest attempt ever made to grapple with famine over a whole country.\" Never in the history of the world were so many persons fed in such a manner by the public bounty. It was a most anxious time—a time of tremendous labour and responsibility to those who had the direction of this vast machinery. This great multitude was, however, rapidly lessened at the approach of harvest, which happily was not affected by the disease. Food became comparatively abundant, and labour in demand. By the middle of August relief was discontinued in nearly one half of the unions, and ceased altogether on September 12th. It was limited by the Act to the 1st of October. This was the second year in which upwards of 3,000,000 of people had been fed out of the hands of the magistrates in Ireland; but it was now done more effectually than at first. Organised armies, it was said, had been rationed before; but neither ancient nor modern history can furnish a parallel to the fact that upwards of three millions of persons were fed every day in the neighbourhood of their own homes, by administrative arrangements emanating from, and controlled by, one central office. The expense of this great undertaking amounted to ￡1,559,212—a moderate sum in comparison with the extent of the service performed, and in which performance the machinery of the Poor Law unions was found to afford most important aid. Indeed, without such aid the service could hardly have been performed at all; and the anticipations of the advantages to be derived from the Poor Law organisation in such emergencies were fully verified. \n \n The relief committees were also authorised to adopt measures to avert or mitigate the famine fever, which had prevailed to an awful extent. They were to provide temporary hospitals, to ventilate and cleanse cabins, to remove nuisances, and procure the proper burial of the dead, the funds necessary for these objects being advanced by the Government in the same way as for furnishing food. Upwards of 300 hospitals and dispensaries were provided under the Act, with accommodation for at least 23,000 patients, and the sanitary powers which it conferred were extensively acted upon. The expense incurred for these objects amounted to ￡119,000, the whole of which was made a free gift to the unions in aid of the rates. The entire amount advanced by the Government in 1846 and 1847 towards the relief of the Irish people under the fearful calamity to which they were exposed was ￡7,132,286, of which one half was to be repaid within ten years, and the rest was a free grant. \n \n The clergy, Protestant and Roman Catholic, almost the only resident gentry in several of the destitute districts, worked together on the committees with commendable zeal, diligence, and unanimity. Among the Roman Catholic clergy, Father Mathew was at that time by far the most influential and popular. The masses of the peasantry regarded him as almost an inspired apostle. During the famine months he exerted himself with wonderful energy and prudence, first, in his correspondence with different members of the Government, earnestly recommending and urging the speedy adoption of measures of relief; and next in commending those measures to the people, dissuading the hungry from acts of violence, and preaching submission and resignation under the heavy dispensation of Providence. If the temperance organisation established by Father Mathew had been perverted to political purposes by the Repeal agitation, there is no doubt that it contributed in a very large degree to the preservation of life and property during the two awfully trying years of famine. \"It is a fact,\" said Father Mathew—\"and you are not to attribute my alluding to it to vanity—that the late provision riots have occurred in the districts where the temperance movement has not been encouraged. Our people are as harmless in their meetings as flocks of sheep, unless when inflamed and maddened by intoxicating drink. Were it not for the temperate[547] habits of the greater portion of the people of Ireland, our unhappy country would be before now one wide scene of tumult and bloodshed.\" \n \n The consumption of Indian corn during the famine caused a great deal of wild speculation in the corn trade. Splendid fortunes were rapidly made, and as rapidly lost. The price of Indian corn in the middle of February, 1847, was ￡19 per ton; at the end of March it was ￡13; and by the end of August it had fallen to ￡7 10s. The quantity of corn imported into Ireland in the first six months was 2,849,508 tons. \n \n The action of private benevolence was on a scale proportioned to the vast exertions of the Government. It is quite impossible to estimate the amount of money contributed by the public for the relief of Irish distress. We know what sums were received by associations and committees; but great numbers sent their money directly, in answer to appeals from clergymen and others, to meet demands for relief in their respective localities. In this way we may easily suppose that abuses were committed, and that much of the money received was misappropriated, although the greater portion of it was honestly dispensed. Among the organisations established for raising contributions, the greatest was the British Relief Association, which had for its chairman and vice-chairman two of our merchant princes—Mr. Jones Loyd, afterwards Lord Overstone, and Mr. Thomas Baring. The amount of subscriptions collected by this association, \"for the relief of extreme distress in Ireland and Scotland,\" was ￡269,302. The Queen\u0027s letters were issued for collections in the churches throughout England and Wales, and these produced ￡200,738, which was also entrusted to the British Relief Association. These sums made together no less than ￡470,040, which was dispensed in relief by one central committee. One-sixth of the amount was apportioned to the Highlands of Scotland, where there was extensive destitution, and the rest to Ireland. In fact, the amount applied to these objects by the association exceeded half a million sterling, for upwards of ￡130,000 had been obtained by the sale of provisions and seed corn in Ireland, and by interest accruing on the money contributed. In administering the funds placed at their disposal, the committee acted concurrently with the Government and the Poor Law authorities. It wisely determined at the outset that all grants should be in food, and not in money; and that no grant should be placed at the disposal of any individual for private distribution. The committee concluded their report to the subscribers by declaring that although evils of greater or less degree must attend every system of gratuitous relief, they were confident that any evils that might have accompanied the application of the funds would have been far more than counterbalanced by the benefits that had been conferred upon their starving fellow-countrymen, and that if ill-desert had sometimes participated in their bounty, a vast amount of human misery and suffering had been relieved. \n \n But the chief source whence the means at their disposal were derived was the magnificent bounty of the citizens of the United States of America. The supplies sent from America to Ireland were on a scale unparalleled in history. Meetings were held in Philadelphia, Washington, New York, and other cities in quick succession, presided over by the first men in the country. All through the States the citizens evinced an intense interest, and a noble generosity, worthy of the great Republic. The railway companies carried free of charge all packages marked \"Ireland.\" Public carriers undertook the gratuitous delivery of packages intended for the relief of Irish distress. Storage to any extent was offered on the same terms. Ships of war, without their guns, came to the Irish shores on a mission of peace and mercy, freighted with food for British subjects. Cargo after cargo followed in rapid succession, until nearly 100 separate shipments had arrived, our Government having consented to pay the freight of all donations of food forwarded from America, which amounted in the whole to ￡33,000. The quantity of American food consigned to the care of the Society of Friends was nearly ten thousand tons, the value of which was about ￡100,000. In addition to all this, the Americans remitted to the Friends\u0027 Committee ￡16,000 in money. They also sent 642 packages of clothing, the precise value of which could not be ascertained. There was a very large amount of remittances sent to Ireland during the famine by the Irish in the United States. Unfortunately, there are no records of those remittances prior to 1848; but after that time we are enabled to ascertain a large portion of them, though not the whole, and their amount is something astonishing. The following statement of sums remitted by emigrants in America to their families in Ireland was printed by order of Parliament:—During the years 1848, ￡460,180; 1849, ￡540,619; 1850, ￡957,087; 1851, ￡990,811. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2708/74494.html","bookId":413,"book":{"id":413,"title":"Cassell\u0027s History of England","description":"简介： The Houses of Parliament reassembled on the 17th of January, 1712, and Anne sent word that she was not able to attend in person, not having recovered sufficiently from her attack of the gout. She announced that the plenipotentiaries were now assemble...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2708","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
