{"id":92953,"no":27,"title":"Page 27","content":"\"She cannot be moved.\"\\n\\n Jack was getting angry. \"Look, doctor, I\u0027m not sure you know what\u0027s - \"\\n\\n But Cat grabbed his boss\u0027s arm.\\n\\n \"Jack! Goddammit! He\u0027s not just saying he\u0027s against it! He\u0027s saying she\u0027ll die! Annabelle will die!\"\\n\\n Crow looked darkly at the two of them, then shrugged the hand off his arm and stepped away down the hail. The three policemen eyed him suspiciously but made no move. Jack had called in every chit and favor he had with the Dallas Police to keep from being arrested, even for questioning. But nobody had actually told the patrolmen just exactly why these heavily armed and obviously fresh-from-violence people weren\u0027t to be touched. And they were wary.\\n\\n \"Dammit!\" muttered Jack and looked at his watch. \"Dammit!\" he repeated when he saw the time.\\n\\n Because they had already been here all night and most of the day. Because it was three o\u0027clock in the afternoon. How many more hours until sunset?\\n\\n Until night?\\n\\n Until they came?\\n\\n \"Mr. Crow,\" the doctor tried again, \"it\u0027s not just a matter of blood loss. It\u0027s the trauma to the system. Her signs are very low, her heart has fluttered, she has a concussion, she - \"\\n\\n \"Hell, doctor, she\u0027s awake, for chrissakes!\"\\n\\n The doctor remained calm. He nodded. \"Sometimes. Barely. She\u0027s a strong woman. But she\u0027s not strong enough to leave intensive care. Not for at least one more day. She must have constant monitoring. She must have the IVs. She must stay here.\"\\n\\n He stepped forward and said, more gently, \"Don\u0027t worry, Mr. Crow. We\u0027ll take good care of her. She\u0027ll be fine.\"\\n\\n Jack Crow looked at the man and knew he meant it and knew he didn\u0027t know what he was dealing with and he knew something else: there was no way the Team could ever convince him otherwise in time.\\n\\n Felix had been leaning against the corridor wall with his arms crossed in front of his chest, looking sinister with his bandaged head over the even dozen stitches they had had to give him. He uncrossed his arms and stepped away from the wall.\\n\\n \"Is there a place... a room, where we could talk?\" he asked.\\n\\n The doctor eyed him gratefully and led them around a corner to a small anteroom that, judging from the cigarette smoke, served as the break area for the Emergency Room staff. It had a couple of tables covered with soggy cardboard coffee cups and overflowing ashtrays, some plastic chairs, a vending machine, a pay phone.\\n\\n The three men sat down and added to the smoke.\\n\\n \"Jack,\" Cat all but whispered, \"we\u0027re going to have to risk it, you know.\"\\n\\n Crow didn\u0027t look at him, didn\u0027t respond, just puffed hard on his cigarette.\\n\\n Cat exchanged a look with Felix before trying again.\\n\\n \"We can\u0027t move her, Jack. And... well, we can put sensors outside, out in front, so we\u0027ll know they\u0027re coming. Hell, they might not even come.\"\\n\\n Crow glared at him. \"They know she\u0027s hurt, Cherry. Do you really believe they won\u0027t come?\"\\n\\n Cat just looked at him.\\n\\n Crow turned to Felix. \"Do you?\"\\n\\n Felix met his gaze. \"No.\"\\n\\n And it was quiet for a while.\\n\\n \"But we\u0027ve got some options here,\" Cat continued. \"We don\u0027t have to fight. They\u0027ll probably come in the front - why wouldn\u0027t they? And we\u0027ll hear them and we can move her then!\"\\n\\n \"Give us that again,\" said Felix, interested.\\n\\n \"We move her out the back. Miles of hallways in this place. We\u0027ll just wheel her down the hall and into an elevator and just pick a route out the back. Look, I\u0027ve checked it out. I know just where to park the Blazer...\\n\\n And he went on for a while in convincing style and much detail, like it was, really, a great opportunity instead of the disaster it was.\\n\\n Felix sat in silence as be spoke, hating it. They all knew better. When would they come? From which direction? How many? How were they going to stop them at night? And did anyone really believe they could just trot through this hospital wheeling a critical patient? Fighting vampires along the way?\\n\\n Felix sat there and listened to Cat and watched Jack Crow and saw him again, haggard and beaten but coming through to tend to Carl\u0027s body. And then relaxed and relieved and hopeful before ten minutes later having to save the whole show single-handed.\\n\\n And now Cat trying to convince everybody this was all going to be all right.\\n\\n The Gunman smiled.\\n\\n Cat stopped talking abruptly when he saw the smile.\\n\\n \"What is it, Felix?\" Jack asked. \"What do you think of the Plan, here?\"\\n\\n \"It stinks.\"\\n\\n \"I suppose you\u0027d like to just get out of here.\"\\n\\n \"I sure would.\"\\n\\n \"Are you?\"\\n\\n Felix felt his own smile growing. Do you bastards really think I\u0027d abandon Annabelle? Or you, Crow, after what you\u0027ve done?\\n\\n \"Jack,\" he said at last, \"you\u0027re a real prick.\"\\n\\n Crow eyed him a moment. \"True,\" he replied seriously.\\n\\n And...\"Okay, okay, okay,\" he continued wearily. \"I guess we\u0027re stuck with Cat\u0027s little scheme. Unless the Gunman here has something new?\"\\n\\n \"\u0027Fraid not.\"\\n\\n \"\u0027Fraid you\u0027d say that. Okay. But I want two escape routes. Get back to the bishop\u0027s and fetch the motorhome. I want two ways out of this place. You and Cat figure out where we should stash the vehicles. And you\u0027d better take Davette somewhere. Where were we supposed to stay last night? The one by the Galleria?\"\\n\\n \"She won\u0027t go,\" said Father Adam from the doorway. \"Huh?\" asked Jack.\\n\\n Adam shook his head. \"She won\u0027t leave Annabelle\u0027s side.\" Felix snorted. \"Like hell she won\u0027t. You just - \"\\n\\n Cat shook his head, too. \"She won\u0027t, Felix.\"\\n\\n Crow and Felix exchanged looks.\\n\\n \"This is crap,\" said one of them.\\n\\n Cat leaned forward on the table.\\n\\n \"Hey, guys,\" he said gently. \"We\u0027re getting down to it. And everybody\u0027s got his own style.\"\\n\\n Felix stared at him like he was from Mars.\\n\\n \"\u0027His own style,\u0027 eh?\" muttered Jack, almost to himself. \"Well, that\u0027s nice.\"\\n\\n Then he leaned over and put his cigarette out and started giving orders.\\n\\n \"We set the detectors and we fetch the motorhome and we scope out two escape routes and then, a couple of hours before dark, somebody - you, Gunman, it\u0027s your woman - pick up our pretty little martyr and her style and put her ass in a motel because that\u0027s my style and I run things here.\"\\n\\n Felix grinned along with the rest of them and wondered why? Why? We haven\u0027t got a fucking prayer...\\n\\n \"Mr. Crow?\" came from behind Adam. It was Annabelle\u0027s nurse. The men got to their feet.\\n\\n \"Is she... ?\" Jack began.\\n\\n The nurse smiled tightly. \"She\u0027s awake again. She wants to talk to you.\"\\n\\n \"Right,\" said Jack, already moving. \"The rest of you get moving. I want the motorhome here in an hour, with all the beds down. We\u0027ve got to get some sleep before tonight.\"\\n\\n Annabelle, near death, white as a sheet, surrounded by beeping electronics and pierced through with running tubes, still managed to be radiant.\\n\\n Talk about style, thought Jack to himself as Davette got up and he took her seat.\\n\\n \"Annabelle,\" he whispered to her, \"don\u0027t you ever sleep?\"\\n\\n She didn\u0027t even bother to smile. \"Jack,\" she whispered huskily, \"we\u0027ve got to talk...\"\\n\\n But only she talked and Jack listened and he absolutely hated what he heard.\\n\\n Annabelle had figured it out. She was half-dead, but she knew the score. She knew she couldn\u0027t move. She knew the night was coming. She knew the vampires, just like Jack, had their own connections. They knew who the Team was, knew all about them. Knew about her, had actually seen her and knew she was hurt.\\n\\n And she knew they would come for her and the police would never know how to react or possibly even believe what they\u0027d seen after it was all over.\\n\\n No. She had decided. They must leave her here.\\n\\n And Jack tried to reassure her, tried most of the junk Cat had just finished throwing at him, that it wasn\u0027t like they were trapped, they could always get out the back and, besides, there was no guarantee the vampires really would show up here and...\\n\\n And she knew better, as always.\\n\\n \"Jack!\" she pleaded, her eyes frantic, \"you must go. You must save yourselves!\"\\n\\n And Crow looked right at her and said, \"We\u0027ll see.\"\\n\\n And she knew she had lost.\\n\\n \"At least get Davette.\"\\n\\n \"I\u0027ve already taken care of that,\" Jack whispered to her \"I put Felix on it.\"\\n\\n And she almost smiled. \"About time.\"\\n\\n Then she sighed and looked away for a moment. When she looked back her eyes were filled with tears and she reached up her pale skinny arm to him and he leaned down so she could caress his dirty, unshaven face.\\n\\n \"Jack...\" she sighed. \"Sweet Jack. You were... You were always such a good boy...\"\\n\\n And he didn\u0027t cry because he couldn\u0027t let her carry that, too. But his eyes were hot and her tiny fingers on his face were the softest touch he had ever known.\\n\\n Then she gave him a playful slap and pushed him a way.\\n\\n \"Where\u0027s my purse?\" she demanded. \"I must look a fright.\"\\n\\n \"Huh? You look fine...\" sputtered Crow.\\n\\n \"What do you know about it?\" she replied in her lady voice. \"Find my purse, please.\"\\n\\n So he rummaged around and found it and opened it and handed it to her.\\n\\n \"Oh, good,\" she said after she had glanced inside. \"I\u0027ve got my mirror. Now, run along.\"\\n\\n Jack frowned. \"Don\u0027t you think you should be resting? Or - \"\\n\\n \"I repeat: what do you know about it? Now go away.\"\\n\\n He rose, uncertain. \"I\u0027ll get Davette,\" he offered.\\n\\n \"Oh, please, Jack. I think I can put my own makeup on after so-and-so many years. All of you: leave me alone to myself for just one instant. Please!\"\\n\\n \"Well, okay,\" he muttered back, defeated once more. And he stumbled out through the curtain drawn around her bed and informed Davette and left to find the others.\\n\\n The glass of water on the hospital tray was close by, but it took her a long time to reach it and the effort exhausted her. She lay back against the pillow, careful not to spill the cup, and rested a moment. She closed her eyes and took a deep breath and tried to clear her mind but instead she saw the house in Pebble Beach and she saw the zoo and she saw the faces of all her boys who had died.\\n\\n \"Please, God!\" she whispered. \"No more of them. No more...\"\\n\\n And she leaned forward and fumbled one-handed through her purse and the pills were still there, where they had been for the last year.\\n\\n My boys. \\n\\n","sourceLink":"https://allnovel.net/vampire/page-27.html","bookId":2118,"book":{"id":2118,"title":"Vampire$","description":"Storyline: Vampire$ is about a tightly knit group of professional vampire killers. They may say they\u0027re in it for the money, but their death-defying bravado and warm male friendships are as intense as those in any soldier-hero epic. The irrepressible, foul-mouthed, hard-drinkin\u0027 Jack Crow--decked out in high-tech chain mail and wielding a fearsome crossbow--is the leader of the bunch. He\u0027s the sort of man who screams obscenities at the pope, and then weeps in the pontiff\u0027s lap over the horrors he\u0027s witnessed. Vampire$ is one gaudy, action-packed novel. The men are men, the women are vulnerable, and the vampires are mean, ugly monsters. Unless you don\u0027t like that sort of thing, you\u0027ll love it. --This text refers to an out of print or unavailable edition of this title.\\n","cover":"https://allnovel.net/images/vampire.jpg","author":"John Steakley","type":"Horror","source":"allnovel","link":"https://allnovel.net/vampire.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:58:17 PM"}}
