{"id":92929,"no":3,"title":"Page 3","content":"The crossbow bolt through the Dr Pepper machine aroused the motel manager from his bed to find Crow and Sheriff Ortega - arms around shoulders, swaying gently in unison - outside his office.\\n\\n \"We wuz outta change,\" said Ortega. The sheriff was being helpful.\\n\\n \"I can vouch for him on tha\u0027 one,\" added Crow, and they grinned at each other and pounded backs.\\n\\n The manager simply stared. This (to be kind) bizarre sight of two giants grinning down at him - and worse, nodding so fiercely at him out of synch it looked like a pair of paddling heads - it was all too much. The manager went back to his bed and pulled his pillow down over his ears.\\n\\n There were equally valid excuses for most of the other destruction. High spirits could be blamed for some of it, true enough. And carelessness. But most of the sheer carnage was entirely unavoidable due to the very nature of competitive sports at this, the Championship level. The list of events included Spin the Coffee Table, Pike Vaulting and the ever-popular Ash Tray Rug Hockey. All of this being merely ancillary to the main event: Drinking Yourself Blind While Waiting for The Goddamn Whores to Show Up, which, as everyone knows, is strenuous enough by definition and only becomes uglier the longer it takes.\\n\\n All in all they did $5,000 worth of damage to the motel.\\n\\n It was a lot of fun.\\n\\n The party started out with about two dozen members, counting Team Crow, the locals, and the cops. It later swelled to about fifty or so. But by 3 A.M. it was back down to the twenty or so serious-minded. Father Hernandez turned out to be hilariously funny. He sang dirty limericks in Spanish and English. Most thought that a little weird. But it turned out that Hernandez had once been a real father, as in husband, with two little girls and a red-haired wife - all of whom had died of bubonic plague, of all things, twenty years before in northwestern Mexico.\\n\\n Everybody got real misty about that and drank to their passing, and each man present agreed privately to stop calling him \"Nutless.\"\\n\\n They got a lot more depressed when a towheaded kid named, no shit, Bambi, who had wandered into the party some hours earlier from who knows where, started to cry about Hernandez\u0027s lost family. This pissed Crow off. He was already in a bad mood on account of the sheriff\u0027s badge and gun. Actually he liked wearing the badge pretty much. It was shiny and made him feel official and all and reminded him of which pocket his cigarettes were in. But the gun was one of these forty-four magnum artillery types two inches longer than his waist and every time he sat down the barrel would dig him in the balls causing him to yelp and leap to his feet to rub \u0027em and that only reminded him that the whores still weren\u0027t there and on and on and on.\\n\\n So this crying Bambi was too much on top of everything else. He cleared everybody off of the suite\u0027s main sofa with one swipe of the back of his hand and unzipped the cover off the largest cushion. Then he stepped over and picked up the sobbing Bambi by both ears and tried to zip him up inside.\\n\\n Anthony simply wouldn\u0027t have this. \"Show a little goddamn consideration, Jack!\" he snorted and unfolded the kid from the cushion. Bambi rewarded Anthony by throwing his arms around the other\u0027s neck, gurgling, \"Thank ya, brother,\" and vomiting onto his chest.\\n\\n Anthony didn\u0027t even get mad. He just took \u0027em both into what was left of the bathroom, cleaned them off, held Bambi\u0027s head while be got sick in the tub. Then he carried him, still sobbing, in his arms back to the middle of the room and sat down and began to lecture everybody present about kindness, ending with two exquisitely pertinent statements:\\n\\n \"Showing a certain measure of respect and tenderness to your fellow human souls is the way a real man exhibits class\" and \"By the way, are the fucking bimbos gonna show up or not?\"\\n\\n The combination of statements sent Cat - long since returned and almost as long dead drunk - into a cackling frenzy. He held onto his sides and rolled back and forth kicking his feet.\\n\\n The rest of the party stared at him in abject bewilderment. All, that is, except the sheriff. Ortega had been both stung and humiliated by the bimbo remark. Being sheriff, procurement was clearly his responsibility and them not showing up by now, almost 4:30, infuriated him.\\n\\n But the telephone - that really enraged him. He\u0027d been trying to call for two hours to see what the hold-up was but for the life of him he couldn\u0027t get the sonuvabitch to work. He couldn\u0027t even get a goddamned dial tone.\\n\\n This in turn made David Deyo awfully guilty. Deyo, a member of the pike crew, had been responsible for tearing the phone out of the wall the first time hours earlier. A veteran of three years\u0027 duty on the destroyer Hepburn, and therefore a man of breeding and culture, he had spent hours reconnecting the wires using his very best navy knot. But for some reason the phone still wouldn\u0027t work.\\n\\n A half-dozen of them got down on all fours to examine the situation. All agreed the knot was a thing of beauty and that the phone should by God phone. The real problem, of course, was that each of them had drunk enough to kill a steer. But this did not occur to anyone. Except maybe Cat, whose suddenly renewed cackling was a continuing mystery.\\n\\n Somebody suggested using the phone in the next room. This was Cat\u0027s turn to be helpful. \"I\u0027ll get it,\" he screeched. He rose, reeling with laughter, and ricocheted into the adjoining bedroom, ripped out that phone and brought it in to be retied.\\n\\n This one didn\u0027t work either.\\n\\n It was the phone company, everybody agreed. The phone company was fucked. And everybody had a drink to that.\\n\\n It was starting to get really late. Only the hard core remained. Team Crow, three cops, including the sheriff, Father Hernandez, and Bambi. Somebody suggested going and getting the women, a Quest. That was cheered until somebody else pointed out that they were almost out of liquor.\\n\\n One of the deputies reminded everybody of the time. The liquor store owner had long since locked up and gone home to bed. Then Ortega, desperate for redemption, allowed as how they had already robbed a bank, more or less, so knocking over a liquor store was no big deal.\\n\\n \"Whores first!\" piped Bambi.\\n\\n \"I\u0027m too drunk to fuck,\" snarled Anthony, spilling Bambi onto his head and standing up.\\n\\n Ortega stared at Anthony. \"You\u0027re kidding.\"\\n\\n \"No kidding,\" Anthony assured him. \"I\u0027m too drunk to do anything but drink.\" He held up his index finger like a lecturer\u0027s pointer. \"And I gotta get sick first to do that. \u0027Scuse me.\"\\n\\n The spirit of comradeship rapidly degenerated into a squabble that sounded like two competing college cheering sections.\\n\\n \"Booze first!\"\\n\\n \"No! Sex first!\"\\n\\n \"Booze!\"\\n\\n \"Sex!\"\\n\\n \"Booze!\"\\n\\n \"Sex!\"\\n\\n \"Booze!\"\\n\\n Somebody yelled, \"Less filling!\" and got slapped around a great deal.\\n\\n Then Bambi rose to the occasion. \"I\u0027ve got a van outside,\" he piped gleefully. \"We can go fill it full of both!\"\\n\\n \"Yea!\" shouted the crowd as Bambi took his bow, high-stepped carefully over to the door, opened it, and - And the vampire was on him and ripping his claws deep into his ribs and spreading them and then... it... pulled... his... chest... apart. Bambi died, screeching horror and spraying organs and blood and then clumped to the floor in a little pile and the vampire was on them, on the rest of them, coming at them too fast, too damn fast, too on fast to be believed, and the first guy, some member of the pike team, just had enough time to raise his forearm in front of his face before the fiend snapped it through and ripped him open from throat to shoulder and he screamed - Jesus God, how he screamed!\\n\\n The bolts! Where\u0027s the fucking crossbow? was all Crow could think and he spun around looking for it, taking his eyes off the fiend for a second because this was a vampire and that was the only way to stop it, the only way in the world and this was night! Nighttime and maybe that wouldn\u0027t do it either but there it was, propped up against the end table under the lamp and Crow dove for it across the sofa full of horrified mortals, some of them just now rising to their feet because this was all so fast for them, this was just too... this couldn\u0027t be happening, could it? I mean, we were just having a party and everything was just -\\n\\n Crow crashed across the back of the sofa over the tops of somebody\u0027s rising head and they flipped him sideways in the air in mid-dive and he came down right shoulder first onto the point of the bolt.\\n\\n \"God!\" he gasped, as it sank into his tissue. He twisted to the side off of it and it tore loose raggedly from his skin and shirt. \"God, God, God!\" He was bleeding like crazy, agonizing pain, and the lamp teetered and fell to the carpet right beside his bead and started shorting out and then Crow rose to his knees blank-faced and beaten to watch the rest of the strobe-lit nightmare continue.\\n\\n Darkness...\\n\\n Light: David Deyo in mid-black-belt leap driving the side of his right foot picture-perfectly up under the vampire\u0027s chin where the throat was soft and making the sound that would have popped the skull off any normal man -\\n\\n Darkness...\\n\\n Light: The fiend using David\u0027s... oh, God! using his spine like a handle as he slammed him back and forth from the floor to the ceiling. David long dead already, all his bones crushed, flopping gruesomely and Anthony! Sweet Anthony with his huge shoulders slamming forward into the fiend, tackling him for chrissake like this was Astroturf and -\\n\\n Darkness... And then crash in the blackness just a couple of feet away.\\n\\n Light: Anthony\u0027s body hanging on the sill of the shattered picture window and then sliding horribly, slowly, on through, his legs dragging the curtains pop-pop-pop - off the curtain rod to billow gently to the ground covering him and - Cat beside him, lifting him up, hissing, \"Yes! Yes! Yes! The window!\" as if that had been Anthony\u0027s plan for escape all along.\\n\\n \"What...\" stuttered Crow but he knew what Cat meant. They had to run. The fiend roared and slaughtered invincible in the night air. There was no chance, and he stumbled toward the window, Cat shoving him, grabbing him by the shoulder that already bled, and \"Ohh!\" spouted forth from Crow\u0027s mouth with the pain and Cat said \"Jack, you\u0027re hurt!\" in surprise and Crow mumbled back, \"We\u0027re all dead!\"\\n\\n And then more darkness and he was tumbling forward through the last of the glass and landing on something soft and dead like an old and trusted friend but not to think about it. He rose to his feet and turned for Cat, Cherry Cat, without whom there was no point anyway and - And it was light again for the last time and Cat was out and beside him and lifting him up and there - back there through the window was the priest, Father Hernandez, not nutless at all, stabbing the edge of his huge silver cross right into the fiend\u0027s forehead before dying, decapitated, from a backhanded, almost casual, blow..\\n\\n All blood and horror everywhere back there, on the walls and the ceiling and - And the sheriff, stunned into immobility, stood like a lump in the middle of the parking lot staring at the old battered Cadillac convertible alongside his patrol car pickup.\\n\\n \"Jack, please!\" Cat moaned, shoving him along and Crow looked down at him and saw the tears in his eyes and realized that it was fear for his own safety that so terrified his friend.\\n\\n So he hurried, because he couldn\u0027t stand to see Cherry Cat crying.\\n\\n Crow opened the side door to the pickup Cat shoved him at and climbed in beside the sheriff that somehow Cat had collected from the driver\u0027s side. And then Cat was inside too behind the wheel and Omigod! The keys! Where are the... but they were there, the sheriff had just left \u0027em there in the ignition, why not? Who would steal it?\\n\\n And Crow found himself laughing at this as they screeched out of the parking lot onto the highway. Because it was better, it was fun, to have something to laugh at besides crying at the continuing thumps of horror from inside the motel or allow himself to actually focus on the slaughtered occupants of the convertible, the whores who had been too late, but not late enough and - \"CROWWW!\" sounded out in the darkness, piercing through the roar of the engine and the distance and twisting each man in the cab of the truck into a little ball. \"CROWWW!\" shouted the vampire, as Cat gunned the engine even harder and the truck vaulted forward to sixty, seventy, eighty miles an hour down the two-lane state highway.\\n\\n \"CROWWW!\" blasted them as the vampire caught them and leapt onto the back of the truck bed and slammed his hands through the rear window and Crow found that he had the sheriff\u0027s huge cannon pistol in his hand and he jabbed it in the monster\u0027s face and - why not? - pulled the trigger.\\n\\n The fiend, all shiny blood-red teeth of his ghastly smile and soul-ripping gleam of intelligence, disappeared backward rolling from the concussion of the cannon-pistol, cracking through the tailgate and slamming it open like it wasn\u0027t there and then skidding all asprawl on the sandpaper asphalt.\\n\\n \"Oh! Yes, yes! Ha! Hey!\" the sheriff whined delightedly at the sight, the thought that the monster could be killed. But even knowing better, the other two in the cab still crumpled a little more as the sheriff\u0027s cry of gasping pleasure changed to a shrill baby-boy whimper at the sight of the monster back on his feet almost immediately, almost before he had stopped kicking, and coming back at them again.\\n\\n It got close enough for them to see the hole from the cannon pistol already closing up, trapping the trickling black blood left from the priest\u0027s stabbing cross and - \"Jesus Christ!\" screamed Crow as they topped over a hill at over a hundred miles an hour up behind a farm truck doing maybe twenty in the center of the highway.\\n\\n Cat wrenched the truck to the left and missed the farmer but got onto the shoulder and got sideways and careened back across the center line starting to spin around and around and topping up over another hill so they could see the city square in the distance and Crow thought, Well, at least we almost made it into town. And he mourned the unattainable sight of redemption of that little town square with the morning sun just starting to peek out over...\\n\\n The sun! The fucking sun! was his last thought before the truck began to tumble, rolling over and over on its sides and then end over end and then sliding forever and ever down the main Street of the little Indiana town.\\n\\n He awoke first and got himself up. And then he got the other two up. And then he got the three of them through the gathering crowd down the three blocks toward the hospital before the ambulance met them halfway. He got them inside and got their blood types, and when they were all set and going to make it, he lay down and collapsed, his last thought:\\n\\n I thought sure it was the leader.\\n\\n First Interlude\\n\\n The Man sat calmly, in regal white, waiting for his aide to compose himself. When at last he seemed in control, the Man smiled and nodded.\\n\\n \"Holiness,\" began the aide, his voice rich with frustration and almost childlike pique, \"this man Crow is a catastrophe.\"\\n\\n \"Tell us,\" said the Man.\\n\\n \"Holiness, the man arrived drunk. He was loud. He was obnoxious and profane. He insulted everyone in sight. He referred to the priests as eunuchs. He called the sisters penguins. He attempted to engage one of the guards in a fistfight on the steps outside the private entrance.\"\\n\\n \"Was there a fight?\"\\n\\n \"No, Holiness. I intervened.\" The aide sighed. \"Forgive me, Holiness, but I almost wish I had not. It would have done that buffoon good to have been thrashed by the Swiss...\"\\n\\n \"Our orders were very clear, we hope?\"\\n\\n \"Yes, Holiness. And it was for this reason that I intervened. I received scant appreciation for my concern. Mr. Crow called me... me...\"\\n\\n \"Called you what?\"\\n\\n \"Nutless.\"\\n\\n The Man sighed. \"It is very difficult for you, my old friend. We are sorry.\"\\n\\n \"Oh, please, Holiness. I am not complaining. I only...\" The aide stopped and smiled with some embarrassment. \"I suppose I am complaining at that. Forgive me, Holiness.\"\\n\\n \"There is nothing to forgive.\"\\n\\n \"Thank you, Holiness.\"\\n\\n \"We hear the man is injured.\"\\n\\n \"Yes, Holiness. His entire right shoulder is wrapped in bandages. But he will not let any of our doctors examine him.\" The aide paused, looked at the window at the far end of the ancient room. \"He claims he is fine, Holiness. But he lies. I believe him to be in great pain when he moves.\"\\n\\n \"He is indeed, my friend,\" said the Man softly. \"Even when he does not.\" The Man smiled sadly. \"Great pain.\"\\n\\n The aide was silent for several moments. Then: \"Holiness, I know this Mr. Crow is of great importance to... But it would help greatly if - Holiness, can we not know who he is?\"\\n\\n \"You cannot.\"\\n\\n \"But Holiness, if we could just...\"\\n\\n \"You cannot.\"\\n\\n The aide sighed once more. \"Yes, Holiness.\" He took a slow deep breath, seemed to rid himself of the concern, said, \"All is in readiness. The dining room is prepared. American food, as your Holiness ordered, will be served.\"\\n\\n \"Thank you. You have been very thorough.\"\\n\\n \"Thank you, Holiness. The man Crow is already in the dining room, has been for\" - he checked his watch - \"almost fifteen minutes. He is already intoxicated, Holiness. Perhaps there would be a better time.\"\\n\\n \"There will be no better time,\" replied the Man in a voice of such infinite sadness and despair that the aide found he could not speak for a bit.\\n\\n He made ready to go, kissing the ring. But at the door the aide paused. The Man could see how clearly the other felt driven to utter this last.\\n\\n \"Holiness, be very careful with Mr. Crow. He has much anger in his soul. And... I believe he hates you.\"\\n\\n The Man waited until he was alone before rising. Then he padded softly across the room to the side entrance. He paused before opening the door to his private dining room.\\n\\n \"So he does,\" the Man muttered softly to himself. \"And why should he not?\"\\n\\n Then he opened the door and went in.\\n\\n Tapestries. A broad arched ceiling. A carpet over three hundred years old. A long, thin table with a single heavy wooden chair at each end. In the far one sat Jack Crow, one leg over an arm, a glass of wine in one hand and a cigarette in the other.\\n\\n The Man nodded to the bows of the four servants - two on each wall and recessed like the paneling - and stepped easily to the center of the room. He waited.\\n\\n \"Well, there he is at last,\" barked Crow. He stood ponderously, still carrying his glass and cigarette, and walked over.\\n\\n The Man waited until the other had come within a few feet. \"It is good to see you again, Jack,\" he said easily. Then he offered his ring.\\n\\n Crow stared at the ring with apparent bewilderment. Then he smiled. He put his cigarette in his mouth, transferred the wineglass from his right hand to his left, shook the hand holding the ring, and said, through cigarette smoke, \"How the heck are you?\"\\n\\n Despite repeated and insistent orders, it was all the servants could do to restrain themselves.\\n\\n The Man did not stir. He met Crow\u0027s piercing gaze without rancor. He smiled. \"We are quite well, Jack. But I see you are injured.\" He indicated the bulky bandaging underneath Crow\u0027s corduroy jacket.\\n\\n Crow felt his arm absently. \"Oh, it ain\u0027t much, priest, considering. Everybody else is dead. Except for Cat and me. Everybody else, though. The Team is dead. All of \u0027em.\"\\n\\n \"Yes, Jack. We know.\"\\n\\n The two locked eyes for several seconds. Then Crow turned abruptly away, flicking an ash onto the carpet and reaching for the decanter of wine. \"All dead. Everyone of \u0027em slaughtered.\" He poured some more wine into his glass. Then he plopped back down into his chair and spoke with a voice blood-rich with bitterness. \"So, tell me about your week.\"\\n\\n Crow became increasingly more profane, more insulting. He referred to the man as \"Your Assholiness.\" He put his cigarettes out on whatever was nearby, the plate, the glass, the tabletop. He was loud. He was vicious. He was disgusting.\\n\\n The Man said little, his mournful sadness filling his end of the small chamber. He was becoming more and more concerned about the servants, who seemed frozen into a comalike state certain to erupt in violence.\\n\\n \"All of you,\" whispered the Man, his gaze taking in the four servants on both sides of the room. \"Leave us now.\"\\n\\n It took them several moments to react. But they did, moving stone-faced and dry-hinged to the exits. Luigi stopped briefly before the door and looked back.\\n\\n The Man smiled reassuringly. \"We will call you if we need you.\"\\n\\n Luigi still stared.\\n\\n \"It will be all right, my friend,\" added the Man gently.\\n\\n And then they were alone.\\n\\n \"Now that\u0027s more like it,\" cackled Crow. \"Now we can get down to the serious drinkin\u0027.\"\\n\\n He reached over to grab a chair from the wall and slide it over next to the Man. But he had trouble, first with his balance, then with the weight of the massive chair on his right arm. It seemed to bring out something even darker than the bitterness and fury. Something deeper. Something worse.\\n\\n He finally got the chair alongside the Man and banged down into it. Then he realized he was almost out of wine. He stared forlornly into the near-empty decanter in his lap.\\n\\n The Man, still calm, still cool, said, \"We have some, Jack,\" and reached for the carafe by his plate.\\n\\n \"Fuck, no!\" roared Crow suddenly, inexplicably. He half-rose to his feet. He shot out one hand to intercept the wine and with the other, his right one, his injured one, slammed the pontiff back into his chair.\\n\\n Dead silence. Each man stared, wide-eyed in shock at what had just happened. Crow dropped the decanter onto the table. It shattered. Red wine began to flow around the plate and toward the edge of the table.\\n\\n Crow tried. He really tried. He lurched crazily forward to stem the flow. He cracked his forearm down on the edge to dam it up. But nothing could stop the scarlet stream from spattering across the Man\u0027s milk-white, snow-pure robes.\\n\\n And for a moment each simply stared, not at each other but at this.\\n\\n And then Crow exploded. He leapt to his feet and roared and screeched, splashing the wine from the table onto the robes over and over again, roaring and roaring louder and louder as he sprayed it, yelling at the top of his lungs: \"Take it, goddammit! Take it, you papist motherfucker! It\u0027s about time you got some of the goddamned blood!\" and the Man just sat there, frozen in his chair, his eyes closed to the spattering drops covering his robes, his head, his face, and above him Crow still raged and roared and then.\\n\\n Then was utterly silent.\\n\\n The Man opened his eyes to the vision of the giant trembling above him, his hands and face and clothes covered with wine and fury and...\\n\\n And agony.\\n\\n \"My son,\" be whispered and his compassion was a thing alive. \"Oh, my son.\"\\n\\n Jack Crow\u0027s face, rock-taut with ferocity, cracked in two. Then it began to melt. Tears welled up in his eyes and began to rush down his cheeks. His cry of pain was irretrievable and lost.\\n\\n Then he was falling to his knees and sobbing, his massive arms snaking out to wrap around the other man\u0027s waist as a child\u0027s for safety and comfort and the old man held him and rocked him as the great shoulders shook with the great sobs that simply would not stop but went on and on and on.\\n\\n \"Oh, Father! It was so horrible!\" whimpered the giant \"I\u0027m sorry! I\u0027m so sorry!\" he cried later and both men knew it was for nothing that had happened there this night. And later, when the giant was almost asleep and his voice was a dry cracking hiss pleading, \"God, forgive me, forgive me, forgive me...\" over and over the old man forgave him again and again and again.\\n\\n And later, hours later, when they could not get their master to rise rather than disturb the sleeping giant curled into his lap, they thought it was his infinite compassion, his infinite love that kept him praying all this night for the soul of this great weeping beast.\\n\\n But it was fear.\\n\\n For the Man was certain that Jack Crow would be forgiven for his sins.\\n\\n But who would forgive him for sending this poor soul out still again to face the monsters once more? \\n\\n","sourceLink":"https://allnovel.net/vampire/page-3.html","bookId":2118,"book":{"id":2118,"title":"Vampire$","description":"Storyline: Vampire$ is about a tightly knit group of professional vampire killers. They may say they\u0027re in it for the money, but their death-defying bravado and warm male friendships are as intense as those in any soldier-hero epic. The irrepressible, foul-mouthed, hard-drinkin\u0027 Jack Crow--decked out in high-tech chain mail and wielding a fearsome crossbow--is the leader of the bunch. He\u0027s the sort of man who screams obscenities at the pope, and then weeps in the pontiff\u0027s lap over the horrors he\u0027s witnessed. Vampire$ is one gaudy, action-packed novel. The men are men, the women are vulnerable, and the vampires are mean, ugly monsters. Unless you don\u0027t like that sort of thing, you\u0027ll love it. --This text refers to an out of print or unavailable edition of this title.\\n","cover":"https://allnovel.net/images/vampire.jpg","author":"John Steakley","type":"Horror","source":"allnovel","link":"https://allnovel.net/vampire.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:58:17 PM"}}
