{"id":65968,"no":17,"title":"Page 17","content":"The maid, Maella, had a stricken look on her face, and Widow Maggie was pressing a steaming draught upon her lady. “Shall I call for Lady Maris to attend our guests?” asked Maella. “Nay. Nay,” Allegra forced herself to sound calm, forced the spots that danced before her eyes to disappear. She could not bring Maris into this mess until she thought how to handle it. “Maris is in the Village,” she explained, “And the ache in my head has gone.” She made a smile of her lips, and bravely turned to look at Michael. Oh, God, it’s Michael. After so many years, how have You delivered him to me? “May I offer my lord to bathe?” she said, trying not to sound too eager. “You are likely weary from your long journey.” “Aye, a bath would be more than I could hope for!” Allegra remembered their other guest and turned to the younger man. “I cannot attend thee myself, Sir Victor, but a bath will be prepared for you as well.” “’Twould be most welcome. Mayhaps Lady Maris could attend me,” Victor suggested. Merle spoke. “Maris is in the village, tending to the sick. I’ve sent a man at arms to fetch her, but likely she will not return until the evening meal.” “Very well,” Victor replied, his disappointment obvious. But Allegra gave little care to young man’s discomfort. One of the maids could see to him; there were plenty who would do. She had only one thought in her mind, and that was of Michael. Here. Now. Praying that her face didn’t show the high color that heated it, and that her husband had noticed nothing untoward, she led their guest out of the great hall to one of the large guest chambers. Moments later, they were alone except for the serfs, bringing buckets upon buckets of steaming water for his bath. Allegra could not stop her fingers from shaking as she unlaced Michael’s cross garters. She had to force her attention to the task, else her fingers would travel up the curve of his calves to relearn their strength. To touch him. How can this be? How can this be? Her mind chanted the phrase, echoing the incredulity that swept through her each time she looked at the man she had pined for, fantasized about, and begged God for since marrying Lord Merle more than seventeen years ago. How could he come here, be here…and plan to marry his son to his own daughter? Allegra tamped back the panic and instead centered her thoughts on the fact that he had finally come to her. That he was here. For of course. Michael did not know that Maris was his daughter. She’d tell him and then all would be well. And then, mayhap she could find some way to suggest Bon as a husband…. Nay. That she could not do. There would be another solution. Michael would see to it. A maidservant bustled about the small chamber, laying out a tunic and hose from Merle’s trunks to clothe Michael after his bath. Boys from the kitchen came and went with buckets of steaming water. Maella sprinkled dried lavender over the filling tub. The room was busy and crowded, so much so that it played upon Allegra’s nerves and it was all she could do to keep from screaming at them all to leave…to leave her alone with Michael. “Maella, go you to see that Verna has found the other tub and is serving Sir Victor,” she said at last, uncaring of the shrewd look her maidservant flashed at her. “Aye, my lady.” Maella reluctantly turned to leave, glancing at the two other maidservants who still assisted her mistress. No sooner had Maella brushed out the doorway than Allegra found other contrived excuses to send the remaining servants away…and at last she found herself alone with Michael. He rested comfortably in the tub that had been fashioned to hold a body as large as Merle’s, eyes closed restfully. A wad of soft linen propped his neck up from the rough wooden edge of the oval tub. Allegra knelt, folding his tunic, and watched as steam rose from the water. His fine blond hair was plastered to his neck, and the fine features she’d never forgotten were flushed with the heat. He breathed easily, and she allowed herself the luxury of remembering the warmth of his smooth, muscular chest. As she watched, one ice blue eye slowly opened and his gaze rested knowingly upon her. “At last,” he murmured as a smile quirked his generous mouth. “I’d given up hope that we should be alone.” “Aye,” Allegra breathed, clasping her hands in her lap to keep from stroking a thick lock of hair from his forehead. His eyes, both fully opened now, greedily looked over his former lover. She knew she was still a very beautiful woman, and when he shifted in the tub, turning slightly to the side she was gratified that his response to her was as obvious and immediate as it had been eighteen years ago. “You’ve not changed much at all, Allegra,” he said quietly. “Nor have thee.” Her chest swelled with love and affection, making it quite difficult to breathe. “Come, soap my back,” he invited, and sat fully upright. Allegra’s hands trembled as she drew a fine linen cloth from the water and over the large expanse of his back. There were more scars that marred its golden surface, and the ridges of muscle that she remembered were not as pronounced. But it was Michael. The strong lye soap that was usually used for bathing had been replaced by one of Maris’s specialties: a rosemary basil scented soap. Its minty smell pervaded the air, accented by the steam rising from the scented bathwater. Michael eased back into the tub so that Allegra could massage his hair with the same soap. And when he closed his eyes, she wanted nothing more than to lean over and press a kiss to his lips. She didn’t speak to him until she was nearly done scrubbing his body. Relearning every area, finding every new scar and marking. At last she broke the silence. “Michael, did you—did you not know that Merle is my husband? Did you not know whence you came that I would be here?” He stood at that moment, water cascading down the length of his slim, wiry body. Allegra’s breath caught in her throat, and she turned quickly to retrieve a cloth that had been warming by the fire. As he stepped onto a thick wool rug in front of the fireplace, he spoke, “Aye, my love, I’d hoped to see you again.” Her hands, wrapped in the towel, smoothed over his legs and upward to his buttocks. She could not think, could not make sense of what he was doing here…. When she reached his chest, she caressed his shoulders with the towel. “Allegra,” he said softly. She tilted her head up and his arms suddenly wrapped around her waist, pulling her up against his body as he lowered his mouth to hers. With a moan of relief, she dropped the towel and found herself in his embrace. His damp body pressed into her bliaut and left marks at her breasts and thighs, and his arms slid into a taut band around her waist. She’d felt nothing like this in her years of marriage to Merle. Aye, he’d been patient and slow when he thought she was a virgin, and, aye, he’d been tender with her and passionate during the nights they coupled…but he’d not been able to spark her insides as Michael had ever done. His hands were on her breasts now, and his mouth left a moist trail on her neck. She felt his need pulsing against her thigh, and her hand slipped to touch him. Suddenly, they were on the floor in front of the fireplace, and she felt his hands moving up her legs. Michael’s weight pressed her head back onto the floor as he kissed her thoroughly. She was raising her hips to him even as he pushed her bliaut up to take two handfuls of bare breast and bring a nipple to his mouth. Allegra nearly screamed at the pleasure of it, her breath coming in small little pants. At last. At last. At the urging of his wicked fingers, she spread her legs and suddenly he filled her as he’d done eighteen years earlier. He breathed her name as his fingers threaded through the mass of curls that was her hair. Allegra raked her fingers down the length of his back, gouging his skin when she felt him climax, shuddering against her. Tears shimmered in her eyes when they opened as he pulled away to sit up moments later. “Michael…I have missed thee so,” she told him. He didn’t have a chance to answer, for at that moment Maella burst into the room, stopping short at the sight that greeted her. Allegra had rolled to her knees as Michael left her body, but her hair and clothing were disheveled and there were wet marks on her bliaut. “Aye, Maella?” Allegra asked sharply to hide her guilt. She hadn’t thought to bolt the door, it had all happened so quickly. Her lips tight, she struggled to her feet. Knowing that her maidservant was loyal to her above all gave her the courage to act as if nothing had happened. “My lord Merle wishes to see you in the hall,” her servant told her pointedly. “He bade me finish bathing Lord d’Arcy and send you to speak with him.” “My lord Michael’s tunic and hose rest by the fire,” Allegra said with as much grace as she could muster as she fled the room. Maella, in turn, gave Michael a hard look as she proceeded to clothe him in silence. CHAPTER EIGHT That evening, Maris returned from the village in just enough time to change from an herb stained over tunic to a well laced bliaut of cinnamon colored wool with gold embroidery. Her day had been a fine one for the sun had shone gloriously, melting the snow into wet, sticky masses. She’d spent the morning in the herbary, preparing tonics and poultices for her first trip into the Village since her near drowning. Then, her leather bag filled with dried herbs and small bottles of medicines and tonics, she slipped out of the dark keep into the sharp, clean air. Drawing a deep breath, Maris started across the bailey with brisk steps. The morning sun in her eyes, she nevertheless noticed her father’s men gathered to practice their art of warfare. She would have passed them by with naught but a bare glance except that her gaze was drawn to one mock battle. Maris stopped, curious, and recognized Dirick matched against Raymond of Vermille. Dirick had tossed his dark tunic aside and wore only a sleeveless linen pelisson and close fitting woolen chausses. The swords flashed, catching the rays of the sun with each twist and thrust, arms and legs moving in perfect accord.","sourceLink":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3/page-17.html","bookId":2669,"book":{"id":2669,"title":"A Whisper Of Rosemary (Medieval Herb Garden #3)","description":"Storyline: A Whisper of Rosemary (Medieval Herb Garden #3) Knights in shining armor...damsels in distress...adventure, romance and intrigue.... Dirick of Derkland, man of the king, sets off on a mission of revenge after his father’s brutal murder. His mind is bent solely on vengeance until he meets the beautiful Maris of Langumont…. Maris of Langumont has vowed never to wed…but her father must do his duty to protect her, and he promises her to Victor D’Arcy—a man who makes her blood run cold. Bon de Savrille rests his eyes upon Maris only once, and decides she must be his. He whisks her away just before her betrothal ceremony, determined to force her into marriage. When Dirick appears at the castle where Maris is held captive, she believes he is part of the plot…and ’tis nearly his death she causes during her chance to escape.","cover":"https://allnovel.net/images/a-whisper-of-rosemary-medieval-herb-garden-3.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:58:57 AM"}}
