{"id":65970,"no":19,"title":"Page 19","content":"\n He drew in a deep breath that was so cold it hurt the deepest part of his lungs, then exhaled strongly. Somewhere, out in that darkness, was the great channel he’d crossed once to France. If he listened closely, he’d hear the crashing waves upon the cliffs. He stopped breathing, just to hear the sound.\n A movement from the corner of his eye drew Merle’s attention. Turning, he found that Sir Dirick had come pell mell around the corner, then came to a stop when he caught sight of his host.\n “My lord,” Dirick said, clearly uncomfortable.\n “Nay, Dirick, you do not disturb me. Come.” Merle smiled at a sudden thought. “Unless ’tis you who does not wish to be disturbed.”\n “Nay, my lord. ’Tis just that I did not expect to come upon you. I…wished…thought to be alone. I am glad for your company.”\n Merle beckoned him closer, gesturing out into the darkness. “See you here, Dirick…. See you all of the blessings that have been bestowed upon me.”\n Dirick looked out into the dark, though Merle knew he was unable to see far in the dim, starry night. “You’re worthy of them, my lord,” he said quietly.\n “Listen and you can hear the sea…it has been the cause of the wealth that has come to me. My father’s grandfather was a Saxon thegn, betrothed to the daughter of a Norman lord in great favor with The Conqueror. My great grandfather’s land, here near the sea, was a most important fief. Since the day my great grandfather wed with Lord Humphrey’s daughter, Margaret, this keep and this fief have served the King of England with no regret, and no hesitation—even when Stephen of Blois ruled, and ruined, this land.”\n Merle was silent for a moment, aware that he’d thrust his pensive mood and meandering thoughts upon his companion. Then he gave a short, bitter laugh. “Forgive me, Dirick, but my solemnity comes from the knowledge that my beloved Maris will soon belong to another man….and these lands will someday be ruled by another.” He took a deep breath, shaking himself from his melancholy. His decision was good. It was the best he could wish for Maris.\n Yet, of the man whom he’d come to know and respect, and one who was clearly a confidant of the king, Merle nevertheless felt compelled to ask, “What think you of my guests?”\n “They seem pleasant dinner companions…full of much news…confident and brave.” In the faulty light, Merle saw his companion’s hands close over the roughness of the stone half wall.\n “Yet you do not sound convinced,” he pressed. Then gave a wry chuckle. “Has my daughter complained to you?”\n “My lady does not seem overfond of the idea of marriage,” Dirick admitted in dry tones.\n “And you, ever the chivalrous knight, do not wish to see a damsel in distress.” Merle grinned, then sobered. He was full aware of the way Dirick’s eyes often settled on his daughter, and the way she tended to avoid looking at him…unless the man was turned in the other direction. “Aye, Maris has a way of manipulating even her father with her sad stories. ’Tis the best for her, I believe, Dirick. The world can be an unfriendly place, and I’ll not have her alone and vulnerable should aught happen to me.” His voice softened at the last.\n “She may not understand my decision,” Merle continued, “but ’twill stand. I owe a great debt to Michael d’Arcy…for ’twas because of him that I was able to return to my own once again. I was grievously wounded and Michael saved my life. For that blessing, I will bestow upon his son the greatest gift I have to give.”\n Dirick nodded in acknowledgment, but remained silent.\n Thus the men stood in the dark for a time, not speaking. A cold, brisk breeze ruffled their hair and the cloaks that huddled about their shoulders, yet each was lost in thought and ’twas as if the other were not present.\n The world was quiet but for the breeze, and when he heard the sound of voices below, Dirick looked down into the courtyard. He stood near the edge of the crenellation and peered over the waist high stone.\n Voices drifted up to him, and he watched as two figures trod through the snow to the stables. Even in the low light, Dirick recognized the brilliant blue cloak. ’Twas Maris, and with her, the silvery-blond Sir Victor, his hair gleaming like a beacon in the moonlight. The two disappeared into the stables and Dirick turned abruptly from the view to find Merle watching him closely.\n “My lord, I feel my pallet beckoning to me,” Dirick said. He bowed slightly—not one to forget his courtly manners even when there were other things that preyed on his mind. “I beg leave of you, now, Lord Merle, and for the morrow. I’ll leave early in the morn for Breakston. I thank you for your great hospitality now, and for all of the assistance you’ve given me in my quest for the murderer of my father. But I’ve dallied too long here, enjoying your hospitality and your pallet.”\n “’Tis sorry I am to see you go,” Lord Merle said slowly.\n “I must be on my way,” Dirick said, as if to reaffirm for himself the need to leave. He’d delayed his duty to move on to find Bon de Savrille long enough, merely to stay in the presence of the beautiful Lady Maris…and, in sooth, to be near a man who reminded him of his own father.\n Grief swept over him, pushing away the resentment he felt toward Sir Victor, and mayhap a bit of self pity. Dirick couldn’t covet a woman such as Maris, and he had known that since he’d been old enough to know what a woman was. ’Twas a hard truth, but one he had lived with forever. Naught had happened to change that but for his heart softening toward what he could not have. Yet, soon as she was out of his sight, she would be out of his mind as well.\n Thus, he must return to his duty, and redirect his energies from a woman who was beyond him to finding the man who’d taken his father from him. How foolish he’d been to waste a se’ennight here when he could have been following the trail of the creature who’d wrought such horror.\n Dirick’s fingers closed around the broken dagger deep in the pouch attached to his tunic. He squeezed its handle, allowing the rage at his father’s murderer to resurface…to replace his self pity and grief.\n “You do not wish to bid my lady Allegra…or Maris farewell?” Merle asked.\n “Nay. I’ve enjoyed the ladies’ company, yet I wish for an early start on the morrow.” It would be best if he were to leave without seeing her again.\n “Then fare thee well, my son,” Merle said. He clapped a hand upon the younger man’s shoulder. For just a moment, it was as if some unusual connection flowed between them. “I bid you well wishes in your quest, and if I can be of further assistance, please let me know. If I can think of aught else to help you, know that I will send for you.”\n “Aye. Thank you.” Dirick felt unaccountably sad leaving Lord Merle.\n It was a mere shadow of the grief he’d felt at losing his father…yet it was sorrow all over again.\n The sky hadn’t the merest tint of light to it when Dirick rolled up his pallet. He stood, waiting for his eyes to adjust to the dark, then walked over the other prone bodies in the chamber housing other itinerant men at arms.\n The few belongings he’d brought with him—including the broken dagger—were wrapped and stuffed in a leather satchel. He shifted the weight of this baggage and pulled his fur lined cloak about his shoulders. The edges of the cloak rustled against the sweet herbs and rushes that covered the floor of the great hall, stirring them among his booted feet. All was silent—even the boy who tended the fire overnight dozed nearby. Only an orange tomcat prowled among the other snoring bodies, doubtless hoping to catch an unwary mouse among the rushes.\n Dirick felt an odd sense of sadness as he stepped from the hall for the last time, and found himself under the dark blue, starred sky. He had enjoyed his stay here at Langumont, and the unhappiness he felt at leaving pushed into him like an annoying toothache. Mayhaps, he thought as he trudged through the powdery snow to the stables, ’twas because Lord Merle seemed to be the closest link he had to his father and his father’s murderer.\n The whuffling of the horses greeted him as he pressed the door into the stables. Nick was near the front, and he nickered as he sensed his master’s scent. “Aye, boy, ’tis nigh time we were away from here,” he said, leading the destrier from his stall. Nick pranced spiritedly within the small enclosure, obviously eager to get on his way, and Dirick patted his nose to calm him. “’Tis happy I’ll be to see this place behind,” he said aloud.\n He heard the noise behind him and whirled, hand clapping to his sword, just as her words reached his ears. “Then ’tis happy we shall be to see you go.” Maris stood there, holding a tallow candle, looking ethereal in the glow of the shining beacon.\n The annoyance in her eyes did not, however, bespeak of celestial bearing. Her head had been covered with a wrap, but as the woolen veil slipped, her rich hair showed and gleamed in the candlelight. Her little chin was pointed in annoyance and her full lips were firmed into a thin line. The blue cloak trailed in the rushes on the stable floor, effectively covering her from shoulder to toe.\n Dirick recovered from his surprise and dropped his hand from the sword upon which it rested. “Maris—my lady,” he amended quickly, “what do you here?”\n Her frown did not dissipate. “Papa told me that you planned to leave early this morrow, and I did not—I thought you must not go without something for your journey. But I see that my consideration is unwanted.” He noticed now that she held a packet under the opening of her cloak. “So happy are you to see Langumont behind you that surely you wouldn’t wish to take any remembrance of this place.”\n She turned to go, her back straight as a sword and her shoulders thrown back.\n “Nay, my lady.” Dirick, annoyed at having been caught speaking such nonsense to his horse, spurred to action and reached for her arm. “Nay, ’tis not that I wish to leave Langumont…believe you me.”\n At his tug, she pivoted back, her eyes a hard, flat brown in the flickering light. “I am not hard of hearing, Sir Dirick.” \n","sourceLink":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3/page-19.html","bookId":2669,"book":{"id":2669,"title":"A Whisper Of Rosemary (Medieval Herb Garden #3)","description":"Storyline: \n A Whisper of Rosemary (Medieval Herb Garden #3) \n Knights in shining armor...damsels in distress...adventure, romance and intrigue.... \n Dirick of Derkland, man of the king, sets off on a mission of revenge after his father’s brutal murder. His mind is bent solely on vengeance until he meets the beautiful Maris of Langumont…. \n Maris of Langumont has vowed never to wed…but her father must do his duty to protect her, and he promises her to Victor D’Arcy—a man who makes her blood run cold. \n Bon de Savrille rests his eyes upon Maris only once, and decides she must be his. He whisks her away just before her betrothal ceremony, determined to force her into marriage. \n When Dirick appears at the castle where Maris is held captive, she believes he is part of the plot…and ’tis nearly his death she causes during her chance to escape.\n \n","cover":"https://allnovel.net/images/a-whisper-of-rosemary-medieval-herb-garden-3.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:58:57 AM"}}
