{"id":66001,"no":50,"title":"Page 50","content":"The urgency came to him again…then it was gone. Firm hands pulled and pushed at him, and he wanted to slip into that blackness and sleep…but the urgency kept kneading at him…kneading…like the hands that interrupted his comfort. Maris. The name struck his consciousness like a lightening bolt and he jerked awake. Something about Maris…. His eyes were open, blearily focusing on the faces that stared down at him. Maris was not there, he realized dimly…Henry…Bart…Raymond… Maris…his mind screamed the name, the urgency, but it took all of his effort to pinpoint his concentration. The urgency had aught to do with her…. Maris, his betrothed wife, his beloved…. D’Arcy. Dirick croaked the name as he struggled to sit upright. God in heaven, he was going to take her! “Maris,” he managed to push from a dry, swollen throat. Faintly, he heard Henry laugh, though the concern still ringed his eyes. “The man’s worried that he won’t be able to do his wife justice this night…he must be well.” Nevertheless, the king himself bent toward Dirick. “Can you stand, man?” Dirick gathered all of his wits and strength and nodded his head, reaching for the hand that was proffered to him. It was a beringed hand, and it belonged to Henry…but Dirick disregarded that fact as he lunged for the offered grip and pulled himself to his feet. He was in the forest. The members of the hunt had gathered around with their mounts, and the hounds, and even the carcass of the boar. “I must go,” was all he could say once he found Nick with his gaze. “Ludingdon, what ails you? You must come back to the castle and be tended to!” Henry boomed the order. “Richard! Marcus! Take him and bring him back to the physicians, and do not listen to his arguments! He has delayed my hunt long enough!” CHAPTER TWENTY FIVE “How much farther are they?” asked Maris, looking about the forest for some sign of the hunting party. She’d ridden quite far out of London with Michael and Victor and expected to find the hunting party at any time. Neither man replied to her question, nor did they seem to acknowledge it. “I do not see them anywhere,” she said more forcefully. “Surely the hunt did not take the party this far from the castle.” An uncomfortable twinge started in the base of her spine and she reined Hickory up. “Are you certain we are going in the right direction?” Michael stopped his horse and turned back to her. “Come, Maris, do not question me.” He grabbed the reins from her hands and began to propel Hickory behind his own mount. The twinge blossomed into a full foreboding and Maris felt fear curdle in her middle. “I must return to the castle for my wedding,” she said, squinting up at the sun that was beginning to climb down the sky. Panic started to blossom in her belly. Something was very wrong. Victor laughed and the sound sent a chill up her spine. “Your bridegroom is in no condition to attend the ceremony. There is no need for you to return.” Those words held a finality that did not sit well with Maris. It had occurred to her earlier that she’d disobeyed Dirick’s orders to go nowhere without him or Raymond…but her fear for his safety had been the overriding factor in her decision. And, in sooth, she’d forgotten her promise in the terror that he’d been injured. Michael urged his horse into a canter, and Maris was forced to lean forward and grab Hickory’s mane. Just as she had done when Bon abducted her, she forced herself to examine the situation. She swallowed the fear in her throat. She could not escape on foot, and Michael was in control of her horse. Victor rode so close to her that his mount’s tail brushed against Hickory’s shoulder. “’Tis not far from here,” he told his father, moving up so that their horses were neck and neck. Maris was now just behind them, but out of their easy sight as she was towed along on Hickory. She used the opportunity to slip a hand under her skirt and pull forth her dagger. She sent up a prayer of thanks that her mother had warned her never to be without the knife and set to cutting away at the reins. If she were quick, and lucky, she could cut herself free and be off. Mayhap, she and Hickory could outrun her kidnappers. If not— She stopped her thoughts right there. That possibility was not worth thinking on. Once again, Maris considered the facts and the situation. Dirick should have learned of her absence by now, and of course he would search for her. That thought eased her a bit. But as she continued to saw through the thick leather, another thought turned her cold. Michael and Victor talked so certainly of Dirick’s injury…mayhap there was a truth to it and he would not be able to come after her. Mayhap he was dead! Angry, frustrated tears welled in her eyes and she pushed the thought away. She’d think only of one thing now: escaping from Michael and Victor. When the reins were nearly cut through, Maris gathered herself and readied her courage, gripping Hickory with her thighs and tightening her fistful of mane. With a final slice, she cut the last bit of leather and kicked her horse to veer suddenly away. The shout of surprise erupted too close behind her and she leaned forward, urging Hickory as they raced for their freedom. The trampling of hooves in their trail was loud and gaining proximity and she felt tears sting her eyes. “Go, Hickory, go!” she cried into the mare’s ear, kicking her again. ’Twas of no use. One of them galloped up next to her and with a swift jerk, pulled her from her saddle across his own. She landed on her stomach with the air knocked out of her and saw the ground race by at a dizzying speed. She’d failed. “Bitch!” Michael’s voice was tight with fury as he slowed his horse to a walk. “Foolish woman!” Victor barreled up to them. “I’ll take her, Father. ’Tis my right to enjoy what little time we’ve left together.” Maris struggled as she was shoved over to the younger man’s mount and placed in front of him on the saddle. Michael gave her a hard slap to the face, stunning her, as Victor’s arms tightened around her waist. “What are you going to do?” she demanded, trying to ignore the pounding in her temple from the blow. Victor laughed harshly. “You seem so concerned about your wedding, my dear, that I should hate to disappoint you and have you forego your wedding night.” One of his hands slipped to close over her breast as he pushed his arousal into her bottom. “I would expect that to occupy us for some time, and then…well, my love, I do not see any purpose in returning damaged goods to your bridegroom…if indeed he still lives.” His fingers pinched cruelly at her breast, closing over her nipple so that she could not suppress a soft gasp of pain. “And I have no use for damaged goods myself. After all, ’twould do no good for me to beget a child upon my sister, now would it?” “What?” she gasped from pain as much as shock. “What, Father, you did not tell her that we are blood?” Victor asked, his hand moving to cup the full weight of her breast, fondling it roughly. Michael looked at Maris. “Your mother, whore that she is, begat my child before she married Merle of Langumont and birthed you.” “You are my father?” The pain from Victor’s seeking fingers faded in light of this revelation. “Nay.” “Oh, I assure you, ’tis true.” “But…I was to marry…your son…my brother.” Michael shrugged. “I did not know you were my daughter at that time. I didn’t learn of it until your stupid mother told me as we set out for Breakston to save you. In truth, it didn’t matter to me or to Victor…but your papa—Merle—must have learned this, for he told me he’d changed his mind over the betrothal.” A cold smile of such evil spread his features that Maris felt nauseated. “I could not accept that decision.” The nausea turned to cold anger. “You killed my father,” she whispered. “Oh, nay, he did not,” said Victor, leaning forward to thrust a tongue wet with slime into her ear. He murmured, “Nay, ’twas I who loosed the arrow into his back.” Maris jerked away from his cold mouth and was just as harshly jolted back onto a solid chest. “Nay, lady, you’ll not escape me this time. Long have I waited for the opportunity to break your arrogance and impudence, and I’ll have no more delays.” He sank his fingers into the mass of braids at the back of her scalp, pulling her head backward at an impossible angle, and kissed her forcefully. Just then, the sound of galloping reached their ears. All three turned to see a single man on horseback careening through the trees. Maris’s heart leapt until the man drew closer and she recognized him. Bon de Savrille. How could he be involved in this mess? “Halt!” Bon cried as Michael and Victor started to wheel their horses about, ready to make their escape. “Unhand her!” Bon did not slow, and his momentum brought him to their sides. Maris saw that he brandished a sword that glittered in the afternoon light and she took the opportunity to pull loose of Victor’s hands. With a quick elbow into his abdomen, Maris launched herself off the saddle, stumbled, then started running through the woods as fast as she could. There were shouts of anger behind her, and she heard a scream of pain from one of the horses, but she kept running. There was no sound of horse’s hooves following her, but she knew in her numb mind that when they finished their battle—whoever was left—would chase her down. Swallowing back nausea, Dirick leaned forward over Nick’s neck. His head still pounded and his entire body throbbed with pain…but his intent was single: to find Maris. He refused to allow himself to think of what could be happening, what she might be going through, as he led the party of men through the forest. Fortunately, several people had spotted Michael and Victor with Maris and Dirick had had to waste little time in discovering their trail. The odd part, he reflected, happy to focus on some other puzzle so that he wouldn’t go crazy with worry, was the third man who had followed in their wake.","sourceLink":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3/page-50.html","bookId":2669,"book":{"id":2669,"title":"A Whisper Of Rosemary (Medieval Herb Garden #3)","description":"Storyline: A Whisper of Rosemary (Medieval Herb Garden #3) Knights in shining armor...damsels in distress...adventure, romance and intrigue.... Dirick of Derkland, man of the king, sets off on a mission of revenge after his father’s brutal murder. His mind is bent solely on vengeance until he meets the beautiful Maris of Langumont…. Maris of Langumont has vowed never to wed…but her father must do his duty to protect her, and he promises her to Victor D’Arcy—a man who makes her blood run cold. Bon de Savrille rests his eyes upon Maris only once, and decides she must be his. He whisks her away just before her betrothal ceremony, determined to force her into marriage. When Dirick appears at the castle where Maris is held captive, she believes he is part of the plot…and ’tis nearly his death she causes during her chance to escape.","cover":"https://allnovel.net/images/a-whisper-of-rosemary-medieval-herb-garden-3.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:58:57 AM"}}
