{"id":65957,"no":6,"title":"Page 6","content":"\\n\\n “Papa, have you not allowed me to learn to ride and hunt as well as a man? Have you not insisted that I learn to read and write so I can keep my own accounts? Yet you feel that I am not able to retain hold of my own lands without a husband.” She looked imploringly at her father, her small hand resting over his big one. “Do not force me to marry yet, please, Papa.”\\n\\n He was shaking his head slowly. “Aye, Maris, I insisted that you be as able to rule your lands as a man, yet never did I disallow the fact that you must marry. It is the best for Langumont, too, daughter. Langumont, which you purport to love as much as you do me. The people cannot be left without a strong liege to protect them, and, intelligent and brave as you are, my dearling, you cannot ride into battle and defend the lands. And there is the matter of your own heir, my dearling.”\\n\\n Maris opened her mouth to argue, then closed it as she realized he spoke the truth. She had known, had she not, that this day would come. As much as she had ignored it, tried to believe it would never happen…nay, it had always been on the horizon. She bit her lip and swallowed, then looked at him. “Papa, at the least, do not force me to wed with a man I do not know.”\\n\\n “Maris, I am not fond of the word ‘force’. You will do your duty, and you will trust me and accept my decision for your husband. Have I not always taken the best care of you? I cannot allow this matter to remain unsettled any longer.” He paused for a sip of his own wine. “The son of the man who saved my life in battle rides to Langumont,” he told her. “Take care that you do not offend him, nor drive him away as you flaunt your horsemanship and archery skills.”\\n\\n “Who is he?” she asked, a note of desperation creeping into her voice. Her fate had already been sealed.\\n\\n “You shall meet him,” he promised.\\n\\n “Aye, Papa,” she said, staring studiously at the hands in her lap.\\n\\n “Good girl, Maris.” He put his arm around her, pulling her shoulder to his. “Know that I want only what is best for you.”\\n\\n “Aye, Papa,” she said again, struggling to keep the sadness from her voice.\\n\\n After a few moments of silence, she rose slowly. “I’ll to bed now, my lord.” She kissed his cheek gently.\\n\\n “Sleep well, child,” he said quietly, brushing her face.\\n\\n Merle hoisted himself carefully into bed. His muscles ached, not to mention the wound in his side that was barely healed enough to sit ahorse.\\n\\n Allegra sat in the bed next to him. She had dismissed her maid Maella after the woman brushed out her mistress’s long hair and braided it in its customary plait. Curls framed her face as her wide gaze fastened on her husband. He sensed her tension, and not understanding the reason for it, reached to take her cold fingers.\\n\\n “’Tis glad I am to be home,” he told her, bringing them to his mouth for a soft kiss. “And back in my own chamber this night, at least.”\\n\\n “And I too,” she murmured, pulling her hand away as she reached over to pull the draperies about the bed.\\n\\n “Maris is grown to a beautiful lady,” he said, staring at the velvet draperies as she drew them together. “’Tis well past time for her to be wed.”\\n\\n Allegra froze. “My lord?”\\n\\n “Aye. She will be wed within the year. ’Tis not safe for her otherwise.”\\n\\n “My lord, you—but my lord, you may not find a worthy man in the year.”\\n\\n “Aye, yet I have found one. One that is worthy of my Maris’s hand, worthy to have Langumont.” He scratched his belly and looked at her slim form with interest. It had been a long while since he’d bedded his wife, and though she wasn’t the most receptive woman he’d coupled with, she was his wife, and she was there.\\n\\n “Who is it?” she asked, her voice thin and tight.\\n\\n “’Tis the son of a dear friend.” He struggled under the blankets to twist and show her the ugly wound in his side.\\n\\n Allegra gasped and covered her face at the sight of the red, swollen gash, reminding Merle yet again how fortunate he was to have a daughter so well versed in healing. Otherwise, he’d have to allow the leeches to attend to his hurts, for his wife could not. “He is a dear friend who caused this not to be my last wound.”\\n\\n “But, my lord, I beg you—do not make the decision to betrothe Maris in haste,” she said, reaching to touch the grey speckled hair on his scarred chest. “Mayhaps there is another—”\\n\\n “Nay. Lady, know you this—Maris will wed with Victor d’Arcy on Midsummer’s Eve. He is well suited for her. He will arrive in short order to sign the betrothal agreement.”\\n\\n “So soon?”\\n\\n “Aye. She will marry Victor. For her own well being.”\\n\\n Allegra twisted her fingers into the heavy fur that covered their bed. “But my lord, surely there are others—”\\n\\n “Woman, do you not hear me?” Merle was irritated. “She will marry Victor d’Arcy and that is the end of it.”\\n\\n “Aye, my lord.” Her voice was choked and her attention was turned away, fixed on the inside of the curtains by her.\\n\\n Merle thought of one other thing, “Allegra. Do you not let Maris bathe Raymond Vermille any longer. He looks at her too admiringly, and it would not be good to inflate his infatuation. Send Maella or Verna to take care of him.”\\n\\n “Aye.”\\n\\n Weary of waiting, and in no mood to coax, he closed his hand softly over her breast and drew her close. “Come, woman, it has been nigh too long.”\\n\\n CHAPTER THREE\\n\\n Bon de Savrille opened his swollen eyes slowly. Too much wine and wenching to celebrate Christ’s Mass—and the eve of. And the day following.\\n\\n His head pounded and the daylight streaming into the inn’s room was too bright. Verna the Bountiful, as he’d come to think of her, stirred next to him. He swatted her hard enough to force a squeal as she started awake. She rolled over leisurely and gave him a long, deep kiss.\\n\\n His hand grasped her large breast and squeezed until she sighed a moan of pleasured pain, then he nipped at the tight peak of flesh. Verna purred as Bon’s large hand swept over her belly and down between her legs. She closed work roughened fingers over his erection and proceeded to torment him until he threw her flat so he could drive fiercely into her body.\\n\\n Rough nails scored his back and the pain and smell of blood only served to heighten his pleasure. The pounding in his head receded and passion ruled him now. Verna was quite the best lay he’d had for years. It was good fortune that had led him to her on the threshold of Merle Lareux’s keep.\\n\\n In the afterglow of their angry, violent mating, he lay staring at the low, dark ceiling. He’d watched from a distance as Merle Lareux returned to his home, seen how the people greeted him—and, especially, how his daughter, Maris, attached herself to his side. ’Twas obvious that the man adored her—and that made Bon’s scheme all the more brilliant. Allegra, his stupid sister, would not dare chance driving a wedge between her husband and daughter. Not if she wanted to continue as Lady of Langumont Keep.\\n\\n Satisfaction settled over him as his thoughts wandered on to the pleasure of having the young and beautiful Maris in his bed. He’d watched her follow the old lady into the village two days earlier. She’d spent the better part of the afternoon in a tiny, filthy hut ministering to some peasants. They would be good partners—she the figurehead, the beloved chatelaine, the healer, and he, the great lord, the meter of justice.\\n\\n And in bed….His cock shifted with enthusiasm as he imagined her face slack with passion, her hazel eyes smoky with pleasure.\\n\\n Verna felt him stir against her, and she lazily turned to look over her shoulder at him. “My lord, you are randy this morn,” she murmured, pressing her buttocks into his erection.\\n\\n He said nothing, but when his hand felt between her legs, he found her ready for him as well. Bon thrust into her from behind, catching her off guard. She writhed with pleasure, and he pounded himself inside Maris of Langumont over and over until he filled her with his seed.\\n\\n “Soon, my lady,” he promised softly, knowing he must ride from the gates of Langumont Keep this day. But he would return. “Soon.”\\n\\n Merle Lareux sat opposite a stranger knight, listening to his story. The man, called Dirick de Arlande, had arrived at the keep early that morning. He’d requested a private audience with him in the name of the king, and Merle had no choice but to take the time to meet with him.\\n\\n He was glad he’d done so.\\n\\n Merle examined the figure standing confidently before him. The knight’s black and blue standard, which he did not recognize, was a sword and shield on the backdrop of a roaring yellow flame, and the young man’s figure was imposing yet unthreatening.\\n\\n Merle felt himself being studied in return by a pair of cool grey eyes, and he sensed impatience and restlessness from the man. And, he thought, something else. Sorrow or grief.\\n\\n “To account for my words,” Dirick concluded his explanation, gesturing to the thick parchment packet he’d just handed to his host, “I bring a missive from his majesty.”\\n\\n Merle turned the parchment over in his hands, noting the red wax seal of his sovereign. The man before him was no mere royal messenger. Breaking the seal and unfolding the creased missive, he perused the king’s words carefully.\\n\\n “The king speaks highly of you, Sir Dirick,” he said, refolding the parchment. Something niggled at the back of his mind, and it took a moment before he realized what it was. And then…ah. “You are Dirick of Derkland—Harold’s son? You are using a different name.”\\n\\n “Aye.”\\n\\n “You must be aware that I came upon your father’s death scene.” Merle tightened his fingers on the parchment, remembering the depravity pervading the glen where he’d found Harold’s mutilated body. It was like nothing he’d ever seen, even on the worst battlefield. A maniac had been there…and even as Merle attempted to see if there were any survivors, he felt the weight of evil suffocating the small, still glen. His eyes burned with tears a hardened man such as he would be loathe to shed. “I’m sorry that your father is dead, and in such a manner. It was unconscionable. Whoever did such a deed is surely already in hell.” \\n\\n","sourceLink":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3/page-6.html","bookId":2669,"book":{"id":2669,"title":"A Whisper Of Rosemary (Medieval Herb Garden #3)","description":"Storyline: A Whisper of Rosemary (Medieval Herb Garden #3) \\n Knights in shining armor...damsels in distress...adventure, romance and intrigue.... \\n Dirick of Derkland, man of the king, sets off on a mission of revenge after his father’s brutal murder. His mind is bent solely on vengeance until he meets the beautiful Maris of Langumont…. \\n Maris of Langumont has vowed never to wed…but her father must do his duty to protect her, and he promises her to Victor D’Arcy—a man who makes her blood run cold. \\n Bon de Savrille rests his eyes upon Maris only once, and decides she must be his. He whisks her away just before her betrothal ceremony, determined to force her into marriage. \\n When Dirick appears at the castle where Maris is held captive, she believes he is part of the plot…and ’tis nearly his death she causes during her chance to escape.\\n","cover":"https://allnovel.net/images/a-whisper-of-rosemary-medieval-herb-garden-3.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-whisper-of-rosemary-medieval-herb-garden-3.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:58:57 AM"}}
