{"id":79244,"no":13,"title":"Page 13","content":"MY CELL. Lying on my belly. Medics examining my back, rubbing cool lotions into my skin. Somebody lifting my charred feet, gasping, calling for help.\\n\\n Gazing at the ceiling. Someone holding a torch up to my eyes, peering into my pupils. A razor running over my head, scalping me, removing the remains of my burnt hair. Gavner Purl stepping forward, worried. \"I think he\u0027s -\" he starts to say. Darkness.\\n\\n Nightmares. The world on fire. Running. Burning. Screaming. Calling for help. Everybody else on fire too.\\n\\n Jolt awake. Vampires around me. Nightmare still playing at the back of my mind. Convinced the cell\u0027s on fire. I try to break free. They hold me down. I curse them. Struggle. Pain gushes through me. Wince. Relax. Return to fire-plagued dreams.\\n\\n Finally I drifted back from the lands of delirium. I was lying facedown. I moved my head slightly to gaze around the cell. Mr. Crepsley and Harkat Mulds were sitting nearby, monitoring me.\\n\\n \"Thought... I saw... Gavner,\" I wheezed.\\n\\n Mr. Crepsley and Harkat sprang forward, smiling worriedly. \"He was here earlier,\" Mr. Crepsley said. \"So were Kurda, Vanez, and Arra. The medics told them to leave.\"\\n\\n \"I... made it?\" I asked.\\n\\n \"Yes.\"\\n\\n \"How bad... am I... burnt?\"\\n\\n \"Very bad,\" Mr. Crepsley said.\\n\\n \"You look... like an over-... cooked sausage,\" Harkat joked.\\n\\n I laughed weakly. \"I sound... like you... now,\" I told him.\\n\\n \"Yes,\" he agreed. \"But you... will get... better.\"\\n\\n \"Will I?\" I addressed the question to Mr. Crepsley.\\n\\n \"Yes,\" he said, nodding firmly. \"You have suffered a terrible ordeal, but the damage is not permanent. Your feet suffered the worst of the punishment, but the medics have saved them. It will take time to heal, and your hair might never grow back, but you are in no immediate danger.\"\\n\\n \"I feel... terrible,\" I told him.\\n\\n \"Be glad you can feel at all,\" he replied bluntly.\\n\\n \"What about... next Trial?\"\\n\\n \"Do not think of such things now.\"\\n\\n \"I... must,\" I gasped. \"Will I... have time... to get ready... for it?\"\\n\\n Mr. Crepsley didn\u0027t say anything.\\n\\n \"Tell me... the truth,\" I insisted.\\n\\n \"There will be no extra time,\" he sighed. \"Kurda is in the Hall of Princes as we speak, arguing your case, but he will not be able to persuade them to postpone. There is no precedent for a delay between Trials. Those unfit to continue must...\" He came to a stop.\\n\\n \"... be taken to... the Hall of... Death,\" I finished for him.\\n\\n While he sat there, trying to think of something comforting to say, Kurda returned, looking flushed with excitement. \"Is he awake?\" he asked.\\n\\n \"I am,\" I answered.\\n\\n Crouching beside me, he said, \"It\u0027s almost sunset. You must choose your next Trial or admit failure and be carted away for execution. If we carry you to the Hall of Princes, do you think you\u0027ll be able to stand upright for a couple of minutes?\"\\n\\n \"I\u0027m not... sure,\" I answered honestly. \"My feet... hurt.\"\\n\\n \"I know,\" he said. \"But it\u0027s important. I\u0027ve found a way to buy us some time, but only if you can act as if you\u0027re fine.\"\\n\\n \"What way?\" Mr. Crepsley asked, astonished.\\n\\n \"No time for explanations,\" Kurda snapped. \"Are you willing to give it a try, Darren?\"\\n\\n I nodded weakly.\\n\\n \"Good. Let\u0027s get him on a stretcher and up to the Hall of Princes. We can\u0027t be late.\"\\n\\n Hurrying through the tunnels, we made it to the Hall just in time for sunset. Vanez Blane was outside, waiting with his purple flag. \"What\u0027s going on, Kurda?\" he asked. \"There\u0027s no way Darren will be ready to face a Trial tomorrow.\"\\n\\n \"Trust me,\" Kurda said. \"It was Paris\u0027s idea, but we can\u0027t let on. We have to act as if we\u0027re ready to continue. It all hinges on Darren standing up and drawing his Trial. Come on. And remember - we have to act like there\u0027s nothing wrong.\"\\n\\n We were all mystified by Kurda\u0027s behavior, but we had no choice except to do what he said. Entering the Hall of Princes, I heard the voices of the vampires within drop, as all eyes fixed upon us. Kurda and Mr. Crepsley carried me to the platform of the Princes, Harkat and Vanez just behind.\\n\\n \"Is this young Master Shan?\" Paris asked.\\n\\n \"It is, sire,\" Kurda answered.\\n\\n \"He looks terrible,\" Mika Ver Leth noted. \"Are you sure he\u0027s fit to continue with the Trials?\"\\n\\n \"He is merely resting, sire,\" Kurda said lightly. \"He likes to pretend to be injured, so that he can be carried around like a lord.\"\\n\\n \"Really?\" Mika replied, smiling tightly. \"If that is the case, let the boy step forward and choose his next Trial. You understand,\" he added ominously, \"what we must do if he is unable?\"\\n\\n \"We understand,\" Kurda said as he laid his end of the stretcher down. Mr. Crepsley followed suit. The two vampires helped me to my feet, then slowly let go of me. I teetered dangerously and almost fell. I probably would have, if there hadn\u0027t been so many vampires present - but I didn\u0027t want to look frail in front of them.\\n\\n Fighting the pain, I stumbled forward to the platform. It took a long time to make it up the steps, but I didn\u0027t falter. Nobody said anything while I was climbing, and when I got there the bag of numbered stones was produced and checked as normal. \"Number four,\" the vampire clutching the bag announced once I\u0027d drawn my stone. \"The Blooded Boars.\"\\n\\n \"A tricky Trial,\" Paris Skyle mused as the stone was passed to the Princes to be certified. \"Are you ready for it, Darren?\"\\n\\n \"I don\u0027t... know what it... is,\" I said. \"But... I will be... there to face it... tomorrow, as... scheduled.\"\\n\\n Paris smiled warmly. \"That is good to hear.\" He cleared his throat and widened his eyes innocently. \"I, however, cannot make it. I have pressing business to attend to and regretfully must miss this Trial. My good colleague Mika will take my place.\"\\n\\n Mika imitated Paris\u0027s innocent look. \"Actually, I can\u0027t get away from the Hall tomorrow either. This Vampaneze Lord business takes up all my time. How about you, Arrow?\"\\n\\n The bald Prince shook his head glumly. \"Alas, I also must make my excuses. My schedule is full.\"\\n\\n \"Sires,\" Kurda said, quickly stepping forward. \"You have already skipped one of Darren\u0027s Trials. We allowed for your absence on that occasion, but to neglect your post twice in the course of one set of Trials is unpardonable and does Darren a grave disservice. I must protest most strongly.\"\\n\\n Paris started to smile, caught himself, and forced a scowl. \"There is truth in your words,\" he muttered.\\n\\n \"We cannot miss another of the boy\u0027s Trials,\" Mika agreed.\\n\\n \"One way or another, one of us must be present,\" Arrow finished.\\n\\n The three Princes huddled close together and discussed it quietly. By the way they smirked and winked at Kurda, I knew they had something up their sleeves.\\n\\n \"Very well,\" Paris said out loud. \"Darren has reported that he is fit for his next Trial. Since we cannot be there to oversee it, we have decided to postpone it. We apologize for the inconvenience, Darren. Will you pardon us?\"\\n\\n \"I\u0027ll let... it pass... this time.\" I grinned.\\n\\n \"How long must we wait, sires?\" Kurda asked, acting impatient. \"Darren is anxious to finish his Trials.\"\\n\\n \"Not long,\" Paris said. \"One of us will be there for the Trial at sunset, seventy-two hours from now. Is that agreeable?\"\\n\\n \"It is annoying, sire,\" - Kurda sighed theatrically - \"but if we have to wait, we will.\"\\n\\n Bowing, Kurda led me from the platform, helped me back onto the stretcher, and carried me from the Hall with Mr. Crepsley. Once outside, the vampires set me down and laughed loudly.\\n\\n \"You scoundrel, Kurda Smahlt!\" Mr. Crepsley roared. \"How did you dream that one up?\"\\n\\n \"It was Paris\u0027s idea,\" Kurda replied humbly. \"The Princes wanted to help Darren, but they couldn\u0027t turn around and say they were giving him time to recover from his injuries. They needed an excuse to save face. This way, it looks as though Darren was ready and willing to proceed, so there\u0027s no shame in postponing it.\"\\n\\n \"That\u0027s why... I had to stand,\" I noted. \"So nobody would be... suspicious.\"\\n\\n \"Correct.\" Kurda beamed. \"Everyone in the Hall knows what\u0027s really happening, but as long as it looks as if everything is in order, nobody will object.\"\\n\\n \"Three nights... and days,\" I mused. \"Will it be... enough?\"\\n\\n \"If not, it will not be for want of trying,\" Mr. Crepsley said with fierce determination, and we set off down the tunnels at a brisk pace to find some medics capable of knocking me back into shape before I had to face the Blooded Boars. \\n\\n","sourceLink":"https://allnovel.net/trials-of-death-the-saga-of-darren-shan-5/page-13.html","bookId":2441,"book":{"id":2441,"title":"Trials of Death (The Saga of Darren Shan #5)","description":"Storyline: The Saga of Darren Shan #5: Trials of Death \\n The main character, Darren Shan, takes part in the Trials of Initiation. The trials are a series of tasks that vampires used to have to do to prove themselves to the Princes. Now it is only used for vampires who want to become a general or that want to show their strength, but Darren Shan has to endure the trials because Mr. Crepsley said so and Darren chooses to stand up for his mentor and friend. Darren must randomly choose five numbered stones from a bag to determine the trials he must take part in. The first of his five selected trials is The Aquatic Maze, which is a maze that fills steadily with water in 17 minutes while Darren has to get through while dragging a rock half his weight. The second trial is The Path of Needles, which is a run from one end of a room to the other barefoot across stalagmites...\\n","cover":"https://allnovel.net/images/trials-of-death-the-saga-of-darren-shan-5.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/trials-of-death-the-saga-of-darren-shan-5.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:14:40 PM"}}
