{"id":68392,"no":21,"title":"Page 21","content":"PAUL CHANCELLOR SPENT the day fighting the military bureaucracy-persuading, threatening, pleading, cajoling, and as a last resort using the name of Monty-and, in the end, he got a plane for the team\u0027s parachute training tomorrow.\n When he caught the train back to Hampshire, he found he was eager to see Flick again.\n He liked her a lot.\n She was smart, tough, and a pleasure to look at.\n He wished to hell she was single.\n On the train he read the war news in the paper.\n The long lull on the eastern front had been broken, yesterday, by a surprisingly powerful German attack in Rumania.\n The continuing resilience of the Germans was formidable.\n They were in retreat everywhere, but they kept fighting back.\n The train was delayed, and he missed six o\u0027clock dinner at the Finishing School.\n After dinner there was always another lecture; then at nine the students were free to relax for an hour or so before bed.\n Paul found most of the team gathered in the drawing room of the house, which had a bookcase, a cupboard full of games, a wireless set, and a half-size billiards table.\n He sat on the sofa beside Flick and said quietly, \"How did it go today?\" \"Better than we had a right to expect,\" she said.\n \"But everything is so compressed.\n I don\u0027t know how much they\u0027re going to remember when they\u0027re in the field.\" \"I guess anything is better than nothing.\" Percy Thwaite and Jelly were playing poker for pen- flies.\n Jelly was a real character, Paul thought.\n How could a professional safebreaker consider herself a respectable English lady? \"How was Jelly?\" he asked Flick.\n \"Not bad.\n She has more difficulty than the others with the physical training but, my goodness, she just grit her teeth and got on with it, and in the end she did everything the youngsters did.\" Flick paused and frowned.\n Paul said, \"What?\" \"Her hostility to Greta is a problem.\" \"It\u0027s not surprising that an Englishwoman should hate Germans.\" \"It\u0027s illogical, though-Greta has suffered more from the Nazis than Jelly has.\" \"Jelly doesn\u0027t know that.\" \"She knows that Greta\u0027s prepared to fight against the Nazis.\" \"People aren\u0027t logical about these things.\" \"Too bloody right.\" Greta herself was talking to Denise.\n Or rather, Paul thought, Denise was talking and Greta was listening.\n \"My stepbrother, Lord Foules, pilots fighter-bombers,\" he heard her say in her half-swallowed aristocratic accent.\n \"He\u0027s been training to fly support missions for the invasion troops.\" Paul frowned.\n \"Did you hear that?\" he asked Flick.\n \"Yes.\n Either she\u0027s making it up, or she\u0027s being dangerously indiscreet.\" He studied Denise.\n She was a rawboned girl who always looked as if she had just been insulted.\n He did not think she was fantasizing.\n \"She doesn\u0027t seem the imaginative type,\" he said.\n \"I agree.\n I think she\u0027s giving away real secrets.\" \"I\u0027d better arrange a little test tomorrow.\" \"Okay.\" Paul wanted to get Flick to himself so that they could talk more freely.\n \"Let\u0027s take a stroll around the garden,\" he said.\n They stepped outside.\n The air was warm and there was an hour of daylight left.\n The house had a large garden with several acres of lawn dotted with trees.\n Maude and Diana were sitting on a bench under a copper beech.\n Maude had flirted with Paul at first, but he had given her no encouragement, and she seemed to have given up.\n Now she was listening avidly to something Diana was saying, looking into Diana\u0027s face with an attitude almost of adoration.\n \"I wonder what Diana\u0027s saying?\" Paul said.\n \"She\u0027s got Maude fascinated.\" \"Maude likes to hear about the places she\u0027s been,\" Flick said.\n \"The fashion shows, the balls, the ocean liners.\" Paul recalled that Maude had surprised him by asking whether the mission would take them to Pans.\n \"Maybe she wanted to go to America with me,\" he said.\n \"I noticed her making a play for you,\" Flick said.\n \"She\u0027s pretty.\" \"Not my type, though.\" \"Why not?\" \"Candidly? She\u0027s not smart enough.\" \"Good,\" Flick said.\n \"I\u0027m glad.\" He raised an eyebrow at her.\n \"Why?\" \"I would have thought less of you otherwise.\" He thought this was a little condescending.\n \"I\u0027m glad to have your approval,\" he said.\n \"Don\u0027t be ironic,\" she reprimanded him.\n \"I was paying you a compliment.\" He grinned.\n He could not help liking her, even when she was being high-handed.\n \"Then I\u0027ll quit while I\u0027m ahead,\" he said.\n They passed close to the two women, and heard Diana say, \"So the contessa said, \u0027Keep your painted claws off my husband,\u0027 then poured a glass of champagne over Jennifer\u0027s head, whereupon Jennifer pulled the contessa\u0027s hair-and it came off in her hand, because it was a wig!\" Maude laughed.\n \"I wish I\u0027d been there!\" Paul said to Flick, \"They all seem to be making friends.\" \"I\u0027m pleased.\n I need them to work as a team.\" The garden merged gradually with the forest, and they found themselves walking through woodland.\n It was only half light under the canopy of leaves.\n \"Why is it called the New Forest?\" Paul said.\n \"It looks old.\" \"Do you still expect English names to be logical?\" He laughed.\n \"I guess I don\u0027t.\" They walked in silence for a while.\n Paul felt quite romantic.\n He wanted to kiss her, but she was wearing a wedding ring.\n \"When I was four years old, I met the King,\" Flick said.\n \"The present king?\" \"No, his father, George V.\n He came to Somersholme.\n I was kept out of his way, of course, but he wandered into the kitchen garden on Sunday morning and saw me.\n He said, \u0027Good morning, little girl, are you ready for church?\u0027 He was a small man, but he had a booming voice.\" \"What did you say?\" \"I said, \u0027Who are you?\u0027 He replied, \u0027I\u0027m the King.\u0027 And then, according to family legend, I said, \u0027You can\u0027t be, you\u0027re not big enough.\u0027 Fortunately, he laughed.\" \"Even as a child, you had no respect for authority.\" \"So it seems.\" Paul heard a low moan.\n Frowning, he looked toward the sound and saw Ruby Romam with Jim Cardwell, the firearms instructor.\n Ruby had her back to a tree and Jim was embracing her.\n They were kissing passionately.\n Ruby moaned again.\n They were not just embracing, Paul realized, and he felt both embarrassed and aroused.\n Jim\u0027s hands were busy inside Ruby\u0027s blouse.\n Her skirt was up around her waist.\n Paul could see all of one brown leg and a thick patch of dark hair at her groin.\n The other leg was raised and bent at the knee, and Ruby\u0027s foot rested high on Jim\u0027s hip.\n The movement they were making together was unmistakable.\n Paul looked at Flick.\n She had seen the same thing.\n She stared for a moment, her expression showing shock and something else.\n Then she turned quickly away.\n Paul followed suit, and they went back the way they had come, walking as quietly as they could.\n When they were out of earshot, he said, \"I\u0027m terribly sorry about that.\" \"Not your fault,\" she said.\n \"Still, I\u0027m sorry I led you that way.\" \"I really don\u0027t mind.\n I\u0027ve never seen anyone.\n doing that.\n It was rather sweet.\" \"Sweet?\" It was not the word he would have chosen.\n \"You know, you\u0027re kind of unpredictable.\" \"Have you only just noticed?\" \"Don\u0027t be ironic, I was paying you a compliment,\" he said, repeating her own words.\n She laughed.\n \"Then I\u0027ll quit while I\u0027m ahead.\" They emerged from the woods.\n Daylight was fading fast, and the blackout curtains were drawn in the house.\n Maude and Diana had gone from their seat under the copper beech.\n \"Let\u0027s sit here for a minute,\" Paul said.\n He was in no hurry to go inside.\n Flick complied without speaking.\n He sat sideways, looking at her.\n She bore his scrutiny without comment, but she was thoughtful.\n He took her hand and stroked her fingers.\n She looked at him, her face unreadable, but she did not pull away her hand.\n He said, \"I know I shouldn\u0027t, but I really want to kiss you.\" She made no reply but continued to look at him with that enigmatic expression, half amused and half sad.\n He took silence for assent, and kissed her.\n Her mouth was soft and moist.\n He closed his eyes, concentrating on the sensation.\n To his surprise, her lips parted, and he felt the tip of her tongue.\n He opened his mouth.\n He put his arms around her and pulled her to him, but she slipped out of his embrace and stood up.\n \"Enough,\" she said.\n She turned away and walked toward the house.\n He watched her go in the fading light.\n Her small, neat body suddenly seemed the most desirable thing in the world.\n When she had disappeared inside, he followed.\n In the drawing room, Diana sat alone, smoking a cigarette, looking thoughtful.\n On impulse, Paul sat close to her and said, \"You\u0027ve known Flick since you were kids.\" Diana smiled with surprising warmth.\n \"She\u0027s adorable, isn\u0027t she?\" Paul did not want to give away too much of what was in his heart.\n \"I like her a lot, and I wish I knew more about her.\" \"She always yearned for adventure,\" Diana said.\n \"She loved those long trips we made to France every February.\n We would spend a night in Paris, then take the Blue Train all the way to Nice.\n One winter, my father decided to go to Morocco.\n I think it was the best time of Flick\u0027s life.\n She learned a few words of Arabic and talked to the merchants in the souks.\n We used to read the memoirs of those doughty Victorian lady explorers who traveled the Middle East dressed as men.\" \"She got on well with your father?\" \"Better than I did.\" \"What\u0027s her husband like?\" \"All Flick\u0027s men are slightly exotic.\n At Oxford, her best friend was a Nepalese boy, Rajendra, which caused great consternation in the senior common room at St.\n Hilda\u0027s, I can tell you, although I\u0027m not sure she ever, you know, misbehaved with him.\n A boy called Charlie Standish was desperately in love with her, but he was just too boring for her.\n She fell for Michel because he\u0027s charming and foreign and clever, which is what she likes.\" \"Exotic,\" Paul repeated.\n Diana laughed.\n \"Don\u0027t worry, you\u0027ll do.\n You\u0027re American, you\u0027ve only got one and a half ears, and you\u0027re as smart as a whip.\n You\u0027re in with a chance, at least.\" Paul stood up.\n The conversation was taking an uncomfortably intimate turn.\n \"I\u0027ll take that as a compliment,\" he said with a smile.\n \"Goodnight.\" On his way upstairs, he passed Flick\u0027s room.\n There was a light under the door.\n He put on his pajamas and got into bed, but he lay awake.\n He was too excited and happy to sleep.\n He relived the kiss again and again.\n He wished he and Flick could be like Ruby and Jim, and give in to their desires shamelessly.\n Why not? he thought.\n Why the hell not? The house fell quiet.\n A few minutes after midnight, Paul got up.\n He went along the corridor to Flick\u0027s room.\n He tapped gently on the door and stepped inside.\n \"Hello,\" she said quietly.\n \"It\u0027s me.\" \"I know.\" She lay on her back in the single bed, her head propped up on two pillows.\n The curtains were drawn back, and moonlight came in at the small window.\n He could see, quite clearly, the straight line of her nose and the chisel chin that he had once thought not to be pretty.\n Now they seemed angelic.\n He knelt by the bed.\n \"The answer is no,\" she said.\n He took her hand and kissed her palm.\n \"Please,\" he said.\n \"I do.\" He leaned over her to kiss her, but she turned her head away.\n \"Just a kiss?\" he said.\n \"If I kiss you, I\u0027ll be lost.\" That pleased him.\n It told him she was feeling the same way he did.\n He kissed her hair, then her forehead and her cheek, but she kept her face averted.\n He kissed her shoulder through the cotton of her nightdress, then brushed his lips over her breast.\n \"You want to,\" he said.\n \"Out,\" she commanded.\n \"Don\u0027t say that.\" She turned to him.\n He bent his face to kiss her, but she put a finger on his lips as if to hush him.\n \"Go,\" she said.\n \"I mean it.\"\n He looked at her lovely face in the moonlight.\n Her expression was set with determination.\n Although he hardly knew her, he understood that her will could not be overridden.\n Reluctantly, he stood up.\n He gave it one more try.\n \"Look, let\u0027s-\" \"No more talk.\n Go.\" He turned away and left the room.\n THE FIFTH DAY Thursday, June 1, 1944 \n","sourceLink":"https://allnovel.net/jackdaws/page-21.html","bookId":2681,"book":{"id":2681,"title":"Jackdaws","description":"Storyline: \n In his own bestselling tradition of Eye of the Needle and The Key to Rebecca, Ken Follett once again strikes Nazi pay dirt as a gang of all-female saboteurs go behind German lines.\n \n","cover":"https://allnovel.net/images/jackdaws.jpg","author":"Ken Follett","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jackdaws.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:08:29 AM"}}
