{"id":68375,"no":4,"title":"Page 4","content":"DIETER WAS DISMAYED and appalled.\\n\\n As the shooting began to peter out, and his heartbeat returned to normal, he started to reflect on what he had seen.\\n\\n He had not thought the Resistance capable of such a well- planned and carefully executed attack.\\n\\n From everything he had learned in the last few months, he believed their raids were normally hit-and-run affairs.\\n\\n But this had been his first sight of them in action.\\n\\n They had been bristling with guns and obviously not short of ammunition-unlike the German army! Worst of all, they had been courageous.\\n\\n Dieter had been impressed by the rifleman who had dashed across the square, by the girl with the Sten gun who had given him covering fire, and most of all by the little blonde who had picked up the wounded rifleman and had carried him-a man six inches taller than she-out of the square to safety.\\n\\n Such people could not fail to be a profound threat to the occupying military force.\\n\\n These were not like the criminals Dieter had dealt with as a cop in Cologne before the war.\\n\\n Criminals were stupid, lazy, cowardly, and brutish.\\n\\n These French Resistance people were fighters.\\n\\n But their defeat gave him a rare opportunity.\\n\\n When he was sure the shooting had stopped, he got to his feet and helped Stephanie up.\\n\\n Her cheeks were flushed, and she was breathing hard.\\n\\n She held his hands and looked into his face.-\"You protected me,\" she said.\\n\\n Tears came to her eyes.\\n\\n \"You made yourself a shield for me.\" He brushed dirt from her hip.\\n\\n He was surprised by his own gallantry.\\n\\n The action had been instinctive.\\n\\n When he thought about it, he was not at all sure he would really be willing to give his life to save Stephanie.\\n\\n He tried to pass over it lightly.\\n\\n \"No harm should come to this perfect body,\" he said.\\n\\n She began to cry.\\n\\n He took her hand and led her across the square to the gates.\\n\\n \"Let\u0027s go inside,\" he said.\\n\\n \"You can sit down for a while.\" They entered the grounds.\\n\\n Dieter saw a hole in the wall of the church.\\n\\n That explained how the main force had got inside.\\n\\n The Waffen-SS troops had come out of the building and were disarming the attackers.\\n\\n Dieter looked keenly at the Resistance fighters.\\n\\n Most were dead, but some were only wounded, and one or two appeared to have surrendered unhurt.\\n\\n There should be several for him to interrogate.\\n\\n Until now, his work had been defensive.\\n\\n The most he had been able to do was fortify key installations against the Resistance by beefing up security.\\n\\n The occasional prisoner had yielded little information.\\n\\n But having several prisoners, all from one large and evidently well-organized circuit, was a different matter.\\n\\n This might be his chance of going on the attack, he thought eagerly.\\n\\n He shouted at a sergeant, \"You-get a doctor for these prisoners.\\n\\n I want to interrogate them.\\n\\n Don\u0027t let any die.\" Although Dieter was not in uniform, the sergeant assumed from his manner that he was a superior officer, and said, \"Very good, sir.\" Dieter took Stephanie up the steps and through the stately doorway into the wide hall.\\n\\n It was a breathtaking sight: a pink marble floor, tall windows with elaborate curtains, walls with Etniscan motifs in plaster picked out in dusty shades of pink and green, and a ceiling painted with fading cherubs.\\n\\n Once, Dieter assumed, the room had been filled with gorgeous furniture: pier tables under high mirrors, sideboards encrusted with ormolu, dainty chairs with gilded legs, oil paintings, huge vases, little marble statuettes.\\n\\n All that was gone now, of course.\\n\\n Instead there were rows of switchboards, each with its chair, and a snake\u0027s nest of cables on the floor.\\n\\n The telephone operators seemed to have fled into the grounds at the rear but, now that the shooting had stopped, a few of them were standing at the glazed doors, still wearing their headsets and breast microphones, wondering if it was safe to come back inside.\\n\\n Dieter sat Stephanie at one of the switchboards, then beckoned a middle-aged woman telephonist.\\n\\n \"Madame,\" he said in a polite but commanding voice.\\n\\n He spoke French.\\n\\n \"Please bring a cup of hot coffee for this lady.\" The woman came forward, shooting a look of hatred at Stephanie.\\n\\n \"Very good, monsieur.\" \"And some cognac.\\n\\n She\u0027s had a shock.\" \"We have no cognac.\" They had cognac, but she did not want to give it to the mistress of a German.\\n\\n Dieter did not argue the point.\\n\\n \"Just coffee, then, but be quick, or there will be trouble.\" He patted Stephanie\u0027s shoulder and left her.\\n\\n He passed through double doors into the east wing.\\n\\n The chateau was laid out as a series of reception rooms, one leading into the next on the Versailles pattern, he found.\\n\\n The rooms were full of switchboards, but these had a more permanent look, the cables bundled into neatly made wooden trunking that disappeared through the floor into the cellar beneath.\\n\\n Dieter guessed the hail looked messy only because it had been brought into service as an emergency measure after the west wing had been bombed.\\n\\n Some of the windows were permanently blacked out, no doubt as an air-raid precaution, but others had heavy curtains drawn open, and Dieter supposed the women did not like to work in permanent night.\\n\\n At the end of the east wing was a stairwell.\\n\\n Dieter went down.\\n\\n At the foot of the staircase he passed through a steel door.\\n\\n A small desk and a chair stood just inside, and Dieter assumed a guard normally sat there.\\n\\n The man on duty had presumably left his post to join in the fighting.\\n\\n Dieter entered unchallenged and made a mental note of a security breach.\\n\\n This was a different environment from that of the grand principal floors.\\n\\n Designed as kitchens, storage, and accommodation for the dozens of staff who would have serviced this house three hundred years ago, it had low ceilings, bare walls, and floors of stone, or even, in some rooms, beaten earth.\\n\\n Dieter walked along a broad corridor.\\n\\n Every door was clearly labeled in neat German signwriting, but Dieter looked inside anyway.\\n\\n On his left, at the front of the building, was the complex equipment of a major telephone exchange: a generator, enormous batteries, and rooms full of tangled cables.\\n\\n On his right, toward the back of the house, were the Gestapo\u0027s facilities: a photo lab, a large wireless listening room for eavesdropping on the Resistance, and prison cells with peepholes in the doors.\\n\\n The basement had been bombproofed: all windows were blocked, the walls were sandbagged, and the ceilings had been reinforced with steel girders and poured concrete.\\n\\n Obviously that was to prevent Allied bombers from putting the phone system out of action.\\n\\n At the end of the corridor was a door marked Interrogation Center.\\n\\n He went inside.\\n\\n The first room had bare white walls, bright lights, and the standard furniture of a simple interview room: a cheap table, hard chairs, and an ashtray.\\n\\n Dieter went through to the next room.\\n\\n Here the lights were less bright and the walls bare brick.\\n\\n There was a bloodstained pillar with hooks for tying people up; an umbrella stand holding a selection of wooden clubs and steel bars; a hospital operating table with a head clamp and straps for the wrists and ankles; an electric shock machine; and a locked cabinet that probably contained drugs and hypodermic syringes.\\n\\n It was a torture chamber.\\n\\n Dieter had been in many similar, but still they sickened him.\\n\\n He had to remind himself that intelligence gathered in places such as this helped save the lives of decent young German soldiers so that they could eventually go home to their wives and children instead of dying on battlefields.\\n\\n All the same, the place gave him the creeps.\\n\\n There was a noise behind him, startling him.\\n\\n He spun around.\\n\\n When he saw what was in the doorway he took a frightened step back.\\n\\n \"Christ!\" he said.\\n\\n He was looking at a squat figure, its face thrown into shadow by the strong light from the next room.\\n\\n \"Who are you?\" he said, and he could hear the fear in his own voice.\\n\\n The figure stepped into the light and turned into a man in the uniform shirt of a Gestapo sergeant.\\n\\n He was short and pudgy, with a fleshy face and ash-blond hair cropped so short that he looked bald.\\n\\n \"What are you doing here?\" he said in a Frankfurt accent.\\n\\n Dieter recovered his composure.\\n\\n The torture chamber had unnerved him, but he regained his habitual tone of authority and said, \"I am Major Franck.\\n\\n Your name?\" The sergeant became deferential at once.\\n\\n \"Becker, sir, at your service.\" \"Get the prisoners down here as soon as possible, Becker,\" said Dieter.\\n\\n \"Those who can walk should be brought immediately, the others when they have been seen by a doctor.\" \"Very good, Major.\" Becker went away.\\n\\n Dieter returned to the interview room and sat in the hard chair.\\n\\n He wondered how much information he would get out of the prisoners.\\n\\n Their knowledge might be limited to their own town.\\n\\n If his luck was bad, and their security good, each individual might know only a little about what went on in their own circuit.\\n\\n On the other hand, there was no such thing as perfect security A few individuals inevitably amassed a wide knowledge of their own and other Resistance circuits.\\n\\n His dream was that one circuit might lead him to another in a chain, and he might be able to inflict enormous damage on the Resistance in the weeks remaining before the Allied invasion.\\n\\n He heard footsteps in the corridor and looked out.\\n\\n The prisoners were being brought in.\\n\\n The first was the woman who had concealed a Sten gun beneath her coat.\\n\\n Dieter was pleased.\\n\\n It was so useful to have a woman among the prisoners.\\n\\n Under interrogation, women could be as tough as men, but often the way to make a man talk was to beat a woman in front of him.\\n\\n This one was tall and sexy, which was all the better.\\n\\n She seemed to be uninjured.\\n\\n Dieter held up a hand to the soldier escorting her and spoke to the woman in French.\\n\\n \"What is your name?\" he said in a friendly tone.\\n\\n She looked at him with haughty eyes.\\n\\n \"Why should I tell you?\" He shrugged.\\n\\n This level of opposition was easy to overcome.\\n\\n He used an answer that had served him well a hundred times.\\n\\n \"Your relatives may inquire whether you are in custody.\\n\\n If we know your name, we may tell them.\" \"I am Genevieve Delys.\" \"A beautiful name for a beautiful woman.\" He waved her on.\\n\\n Next came a man in his sixties, bleeding from a head injury and limping too.\\n\\n Dieter said, \"You\u0027re a little old for this sort of thing, aren\u0027t you?\" The man looked proud.\\n\\n \"I set the charges,\" he said defiantly.\\n\\n \"Name?\" \"Gaston Lefvre.\" \"Just remember one thing, Gaston,\" Dieter said in a kindly voice.\\n\\n \"The pain lasts as long as you choose.\\n\\n When you decide to end it, it will stop.\" Fear came into the man\u0027s eyes as he contemplated what faced him.\\n\\n Dieter nodded, satisfied.\\n\\n \"Carry on.\" A youngster was next, no more than seventeen, Dieter guessed, a good-looking boy who was absolutely terrified.\\n\\n \"Name?\" He hesitated, seeming dazed by shock.\\n\\n After thinking, he said, \"Bertrand Bisset.\" \"Good evening, Bertrand,\" Dieter said pleasantly.\\n\\n \"Welcome to Hell.\" The boy looked as if he had been slapped.\\n\\n Dieter pushed him on.\\n\\n Willi Weber appeared, with Becker pacing behind him like a dangerous dog on a chain.\\n\\n \"How did you get in here?\" Weber said rudely to Dieter.\\n\\n \"I walked in,\" Dieter said.\\n\\n \"Your security stinks.\" \"Ridiculous! You\u0027ve just seen us beat off a major attack!\" \"By a dozen men and some girls!\" \"We defeated them, that\u0027s all that counts.\" \"Think about it, Willi,\" Dieter said reasonably.\\n\\n \"They were able to assemble close by, quite unnoticed by you, then force their way into the grounds and kill at least six good German soldiers.\\n\\n I suspect the only reason you defeated them was that they had underestimated the numbers against them.\\n\\n And I entered this basement unchallenged because the guard had left his post.\" \"He\u0027s a brave German, he wanted to join the fighting.\" \"God give me strength,\" Dieter said in despair.\\n\\n \"A soldier in battle doesn\u0027t leave his post to join the fighting, he follows orders!\" \"I don\u0027t need a lecture from you on military discipline.\" Dieter gave up, for now.\\n\\n \"And I have no desire to give one.\" \"What do you want?\" \"I\u0027m going to interview the prisoners.\" \"That\u0027s the Gestapo\u0027s job.\" \"Don\u0027t be idiotic.\\n\\n Field Marshal Rommel has asked me, not the Gestapo, to limit the capacity of the Resistance to damage his communications in the event of an invasion.\\n\\n These prisoners can give me priceless information.\\n\\n I intend to question them.\" \"Not while they\u0027re in my custody,\" Weber said stubbornly.\\n\\n \"I shall interrogate them myself and send the results to the Field Marshal.\" \"The Allies are probably going to invade this summer- isn\u0027t it time to stop fighting turf wars?\" \"It is never time to abandon efficient organization.\" Dieter could have screamed.\\n\\n In desperation, he swallowed his pride and tried for a compromise.\\n\\n \"Let\u0027s interrogate them together.\" Weber smiled, sensing victory \"Absolutely not.\" \"This means I\u0027ll have to go over your head.\" \"If you can.\" \"Of course I can.\\n\\n All you will achieve is a delay.\" \"So you say.\" \"You damned fool,\" Dieter said savagely.\\n\\n \"God preserve the fatherland from patriots such as you.\" He turned on his heel and stalked out. \\n\\n","sourceLink":"https://allnovel.net/jackdaws/page-4.html","bookId":2681,"book":{"id":2681,"title":"Jackdaws","description":"Storyline: In his own bestselling tradition of Eye of the Needle and The Key to Rebecca, Ken Follett once again strikes Nazi pay dirt as a gang of all-female saboteurs go behind German lines.\\n","cover":"https://allnovel.net/images/jackdaws.jpg","author":"Ken Follett","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jackdaws.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:08:29 AM"}}
