{"id":68423,"no":52,"title":"Page 52","content":"DIETER SAT ON the platform at the Reims railway station.\n French railway men and German troops watched with him, standing patiently under the harsh lights.\n The prison train was late, hours late, but it was coming, he had been assured of that.\n He had to wait for it.\n He had no other cards to play.\n His heart was full of rage.\n He had been humiliated and defeated by a girl.\n Had she been a German girl, he would have been proud of her.\n He would have called her brilliant and brave.\n He might even have fallen in love with her.\n But she belonged to the enemy, and she had outwitted him at every turn.\n She had killed Stephanie, she had destroyed the chateau, and she had escaped.\n But he would catch her yet.\n And when he did, she would suffer tortures worse than her most terrifying imaginings-then she would talk.\n Everyone talked.\n The train rolled in a few minutes after midnight.\n He noticed the stink even before it came to a halt.\n It was like the smell of a farmyard but disgustingly human.\n There was an assortment of rail cars, none of them designed for passengers: goods wagons, cattle trucks, even a mail car with its narrow windows broken.\n Each was crammed with people.\n The livestock wagons had high wooden sides pierced by slats to permit observation of the animals.\n The prisoners nearest put their arms through the slats, hands open with palms upward, begging.\n They asked to be let out, they pleaded for something to eat, but most of all they begged for water.\n The guards looked on impassively: Dieter had given instructions that the prisoners were to have no relief at Reims tonight.\n He had two Waffen SS corporals with him, guards from the chateau, both good marksmen.\n He had extracted them from the shambles at Sainte-Cecile, trading on his authority as a major.\n He turned to them now and said, \"Bring Michel Clairet.\" Michel was locked in the windowless room where the stationmaster kept the cash.\n The corporals went away and reappeared with Michel between them.\n His hands were tied behind his back and his ankles were hobbled so that he could not run.\n He had not been told what had happened at Sainte-Cecile.\n All he knew was that he had been captured for the second time in a week.\n There was little left of his buccaneering persona.\n He was trying to maintain an air of bravado, to keep his spirits up, but the attempt was a failure.\n His limp was worse, his clothes were dirty, and his face grim.\n He looked defeated.\n Dieter took Michel\u0027s arm and walked him closer to the train.\n At first, Michel did not understand what he was looking at, and his face showed only mystification and fear.\n Then, when he made out the begging hands and understood the piteous voices, he staggered, as if he had been struck, and Dieter had to hold him upright.\n Dieter said, \"I need some information.\" Michel shook his head.\n \"Put me on the train,\" he said.\n \"I\u0027d rather be with them than with you.\" Dieter was shocked by the insult and surprised by Michel\u0027s courage.\n He said, \"Tell me where the Jackdaws\u0027 plane will land-and when.\" Michel stared at him.\n \"You haven\u0027t caught them,\" he said, and hope came back into his face.\n \"They\u0027ve blown up the chateau, haven\u0027t they? They succeeded.\" He threw back his head and gave a whoop of joy.\n \"Well done, Flick!\" Dieter made Michel walk the length of the train, slowly, showing him the numbers of prisoners and the scale of their suffering.\n \"The plane,\" he said again.\n Michel said, \"The field outside La Chatelle, at three a.m.\" Dieter was almost certain that was false.\n Flick had been scheduled to arrive at La Chatelle seventy-two hours ago but had aborted the landing, presumably because she suspected a Gestapo trap.\n Dieter knew there was a backup landing place, because Gaston had told him so; but Gaston had known only its code name, Champ d\u0027Or, not its location.\n Michel, however, would know the exact place.\n \"You\u0027re lying,\" Dieter said.\n \"Then put me on the train,\" Michel replied.\n Dieter shook his head.\n \"That\u0027s not the choice-nothing so easy.\" He saw puzzlement and the shadow of fear in Michel\u0027s eyes.\n Dieter walked him back and stopped at the women\u0027s car.\n Their feminine voices begged in French and German, some invoking the pity of God, others asking the men to think of their mothers and sisters, a few offering sexual favors.\n Michel bowed his head, refusing to look.\n Dieter beckoned to two figures standing in the shadows.\n Michel looked up, and a terrible dread came over his face.\n Hans Hesse walked out of the shadows, escorting a young woman.\n She might have been beautiful, but her face was ghastly white, her hair lay in greasy strands, and she had sores on her lips.\n She seemed weak, walking with difficulty.\n It was Gilberte.\n Michel gasped.\n Dieter repeated his question.\n \"Where will the plane land, and when?\" Michel said nothing.\n Dieter said, \"Put her on the train.\" Michel moaned.\n A guard opened the gate of a cattle car.\n While two others kept the women in with bayonets, the guard pushed Gilberte into the car.\n \"No,\" she cried.\n \"No, please!\" The guard was about to close the gate, but Dieter said, \"Wait.\" He looked at Michel.\n Tears were pouring down the man\u0027s face.\n Gilberte said, \"Please, Michel, I beg you.\" Michel nodded.\n \"All right,\" he said.\n \"Don\u0027t lie again,\" Dieter warned.\n \"Let her out.\" \"The time and place.\" \"The potato field east of Laroque, at two a.m.\" Dieter looked at his watch.\n It was twelve-fifteen.\n \"Show me,\" he said.\n F IV E K I L 0 M E T E R S F R 0 M Laroque, the village of L\u0027Epine was asleep.\n Bright moonlight silvered the big church.\n Behind the church, Moulier\u0027s meat van was parked inconspicuously next to a barn.\n In the deep moon shadow thrown by a buttress, the surviving Jackdaws sat waiting.\n \"What are you looking forward to?\" said Ruby.\n Paul said, \"A steak.\" Flick said, \"A soft bed with clean sheets.\n How about you?\" \"Seeing Jim.\" Flick recalled that Ruby had had a fling with the firearms instructor.\n \"I thought.\n .\" She stopped.\n \"You thought it was just a casual shag?\" Ruby said.\n Flick nodded, embarrassed.\n \"So did Jim,\" Ruby said.\n \"But I\u0027ve got other plans.\" Paul laughed softly.\n \"I\u0027ll bet you get what you want.\" \"What about you two?\" Ruby asked.\n Paul said, \"I\u0027m single.\" He looked at Flick.\n She shook her head.\n \"I intended to ask Michel for a divorce..\n but how could I, in the middle of an operation?\" \"So we\u0027ll wait until after the war to get married,\" Paul said.\n \"I\u0027m patient.\" \u0027typical man, Flick thought.\n He slips marriage into the conversation like a minor detail, on a level with buying a dog license.\n So much for romance.\n But in truth she was pleased.\n It was the second time he had mentioned marriage.\n Who needs romance? she thought.\n She looked at her watch.\n It was one-thirty.\n \"lime to go,\" she said.\n DIETER HAD COMMANDEERED a Mercedes limousine that had been outside the chateau grounds and so had survived the explosion.\n The car was now parked at the edge of the vineyard next to the potato field at Laroque, camouflaged with leafy vines torn from the ground.\n Michel and Gilberte were in the backseat, bound hand and foot, guarded by Hans.\n Dieter also had with him the two corporals, each armed with a rifle.\n Dieter and the riflemen looked into the potato field.\n They could see clearly in the moonlight.\n Dieter said, \"The terrorists will be here in the next few minutes.\n We have the advantage of surprise.\n They have no idea that we\u0027re here.\n But remember, I must have them alive-especially the leader, the small woman.\n You have to shoot to wound, not kill.\" One of the marksmen said, \"We can\u0027t guarantee that.\n This field must be three hundred meters wide.\n Let\u0027s say the enemy is a hundred and fifty meters away.\n At that distance, no one could be sure of hitting the legs of a running man.\" \"They won\u0027t be running,\" Dieter said.\n \"They\u0027re meeting a plane.\n They have to form a line, pointing electric torches at the aircraft to guide the pilot down.\n That means they\u0027ll be standing still for several minutes.\" \"In the middle of the field?\" \"Yes.\" The man nodded.\n \"Then we can do it.\" He looked up.\n \"Unless the moon goes behind a cloud.\" \"In that event, we\u0027ll turn on the headlights of the car at the crucial moment.\" The Mercedes had huge dinner- plate lamps.\n The other marksman said, \"Listen.\" They fell silent.\n A motor vehicle was approaching.\n They all knelt.\n Despite the moonlight, they would not be visible against the dark mass of the vines, provided they kept their heads down.\n A van came along the road from the village with its lights off It pulled up by the gate to the potato field.\n A female figure jumped out and swung the gate wide.\n The van pulled in and its engine was silenced.\n Two more people got out, another woman and a man.\n \"Quiet, now,\" Dieter whispered.\n Suddenly the hush was shattered by the blare of a car horn, incredibly loud.\n Dieter jumped and cursed.\n It came from immediately behind him.\n \"Jesus!\" he exploded.\n It was the Mercedes.\n He leaped to his feet and ran to the open window of the driver\u0027s door.\n He saw immediately what had happened.\n Michel had sprung forward, leaning across the front seat, and before Hans could stop him he had pressed on the horn with his bound hands.\n Hans, in the front passenger seat, was now trying to aim his gun, but Gilberte had joined in, and she was lying half over Hans, hampering his movements so that he kept having to push her away.\n Dieter reached in and shoved Michel, but Michel resisted, and Dieter\u0027s position, with his arms extended through the car window, was too awkward for him to exert much force.\n The horn continued to sound a deafening warning that the Resistance agents could not fail to hear.\n Dieter fumbled for his gun.\n Michel found the light switch, and the car\u0027s headlights came on.\n Dieter looked up.\n The riflemen were hideously exposed in the glare of the lights.\n They both got up off their knees, but before they could throw themselves out of the beam there was a rattle of machine-gun fire from the field.\n One rifleman cried out, dropped his gun, clutched his belly, and fell across the hood of the Mercedes; then the other was shot in the head.\n A sharp pain stung Dieter\u0027s left arm, and he let out a yell of shock.\n Then there was a shot from within the car, and Michel cried out.\n Hans had at last flung Gilberte off himself and got his pistol out.\n He fired again, and Michel slumped, but Michel\u0027s hand was still on the horn, and his body now lay over his hand, pressing it down, so the horn continued to blare.\n Hans fired a third time, uselessly, for his bullet thudded into the body of a dead man.\n Gilberte screamed and threw herself at Hans again, grabbing at his gun arm with her manacled hands.\n Dieter had his gun out but could not shoot at Gilberte for fear of hitting Hans.\n There was a fourth shot.\n It was Hans\u0027s gun again, but now it was somehow pointing upwards, and he shot himself, the bullet hitting him under the chin.\n He gave a horrid gurgle, blood came out of his mouth, and he slumped back against the door, his eyes staring lifelessly.\n Dieter took careful aim and shot Gilberte in the head.\n He reached through the window with his right arm and shoved the corpse of Michel away from the steering wheel.\n The horn was silenced.\n He found the light switch and killed the headlights.\n He looked across the field.\n The van was still there, but the Jackdaws had disappeared.\n He listened.\n Nothing moved.\n He was alone.\n FLICK CRAWLED THROUGH the vineyard on her hands and knees, heading for Dieter Franck\u0027s car.\n The moonlight, so necessary for clandestine flights across occupied territory, was now her enemy.\n She wished for a cloud to shade the moon, but for the moment the sky was clear.\n She kept close to the row of vines, but she threw a conspicuous moon shadow.\n She had firmly instructed Paul and Ruby to stay behind, hiding at the edge of the field near the van.\n Three people made three times the noise, and she did not want a companion to betray her presence.\n As she crawled, she listened for the incoming plane.\n She had to locate any remaining enemies and kill them before the plane arrived.\n The Jackdaws could not stand in the middle of the field with flashlights while there were armed troops aiming at them from the vineyard.\n And if they did not hold flashlights, the plane would return to England without touching down.\n The thought was unbearable.\n She was deeper into the vineyard than Dieter Franck\u0027s car, which was parked at the edge.\n She was five rows of vines back.\n She would approach the enemy from behind.\n She kept the submachine gun in her right hand, ready to fire, as she crawled.\n She drew level with the car.\n Franck had camouflaged it with vegetation, but when she peeped over the rows of vines she saw moonlight glint off the rear window.\n The shoots of the vines were espaliered crosswise, but she was able to crawl beneath the lowest strand.\n She pushed her head through and looked up and down the next alley.\n It was clear.\n She crawled across the open space and repeated the exercise.\n She grew ultra cautious as she approached the car, but she saw no one.\n When she was two rows away, she was able to see the wheels of the car and the ground around it.\n She thought she could make out two motionless bodies in uniform.\n How many were there in total? It was a long Mercedes limousine and could easily carry six.\n She crept closer.\n Nothing moved.\n Were they all dead? Or had one or two survived, and concealed themselves nearby, waiting to pounce? Eventually she crawled right up to the car.\n The doors were wide open, and the interior seemed full of bodies.\n She looked in the front and recognized Michel.\n She choked back a sob.\n He was a bad husband, but he had been her choice, and now he was lifeless, with three red-ringed bullet holes in his blue chambray shirt.\n She guessed he had been the one to sound the horn.\n If so, he had died saving her life.\n There was no time to think of such things now: she would ponder them later, if she lived long enough.\n Next to Michel lay a man she did not recognize who had been shot in the throat.\n He wore the uniform of a lieutenant.\n There were more bodies in the back.\n She looked through the open rear door.\n One was that of a woman.\n She leaned into the car for a better view.\n She gasped: the woman was Gilberte, and she seemed to be staring at flick.\n A ghastly moment later, Flick realized that the eyes saw nothing, and Gilberte was dead, shot in the head.\n She leaned over Gilberte to look at the fourth corpse.\n It rose up from the floor in a swift motion.\n Before she had time to scream, it grabbed her by the hair and thrust the barrel of a gun into the soft flesh of her throat.\n It was Dieter Franck.\n \"Drop the gun,\" he said in French.\n She was holding the submachine gun in her right hand, but it was pointing up and, before she could aim it, he would be able to shoot her.\n She had no choice: she dropped it.\n The safety catch was disengaged, and she half-hoped the impact of its fall would fire the gun, but it landed harmlessly on the earth.\n \"Back away.\" As she stepped back, he followed her, getting out of the car, keeping the gun at her throat.\n He drew himself upright.\n \"You\u0027re so small,\" he said, looking her up and down.\n \u0027And you\u0027ve done so much damage.\" She saw blood on the sleeve of his suit and guessed she had winged him with her Sten gun.\n \"Not just to me,\" he said.\n \"That telephone exchange is every bit as important as you obviously believe.\" She found her voice.\n \"Good.\" \"Don\u0027t look pleased.\n Now you\u0027re going to damage the Resistance.\" She wished she had not been so fierce in ordering Paul and Ruby to wait in hiding.\n There was now no chance they would come to her rescue.\n Dieter shifted the gun from her throat to her shoulder.\n \"I don\u0027t want to kill you, but I\u0027d be happy to give you a crippling wound.\n I need you able to talk, of course.\n You\u0027re going to give me all the names and addresses in your head.\" She thought of the suicide pill concealed in the hollow cap of her fountain pen.\n Would she have a chance to take it? \"It\u0027s a pity you\u0027ve destroyed the interrogation facility at Sainte-Cecile,\" he went on.\n \"I\u0027ll have to drive you to Paris.\n I\u0027ve got all the same equipment there.\" She thought with horror of the hospital operating table and the electric shock machine.\n \"I wonder what will break you?\" he said.\n \"Sheer pain breaks everyone eventually, of course, but I feel that you might bear pain for an inconveniently long time.\" He raised his left arm.\n The wound seemed to give him a twinge, and he winced, but he bore it.\n He touched her face.\n \"The loss of your looks, perhaps.\n Imagine this pretty face disfigured: the nose broken, the lips slashed, one eye put out, the ears cut off\" Flick felt sick, but she maintained a stony expression.\n \"No?\" His hand moved down, stroking her neck; then he touched her breast.\n \"Sexual humiliation, then.\n To be naked in front of many people, fondled by a group of drunk men, forced to perform acts of grossness with animals .\n \"And which of us would be most humiliated by that?\" she said defiantly.\n \"Me, the helpless victim.\n or you, the real perpetrator of obscenity?\" He took his hand away.\n \"Then again, we have tortures which destroy forever a woman\u0027s ability to bear children.\" Flick thought of Paul and flinched involuntarily.\n \"Ah,\" he said with satisfaction.\n \"I believe I have found the key to unlock you.\" She realized she had been foolish to speak to him.\n Now she had given him information which he could use to break her will.\n \"We\u0027ll drive straight to Paris,\" he said.\n \"We\u0027ll be there by dawn.\n By midday, you will be begging me to stop the torture and listen to you pour out all the secrets you know.\n Tomorrow night we will arrest every member of the Resistance in northern France.\" Flick was cold with dread.\n Franck was not bragging.\n He could do it.\n \"I think you can travel in the trunk of the car,\" he said.\n \"It\u0027s not airtight, you won\u0027t suffocate.\n But I\u0027ll put the corpses of your husband and his lover in with you.\n A few hours bumping around with dead people will put you in the right frame of mind, I think.\" Flick shuddered with loathing.\n She could not help it.\n Keeping the pistol pressed to her shoulder, he reached into his pocket with his other hand.\n He moved his arm cautiously: the bullet wound hurt but did not incapacitate him.\n He drew out a pair of handcuffs.\n \"Give me your hands,\" he said.\n She remained motionless.\n \"I can either handcuff you, or render your arms useless by shooting you in both shoulders.\" Helpless, she raised her hands.\n He closed one cuff over her left wrist.\n She moved her right toward him.\n Then she made her last desperate move.\n She struck sideways with her handcuffed left hand, knocking his gun away from her shoulder.\n At the same time she used her right hand to draw the small knife from its hidden sheath behind the lapel of her jacket.\n He flinched back, but not fast enough.\n She lunged forward and thrust the knife directly into his left eye.\n He turned his head, but the knife was already in, and Flick moved farther forward, pressing her body up against his, ramming the knife home.\n Blood and fluid spurted from the wound.\n Franck screamed in agony and fired his gun, but the shots went into the air.\n He staggered back, but she followed him, still pushing the knife with the heel of her hand.\n The weapon had no hilt, and she continued to shove until its entire three inches had sunk into his head.\n He fell backwards and hit the ground.\n She fell on him, knees on his chest, and she felt ribs crack.\n He dropped his gun and clawed at his eye with both hands, trying to get at the knife, but it was sunk too deep.\n Flick grabbed the gun.\n It was a Walther P38.\n She stood upright, held it two-handed, and aimed it at Franck.\n Then he fell still.\n She heard pounding footsteps.\n Paul rushed up.\n \"Flick! Are you all right?\" She nodded.\n She was still pointing the Walther at Dieter Franck.\n \"I don\u0027t think that will be necessary,\" Paul said softly.\n After a moment, he moved her hands, then gently took the gun from her and engaged the safety catch.\n Ruby appeared.\n \"Listen!\" she cried.\n \"Listen!\" Flick heard the drone of a Hudson.\n \"Let\u0027s get moving,\" Paul said.\n They ran out into the field to signal the plane that would take them home.\n T H E Y C ROSS E D T H E English Channel in strong winds and intermittent rain.\n During a quiet spell, the navigator came back into the passenger compartment and said, \"You might want to take a look outside.\" Flick, Ruby, and Paul were dozing.\n The floor was hard, but they were exhausted.\n Flick was wrapped in Paul\u0027s arms, and she did not want to move.\n The navigator pressed them.\n \"You\u0027d better be quick, before it clouds over again.\n You\u0027ll never see anything like this again if you live to be a hundred.\" Curiosity overcame Flick\u0027s tiredness.\n She got up and staggered to the small rectangular window.\n Ruby did the same.\n Obligingly, the pilot dipped a wing.\n The English Channel was choppy, and a stiff wind blew, but the moon was full and she could see clearly.\n At first she could hardly believe her eyes.\n Immediately below the plane was a gray-painted warship bristling with guns.\n Alongside it was a small ocean liner, its paint- work gleaming white in the moonlight.\n Behind them, a rusty old steamer pitched into the swell.\n Beyond them and behind were cargo boats, troop transports, battered old tankers, and great shallow-draft landing ships.\n There were ships as far as Flick could see, hundreds of them.\n The pilot dipped the other wing, and she looked out the other side.\n It was the same.\n \"Paul, look at this!\" she cried.\n He came and stood beside her.\n \"Jeepers!\" he said.\n \"I\u0027ve never seen so many ships in all my life!\" \"It\u0027s the invasion!\" she said.\n \"Take a look out the front,\" said the navigator.\n Flick went forward and looked over the pilot\u0027s shoulder.\n The ships were spread out over the sea like a carpet, stretching for miles and miles, as far as she could see.\n She heard Paul\u0027s incredulous voice say, \"I didn\u0027t know there were this many ships in the damn world!\" \"How many do you think it is?\" Ruby said.\n The navigator said, \"I heard five thousand.\" \"Amazing,\" Flick said.\n The navigator said, \"I\u0027d give a lot to be part of that, wouldn\u0027t you?\" Flick looked at Paul and Ruby, and they all smiled.\n \"Oh, we are,\" she said.\n \"We\u0027re part of it, all right.\"\n ONE YEAR LATER Wednesday, June 6,1945 \n","sourceLink":"https://allnovel.net/jackdaws/page-52.html","bookId":2681,"book":{"id":2681,"title":"Jackdaws","description":"Storyline: \n In his own bestselling tradition of Eye of the Needle and The Key to Rebecca, Ken Follett once again strikes Nazi pay dirt as a gang of all-female saboteurs go behind German lines.\n \n","cover":"https://allnovel.net/images/jackdaws.jpg","author":"Ken Follett","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jackdaws.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:08:29 AM"}}
