{"id":80200,"no":8,"title":"Page 8","content":"A large, white room. No windows, but there\u0027s a long mirror in one of the walls. I\u0027ve seen enough films and TV shows to guess that it\u0027s a two-way observation point. I bet there\u0027s a team of soldiers or scientists on the other side, watching everything.\n There\u0027s a pool table and a ping-pong table down at one end of the room. A bookshelf with a scattering of books, magazines and comics. A couple of TVs, one hooked up to a DVD player, the other to a video-game console. There\u0027s a table close to that TV, loaded with games and a few iPods. A variety of couches and chairs are positioned around the place.\n A couple of the zom heads are playing pool. Three are busy gaming. One - the girl called Cathy - is watching TV and filing down her teeth. And the final zom head is slumped on a chair near the bookshelf, flicking through a car magazine.\n Seven in total. One more than I saw in the room all those weeks ago.\n I hover by the door - Reilly didn\u0027t say anything when he let me in - waiting for the others to notice me. Finally one of the guys playing pool looks up and shouts, \"Hey! It\u0027s the girl who kicked Rage\u0027s arse!\"\n Everything comes to a stop and those who were sitting stand up to ogle me, all except the one in the chair with the magazine. He just glances at me, yawns, then returns to his mag.\n I push forward, smiling awkwardly. \"Hi. I\u0027m Becky Smith, but everyone calls me B.\"\n \"Becky it is,\" one of the boys laughs, and jogs across. He sticks out a hand - it\u0027s covered by a glove and bandages. \"I\u0027m Mark,\" he says as we shake hands. \"I wasn\u0027t there when you revitalized. They keep me out of stuff like that. Afraid I\u0027ll react badly to the flames.\"\n \"What do you mean?\" I ask.\n The boy gestures at himself. He\u0027s covered completely from neck to toe, heavy clothes, some sort of a padded vest, more bandages, heavy-duty boots. \"I got burned to the bone while I was a revived. They don\u0027t know how. My face is okay but I\u0027m like a skeleton under all these layers. I have to stay wrapped up. They\u0027re worried that if I lose any more internal - \"\n \"Can it, Worm,\" one of the other boys says. \"You\u0027d bore her to death if she wasn\u0027t already dead.\" He nods at me but doesn\u0027t smile. He\u0027s dark-skinned, with short curly hair. I would have shot him the finger six months ago in response to his nod. But since I\u0027m trying to change and accept everyone as an equal, no matter what color they are, I nod back at him instead.\n \"B,\" I tell him.\n \"I know,\" he says drily. \"I\u0027m not deaf. I\u0027m Peder.\"\n \"Danny,\" the boy beside him says. Danny\u0027s tall and bony. Greasy blond hair and bad acne. He\u0027s wearing jeans and a T-shirt like mine. As I look around, I see that all of the others are similarly dressed, except for the guy in the chair. He\u0027s in the leathers he was wearing when I first saw him.\n \"Cathy Kelly,\" the girl introduces herself coldly. She sits and focuses on the video game. She has long, dark hair tied back in a ponytail. Pretty, but not in a soft way.\n One of the other boys comes over and shakes my hand. \"Gokhan.\"\n \"Gherkin?\" I frown.\n \"Gokhan.\" He spells it out. \"Turkish, innit?\"\n He\u0027s plump and relaxed-looking. Olive skin. Large, pudgy fingers. He\u0027s filed down the bones sticking out of the tips and painted them with swirling, colorful designs.\n \"And I\u0027m Tiberius,\" the other guy who was playing pool says. He\u0027s the one who first spotted me. He\u0027s short, with ginger hair and loads of freckles.\n \"Tiberius?\" I laugh automatically. \"What sort of a dumb name is that?\"\n \"I was named after the river Tiber in Rome,\" he says stiffly. Then he turns his back on me, offended, and snaps at Mark, \"Are you playing or what, Worm?\"\n \"In a minute,\" Mark says. \"I want to show B round first. Don\u0027t you want to get to know her? She\u0027s one of us now.\"\n \"Maybe she is and maybe she isn\u0027t,\" the boy in the chair says. He finally stands, cracks his knuckles over his head and makes a yawning motion. I know from practicing in my cell that we can mimic the habits of the past, when we had a set of fully functioning lungs. I even find myself yawning or sneezing by accident sometimes, my body remembering happier, simpler days.\n The yawning knuckle cracker is the tall guy with the big head and small ears, the chubby, rosy cheeks, a chunk bitten out of the left one. The guy I clobbered over the head when I first recovered. Rage.\n \"Of course she\u0027s one of us,\" Mark says. \"She can talk, can\u0027t she?\"\n \"Oh, she\u0027s a revitalized,\" Rage says, eyeing me beadily. \"Doesn\u0027t mean she\u0027s a zom head though. You\u0027ve gotta earn that right. Which you haven\u0027t yet, Worm, in case you\u0027d forgotten.\"\n Mark scowls and stares at his feet. \"It\u0027s not my fault they don\u0027t let me join in with the rest of you. I would if I could. You know that.\"\n \"You say that you would,\" Rage sneers. \"But there\u0027s saying and there\u0027s doing, and so far you\u0027ve done zip. For all we know, you\u0027ve cried off and asked to be excused regular duties. Maybe the burns are a sham. Maybe they\u0027re just saying that because you asked them to cover up for the fact that you\u0027re a coward.\"\n Mark stiffens, then squares himself and raises his fists. His hands are shaking, more with fear, I think, than indignation. \"Say that again and I\u0027ll thump you,\" he squeaks. \"I don\u0027t care how big you are.\"\n Rage laughs. \"Back down, Worm. I\u0027m only messing with you.\"\n He comes closer and circles me slowly. I say nothing while I\u0027m being examined. When he\u0027s finished, I stare at him calmly. \"Like what you see?\"\n \"Not a lot,\" he sniffs. \"I don\u0027t think Cathy has much to worry about.\"\n \"Why should I be worried?\" the girl barks, looking up from her game.\n \"You\u0027ve been queen bee round these parts,\" Rage says. \"You know that all the boys fancy you, since they\u0027ve no one else to lust after. Nobody would want to lose that sort of a following. And I don\u0027t think you will. No offense, Becky.\"\n \"Get stuffed,\" I snarl.\n Rage cocks his head. \"Are you a tough girl?\" he whispers. \"You are, aren\u0027t you? A fighter, yeah?\"\n \"Wind me up and find out,\" I challenge him, fingers curling by my sides.\n Rage glances at my fingers, then studies my eyes. \"Looks like I was wrong. You are one of us.\"\n \"We accept you, gooble gobble,\" Tiberius chuckles from beside the pool table.\n \"What the hell does that mean?\" I growl.\n \"Pay no attention to him,\" Gokhan laughs. \"He\u0027s always coming out with weird crap like that.\"\n \"It\u0027s from Freaks,\" Tiberius says. \"That old movie about circus freaks.\" He looks around for support. \"Some of you must have seen it.\"\n \"Was it black-and-white?\" Cathy asks.\n \"Yeah. It was made in the 1930s.\"\n \"Then of course we haven\u0027t seen it,\" she snorts. \"We don\u0027t all waste our time on boring old movies.\"\n \"Freaks, boring?\" Tiberius roars. \"It\u0027s an amazing film. They used real-life freaks. It gave me nightmares the first time my dad showed it to me.\"\n \"They\u0027d probably have found a role for you in it if you\u0027d been alive back then,\" Cathy says frostily.\n Tiberius glares at her, then turns to me. \"Anyway, at one point a normal woman marries one of the freaks and they have a big party to welcome her into the family. They all start chanting, We accept you, gooble-gobble. They mean it nicely, but what they\u0027re really saying is that she\u0027s one of them now, a freak, an outcast, a child of the damned.\"\n Tiberius bends over the pool table to take a shot, then says again, but glumly this time, as if he feels sorry for me, \"We accept you, gooble-gobble.\" \n","sourceLink":"https://allnovel.net/zom-b-underground-zom-b-2/page-8.html","bookId":2451,"book":{"id":2451,"title":"Zom-B Underground (Zom-B #2)","description":"Storyline: \n Zom-B Underground (Zom-B #2) \n Waking up in a military complex, months after zombies attacked school, B has no memory of the last few months. Life in the UK has turned tough since the outbreak, and B is woven into life- and battle- in the new military regime quickly. But as B learns more about the zombies held in the complex and the scientists keeping them captive, unease settles in. Why exactly was B saved? And is there anyone left in the world to trust?\n \n","cover":"https://allnovel.net/images/zom-b-underground-zom-b-2.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/zom-b-underground-zom-b-2.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:23:47 PM"}}
