{"id":73836,"no":24,"title":"Page 24","content":"Chapter Twenty-Three\n EVA\n Cage had to work extra hard to catch up on the work he didn’t get done the past two days. Between me begging him for sex and him happily obliging and our picking a tree and decorating it, he’d had very little free time.\n Jeremy was coming back today. He’d texted Cage last night to tell him that he’d be here late, but he’d be here. Cage had mentioned we needed to hire someone else and let Jeremy go. I agreed. He shouldn’t have to continue working here. Not if he wanted to do other things.\n It was just after nine when Jeremy’s truck came rolling over the hill and across the field. He was a good man. Daddy was right about that. I loved him and I wanted him to find happiness. I wanted him to fall in love with a girl who couldn’t imagine life without him. It would happen. I knew it would.\n He wasn’t Josh, but he looked just like him, and Josh had been beautiful. Jeremy was just as special. His truck stopped, and he stepped out then headed toward where I stood under the magnolia tree beside the porch.\n “From the smile on your face, I think I stayed gone long enough for you two to fix things,” he said as he put his hat on his head.\n “Yes. Thank you. For everything. Thank you.”\n Jeremy grinned and then turned his head to spit out that nasty tobacco I wish he’d stop dipping. “You’re welcome. For everything,” he replied. “I figure Cage York ain’t gonna let you get too far out of his reach again. I hope you get everything in life you want, Eva. You deserve it.”\n “You too, Jeremy. You too.”\n He straightened his hat and looked out at the barn. “I’d hug you, but I gotta go work with your man today, and he’s watching me right now like he might need to come up here and beat my ass at any second.”\n I glanced back and, sure enough ,Cage was standing beside his truck with his hands on his hips and his hat pushed back off his forehead, a piece of straw sticking out of his mouth. He looked like a television ad for sexy cowboys. I blew him a kiss and laughed.\n He shook his head and grinned before shooting Jeremy one more pointed look. Then he turned and walked over to the barn door. “Don’t see a ring on your finger. Thought I’d see one of those when I got back.”\n I glanced down at my hand. I hadn’t expected Cage to purpose to me. “Why would you think that?”\n “Oh, I don’t know, maybe because you’re pregnant with his baby,” Jeremy shot back.\n Cage wasn’t like that. He hadn’t grown up thinking the way Jeremy and I had been taught. I wanted to believe one day Cage would ask me to marry him, but after the way I’d treated him and hadn’t trusted him, I doubted he would be trusting me with something that big for a while. I was okay with that. I understood.\n “I just took another man’s ring off a few days ago, Jer. I don’t think he’s ready to stick his on there. He looks tough and he acts like a badass, but he is fragile. He expects people to leave him. He also doesn’t trust that I won’t leave him again. I have a lot of proving to do before Cage trusts me with something like forever.”\n Jeremy frowned. “Really? You’re now taking the blame for all this? How the hell did that happen?”\n Jeremy wouldn’t understand. No one had seen Cage with his guard completely down. I’d only seen it a few times myself. “I can’t blame him for his insecurities. His momma screwed him up emotionally. I knew that, and I didn’t stop feeling sorry for myself long enough to think about that.”\n Jeremy shook his head, but he didn’t say anything else about it.\n “I’m gonna help him find a replacement. Then I’m hitting the road.”\n “Where are you going? I thought you didn’t want to go to school, that you wanted to stay here on the land?”\n He nodded. “I did. I’ll be back. But right now I want to just ride. Go see other places. Not settle down anywhere, just find myself.”\n I wasn’t sure what to say. I wanted him to be happy, but I didn’t want to be the reason he was leaving.\n “Let me go help him before he decides to come get me,” he said with a wink, then headed down to the barn.\n He seemed happy. This was what he wanted to do. Maybe he’d find that girl to make him complete out there on the road. Once he opened the barn door, I turned and headed back inside.\n CAGE\n Jeremy walked into the barn, looking pissed. “Why don’t she have a ring on her finger, York?”\n I grabbed my work gloves from the bench I’d left them on earlier. “I’m working on that. Not that it’s your damn business.”\n The tension went out of his shoulders and he nodded. “Oh. Good. She don’t seem to think you are. She thinks you can’t trust her or some stupid shit. I wasn’t following her. I just knew it was dumb.”\n Couldn’t trust her? What the hell was the woman thinking now?\n “I just need one thing from you. I need to know where her piano went.”\n Jeremy grinned. “Why?”\n “I just need it. Where is it?”\n “I could not tell you for being an ass.”\n “And I could beat your ass,” I replied.\n Jeremy laughed. “Fine. It’s in my basement. Eva thinks she donated it to a kid’s center for underprivileged children. When actually, Wilson bought them a piano for that center and he had Eva’s piano moved to my basement.”\n I knew she’d gotten rid of it. I had expected it to be harder to find. “Why did he do that?”\n “Because he’s her daddy and he knew she would want it back one day. Just like he knew you’d be back.”\n My chest tightened. Her dad hadn’t doubted me. He should’ve hated me, but he had believed in us. Even when I didn’t. Damn.\n “What are you gonna do with her piano?” he asked.\n “Keep it safe. I’ll let you know when I need it. Don’t tell her about this though.”\n “How long is this gonna take? I was planning on hitting the road in about two weeks. I’m staying through Christmas, then I’m going to travel for a while.”\n “Christmas Eve. Give me til Christmas Eve.”\n The barn doors swung open and slammed against the wall. We both jumped and looked at Eva standing there with a smile on her face and red cheeks. She was breathing hard like she’d been running. I took a step toward her.\n “Low’s in labor!” she squealed. “We gotta go. Hurry!” She waved at me and turned to run back to the house.\n Low was in labor. Holy shit.\n “I got things here. Get her to the hospital before she blows a gasket,” Jeremy said from behind me.\n I managed to nod and followed behind Eva as she ran toward the house. Low was about to me a mother. I had known this was going to happen, but at the moment it was surreal.\n My phone vibrated in my pocket and I pulled it out to see Preston’s name on the screen.\n “Hello.”\n “Marcus just took Low to the hospital. Her water broke.”\n “When’s the baby due? Is it early?” I asked, thinking it was probably dumb to be asking Preston Drake something like this.\n “Her due date was Monday. So she’s right on time.”\n He knew. Surprise.\n “We’re on our way.”\n Preston paused. “We?” he asked.\n “Eva and me,” I replied, realizing he didn’t know we were back together.\n “Congrats, man. I didn’t know you’d worked things out.”\n “Thanks. I’ll see you in a few,” I replied before ending the call and shoving my phone into my pocket. Eva was standing at the passenger side of her Jeep.\n “Hurry!” she said, bouncing on the balls of her feet.\n I jogged the rest of the way, but I didn’t go to the driver’s side and get in. Instead I went to Eva and picked her up then covered her mouth with mine. She melted into me like she always did, and I enjoyed knowing I had my always back.\n She broke the kiss first. “As much as I like your kisses, ’cause I do—they’re really hot—I want to get to the hospital. Your best friend is about to have a baby. We need to be there for that.”\n I pressed one more kiss to her mouth before putting her down and then patting her on the bottom. “Let’s hope the new Hardy looks like its momma and not its daddy,” I said, then opened her door and helped her inside. \n","sourceLink":"https://allnovel.net/sometimes-it-lasts-sea-breeze-5/page-24.html","bookId":1989,"book":{"id":1989,"title":"Sometimes It Lasts (Sea Breeze #5)","description":"Storyline: \n Sometimes It Lasts (Sea Breeze #5) \n Cage York has to choose between a love of the game and a love of the girl in this sultry Sea Breeze novel from New York Times bestselling author Abbi Glines. \n After waiting for his big break, bad boy Cage York is finally called up to prove his worth in the college baseball arena. But when Cage’s girlfriend, Eva, mourns the sudden loss of her father, it’s not Cage’s comforting arms she runs to, but those of her former fiancé’s twin brother, Jeremy. \n Torn between his baseball dream and the girl of his dreams, Cage must prove he’s worthy of Eva’s love, or risk losing her to Jeremy forever.\n \n","cover":"https://allnovel.net/images/sometimes-it-lasts-sea-breeze-5.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sometimes-it-lasts-sea-breeze-5.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:28:49 AM"}}
