{"id":73819,"no":7,"title":"Page 7","content":"Chapter Six EVA The single bed in the corner of Cage’s old room in the barn didn’t have sheets on it. No one was sleeping there now. Daddy hadn’t sent Cage back to the barn this week. He had let him sleep in the guest bedroom. Cage closed the door and locked it as I turned on the small window unit to cool the room down. Turning back around I was mesmerized at his beautiful body as he pulled his shirt over his head and tossed it on the ground while he closed the distance between us. Cage wasn’t talking like he normally did. There was a desperate look in his eyes that broke my heart. I wanted to ease his fears. He didn’t trust our being apart. I would prove to him that we would be okay. In time. I unbuttoned my shirt and let it fall to the floor with his. He reached around me and unsnapped my bra with ease that used to bother me. I was over his past experience now. I knew he was mine. I wasn’t insecure when it came to where I stood with Cage sexually. I was all he wanted. That was enough. His hands moved to my waist and he unbuttoned my shorts then pushed them down along with my panties until I had to step out of them. “Lie down,” he said in a husky whisper. I did as he said but kept my eyes on him as he took his jeans off. His wide chest and narrow waist and hips were perfectly sculpted. He was perfect. A man shouldn’t be so perfect. But mine was. I let my eyes roam over his muscular thighs and then the part of him that always brought me pleasure. Glancing up at his face I caught him smirking. He liked it when I looked at his body. I grinned back at him and he came over me. “I need to love you tonight. I may need to love you all night,” he said as his hips moved between my legs. Before I could respond his mouth was on mine. His tongue did those magical things that I could feel all over my body with just a simple flick. I held him close to me and kissed him back with every emotion I had in me. His lips moved down my neck as he whispered words against my skin. He loved me. He couldn’t live without me. I was his life. And I was putty under his hands. I whimpered as he took a nipple into his mouth and sucked then bit down gently before lapping at it to ease the sharp pain. I ran my hands down his back to cup his bottom in my hands. The taunt muscles flexed under my touch and he groaned. Then with one swift move he was inside me. I lifted my legs and wrapped them around his waist as he filled me. “I love you so damn much,” he whispered as he pulled back and slid back inside of me. All I could do was cry out from the pleasure. “This is home. You’re my home,” he said before pumping into me harder. I reached up and grabbed his face and kissed him hard. I was sending him away but I was going to miss him. I was going to need him and he wasn’t going to be here. I couldn’t tell him that. I couldn’t let him know that I was dying inside thinking of dealing with this without him. I wasn’t sure how I was going to survive without his arms around me. But if I said that just once he wouldn’t go. So all I could do was love him. I would love him as hard and long as he would let me. The dawn was coming through the window as I lay wrapped up in Cage’s arms on the small mattress. I hadn’t slept. He had fallen asleep after we had made love in the shower for the third time. That had been two hours ago. All I could do was watch him sleep. He would be leaving today. I wanted to enjoy having him hold me. Letting him walk away today was going to be hard. I couldn’t cry. If I did he would stay. I couldn’t say it was going to be hard or he would stay. I had to be strong. I had to pretend until he was gone. Then I could go to my room and fall apart. His dark hair was getting long. It had been a few months since he’d cut it. The natural curl that showed up when he let it get too long was sexy. He hated it but I loved it. His long dark eyelashes curled up against his cheeks. I smiled to myself thinking about the first day I laid eyes on him. I’d thought he was gorgeous. I’d also thought he was a loser. How wrong I’d been. Cage York had proved to be everything I wanted in life. I just hoped letting him go was the right thing to do. I was positive it was but there was that small fear that I could lose him. He was perfect. Women flocked to him. I wouldn’t be there on his arm. They’d come after him. I knew he loved me and I knew he’d never hurt me but still I worried. What if he accidentally met someone else and fell in love? What if missing me became too much? No. I couldn’t think like that. I couldn’t. I had to trust us. Trust him. My focus had to be on Daddy. I wanted to make as many memories with my daddy as I could. “Mine,” Cage mumbled in his sleep pulling me closer to him. Even in his sleep he knew what I needed. I kissed his chin and smiled. “Yes, I’m yours.” CAGE Eva walked out to my car with me. I couldn’t believe I was doing this. Leaving her. Fuck this felt wrong. But she’d woken me up and made love to me one more time this morning promising me that we’d be okay. That this was what she wanted what we needed. I’d packed up the few things I had here and I was going to go back to the apartment and get my other things before I headed north. How was I gonna sleep tonight without her? “Don’t make me do this,” I begged when we got to the car. “We have to. Remember, this is for us,” she said squeezing my hand. “Call Low if you need something. She’ll be here. She promised me she’d be by to check on you often. Marcus too. He said anything you need to call them.” I had called Low this morning while Eva took her shower. She’d talked me off a ledge because I was really close to breaking down. Low had heard the anxiety in my voice and walked me through why this was what we had to do. She’d agreed with Eva. “I know. I’ll call them. I promise,” she assured me. I knew she had Jeremy but I needed to know she had Low too. I trusted Marcus and Low to protect her. To take care of her if she needed something. Jeremy I wasn’t so sure about. He’d wanted to ditch her before. “You call me too. I’ll be back. I’ll jump on a plane. I swear I will. It’s a forty minute flight.” “I know,” she said, hugging me to her. “I love you so much. Please drive careful. Call me when you get there. I will want to hear all about it. Everything.” We were gonna do all this together. The idea of doing it without her was fucking with my head. “I’ll call you so damn much you’re gonna think you were there.” She laughed and looked up at me. “Good.” I gazed down into her blue eyes and drank her in. Those pretty blue eyes had sunk me the first time I looked into them. We’d made it through so much already. We were stronger than we had been ten months ago. Our relationship was secure. We were secure in each other. My fears were pointless. We would be okay. “I could leave tomorrow,” I said hoping she’d give me one more night in her arms. “We’d only think about your leaving all day today. It would make things even harder. You have to get in that car and drive.” I cupped her face in both my hands then bent down to kiss her sweet mouth one more time. She grabbed my arms and held on tight while our tongues tangled desperately. Pulling back I pressed a kiss to each of her cheek bones then her nose. “I’ll be back a week from Saturday.” Because I couldn’t stay gone longer than two weeks. “You can’t come back that soon. You need more time to get things settled there.” “Don’t push it beautiful. You want me to go, I’m going. But I’ll be damned if I stay away longer than necessary.” She laughed and nodded. “Okay. I’ll see you in thirteen days then.” That helped some. Thirteen days. I could do thirteen days. “Go, Cage,” Eva said backing away and pushing me gently toward the card door. I took a deep breath and got into the car before I could grab her again. “I love you! Be careful!” she called out as I started to close the door. “I love you more. And you be careful,” I replied. She backed away and I closed the door. This was it. I was leaving her. She waved and smiled at me. Damn I didn’t want to go. I forced the car into reverse and blew her one last kiss before I drove away from that white farmhouse that held my world.","sourceLink":"https://allnovel.net/sometimes-it-lasts-sea-breeze-5/page-7.html","bookId":1989,"book":{"id":1989,"title":"Sometimes It Lasts (Sea Breeze #5)","description":"Storyline: Sometimes It Lasts (Sea Breeze #5) Cage York has to choose between a love of the game and a love of the girl in this sultry Sea Breeze novel from New York Times bestselling author Abbi Glines. After waiting for his big break, bad boy Cage York is finally called up to prove his worth in the college baseball arena. But when Cage’s girlfriend, Eva, mourns the sudden loss of her father, it’s not Cage’s comforting arms she runs to, but those of her former fiancé’s twin brother, Jeremy. Torn between his baseball dream and the girl of his dreams, Cage must prove he’s worthy of Eva’s love, or risk losing her to Jeremy forever.","cover":"https://allnovel.net/images/sometimes-it-lasts-sea-breeze-5.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sometimes-it-lasts-sea-breeze-5.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:28:49 AM"}}
