{"id":14972,"no":15,"title":"January 15","content":"\"And the Lord appeared unto Isaac the same night.\"(Gen. 26:24) \\n\\n \\n\\n \"Appeared the same night,\" the night on which he went to Beer-sheba. Do you think this revelation was an accident? Do you think the time of it was an accident? Do you think it could have happened on any other night as well as this? If so, you are grievously mistaken. Why did it come to Isaac in the night on which he reached Beer-sheba? Because that was the night on which he reached rest. In his old locality, he had been tormented. There had been a whole series of petty quarrels about the possession of paltry wells. There are no worries like little worries, particularly if there is an accumulation of them. Isaac felt this. Even after the strife was past, the place retained a disagreeable association. He determined to leave. He sought change of scene. He pitched his tent away from the place of former strife. That very night the revelation came. God spoke when there was no inward storm. He could not speak when the mind was fretted; His voice demands the silence of the soul. Only in the hush of the spirit could Isaac hear the garments of his God sweep by. His still night was his starry night. \\n\\n \\n\\n My soul, hast thou pondered these words, \"Be still, and know\"? In the hour of perturbation, thou canst not hear the answer to thy prayers. How often has the answer seemed to come long after ! The heart got no response in the moment of its crying ━ in its thunder, its earthquake, and its fire. But when the crying ceased, when the stillness fell, when thy hand desisted from knocking on the iron gate, when the interest of other lives broke the tragedy of thine own, then appeared the long-delayed reply. Thou must rest, O soul, if thou wouldst have thy heart\u0027s desire. Still the beating of thy pulse of personal care. Hide thy tempest of individual trouble behind the altar of a common tribulation and, that same night, the Lord shall appear to thee. The rainbow shall span the place of the subsiding flood, and in thy stillness thou shalt hear the everlasting music. ━George Matheson \\n\\n \\n\\n Tread in solitude thy pathway, \\n\\n \\n\\n Quiet heart and undismayed. \\n\\n \\n\\n Thou shalt know things strange, mysterious, \\n\\n \\n\\n Which to thee no voice has said. \\n\\n \\n\\n While the crowd of petty hustlers \\n\\n \\n\\n Grasps at vain and paltry things, \\n\\n \\n\\n Thou wilt see a great world rising \\n\\n \\n\\n Where soft mystic music rings. \\n\\n \\n\\n Leave the dusty road to others, \\n\\n \\n\\n Spotless keep thy soul and bright, \\n\\n \\n\\n As the radiant ocean\u0027s surface \\n\\n \\n\\n When the sun is taking flight. \\n\\n \\n\\n ━(From the German of V. Schoffel) H. F. \\n\\n \\n\\n 　 “But may the God of all grace, who called us to His eternal glory by Christ Jesus, after you have suffered a while, perfect, establish, strengthen, and settle you.” \\n\\n \\n\\n (1 Pet.5:10) \\n\\n \\n\\n 　 \\n\\n \\n\\n 一月十五日 \\n\\n \\n\\n “当夜耶和华向他显现” （创二十六：24） \\n\\n \\n\\n 　　艾萨克上别示巴去，当夜耶和华向他显现。你想这个显现是偶然的么？你想“当夜”也是碰巧的么？你想神尽可以在别一夜显现么？如果你这样想，你是绝对错误了。为甚么神在艾萨克到别示巴的那一夜向他显现呢？因为那一夜艾萨克进入了安息。在原有之地，他为了几口井起了几次的争闹，他的心顶纷乱，顶痛苦。虽然争闹过去了，可是难保那地的居民以后无事。他觉悟了，决意离开那争闹之地，上别示巴去，另换一个环境。那里他把所有的争闹抛卸了，他得了安息。当夜耶和华向他显现。神的启示只临到灵里没有风波的人。艾萨克在灵的安息里听见神的话语。那安静的夜也就是多星的夜。 \\n\\n \\n\\n 　　我的心哪，你可记得“你们要镇静，并要知道…”（诗四六：10）。你心里纷乱的时候，你不能听见神给你的祷告的答应。多少时候，我们祷告了许久，可是还没有得到神的答应，都因为内心有雷轰，地震，风波，炸裂。可是当你的心静下来，进入了安息，神的答应就来了。哦，我的心哪，你必须安息，不要为了争闹，纷乱，罣虑…而跳得紧张了。那么，当夜耶和华会向你显现。洪水退落的时候，发见了虹霓；照样，当你镇静的时候，也会听见神的声音。 ━马得胜 \\n\\n \\n\\n 在孤寂中走你的路， \\n\\n \\n\\n 心平气和，无惧无虑， \\n\\n \\n\\n 你会领略神的奇迹， \\n\\n \\n\\n 决非语言所能倾诉。 \\n\\n \\n\\n 那群市井小人， \\n\\n \\n\\n 锱铢计较，而结果一切流于空妄， \\n\\n \\n\\n 你眼前却浮现出天国的美景， \\n\\n \\n\\n 玄妙的音乐，正在那里回荡。 \\n\\n \\n\\n 让别人去走污浊的道路， \\n\\n \\n\\n 保持你灵魂的纯洁光明， \\n\\n \\n\\n 正当海面太阳的飞升， \\n\\n \\n\\n 反射出天水一色，辉耀晶莹。 \\n\\n \\n\\n 　 “那赐诸般恩典的神，曾在基督里召你们，得享他永远的荣耀，等你们暂受苦难之后，必要亲自成全你们，坚固你们，赐力量给你们。”（彼前五：10） \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/92/4836.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
