{"id":15131,"no":174,"title":"June 23","content":"\"When Peter was come down out of the ship, he walked on the water, to go to Jesus. But when he saw the wind boisterous, he was afraid; and beginning to sink, he cried, saying, Lord, save me.\" (Matt. 14:29, 30)\n Peter had a little faith in the midst of his doubts, says Bunyan; and so with crying and coming he was brought to Christ.\n But here you see that sight was a hindrance; the waves were none of his business when once he had set out; all Peter had any concern with, was the pathway of light that came gleaming across the darkness from where Christ stood. If it was tenfold Egypt beyond that, Peter had no call to look and see.\n When the Lord shall call to you over the waters, \"Come,\" step gladly forth. Look not for a moment away from Him.\n Not by measuring the waves can you prevail; not by gauging the wind will you grow strong; to scan the danger may be to fall before it; to pause at the difficulties, is to have them break above your head. Lift up your eyes unto the hills, and go forward--there is no other way.\n \"Dost thou fear to launch away?\n Faith lets go to swim!\n Never will He let thee go;\n \u0027Tis by trusting thou shalt know\n Fellowship with Him.\"\n 　 　 六月二十三日\n “耶稣说，你来罢。彼得就从船上下去，在水面上走，要到耶稣那里去；只因见风甚大，就害怕；将要沉下去，便喊着说，主啊，救我”（太十四：29/30）。\n 　　读者，你看见吗？彼得的小信是一个极大的障碍：他既然已经开步走了，波浪的大小，无须他去操心；他所当注意的，乃是从主所在的地方射过来的那道光彩。光彩以外，纵有十个埃及，彼得也无须去注意。\n 　　读者，当主在水面上叫你：“来罢”的时候，欢欢喜喜地向前走去！不要转过你的眼去注视别的东西！\n 　　因为你不能因着测度波浪得到胜利；也不能因着测量风力得到坚固。越去注意危险，越会坠入危险；越是见难而止，越会遭遇苦难。读者，你应当举起你的两眼来专心仰望主，大着胆向前走去！——选\n 你是否畏惧出海远航？\n 信心会使你安渡重洋。\n 神不让你沉沦海底，\n 凭了信心主常在身旁。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/5177.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
