{"id":14978,"no":21,"title":"January 21","content":"一月二十一日 \n \n \"…saying that bonds and afflictions abide me. But none of these things move me…\" \n \n (Acts20:23-24) \n \n We read in the book of Samuel that the moment that David was crowned at Hebron, \"All the Philistines came up to seek David.\"(2 Sam5:17) And the moment we get anything from the Lord worth contending for, then the devil comes to seek us. \n \n When the enemy meets us at the threshold of any great work for God, let us accept it as \"a token of salvation,\" and claim double blessing, victory, and power. Power is developed by resistance. The cannon carries twice as far because the exploding power has to find its way through resistance. The way electricity is produced in the powerhouse yonder is by the sharp friction of the revolving wheels. And so we shall find some day that even Satan has been one of God\u0027s agencies of blessing. ━ Days of Heaven upon Earth \n \n A hero is not fed on sweets, \n \n Daily his own heart he eats; \n \n Chambers of the great are jails, \n \n And head winds right for royal sails. \n \n ━Emerson \n \n Tribulation is the way to triumph. The valley-way opens into the highway. Tribulation\u0027s imprint is on all great things. Crowns are cast in crucibles. Chains of character that wind about the feet of God are forged in earthly flames. No man is greatest victor till he has trodden the winepress of woe. With seams of anguish deep in His brow, the \"Man of Sorrows\" said, \"In the world ye shall have tribulation\" ━ but after this sob comes the psalm of promise, \"Be of good cheer, I have overcome the world.\"(Jn.16:33)The footprints are traceable everywhere. Bloodmarks stain the steps that lead to thrones. Sears are the price of scepters. Our crowns will be wrested from the giants we conquer. Grief has always been the lot of greatness. It is an open secret. \n \n \"The mark of rank in nature. \n \n Is capacity for pain; \n \n And the anguish of the singer \n \n Makes the sweetest of the strain.\" \n \n Tribulation has always marked the trail of the true reformer. It is the story of Paul, Luther, Savonarola, Knox, Wesley, and all the rest of the mighty army. “…These are they who have come out of the great tribulation….”(Rev.7:14) \n \n Every great book has been written with the author\u0027s blood. \"These are they that have come out of great tribulation.\" Who was the peerless poet of the Greeks? Homer. But that illustrious singer was blind. Who wrote the fadeless dream of \"Pilgrim\u0027s Progress\"? A prince in royal purple upon a couch of ease? Nay! The trailing splendor of that vision gilded the dingy walls of old Bedford jail while John Bunyan, a princely prisoner, a glorious genius, made a faithful transcript of the scene. \n \n Great is the facile conqueror; \n \n Yet haply, he, who, wounded sore, \n \n Breathless, all covered o\u0027er with blood and sweat, \n \n Sinks fainting, but fighting evermore━ \n \n Is greater yet. \n \n \n \n ━Selected　 \n \n “…有捆锁与患难等待我。我却不以性命为念…”（徒二十：23-24） \n \n 　　我们在塞缪尔记里面看见：当戴维在希伯仑受膏作王的时候，“非利士众人就上来寻索戴维”（撒下五：17）。照样，我们在神前受宠蒙爱的时候，仇敌撒但顶不甘心，就上来寻索我们，前来拦阻我们，和我们捣乱。 \n \n 　　仇敌的攻击，破坏，和拦阻，我们应当看为神施行拯救的记号；这时候，就是我们向神支取加倍的祝福，胜利，和能力的机会。能力常是从拦阻中产生的。电力的产生，就是由于发电机的机轮互相摩擦（拦阻）。将来有一天我们会明白撒但也是被神利用的。━译自地上的属天生活 \n \n 甘脂不是英雄的粮食， \n \n 他以悲哀充填心胸； \n \n 监狱是伟人的第宅， \n \n 顶帆最适宜于挡逆风。 \n \n ━埃默森 \n \n 　　患难是胜利的快捷方式。山路之后，就是大路。一切伟大的事业上面，都有患难的印迹的。发光的金炼，必须经过炉火的烧和锤。没有一个人配算为得胜者，除非他经历苦楚。额上有刺痕的忧患之子，说：“在世上你们有苦难”━可是在这伤心的一句之后，就来了一句应许，“但你们可以放心，我已经胜了世界”（约十六：33）。主在世上留下的脚踪，原是叫我们跟随祂的。那带血的脚步，是引领我们上宝座的。伤斑是铁杖的代价。我们的冠冕必须花力争夺的。这些都是公开的秘密。 \n \n 造化的标准，以耐苦为度量。 \n \n 确定人格高低。 \n \n 最美的声乐，出于歌者的。 \n \n 回肠荡气，哀惋悲凄。 \n \n 　　先圣都曾经过许多患难━保罗，马丁路得，撒房那罗拉，拿克司，韦斯利以及一切大能的先锋。他们都从患难进入掌权的地位。将来环绕在宝座前唱诗赞美的人们，他们都是“…从大患难中出来的…”（启七：14） \n \n 　　每一本伟大的著作都是作者血的结晶。谁是希腊的大诗人？鸿谟。他是一个盲人。谁是写那部不朽之作“天路历程”的？是一个穿紫袍，享受安乐的王子吗？不是！乃是培德福牢狱中的一个囚犯本仁约翰。 \n \n 伟大的战士，矫健如游龙。 \n \n 意外地受了创伤， \n \n 混身血汗，屏息再向敌人进攻， \n \n 到力竭倒地，还不肯收敛刀锋。 \n \n 伟大，伟大，浩气贯苍穹。 \n \n ━选 \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/4842.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
