{"id":15169,"no":212,"title":"July 31","content":"\"He guided them by the skillfulness of his hands.\"(Psa. 78:72.) WHEN you are doubtful as to your course, submit your judgment absolutely to the Spirit of God, and ask Him to shut against you every door but the right one...Meanwhile keep on as you are, and consider the absence of indication to be the indication of God\u0027s will that you are on His track...As you go down the long corridor, you will find that He has preceded you, and locked many doors which you would fain have entered; but be sure that beyond these there is one which He has left unlocked. Open it and enter, and you will find yourself face to face with a bend of the river of opportunity, broader and deeper than anything you had dared to imagine in your sunniest dreams. Launch forth upon it; it conducts to the open sea. God guides us, often by circumstances. At one moment the way may seem utterly blocked; and then shortly afterward some trivial incident occurs, which might not seem much to others, but which to the keen eye of faith speaks volumes. Sometimes these things are repeated in various ways, in answer to prayer. They are not haphazard results of chance, but the opening up of circumstances in the direction in which we would walk. And they begin to multiply as we advance toward our goal, just as the lights do as we near a populous town, when darting through the land by night express. --- F. B. Meyer. If you go to Him to be guided, He will guide you; but He will not comfort your distrust or half-trust of Him by showing you the chart of all His purposed concerning you. He will show you only into a way where, if you go cheerfully and trustfully forward, He will show you on still farther. --- Horace Bushnell. As moves my fragile bark across the storm-swept sea.Great waves beat o\u0027er her side, as north wind blows; Deep in the darkness hid lie threat\u0027ning rocks and shoals; But all of these, and more, my Pilot knows. Sometimes when dark the night, and every light gone out,I wonder to what port my frail ship goes; Still though the night be long, and restless all my hours, My distant good, I\u0027m sure, my Pilot knows.─Thomas Curtis Clark. 七月三十一日 「祂...用手中的巧妙，引导他们。」（诗篇七十八:72） 　　当你前面的道路不明显的时候，你就应当将你的判断力完全让位给圣灵，求祂为你封锁每一扇别的门户━只剩下那扇合宜的。同时，你应当继续站在你原来的地位上不动，如果你没有得到清楚的指示，就当把你所在的路径算为神的旨意....当你在长廊上行走的时候， 你就要看见神行在你的前面，封锁了许多你愿意进去的门户；但是你必须记得：在这些门户以外，还有一扇，是祂为你的缘故留着不锁的。打开来，走进去，在那里你要面对面看见一道充满机会的河流━比你在最欢乐的梦中所想象的更阔、更深；并且是直通大海的。 　　神常常藉环境引导我们。有时候，前面的道路似乎完全塞住了；但是隔不多久，一件平凡的事情发生了。这件事情，对于别人，也许算不了一回事；但是对于信心敏锐的眼睛，却能示意不少。有时候，这样的事情，竟会翻覆遇到好几次。这并不是偶然的事，乃是神在为我们敞开一条当走的路径来。我们越往前走，所得到的指导也越多；正如坐在一部飞快的夜快车上：火车越近城市，我们所看见的灯光也越多。── 梅尔 　　如果你到神那里去求祂引导，祂必引导你。但是祂决不会因为要安慰你对祂的不信或半信，便将那张图表━祂在你身上的旨意━拿出来给你看的。祂只指导你一条路，如果你高高兴兴，相相信信地往前行去，祂就要再指导你前面的路径。── 蒲秀纳尔）","sourceLink":"http://novel.tingroom.com/jingdian/92/5282.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
