{"id":15176,"no":219,"title":"August 7","content":"\"And when they had prayed, the place was shaken where they were assembled together, and they were all filled with the Holy Ghost and they spake the word of God with boldness. And with great power gave the apostles witness of the resurrection\" (Acts 4:31, 33). \n Christmas Evans tells us in his diary that one Sunday afternoon he was traveling a very lonely road to attend an appointment, and he was convicted of a cold heart. He says, \"I tethered my horse and went to a sequestered spot, where I walked to and fro in an agony as I reviewed my life. I waited three hours before God, broken with sorrow, until there broke over me a sweet sense of His forgiving love. I received from God a new baptism of the Holy Ghost. As the sun was westering, I went back to the road, found my horse, mounted it and went to my appointment. On the following day I preached with such new power to a vast concourse of people gathered on the hillside, that a revival broke out that day and spread through all Wales.\" \n The greatest question that can be asked of the \"twice born\" ones is, \"Have ye received the Holy Ghost since ye believed?\" This was the password into the early Church.\n \"0 the Spirit-filled life; is it thine, is it thine?\n Is thy soul wholly filled with the Spirit Divine?\n O thou child of the King, has He fallen on thee?\n Does He reign in thy soul, so that all men may see\n The dear Savior\u0027s blest image reflected in thee?”\n \"Has He swept through thy soul like the waves of the sea?\n Does the Spirit of God daily rest upon thee?\n Does He sweeten thy life, does He keep thee from care?\n Does He guide thee and bless thee in answer to prayer?\n Is it joy to be led of the Lord anywhere?”\n \"Is He near thee each hour, does He stand at thy side?\n Does He gird thee with strength, has He come to abide?\n Does He give thee to know that all things may be done\n Through the grace and the power of the Crucified One.2\n Does He witness to thee of the glorified Son ?”\n \"Has He purged thee of dross with the fire from above?\n Is He first in thy thoughts, has He all of thy love ?\n Is His service thy choice, and is sacrifice sweet?\n Is the doing His will both thy drink and thy meat?\n Dost thou run at His bidding with glad eager feet?”\n \"Has He freed thee from self and from all of thy greed?\n Dost thou hasten to succor thy brother in need?\n As ct soldier of Christ dost thou hardness endure ?\n Is thy hope in the Lord everlasting and sure?\n Hast thou patience and meekness, art tender and pure?”\n 0 the Spirit-filled life may be thine, may be thine,\n In thy soul evermore the Shekinah may shine;\n It is thine to live with the tempests all stilled,\n It 2\u0027s thine with the blessed Holy Ghost to be filled;\n It is thine, even thine, for thy Lord has so willed.”\n 八月七日\n 「祷告完了，聚会的地方震动。他们就都被圣灵充满，放胆讲论神的道。….使徒大有能力，见证主耶稣复活。」（徒四31-33）\n 　伊文思在他的日记中告诉我们：一天下午，他行经一条很荒僻的道路去出席一个聚会，他自己觉得他那时候的心是冰冷冷的。他说：「我系住了我的马，步行到一处与尘世隔绝的地方去，在那里我很痛苦地走来走去，检阅我自己的生活。我在神前等候了三小时，我的心被悲哀压服着；最后，一个甘甜仁慈的爱的感觉温暖了我的心━在那里我重新受了一次圣灵的浇灌。日头平西的时候，我回到原路上，找到了我的马，向前骑去。次日，我在山坡上对一大群听众讲道，觉得自己充满了新的能力，以致全韦尔斯城的人民，在那天都得到一个极大的复兴。」 \n 当你遇见一个重生的人，第一个问题你应当问他的就是：「你…信的时候受了圣灵没有？」这是进入早期教会的暗语。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/5303.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
