{"id":15177,"no":220,"title":"August 8","content":"\"Thou art my king, O God: Command deliverance (victories, margin) for Jacob\" (Ps. 44:4 RV).\\n\\n Here is no foe to your growth in grace, no enemy in your Christian work, which was not included in your Savior\u0027s conquests. \\n\\n You need not be afraid of them. When you touch them, they will flee before you. God has promised to deliver them up before you. Only be strong and very courageous! Fear not, nor be dismayed! The Lord is with you, O mighty men of valor--mighty because one with the Mightiest. Claim victory! \\n\\n Whenever your enemies close in upon you, claim victory! Whenever heart and flesh fail, look up and claim VICTORY! \\n\\n Be sure that you have a share in that triumph which Jesus won, not for Himself alone, but for us all; remember that you were in Him when He won it, and claim victory! \\n\\n Reckon that it is yours, and gather spoil. Neither the Anakim nor fenced cities need daunt or abash you. You are one of the conquering legion. Claim your share in the Savior\u0027s victory.\\n\\n --Joshua, by Meyer \\n\\n We are children of the King. In which way do we most honor our Divine Sovereign, by failing to claim our rights and even doubting whether they belong to us, or by asserting our privilege as children of the Royal Family and demanding the rights which belong to our heirship? \\n\\n 八月八日「神阿，祢是我的王。求祢出令，使雅各得胜。」（诗四十四4）\\n\\n 亲爱的读者，你应当知道：当你在恩典中长进的时候，你就会遭遇到许多仇敌；但是这些仇敌都是主的战利品。 \\n\\n 你用不着怕他们。你一碰他们，他们就会在你面前逃跑。神已经允许将他们交在你手里了。你应当刚强、勇敢！不要惧怕，也不要惊慌！神是与你同在的，大能的勇士阿──你是大能的，因为与你同在者是大能的。前去夺取胜利罢！ \\n\\n 甚么时候你的仇敌前来围困你，你应当夺取胜利！甚么时候你的肉体衰弱了，你还当仰望神来夺取胜利！ \\n\\n 你应当知道：在主耶稣里面，你有一份的，因为祂不是安替自己得胜，乃是替众信徒得胜；你要记得，当祂得胜的时候，你是在祂里面，所以在祂得胜的时候，你就已经得胜了。\\n\\n 你应当承认：胜利已经属于你了，起来收集战利品罢。不论亚衲人，不论坚固城，都不足以威吓你。你是一支战胜的军队。在主的胜利里面去夺取你的一份罢。──梅尔\\n\\n 我们是君王的孩子。我们怎样纔能加增我们至尊元首的荣誉呢？还是不敢索取我们的权利，甚至怀疑这些权利是否属于我们的呢；还是坚持我们皇室的特权，大胆前去索取我们承继的权利呢？\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/92/5304.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
