{"id":15210,"no":253,"title":"September 10","content":"\"The Lord will perfect that which concerneth me\" (Ps. 138:8). There is a Divine mystery in suffering, a strange and supernatural power in it, which has never been fathomed by the human reason. There never has been known great saintliness of soul which did not pass through great suffering. When the suffering soul reaches a calm sweet carelessness, when it can inwardly smile at its own suffering, and does not even ask God to deliver it from suffering, then it has wrought its blessed ministry; then patience has its perfect work; then the crucifixion begins to weave itself into a crown. It is in this state of the perfection of suffering that the Holy Spirit works many marvelous things in our souls. In such a condition, our whole being lies perfectly still under the hand of God; every faculty of the mind and will and heart are at last subdued; a quietness of eternity settles down into the whole being; the tongue grows still, and has but few words to say; it stops asking God questions; it stops crying, \"Why hast thou forsaken me?\" The imagination stops building air castles, or running off on foolish lines; the reason is tame and gentle; the choices are annihilated; it has no choice in anything but the purpose of God. The affections are weaned from all creatures and all things; it is so dead that nothing can hurt it, nothing can offend it, nothing can hinder it, nothing can get in its way; for, let the circumstances be what they may, it seeks only for God and His will, and it feels assured that God is making everything in the universe, good or bad, past or present, work together for its good. Oh, the blessedness of being absolutely conquered! of losing our own strength, and wisdom, and plans, and desires, and being where every atom of our nature is like placid Galilee under the omnipotent feet of our Jesus. --Soul Food The great thing is to suffer without being discouraged.–Fenelon “The heart that serves, and loves, and clings, Hears everywhere the rush of angel wings.” 九月十日 「耶和华必成全关乎我的事。」（诗一三八8） 苦难中间，有一种神秘、奇妙、超然的能力，绝不是人类理智所能了解的。凡没有经过大苦难的人，绝不会知道。一个受苦的人，若能得到镇静，窃笑他自己的苦难，而不再求神救他脱离苦难，他就有福了；那时候，十字要开始变成冠冕了。 在这个时候，圣灵要在他心里作许多奇妙的工。他的全人会完全安安静静地伏在神的手下；他的心思、意志和情感都会降服了；全人会感到一种非常的安宁；舌头也会变得静默，没有甚么要说的了；他也不再会问神许多无谓的问题了。 他的思想不再会建造空中楼阁，也不再会追逐无智的事物了；他的理智会变得柔顺温良了；他自己的选择会归于乌有━除了神的旨意以外，没有别的选择了。他对一切人物的爱情都会死灭净尽━死灭得没有一件东西能再伤害他，没有一件东西能再绊倒他，没有一件东西能再妨碍他，没有一件东西能再阻止他；因为，不论环境怎样，他所寻求的，只是神和神的旨意；他深信神在宇宙中所做的每一件事，无论是好是坏，是过去是现在，都是互相効力，叫他得益处的。 哦，这样绝对的得胜━失去我们自己的力量、智慧、计划、欲望，将属于天然的每一个微小的分子，都放在我们主耶稣全能的脚下━是多么有福阿！－－译自灵粮 受苦而不挫气，是一件伟大的事情。－－费内伦","sourceLink":"http://novel.tingroom.com/jingdian/92/5401.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
