{"id":15215,"no":258,"title":"September 15","content":"\"Blow upon my garden that the spices may flow out\" (S. of Sol. 4:16).\n Some of the spices mentioned in this chapter are quite suggestive. The aloe was a bitter spice, and it tells of the sweetness of bitter things, the bitter-sweet, which has its own fine application that only those can understand who have felt it. The myrrh was used to embalm the dead, and it tells of death to something. It is the sweetness which comes to the heart after it has died to its self-will and pride and sin. \n Oh, the inexpressible charm that hovers about some Christians simply because they bear upon the chastened countenance and mellow spirit the impress of the cross, the holy evidence of having died to something that was once proud and strong, but is now forever at the feet of Jesus. It is the heavenly charm of a broken spirit and a contrite heart, the music that springs from the minor key, the sweetness that comes from the touch of the frost upon the ripened fruit. \n And then the frankincense was a fragrance that came from the touch of the fire. It was the burning powder that rose in clouds of sweetness from the bosom of the flames. It tells of \n the heart whose sweetness has been called forth, perhaps by the flames of affliction, until the holy place of the soul is filled with clouds of praise and prayer. Beloved, are we giving out the spices, the perfumes, the sweet odors of the heart? --The Love-Life of Our Lord.\n A Persian fable says: One day\n A wanderer found a lump of clay\n So redolent of sweet perfume\n Its odors scented all the room.\n \u0027What are thou? was his quick demand,\n Art thou some gem from Samarcand,\n Or spikenard in this rude disguise,\n Or other costly merchandise?\u0027\n Nay: I am but a lump of clay.\n Then whence this wondrous perfume-say!\n \u0027Friend, if the secret / disclose,\n I have been dwelling with the rose. \u0027\n Sweet parable! and will not those\n \u0027Who love to dwell with Sharon\u0027s rose,\n Distil sweet odors all around,\n Though low and mean themselves are found?\n Dear Lord, abide with us that we\n May draw our perfume fresh from Thee.”\n 九月十五日\n 「吹在我的园内，使其中的香气发出来。」（歌四16）\n 雅歌第四章所说的几种香料都是含有深意的。沉香是一种苦味的香料，这是表明苦中有甜的意思。没药是用来保存尸身的，这是表明我们自己的刚愎、骄傲….等罪都当钉死；然后我们的心中纔会发出香气来。\n 哦，有几个基督人眞可爱，他们的脸上佩戴着十字架的印痕，一看就知到他们以前的骄傲和刚愎都已经与基督同钉十字架了，永远被丢在主的脚前了━这是属天的可爱。\n 乳香是一种必须经火然后纔会发出香气来香料。它的香气在猛烈的火焰中最为浓厚。这是表明我们的心被痛苦的火焰所扎的时候，会发出最浓厚的香气来，直到我们的心充满了赞美和祷告。亲爱的，我们有没有发出这样的香气来呢？－－译自主的爱情生活\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/5406.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
