{"id":15217,"no":260,"title":"September 17","content":"\"It is the Lord: let him do what seemeth him good\". (1 Sam. 3:18)\n See God in everything, and God will calm and color all that thou dost see!\" It may be that the circumstances of our sorrows will not be removed, their condition will remain unchanged; but if Christ, as Lord and Master of our life, is brought into our grief and gloom, \"HE will compass us about with songs of deliverance.\" (Psalm32:7) To see HIM, and to be sure that His wisdom cannot err, His power cannot fail, His love can never change; to know that even His direst dealings with us are for our deepest spiritual gain, is to be able to say, in the midst of bereavement, sorrow, pain, and loss, \"The Lord gave, and the Lord hath, taken away; blessed be the name of the Lord.\"(Job.1:21)\n Nothing else but seeing God in everything will make us loving and patient with those who annoy and trouble us. They will be to us then only instruments for accomplishing His tender and wise purposes toward us, and we shall even find ourselves at last inwardly thanking them for the blessings they bring us. Nothing else will completely put an end to all murmuring or rebelling thoughts.--H. W. Smith.\n “Give me a new idea,” I said,\n While musing on a sleepless bed;\n “A new idea that\u0027ll bring to earth\n A balm for souls of priceless worth;\n That\u0027ll give men thoughts of things above,\n And teach them how to serve and love,\n That\u0027ll banish every selfish thought,\n And rid men of the sins they’ve fought.”\n The new thought came, just how, I’ll tell:\n \u0027Twas when on bended knee I fell,\n And sought from HIM who knows full well\n The way our sorrow to expel.\n SEE GOD IN ALL THINGS, great and small,\n And give HIM praise whate\u0027er befall,\n In life or death, in pain or woe,\n See God, and overcome thy foe.\n I saw HIM in the morning light,\n HE made the day shine clear and bright;\n I saw HIM in the noontide hour,\n And gained from HIM refreshing shower.\n Al eventide, when worn and sad,\n HE gave me help, and made me glad.\n At midnight, when on tossing bed\n My weary soul to sleep HE led.\n I saw HIM when great losses came,\n And found HE loved me just the same.\n When heavy loads / had to bear,\n I found HE lightened every care.\n By sickness, sorrow, sore distress,\n HE calmed my mind and gave me rest.\n HE\u0027S filled my heart with gladsome praise\n Since I gave HIM the upward gaze.\n \u0027Twas new to me, yet old to some,\n This thought that to me has become\n A revelation of the way\n We all should /tie throughout the day;\n For as each day unfolds its light,\n We\u0027ll walk by faith and not by sight.\n Life will, indeed, a blessing bring,\n If we SEE GOD IN EVERYTHING.\"\n -A.E.Finn \n 九月十七日\n 「这是出于耶和华，愿祂凭自己的意旨而行。」\n 　如果我们在每一件事情上看见神，神就会在我们所看见的事情上替我们着上颜色。也许痛苦并没有挪去，环境并没有改变；但是如果我们生活的主━基督，在我们的忧愁痛苦之中，「祂必以得救的乐歌，四面环绕我。」（诗卅二7）如果我们眞看见祂，确信祂的智慧不能错误，祂的能力不能失败，祂的慈爱不能变更，祂最严厉的对付乃是我们灵程上最深的获益，我们就能在丧失、忧愁、痛苦、失败中，像乔布一样说：「赏赐的是耶和华，收取的也是耶和华。耶和华的名是应当称颂的。」（伯一21） \n 没有别的方法，只有在每一件事情上看见神，能叫我们爱那些伤害我们、烦扰我们的；能叫我们看见他们不过是神所利用的工具，来完成神慈爱、智慧的目的；能叫我们完全停止一切的怨言和判思。－－司密斯\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/5408.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
