{"id":15228,"no":271,"title":"September 28","content":"\"In me . . . peace\" (John 16:33)\n There is a vast difference between happiness and blessedness. Paul had imprisonments and pains, sacrifice and suffering up to the very limit; but in the midst of it all, he was blessed. All the beatitudes came into his heart and life in the midst of those very conditions. \n Paganini, the great violinist, came out before his audience one day and made the discovery just as they ended their applause that there was something wrong with his violin. He looked at it a second and then saw that it was not his famous and valuable one.\n He felt paralyzed for a moment, then turned to his audience and told them there had been some mistake and he did not have his own violin. He stepped back behind the curtain thinking that it was still where he had left it, but discovered that some one had stolen his and left that old second-hand one in its place. He remained back of the curtain a moment, then came out before his audience and said: \n \"Ladies and Gentlemen: I will show you that the music is not in the instrument, but in the soul.\" And he played as he had never played before; and out of that second-hand instrument, the music poured forth until the audience was enraptured with enthusiasm and the applause almost lifted the ceiling of the building, because the man had revealed to them that music was not in the machine but in his own soul. \n It is your mission, tested and tried one, to walk out on the stage of this world and reveal to all earth and Heaven that the music is not in conditions, not in the things, not in externals, but the music of life is in your own soul. --Selected \n If peace be in the heart,\n The wildest winter storm is full of solemn beauty,\n The midnight flash but shows the path of duty,\n Each living creature tells some new and joyous story,\n The very trees and stones all catch a ray of glory,\n If peace be in the heart.\n --Charles Francis Richardson\n 九月二十八日\n 「在我里面有平安。」（约十六33）\n 幸福和祝福是两件不同的东西。保罗虽受尽监禁、痛苦、损失、患难，但在这一切中间，他却得到了祝福。 \n 帕甘尼尼是一位善奏小提琴的大音乐家。一天，他出来站在听众面前，在采声之下，忽然发现他手中所提的小提琴有点不对。再仔细一看，发觉了他所提的，并不是他平日珍爱的那架贵重的提琴。\n 他发了会儿呆，然后不得不告诉他的听众，他拿错了他的琴。他退了下去，在幕后寻思他的琴到底留在甚么地方，不久就发觉曾有人把他的琴偷了去，换下一把破旧的留在原处。他懊丧了一回，仍然出来站在听众面前说：\n 「诸位男女来宾，今天我要证明给诸位看：音乐并不是在乐器里，乃是在人心里。」他就用心来奏，从那破旧的乐器里流出了悠扬悦耳的音乐来；听众个个得到奋激，采声差不多轰穿了屋顶。他果然向他们证实了音乐并不是在乐器里，乃是在他心里。 \n 受试炼的信徒阿，你今天的使命就是出来站在这世界的舞台上，向天上地下一切所有的证实说：人生的音乐并不是在环境里，并不是在事物里，并不是在外表里。乃是在你心里。－－选\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/5419.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
