{"id":15230,"no":273,"title":"September 30","content":"\"As an eagle stirreth up her nest, fluttereth over her young, spreadeth abroad her wings, taketh them, beareth them on her wings: so the Lord alone did lead him, and there was no strange God with him\" (Deut. 32:11, 12) Our Almighty Parent delights to conduct the tender nestlings of His care to the very edge of the precipice, and even to thrust them off into the steeps of air, that they may learn their possession of unrealized power of flight, to be forever a luxury; and if, in the attempt, they be exposed to unwonted peril, He is prepared to swoop beneath them, and to bear them upward on His mighty pinions. When God brings any of His children into a position of unparalleled difficulty, they may always count upon Him to deliver them. --The Song of Victory \"When God puts a burden upon you He puts His own arm underneath.\" There is a little plant, small and stunted, growing under the shade of a broad-spreading oak; and this little plant values the shade which covers it, and greatly does it esteem the quiet rest which its noble friend affords. But a blessing is designed for this little plant. Once upon a time there comes along the woodman, and with his sharp axe he fells the oak. The plant weeps and cries, \"My shelter is departed; every rough wind will blow upon me, and every storm will seek to uproot me!\" \"No, no,\" saith the angel of that flower; \"now will the sun get at thee; now will the shower fall on thee in more copious abundance than before; now thy stunted form shall spring up into loveliness, and thy flower, which could never have expanded itself to perfection shall now laugh in the sunshine, and men shall say, \u0027How greatly hath that plant increased! How glorious hath become its beauty, through the removal of that which was its shade and its delight!\u0027\" See you not, then, that God may take away your comforts and your privileges, to make you the better Christians? Why, the Lord always trains His soldiers, not by letting them lie on feather-beds, but by turning them out, and using them to forced marches and hard service. He makes them ford through streams, and swim through rivers, and climb mountains, and walk many a long march with heavy knapsacks of sorrow on their backs. This is the way in which He makes them soldiers--not by dressing them up in fine uniforms, to swagger at the barrack gates, and to be fine gentlemen in the eyes of the loungers in the park. God knows that soldiers are only to be made in battle; they are not to be grown in peaceful times. We may grow the stuff of which soldiers are made; but warriors are really educated by the smell of powder, in the midst of whizzing bullets and roaring cannonades, not in soft and peaceful times. Well, Christian, may not this account for it all? Is not thy Lord bringing out thy graces and making them grow? Is He not developing in you the qualities of the soldier by throwing you into the heat of battle, and should you not use every appliance to come off conqueror? --Spurgeon. 九月三十日 「又如鹰搅动巢窝，在雏鹰以上两翅搧展，接取雏鹰，背在两翼之上，这样，耶和华独自引导他，并无外邦神与他同在。」（申卅二11-12） 我们全能的父常喜欢将祂保护下的雏鹰引到绝壁顶上，推他们下去，好使他们知道自己有飞行的能力；倘使，他们遭到了危险，祂便立即猝然下降，把他们背在两翼之上。所以，信徒阿，神如果把我们放在一个非常困难的地位上，我们只要大胆依赖祂，因为我们深信祂的拯救就在旁边。－－译自胜利的凯歌 甚么时候神放一个重担在你上面，祂必放祂自己的膀臂在你下面。 有一株小花生，长在一棵高大的橡树荫下，这株小花非常尊重那庇护它的树荫，也非常宝贵它所享受的安静。 不久，来了一个樵夫，把橡树砍了去。小花非常伤心哭道：「啊，我的保护失去了；从此狂风会把我吹倒，大雨会把我打倒！」 小花的天使安慰它道：「不，不，太阳会照耀你，甘霖会滋润你；你弱小的身躯将长得更加可爱，你张开的花瓣将欢笑于日光之下；人们也会称赞你说：『这株小花长得多快啊！橡树砍去以后，长得更其美丽了！』」 亲爱的读者，你不看见吗？神挪去你的安慰、你的利益，为要叫你长得更美丽。神训练祂的精兵，不能在柔软的床上训练，祂必须领他们出去，强迫他们行军，强迫他们服役；使他们涉河、游江、攀山、负荷。这样，纔能把他们练成精兵━并不是给他们穿上精致的军服，叫他们在营门前高视阔步，也不是叫他们在公园里闲荡逍遥。神知道精兵是在战争中造成的，不是在平安中造成的。他们必须饱尝火药气味，饱经枪林弹雨。信徒阿！你的神要把你造成一个精兵，你愿不愿意呢？祂把你投在战争的火焰中，你岂不该穿上祂给你的全副军装来运用祂的得胜呢－－司布眞","sourceLink":"http://novel.tingroom.com/jingdian/92/5421.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
