{"id":15236,"no":279,"title":"October 6","content":"\"He opened not his mouth\" (Isa. 53:7) How much grace it requires to bear a misunderstanding rightly, and to receive an unkind judgment in holy sweetness! Nothing tests the Christian character more than to have some evil thing said about him. This is the file that soon proves whether we are electro-plate or solid gold. If we could only know the blessings that lie hidden in our trials we would say like David, when Shimei cursed him, \"Let him curse;…it may be…that the Lord will requite me good for his cursing this day.\"(2 Sam.16:11-12) Some people get easily turned aside from the grandeur of their life-work by pursuing their own grievances and enemies, until their life gets turned into one little petty whirl of warfare. It is like a nest of hornets. You may disperse the hornets, but you will probably get terribly stung, and get nothing for your pains, for even their honey is not worth a search. God give us more of His Spirit, \"who, when he was reviled, reviled not again\"; (1Pet.2:23) but \"committed himself to him that judgeth righteously.\" \"Consider him that endureth such contradiction of sinners against himself.\"(Heb.12:3)━A.B.Simpson \"Before you\" He trod all the path of woe, He took the sharp thrusts with His head bent low, He knew deepest sorrow and pain and grief, He knew long endurance without relief, He took all the bitter from death\u0027s deep cup, He kept not a blood-drop but gave all up. \"Before you\" and for you, He won the fight To bring you, to glory and realms of light. ━L.S.P. 十月六日 「 祂……却不开口。」 （赛五十三:7） 用缄默来容忍误会，用温和来容纳冤屈，需要何等的宽大！试验基督人最好的方法乃是说他的坏话；因为这是一把锉刀，立刻能把他试验出来究竟是镀金还是纯金。如果我们能知道我们试炼下藏着祝福的话，我们定规会像戴维一样说：「由他咒骂罢……或者耶和华……为我今日被这人咒骂，就施恩与我。」（撒下十六:11-12） 许多人因为报仇雪恨的缘故，放弃了一生伟大的事业，坠落在不需要的争竞中。这正像采黄蜂巢里的蜜一般不值得━你虽然能把黄蜂驱散，但是你定规会被牠刺伤。 感谢神！祂给了我们祂自己的灵━一个「被骂不还口」（彼前二:23）的灵，一个「只将自己交托那按公义审判人的主」的灵。「那忍受罪人这样顶撞的，你们要思想！」（来十二:3）━宣信 在你之前,祂踏过一切苦难的路程, 祂低头忍受过惨酷打击和劳瘁, 祂了解最深刻的悲哀和伤痛, 祂受过绝无安慰的长期暗晦, 祂从死神的大杯中饮尽苦汁, 祂不保留一滴血,全部捐弃。 祂在你之前,为你而战斗, 把你带入荣耀和光明境地。 ━L.S.P.","sourceLink":"http://novel.tingroom.com/jingdian/92/5514.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
