{"id":15244,"no":287,"title":"October 14","content":"\"The angel of the Lord came upon him (Peter) and a light shined in the prison; and he smote Peter on the side, and raised him up, saying, Arise up quickly. And his chains fell off\"(Acts 12:7)\\n\\n \"And at midnight Paul and Silas prayed and sang praises unto God…And suddenly there was a great earthquake, so that the foundations of the prison were shaken; and immediately all the doors were opened and every one\u0027s bands were loosed\" (Acts 16:25, 26).\\n\\n This is God\u0027s way. In the darkest hours of the night, His tread draws near across the billows. As the day of execution is breaking, the angel comes to Peter\u0027s cell. When the scaffold for Mordecai is complete, the royal sleeplessness leads to a reaction in favor of the favored race.\\n\\n Ah, soul, it may have to come to the worst with thee ere thou art delivered; but thou wilt be delivered! God may keep thee waiting, but he will ever be mindful of His covenant, and will appear to fulfill His inviolable Word. ━F. B. Meyer \\n\\n There\u0027s a simplicity about God in working out His plans, yet a resourcefulness equal to any difficulty, and an unswerving faithfulness to His trusting child, and an unforgetting steadiness in holding to His purpose. Through a fellow-prisoner, then a dream, He lifts Joseph from a prison to a premiership. And the length of stay in the prison prevents dizziness in the premier. It\u0027s safe to trust God\u0027s methods and to go by His clock. ━S. D. Gordon\\n\\n Providence hath a thousand keys to open a thousand sundry doors for the deliverance of His own, when it is even come to a desperate case. Let us be faithful; and care for our own part which is to suffer for Him, and lay Christ\u0027s part on Himself, and leave it there.━George MacDonald\\n\\n Difficulty is the very atmosphere of miracle━it is miracle in its first stage. If it is to be a great miracle, the condition is not difficulty but impossibility.\\n\\n The clinging hand of His child makes a desperate situation a delight to Him.\\n\\n 十月十四日 \\n\\n 「有主的一个使者，站在旁边，屋里有光照耀。天使拍彼得的肋旁，拍醒了他，说，快快起来。那铁链就从他手上脱落下来。」 （徒十二:7）\\n\\n 「约在半夜，保罗和西拉，祷告唱诗赞美神……忽然地大震动，甚至监牢的地基都摇动了。监门立刻全开，众囚犯的锁炼也都松开了。」（徒十六:25-26）\\n\\n 这是神的方法。神的脚步常要等到深夜最黑暗的时候，纔渐临近。我们看见，直到希律要提彼得出来处决的前一夜，天使纔来救彼得出监。挂末底改的木架预备好了以后，纔有哈随鲁王睡不着觉的事情发生。\\n\\n 啊，我的魂哪，也许在拯救临到你以前，你还须经过最黑暗的时期；但是不要怕，神必拯救你！神也许喜欢让你多等一会儿，但是祂不能忘记祂的誓约，祂必要实践祂那不可更改的应许。━梅尔\\n\\n 神有智慧的策略对付任何困难，神有不溺的信实对待信靠祂的，神有不变的公义坚持祂的旨意，我们还怕甚么呢？藉着一个同坐监牢的囚犯，藉着一个梦，神就把约瑟从监狱里提到王宫里。所以信靠神的方法、神的时间，是最安稳不过的。━戈登\\n\\n 神有一千把钥匙可以开一千扇不同的门户来拯救祂自己的孩子。所以让我们忠忠心心地去尽我们自己的那一份━为祂受苦━基督自然会去尽祂那一份的。━麦唐纳\\n\\n 困难是神迹的第一期。如果是大神迹的话，情形不仅「困难」，并且「不可能」。\\n\\n 神最喜欢祂的孩子用小手紧紧抱住祂，因此神常常给祂的孩子一些绝望。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/92/5522.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
