{"id":15250,"no":293,"title":"October 20","content":"\"And the peace of God, which transcends all our powers of thought, will be a garrison to guard your hearts and minds in Christ Jesus\" (Phil. 4:7) (Weymouth) There is what is called the \"cushion of the sea.\" Down beneath the surface that is agitated by storms, and driven about with winds, there is a part of the sea that is never stirred. When we dredge the bottom and bring up the remains of animal and vegetable life we find that they give evidence of not having been disturbed in the least, for hundreds and thousands of years. The peace of God is that eternal calm which, like the cushion of the sea, lies far too deep down to be reached by any external trouble and disturbance; and he who enters into the presence of God, becomes partaker of that undisturbed and undisturbable calm. ━Dr. A. T. Pierson When winds are raging o\u0027er the upper ocean, And billows wild contend with angry roar, \u0027Tis said, far down beneath the wild commotion, That peaceful stillness reigneth evermore. Far, far beneath, the noise of tempest dieth,And silver waves chime ever peacefully, And no rude storm, how fierce soe\u0027er it flieth, Disturbs the Sabbath of that deeper sea. So to the heart that knows Thy love, 0 Purest, There is a temple sacred evermore, And all the babble of life\u0027s angry voices Dies in hushed silence at its peaceful door. Far, far away, the roar of passion dieth, And loving thoughts rise calm and peacefully, And no rude storm, how fierce soe\u0027er it flieth, Disturbs the soul that dwells, 0 Lord, in Thee. ━Harriet Beecher Stowe \"The Pilgrim they laid in a large upper chamber, facing the sun-rising. The name of the chamber was Peace.\" ━Bunyan\u0027s Pilgrim\u0027s Progress 十月二十日 「神所赐出人意外的平安，必在基督耶稣里，保守你们的心怀意念。」 （腓四:7，直译） 洋海深处有一个最镇定的中心，人们称它为「海垫褥」。无论海面波浪多大，狂风多猛，「海垫褥」绝不会受到丝毫扰动。从海底里捞起来的动植物的遗迹，能对我们证明：它们在海底里数百年数千年之久，从来没有受到丝毫扰动过。神的平安是永久的平安，像「海垫褥」一样，是在人的最深处的━是外面的困难和骚动所不能摸到的：凡进到神前的人，都能享受这样的平安。━裴尔逊 当狂风在海面上扫荡， 暴浪在怒潮中翻腾； 可是在汹涌的海洋深处， 永远保持着宁静平和。 在那深处，听不见暴风的喧嚷， 银色的微波，永远在和谐低鸣， 无论海面上的风浪多么凶猛， 都不能打扰海洋深处的安宁。 主啊!在那深知祢爱的心中， 永远有一座神圣的宝殿， 人生所有的怨声和怒言， 都消失在它和平之门前面。 激烈的呼喊远远逝去， 爱的思想静静地上升， 无论世上的风浪多么猛烈， 都不能打扰，信靠祢的心灵。 ━史托威 「那些天路历程中的旅客, 都安置在面向日出的高楼里。 这楼名日平安阁。」 ━本仁约翰，(天路历程)","sourceLink":"http://novel.tingroom.com/jingdian/92/5528.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
