{"id":15251,"no":294,"title":"October 21","content":"\"For we know that if our earthly house of this tabernacle were dissolved, we have a building of God, an house not made with hands, eternal in the heavens\"Cor.5:1)\\n\\n The owner of the tenement which I have occupied for many years has given notice that he will furnish but little or nothing more for repairs. I am advised to be ready to move. \\n\\n At first this was not a very welcome notice. The surroundings here are in many respects very pleasant, and were it not for the evidence of decay, I should consider the house good enough. But even a light wind causes it to tremble and totter, and all the braces are not sufficient to make it secure. So I am getting ready to move. \\n\\n It is strange how quickly one\u0027s interest is transferred to the prospective home. I have been consulting maps of the new country and reading descriptions of its inhabitants. One who visited it has returned, and from him I learn that it is beautiful beyond description; language breaks down in attempting to tell of what he heard while there. He says that, in order to make an investment there, he has suffered the loss of all things that he owned here, and even rejoices in what others would call making a sacrifice. Another, whose love to me has been proven by the greatest possible test, is now there. He has sent me several clusters of the most delicious fruits. After tasting them, all food here seems insipid. \\n\\n Two or three times I have been down by the border of the river that forms the boundary, and have wished myself among the company of those who were singing praises to the King on the other side. Many of my friends have moved there. Before leaving they spoke of my coming later. I have seen the smile upon their faces as they passed out of sight. Often I am asked to make some new investments here, but my answer in every case is, \"I am getting ready to move.\" ━Selected \\n\\n The words often on Jesus\u0027 lips in His last days express vividly the idea, \"going to the Father.\"(Jn.16:17) We, too, who are Christ\u0027s people, have vision of something beyond the difficulties and disappointments of this life. We are journeying towards fulfillment, completion, expansion of life. We, too, are \"going to the Father.\" Much is dim concerning our home-country, but two things are clear. It is home, \"the Father\u0027s House.\"(Jn.14:2) It is the nearer presence of the Lord. We are all wayfarers, but the believer knows it and accepts it. He is a traveller, not a settler. ━R. C. Gillie \\n\\n The little birds trust God, for they go singing,\\n\\n From northern woods where autumn winds have blown,\\n\\n With joyous faith their trackless pathway winging,\\n\\n To summer-lands of song, afar, unknown.\\n\\n Let us g singing, then, and not go sighing:\\n\\n Since we are sure our times are in His hand,\\n\\n Why should we weep, and fear, and call it dying?\\n\\n \u0027Tis only flitting to a summer-land.\\n\\n ━selected \\n\\n 十月二十一日\\n\\n 「我们原知道，我们这地上的帐棚若拆毁了，必得神所造，不是人手所造，在天上永存的房屋。」（林后五:1）\\n\\n 我居住了多年的屋子已经破旧不堪了，屋主通知我他不愿意再花钱去修理了。他劝我还是预备迁居罢。 \\n\\n 我听了这个消息，起初很不乐意。这屋子四围的环境太有趣了，如果不是因为太破旧的缘故，我简直不想迁居。但是如今一阵微风就够叫它摇动震颤，所以我不能不预备迁居了。\\n\\n 眞奇怪，我的兴趣很快就转移到未来的新屋上面去了。我参考地图，调查居民，遣人到那边去视察。视察的人回来告诉我那边的情形非常美好。他说他因为要在那边投资的缘故，情愿变卖他在这边一切所有的；虽然别人说他牺牲太大，他还是乐意去做。还有一个我所最爱的朋友，现在也在那边。他托人带来最美味的水果来给我。我尝了以后，再吃这边的水果，简直无味极了。 \\n\\n 啊！我眞渴望立刻到那边去━和那些人站在一起唱诗赞美被杀的羔羊。我有许多朋友已经搬到那边去了。他们去的时候，他们的脸上都带着微笑。多少时候，有人劝我在这边投资，我总回答说：「我已在预备迁居了。」━选 \\n\\n 主耶稣在世上末了几天所说的，都说到「往父那里去」（约十六:17）。我们今天也该在今生的困难、失望之外，看见将来的「往父那里去」。虽然我们将来的家到底怎样，我们现在看不清楚；但是有两点是顶清楚的：这是家━「父的家」（约十四:2）。这是我们的主所在的地方。就这两点，已经够我们渴慕了。━吉利 \\n\\n 秋风起了,小鸟们离开北方,\\n\\n 一边飞,一边唱又再唱,\\n\\n 牠们有的是欣悦之信心,\\n\\n 勇往直前,投到南方的新城。\\n\\n 让我们也唱,继续唱,\\n\\n 命运既掌握在神的手里,\\n\\n 何必畏怯、叹气快死亡?\\n\\n 至终是飞往暖夏的地土。\\n\\n ━选\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/92/5529.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
