{"id":15255,"no":298,"title":"October 25","content":"\"Hitherto have ye asked nothing in my name: ask and ye shall receive, that your joy may be full\"(John 16:24) During the Civil War, a man had an only son who enlisted in the armies of the Union. The father was a banker and, although he consented to his son\u0027s going, it seemed as if it would break his heart to let him go. He became deeply interested in the soldier boys, and whenever he saw a uniform, his heart went out as he thought of his own dear boy. He spent his time, neglected his business, gave his money to caring for the soldiers who came home invalid. His friends remonstrated with him, saying he had no right to neglect his business and spend so much thought upon the soldiers, so he fully decided to give it all up. After he had come to this decision, there stepped into his bank one day a private soldier in a faded, worn uniform, who showed in his face and hands the marks of the hospital. The poor fellow was fumbling in his pocket to get something or other, when the banker saw him and, perceiving his purpose, said to him: \"My dear fellow, I cannot do anything for you today. I am extremely busy. You will have to go to your headquarters; the officers there will look after you.\" Still the poor convalescent stood, not seeming to fully understand what was said to him. Still he fumbled in his pockets and, by and by, drew out a scrap of dirty paper, on which there were a few lines written with a pencil, and laid this soiled sheet before the banker. On it he found these words: \"Dear Father: \"This is one of my comrades who was wounded in the last fight, and has been in the hospital. Please receive him as myself.━Charlie.\" In a moment all the resolutions of indifference which this man made, flew away. He took the boy to his palatial home, put him in Charlie\u0027s room, gave him Charlie\u0027s seat at the table, kept him until food and rest and love had brought him back to health, and then sent him back again to imperil his life for the flag.━Selected \"Now shalt thou SEE what I will do. \" (Ex.6:1) 十月二十五日 「向来你们没有奉我的名求什么，如今你们求就必得着，叫你们的喜乐可以满足。」 （约16：24） 当美国在南北内战时期，有一人的独生子加入联邦方面的军队作战，父亲是银行家，他虽同意儿子投军，但父子分离，他心中终觉得黯然自伤。 他开始对年轻的军人发生深挚的关怀，每当看到穿军服的人，他的心就因为想到自己的儿子而要跳出胸膛。他神不守舍，疏忽业务，把钱财用去照顾回乡的残废军人。他的亲友从旁规劝，说他不应该荒废事业，不该为军人花费那么多的心思，他听了劝谏，于是决心改变方针。 当他如此决定之后，有一天，有个士兵走进银行来，军服破烂不堪，脸上和手上都有医疗过的伤痕。 那可怜的士兵手忙脚乱地想从口袋里掏出什么东西来，银行家看见了，猜知他的目的，就对他说： 「孩子，今天我实在忙不过来，没有办法接待你。你应该到你们的司令部去；那儿有军官会照顾你。」 那个士兵仍旧站着不动，好像不大明白对他说的话。仍旧在口袋里摸索，不久掏出一张肮脏的字条，上面有几行铅笔字，他把这张污秽的字条放在银行家的面前，上面写的是： 「亲爱的父亲：这是我的战友之一，他在上次战役中负伤，进过医院，请你接待他像接待我一样。–查理。」 银行家顿时打消了原来准备采取漠视态度的决定，他把那孩子带到豪华的家里，让他住在他儿子查理的房间，用餐时坐在查理的位置，留住他直到饮食休息和爱护使他恢复了健康，然后再送他到前方为国效命。━选 「你必看见我所行的事」。(出六:1)","sourceLink":"http://novel.tingroom.com/jingdian/92/5533.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
