{"id":15302,"no":345,"title":"December 11","content":"\"Ye servants of the Lord, which by night stand in the house of the Lord. The Lord that made heaven and earth bless thee out of Zion\" (Ps.134:1-3) Strange time for adoration, you say, to stand in God\u0027s house by night, to worship in the depth of sorrow ━it is indeed an arduous thing. Yes, and therein lies the blessing; it is the test of perfect faith. If I would know the love of my friend I must see what it can do in the winter. So with the Divine love. It is easy for me to worship in the summer sunshine when the melodies of life are in the air and the fruits of life are on the tree. But let the song of the bird cease and the fruit of the tree fall, and will my heart still go on to sing? Will I stand in God\u0027s house by night? Will I love Him in His own night? Will I watch with Him even one hour in His Gethsemane? Will I help to bear His cross up the dolorous way? Will I stand beside Him in His dying moments with Mary and the beloved disciple? Will I be able with Nicodemus to take up the dead Christ? Then is my worship complete and my blessing glorious. My love has come to Him in His humiliation. My faith has found Him in His lowliness. My heart has recognized His majesty through His mean disguise, and I know at last that I desire not the gift but the Giver. When I can stand in His house by night I have accepted Him for Himself alone. ━George Matheson \"My goal is God Himself, not joy, nor peace, Nor even blessing, but Himself, my God; \u0027Tis His to lead me there, not mine, but His- \u0027At any cost, dear Lord, by my road!\" \"So faith bounds forward to its goal in God And love can trust her Lord to lead her there; \u0027Upheld by Him, my soul is following hard Till God hath full fulfilled my deepest prayer.\" \"No matter if the way be sometimes dark, No matter though the cost be ofttimes great, He knoweth how I best shall reach the mark, The way that leads to Him must needs be straight. \"One thing I know, I cannot say Him nay; One thing I do, I press towards my Lord; My God my glory here, from day to day, And in the glory there my Great Reward.” 十二月十一日 「耶和华的仆人，夜间在耶和华殿中的……愿造天地的耶和华，从锡安赐福给你们。」 （诗一三四:1-3） 「夜间在耶和华殿中」━在忧伤中敬拜神━实在是一件困难的事情。是的，是困难的，可是里面蕴藏着祝福。这是信心的考验，雪中送炭，可以见出朋友的真情，对神的爱亦复如此。 我们在夏日阳光中━空中充满了音乐，树上结满了果子的时候━敬拜神是一件容易的事情。但是当小鸟的歌声停止了，树上的果子下坠了，我们的心能不能继续歌唱呢？我们愿不愿意做夜间站在耶和华殿中的呢？我们会不会再爱祂呢？我们肯不肯在客西马尼同祂儆醒片时呢？我们肯不肯作古利奈人西门去背祂的十字架呢？我们肯不肯在祂临死的时候和马利亚并祂所爱的那门徒一同站在祂旁边呢？我们肯不肯和尼哥底母一同带着没药和沉香去安葬死的基督呢？亲爱的，如果你肯，愿造天地的耶和华，从锡安赐福给你！━马德胜 我的目的不是欢乐或平安, 也不是幸福,乃是我的神; 引导我到那里的,是祂不是我, 主啊,任何犠牲,任何路途,我都愿意。 凭信直往前,要得神自己, 凭爱来跟随,从不依别的; 愿主拯救我,脱离我自己, 我深处所祷,神是我一切。 不论所经的路途有时多么黑暗, 不论所付的代价为数多少, 祂深知如何使我达到目的, 通往祂的路,必是正直之道。 我知道的只是我不能违背祂, 我所作的只是紧随我的响导; 日复一日,这是我的神和光荣, 在那光荣里,有我伟大的酬报","sourceLink":"http://novel.tingroom.com/jingdian/92/5580.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
