{"id":14995,"no":38,"title":"February 7","content":"\"Why art thou cast down, O my soul.\" (Psalm. 43:5) Is there ever any ground to be cast down? There are two reasons, but only two. If we are as yet unconverted, we have ground to be cast down; or if we have been converted and live in sin, then we are rightly cast down. But except for these two things there is no ground to be cast down, for all else may be brought before God in prayer with supplication and thanksgiving. And regarding all our necessities, all our difficulties, all our trials, we may exercise faith in the power of God, and in the love of God. \"Hope thou in God.\" Oh, remember this: There is never a time when we may not hope in God. Whatever our necessities, however great our difficulties, and though to all appearance help is impossible, yet our business is to hope in God, and it will be found that it is not in vain. In the Lord\u0027s own time help will come. Oh, the hundreds, yea, the thousands of times that I have found it thus within the past seventy years and four months! When it seemed impossible that help could come, help did come; for God has His own resources. He is not confined. In ten thousand different ways, and at ten thousand different times God may help us. Our business is to spread our cases before the Lord, in childlike simplicity to pour out all our heart before God, saying, \"I do not deserve that Thou shouldst hear me and answer my requests, but for the sake of my precious Lord Jesus; for His sake answer my prayer, and give me grace quietly to wait till it please Thee to answer my prayer. For I believe Thou wilt do it in Thine own time and way.\" \"For I shall yet praise him.\" More prayer, more exercise of faith, more patient waiting, and the result will be blessing, abundant blessing. Thus I have found it many hundreds of times, and therefore I continually say to myself, \"Hope thou in God.\" ━George Mueller 二月七日 “我的心哪，你为何忧闷…应当仰望神；因我还要称赞祂\" （诗四十三：5） 　　有甚么理由叫我们忧闷呢？有两个理由，可叫我们忧闷：第一，如果我们还没有得救，我们就有理由忧闷；第二，如果我们已经得救了，而仍活在罪中；那么，我们一定会忧闷的。 　　除了这两件事情以外，我们就没有理由可以忧闷。一个正常的信徒，如果忧闷，是一件可怪的事；因为一切的事我们都可以藉着祷告，祈求，和感谢来告诉我们的神。我们一切的需要，我们一切的困难，我们一切的试炼，只要相信神的大能和神的爱，样样都可以过去的。 　　“应当仰望神。”哦，让我们记住这句话：我们没有一个时侯可以不仰望神。不管我们的需要何等多，我们的难处何等大，我们的指望何等小，我们的责任只是仰望神；结果，我们会发现：这样的仰望并不是徒然的。到了神自己的时侯，帮助来了。 　　哦，在我以往的七十年又四个月中，我已经试过几百，几千次；仰望神并没有一次失败的！ 　　当我以为帮助再没有可能来了的时侯：帮助就在这个时侯来了；神有千万个不同的方法，千万个不同的时间，可以帮助我们。祂不受任何限制。 　　我们只消把我们的事情摆在神前，带着小孩子那样的简单，倾心吐意地对神说：“父神阿，我本来不配求你听我的祷告，但是为了我主耶稣基督的缘故，求你答应我的祈求，也给我恩典使我能安静等候你的时侯。我深信你必在你自己的时侯，用你自己的方法，为我成就”。 　　“因我还要称赞祂“。多祷告，多运用信心，多赞美，多忍耐等候，结果就是顶大顶丰富的祝福。我有这样的经历何止千百次，所以我要继续自勉说，“应当仰望神。”━莫勒","sourceLink":"http://novel.tingroom.com/jingdian/92/4853.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
