{"id":14961,"no":4,"title":"January 4","content":"\"Jesus saith unto him, Go thy way; thy son liveth. And the man believed the word that Jesus had spoken unto him, and he went his way.\" (John 4:50) \"When ye pray, believe.\" (Mark 11:24) When there is a matter that requires definite prayer, pray till you believe God, until with unfeigned lips you can thank Him for the answer. If the answer still tarries outwardly, do not pray for it in such a way that it is evident that you are not definitely believing for it. Such a prayer in place of being a help will be a hindrance; and when you are finished praying, you will find that your faith has weakened or has entirely gone. The urgency that you felt to offer this kind of prayer is clearly from self and Satan. It may not be wrong to mention the matter in question to the Lord again, if He is keeping you waiting, but be sure you do so in such a way that it implies faith. Do not pray yourself out of faith. You may tell Him that you are waiting and that you are still believing Him and therefore praise Him for the answer. There is nothing that so fully clinches faith as to be so sure of the answer that you can thank God for it. Prayers that pray us out of faith deny both God\u0027s promise in His Word and also His whisper \"Yes,\" that He gave us in our hearts. Such prayers are but the expression of the unrest of one\u0027s heart, and unrest implies unbelief in reference to the answer to prayer. \"For we which have believed do enter into rest\" (Heb. 4:3). This prayer that prays ourselves out of faith frequently arises from centering our thoughts on the difficulty rather than on God\u0027s promise. Abraham \"considered not his own body,\" \"he staggered not at the promise of God\" (Rom. 4:19, 20). May we watch and pray that we enter not into temptation of praying ourselves out of faith. ━ C. H. P. Faith is not a sense, nor sight, nor reason, but a taking God at His Word. – Evans. The beginning of anxiety is the end of faith, and the beginning of true faith is the end of anxiety. ━ George Mueller. You will never learn faith in comfortable surroundings. God gives us the promises in a quiet hour; God seals our covenants with great and gracious words, then He steps back and waits to see how much we believe; then He lets the tempter come, and the test seems to contradict all that He has spoken. It is then that faith wins its crown. That is the time to look up through the storm, and among the trembling, frightened seamen cry, \"I believe God that it shall be even as it was told me.\"(Acts.27:25) 一月四日 　“耶稣对他说回去罢；你的儿子活了。那人信耶稣所说的话，就回去了。” （约四：50） “你们祷告祈求…只要信…” （可十一：24） 　　如果这里有一件事需要专一的祷告，就该祷告直到你能信神，直到你能发出无伪的赞美来感谢神的答应。如果神的答应一时还在中途，切勿重新求神答应你的祈求，因为这表示你没有信神。这种不信的祷告非但不能帮助你什么，反能减少或消灭你的信心。献上这种祷告的催促，定是出乎撒但或是自己。这也许不能算错：当神还放你在一个等候的地位，你再去向祂申说，可是切记你必须带着信心。不要把你自己祷告得失了信心。你可以告诉祂你仍然等着祂、相信祂，因此仍然赞美感谢祂的答应。你如果确信答应必将来到，你能够先为着尚未来到的答应感谢赞美神。我告诉你：没有一件东西比这更能坚固你的信心。把我们祷告得失了信心的祷告，是否认神在经上给我们的应许，也否认神在我们心中给我们的一声“是”。这种祷告不过表示我们的心没有安息，没有安息就是不信祷告的答应。“但我们已相信的人，得以进入那安息”（来四：3）。这种把我们自己祷告得失了信心的祷告，常是因为我们的思想集中在难处上过于在神的应许上。亚伯拉罕“不想到自己的身体…不疑惑神的应许”（罗四章19/20直译）。让我们儆醒祷告，免得入了迷惑，以致把我们自己祷告得失了信心。 　　信心不是感觉、不是眼见、不是理由，乃是在神的话语上抓住神。━伊文思 　　焦急的开始就是信心的结束，信心的开始就是焦急的结束。━莫勒 　　在舒适的环境中你绝不会学到信心的功课。神常在我们孤单的时候给我们应许；然后用祂恩典的话语当作印盖在所给我们的约上，便暂时退后去看我们究竟相信多少；祂又让那诱惑人的来试探我们，让我们的遭遇似乎与祂所说的完全相反。这时候就是信心赢得冠冕的时候。这时候就该在黑云之下、风波之中，发出胜利的欢呼来；“我信神祂怎样对我说，事情也要怎样成就”（徒二十七：25）","sourceLink":"http://novel.tingroom.com/jingdian/92/4825.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
