{"id":15000,"no":43,"title":"February 12","content":"\"Your heavenly Father knoweth.\" (Matt. 6:32)\\n\\n A visitor at a school for the deaf and dumb was writing questions on the blackboard for the children. By and by he wrote this sentence: \"Why has God made me to hear and speak, and made you deaf and dumb?\"\\n\\n The awful sentence fell upon the little ones like a fierce blow in the face. They sat palsied before that dreadful \"Why?\" And then a little girl arose.\\n\\n Her lip was trembling. Her eyes were swimming with tears. Straight to the board she walked, and, picking up the crayon, wrote with firm hand these precious words: \"Even so, Father, for so it seemed good in thy sight!\"(Mt.11:26) What a reply! It reaches up and lays hold of an eternal truth upon which the maturest believer as well as the youngest child of God may alike securely rest━the truth that God is your Father.\\n\\n Do you mean that? Do you really and fully believe that? When you do, then your dove of faith will no longer wander in weary unrest, but will settle down forever in its eternal resting place of peace. \"Your Father!\"\\n\\n I can still believe that a day comes for all of us, however far off it may be, when we shall understand; when these tragedies, that now blacken and darken the very air of heaven for us, will sink into their places in a scheme so august, so magnificent, so joyful, that we shall laugh for wonder and delight. ━Arthur Christopher Bacon\\n\\n No chance hath brought this ill to me;\\n\\n \u0027Tis God\u0027s own hand, so let it be,\\n\\n He seeth what I cannot see.\\n\\n There is a need-be for each pain,\\n\\n And He one day will make it plain\\n\\n That earthly loss is heavenly gain.\\n\\n Like as a piece of tapestry\\n\\n Viewed from the back appears to be\\n\\n Naught but threads tangled hopelessly;\\n\\n But in the front a picture f air\\n\\n Rewards the worker for his care,\\n\\n Proving his skill and patience rare.\\n\\n Thou art the Workman, I the frame.\\n\\n Lord, for the glory of Thy Name,\\n\\n Perfect Thine image on the same.\\n\\n ━Selected\\n\\n 二月十二日\\n\\n 　　“你们的天父是知道的” （太六：32）\\n\\n 　　有一位访客，一次去参观一间聋哑学校。他看见那些聋哑的学生正在圣经班上顶虔诚地读神的话语。他就在他们的黑板上写了一个问题请他们答复：“神旣然爱你们，为甚么使你们聋哑，倒反使我能听能说呢”？\\n\\n 　　全班学生都因这一个苛刻的问题受打击。他们大家坐着相对唏嘘，向着那可怕的“为甚么”发呆。过了一会儿，一位顶小的女孩子站了起来。\\n\\n 　　她的嘴唇还在颤动。她的目眶中饱满了眼泪。她走到前面，爬在椅子上，（因为黑板高，她的身体矮小），拿起粉笔，用坚定的手笔写上这几个宝贝的字：“父啊，是的，因为祢的美意本是如此”（太十一：26）。这是何等切实的一个答复呢！这是一个永久的真理，无论大人，无论小孩，都可以安息在其中的━天地之主是我们的父。\\n\\n 　　读者，你信不信神是你的父呢？如果你真信，那么你信心的鸽子不会再游荡无依找不着落脚之地了，因为可以永远稳定在安息所━你们的父那里了！\\n\\n 　　我一直相信，总有一天，不管它离开现在还有多久，我们会明白一切；到了那一天，如今使我们觉得遮蔽天空的许多黑暗悲伤，都将消散，由那新的图案来代替黑暗，那新的图案设计得如何庄严华丽和喜悦，我们将在此奇妙的喜乐中了。━培根\\n\\n 并非机遇给我带来的不幸；\\n\\n 这是神的赐予，所以只有听命，\\n\\n 因为祂看见我所见不到的情境。\\n\\n 任何痛苦都有它们的原因，\\n\\n 有一天祂将会给你说明，\\n\\n 地上的损失，换来了天上的欢欣。\\n\\n 像毡毯织满了花，\\n\\n 从背面去看，\\n\\n 只是线乱如麻。\\n\\n 但正面却是一幅美画，\\n\\n 表现了作者的绝妙才华，\\n\\n 丝丝入扣的匠心，有了代价。\\n\\n 主啊，你是艺匠，我是作品，\\n\\n 为了荣耀祢的名，\\n\\n 以祢的形像来塑我的型。\\n\\n ━选\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/92/4858.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
