{"id":15040,"no":83,"title":"March 24","content":"\"And Jacob said, O God of my father Abraham, and God of my father Isaac, the Lord which saidst unto me, Return unto thy country, and to thy kindred, and I will deal well with thee: Deliver me, I pray thee.\" (Gen. 32:9, 11) There are many healthy symptoms in that prayer. In some respects it may serve as a mould into which our own spirits may pour themselves, when melted in the fiery furnace of sorrow. He began by quoting God\u0027s promise: \"Thou saidst.\" He did so twice (9 and 12). Ah, he has got God in his power then! God puts Himself within our reach in His promises; and when we can say to Him, \"Thou saidst,\" He cannot say nay. He must do as He has said. If Herod was so particular for his oath\u0027s sake, what will not our God be? Be sure in prayer, to get your feet well on a promise; it will give you purchase enough to force open the gates of heaven, and to take it by force. --Practical Portions for the Prayer-life. Jesus desires that we shall be definite in our requests, and that we shall ask for some special thing. \"What will ye that I shall do unto you?\" is the question that He asks of every one who in affliction and trial comes to Him. Make your requests with definite earnestness if you would have definite answers. Aimlessness in prayer accounts for so many seemingly unanswered prayers. Be definite in your petition. Fill out your check for something definite, and it will be cashed at the bank of Heaven when presented in Jesus\u0027 Name. Dare to be definite with God. --Selected. Miss Havergal has said: \"Every year, I might almost say every day, that I live, I seem to see more clearly how all the rest and gladness and power of our Christian life hinges on one thing; and that is, taking God at His word, believing that He really means exactly what He says, and accepting the very words in which He reveals His goodness and grace, without substituting others or altering the precise modes and tenses which He has seen fit to use.\" Bring Christ\u0027s Word--Christ\u0027s promise, and Christ\u0027s sacrifice--His blood, with thee, and not one of Heaven\u0027s blessings can be denied thee. --Adam Clarke. 　 三月二十四日 “雅各说，耶和华，我祖亚伯拉罕的神，我父亲以撒的神啊，你曾对我说，回你本地本族去，我要厚待你…求你救我” (创三十二：9，12)。 　在这个祷告中有好几点可以做我们的帮助，使我们在忧伤的火窑中知道如何向神倾心吐意。 　　雅各开场就把神的应许拿出来提醒神：“你…曾说”。他这样说了两次 (九节，十二节)。啊，他抓住了神！原来神的应许就是神给我们的把柄，我们能藉着这个去抓住他；什么时侯我们能对他说：“你曾说”，他决不能说不。他必须照他所说的去做。希律王尚且能守信，何况我们的神呢？所以我们祷告的时侯，应当把我们的脚站稳在他的应许上；这样，天上的门也只得为你敞开了，那时你可以用武力去取你所求的。——译自实用祷告生活 　　主耶稣要我们有专一的祷告。每一个因痛苦，试炼，而来就他的人，他都问他们说：“要我为你作什么”？(可十：51)如果你盼望有清楚的答应，就得有清楚的祷告。没有目的的祷告，是没有答应的。所以你的祷告应当专一。在你祷告的支票上写明指定的数目，天上的银行看见了主耶稣的名字，就要付你指定的现款。——选 　　海弗格尔(Havergal)女士说：“每年，每天，我活着，真看见基督徒所有的安息，喜乐，能力，都因着一件事情：就是以神的话为算数——相信他怎样说，就必怎样做。我们该照他所用的字眼去接受，切勿更改或变换他所用的语气和时候”。 　　只要把基督的话语——基督的应许，和基督的宝血拿出来，天上的祝福就没有一样能不给你了。——莫拉克","sourceLink":"http://novel.tingroom.com/jingdian/92/5019.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
