{"id":15043,"no":86,"title":"March 27","content":"\"I do not count the sufferings of our present life worthy of mention when compared with the glory that is to be revealed and bestowed upon us.\" (Rom. 8:18) (20th Century Trans.) \n \n A remarkable incident occurred recently at a wedding in England. A young man of large wealth and high social position, who had been blinded by an accident when he was ten years old, and who won University honors in spite of his blindness, had won a beautiful bride, though he had never looked upon her face. A little while before his marriage, he submitted to a course of treatment by experts, and the climax came on the day of his wedding. \n \n The day came, and the presents, and guests. There were present cabinet ministers and generals arid bishops and learned men and women. The bridegroom, dressed for the wedding, his eyes still shrouded in linen, drove to the church with his father, and the famous oculist met them in the vestry. \n \n The bride, entered the church on the arm of her white-haired father. So moved was she that she could hardly speak. Was her lover at last to see her face that others admired, but which he knew only through his delicate finger tips? \n \n As she neared the altar, while the soft strains of the wedding march floated through the church, her eyes fell on a strange group. \n \n The father stood there with his son. Before the latter was the great oculist in the act of cutting away the last bandage. The bridegroom took a step forward, with the spasmodic uncertainty of one who cannot believe that he is awake. A beam of rose-colored light from a pane in the chancel window fell across his face, but he did not seem to see it. \n \n Did he see anything? Yes! Recovering in an instant his steadiness of mien, and with a dignity and joy never before seen in his face, he went forward to meet his bride. They looked into each other\u0027s eyes, and one would have thought that his eyes would never wander from her face. \n \n \"At last!\" she said. \"At last!\" he echoed solemnly, bowing his head. That was a scene of great dramatic power, and no doubt of great joy, and is but a mere suggestion of what will actually take place in Heaven when the Christian who has been walking through this world of trial and sorrow, shall see Him face to face. --Selceted. \n \n \"Just a-wearying for you, \n \n Jesus, Lord, beloved and true; \n \n Wishing for you, wondering when \n \n You\u0027ll be coming back again, \n \n Under all I say and do, \n \n Just a-wearying for you. \n \n \"Some glad day, all watching past, \n \n You will come for me at last; \n \n Then I\u0027ll see you, hear your voice, \n \n Be with you, with you rejoice; \n \n How the sweet hope thrills me through, \n \n Sets me wearying for you.\" \n \n 　 三月二十七日 \n \n “我想现在的苦楚，若比起将来要显于我们的荣耀，就不足介意了”。 （罗八：18） \n \n 最近在英国举行的一次婚礼中，发生了奇迹。新郎是富有的青年，社会地位很高，不幸在十岁的时候，因遇意外而双目失明，他虽然瞎了眼，仍能读得大学的学位，并且得到一个美丽的新娘，虽然从未看见过她的面容。结婚前不久，他由眼科专家施行手术。故事的最高峰，就发生在举行婚礼的那天。 \n \n 那天，宾客和礼物纷纷而到。有内阁大臣、将军、主教和学术界的仕女们。新郎穿了礼服，眼睛上仍蒙着纱布和他父亲一同乘车来到教堂，那位有名的眼科专家也早等在牧师的法衣室里了。 \n \n 新娘挽着白发苍苍的老父的手臂，进入教堂。她的情绪激动万分，不能开口。在今天她的爱人究竟能否恢复视觉，终将看见她的容貌？她的美丽素为别人所艳羡，而他在过去，只能以敏锐的指尖去摸索的。当她走近圣坛的时候，婚礼进行曲的柔和音调，弥漫了整个教堂，她的目光注视着新郎和伴着他的眼科医生。 \n \n 父与子都站在那里，新郎面前，站着那位眼科专家，正在割断最后一条绷带。新郎向前跨了一步，好像大梦初醒，仍有些迷茫不知所措的样子。一道玫瑰色的光线穿过教堂的有色玻璃，照到他脸上，他好像仍旧不敢相信已经看见了这道亮光。 \n \n 究竟看见了没有呢？看见了！瞬刻间恢复了稳定的姿态，带着空前的庄严和喜悦，走向前去会见他的新娘。他们眼对眼彼此凝视，旁观者不禁觉得，他的目光似乎永不会移开她的脸了。 \n \n 女的说：“终于看见了！”男的低下头去庄重地应声道：“终于看见了！”这是十分感人的一幕，也是极大的喜悦。它暗示我们，这将是发生于天堂的实际情景，当基督徒经历了人世的苦难和悲哀，终将同样地和神面对着面彼此相见。 \n \n 亲爱的真主耶稣， \n \n 我永远渴念你， \n \n 不知何年何日，你再临人世， \n \n 我是一心在翘企。 \n \n 我所言所行， \n \n 都是为了渴望着你。 \n \n 那欢乐的日子到来的时候， \n \n 使望待成为过去， \n \n 我会看见你，听到你的声音， \n \n 分享你的欢欣， \n \n 这希望给我多少鼓励， \n \n 我正企盼殷勤。 \n \n","sourceLink":"http://novel.tingroom.com/jingdian/92/5022.html","bookId":475,"book":{"id":475,"title":"Streams In The Desert荒漠甘泉","description":"简介： 《荒漠甘泉》（Streams in the Desert）是基督教的著名灵修书籍，于1920年首次出版。该书不但是20世纪颇为盛名的重要宗教著作，另外也因里面提及的故事颇为动人，因此有不少非基督徒也阅读过此...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290474614bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/92","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
