{"id":233,"no":27,"title":"Chapter 7","content":"Lady \\n\\n \\n\\n Arcadia felt triumphant. How life had changed since Pelleas Anthor had stuck his silly face up against her window ?and all because she had the vision and courage to do what needed to be done. \\n\\n \\n\\n Here she was on Kalgan. She had been to the great Central Theater ?the largest in the Galaxy ?and seen in person some of the singing stars who were famous even in the distant Foundation. She had shopped all on her own along the Flowered Path, fashion center of the gayest world in Space. And she had made her own selections because Homir just didn\u0027t know anything about it at all. The saleswomen raised no objections at all to long, shiny dresses with those vertical sweeps that made her look so tall ?and Foundation money went a long, long way. Homir had given her a ten-credit bill and when she changed it to Kalganian \"Kalganids,\" it made a terribly thick sheaf. \\n\\n \\n\\n She had even had her hair redone ?sort of half-short in back, with two glistening curls over each temple. And it was treated so that it looked goldier than ever; it just shone. \\n\\n \\n\\n But this, this was best of all. To be sure, the Palace of Lord Stettin wasn\u0027t as grand and lavish as the theaters, or as mysterious and historical as the old palace of the Mule ?of which, so far they had only glimpsed the lonely towers in their air flight across the planet ?but, imagine, a real Lord. She was rapt in the glory of it. \\n\\n \\n\\n And not only that. She was actually face to face with his Mistress. Arcadia capitalized the word in her mind, because she knew the role such women had played in history; knew their glamour and power. In fact, she had often thought of being an all-powerful and glittering creature, herself, but somehow mistresses weren\u0027t in fashion at the Foundation just then and besides, her father probably wouldn\u0027t let her, if it came to that. \\n\\n \\n\\n Of course, the Lady Callia didn\u0027t quite come up to Arcadia\u0027s notion of the part. For one thing, she was rather plump, and didn\u0027t look at all wicked and dangerous. just sort of faded and near-sighted. Her voice was high, too, instead of throaty, and? \\n\\n \\n\\n Callia said, \"Would you like more tea, child?\" \\n\\n \\n\\n \"I\u0027ll have another cup, thank you, your grace,\" ?or was it your highness? \\n\\n \\n\\n Arcadia continued with a connoisseur\u0027s condescension, \"Those are lovely pearls you are wearing, my lady.\" (On the whole, \"my lady\" seemed best.) \\n\\n \\n\\n \"Oh? Do you think so?\" Callia seemed vaguely pleased. She removed them and let them swing milkily to and fro. \"Would you like them? You can have them, if you like.\" \\n\\n \\n\\n \"Oh, my?You really mean? She found them in her hand, then, repelling them mournfully, she said, \"Father wouldn\u0027t like it.\" \\n\\n \\n\\n \"He wouldn\u0027t like the pearls? But they\u0027re quite nice pearls.\" \\n\\n \\n\\n \"He wouldn\u0027t like my taking them, I mean. You\u0027re not supposed to take expensive presents from other people, he says.\" \\n\\n \\n\\n \"You aren\u0027t? But ... I mean, this was a present to me from Poo ... from the First Citizen. Was that wrong, do you suppose?\" \\n\\n \\n\\n Arcadia reddened. \"I didn\u0027t mean--\" \\n\\n \\n\\n But Callia had tired of the subject. She let the pearls slide to the ground and said, \"You were going to tell me about the Foundation. Please do so right now.\" \\n\\n \\n\\n And Arcadia was suddenly at a loss. What does one say about a world dull to tears. To her, the Foundation was a suburban town, a comfortable house, the annoying necessities of education, the uninteresting eternities of a quiet life. She said, uncertainly, \"It\u0027s just like you view in the book-films, I suppose.\" \\n\\n \\n\\n \"Oh, do you view book-films? They give me such a headache when I try. But do you know I always love video stories about your Traders ?such big, savage men. It\u0027s always so exciting. Is your friend, Mr. Munn, one of them? He doesn\u0027t seem nearly savage enough. Most of the Traders had beards and big bass voices, and were so domineering with women ?don\u0027t you think so?\" \\n\\n \\n\\n Arcadia smiled, glassily. \"That\u0027s just part of history, my lady. I mean, when the Foundation was Young, the Traders were the pioneers pushing back the frontiers and bringing civilization to the rest of the Galaxy. We learned all about that in school. But that time has passed. We don\u0027t have Traders any more; just corporations and things.\" \\n\\n \\n\\n \"Really? What a shame. Then what does Mr. Munn do? I mean, if he\u0027s not a Trader.\" \\n\\n \\n\\n \"Uncle Homir\u0027s a librarian.\" \\n\\n \\n\\n Callia put a hand to her lips and tittered. \"You mean he takes care of book-films. Oh, my! It seems like such a silly thing for a grown man to do.\" \\n\\n \\n\\n \"He\u0027s a very good librarian, my lady. It is an occupation that is very highly regarded at the Foundation.\" She put down the little, iridescent teacup upon the milky-metaled table surface. \\n\\n \\n\\n Her hostess was all concern. \"But my dear child. I\u0027m sure I didn\u0027t mean to offend you. He must be a very intelligent man. I could see it in his eyes as soon as I looked at him. They were so ... so intelligent. And he must be brave, too, to want to see the Mule\u0027s palace.\" \\n\\n \\n\\n \"Brave?\" Arcadia\u0027s internal awareness twitched. This was what she was waiting for. Intrigue! Intrigue! With great indifference, she asked, staring idly at her thumbtip: \"Why must one be brave to wish to see the Mule\u0027s palace?\" \\n\\n \\n\\n \"Didn\u0027t you know?\" Her eyes were round, and her voice sank. \"There\u0027s a curse on it. When he died, the Mule directed that no one ever enter it until the Empire of the Galaxy is established. Nobody on Kalgan would dare even to enter the grounds.\" \\n\\n \\n\\n Arcadia absorbed that. \"But that\u0027s superstition? \\n\\n \\n\\n \"Don\u0027t say that,\" Callia was distressed. \"Poochie always says that. He says it\u0027s useful to say it isn\u0027t though, in order to maintain his hold over the people. But I notice he\u0027s never gone in himself. And neither did Thallos, who was First Citizen before Poochie.\" A thought struck her and she was all curiosity again: \"But why does Mr. Munn want to see the Palace?\" \\n\\n \\n\\n And it was here that Arcadia\u0027s careful plan could be put into action. She knew well from the books she had read that a ruler\u0027s mistress was the real power behind the throne, that she was the very well-spring of influence. Therefore, if Uncle Homir failed with Lord Stettin ?and she was sure he would ?she must retrieve that failure with Lady Callia. To be sure, Lady Callia was something of a puzzle. She didn\u0027t seem at all bright. But, well, all history proved? \\n\\n \\n\\n She said, \"There\u0027s a reason, my lady ?but will you keep it in confidence?\" \\n\\n \\n\\n \"Cross my heart,\" said Callia, making the appropriate gesture on the soft, billowing whiteness of her breast. \\n\\n \\n\\n Arcadia\u0027s thoughts kept a sentence ahead of her words. \"Uncle Homir is a great authority on the Mule, you know. He\u0027s written books and books about it, and he thinks that all of Galactic history has been changed since the Mule conquered the Foundation.\" \\n\\n \\n\\n \"Oh, my.\" \\n\\n \\n\\n \"He thinks the Seldon Plan? \\n\\n \\n\\n Callia clapped her hands. \"I know about the Seldon Plan. The videos about the Traders were always all about the Seldon Plan. It was supposed to arrange to have the Foundation win all the time. Science had something to do with it, though I could never quite see how. I always get so restless when I have to listen to explanations. But you go right ahead, my dear. It\u0027s different when you explain. You make everything seem so clear.\" \\n\\n \\n\\n Arcadia continued, \"Well, don\u0027t you see then that when the Foundation was defeated by the Mule, the Seldon Plan didn\u0027t work and it hasn\u0027t worked since. So who will form the Second Empire?\" \\n\\n \\n\\n \"The Second Empire?\" \\n\\n \\n\\n \"Yes, one must be formed some day, but how? That\u0027s the problem, you see. And there\u0027s the Second Foundation.\" \\n\\n \\n\\n \"The Second Foundation?\" She was quite completely lost. \\n\\n \\n\\n \u0027Yes, they\u0027re the planners of history that are following in the footsteps of Seldon. They stopped the Mule because he was premature, but now, they may be supporting Kalgan.\" \\n\\n \\n\\n \"Why?\" \\n\\n \\n\\n \"Because Kalgan may now offer the best chance of being the nucleus for a new Empire.\" \\n\\n \\n\\n Dimly, Lady Callia seemed to grasp that. \"You mean Poochie is going to make a new Empire.\" \\n\\n \\n\\n \"We can\u0027t tell for sure. Uncle Homir thinks so, but hell have to see the Mule\u0027s records to find out.\" \\n\\n \\n\\n \"It\u0027s all very complicated,\" said Lady Callia, doubtfully. \\n\\n \\n\\n Arcadia gave up. She had done her best. \\n\\n \\n\\n Lord Stettin was in a more-or-less savage humor. The session with the milksop from the Foundation had been quite unrewarding. It had been worse; it had been embarrassing. To be absolute ruler of twenty-seven worlds, master of the Galaxy\u0027s greatest military machine, owner of the universe\u0027s most vaulting ambition ?and left to argue nonsense with an antiquarian. \\n\\n \\n\\n Damnation! \\n\\n \\n\\n He was to violate the customs of Kalgan, was he? To allow the Mule\u0027s palace to be ransacked so that a fool could write another book? The cause of science! The sacredness of knowledge! Great Galaxy! Were these catchwords to be thrown in his face in all seriousness? Besides ?and his flesh prickled slightly ?there was the matter of the curse. He didn\u0027t believe in it; no intelligent man could. But if he was going to defy it, it would have to be for a better reason than any the fool had advanced. \\n\\n \\n\\n \"What do you want?\" he snapped, and Lady Callia cringed visibly in the doorway. \\n\\n \\n\\n \"Are you busy?\" \\n\\n \\n\\n \"Yes. I am busy.\" \\n\\n \\n\\n \"But there\u0027s nobody here, Poochie. Couldn\u0027t I even speak to you for a minute?\" \\n\\n \\n\\n \"Oh, Galaxy! What do you want? Now hurry.\" \\n\\n \\n\\n Her words stumbled. \"The little girl told me they were going into the Mule\u0027s palace. I thought we could go with her. It must be gorgeous inside.\" \\n\\n \\n\\n \"She told you that, did she? Well, she isn\u0027t and we aren\u0027t. Now go tend your own business. I\u0027ve had about enough of you.\" \\n\\n \\n\\n \"But, Poochie, why not? Aren\u0027t you going to let them? The little girl said that you were going to make an Empire!\" \\n\\n \\n\\n \"I don\u0027t care what she said?What was that?\" He strode to Callia, and caught her firmly above the elbow, so that his fingers sank deeply into the soft flesh, \"What did she tell you?\" \\n\\n \\n\\n \"You\u0027re hurting me. I can\u0027t remember what she said, if you\u0027re going to look at me like that.\" \\n\\n \\n\\n He released her, and she stood there for a moment, rubbing vainly at the red marks. She whimpered, \"The little girl made me promise not to tell.\" \\n\\n \\n\\n \"That\u0027s too bad. Tell me! Now!\" \\n\\n \\n\\n \"Well, she said the Seldon Plan was changed and that there was another Foundation somewheres that was arranging to have you make an Empire. That\u0027s all. She said Mr. Munn was a very important scientist and that the Mule\u0027s palace would have proof of all that. That\u0027s every bit of what she said. Are you angry?\" \\n\\n \\n\\n But Stettin did not answer. He left the room, hurriedly, with Callia\u0027s cowlike eyes staring mournfully after him. Two orders were sent out over the official seal of the First Citizen before the hour was up. One had the effect of sending five hundred ships of the line into space on what were officially to be termed as \"war games.\" The other had the effect of throwing a single man into confusion. \\n\\n \\n\\n Homir Munn ceased his preparations to leave when that second order reached him. It was, of course, official permission to enter the palace of the Mule. He read and reread it with anything but joy. \\n\\n \\n\\n But Arcadia was delighted. She knew what had happened. \\n\\n \\n\\n Or, at any rate, she thought she did. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1597/47458.html","bookId":8,"book":{"id":8,"title":"基地系列 Second Foundation 第二基地","description":"简介： 《第二基地》（Second Foundation），是美国科幻作家艾萨克阿西莫夫出版于1953年的科幻小说中篇集，基地三部曲的第三部。本书讲述了在骡攻占基地之后，骡和第一基地的遗民寻找谜一般的第二基地的传奇事迹，共由两个中篇故事组成。...","cover":"http://novel.tingroom.com/file/upload/201607/07/10-17-36-95-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/kehuan/1597","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
