{"id":239,"no":33,"title":"Chapter 10","content":"\\n\\n \\n\\n Beginning of War \\n\\n \\n\\n For reason or reasons unknown to members of the Galaxy at the time of the era under discussion, Intergalactic Standard Time defines its fundamental unit, the second, as the time in which light travels 299,776 kilometers. 86,400 seconds are arbitrarily set equal to one Intergalactic Standard Day; and 365 of these days to one Intergalactic Standard Year. \\n\\n \\n\\n Why 299,776??Or 86,400??Or 365? \\n\\n \\n\\n Tradition, says the historian, begging the question. Because of certain and various mysterious numerical relationships, say the mystics, cultists, numerologists, metaphysicists. Because the original home-planet of humanity had certain natural periods of rotation and revolution from which those relationships could be derived, say a very few. \\n\\n \\n\\n No one really knew. \\n\\n \\n\\n Nevertheless, the date on which the Foundation cruiser, the Hober Mallow met the Kalganian squadron, headed by the Fearless, and, upon refusing to allow a search party to board, was blasted into smoldering wreckage was 185; 11692 G.E. That is, it was the 185th day of the 11,692nd year of the Galactic Era which dated from the accession of the first Emperor of the traditional Kamble dynasty. It was also 185; 419 A.S. ?dating from the birth of Seldon ?or 185; 348 Y.F. ?dating from the establishment of the Foundation. On Kalgan it was 185; 56 F.C. ?dating from the establishment of the First Citizenship by the Mule. In each case, of course, for convenience, the year was so arranged as to yield the same day number regardless of the actual day upon which the era began. \\n\\n \\n\\n And, in addition, to all the millions of worlds of the Galaxy, there were millions of local times, based on the motions of their own particular heavenly neighbors. \\n\\n \\n\\n But whichever you choose: 185; 11692-419-348-56 ?or anything ?it was this day which historians later pointed to when they spoke of the start of the Stettinian war. \\n\\n \\n\\n Yet to Dr. Darell, it was none of these at all. It was simply and quite precisely the thirty-second day since Arcadia had left Terminus. \\n\\n \\n\\n What it cost Darell to maintain stolidity through these days was not obvious to everyone. \\n\\n \\n\\n But Elvett Semic thought he could guess. He was an old man and fond of saying that his neuronic sheaths had calcified to the point where his thinking processes were stiff and unwieldy. He invited and almost welcomed the universal underestimation of his decaying powers by being the first to laugh at them. But his eyes were none the less seeing for being faded; his mind none the less experienced and wise, for being no longer agile. \\n\\n \\n\\n He merely twisted his pinched lips and said, \"Why don\u0027t you do something about it?\" \\n\\n \\n\\n The sound was a physical jar to Darell, under which he winced. He said, gruffly, \"Where weeeeee?\" \\n\\n \\n\\n Semic regarded him with grave eyes. \"You\u0027d better do something about the girl.\" His sparse, yellow teeth showed in a mouth that was open in inquiry. \\n\\n \\n\\n But Darell replied coldly, \"The question is: Can you get a Symes-Molff Resonator in the range required?\" \\n\\n \\n\\n Well, I said I could and you weeen\u0027t listening? \\n\\n \\n\\n \"I\u0027m sorry, Elvett. It\u0027s like this. What we\u0027re doing now can be more important to everyone in the Galaxy than the question of whether Arcadia is safe. At least, to everyone but Arcadia and myself, and I\u0027m willing to go along with the majority. How big would the Resonator be?\" \\n\\n \\n\\n Semic looked doubtful, \"I don\u0027t know. You can find it somewheres in the catalogues.\" \\n\\n \\n\\n \"About how big. A ton? A pound? A block long?\" \\n\\n \\n\\n \"Oh, I thought you meant exactly. It\u0027s a little jigger.\" He indicated the first joint of his thumb. \"About that.\" \\n\\n \\n\\n \"All right, can you do something like this?\" He sketched rapidly on the pad he held in his lap, then passed it over to the old physicist, who peered at it doubtfully, then chuckled. \\n\\n \\n\\n \"Y\u0027know, the brain gets calcified when you get as old as I am. What are you trying to do?\" \\n\\n \\n\\n Darell hesitated. He longed desperately, at the moment, for the physical knowledge locked in the other\u0027s brain, so that he need not put his thought into words. But the longing was useless, and he explained. \\n\\n \\n\\n Semic was shaking his head. \"You\u0027d need hyper-relays. The only things that would work fast enough. A thundering lot of them.\" \\n\\n \\n\\n \"But it can be built?\" \\n\\n \\n\\n \"Well, sure.\" \\n\\n \\n\\n \"Can you get all the parts? I mean, without causing comment? In line with your general work.\" \\n\\n \\n\\n Semic lifted his upper lip. \"Can\u0027t get fifty hyper-relays? I wouldn\u0027t use that many in my whole life.\" \\n\\n \\n\\n \"We\u0027re on a defense project, now. Can\u0027t you think of something harmless that would use them? We\u0027ve got the money.\" \\n\\n \\n\\n \"Hm-mmm. Maybe I can think of something.\" \\n\\n \\n\\n \"How small can you make the whole gadget?\" \\n\\n \\n\\n \"Hyper-relays can be had micro-size ... wiring ... tubes ?Space, you\u0027ve got a few hundred circuits there.\" \\n\\n \\n\\n \"I know. How big?\" \\n\\n \\n\\n Semic indicated with his hands. \\n\\n \\n\\n \"Too big,\" said Darell. \"I\u0027ve got to swing it from my belt\" \\n\\n \\n\\n Slowly, he was crumpling his sketch into a tight ball. When it was a hard, yellow grape, he dropped it into the ash tray and it was gone with the tiny white flare of molecular decomposition. \\n\\n \\n\\n He said, \"Who\u0027s at your door?\" \\n\\n \\n\\n Semic leaned over his desk to the little milky screen above the door signal. He said, \"The young fellow, Anthor. Someone with him, too.\" \\n\\n \\n\\n Darell scraped his chair back. \"Nothing about this, Semic, to the others yet. It\u0027s deadly knowledge, if they find out, and two lives are enough to risk.\" \\n\\n \\n\\n Pelleas Anthor was a pulsing vortex of activity in Semic\u0027s office, which, somehow, managed to partake of the age of its occupant. In the slow turgor of the quiet room, the loose, summery sleeves of Anthor\u0027s tunic seemed still a-quiver with the outer breezes. \\n\\n \\n\\n He said, \"Dr. Darell, Dr. Semic ?Orum Dirige.\" \\n\\n \\n\\n The other man was tall. A long straight nose that lent his thin face a saturnine appearance. Dr. Darell held out a hand. \\n\\n \\n\\n Anthor smiled slightly. \"Police Lieutenant Dirige,\" he amplified. Then, significantly, \"Of Kalgan.\" \\n\\n \\n\\n And Darell turned to stare with force at the young man. \"Police Lieutenant Dirige of Kalgan,\" he repeated, distinctly. \"And you bring him here. Why?\" \\n\\n \\n\\n \"Because he was the last man on Kalgan to see your daughter. Hold, man.\" \\n\\n \\n\\n Anthor\u0027s look of triumph was suddenly one of concern, and he was between the two, struggling violently with Darell. Slowly, and not gently, he forced the older man back into the chair. \\n\\n \\n\\n \"What are you trying to do?\" Anthor brushed a lock of brown hair from his forehead, tossed a hip lightly upon the desk, and swung a leg, thoughtfully. \"I thought I was bringing you good news.\" \\n\\n \\n\\n Darell addressed the policeman directly, \"What does he mean by calling you the last man to see my daughter? Is my daughter dead? Please tell me without preliminary.\" His face was white with apprehension. \\n\\n \\n\\n Lieutenant Dirige said expressionlessly, \"慙ast man on Kalgan\u0027 was the phrase. She\u0027s not on Kalgan now. I have no knowledge past that.\" \\n\\n \\n\\n \"Here,\" broke in Anthor, \"let me put it straight. Sorry if I overplayed the drama a bit, Doc. You\u0027re so inhuman about this, I forget you have feelings. In the first place, Lieutenant Dirige is one of us. He was born on Kalgan, but his father was a Foundation man brought to that planet in the service of the Mule. I answer for the lieutenant\u0027s loyalty to the Foundation. \\n\\n \\n\\n \"Now I was in touch with him the day after we stopped getting the daily report from Munn? \\n\\n \\n\\n \"Why?\" broke in Darell, fiercely. \"I thought it was quite decided that we were not to make a move in the matter. You were risking their lives and ours.\" \\n\\n \\n\\n \"Because,\" was the equally fierce retort, \"I\u0027ve been involved in this game for longer than you. Because I know of certain contacts on Kalgan of which you know nothing. Because I act from deeper knowledge, do you understand?\" \\n\\n \\n\\n \"I think you\u0027re completely mad.\" \\n\\n \\n\\n \"Will you listen?\" \\n\\n \\n\\n A pause, and Darell\u0027s eyes dropped. \\n\\n \\n\\n Anthor\u0027s lips quirked into a half smile, \"All right, Doc. Give me a few minutes. Tell him, Dirige.\" \\n\\n \\n\\n Dirige spoke easily: \"As far as I know, Dr. Darell, your daughter is at Trantor. At least, she had a ticket to Trantor at the Eastern Spaceport. She was with a Trading Representative from that planet who claimed she was his niece. Your daughter seems to have a queer collection of relatives, doctor. That was the second uncle she had in a period of two weeks, eh? The Trantorian even tried to bribe me ?probably thinks that\u0027s why they got away.\" He smiled grimly at the thought. \\n\\n \\n\\n \"How was she?\" \\n\\n \\n\\n \"Unharmed, as far as I could see. Frightened. I don\u0027t blame her for that. The whole department was after her. I still don\u0027t know why.\" \\n\\n \\n\\n Darell drew a breath for what seemed the first time in several minutes. He was conscious of the trembling of his hands and controlled them with an effort. \"Then she\u0027s all right. This Trading Representative, who was he? Go back to him. What part does he play in it?\" \\n\\n \\n\\n \"I don\u0027t know. Do you know anything about Trantor?\" \\n\\n \\n\\n \"I lived there once.\" \\n\\n \\n\\n \"It\u0027s an agricultural world, now. Exports animal fodder and grains, mostly. High quality! They sell them all over the Galaxy. There are a dozen or two farm co-operatives on the planet and each has its representatives overseas. Shrewd sons of guns, too?I knew this one\u0027s record. He\u0027d been on Kalgan before, usually with his wife. Perfectly honest. Perfectly harmless.\" \\n\\n \\n\\n \"Um-mmm,\" said Anthor. \"Arcadia was born in Trantor, wasn\u0027t she, Doc?\" \\n\\n \\n\\n Darell nodded. \\n\\n \\n\\n \"It hangs together, you see. She wanted to go away ?quickly and far ?and Trantor would suggest itself. Don\u0027t you think so?\" \\n\\n \\n\\n Darell said: \"Why not back here?\" \\n\\n \\n\\n \"Perhaps she was being pursued and felt that she had to double off in a new angle, eh?\u0027 \\n\\n \\n\\n Dr. Darell lacked the heart to question further. Well, then, let her be safe on Trantor, or as safe as one could be anywhere in this dark and horrible Galaxy. He groped toward the door, felt Anthor\u0027s light touch on his sleeve, and stopped, but did not turn. \\n\\n \\n\\n \"Mind if I go home with you, Doc?\" \\n\\n \\n\\n \"You\u0027re welcome,\" was the automatic response. \\n\\n \\n\\n By evening, the exteriormost reaches of Dr. Darell\u0027s personality, the ones that made immediate contact with other people had solidified once more. He had refused to eat his evening meal and had, instead, with feverish insistence, returned to the inchwise advance into the intricate mathematics of encephalographic analysis. \\n\\n \\n\\n It was not till nearly midnight, that he entered the living room again. \\n\\n \\n\\n Pelleas Anthor was still there, twiddling at the controls of the video. The footsteps behind him caused him to glance over his shoulder. \\n\\n \\n\\n \"Hi. Aren\u0027t you in bed yet? I\u0027ve been spending hours on the video, trying to get something other than bulletins. It seems the F.S. Hober Mallow is delayed in course and hasn\u0027t been heard from\" \\n\\n \\n\\n \"Really? What do they suspect?\" \\n\\n \\n\\n \"What do you think? Kalganian skulduggery. There are reports that Kalganian vessels were sighted in the general space sector in which the Hober Mallow was last heard from?\" \\n\\n \\n\\n Darell shrugged, and Anthor rubbed his forehead doubtfully. \\n\\n \\n\\n \"Look doc,\" he said, \"why don\u0027t you go to Trantor?\" \\n\\n \\n\\n \"Why should I?\" \\n\\n \\n\\n \"Because \"You\u0027re no good to us here. You\u0027re not yourself. You can\u0027t be. And you could accomplish a purpose by going to Trantor, too. The old Imperial Library with the complete records of the Proceedings of the Seldon Commission are there? \\n\\n \\n\\n \"No! The Library has been picked clean and it hasn\u0027t helped anyone.\" \\n\\n \\n\\n \"It helped Ebling Mis once.\" \\n\\n \\n\\n \"How do you know? Yes, he said he found the Second Foundation, and my mother killed him five seconds later as the only way to keep him from unwittingly revealing its location to the Mule. But in doing so, she also, you realize, made it impossible ever to tell whether Mis really did know the location. After all, no one else has ever been able to deduce the truth from those records.\" \\n\\n \\n\\n \"Ebling Mis, if you\u0027ll remember, was working under the driving impetus of the Mule\u0027s mind.\" \\n\\n \\n\\n \"I know that, too, but Mis\u0027 mind was, by that very token, in an abnormal state. Do you and I know anything about the properties of a mind under the emotional control of another; about its abilities and shortcomings? In any case, I will not go to Trantor.\" \\n\\n \\n\\n Anthor frowned, \"Well, why the vehemence? I merely suggested it as ?well, by Space, I don\u0027t understand you. You look ten years older. You\u0027re obviously having a hellish time of it. You\u0027re not doing anything of value here. If I were you, I\u0027d go and get the girl.\" \\n\\n \\n\\n \"Exactly! It\u0027s what I want to do, too. That\u0027s why I won\u0027t do it. Look, Anthor, and try to understand. You\u0027re playing ?we\u0027re both playing ?with something completely beyond our powers to fight. In cold blood, if you have any, you know that, whatever you may think in your moments of quixoticism. \\n\\n \\n\\n \"For fifty years, we\u0027ve known that the Second Foundation is the real descendent and pupil of Seldonian mathematics. What that means, and you know that, too, is that nothing in the Galaxy happens which does not play a part in their reckoning. To us, all life is a series of accidents, to be met with by improvisations To them, all life is purposive and should be met by precalculation. \\n\\n \\n\\n \"But they have their weakness. Their work is statistical and only the mass action of humanity is truly inevitable. Now how I play a part, as an individual, in the foreseen course of history, I don\u0027t know. Perhaps I have no definite part, since the Plan leaves individuals to indeterminacy and free will. But I am important and they ?they, you understand ?may at least have calculated my probable reaction. So I distrust, my impulses, my desires, my probable reactions. \\n\\n \\n\\n \"I would rather present them with an improbable reaction. I will stay here, despite the fact that I yearn very desperately to leave. \"No! Because I yearn very desperately to leave.\" \\n\\n \\n\\n The younger man smiled sourly. \"You don\u0027t know your own mind as well as they might. Suppose that ?knowing you ?they might count on what you think, merely think, is the improbable reaction, simply by knowing in advance what your line of reasoning would be.\" \\n\\n \\n\\n \"In that case, there is no escape. For if I follow the reasoning you have just outlined and go to Trantor, they may have foreseen that, too. There is an endless cycle of double-ddddddddddble-dddddd-crosses. No matter how far I follow that cycle, I can only either go or stay. The intricate act of luring my daughter halfway across the Galaxy cannot be meant to make me stay where I am, since I would most certainly have stayed if they had done nothing. It can only be to make me move, and so I will stay. \\n\\n \\n\\n \"And besides, Anthor, not everything bears the breath of the Second Foundation; not all events are the results of their puppeting. They may have had nothing to do with Arcadia\u0027s leave-taking, and she may be safe on Trantor when all the rest of us are dead.\" \\n\\n \\n\\n \"No,\" said Anthor, sharply, \"now you are off the track.\" \\n\\n \\n\\n \"You have an alternative interpretation?\" \\n\\n \\n\\n \"I have ?if you抣l listen.\" \\n\\n \\n\\n \"Oh, go ahead. I don\u0027t lack patience.\" \\n\\n \\n\\n \"Well, then ?how well do you know your own daughter?\" \\n\\n \\n\\n \"How well can any individual know any other? Obviously, my knowledge is inadequate.\" \\n\\n \\n\\n \"So is mine on that basis, perhaps even more so ?but at least, I viewed her with fresh eyes. Item one: She is a ferocious little romantic, the only child of an ivory-tower academician, growing up in an unreal world of video and book-film adventure. She lives in a weird self-constructed fantasy of espionage and intrigue. Item two: She\u0027s intelligent about it; intelligent enough to outwit us, at any rate. She planned carefully to overhear our first conference and succeeded. She planned carefully to go to Kalgan with Munn and succeeded. Item three: She has an unholy hero-worship of her grandmother ?your mother ?who defeated the Mule. \\n\\n \\n\\n \"I\u0027m right so far, I think? All right, then. Now, unlike you, I\u0027ve received a complete report from Lieutenant Dirige and, in addition, my sources of information on Kalgan are rather complete, and all sources check. We know, for instance, that Homir Munn, in conference with the Lord of Kalgan was refused admission to the Mule\u0027s Palace, and that this refusal was suddenly abrogated after Arcadia had spoken to Lady Callia, the First Citizen\u0027s very good friend.\" \\n\\n \\n\\n Darell interrupted. \"And how do you know all this?\" \\n\\n \\n\\n \"For one thing, Munn was interviewed by Dirige as part of the police campaign to locate Arcadia. Naturally, we have a complete transcript of the questions and answers. \\n\\n \\n\\n \"And take Lady Callia herself. It is rumored that she has lost Stettin\u0027s interest, but the rumor isn\u0027t borne out by facts. She not only remains unreplaced; is not only able to mediate the lord\u0027s refusal to Munn into an acceptance; but can even engineer Arcadia\u0027s escape openly. Why, a dozen of the soldiers about Stettin\u0027s executive mansion testified that they were seen together on the last evening. Yet she remains unpunished. This despite the fact that Arcadia was searched for with every appearance of diligence.\" \\n\\n \\n\\n \"But what is your conclusion from all this torrent of ill-connection?\" \\n\\n \\n\\n \"That Arcadia\u0027s escape was arranged.\" \\n\\n \\n\\n \"As I said.\" \\n\\n \\n\\n \"With this addition. That Arcadia must have known it was arranged; that Arcadia, the bright little girl who saw cabals everywhere, saw this one and followed your own type of reasoning. They wanted her to return to the Foundation, and so she went to Trantor, instead. But why Trantor?\" \\n\\n \\n\\n \"Well, why?\" \\n\\n \\n\\n \"Because that is where Bayta, her idolized grandmother, escaped when she was in flight. Consciously or unconsciously, Arcadia imitated that. I wonder, then, if Arcadia was fleeing the same enemy.\" \\n\\n \\n\\n \"The Mule?\" asked Darell with polite sarcasm. \\n\\n \\n\\n \"Of course not. I mean, by the enemy, a mentality that she could not fight. She was running from the Second Foundation, or such influence thereof as could be found on Kalgan.\" \\n\\n \\n\\n \"What influence is this you speak of?\" \\n\\n \\n\\n \"Do you expect Kalgan to be immune from that ubiquitous menace? We both have come to the conclusion, somehow, that Arcadia\u0027s escape was arranged. Right? She was searched for and found, but deliberately allowed to slip away by Dirige. By Dirige, do you understand? But how was that? Because he was our man. But how did they know that? Were they counting on him to be a traitor? Eh, doc?\" \\n\\n \\n\\n \"Now you\u0027re saying that they honestly meant to recapture her. Frankly, you\u0027re tiring me a bit, Anthor. Finish your say; I want to go to bed.\" \\n\\n \\n\\n \"My say is quickly finished.\" Anthor reached for a small group of photo-records in his inner pocket. It was the familiar wigglings of the encephalograph. \"Dirige\u0027s brainwaves,\" Anthor said, casually, \"taken since he returned.\" \\n\\n \\n\\n It was quite visible to Darell\u0027s naked eye, and his face was gray when he looked up. \"He is Controlled.\" \\n\\n \\n\\n \"Exactly. He allowed Arcadia to escape not because he was our man but because he was the Second Foundation\u0027s.\" \\n\\n \\n\\n \"Even after he knew she was going to Trantor, and not to Terminus.\" \\n\\n \\n\\n Anthor shrugged. \"He had been geared to let her go. There was no way he could modify that. He was only a tool, you see. It was just that Arcadia followed the least probable course, and is probably safe. Or at least safe until such time as the Second Foundation can modify the plans to take into account this changed state of affairs? \\n\\n \\n\\n He paused. The little signal light on the video set was flashing. On an independent circuit, it signified the presence of emergency news. Darell saw it, too, and with the mechanical movement of long habit turned on the video. They broke in upon the middle of a sentence but before its completion, they knew that the Hober Mallow, or the wreck thereof, had been found and that, for the first time in nearly half a century, the Foundation was again at war. \\n\\n \\n\\n Anthor\u0027s jaw was set in a hard line. \"All right, doc, you heard that. Kalgan has attacked; and Kalgan is under the control of the Second Foundation. Will you follow your daughter\u0027s lead and move to Trantor?\" \\n\\n \\n\\n \"No. I will risk it. Here.\" \\n\\n \\n\\n \"Dr. Darell. You are not as intelligent as your daughter. I wonder how far you can be trusted.\" His long level stare held Darell for a moment, and then without a word, he left. \\n\\n \\n\\n And Darell was left in uncertainty and ?almost ?despair. \\n\\n \\n\\n Unheeded, the video was a medley of excited sight-sound, as it described in nervous detail the first hour of the war between Kalgan and the Foundation. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1597/47464.html","bookId":8,"book":{"id":8,"title":"基地系列 Second Foundation 第二基地","description":"简介： 《第二基地》（Second Foundation），是美国科幻作家艾萨克阿西莫夫出版于1953年的科幻小说中篇集，基地三部曲的第三部。本书讲述了在骡攻占基地之后，骡和第一基地的遗民寻找谜一般的第二基地的传奇事迹，共由两个中篇故事组成。...","cover":"http://novel.tingroom.com/file/upload/201607/07/10-17-36-95-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/kehuan/1597","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
