{"id":27373,"no":18,"title":"CHAPTER XVIII. IN GOLDEN SEAS.","content":"The following days passed uneventfully. The ships were now running into golden seas where the sun shone down hotly. Awnings were rigged and “white uniforms and bare feet” was the order sent aloft on the flag-ship for the instruction of the rest of the squadron. One afternoon the lookout sang out in a voice that carried fore and aft the always welcome cry to a sailor:— “Land, ho!” “Where away?” came from the bridge as the Jackies craned their necks and gazed forward. “Two points off the starboard bow!” Glasses were leveled at the purple patch lying like a tiny cloud on the far horizon. “What land can it be?” wondered Ned, shading[176] his eyes, but from the low elevation of the forecastle it was hard to see anything but a faint blue line. “Must be Oahu,” responded a blue-jacket standing beside him. “One of the Hawaiian group?” “Yes; the island on which Honolulu, the principal port of the islands, is located.” Ned and Herc exchanged delighted glances. It was like coming toward a land of their dreams. As the battleships plowed onward, the land rose higher out of the sea. Soon they could see towering mountain peaks, and gradually, as they drew nearer, all the details of the green hillsides clothed with tropical verdure and the numerous plantations that dotted them came into range. “Well, we’re going to see things now,” declared Ned enthusiastically, his eyes shining. “Are there savages down there?” inquired Herc. “No; not in the Hawaiian group,” responded a[177] ship-mate. “There are more Chinese and Japs on the islands, on Oahu anyhow, than there are Kanakas.” “Crackers!” exclaimed Herc. “Is that what they call the natives?” “I said Kanakas, Red Head,” laughed the sailor; “that’s the name given the natives.” “Wonder if we’ll make port in Honolulu?” spoke Ned. “The old man hasn’t taken me into his confidence concerning that yet,” grinned Herc. “Well, you can’t blame him for that,” laughed a sailor, and there was a general laugh at Herc’s expense. “I heard a rumor before we left ’Frisco that there was plague on Oahu and that the port was quarantined,” interjected a bos’un’s-mate, who was in the group. “In that case, we won’t land there?” asked Ned. “No. We may go on to some other port. I imagine that after the banging about we had in[178] that storm, the old man will want to hitch up to some post or other and give the ship a currying down.” “You talk as if the ship were a stable,” cried Herc. “I suppose that’s how the beef kegs got the name of harness casks.” “No; I guess Hicks talks that way because there are so many kickers on board,” chuckled Ned. “Not to mention a few donkeys,” Herc shot back at him. “Well, you ought to know, Red Head,” spoke the bos’un’s-mate, and there was another laugh. “I hope we get a chance to take a run ashore,” said Ned, “but if we are put to cleaning ship, I guess there’s not much chance of that.” “Oh, well, Red Head loves cleaning ship, don’t you?” “About as much as you like that stuff the Sawbones (doctor) serves out,” retorted Herc with a grin. [179] “There’s Diamond Head!” came a shout some time later, during which interval the fleet in a long orderly line had been steaming by rugged shores of surpassing tropic beauty. “I see the diamonds!” yelled Herc, calling attention to some bright patches of mica that glittered in the sunlight. The masts of shipping and the black smoke of steamers began to show in the distance. “Honolulu!” cried a sailor. “I hope we stop there; it’s a fine city.” Majestically the squadron steamed into the harbor of the principal city of the Hawaiian group. The boys excitedly admired its site at the foot of towering hills that were covered with luxuriant tropical growth, amidst which they could see tall palms with feathery tops. “Me for the cocoanuts,” cried Herc as he gazed. “You’d have to be more of a monkey than you are to climb those trees,” chuckled somebody. [180] “I’ll let you climb for me then, Hughes,” came back Herc as quick as a flash, and the laugh was on the other fellow. The squadron came to anchor off the harbor and fired a salute which was returned from the shore. Flags could be seen flying everywhere. “They’re glad to see us,” chorused the Jackies delightedly. “I’ll bet we have great old times ashore, regular field day.” As the great anchors roared downward, on the stern of each battleship appeared Old Glory,—men-of-war not displaying their ensigns at sea. Speculation was rife throughout the fleet as to whether the rumor concerning the plague was correct. The rear-admiral and Commander Dunham went ashore and on their return all doubt was set at rest. “Up anchor!” was the order flashed from ship to ship. “We’re not going to stop!” groaned the Jackies.[181] “Good-bye, Honolulu, much obliged to have met you.” Both Ned and Herc felt their full share of the general disappointment, but their gloom was brightened when the news ran through the ship that the squadron was headed for Hilo on the island of Hawaii, the largest of the group and in some respects the most interesting. Early the next morning, after they had steamed among the islands all night, the lofty crest of Kilauea, the famous active volcano, was sighted. It was smoking away in a manner that delighted the Jackies. “Old Dame Nature’s chimney is on fire,” said Herc. “I wish we could see a regular blow-up.” “I guess if we did you’d change your mind,” said an old sailor. “I was at Apia when they had that big earthquake and tidal wave, and I don’t want to go through another volcanic eruption. Our ship was landed two miles inland in a cocoanut grove, and for all I know she’s there yet.” “Here we go into Hilo Bay,” came a cry not[182] long after, and the long line of ships swung frowningly around a point and into a beautiful natural harbor, faced by a city of white and gray houses and hemmed in by a horseshoe of hills. But the Jackies had no eyes but for the volcano, whose mighty peak, ceaselessly smoking, towered four thousand feet above the city. “Isn’t it wonderful!” exclaimed Ned, in a tone that was almost awe. “They say that at night you can sometimes see a red glow from it on the sky.” “Like Coney Island,” said Herc irreverently. “It’s one of the grandest sights I ever saw,” retorted Ned seriously. “Give me the Catskills any day,” snorted Herc, referring to the place from which both the lads came. “As for that smoke, we saw almost as much when granpop was curing hams.” “Herc, you have no more soul than an oyster.” “Thanks, but I’ve got a good appetite, so I’m not worrying.” [183] “I’ll tell you what,” Herc resumed a few minutes later, “I’d like to knock the block off that old mountain with one of our thirteen-inch guns. I bet we’d see some fireworks worth while then.” “Well, if you did you’d have to show better marksmanship than you have up to date.” “How can I get to be a good shot when we don’t fire the big guns once in a blue moon?” “Well, you’ve had lots of small caliber drill and that’s the same thing. Besides, every time we have big gun practice the expense runs into hundreds of thousands of dollars.” “Look! Look, there’s a war-ship!” cried Ned excitedly. “So it is. What’s that flag? I know, it’s a bloomin’ Britisher.” The British man-o’-war, a black, grim-looking sea-fighter, lay just inside the harbor. As the American squadron came sweeping in from the sea, her guns began to boom. All work was suspended for the moment, and then came the orders[184] to return the salute. Flag after flag was dipped as the British battleship’s ensign, with its red cross, was run up and down. Bands crashed and blared the national anthem of both nations, Jackies cheered and waved and the guns boomed and roared deafeningly. As the fleet came to anchor, a swift launch put off from the side of the English ship and the commander of the craft, the Indomitable, in a cocked hat and ablaze with gold lace, came on board the Manhattan to pay an official call on the commander of the Yankee squadron of world cruisers. Great ceremony marked his coming. The gangway was manned and the officers all donned full uniform. The band played “God Save the King,” and the amount of bowing and ceremonious hand-shaking and saluting that was gone through caused Herc to remark to Ned later on that he felt as if he’d been mixing up with a book of etiquette. At the English commander’s departure[185] the same ceremony took place. The boys had had their first introduction to the strict laws of ceremony which govern an interchange of courtesies between the commanders of fighting ships of different friendly nations. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3332/91218.html","bookId":359,"book":{"id":359,"title":"The Dreadnought Boys\u0027 World Cruise","description":"简介： Dont be any thicker than you have to, laughed Ned Strong. The Golden Gate is the poetical Western name for the narrow entrance to San Francisco harbor, through which we passed on the Manhattan two days ago. It was so called on account of the Argonaut...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3332","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
