{"id":27363,"no":8,"title":"CHAPTER VIII. “MY ADDRESS IS THE ‘MANHATTAN’.”","content":"Ned sprang into the hallway, locked the solid, iron-studded door behind him and flung the key away. “Bottled and corked!” he chuckled as he sped on toward the room in which he had been made captive by Schmidt’s gang. He stepped into the place and found to his delight that the naval men he wanted were still there. A few of the loungers were likewise seated about. At Ned’s sudden appearance the men-o’-war’s-men leaped up as if they had been shot. Among them was young Childs. He could not meet Ned’s eye but hung his head as the gunner’s-mate made his unexpected entrance. Ned’s eyes burned as they swept the room. “Schmidt and his friends are prisoners on the[79] roof of that outer room,” he announced. “Within half an hour they will be in the hands of the police. Outside this place I have a patrol. Are you men willing to surrender, or shall I have to call in the picket to take you back shackled to the ship?” There was an instant’s hesitation while the men stared at the calm-spoken Dreadnought Boy as if they could hardly believe their eyes. Then old Harness Cask spoke up: “We’ll go with you, sir. Will you make it easy for us when we get on board?” “I’m not committing myself,” spoke Ned grimly. “Forward march!” Like lambs the stragglers formed in twos, looking foolish and crestfallen. Out they marched with Ned behind them, while the loafers in the place cowered in corners, meditating instant escape as soon as Ned and his prisoners vanished. Before they reached the street, Ned blew his whistle and sounded the shrill summons to his[80] patrol which he had notified them would be the signal for them to join him. As they appeared at the top of the steps, re?nforced now by the two men who had taken Sharp and Manners to the steamer, Herc shouted out: “It’s all right, Ned. We’re coming to your rescue. Hold fast, old fellow!” “All right, boys,” hailed Ned; “it’s all over but the shouting. Just take these fellows in charge and march them down to the steamer and wait there for me. I’ve a little more work to do yet.” To say that Ned’s patrol was astonished as they saw the sheepish captives file out of the Fair Wind to the street, would be to put it mildly. As Herc might have said, they were completely flabbergasted. When Ned briefly rehearsed the circumstances of the capture, modestly keeping himself in the background, their enthusiasm knew no bounds. The rueful, woebegone captives were marched off to the steamer, while Ned hastened to a telephone.[81] He got Police Headquarters and told the official in charge about the prisoners on the roof of the “Fair Wind.” “I’ll send a patrol wagon right down,” declared the official. “Better send a big bunch of men, too. They’re a bad lot,” said Ned. “I know all about them. We’ve been trying for a long time to land Schmidt. Now, thanks to you, we’ve got him with the goods on.” “I reckon you have,” rejoined Ned with a grin. “By the way, what’s your name and address?” came the voice at the other end of the wire. “Ned Strong is my name, and my address is the Dreadnought Manhattan, at anchor off Goat Island in the harbor.” A marked note of surprise was in the official’s voice as he exclaimed: “Strong, did you say?” “Yes, sir!” “Well, we’re looking for you!” [82] “Looking for me?” “That’s right. We’re very anxious to get hands on you.” “Gracious! What for?” “Never mind. Can we get you on board the ship?” “Of course. But what does this mean? Why do the authorities want to see me?” “That I am not at liberty to tell you. Will you summon the man on post and tell him to guard the ‘Fair Wind’ till re?nforcements arrive?” Ned, sorely puzzled, promised to do so, and soon discovered the patrolman in question. He explained the case to him and then hurried down to the steamer. As he went, he turned the situation over and over in his mind. What could he have done that the police wanted to see him? And then they were coming out to the ship, too! Even if it was some trumped up accusation, Ned knew that he would have an awkward time of it. Had he had the leisure he would have gone to[83] Headquarters himself and demanded some explanation. But his duty was to hasten back to the Manhattan with the stragglers at once. The knowledge that the police wanted to see him even though he was conscious of having committed no offence, worried Ned considerably. The very vagueness of the information that had been vouchsafed to him made it worse. However, when he reached the steamer, Ned found plenty to occupy him in the disposal of his prisoners. After that no time was lost in getting under way. Ned sat in the stern, busied with his own reflections. He had had a lively time but he had acquitted himself to his own satisfaction and carried out his orders promptly and faithfully. Had it not been for that mysterious police message, there would not have been a cloud in his sky. The little steamer made quick time between the landing-stage and the grim, gray dreadnought.[84] Behind her, reaching as far as the Golden Gate, spread a long line of Uncle Sam’s slate-colored sea-fighters swinging at anchor. What a fine picture the array of battleships presented! Strings of bright-colored bunting depending from their signal halliards relieved the sinister monotone of battle color, and from bridge to bridge the bright scarlet of the “wig-wag” flags could be seen cutting circles and arcs as from ship to ship flashed news and orders. It was an old picture to Ned, but it thrilled him and inspired him just as much there in San Francisco Bay as it had on that day that seemed so long ago when he and Herc stood in Riverside Park in New York, raw recruits, and gazed their first upon the huge fighting machine of which they were to become parts. The steamer ran around to the port gangway and made fast. The delinquents, a crestfallen unhappy-looking parade, were marched on deck with the patrol guarding them in on each side.[85] Ned couldn’t help feeling a quick flush of pride as he noticed the astonished glance of the officer of the deck when he saw Ned’s flock of black sheep that had been so speedily rounded up. “All present, sir!” said Ned, bringing his heels together with a smart click, and saluting the functionary, who was distinguished by carrying a telescope slung over his shoulder. “What, you got them all?” “Aye, aye, sir!” “Take them before the master-at-arms. You will appear at the mast at a time appointed by the commander and give your evidence against them.” “Aye, aye, sir!” “Carry on!” The deck officer turned away and Ned and his patrol marched their unhappy band of prisoners before the master-at-arms, who promptly assigned them to the dreaded brig till such time as their trials at the mast should be ordered. [86] “And now for some food,” exclaimed Herc; “I’m half famished.” “Well, I could look a square meal in the face without feeling embarrassed,” confessed Ned with a laugh. “Well, if ever a lad deserved it, you’re the one,” declared old Simpkins admiringly. “I guess we’ll have to call you ‘Ned the Giant Killer,’ after this.” “Not as bad as that, I hope,” laughed Ned good-naturedly. “Humph,” snorted Herc, “I reckon ‘Jack the Giant Killer’ wouldn’t be one, two, three beside Ned Strong. Eight at one fell swoop, not to mention the party marooned on the roof, is a pretty good day’s work. By the way, what was the name of that place?” “‘The Fair Wind.’ Why?” “They ought to change its name to ‘Look Out for Squalls.’” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3332/91208.html","bookId":359,"book":{"id":359,"title":"The Dreadnought Boys\u0027 World Cruise","description":"简介： Dont be any thicker than you have to, laughed Ned Strong. The Golden Gate is the poetical Western name for the narrow entrance to San Francisco harbor, through which we passed on the Manhattan two days ago. It was so called on account of the Argonaut...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3332","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
