{"id":24367,"no":7,"title":"V. JOYS AND PASSIONS.","content":"My brother, when thou hast a virtue, and it is thine own virtue, thou hast it in common with no one. \n \n To be sure, thou wouldst call it by name and caress it; thou wouldst pull its ears and amuse thyself with it. \n \n And lo! Then hast thou its name in common with the people, and hast become one of the people and the herd with thy virtue! \n \n Better for thee to say: “Ineffable is it, and nameless, that which is pain and sweetness to my soul, and also the hunger of my bowels.” \n \n Let thy virtue be too high for the familiarity of names, and if thou must speak of it, be not ashamed to stammer about it. \n \n Thus speak and stammer: “That is MY good, that do I love, thus doth it please me entirely, thus only do I desire the good. \n \n Not as the law of a God do I desire it, not as a human law or a human need do I desire it; it is not to be a guide-post for me to superearths and paradises. \n \n An earthly virtue is it which I love: little prudence is therein, and the least everyday wisdom. \n \n But that bird built its nest beside me: therefore, I love and cherish it—now sitteth it beside me on its golden eggs.” \n \n Thus shouldst thou stammer, and praise thy virtue. \n \n Once hadst thou passions and calledst them evil. But now hast thou only thy virtues: they grew out of thy passions. \n \n Thou implantedst thy highest aim into the heart of those passions: then became they thy virtues and joys. \n \n And though thou wert of the race of the hot-tempered, or of the voluptuous, or of the fanatical, or the vindictive; \n \n All thy passions in the end became virtues, and all thy devils angels. \n \n Once hadst thou wild dogs in thy cellar: but they changed at last into birds and charming songstresses. \n \n Out of thy poisons brewedst thou balsam for thyself; thy cow, affliction, milkedst thou—now drinketh thou the sweet milk of her udder. \n \n And nothing evil groweth in thee any longer, unless it be the evil that groweth out of the conflict of thy virtues. \n \n My brother, if thou be fortunate, then wilt thou have one virtue and no more: thus goest thou easier over the bridge. \n \n Illustrious is it to have many virtues, but a hard lot; and many a one hath gone into the wilderness and killed himself, because he was weary of being the battle and battlefield of virtues. \n \n My brother, are war and battle evil? Necessary, however, is the evil; necessary are the envy and the distrust and the back-biting among the virtues. \n \n Lo! how each of thy virtues is covetous of the highest place; it wanteth thy whole spirit to be ITS herald, it wanteth thy whole power, in wrath, hatred, and love. \n \n Jealous is every virtue of the others, and a dreadful thing is jealousy. Even virtues may succumb by jealousy. \n \n He whom the flame of jealousy encompasseth, turneth at last, like the scorpion, the poisoned sting against himself. \n \n Ah! my brother, hast thou never seen a virtue backbite and stab itself? \n \n Man is something that hath to be surpassed: and therefore shalt thou love thy virtues,—for thou wilt succumb by them.— \n \n Thus spake Zarathustra. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2158/60981.html","bookId":445,"book":{"id":445,"title":"Thus Spake Zarathustra","description":"简介： Zarathustra is my brothers most personal work; it is the history of his most individual experiences, of his friendships, ideals, raptures, bitterest disappointments and sorrows. Above it all, however, there soars, transfiguring it, the image of his g...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2158","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
