{"id":12992,"no":6,"title":"CHAPTER V THE CONSTABLE CALLS.","content":"NEXT morning we slept late, but when Mrs. Vernon and I finally awoke we heard no sounds in the kitchen. \\n\\n \\n\\n “I have a headache,” said Ethel. “That midnight supper didn’t agree with me.” \\n\\n \\n\\n “Why you didn’t eat anything.” \\n\\n \\n\\n “No, but I can’t sit up late and feel good for anything in the morning. I suppose Minerva feels the same as I do.” \\n\\n \\n\\n “Yes, but as she is paid to forget her feelings, I suppose she’ll get up and get breakfast.” \\n\\n \\n\\n “Do you mind calling her?” asked Ethel, and again donning my dressing gown I went to the foot of the stairs and called, \\n\\n \\n\\n “Minerva! Minerva, it’s half past eight o’clock.” \\n\\n \\n\\n No answer. \\n\\n \\n\\n I went up stairs and stood outside her door. \\n\\n \\n\\n “Minerva, it’s time to get up. I know you must be sleepy, but it’s half past eight.” \\n\\n \\n\\n “Mist. Vernon,” came a languid response, “I don’ feel like I could cook this morning, I’m so tired.” \\n\\n \\n\\n What was this? Was it insubordination? Perhaps it was, but I did not mean to recognise it as such. Who had prepared the midnight supper without a word? Minerva. Was I one to forget benefits conferred? No. Did I want to keep Minerva at all hazards? Yes. Was it wise to let Ethel know of the state of affairs? No. \\n\\n \\n\\n Therefore I came softly down the stairs and going out into the kitchen, I built a fire and then went to work as dexterously as I could to cook things for breakfast. I poured a cup of cold water on three cups of oatmeal flakes and set them to boil, and while I waited for the water to attend to business I got a book and read. Really, this cooking is no such hardship as I had supposed, thought I. I was not as quick as Minerva, for I was an hour getting the oatmeal to a point where it looked palatable, and I made some mistake of proportions in making the coffee, but I sliced the bread very well, indeed, and I set the table without nicking a plate, and at last I put a half dozen eggs into the water in the double boiler and went up stairs to announce breakfast. Ethel had fallen asleep. I woke her and told her that I believed breakfast was ready. Then I went down to my book again. \\n\\n \\n\\n Ethel can hurry upon occasion, and she was no time in coming down. But quick as she was, I was quicker, for I had the eggs on the table before she appeared, and when she came into the room we sat down together with never a suspicion on her part that Minerva had not prepared the breakfast. I felt the way I used to feel when I was a boy and used to do something a little beyond my supposed powers. My bosom swelled with pride as I reflected that every bit of the breakfast had been prepared by me. \\n\\n \\n\\n Ethel uncovered the oatmeal dish and then she said, rather irrelevantly, I thought, \\n\\n \\n\\n “What’s the matter with Minerva?” \\n\\n \\n\\n “Nothing, dear,” said I, reaching out my hand for my portion. \\n\\n \\n\\n Her only answer was to ring the bell. \\n\\n \\n\\n “—Er—I believe Minerva is upstairs,” said I. \\n\\n \\n\\n “What has she been doing to the oatmeal?” said Ethel, poking at it with her spoon, but not attempting to taste the stiff-looking mass. \\n\\n \\n\\n “Fact is, Ethel,” said I, “Minerva is a little upset by last night’s disturbance, and I cooked the breakfast.” \\n\\n \\n\\n “You mean you didn’t cook it,” said Ethel, with just a touch of sarcasm. \\n\\n \\n\\n “Well, what I didn’t do, I didn’t do for you. I thought you’d had enough of the kitchen, and if you disguise this with sugar and cream it will be all right.” \\n\\n \\n\\n But this was an exaggeration. We could not pretend to eat the gluey mass, so I said, \\n\\n \\n\\n “Well, anyhow, there are nice fresh eggs. It doesn’t take a great deal of skill to boil them.” \\n\\n \\n\\n “Did you use the three-minute glass,” said Ethel, as she helped me to two eggs and then took two herself. \\n\\n \\n\\n I told her that I didn’t know what she meant; that I used no glass at all, but had boiled them in the under part of the oatmeal boiler, as I had noticed Minerva do. \\n\\n \\n\\n “Yes, but how long?” asked Ethel, as she took up her knife and chipped the shell of one. \\n\\n \\n\\n “About an hour and a half,” said she, answering her own question. “You meant well, Philip, but you didn’t know. These are as hard as a rock and not yet cold. I hope the coffee is better.” \\n\\n \\n\\n Ethel is not usually so fault finding, but I laid it to her broken sleep, and said, \\n\\n \\n\\n “The bread is cut pretty well. And the butter is just as good as if Minerva had put it on the table herself.” \\n\\n \\n\\n “Yes, the bread and butter are quite a success, Phil, but this coffee—” \\n\\n \\n\\n “Mild?” said I, taking my cue from the color of it as she poured. \\n\\n \\n\\n “I should say so. It looks like a substitute for coffee.” \\n\\n \\n\\n “Then I guess I don’t care for any,” said I. “But anyhow, you didn’t have to do any of the preparing, and we’ll leave it for Minerva to wash the dishes.” \\n\\n \\n\\n I helped myself to milk and managed to eat an egg, but they are not very good when hot and hard, unless they are sliced and reposing on a bed of spinach. \\n\\n \\n\\n I began to feel a little hot myself that Minerva should have led me to this successful exposure of incompetence, and leaving the table I went up stairs and called out somewhat angrily, \\n\\n \\n\\n “Minerva, we’re all through breakfast and you’ll have to come right down and prepare lunch, as nothing has been fit to eat.” \\n\\n \\n\\n A snore was the only response that she gave, and I was glad she had not heard me. One cannot afford to be peremptory if one has but one string to one’s bow. I came down stairs again. \\n\\n \\n\\n Ethel was in the kitchen frying some eggs and preparing some more coffee. \\n\\n \\n\\n “Is she coming down?” asked she. \\n\\n \\n\\n “Er—no—she’s tired. But Ethel, I can’t have you getting breakfast. I’ve already got one, and although it wasn’t a success, we’d better make it do. You look tired out after the excitement of last night. Let’s eat some berries and drink a glass of milk and wait for lunch. Wasn’t that burglar funny last night?” \\n\\n \\n\\n “Philip, are you going to let Minerva stay in bed all day?” said Ethel. \\n\\n \\n\\n I sat down on the kitchen table and said, \\n\\n \\n\\n “Ethel, would you like to be waked up in the middle of the night and forced to prepare an extra meal? Minerva is a human being and she is tired. You’re a human being and you’re tired. Let us let Minerva spend this one day in bed taking the rest cure, and after we’ve eaten this second breakfast, which smells pretty good, we’ll spend the day out doors.” \\n\\n \\n\\n “But Minerva is insubordinate.” \\n\\n \\n\\n “Very well, let us call it that. Suppose we suppress her insubordination and she works for us all day and takes the evening train for New York, will the thought that we have suppressed insubordination in a cook get us a new servant? Insubordination in the city, where there are whole intelligence offices filled with girls looking for new places, is a thing that I can’t and won’t stand; but insubordination, with Mamie Logan sick with scarlet fever and no other girl in the world that I know of, is a thing to be coddled, as you might say. Call it weariness caused by over-service and it immediately becomes a thing that we can pardon. Do you want to pack up and go back to New York?” \\n\\n \\n\\n Ethel assured me that she did not. \\n\\n \\n\\n “Well, then, don’t let us talk any more about insubordination. We’ll eat what you set before us, asking no questions, and then we’ll go out for a long walk.” \\n\\n \\n\\n We went out for a long walk, and both of us succeeded by sheer will power in forgetting that Minerva existed. We made believe that we could live on the delicious air that blew so gently at us, and for two or three hours we wandered or sat still, or Ethel sketched and we were thoroughly happy. \\n\\n \\n\\n It was about noon when we returned to the house. We heard loud voices and stopped to listen. \\n\\n \\n\\n “I tell you he was a frien’ of Mist. Vernon’s,” we heard Minerva say. \\n\\n \\n\\n “Well, then, Mr. Vernon has a thief for a friend.” \\n\\n \\n\\n We exchanged meaning glances. Our friend of the night before had evidently been traced as far as our house. There was nothing to do but to go forward and accept the inevitable. \\n\\n \\n\\n I went into the kitchen, followed by Ethel. A large, determined looking man was sitting on a chair in the middle of the floor; by his side stood a strapping mulatto, and Minerva, stopped midway in her dishwashing and with something of sleepiness still in her eyes, was standing by the stove. \\n\\n \\n\\n “How are you?” This from me. \\n\\n \\n\\n “Good morning. My name is Collins, and I’m a constable. The Fayerweather’s house was robbed last night and the thief got away with the goods.” \\n\\n \\n\\n I assumed a look of great unconcern, but I felt that Minerva was devouring me with her eyes. \\n\\n \\n\\n “That’s bad,” said I. \\n\\n \\n\\n “Yes, it’s bad, but it might be worse. I find that he came as far as here, and your girl says that you entertained him with a midnight supper. Where is he now; hiding?” \\n\\n \\n\\n His tone was insolent, and my tone was correspondingly dignified. \\n\\n \\n\\n “Why, I haven’t the slightest idea where the thief that robbed the Fayerweather’s is now,” said I, wishing with all my heart that the constable was on his vacation at some pleasant summer resort, far, far away. \\n\\n \\n\\n “Minerva,” said I, trying to take the bull by the horns, “what makes you say that I entertained a thief last night?” \\n\\n \\n\\n “I didn’ say so, Mist. Vernon. This ge’man said that a man, now—robbed that house, an’ ast me if we had a mid—a midnight vis’ter; an’ I said no one but your frien’ that I cooked the om’let for; an’ he ast me how he looked, an’ I told him it couldn’ be him, because you an’ him was great frien’s, an’ I knowed you wasn’ no frien’s with a burglar.” \\n\\n \\n\\n “Hm,” said I, wondering why in thunderation I had been placed in such an unpleasant position as this, solely through my well-meant efforts to keep Minerva contented. \\n\\n \\n\\n “Did you entertain a friend here after midnight, last night?” asked the constable, who seemed a painfully direct sort of individual. \\n\\n \\n\\n “There was a man came here late last night, and we had a little chat together, and a—a little supper, you might call it.” \\n\\n \\n\\n I paused and looked at Ethel. She was the color of a carnation. \\n\\n \\n\\n “Go on,” said the constable. \\n\\n \\n\\n At this I remembered my dignity, and again stood upon it. \\n\\n \\n\\n “Why should I go on? Who are you to cross-question me in this way?” \\n\\n \\n\\n “I am the constable, as I said before, and I consider it very suspicious that you should be visited by a man who had a bag that jingled, at midnight.” \\n\\n \\n\\n “Why shouldn’t it jingle at midnight?” said I with a desperate attempt to impart a tone of lightness to the conversation. “If I choose to give a meal to a wayfarer with a jingling bag, I suppose it is my own concern.” \\n\\n \\n\\n “Mist. Vernon, he warn’t no tramp. He was a good dresser,” said Minerva, looking at me reproachfully. \\n\\n \\n\\n “Was—this—man—a—friend—of—yours—or—not?” asked the constable doggedly. \\n\\n \\n\\n “He was a friend of mine last night,” said I, thinking of the debt of gratitude I felt I owned him when he went away. \\n\\n \\n\\n “Did you suspect him of being a thief?” said the constable, in such a casual way that without thinking I said “Yes.” \\n\\n \\n\\n Minerva’s arms had been folded on her breast. They dropped to her side. Ethel slipped behind the constable and went into the parlour—to cool her red cheeks, I suppose. \\n\\n \\n\\n It was certainly a very unpleasant position for both of us, and I felt that my white lies were coming home to roost way ahead of roosting time. \\n\\n \\n\\n “Did he give you a part of the spoils as a reward for having fed him?” \\n\\n \\n\\n “No, sir.” This indignantly. \\n\\n \\n\\n “He didn’t give you this?” said he, pulling out of his pocket a silver vase. \\n\\n \\n\\n “No.” \\n\\n \\n\\n At this Minerva actually began to sob. “Oh, Mist. Vernon, how could you say that? I found that vase in the kitchen this morning, and this man says it was stolen from them people. Oh, why did I come up here?” \\n\\n \\n\\n “Philip, you might as well tell the whole story,” said Ethel, coming back from the parlour. “We’ll probably lose Minerva now, anyway.” \\n\\n \\n\\n “So there is a story,” said the constable, crossing his legs in a most irritating way. In fact he couldn’t have done anything that would not have been irritating. \\n\\n \\n\\n I saw that the best thing to do was to tell the truth, ridiculous as it might sound with Minerva there. Indeed, the very fact of my telling it might soften the girl and show her how much we were willing to descend in our efforts to keep her valuable services. But I made a wrong start. I said: \\n\\n \\n\\n “I knew that the man was a burglar—” \\n\\n \\n\\n Minerva immediately burst out sobbing and left the kitchen and went to her room, and my mental eye could see her remorselessly packing her trunk. \\n\\n \\n\\n “Go on,” said the constable, and then, “Go outside,” said he to the mulatto. \\n\\n \\n\\n “Well, now that they’ve gone,” said I in a relieved tone, “I can tell you the whole thing, farcical as it is. Have you a servant?” \\n\\n \\n\\n “My wife has a hired girl. What’s that got to do with it?” \\n\\n \\n\\n “Do you have trouble in keeping her?” \\n\\n \\n\\n “We have trouble in keeping them. It’s one after another. They all get the itch for the mills or the stores.” \\n\\n \\n\\n “Good! Then you’ll understand me,” said I, and I told him the whole story, going on to say: \\n\\n \\n\\n “When we were roused by this burglar, and I realized that Minerva would throw up her position if she was unduly startled, I resolved to throw myself on the burglar’s mercy, and ask him to pose as my friend, so as to deceive Minerva. It worked all right, or would have worked all right if you hadn’t come here to upset her worse than ever. She’s probably packing her trunk, now—” \\n\\n \\n\\n “By Godfrey, I’m sorry,” said the constable, who seemed a very decent sort of fellow, now that I knew him better. \\n\\n \\n\\n “You may well be sorry,” said I, with considerably more spirit than I had yet shown. “Of course, I understand that you are doing your duty, but it’s always best to come to headquarters in an affair of this kind. You got only a garbled version from Minerva. I have given you the facts. The burglar evidently left that cup by mistake, and the Fayerweathers are welcome to it. I’m sure I never want to see it again. It would be a perpetual reminder of our loss of Minerva.” \\n\\n \\n\\n The constable rose. “It’s a durned shame,” said he, “but of course I didn’t know anything about you. So then you don’t know where the burglar went after he left here?” \\n\\n \\n\\n I hesitated. It did not seem honourable to tell even the little I knew about the man who had been my guest. \\n\\n \\n\\n “He went out the front door,” said I, “but where he is now I haven’t the shadow of a suspicion.” \\n\\n \\n\\n The constable opened the kitchen door. “Come along, Jim,” said he. \\n\\n \\n\\n Then he took his leave. \\n\\n \\n\\n Overhead Minerva was preparing for the same thing. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2056/58516.html","bookId":571,"book":{"id":571,"title":"Minerva\u0027s Manoeuvres","description":"简介： When a play makes a tremendous hit the author is called before the curtain and after bowing and allowing his heart (and his head) to swell more and more, he generously points to the actors and actresses who are grouped around him as much as to say, T...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2056","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
