{"id":90771,"no":2,"title":"Page 2","content":"You would be amazed at how heavy a suitcase full of bats is. I grabbed Wanda, who was coming upstairs stuffed full of Choco- Drop Krackles, and I made her help Uncle Drac and me bring the bat suitcase downstairs. We had to be careful because we did not want to bump the bats and wake them up. \"What\u0027s in here?\" asked Wanda. I looked around to make sure that Aunt Tabby was not lurking like she does some times.\n Aunt Tabby is even more nosy than Wanda, if that is possible. \"Bats, \" I whispered. \"Bats?\" yelled Wanda. Aunt Tabby appeared out of nowhere-- how does she do it? She looked at me, Wanda, and Uncle Drac very suspiciously. \"What about bats?\" she asked. \"We were just talking about them, Aunt Tabby. Won\u0027t it be amazing to see all those giant Transylvanian bats?\" Aunt Tabby did not seem that excited. She looked at her watch and said, \"Hmm . . . Unless your Great-aunt Emilene turns up soon we won\u0027t be seeing any giant Transylvanian bats whatsoever. She\u0027s leaving it very late. \" \"We don\u0027t need Great-aunt Emilene to take care of us, \" I said.\n \"We can take care of ourselves, can\u0027t we, Wanda?\" Wanda nodded very hard, just like the toy dog that Brenda bought Barry to put in the back window of his van. Aunt Tabby took no notice. \"Nonsense, Araminta, \" she said. \"You and Wanda are much too young to be left alone for one night, let alone a whole week. If Great-aunt Emilene doesn\u0027t arrive, we will not be going. \" I saw Uncle Drac suddenly look hopeful, but not for longer than about two seconds, because just then the doorbell rang. Aunt Tabby yelled, \"At last!\" and rushed off to answer it. In Spookie House when someone rings the doorbell it gets stuck and keeps right on ring ing until you open the front door and unstick it. Barry keeps saying he is going to fix it, but he hasn\u0027t yet.\n The doorbell makes a really terri ble teeth-on-edge noise. We all dropped the suitcase and put our fingers in our ears-- which was a mistake. The suitcase shot off down the stairs on its little wheels, and as Aunt Tabby threw open the door and tried to unstick the doorbell, Uncle Drac\u0027s suitcase full of bats hurtled out and rattled off down the path. \"My bats!\" yelled Uncle Drac and raced after it. Luckily Aunt Tabby was having some trouble unsticking the doorbell, so she did not hear him--although I heard her scream as the suitcase shot past her. Suddenly the noise from the doorbell stopped. Aunt Tabby was still in the doorway and I wondered why she had not let Great- aunt Emilene in. I began to feel hopeful. Maybe the sight of Great-aunt Emilene, with her double-headed dead ferret wrapped around her neck and her little beady eyes that stared right into you, had made Aunt Tabby think again and she had decided to let us stay on our own after all.\n But something told me it wasn\u0027t that, because even though all I could see was Aunt Tabby\u0027s back, I could tell she was mad. I am very good at telling when Aunt Tabby is mad--I have had lots of practice. She sud denly gets prickly like a hedgehog; her hair stands up, the tips of her ears turn red, and her shoulders get a kind of pointy look to them. And right then Aunt Tabby\u0027s shoulders looked very pointy indeed. Wanda and I crept downstairs to see what was happening.\n \"What do you mean, `unavoidably delayed\u0027?\" Aunt Tabby was saying. We peered out, and instead of Great-aunt Emilene there was Perkins, who drives Great-aunt Emilene\u0027s hearse for her. \"I mean that Madam is delayed in an unavoidable fashion, \" said Perkins in his weird voice that sounded like he was locked deep inside a haunted vault. I made a thumbs-up sign to Wanda and she grinned. Things were looking good. But then Perkins--who looked even more like a skeleton than I remembered--said, \"Madam has asked me to inform you that she will arrive tomorrow. \" Wanda made a thumbs-down sign. I made a face.\n \"Tomorrow!\" Aunt Tabby exploded. \"That\u0027s no good. We are leaving in\"--she looked at her watch--\"ohmygoodnesshalfanhour. \" But all Perkins said in his voice-from-the tomb was, \"I shall return with Madam tomor row. Good day to you, \" and he walked away down the path. But Perkins did not know Aunt Tabby. If he had bothered to ask Wanda and me, we would have told him he would not get away that easily, but he hadn\u0027t--so he found out the hard way. Aunt Tabby ran after Perkins like a polecat after a tiny baby bunny. Perkins must have heard the thud of Aunt Tabby\u0027s boots rush ing down the path behind him because he sped up--but he was not fast enough.\n Aunt Tabby scooted in front of him and stood barring the driver\u0027s door. \"Mr. Perkins, before you go I have an errand for you. \" \"I do not do errands, madam, \" said Perkins in his voice-from-the-tomb. \"Excuse me, you are blocking my way. \" \"Indeed I am, Mr. Perkins, \" said Aunt Tabby. \"And I shall continue to do so until you go and fetch Nurse Beryl Watkins. She will look after Araminta and Wanda tonight. \" \"Oh no!\" gasped Wanda. \"Not Nurse Watkins. \" I groaned. There are not many people in the world who make Great-aunt Emilene look like a cuddly pussycat, but Nurse Watkins is one of them. Perkins was standing his ground.\n \"I am not a taxi service, madam, \" he said sniffily. He pushed past Aunt Tabby, pulled open the dri ver\u0027s door, and hopped inside. Wanda grinned. \"Good old Perkins, \" she whispered. \"He won\u0027t do it. \" I shook my head; I knew better. Perkins was a novice when it came to Aunt Tabby--he hadn\u0027t won yet. I was right. In a split second Aunt Tabby had opened the back door and was sitting right behind him, in the little flip- down seat especially for people who want to sit beside the coffin. And as she slammed the door I heard her say, \"Catheter Cottage, Perkins--and fast!\"\n We watched the hearse drive away, its tires squealing on the road, and we knew it would not be long until Nurse Watkins was here.\n \"What are we going to doooo?\" wailed Wanda. \"Don\u0027t worry, \" I said. \"I have an ANW Plan. \" \"What\u0027s an ANW Plan?\" asked Wanda. \"An AntiNurse Watkins Plan of course. \" Wanda looked impressed.\n \"That was very fast, Araminta. \" \"I know, \" I said. \"My brain is like that--I just think fast. I can\u0027t help it. \" \"So what is your ANW Plan?\" \"Well, we can\u0027t stop her from coming, \" I told Wanda. \"I knooow, \" she wailed. \"But we can stop her from staying. \" \"Really? How?\" \"I will ask Sir Horace to scare her away. I will say the secret word and he can walk around carrying his head under his arm, moaning and clanking, and Edmund can do some of his horrible singing. Even Nurse Watkins won\u0027t like that. \" \"You are so smart, Araminta. \" \"I know. \" I smiled and went to find Sir Horace. Things always look better when you have a Plan. \n","sourceLink":"https://allnovel.net/ghostsitters-araminta-spook-5/page-2.html","bookId":2806,"book":{"id":2806,"title":"Ghostsitters (Araminta Spook #5)","description":"Storyline: \n Ghostsitters (Araminta Spook #5) \n When Aunt Tabby and Uncle Drac head off to Transylvania, Araminta is upset--they\u0027re going to be away on her birthday. However, when it turns out that her almost-grown-up cousin, Mathilda, will be babysitting, it seems things couldn\u0027t get any better. But Mathilda\u0027s brought along trouble: two rowdy teenage ghosts, Ned and Jed, who listen to no one. It\u0027s a disaster! Can the girls figure out a way to get Ned and Jed out of the house for good?\n \n","cover":"https://allnovel.net/images/ghostsitters-araminta-spook-5.jpg","author":"Angie Sage","type":"Humorous","source":"allnovel","link":"https://allnovel.net/ghostsitters-araminta-spook-5.html","creation":"Oct 5, 2019 9:01:31 AM","modification":"Oct 5, 2019 5:44:58 PM"}}
