{"id":90187,"no":12,"title":"Page 12","content":"Chapter Twelve\n Screen Language\n \"Tell me again,\" said Dr. Oliver Payne, in the little laboratory overlooking the park. \"Either I didn\u0027t hear you, or you\u0027re talking nonsense. A child from another world?\"\n \"That\u0027s what she said. All right, it\u0027s nonsense, but listen to it, Oliver, will you?\" said Dr. Mary Malone. \"She knew about Shadows. She calls them - it - she calls it Dust, but it\u0027s the same thing. It\u0027s our shadow particles. And I\u0027m telling you, when she was wearing the electrodes linking her to the Cave, there was the most extraordinary display on the screen: pictures, symbols... She had an instrument too, a sort of compass thing made of gold, with different symbols all around the rim. And she said she could read that in the same way, and she knew about the state of mind, too - she knew it intimately.\"\n It was midmorning. Lyra\u0027s Scholar, Dr. Malone, was red-eyed from lack of sleep, and her colleague, who\u0027d just returned from Geneva, was impatient to hear more, and skeptical, and preoccupied.\n \"And the point was, Oliver, she was communicating with them. They are conscious. And they can respond. And you remember your skulls? Well, she told me about some skulls in the Pitt-Rivers Museum. She\u0027d found out with her compass thing that they were much older than the museum said, and there were Shadows - \"\n \"Wait a minute. Give me some sort of structure here. What are you saying? You saying she\u0027s confirmed what we know already, or that she\u0027s telling us something new?\"\n \"Both. I don\u0027t know. But suppose something happened thirty, forty thousand years ago. There were shadow particles around before then, obviously - they\u0027ve been around since the Big Bang - but there was no physical way of amplifying their effects at our level, the anthropic level. The level of human beings. And then something happened, I can\u0027t imagine what, but it involved evolution. Hence your skulls - remember? No Shadows before that time, lots afterward? And the skulls the child found in the museum, that she tested with her compass thing. She told me the same thing. What I\u0027m saying is that around that time, the human brain became the ideal vehicle for this amplification process. Suddenly we became conscious.\"\n Dr. Payne tilted his plastic mug and drank the last of his coffee.\n \"Why should it happen particularly at that time?\" he said. \"Why suddenly thirty-five thousand years ago?\"\n \"Oh, who can say? We\u0027re not paleontologists. I don\u0027t know, Oliver, I\u0027m just speculating. Don\u0027t you think it\u0027s at least possible?\"\n \"And this policeman. Tell me about him.\"\n Dr. Malone rubbed her eyes. \"His name is Walters,\" she said. \"He said he was from the Special Branch. I thought that was politics or something?\"\n \"Terrorism, subversion, intelligence... all that. Go on. What did he want? Why did he come here?\"\n \"Because of the girl. He said he was looking for a boy of about the same age - he didn\u0027t tell me why - and this boy had been seen in the company of the girl who came here. But he had something else in mind as well, Oliver. He knew about the research. He even asked - \"\n The telephone rang. She broke off, shrugging, and Dr. Payne answered it. He spoke briefly, put it down, and said, \"We\u0027ve got a visitor.\"\n \"Who?\"\n \"Not a name I know. Sir Somebody Something. Listen, Mary, I\u0027m off, you realize that, don\u0027t you?\"\n \"They offered you the job.\"\n \"Yes. I\u0027ve got to take it. You must see that.\"\n \"Well, that\u0027s the end of this, then.\"\n He spread his hands helplessly, and said, \"To be frank... I can\u0027t see any point in the sort of stuff you\u0027ve just been talking about. Children from another world and fossil Shadows... It\u0027s all too crazy. I just can\u0027t get involved. I\u0027ve got a career, Mary.\"\n \"What about the skulls you tested? What about the Shadows around the ivory figurine?\"\n He shook his head and turned his back. Before he could answer, there came a tap at the door, and he opened it almost with relief.\n Sir Charles said, \"Good day to you. Dr. Payne? Dr. Malone? My name is Charles Latrom. It\u0027s very good of you to see me without any notice.\"\n \"Come in,\" said Dr. Malone, weary but puzzled. \"Did Oliver say Sir Charles? What can we do for you?\"\n \"It may be what I can do for you,\" he said. \"I understand you\u0027re waiting for the results of your funding application.\"\n \"How do you know that?\" said Dr. Payne.\n \"I used to be a civil servant. As a matter of fact, I was concerned with directing scientific policy. I still have a number of contacts in the field, and I heard... May I sit down?\"\n \"Oh, please,\" said Dr. Malone. She pulled out a chair, and he sat down as if he were in charge of a meeting.\n \"Thank you. I heard through a friend - I\u0027d better not mention his name; the Official Secrets Act covers all sorts of silly things - I heard that your application was being considered, and what I heard about it intrigued me so much that I must confess I asked to see some of your work. I know I had no business to, except that I still act as a sort of unofficial adviser, so I used that as an excuse. And really, what I saw was quite fascinating.\"\n \"Does that mean you think we\u0027ll be successful?\" said Dr. Malone, leaning forward, eager to believe him.\n \"Unfortunately, no. I must be blunt. They\u0027re not minded to renew your grant.\"\n Dr. Malone\u0027s shoulders slumped. Dr. Payne was watching the old man with cautious curiosity.\n \"Why have you come here now, then?\" he said.\n \"Well, you see, they haven\u0027t officially made the decision yet. It doesn\u0027t look promising, and I\u0027m being frank with you; they see no prospect of funding work of this sort in the future. However, it might be that if you had someone to argue the case for you, they would see it differently.\"\n \"An advocate? You mean yourself? I didn\u0027t think it worked like that,\" said Dr. Malone, sitting up. \"I thought they went on peer review and so on.\"\n \"It does in principle, of course,\" said Sir Charles. \"But it also helps to know how these committees work in practice. And to know who\u0027s on them. Well, here I am. I\u0027m intensely interested in your work; I think it might be very valuable, and it certainly ought to continue. Would you let me make informal representations on your behalf?\"\n Dr. Malone felt like a drowning sailor being thrown a life belt. \"Why... well, yes! Good grief, of course! And thank you... I mean, do you really think it\u0027ll make a difference? I don\u0027t mean to suggest that... I don\u0027t know what I mean. Yes, of course!\"\n \"What would we have to do?\" said Dr. Payne.\n Dr. Malone looked at him in surprise. Hadn\u0027t Oliver just said he was going to work in Geneva? But he seemed to be understanding Sir Charles better than she was, for a flicker of complicity was passing between them, and Oliver came to sit down, too.\n \"I\u0027m glad you take my point,\" said the old man. \"You\u0027re quite right. There is a direction I\u0027d be especially glad to see you taking. And provided we could agree, I might even be able to find you some extra money from another source altogether.\"\n \"Wait, wait,\" said Dr. Malone. \"Wait a minute. The course of this research is a matter for us. I\u0027m perfectly willing to discuss the results, but not the direction. Surely you see - \"\n Sir Charles spread his hands in a gesture of regret and got to his feet. Oliver Payne stood too, anxious.\n \"No, please, Sir Charles,\" he said. \"I\u0027m sure Dr. Malone will hear you out. Mary, there\u0027s no harm in listening, for goodness\u0027 sake. And it might make all the difference.\"\n \"I thought you were going to Geneva?\" she said.\n \"Geneva?\" said Sir Charles. \"Excellent place. Lot of scope there. Lot of money, too. Don\u0027t let me hold you back.\"\n \"No, no, it\u0027s not settled yet,\" said Dr. Payne hastily. \"There\u0027s a lot to discuss - it\u0027s all still very fluid. Sir Charles, please sit down. Can I get you some coffee?\"\n \"That would be very kind,\" said Sir Charles, and sat again, with the air of a satisfied cat.\n Dr. Malone looked at him clearly for the first time. She saw a man in his late sixties, prosperous, confident, beautifully dressed, used to the very best of everything, used to moving among powerful people and whispering in important ears. Oliver was right: he did want something. And they wouldn\u0027t get his support unless they satisfied him.\n She folded her arms.\n Dr. Payne handed him a mug, saying, \"Sorry it\u0027s rather primitive...\"\n \"Not at all. Shall I go on with what I was saying?\"\n \"Do, please,\" said Dr. Payne.\n \"Well, I understand that you\u0027ve made some fascinating discoveries in the field of consciousness. Yes, I know, you haven\u0027t published anything yet, and it\u0027s a long way - seemingly - from the apparent subject of your research. Nevertheless, word gets around. And I\u0027m especially interested in that. I would be very pleased if, for example, you were to concentrate your research on the manipulation of consciousness. Second, the many-worlds hypothesis - Everett, you remember, 1957 or thereabouts - I believe you\u0027re on the track of something that could take that theory a good deal further. And that line of research might even attract defense funding, which as you may know is still plentiful, even today, and certainly isn\u0027t subject to these wearisome application processes.\"\n \"Don\u0027t expect me to reveal my sources,\" he went on, holding up his hand as Dr. Malone sat forward and tried to speak. \"I mentioned the Official Secrets Act; a tedious piece of legislation, but we mustn\u0027t be naughty about it. I confidently expect some advances in the many-worlds area. I think you are the people to do it. And third, there is a particular matter connected with an individual. A child.\"\n He paused there, and sipped the coffee. Dr. Malone couldn\u0027t speak. She\u0027d gone pale, though she couldn\u0027t know that, but she did know that she felt faint.\n \"For various reasons,\" Sir Charles went on, \"I am in contact with the intelligence services. They are interested in a child, a girl, who has an unusual piece of equipment - an antique scientific instrument, certainly stolen, which should be in safer hands than hers. There is also a boy of roughly the same age - twelve or so - who is wanted in connection with a murder. It\u0027s a moot point whether a child of that age is capable of murder, of course, but he has certainly killed someone. And he has been seen with the girl.\"\n \"Now, Dr. Malone, it may be that you have come across one or the other of these children. And it may be that you are quite properly inclined to tell the police about what you know. But you would be doing a greater service if you were to let me know privately. I can make sure the proper authorities deal with it efficiently and quickly and with no stupid tabloid publicity. I know that Inspector Walters came to see you yesterday, and I know that the girl turned up. You see, I do know what I\u0027m talking about. I would know, for instance, if you saw her again, and if you didn\u0027t tell me, I would know that too. You\u0027d be very wise to think hard about that, and to clarify your recollections of what she said and did when she was here. This is a matter of national security. You understand me.\"\n \"Well, there I\u0027ll stop. Here\u0027s my card so you can get in touch. I shouldn\u0027t leave it too long; the funding committee meets tomorrow, as you know. But you can reach me at this number at any time.\"\n He gave a card to Oliver Payne, and seeing Dr. Malone with her arms still folded, laid one on the bench for her. Dr. Payne held the door for him. Sir Charles set his Panama hat on his head, patted it gently, beamed at both of them, and left.\n When he\u0027d shut the door again, Dr. Payne said, \"Mary, are you mad? Where\u0027s the sense in behaving like that?\"\n \"I beg your pardon? You\u0027re not taken in by that old creep, are you?\"\n \"You can\u0027t turn down offers like that! Do you want this project to survive or not?\"\n \"It wasn\u0027t an offer,\" she said hotly. \"It was an ultimatum. Do as he says, or close down. And, Oliver, for God\u0027s sake, all those not-so-subtle threats and hints about national security and so on - can\u0027t you see where that would lead?\"\n \"Well, I think I can see it more clearly than you can. If you said no, they wouldn\u0027t close this place down. They\u0027d take it over. If they\u0027re as interested as he says, they\u0027ll want it to carry on. But only on their terms.\"\n \"But their terms would be... I mean, defense, for God\u0027s sake. They want to find new ways of killing people. And you heard what he said about consciousness: he wants to manipulate it. I\u0027m not going to get mixed up in that, Oliver, never.\"\n \"They\u0027ll do it anyway, and you\u0027ll be out of a job. If you stay, you might be able to influence it in a better direction. And you\u0027d still have your hands on the work! You\u0027d still be involved!\"\n \"But what does it matter to you, anyway?\" she said. \"I thought Geneva was all settled?\"\n He ran his hands through his hair and said, \"Well, not settled. Nothing\u0027s signed. And it would be a different angle altogether, and I\u0027d be sorry to leave here now that I think we\u0027re really on to something.\"\n \"What are you saying?\"\n \"I\u0027m not saying - \"\n \"You\u0027re hinting. What are you getting at?\"\n \"Well...\" He walked around the laboratory, spreading his hands, shrugging, shaking his head. \"Well, if you don\u0027t get in touch with him, I will,\" he said finally.\n She was silent. Then she said, \"Oh, I see.\"\n \"Mary, I\u0027ve got to think of - \"\n \"Of course you have.\"\n \"It\u0027s not that - \"\n \"No, no.\"\n \"You don\u0027t understand - \"\n \"Yes, I do. It\u0027s very simple. You promise to do as he says, you get the funding, I leave, you take over as Director. It\u0027s not hard to understand. You\u0027d have a bigger budget. Lots of nice new machines. Half a dozen more Ph.D.s under you. Good idea. You do it, Oliver. You go ahead. But that\u0027s it for me. I\u0027m off. It stinks.\"\n \"You haven\u0027t...\"\n But her expression silenced him. She took off her white coat and hung it on the door, gathered a few papers into a bag, and left without a word. As soon as she\u0027d gone, he took Sir Charles\u0027s card and picked up the phone.\n Several hours later, just before midnight in fact, Dr. Malone parked her car outside the science building and let herself in at the side entrance. But just as she turned to climb the stairs, a man came out of another corridor, startling her so much she nearly dropped her briefcase. He was wearing a uniform.\n \"Where are you going?\" he said.\n He stood in the way, bulky, his eyes hardly visible under the low brim of his cap.\n \"I\u0027m going to my laboratory. I work here. Who are you?\" she said, a little angry, a little frightened.\n \"Security. Have you got some ID?\"\n \"What security? I left this building at three o\u0027clock this afternoon and there was only a porter on duty, as usual. I should be asking you for identification. Who appointed you? And why?\"\n \"Here\u0027s my ID,\" said the man, showing her a card, too quickly for her to read it. \"Where\u0027s yours?\"\n She noticed he had a mobile phone in a holster at his hip. Or was it a gun? No, surely, she was being paranoid. And he hadn\u0027t answered her questions. But if she persisted, she\u0027d make him suspicious, and the important thing now was to get into the lab. Soothe him like a dog, she thought. She fumbled through her bag and found her wallet.\n \"Will this do?\" she said, showing him the card she used to operate the barrier in the car park.\n He looked at it briefly.\n \"What are you doing here at this time of night?\" he said.\n \"I\u0027ve got an experiment running. I have to check the computer periodically.\"\n He seemed to be searching for a reason to forbid her, or perhaps he was just exercising his power. Finally he nodded and stood aside. She went past, smiling at him, but his face remained blank.\n When she reached the laboratory, she was still trembling. There had never been any more \"security\" in this building than a lock on the door and an elderly porter, and she knew why the change had come about. But it meant that she had very little time; she\u0027d have to get it right at once, because once they realized what she was doing, she wouldn\u0027t be able to come back again.\n She locked the door behind her and lowered the blinds. She switched on the detector and then took a floppy disk from her pocket and slipped it into the computer that controlled the Cave. Within a minute she had begun to manipulate the numbers on the screen, going half by logic, half by guesswork, and half by the program she\u0027d worked on all evening at home; and the complexity of her task was about as baffling as getting three halves to make one whole.\n Finally she brushed the hair out of her eyes and put the electrodes on her head, and then flexed her fingers and began to type. She felt intensely self-conscious.\n Hello. I\u0027m not sure\n what I\u0027m doing. Maybe\n this is crazy.\n The words arranged themselves on the left of the screen, which was the first surprise. She wasn\u0027t using a word-processing program of any kind - in fact, she was bypassing much of the operating system - and whatever formatting was imposing itself on the words, it wasn\u0027t hers. She felt the hairs begin to stir on the back of her neck, and she became aware of the whole building around her: the corridors dark, the machines idling, various experiments running automatically, computers monitoring tests and recording the results, the air-conditioning sampling and adjusting the humidity and the temperature, all the ducts and pipework and cabling that were the arteries and the nerves of the building awake and alert... almost conscious in fact.\n She tried again.\n I\u0027m trying to do\n with words what I\u0027ve\n done before with a\n state of mind, but\n Before she had even finished the sentence, the cursor raced across to the right of the screen and printed:\n ASK A QUESTION.\n It was almost instantaneous.\n She felt as if she had stepped on a space that wasn\u0027t there. Her whole being lurched with shock. It took several moments for her to calm down enough to try again. When she did, the answers lashed themselves across the right of the screen almost before she had finished.\n Are you Shadows? YES.\n Are you the same as Lyra\u0027s Dust? YES.\n And is that dark matter? YES.\n Dark matter is conscious? EVIDENTLY.\n What I said to Oliver this morning, my idea about human evolution, is it\n CORRECT. BUT YOU NEED TO ASK MORE QUESTIONS.\n She stopped, took a deep breath, pushed her chair back, flexed her fingers. She could feel her heart racing. Every single thing about what was happening was impossible. All her education, all her habits of mind, all her sense of herself as a scientist were shrieking at her silently: This is wrong! It isn\u0027t happening! You\u0027re dreaming!And yet there they were on the screen: her questions, and answers from some other mind.\n She gathered herself and typed again, and again the answers zipped into being with no discernible pause.\n The mind that is\n answering these\n questions isn\u0027t human,\n is it?\n NO. BUT HUMANS HAVE\n ALWAYS KNOWN US.\n Us? There\u0027s more than\n one of you?\n UNCOUNTABLE BILLIONS.\n But, what are you?\n ANGELS.\n Mary Malone\u0027s head rang. She\u0027d been brought up as a Catholic. More than that - as Lyra had discovered, she had once been a nun. None of her faith was left to her now, but she knew about angels. St. Augustine had said, \"Angel is the name of their office, not of their nature. If you seek the name of their nature, it is spirit; if you seek the name of their office, it is angel; from what they are, spirit, from what they do, angel.\"\n Dizzy, trembling, she typed again:\n And Shadow matter is what we have called spirit?\n FROM WHAT WE ARE,\n SPIRIT; FROM WHAT WE DO,\n MATTER. MATTER AND\n SPIRIT ARE ONE.\n She shivered. They\u0027d been listening to her thoughts.\n And did you intervene in human evolution?\n YES.\n Vengeance for - oh! Rebel angels! After the war in Heaven - Satan and the Garden of Eden - but it isn\u0027t true, is it? Is that what you\n FIND THE GIRL AND THE\n BOY. WASTE NO MORE TIME.\n But why?\n YOU MUST PLAY THE SERPENT.\n She took her hands from the keyboard and rubbed her eyes. The words were still there when she looked again.\n Where\n GO TO A ROAD CALLED\n SUNDERLAND AVENUE AND\n FIND A TENT. DECEIVE THE\n GUARDIAN AND GO THROUGH.\n TAKE PROVISIONS FOR A\n LONG JOURNEY. YOU WILL\n BE PROTECTED. THE\n SPECTERS WILL NOT\n TOUCH YOU.\n But I\n BEFORE YOU GO, DESTROY\n THIS EQUIPMENT.\n I don\u0027t understand. Why me? And what\u0027s this journey? And\n YOU HAVE BEEN PREPARING\n FOR THIS AS LONG AS YOU\n HAVE LIVED. YOUR WORK\n HERE IS FINISHED. THE\n LAST THING YOU MUST DO\n IN THIS WORLD IS PREVENT\n THE ENEMIES FROM TAKING\n CONTROL OF IT. DESTROY\n THE EQUIPMENT. DO IT NOW\n AND GO AT ONCE.\n Mary Malone pushed back the chair and stood up, trembling. She pressed her fingers to her temples and discovered the electrodes still attached to her skin. She took them off absently. She might have doubted what she had done, and what she could still see on the screen, but she had passed in the last half-hour or so beyond doubt and belief altogether. Something had happened, and she was galvanized.\n She switched off the detector and the amplifier. Then she bypassed all the safety codes and formatted the computer\u0027s hard disk, wiping it clean; and then she removed the interface between the detector and the amplifier, which was on a specially adapted card, and put the card on the bench and smashed it with the heel of her shoe, there being nothing else heavy at hand. Next she disconnected the wiring between the electromagnetic shield and the detector, and found the wiring plan in a drawer of the filing cabinet and set light to it. Was there anything else she could do? She couldn\u0027t do much about Oliver Payne\u0027s knowledge of the program, but the special hardware was effectively demolished.\n She crammed some papers from a drawer into her briefcase, and finally took down the poster with the I Ching hexagrams and folded it away in her pocket. Then she switched off the light and left.\n The security guard was standing at the foot of the stairs, speaking into his telephone. He put it away as she came down, and escorted her silently to the side entrance, watching through the glass door as she drove away.\n An hour and a half later she parked her car in a road near Sunderland Avenue. She had had to find it on a map of Oxford; she didn\u0027t know this part of town. Up till this moment she had been moving on pent-up excitement, but as she got out of her car in the dark of the small hours and found the night cool and silent and still all around her, she felt a definite lurch of apprehension. Suppose she was dreaming? Suppose it was all some elaborate joke?\n Well, it was too late to worry about that. She was committed. She lifted out the rucksack she\u0027d often taken on camping journeys in Scotland and the Alps, and reflected that at least she knew how to survive out of doors; if worse came to worst, she could always run away, take to the hills...\n Ridiculous.\n But she swung the rucksack onto her back, left the car, turned into the Banbury Road, and walked the two or three hundred yards up to where Sunderland Avenue ran left from the rotary. She felt almost more foolish than she had ever felt in her life.\n But as she turned the corner and saw those strange childlike trees that Will had seen, she knew that something at least was true about all this. Under the trees on the grass at the far side of the road there was a small square tent of red and white nylon, the sort that electricians put up to keep the rain off while they work, and parked close by was an unmarked white Transit van with darkened glass in the windows.\n Better not hesitate. She walked straight across toward the tent. When she was nearly there, the back door of the van swung open and a policeman stepped out. Without his helmet he looked very young, and the streetlight under the dense green of the leaves above shone full on his face.\n \"Could I ask where you\u0027re going, madam?\" he said.\n \"Into that tent.\"\n \"I\u0027m afraid you can\u0027t, madam. I\u0027ve got orders not to let anyone near it.\"\n \"Good,\" she said. \"I\u0027m glad they\u0027ve got the place protected. But I\u0027m from the Department of Physical Sciences - Sir Charles Latrom asked us to make a preliminary survey and then report back before they look at it properly. It\u0027s important that it\u0027s done now while there aren\u0027t many people around. I\u0027m sure you understand the reasons for that.\"\n \"Well, yes,\" he said. \"But have you got anything to show who you are?\"\n \"Oh, sure,\" she said, and swung the rucksack off her back to get at her purse. Among the items she had taken from the drawer in the laboratory was an expired library card of Oliver Payne\u0027s. Fifteen minutes\u0027 work at her kitchen table and the photograph from her own passport had produced something she hoped would pass for genuine. The policeman took the laminated card and looked at it closely.\n \"\u0027Dr. Olive Payne,\u0027\" he read. \"Do you happen to know a Dr. Mary Malone?\"\n \"Oh, yes. She\u0027s a colleague.\"\n \"Do you know where she is now?\"\n \"At home in bed, if she\u0027s got any sense. Why?\"\n \"Well, I understand her position in your organization\u0027s been terminated, and she wouldn\u0027t be allowed through here. In fact, we\u0027ve got orders to detain her if she tries. And seeing a woman, I naturally thought you might be her, if you see what I mean. Excuse me, Dr. Payne.\"\n \"Ah, I see,\" said Mary Malone. The policeman looked at the card once more.\n \"Still, this seems all right,\" he said, and handed it back. Nervous, wanting to talk, he went on. \"Do you know what\u0027s in there under that tent?\"\n \"Well, not firsthand,\" she said. \"That\u0027s why I\u0027m here now.\"\n \"I suppose it is. All right then, Dr. Payne.\"\n He stood back and let her unlace the flap of the tent. She hoped he wouldn\u0027t see the shaking of her hands. Clutching the rucksack to her breast, she stepped through. Deceive the guardian - well, she\u0027d done that; but she had no idea what she would find inside the tent. She was prepared for some sort of archaeological dig; for a dead body; for a meteorite. But nothing in her life or her dreams had prepared her for that square yard or so in midair, or for the silent sleeping city by the sea that she found when she stepped through it. \n","sourceLink":"https://allnovel.net/the-subtle-knife-his-dark-materials-2/page-12.html","bookId":2092,"book":{"id":2092,"title":"The Subtle Knife (His Dark Materials #2)","description":"Storyline: \n The Subtle Knife(His Dark Materials 2) \n The Subtle Knife, the second novel in the book His Dark Materials series, was written by English novelist Philip Pullman and published in 1997. The novel continues the adventures of Lyra Belacqua as she investigates the mysterious Dust phenomenon and searches for her father. Will Parry is introduced as a companion to Lyra, and together they explore the new realms to which they have both been introduced. \n The book focuses more on the characters and their own individual plots, rather than just on Lyra\u0027s father, Lord Asriel, and his war against the Magisterium. It describes not only Lyra and Will\u0027s journey, but also the journeys of Lee Scoresby and Serafina Pekkala. In addition, Pullman alludes heavily to the study of dark matter (or \"Dust\") and particle physics to further establish his metaphysical saga.\n \n","cover":"https://allnovel.net/images/the-subtle-knife-his-dark-materials-2.jpg","author":"Philip Pullman","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-subtle-knife-his-dark-materials-2.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:40:33 PM"}}
