{"id":25393,"no":4,"title":"IV. THE ARCHDEACON.","content":"A dean has been described as a Church dignitary who, as regards his position in the Church, has little to do and a good deal to get. An archdeacon, on the other hand, is a Church dignitary, who in diocesan dignity is indeed almost equal to a dean, and in diocesan power is much superior to a dean, but who has a great deal to do and very little to get. Indeed, as to that matter of getting, the archdeacon,—as archdeacon,—may be said to get almost nothing. It is quite in keeping with the traditional polity and well understood peculiarities of our Church that much work should be required from those officers to whom no payment is allotted, or payment that is next to none; whereas from those to whom affluence{43} is given little labour is required. And the system works well enough. There has as yet been no dearth of archdeacons; nor shall we probably experience any such calamity. \n \n Nevertheless, archdeacons are seldom allowed to starve. The bishops have it in their power to look to that, and knowing that in these days starving men seldom can exercise much authority, they take care that their archdeacons shall be beneficed. The archdeacon always holds a living. In former happy days he not unfrequently held more than one, and there are probably archdeacons still living in that halcyon condition. He always holds a living, and almost always a good living. He not unfrequently is a man of private means, and has been selected for his position partly on that account. He is the nominee of the bishop, and is, therefore, not unfrequently intimately connected with episcopal things. He is, perhaps, the son or nephew of a bishop, or has married a wife from the palace, or has, after some fashion, sat in his early days at episcopal feet. He is one whom the bishop thinks that he can love and trust; and therefore, before he has obtained his{44} archdeaconry, he has probably been endowed with that first requisite for a good servant—good wages. A poor archdeacon, an archdeacon who did not keep a curate or two, an archdeacon who could not give a dinner and put a special bottle of wine upon the table, an archdeacon who did not keep a carriage, or at least a one-horse chaise, an archdeacon without a man servant, or a banker’s account, would be nowhere,—if I may so speak,—in an English diocese. Such a one could not hold up his head among churchwardens, or inquire as to church repairs with any touch of proper authority. Therefore, though the archdeacon is not paid for his services as archdeacon, he is generally a gentleman who is well to do in the world, and who can take a comfortable place in the county society among which it is his happy lot to live. \n \n But, above all things, an archdeacon should be a man of the world. He should know well, not only how many shillings there are in a pound, but how many shillings also there are in a clerical pound,—for in these matters there is a difference. Five hundred a year is much more in the hands of a{45} country parson than it is in the hands of a country gentleman who is not a parson,—all which the efficient archdeacon understands and has at his fingers’ ends to the last shilling of the calculation. He should understand, too, after what fashion his brother rectors and vicars live around him,—should know something of their habits, something also of their means, and should have an eye open to their welfare, their pursuits, and their amusements. Of all these things the really stirring archdeacon does in fact know very much. \n \n The archdeacon is, in fact, a bishop in little, and as such is often much more of a bishop in fact than is the bishop himself. To define,—or rather to make intelligible by any definition,—an archdeacon’s power and duties, would be very difficult; as also it is very difficult, or I may say impossible, to do so with reference to a bishop’s functions. The archdeacon holds a court, and makes visitations. These visitations may be made pretty much at his pleasure. He must, I believe, make them once in three years, but may make them every year if he thinks fit. He inquires as to the administration of the services,{46} seeing that the canons are maintained, but has no power to alter aught; and as there seems to be much difficulty in knowing when and by what the canons are maintained, and when and by what they are not maintained, we may imagine that the inquiries of a discreet archdeacon into the practices of a respectable and efficient parson will not be too close or searching in this matter of the canons. It is, however, easier to see whether the windows of a church are in repair, and whether the roof keeps out the rain, than it is to be intelligibly and efficiently explicit on the subject of canons, and, therefore, the outward structure of the parish church gives very safe employment to an archdeacon. The little difficulty as to church rates which sometimes follows upon an order for repairs is not uncongenial to the archdeacon’s mind. It hinges upon politics, and upon a vexed political question in which the archdeacon, as a strong local Conservative, has hitherto had his victories. There remain so very few subjects which are still grateful to him in the same way, that church rates, with all their little impediments and embargoes, naturally present themselves to him as pleasant matters. And then the{47} archdeacons receive reports from the churchwardens, if churchwardens have anything to report,—any scandal of which to tell, or evil practices on the parson’s side of which complaint has unfortunately become necessary according to the judgment of those churchwardens! By the word “scandal” let not the uninitiated reader be led to think that undignified tittle-tattle with his neighbour’s churchwardens is the duty or the employment of an archdeacon. Open moral misconduct in a clergyman’s life is supposed to be matter of justifiable public scandal—the scandal arising with the clerical sinner, and not with those who tell of the sin—and, as such, is, by the constitution of our Church, an especial subject for the care of our archdeacons, and indeed, under them, of our churchwardens. But in such matters archdeacons are liberal, and much prefer to wink an eye than to see too much. We may imagine that a churchwarden, misunderstanding his mission with regard to scandal, and taking upon himself too promptly the duty of watching the moral conduct of his parson, would not receive much comfort from a visiting archdeacon. No one knows better than an archdeacon—{48}no one knows so well as an archdeacon—that it is needless and absurd to look for a St. Paul in every parsonage. He would, indeed, be very little at his own ease with a local St. Paul, much preferring a comfortable rector, who can take his glass of wine after dinner and talk pleasantly of old college days. St. Pauls, however, do not trouble him; nor is he troubled much by the scandals of his clerical neighbours; but he must be troubled sorely, I should think, by the increasing number and increasing influence around him of those “literate” clergymen who—from want of better, as we must in sorrow confess,—are flocking to us from Islington, Birkenhead, and such like fountains of pastoral care. The man who won’t drink his glass of wine, and talk of his college, and put off for a few happy hours the sacred stiffnesses of the profession and become simply an English gentleman,—he is the clergyman whom in his heart the archdeacon does not love. \n \n Thus the archdeacon is a bishop in little as regards his own archdeaconry, which may probably comprise half a diocese; and as an energetic financial secretary at the Treasury may, under an uninstructed{49} Chancellor of the Exchequer, have much more to do with the finances of the country than the Chancellor of the Exchequer himself, so may an energetic archdeacon have a much stronger influence on his clerical district than the bishop who is over him. He is the bishop’s eye, or should be so, and may not improbably become the bishop’s hand. \n \n But the archdeacon, in spite of all his power and authority, though he be so great among his brother parsons, is hardly in the way to better promotion. High promotion in the Church now comes from political influence or from the friendship of Ministers,—from those things, combined of course with high clerical attainments—and an archdeacon is not often in the way to obtain political influence or the friendship of Ministers. As deans live in towns, so do archdeacons live in the country; and like other country gentlemen they are always in opposition. And then they are men who have been made what they are by the bishops, and, therefore, are known well in their dioceses, but are not much known beyond them. They culminate in their own local dignity, and, knowing that they do so, they make{50} the most of it. An archdeacon who is potent with his bishop, and who is popular with his clergymen, who works hard and can do so without undue meddling, who has a pleasant parish of his own and is not troubled by ambitious or indifferent curates, who can live on good terms with the squires around him, understanding how far it is expedient that he should be restricted by his coat, and how for he may go in discarding hyper-clerical constraint, is master of a position in which he need not envy the success of any professional gentleman in the kingdom. But he is not on the direct road to higher things, and will probably die in his rectory, an archdeacon to the last. \n \n If an archdeacon be ambitious of moving in higher clerical matters than his archdeaconry affords him, he generally looks to gratify that desire by sitting in Convocation. This method of doing something more than routine duty is easier and less likely to fail than the other method of publishing a volume of sermons. Sermons are not read now as they were some thirty or forty years since, and Convocation has lately held its head a little up, obtaining recognition in the{51} newspapers, and appearing to do something. An archdeacon is just the man to believe that Convocation can do much; and this faith on his part is evidence of a moral freshness and a real earnestness which adds a charm to his normal character. Who can bring himself to believe that a bishop believes in Convocation—a bishop, that is, who takes his seat in the House of Lords, talks to other peers, and knows what is going on in the well-instructed blasé London world? Such a one cannot but see, cannot but know, that Convocation is a clerical toy, a mere debating society to which belongs none of the vitality of power. But the archdeacon, fresh from the country, believes in Convocation, and works there with some real conviction that he is one of a clerical Parliament, and that he is animated by true parliamentary life. \n \n But it is in his own rectory that an archdeacon must ever shine with the brightest light. I have said that he is a bishop in little, and I may also say that he is the very chief among parsons; and as the country parson—the country parson with pleasant parsonage, pleasanter wife, and plenty of children—is the true and proper type of an English clergyman,{52} to which bishops, deans, canons, and curates are mere adjuncts and necessary excrescences, so is the archdeacon the highest type of the country parson. He is always married—an exception here or there would but prove the rule—he generally has a large family; of course he has a pleasant rectory. He must be an earnest working parish clergyman, or he would hardly have been selected as an archdeacon. He is necessarily—I may say certainly—a gentleman. Alas! that the day should have gone by when the same might have been said of every clergyman bearing orders in the Church of England. He is a man of the world, as I have above explained, and as such it is not probable that he will be a fanatic, though living examples may probably be adduced that fanaticism can exist under an archdeacon’s hat. And he walks just a head taller than other clergymen around him, receiving that pleasant attitude from the modest authority which he carries. Of all attitudes it is the most pleasant. He who stands high on a column can hardly talk pleasantly with those who stand round his pedestal; and that haranguing with loud voice from column top to column top is but a cold{53} ceremonial conversation. Who can imagine two archbishops slapping each other’s backs and being jolly together? But an archdeacon is not raised by his dignity above a capability for jovial intimacy, and yet he walks with his head pleasantly raised above the heads of other parsons around him. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2730/75214.html","bookId":1401,"book":{"id":1401,"title":"Clergymen of the Church of England","description":"简介： The old English archbishop was always a prince in the old times, but the English archbishop is a prince no longer in these latter days. He is still a nobleman of the highest rank,he of Canterbury holding his degree, indeed, above all his peers in Par...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2730","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
