{"id":37779,"no":5,"title":"CHAPTER IV","content":"Towards the end of this disturbed day, whilst the Orloffs were sitting at tea, Matrona asked her husband in a tone of curiosity, \"Where did you go just now with the student?\" Grigori seemed to be looking at her as through a mist, and he poured his tea from the cup into the saucer without replying. Towards mid-day, after they had disinfected the accordion-player\u0027s room, both Grigori and the sanitary officer had gone off together. On his return, Grigori had remained for nearly three hours in a silent, thoughtful mood. He had lain down on the bed, and had remained there till tea-time, his face turned up towards the ceiling, without speaking a word. In vain had Matrona tried, over and over again, to begin a conversation with him. He did not once swear, even when she worried him. This was quite an uncommon occurrence which gave her much cause for thought With the instinct of the woman whose life is absorbed in that of her husband, she guessed at once that something new had come between them. She felt alarmed, and was all the more curious to find out what had really happened. \"Come, arn\u0027t you feeling very well, Grischka?\" she began once more. Grigori gulped down the last drop of tea from his saucer, wiped his moustache with his sleeve, handed the cup to his wife, and said with a dark frown, \"I was with the medical student, up at the Infirmary.\" \"What, in the cholera hospital?\" exclaimed Matrona, in a scared voice; and then added, terrified, \"Are there many folk there?\" \"Fifty-three people, counting the one they brought from here.\" \"You don\u0027t say so?—and——\" \"About a dozen are getting better, they can already walk about; but they are quite yellow and thin.\" \"Are they really cholera patients...? Or have they been changed for others?—so that the doctors might be able to say they had cured them?\" \"You stupid goose!\" cried Grigori roughly, throwing an angry look at her. \"What a lot of foolish people you are, all of you! It is ignorance and stupidity, nothing else! One can stick here all one\u0027s days in blind ignorance—understanding nothing!\" He pulled the cup of tea, which Matrona had just poured out for him, violently towards him, and was silent. \"I should like to know where you get all your great wisdom?\" said Matrona mockingly. Orloff did not pay the least attention to her words. He grew as silent as before, and appeared quite unapproachable. The samovar was nearly extinguished, only a simmering sound escaping from it. There came into the windows from across the yard a smell of oil-paints, carbolic, and dirty slops. This smell, blending with the twilight of evening, and the monotonous singing of the samovar, awoke in the narrow close cellar a sensation, which lay with the weight of a nightmare on its occupants. The black ghastly mouth of the stove seemed to look at them menacingly, as if about to devour them. For a long time the Orloffs sat there in silence, nibbling sugar, gulping down mouthfuls of tea, and fidgeting with the tea-things. Matrona sighed, and Grigori drummed with his fingers on the tea-table. \"I never saw such cleanliness as reigns there!—never saw anything like it!\" Grischka broke in suddenly on the silence. \"Every one of the attendants wears white linen clothes; the sick people have baths as often as it is necessary—and they get wine to drink at five and a half roubles a bottle! And the food!... The smell is almost enough for one; it\u0027s so delicious! There is such care—such attention! —no mother could be kinder to a child. Yes, yes! when one comes to think of it! Here we live, and not a soul bothers his head about us, asks us how we are, or how we are getting on;—whether we are happy or unhappy—whether we have anything to put in our mouths or not But as soon as it\u0027s a case of dying, then they can\u0027t do enough for one, they will go to any expense. These infirmaries, for instance—and the wine—five and a half roubles the bottle! Don\u0027t the fellows reason then, what all that is going to cost them? They had better have spent it in helping the living every year a little.\" Matrona did not trouble to try and follow what he was saying. It was sufficient for her that his thoughts had taken a new direction, and that now her relations with Grigori would be on a different footing. She was quite convinced that this would be the result, and foresaw only too quickly what the consequences of this spiritual change would be to her. Fear and hope moved her, together with a feeling of enmity against her husband. \"They\u0027ll know very well what to do without you,\" she said ironically, drawing down the corners of her mouth. Grigori shrugged his shoulders, glancing askance at her; then continued to speak in still more meaning tones, this time watching her attentively. \"Whether they know it or not that is their business.... But if I have to die without seeing something of life, then I shall be the first to whom such a thing happens!... Understand then, this time of torment must come to an end! I won\u0027t sit here any longer, and wait till the cholera comes to me as it did to the accordion-player, and carries me off to the grave. No, I won\u0027t, I can\u0027t! I would rather go boldly and meet it.... Peter, the student, said to me—\u0027If Fate is against you, just show that you also can oppose Fate. You can but try which is the stronger.... It\u0027s simply a battle—nothing more.\u0027 You ask what is the matter with me?... I mean to go as an attendant in the Infirmary! do you understand?... I will crawl right into the jaws that threaten, and they may swallow me up, but at least I will defend myself with my hands and my feet!... I shan\u0027t be so badly off there; I shall get twenty roubles a month, besides tips, and my keep. It\u0027s just possible that I shall die there; but that might happen here!... At any rate it\u0027s a change in one\u0027s life.\" He struck the table with his fist in wild excitement, so that the tea-things clattered and danced. Matrona had listened to him at first full of curiosity and disquietude, but towards the end she interrupted angrily. \"The medical student has been advising you to do this, hasn\u0027t he?\" she asked in a meaning voice. \"Haven\u0027t I my own reason to go by? Can\u0027t I take a decision for myself?\" answered Grigori, evading a direct answer. \"Well!—and what am I to do meanwhile?\" \"What are you to do?\" asked Grigori, astonished. He had not once thought about this side of the question. The simplest way, of course, would be for him to leave his wife in their old lodgings. But wives are not always trustworthy, and he had not entire confidence in his Matrona. She required, according to him, a good deal of looking after. Struck by this thought, Grigori continued sullenly— \"The most simple thing would be for you to remain here. I shall always get my wages, and that will keep you. Hm!—yes,\" he said, apparently anxious to hear what she would reply to this. \"It\u0027s all the same to me,\" she answered quietly. And once more he noticed cross her face that woman\u0027s smile, which seemed to him to possess a double meaning, and which had so often before awoke in him a feeling of jealousy. It aroused his anger now just in the same way, but he knew how to control himself, and said abruptly, \"It\u0027s all nonsense, all that you say!\" He looked at her irritably, full of expectation of what she would reply. She however was silent, but continued to annoy him with the same provoking smile. \"Well!—what\u0027s to be done?\" asked Grigori at last in a higher key. \"Yes, what\u0027s to be done?\" replied Matrona indifferently, drying the teacups. \"You had better not play me any tricks, you serpent!—you had better not, or you will get one over the head!\" raged Orloff. \"It may be I am going to my death!\" \"Well, don\u0027t go then—I don\u0027t send you,\" replied Matrona quietly. \"Anyhow, I know that you are glad I am going,\" continued Orloff with a sneer. She was for once silent. This silence aggravated his rage, but he controlled himself so as not to destroy this moment of resolution by a horrid scene of wife-beating. And suddenly there entered his mind a thought, which appeared to him more diabolical than the aggravating mood of his wife. \"I feel certain you want me to be underground,\" he said, \"but just wait a little—we\u0027ll see who gets there first!—yes, that we will! I\u0027ll do something that will settle your business, my good woman!\" He jumped up from the table, took his cap in his hand, and hurried out. Matrona remained behind alone. She was dissatisfied with the result of her manoeuvres, and upset by his threats. With a steadily growing feeling of fear, she thought about the future. She looked out of the window and whispered softly to herself, \"Oh! Lord God! King of heaven! Holy Mother of God!\" She sat for a long time at the table, filled with terror-stricken presentiments, trying in vain to guess what was really the matter with Grigori. Before her stood the clean tea-things. The setting sun threw a great streak of light across the massive wall of the neighbour\u0027s house, which stood opposite the window of their room; the whiteness of the wall reflected this light, causing it to fall straight across the cellar and sparkle on the glass sugar-basin standing in front of Matrona. She watched with wrinkled brow this glimmer of light till her eyes grew tired. Then she rose, put the tea-things away, and lay down on the bed; she was feeling anxious and heavy-hearted. When Grigori returned it was already dark. She could tell by the way he walked that he was in a good temper. He did not swear at the darkness of the room, but called Matrona by her name, and then went up to the bed and sat down on it Matrona raised herself and sat by his side. \"Guess what\u0027s the latest news!\" began Orloff, smiling. \"Well, what is it?\" \"You are going to take a situation also.\" \"Where?\" she asked with stammering lips. \"In the same Infirmary as I shall be in,\" he explained in an impressive tone of voice. She fell on his neck, pressed him closely to her breast, and kissed his lips. He did not expect this and pushed her away. \"She is only pretending,\" he said to himself. \"The cunning creature, she does not really want to be with me! She thinks me a fool, the little serpent!\" \"Well, why are you so pleased about it?\" he asked in a rough voice that was hill of distrust He would have liked to have pushed her off the bed. \"I am only so pleased,\" she said, smiling happily. \"Don\u0027t try and humbug me; I know you!\" \"My dear brave knight!\" \"Shut up—or I\u0027ll give you something!\" \"My dear, dear Grischanja!\" \"Just say straight out what you want from me!\" Finally, when her endearments had appeased him a little, he asked her anxiously— \"Are you not frightened then at all?\" \"But we shall be together!\" she answered at once simply. It was pleasant to him to hear her say this, and he replied gratefully— \"You are indeed a plucky little wife!\" Then he pinched her till she screamed.","sourceLink":"http://novel.tingroom.com/jingdian/1882/54397.html","bookId":798,"book":{"id":798,"title":"The Orloff Couple and Malva","description":"简介： Alexei Maximovitch Peshkoff was born March 14, 1869, at Nijni Novgorod. On both his father\u0027s and mother\u0027s side he belonged to the people; his father followed the trade of a jobbing upholsterer, and his mother was the daughter of a dyer. He was left a...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1882","creation":"Aug 1, 2019 12:19:33 AM","modification":"Aug 1, 2019 12:19:33 AM"}}
