{"id":81123,"no":15,"title":"Page 15","content":"ALTHOUGH THERE WAS PROBABLY A LOT THEY could talk about, Jill didn\u0027t feel like it and neither did Car-los. They had to get a power cable, get back to the trolley, and not get killed in the process - not exactly the time for small talk, even if the streets did seem to be clear. And after the near death experience they\u0027d just shared running from the gas station, Carlos couldn\u0027t imagine chatting. What would we talk about, anyway? The weather? How many of her friends are dead? How about whether or not that Tyrant-thing is going to pop up and kill her anytime soon, or maybe the top ten reasons she doesn\u0027t like Nicholai... Jill was obviously uncomfortable with Nicholai al-most certainly because of her feelings about Um-brella and Carlos thought Nicholai didn\u0027t like her much, either, though he wasn\u0027t sure why; the squad leader had been perfectly polite, if a little brisk. Carlos liked that Jill wasn\u0027t like that with him, suspicious and challenging, but the animosity between her and Nicholai made him a little nervous. As cliched as it was, they needed to stick together if they meant to sur-vive. In any case, Jill wasn\u0027t volunteering to discuss her feelings on the topic, and Carlos was busy debating himself about whether or not to tell the others about Trent, and they both were watching their asses. They walked in silence from the trolley back into downtown and were almost back to the garage when Carlos saw someone he recognized. The dead man was propped in the corner of a wind-ing alley, not far from the grotesque bodies of two Umbrella creatures that Carlos had passed twice al-ready in the past couple of hours, like the thing he\u0027d killed by the restaurant; from the look of his corpse, he\u0027d been there awhile - which meant Carlos had passed him by as well, never noticing. It was kind of distressing to realize he didn\u0027t even look at their faces anymore, but he was a little too surprised to hang on to the feeling. \"Hey, I\u0027ve met this guy,\" he said, crouching next to him, trying to remember the name - Hennessy? Hen-nings, that was it. Tall, dark hair, a thin scar that ran from one corner of his mouth to his chin. Single gun-shot wound to the head, no obvious signs of decay...... and what the hell is he doing here? Jill had been walking a few steps ahead of Carlos. She turned and walked back, surreptitiously checking her watch. \"I\u0027m sorry about your friend, but we really have to get going,\" she said gently. Carlos shook his head and started to pat the body down, searching for extra ammo or some ID. \"No, we weren\u0027t friends. I met him at the field office right after I was hired, he worked for another U.B.C.S. branch, I think. The guy\u0027s a spook, ex-military, and he definitely didn\u0027t come to Raccoon with us... hola, what\u0027s this?\" Carlos pulled a small, leather-bound book about the size of a paperback out of Hennings\u0027s jacket lining and opened it. A journal. He flipped to the back and saw that the last entry was dated only the day before yes-terday. \"This could be important,\" he said, standing up. \"I\u0027m sure Nicholai knew him, he\u0027ll want to see this.\" Jill frowned. \"If it\u0027s important, maybe you should look at it now. Maybe it... maybe he mentioned Nicholai or Mikhail.\" The last was delivered lightly, but Carlos understood what she was getting at, and he didn\u0027t like it much. \"Look, Nicholai\u0027s kind of standoffish, but you don\u0027t know him. He lost his entire squad today, men he\u0027s probably known and worked with for years, so why don\u0027t you give him a break?\" Jill didn\u0027t flinch. \"Why don\u0027t you look through that book while I go get the power cable? You say this man\u0027s some kind of agent, that he works for Umbrella and that technically he shouldn\u0027t be here. I want to know what he had to say in his final hours, don\u0027t you?\" Carlos glared at her for another moment, then nod-ded reluctantly, letting the tension go. She was right; if there was something definitive in Hennings\u0027s notes about what was happening in Raccoon, it might be of use to them. \"Fine. Just grab every cable you can find and hurry back, okay?\" Jill nodded and was gone a second later, disappear-ing into the shadows without a sound. Amazing, how quiet she was; that took serious training. Although he didn\u0027t know much about them, Carlos had heard of the S.T.A.R.S., heard they were supposed to be good; Jill Valentine certainly proved it. \"Let\u0027s see what you have to say for yourself, Hen-nings,\" Carlos muttered, flipped open the journal, and started to read the final entry. I didn\u0027t know it was going to be like this. I owe them every-thing, but I would have turned this down if I had known. It\u0027s the screaming, I can\u0027t take it anymore and who gives a crap if my cover\u0027s blown? Everybody\u0027s going to die, it doesn\u0027t mat-ter. The streets are filled with screaming and that doesn\u0027t matter, either. When the company saved my ass two years ago, they told me that I was going to be working on the dark side, which was fine by me. I was about to be executed, I would have agreed to ten years of shit shoveling, and what the rep told me didn\u0027t sound too bad - me and some other cons were going to be trained as troubleshooters, dealing with illegal aspects of their research. They have their legit organizations already, couple of paramilitary units, the biohazard boys, a pretty decent envi-ronmental protection crew. Our job was going to be cleaning up messes before too many people noticed, and making sure the people who did notice never got a chance to talk about it. Six months of intensive training and I was ready for any-thing. Our first assignment was to get rid of some test sub-jects who\u0027d gone into hiding. These people wanted to go public about the drug they\u0027d been injected with, it was supposed to slow down the aging process but it gave all of them cancer. It took awhile, but we got all of them. I\u0027m not proud of myself for that, or for anything else I did in the last year and a half, but I learned to live with it. I was specially selected for Operation Watchdog. They planted a bunch of us here right after the first spill, just in case, but not everyone was chosen to be a Watchdog. They said I was more committed than the others, that I wouldn\u0027t crumble watching others die. Hooray for me. I worked in a warehouse for two weeks as an inventoiy specialist, waiting for something to happen, bored out of my goddamn skull - and then every-thing happened at once, and I haven\u0027t slept for three days and everyone keeps screaming until the flesh eaters get to them, and then they either die or they also start to eat. I tried to get hold of some of the others, the plants, but I can\u0027t find anyone. I only know a few of them anyway, four of the people selected as Watchdogs - Terry Foster, Martin, that spooky Russian, the hospital doc with the glasses. Maybe they\u0027re dead, maybe they escaped, maybe they have yet to be sent in. I don\u0027t care. I haven\u0027t made a report since day before yesterday, and Umbrella can blow it out their ass and burn in hell. I\u0027m sure I\u0027ll see them there. I\u0027ve chosen to pull the trigger myself, a head shot so I won\u0027t come back. I wish they\u0027d left me to be executed, I de-served that. Nobody deserves this. I\u0027m sorry. If anyone finds this, believe that much. The rest of the pages were blank. Carlos knelt next to Hennings in a kind of numb haze and examined his cold right hand for gunshot residue. It was there. Somebody must have taken the gun later... \"Carlos?\" He looked up and saw Jill holding a handful of ca-bles, a look of curious concern on her dirty, pretty face. \"That spooky Russian.\" How many could there pos-sibly be? Carlos didn\u0027t know what a Watchdog was, but he thought that Nicholai had some explaining to do and that it might be a good idea to get back to Mikhail as soon as possible. \"I think I owe you an apology,\" Carlos said, his stomach suddenly in knots. Nicholai had found Mikhail just after he\u0027d been shot, allegedly by some random stranger... \"What for?\" Jill asked. Carlos tucked the journal into a vest pocket, taking a last look at Hennings, feeling disgust and pity and a building anger at Umbrella, at Nicholai, at himself for being so naive. \"I\u0027ll explain on the way back,\" he said, gripping his assault rifle so tightly that his hands started to tremble, the anger continuing to rise in him like a black flood. \"Nicholai will be waiting for us.\" After installing the new fuse in the trolley\u0027s control panel, Nicholai decided to wait inside the station for Carlos and Jill to return. Many of the first-floor win-dows were broken, and it was dark inside; he\u0027d be able to hear any private, last-minute conversation between them as they entered the yard. Nicholai had no doubt that Jill would have a few words of warning for Carlos regarding Umbrella, perhaps about Nicholai directly, and the truth was, he just couldn\u0027t help himself; he wanted to know what the S.T.A.R.S. woman had to say, what paranoid drivel she\u0027d spout, and how Carlos would react. He\u0027d rejoin them a minute or so after they boarded the trolley, say he was checking the building for supplies or something, and see what developed from there. Do we take a ride, or will I be traveling alone? Per-haps we\u0027ll stay together for the night, foraging for food, taking turns at standing guard. I could kill them in their sleep; I could entice both of them to accom-pany me to the hospital to engage the Hunters; I could disappear, and allow them to evacuate thinking that their dear friend had been lost. Nicholai smiled, a cool night draft from a shattered pane breezing across his face. In a very real way, their lives were in his hands. It was a powerful feeling, even intoxicating, to have that kind of control. What had started out as a primarily financial venture had evolved into something new, something he had no words for, a game, but so much more. An understanding of human destiny like nothing he\u0027d ever experienced. He\u0027d al-ways known that he was different, that societal bound-aries didn\u0027t apply to him in the same way that others understood them; coming to Raccoon was an amplifica-tion of that, it was like an alternate reality in which they were the strangers, the outsiders, and he was the only one who really knew what was going on. For the first time in his life, he felt free to do as he liked. Nicholai heard the gate from the alleyway creak open, slowly, stealthily, and he backed away from the window. A second later, the two young soldiers stepped into view, moving almost as silently as himself. He noted with some surprise that they were sweeping the yard, as if they expected trouble. Perhaps they met up with the Tyrant-creature. That would certainly spice things up, if Jill was being tracked, although Nicholai meant to let the seeker have her if it showed up. It would kill anyone stupid enough to get in its way; Nicholai would happily step aside.Jill was slightly ahead of Carlos, and as they cau-tiously edged forward, Nicholai saw that she carriedseveral cables slung over one shoulder. Maybe hewould keep them around awhile, they were proving tobe successful at running errands.\"All clear,\" Carlos whispered, and Nicholai smiled tohimself. He could hear them perfectly. \"He has to be back by now, if he didn\u0027t run into oneof the creatures,\" Jill whispered.Nicholai\u0027s smile faltered a little. It was impossible,but... were they sweeping for him? \"I say we approach like we don\u0027t know anything,\" Carlos said, keeping his voice low. \"Get on board, get on either side of him, make him give up the rifle. He carries a knife, too.\" What is this, what\u0027s changed? Nicholai was con-fused, uncertain. What can they possibly know? Jill was nodding. \"Let me ask the questions. I know more background on Umbrella, I think I have a better chance of convincing him that we know all about this Watchdog mission. If he thinks we already know...\" \"...then he won\u0027t bother hiding anything,\" Carlos finished. \"Okay. Let\u0027s do it. Keep your weapon ready, just in case he\u0027s planning a surprise party.\" Jill nodded again, and they both straightened up, Carlos shouldering his rifle. They started toward the trolley, no longer bothering to keep quiet. The fury that overtook Nicholai was so passionate, so all encompassing, that for a moment he was literally blinded by it. Flashes of red and black pounded through his brain, thoughtless and violent, and the only thing that kept him from running out into the yard and murdering them both was the distant awareness that they were prepared for his attack. He almost did it any-way, the urge, the need to hurt them so strong that the consequences seemed unimportant. It took all of his control to stand still, to stand and shake and not scream his rage. After some indeterminate time, he heard the trolley\u0027s engine roar to life, the sound finally getting through to him. His mind began to work again, but he could only think simply, as though his anger was too great for complexity of thought. They knew he wasn\u0027t telling the truth. They knew something about Operation Watchdog, and they knew he was involved, so he was their enemy now. There would be no consummation of the careful groundwork he\u0027d laid, no development of trust for comrade Nicholai. It had all been a waste of his time... and to add insult to injury, he was now going to have to walk to the hospital. Nicholai ground his teeth together, drowning, the impotent hatred like a diseased secret that was crush-ing him from the inside out. They had done this to him, stolen his sense of control as though they had a right to it. My plans, my money, my decision. Mine, not theirs, mine - After a moment the mantra started to work, calming him slightly, the words soothing in their truth. Mine, I decide, me. Nicholai took several deep breaths and fixated on the only thing that could bring him relief as he heard the trolley slowly rumble away. He\u0027d find a way to make them sorry. He\u0027d make them beg for mercy, and laugh while they screamed.","sourceLink":"https://allnovel.net/nemesis-resident-evil-5/page-15.html","bookId":2460,"book":{"id":2460,"title":"Nemesis (Resident Evil #5)","description":"Storyline: Zombies. Mutant animals. Bioengineered weapons and surgically enhanced monsters. Secret labs and widespread conspiracies. It seemed impossible, but Kill Valentine and her teammates among the S.T.A.R.S. had seen it all firsthand when the Umbrella Corporation turned Raccoon City into a staging ground for the most insidious genetic experiments ever conceived. After all she\u0027s been through, Valentine is ready to leave that remote mountain community forever.But Umbrella isn\u0027t finished with Raccoon City. Too much evidence of their unethical and immoral research still exists. It must be recovered or destroyed -- and quickly -- before it can be traced back to Umbrella. And with William Birkin\u0027s mutagenic virus already spreading through the city like wildfire, drastic measures are needed. Under cover of night, mercenary teams have entered the city, along with something else -- Umbrella\u0027s failsafe: an evolved version of its Tyrant-class killing machines, a lethal creature code-named Nemesis. Now Nemesis is on the hunt. And Jill Valentine is about to become prey","cover":"https://allnovel.net/images/nemesis-resident-evil-5.jpg","author":"S.D. Perry","type":"Horror","source":"allnovel","link":"https://allnovel.net/nemesis-resident-evil-5.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:32:45 PM"}}
