{"id":64827,"no":4,"title":"Page 4","content":"“Let All Mortal Flesh Keep Silence.” Critias used to take me to St. John’s to listen to Eureka sing. This song often made the worshippers in the pews around me cry. It is unspeakably beautiful, and I can make out twelve-year-old Eureka’s voice perfectly, hear how her words are affected by her braces. I want to swoon, to fall down to the ground and scream. “Tell us what you feel,” Albion says. Eureka’s voice is so steady. I’m about to lose it. It takes all my strength to adopt a monotone. “I’m very tired. Is it a lullaby?” I do not want to know the person I sound like. “You’re doing fine,” Albion says. “You’re nearly done. We want to show you one more thing.” I know what he’s holding before he turns the photograph around. I try to look at it without seeing it. It’s a close-up of Eureka smiling on a beach. She’s wearing an orange tank top and her hair has been lightened by the sun. Her eyes are more alive than mine will ever be. It’s obvious I’ve failed. I will never give her up, never grow out of love. Why can’t my family see that love is the start and end of me? “Well, Ander?” Albion says. “Tell us what comes to mind.” “Demise,” I nearly choke. Around me, my family smiles. “Indeed, she has it coming,” Chora says. “We accept that you are ready.” “Are you ready, Ander?” my aunts and uncles ask in unison. “Yes,” I gasp. “Good.” Albion claps my shoulder, radiating emptiness into me. “It is time to kill Eureka.” If you enjoyed this special TEARDROP story, look for Lauren Kate’s new series, TEARDROP, the epic saga of Eureka Boudreaux, a seventeen-year-old girl whose tears have the power to raise the lost continent of Atlantis. Here’s a sneak peek at the first novel in the series. Excerpt copyright © 2013 by Lauren Kate. All rights reserved. Published in the United States by Delacorte Press, an imprint of Random House Children’s Books, a division of Random House LLC, New York. 1 EUREKA In the stillness of the small beige waiting room, Eureka’s bad ear rang. She massaged it—a habit since the accident, which had left her half deaf. It didn’t help. Across the room, a doorknob turned. Then a woman with a gauzy white blouse, olive-green skirt, and very fine, upswept blond hair appeared in the lamplit space. “Eureka?” Her low voice competed with the burbling of a fish tank that featured a neon plastic scuba diver buried to his knees in sand but showed no sign of containing fish. Eureka looked around the vacant lobby, wishing to invoke some other, invisible Eureka to take her place for the hour. “I’m Dr. Landry. Please come in.” Since Dad’s remarriage four years ago, Eureka had survived an armada of therapists. A life ruled by three adults who couldn’t agree on anything proved far messier than one ruled by just two. Dad had doubted the first analyst, an old-school Freudian, almost as much as Mom had hated the second, a heavy-lidded psychiatrist who doled out numbness in pills. Then Rhoda, Dad’s new wife, came onto the scene, game to try the school counselor, and the acupuncturist, and the anger manager. But Eureka had put her foot down at the patronizing family therapist, in whose office Dad had never felt less like family. She’d actually half liked the last shrink, who’d touted a faraway Swiss boarding school—until her mother caught wind of it and threatened to take Dad to court. Eureka noted her new therapist’s taupe leather slip-ons. She’d sat on the couch across from many similar pairs of shoes. Female doctors did this little trick: they slipped off their flats at the beginning of a session, slid their feet back into them to signal the end. They all must have read the same dull article about the Shoe Method being gentler on the patient than simply saying time was up. The office was purposefully calming: a long maroon leather couch against the shuttered window, two upholstered chairs opposite a coffee table with a bowl of those coffee gold-wrapped candies, a rug stitched with different-colored footprints. A plug-in air freshener made everything smell like cinnamon, which Eureka did not mind. Landry sat in one of the chairs. Eureka tossed her bag on the floor with a loud thump—honors textbooks were bricks—then slid down low on the couch. “Nice place,” she said. “You should get one of those swinging pendulums with the silver balls. My last doctor had one. Maybe a water cooler with the hot and cold taps.” “If you’d like some water, there’s a pitcher by the sink. I’d be happy to—” “Never mind.” Eureka had already let slip more words than she’d intended to speak the whole hour. She was nervous. She took a breath and reerected her walls. She reminded herself she was a Stoic. One of Landry’s feet freed itself from its taupe flat, then used its stockinged toe to loosen the other shoe’s heel, revealing maroon toenails. With both feet tucked under her thighs, Landry propped her chin in her palm. “What brings you here today?” When Eureka was trapped in a bad situation, her mind fled to wild destinations she didn’t try to avoid. She imagined a motorcade cruising through a ticker-tape parade in the center of New Iberia, stylishly escorting her to therapy. But Landry looked sensible, interested in the reality from which Eureka yearned to escape. Eureka’s red Jeep had brought her here. The seventeen-mile stretch of road between this office and her high school had brought her here—and every second ticked toward another minute during which she wasn’t back at school warming up for that afternoon’s cross-country meet. Bad luck had brought her here. Or was it the letter from Acadia Vermilion Hospital, stating that because of her recently attempted suicide, therapy was not optional but mandatory? Suicide. The word sounded more violent than the attempt had been. The night before she was supposed to start her senior year, Eureka had simply opened the window and let the gauzy white curtains billow toward her as she lay down in her bed. She’d tried to think of one bright thing about her future, but her mind had only rolled backward, toward lost moments of joy that could never be again. She couldn’t live in the past, so she decided she couldn’t live. She turned up her iPod. She swallowed the remainder of the oxycodone pills Dad had in the medicine cabinet for the pain from the fused disc in his spine. Eight, maybe nine pills; she didn’t count them as they tumbled down her throat. She thought of her mother. She thought of Mary, mother of God, who she’d been raised to believe prayed for everyone at the hour of death. Eureka knew the Catholic teachings about suicide, but she believed in Mary, whose mercy was vast, who might understand that Eureka had lost so much there was nothing to do but surrender. She woke up in a cold ER, strapped to a gurney and gagging on the tube of a stomach pump. She heard Dad and Rhoda fighting in the hallway while a nurse forced her to drink awful liquid charcoal to bind to the poisons they couldn’t purge from her system. Because she didn’t know the language that would have gotten her out sooner—“I want to live,” “I won’t try that again”—Eureka spent two weeks in the psychiatric ward. She would never forget the absurdity of jumping rope next to the huge schizophrenic woman during calisthenics, of eating oatmeal with the college kid who hadn’t slit his wrists deep enough, who spat in the orderlies’ faces when they tried to give him pills. Somehow, sixteen days later, Eureka was trudging into morning Mass before first period at Evangeline Catholic High, where Belle Pogue, a sophomore from Opelousas, stopped her at the chapel door with “You must feel blessed to be alive.” Eureka had glared into Belle’s pale eyes, causing the girl to gasp, make the sign of the cross, and scuttle to the farthest pew. In the six weeks she’d been back at Evangeline, Eureka had stopped counting how many friends she’d lost. Dr. Landry cleared her throat. Eureka stared up at the drop-panel ceiling. “You know why I’m here.” “I’d love to hear you put it into words.” “My father’s wife.” “You’re having problems with your stepmother?” “Rhoda makes the appointments. That’s why I’m here.” Eureka’s therapy had become one of Dad’s wife’s causes. First it was to deal with the divorce, then to grieve her mother’s death, now to unpack the suicide attempt. Without Diana, there was no one to intercede on Eureka’s behalf, to make a call and fire a quack. Eureka imagined herself still stuck in sessions with Dr. Landry at the age of eighty-five, no less screwed up than she was today. “I know losing your mother has been hard,” Landry said. “How are you feeling?” Eureka fixed on the word losing, as if she and Diana had been separated in a crowd and they’d soon reunite, clasp hands, saunter toward the nearest dockside restaurant for fried clams, and carry on as if they’d never been apart. That morning, across the breakfast table, Rhoda had sent Eureka a text: Dr. Landry. 3 p.m. There was a hyperlink to send the appointment to her phone’s calendar. When Eureka clicked on the office address, a pin on the map marked the Main Street location in New Iberia. “New Iberia?” Her voice cracked. Rhoda swallowed some vile-looking green juice. “Thought you’d like that.” New Iberia was the town where Eureka had been born, had grown up. It was the place she still called home, where she’d lived with her parents for the unshattered portion of her life, until they split and her mom moved away and Dad’s confident stride began to resemble a shuffle, like that of the blue claw crabs at Victor’s, where he used to be the chef. That was right around Katrina, and Rita came close behind. Eureka’s old house was still there—she’d heard another family lived in it now—but after the hurricanes, Dad hadn’t wanted to put in the time or emotion to repair it. So they’d moved to Lafayette, fifteen miles and thirty light-years from home. Dad got a job as a line cook at Prejean’s, which was bigger and far less romantic than Victor’s. Eureka changed schools, which sucked. Before Eureka knew that Dad was even over her mom, the two of them were moving into a big house on Shady Circle. It belonged to a bossy lady named Rhoda. She was pregnant. Eureka’s new bedroom was down the hall from a nursery-in-progress. So, no, Rhoda, Eureka did not like that this new therapist lived way out in New Iberia. How was she supposed to drive all the way to the appointment and make it back in time for her meet? The meet was important, not only because Evangeline was racing their rival, Manor High. Today was the day Eureka had promised Coach she’d make her decision about whether to stay on the team. Before Diana died, Eureka had been named senior captain. After the accident, when she was physically strong enough, friends had begged her to run a few summer scrimmages. But the one run she’d gone to had made her want to scream. Underclassmen held out cups of water drenched in pity. Coach chalked up Eureka’s slow speed to the casts binding her wrists. It was a lie. Her heart wasn’t in the race anymore. It wasn’t with the team. Her heart was in the ocean with Diana.","sourceLink":"https://allnovel.net/last-day-of-love-a-teardrop-story-teardrop-0/page-4.html","bookId":1932,"book":{"id":1932,"title":"Last Day of Love: A Teardrop Story (Teardrop #0)","description":"Storyline: Last Day of Love: A Teardrop Story (Teardrop 0.5) Don\u0027t miss this beautiful original digital story by Lauren Kate, the #1 New York Times bestselling author of the Fallen series, set in the romantic world of Teardrop, a place of devastating secrets and dark magic . . . a world where everything you love can be washed away.","cover":"https://allnovel.net/images/last-day-of-love-a-teardrop-story-teardrop-0.jpg","author":"Lauren Kate","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/last-day-of-love-a-teardrop-story-teardrop-0.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:55:37 AM"}}
