{"id":83961,"no":10,"title":"Page 10","content":"“What?” Scott asks. Good—I messed with him without cursing.\n “He’s not dressed like a moron, so why should I?” I motion to the designer jeans and starched Catholic-schoolgirl shirt disgracing my body. Per Scott’s request to play nice with Allison, I stepped out of the dressing room to look at this atrocity in the full-length mirror.\n When I returned, my clothes were gone.\n Tonight, I’m searching for a pair of scissors and bleach.\n Scott censures me by subtly shaking his head. I have close to a whole year of this bull in front of me, and the woman I’m trying to protect I can’t even see—my mom. A part of my brain tingles with panic. How is she? Did her boyfriend hit her again? Is she worried about me?\n “You’re going to love it here,” says Taco Bell Boy—I mean Ryan.\n “Sure I am.” My tone indicates I’m going to love this place as much as I’d love getting shot in the head.\n Scott clears his throat again and I wonder if he cares that people will assume he’s diseased.\n “Ryan’s father owns a construction business in town and he’s on the city council.” Underlying message to me: don’t screw this moment up.\n “Of course.” Of course. Story of my freaking life. Ryan’s the rich boy that has everything. Daddy who owns the town. Daddy who owns the business. Ryan, the boy who thinks he can do anything he wants because of it.\n Ryan flashes me an easygoing grin and it’s sort of hypnotizing. As if he created it just for me. It’s a glorious grin. Perfect. Peaceful.\n With a hint of dimples. It promises friendship and happiness and laughter and it makes me want to smile back. My lips start to curve into an answer and I stop myself abruptly.\n Why do I do this to myself? Guys like him don’t go for girls like me. I’m a toy to them. A game. And these types of guys, they all have the same rules of play: smile, trick me into thinking that they like me, then toss me to the side once I’ve been used. How many countless losers do I have to stupidly make out with only to regret it in the morning? Over the past year—too many.\n But while listening to Ryan easily digress into a conversation with Scott about baseball, I swear that I’m done with loser guys. Done with feeling used. Just done.\n And this time, I won’t break the promise— no matter how lonely I get.\n “Yeah,” Ryan says to Scott as if I’m not standing right here, as if I’m not important enough to involve in conversation. “I think the Reds have a shot this year.”\n God, I hate Ryan. Standing there all perfect with his perfect life and perfect body and perfect smile, pretending he never laid eyes on me before. He glances at me from the corner of his eye and I realize why he’s pouring on the charm. Ryan wants to impress Scott. Guess what? Misery definitely loves company. My life shouldn’t be the only one that sucks. “He hit on me.”\n Silence as my words kill the moronic baseball conversation. Scott rubs his eyes.\n “You just met him.”\n “Not now. Friday night. He hit on me and he stared at my ass while he did it.”\n Joy. Utter joy. Okay, not utter, but the sole joy I’ve had since Friday night. Ryan yanks off his hat, runs his hand through his mess of sandy-blond hair, and shoves the hat back on. I like him better with his hat off.\n “Is this true?” Scott asks.\n “Yes,” stutters Ryan. “No. I mean yes. I asked for her phone number, but she didn’t give it to me. But I was respectful, I swear.”\n “You stared at my ass. A lot.” I turn and lean over a little so I can give a demonstration.\n “Remember, there was a rip right along here.” I slide my finger along the back of my leg.\n “You bought me tacos afterward. And a drink.\n So I’m assuming you must have enjoyed the view.”\n I hear muffled male comments and I peek at the crowd of men farther down the sidewalk.\n The first genuine smile slips across my face.\n Scott’s going to love a show. Maybe if I push hard enough I’ll be home in Louisville by dinner.\n “Elisabeth.” Scott drops his voice to trailer-park pissed. “Turn around.”\n Twelve different shades of red blotch Ryan’s cheeks. He doesn’t even look at my ass, but at my uncle. “Okay…yes, I asked her out.”\n Scott does a double take. “You asked her out?”\n Hey now. Why’s he surprised? I’m not a dog.\n “Yes,” says Ryan.\n “You wanted to take her on a date?”\n Uh-oh. Scott sounds happy. No. I’m not going for happy.\n “Yes.” Ryan holds out his hands. “I thought…I thought…”\n “That I would be easy?” I snap, and Scott winces.\n “That she was funny,” Ryan says.\n Yeah. I’m sure that’s exactly what he thought. “More like you thought it would be fun to screw with me. Or just plain screw.”\n “Enough,” hisses Scott. His narrowing blue eyes rage at me as I thrust my hands in the stiff pockets of the new jeans. Scott lowers his head and pinches the bridge of his nose before forcing that fake relaxed grin into place. “I apologize for my niece. She’s had a rough weekend.”\n I don’t want him to apologize for me to anyone. Especially not to this arrogant ass. My mouth drops open, but the brief white-trash glance Scott gives me shuts it. Scott becomes Mr. Superficial again. “I understand if you don’t want to help Elisabeth at school.”\n Ryan has this blank, way too innocent expression. “Don’t worry, Mr. Risk. I’d love to help Elisabeth. ” He turns to me and smiles.\n This smile isn’t genuine or heartwarming, but cocky as hell. Bring it, jock boy. Your best won’t be good enough.\n Ryan\n THE WALLS OF OUR KITCHEN used to be burgundy. As kids, Mark and I would race home from the bus stop and when we’d burst into the kitchen we’d be greeted by the aroma of freshly baked cookies. Mom would ask us about our day while we dunked the hot cookies in milk. When Dad came home from work, he’d sweep Mom into his arms and kiss her.\n Mom’s laughter in Dad’s arms was as natural as Mark’s and my constant banter.\n With an arm still wrapped around her waist, he’d turn to us and say, “How are my boys?”\n Like Mark and I didn’t exist without each other.\n Thanks to the renovations Dad finished last week, the kitchen walls are gray now. And thanks to my brother’s announcement and my father’s reaction to the announcement this summer, the loudest sound in the kitchen is the clink of knives and forks against china.\n “Gwen came to your game,” says Mom. It’s only the third time she’s mentioned it in the past twenty-four hours.\n Yeah, with Mike. “Uh-huh.” I shove a hunk of pot roast into my mouth.\n “Her mom said she still talks about you.”\n I stop mid-chew and glance at Mom. Proud for earning a reaction from me, she smiles.\n “Leave him alone,” Dad says. “He doesn’t need a girl distracting him.”\n Mom purses her lips and we enter another five minutes of clinking forks and knives. The silence stings…like frostbite.\n Unable to stomach the tension much longer, I clear my throat. “Did Dad tell you we met Scott Risk and his—” psychotic “—niece?”\n “No.” My mother stabs at the cherry tomato rolling around in her salad bowl. The moment she spears the small round vegetable, Mom glares at Dad. “He has a niece?”\n Dad holds her gaze with irritated indifference and follows it up with a drink from his longneck.\n “I gave you a wineglass,” Mom reminds him.\n Dad places the longneck, which drips with condensation, next to said glass right on the wood of the table—without a coaster. Mom shifts in her seat like a crow fluffing out its wings. The only thing she’s missing is the pissed-off caw.\n For the last few months, Dad and I have been eating our dinners in the living room while watching TV. Mom gave up food after Mark left.\n Mom and Dad began marriage counseling a few weeks ago, though they have yet to directly tell me. The need to project perfection won’t allow them to admit to a flaw like their marriage needing help from an outside source.\n Instead I found out the same way I discover anything in this house: I overheard them fighting in the living room while I lay in bed at night.\n Last week, their marriage counselor recommended that Mom and Dad try to do something as a family. They fought for two days over what that something should be until they settled on Sunday dinner.\n It’s why I invited Mark. We haven’t had a dinner together since he left and if he’d showed, maybe the four of us could have found a way to reconnect.\n I wonder if Mom and Dad feel the emptiness of the chair next to mine. Mark possessed this charm that kept my parents from fighting. If they were annoyed with each other, Mark would tell a story or a joke to break the chill.\n The arctic winter in my house never existed when he was home.\n “Yeah, he has a niece,” I say, hoping to move the conversation forward and to fill the hollowness inside me. “Her name is Elisabeth.\n Beth.” And she’s making my life hell—not too different from suffering through this dinner.\n I tear a biscuit apart and slather on some butter. Beth embarrassed me in front of Scott Risk and I lost a dare because of her. I drop the biscuit—the dare. A spark ignites in my brain.\n Chris and I never set a time limit on it, which means I can still win.\n Mom straightens the napkin on her lap, disrupting my thoughts. “You should be friendly with her, Ryan, but maintain your distance. The Risks had a reputation years ago.”\n Dad’s chair scrapes against the new tile and he makes a disgusted noise in his throat.\n “What?” Mom demands.\n Dad rolls his shoulders back and focuses on his beef instead of answering.\n “You have something to say,” prods Mom, “say it.”\n Dad tosses his fork onto his plate. “Scott Risk has some valuable contacts. I say get close to her, Ryan. Show her around. If you do a favor for him, I’m sure he’d do one for you.”\n “Of course,” says Mom. “Give him advice that goes directly against mine.”\n Dad begins talking over her and their combined raised voices cause my head to throb. Losing my appetite, I slide my chair away from the table. It’s gut-wrenching, listening to the ongoing annihilation of my family. There is absolutely no worse sound on the face of the planet.\n Until the phone rings. My parents fall silent as all three of us look over at the counter and see Mark’s name appear on the caller ID. A rocky combination of hope and hurt creates a heaviness in my throat and stomach.\n “Let it go,” Dad murmurs.\n Mom stands on the second ring and my heart beats in my ears. Come on, Mom, answer.\n Please.\n “We could talk to him,” she says as she stares at the phone. “Tell him that as long as he keeps it a secret he can come home.”\n “Yeah,” I say, hoping that one of them will change their minds. Maybe this time Mark would choose to stay and fight instead of leaving me behind. “We should answer.” \n","sourceLink":"https://allnovel.net/dare-you-to-pushing-the-limits-2/page-10.html","bookId":2753,"book":{"id":2753,"title":"Dare You To (Pushing the Limits #2)","description":"Storyline: \n Dare You To (Pushing the Limits #2) \n Ryan lowers his lips to my ear. \"Dance with me, Beth.\" \n \"No.\" I whisper the reply. I hate him and I hate myself for wanting him to touch me again.... \n \"I dare you...\" \n If anyone knew the truth about Beth Risk\u0027s home life, they\u0027d send her mother to jail and seventeen-year-old Beth who knows where. So she protects her mom at all costs. Until the day her uncle swoops in and forces Beth to choose between her mom\u0027s freedom and her own happiness. That\u0027s how Beth finds herself living with an aunt who doesn\u0027t want her and going to a school that doesn\u0027t understand her. At all. Except for the one guy who shouldn\u0027t get her, but does.... \n Ryan Stone is the town golden boy, a popular baseball star jock-with secrets he can\u0027t tell anyone. Not even the friends he shares everything with, including the constant dares to do crazy things. The craziest? Asking out the Skater girl who couldn\u0027t be less interested in him. \n But what begins as a dare becomes an intense attraction neither Ryan nor Beth expected. Suddenly, the boy with the flawless image risks his dreams-and his life-for the girl he loves, and the girl who won\u0027t let anyone get too close is daring herself to want it all....\n \n","cover":"https://allnovel.net/images/dare-you-to-pushing-the-limits-2.jpg","author":"Katie McGarry","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/dare-you-to-pushing-the-limits-2.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 4:54:35 PM"}}
