{"id":83964,"no":13,"title":"Page 13","content":"Isaiah grimaces. “And?”\\n\\n “No ditching school. No being disrespectful to his wife or teachers or people.”\\n\\n “You’re screwed.”\\n\\n “Fuck you again.”\\n\\n “Love you too, Sunshine.”\\n\\n I ignore him. “Good grades. No smoking.\\n\\n No drugs. No drinking. And…no contact with Mom.”\\n\\n “Hmm. I agree with the last one. Can you make it happen this time?”\\n\\n I glare at him. He flips me off. God, he’s aggravating. “No more cursing. Keep curfew.”\\n\\n His head pops up. “He’s letting you out?”\\n\\n “Probably with a GPS stitched under my forehead. I have to clear every second of every outing through him. What are you thinking?”\\n\\n “I’m thinking you’re a bright girl who could manipulate the devil for a passage out of hell.\\n\\n You get out of that house and I’ll come get you. Any day. Any time. And I’ll have you safely home by curfew.”\\n\\n Hope fills me, yet it’s not enough. I need more than Isaiah. I need something else. I fiddle with the ends of my shirttail. “Will you take me to see my mom?”\\n\\n He sighs. “No. She’s no good for you.”\\n\\n “He’ll kill her.”\\n\\n “Let him. She made her choices.”\\n\\n I stumble back as if he punched me. “How can you say that?”\\n\\n The anger returns to his eyes. “How? A few months ago, she let you bleed in front of her.\\n\\n How could she go back to that bastard? How could she let you take the fall for her? Don’t play the sympathy card on me. No one fucks with you. Do you understand me?”\\n\\n I nod to placate him, but I’ll find another way. Isaiah’s right. I can play Scott, keep Isaiah, and find a way to take care of Mom.\\n\\n He pulls something out of his back pocket and tosses it to me. I slide open a shiny new gray cell phone. “We saw Scott trash your cell so I bought a new one for you and put you on my plan.”\\n\\n I quirk up a smile. “You got a plan?”\\n\\n He shrugs. “Noah and I got a plan and we put you on it. Cheaper that way.”\\n\\n “How…” Echo inspired. “Grown-up.”\\n\\n “Yeah. Noah’s been doing a lot of that.”\\n\\n “How did you know? That I’d be here? In Groveton? At school?”\\n\\n Isaiah focuses on the trees. “Echo. At the police station, she sat close enough to your uncle and your mom to overhear what was going down. Then Echo talked Shirley into giving us the rest of the information. Scott told Shirley his plans.”\\n\\n “Great,” I mumble. “I’m in debt to psycho bitch.” The moment I say it, I feel a twinge of remorse. She’s not entirely crazy, but the truth is our relationship is strained. She’s sweet and she’s nice and she makes Noah happy, but she’s brought change…too much change…and how can I like that?\\n\\n He shifts from one side to another. That’s not good. “What else, Isaiah?”\\n\\n “Echo sold a painting.”\\n\\n I raise my eyebrows. “So?” Echo’s been selling her paintings since last spring.\\n\\n He reaches into his back pocket again and produces a wad of cash. Holy Mother of God, I’m going to start painting. “It was one of her favorites. Something she painted for her brother before he died. Noah was ticked when he found out.” He holds out the money.\\n\\n “She did it for you.”\\n\\n Pissed. I’m beyond pissed. “I don’t want her charity.” She didn’t do it for me. She did it for Noah and Isaiah, but she mainly did it so I’d have to owe her and she knows that pride is one of the few things I rightfully own.\\n\\n Isaiah closes the distance between us and shoves the bills in my back pocket before I have a chance to step away. “Take it. I want to know you have cash in case you need to bail quickly. It’s my debt to pay.”\\n\\n The wad of cash feels heavy in my back pocket. Even though I’m determined to see this year out, I also know that life sucks. It’s best to be prepared.\\n\\n The bell rings, signaling the end of lunch. “I gotta go.”\\n\\n As I walk past him, Isaiah wraps a hand around my arm. “One more thing.” His eyes darken into shadows. “Call me. Anytime. I swear to you, I’ll answer.”\\n\\n “I know.” It takes a second to work up the courage to say it, but he’s my best friend and worth the words. “Thank you.”\\n\\n “Anything for you.” Isaiah releases me, and as I walk back to school my fingers trace the area where my skin still burns from his touch. He’s my friend…my only friend.\\n\\n I pull on the handle of the same door I’d snuck out of and my heart sinks as the door stays shut. No. I broke the cardinal rule of ditching: always make sure you can sneak back in. I wiggle the handle. Nothing. I wiggle the other door’s handle. Same result. The dread sparks deep in my stomach and becomes a flash fire of panic in a heartbeat. I can’t get back in, which means I’ll be busted when I don’t show for next period. When Scott finds out, he’ll burst a blood vessel.\\n\\n With both hands, I grab the handle again.\\n\\n “Come on!” I yank. The door gives. A hand flies out, snatches my arm, and drags me into the building.\\n\\n I glance up at my rescuer and my insides become liquid when I see the most beautiful light brown eyes staring down at me. Ruining the moment, their owner speaks. “I’m not sure this is what your uncle meant by showing you around.”\\n\\n “Damn, my life sucks,” I mutter.\\n\\n It’s Ryan. I really hate this town.\\n\\n Ryan\\n\\n SKATER GIRL IS ON THE LOSING END of this moment. She snaps her arm out of my hand and glares at me with those unblinking blue eyes. “I don’t want your help.”\\n\\n Winning feels great. Awesome. Drives me higher than anything else in the world. The twisting and pressure that I so often feel—gone. Winning leaves my muscles loose, makes me lift my head higher, and damn if it doesn’t bring on a smile. “You may not want it, but you need it.”\\n\\n The second bell rings and Beth slams into my arm as she stalks past. Twenty bucks she thinks she’s late for class. “It’s only second bell.”\\n\\n She hesitates and her spine goes rigid. “How many are there?”\\n\\n “After lunch?” I casually walk up to her.\\n\\n This is too much fun. “Three. One to release lunch. A two-minute warning bell. Then the tardy bell.”\\n\\n She releases a slow stream of air from her perfectly shaped lips, and relief relaxes her cheeks. This girl is sexy, but she’s also a handful. If I hadn’t accepted the dare, I’d toss her into avoid-like-the-plague territory.\\n\\n “What’s your next class?”\\n\\n “Go to hell.” Beth rushes down the hallway and I pursue her at a leisurely pace.\\n\\n Lockers lurch open and clang shut. Chatter fills the hallway. People stop and stare as Beth moves. Moves—that’s exactly what the girl does. She holds her head high and owns the middle of the hallway. A few kids have transferred to this school since my freshman year, but they spent their first couple of weeks trying to blend into the paint. Not Beth. Her hips have this easy sway that catches the eye of every guy, including me.\\n\\n Beth checks out the numbers over the doors, no doubt searching for her fifth-period room. I pick up the pace and fall in step with her as she pulls a badly folded schedule out of her back pocket. Her thumb skims the list until it finds its target: Health/Physical Education.\\n\\n The odds of winning just increased in my favor. That’s my next class too. “I can show you where it is.”\\n\\n “Are you stalking me? If so, you’ll get your ass kicked.”\\n\\n “By who? The guy you made out with in the tree line?” I have a hard time believing that a man as great as Scott Risk would allow his niece to date Tattoo Guy, but maybe that’s why he switched her schools. You gotta love a man who takes care of family. “Sorry to tell you, but I can hold my own.”\\n\\n Beth wears a scowl that could kill on sight.\\n\\n “Threaten Isaiah again and I’ll kick your ass.”\\n\\n I chuckle at the thought of the tiny, black-haired threat throwing swings at me. Punches from her would feel like a bunny biting a lion.\\n\\n By the way she pinches her lips together, I can tell my laughter pisses her off. Time to end this bull. “I’m just trying to be helpful.”\\n\\n “Helpful? You mean you’re trying to help yourself. You’re a walking hard-on for my uncle.”\\n\\n A muscle near my eye ticks. On rare occasions, bunnies can develop rabies, and Scott did warn me she was rough around the edges. He failed to mention that razor blades are her softest layer. My mouth snaps open to ask what the hell is wrong with her when Lacy sidles between us. She shoots me a warning glare. “I got this.”\\n\\n “Come on, dawg.” Chris waggles his eyebrows and I realize he sent in Lacy to disturb us, thinking he interrupted me making a play. “Let’s go to class.”\\n\\n “Yeah.” Class. I want to win the dare, but that won’t happen if I lose my temper. I follow Chris, willing to do anything to get away from Beth.\\n\\n Beth\\n\\n The moment Ryan turns his back, I sag against a purple locker. The acrid smell of fresh paint fills my nose. Watch—the damn locker is newly painted and I’ll have purple on my ass.\\n\\n A hallway full of strange teenagers gawk at me like I’m an animal caged at the zoo. I swallow when two girls giggle as they pass.\\n\\n Both crane their necks to get a better glimpse of the new school freak.\\n\\n People judge. They’re judging me now.\\n\\n “Your hair used to be blond,” says Lacy.\\n\\n What is the deal with the people in this town and my hair? I barely recognize the girl I once claimed as a friend. We sized each other up in English, trying to figure out if the other was really who we thought she was. Lacy has the same chestnut-brown hair as when we were kids. Just as long, but not as stringy. It’s thick now. She nods at Ryan’s friend Chris, indicating that he should follow Ryan into the classroom and he does.\\n\\n “You used to hang out with cool people,” I say.\\n\\n The right corner of her lips tilts up. “I used to hang with you.”\\n\\n “That’s what I just said.”\\n\\n The bell rings and a few remaining stragglers race to class. Lucky me, I share another class with Ryan. I push off the wall, check for paint, and feel off-balance when Lacy follows.\\n\\n The cliques split off as fast as cockroaches when a light shines. Ryan and a couple other guys relax at a table near the back as if they’re God’s gift to women. Their expensive jeans and T-shirts that sport their favorite moronic teams scream total jock. I hand my enrollment sheet to a teacher deep in conversation with two more jocks. They discuss baseball, football, basketball. Blah, blah, blah. It must be a male thing to talk about playing with balls.\\n\\n Lacy plops down at an empty table and kicks out a chair for me to join her. “Ryan says you go by Beth.”\\n\\n I fall into the chair and glance over at Ryan. He quickly averts his eyes. My blood tingles—was he really staring at me? Stop it.\\n\\n The tingling fades. Of course he was. You’re the freak, remember? “What else did Ryan tell you?”\\n\\n “Everything. Meeting you Friday night. \\n\\n","sourceLink":"https://allnovel.net/dare-you-to-pushing-the-limits-2/page-13.html","bookId":2753,"book":{"id":2753,"title":"Dare You To (Pushing the Limits #2)","description":"Storyline: Dare You To (Pushing the Limits #2) \\n Ryan lowers his lips to my ear. \"Dance with me, Beth.\" \\n \"No.\" I whisper the reply. I hate him and I hate myself for wanting him to touch me again.... \\n \"I dare you...\" \\n If anyone knew the truth about Beth Risk\u0027s home life, they\u0027d send her mother to jail and seventeen-year-old Beth who knows where. So she protects her mom at all costs. Until the day her uncle swoops in and forces Beth to choose between her mom\u0027s freedom and her own happiness. That\u0027s how Beth finds herself living with an aunt who doesn\u0027t want her and going to a school that doesn\u0027t understand her. At all. Except for the one guy who shouldn\u0027t get her, but does.... \\n Ryan Stone is the town golden boy, a popular baseball star jock-with secrets he can\u0027t tell anyone. Not even the friends he shares everything with, including the constant dares to do crazy things. The craziest? Asking out the Skater girl who couldn\u0027t be less interested in him. \\n But what begins as a dare becomes an intense attraction neither Ryan nor Beth expected. Suddenly, the boy with the flawless image risks his dreams-and his life-for the girl he loves, and the girl who won\u0027t let anyone get too close is daring herself to want it all....\\n","cover":"https://allnovel.net/images/dare-you-to-pushing-the-limits-2.jpg","author":"Katie McGarry","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/dare-you-to-pushing-the-limits-2.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 4:54:35 PM"}}
