{"id":92049,"no":115,"title":"Page 115","content":"Green grass spread around Rand’s feet. The guards nearby jumped back, hands to swords, as a swath of life extended from Rand. The brown and yellow blades colored, as if paint had been poured on them, then came upright—stretching as if after long slumber. The greenness filled the entire garden clearing. \"He’s still shielded!\" the sul’dam cried. \"Honored One, he is still shielded!\" Mat shivered, and then noticed something. Very soft, so easy to miss. \"Are you singing?\" Mat whispered to Rand. Yes . . . it was unmistakable. Rand was singing, under his breath, very softly. Mat tapped his foot. \"I swear I’ve heard that tune somewhere, once . . . Is it ‘Two Maids at the Water’s Edge’?\" \"You’re not helping\", Rand whispered. \"Quiet\". Rand continued his song. The green spread to the trees, the firs strengthening their limbs. The other trees began to shoot out leaves—they were indeed peach trees—growing at great speed, life flooding into them. The guards looked about themselves, spinning, trying to watch all of the trees at once. Selucia had cringed. Tuon remained upright, her eyes focused on Rand. Nearby, the frightened sul’dam and damane must have stopped concentrating, for the bonds holding Mat vanished. \"Do you deny my right?\" Rand demanded. \"Do you deny that my claim to this land precedes your own by thousands of years?\" \"I . . \". Tuon took a deep breath and stared at him defiantly. \"You broke the land, abandoned it. I can deny your right\". Behind her, blossoms exploded onto the trees like fireworks, white and deep pink. The bursts of color surrounded them. Petals sprayed outward with their growth, breaking from the trees, catching in the wind and swirling through the clearing. \"I allowed you to live\", Rand said to Tuon, \"when I could have destroyed you in an instant. This is because you have made life better for those under your rule, though you are not without guilt for the way you have treated some. Your rule is as flimsy as paper. You hold this land together only through the strength of steel and damane, but your homeland burns. \"I have not come here to destroy you. I come to you now to offer you peace, Empress. I have come without armies, I have come without force. I have come because I believe that you need me, as I need you\". Rand stepped forward and, remarkably, went down on one knee, bowing his head, his hand extended. \"I extend my hand to you in alliance. The Last Battle is upon us. Join me, and fight\". The clearing fell still. The wind stopped blowing, the thunder stopped rumbling. Peach blossoms wafted to the now-green grass. Rand remained where he was, hand extended. Tuon stared at that hand as if at a viper. Mat hurried forward. \"Nice trick\", he said under his breath to Rand. \"Very nice trick\". He approached Tuon, taking her by the shoulders and turning her to the side. Nearby, Selucia looked stunned. Karede was not in much better shape. They would not be any help. \"Hey, look\", Mat said to her softly. \"He’s a good fellow. Hes rough at the corners sometimes, but you can trust his word. If he’s offering you a treaty, he’ll make good on it\". \"That was a very impressive display\", Tuon said softly. She was trembling faintly. \"What is he?\" \"Burn me if I know\", Mat said. \"Listen, Tuon. I grew up with Rand. I vouch for him\". \"There is a darkness in that man, Matrim. I saw it when last he and I last met\". \"Look at me, Tuon. Look at me\". She looked up, meeting his gaze. \"You can trust Rand al’Thor with the world itself\", Mat said. \"And if you can’t trust him, trust me. Hes our only choice. We don’t have time to take him back to Seanchan. \"I’ve been in the city long enough to have a little peek at your forces. If you’re going to fight the Last Battle and recapture your homeland, you’re going to need a stable base here in Altara. Take his offer. He just claimed this land. Well, make him secure your borders as they are and announce it to the others. They might listen. Take a little pressure off you. Unless, that is, you want to fight the Trollocs, the nations of this land, and the rebels in Seanchan at the same time\". Tuon blinked. \"Our forces\". \"What?\" \"You called them my forces\", she said. \"They are our forces. You are one of us now, Matrim\". \"Well, I guess I am at that. Listen, Tuon. You have to do this. Please\". She turned, looking at Rand, kneeling in the middle of a pattern of peach blossoms that seemed to have circled out from him. Not a one had fallen on him. \"What is your offer?\" Tuon asked. \"Peace\", Rand said, standing, hand still out. \"Peace for a hundred years. Longer, if I can make it so. I have persuaded the other rulers to sign a treaty and work together to fight the armies of the Shadow\". \"I would have my borders secured\", Tuon said. \"Altara and Amadicia shall be yours\". \"Tarabon and Almoth Plain as well\", Tuon said. \"I hold them now. I will not be forced from them by your treaty. You wish peace? You will give me this\". \"Tarabon and half of Almoth Plain\", Rand said. \"The half you already control\". \"I would have the all of the women this side of the Aryth Ocean who can channel as damane\", Tuon said. \"Do not strain your luck, Empress\", Rand said dryly. \"I . . . I will allow you to do what you will in Seanchan, but I will require you to relinquish any damane you have taken while in this land\". \"Then we have no agreement\", Tuon said. Mat held his breath. Rand hesitated, hand lowering. \"The fate of the world itself could hang on this, Fortuona. Please\". \"If it is that important\", she said firmly, \"you can agree to my demand. Our property is our own. You wish a treaty? Then you will get it with this clause: We keep the damane we already have. In exchange, I will allow you to leave in freedom\". Rand grimaced. \"You’re as bad as one of the Sea Folk\". \"I should hope I’m worse\", Tuon said, no emotion in her voice. \"The world is your charge, Dragon, not mine. I care for my empire. I will greatly need those damane. Choose now. As I believe you said, your time is short\". Rand’s expression darkened; then he thrust his hand outward. \"Let it be done. Light be merciful, let it be done. I will carry this weight too. You may keep the damane you already have, but you shall not take any from among my allies while we fight the Last Battle. Taking any afterward who are not in your own land will be seen as breaking the treaty and attacking","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-115.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. In Andor, the Trollocs seize Caemlyn. In the wolf dream, Perrin Aybara battles Slayer. Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
