{"id":92055,"no":121,"title":"Page 121","content":"Lan stepped away from the fire and walked through the camp, stopping by the horselines to check on Mandarb. The stallion was holding up well, though he bore a large wound on his left flank where his coat would never grow back; it seemed to be healing well. The grooms still spoke in hushed tones about how the wounded horse had appeared out of the night following the fight where Deepe had died. Many riders had been killed or unhorsed in the fighting that day. Very few horses had escaped the Trollocs and made their way back to camp.\\n\\n Lan patted Mandarb’s neck. \"We’ll rest soon, my friend\", he said softly. \"I promise\".\\n\\n Mandarb snorted in the darkness, and nearby, several of the other horses nickered.\\n\\n \"We’ll make a home\", Lan said. \"The Shadow defeated, Nynaeve and I will reclaim Malkier. We’ll make the fields bloom again, cleanse the lakes. Green pastures. No more Trollocs to fight. Children to ride on your back, old friend. You can spend your days in peace, eating apples and having your pick of mares\".\\n\\n It had been a very long time since Lan had thought of the future with anything resembling hope. Strange to find it now, in this place, in this war. He was a hard man. At times, he felt he had more in common with the rocks and the sand than he did with the men who laughed together beside the fire.\\n\\n That was what he’d made of himself. It was the person he’d needed to be, a person who could someday journey toward Malkier and uphold the honor of his family. Rand al’Thor had begun to crack that shell, and then Nynaeve’s love had ripped it apart completely.\\n\\n I wonder if Rand ever knew, Lan thought, taking out the currycomb and working on Mandarb’s coat. Lan knew what it was like to be chosen, from childhood, to die. He knew what it was like to be pointed toward the Blight and told he would sacrifice his life there. Light, but he did. Rand al’Thor would probably never know how similar the two of them were.\\n\\n Lan brushed Mandarb for a time, though he was bone tired. Perhaps he should have slept. Nynaeve would have told him to sleep. He played out the conversation in his head, allowing himself a smile. She’d have won, explaining that a general needed sleep and that there were plenty of grooms to care for the horses.\\n\\n But Nynaeve wasn’t there. He kept brushing.\\n\\n Someone approached the horselines. Lan heard the footsteps long before the person arrived, of course. Lord Baldhere retrieved a brush from the groom station, nodding to one of the guards there, and walked toward his own horse. Only then did he notice Lan.\\n\\n \"Lord Mandragoran?\" he said.\\n\\n \"Lord Baldhere\", Lan said, nodding toward the Kandori. Queen Ethenielle’s Swordbearer was slender, with streaks of white in his otherwise black hair. Though Baldhere was not one of the great captains, he was a fine commander, and had served Kandor well since his king’s death. Many had assumed that the Queen would marry Baldhere. That, of course, was foolish; Ethenielle looked at him as she would a brother. Besides, anyone who paid attention would know that Baldhere clearly preferred men to women.\\n\\n \"I am sorry to disturb you, Dai Shan\", Baldhere said. \"I had not realized that anyone else would be here\". He moved to withdraw.\\n\\n \"I was nearly done\", Lan said. \"Do not let me stop you\".\\n\\n \"The grooms do well enough\", Baldhere said. \"I wasn’t here to check on their work. I have found, at times, that doing something simple and familiar helps me think\".\\n\\n \"You’re not the only one to have noticed that\", Lan said, continuing to brush Mandarb.\\n\\n Baldhere chuckled, then fell silent for a moment. Finally, he spoke. \"Dai Shan\", he said, \"are you worried about Lord Agelmar?\"\\n\\n \"In what regard?\"\\n\\n \"I worry that he’s pushing himself too hard\", Baldhere said. \"Some of the choices he is making . . . they confuse me. It’s not that his battle decisions are bad. They simply strike me as too aggressive\".\\n\\n \"It is war. I don’t know that one can be too aggressive in defeating one’s enemy\".\\n\\n Baldhere fell quiet for a time. \"Of course. But did you notice the loss of Lord Yokata’s two cavalry squadrons?\"\\n\\n \"That was unfortunate, but mistakes do happen\".\\n\\n \"This isn’t one that Lord Agelmar should have made. He’s been in situations like this before, Dai Shan. He should have seen\".\\n\\n It had happened during a recent raid against the Trollocs. The Asha’man had been setting fire to Fal Eisen and the surrounding countryside. At Agelmar’s orders, Yokata had taken his cavalry in a swing around a large hill to attack the right flank of the Trolloc army advancing on the Asha’man. Using a classic pincer movement, Agelmar was to send in more cavalry against the enemy’s left flank, and the Asha’man would turn to meet the Trollocs head-on.\\n\\n But the Shadow’s leaders had seen through the maneuver. Before Agelmar and the Asha’man could act, a large contingent of Trollocs had come over the hill to hit Yokata’s own right flank, while the remainder hit Yokata head-on, enveloping his cavalry.\\n\\n The cavalry had been killed to the last man. Immediately after, the Trollocs went after the Asha’man, who had barely been able to save themselves.\\n\\n \"He is tired, Dai Shan\", Baldhere said. \"I know Agelmar. He would never have made a mistake like that if he were awake and alert\".\\n\\n \"Baldhere, anyone could have made a mistake like that\".\\n\\n \"Lord Agelmar is one of the great captains. He should see the battle differently than ordinary men do\".\\n\\n \"Are you certain you aren’t expecting too much of him?\" Lan asked. \"Agelmar is just a man. We all are, at the end of the day\".\\n\\n \"I . . . Perhaps you are right\", Baldhere said, hand on his sword, as if worried. He wasn’t carrying the Queen’s weapon, of course—he did that only when she was acting in her station. \"I guess it comes down to an instinct, Lan. An itch. Agelmar seems tired a lot, and I worry it’s affecting his ability to plan. Please, just watch him\".\\n\\n \"I’ll watch\", Lan said.\\n\\n \"Thank you\", Baldhere said. He seemed less troubled now than when he’d approached.\\n\\n Lan gave Mandarb a final pat, left Baldhere to tend his horse and walked through camp to the command tent. He went in; the tent was lit and well guarded, though the soldiers on guard weren’t allowed clear views of the battle maps.\\n\\n Lan moved around the hung cloths that obscured the entry and nodded to the two Shienaran commanders, subordinates to Agelmar, who attended this inner sanctum. One was studying the maps spread out on the floor. Agelmar himself wasn’t there. A leader \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-121.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
