{"id":92066,"no":132,"title":"Page 132","content":"\"I will take it\", Rand said. \"But it’s a trap!\" Nynaeve said. \"Yes\", Rand said, sounding tired. \"A trap I must stride into and allow to spring shut upon me\". He laughed, suddenly, throwing his head back. \"As always! Why should I be surprised? Spread the word, Nynaeve. Tell Ituralde, Rhuarc, King Darlin. Tomorrow, we invade Shayol Ghul and claim it as our own! If we must put our head into the lion’s mouth, let us make certain that he chokes upon our flesh!\" CHAPTER 21 Not a Mistake to Ignore Siuan rolled her shoulder. She grimaced at the sharp pain. \"Yukiri\", she grumbled, \"that weave of yours still needs work\". The tiny Gray cursed softly, standing up from beside a soldier who had lost his hand. She hadn’t Healed him, instead leaving him to more mundane healers with bandages. To spend energy Healing this man would be a waste, as he would never fight again. They needed to save their strength for soldiers who could rejoin the battle. It was brutal reasoning. Well, these were brutal times. Siuan and Yukiri moved on to the next soldier in the line of wounded. The man with the missing hand would survive without Healing. Probably. They had the Yellows in Mayene, but their energy was consumed in Healing Aes Sedai who had survived the escape and soldiers who could still fight. All through the makeshift camp, set up on Arafellin soil east of the river’s ford, soldiers wept and groaned. So many wounded, and Siuan and Yukiri were among the few Aes Sedai left with any strength to Heal. Most of the others had drained themselves making gateways to bring their army out from between the two attacking forces. The Sharans had attacked aggressively, but securing the White Tower’s camp had occupied them for a while, giving time for the army to flee. Pieces of it, at least. Yukiri Delved the next man, then nodded. Siuan knelt down and began a Healing weave. She’d never been very good at this, and even with an angreal, it took a lot out of her. She brought the soldier back from the edge of death, Healing the wound in his side. He gasped, much of the energy for the Healing coming from his own body. Siuan wavered, then fell to her knees in exhaustion. Light, she was as unsteady as a noblewoman her first day on the deck of a ship! Yukiri looked her over, then reached out for the angreal, a small stone flower. \"Go rest, Siuan\". Siuan clenched her teeth, but handed over the angreal. The One Power slipped from her, and she let out a deep sigh, half-relieved and half-saddened at losing the beauty of saidar. Yukiri moved to the next soldier. Siuan lay back where she was, her body complaining of its numerous bruises and aches. The events of the battle were a blur to her. She remembered young Gawyn Trakand bursting into the command tent, yelling that Egwene wanted the army to retreat. Bryne had moved quickly, dropping a written order through the gateway in the floor. That was his newest method of passing commands—an arrow shaft with a note and a long ribbon tied to it, dropped through a gateway high above. There were no heads on the shafts, just a small stone to weight them. Bryne had been restless before Gawyn appeared. He hadn’t liked the way the battle had been playing out. The way the Trollocs moved had warned him that the Shadow had been planning something. Siuan was certain he’d already prepared the orders. Then there had been the explosions in camp. And Yukiri yelling for them to jump through the hole in the floor. Light, she’d assumed the woman was mad! Mad enough to save all of their lives, apparently. Burn me if I’m going to lie here like a piece of yesterday’s catch on the deck, Siuan thought, staring up at the sky. She hauled herself to her feet and started stalking through the new camp. Yukiri claimed her weave wasn’t all that obscure, though Siuan had never heard of it. A massive cushion of Air, meant to cradle someone who had fallen a great distance. Crafting it had drawn the attention of the Sharans—Sharans, of all things!—but they’d escaped. She, Bryne, Yukiri and a few aides. Burn her, they’d gotten out, though that fall still made her wince to remember. And Yukiri kept saying she thought the weave might be the secret behind discovering how to fly! Fool woman. There was a good reason the Creator hadn’t given people wings. She found Bryne at the edge of the new camp, sitting exhausted on a stump. Two battle maps spread out by stones lay on the ground in front of him. The maps were wrinkled; he’d grabbed them as the tent started to explode around him. Fool man, she thought. Risking his life for a couple of pieces of paper. \" . . .from reports\", said General Haerm, the new commander of the Illianer Companions. \"I’m sorry, my Lord. The scouts don’t dare sneak too close to the old camp\". \"No sign of the Amyrlin?\" Siuan asked. Bryne and Haerm both shook their heads. \"Keep looking, young man\". Siuan wagged a finger at Haerm. He raised an eyebrow at her use of the word \"young\". Burn this youthful face she’d been given. \"I mean it. The Amyrlin is alive. You find her, you hear me?\" \"I . . . Yes, Aes Sedai\". He showed some measure of respect, but not enough. These Illianers didn’t know how to treat Aes Sedai. Bryne waved the man off, and for once, it didn’t look as if anyone was waiting to meet with him. Everyone was probably too exhausted. Their \"camp\" looked more like a collection of refugees from a terrible fire than it did an army. Most of the men had rolled themselves in cloaks and gone to sleep. Soldiers were better than sailors at sleeping whenever, and wherever, they could. She couldn’t blame them. She’d been exhausted before the Sharans arrived. Now she was tired as death itself. She sat down on the ground beside Bryne’s stump. \"Arm still hurting you?\" Bryne asked, reaching down to rub her shoulder. \"You can feel that it is\", Siuan grumbled. \"Merely trying to be pleasant, Siuan\". \"Don’t think I have forgotten that you’re to blame for this bruise\". \"Me?\" Bryne said, sounding amused. \"You pushed me through the hole\". \"You didn’t seem ready to move\". \"I was just about to jump. I was almost there\". \"I’m certain\", Bryne said. \"It’s your fault\", Siuan insisted. \"I tumbled. I hadn’t intended to tumble. And Yukiri’s weave . . . horrible thing\". \"It worked\", Bryne said. \"I doubt many people can claim to have fallen three hundred","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-132.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. In Andor, the Trollocs seize Caemlyn. In the wolf dream, Perrin Aybara battles Slayer. Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
