{"id":92068,"no":134,"title":"Page 134","content":"Opportunities appeared during times of upheaval. Opportunities now lost to her. Light, but she hated that thought.\\n\\n \"We will enter\", she called up to the walls framing the gate before her. Then, more softly, she continued to her women: \"Hold the One Power and be careful. We do not know what could happen here\". Her women would be a match for a larger number of untrained Asha’man, if it came to that. It shouldn’t, logically. Of course, the men were likely mad. So perhaps assuming logic from them was imprudent.\\n\\n The large gates opened to allow her people in. It said something about these Black Tower men that they chose to finish the walls around their grounds before actually building their tower.\\n\\n She kneed her horse forward, and Myrelle and the others followed in a clopping of hooves. Lyrelle embraced the Source and used the new weave, which would tell her if a man channeled nearby. It was not the young man from a short time ago who met them at the gates, however.\\n\\n \"What is this?\" Lyrelle asked as she was joined by Pevara Tazanovni. Lyrelle knew the Red Sitter, though not well.\\n\\n \"I’ve been asked to accompany you\", Pevara said cheerfully. \"Logain thought that a familiar face might make you more comfortable\".\\n\\n Lyrelle held in a sneer. Aes Sedai should not be cheerful. Aes Sedai should be calm, collected, and—if anything else—stern. A man should look at an Aes Sedai and immediately wonder what he had done wrong and how he could fix it.\\n\\n Pevara fell in beside her as they rode onto the grounds of the Black Tower. \"Logain, who is in charge now, sends his regards\", Pevara continued. \"He was gravely wounded in the attacks and has not yet fully recovered\".\\n\\n \"Will he be well?\"\\n\\n \"Oh, certainly. He should be up and about in another day or two. He will be needed to lead the Asha’man as they join the Last Battle, I suspect\". Pity, Lyrelle thought. The Black Tower would have been more easily controlled without a false Dragon at their head. Better that he had died.\\n\\n \"I am certain his aid will be useful\", Lyrelle said. \"His leadership, however . . . Well, we shall see. Tell me, Pevara. I have been told that bonding a man who can channel is different from bonding a normal man. Have you been through the process?\"\\n\\n \"Yes\", Pevara said.\\n\\n \"Is it true, then?\" Lyrelle asked. \"Ordinary men can be compelled with the bond to obey, but not these Asha’man?\"\\n\\n Pevara smiled, seeming wistful. \"Ah, what would that be like? No, the bond cannot force Asha’man. You will have to use more inventive means\". That was not good. \"How obedient are they?\" Aledrin asked from the other side.\\n\\n \"It depends on the man, I suspect\", Pevara said.\\n\\n \"If they cannot be forced\", Lyrelle said, \"will they obey their Aes Sedai in battle?\"\\n\\n \"Probably\", Pevara said, though there was something ambiguous about the way she said it. \"I must tell you something, all of you. The mission I was sent on, and the one you also pursue, is a fool’s errand\".\\n\\n \"Is that so?\" Lyrelle asked evenly. She was hardly going to trust a Red after what they had done to Siuan. \"Why is that?\"\\n\\n \"I was once where you are\", Pevara said. \"Ready to bond all of the Asha’man in an attempt to control them. But would you ride into another city and select fifty men there, at a whim, and bond them as Warders? Bonding the Asha’man just to bond them is foolish. It will not control them. I do think some Asha’man will make excellent Warders, but—like many men—others will not. I suggest that you abandon your plan to bond exactly forty-seven and take those who are most willing. You will gain better Warders\".\\n\\n \"Interesting advice\", Lyrelle said. \"But, as you mentioned, the Asha’man will be needed at the battlefront. There is not time. We will take the forty-seven most powerful\".\\n\\n Pevara sighed, but said nothing further as they passed several men in black coats with two pins on the high collars. Lyrelle felt her skin crawling, as if insects burrowed beneath it. Men who could channel.\\n\\n Lelaine felt that the Black Tower was vital to the White Tower’s plans. Well, Lyrelle did not belong to Lelaine. She was her own person, and a Sitter in her own right. If she could find a way to bring the Black Tower under her direct authority, then perhaps she could finally wiggle out from under Lelaine’s thumb.\\n\\n For that prize, bonding Asha’man was worthwhile. Light, but she wasn’t going to enjoy it. They needed all of these men controlled, somehow. The Dragon would be growing mad, unreliable by this point, tainted by the Dark One’s touch on saidin. Could he be manipulated into letting the rest of the men be bonded?\\n\\n Not having control through the bond. . . that will be dangerous. She imagined going into battle with ranks of two or three dozen Asha’man, bonded and forced to her will. How could she make it happen?\\n\\n They reached a line of men in black coats waiting at the edge of the village. Lyrelle and the others approached them, and Lyrelle did a quick count. Forty-seven men, including the one standing at the front. What trick were they trying to pull?\\n\\n The one at the front came forward. He was a sturdy man in his middle years, and he looked as if he’d recently suffered some kind of ordeal. He had bags under his eyes and wan skin. His step was firm, however, and his gaze steady as he met Lyrelle’s eyes, then bowed to her.\\n\\n \"Welcome, Aes Sedai\", he said.\\n\\n \"And you are?\"\\n\\n \"Androl Genhald\", he said. \"I’ve been put in charge of your forty-seven until they have been bonded\".\\n\\n \"My forty-seven? I see that you have forgotten the terms already. We are to be given any soldier or Dedicated we wish, and they cannot refuse us\".\\n\\n \"Yes, indeed\", Androl said. \"That is true. Unfortunately, all of the men in the Black Tower other than these are either full Asha’man, or have been called away on urgent business. The others would, of course, follow the Dragon’s commands if they were here. We made certain to keep forty-seven for you. Actually, forty-six. I’ve already been bonded by Pevara Sedai, you see\".\\n\\n \"We will wait until the others return\", Lyrelle said coldly.\\n\\n \"Alas\", Androl said, \"I do not think they will return any time soon. If you intend to join the Last Battle, you will have to make your selections quickly\".\\n\\n Lyrelle narrowed her eyes at him, then looked at Pevara, who shrugged.\\n\\n \"This is a trick\", Lyrelle said to Androl. \" \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-134.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
