{"id":92101,"no":168,"title":"Page 168","content":"\"What do you see around me?\" Fortuona said. \"Speak it, Doomseer. I would know your omens, and judge you true or false!\"\\n\\n That sounded dangerous. \"I see a bloody death lily, as I told Mat\", Min said. \"And three ships, sailing. An insect in the darkness. Red lights, spread across a field that should be lush and ripe. A man with the teeth of a wolf\". Fortuona drew in a sharp breath. She looked up at Mat. \"This is a great gift you have brought me, Knotai. Enough to pay your penance. Enough for credit beyond. Such a grand gift\".\\n\\n \"Well . . . I . . \"\\n\\n \"I don’t belong to anyone\", Min said. \"Except maybe Rand, and him to me\".\\n\\n Fortuona ignored her, standing. \"This woman is my new Soe’feia. Doomseer, Truthspeaker! Holy woman, she who may not be touched. We have been blessed. Let it be known. The Crystal Throne has not had a true reader of the omens for over three centuries!\"\\n\\n Min sat, stunned, until Mat pulled her to her feet. \"Is that a good thing?\" she whispered to him.\\n\\n \"I’ll be bloody in the face if I know\", Mat said back. \"But you remember what I said about getting away from her? Well, you can probably forget about that now\".\\n\\n CHAPTER 28\\n\\n Too Many Men\\n\\n \"Lord Agelmar sent us directly\", the Arafellin said to Lan. The man kept glancing toward the front line, where his companions fought for their lives.\\n\\n Thunder shook the battlefield here in Shienar. The scent of burnt flesh was pungent in the air, alongside burnt hair. The Dreadlords didn’t care if their attacks killed Trollocs, so long as they hit men as well.\\n\\n \"You’re certain?\" Lan asked from horseback.\\n\\n \"Of course, Dai Shan\", the man said. He wore his braids long, the bells painted red for some reason Lan did not understand. Something to do with the Arafellin Houses and their approach to the Last Battle. \"If I lie, let me be whipped a hundred times and left in the sun. I was surprised by the order, as I thought my men were to guard the flanks. Not only did the messenger have the proper passwords, but the man I sent to the command tent returned to confirm\".\\n\\n \"Thank you, Captain\", Lan said, waving for him to go back to his men. He glanced at Andere and Prince Kaisel, both of whom sat nearby, looking confused. They had listened to Lan interrogate the Kandori banner leader just before this, and that man had made similar assertions.\\n\\n Lord Agelmar had sent them both. Two reserve forces, sent separately, neither knowing the other was going to the same place. A cool breeze blew across the river to Lan’s right as he turned and rode toward the back lines.\\n\\n The lands heat soon smothered that coolness. Those clouds above seemed so close, one could almost reach out and touch them.\\n\\n \"Lan?\" Andere asked, as he and Kaisel trotted their horses up beside Mandarb. \"What is this about?\"\\n\\n \"Too many men sent to plug the same hole in our lines\", Lan said softly. \"It is an easy mistake to make\", Prince Kaisel said. \"The worry that the Trollocs would punch through is a real one, now that the Dreadlords have joined the battle. The general sent two banners instead of one. Best to be safe. He probably did it intentionally\".\\n\\n No. It had been a mistake. A small one, but a mistake. The correct move would have been to pull the soldiers back and stabilize their battle lines. A single banner of cavalry then could ride in and cut off the Trollocs coming through. Two waves could have been coordinated, but without giving warning to the different captains, the risk was that they would trip one another up—which was what had happened.\\n\\n Lan shook his head and scanned the battlefield. Queen Ethenielle’s banner was not far away. He headed straight for it. The Queen waited with her honor guard, Lord Baldhere on one side, the Sword of Kirukan held with its hilt directly toward the Queen, though she had chosen not to ride into battle herself. Lan had half-wondered if she would follow Tenobia’s lead on that point, but he shouldn’t have. Ethenielle was a coolheaded woman. More importantly, she’d surrounded herself with coolheaded advisors.\\n\\n Lord Ramsin—her new husband—spoke with a group of his commanders. A sly-looking fellow in the clothing of a scout brushed past Lan as he rode up, off to deliver orders. Lord Agelmar didn’t usually give the squad-by-squad commands; his concern was the overall battle. He told his commanders what he wanted them to accomplish, but details of how they would carry out those objectives were left up to them.\\n\\n A stout, round-faced woman sat beside the Queen, speaking calmly to her. She noticed Lan, and nodded. Lady Serailla was the Queen’s primary advisor. Lan and she had had . . . disagreements in the past. He respected her as much as he could someone he occasionally wanted to throttle and toss off a cliff.\\n\\n \"Dai Shan\", the Queen said, nodding to him. Ramsin, standing a little ways off, gave a wave. Thunder rumbled. There was no rain, and Lan didn’t expect any, despite the thick humidity. \"You are wounded? Let me send for one of the Healers\".\\n\\n \"They are needed elsewhere\", Lan said tersely as her guards saluted him. Each man wore a green tabard over his breastplate, the Red Horse embroidered on it, and each lance trailed red and green streamers. The helmets had steel face-bars, as opposed to Lan’s own open-fronted, wide Malkieri helmet. \"Might I borrow Lord Baldhere, Your Majesty? I have a question for him\".\\n\\n \"You need but make the request, Dai Shan\", Queen Ethenielle said, though Lady Serailla narrowed her eyes at him. Obviously, she wondered what he needed of the Kandori queen’s Swordbearer.\\n\\n Baldhere moved up to Lan, shifting the Sword of Kirukan to his other arm, to keep the hilt still pointed at his queen. It was a formality, but Baldhere was a formal man. Andere and Prince Kaisel joined the two of them, and Lan did not make them fall back.\\n\\n \"Lord Agelmar committed a good fourth of our reserves to a small opening in our lines\", Lan said softly enough that only Baldhere, Andere and Kaisel could hear. \"I’m not certain all were needed\".\\n\\n \"He just gave orders for our Saldaean light cavalry to pull away from the eastern flank\", Baldhere said, \"and hit the Trollocs’ left flank deep behind their lines, a surprise hit-and-run attack. He says he wants the Dreadlords’ attention spread out, and claims that making our defenses appear weaker than they are will tempt them into making a mistake\".\\n\\n \"Your thoughts?\" Lan asked.\\n\\n \"It’s a good move\", Baldhere said, \"if you intend to force the battle to go long. Alone, it wouldn’t worry me too much, not as long as the Saldaeans can get out with their necks intact. I hadn’t heard about the reserves. That leaves us enormously e \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-168.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
