{"id":92109,"no":176,"title":"Page 176","content":"Mat shook his hand; he had cracked one of his nails, splitting the fine lacquer. He turned to a Seanchan officer, one of those who had fought alongside him. The man wore an expression of awe, as if he were staring at the Dragon bloody Reborn himself. Mat looked down at the ground, not liking the man\u0027s expression, but he supposed it wasn’t any worse than looking at the blood-soaked muck littered with Sharan corpses. How many had Mat killed?\n \"Highness . . \". the officer said. \"Great Lord, no man in the Empire’s service would ever dare question the Empress, may she live forever. But if a man had wondered about some of her choices, he would do so no longer. Prince of the Ravens!\" He raised his sword, prompting a cheer from those behind.\n \"Get yourselves some bloody polearms\", Mat said. \"Those swords are next to useless for foot soldiers in this battle\". He chewed a bit off the offending fingernail, then spat it to the side. \"You fellows did well. Anyone see my horse?\"\n Pips was nearby and so, taking his mount’s reins, he headed back toward the ford. He even managed to stay out of more skirmishes, for the most part. That Seanchan captain reminded him a little too much of Talmanes, and Mat had enough people following him about. I wonder if he plays dice, Mat thought idly, stepping into the water. His boots were good, but all boots eventually leaked, and his feet squished inside his stockings as he walked across the ford with Pips. There was a commotion far to his right on the bank, what appeared to be a gathering of Aes Sedai channeling toward the battlefield. But Mat had no intention of sticking his nose into their business. He had larger issues on his mind.\n Ahead Mat saw a man standing by a tree, dressed in voluminous pants and a familiar-looking coat. He approached the man and, after a brief conversation, exchanged garb with him. Feeling good about being back in his Two Rivers coat, Mat heaved himself into the saddle, legs still dripping water, and rode back toward where he had left Tuon. His men had brought that Sharan channeler—by his order, they’d gagged her and blindfolded her. Light, what would he do with her? She’d probably end up as a damane.\n He left his soldiers and passed the guards, now set up at the base of the little rise, with barely a nod. The battlefield spread out in his mind, no longer little drawings on paper. He could see the field, hear the men fighting, smell the rancid breath of the enemy. It was real to him now.\n \"The Empress\", Selucia said as he reached the top of the rise, \"would like to know—with great specificity—exactly why you saw fit to put yourself into the skirmish in such an irresponsible way. Your life is no longer your own, Prince of the Ravens. You cannot toss it aside as you once might have\".\n \"I had to know\", Mat said, looking out. \"I had to feel the pulse of the battle\".\n \"The pulse?\" Selucia said. Tuon was talking through her by wiggling her fingers like some bloody Maiden of the Spear. Not speaking to him directly. Bad sign.\n \"Every battle has a pulse, Tuon\", Mat said, still staring into the middle distance. \"Nynaeve . . . she would sometimes feel a person’s hand to check their heartbeat, and from there would know that something was wrong with their feet. It’s the same thing. Step into the struggle, feel its motion. Know it . . \".\n A servant with his head half-shaven stepped up to Tuon, whispering to her and Selucia. He had come from the ford.\n Mat kept looking out, remembering maps, but overlaying them with the real combat. Bryne failing to use Tylee in combat, exposing his defenses’ left flank at the ford, sending his cavalry into a trap.\n The battle opened to him, and he saw tactics, ten steps ahead of what was occurring. It was like reading the future, like what Min saw, only with flesh, blood, swords and battle drums.\n Mat grunted. \"Huh. Gareth Bryne is a Darkfriend\".\n \"He what?\" Min sputtered.\n \"This battle is one step away from being doomed\", Mat said, turning to Tuon. \"I need absolute control of our armies right now. No more arguing with Galgan. Min, I need you to send to Egwene and warn her that Bryne is trying to lose this battle. Tuon, she ll need to go in person. I doubt Egwene will listen to anyone else\".\n Everyone looked at Mat with stunned expressions—everyone but Tuon, who gave him one of those soul-shaking stares of hers. The ones that had him feeling as if he were a mouse who had just been caught in an otherwise immaculately clean room. That made him sweat more than the battle had.\n Come on, he thought. There isn’t time. He could see it now, like a grand game of stones. Bryne’s movements were complex and subtle, but the end result would be the destruction of Egwene’s army.\n Mat could stop it. But he had to act now.\n \"It is done\", Tuon said.\n The comment provoked almost as much surprise as Mat’s announcement. Captain-General Galgan looked as if he would rather swallow his own boots than have Mat in command. Min found herself being led away by a group of servants and soldiers, and she gave a squawk of annoyance.\n Tuon moved her horse nearer to Mat’s. \"I am told\", she said softly, \"that in the battle moments ago, you not only claimed a marath’damane for yourself, but also raised one of our officers to the low Blood\".\n \"I did?\" Mat asked, baffled. \"I don’t remember that\".\n \"You dropped your nail at his feet\".\n \"Oh. That . . . All right, maybe I did that. Accidentally. And the channeler . . . bloody ashes, Tuon. I didn’t mean for her to . . . I guess. Well, you can have her\".\n \"No\", Tuon said. \"It is well for you to have taken one of your own. You cannot train her, of course, but there are many sul’dam who will be eager for the chance. It is very rare that a man captures a damane personally on the battlefield, very rare indeed. Though I know of your particular advantage, others do not. This will greatly increase your reputation\".\n Mat shrugged. What else could he do? Maybe, if the damane belonged to him, he could let her free or something.\n \"I will have the officer you raised transferred to be your personal retainer\", Tuon said. \"He has a good record, perhaps too good. He had been assigned that duty at the ford because he was considered . . . potentially part of a faction who would have moved against us. He is now spouting your praises. I do not know what you did to change his opinion. You seem to have a particular skill at that\".\n \"Let\u0027s just hope I have as much skill for retrieving a victory\", Mat grumbled. \" \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-176.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
