{"id":92128,"no":195,"title":"Page 195","content":"Berisha sniffed. \"I say it’s too much\". The woman seemed chronically dissatisfied, as if annoyed at being left out of the fighting.\\n\\n \"The Amyrlin disagrees with you\", Faile replied. \"A gateway, please. The hour grows late\". And if you want to talk about a waste, why not consider how you made me march all the way out of the city and wait, instead of sending me straight from the White Tower grounds?\\n\\n The Hall of the Tower wanted a single Traveling ground for large troop or supply movements to keep better control over who entered and left Tar Valon. Faile could not blame them for the precaution, even if it was frustrating sometimes.\\n\\n Bureaucracy was bureaucracy, and Berisha finally adopted a look of concentration in preparation for making a gateway. Before she could weave the gateway, however, the ground started to rumble.\\n\\n Not again, Faile thought with a sigh. Well, there were commonly smaller quakes after an—\\n\\n A series of sharp black crystal spikes split the ground nearby, jutting upward some ten or fifteen feet. One speared a Redarms horse, splashing blood into the air as the spike went straight through both beast and man.\\n\\n \"Bubble of evil!\" Harnan called from nearby.\\n\\n Other crystalline spikes—some thin as a spear, others wide as a person—ripped up through the ground. Faile frantically tried to control her horses. They danced to the side, spinning her cart, nearly toppling it as she pulled on the reins.\\n\\n Around her, madness ruled. The spikes punched up through the ground in groups, each sharp as a razor. One wagon splintered as crystals destroyed its left side. Foodstuffs spilled to the dead grass. Some horses went wild and other wagons overturned. The crystal spikes continued to rise, appearing all over the empty field. Shouts rose from the nearby village at the end of the bridge from Tar Valon.\\n\\n \"Gateway!\" Faile screamed, still fighting her horses. \"Do it!\"\\n\\n Berisha jumped back as spikes jutted out of the ground near her feet. She threw a pale-faced glance at them, and only then did Faile realize that something was moving inside the shadowy crystals. It seemed like smoke.\\n\\n A crystal spike came up through Berisha’s foot. She cried out, kneeling, just as a line of light split the air. Thank the Light, the woman held her weave, and—with what seemed glacial slowness—the line of light rotated and opened a hole large enough for a wagon.\\n\\n \"Through the gateway!\" Faile shouted, but her voice was lost in the commotion. Crystals burst from the ground very near her left, tossing earth across her face. Her horses danced, then started to gallop. Rather than risking complete loss of control, Faile steered them toward the gateway. Right before they went through, however, she pulled them to a rearing halt.\\n\\n \"The gateway!\" she shouted at the others. Again her voice was lost. Fortunately, the Redarms took up the call, riding down the disordered line, grabbing the reins of horses and steering wagons toward the gateway. Other men picked up those who had been tossed to the ground.\\n\\n Harnan thundered past, carrying Olver. He was followed by Sandip with Setalle Anan clinging to him from behind. The frequency of the crystals increased. One jutted up near Faile, and with horror, she realized that the smoky movements inside had form. Figures of men and women, screaming, as if trapped inside.\\n\\n She drew back, aghast. Nearby, the last working wagon rattled through the gateway. Soon the field would be nothing but crystals. Some straggling members of the Band helped the wounded onto horses, but two fell as the crystals started budding growths that shot out to the sides. It was time to go. Aravine passed by, grabbing Faile’s reins to pull them to safety.\\n\\n \"Berisha!\" Faile said. The Aes Sedai knelt beside the opening, sweat trickling down her pale face. Faile leaped from her wagon seat, grabbing the woman\u0027s shoulder as Aravine pulled the wagon through the gateway.\\n\\n \"Lets move!\" Faile said to Berisha. \"I\u0027ll carry you\".\\n\\n The woman teetered, then fell to the side, holding her stomach. Faile realized with a start that blood streamed around the woman’s fingers. Berisha stared at the sky, mouth working, but no sounds came out.\\n\\n \"My Lady!\" Mandevwin galloped up. \"I don’t care where it leads! We must get through!\"\\n\\n \"What—\"\\n\\n She cut off as Mandevwin grabbed her by the waist and hauled her up, crystals exploding nearby. He galloped through the opening, holding her.\\n\\n The gateway snapped shut a moment later.\\n\\n Faile panted as Mandevwin let her down. She stared at where the gateway had been.\\n\\n His words finally caught up with her. I don’t care where it leads . . . He had seen something she, in her panic over getting everyone to safety, had not.\\n\\n The gateway hadn’t led to the Field of Merrilor.\\n\\n \"Where . . \". Faile whispered, joining the others, who stared at the horrid landscape. A sweltering heat, plants covered in spots of darkness, a scent of something awful in the air.\\n\\n They were in the Blight.\\n\\n Aviendha chewed on her rations, crunchy rolled oats that had been mixed with honey. They tasted good. Being near Rand meant that their food stores had stopped spoiling.\\n\\n She reached for her water flask, then hesitated. She’d been drinking a lot of water lately. She rarely stopped to think about its value. Had she already forgotten the lessons she’d learned during her return to the Threefold Land to visit Rhuidean?\\n\\n Light, she thought, raising the flask to her lips. Who cares? It’s the Last Battle!\\n\\n She sat on the floor of a large Aiel tent in the valley of Thakan’dar. Melaine chewed on her own rations close by. The woman was near to term now with her twins, her belly bulging beneath her dress and shawl. Much as a Maiden was forbidden to fight while with child, Melaine was forbidden dangerous activity. She had voluntarily gone to work in Berelain’s Healing station in Mayene—but she regularly checked on the progress of the battle. Many of the gai’shain had found their way through gateways to help as they could, though all they could do was carry water or soil for the earthen mounds Ituralde had ordered cast up to give the defenders some kind of protection.\\n\\n A group of Maidens ate nearby, chatting with handtalk. Aviendha could have read it, but didn’t. It would only make her wish she could join them. She’d become a Wise One and had forsaken her old life. That didn’t mean she had purged herself of every bit of envy. Instead, she wiped out her wooden bowl and stowed it in her pack, stood up and slipped out of the tent.\\n\\n Outside, the night air was cool. It was about an hour before dawn, and felt almost like the Three-fold Land at night. Aviendha looked up at the mountain that dominated the valley; despite the dark of early morning, she could se \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-195.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
