{"id":92129,"no":196,"title":"Page 196","content":"It had been many days since Rand had entered. Ituralde had wandered back into camp the night before with a tale of being held by wolves and a man who claimed Perrin Aybara had sent him to kidnap the great captain. Ituralde had been taken into custody, and had not complained.\\n\\n The Trollocs had not attacked the valley all day. The defenders still had them held in the pass. The Shadow seemed to be waiting for something. The Light send it was not another attack by Myrddraal. The last one had nearly ended the resistance. Aviendha had rallied the channelers once the Eyeless had emerged to kill the humans defending the mouth of the pass; they must have realized that exposing themselves in large numbers was unwise, and they fled back to the safety of the pass once the channeling began.\\n\\n Either way, she felt grateful for this rare moment of rest and relative peace between attacks. She stared into that pit in the mountain, within which Rand fought. A strong pulse came from deep within it; channeling, in waves, powerful. Several days on the outside, but how long on the inside? A day? Hours? Minutes? Maidens who guarded the path up to the entrance claimed that after four hours of duty, they’d climb down the mountainside and find that eight hours had passed.\\n\\n We have to hold’ Aviendha thought. We have to fight. Give him as much time as we can.\\n\\n At least she knew he still lived. She could sense that. And his pain.\\n\\n She looked away.\\n\\n As she did, she noticed something. A woman was channeling in the camp. It was faint, but Aviendha frowned. At this hour, with no fighting, the only channeling should have been happening on the Traveling ground, and this was in the wrong direction.\\n\\n Muttering to herself, she started through the camp. It was probably one of the off-duty Windfinders again. They took turns rotating in and out of the group using the Bowl of the Winds, constantly, to keep the tempest at bay. That task was done atop the northern valley wall, well guarded by a large force of Sea Folk. They had to take gateways up there to change shifts.\\n\\n When the Windfinders weren’t on duty with the Bowl, they camped with the rest of the army. Aviendha had told them time and time again that, while in the valley, they were not allowed to channel for incidental reasons. One would think, after all the years they had spent never letting Aes Sedai see them use their powers, that they could be more self-controlled! If she caught another one of them using the One Power to warm her tea, she’d send her to Sorilea for an education. This was supposed to be a secure camp.\\n\\n Aviendha froze in place. That channeling was not coming from the small ring of tents where the Windfinders made camp.\\n\\n Had she sensed an incursion? A Dreadlord or Forsaken would probably assume that—in a camp this large filled with Aes Sedai, Windfinders and Wise Ones—no one would notice a tiny bit of channeling here or there. Aviendha immediately crouched beside a nearby tent, avoiding the light of a lantern on a pole. The channeling came again, very faint. She crept forward.\\n\\n If this turns out to be someone heating water for a bath . . .\\n\\n She moved between tents, across the hard earth. As she drew closer, she took off her boots and left them behind, then pulled her dagger from its sheath. She couldn’t risk embracing the Source, lest she reveal herself to her prey.\\n\\n The camp didn’t truly sleep. Those warriors who were not on duty had trouble slumbering here. Fatigue among the spears, including the Maidens, was becoming a problem. They complained of terrible dreams.\\n\\n Aviendha continued forward silently, slipping between tents, avoiding those that shone with light. This place disturbed all of them, so she was not surprised to hear of bad dreams. How could they sleep in peace so close to the Dark One’s abode?\\n\\n Logically, she knew that the Dark One was not nearby, not really. That wasn’t what the Bore was. He didn’t live in this place; he existed outside the Pattern, inside his prison. Still, bedding down here was like trying to sleep while a murderer stood beside your bed, holding a knife and contemplating the color of your hair.\\n\\n There, she thought, slowing. The channeling stopped, but Aviendha was close. Draghkar attacks and the threat of Myrddraal slipping in at night had driven the camp leaders to spread the officers throughout the camp, in tents that bore no external sign of which belonged to a commander and which to a common foot soldier. Aviendha, however, knew this tent to belong to Darlin Sisnera.\\n\\n Darlin had official command of this battlefield, now that Ituralde had fallen. He was not a general, but the Tairen army was the bulk of the defense, with the Defenders of the Stone their elite units. Their commander, Tihera, was good with tactics, and Darlin listened well to the man’s suggestions. Tihera was not a great captain, but he was very clever. He, Darlin and Rhuarc had been devising their battle plans following Ituralde’s fall . . .\\n\\n In the darkness, Aviendha nearly missed the three figures crouched ahead of her, just outside Darlin’s tent. They gestured to one another, silent, and she could see little about them—not even their clothing. She raised her knife, and then a bolt of lightning split the sky, giving her a better glimpse of one. The man was wearing a veil. Aiel.\\n\\n They noticed the intruder too, she thought, stalking up to them and raising a hand to keep them from attacking. She whispered, \"I felt channeling nearby, and I do not think it is from one of ours. What have you seen?\"\\n\\n The three men stared at her, as if stunned, though she couldn’t make out much of their faces.\\n\\n Then they attacked her.\\n\\n Aviendha cursed, leaping backward as their spears came out and one threw a knife in her direction. Aiel Darkfriends? She felt a fool. She should have known better.\\n\\n She reached out to embrace the Source. If a female Dread lord was nearby, she’d feel what Aviendha did, but there was no help for it. She needed to survive these three.\\n\\n However, as Aviendha reached for the One Power, something snapped into place between her and the Source. A shield, with weaves she could not see.\\n\\n One of these men could channel. Aviendha’s reaction was instinctive. She shoved down her panic, stopped scrambling to touch the Source and threw herself at the nearest of the men. She caught his spear-thrust with her off hand—ignoring the pain as the spearhead sliced against her ribs—and hauled him forward to ram her knife in his neck.\\n\\n One of the other two cursed, and Aviendha suddenly found herself wrapped in weaves of Air, unable to speak or move. Blood soaked into her blouse and pooled against her wounded side. The man she’d struck gasped and thrashed on the ground as he died. The other two \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-196.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
