{"id":92133,"no":200,"title":"Page 200","content":"The air here smelled pungent, and Faile expected to find a rotting corpse behind every black-speckled shrub. The ground cracked when she stepped, dry earth crushing beneath her boots, as if rain had not been seen in centuries. As she sat in the camp, she saw a group of sickly green lights—like glowing insects in a swarm—passing in the distance, over a stand of silhouetted trees. She knew enough of the Blight to hold her breath until they passed. She did not know what they were, and did not want to know.\\n\\n She had led her group on a short hike to find this place for a camp. Along the way, one caravan worker had been killed by a twig, another by stepping in what looked like mud—but it had dissolved his leg. He’d gotten some of it on his face. He had thrashed and screamed as he died.\\n\\n They’d had to forcibly gag him to keep the sounds from bringing other horrors.\\n\\n The Blight. They couldn’t survive up here. A simple walk had killed two of their members, and Faile had some hundred people to try to protect. Guards from the Band, some members of Cha Faile and the wagon drivers and workers from her supply caravan. Eight of the wagons still worked, and they’d brought those to this camp, for now. They would probably be too conspicuous to take farther.\\n\\n She wasn’t even certain they would survive this night. Light! Their only chance of rescue seemed to lie with the Aes Sedai. Would they notice what had happened and send help? It seemed a very faint hope, but she did not know about the One Power.\\n\\n \"All right\", Faile said softly to those who sat with her—Mandevwin, Aravine, Harnan, Setalle and Arrela of Cha Faile. \"Let’s talk\".\\n\\n The others looked hollow. Probably, like Faile, they had been frightened with stories of the Blight since childhood. The quick deaths in their party soon after entering this land had reinforced that. They knew how dangerous this place was. They kept jumping at every sound in the night.\\n\\n \"I will explain what I can\", Faile said, trying to divert them from the death all around. \"During the bubble of evil, one of those crystals speared Berisha Sedai’s foot right as she made the gateway\".\\n\\n \"A wound?\" Mandevwin asked from his place beside the fire. \"Would that have been enough to make the gateway go awry? Truly, I know little of Aes Sedai business, nor have I wanted to. If one is distracted, is it possible to create an accidental opening to the wrong place?\"\\n\\n Setalle frowned, and the expression drew Faile’s attention. Setalle was neither nobility nor an officer. There was something about the woman, however . . . she projected authority and wisdom.\\n\\n \"You know something?\" Faile asked her.\\n\\n Setalle cleared her throat. \"I know . . . some little about channeling. It was once an area of curiosity to me. Sometimes, if a weave is done incorrectly, it simply does nothing. Other times, the result is disastrous. I have not heard of a weave doing something like this, working but in the wrong way\".\\n\\n \"Well\", Harnan said, watching that darkness and shivering visibly, \"the alternative is to think that she wanted to send us to the Blight\".\\n\\n \"Perhaps she was disoriented\", Faile said. \"The pressure of the moment made her send us to the wrong place. I’ve been turned about before in a moment of tension and found myself running in the wrong direction. It could be like that\".\\n\\n The others nodded, but again, Setalle looked concerned.\\n\\n \"What is it?\" Faile prodded.\\n\\n \"Aes Sedai training is very extensive in relation to this type of situation\", Setalle said. \"No woman reaches the level of Aes Sedai without learning how to channel under extreme pressure. There are specific . . . barriers a woman must clear in order to wear the ring\".\\n\\n So, Faile thought, Setalle must have a relative who is Aes Sedai. Someone close, if they shared information so private. A sister, perhaps?\\n\\n \"Then do we assume that this is some kind of trap?\" Aravine sounded confused. \"That Berisha was some kind of Darkfriend? Surely the Shadow has greater things to misdirect than a simple supply train\".\\n\\n Faile said nothing. The Horn was safe; the chest it was in now sat in her small tent nearby. They had circled the wagons, and had allowed only this one fire. The rest of the caravan slept, or tried to.\\n\\n The still, too-silent air made Faile feel as if they were being watched by a thousand eyes. If the Shadow had planned a trap for her caravan, it meant the Shadow knew about the Horn. In that case, they were in very serious danger. More serious, even, than being in the Blight itself.\\n\\n \"No\", Setalle said. \"No, Aravine is right. This could not have been an intentional trap. If the bubble of evil hadn’t come, we would never have burst through the opening without looking where it led. So far as we know, these bubbles are completely random\".\\n\\n Unless Berisha was simply taking advantage of the circumstances, Faile thought. Also, there was the woman’s death. That wound in her stomach had not looked like one caused by the spikes. It had looked like a knife wound. As if someone had attacked Berisha once the Horn was through the gateway. To keep her from telling what she’d done?\\n\\n Light, Faile thought. I am growing suspicious.\\n\\n \"So\", Harnan said, \"what do we do?\"\\n\\n \"That depends\", Faile said, looking toward Setalle. \"Is there any way an Aes Sedai could tell where we’d been sent?\"\\n\\n Setalle hesitated, as if reluctant to reveal how much she knew. When she continued, however, she spoke with confidence. \"Weaves leave behind a residue. So yes, an Aes Sedai could discover where we’d gone. The residue does not last long, however: a few days at most, for a powerful weave. And not all channelers can read residues—this is a rare talent\".\\n\\n The way she spoke, so commanding and authoritative . . . the way she projected an immediate sense of being trustworthy. It wasn’t a relative, then, Faile thought. This woman trained in the White Tower. Was she, perhaps, like Queen Morgase? Too weak in the One Power to become Aes Sedai?\\n\\n \"We will wait one day\", Faile said. \"If nobody has come for us by then, we will head south and try to escape the Blight as quickly as possible\".\\n\\n \"I wonder how far north we are\", Harnan said, rubbing his chin. \"I don’t fancy going over mountains to get back home\".\\n\\n \"You’d rather remain in the Blight?\" Mandevwin asked.\\n\\n \"Well, no\", Harnan said. \"But it could take months to walk back to safety. Months traveling through the Blight itself. . \"\\n\\n Light, Faile thought. Traveling months in a place where we’re lucky to have lost only two in one day. They’d never make it. Even without the wagons, the caravan would stand out in this landscape like a fresh wound on diseased skin. They’d be lucky to \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-200.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
