{"id":92135,"no":202,"title":"Page 202","content":"Bands of Aiel roved and fought in the mouth of the valley itself. Some with red veils, some with black. Too many, Aviendha thought, as she slowed her team with a raised hand. She then continued forward on her own, quietly. She could draw a few hundred paces away from the women and still have access to their power.\\n\\n She picked her way through the barren rocky fields of the valley. There were three dead bodies to her right, two with black veils. She tested them with a quick Delving; she would not be caught by the old trick of hiding among the corpses. She had used that one herself.\\n\\n These three were truly dead, so she continued on in a crouch. In addition to the place where the Tairens and Domani held the Trollocs back, they had a second force guarding their camp and the pathway up to where Rand fought. In the space between, Aiel and red-veils roved in bands, each trying to best the other. Only, some of the red-veils could channel.\\n\\n The ground thumped and shook nearby. A spray of soil fell through the air. Aviendha crouched down lower, but quickened her pace.\\n\\n Ahead, over a dozen siswai’aman were rushing the position of two red-veils, both channelers. The red-veils cast up the earth beneath the attackers, sending bodies flying.\\n\\n Aviendha understood why the Aiel kept going. These red-veils were an affront, a crime. The Seanchan, who would dare take Wise Ones captive, were not as disgusting as these. Somehow, the Shadow had taken the bravest of the Aiel and made them into these . . . these things.\\n\\n Aviendha struck quickly, pulling strength through her angreal and her circle, weaving two lines of fire and hurling them at the red-veils. She began new weaves immediately, casting up the ground beneath the two channelers, and started a third set of weaves. She threw fire at the red-veils as they stumbled; one jumped away as the other was caught in her earthen blasts.\\n\\n She struck the one who had fled with spears of flame. Then she hit both corpses with an extra burst of power, just to make certain. These men no longer held to ji’e’toh. They were no longer alive. They were weeds to be pulled.\\n\\n She moved forward to check on the siswai’aman. Eight still lived, three of them wounded. Aviendha was not particularly good with Healing, but she was able to save the life of one man, keeping a wound in his throat from bleeding out. The other survivors gathered the wounded and moved back toward the camp.\\n\\n Aviendha stood above the two corpses. She decided not to look at them closely. Seeing one man she had known was bad enough. These—\\n\\n A shock went through her, and one of her wells of power vanished. Aviendha gasped. Another one winked out.\\n\\n She immediately released the circle, then dashed back to where she had left the women. Flashes and explosions shook her. Aviendha clung to the One Power, her own strength now seeming pitifully small compared to what she’d been using.\\n\\n She stumbled to a halt before the smoldering corpses of Kiruna and Faeldrin. The hideous woman she had seen before—the woman that Aviendha was increasingly certain was one of the Forsaken—stood there smiling at her. The horrid woman had her hand on Sarene’s shoulder; the slender White stood with her head turned toward the Forsaken, staring at her with vapid, adoring eyes. Sarene’s Warder lay dead at her feet.\\n\\n Both vanished, twisting upon themselves, Traveling without use of a gateway. Aviendha fell to her knees beside the dead. Nearby, Damer Flinn groaned and tried to pull himself free of the cast-up earth. His left arm was completely gone, burned away at the shoulder.\\n\\n Aviendha cursed and did what she could to Heal him, though he slipped into unconsciousness. She suddenly felt very tired and very, very alone.\\n\\n CHAPTER 35\\n\\n A Practiced Grin\\n\\n Olver missed Wind. Bela—the stout, shaggy mare he now rode—wasn’t bad, really. She was just slow. Olver knew this because he kept trying to nudge her forward, but she continued plodding along behind the other horses. Nothing he did could make her go any faster. Olver wanted to ride like a storm. Instead, he rode like a sturdy log in a placid river.\\n\\n He wiped his brow. The Blight was pretty scary, and the others—most of them didn’t have horses—walked as if each step was going to bring a thousand Trollocs down on them. The rest of the caravan spoke in hushed voices, and they looked at the hillsides with suspicion.\\n\\n They passed a group of withered trees, with sap leaking from open sores in the bark. That sap looked too red. Almost like blood. Nearby, one of the caravan drivers stepped up to inspect it.\\n\\n Vines snapped down from the limbs above—vines that looked brown and dead, yet moved like snakes. Before Olver could scream, the caravan driver was hanging, dead, from the upper branches of the tree.\\n\\n The entire line of people froze in place, horrified. Above, the tree actually pulled the dead man into itself through a split in the bark. Ingesting him. Maybe that sap was blood.\\n\\n Olver looked on, horrified.\\n\\n \"Steady\", Lady Faile said, a slight tremor in her voice. \"I’ve told you, don’t draw close to plants! Don’t touch anything\".\\n\\n They moved on, a solemn bunch. Sandip, riding nearby, muttered to himself. \"That’s the fifteenth one. Fifteen men, dead in a few days. Light! We’re never going to survive this!\"\\n\\n If only it were Trollocs! Olver couldn’t fight trees and insects. Who could? But Trollocs, those he’d be able to fight. Olver had his knife, and he’d learned a few things about using it from Harnan and Silvic. Olver wasn’t that tall, but he figured that would make Trollocs underestimate him. He could lunge low and go for their vitals before they knew what was happening.\\n\\n He told himself this to keep his hands from shaking as he kicked Bela, hoping to move up by Lady Faile. In the distance, he heard a screeching sound, like something dying in a horrible way. Olver shivered. He’d heard that same sound earlier in the day. Did it sound closer now?\\n\\n Setalle gave him a worried glance as he neared the front. The others tried everything they could to keep him from danger. He steeled himself, ignoring that horrid screeching off in the distance. Everyone thought Olver was fragile, but he wasn’t. They hadn’t seen what he had, growing up. In truth, he didn’t like thinking about those times. It seemed as if he’d lived three lives. One before his parents died, one when he’d been alone and now this one.\\n\\n Anyway, he was used to fighting people bigger than he was. It was the Last Battle. They kept saying everyone would be needed. Well, why not him? When the Trollocs came, the first thing he’d do was climb down off this slow mount. He could stroll faster than this animal could gallop! Well, the Aiel didn’t need horses. Olver hadn’t gone to train with them yet, but he would. He had it planned out. He hated all Aiel, but mostly the Shaido, and he would need to learn their secrets if h \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-202.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
