{"id":92137,"no":204,"title":"Page 204","content":"\"We can’t afford to wait, Vanin\", Faile said. \"I intend to get back to Merrilor, one way or another. The Dragon Reborn will be fighting at Thakan’dar. That’s where we need to go to get out of this forsaken place\".\n Vanin groaned, but Olver smiled. He would find his way to Mat, and show how dangerous he could be in battle. Then . . .\n Well, then maybe Mat wouldn’t leave him like the others had. That would be good, as Olver was going to need Mat’s help tracking down those Shaido. After all he’d learned training with the Band, he was certain nobody would push him around. And nobody would take those he loved from him ever again.\n \"There are accounts in the archives that explain what we saw\". Cadsuane picked up her cup of tea to warm her hands.\n The Aiel girl, Aviendha, sat on the floor of the tent. What I wouldn’t give to have that one in the Tower, Cadsuane thought. These Wise Ones . . . they had fight to them. Real bite, like the best of the women in the White Tower.\n Cadsuane was increasingly convinced that the Shadow for years had been carrying out a complex plan to undermine the White Tower. It went deeper than Siuan Sanche’s unfortunate unseating and Elaida’s reign. It might be decades, centuries, before they understood the extent of the Shadow’s planning. However, the sheer number of Black sisters—hundreds, not the few dozen Cadsuane had guessed—shouted of what had happened.\n For now, Cadsuane had to work with what she had. That included these Wise Ones, poorly trained in using weaves but never lacking in grit. Useful. Like Sorilea, despite her weakness in the One Power, who sat farther back in the tent, watching.\n \"I have made some inquiries, child\", Cadsuane said to Aviendha. \"What this woman does is indeed Traveling. However, the only fragments of documents mentioning it date back to the War of Power\".\n Aviendha frowned. \"I saw no weaves, Cadsuane Sedai\".\n Cadsuane masked a smile at the respectful tone. The al’Thor boy had put this girl in command—and, in truth, better her than some others. However, he should have chosen Cadsuane, and Aviendha likely knew it.\n \"That is because the woman was not weaving the One Power\", Cadsuane replied.\n \"What else would it be?\"\n \"Do you know why the Dark One was originally freed?\"\n Aviendha looked as if remembering something. \"Ah . . . yes. Then they are channeling the Dark One’s power?\"\n \"It is called the True Power\", Cadsuane said. \"The accounts say that Traveling by True Power works in the way you have seen this woman move. Few saw it happen. The Dark One was miserly with his essence during the War of Power, and only the most favored were granted access. I surmise from this fact that this is most definitely one of the Forsaken. From your description of what she did to poor Sarene, I would suspect it is Graendal\".\n \"The stories never mentioned Graendal being so ugly\", Sorilea said softly.\n \"If you were one of the Forsaken, easily recognized by description, would you not wish to change your appearance to remain unknown?\"\n \"Perhaps\", Sorilea said. \"But then I would not use this . . . True Power, as you name it. That would defeat the purpose of my disguise\".\n \"From what Aviendha has told us\", Cadsuane noted, \"the woman did not have much of a choice. She had to escape quickly\".\n Cadsuane and Sorilea met eyes, and each nodded in agreement. They would hunt this Forsaken, the two of them.\n I won’t have you dying on me now, boy, Cadsuane thought, glancing over her shoulder toward where al’Thor, Nynaeve and Moiraine continued their work. Every channeler in the camp could feel that pulsing. At least, not until you’ve done what you need to do. Cadsuane had expected the Forsaken to be here. It was why she’d come to this battlefront.\n Wind shook the tent, chilling Cadsuane down deep. This place was awful, even when the battle slowed. The dread that hung here was like that of a funeral for a child. It stifled laughter, killed smiles. The Dark One watched. Light, but it would be good to leave this place.\n Aviendha drank her tea. The woman still looked haunted, although she had obviously lost allies in battle before.\n \"I left them to die\", she whispered.\n \"Phaw\", Cadsuane said to her. \"You are not to blame for what one of the Forsaken did, child\".\n \"You don’t understand\", Aviendha said. \"We were in a circle, and they tried to break free—I felt them—but I didn’t know what was happening. I held on to their Power, and so they couldn’t fight her. I left them helpless\".\n \"Well, from now on don’t leave those in your circle behind\", Cadsuane said briskly. \"You could not have known what would happen\".\n \"If you suspect this one is nearby, Aviendha\", Sorilea said, \"you will send word to Cadsuane, me or Amys. There is no shame in admitting that another is too strong to face alone. We will defeat this woman together and protect the Car’a’carn\"\n \"Very well\", Aviendha said. \"But you will do the same for me. All of you\".\n She waited. Cadsuane reluctantly agreed, as did Sorilea.\n Faile crouched in a dark tent. The air had grown even colder, now that they were close to Thakan’dar. She ran her thumb along the hilt of her knife, breathing in slowly and evenly, then releasing the breath in the same manner. She stared at the tent flaps, unblinking.\n She’d placed the Horn’s chest there with one corner sticking out into the night. She felt more alone here on the border of the Blasted Lands—surrounded by supposed allies—than she had in the Shaido camp.\n Two nights ago, she’d been called out of her tent to inspect some odd tracks that had worried the men. They hadn’t lost anyone since drawing so close to the Blasted Lands—that part of the plan was working—but tensions were still high. She’d been gone only a few minutes, but when she’d returned, the Horn’s chest in her tent had been moved just slightly.\n Someone had tried to open it. Light. Fortunately, they hadn’t managed to break the lock, and the Horn had still been there when she’d looked.\n The traitor could be anyone. One of the Redarms, a wagon driver, a member of Cha Faile. Faile had spent the past two nights being extra—even obviously—vigilant with the chest to frustrate the thief. Then, tonight, she’d complained of a headache and allowed Setalle to fix her some tea to help her sleep. She’d brought the tea back to her tent, had not taken a sip a \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-204.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
