{"id":92149,"no":217,"title":"Page 217","content":"Tam grunted. \"We’ve all changed. Mat would probably say similar things about you\".\n Dannil laughed. \"Oh, I doubt that, Tam. Though I do wonder, sometimes, what would have happened if I’d gone with the three of them. I mean, Moiraine Sedai was looking for boys the right age, and I guess I was just a little too old . . \".\n He seemed wistful. Dannil could say, and think, what he wanted—but Tam doubted he would have liked to endure the things that had forced Mat, Perrin and Rand to become the people they now were. \"Take command of this lot\", Tam said, nodding to the reserve archers. \"I’ll see that Arganda and Galad know we’re being reinforced\".\n Thick Trolloc arrows sprayed around Pevara as she desperately wove Air. Her gust blew away the arrows like stones swept off the board by a furious player. Sweating, she clung to saidar and wove a stronger shield of Air, moving it into the sky to defend against further volleys.\n \"It’s safe!\" she yelled. \"Go!\"\n A group of soldiers dashed out from underneath an overhang on the steep riverside slope of the Heights. More thick black shafts fell from above. They hit her shield; it slowed them to the point that once they passed through, they dropped as idly as feathers.\n The soldiers she’d helped dashed for the rallying point at Hawal Ford. Others decided to stand and fight as Trolloc bands poured down the slopes.\n Most of the Shadowspawn stayed atop the Heights to secure the position, and finish pushing humans off.\n Where? Androl’s furious thought came to her, a soft whisper inside her mind.\n Here, she sent him. Not completely a thought, more an image, a sense of place.\n A gateway split beside her, and he dashed through, Emarin on his heels. Both men carried swords, but Emarin spun and thrust his hand backward, a streak of fire shooting through the open gateway. Screaming sounded from the other side. Human screaming.\n \"You went all the way to the Sharan army?\" Pevara demanded. \"Logain wanted us to stay together!\"\n \"So you care about what he wants, now?\" Androl asked, grinning.\n You\u0027re insufferable, she thought. Around them, arrows clattered to the ground. The Trollocs above hooted in anger.\n \"Nice weave\", Androl said.\n \"Thank you\". She glanced at the sword.\n \"I’m a Warder now\". He shrugged. \"Might as well look like one, eh?\"\n He could cut a Trolloc in half with a gateway at three hundred paces, and summon fire from inside Dragonmount itself, and he still wanted to carry a sword. It was, she decided, a male thing.\n I heard that, Androl sent her. \"Emarin, to me. Pevara Sedai, if you’d graciously agree to accompany us . . \".\n She sniffed, but joined the other two as they moved along the southwestern base of the Heights, passing some wounded stumbling toward the rallying point. Androl glanced at them, then wove a gateway back to their camp. The flagging men cried out in surprise and thanks, and shambled through it to safety.\n Androl had grown . . . more confident since they had left the Black Tower. When they’d first met, he’d displayed hesitation about whatever he did. A kind of nervous humility. No more.\n \"Androl . . \" Emarin said, pointing up the slope with his sword.\n \"I see them\", Androl said. Above, Trollocs poured over the top of the Heights like pitch boiling over the side of a pot. Behind, Androl’s gateway closed, that group of soldiers safe. Others cried out as they saw it close.\n You can’t save them all, Pevara thought sternly to Androl, sensing his spike of anguish. Stay focused on the task at hand.\n The three of them moved through the soldiers, angling toward several channelers they could feel ahead. Jonneth, Canler and Theodrin were there, throwing fire at groups of Trollocs. Their position was being overrun.\n \"Jonneth, Canler, to me\", Androl said, charging past them and opening a gateway in front of him. Pevara and Emarin ducked through after him, finding themselves on the top of the Heights, a few hundred paces away.\n Jonneth and the others followed, joining them as the group dashed past a group of startled Trollocs.\n \"Channeling!\" Pevara yelled. Light, but it was hard to run in these skirts. Androl did know that, didn’t he?\n Androl opened another gateway for them as a few bursts of flame came from the direction of some Sharans atop the Heights. Pevara ran through, beginning to pant. They appeared on the other side of the Sharans, who were firing at where Pevara had been moments before.\n Pevara opened her senses, trying to spot—or feel—their quarry. The Sharans turned on them and pointed, but then cried out as Androl brought an avalanche of snow down on them from a gateway to the side. He had tried making those Deathgates that the other Asha’man used, but the weave was apparently just different enough that he had trouble. Instead, he stuck to what he was good at doing.\n Groups of Tower Guards still fought atop the Heights, holding ground against orders. Pieces of the dragons, including the large bronze firing tubes, lay smoldering nearby amid burned corpses. Thousands upon thousands of Trollocs howled, most at the edges of the Heights, loosing arrows on those below. Their joyous roars set Pevara on edge, and she wove Earth and sent the flows toward the ground near a group of them. A large chunk of ground trembled, then split off, dumping two dozen Trollocs over the edge.\n \"We’re drawing attention again!\" Emarin said, setting ablaze a Myrddraal that had been slinking toward them. It thrashed in the flames, screeching in an inhuman voice, refusing to die. Sweating, Pevara lent her Fire to Emarin’s, burning the creature until it was nothing more than bones.\n \"Well, that’s not all bad!\" Androl said. \"If we draw enough attention, sooner or later, one of the Black Ajah or one of Taim’s men will decide to confront us\".\n Jonneth cursed. \"That’s a little like jumping into an anthill and waiting to be bitten!\"\n \"Actually, it’s a lot like that\", Androl said. \"Keep watch. I’ll deal with the Trollocs!\"\n That’s quite a strong assertion, Pevara sent to him.\n His answer was warm, like heat off a cooking plate. It sounded heroic.\n I assume you could use some added strength?\n Yes, please, he sent.\n She iniated the link. He drew in her strength, taking control of their circle. As always, linking with him was an overwhelming experience. She felt her own emotions bounce back against him and to her again, and that made her blush. Did he sense how she wa \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-217.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
