{"id":92169,"no":237,"title":"Page 237","content":"\"Do something!\" Min shouted at the girl, grabbing her by the arm. The damane shook her head, crying. \"Burn you—\" Min said. The ceiling of the structure groaned. Min ran for Mat. One Gray Man was dead, but there were two others, wearing the uniforms of Seanchan guards. Min had trouble seeing the living ones; they were inhumanly average in every way. Utterly nondescript. Mat bellowed, knifing one of the men, but he didn’t have his spear. Min didn’t know where it was. Mat pushed forward, reckless, taking a gash along his side. Why? Tuon, Min realized, stumbling to a halt. One of the Gray Men knelt above her motionless form, raising a dagger, and— Min threw. Mat toppled to the ground a few feet from Tuon; the final Gray Man had him by the legs. Min’s knife spun through the air, reflecting flames, and took the Gray Man over Tuon in the chest. Min breathed out. Never in her life had she been so happy to see a knife fly true. Mat had cursed, turning about, booting his aggressor in the face. He followed that with a knife, then scrambled for Tuon, hauling her up onto his shoulder. Min met him. \"Siuan is here, too. She—\" Mat pointed. Siuan lay on the floor of the building. Her eyes stared sightlessly, and all the images were gone from above her. Dead. Min froze, heart wrenching. Siuan! She moved toward the woman anyway, unable to believe she was dead, though her clothing burned from the explosion of fire that had taken her and about half of the wall nearby her. \"Out!\" Mat said, coughing, cradling Tuon. He threw his shoulder against a wall that was only half-burned, breaking out into the air. Min groaned, leaving Siuan’s corpse, blinking away tears both from grief and from the smoke. She coughed as she followed Mat out into open air. The outside smelled so sweet, so cold. Behind them, the building groaned, then collapsed. In moments, Min and Mat were surrounded by members of the Death-watch Guard. Not a one tried to take Tuon—who was still breathing, if shallowly—away from Mat. From the look in his eye, Min doubted they’d have been able to do so. Farewell, Siuan, Min thought, looking back as Guards ushered her away from the fighting below Dashar Knob. May the Creator shelter your soul. She would send word to others to protect Bryne, but she knew—deep down—it would be futile. He would have gone into a vengeful rage the moment Siuan died, and discounting that, there was the viewing. She was never wrong. Sometimes, Min hated her accuracy. But she was never wrong. \"Strike at their weaves\", Egwene yelled. \"I’ll attack!\" She didn’t wait to see if she was obeyed. She struck, holding as much power as she could, drawing it through Vora’s sa’angreal and heaving three different bands of fire upslope at the entrenched Sharans. Around her, Bryne’s well-trained troops struggled to maintain battle lines as they fought Sharan soldiers, working their way up the western side of the Heights. The hillside was pocked with hundreds of furrows and holes, created by weaves from one side or the other. Egwene fought forward desperately. She could feel Gawyn above, but she thought he was unconscious; his spark of life was so faint that she could barely sense his direction. Her only hope was to fight through the Sharans and reach him. The ground rumbled as she vaporized a Sharan woman above; Saerin, Doesine and other sisters concentrated on deflecting the enemy weaves, while Egwene focused on sending attacks. She stepped forward. One step after another. I\u0027m coming, Gawyn, she thought, growing frantic. I’m coming. \"We come to report, Wyld\". Demandred ignored the messengers for the moment. He flew upon the wings of a falcon, inspecting the battle through the birds eyes. Ravens were better, but each time he tried using one of those, one Borderlander or another shot it down. Of all the customs to remember through the Ages, why did it have to be that one? No matter. A falcon would work, even if the bird did resist his control. He guided it about the battlefield, inspecting formations, deployments, advancements of troops. He did not have to rely upon the reports of others. It should have been an almost insurmountable advantage. Lews Therin could not use such an animal; this was a gift only the True Power could grant. Demandred could channel only a thin trickle of the True Power—not enough for destructive weaves, but there were other ways to be dangerous. Unfortunately, Lews Therin had his own advantage. Gateways that looked down upon a battlefield? It was discomforting the things people of this time discovered, things that hadn’t been known during the Age of Legends. Demandred opened his eyes and broke his bond to the falcon. His forces were advancing, but each step was a grueling ordeal. Tens of thousands of Trollocs had been slain. He had to be careful; their numbers were not limitless. He was currently on the eastern side of the Heights, looking down at the river below and northeast of the place where Lews Therin’s assassin had tried to kill him. Here, Demandred was nearly opposite the hill that Moghedien said they called Dashar Knob. The rock formation rose high in the air; its base was a fine position for a command post, sheltered from attacks by the One Power. It was so tempting to strike there himself, to Travel to it and lay waste. But was that what Lews Therin wanted? Demandred would fight the man. He would. However, Traveling into the enemy’s stronghold and possibly a trap, surrounded as it was by those high rock walls . . . Better to draw Lews Therin to him. Demandred dominated this battlefield. He could choose where their confrontation would occur. The riverbed had been slowed to a muddy trickle below, and Demandred’s Trollocs fought to seize the southern bank. The defenders held for now, but he would have them soon. Far upriver M’Hael had done his work well in diverting that water, though he had reported unusual resistance. Townspeople and a small unit of soldiers? An oddity that Demandred had not yet deciphered. He had almost wished for failure from M\u0027Hael. Though Demandred himself had been the one to recruit the man, he had not expected M’Hael to rise to the rank of Chosen so quickly. Demandred turned to the side. Before him bowed three women in black with white ribbons. Next to them, Shendla. Shendla. He had thought himself long past caring for a woman again—how could affection thrive beside the burning passion that was his hatred for Lews Therin? And yet, Shendla . . . Devious, capable, powerful. Almost it was enough t","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-237.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. In Andor, the Trollocs seize Caemlyn. In the wolf dream, Perrin Aybara battles Slayer. Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
