{"id":92173,"no":241,"title":"Page 241","content":"She stopped in the center of the camp, looking about, trying to decide whom to approach. She could distinguish servants from nobles. Approaching the former would be less dangerous, but also less likely to yield results. Maybe—\n \"You!\"\n Pevara started, spinning around.\n \"You should not be here\". The aged Sharan was completely bald, with a short gray beard. Twin sword hilts in the shape of serpents’ heads peeked out over his shoulders; he wore the blades crossed at his back, and he carried a staff that had strange holes along its length. A flute of some sort?\n \"Come\", the man said, his accent so thick, Pevara could barely make it out. \"The Wyld will need to see you\".\n Who is the Wyld? Pevara sent Androl.\n He shook his head, feeling as baffled as she did.\n This could turn out very badly.\n The old man stopped ahead of them with an annoyed expression. What would he do if they refused? Pevara was tempted to create a gateway for them to flee.\n We follow, Androl thought, striding forward. We\u0027re never going to find Taim in this unless we talk to someone.\n Pevara frowned as he walked after the man, the other Asha’man joining him. She hurriedly caught up. I thought we had decided I was in charge, she thought to him.\n No, he replied, I thought that we’d decided you would act like you were in charge.\n She sent back a calculated mix of cold displeasure and an implication that the conversation was not yet finished.\n Androl sent back amusement. Did you . . . just glare at me mentally? That’s impressive.\n We’re taking a risk, she sent back. This man could lead us into anything.\n Yes, he replied.\n Something smoldered inside of him, something only hinted at until now. You want Taim that badly?\n . . . Yes. I do.\n She nodded.\n You understand? he sent.\n I lost friends to him as well, Androl, she replied. I watched the?n be taken right in front of me. We have to be careful, though. We cant take too many risks. Not yet.\n It’s the end of the world\\ Pevara, Androl sent back. If we can’t take risks now, when will we?\n She followed without further argument, wondering at the determined focus she sensed in Androl. Taim had awoken something inside of him by taking his friends and Turning them to the Shadow.\n As they followed the old Sharan, Pevara realized that she didn’t understand what Androl was feeling, not completely. Aes Sedai friends of hers had been taken, but it wasn’t the same as Androl losing Evin. Evin had trusted Androl, looked to Androl for protection. The Aes Sedai with Pevara had been acquaintances, friends, but it was different.\n The old Sharan led them to a larger group of people, many of whom wore fine clothing. The highest noblemen and women among the Sharans didn’t seem to fight, for not one of them carried a weapon. They made way for the older man, though several looked at his swords and sneered.\n Jonneth and Emarin moved in around Pevara and Theodrin, one to each side, like bodyguards. They eyed the Sharans, hands on weapons, and she suspected that both were holding the One Power. Well, that would probably be expected of Dreadlords who were walking among allies they didn’t fully trust. They didn’t need to protect Pevara in such a way, but it was a nice gesture. She had always thought it would be useful to have a Warder. She had gone to the Black Tower with the intention of taking multiple Asha’man as Warders. Perhaps . . .\n Androl immediately felt jealous. What are you? Some Green with a flock of men fawning over her?\n She sent back amusement. Why not?\n They’re too young for you, he sent back. Jonneth is, anyway. And Theodrin would fight you for him.\n I’m considering bonding them, she sent back, not bedding them, Androl Honestly. Besides, Emarin prefers men.\n Androl paused. He does?\n Of course he does. Haven’t you been paying attention?\n Androl seemed baffled. Sometimes, men could be surprisingly dense, even observant ones like Androl.\n Pevara embraced the One Power as they reached the center of the group. Would she have time to make a gateway if something went wrong? She did not know the area, but so long as she Traveled somewhere nearby, that wouldn’t matter. She felt as if she was walking up to a noose and inspecting it, deciding how well it would fit her neck.\n A tall man in armor made of silvery discs with holes in the middle stood at the center of the group, dispensing orders. As they watched, a cup moved toward him through the air. Androl stiffened. He’s channeling, Pevara.\n Demandred, then? It must be. Pevara let saidar flood her with its warm glow, letting it wash away emotions. The old man who had been leading them stepped forward and whispered something to Demandred. Despite the enhanced senses of saidar,; Pevara could not hear what was said.\n Demandred turned toward the group of them. \"What is this? Has M’Hael so quickly forgotten his orders?\"\n Androl dropped to his knees, as did the others. Though it galled her, Pevara went down as well.\n \"Great One\", Androl said, \"we were merely—\"\n \"No excuses!\" Demandred yelled. \"No games! M’Hael is to take all of his Dreadlords and destroy the White Tower forces. If I see any of you away from that fight, I will make you wish I’d given you to the Trollocs instead!\"\n Androl nodded eagerly, then began backing away. A whip of Air Pevara could not see—although she could feel his pain through the bond—cracked him in the face. The rest of them followed after him, scrambling away with heads low.\n That was foolish and dangerous, Pevara thought at Androl.\n And effective, he replied, eyes ahead, hand to his cheek, blood seeping between the fingers. We know Taim is on the battlefield for sure, and we know where to find him. Let’s move.\n Galad scrambled through a nightmare. He had known that the Last Battle might be the end of the world, but now . . . now he felt it.\n Channelers on both sides scourged one another, shaking Polov Heights. Lightning had struck so often that Galad could barely hear any longer, and his eyes watered from the pain of seeing blasts strike nearby.\n He threw himself up against the hillside, digging his shoulder into the ground and ducking for cover as a series of explosions ripped up the earth in front of him. His team—twelve men in tattered white cloaks—dove for cover with him.\n The White Tower’s forces were strained under the attacks, but so were the Sharan forces. The power of so many channelers was incredible.\n The main bulk of White Tower infantry and a large number of Sharan troops fought here on the western Heights. Galad stayed on the perimeter of that battle, looking for Sharan channelers alone or in small groups. In many places here, the battle lines on both sides had fractured. Not surprising; it was near impossible to maintain solid battle lines with all of that power be \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-241.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
