{"id":92184,"no":252,"title":"Page 252","content":"\"I forget how young she is\". Whispers drifted into the room. That voice was familiar. Silviana? \"Care for her. I must return to the battle\".\\n\\n \"How docs it go?\" Egwene knew that voice, too. Rosil, of the Yellow. She had gone to Mayene, with the novices and Accepted, helping Heal.\\n\\n \"The battle? It goes poorly\". Silviana was not one to put honey on her words. \"Watch her, Rosil. She is strong; I do not doubt she will pull through this, but there is always a worry\".\\n\\n \"I’ve helped women with lost Warders before, Silviana\", Rosil said. \"I assure you, I’m quite capable. She’ll be useless for the next few days, but then she will begin to mend\".\\n\\n Silviana sniffed. \"That boy . . . I should have known he would ruin her. The day I first saw how she looked at him, I should have taken him by his ears, hauled him to a distant farm, and set him to work for the next decade\".\\n\\n \"You cannot so easily control a heart, Silviana\".\\n\\n \"Warders are a weakness\", Silviana said. \"That is all they have ever been, and all they ever will be. That boy . . . that fool boy . . \".\\n\\n \"That fool boy\", Egwene said, \"saved my life from Seanchan assassins. I would not be here to mourn if he had not done so. I would suggest that you remember that, Silviana, when you speak of the dead\".\\n\\n The others were silent. Egwene tried to overcome the pain of loss. She was in Mayene, of course. Silviana would have taken her to the Yellows.\\n\\n \"I will remember it, Mother\", Silviana said. She actually managed to sound contrite. \"Rest well. I will—\"\\n\\n \"Rest is for the dead, Silviana\", Egwene said, sitting up.\\n\\n Silviana and Rosil stood in the doorway of the beautiful room, which was draped with blue cloth below the ceiling of worked mother-of-pearl inlays. Both women folded their arms and gave her stern looks.\\n\\n \"You’ve been through something extremely hurtful, Mother\", Rosil said. Near the doorway, Leilwin stood guard. \"The loss of a Warder is enough to stop any woman. There is no shame in letting yourself deal with the grief\".\\n\\n \"Egwene al’Vere can grieve\", Egwene said, standing up. \"Egwene al’Vere lost a man she loved, and she felt him die through a bond. The Amyrlin has sympathy for Egwene al’Vere, as she would have sympathy for any Aes Sedai dealing with such loss. And then, in the face of the Last Battle, the Amyrlin would expect that woman to pick herself up and return to the fight\".\\n\\n She walked across the room, each step firmer. She held out her hand to Silviana, nodding toward Vora’s sa’angreal, which she held. \"I will be needing that\".\\n\\n Silviana hesitated.\\n\\n \"Unless the two of you wish to discover just how capable I am at present\", Egwene said softly, \"I would not suggest disobedience\".\\n\\n Silviana looked to Rosil, who sighed and nodded reluctantly. Silviana handed over the rod.\\n\\n \"I do not condone this, Mother\", Rosil said. \"But if you are insistent . . \"\\n\\n \"I am\".\\n\\n \" . . then I will give you this suggestion. Emotion will threaten to crush you. This is the danger. In the face of a lost Warder, summoning saidar will be difficult. If you do manage it, Aes Sedai serenity will likely be impossible. This can be dangerous. Very dangerous\".\\n\\n Egwene opened herself to saidar. As Rosil had suggested, it was difficult to embrace the Source. Too many emotions vied for her attention, overwhelming her, driving away her calm. She blushed as she failed a second time.\\n\\n Silviana opened her mouth, undoubtedly to suggest that Egwene sit back down. At that moment, Egwene found saidar,; the bud in her mind flowering, the One Power rushing into her. She gave Silviana a defiant look, then began weaving a gateway.\\n\\n \"You didn’t hear the rest of my advice, Mother\", Rosil said. \"You will not be able to banish the emotions troubling you, not completely. Your only choice is a bad one, to overwhelm those emotions of grief and pain with stronger emotions\".\\n\\n \"That should not be difficult at all\", Egwene said. She drew a deep breath, pulling in more of the One Power. She allowed herself anger. Fury at the Shadowspawn who threatened the world, anger at them for taking Gawyn from her.\\n\\n \"I will need eyes to watch me\", Egwene said, defying Silviana’s previous words. Gawyn had not been a weakness to her. \"I will need another Warder\".\\n\\n \"But—\" Rosil began.\\n\\n Egwene stopped her with a look. Yes, most women waited. Yes, Egwene al’Vere was pained from her loss, and Gawyn could never be replaced. But she believed in Warders. The Amyrlin Seat needed someone to watch her back. Beyond that, every person with a Warder bond was a better fighter than those without. To go without a Warder was to deny the Light another soldier.\\n\\n There was a person here who had saved her life. No, a piece of her said, her eyes falling on Leilwin. Not a Seanchan.\\n\\n Another piece of her, the Amyrlin, laughed at that. Stop being such a child. She would have a Warder. \"Leilwin Shipless\", Egwene said loudly, \"will you take this duty?\"\\n\\n The woman knelt, bowing her head. \"I . . . yes\".\\n\\n Egwene formed the weave for the bond. Leilwin stood, looking less fatigued, taking a deep breath. Egwene opened a gateway to the other side of the chamber, then used her immediate knowledge of this room to open another one to where her people fought. Explosions, screams and the beating of weapons against shields poured through.\\n\\n Egwene strode back onto the killing fields, bringing the fury of the Amyrlin with her.\\n\\n Demandred was a blademaster. Galad had assumed this would be the case, but he preferred to test his assumptions.\\n\\n The two danced back and forth inside the ring of watching Sharans. Galad wore lighter armor, mail under his tabard, and stepped more quickly. The interwoven coins Demandred wore were heavier than simple mail, but good against a sword.\\n\\n \"You are better than your brother was\", Demandred said. \"He died easily\".\\n\\n The man was trying to enrage Galad. He did not succeed. Cold, careful. Galad moved in. The Courtier Taps His Fan. Demandred responded with something very similar to The Falcon Stoops, slapping away Galad’s attack. Demandred stepped back, walking around the perimeter of the ring, sword out to the side. At the beginning, he had spoken a great deal. Now he made only the occasional gibe.\\n\\n They circled each other in the darkness, lit by torches held in Sharan hands. One rotation. Two.\\n\\n \"Come now\", Demandred said. \" \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-252.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
