{"id":92218,"no":286,"title":"Page 286","content":"The Seanchan. Thinking of them and that imperious leader of theirs made Moghedien writhe. When the Great Lord discovered the mess she’d made . . .\n No. He had given her the True Power. Moghedien had outlasted the others, and only that mattered, for now. He could not see everywhere, and probably did not yet know that she’d been uncovered. How had that girl seen through her disguise? It shouldn’t have been possible.\n Someone must have betrayed her. Still, she had been working closely with Demandred during this battle, and though she had never been as good a tactician as he—none of the Chosen had been, except maybe Sammael—she understood the battle well enough to take charge. She hated to do it, as it left her exposed in a way she disliked. But desperate times made for desperate actions.\n And actually, as she considered, she thought that events were going fairly well for her. Demandred down, defeated by his own pride. M’Hael, that upstart, was also dead—and had conveniently removed the leader of the Aes Sedai from the battlefield. She still had the bulk of Demandred’s Shadowspawn and some Dreadlords, some of the Black Ajah and a dozen of the Turned men M’Hael had brought.\n \"This is not him!\" said an older man wearing the robes of a Sharan monk. He pointed at Moghedien. \"This is not our Wyld! It is—\" Moghedien burned the man to nothingness.\n As his bones fell in a heap, she remembered off-handedly from her eyes-and-ears that Demandred had shown that old man fondness. \"Better you should die, old one\", she said to the corpse, speaking as Demandred, \"than live to denounce the one you should have loved. Does anyone else wish to deny me?\"\n The Sharans remained silent.\n \"Ayyad\", Moghedien said to the three, \"did you see me craft weaves?\" Both women and the grimy man shook their heads.\n \"I kill without weaves\", Moghedien said, \"only I, your Wyld, could have done this\".\n She had to remember not to smile, even in victory, as the people bowed their heads. Demandred was always solemn. As the people fell to their knees, Moghedien had to hold in her joy by force. Yes, Demandred had done good work here, and had handed her the army of an entire nation to play with. This would go quite well indeed!\n \"Dragonslayer\", said a kneeling Ayyad woman. She was weeping! How weak these Sharans were. \"We saw that you had fallen . . \".\n \"How could I fall? You have prophecies, do you not?\"\n The women looked at one another. \"They say you will fight, Dragonslayer\", the woman said. \"But . . \".\n \"Gather five fists of the Trollocs from the back lines\", Moghedien said, turning to the commander of the reserve unit, \"and send them upriver to the ruins\".\n \"The ruins?\" the man asked. \"Only the Caemlyn refugees are in that direction\".\n \"Exactly, you fool. Refugees—children, the elderly, women who search for the dead. They can’t fight back. Tell the Trollocs to start slaughtering. Our enemies are weak; an attack like this will force them to break off and protect the ones that true warriors would just let die\".\n The general nodded, and she saw approval in his face. He accepted her as Demandred. Good. He ran off to give the order.\n \"Now\", Moghedien said as the dragons fired in the distance, \"why haven’t any of our Ayyad gone to remove those weapons from the battle?\"\n The Ayyad kneeling before Moghedien bowed her head. \"We have fewer than a dozen Ayyad left, Wyld\".\n \"Your excuses are weak\", Moghedien said, listening as the explosions stopped. Perhaps some of M’Hael’s remaining Dreadlords had just resolved the problem of the dragons.\n She felt her skin itch as the Sharan commander strode toward a Myrddraal across the field. She hated being in the open like this. She was meant to remain in shadows, letting others lead battles. However, she would never have it said that when the situation demanded it, she was too frightened to go and—\n A gateway split open behind her, and several of the Sharans yelled out. Moghedien spun, opening her eyes wide as she looked into what appeared to be a dark cavern. Dragons pointed out of it.\n \"Fire!\" a voice yelled.\n \"Close the gateway!\" Talmanes shouted, and the portal winked shut.\n \"This was one of Lord Mat\u0027s ideas, wasn\u0027t it?\" Daerid yelled, standing beside Talmanes as the dragons were reloaded. They both had wax in their ears.\n \"What do you think?\" Talmanes yelled back.\n If the dragons were vulnerable when firing, what did you do? You fired them from a hidden location.\n Talmanes smiled as Neald opened the next gateway in front of ten dragons. The fact that many of the dragon carts were too broken to roll well meant nothing when you could open a gateway in front of them, pointing them wherever you wanted.\n This gateway opened up on several fists of Trollocs engaged in fierce combat against Whitecloaks. Some of the Shadowspawn turned horrified eyes toward the dragons.\n \"Fire!\" Talmanes shouted, waving his hand down to give a visual cue, in case any of the men couldn’t hear him.\n Smoke filled the cavern, explosions echoing against Talmanes’ earplugs, as the dragons recoiled, releasing a storm of death into the Trollocs. They broadsided the fists, sweeping them out of the way, leaving them broken and dying. The nearby Whitecloaks cheered and raised swords.\n Neald shut the gateway, and the dragoners reloaded their weapons. Neald then made a gateway above them, facing downward, to vent the dragon smoke out of the cavern complex and away into empty air somewhere distant.\n \"Are you smiling,?\" Daerid asked.\n \"Yes\", Talmanes said, satisfied.\n \"Blood and bloody ashes, Lord Talmanes . . . that expression is horrifying on you\". Daerid hesitated. \"You should probably do that more often\".\n Talmanes grinned as Neald opened the next gateway to a point on Dashar Knob where Aludra stood with spyglass and scouts, deciding on the next place to target. She yelled through a position, Neald nodded, and they set up the next shot.\n CHAPTER 42\n Impossibilities\n Aviendha felt as if the world itself were cracking, breaking apart, being consumed.\n The lightning that fell on the valley of Shayol Ghul was no longer under control. Not by the Windfinders, not by anyone. It slew Shadowspawn and defender alike. Unpredictable. The air smelled of fire, burned flesh and something else—a distinctive, clean odor she had come to recognize as the sce \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-286.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
