{"id":92225,"no":293,"title":"Page 293","content":"\"More dangerous than letting Rand die?\" Perrin said. \"More dangerous than leaving Gaul without an ally in the World of Dreams, protecting the Car’a’carn alone?\" \"That one is likely to stab himself with his own spear if left to fight alone\", Chiad said. \"I didn’t mean—\" \"Hush, Perrin Aybara. I will try\". She left in a rustle of cloth. Perrin lay back on the bed, rubbing his eyes with the heels of his palms. He’d been far more certain of himself when he’d fought Slayer this last time, yet still he’d failed. He gritted his teeth, hoping Chiad would return soon. Something moved outside his room. He revived, hauling himself up to a sitting position again. A large shape darkened the doorway, then removed the shield from a lamp. Master Luhhan was built like an anvil, with a compact—yet powerful—torso and arms that bulged. In Perrin\u0027s mind’s eye, the man didn’t have so much gray in his hair. Master Luhhan had grown older, but he was not frail. Perrin doubted he ever would be. \"Lord Goldeneyes?\" he asked. \"Light, please\", Perrin said. \"Master Luhhan, you of all people should feel free to call me Perrin. If not ‘that worthless apprentice of mine.’ \" \"Here, now\", Master Luhhan said, walking into the room. \"I don’t believe I called you that except once\". \"When I broke the new blade for Master al’Moor’s scythe\", Perrin said, smiling. \"I was sure I could get it right\". Master Luhhan chuckled. He paused beside Perrin’s hammer, which still lay on the table at the foot of the bed, and rested his fingers on it. \"You have become a master of the craft\". Master Luhhan seated himself on a stool beside the bed. \"One craftsman to another, I’m impressed. I don’t think I could have ever made something so fine as that hammer\". \"You made the axe\". \"I guess I did that\", he said. \"It was not a thing of beauty. It was a thing of killing\". \"Killing sometimes needs to be done\". \"Yes, but it’s never beautiful. Never\". Perrin nodded. \"Thank you. For finding me, bringing me here. For saving me\". \"It was self-interest, son!\" Master Luhhan said. \"If we escape this, it will be because of you boys, mark my words on it as true\". He shook his head, as if he couldn’t believe it. One man, at least, remembered the three of them as youths—youths who, in Mat’s case at least, had been in trouble more often than not. Actually, Perrin thought, I\u0027m pretty sure Mat’s still in trouble more often than not. At least, at the moment, he wasn’t fighting but instead talking with some Seanchan, according to the spinning colors that resolved into an image. \"Chiad said that the fighting at Merrilor was finished?\" Perrin asked. \"It is\", Master Luhhan said. \"I came through, carrying some of our wounded. I should be getting back to Tam and Abell soon, but I wanted to check on you\". Perrin nodded. That tugging inside of him . . . if anything, it was stronger now than it ever would be. Rand needed him. The war wasn’t finished yet. Not by far. \"Master Luhhan\", Perrin said with a sigh. \"I’ve made a mistake\". \"Mistake?\" \"I ran myself ragged\", Perrin said. \"I pushed myself too hard\". He made a fist, slamming it into the corner post of the bed. \"I should know better, Master Luhhan. I always do this. I work myself so hard, I make myself useless the next day\". \"Perrin, lad?\" Master Luhhan said, leaning forward. \"Today, I’m more worried that there’s not going to be a next day\". Perrin looked up at him, frowning. \"If there was ever a time to push yourself, this is it\", Master Luhhan said. \"We’ve won one fight, but if the Dragon Reborn doesn’t win his . . . Light, I don’t think you’ve made a mistake at all. This is our last chance at the forge. This is the morning that the big piece is due. Today, you just keep working until it’s done\". \"But if I collapse . . \". \"Then you gave it your all\". \"I could fail because I’ve run myself out of strength\". \"Then at least you didn’t fail because you held back. I know it sounds bad, and maybe I’m wrong. But . . . well, everything you’re talking about is good advice for an average day. This isn’t an average day. No, by the Light it’s not\". Master Luhhan took Perrin by the arm. \"You may see in yourself someone who lets himself go too far, but that’s not the man I see. If anything, Perrin, I’ve seen in you someone who has learned to hold himself back. I’ve watched you hold a teacup with extreme delicacy, as if you feared breaking it with your strength. I’ve seen you clasp hands with a man, holding his hand in yours with such care, never squeezing too hard. I’ve watched you move with deliberate reserve, so that you don’t shove anyone or knock anything over. \"Those were good lessons for you to learn, son. You needed control. But in you, I’ve seen a boy grow into a man who doesn’t know how to let those barriers go. I see a man who’s frightened of what happens when he gets a little out of control. I realize you do what you do because you’re afraid of hurting people. But Perrin . . . it’s time to stop holding back\". \"I’m not holding back, Master Luhhan\", Perrin protested. \"Really, I promise\". \"Is that the case? Well, maybe you’re right\". Master Luhhan suddenly smelled embarrassed. \"Look at me. Here, acting like it’s my business. I’m not your father, Perrin. I’m sorry\". \"No\", Perrin said as Master Luhhan stood to leave. \"I no longer have a father\". Master Luhhan gave him a pained look. \"What those Trollocs did . \". \"My family wasn’t killed by Trollocs\", Perrin said softly. \"It was Padan Fain\". \"What? Are you certain?\" \"One of the Whitecloaks told me\", Perrin said. \"He wasn’t lying\". \"Well, then\", Luhhan said. \"Fain . . . he’s still out there, isn’t he?\" \"Yes\", Perrin said. \"He hates Rand. And there’s another man. Lord Luc. You remember him? He’s been ordered to kill Rand. I think . . . I think they’re both going to try for him, b","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-293.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. In Andor, the Trollocs seize Caemlyn. In the wolf dream, Perrin Aybara battles Slayer. Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
