{"id":92226,"no":294,"title":"Page 294","content":"\"Then you’ll have to make sure they don’t succeed, won’t you?\"\n Perrin smiled, then turned toward the footsteps outside. Chiad entered a moment later, and he could smell her annoyance that he’d sensed her coming. Bain followed, another figure in complete white. And after them . . .\n Masuri. Not the Aes Sedai he would have chosen. Perrin felt his lips tighten.\n \"You do not like me\", Masuri said. \"I know this\".\n \"I have never said that\", Perrin replied. \"You were a great help to me during our travels\".\n \"And yet, you do not trust me, but that is beside the point. You wish to have your strength restored, and I am probably the only one willing to do it for you. The Wise Ones and the Yellows would paddle you like a babe for wanting to leave\".\n \"I know\", Perrin said, sitting down on the bed. He hesitated. \"I need to know why you were meeting with Masema behind my back\".\n \"I come here to fulfill a request\", Masuri said, smelling amused, \"and you tell me you won’t let me do you that favor until I respond to interrogation?\"\n \"Why’d you do it, Masuri?\" Perrin said. \"Out with it\".\n \"I planned to use him\", the slender Aes Sedai said.\n \"Use him\".\n \"Having influence with one who called himself the Prophet of the Dragon could have been useful\". She smelled embarrassed. \"It was a different time, Lord Aybara. Before I knew you. Before any of us knew you\". Perrin grunted.\n \"I was foolish\", Masuri said. \"Is that what you wanted to hear? I was foolish, and I have since learned\".\n Perrin eyed her, then sighed, proffering his arm. It was still an Aes Sedai answer, but one of the straighter ones he had heard. \"Do it\", he said. \"And thank you\".\n She took his arm. He felt his fatigue evaporate—felt it get shoved back, like an old quilt being stuffed into a small box. Perrin felt invigorated, strengthened. Powerful again. He practically leaped as he came to his feet.\n Masuri sagged, sitting down on his bed. Perrin flexed his hand, looking down at his fist. He felt as if he could challenge anyone, even the Dark One himself. \"That feels wonderful\".\n \"I’ve been told I excel at this particular weave\", Masuri said. \"But be careful, it—\"\n \"Yes\", Perrin said. \"I know. The body is still tired. I just can’t feel it\". And, as he considered, that last part wasn’t exactly true. He could sense his fatigue, like a serpent deep within its hole, lurking and waiting. It would consume him again.\n That meant he had to finish his job first. He inhaled deeply, then summoned his hammer to him. It didn’t move.\n Right; he thought. This is the real world, not the wolf dream. He walked over and slipped the hammer into its straps on his belt, the new ones that he had fashioned to hold the larger hammer. He turned toward Chiad, who stood by the doorway; he could smell Bain out there, too, where she’d retreated. \"I will find him\", Perrin said. \"If he is wounded, I will bring him here\".\n \"Do that\", Chiad said, \"but you will not find us here\".\n \"You are going to Merrilor?\" Perrin asked, surprised.\n Chiad said, \"Some of us are needed to bring the wounded in to be Healed. It is not a thing gai’shain have done in the past, but perhaps it is a thing we can do this time\".\n Perrin nodded, then closed his eyes. He imagined himself close to sleep, drifting. His time in the wolf dream had trained his mind well. He could fool himself, with concentration. That didn’t change the world here, but it did change his perceptions.\n Yes . . . drifting close to sleep . . . and there was the pathway. He took the branch toward the wolf dream in the flesh, and caught just a hint of a gasp from Masuri as he felt himself shift between worlds.\n He opened his eyes and dropped into buffeting winds. He created a pocket of calm air, then hit the ground beneath with strengthened legs. Only a few teetering walls remained of Berelain’s palace on this side. One of those broke apart, the stones shattering and pulled into the sky by the winds. The city beyond was mostly gone, heaps of rock here and there indicating where buildings had once stood. The sky groaned like bending metal.\n Perrin summoned his hammer into his hand, then began the hunt one last time.\n Thom Merrilin sat on a large, soot-blackened boulder, smoking his pipe, watching the world end.\n He knew a thing or two about finding the best vantage to watch a performance. He judged this to be the finest seat in the world. His boulder was just next to the entrance into the Pit of Doom, close enough that if he leaned back and squinted, he could peer in and catch some of the lights and shadows playing inside. He glanced in. Nothing had changed.\n Stay safe in there, Moiraine, he thought. Please.\n He was also close enough to the edge of the path to overlook the valley below. He puffed on his pipe, knuckling his mustache.\n Someone had to record this. He couldn’t spend the entire time worrying about her. So, he searched his mind for the right words to describe what he was seeing. He set aside words like \"epic\" and \"momentous\". They were nearly worn out with overuse.\n A wave of wind blew through the valley, ruffling the cadin’sor of Aiel fighting red-veiled enemies. Lightning surged, pounding at the Dragon-sworn line holding the path up to the cave entrance. Those flashes sent men flying into the air. Then, that lightning started striking at the Trollocs instead. The clouds went back and forth like that, the Windfinders seizing control of the weather, the Shadow taking it back. Neither side yet had managed a clear advantage for long.\n Hulking dark beasts ravaged the valley, killing with ease. The Dark-hounds did not fall despite the work of dozens in concert. The right side of the valley was covered in a thick mist that, for some reason, the storm winds couldn’t budge.\n \"Climactic\"? Thom thought, chewing on the stem of his pipe. No. Too expected. If you used the words people expected, they grew bored. A great ballad needed to be unexpected.\n Never be expected. When people start to expect you—when they started to anticipate your flourishes, to look for the ball you had hidden through sleight of hand, or to smile before you reached the twist line of your tale—it was time to pack up your cloak, bow once more for good measure, and stroll away. After all, that was what they’d least expect you to do when all was going well.\n He leaned back again, peering into the tunnel. He couldn’t see her, of course. She was too far in. But he could feel her, in his m \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-294.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
