{"id":92239,"no":308,"title":"Page 308","content":"He did not want to be here. He wanted slumber, true slumber. There, he could not feel the pain. Here he could.\n I shouldn’t have left her.\n A thought of men. Why did it creep in!\n But what could I do? I promised not to treat her like glass.\n Run. Run fast. Run until exhaustion came!\n I had to go to Rand. I had to. But in doing so, I failed her!\n To the Two Rivers in a flash. Back out, along the river. The Waste, then back, a long run toward Falme.\n How could I be expected to hold them both, then let one go?\n To Tear. Then to the Two Rivers. A blur, growling, moving as quickly as he could. Here. Here he had wed her.\n Here he howled.\n Caemlyn, Cairhien, Dumai’s Wells.\n Here he saved one of them.\n Cairhien, Ghealdan, Malden.\n Here he had saved another.\n Two forces in his life. Each had pulled at him. Young Bull finally collapsed near some hills somewhere in Andor. A familiar place.\n The place where I met Elyas.\n He became Perrin again. His thoughts were not wolf thoughts, his troubles not wolf troubles. He stared up at the sky that was now, after Rand\u0027s sacrifice, empty of clouds. He had wanted to be with his friend as he died.\n This time, he would be with Faile where she had died.\n He wanted to scream, but it would do no good. \"I have to let go, don’t I?\" he whispered toward that sky. \"Light. I don’t want to. I learned. I learned from Malden. I didn’t do it again! I did what I was supposed to, this time\".\n Somewhere nearby, a bird cried in the sky. Wolves howled. Hunting.\n \"I learned . . \".\n A bird’s cry.\n It sounded like a falcon.\n Perrin threw himself to his feet, spinning. There. He vanished in an instant, appearing on an open field he did not recognize. No, he knew this field. He knew it! This was Merrilor, only without the blood, without the grass churned to mud, without the land blasted and broken.\n Here he found a tiny falcon—as small as his hand—crying softly, with a broken leg pinned beneath a rock. Its heartbeat was faint.\n Perrin roared as he woke, clawing his way out of the wolf dream. He stood up on the field of bodies, shouting into the night sky. Searchers nearby scattered in fear.\n Where? In the darkness, could he find the same place? He ran, stumbling over corpses, through pits made by channelers or dragons. He stopped, looking one way, then another. Where. Where!\n Flowery soap. A hint of perfume in the air. Perrin dashed toward it, throwing his weight against the corpse of an enormous Trolloc, lying almost chest-high atop other bodies. Beneath it, he found the carcass of a horse. Unable to truly consider what he was doing, or of the strength it should have required, Perrin pulled the horse aside.\n Beneath, Faile lay bloodied in a small hollow in the ground, breathing shallowly. Perrin cried out and dropped to his knees, cradling her in his arms, breathing in her scent.\n It took him only two heartbeats to shift into the wolf dream, carry Faile to Nynaeve far to the north and shift out. Seconds later, he felt her being Healed in his arms, unwilling to let go of her even for that.\n Faile, his falcon, trembled and stirred. Then she opened her eyes and smiled at him.\n The other heroes were gone. Birgitte remained as evening approached. Nearby, soldiers prepared Rand al’Thor’s pyre.\n Birgitte could not stay much longer, but for now . . . yes, she could stay. A short time. The Pattern would allow it.\n \"Elayne?\" Birgitte said. \"Do you know something? About the Dragon?\" Elayne shrugged in the waning light. The two stood at the back of the crowd gathering to watch the Dragon Reborn’s pyre be lit.\n \"I know what you’re planning\", Birgitte said to Elayne. \"With the Horn.\n And what am I planning?\"\n \"To keep it\", Birgitte said, \"and the boy. To have it as an Andoran treasure, perhaps a nation’s weapon\".\n \"Perhaps\".\n Birgitte smiled. \"It’s a good thing I sent him away, then\".\n Elayne turned to her, ignoring those preparing Rand’s pyre. \"What?\"\n \"I sent Olver away\", Birgitte said. \"With guards I trust. I told Olver to find someplace nobody would look, a place he could forget, and toss the Horn into it. Preferably the ocean\".\n Elayne exhaled softly, then turned back toward the pyre. \"Insufferable woman\". She hesitated. \"Thank you for saving me from having to make that decision\".\n \"I thought you’d feel that way\". Actually, Birgitte had assumed it would take a long time before Elayne understood. But Elayne had grown in the last few weeks. \"Anyway, I must be far from insufferable, since you’ve done an excellent job of suffering me these last months\".\n Elayne turned to her again. \"That sounds like a farewell\".\n Birgitte smiled. She could feel it, sometimes, when it was coming. \"It is\". Elayne looked sorrowful. \"Must it be?\"\n \"I’m being reborn, Elayne\", Birgitte whispered. \"Now. Somewhere, a woman is preparing to give birth, and I will go to that body. It’s happening. \"I don’t want to lose you\".\n Birgitte chuckled. \"Well, perhaps we will meet again. For now, be happy for me, Elayne. This means the cycle continues. I get to be with him again. Gaidai . . . I’ll be only a few years younger than he\".\n Elayne took her arm, eyes watering. \"Love and peace, Birgitte. Thank you\".\n Birgitte smiled, then closed her eyes, and let herself drift away.\n As evening settled onto the land, Tam looked up across what had once been the most feared place of all. Shayol Ghul. The last flickers of light showed plants growing here, flowers blooming, grass growing up around fallen weapons and over corpses.\n Is this your gift to us, son? he wondered. A final one?\n Tam lit his torch from the small, flickering flame that crackled in the pit nearby. He went forward, passing lines of those who stood in the night. They had not told many of Rand\u0027s funeral rites. All would have wanted to come. Perhaps all deserved to come. The Aes Sedai were planning an elaborate memorial for Egwene; Tam preferred a quiet affair for his son.\n Rand could finally rest.\n He walked past people standing with heads bowed. None carried light save Tam. The others waited in the dark, a small crowd of perhaps two hundred encircling the bier. Tams torch flickered orange off solemn faces.\n In the evening, even with his light, it was hard to tell Aiel from Aes Sedai, Two Rivers man from Tairen king. All were shapes in the night, saluting the b \n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-308.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: \n A Memory of Light (The Wheel of Time #14) \n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \n In Andor, the Trollocs seize Caemlyn. \n In the wolf dream, Perrin Aybara battles Slayer. \n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\n \n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
