{"id":91998,"no":64,"title":"Page 64","content":"\"Very well\", Elayne said. \"We will consider other options. Though, it occurs to me that we should send to the Black Tower for their Asha’man also. How many are there?\"\\n\\n Perrin cleared his throat. \"I think you might want to be careful about that place, Your Majesty. Something’s going on there\".\\n\\n Elayne frowned. \" ‘Something’?\"\\n\\n \"I don’t know\", Perrin said. \"I spoke to Rand about it, and he was worried, and said he was going to investigate. Anyway . . . just be careful\".\\n\\n \"I’m always careful\", Elayne said absently. \"So how do we get those Trollocs out of Caemlyn?\"\\n\\n \"Perhaps we can hide a large assault force in Braem Wood; it’s here, almost fifty leagues north of Caemlyn\". Bryne pointed at the map. \"If a smaller company of soldiers were to go up to the city gates and get the Trollocs to chase them back to the Wood as bait in the trap . . . I always worried that an invading army would use the Wood for cover as a base for attacking the city. I never thought I’d be considering the same option myself\".\\n\\n \"Interesting\", Agelmar said, studying a map of the terrain around Caemlyn. \"That seems like a solid prospect\".\\n\\n \"But what of Kandor?\" Bashere asked. \"The Prince is right that the country is beyond rescue, but we cannot simply let the Trollocs pour out into other lands\".\\n\\n Ituralde scratched at his chin. \"This entire matter is going to be difficult. Three Trolloc armies, with us forced to divide our attention between them. Yes, more and more, I realize that the right move is to focus on one of them and set delaying forces against the other two\".\\n\\n \"The Shadow’s army at Caemlyn is likely the smallest\", Agelmar said, \"as the size of the Waygate has restricted their entry into the city\".\\n\\n \"Yes\", Bashere agreed. \"Our chance for a quick victory on one of the battlefronts is best at Caemlyn. We should strike hard there with the largest of our assault forces. If we can win in Andor, it will reduce the number of fronts we have to fight on—and that will be extremely advantageous\".\\n\\n \"Yes\", Elayne said. \"We reinforce Lan, but tell him that his job will be to hold there as long as he can. We place a second force at the border of Kandor, with the purpose of delaying there as well—perhaps a slow withdrawal, as conditions dictate. While those two fronts are held, we can focus our true attention—and our largest army—at breaking the Trollocs in Caemlyn\".\\n\\n \"Good\", Agelmar said. \"I like it. But what force do we place in Kandor? What army can slow the Trollocs, but won’t require a large commitment of troops?\"\\n\\n \"The White Tower?\" Elayne asked. \"If we send the Aes Sedai to Kandor, they can slow the Trollocs’ advance across the border. That will let the rest of us concentrate on Caemlyn\".\\n\\n \"Yes\", Bryne said. \"I like it\".\\n\\n \"And what of the fourth battlefront?\" Ituralde asked. \"Shayol Ghul? Does anyone know what the Lord Dragon plans there?\"\\n\\n Nobody spoke.\\n\\n \"The Aiel will see to his needs\", Amys said from beside the clan chiefs. \"You needn’t worry about us. Make your battle plans, and we will make ours\".\\n\\n \"No\", Elayne said.\\n\\n \"Elayne?\" Aviendha said. \"We—\"\\n\\n \"This is precisely what Rand wished to avoid\", Elayne said forcefully. \"The Aiel will work with the rest of us. The battle at Shayol Ghul could be the most important of all. I won’t have one group presuming to keep to themselves and fight alone. You’ll accept our help\".\\n\\n And, she added to herself, our direction. The Aiel were excellent warriors, but there were some things they just wouldn’t admit. The usefulness of cavalry, for one.\\n\\n The Aiel obviously did not like the prospect of wetlander command. They bristled, eyes narrowing.\\n\\n \"The Aiel are excellent irregulars\", Bryne said, looking to them. \"I faced you on the Blood Snow, and I know how deadly you can be. However, if the Lord Dragon attacks Shayol Ghul, we will likely need to seize the valley and then hold it for as long as it takes him to battle with the Dark One. I don’t know how long that will take, but it could take hours. Days. Tell me, have you ever had to entrench and fight a protracted, defensive war?\"\\n\\n \"We will do what needs to be done\", Rhuarc said.\\n\\n \"Rhuarc\", Elayne said. \"You yourselves insisted on signing the Dragon’s Peace. You yourselves insisted that you be part of our coalition. I expect you to live up to your word. You will do as you are told\".\\n\\n Bryne’s and Ituralde’s questions had set them off, but being told directly what to do made them back down. Rhuarc nodded. \"Of course\", he said. \"I have toh\".\\n\\n \"Meet it by listening\", Elayne said, \"and offering your opinion. If we’re going to fight on four different fronts at once, we’ll need a lot of coordination\". She looked at the gathered generals. \"It occurs to me. We have four battlefronts, and four great captains . . \".\\n\\n Bashere nodded. \"No coincidence, that\".\\n\\n \"Well, it might be one\".\\n\\n \"There are no coincidences, Highness\", Bashere said. \"If I’ve learned one thing traveling with the Lord Dragon, that is it. Four of us, four battlefronts.\\n\\n \"We each take one, with Queen Elayne coordinating among us and overseeing the war effort as a whole\".\\n\\n \"I will go to the Malkieri\", Agelmar said. \"Most of the Borderlanders fight there now\".\\n\\n \"What of Kandor?\" Elayne said.\\n\\n \"If the Aes Sedai are to fight there\", Bryne said, \"so will I. My place is with the White Tower\".\\n\\n He doesn’t want to fight in Andor, Elayne thought. He doesn\u0027t want to fight alongside me. He wishes the break to be clean. \"Who comes to Andor with me, then?\"\\n\\n \"I’ll go\", Bashere said.\\n\\n \"And I to Shayol Ghul, then\", Ituralde said, nodding. \"To fight alongside Aiel. A day I never thought I’d see, in truth\".\\n\\n \"Good\", Elayne said, pulling over a chair. \"Then let’s dig into the thick of it and get to details. We need a central location for me to work from, and Caemlyn is lost. For now, I will use Merrilor. It is central, and has plenty of room to move troops and supplies around in. Perrin, do you think you could take charge of the logistics of this camp? Set up a Traveling ground, and organize the channelers to help with communications and \\n\\n","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-64.html","bookId":1601,"book":{"id":1601,"title":"A Memory of Light (The Wheel of Time #14)","description":"Storyline: A Memory of Light (The Wheel of Time #14) \\n “And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died.” From Charal Drianaan te Calamon, The Cycle of the Dragon. \\n In the Field of Merrilor the rulers of the nations gather to join behind Rand al’Thor, or to stop him from his plan to break the seals on the Dark One’s prison—which may be a sign of his madness, or the last hope of humankind. Egwene, the Amyrlin Seat, leans toward the former. \\n In Andor, the Trollocs seize Caemlyn. \\n In the wolf dream, Perrin Aybara battles Slayer. \\n Approaching Ebou Dar, Mat Cauthon plans to visit his wife Tuon, now Fortuona, Empress of the Seanchan. \\n All humanity is in peril—and the outcome will be decided in Shayol Ghul itself. The Wheel is turning, and the Age is coming to its end. The Last Battle will determine the fate of the world...\\n","cover":"https://allnovel.net/images/a-memory-of-light-the-wheel-of-time-14.jpg","author":"Robert Jordan","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:46:26 PM"}}
