{"id":22218,"no":12,"title":"CHAPTER XII","content":"Next morning Lallie went into the town between twelve and one. She had a real and legitimate errand, inasmuch as she needed more silk for the waistcoat she was working for Tony. Since Mrs. Wentworth\u0027s remonstrance she had never once walked down the promenade alone between twelve and one, and to-day she felt particularly virtuous and light-hearted. She would go straight to the shop, match the silk, and come home at once. \"I\u0027ll walk up and down with nobody,\" she said to herself, \"not even if the band\u0027s playing \u0027Carmen.\u0027\" As it happened, the band was playing selections from \"The Merry Widow\" when she reached the shops, and she was not tempted to break her good resolutions, for she met no friends at all until she had bought her silks. \"I\u0027ll go just to the bottom of the promenade and walk up again,\" she thought, \"it\u0027s such a cheerful morning.\" It was. The sun shone as it sometimes will shine at the beginning of the gloomiest month. The air was soft and humid, and though the roads were shocking the wide pavement of Hamchester promenade was clean. Lallie looked down anxiously at her shapely strong brown boots. No, they had not suffered; they were smart and trim, and did no shame to the well-hung short skirt above them. She squared her shoulders, held her head very high, and strolled along serene in the assurance that in all essentials she presented a creditable appearance. So evidently thought a young man coming up the promenade towards her. He was a man of middle height, slight and fair, and wearing pince-nez; clean-shaven, with full prominent blue eyes, a large head, pinkish complexion, and an amiable, if weak, mouth. Admiring friends told him that he greatly resembled the poet Shelley, and he prided himself upon the likeness while in no way dressing to the part. He had an extremely long neck, which rather emphasised the fact that his shoulders were narrow and sloping. He wore a stock and was generally sporting in his attire, and his face and figure seemed curiously at variance with his clothes. In academic cap and gown his personality would have been congruous and even dignified, but clad as he was in a well-made tweed suit with riding-coat, and wearing upon his head a straight brimmed bowler, in spite of the fact that there was nothing exaggerated or outré in his garments he yet made upon the beholder a curious impression of artificiality, and seeing him for the first time one\u0027s first thought was, \"Why does he dress like that?\" Immediately he caught sight of Lallie he hurried forward with outstretched hand and joy writ large upon his countenance. \"You, Miss Clonmell! What unspeakably good luck! I have been hoping to meet you for the last three days, and never caught a glimpse of you.\" \"How do you do, Mr. Ballinger?\" Lallie said demurely, \"and what brings you to these parts? Are you over for the day, or what?\" \"I\u0027ve come here for a bit. I\u0027m going to hunt here for a month or two--all the season if I like it. I suppose you\u0027re coming out to-morrow?\" \"Why aren\u0027t you hunting in your own country?\" Lallie asked him reproachfully. \"What has Fareham done that you should desert it? Do you suppose the hunting here is better?\" \"I believe it\u0027s quite decent here, really; and I know a good many people, and I thought I\u0027d like a bit of a change--and there are other reasons. Of course you\u0027re coming out with us to-morrow?\" Lallie shook her head. \"No, I\u0027m not hunting--yet.\" \"Not hunting, Miss Clonmell! What on earth is the matter? Have you lost your nerve?\" \"No,\" snapped Lallie, \"but I\u0027ve lost my horse. Dad\u0027s in India, as you know; the horses are in Ireland; and I\u0027m staying with friends who don\u0027t hunt and won\u0027t let me hunt without them.\" \"Oh, but that\u0027s nonsense! Were you going this way--may I walk with you? I\u0027ve got a little mare here that would carry you perfectly if you would honour me by riding her to-morrow. She has been ridden by a lady, and I believe she has excellent manners and is a good jumper. I\u0027m putting up at the Harrow, the stables are so good. They\u0027re just at the back here. Won\u0027t you come round and look at the horses and see the little mare? It\u0027s not three minutes\u0027 walk.\" Mr. Ballinger talked fast and eagerly, in short, jerky sentences, as though he were nervous. \"I\u0027d love to see the horses,\" said Lallie, turning with him into the lane where the stables were, quite forgetful of her good resolutions to \"walk with nobody.\" \"And if you like the look of the mare you\u0027ll come out to-morrow?\" \"Ah, that\u0027s quite another matter. I don\u0027t think I can do that. Tony wouldn\u0027t like it.\" \"Why wouldn\u0027t Tony, whoever he is, like it?\" \"Because he can\u0027t come with me.\" \"And why not?\" \"Because he\u0027s shut up in school.\" \"Now really, Miss Clonmell, that is going too far. I know how you always spoil any boys you come across, but that you should give up a day\u0027s hunting because some wretched little schoolboy doesn\u0027t like you to go without him is absurd. Even you must see how ridiculous it is, and how bad for him. Let him attend to his work and mind his own business.\" Mr. Ballinger spoke with considerable heat, and Lallie burst into delighted laughter, exclaiming: \"But he\u0027s not a little schoolboy that anybody could ignore, I assure you. Besides, I\u0027m devoted to him.\" \"I have no doubt of it, but he wants putting in his place. Here are the stables.\" Once among the horses, Lallie forgot everything except her delight in them; but not even the charms of Kitty, the mare, could make her promise to ride her the next day. So persistent was Mr. Ballinger, however, that to get rid of him she said she would send him a note that night should she happen to change her mind. He escorted her back to the very gate of B. House, and of course she met almost every one she knew in Hamchester while in his company. She dismissed him at the gate, nor did she ask him in to lunch as she assuredly would have done had it been her father\u0027s house. She stood for a minute watching his somewhat slow and disappointed departure, gazing earnestly at his retreating back. Then she shook her head decidedly and went into the house. Up the back stairs did she go in her honest desire to conciliate Miss Foster. One window on that staircase looks out on to the playground, and as she passed she caught sight of Cripps standing with two other prefects. The window was open and she looked out. All three boys looked up and capped her. \"The dears!\" said Lallie to herself, and kissed her hand to them gaily as she passed. At that very moment Miss Foster, followed by Mr. Johns, came through the swing-door at the top of the stairs. Miss Foster stopped short some four steps above Lallie, and of course Mr. Johns had to stop too, for he couldn\u0027t push past her, and to turn back would have looked odd. \"Miss Clonmell,\" said Miss Foster, in tones that could be heard to the farthest corner of the playground, \"I really must protest against your corrupting the boys of this house by vulgar flirtation of that kind.\" Lallie stood still in her turn, absolutely petrified by indignant astonishment. Cripps crimsoned to the roots of his hair, caught each of his friends by the arm and hurried them indoors. \"How dare you speak to me like that?\" Lallie gasped out; \"and before the boys too? How dare you insult me so?\" \"I shall continue to do what I consider my duty whether it be agreeable to you or not, Miss Clonmell, and I tell you again that I will not have these vulgar flirtations.\" \"It is you who put a vulgar interpretation on the simplest actions,\" Lallie exclaimed furiously, and with that she turned and ran down the stairs again and across the hall and out at the front door before Miss Foster fully realised that she was gone. At Miss Foster\u0027s first words poor Mr. Johns had turned and fled upstairs again, through the swing door, and out to the landing from which he could look down into the hall, and he saw Lallie\u0027s swift and furious exit. Down the sacred front stairs he dashed and out into the drive after her, catching her just as she turned into the road. As he joined her she lifted to him her white miserable face with tragic eyes all dark with grief and anger. \"I must walk and walk,\" she said breathlessly. \"I am so angry; if I had stayed another minute I should have done that woman an injury. You heard what she said?\" \"I quite understand,\" Mr. Johns said soothingly. \"I hope you\u0027ll allow me to come with you. I won\u0027t talk.\" \"It\u0027s very nice of you, but really I\u0027d be better alone.\" \"I think not,\" Mr. Johns said gently; \"I hope you won\u0027t forbid me to come.\" He looked so big, and kind, and honest, and withal so hopelessly uncomfortable, that Lallie\u0027s face softened and laughter crept back into her eyes. \"It\u0027s really very nice of you to want to come when I\u0027m in such a bad temper. Let\u0027s go this way, where there\u0027s no people, and perhaps presently I\u0027ll feel better and we\u0027ll talk.\" For nearly ten minutes Lallie pounded along in dead silence as fast as she could go. Then she began to notice that the pace which was rapidly reducing her to a state of breathless collapse had no sort of effect upon her companion, who, hands in his pockets, appeared to be strolling along in an easy sort of saunter at her side. \"This is ignominious,\" she exclaimed; \"here am I walking as if for a wager, and you don\u0027t seem hurrying one bit.\" \"Am I walking too fast for you?\" Mr. Johns asked, in poignant self reproach. \"I am so sorry; you see, I don\u0027t often walk with ladies.\" \"It isn\u0027t you at all, it\u0027s me; I\u0027m walking too fast for myself, and it\u0027s so aggravating to see somebody alongside perfectly cool and composed. If I could leave you behind, or you had to trot to keep up with me, it wouldn\u0027t be half so trying. As it is I give in. For mercy\u0027s sake let\u0027s sit on this seat for a minute. You may talk to me now. I no longer feel like tearing the hair off Miss Foster. Tell me now, what was it I did to draw such an avalanche of abuse upon me?\" Side by side they sat down upon one of the hard green seats that are placed at convenient intervals in every road leading out of Hamchester. Lallie\u0027s cheeks were quite rosy after her rapid walk. Her grey eyes were clear and limpid again, candid and inquiring as a child\u0027s. Mr. Johns gazing into them felt compelled to speak the truth. \"I think,\" he said slowly, \"it was because you kissed your hand to Cripps.\" \"It wasn\u0027t only to Mr. Cripps, it was to Mr. Berry and Mr. Hamilton as well.\" \"Perhaps she thought you did it to attract their attention.\" \"And what if I did? Would she expect me to pass three nice boys living in the same house with me--though it\u0027s little enough I see of them--with my nose in the air and never a word of greeting; and if I hadn\u0027t gone up by her nasty old back stairs just to please her, this would never have happened.\" \"After all,\" said Mr. Johns, still gazing at Lallie, although she no longer looked at him, \"does it matter much what Miss Foster thinks?\" \"It doesn\u0027t matter to me what she thinks, but what she says does matter. I can\u0027t let her insult me in public and take no notice.\" \"She often,\" Mr. Johns remarked ruefully, \"insults me in public, and I take no notice.\" \"Well, it\u0027s very noble of you, but I can\u0027t reach those heights. To be told I\u0027m a vulgar flirt and corrupt--corrupt, mind you--the boys, is more than I\u0027ll endure from any stout old woman on this earth. Do you think I\u0027d corrupt any boys, Mr. Johns?\" \"I\u0027m quite sure you would always use your great influence in the highest possible way,\" Mr. Johns said solemnly, \"but----\" \"But what?\" Lallie demanded impatiently as he hesitated. \"You might mislead a boy by--ah--for instance, kissing your hand to him.\" \"How mislead?\" \"It\u0027s very difficult to put it in such a fashion as not to sound exaggerated and absurd; but you might, you know, make a boy think you were fond of him.\" \"So I am very fond of them; they\u0027re dears, and I\u0027m perfectly ready to leave my character in their hands. They wouldn\u0027t misjudge me and think horrid things.\" \"I don\u0027t think they would misjudge you, Miss Clonmell, but they might mistake your intention.\" \"My intention was perfectly plain--to give them a friendly greeting as I passed. I\u0027ve always kissed my hand to people ever since I was a wee little girl--Madame taught me to do it--and if that\u0027s corrupting them, the sooner I leave B. House the better. I can\u0027t turn into Diogenes in his tub at a moment\u0027s notice. If I mayn\u0027t smile and wave to the people I know, I\u0027d best go where there\u0027s a more friendly spirit. And so I\u0027ll tell Tony, only it will bother the poor dear so. Do you think Miss Foster will go and harangue Tony, Mr. Johns?\" \"I fear it is only too likely.\" \"Well, she\u0027ll get a pretty dressing down when she does,\" and Lallie gave a sigh of deepest satisfaction. \"Tony understands me, however dense other people may be.\" \"Don\u0027t misunderstand me, Miss Clonmell, I beg; I only tried to lay before you a possible point of view--it may be a wholly erroneous one. But you know people of great charm have also great responsibilities, and it seems to me that sometimes--sometimes you are apt to forget how your graciousness may raise false hopes.\" \"Hopes of what? In the name of common sense what is the man talking about?\" Lallie cried despairingly. \"Do you mean that if I kiss my hand to a boy he will promptly hope I\u0027ll kiss him in a day or two?\" \"That\u0027s precisely what I do mean, only I shouldn\u0027t have dared to say so,\" Mr. Johns replied emphatically. \"Oh, the boys have got far more sense than you give them credit for. Good gracious, what\u0027s that bell?\" Mr. Johns hastily dragged his watch from his pocket. \"Do you know it\u0027s a quarter past two and I\u0027m due to play for the town on their ground at three.\" \"And luncheon will all be gone, and I\u0027m so hungry,\" Lallie wailed. \"You see it was nearly half-past one when I came in, and then Miss Foster was so disagreeable and drove us both out of the house, and we walked and walked; and now what\u0027ll we do?\" \"I, at any rate, must fly and change. If I take a pony trap down to the ground I\u0027ll just do it.\" \"And you\u0027ve had no lunch! Oh, I am so distressed!\" \"That doesn\u0027t matter in the least, I\u0027ll snatch a biscuit and a bit of chocolate. When I\u0027m in training I often do without lunch.\" \"Run then, Mr. Johns; never mind me. If you sprint a bit you\u0027ll be at B. House in five minutes.\" \"Will you not think me very rude?\" \"Don\u0027t waste time talking--run!\" Mr. Johns ran, and Lallie followed very slowly, wrapped in thought.","sourceLink":"http://novel.tingroom.com/jingdian/1778/51824.html","bookId":1107,"book":{"id":1107,"title":"Master and Maid","description":"简介： On the second Friday of term Anthony Bevan, whom all his world called Bruiser Bevan, Housemaster of B. House in Hamchester College, sat at dessert with three of his prefects. They had exhaustively discussed the prospects of the coming football season...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1778","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
