{"id":89328,"no":24,"title":"Page 24","content":"“Where is George?” Avery asked. “He got hisself attacked by an old brown bear. He didn’t know she was there until he saw one of her cubs,” Kenny said. “Can I turn around now and put my hands down? You can see I’m cooperatin’ and you got hold of my gun.” “Yeah, sure,” John Paul said. Avery was heading for the phone when, out of the corner of her eye, she saw a lady’s billfold sticking out between two sales slips in the trash can next to the cash register. She leaned down to pick it up. Then she caught her breath. It was a new, black Prada billfold. Carrie owned everything Prada made. Kenny was watching John Paul. “If you’re gonna rob me, you might as well know I don’t have much cash. Maybe two one-hundred-dollar bills and forty some in change.” “Where’d you get the hundred-dollar bills?” John Paul asked. “A customer.” “We didn’t come here to rob you,” Avery said. She opened the billfold, saw that it was empty, and held it up for John Paul to see. “I think this belongs to my aunt.” Kenny grabbed her from behind. He wrapped his big arms around her in a bear hug and lifted her up so he could use her as a shield. His arms were like bands of steel, but his chest was soft, almost mushy. “Let go of me,” she ordered. “I don’t have time for this.” Kenny was trying to duck down behind her so John Paul couldn’t get a clear shot. “Not till your mister puts that gun down.” John Paul was surprised Avery wasn’t frightened. If anything, he thought she looked put out. “That’s not gonna happen,” he said. “Avery, you’ll have to change your clothes.” That remark got her full attention. She stopped squirming and asked, “Why?” “Because I’m gonna get blood all over you when I blow this mother—” “No,” she said. “Kenny, I know this billfold belongs to my aunt, and I don’t care that you took the money. But you’re going to have to tell me where you got it. Now let go of me.” “No way,” he snarled close to her ear and tightened his hold. His fingers were interlocked around her waist. She took hold of one of his little fingers and jerked it back hard. At the same instant, she lowered her chin, then slammed the back of her head into his face. She heard a crunch as he gasped in pain and let go. “Ouch,” she whispered. Damn it, that hurt. She stepped away from Kenny and rubbed the back of her head as she walked over to John Paul. Not as simple as it looked in the movies, she thought. Lesson learned. She noticed the incredulous look on John Paul’s face. “What?” she asked. His smile was slow and easy. “Not bad.” She rolled her eyes in exasperation and looked at Kenny, who was leaning into the counter. “I need to know where you got that billfold.” “It belonged to my wife, Chrystal. She got tired of it and tossed it in the trash.” “Stop lying. This is a matter of life or death,” she said, her voice hostile now. “I really don’t care if you took any money out of the billfold,” she repeated. “But I need to know where you got it.” “I just told you . . .” He wasn’t going to admit anthing. Avery’s initial panic had dissipated as soon as she’d spotted the billfold because now she knew she was in the right place. The tightness was still in her chest, however, and she was becoming infuriated over the man’s uncooperative attitude. Kenny’s nose was bleeding. He held a Kleenex against his nostril and squinted at her. “I’m gonna sue you, bitch. That’s what I’m gonna do.” “John Paul, I think you’re going to have to shoot him after all,” she said. Kenny didn’t seem worried until John Paul asked Avery, “How about the kneecap?” Fortunately, Kenny had become a true believer. “Okay, okay,” he said. “When we opened up this morning, me and Chrystal found a package with her name on it.” He pointed to Avery. “It was just sittin’ there on the counter, so Chrystal decided to have a look inside.” “And?” Avery prodded. “And it was just a red scarf. It had a perfume smell to it Chrystal didn’t care for, so she stuffed it back in the envelope and tossed it in the trash.” “How did you get the billfold?” she asked. “I was gettin’ to that,” he said, resentment brimming in his words. “A woman came in just a little bit ago. She held up a brand-new hundred-dollar bill in exchange for that package with the scarf, and we took it, of course. Then she grabbed another manila envelope from our shelf. Just helped herself to it. She turned around so we wouldn’t see what she was doin’ and put that billfold inside. After she sealed it, she wrote your name on it and told us she’d give us another hundred if we’d promise to tell you that she was gonna call and for you to stay here until she did.” “But you opened the envelope as soon as she left?” John Paul asked. “No, not that second. It nagged at Chrystal, though. She just had to have herself a peek inside, and when she saw the billfold filled with money, she helped herself. Anybody would’ve done the same thing.” Avery didn’t waste time arguing ethics with him. “What exactly did the woman with the hundred-dollar bills say?” “I already told you what she said.” “Tell her again,” John Paul ordered. “She’s gonna call you. That’s what she said. She told me she knew just about the time you folks would be coming into the store and said you was supposed to wait until she called.” “But you weren’t going to tell us any of that, were you?” John Paul said. “You were going to send us on our way and never mention the billfold or the woman.” Kenny didn’t answer. He shrugged and then said, “There wasn’t much money in the wallet. Just a bunch of twenty-dollar bills.” “Hardly worth getting your nose broken?” John Paul said. “Look, I should have told you, and now I’m sorry I didn’t,” Kenny said. “When my wife gets off the phone, I’m sure that lady will call. You’re just gonna have to wait.” “Where is your wife?” Avery asked. John Paul answered. “In the back office.” He grabbed her arm when she started in that direction. “Do you know how to use a gun?” She pulled away from him and hurried to the back of the store. “I’m not going to shoot anyone, John Paul.” “Be careful,” he ordered. She took the warning to heart. When she reached the swinging door, she slowly pushed it open and looked inside. A woman was sitting with her back to the door. She was bent over with the receiver to her ear as Avery quietly walked forward. She heard the woman say, “No, I want five of them. That’s right. Five. Now the last item is number A3491. The silver stereo with all them CD holders. I want eight of them. No, make it ten. That’s it, hon. Are you ready for my credit card number? What? Oh, my name’s Salvetti. Carolyn Salvetti. I’ll be using my American Express card to pay for all this merchandise, but I want them shipped to my Arkansas home.” Avery was furious. She came up behind the woman and snatched the phone from her hand. Chrystal lurched out of her chair, sending it crashing into the wall. “Who do you . . .” she sputtered. Keeping her eye on Chrystal, Avery spoke into the phone. “Cancel the order. She’s using a stolen credit card.” “No,” Chrystal shouted as Avery hung up the phone. “You got no right to come barging in here. No right at all. This is my private office. Now give me that phone back.” “You and Kenny are going to jail.” “Hold on there a minute. We didn’t do nothin’ wrong.” Chrystal’s eyes were set a little too close together and her moon-shaped face was twisted in anger. Not pretty, Avery thought as she watched her step forward threateningly. Her brown eyes darted back and forth like a cornered rat’s as she considered her options. “There’s no reason to call the police.” The woman towered over Avery and outweighed her by a good sixty pounds. When a sudden gleam came into her eyes, Avery knew what she was thinking, that her size gave her the advantage. “Don’t even think about it,” Avery said. “This is private property,” Chrystal half shouted. And then she lunged. Avery didn’t need to defend herself. She simply stepped to the left and watched as the large woman fell on top of the desk. Her precious catalog ripped open and flew to the floor. What a klutz. “Behave yourself,” Avery scolded like a teacher disciplining a child with a harsh warning. “Now get up and go into the store. Move it,” she shouted when Chrystal didn’t move. Carrie’s driver’s license and all of her credit cards were on the desk, except the American Express card. She saw Chrystal slip the card into her pocket. “You just don’t give up, do you? Give me the damn card.” Chrystal threw it at her. Avery caught it in midair and then nodded toward the swinging door again. Chrystal shoved the door open and hurried ahead. She tried to push the door back in Avery’s face, but Avery used her foot to block it. “Bitch,” Chrystal growled. Then she saw Kenny and took her wrath out on him. “I told you we’d get into trouble, but you wouldn’t listen to me.” John Paul slipped his gun into the back of his jeans and then looked at Avery, waiting for an explanation. She took a step closer to him as she said, “Chrystal was doing a little early Christmas shopping with my aunt’s American Express card.” “Aren’t they a pair?” “Yet another good reason I’m never going to get married,” she said. “I don’t see any need to get the police involved,” Chrystal muttered. “Who said anything about the police, Chrystal?” Kenny demanded. “Why’d you have to go and bring them into this?” “I didn’t, you old goat. Blondie did,” she added, pointing at Avery. “And all this is your fault, Kenny. If anyone’s gonna go back to jail, it’s gonna be you. I already got one strike against me. Didn’t I tell you you shouldn’t let me open that package? Didn’t I?” she screeched like an irate hen. “You made me do it.” “Shut your trap,” Kenny told her. Chrystal finally noticed her husband’s condition. He was sitting on the counter, swinging his legs back and forth while he held a torn Kleenex to his nose. She gave John Paul the once-over too. “Who’s he?” she demanded. “And why are you pickin’ at your nose?” “I ain’t pickin’ nothin’. That gal behind you broke my fuckin’ nose. I’m gonna get me a lawyer and sue her.” “From jail?” Chrystal bellowed. “You moron. You aren’t gonna sue nobody.” John Paul had about had it with the happy couple. He went to the front door and stood to the side looking out. The teenager who had been throwing up was now curled up on the porch sound asleep. “Stop arguing,” Avery demanded. She was a little surprised that Kenny and Chrystal actually obeyed her. “No reason to scream at us, missy. You can see we’re cooperatin’,” Chrystal said. “Fine. You’re cooperating. Where’s the envelope?” “You mean the one the billfold was in?” Chrystal asked. “Yes.” “I threw it in the trash by the facilities,” she said. “There was just the billfold, but I’ll get it for you so you can see for yourself.” She took her sweet time crossing the store and returned a minute later with the yellow envelope. Thrusting it at Avery, she said, “See. It’s empty.” Kenny’s nose had stopped bleeding, and he tossed the Kleenex toward the wastebasket behind him but missed. “I told you everything that gal said to me, but she was pretty chatty with Chrystal.” “That’s right. She sure was chatty. She told me you folks were goin’ on a treasure hunt. Kinda’ old to be playin’ games like that, aren’t ya?” Avery was close to pulling her hair out in frustration. These people were driving her crazy. “When she came in, did you see her car? Was there anyone waiting?” “Had a nice new Mercedes,” Kenny said. “But there wasn’t nobody inside it. Just the gal.” “Did she tell you where she was sending us?” Her obvious anxiety gave Chrystal a surge of power. She said snidely, “Depends.” “Depends on what?” Avery asked. Chrystal rubbed her fingers together, the universal sign for money. Avery didn’t have the patience to negotiate. “The woman left instructions too, but Kenny and me aren’t sayin’ another word until you make it worth our while.” “Okay, John Paul. We’re back to doing it your way. You may shoot one of them. That should get the other one talking.” He liked the way she thought. The gun was out, the safety off less than two seconds later. “Got a preference?” he asked. Chrystal put her hands up. “Hold on there. No need for violence. Kenny and me is peace-lovin’ folks, aren’t we, Kenny? We’ll tell you what you want to know. The woman said a gal would be comin’ in. Said the gal’s name was Avery.” Turning to her, she asked, “You’re her, aren’t ya? You got to be her.” “Yes. What else did she say?” “That she’d be callin’ and that you’d be leavin’ in a hurry, but she was sure wrong about that, wasn’t she? I mean, you’re still here.” Kenny snorted. “They can’t be leavin’ in a hurry until after she calls, you twit.” “Avery, I really want to shoot these people. Put them out of their misery,” John Paul said. She understood how he felt. “Put the gun away, John Paul.” The second he lowered the gun, Chrystal cheered up and managed a smile. “Kenny, they’ll need supplies for where they’re headed. You carry what they want out to their car while I total it up in my head.” Turning to Avery she asked, “You got cash on you, don’t you?” “We don’t need supplies,” she said. “You want directions to where she’s sendin’ you?”","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-24.html","bookId":1833,"book":{"id":1833,"title":"Killjoy (Buchanan-Renard #3)","description":"Storyline: Avery Delaney has always tried to put the past far behind her. Abandoned by her rapacious, conniving mother when she was only three days old, Avery was raised by her grandmother and beloved aunt Carolyn. Then, when she was eleven, she witnessed her grandmother\u0027s violent death, before Avery herself was shot and left for dead. Miraculously she survived. The man responsible is serving time in a Florida prison. This traumatic experience propels Avery into a life of law and order. Her razor-sharp mind and ability to gather data and decipher evidence has made Avery an expert crime analyst for the FBI. But soon she will have to use every one of her adroit skills on a case that hits painfully close to home. Avery\u0027s workaholic aunt, Carolyn Salvetti, is certain her (hopefully soon-to-be ex) husband sent her the gold embossed reservation to the posh Utopia Spa in the mountains of Colorado. At first she is resistant, but then figures it will be a welcome respite from the cutthroat advertising business, not to mention a networking extravaganza. Plus she persuades her niece to join her for the two weeks of luxury and decadence. But Carolyn never makes it to Utopia. Under false pretenses, she is taken to an isolated retreat by a handsome stranger with a dazzling smile, suave demeanor, and the darkest of motives. His name is Monk, a hired assassin. Now, with scant clues and fewer resources, Avery must track down and save Carolyn--and outmaneuver a brilliant killer who is part of an elaborate plot of madness and lethal vengeance.","cover":"https://allnovel.net/images/killjoy-buchanan-renard-3.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/killjoy-buchanan-renard-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:34:01 PM"}}
