{"id":89308,"no":4,"title":"Page 4","content":"“How’d it happen?” Mel asked. He was the only one who hadn’t heard the grisly details. Margo ran her fingers through her short dark curls and said, “An old lady nearly killed her.” “With her Cadillac,” Lou said. “It happened in her parking garage. The woman obviously didn’t see her. There really ought to be an age restriction on renewing a driver’s license.” “Did she hit you?” Mel asked. “No,” Avery answered. “I dove to get out of her way when she came roaring around the corner. I ended up flying across the hood of a Mercedes and whacked my knee on the hood ornament. I recognized the Cadillac. It belongs to Mrs. Speigel, who lives in my building. I think she’s about ninety. She’s not supposed to drive anymore, but every once in a while I’ll see her taking the car out to do errands.” “Did she stop?” Mel asked. She shook her head. “I don’t think she had a clue I was there. She was accelerating so fast I was just glad there weren’t any other people in her way.” “You’re right, Lou,” Margo said. She disappeared behind her cubicle wall, bent down to push the box of copy paper into the corner, and then stood on top of it. She was suddenly as tall as Mel. “There should be an age limit on keeping a license. Avery told us the woman was so little she couldn’t see her head over the back of the seat. Just a puff of gray hair.” “Our bodies shrink as we age,” Mel said. “Just think, Margo. When you’re ninety, no one will be able to see you.” Margo, a petite five feet two inches, wasn’t offended. “I’ll just wear higher heels.” The phone rang, interrupting the conversation. Avery jumped at the sound, then checked the time. It was 10:14. “This is it,” she whispered as it rang a second time. “Answer it,” Margo anxiously demanded. Avery picked up the phone on the third ring. “Avery Delaney.” “Mr. Carter would like to see you in his office at ten-thirty, Miss Delaney.” She recognized the voice. Carter’s secretary had a distinct Maine accent. “I’ll be there.” Three pairs of eyes watched her as she hung up the phone. “Oh, boy,” she whispered. “What?” Margo, the most impatient of the group, demanded. “Carter wants to see me.” “Uh-oh. That can’t be good.” Mel made the remark, and then, as if he realized he’d said something he shouldn’t have, added, “You want us to go with you?” “You’d do that?” Avery asked, surprised by the offer. “I don’t want to, but I would.” “It’s okay. I’ll take the bullet alone.” “I think we should all go,” Margo said. “A mass firing. I mean, we’re all in this together, right?” “Yes,” Avery agreed. “But you three tried to talk me out of going to Andrews. Remember? I’m the only one who screwed up.” She stood, put the icepack on top of the file cabinet, and reached for her jacket. “This can’t be good,” Mel repeated. “They’re breaking the chain of command. It must be really bad to get the boss’s boss involved. Carter was just promoted to head of in-house operations.” “Which means he’s now the boss’s boss’s boss,” Margo pointed out. “I wonder if all the bosses will be there,” Lou said. “Right,” Avery muttered. “Maybe all three of them want to take a turn firing me.” She buttoned her suit jacket and then said, “How do I look?” “Like someone tried to run over you,” Mel said. “Your hose are shredded,” Margo told her. “I know. I thought I had another pair in my drawer, but I didn’t.” “I’ve got an extra pair.” “Thanks, Margo, but you’re a petite, and I’m not. Mel, Lou, turn around or sit down.” As soon as they turned their backs, she reached up under her skirt and pulled off her panty hose. Then she put her heels back on. She was sorry now she’d worn the suit. She usually wore pants and a blouse, but she was going to a luncheon today and so she’d pulled out all the stops and put on the Armani suit her aunt Carrie had sent as a present two years ago. The color was a wonderful taupe gray and had a matching sleeveless V neck shell. At one time there had been an obscene slit up the side, but Avery had sewn it together. It was a great-looking suit. Now it would be remembered as the suit she wore the day she got fired. “Catch,” Margo said as she threw the new package of panty hose at Avery. “These are the one-size-fits-all kind. They’ll work just fine. You have to wear hose. You know the dress code.” Avery read the label. It did say the hose would fit every size. “Thanks,” she said as she sat down again. Her legs were long, and she was afraid of tearing the hose when she pulled them up over her hips, but they seemed to fit. “You’re going to be late,” Mel told her when she stood up again and adjusted her skirt. Why hadn’t she noticed how short it was? The hem barely touched the top of her knees. “I’ve got four minutes left.” After she’d put on some lip gloss and clipped her hair back behind her neck with a barrette, she slipped the heels back on. Only then did she notice how loose the right heel was. She must have broken it when she slammed into the hood of the car. Can’t do anything about it now, she thought. She took a deep breath, straightened her shoulders, and limped toward the aisle. With every step, her left knee throbbed. “Wish me luck.” “Avery,” Mel shouted. He waited until she turned around, then hurled her clip-on ID. “You should probably wear this.” “Yeah, right. They’ll want to take it from me before they escort me out of the building.” Margo called after her. “Hey, Avery, think of it this way—if you get fired, you won’t have to worry about all the work piling up while you and your aunt chill out at that fancy spa.” “I haven’t decided if I’m going to meet my aunt or not. She still thinks I’m chaperoning those kids around D.C.” “But now that that got canceled, you ought to go get pampered,” Margo argued. “That’s right, you should go,” Lou said. “You could stay at Utopia a whole month and work on your résumé.” “Not helping, guys,” Avery said without looking back. Carter’s office was four flights up. On any other day she would have taken the stairs as aerobic exercise, but her left knee ached too much, and the heel on her right shoe was too wobbly. She was exhausted by the time she reached the elevator. While she waited for it, she rehearsed what she would say when Carter asked what in God’s name she thought she was doing. The doors parted. She took a step forward and felt something snap. Glancing down, she spotted the heel of her shoe lodged in the seam between the elevator and the floor. Since she was alone, she hiked her skirt up and bent down on her good knee to pry the heel loose. It was then that the elevator doors closed on her head. Muttering an expletive, Avery fell back. The car began to move and she grabbed the railing. She clutched the broken heel in her hand and pulled herself to her feet just as the doors opened on the first floor. By the time she reached the fourth floor, the elevator was full of passengers, and she was squeezed to the back of the car. Feeling like an idiot, she excused her way to the front and limped off. Unfortunately, Carter’s office was located at the end of a long corridor. The glass doors were so far away she couldn’t even read the name etched above the brass handle. Suck it up, she thought as she started walking. She was halfway there when she stopped to check the time and give her leg a rest. She had one minute. She could make it, she thought as she started walking again. Her barrette slipped out of her hair, but she caught it before it fell to the floor. She clipped it back in place and continued on. She was beginning to wish Mrs. Speigel’s car had actually struck her. Then she wouldn’t have to come up with any excuses, and Carter could call her at the hospital and fire her over the phone. Suck it up, she repeated. Could it get any worse? Of course it could. At precisely the second she was pulling the door open, her panty hose began to slip. By the time she’d limped over to the receptionist, the waistband was down around her hips. The stately brunette woman wearing a knockoff Chanel suit looked a bit startled as she watched Avery approach. “Miss Delaney?” “Yes,” she answered. The woman smiled. “You’re right on time. Mr. Carter will appreciate that. He keeps a tight schedule.” Avery leaned forward as the woman picked up the phone to announce her. “Is there a ladies’ room close by?” “It’s down the hall, past the bank of elevators, on your left.” Avery glanced behind her and considered her options. She could be late for the appointment, try to run like hell down the mile-long hallway and rip off the damn pantyhose, or she could— The receptionist interrupted her frantic thoughts. “Mr. Carter will see you now.” She didn’t move. “You may go inside,” she said. “The thing is . . .” “Yes?” Avery slowly straightened. The panty hose stayed put. Smiling, she said, “I’ll go on in then.” She pivoted and held her smile as she grabbed the edge of the desk, and then tried to walk as though her shoe still had a heel. With any luck, Carter wouldn’t even notice her condition. Who was she kidding? The man was trained to be observant. Tall, distinguished-looking, with a thick head of silver-tipped hair and a square chin, Tom Carter stood when she entered. She hobbled forward. When she reached the chair in front of his desk, she wanted to throw herself into it, but waited for him to give her permission. Carter reached across the desk to shake her hand, and it was then, as she was stretching forward, that her panty hose gave up the fight. The crotch was now down around her knees. In a panic, she grabbed his hand and shook it vigorously. Too late she realized she was clutching the heel of her shoe in her right hand. She hadn’t sweated this much since she took the graduate record exam. “It’s a pleasure to meet you, sir. An honor, really. You wanted to see me? My, it’s warm in here. Would you mind if I removed my jacket?” She was rambling but couldn’t seem to stop. The remark about the temperature had gotten his attention, though. Thank God, the rumors were right. Carter did have his own thermostat and liked to keep his office just below freezing. It was like an Alaskan tomb. Avery was surprised she couldn’t see her breath when she exhaled. That’s when she realized she wasn’t breathing. Calm down, she told herself. Take a deep breath. Carter enthusiastically nodded. He didn’t mention the heel that had dropped on top of a stack of files on his desk. “I thought it was warm, but my assistant keeps telling me it’s cold in here. Let me just turn down the thermostat a notch.” She didn’t wait for him to give her permission to sit. The second he turned his back, she snatched the heel off the files—which she noticed were labeled with her name and the names of the other members of the pen—and then fell into the chair. Her panty hose were in a wad around her knees. She frantically unbuttoned her jacket, removed it, and draped it over her lap. Her arms and shoulders were covered in goose bumps seconds later. Suck it up, she thought. It was going to be okay. Once he sat down behind his desk, she could slowly work the hose down her legs and get rid of them. Carter would never be the wiser. It was a great plan, and it would have worked if Carter had cooperated, but he didn’t return to his chair. He walked over to her side, then leaned back to sit on the edge of his desk. She wasn’t short by Margo’s standards, but she still had to tilt her head back in order to look into his eyes. There seemed to be a twinkle, which she thought was quite odd, unless, of course, he enjoyed firing people. God, maybe that rumor was true too. “I noticed you were limping. How did you hurt your knee?” he asked. He bent down to pick up the barrette that had fallen to the floor. “An accident,” she said, taking the barrette and dropping it in her lap. She could tell from the quizzical look in his eyes she hadn’t given him a satisfactory answer. “An elderly lady . . . quite elderly, as a matter of fact, driving a rather large vehicle, didn’t see me when I was walking toward my car in my parking garage. I had to jump out of the way so she wouldn’t hit me. I ended up on top of a Mercedes, and I think that’s when I broke my heel and bruised my knee.” Then, before he could make a comment about the unfortunate incident, she plunged on. “Actually, I only loosened the heel then. It broke off in the elevator as the doors were closing on my head.” He was staring at her as though she had just turned into a babbling fool. “Sir, it hasn’t been a good morning.” “Then I’d brace myself if I were you,” he said, his voice suddenly grim. “It’s going to get worse.” Her shoulders slumped. Carter finally went behind his desk and sat down. She seized the opportunity. Slipping her hands under her jacket and skirt, she worked the panty hose down her legs. It was awkward but doable, and, other than appearing to be squirming in the hot seat, she managed the feat. While he opened her file and began to read the notes he or someone else had compiled against her, she grabbed the hose and wadded them into a ball. She had her shoes back on by the time he looked up at her again. “I received a call from Mike Andrews,” he began. There it was again, that grim, you’re-gonna-get-your-ass-fired tone of voice. Her stomach felt as though it had just dropped to her ankles. “Yes, sir?” “I believe you know him?” “Yes, sir. Not well,” she hastened to add. “I found his number and called him before I left the office.” “And during that phone call you convinced him to deploy a SWAT team to First National Bank on . . .” He looked down again, searching the file for the location. She rattled off the address, adding, “The branch is near the state line.” He leaned back, crossed his arms, and said, “Tell me what you know about these robberies.” She took a deep breath and tried to relax. She was on safe ground now, in control. Since she had typed all the agents’ reports into the computer and looked at the bank tapes, she’d learned, and pretty much memorized, every little detail.","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-4.html","bookId":1833,"book":{"id":1833,"title":"Killjoy (Buchanan-Renard #3)","description":"Storyline: Avery Delaney has always tried to put the past far behind her. Abandoned by her rapacious, conniving mother when she was only three days old, Avery was raised by her grandmother and beloved aunt Carolyn. Then, when she was eleven, she witnessed her grandmother\u0027s violent death, before Avery herself was shot and left for dead. Miraculously she survived. The man responsible is serving time in a Florida prison. This traumatic experience propels Avery into a life of law and order. Her razor-sharp mind and ability to gather data and decipher evidence has made Avery an expert crime analyst for the FBI. But soon she will have to use every one of her adroit skills on a case that hits painfully close to home. Avery\u0027s workaholic aunt, Carolyn Salvetti, is certain her (hopefully soon-to-be ex) husband sent her the gold embossed reservation to the posh Utopia Spa in the mountains of Colorado. At first she is resistant, but then figures it will be a welcome respite from the cutthroat advertising business, not to mention a networking extravaganza. Plus she persuades her niece to join her for the two weeks of luxury and decadence. But Carolyn never makes it to Utopia. Under false pretenses, she is taken to an isolated retreat by a handsome stranger with a dazzling smile, suave demeanor, and the darkest of motives. His name is Monk, a hired assassin. Now, with scant clues and fewer resources, Avery must track down and save Carolyn--and outmaneuver a brilliant killer who is part of an elaborate plot of madness and lethal vengeance.","cover":"https://allnovel.net/images/killjoy-buchanan-renard-3.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/killjoy-buchanan-renard-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:34:01 PM"}}
