{"id":89347,"no":43,"title":"Page 43","content":"“Jeez, don’t talk like that.” “Is the hearing still scheduled for the sixteenth?” “I think so.” “Are you sure or not?” “I’m sure,” she said. “Don’t get all hostile on me, Avery. They know about Jilly. Your aunt told them. That had to have been a hell of a shock. I’m so sorry—” Avery interrupted. She didn’t want sympathy. “Do they have any idea where Jilly and Monk might be?” “Not a clue.” “What about my aunt? Have they moved her from the hospital yet?” “No, not yet. Don’t worry about her. A gnat couldn’t get into that hospital. Security’s unbelievable.” “I’m not worried,” she said. “Monk can’t be in two places at once.” “What does that mean?” “I’m going to keep him busy. He’s going to have to try and stop me from testifying at Skarrett’s trial.” “What does he care about Skarrett?” “He doesn’t,” she said. “But he’s working for Jilly now, and she wants Skarrett out of prison. I’ll bet, if you check the records at the prison for visitors over the past year, you’ll find that Skarrett had a female visitor listed more than once. I think she’s made some kind of deal with him.” “For the millions in uncut stones that he stole,” Margo said. “I’m sure Skarrett thinks they’ll share the loot and that he’ll live happily ever after with Jilly. But when they have what they want, Jilly will let Monk kill him.” “Avery, you’re in over your head.” “Maybe,” she whispered. “I can’t stop now, though. About the trial . . .” “Yes?” “Find out who the prosecutor is, and make sure I’m on his witness list.” “Okay,” she said. “Can I tell Carter I talked to you?” You’re going to tell him anyway, she thought. Margo was her friend, but Avery knew she would believe she was being helpful by filling Carter in. “Yes, please do.” “Where are you now? He’s going to ask.” “Alabama,” she lied. “I’ve got to go now. Tell Carter I’ll call him.” “Wait,” Margo cried. “What are you going to do?” Avery knew what she wanted to do. She just didn’t know how yet. The conversation with Jilly popped into her head. What had she called her? Oh, yes, how could she forget? “I’m going to be a killjoy.” John Paul trusted her. Otherwise he would have ripped the phone out of her hand and hung it up. He’d sat down on the sofa beside her and impatiently waited for her to finish her conversation. He looked relieved when she told him she’d caught Margo at the doughnut shop. “Clever,” he said with approval. “She’s a creature of habit.” She told him what Margo had said. “I promised I’d call Carter,” she added, “when we get to Florida.” “But not before.” “You better think hard before you agree to go with me, John Paul. It could get . . .” “Bloody?” She nodded. “I’m in,” he said. “For the long haul.” He reached over, cupped the back of her neck with his hand, and drew her toward him. He kissed her possessively and said, “Did you hear me? I’m in it for the long haul. And like it or not, babe, so are you.” “Until we get Monk and Jilly.” He let go of her. “That’s not what I mean, and you know it.” She pulled away and went into the kitchen. She fixed breakfast, cereal and toast, and then, because she was feeling restless, did the dishes while he looked over the map, figuring their route to Sheldon Beach. She was putting the bowls back into the cabinet when he called out to her. “We’ve got company.” She dropped the tea towel and ran into the living room. John Paul was standing by the front window, cautiously looking out. He held his gun at his side, pressed against his leg. He saw the car when it came around the grove of trees and relaxed. “Better get packed,” he said as he flipped the safety back on the gun and tucked it into the back of his jeans. “Our ride’s here.” What ride? “You were expecting someone?” He nodded. He couldn’t see the driver yet because the sun bouncing off the windshield obstructed his view, but the make and model were right. It was a new, gray Honda. “Who is it?” He shrugged. “I told Theo I needed transportation. The police will be looking for my car, and I figured you didn’t want them to hold us until the FBI took you into custody.” “The FBI wouldn’t do that unless they had my permission.” He snorted. She assumed that meant he didn’t agree. “They would not trample all over my rights as a citizen.” “Sure they would,” he said. “And they’d tell you that they were only doing what they felt was best for you.” She wasn’t going to get into a full-blown argument about the Bureau now. Besides, deep down, she was concerned that there was a kernel of truth in what he’d said. She wasn’t willing to risk it. “Theo drove all this way from Louisiana?” she asked. “No,” he answered. “He wanted to come, but I talked him out of it. I reminded him that he’s going to be a father and that he’s a lousy shot. If he gets himself killed, then I’ll have to become the kid’s father figure. Said I’d raise his son or daughter to be just like me.” “And that gave him chills?” “Yep,” he replied. “And like I said, he’s a lousy shot. He’d probably shoot himself getting his gun out of its holster.” “And you don’t want him to get hurt. You better watch it. You’re beginning to sound nice.” He squinted against the sunlight trying to see the driver. “Theo said he knew someone who could keep quiet and help. Who wouldn’t mind breaking some rules. Ah, hell,” he groaned when he finally saw who was behind the wheel. “Not him. That son of a . . .” “Who?” “Theo. My brother-in-law has a sick sense of humor.” “John Paul, what are you talking about?” “Theo sent him,” he snapped, stabbing at the air with his finger. “Who?” she demanded. She was beginning to feel like an owl. “Clayborne. He sent Noah Clayborne.” He spat the name out as though it left a foul taste in his mouth. She was thoroughly confused by his attitude. “But you called Noah from the spa. I heard you on the phone. Why are you angry now?” “Yes, I did call him, but I didn’t think I’d have to see him,” he muttered. He turned to her, gave her a quick once-over from head to toes, and barked, “Put some damn clothes on.” She looked down at herself. Yes, there were clothes. White tennis shoes, navy shorts, white T-shirt. “What’s the matter with what I have on?” “Too much skin showing. Ah, hell, it wouldn’t matter if you were dressed like a nun. He’s still gonna hit on you. Then I’m gonna have to shoot the bastard.” He stomped to the door, all but pulled it off the hinges when he opened it, and went out onto the porch. “Just see if I don’t.” Oh, brother. “He’s bringing us a car.” She called out the reminder. “Stop complaining about him.” “Yeah, you’re right,” he called back. “We’ll make him stay here or take my car. He doesn’t need to go with us.” Avery stepped back to the window. John Paul had made her curious about Theo’s friend. She knew Noah couldn’t possibly be as obnoxious as John Paul had implied. No one could be that awful. The car stopped in front of the house, and Noah Clayborne opened the car door and emerged into the sunlight. Avery felt like whistling. Tall, broad-shouldered, with sandy blond hair, the man was dressed casually in jeans and a gray T-shirt. He wore the old-fashioned shoulder holster and a pair of Ray-Ban sunglasses. John Paul scowled at him, but Clayborne smiled back, as though the joke were on Renard. The man had a dimple and definitely oozed sensuality. She wasn’t interested in him, of course, not in that way. John Paul was sexier—everything about him appealed to her—but Noah, in appearance anyway, could be a close runner-up. Of course, her analysis was strictly clinical. She had never taken the time to notice such things about a man before, or if she had, she hadn’t been able to admit it to herself. Had finally ha**ng s*x again turned her mind into mush? “I’m going to need therapy when this is over,” she whispered. “Big-time therapy.” Straightening her shoulders, she went outside to meet him. He’d reached the steps but stopped when she walked onto the porch. John Paul’s social graces definitely needed work. She waited a couple of seconds for him to introduce her, then realized he wasn’t going to. She would have stepped forward, but John Paul put his arm around her shoulders and jerked her close to him. Noah’s response to the ridiculously possessive action was to widen his grin. He removed his sunglasses and looked directly at her. Blue eyes. The man had intense blue eyes. Bet he breaks a lot of hearts, she thought, as she felt John Paul tighten his hold. Was he married? She hoped not because she could think of at least three friends to fix him up with, providing, of course, he wasn’t just a body without a mind. Margo wouldn’t be bothered by that, but Peyton, her childhood friend, would definitely want a man with a brain. “What the hell are you staring at, Clayborne?” John Paul barked. She put a stop to the pissing contest. She pushed his arm away and walked to the edge of the porch. “Thank you for coming,” she began. Extending her hand, she added, “My name’s Avery Delaney.” Noah came up the stairs and shook her hand. He didn’t let go as he introduced himself and then said, “I gotta know.” “Yes?” He glanced at John Paul and said, “How’d a sweet thing like you get hooked up with him?” “She’s lucky,” John Paul snapped. “Now let go of her.” Noah smiled at Avery and continued to hold on to her hand. He was enjoying himself by deliberately provoking John Paul. He seemed to know what buttons to push to get John Paul riled. Come to think of it, it didn’t take much. “We appreciate your help, don’t we, John Paul?” She had to elbow him to get him to answer. “Yeah, sure.” “Please, come inside. Are you thirsty?” she asked as she led the way into the cabin. “If he’s thirsty, he can get his own damned drink,” John Paul said. “You don’t have to play hostess, Avery.” She whirled around. “Stop being a jerk,” she ordered. “I was being polite, something you know precious little about. Now stop acting like a rooster and get rid of the attitude.” He immediately backed down. “Yeah, all right.” Noah tried not to laugh. John Paul looked a bit sheepish as he said to Noah, “She’s got a temper.” “Uh-huh,” Noah drawled. “Look, it’s not what you—” “Yeah, it is. Never thought you’d fall. Hell, I never thought any woman would want—” “Drop it, Noah.” “Hey, I’m just here to do Theo a favor,” he explained. “Don’t take your frustrations out on me.” The fact was, he liked John Paul, and he respected him. Maybe even admired him a little because he’d had the guts to walk away from a job that usually broke a man. Avery had gone into the kitchen to get a cold soda for Noah. She stopped in the kitchen doorway. The men had returned to the porch, and she couldn’t hear what they were saying. She put the bottle back in the refrigerator and decided to pack her bag. She heard a couple of crude and colorful expletives; then she heard laughter. They’re nuts, she thought as she went into the bedroom and shut the door. The bed looked as though acrobats had practiced their act on it. She quickly stripped the sheets, put on fresh ones, and dropped the soiled linens in the hamper. There wasn’t much to pack. She changed into her khaki pants and searched through her bag for her pink blouse. The clothes the woman at the police station had taken home to launder for her were folded neatly on the side of the duffel bag. It was such a sweet thing to do, washing her clothes. When this was over, she would have so many people to thank for their kindness. She’d have to do something especially nice for the police chief. Letting them use his cabin was above and beyond his duty. She went into the bathroom to collect her toiletries. Glancing in the mirror, she was startled at how tired and pale she looked. She put on a little makeup to cover the dark circles under her eyes, added some blush and tinted pink lip gloss. Then she brushed her hair, gathered up her toothbrush and toothpaste, and put them in her makeup bag. She tossed John Paul’s toothbrush on top. She was ready to go when John Paul walked into the bedroom. He shut the door, leaned against it, and looked at her. After she’d finished zipping her bag, she stood, then nervously brushed her hands against her slacks, as though she were trying to iron any wrinkles out. “Is something wrong?” “I don’t want to leave.” He was looking at the bed when he made the comment. “I don’t either,” she admitted. “Come here.” His voice was low and urgent. She didn’t hesitate. She ran to him, threw her arms around his neck, and kissed him. When at last they drew apart, there were tears in her eyes. She had never felt this kind of desperation before, and it was so wrenching, so heartbreaking she was afraid she would break down and sob. How had she allowed herself to become so vulnerable? Love wasn’t supposed to happen this quickly, was it? Why hadn’t she protected herself? Love sucks, she decided then. All those stupid songs about how wonderful it was. All she felt was pain and fear, fear that something would happen to him. Damn it, she would not love him. “You should go home,” she said. She stepped back, nodded, and then repeated her decision, but this time she was more forceful. “I mean it. I want you to go home.”","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-43.html","bookId":1833,"book":{"id":1833,"title":"Killjoy (Buchanan-Renard #3)","description":"Storyline: Avery Delaney has always tried to put the past far behind her. Abandoned by her rapacious, conniving mother when she was only three days old, Avery was raised by her grandmother and beloved aunt Carolyn. Then, when she was eleven, she witnessed her grandmother\u0027s violent death, before Avery herself was shot and left for dead. Miraculously she survived. The man responsible is serving time in a Florida prison. This traumatic experience propels Avery into a life of law and order. Her razor-sharp mind and ability to gather data and decipher evidence has made Avery an expert crime analyst for the FBI. But soon she will have to use every one of her adroit skills on a case that hits painfully close to home. Avery\u0027s workaholic aunt, Carolyn Salvetti, is certain her (hopefully soon-to-be ex) husband sent her the gold embossed reservation to the posh Utopia Spa in the mountains of Colorado. At first she is resistant, but then figures it will be a welcome respite from the cutthroat advertising business, not to mention a networking extravaganza. Plus she persuades her niece to join her for the two weeks of luxury and decadence. But Carolyn never makes it to Utopia. Under false pretenses, she is taken to an isolated retreat by a handsome stranger with a dazzling smile, suave demeanor, and the darkest of motives. His name is Monk, a hired assassin. Now, with scant clues and fewer resources, Avery must track down and save Carolyn--and outmaneuver a brilliant killer who is part of an elaborate plot of madness and lethal vengeance.","cover":"https://allnovel.net/images/killjoy-buchanan-renard-3.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/killjoy-buchanan-renard-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:34:01 PM"}}
