{"id":94692,"no":22,"title":"Page 22","content":"have business to attend to in Luskan,\" Morik complained. \"So many things I have set in place - connections and deals - and now, because of you and your friends, all of that will be for naught.\"\n \"But you will enjoy the long winter\u0027s night,\" Bellany said with a wicked grin. She curled seductively on the pile of furs.\n \"That is of no ... well, there is that,\" Morik admitted, shaking his head. \"And my protest has nothing to do with you - you do understand that.\"\n \"You talk way too much,\" the woman replied, reaching for the small man.\n \"I ... I mean, no this cannot be! Not now. There is my business - \"\n \"Later.\"\n \"Now!\"\n Bellany grinned, rolled over, and stretched. Morik\u0027s protests had to wait for some time. Later on, though, the rogue from Luskan was right back at it, complaining to Bellany that her little side trip here was going to cost him a king\u0027s treasure and more.\n \"Unavoidable,\" the sorceress explained. \"I had to bring you here, and winter came early.\"\n \"And I am not allowed to leave?\"\n \"Leave at your will,\" Bellany replied. \"It is a long, cold road - do you think you\u0027ll survive all the way back to Luskan?\"\n \"You brought me here, you take me back.\"\n \"Impossible,\" the sorceress said calmly. \"I can not teleport such distances. That spell is beyond me. I could conjure the odd magical portal for short distances perhaps, but not enough to skip our way to Luskan. And I do not like the cold, Morik. Not at all.\"\n \"Then Sheila Kree will have to find a way to take me home,\" Morik declared, pulling his trousers on - or at least trying to. As he brought the pants up over his ankles, Bellany waved her hand and cast a simple spell to bring about a sudden breeze. The gust was strong enough to push the already off-balance Morik backward, causing him to trip and fall.\n He rolled and put his feet under him, rising, stumbling back to his knees, then pulling himself up and turning an indignant stare over the woman.\n \"Very humorous,\" he said grimly, but as soon as he spoke the words, Morik noted the look on Bellany\u0027s face, one that showed little humor.\n \"You will go to Sheila Kree and demand that she take you home?\" the sorceress asked.\n \"And if I do?\"\n \"She will kill you,\" Bellany stated. \"Sheila is not overly fond of you, my friend, and in truth she desires you gone from here as much as you desire to be gone. But she\u0027ll spare no resources to do that, unless it is the short journey for one of her pet ogres to toss your lifeless body into the frigid ocean waters.\n \"No, Morik, understand that you would do well to remain unobtrusive and quietly out of Sheila\u0027s way,\" Bellany went on. \u0027\u0027Bloody Keel will sail in the spring, and likely along the coast. We\u0027ll put you ashore not so far from Luskan, perhaps even in port, if we can be certain Deudermont\u0027s not lying in wait for us there.\"\n \"I will be a pauper by then.\"\n \"Well, if you are still rich, and wish to die that way, then go to Sheila with your demands,\" the sorceress said with a laugh. She rolled over, wrapping herself in the furs, burying even her head to signal Morik that this conversation was at its end.\n The rogue stood there staring at his lover for a long while. He liked Bellany - a lot - and believed that a winter of cuddling beside her wouldn\u0027t be so bad a thing. There were several other women there as well, including a couple of quite attractive ones, like Jule Pepper. Perhaps Morik might find a bit of challenge this season!\n The rogue shook that thought out of his head. He had to be careful with such things, while in such tight and inescapable quarters beside such formidable companions. Woe to him if he angered Bellany by making a play for Jule. He winced as he considered the beating this beautiful sorceress might put on him. Morik had never liked wizards of any type, for they could see through his disguises and stealth and could blast him away before he ever got close to them. To Morik\u0027s way of thinking, wizards simply didn\u0027t fight fair.\n Yes, he had to be careful not to evoke any jealousies.\n Or perhaps that was it, Morik mused, considering Sheila\u0027s obvious disdain. Perhaps the fiery pirate didn\u0027t approve of Bellany\u0027s companion because she was trapped here as well, and with no one to warm her furs.\n A wry smile grew on Morik\u0027s face as he watched the rhythmic breathing of sleeping Bellany.\n \"Ah, Sheila,\" he whispered, and he wondered if he would even want to go home after spending some time with the captain, wondered if he might not find an even greater prosperity right here.\n Chogurugga stalked about her huge room angrily, throwing furniture and any of the smaller ogres and half-ogres who were too slow to get out of her way.\n \"Bathunk!\" the ogress wailed repeatedly. \"Bathunk, where you be?\" The ogress\u0027s prized son had gone out from the home to lead a raiding party, an expedition that was supposed to last only three or four days, but now nearly a tenday had passed, with no word from the young beast.\n \"Snow deep,\" said a composed Bloog from the side of the room, lying back on a huge hammock - a gift from Sheila Kree - his massive legs hanging over, one on either side.\n Chogurugga raced across the room, grabbed the side of the hammock, and dumped Bloog onto the stone floor. \"If me learn that you hurt - \"\n \"Bathunk go out,\" Bloog protested, keeping his calm, though whether that was because he didn\u0027t want to lash out at his beautiful wife or because he didn\u0027t want to laugh at her hysteria, the ogress could not tell. \"Him come back or him not. Bloog not go out.\"\n The logic, simple enough for even Chogurugga to grasp, did not calm the ogress, but turned her away from Bloog at least. She rushed across the room, wailing for Bathunk.\n In truth, her son had been late in returning from raiding parties many times, but this time was different. It wasn\u0027t just the fierce storm that had come up. This time, Chogurugga sensed that something was terribly amiss. Disaster had befallen her beloved Bathunk.\n He wouldn\u0027t be coming home.\n The ogress just knew it.\n Morik grinned widely and pulled a second goblet, another beautiful silver and glass piece, out of the small belt pouch on his right hip, placing it in front of Sheila Kree on the table between them.\n Sheila regarded him with an amused expression and a nod, bidding him to continue.\n Out of the pouch next came a bottle of Feywine - itself much too big to fit in the small pouch, let alone beside a pair of sizeable goblets.\n \"What else ye got in yer magical pouch, Morik the Rogue?\" Sheila asked suspiciously. \"Does Bellany know ye got that magic about ye?\"\n \"Why would it concern her, dear, beautiful Sheila?\" Morik asked, pouring a generous amount of the expensive liquor into Sheila\u0027s cup and a lesser amount into his own. \"I am no threat to anyone here. A friend and no enemy.\"\n Sheila smirked, then brought her goblet up so fast for a big swallow that some wine splashed out the sides of the drinking vessel and across her ruddy face. Hardly caring, the pirate banged the goblet back to the table, then ran an arm across her face.\n \"Would any enemy e\u0027er say different?\" she asked, simply. \"Don\u0027t know o\u0027 many who\u0027d be calling themselfs a foe when they\u0027re caught.\"\n Morik chuckled. \"You do not approve of Bellany bringing me here.\"\n \"Have I ever gived ye a different feeling?\"\n \"Nor do you approve of Bellany\u0027s interest in my companionship,\" Morik dared to say.\n When Sheila winced slightly and shifted in her seat, Morik knew he\u0027d hit a nerve. Bolstered by the thought that Sheila\u0027s gruffness toward him might be nothing more than jealousy - and to confident Morik\u0027s way of thinking, why should it not be? - the rogue lifted his goblet out toward the pirate leader in toast.\n \"To a better understanding of each other\u0027s worth,\" he said, tapping Sheila\u0027s cup.\n \"And a better understanding of each other\u0027s desires,\" the pirate replied, her smirk even wider.\n Morik grinned as well, considering how he might turn this one\u0027s fire into some wild pleasures.\n He didn\u0027t get what he bargained for.\n Morik staggered out of Sheila\u0027s room a short while later, his head throbbing from the left hook the pirate had leveled his way while still wearing that smirk of hers. Confused by Sheila\u0027s violent reaction to his advance - Morik had sidled up to her and gently brushed the back of his hand across her ruddy cheek - the rogue muttered a dozen different curses and stumbled across the way toward Bellany\u0027s room. Morik wasn\u0027t used to such treatment from the ladies, and his indignation was clear to the sorceress as she opened the door and stood there, blocking the way.\n \"Making love with a trapped badger?\" the grinning Bellany asked.\n \"That would have been preferable,\" Morik replied and tried to enter the room. Bellany, though, kept her arm up before him, blocking the way.\n Morik looked at her quizzically. \"Surely you are not jealous.\"\n \"You seem to have a fair estimation of your worth to so definitely know that truth,\" she replied.\n Morik started to respond, but then the insult registered, and he stopped and gave a little salute to the woman.\n \"Jealous?\" Bellany asked skeptically. \"Hardly that. I would have thought you\u0027d have bedded Jule Pepper by now, at least. You do surprise me with your taste, though. I didn\u0027t think you were Sheila Kree\u0027s type, nor she yours.\"\n \"Apparently your suspicions are correct,\" the rogue remarked, rubbing his bruised temple. He started ahead again, and this time Bellany let him move past her and into the room. \"I suspect you would have had more luck in wooing that one.\"\n \"Took you long enough to figure that one out,\" Bellany replied, closing the door as she entered behind the rogue.\n Morik fell upon a bed of soft furs and rolled to cast a glance at the grinning sorceress. \"A simple word of warning?\" he asked. \"You could not have done that for me beforehand?\"\n \"And miss the fun?\"\n \"You did not miss much,\" said Morik, and he held his arms out toward her.\n \"Do you need your wound massaged?\" Bellany asked, not moving. \"Or your pride?\"\n Morik considered the question for just a moment. \"Both,\" he admitted, and, her smile widening even more, the sorceress approached.\n \"This is the last time I will warn you,\" she said, slipping onto the bed beside him. \"Tangle with Sheila Kree, and she will kill you. If you are lucky, I mean. If not, shell likely tell Chogurugga that you have amorous designs over her.\"\n \"The ogress?\" asked a horrified Morik.\n \"And if your coupling with that one does not kill you, then Bloog surely will.\"\n Bellany edged in closer, trying to kiss the man, but Morik turned away, any thoughts of passion suddenly flown.\n \"Chogurugga,\" he said, and a shudder coursed his spine. \n","sourceLink":"https://allnovel.net/sea-of-swords-paths-of-darkness-4/page-22.html","bookId":2133,"book":{"id":2133,"title":"Sea of Swords (Paths of Darkness #4)","description":"Storyline: \n Sea of Swords (Paths of Darkness #4) \n The mighty warhammer Aegis-fang has found its way into the hands of the wicked pirate captain Sheila Kree, and Wulfgar is hot on her trail. When Drizzt and his companions leave Mithral Hall in search of Wulfgar, they find themselves on the trail of the warhammer as well, a trail that will lead them to a startling reunion, and the last battle for the heart and soul of Wulfgar.\n \n","cover":"https://allnovel.net/images/sea-of-swords-paths-of-darkness-4.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sea-of-swords-paths-of-darkness-4.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:09:31 PM"}}
