{"id":94696,"no":26,"title":"Page 26","content":"Wulfgar,\" Regis said again, when no one reacted at all to his first remark. The halfling looked around to the others, trying to read their expressions. Catti-brie\u0027s was easy enough to discern. The woman looked like she could be pushed over by a gentle breeze, looked frozen in shock at the realization that Wulfgar was again standing before her. Drizzt appeared much more composed, and it seemed to Regis as if the perceptive drow was consciously studying Wulfgar\u0027s every move, that he was trying to get some honest gauge as to who this man standing before him truly was. The Wulfgar of their earlier days, or the one who had slapped Catti-brie? As for Bruenor, Regis wasn\u0027t sure if the dwarf wanted to run up and hug the man or run up and throttle him. Bruenor was trembling - though out of surprise, rage, or simple amazement, the halfling couldn\u0027t tell. And Wulfgar, too, seemed to be trying to read some hint of the truth of Bruenor\u0027s expression and posture. The barbarian, his stern gaze never leaving the crusty and sour look of Bruenor Battlehammer, gave a deferential nod the halfling\u0027s way. \"We have been looking for you,\" Drizzt remarked. \"All the way to Waterdeep and back.\" Wulfgar nodded, his expression holding steady, as if he feared to change it. \"It may be that Wulfgar has been looking for Wulfgar, as well,\" Robillard interjected. The wizard arced an eyebrow when Drizzt turned to regard him directly. \"Well, we found you - or you found us,\" said Regis. \"But ye think ye found yerself?\" Bruenor asked, a healthy skepticism in his tone. Wulfgar\u0027s lips tightened to thin lines, his jaw clenching tightly. He wanted to cry out that he had - he prayed that he had. He looked to them all in turn, wanting to explode into a wild rush that would gather them all up in his arms. But there he found a wall, as fluid and shifting as the smoke of Errtu\u0027s Abyss, and yet through which his emotions seemed not to be able to pass. \"Once again, it seems that I am in your debt,\" the barbarian managed to say, a perfectly stupid change of subject, he knew. \"Delly told us of your heroics,\" Robillard was quick to add. \"All of us are grateful, needless to say. Never before has anyone so boldly gone against the house of Deudermont. I assure you that the perpetrators have brought the scorn of the Lords of Waterdeep upon those they represented.\" The grand statement was diminished somewhat by the knowledge of all in the audience that the Lords of Waterdeep would not likely come to the north in search of those missing conspirators. The Lords of Waterdeep, like the lords of almost every large city, were better at making proclamations than at carrying through with action. \"Perhaps we can exact that vengeance for the Lords of Waterdeep, and for Captain Deudermont as well,\" Drizzt offered with a sly expression turned Robillard\u0027s way. \"We hunt for Sheila Kree, and it was she who perpetrated the attack on the captain\u0027s house.\" \"I have delivered Wulfgar to you to join in that hunt.\" Again all eyes fell over the huge barbarian, and again, his lips thinned with the tension. Drizzt saw it clearly and understood that this was not the time to burst the dam that was holding back Wulfgar\u0027s, and thus all of their feelings. The drow turned to regard Catti-brie, and the fact that she didn\u0027t blink for several long moments told him much about her fragile state of mind. \"But what of Robillard?\" the dark elf asked suddenly, thinking to deflect, or at least delay the forthcoming flood. \"Will he not use his talents to aid us?\" That caught the wizard off guard, and his eyes widened. \"He already did!\" he protested, but the weakness of the argument was reflected in his tone. Drizzt nodded, accepting that. \"And he can do so much more, and with ease.\" \"My place is with Captain Deudermont and Sea Sprite, who are already at sea hunting pirates, and were, in fact, in pursuit of one such vessel even as I flew off to collect Wulfgar,\" Robillard explained, but the drow\u0027s smile only widened. \"Your magical talents allow you to search far and wide in a short time,\" Drizzt explained. \"We know the approximate location of our prey, but with the ups and downs of the snow-covered mountains, they could be just beyond the next rise without our ever knowing it.\" \"My skills have been honed for shipboard battles, Master Do\u0027Urden,\" Robillard replied. \"All we ask of you is aid in locating the pirate clan, if they are, as we believe, holed up on the southwestern edge of the mountains. Certainly if they\u0027ve put their ship into winter port, they\u0027re near the water. How much more area can you scout, and how much grander the vantage point, with enchantments of flying and the like?\" Robillard thought the words over for a few moments, brought a hand up, and rubbed the back of his neck. \"The mountains are vast,\" he countered. \"We believe we know the general direction,\" Drizzt answered. Robillard paused a bit longer, then nodded his head. \"I will search out a very specific region, giving you just this one afternoon,\" he said. \"Then I must return to my duties aboard Sect Sprite. We\u0027ve a pirate in chase that I\u0027ll not let flee.\" \"Fair enough,\" Drizzt said with a nod. \"I will take one of you with me,\" the wizard said. He glanced around, his gaze fast settling on Regis, who was by far the lightest of the group. \"You,\" he said, pointing to the halfling. \"You will ride with me on the search, learn what you may, then guide your friends back to the pirates.\" Regis agreed without the slightest hesitation, and Drizzt and Catti-brie looked at each other with continued surprise. The preparations were swift indeed, with Robillard gathering up one of the empty packs and bidding Regis to follow him outside. He warned the halfling to don more layers of clothing to battle the cold winds and the great chill up high, then cast an enchantment upon himself. \"Do you know the region Drizzt spoke of?\" he asked. Regis nodded and the wizard cast a second spell, this one over the halfling, shrinking him down considerably in size. Robillard plucked the halfling up and set him in place in the open pack, and off the pair flew, into the bright daylight. \"Quarterling?\" Bruenor asked with a chuckle. \"Lookin\u0027 more like an eighthling,\" Catti-brie answered, and the two laughed. The levity didn\u0027t seem to sink in to Wulfgar, nor to Drizzt who, now that the business with Robillard was out of the way, understood that it was time for them to deal with a much more profound issue, one they certainly could not ignore if they were to walk off together into danger with any hope of succeeding. He saw the world as a bird might, soaring past below him as the wizard climbed higher and higher into the sky, finding wind currents that took them generally and swiftly in the desired direction, south and to the sea. At first, Regis considered how vulnerable they were up there, black spots against a blue sky, but as they soared on the halfling lost himself in the experience. He watched the rolling landscape, coming over one ridge of a mountain, the ground beyond falling away so fast it took the halfling\u0027s breath away. He spotted a herd of deer below and took comfort in their tiny appearance, for if they were that small, barely distinguishable black spots, then how small he and Robillard must seem from the ground. How easy for them to be mistaken for a bird, Regis realized, especially given the wizard\u0027s trailing, flowing cape. Of course, the sudden realization of how high they truly were soon incited other fears in Regis, and he grabbed on tightly to the wizard\u0027s shoulders. \"Lessen your pinching grasp!\" Robillard shouted against the wind, and Regis complied, just a tiny bit. Soon the pair were out over cold waters, and Robillard brought them down somewhat, beneath the line of the mountaintops. Below, white water thrashed over many looming rocks and waves thundered against the stony shore, a war that had been raging for millennia. Though they were lower in the sky, Regis couldn\u0027t help but tighten his grip again, A thin line of smoke ahead alerted the pair to a campfire and Robillard immediately swooped back in toward shore, cutting up behind the closest peaks in an attempt to use them as a shield against the eyes of any potential sentries. To the halfling\u0027s surprise and relief, the wizard set down on a bare patch of stone. \"I must renew the spell of flying,\" Robillard explained, \"and enact a couple more.\" The wizard fumbled in his pouch for various components, then began his spellcasting. A few seconds later, he disappeared. Regis gave a little squeak of surprise and alarm. \"I am right here,\" Robillard\u0027s voice explained. The halfling heard him begin casting again - the same spell, Regis recognized - and a moment later Regis was invisible too. \"You will have to feel your way back into my pack as soon as I am done renewing the spell of flying,\" the wizard\u0027s voice explained, and he began casting again. Soon the pair were airborne once more, and though he knew logically that he was safer because he was invisible, Regis felt far less secure simply because he couldn\u0027t see the wizard supporting him in his flight. He clung with all his might as Robillard zoomed them around the mountains, finding lower passes that led in the general direction of the smoke they\u0027d seen. Soon that smoke was back in sight yet again, only this time the pair were flying in from the northwest instead of the southwest. As they approached, they came to see that it was indeed sentries. There was a pair of them, one a rough-looking human and the other a huge, muscled brute - a short ogre perhaps, or a creature of mixed human and ogre blood. The two huddled over a meager fire on a high ridge, rubbing their hands and hardly paying attention to their obvious duty overlooking a winding pass in a gorge just beyond their position. \"The prisoners we captured mentioned a gorge,\" Regis said to the wizard, loudly enough for Robillard to hear. In response, Robillard swooped to the north and followed the ridge up to the end of the long gorge. Then he swung around and flew the halfling down the descending, swerving line of the ravine. It had obviously once been a riverbed that wound down toward the sea between two long walls of steep stone, two, maybe three hundred feet tall. The base was no more than a hundred feet wide at its widest point, the expanse widening as the walls rose so that from cliff top to cliff top was several hundred feet across in many locations. They passed the position of the two sentries and noted another pair across the way, but the wizard didn\u0027t slow long enough for Regis to get a good look at this second duo. Down the wizard and his unenthusiastic passenger went, soaring along, the gorge walls rolling past at a pace that had the poor halfling\u0027s thoughts whirling. Robillard spotted yet another ogre-looking sentry, but the halfling, too dizzy from the ride, didn\u0027t even look up to acknowledge the wizard\u0027s sighting. The gorge rolled along for more than a thousand feet, and as they rounded one last bend, the pair came in sight of the wind-whipped sea. To the right, the ground broke away into various piles of boulders and outcroppings - a jagged, blasted terrain. To the left, at the base of the gorge, loomed a large mound perhaps four or five hundred feet high. There were openings along its rocky side, including a fairly large cave at ground level. Robillard went past this, out to the sea, then turned a swift left to encircle the south side of the mound. Many great rocks dotted the seascape, a veritable maze of stone and danger for any ships that might dare it. Other mounds jutted out even more than this one all about the coast, further obscuring it from any seafaring eyes. And there, in the south facing at sea level, loomed a cave large enough for a masted ship to enter. Robillard went past it, rising as he continued to circle. Both he and Regis noted a pathway then, beginning to the side of the ocean level cavern and rising as it encircled the mountain to the east. Climbing up past the eastern face, the pair saw one door, and could easily imagine others along that often-shielded trail. Robillard went up over the eastern face, continuing back to the north and cutting back down into the gorge. To the halfling\u0027s surprise and trepidation, the wizard put down at the base of the mound, right beside the cave opening, which was large enough for a pair of wagons to drive through side by side. The wizard held onto the invisible halfling, pulling him along into the cave. They heard the gruff banter of three ogres as soon as they went in. \"There might be a better way into the complex for yourself and the drow,\" the wizard suggested in a whisper. The halfling nearly jumped in the air at the sound of the voice right beside him. Regis composed himself quickly enough not to squeal out and alert the guards. \"Stay here,\" Robillard whispered, and he was gone. And Regis was all alone, and though he was invisible he felt very small and very vulnerable indeed. \"You nearly killed me with the first throw of the warhammer!\" Drizzt reminded, and he and Catti-brie both smiled when the drow\u0027s words brought a chuckle to Wulfgar\u0027s grim visage. They were discussing old times, fond recollections initiated by Drizzt in an effort to break the ice and to draw Wulfgar out of his understandable shell. There was nothing comfortable about this reunion, as was evidenced by Bruenor\u0027s unrelenting scowl and Wulfgar\u0027s obvious tension. They were recounting the tales of Drizzt and Wulfgar\u0027s first battle together, in the lair of a giant named Biggrin. The two had been training together, and they understood their relative styles, and at many junctures those styles had meshed into brilliance. But indeed, as Drizzt clearly admitted, at some points more luck than teamwork or skill had been involved. Despite Bruenor\u0027s quiet and continuing scowl, the drow went on with tales of the old days in Icewind Dale, of the many adventures, of the forging of Aegis-fang (at which both Bruenor and Wulfgar winced noticeably), of the journey to Calimport to rescue Regis and the trip back to the north and east to find and reclaim Mithral Hall. Even Drizzt was surprised at the sheer volume of the tales, of the depth of the friendship that had been. He started to talk of the coming of the dark elves to Mithral Hall, the tragic encounter that had taken Wulfgar away from them, but he stopped, reconsidering his words. \"How could such bonds have been so fleeting?\" the drow asked bluntly. \"How could even the intervention of a demon have sundered that which we all spent so many years constructing?\" \"It was not the demon Errtu,\" Wulfgar said, even as Catti-brie started to respond. The other three stared at the huge man, for these were his first words since Drizzt had begun the tales. \"It was the demon Errtu implanted within me,\" Wulfgar explained. He paused and moved to the side, facing Catti-brie directly instead of Drizzt. He gently took the woman\u0027s hands in his own. \"Or the demons that were there before . . .\" His voice broke apart, and he looked up, moisture gathering in his crystal-blue eyes. Stoically, Wulfgar blinked it away and looked back determinedly at the woman. \"I can only say that I am sorry,\" he said, his normally resonant voice barely a whisper. Even as he spoke the words, Catti-brie reached up and wrapped him in a great hug, burying her face in his huge shoulder. Wulfgar returned that hug a thousand times over, bending his face into the woman\u0027s thick auburn hair. Catti-brie turned her face to the side, to regard Drizzt, and the drow was smiling and nodding, as pleased as she that this first in what would likely be a long line of barriers to the normal resumption of their friendship had been so thrown down. Catti-brie stepped back a moment later, wiping her own eyes and regarding Wulfgar with a warm smile. \"Ye\u0027ve a fine wife there in Delly,\" she said. \"And a beautiful child, though she\u0027s not yer own.\" Wulfgar nodded to both, seeming very pleased at that moment, seeming as if he had just taken a huge step in the right direction. His grunt was as much in surprise as in pain, then, when he got slammed suddenly in the side. A heavy punch staggered him to the side. The barbarian turned to see a fuming Bruenor standing there, hands on hips. \"Ye ever hit me girl again and I\u0027ll be making a fine necklace outta yer teeth, boy! Ye want to be callin\u0027 yerself me son, and ye don\u0027t go hitting yer sister!\" The way he put it was perfectly ridiculous, of course, but as Bruenor stomped past them and out of the cave the three left behind heard a little sniffle and understood that the dwarf had reacted in the only way his proud sensibilities would allow, that he was as pleased by the reunion as the rest of them. Catti-brie walked over to Drizzt, then, and casually but tellingly draped her arm across his back. Wulfgar at first seemed surprised, at least as much so as when Bruenor had slugged him. Gradually, though, that look of surprise melted into an expression completely accepting and approving, the barbarian offering a wistful smile. \"The road before us becomes muddled,\" Drizzt said. \"If we are together, and contented, need we go to find Aegis-fang now, against these obstacles?\" Wulfgar looked at him as if he didn\u0027t believe what he was hearing. The barbarian\u0027s expression changed, though, and quickly, as he seemed to almost come to agree with the reasoning. \"Ye\u0027re bats,\" Catti-brie answered Drizzt, in no uncertain terms. The drow turned a surprised and incredulous look over her, given her vehemence. \"Don\u0027t ye be taking me own word,\" the woman said, \"Ask him.\" As she finished, she pointed back behind the drow, who turned to see Bruenor stomping back in. \"What?\" the dwarf asked. \"Drizzt was thinking that we might be better off leaving the hammer for now,\" Catti-brie remarked. Bruenor\u0027s eyes widened and for a moment it seemed as if he would launch himself at the drow. \"How can ye ... ye durn fool elf. .. why . . . w-what?\" he stammered. Drizzt patted his hand in the air and offered a slight grin, while subtly motioning for the dwarf to take a look at Wulfgar. Bruenor continued to sputter for a few more moments before catching on, but then he steadied himself, hands on hips, and turned on the barbarian. \"Well?\" the dwarf bellowed. \"What\u0027re ye thinking, boy?\" Wulfgar took a deep breath as the gazes of his four friends settled over him. They placed him squarely in the middle of it all, which was where he belonged, he understood, for it was his action that had cost him the hammer, and since it was his hammer his word should be the final say on the course before them. But what a weight that decision carried. Wulfgar\u0027s thoughts swirled through all the possibilities, many of them grim indeed. What if he led the companions to Sheila Kree only to have the pirate band wipe them out? Or even worse, he figured, suppose one or more of his friends died, but he survived? How could he possibly live with himself if that . . . Wulfgar laughed aloud and shook his head, seeing the trap for what it was. \"I lost Aegis-fang through my own fault,\" he admitted, which of course everyone already knew. \"And now I understand the error - my error. And so I will go after the warhammer as soon as I may, through sleet and snow, against dragons and pirates alike if need be. But I can not make you, any of you, join with me. I would not blame any who turned back now for Ten-Towns, or for one of the smaller towns nestled in the mountains. I will go. That is my duty and my responsibility.\" \"Ye think we\u0027d let ye do it alone?\" Catti-brie remarked, but Wulfgar cut her short. \"And I welcome any aid that you four might offer, though I feel that I am hardly deserving of it.\" \"Stupid words,\" Bruenor huffed. \" \u0027Course we\u0027re going, ye big dope. Ye got yer face into the soup, and so we\u0027re pullin\u0027 it out.\" \"The dangers - \" Wulfgar started to respond. \"Ogries and stupid pirates,\" said Bruenor. \"Ain\u0027t nothing tough there. We\u0027ll kill a few and send a few more running, get yer hammer back, and be home afore the spring. And if there\u0027s a dragon there . . .\" Bruenor paused and smiled wickedly. \"Well, we\u0027ll let ye kill it yerself!\" The levity was perfectly timed, and all of the companions seemed to be just that again, four friends on a singular mission. \"And if ye ever lose Aegis-fang again,\" Bruenor roared on, pointing a stubby finger Wulfgar\u0027s way, \"I\u0027ll be buryin\u0027 ye afore I go get it back!\" Bruenor\u0027s tirade seemed as if it would ramble on, but a voice from outside silenced him and turned all heads that way. Robillard and Regis entered the small cave. \"We found them,\" Regis said before the wizard could begin. The halfling stuffed his stubby thumbs under the edges of his heavy woolen vest, assuming a proud posture. \"We went right in, past the ogre guards and - \" \"We don\u0027t know if it is Sheila Kree,\" Robillard interrupted, \"but it seems as if we\u0027ve found the source of the ogre raiding party - a large complex of tunnels and caverns down by the sea.\" \"With a cave on the water large enough for a ship to sail into,\" Regis was quick to add. \"You believe it to be Kree?\" Drizzt asked, staring at the wizard as he spoke. \"I would guess,\" Robillard answered with only the slightest hesitation. \"Sea Sprite has pursued what we think was Kree\u0027s ship into these waters on more than one occasion, then simply lost her. We always suspected that she had a hidden port, perhaps a cave. The complex at the end of that gorge to the south would support that.\" \"Then that is where we must go,\" Drizzt remarked. \"I can not carry you all,\" Robillard explained. \"Certainly that one is too large to hang on my back as I fly.\" He pointed to Wulfgar. \"You know the way?\" the drow asked Regis. The halfling stood very straight, seeming as if he was about to salute the drow. \"I can find it,\" he assured Drizzt and Robillard. The wizard nodded. \"A day\u0027s march, and no more,\" he said. \"And thus, your way is clear to you. If.. .\" He paused and looked at each of them in turn, his gaze at last settling on Wulfgar. \"If you don\u0027t choose to pursue this now, Sea Sprite would welcome you all in the spring, when we might find a better opportunity to retrieve the lost item from Sheila Kree.\" \"We go now,\" Wulfgar said. \"Won\u0027t be no Kree to chase, come spring,\" Bruenor snickered, and to accentuate his point, he pulled forth his battle-axe and slapped it across his open palm. Robillard laughed and nodded his agreement. \"Good Robillard,\" Drizzt said, moving to stand before the wizard, \"If you and Sea Sprite see Bloody Keel on the high seas, hail her before you sink her. It might well be us, bringing the pirateer into port.\" Robillard laughed again, all the louder. \"I do not doubt you,\" he said to Drizzt, patting the drow on the shoulder. \"Pray, if we do meet on the open water, that you and your friends do not sink us!\" The good-natured humor was much appreciated, but it didn\u0027t last. Robillard walked past the dark elf to stand before Wulfgar. \"I have never come to like you,\" he said bluntly. Wulfgar snorted - or started to, but he caught himself and let the wizard continue. Wulfgar expected a berating that perhaps he deserved, given his actions. The barbarian squared himself and set his shoulders back, but made no move to interrupt. \"But perhaps I have never really come to know you,\" Robillard admitted. \"Perhaps the man you truly are is yet to be found. If so, and you do find the true Wulfgar, son of Beornegar, then do come back to sail with us. Even a crusty old wizard, who has seen too much sun and smelled too much brine, might change his mind.\" Robillard turned to wave to the others, but looked back, turning a sly glance over Wulfgar. \"If that matters to you at all, of course,\" he said, and he seemed to be joking. \"It does,\" Wulfgar said in all seriousness, a tone that stiffened the wizard and the friends with surprise. An expression that showed startlement, and a pleasant one, widened on Robillard\u0027s face. \"Farewell to you all, then,\" the wizard said with a great bow. He ended by launching directly and smoothly into a spell of teleportation, the air around him bubbling like multicolored boiling water, obscuring his form. And he was gone, and it was just the five of them. As it had once been.","sourceLink":"https://allnovel.net/sea-of-swords-paths-of-darkness-4/page-26.html","bookId":2133,"book":{"id":2133,"title":"Sea of Swords (Paths of Darkness #4)","description":"Storyline: Sea of Swords (Paths of Darkness #4) The mighty warhammer Aegis-fang has found its way into the hands of the wicked pirate captain Sheila Kree, and Wulfgar is hot on her trail. When Drizzt and his companions leave Mithral Hall in search of Wulfgar, they find themselves on the trail of the warhammer as well, a trail that will lead them to a startling reunion, and the last battle for the heart and soul of Wulfgar.","cover":"https://allnovel.net/images/sea-of-swords-paths-of-darkness-4.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sea-of-swords-paths-of-darkness-4.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:09:31 PM"}}
