{"id":87020,"no":58,"title":"Page 58","content":"She was having a hard time dealing with the mere possibility of him going after a gang member. She wasn’t sure she could be as strong as Gayle, dealing with her man being gone for months, not knowing if he was alive or dead, or what kind of things he was facing. But it helped her understand Gayle’s patience with Jenny, as well as Max’s compassion. Max hadn’t been married, but he’d know the toll his absences took on his mother and sister, even before the attack. “Hey.” He was squatting in the tent opening, looking rugged and far-too-appealing in his jeans and T-shirt, his hiking boots. He ran a hand down her back. “All right?” “Yes.” She turned so she was folded on her knees, facing him. “So, what do you propose for dinner? If you plan to kill something that I have to de-fur or de-scale, I will take your truck keys and head for the nearest hotel.” He grinned, reaching over her shoulder to capture her braid. She’d plaited her hair this morning, assuming it would be the easiest style to manage for camping requirements. “But I have this mountain man-squaw fantasy, and you already have your hair done right for it.” “Give me your keys.” She made a lunge for his pocket and he caught her about the waist, holding her closer to him with a laugh. “Gayle packed us meals. It was the deal I worked out with her in exchange for my extensive manual labor skills.” He winked. “She’s a great cook. Tonight it’ll be her lasagna. She also put a couple salads in the cooler, and I brought a bottle of wine. You prefer red, right?” “Yes. How did you know that?” “I noticed it at the Christmas party.” A party that had been months ago. She shook her head. “If you’re trying to impress me, it might be working.” But when his arm loosened, thighs tensing as if he intended to leave the tent, probably to go check on her dinner, she hooked her fingers in the collar of his T-shirt. “What I want right now isn’t food. Not exactly.” She tilted her head toward the foam bed. “I want you to stretch out there. No clothes. Now.” He met her gaze. “How about you in no clothes?” “Maybe. If you please me.” Another weighted moment, then he inclined his head. When she released him, he backed out of the tent so that he could stand, pull the shirt over his head. No more questions, no hesitation. It fired her blood, made her wet her lips, especially when that muscular terrain rippled before her avid gaze. He unbelted the jeans, opened them, then bent to untie the hiking shoes. He toed them off, gaze returning to her as he got rid of them and then the rest of his clothes, dropping them in a pile on the shoes. “Stand there, just like that.” There was a pure beauty to a man in superior physical condition. Not bulges of muscle, but hard curves meant to support stamina, endurance…combat conditions. “Do you keep in the same shape as you did for the SEALs?” “Pretty much. It’s a good routine. Makes me feel connected to them.” It also kept him in condition for what was ahead. But she didn’t want this moment to be about that. “Turn around. Face away from me.” He complied, hips shifting. As he turned, her gaze drifted over the skull trident, then slipped back down to his fantastic ass, the muscular thighs. Rising to her knees, she put her hands on his buttocks, molding her palms over them. She slid her thumbs down to his thighs, causing him to widen his stance at the implied command. Making a noise of approval, she slipped her fingers between his legs to caress that sensitive joining point of the balls, then cupped them to squeeze. Leaning forward, she teased the seam between the cheeks with her tongue, nipping at him as he suppressed an oath. She suspected he would have turned then, but when he made to shift, she tightened her grip. “Unh-unh. All mine.” She whispered it against his flesh. “Mine to do with what I want. And what I want is you to keep this fine ass still.” He strangled on a half chuckle, and then his back muscles tightened as she kept idly tracing that line. She was aware of the responsive nerve endings she’d find deeper in the intimate crevice, around his rim. But to access that she’d need both of her hands, and she liked holding his testicle sac in her palm, her fingers closed firmly over the solid weight. Well, there was no need to limit herself. She had a pair of hands at her command, didn’t she? “Reach back and spread your ass cheeks for me.” It took another bated breath, but then he complied. She was touched and delighted to find he’d shaved his manly hair, at least in that region. It suggested he’d thought about some of the things his Mistress might want of him, and what would please her. He might not be a sub, but he anticipated as well as one of the best. He’ll treat her right, whether it’s today or fifty years from now… His fingers clenched on that delicious tautness as she ran her tongue over the crinkled area of his rim, then delicately pushed into his anal region, making him groan. He was going to leave bruising fingerprints on his own ass, and she had no problem with that. She’d love adding her own marks over them. She continued to knead his testicles, run her thumb along the base of his cock as far as she could reach, while she teased his anus. His feet were pressed into the earth, his thighs like cement columns. She slid her free hand up over his right one, caressing his fingers on his ass cheek, then she drew back, a clear message that she wasn’t inviting contact. Not yet. When he turned a hungry gaze on her, her libido growled in sympathetic response. “Lie on the mattress. Face up.” She shifted out of the way so he could duck into the tent opening. He squatted at the base of the foam pad, moving into a very tempting position on his hands and knees before he turned and stretched out on the mattress. His cock was a stiff soldier, making her wet her lips again. She was still dressed, and that was the way she was going to stay, for now. “Legs spread so your ankles are as wide as the tent entrance. Arms above your head. Grab the back tent support, and don’t let go. Not unless I say so.” The expression he locked upon her was the one that sent his power rolling over her, giving her that titillating feeling that she was in command of a wild beast who could overwhelm her with his strength in a heartbeat, but wouldn’t. Not if she managed that delicate play of power exchange perfectly. He complied, body stretching to accommodate her desire. “Good boy.” Though there was nothing boy-like about the body she was appraising, or the rigid planes of his concentrated face. She knelt between his legs, running her nails up his thighs. “Your obeying my commands pleases me, Max. And you know about obeying commands, don’t you?” His eyes lit with flame, suggesting she was challenging the fighter in him further. But he was also very disciplined. His fingers tightened on the tent pole. “I can give you pleasure, Mistress, if you’ll let me.” “You are giving me pleasure, Max. I want to take, on my terms. Your only job is to comply with my desires.” She closed her hand around his cock, began to slide up and down, working him in her loosely wrapped fist. It was a method and rhythm sure to get a response, and she did. His hips flexed, and when she bent to put her lips on his head, slide down his length, he jerked, his fingers tightening even farther on the tent pole. She didn’t think that metal shaft could be any harder than the one in her mouth, and it was getting harder, blood filling and thickening it so he pressed against her tongue and teeth. “Jesus,” he muttered. “Janet….Mistress.” She dug her nails into his thighs, and he drew in his breath, shuddered. When she moved her hand to his stomach, she scratched him there as well, enjoying the score marks. She was tempted to draw blood, to put proof of her ownership on him. He said he was falling in love with her, and she viewed that declaration as synonymous with ownership, a giving of himself to her utterly. The new part, to her, was considering such possessiveness a two-way street. She’d seen it happen with each of the K\u0026A men. All of them hardcore Dominants, yet each man had found that one woman who spoke to his soul and captured his heart. Perhaps she wasn’t much different. Max may have bided his time waiting for her to initiate, and she had taken that time herself, deliberately, but now, on this side of it, she realized they’d both known it, felt it. She would have liked to ease a finger up his rear passage to heighten the intensity of the climax she was going to give him, but her nails were too long. She didn’t want the sharp edges to give him the wrong kind of pain. Even the toughest guy in the world had delicate anal tissues. She’d keep that thought to herself though, since men like Max didn’t like to hear that any part of them was less than battle tough. But the fragility of those tissues was also what made the rear entry so deliciously responsive. She increased the suction of her mouth on his cock, the rhythm and flow of her grip, so he was bucking up against her like a bull in the chute, waiting to be let loose. She reveled in the sight of all that power, his arms stretched above his head at her command, him gripping the tent pole such that she hoped it was buried deep enough that he wouldn’t yank it loose. But the idea of that, the canvas floating down, blinding them to anything but the physical sensations they were giving one another, wasn’t unappealing. The vein under her thumb made a hard convulsion, telling her he was there. “Come, Max.” She spoke against his flesh, her mouth full of him to the throat, but he understood her. He let go with a harsh, needy sound, shoving hard between her lips. She held him taut at the base, reveling in the pump of heated fluid. She swallowed down the salty thick taste, letting some of it escape to lubricate his shaft further, wetting her fingers and giving him a full measure of the climax. He kept shuddering and jerking in her grip, every nerve ending oversensitized by the strength of his release. She brought him down slowly, squeezing, sucking, running her tongue over him, polishing and collecting every last bit of the climax she’d commanded from him. His hand landed on her shoulder, then the other, and he was pulling her up his body to lie fully clothed on him. He gripped her buttock, long fingers pressed intimately into her crotch, and held her tight against his cock, letting her feel that pulsing aftermath. Then he had her by the wrist and was cleaning her hand with his mouth, caring for her. Her throat tightened and she stroked his thick, soft hair with her other hand as he suckled each finger, licking her palm, her knuckles. “Max,” she murmured, a consecration. “Dear, sweet man.”","sourceLink":"https://allnovel.net/willing-sacrifice-knights-of-the-board-room-6/page-58.html","bookId":1905,"book":{"id":1905,"title":"Willing Sacrifice (Knights of the Board Room #6)","description":"Storyline: Willing Sacrifice (Knights of the Board Room #6) Janet Albright prefers her men submissive, her relationships confined to a club environment. Which is why her attraction to former Navy SEAL Maxwell Ackerman doesn’t make a lot of sense. There isn’t a submissive bone in his muscular body, suggesting her interest in the man is best indulged as a private fantasy. When a crisis situation reveals different sides of them both, the attraction becomes mutual and undeniable. Janet and Max take the plunge, willing to see if the give-and-take of their unexpected relationship can satisfy their deepest desires. Until ghosts from their past emerge, threatening to destroy the delicate balance of power before their love can find a way to tip the scales.","cover":"https://allnovel.net/images/willing-sacrifice-knights-of-the-board-room-6.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/willing-sacrifice-knights-of-the-board-room-6.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:18:31 PM"}}
