{"id":65323,"no":11,"title":"Page 11","content":"Now she could not stop thinking about it.\\n\\n Forcing her eyes to open, Isabel stared at the mirror and watched herself writhe between his skilled hands and hard body. At that moment she hated herself, hated seeing an echo of the girl she had been almost a decade ago, helpless in the grip of a desire skillfully crafted for a man’s pleasure.\\n\\n Gray’s arms tightened, pinning her tightly to his chest. His mouth, hot and wet, nuzzled all over her throat and shoulder. “God, I want to fuck you,” he rasped, the clasp of his fingers becoming a hard pinch. “I want that so badly I’m afraid I will tear you apart.”\\n\\n The crudeness of his speech was more than she could tolerate. With a cry, she climaxed, her cunt spasming so hard her knees nearly gave way. Gray held her upright, his hold strong and steady.\\n\\n Panting, Isabel turned her gaze away from her wanton reflection and sought out Pelham’s likeness. She looked into dark eyes that had once drawn her into sexual decadence, and she called to mind every one of his mistresses. She remembered every occasion where she had been forced to sit across from one of them at a social function or to smell their perfume on her husband’s skin. She thought of all the women who had been in her home today with their come-hither smiles, and her stomach roiled violently, dousing her ardor instantly.\\n\\n “Release me,” she said, her voice low and determined. She straightened, shrugging him off.\\n\\n He stiffened behind her. “Listen to your breathing, and the rapid beat of your heart. You want this as badly as I do.”\\n\\n “I do not.” She struggled in near panic until he released her with a curse. Then she spun on him with her fists clenched, every cell in her body working to turn her raging desire into just plain rage. “Keep your distance from me. Move back to your room. Leave me alone.”\\n\\n “What in hell is the matter with you?” He ran both hands through his thick, dark hair. “I do not understand you.”\\n\\n “I don’t want a sexual relationship with you. I have said that many times.”\\n\\n “Why not?” he said crossly, beginning to pace.\\n\\n “Do not push me anymore, Grayson. If you continue forcing yourself on me, I will have to leave.”\\n\\n “Forcing myself on you?” He pointed a finger at her, a wealth of frustration betrayed by the rigidness of his body. “We will sort this out. Tonight.”\\n\\n Lifting her chin, Isabel held her gown to her breasts and shook her head rapidly. “I have plans for this evening. I told you that.”\\n\\n “You cannot go out,” he scoffed. “Look at you. You are shaking all over with the need for a hard tumble.”\\n\\n “That is not your concern.”\\n\\n “Damned if it isn’t.”\\n\\n “Gray—”\\n\\n Gray’s eyes narrowed dangerously. “Do not bring Hargreaves into this, Isabel. Do not go to him to sate the needs I arouse.”\\n\\n She gaped. “Are you threatening me?”\\n\\n “No. And well you know it. I am promising you, that if you go to Hargreaves to ease cravings brought on by my touch, I will call him out.”\\n\\n “I cannot believe this.”\\n\\n He threw up his hands. “Neither can I. There you stand, aching for me. Here I stand, ready to fuck you until neither of us can walk. What is the problem, Isabel? Can you tell me that?”\\n\\n “I do not want to ruin our marriage!”\\n\\n Gray took a deep, calming breath. “I must point out to you, dear wife, that marriage, by nature, includes sex. Between the spouses, not third parties.”\\n\\n “Not our marriage,” she said firmly. “We had a bargain. You must find someone else.”\\n\\n “That blasted bargain! Christ, Pel. Things have changed.” He stepped toward her with arms outstretched, the tense line of his jaw softening.\\n\\n She ran to her escritoire, and put the piece of furniture between them. If he touched her, she would crumble.\\n\\n His jaw clenched again. “As you wish,” he bit out. “But this is not what you want. I saw you today, the way you looked at every woman who walked in the door. The truth is, whatever your reasoning is for not wanting me in your bed, you don’t want me in any other woman’s bed either.” Gray bowed. “However, your wish is my command. You can collect your error on your own.”\\n\\n Before she could react, he was gone. And while she regretted her words immediately, she did not chase him down and tell him not to go.\\n\\n Chapter 6\\n\\n Gerard strode the length of the hallway that led to Lady Stanhope’s hotel room, and cursed his stubborn wife.\\n\\n There were benefits to doing as Isabel urged. His desire for her was nigh unbearable, causing him to push her too quickly and frighten her. He understood this, and he appreciated that he was not giving her enough time to become accustomed both to his new interest and his return to her life. It was true that fucking Barbara would take the edge off his hunger, but damn it! He did not want to take the edge off. He wanted to experience the aching, burning, intoxicating passion with Isabel, not a substitute for her.\\n\\n But the thought of his wife with Hargreaves was so infuriating, his blood boiled. He would be damned if she eased her needs while he suffered with his own. Gerard knocked on Barbara’s door, and walked right in.\\n\\n “I knew you would come,” she purred, nude on the bed, wearing only a black ribbon around her throat. He hardened instantly, as any man would at the sight of her. Barbara was a beautiful woman with a ravenous sexual appetite, enough to incite his anger and frustration into adulterated lust.\\n\\n Shrugging out of his jacket and unfastening the buttons of his waistcoat, he approached the bed with grim determination.\\n\\n Barbara came up on her knees, and moved to help him. “Grayson,” she breathed in her girlish voice, her eager hands shoving his garments off his shoulders to pool on the floor. “You are so hot for it tonight.”\\n\\n He crawled over her, pinning her to the bed, then rolled, bringing her over him.\\n\\n “You know what to do,” he muttered, then lay there, staring up at the ceiling, his mind completely disconnected from the meaningless sex that would soon follow.\\n\\n Tugging his shirt free, Barbara ran her hands across his rippled abdomen. “I think I could orgasm just looking at you.” She leaned over him, pressing her breasts against his thigh as she worked to open his trousers. “But, of course, I will do more than look.”\\n\\n Gerard closed his eyes, and longed for Isabel.\\n\\n Isabel stepped down from her carriage and entered the Hargreaves residence by way of the mews. It was a path she had taken hundreds of times, and one that used to fill her with warm anticipation. Tonight, however, was completely different. Her stomach was knotted, and her palms damp. Gray had left on horseback, and she knew he had gone to another woman.\\n\\n And she was the one who had driven him there.\\n\\n At this moment, he was most likely buried deep inside someone, his gorgeous ass tightening and flexing as he thrust his cock into a willing body. She told herself their marriage was best this way. Better he find someone else now, than after she had succumbed. But even knowing this, she did not feel any better. The pictures in her mind tormented her, and the feeling of possessiveness did not abate. As she walked silently along the upper floor hallway, she could not fight her feelings of guilt and betrayal.\\n\\n She knocked softly on John’s bedroom door, then entered.\\n\\n Hargreaves sat before the fire. Dressed in a multi-colored silk robe, and holding a snifter in his hand, he stared broodingly into the fire. “I did not think you would come,” he said without looking at her. His voice was slightly slurred, and she noted the near-empty decanter on the table next to him.\\n\\n “I am sorry,” she murmured, sinking to the floor at his feet. “I know the gossip hurts you. It pains me deeply.”\\n\\n “Have you slept with him?”\\n\\n “No.”\\n\\n “But you want to.”\\n\\n “Yes.”\\n\\n His eyes met hers, and he cupped her cheek in his hand. “Thank you for your honesty.”\\n\\n “I sent him away tonight.” She nuzzled into his touch, relishing the peace and familiar comfort she found in his presence. “He went.”\\n\\n “Will he stay away?”\\n\\n Leaning her cheek against his knee, she stared into the fire. “I’m not certain. He seems quite determined.”\\n\\n “Yes.” John’s fingers slipped into her hair. “I remember that age. The barest periphery of your mortality hits you, and the need to sire an heir becomes nearly overwhelming.”\\n\\n Isabel stiffened. “He has two younger brothers. He does not need an heir.”\\n\\n John’s laugh held no humor. “When did he tell you this? When you married? When he was two and twenty? Of course he was not interested in children at that time. Most men are not. Fucking is primary, and pregnancy does put a damper on that.”\\n\\n She thought of Gray’s boyish excitement over Emily’s pregnancy, and her blood ran cold. He had shown a strong desire for children before.\\n\\n “He is a marquess, Isabel,” Hargreaves said, his lips on the rim of his glass, his fingers in her hair. “He needs an heir, and while he may have brothers, a man does like to produce his own issue. What other reason did he give you for returning?”\\n\\n “He said he felt guilt for leaving me to face the rumors alone.”\\n\\n “I would not have thought Grayson was capable of such altruism,” Hargreaves said dryly, setting his empty glass aside. “He would have to be a completely different man than the one I knew of only four years ago.”\\n\\n Staring into the fire, Isabel suddenly felt very foolish and very hurt. She sat there for a long time watching the flames dance.\\n\\n Later, John’s hand drifted, weighing heavily on her shoulder. She turned her head, and found him sleeping. Torn, and terribly confused, she rose and fetched a blanket. Once she knew he was comfortable, she left.\\n\\n Gerard turned his head away when Barbara attempted to kiss him. Her perfume was cloying, a musky scent he had once found attractive and now found sadly lacking. His cock was rock hard and aching in her hand, his body responding to her expert ministrations despite his emotional and mental disconnections. She whispered shocking, depraved things in his ear, and then she straddled him, preparing to mount him.\\n\\n “I am so glad you came home, Grayson,” she breathed.\\n\\n Home.\\n\\n The word swirled through his head, and made his stomach clench tight. He had never had a home. As a child, his mother’s bitterness had poisoned everything around him. The only time he had felt relaxed and accepted was with Pel. That had changed with their new attraction, but he would do whatever was necessary to have that accord again.\\n\\n And his present encounter was not the way to go about it.\\n\\n This was not home. This was a hotel, and the woman preparing to fuck him was not his wife. Gripping her waist, Gerard turned quickly, tossing her to the bed next to him.\\n\\n Barbara squealed in delight. “Yes!” she cried. “I wondered when you would enter into the spirit of things.”\\n\\n Gerard thrust his hand between her legs, and stroked her to orgasm. He knew just what she liked, and where she liked it. Within moments Barbara was coming, and he was free to depart this sordid encounter.\\n\\n Releasing a frustrated breath, he rolled from the bed, refastened his trousers, and moved to the washstand in the corner.\\n\\n “What are you doing?” she purred, stretching like a cat.\\n\\n “Washing. Then leaving.”\\n\\n “No, you are not!” She sat up. With her flushed cheeks and pouty red mouth, she was lovely. But not at all what he wanted.\\n\\n “Sorry, sweet,” he said gruffly, scrubbing his hands in the basin. “I am not in the mood this evening.”\\n\\n “You lie. Your cock is hard as a poker.”\\n\\n Gerard turned, and collected his coat and waistcoat.\\n\\n Barbara’s shoulders slumped. “She’s old, Grayson.”\\n\\n “She is my wife.”\\n\\n “That never bothered you before. Besides, she has Hargreaves.”\\n\\n He stiffened, his jaw clenching.\\n\\n “Ah. A direct hit.” Her smile was as wicked as always. “Is she with him now? Is that why you came to me?” Spreading her legs, she leaned against the pillows and ran her hands between her thighs. “Why should she have all the fun? I can offer the same entertainments.”\\n\\n Buttoning the last button, Gerard moved to make his egress. “Good night, Barbara.”\\n\\n He was only a few feet down the hall when he heard something fragile shatter against the door. Shaking his head, he descended the stairs quickly, eager to go home.\\n\\n Comfortably ensconced in her own bedroom, Isabel dismissed Mary as soon as she had undressed. “But bring me some Madeira,” she murmured as the abigail curtsied.\\n\\n When she was alone, she sank into the wingback in front of the fire and thought of Hargreaves. This situation was so unfair to him. He had been good to her, she adored him, and she hated herself for being so confused. Her mother would say there was no monopoly on desire, and life had proved that to be true. The duchess would find nothing at all wrong with desiring two men at one time. Isabel, however, would always believe that a person should be strong enough to resist baser demands, if they cared enough.\\n\\n Several minutes later, a knock drew her attention to the open door, and she gestured the maid in. The servant balanced the bottle of Madeira and a glass on a tray in one hand. The other was loaded with towels.\\n\\n “What are those for?” Isabel asked.\\n\\n “Forgive me, my lady, Edward requested them for His Lordship’s bath.”\\n\\n Edward was Gray’s valet. It was nearly dawn. Her husband was bathing away the scents of his carnal exertions and she sat here, morose and guilty. Suddenly furious at the unfairness, she stood and collected the towels. “I will see to this.”\\n\\n The girl’s eyes widened, but she curtsied, and set down the bottle and glass before departing.\\n\\n Isabel crossed her boudoir to the dressing room and then, without any warning, opened the door to the bathing room. Gray lay in steaming water, his head resting against the lip of the tub with his eyes closed. He did not move at all when she entered, and she took a brief moment to absorb the sight of his dark chest and long, powerful legs. All of his beauty was visible through the clear water, including the impressive cock she had felt only briefly. She was instantly aroused, which further incited her temper. A narrow-eyed glance at Edward sent the valet fleeing from the room. \\n\\n","sourceLink":"https://allnovel.net/the-stranger-i-married-historical-2/page-11.html","bookId":2664,"book":{"id":2664,"title":"The Stranger I Married (Historical #2)","description":"Storyline: The Stranger I Married (Historical #2) \\n EVERY MARRIAGE HAS ITS SURPRISES... \\n Gray was beautiful before, four years ago when he asked Isabel to wed him in a marriage of convenience. Now there are no words to describe him. He is no longer a boyish rogue, not by any stretch of the imagination, but a tormented man, driven by secrets, silent about what he’s done since he disappeared. \\n Isabel knew how to handle the reckless youth he’d been, but this new husband of hers... this darkly passionate man is not tamable. Does she dare explore the places inside herself that Gray demands to possess? Does she trust him enough to bare herself completely to a lover who is an irresistible stranger?\\n","cover":"https://allnovel.net/images/the-stranger-i-married-historical-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-stranger-i-married-historical-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:56:57 AM"}}
