{"id":65325,"no":13,"title":"Page 13","content":"“Good grief. We just attended to that thing.”\n He shrugged, and bit back a smile as she continued to stare, her gaze blatantly appreciative and only slightly intimidated. Rising to his feet, he caught up her hand and tugged her back into the bathing chamber. “I cannot help but respond. You are quite simply a stunningly attractive woman.”\n Isabel snorted, but followed him without protest, although she lagged slightly behind. He glanced over his shoulder to see why, and caught her ogling his ass with a riveted gaze. She was too preoccupied to realize he’d taken note, so he flexed his buttocks and then laughed when she blushed. Whatever her objection to marital sexual intimacy, it was certainly not due to lack of interest in him.\n “Care to tell me about your night?” he asked solicitously, treading new ground. He was not accustomed to casual conversation in the middle of an amorous interlude. His fully engorged erection was not helping him concentrate either. Not that he could help it. His wife’s gaze was burning his skin.\n “Why?”\n “Because you are upset about it.” Gerard turned and pushed her into a chair, taking a moment to brush the lovely hair he so admired over her shoulders.\n “This is so awkward,” she complained, her arms crossing over her chest modestly as he reached into the tub and pulled out one of the soaked towels. “What are you doing?” she asked, watching him squeeze out the excess water.\n “I told you.” He dropped to a crouch before her, and with a hand on each knee, forced her legs apart.\n “Stop that!” Isabel slapped at his hands. He arched a brow and slapped her back, although with far more gentleness. “Brute,” she gasped with wide eyes.\n “Wench. Allow me to clean you up a bit.”\n Sherry-colored eyes shot fire at him. “You have done quite enough, thank you. Now leave me in peace, and I will care for myself.”\n “I haven’t even started,” he drawled.\n “Nonsense. You’ve had what you wanted. Let’s forget this happened, and go on as we were.”\n Gerard rocked back on his heels. “Had what I wanted, eh? Don’t be daft, Pel.” He shoved her clenched thighs apart and thrust the cloth between them. “I have yet to do the things I want. You have not been bent over a piece of furniture and fucked from behind. I have not sucked your nipples or your—” He ran the cloth gently through the lips of her sex, and then followed it with a teasing glide of his tongue, pausing a brief moment to tease her clitoris from its hood. “You have not been flat on your back and ridden properly. In short, we are nowhere near finished.”\n “Gray.” She surprised him by cupping his cheek with her hand. Her gaze was earnest and direct. And very hot. “We started this with a bargain. Let us end this with one.”\n His eyes narrowed in suspicion. “What kind of bargain?”\n “A pleasurable one. If I give you one night, and promise to do whatever you wish, will you in turn promise to keep to our original agreement from the morning onward?”\n His blasted cock raised its head in eager agreement, but Gerard was not so keen. “One night?” She was mad if she thought that would be enough for either of them. He was as hard at this moment as he had been before he’d come, she affected him that much.\n He returned his attentions to his ministrations, spreading her lips and cleaning her gently. She was lovely, flushed and glistening, and blessed with a dazzling frame of dark mahogany curls.\n Her fingers sifted through his hair, tugging it to draw his gaze back up to her face. Her fingertips glided over his features, following first the arch of his brows before caressing his cheeks, and then his lips. She seemed wearily resigned. “These lines around your eyes and mouth…they should age you, diminish your beauty. Instead, they do the opposite.”\n “It is not a bad thing to want me, Isabel.” He dropped the cloth, and embraced her waist, his face buried between her breasts where the scent of her was so strong. She was naked in his arms, and yet a barrier was between them. No matter how tightly he held her, he could not get close enough.\n Turning his head, he caught her nipple with his mouth, suckling, seeking intimacy. He licked the distended tip, stroked his tongue around it and relished the velvety softness. She moaned, her hands gripping his head, pulling him closer.\n He was aching for her, physically hurting. He released her breast, and caught her up. Her legs wrapped around his waist, her arms around his neck, and he grunted his approval at her longed-for acquiescence. His pace quickened as he walked straight through to his bedroom, a chamber he had stood in only hours before, despondent that he had changed rooms to be closer to Pel and had instead pushed her away.\n Now she would scent his sheets, warm his blood, and sate his hunger. As he set her down carefully on the bed, his throat tightened. Above her, the headboard displayed his crest, below her lay his red velvet counterpane. The thought of indulging in his wife’s charms in such a proprietary setting aroused him beyond bearing.\n “One night,” she murmured against his throat.\n Gerard shuddered, both from the feel of her breath across his skin, and from the realization that he could not take her as he truly desired. He would have to woo her with his body and show her how gentle he could be, because he had to change her mind and make her crave him.\n And she was giving him only one night in which to do it.\n Isabel sank into linen-covered pillows on Gray’s bed and noted again how much he had changed. He had once preferred silk sheets, she knew. What the change signified, she didn’t know, but she wanted to. She opened her mouth to ask, but he took it, his lips firm against hers, his tongue sweeping inside with a slow, deliberate glide. Moaning, she welcomed his weight over hers.\n He was hard all over, every inch of his golden skin stretched taut over rippling muscle. In all of her life, she had never seen a masculine body as beautifully formed as her husband’s. Considering that Pelham had been exquisite in his own right, it was not a compliment she bestowed lightly.\n “Pel.” Gray breathed into her mouth, a low seductive burr of sound. “I am going to lick you all over, kiss you everywhere, make you come all night.”\n “And I will do the same to you,” she promised, her tongue swiping soothingly across his damaged lower lip. Having decided on the goal of exhausting their mutual lust, she was now prepared to give her all to the endeavor.\n Pulling away slightly to look at her, Gray gave her the opportunity she needed to take the upper hand. She hooked her heel over the back of his calf, and rolled, rising above him. Then she laughed when he rolled again and reclaimed the advantage.\n “Oh no, vixen,” he chastised, staring down at her with laughing blue eyes. “I gave you the top previously.”\n “I did not hear you complaining at the time.”\n His mouth twitched with a withheld smile. “It was over so quickly I didn’t have a chance to protest.”\n She arched a brow. “I think you were simply speechless with pleasure.”\n Gray laughed aloud, the sound teasing her as it vibrated from his chest to hers. Her nipples peaked tighter in response. The lowering of his lids told her he noticed.\n “Whatever I wish,” he reminded, as he moved his hand down to lift her leg and spread her wide. With a roll of his hips, the tip of his cock breached her, forced her to open, the size of him almost uncomfortable but highly tantalizing.\n Immediately she melted, her cunt softening, growing slick, crowning the broad head of his cock with her cream. Her toes curled, and her chest grew tight. He smelled wonderful, the bergamot that scented his soap diminished by the primitive scent of his sweat and the recent bout of sex.\n “Gray.” His name was both a request for more and a plea for less. She didn’t know how to fight the sudden feeling of connection. In the years since Pelham had passed on, sexual congress had been about gratification, satiation. This, on the other hand, was pure surrender.\n His large hands slipped beneath her shoulders, his forearms holding his weight aloft enough to prevent crushing her. “You are handing Hargreaves his congé.”\n It was a statement, an order, and while she wished she could argue with him just for his arrogance, she knew he was right. To be so attracted to Gray was proof that her interest was not as engaged by John as it once had been.\n Still the knowledge saddened her, and she turned her head to hide her stinging eyes.\n Gray brushed his mouth across her cheekbone, and pressed a scant inch into her. She groaned and arched upward, eager to forget her hazardous decision to indulge.\n “I can make you happy,” he promised against her skin. “And you will never lack pleasure, I can assure you of that.”\n Perhaps he could make her happy, but she could not do the same for him, and once he strayed, contentment would rapidly deteriorate into misery.\n She wrapped her legs around his hips and pulled herself upward from the mattress, slowly engulfing his cock. Her eyes slid closed, her focus shifting to her blossoming enchantment with Grayson’s lovemaking. He was so long, so thick. No wonder his mistresses tolerated his indiscretions. He would be hard to replace.\n “Do you prefer a slow fucking, Pel?” he asked in a strangled whisper, his arms trembling as he sank in a bit more. “Tell me what you like.”\n “Yes…Slow…” Her voice was slurred, her nails digging into his broad back. She liked it any way and every way, but was rapidly losing the ability to think coherently.\n She sank downward as he took over, his buttocks clenching as he slowly worked his way into her. Despite his recent penetration, her cunt forced him to earn the right to enter again. His cock pushed in and pulled out in a steady rhythm, every downward plunge taking him a little bit deeper.\n Sweat from him dripped onto her throat and chest. “God, you are tight,” he groaned.\n She flexed her inner muscles just to increase his torment.\n “Push me too far and you will regret it,” he warned darkly. “I don’t want to come in you, but I won’t stop. Not for any reason. You gave me one night, and I am damn well taking it.”\n Isabel shivered. I won’t stop. He would take her whether she willed it or no. The thought aroused her, as evidenced by the sudden rush of cream that allowed him to sink home in one deep glide.\n “Open wider.” His lips touched her ear. “Take all of me.”\n She was already so full it was hard to breathe, but she shifted slightly and he slipped in to the root.\n “Beautiful,” he praised, nuzzling his damp cheek against hers. “Now we can go as slow as you like.”\n Beginning to move, Gray took her with breathtaking leisure, moving in deliberate undulations of his entire body—his chest flexing against hers, his thighs buffeting hers, his fingers kneading almost restlessly against the tops of her shoulders.\n She fought the sounds that struggled to be freed until she was unable to bear it any longer, her head tilting back on a plaintive whimper.\n “That’s the way,” he encouraged, his voice gravelly and strained. “Let me hear how much you like it.” He swiveled his hips and thrust, stroking her deep inside. She was so wet it was audible and she cried out, raking his back. He arched into her touch, and ground into her. “My God, Isabel…”\n She matched his tempo, throwing her hips upward as he came down, the tip of his cock striking some tender spot she hadn’t known existed. She mewled and writhed, growing desperate at his steady pace. “More…Give me more…”\n Gray rolled to his side, and anchored her thigh on his hip, the tight roping of his abdominal muscles rippling as he pumped harder, not faster, his pelvis slapping against hers. The position was intimate, their bodies pressed together, their faces just inches from each other. Their panting breaths mingled between them as they strained in unison toward their mutual goal. One bicep pillowed her head, one large hand cupped her buttock holding her in place to take his thrusts. His bright blue gaze stared at her, glittering with his lust, his jaw locked and teeth grinding together. He looked like he was in pain, his cock rigid and impossibly thick.\n “Come,” he grit out. “Come now!”\n The harsh bite of command in his tone was a delicious threat, one that shoved her off the edge with brutal force. She cried out, nearly screamed, her orgasm so powerful her entire body shook with each clenching spasm.\n His fingers dug into her, bruising her, his cock slamming deep. Only when she was finished did he pull out, shoving her leg off his hip so he could fuck through her closed thighs. She held still, awed as he came, his cock jerking between her legs, each pulse met with a grunt, his open lips pressed to her forehead.\n Even as Gray emptied himself onto the counterpane, she knew she was ruined. She wanted this, longed for this depth of feeling during sex.\n She hated him for reminding her of what it could be like, of what she was missing, of what she had avoided for the last several years. He had given her an addicting taste of what he would soon take away.\n Already she missed it, and ached for its loss.\n It was the sounds of industrious servants in the bathing chamber that first raised Gerard’s eyelids, but it was the scent of sex and exotic flowers that raised the rest of him. With a soft grumble at the intrusion, he took a quick inventory of his present circumstance.\n His left arm was asleep from acting as a pillow for Pel’s head. He lay sprawled on his back, his wife’s buttocks against his hip, her back curved into his side. She wore a sheet, he was bare. He had no notion of what time it was, and it did not matter. He was still tired, and if the sound of Isabel’s soft snoring was any indication, she was too.\n He had been having his way with her for hours, his need slaked only slightly with each successive encounter. Even now his cock stuck straight up in the air, aroused by the feel and smell of her. Although he was exhausted, he knew there would be no sleep with an erection like he had. He rolled into Pel, casting off the sheet that covered her with his working arm and lifting her leg over his. Using gentle fingers, he reached between her legs, cupping her sex, feeling how swollen she was. \n","sourceLink":"https://allnovel.net/the-stranger-i-married-historical-2/page-13.html","bookId":2664,"book":{"id":2664,"title":"The Stranger I Married (Historical #2)","description":"Storyline: \n The Stranger I Married (Historical #2) \n EVERY MARRIAGE HAS ITS SURPRISES... \n Gray was beautiful before, four years ago when he asked Isabel to wed him in a marriage of convenience. Now there are no words to describe him. He is no longer a boyish rogue, not by any stretch of the imagination, but a tormented man, driven by secrets, silent about what he’s done since he disappeared. \n Isabel knew how to handle the reckless youth he’d been, but this new husband of hers... this darkly passionate man is not tamable. Does she dare explore the places inside herself that Gray demands to possess? Does she trust him enough to bare herself completely to a lover who is an irresistible stranger?\n \n","cover":"https://allnovel.net/images/the-stranger-i-married-historical-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-stranger-i-married-historical-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:56:57 AM"}}
