{"id":65333,"no":21,"title":"Page 21","content":"“I endeavor to make myself useful to beautiful women as often as possible.”\\n\\n “How fortunate for Lady Grayson to have two such dashing Faulkner men at her beck and call.”\\n\\n His arm stiffened beneath her gloved touch and she could not hold back her smile. Something was amiss in the Grayson household, a circumstance that could only work to her advantage. She would have to ply the youngest Faulkner with her wiles to discover what the issue was, but that was a prospect she found most appealing.\\n\\n With a quick glance over her shoulder to be certain Hargreaves had gone to Isabel Grayson, Barbara wiggled her shoulders in anticipation and determined to enjoy the rest of Lord Spencer’s evening.\\n\\n “Isabel.”\\n\\n John halted a discreet distance away. His gaze raked her from head to toe, taking in the pearls weaved through her auburn tresses and her lovely dark green gown, the deep color of which set off her creamy porcelain skin to perfection. Her three-strand choker of pearls did an admirable job of attempting to hide the faint bruising around her neck, but he took note of it nevertheless. “Are you well?”\\n\\n Her smile was both fond and sad. “As well as can be expected.” She canted her body toward him. “I feel dreadful, John. You are a good man who deserved to be treated better than I have treated you.”\\n\\n “Do you miss me?” he dared to ask.\\n\\n “I do.” Her amber gaze met his directly. “Though perhaps not in the way that you might miss me.”\\n\\n His mouth curved. As always, he admired her candor. She was a woman who spoke without artifice. “Where is Grayson this evening?”\\n\\n Her chin lifted slightly. “I will not discuss my husband with you.”\\n\\n “Are we no longer friends, then, Pel?”\\n\\n “We certainly will not be if your aim is to pry into my marriage,” she snapped. And then she blushed, her gaze dropping.\\n\\n He opened his mouth to apologize, then stopped. Isabel’s ill-humor had grown more and more frequent as their affair progressed. He now began to wonder if their relationship had been winding down prior to Grayson’s return and he had simply been too dense to realize it.\\n\\n Releasing a deep breath, he attempted to turn his thoughts inward in consideration of this possibility. However, a sudden disturbance and Pel’s subsequent stiffness beside him drew his attention. He looked up and found the Marquess of Grayson standing across the room. Grayson’s gaze was first riveted on Isabel, then it moved to rest on him.\\n\\n Chilled by that stare, John shivered. Then Grayson turned away.\\n\\n “Your husband has arrived.”\\n\\n “Yes, yes. I know. Excuse me.”\\n\\n She had already traveled a short distance from him when he remembered Barbara’s plan. “I will escort you to the terrace, if you like.”\\n\\n “Thank you,” she replied with a nod that set her fiery curls in motion. He had always loved her hair. The combination of dark chocolate and reddish glints was striking.\\n\\n The sight of it was almost enough to distract him from the icy blue gaze piercing between his shoulder blades.\\n\\n Almost.\\n\\n “Grayson!”\\n\\n Gerard stared after his wife and tried to discern her disgruntlement. She was quite obviously put out by something he’d done, though he had no notion of what it could be. However, he was not surprised. Aside from his afternoon of wondrously satisfying bedsport, the rest of his day had been hellish.\\n\\n He heaved a sigh and turned away. “Yes, Bartley?”\\n\\n “It appears your brother was serious when he mentioned coming here. He arrived over an hour past and according to the footman stationed at the door, he has yet to depart.”\\n\\n Looking back over the crush, Gerard failed to see Spencer anywhere, but he watched as Isabel stepped onto a crowded outer terrace with Hargreaves. He wished he could speak with her, but he’d learned it was best to tackle one problem at a time, and Spencer was the graver issue at the moment. He trusted Pel. He could not say the same for his hotheaded brother.\\n\\n “I shall start with the card room,” he murmured, grateful to have run into Bartley as the man was exiting Nonnie’s Tavern. This ball was the last place he would have searched for Spencer.\\n\\n “Is that not Hargreaves with Lady Grayson?” Bartley asked, scowling.\\n\\n “Yes.” Gerard turned away.\\n\\n “Should you not say something to him?”\\n\\n “What would I say? He is a good man and Isabel a sensible woman. Nothing untoward will happen.”\\n\\n “Well, even I know that,” Bartley said with a laugh. “And how like you not to pay any mind. But if you are serious about courting your wife, I would suggest at least the pretense of jealousy.”\\n\\n Gerard shook his head. “Ridiculous. And I am certain Pel would say the same.”\\n\\n “Women are odd creatures, Gray. Perhaps there is something about the fairer sex I know that you do not,” Bartley chortled.\\n\\n “I doubt that.” Gerard moved away to find the card room. “You say my brother was only slightly out of sorts?”\\n\\n “So it seemed to me. However, he is certainly aware of my friendship with you. That might have sufficed to keep his mouth shut on the matter.”\\n\\n “One can only hope he showed such discretion all evening.”\\n\\n Bartley followed fast on his heels. “What will you do when you find him?”\\n\\n Gerard came to a halt, easily absorbing the impact of Bartley against his back.\\n\\n “What the devil?” Bartley mumbled.\\n\\n Turning, Gerard said, “The search will progress far more swiftly if we part ways.”\\n\\n “Won’t be near as fun.”\\n\\n “I am not here to have fun.”\\n\\n “How will I find you, if I manage to find him?”\\n\\n “You will manage, clever chap that you are.” Gerard continued on, leaving Bartley behind. The starch in his cravat was chafing, Pel was close and yet so far away, the upcoming confrontation with his brother weighed heavily…Altogether, his mood was not the most charitable.\\n\\n And as his search lengthened, his mood only grew worse.\\n\\n Isabel stepped onto the crowded balcony and attempted to ignore how Grayson’s cut had wounded her. She thought it would be a difficult task, but as she spied a familiar head of graying hair, her thoughts were immediately directed elsewhere. She sighed. Releasing Hargreaves, she said, “We should part ways now.”\\n\\n Following her gaze, he nodded and quickly retreated, leaving her to make her approach to the Dowager Countess of Grayson. The older woman met her halfway and linked arms, leading her away from the other guests.\\n\\n “Have you no shame?” the dowager whispered.\\n\\n “Do you truly expect me to reply?” Isabel retorted. Four years and she still had not learned to tolerate the woman.\\n\\n “How a woman of your breeding can show so little concern for the title she bears is beyond my collection. Grayson has always done his best to irritate me, but marriage to you is beyond the pale.”\\n\\n “Can you please find something new to harp about?” Shaking her head, Isabel pulled away. Now that they were no longer in sight of anyone, the pretense of familiarity could be dropped. The dowager’s fervent desire to maintain the esteem of the Grayson name and lineage was understandable, but the manner in which she sought to achieve her aim was not one Isabel could champion.\\n\\n “I will see him rid of you before I take my last breath.”\\n\\n “Good luck,” Isabel muttered.\\n\\n “I beg your pardon?” The dowager drew herself up.\\n\\n “I have spoken to Grayson about separation many times since his return. He refuses.”\\n\\n “You have no wish to be married to him?” The dowager’s complete astonishment would have amused Isabel if she were less distressed over Gray’s behavior since leaving her bed. To be set aside so easily…To be ignored so directly…To have trusted a man who lied to her…\\n\\n It hurt, and she had promised herself that no man would ever hurt her again.\\n\\n “No, I do not.” She lifted her chin. “The reasons for our marriage seem foolish and ill-conceived now. I’m certain they always have been and we were both too obstinate to take note.”\\n\\n “Isabel.” The dowager pursed her lips and fingered her weighty sapphire necklace with a narrowed, thoughtful glance. “You are serious?”\\n\\n “Yes.”\\n\\n “Grayson insists that a petition for divorce will meet with failure. In any case, the scandal will be dreadful for all.”\\n\\n Tugging off one of her long gloves, Isabel reached out and fingered the petals of a nearby rose. So Gray had been considering severing their bond. She should have known.\\n\\n How unfortunate for her that she was a woman who relished the companionship of others. She thrived on it. Perhaps if she did not, she would not feel such a need to be held and cared for, and she would not be in this position now. Many women abstained. She could not.\\n\\n She sighed. The censure heaped on them for a divorce petition would be devastating, but how much more devastating would marriage to Grayson be? She’d nearly been destroyed by her last spouse and her attraction to the man Gray had become was just as powerful as what she had once felt for Pelham.\\n\\n “What do you want me to say?” she asked bitterly. “That I am prepared for and accepting of a future as a woman divorced for adultery? I am not.”\\n\\n “But you are resolved, I can see it in the set of your shoulders. And I will help you.”\\n\\n Isabel turned at that. “You will what?”\\n\\n “You heard me.” A slight smile softened the dowager’s harshly drawn mouth. “I am not sure how I will help you. I only know that I will, in whatever manner I can. Perhaps I will even see you well settled.”\\n\\n Suddenly, the events of the day were too much for Isabel. “Excuse me.” She would find Rhys and ask him to escort her home. Faulkner scratches wounded her on all sides, and she wished for her room and a decanter of Madeira more than she wished for her next breath.\\n\\n “I shall be in touch, Isabel,” the dowager marchioness called after her.\\n\\n “Lovely,” she muttered, speeding up her steps. “I cannot wait.”\\n\\n Frustrated by his lack of success in finding Spencer, Gerard was about to do violence to someone, when he turned a corner and came to an abrupt halt, his way blocked by a woman backing out of a dark room.\\n\\n She turned and jumped. “Good heavens,” Lady Stanhope cried, her gloved hand sheltering her heart. “You frightened me, Grayson.”\\n\\n He studied her with an arched brow. Flushed and slightly disheveled, she was obviously fresh from some assignation. When the door opened again and Spencer stepped out with crumpled cravat, Gerard’s other brow rose to match the first. “I have been looking for you for hours.”\\n\\n “You have?”\\n\\n His brother was clearly far more relaxed than he had been earlier. Intimately familiar with Barbara’s sexual appetite, Gerard was not surprised. He smiled. This was exactly how he had hoped to find Spencer.\\n\\n “I would like to speak with you.”\\n\\n Spencer straightened his coat and shot a glance at Barbara, who hovered. “Tomorrow perhaps?”\\n\\n Studying him carefully, Gerard asked, “What are your plans for this evening?” He would not wait if his brother was still intent on some trouble.\\n\\n Another pointed glance at Barbara settled Gerard’s worries. If Spencer was fucking, he would not be fighting. “Breakfast in my study, then.”\\n\\n “Very well.”\\n\\n Lifting Barbara’s bare hand to his lips, Spencer sketched an elegant bow and moved away, most likely to arrange their departure.\\n\\n “I will be along in a moment, darling.” Barbara’s eyes remained locked on Gerard.\\n\\n When they were alone, he said, “I am grateful for your association with Lord Spencer.”\\n\\n “Oh?” She made a moue. “A tiny flare of jealousy would be welcome, Grayson.”\\n\\n He snorted. “There is nothing between us to warrant jealousy, and there never has been.”\\n\\n Her hand came up to rest against his abdomen, her green eyes sparkling mischievously through her lashes. “There could be, if only you would warm my bed again. Although our liaison the other evening was lamentably short, it reminded me of how beautifully you and I suit each other.”\\n\\n “Ah, Lady Stanhope,” Pel said tightly behind him. “Thank you for locating my husband for me.”\\n\\n Gerard did not have to turn around to know that his evening had, impossibly, taken a turn for the worse.\\n\\n As the obviously rumpled countess moved away, Isabel stood silently, her fists clenched. Grayson eyed her warily, his powerful frame tense with expectation while she considered what she wanted to do. She had once fought hard for Pelham, and the effort had been draining and pointless. Husbands lied and strayed. Practical wives understood this.\\n\\n With her heart encased in the icy shell she had learned to rely on, she simply turned her back to Gray with the intent to leave—the ball, his house, him. In her mind she was already packing, her brain quickly sorting through her belongings.\\n\\n “Isabel.”\\n\\n That voice. She shivered. Why must he have that raspy bedroom voice that dripped lust and decadence?\\n\\n Her steps did not falter, and when he caught her elbow to stay her egress, her thoughts shifted to her previous home and how all of her furniture would be sadly out of date.\\n\\n Gray’s gloved hand cupped her cheek. Forced her gaze to meet his. She registered blue eyes of a striking color and thought of her parlor settee, which was of a similar tone. She would have to throw it out.\\n\\n “Christ,” he muttered harshly. “Don’t look at me like that.”\\n\\n Her gaze dropped to where his large hand gripped her forearm.\\n\\n Before she realized it, he had pulled her into a dark room that reeked of sex and closed the door behind them. Her stomach roiled, and feeling the overwhelming urge to flee, she hurried across the moonlit space toward a room on the other side. It was a library where windowed doors led outside. There she paused and leaned her hands upon the back of a leather wingback chair, sucking in deep breaths of untainted air. \\n\\n","sourceLink":"https://allnovel.net/the-stranger-i-married-historical-2/page-21.html","bookId":2664,"book":{"id":2664,"title":"The Stranger I Married (Historical #2)","description":"Storyline: The Stranger I Married (Historical #2) \\n EVERY MARRIAGE HAS ITS SURPRISES... \\n Gray was beautiful before, four years ago when he asked Isabel to wed him in a marriage of convenience. Now there are no words to describe him. He is no longer a boyish rogue, not by any stretch of the imagination, but a tormented man, driven by secrets, silent about what he’s done since he disappeared. \\n Isabel knew how to handle the reckless youth he’d been, but this new husband of hers... this darkly passionate man is not tamable. Does she dare explore the places inside herself that Gray demands to possess? Does she trust him enough to bare herself completely to a lover who is an irresistible stranger?\\n","cover":"https://allnovel.net/images/the-stranger-i-married-historical-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-stranger-i-married-historical-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:56:57 AM"}}
