{"id":65344,"no":32,"title":"Page 32","content":"“Lady Ansell is barren?” “Yes, her physician says the state is due to her advanced years.” He shook his head in sympathy. “Unfortunate for them that Ansell is an only child, so the burden rests entirely upon their shoulders.” Taking a large swallow, he considered his own good fortune in having siblings. “You and I will never face that strain.” “I suppose not.” There was something in her tone that made his stomach clench in apprehension, but he hid the reaction by keeping his back to her and his tone casual. “Are you considering pregnancy?” “Did you not say that you wished to build something lasting? What is more lasting than lineage?” “Having two brothers negates that concern somewhat,” he said carefully, fighting off the sudden tremor that moved him. The mere thought of Isabel increasing struck terror in him like he had never known. His hand shook so badly, the liquor in his glass sloshed precariously. He was only grateful that she could not see his upset from her vantage behind him. Emily. Her death and the death of their child had very nearly destroyed him, and he had not loved Em like he loved Isabel. If something were to happen to his wife, if he should lose her… He squeezed his eyes shut and forced his grip to relax before he shattered the goblet. “Does it negate your wish to have issue?” she asked behind him. He heaved out his breath. How in hell was he to respond to that? He would give up everything to have a family with her. But he would not give her up. Though the possible result would be bliss, the risk innate in that possibility was agonizing even to contemplate. “Is there a rush?” he asked finally, turning to meet her gaze to search for the strength of her resolve. She sat nearby, her back ramrod straight, her legs crossed primly, her gown draped loosely about her shoulders and slightly gaping between the breasts. The perfect dichotomy of impeccable breeding and carnal seduction. Perfect for him. Irreplaceable. She shrugged, which relieved him immeasurably. She was making conversation, nothing more. “I was not implying a need for haste.” Waving his hand in deliberately careless fashion, Gerard affected a complete lack of concern and changed the subject. “I hope you enjoy Waverly Park. It is the closest of my residences to London and one of my favorites. Perhaps, if you agree, we can arrange to spend more time there.” “That would be wonderful,” she agreed. There was a distance fraught with tension between them, such as two fencers would experience while circling one another. He could not bear it. “I would like to retire now,” he murmured, studying her over the rim of his goblet. There was never any distance between them in bed. A faint hint of a smile teased her mouth. “You suffer no weariness after tramping through hedges?” “No.” He moved toward her with obvious purpose. Her eyes widened and the ephemeral curve of her lips turned into the come-hither grin of a siren. “How delicious.” “Would you like to nibble on me?” He set the glass on a tabletop as he passed it. Isabel laughed as he caught her about the waist. “You do realize that I always know when you have an ulterior motive?” She followed the curve of his brows with her fingertips. “You have the devil in your eyes when you are attempting to distract me.” He kissed the tip of her nose. “Do you mind, vixen?” “No. I would indeed love to nibble on you.” Her expert fingertips deftly loosened and then parted his robe. “There is so much to tempt me. I cannot decide where to begin.” “Are you soliciting suggestions?” Running her fingertips lightly down the center of his chest, she tilted her head to the side as if pondering and said, “That is not necessary.” His cock rose up. “I think it’s plain which part of you is the most eager for my touch.” Every cell in his body, though tensed in expectation, sighed with satisfaction at her nearness. It always had. Being with Isabel made the world around him a better place, as maudlin as others would find that sentiment. Her lips, so plump and hot, pressed against his neck, her tongue flicking out to taste his skin. “Ummm…” She hummed the pleasure she found with him, her hands sliding beneath his robe to caress his back. “Thank you for the rose. I have never had a rose picked by hand just for me.” “I would pick a hundred for you,” he said gruffly, the memories of thorn pricks and muttered curses fading into obscurity. “A thousand.” “My darling. One is more than enough. It’s perfection.” Everywhere she touched him heated and grew hard. No one else in his life had loved him like this. He felt it in her fingertips, in the brush of her breath across his flesh, in the way she trembled and grew aroused merely looking at him. Her tiny hands were everywhere, stroking, kneading. She loved the hard ridges of his muscles, despite how unfashionable they were. She licked down his chest, taking tiny bites with her teeth, arousing him so fully that cum beaded up on the head of his cock and then slid down the upthrust length. As Pel dropped to her knees, she followed the glistening trail with her tongue, making him shudder and groan. “Your mouth would ruin a saint,” he growled, thrusting his fingers into her fiery tresses. Staring down at her, he watched as she gripped the base of his shaft and angled him down to her waiting mouth. “What does it do to a man who is far from saintly?” Before he could catch his breath to reply, she’d engulfed the straining tip in burning, liquid heat. His eyelids grew heavy, his breathing labored as she suckled him between those lush, ripe lips. He swelled in response to the steady, rhythmic pulls, sweat beading along his pores as the flush of pure lust swept across his flesh. None of the women in his past who had serviced him in this manner could compete with his wife. For Isabel it was not a duty or a prelude to sex. For her it was a joy in and of itself, something she enjoyed as much as he. Something that heated her skin, soaked her sex, beaded her nipples. She moaned along with him, worshipped him with her tongue, fondled the hardened cheeks of his ass. She loved him. The skin of his cock was dry and stretched tight where he could not fit. The weight of his balls drew up, ready to spurt the gift of life he would never give her. It was this last thought that urged him to finish in her eager mouth. Isabel loved it when he came in that fashion, loved to feel him quiver on unsteady legs and cry out her name. But she also loved it when he was hard and thick like this. Loved how deeply he could stroke inside her, and right now that was where he needed to be—connected with her. From now until death parted them, they would have only each other. She was all he needed. He hoped she felt the same about him. “No more.” Pushing her head away, he stepped back from temptation, his cock an angry red and jerking in frustration. Isabel pouted her protest. Gerard stepped backward, sinking onto the settee she had recently risen from, and gesturing impatiently for her to join him. Shrugging out of her dressing gown, she did just that, approaching him in a cloud of flame-touched tresses and seductively swaying hips. Then she climbed over him, straddling him, her hands on his shoulders, her full breasts swaying before his eyes. Consumed with fever for her, he buried his face in the fragrant valley between her breasts, pulling the scent of her into his blood with deep desperate breaths. “Gerard,” she crooned, her fingers drifting into his damp hair and massaging the roots. “How I adore you.” Incapable of speech, he turned his head and ran his tongue across her nipple before closing his lips and suckling her, taking from her all the sustenance his soul needed. She gasped, a sound tinged with pain, and he cupped the warm undercurve and lifted, to make it more comfortable for her. Then he noted how heavy her breast was, and tender, if her sharp whimper was any indication. He’d come in her! The sudden flare of panic he felt nearly unmanned him. If not for Pel choosing that moment to sink her drenched cunt around his cock, he might have lost his erection altogether, which had never happened to him in his twenty-six years. “Have I hurt you?” he managed, keeping his head lowered to hide his horror. Surely it was too soon…It couldn’t be… Isabel hugged him closer and began to move, mewling softly as she stroked deep inside herself with the hard length of him. “My courses approach,” she gasped. “It’s nothing.” The relief that flooded him was so powerful, he had to remember to breathe, every muscle drained by the receding tide of terror. He held his wife’s straining body to his, biting his lip to keep some semblance of control as she undulated against him in perfect rhythm. Their bodies fit perfectly, as did their personalities, their tastes, their likes and dislikes. And she loved him. He knew that like he knew nothing else—with bone-deep clarity and assurance. For all that he was, with all of his faults and failings, she adored him anyway. She had given him joy when he had been certain there was no more joy to be had. If he lost her… He would die. “Isabel.” His hands rested on either side of her spine, absorbing the feel of her slender muscles flexing with her exertions. Up and down, she worked their bodies with an understanding of what pleased him as only a woman who loved him would know. It made their joining more than sex, more than carnal gratification. “Slide a little lower,” she instructed, urging him to alter the cant of his hips. “Right there.” Pel sank deep onto him, the slick lips of her cunt encircling the very root of his cock. “Ohhhh…” She tightened around him deliciously, and lust singed its way up his spine, making him arch away from the damask embroidered settee back and into her. “Ah, Christ!” “That’s it,” she praised, her nails biting into the flesh of his shoulder. “Enjoy the ride.” “Pel,” he managed, gasping with fear. “I can’t last.” He could not spill in her again… She rose and fell with such grace, her curvy body lithe and filled with quiet feminine strength. She was so tight, so hot and drenched, he knew he was losing his mind just as he had lost his heart. “Come,” he bit out, clutching her hips and thrusting madly into her. A silken fist. A burning glove. “Come, damn you!” Gerard yanked her down as he ground upward, listening as she gave a thready cry, watching as her head fell back, feeling her clench tight around him and then milk his tortured cock with the same rhythmic suckling as he had felt in her mouth. The moment she rested limp against his chest he withdrew, catching his cock in hand and pumping, spurting his seed outside of his wife. Agonized, he pressed his cheek to her heart, listening to the rapid, passionate beat as he hid his tears in the exotic floral sweat that pooled between her breasts. Chapter 19 For Isabel, the ride to Waverly was a lovely one, despite the presence of her mother-in-law. The pride with which Gray brought attention to and explained various landmarks was obvious. It deepened their growing bond to share this day and this place, to build these memories. She listened with rapt attentiveness as he spoke in his raspy voice, watching the light in his eyes and the animation of his features. How different he was from the young, jaded man who had left her side so long ago. That man had died with Emily. The husband she had now was entirely her own and had never given his heart to another. And though he had not yet said it aloud, she suspected he loved her. The knowledge made her day brighter, her mood lighter, her steps surer. Certainly with love between them, they could conquer any difficulties. True love meant accepting a person with all their faults. Isabel couldn’t help but hope that Grayson would love her in spite of hers. As the carriage rolled to a stop before the Waverly Park manse, Isabel drew herself up and prepared to meet the staff. Today the formality held new significance. In the past, she had not truly felt like Grayson’s marchioness, and while she had no trouble assuming the authority of the station she was bred for, it had not previously given her the sense of satisfaction it gave her now. Over the course of the next few hours, she toured the manse with the efficient housekeeper and took note of the deference paid to Gray’s mother, who appeared to have no trouble praising the servants for a job well done, despite her difficulty in doing the same for her sons. Still, the dignified compliments the dowager paid to the staff for remembering certain tasks impeded the passing of the reins to Isabel. When they were done, she and the dowager sat in the upstairs family parlor for tea. The room, though slightly dated in its décor, was lovely and soothing with shades of deep gold and pale yellow. They managed to hold a civilized conversation regarding the nuances unique to running that particular household. Briefly. “Isabel,” the dowager said, in a tone that made her tense. “Grayson seems determined to establish you in all ways as his marchioness.” Lifting her chin, Isabel replied, “I am equally determined to fulfill that role to the best of my abilities.” “Including discarding your lovers?” “My private affairs are none of your concern. However, I will say that my marriage is solid.” “I see.” The dowager gifted her with a smile that did not reach her eyes. “And Grayson is not disturbed by the prospect of lacking an heir from his own loins?” Isabel paused with a piece of buttered scone lifted halfway to her mouth. “Beg your pardon?” Gray’s mother narrowed her pale blue eyes and studied her over the rim of her flowered teacup. “Grayson makes no objection to your refusal to bear him children?” “I am curious as to why you believe I do not want children.” “Your years are advanced.” “I know my age,” Isabel said curtly.","sourceLink":"https://allnovel.net/the-stranger-i-married-historical-2/page-32.html","bookId":2664,"book":{"id":2664,"title":"The Stranger I Married (Historical #2)","description":"Storyline: The Stranger I Married (Historical #2) EVERY MARRIAGE HAS ITS SURPRISES... Gray was beautiful before, four years ago when he asked Isabel to wed him in a marriage of convenience. Now there are no words to describe him. He is no longer a boyish rogue, not by any stretch of the imagination, but a tormented man, driven by secrets, silent about what he’s done since he disappeared. Isabel knew how to handle the reckless youth he’d been, but this new husband of hers... this darkly passionate man is not tamable. Does she dare explore the places inside herself that Gray demands to possess? Does she trust him enough to bare herself completely to a lover who is an irresistible stranger?","cover":"https://allnovel.net/images/the-stranger-i-married-historical-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-stranger-i-married-historical-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:56:57 AM"}}
