{"id":77628,"no":26,"title":"Page 26","content":"\u0027Aye aye, Cap\u0027n,\u0027 said Quarrel. \u0027You jes leave \u0027em all to me.\u0027\n He went out.\n Bond looked at the whisky bottle, then he made up his mind and poured half a glass on top of three ice cubes. He took the box of benzedrine tablets out of his pocket and slipped a tablet between his teeth.\n \u0027Here\u0027s luck,\u0027 he said to Strangways and took a deep swallow. He sat down and enjoyed the tough hot taste of his first drink for more than a week. \u0027Now,\u0027 he said,\u0027 tell me exactly what they do when they\u0027re ready to sail. How long it takes them to clear the island and get through the reef. If it\u0027s the last time, don\u0027t forget they\u0027ll be taking off an extra six men and some stores. Let\u0027s try to work it out as closely as we can.\u0027\n In a moment Bond was immersed in a sea of practical details and the shadow of fear had fled back to the dark pools under the palm trees.\n Exactly at ten o\u0027clock, with nothing but anticipation and excitement in him, the shimmering black bat-like figure slipped off the rocks into ten feet of water and vanished under the sea.\n \u0027Go safely,\u0027 said Quarrel to the spot where Bond had disappeared. He crossed himself. Then he and Strangways moved back through the shadows to the house to sleep uneasily in watches and wait fearfully for what might come.\n CHAPTER XIX\n VALLEY OF SHADOWS\n BOND was carried straight to the bottom by the weight of the limpet mine that he had secured to his chest with tapes and by the leaded belt which he wore round his waist to correct the buoyancy of the compressed-air cylinders.\n He didn\u0027t pause for an instant but immediately streaked across the first fifty yards of open sand in a fast crawl, his face just above the sand. The long webbed feet would almost have doubled his normal speed if he had not been hampered by the weight he was carrying and by the light harpoon gun in his left hand, but he travelled fast and in under a minute he came to rest in the shadow of a mass of sprawling coral.\n He paused and examined his sensations.\n He was warm in the rubber suit, warmer than he would have been swimming in the sunshine. He found his movements very easy and breathing perfectly simple so long as his breath was even and relaxed. He watched the tell-tale bubbles streaming up against the coral in a fountain of silver pearls and prayed that the small waves were hiding them.\n In the open he had been able to see perfectly. The light was soft and milky but not strong enough to melt the mackerel shadows of the surface waves that chequered the sand. Now, up against the reef, there was no reflection from the bottom, and the shadows under the rocks were black and impenetrable.\n He risked a quick glance with his pencil torch and immediately the underbelly of the mass of brown tree-coral came alive. Anemones with crimson centres waved their velvet tentacles at him, a colony of black sea-eggs moved their toledo-steel spines in sudden alarm and a hairy sea-centipede halted in its hundred strides and questioned with its eyeless head. In the sand at the base of the tree a toad-fish softly drew its hideous warty head back into its funnel and a number of flower-like sea-worms whisked out of sight down their gelatinous tubes. A covey of bejewelled butterfly and angel fish flirted into the light and he marked the flat spiral of a Long-spined Star Shell.\n Bond tucked the light back in his belt.\n Above him the surface of the sea was a canopy of quicksilver. It crackled softly like fat frying in a saucepan. Ahead the moonlight glinted down into the deep crooked valley that sloped down and away on the route he had to follow. He left his sheltering tree of coral and walked softly forward. Now it was not so easy. The light was tricky and bad and the petrified forest of the coral reef was full of culs-de-sac and tempting but misleading avenues.\n Sometimes he had to climb almost to the surface to get over a tangled scrub of tree- and antler-coral and when this happened he profited by it to check his position with the moon that glowed like a huge pale rocket-burst through the broken water. Sometimes the hourglass waist of a niggerhead gave him shelter and he rested for a few moments knowing that the small froth of his air-bubbles would be hidden by the jagged knob protruding above the surface. Then he would focus his eyes on the phosphorescent scribbles of the minute underwater night-life and perceive whole colonies and populations about their microscopic business.\n There were no big fish about, but many lobsters were out of their holes looking huge and prehistoric in the magnifying lens of the water. Their stalk-like eyes glared redly at him and their foot-long spined antennae asked him for the password. Occasionally they scuttled nervously backwards into their shelters, their powerful tails kicking up the sand, and crouched on the tips of their eight hairy feet, waiting for the danger to pass. Once the great streamers of a portuguese man-of-war floated slowly by. They almost reached his head from the surface, fifteen feet away, and he remembered the whiplash of a sting from the contact of one of their tendrils that had burned for three of his days at Manatee Bay. If they caught a man across the heart they could kill him. He saw several green and speckled moray eels, the latter moving like big yellow and black snakes along patches of sand, the green ones baring their teeth from some hole in the rock, and several West Indian blowfish, like brown owls with huge soft green eyes. He poked at one with the end of his gun and it swelled out to the size of a football and became a mass of dangerous white spines. Wide sea fans swayed and beckoned in the eddies, and in the grey valleys they caught the light of the moon and waved spectrally, like fragments of the shrouds of men buried at sea. Often in the shadows there were unexplained, heavy movements and swirls in the water and the sudden glare of large eyes at once extinguished. Then Bond would whirl round, thumbing up the safety-catch on his harpoon gun, and stare back into the darkness. But he shot at nothing and nothing attacked him as he scrambled and slithered through the reef.\n The hundred yards of coral took him a quarter of an hour. When he got through and rested on a round lump of brain-coral under the shelter of a last niggerhead, he was glad that nothing but a hundred yards of grey-white water lay in front of him. He still felt perfectly fresh and the elation and clarity of mind produced by the benzedrine were still with him, but the gauntlet of hazards through the reef had been a constant fret, with the risk of tearing his rubber skin always on his mind. Now the forest of razor-blade coral was behind, to be exchanged for shark and barracuda or perhaps a sudden stick of dynamite dropped into the centre of the little flower of his bubbles on the surface.\n It was while he was measuring the dangers ahead that the octopus got him. Round both ankles.\n He had been sitting with his feet on the sand and suddenly they were manacled to the base of the round toadstool of coral on which he was resting. Even as he realized what had happened a tentacle began to snake up his leg and another one, purple in the dim light, wandered down his webbed left foot.\n He gave a start of fear and disgust and at once he was on his feet, shuffling and straining to get away. But there was no inch of yield and his movements only gave the octopus an opportunity to pull his heels tighter under the overhang of the round rock. The strength of the brute was prodigious and Bond could feel his balance going fast. In a moment he would be pulled down flat on his face and then, hampered by the mine on his chest and the cylinders on his back, it might be almost impossible to get at the beast.\n Bond snatched his dagger out of his belt and jabbed down between his legs. But the overhang of the rock impeded him and he was terrified of cutting his rubber skin. Suddenly he was toppled over, lying on the sand. At once his feet began to be drawn into a wide lateral cleft under the rock. He scrabbled at the sand and tried to curl round to get within range with the dagger. But the thick hump of the mine protruding from his chest prevented him. On the edge of panic, he remembered the harpoon gun. Before, he had dismissed it as being a hopeless weapon at that short range, but now it was the only chance. It lay on the sand where he had left it. He reached for it and put up the safety-catch. The mine prevented him from aiming. He slid the barrel along his legs and probed each of his feet with the tip of the harpoon to find the gap between them. At once a tentacle seized the steel tip and began tugging. The gun slipped between his manacled feet and he pulled the trigger blindly.\n Immediately a great cloud of viscous, stringy ink rolled out of the cleft towards his face. But one leg was free and then the other and he whipped them round and under him and seized the haft of the three-foot harpoon where it disappeared under the rock. He pulled and strained until, with a rending of flesh, it came away from the black fog that hung over the hole. Panting, he got up and stood away from the rock, the sweat pouring down his face under the mask. Above him, the tell-tale stream of silver bubbles rose straight to the surface and he cursed the wounded \u0027pus-feller\u0027 in its lair.\n But there was no time to worry further with it and he re-loaded his gun and struck out with the moon over his right shoulder.\n Now he made good going through the misty grey water and he concentrated only on keeping his face a few inches above the sand and his head well down to streamline his body. Once, out of the corner of his eye, he saw a stingray as big as a ping-pong table shuffle out of his path, the tip of its great speckled wings beating like a bird\u0027s, its long horned tail streaming out behind it. But he paid it no attention, remembering that Quarrel had said that rays never attack except in self-defence. He reflected that it had probably come in over the outer reef to lay its eggs, or \u0027Mermaids\u0027 Purses\u0027 as the fishermen call them, because they are shaped like a pillow with a stiff black string at each corner, on the sheltered sandy bottom.\n Many shadows of big fish lazed across the moonlit sand, some as long as himself. When one followed beside him for at least a minute he looked up to see the white belly of a shark ten feet above him like a glaucous tapering airship. Its blunt nose was buried inquisitively in his stream of air-bubbles. The wide sickle slit of its mouth looked like a puckered scar. It leant sideways and glanced down at him out of one hard pink naked eye, then it wobbled its great scythe-shaped tail and moved slowly into the wall of grey mist.\n He frightened a family of squids, ranging from about six pounds down to an infant of six ounces, frail and luminous in the half-light, hanging almost vertical in a diminishing chorus-line. They righted themselves and shot off with streamlined jet propulsion.\n Bond rested for a moment about half way and then went on. Now there were barracuda about, big ones of up to twenty pounds. They looked just as deadly as he had remembered them. They glided above him like silver submarines, looking down out of then: angry tigers\u0027 eyes. They were curious about him and about his bubbles and they followed him, around and above him, like a pack of silent wolves. By the time Bond met the first bit of coral that meant he was coming up with the island there must have been twenty of them moving quietly, watchfully in and out of the opaque wall that enclosed him.\n Bond\u0027s skin cringed under the black rubber but he could do nothing about them and he concentrated on his objective.\n Suddenly there was a long metallic shape hanging in the water above him. Behind it there was a jumble of broken rock leading steeply upwards.\n It was the keel of the Secatur and Bond\u0027s heart thumped in his chest.\n He looked at the Rolex watch on his wrist. It was three minutes past eleven o\u0027clock. He selected the seven-hour fuse from the handful he extracted from a zipped side-pocket and inserted it in the fuse pocket of the mine and pushed it home. The rest of the fuses he buried in the sand so that if he was captured the mine would not be betrayed. \n","sourceLink":"https://allnovel.net/live-and-let-die-james-bond-2/page-26.html","bookId":2425,"book":{"id":2425,"title":"Live and Let Die (James Bond #2)","description":"Storyline: \n Live and Let Die (James Bond (Original Series) #2) \n \"Her hair was black and fell to her shoulders. She had high cheekbones and a sensual mouth, and wore a dress of white silk. Her eyes were blue, alight and disdainful, but, as they gazed into his with a touch of humour, Bond realized that they contained a message. Solitaire watched his eyes on her and nonchalantly drew her forearms together so that the valley between her breasts deepened. The message was unmistakable.\" \n Beautiful, fortune-telling Solitaire is the prisoner (and tool) of Mr Big—master of fear, artist in crime and Voodoo Baron of Death. James Bond has no time for superstition—he knows that this criminal heavy hitter is also a top SMERSH operative and a real threat. More than that, after tracking him through the jazz joints of Harlem, to the everglades and on to the Caribbean, 007 has realized that Big is one of the most dangerous men that he has ever faced. And no-one, not even the mysterious Solitaire, can be sure how their battle of wills is going to end…\n \n","cover":"https://allnovel.net/images/live-and-let-die-james-bond-2.jpg","author":"Ian Fleming","type":"Mystery","source":"allnovel","link":"https://allnovel.net/live-and-let-die-james-bond-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:37:46 PM"}}
