{"id":77611,"no":8,"title":"Page 8","content":"\u0027Voodoo drummers from Haiti,\u0027 whispered Leiter.\n There was silence. With the tips of their fingers the drummers began a slow, broken beat, a soft rumba shuffle.\n \u0027And now, friends,\u0027 announced the MC, still turned towards the drums, \u0027G-G…\u0027 he paused, \u0027 SUMATRA.\u0027\n The last word was a yell. He began to clap. There was pandemonium in the room, a frenzy of applause. The door behind the drums burst open and two huge negroes, naked except for gold loincloths, ran out on to the floor carrying between them, her arms round their necks, a tiny figure, swathed completely in black ostrich feathers, a black domino across her eyes.\n They put her down in the middle of the floor. They bowed down on either side of her until their foreheads met the ground. She took two paces forward. With the spotlight off them, the two negroes melted away into the shadows and through the door.\n The MC had disappeared. There was absolute silence save for the soft thud of the drums.\n The girl put her hand up to her throat and the cloak of black feathers came away from the front of her body and spread out into a five-foot black fan. She swirled it slowly behind her until it stood up like a peacock\u0027s tail. She was naked except for a brief vee of black lace and a black sequin star in the centre of each breast and the thin black domino across her eyes. Her body was small, hard, bronze, beautiful. It was slightly oiled and glinted in the white light.\n The audience was silent. The drums began to step up the tempo. The bass drum kept its beat dead on the timing of the human pulse.\n The girl\u0027s naked stomach started slowly to revolve in time with the rhythm. She swept the black feathers across and behind her again, and her hips started to grind in time with the bass drum. The upper part of her body was motionless. The black feathers swirled again, and now her feet were shifting and her shoulders. The drums beat louder. Each part of her body seemed to be keeping a different time. Her lips were bared slightly from her teeth. Her nostrils began to flare. Her eyes glinted hotly through the diamond slits. It was a sexy, pug-like face — chienne was the only word Bond could think of.\n The drums thudded faster, a complexity of interlaced rhythms. The girl tossed the big fan off the floor, held her arms up above her head. Her whole body began to shiver. Her belly moved faster. Round and round, in and out. Her legs straddled. Her hips began to revolve in a wide circle. Suddenly she plucked the sequin star off her right breast and threw it into the audience. The first noise came from the spectators, a quiet growl. Then they were silent again. She plucked off the other star. Again the growl and then silence. The drums began to crash and roll. Sweat poured off the drummers. Their hands fluttered like grey flannel on the pale membranes. Their eyes were bulging, distant. Their heads were slightly bent to one side as if they were listening. They hardly glanced at the girl. The audience panted softly, liquid eyes bulging and rolling.\n The sweat was shining all over her now. Her breasts and stomach glistened with it. She broke into great shuddering jerks. Her mouth opened and she screamed softly. Her hands snaked down to her sides and suddenly she had torn away the strip of lace. She threw it into the audience. There was nothing now but a single black G-string. The drums went into a hurricane of sexual rhythm. She screamed softly again and then, her arms stretched before her as a balance, she started to lower her body down to the floor and up again. Faster and faster. Bond could hear the audience panting and grunting like pigs at the trough. He felt his own hands gripping the tablecloth. His mouth was dry.\n The audience began to shout at her. \u0027Cmon, G-G. Take it away, Baby. Cmon. Grind Baby, grind.\u0027\n She sank to her knees and as the rhythm slowly died so she too went into a last series of juddering spasms, mewing softly.\n The drums came down to a slow tom-tom beat and shuffle. The audience howled for her body. Harsh obscenities came from different corners of the room.\n The MC came on to the floor. A spot went on him.\n \u0027Okay, folks, okay.\u0027 The sweat was pouring off his chin. He spread his arms in surrender.\n \u0027Da G-G AGREES!\u0027\n There was a delighted howl from the audience. Now she would be quite naked. \u0027Take it off, G-G. Show yoself Baby. Cmon, cmon.\u0027\n The drums growled and stuttered softly.\n \u0027But, mah friends,\u0027 yelled the MC,\u0027 she stipperlates -With da lights OUT!\u0027\n There was a frustrated groan from the audience. The whole room was plunged in darkness.\n Must be an old gag, thought Bond to himself.\n Suddenly all his senses were alert.\n The howling of the mob was disappearing, rapidly. At the same time he felt cold air on his face. He ielt as if he was sinking.\n \u0027Hey,\u0027 shouted Leiter. His voice was close but it sounded hollow.\n Christ! thought Bond.\n Something snapped shut above his head. He put his hand out behind him. It touched a moving wall a foot from his back.\n \u0027Lights,\u0027 said a voice, quietly.\n At the same time both his arms were gripped. He was pressed down in his chair.\n Opposite him, still at the table, sat Leiter, a huge negro grasping his elbows. They were in a tiny square cell. To right and left were two more negroes in plain clothes with guns trained on them.\n There was the sharp hiss of a hydraulic garage lift and the table settled quietly to the floor. Bond glanced up. There was the faint join of a broad trap-door a few feet above their heads. No sound came through it.\n One of the negroes grinned.\n \u0027Take it easy, folks. Enjoy da ride?\u0027\n Leiter let out one single harsh obscenity. Bond relaxed his muscles, waiting.\n \u0027Which is da Limey?\u0027 asked the negro who had spoken. He seemed to be in charge. The pistol he held trained lazily on Bond\u0027s heart was very fancy. There was a glint of mother-of-pearl between his black fingers on the stock and the long octagonal barrel was finely chased.\n \u0027Dis one, Ah guess,\u0027 said the negro who was holding Bond\u0027s arm. \u0027He got da scar.\u0027\n The negro\u0027s grip on Bond\u0027s arm was terrific. It was as if he had two fierce tourniquets applied above the elbows. His hands were beginning to go numb.\n The man with the fancy gun came round the corner of the table. He shoved the muzzle of his gun into Bond\u0027s stomach. The hammer was back.\n \u0027You oughtn\u0027t to miss at that range,\u0027 said Bond.\n \u0027Shaddap,\u0027 said the negro. He frisked Bond expertly with his left hand - legs, thighs, back, sides. He dug out Bond\u0027s gun and handed it to the other armed man.\n \u0027Give dat to da Boss, Tee-Hee,\u0027 he said. \u0027Take da Limey up. Yuh go \u0027long wid em. Da other guy stays wid me.\u0027\n \u0027Yassuh,\u0027 said the man called Tee-Hee, a paunchy negro in a chocolate shirt and lavender-coloured peg-top trousers.\n Bond was hauled to his feet. He had one foot hooked under a leg of the table. He yanked hard. There was a crash of glass and silverware. At the same moment, Leiter kicked out backwards round the leg of his chair. There was a satisfactory \u0027klonk\u0027 as his heel caught his guard\u0027s shin. Bond did the same but missed. There was a moment of chaos, but neither of the guards slackened his grip. Leiter\u0027s guard picked him bodily out of the chair as if he had been a child, faced him to the wall and slammed him into it. It nearly smashed Leiter\u0027s nose. The guard swung him round. Blood was streaming down over his mouth.\n The two guns were still trained unwaveringly on them. It had been a futile effort, but for a split second they had regained the initiative and effaced the sudden shock of capture.\n \u0027Don\u0027 waste yo breff,\u0027 said the negro who had been giving the orders. \u0027Take da Limey away.\u0027 He addressed Bond\u0027s guard. \u0027Mr. Big\u0027s waiten\u0027.\u0027 He turned to Leiter.\n \u0027Yo kin tell yo fren\u0027 goodbye,\u0027 he said. \u0027Yo is unlikely be seein\u0027 yoselves agin.\u0027\n Bond smiled at Leiter. \u0027Lucky we made a date for the police to meet us here at two,\u0027 he said. \u0027See you at the lineup.\u0027\n Leiter grinned back. His teeth were red with blood. \u0027Commissioner Monahan\u0027s going to be pleased with this bunch. Be seeing you.\u0027\n \u0027Crap,\u0027 said the negro with conviction. \u0027Get goin\u0027.\u0027\n Bond\u0027s guard whipped him round and shoved him against a section of the wall. It opened on a pivot into a long bare passage. The man called Tee-Hee pushed past them and led the way.\n The door swung to behind them.\n CHAPTER VII\n MISTER BIG\n THEIR footsteps echoed down the stone passage. At the end there was a door. They went through into another long passage lit by an occasional bare bulb in the roof. Another door and they found themselves in a large warehouse. Cases and bales were stacked in neat piles. There were runways for overhead cranes. From the markings on the crates it seemed to be a liquor store. They followed an aisle across to an iron door. The man called Tee-Hee rang a bell. There was absolute silence. Bond guessed they must have walked at least a block away from the night club.\n There was a clang of bolts and the door opened. A negro in evening dress with a gun in his hand stepped aside and they went through into a carpeted hallway.\n \u0027Yo kin go on in, Tee-Hee,\u0027 said the man in evening dress.\n Tee-Hee knocked on a door facing them, opened it and led the way through.\n In a high-backed chair, behind an expensive desk, Mr. Big sat looking quietly at them.\n \u0027Good morning, Mister James Bond.\u0027 The voice was deep and soft. \u0027Sit down.\u0027\n Bond\u0027s guard led him across the thick carpet to a low armchair in leather and tubular steel. He released Bond\u0027s arms and Bond sat down and faced The Big Man across the wide desk.\n \u0027It was a blessed relief to be rid of the two vice-like hands. All sensation had left Bond\u0027s forearms. He let them hang beside him and welcomed the dull pain as the blood started to flow again.\n Mr. Big sat looking at him, his huge head resting against the back of the tall chair. He said nothing.\n Bond at once realized that the photographs had conveyed nothing of this man, nothing of the power and the intellect which seemed to radiate from him, nothing of the over-size features.\n It was a great football of a head, twice the normal size and very nearly round. The skin was grey-black, taut and shining like the face of a week-old corpse in the river. It was hairless, except for some grey-brown fluff above the ears. There were no eyebrows and no eyelashes and the eyes were extraordinarily far apart so that one could not focus on them both, but only on one at a time. Their gaze was very steady and penetrating. When they rested on something, they seemed to devour it, to encompass the whole of it. They bulged slightly and the irises were golden round black pupils which were now wide. They were animal eyes, not human, and they seemed to blaze.\n The nose was wide without being particularly negroid. The nostrils did not gape at you. The lips were only slightly everted, but thick and dark. They opened only when the man spoke and then they opened wide and drew back from the teeth and the pale pink gums.\n There were few wrinkles or creases on the face, but there were two deep clefts above the nose, the clefts of concentration. Above them the forehead bulged slightly before merging with the polished, hairless crown.\n Curiously, there was nothing disproportionate about the monstrous head. It was carried on a wide, short neck supported by the shoulders of a giant. Bond knew from the records that he was six and a half foot tall and weighed twenty stone, and that little of it was fat. But the total impression was awe-inspiring, even terrifying, and Bond could imagine that so ghastly a misfit must have been bent since childhood on revenge against fate and against the world that hated because it feared him.\n The Big Man was draped in a dinner-jacket. There was a hint of vanity in the diamonds that blazed on his shirt-front and at his cuffs. His huge flat hands rested half-curled on the table in front of him. There were no signs of cigarettes or an ash-tray and the smell of the room was neutral. There was nothing on the desk save a large intercom with about twenty switches and, incongruously, a very small ivory riding-crop with a long thin white lash. \n","sourceLink":"https://allnovel.net/live-and-let-die-james-bond-2/page-8.html","bookId":2425,"book":{"id":2425,"title":"Live and Let Die (James Bond #2)","description":"Storyline: \n Live and Let Die (James Bond (Original Series) #2) \n \"Her hair was black and fell to her shoulders. She had high cheekbones and a sensual mouth, and wore a dress of white silk. Her eyes were blue, alight and disdainful, but, as they gazed into his with a touch of humour, Bond realized that they contained a message. Solitaire watched his eyes on her and nonchalantly drew her forearms together so that the valley between her breasts deepened. The message was unmistakable.\" \n Beautiful, fortune-telling Solitaire is the prisoner (and tool) of Mr Big—master of fear, artist in crime and Voodoo Baron of Death. James Bond has no time for superstition—he knows that this criminal heavy hitter is also a top SMERSH operative and a real threat. More than that, after tracking him through the jazz joints of Harlem, to the everglades and on to the Caribbean, 007 has realized that Big is one of the most dangerous men that he has ever faced. And no-one, not even the mysterious Solitaire, can be sure how their battle of wills is going to end…\n \n","cover":"https://allnovel.net/images/live-and-let-die-james-bond-2.jpg","author":"Ian Fleming","type":"Mystery","source":"allnovel","link":"https://allnovel.net/live-and-let-die-james-bond-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:37:46 PM"}}
