{"id":12258,"no":5,"title":"CHAPTER IV. AN EASY SERVITUDE.","content":"Just as the priest finished speaking, a lad of about the same age as Amuba appeared at the portico of the house, and ran down to his father. “Oh, father!” he exclaimed, “have you brought two of those strange captives home? We saw them in the procession, and marveled greatly at the color of their hair and eyes. Mysa and I particularly noticed this lad, whose hair is almost the color of gold.” “As usual, Chebron, your tongue outruns your discretion. This youth understands enough Egyptian to know what you are saying, and it is not courteous to speak of a person’s characteristics to his face.” The lad flushed through his olive cheeks. “Pardon me,” he said courteously to Amuba. “I did not think for a moment that one who had but newly arrived among us understood our language.” “Do not apologize,” Amuba replied with a smile. “Doubtless our appearance is strange to you, and indeed even among the peoples of Lydia and Persia there are few whose hair and eyes are as fair as ours. Even had you said that you did not like our appearance I should not have felt hurt, for all people I think like that to which they are accustomed; in any case, it is good of you to say that you regret what you said; people do not generally think that captives have feelings.” “Chebron’s apology was right,” his father said. “Among us politeness is the rule, and every Egyptian is taught to be considerate to all people. It is just as easy to be polite as to be rude, and men are served better for love than for fear.” “And are they to stay here, father,” Chebron asked, “or have you only brought them for to-day?” “They are to stay here, my son. I have chosen them from those set aside for our temple. I selected the younger because he was about your age, and it is good for a man to have one near him who has been brought up with him, and is attached to him; who, although circumstances may not have made them equal in condition, can yet be a comrade and a friend, and such, I hope, you will find in Amuba, for such he tells me is his name. I have said whom circumstances have placed in an inferior position, for after all circumstances are everything. This youth, in his own country, held a position even higher than you do here, for he was the son of the king; and, since his father fell in battle, would now be the king of his people had they not been subjected to us. Therefore, Chebron, bear it always in mind that although misfortune has placed him a captive among us, he is in birth your superior, and treat him as you yourself would wish to be treated did you fall a captive into the hands of a hostile nation.” “I will gladly treat you as my friend,” the young Egyptian said frankly to Amuba. “Although you are so different from me in race, I can see in your face that you are true and loyal. Besides,” he added, “I am sure that my father would not have bade me so trust you had he not read your character and been certain that you will be a fit friend for me.” “You and your father are both good,” Amuba replied. “I know how hard is the lot of captives taken in war, for we Rebu had many slaves whom we took in various expeditions, and I was prepared to suffer. You can judge, then, how grateful I feel to our gods that they have placed me in hands so different from those I had looked for, and I swear to you, Chebron, that you shall find me faithful and devoted to you. So, too, will you find my friend here, who in any difficulty would be far more able to render you service than I could. He was one of our bravest warriors. He drove my chariot in the great battle we fought with your people, and saved my life several times; and should you need the service of a strong and brave man, Jethro will be able to aid you.” “And have you been in battle?” Chebron asked in surprise. “That was the first time I had ever fought with men,” Amuba said; “but I had often hunted the lion, and he is almost as terrible an enemy as your soldiers. I was young to go to battle, but my father naturally wished me to take my place early among the fighting men of our nation.” “By the way, Chebron,” Ameres said, “I would warn you, mention to no one the rank that Amuba held in his own country. Were it known he might be taken away from us to serve in the palace. His people who were taken captives with him said nothing as to his rank, fearing that ill might befall him were it known, and it was therefore supposed that he was of the same rank as the other captives, who were all men of noble birth among the Rebu. Therefore tell no one, not even your mother or your sister Mysa. If there is a secret to be kept, the fewer who know it the better.” While this conversation had been going on Amuba had been narrowly examining the lad who had promised to treat him as a friend. Like his father he was fairer in complexion than the majority of the Egyptians, the lighter hue being, indeed, almost universal among the upper class. He was much shorter and slighter than the young Rebu, but he carried himself well, and had already in his manner something of the calm and dignity that distinguished Egyptians born to high rank. He was disfigured, as Amuba thought, by the custom, general throughout Egypt, of having his head smoothly shaven, except one lock which fell down over the left ear. This, as Amuba afterward learned, was the distinguishing sign of youth, and would be shaved off when he attained man’s estate, married, or entered upon a profession. At present his head was bare, but when he went out he wore a close-fitting cap with an orifice through which the lock of hair passed out and fell down to his shoulder. He had not yet taken to the custom general among the upper and middle classes of wearing a wig. This general shaving of the head had, to Amuba, a most unpleasant effect until he became accustomed to it. It was adopted, doubtless, by the Egyptians for the purpose of coolness and cleanliness; but Amuba thought that he would rather spend any amount of pains in keeping his hair free from dust than go about in the fantastic and complicated wigs that the Egyptians wore. The priest now led them within the house. On passing through the entrance they entered a large hall. Along its side ran a row of massive columns supporting the ceiling, which projected twelve feet from each wall; the walls were covered with marble and other colored stones; the floor was paved with the same material; a fountain played in the middle, and threw its water to a considerable height, for the portion of the hall between the columns was open to the sky; seats of a great variety of shapes stood about the room; while in great pots were placed palms and other plants of graceful foliage. The ceiling was painted with an elaborate pattern in colors. A lady was seated upon a long couch. It had no back, but one end was raised as a support for the arm, and the ends were carved into the semblance of the heads of animals. Two Nubian slave girls stood behind her fanning her, and a girl about twelve years old was seated on a low stool studying from a roll of papyrus. She threw it down and jumped to her feet as her father entered, and the lady rose with a languid air, as if the effort of even so slight a movement was a trouble to her. “Oh, papa—” the girl began, but the priest checked her with a motion of his hand. “My dear,” he said to his wife, “I have brought home two of the captives whom our great king has brought with him as trophies of his conquest. He has handed many over for our service and that of the temples, and these two have fallen to my share. They were of noble rank in their own country, and we will do our best to make them forget the sad change in their position.” “You are always so peculiar in your notions, Ameres,” the lady said more pettishly than would have been expected from her languid movements. “They are captives; and I do not see that it makes any matter what they were before they were captives, so that they are captives now. By all means treat them as you like, so that you do not place them about me, for their strange-colored hair and eyes and their white faces make me shudder.” “Oh, mamma, I think it so pretty,” Mysa exclaimed. “I do wish my hair was gold-colored like that boy’s, instead of being black like everyone else’s.” The priest shook his head at his daughter reprovingly; but she seemed in no way abashed, for she was her father’s pet, and knew well enough that he was never seriously angry with her. “I do not propose placing them near you, Amense,” he said calmly in reply to his wife. “Indeed, it seems to me that you have already more attendants about you than you can find any sort of employment for. The lad I have specially allotted to Chebron; as to the other I have not exactly settled as to what his duties will be.” “Won’t you give him to me, papa?” Mysa said coaxingly. “Fatina is not at all amusing, and Dolma, the Nubian girl, can only look good-natured and show her white teeth, but as we can’t understand each other at all I don’t see that she is of any use to me.” “And what use do you think you could make of this tall Rebu?” the priest asked, smiling. “I don’t quite know, papa,” Mysa said, as with her head a little on one side she examined Jethro critically, “but I like his looks, and I am sure he could do all sorts of things; for instance, he could walk with me when I want to go out, he could tow me round the lake in the boat, he could pick up my ball for me, and could feed my pets.” “When you are too lazy to feed them yourself,” the priest put in. “Very well, Mysa, we will try the experiment. Jethro shall be your special attendant, and when you have nothing for him to do, which will be the best part of the day, he can look after the waterfowl. Zunbo never attends them properly. Do you understand that?” he asked Jethro. Jethro replied by stepping forward, taking the girl’s hand, and bending over it until his forehead touched it. “There is an answer for you, Mysa.” “You indulge the children too much, Ameres,” his wife said irritably. “I do not think in all Egypt there are any children so spoiled as ours. Other men’s sons never speak unless addressed, and do not think of sitting down in the presence of their father. I am astonished indeed that you, who are looked up to as one of the wisest men in Egypt, should suffer your children to be so familiar with you.” “Perhaps, my dear,” Ameres said with a placid smile, “it is because I am one of the wisest men in Egypt. My children honor me in their hearts as much as do those who are kept in slavelike subjection. How is a boy’s mind to expand if he does not ask questions, and who should be so well able to answer his questions as his father? There, children, you can go now. Take your new companions with you, and show them the garden and your pets.” “We are fortunate, indeed, Jethro,” Amuba said as they followed Chebron and Mysa into the garden. “When we pictured to ourselves as we lay on the sand at night during our journey hither what our life would be, we never dreamed of anything like this. We thought of tilling the land, of aiding to raise the great dams and embankments, of quarrying stones for the public buildings, of a grinding and hopeless slavery, and the only thing that ever we ventured to hope for was that we might toil side by side, and now, see how good the gods have been to us. Not only are we together, but we have found friends in our masters, a home in this strange land.” “Truly it is wonderful, Amuba. This Priest Ameres is a most excellent person, one to be loved by all who come near him. We have indeed been most fortunate in having been chosen by him.” The brother and sister led the way through an avenue of fruit trees, at the end of which a gate led through a high paling of rushes into an inclosure some fifty feet square. It was surrounded by trees and shrubs, and in their shade stood a number of wooden structures. In the center was a pool occupying the third of the area, and like the large pond before the house bordered with aquatic plants. At the edge stood two ibises, while many brilliantly plumaged waterfowl were swimming on its surface or cleaning their feathers on the bank. As soon as the gate closed there was a great commotion among the waterfowl; the ibises advanced gravely to meet their young mistress, the ducks set up a chorus of welcome, those on the water made for the shore, while those on land followed the ibises with loud quackings. But the first to reach them were two gazelles, which bounded from one of the wooden huts and were in an instant beside them, thrusting their soft muzzles into the hands of Chebron and Mysa, while from the other structures arose a medley of sounds—the barking of dogs and the sounds of welcome from a variety of creatures. “This is not your feeding-time, you know,” Chebron said, looking at the gazelles, “and for once we have come empty-handed; but we will give you something from your stores. See, Jethro, this is their larder,” and he led the way into a structure somewhat larger than the rest; along the walls were a number of boxes of various sizes, while some large bins stood below them. “Here, you see,” he went on, opening one of the bins and taking from it a handful of freshly cut vetches, and going to the door and throwing it down before the gazelles, “this is their special food; it is brought in fresh every morning from our farm, which lies six miles away. The next bin contains the seed for the waterfowl. It is all mixed here, you see. Wheat and peas and pulse and other seeds. Mysa, do give them a few handfuls, for I can hardly hear myself speak from their clamor. “In this box above you see there is a pan of sopped bread for the cats. There is a little mixed with the water; but only a little, for it will not keep good. Those cakes are for them, too. Those large, plain, hard-baked cakes in the next box are for the dogs; they have some meat and bones given them two or three times a week. These frogs and toads in this cage are for the little crocodile; he has a tank all to himself. All these other boxes are full of different food for the other animals you see. There’s a picture of the right animal upon each, so there is no fear of making a mistake. We generally feed them ourselves three times a day when we are here, but when we are away it will be for you to feed them.” “And please,” Mysa said, “above all things be very particular that they have all got fresh water; they do love fresh water so much, and sometimes it is so hot that the pans dry up in an hour after it has been poured out. You see, the gazelles can go to the pond and drink when they are thirsty, but the others are fastened up because they won’t live peaceably together as they ought to do; but we let them out for a bit while we are here. The dogs chase the waterfowl and frighten them, and the cats will eat up the little ducklings, which is very wrong when they have plenty of proper food; and the ichneumon, even when we are here, would quarrel with the snakes if we let him into their house. They are very troublesome that way, though they are all so good with us. The houses all want making nice and clean of a morning.” The party went from house to house inspecting the various animals, all of which were most carefully attended. The dogs, which were, Chebron said, of a Nubian breed, were used for hunting; while on comfortable beds of fresh rushes three great cats lay blinking on large cushions, but got up and rubbed against Mysa and Chebron in token of welcome. A number of kittens that were playing about together rushed up with upraised tails and loud mewings. Amuba noticed that their two guides made a motion of respect as they entered the house where the cats were, as well as toward the dogs, the ichneumon, and the crocodile, all of which were sacred animals in Thebes. Many instructions were given by Mysa to Jethro as to the peculiar treatment that each of her pets demanded, and having completed their rounds the party then explored the garden, and Amuba and Jethro were greatly struck by the immense variety of plants, which had indeed been raised from seeds or roots brought from all the various countries where the Egyptian arms extended. For a year the time passed tranquilly and pleasantly to Amuba in the household of the priest. His duties and those of Jethro were light. In his walks and excursions Amuba was Chebron’s companion. He learned to row his boat when he went out fishing on the Nile. When thus out together the distinction of rank was altogether laid aside; but when in Thebes the line was necessarily more marked, as Chebron could not take Amuba with him to the houses of the many friends and relatives of his father among the priestly and military classes. When the priest and his family went out to a banquet or entertainment Jethro and Amuba were always with the party of servants who went with torches to escort them home. The service was a light one in their case; but not so in many others, for the Egyptians often drank deeply at these feasts, and many of the slaves always took with them light couches upon which to carry their masters home. Even among the ladies, who generally took their meals apart from the men upon these occasions, drunkenness was by no means uncommon. When in the house Amuba was often present when Chebron studied, and as he himself was most anxious to acquire as much as he could of the wisdom of the Egyptians, Chebron taught him the hieroglyphic characters, and he was ere long able to read the inscriptions upon the temple and public buildings and to study from the papyrus scrolls, of which vast numbers were stowed away in pigeon-holes ranged round one of the largest rooms in the house. When Chebron’s studies were over Jethro instructed him in the use of arms, and also practiced with Amuba. A teacher of the use of the bow came frequently—for Egyptians of all ranks were skilled in the use of the national weapon—and the Rebu captives, already skilled in the bow as used by their own people, learned from watching his teaching of Chebron to use the longer and much more powerful weapon of the Egyptians. Whenever Mysa went outside the house Jethro accompanied her, waiting outside the house she visited until she came out, or going back to fetch her if her stay was a prolonged one. Greatly they enjoyed the occasional visits made by the family to their farm. Here they saw the cultivation of the fields carried on, watched the plucking of the grapes and their conversion into wine. To extract the juice the grapes were heaped in a large flat vat above which ropes were suspended. A dozen barefooted slaves entered the vat and trod out the grapes, using the ropes to lift themselves in order that they might drop with greater force upon the fruit. Amuba had learned from Chebron that although he was going to enter the priesthood as an almost necessary preliminary for state employment, he was not intended to rise to the upper rank of the priesthood, but to become a state official. “My elder brother will, no doubt, some day succeed my father as high priest of Osiris,” he told Amuba. “I know that my father does not think that he is clever, but it is not necessary to be very clever to serve in the temple. I thought that, of course, I too should come to high rank in the priesthood; for, as you know, almost all posts are hereditary, and though my brother as the elder would be high priest, I should be one of the chief priests also. But I have not much taste that way, and rejoiced much when one day saying so to my father, he replied at once that he should not urge me to devote my life to the priesthood, for that there were many other offices of state which would be open to me, and in which I could serve my country and be useful to the people. Almost all the posts in the service of the state are, indeed, held by the members of priestly families; they furnish governors to the provinces, and not infrequently generals to the army. “‘Some,’ he said, ‘are by disposition fitted to spend their lives in ministering in the temples, and it is doubtless a high honor and happiness to do so; but for others a more active life and a wider field of usefulness is more suitable. Engineers are wanted for the canal and irrigation works, judges are required to make the law respected and obeyed, diplomatists to deal with foreign nations, governors for the many peoples over whom we rule; therefore, my son, if you do not feel a longing to spend your life in the service of the temple, by all means turn your mind to study which will fit you to be an officer of the state. Be assured that I can obtain for you from the king a post in which you will be able to make your first essay, and so, if deserving, rise to high advancement.’” There were few priests during the reign of Thotmes III. who stood higher in the opinion of the Egyptian people than Ameres. His piety and learning rendered him distinguished among his fellows. He was high priest in the temple of Osiris, and was one of the most trusted of the councilors of the king. He had by heart all the laws of the sacred books; he was an adept in the inmost mysteries of the religion. His wealth was large, and he used it nobly; he lived in a certain pomp and state which were necessary for his position, but he spent but a tithe of his revenues, and the rest he distributed among the needy. If the Nile rose to a higher level than usual and spread ruin and destruction among the cultivators, Ameres was ready to assist the distressed. If the rise of the river was deficient, he always set the example of remitting the rents of the tenants of his broad lands, and was ready to lend money without interest to tenants of harder or more necessitous landlords. Yet among the high priesthood Ameres was regarded with suspicion, and even dislike. It was whispered among them that, learned and pious as he was, the opinions of the high priest were not in accordance with the general sentiments of the priesthood; that although he performed punctiliously all the numerous duties of his office, and took his part in the sacrifices and processions of the god, he yet lacked reverence for him, and entertained notions widely at variance with those of his fellows. Ameres was, in fact, one of those men who refuse to be bound by the thoughts and opinions of others, and to whom it is a necessity to bring their own judgment to bear on every question presented to them. His father, who had been high priest before him—for the great offices of Egypt were for the most part hereditary—while he had been delighted at the thirst for knowledge and the enthusiasm for study in his son, had been frequently shocked at the freedom with which he expressed his opinions as step by step he was initiated into the sacred mysteries. Already at his introduction to the priesthood, Ameres had mastered all there was to learn in geometry and astronomy. He was a skillful architect, and was deeply versed in the history of the nation. He had already been employed as supervisor in the construction of canals and irrigation works on the property belonging to the temple, and in all these respects his father had every reason to be proud of the success he had attained and the estimation in which he was held by his fellows. It was only the latitude which he allowed himself in consideration of religious questions which alarmed and distressed his father. The Egyptians were the most conservative of peoples. For thousands of years no change whatever took place in their constitution, their manners, customs, and habits. It was the fixed belief of every Egyptian that in all respects their country was superior to any other, and that their laws and customs had approached perfection. All, from the highest to the lowest, were equally bound by these. The king himself was no more independent than the peasant; his hour of rising, the manner in which the day should be employed, the very quantity and quality of food he should eat, were all rigidly dictated by custom. He was surrounded from his youth by young men of his own age—sons of priests, chosen for their virtue and piety. Thus he was freed from the influence of evil advisers, and even had he so wished it, had neither means nor power of oppressing his subjects, whose rights and privileges were as strictly defined as his own. In a country then, where every man followed the profession of his father, and where from time immemorial everything had proceeded on precisely the same lines, the fact that Ameres, the son of the high priest of Osiris, and himself destined to succeed to that dignity, should entertain opinions differing even in the slightest from those held by the leaders of the priesthood, was sufficient to cause him to be regarded with marked disfavor among them; it was indeed only because his piety and benevolence were as remarkable as his learning and knowledge of science that he was enabled at his father’s death to succeed to his office without opposition. Indeed, even at that time the priests of higher grade would have opposed his election; but Ameres was as popular with the lower classes of the priesthood as with the people at large, and their suffrages would have swamped those of his opponents. The multitude had, indeed, never heard so much as a whisper against the orthodoxy of the high priest of Osiris. They saw him ever foremost in the sacrifices and processions; they knew that he was indefatigable in his services in the temple, and that all his spare time was devoted to works of benevolence and general utility; and as they bent devoutly as he passed through the streets they little dreamed that the high priest of Osiris was regarded by his chief brethren as a dangerous innovator. And yet it was on one subject only that he differed widely from his order. Versed as he was in the innermost mysteries, he had learned the true meaning of the religion of which he was one of the chief ministers. He was aware that Osiris and Isis, the six other great gods, and the innumerable divinities whom the Egyptians worshiped under the guise of deities with the heads of animals, were in themselves no gods at all, but mere attributes of the power, the wisdom, the goodness, the anger of the one great God—a God so mighty that his name was unknown, and that it was only when each of his attributes was given an individuality and worshiped as a god that it could be understood by the finite sense of man. All this was known to Ameres and the few who, like him, had been admitted to the inmost mysteries of the Egyptian religion. The rest of the population in Egypt worshiped in truth and in faith the animal-headed gods and the animals sacred to them; and yet as to these animals there was no consensus of opinion. In one nome or division of the kingdom the crocodile was sacred; in another he was regarded with dislike, and the ichneumon, that was supposed to be his destroyer, was deified. In one the goat was worshiped, and in another eaten for food; and so it was throughout the whole of the list of sacred animals, which were regarded with reverence or indifference according to the gods who were looked upon as the special tutelary deities of the nome. It was the opinion of Ameres that the knowledge, confined only to the initiated, should be more widely disseminated, and, without wishing to extend it at present to the ignorant masses of the peasantry and laborers, he thought that all the educated and intelligent classes of Egypt should be admitted to an understanding of the real nature of the gods they worshiped and the inner truths of their religion. He was willing to admit that the process must be gradual, and that it would be necessary to enlarge gradually the circle of the initiated. His proposals were nevertheless received with dismay and horror by his colleagues. They asserted that to allow others besides the higher priesthood to become aware of the deep mysteries of their religion would be attended with terrible consequences. In the first place, it would shake entirely the respect and reverence in which the priesthood were held, and would annihilate their influence. The temples would be deserted, and, losing the faith which they now so steadfastly held in the gods, people would soon cease to have any religion at all. “There are no people,” they urged, “on the face of the earth so moral, so contented, so happy, and so easily ruled as the Egyptians; but what would they be did you destroy all their beliefs, and launch them upon a sea of doubt and speculation! No longer would they look up to those who have so long been their guides and teachers, and whom they regard as possessing a knowledge and wisdom infinitely beyond theirs. They would accuse us of having deceived them, and in their blind fury destroy alike the gods and their ministers. The idea of such a thing is horrible.” Ameres was silenced, though not convinced. He felt, indeed, that there was much truth in the view they entertained of the matter, and that terrible consequences would almost certainly follow the discovery by the people that for thousands of years they had been led by the priests to worship as gods those who were no gods at all, and he saw that the evil which would arise from a general enlightenment of the people would outweigh any benefit that they could derive from the discovery. The system had, as his colleagues said, worked well; and the fact that the people worshiped as actual deities imaginary beings who were really but the representatives of the attributes of the infinite God, could not be said to have done them any actual harm. At any rate, he alone and unaided could do nothing. Only with the general consent of the higher priesthood could the circle of initiated be widened, and any movement on his part alone would simply bring upon himself disgrace and death. Therefore, after unburdening himself in a council composed only of the higher initiates, he held his peace and went on the quiet tenor of his way. Enlightened as he was, he felt that he did no wrong to preside at the sacrifices and take part in the services of the gods. He was worshiping not the animal-headed idols, but the attributes which they personified. He felt pity for the ignorant multitude who laid their offerings upon the shrine; and yet he felt that it would shatter their happiness instead of adding to it were they to know that the deity they worshiped was a myth. He allowed his wife and daughter to join with the priestesses in the service at the temple, and in his heart acknowledged that there was much in the contention of those who argued that the spread of the knowledge of the inner mysteries would not conduce to the happiness of all who received it. Indeed he himself would have shrunk from disturbing the minds of his wife and daughter by informing them that all their pious ministrations in the temple were offered to non-existent gods; that the sacred animals they tended were in no way more sacred than others, save that in them were recognized some shadow of the attributes of the unknown God. His eldest son was, he saw, not of a disposition to be troubled with the problems which gave him so much subject for thought and care. He would conduct the services consciously and well. He would bear a respectable part when, on his accession to the high-priesthood, he became one of the councilors of the monarch. He had common sense, but no imagination. The knowledge of the inmost mysteries would not disturb his mind in the slightest degree, and it was improbable that even a thought would ever cross his mind that the terrible deception practiced by the enlightened upon the whole people was anything but right and proper. Ameres saw, however, that Chebron was altogether differently constituted. He was very intelligent, and was possessed of an ardent thirst for knowledge of all kinds; but he had also his father’s habit of looking at matters from all points of view and of thinking for himself. The manner in which Ameres had himself superintended his studies and taught him to work with his understanding, and to convince himself that each rule and precept was true before proceeding to the next, had developed his thinking powers. Altogether, Ameres saw that the doubts which filled his own mind as to the honesty, or even expediency, of keeping the whole people in darkness and error would probably be felt with even greater force by Chebron. He had determined, therefore, that the lad should not work up through all the grades of the priesthood to the upper rank, but should, after rising high enough to fit himself for official employment, turn his attention to one or other of the great departments of state. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3137/86243.html","bookId":887,"book":{"id":887,"title":"The Cat of Bubastes","description":"简介： The sun was blazing down upon a city on the western shore of the Caspian. It was a primitive city, and yet its size and population rendered it worthy of the term. It consisted of a vast aggregation of buildings, which were for the most part mere huts...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3137","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
