{"id":12262,"no":9,"title":"CHAPTER VIII. THE CONSPIRACY IN THE TEMPLE.","content":"For two days longer the party lingered by the side of the lake fishing and fowling, and then returned across the desert to the headquarters of Ameres. Two months were spent in examining canals and water courses, seeing that the dykes were strengthened where needed, and that the gates and channels were in good repair. Levels were taken for the construction of several fresh branches, which would considerably extend the margin of cultivation. The natives were called upon to furnish a supply of labor for their formation; but the quota was not furnished without considerable grumbling on the part of the Israelites, although Ameres announced that payment would be given them for their work. At last, having seen that everything was in train, Ameres left one of his subordinates to carry out the work, and then started with his son for Thebes. A fortnight after his return home he was informed that a young female, who said her name was Ruth, wished to see him. He bade the servant conduct her to him, and at the same time summon Chebron from his studies. The lad arrived first, and as Ruth entered presented her to his father. “Welcome, child, to this house,” the high priest said. “I suppose by your coming that the old man, your great-grandfather, of whom my son has spoken to me, is no more?” “He died a month since, my lord,” Ruth replied; “but it was two weeks before I could find a passage in a boat coming hither.” “Chebron, tell Mysa to come here,” Ameres said, and the lad at once fetched Mysa, who had already heard that an Israelite girl was coming to be her special attendant, and had been much interested in Chebron’s account of her and her rescue from the crocodile. “This is Ruth, Mysa,” Ameres said when she entered, “who has come to be with you. She has lost her last friend, and I need not tell you, my child, to be kind and considerate with her. You know what you would suffer were you to be placed among strangers, and how lonely you would be at first. She will be a little strange to our ways, but you will soon make her at home, I hope.” “I will try and make her happy,” Mysa replied, looking at her new companion. Although the girls were about the same age, Ruth looked the elder of the two. Mysa was still little more than a child, full of fun and life. Ruth was broken down by the death of her grandfather and by the journey she had made; but in any case she would have looked older than Mysa, the difference being in manner rather than in face or figure. Ruth had long had many responsibilities on her shoulders. There was the care and nursing of the old man, the cultivation of the garden on which their livelihood depended, the exchange of its products for other articles, the preparation of the meals. Her grandfather had been in the habit of talking to her as a grown-up person, and there was an expression of thoughtfulness and gravity in her eyes. Mysa, on the contrary, was still but a happy child, who had never known the necessity for work or exertion; her life had been like a summer day, free from all care and anxiety. Naturally, then, she felt as she looked at Ruth that she was a graver and more serious personage than she had expected to see. “I think I shall like you,” she said when her examination was finished, “when we know each other a little better, and I hope you will like me; because, as my father says, we are to be together.” “I am sure we shall,” Ruth replied, looking admiringly at Mysa’s bright face. “I have never had anything to do with girls of my own age, and you will find me clumsy at first; but I will do my best to please you, for your father and brother have been very good to me.” “There, take her away, Mysa. I have told your mother about her coming, and want to go on with my reading,” Ameres said. “Show her your garden and animals, and where she is to sleep; and give her in charge of old Male, who will see that she has all that she wants, and get suitable garments and all that is requisite.” Before many days were over Ruth became quite at home in her new abode. Her position was a pleasant one. She was at once companion and attendant to Mysa, accompanying her in her walks under the escort of Jethro, playing with her in the garden, helping her to feed the animals, and amusing her when she preferred to sit quiet by telling her about her life near the lake by the Great Sea, about the fowling and fishing there, and especially about the river course close to the cottage, with its hippopotami and crocodiles. Ruth brightened up greatly in her new surroundings, which to her were marvelous and beautiful; and she soon caught something of the cheerfulness of her young mistress, and the laughter of the two girls was often heard rising from Mysa’s inclosure at the further end of the quiet garden. Shortly after the return from their visit to Lower Egypt an important event took place, Chebron being initiated into the lowest grade of the priesthood. His duties at first were slight; for aspirants to the higher order, who were with scarce an exception the sons of the superior priesthood, were not expected to perform any of the drudgery that belonged properly to the work of the lower class of the order. It was necessary to ascend step by step; but until they arrived at the grade beyond which study and intelligence alone led to promotion, their progress was rapid, and they were expected only to take part in such services and ceremonies of the temple as required the attendance of all attached to it. His duties, therefore, interfered but little with his studies or ordinary mode of life, and he was almost as much at home as before. He could now, however, enter the temple at all hours, and had access to the inner courts and chambers, the apartments where the sacred animals were kept, and other places where none but the priests were permitted to enter. He availed himself of this privilege chiefly of an evening. All the great courts were open to the sky, and Chebron loved to roam through them in the bright moonlight, when they were deserted by the crowd of worshipers and all was still and silent. At that time the massive columns, the majestic architecture, the strange figures of the gods exercised an influence upon his imagination which was wanting in the daytime. Upon the altars before the chief gods fire ever burned, and in the light of the flickering flames the faces assumed life and expression. Now and then a priest in his white linen robe moved through the deserted courts; but for the most part Chebron had undisturbed possession, and was free to meditate without interruption. He found that his mind was then attuned to a pitch of reverence and devotion to the gods that it failed to attain when the sun was blazing down upon the marble floor and the courts were alive with worshipers. Then, strive as he would, he could not enter as he wanted into the spirit of the scene. When he walked in the solemn procession carrying a sacred vessel or one of the sacred emblems, doubts whether there could be anything in common between the graven image and the god it represented would occur to him. He would wonder whether the god was really gratified by these processions, whether he felt any real pleasure in the carrying about of sacred vessels, emblems, and offerings of flowers. He was shocked at his own doubts, and did his best to banish them from his mind. At times it seemed to him that some heavy punishment must fall upon him for permitting himself to reason on matters so far beyond his comprehension, and he now rejoiced at what he before was inclined to regret, that his father had decided against his devoting his whole life to the service of the temple. Sometimes he thought of speaking to his father and confessing to him that his mind was troubled with doubts, but the thought of the horror with which such a confession would be received deterred him from doing so. Even to Amuba he was silent on the subject, for Amuba he thought would not understand him. His friend believed firmly in the gods of his own country, but accepted the fact that the Egyptian deities were as powerful for good or evil to the Egyptians as were his own to the Rebu. And, indeed, the fact that the Egyptians were so great and powerful, and prevailed over other nations, was, he was inclined to think, due to the superior power of their gods. The majesty of the temples, the splendor of the processions, and the devoutness with which the people worshiped their gods, alike impressed him; and although the strangeness of the images struck him as singular, he was ready to admit that the gods might take any shape they pleased. Thus, then, Chebron could look for no sympathy from him, and shrank from opening his mind to him. Nevertheless he sometimes took Amuba with him in his visits to the temple. The doors at all times stood open, and any could enter who chose, and had they in the inner courts met with any of the priests, Amuba would have passed unnoticed as being one of the attendants of the temple in company with Chebron. But few words were exchanged between the lads during these rambles, for the awful grandeur of the silent temple and its weird aspect in the moonlight affected Amuba as strongly as it did Chebron. At times he wondered to himself whether if he ever returned home and were to introduce the worship of these terrible gods of Egypt, they would extend their protection to the Rebu. Near the house of Ameres stood that of Ptylus, a priest who occupied a position in the temple of Osiris, next in dignity to that of the high priest. Between the two priests there was little cordiality, for they differed alike in disposition and manner of thought. Ptylus was narrow and bigoted in his religion, precise in every observance of ceremonial; austere and haughty in manner, professing to despise all learning beyond that relating to religion, but secretly devoured with jealousy at the esteem in which Ameres was held by the court, and his reputation as one of the first engineers, astronomers and statesmen of Egypt. He had been one of the fiercest in the opposition raised to the innovations proposed by Ameres, and had at the time exerted himself to the utmost to excite such a feeling against him as would render it necessary for him to resign his position in the temple. His disappointment had been intense when—owing in no slight degree to the influence of the king himself, who regarded Ameres with too much trust and affection to allow himself to be shaken in his confidence even by what he held to be the erroneous views of the high priest of Osiris—his intrigue came to nothing; but he had ever since kept an unceasing watch upon the conduct of his colleague, without, however, being able to find the slightest pretense for complaint against him. For Ameres was no visionary; and having failed in obtaining a favorable decision as to the views he entertained, he had not striven against the tide, knowing that by doing so he would only involve himself and his family in ruin and disgrace, without forwarding in the smallest degree the opinions he held. He was thus as exact as ever in his ministration in the temple, differing only from the other performers of the sacred rites inasmuch as while they offered their sacrifices to Osiris himself, he in his heart dedicated his offerings to the great God of whom Osiris was but a feeble type or image. A certain amount of intimacy was kept up between the two families. Although there was no more liking between the wives of the two priests than between their husbands, they were of similar dispositions—both were fond of show and gayety, both were ambitious; and although in society both exhibited to perfection the somewhat gentle and indolent manner which was considered to mark high breeding among the women of Egypt, the slaves of both knew to their cost that in their own homes their bearing was very different. In their entertainments and feasts there was constant rivalry between them, although the wife of the high priest considered it nothing short of insolence that the wife of one inferior to her husband’s rank should venture to compete with her; while upon the other hand, the little airs of calm superiority her rival assumed when visiting her excited the deepest indignation and bitterness in the heart of the wife of Ptylus. She, too, was aware of the enmity that her husband bore to Ameres, and did her best to second him by shaking her head and affecting an air of mystery whenever his name was mentioned, leaving her friends to suppose that did she choose she could tell terrible tales to his disadvantage. Ameres on his part had never alluded at home either to his views concerning religion or to his difference of opinion with his colleagues. There was but little in common between him and his wife. He allowed her liberty to do as she chose, to give frequent entertainments to her female friends, and to spend money as she liked so long as his own mode of life was not interfered with. He kept in his own hands, too, the regulation of the studies of Chebron and Mysa. One day when he was in his study his wife entered. He looked up with an expression of remonstrance, for it was an understood thing that when occupied with his books he was on no account to be disturbed except upon business of importance. “You must not mind my disturbing you for once, Ameres; but an important thing has happened. Nicotis, the wife of Ptylus, has been here this afternoon, and what do you think she was the bearer of—a proposal from her husband and herself that their son Plexo should marry our Mysa.” Ameres uttered an exclamation of surprise and anger. “She is a child at present; the thing is ridiculous!” “Not so much a child, Ameres, after all. She is nearer fifteen than fourteen, and betrothal often takes place a year earlier. I have been thinking for some time of talking the matter over with you, for it is fully time that we thought of her future.” Ameres was silent. What his wife said was perfectly true, and Mysa had reached the age at which the Egyptian maidens were generally betrothed. It came upon him, however, as an unpleasant surprise. He had regarded Mysa as still a child, and his affections were centered in her and Chebron; for his eldest son, who resembled his mother in spirit, he had but little affection or sympathy. “Very well,” he said at last in a tone of irritation very unusual to him, “if Mysa has reached the age when we must begin to think whom she is to marry, we will think of it, but there is no occasion whatever for haste. As to Plexo, I have marked him often when he has been here with Chebron, and I do not like his disposition. He is arrogant and overbearing, and, at the same time, shallow and foolish. Such is not the kind of youth to whom I shall give Mysa.” The answer did not quite satisfy his wife. She agreed with him in objecting to the proposed alliance, but on entirely different grounds. She had looked forward to Mysa making a brilliant match, which would add to her own consequence and standing. On ceremonial occasions, as the wife of the high priest, and herself a priestess of Osiris, she was present at all the court banquets; but the abstemious tastes and habits of Ameres prevented her from taking the part she desired in other festivities, and she considered that were Mysa to marry some great general, or perhaps even one of the princes of the blood, she would then be able to take that position in society to which she aspired, and considered, indeed, that she ought to fill as the wife of Ameres, high priest of Osiris and one of the most trusted counselors of the king. Such result would certainly not flow from Mysa’s marriage to the son of one of less rank in the temple than her husband, and far inferior in public estimation. Being content, however, that her husband objected to the match on other grounds, she abstained from pressing her own view of the subject, being perfectly aware that it was one with which Ameres would by no means sympathize. She therefore only said: “I am glad that you object to the match, Ameres, and am quite in accord with you in your opinion of the son of Ptylus. But what reason shall I give Nicotis for declining the connection?” “The true one, of course!” Ameres said in surprise. “What other reason could there be? In respect to position no objection could arise, nor upon that of wealth. He is an only son, and although Ptylus may not have so large an income as myself (for I have had much state employment), he can certainly afford to place his son in at least as good a position as we can expect for Mysa. Were we to decline the proposal without giving a reason Ptylus would have good ground for offense.” “I do not suppose, Amense, he will be pleased at fault being found with his son, but that we cannot help. Parents cannot expect others to see their offspring with the same eyes that they do. I should certainly feel no offense were I to propose for a wife for Chebron to receive as an answer that he lacked some of the virtues the parents required in a husband for their daughter. I might consider that Chebron had those virtues, but if they thought otherwise why should I be offended?” “It is not everyone who sees matters as you do, Ameres, and no one likes having his children slighted. Still, if it is your wish that I should tell Nicotis that you have a personal objection to her son, of course I will do so.” “Do not put it that light, Amense. It is not that I have a personal objection to him. I certainly do not like him, but that fact has nothing to do with my decision. I might like him very much, and yet consider that he would not make Mysa a good husband; or, on the other hand, I might dislike him personally, and yet feel that I could safely intrust Mysa’s happiness to him. You will say, then, to Nicotis that from what I have seen of Plexo, and from what I have learned of his character, it does not appear to me that a union between him and Mysa would be likely to conduce to her happiness; and that, therefore, I decline altogether to enter into negotiations for the bringing about of such a marriage.” Amense was well pleased, for she felt that this message, given in her husband’s name, would be a great rebuff for her rival, and would far more than counterbalance the many triumphs she had gained over her by the recital of the number of banquets and entertainments in which she had taken part. Had Amense been present when Nicotis informed Ptylus of the refusal of their proposal for the hand of Mysa, she might have felt that even the satisfaction of mortifying a rival may be dearly purchased. “You know the woman, Ptylus, and can picture to yourself the air of insolence with which she declined our proposal. I wished at the moment we had been peasants’ wives instead of ladies of quality. I would have given her cause to regret her insolence for a long time. As it was, it was as much as I could do to restrain myself, and to smile and say that perhaps, after all, the young people were not as well suited for each other as could be wished; and that we had only yielded to the wishes of Plexo, having in our mind another alliance which would in every respect be more advantageous. Of course she replied that she was glad to hear it, but she could not but know that I was lying, for the lotus flower I was holding in my hand trembled with the rage that devoured me.” “And it was, you say, against Plexo personally that the objection was made?” Ptylus said gloomily. “So she seemed to say. Of course she would not tell me that she had set her mind on her daughter marrying one of the royal princes, though it is like enough that such is her thought, for the woman is pushing and ambitious enough for anything. She only said, in a formal sort of way, that while the alliance between the two families would naturally be most agreeable to them, her husband was of opinion that the dispositions of the young people were wholly dissimilar, and that he feared such a union would not be for the happiness of either; and that having perhaps peculiar ideas as to the necessity for husband and wife being of one mind in all matters, he thought it better that the idea should be abandoned. I had a mind to tell her that Ameres did not seem to have acted upon those ideas in his own case, for everyone knows that he and Amense have not a thought in common—that she goes her way and he goes his.” “Let them both beware!” Ptylus said. “They shall learn that we are not to be insulted with impunity. This Ameres, whom the people regard as so holy, is at heart a despiser of the gods. Had he not been a favorite of Thotmes he would ere now have been disgraced and degraded, and I should be high priest in his place; for his son, Neco, is too young for such a dignity. But he is ascending in the scale, and every year that his father lives and holds office he will come more and more to be looked upon as his natural successor. A few more years and my chance will be extinguished.” “Then,” Nicotis said decidedly, “Ameres must not hold office for many more years. We have talked the matter over and over again, and you have always promised me that some day I should be the wife of the high priest, and that Plexo should stand first in the succession of the office. It is high time that you carried your promises into effect.” “It is time, Nicotis. This man has too long insulted the gods by ministering at their services, when in his heart he was false to them. It shall be so no longer; this last insult to us decides me! Had he agreed to our proposal I would have laid aside my own claims, and with my influence could have secured that Plexo, as his son-in-law, should succeed, rather than that shallow-brained fool, Neco. He has refused the offer, and he must bear the consequences. I have been too patient. I will be so no longer, but will act. I have a strong party among the upper priesthood who have long been of my opinion that Ameres is a disgrace to our caste and a danger to our religion. They will join me heart and soul, for they feel with me that his position as high priest is an outrage to the gods. Ask me no questions, Nicotis, but be assured that my promises shall be kept. I will be high priest; Plexo shall marry this child he fancies, for his doing so will not only strengthen my position, but render his own succession secure, by silencing those who might at my death seek to bring back the succession to Neco.” “That is well, Ptylus. I have long wondered that you were content to be lorded over by Ameres. If I can aid you in any way be sure that I will do so. By the way, Amense invited us to a banquet she is about to give next week. Shall we accept the invitation?” “Certainly. We must not show that we are in any way offended at what has passed. As far as Ameres himself is concerned it matters not, for the man has so good an opinion of himself that nothing could persuade him that he has enemies; but it would not do, in view of what I have resolved upon, that any other should entertain the slightest suspicion that there exists any ill-feeling between us.” Great preparations were made by Amense for the banquet on the following week, for she had resolved that this should completely eclipse the entertainments of Nicotis. Ameres had, as usual, left everything in her hands, and she spared no expense. For a day or two previous large supplies of food arrived from the farm and from the markets in the city; and early on the morning of the entertainment a host of professional cooks arrived to prepare the dinner. The head cooks superintended their labors. The meat consisted of beef and goose, ibex, gazelle, and oryx; for although large flocks of sheep were kept for their wool, the flesh was not eaten by the Egyptians. There were, besides, great numbers of ducks, quails, and other small fowl. The chief cooks superintended the cutting up of the meat and the selection of the different joints for boiling or roasting. One servant worked with his feet a bellows, raising the fire to the required heat; another skimmed the boiling caldrons with a spoon; and a third pounded salt, pepper, and other ingredients in a large mortar. Bakers and confectioners made light bread and pastry; the former being made in the form of rolls, sprinkled at the top with carraway and other seeds. The confectionary was made of fruit and other ingredients mixed with dough, and this was formed by a skillful workman into various artistic shapes, such as recumbent oxen, vases, temples, and other forms. Besides the meats there was an abundance of all the most delicate kinds of fish. When the hour of noon approached Ameres and Amense took their seats on two chairs at the upper end of the chief apartment, and as the guests arrived each came up to them to receive their welcome. When all had arrived the women took their places on chairs at the one side of the hall, the men on the other. Then servants brought in tables, piled up with dishes containing the viands, and in some cases filled with fruits and decorated with flowers, and ranged them down the center of the room. Cups of wine were then handed round to the guests, lotus flowers presented to them to hold in their hands, and garlands of flowers placed round their necks. Stands, each containing a number of jars of wine, stoppered with heads of wheat and decked with garlands, were ranged about the room. Many small tables were now brought in, and round these the guests took their seats upon low stools and chairs—the women occupying those on one side of the room, the men those on the other. The servants now placed the dishes on the small tables, male attendants waiting on the men, while the women were served by females. Egyptians were unacquainted with the use of knives and forks, the joints being cut up by the attendants into small pieces, and the guests helping themselves from the dishes with the aid of pieces of bread held between the fingers. Vegetables formed a large part of the meal, the meats being mixed with them to serve as flavoring; for in so hot a climate a vegetable diet is far more healthy than one composed principally of meat. While the meal was proceeding a party of female musicians, seated on the ground in one corner of the room, played and sang. The banquet lasted for a long time, the number of dishes served being very large. When it was half over the figure of a mummy, of about three feet in length, was brought round and presented to each guest in succession, as a reminder of the uncertainty of existence. But as all present were accustomed to this ceremony it had but little effect, and the sound of conversation and laughter, although checked for a moment, broke out again as soon as the figure was removed. Wine of many kinds was served during the dinner, the women as well as the men partaking of it. When all was concluded servants brought round golden basins with perfumed water and napkins, and the guests removed from their fingers the gravy that even with the daintiest care in feeding could not be altogether escaped. Then the small tables and stools were removed, and the guests took their places on the chairs along the sides of the room. Then parties of male and female dancers by turn came in and performed. Female acrobats and tumblers then entered, and went through a variety of performances, and jugglers showed feats of dexterity with balls, and other tricks, while the musicians of various nationalities played in turns upon the instruments in use in their own countries. All this time the attendants moved about among the guests, serving them with wine and keeping them supplied with fresh flowers. A bard recited an ode in honor of the glories of King Thotmes, and it was not until late in the evening that the entertainment came to an end. “It has gone off splendidly,” Amense said to Ameres when all was over, and the last guest had been helped away by his servants; for there were many who were unable to walk steadily unaided. “Nothing could have been better—it will be the talk of the whole town; and I could see Nicotis was devoured by envy and vexation. I do think great credit is due to me, Ameres, for you have really done nothing toward the preparations.” “I am perfectly willing that you should have all the credit, Amense,” Ameres said wearily, “and I am glad that you are satisfied. To me the whole thing is tedious and tiresome to a degree. All this superabundance of food, this too lavish use of wine, and the postures and antics of the actors and dancers is simply disgusting. However, if everyone else was pleased, of course I am content.” “You are the most unsatisfactory husband a woman ever had,” Amense said angrily. “I do believe you would be perfectly happy shut up in your study with your rolls of manuscript all your life, without seeing another human being save a black slave to bring you in bread and fruit and water twice a day.” “I think I should, my dear,” Ameres replied calmly. “At any rate, I should prefer it vastly to such a waste of time, and that in a form to me so disagreeable as that I have had to endure to-day.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3137/86247.html","bookId":887,"book":{"id":887,"title":"The Cat of Bubastes","description":"简介： The sun was blazing down upon a city on the western shore of the Caspian. It was a primitive city, and yet its size and population rendered it worthy of the term. It consisted of a vast aggregation of buildings, which were for the most part mere huts...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3137","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
