{"id":100957,"no":13,"title":"Page 13","content":"He grins. “Yeah, you’re pretty lucky.”\n My wife laughs. Then she kisses his forehead and moves back to the love seat, next to her best friend. She glances worriedly down the hall toward the front door, and there’s sharp anger in her tone when she whispers to Delores, “If James gets hurt tonight because of Drew, he and I are going to have a major problem.”\n Delores nods. But then—maybe Christmas really is magic, because she defends me. Kind of. “Don’t give up hope, Katie. Dipshit may actually pull his head out of his ass long enough to realize where he should be. He’s come through before when I didn’t think he would. So . . . keep the faith. You never know.”\n Kate sips her wine, looking distinctly uncomforted.\n Then the Ping-Pong participants shout loudly as Michael gets the ball past his uncle—scoring the winning point. His father gives him a high five and a hug.\n “Well played, sir,” Steven congratulates.\n “Nice shot,” my son calls sincerely.\n Then he sighs. And goes back to watching the door.\n Though I know he can’t hear me, I start to move toward him so I can explain how crucial tonight’s conference call is. So he’ll understand. But even in my head, the justifications sound pretty fucking hollow.\n And I don’t get the chance to, anyway. My sister’s hand on my shoulder stops me. “Come along—we still have another stop to make.”\n “So I can feel even worse than I do right now?” I give a sarcastic two-thumbs-up. “Yay.”\n She takes my hand and I reluctantly follow her out the front door.\n And we step seamlessly into my apartment.\n There’s a fire burning in the living room fireplace but the lights are turned down low. And it’s quiet—the only sound to be heard is Kate’s singing voice floating softly down the hall from James’s bedroom. She does that sometimes—sings him to sleep. At the moment, she’s doing a fucktastic rendition of “Have Yourself a Merry Little Christmas.” I imagine her running her fingers through his soft hair as his eyes grow heavy. Then, when he’s finally out—she’ll kiss his forehead and smell the still-child-sweet scent of his skin.\n “This is later tonight,” my sister informs me. “While you’re at the office on your video business meeting.”\n A few seconds later, the song ends and Kate comes walking down the hall. Her hair is pulled up and she’s wearing a dark green silk nightshirt that accentuates the green flecks in her eyes. With white socks, because hardwood floors are freaking freezing in the winter.\n In her hands, Kate holds a bottle of wine and a single glass. She uncorks it on the coffee table and pours a double serving into the glass. Then she opens the hall closet and sticks her head inside. As she rummages around, pulling out baseball bats and ski jackets that I astutely used to camouflage the presents inside, the back of her nightgown starts to ride up, and the “Ho, ho, ho” written across the ass of her red panties peeks out.\n I tilt my head for a better angle of the luscious sight.\n Addiction is an illness. But there are times—like this one—that it’s an enjoyable one. I can’t help myself, and if I’m being honest, I don’t really want to.\n Alexandra frowns at me. “Focus, please.”\n I clear my throat and nod.\n Eventually, Kate succeeds in dragging out two boxes that are longer than she is.\n She opens them, lays out all the pieces neatly, and settles herself among them on the floor. She takes a sip of her wine, opens the instruction manual, and gives herself a pep talk.\n “If Drew wants to work, he can work. I got this covered. How hard could it be?”\n We should pause here briefly and think about that statement. How hard can putting a child’s toy together really be?\n Past experience tells me—pretty fucking hard. If you have kids, you know exactly what I’m talking about.\n I don’t get it. Clear illustrations, simple direct steps—is that really too goddamn much to ask for? And don’t get me started on the packaging. I realize that shoplifting is a drain on stores, but is it necessary to wrap every single fucking component in plastic, wire, and industrial-strength tape? The only people that deters are the parents trying to put it together.\n I’ve wondered who makes that call at the toy companies. Who decides which pieces get tied down and at what potency. Whoever it is—I bet he was bullied in high school. Or maybe he was poor and didn’t get to play with any toys when he was a kid. So now—every day—he takes his sick, twisted revenge by making it as difficult as humanly possible for anyone to put together a toy that should be a piece of fucking cake.\n I feel better now that I got that off my chest. Thanks.\n So, back to Kate: fifteen minutes after getting started, she’s got all of three pieces put together on James’s bicycle. \n","sourceLink":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5/page-13.html","bookId":1809,"book":{"id":1809,"title":"It\u0027s a Wonderful Tangled Christmas Carol (Tangled #4.5)","description":"Storyline: \n Drew and Kate play a hilarious encore to New York Times and USA TODAY bestselling author Emma Chase’s “highly entertaining” (RT Book Reviews) debut Tangled in this sexy take on A Christmas Carol, in which three dream women remind Drew that no gift could be better than his life with Kate… \n After a blowout fight with Kate about his workaholic habits sends Drew to the office in anger on Christmas Eve, he falls asleep at his desk. There, three lovely holiday spirits magically visit him to teach him that every moment is precious and that he should never take his family for granted. But when he wakes up, will he just write it off as a dream? \n Originally published in the sizzling anthology Baby, It’s Cold Outside, this irresistible novella is the perfect holiday treat! \n And as special bonus material after the novella, Emma Chase has included a scene showing Drew’s marriage proposal to Kate!\n \n","cover":"https://allnovel.net/images/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:55:10 PM"}}
