{"id":12763,"no":41,"title":"Chapter 40","content":"Behind him he hears the peep of the other ridge’s signal and his digging becomes almost frenzied. The trouble was, with my plan to put in a good first day even if it broke my back: I almost broke my back that first day.... He finishes the hole and gets the cable through and hooked and jerks his whistle wire... But only during the first half of that first day. Then, panting rapidly, hurries to inspect the next log; “He should have told me about the holes, the prick. . . .” (And see, the funny thing is: it was also Viv’s lunches that finally broke the ice and gave me the chance I was waiting for to talk with the boy . . .) The second half of the day went easier—because by then I had learned that I was breaking my back for naught . . . The line strums overhead. The cable comes back. The moss begins to steam softly on the old stumps . . . and that I was never going to measure up to Brother Hank, simply because he had rigged the scale, making it impossible. As the sun gets higher and higher. By the time Joe Ben blew a long, famished blast on the donkey whistle, indicating noon, Lee had regained his one-log lead over the other choker-setter. When the last thread of the whistle note raveled away into the forest Lee allowed himself to sink to the ground beside a stump. He looked blankly at his hands for a time without moving, then removed the gloves, a careful finger at a time. During the grueling morning he had forgotten the circumstances surrounding the gift of the gloves. Hank’s remarks had vanished. So had the anger and the shame caused by the remarks. The gloves now existed pure and with no strings to the past and O Lord God, was he ever thankful that he had something to cover his soft, pink grad student’s fingers! He had thought this a hundred times. Not long after Hank had left Lee had removed the heavy shirt to let the breeze dry off his sweat; the sweat wasn’t much affected as he tugged, jerked, and hauled the unwieldly cable through a miasma of berry vine and fire slashing, but within a half an hour both arms were quilted from glove top to shoulder with a pattern of welts and scratches. The view he had of his stomach made him think fabric instead of flesh, a bright garment of patchwork skin stitched together with thorns. He put his shirt back on but an inch or so of wrist still showed between cuff and glove; occasionally he would pause, gasping as he waited for Joe Ben to reel the cable back out or for Andy to buck another fallen tree into thirty-two-foot lengths, and tenderly draw up a shirt sleeve and frown at that inch of bare wrist which was beginning to look like a scarlet bracelet: he hesitated to even imagine what his hands would have looked like without the heavy leather gloves. He let his head tilt back until it rested against the ragged side of the stump. He watched the other men move through a haze of distorted distance toward the carrier that had brought them to this hell. He felt sick. He wouldn’t have walked those ten wavering miles to that truck even if a hot steak waited for him. His stomach would never touch food again. He wouldn’t move from the spot, though his leg was twisted painfully beneath him, though those bastard carpenter ants, big and shiny as carpet tacks, crawled through his shirt and across his sweating belly, and though he was sitting in a thicket of what was surely poison oak—what else? He sighed. Why try to gild this Dante world? he was resolved to never move again. He closed his eyes. The sound of Joe’s radio was wafted intermittently through the trees: And in dreams I live... memory . . . Moon ...splendor ...love. His breathing slowed. His glasses were being streaked with sweat, but he couldn’t have cared less. He drew his eyelids over his mangled body . . . sliding backwards up a long, hot, glistening dream of a playground slide, tumbling over the top of the slide and down a thousand iron steps worn free of their nonskid texture by a century of sneakers, onto a gritty sandlot schoolyard. Where he was able to look from beneath the brim of a grade-school beanie at the names lettered on the side of the high-school gymnasium. wakonda high sharks sports records. And who there? Whose name on top of the list, record-holder for high jump? The same for pole vault? And for hundred-meter swim state record? The same name all the way on down. Whose? Shucks, you know whose. That’s my brother Hank Stamper. And just you wait. When I get big. He told me. Teach me to. Someday, boy-oh-boy. Said he would. I can make. Body clean mind. But I kept up. One log ahead. By the gods did keep up with him today . . . And the ants crawled over him. And Joe’s little radio spun out in the hot air: Oh minny years ago in days of childhood... providing background accompaniment for Lee’s dreaming, as well as for Hank’s limber-legged stride. I used to play till shadows come: (See when lunch blew I walked back to the crummy, but Lee isn’t anywhere to be seen. I pick up two sacks and tell Joe I’m going to look for the kid and I cut back and find him crapped out in the grass not a half a dozen steps from the anchor stump . . .) And heard my mother call at set of sun: Governor Jimmy Davis reminisced reverently with a steel guitar— Come home, come home, It’s suppertime. The shadows lengthen fast —while Hank stood for a long time looking down on the boy’s scratched and blistered features. Come home, come home, It’s suppertime. I’m going home at last. In his sleep Lee sought to change and control his dreaming, as he was usually able to do, but his exhausted mind ignored his efforts and kept threatening to ramble off in its own willynilly direction through all sorts of best-forgotten childhood impressions. Unable to influence its meandering, Lee was just surrendering himself to the dream when one of the carpenter ant scouts cruising the area decided to test the terrain for logging potential. (So I sat down near the kid and started eating, figuring let him rest, when all of a sudden up he comes with a squall like a wild man, whopping himself all over. When he stops I wipe my face on my sleeve and point towards his gaping shirt he’s ripped half the buttons off. “Something you learned in college, that strip act?” “Whore of a bug bit me! Shit.” “Why listen there. He can cuss too. Don’t that beat all?” I say and pick the second paper sack from the ground and hand it over to him. He’s still rubbing the ant bite. “I don’t want that swill!” he yells, about half hysterical with getting woke up so unexpected. I grin at him. I know how he feels. I done that myself, asleep once and had a chipmunk get down in my boot ...but I don’t say anything. I shrug and put the sack on the ground and go back to my own lunch. The kid’s embarrassed. The way I was this morning popping off at Joby. I don’t act like I notice. I’m eating, humming a little, leaning back against the mossy padding of an old spongy deadfall. Things been moving along smooth and nice and with lunch and all I feel pretty good. Good enough I think maybe I can say a word or two to the boy without sounding like I’m sentencing him to be hung. Only thing I need is some way to start. I go to picking through my sack and arranging boiled eggs, olives, apples, and Thermos in front of me on a piece of wax paper. He’s acting like he’s going back to sleep and don’t want nothing to eat, but the sharp mustard-and-vinegar smell of them deviled eggs is ringing the air like a dinner gong. He sits back up and opens his own sack with one casual finger like, you know, he might ...then he might not. “I guess I fell asleep,” he says, looking at the ground. It’s a way to let me know why he blowed up when I offered him lunch. A sort of explanation and apology. I grin at him and nod to let him know I catch it . . .) Ah got a radiation burn On my pore pore heart, Joe’s radio insisted. A jay screamed at them, hot and hungry as it watched them eat. Except for Hank’s toneless humming as he chewed steadily at the venison sandwich, there was little other sound. From the truck where the other men ate, the bell-like combinations of talk and laughter and Western music stroked the air and reached Hank and Lee on rippling heat-warped waves. The radio played; the jay screamed. Sometimes Hank hummed along with Joe’s radio; other times he whistled derisively at the bird. Neither of the brothers spoke again while they finished their lunches; they ate facing each other, but their eyes never met; when Hank looked up from his meal he scanned the firs behind Lee with exaggerated absorption, measuring, falling, bucking, and even sawmilling each tree with his eyes. Lee didn’t look up. He concentrated on the packed lunch. It was obvious that this sack of food was another contribution from the girl he had yet to meet but who was constantly growing in stature in his estimation. The meal was prepared to keep a man going at a hard job—like a practical fuel for a machine— but there was also that extra touch again, that addition intended to lift anything, even a sack lunch, out of the commonplace. At the very bottom of the sack, wrapped in foil like a bright holiday surprise, Lee found a square of creamy brown candy filled with roasted filberts. Lee bit off a small corner and crushed it with his tongue. “Your wife’s candy?” Hank nodded. “That’s why I generally eat apart from the rest of those snakes; they always looking to share Viv’s dessert.” “It’s very good.” Hank scanned the trees again for a moment, lips pursed in deliberation, then turned suddenly toward Lee and leaned forward. (Then while we were eating I just started talking . . .) Before him, his three fingers curled slightly as though he gripped an invisible object. “Listen, bub, what I did this morning? Let me tell you . . .” His voice was excited. Lee listens with excitement to Hank’s intense words, eager to hear what Hank has to say about the morning’s choker-setting duel. “. ..was top the spar where we are going to move. Oh man, let me see. . . .” Hank’s crippled hand continues to grip the air as he strains for the right words. “Let me see, see if I can...” Lee looks on, expectant and impatient, while Hank takes a package of cigarettes; he tosses one to Lee and puts another in the corner of his mouth. “. . . see if I can give you some idea. Now. The tree you want for the spar is the biggest tree on the biggest hill you can find. It’s gonna be like the main center tentpole of our circus. And it’s gonna be the last one cut on the hill, see, the last one up there after we clear off the rest of the show. Okay? I get into this rig . . . oh, twenty pounds of paraphernalia, maybe more; handsaw, ax, hooks, rope, and throw a line around me and the tree an’ up the big sonofabitch I climb, lopping off branches as I go.” (And I get started telling him about rigging the spar. Just to have something to pass the time at first. Figuring that if he liked watching that tree felled when we first got to the show, he oughta like hearing about topping, too...) “As you go up, you take in the line, around the tree. It gets shorter as the tree gets smaller. You’re choppin’; one-handed; whack, whack, get the little limbs. Not many big limbs on a fir till right at the top but you still got to get the little ones, and keep an eye peeled where that safety line is because you get that with the ax, brother, wire center or no that could be all she wrote. Lots of climbers have chopped their line. That’s how Percy Williams bought it, husband to one of Henry’s first cousins. He cut his line. Hit feet first and jammed his legs all the way up to his shoulderblades. So you learn to watch out. Watch out those stobs we call gut-gougers. Watch out you get a good bite with your spurs or you slip and slide twenty feet and peel hide off your chest and belly and thighs like scrapin’ a carrot. And you want to know something else, bub? You’re scared as hell. They say that the first spar is the tallest but that’s all hokum; every one you climb is the tallest. And Christ, this sonofabitch is a good forty thousand board feet.” (But see? When he looked at me, blank as ever behind those glasses, I realized he don’t have any notion how tall this makes the tree. And that I didn’t really have any way to tell him.","sourceLink":"http://novel.tingroom.com/jingdian/1580/47003.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
