{"id":12772,"no":50,"title":"Chapter 49","content":"“But—but go on, Uncle Henry!” Squeaky could endure the old man’s theatrics no longer. “Go on? I’m goin’ somewheres?” “What happened?” Squeaky cried, and the twins echoed her plea. “What happened—happened?” And little Leland Stanford, agog as any, soundlessly urged, Go on, Father, what happened ...? “Happened?” He craned his neck about to check. “Happened where? I don’t see a thing.” Face as innocent as a billygoat’s. “About the log! the log!” “Oh yeah, that log. Lemee see, by gosh. You mean, don’t you, that log I was ridin’ lickety-brintle down the slide trough to certain disaster? Hmm, let me see.” He closed his eyes and massaged the bridge of his hooked nose in deep thought; even the apathetic shadows perked up and moved in closer to hear. “Well then, right at the last I come up with me a idea; I thought I’d try throwin’ the bucket underneath the bastard. I pitched it up ahead in the trough, but the log shoved it rattlin’ an’ clatterin’ along in front for a piece like that ol’ bucket was a horsefly it was tryin’ to brush aside—hey! sonofagun, that makes me think: have you boys checked that outfit Teddy’s got goin’ at the Snag for killin’ bugs? Slickest-workin’ piece of machinery I ever—” “The log! The log!” cried the children. The log, echoed the child in me. “Hm? Ah. Yessir. Right at the last I saw there weren’t nothin’ for me to do but dive. So I give a jump. But lo an’ behol’, my gallusses is catched onto a stob! an’ me an’ that fir went shootin’ off into the wild blue yonder, aimin’ to tear hell out of the side of that mailboat—did, too, if you got to know; so me up there tryin’ to be the big hero with the bucket was all just so much yellin’ at the wind, ’cause it did! hit that boat and split it to kingdom come, letters flyin’ in all directions like somebody’d set off a blizzard: letters, nuts, bolts, steamfittin’s, kin’lin’ wood, an’ that boy steerin’ it flung straight in the air—an’ it was the Pierce boy, too, come to think of it, because I recall he ’n’ his brother allus useta trade off makin’ the runs and the one off duty got mighty sore about havin’ to pilot full-time after his brother was drownt—” “But what about you?” “Me? Lord love us, Squeaky, honey, I thought you knew. Why, your ol’ Uncle Henry was killed! You didn’t think a man could survive a fall like that, now did you? I was killed!” His head fell back. His mouth gaped in death agony. The children looked on, stunned to horrified silence, until his belly began to shake with amusement. “Henry, you!” shouted the twins, and each breathed a disappointed “Ahhh.” Squeaky reacted with a hiss of outrage and fell to kicking at his cast with blue-flanneled feet. Henry laughed until tears poured down his gullied cheeks. “Killed, didn’t y’know? Killed yeee hee haw, dead YEE hee hee haw!” “Henry, someday when I’m bigger you’ll be sorry!” “YEEE haw haw haw!” Hank turned aside—“Lord; just look at him carry on”—to laugh into his band. “The balm of Gilead is cooked his brains out.” And Joe Ben lapsed into a coughing fit that took five minutes and a spoonful of molasses to subdue. When Joe could breathe again Viv came from the kitchen, carrying a pot and cups on a tray. “Coffee?” Steam fell in an ermine mantle about her shoulders and when she turned her back to me I saw it was braided into her hair and tied at the bottom with a ribbon of silk. Her jeans were rolled to the swell of her calf; she bent to put the tray on the table, and a brass brad gave me a lewd wink; she straightened and a slight bind of denim made an interesting star of wrinkles. “Who likes sugar, anybody?” I spoke not a word aloud, but could feel my mouth begin to water as she offered the cups around. “You, Lee?”—turning, with those feather-light tennis shoes sighing at her feet. “Sugar?” “It’s fine, Viv, thanks—” “I’ll get it for you?” “Well ...all right then.” Just to watch that brass brad wink its way back to the kitchen. Hank poured bourbon into his coffee. Henry had a drink straight from the bottle to regain his strength after his untimely demise. Jan took Joe Ben’s hand and looked at his wristwatch and announced it was time, past time for the kids to be in bed. Viv returned with a cup of sugar, licking the back of her hand. “Got my thumb in it. One or two spoons?” Joe Ben roused himself. “Okay, kids, move. Up them stairs.” “Three.” I never took sugar in my coffee, never before or since. “Three? Such a sweet tooth?” She stirred in one. “Try it like this first. I have very powerful sugar.” Hank sipped his drink, eyes closed, peaceful, tame. The kids trooped upstairs in a surly pack. Henry yawned. “Yessir . . . killed me dead.” At the top of the steps Squeaky stopped and turned slowly and deliberately with her hands on her hips. “Okay for you, Uncle Henry. You know what,”—and walked on, leaving the air behind her pervaded with some awful fate meaningful only to her and the old man, whose eyes bulged wide in shammed terror. Viv carried Johnny, tickling him with fuzzy breath down the back of his neck. Joe held the twins by fat hands, patient with their one-step, step, one-step, step to the top of the stairs. Jan snuggled the baby over her shoulder. And I swelled, threatening to burst in an explosion of hearts, flowers, and frustration; love, beauty, and jealousy. “Nigh’-nigh’.” The baby waved. “Night-night.” “Night-night.” Night-night, said a small voice inside, waiting to be cuddled upstairs. Frustration and jealousy. I blush to admit it. But as I watched that last pampered bundle disappear up the stairwell I could not help feeling a twinge of envy. “Twinge?” the moon mocked me through a dirty windowpane. “Looks to me more like a hammerblow.” “Yeah, but they are living the life I should have lived.” “Just little kids. Shame on you.” “Thieves! Stealing my home and my parental affection. Enjoying my unused paths and climbing my apple trees.” “A while ago,” the moon reminded me, “you were blaming all your elders, now it’s the children...” “Thieves”—I tried to ignore that moon—“little fuzzy thieves, growing up in my lost childhood.” “How,” the moon whispered, “can you be sure it is lost? Until you try to find it?” I sat stunned by the insinuation. “Go on,” it nudged, “give it a whirl. Show them you still want it. Let them know.” So, with the kids gone and the old man nodding, I searched the room for a sign. My attention was caught by the sound of the dogs beneath the floor. Well, I’d made it with the cream, I’d made it with the boat . . . why not go the whole route? I swallowed hard, shut my eyes, and asked if they still used the hounds for hunting, still, you know, went on hunts—like they used to? “Now and then,” Hank answered. “Why d’ya ask?” “I’d like to go sometime. With you...all ...if you don’t mind?” It was said. Hank nodded slowly, rolling a hot spoonful of apple on his tongue. “All right.” A silence followed, identical to the one that had followed my offer to pick up Henry in the boat—only longer and stronger, because as a boy my aversion to hunting had been the most vociferous of all my aversions—and I once again reacted to my embarrassment at this silence with a flustered attempt at sophistication. “It’s only that one should”—I shrugged, studying the cover of a National Geographic with bored authority—“know something of the area ...besides, I’ve read all the decent paperbacks offered by Grissom’s drugstore, and I saw Summer and Smoke on stage, so—” “Where! Where!” Henry lurched to his feet like an old fire-horse jumping to the bell, brandishing his cane and sniffing about for the flames. Viv uncoiled swiftly from the foot of Hank’s chair and crossed to take his arm and ease him down again. “The movie-picture show, Henry,” she said in a voice that would have calmed Vesuvius. “Just the movie-picture show.” “What was I sayin’? Ah.” He picked up the thread as though it had never broken. “About the old times. Say, them oldtime tales where we greased the skids and rode the oxen and all that noise? Hm? Them oldtime jacks in mustaches and ten-gallon hats carryin’ a misery whip over their shoulders, you seen them pictures, ain’t you? Lookin’ all dashin’ an’ romantic? Well, them boys are good pictures in The Pioneer magazine, but I tell you now an’ you can mark ’er down: they weren’t the ones! that really rolled the logs. No. No sir. It was boys like me and Ben and Aaron, boys what not only had the grit but what had the sense to get hold of a machine. You’re godblessed right! Let me say . . . hm, well now, roads? We didn’t have roads worth sour apples, sure, but what did I tell ’em? Roads or no boogin’ roads, I say, I’ll take this here donkey machine any place you can take one them worthless tow-oxen of yours! Shoot; all I got to do is run a little piece of line up to a stump somewheres and pour it to ’er. Reel myself right up to where I want, then run a line to the next stump. Jumpin’ the donk, we called it; cookin’ with steam. Yessir, steam, steam, that’s the business. You feed them animals of yourn bale of hay every other day at eighty, ninety cents a bale, and you know what I’m feedin’ mine? Wood chips, and slashin’, and scrub oak, and any other damn thing layin’ around handy for the burnin’. Steam! gasoline! now Diesel! Yessir, that’s the ticket. You can’t whup the swamps with a animal. A animal is on the other side! You can’t take much shade offn the ground with nutted ox an’ a whittlin’ knife! You got to have a machine.” His eyes brightened as he warmed again to his subject. He jerked upright in his chair and hooked a long bony hand in the invisible strap hanging before him. He dragged his body standing, a rickety stack of limbs and joints, teetering precariously on the edge of eighty and looking like the slightest breeze would turn it into a pile of rubble. “The trucks! The cats! The yarders! I say more power to ’em. Booger these peckerwoods always talkin’ about the good old days. Let me tell you there weren’t nothin’ good about the good old days but for free Indian nooky. An’ that was all. Far as workin’, loggin’, it was bust your bleedin’ ass from dark to dark an’ maybe you fall three trees. Three trees! An’ any snot-nosed kid nowdays could lop all three of ’em over in half an hour with a Homelite. No sir. Good old days the booger! The good old days didn’t hardly make a dent in the shade. If you want to cut you a piece you can see out in these goddam hills you better get out there with the best thing man can make. Listen: Evenwrite an’ all his crap about automation ...he talk like you gotta go easy on this stuff. I know better. I seen it. I cut it down an’ it’s comin’ back up. It’ll always be comin’ back up.","sourceLink":"http://novel.tingroom.com/jingdian/1580/47012.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
