{"id":12788,"no":66,"title":"Chapter 65","content":"My feeble embryo of a plan was proceeding better than I had hoped . . . They move up the beach. Hank in front and Lee grimly shivering behind: We are joined, brother, shackled together for all our lives, just as the birds and the waves are immutably tuned together, in a song of patience and panic. We have been tuned thus for years, me piping and pecking after morsels while you crashed and roared (Closer and brighter, the light almost there now; the little boy held his breath at the approaching glow of salvation . . .) but now, brother, the roles are switching, and you are beginning to plaintively pipe the tune of panic and I am beginning the melancholy long withdrawing roar of patience . . . and I faced the future with a confident smirk. “Right behind you, brother mine. Lead on. Lead on. . . .” Lee’s steps stretch out to keep up with Hank. Indian Jenny prepares her soul for another attack on her manless world. The old boltcutter empties his last bottle of Thunderbird and decides to start for town before full dark. The clouds swarm up from the sea, black-booted and brave with the coming of night. The wind springs up from the slough bottoms. The dunes darken (the boy watches the light). In the mountains past the town, where the streams grow thirsty for winter, the lightning uncurls and begins to flutter in the fir trees, white-orange and black, for Halloween...(Then, finally, after cold minutes or hours or weeks—he has no idea—the earth above the waiting boy has moved far enough. The light is in full view. And the glow of salvation is nothing but that same moon that led him across the dunes, a thin paring of moon that has gradually centered itself in his meager patch of far-off sky) . . . in that kind of sky ...(“Leee-land . . .”) in that kind of world. “Leeee-land; oh, Leeee-land...” The boy doesn’t hear; he stares at the moon, a thread-thin crescent hanging there between the stars like the last of a faded Cheshire cat— everything gone but the black reminder and the jeering grin . . . and this time the boy’s weeping is not of the cold or the fright of falling into a dark hole, or of anything else he has ever cried about before... “Leeeeelan’ boy, answer me...!” The call comes again, nearer, but he doesn’t answer. He feels that his voice is trapped like his weeping, beneath a cold lid of wind. Nothing can ever get out. “Leland? Bub...?” The hole sinks deeper and deeper into the earth and is just beginning to strangle his consciousness when he feels something hail against the back of his neck. Sand. He raises his eyes up to the hole: The grin is gone! A face is there! “Is that you, bub? You all right?” And a flashlight! “Gawdamn, bub, you gave me a real run for my money!” With no tool but his pocket knife it takes Hank most of an hour to cut the limbs from a little scrub pine that he dragged onto the dunes. He works as near to the mouth of the hole as he feels safe, so the boy will be able to hear his labors. As he works he tries to talk constantly, keeping up an unconcerned-sounding flow of jokes and stories and shouted commands to the hound—“Come back here an’ forget chasing those rabbits, you ol’ potlicker!”—that listens, puzzled, from the spot where Hank tied him before starting. “Dang that ol’ gadabout dog.” He clucks loudly, then crawls to the hole on his belly again to check on the boy, whispering, “That’s the kid. Sit good an’ still. Don’t fret. But don’t rustle around down there any more’n you have to, neither.” He bellies back from the hole and returns to his work on the little pine; his nonchalant and rambling narrative is just the opposite of his frenzied hacking and whittling. “Say now, bub, you know? Ever since I got here I been think-in’...that this whole situation sure does put me in mind of something. An’ it just now come to me what it was. It was the time old Henry and your Uncle Ben an’ me—I was just about your age at the time, too, I guess—all drove over to Uncle Aaron’s place up in Mapleton to help him dig a big hole for a outhouse....” He works swiftly but carefully at the tree; he could remove the branches more quickly by breaking them off, but then they would break off next to the trunk ...he has to leave enough sticking out for the boy to hang on to, but not enough to scrape the sides of that hole—any little jostling could bring it all down. “Your Uncle Aaron, you see, couldn’t do with just any old five-or six-feet hole under his crapper—he wanted it deep. He had got it into his head some way that if it wasn’t deep enough the roots from the garden could get to it an’ he’d end up with carrots tastin’ like turds. Now. Hang tough a minute; I’m gonna bring the ladder an’ try to get it down.” He slides toward the hole again, dragging the tree with him; the branches have all been removed except those opposing each other, and these have been cut off a few inches from the skinny trunk. The result is a wobbly ladder some thirty feet long. Without standing, he up-ends the tree and begins to lower it very carefully down, talking all the while. “Well, so we went at that hole, the dirt just aflyin’ because it was loamy an’ pretty soft diggin’—feel the ladder yet, bub? you holler when it gets down to where you can feel it—an’ pretty quick we’d dug down about fifteen feet—Don’t you feel it yet, for chrissakes? I’m prodded up against something.” He pulls the light from his pocket and shines it down; the butt of the trunk is resting against the boy’s leg. “My leg’s too cold, Hank, I didn’t feel it on my leg.” “You mean you can’t climb out on it?” The boy shakes his head. “No,” he says without emotion. “I can’t feel my legs.” Hank shines the light around the tube; it might stand another hundred years or it might cave in in another ten minutes. Likely ten minutes. He can’t chance going for help; he’ll have to go down and carry him out. He scoots back from the hole and turns over on his back and comes at it again, feet first. An inch at a time he lowers himself through the opening. “So we’d dug down fifteen feet ...an’ Uncle Ben an’ Uncle Aaron was at the bottom, Henry an’ me up top haulin’ off the dirt ...easy, easy does it ...then Uncle Ben says he just had to go to the house for some water, would be right back, he says. Ah, gotcha, bub. Now; can you hang onto my belt?” “I can’t feel my fingers, Hank. I think my fingers died.” “You just dyin’ a little bit at a time, huh?” “My fingers and my legs, Hank,” the boy answers flatly. “They died first.” “You’re just cold. Here. Let’s see what we can work out. ...” After some effort he removes his belt and loops it beneath the boy’s shoulders; he ties the end of it through the leather trade patch at the back of his jeans and begins a slow climb back up the cramped tube; only during this climb does his casual tone flag. “Okay. Now listen, Lee: I didn’t figure this scrub pine supportin’ anything but you, not me an’ you together. So help by climbin’ if you can. But if you can’t help, for Jesus H. Christ don’t go to kicking and squirming! Here we go. . . .” He emerges into the wind and straddles the hole, standing. As he draws the boy up after him by the belt he feels the sand surrounding the hole begin to crumble. He takes a breath and heaves, falling backward and pulling the boy onto him. From the hole there is a soft thump and for a moment a dusty cloud of rotten wood smell hangs above the sand, then is chased away before the sandslinging hoofs of that gritty wind. “Let’s get our asses gone from here,” Hank says in a hollow voice and starts back across the dunes with the dog at his heels and the boy piggyback. “I reckon you know what you got into,” he says after a few minutes of silence. “A devil’s stovepipe, I guess.” “Yeah. That’s what the old man calls them. I didn’t know there was any left. You see, bub, this here was a pine forest a long, long time ago. These dunes didn’t useta be here, just trees. But the winds kept bankin’ the sand higher and higher and finally covered up the forest. Clean to the top of the trees. And the trees eventually rotted out, leaving these hollows where they useta be, maybe just barely covered at the top. An’ you stepped into one. A pretty good one, too, thank your lucky stars, because most people who fall into a stovepipe pull the stovepipe in after ’em an’ then ...But what I want to know is what in the goddam hell were you doin’ out here anyway, headin’ across the dunes to the ocean in the dead of night? Huh? Tell me that.” The boy doesn’t speak; his face is cold and wet against Hank’s neck, and the dilapidated mask flaps about them on its elastic string. Hank doesn’t ask again. “Anyhow, you ain’t never to come out here again. The devil’s stovepipe ain’t none too pleasant a place to spend a night, even Halloween. It’s lucky, too, I had me this old bluetick dog because the wind had blowed away all your tracks. ...Yeah. Oh! Say now—about what happened to ol’ Uncle Aaron the time he got in dutch in a hole. See, in the barnyard where we was putting in the hole, there was this old horse that Aaron kept around for his kids to ride, a old blind gelding who was twenty years if he was a day. Aaron’d had him all his worthless life, that old horse, and wouldn’t get shut of him for nothing. So that old horse knew ever’ inch of that barnyard, from the house to the fence and the barn to the pigpen. We kids used to put us on blindfolds and gallop him to scare ourselves, but he never hit a post or nothing. Well, anyhow, while we was there digging this outhouse hole, none of us’d even thought about that horse. Except Uncle Ben. And that was just the sort of thing Ben could think of. When he come up out of the hole for a water break he hollers back at Aaron and says, ‘Henry and the boy are going with me for a sip, Aaron; we’ll be back shortly!’ He pulled us off a piece from the hole and put a finger to his lips to me and Papa and says in a whisper, ‘Okay, now, shush. Watch this.’ “ ‘Watch what, you damn fool?’ Papa says, and Ben says, ‘Just keep shushed an’ watch this...’ “So Papa and I stood there. Ben went to trotting across the barnyard at that hole, pawing the ground with his boots and snorting. Keeping back far enough to where Aaron couldn’t see him. He even kicks a couple clods into the hole. “ ‘Whoa!’ Aaron yells. ‘Whoa! Get back there, damn you, get back! You’ll fall in here on me! Get back.’ “Ben kept it up, knocking more and more clods down. Aaron kept hollering whoa, louder and louder. Then all of a sudden the damnedest thing you ever saw; there was some scrambling and scuffling down there, and then zoom up out of there Aaron come! fifteen sheer foot of dirt, and not a rope nor a ladder, like a man shot out of a cannon. He never did know how he managed it. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1580/47044.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
