{"id":12789,"no":67,"title":"Chapter 66","content":"Papa and Ben hoorawed him about it all the way to the house and back. And you know, when we get back, what do you think? Down at the bottom of that hole there’s this old blind horse, sure enough, dead as hell.” When I finished telling little Lee that tale about the horse I had expected him to laugh, or call me a liar, or something. But he didn’t twitch a muscle. And I’d expected him to be scared stiff when I got him out of that dune hole, but he’d fooled me there too. He didn’t act scared at all. He was limp and relaxed—peaceful, kind of. ...I would ask him if he was okay and he’d say he was fine. I asked him if he was scared down there and he said for a while, and then he wasn’t. I asked him how come? I said, “Boy, I was scared from the second I went down that hole on that pine ladder to the second I come out.” And he thought for a while and said, “That canary I had? I was always scared somebody would leave a window open and a cold wind would kill it. And then the wind did kill it and I wasn’t scared any more of that.” And he sounded darn near happy about it. And now, when I ask him if he wasn’t scared of them punks that was giving him a hard time there on the beach, he acts the same way, giddy, like he’d been drinking. I ask him, “Didn’t them fool kids know that car could roll on you out in the surf that way?” “I don’t know. Perhaps. They weren’t exactly worried about it.” “Well, weren’t you?” I ask him. “Not as much as you were,” he says and sits there grinning with his teeth rattling together from the cold while I drive to Joe’s place; he looks pretty pleased about something. But for all his grins and good humor I can’t shake this nagging notion that he’d come to the ocean for the same reason he was headed across them dunes as a kid, and that I maybe had something to do with it this time too. Maybe the fuss I had with him last night after the hunt, maybe something else. Lord knows. I fill him in a little on what’s happened since this morning, how Evenwrite has come back with another report, so that people all know where the bone is buried now. “That’s probably one of the reasons them punks was giving you a tough time.” “And that explains their change of attitude,” he says. “They gave me a ride earlier this afternoon and they weren’t exactly pleasant, but neither were they trying to drown me—they must have heard the news at the root-beer dive. Maybe that’s even why they came driving down on the beach, to find me.” I tell him that could well be. “We’re none too popular around town right now. I wouldn’t be a bit surprised but what somebody on Main Street starts taking pot shots at us just for general purposes,” I say, only half kidding. “So naturally that’s right where we are going: to Main Street.” “That’s right,” I tell him. “To Main Street quick as we finish over at Joe Ben’s.” “May I ask why?” “Why? Because I’m goddamned if I’m gonna let a bunch of niggers tell me whether I can come into town or not, I don’t care how hacked they are at me—tell me whether I can have a Saturday-night drink in a public bar.” “Even if you weren’t planning to have that Saturday-night drink in the first place?” “Yeah,” I tell him; I can tell by the way he starts using his prissy tone that he can’t see my real thinking on it, no more than I can see his thinking on wanting to take a long swim in the cold ocean “—that is right.” “Curious,” he says. “And is that why Joe Ben called you? Because he knew you wouldn’t want to miss a chance to come into town and take advantage of the public hostility?” “That’s right,” I tell him, getting a little hacked. “There ain’t nothin’ I like better than walkin’ into a room knowin’ everybody there would like to take a pot shot at me. You bet. I like to take advantage is exactly right,” I tell him, knowing he ain’t going to see it anyhow. “I understand perfectly; it’s like the madman who goes over Niagara Falls in a coffee can because that’s as good a way as any to get dead.” “That’s right,” I tell him, knowing he don’t understand it at all—that it’s more because it’s as good a way as any to stay alive. . . . And as they hurry across the dunes toward town, matching steps in their haste—Hank in front with Lee close behind (and silent lightning fluttering softly out ahead of both of them)— the first drops of rain, like a thousand eyeholes opening on the white mask of sand, come winking down, and the eelgrass sways to a soundless tune.... Which brings to mind one more notion to add to the bit about Singers of echoes and Echoers of songs: the notion of Dance. Not the weekend dance in the Saturday-night sense, where you two-step to music you’ve heard before and always know—even if only in a cellular way—just about where your two-step is headed . . . but the Daily Dance with the wilder step, to a tune as soundless as the eelgrass tune, to an echo of a song or a song still unechoed. A dance where you can never really have much notion where you are headed. You can trip off to places so wild and so wiggy that you don’t know where you are until you get back. And sometimes not even know you tripped off at all because you never get back to know that you’ve left . . . And when Brother Walker had unplugged the organ and turned off the current of his wife’s electric guitar and finally brought his roaring sermon to a sweaty stop, all the dancing tripped-out congregation blinked and sighed and ruefully returned to the world of their weekday selves . . . except Joe Ben, wild-stepping and still sky-bound, with eyes that showed white all the way around the green iris and a soul that soared to a currentless music Sunday through Saturday. And never knew he was tripped-off at all. When he left the tent with his family in tow he walked to the pick-up and found Lee’s note, but before he had time to decide what to think about it one of the fellow followers of the faith had been so swept up by the services that he had felt called upon to put aside his natural antagonism toward the Stampers and bring it to Brother Joe Ben’s attention that a certain meeting was to be held shortly at the grange hall: “A meetin’ I bet is due to really affect you sonofabitching Stampers, too...this afternoon, with Evenwrite an’ the Strike Committee an’ Mr. Jonathan B. Draeger hisself!” he wanted Joe to know. “An’ if what comes to light in the course of this meeting is what we all expeck to come to light, Brother Stamper, then you heartless sonofabitches better be prepared to suffer the conch-aquences!” After the man stalked off, Joe stood for a time considering the information. If the conch-aquences of what come to light in that grange-hall meeting could affect him and the family so, well then maybe he just should observe that meeting person-ally....It seemed the least he could do, after that church brother’d had the common decency to tell him about it. He looked about briefly for Lee, then piled Jan and the kids into the pick-up and drove them out to the new house, where he left them with instructions for painting, then headed back to town. He returned to Wakonda by a wonderfully devious and roundabout route, angling closer and closer with meticulous caution until he had slipped up on the bayward side of Main Street without a soul the wiser. He parked the pick-up in the great banks of seeding Scotch broom behind the cannery and had a final cigarette while the bursting pods fired rattling shots at the windshield. He finished his cigarette, stepped out into the sunless afternoon, flipped up the collar of his leather jacket, and began sneaking up on Main Street as if he were stalking a wild and wounded beast and afraid of its turning and charging. The Scotch broom gave him cover until he reached the fishbone-strewn dock beneath the cannery. This concealed him up to the corner where the fire station was. After that it was clearing; the open stretch of Main yawned before him. He hitched up his trousers and struck up a merry whistle and stepped onto the walk, trying to affect an air of casual and purposeless strolling. He even found a beer can to kick along. He strolled safely past the Sea Breeze Cafe, past the soaped window of the real-estate office, past the five-and-dime, where a pasted display of black cats made of construction paper and pipe-cleaner whiskers observed his nonchalant stealth with respectful orange eyes. He cut across the street so he was opposite the Snag and walked on, his hands in the chest pockets of the cracked leather coat and his scarred face bent toward the cracked walk. He walked with a forced slowness that emphasized more than concealed his urgency. When he had passed and was out of sight of the Snag’s front windows he looked furtively up and down the block, then broke into a run back across the street. He settled again into his slow, casual walk, his back hunched and slanted slightly and his bowed legs taut with restraint. When he reached the place where the alley ran back beside the grange hall, he stopped, stepped completely off the sidewalk out into the gutter, squinted a casual eye down that alley like a town-league pitcher looking to a catcher for signals ...looked over his shoulder left, and over his shoulder right, checking the Snag up the street at third and the clouds leading off of first base down the street, then practically leaped out of sight into the narrow alleyway, as though the pitcher had suddenly decided he could dash unnoticed past the batter, ball in hand. All in all, he could not have drawn more attention to his actions with flags and cannonfire, but it was fortunately nearing dinnertime, with the Saturday ball game on TV and the sky dim and nobody on the streets to care about his actions anyway. Still, he stood with his back against the plank siding of the grange hall for a moment and listened for footsteps. The only sound came from the whistle buoy in the bay and the famished wind scratching in the garbage. Satisfied, Joe hurried on to the rear of the hall and leaped silently to the top of a woodbox and walked along it to a window. He looked through the window at the dim rows of folding chairs, then raised the pane a few inches, carefully. He tried for a moment to squat comfortably under the open window, gave up, and jumped down from the woodbox and heaved a great chopping stump up. It hit with the sound of a bass drum, and the open window banged shut. He climbed back on the woodbox, reopened the window, pushed the stump beneath it, and sat down to wait, with his leather elbows on his knees and his chin in his hands. He sighed and for the first time wondered why for the love of God in Heaven was he doing this, sitting here waiting to hear what he and Hank had both known for months was due to be said? Why? And why worry about how to tell Hank? or what Hank would do? Hank’ll just have to pull himself together and tell them, “Up yours,” like he knew already he would. Like Hank knows already he will have to tell them when they finish all the bullshooting and horseplaying that they are going to have to do in there. Like Hank has always had to do when all’s said and when all’s done, on account of that’s his place, no matter how he don’t like it. So why does Hank waste his time stewing about it? I always say to him it is our lot to accept our lot and the best way to accept that lot is back off and see what a ball it is, I tell him, back off and see what a boot in the rear it is! Because it is, it is, if you just back off and look at it with your mouth held right. And Hank could be gassed by this lot, he could, just like he likes having to milk the cow sometimes. Don’t I tell him so about a thousand times a day? Be gassed and happy and running around and loving every bit of it and even the bad stuff like this if you just hold your mouth right, Hankus. Now I don’t expect you to know the Redeemer liveth like I do, but you do know what’s coming up right here on earth, because I can always see in your eyes how you see already. So how come, when you can see already what’s coming up ahead and know already what you’re gonna have to do about it, why don’t you save yourself all this fretting and cut across to what you see coming and do what you already know has to be done...? But, then, I don’t know about that neither. Maybe not being able to cut across to what he sees already is part of that lot he’s got to accept. Because I recall what almost happened the one time, when we was sixteen or seventeen in high school, and he almost cut across to what he could see already, instead of going all the way around. Seventeen. Right the first few days when we’re enrolling for our senior year. We drive up and park his cycle in front of the front steps where everybody hangs around waiting for the eight-o’clock bell to ring. The guys are there, in blue and white lettermen’s sweaters, thick-weaved wool all messed up with initials and numbers and badges and golden-ball emblems and any other decoration they can sew or pin on. Standing there, they look like generals in some kind of slouchy army, leaning back to watch, reviewing the troops passing by. And a new guy on the steps too, a visiting general, with a yellow and red Lebanon High letterman’s sweater with just one decoration, just one, just a pair of tiny brass boxing gloves. There’s no boxing allowed at Wakonda, so he stands out with that one decoration. Hank isn’t wearing his sweater. He says it make him feel rinkydink. Guy Wieland gives Hank a corny wave he learned from pictures in Life about teen-agers. They don’t wave to me. They don’t know why Hank troubles with me. Guy waves. Watcha say, Hank? Not a whole lot, Guy. Oooh, feel that rubber tire there; pretty soft, ain’t it. Might be, Guy. Oooh, can’t have that. How was the summer, Hank? How? You felt, didn’t you? Pretty soft. ...I bet it was, Hank; oooh, feel that rubber tire; I bet you didn’t do anything all summer. I bet you didn’t do anything all summer except you and that hot-britches stepmama of yours all the time— Hank looks up into Guy’s face and smiles at him. Just a little smile and nothing mad or threatening about it. Just the littlest smile, pleading, to tell the truth, with Guy to lay off because he’s tired, the smile says, after a whole summer of just that sort of thing and fighting about it. Soft and pleading. But, pleading or no, there’s threat enough in that smile to shut old Guy Wieland off stone cold. And Guy fades back out of the way. There’s a minute with nobody talking and Hank smiling down again, like he was so embarrassed he could die, then, all of a sudden, the new guy from Lebanon steps forward to fill in the place Guy just emptied. So you’re Hank Stamper? Smiling himself, just like in the Westerns. Hank looks up and says yeah, like in the Westerns. Yeah, Hank says, and I say to myself right at that instant that Hank knows already what’s going to one of these days have to happen. Hank grins at the new guy. And his grin is just as tired and pleading and bashful as it was for Guy Wieland but I see he knows already, too. We stand around. Behind us, out on the playground, this year’s yell squad is practicing.","sourceLink":"http://novel.tingroom.com/jingdian/1580/47045.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
