{"id":12794,"no":72,"title":"Chapter 71","content":"Yes; all of them flee the shadows for the light. Some more, some less than others ...Then, just as Evenwrite opened his mouth to cap his build-up, the glass door rattled and Les Gibbons entered as though on cue. Everyone turned to watch Les’s lumbering dance as he shook the rain from his clothes. Evenwrite groaned at the disturbance, but Les didn’t get the hint; he stood slapping his soaked hat against his thigh, enjoying the spotlight his interruption had created. “That there river, fellas, she’s acomin’ up an’ that’s the truth. Boy howdy! I like to not made it. I tole the woman not to expect me back till mornin’, maybe, if it gets worse. So I hope somebody can put me up. Huh? Ifn I can’t make it back?” Evenwrite’s annoyed face suddenly brightened as he saw a way to salvage his point. “You drive in, Les? Up to Scaler’s bridge an’ across?” “I sure didn’t! My car ain’t give me any service at all ever since I lent it to my wife’s kid brother. Ruint it, I reckon. No, that’s why I say I barely made it: I had to give Stamper a phone call to come up and tote me across in his boat, an’ you know? I thought for a piece there the motherjumper wasn’t even gonna? Then he sent that Joe Ben ‘stead of comin’ himself, like he couldn’t waste his time on a ol’ boy up agin it.” Evenwrite tried again. “But someone drove you home by way of Scaler’s last night, Les ...how is it you didn’t call whoever drove you then?” “Why, I just didn’t consider it safe, Floyd! My yard’s warshed clean away. Never did that before, even in ’forty-nine. So I had my doubts about sections o’ that road from my place to Scaler’s. No time for the water to soak, y’ see, fellas; what with this much rain all to once after such a long dry—” “Ex-actly!” Evenwrite brought both fists down on the table with such sudden violence that Les stumbled backward over a chair. “What I was trying to tell you boys . . . just exactly!” Now by god we’ll just see about a better explanation. “You don’t know this, I guess, Mr. Draeger, but you boys, you know as good as I do, if you stop to think about it, what this hard rain comin’ down on bone-dry ground will do! What it will do to haulin’, to the whole of woods-workin’, if we don’t get on the ball and be goddam quick about it. I mean do something!” He nodded, letting them think about it. Les stood stiff and uncomfortable, immobilized by the legs of an overturned chair and the passion in Evenwrite’s words. He had never seen Floyd so forceful. None of them had. They watched him in uncomprehending silence; he strained his features before going on, the way some men clear their throats: “Because this ain’t just a rain, boys . . . it’s like the start of a execution.” He stood up and walked away from the table, rubbing the back of his thick neck. At the bar he turned. “A execution! A goddam knife tearing out ever’ goddam road on this side of the valley! Anybody want to cover my ten dollars that the Breakleg Spur is still in after that night of rain? Anybody want to try to take a crummy up to Pacific Camp or Feeny Creek by way of Spur Nineteen? I told you, goddam your thick heads”—his own round head swung from man to man—“and I tell you again, that if we ain’t back up on those slopes this very goddam week! this very sonofabitchin’ week, that, strike or no strike, picket or no picket, you can just mark her down that we’ll be spending every Monday mornin’ for the rest of this fuckin’ winter driving to Eugene to pick up unemployment checks!” He turned his back on the men and stood for a moment, feeling the men watching him, and Draeger watching all of them. Well, that oughta satisfy them as a better explanation. He waited, expecting Draeger to make a comment, but the silence he had wrought held, so he pushed it to its limit. He let his shoulders rise and fall in a heavy sigh. He rubbed his neck again. And when he turned back around, his red rubber-ball face had been arranged in sagging lines of fatigue and sacrifice. Teddy watched in the bar mirror All like frightened insects as Evenwrite returned to the table... and of all of them Even-write is the most frightened. “Boys ...I mean...you know the story, don’t you? You know what I’m talking, what I been the fuck talking about for a week now! An’ even before then I warned ’em, Mr. Draeger, I told ’em about my suspicions . . .” The one acting the toughest and the bravest, and the one most afraid of the forces of the dark . . . is Evenwrite. “Up till yesterday I kept that report secret, waiting till I was sure I was gonna get another copy . . .” Gibbons there is the scaredest-looking, but he’s too stupid to be as scared as he looks. “Up till yesterday afternoon you boys thought we were in pretty fair shape. I couldn’t get any action stirred up with all my claims about the Stampers, could I? You thought: ‘Hang on a while more.’ You thought: ‘WP can’t hold out much longer; they got to have the logs. They got to have a cold deck stockpiled for spring work.’ You thought we had ’em by the short hairs, didn’t you? Because a lumber company, it just ain’t going to make any money, you thought, without it has some lumber to sell! You thought: ‘Okay, so Hank Stamper is makin’ hay while his sun shines, but that’s no skin offn our noses. Live an’ let live. Can’t knock a man for fightin’ for his honest dollar,’ you thought, now ain’t that so?” He paused to glare about at the men; he hoped Draeger noticed how they one and all—even the Real Estate Man and that brother-in-law of his—dropped their eyes before his accusing gaze. Willard Eggleston, on the other side of Gibbons, he might be almost as scared as Floyd Even-write, though he does not make as much commotion. “Yessir . . . ‘Can’t knock a man for fightin’ for his honest buck,’ you thought.” Floyd had started to settle back into his chair. Now he jumped standing again. “But that’s just it, goddammit anyhow! All this time he wasn’t just makin’ his honest buck. While he was runnin’ around grinnin’ at us an’ shakin’ our hands he was cuttin’ our throats, just like that rain out there now is cuttin’ our log roads!” All of them, talking about rain and logging roads, when it is really the dark; if I were to cut the lights in here the whole lot of them would surely die of fright . . . Now Evenwrite was working to his climax; he was bent into a slight crouch, and he had let his voice become soft the way he’d seen Spencer Tracy do when he was whipping the cattlemen to action. “An’ I tell you boys this, you can mark her down: if we don’t some way talk that hardnosed so-and-so into breaking that . . . underhanded contract with Wakonda Pacific, if we don’t put the bind on them lard-butts owners like our strike was intended to do—get them running circles around themselves down there in Frisco and LA ’cause they need logs and lumber for the spring and they can’t stop to haggle about what they’re paying to get ’em—and if we don’t do this right soon, like before a couple of weeks of rain washes the roads so bad they can’t be fixed, you boys might as well tell your women either get used to the state’s fifty-two forty a week, or go to looking for you a different line of work!” He nodded with grim finality at his audience and, at last, turned triumphantly toward the isolated chair back from the others, where Draeger sat like a noncommittal casting director at an audition. “And ain’t that the way you see it, Jonny?”—flushed with confidence and drenched with sweat from standing too near the stove. “Ain’t that just about the way you’d sum up our position?” Teddy watched. Draeger smiled pleasantly, giving no indication of what he thought of the performance. The whole lot of them except this Mr. Draeger. He looked thoughtfully down into his pipe. “What is it you are proposing, Floyd?” This Mr. Draeger, he is really different. “What are you proposing, Floyd?” “A picket! I’m sayin’ we throw a picket around their mill. We shoulda done it a week ago, but I wanted to wait till you got here.” “What do we list as our complaint?” Draeger asked. “Legally, we aren’t able—” “Legal be damned!” Evenwrite erupted uncontrollably—not nearly as uncontrollably as his tone indicated but, by godfrey, it’s time to get off the pot! “Legal be screwed!” Draeger seemed mildly surprised by the outburst and held his flaming match motionless above the bowl of his pipe. “I mean, Jonathan—we got to get back to work!” “Yes, of course . . .” “An’ we got to do something about it.” “Perhaps . . .” Draeger frowned slightly as he sucked the pipe to life. “At any rate, do you have men willing to stand all day out in this weather?” “Shoot, yes! Les! Arthur, what about you? The Sitkins boys, they ain’t here but I’ll guarantee that they’ll stand. And me.” “Before you jump into this wet—and illegal—ordeal, I would like to make a suggestion, if I might.” “Jesus Christ—!” Like I ain’t been waiting a week for you to do something to earn your salary. “Sure we’d like to hear a suggestion.” “Why don’t we talk things over with Mr. Stamper first? Maybe save a lot of walking around in the rain.” “Talk things over? With Hank Stamper? You saw last night how the Stampers talk things over, like goddam savages. . . .” “I saw last night a man finally provoked into teaching a bully a lesson; what he did didn’t strike me as being particularly unreasonable. . . .” “Unreasonable is a word Hank Stamper was toothed on, Jonathan; talkin’ with him is like talkin’ to a signpost ...didn’t I go to him first off I got that first report? And I get what kind of reasoning? Dynamite throwed at me.” “Still, I think I would like to take a little ride up and ask the man if he wouldn’t reconsider his position. You and I, Floyd . . .” “You and me? I’m damned if I’ll go up to that place tonight.” “Come on, Floyd; the boys will think you’re afraid to be out after dark. . . .” “Jonathan...you don’t know. He lives on the other side of the river, for one thing, an’ no road in.” “Isn’t there a boat we might rent?” Draeger asked the room in general. “There’s Mama Olson,” Teddy answered quickly and avoided Evenwrite’s dark look. “Mama Olson, down at the cannery, sir, she’ll rent you a motor rig.” “But it’s raining out there,” Evenwrite wailed. “She’ll rent you rain gear too,” Teddy added, a little astonished by his own outspoken suggestions. He came gliding out from behind the bar to trip the lever in back of the pay phone. He held out the dial-toning receiver, smiling passively. “You can call her from here.” He watched Draeger nod a polite thank you and rise from his chair. He handed him the phone, almost bowing as he did. Yes. I do not understand why yet. But I know that this Mr. Draeger is no ordinary man. He is decidedly intelligent, and sensitive to a high degree, I am sure. And he may even be fearless, too. Teddy stepped back from the phone and stood, his little hands beneath his apron, watching the way all the others waited in respectful silence while Draeger got Mama Olson’s number from the operator and placed his call, like dogs waiting in mute and unquestioning obedience for the master’s next move. But he is also something more; yes, something wonderfully special . . . Alongside the statement about one man’s poison being another man’s high, one might as well add that one man’s saint can be another’s sore and one man’s hero can turn out to be that man’s biggest hang-up. And it was beginning to look to Evenwrite as though the hero he had so long awaited to come smooth out this Stamper hassle was turning out to be as big a hang-up as the hassle he had come to smooth.","sourceLink":"http://novel.tingroom.com/jingdian/1580/47050.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
