{"id":12796,"no":74,"title":"Chapter 73","content":"“I can’t sell to contractors that WP failed to fill contracts for if you guys go back to work and—” “Oh man, don’t you see, Floyd?” The material was too rich for Joe Ben to stay out of. He popped into the circle of light, his eyes blinking glee. “Don’t you see? Oh yeah. See. If we break our contract so you get your contract then they can meet their contracts with the contractors that you are saying we can contract to if we—” “What? Wait a minute—” Hank was trying to keep his amusement from becoming even more obvious. “Joe Ben means, Floyd, that if we let you guys go back to work we’re eliminating our market.” “Yeah, Floyd, see? Oh, I admit it’s deep. If we let you cut their lumber, then our lumber we aim to sell to them . . .” He took another breath and tried to start anew but gave way to a snorting explosion of laughter instead. “Screw all this,” Floyd growled. “. . . or if we let you keep our lumber”—this was the sort of material that could keep Joe going for days—“from becoming their lumber so your lumber can become their lumber—” “Screw it.” Floyd hunched his shoulders against the lantern light and clamped his jaw. “Just screw it, Joe Ben.” “You can always sell lumber,” Draeger said simply. “That’s right!” Evenwrite saw an opportunity to regain lost ground. He took Hank by the arm. “That’s why I say screw all this bull. You can always sell lumber.” “Maybe...” “Goddam you now, Hank, be reasonable. . . .” He drew a deep breath in preparation for another assault on Hank’s stubbornness, but Draeger cut in abruptly. “What are we to tell the people in town?” Hank turned from Evenwrite; something in the tone of Draeger’s question stripped the situation of humor. “What are you gonna what?” “What are we to tell the people in town?” Draeger asked again. “Why, I don’t care what you tell them. I don’t see—” “Are you aware, Hank, that Wakonda Pacific is owned by a firm in San Francisco? Are you aware that last year a net of nine hundred and fifty thousand dollars left your community?” “I don’t see what skin that is—” “These are your friends, Hank, your associates and neighbors. Floyd tells me that you served in Korea.” Draeger’s voice was placid... “Do you ever think that the same loyalty that your country expected of you overseas could be expected of you here at home? Loyalty to friends and neighbors when they are being threatened by a foreign foe? Loyalty to—?” “Loyalty, for the chrissake . . . loyalty?” “That’s right, Hank. I think you know what I’m talking about.” The soothing patience of the voice was almost mesmerizing, “I’m speaking of the basic loyalty, the true patriotism, the selfless, openhearted, humane concern that you always find welling up from someplace within you—a concern you might have almost forgotten—when you see a fellow human being in need of your help. . . .” “Listen...listen to me, Mister.” Hank’s voice was taut. He pushed past Evenwrite and held his lantern close to Draeger’s neat-featured face. “I’m just as concerned as the next guy, just as loyal. If we was to get into it with Russia I’d fight for us right down to the wire. And if Oregon was to get into it with California I’d fight for Oregon. But if somebody—Biggy Newton or the Woodsworker’s union or anybody—gets into it with me,thenI’m for me! When the chips are down, I’m my own patriot. I don’t give a goddam the other guy is my own brother wavin’ the American flag and singing the friggin’ ‘Star Spangled Banner’!” Draeger smiled sadly. “And what of self-sacrifice, the true test of any patriot? If you really believed what you say about yourself, Hank, you would be in for some pretty shallow patriotism, some pretty selfish loyalty—” “Call it whatever you want, that’s the way I intend to play it. You can tell my good friends and neighbors Hank Stamper is heartless as a stone if you want. You can tell them I care just as much about them as they did about me layin’ on the barroom floor last night.” The two men held each other’s eyes. “We could tell them that,” Draeger said, still smiling sadly at Hank, “but we both know it would be a lie.” “Yeah, a lie!” Evenwrite burst out of his angry reverie. “Because, goddammit, you can always sell lumber!” “Christ Almighty, yes, Floyd!” Hank turned on Evenwrite, relieved in a way to have someone to shout at again. “Sure I can sell lumber. But wake up and die right! use your damn head! Look!” He grabbed the flashlight from the still laughing Joe Ben and shone it down at the surging river; the black water eddied about the beam of light as though it were a solid pole. “Look at that push down there! Look! After just one day of rain! You think I can wrestle those booms of mine through a winter of this? I’ll tell you something, Floyd, old buddy, to make your trip worth while. Something to make your damn constipated heart burst out singing. We just might not make that deadline, you ever think of that? We still got another half-boom to fill out before we make our run. Another three weeks, and some of it the shittiest type logging in the world; we go up in the state park to finish off with. Steep logging, goddamn hand-logging! just like they did sixty or seventy years ago, because the State won’t let us bring cats and donkeys in for fear we might skin up some of the goddamn mountain greenery. Three weeks of flooding and primitive logging, an’ we’re liable to fall short. But we’re gonna work our asses at it, ain’t we Joby? And you boys are welcome to stand there and talk about men, women, and children, friends and neighbors and loyalty and that crap till the cows come home, stand there and talk about how they are gonna lose their TV sets this winter, and how the poor folks got to eat ...but goddammit I can tell you this, that if they eat it’s gonna be for some reason other’n me, or Joe Ben or the rest, some reason other’n us playin’ Santa Claus! Because I don’t give a goddamn! for my friends and neighbors in town yonder; no more than they give a damn about me.” He stopped. A cut on his lip had reopened, and he licked at it gingerly. For a second, in the circle of the lantern’s saffron light, the men waited. No one looking at the others. Then Draeger said, “Let’s go” and Floyd Evenwrite said, “Yeah, back where there’s still some brotherhood in this world,” and they picked their way in the dark back along the plank. Behind them Evenwrite heard a choking laugh start up again—“Break our contract to meet your contract so we can sell”—and heard Hank join in the laughter. “The toplofty cocksucker,” he said. “He don’t know it yet, but he’s real due to be brought down a few pegs.” “Uhuh,” Draeger agreed, but his thoughts were obviously elsewhere. At the boat Evenwrite snapped his fingers. “Damn. We should’ve asked him—” Then stopped cold. “No, no, I’m god-dammed if I will.” “Should have asked him what, Floyd?” “Never mind. Nothing.” “Nothing?” Draeger seemed amused and in even better spirits than before they had made this dumb-ass trip. “Ask him nothing?” “I guess nothing. I knew better. I knew it was like talkin’ to a signpost. We shouldn’t of come. We should of knew better. That’s exactly correct: we should of asked him nothing.” Evenwrite untied the back rope with blind, frozen fingers and climbed into the launch. “Darn,” he muttered to himself, feeling his way to the back of the boat. “I should of asked him anyway; he couldn’t of said more than no. And he might of come through, just out of contrariness. Then at least the trip wouldn’t been a complete goose-egg. . . .” Draeger returned to his seat in the front of the boat. “The trip wasn’t a goose-egg, Floyd,” he mused aloud, “not a goose-egg by any means.” Then, as an afterthought: “Should have asked them what?” Evenwrite gave the motor rope a furious yank. “For smokes! We should have asked him for smokes is what.” He got the motor started and swung the little running light away from the dark into the murky fume of rain, turning down river, he realized with a groan, just in time to buck the incoming tide. By the time Teddy saw Evenwrite and Draeger crossing the street back to the Snag, all the other men had gone home. From his lair of colored light near the front window he watched the way the two men moved after they entered the bar, studying them with veiled intensity: Floyd is uncomfortable. Evenwrite examined the wet ruin of his clothes with irritated and jerky pluckings. He is changed some since he came out of the woods and into the white-collar world, like a molting chicken that longed terribly to pluck at the annoying itch of its feathers, yet feared just as much to be naked. Floyd used to come in from work like the animal he is, wet and weary and not worried about it; a stupid animal, but a comfortable one ...He finally sighed and loosened his belt so he could sit without having his wet slacks cut him in half . . . Now he is just stupid. And scared. Floyd has added to the normal fear of the dark a worse fear: the fear of falling. After folding his pudgy hands across his stomach to try to conceal the bulge that had been building steadily since he had been voted into that white-collar world, Evenwrite sighed again with discomfort and disgust, and frowned across the table, where Draeger was still carefully hanging his overcoat. “All right, now, Jonathan . . . all right.” And worst of all, he is too stupid to know he isn’t high enough to fall very far. Draeger finished with his coat, then unhurriedly brushed the rain from his slacks; when he was satisfied he pulled out a chair and sat down and placed his hands on the table, one on top of the other. “All right?” he said, This Mr. Draeger, though, he’s up in a position of some height, looking as neat and composed as Evenwrite looked disarranged. “All right what, Floyd?” So why doesn’t he act afraid of falling? “What? All right what the fuck are we gonna dammittohell do is all right what! I mean to say, I’m waiting, Jonathan. Christ, I been waiting a week for you to show up around here an’ go to earnin’ your pay....I waited yesterday when you said hold off until you looked over the situation, an’ I waited today while you took a little joyride up to the Stamper house, an’ now I want to know what you aim to do!” Draeger reached into the breast pocket of his jacket for his tobacco pouch. “Do you suppose you can hold off until I fill my pipe?” he asked pleasantly. “And order a drink?” Floyd rolled his eyes and sighed again. Teddy came gliding out of his lair to wait beside the table. “I’d like a whisky if you don’t mind,” Draeger said, smiling up at him, “to take off the chill of that little joyride. You, Floyd?” “Nothing, no,” Evenwrite answered. Draeger said “one” with his lips adding, “I. W. Harper’s,” and Teddy melted backward into the throbbing light. Not any fear of dark, not any fear of falling . . . like he knows something the rest of us don’t. “Now, Floyd.” Draeger puffed his pipe to life. “Exactly what is it you expect me to do? You talk as though you expect me to hire a gang of labor goons and go back up there and burn the Stampers out.” He laughed softly. “That don’t sound like such a bad idea, for my money. Burn his whole by god business, mill, trucks, an’ everything.” “You’re still thinking in the thirties, Floyd. We’ve learned a few things since then.” “Yeah? Well, I’ve yet to see them. Leastways in the thirties they got results, those old boys did. . . .” “Oh? I’m not so sure. Not the desired results, anyway. Those old boys’ tactics quite often tended to make the opposition set its jaw and dig in firmer than ever—ah, here we are. . . .” He moved his arm to allow Teddy to place the shot glass of whisky in front of him. “Thank you—and, oh, Teddy—could I have a glass of water?” He turned back to Evenwrite and went on. “And, in this particular case, Floyd—unless I’m completely off base about Hank Stamper—I can think of nothing that would make the opposition set its jaw any firmer than burning his ‘whole by god business.’ . . .” He picked up the shot glass and smiled into its amber contents reflectively. “No, I don’t think one could choose a worse method against this man. . . .” “I don’t follow you.” “I think you do. You know this man better than I do. If you wanted him to travel east when he had it in his mind to go west, would you get behind him with a whip and try to drive him your way?” Evenwrite thought a moment, then slapped the table. “By god yes, I would! If he was heading toward walking all over me coming west. Yes! Even if it meant—even if it might mean him raising a fuss . . .” “Raising quite a fuss, too, in all likelihood, isn’t that right? A long and costly fuss, you could be sure. Even if you finally got your way. Because this man obviously thrives on physical opposition. He can understand it. He’s oriented to react like a boxer. If you hit him, he’ll hit back.” “All right, all right! I’m tired of hearin’ what Hank Stamper’ll do. I want to know what you aim to do now that you got him figured so good.” Teddy slid a small glass of water onto the placemat in front of Draeger and stepped back, unnoticed, watching. What is it you aim to do? “To be perfectly frank, Floyd, I think all we need to do is wait,” he said—What is it you know we don’t?— and tossed down the shot of whisky. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1580/47052.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
