{"id":12805,"no":83,"title":"Chapter 82","content":"“They’re all out here because they think I sold the business,” I told him. I told him what Lee’d said and how I figured Floyd Evenwrite and this other dude started the rumor. “So all those friendly folks of ours down there think they are in on the pie-slicing; that’s why the whole afternoon’s been smiles and shoulder-slapping, not from ions.” “But what for?” he asked, blinking his eyes. “I mean what for would Evenwrite—?” “Evenwrite wouldn’t,” I said. “Evenwrite wouldn’t have the sense. Evenwrite is more inclined toward planting spikes than planting rumors. No; it was this Draeger.” “Uh-huh,” he said, punching his fist in his palm and nodding; then he went to blinking again. “But I still don’t see what they was hoping to get outa that ...?” I took back the bottle, in as he wasn’t using it. I had me another sip and screwed the lid back on. “Just more pressure,” I said. “Like a squeeze play ...a way to make me look more the villain than before, even to my own folks.” He scratched at his bellybutton some more, thinking about that. “All right. I can see that, yeah; I can see how it ain’t gonna make some of the boys none too happy to be told they’re gonna be moved to work the woods when they was thinking the work was all over ...and how some of them might hardtime you a little. ...But I just don’t see for the life of me what good Even-write and Draeger thought it would do them.” 476 ken kesey I grinned at him while I put the bottle back in the drawer and slapped it shut. “Why, by gosh, I don’t see neither, Joby,” I said and wiped off my mouth. “Now that you mention it. No good at all. So let’s get on downstairs and see how we stand up under a little hardtiming. Let’s get on down there and show those dirteaters who’s one of the Ten Toughest Hombres This Side of the Rockies.” He followed me out of the room, still shaking his head. Good old Joby. Why anybody, dirteaters or no, would have to be showed something so obvious was way beyond him. (That heater is still humming when I go past the door. Viv is gone, down in the kitchen helping Jan. But Lee is still there. He sits there on that day-bed couch with that thermometer hanging out of his mouth, cleaning his glasses on one of her silk hankies, looking at me with that innocent look nearsighted people have with their glasses off. . . .) None of the folks did handsprings over the news, but Orland and his wife was the only ones that really hardtimed me. The rest just moped around smoking cigarettes while Orland claimed he was damned if he could see where I got off trying to dictate to the whole county, and his wife kept yapping That’s right! That’s right! like a hysterical lap dog. “Of course you—out here in the sticks like a hermit—you don’t have to worry about neighbors!” he kept telling me. “You don’t have a teen-aged daughter who comes home crying because the kids in school won’t vote her into the Y-teens.” “That’s right!” his wife barked. “That’s right! That’s right!” She was one of these little-bitty women with bulgy, bright eyes and too big teeth pushing out of her lips, like she was about to jump right out of her hide at you. “We also have a share in this business,” Orland said and waved around at everybody. “We also own stock! Shares! But do we get a chance to vote like other shareholders? Hank, I don’t know about the rest here, but I certainly don’t recall casting any vote of any kind for this deal with Wakonda Pacific. Or for going up to the woods and working for such a deal!” “That’s right! That is right!” sometimes a great notion “A share gets a vote; that’s how it’s supposed to be done. And my share votes we take this offer Evenwrite and these people are making!” “I’ve yet to hear this offer Evenwrite and those people are making, Orland,” I told him. “Yeah? Maybe that’s so and maybe not. But a considerable lot of the rest of us have heard it, and it sounds considerably better than anything you’ve offered.” “That’s right!” his wife barked. “That’s right!” “Orland, it seems to me that you—and that considerable lot of the rest of you—that you would all be a little slow in wanting your jobs sold out from under you.” “We wouldn’t lose our jobs. The union doesn’t want to put men to work in our jobs, just back to their own. We’ll keep our jobs, it’s just they would own the operation.” “The union not wanting to put men in our jobs sure comes as a surprise to me—considering how they been on my ass for years to get me to hire somebody other than family—but I do have to hand it to them for working it out so complete, jobs guaranteed and all. Did Floyd tell you this? My, my; I wouldn’t thought he concerned himself so over us. Was that who you heard it from? Floyd Evenwrite?” “Never mind who I heard it from, I have faith in the particular party’s word.” “You can afford to. It ain’t likely they’d fire you and have to train another sawyer....But some of us others might be a little easier to do without. Besides, you wouldn’t want to sell the old Stamper operation down the river after so many years of faithful service to us, now would you?” “So many years us serving the business, is what you mean. Ancient machinery, buildings . . . why, we’re still working a high-lead show, for the love of Pete! We’d be wise to get out from under it while the getting’s good—” “That’s right!” “—and I cast my vote to sell!” “Me too! Me too!” Some of the others started to stir around, talking about voting, and I was just about to say something when the old man 478 ken kesey suddenly appeared. “How many sheers you got to vote with, Orland?” He was standing in the kitchen door, eating a drumstick. I hadn’t even seen him come back from town; somebody must have ferried him over while I was upstairs. He was wearing the shirt that he’d won off Rod the guitar player once in a game of dominoes, a black rayon job wove all through with strips of tinfoil thread so when he moved it shimmied against his hard little gut like a burlycue costume. I saw he’d cut off more of his arm cast to give his arm more freedom with a bottle, and that he was feeling his oats. He took another chomp out of the drumstick and asked, “How many sheers some of the rest you boogers got? Eh? Eh? A hunnerd between the whole lot of you? Two hunnerd? You got any better’n two hunnerd, I sure will be surprised. Yes sir, I will be surprised. Because I don’t offhand recall—the old nigger’s memory ain’t what it was, I admit— but, see, there ain’t but about twenty-five hunnerd sheers in all, I’m blamed if I recall turnin’ loose any of my twenty-one hunnerd in the last year or so. . . . Hank, you sell any that hunnerd you useta have? No? Joe Ben, how about you?” He shrugged, then took the last bite off the drumstick and scowled down at the bone. “Lordy, but this is fine chicken,” he said and shook his head. “It sure looks like we oughta bought more, though, for a bunch this size. Because somebody’s gonna be short.” But not many hung around to eat, just Andy and John and one or two more. The others gathered up their coats and kids and followed Orland out to the dock, not having much to say, like they was stunned. I walked out with them and told the mill crew to meet at Scaler’s Bridge at six in the morning and they could ride up to the show on John’s truck. This set Orland off again; he said he was damned if he’d ride the back of a log truck in the confounded rain! ...But I went on like I hadn’t heard him, telling them how much we had to get done and where and by when, and mentioned that it was getting close on to the end of the year and that the men who hung in with me and didn’t miss any work—unless they were sick or like that— could probably look for a nice fat bonus at Christmas. Nobody sometimes a great notion said anything. Even Orland hushed. They stood around the dock while Big Lou yanked at the boat motor . . . just standing quiet and watching the perch nibble at the trash floating through the circle of dock light on the water. The motor caught and I said good night and I moved on back up the incline to the yard. Then, I just had reached the door when I thought I made out a far-off honking. I stopped and cupped my ear to see if I was right, and finally heard for sure a big flock way off to the northeast over the mountains. Joby’ll be glad to hear that, I thought, and started to go on in. I had the door open when I heard the crowd down on the docks go to talking. They thought they’d waited long enough, that I’d gone in—I was out of sight up behind the hedge and they didn’t have a notion in the world that I could hear them. Not just Orland and his wife, either, everybody. I listened a minute to their voices rattle around in the cold, all jumbled and excited and salty-sounding, all saying something different, but it all coming out the same, somehow. Like a round sounds with the singing all mixed. I’d hear one guy start on a particular gripe about the way he was being treated or the way he wouldn’t be able to face the people at church, and then all the others would come in on it like a chorus. And they’d keep that going until some other guy would come up with a variation; then they’d all take that up. And Orland’s wife’s voice, high and clear above all the rest, going like a pile driver: That’s right! That’s right! That’s right! Actually, it didn’t surprise me much what they were saying— it was about what I figured all of them’d been thinking all along anyway—but the longer I listened the less it sounded like they were even talking, let alone saying anything. The longer I listened, the weirder the sound got. Usually, when you listen to people talk, you’re where you can see what is coming out of who. Kind of hook the voices up with the faces and keep them separate that way. But when you can’t see the faces, then the voices get all mixed together, and the talk isn’t exactly talk any more, not even a mixed-up round...it’s just a mish-mash of noise coming at you, without any individuality, damn near without source. Just a sound, feeding on itself the way a sound will when you get a microphone picking up its own broadcast 480 ken kesey so it goes running in circles faster and faster and faster into finally just a high, tight whine. Eavesdropping has always hacked me, but I didn’t even think of this as eavesdropping, because it honestly didn’t seem that I was listening to a lot of people talk. It was just one sound, not a lot of people, just one building noise; and suddenly I realized it was getting louder and louder every second! Then I woke up to what was happening: those damn geese! While listening to the crowd on the dock I’d clean forgot about the geese. Now they were going right over the house, raising such a din I couldn’t even hear the people any more. Just more of those old honkers. I laughed at myself and headed on into the house; I was reminded of what Joby’s old man used to say about distraction, and how effective the spell of distraction was on women. (I go into the kitchen. They’re already eating . . .) Ben always claimed a woman was the easiest distracted of animals. He claimed he could walk up and go to talking to a woman, get her distracted, “and have her so hooked on the noise I was making that she wouldn’t even know I was in her drawers until I hushed talking to come!” (Lee isn’t at the table. I ask if he’s going to eat tonight or not. Viv says that he has a temperature again.) Well, I don’t know how reliable Ben’s claim was, but having that flock of geese get right overhead before I noticed them convinced me of the effectiveness of distraction in general, and that it worked on men as well as women. I wished, though, that it was the geese distracting me from Orland and his wife and all the rest goddam griping relatives, instead of vice-versa. (I tell her that everybody is running a fever this particular night, and Lee oughten think he’s special or let it keep him from eating. She says she has a plate set back for him that she’ll take up to his room ...) I remember wishing, in fact, that the geese would do more than just distract me; I was peeved enough with the relatives at the time that I wished the geese would get loud enough to drown them out completely! But that was still before the flocks really hit their peak; that was before I got as tired of the geese as I was of the people, before I got to wishing they would all shut up altogether. sometimes a great notion (...I sit down and go to filling my own plate. I ask Joe Ben to pass me the chicken platter. He picks it up and starts to pass it. There’s just a back left. He sees this and pulls back the platter and says Here, Hank, here, take this breast I don’t really want it I’m saving up for that old honker I’ll get me tomorrow so why don’t you go ahead and—He stops too late; I look around to see what’s wrong. Then, I see. The plate she’s set back for him on the warming shelf with all its chicken. I take the back and start eating. Everybody starts eating again, watching their plates. Then there is nothing but eating sounds for a long stretch before the people start talking again.) By that second week in November that year, all the little towns along the coast had become peacefully reconciled to the rain: they had elected, judged, and found it responsible for most of their troubles, and found responsible for the rain itself such impervious scapegoats as the satellites, or the Soviets, or their own secret and sinful ways; they had found something out-of-reach to blame and no longer minded the geese reminding them that “Winter is here, citizens, winter is sure enough here.” All the little towns except Wakonda. Wakonda, that year, hated the geese more than ever for their infernal night-long nagging about winter. The citizens weren’t being allowed the customary peace of blaming, like the other towns. These citizens of Wakonda, while they had judged and found their scapegoat every bit as responsible as the scapegoats in other towns, for some reason hadn’t had much say in their scapegoat’s election; and the particular candidate that had been forced upon them that year—for all his stand-offishness and his hardnosed obstinate ways—was just too damned available to be classified as out-of-reach and passed off as impervious. So the second week of rain brought to Wakonda none of the traditional fogginess that descended on Coos Bay, and Winchester Bay, and Yachats and Florence and all the rest of the muddy little coast towns where year after year citizens with drowsing but dreamless eyes drift foggily through their winters in a state of near-hibernation. Not to Wakonda, not that November. It brought instead to the town a wide-eyed insomnia, a great 482 ken kesey nuisance of geese, and a wild sort of grim and giddy spirit of dedication to the town’s Common Good—a spirit the likes of which the coast hadn’t seen since those big sky-watching sea-scanning war-effort days back in ’42 after that single Japanese plane firebombed the forest outside of Brookings to give the Brookings area the distinction of being the only American shore ever to suffer a foreign air attack. This sort of distinction is bound to provoke a certain amount of community feeling; the bombing and the strike, while they exhibited very little in common outwardly, were in a way quite similar in that both had the effect of making the citizens feel, well, feel just a bit...special? No; more than special; let’s admit it: it made them feel downright different! And there is nothing like feeling special for hustling a citizen out to round up every other comrade he can locate with a corresponding feeling; there is nothing like a sense of difference for getting a man lined up, shoulder to shoulder, with everybody as different as he is, in a dedicated campaign for the Common Good; which means a campaign either for the ramming of that difference down the throat of an ignorant and underprivileged and unholy world—this is only true, of course, in the case of a bona fide holy difference—or, at the other extreme, a campaign for the stamping-out of the thing that caused the damned difference in the first place. Meetings sprang up everywhere there was room and warmth enough, like mushrooms after lying dormant for months waiting for proper conditions. Everyone convened. Old hatchets were laid aside for the duration of the campaign. The young saw eye-to-eye with the old, the women stood solidly behind their men. The loggermen consorted with the construction men (although the roads still scarred the loggerman’s slopes) and the construction men with the loggers (though a lack of trees still left the roadbuilder’s efforts vulnerable to slides and settlings), and the churches went easy on the sinners. Folks had to get solidly together! Something had to be done! Something bold! And Jonathan Draeger, seemingly doing nothing but chat pleasantly during those days of crisis and insomnia, skillfully helped all the folks get solidly together, and gently aimed them toward the doing of that bold something. sometimes a great notion All except Willard Eggleston. Willard was too deeply involved in the preparations toward the doing of his own bold something to be expected to pick up on Draeger’s subtle, tossed-off hints aimed at putting the pressure on Hank; Willard just had too much of his own aims to see to during those first weeks of November, too many documents to prepare in private and too many last-minute papers to sign in secret, to have time for writing nasty letters or going out of his way to snub Hank’s wife on her visit to town. No; as much as he might have liked to join in the campaign, Willard would have to shirk his civic responsibility. He felt his time too dear, too personal and precious; at the most he couldn’t have devoted more than a few paltry seconds to the Common Good, though he knew the cause just and worthy. A pity, a real pity ...He would have liked to help. Yet Willard, in a few seconds, unknowingly did more for that good than all the dedicated hours of the rest of the citizens put together. When he reached his house the geese were still confiding with one another louder than ever in the dark overhead. The rain had grown heavier. The wind had become bolder, stronger, rushing at him from side streets with such ferocity that he had been forced to fold up his umbrella to keep from losing it completely. He closed the picket gate behind him and cut across the yard to the garage, going in the side door and sliding around the hushed black form of the car and into the house through the kitchen to keep from waking his wife. He tiptoed through the dark kitchen to the utility room that served as his office and pulled the door carefully closed. After listening a moment and hearing nothing in the house but the dripping of water from his coat onto the linoleum, he flicked on the light and walked to put the umbrella in the laundry tray. He sat down at the desk and waited until his heart ceased banging at his temples. He was glad he’d made it without waking her. Not that his wife would have spoiled things if she had awakened—he often came in this late; nothing strange—but she sometimes got up and came out to sit in that awful old ratty red housecoat on the stool in front of the heater, her hands laced about her knees and 484 ken kesey all bent forward like a shabby flamingo, to watch down her nose as he figured the profit and overhead in the ledger, sniffing and scowling and demanding to know what his plans were for keeping them out of the poorhouse. That was what he was afraid of tonight, how he might respond to her inevitable demand to know what he intended to do. Generally he would only shrug in henpecked silence and wait for her to provide an answer for him, but tonight he had something he could tell her—and he was afraid, for want of someone to listen, he might do just that. He opened the desk drawer, removed the ledger, and noted the night’s meager take, being sure to keep the tickets and concession separate. He closed the ledger and exchanged it for a brown manila envelope full of policies and legal documents; he pored over these for nearly a half-hour, then returned them to theenvelopeand pushed it farbackinabottomdrawerand piled other papers on top of it. He took a sheet of paper from a tablet and wrote a short letter to Jelly, explaining that he would see her and the boy after Thanksgiving instead of the day after tomorrow, because he’d made a mistake about the meeting of Independent Theatre Owners and it was to be in Astoria in the morning instead of in Portland. He folded the letter and put it in an envelope and addressed it. He stamped it and sealed it and closed it inside the ledger so it would look as though he had forgotten to mail it (that letter was going to do some toward showing the old flamingo her husband wasn’t quite the spineless rock-oyster she’d always called him); then he took out another sheet of paper and advised his wife his cold was much improved and that he thought he would drive on to Astoria tonight instead of sleeping a few hours and getting up early in the morning. Would have phoned about meeting change but hate to wake you. Weather might be worse in the morning the way it looks. So think it best to leave now. Will phone all the news tomorrow. Everything changing for better I am positive. Love, etc. He propped the note against the inkwell and returned the tablet to its drawer. Sighed loudly. Folded his hands in his lap. Then, listening to the solitary peck of water dripping from his coat onto the linoleum, began to weep. In complete silence. His sometimes a great notion little chin fluttered and his shoulders jerked with the violence of his sobbing, but he made not the slightest sound. This silence made him weep harder than ever—it seemed he’d been crying in secret for years—but he knew he wouldn’t let himself be heard. Especially now, no matter how it hurt to keep still. He was too practiced at keeping hidden within the black india-ink outline of his looks to ever destroy the effect of letting anyone know he could cry. It was arranged that he keep still. In fact everything— he looked at the neat note, the tidy desk, the umbrella in the laundry tray—everything was always so arranged, so worked out. He wished he’d been either a bit less thorough, or a bit more. He wished he’d arranged it so there had been at least one person available to cry out loud to, one person to share his secrets with. But there just hadn’t been time. If he had just been allowed to take his time and work things out more carefully, he might have devised a scheme capable of doing all that this one would and still let people know what he was doing! let someone know what he was really like. ...But this strike, coming when it did, and that Stamper making it go on and on until the money was all gone...there just hadn’t been time to work out something so fancy. All he could do was use his natural resources, his weak-kneed look, his wife’s belief in his cowardice, and especially the image of him held by the whole town: a rock-oyster, a creature soft and white living inside live rock and the rock more alive than its tenant . . . all he’d had time to use was this image, and never let a soul know what he was truly— He ceased the noiseless crying, raising his head: Stamper! He could tell Stamper! And because Hank Stamper was somewhat to blame for what had—was very much to blame! Yes! Whose fault was it that things were getting too tight for people to spend money on dry-cleaning or movie pictures? Yes; very much to blame! enough so he deserves to be told just what extremes his hardnosed obstinance can drive a man to! enough so he can be told and be trusted to keep the secret! because Stamper can’t tell anybody else what really happened! because what happened is his fault! Yes! Hank Stamper! He’s the one!— because he was to blame, and others would know this if he told, 486 ken kesey Hank Stamper could be trusted to keep the secret . . . compelled to keep it. Willard leaped from the chair, already composing the phone call, and headed back to the garage, leaving that coat dripping behind him. No longer concerned with silence, he heaved up the door of the garage and slammed the car door shut loudly as soon as he was behind the wheel. His hands shook so with excitement he broke the key chain starting the car and backed over his wife’s pyracantha bush on the way out. He was burning with excitement at the prospect of telling someone, bursting with enthusiasm for his plans. He saw the light blaze on in the bedroom window as he stopped in the street—good thing he’d decided to make his call from a booth instead of from his own phone—and, as he turned his headlights on bright and put the car into forward, swinging past his wife’s startled bedroom window and into the street’s double-barreled rifling of rain, he couldn’t help giving the old flamingo an impudent parting volley of horn blasts . . . “Shave and a haircut . . .” Perhaps not the all-illuminating farewell he would have preferred to leave her with, but enough, along with the letter in the ledger, to leave her wondering, enough to leave her forever with a bulge of doubt troubling her newspaper-flat picture of the man she thought she had known for nineteen comic-strip years, and perhaps even enough to give her an inkling of what that man in turn actually thought of her. “. . . six bits.” In his own letter in his own ledger, up in the woods, Lee struggles with a stubby pencil to illuminate his own particular reality to someone else—“Before moving on to farther-out explanations, Peters . . .”—secretly hoping in this way to throw a little light on the dim puzzle of his life for his own benefit: Do you recall, Peters, being introduced to this oracle? I believe I called him “Old Reliable,” as is my wont when bringing him into society to meet my friends: “Old Reliable, The Sentry of my Besieged Pysche.” You remember? I said that he was my faithful and sometimes a great notion constant lookout for danger, perched atop the loftiest mast of my mind, sweeping the horizon for any sign of disaster...and you said he looked like nothing more than plain old paranoia to you? I have said the same about him a time or two myself, I must admit, but, all name-calling aside, experience has taught me to trust his call of WATCH OUT to be as infallible as radar. Whatever perceptions he uses must be as sensitive to the slightest radiation of risk as a Geiger counter, because when his signal advises WATCH OUT it has always turned out that the advice was always founded in fact. But this time, as I ready my plan, for the life of me I can not see the danger he warns of. WATCH OUT, he screams down, but when I ask “Watch out what, old friend? Can’t you point to the danger? Can’t you show me where I have left room for the slightest element of risk? You’ve always been able to pick out the pitfalls before. ...Where awaits this peril you proclaim so positively?” In answer he only squawks WATCH OUT! WATCH OUT! over and over like a hysterical thinking machine, unable to point to a thing. Can I be expected to stay my hands much longer on such flimsy advice? Maybe the old fellow has flipped; maybe there is no specific risk, and the overall radiation of the scene has become high enough to blow his wiring and set him to hallucinating horrors that never existed at all. . . . \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1580/48160.html","bookId":1269,"book":{"id":1269,"title":"永不让步 Sometimes a Great Notion","description":"简介： 《有时冒出了一个伟大的念头》（Sometimes a Great Notion） 于1964 年出版，书名源自民歌有时冒出了一个伟大的念头/要跳入河中漂流 ，讲的是俄勒冈州某小镇两个独立谋生的伐木工人的故事，他们信奉的人生准则是永不屈服（`Never Give An Inch），虽然不如 《飞越布谷鸟...","cover":"http://novel.tingroom.com/file/upload/201606/15/10-22-01-86-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1580","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
