{"id":101899,"no":3,"title":"Page 3","content":"\"Hey!\" I yelled as I was tossed halfway across a leather seat, landing partly on it and partly on the floor. The door slammed behind me, and the car started off. \"Hey!\" I yelled even louder, clawing myself into an upright position. \"What the hell is going on here?\"\n The other eye-candy guy was driving, his gaze meeting mine in the rearview mirror for a moment before he said something in what sounded like German to the Italian guy. The latter answered with one word. \"Zorya.\"\n \"Oh, no, not you, too!\" I said, goose bumps crawling up my arms and legs. \"Look, you\u0027ve made a big mistake!\"\n \"I thought she was French,\" the driver said, his voice a pleasant baritone with a slight German hint to it. \"She sounds American.\"\n \"She is American, and she\u0027s not very happy right at this moment, so if you would kindly pull over and let her out, she won\u0027t have to either scream, or go stark, staring insane, whichever comes first!\" I said loudly, my temper finally frayed beyond repair.\n \"Kristoff - \" the driving guy started to say, his eyes flashing from the road, to the mirror, to his buddy.\n I grabbed for the door handle, so angry I was ready to throw myself out of the moving car to escape the two men. Quickly, the driver hit a button that locked all the car doors.\n \"Damned child locks,\" I cursed as I tried to pry the lock upward.\n \"She has the stone,\" the man identified as Kristoff said, his head jerking back toward me.\n \"It\u0027s not mine!\" I yelled, shaking the stone at him. \"I told the same thing to those other people, not to mention the ghosts.\"\n \"Ghosts?\" the driver said, looking more interested than skeptical.\n \"Yes. People who drowned on a ship, I think. A long time ago, but I\u0027m not whoever they\u0027re looking for, too. I\u0027ve never seen this stone before. I think it came in a book I bought this afternoon, a book that a Frenchwoman was trying to find.\"\n The unnamed man driving slowed down and pulled over in the parking lot of a darkened bank. \"What is your name?\"\n \"Pia Thomason. I\u0027m from Seattle, here with a tour group.\" My cheeks flamed to life again. I didn\u0027t think I could stand the contempt that was sure to be in Kristoff\u0027s eyes if I mentioned what sort of group it was. \"I bought a couple of used books this afternoon, and I think the bookmark must have been hidden in one of them, because I sure as shooting never saw anything like it before.\" Quickly I recounted the brief meeting with the woman in the square. \"The bookmark is probably hers.\"\n \"Bookmark?\" the driver asked.\n \"Yeah, it\u0027s a bookmark, see?\" I pretended my hand was a book and slid the silken cord over it.\n \"I can assure you, Pia, it is not a bookmark,\" the man said, smiling at me in the mirror.\n I couldn\u0027t help but smile back at him, charmed by the warmth in his expression. His face had a softer look to it than his harsh friend\u0027s, his green eyes slightly tilted up at the edges, with laugh lines radiating outward.\n \"That\u0027s as may be, but I assure you it\u0027s not mine. I was going to try to find the woman it belongs to, but there are so many people out, I doubt if I could spot her.\"\n He watched me for a moment before turning to Kristoff, who regarded me with suspicious eyes. \"She could be telling the truth.\"\n \"It\u0027s not likely,\" Kristoff answered. \"She saw ghosts.\"\n \"That\u0027s likely to be due to the stone, since I\u0027ve never seen anything weird before. Well, sometimes at the beach guys who think they are Speedo-worthy, but that\u0027s neither here nor there. And just an FYI - I hate being talked about as if I\u0027m not here even more than I hate being stuffed into a car and driven off without my consent. I believe technically this a kidnapping, and I\u0027m fairly certain it\u0027s illegal even in Iceland.\"\n They both ignored me.\n \"She was running from the sacristan,\" the nice one said.\n Kristoff\u0027s lips thinned. \"It is an act, Alec, put on to make us think just what you\u0027re thinking.\"\n Alec! Aha, a name at last.\n \"But - \"\n \"If you would oblige me by not believing everything a woman tells you, we might live to see this task done,\" Kristoff said, rubbing a spot on his chest.\n Contriteness filled Alec\u0027s face. I spent a moment musing just how much I liked his name, but dragged my mind back to the task of escaping the latest in what seemed to be an evening filled with strange episodes.\n \"You said the wound was healed. If it is still bothering you - \"\n \"It has long since healed, but it reminds me of the folly of taking people for granted.\" Kristoff\u0027s eyes glowed in the darkness of the car as he glanced back at me. \"It is said the blood of a Zorya can heal any injury.\"\n \"That\u0027s it!\" I said, holding up my hands. \"I\u0027m officially through. I\u0027ve been insulted, challenged, nearly brainwashed by some deranged cult, hunted, pleaded at by a pair of ghosts and leered at by a third, rejected, and now kidnapped, but when you start talking about using my blood, it\u0027s time for me to go to bed and pretend I never came on this trip. Since you\u0027re so determined to drive me somewhere, would you please drive to the Hotel Andersson? Thank you.\"\n I sat back in the seat, determined to hang on to what was left of my shreds of reason. If I believed hard enough that these two handsome, but clearly unbalanced, men were just taking me to my hotel, and not about to commit some sort of ghastly blood sacrifice, perhaps I could escape with my sanity intact.\n Alec considered me again with a not unfriendly eye. \"We could go to the bookseller, to see if it proves her story.\"\n \"That would just be a waste of time. The shop is sure to be closed at this time of night.\"\n \"If I was still talking to either of you, which I\u0027m not because I no longer recognize your existence, I would point out that although the shop was closed, there might be some sort of clue there as to the origins of the bookmark,\" I said, calmly examining a fingernail.\n \"She has a point,\" Alec agreed.\n I decided to unbend enough to give him a grateful smile. He returned it with a little wink. I started to feel a bit warm as another blush swept upward. Could it be possible he was flirting with me? A man as handsome as him? As unobtrusively as possible, I sat up a little straighter to maximize my good points (large boobs) and minimize the bad (rest of the body).\n \"Not really, but if you are going to insist on giving her the benefit of the doubt, we might as well get it over with quickly so we can take her before the council.\"\n \"Council?\" I asked, grabbing the backs of their seats and hauling myself forward. \"What council?\"\n Kristoff\u0027s face could have been made of granite, so cold was it and the accompanying gaze he cast toward me. \"I thought you weren\u0027t speaking to us.\"\n \"I have decided in the interests of avoiding an international incident that I will keep the lines of communication open. What council?\"\n \"The Moravian Council,\" Alec said, hitting the gas and sending us shooting down a bumpy street, making a tight U-turn to head back into the heart of town. \"Don\u0027t worry, Pia; if you\u0027re truly what you say you are, you have nothing to fear from the council.\"\n I sat back, grasping the seat belts, unwilling to strap myself in just in case I needed to make a fast getaway. \"Just out of morbid curiosity, what exactly is this Moravian Council? And what would happen if I wasn\u0027t telling the truth?\"\n \"You will be taken before the council to answer for the seventy-three deaths your people have caused over the last three years,\" Kristoff answered in a deep, lyrical voice that would have sent shivers of delight up my back if he hadn\u0027t clearly been repulsed by me, and obviously under the delusion that I was someone bad.\n \"My people?\" I asked, running my mind over my immediate family members. \"They run an apple orchard in eastern Washington. I don\u0027t think they\u0027ve conducted any mass executions in, oh, geez, years and years. Although with my brother, you never can tell. He\u0027s a Microsoft yuppie.\"\n My humor, sarcastic as it was, was not wasted on Alec. He chuckled and flashed me a quick grin in the mirror before returning his eyes to the road as we approached the square.\n Kristoff grunted and looked out the window.\n I figured it would take Alec forever to find a parking spot, but he solved the issue by simply parking sideways across a sidewalk. \"That is the bookstore?\" he asked, pointing to the end of the street, where it opened into the pedestrians-only square.\n I nodded.\n \"Let me see the books,\" Alec said, opening the door for me and offering his hand to help me out of the car.\n I was simultaneously charmed by the gesture and pleased by the warmth in his eyes. \"I\u0027m afraid I only have one of them. I dumped the other one when Mattias started after me.\"\n \"Mattias?\" Alec asked, examining the book I held out for him. He riffled the pages but found nothing.\n \"The sacristan,\" Kristoff informed him. He turned a hard gaze on me. \"Why, exactly, were you running from him?\"\n I was flummoxed for a moment when Alec tucked my hand in the crook of his arm, covering my fingers with his free hand as he led me down the street. It was a surprisingly intimate gesture, one that gave me more pleasure than I wanted to admit.\n Part of me, the vindictive, evil part that I really liked to pretend didn\u0027t exist, wished that Denise would walk past us at that moment. I wouldn\u0027t gloat, I wouldn\u0027t preen, I\u0027d simply smile and allow my two incredibly handsome escorts to accompany me.\n Fortunately for my ego, she wasn\u0027t present in the crowd who now pulsed and bobbed in that odd throbbing fashion large groups of people packed into a small space have when they attempt to dance. The music hit us with the force of a brick wall, and it wasn\u0027t until we slipped around to the back of the row of buildings lining that side of the square that I could make myself heard above the noise.\n \"No answer?\" Kristoff said, stopping at a metal door bearing a faded plaque with the name of the shop. One of his chocolatey brown eyebrows rose in mock surprise. I had the worst urge to yank it back down.\n \"I\u0027m not avoiding the question. I just didn\u0027t want to bellow it out in front of everyone,\" I said with dignity. \"I was running from him because he was just as mistaken as you two - he thought I was this Zorya person, and wanted to marry me.\"\n Alec pulled out a large set of keys and started applying them to the door.\n Kristoff eyed me from toes to nose. I flushed for the umpteenth time that night and, in order to forestall the obvious comment, said quickly, \"You can stop looking at me like I\u0027m a big, fat liar, because I\u0027m not.\"\n Kristoff blinked for a moment in surprise; then his face hardened into its familiar suspicious expression.\n For some reason, that just seemed to irritate me more than if he\u0027d come out and accused me of trying to pull his leg. \"You can believe what you want, but it\u0027s the absolute truth. The lady... what\u0027s her name... Kristjana mentioned Mattias and me getting married so he could die in my arms or something like that. So you can just wipe that you\u0027re-so-insane-you\u0027re-barking look right off your face.\"\n Behind me, Alec started laughing. Kristoff\u0027s eyes lit from within with anger, and for one horrible second, I thought he was going to hit me. But instead he took two steps forward, backing me into the wall of the shop. \"Do you have any idea who I am, woman?\"\n \"I know you don\u0027t like me, and I have to say that the feeling is reciprocated,\" I told him, my stomach quivering, but whether it was from fear or anger, I wasn\u0027t quite sure.\n Kristoff wrapped the long fingers of one hand around my throat, tightening them with uncomfortable pressure. \"I could kill you right now.\"\n Fear won out over the anger, but I wasn\u0027t going to let him see that. I clutched the material of my skirt with both hands to keep from grabbing at his wrist. \"If I\u0027m who you say I am, that would defeat your purpose,\" I pointed out, ignoring the fact that my voice was quavering. \"You\u0027d have to explain my death to the Brotherhood.\"\n A slow smile curled the very edges of his mouth, but didn\u0027t do much to warm up his icy gaze. \"I believe I would enjoy that.\"\n My eyes widened at the threat obvious in his voice, but before I could protest, Alec interrupted.\n \"Stop frightening her, Kris. It serves no purpose.\"\n His gaze continued to bore into mine for another few seconds, and I felt swamped by the waves of anger and hostility that all but rolled off him. He snarled something under his breath and released me, turning on his heel and stomping off down the alleyway.\n I collapsed against the wall, my legs feeling like they were made of tofu. Instantly, Alec was at my side, propping me up, peering down at me with a concerned look. \"Are you all right, Pia?\"\n \"Yeah. Your friend is a bit intense, isn\u0027t he? I\u0027m thinking anger management classes might be in order,\" I answered, rubbing my neck as I watched the dark silhouette disappear into the shadows.\n To my surprise, Alec defended his friend. \"He has no love for the reapers.\"\n \"Reapers?\" I pulled my gaze back to him. \"That\u0027s what the ghosts kept calling me. Who are they?\"\n \"Reapers were once Ilargi. That is, technically they still are, although they were divided into two types, sun and moon reapers. The former were called Ilargi before they were all but destroyed. The latter... well, that is a long story.\"\n \"Ah. The Brotherhood of the Blessed Light,\" I said, nodding.\n Alec eyed me for a few minutes before answering. \"You do know of the Brotherhood?\"\n \"No. Not really. I ran into a couple earlier, but that\u0027s all.\"\n I thought he was going to tell me about the organization he and his buddy belonged to, but instead he changed the subject. \"Kristoff had a mate. Not a Beloved, you understand, but a woman whom he considered his mate. Angelica and Kristoff were together for many decades. She was the first, killed three years ago. He has not forgotten her death. It haunts him still.\"\n \"Oh, how awful,\" I said, contrite at acting so rudely to a man who was mourning the loss of a loved one. \"Poor man. I had no idea... I\u0027m so sorry.\"\n \"It is no excuse for Kristoff scaring you, but it does, I hope, explain something about his mental state,\" he said, opening the door, which he\u0027d managed to get unlocked. He flicked on a tiny penlight, flashing it around the room. \"Let us hope we find something here to explain the unusual situation you say has clasped you in its grip.\"\n We made a fast search of the bookshop, but there wasn\u0027t much to be found. Alec went through the papers stuffed willy-nilly into the drawers of an old rolltop desk that served as the owner\u0027s filing cabinet, while I examined each book on the rack where I\u0027d nabbed my two books, flipping through the remainder to see if anything had been tucked inside any of them.\n Twenty-five minutes later we returned to the car to find Kristoff leaning against its side, his arms crossed, his expression hard but relatively neutral. He was silent as we approached.\n \"There was nothing,\" Alec admitted with defeat. \"But I do not discount what Pia has told us. I think we should investigate the matter further.\"\n Kristoff came close to rolling his eyes, I could tell. \"We have wasted enough time, Alec. We have few enough hours before dawn to reach the council as it is - \"\n Alec interrupted him, speaking in German.\n I gnawed on my lower lip for a moment as the two men argued. I had a decision of my own to make - did I want to stick around and try to make them see reason, or did I want to get far, far away from the scary Kristoff? There was nothing to guarantee that the next time he felt like throttling me, he would stop before actually killing me.\n Unbidden, my eyes went to Alec. Although Kristoff had more of a stark, visceral physical appeal, Alec was certainly no slouch in the looks department. If anything, he could be thought the better looking, since his expression was warmer and friendlier.\n I thought back to the twenty-five minutes we\u0027d spent together in the musty darkness of the bookshop. Twice he\u0027d brushed against me as we searched, and once, as he leaned over to fetch a scrap of paper, his arm pressed against my breast. He\u0027d apologized and moved away, but I could still feel the sensation.\n My fingertips touched my neck. Then again, I could still feel the steely grip of Kristoff\u0027s fingers.\n I shook my head sadly. Even if there was a spark of interest in Alec to be breathed to life, the whole situation had a bad feeling about it. The sane thing, my down-to-earth brain pointed out, would be to leave now and not look back.\n I did just that, not stopping to say anything, just spinning around and racing down the alley to the lighted square filled with people who would keep me safe. There was a shout that followed me, but I made it to the crowd without being stopped, breathing a sigh of relief that had far too much regret in it to make me happy. \"Second time lucky, I guess,\" I said to myself as I squirmed my way through the pulsing crowd to its center.\n \"Madam! Madam, please, you wait!\"\n A slight tug at the back of my shirt had me looking over my shoulder. The tiny Frenchwoman whom I\u0027d bumped into earlier was squeezing her way between couples, a worried look on her face.\n \"It is you; oh, I am so glad. I must speak to you. It is very important.\"\n I was so relieved to see her I could have whooped. \"Likewise! But maybe we should get out of here. I can barely hear you over the music.\"\n \"What?\"\n I bent toward her and repeated the suggestion. She nodded and pointed to the caf¨¦ where I\u0027d sent the ghosts. It was still open, serving the late-night crowd. I hesitated a moment, not wanting to remain out in the open where Alec and Kristoff could find me, but at the same time not wanting to face the ghosts when I was no closer to helping them. In the end, I chose the latter as the least worrisome.\n As I entered the caf¨¦, I saw Karl and Marta in the corner, huddled together. They stood at the sight of me, but I waved them back and squeezed myself into a chair at a tiny table. The sailor ghost was nowhere to be seen.\n \"Coffee?\" I asked the woman as she pulled out a mirror and checked her reflection.\n \"Non. Wine!\"\n \"I like how you think,\" I said, smiling, and asked the waiter for two glasses of the house red wine.\n \"You must think I am very forward, but I assure you, it is most important that I speak to you.\"\n \"As a matter of fact, I was looking for you, too.\"\n \"You were?\" she interrupted, taking the glass of wine the waiter offered. She took a small sip of it. \"But you do not know why I sought you?\"\n \"Oh, I think I do,\" I said, smiling as I held up a copy of the Regency paperback. \"Dancing people.\"\n She sagged in relief, reaching for it. \"You did find it. I thought that you must have when I asked the book man and he said that an English lady with curly blond hair had just bought it.\"\n \"You have no idea of the evening I\u0027ve had because of that thing,\" I said, dropping it into her hand. \"I don\u0027t think you know just quite what you\u0027re getting into, though. I assume you\u0027re the Zorya?\"\n Her eyes widened. \"You are of the light?\"\n \"No.\" I shook my head. \"But I had an introduction to the folks around here who subscribe to that religion, and I feel it only right to warn you about them.\"\n \"Warn me?\" She surprised me by laughing. \"Warn me about the Brotherhood of the Blessed Light?\"\n \"They\u0027re the Ilargi, aren\u0027t they?\"\n Her smile faded. \"No. Not anymore. It has been a millennium since that name was applied to us. We prefer the name Brotherhood.\"\n \"Then who, exactly, are the Ilargi? Every time I mention the name people start looking wary or scared.\"\n She toyed with the stem of her glass for a few moments, her gaze avoiding mine. \"The Ilargi were once brothers to my people. They were not of the light, but they served a purpose nonetheless. But they were corrupted and driven out, and now there are only a handful left. They have become tainted, you understand. They eat souls.\"\n \"That sounds pretty nasty,\" I said, the hairs on my arms standing on end. \"No wonder everyone gets a bit weird when the\u0027re mentioned.\"\n \"My people are trying to track down those Ilargi who remain, but it is not easy. They are cunning, you know? And they hide in the mundane world. But the Brotherhood is strong, so they pose us no threat.\"\n \"Well, I don\u0027t know about that,\" I said slowly, picking my words with care so as to avoid insulting her. \"I just know that the people I met tonight seemed to be under the impression that I was you, and that I was going to marry an Icelander named Mattias.\"\n \"The sacristan?\" Her smile was back, albeit with a wry cast. \"I have not met him, but yes, we are to marry. It was supposed to be tonight, but\" - she glanced at her watch - \"it is too late now. The ceremony will have to take place tomorrow instead. Oh, but here I am talking and talking and I have not even introduced myself. I am Anniki. You are... ?\"\n \"Pia Thomason. And can I just say how glad I am that you found me? If I had to explain to any more people tonight that I\u0027m not the Zorya, I think I\u0027d probably need locking up in a padded room. The ghosts will be thrilled to see you, too, although one of them is apparently wandering around looking for rum. I understand they need help going somewhere.\"\n \"Spirits? You have seen some? Ah, but that is to be expected.\" She set down her glass of wine, her smile fading. \"It is one of the jobs of a Zorya, you understand. We shine the light that illuminates the path of the dead.\"\n \"So I gathered. Better you than me, although I have to say that Karl and Marta seem like nice enough people. Er... ghosts. But still, I\u0027m sure they\u0027ll be delighted to know you can help them.\"\n \"It is the job of the Brotherhood. I will be the light the lost ones seek,\" she said simply.\n I sipped my wine. \"This is probably out of line for me to ask, but don\u0027t you find those Brotherhood people a little too... well, intense, for lack of a better word.\"\n She frowned a little frown. \"Intense? What do you know of the Brotherhood?\"\n I shook my head. \"Not much really, nothing other than some connection to northern lights and the moon.\"\n \"The light has its power in the moon,\" she said in all seriousness. \"But I see it is not that which disturbs you most. You were afraid of the Brotherhood?\"\n \"Not afraid, just a little uncomfortable,\" I hedged, not mentioning how Kristoff had threatened me.\n She was silent for a moment, sipping her wine before she leaned forward. \"You are mundane.\"\n I was a bit taken aback by the comment. Did she just insult me?\n \"You are not of our world, but you have kind eyes, and you have seen much tonight that most people will never know exists. I will tell you about the Brotherhood so that you will understand why they are intense. There is darkness in the world. You have felt it, have you not?\"\n \"You mean like terrorists and such?\" I asked, confused.\n \"No, that is part of the mundane world. I speak of true darkness - Dark Ones, they are called, although they are better known as vampires.\"\n \"Vampires!\" My urge to laugh died with a glance at her serious expression. Clearly she believed what she was saying... that or she was a very good actress going to a whole lot of trouble to pull my leg.\n \"Yes. They do not like that term because people fear vampires, and they wish for the world to view them as victims, rather than as the evil murderers they are, but you must not let yourself be fooled. They are born of darkness, and carry it within them, spreading their evil like a disease. You know that they have no souls?\"\n I blinked a couple of times and shook my head.\n \"It is so. They are born without them, damned just as demons are damned, only they do not bear the stench of Abaddon on them so noticeably.\"\n \"Abaddon being... hell?\" I guessed.\n \"More or less, yes. The vampires have existed since the beginning of man\u0027s time, hoping to dominate them, to infect them with their darkness until all the light is gone from the world. The Brotherhood seeks to destroy them, to wipe out their evil, to cleanse the world of the poison that they would use upon innocent people.\"\n \"Good god,\" I said, seeing the truth shining in her eyes. \"How can this have been going on and no one in the - what did you call it? mundane world - knew it existed?\"\n \"The Dark Ones are very clever,\" she said, sitting back. \"They hide themselves with mortalkind, blending in so that their evil is not discovered until it is too late. But the children of the light have existed through the ages to find them, to cleanse them of their darkness.\"\n \"Wow,\" I said. \"I\u0027m just... I guess I\u0027m flabbergasted that this has been going on around me and I had no idea. Vampires! We\u0027re talking about the same thing, right? Wait - are we talking about the sexy Frank Langella type of vampires who seduce women, or the Gary Oldman-scary bun-head guys who kill people?\"\n Anniki frowned. \"I do not know of this scary bun-head people you speak of, but I assure you, there is nothing romantic about the Dark Ones. They are heartless, soulless fiends who want only their own domination over the mortal world. And they are nearly impossible to kill.\"\n \"Really? So the old stake through the heart is just a fallacy?\" I asked, fascinated despite the horrible subject matter.\n \"It would slow one down considerably, yes, but not necessarily kill him unless it was done using the power of the light.\"\n \"Sunlight?\" I asked, thinking back to the stash of Buffy and Angel DVDs that sat next to my TV.\n \"They burn much easier than mortals, but it would take a long time exposed to sunlight to do more than cause them discomfort. They do not burn up in a flash as seen in movies.\"\n \"Huh. What do you know about that. Holy water?\"\n She shook her head. \"The Brotherhood has over the centuries worked out the best ways to destroy their evil. But we are not callous, heartless killers as they are - we call upon the light to cleanse the Dark Ones, to purify them in a ritual that allows them redemption rather than damnation.\"\n \"Holy Jehoshaphat,\" I said, shivering a little. I rubbed my goose-bumpy arms. \"I had no idea. No wonder the Brotherhood folk were so grimly determined. Where exactly do you fit in with all of this?\"\n Tears welled up in her eyes. \"My sister Sara... she was the last Zorya. She... she was killed two weeks ago, probably by a Dark One. They found her with...\"\n She slumped against the wall, digging through her bag for a tissue.\n \"I\u0027m so sorry. I had no idea. Please don\u0027t distress yourself by telling me any more,\" I said, feeling horribly gauche.\n \"No, it is all right. Sara would have wanted people to know how bravely she gave her life to the cause of the light.\" She gave a harsh little laugh. \"Some people call us reapers, you know. Reapers. As if that is all we do.\"\n \"I\u0027m sorry,\" I said again, not knowing what else I could say.\n She dabbed at her nose and eyes and made an effort to gather her control. \"When I heard that Sara had been killed, I was destroyed, you know? But then the Zenith told me that I was to take her place.\"\n \"The who?\"\n \"Zenith. It is a title, the name of the person who heads our order. Since I was not with Sara when she died, I could not take the stone from her. The Zenith told me to pick it up here before I went to marry the sacristan, but me, I am horrible with the directions, and I lost the information where to find the stone. But now you have found it for me, so I can take up the battle where Sara left it.\"\n \"That\u0027s really amazing of you,\" I said, still rubbing my arms. \"I don\u0027t know that I\u0027d be able to do something so selfless.\"\n She gave me a tremulous smile. \"You are not an ordinary mortal, Pia Thomason. I sense that about you. I have no doubt that you would do just fine as a Zorya.\"\n \"Well, luckily, we don\u0027t have to put such a generous assessment to the test.\"\n Anniki murmured an agreement as she glanced at her watch.\n \"You must be wanting to go meet with your people and see your hubby-to-be,\" I said, putting a couple of coins on the table before gathering up my things and standing.\n \"Yes, it is late, but I hope to find them before the sun rises.\" She pressed my hand. \"Thank you for guarding the stone so carefully, Pia. You are truly blessed by the light.\"\n \"Thank you,\" I said, wondering if that qualified as doing my good deed for the day. Somehow, casting my mind back over my actions of the evening, I had a feeling it wouldn\u0027t. \"Good luck with your battle. Oh, the ghosts! There are two of them in the corner over there. Karl and Marta. Want me to introduce you to them?\"\n \"Not yet. I will tend to them as soon as I have seen the Brotherhood. May the light continue to shine upon you,\" she said, waving good-bye as she hurried off into the dusky twilight.\n I glanced at the corner where the ghosts had been when we entered the caf¨¦, but they were gone. I wondered if they\u0027d given up finding their way, but decided it was Anniki\u0027s problem now.\n I made my way out of the caf¨¦ at a slower pace, mulling over everything she\u0027d said to me. I glanced around at the people strolling around the edges of the square, the center still being packed with dancers. Vampires! Wandering around pretending they were human! Who knew!\n \"Pia! What luck!\"\n Startled, I spun around, but it was a familiar voice that shouted out my name.\n \"Over here!\"\n My heart fell when Denise clawed her way over to me, one hand firmly on the sleeve of a balding man with a handlebar mustache. There was a look of desperation in his eyes that I wholly sympathized with. \"This is Sven. Or Lars. Or something like that.\"\n \"Oskar,\" the man said, giving me a faint smile.\n \"Nice to meet you.\"\n \"Still alone?\" Denise asked, pretending to look around. \"Aww. That\u0027s too bad, it really is.\"\n I bit back any number of retorts and just smiled a little smile. \"I\u0027m so tired, it\u0027s probably for the best. I think I\u0027ll go back to the hotel.\"\n \"Night\u0027s young yet,\" Denise said, grabbing Oskar with both hands and hauling herself up to him. \"But suit yourself. I suppose if I was in your shoes I\u0027d rather be by myself, too.\"\n I gave her victim a sympathetic smile and left Denise to her gloating, thinking with pleasure how her expression would change if she\u0027d known about the two men with whom I\u0027d spend the last hour, not to mention the odd, but now seemingly genuine, offer of marriage by Mattias.\n \"There you are! We\u0027ve looked all over for you. Are you going to the hotel?\" A hand descended on my arm, but it wasn\u0027t the hard, unyielding grip of Kristoff.\n Magda emerged from the crowd, her face flushed, her black eyes dancing. Immediately behind her our fellow tourist Raymond followed, his look of anticipation a clear indicator of how he expected his evening to end.\n \"I am. I\u0027m a bit tired, to be honest.\"\n \"We can get a taxi together. If there\u0027s a taxi to be had,\" Magda said, laughing as we wove in and out of the crowd toward the busiest of the streets. \"I think everyone in all of Iceland is here tonight!\"\n \"Certainly everyone in this town is,\" Raymond agreed. \"I\u0027ll see if I can find you ladies some transportation.\"\n Magda blew him a noisy kiss, taking my arm and walking slowly with me to the edge of the square. I listened with only half an ear to her giddy talk about how much fun she and Ray had during the celebrations, most of my attention being spent on scanning the people wandering around, but I didn\u0027t see anyone who resembled a fanged, murderous vampire.\n I sat in silent contemplation of the evening as the taxi that Ray had found whizzed us up the hill to the top of the town, where our hotel resided. I thought we passed the street that led to the church I\u0027d been to earlier, but was too distracted to pay much attention. Not to mention the fact that my brain was starting to feel fuzzy around the edges. Magda kept up a non-stop conversation that luckily required only the briefest of responses to keep going.\n \"... so outstanding, I never could have imagined anything so beautiful in a country that sounds like it\u0027s nothing but ice and snow. This is definitely the best money I\u0027ve ever spent,\" Magda said, shooting Raymond a mischievous look. \"I hope you\u0027re having a good time despite that bitchy Denise. She\u0027s just horrible, isn\u0027t she? And did you see that poor soul she got her clutches into? That man had no idea what he was in for when she spotted him alone. I wanted to warn him, but eh. He is a grown man, and certainly should be capable of telling her he\u0027s not interested in what she has to offer.\"\n The memory of nearly identical words directed at me made me squirm uncomfortably on the seat. Is that what I had appeared like to Kristoff? A desperate, man-hungry woman who lacked self-control? I would have rolled up into a mortified ball, but the thought of Alec\u0027s smile and the warmth in his eyes gave me a little courage. So his friend thought I was the worst sort of hussy - what did that matter when Alec had a better impression of me?\n What foolish thoughts. \"It doesn\u0027t matter at all what they think,\" I lectured myself as I got out of the taxi.\n \"No, of course it doesn\u0027t,\" Magda said, calmly climbing the stairs to the hotel\u0027s entrance. She paused to shoot me a conspiratorial smile as Ray paid off the taxi. \"You have something on your mind, dear Pia. Or should I say someone?\"\n My cheeks grew hot again, and I damned my Irish genes that allowed everyone to see my every blush. \"It\u0027s been an interesting evening. Eye-opening, in fact.\"\n \"Ah, like that, is it? Well, I don\u0027t doubt it\u0027ll improve. Ready for a little nightcap, Ray?\"\n I left them giggling and stealing kisses and made my way up to my room, emotionally exhausted by the evening\u0027s adventures. \n","sourceLink":"https://allnovel.net/zen-and-the-art-of-vampires-dark-ones-6/page-3.html","bookId":2207,"book":{"id":2207,"title":"Zen and the Art of Vampires (Dark Ones #6)","description":"Storyline: \n Zen and the Art of Vampires (Dark Ones #6) \n White picket fences can be dangerous to vampires. Sometimes a woman’s gotta choose… \n Pia Thomason doesn’t have a typical life, but she wants one. The husband, the kids, the house in the suburbs… With her fortieth birthday looming, she decides to do something drastic, and takes off on a singles’ tour through romantic Europe. \n But the few guys on the trip leave much to be desired—unlike the two men Pia sees in a small Icelandic town. Handsome, mysterious, and very dangerous… Just the sight of them puts her in a dither. When their paths cross again, Pia knows one thing for certain: Where vampires are concerned, love isn’t the only thing at stake.\n \n","cover":"https://allnovel.net/images/zen-and-the-art-of-vampires-dark-ones-6.jpg","author":"Katie MacAlister","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/zen-and-the-art-of-vampires-dark-ones-6.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:09:00 PM"}}
