{"id":100978,"no":13,"title":"Page 13","content":"“Connor, you can keep convincing yourself of that all you want, because if you truly believed that, you wouldn’t be sitting in my office, talking to me about it,” Dr. Peters sighed.\\n\\n “I got up from the chair and stood in front of the window. “I can’t stop thinking about her, and it scares me. She confessed her deepest secret to me the other night. She told me about her past.”\\n\\n “She isn’t keeping secrets from you. She wants you to know about her past, and she trusted you enough to tell you. I think you’re fighting your true feelings. Have you discussed anything about you or your past?”\\n\\n I walked over to the large bookcase and stared at the hundreds of books he had sitting on the shelf.\\n\\n “I told her about my sister and my nephew.”\\n\\n “That’s it? Connor, you have to open up to her if you want any kind of relationship. Take it one day at a time. I think the two of you being friends is a very good start, and from the sound of it, you’re very good friends already.”\\n\\n I walked over to the chair and grabbed my coat. “Thank you, Dr. Peters, but my time is up.”\\n\\n “I want to see you again when you come back from your road trip!” he yelled as I walked out the door.\\n\\n Chapter 9\\n\\n Shit, look at the time, and where is Denny? I paced back and forth in my office looking at my watch.\\n\\n Just as I was about to head out of the building, my phone rang, and it was Denny.\\n\\n “Denny, where the hell are you, man?!” I yelled.\\n\\n “Connor, I apologize, but I had to drive Ellery to the hospital,” he said calmly.\\n\\n “What, what do you mean?!” I asked in a panic.\\n\\n “She said she fainted at home and hit her head. I saw her on the street, trying to hail a cab with her hand over her eye, and I stopped. Connor, the cut is pretty bad.”\\n\\n I can’t even explain what I was feeling at that moment. I was worried sick about her. I felt this overwhelming need to rush to her side and comfort her. I flew out of my office and told Valerie to reschedule my meeting. Ellery was more important.\\n\\n I climbed in the back of the limo and told Denny to hurry up and drive me to the hospital. I saw the blood soaked towel on the front seat, and I instantly felt sick.\\n\\n “Please tell me she’s ok, Denny.” I said with a worried tone.\\n\\n “She’s going to be fine, Connor, just relax. She needs a few stitches, and she’ll be alright.”\\n\\n I sat there in silence as the trip to the hospital seemed to take forever. When Denny finally pulled up, I got out and ran to the reception desk, asking where Ellery was. The receptionist directed me down the hall and to the last room on the right. I took in a deep breath, and as I opened the curtain, Ellery looked at me. Her eyes lit up when she saw me. I walked over to her and asked her what happened as I gently stroked the area above her cut. My heart ached, seeing her sitting there and bleeding. She put her hand on my arm and told me that she was fine. Maybe I was making a bigger deal out of it than it was, but it upset me to see her hurt and in pain. I met Ellery’s friend, Peyton, and she told me that she had heard a lot about me. I was surprised to hear that Ellery had talked about me.\\n\\n Dr. Beckett came in, and I immediately grabbed Ellery’s hand and rubbed it softly with my thumb as he put four stitches above her eye. Her skin was soft, and it felt good to touch it. I wondered if the rest of her skin was as soft, and I wanted to find out. When Dr. Beckett was finished, he told Ellery that someone needed to stay with her tonight and monitor her for a concussion. Peyton tried to say she was staying with her, but I already made the decision that Ellery was staying with me. There was no way I was leaving her side tonight. Peyton didn’t seem too thrilled with the idea. She mentioned something about a girl’s night, and when Ellery turned her down, she looked disappointed. I was surprised by Ellery’s decision, but we were leaving in the morning, and she probably figured it would be easier if she stayed with me.\\n\\n As soon as Peyton left, I helped Ellery from the bed. I couldn’t help but still be worried about her.\\n\\n “Why would you pass out like that? Is there something wrong?” I asked.\\n\\n “I just took too hot of a bath,” she said as she grabbed her purse.\\n\\n “You need to be more careful,” I told her as I lightly took her arm, and we walked out of the room.\\n\\n She lightly smiled at me and briefly put her head on my shoulder. We were walking down the hall when a doctor, who Ellery seemed to know, stopped us. A worried look took over her face, and she seemed nervous. He asked her what happened and then ask how she was feeling. She told him she tripped over something in the hallway and that she was feeling well. She seemed like she was in a hurry to end their conversation. I asked her who he was, and she said she saw him a couple of months ago for a bad cold. She seemed agitated that I was asking questions, and I felt something wasn’t right.\\n\\n I took her back to her apartment so she can pack what she needed for our trip to Michigan. I couldn’t shake the feeling that there was something that she wasn’t telling me. I kept thinking about how she told that doctor that she’d tripped over something in the hallway instead of just telling him the truth. I walked to her bedroom and stood in the doorway with my arm up on the door frame. She didn’t see me at first as I stood there and watched her pack. I could stare at that beautiful woman all day. She looked up and smiled at me.\\n\\n “Why did you lie to that doctor and told him you tripped over something in the hallway?” I asked.\\n\\n “I don’t know. I wasn’t going to tell him I fainted. He would make a big deal about it and want me to get a bunch of tests done. That’s what doctors do,” she replied.\\n\\n “You said you took too hot of a bath,” I said, still standing in the doorway.\\n\\n She stopped packing her bag and looked at me. I could see the anger in her eyes. “I did, Connor, now let it go for fuck\u0027s sake. You talk about me asking a billion questions, but it’s different when it’s you, right?”\\n\\n I could see that I had upset her, and that’s the last thing I wanted to do. I walked over to her and put my hands on her shoulders. “I’m sorry. I didn’t mean to upset you,” I said as I looked into her pained eyes. She took her hands and cupped my face. They were so soft against my skin and it made me weak. I wanted to take her hands and softly kiss them. I wanted to taste her and feel her.\\n\\n “I’m sorry that I raised my voice; I’m just tired,” she said.\\n\\n She let go of my face and turned around to zip up her suitcase. I wanted more of her, and I couldn’t stand it anymore. I grabbed her arm and turned her around, pulling her into me and holding her tight.\\n\\n She needed to know that I was sorry. This was our first real hug, and it felt so good. To completely hold her and feel her entire body against mine was something I’d wanted to do since I first saw her. I didn’t say a word and neither did she. She kept her arms wrapped around me and her head on my shoulder. I took in the scent of her hair as it was arousing me. What was I doing? If I didn’t stop this, something was going to happen. So, I broke our embrace and told her we better get going.\\n\\n I picked up her suitcase and walked into the main living space of the apartment. Ellery excitedly told me about the sale of her paintings and how she was on her way to quit her job when she fainted.\\n\\n She was so excited about the sale of her paintings. Her eyes were dancing all around as she told me. I just hope she doesn’t get mad when she finds out that I’m the one who purchased them. As we were about to leave, Ellery’s phone rang. She asked me to grab a piece of paper out of her desk drawer so she could write down the address of the funeral home. I opened the drawer, found a blank piece of paper, and handed her a pen. I noticed a piece of paper sitting on top of some magazines that looked like a list. She had some things crossed off. I took notice that she wanted to go to Paris. I would have to take her there someday. It’s a beautiful city, and I want to be the one to show her. She hung up the phone and looked at me as I held the list in my hand.\\n\\n “What’s this?” I casually asked her.\\n\\n She walked over to me and took it from my hands. “Just a list of things I would like to do in my lifetime. I wrote it after Kyle moved out, kind of a new start on life list.” She took it from me and put it back in the drawer. We walked out and to the limo where Denny was waiting for us.\\n\\n I took her suitcase up to the guest room and she followed me, falling onto the bed. I set her suitcase in the corner and walked over to the bed. She had a big smile on her face as she laid there. I took in a sharp breath because of the images running through my head seeing her lying on her back. I had visions of her lying there nak*d with me on top of her. Stroking her and feeling every inch of skin. I had to quickly get it out of my head. I asked if she liked the bed, and she replied that she loved it.\\n\\n Damn that smile and what it does to me.\\n\\n It was around dinner time, and I asked her if she was hungry. She had a long rough day, and I’m sure she didn’t eat. I asked her if she wanted to order Chinese food, and she said it sounded delicious.\\n\\n I took her hand and helped her up from the bed. We headed down to the kitchen, and I pulled a menu out of the drawer. I sat beside her on the bar stool and leaned in closer to her as we shared the menu.\\n\\n “What do you like?” I asked her.\\n\\n “I like just about anything; surprise me,” she smiled.\\n\\n I took out my phone and placed the order for delivery. I got up from the stool, grabbed a bottle of wine with two wine glasses, and led her to the living room. We sat on the couch, Ellery facing me.\\n\\n She caught me off guard when she looked at me seriously and said she wanted to know more about me. She said she felt our friendship was one-sided. I think in a way she was right. I haven’t told her anything about all the women in my life or about Amanda and Ashlyn. I’ve only told her bits and pieces about me that I know wouldn’t hurt her. She’s been hurt enough, and she didn’t need me adding to her pain. I looked at her and ran my hand through my hair.\\n\\n “You’re right, and I’m sorry; I just don’t like to talk about my life with anyone. It’s not that it’s a bad life; I’m just a very personal person, and I like it that way.”\\n\\n She looked down in disappointment, so I leaned over and cupped her chin in my hand. I lifted it so that she was looking into my eyes. “Give me some time; this friendship thing is new to me. You need to understand that I’ve never been just friends with a woman before.”\\n\\n She wasn’t going to stop because she brought up how Ashlyn and I are friends. It made me nervous that she thought about her. I don’t want Ellery thinking about Ashlyn, and if I tell her about our relationship, she’s going to leave. I can’t and won’t let her go.\\n\\n “It’s different with Ashlyn, and I don’t want to discuss it now,” I said as I looked at her intently.\\n\\n Just then, the doorbell rang, and I got up to answer it. I brought the food with a couple of plates and silverware over to the couch. I’ve never eaten on the couch before, but it seemed like the right thing to do with Ellery. She was so casual about everything. I handed her a fork, but she asked me for chopsticks instead. I looked in the bag, pulled out a pair, and handed them to her. I opened up the Mongolian beef and started to put some on my plate. Ellery gave me a weird look. \\n\\n","sourceLink":"https://allnovel.net/forever-you-forever-2/page-13.html","bookId":1820,"book":{"id":1820,"title":"Forever You (Forever #2)","description":"Storyline: New York Times bestselling novel, Forever You is the highly demanded sequel to USA Today’s Bestseller, Forever Black. \\n Connor Black’s life consisted of his company and his use of multiple women. There was never going to be love, relationships, or a fairy-tale life. Emotionally dead and damaged, that stemmed from a personal tragedy, Connor Black vowed never to feel any emotion or fall in love with a woman. That was true until Ellery Lane walked into his life by accident and changed his life forever. He begins experiencing feelings and emotions that he never felt before and finds himself being drawn into her world. \\n You took the journey with Connor and Ellery as their love, courage, and strength were put to the test. You watched their worlds come together through her eyes in Forever Black, and now it\u0027s time to take the journey through his in Forever You.\\n","cover":"https://allnovel.net/images/forever-you-forever-2.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-you-forever-2.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:10:39 PM"}}
