{"id":86151,"no":26,"title":"Page 26","content":"Chapter 18 A few days passed, and I had my tech guy at Black Enterprises hack into Ellery’s computer via the email she sent me. She had been doing some research on a ‘Dr. Danielle Murphy’ from Cedars Sinai Grace Hospital in California. She’s a cancer specialist and Hematologist. Denny took a quick trip with me to Michigan to check out the airport Ellery was at. Peyton had told me that Ellery threw her phone in the garbage there to throw me off her trail. She knew I’d have it traced and find her in no time. I walked around and showed the different workers at the ticket counter Ellery’s picture. They said they hadn’t seen her until I came across a woman who said she was the one who had helped her. I found it strange because my tech guy couldn’t find any flights booked for Ellery. The woman told me she couldn’t give out any information regarding Ellery. I reached in my pocket and slid two one hundred-dollar bills at her and gave her a smile. She looked at me as I could tell she was thinking about something. She looked around and then leaned in closer to me as she put her hand over the bills. “She booked a flight to California; Los Angeles to be exact.” “I couldn’t find any record of that,” I said. She looked around once more. “She paid me off to put her ticket under a different name and let it go through.” I smiled at her, “Thank you.” I walked away, and Denny looked at me, smiling. “She’s a smart girl, and she’s playing one hell of a game. Have I told you, Connor, how much I love Ellery?” “Knock it off, Denny,” I said as I shot him a dirty look. We boarded my plane and flew back to New York. A week had passed, and I was missing her. It was killing me not to know what she was doing or what she was up to. I was in my office at the penthouse when I heard a light knock on the door. “Come in,” I said. Peyton walked through the door. “Peyton, is everything alright?” I asked in a panic. “Everything’s fine. I just stopped by to tell you that Ellery is ok physically, but mentally, she’s a wreck. She misses you, and I want to know when you’re going out to California to see her.” I sighed, “Her birthday’s next week. I’ll fly there before her birthday. There’s no way I will let her spend it alone.” “Why don’t you just go now? What the hell are you waiting for?” she asked. “I’m giving Ellery time. She went out there for a reason, and I’m giving her space. Remember, she’s the one who walked out on me.” Peyton rolled her eyes, “I’m going to be honest when I tell you that the both of you make me sick. Get over yourselves, and just love each other.” “I do and always will love her. Don’t worry, Peyton, I’ll make things right,” I smiled at her as she turned and walked out the door. Since I told Peyton that I would be in California for Ellery’s birthday, I got to thinking about what I should get her. I’m going to make sure that she has the best birthday she’s ever had. I remembered that time I was at her apartment, and I saw her list of things she wanted to do. It suddenly hit me; that was her bucket list. How the hell didn’t I see it before? On her list, it said she had always wanted to go to Paris, so I had Valerie make up two tickets. We would be taking the company plane, so we could go whenever she wanted to and stay for as long as she wanted. I also wanted to get her a piece of jewelry; something that represented the two of us. I grabbed my coat and headed to Tiffany’s. I was looking at the necklaces in the display case when something to the side caught my attention. I asked the saleswoman if I could see it. She pulled out a beautiful bracelet. It was made up of numerous infinity symbols that were encased in diamonds. I couldn’t stop thinking about the infinity symbol that was tattooed on her wrist. This bracelet was perfect for her as she was perfect for me. I walked out of Tiffany’s and headed to the Apple store. Her last gift was a new iPhone to replace the one she threw in the trash. I spent the next few days working a lot and trying to keep Ashlyn calm. It’s hard work trying to make up things to keep her busy and out of my hair. In a few short hours, I’ll be on my plane, heading to California to be with Ellery. I packed my bag and made sure I had her birthday presents tucked away safely. It’s almost a six hour flight, and I wanted to be in L.A. first thing in the morning because I didn’t know where she was staying. She went to some serious lengths to make sure she didn’t leave a paper trail. I had Denny drive me to the airport at 2:00 am. “Thanks, Denny, I appreciate you driving me at this hour,” I said as I got out of the limo. “No problem, Connor. Just bring Ellery home,” he smiled. “I will, I promise.” I boarded the plane and looked out the window as it took off down the runway and headed for California. It was around 8:00 am when I arrived in Los Angeles. I already made arrangements to have a rental car waiting for me at the airport. I drove to the area surrounding Cedars Sinai Grace Hospital. If I’m right, Ellery is staying somewhere close by because she loves to walk. I pulled up to a set of apartment buildings and walked inside the rental office. I showed the manager Ellery’s picture and asked if she was renting an apartment. The woman looked at her picture and said she had never seen her before. I thanked her and headed off to the next set of apartments. I searched four different apartment complexes in the surrounding area, and Ellery was not staying at any of them. I had one more down the block to try. I pulled up to the curb and walked around the side to the rental office. As I walked through the door, the manager gave me a strange look. “How can I help you, sir?” he asked. “I would like to know if this woman is renting one of your apartments,” I said as I showed him Ellery’s picture. The manager told me to hold on a minute and immediately called someone to come to the office. Within seconds, another man came through the door and stared at me. I was beginning to feel a bit uncomfortable. The manager, Mason, introduced himself to me and then introduced his partner, Landon, as well. I thought to myself that they must know Ellery. I asked them again if they knew Ellery, and Mason started jumping up and clapping his hands while saying yes. I breathed a sigh of relief. I’d finally found her. I asked them which apartment she was staying in, and they told me how she had gone to the store, but she’d be back soon. They both went on and on about how much they love Ellery. I smiled at them because it was impossible not to love her. I thanked them and walked outside to wait for her. I leaned up against the black Porsche I rented and waited for her to come back. Just as I checked my watch for the time, I saw her coming up the street. She was looking down, and it looked like she was taking the wrap off a candy bar. I smiled, because not only was she beautiful walking up the street, but also because she loved her chocolate. She looked up and came to a complete standstill when she saw me. “You’re a hard woman to find, Miss Lane,” I smiled at her. She dropped her bags on the sidewalk and ran to me as fast she could. She jumped up and wrapped her arms and legs around me as tight as she could. I closed my eyes as I held her, taking in the familiar scent that I’ve missed so much. I could tell she was crying as she buried her face into my neck. “I’ve missed you so much,” I whispered in her ear. “I’ve missed you too, and I’m so sorry,” she cried. Ellery lifted her head up, cupped my face in her hands, and kissed me passionately. Our tongues met with excitement and exhilaration as our long-lost kiss left us both breathless. Tears were running down her face as I put her down and softly wiped her cheeks with my thumb. “Let me look at you,” I said while I spun her around. I grabbed her and held her tight. “You look just as beautiful as when you left.” Mason and Landon emerged from their apartment, clapping. I explained to Ellery how the three of us already met and what great friends they were. Ellery took me to her apartment. I closed the door as she turned around and stared at me. I ran my finger softly down her jaw line and over her lips. “You have a lot of explaining to do, but first, I’m going to make love to you,” I spoke softly. I brushed my lips against hers and heard her gasp as my tongue trailed down her neck. It felt like forever since I tasted her. I wanted her more than anything else. I craved her and now it was time to satisfy my need. “You taste so good. It’s been too long, Ellery; I need you. I need to be inside you.” I picked her up and carried her to the bedroom, my lips never leaving hers. I set her down in front of the bed, lifted her shirt over her head, and tossed it to the side. My hands ran up and down her sides and over her h*ps as I unhooked her bra and let it fall to the floor. I cupped her warm br**sts and fingered her n**ples as my tongue explored her navel. I unbuttoned her shorts and made my way up to her br**sts with my mouth, lightly nipping her hardened n**ples. My body was on fire as was hers. She brought my face to her and kissed me, letting me know how much she needed and wanted me. I groaned as her hands took off my shirt, and her nails lightly dug into my back. I broke our embrace, kicked off my shoes, and tossed my jeans on the floor. I gently laid her down on the bed and hovered over her fiery body as I stared into her eyes. “You make me feel alive like no one ever has.” I moved my hands from her br**sts downwards until I reached the edge of her thong. I pushed it to the side and felt the warmth of her skin. She let out a moan as I slowly inserted one finger and felt her excitement. Her moan grew louder as I inserted another finger. “Ellery, you’re so wet,” I whispered in her ear. “This is what you do to me, Connor. Feel every bit of it,” she said. I slid in my fingers in and out of her slowly as she arched her back, forcing them to go as deep as they could. I circled her cl*t with my thumb and felt it swell with pleasure. My mouth found their way to her lips as our tongues joined each other and danced. “I want you to come now, while my fingers are inside you and pleasuring you,” I whispered as I softly kissed her neck. Her body started to shake as she let out a scream of pleasure. I smiled as I softly kissed her lips, “That’s my girl.” She reached down and firmly grabbed my hard c*ck in her hand, moving her fist up and down the shaft in a slow and steady motion. The feeling was amazing as every nerve in my body was tingling. “Oh god,” I moaned as she moved her thumb over the tip in circular motions. She started to sit up, and before I knew it, I was lying flat on my back. She smiled as she straddled me and my c*ck slid in her with ease. I titled my head back as I felt her form around me. She was taut and warm as she slowly moved up and down, taking in every inch of me. I fondled her br**sts and grasped her hard n**ples between my fingers, tugging and rubbing them. We stared at each other as she swiftly moved her hips. I grabbed her h*ps as she rocked herself in slow circles. She was amazing and she felt so good. I could feel her swell around me, and that she was getting ready to come. She started moving up and down at a faster pace. She had me so close that I could barely stand it. Our breathing became rapid as she moaned when I placed my thumb on her cl*t and rubbed it as she f**ked me. “Ellery, come with me, baby,” I panted. “I want us to come together, and I want to hear what I do to you.” She screamed my name as she released her orgasm all over my cock, and I filled her body with my come; never taking our eyes off each other. She collapsed on my chest, and I held her tight, letting our heart rates slow down. I kissed the side of her head, and she turned and smiled at me. She rolled off me and laid herself on her side, running her finger across my chin as I tucked her hair behind her ear. I asked her what she was thinking, and she told me how happy she was that I found her. I slowly leaned in and softly kissed her lips.","sourceLink":"https://allnovel.net/forever-you-forever-2/page-26.html","bookId":1820,"book":{"id":1820,"title":"Forever You (Forever #2)","description":"Storyline: New York Times bestselling novel, Forever You is the highly demanded sequel to USA Today’s Bestseller, Forever Black. Connor Black’s life consisted of his company and his use of multiple women. There was never going to be love, relationships, or a fairy-tale life. Emotionally dead and damaged, that stemmed from a personal tragedy, Connor Black vowed never to feel any emotion or fall in love with a woman. That was true until Ellery Lane walked into his life by accident and changed his life forever. He begins experiencing feelings and emotions that he never felt before and finds himself being drawn into her world. You took the journey with Connor and Ellery as their love, courage, and strength were put to the test. You watched their worlds come together through her eyes in Forever Black, and now it\u0027s time to take the journey through his in Forever You.","cover":"https://allnovel.net/images/forever-you-forever-2.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-you-forever-2.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:10:39 PM"}}
