{"id":533,"no":3,"title":"CHAPTER II","content":"Enters the Daventry Academy to be trained for the Ministry—Goes to Needham Market—His Life, Work and Privations there. \\n\\n \\n\\n Accordingly, in 1752, he was sent to Daventry, then under the charge of Mr Ashworth. He was now nineteen. Although of a weakly constitution, his health was sufficiently re-established to enable him to stand the strain of preparation for the calling to which he now assiduously devoted himself. In mental equipments he was so much in advance of his fellows that he was excused all the studies of the first year and a great part of those of the second. He remained at the Academy three years. \\n\\n \\n\\n No student ever dwelt more fondly on the memory of his Alma Mater than did Priestley on Daventry and all that it meant to him. Its atmosphere was wholly congenial to him, steadying, stimulating and strengthening the naturally vigorous powers of his mind. It was, he says, peculiarly favourable to the serious pursuit of truth, and every question of much importance, such as liberty and necessity, the sleep of the soul, and all the articles of theological orthodoxy and heresy were the subjects of continual discussion between the teachers and the taught. The general plan of studies was exceedingly favourable to free inquiry: the students were referred to authors on both sides of every question and were required to give an account of them, abridging the more important for future use. \\n\\n 18 \\n\\n \\n\\n Concerning this small seminary for the training of Dissenting ministers, the Rev. Mr Hargrove in his account of Priestley in the Inquirer of 1904, says:[4]— \\n\\n \\n\\n “A miserable little place it must have seemed to the eyes of neighbouring clergy, with nothing in it of the venerable traditions, the ancestral wealth, the beauty and the dignity of the old colleges at Oxford and Cambridge. There was nothing grand about this building, nor did any sacred associations hallow its homeliness. But while the lamp of learning burnt low in the ancient universities during the eighteenth century, their gates kept fast closed against all who were too intelligent not to doubt the doctrines of the Established Church, or too honest to conceal their doubts, it burnt bright and clear, tiny though the flame might be, in obscure and poor haunts like this of Daventry. As Priestley proudly, and not untruly, boasted, at a later time, to the Prime Minister of England: \\n\\n \\n\\n “‘Shutting the doors of the universities against us, and keeping the means of learning to yourselves, you may think to keep us in ignorance and so less capable to give you disturbance. But though ignominiously and unjustly excluded from the seats of learning, and driven to the expedient of providing at a great expense for scientific education among ourselves, we have had this advantage, that our institutions, being formed in a more enlightened age, are more liberal and therefore better calculated to answer the purpose of a truly liberal education. Thus while your universities resemble pools of stagnant water secured by dams and mounds, ours are like rivers which, taking their natural course, fertilise a whole country.’” \\n\\n \\n\\n The manner in which he occupied his time, the range of his studies, and the miscellaneous nature of his reading at Daventry, may be seen from his following extract from his journal for 1755:— \\n\\n \\n\\n BUSINESS DONE IN JANUARY, FEBRUARY AND MARCH \\n\\n \\n\\n Practical \\n\\n \\n\\n Howe’s Blessedness of the Righteous; Bennel’s Pastoral Care; Norris’s Letters and Some Sermons. \\n\\n \\n\\n 19 \\n\\n \\n\\n Controversial \\n\\n \\n\\n Taylor on Atonement; Hampton’s Answer; Sherlock’s Discourse, vol. i.; Christianity not founded in Argument; Doddridge’s Answer; Warburton’s Divine Legation; Benson on the First Planting of Christianity; King’s Constitution of the Primitive Church. \\n\\n \\n\\n Classics \\n\\n \\n\\n Josephus, vol. i. from p. 39 to 770; Ovid’s Metamorphoses, to p. 139; Tacitus’s History, Life of Agricola, and Manners of the Germans. \\n\\n \\n\\n Scriptures \\n\\n \\n\\n John the Evangelist; The Acts of the Apostles; The Epistles to the Romans, Galatians, Ephesians; 1 and 2 Corinthians, in Greek; Isaiah to the 8th chapter, in Hebrew. \\n\\n \\n\\n Mathematics \\n\\n \\n\\n Maclaurin’s Algebra, to part ii. \\n\\n \\n\\n Entertaining \\n\\n \\n\\n Irene; Prince Arthur; Ecclesiastical Characters; Dryden’s Fables; Peruvian Tales; Voyage round the World; Oriental Tales; Massey’s Travels; Life of Hai Ebn Yokdam; History of Abdallah. \\n\\n \\n\\n Composition \\n\\n \\n\\n A Sermon on the Wisdom of God; An Oration on the Means of Virtue; 1st vol. of the Institutes of Natural and Revealed Religion. \\n\\n \\n\\n With one of his classmates he engaged to rise early and so “dispatched many articles of business every day. One of them, which continued all the time we were at the academy, was to read every day ten folio pages in some Greek author, and generally a Greek play in the course of the week besides. By this means we became very well acquainted with that language and with the 20 most valuable authors in it.... My attention was always more drawn to mathematical and philosophical studies than his was.” \\n\\n \\n\\n Throughout the whole of his time at the academy, and despite the attractions which scholarship and literary studies had for him, and notwithstanding his eagerness to satisfy “the immense range of his curiosity in all things, physical, moral or social,” he never, he says, lost sight of the great object of his studies, which was the duties of a Christian minister. \\n\\n \\n\\n “There it was that I laid the general plan which I have executed since. Particularly I there composed the first copy of my Institutes of Natural and Revealed Religion, Mr Clark, to whom I communicated my scheme, carefully perusing every section of it and talking over the subject of it with me.” \\n\\n \\n\\n What three years of this mental, moral and intellectual discipline meant to the young Arminian may be summed up in his own words: he saw reason to embrace what he says is usually called the heterodox side of almost every question. And this notwithstanding that Dr Ashworth was earnestly desirous of making him as orthodox as possible. \\n\\n \\n\\n “Notwithstanding the great freedom of our speculations and debates, the extreme of heresy among us was Arianism; and all of us, I believe, left the academy with a belief, more or less qualified, of the doctrine of atonement.” \\n\\n \\n\\n Priestley, even at this early stage in his career, gave abundant proof of that resolute regard for truth which constituted the motive power of his life. His sturdy independence of thought, and his almost passionate resentment of dogmatic authority—among the most significant of his intellectual traits—were plainly manifested in his youth and early manhood. They continued to 21 the end to be the dominant notes of his character and to be the springs of his action. They were at once the sources of his strength and the causes of his misfortunes. \\n\\n \\n\\n Priestley had now finished with Daventry. He was twenty-two years of age, and ready, and indeed eager, to minister in all the glory of a full-bottomed wig to any congregation that might solicit his services. \\n\\n \\n\\n The young divines at the academy were an unworldly set, taking but little thought of their future situations in life. They often, indeed, amused themselves, as Priestley tells us, with the idea of their dispersion in all parts of the kingdom, after living so happily together, and with the camaraderie of youth used to propose plans of meeting at certain times, and smile at the different appearances they would probably make after being ten or twenty years settled in the world. \\n\\n \\n\\n Priestley set out on his career with the highest ideal of his calling; indeed to him the office of a Christian minister was the most honourable of any on earth, and he had no other ambition than to distinguish himself by his application to the studies proper to that profession. That he laboured unselfishly and with no idea of place and preferment is certain from the circumstance that he suffered from a physical disability which he must have recognised could not but tell strongly against his chance of worldly success. He had an inveterate stammer which, at times, made preaching as irksome to him as it was trying to those who had to listen to him. In spite of many and repeated attempts he never wholly overcame this trial. And yet nothing is more characteristic of him than, as he reviewed his career in the evening of his life, he should see that, like St Paul’s thorn in the flesh, his impediment had not been without its use. \\n\\n \\n\\n 22 \\n\\n \\n\\n “Without some such check as this,” he says, “I might have been disputatious in company, or might have been seduced by the love of popular applause as a preacher; whereas, my conversation and my delivery in the pulpit having nothing in them that was generally striking, I hope I have been more attentive to qualifications of a superior kind.” \\n\\n \\n\\n The thorn in the flesh was probably not without its use in other ways. It probably drove him to literature. If he had none of the graces of pulpit oratory, he had at least the gift of facile composition. If he could not hope to move men’s minds by oral appeals, he might aspire to sway them by the power of the pen. \\n\\n \\n\\n His first call came from an inconsiderable congregation at Needham Market in Suffolk. It was a poor and needy place, nominally under the charge of a superannuated minister, the prospects bounded by the possibilities attaching to a stipend of forty pounds a year. And these prospects, limited as they were, were still further curtailed by Priestley’s own action. He found that his congregation had been used to receive assistance from both Presbyterian and Independent funds. Priestley was no longer in the mood to receive assistance from the Independents, and told his congregation that he “did not choose to have anything to do” with that body. That little difference between the elders and himself concerning the sin of Adam and its consequence, together with his three years’ sojourn at Daventry, were beginning to bear fruit. The congregation readily consented to give up the Independent fund and promised to make good the deficiency themselves. Priestley, however, quickly realised that they deceived themselves either as to their ability or their willingness to redeem this promise, for the most, he says, he ever received from 23 them was in the proportion of about thirty pounds per annum. They also deceived him in another sense. Their readiness in consenting to do without the assistance of the Independents disposed him to think “they could not have much bigotry among them.” Although he made it a rule to introduce nothing in the pulpit that could, or should, lead to controversy, he made no secret of his real opinions in conversation, or in his lectures on the theory of religion which he had composed at the academy and which he proceeded to give to all persons, without distinction of sex or age, who chose to come and listen to him. He then found that when he came to treat of the Unity of God merely as an article of religion his hearers were attentive to nothing but the soundness of his faith in the doctrine of the Trinity, and they quickly discovered, what he was at no pains to conceal, that he was a very pronounced Arian. From the time of this discovery, he says, his hearers fell off apace, especially as the old minister, as might have been expected, took a decided part against him. To add to his difficulties his aunt stopped his remittances. This was in part due to the ill offices of his orthodox, i.e., Independent, relations, but mainly because the worthy Mrs Keighley had largely exhausted her liberality in supporting others of her needy dependants, and in particular a deformed niece, her constant companion, and who could not, Priestley thinks, have subsisted without the greatest part, at least, of all she had to bequeath. He himself was the first to recognise that, being apparently settled in the world, he ought to be no longer burdensome to her. She had spared no expense in his education, and that, he says, was doing more for him than giving him an estate. Whatever the world might 24 have thought as to his being settled in it, it had little to offer him beyond the dignity of his profession, and it is difficult to live on dignity alone. The respectable and agreeable families in the place, to whom he had flattered himself he would be useful, were not very prompt to support that dignity, and eventually it had to sustain itself on the wages of an agricultural labourer. Indeed, he says, had it not been for the good offices of Dr Benson and Dr Kippis, eminent eighteenth century divines, who procured him “now and then an extraordinary five pounds from different charities,” he believed he should have starved.[5] \\n\\n \\n\\n “At Needham” he says, “I felt the effect of a low, despised situation, together with that arising from the want of popular talents. There were several vacancies in congregations in that neighbourhood where my sentiments would have been no objection to me, but I was never thought of. Even my next neighbour, whose sentiments were as free as my own, and known to be so, declined making exchanges with me, which, when I left that part of the country, he acknowledged was not owing to any dislike his people had to me as heretical, but for other reasons, the more genteel part of his hearers always absenting themselves when they heard I was to preach for him. But visiting that country some years afterwards, when I had raised myself to some degree of notice in the world, and being invited to preach in that very pulpit, the same people crowded to hear me, though my elocution was not much improved, and they professed to admire one of the same discourses they had formerly despised.” \\n\\n \\n\\n The iron would have entered the soul of a weaker 25 man, but Priestley, true to himself, never lost hope or faltered in his courage. However short his commons, Providence had endowed him with the continual feast of a contented mind. He firmly believed, even during the darkest hours of that Suffolk time, that this same wise Providence was disposing everything for the best. Notwithstanding his unfavourable circumstances, “I was,” he says, “far from being unhappy at Needham.” He boarded with a family for whose kindness he was always grateful. He had free access to one or two private libraries in the district, in particular one belonging to Mr Alexander, a Quaker. \\n\\n \\n\\n “Here it was,” he says, “that I was first acquainted with any person of that persuasion; and I must acknowledge my obligation to many of them in every future stage of my life. I have met with the noblest instances of liberality of sentiment and the truest generosity among them.” \\n\\n \\n\\n There can be little doubt, however, in spite of his robust optimism and the courage with which he confronted the world, the young divine led a cheerless and solitary existence at Needham. And it is no less certain that it was during this dark and troubled time that he sowed the seed—the wheat and the tares—which in the fulness of time was to furnish the harvest of good and evil he eventually garnered—fame, obloquy, insult, persecution, respect, affection and his position among the immortals. \\n\\n \\n\\n Although the account which Priestley has left us of his life and work at Needham is somewhat meagre, it is sufficiently full to enable us to trace in it the initial stages of his evolution as a theological thinker. Indeed, he says his studies at this period were chiefly theological, theology being the business of his life and the 26 vocation to which he had been called. He had left the academy with a qualified belief in the doctrine of atonement, and as he was desirous of getting some more definite ideas on the subject he set himself to peruse the whole of the Old and New Testament and to collect from them, with the greatest care, all the texts that appeared to him to have any relation to the subject, and to arrange them under a great variety of heads. \\n\\n \\n\\n “The consequence of this was,” he says, “what I had no apprehension of when I began the work, viz., a full persuasion that the doctrine of atonement, even in its most qualified sense, had no countenance either from Scripture or reason.” \\n\\n \\n\\n He then proceeded to digest his observations into a regular treatise, a part only of which was at that time published, under the title of the Doctrine of Remission. The portion omitted had reference to an examination of the writings of the Apostle Paul, whose reasoning, he was satisfied, was in many places far from being conclusive. This examination grew into a separate work, in which he tested every passage in which the reasoning appeared to him to be defective or the conclusions ill-supported; and, as he says, he thought them to be pretty numerous. \\n\\n \\n\\n His friend Kippis advised him to publish this treatise under the character of an unbeliever, in order to draw the more attention to it. \\n\\n \\n\\n “This” he says, “I did not choose, having always had a great aversion to assume any character that was not my own, even so much as disputing for the sake of discovering truth. I cannot ever say that I was quite reconciled to the idea of writing to a fictitious person, as in my Letters to a Philosophical Unbeliever, though nothing can be more innocent, or sometimes 27 more proper, our Saviour’s parables implying a much greater departure from strict truth than those letters do. I therefore wrote the book with great freedom indeed, but as a Christian and an admirer of the Apostle Paul, as I always was in other respects.” \\n\\n \\n\\n When nine sheets of the work were printed off, Dr Kippis dissuaded him from proceeding, or indeed from publishing anything of the kind, until he should be more known and his character better established, and accordingly he desisted. All that he considered of consequence in this work he subsequently inserted in the Theological Repository, “in order to its being submitted to the examination of learned Christians.” \\n\\n \\n\\n Another task that he imposed on himself at Needham, and in part executed, was an accurate comparison of the Hebrew text of the Hagiographa and the Prophets with the version of the Septuagint, noting all the variations. \\n\\n \\n\\n It was, perhaps, in connection with this inquiry that his name appears in the second list of subscribers to Taylor’s Hebrew Concordance, the second volume of which was published in 1757. The subscription was three guineas, a very considerable sum to the young divine in those days. The fact that he should have entered his name at all is an indication of the ardour and spirit of self-sacrifice with which he invariably pursued his inquiries, whether theological or scientific. \\n\\n \\n\\n Priestley, to the end of his days, cared little for money except as the means of procuring the material for his investigations, and he was always ready to part with it, to the extent of his opportunity, in any cause in which his sympathies were enlisted. \\n\\n \\n\\n His circumstances were now so straitened that, despite the great aversion which he conceived he had to 28 the business of a schoolmaster—having often said that he would have recourse to anything else for a maintenance in preference to it—he was at length compelled to make some attempt that way. He therefore printed and distributed proposals to teach classics, mathematics, etc., for half a guinea a quarter, and to board the pupils in the house with himself for twelve guineas a year. It was recognised that he was not unqualified for this work, but although there was no obvious connection between Arianism and arithmetic it was enough that he was tainted with heresy, and not a pupil was entrusted to his care. \\n\\n \\n\\n He then proposed to give lectures to grown persons on such branches of science as he could procure the means of illustrating, and began with a course of twelve lectures on the use of “A New and Correct Globe of the Earth.” His one course of ten hearers did little more than pay for his globes. \\n\\n \\n\\n At this juncture a distant relative procured him an opportunity of preaching as a candidate at Sheffield, but his trial sermon was not approved: his manner was thought “too gay and airy.” One of the ministers at Sheffield had, however, more discrimination, and by his good offices he was recommended to a congregation at Nantwich, in Cheshire, who gave him an invitation to preach there for a year certain. Accordingly, he put together his few worldly possessions—his globes, his beloved books, his stock of sermons, and the manuscripts of the theological treatises he was too poor or too diffident to give to the world—and took the Ipswich packet to London as the least expensive way of getting down to Cheshire. \\n\\n \\n\\n The chapel in which Priestley preached at Needham 29 was taken down and rebuilt in 1837. When Rutt was preparing his edition of Priestley’s Memoirs, his daughter, Mrs Notcutt, who lived in Ipswich, made inquiries respecting Priestley, but with no result. \\n\\n \\n\\n No reminiscences of him could be found at Needham. He was evidently thought too poor and too obscure for his memory to be treasured. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/2066/58803.html","bookId":16,"book":{"id":16,"title":"Joseph Priestley","description":"简介： In the following account of the life and work of that hero and type of the intellectual energy of the eighteenth centurythe honest hereticJoseph Priestley, I have, to a considerable extent, made the subject of it tell his own story. After Priestleys...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/2066","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
