{"id":40727,"no":24,"title":"CHAPTER XXIV.","content":"\"There,\" he said, balancing it on his finger and smiling, in his eager, impatient way—\"there is the missive, Charlie. Read the superscription thereof.\" Lord Charles took the letter gingerly, and shook his head. \"The lad you picked out of the water,\" he said. \"What does it mean? I wish you\u0027d drop it, Ley.\" Leycester shook his head. \"This is the last time I shall ask you to do me a favor, Charlie——\" \"Till the next.\" \"You mustn\u0027t refuse. I want you to give this to the boy. You will find him down at Etheridge\u0027s cottage. You cannot mistake him; he is a fair, delicate-looking boy, with yellow hair and blue eyes.\" Lord Charles hesitated and looked up with a grave light in his eyes and a faint flush on his face. \"Ley,\" he said, in a low voice, \"she is too good, far too good.\" Lord Leycester\u0027s face flushed. \"If it were any other man, Charlie,\" he said, looking him full in the eyes, \"I should cut up rough. I tell you that you misunderstand me—and you wrong me.\" \"Then,\" said Lord Charles, \"it is almost a worse case. Ley, Ley, what are you going to do?\" \"I am going to do what no man on earth could prevent me doing,\" said Leycester, calmly, but with a fierce light in his eyes. \"Not even you, Charlie.\" Lord Charles rose. \"Give me the letter,\" he said, quietly. \"At any rate, I know when words are useless. Is there anything else? Shall I order a straight waistcoat? This, mark my words, Ley!—this—if it is what I conjecture it to be—this is the very maddest thing you have ever done!\" \"It is the very wisest and sanest,\" responded Leycester. \"No, there is nothing else, Charlie. I may wire for you to-morrow. If I do, you will come?\" \"Yes, I will come,\" said Lord Charles. Oliver knocked at the moment. \"The dogcart is waiting, my lord, and there is only just time.\" Leycester and Lord Charles passed out and down the stairs. The sound of laughter and music floated faintly through the parted curtains of the drawing-room. \"What shall I say to them?\" asked Lord Charles, nodding toward the room. Leycester smiled, grimly. \"Tell them,\" he said, \"that I have gone to town on business,\" and he laughed quietly. Then suddenly he stopped as if a thought had struck him, and glanced at his watch. [171] \"One moment,\" he said, and ran lightly up the stairs to Lilian\u0027s room. Her maid met him at the door. \"Her ladyship is asleep,\" she said. Leycester hesitated, then he signed to her to open the door, and entered. Lady Lilian lay extended on her couch, her eyes closed, a faint, painful smile on her face. He stood and looked at her a moment, then he bent and lightly touched her lips with his. \"Good-bye, Lil,\" he murmured. \"You at least will understand.\" Then he ran down, putting on his gloves, and had one foot on the dogcart step when Lady Wyndward came into the hall. \"Leycester,\" she said, \"where are you going?\" He turned and looked at her rather wistfully. Lord Charles fingered the letter in his pocket, and wished himself in Peru. \"To London, mother,\" he said. \"Why?\" she asked. It was an unusual question for her, who rarely asked him his intentions, or the why and wherefore, and he hesitated. \"On business,\" he said. She looked at the flushed face and the fire smoldering in his eyes, and then at Lord Charles, who jingled the money in his pocket, and whistled softly, with an air of pure abstraction. \"What is it?\" she asked, and an unusual look of trouble and doubt came into her eyes. \"Nothing that need trouble you, mother,\" he said. \"I shall be back—\" he stopped; when should he be back?—\"soon,\" he added. Then he stooped and kissed her. Lady Wyndward looked up into his eyes. \"Don\u0027t go, Leycester,\" she murmured. Almost roughly, in his impatience, he put her arm from him. \"You don\u0027t know what you ask,\" he said. Then in a gentle tone he said \"Good-bye,\" and sprang into the cart. The horse rose for a moment, then put his fore feet down and went off like a rocket under the sharp cut of the whip, and Lady Wyndward, with a sigh of apprehension, turned to where Lord Charles had stood. Had stood; for he had seized the moment of departure to steal off. He had helped Leycester in many a mad freak, had stood in with him in many a wild adventure, which had cost them much after trouble and no small amount of money, but Lord Charles had a shrewd suspicion that this which he was asked to assist in was the climax of all that had gone before. But he felt that he must do it. As we have said, there were times when words were of as little use as chaff with Leycester, and this was one of them. Ruefully, but unshaken in his devotion, he went up-stairs for his hat and stick, and sauntered down, still wishing that he could have been in Peru. \"There will be a terrible storm,\" he muttered. \"His people will cut up rough, and I shall, of course, bear some portion of[172] the blame; but I don\u0027t mind that! It is Ley I am thinking of! Will it turn out all right?\" He was asking himself the question dolefully and helplessly as he descended the stairs, when he became conscious of the graceful form of Lady Lenore standing in the hall and looking up at him. She had watched Lord Leycester\u0027s departure from the window; she knew that he was going to town suddenly—knew that Lord Charles had been closeted with him, and now only needed to glance at Lord Charles\u0027 rueful face to be convinced that something had happened. But there was nothing of this in her smile as she looked up at him, gently fluttering a Japanese fan, and holding back the trailing skirts with her white, bejeweled fingers. Lord Charles started as he saw her. \"By Jove!\" he murmured, \"if it is as I think, what will she do?\" and with an instinctive dread he felt half inclined to turn and reascend the stairs, but Lenore was too quick for him. \"We have been looking for you, Lord Charles,\" she said, languidly. \"Some rash individual has proposed lawn-tennis; we want you to play.\" Lord Charles looked confused. The letter burnt his pocket, and he knew that he should know no peace until he got rid of it. \"Awfully sorry,\" he said; \"going down to the post-office to post a letter.\" Lady Lenore smiled, and glanced archly at the clock. \"No post till seven,\" she said; \"won\u0027t it do after our game?\" \"No post!\" he said, with affected concern. \"Better telegraph,\" he muttered. \"I\u0027ll get you a form!\" she said, sweetly; \"and you can send it by one of the pages.\" \"Eh?\" he stammered, blushing like a school-boy. \"No, don\u0027t trouble; couldn\u0027t think of it. After all it doesn\u0027t matter.\" Then she knew that Leycester had given him some missive, and she watched him closely. No poorer hand at deception than poor Charles could possibly be imagined; he felt as if the softly-smiling velvet eyes could see into his pocket, and his hand closed over the letter with a movement that she noted instantly. \"It is a letter,\" she thought, \"and it is for her.\" And a pang of jealous fire ran through her, but she still looked up at him with a languid smile. \"Well, are you coming?\" \"Of course,\" he assented, with too palpably-feigned alacrity. And he ran down the stairs. She caught up a sun-hat and put it on, and pointed to the racquets that stood in their stand in the hall. She would not let him out of her sight for a moment. \"They are all waiting,\" she said. He followed her on to the lawn. The group stood playing with the balls, and waiting impatiently. Lord Charles looked round helplessly, but he had no time to think. [173] \"Shall we play together?\" said Lenore. \"We know each other\u0027s play so well.\" Lord Charles nodded, not too gallantly. \"All right,\" he said; and as he spoke, his hand wandered to his pocket. The game commenced. They were well matched, and presently Lord Charles, whose two games were billiards and tennis, got interested. He also got warm, and taking off his coat, flung it on to the grass. Lady Lenore glanced at it, and presently, as she changed places with him, took off her bracelet and threw it on the coat. \"Jewelery is superfluous in tennis,\" she said, with a soft laugh. \"We mean to win this set, do we not, Lord Charles?\" He laughed. \"If you say so,\" he replied. \"You always win if you mean it.\" \"Nearly always,\" she said, with a significant smile. All the four were enthusiasts, if Lenore could be called enthusiastic about anything, and the game was hotly contested. The sun poured down upon their faces, but they played on, pausing occasionally for the usual squabble over the scoring; the servants brought claret and champagne cup; Lady Wyndward and the earl came out and sat in the shade, watching. \"We shall win!\" exclaimed Lord Charles, the perspiration running down his face, his whole soul absorbed in the work, the letter entirely forgotten. \"I think so,\" said Lady Lenore, but as she spoke she missed a long ball. \"How did you manage that?\" he inquired. \"It is the racquet,\" she said, apologetically. \"It is a little too heavy. It always gets too heavy when I have been playing a little while. I wish I had my other one.\" \"I\u0027ll send for it,\" he said, eagerly. \"No, no,\" she said. \"They won\u0027t know which it is—they never do.\" \"I\u0027ll go for it, then,\" he said, gracefully. \"Can\u0027t lose the game, you know.\" \"Will you?\" she said, eagerly. \"It stands on the hall table——\" \"I know,\" he said. \"Wait a moment!\" he called out to the others, and bolted off. Lenore looked after him for a moment, then she glanced round. The other two were standing discussing the game; the on-lookers were gathered round the champagne cup. Lady Wyndward was lost in thought, with eyes bent to the ground. The beauty\u0027s eyes flashed, and her face grew slightly pale. Her eyes wandered to the coat, she hesitated for a moment, then she walked leisurely toward it and stooped down and picked up the bracelet. As she did so she turned the coat over with her other hand, and drew the note from the pocket. A glance put her in possession of the address, and she returned the note to its place, and strolled back to the tennis-court[174] with an unmoved countenance; but her heart beat fast, as her acute brain seized upon the problem and worked it out. A note to the boy! A letter which can be confided to no less trusty a hand than Lord Charles! Leycester\u0027s sudden departure for London! Lord Charles\u0027s confusion and embarrassment! Secresy and mystery! What does it mean? A presentiment seemed to possess her that a critical moment had arrived. She seemed to feel, by instinct, that some movement was in progress by which she should lose all chance of securing Leycester. Her heart beat fast, so fast that the delicate veins in her white hands throbbed; but she still smiled, and even glided across to Lady Wyndward, who sat thoughtfully in the shade, looking at the tennis, but thinking of Leycester. She looked up as the tall graceful figure approached. \"You are tiring yourself to death, my dear,\" she said, with a sigh. \"No, I am enjoying it. What is the matter?\" Lady Wyndward looked at her candidly. \"I am troubled about my only troublous subject. Leycester has gone off again.\" \"I know,\" was the quiet answer. \"Where, I know not; he said London. I don\u0027t know why I should feel particularly uneasy, but I do. There is some plot afoot between Lord Charles and him.\" \"I know it,\" smiled Lenore, \"Lord Charles is not good at keeping a secret. He makes a very bad conspirator.\" \"He would do anything for Leycester, any mad thing,\" sighed Lady Wyndward. The beautiful face smiled down at her thoughtfully for a moment, then Lenore said: \"Do you think you could keep Lord Charles on the tennis-lawn, here, for half-an-hour?\" \"Why?\" asked Lady Wyndward. \"Yes, I think so.\" \"Do so, then,\" replied Lady Lenore, \"I will tell you why afterward. Lord Charles is very clever, no doubt, but I think I am cleverer, don\u0027t you?\" \"I think you are all that is good and beautiful, my dear,\" sighed the anxious mother. \"Dear Lady Wyndward,\" softly murmured the beauty. \"Well, keep him chained here for half-an-hour, and leave the rest to me. I am not apt to ask unreasonable requests, dear.\" \"No. I\u0027ll do anything you want or tell me,\" replied Lady Wyndward. \"I am full of anxious fears, Lenore. Do you know what it means?\" Lady Lenore hesitated. \"No. I do not know, but I think I can guess. See, here he comes.\" Lord Charles came striding along, swinging the racquet. \"Here you are, Lady Lenore. Is that the right one?\" \"Yes,\" she said, \"but I can\u0027t play any longer. I am so sorry, but I have hurt my hand. No, it\u0027s a mere nothing. I am going in to bathe it.\" [175] \"Oh, it\u0027s an awful pity,\" said Lord Charles. \"I am very sorry. Well, the game is over. We must play it out another day. I\u0027m going down to the village, and I\u0027ll call at the chemist\u0027s for a lotion. I expect you have sprained your hand.\" And suddenly, reminded of his mission, he was walking toward his coat, but Lenore glanced at the countess, and Lady Wyndward stopped him with a word. \"We can\u0027t have the game stopped,\" she said. \"Here is Miss Dalton dying to play, aren\u0027t you, dear?\" she said, turning to a young girl who had been watching the game. \"Yes, I knew it. You must take her in place of Lenore. Go on, my dear.\" Miss Dalton, or Miss any one else, would as soon have thought of disobeying Lady Wyndward as jumping off the top story of the Hall, and the girl rose obediently and took the racquet which Lenore smilingly held out to her. Then what did Lenore do? She walked deliberately to Lord Charles\u0027 coat, dropped her bracelet on it, stooped, picked up the bracelet, and abstracted the letter, and concealing the latter in her sunshade, glided toward the house. With fast beating heart she gained her own room and locked the door. Then she drew the letter from her sunshade and eyed it as a thief might eye a safe in which lay the treasure he coveted. Then she rang the bell and ordered some hot water. \"I have sprained my wrist,\" she said, in explanation, \"and I want the water very hot.\" The maid brought the water and offered to bathe the wrist, but Lady Lenore sent her away, and locked the door again. Then she held the envelope over the steaming jug and watched the paper part. Even then she hesitated, even as the note lay open to her. This which she contemplated doing was the meanest act a mortal could be guilty of, and hitherto she had scorned all baseness and meanness. But love is stronger than a sense of right and wrong in some women, and it overcame her scruples. With a sudden compression of the lips she drew out the note and read it, and as she read it her face paled. Every word of endearment stabbed her straight to the heart, and made her writhe. \"My darling!\" she murmured; \"my darling! How he must love her!\" and for a moment she sat with the letter in her hand overcome by jealousy and misery. Then, with a start, she roused herself. Let come what might, the thing should not happen. This girl should not be Leycester\u0027s wife. But how to prevent it? She sat and thought as the precious moments ticked themselves out into eternity, and suddenly she remembered Jasper Adelstone—remembered him with a scornful contempt, but still remembered him. \"Any port in a storm,\" she said; \"a drowning man clings to a straw, and he is no straw.\" Then she inclosed the letter in its envelope, and taking out the writing-case wrote on a scented sheet of paper: \"Meet me by the weir at eight o\u0027clock.\" This she inclosed in an envelope,[176] and addressed to Jasper Adelstone, Esq., and with the two notes in her hand returned to the tennis lawn. They were still playing—Lord Charles absorbed in the game, and once more quite oblivious of the letter. She stood and watched them for a minute; then she went and sank down beside the jacket, and hiding the movements with her sunshade, restored Leycester\u0027s letter to its place. A few minutes afterward the single line she had written was on its way to Jasper.","sourceLink":"http://novel.tingroom.com/jingdian/1672/49283.html","bookId":1188,"book":{"id":1188,"title":"Only a Girl\u0027s Love","description":"简介： It is a warm evening in early Summer; the sun is setting behind a long range of fir and yew-clad hills, at the feet of which twists in and out, as it follows their curves, a placid, peaceful river. Opposite these hills, and running beside the river,...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1672","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
