{"id":88336,"no":12,"title":"Page 12","content":"He shrugged. “I had to see if today was the day Sully finally put his Prospector’s Pie on the menu.” That startled a laugh out of her. “Now I really know you’re nuts.” “Hey, a little off-roading is good for the soul.” “You mean driving off the road?” Edith asked. “Is that allowed?” “Are you suggesting I give myself a ticket?” The sheriff put an arm around her mother’s shoulders, leading her to the door. “Now button up that coat and let’s go. I guess I’ll just have to wait for that Prospector’s Pie.” He looked back at Sorrow and winked. A zing of excitement stabbed her chest. “I can do you one better,” she heard herself say. “You like salmon, Billy?” Eleven Marlene’s date had gone south fast. She’d had plenty of time to contemplate that sad fact, seeing as he’d sat across from her, this total stranger, talking at her the whole time. There was not one single question he had to ask her. The blasted man just droned on and on about fishing. And he hadn’t even called it fishing—he’d corrected her every time she dared say the word. “Angling, Marlene. It’s called angling.” He started in on “bite indicators,” and that was when she’d tuned out completely. She’d already had a man who’d chewed her ear off about fishing, and look how that had turned out. She certainly didn’t need to go out and find herself a new one. But the whole situation had made her think. All these men had their leisure activities—watching sports, going fishing, playing golf. So what were her passions? Some days it felt like she’d gone straight from raising four young boys to caring for three elderly women. Unless she counted dusting and laundry among her pastimes, she had a sad absence of interests in her life. Interests that were hers and hers alone. Sometime during the bite indicators conversation, she made her decision. She’d forget men for the moment and pour her heart and soul into the historical society instead. That was how she came to be early, prepared, and waiting when folks started to arrive at the town hall for their weekly meeting. It’d been some feat getting her elderly aunts and mother ready sooner than usual. Now that they had these letters, the meeting promised to be a rip-roaring one. She hadn’t yet told the ladies the news about how Buck Larsen had spent time in Sierra Falls and was making a great show of a grand secret to be revealed. So with promises of high drama ahead, she’d managed to wrangle Ruby, Pearl, and Ma into their coats. The drama began even before they got to the meeting. Marlene heard an unfamiliar car outside and opened the door to find Billy Preston parking in their drive. “Oh, good heavens.” Her aunt Ruby’s eyes widened, seeing the big sheriff’s SUV. “The law is here.” Pearl sidled into the doorway. Her gloved hand had a death grip on Marlene’s arm. “What do you think happened?” Ma piped up, “Did he find out about that lipstick I took?” “Oh, hush Emerald. That was back in 1946.” Marlene spotted Edith in the front seat and patted Pearl’s hand. “I think what happened is Edith had car trouble again.” Billy hopped out of the car. “You’re all looking lovely today.” He bounded up the porch stairs, taking an aunt on each arm. “Your chariot awaits.” Marlene locked up the house and, taking her mother’s arm, followed him to the car. “Sheriff, you probably have a dozen other important things to do.” “Maybe so, but this was at the top of my list.” With a smile, he helped her climb into the additional row of backseats. “You going to be okay back there?” “Yes.” She settled herself, but her mind was churning. Now here was a considerate man. She’d sensed it the day he’d helped free her car from the snowbank. This was a man who wouldn’t chew off a woman’s ear about bait lines. She wasn’t used to getting help, though, and twice in a row from the same man no less. She felt bad putting him out. “You don’t need to drive us old biddies to our meeting.” “I don’t see any biddies here.” He gave Pearl a wink. The moment she was buckled in, Ruby leaned forward to study the complicated control panel that was nestled between the front seats. The police radio crackled to life, and distant, unintelligible chatter filled the SUV. The ladies gasped. Marlene had a chuckle to herself. They’d be talking about this for weeks. They talked about it now, seated in the Sierra Falls Town Hall, waiting for the meeting to come to order. She and Edith sat at the front, and she could sense that her friend was dying to gossip about the sheriff, but Marlene silenced her with a look. They were the heads of the historical society, and it was up to them to project an official air. As chairwoman and de facto treasurer, Marlene was the one who got to use the gavel, and she banged it. “Time to get this meeting to order. First item of business is our budget.” They addressed their dwindling bank account, and as was often the case with money talk, the discussion dissolved into grumbling and fretting. Edith shushed them, and Marlene’s head swiveled to give her friend a startled look. “Marlene and I think we have a solution,” Edith said. “We found letters.” Marlene gave a quick pat to her friend’s hand. It wasn’t like Edith to put herself out there like that. It looked good on the woman. “Letters?” a woman in the back asked. “How are a bunch of letters going to help us?” “They’re historical letters,” Edith said. Other voices chimed in. “What kind of historical?” “Maybe they’re just old.” June Harlan spoke louder than the rest. “How do you know they’re real? It’s impossible to date things with the naked eye.” Pearl turned in her seat. “You listen up, June, and let her tell it. If Marlene says she has letters, there are letters.” “Well, where’d she find them?” Marlene banged the gavel again. “The Bailey family found them.” Edith gave a proud smile. “And we think our next festival should be a Buck Larsen festival.” June was looking frustrated. She turned to Pearl, asking in a loud whisper, “Did she say Buck Larsen?” Ruby spoke up, sounding confused. “Buck Larsen’s dead. He can’t come to the festival.” “No,” Pearl said. “He wrote the letters. Isn’t that what you’re saying, Marlene?” “No.” Marlene regretted not telling this news to her aunts and mother in advance. She’d thought it’d be a fun surprise, but the real surprise was how the meeting was crumbling into chaos. “The letters were written by Sorrow Crabtree.” Emerald turned to Ruby. “Isn’t that Edith’s child?” Ruby nodded and piped up, “What’s that about Sorrow?” “Sorrow wrote letters.” Pearl was hard of hearing, and her whisper had echoed down the aisles. “Not our Sorrow,” Edith said, exasperated. “Our Sorrow found the letters, from her great-great-great-grandmother.” As understanding dawned, female voices swept across the hall like a sigh. “Ahh.” Marlene put down her gavel. “Turns out, Buck Larsen was one of the pioneers of our town. If we theme our next festival around Buck Larsen and the gold rush, we might draw more tourists.” Edith leaned in to add, “More tourists means more money for Sierra Falls.” Ruby got it and nodded enthusiastically. “So you’re saying Buck Larsen is Bear’s kin.” Emerald looked aghast. “Bear skin?” Pearl patted her sister’s hand. “Bear Bailey. They’re talking about his ancestors.” Marlene couldn’t take the circus anymore. What this crowd needed was a spectacle. She cleared her throat and spoke in her best assembly voice. “Sorrow Crabtree was one of the early residents of Sierra Falls. It looks like she had…an affair. With Buck Larsen. She had his baby.” She paused dramatically to let that sink in, and sure enough, another wave of female oohs and ohhs swept the room. The meeting fell apart from there, the excitement too great to get any more business done. Marlene spotted Billy Preston waiting at the back of the hall and quickly wrapped it up. Standing to put on her coat, she turned to Edith. “You never did tell me what the sheriff was doing at your house to be offering you a ride.” The buzz in the hall drowned out her voice, and she leaned close to speak into her friend’s ear. “Seems Billy Preston has an awful lot of business to tend at that tavern of yours.” Edith puffed up. “He just happened to be there.” “Mm-hm.” Marlene buttoned up. “Lucky you. Or should I say, your lucky daughter.” Edith was winding her scarf around her neck, but her hands froze in midair. “Sorrow, you mean?” “Yes,” Marlene said impatiently. “Sorrow.” First she caught the sheriff toting around her apple bread and now this. “Seems to me like I’ve seen the two of them together a lot lately.” “Oh no, not him,” Edith said. “He’s a widower.” “Well, that’s a silly thing to say. It’s his wife who died, not him.” They both studied the man. He stood like a cop, straight and tall. His sheriff’s jacket made his broad shoulders look even broader. “Seems to me, he’s still a young man. Not hard on the eyes neither.” Edith made a little hmm sound. “No, he’s not hard on the eyes, is he?” Marlene squinted her eyes to focus better. “He reminds me of…I don’t know…a cowboy from a TV movie.” Edith finished tying her scarf around her neck. “Not as handsome as Damien, though.” “Maybe not,” said Marlene. “Though he makes Damien look like a kid in comparison.” “Damien isn’t a boy. He’s Sorrow’s age, and I say twenty-three is old enough to start thinking about settling down.” Edith’s eyes drifted back to the sheriff. “Are you saying he’s looking to remarry?”","sourceLink":"https://allnovel.net/sierra-falls-sierra-falls-1/page-12.html","bookId":1913,"book":{"id":1913,"title":"Sierra Falls (Sierra Falls #1)","description":"Storyline: Sierra Falls (Sierra Falls #1) Sierra Falls, California, is one of those sleepy towns that people choose to leave. Sorrow Bailey chose to stay behind, but has always yearned for more... Family is important to Sorrow. She gave up her dreams to run the struggling family lodge. Even her name is a family relic, though lately it feels like a curse that might determine her fate. Things look up when she discovers a collection of letters from her three-times great-grandmother and namesake, telling the story of a forbidden love affair. Billy Preston is the new sheriff, a widower escaping the grief of his former life as a big-city cop. He helps out after an accident at the Baily lodge, and what begins as admiration for Sorrow\u0027s quiet strength quickly becomes something much more. When Sorrow\u0027s discovery brings fame to Sierra Falls, and her dreams of a better life are within reach, one too many \"accidents\" have Billy wondering whether someone is willing to kill to keep them off the map. As the community pulls together, Sorrow takes a lesson from her ancestor\u0027s letters: Only in family, friends, and love do you find true joy.","cover":"https://allnovel.net/images/sierra-falls-sierra-falls-1.jpg","author":"Veronica Wolff","type":"Romance","source":"allnovel","link":"https://allnovel.net/sierra-falls-sierra-falls-1.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:27:02 PM"}}
