{"id":88356,"no":32,"title":"Page 32","content":"\\n\\n “I’m so sorry,” was all Sorrow said. There was nothing else to say, and she knew it.\\n\\n His focus shifted, from the image of his wife to Sorrow’s reflection in the glass. Her expression was drawn, pained. Sorrow was feeling his grief, opening her heart to him. She might’ve been different from Keri, but she was no less extraordinary.\\n\\n Billy wanted to open his heart in return, but he also wanted to put her at ease, so he shifted back to the original question. “I always liked the country more than she did. We used to argue about it, over where to spend our vacations.” He shook his head, remembering. “Keri’s idea of camping was staying at anything more downscale than the Marriott.”\\n\\n “She’d have loved the lodge,” Sorrow said in a flat, deadpan tone.\\n\\n “Sorrow,” Billy whispered, chiding her. He put his hands on her shoulders and gently turned her to face him. “I love the lodge.”\\n\\n Standing this close he saw the flecks of gold in her eyes. Her lashes were thick and brown. He imagined them fluttering closed during a kiss. His gaze shifted to her mouth. Her lips were parted, surprised at his touch.\\n\\n The sight brought with it a revelation. He was alive again, and it was time to seize back his life. And that meant he would kiss Sorrow. Tonight.\\n\\n Which meant he needed to steer her from these somber topics. “Come sit by the fire,” he said, his voice hoarse.\\n\\n She nodded, but the look she gave him was sad. Instead of sitting down, she wandered in front of the fireplace. Amber firelight cast dancing shadows on her face.\\n\\n He read the question in her eyes. She’d want to know if he was ready to move on.\\n\\n She put words to her thoughts, and he had to credit her courage as she asked, “Do you think you’ll ever marry again?”\\n\\n She wanted to know if he was still in mourning. Was a person ever done mourning? The answer was complicated, but it was one his heart finally understood.\\n\\n “I will marry again,” he said firmly. He’d thought those words before, but now, for the first time, he truly felt them. “It’s been over three years since her accident. She’d want me to move on.” For the first time, he felt the truth of those words.\\n\\n Sully had been right. Keri—tough, smart-as-a-whip Keri—would have kicked his ass from beyond if she’d caught him wasting one more night wallowing. “She’d want me to find love again.”\\n\\n “But do you…can you…” Sorrow was struggling for words.\\n\\n “Let’s find out.” Billy cupped the back of her head and leaned down. And then he kissed her.\\n\\n Twenty-six\\n\\n Billy’s strong arms were around her, and she felt herself pulled onto her toes, her heart soaring even higher than her body.\\n\\n After spending so much time looking at him, it felt so good finally to feel him. She wrapped her arms around him, greedily touching the stubble of his jaw, stroking his hair, squeezing the thick muscles of arms and shoulders, savoring each texture, memorizing the size of him.\\n\\n She felt his hardness straining against her already, pressing hot and insistent along her body, and a whimper escaped her throat. Her desire was immediate and consuming, an ache in her belly. She was mad with it.\\n\\n For months, she’d been kissing Damien, and it was a shock to be kissing someone else. Even though they’d broken up, the newness, the revelation of this other man made her feel dirty and hot.\\n\\n Because whatever she’d fantasized about Billy, it hadn’t been this. He was so gentle and kind in life, she’d expected a gentle, kind kiss. But this…this kiss was anything but hesitant. He was demanding. Confident.\\n\\n And so big.\\n\\n She felt his size as a visceral thing, his heat and strength imprinting along her body. She’d known Billy was a large man—he was broad and solid in his sheriff’s uniform—but when he’d opened the door shirtless, she’d had to force herself not to stare. The man was ripped, and her hands roved him, eagerly feeling what she’d seen with her eyes. He was so firm and sure, and she felt so small in his arms. She felt safe.\\n\\n She felt taken.\\n\\n They kissed with desperation, and still it wasn’t enough. She wanted Billy to take her, to take it all.\\n\\n She’d had questions for him, but she no longer remembered them. All she knew was the throbbing between her thighs, the tightness in her breasts. All she wanted was to leap into his arms, wrap her legs around him, and quell this urgency.\\n\\n A timer sounded in the kitchen.\\n\\n No no no.\\n\\n Sorrow wanted to ignore it, wanted it to go away. She couldn’t stop kissing him, not now. She did ignore it, and instead scraped her fingers along his scalp, twining his hair into her fists. Her heart pounded till she felt she might not catch her breath. She wanted him completely, wanted completion. She wanted Billy to kiss her forever.\\n\\n But the timer continued to ring.\\n\\n Finally, slowly, he parted from her and touched his forehead to hers. “Damn.”\\n\\n She shut her eyes, pained. Inhaling deeply, she pulled away. When their eyes met, they shared a slow smile—it began as something wicked and naughty, like a shared secret, but as the timer continued to blare in the background, the moment grew more conspiratorial, until they were laughing. Stepping back, she slapped a hand to her forehead. “Sorry.”\\n\\n “Don’t worry. The potatoes might be done, but we’re not.” He wrapped an arm tight around her shoulders, walking her slowly into the kitchen. “You and I are far from done.”\\n\\n He didn’t ease away from her, wouldn’t let her go, and the feel of him, the sensation of being so coveted transformed something deep inside her. Sorrow wanted another kiss, and more than another kiss. She’d show him what she was really made of.\\n\\n When she’d arrived and seen photos of his wife, it’d scared her. Losing a spouse so young—a person might never recover from a thing like that. Her first thought was, how could she ever compare to such a pretty, sophisticated, powerful woman?\\n\\n But that kiss. He’d kissed her, and instead of doubt, all she’d tasted was hunger.\\n\\n All through her dinner preparations, Sorrow’s skin buzzed, sensing his eyes on her, feeling his occasional touches grazing along her shoulders, down her back, leaving trails of fire along her body. Her whole being was attuned to him. Every look between them, every move, charged.\\n\\n If she were being honest, it was something that’d started weeks ago, that night she’d cooked for him for the first time. Their bond had been instant, and the sparks, too. Meeting in the kitchen like this had felt like a secret courtship. Getting to know Billy over homemade food and loaded glances, till one morning she’d woken up to realize she was falling in love with him.\\n\\n They had the intimacy, the connection. And now it was time to bring it to a different level. A level where she’d get to see that bare chest again.\\n\\n Slowly, she sliced the shallots. Using her shoulder, she pushed the hair from her eyes. “Too bad we have to eat,” she said shyly.\\n\\n He stepped close to sweep his hand along her neck, smoothing the hair from her face. “A man needs his strength.”\\n\\n He repositioned himself behind her, until his body touched hers. The contact was light along her back, but she experienced it like a sizzling in her blood. His closeness weakened her knees, and she leaned on the counter for support.\\n\\n His arm grazed hers as he reached over her to grab a couple of tomatoes. “Can I chop these for you?”\\n\\n At that moment, she could think of a hundred things she wanted him to do. Chopping was at the bottom of that list. But instead she said, “Yes, please.”\\n\\n Billy made quick work of the tomatoes, and seeing there was no obvious job for him to do, he leaned against the counter, bringing all his attention to bear on her. “I still can’t believe you’re here. What did I do to deserve this?”\\n\\n “I like cooking for you.” She was rubbing her herb mixture into the lamb, but spared a glance up and caught his eyes raking over her shirt. His gaze was heavy, and a bolt of desire speared her through.\\n\\n “I was about to say I couldn’t think of anything better than your cooking. But,” he said, in a voice thick with innuendo, “I think I could.”\\n\\n His banter was sexy, and it made her feel sexy. “Food first,” she chided.\\n\\n “You’re lucky I’m so famished,” he told her in a rasp, “or I wouldn’t let you finish.”\\n\\n She put the lamb in the broiler and washed her hands. “Just a few more minutes now.”\\n\\n He walked up behind her and ran his hands down her arms, threading her damp fingers with his. “I’m going to take more than a few minutes.”\\n\\n Her breath caught.\\n\\n The aroma of roasting lamb filled the room, and he breathed it in, exhaling with a satisfied moan that reverberated through her body. “How did they spare you at the tavern? Your father’s a fool not to let you cook every night.”\\n\\n She loved his focus on her, loved the feeling of being seen and understood. And she loved that—with the possible exception of her sister—nobody had any idea where she was. “They don’t even know where I am,” she said. In some ways, she had no idea where she was—she felt like she was spinning out of control, falling fast.\\n\\n “Their loss, my gain,” he said. “Your dad is lucky you don’t leave the tavern and get a professional chef’s job.”\\n\\n She shrugged. “Nah.”\\n\\n “Nah,” he mimicked affectionately and turned her to face him. “What do you mean, nah?”\\n\\n She thought of the lodge, the tavern, her parents…all the responsibilities that tethered her in place. “My time has passed.”\\n\\n He traced her brow to sweep her hair behind one ear, his gesture softening the expression of wry humor on his face. “What on earth do you mean, your time has passed?”\\n\\n “You know.” She crumpled her face into a half smile. “It’s too late for me to do anything new like that.”\\n\\n His face became dead serious. “You’re young, and you can do whatever you set your mind to.”\\n\\n “I’m stuck.” She paused, expecting him to speak, but he waited as though he were hanging on her every word, and so she continued, “Think about it. How am I supposed to follow any dreams from here? Laura and BJ were the ones who got free of this place. They left me to run it all by myself.” Though abandoned would’ve been a better word for it. \\n\\n","sourceLink":"https://allnovel.net/sierra-falls-sierra-falls-1/page-32.html","bookId":1913,"book":{"id":1913,"title":"Sierra Falls (Sierra Falls #1)","description":"Storyline: Sierra Falls (Sierra Falls #1) \\n Sierra Falls, California, is one of those sleepy towns that people choose to leave. Sorrow Bailey chose to stay behind, but has always yearned for more... \\n Family is important to Sorrow. She gave up her dreams to run the struggling family lodge. Even her name is a family relic, though lately it feels like a curse that might determine her fate. Things look up when she discovers a collection of letters from her three-times great-grandmother and namesake, telling the story of a forbidden love affair. \\n Billy Preston is the new sheriff, a widower escaping the grief of his former life as a big-city cop. He helps out after an accident at the Baily lodge, and what begins as admiration for Sorrow\u0027s quiet strength quickly becomes something much more. When Sorrow\u0027s discovery brings fame to Sierra Falls, and her dreams of a better life are within reach, one too many \"accidents\" have Billy wondering whether someone is willing to kill to keep them off the map. \\n As the community pulls together, Sorrow takes a lesson from her ancestor\u0027s letters: Only in family, friends, and love do you find true joy.\\n","cover":"https://allnovel.net/images/sierra-falls-sierra-falls-1.jpg","author":"Veronica Wolff","type":"Romance","source":"allnovel","link":"https://allnovel.net/sierra-falls-sierra-falls-1.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:27:02 PM"}}
