{"id":47801,"no":1167,"title":"Chapter 1167: Departure","content":"Chapter 1167: Departure\n Xiao Yan did not have the time to check if the hidden force had caused Chen Xian. The heavy ruler in his hand reflexively swung backwards in a violent manner. It immediately collided with the vast, mighty palm wind of the old man Bai, who was furiously pouncing over.\n “Bang!”\n The heavy ruler collided with the palm wind, and a muffled sound immediately appeared. The fierce wind swept apart like a storm. Xiao Yan’s toes pressed against empty air as his body swiftly withdrew. At the same time, his feet took a couple of continuous steps through the air. Each time his foot landed, space itself would tremble. This continued for a couple of steps before Xiao Yan forcefully stabilized his body. This furious attack by the old man with the surname Bai was powerful. If this attack had landed on Xiao Yan’s defenseless back, it probably would have gave him a serious injury.\n Xiao Yan’s feet stepped on empty air before he stabilized his body. His eyes was clearly a little gloomy as they landed on Song Qing because the person who had suddenly stopped Xiao Yan from killing Chen Xian was him.\n Song Qing did not show much fear when he saw Xiao Yan’s dark, solemn eyes looking over. With his position in the Pill Tower, there was no need for him to be afraid of Xiao Yan. He immediately said in a deep voice, “Xiao Yan, Brother Chen has currently joined this temporary alliance of ours. You should not attempt to kill him. Currently, everyone’s strength is the capital for us to defeat the fierce beast in the Ten Thousand Medicinal Mountain Range. Is this action of yours an attempt to stop us from passing this selection?”\n This Song Qing was quite a vicious person. His words had already placed Xiao Yan in a position that opposed the many alchemists present. However, how great of an effect his words could achieve was unknown.\n “Based on what you have said, only he is allowed to kill me?” Xiao Yan laughed upon hearing this.\n Song Qing slightly knit his brows and said with a faint voice, “Brother Chen is merely getting someone to capture you. Isn’t the fact that you are still fine prove my point?”\n “Your ability to alter the truth is indeed a talent. Chen Xian personally said that he wants me to suffer a fate worse than death. Don’t tell me that those present did not hear his words?” Xiao Yan smiled. He glanced at Song Qing and lazily said, “You should also forget about saying all this nonsense. The people here are not fools. No one will be listen to your words. If you are really displeased, you can just attack. I will receive you.”\n Song Qing was dull. His eyes swept around him, and he did see the alchemists idly standing to the side. None of them revealed any enmity to Xiao Yan because of Song Qing’s words.\n “All of these old cunning fellows…” Song Qing was helpless in his heart when he saw this. Who could participate in the Pill Gathering and be an ordinary person? It was not an easy task to provoke them into becoming enemies with others.\n “The ability of an alchemist does not lie in fighting and killing. If you really have the ability, I will wait for you at the Pill Gathering…” Song Qing would naturally not submit in public. His eyes looked at Xiao Yan while he coldly laughed. Perhaps he was no match for Xiao Yan when it came to fighting strength. However, he was very confident when it came to pill refinement!\n At that time, he would let Xiao Yan know that the nonsense five great clan test champion was worthless in his eyes!\n Xiao Yan was non-committal to these harsh words of Song Qing. His eyes glanced at the other Elder of the Profound Xuan Sect, who had been pestered by the Earth Demon Puppet to the point of not being able to move. An order was issued from his heart and the Earth Demon Puppet transformed into a silver glow as it returned. After which, it stood beside Xiao Yan without any expression, appearing just like a loyal guard.\n The Elder from the Profound Xuan Sect only moved to the old man with the surname Bai after seeing the Earth Demon Puppet withdraw. Both Elders appeared beside Chen Xian, who had been rendered unconscious by Xiao Yan. Their hands touched his arm as they hurriedly probed Chen Xian’s injuries.\n “Bastard, you have shattered the junior sect leader’s veins!”\n This probing immediately caused a fury to flash across their eyes. They raised their heads and glared at Xiao Yan like ferocious lions as they roared out.\n The veins were the most important channeling path for any Dou Qi practitioner. If any problem occurred to them, it could easily result in one becoming a trash that could not practice Dou Qi. Although there were some high tier medicinal pills that could repair one’s veins, they depended on how serious the injury was. Currently, the veins within Chen Xian’s body had been completely shattered by Xiao Yan’s attack from earlier. The chance of fully recovering from such a serious injury was extremely dim…\n Once he lost the support of Dou Qi, Chen Xian would become a useless person!\n Song Qing’s expression also changed slightly when he heard the roar of the old man. He did not expect Xiao Yan to attack so ruthlessly. Becoming a useless person was likely even more difficult for Chen Xian to endure compared to being killed…\n Xiao Yan in the air remained expressionless. He did not show the slightest sign of being affected by this. Chen Xian had repeatedly wanted to kill him. If he didn’t own many different techniques, it was likely that he would have already become an ice-cold corpse. Since Chen Xian was unable to kill him, Chen Xian should learn some of the consequences that he needed to deal with when he felt the desire to kill…\n “Things have already become like this and no one can restore the situation. The breaking of veins is not completely without any cure. You can perhaps ask for help from the Pill Tower after this is over. They might be able to cure him.” Cao Ying finally stepped forward with gentle footsteps while everyone was silent. Her crisp, soft voice caused one to feel the impulse of being smitten.\n The two Elders from the Profound Xuan Sect gradually calmed down when they heard Cao Ying opened her mouth. With the strength of the two of them, they were unable to stop Xiao Yan, who had the help of the Earth Demon Puppet. Currently, they needed to find all means available to heal Chen Xian. Otherwise, the two of them would suffer the fury of the Profound Xuan Sect leader when they returned.\n “Regardless of what has happened, the most important thing right now is to obtain the items that we have been tasked to find and pass this selection.” Cao Ying’s pretty eyes paused on the skinny figure in the sky before she sweetly smiled. She said, “May I know if mister Xiao Yan is interested? If everyone is together, we will be more confident in defeating that fierce beast.”\n The expression of Song Qing by the side changed when he heard Cao Ying open her mouth to invite Xiao Yan. He softly said, “Currently, Xiao Yan has offended the Profound Xuan Sect. If we invite him, it is likely that we will offend Chen Xian’s group.”\n Cao Ying faintly smiled. She ignored Song Qing’s words as her pretty eyes stared at Xiao Yan.\n Xiao Yan’s eyes swept over the lovely body of this enchanting beauty. However, he shook his head and said, “Thank you for the invitation Miss Cao Ying. However, I am used to roaming around alone, and I do not like to form groups. Therefore, I’m sorry.”\n Xiao Yan’s body had just moved after his voice sounded when he sensed an unusual gaze sweeping over his body. Under this sweeping gaze, the pores all over Xiao Yan’s body felt an impulse to flee.\n This change caused Xiao Yan’s heart to abruptly tremble. His eyes swept around the area below without leaving a trace, but he managed to gain nothing from it…\n “Could it be an illusion?”\n Xiao Yan slightly frowned. He was just about to withdraw his roaming gaze when his eyes suddenly narrowed!\n The spot where Xiao Yan’s eyes had focused was on the edge of the hill. There was a black-clothed man standing with his hands behind him. The corner of this man’s mouth was slowly lifted into a strange smile after having sensed Xiao Yan’s gaze.\n Xiao Yan’s eyes narrowed even more when the corner of that mouth revealed a strange smile. This mysterious black-clothed person gave him a feeling of pressure. Such a feeling was something that he had only sensed from some elite Dou Zuns…\n “This Pill Gathering is indeed a place filled with hidden experts. It is unexpected that there is such a powerful existence…”\n Xiao Yan’s heart involuntarily sank when he sensed the great strength of this mysterious, black-clothed person. With this fellow around, it would not be easy for him to snatch away the champion spot.\n While Xiao Yan was absent-minded because of the unusual, black-clothed man, Cao Ying below had raised her eyebrows because of his rejection. She grit her teeth. This fellow seemed to never give her any face…\n Song Qing by the side sighed in relief at this moment. He hurriedly said, “Forget it. Ying-er, since he doesn’t know what is good for him, you should also not use your good intentions to meet his cold-self. When he ends up suffering a loss, he will naturally come and beg us to cooperate…”\n Cao Ying involuntarily curled her mouth after hearing Song Qing’s words. From the abilities Xiao Yan had displayed earlier, there was hardly anyone present who could surpass him. He might really be able to confidently obtain the task items by himself.\n “The matter today shall end here. Goodbye.”\n Xiao Yan ignored the conversation between the two. His eyes took a deep look at the mysterious, black-clothed man. After which, he cupped his hands toward Cao Ying’s group before turning around and leaving. Due to the black-clothed man, he did not wish to stay in this place for long because he sensed a faint uneasiness from that person.\n This kind of feeling was extremely, vague but it was just like a thorn that hung over Xiao Yan’s heart. This caused him to involuntarily become more cautious.\n Xiao Yan waved his hand after his words sounded, and he returned the Earth Demon Puppet to his Storage Ring. After which, he rushed toward the Ten Thousand Medicinal Mountain Range.\n “Brat, do you wish to simply leave after injuring someone!”\n That two Elders from the Profound Xuan Sect immediately became furious upon seeing Xiao Yan turn to leave. They rose to the sky together and rushed toward Xiao Yan with killing auras all over their bodies.\n Xiao Yan ignored these two Profound Xuan Sect’s Elders, who had descended into fury. A silver glow flashed under his feet. After which, a thunderous roar resounded over the hill. All one could see was a couple of afterimages in the sky. Xiao Yan’s figure instantly disappeared from the gazes of everyone on the hill.\n The two Elders from the Profound Xuan Sect leaped in fury as they saw Xiao Yan disappeared within the blink of an eye. They continued to utter various curses.\n That black-clothed man at the edge of the hill watched the spot Xiao Yan had disappeared to. The corner of his mouth was lifted into a strange smile. A soft mumble was quietly released, accompanied by a dark chillness.\n “Xiao Yan… you won’t be able to escape…”\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1167","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
