{"id":47850,"no":1216,"title":"Chapter 1216: All Prepared","content":"Chapter 1216: All Prepared\\n\\n Xiao Yan was seated cross-legged on the bed within his room. His finger was rubbing a blood-red Storage Ring in his hand. It was the ring he had forcefully snatched from Yi Chen’s hand. This fellow possessed a high position within the Profound Sky Sect. It was likely that the things within the ring would not be too lousy.\\n\\n “This is interest…”\\n\\n Xiao Yan softly laughed. A thought passed through his mind and a trace of Spiritual Strength spread from between his brows. After which, it invaded the blood-red Storage Ring. However, the Spiritual Strength had just made contact with the ring when it was repelled by a force.\\n\\n “A spiritual imprint has been placed on it, huh…”\\n\\n Xiao Yan raised his eyebrows when his Spiritual Strength was repelled. The strength of that Yi Chen was quite great. However, if they were to compare his strength in terms of Spiritual Strength, it was likely that even ten Yi Chen were unable to surpass Xiao Yan. This kind of spiritual imprint appeared to be without any defensive properties from Xiao Yan’s point of view.\\n\\n Xiao Yan’s finger gently rubbed over the blood-red Storage Ring. A vast and mighty strength surged out like floodwaters. One could hear a slight cracking sound as the spiritual imprint within the Storage Ring was forcefully removed by Xiao Yan.\\n\\n After easily removing the spiritual imprint on the Storage Ring, Xiao Yan’s Spiritual Strength finally entered it without any obstacles. He briefly searched it and a blood-red scroll appeared in his hand with a flash.\\n\\n “Blood Evil Skill.”\\n\\n Xiao Yan swept his eyes over the scroll. After which, they paused on the three blood-red words at the top. A wave of a dense bloody scent immediately poured out of it.\\n\\n Xiao Yan carefully opened the scroll. He briefly glanced at the introduction to this Qi Method within the scroll, and his brows were involuntarily knit. A moment later, he softly said, “It is indeed bloody. This kind of Qi Method is far to evil and also far too cruel. Swallowing the flesh and blood of others to absorb the other party’s Dou Qi. This kind of tactic is really vicious.”\\n\\n This so-called Blood Evil Skill could be considered a top level Qi Method even within the Profound Sky Sect. This was something that could be observed from how Yi Chen managed to rely on it to reach the peak of the Dou Zong class when he was only around thirty years old. Although there were other reasons like his outstanding talent, most of it was due to the unusual process of this Blood Evil Skill.\\n\\n “However, this kind of tactic that relies on absorbing the strength of others to become stronger is not considered an excellent one. If one absorbs too much Dou Qi, one’s own Dou Qi will have difficulty becoming pure. After reaching a certain level, one would have difficulty advancing even an inch forward. Unless one scatters one’s power and retrains, one would even gradually suffer a backlash from the impure Dou Qi.”\\n\\n After briefly reading this so-called Blood Evil Skill, Xiao Yan also managed to find some of the drawbacks of this Qi Method. This thing would allow one to swiftly grow strong, but the sequelae was really too great. Moreover, the process was also extremely cruel and bloody. Unless it was someone who was naturally cold and indifferent, one would not be able to practice this kind of Qi Method.\\n\\n “Profound Sky Sect… what an evil sect.”\\n\\n Xiao Yan shook his head and randomly stored this Blood Evil Skill into his Storage Ring. No matter how one put it, this could barely be considered a Di class high level Qi Method. If he took it out to be auctioned in the future, he would definitely be able to exchange it for some extremely valuable items.\\n\\n After Xiao Yan took the Blood Evil Skill, he searched for a while, but he did not find anything else that could interest him. Just when he planned on giving up, his sweeping Spiritual Strength suddenly stopped in a certain part of the Storage Ring. There was an inconspicuous, gray scroll. Xiao Yan could vaguely sense a faint killing intent seeping out of the scroll.\\n\\n “This is…”\\n\\n Xiao Yan narrowed his eyes. This kind of killing aura was something that he was familiar with. After recalling this familiarity, he finally discovered that it seemed to be powerful Dou Skill that Yi Chen had used near the end of their match. It contained a murderous aura that seemed to snatch the mind of another.\\n\\n Xiao Yan clenched his hand. A gray-colored scroll appeared in it. He flicked his finger and pulled it open. A couple of ordinary words, permeated with killing intent, appeared in his sight.\\n\\n “Heaven Offering Demon Hand…”\\n\\n Xiao Yan softly mumbled those words. A glint flashed across his eyes at the same time. This thing was indeed the final attack that Yi Chen had displayed earlier.\\n\\n When they had fought earlier, Xiao Yan had personally experienced the strength of this so-called Heaven Offering Demon Hand. That sharp killing intent was indeed extremely strong. Fortunately, Yi Chen had clearly yet to master it to its peak. His killing aura had been significantly diluted, perhaps because the Bloody Qi in his body was overly dense.\\n\\n This Heaven Offering Demon Hand required an unhesitating desire to kill. Such a killing desire was born from one’s thoughts. It was not something that could be supplemented by relying on Blood Qi.\\n\\n “This thing could be considered one of the ultimate skills of the Profound Sky Sect. Its strength is definitely beyond what Yi Chen had displayed. That fellow is far too arrogant. This caused him to be unable to understand the true meaning of the Heaven Offering Demon Hand…” Xiao Yan carefully studied this scroll before exhaling a deep breath and speaking with some interest.\\n\\n Based on Xiao Yan’s guess, if this Heaven Offering Demon Hand were to be fully unleashed, its might would likely only be able surpassed if one learned the fifth seal of the God Seal Skill. This thing was indeed unique for it to become an ultimate skill within the Profound Sky Sect.\\n\\n Xiao Yan’s hand gently rubbed the scroll. The smile on his face became more dense. It was unexpected that Yi Chen would deliver such a treasure this time around. If Xiao Yan was able to learn this Heaven Offering Demon Hand, his fighting strength would definitely rise. He would also possess an additional fighting technique when battling with others in the future.\\n\\n Moreover, they would begin their operation to rescue Yao Lao very soon. By having this Heaven Offering Demon Hand delivered to him, it must be said that Yi Chen was just like a timely downpour…\\n\\n Due to the need to wait for the arrival of Feng zun-zhe, Xiao Yan’s group still had time to prepare. Though, such a dangerous operation would appear rushed no matter how long one had to prepare. Hence, Xiao Yan had once again chosen to undertake a retreat after having obtained the information from the three great heads.\\n\\n During this retreat, Xiao Yan not only needed to help Tian Huo zun-zhe refine the Fungus Green Pill before Feng zun-zhe arrived, but he would also need to find some time to familiarize and practice the Heaven Offering Demon Hand. One additional skill would mean an additional net of safety. Similarly, it would also mean that his confidence to succeed would increase. Regardless of whether this would be insignificant or not, it would be better prepare more in order to rescue Yao Lao.\\n\\n The Little Fairy Doctor and the others were helpless in the face of Xiao Yan’s somewhat crazy retreat. After having followed Xiao Yan around for so many years, she was aware of just how much effort Xiao Yan had put in to rescue his teacher. Now that everything was falling into place, he would naturally not dare to relax even a little.\\n\\n Being influenced by Xiao Yan, the Little Fairy Doctor and Tian Huo zun-zhe did not leave during this period of time. They understood the importance of this operation to Xiao Yan. Therefore, they tried to increase their strength a little in order to boost their likelihood of success.\\n\\n The insane training of these people caused Xuan Kong Zi and the rest to feel a little helpless. However, they could empathize with them. Hence, they issued the order not to disturb Xiao Yan’s group. Moreover, they had even dispatched some female servants there. If Xiao Yan lacked something during his pill refinement, the Pill Tower would swiftly deliver it to him.\\n\\n Half a year quietly passed while Xiao Yan undertook a retreat where he forgot to eat or sleep.\\n\\n During this half a month, the Pill Tower was faced with a commotion. This commotion was due to a thundercloud suddenly appearing in the sky above the Pill Tower. Moreover, there were two faint colors in the thundercloud. The thundercloud was surprisingly a two-colored Pill Lightning. From the looks of it, it was obvious that some alchemist guru within the Pill Tower had refined a tier 8 medicinal pill.\\n\\n When they felt surprised at the Pill Lightning lingering in the sky, a golden light was suddenly emitted from the Pill Tower. After which, the light floated in the sky and received the violent strike from the two-colored Pill Lightning in front of a countless number of speechless people. Next, the light landed without being hurt and disappeared in a flash.\\n\\n The people from the Pill Tower were familiar with this scene. When the golden-colored figure appeared, all of them understood knew was refining a tier 8 medicinal pill, the champion of this Pill Gathering—Xiao Yan.\\n\\n Admiration filled quite a number of alchemists when they figured out who was refining this pill. Tier 8 medicinal pills were too far for them to reach. However, it appeared as though those pills were readily available to the hands of Xiao Yan, who appeared even younger than them. This kind of comparison caused them to feel embarrassed. One should really not compare two different people.\\n\\n Two days after the Pill Lightning ended, Xiao Yan finally left his half-a-month-long retreat. However, his disheveled appearance appeared quite miserable.\\n\\n Although Xiao Yan looked miserable, it did not hinder the excitement on his face. After failing three times, he had finally successfully refined the Fungus Green Pill.\\n\\n Tian Huo zun-zhe, who had been guarding Xiao Yan’s room outside, revealed a stunned expression when he saw Xiao Yan’s miserable appearance. However, when Xiao Yan tossed him a deep-green, round medicinal pill with a strong spiritual aura, he was instantly excited. Without saying anything unnecessary, he grabbed the medicinal pill and entered another chamber.\\n\\n Watching how quickly he left, Xiao Yan involuntarily laughed. During this retreat, he had not only managed to successfully refine the Fungus Green Pill, he had also gained a basic understanding of the Heaven Offering Demon Hand. On the whole, he had acquired a lot…\\n\\n Xiao Yan finally rested after having left his retreat and having prepared everything he needed to. He calmly recuperated for two days before his condition returned to its peak. The only thing that he needed to do was to wait Feng zun-zhe to arrive. After which… they would leave and rescue Yao Lao!\\n\\n Xiao Yan wait did not last very long. On the fifth day after he had left his retreat, Xiao Yan was practicing the Heaven Offering Demon Hand, but he suddenly stood up from his chair. He sensed a familiar, mighty aura appearing within his area of perception at this moment.\\n\\n Feng zun-zhe had arrived.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1216","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
