{"id":47993,"no":1359,"title":"Chapter 1359: Xiao Xuan!","content":"Chapter 1359: Xiao Xuan!\n “Xiao Xuan?”\n Xiao Yan’s body suddenly trembled when he heard the exclamations of the Hun Diao duo. The blood flowing within his body suddenly fluctuated in a strange manner. This ripple was extremely familiar.\n The empty space in front of Xiao Yan’s group formed some ripples in front of everyone’s eyes as a figure in pale-green clothes quietly appeared. The appearance of this figure did not attract any unnatural phenomenon, but it appeared as though everyone present could not endure a punch or a kick from this person.\n “Hun clan… what a hateful bloodline.”\n The figure appeared and raised his head, revealing a face that did not appear very handsome, but it caused one to feel that there was something unique. His black hair reached his shoulders and a pair of ink-like eyes were as deep as black holes with an unusual wisdom. It was filled with a charm that caused one to feel intoxicated.\n “Xiao Xuan!”\n The Huo Diao duo’s eyes were staring at the unusually familiar face as shock and horror flashed across their eyes. Although they possessed an extremely great strength, the man in front of them had once stood at the peak of the continent. Only a few across the entire continent could fight with him.\n “Elder Hun Diao…” Hun Ya was a little frightened as he watched this stranger suddenly appear. Although he was not acquainted with this person, he still vaguely sensed the feeling of death.\n “Xiao Xuan may be very strong, but he is suppressed by the Heavenly Tomb. It is impossible for him to leave the tomb anytime he likes. He can only leave it once every ten years and the ten years have passed. He is not able to reveal himself!” Hun Diao inhaled a deep breath of air. He suppressed the fear in his heart as he softly reasoned.\n “In other words, the Xiao Xuan in front is not his actual self?” The other gray-clothed old man’s eyes flickered as he asked.\n “It is likely only just a show…” Hun Diao coldly replied. His boldness had become more apparent. Xiao Xuan might be powerful, but it was impossible for him to scare off the two of them with just a shadow.\n “You do indeed possess good eyesight…” The green-clothed man smiled.. His black eyes looked at the Hun duo in front as he said, “However, the two of you have overestimated yourselves. Two one star Dou Sheng do not even possess the qualifications to speak to me…”\n That green-clothed man slowly lifted his hand after speaking. He gently clenched it while facing the Hun duo.\n “Shatter!”\n After this word was spat from the green-clothed man, Xiao Yan’s group was immediately startled to see the space within a ten-thousand-foot-radius collapse. A dark invisible hand suddenly formed. After which, it randomly slammed into the Hun duo.\n “Bang bang bang!”\n The ten thousand foot large dark-black hand gently slammed down as the land appeared to experience an earthquake. It shook as numerous crack lines spread across the ground and extended into the distance.\n “This fiend, why has he come out again…”\n Such a large commotion was naturally sensed by some powerful energy bodies. However, their expressions changed when they sensed that familiar aura. They hesitated for a moment before hiding even the tiniest drop of their auras. Their bodies gradually became illusory before hiding under the land.\n “How is this possible…”\n The eyes of the Hun duo were somewhat stunned as they watched space collapse. Even they were unable to endure such a frightening palm.\n “Run!”\n Faced with the collapsed space and the enormous black hand that was swiftly approaching, the Hun duo sniffed the scent of death that caused their bodies to tremble. Their faces turned pale and they could not be bothered with anything else. One of them grabbed Hun Ya while the other grabbed Hun Li before turning to flee.\n “Bang!”\n However, their speed did not allow them to smoothly escape. Space itself seemed to be shattered by the large black hand. Hence, the two of them had just traveled a thousand feet when the attack suddenly arrived.\n “Bang!”\n The large hand did not truly strike the two of them. Instead, a frightening wind penetrated space when it was a thousand feet away from the fleeing figures before landing on the bodies of the Hun Elders. Their bodies violently shook when faced with this frightening wind. They did not even manage to scream when they emitted a “bang” and exploded into nothing.\n The remaining force in the hands of the two Elders violently tossed away Hun Ya and Hun Li before they were blasted into nothingness. They flew far into the distance.\n Xiao Xuan glanced at Hun Ya and Hun Li who had been tossed away, but he did not stop them. Eight star Dou Zuns were not even comparable to ants in his eyes...\n “Rumble!”\n The enormous hand shattered Hun Elders before it smashed into the ground, causing the land to tremble. Dust scattered from all over before settling a moment later. A ten-thousand-foot-large and seemingly bottomless gully appeared in front of Xiao Yan’s group in a spectacular manner.\n “Hiss…”\n Xiao Yan’s group inhaled a deep breath of cool air as they looked at this bottomless pit. Such a frightening destructive strength was a little too terrifying.\n “This fiend is still as vicious with his attacks…”\n Saint Xue Dao looked at the two Dou Shengs who had been turned into nothing by just a palm of this green-clothed man. He involuntarily swallowed a mouthful of saliva, but he also rejoiced a little. Fortunately, he had intervened today...\n The green-clothed man in the sky randomly finished off the Hun Elders. Only then did he turn around. His eyes leaped over Gu Qing Yang and the rest before finally landing on Xiao Yan.\n The blood within Xiao Yan’s body appeared to flow at a faster rate when the eyes of the green-clothed man landed on him. He forcefully endured the excitement in his heart as he lifted his head. Two pairs of dark black eyes met...\n Their intertwining eyes lasted for some time. Finally, a smile surfaced on the green-clothed man’s face. The smile was not deep, but it gave Xiao Yan a familiar feeling of being connected by blood.\n “Someone from the Xiao clan has finally come. I have not waited for so many years in vain…”\n The green-clothed man stepped through empty space and slowly appeared in front of Xiao Yan. He spoke in a soft voice. That voice contained some pride and relief.\n “This descendant Xiao Yan greets ancestor!”\n Xiao Yan was finally unable to endure the excitement in his heart when he heard the words of the green-clothed man. He knelt on empty air and gave his ancestor the most respectful bow of the Xiao clan.\n “Ha ha, Xiao Yan… a good name...”\n The green-clothed man slightly smiled. He gently helped Xiao Yan to his feet and patted his head. He said, “I sensed your presence the moment you entered the Heavenly Tomb. Your performance along the way has been quite good…”\n Xiao Yan rubbed his head. He was aware of just what kind of great person his ancestor was back then. Being able to obtain such a good evaluation from him was likely a very difficult task.\n “This junior Gu Qing Yang greets elder Xiao Xuan!”\n Gu Qing Yang, Xun Er, and the rest gave Xiao Xuan a respectful bow and deferentially greeted him. They were clearly aware in their hearts that even the clan head of the Gu clan would still have to treat this person in front of them with respect.\n “Members of the Gu clan, huh…”\n Xiao Xuan smiled. He glanced at Gu Qing Yang’s group and said, “Your Gu clan did not fully do as per the agreement that you made with me back then.”\n Gu Qing Yang and the rest felt some cold perspiration form on their foreheads when they heard his chastising words. They hurriedly replied, “Elder Xiao Xuan merely a small portion of the clan didn’t. The clan head has always adhered to the agreement even until now.\"\n Xiao Xuan was noncommittal. His eyes suddenly turned to Xun Er by the side as he commented, “Your bloodline is very similar to Gu Yuan…”\n “Gu Yuan is my father…” Xun Er respectfully replied. Her pretty eyes were somewhat uncertain as they looked at Xiao Xuan. He could be considered Xiao Yan’s elder and possessed absolute authority. She naturally did not wish to give the other party a poor impression of her on their first meeting. She did not wish to do this even though the current Xiao Xuan was no longer a truly living person…\n “You are actually that fellow’s daughter… no wonder you possess the divine bloodline. It is really the case of the next generation being more outstanding than the previous…” Xiao Xuan nodded. His eyes suddenly swept over Xiao Yan and Xun Er before saying to no one in particular, “However, my Xiao clan still gained the advantage…”\n Xun Er’s pretty face flushed red with embarrassment after hearing the meaning in Xiao Xuan words.\n “You should return first. In the future, you will continue to exist in the Heavenly Tomb…” Xiao Xuan glanced at Saint Xue Dao and indifferently spoke.\n “Thank you Elder Xiao Xuan.”\n Saint Xue Dao rejoiced upon hearing this. He hurriedly cupped his hands in a respectful manner. There were too many energy bodies in this Heavenly Tomb, and quite a number of them were stronger than him. However, with Xiao Xuan’s words, those powerful existences would not dare to target him.\n After uttering those words, Saint Xue Dao wisely decide not to stay any longer. He cupped his hands to Xiao Yan’s group and then turned into a ray of light that hurried into the distance.\n “Let’s head to the tomb. Due to the Heavenly Tomb, I cannot leave often. The thing that you are seeing now is just a shadow that I have projected…” Xiao Xuan explained when he saw Saint Dao Xue leave.\n The hearts of Gu Qing Yang’s group were shocked when they heard these words. A mere shadow was able to kill two one star Dou Sheng energy bodies with the raise of a hand. If this was his actual body, would it not possess a frightening strength that could annihilate the world?\n “I think that you have many things that you are uncertain about, right? Follow me… I have waited for too long for this day…” Xiao Xuan’s eyes shifted to Xiao Yan. He smiled slightly and spoke in a soft voice.\n An excitement rose within Xiao Yan’s heart when he heard these words. He had been waiting for this day for a long time!\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1359","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
