{"id":48016,"no":1382,"title":"Chapter 1382: Fourth Tianzhu, Xue He!","content":"Chapter 1382: Fourth Tianzhu, Xue He!\n Xiao Yan was a little startled when he heard the ninth Tianzun’s sudden screech. His peripheral vision caught sight of the ground below that been dyed red with fresh blood. From the looks of it, this Hall of Souls did indeed have an even stronger hidden expert who had not attacked.\n “Regardless of whether there is a helper, I will kill this person first!”\n Xiao Yan’s eyes flickered. A ferocious glow flashed an instant later as he abruptly pushed his hand forward. The rate at which the dark-black light circle spread suddenly soared.\n The ninth Tianzun was terrified when he sensed the frightening energy behind him. Dou Qi erupted from his body before he swung back, but no matter how he retaliated, the spreading speed of the black light did not slow by even a little…\n “Fourth brother!”\n It was futile regardless how the ninth Tianzun struggled. His face also became void of color as a sharp cry once again sounded.\n “Bang!”\n The ground violently trembled after the second scream from the ninth Tianzun sounded. It was possible to see the ground swiftly crumble apart. Within the blink of an eye, a deep abyss that was a couple thousand feet long appeared in front of many stunned gazes. Following the appearance of this deep abyss, a nauseating bloody scent surged out in all directions and some incomparably sharp screeches were vaguely emitted...\n The appearance of the deep abyss surprised Xiao Yan in the sky. It was unexpected that such a being was hiding under the ground. It seemed that the people from the Hall of Souls had come prepared. Although Xiao Yan was surprised in his heart, his reaction was not slow. He pushed his right hand forward and a black light circle merged with the ninth Tianzun’s left arm like lightning.\n “Ah!”\n A miserable cry was immediately emitted from the ninth Tianzun’s mouth after his left arm was dragged into the black light. An unblockable tearing force surged out of the light circle. In an instant, it tore the ninth Tianzun’s arm until it became blurry. If he had not unleashed all of his Dou Qi to block the tearing force, his arm would have turned into dust at that moment. Even though it didn\u0027t instantly disappear, the tearing force still swiftly entered his arm and caused his muscles, blood vessels, and even bones to swiftly explode and deform.\n “Hmph!”\n Xiao Yan coldly cried out after having successfully grabbed the ninth Tianzun and suddenly clenched his hand. The suction force within the light circle suddenly surged and pulled the rest of the ninth Tianzun’s body toward it.\n “Crack!”\n The ninth Tianzun’s heart was at a completely shock after having sensed Xiao Yan’s intentions. He clenched his teeth, curled his hand into a blade, and chopped off his own arm.\n “Trying to escape?”\n Xiao Yan was startled when he realized that the ninth Tianzun was this ruthless. He immediately laughed in his heart. The black light circle once again sped up and grew a couple more times before once again approaching the ninth Tianzun. This caused the ninth Tianzun’s speed to be severely limited. At this moment, he finally sensed just how frightening this Great Heaven Creation Palm was. When Xiao Yan was only a four star Dou Zun, the ninth Tianzun was able to rely on his strength, which had far surpassed Xiao Yan’s, to block the Great Heaven Creation Palm. However, their levels were similar now. He no longer possessed any strength to resist it.\n “Swoosh!”\n Some despair surfaced in the ninth Tianzun’s eyes before a reaction finally occurred in the enormous abyss below. The rushing sound of wind appeared as a thousand-foot-large bloody glow erupted. It agglomerated into a blood dragon that emitted a roar as it ruthlessly charged toward Xiao Yan with a shocking momentum.\n Xiao Yan’s expression changed as he sensed the ripple that was suddenly transmitted from below, but he did not turn around to receive the attack. Instead, his eyes were dark and cold as they stared at the ninth Tainzun’s face, which had revealed a joy when this attack appeared. He coldly smiled and pushed his hand forward again, and a black light circle rushed out with lightning-like speed. Finally, it devoured the ninth Tianzun’s body.\n “Ah!”\n The ninth Tianzun’s terrified cry was emitted from within the black light after being devoured by it. He did not expect Xiao Yan to completely ignore the powerful blood dragon attack!\n “Bang!”\n The blood dragon that had whistled over ruthlessly collided with Xiao Yan’s body the moment the black circular light devoured the ninth Tianzun’s body. As it ruthlessly collided with Xiao Yan, a rich blood-colored light exploded in the sky…\n Watching the spreading blood light, which bloomed in the sky like a blood-colored sun, the expressions of Cai Lin’s group on the wall changed. They had not expected Xiao Yan to endure this blow. The frightening energy contained within the blood dragon earlier was enough to kill a six star Dou Zun on the spot!\n The wall had descended into a dead silence. There was still some joy from earlier, but the joy was permeated with shock at this moment…\n “Those from the Hall of Souls always like to hide in the darkness like rats…”\n This silence continued for over a dozen seconds as everyone’s hearts sank. At this moment, a faint voice soddenly echoed across the sky. A ‘swoosh’ sound appeared as almost every pair of eyes gathered in the sky. A skinny figure was stepping through the air as he slowly walked out of the spreading blood light…\n An earth-shaking cheer abruptly erupted from the fortress when that skinny figure appeared in front of their eyes.\n “Hu…”\n Cai Lin and the others sighed in relief when they heard the cheers beside their ears. They had been terrified by the unexpected situation earlier.\n “Huh?”\n A faint exclamation rang out of the deep abyss when Xiao Yan appeared to be unharmed after receiving that attack. A countless number of people heard a splashing sound from the abyss. It appeared as though the blood was flowing within it…\n The sound of flowing liquid became louder in front of countless pairs of eyes. A moment later, a blood color suddenly surfaced from the deep abyss. It was a vicious scarlet sea!\n The viscous blood sea continued to rise from the deep abyss. It finally came to a slow halt when it was level with edges of the deep abyss. The blood sea flowed and a completely blood-red figure slowly appeared. The figure lifted both of his scarlet eyes as he looked indifferently at Xiao Yan. A hoarse voice resounded over the sky. “You are indeed worthy of being a person that the hall chief attaches much importance to. You do possess the ability to be proud…”\n Xiao Yan studied that human figure below. At this moment, this person was wearing a long blood-colored robe. His long hair was scarlet in color, and his red eyes caused one’s heart to feel a bloody scent spread over when they looked in one’s direction.\n This sudden blood figure also caused many experts from the Profound Lion Sect to be stunned. Even they were unaware that such a mysterious expert was present in their camp.\n “What frightening strength this person has…”\n The hearts of some experts from the Yan Alliance sank upon seeing this blood figure. Although they were unable to sense the blood figure’s exact strength, it was obvious that the strength of this person was the strongest within the Profound Lion Sect’s camp.\n “Xue He zun-zhe?”\n The three Hu elders, who were battling those three experts from the Hall of Soul, had stopped because of this scene. Their eyes gravely observed that blood-colored figure as they stated in a deep voice.\n “Xue He zun-zhe?” Xiao Yan lifted his brow.\n “Junior pavilion chief, be careful. This person is an extremely renowned expert within the Central Plains. His Blood Transforming Grand Skill is extremely mysterious. Many top level experts have died in his hands back then. However, he suddenly vanished, and it seems that he has joined the Hall of Souls…” The eldest Hu brother spoke with a grave expression.\n “Ha ha, that was a name from a long time ago… all of you can now address me as fourth Tianzun or perhaps Xue He Tianzun…” The human figure, who was standing in the sea of blood, lifted his head and laughed in a hoarse manner when he heard the eldest Hu brother’s words.\n “Fourth Tianzun, huh…”\n Xiao Yan narrowed his eyes. The Hall of Souls really had many hidden experts. This person should be a peak Dou Zun of the ninth star. He was only one step away from the Ban Sheng class. It was unexpected that the Hall of Souls would dispatch such an expert. If he had not hurried back in time, the Yan Alliance fates would have been worrying…\n “You really act leisurely. However, you are too lazy to even rescue the life of your companion.”\n Xiao Yan faintly laughed. He randomly waved his hand, and a corpse that had been torn until its form was altered flew out. Finally, it landed in front of the fourth Tianzun. From the looks of it, it was the ninth Tianzun who had been struck by the Great Heaven Creation Palm earlier. However, he had completely lost his life…\n “It is pointless to rescue trash, who has failed many times…”\n The fourth Tianzun glanced at the corpse. He widened his mouth and a blood arrow shot from it. This blood arrow caused the ninth Tianzun to turn into a pool of blood that exploded. His voice was void of any emotion as he spoke.\n “Emotions are indeed unnecessary to you people from the Hall of Souls…” Xiao Yan mockingly lifted his mouth and spoke after witnessing this scene.\n “Ha ha, emotions should be abandoned…” The fourth Tianzun laughed when he heard Xiao Yan’s words. He immediately shook his head and softly sighed, “Originally, I did not wish to intervene, but that fellow is too useless and even ended up dying in your hands. Since this is the case… allow the old me to act on his behalf. The old me will bring back all the people with the blood of the Xiao clan…”\n The sea of blood in the deep abyss suddenly shot out and formed many large blood pillars after the fourth Tianzun’s words sounded. The blood fog spread, and a dense bone-chilling aura slowly swept out in all directions from the fourth Tianzun’s body!\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1382","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
