{"id":48073,"no":1439,"title":"Chapter 1439: Angry Buddha Reincarnation","content":"Chapter 1439: Angry Buddha Reincarnation\n The sea of fire surged over the star realm in all directions in front of a countless number of shocked eyes. Finally, the fire gathered in the sky above the battlegrounds. Flames churned and slowly separated into a fire path. A black-robed figure stepped through the fire wave using the fire path. That figure slowly appeared in front of everyone’s eyes.\n “Xiao Yan?”\n “Junior pavilion chief? Junior pavilion chief has exited his retreat!”\n Many exclamations that contained various emotions sounded within the Star Realm as everyone looked at this familiar figure. Those from the Falling Star Pavilion were filled with a wild joy while those from the Profound River Alliance were shocked...\n “How is this possible? This brat was only at the peak of the Dou Zun class two years ago. How is it possible for him to breakthrough to a Dou Sheng? Moreover, he is a genuine Dou Sheng!” Gu You looked at the young figure walking through the wave of fire in disbelief. He roared across the sky in a somewhat crazy voice. This scene had an overly terrifying impact on him.\n “He is that Xiao Yan? Didn’t those damn bastards say that he is not a threat? What happened?” The face of old demon Tian Ming by the side involuntarily twitched as he yelled.\n “It’s the Bodhisattva Heart! This brat obtained the Bodhisattva Heart!”\n Gu You’s eyes wildly flickered. He seemed to have recalled something a moment later. His teeth were clenched as he said, “No wonder, no wonder this brat seemed to have completely vanished during these two years. He was in a retreat to breakthrough to the Dou Sheng class!”\n All fights within the star realm halted at this moment. Many excited and terrified eyes locked onto the human figure walking out of the sea of flames. The terrifying pressure that was emitted caused even an elite Dou Zun’s soul to tremble. This pressure was many times stronger than the pressure generated by a high level Ban Sheng like Gu You!\n The sea of flames spread. Xiao Yan’s body stood in the air in front of countless pairs of shocked eyes. He studied the star realm, which was covered with signs of battles. Murderous intent wildly surged within his black eyes.\n “Chi!”\n Xiao Yan’s body flashed. The next time he appeared, he was barely above the enormous square. He landed in a deep pit and appeared beside Yao Lao, who was covered in blood. Both of his eyes strangely became extremely calm as he looked at Yao Lao’s miserable appearance. Only those familiar with Xiao Yan were aware that this was his most frightening state of mind.\n “Cough, cough… ha ha, little fellow, you have finally left your retreat. If you had been a little later, you would have had to bury these old bones of mine.” Yao Lao’s eyes erupted with great joy after seeing Xiao Yan appear beside him. He spat out a mouthful of fresh blood and loudly laughed.\n “Teacher, sorry… leave everything to me.”\n Xiao Yan was quiet. He softly uttered these words before lifting up the seriously injured Yao Lao. After which, Xiao Yan rushed out of the large pit and placed him on a stone platform. He swept his eyes over and a couple of Falling Star Pavilion Elders hurried over to take care of Yao Lao.\n “Cai Lin and the others are also injured.” Yao Lao rubbed the trace of blood from the corner of his mouth as he informed Xiao Yan.\n Xiao Yan nodded. His hand grabbed toward empty space and three figures flew over under his control. They landed on the stone platform beside Xiao Yan.\n Xiao Yan looked at the blood that hung on the corner of Cai Lin’s, the Little Fairy Doctor’s and Qing Lin’s mouths. After which he focused on Cai Lin. Her cold bewitching face was pale. Dense blood dyed her clothes until it became sticky.\n Xiao Yan pulled out a large black robe from his Storage Ring and used it to cover Cai Lin’s body. He did not utter a single word as he took out a bottle of medicinal pills and handed it to the Little Fairy Doctor, who was still conscious. She received the bottle and softly said, “This was done by the third Tianzun. That person is an initial level Ban Sheng.”\n “Aye.”\n Xiao Yan glanced at the Little Fairy Doctor and smiled. However, this smile was ferocious and sinister.\n “Be careful.”\n Cai Lin spoke with an extremely weak voice when Xiao Yan turned around. She was unable to see through Xiao Yan’s strength, but she knew the other party had three Ban Shengs. At this moment, Yao Lao had been seriously injured and was unable to join the battle. Xiao Yan’s strength might have soared, but it would be quite difficult for him to come out victorious.\n “Rest well. There is no need to worry about anything else.”\n Xiao Yan smiled and comforted her. After which, his eyes shifted to the surrounding Falling Star Pavilion Elders. There were quite a number of unfamiliar faces among them. These people had likely joined the Falling Star Pavilion while he was still in his retreat. Faced with Xiao Yan’s gaze, these extremely arrogant Elders hurriedly lowered their eyes out of respect. The frightening aura that vaguely seeped out of Xiao Yan’s body had caused even their legs to become feeble.\n “Take care of them. There is no need for all of you to fight…”\n “Understood, junior pavilion chief.”\n The many Falling Star Pavilion experts respectfully replied after hearing this command.\n After issuing some instructions, Xiao Yan finally lifted his head. His eyes looked to the sky. Gu You, old demon Tian Ming, and the third Tianzun from the Hall of Souls had gathered together at that spot. Their eyes were cautiously studying him.\n The faces of the three of them were a little stiff as they watched Xiao Yan look over with a calm expression in his eyes. They had not expected the situation to change like this. With their senses, they were naturally able to sense Xiao Yan’s current strength.\n One star Dou Sheng!\n He was not a Ban Sheng! He was a genuine Dou Sheng!\n There was only a one word difference between a Ban Sheng and a Dou Sheng, but there was a relatively frightening gap between the two. Although an elite Ban Sheng could also be called a Dou Sheng since they possessed a strength that far surpassed that of an elite peak Dou Zun, they could only be strictly described as a ‘fake Sheng.’ Only when one truly reached the one star level could one be called a genuine Dou Sheng!\n The Ban Sheng class was separated into the initial, intermediate, and high levels. These levels appeared small, but it was difficult if one wished to leap across them. For example, it had been decades since Gu You had advanced to the Ban Sheng class, yet he had only become a high level Ban Sheng. Old demon Tian Ming had remained at the high level Ban Sheng for an even longer period of time, but he still failed to reach a one star Dou Sheng. Thus, it was possible to tell just how great of a gap there was between a one star Dou Sheng and a high level Ban Sheng.\n Even though the three of them looked calm, they involuntarily felt a great storm appear within their hearts after processing that Xiao Yan had left the Dou Zun class, leaped over the Ban Sheng levels, and reached a one star Dou Sheng within a short two years.\n “The scenery of the star realm is nice. This is not a bad place to be buried.”\n Xiao Yan looked at those three. His body moved as he appeared a short distance away from them as he spoke in a faint voice.\n “Xiao Yan, you should not act arrogantly. So what if you are a one star Dou Sheng? Do you not believe that I will call people from within the clan to come out and finish you off?” Gu You’s expression was dark and cold as he cried out. Despite his strong front, Gu You’s heart had also began to tremble. An elite Dou Sheng was considered the top within the Hun clan. One was usually unable to even see those old fellows. Other than the clan head’s personal summons, they would ignore anyone else. They were not people that Gu You could simply summon as he pleased.\n Xiao Yan thought about his words before nodding. He waved his sleeve and a frightening ripple spread out. In the blink of an eye, the space within the star realm became distorted and it appeared as though no spatial ripple could be emitted. These people would fail to escape even if they were to use a spatial scroll.\n Gu You’s expression turned even blacker after seeing that his words had ended up causing Xiao Yan to lock space itself. He involuntarily felt the impulse to slap himself.\n “What are you looking at? Do you think that he will easily let us off today? Although he is a one star Dou Sheng, his foundation has yet to stabilize. He will not be able to do anything to us if we cooperate!” Gu You forcefully suppressed the impulse within his heart. He saw the furious eyes of old demon Tian Ming by the side and involuntarily cursed.\n Old demon Tian Ming was filled with a fury after being chided by Gu You. If Gu You had not reassured him that nothing would go wrong, he would not have decided to attack the Falling Star Pavilion. In the end, the ‘nothing would go wrong’ had evolved into this situation. If he wasn’t a somber person, he would have involuntarily started furiously cursing.\n Although old demon Tian Ming was filled with fury, he also understood his current situation. The three of them might still have a chance to survive if they worked together. They would truly end up dying if they separated.\n “Let’s fight him together!”\n Old demon Tian Ming spoke in a gloomy manner. He did not say anything more as his feet stepped through empty air and a monstrous Dou Qi surged. A ten-thousand-foot-large illusory figure formed behind him. At the same time, Gu You and the third Tianzun began to circulate their Dou Qi. In an instant, a wild wind rose in the sky as dark clouds churned. It appeared as though a big storm was imminent.\n Xiao Yan watched these three individuals join hands. His black eyes appeared completely calm, not a ripple within them, but there was a chill that could freeze one’s soul slowly surging deep within his eyes.\n “Profound Sky Blood Palm!”\n “Ten Thousand Soul Heaven Lock!”\n The Gu You’s aura wildly surged along with the other two. In the end, they furiously roared with bright-red faces. Three winds that containeds extremely fright sharp energy wind instantly shattered this empty space. They began like three furious dragons that roared wildly at Xiao Yan.\n Xiao Yan’s black eyes watched the frightening attacks that those three had used all their strength to unleash. He slowly lifted his hand. There was a strange expression within his eyes.\n “This is something that I came to comprehend while breaking through to the Dou Sheng class. Today, I will offer the three of you as sacrifices to it!”\n Four types of flames suddenly erupted from Xiao Yan’s hand after his indifferent voice sounded. They began to rotate in a crazy manner. Within the blink of an eye, they had turned into a four coloured thousand feet large strange ring. The ring continued to rotate. The interior of the ring was black. This kind of black was even purer than the spatial black holes…\n It was a kind of reincarnation feeling!\n The ring was formed in Xiao Yan’s palm. Subsequently, it was pushed downwards and gently collided with the full force attacks by Gu You’s group.\n “This attack is called Angry Buddha Reincarnation!”\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1439","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
