{"id":48082,"no":1448,"title":"Chapter 1448: Small Pill Tower First Elder","content":"Chapter 1448: Small Pill Tower First Elder\\n\\n Light from the bright, warm sun tore through the layers of clouds and landed on the top of the mountain. An ancient and melodious gong slowly reverberated through this open ground.\\n\\n The top of the mountain became distorted after this gong began to vibrate. Seven elderly figures appeared on a stone stage within the open ground without any forewarning. Many people bowed and greeted these seven elders after seeing them. They respectfully said, “Greetings to all seven Elders!”\\n\\n The Main Elder Council could be considered the highest decision body in the Small Pill Tower. These Elders naturally possessed an extremely high status. Moreover, all of them had been selected from the Small Pill Tower and were highly regarded individuals. Hence, many people in the Small Pill Tower respected them.\\n\\n Xiao Yan was mixed in with the crowd. His eyes swept over the seven Elders. After slowly sweeping his gaze over them, he finally paused on four individuals. The auras of these four individuals appeared exceptionally powerful among those seven Elders, especially the linen-clothed expressionless old man standing at the center. He caused Xiao Yan to throw a sideways glance.\\n\\n “Two middle level Ban Sheng, one high level Ban Sheng, and one who has reached the initial level of the second star of the Dou Sheng class… is this the true strength of the Pill Tower? No wonder it is comparable to the Hall of Souls.”\\n\\n Xiao Yan’s eyes paused on that linen-clothed old man and quietly sighed in his heart. The foundations of these factions, which had existed for a long time within the Central Plains, was indeed relatively frightening. If one’s strength did not reach a certain level, it would be impossible for one to be aware of these extremely secretive existences.\\n\\n “That linen-clothed elder is the First Elder of the Small Pill Tower. With the exception of the ancestor, he is the most senior person in the Small Pill Tower. Even I will have to greet him as someone from the younger generation.” Yao Lao softly explained as he stood beside Xiao Yan.\\n\\n Xiao Yan was quietly speechless after hearing this. Even Yao Lao would have to greet him as someone from the younger generation. The seniority of this First Elder was really frightening.\\n\\n The linen-clothed man seemed to have detected Xiao Yan observing him. A pair of eyes as deep as starry space were thrown toward Xiao Yan. A fluctuation immediately flashed across those eyes. Clearly, he had discovered Xiao Yan’s true abilities.\\n\\n “What a powerful spiritual pressure…”\\n\\n Xiao Yan’s brows slightly twitched after the First Elder glanced over. He could sense an invisible pressure form in the surrounding space. This kind of pressure could not be detected by anyone else. Only the parties involved could sense it. Fortunately, Xiao Yan was very different from his old self. The spiritual pressure of this First Elder might pressure him a little, but it could not harm him. His expression did not shift because of the exchange.\\n\\n The chin of the First Elder moved slightly in an undetectable manner after noticing Xiao Yan’s unchanging expression. His eyes finally slid away. His old but ordinary voice resounded in the ears of everyone present, “Today is a rare occasion in our Small Pill Tower, the Elder Selection. It is not the first time everyone has experienced it. I shall not talk more about the rules involved. You can take any medicinal ingredients from the mountain. Whoever refines the highest tier medicinal pill will naturally be the victor.\\n\\n “Everyone, if there are no more inquiries, can those who have obtained the qualification to join the selection please step forward.” Although this First Elder was extremely old, he did things relatively quickly. Without any unnecessary words, he pointed at the open ground in front of him and gave an order in a faint voice.\\n\\n “Understood!”\\n\\n Some respectful replies came from around the open ground after hearing the First Elder’s words. Many figures immediately stepped forward and found their own area to stand within the open ground.\\n\\n “I will also head out.” Xiao Yan smiled after seeing these people step forward.\\n\\n “Aye, do your best. Do not disgrace your teacher’s name.” Xuan Yi grinned and replied.\\n\\n Xiao Yan nodded. After which, he squeezed out from the crowd and found an empty space amidst the many surprised gazes from around him.\\n\\n The appearance of Xiao Yan attracted many pairs of eyes. Most of the old people here lived in seclusion. Hence, they did not know why this young man had suddenly joined the selection.\\n\\n “This junior is Xiao Yan. He is Yao Chen’s disciple and was the champion of the most recent Pill Gathering. According to the rules, he possesses the qualification to join the Elder selection.” The First Elder swept his eyes around as he explained in a faint voice.\\n\\n “Ah, so that is why…”\\n\\n “It is unexpected that the old fellow Yao Chen accepted another disciple.”\\n\\n “However, this Elder selection is not an ordinary game. Can it be that Yao Chen has purposefully asked this young fellow to join in order to gain some experience?”\\n\\n Some private conversations started after the First Elder’s words sounded. Although the weight of the Pill Gathering Champion title was quite heavy, it appeared a little insufficient if one wished to rely on this title to compete with the other seniors for the position of an Elder. Many people concluded that Yao Chen intended to have Xiao Yan gain some experience.\\n\\n Xiao Yan was naturally unconcerned with the thoughts of these people. He shut his eyes and recuperated.\\n\\n After many elderly figures appeared within the spacious open ground, the remaining people slowly withdrew to the edges of the square. Finally, the First Elder once again slowly opened his mouth. “If everyone is prepared, please begin.”\\n\\n The atmosphere within the open ground immediately became tense after hearing the First Elder’s words. Everyone’s expressions gradually became grave.\\n\\n “Clang!”\\n\\n A clear metallic sound suddenly appeared in this tense atmosphere. Soon after, another noise appeared. Many medicinal cauldron with extraordinary auras were taken out of Storage Rings. After which, they heavily landed on the ground.\\n\\n “Start the fire!”\\n\\n Many cries soon sounded after the cauldrons landed on the ground. Soon after, many different flames that were all quite powerful rose in the medicinal cauldrons. In an instant, the temperature of the entire square rapidly rose.\\n\\n Xiao Yan’s expression slowly became grave as he looked at the many medicinal cauldrons around him, but he did not take out a medicinal cauldron. Instead, he extended his right hand and suddenly clenched it. A purple-brown flame that contained hints of a dense white color soon rose from his hand.\\n\\n “Bang!”\\n\\n This cluster of flames had just appeared when it suddenly swelled. Within a short instant, it began burning above Xiao Yan’s head like a cloud of fire. Subsequently, the fire cloud gathered and swiftly formed a purple-brown medicinal cauldron in front of many stunned eyes. The cauldron was completely made out of fire.\\n\\n “This is… Heavenly Flame?”\\n\\n “This young fellow really boasts a powerful control over his flame. However, isn’t he afraid of losing control during the refinement after using a Heavenly Flame to form a cauldron?”\\n\\n Xiao Yan’s trick immediately attracted many surprised gazes. Many low and deep voices soon conversed.\\n\\n The flame cauldron slowly floated in front of Xiao Yan. Its extremely solid appearance caused many alchemist gurus to reveal grave expressions. Just what kind of a control over a flame and Spiritual Strength was required in order to control the Heavenly Flame at this pinnacle level?\\n\\n Old demon Hou, who was a short distance away, was also attracted by the commotion. He knit his brow slightly. A cold laugh immediately sounded. A member of the younger generation was ultimately a member of the younger generation. They always did useless things…\\n\\n Xiao Yan gently flicked his finger as he studied the flame cauldron he had formed. A flame rose within the medicinal cauldron. It emitted a ‘puff’ and transformed into a fire dragon that wandered around the medicinal cauldron.\\n\\n Xiao Yan did not continue the pill refinement process after forming this medicinal cauldron. Instead, he slowly shut his eyes.\\n\\n Many people were stunned when they saw him shut his eyes, but no one dared to underestimate this extremely young person after the level of skill he had just displayed.\\n\\n “I wonder what kind of medicinal pill Xiao Yan is planning to refine this time around?” Xuan Kong Zi looked at Xiao Yan from among the crowd and mused to himself.\\n\\n “Xiao Yan has basically learned all that I know. I have never attempted to refine a tier 9 medicinal pill in the past. Hence, I can only give him two types of medicinal formula…” Yao Lao softly spoke. The importance of medicinal formulae was obvious after reaching such a level. If one did not possess the medicinal formula of a tier 9 medicinal pill, it would be impossible to refine a medicinal pill of that level. A tier 9 medicinal formula was not inferior to a Tian class Qi Method or Dou Skill. Even though Yao Lao had collected formulae for many years, he had only managed to obtain two of them. Moreover, they were the lowest grade of a tier 9 pill, a Treasure Pill.\\n\\n After Yao Lao had spoken, Xiao Yan suddenly opened both of his eyes. He spread his fingers and an emerald-colored bead appeared between them.\\n\\n “Bodhisattva Seed? He wishes to refine a Bodhisattva Pill?”\\n\\n Yao Lao’s experienced group was aware of Xiao Yan’s goal after seeing that emerald bead appear.\\n\\n “The highest grade of a Bodhisattva Pill can at most attract a nine-colored Pill Lightning. It is a little difficult if he wishes to beat old demon Hou…” Xuan Yi knit her brows after figuring out what he was going to attempt. It would be a little difficult to obtain victory by simply relying on the Bodhisattva Seed.\\n\\n Xuan Kong Zi and Tian Lei Zi frowned. They had already learned that Xiao Yan was an elite Dou Sheng from Yao Lao. Although Xiao Yan did not mention his spiritual state, it was obvious that he had reached the Heavenly Realm. Therefore, he already possessed the qualification to refine a tier 9 medicinal pill. They could not understand why Xiao Yan had chosen to refine the Bodhisattva Pill.\\n\\n “He should have his own plans…”\\n\\n Yao Lao hesitated for a moment. Based on his trust in Xiao Yan, he did not think that Xiao Yan would underestimate his opponent.\\n\\n Xiao Yan’s eyes drifted to Yao Lao’s group after he took out the Bodhisattva Seed. He faintly smiled after seeing their frowns. People may think that his pill refinement experience was inferior to an elder like old demon Hou. Normally speaking, his experiences would be inferior to these old demons, who had trained for hundreds of years. However, Xiao Yan had undergone a hundred reincarnations while meditating under the Bodhisattva Tree, which brought him numerous benefits…\\n\\n One of those benefits was experience in pill refinement!\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1448","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
