{"id":48106,"no":1472,"title":"Chapter 1472: Ambush","content":"Chapter 1472: Ambush\\n\\n The next morning—\\n\\n Xiao Yan stood beside the abyss. Both of his hands were placed behind his back. His eyes roamed over the Nine Serene Spring. Today, they were about to move and head to the empty realm to stop the reinforcements of the Heaven Demon Phoenix tribe.\\n\\n “Xiao Yan, it is about time. We should get moving…” The Little Fairy Doctor flew over and landed a short distance away from Xiao Yan before speaking.\\n\\n “Aye.” Xiao Yan slightly nodded. He waved his sleeve and a majestic Spiritual Strength spread apart. It turned into a spatial formation that covered the Nine Serene Spring. He had placed a detection barrier here It not only protected the Nine Serene Spring, he would also immediately sense any activity within the barrier.\\n\\n “Cai Lin, you can just relax and train. This place is the headquarters of the Nine Serene Deep Ground Python tribe. Yao Ming has already designated this area to be a forbidden ground and has dispatched experts to guard it. You should not be disturbed. You should return to the Falling Star Pavilion after coming out of your retreat…” Xiao Yan’s mouth moved. A soft sound that was wrapped by Dou Qi was transmitted into the Nine Serene Spring. He ceased hesitating as he turned around and rushed into the distance.\\n\\n “Splash…”\\n\\n The splashing sound of water was emitted from within the Nine Serene Spring soon after Xiao Yan and the Little Fairy Doctor left. That enormous figure deep inside the spring moved slightly. A huge pair of seven-colored eyes were slowly opened. The snake first lowered her head to look in the direction of the deepest part of the Nine Serene Spring. There was a special flint flickering in those snake eyes. She had vaguely sensed a vague beckoning ever since she had entered this Nine Serene Spring. After sensing this for over half a month, she was finally able to confirm that this beckoning was emitted from the bottom of the Nine Serene Spring...\\n\\n That bottom was not the place where Yao Ming was sealed. Instead, it was somewhere even deeper, but even Xiao Yan, who had the protection of the Heavenly Flame, did not dare to go that far…\\n\\n “Although the feeling of being protected is quite nice, I still prefer being stronger than you. This might be a little difficult now, but I must, at the very least, do my best…”\\n\\n The seven-colored snake eyes slowly blinked as Cai Lin immediately swung her tail. Her enormous body was accompanied by waves of water as she swiftly hurried to the bottom of the Nine Serene Spring.\\n\\n “Brother Xiao Yan, those people from the Heaven Demon Phoenix tribe will definitely tear a spatial hole from the location of their tribe to enter the empty realm. We can enter it beforehand and sense any spatial fluctuations. Then we will be able to quickly detect their path.” Yao Ming smiled as he suggested an idea to Xiao Yan while he stood in front of a large hall.\\n\\n “Aye.” Xiao Yan nodded.\\n\\n “I will be personally accompanying you this time around. There will also be six other Elders. Although our numbers are far inferior to the Heaven Demon Phoenix tribe, we will be able to stop them from fulfilling their mission as long as we can defeat the Heaven Demon three phoenix.” Yao Ming pointed at the six Elders behind him as he spoke.\\n\\n Xiao Yan’s eyes looked over. There was only one white-haired old man among them who could meet his high standards, but this man was merely an intermediate Ban Sheng. The remaining five were only around the ninth change peak of the Dou Zun class. At a glance, it was obvious that this lineup was inferior to the Heaven Demon Phoenix tribe’s lineup.\\n\\n “Brother Xiao Yan should not blame me. Yao Xiaotian and the First Elder ground our Nine Serene Deep Ground Python tribe into such a miserable state.” Yao Ming sighed and spoke in a somewhat deep voice. If Yao Xiaotian and the First Elder had supported him without any wild ambitions, there was no telling just how strong the Nine Serene DeepGround Python tribe would be. At the very least, they would not be so much weaker than the Heaven Demon Phoenix tribe.\\n\\n “Ha ha, what is tribal chief Yao Ming saying. It is already good that you are willing to lend a hand…” Xiao Yan laughed and shook his head. He glanced at the Little Fairy Doctor and Qing Lin by the side. There might still be a great gap between the two ladies and the Ban Sheng class despite their training during this period of time, but if they were to cooperate, no one in the Dou Zun class would be a match for them. They would even be able to barely hold out while facing a Ban Sheng expert. They could be considered a lot of help.\\n\\n “It is about time, we should get moving…”\\n\\n Yao Ming smiled. He hand suddenly waved at empty space before a dark-black spatial crack appeared. After which, he pulled with both of his hands and a spatial tunnel appeared in front of everyone.\\n\\n “Let’s go.”\\n\\n Xiao Yan did not hesitate after seeing space be ripped open. He took the lead to immediately step into the crack. The Little Fairy Doctor and Qin Lin followed close behind.\\n\\n “All remaining Elders, I will leave the Nine Serene Deep Ground Python to all of you during this period of time that I am away…” Yao Ming spoke to a few others beside him in a deep voice.\\n\\n “Understood!” The few Elders quickly responded in a respectful tone after hearing this information.\\n\\n “We should also get going.” Yao Ming nodded after hearing them reply. He waved his sleeve and took a stride into the spatial crack. Those six Elders followed him.\\n\\n That spatial crack finally began to slowly disappear after the last person entered it. Finally, it vanished from sight.\\n\\n The empty realm was completely quiet. An extremely intense spatial fluctuation was occasionally being emitted from the black space. Many cracks surfaced like ferocious large mouths...\\n\\n “Chi!”\\n\\n A crack surface from the quiet emptiness. Many human figures penetrated through the crack and finally appeared with this dark-black space.\\n\\n “How far is this place from the entry point of the Heaven Demon Phoenix tribe?” Xiao Yan turned his head. He looked at Yao Ming as Yao Ming charged out from the spatial crack before asking.\\n\\n “Ha ha, relax, the spy that I placed in the Heaven Demon Phoenix tribe has a spatial imprint on him. Therefore, I am able to sense the position of the Heaven Demon Phoenix tribe in this space… if they travel from their tribe, they will definitely appear in that area. Ugh.” Yao Ming smiled. After which, he shut his eyes and sensed for a moment. Finally, he reopened them and looked to the north. “Let’s go.”\\n\\n Yao Ming’s body took the lead to move after his words sounded. He stepped through empty space and swiftly rushed forward. The wild and violent chaotic spatial flow automatically disappeared upon entering within a hundred feet from him. Upon reaching the Dou Sheng class, the frightening chaotic flow within this empty space no longer posed much of a threat.\\n\\n “Follow.”\\n\\n Xiao Yan waved his hand. He led everyone and swiftly followed Yao Ming.\\n\\n “This place is close to the space where the Heaven Demon Phoenix tribe is. We will definitely sense it if they tear through the space and enter…” Yao Ming finally came to a halt after shuttling through the empty realm for half an hour. He looked into the distant black darkness as he informed everyone.\\n\\n Xiao Yan looked around him and nodded slightly. He said, “The chaos flow within this space is a little denser. It will be able to hide us…”\\n\\n “Ha ha, in that case, we should wait for our prey to appear.” Yao Ming laughed.\\n\\n Xiao Yan smiled and nodded. He sat down. Qing Lin and the Little Fairy Doctor also did the same beside him. All that they needed to do was wait until the big fish known as the Heaven Demon Phoenix tribe barged into the net they had prepared…\\n\\n The concept of time was extremely blurry within this empty realm. Two days passed by in the blink of an eye in this unusually dark environment. Soon after that, the space at a spot a great distance from Xiao Yan’s group suddenly fluctuated. Many powerful figures slowly stepped through the spatial crack line before appearing in this empty realm.\\n\\n The crack line slowly disappeared as the last person stepped out.\\n\\n Three people stood at the leader’s spot of this group of twenty plus people. The remaining gazes that were looking at these leader’s backs were all filled with respect.\\n\\n “This operation is unusually important. It concerns whether or not our Heaven Demon Phoenix tribe will be able to completely surpass the Ancient Void Dragon tribe. Hence, no one should make a mistake. Otherwise, you will face the rules of the tribe!” A red-clothed woman spoke among the three individuals. Her tone was icy-cold and filled with a majestic aura.\\n\\n This woman was in a red dress. She appeared to be in her thirties, but her aura was so powerful that it was frightening. A pair of somewhat delicate eyebrows bunched together. An evil aura surged from her, causing the two Elders beside to take a step away without anyone noticing.\\n\\n “We will obey grand Elder’s orders!”\\n\\n Those members of the Heaven Demon Phoenix tribe behind her, who were extremely powerful individuals, did not dare to interrupt this person’s cold cry. All of them hurriedly responded in a respectful tone. There were two familiar faces among these people. One was naturally Feng Qing Er, who had formed many grudges with Xiao Yan while the other was Jiu Feng, who had exchanged blows with Xiao Yan. He was also known as a potential successor to the tribal chief of the Heaven Demon Phoenix tribe.\\n\\n The two of them possess a high status in the Heaven Demon Phoenix tribe, but they appeared extremely respectful in front that red-robed woman’s fierce aura. They did not dare to slight her.\\n\\n “Hmph, Ancient Void Dragon, it is unexpected that this day has actually come. My Heaven Demon Phoenix tribe will end up prospering once your civil war ends. At that time, I will completely eliminate your tribe from this world.\\n\\n The red-robed woman laughed with a somewhat sharp wicked voice. She immediately waved her sleeve. A wind surged and her body turned into a ray of light that rushed into the distance like a meteorite. The many experts from the Heaven Demon Phoenix tribe hurriedly followed behind her.\\n\\n Xiao Yan, who was seated within the chaotic spatial flow in a far location, suddenly opened his eyes the moment that red-robed woman hurried forward. Yao Ming on the other side also opened his eyes. They exchanged glances as a faint smile lifted onto their faces.\\n\\n “Prepare yourselves. Those from the Heaven Demon Phoenix tribe are about to arrive…”\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1472","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
