{"id":48265,"no":1631,"title":"Chapter 1631: Heavenly Flame Square","content":"Chapter 1631: Heavenly Flame Square A faint fog enveloped around this mysterious space, causing the entire area to appear misty. This space was completely quiet. That manner was as though it had been quiet for eons. A piece of land floated in this seemingly vast and boundaryless space. The land was suspended in the air without any support. It appeared just like a pavilion in the air. “Chi!” The loneliness that had lasted for a long time had finally been broken today. The misty space had suddenly become distorted. Immediately, a huge spatial tunnel appeared. Soon after, many figures suddenly rushed out from within. Finally, they landed on that plot of land. “Is this the Ancient God Mansion?” Xiao Yan’s body had just landed on the ground when his eyes hurriedly swept around him. However, he was stunned to discover that even with the great strength of his Di State soul, he was actually unable to probe beyond a ten thousand feet radius. Clearly, this place imposed quite a great pressure towards Spiritual Strength. Xun Er, Cai Lin and the rest had also swiftly appeared beside Xiao Yan. Their eyes revealed a cautious expression as they watched this mysterious space. With the many human figures appearing, the experts from both parties also hurriedly separated. After which, they stared at the other side with cautious eyes as they readied themselves for various sneak attacks. “Do not be delayed by them. Let’s go!” The Nihility Devouring Flame glanced at Gu Yuan’s group. After which, his eyes turned towards this realm. There was some strange fluctuation appearing within his eyes. After which, he spoke in a soft voice. He subsequently took the lead to hurry into the distance. Hun Tiandi and the experts from the Hun clan quickly followed. “The Nihility Devouring Flame is actually aware of the way?” Gu Yuan was startled after he saw this scene. Even he could sense some pressure after arriving in this place. It was impossible for him to probe and locate the Di tier embryonic pill within such a short time. Unexpectedly, this Nihility Devouring Flame seemed to be extremely familiar with the way. “The Nihility Devouring Flame huh?” Zhu Kun was surprised. He immediately nodded while being in a deep thought. “It is not surprising for him to know the way. Follow them!” Zhu Kun did not give any explanation after his voice sounded. He directly took the lead to give chase. Gu Yuan and the others hesitated for a moment before quickly following him. The two groups charge forward with full force on this seemingly vast and endless land. They were just like falling stars that swiftly cut through the sky. This fast charging continued for over a dozen minutes. Finally, the speed of the Nihility Devouring Flame and the others in front were gradually reduced. Gu Yuan, Xiao Yan and the others swiftly gave chase after their speed was reduced. After which, they looked at the ancient stone hall, which appeared on that spacious plains. A fiery heat flashed within their eyes. The stone hall stood quietly on the vast and endless plains. An ancient aura spread from it and reverberated across the space. In front of the stone hall was an incomparably huge square. There were many ten thousand feet large towering pillars standing on both sides of the square. A towering like majestic aura pounced over from that place. Xiao Yan’s group carefully landed on the square. Some rubbing sound quietly sounded on the stone ground as their footsteps landed. There was some distance between both parties. After which, they occupied both sides of the hall. They opened their strides and cautiously walked towards the square. This square was extremely spacious. Everyone felt as though they were ants crawling in the desert as they walked on it. It was difficult for them to see its boundary. However, everyone present could already be considered the strongest people on the Dou Qi continent. All of them possessed some metal toughness. Hence no one created an uproar. Everyone’s hearts were filled with some respect and fear in this divine like place. “Huh?” Xiao Yan’s footsteps suddenly paused as he walked. He turned his head and looked at the top of a stone pillar a short distance in front. There was a cluster of deep yellow coloured flame rising from it. This kind of flame allowed Xiao Yan to see from a glance that it was a kind of Heavenly Flame. If he guessed correctly, this should be the Mysterious Yellow Flame that was ranked twenty-third on the Heavenly Flame Ranking. “Why is this Heavenly Flame so weak?” However, Xiao Yan soon began to frown. This was indeed the Mysterious Yellow Flame. However, it appeared extremely weak and tiny. Its appearance was as though the strength that was originally within the Heavenly Flame had been completely lost. “Chi!” A flame suddenly gathered on Xiao Yan’s shoulder as he felt some doubts. After which, Little Yi appeared in a flash. It looked at this quiet square and a somewhat lost expression suddenly surged within its eyes. “This place… is very familiar.” Xiao Yan’s footsteps suddenly paused after he heard Little Yi’s low voice. He turned his head and looked at Little Yi in shock. Familiar? This was the Ancient God Mansion. Who could be familiar with this place. “What happened?” Light flashed across Xiao Yan’s eyes. A thought appeared in his heart and it was transmitted to Little Yi’s heart. “I don’t know… I simply feel that this place is a little familiar. It seems… that I have been here in the past.” Little Yi replied while feeling lost. Xiao Yan’s expression changed rapidly. Been here in the past? How could it be possible? The Ancient God Mansion was opened for the first time. Before this, he had never heard of the Ancient God Mansion being opened before. Hence, Xiao Yan first thought was that it was ridiculous when he heard Little Yi mentioned that it seemed to have been to this place before. Soon after, however, he thought that Little Yi, who was mentally connected to him, would definitely not lie! In this way, it seemed that there is a very high possibility that what Little Yi had said was true. However, Xiao Yan did not understand why Little Yi would feel that this place was familiar… Xiao Yan frowned tightly. His footsteps caught up with the others. At this moment, everyone had also discovered the Heavenly Flames on the stone pillars. However, the Heavenly Flames was ranked too far behind. Hence, they did not pay much attention to it. However, they had walked for another thousand feet when another towering stone pillar appeared. There was also a cluster of flame rising on the stone pillar! “Ten Thousand Beast Spirit Flame, ranked twenty-second on the Heavenly Flame Ranking…” Xiao Yan slowly exhaled as he looked at the cluster of rising red flame, which vaguely revealed the appearance of tens of thousands of beasts. His eyes flashed. After which, he looked forward. His footsteps sped up greatly. Seeing this, Gu Yuan and the others hurriedly followed. They once again advanced by a thousand feet. Another stone pillar appeared. There was also a different Heavenly Flame rising from it. However, these Heavenly Flames did not possess an overly great strength. At a glance, it appeared just like a decoration. However, Xiao Yan, who was well versed in Heavenly Flames, understood that these Heavenly Flames were not fake. They were all genuine Heavenly Flames! “These Heavenly Flamed…” Gu Yuan’s group looked at this scene. Their eyes revealed a shocked expression. “It seems that the Heavenly Flame ranking is higher the further in front it is located…” Xiao Yan softly muttered. He turned his head and looked at Little Yi, which was sitting on his shoulder. After which, his eyes turned to the Nihility Devouring Flame a short distance away. The latter’s emotion also seemed to have a big ripple. However, there seemed to be a lost expression similar to that of Little Yi in them. “Faster!” XiaoYan urged. After which, he quickened his footsteps. The group hurriedly followed. With their increase in speed, many towering stone pillars appeared one after another. The Heavenly Flames ranked on the Heavenly Flame Rankings rose o these stone pillars. Amongst these Heavenly Flames, Xiao Yan could see an extremely familiar Green Lotus Core Flame, Fallen Heart Flame, Sea Heart Flame, Bone Chilling Flame etc... “It is unexpected that the Tou She Ancient God actually loves to collect Heavenly Flames…” after seeing the sixth ranked flame on the Heavenly Flame Ranking, the Eight Wasteland Destruction Flame, even Gu Yuan could not resist exclaiming. “I wonder if the legendary top three ranked Heavenly Flames on the Heavenly Flame Ranking are here?” Yan Jin nodded. He suddenly looked at Little Yi on Xiao Yan’s shoulder and the Nihility Devouring Flame a short distance away. Although Heavenly Flames were rare in this world, there were more than one of each type. However, the top three ranked Heavenly Flames were different. Normally speaking, if there was a Purifying Demonic Lotus Flame or a Nihility Devouring Flame existing in this world, there would not be a second flame of the same type appearing. Yet, the Purifying Demonic Lotus Flame and the Nihility Devouring Flame were both currently present. One was in Xiao Yan’s hands while the other had turned into a human shape to aid the Hun clan. Could that Tou She Ancient God have created a second Purifying Demonic Lotus Flame and Nihility Devouring Flame? “Go!” Yan Jin was clearly not the only person who had such thoughts. Even those from the Hun clan and swiftly increased their speed after exchanging glances. The two groups quickly hurried over the spacious square. A moment later, all the figures came to a sudden halt. At this moment, they had gradually approached the end of the square. Another two towering stone pillars appeared in everyone’s sight after they passed by the fourth ranked Gold Emperor Incinerating Heavenly Flame. Everyone immediately threw their eyes towards the top of the stone pillars the moment they saw the two giant looking pillars. This time around, however, they did not see any Heavenly Flame rising from them. The top of the stone pillars were empty. The expected Purifying Demonic Lotus Flame and Nihility Devouring Flame were absent from them. In other words, it seemed that these two types of Heavenly Flames were not included in the Tou She Ancient God’s collection. Everyone sighed softly after seeing this. They appeared to feel a slight regret. “These are the last two stone pillars. It seems that even the Tou She Ancient God is unable to obtain the legendary first ranked Heavenly Flame.” Gu Yuan also spoke somewhat regretfully after seeing the end of the square after the two stone pillars. Xiao Yan did not interrupt. His eyes were merely startled as he stared at the two empty stone pillars. His hands slowly touched Little Yi on his shoulder. Suddenly, he recalled the familiar feeling that Little Yi had mentioned earlier and how the Nihility Devouring Flame knew the way here… Xiao Yan touched the Purifying Demonic Lotus Flame. After which, he glanced at the Nihility Devouring Flame, only to discover that the latter was looking at the last pillar with a lost expression. The feelings he showed Seeing the somewhat strange expression of the Nihility Devouring Flame, a thought that caused one’s head to become numb slowly rose from within Xiao Yan’s heart. “It is not that the Tou She Ancient God had not collected the Purifying Demonic Lotus Flame and the Nihility Devouring Flame… instead, the both of them… had fled from this place…” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1631","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
