{"id":46857,"no":223,"title":"Chapter 223: A Short Meeting","content":"Chapter 223: A Short Meeting\\n\\n After standing in the sandstorm for a long while, the black-robed person let out a soft sigh. She gradually turned around as her delicate hand slowly lifted her black-colored cloak. Immediately, that pretty and indifferent white face was exposed in the raging sandstorm.\\n\\n As her beautiful eyes watched the young man who had a brilliant smile on his face, an involuntary gentle smile surfaced on Yun Zhi’s red moist lips. She did not take those words, with an extremely lethal effect, that Xiao Yan had shouted a moment ago, to heart. It was clear to her that the words were merely a joke that the other party had said in excitement. Yet, this joke caused a gentle part in her heart to slightly stir…\\n\\n “Ugh, I was still recognized…” Yun Zhi’s delicate hand pulled aside the black hair on her forehead. She then shook the strange looking longsword and a helplessness appeared on her pretty face.\\n\\n “Hehe.” Eyeing that familiar pretty face, Xiao Yan could not help but part his mouth and laugh. He carried the Green Lotus Seat in his palm, took two steps forward and said with a smile, “It has been half a year since we last met. How are you?”\\n\\n “Ugh, quite good…” Yun Zhi pursed up her red lips. She seemed to be trying to make herself to be as indifferent as she usually was. However, each time her gaze glanced at the brilliant smile of the young man, the forceful indifference she pretended to reveal on her face would swiftly collapse. After repeating this for a few times, Yun Zhi could only sigh faintly, nodded and replied softly.\\n\\n Sweeping her gaze over Xiao Yan’s body, Yun Zhi pretty eyes brightened somewhat. After half a year’s of training, Xiao Yan body undoubtedly appeared taller and straighter. The handsome and delicate face of his also appeared darker after a roaming the desert for a few months. His facial lines that originally appeared somewhat gentle currently had a faint resolute feeling seeping out from them. Clearly, the young man had grown a lot during this half a year.\\n\\n With Yun Zhi’s identity, she had met quite a number of young outstanding individuals. Among them, there were some who were so handsome that they could cause women to throw themselves at them. Even so, she did not pay even the slightest bit of attention to them. The only man who could cause her heart to be filled with joy at his growth seemed to be this young man in front of her whom she had an extremely messy relationship with.\\n\\n “You have advanced to the Dou Shi realm?” While she was sweeping her gaze, Yun Zhi was a little surprised, but immediately felt relieved. Back then when they parted, Xiao Yan was at the peak level of a Dou Zhe. Although with Xiao Yan’s training talent, breaking through was only a matter of time, being able swiftly break through a Dou Zhe and stabilize his strength in a short half a year was something Yun Zhi did not expect.\\n\\n “Yes, I was merely lucky.” Xiao Yan smiled and nodded his head. His gaze sized up Yun Zhi. The surprise from before had already calmed down. He mused for a moment and asked with hesitation, “Why are you together with Pill-King Gu He?”\\n\\n Hearing Xiao Yan’s question, Yun Zhi was briefly at a loss. She moved her eyes as she said softly, “Pill-King Gu He has a large number of friends in the Jia Ma Empire. I am also acquainted with him and owe him a favor. This time he invited me along when he came to the desert to search for the ‘Heavenly Flame’.”\\n\\n “Oh.” Xiao Yan nodded. In his heart, he sucked his lips at the position Gu He held in the Jia Ma Empire. After which, he lowered his head and glanced at the Green Lotus Seat before saying, “Then... if you don’t bring the ‘Heavenly Flame’ back, won’t he blame you?”\\n\\n “Perhaps. But my mission is only to ensure their safety. As for other things, I don’t have too much of an obligation… Moreover he thought of you as a mysterious Dou Huang. Thus he ought to know how difficult it is to take a ‘Heavenly Flame’ from a Dou Huang. If I fail, he won’t be able to say anything. Of course, he would undoubtedly feel somewhat disappointed.” Yun Zhi sighed gently. Although she and Gu He were old friends, she was also very clear about the stubborn character of Xiao Yan. If she were to try to take the flame, this young boy would immediately turn hostile. He may have appeared to have a matureness that far surpass those of his age but on certain things, he was even more stubborn than a three year old child. He would not give up on the things he wanted even if he were to be beaten to death.\\n\\n As her delicate hand gently rubbed her somewhat painful head, Yun Zhi bitterly smiled. She sighed in her heart for having such terrible luck. It would be fine for her to meet anyone else but she had to meet this boy. If the person in front of her was someone else, even if the other party was a Dou Huang, Yun Zhi would still think of ways to steal the ‘Heavenly Flame’ away.\\n\\n Although with her strength, she would be able to take the ‘Heavenly Flame’ in the blink of an eye, Yun Zhi really had difficulty attacking this man who had a complicated relationship with her since he had once seen her almost naked body.\\n\\n “Hee hee…” Appearing to understand Yun Zhi’s frustration, Xiao Yan awkwardly smiled. He held the Green Lotus Seat close to his chest and mumbled, “I’m sorry, I have also been chasing after this thing for half a year. Even if you didn’t come to the desert, I would still have looked for Queen Medusa…”\\n\\n “But what do you want the ‘Heavenly Flame’ for? With your current strength… if you come in even the slightest contact with it, you would end up without even a corpse.” Yun Zhi gently frowned as her eyes stared on the Green Lotus Seat in Xiao Yan’s hand before she said in a puzzled voice.\\n\\n “Haha, that should be true… but I really need it.” Xiao Yan laughed before replying vaguely.\\n\\n Seeing Xiao Yan’s vague manner, Yun Zhi could only shake her head helplessly. Since he did not want to say more, she did not want to ask for more either. Immediately, she tilted her head and stared at the far distance of the desert. She said, “You should leave here first. There are two Dou Wangs from the Snake-People race who are catching up from behind. I will help you block them for a short time.”\\n\\n “What about after that? I think that you will simply leave without saying goodbye again.” Xiao Yan shrugged his shoulders and said with a smile.\\n\\n “I’m sorry. The last time, I really had some urgent things. Thus...” Hearing the little bit of resentment in Xiao Yan’s words, Yun Zhi could only softly explain. She then said, “Once I have blocked them, I will go and meet up with Gu He and the other. After all, we have already arranged to meet.”\\n\\n “Are you in such a rush?” Xiao Yan helplessly sighed. He smiled bitterly and said, “It was so difficult for us to meet, yet we must immediately part ways. I don’t know how long we have to wait before the next time we meet. People like you are always so mysterious.”\\n\\n Yun Zhi smiled gently. She eyed the young man’s face and hesitated a little. Suddenly, she asked, “Have you been training alone?”\\n\\n “Ah, yes, I guess…” Xiao Yan fondled his chin and smiling as he nodded his head. He did not expose Yao Lao.\\n\\n “Your training talent may be quite good but even the best jade needs to be meticulously carved. After all, training by yourself would lead to you to take many unnecessary routes… If you don’t mind, I can introduce a place for you. There, you would obtain the best training environment.” Yun Zhi’s beautiful eyes flashed gently as she said with a smile.\\n\\n “What place?” Xiao Yan was at a little bit of a loss. Although he did not have too much interest in going, he could not resist asking out of curiosity.\\n\\n “The Misty Cloud Sect.”\\n\\n Yun Zhi smiled and said, “The Misty Cloud Sect is extremely strong within the Jia Ma Empire. Coincidentally, I have a friend in there. If you are willing, I can…” Once her words reached this point, Yun Zhi suddenly stopped. She realized the the smiling expression on the face of the young man in front of her had suddenly turned a little ugly.\\n\\n “What happened?” Yun Zhi asked in an uncertain voice without knowing what happened.\\n\\n “Haha, forget it. What is the point of a small fly like me going to a place like the Misty Cloud Sect? If I go, I would only be seeking to be ridiculed.” Xiao Yan shook his head and said coldly.\\n\\n Eyeing Xiao Yan whose attitude had suddenly became somewhat vile, Yun Zhi gently pressed her eyebrows together and explained, “The Misty Cloud Sect is not as unbearable as you imagine. Moreover, with your training talent, who would be able to mock you? I am saying this for your own good. At the very least, you would be able to directly obtain suitable Qi Methods and Dou Techniques… and the disciples in the Misty Cloud Sect are also specially picked. Their qualities are not bad and you should be able to get along very well with them.”\\n\\n “Ugh, forget it, forget it. In any case, I don’t have a very good impression of that place. I’m quite happy training alone and don’t have the mood to go to that whatever sect.” Hearing Yun Zhi describe the Misty Cloud Sect so perfectly, a displeased emotion soared within Xiao Yan’s heart. This was especially so when he heard that the quality of the disciples there was not bad. A thread of furious flame appeared without warning in his heart: Not bad? A place which can groom a girl like Nalan Yanran. How good could it possibly be?\\n\\n With a gloomy expression, Xiao Yan let out a gentle sigh. He waved his hand impatiently and said blandly, “Alright. Don’t say any more. Since you need to find Gu He and the others, then we shall part ways here. I also have some urgent matters to attend to. Goodbye! We shall meet again if we have the opportunity. If you really don’t want to meet me again, then forget it.”\\n\\n “Thank you very much for today. If there’s an opportunity in the future, I will return you this favor…”\\n\\n After saying this, Xiao Yan did not say any other unnecessary words. He carried the Green Lotus Seat in his hand, turned around and flapped the pair of wings on his back. After which, he swiftly flew up into the air and shot toward the distance without turning back.\\n\\n Standing confused on the sand dune, Yun Zhi watched Xiao Yan who had turned into a black dot. A long while later, she bit her lips and angrily stomped her feet. A grievance that she was not resigned to surfaced on her face. She had good intentions in planning for Xiao Yan, but she did not expect him to give her such a negative response. Moreover, his hidden sarcasm in his words caused Yun Zhi to feel as though her heart had been eaten by a wolf.\\n\\n TL: Heart eaten by a wolf - In this case it means that he did not appreciate her good intentions and instead responded by hurting her (with sarcastic words)\\n\\n “Stubborn boy. Don’t go if you don’t want to. You don’t need to act this way.” Yun Zhi bit her red lips. The tip of her foot stomped on the sand dune. A ferocious force shot out and pulled out a gully of over ten meters on the sand dune.\\n\\n “Return the favor… do you think I would cherish the favor of a small Dou Shi like you?”\\n\\n After violently venting her anger, Yun Zhi’s pretty face was covered red. Her hand suddenly gripped the longsword tightly and let out a soft sigh. The emotions that were usually rarely seen on her face slowly receded. Replacing it was an coldness and indifferentness.\\n\\n Tilting her head, Yun Zhi icily watched two tiny black dots that appeared at the edge of her sight which were quickly flying over.\\n\\n “A group of sticky candy that cannot be thrown off. Do you think I won’t kill you?”\\n\\n TL: Sticky candy refers to people who stick to someone else\\n\\n The longsword in her hand pointed forward and a sharp sword force shot out of it. She stared indifferently at the two small dots that were closing in and an icy angle was lifted from the corner of her mouth. Clearly, she, who was filled with grievances and anger caused by Xiao Yan, was planning to use these people to vent her fury.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-223","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
