{"id":47017,"no":383,"title":"Chapter 383: Great Plains of the Black Region","content":"Chapter 383: Great Plains of the Black Region The ‘Black-Corner Region’, a special region that had been agglomerated and built up outside of the Jia Nan Academy due to chaos. There were many people who possessed doubts over why just outside the Jia Nan Academy, an ancient and long established academy, would possess such a chaotic region that was totally different from the atmosphere within the academy. Regardless of the reason, it was the truth that it existed. Despite numerous suppressions over the many years, the ‘Black-Corner Region’ was still expanding exponentially at a rate that caused many people to be stunned. The special property of this region’s extreme resilience caused the opposing factions, who had the intention of suppressing the expansion of this region, to feel powerless. The boundary of the ‘Black-Corner Region’ was extremely long. Moreover, after these few years of expansion, it had almost become a small country with clear borders. The only difference between it and other empires was that other empires had a leader standing right at the top, while this region was one where everyone fought for themselves. Various factions repeatedly fought and killed for their own benefit. It was so chaotic within the ‘Black-Corner Region’ that it was like a plate of loose sand. However, it was also because of this that the ‘Black-Corner Region’ was able to become increasingly stronger and larger in such a place as the middle of the continent. Otherwise it was likely that no faction would sit back and watch this special area, with shocking destructive strength, swiftly become stronger and soon pose a threat toward them. Although the ‘Black-Corner Region’ was renowned throughout the continent for its chaos, the various kinds of high class Qi Methods, Dou Techniques, Medicinal Pills, and other unique goods that flowed through here also attracted many strong people from all over the continent. After all, regardless of what happened, these few things were necessary to the point that even they were envious of. Being able to obtain an even higher class Qi Methods than the one they had been practicing would mean that they could take another step forward on the journey to becoming a strong person. This kind of temptation was undoubtedly fatal toward many strong people. Therefore, the ‘Black-Corner Region’ was like an extremely dark bottomless pit. A countless number of unique treasures flowed into that place from various channels. After that, they would be auctioned off and sold for sky high prices, causing countless people to fight for them. Due to the mysterious organization that had suddenly appeared, Xiao Yan’s originally somewhat relaxed heart had once again tensed up. Although a clear trace of him had yet to be discovered by that mysterious organization, Xiao Yan felt a coldness that prickled his back as long as he thought of how a strong person like Yao Lao had been constrained by them until he dared not randomly appear. Being spurred on by this faint coldness that had faintly shrouded his heart and spirit, Xiao Yan finally understood that the kind of laid-back, ordinary life he had been living was far too much of a luxury. Currently, there were far too many of things which he carried on his back. His father’s disappearance and the mysterious organization chasing after Yao Lao. All of these mysteries were like a fog of darkness that was hounding him, causing Xiao Yan to be afraid of sparing even a little thought about resting. If he wanted to solve the mystery, he would need very great strength. Xiao Yan was also clear that the source of his strength was not ordinary training, but was instead those mysterious ‘Heavenly Flames’ that existed between the heavens and the earth. Although this kind of action was dangerous and crazy, for Xiao Yan who possessed the ‘Flame Mantra’, it was undoubtedly the fastest shortcut for him to become a strong person. In order to quickly increase his strength and allow himself to possess the strength needed to contend with the mysterious organization when they came to look for him, he would need to obtain the ‘Fallen Heart Flame’ within the Jia Nan Academy with the greatest speed. “I am once again pressed for time. Ah.” A human figure flew past the somewhat drowsy sky in a lightning-like manner. Xiao Yan lowered his head and glanced at the trees, which were swiftly flying past below him as he muttered with a bitter smile. Ever since Yao Lao had told him about the goals and tendencies of the mysterious organization, Xiao Yan had abandoned his thought of touring all the way toward Jia Nan Academy. Instead, he directly activated his Purple Cloud Wings, and travelled with great hardship, both day and night, as he moved along the route on the map, and flew toward the ‘Black-Corner Region’. The distance between the Jia Ma Empire and the ‘Black-Corner Region’ was extremely vast. Xiao Yan needed to pass through quite a number of small countries along the way before he could even reach the border of the ‘Black-Corner Region’. If he were to cover this great distance by walking or by riding carriages, he was afraid that he really could not reach his destination without at least three to five months, or even half a year’s time. Moreover, this was on the precondition that his journey was unobstructed. After all, it was impossible for territories within these small countries to be as peaceful as they were within the Jia Ma Empire. Due to the terrain, the country\u0027s’ strength or for many other reasons, battles would usually occur in these places daily. Various mercenaries engaged in huge chaotic battles for profits. Moreover, when there came a day when they really did not have any money to spend, these mercenary companies would turn into notorious bandit troops. As long as the defensive strength of any merchants whom they met was not very strong, it was likely that their fortune, along with their women, would all be snatched away and end up in a miserable state. By using the Purple Cloud Wings in lieu of walking, Xiao Yan may have ended up exhausting a great amount of Dou Qi, were it not for the support of the ‘Energy Recovery Pills’ which he had refined earlier. Adding to that, his ‘Flame Mantra’ Qi Method had already evolved to the Middle Level Xuan Class. With the cooperation of the two, Xiao Yan barely managed to support his long distance flight. However, every two days, he needed to land on the ground, and begin an in depth training session that lasted for at least a day in order to recover his nearly numb muscles and spirit after flying for such a long time. With him rushing through the journey with all of his strength in this manner, the ‘Black-Corner Region’, which would have required at least half a year or more to reach if he were to travel at a laid back pace, was forcefully reduced by Xiao Yan by more than ten times. After flying for nearly ten days using the Purple Cloud Wings, the monotonous mountain range below Xiao Yan suddenly became much closer. He was slightly startled, and immediately lifted his head to sweep his gaze over the distant area, only to see dark, black-colored plains at the edge of his sight. It was like a black line that completely isolated the world within from the world outside. “This is the Great Plains of the ‘Black Region’?” Xiao Yan watched the black line, which was gradually becoming larger in his eyes. His face, which had been filled with fatigue and dust, suddenly become very alert. A smile like he had put down a heavy burden spread from the corner of his mouth. According to the indication of the map, this ‘Great Plains of the Black Region’ was the gateway to the ‘Black-Corner Region’. As long as one stepped into here, one would have entered that chaotic world which was out of tune with the outside world. “We have finally arrived.” Xiao Yan used great force to rub his large, black eyes. His body slowly descended. Although the ‘Black-Corner Region’ was just a short distance in front of him, he did not choose to enter it immediately. Since even Yao Lao had repeatedly emphasized to him about the chaos of this place, he felt that it would not be wise if he entered this place, where danger lurked around every corner in his exhausted condition. “You should recover first. Although it has been extremely tough rushing this journey these past ten days, you have also received a lot of benefits. The Dou Qi in your body is only becoming stronger under this kind of repeated exhaustion.” Yao Lao’s voice sounded from his heart at this moment. “Ah.” Xiao Yan nodded. He slowly landed in a mountainous forest and swiftly scouted around. When he did not discover the presence of any humans or beasts, he finally relaxed and searched for a covert place. He sat cross-legged, took out an ‘Energy Recovery Pill’, and popped it into his mouth. The seal was formed by his hands and he shut his eyes. As Xiao Yan entered his training mode, faint energy ripples began to seep out from within his body. A suction force, which was partially visible, swiftly sucked all the energy around his body into it. After which, it was refined and poured into the somewhat-dim Dou Crystal within the vortex. Its appearance was caused by his overdrawn Dou Qi. The quiet training lasted for nearly half the afternoon. Only then did the faint energy ripple around Xiao Yan’s body gradually weakened until it completely disappeared. Xiao Yan’s tightly shut eyelashes gently twitched. He immediately opened his eyes and a green-colored flame flashed across those dark eyes. He opened his mouth slightly, and a mouthful of turbid air contained some black color as it was being exhaled. The black, turbid air gradually curled upward. Any leaves which came into contact with it instantly corroded until nothing was left. The fatigue which covered Xiao Yan’s face had completely disappeared the moment he exhaled that mouthful of somewhat strange black air, Replacing it was a faint, warm, jade-like radiance. Xiao Yan lifted his head and knit his eyebrows as he watched the faint amount of rising black air. His eyes narrowed and he suddenly lowered his head to look at his middle finger. He could see that the originally long and pale finger had actually once again become as black as ink, appearing extremely strange. “Is this the ‘Searing Poison’? I thought that it had disappeared by itself. It had actually been hiding this whole time.” Seeing the black finger, which had not appeared for a long time, Xiao Yan could not help but laugh bitterly. “If this thing is resolved properly, it might be a unique attack of yours against an enemy. On the other hand, if it is not resolved properly, it will cause many problems. After all, this kind of toxin has undergone mutations and has developed a resistance to many different types of antidotes. Its destructive power is also quite shocking.” Yao Lao’s voice was somewhat serious as he spoke. Xiao Yan nodded his head helplessly. He flicked his finger. The black color swiftly paled, and a moment later, it had completely vanished. That appearance was as though it had hidden into some secret place that Xiao Yan could not detect. “If it were not because I wanted to obtain the ‘Seven Magical Green Spirit Saliva’ to help teacher’s spirit awaken, I would also not have helped that old fellow. The promises that he had made were as though he had farted. Hee hee, he is indeed a crafty person.” Xiao Yan stood up and suddenly let out a cold laughter. After he helped Nalan Jie completely expel the poison, that old fellow had an extremely grateful appearance, but what happened after that? He saw with his own eyes that Xiao Yan was being chased by the Misty Cloud Sect, who wanted to kill him, yet Nalan Jie did not make even the slightest move. “Hu, there is no need to talk about that disappointing old fellow. Teacher, should we enter the ‘Black-Corner Region’ now?” Xiao Yan shook his head. He stood at the peak of the mountain as he gazed at the black colored plain in the distance and asked. “Ah.” Yao Lao nodded his head. He immediately reminded, “Try to use your ‘Purple Cloud Wings’ as little as possible within the ‘Black-Corner Region’. A flying Dou Technique is an extremely rare item and it could be forcefully snatched by others. If you were to meet some strong person, they might become greedy and end up killing you just to steal them.” “Uh?” Xiao Yan was startled. A long while later, he smiled bitterly and said, “Looks like this damn place really is chaotic without boundaries. At the very least, the strong people within the Jia Ma Empire still have some pride. It is extremely rare for someone to attack and rob another. However, in this place, something like this is considered as routine and careless as eating at home.” “Ha ha, if this were not the case, how can the ‘Black-Corner Region’ have the qualification to be called the most chaotic region in the entire continent?” Yao Lao laughed out loud, “Alright, little fellow, let’s go. Although the inside of this place is dangerous and chaotic, the number of good things will cause one to be dazzled. Aren’t you planning to help that Hai Bodong gather the medicinal ingredients needed to refine the ‘Spiritual Recovery Purple Pill’? You can definitely find all of them here.” “It will naturally be good if that is the case.” Xiao Yan rejoiced a little upon hearing this. Xiao Yan had been bearing in mind the favor that Hai Bodong had given him in the Jia Ma Empire by using all of his strength to help him escape twice. The ‘Spiritual Recovery Purple Pill’, which Xiao Yan owed Hai Bodong, caused a knot in his heart. Currently being able obtain the medicinal ingredients caused him to sigh in relief. After arranging everything properly, with the enormous Heavy Xuan Ruler strapped to his back, Xiao Yan twisted his neck and stomped his feet on the ground. As an explosion of energy was released from under his feet, Xiao Yan’s body shot forward like an arrow which had left a bow, turning into a black shadow which dashed toward the dark black grassland. “Hei, the ‘Black-Corner Region’. I want to see just how chaotic you actually are.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-383","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
