{"id":47032,"no":398,"title":"Chapter 398: Ambush Killing","content":"Chapter 398: Ambush Killing\n A black shadow suddenly flashed into some dense bushes within the thick forest. His gaze passed through the gaps between the branches and eyed a spot under a large tree, which was only a hundred meters away. Over ten human figures were temporarily resting near that spot.\n Xiao Yan lifted his head and eyed the weather from within the dense forest. He hesitated for a moment, his breathing was so calm that there was not the slightest fluctuation. Although his target was in front of him, he was not in a hurry to strike. Besides, Fan Ling was a Dou Ling, while the two old men by his side also had strength which were around that of the Dou Ling class. Adding some other guards whose strength were quite strong, even Xiao Yan, with the help of Yao Lao, would have difficulty completely dealing with all of them within a short period of time. Therefore, he must search for the best opportunity to strike. Otherwise, it would likely be a little troublesome once he exposed himself. The strength of the Blood Sect could, after all, be considered quite strong even in the ‘Black-Corner Region’.\n Xiao Yan’s gaze was focused intently on Fan Ling’s group. The other party rested for nearly ten minutes before they finally stood up once again. Just as Xiao Yan thought that they would hurry forward continuing the route earlier, however, the group of people suddenly made a huge turn, and directly rushed toward the western side of ‘Black Mark City’.\n “Uh.” Xiao Yan was startled as he saw Fan Ling’s group suddenly change direction. His expression immediately changed slightly. Was he discovered? This thought flashed in his heart for a moment before it was automatically thrown out. The strongest person of Fan Ling’s group was a Dou Ling, so it was impossible for them to discover his Qi. Moreover, even if they discovered him, something like changing their path would not happen. After all, someone whose strength on the surface was merely that of the Da Dou Shi class was not sufficient to cause them to be this afraid.\n “What are these people planning?” A trace of doubt flashed across Xiao Yan’s heart. His toes gently pressed down on the tree branch and his body was like a bat in the night, gently gliding forward and landing on a huge tree. After which, he once again closely followed the group in front.\n The two groups of people, with one in the front and one at the back, was merely a hundred meters apart as they hurried toward the western side of the ‘Black Mark City’. After this rushing continued for twenty minutes, Yao Lao’s deep voice suddenly sounded in Xiao Yan’s heart, “Little fellow, be a little more careful. There are quite a number of strong presences hidden in the cove in front. Among them, there is one who is even quite a lot stronger than the Dou Huang’s Qi at the auction house earlier. Moreover, the Qi is as dark and cold as ice. It is very similar to the Qi of Fan Ling.”\n The body, which was charging forward, suddenly paused at these sudden words of Yao Lao. Xiao Yan’s expression changed drastically as he forcefully turned his body and hid himself behind a tree. In his heart, he said with shock, “Have we fallen into someone’s trap?”\n “It doesn’t appear so.” Yao Lao mused out loud, “From the looks of how they are hiding their presence, it appears that they are lying in wait. Do they need to spend so much effort to deal with you, who is a weak Da Dou Shi?”\n “Ambush?” Xiao Yan’s face turned grim before he sighed in relief. His brows were full of doubt as he said, “But for a strong Dou Huang to lead a large group of people to lay hidden and preparing for an ambush here… what are they trying to do?”\n Xiao Yan’s eyes flickered slightly. His gaze suddenly swept in the direction of the ‘Black Mark City’. After being stunned for a moment, he appeared to have suddenly guessed something and could not help but say in aghast within his heart, “These fellows aren’t really thinking of snatching the auctioned item, right?”\n “Well, that is very possible. The Di Class Dou Technique or that ‘Yin-Yang Mysterious Dragon Pill’, either one of these things would have the qualification to cause the Blood Sect to spend a great amount of effort to steal. Something like blocking the path and robbing is quite frequent within the ‘Black-Corner Region’.” Yao Lao was also startled when he heard this. However, he did not reject Xiao Yan’s guess.\n “Then what do we do? Fan Ling has already entered the ambushed area and seeing how it’s still calm, the ambushers are obviously people of the blood sect. Since teacher has sensed someone strong than the leader of ‘Eight Gates’ in the cove, isn’t it impossible to get that fragment of a map?” Xiao Yan knitted his brows as he said helplessly.\n “Let’s wait and see first. We will quietly watch and react accordingly.” Yao Lao said in a deep voice.\n Xiao Yan nodded slightly. His gaze swept in all directions before he suppressed his breath to its limit. He quietly flashed toward a higher area within the forest so he could have a good view.\n Xiao Yan’s body was pressed flat in this clustered thicket. The terrain supporting him coincidentally allowed him to see all of the forest depressions below. His gaze was veiled as it swept across the forest, which was so quiet that it did not have the slightest murmur. If it were not for Yao Lao voicing a warning, it was likely that Xiao Yan would have followed Fan Ling and charged into the small forest and would not have discovered this hidden ambush.\n The eastern side of this small forest cluster was a small path, which meandered all the way to the end. If one’s gaze were to move along the western side and sweep over it, one would be able to faintly see the vague outline of the ‘Black Mark City’. From the perspective of its terrain, this small forest appeared to be a road which one must pass on the western side of ‘Black Mark City’. No wonder the people from the Blood Sect chose to set up their ambush here.\n Xiao Yan’s body was like a corpse, which lay prone quietly within the thicknet. His breathing was suppressed from its normal state to the point where he inhaled once every two to three minutes. After all, there was a strong person of the Dou Huang class in the small forest below. If it were not for Yao Lao quietly helping him, Xiao Yan’s ability would be insufficient to hide under the other party’s nose this smoothly.\n After Fan Ling’s group entered the small forest, this somewhat remote region descended into an extreme silence. Even those flying birds also rustled and shivered as they shrunk their bodies in their nests because they sensed some killing intent creeping out. They did not even dare to make the slightest noise.\n The strangely quiet atmosphere shrouded this region and did not disappear for a long while.\n Xiao Yan narrowed his eyes. His entire body was basically prone on the ground. At a certain instance, his finger, which was still in contact with the ground, shook slightly. His eyes suddenly opened as he lifted his head and turned his gaze toward the small path which led to the ‘Black Mark City’. There was the faint, weak, sound of a horse neighing coming from that direction.\n “Are they about to arrive?” Xiao Yan muttered softly in his heart. His eyes had also gradually become much sharper. On the path in the distance, a group of human figures riding fast horses were rushing toward the other direction of the path as though they were chasing after the stars and moon. Yellow dust shot up to the sky along the way.\n “Creak.” Following the increasingly loud noise of horse hooves, some soft sounds of bowstrings being drawn resounded within the small forest.\n At the edge of one’s sight, the human figures riding their horses as they came forward gradually appeared. After seeing that the one leading was a woman wearing a green-colored dress, the heart of Xiao Yan, who was hiding in the thicket, could not resist leaping. He quietly spoke in his heart, “The people from the Blood Sect are indeed planning to go after the ‘Yin-Yang Mysterious Dragon Pill’. However, aren’t they afraid that the ‘Sky Serpent Mansion’ will seek revenge? Since the latter has the ability to contend for this treasure, it is likely that the strength of the ‘Sky Serpent Mansion’ is not considered weak on this continent, no?”\n “Ah, it’s still passable.” Yao Lao said faintly, “I think that the Dou Huang presence in the forest below should be the Sect Leader of the Blood Sect. Since even he has taken action, they naturally do not plan to allow the people from the ‘Sky Serpent Mansion’ to leave. As long as none of them return alive, the ‘Sky Serpent Mansion’ can only jump in fury. After all, something like killing people midway in their travels happens almost everyday in the ‘Black-Corner Region’.”\n “Not letting anyone leave? They are quite ruthless.” Xiao Yan parted his mouth when he heard this. However, he was not too surprised. If word of this kind of thing was to spread, the two factions would have to fight to the death. Moreover, this involved a treasure like the ‘Yin-Yang Mysterious Dragon Pill’. It was only natural that there would not be any room to negotiate. After all, the ‘Sky Serpent Mansion’ would definitely not let it just come to nothing after spending so much.\n Over ten human figures instantly swept past the small path. A moment later, the quiet small forest appeared in their sight.\n The one leading the ‘Sky Serpent Mansion’ was naturally that beautiful Elder Qing, whom Xiao Yan had seen on the auction grounds. After rushing quickly to this point, she lifted her head and eyed the forest in the distance. Her eyebrows were slightly knit together. Since she was able to become an Elder of the ‘Sky Serpent Mansion’, her strength and experience was naturally not what an ordinary person could compare with. She also knew the reason behind being cautious before entering every forest. Moreover, she was now carrying a valuable unique treasure like the ‘Yin-Yang Mysterious Dragon Pill’ with her. She must definitely be even more cautious on top of being careful.\n Elder Qing raised her hand and displayed a signal. Their rushing speed gradually slowed. She waved her delicate hand, and the space in front of her fluctuated slightly. Immediately, a small, emerald-colored, energy snake appeared by her side, and landed in the underbrush. It swarmed into the forest with extremely great speed,\n The small energy snake quietly slithered into the forest. Its emerald snake eyes were about to take a look around, when a rushing wind suddenly sounded. A sharp arrow was immediately and violently inserted into the snake’s head. The former struggled for a while before it turned into energy and gradually turned into nothingness.\n At the moment the small energy snake was killed, the expression of Elder Qing, who had already reached a spot not far from the forest, changed abruptly. She let out a stern cry, “Be careful! It’s an ambush!”\n “Ha ha, you are indeed worthy of being an Elder of the ‘Sky Serpent Mansion’. Your tactic of agglomerating Dou Qi into a snake was really superb.” The cry of Elder Qing had just sounded when a loud owl-like laughter was emitted from the forest at the same time. A powerful Qi suddenly rose up into the sky. A blood-red shadow shot out from the forest and steadily landed on top of a large tree. His pair of eyes, which contained a red glint and a dense dark coldness which was difficult to hide, swept toward Elder Qing’s group outside the forest.\n “Fan Lao?”\n Seeing the tall, large man who was wearing a big red robe with a color similar to fresh blood, the expression of Elder Qing changed greatly. She immediately cried out with a stern exterior, but a wavering interior, “What do you mean by this? Don’t tell me that you want to declare war on our ‘Sky Serpent Mansion’?”\n “Ha ha, I am not thinking of declaring war. However, I am interested in the ‘Yin-Yang Mysterious Dragon Pill’ in Elder Qing’s hand!” The red-robed man smiled. However, this smile had a denseness seeping out from it that was not possible to cover.\n “Pull back! Everyone leave this place by themselves. As long as one of us manage to flee, immediately report this matter to the Mansion Head!” Hearing the other party mentioning the ‘Yin-Yang Mysterious Dragon Pill’, the heart of Elder Qing suddenly fell. She knew that there was no room for discussion regarding this matter. Immediately, she did not hesitate as she let out a stern cry. Her feet immediately stepped on the back of the horse as her body was the first to turn into a shadow, which flashed toward the interior of the thicket on the side of the main road.\n “Xiu, xiu, xiu”\n The moment the people from the ‘Sky Serpent Mansion’ scattered and withdrew, a large wave of rushing wind suddenly sounded from within the forest. Countless arrows containing a cold glow and ferocious force were shot out from all directions. Under the rain of these arrows without any gaps between them, even Elder Qing could not help but slow down her speed. Her body flashed as she dodged the arrows.\n The people from the ‘Sky Serpent Mansion’, who had scattered and shot out in all directions, were actually once again forced to shrink together. At this moment, nearly a hundred Blood Sect warriors, wearing red robes and carrying blood knives in their hands, came swarming out from the dark, black forest on the four sides of the path.\n The faces of these Blood Sect warriors were wood-like, much like puppets. However, their eyes were filled with the same dense darkness and cruelty as Fan Ling.\n “Elder Qing, hand over the ‘Yin-Yang Mysterious Dragon Pill’ and I will allow you you live! Otherwise, die!”\n The body of the black robed man on the top of the tree flashed like a ghost and instantly appeared in the sky of the encirclement. His thick dark cry, reverberated in the air above the path.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-398","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
