{"id":46705,"no":71,"title":"Chapter 71: Circumstances of the Xiao Clan","content":"Chapter 71: Circumstances of the Xiao Clan\n After sitting for nearly an hour, a pretty maid finally walked in. Her two hands carried a silver tray, and in the center of the tray was a faint red ring.\n Taking the silver tray and sending back the maid, Ya Fei personally handed over the goods to Xiao Yan and smilingly said: “Old Sir, the cauldron as well as all the alchemic ingredients you need are all in the ‘Storage Ring’”.\n Extending a hand to pick up the storage ring, Xiao Yan let it roll about in his palm then faintly nodded. Yao Lao’s voice also sounded out at just the right time: “Okay. After refining the Qi Gathering Pill, I will bring it to you.”\n Ya Fei’s pretty eyes were filled with delight as shei hastily nodded.\n “Alright, there’s no need for you to send me out. I’ll go out by myself.”\n Waving his hand, Xiao Yan took the ring and slid it onto his finger. Then, without even turning back, he headed towards the back of the parlor and went out. On the table, the blue jade card was still there as he did not want to owe the people too much. Thus, he had just left it there.\n Staring at the receding figure leaving through the door, Ya Fei nibbled her red lips, then stepped forward to take the blue jade card into her hand. Musing a bit, she asked in a clear voice: “Uncle Gu Ni, to refine a Qi Gathering Pill, the success rate is not that high right?”\n “Yes. It’s said that even Pill King Wang Gu He’s success rate for refining Qi Gathering Pills is only around 7 out of 10. For normal fourth tier alchemists, the success rate is only around 5 out of 10,” Gu Ni said in a low voice.\n “But this old sir, he succeeds in refining on the first try……” Ya Fei said as she knitted her thin black brows.\n “Who knows, maybe his luck is good……” Gu Ni shook his head and didn’t care too much about the matter. After all, for alchemists, luck was a big factor in successfully refining pills. If one’s luck was good, even when continuously refining several times, one would not fail.\n “Could it be…… that he’s not just a fourth tier alchemist?” Ya Fei asked with hesitation after pondering a bit.\n “Haha, how is that possible. The number of fifth tier alchemists in Jia Ma Empire can be counted on one’s hands. At that sort of status, even if it was the empire or great forces like the Misty Cloud Faction, they would all view this person as a VIP. Why would such a person come to our own auction house to auction pills.” Gu Ni laughed.\n At this, Ya Fei also slightly nodded her head and let out a sigh, bitterly laughing: “It seems that I don’t have enough experience. I’m afraid that my previous hesitation negatively impacted this mysterious alchemist’s favorable impression of us by a large amount.”\n “You can’t blame yourself for this. That kind of huge transaction, even I wouldn’t dare to answer easily. That you are capable to this extent is already very good. In regards to our relations with that alchemist, in the future, just take your time and get along amiably. As long as he does not develop any sort of ill will towards us then it’s fine.” Gu Ni said comfortingly.\n Forcing a smile to her face as she nodded, Ya Fei sat lethargically on the chair, revealing her figure. As her lovely eyes blinked, having some doubts, she softly asked: “What does he intend to do with so many low-grade medicine ingredients?”\n “Those medicine ingredients have the effect of stopping bleeding and strengthening bones. I think he should be planning to manufacture healing medicine.” Gu Ni muttered as his eyebrows pursed together. Similarly puzzled he said: “But with his status, why would he manufacture these cheaply-priced healing medicine?”\n Hearing this, Ya Fe’s beautiful eyes slightly narrowed, her long fingernails lightly tapped on the table. A moment later, realization dawned upon her, she softly said: “Looks like this old sir seems to be very caring towards the Xiao Clan……”\n Eyebrows wrinkled tightly together, Gu Ni’s expression suddenly changed into one of amazement: “Are you saying that he wants to give the Xiao Clan healing medicine?”\n “Recently I’ve heard that the Jia Lie Clan had invited over a first tier Alchemist. The cheap “Return of Spring Powder” has already snatched away half of the city’s crowds, if the Xiao Clan does not act soon, I’m afraid that their marketplaces will end up embarrassingly empty.” Ya Fei eyes darted around as she voiced out her conclusion, smugly smiling she continued to explain: “Previously, the old sir had already said that if there was a chance, he would co operate with the Xiao Clan and buying so many healing ingredients at this time could only mean one thing: he meant what he said.”\n “Heh, looks like the Xiao Clan has really lucked out this time, while the Jia Lie Clan is going to be in trouble.” Having listened to Ya Fei’s analysis, Gu Ni grinned. An envious look was on his face since obtaining the help of a fourth tier Alchemist was not something just any clan could receive.\n Slightly inclining her head, Ya Fei gave an easy smile as she said: “We should also make some contact with the Xiao Clan soon, though adding a flower to a bracelet will make one somewhat happy, providing help when one needs it the most is a much better way of strengthening both parties ties.”\n Gu Ni approvingly nodded his head, with a fourth tier Alchemist behind them, ties with the Xiao Clan were now important.\n ……\n Exiting the auction house, as usual, Xiao Yan prudently turned round and round the streets for at least half a day before finally taking off his disguise in a desolate alley.\n Tossing and catching the light red “Storage Ring” in his hand, Xiao Yan was somewhat happy. This kind of Storage Ring was made by a type of uncommon material called “Storage Stone”. The characteristic of this material was that there was a unique small space within it where any lifeless objects could be stored. Though this was extremely convenient, due to the sparsity of the “Storage Stone”, its was extremely precious. The lowest grade “Storage Ring” in Xiao Yan’s hands only had a space of about three to four square metres, yet it costs almost 100,000 gold. In the Xiao Clan, Xiao Yan had only seen his father and the first Elder own Storage Rings.\n Xiao Yan fiddled with the Storage Ring for a while, hesitatingly examining it. In the end he did not wear it but rather carefully stored it in his bosom. This kind of ring was considerably pricey, if it was seen by his father or others, he would have a hard time explaining how he came to obtain it.\n Xiao Yan kicked the black mantle into the gutter before carefully walking out of the desolate alley. Afterwards he quickly dashed back to his clan.\n As Xiao Yan followed the lane that passed through the clan home, he heard his father’s furious voice from Meeting Room. Eyelids twitching, Xiao Yan moved forward to secretly peer through a crack in the door.\n “Dammit, Jia Lie Bi that bastard is too much, he actually dared to brazenly steal our business!” Within the room, Xiao Zhan was currently raging as he pounded on the table. Tea from the teacups spilled all over the table.\n “Presently, the marketplaces of the Xiao Clan had already lost a great amount of traffic. The merchants left in the marketplace are also very worried and frightened. A few of them have even secretly left for the Jia Lie Clan’s marketplaces. If this continues, in another half a month I am afraid that……. our marketplace will go bankrupt.” The second Elder said with a gloomy face as he gnashed his teeth together in fury.\n “How about…… I bring a few of our clan’s elites and secretly deal with that alchemist?” The third elder’s gaze were ferocious as he suggested this in a dark tone.\n “There are at least two Da Dou Shi protecting the Alchemist, it won’t be so easy.” Xiao Zhan helplessly said as he moved his hands to and fro.\n “But if we continue in this manner, our losses will be too great. The profits from the marketplaces of Wu Tan City is a large part of the total revenue of our Xiao Clan.” The Third Elder was somewhat unwilling to back down.\n The corners of Xiao Zhan’s mouth twitched. At the moment, he could not think of any good ideas.\n “That day at the auction, didn’t that mysterious alchemist say that there might come an opportunity where he would work with us? Seeing how Gu Ni was so respectful towards him, his tier as an alchemist is definitely not low. If he could help us, then that Jia Lie Clan would definitely lose out.” The First Elder, who had been silent up until now, suddenly spoke up in a soft voice.\n “Ai, who knows if he just randomly blabbered. For people of that kind of status, what kind of benefits would they get out of cooperating with us? For such little profit, would they even care?” Xiao Zhan laughed bitterly and shook his head as he sat on the chair and sighed.\n The three elders were all silent as well. Indeed, it was a bit challenging for the Xiao Clan to establish connections with people of such status.\n “F**k. We’ll bear it for a few more days. If the Jia Lie Clan still does not practice restraint then don’t blame us for retaliating no matter the costs!” Licking his lips, Xiao Zhan gripped onto the chair frame as an ominous glint flashed across his eyes.\n Outside the door, listening up till here, Xiao Yan faintly shrugged his shoulders as his hand played with the storage ring at his chest. Letting out a cold smirk, he slowly left.\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-71","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
