{"id":47411,"no":777,"title":"Chapter 777: Provocation","content":"Chapter 777: Provocation\\n\\n When Xiao Yan lifted his head after his voice sounded, he only saw a couple of shocked faces. He could not help but be stunned as he carefully asked, “What is it? Can it not be done?”\\n\\n “Ugh… no, no. Yes, yes. Of course it can be done.”\\n\\n The First Elder hurriedly responded when she heard his questions. Her eyes revealed a wild joy that was difficult to hide. She did not expect Xiao Yan to be willing to spend so much effort to refine the highest grade ‘Heaven Soul Blood Bone Pill’. Being an Elder of the Snake-People Tribe, she naturally best understood the difficulty of refining this kind of medicinal pill and the risks that one must endure.\\n\\n The expressions of the other three Elders, who were staring at Xiao Yan with dark and cold gazes earlier, immediately became gentle. They faintly nodded. Although this person was a human, he was at the very least not hateful.\\n\\n The coldness in Medusa’s eyes also swiftly disappeared. Her eyes revealed a gentleness that had never existed before as she looked at Xiao Yan. Of course, this merely lasted for an instant before it was once again hidden.\\n\\n “Ke ke, chief Xiao Yan, it is naturally not a problem if you want to refine the ‘Heaven Soul Blood Bone Pill’. I will hand the medicinal formula for it to you later. However, this is a tier 7 medicinal pill. It is extremely difficult to refine. Moreover, it is also accompanied by a lightning calamity with quite the risk…” The First Elder smiled as she studied Xiao Yan while she spoke.\\n\\n Xiao Yan mused for a moment before speaking slowly, “With my current pill refining level, refining this ‘Heaven Soul Blood Bone Pill’ might have an extremely high failure rate. However, if I am given enough time, I should be able to successfully refine it. That’s right…” Xiao Yan’s gaze lingered over Medusa when he spoke until this point. He dryly laughed, “May I know what the most suitable time is?”\\n\\n “Currently, the slight life force within the tribe leader’s body is extremely weak. Clearly, it has just been formed for a short while. If this is a sign of pregnancy, we must begin the Secret Technique nourishment within two years at the very most. Hence, chief Xiao Yan must refine a ‘Heaven Soul Blood Bone Pill’ within these two years.” The First Elder hesitated a little before speaking.\\n\\n “Within two years huh…” Xiao Yan mused for a moment before immediately nodding. He said in a deep voice, “First Elder, you can rest assured that Xiao Yan will hand over the ‘Heaven Soul Blood Bone Pill’ within two years!”\\n\\n It was just as the First Elder had said. Regardless of whether Medusa was really pregnant, they ought to make all the necessary preparations. Although Xiao Yan did not have any thoughts of being a father, the baby was still a bloodline of the Xiao clan no matter how one put it. He must naturally give the baby the best.\\n\\n The First Elder’s face immediately became extremely joyous when she heard Xiao Yan’s guarantee. She grinned and nodded as she said, “The old me is also reassured with this agreement by chief Xiao Yan. If the matter turns out to be true, our Snake-People Tribe might well produce an unprecedented extremely powerful person.”\\n\\n Xiao Yan dryly laughed. Other than accompany them in laughing, there did not appear to be anything else he could do regarding this matter.\\n\\n The four Elders’ attitude toward Xiao Yan had clearly become much warmer after they finished discussing the main issue. They smiled and chatted with him for a moment before handing the medicinal formula to refine the ‘Heaven Soul Blood Bone Pill’ to Xiao Yan. After which, they waved their hands and sent Medusa and him out.\\n\\n The two people walked out of the bamboo house and walked on the quiet small path for a moment. Then, Xiao Yan turned around to look at Medusa whose eyes were looking straight ahead. However, her face contained a slight flush. He laughed bitterly and said, “This…”\\n\\n “Relax, if this matter turns out to be true, you only need to do as the Elder requested and refine a ‘Heaven Soul Blood Bone Pill’. You need not be concern about the rest…” Medusa glanced at him and spoke in a calm manner, appearing to have sensed Xiao Yan’s complicated emotions.\\n\\n Xiao Yan was vexed as he shook his head. For the moment, he had still yet to recover from this great shock.\\n\\n “I know some of your issues. Therefore, you need not be worried that this Queen will pester you. I don’t have that interest either. Once you successfully refine the ‘Heaven Soul Blood Bone Pill’ in the future, you can go anywhere you like. No one will stop you. If this is really the new Medusa bloodline, the Snake-People Tribe and I will do our best to groom her.” Medusa looked at her delicate, fine waist as she faintly spoke.\\n\\n Xiao Yan frowned when he heard this. Why was it that these words made him appear like a fickle and irresponsible person? However, if he were to think about it in detail, he could only bitterly smile and sigh. The relationship between him and Medusa was complicated. Their feelings for each other could not be compared with that of he and Xun Er. However, after that matter underground, he could not simply ignore Medusa. This was especially after such a thing had happened, causing his relationship with Medusa to become increasingly more profound.\\n\\n Of course, he was similarly aware that Medusa might feel some emotions for him that were difficult to describe. The source of these feelings came from the matter underground. After all, no matter how ruthless Medusa was, she was still a woman. She also greatly valued something like losing her virginity. Back then, if the ‘Heaven Swallowing Python’ had not caused trouble, it was likely that she would have killed Xiao Yan. As time flowed by, the influence of the ‘Heaven Swallowing Python’ might have weakened. At the same time, the resistance and killing intent she felt for Xiao Yan within her heart had also gradually dwindled after they had been together for more time. By now, it was likely that her heart had seldom formed those thoughts from back then.\\n\\n “I shall see you until this point. You can send someone to inform me when you plan to go and assassinate Yan Luo Tian and the three Mulan Elders.” Medusa’s footsteps suddenly paused. She spoke in a faint voice while Xiao Yan was forming a long face.\\n\\n Xiao Yan was startled when he heard this. He had just heard these words when he saw that Medusa had already turned around. He could only helplessly shake his head. Looks like his expression earlier had caused her to be somewhat unhappy.\\n\\n “Ugh, women…”\\n\\n Xiao Yan stood on the small path as he looked at the graceful moving figure that had become distant. He let out a bitter laugh and could only walk out of the compound by himself.\\n\\n Xiao Yan slowly walked out. He headed toward the front yard as though there was no one around him. He ignored the many curious gazes around him as he left.\\n\\n “That fellow, halt!”\\n\\n Xiao Yan was traveling through the outer yard when a loud cry sounded. A couple of strong-looking figures flashed and appeared in front of Xiao Yan. The latter raised his head and knit his brows. He studied the two male Snake-People who had appeared in front of him. One of them was that Mo Ba Si who had launched a sneak attack against him earlier. Beside him stood a cold stern-looking male Snake-Person. By observing his aura, he was actually an elite Dou Huang. However, he should only be around two or three stars.\\n\\n “Big brother Hei Du, he is Xiao Yan, that person whom the few Elders mentioned to possibly be the tribe leader’s husband…” Mo Ba Si stared viciously at Xiao Yan before immediately informing the cold stern Snake-Person by his side.\\n\\n The Snake-Person who was called Mo Du nodded his head. His triangular-shaped eyes locked onto Xiao Yan as he spoke in a deep voice, “Human, I am the second commander of the Snake-People Tribe, Hei Du. Although our Snake-People Tribe has already agreed to form an alliance with you, it is best that you keep a distance from our tribe leader. Otherwise, the one who will be unlucky will be you. Our Snake-People Race will not have any relationships with other races.”\\n\\n Xiao Yan narrowed his eyes. He had already felt somewhat irritated by these people repeated provocation. Hence, a faint cold glint flashed through his eyes. At this moment, his heart was already feeling extremely chaotic. If these people added fuel to the flames, Xiao Yan did not guarantee that he would not get them to lie on this place.\\n\\n There were quite a number of experts from the Snake-People Tribe currently in this outer yard. When they saw that Mo Ba Si had actually found Hei Du as his helper, they began to crowd around this place with great interest. With the positions of these two people in the tribe, they were naturally aware that the relationship between Xiao Yan and Medusa was a little different.\\n\\n “Move aside.”\\n\\n Xiao Yan raised his eyes as he spoke in a faint voice when he sensed an increasing number of gazes focusing onto him.\\n\\n A fierce glint flashed in Hei Du’s triangular eyes as he spoke in a deep voice, “Hopefully, I will not see you here again next time.”\\n\\n Xiao Yan raised his brows. He had finally lost his last thread of patience. His feet shifted gently before appearing in front of Hei Du and Mo Ba Si a moment later. Xiao Yan was unconcerned about these two people who seemed like metal meat shields. His feet moved and gently collided with them.\\n\\n “Bang!”\\n\\n The seemingly gentle collision erupted in a muffled sound. Hei Du’s and Mo Ba Si’s bodies were immediately forced back in front of the many surrounding stunned gazes, appearing as though they had suffered a heavy blow. Hei Du was still alright. He had merely took a couple of steps back before stabilizing his body. On the other hand, Mo Ba Si actually fell onto his butt after having taken more than ten steps back. His face was also suddenly flushed red.\\n\\n Hei Du’s face also became unusually solemn after stabilizing his body. Although this person appeared as though he had just entered the Dou Huang class, it was really unexpected that he possessed such a frightening strength.\\n\\n Most of the experts in the Snake-People Tribe were scattered to defend the remaining cities when the big battle had begun. Hence, some people were uncertain about the the soul-stirring battle that occurred in the Black Mountain Fortress back then. Coincidentally, this second commander, who was called Hei Du, had just returned from elsewhere today. Therefore, he was not too familiar with Xiao Yan, and only felt that this name was quite familiar.\\n\\n A fierce glint flashed across Hei Du’s eyes as he watched Xiao Yan’s footsteps continue to head toward the door of the yard after having forced back the two of them. He let out a sudden cry and powerful Dou Qi suddenly surged out from his body. His powerful aura also spread out, causing the surrounding observing Snake-People experts to hurriedly withdraw.\\n\\n Xiao Yan’s gaze was indifferent as he looked at Hei Du, who had unleashed his Dou Qi. The corner of his mouth was lifted into a cold smile. A jade-green flame slowly rose from his body.\\n\\n “Chi!”\\n\\n The rushing sound of wind suddenly sounded just as Xiao Yan was circulating the Glazed Lotus Heart Flame. A green shadow immediately flashed across the sky. It finally smashed into Hei Du’s chest in a lightning-like manner. The latter let out a muffled groan before his spreading Dou Qi quickly disappeared.\\n\\n The green shadow slowly landed on the ground after that attack, transforming into a green branch.\\n\\n Xiao Yan was slightly startled as he looked at this branch. Who else within the Snake-People Tribe but Medusa could use a tree branch to force back an elite Dou Huang?\\n\\n “Mo Ba Si, Hei Du, the both of you seem to be continuously slighting this Queen recently!” An icy-cold cry was swiftly transmitted over, causing the faces of Hei Du and Mo Ba Si to change. They hurriedly bowed down on the ground. They were able to hear a slight fury in Medusa’s words.\\n\\n “Xiao Yan is a VIP of our Snake-People Tribe. If anyone dares to purposefully make things difficult for him, do not blame this Queen for serving you the tribe rules!”\\n\\n The experts of the Snake-People Tribe who were present looked at each other when they heard Medusa’s words. No one expected that she would actually be so protective of Xiao Yan. Was what the Elders said the truth?\\n\\n Quite a number of male Snake-People threw envious and jealous gazes toward Xiao Yan when they thought of this. Medusa was an inviolable female deity in the hearts of many people within the Snake-People Tribe. However, it was unexpected that the female deity in their hearts would actually become so furious because of a human. This really caused them to feel some jealousy.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-777","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?\\n","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
