{"id":47496,"no":862,"title":"Chapter 862: Situational Change","content":"Chapter 862: Situational Change Xiao Yan was momentarily unable to recover as he stared at the jade box that had landed in his hand. He had randomly moved earlier and did not expect this thing to land in his hand so easily… After being absent-minded for a moment, Xiao Yan swiftly recovered and opened the jade box in a lightning-like manner. Immediately, he saw the slowly wiggling emerald-colored Bodhisattva Body Transformation Saliva which was suspended within the jade box. “It is actually real?” Xiao Yan’s gaze was dull as he stared at the Bodhisattva Body Transformation Saliva. Other than Old Ying Shan, the faces of almost everyone stiffened. No one had expected Old Ying Shan to actually hand over the thing this easily given his character. However, the truth that had appeared in front of them caused the faces of quite a number of people to become fiery hot. “Hei, serves you right. Now that the thing is not with the old me, I shall see just who dares to block me.” Old Ying Shan merely mocked with a cold laugh when he saw everyone’s dull expressions. “Dammit, you old fellow who will not die. That Bodhisattva Body Transformation Saliva clearly has the seal that I had placed!” Mo Tian Xing was the first to recover and he immediately cried out furiously. When Old Ying Shan had thrown the jade box earlier, he had used a slight Dou Qi imprint to scan it. However, there was not the slightest response. It was because of this that he did not act at that moment. Unexpectedly.. the jade box really did have the Bodhisattva Body Transformation Saliva. “When you mentioned that you had done something to the Bodhisattva Body Transformation Saliva, the old me quietly removed it. Don’t tell me that you expected the old me to suffer from the same loss twice?” Old Ying Shan curled his mouth and ridiculed. His gaze immediately took one glance around this battleground and laughed in a strange manner, “Do all of you still wish to fight now that the thing is already no longer with the old me? If that is the case, the old me will accompany all of you.” Everyone’s gazes had basically turned to Xiao Yan in an instant after Old Ying Shan’s words sounded. Other than the Little Fairy Doctor and Su Qian, the remaining eyes were filled with a denseness. “Xiao Yan check it. Do not allow this old fellow to switch it with a fake!” Su Qian’s eyes slightly narrowed as he looked at the situation. If the Bodhisattva Body Transformation Saliva was real, it was not impossible for them to retain it with their current advantage. If it was a fake, they would not only end up taking the blame for Old Ying Shan, but would also end up doing so for nothing. That would really not be worthwhile. Xiao Yan also nodded after hearing Su Qian’s words. His gaze cautiously swept around him before he swiftly checked the Bodhisattva Body Transformation Saliva. A joy slowly surged out from deep within his eyes. Finally, he turned his head and lowered his chin to Su Qian. “Chi!” Han Feng’s body suddenly moved the moment Xiao Yan’s chin moved. He transformed into a black shadow that rushed at Xiao Yan in a lightning-like manner. “Hmph!” Han Feng’’s body had just moved when Xiao Yan, who had constantly remained cautious of his surroundings, let out a cold snort. A glaring silver glow surged from both of his legs as his body shook. An afterimage remained while his body appeared over a hundred meters away. Two human figures appeared beside Xiao Yan the moment his body appeared, guarding his back as they did so. A moments later, Zi Yan also flew over. The four of them clustered together and looked at the many experts in the col who were looking at them maliciously. “Stop them!” Han Feng’s expression was gloomy as he waved his hand. The experts from the Demon Flame Valley immediately leaped into the air and swiftly approached Xiao Yan’s group. After hesitating for a moment, Mo Tian Xing by the side also let out a cold laugh as he led the experts from the Black Emperor Sect to surround Xiao Yan’s group from the other side. Old Ying Shan smiled in a dark and cold manner as he saw the target being rapidly switched from him to someone else. However, he did not move. Instead, he merely suspended himself in the sky, looking as though he was watching a good show. From his manner, it seemed that he did not intend to intervene. A denseness flashed across Xiao Yan’s eyes when he saw Han Feng, Mo Tian Xing, and the others approaching. He immediately laughed with a faint voice, “Does sect leader Mo really plan to attack us? If you can choose to be an observer for once, Xiao Yan would definitely deliver the Zong Breaking Pill. What do you say?” Mo Tian Xing was startled when he heard Xiao Yan’s words. He seemed to have become a little interested. Although there were few people in Xiao Yan’s group, all of them were quite strong. Even if the Demon Flame Valley and the Black Emperor Sect were to join hands, it would be quite difficult to suppress them. “Sect leader Mo, Don’t fall for this brat’s curve ball. He is extremely crafty. Once they finish us off and free their hands, do you think that you can do anything to them given their two elite Dou Zong advantage?” Han Feng suddenly and coldly laughed while Mo Tian Xing was deep in thought. Mo Tian Xing’s expression changed slightly when he heard this. What Han Feng had said was indeed true. The reason why Xiao Yan was currently this afraid was that both Han Feng and himself were elite Dou Zongs. If they were to stand aside and simply watch Han Feng’s group be defeated at this moment, his ending would also not be anywhere good. He did not believe that Xiao Yan would easily hand over a valuable medicinal pill like the Zong Breaking Pill given the latter’s craftiness… “If sect leader Mo does not trust me, Xiao Yan can hand over the medicinal pill on the spot. What do you say?” Xiao Yan appeared to have understood Mo Tian Xing’s worry as he laughingly said. Mo Tian Xing was startled. An interest surged on his face. When he was about to speak, Han Feng knit his brows tightly and his mouth moved. A soft voice that was wrapped with Dou Qi was quietly transmitted into the former’s ears. The suddenly transmitted voice caused Mo Tian Xing to immediately shut his mouth that was about to be opened. His eyes glanced to Han Feng with joyous surprise as he asked, “Really?” “If sect leader Mo thinks that this guarantee is attractive enough, we might perhaps be able to give it a try… moreover, the Demon Flame Valley is also considered an old faction within the ‘Black-Corner Region.’ If Han Feng wishes to act shamelessly after this, sect leader can come to the Demon Flame Valley and demand a recourse.” Han Feng laughed. Mo Tian Xing hesitated for a moment upon hearing this. He immediately clenched his teeth and said, “Alright. I will trust you once. Hopefully, you will not fool me after this is over. Otherwise…” “Sect leader Mo, can rest assured that it is extremely difficult to obtain this thing by just relying on my strength. With your help, our chances will significantly increase.” Mo Tian Xing slightly nodded. His gaze turned to Xiao Yan as hd laughed, “Mister Xiao Yan, looks like I can only apologize. The Zong Breaking Pill does not have the attraction on a level of what Han Feng has offered.” Xiao Yan narrowed his eyes and laughed faintly, “If sect leader Mo thinks that a person who has once betrayed his teacher is worthy of being trusted, there is nothing else that Xiao Yan can say.” “The temptation is worth the risk.” Mo Tian Xing licked his lips as he spoke with somewhat heated eyes. Xiao Yan ceased saying anything more when he heard this. He did not know what Han Feng had promised Mo Tian Xing, but for the latter to ignore the Zong Breaking Pill, it was likely that the temptation was extremely shocking. In that case… “Let’s prepare for a big battle next. If we were to really engage in an all out fight, no one will know just who will die in the other person’s hands!” Xiao Yan inhaled a deep breath. A heated expression suddenly surged into his dark-black eyes as he spoke with a deep voice. Su Qian, the Little Fairy Doctor, and Zi Yan faintly nodded. Although the other side had many people, the fighting strength of their side was much stronger… “Hee hee…” Han Feng let out a pleased laugh when he saw that he had successfully pulled Mo Tian Xing over to his side. However, he did not stop after this. His gaze turned and paused on Old Ying Shan who was remaining in the air above the col and watching the show. If he was able to pull this old fellow to his side in this kind of situation, he would be able to gain an absolute advantage. Three elite Dou Zongs along with the remaining experts from two large factions would be sufficient to completely suppress Xiao Yan’s four man group until they ceased to have any ability to retaliate. However, that Old Ying Shan appeared to know just what Han Feng was about to say when he saw the latter looking over. He immediately let out a strange laugh and said, “You can forget about roping in the old me. It is best for me not to get involved in such a situation. If you wish to fight, you can just go all out and fight… the old me shall not accompany all of you. Tsk tsk.” Old Ying Shan actually turned around after saying these words. After which, he rushed into the deep mountains in front of everyone’s stunned gazes and disappeared. Han Feng immediately knit his brows intently as he watched Old Ying Shan, who had simply turned around and left. He immediately let out a cold snort and cursed, “A cowardly old fellow…” Xiao Yan’s eyes also watched the spot where Old Ying Shan had disappeared from and could not resist frowning a little. He exchanged gazes with Su Qian and the others, indicating that he felt something was wrong. Given the great value of the Bodhisattva Body Transformation Saliva, how would this old fellow simply give up this easily? “Be careful, this old fellow is extremely cunning. Such an unusual act is abnormal…” Su Qian suppressed his voice and cautiously spoke. “Don’t tell me that he intends to watch the fierce battle between the tigers and appear after both parties are seriously injured?” The Little Fairy Doctor’s thin eyebrows were pressed together as she voiced her thoughts. Xiao Yan shook his head a little and said, “No idea. However, this is not the time to consider all this. Let’s finish off these fellows before discussing it. The Bodhisattva Body Transformation Saliva is already in our hands. They will definitely not give it up.” Su Qian and the two others nodded when they heard this. He said, “If we wait a little longer, the experts from ‘Xiao Gate’ and the Jia Nan Academy will also make it over. At that time, we will have a slightly easier time.” The rushing sound of wind was suddenly transmitted from the horizon after Su Qian’s voice sounded. Immediately, a large group of human figures appeared in Xiao Yan’s group’s line of sight. “Are they finally here…” Xiao Yan’s group sighed in relief as they sensed the familiar aura. Although they were not afraid of the large number of people on the opposite side, there would be some trouble if they were interrupted amid an intense battle. Now that the experts on their side had rushed over, both sides could be considered to be even. “Hmph, they are just a useless mob. Are you still intending to rely on them?” The large group of human figures flying over also attracted Han Feng’s attention. He immediately let out a cold laugh as he suddenly waved his hand. A voice that was filled with a dark and cold killing intent resounded over the sky. “Sect leader Mo and I will block the woman and Su Qian. Fang Yan, you will lead a couple of experts from the Demon Flame Valley to capture Xiao Yan! It doesn’t matter whether the later is dead or alive as long as you obtain the Bodhisattva Body Transformation Saliva!” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-862","bookId":1497,"book":{"id":1497,"title":"Battle Through the Heavens","description":"In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?","cover":"http://cunovel.com/img/BTTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/battle-through-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:10 AM"}}
