{"id":62613,"no":23,"title":"Page 23","content":"\"...FLIGHT TWO, The Golden Argosy, for Rome. The flight is now ready for boarding. All passengers holding confirmed reservations...\"\n An airport flight departure announcement meant diverse things to those who heard it. To some, it was a routine summons, a prefix to another tedious, work-oriented journey which---had free choice been theirs---they would not have made. For others, a flight announcement spelled a beginning of adventure; for others still, the nearing of an end---the journey home. For some it entailed sadness and parting; for others, in counterpoint, the prospect of reunion and joy. Some who heard flight announcements heard them always for other people. Their friends or relatives were travelers; as to themselves, the names of destinations were wistful not-quite-glimpses of faraway places they would never see. A handful heard flight announcements with fear; few heard them with indifference. They were a signal that a process of departure had begun. An airplane was ready; there was time to board, but no time to be tardy; only rarely did airliners wait for individuals. In a short time the airplane would enter man\u0027s unnatural element, the skies; and because it was unnatural there had always been, and would forever remain, a component of adventure and romance.\n There was nothing romantic about the mechanics of a flight announcement. It originated in a machine which in many ways resembled a juke box, except that push buttons instead of coins were required to actuate it. The push buttons were on a console in Flight Information Control---a miniature control tower (each airline had its own F.I.C. or equivalent)---located above the departure concourse. A woman clerk pushed the buttons in appropriate sequence; after that the machinery took over.\n Almost all flight announcements---the exceptions were those for special situations---were pre-recorded on cartridge tapes. Although, to the ear, each announcement seemed complete in itself, it never was, for it consisted of three separate recordings. The first recording named the airline and flight; the second described the loading situation, whether preliminary, boarding, or final; the third recording specified gate number and concourse. Since the three recordings followed one another without a pause, they sounded---as they were intended to---continuous.\n People who disliked quasi-human automation were sometimes cheered when flight announcement machines went wrong. OccasionaHy part of the machinery would jam, with such results as passengers for half a dozen flights being misdirected to the same gate. The resultant debacle, involving a thousand or more confused, impatient passengers, was an airline agent\u0027s nightmare.\n Tonight, for Flight Two, the machinery worked.\n \"...passengers holding confirmed reservations please proceed to pate forty-seven, the Blue Concourse \u0027D\u0027.\"\n BY NOW, thousands in the terminal had heard the announcement of Flight Two. Some who heard were more concerned than others. A few, not yet concerned, would be, before the night was done.\n More than a hundred and fifty Flight Two passengers heard the announcement. Those who had checked in, but had not reached gate forty-seven, hastened toward it, a few recent arrivals still knocking snow from their clothing as they went.\n SENIOR STEWARDESS Gwen Meighen was pre-boarding several families with small children when the announcement echoed down the boarding walkway. She used the flight deck interphone to notify Captain Anson Harris, and prepared herself for an influx of passengers within the next few minutes. Ahead of the passengers, Captain Vernon Demerest ducked aboard and hurried forward, closing the flight deck door behind him.\n Anson Harris, working with Second Officer Cy Jordan, had already begun the pre-flight check.\n \"Okay,\" Demerest said. He slipped into the first officer\u0027s right-hand seat, and took the check list clipboard. Jordan returned to his regular seat behind the other two.\n MEL BAKERSFELD, still in the central concourse, heard the announcement and remembered that The Golden Argosy was Vernon Demerest\u0027s flight. Mel genuinely regretted that once again an opportunity to end, or even lessen, the hostility between himself and his brotber-in-law had ended in failure. Now, their personal relationship was---if possible---worse than before. Mel wondered how much of the blame was his own; some, certainly, because Vernon seemed to have a knack for probing out the worst in Mel, but Mel honestly believed that most of their quarrel was of Vernon\u0027s making. Part of the trouble was that Vernon saw himself as a superior being, and resented it when others didn\u0027t. A good many pilots whom Mel knew---especially captains---felt that way about themselves.\n Mel still seethed when he remembered Vernon, after the airport commissioners\u0027 meeting, asserting that people like Mel were \"ground-bound, desk-tied, with penguins\u0027 minds.\" As if flying an airplane, Mel thought, were something so damned extra-special compared with other occupations!\n Just the same, Mel wished that tonight for a few hours he was a pilot once again, and was about to leave---as Vernon was leaving---on a flight for Rome. He remembered what Vernon had said about enjoying Italian sunshine tomorrow. Mel could do with a little of that, a little less, at this moment, of aviation\u0027s logistics of the ground. Tonight the surly bonds of earth seemed surlier than usual.\n POLICE LIEUTENANT Ned Ordway, who had left Mel Bakersfeld a few minutes earlier, heard the announcement of Flight Two through the opened doorway of a small security office just off the main concourse. Ordway was in the office receiving a telephoned report from his desk sergeant at airport police headquarters. According to a radio message from a patrol car, a heavy influx of private automobiles, crammed with people, was coming into the parking lots, which were having difficulty accommodating them. Inquiries had revealed that most of the cars\u0027 occupants were from Meadowood community---members of the anti-noise demonstration which Lieutenant Ordway had already heard about. As per the lieutenant\u0027s orders, the desk sergeant said, police reinforcements were on their way to the terminal.\n A FEW HUNDRED feet from Lieutenant Ordway, in a passenger waiting area, the little old lady from San Diego, Mrs. Ada Quonsett, paused in her conversation with young Peter Coakley of Trans America, while both listened to the announcement of Flight Two.\n They were seated, side by side, on one of a series of black, leather padded benches. Mrs. Quonsett had been describing the virtues of her late husband in the same kind of terms which Queen Victoria must have used when speaking of Prince Albert. \"Such a dear person, so very wise, and handsome. He came to me in later life, but I imagine, when he was young, he must have been very much like you.\"\n Peter Coakley grinned sheepishly, as he had done many times in the past hour and a half. Since leaving Tanya Livingston, with instructions to remain with the old lady stowaway until the departure of her return flight for Los Angeles, their talk had consisted chiefly of a monologue by Mrs. Quonsett in which Peter Coakley was compared frequently and favorably with the late Herbert Quonsett. lt was a subject of which Peter was becoming decidedly weary. He was unaware that that was what Ada Quonsett astutely intended.\n Surreptitiously, Peter Coakley yawned; this was not the kind of work he had expected when he became a Trans America passenger agent. He felt an absolute fool, sitting here in uniform, playing dry nurse to a harmless, garrulous old dame who could have been his great-grandmother. He hoped this duty would be over soon. It was bad luck that Mrs. Quonsett\u0027s flight to Los Angeles, like most others tonight, was being further delayed by the storm; otherwise the old girl would have been on her way an hour ago. He hoped to goodness that the L.A. flight would be called soon. Meanwhile, the announcement about Flight Two, which was continuing, made a welcome, if brief, respite.\n Young Peter Coakley had already forgotten Tanya\u0027s cautioning words: \"Remember... she\u0027s got a barrelful of tricks.\"\n \"Fancy that!\" Mrs. Quonsett said when the announcement ended. \"A flight to Rome! An airport is so interesting, don\u0027t you think, especially for a young, intelligent person like you? Now there was a place---Rome---which my late, dear husband wanted us both to visit.\" She clasped her hands, a wispy lace handkerchief between them, and sighed. \"We never did.\"\n While she talked, Ada Quonsett\u0027s mind was ticking like a fine Swiss watch. What she wanted was to give this child in a man\u0027s uniform the slip. Although he was plainly becoming bored, boredom itself was not enough; he was still here. What she had to do was develop a situation in which boredom would become carelessness. But it needed to be soon.\n Mrs. Quonsett had not forgotten her original objective---to stow away on a flight to New York. She had listened carefully for New York departure announcements, and five flights of various airlines had been called, but none was at the right moment, with any reasonable chance of getting away from her young custodian, unnoticed. Now, she had no means of knowing if there would be another New York departure before the Trans America flight to Los Angeles---the flight which she was supposed to go on, but didn\u0027t want to.\n Anything, Mrs. Quonsett brooded, would be better than going back to Los Angeles tonight. Anything! even... a sudden thought occurred to her... even getting aboard that flight to Rome.\n She hesitated. Why not? A lot of things she had said tonight about Herbert were untrue, but it was true that they had once looked at some picture postcards of Rome together... If she got no farther than Rome airport, she would at least have been there; it would be something to tell Blanche when she finally got to New York. Just as satisfying, it would be spitting in the eye of that red-headed passenger agent bitch... But could she manage it? And what was the gate number they had just announced? Wasn\u0027t it... gate forty-seven in the Blue Concourse \"D\"? Yes, she was sure it was.\n Of course, the flight might be full, with no space for a stowaway or anyone else, but that was always a chance you took. Then for a flight to Italy, she supposed, people needed passports to get aboard; she would have to see how that worked out. And even now, if there was a flight announcement for New York...\n The main thing was not just to sit here, but to do something.\n Mrs. Quonsett fluttered her frail, lined hands. \"Oh dear!\" she exclaimed. \"Oh dear!\" The fingers of her right hand moved, hovering near the top of her old-fashioned, high-necked blouse. She dabbed at her mouth with the lace handkerchief and emitted a soft, low moan.\n A look of alarm sprang to the young ticket agent\u0027s face. \"What is it, Mrs. Quonsett? What\u0027s wrong?\"\n Her eyes closed, then opened; she gave several short gasps. \"I\u0027m so sorry. I\u0027m afraid I don\u0027t feel at all well.\"\n Peter Coakley inquired anxiously, \"Do you want me to get help? A doctor?\"\n \"I don\u0027t want to be a nuisance.\"\n \"You won\u0027t be...\"\n \"No.\" Mrs. Quonsett shook her head weakly. \"I think I\u0027ll just go to the ladies\u0027 room. I expect I\u0027ll be all right.\"\n The young ticket agent appeared doubtful. He didn\u0027t want the old girl dying on him, though she looked ready for it. He asked uneasily, \"Are you sure?\"\n \"Yes, quite sure.\" Mrs. Quonsett decided she didn\u0027t want to attract attention here, not in the main part of the terminal. There were too many people nearby who would be watching. \"Please help me up... thank you... now, if you\u0027ll just give me your arm... I believe the ladies\u0027 room is over there.\" On the way, she threw in a couple of low moans, producing anxious glances from Peter Coakley. She reassured him, \"I\u0027ve had an attack like this before. I\u0027m sure I\u0027ll feet better soon.\"\n At the door to the women\u0027s room she released young Coakley\u0027s arm. \"You\u0027re very kind to an old lady. So many young people nowadays... Oh, dear!...\" She cautioned herself: that was enough; she must be careful not to overdo it. \"You\u0027ll wait here for me? You won\u0027t go away?\"\n \"Oh, no. I won\u0027t go.\"\n \"Thank you.\" She opened the door and went in.\n There were twenty or thirty women inside; everything at the airport was busy tonight, Mrs. Quonsett thought, including washrooms. Now she needed an ally. She looked the field over carefully before selecting a youngish secretary-type woman in a beige suit, who didn\u0027t seem in a hurry. Mrs. Quonsett crossed to her.\n \"Excuse me, I\u0027m not feeling very well. I wonder if you\u0027d help me.\" The little old lady from San Diego fluttered her hands and closed and opened her eyes, as she had for Peter Coakley.\n The younger woman was concerned at once. \"Of course I\u0027ll help. Would you like me to take you...\"\n \"No... Please.\" Mrs. Quonsett leaned against a washbasin, apparently for support. \"All I want is to send a message. There\u0027s a young man outside the door in airline uniform---Trans America. His name is Mr. Coakley. Please tell him... yes, I would like him to get a doctor after all.\"\n \"I\u0027ll tell him. Will you be all right until I get back?\"\n Mrs. Quonsett nodded. \"Yes, thank you. But you will come back... and tell me.\"\n \"Of course.\"\n Within less than a minute the younger woman had returned. \"He\u0027s sending for a doctor right away. Now, I think you should rest. Why don\u0027t...\"\n Mrs. Quonsett stopped leaning on the basin. \"You mean he\u0027s already gone?\"\n \"He went immediately.\"\n Now all she had to do, Mrs. Quonsett thought, was get rid of this woman. She closed and opened her eyes again. \"I know it\u0027s asking a great deal... you\u0027ve already been so good... but my daughter is waiting for me by the main door, near United Air Lines.\"\n \"You\u0027d like me to get her for you? Bring her here?\"\n Mrs. Quonsett touched the lace handkerchief to her lips. \"I\u0027d be so grateful, though really it\u0027s an imposition.\"\n \"I\u0027m sure you\u0027d do as much for me. How will I know your daughter?\"\n \"She\u0027s wearing a long mauve coat and a small white hat with yellow flowers. She has a little dog---a French poodle.\"\n The secretary-type woman smiled. \"That should be easy. I won\u0027t be long.\"\n \"It is so good of you.\"\n Ada Quonsett waited only a moment or two after the woman had gone. Mrs. Quonsett hoped, for her temporary helper\u0027s sake, she did not spend too much time searching for an imaginary figure in a mauve coat, accompanied by a non-existent French poodle.\n Smiling to herself, the little old lady from San Diego left the washroom, walking spryly. No one accosted her as she moved away and was absorbed in the surging terminal crowds.\n Now, she thought, which was the way to the Blue Concourse \"D,\" and gate forty-seven?\n TO TANYA Livingston, the Flight Two announcement was like a scoreboard change at a quadruple-header ball game. Four Trans America flights were, at the moment, in various stages of departure; in her capacity as passenger relations agent, Tanya was liaising with them all. As well, she had just had an irritating session with a passenger from an incoming flight from Kansas City.\n The aggressive, fast-talking passenger complained that his wife\u0027s leather traveling case, which appeared on the arrivals carousel with a rip in its side, had been damaged as a result of careless handling. Tanya did not believe him---the rip looked like an old one---but, as Trans America and other airlines invariably did, she offered to settle the claim on the spot, for cash. The difficulty had been in arriving at an agreeable sum. Tanya offered thirty-five dollars, which she considered to be more than the bag\u0027s value; the passenger held out for forty-five. Finally they settled at forty dollars, though what the complainant didn\u0027t know was that a passenger relations agent had authority to go to sixty dollars to get rid of a nuisance claim. Even when suspecting fraud, airlines found it cheaper to pay up quickly than enter into a prolonged dispute. In theory, ticket agents were supposed to note damaged bags at check-in, but seldom did; as a result, passengers who knew the ropes sometimes replaced worn-out luggage in that way.\n Though the money was not her own, Tanya always hated parting with it when, in her opinion, the airline was being cheated.\n Now, she turned her attention to helping round up stragglers for Flight Two, some of whom were still coming in. Fortunately, the bus with downtown check-ins had arrived several minutes earlier, and most of its passengers had by now been directed to Concourse \"D,\" gate forty-seven. In a minute or two, Tanya decided, in case there were any last-minute passenger problems during boarding, she would go to gate forty-seven herself.\n D. O. GUERRERO heard the announcement of Flight Two while in line at the insurance counter in the terminal central concourse.\n It was Guerrero, appearing hurried and nervous, whom Captain Vernon Demerest had seen arrive there, carrying his small attache case which contained the dynamite bomb.\n Guerrero had come directly from the bus to the insurance counter, where he was now fifth in line. Two people at the head of the line were being dealt with by a pair of girl clerks who were working with maddening slowness. One of the clerks---a heavy-chested blonde in a low-cut blouse---was having a prolonged conversation with her present customer, a middle-aged woman. The clerk was apparently suggesting that the woman take out a larger policy than had been asked for; the woman was being indecisive. Obviously, it would take at least twenty minutes for Guerrero to reach the head of the line, but by then Flight Two would probably be gone. Yet hehad to buy insurance; he had to be aboard.\n The p.a. announcement had said that the flight was being boarded at gate forty-seven. Guerrero should be at the gate now. He felt himself trembling. His hands were clammy on the attache case handle. He checked his watch again, for the twentieth time, comparing it with the terminal clock. Six minutes had gone by since the announcement of Flight Two. The final call... the airplane doors closing... could come at any moment. He would have to do something.\n D. O. Guerrero pushed his way roughly to the head of the line. He was past caring about being noticed, or offending. A man protested, \"Hey, buddy, we\u0027re waiting too.\" Guerrero ignored him. He addressed the bigbreasted blonde. \"Please... my flight has been called---the one to Rome. I need insurance. I can\u0027t wait.\"\n The man who had spoken before interjected, \"Then go without. Another time, get here sooner.\"\n Guerreio was tempted to retort: There won\u0027t be another time. Instead, he addressed himself to the blonde again. \"Please!\"\n To his surprise, she smiled warmly; he had been expecting a rebuff. \"You did say Rome?\"\n \"Yes, yes. The flight\u0027s been called.\"\n \"I know. She smiled again. \"Trans America Flight Two. It is called The Golden Argosy.\"\n Despite his anxiety, he was aware that the girl had a sexy European accent, probably Hungarian.\n D. O. Guerrero made an effort to speak normally. \"That\u0027s right.\"\n The girl turned her smile on the others who were waiting. \"This gentleman really does not have much time. I\u0027m sure you will not mind if I oblige him first.\"\n So much had gone wrong tonight that he could scarcely believe his good luck. There was some muttered grumbling in the line of people waiting, but the man who had done the talking until now was silent.\n The girl produced an insurance application form. She beamed at the woman she had been dealing with. \"This will only take a moment.\" Then she turned her smile again on D. O. Guerrero.\n For the first time he realized how effective the smile was, and why there had been no real protest from the others. When the girl looked at him directly, Guerrero---who was seldom affected by women---had the feeling he was going to melt. She also had the biggest tits he had ever seen.\n \"My name is Bunnie,\" the girl said in her European accent. \"What is yours?\" Her ballpoint pen was poised.\n AS A VENDOR of airport flight insurance, Bunnie Vorobioff was a remarkable success.\n She had come to the United States, not from Hungary as D. O. Guerrero had supposed, but from Glauchau in the southern portion of East Germany, via the Berlin Wall. Bunnie (who was then Gretchen Vorobioff, the homely, flat-chested daughter of a minor Communist official and a Young Communist herself) crossed the wall at night with two male companions. The young men were caught by searchlights, shot and killed; their bodies hung for twenty-four hours on barbed wire, in public view. Bunnie avoided the searchlights and small arms fire and survived, survival being a quality which seemed to come to her naturally.\n Later, on arrival as a U.S. immigrant at age twenty-one, she had embraced American free enterprise and its goodies with the enthusiasm of a religious convert. She worked hard as a hospital aide, in which she had some training, and moonlighted as a waitress. Into the remaining time she somehow crammed a Berlitz course in English, and also managed to get to bed---occasionally to sleep, more often with interns from the hospital. The interns repaid Gretchen\u0027s sexual favors by introducing her to silicone breast injections, which started casually and ended by being a joyous group experiment to see just how big her breasts would get. Fortunately, before they could become more than gargantuan, she exercised another new-found freedom by quitting her hospital job for one with more money. Somewhere along the way she was taken to Washington, D.C., and toured the White House, the Capitol, and the Playboy Club. After the last, Gretchen further Americanized herself by adopting the name Bunnie.\n Now, a year and a half later, Bunnie Vorobioff was totally assimilated. She was in an Arthur Murray dancing class, the Blue Cross and Columbia Record Club, had a charge account at Carson Pirie Scott, subscribed to Reader\u0027s Digest and TV Guide, was buying the World Book Encyclopedia on time, owned a wig and a Volkswagen, collected trading stamps, and was on pills.\n Bunnie also loved contests of all kinds, especially those which held a hope of tangible reward. Along these lines, a reason she enjoyed her present job more than any other she had had so far, was that periodically her insurance company employers held sales contests for its staff, with merchandise prizes. One such contest was in progress now. It would end tonight.\n The contest was the reason why Bunnie had reacted so agreeably when D. O. Guerrero announced that he was on his way to Rome. At this moment Bunnie needed forty more points to win her objective in the present sales contest---an electric toothbrush. For a while tonight she had despaired of completing her total of points before the deadline, since insurance policies she had sold today were mostly for domestic flights; these produced lower premiums and earned fewer contest points. However, if a maximum size policy could be sold for an overseas flight, it would earn twenty-five contest poirts, bringing the remainder within easy reach. The question was: How big an insurance policy did this Rome passenger want and, assuming it was less than the maximum, could Bunnie Vorobioff sell him more?\n Usually she could. Bunnie merely turned on her most sexy smile, which she had learned to use like an instant warming oven, leaned close to the customer so that her breasts bemused him, then announced how much more benefit could be had for an additional small sum of money. Most times the ploy worked and was the reason for Bunnie\u0027s success as an insurance saleswoman.\n When D. O. Guerrero had spelled out his name, she asked, \"What kind of policy were you considering, sir?\"\n Guerrero swallowed. \"Straight life---seventy-five thousand dollars.\"\n Now that he had said it, his mouth was dry. He had a sudden fear that his words had alerted everyone in the line-up; their eyes were boring into his back. His entire body was trembling; he was sure it would be noticed. To cover up, he lit a cigarette, but his hand was shaking so much that he had trouble bringing match and cigarette together. Fortunately, the girl, with her pen hovering over the entry \"principal sum,\" appeared not to notice.\n Bunnie pronounced, \"That would cost two dollars and fifty cents.\"\n \"What?... Oh, yes.\" Guerrero managed to light the cigarette, then dropped the match. He reached into his pocket for some of the small amount of money he had remaining.\n \"But it is quite a tiny policy.\" Bunnie Vorobioff had still not marked in the principal sum. Now she leaned forward, bringing her breasts nearer to the customer. She could see him looking down at them with fascination; men always did. Some, she sensed at times, wanted to reach out and touch. Not this man, though.\n \"Tiny?\" Guerrero\u0027s speech was awkward, halting. \"I thought... it was the biggest.\"\n Even to Bunnie, the man\u0027s nervousness was now apparent. She supposed it was because he would be flying soon. She directed a dazzling smile across the counter.\n \"Oh no, sir; you could buy a three hundred thousand dollar policy. Most people do, and for just ten dollars premium. Really, it isn\u0027t much to pay for all that protection, is it?\" She kept her smile switched on; the response could mcan a difference of nearly twenty contest points; it might gain or lose her the electric toothbrush.\n \"You said... ten dollars?\"\n \"That\u0027s right---for three hundred thousand dollars.\"\n D. O. Guerrero thought: He hadn\u0027t known. All along, he had believed that seventy-five thousand dollars was the top limit for airport-purchase insurance for an overseas flight. He had obtained the information from an insurance application blank which, a month or two ago, he had picked up at another airport. Now he remembered---the earlier blank came from an automatic vending machine. It had not occurred to him that over-the-counter policies could be that much greater.\n Three hundred thousand dollars!\n \"Yes,\" he said eagerly. \"Please... yes.\"\n Bunnie beamed. \"The full amount, Mr. Guerrero?\"\n He was about to nod assent when the supreme irony occurred to him. He probably did not possess ten dollars. He told Bunnie, \"Miss... wait!\" and began searching his pockets, pulling out whatever money he could find.\n The people in line behind were becoming restive. The man who had objected to Guerrero to begin with, protested to Bunnie, \"You said he\u0027d just take a minute!\"\n Guerrero had found four dollars and seventy cents.\n Two nights ago, when D. O. Guerrero and Inez had pooled their last remaining money, D.O. had taken eight dollars, plus small change, for himself. After pawning Inez\u0027s ring and making the down payment on the Trans America ticket, there had been a few dollars left; he wasn\u0027t sure how many, but since then he had paid for meals, subway fares, the airport bus... He had known that he would need two and a half dollars for flight insurance, and had kept it carefully in a separate pocket. But beyond that he hadn\u0027t bothered, aware that once aboard Flight Two, money would be of no further use.\n \"If you don\u0027t have cash,\" Bunnie Vorobioff said, \"you can give me a check.\"\n \"I left my checkbook home.\" It was a lie; there were checks in his pocket. But if he wrote a check, it would bounce and invalidate the insurance.\n Bunnie persisted, \"How about your Italian money, Mr. Guerrero? I can take lire and give you the proper rate.\"\n He muttered, \"I don\u0027t have Italian money,\" then cursed himself for having said it. Downtown he had checked in without baggage for a flight to Rome. Now insanely, he had demonstrated before onlookers that he had no money, either American or Italian. Who would board an overseas flight unequipped and penniless, except someone who knew the flight would never reach its destination?\n Then D. O. Guerrero reminded himself... except in his own mind... the two incidents---downtown and here---were unconnected. They would not be connected until afterward, and by then it wouldn\u0027t matter.\n He reasoned, as he had on the way out: It was not the strength of suspicion which was important. The crucial factor would still be the absence of wreckage, the absence of proof.\n Surprisingly, despite his latest gaffe, he discovered he was growing more confident.\n He added some dimes and pennies to the pile of change on the insurance counter. Then, miraculously, in an inside pocket, he found a five-dollar bill.\n Not concealing his excitement, Guerrero exclaimed, \"That\u0027s it! I have enough!\" There was even a dollar or so in small change left over.\n But even Bunnie Vorobioff was doubtful now. Instead of writing the three hundred thousand dollar policy which the man was waiting for, she hesitated.\n While he had searched his pockets, she had been watching the customer\u0027s face.\n It was strange, of course, that this man was going overseas without money, but, after all, that was his own business; there could be plenty of reasons for it. What really bothered her was his eyes; they held a hint of frenzy, desperation. Both were qualities which Bunnie Vorobioff recognized from her past. She had seen them in others. At moments---though it seemed long ago---she had been close to them herself.\n Bunnie\u0027s insurance company employers had a standing instruction: If a purchaser of flight insurance seemed irrational, unusually excited, or was drunk, the fact was to be reported to the airline on which he was traveling. The question for Bunnie was: Was this an occasion to invoke the rule?\n She wasn\u0027t sure.\n The company standing instruction was sometimes discussed, among themselves, by flight insurance sales clerks. Some of the girls resented or ignored it, arguing that they were hired to sell insurance, not to act as unpaid, unqualified psychologists. Others pointed out that many people who bought flight insurance at an airport were nervous to begin with; how could anyone, without special training, decide where nervousness ended and irrationality began? Bunnie herself had never reported a keyed-up passenger, though she knew a girl who had, and the passenger turned out to be an airline vice president, excited because his wife was going to have a baby. There had been all kinds of trouble over that.\n Still Bunnie hesitated. She had covered her hesitation by counting the man\u0027s money on the counter. Now she wondered if Marj, the other clerk working beside her, had noticed anything unusual. Apparently not. Marj was busy writing a policy, earning her contest points.\n In the end, it was Bunnie Vorobioff\u0027s past which swayed her decision. Her formative years... occupied Europe, her flight to the West, the Berlin Wall... had taught her survival, and conditioned her to something else: to curb curiosity, and not to ask unnecessary questions. Ouestions had a way of leading to involvement, and involvment---in other people\u0027s problems---was something to be avoided when one had problems of one\u0027s own.\n Without further questioning, at the same time solving her problem of how to win an electric toothbrush, Bunnie Vorobioff wrote a flight insurance policy, for three hundred thousand dollars, on D. O. Guerrero\u0027s life.\n Guerrero mailed the policy to his wife, Inez, on his way to gate forty-seven and Flight Two. \n","sourceLink":"https://allnovel.net/airport/page-23.html","bookId":1522,"book":{"id":1522,"title":"Airport","description":"Storyline: \n The story takes place mainly over the course of one evening and night, as a massive snowstorm plays havoc with airport operations. The storyline centers on Bakersfeld\u0027s struggles to keep the airport open during the storm. His chief problem is the unexpected closure of primary Runway three zero, caused when a landing airliner turns off past the wrong side of a runway marker light, burying the plane\u0027s landing gear in the snow, and blocking the runway. This becomes a major problem as another airplane, Trans America Flight Two, experiences an midair emergency and returns to Lincoln. This requires that the runway become quickly available. The runway numbers in the novel differed from those in the later movie, as did numerous other details. The closing of runway three zero requires the use of shorter runway 25, which has the unfortunate consequence of causing planes to take off over a noise-sensitive suburb, whose residents picket the airport in protest.\n \n","cover":"https://allnovel.net/images/airport.jpg","author":"Arthur Hailey","type":"Adventure","source":"allnovel","link":"https://allnovel.net/airport.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:43:47 AM"}}
