{"id":62597,"no":7,"title":"Page 7","content":"THE BLUSTERING, biting wind across the airfield was as strong as ever, and still driving the heavily falling snow before it.\\n\\n Inside his car, Mel Bakersfeld shivered. He was heading for runway one seven, left, which was being plowed, after leaving runway three zero and the stranded Aereo-Mexican jet. Was the shivering due to the cold outside, Mel wondered, or to memory, which the scent of trouble a few minutes ago, plus the nagging reminder from the old injury of his foot, had triggered?\\n\\n The injury had happened sixteen years ago off the coast of Korea when Mel had been a Navy pilot flying fighter missions from the carrier Essex. Through the previous twelve hours (he remembered clearly, even now) he had had a presentiment of trouble coming. It wasn\u0027t fear---like others, he had learned to live with that; rather, a conviction that something fateful, possibly final, was moving inexorably toward him. Next day, in a dogfight with a MIG-15, Mel\u0027s Navy F9F-5 had been shot down into the sea.\\n\\n He managed a controlled ditching, but though unhurt himself, his left foot was trapped by a jammed rudder pedal. With the airplane sinking fast---an F9F-5 had the floating characteristics of a brick---Mel used a survival-kit hunting knife to slash desperately, wildly, at his foot and the pedal. Somehow, underwater, his foot came free. In intense pain, half-drowned, he surfaced.\\n\\n He had spent the next eight hours in the sea before being picked up, unconscious. Later he learned he had severed the ligaments in front of his ankle, so that the foot extended from his leg in an almost straight line.\\n\\n In time, Navy medics repaired the foot, though Mel had never flown---as a pilot---since then. But at intervals the pain still returned, reminding him that long ago, as on other later occasions, his instinct for trouble had been right. He had the same kind of instinct now.\\n\\n Handling his car cautiously, being careful to retain his bearinp in the darkness and restricted visibility, Mel was nearing runway one seven, left. This was the runway which, the tower chief had indicated, Air Traffic Control would seek to use when the wind shifted as was forecast to happen soon.\\n\\n At the moment, on the airfield, two runways were in use: one seven, right, and runway two five.\\n\\n Lincoln International had five runways altogether. Through the past three days and nights they had represented the front line of the battle between the airport and the storm.\\n\\n The longest and widest of the five was three zero, the runway now obstructed by Aereo-Mexican. (With a change of wind and an aircraft approaching from the opposite direction, it could also be runway one two. The figures indicated compass headings of 300 and 120 degrees.) This runway was almost two miles long and as wide as a short city block; an airport joke claimed that one end could not be seen from the other because of the earth\u0027s curvature.\\n\\n Each of the other four runways was half a mile or so shorter, and less wide.\\n\\n Without ceasing, since the storm began, the miles of runways had been plowed, vacuumed, brushed, and sanded. The motorized equipment---several million dollars\u0027 worth of roaring diesels---had stopped only minutes at a time, mainly for refueling or relieving crews. It was work which air travelers never saw at close hand because no aircraft used a fresh-cleared runway until the surface had been inspected and declared safe. Standards were exacting. Half an inch of slush or three inches of powdery snow were maximums allowable for jets. More than that would be sucked into engines and endanger operation.\\n\\n It was a pity, Mel Bakersfeld reflected, that runway snow teams were not more on public view. The sight was spectacular and stirring. Even now, in storm and darkness, approaching the massed equipment from the rear, the effect was impressive. Giant columns of snow cascaded to the right in arcs of a hundred and fifty feet. The arcs were framed in vehicle searchlights, and shimmered from the added color of some twenty revolving beacons---one on the roof of each vehicle in the group.\\n\\n Airport men called the group a Conga Line.\\n\\n It had a head, a tail, a body, and an entourage, and it progressed down a runway with the precision of choreography.\\n\\n A convoy leader was the head. He was a senior foreman from airport maintenance and drove an airport car---bright yellow, like all other equipment in the Line. The leader set the Conga Line pace, which was usually fast. He had two radios and remained permanently in touch with the Snow Desk and Air Traffic Control. By a system of lights, he could signal drivers following---green for \"speed up,\" amber for \"maintain pace,\" red for \"slow down,\" and flashing red for \"stop.\" He was required to carry in his head a detailed map of the airport, and must know precisely where he was, even on the darkest night, as now.\\n\\n Behind the convoy leader, its driver, like an orchestra\u0027s first violinist, was the number one plow---tonight a mammoth Oshkosh with a big main blade ahead, and a wing blade to the side. To the rear of number one plow, and on its right, was number two. The first plow heaved the snow aside; the second accepted the load from the first and, adding more, heaved both lots farther.\\n\\n Then came a Snowbiast, in echelon with the plows, six hundred roaring horsepower strong. A Snowblast cost sixty thousand dollars and was the Cadillac of snow clearance. With mighty blowers it engulfed the snow which both plows piled, and hurled it in a herculean arc beyond the runway\u0027s edge.\\n\\n In a second echelon, farther to the right, were two more plows, a second Snowblast.\\n\\n After the plows and Snowblasts came the graders---five in line abreast, with plow blades down to clear any mounds the front plows missed. The graders towed revolving brushes, each sixteen feet wide and independently diesel powered. The brushes scoured the runway surface like monstrous yard brooms.\\n\\n Next were sanders. Where the eleven vehicles ahead had cleared, three hulking FWD trucks, with hoppers holding fourteen cubic yards apiece, spread sand out evenly.\\n\\n The sand was special. Elsewhere around the airport, on roadways and areas which the public used, salt was added to the sand as a means of melting ice. But never for aeronautical areas. Salt corroded metal, shortening its life, and airplanes were treated with more respect than cars.\\n\\n Last in the Conga Line itself---\"tail-end Charlie\"---was an assistant foreman in a second car. His job was to insure that the line stayed intact and to chivvy stragglers. He was in radio touch with the convoy leader, often out of sight ahead in snow and darkness.\\n\\n Finally came the entourage---a standby plow, in case one faltered in the Line; a service truck with a detail of mechanics; refueling tankers---diesel and gasoline; and---when summoned by radio at appointed times---a coffee and doughnut wagon.\\n\\n Mel accelerated around the entourage and positioned his car alongside the assistant foreman\u0027s. His arrival was noticed. He heard the convoy leader notified by radio, \"Mr. Bakersfeld just joined us.\"\\n\\n The Line was moving fast---close to forty miles an hour instead of its usual twenty-five. The leader had probably speeded up because of the expected wind shift and the need to have the runway open soon.\\n\\n Switching his radio to ATC ground frequency, Mel heard the convoy leader call the tower, \"...on one seven, left, approaching intersection with runway two five. Request clearance over intersection.\"\\n\\n Runway two five was an active runway, now in use.\\n\\n \"Convoy leader from ground control, hold short of the intersection. We have two flights on final approach. You may not, repeat, not, cross runway intersection. Acknowledge.\"\\n\\n The voice from the tower was apologetic. Up there, they understood the difficulty of stopping a rolling Conga Line, and getting it started again. But the approaching flights had undoubtedly made a tricky instrument descent and now were close to landing, one behind the other, Only a desperate emergency would justify sending them round again on such a night.\\n\\n Ahead of Mel, red lights were going on, flashing commandingly as the Conga Line slowed and stopped.\\n\\n The assistant foreman, a cheerful young Negro, jumped from his car and came across to Mel\u0027s. As he opened the door, the wind swept in, but could only be felt, not heard, above the encompassing roar of idling diesels. The assistant put his mouth against Mel\u0027s ear. \"Say, Mr. B., how\u0027s about joining the Line? One of the boys\u0027ll take care of your car.\"\\n\\n Mel grinned. The pleasure he got, whenever he could spare time, from riding and occasionally handling heavy motorized equipment was well known around the airport. Why not? he reasoned. He had come out to inspect the snow clearance as a result of the adverse report by Vernon Demerest\u0027s Airlines Snow Committee. Clearly, the report was unjustified, and everything was going well. But maybe he should watch a few minutes longer from a ringside perch.\\n\\n Nodding agreement, he shouted, \"Okay, I\u0027ll ride the second Snowblast.\"\\n\\n \"Yessir!\"\\n\\n The assistant foreman, carrying a hand searchlight and leaning against the wind, preceded Mel past the now stationary lines of sand trucks and brushes. Mel observed that already fresh snow was starting to cover the runway area cleared only moments ago, To the rear, a figure ducked from a service truck and hastened to Mel\u0027s car.\\n\\n \"Better hurry, Mr. B. It\u0027s only a short stop.\" The young Negro flashed his light at the Snowblast cab, then held it steady, illuminating the way, as Mel clambered up. High above, the Snowblast driver opened the cab door and held it while Mel eased inside. On the way up, his impaired foot pained him sharply, but there was no time to wait. Ahead, the flashing red lights had already changed to green, and presumably the two approaching aircraft had now landed and were past the intersection. The Conga Line must hurry across before the next landing, perhaps only a minute or two away. Glancing to the rear, Mel could see the assistant foreman sprinting back toward his tail-end-Charlie car.\\n\\n The Snowblast was already moving, picking up speed with a deep-throated roar. Its driver glanced sideways as Mel slipped into one of the two soft, padded seats.\\n\\n \"Hi, Mr. Bakersfeld.\"\\n\\n \"How are you, Will?\" Mel recognized the man, who, when there was no snow emergency, was employed by the airport as a payroll clerk.\\n\\n \"I\u0027m pretty good, sir. Tired some.\"\\n\\n The driver was holding position carefully behind the third and fourth plows, their beacon lights just visible. Already the Snowblast\u0027s huge auger blades were engorging snow, cramming it to the blower. Once more, a continuous white stream was arcing outward, clear of the runway.\\n\\n Up here was like the bridge of a ship. The driver held his main control wheel lightly, like a helmsman. A multitude of dials and levers, glowing in the darkness, were arranged for fingertip control. Circular, high-speed windshield wipers---as on a ship---provided ports of clear vision through encrusted snow.\\n\\n \"I guess everyone\u0027s tired,\" Mel said. \"All I can tell you is that this can\u0027t last forever.\"\\n\\n He watched the forward speed needle climb---from twenty-five to thirty, thirty to thirty-five. Swinging in his seat, Mel surveyed outside. From this position, at the center of the Conga Line, he could see the lights and shapes of the other vehicles. He noted approvingly that the formation was exact.\\n\\n A few years ago, in a storm like this, an airport would have closed completely. Now it didn\u0027t, mainly because ground facilities---in this one area---had caught up with progress in the air. But of how many areas of aviation could the same thing be said? Mel reflected ruefully: very few.\\n\\n \"Oh, well,\" the driver said, \"it makes a change from working an adding machine, and the longer this keeps up, the more extra pay there\u0027ll be when it\u0027s over.\" He touched a lever, tilting the cab forward to inspect the auger blades. With another control he adjusted the blades, then releveled the cab. \"I don\u0027t have to do this; you know that, Mr. Bakersfeld, I volunteer. But I kinda like it out here. It\u0027s sort of...\" He hesitated. \"I dunno.\"\\n\\n Mel suggested, \"Elemental?\"\\n\\n \"I guess so.\" The driver laughed. \"Maybe I\u0027m snow happy.\"\\n\\n \"No, Will, I don\u0027t believe you are.\" Mel swung forward, facing the way the Conga Line was moving. It was elemental here. More to the point, amid the airfield\u0027s loneliness there was a feeling of closeness to aviation, the real aviation which in its simplest sense was man against the elements. You lost that kind of feeling if you stayed too long in terminals and airline office buildings; there, the extraneous, non-essential things confused you. Maybe all of us in aviation management, Mel thought, should stand at the distant end of a runway once in a while, and feel the wind on our faces. It could help to separate detail from fundamentals It might even ventilate our brains as well.\\n\\n Sometimes in the past Mel had gone out onto the airfield when he needed to think, to reason quietly and alone. He had not expected to tonight, but found himself doing so now... wondering, speculating, as he had so often in recent days, about the airport\u0027s future and his own. \\n\\n","sourceLink":"https://allnovel.net/airport/page-7.html","bookId":1522,"book":{"id":1522,"title":"Airport","description":"Storyline: The story takes place mainly over the course of one evening and night, as a massive snowstorm plays havoc with airport operations. The storyline centers on Bakersfeld\u0027s struggles to keep the airport open during the storm. His chief problem is the unexpected closure of primary Runway three zero, caused when a landing airliner turns off past the wrong side of a runway marker light, burying the plane\u0027s landing gear in the snow, and blocking the runway. This becomes a major problem as another airplane, Trans America Flight Two, experiences an midair emergency and returns to Lincoln. This requires that the runway become quickly available. The runway numbers in the novel differed from those in the later movie, as did numerous other details. The closing of runway three zero requires the use of shorter runway 25, which has the unfortunate consequence of causing planes to take off over a noise-sensitive suburb, whose residents picket the airport in protest.\\n","cover":"https://allnovel.net/images/airport.jpg","author":"Arthur Hailey","type":"Adventure","source":"allnovel","link":"https://allnovel.net/airport.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:43:47 AM"}}
