{"id":64595,"no":3,"title":"Page 3","content":"On our last night together, Charlie leans back and regards me over the glow of our dim lamp. We’re sitting together at the far end of the pier, watching the skyscrapers of downtown light up one by one. Pretty nice evening. Even the humidity doesn’t seem as bad as usual, and now and then I can feel a cool breeze. “So, you paid off your debt. What are you going to do tomorrow?” she asks me. I shrug. “Don’t know yet. I usually take things one day at a time.” We eat in silence for a few more minutes before she speaks up again. “You haven’t told me much about yourself,” she says. “I don’t even know your name.” I put down my half-eaten can of sausage and beans, then lean back on my elbows. “Ed,” I reply, blurting out the first name I can think of. “What else do you want to know?” She studies me. In the flickering lamplight, her eyes take on a honey-colored tint. “How long have you lived in Lake?” She takes another bite of food and then tosses her can aside. “What happened to your family? And how’d your knee get that way? You always lived on the streets, or what?” I’m quiet throughout her questions. It’s only fair that she’s asking, of course, since she’s told me so much about herself. But if there’s one thing I’ve learned from living on the streets, it’s to keep details about myself secret. Where would I even start? My name’s Day. My family lives about thirty blocks northeast of here. I have a mother, an older brother, and a younger brother. All of them think I’m dead. Republic doctors sliced open my knee while experimenting on my body. I was shipped to them after failing my Trial, and they’d left me for dead in a hospital basement. I stumbled around, bleeding, for weeks afterward. I always travel alone, because if the Republic ever finds me, they’ll snuff me out like a candle. I keep my head turned away as the memories fill me up and threaten to burst out of my chest. So many stories to tell. But I fold them away one by one. Charlie sobers at my silence. “Well,” she starts, looking a little awkward for the first time since she’s known me. She fiddles with one of her braids. “All in good time, whenever you’re ready.” I smile at her over the lamplight. “If you want, you know, you can stay for a few more days,” she says. “My dad says you’re a good worker and proved your worth . . . he’d be happy to keep you around a little longer. He might even give you some wages under the table. And, well, you’re a nice kid. The streets are a harsh place to live—I dunno how long you’ll make it out there on your own.” Her offer’s tempting. My heart warms, and there are unspoken words of gratitude on the tip of my tongue. I soak in her freckled face and rumpled braids, and in this moment I’m completely ready to say yes. I can see myself working here beside her and making some sort of life for myself. I ache to belong to a family again, to become friends with this girl. Wouldn’t that be something, yeah? I close my eyes and lose myself to the fantasy. “I’ll think about it,” I finally reply. It’s a good enough answer for now. Charlie shrugs, and we both go back to finishing our dinners. We sleep side by side out on her boat’s deck that night, close enough that our shoulders touch and I can feel the warmth coming from her body. I spend most of the night looking up at the sky. It’s clear enough for me to make out about a dozen stars. I count them over and over again until they lull me into a light sleep. A shriek jolts me awake. I instinctively hop to my feet, then wince as my bad knee twists and forces me to sit back down. My pouch of random trinkets pokes me uncomfortably in my side. What’s going on? What happened? Is it morning? All I notice in my confusion is the dim light of dawn that paints everything bluish gray. “No! You can’t!” Another shriek. This time I hear it come from farther down the pier, where the crew’s crowded around something. Curious passersby have started accumulating along the street. Don’t get close. Stay away. My instincts flare up, and instead of joining them, I hurry over to a nearby stack of crates and crouch in the shadows. At first I can’t tell what’s going on. Then, as I squint closer at the scene, I realize what’s happening. A few Republic soldiers dressed in the attire of a city patrol—not street police, an actual city patrol—are shouting questions at a large man. Charlie’s dad. The shrieks come from Charlie, whom several of the crew members are holding back. One city patrol soldier punches her father squarely in the jaw. He falls to his knees. “You damn dogs!” Charlie shouts at the patrol. “You liars! We’re not behind on shipments—we’re not even in charge of that! You can’t—” “Calm down,” one of the soldiers snaps at her. “Or you’ll feel the bite of a bullet. Got that?” Then he nods to his companions. “Confiscate their shipment.” Charlie screams something I can’t make out, but her father shakes his head at her, giving her a firm warning. A trail of blood leaks from the edge of his mouth. “It’ll be okay,” he calls out to her even as the soldiers hurry along the end of the pier and load crates onto their truck. I wait quietly in the dark as they fill their truck. If they take Charlie’s whole shipment, then that means they won’t get paid for at least two weeks. Some of them would go hungry for sure. A memory rushes back to me of when the city patrols had once taken my dad away for questioning, how they’d brought him back bloodied and broken. Anger and recklessness rush through my mind. I narrow my eyes at the soldiers, then dart quietly from the shadows to the edge of the water. As the chaos continues to unfold at the end of the pier, no one notices as I slip soundlessly into the water and make my way off along the shore. My bad knee protests as I paddle, but I grit my teeth and ignore it. When I’ve swum far enough to reach the next set of piers, I make my way up to the banks, crawl up to street level, and melt into the early-morning crowds. Water drips down my chin; my soggy boots squish with each step I take. The soldiers will probably take another few minutes to finish loading everything up and checking off the crates—by the time they head back out this way to Lake’s police station, I’ll be ready for them. As I limp through the crowds, I reach down to my belt and tug open the pouch of trinkets. I’ve got a good stash of nails. I scatter them all across the street until I’m confident that I’ve covered a large swath of the road. Then I turn a corner, dart into a narrow alley, and crouch behind a large trash bin. My knee throbs in protest. I rub wet strands of hair impatiently away from my face. I gingerly stretch out my leg, wince, and rub at the old scar that runs across my knee. Gotta move fast if I want this to work. I check to make sure my pocketknife’s tucked securely against my boot, then settle in to wait. A few minutes later, I hear what I’ve been hoping for—the sound of a city patrol truck approaching from farther ahead, its recognizable beeping alarm ringing out down the street. My body tenses. The truck draws nearer. People clear to either side as it honks its way through the morning rush. Then— Pop! One of the truck’s tires bursts—it skids, then careens haphazardly to one side, sending up some shrieks from the crowd. It crashes to a halt several feet from where my alley is. I struggle to my feet. The back of the truck has popped open in all the chaos, and a dozen or so crates lie open and spilled on the streets. Two soldiers hop out from the truck right as crowds of people gather around the truck, some already eagerly picking up cans of meat that have rolled out of the broken crates. “Back up!” one soldier shouts in vain at the crowd. The other soldier pushes people back with his rifle. I rush in with the pack. If I could grab even one of the crates and bring it back to Charlie, I’d call that a win. The people tower over me, jostling me back and forth as everyone tries to snatch a small portion of the food. I duck my head, fold myself down as small as I can, and push doggedly on. Finally, I see the truck before me—and the spilled contents all over the ground. I reach down and shove two tins of meat right into my pockets. Then I grab the edge of one crate, pull back with all my might, and start dragging it along the ground. Several other soldiers have arrived to back up the original two; I try to work faster as they begin pushing people back from the scene. I clench my jaw and pull harder. “Hey—get away from that!” A soldier catches sight of me, grabs me by the collar of my shirt, and tosses me unceremoniously back against the throngs. My bad knee buckles—I cry out in pain and land in a weird position. The soldier grabs the crate I was dragging and shoots me a furious glare. “Damn baby street cons,” he spits at me. “Go back to your alley. Keep your hands off Republic property.” That’s mine, I scream silently. That’s for Charlie. To my surprise, an urge to cry surges up from a deeper part of me. That’s for my family. For people I care about. But there’s not much I can do now. I’m too late, I’m too small, and I’m too weak. The scene I’ve caused is useless to me now—enough soldiers have arrived that the people no longer have the guts to grab for the crates’ contents.","sourceLink":"https://allnovel.net/life-before-legend-legend-0-5/page-3.html","bookId":1693,"book":{"id":1693,"title":"Life Before Legend (Legend #0.5)","description":"Storyline: Life Before Legend (Legend 0.5) Find out more about June and Day in this never-before-seen glimpse into their daily lives before they met in Marie Lu’s New York Times bestselling LEGEND series. As twelve-year-olds struggling to survive in two very different worlds within the Republic’s stronghold, June was starting her first day of school at Drake University as the youngest cadet ever admitted, and Day was fighting for food on the streets of the Lake sector. LIFE BEFORE LEGEND contains two original stories written by Marie Lu that give readers a sneak peek into the lives of their favorite characters in a thrilling new context.","cover":"https://allnovel.net/images/life-before-legend-legend-0-5.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/life-before-legend-legend-0-5.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:54:57 AM"}}
