{"id":108206,"no":10,"title":"Page 10","content":"After boarding up Eric\u0027s room and ditching his car a safe distance away, I go for another drive, this one entirely aimless. It is dark now and the time of day suits my mood. Kalika thrust back her second empty eight-ounce glass of blood with the same numbing words: Hungry, Mommy. I shudder to think what her appetite will demand tomorrow. Will I have to collect a whole team of basketball players? Maybe I should drive down to the Forum and wait for the Lakers to start practice. They have some big boys who know how to shoot a ball.\n But should they bleed for my daughter?\n Should Eric?\n Seymour has scored with many of his points, as always.\n Midnight finds me at the beach where I buried Yaksha\u0027s body, or rather, where I sunk it. There was little of Yaksha left when I sent him to a watery grave, with his full blessings. Eddie Fender had done his usual number on my creator: stabbed him, torn him, dissected him, drained him. Good old Eddie, never one to take a joke well. But Yaksha hadn\u0027t minded the horrific treatment. Indeed, in the end, the most feared of all earth\u0027s ancient demons had found peace of mind through faith in Krishna. Staring at the dark waves, I think of how the passage of the many years does not necessarily bring devotion, how my own suffering has more often than not brought cynicism.\n I have to wonder if that is why I keep suffering.\n \"What am I missing?\" I ask the ocean. \"Why do I have to go on like this?\"\n Yet now it is more important than ever that I continue. I am a mother; I have a responsibility to feed my daughter; but it is very possible my daughter is capable of destroying all mankind. No one knows, except perhaps Krishna, what weird alchemy of blood she possesses. Bowing my head in the direction of Yaksha\u0027s grave, I turn and leave the beach.\n Another hour finds me at Paula\u0027s school, inside St. Andrews church. It\u0027s peculiar how many churches don\u0027t have posted hours, how their doors are always open. The light of the candles, as I step inside, fill me with warm feelings. Despite my obsession with Krishna, my respect for Jesus has never faded, even during the Middle Ages when the Catholic Church tried to burn me at the stake for witchcraft. Me, a witch? I\u0027m a goddamn vampire. I almost told them that, but then, the Church was never one to enjoy a joke.\n St. Andrews is comfortably stuffy. The smoke from the candles and incense fills my nostrils as I take a seat in the third pew and stare at the stained-glass windows, dark and sinister without the sun to give them color. A statue of Mother Mary stands nearby, dozens of glowing red dishes flickering at her feet. I have never lit a candle for the Madonna in the last two thousand years, but I have a strong urge to do so now. But I won\u0027t pray to her, I won\u0027t ask for her help. Her own son was crucified, so I don\u0027t think she is the best person to run to with my problems. Yet I feel close to her, and that is reason enough to show her respect. Plus I like candles. I like fire of all kinds.\n I have just lit my candles when I hear steps off to my right.\n \"Alisa?\"\n I smile as I turn. \"Paula. What are you doing here at this hour? Praying?\"\n She is happy to see me. As best as she can with her swollen belly, she gives me a hug. \"No, I was working on the school\u0027s books. I couldn\u0027t sleep tonight. I only stopped in here because I saw a car parked out front. I thought it might be yours. Why are you here?\"\n I gesture to Mother Mary. \"I\u0027m making my confession.\"\n \"You need a priest for that.\"\n I shake my head. \"I don\u0027t think there\u0027s a priest anywhere who would be able to sit through a list of my sins.\"\n \"Nonsense. They hear all kinds of stuff. None of us is that unique. I think it all sounds the same to them after a while.\"\n \"For once I have to disagree with you. My confession would set a record for the most difficult penance assigned.\" I pause as a wave of nostalgia sweeps over me. \"Actually, I knew a Catholic priest once. He used to listen to my confessions. I think that\u0027s what drove him mad.\"\n Paula wonders if I am kidding. \"What was his name?\"\n \"Arturo. He was Italian. I met him in Florence, a long time ago. But that is another story. I\u0027m happy to see you. How are you feeling?\"\n Paula beams. \"Wonderful. If I didn\u0027t have such trouble sleeping, I wouldn\u0027t even know I was preg?nant.\"\n \"Not to mention the basketball in your belly. Well, that\u0027s great, I\u0027m happy for you.\" I glance at the main crucifix and lower my voice. \"Very happy.\"\n Paula touches my arm. \"Something\u0027s the matter?\"\n I nod grimly, still staring at Jesus, wondering how it felt to hang on the cross with so much power available to him, but unable to show it. In that instant I feel a great kinship with Jesus. Seldom in five thousand years was I allowed to demonstrate my full power, and then, when I did, people died.\n Also, I think of how Krishna was killed, cut down in the forest by a hunter\u0027s arrow, mistaken for a beast and shot in the heel, the only portion of his divine body that was vulnerable to physical attack. So the legend of Achilles was born, not in Greece, but in the deep forests of central India. It is impossible for me to look at Jesus and not think of Krishna. Honestly, all the religious dogma aside, I believe they were one and the same. So universal that they were everybody, and nobody at the same time. Like Kali, Mother Kalika.\n Who is my daughter? What is she?\n \"Something is the matter,\" I say to Paula.\n \"What is it? Maybe I can help.\"\n \"No. Thanks, but no. No one can help me.\" I gesture to the empty pews. \"Could I remain here a while? I have to think, to meditate. I think that will clear my mind, and then I will know what to do.\"\n Paula kisses me on the cheek. \"Stay as long as you want. I will lock the doors as I leave, but they will still open from the inside. You\u0027ll be safe in here.\"\n I smile feebly. \"Thank you. You are a true friend. Sometime, when things are less hectic, we must talk.\"\n Paula stares deep into my eyes. \"I look forward to that talk.\"\n When she is gone, I curl up in one of the pews and close my eyes. I meditate best when I am unconscious, when I allow God to do most of the talking. Even though I am in a Catholic church, I pray Krishna will visit me in my dreams. \n","sourceLink":"https://allnovel.net/phantom-the-last-vampire-4/page-10.html","bookId":2513,"book":{"id":2513,"title":"Phantom (The Last Vampire #4)","description":"Storyline: \n Phantom (The Last Vampire #4) \n The dead alchemist\u0027s experiment has worked. Alisa is no longer a vampire, but a frail and confused human. Not only that -- she is pregnant. The baby grows in her at supernatural speed. As the stranger watches. The stranger from the past. \n But what child will Alisa\u0027s seed produce? \n A demon or an angel? Alisa does not know. \n But the stranger does. He knows everything that ever was. \n And he knows everything that is to be.\n \n","cover":"https://allnovel.net/images/phantom-the-last-vampire-4.jpg","author":"Christopher Pike","type":"Horror","source":"allnovel","link":"https://allnovel.net/phantom-the-last-vampire-4.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:16:39 PM"}}
