{"id":43976,"no":108,"title":"Chapter 116 The Pardon","content":"THE NEXT DAY Danglars was again hungry; certainly the air of that dungeon was very provocative of appetite. The prisoner expected that he would be at no expense that day, for like an economical man he had concealed half of his fowl and a piece of the bread in the corner of his cell. But he had no sooner eaten than he felt thirsty; he had forgotten that. He struggled against his thirst till his tongue clave to the roof of his mouth; then, no longer able to resist, he called out. The sentinel opened the door; it was a new face. He thought it would be better to transact business with his old acquaintance, so he sent for Peppino. \"Here I am, your excellency,\" said Peppino, with an eagerness which Danglars thought favorable to him. \"What do you want?\" \"Something to drink.\" \"Your excellency knows that wine is beyond all price near Rome.\" \"Then give me water,\" cried Danglars, endeavoring to parry the blow. \"Oh, water is even more scarce than wine, your excellency,--there has been such a drought.\" \"Come,\" thought Danglars, \"it is the same old story.\" And while he smiled as he attempted to regard the affair as a joke, he felt his temples get moist with perspiration. \"Come, my friend,\" said Danglars, seeing that he made no impression on Peppino, \"you will not refuse me a glass of wine?\" \"I have already told you that we do not sell at retail.\" \"Well, then, let me have a bottle of the least expensive.\" \"They are all the same price.\" \"And what is that?\" \"Twenty-five thousand francs a bottle.\" \"Tell me,\" cried Danglars, in a tone whose bitterness Harpagon* alone has been capable of revealing--\"tell the that you wish to despoil me of all; it will be sooner over than devouring me piecemeal.\" * The miser in Molière\u0027s comedy of \"L\u0027Avare.\"--Ed. \"It is possible such may be the master\u0027s intention.\" \"The master?--who is he?\" \"The person to whom you were conducted yesterday.\" \"Where is he?\" \"Here.\" \"Let me see him.\" \"Certainly.\" And the next moment Luigi Vampa appeared before Danglars. \"You sent for me?\" he said to the prisoner. \"Are you, sir, the chief of the people who brought me here?\" \"Yes, your excellency. What then?\" \"How much do you require for my ransom?\" \"Merely the 5,000,000 you have about you.\" Danglars felt a dreadful spasm dart through his heart. \"But this is all I have left in the world,\" he said, \"out of an immense fortune. If you deprive me of that, take away my life also.\" \"We are forbidden to shed your blood.\" \"And by whom are you forbidden?\" \"By him we obey.\" \"You do, then, obey some one?\" \"Yes, a chief.\" \"I thought you said you were the chief?\" \"So I am of these men; but there is another over me.\" \"And did your superior order you to treat me in this way?\" \"Yes.\" \"But my purse will be exhausted.\" \"Probably.\" \"Come,\" said Danglars, \"will you take a million?\" \"No.\" \"Two millions?--three?--four? Come, four? I will give them to you on condition that you let me go.\" \"Why do you offer me 4,000,000 for what is worth 5,000,000? This is a kind of usury, banker, that I do not understand.\" \"Take all, then--take all, I tell you, and kill me!\" \"Come, come, calm yourself. You will excite your blood, and that would produce an appetite it would require a million a day to satisfy. Be more economical.\" \"But when I have no more money left to pay you?\" asked the infuriated Danglars. \"Then you must suffer hunger.\" \"Suffer hunger?\" said Danglars, becoming pale. \"Most likely,\" replied Vampa coolly. \"But you say you do not wish to kill me?\" \"No.\" \"And yet you will let me perish with hunger?\" \"Ah, that is a different thing.\" \"Well, then, wretches,\" cried Danglars, \"I will defy your infamous calculations--I would rather die at once! You may torture, torment, kill me, but you shall not have my signature again!\" \"As your excellency pleases,\" said Vampa, as he left the cell. Danglars, raving, threw himself on the goat-skin. Who could these men be? Who was the invisible chief? What could be his intentions towards him? And why, when every one else was allowed to be ransomed, might he not also be? Oh, yes; certainly a speedy, violent death would be a fine means of deceiving these remorseless enemies, who appeared to pursue him with such incomprehensible vengeance. But to die? For the first time in his life, Danglars contemplated death with a mixture of dread and desire; the time had come when the implacable spectre, which exists in the mind of every human creature, arrested his attention and called out with every pulsation of his heart, \"Thou shalt die!\" Danglars resembled a timid animal excited in the chase; first it flies, then despairs, and at last, by the very force of desperation, sometimes succeeds in eluding its pursuers. Danglars meditated an escape; but the walls were solid rock, a man was sitting reading at the only outlet to the cell, and behind that man shapes armed with guns continually passed. His resolution not to sign lasted two days, after which he offered a million for some food. They sent him a magnificent supper, and took his million. From this time the prisoner resolved to suffer no longer, but to have everything he wanted. At the end of twelve days, after having made a splendid dinner, he reckoned his accounts, and found that he had only 50,000 francs left. Then a strange reaction took place; he who had just abandoned 5,000,000 endeavored to save the 50,000 francs he had left, and sooner than give them up he resolved to enter again upon a life of privation--he was deluded by the hopefulness that is a premonition of madness. He who for so long a time had forgotten God, began to think that miracles were possible--that the accursed cavern might be discovered by the officers of the Papal States, who would release him; that then he would have 50,000 remaining, which would be sufficient to save him from starvation; and finally he prayed that this sum might be preserved to him, and as he prayed he wept. Three days passed thus, during which his prayers were frequent, if not heartfelt. Sometimes he was delirious, and fancied he saw an old man stretched on a pallet; he, also, was dying of hunger. On the fourth, he was no longer a man, but a living corpse. He had picked up every crumb that had been left from his former meals, and was beginning to eat the matting which covered the floor of his cell. Then he entreated Peppino, as he would a guardian angel, to give him food; he offered him 1,000 francs for a mouthful of bread. But Peppino did not answer. On the fifth day he dragged himself to the door of the cell. \"Are you not a Christian?\" he said, falling on his knees. \"Do you wish to assassinate a man who, in the eyes of heaven, is a brother? Oh, my former friends, my former friends!\" he murmured, and fell with his face to the ground. Then rising in despair, he exclaimed, \"The chief, the chief!\" \"Here I am,\" said Vampa, instantly appearing; \"what do you want?\" \"Take my last gold,\" muttered Danglars, holding out his pocket-book, \"and let me live here; I ask no more for liberty--I only ask to live!\" \"Then you suffer a great deal?\" \"Oh, yes, yes, cruelly!\" \"Still, there have been men who suffered more than you.\" \"I do not think so.\" \"Yes; those who have died of hunger.\" Danglars thought of the old man whom, in his hours of delirium, he had seen groaning on his bed. He struck his forehead on the ground and groaned. \"Yes,\" he said, \"there have been some who have suffered more than I have, but then they must have been martyrs at least.\" \"Do you repent?\" asked a deep, solemn voice, which caused Danglars\u0027 hair to stand on end. His feeble eyes endeavored to distinguish objects, and behind the bandit he saw a man enveloped in a cloak, half lost in the shadow of a stone column. \"Of what must I repent?\" stammered Danglars. \"Of the evil you have done,\" said the voice. \"Oh, yes; oh, yes, I do indeed repent.\" And he struck his breast with his emaciated fist. \"Then I forgive you,\" said the man, dropping his cloak, and advancing to the light. \"The Count of Monte Cristo!\" said Danglars, more pale from terror than he had been just before from hunger and misery. \"You are mistaken--I am not the Count of Monte Cristo.\" \"Then who are you?\" 第二天，腾格拉尔又饿了，那间黑牢的空气不知为什么会让人这么开胃。那囚徒本来打算他这天不必再破费，因为，象任何一个会打经济算盘的人一样，他在地窖的角落里藏起了半只鸡和一块面包。但刚吃完东西，他就觉得口渴了，那可是在他的意料这外的。但他一直坚持到他的舌头粘在上颚上，然后，他再也不能坚持下去了，他大喊起来。守卫的打开门，那是一张新面孔。他觉得还是与他的相识做交易比较好一些，便要他去叫庇皮诺。 “我来啦，大人，”庇皮诺带着急切的表情说，腾格拉尔认为这种急切的表情对他有利的。“您要什么？” “要一些喝的东西。” “大人知道罗马附近的酒可是贵得很哪。” “那么给我水吧。”腾格拉尔喊道，极力想避开那个打击。 “哦，水甚至比酒更珍贵，今年的天气是这样的旱。” “得了，”腾格拉尔说，“看来我们又要兜那个老圈子啦。” 他的脸上带着微笑，希望把这件事情当作一次玩笑，但他额角上却已经汗涔涔地了。“来，我的朋友，”看到他的话并没有在庇皮诺身上引起什么反应，他又说，“你不会拒绝给我一杯酒的吧？” “我已经告诉过大人了，”庇皮诺严肃地答道，“我们是不零卖的。” “嗯，那么，给我一瓶最便宜的吧。” “都是一样的价钱。” “要多少？” “两万五千法郎一瓶。” “说吧，”腾格拉尔用痛苦的口吻喊道，“就说你们要敲诈得我一文不名，那比这样零零碎碎的宰割我还更痛快些。” “没准儿这正是头儿的意思。” “头儿！他是谁？” “就是前天带您去见的那个人。” “他在哪儿？” “就在这儿。” “让我见见他。” “当然可以。” 一会儿，罗吉·万帕便出现在腾格拉尔的面前了。 “阁下，你就是带我到这儿来的那些人的首领吗？” “是的，大人。” “你要我付多少赎金？” “哦，说实话，就是您带在身边的那五百万。” 腾格拉尔的心里感到一阵可怕的剧痛。“以前我虽有大笔的财产，”他说，“现在却只剩下这一笔钱了。如果你把这笔钱都拿走，就同时拿了我的命吧。” “我们不准备使您流血。” “谁给你们下的命令？” “我们所服从的那个人。” “那么你也服从那个人的吗？” “是的，是一位首领。” “我听说，你就是首领，但另有一个人是我的首领。” “而那位首领，——他可是也听谁指挥的吗？” “是的。” “他听谁的指挥？” “上帝。” 腾格拉尔想了一会儿。“我不懂你的意思。”他说。 “有可能。” “是你的首领要你这样对待我的吗？” “是的。” “他的目的是什么？” “我一点都不知道。” “我的钱包都要被掏空了呀。” “大概会的。” “好，”腾格拉尔说，“给你一百万怎么样？” “不行。” “两百万呢？三百万？四百万？来，四百万哪？条件是你放我走。” “值五百万的东西您为什么只给我四百万呢？银行家阁下，您这么杀价我买在不懂。” “都拿去吧，那么统统都拿去吧，我告诉你，连我也杀了吧！” “好了，好好，别生气。这样会刺激你的血液循环，使血液循环的加速，这样会产生一个每天需要一百万才满足的胃口。您还是经济一点儿吧。” “但到我没有钱付给你们的时候，又怎么样呢？”腾格拉尔绝望地问。 “那时您必须挨饿。” “挨饿？”腾格拉尔说，他的脸色发白起来。 “大概会的。”万帕冷冷地回答。 “但你不是说你不想杀死我的吗？” “是的。” “可是你怎么又想让我饿死？” “那是另一回事了。” “那么，你们这些混蛋！”腾格拉尔喊道，“我决不会让你们的阴谋得逞！我情愿马上就死！你们可以拷打我、虐待我、杀死我，但你们再也得不到我的签字了！” “悉听尊便。”万帕说着就离开了地窖。 腾格拉尔狂怒地把自己往羊皮床上一搁。这些家伙是些什么人呢？那个躲在幕后的首领是谁呢？为什么旁人都可以出了赎金就释放，惟有他却不能这么办呢？噢，是的，这些残酷的敌人既然用这无法理解的手段来迫害他，那么，迅速的突然的死去，可算是一种报复他们的好方法。死？在腾格拉尔的一生中，这大概是他第一次带着恐惧和希望的矛盾想到死。这时，他的目光停留在一个毫不留情的幽灵身上，这个幽灵深藏在每个人的内心中，而且随着每次的心跳一遍遍地说道：“你要死了！” 腾格拉尔象一头被围捕的野兽。野兽在被追逐的时候，最初是飞逃，然后是绝望，最后，凭着绝望所刺激出来的力量，有时也能绝处逢生。腾格拉尔寻思着逃脱的方法，但四壁都是实心岩石，地窖惟一的出口处有一个人坐在那儿看书，那个人的后面还不断地有带枪的人经过。他那不签字的决心持续了两天，两天以后，他出了一百万买食物。他们送来一顿丰美的晚餐，拿走一百万法郎的支票。 从这时起，那不幸的囚犯干脆听天由命了。他已受了这样多的痛苦，他决定不让自己再受苦，什么要求他都肯答应了，在他象有钱的时候那样大吃大喝地享受了十二天以后，他算一算账，发觉他只剩下五万法郎了。于是这个囚犯发生了一种奇怪的反应。为了保住剩下的五万法郎。他宁愿再去受饥饿的折磨也不肯放弃那笔钱。有一线濒于疯狂的希望在他眼前闪烁。早就把上帝抛在脑后的他，这时又想起了上帝。上帝有时会创造奇迹的，教皇的巡官或许会发现这个该死的洞窟，把他释放出去，那时他就还可以用剩下五万法郎，保证他此后不致挨饿。他祈祷上帝让他保存这笔钱，他一面祈祷一面哭泣。三天就这样过去了，在这三天里面，即使他的心里并没有想到上帝，但他的嘴巴上总老是挂着上帝的名字。有时他神志昏迷，好象看见一个老人躺在一张破床上，那个老人也已饿得奄奄一息了。 到第四天，他已饿得不成人形而是一具活尸了。他捡完了以前进餐时掉在地上的每一颗面包屑，开始嚼起干草来了。 然后他恳求庇皮诺，象恳求一个守护神似的向他讨东西吃，他出一千法郎向他换一小块面包。但庇皮诺不理他。到第五天，他挣扎着摸到地窖的门口。 “你难道不是一个基督徒吗？”他支撑着起来说：“你们忍心看着一个在上帝面前与你同是兄弟的人死去吗？我的朋友，我当年的朋友呀！”他喃喃地说，脸贴到地上。然后他绝望地站起来，喊道，“首领！首领！” “我在这儿，”万帕立刻出现，说，“您想要什么？” “把我最后的一个金币拿去吧！”腾格拉尔递出他的皮夹，结结巴巴地说，“让我住在这个洞里吧。我不再要自由了，我只要求让我活下去！” “那么您真的感到痛苦了？” “哦，是的，是的，我痛苦极了！” “可是，还有人比您受过更大的痛苦。” “我不相信。” “有的，想想那些活活饿死的人。” 腾格拉尔想到了他在昏迷状态时所见的那个躺在床上呻吟的老人。他以额撞地，也呻吟起来。“是的，”他说，“虽有人比我痛苦，但他们至少是殉道而死的。” “你忏悔了吗？”一个庄严低沉的声音问道。腾格拉尔听了吓得头发根都直竖起来。他睁大衰弱的眼睛竭力想看清眼前的东西，在那强盗的后面，他看见一个人裹着披风站在石柱的影阴里。 “我忏悔什么呢？”腾格拉尔结结巴巴地说。 “忏悔你所做过的坏事。”那个声音说。 “噢，是的！我忏悔了！我忏悔了！”腾格拉尔说，他用他那瘦削的拳头捶着他的胸膛。 “那么我宽恕你。”那人说着就摔下他的披风，走到亮光里。 “基督山伯爵！”腾格拉尔说，饥饿和痛苦使他的脸色苍白，恐惧更使他面如土色了。 “你弄错了，我不是基督山伯爵！” “那末你是谁呢？” “我就是那个被你诬陷、出卖和污蔑的人。我的未婚妻被你害得过着屈辱的生活。我横遭你的践踏，被你作为升官发财的垫脚石，我的父亲被你害得活活饿死，——我本来也想让你死于饥饿。可是我宽恕了你，因为我也需要宽恕。我就是爱德蒙·唐太斯。” 腾格拉尔大叫一声，摔倒在地上缩成一团。 “起来吧，”伯爵说，“你的生命是安全的。你的那两个同伴可没有你这样幸运，一个疯了，一个死了。留着剩下的那五万法郎吧，我送给你了。你从医院里骗来的那五百万，已经送回给他们了。现在你可以好好地吃一顿。今天晚上你是我的客人。万帕，这个人吃饱以后，就把他放了。” 伯爵离开的时候腾格拉尔仍然倒在地上，当他抬起头来的时候，只看见一个人影在甬道里消失了，甬道两旁的强盗都对他鞠躬。万帕遵照伯爵的指示，款待了腾格拉尔一顿，让他享受意大利最好的酒和美食，然后，用他的马车带他离开，把他放在路上，他靠着一棵树干。在树下呆了一整夜，不知道自己身在何处。天亮的时候，他发现自己在一条小溪附近；他口渴了，踉踉跄跄地走到小溪边。当他俯下身来饮水的时候，他发现自己的头发已完全白了。","sourceLink":"http://novel.tingroom.com/jingdian/72/4031.html","bookId":545,"book":{"id":545,"title":"The Count of Monte Cristo基督山伯爵","description":"简介： 《基督山伯爵》是通俗历史小说，法国著名作家大仲马（1802-1870）的代表作。故事讲述19世纪法国皇帝拿破仑百日王朝时期，法老号大副爱德蒙唐泰斯受船长委托，为拿破仑党人送了一封信，遭到两个卑鄙小人和法官的陷害，被打入黑牢。狱友法利亚神甫向他传授各种知识，并在...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12865075139f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/72","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
