{"id":43911,"no":43,"title":"Chapter 47 The Dappled Grays","content":"THE BARON, followed by the count, traversed a long series of apartments, in which the prevailing characteristics were heavy magnificence and the gaudiness of ostentatious wealth, until he reached the boudoir of Madame Danglars--a small octagonal-shaped room, hung with pink satin, covered with white Indian muslin. The chairs were of ancient workmanship and materials; over the doors were painted sketches of shepherds and shepherdesses, after the style and manner of Boucher; and at each side pretty medallions in crayons, harmonizing well with the furnishings of this charming apartment, the only one throughout the great mansion in which any distinctive taste prevailed. The truth was, it had been entirely overlooked in the plan arranged and followed out by M. Danglars and his architect, who had been selected to aid the baron in the great work of improvement solely because he was the most fashionable and celebrated decorator of the day. The decorations of the boudoir had then been left entirely to Madame Danglars and Lucien Debray. M. Danglars, however, while possessing a great admiration for the antique, as it was understood during the time of the Directory, entertained the most sovereign contempt for the simple elegance of his wife\u0027s favorite sitting-room, where, by the way, he was never permitted to intrude, unless, indeed, he excused his own appearance by ushering in some more agreeable visitor than himself; and even then he had rather the air and manner of a person who was himself introduced, than that of being the presenter of another, his reception being cordial or frigid, in proportion as the person who accompanied him chanced to please or displease the baroness. \n Madame Danglars (who, although past the first bloom of youth, was still strikingly handsome) was now seated at the piano, a most elaborate piece of cabinet and inlaid work, while Lucien Debray, standing before a small work-table, was turning over the pages of an album. Lucien had found time, preparatory to the count\u0027s arrival, to relate many particulars respecting him to Madame Danglars. It will be remembered that Monte Cristo had made a lively impression on the minds of all the party assembled at the breakfast given by Albert de Morcerf; and although Debray was not in the habit of yielding to such feelings, he had never been able to shake off the powerful influence excited in his mind by the impressive look and manner of the count, consequently the description given by Lucien to the baroness bore the highly-colored tinge of his own heated imagination. Already excited by the wonderful stories related of the count by De Morcerf, it is no wonder that Madame Danglars eagerly listened to, and fully credited, all the additional circumstances detailed by Debray. This posing at the piano and over the album was only a little ruse adopted by way of precaution. A most gracious welcome and unusual smile were bestowed on M. Danglars; the count, in return for his gentlemanly bow, received a formal though graceful courtesy, while Lucien exchanged with the count a sort of distant recognition, and with Danglars a free and easy nod. \n \"Baroness,\" said Danglars, \"give me leave to present to you the Count of Monte Cristo, who has been most warmly recommended to me by my correspondents at Rome. I need but mention one fact to make all the ladies in Paris court his notice, and that is, that he has come to take up his abode in Paris for a year, during which brief period he proposes to spend six millions of money. That means balls, dinners, and lawn parties without end, in all of which I trust the count will remember us, as he may depend upon it we shall him, in our own humble entertainments.\" In spite of the gross flattery and coarseness of this address, Madame Danglars could not forbear gazing with considerable interest on a man capable of expending six millions in twelve months, and who had selected Paris for the scene of his princely extravagance. \"And when did you arrive here?\" inquired she. \n \"Yesterday morning, madame.\" \n \"Coming, as usual, I presume, from the extreme end of the globe? Pardon me--at least, such I have heard is your custom.\" \n \"Nay, madame. This time I have merely come from Cadiz.\" \n \"You have selected a most unfavorable moment for your first visit. Paris is a horrible place in summer. Balls, parties, and fetes are over; the Italian opera is in London; the French opera everywhere except in Paris. As for the Theatre Fran?ais, you know, of course, that it is nowhere. The only amusements left us are the indifferent races at the Champ de Mars and Satory. Do you propose entering any horses at either of these races, count?\" \n \"I shall do whatever they do at Paris, madame, if I have the good fortune to find some one who will initiate me into the prevalent ideas of amusement.\" \n \"Are you fond of horses, count?\" \n \"I have passed a considerable part of my life in the East, madame, and you are doubtless aware that the Orientals value only two things--the fine breeding of their horses and the beauty of their women.\" \n \"Nay, count,\" said the baroness, \"it would have been somewhat more gallant to have placed the ladies first.\" \n \"You see, madame, how rightly I spoke when I said I required a preceptor to guide me in all my sayings and doings here.\" At this instant the favorite attendant of Madame Danglars entered the boudoir; approaching her mistress, she spoke some words in an undertone. Madame Danglars turned very pale, then exclaimed,--\"I cannot believe it; the thing is impossible.\" \n \"I assure you, madame,\" replied the woman, \"it is as I have said.\" Turning impatiently towards her husband, Madame Danglars demanded, \"Is this true?\" \n \"Is what true, madame?\" inquired Danglars, visibly agitated. \n \"What my maid tells me.\" \n \"But what does she tell you?\" \n \"That when my coachman was about to harness the horses to my carriage, he discovered that they had been removed from the stables without his knowledge. I desire to know what is the meaning of this?\" \n \"Be kind enough, madame, to listen to me,\" said Danglars. \n \"Oh, yes; I will listen, monsieur, for I am most curious to hear what explanation you will give. These two gentlemen shall decide between us; but, first, I will state the case to them. Gentlemen,\" continued the baroness, \"among the ten horses in the stables of Baron Danglars, are two that belong exclusively to me--a pair of the handsomest and most spirited creatures to be found in Paris. But to you, at least, M. Debray, I need not give a further description, because to you my beautiful pair of dappled grays were well known. Well, I had promised Madame de Villefort the loan of my carriage to drive to-morrow to the Bois; but when my coachman goes to fetch the grays from the stables they are gone--positively gone. No doubt M. Danglars has sacrificed them to the selfish consideration of gaining some thousands of paltry francs. Oh, what a detestable crew they are, these mercenary speculators!\" \n \"Madame,\" replied Danglars, \"the horses were not sufficiently quiet for you; they were scarcely four years old, and they made me extremely uneasy on your account.\" \n \"Nonsense,\" retorted the baroness; \"you could not have entertained any alarm on the subject, because you are perfectly well aware that I have had for a month in my service the very best coachman in Paris. But, perhaps, you have disposed of the coachman as well as the horses?\" \n \"My dear love, pray do not say any more about them, and I promise you another pair exactly like them in appearance, only more quiet and steady.\" The baroness shrugged her shoulders with an air of ineffable contempt, while her husband, affecting not to observe this unconjugal gesture, turned towards Monte Cristo and said,--\"Upon my word, count, I am quite sorry not to have met you sooner. You are setting up an establishment, of course?\" \n \"Why, yes,\" replied the count. \n \"I should have liked to have made you the offer of these horses. I have almost given them away, as it is; but, as I before said, I was anxious to get rid of them upon any terms. They were only fit for a young man.\" \n \"I am much obliged by your kind intentions towards me,\" said Monte Cristo; \"but this morning I purchased a very excellent pair of carriage-horses, and I do not think they were dear. There they are. Come, M. Debray, you are a connoisseur, I believe, let me have your opinion upon them.\" As Debray walked towards the window, Danglars approached his wife. \"I could not tell you before others,\" said he in a low tone, \"the reason of my parting with the horses; but a most enormous price was offered me this morning for them. Some madman or fool, bent upon ruining himself as fast as he can, actually sent his steward to me to purchase them at any cost; and the fact is, I have gained 16,000 francs by the sale of them. Come, don\u0027t look so angry, and you shall have 4,000 francs of the money to do what you like with, and Eugénie shall have 2,000. There, what do you think now of the affair? Wasn\u0027t I right to part with the horses?\" Madame Danglars surveyed her husband with a look of withering contempt. \n \"Great heavens?\" suddenly exclaimed Debray. \n \"What is it?\" asked the baroness. \n \"I cannot be mistaken; there are your horses! The very animals we were speaking of, harnessed to the count\u0027s carriage!\" \n \"My dappled grays?\" demanded the baroness, springing to the window. \"\u0027Tis indeed they!\" said she. Danglars looked absolutely stupefied. \"How very singular,\" cried Monte Cristo with well-feigned astonishment. \n \"I cannot believe it,\" murmured the banker. Madame Danglars whispered a few words in the ear of Debray, who approached Monte Cristo, saying, \"The baroness wishes to know what you paid her husband for the horses.\" \n \"I scarcely know,\" replied the count; \"it was a little surprise prepared for me by my steward, and cost me--well, somewhere about 30,000 francs.\" Debray conveyed the count\u0027s reply to the baroness. Poor Danglars looked so crest-fallen and discomfited that Monte Cristo assumed a pitying air towards him. \"See,\" said the count, \"how very ungrateful women are. Your kind attention, in providing for the safety of the baroness by disposing of the horses, does not seem to have made the least impression on her. But so it is; a woman will often, from mere wilfulness, prefer that which is dangerous to that which is safe. Therefore, in my opinion, my dear baron, the best and easiest way is to leave them to their fancies, and allow them to act as they please, and then, if any mischief follows, why, at least, they have no one to blame but themselves.\" Danglars made no reply; he was occupied in anticipations of the coming scene between himself and the baroness, whose frowning brow, like that of Olympic Jove, predicted a storm. Debray, who perceived the gathering clouds, and felt no desire to witness the explosion of Madame Danglars\u0027 rage, suddenly recollected an appointment, which compelled him to take his leave; while Monte Cristo, unwilling by prolonging his stay to destroy the advantages he hoped to obtain, made a farewell bow and departed, leaving Danglars to endure the angry reproaches of his wife. \n \"Excellent,\" murmured Monte Cristo to himself, as he came away. \"All his gone according to my wishes. The domestic peace of this family is henceforth in my hands. Now, then, to play another master-stroke, by which I shall gain the heart of both husband and wife--delightful! Still,\" added he, \"amid all this, I have not yet been presented to Mademoiselle Eugénie Danglars, whose acquaintance I should have been glad to make. But,\" he went on with his peculiar smile, \"I am here in Paris, and have plenty of time before me--by and by will do for that.\" With these reflections he entered his carriage and returned home. Two hours afterwards, Madame Danglars received a most flattering epistle from the count, in which he entreated her to receive back her favorite \"dappled grays,\" protesting that he could not endure the idea of making his entry into the Parisian world of fashion with the knowledge that his splendid equipage had been obtained at the price of a lovely woman\u0027s regrets. The horses were sent back wearing the same harness she had seen on them in the morning; only, by the count\u0027s orders, in the centre of each rosette that adorned either side of their heads, had been fastened a large diamond. \n To Danglars Monte Cristo also wrote, requesting him to excuse the whimsical gift of a capricious millionaire, and to beg the baroness to pardon the Eastern fashion adopted in the return of the horses. \n During the evening, Monte Cristo quitted Paris for Auteuil, accompanied by Ali. The following day, about three o\u0027clock, a single blow struck on the gong summoned Ali to the presence of the count. \"Ali,\" observed his master, as the Nubian entered the chamber, \"you have frequently explained to me how more than commonly skilful you are in throwing the lasso, have you not?\" Ali drew himself up proudly, and then returned a sign in the affirmative. \"I thought I did not mistake. With your lasso you could stop an ox?\" Again Ali repeated his affirmative gesture. \"Or a tiger?\" Ali bowed his head in token of assent. \"A lion even?\" Ali sprung forwards, imitating the action of one throwing the lasso, then of a strangled lion. \n \"I understand,\" said Monte Cristo; \"you wish to tell me you have hunted the lion?\" Ali smiled with triumphant pride as he signified that he had indeed both chased and captured many lions. \"But do you believe you could arrest the progress of two horses rushing forwards with ungovernable fury?\" The Nubian smiled. \"It is well,\" said Monte Cristo. \"Then listen to me. Ere long a carriage will dash past here, drawn by the pair of dappled gray horses you saw me with yesterday; now, at the risk of your own life, you must manage to stop those horses before my door.\" \n Ali descended to the street, and marked a straight line on the pavement immediately at the entrance of the house, and then pointed out the line he had traced to the count, who was watching him. The count patted him gently on the shoulder, his usual mode of praising Ali, who, pleased and gratified with the commission assigned him, walked calmly towards a projecting stone forming the angle of the street and house, and, seating himself thereon, began to smoke his chibouque, while Monte Cristo re-entered his dwelling, perfectly assured of the success of his plan. Still, as five o\u0027clock approached, and the carriage was momentarily expected by the count, the indication of more than common impatience and uneasiness might be observed in his manner. He stationed himself in a room commanding a view of the street, pacing the chamber with restless steps, stopping merely to listen from time to time for the sound of approaching wheels, then to cast an anxious glance on Ali; but the regularity with which the Nubian puffed forth the smoke of his chibouque proved that he at least was wholly absorbed in the enjoyment of his favorite occupation. Suddenly a distant sound of rapidly advancing wheels was heard, and almost immediately a carriage appeared, drawn by a pair of wild, ungovernable horses, while the terrified coachman strove in vain to restrain their furious speed. \n In the vehicle was a young woman and a child of about seven or eight clasped in each other\u0027s arms. Terror seemed to have deprived them even of the power of uttering a cry. The carriage creaked and rattled as it flew over the rough stones, and the slightest obstacle under the wheels would have caused disaster; but it kept on in the middle of the road, and those who saw it pass uttered cries of terror. \n Ali suddenly cast aside his chibouque, drew the lasso from his pocket, threw it so skilfully as to catch the forelegs of the near horse in its triple fold, and suffered himself to be dragged on for a few steps by the violence of the shock, then the animal fell over on the pole, which snapped, and therefore prevented the other horse from pursuing its way. Gladly availing himself of this opportunity, the coachman leaped from his box; but Ali had promptly seized the nostrils of the second horse, and held them in his iron grasp, till the beast, snorting with pain, sunk beside his companion. All this was achieved in much less time than is occupied in the recital. The brief space had, however, been sufficient for a man, followed by a number of servants, to rush from the house before which the accident had occurred, and, as the coachman opened the door of the carriage, to take from it a lady who was convulsively grasping the cushions with one hand, while with the other she pressed to her bosom the young boy, who had lost consciousness. \n Monte Cristo carried them both to the salon, and deposited them on a sofa. \"Compose yourself, madame,\" said he; \"all danger is over.\" The woman looked up at these words, and, with a glance far more expressive than any entreaties could have been, pointed to her child, who still continued insensible. \"I understand the nature of your alarms, madame,\" said the count, carefully examining the child, \"but I assure you there is not the slightest occasion for uneasiness; your little charge has not received the least injury; his insensibility is merely the effects of terror, and will soon pass.\" \n \"Are you quite sure you do not say so to tranquillize my fears? See how deadly pale he is! My child, my darling Edward; speak to your mother--open your dear eyes and look on me once again! Oh, sir, in pity send for a physician; my whole fortune shall not be thought too much for the recovery of my boy.\" \n With a calm smile and a gentle wave of the hand, Monte Cristo signed to the distracted mother to lay aside her apprehensions; then, opening a casket that stood near, he drew forth a phial of Bohemian glass incrusted with gold, containing a liquid of the color of blood, of which he let fall a single drop on the child\u0027s lips. Scarcely had it reached them, ere the boy, though still pale as marble, opened his eyes, and eagerly gazed around him. At this, the delight of the mother was almost frantic. \"Where am I?\" exclaimed she; \"and to whom am I indebted for so happy a termination to my late dreadful alarm?\" \n \"Madame,\" answered the count, \"you are under the roof of one who esteems himself most fortunate in having been able to save you from a further continuance of your sufferings.\" \n \"My wretched curiosity has brought all this about,\" pursued the lady. \"All Paris rung with the praises of Madame Danglars\u0027 beautiful horses, and I had the folly to desire to know whether they really merited the high praise given to them.\" \n \"Is it possible,\" exclaimed the count with well-feigned astonishment, \"that these horses belong to the baroness?\" \n \"They do, indeed. May I inquire if you are acquainted with Madame Danglars?\" \n \"I have that honor; and my happiness at your escape from the danger that threatened you is redoubled by the consciousness that I have been the unwilling and the unintentional cause of all the peril you have incurred. I yesterday purchased these horses of the baron; but as the baroness evidently regretted parting with them, I ventured to send them back to her, with a request that she would gratify me by accepting them from my hands.\" \n \"You are, then, doubtless, the Count of Monte Cristo, of whom Hermine has talked to me so much?\" \n \"You have rightly guessed, madame,\" replied the count. \n \"And I am Madame Hélo?se de Villefort.\" The count bowed with the air of a person who hears a name for the first time. \"How grateful will M. de Villefort be for all your goodness; how thankfully will he acknowledge that to you alone he owes the existence of his wife and child! Most certainly, but for the prompt assistance of your intrepid servant, this dear child and myself must both have perished.\" \n \"Indeed, I still shudder at the fearful danger you were placed in.\" \n \"I trust you will allow me to recompense worthily the devotion of your man.\" \n \"I beseech you, madame,\" replied Monte Cristo \"not to spoil Ali, either by too great praise or rewards. I cannot allow him to acquire the habit of expecting to be recompensed for every trifling service he may render. Ali is my slave, and in saving your life he was but discharging his duty to me.\" \n \"Nay,\" interposed Madame de Villefort, on whom the authoritative style adopted by the count made a deep impression, \"nay, but consider that to preserve my life he has risked his own.\" \n \"His life, madame, belongs not to him; it is mine, in return for my having myself saved him from death.\" Madame de Villefort made no further reply; her mind was utterly absorbed in the contemplation of the person who, from the first instant she saw him, had made so powerful an impression on her. During the evident preoccupation of Madame de Villefort, Monte Cristo scrutinized the features and appearance of the boy she kept folded in her arms, lavishing on him the most tender endearments. The child was small for his age, and unnaturally pale. A mass of straight black hair, defying all attempts to train or curl it, fell over his projecting forehead, and hung down to his shoulders, giving increased vivacity to eyes already sparkling with a youthful love of mischief and fondness for every forbidden enjoyment. His mouth was large, and the lips, which had not yet regained their color, were particularly thin; in fact, the deep and crafty look, giving a predominant expression to the child\u0027s face, belonged rather to a boy of twelve or fourteen than to one so young. His first movement was to free himself by a violent push from the encircling arms of his mother, and to rush forward to the casket from whence the count had taken the phial of elixir; then, without asking permission of any one, he proceeded, in all the wilfulness of a spoiled child unaccustomed to restrain either whims or caprices, to pull the corks out of all the bottles. \n \"Touch nothing, my little friend,\" cried the count eagerly; \"some of those liquids are not only dangerous to taste, but even to inhale.\" \n Madame de Villefort became very pale, and, seizing her son\u0027s arm, drew him anxiously toward her; but, once satisfied of his safety, she also cast a brief but expressive glance on the casket, which was not lost upon the count. At this moment Ali entered. At sight of him Madame de Villefort uttered an expression of pleasure, and, holding the child still closer towards her, she said, \"Edward, dearest, do you see that good man? He has shown very great courage and resolution, for he exposed his own life to stop the horses that were running away with us, and would certainly have dashed the carriage to pieces. Thank him, then, my child, in your very best manner; for, had he not come to our aid, neither you nor I would have been alive to speak our thanks.\" The child stuck out his lips and turned away his head in a disdainful manner, saying, \"He\u0027s too ugly.\" \n The count smiled as if the child bade fair to realize his hopes, while Madame de Villefort reprimanded her son with a gentleness and moderation very far from conveying the least idea of a fault having been committed. \"This lady,\" said the Count, speaking to Ali in the Arabic language, \"is desirous that her son should thank you for saving both their lives; but the boy refuses, saying you are too ugly.\" Ali turned his intelligent countenance towards the boy, on whom he gazed without any apparent emotion; but the spasmodic working of the nostrils showed to the practiced eye of Monte Cristo that the Arab had been wounded to the heart. \n \"Will you permit me to inquire,\" said Madame de Villefort, as she arose to take her leave, \"whether you usually reside here?\" \n \"No, I do not,\" replied Monte Cristo; \"it is a small place I have purchased quite lately. My place of abode is No. 30, Avenue des Champs Elysées; but I see you have quite recovered from your fright, and are, no doubt, desirous of returning home. Anticipating your wishes, I have desired the same horses you came with to be put to one of my carriages, and Ali, he whom you think so very ugly,\" continued he, addressing the boy with a smiling air, \"will have the honor of driving you home, while your coachman remains here to attend to the necessary repairs of your calash. As soon as that important business is concluded, I will have a pair of my own horses harnessed to convey it direct to Madame Danglars.\" \n \"I dare not return with those dreadful horses,\" said Madame de Villefort. \n \"You will see,\" replied Monte Cristo, \"that they will be as different as possible in the hands of Ali. With him they will be gentle and docile as lambs.\" Ali had, indeed, given proof of this; for, approaching the animals, who had been got upon their legs with considerable difficulty, he rubbed their foreheads and nostrils with a sponge soaked in aromatic vinegar, and wiped off the sweat and foam that covered their mouths. Then, commencing a loud whistling noise, he rubbed them well all over their bodies for several minutes; then, undisturbed by the noisy crowd collected round the broken carriage, Ali quietly harnessed the pacified animals to the count\u0027s chariot, took the reins in his hands, and mounted the box, when to the utter astonishment of those who had witnessed the ungovernable spirit and maddened speed of the same horses, he was actually compelled to apply his whip in no very gentle manner before he could induce them to start; and even then all that could be obtained from the celebrated \"dappled grays,\" now changed into a couple of dull, sluggish, stupid brutes, was a slow, pottering pace, kept up with so much difficulty that Madame de Villefort was more than two hours returning to her residence in the Faubourg St. Honoré. \n Scarcely had the first congratulations upon her marvellous escape been gone through when she wrote the following letter to Madame Danglars:-- \n DEAR HERMINE,--I have just had a wonderful escape from the most imminent danger, and I owe my safety to the very Count of Monte Cristo we were talking about yesterday, but whom I little expected to see to-day. I remember how unmercifully I laughed at what I considered your eulogistic and exaggerated praises of him; but I have now ample cause to admit that your enthusiastic description of this wonderful man fell far short of his merits. Your horses got as far as Ranelagh, when they darted forward like mad things, and galloped away at so fearful a rate, that there seemed no other prospect for myself and my poor Edward but that of being dashed to pieces against the first object that impeded their progress, when a strange-looking man,--an Arab, a negro, or a Nubian, at least a black of some nation or other--at a signal from the count, whose domestic he is, suddenly seized and stopped the infuriated animals, even at the risk of being trampled to death himself; and certainly he must have had a most wonderful escape. The count then hastened to us, and took us into his house, where he speedily recalled my poor Edward to life. He sent us home in his own carriage. Yours will be returned to you to-morrow. You will find your horses in bad condition, from the results of this accident; they seem thoroughly stupefied, as if sulky and vexed at having been conquered by man. The count, however, his commissioned me to assure you that two or three days\u0027 rest, with plenty of barley for their sole food during that time, will bring them back to as fine, that is as terrifying, a condition as they were in yesterday. Adieu! I cannot return you many thanks for the drive of yesterday; but, after all, I ought not to blame you for the misconduct of your horses, more especially as it procured me the pleasure of an introduction to the Count of Monte Cristo,--and certainly that illustrious personage, apart from the millions he is said to be so very anxious to dispose of, seemed to me one of those curiously interesting problems I, for one, delight in solving at any risk, even if it were to necessitate another drive to the Bois behind your horses. Edward endured the accident with miraculous courage--he did not utter a single cry, but fell lifeless into my arms; nor did a tear fall from his eyes after it was over. I doubt not you will consider these praises the result of blind maternal affection, but there is a soul of iron in that delicate, fragile body. Valentine sends many affectionate remembrances to your dear Eugénie. I embrace you with all my heart. \n HéLO?SE DE VILLEFORT. \n P.S.--Do pray contrive some means for me to meet the Count of Monte Cristo at your house. I must and will see him again. I have just made M. de Villefort promise to call on him, and I hope the visit will be returned. \n 伯爵跟着男爵穿过许多房间，这些房间都布置得极其豪华，又俗不可耐，最后他们终于到了腾格拉尔夫人的会客室。 \n 那是一间八角形的小房间，挂着粉红色薄绫和白色印度麻纱门帘和窗帷。椅子的式样和质地都是古色古香的，门上画着布歇［布歇：专画乡土装饰画的法国画家。——译注］的牧童和牧女的风景画，门的两旁每边都钉着一张圆形的彩粉画，和房间里的陈设显得很协调。这座住宅的建筑师是当时最负盛名的人物，但这个房间的装饰却完全没有按照他和腾格拉尔先生的意见。腾格拉尔夫人会客室里的装饰和布置完全出于她自己和吕西安·德布雷的心意。腾格拉尔先生不喜欢他太太心爱的这间起居室，因为他非常倾心于督政府［法国资产阶级革命时代，皇室倾覆，根据一七九五年宪法成立立法团，组成督政府，在一七九五——一七九九年内，共有三届督政府执政，称为督政府时代。——译注］的好古风气，最瞧不起这种质朴高雅的布置，可是，这个地方并不是他可以随便闯进来的，他老想进来，非得陪着一位比他自己更受欢迎的客人来才行。所以实际上并不是腾格拉尔介绍客人，倒是客人介绍了他。而他所受到的接待是热情还是冷淡，则全看男爵夫人对陪他来的那个人的是喜欢还是厌恶的态度了。 \n 腾格拉尔这次进来的时候，看到男爵夫人（虽然她风华正茂的青春时代已过，但却依旧很美丽动人）正坐在那架镶嵌得极其精细的钢琴前面，而德布雷则站在一张小写字台前面，正在翻弄着一本纪念册。吕西安在伯爵未到之前已讲了许多有关他这个人一些奇特的事给腾格拉尔夫人听了。读者还记得吧，在阿尔贝·马尔塞夫的早餐席上，基督山已在全体来宾的脑海里留下了一个生动深刻的印象。德布雷虽然不是一个易于受感动的人，但那个印象却一直留在他的脑子里久久不去，他对男爵夫人讲伯爵的事，就是根据那个印象来叙述的。腾格拉尔夫人已经听马尔塞夫详详细地讲过，现在又经吕西安这么一说，便极大地引起了她的好奇心。钢琴和纪念册是社交上的一种欺骗手段，借此可以掩饰一下他们的注意力。腾格拉尔蒙赐到了一个最和蔼难得的微笑；伯爵则一派绅士风度地微微欠身，文雅地行礼致意；吕西安和伯爵客气的打了个招呼，面对腾格拉尔只随随便便地点了点头。 \n “男爵夫人，”腾格拉尔说道，“允许我介绍您认识基督山伯爵，他是由我罗马的往来银行热忱地介绍给我的。我只得提到一件事实就可以使全巴黎的贵妇们都以认识他为荣，他准备到巴黎来住一年，并准备在那期间花掉六百万。这就等于说要举行很多次舞会，庆祝宴，大请客和野餐，在这一切热闹的场合中，我相信伯爵阁下一定不会忘记我们的，正如他可以相信我们在举行大小宴会时一定不会忘记他一样。” \n 这一番恭维话虽然说得粗俗，但腾格拉尔夫人对于一个能在十二个月里花上六百万而且选中巴黎作为他如此挥霍的地方的人，也禁不住很感兴趣地盯着他看了看。“您是什么时候到这儿的？”她问道。 \n “昨天早晨，夫人。” \n “我想，大概也象往常一样，是从地球的尽头来的吧？请原谅，我听说您老是喜欢这样做的。” \n “不，夫人！这一次我只是从卡迪斯来。” \n “您第一次来访问我们的都市，选的时间太不凑巧了。夏季的巴黎是一个可怕的地方！舞会，宴会，庆祝宴都过时了。意大利歌剧团现在在伦敦，法国歌剧团到处都有，就是巴黎没有。至于法兰西戏院，您当然知道，那是根本不值一看的。我们现在唯一的娱乐，只是马尔斯跑马场和萨陀莱跑马场的几次赛马。你准备出几匹马去参加比赛，伯爵阁下？” \n “我，夫人，不论巴黎人干什么事都愿意参加，假如我的运气好，能找到一个人把法国的各种风俗习惯都告诉我的话。” \n “您喜欢吗，伯爵阁下？” \n “夫人，我生命中的一部分光阴是在东方度过的，而您一定知道，那些地方的居民只看重两样东西——名马和美人。” \n “啊，伯爵阁下，”男爵夫人说道，“假如把女人放在前面，那就更能讨好太太们了。” \n “您瞧，夫人，我刚才不是还说需要一位老师来指导我学习法国的风俗习惯吗？我说得多正确啊。” \n 这时，腾格拉尔夫人所宠爱的侍女走进房间里来，她走到女主人的身边，低声说了几句话。腾格拉尔夫人的脸色立刻变得煞白，她大声说道：“我不相信，这是不可能的。” \n “我发誓，夫人，”那侍女答道‘我这是千真万确的。” \n 于是腾格拉尔夫人急忙转过去问她的丈夫：‘是真的吗？” \n “真的什么，夫人？”腾格拉尔显然很着急地问道。 \n “我的女仆告诉我的那件事。” \n “她告诉了你什么？” \n “就是当我的马夫正要去给我备车的时候，却发觉那两匹马已不在马厩里了，他事先一点都不知道。我很想知道这究竟是怎么回事？” \n “请夫人息怒，且听我说。” \n “噢！我听着呢，我倒很想知道你要对我说些什么。这两位先生可以做我们的见证人，但我得先把这事讲给他们听听。 \n 二位，”男爵夫人继续说道，“腾格拉尔男爵阁下的马厩里共有十匹马，其中有两匹是专归我用的，那是全巴黎最漂亮最英俊的两匹马了。至少对您，德布雷先生，我是不必多加形容的，因为您对于我那两匹美丽的灰斑马是非常熟悉的。嘿！正当我已经完全应了维尔福夫人明天把我的马车借给她到布洛涅森林去的时候，一看，那两匹马却不见了。一定是腾格拉尔先生为能在这笔交易中赚上几千法朗而把它们给卖了。噢，投机家是多么卑鄙下贱啊。” \n “夫人，”腾格拉尔回答说，“那两匹马给你用实在是不安全，它们还不到四岁，它们使我很替你担心。” \n “呃！”男爵夫人反驳道，“你知道得很清楚，上个月我已经雇用了一个巴黎最能干的车夫，你不见得把他和马一起卖了吧？” \n “宝贝，我答应给你买两匹和它们一样——要是可能的话，买两匹更漂亮的——但总之要比它们安稳些的。” \n 男爵夫人以一种极轻蔑的神色耸了耸肩膀，她的丈夫假装没有看见，转过身来对基督山说道：“说实话，伯爵阁下，我很遗憾没有早点知道您准备到巴黎来久住。” \n “为什么？”伯爵问道。 \n “因为我很高兴是把那两匹马卖给您的，我几乎是按原价让给人家的。但是，我已经说过，我急于想摆脱掉它们。它们只有给象您这样的年轻人用比较合适。” \n “阁下，”伯爵说道：‘谢谢您，今天早晨我也买了两匹非常出色的马，相当好，而且不太贵，就停在那儿。来，德布雷先生，我想您是位鉴赏家，让我来听听您对它们的看法吧。” \n 当德布雷向窗口走去的时候，腾格拉尔走近他的妻子身边。“我在外人面前不便告诉你卖掉那两匹马的理由，”他低声说道：“但今天早晨有人出极高的价来向我买。他不是个疯子就是个傻瓜，大概是唯恐倾家荡产得不够快吧，竟派他的管家来，无论如何要向我买那两匹马，结果，我从那笔买卖上赚了一万六千法郎。好了，别再生气了，你可以从中分到四千，这笔钱随便你怎么花，瓦朗蒂娜也可以分到两千。”腾格拉尔夫人轻蔑地瞟了她丈夫一眼，但神色已没有刚才那么严厉了。 \n “啊！我的天！我看到了什么？”德布雷突然喊道。 \n “什么事？”男爵夫人问道。 \n “我没看错，那不正是您的马吗！就是我们刚才所说的那两匹，配在伯爵的车子上了！” \n “我的灰斑马？”男爵夫人大喊了一声，就奔到了窗前。“正是它们！”她说道。腾格拉尔一下子呆住了。 \n “竟会有这样的事吗？”基督山问道，故意装出很惊讶的样子。 \n 腾格拉尔夫人在德布雷的耳边低声说了几句什么，德布雷就走过来向基督山：“男爵夫人想知道您为了那两匹马付了多少钱给她的丈夫？” \n “我也不大清楚，”伯爵答道，“这是我的管家经手的，他是想使我吃一惊的。我想，大概三万法郎左右吧。” \n 德布雷把伯爵的答话转达给了男爵夫人。腾格拉尔此时的神色简直沮丧和狼狈极了。基督山装出一种怜悯的神情。 \n “瞧，”他说道，“女人真是不知好歹呀！您好心好意地为男爵夫人的安全着想才弄掉了那两匹马，可她似乎一点都不理解您的好意。这也没办法，女人往往容易任性而不顾安全，自愿去冒危险。依我看，亲爱的男爵，最好和最方便的办法还是让她们去随心所欲吧，她们爱怎么着就怎么着吧，那样，要是发生了什么不幸的事，至少，她们没法怨别人而只能怪自己啦。” \n 腾格拉尔虽没有回答，但他心里已经预感到自己将和男爵夫人大闹一场的，男爵夫人这时怒气冲冲的，眉头紧锁，象奥林匹斯山上的众神之王，这预示着一场暴风雨就要到来了。 \n 德布雷看看势头不妙，他不愿目睹腾格拉尔夫人的盛怒爆发，就推辞说有事要办，告辞了。而基督山也不愿再多耽误时间了，那样怕破坏他所希望得到的效果，便鞠了一躬，也告辞了，只剩腾格拉尔一个人去受他妻子的怒骂了。 \n “妙极了！”基督山一边向他的马车走去，一边心里说道“一切都如我的所愿。这一家的安宁从此以后就掌握在我手里了。现在，我要再施个妙计，把他们夫妇两人的心都赢过来，这真太有趣了！不过，”他又说道，“这次会面中，还没有把我介绍给瓦朗蒂娜·腾格拉尔小姐，我倒很高兴认识一下她。但没关系，”他带着他那种奇特的微笑继续说道，“将来总会认识她的。我已经打下了基础，时间还很充呢。伯爵这样想着跨进了他的马车，回到了家里。两小时之后，腾格拉尔夫人收到了一封动人心弦的信，信是伯爵写来的，信里说明决不愿意在刚刚踏入巴黎的社交界时就使一位可爱的女人生气。把那两匹马送回来了，原封动地套它们早晨时的鞍具，但在马头上所戴的每一朵玫瑰花结的中央，都已按伯爵吩咐镶上了一颗颗钻石。 \n 基督山还写了一封信给腾格拉尔，请他收下一位怪富翁所送的这种怪礼物，并请男爵夫人原谅他以这种东方方式的礼仪送还她的马。 \n 当在傍晚，基督山由阿里陪着离开巴黎到欧特伊去了。第二天下午三点钟左右，铜锣一响，阿里被召到了伯爵的面前。 \n “阿里，”那黑奴一走进房间，他的主人做说道，“你以前常常对我说，你很擅长套马。” \n 阿里骄傲地挺直了身子，做了一个肯定的回答。 \n “好极了。你能套住一头牛吗？” \n 阿里又作了一个肯定的手势。 \n “一只老虎呢？” \n 阿里点头表示能行。 \n “一只狮子呢？” \n 阿里作了一个抛绳索的动作，然后模仿绳索勒紧的声音。 \n “但你自信能套住两匹狂奔的马吗？” \n 那黑奴笑了。 \n “很好，”基督山说道。“待会儿有一辆马车要经过这儿，拉车的是两匹灰色有斑纹的马，就是昨天你看见我用的那一对，现在，你必须冒着生命的危险，在我的门前拉住那两匹马。” \n 阿里走到街上，在门前的走道上划了一条直线，然后他回来把那条线指给在一旁的伯爵看。伯爵轻轻地拍了拍他的肩膀，他总是用这种特有的方式来称赞阿里的，阿里很喜欢这项差使，他镇定地走到房子和街道相接的拐角上，在一块界石上坐下来，开始抽他的长筒烟，而基督山则回到了屋里，不再管这件事了。快到五点钟的时候，伯爵显出异常的焦躁和不安，原来他算定那辆马车马上就要到了。他走进一间面对着街道的房间，不安地在房间里踱来踱去，时不时地站住听听有没有车轮渐近的声音，然后用焦急的目光看看阿里，但见那黑奴依然含着他的长筒烟悠闲地在吞云吐雾，这至少证明他是正全神贯注地享受他心爱的玩意儿。突然间，他隐约听到了车轮急速滚动的声音，立刻一辆马车出现了，拉车的那一对马已野性大发，简直无法控制，只见它们拚命地向前冲，象是有魔鬼在驱赶着它们一样，那吓呆了的车夫竭力想控制住它们，但没有用。 \n 马车里有一个少妇和一个年约七八岁的孩子。他们吓得连喊都喊不出来了，两人紧紧地搂在一起，象是决定至死都不分开似的。马车喀啦啦地叫着在粗糙的石头路上飞奔着，要是它在路上遇到了一点儿障碍，就一定会翻车的。它在街中央飞奔着，凡是看到它过来的人都发出了惊恐的喊叫声。 \n 陡然地，阿里放下了他的长筒烟，从口袋里抽出了绳索，巧妙地一抛，那绳圈就套在了离他较近的那匹马的前蹄，然后忍痛让自己被马向前拖了几步，在这几步的时间里，那条巧妙地投出去的绳索已逐渐收紧，终于把那匹狂怒的马的两脚完全拴住了，使它跌倒在地上，这匹马跌到了车辕上，折断了车辕，使另外那匹马也无法再向前跑了。车夫利用这个机会急忙从他的座位上跳下来，但阿里这时已敏捷地抓住了第二匹马的鼻孔，用他的铁腕死命的抓住不放，直到那头发疯的牲畜痛苦地喷着气，软瘫在它的同伴旁边。这整个的过程还没有我们现在讲话的时间长。但就在这短暂的时间内，一个人带着几年仆人从屋子里冲出来，奔到了出事地点。当车夫打开车门的时候，这个人就帮忙把那个少妇抱了下来，这位太太此时仍一只手痉挛地抓住椅垫，一手紧紧地把她的儿子搂在她怀里。那小孩子已吓晕了过去，基督山把他们都抱进客厅里，放在一张沙发上。“放心吧，夫人，”他说道，“一切危险都已经过去了。” \n 那女人听到这几句话，就抬起头来，带着恳求的目光，指了指她那依旧昏迷不醒的孩子。 \n “我明白您的意思，夫人，”伯爵说道，并仔细把那孩子检查了一遍，“我向您担保，您丝毫不必担心，您的小宝贝一点也没有受伤，他只是吓昏了，一会儿就会好的。” \n “您这样说只是想安慰我是吗？瞧他的脸色多白！我的孩子！我的爱德华！对妈妈说话呀！啊，阁下，快去请一位医生来吧！要能救活我的儿子，我愿意把全部家产都送给他！” \n 基督山向那惊恐万状的母亲示意，请她不必担心，然后他打开放在旁边的一个小箱子，从箱子里抽出了一只波希米亚出产的玻璃瓶，瓶子里装着一种红色的液体，他把那种液体滴了一滴到那孩子的嘴唇上，药水刚刚滴到嘴唇上，那孩子，虽然脸色依旧很苍白，却睁开了眼睛，急切地向四周看了看。看到这种情形，那母亲简直高兴得发昏了。“我这是在什么地方呀？”她大声说道，“谁使我们这样大难不死，这样走运啊？” \n “夫人，”伯爵答道，“我能把您从危难中救出来，自觉极其荣幸，您现在就在敝舍。” \n “这件事都怪我的好奇心作恶，”那贵妇人说道。“全巴黎的人都称赞腾格拉尔夫人的马长得漂亮，而我也太傻了，居然试试它们。” \n “难道，”伯爵故意装出很惊奇的神色大声说道，“这两匹马是男爵夫人的？” \n “是的，阁下，您认识她吧？” \n “腾格拉尔夫人吗？我认识的，现在对于您能脱险我的确更觉得高兴了，我想不到您这次遭险竟是我无意中造成的。昨天我向男爵买了这两匹马，但由于男爵夫人很后悔把它们卖掉，所以我就冒昧地送还给了她，算是我的一件礼物，请她赏光收下。” \n “咦，那么说您就是基督山伯爵了，爱米姆对我讲过许多关于您的事呢！” \n “是的，夫人。”伯爵说道。 \n “我是爱洛伊丝·维尔福夫人。”伯爵鞠了一躬，看起来他象是第一次听到这个名字似的。“您的义举，维尔福先生将会感激不尽的，当他知道是您救了他妻子和孩子的性命，他会多么地感谢您呀！真的，要不是您那个勇敢的仆人及时赶来搭救，这可爱的孩子和我必死无疑啦。” \n “真的，想到您刚才的危险，我现在还有点后怕呢。” \n “噢，我希望您允许我适当地回报一下那个忠诚勇敢的人。” \n “夫人，”基督山答话，“我求您别宠坏了阿里，别给他太多的称赞和报酬。我不能让他养成每次出点力就希望能得到回报的这种习惯。阿里是我的奴隶，他救了你们的性命只是在为我效劳，而为我效劳是他的职责。” \n “但他是冒着生命危险的呀！”维尔福夫人说道，伯爵这种威严的态度给她留下了一个很深的印象。 \n “夫人，他的生命，不是他的的，而是属于我的，因为我曾亲自教过他的命。”维尔福夫人不出声了，也许她在寻思，为什么这个奇人初次见面就能给她留下这样深刻的一个印象。在这短暂的沉默期间，基督山以一种极亲切的神色仔细地观察着那蜷伏在她怀里的孩子，观察着他的体貌。那个孩子长得很瘦弱脸色特别苍白。头发直而黑，虽然曾烫过但还是鬈曲不起来，有一大绺头发从他那凸出的前额上挂下来，直垂到他的肩头，那一双充满了狡猾阴险和顽皮执拗的眼睛显得十分机灵活泼。他的嘴巴很宽大，嘴唇极薄，还没有恢复血色；从这孩子的脸上，一眼就可以看出他的个性深沉而诡谲，他的相貌很象是一个十三四岁的孩子，而不象个八岁的孩子。他醒来的第一个动作是猛地一下子挣脱了他母亲的怀抱，向伯爵装救命良药的那只小箱子冲过去然后，在没得到任何人的许可下，开始把药瓶的塞子一个个地拨出来，这充分显示出他是一个从不受约束的、怪癖任性的、被宠坏了的孩子。 \n “别碰这些东西，我的小朋友，”伯爵急忙说道，“有些药水不但不能尝，就是闻一闻也是很危险的哪。” \n 维尔福夫人的脸色陡变，抓住她儿子的胳膊，把他拉到自己身边，看到他没出事，她自己也向那只小箱子瞟了一眼，这一眼虽短，却意味深长，当然没有逃过伯爵的慧眼。这时，阿里走了进来。一看到他，维尔福夫人脸上立刻露出一种兴奋的表情，并把那孩子搂得更紧了一点，说道：“爱德华，你看到那个好人了吗？这个人刚才非常勇敢，刚才拉车的那两匹马发了疯，差一点把车子撞得粉碎，是他冒着生命危险拖住了它们。快谢谢他吧，我的孩子，要是没有他，我们俩可都没命了。” \n 那孩子撅起了嘴唇，以一种厌恶和藐视的态度转过头去说道：“他长得太丑了！”伯爵看到这种情形心里感到很满意，当他想到这个小孩子也可以使他的一部分计划有希望实现的时候，一个微笑偷偷地爬上了他的脸；维尔福夫人对儿子叱责了几句，但非常温和，谁看了都知道不会起什么作用。 \n “这位太太，”伯爵用阿拉伯语对阿里说道，“因为你救了他们的命，想叫她的儿子谢谢你，但那孩子不干，说你长得太丑了！” \n 阿里把他那聪明的脑袋转向那孩子，毫无表情地看了他一眼，他的鼻孔在痉挛般地一张一缩，基督山知道那句不知好歹的话已使那个阿拉伯人的自尊心受到了伤害。 \n “恕我冒昧地问一句，”维尔福夫人站起来准备告别的时候说道，“您经常住在这儿吗？” \n “不，夫人，”基督山答道，“这是新近买的一个小地方——我的寓所在香榭丽舍大道三十号，我看您已经复原了，您一定是想回家了吧。我已吩咐把那两匹拉您来的马套在了我的车子上，并叫阿里，也就是你认为长得太丑的那个人，”他面带微笑对那孩子说道，“赶车送你们回家，而您的车夫则暂时留在这儿，照料修理您的车子。车子修好以后，我会用我自己的马直接送回给腾格拉尔夫人的。” \n “可我不敢再用那两匹可怕的马拉我回去了。”维尔福夫人说道。 \n “您一会儿就会知道的，”基督山答道，“一到阿里的手里，它们就象羔羊一样驯服的。” \n 阿里的确证明了这一点。他走近那两匹被人费了很大的劲才扶起来的马，用浸过香油的海绵擦了擦它们那满是汗和白沫的前额与鼻孔，于是它们几乎立刻就呼噜呼噜地喘起粗气来，并且浑身不停地颤抖了几秒钟。然后，也不管那围观在马车周围的人群多么嘈杂，阿里静静地把那两匹驯服了的马套到了伯爵的四轮轻便马车上，把缰绳握在了手里，爬上了车头的座位，然后他“罗！”地喊了一声。使围观者极其惊讶的是：他们刚才还目睹这两匹马发疯般狂奔，倔强难治，但现在阿里却得用他的鞭子不客气地抽打几下它们才肯向前迈步。踯躅而行，这两匹有名的灰斑马现在变得迟钝愚笨，死气沉沉的了，它们走得是这样的艰难，以致维尔福夫人花了两个钟头才回到了圣·粤诺路她的家里。 \n 她一到家，在家人的一阵惊叹平息之后，立刻写了下面这封信给腾格拉尔夫人：“亲爱的爱米娜：我刚才从九死一生的危险中奇迹般地逃了出来，这全得归功于我们昨天所谈到的那位基督山伯爵但我决想不到今天会看见他我记得当你称赞他的时候，我曾怎样无情地加以嘲笑，觉得你的话太夸张了，可是现在我却有充分的理由来相信：你对于这位奇人的描写虽然热情，但对于他的优点说的却远远不够。我一定竭力把我的这次奇遇讲得清楚一点。你必须知道，我亲爱的朋友，当我驾着你的马跑到达兰拉大街的时候，它们突然象发了疯似的向前直冲，以致只要有什么东西在前面挡住它们的去路，我和我那可怜的爱德华一定会撞得粉身碎骨，当时我觉得一切都完了，突然一个相貌古怪的人，或者说一个阿拉伯人或努比亚人，总之，是一个黑人，在伯爵的一个手势之下（他原是伯爵的仆人），突然上前来抓住了那匹暴怒的马，甚至冒着他自己被踩死的危险，使之免于死，实在是一个真正的奇迹。那时，伯爵急忙跑出来，把我们带到了他的家里，用一种奇妙的药水迅速地救活了我那可怜的爱德华（他当时已吓昏了）。当我们已完全恢复过来的时候，他又用自己的马车送我们回了家。你的马车明天还你。我恐怕你得有好几天不能用你的马了，因为它们好象是变呆了，象是极不高兴让那个黑人来驯服它们似的但伯爵委托我向你保证，只要让它们休息两三天，在那期间，多给它们吃点大麦，而且以大麦为唯一的饲料，它们就会象昨天一样活蹦乱跳的，也就是说，象昨天一样的可怕。再见了！我不想为今天这次驱车出游多谢你了，但我也不应该因为你的马不好而来怪你，尤其是因这事使我认识了基督山伯爵，我觉得这位显赫的人物，除了他拥有百万资财以外，实在是一个非常奥妙，非常耐人寻味的迷，我打算不惜一切来解开这个谜，假如必要的话，即使冒险再让你的马来拖一次也在所不惜。爱德华在这次事件中表现得非常勇敢。他一声都没哭，只是晕了过去，事后，也不曾掉一滴眼泪。你或许仍旧要说我的母爱使我盲目了，但他是这样的脆弱，这样的娇嫩，确有着坚强的意志。瓦朗蒂娜时常念叨你们可爱的欧热妮，托我向她致意，祝她和你安好！我依旧是你永远真诚的——爱洛伊丝·维尔福又及：务请设法使我在你府上见见基督山伯爵。我必须再见他一次，我刚才已劝服维尔福先生去拜访他，希望他会来回访。” \n 当天晚上欧特伊的那件奇事成了众人谈话的主题。阿尔贝把它讲给他的母亲听，夏多·勒诺在骑士俱乐部把它当作了谈话的资料，而德布雷则在部长的客厅里长篇大论地详详细细把它叙述了一遍，波尚也在他的报纸上用了二十行的篇幅恭维了一番伯爵的勇敢和豪侠，使他在法国全体贵族女子的眼里变成了一位英雄。许多人到维尔福夫人的府上来留下了他们的名片，说他们会在适当的时机再来拜访，以便听她亲口详述这一件传奇式的奇遇。正如爱洛伊丝所说的，维尔福先生穿上一套黑礼服，戴上了一副白手套，带上最漂亮的仆人，驱车直奔伯爵府而去，于当天傍晚到达了香榭丽舍大街三十号房子门前。 \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/72/3966.html","bookId":545,"book":{"id":545,"title":"The Count of Monte Cristo基督山伯爵","description":"简介： 《基督山伯爵》是通俗历史小说，法国著名作家大仲马（1802-1870）的代表作。故事讲述19世纪法国皇帝拿破仑百日王朝时期，法老号大副爱德蒙唐泰斯受船长委托，为拿破仑党人送了一封信，遭到两个卑鄙小人和法官的陷害，被打入黑牢。狱友法利亚神甫向他传授各种知识，并在...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12865075139f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/72","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
