{"id":43912,"no":44,"title":"Chapter 48 Ideology","content":"IF THE COUNT of Monte Cristo had been for a long time familiar with the ways of Parisian society, he would have appreciated better the significance of the step which M. de Villefort had taken. Standing well at court, whether the king regnant was of the older or younger branch, whether the government was doctrinaire liberal, or conservative; looked upon by all as a man of talent, since those who have never experienced a political check are generally so regarded; hated by many, but warmly supported by others, without being really liked by anybody, M. de Villefort held a high position in the magistracy, and maintained his eminence like a Harlay or a Molé. His drawing-room, under the regenerating influence of a young wife and a daughter by his first marriage, scarcely eighteen, was still one of the well-regulated Paris salons where the worship of traditional customs and the observance of rigid etiquette were carefully maintained. A freezing politeness, a strict fidelity to government principles, a profound contempt for theories and theorists, a deep-seated hatred of ideality,--these were the elements of private and public life displayed by M. de Villefort. \\n\\n He was not only a magistrate, he was almost a diplomatist. His relations with the former court, of which he always spoke with dignity and respect, made him respected by the new one, and he knew so many things, that not only was he always carefully considered, but sometimes consulted. Perhaps this would not have been so had it been possible to get rid of M. de Villefort; but, like the feudal barons who rebelled against their sovereign, he dwelt in an impregnable fortress. This fortress was his post as king\u0027s attorney, all the advantages of which he exploited with marvellous skill, and which he would not have resigned but to be made deputy, and thus to replace neutrality by opposition. Ordinarily M. de Villefort made and returned very few visits. His wife visited for him, and this was the received thing in the world, where the weighty and multifarious occupations of the magistrate were accepted as an excuse for what was really only calculated pride, a manifestation of professed superiority--in fact, the application of the axiom, \"Pretend to think well of yourself, and the world will think well of you,\" an axiom a hundred times more useful in society nowadays than that of the Greeks, \"Know thyself,\" a knowledge for which, in our days, we have substituted the less difficult and more advantageous science of knowing others. \\n\\n To his friends M. de Villefort was a powerful protector; to his enemies, he was a silent, but bitter opponent; for those who were neither the one nor the other, he was a statue of the law-made man. He had a haughty bearing, a look either steady and impenetrable or insolently piercing and inquisitorial. Four successive revolutions had built and cemented the pedestal upon which his fortune was based. M. de Villefort had the reputation of being the least curious and the least wearisome man in France. He gave a ball every year, at which he appeared for a quarter of an hour only,--that is to say, five and forty minutes less than the king is visible at his balls. He was never seen at the theatres, at concerts, or in any place of public resort. Occasionally, but seldom, he played at whist, and then care was taken to select partners worthy of him--sometimes they were ambassadors, sometimes archbishops, or sometimes a prince, or a president, or some dowager duchess. Such was the man whose carriage had just now stopped before the Count of Monte Cristo\u0027s door. The valet de chambre announced M. de Villefort at the moment when the count, leaning over a large table, was tracing on a map the route from St. Petersburg to China. \\n\\n The procureur entered with the same grave and measured step he would have employed in entering a court of justice. He was the same man, or rather the development of the same man, whom we have heretofore seen as assistant attorney at Marseilles. Nature, according to her way, had made no deviation in the path he had marked out for himself. From being slender he had now become meagre; once pale, he was now yellow; his deep-set eyes were hollow, and the gold spectacles shielding his eyes seemed to be an integral portion of his face. He dressed entirely in black, with the exception of his white tie, and his funeral appearance was only mitigated by the slight line of red ribbon which passed almost imperceptibly through his button-hole, and appeared like a streak of blood traced with a delicate brush. Although master of himself, Monte Cristo, scrutinized with irrepressible curiosity the magistrate whose salute he returned, and who, distrustful by habit, and especially incredulous as to social prodigies, was much more dispised to look upon \"the noble stranger,\" as Monte Cristo was already called, as an adventurer in search of new fields, or an escaped criminal, rather than as a prince of the Holy See, or a sultan of the Thousand and One Nights. \\n\\n \"Sir,\" said Villefort, in the squeaky tone assumed by magistrates in their oratorical periods, and of which they cannot, or will not, divest themselves in society, \"sir, the signal service which you yesterday rendered to my wife and son has made it a duty for me to offer you my thanks. I have come, therefore, to discharge this duty, and to express to you my overwhelming gratitude.\" And as he said this, the \"eye severe\" of the magistrate had lost nothing of its habitual arrogance. He spoke in a voice of the procureur-general, with the rigid inflexibility of neck and shoulders which caused his flatterers to say (as we have before observed) that he was the living statue of the law. \\n\\n \"Monsieur,\" replied the count, with a chilling air, \"I am very happy to have been the means of preserving a son to his mother, for they say that the sentiment of maternity is the most holy of all; and the good fortune which occurred to me, monsieur, might have enabled you to dispense with a duty which, in its discharge, confers an undoubtedly great honor; for I am aware that M. de Villefort is not usually lavish of the favor which he now bestows on me,--a favor which, however estimable, is unequal to the satisfaction which I have in my own consciousness.\" Villefort, astonished at this reply, which he by no means expected, started like a soldier who feels the blow levelled at him over the armor he wears, and a curl of his disdainful lip indicated that from that moment he noted in the tablets of his brain that the Count of Monte Cristo was by no means a highly bred gentleman. He glanced around. in order to seize on something on which the conversation might turn, and seemed to fall easily on a topic. He saw the map which Monte Cristo had been examining when he entered, and said, \"You seem geographically engaged, sir? It is a rich study for you, who, as I learn, have seen as many lands as are delineated on this map.\" \\n\\n \"Yes, sir,\" replied the count; \"l have sought to make of the human race, taken in the mass, what you practice every day on individuals--a physiological study. I have believed it was much easier to descend from the whole to a part than to ascend from a part to the whole. It is an algebraic axiom, which makes us proceed from a known to an unknown quantity, and not from an unknown to a known; but sit down, sir, I beg of you.\" \\n\\n Monte Cristo pointed to a chair, which the procureur was obliged to take the trouble to move forwards himself, while the count merely fell back into his own, on which he had been kneeling when M. Villefort entered. Thus the count was halfway turned towards his visitor, having his back towards the window, his elbow resting on the geographical chart which furnished the theme of conversation for the moment,--a conversation which assumed, as in the case of the interviews with Danglars and Morcerf, a turn analogous to the persons, if not to the situation. \"Ah, you philosophize,\" replied Villefort, after a moment\u0027s silence, during which, like a wrestler who encounters a powerful opponent, he took breath; \"well, sir, really, if, like you, I had nothing else to do, I should seek a more amusing occupation.\" \\n\\n \"Why, in truth, sir,\" was Monte Cristo\u0027s reply, \"man is but an ugly caterpillar for him who studies him through a solar microscope; but you said, I think, that I had nothing else to do. Now, really, let me ask, sir, have you?--do you believe you have anything to do? or to speak in plain terms, do you really think that what you do deserves being called anything?\" \\n\\n Villefort\u0027s astonishment redoubled at this second thrust so forcibly made by his strange adversary. It was a long time since the magistrate had heard a paradox so strong, or rather, to say the truth more exactly, it was the first time he had ever heard of it. The procureur exerted himself to reply. \"Sir,\" he responded, \"you are a stranger, and I believe you say yourself that a portion of your life has been spent in Oriental countries, so you are not aware how human justice, so expeditions in barbarous countries, takes with us a prudent and well-studied course.\" \\n\\n \"Oh, yes--yes, I do, sir; it is the pede claudo of the ancients. I know all that, for it is with the justice of all countries especially that I have occupied myself--it is with the criminal procedure of all nations that I have compared natural justice, and I must say, sir, that it is the law of primitive nations, that is, the law of retaliation, that I have most frequently found to be according to the law of God.\" \\n\\n \"If this law were adopted, sir,\" said the procureur, \"it would greatly simplify our legal codes, and in that case the magistrates would not (as you just observed) have much to do.\" \\n\\n \"It may, perhaps, come to this in time,\" observed Monte Cristo; \"you know that human inventions march from the complex to the simple, and simplicity is always perfection.\" \\n\\n \"In the meanwhile,\" continued the magistrate, \"our codes are in full force, with all their contradictory enactments derived from Gallic customs, Roman laws, and Frank usages; the knowledge of all which, you will agree, is not to be acquired without extended labor; it needs tedious study to acquire this knowledge, and, when acquired, a strong power of brain to retain it.\" \\n\\n \"I agree with you entirely, sir; but all that even you know with respect to the French code, I know, not only in reference to that code, but as regards the codes of all nations. The English, Turkish, Japanese, Hindu laws, are as familiar to me as the French laws, and thus I was right, when I said to you, that relatively (you know that everything is relative, sir)--that relatively to what I have done, you have very little to do; but that relatively to all I have learned, you have yet a great deal to learn.\" \\n\\n \"But with what motive have you learned all this?\" inquired Villefort, in astonishment. Monte Cristo smiled. \"Really, sir,\" he observed, \"I see that in spite of the reputation which you have acquired as a superior man, you look at everything from the material and vulgar view of society, beginning with man, and ending with man--that is to say, in the most restricted, most narrow view which it is possible for human understanding to embrace.\" \\n\\n \"Pray, sir, explain yourself,\" said Villefort, more and more astonished, \"I really do--not--understand you--perfectly.\" \\n\\n \"I say, sir, that with the eyes fixed on the social organization of nations, you see only the springs of the machine, and lose sight of the sublime workman who makes them act; I say that you do not recognize before you and around you any but those office-holders whose commissions have been signed by a minister or king; and that the men whom God has put above those office-holders, ministers, and kings, by giving them a mission to follow out, instead of a post to fill--I say that they escape your narrow, limited field of observation. It is thus that human weakness fails, from its debilitated and imperfect organs. Tobias took the angel who restored him to light for an ordinary young man. The nations took Attila, who was doomed to destroy them, for a conqueror similar to other conquerors, and it was necessary for both to reveal their missions, that they might be known and acknowledged; one was compelled to say, \u0027I am the angel of the Lord\u0027; and the other, \u0027I am the hammer of God,\u0027 in order that the divine essence in both might be revealed.\" \\n\\n \"Then,\" said Villefort, more and more amazed, and really supposing he was speaking to a mystic or a madman, \"you consider yourself as one of those extraordinary beings whom you have mentioned?\" \\n\\n \"And why not?\" said Monte Cristo coldly. \\n\\n \"Your pardon, sir,\" replied Villefort, quite astounded, \"but you will excuse me if, when I presented myself to you, I was unaware that I should meet with a person whose knowledge and understanding so far surpass the usual knowledge and understanding of men. It is not usual with us corrupted wretches of civilization to find gentlemen like yourself, possessors, as you are, of immense fortune--at least, so it is said--and I beg you to observe that I do not inquire, I merely repeat;--it is not usual, I say, for such privileged and wealthy beings to waste their time in speculations on the state of society, in philosophical reveries, intended at best to console those whom fate has disinherited from the goods of this world.\" \\n\\n \"Really, sir,\" retorted the count, \"have you attained the eminent situation in which you are, without having admitted, or even without having met with exceptions? and do you never use your eyes, which must have acquired so much finesse and certainty, to divine, at a glance, the kind of man by whom you are confronted? Should not a magistrate be not merely the best administrator of the law, but the most crafty expounder of the chicanery of his profession, a steel probe to search hearts, a touchstone to try the gold which in each soul is mingled with more or less of alloy?\" \\n\\n \"Sir,\" said Villefort, \"upon my word, you overcome me. I really never heard a person speak as you do.\" \\n\\n \"Because you remain eternally encircled in a round of general conditions, and have never dared to raise your wings into those upper spheres which God has peopled with invisible or exceptional beings.\" \\n\\n \"And you allow then, sir, that spheres exist, and that these marked and invisible beings mingle amongst us?\" \\n\\n \"Why should they not? Can you see the air you breathe, and yet without which you could not for a moment exist?\" \\n\\n \"Then we do not see those beings to whom you allude?\" \\n\\n \"Yes, we do; you see them whenever God pleases to allow them to assume a material form. You touch them, come in contact with them, speak to them, and they reply to you.\" \\n\\n \"Ah,\" said Villefort, smiling, \"I confess I should like to be warned when one of these beings is in contact with me.\" \\n\\n \"You have been served as you desire, monsieur, for you were warned just now, and I now again warn you.\" \\n\\n \"Then you yourself are one of these marked beings?\" \\n\\n \"Yes, monsieur, I believe so; for until now, no man has found himself in a position similar to mine. The dominions of kings are limited either by mountains or rivers, or a change of manners, or an alteration of language. My kingdom is bounded only by the world, for I am not an Italian, or a Frenchman, or a Hindu, or an American, or a Spaniard--I am a cosmopolite. No country can say it saw my birth. God alone knows what country will see me die. I adopt all customs, speak all languages. You believe me to be a Frenchman, for I speak French with the same facility and purity as yourself. Well, Ali, my Nubian, believes me to be an Arab; Bertuccio, my steward, takes me for a Roman; Haidée, my slave, thinks me a Greek. You may, therefore, comprehend, that being of no country, asking no protection from any government, acknowledging no man as my brother, not one of the scruples that arrest the powerful, or the obstacles which paralyze the weak, paralyzes or arrests me. I have only two adversaries--I will not say two conquerors, for with perseverance I subdue even them,--they are time and distance. There is a third, and the most terrible--that is my condition as a mortal being. This alone can stop me in my onward career, before I have attained the goal at which I aim, for all the rest I have reduced to mathematical terms. What men call the chances of fate--namely, ruin, change, circumstances--I have fully anticipated, and if any of these should overtake me, yet it will not overwhelm me. Unless I die, I shall always be what I am, and therefore it is that I utter the things you have never heard, even from the mouths of kings--for kings have need, and other persons have fear of you. For who is there who does not say to himself, in a society as incongruously organized as ours, \u0027Perhaps some day I shall have to do with the king\u0027s attorney\u0027?\" \\n\\n \"But can you not say that, sir? The moment you become an inhabitant of France, you are naturally subjected to the French law.\" \\n\\n \"I know it sir,\" replied Monte Cristo; \"but when I visit a country I begin to study, by all the means which are available, the men from whom I may have anything to hope or to fear, till I know them as well as, perhaps better than, they know themselves. It follows from this, that the king\u0027s attorney, be he who he may, with whom I should have to deal, would assuredly be more embarrassed than I should.\" \\n\\n \"That is to say,\" replied Villefort with hesitation, \"that human nature being weak, every man, according to your creed, has committed faults.\" \\n\\n \"Faults or crimes,\" responded Monte Cristo with a negligent air. \\n\\n \"And that you alone, amongst the men whom you do not recognize as your brothers--for you have said so,\" observed Villefort in a tone that faltered somewhat--\"you alone are perfect.\" \\n\\n \"No, not perfect,\" was the count\u0027s reply; \"only impenetrable, that\u0027s all. But let us leave off this strain, sir, if the tone of it is displeasing to you; I am no more disturbed by your justice than are you by my second-sight.\" \\n\\n \"No, no,--by no means,\" said Villefort, who was afraid of seeming to abandon his ground. \"No; by your brilliant and almost sublime conversation you have elevated me above the ordinary level; we no longer talk, we rise to dissertation. But you know how the theologians in their collegiate chairs, and philosophers in their controversies, occasionally say cruel truths; let us suppose for the moment that we are theologizing in a social way, or even philosophically, and I will say to you, rude as it may seem, \u0027My brother, you sacrifice greatly to pride; you may be above others, but above you there is God.\u0027\" \\n\\n \"Above us all, sir,\" was Monte Cristo\u0027s response, in a tone and with an emphasis so deep that Villefort involuntarily shuddered. \"I have my pride for men--serpents always ready to threaten every one who would pass without crushing them under foot. But I lay aside that pride before God, who has taken me from nothing to make me what I am.\" \\n\\n \"Then, count, I admire you,\" said Villefort, who, for the first time in this strange conversation, used the aristocratic form to the unknown personage, whom, until now, he had only called monsieur. \"Yes, and I say to you, if you are really strong, really superior, really pious, or impenetrable, which you were right in saying amounts to the same thing--then be proud, sir, for that is the characteristic of predominance. Yet you have unquestionably some ambition.\" \\n\\n \"I have, sir.\" \\n\\n \"And what may it be?\" \\n\\n \"I too, as happens to every man once in his life, have been taken by Satan into the highest mountain in the earth, and when there he showed me all the kingdoms of the world, and as he said before, so said he to me, \u0027Child of earth, what wouldst thou have to make thee adore me?\u0027 I reflected long, for a gnawing ambition had long preyed upon me, and then I replied, \u0027Listen,--I have always heard of providence, and yet I have never seen him, or anything that resembles him, or which can make me believe that he exists. I wish to be providence myself, for I feel that the most beautiful, noblest, most sublime thing in the world, is to recompense and punish.\u0027 Satan bowed his head, and groaned. \u0027You mistake,\u0027 he said, \u0027providence does exist, only you have never seen him, because the child of God is as invisible as the parent. You have seen nothing that resembles him, because he works by secret springs, and moves by hidden ways. All I can do for you is to make you one of the agents of that providence.\u0027 The bargain was concluded. I may sacrifice my soul, but what matters it?\" added Monte Cristo. \"If the thing were to do again, I would again do it.\" Villefort looked at Monte Cristo with extreme amazement. \"Count,\" he inquired, \"have you any relations?\" \\n\\n \"No, sir, I am alone in the world.\" \\n\\n \"So much the worse.\" \\n\\n \"Why?\" asked Monte Cristo. \\n\\n \"Because then you might witness a spectacle calculated to break down your pride. You say you fear nothing but death?\" \\n\\n \"I did not say that I feared it; I only said that death alone could check the execution of my plans.\" \\n\\n \"And old age?\" \\n\\n \"My end will be achieved before I grow old.\" \\n\\n \"And madness?\" \\n\\n \"I have been nearly mad; and you know the axiom,--non bis in idem. It is an axiom of criminal law, and, consequently, you understand its full application.\" \\n\\n \"Sir,\" continued Villefort, \"there is something to fear besides death, old age, and madness. For instance, there is apoplexy--that lightning-stroke which strikes but does not destroy you, and yet which brings everything to an end. You are still yourself as now, and yet you are yourself no longer; you who, like Ariel, verge on the angelic, are but an inert mass, which, like Caliban, verges on the brutal; and this is called in human tongues, as I tell you, neither more nor less than apoplexy. Come, if so you will, count, and continue this conversation at my house, any day you may be willing to see an adversary capable of understanding and anxious to refute you, and I will show you my father, M. Noirtier de Villefort, one of the most fiery Jacobins of the French Revolution; that is to say, he had the most remarkable audacity, seconded by a most powerful organization--a man who has not, perhaps, like yourself seen all the kingdoms of the earth, but who has helped to overturn one of the greatest; in fact, a man who believed himself, like you, one of the envoys, not of God, but of a supreme being; not of providence, but of fate. Well, sir, the rupture of a blood-vessel on the lobe of the brain has destroyed all this, not in a day, not in an hour, but in a second. M. Noirtier, who, on the previous night, was the old Jacobin, the old senator, the old Carbonaro, laughing at the guillotine, the cannon, and the dagger--M. Noirtier, playing with revolutions--M. Noirtier, for whom France was a vast chess-board, from which pawns, rooks, knights, and queens were to disappear, so that the king was checkmated--M. Noirtier, the redoubtable, was the next morning poor M. Noirtier, the helpless old man, at the tender mercies of the weakest creature in the household, that is, his grandchild, Valentine; a dumb and frozen carcass, in fact, living painlessly on, that time may be given for his frame to decompose without his consciousness of its decay.\" \\n\\n \"Alas, sir,\" said Monte Cristo \"this spectacle is neither strange to my eye nor my thought. I am something of a physician, and have, like my fellows, sought more than once for the soul in living and in dead matter; yet, like providence, it has remained invisible to my eyes, although present to my heart. A hundred writers since Socrates, Seneca, St. Augustine, and Gall, have made, in verse and prose, the comparison you have made, and yet I can well understand that a father\u0027s sufferings may effect great changes in the mind of a son. I will call on you, sir, since you bid me contemplate, for the advantage of my pride, this terrible spectacle, which must have been so great a source of sorrow to your family.\" \\n\\n \"It would have been so unquestionably, had not God given me so large a compensation. In contrast with the old man, who is dragging his way to the tomb, are two children just entering into life--Valentine, the daughter by my first wife--Mademoiselle Renée de Saint-Méran--and Edward, the boy whose life you have this day saved.\" \\n\\n \"And what is your deduction from this compensation, sir?\" inquired Monte Cristo. \\n\\n 假如基督山伯爵曾在巴黎生活过一段相当长的时间，那他一定会充分了解维尔福先生采取的这个步骤的重要性。不论在朝掌权的国王是新是老，不论执政的是立宪派、自由派或是保守派，维尔福先生在宫廷里的地位始终是很稳固的，所有的人都认为他很能干，正如我们把那些在政治上从没遭受过挫折的看作是有才干一样，很多人恨他，但也有很多人热心地保护他，只是从来没有一个人真正地喜欢他。他在司法界一直地位很高，而且能始终以中直的态度维持着他这个地位。他的会客室，在他年轻的妻子和他那未满十八岁的、前妻所生的女儿的操持之下，可称得上是巴黎最正统的客厅之一。小心尊崇着传统习俗，严格的礼节、礼貌，对政府的各项政策忠贞不渝，对各种理论和理论家的极端蔑视，对理想主义的深恶痛绝——这些就是维尔福先生在内心深处或公开场合所标榜的人生哲学。 \\n\\n 维尔福先生不仅是位法官，而且几乎是位外交家。他和旧王朝的关系使他得到了今天的器重，每当他讲到旧王朝时，总是显出庄严恭敬的态度，而他所知道的事情太多了，所以他不但始终受到当朝人的迁就，而且有时还承蒙咨询。要是人们能除掉维尔福先生的话，情形或许就不会象现在这个样子，但他就象那些敢于违抗国王的封建诸侯一样，住在一个无法攻陷的堡垒里。这个堡垒就是他身为检察官的这个职位。他极其巧妙地运用了这个职位所带来的种种优势，不管在什么情况下，他都决不辞职，至多只请人暂时代理一下，以此避免反对的立刻而始终处于保守中立。维尔福先生通常极少出去拜客，也极少回拜。他的妻子代他去拜客，这已是社会上所公认的事了，他们以为法官工作繁重而谅解了他，实际上他却是出于一种傲慢的想法，这正是贵族的本质——的确，他实践了“只要你自以为了不起，别人也就会以为你了不起”这句格言，这句格言在我们这个社会里比起希腊人的那句“认识你自己，”实在是更有用，而我们却用那比较省力而更有利的“认识别人” \\n\\n 取代了希腊人的这句格言。 \\n\\n 对他的朋友，维尔福先生是一个强有力的保护者，对于他的仇敌，他是一个沉默的死对头，对那些在这两者之间的人，他是法律的化身。傲慢神气，死板的面孔，沉着冷漠或锐利探询的目光，即有这些使这个人巧妙地度过了接连而来的四次革命，在革命中建立和巩固了他升官发财的根基。维尔福先生在法国一向是以最不好奇和最不怕麻烦的人见称的。他每年开一次舞会，在那次舞会里，他只到场一刻钟。他从来不去戏院，音乐会，或任何公共娱乐场所。偶尔的，只是这种场合也很少，他会玩玩威斯特牌戏［一种扑克牌的游戏。——译注］；而那时他必定认真挑选够资格和他一起玩牌的——如大使、大主教、亲王、总统或寡居的公爵夫人之流。现在把车停在基督山伯爵的门前的，正是这个人。 \\n\\n 跟班去通报维尔福先生来访的时候，伯爵正伏在一张大桌子上，在一张地图上寻找从圣彼得堡到中国去的路线。 \\n\\n 检察官以他步入法庭时那种庄重和平稳的步子走了进来。他从前在马赛当代理检察官时我们曾见过他，还是那个人，说得更确切些，是原来的那个人现在达到了最完美的阶段。 \\n\\n 照例在他身上造成了某些变化，但在这变化中他却未改变多少。他人从消瘦变成了羸弱，脸色从苍白变成了焦黄；他那深陷的眼睛现在更深了；他那一副金边眼镜，架在鼻子上的时候，似乎成了他脸上的一部分。他着一身黑衣服，只有领带是白的。这身打扮唯一不同于丧服的地方，就是穿在纽孔上的那条几乎难以觉察的红丝带，象是用红铅笔划出来的一缕血丝。基督山虽然极能自制，这时，他在还礼之后，竟还是抑制不住好奇心仔细地观察起这位法官来，而对方一向惯于怀疑一切，尤其不相信社会上会有所谓的奇人奇事，所以他也极想看出这位外国贵宾（已经有人这样称呼基督山了）究竟是个挪一下窝一显身手的大骗子或不法之徒呢，还是位来自圣海的王子或《一千零一夜》里的苏丹。 \\n\\n “阁下，”维尔福说道，说话的门吻和法官在演讲的时候一样，好象他在社交场合也不能或不愿放弃这种腔调似的，“阁下，昨天蒙您大力相助，救我的妻子和儿子的命，我觉得我有义务向您表示谢意。所以请允许我今天来履行这个义务，让我向您表示我衷心的感谢。”说这番话的时候，法官那严厉的目光里依旧含有他往常那种骄矜的神气。他是以一个首席检察官的语气和单调来说这几句话的，脖子硬挺挺地一动都不动，这正是为什么那些恭维他的人说他是法律的化身。 \\n\\n “阁下，”伯爵冷冰冰地回答说，“我非常高兴能有机会为一位母亲保全了她的儿子。因为常言道，母子之情是世界上最真挚神圣的感情，而我的运气好，阁下，使您来此履行一种义务，而您在履行这种义务的时候，无疑的给了我莫大的荣幸。因为我知道，维尔福先生对我的这种赏脸平时不是轻易肯给的，但是，这种荣幸不论多么可贵，却仍然不足以与我内心里所感到的满足相比。” \\n\\n 维尔福决想不到会得到这样的回答，他不禁吃了一惊，就象个军人感到他所穿的甲胃上被人猛击了一下似的，他的嘴唇轻蔑地微微一弯，表示从现在起，他想象中的基督山伯爵不再是一个文明的绅士了。他向四周看了一下，想找点什么来作为继续交谈的话题，因为刚才的那个话题似乎已摔得粉碎了。 \\n\\n 他看到了他进来时基督山在研究的那张地图，于是说道，“您好象在研究地理吧，阁下。这可是一种很有趣的学问，尤其是您，我听说，凡是这张地图上标明的地方您都已经见识过了。” \\n\\n “是的，阁下，”伯爵答道，“我很想把人类当作一个整体来进行一番哲学研究，而您却是每天在作单个的实验。我相信，从整体来推论部分比从部分来求解整体要容易得多。这是代数学上的一条定理，我们应该从已知数来推论未知数，而不是从未知数来求已知数，请坐，阁下。” \\n\\n \\n\\n \\n\\n 基督山指了指一张椅子，于是那位检察官不得不向前移动几步坐了下来，而伯爵确向后一靠，便坐到了他椅子里，维尔福先生进来的时候，他原就是坐到了他的椅子上的。所以伯爵是侧面向着他的客人，背向着窗，手肘撑在那张当时正在谈论的地图上，这一番谈话也象以前与腾格拉尔和马尔塞夫谈话的时候一样，是随环境和对方的为人而改变的。 \\n\\n “啊，您自称为哲学家，”维尔福沉默了一会儿说道，他趁这沉默的期间喘了一口气，象是一个摔跤手遇到了一个强有力的对手，“哦，阁下，真的，假如我也象您这样无所事事的话，我一定会去找一件更有趣的事来做的。” \\n\\n “老实说，阁下，”基督山答道，“如果把人放在一只日光显微镜下来研究一下的话，他实在只不过是一条丑陋的毛虫而已。您说我无所事事，真的，现在我也来问一句，那么您呢？您认为您是有所事事的吗？说得更明白一些，您以为您所做的一切够得上称为‘事吗’？” \\n\\n 这个陌生的敌手所作的第二次进攻如此猛烈，以致维尔福不禁又增加了一份惊异。这样强有力的怪论此法官已好久没听到了，说得正确些，这还是他生平第一次听到，检察官竭力作出回答。“阁下，”他说道，“您是一位外国人，我相信您自己也曾说过，您曾在东方各国住过很长时间，所以您不了解人类的法律是如何值得我们审慎详密的研究一番，因为在那些野蛮的国家是根本谈不上什么法律的。” \\n\\n “噢，不，不，我了解，阁下，那一切我都知道，因为我是专门研究各国法律的。我曾拿各国的刑事法来和自然法作比较。而我得说，阁下，我常常发现原始部落法律，即报复法，是最符合上帝意志的法律。” \\n\\n “假如采用了这条法律，先生，”检察官说道，“我们的法典就可以大大地简化了。倘若如此，那么正如您刚才所说的，法官们就会没有多少事可做了。” \\n\\n “这种情形或许会出现的，”基督山说道。“您知道，人类的发明创造从复杂趋向简单，而简单的总是完美的。” \\n\\n “但目前，”法官又说道，“我们的法典却正处于全盛时期，它是根据茄立克族［法国民族的一支。——译注］的风俗，罗马法律和法兰克族［法国民族的一支。——译注］的惯例，从这一切相互向矛盾相触的条例中推断制定出来的。而那种种知识，想必您也同意这种说法，不经过长期的努力是无法获得的，要获得这种知识必须经过一番刻苦的研究，而且还必须经过有力的脑力劳动才能把它保存下来。” \\n\\n “我完全同意您的看法，阁下，对法国法典的一切可能您都有所了解，而我所了解的，却不仅仅是哪一部法典，而是世界各国的法典。英国的，土耳其的，日本的，印度的都有，对我来说，都和法国的法律一样熟悉，所以我刚才说得没错，相对而言，您也知道，一切都是相对的，阁下相对而言，和我所完成的工作比较起来，您所要做的那些少得可怜，而和我所学到的所有知识比较起来，您还得再学习很多才行。” \\n\\n “您学习这一切是出于什么动机呢？”维尔福惊讶地问道。 \\n\\n 基督山微笑了一下。“真的，先生，”他说道，“我看您尽管有智士美誉，但您对于一切事物的看法，却仍抱有社会上那种唯物的和通俗的观点，始于人而终于人。也就是说，是人类观察事物时所能采取的最局限，最狭隘的一种观点。” \\n\\n “阁下，请您解释得再清楚一些，”维尔福说道，他愈来愈惊奇了，“我实在不十分明白。” \\n\\n “我的意思是说，阁下，由于把目光只放在各国的社会机构上，所以您所看到的只是那些机器在转动，而没有看到使它转动的那位了不起的工程师，我是说您周围所认识的，无非是那些由部长或国王颁发了委任状的大小官吏。而在这些挂名的官吏，部长和国王之上，却还有上帝派的人，上帝不是派他们来充填位子的，而是让他们来执行任务的，但他们却逃过了您那狭隘的目光。所以人类由于他们的器官衰弱和不完备而产生了缺点。多比亚斯［基督教《经外书》中的人物。——译注］把那个恢复他视觉的天使看作一个普通的青年人，各国把那个受天命来毁灭他们的阿提拉［古代匈奴人的国王。——译注］与其他的征服者当作同类看待，因此为了让人们认识他们，承认他们，他们不得不宣布他们的使命。前者不得不说：‘我是主的天使。’而后者说：‘我是上帝惩恶的使者。’这样，他们两人的神性才能大白于天下。” \\n\\n “那么，”维尔福说道，他愈来愈惊愕了，真的以为他不是在和一个神学家就是一个疯子在说话，“您认为自己就是您所说的特种人物吗？” \\n\\n “为什么不是呢？”基督山冷冷地说道。 \\n\\n “对不起，阁下，”维尔福回答说，简直有点惊呆了，“想必您能原谅我，因为当我前来拜访您的时候，我决没想到会遇到一位知识和见解远远超出常人理解范围之外的人。象您这样一位极富有的绅士，至少，人们是这样说的，请注意，我并不是盘问您，只是重复别人所说的话而已，我想说，象您这样有钱的特权阶级，竟会把时间浪费在对社会的空谈或哲学幻想上，在我们这种文明社会中那些腐化了的可怜虫之间，的确是不常见的，因为社会空谈或哲学幻想最适合于去安慰那些生来命穷，又不走运，无法享受世上荣华富贵的人。” \\n\\n “真的，阁下，”伯爵反驳道，“您已经达到如此显要的地位，难道您还算不上是个特别的人，或者竟没遇到过特别的人吗？您的目光一定非常老练可靠，难道您从来没有，在一瞥之下就推断出到您面前过来的是哪一种人吗？一个法官除了无尽职守地按法律行事以外，除了极技巧地解释他工作上耍的诡计之外，难道不该做一枚可以探测心脏的钢针，一块可以测验出灵魂中含有多少杂质的试金石吗？” \\n\\n “阁下，”维尔福说道，“老实讲，您驳倒了我。我从没听到过别人象您这样讲话。” \\n\\n “因为您总使自己处在一个平凡的环境里，从不敢振翅高飞，冲进上帝安派那些看不到的特殊人的领域里。” \\n\\n “那么您认为，阁下，那种领域的确存在，这些看不到的特殊人的确是和我们混杂在一的吗？” \\n\\n “他们为什么不呢？您离开了空气就一刻也不能生存，但您能看得见您所呼吸的空气吗？” \\n\\n “那么说我们是无法看见您所指的那种人了？” \\n\\n “不，我们能看见的，当上帝高兴让他们现出实形的时候，您就能看见他们了。您可以触摸到他们，同他们交往，跟他们讲话，而他们也会回答您的。” \\n\\n “啊！”维尔福微笑着说道，“我承认，当这种人前来和我接触的时候，我倒很希望能事先得到一个警告。” \\n\\n “您的愿望已经实现了，阁下，因为您刚才就已经得到了警告，而我现在再来警告您一次。” \\n\\n “那么您就是这种杰出的人物了？” \\n\\n “是的，阁下，我相信到目前为止，还没有哪一个人的地位可以与我相比。国王的领土都是有限的，或限于山脉河流，或限于风俗习惯的改变，或限于语言的不同。我的王国却是以整个世界为界限。因为我既不是意大利人也不是法国人，不是印度人也不是美国人，也不是什么西班牙人，我是一个宇宙人。没有哪一个国家可以说它看到了我的降生，而只有上帝才知道哪一个国家会看到我死。我能适应各种风俗习惯，通晓各种语言，您若相信我是个法国人，那是因为我讲起法语来能象您一样流利纯正。可是，阿里，我的黑奴，却相信我是阿拉伯人；贝尔图乔，我的管家，把我当作了罗马人；海黛，我的奴隶，认为我是希腊人。所以您大概可以明白了吧，由于没有国籍，不要求任何政府的保护，不承认任何人是我的兄弟，因此，凡是那可以阻止强者的种种顾忌或可以麻痹弱者的种种障碍，都无法麻痹或阻止我。我只有两个对手，我不愿意说是两位征服者，因为只要坚忍不屈，甚至连他们我也是可以克服的。他们就是时间和空间。而那第二个对手，也是最可怕的，就是，我将来也必有一死。只有这才能阻止我的行动，使我无法到达我预期的目标，其余的一切我都算定了。凡是人们所谓命运机遇的那些东西，如破产，变迁，环境等等，我都已经预料到了，假如这些因素突然来袭击我，它们是决不能使我一蹶不振的。除非我死了，否则我是永远不会改变我的信仰，所以我敢说出这些您从没听说过的事情，这些事情即使从国王的嘴里您也听不到的。因为国王需要您，而其他的人怕您。在我们这样一个组织不健全的社会里，人人都免不了要对自己说：‘也许有一天我会有求于检察官的吧？”’“但您敢肯定不会说那句话吗，阁下？因为您一旦成了法国的一位公民，您自然就得遵守该国的法律。” \\n\\n “这我知道，阁下，”基督山答道，“但当我去访问一个国家的时候我就开始用各种可能的方法来研究那些我可能有求于他或害怕他的人，直到我把这些人了解清清楚楚，象他们了解自己一样或许比他们自己了解得还清楚。基于这种想法不管检察官是谁，假如他要对付我的话他一定会发现自己的处境并不比我妙。” \\n\\n “那就是说，”维尔福吞吞吐吐地答道“人类的本性中就是有缺点的，按您的标准来看，每个人都是犯了过失的。” \\n\\n “过失或是罪过。”基督山以一种随便的神气回答道。 \\n\\n “您刚才说，您在人类中没有你的兄弟那么，在全人类中，”维尔福多少有点儿犹豫地说，“只有您是十全十美的了。” \\n\\n “不，并非是十全十美”伯爵回答说“只是无法看穿罢了。假如这种格调使您不愉快的话我们还是停止这一场舌战吧，先生，您的法律并没有打扰到我，正如我的第二视觉并没有打扰您一样。” \\n\\n “没有，没有，决没有，”维尔福说道，他象怕放弃他的优势似的“您这一番光辉而且几乎可以说是崇高的谈话已把我抬举到了普通的水准以上。我们已不再是聊天了，我们是在进行讨论。但您知道，那些坐在大学交椅里的神学家，和那些坐在辩论席上的哲学家，偶尔也会说出残酷的真理。我们暂且算是在讨论社会神学和宗教哲学吧，下面这几句话听来虽有些不礼貌，但我还是要对您说：‘兄弟，你太自负了，你也许比别人高明，但在你之上还有上帝呢。’” \\n\\n “在我们大家之上，阁下。”基督山这样回答道，其语气是这样沉重，使维尔福不由自主地打了个寒颤。“我对人是自负的，正如赤练蛇每当看见有人经过它的旁边时总昂起头来攻击他的，即使那人并没踩着它。但在上帝的面前，我放弃了那种自负，因为是上帝把我从一无所有提升到了现在这样的地位。” \\n\\n “那么，伯爵阁下，我钦佩您，”维尔福说道，在这篇奇异的谈话里，到目前为止，他还是第一次对这位神秘人物冠以贵族的称呼，刚才他只是称“阁下”，“是的，而且我要对您说，假如您真的高强，真的优越，真的神圣，或者是真的无法看穿，您把无法看穿和神圣等同起来，这一点的说得很对。那末您尽管骄矜好了，阁下，因为那是超人的特征。但毫无疑问您也是有野心的吧。” \\n\\n “我有一个野心，阁下。” \\n\\n “是什么？” \\n\\n “我，就象每个人在其一生中都可能会遇到的那样，曾被撒旦带到了世界最高的山顶上，在那儿，他把世界上所有的王国都指给我看，并且象他以前对人说过的那样对我说道，‘大地的孩子啊，你怎样才能崇拜我呢？’我想了很久，因为我早就怀有一种刻骨的野心，于是我回答说：‘听着：我常常听人说起救世主，可我从来没看见过他，也没看见过和他相象的东西，也不曾遇到过任何事物能够使我相信他的存在。我希望我自己能变成救世主，因为我觉得世界上最美丽，最高贵，最伟大的事业，莫过于报善和惩恶。’撒旦低头呻吟了一会儿。‘你错了，’他说道‘救世主是存在的，只是你看不到他罢了，因为上帝的孩子象他的父母一样，肉眼是看不到的。你没有看见过他是个什么样子，因为他赏罚无形，来去无踪。我所能办得到的，只是使你成为救世主的一个使者而已。’于是那场交易就结束了。我也许已丧失了自己的灵魂，但那又有什么关系呢？”基督山又说道，“要是这种事情再发生，我还是会这样干的。” \\n\\n 维尔福非常吃惊地望着基督山。“伯爵阁下，”他问道，“您有什么亲戚吗？” \\n\\n “没有，先生，我在这个世界上是孤零零的一个人。” \\n\\n “那就糟了。” \\n\\n “为什么？”基督山问道。 \\n\\n “因为那样您就得目睹一幕有伤于您的自负心的情景。您不是说过，您什么都不怕，只怕死吗？” \\n\\n “我并没有说我怕它，我只是说，只有它才能阻止我。” \\n\\n “老年呢？” \\n\\n “我的目的在我年老之前就可以达到的。” \\n\\n “疯狂呢？” \\n\\n “我是几乎发过疯，您知道有一句格言说‘一事不重现。’这是一句犯罪学上的格言，您当然充分了解它的意义了。” \\n\\n “阁下，”维尔福又说道，“除了死，老发疯以外，世界还有一些可怕的事情。譬如说，中风，那是一种闪电般的袭击，它只打击您，却并不毁灭您，可是经它打击之后，一切也就都完了。您的外貌当然一点都没有改变，但您已不再是以前的您了，您以前象吃过灵芝草的羚羊，但这时却变成了一块呆木头，就象那受了酷刑的卡立班［莎士比亚名剧《暴风雨》中的人物。——译注］，这种病，是生在人的舌头上，正如我所告诉您的，不折不扣地叫做中风。伯爵阁下，假如您愿意的话，随便哪一天，只要您高兴见到一个尚能解事而且急于想驳倒您的对手的话，那么，请到舍下来继续这一番谈话吧，我想介绍您同家父见面，也就是诺瓦蒂埃·维尔福先生，法国革命时期一个最激进的雅各宾派，也就是说，一个最目无法纪，最果断勇敢的人，他也许不曾象您那样到过世界上所有的王国，但他却曾帮助颠覆了世界上一个最强有力的国家，您相信自己是上帝和教世主的使者，他，象您一样，相信他自己是万神之主和命运的使音。可是，阁下，脑髓里一条血管的破裂就摧毁了这一切，而这发生在不到一天，不到一个钟头，而只在一秒钟的时间内。诺瓦蒂埃先生在头一天晚上还是老雅各宾派成员，老上议院的义员，老烧炭党分子，嘲笑断头台，嘲笑大炮，嘲笑匕首，诺瓦蒂埃先生，他玩弄革命，诺瓦蒂埃先生，对他来说法国是一面大棋盘，他使得小卒，城堡，骑士和王后一个个地失踪，甚至使国王被困，诺瓦蒂埃先生，这样可畏的一个人物，第二天早晨却一下子变成了‘可怜的诺瓦蒂埃先生’，变成了孤苦无助的老头子，得让家里最软弱无力的一员，就是他的孙女瓦朗蒂娜来照顾他。事实上，他只剩了一具又哑又僵的躯壳，在无声无息地喘着气，让时间慢慢地腐蚀他的全身，而他自己却感觉不到它在腐朽。” \\n\\n “唉，先生！”基督山说道，“这种事我都看到也想到过了。我也可以算是一个医生，我曾象我的同行那样几次三番的寻活人和死者的灵魂，而象救世主一样，我的肉眼虽看不到它，但我的心却能感觉到它的存在。自苏格拉底，［（公元前四七○—三九九），希腊哲学家。——译注］塞内加［（二—六五），西班牙学者。——译注］，圣奥古斯丁［（三五四—四三○），英国主教。——译注］和高卢［（一七五八—一八八二），德国著名医生。——译注］以来，无数的女人在诗歌或散文里写下过您所作的那种对比，可是，我也很能理解，一个父亲的痛苦或许会使一个儿子的头脑发生很大的转变。您既然建议我为我的自负心着想该去看一看那种可怕的情景，那么我一定前去府上拜访，先生，这种可怕的事情一定已使府上布满了忧郁的气氛吧。” \\n\\n “要不是上帝赐给了我一个极大的补偿，本来当然会是如此的。眼看着老人家自己在走向坟墓里，却有两个孩子刚巧踏上了生命的旅程。一个是瓦朗蒂娜，是我的前妻蕾姆·圣·梅朗小姐所生的女儿，一个是爱德华，就是今天您救的那个孩子。” \\n\\n “您从这个补偿上得出了什么结论，阁下？”基督山问道。 \\n\\n “我的结论是，”维尔福答道，“家父在热情的激励之下，曾犯过某种过失，而那种过失人类的法庭不知道，但上帝的法庭却已经看到了，而上帝只想惩罚一个人，所以只降祸于他本人。” \\n\\n 基督山的嘴上虽带着微笑，可在内心里却发出了一声怒吼，要是维尔福听到了这个声音，他一定会飞也似的逃走的。 \\n\\n “再会了，阁下，”法官站起身来说道，“我虽然离开了您，可我会永远记得您的，而且是满怀尊重的心情的。我希望，当您和我相知较深的时候，您不会讨厌我这番情谊的，因为您将来就会了解，我不是一个爱打扰朋友的人。而且，您和维尔福夫人已结成永远的朋友了。” \\n\\n 伯爵欠了欠身，亲自送维尔福到他的房门口，那位检察官作了一个手势，两个听差就毕恭恭毕敬地护送他们的主人到他的马车里去了。他走了之后，基督山从他那郁闷的胸膛里大大地吐出了一口气，说道，“这贴毒药真够受的，现在让我来找一服解毒剂吧。”于是他敲响了铜锣，并对进来的阿里说道，“我要到夫人的房间里去了，一点钟的时候，把马车备好。” \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/72/3967.html","bookId":545,"book":{"id":545,"title":"The Count of Monte Cristo基督山伯爵","description":"简介： 《基督山伯爵》是通俗历史小说，法国著名作家大仲马（1802-1870）的代表作。故事讲述19世纪法国皇帝拿破仑百日王朝时期，法老号大副爱德蒙唐泰斯受船长委托，为拿破仑党人送了一封信，遭到两个卑鄙小人和法官的陷害，被打入黑牢。狱友法利亚神甫向他传授各种知识，并在...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12865075139f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/72","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
