{"id":43922,"no":54,"title":"Chapter 58 M. Noirtier de Villefort","content":"WE WILL now relate what was passing in the house of the king\u0027s attorney after the departure of Madame Danglars and her daughter, and during the time of the conversation between Maximilian and Valentine, which we have just detailed. M. de Villefort entered his father\u0027s room, followed by Madame de Villefort. Both of the visitors, after saluting the old man and speaking to Barrois, a faithful servant, who had been twenty-five years in his service, took their places on either side of the paralytic. \\n\\n M. Noirtier was sitting in an arm-chair, which moved upon casters, in which he was wheeled into the room in the morning, and in the same way drawn out again at night. He was placed before a large glass, which reflected the whole apartment, and so, without any attempt to move, which would have been impossible, he could see all who entered the room and everything which was going on around him. M. Noirtier, although almost as immovable as a corpse, looked at the newcomers with a quick and intelligent expression, perceiving at once, by their ceremonious courtesy, that they were come on business of an unexpected and official character. Sight and hearing were the only senses remaining, and they, like two solitary sparks, remained to animate the miserable body which seemed fit for nothing but the grave; it was only, however, by means of one of these senses that he could reveal the thoughts and feelings that still occupied his mind, and the look by which he gave expression to his inner life was like the distant gleam of a candle which a traveller sees by night across some desert place, and knows that a living being dwells beyond the silence and obscurity. Noirtier\u0027s hair was long and white, and flowed over his shoulders; while in his eyes, shaded by thick black lashes, was concentrated, as it often happens with an organ which is used to the exclusion of the others, all the activity, address, force, and intelligence which were formerly diffused over his whole body; and so although the movement of the arm, the sound of the voice, and the agility of the body, were wanting, the speaking eye sufficed for all. He commanded with it; it was the medium through which his thanks were conveyed. In short, his whole appearance produced on the mind the impression of a corpse with living eyes, and nothing could be more startling than to observe the expression of anger or joy suddenly lighting up these organs, while the rest of the rigid and marble-like features were utterly deprived of the power of participation. Three persons only could understand this language of the poor paralytic; these were Villefort, Valentine, and the old servant of whom we have already spoken. But as Villefort saw his father but seldom, and then only when absolutely obliged, and as he never took any pains to please or gratify him when he was there, all the old man\u0027s happiness was centred in his granddaughter. Valentine, by means of her love, her patience, and her devotion, had learned to read in Noirtier\u0027s look all the varied feelings which were passing in his mind. To this dumb language, which was so unintelligible to others, she answered by throwing her whole soul into the expression of her countenance, and in this manner were the conversations sustained between the blooming girl and the helpless invalid, whose body could scarcely be called a living one, but who, nevertheless, possessed a fund of knowledge and penetration, united with a will as powerful as ever although clogged by a body rendered utterly incapable of obeying its impulses. Valentine had solved the problem, and was able easily to understand his thoughts, and to convey her own in return, and, through her untiring and devoted assiduity, it was seldom that, in the ordinary transactions of every-day life, she failed to anticipate the wishes of the living, thinking mind, or the wants of the almost inanimate body. As to the servant, he had, as we have said, been with his master for five and twenty years, therefore he knew all his habits, and it was seldom that Noirtier found it necessary to ask for anything, so prompt was he in administering to all the necessities of the invalid. Villefort did not need the help of either Valentine or the domestic in order to carry on with his father the strange conversation which he was about to begin. As we have said, he perfectly understood the old man\u0027s vocabulary, and if he did not use it more often, it was only indifference and ennui which prevented him from so doing. He therefore allowed Valentine to go into the garden, sent away Barrois, and after having seated himself at his father\u0027s right hand, while Madame de Villefort placed herself on the left, he addressed him thus:-- \\n\\n \"I trust you will not be displeased, sir, that Valentine has not come with us, or that I dismissed Barrois, for our conference will be one which could not with propriety be carried on in the presence of either. Madame de Villefort and I have a communication to make to you.\" \\n\\n Noirtier\u0027s face remained perfectly passive during this long preamble, while, on the contrary, Villefort\u0027s eye was endeavoring to penetrate into the inmost recesses of the old man\u0027s heart. \\n\\n \"This communication,\" continued the procureur, in that cold and decisive tone which seemed at once to preclude all discussion, \"will, we are sure, meet with your approbation.\" The eye of the invalid still retained that vacancy of expression which prevented his son from obtaining any knowledge of the feelings which were passing in his mind; he listened, nothing more. \"Sir,\" resumed Villefort, \"we are thinking of marrying Valentine.\" Had the old man\u0027s face been moulded in wax it could not have shown less emotion at this news than was now to be traced there. \"The marriage will take place in less than three months,\" said Villefort. Noirtier\u0027s eye still retained its inanimate expression. \\n\\n Madame de Villefort now took her part in the conversation and added,--\"We thought this news would possess an interest for you, sir, who have always entertained a great affection for Valentine; it therefore only now remains for us to tell you the name of the young man for whom she is destined. It is one of the most desirable connections which could possibly be formed; he possesses fortune, a high rank in society, and every personal qualification likely to render Valentine supremely happy,--his name, moreover, cannot be wholly unknown to you. It is M. Franz de Quesnel, Baron d\u0027Epinay.\" \\n\\n While his wife was speaking, Villefort had narrowly watched the old man\u0027s countenance. When Madame de Villefort pronounced the name of Franz, the pupil of M. Noirtier\u0027s eye began to dilate, and his eyelids trembled with the same movement that may be perceived on the lips of an individual about to speak, and he darted a lightning glance at Madame de Villefort and his son. The procureur, who knew the political hatred which had formerly existed between M. Noirtier and the elder d\u0027Epinay, well understood the agitation and anger which the announcement had produced; but, feigning not to perceive either, he immediately resumed the narrative begun by his wife. \"Sir,\" said he, \"you are aware that Valentine is about to enter her nineteenth year, which renders it important that she should lose no time in forming a suitable alliance. Nevertheless, you have not been forgotten in our plans, and we have fully ascertained beforehand that Valentine\u0027s future husband will consent, not to live in this house, for that might not be pleasant for the young people, but that you should live with them; so that you and Valentine, who are so attached to each other, would not be separated, and you would be able to pursue exactly the same course of life which you have hitherto done, and thus, instead of losing, you will be a gainer by the change, as it will secure to you two children instead of one, to watch over and comfort you.\" \\n\\n Noirtier\u0027s look was furious; it was very evident that something desperate was passing in the old man\u0027s mind, for a cry of anger and grief rose in his throat, and not being able to find vent in utterance, appeared almost to choke him, for his face and lips turned quite purple with the struggle. Villefort quietly opened a window, saying, \"It is very warm, and the heat affects M. Noirtier.\" He then returned to his place, but did not sit down. \"This marriage,\" added Madame de Villefort, \"is quite agreeable to the wishes of M. d\u0027Epinay and his family; besides, he had no relations nearer than an uncle and aunt, his mother having died at his birth, and his father having been assassinated in 1815, that is to say, when he was but two years old; it naturally followed that the child was permitted to choose his own pursuits, and he has, therefore, seldom acknowledged any other authority but that of his own will.\" \\n\\n \"That assassination was a mysterious affair,\" said Villefort, \"and the perpetrators have hitherto escaped detection, although suspicion has fallen on the head of more than one person.\" Noirtier made such an effort that his lips expanded into a smile. \\n\\n \"Now,\" continued Villefort, \"those to whom the guilt really belongs, by whom the crime was committed, on whose heads the justice of man may probably descend here, and the certain judgment of God hereafter, would rejoice in the opportunity thus afforded of bestowing such a peace-offering as Valentine on the son of him whose life they so ruthlessly destroyed.\" Noirtier had succeeded in mastering his emotion more than could have been deemed possible with such an enfeebled and shattered frame. \"Yes, I understand,\" was the reply contained in his look; and this look expressed a feeling of strong indignation, mixed with profound contempt. Villefort fully understood his father\u0027s meaning, and answered by a slight shrug of his shoulders. He then motioned to his wife to take leave. \"Now sir,\" said Madame de Villefort, \"I must bid you farewell. Would you like me to send Edward to you for a short time?\" \\n\\n It had been agreed that the old man should express his approbation by closing his eyes, his refusal by winking them several times, and if he had some desire or feeling to express, he raised them to heaven. If he wanted Valentine, he closed his right eye only, and if Barrois, the left. At Madame de Villefort\u0027s proposition he instantly winked his eyes. Provoked by a complete refusal, she bit her lip and said, \"Then shall I send Valentine to you?\" The old man closed his eyes eagerly, thereby intimating that such was his wish. M. and Madame de Villefort bowed and left the room, giving orders that Valentine should be summoned to her grandfather\u0027s presence, and feeling sure that she would have much to do to restore calmness to the perturbed spirit of the invalid. Valentine, with a color still heightened by emotion, entered the room just after her parents had quitted it. One look was sufficient to tell her that her grandfather was suffering, and that there was much on his mind which he was wishing to communicate to her. \"Dear grandpapa,\" cried she, \"what has happened? They have vexed you, and you are angry?\" The paralytic closed his eyes in token of assent. \"Who has displeased you? Is it my father?\" \\n\\n \"No.\" \\n\\n \"Madame de Villefort?\" \\n\\n \"No.\" \\n\\n \"Me?\" The former sign was repeated. \"Are you displeased with me?\" cried Valentine in astonishment. M. Noirtier again closed his eyes. \"And what have I done, dear grandpapa, that you should be angry with me?\" cried Valentine. \\n\\n There was no answer, and she continued. \"I have not seen you all day. Has any one been speaking to you against me?\" \\n\\n \"Yes,\" said the old man\u0027s look, with eagerness. \\n\\n \"Let me think a moment. I do assure you, grandpapa--Ah--M. and Madame de Villefort have just left this room, have they not?\" \\n\\n \"Yes.\" \\n\\n \"And it was they who told you something which made you angry? What was it then? May I go and ask them, that I may have the opportunity of making my peace with you?\" \\n\\n \"No, no,\" said Noirtier\u0027s look. \\n\\n \"Ah, you frighten me. What can they have said?\" and she again tried to think what it could be. \\n\\n \"Ah, I know,\" said she, lowering her voice and going close to the old man. \"They have been speaking of my marriage,--have they not?\" \\n\\n \"Yes,\" replied the angry look. \\n\\n \"I understand; you are displeased at the silence I have preserved on the subject. The reason of it was, that they had insisted on my keeping the matter a secret, and begged me not to tell you anything of it. They did not even acquaint me with their intentions, and I only discovered them by chance, that is why I have been so reserved with you, dear grandpapa. Pray forgive me.\" But there was no look calculated to reassure her; all it seemed to say was, \"It is not only your reserve which afflicts me.\" \\n\\n \"What is it, then?\" asked the young girl. \"Perhaps you think I shall abandon you, dear grandpapa, and that I shall forget you when I am married?\" \\n\\n \"No.\" \\n\\n \"They told you, then, that M. d\u0027Epinay consented to our all living together?\" \\n\\n \"Yes.\" \\n\\n \"Then why are you still vexed and grieved?\" The old man\u0027s eyes beamed with an expression of gentle affection. \"Yes, I understand,\" said Valentine; \"it is because you love me.\" The old man assented. \"And you are afraid I shall be unhappy?\" \\n\\n \"Yes.\" \\n\\n \"You do not like M. Franz?\" The eyes repeated several times, \"No, no, no.\" \\n\\n \"Then you are vexed with the engagement?\" \\n\\n \"Yes.\" \\n\\n \"Well, listen,\" said Valentine, throwing herself on her knees, and putting her arm round her grandfather\u0027s neck, \"I am vexed, too, for I do not love M. Franz d\u0027Epinay.\" An expression of intense joy illumined the old man\u0027s eyes. \"When I wished to retire into a convent, you remember how angry you were with me?\" A tear trembled in the eye of the invalid. \"Well,\" continued Valentine, \"the reason of my proposing it was that I might escape this hateful marriage, which drives me to despair.\" Noirtier\u0027s breathing came thick and short. \"Then the idea of this marriage really grieves you too? Ah, if you could but help me--if we could both together defeat their plan! But you are unable to oppose them,--you, whose mind is so quick, and whose will is so firm are nevertheless, as weak and unequal to the contest as I am myself. Alas, you, who would have been such a powerful protector to me in the days of your health and strength, can now only sympathize in my joys and sorrows, without being able to take any active part in them. However, this is much, and calls for gratitude and heaven has not taken away all my blessings when it leaves me your sympathy and kindness.\" \\n\\n At these words there appeared in Noirtier\u0027s eye an expression of such deep meaning that the young girl thought she could read these words there: \"You are mistaken; I can still do much for you.\" \\n\\n \"Do you think you can help me, dear grandpapa?\" said Valentine. \\n\\n \"Yes.\" Noirtier raised his eyes, it was the sign agreed on between him and Valentine when he wanted anything. \\n\\n \"What is it you want, dear grandpapa?\" said Valentine, and she endeavored to recall to mind all the things which he would be likely to need; and as the ideas presented themselves to her mind, she repeated them aloud, then,--finding that all her efforts elicited nothing but a constant \"No,\"--she said, \"Come, since this plan does not answer, I will have recourse to another.\" She then recited all the letters of the alphabet from A down to N. When she arrived at that letter the paralytic made her understand that she had spoken the initial letter of the thing he wanted. \"Ah,\" said Valentine, \"the thing you desire begins with the letter N; it is with N that we have to do, then. Well, let me see, what can you want that begins with N? Na--Ne--Ni--No\" -- \\n\\n \"Yes, yes, yes,\" said the old man\u0027s eye. \\n\\n \"Ah, it is No, then?\" \\n\\n \"Yes.\" Valentine fetched a dictionary, which she placed on a desk before Noirtier; she opened it, and, seeing that the odd man\u0027s eye was thoroughly fixed on its pages, she ran her finger quickly up and down the columns. During the six years which had passed since Noirtier first fell into this sad state, Valentine\u0027s powers of invention had been too often put to the test not to render her expert in devising expedients for gaining a knowledge of his wishes, and the constant practice had so perfected her in the art that she guessed the old man\u0027s meaning as quickly as if he himself had been able to seek for what he wanted. At the word Notary, Noirtier made a sign to her to stop. \"Notary,\" said she, \"do you want a notary, dear grandpapa?\" The old man again signified that it was a notary he desired. \\n\\n \"You would wish a notary to be sent for then?\" said Valentine. \\n\\n \"Yes.\" \\n\\n \"Shall my father be informed of your wish?\" \\n\\n \"Yes.\" \\n\\n \"Do you wish the notary to be sent for immediately?\" \\n\\n \"Yes.\" \\n\\n \"Then they shall go for him directly, dear grandpapa. Is that all you want?\" \\n\\n \"Yes.\" Valentine rang the bell, and ordered the servant to tell Monsieur or Madame de Villefort that they were requested to come to M. Noirtier\u0027s room. \"Are you satisfied now?\" inquired Valentine. \\n\\n \"Yes.\" \\n\\n \"I am sure you are; it is not very difficult to discover that,\"--and the young girl smiled on her grandfather, as if he had been a child. M. de Villefort entered, followed by Barrois. \"What do you want me for, sir?\" demanded he of the paralytic. \\n\\n \"Sir,\" said Valentine, \"my grandfather wishes for a notary.\" At this strange and unexpected demand M. de Villefort and his father exchanged looks. \"Yes,\" motioned the latter, with a firmness which seemed to declare that with the help of Valentine and his old servant, who both knew what his wishes were, he was quite prepared to maintain the contest. \"Do you wish for a notary?\" asked Villefort. \\n\\n \"Yes.\" \\n\\n \"What to do?\" \\n\\n Noirtier made no answer. \"What do you want with a notary?\" again repeated Villefort. The invalid\u0027s eye remained fixed, by which expression he intended to intimate that his resolution was unalterable. \"Is it to do us some ill turn? Do you think it is worth while?\" said Villefort. \\n\\n \"Still,\" said Barrois, with the freedom and fidelity of an old servant, \"if M. Noirtier asks for a notary, I suppose he really wishes for a notary; therefore I shall go at once and fetch one.\" Barrois acknowledged no master but Noirtier, and never allowed his desires in any way to be contradicted. \\n\\n \"Yes, I do want a notary,\" motioned the old man, shutting his eyes with a look of defiance, which seemed to say, \"and I should like to see the person who dares to refuse my request.\" \\n\\n \"You shall have a notary, as you absolutely wish for one, sir,\" said Villefort; \"but I shall explain to him your state of health, and make excuses for you, for the scene cannot fail of being a most ridiculous one.\" \\n\\n 现在让我们来说说腾格拉尔夫人和她的女儿离开以后，在马西米兰和瓦朗蒂娜幽会期间检察官家里所发生的事情。 \\n\\n 维尔福先生走进他父亲的房间，后面跟着维尔福夫人。两位来访者向老人行了礼，和巴罗斯——一个忠心耿耿、已任职二十五年的仆人——讲了几句话，然后就在那个瘫老人的两旁坐下来。 \\n\\n 诺瓦蒂埃先生坐在一张下面有轮子可以推动的圈椅里。 \\n\\n 早晨，他坐到椅子上在房间里推过来推过去，到了晚上再让人把他从圈椅里抱出来。他的前面摆着一面大镜子，镜子里照着整个房间，可使他一点儿不必转动——他根本就不能转动——就可以看见所有走进房间里来的人和他四周的所有情形。诺瓦蒂埃先生虽然象一具僵尸一样一点儿动弹不得，但却用一种机警聪慧的表情望着这两个刚来的人，从他们这种周到的礼节上，他立刻看出他们是为着一件意想不到的要紧事而来的。他现在只剩下了视觉和听觉，在他这个看来只配到坟墓里去的可怜的躯壳里，只有这两样器官给他添上了一点生气，象是一炉死灰里的两处尚存的孤独的火光；可是，那怕只用这两种器官中的一个，他就可以表现出他脑子里仍旧还在活动的思想和感觉，他可以用眼光来传达他的内心活动，他的目光象是一个在荒漠里夜行的旅客所看到的远处的灯光，从这远处的灯光上，他可以知道在那一片黑暗和静寂中还有另外一个人醒着。诺瓦蒂埃的头发又长又白，一直披到他的肩头；睫毛又密且黑，睫毛底下的那一双眼睛，汇集着所有的活力、语言和智慧；这并不是什么稀奇事，在一个只用一种器官来代替其他各种器官的人，以前分散在全身的精力就凝聚到了一个地方。当然喽，他的手臂已不能活动，他的嗓子也已不能再发出声音，他的身体失去了活动能力，但那一对有神的眼睛已完全可以代替一切了。他用他的眼睛来发号施令；他用他的眼睛来表示感激之情——总之，他用一对活的眼睛表达出一具尸体头脑里的全部感想，在那副大理石般的脸上，有时会射出一道愤怒的火光，有时又会流露出一片喜悦的光泽，看了令人非常吃惊。 \\n\\n 只有三个人能懂得这个可怜的瘫老人的这种语言：就是维尔福、瓦朗蒂娜和我们刚提到过的那个老仆人。但维尔福很少来看他的父亲，除非绝对必需，他绝不愿意前来和他说什么话，所以这位老人的全部快乐都集中到了他的孙女儿身上。瓦朗蒂娜，以她的爱、她的耐心和她的热情，已学会了如何从诺瓦蒂埃的目光里明白他脑中的种种感觉。旁人虽无法懂得这种无声的语言，但她却能用他嗓子的各种语调，用他脸上的各种表情，和他灵魂里的全部热情把它传达出来，所以这位年轻女郎和这位无助的残废人之间，仍然可以进行畅谈，而后者的身体虽然几乎已不能称得上活着，但他依旧是一个知识广博、见解透晰和意志坚强的人。他的肉体虽已僵木，可是他的精神却仍能操纵一切。瓦朗蒂娜解决了这个奇特的语言问题，能很容易地懂得他的心思和把她自己的意见传达给他。她用孜孜不倦的热情，凡是日常生活上的普通事务，她极少会误解老人的意思，总能满足那依旧还活着而且还能思想的那大脑的希望和那个差不多已经死掉的身体的需要。至于那位仆人，我们已经说过了，他和他的主人已相处二十五年，所以他知道他的所有习惯，极少需要诺瓦蒂埃自己来要求什么东西。 \\n\\n 维尔福马上就要和他的父亲进行一次非同寻常的谈话了。他无需瓦朗蒂娜或那仆人的帮助。我们前面说过，他完全明白这位老人的语言，如果说他并没有常常利用这种理解力，那是因为他对父亲决不关心或懒得和他接触的缘故。所以他让瓦朗蒂娜到花园里去，并且支开巴罗斯，他自己坐在他父亲的右边，维尔福夫人则坐在左边，然后他就对他说：“阁下，我没有去叫瓦朗蒂娜来，并且还支开了巴罗斯，我想您不会觉着不高兴，因为我们要商量的这件事当着他们的面谈不合适。维尔福夫人和我要向您报告一个消息。” \\n\\n 在维尔福讲这一大段开场白的过程中，诺瓦蒂埃的脸上始终毫无表情，维尔福则恰恰相反，他极力想把他的眼光穿透到老人的心底里。 \\n\\n “这个消息，”检察官用那种冷淡和坚决的口气继续说，似乎要断然拒绝一切商量余地似的，“嗯，我们相信一定会得到您的赞许。” \\n\\n 那位残废人的眼光里仍然保持着那种漠然的表情，不让他的儿子探测到他脑子里的感想。他听着——只是表现出他听着而已。 \\n\\n “阁下，”维尔福又说，“我们想给瓦朗蒂娜操办婚事了。” \\n\\n 即使老人的脸是用蜡浇成的，也不能如此淡漠无情了，这个消息并没有在他的脸上产生任何动情的痕迹。 \\n\\n “婚事在三个月之内就要举行。”维尔福说。 \\n\\n 诺瓦蒂埃的眼睛仍然保持着那种毫无反应的表情。维尔福夫人这时也来参加谈话，接上说：“我们想您大概很关心这个消息，阁下，因为您一向非常钟爱瓦朗蒂娜，所以我们现在只要把她那个青年人的名字告诉您就得了。瓦朗蒂娜的这门亲事最理想不过了。他很有家产，社会地位也很高，至于他的人品，可以保证她将来生活得很幸福。而且他的名字您大概也不会完全不知道。我们说的那个人就是伊皮奈男爵，弗兰兹·奎斯奈尔先生。” \\n\\n 在他的妻子讲话的过程中，维尔福仔细打量着那老人的脸。当维尔福夫人说出伊皮奈这个名字的时候，诺瓦蒂埃先生眼睛里的瞳孔便开始渐渐放大，同时他的眼皮象一个快要讲话时的人的嘴唇那样抖动起来，他向维尔福夫人和他的儿子闪电般地扫射了一眼。检察官知道诺瓦蒂埃先生和老伊皮奈之间政治宿仇，很明白做这个宣布所产生出的激怒，但他假装没有觉得，等他的妻子说完以后就接着往下说下去。 \\n\\n “阁下，”他说，“您知道瓦朗蒂娜都快要十九岁了，所以必须赶快给她找上一门适当的亲事。我们作打算的时候并没有忘记您，我们事先已经打听得十分清楚：瓦朗蒂娜未来的丈夫同意——不是同意住在这座房子里，因为住在这里这一对年轻人大概会觉着不方便，而是同意您去和他们住在一起。您和瓦朗蒂娜从来都是相依为命的，这样就可以互相不分离，你的习惯也不至于受到破坏，那时您不仅有一个，而且会有两个孩子来照顾您了。” \\n\\n 诺瓦蒂埃的目光中显出了盛怒，显然那老人的脑子里在煎熬着某种极痛苦的念头。因为那悲愤的喊叫已升到了他的喉咙口，但因为喊不出来，所以几乎窒息了他。他的瞳孔和嘴唇憋得发了紫。维尔福静静地打开了一扇窗子，说道：“天气暖极了，把诺瓦蒂埃先生热坏了。”然后他又回到了他原来的地方，但没有再坐下来。 \\n\\n “这门亲事，”维尔福夫人又说道，“伊皮奈先生和他的家人也是很乐意的，而且，他也没什么近亲，只有一位叔父和一个婶娘，她母亲是在他出生的时候死的，他父亲在一八一五年遭人暗杀。当时他只有两岁。所以他可以自己拿主意。” \\n\\n “那次的暗杀事件很神秘，”维尔福说道，“凶手至今也没查出来，尽管有嫌疑的人不止一个。”诺瓦蒂埃费了很大的劲，竟在嘴边显出了微笑。“哦，”维尔福继续说道，“那些真正有罪的人，这桩罪案的主犯，总有一天会落到法律的手里的，然后他们将再受到上帝的审判，那些人大概倒很乐于处在我们的位置，嫁一个女儿给弗兰兹·伊皮奈先生，借此洗刷掉外表上的一切嫌疑。” \\n\\n 诺瓦蒂埃这次倒很能控制住自己的情绪，不象是一个衰弱瘫痪的人。“是的，我懂的。”他的目光中流露出这样的回答，在这种目光里，还有一种强烈的激愤和极其蔑视的情感。 \\n\\n 维尔福充分懂得他父亲的意思，他微微耸了耸肩，然后向他的妻子示意可以走了。 \\n\\n “现在，阁下，”维尔福夫人说道，“我必须向您告辞了。您要不要我叫爱德华来陪您一会儿？” \\n\\n 大家早就约定；假如老人表示同意，他就闭一下眼睛，假如表示不同意，就连眨几下，假如他想说什么，他就抬眼向天。假如他要瓦朗蒂娜来，就只闭他的右眼，假如要巴罗斯来，就闭左眼。此时听到维尔福人的这个建议，他立刻眨了几下眼睛。这种断然的拒绝使她很难堪，她咬了一下嘴唇，说道：“那么要我叫瓦朗蒂娜来吗？”老人热切地闭了眼睛，表明他正希望如此。维尔福夫妇鞠了一躬，走出了房间，吩咐去叫瓦朗蒂娜来。瓦朗蒂娜已经知道她今天得和诺瓦蒂埃先生特别多谈一次。她的父母刚一出去，她就进来了，脸上依旧带着激动的神情。她一眼就看出她的祖父很痛苦，知道他心里一定有很多事要讲给她听。“亲爱的爷爷”，她大声说道，“怎么啦？他们惹您不高兴了，您心里很不痛快是吗？” \\n\\n 那瘫子老人闭一闭眼睛，确认了。 \\n\\n “那么，您生谁的气呢？生我父亲的吗？不是。生维尔福夫人的吗？也不是。是生我的吗？” \\n\\n 老人作了一下肯定的表示。 \\n\\n “生我的？”瓦朗蒂娜惊愕地说。 \\n\\n 老人又肯定了一下这个意思。 \\n\\n “亲爱的爷爷，我做错了什么事，以致您要生我的气呢？” \\n\\n 瓦朗蒂娜大声说道。 \\n\\n 没有回答，于是她继续说：“我今天一整天没见过您。有人对您谈到我了吗？” \\n\\n “是的。”老人的目光急切地说。 \\n\\n “让我来想一想。我真可以向您保证，爷爷——啊！维尔福先生和维尔福夫人刚刚离开这个房间，是不是？” \\n\\n “是的。” \\n\\n “他们告诉了您一件事，您是因为那件事才动怒的，是不是？那么，是什么事呢？我可不可以先去问问他们，然后再来向您解释？” \\n\\n “不，不！”诺瓦蒂埃的目光说。 \\n\\n “啊！您吓坏我啦。他们都讲了些什么事呢？”于是她现出一种苦思冥想的样子。 \\n\\n “啊，我知道了，”她压低了声音，靠到老人身边说道，“他们谈到了我的婚事，对不对？” \\n\\n “是的。”那愤怒的目光回答。 \\n\\n “我懂了，您生气是因为我没告诉您这件事。可那是因为他们坚持要我保守秘密，求我一点都不要告诉您的，他们甚至都不让我知道他们的想法，我也是自己碰巧发现的。这就是我对您保持缄默的原因，亲爱的爷爷。请宽恕我吧。” \\n\\n 但老人的目光里并没有使她感到安心，它似乎在说：“我所生气的并不只是你的缄默。” \\n\\n “那么还有什么呢？”那青年女郎问道。“亲爱的爷爷，或许您以为我会抛弃您，以为我会在结婚之后忘了您，是不是？” \\n\\n “不。” \\n\\n “那么，他们已经告诉您伊皮奈先生同意我们大家住在一起报？” \\n\\n “是的。” \\n\\n “那么您为什么还要不高兴呢？” \\n\\n 老人的眼睛里露出了一种爱抚的目光。 \\n\\n “噢，我懂了，”瓦朗蒂娜说道，“那是因为您爱我。” \\n\\n 老人同意了。 \\n\\n “您是怕我将来会不快乐？” \\n\\n “是的。” \\n\\n “您不喜欢弗兰兹先生吗？” \\n\\n 那双眼眼接连眨了几下：“不，不，不。” \\n\\n “您不高兴结这门亲事吗？” \\n\\n “是的。” \\n\\n “嗯，听我说，”瓦朗蒂娜跪下来抱住她祖父的脖子说道，“我也很烦恼，因为我并不爱弗兰兹·伊皮奈先生。”老人的眼里闪烁出欣喜。“您还记得吗，当我想遁世入修道院的时候，您当时是多么得生我的气？”泪水在那不中用的老人的眼睛里颤动着。“嗯，瓦朗蒂娜继续说道，“我之所以想那么做，就是为了要逃避这个可恨的婚姻，当时我绝望极啦。”诺瓦蒂埃的呼吸变得急促沉重起来。“那么您真的也不高兴这桩婚事吗？啊，假如您能帮助我，假如我们能一同推翻他们的计划，那就好了！但您无法反对他们。您，您虽然头脑很灵敏，意志很坚决，但在这场抗争中，您却象我一样的软弱，象我一样的不是他们的对手。唉，要是您现在仍很健康有力的话，您会强有力地保护我的，可是您只能同情我的欢喜和悲哀！你的同情是我最后的快乐，幸亏上帝忘了这一点，才没有把它和我其他的一切快乐同时夺去。” \\n\\n 听了这些话，诺瓦蒂埃露出了一种意味深长的目光，以致姑娘觉得她从那种目光里读到了这些话：“你错了，我仍然可以帮你很大的忙。” \\n\\n “您真的以为能帮助我吗，亲爱的爷爷？”瓦朗蒂娜问道。 \\n\\n “是的。”诺瓦蒂埃抬起眼睛来。这是他和瓦朗蒂娜约定好了的，当他有所需求的时候就这样来表达他的意思。 \\n\\n “您要什么，亲爱的爷爷？”瓦朗蒂娜说道，并极力在脑子里搜索他可能需要的东西，想到一样就高声说出来；但当看到她的一切努力老是只得到一个“不”，她就说道，“来吧，既然我笨成这个样子，就来用那个大法宝吧。”于是她从头背起字母来，一边背，一边用她的微笑来讯问那瘫子老人的眼光。当背到Ｎ这个字母上，诺瓦蒂埃作了一个肯定的表示。 \\n\\n “啊，”瓦朗蒂娜说道，“您所想要的东西是以Ｎ打头的，那么我们从Ｎ来想办法好了。嗯，让我来想想看，从Ｎ打头的您能要什么东西呢？Ｎａ——Ｎｅ—Ｎｉ—Ｎｏ—” \\n\\n “是了，是了，是了。”老人的眼睛说。 \\n\\n “啊，那么是以Ｎｏ打头的了？” \\n\\n “是的。” \\n\\n 瓦朗蒂娜拿来了一本字典，把它放到诺瓦蒂埃面前的书桌上。她打开字典，看到老人的眼光全神贯注地盯在书上，就用手指顺着行次很快地上下数过去。诺瓦蒂埃陷入这种可悲的境地已有六年了，这六年间，瓦朗蒂娜的创造发明能力使她常常想出各种便于了解他的心思的方法，而她因此成了这方面的专家，再加经常的练习，她已娴熟地驾驭了这门技能，因此她才能极快地猜出老人的意思，简直和他能说话一样。当她指到Ｎｏｔａｒｙ（公证人）”这个字时，诺瓦蒂埃作了一个叫她停下来的表示。“公证人，”她说道，“您想要一个公证人吗，亲爱的爷爷？”老人又给了一个同意的表示。 \\n\\n “那么，您希望派人去找一个公证人来吗？”瓦朗蒂娜问道。 \\n\\n “是的。” \\n\\n “您要不要把您的意思告诉我的父亲？” \\n\\n “要的。” \\n\\n “您希望马上就去找公证人来吗？” \\n\\n “是的。” \\n\\n “那么叫他们立刻去找好了，亲爱的爷爷。您还要别的东西吗？” \\n\\n “不要了。” \\n\\n 瓦朗蒂娜拉铃吩咐仆人去告诉维尔福先生和夫人，请他们到诺瓦蒂埃先生的房间里来。 \\n\\n “您现在满意了吗？”瓦朗蒂娜说道。“满意了？我相信您已满意了。是吗？这事可真不容易猜到，是不是？”于是那姑娘向她的祖父微笑了一下，就好象他是一个小孩子似的。 \\n\\n 维尔福先生来了，后面跟着巴罗斯。“你叫我来有什么事，阁下？”他问那瘫子老人。 \\n\\n “阁下，”瓦朗蒂娜说道，“祖父想要一位公证人。” \\n\\n 听到这个意外的奇怪要求，维尔福先生把询问的目光转向了他的父亲。“是的，”后者表示确认，而且态度很坚决，表示瓦朗蒂姆和他的老仆都已知道了他的希望，而有了他们的帮助，他已准备好要和他进行一番斗争了。 \\n\\n “你想要一位公证人？”维尔福问道。 \\n\\n “是的。” \\n\\n “做什么？” \\n\\n “诺瓦蒂埃没有回答。 \\n\\n “你要公证人来做什么？” \\n\\n “那不中用的老人的眼光始终坚定不移，他正是用这种表情来显示他的决心是不可动摇的。 \\n\\n “您是想做什么事来对付我们吗？你觉得这样做值得吗？” \\n\\n 维尔福说道。 \\n\\n “唉，”巴罗斯说道，他要以一个老仆人的忠心来维护他的主人了，“如果诺瓦蒂埃先生想要找一位公证人，我想他大概是真的需要吧，我还是立刻去找一位来吧。”在巴罗斯眼里除了诺瓦蒂埃以外，他是不承认再有别的主人的，因而也就决不允许他主人的意愿受到任何阻挠。 \\n\\n “是的，我要一位公证人，”老人再次肯定地表示，带着一种挑衅的神气闭了一他的眼睛，象是说，“我倒想看看谁敢拒绝我的要求。” \\n\\n “既然你一定想要找一位公证人来，当然也可以，阁下，” \\n\\n 维尔福说道，“但我要先把你的身体状况解释给他听，替你先说明一下，免得到时候的情形显得可笑。” \\n\\n “没关系，”巴罗斯说道，“总之我去找一位公证人来就是了。”说完那老仆人便得意扬扬地办事去了。 \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/72/3977.html","bookId":545,"book":{"id":545,"title":"The Count of Monte Cristo基督山伯爵","description":"简介： 《基督山伯爵》是通俗历史小说，法国著名作家大仲马（1802-1870）的代表作。故事讲述19世纪法国皇帝拿破仑百日王朝时期，法老号大副爱德蒙唐泰斯受船长委托，为拿破仑党人送了一封信，遭到两个卑鄙小人和法官的陷害，被打入黑牢。狱友法利亚神甫向他传授各种知识，并在...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12865075139f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/72","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
