{"id":82237,"no":10,"title":"Page 10","content":"\"Major Gallatini\" the dark-haired copilot said over the muffled roar of the propellers. \"Six minutes to the drop zone!\"\n Michael nodded and stood up, grim-lipped. He hooked his ripcord\u0027s clamp around the brace that ran overhead the length of the transport aircraft\u0027s spine and walked to the closed door. above it was a dim red warning light, suffusing the plane\u0027s interior with crimson.\n It was the twenty-sixth of March, and the time on Michael\u0027s wristwatch was nineteen minutes after two. He closed his mind to the lurch and sway of the C-47 and began to inspect the parachute pack\u0027s straps, making sure they were hooked with equal pressure on either side of his groin. a strap tightening across the testicles almost a thousand feet in the air would not be his idea of a pleasant experience.\n He checked the buckles of the chest straps and then the top fold of the pack itself, making sure nothing would foul the lines as the chute billowed out. It was supposed to be a black chute, because there was a half-moon.\n \"Three minutes, Major,\" the polite copilot, a kid from New Jersey, said.\n \"Thank you.\" Michael felt the airplane veer slightly to starboard, the pilot correcting course either to avoid searchlights or an anti-aircraft emplacement. Michael breathed slowly and deeply, watching the red bulb above the doorway. His heart was beating hard, and sweat had dampened the inside of his dark green jumpsuit. He wore a black knit cap and his face was daubed with black and green camouflage paint. He hoped it would wash off easily, because it might draw a bit of unwanted attention on the avenue des Champs elysees.\n Strapped to his body was a short shovel with a folding blade, a knife with a serrated edge, a.45 automatic, and a pack of bullets. also a little box, zipped into his jacket, that contained two chocolate bars and some salted beef jerky. He figured the heat of his body would have melted the chocolate bars by now.\n \"One minute.\" The red light went out. The New Jersey kid pulled a latch and the C-47\u0027s doorway slid open, letting in a scream of wind. Michael immediately stepped into position, his boot tips on the edge and his arms braced against the doorway\u0027s sides. Below him was a black plain that just as well could have been dense forest or fathomless ocean. \"Thirty seconds!\" the copilot shouted against the wind and props noise.\n Something glinted, far below. Michael\u0027s breath snagged. another glint: a finger of light, rising from the earth, searching the sky.\n \"Oh Jeez,\" the other man said.\n The searchlight angled upward. They\u0027ve heard our engines, Michael realized. Now they\u0027re hunting. The light swung around, and its beam knifed through the dark less than a hundred feet below Michael\u0027s boots. He stood steady, but his gut twisted. There was a burst of red off to the left of the searchlight, followed by a thunderous boom and a white flash about five or six hundred feet over the C-47. The plane trembled from the shock wave, but stayed on course. a second anti-aircraft shell exploded higher up and more to the right, but the searchlight was coming around again for another sweep. The New Jersey kid, his face pallid, grasped Michael\u0027s shoulder. \"Major, we\u0027re screwed!\" he shouted. \"You want to scrub the dropi\"\n The aircraft was picking up speed, about to make a violent turn away from the drop zone. Michael knew there was no time for deliberation. \"I\u0027m going,\" he answered, and he jumped through the doorway with sweat on his face.\n He fell into darkness, his heart swelling and his stomach rising up in his abdomen. He clenched his teeth, his arms crossed and gripping his elbows. He heard the high whine of the plane passing on and then there was a bone-wrenching shock as the rip cord pulled and the chute trailed out of its pack with a soft, almost gentle pop.\n as the parachute bloomed, Michael Gallatin\u0027s hurtling descent was braked. He felt as if his internal organs, muscles, and bones were in brutal collision, his kneecaps jerking up so high they almost smashed into his chin. Then he got his legs straightened out and he grasped the chute\u0027s guidelines, his heart still racing from the impact with air. He heard another blast from the anti-aircraft cannon, but it was high and to the right and he was in no danger of being shredded by shrapnel. The searchlight veered toward him, stopped, and began to rotate in the other direction again, hunting the intruder. Michael gazed around at the dark earth below, looking for the sign he\u0027d been told to expect. It should be from the east, he remembered. The half-moon was over his left shoulder. He turned slowly under the expanded silk and searched the ground.\n There! a green light. a blinker, flashing out a quick tattoo.\n Then darkness again.\n He guided the chute toward the light and looked up to make sure the lines were all clear.\n The parachute was white.\n Damn it! he thought. Trust the supply service to screw things up! If a German soldier on the ground saw the white chute, there was going to be hell to pay. The searchlight crew had probably already radioed for a scout car or motorcycle team. Now not only was he in danger, but so was the person with the green blinker. Whoever that might be.\n The anti-aircraft cannon spoke again, a knell of distant thunder. But the C-47 was long gone, heading back across the Channel to England. Michael wished the two americans good luck, and turned his attention to his own difficulties. There was nothing to do at the moment but fall. When he touched ground, he\u0027d be ready for action, but right now he was dangling at the mercy of a white parachute.\n Michael looked up, listening to the wind hiss in the silk folds. It stirred a memory. So long ago... a world and a lifetime... so long ago, when he knew innocence.\n and suddenly, in a flash of memory, the sky was bright blue and there was not a white parachute over his head, but instead a white silk kite, unreeling from his hand to catch the breeze of Russia.\n \"Mikhail! Mikhail!\" a woman\u0027s voice called, over a field full of yellow flowers.\n and Mikhail Gallatinov, all of eight years old and still fully human, smiled with the May sun on his face. \n","sourceLink":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1/page-10.html","bookId":2469,"book":{"id":2469,"title":"The Wolf\u0027s Hour (Michael Gallatin #1)","description":"Storyline: \n The Wolf\u0027s Hour (Michael Gallatin #1) \n This book is a remarkable tale of pulse-pounding excitement with a uniquely sympathetic, fascinating portrait of the werewolf as noble warrior-and conflicted being. Complex, compelling and utterly real.\n \n","cover":"https://allnovel.net/images/the-wolf-s-hour-michael-gallatin-1.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:39:52 PM"}}
