{"id":82253,"no":26,"title":"Page 26","content":"Enraged, Camille no longer resembled a sweet, elderly lady. Her eyes glinted with red, and her face was inflamed from the roots of her snowy hair to the point of her chin. \"Bringing a German to my home!\" she shrieked, in the throes of a fit. \"I\u0027ll have you executed as a traitor for this!\" She glared at Michael, and looked at arno Mausenfeld as if he were something that she\u0027d just scraped off the sole of her shoe. \"You! Get out! I\u0027m not running a shelter for Nazi bums!\"\n \"Madam, I\u0027m not a Nazi,\" Mouse replied, with stern dignity. He drew himself up as tall as he could, but he was still three inches shorter than Camille. \"Neither am I a bum.\"\n \"Get out! Get out before I-\" Camille whirled away, ran to a dresser, and opened it. Her hand came out with an old, heavy Lebel revolver. \"I\u0027ll blow your dirty brains out!\" she hollered, all her Gallic graciousness gone, and she aimed the pistol at Mouse\u0027s head.\n Michael caught her wrist, tilted the pistol up, and scooped it from her grip. \"None of that, now,\" he scolded. \"You\u0027ll blow your own hand off with this antique.\"\n \"You deliberately brought this Nazi to my home!\" Camille raged, showing her teeth. \"You\u0027ve compromised our security! Whyi\"\n \"Because he can help me do my job,\" Michael told her. Mouse wandered into the kitchen, his clothes even more wretched and filthy in the light. \"I need someone to get a message to the man I\u0027m after. It needs to be done fast, without attracting a lot of attention. I need a pickpocket-and there he is.\" He nodded toward the German.\n \"You\u0027re out of your mind!\" Camille said. \"Utterly insane! Oh my God, I\u0027ve got a madman under my roof!\"\n \"I am not!\" Mouse replied. He stared at Camille, his heavily lined face dark with dirt. \"The doctors said I definitely am not a madman.\" He picked up the soup-pot lid and inhaled. \"Nice,\" he said. \"But bland. If you have paprika, I could spice it up for you.\"\n \"Doctorsi\" Gaby asked, frowning. \"What doctorsi\"\n \"The doctors at the nuthouse,\" Mouse went on. He pushed his hair out of his eyes with dirty fingers and then dipped those same fingers into the pot. He took a taste of onion soup. \"Oh, yes,\" he said. \"This could use some paprika. Possibly a touch of garlic, too.\"\n \"What nuthousei\" Camille\u0027s voice was shrill, and it quavered like an out-of-tune flute.\n \"The one I escaped from six months ago,\" Mouse said. He picked up a ladle and scooped out some soup, then slurped noisily. The others were silent, still watching him; Camille\u0027s mouth was open, as if she were about to let loose a dish-rattling scream. \"It was a place over on the west side of the city,\" Mouse said. \"For crack-ups and people who\u0027d shot themselves in the foot. I told them when they signed me up that I had weak nerves. Did they listeni\" another noisy slurp of soup, and the liquid ran down his chin to his shirt. \"No, they didn\u0027t listen. They said I\u0027d be in a field kitchen, and that I wouldn\u0027t see any action. But did the bastards say anything about the air raidsi No! Not a word!\" He took a mouthful of soup and sloshed it around between his cheeks. \"You know Hitler paints that mustache on, don\u0027t youi\" he asked. \"It\u0027s the truth! That cockless bastard can\u0027t grow a mustache. He wears women\u0027s clothes at night, too. ask anybody.\"\n \"Oh, God save us! a Nazi lunatic!\" Camille moaned softly, her face now matching the color of her hair. She staggered back, and Gaby caught her before she fell.\n \"This could stand a whole clove of garlic,\" Mouse said, and smacked his lips. \"It would be a masterpiece!\"\n \"Now what are you going to doi\" Gaby asked Michael. \"You\u0027ll have to get rid of him.\" She glanced quickly at the revolver he held.\n For one of the few times in his life Michael Gallatin felt like a fool. He\u0027d grasped at a straw, he realized, and he\u0027d come up with a bent twig. Mouse was happily drinking soup from the ladle and looking around the kitchen-obviously familiar territory to him. a bomb-shocked German escapee from a mental hospital was a fragile lever on which to move closer to adam; but what else did he havei Damn it! Michael thought. Why didn\u0027t I let this madman goi There was no telling what might happen if-\n \"You said something about a financial arrangement, I believe,\" Mouse said, and put the ladle down into the pot. \"What might you have in mindi\"\n \"Coins on your eyes when we float your body down the Seine!\" Camille shouted, but Gaby shushed her.\n Michael hesitated. Was the man useless, or noti Maybe no one but a lunatic would dare try what he was about to propose. But they\u0027d only get one chance, and if Mouse made a mistake they might all pay with their lives. \"I work for the British Secret Service,\" he said quietly. Mouse kept poking around the kitchen, but Camille gasped and almost swooned again. \"The Gestapo is watching an agent of ours. I have to get a message to him.\"\n \"The Gestapo,\" Mouse repeated. \"Mean bastards. They\u0027re everywhere, you know.\"\n \"Yes, I do know. That\u0027s why I need your help.\"\n Mouse looked at him, and blinked. \"I\u0027m German.\"\n \"I know that, too. But you\u0027re not a Nazi, and you don\u0027t want to go back to the hospital, do youi\"\n \"No. Of course not.\" He inspected a pan and tapped its bottom. \"The food there is atrocious.\"\n \"and I don\u0027t think you want to continue your life as a thief, either,\" Michael went on. \"What I\u0027d like for you to do will take maybe two seconds-if you\u0027re any good as a pickpocket. If not, the Gestapo will pick you up right on the street. and if that happens, I\u0027ll have to kill you.\"\n Mouse stared at Michael, his eyes startlingly blue against his grimy, seamed face. He put the pan aside.\n \"I\u0027ll give you a piece of folded paper,\" Michael said. \"That paper should be placed in the coat pocket of a man I\u0027ll describe to you and point out to you on the street. It\u0027ll have to be done fast and appear as if you simply bumped against him. Two seconds; no longer. There\u0027ll be a team of Gestapo men following our agent, possibly watching him along the route he walks. anything that looks slightly suspicious is going to draw them down on you. My friend\"-he nodded at Gaby-\"and I will be close by. If things go wrong, we\u0027ll try to help you. But my first loyalty is to our agent. If that means I have to shoot you along with the Gestapo, I won\u0027t hesitate.\"\n \"Of that I\u0027m certain,\" Mouse said, and plucked an apple from a clay bowl. He examined it for worms, then bit into it. \"You\u0027re from Britain, uhi\" he asked between crunches. \"My congratulations. Your German is very good.\" He glanced around the tidy kitchen. \"This isn\u0027t what I expected the underground to be. I thought it was a bunch of Frenchmen hiding in sewers.\"\n \"We leave the sewers for your kind!\" Camille shot back, still feisty.\n \"My kind,\" Mouse repeated, and shook his head. \"Oh, we\u0027ve lived in the sewers since 1938, madam. We\u0027ve been force-fed shit so long we began to enjoy the taste. I\u0027ve been in the army for two years, four months, and eleven days. a great patriotic duty, they said! a chance to expand the Reich and create a new world for all right-thinking Germans! Only the pure of heart and the strong of blood... well, you know the rest.\" He grimaced; he\u0027d bitten into a sour spot. \"Not all Germans are Nazis,\" he said quietly. \"But the Nazis have got the loudest voices and the biggest clubs, and they\u0027ve succeeded in beating the sense out of my country. So yes, I do know the sewers, madam. I know them very well indeed.\" His eyes looked scorched by inner heat, and he tossed the apple core into a basket. His gaze returned to Michael. \"But I\u0027m still a German, sir. Maybe I am insane, but I love my homeland-perhaps I love a memory of my homeland, instead of the reality. So why should I help you do anything that might kill my countrymeni\"\n \"I\u0027m asking you to help me prevent my countrymen from being killed. Possibly by the thousands, if I can\u0027t reach the man I\u0027m after.\"\n \"Oh, yes.\" Mouse nodded. \"Of course this has to do with the invasion.\"\n \"God strike us all!\" Camille moaned. \"We\u0027re ruined!\"\n \"Every soldier knows the invasion is coming,\" Mouse said. \"It\u0027s no secret. Only no one knows-yet-when it will be, or where. But it\u0027s inevitable, and even us dumb field kitchen cooks know that. One thing\u0027s for sure: once the Brits and the americans start marching over the coast, no damned atlantic Wall\u0027s going to stop them. They\u0027ll keep going all the way to Berlin; I just pray to God they\u0027ll get there before the damned Russians do!\"\n Michael let that comment pass. The Russians, of course, had been savagely fighting their way west since 1943.\n \"My wife and two children are in Berlin.\" Mouse sighed softly and ran a hand across his face. \"My eldest son... was nineteen when he went to war. On the Eastern Front, no less. They couldn\u0027t even scrape enough of him up to send back in a box. They sent me his medal. I put it on the wall, where it shines very pretty.\" His eyes had become moist; now they hardened again. \"If the Russians get to Berlin, my wife and children... well, that won\u0027t happen. The Russians will be stopped, long before they get to Germany.\" The way he said that made it clear he didn\u0027t believe his own conviction.\n \"You might help to shorten this war by doing what I ask,\" Michael told him. \"There\u0027s a lot of territory between the coast and Berlin.\"\n Mouse said nothing; he just stood staring into space, his hands hanging at his sides.\n \"How much money do you wanti\" Michael prodded.\n Mouse was silent. Then he said softly, \"I want to go home.\"\n \"all right. How much money do you need for thati\"\n \"No. Not money.\" He looked at Michael. \"I want you to get me to Berlin. To my wife and children. I\u0027ve been trying to find a way out of Paris ever since I escaped from the hospital. I couldn\u0027t get two miles out of the city before a security patrol picked me up. You need a pickpocket, and I need an escort. That\u0027s what I\u0027ll agree to.\"\n \"Impossible!\" Gaby spoke up. \"It\u0027s out of the question!\"\n \"Wait.\" Michael\u0027s voice was firm. He had been planning on finding a route to Berlin anyway, to contact agent Echo and find the big-game hunter who\u0027d had the Countess Margritta murdered. The photograph of Harry Sandler, smiling as he stood atop the carcass of a lion, had never been very far from Michael\u0027s mind. \"How would I get you therei\"\n \"That\u0027s your job,\" Mouse said. \"Mine is putting a piece of paper in a man\u0027s pocket. I\u0027ll do it-and I\u0027ll do it with no mistakes-but I want to go to Berlin.\"\n Now it was Michael\u0027s turn for silent deliberation. Getting himself to Berlin was one thing; escorting an escapee from a lunatic asylum was quite another. His instincts told him to say no, and they were rarely wrong. But this was a matter of fate, and Michael had little choice. \"agreed,\" he said.\n \"You\u0027re mad, too!\" Camille wailed. \"as mad as he is!\" But her voice wasn\u0027t as stricken as it had been before, because she recognized the method in his madness.\n \"We go tomorrow morning,\" Michael said. \"Our agent leaves his building at thirty-two minutes after eight. It takes him approximately ten minutes to walk his route. I\u0027ll work out on the map where I want the job done; in the meantime, you\u0027ll stay here tonight.\"\n Camille started to roar with indignation again, but there was no point in it. \"He\u0027ll sleep on the floor!\" she snapped. \"He won\u0027t dirty my linens!\"\n \"I\u0027ll sleep right here.\" Mouse motioned to the kitchen floor. \"I might get hungry tonight, anyway.\"\n Camille took the revolver back from Michael. \"If I hear any noise in here, I\u0027ll shoot to kill!\"\n \"In that case, madam,\" Mouse said, \"it\u0027s best to tell you that I snore.\"\n It was time to get some sleep. They all had a busy day tomorrow. Michael started for the bedroom, but Mouse said, \"Hey! Hold on! Which coat pocket do you want the paper ini Outside or insidei\"\n \"Outside will do. Inside would be better.\"\n \"Inside it is, then.\" Mouse took another apple from the bowl and crunched into it. He glanced at Camille. \"anyone going to offer me some soup, or must I starve to death before morningi\"\n She made a noise that might\u0027ve been a snarl, threw open a cupboard, and got a bowl for him.\n In the bedroom Michael took off his cap and shirt and sat on the edge of the bed, studying a map of Paris by the light of a white candle. another candle was lighted on the other side of the bed, and Michael looked up at Gaby\u0027s shadow as she undressed. He smelled the apple-wine fragrance of her hair as she brushed it back. It should be done equidistantly between adam\u0027s building and his office, he decided as he studied the map again. He found the spot he was looking for, and he marked it with his fingernail. Then he looked up once more, at the woman\u0027s shadow.\n He felt the fine down of hair stir from the back of his neck along his spine. Tomorrow was going to be a walk on the edge of danger; perhaps an encounter with death. His heart was beating harder. He watched Gaby\u0027s shadow as she peeled off her slacks. Tomorrow might bring death and destruction, but tonight they were alive, and...\n He smelled the faint aroma of cloves as Gaby drew back the sheet and slipped into bed. He folded the map of Paris and put it aside.\n Michael turned and looked at her. Candlelight glittered in her sapphire eyes, and her black hair lay over the pillow, the sheet barely up over her breasts. She looked back at him and felt her heart flutter; then she lowered the sheet, just a fraction of an inch, and Michael saw and recognized the invitation.\n He leaned over her, and he kissed her. Lightly at first, on the corners of her lips. and then her lips parted and he kissed her deeply, flame to flame. as their kiss went on, moist and hot, he could almost hear the steam drifting from their pores. Her lips tried to keep him, but he pulled away and stared at her. \"You don\u0027t know anything about me,\" he said softly. \"after tomorrow we might never see each other again.\"\n \"I know... I want to be yours tonight,\" Gaby said. \"and tonight I want you to be mine.\"\n She drew him to her, and he pulled the sheet aside. She was naked underneath, her body taut with anticipation. Her arms went around his neck, and they kissed while he reached down, unbuckled his belt, and undressed. as the candles threw their shadows large upon the walls, their bodies pressed together, embraced in the goosedown mattress. She felt his tongue flick across her throat, a touch that was so delicate yet so intense it made her gasp, and then his head slid downward and his tongue swirled between her breasts. She gripped his hair as his tongue moved in slow, precise circles. a fiery pulse beat inside her, growing hotter and stronger. Michael felt her tremble, the taste of her sweet flesh in his mouth, and he grazed his lips down her stomach, down to the dark curls between her thighs.\n His tongue in that place, moving as it did, made Gaby arch her body and clench her teeth to stifle a moan. He opened her like a pink flower, his fingers gentle. His tongue slowly traveled up and down the route Gaby had led him to. She gasped as he caressed her, starting to whisper his name, but realized she didn\u0027t know it and never would. But this moment, this sensation, this joy; these things were enough. Her eyes were moist, and so was her yearning center. Michael kissed the hollow of her throat with burning lips; he shifted his position and eased himself smoothly into her.\n He was large, but her body made room for him. He filled her with velvet heat, and her hands on his shoulders felt the muscles move beneath the skin. Michael balanced on his palms and toes above her, and thrust himself deep within, his hips moving to a slow rhythm that made Gaby gasp and moan. Their bodies entwined and thrust together, pulled apart and pressed together once again; Michael\u0027s sinuous, strong movements molded Gaby\u0027s body like hot clay, and she yielded her bones to his muscles. His nerves, his flesh, his blood sang with a symphony of sensations, aromas, and textures. The scent of cloves drifted up from the tangled sheet, and Gaby\u0027s body breathed the heady, pungent aroma of passion. Her hair was damp, beads of moisture glistening between her breasts. Her eyes were dreamy, fixed on an inner focus, and her legs clasped around his hips to hold him deep inside as he rocked her, gently. Then he was on his back and she above him, her body poised on his hardness, her eyes closed, her black hair cascading around her shoulders like a waterfall. He lifted his hips off the bed, and her body with him, and she leaned forward against his chest and whispered three soft words that had no meaning but the ecstasy of the moment.\n Michael cupped his body around hers, and she threw her hands back to grip the iron bedframe as they first strained against each other, then moved in a delicate unison. It became a dance of passion, a ballet of silk and iron, and at its zenith Gaby cried out, heedless of who might hear, and Michael let his control go. His spine arched, his body held in her pulsing grip, and the pressure flooded out of him in several bursts that left him dazed.\n Gaby was drifting, a white ship with billowing sails and a strong hand on the wheel. She relaxed into his embrace, and they lay together, breathing as one, as a distant cathedral chimed the midnight hour.\n Sometime before dawn, Michael brushed the hair away from her face and kissed her forehead. He stood up, careful so as not to awaken her, and he walked to the window. He looked out over Paris, as the sun showed a faint edge of pink against night\u0027s dark blue. It was already light over Stalin\u0027s land, and the sun\u0027s burning eye rose over Hitler\u0027s territory. This was the beginning of the day he\u0027d come from Wales for; within twenty-four hours he would have the information or he would be dead. He breathed the morning air and smelled the scent of Gaby\u0027s flesh on him.\n Live free, he thought. a last command from a dead king.\n The cool, brisk air reminded him of a forest and a white palace, a long time ago. The memories stirred a fever that would never be quenched; not by a woman, not by love, not by any city built by the hand of man.\n His skin prickled, as if by hundreds of needles. The wildness was on him, fast and powerful. Black hair rose across his back in bands, ran down the backs of his thighs, and streaked his calves. He smelled the odor of the wolf, wafting from his flesh. Bands of black hair, some of it mingled with gray, ran across his arms, burst from the backs of his hands, and quivered, sleek and alive. He lifted his right hand and watched it change, finger by finger; the black hair rippled across it, circling his wrist, tendrils of hair running up his forearm. His hand was changing shape, the fingers drawing inward with little cracklings of bone and cartilage that shot pain through his nerves and brought a sheen of sweat on his face. Two fingers almost disappeared, and where they\u0027d been were hooked, dark-nailed claws. His spine began to bow, with small clicking sounds and the pressure of squeezed vertebrae.\n \"What is iti\"\n Michael dropped his hand to his side, pinning his arm there. His heart jumped. He turned toward her. Gaby had sat up in bed, her eyes puffy with sleep and the aftermath of passion. \"What\u0027s wrongi\" she asked, her voice groggy but carrying a note of tension.\n \"Nothing,\" he said. His own voice was a raspy whisper. \"It\u0027s all right. Go back to sleep.\" She blinked at him and lay back down, the sheet around her legs. The bands of black hair on Michael\u0027s back and thighs faded, returning to the pliant, damp flesh. Gaby said, \"Please hold me. all righti\"\n He waited another few seconds. Then he lifted his right hand. The fingers were human again; the last of the wolf\u0027s hair was rippling from his wrist along his forearm, vanishing into his skin with needle jabs. He drew another deep breath, and felt his backbone unkinking. He stood at his full height again, and the hunger for the change left him. \"Of course,\" he told her as he slipped into bed and put his right arm-fully human once more-around Gaby\u0027s neck. She nestled her head against his shoulder and said drowsily, \"I smell a wet dog.\"\n He smiled slightly as Gaby\u0027s breathing deepened and she returned to sleep.\n a cock crowed. The night was passing, and the day of reckoning was upon him. \n","sourceLink":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1/page-26.html","bookId":2469,"book":{"id":2469,"title":"The Wolf\u0027s Hour (Michael Gallatin #1)","description":"Storyline: \n The Wolf\u0027s Hour (Michael Gallatin #1) \n This book is a remarkable tale of pulse-pounding excitement with a uniquely sympathetic, fascinating portrait of the werewolf as noble warrior-and conflicted being. Complex, compelling and utterly real.\n \n","cover":"https://allnovel.net/images/the-wolf-s-hour-michael-gallatin-1.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:39:52 PM"}}
