{"id":82265,"no":39,"title":"Page 39","content":"The black Mercedes arrived promptly at nine in the morning. It was another moody day, the sun hidden behind the thick gray clouds. The Nazi high command rejoiced at such weather: the allied bombers scrubbed their missions when the clouds closed in.\n The two men who emerged from the row house on the edge of the railroad tracks were vastly changed from those who\u0027d entered it the evening before. The Baron von Fange was clean-shaven, his black hair neatly trimmed and the weariness slept out of his eyes; he wore a gray suit and vest, a pale blue shirt with a thin gray-striped tie and a silver stickpin. On his feet were polished black shoes, and a beige camel-hair topcoat was draped over his shoulders. Black kid gloves completed his attire. One might have guessed the clothes were tailor-made. His valet, a short stocky man, was similarly clean-shaven and had a fresh haircut that did nothing for his large, unsightly ears. Mouse wore a dark blue suit, and a plain black bow tie. He was utterly miserable; the shirt\u0027s collar was starched to the point of strangulation, and his new, glossy black shoes pinched his feet like iron vises. He\u0027d also learned one of the duties of a valet: manhandling the calf-skin luggage, full of clothes for both the baron and himself. But, as Mouse hefted the luggage from the row house to the trunk of the Mercedes, he had to give the tailors credit for their attention to detail: all the baron\u0027s shirts were monogrammed, and even a scrolled FVF had been worked into the suitcases.\n Michael had already said his goodbyes to Gunther, Dietz, and the others. He settled himself into the backseat of the Mercedes. When Mouse started to climb into the back, Wilhelm-a big-shouldered man with a waxed gray mustache-said, \"a servant rides in the front seat,\" and firmly shut the rear passenger\u0027s door in Mouse\u0027s face. Mouse, grumbling under his breath, took his place in the front. Michael heard the Cross of Iron jingle in the little man\u0027s pocket. Then Wilhelm started the engine, and the Mercedes slid smoothly away from the curb.\n a partition of glass separated the front and rear seats. Michael smelled Echo\u0027s aroma in the car, a heady scent. The car was perfectly clean: no handkerchiefs, no pieces of paper, nothing to give a clue to Echo\u0027s identity. Or so Michael thought, until he opened the shining metal ashtray on the back of the driver\u0027s seat; in it there was not a trace of ashes, but instead a green ticket stub. Michael looked closely at the lettering on it: KinoElektra. The Cinema Elektra. He returned the stub to its resting place and closed the ashtray. Then he opened a little hinged rubber flap between himself and Wilhelm. \"Where are we goingi\"\n \"We have two destinations, sir. The first is to visit an artist.\"\n \"and the secondi\"\n \"Your lodgings while you enjoy Berlin.\"\n \"Will the lady be joining usi\"\n \"a possibility, sir,\" Wilhelm said, and that was all.\n Michael closed the flap. He glanced at Mouse, who was busy trying to stretch his shirt collar with a forefinger. Last night, while they\u0027d slept in the same room, Michael had heard Mouse sobbing. Mouse had gotten out of his bed and stood at the window in the darkness for a long time. Michael listened to the soft clink of the Iron Cross as Mouse had turned it over and over in his hand. Then, sometime later, Mouse had sighed deeply, snuffled his nose on his sleeve, and crawled back into his bed. The tinkling noise of the Iron Cross had ceased, and Mouse slept with the medal clenched in his fist. For now, at least, his crisis of the soul had passed.\n Wilhelm was an expert driver, which was good because the streets of Berlin were nightmares of horse-drawn wagons, army trucks, tanks, and streetcars, not to mention the areas that were clogged with smoldering rubble. as they drove toward the address of Theo von Frankewitz and a light rain began to patter down on the windshield, Michael mentally reviewed what he\u0027d learned from the dossiers.\n There was no new information about Jerek Blok; the man was a Hitler fanatic and a loyal Nazi party member whose activities since leaving his command of Falkenhausen concentration camp were shrouded in secrecy. Dr. Gustav Hildebrand, son of a German pioneer in the field of gas warfare, had a home near Bonn, where Hildebrand Industries was located. But there was a new item of interest: Hildebrand also maintained a residence and lab on the island of Skarpa, about thirty miles south of Bergen, Norway. as a summer home, that would be quite a journey from Bonn. and as a winter retreat... well, the winters were very long and very arctic that far north. So why did Hildebrand work in such an isolated placei Surely he could have found a more idyllic location. It was a point that merited looking into.\n Wilhelm drove slowly along Victoria Park, as rain slashed through the budding trees. It was another area of row houses and small shops, and pedestrians hurried along under umbrellas.\n Michael opened the flap once more. \"are we expectedi\"\n \"No, sir. Herr von Frankewitz was home at midnight; we\u0027ll find out if he\u0027s still in.\" Wilhelm was just creeping the Mercedes along the street. Looking for a signal, Michael thought. He saw a woman cutting roses in the window of a flower shop, and a man standing in a doorway trying to get an uncooperative umbrella open. The woman put her roses in a glass vase and set them in the window, and the man got his umbrella open and walked away. Wilhelm said, \"Herr Frankewitz is in, sir. That\u0027s his apartment building.\" He motioned to a structure of gray bricks on the right. \"It\u0027s apartment five, on the second floor.\" He braked the Mercedes. \"I\u0027ll be driving around the block. Good luck, sir.\"\n Michael got out, his coat collar up against the rain. Mouse started to get out, too, but Wilhelm grasped his arm. \"The baron goes alone,\" he said, and Mouse started to pull angrily away but Michael told him, \"It\u0027s all right. Stay in the car,\" and then he strode to the curb and into the building Wilhelm had indicated. The Mercedes drove on.\n The building\u0027s interior smelled like a damp tomb. Nazi slogans and epithets had been painted on the walls. Michael saw something slink past in the gloom. Whether it was a cat or a very large rodent, he couldn\u0027t tell for sure. He went up the staircase, and found the tarnished number \"5.\"\n He knocked on the door. Down the hallway, an infant squalled. Voices, a man and woman\u0027s, raised and tangled in argument. He knocked again on the door, aware of the small two-shot derringer in its special pocket of his vest: a gift from his hosts. No answer. He balled his fist to knock a third time, beginning to wonder if Wilhelm had gotten his signals crossed.\n \"Go away,\" a man\u0027s voice said from the other side of the door. \"I don\u0027t have any money.\"\n It was a tired gasp of a voice. The voice of someone whose breathing wasn\u0027t right. Michael said, \"Herr von Frankewitzi I have to talk to you, please.\"\n a silence. Then: \"I can\u0027t talk. Go away.\"\n \"It\u0027s very important.\"\n \"I said I have no money. Please... don\u0027t bother me. I\u0027m a sick man.\"\n Michael heard footsteps shuffling away. He said, \"I\u0027m a friend of your friend in Paris. The opera lover.\"\n The footsteps stopped.\n Michael waited.\n \"I don\u0027t know who you\u0027re talking about,\" Frankewitz rasped, standing close to the door.\n \"He told me you\u0027d done some painting recently. Some metal work. I\u0027d like to discuss it with you, if I may.\"\n another silence stretched. Von Frankewitz was either a very careful man or a very frightened one. and then Michael heard the clicking of locks disengaging. a bolt was thrown back, and the door opened about two inches. a slice of a white-fleshed face appeared in the crack, like the visage of a ghost emerging from a crypt. \"Who are youi\" Frankewitz whispered.\n \"I\u0027ve traveled a long way to see you,\" Michael said. \"May I come ini\"\n Frankewitz hesitated, his pallid face hanging in the darkness like a quarter moon. Michael saw a gray eye, bloodshot, and a thicket of oily brown hair tumbling over a high, white forehead. The gray eye blinked. Frankewitz opened the door and stepped back, allowing Michael to enter.\n The apartment was a close, dark place with narrow windows filmed by the soot of Berlin\u0027s factories. a threadbare black and gold Oriental carpet covered the wooden floor, which felt none too sturdy under Michael\u0027s shoes. The furniture was heavy and ornate, the kind of things kept in dusty museum basements. Everywhere there were throw pillows, and the arms of a sea-green sofa were protected with lace coverlets. The apartment odors assailed Michael\u0027s nostrils: the smoke of cheap cigarettes, a sweet floral cologne, oil paints and turpentine, and the bitter scent of sickness. In a corner of the room, near one of the slender windows, was a chair, an easel, and a canvas with a landscape in progress: a red sky above a city whose buildings were made of bones.\n \"Sit here. It\u0027s the most comfortable.\" Frankewitz swept a pile of dirty clothes off the sea-green sofa, and Michael sat down. a spring stabbed his spine.\n Frankewitz, a skinny man wearing a blue silk robe and slippers, circled the room straightening crooked lamp shades, pictures, and a bunch of wilted flowers in a copper vase. Then the artist sat down in a high-backed black chair, crossed his thin white legs, and reached for a pack of cigarettes and an ebony cigarette holder. He screwed a cigarette in with nervous fingers. \"You\u0027ve seen Werner, theni How is hei\"\n Michael realized Frankewitz was talking about adam. \"He\u0027s dead. The Gestapo killed him.\"\n The other man\u0027s mouth opened, and a small gasp came out. His fingers fumbled with a pack of matches. The first match was damp, shooting a tiny spark before it went out. He got the cigarette lit with the second match, and he drew deeply from the ebony holder. a smoky cough welled up from his lungs, followed by a second, third, and then a flurry of coughs. His lungs rattled wetly, but when the fit of coughing was over, the artist puffed on his cigarette holder again, his sunken gray eyes damp. \"I\u0027m sorry to hear that. Werner was... a gentleman.\"\n It was time to take the leap. Michael said, \"Did you know that your friend worked for the British Secret Servicei\"\n Frankewitz smoked his cigarette in silence, the little red circle glinting in the gloom. \"I did,\" he answered at last. \"Werner told me. I\u0027m not a Nazi. What the Nazis have done to this country-and to my friends... well, I have no love for the Nazis.\"\n \"You told Werner about taking a trip to a warehouse, and painting bullet holes on green metal. I\u0027d like to know how you came to do that work. Who employed youi\"\n \"a man.\" Frankewitz\u0027s thin shoulders shrugged beneath the blue silk. \"I never knew his name.\" He pulled on the cigarette, exhaled smoke, and coughed harshly again. \"Forgive me,\" he said. \"I\u0027m sick, you see.\"\n Michael had already noticed the crusted sores on Frankewitz\u0027s legs. They looked like rat bites. \"How did this man know you could do the jobi\"\n \"art is my life,\" Frankewitz said, as if that explained everything. But then he stood up, moving like an old man though he couldn\u0027t be more than thirty-three, and he went over to the easel. Leaning against the wall near it was a stack of paintings. Frankewitz knelt down and began to go through them, his long white fingers as tentative as if having to prod sleeping children awake. \"I used to paint, in a cafe not too far from here. I\u0027d moved indoors for the winter. This man came in for coffee. He watched me working. Later he came in again, and several more times. ah, here you are!\" He was addressing a painting. \"This is what I was working on.\" He pulled the canvas out and showed it to Michael. It was a self-portrait, of Frankewitz\u0027s face in what appeared to be a cracked mirror. The cracks looked so real Michael imagined slicing a finger on one of the jagged edges. \"He brought another man in to see it: a Nazi officer. I later found out the second man\u0027s name was Blok. Then, maybe two weeks later, the first man came to the cafe and asked me if I\u0027d like to make some money.\" Frankewitz smiled faintly, a chilling smile on that frail white face. \"I can always use money. Even Nazi money.\" He regarded the self-portrait for a moment; the face in the picture was a fantasy of self-flattery. Then he returned the canvas to the stack and stood up. Rain was slashing against the windows, and Frankewitz watched the drops run trails across the grimy glass. \"They picked me up one night, and we drove to the airfield. Blok was there, and several more men. They blindfolded me before we took off.\"\n \"So you have no idea where you landedi\"\n Frankewitz returned to his chair and pushed the cigarette holder between his teeth again. He watched the rain falling, blue smoke drifting from his mouth and his lungs rasping as he breathed. \"It was a long flight. We landed once, for refueling. I could smell the fuel. and I felt the sun on my face, so I knew we were flying west. When we landed, I could smell the sea. They led me into a place where they took off my blindfold. It was a warehouse, without windows. The doors were locked.\" a blue haze of smoke whirled slowly around Frankewitz\u0027s head. \"They had all the paint and tools I needed, arranged very neatly. They had a little room for me to live in: a chair and cot, a few books and magazines, a Victrola. again, no windows. Colonel Blok took me to a large room where the pieces of metal and glass were laid out, and he told me what he wanted done. Bullet holes, he said; cracks in the glass, just as I\u0027d done the cracked mirror in my painting. He said he wanted patterns of holes painted on the metal, and he marked them with a piece of chalk. I did the work. When I finished, they blindfolded me and led me out to an airplane again. another long flight, and then they paid me and drove me home.\" He tilted his head to one side, listening to the music of the rain. \"That\u0027s all.\"\n Hardly, Michael thought. \"and how did ad-Werner find out about thisi\"\n \"I told him. I\u0027d met Werner last summer. I was in Paris, with another friend. as I said, Werner was a gentleman. a dear gentleman. ah, well.\" He made a despondent motion with his cigarette holder, and then terror flickered across his face. \"The Gestapo... they didn\u0027t... I mean, Werner didn\u0027t tell them about me, did hei\"\n \"No, he didn\u0027t.\"\n Frankewitz sighed with relief. another cough gurgled up, and he suffered another spasm. \"Thank God,\" he said when he could speak again. \"Thank God. The Gestapo... they do terrible things to people.\"\n \"You said they led you from the airplane to the warehouse. They didn\u0027t drive youi\"\n \"No. It was maybe thirty paces, no more than that.\"\n Then the warehouse had been part of the airfield, Michael thought. \"What else was stored in the warehousei\"\n \"I didn\u0027t get much of a chance to look around. There was always a guard nearby. I did see some barrels and crates. Oil drums, I think they were, and some machinery. Gears and things.\"\n \"and you overheard the term \u0027Iron Fist\u0027i Is that righti\"\n \"Yes. Colonel Blok was talking to a man who came to visit. He called the man Dr. Hildebrand. Blok used that name several times.\"\n Here was a point that needed clarification. Michael said, \"Why did Blok and Hildebrand let you overhear them talking if the security was so tighti You had to be in the same room with them, yesi\"\n \"Of course I was. But I was working, so maybe they thought I wasn\u0027t listening.\" Frankewitz blew a plume of smoke toward the ceiling. \"anyway, it wasn\u0027t such a secret. I had to paint them.\"\n \"Paint themi Paint whati\"\n \"The words. Iron Fist. I had to paint them on a piece of metal. Blok showed me how to make the letters, because I don\u0027t read English.\"\n Michael paused as that sank in. \"Englishi You painted-\"\n \" \u0027Iron Fist\u0027 in English letters,\" Frankewitz said. \"On the green metal. Olive green to be exact. Very drab. and underneath that I painted the picture.\"\n \"The picturei\" Michael shook his head. \"I don\u0027t understand.\"\n \"I\u0027ll show you.\" Frankewitz went to the easel, sat down in the chair, and arranged a pad of drawing paper in front of him. He picked up a charcoal pencil as Michael came up to stand behind him. Frankewitz spent a moment in silent deliberation, then began to sketch. \"This is very rough, you understand. My hand hasn\u0027t been doing what I\u0027ve asked of it lately. It\u0027s the weather, I think. This apartment\u0027s always damp in the springtime.\"\n Michael watched the drawing take shape. It was a large, disembodied fist, covered with armor plate. The fist was squeezing a figure that had yet to be defined.\n \"Blok stood and watched over my shoulder, just as you are,\" Frankewitz said. The pencil drew skinny legs dangling down from the iron fist. \"I had to do the rough sketch five times before he was satisfied with it. Then I painted it on the metal, beneath the lettering. I graduated in the upper third of my class at art school. The professors said I had \u0027promise.\u0027 \" He smiled wanly, his hand working as if with a mind of its own. \"The bill collectors bother me all the time. I thought you were one of them.\" He was drawing a pair of limp arms. \"I do my best work in the summer,\" he said. \"When I can get out in the park, in the sunshine.\"\n Frankewitz had finished the figure\u0027s body: a cartoonish form, caught in the fist. He started on the head and facial features. \"I had a painting in an exhibition once. Before the war. It was a picture of two goldfish swimming in a green pond. I\u0027ve always liked fish; they seem so peaceful.\" He drew in a pair of wide, bulging eyeballs and an uptilted slash of a nose. \"Do you know who bought that paintingi One of Goebbels\u0027s secretaries. Yes. Goebbels himself! That picture might be hanging in the Reich Chancellery, for all I know!\" He sketched a sweep of dark hair hanging down over the forehead. \"My signature, in the Reich Chancellery. Well, the world is a strange place, isn\u0027t iti\" He completed the face with a black square of a mustache, and lifted the pencil. \"There. That\u0027s what I painted for Colonel Blok.\"\n It was a caricature of adolf Hitler, his eyes popping and his mouth open in an indignant cry as he was squeezed by the iron fist.\n Michael was speechless. Wheels were spinning in his brain, but they found no traction. SS Colonel Jerek Blok, a Nazi loyalist, had paid Frankewitz to paint a rather ludicrous caricature of the Reich\u0027s Fuhreri It made no sense! This was the kind of disrespect that granted a person an appointment with a noose, and it had been authorized by a Hitler fanatic. The bullet holes, the cracked glass, the caricature, the iron fist... what was it all abouti\n \"I asked no questions.\" Frankewitz stood up from his chair. \"I didn\u0027t want to know. all I wanted was to get home alive. Blok told me they might need me again, to do some more work. He told me it was a special project, and that if I let anyone else know about it the Gestapo would find out and come visit me.\" He smoothed the wrinkles in his silk robe, his fingers nervous again. \"I don\u0027t know why I told Werner. I knew he was working for the other side.\" Frankewitz watched the rain streaming down the windows, his gaunt face streaked with shadows. \"I think... I did it because... of the way Blok looked at me. as if I were a dog that could do tricks. It was in his eyes: he loathed me, but he needed me. and perhaps he didn\u0027t kill me because he thought he might need me again. I\u0027m a human being, not a beast. Do you understand thati\"\n Michael nodded.\n \"That\u0027s all I know. I can\u0027t help you any more.\" Frankewitz\u0027s breathing had gotten hoarse again. He found another match and relit his cigarette, which had gone cold. \"Do you have any moneyi\" he asked.\n \"No, I don\u0027t.\" He had a wallet, given to him by his hosts, but there was no money in it. He stared at Frankewitz\u0027s long white fingers, then he took off his kid gloves and said, \"Here. These are worth something.\"\n Frankewitz took them without hesitation. Blue smoke wafted from his lips. \"Thank you. You\u0027re a true gentleman. There aren\u0027t many of us left in the world.\"\n \"You\u0027d better destroy that.\" Michael motioned toward the Hitler cartoon. He moved to the door and paused to add a final note. \"You didn\u0027t have to tell me these things. I appreciate it. But one thing I have to tell you: I can\u0027t say that you\u0027re safe, knowing what you do.\"\n Frankewitz waved his cigarette holder, leaving a scrawl of smoke in the air. \"Is anyone safe in Berlini\" he asked.\n For that question Michael had no answer. He began to unlatch the door; the dank room with its narrow, grimy windows had started to suffocate him.\n \"Will you come visit me againi\" Frankewitz had finished his cigarette, and he crushed it in a green onyx ashtray.\n \"No.\"\n \"For the best, I suppose. I hope you find what it is you\u0027re looking for.\"\n \"Thank you. I do, too.\" Michael slipped the final lock, left the apartment, and closed the door behind him. Immediately he heard Theo von Frankewitz relocking the door on the other side; it was a frantic sound, the noise of an animal scurrying in a cage. Frankewitz coughed a few times, his lungs clogged with fluid, and then Michael walked down the corridor to the stairs and descended to the rain-swept street.\n Wilhelm pulled the Mercedes smoothly to the curb, and Michael got in. Then the driver started them off again, heading west through the rain.\n \"You found out what you needed to knowi\" Mouse asked when Michael volunteered no information.\n \"It\u0027s a beginning,\" he answered. Hitler being crushed by an iron fist. Bullet holes on green-painted metal. Dr. Hildebrand, the researcher of gas warfare. a warehouse, on a landing strip where the air smelled of the sea. a beginning, yes: the entrance to a maze. and the invasion of Europe, poised to take place when the spring\u0027s wild tides eased. The first week of June, Michael thought. Hundreds of thousands of lives in the balance. Live free, he thought, and smiled grimly. The heavy yoke of responsibility had settled around his shoulders. \"Where are we goingi\" he asked Wilhelm after another few minutes.\n \"To check you in, sir. You\u0027re a new member of the Brimstone Club.\"\n Michael started to ask what that was, but Wilhelm\u0027s attention was on his driving and the rain was slashing down again. Michael stared at his own gloveless hands, while the questions turned in his mind and the torrent clawed at the windows. \n","sourceLink":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1/page-39.html","bookId":2469,"book":{"id":2469,"title":"The Wolf\u0027s Hour (Michael Gallatin #1)","description":"Storyline: \n The Wolf\u0027s Hour (Michael Gallatin #1) \n This book is a remarkable tale of pulse-pounding excitement with a uniquely sympathetic, fascinating portrait of the werewolf as noble warrior-and conflicted being. Complex, compelling and utterly real.\n \n","cover":"https://allnovel.net/images/the-wolf-s-hour-michael-gallatin-1.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:39:52 PM"}}
