{"id":82283,"no":58,"title":"Page 58","content":"The iron bolt shrieked back.\\n\\n at once Michael was on his haunches, roused from a nightmare of chimneys whose black smoke covered the earth. The door opened. \"Send the girl out!\" one of the three soldiers who stood there commanded.\\n\\n \"Please,\" Lazaris said, his voice husky from sleep. \"Please let her alone. Hasn\u0027t she suffered e-\"\\n\\n \"Send the girl out!\" the man repeated.\\n\\n The girl had awakened, and was shivering in a corner. She made a soft whimpering noise, like a trapped rabbit.\\n\\n Michael had reached the end of what he would bear. He crouched in front of the doorway, his green eyes glittering above the darkness of his fresh beard. \"If you want her so badly,\" he said in German, \"then come in and take her.\"\\n\\n a rifle bolt was cocked. The barrel thrust in at him. \"Out of the way, you vermin.\"\\n\\n \"Gallatinov!\" Lazaris pulled at him. \"are you crazyi\"\\n\\n Michael remained where he was. \"Come in, you sons of bitches. Three against one. What are you waiting fori\" He shouted it: \"Come on!\"\\n\\n None of the Germans accepted his invitation. They wouldn\u0027t shoot him, Michael reasoned, because they knew Blok and Krolle hadn\u0027t finished with him. One of the soldiers gathered saliva in his mouth and spat at Michael, and then the door was slammed shut and latched again.\\n\\n \"Now you\u0027ve done it!\" Lazaris fretted. \"God knows what you\u0027ve awakened!\"\\n\\n Michael spun around and grasped the other man\u0027s beard. \"You listen to me,\" he said. \"If you want to forget you\u0027re a man, that\u0027s fine with me, but I\u0027m not going to lie here and moan for the rest of my life! You protected the girl when you thought I was after her; why won\u0027t you protect her from those bastardsi\"\\n\\n \"Because\"-Lazaris worked Michael\u0027s hand off his beard-\"you\u0027re only one, and they are legion.\"\\n\\n The door was unlocked again. \"Mercy of God!\" Metzger shrieked. The door opened. Now six soldiers stood in the corridor.\\n\\n \"You!\" The beam of a hand torch found Michael\u0027s face. \"Come out of there!\" It was Bauman\u0027s voice.\\n\\n Michael didn\u0027t move.\\n\\n \"You won\u0027t like it if we have to drag you out,\" Bauman promised.\\n\\n \"Neither will the Kraut who tries to drag me.\"\\n\\n a Luger emerged from Bauman\u0027s holster. \"Do it,\" he told the other soldiers. They hesitated. \"Do it, I said!\" Bauman thundered, and he gave the nearest man a kick in the pants.\\n\\n The first soldier crouched and started into the kennel. He reached out to grasp Michael\u0027s arm, and Michael smashed a handful of filthy hay into the man\u0027s face and followed that with a blow to the jaw that cracked like a gunshot. a second man hurtled through the door, and a third right behind him. Michael warded off a punch, then struck into the second soldier\u0027s throat with the flat of his hand. The third man caught Michael\u0027s jaw with a glancing blow, and a fourth soldier lunged upon him and hooked an arm around his throat. The girl began to scream, a high thin shriek that had years of terror behind it.\\n\\n The sound-so much like the voice of a wolf, calling in the night-galvanized Michael. He drove his elbows backward into the rib cage of the man who was throttling him. The soldier grunted with pain and his grip loosened, and Michael thrashed free. a fist struck his bruised shoulder, and another hammered at his skull. He shook off a body with such force that the man was slammed against the wall. a knee thudded into his back, and fingers raked his eyes. There was a shrill cry of pain, and suddenly the soldier who was trying to gouge his eyes out flailed at the emaciated figure that had leaped upon him. Metzger\u0027s teeth had sunk into the soldier\u0027s cheek, and he was ripping the flesh like a maddened terrier.\\n\\n Michael kicked out, and caught another soldier on the point of the chin. The man was hurled through the door and clipped Bauman\u0027s legs. Bauman lifted a whistle to his mouth and began to blow quick, shrill notes. a fist swung past Michael\u0027s head, thunking into a Germanic face; with a hoarse roar Lazaris swung again, and this time burst the man\u0027s upper lip open in a spray of crimson. Then Lazaris grasped the hair of a guard whose SS cap had spun away, and slammed his forehead against the man\u0027s skull with a noise like an ax blade meeting timber.\\n\\n a blackjack rose up like a cobra\u0027s head. Michael grabbed the wrist before the soldier could strike, and drove his fist into the man\u0027s armpit. He heard a rush of air behind him. Before he could twist around, a rifle butt hit him in the center of the back, between his shoulder blades, knocking the breath from his lungs. The blackjack crunched down on his arm, just above the elbow, and froze it with pain. a fist struck him on the back of the head, stunning him, and though he kept fighting wildly, he knew he was all but used up.\\n\\n \"Bring him out!\" Bauman shouted as other soldiers came to his assistance. \"Come on, hurry it up!\"\\n\\n The blackjack wielder began to beat at Lazaris and Metzger, driving them back against the wall. Two of the soldiers grabbed the blind girl and started hauling her out. Michael was thrown onto the corridor floor, where Bauman put a boot on his throat. The rest of the guards, most of them bruised and bleeding, scrambled out of the kennel.\\n\\n Michael heard a submachine gun being cocked. He looked up, his vision misted with pain, and saw a guard pointing his Schmeisser into the kennel. \"No!\" Michael croaked, Bauman\u0027s foot pressed to his neck.\\n\\n The gun fired, two short bursts amid the remaining five prisoners. Spent cartridges clattered to the stones.\\n\\n \"Stop that!\" Bauman shouted, and uptilted the Schmeisser with the barrel of his pistol. another quick burst pocked the stone wall and rained fragments and dust around them. \"No firing without a direct order!\" he raged, his eyes wild behind his glasses. \"Do you understand mei\"\\n\\n \"Yes, sir,\" the guard replied, thoroughly cowed, and he clicked the safety on his smoking gun and lowered it to his side.\\n\\n Bauman\u0027s face had turned scarlet. He removed his foot from Michael\u0027s neck. \"You know every round of ammunition has to be accounted for!\" he shouted at the gunner. \"I\u0027ll be filling out reports for a week with all that damned firing!\" He motioned disdainfully to the kennel. \"Close that up! and you men, get this trash on his feet!\" He started striding along the corridor, and Michael was made to follow, his head pounding and his knees threatening to give way.\\n\\n He was returned to the room with the X-shaped metal table. a light bulb burned overhead. \"Strap him down,\" Bauman said. Michael began to fight again, dreading the bite of those straps, but he was exhausted and the issue was quickly settled. The straps were pulled tight. \"Leave us,\" Bauman told the soldiers. When they were gone, he removed his glasses and slowly cleaned the lenses with a handkerchief. Michael noted that his hands were shaking.\\n\\n Bauman put his glasses back on. His face was haggard, dark circles under his eyes. \"What\u0027s your real namei\" he asked.\\n\\n Michael remained silent, some of the fog clearing out of his mind but his back and shoulders still hurting like hell.\\n\\n \"I mean what they call you in Britain,\" Bauman went on. \"You\u0027d better talk quick, my friend! There\u0027s no telling when Krolle might come around, and he\u0027s aching to use that baton on you!\"\\n\\n Michael was puzzled. Bauman\u0027s tone of voice had changed; it was urgent, not superior. a trick, he thought it must be. Of course it was!\\n\\n \"Chesna van Dorne hasn\u0027t been captured yet.\" Bauman lifted the table so Michael was almost upright, and locked it in place. \"Her friends-our friends-are helping her hide. She\u0027s also working on the arrangements.\"\\n\\n \"arrangementsi\" His throat felt bruised from the pressure of Bauman\u0027s boot. \"What arrangementsi\"\\n\\n \"To get you out of here. and also to find a plane and set up the fuel stops. You were planning on going to Norway, correcti\"\\n\\n Michael was shocked speechless. It had to be a trick! My God! he thought. Chesna\u0027s been captured, and she\u0027s told everything!\\n\\n \"Listen to me very carefully.\" Bauman stared into Michael\u0027s eyes. a pulse beat rapidly at the German\u0027s temple. \"I am here because I had a choice. Either fieldwork, which meant risking getting my ass shot off or being hung up from the balls by the Russians, or working here in this... this slaughterhouse. In the field I could do nothing for our friends; here I can at least communicate with them, and do what I can to help certain prisoners. Incidentally, if your intent was to get everyone in your cell murdered, you came very close to accomplishing it.\"\\n\\n That explained the dramatics with the machine gun, Michael thought. Bauman was trying to keep the others from being killed. No, no! Blok or Krolle had set him up to this! This was all stage play!\\n\\n \"My task,\" Bauman said, \"is to keep you alive until the arrangements are worked out. I don\u0027t know how long that will be. I\u0027ll get a radio code that will tell me how your escape\u0027s going to be managed. God help us, because prisoners only leave Falkenhausen as bags of fertilizer. I\u0027ve made a suggestion; we\u0027ll see if Chesna thinks it\u0027s worthwhile.\"\\n\\n \"What suggestioni\" he asked warily.\\n\\n \"Falkenhausen was built to keep prisoners in. The camp is understaffed and the guards are used to docility. Which is why you were very stupid just now. Don\u0027t do anything to call attention to yourself!\" He paced back and forth as he talked. \"Just play the brain-dead prisoner, and you might survive a week!\"\\n\\n \"all right,\" Michael said, \"let\u0027s pretend I believe you. How would I get outi\"\\n\\n \"The guards-and Krolle, too-have gotten lazy. There are no uprisings here, no escape attempts, nothing to upset the day-to-day routine. The guards don\u0027t expect anyone to try to break out, simply because it would be impossible. But\"-he stopped pacing-\"neither do they expect anyone to try to break in. and that may be a distinct possibility.\"\\n\\n \"Break ini To a concentration campi That\u0027s crazy!\"\\n\\n \"Yes, Krolle and the guards would think so, too. as I said, Falkenhausen was built to keep prisoners in, but maybe not to keep a rescue team out.\"\\n\\n a faint ember of hope sparked within Michael. If this man was acting, he deserved star billing with Chesna. But Michael didn\u0027t let himself believe it yet; it would be utter foolishness to go along with this, and perhaps spill precious secrets in the process.\\n\\n \"I know this is difficult for you. If I were in your position, I\u0027d be skeptical as well. You\u0027re probably thinking I\u0027m trying to lead you into a trap of some kind. Maybe nothing I can say will make you believe otherwise, but this you must believe: it\u0027s my job to keep you alive, and that\u0027s what I\u0027m going to do. Just do what you\u0027re told, and do it without hesitation.\"\\n\\n \"It\u0027s a huge camp,\" Michael said. \"If a rescue team did get through the gate, how are they going to find mei\"\\n\\n \"I\u0027ll take care of that.\"\\n\\n \"and what if the team failsi\"\\n\\n \"In that case,\" Bauman said, \"it\u0027s my responsibility to see that you die without revealing any secrets.\"\\n\\n This hit a true note. If the rescue effort failed, that solution was what Michael would expect. My God! he thought. Do I dare trust this mani\\n\\n \"The guards are waiting outside. Some of them have loose lips, and they tell everything to Krolle. So I\u0027ll have to beat you, to make this look real.\" He began to wrap the handkerchief around the knuckles of his right fist. \"I\u0027ll have to draw blood. My apologies.\" He drew the handkerchief tight. \"When we finish here, you\u0027ll be returned to your cell. again, I beg you: don\u0027t put up any resistance. We want the guards and Major Krolle to believe you\u0027re broken. Understandi\"\\n\\n Michael didn\u0027t reply. His mind was too busy, trying to sort all this out.\\n\\n \"all right,\" Bauman said. He raised his fist. \"I\u0027ll try to get this over as quickly as I can.\"\\n\\n He punched with the spare economy of a boxer. It didn\u0027t take very long for the handkerchief to become spattered with scarlet. Bauman gave Michael no body blows; he wanted all the damage-as superficial as it was-to be on display. By the time he was finished, Michael was bleeding from a gash above his left eye and a split lower lip, his face mottled with blue bruises.\\n\\n Bauman opened the door and called the guards in, the bloodstained handkerchief still bound around his swollen knuckles. Michael, almost unconscious, was unstrapped and dragged back to his kennel. He was thrown inside, on the damp hay, and the door was sealed.\\n\\n \"Gallatinov!\" Lazaris shook him back to his senses. \"I thought they would\u0027ve killed you, for sure!\"\\n\\n \"They... did... their worst.\" Michael tried to sit up, but his head felt like a lump of lead. He was lying against another body. a cool, unbreathing body. \"Who is thati\" Michael asked, and Lazaris told him. The bursts of machine-gun bullets had delivered the mercy of God. The Frenchman was also hit, and he lay huddled up and breathing heavily with slugs in his chest and stomach. Lazaris, the Dane, and the other prisoner-a German who moaned and cried without pause-had all escaped injury but for stone splinter cuts. The fourteen-year-old girl had not returned to the kennel.\\n\\n She didn\u0027t come back. Sometime during the next eight hours-or at least Michael judged it to be so, though his sense of time had all but vanished-the Frenchman hitched a final breath and died. The guards brought another small loaf of black bread and allowed another dip of the sponge in their bucket, but they left the corpses among the living.\\n\\n Michael slept a lot, rebuilding his strength. His thigh wound began to crust over, and so did the gash above his left eye: more signs of time\u0027s passage. He lay on the kennel floor and stretched, working the blood back into his stiff muscles. He closed his mind to the walls and ceiling and concentrated on visions of green forest and grasslands sweeping toward the blue horizon. He learned the routine: the guards brought bread and water once every day, and every third day a bucket of gray gruel that Lazaris sopped the sponge in. It was slow starvation, but Michael made sure he got every bit of bread, water, and gruel that he could scoop up and squeeze out.\\n\\n The corpses swelled and began to reek of decay.\\n\\n What was Blok up toi Michael wondered. Possibly going over the histories of the Reichkronen employees, trying to uncover a traitor who wasn\u0027t therei Possibly trying to find the fictitious camera and filmi Or leading the search for Chesnai He knew that a resumption of torture was imminent; this time it would be with instruments instead of fists and Krolle\u0027s rubber baton. Michael wasn\u0027t sure he could survive it. When his torturers came for him again, he would let the change take him, he decided. He would tear out as many of their throats as he could before their bullets cut him to pieces, and that would be the end of it.\\n\\n But what about Iron Fist, and the forthcoming invasioni The gruel bucket had come twice; he\u0027d been in this filthy hole for at least seven days. The allied command had to be warned about Iron Fist. Whatever it was, it was deadly enough to make delaying D day imperative. If the soldiers who hit the landing beaches were exposed to the corrosive substance that had caused those wounds in the photographs, then the invasion would be a massacre.\\n\\n He awakened from a restless sleep, in which skeletons in green fatigues lay in huge piles on the shores of France, to hear the sound of thunder.\\n\\n \"ah, listen to that music!\" Lazaris said. \"Isn\u0027t it lovelyi\"\\n\\n Not thunder, Michael realized. The sound of bombs.\\n\\n \"They\u0027re hitting Berlin again. The americans in their B-seventeens.\" Lazaris\u0027s breathing had quickened with excitement. Michael knew the Russian was imagining himself up there with the swarms of heavy bombers, in the turbulent sky. \"Sounds like some of their bombs are falling short. The woods\u0027ll be on fire; it usually happens that way.\"\\n\\n The camp air-raid siren had begun to wail. The thunder was louder, and Michael could feel the vibration of the kennel\u0027s stones.\\n\\n \"Lots of bombs coming down,\" Lazaris said. \"They never hit the camp, though. The americans know where we are, and they\u0027ve got those new bomb sights. Now there\u0027s an aircraft for you, Gallatinov. If we\u0027d had Forts instead of those lousy Tupolevs, we\u0027d have knocked the Krauts to hell back in forty-two.\"\\n\\n It took a moment for what Lazaris had said to sink in. \"Whati\" Michael asked.\\n\\n \"I said, if we\u0027d had B-seventeens instead of those damned Tu-\"\\n\\n \"No, you said \u0027Forts.\u0027 \"\\n\\n \"Oh. Right. Flying Fortresses. B-seventeens. They call them that because they\u0027re so hard to shoot down. But the Krauts get their share.\" He crawled toward Michael a few feet. \"Sometimes you can see the air battles if the sky\u0027s clear enough. Not the planes, of course, because they\u0027re too high, but their contrails. One day we had a real scare. a Fortress with two burning engines passed right over the camp, couldn\u0027t have been a hundred feet off the ground. You could hear it crash, maybe a mile or so away. a little lower and it would\u0027ve come down on our heads.\"\\n\\n Flying Fortress, Michael thought. Fortress. Long-range american bombers, based in England. The Yanks painted their bombers a drab olive green: the same shade as the metal pieces Theo von Frankewitz had decorated with false bullet holes. Blok had said, No one knows where the fortress is but myself, Dr. Hildebrand, and a few others. Frankewitz had done his work in a hangar on an unknown airfield. Was it possible, then, that the \"fortress\" Blok had been talking about was not a place, but a B-17 bomberi\\n\\n It hit him then, full force. He said, \"The american bomber crews give names to their planes, don\u0027t theyi\"\\n\\n \"Yes. They paint the names on the aircraft nose, and usually other art, too. Like I said, they paint their planes up like floozies-but get them in the air, and they fly like angels.\"\\n\\n \"Iron Fist,\" Michael said.\\n\\n \"Whati\"\\n\\n \"Iron Fist,\" he repeated. \"That might be the name of a Flying Fortress, mightn\u0027t iti\"\\n\\n \"Could be, I suppose. Whyi\"\\n\\n Michael didn\u0027t answer. He was thinking about the drawing Frankewitz had shown him: an iron fist, squeezing a caricature of adolf Hitler. The kind of picture that no German in his right mind would display. But certainly the kind of art that might be proudly displayed on the nose of a Flying Fortress.\\n\\n \"Sweet music,\" Lazaris whispered, listening to the distant blasts.\\n\\n The Nazis knew the invasion was coming, Michael thought. They didn\u0027t know where, or exactly when, but they\u0027d probably narrowed it down to the end of May or beginning of June, when the Channel\u0027s tides were less capricious. It stood to reason that whatever Hildebrand was developing would be ready for use by then. Perhaps the weapon itself was not called \"Iron Fist,\" but \"Iron Fist\" was the means of putting that weapon into action.\\n\\n The allies, with their fighter planes and long-distance bombers, owned the sky over Hitler\u0027s Reich. Hundreds of bombing missions had been flown over the cities of Nazi-occupied Europe. In all those missions how many Flying Fortresses had been shot down by German fighters or antiaircraft gunsi and of those, how many had made crash landings, shot to pieces and with engines aflamei The real question was: how many intact Flying Fortresses had the Nazis gotten hold ofi\\n\\n at least one, Michael thought. Perhaps the bomber that had passed over Falkenhausen and come down in the forest. Maybe it had been Blok\u0027s idea to salvage that aircraft, and that was why he\u0027d been promoted from commandant of Falkenhausen to head of security for the Iron Fist project.\\n\\n He let his mind wander, toward fearsome possibilities. How difficult would it be to make a damaged B-17 airworthy againi It depended, of course, on the damage; parts could be scavenged from other wrecks all over Europe. Maybe a downed Fortress-Iron Fist-was being reconstructed at that airfield where Frankewitz had done his paintings. But why bullet holesi Michael wondered. What was the point of making a reconstructed bomber look as if it had been riddled with-\\n\\n Yes, Michael thought. Of course.\\n\\n Camouflage.\\n\\n On D-Day, the invasion beaches would be protected by allied fighters. No Luftwaffe plane would be able to get through-but an american Flying Fortress might. Especially one that was battle-scarred, and limping back to its base in England.\\n\\n and once that aircraft got over its target, it could drop its bombs-containing Hildebrand\u0027s new discovery-onto the heads of thousands of young soldiers.\\n\\n But Michael realized there were holes in his conjecture: why go to all that effort when Nazi artillery cannons could simply fire Hildebrand\u0027s new weapon amid the invasion troopsi and if that weapon was indeed a gas of some kind, how could the Nazis be sure the winds wouldn\u0027t blow it back in their facesi No, the Germans might be desperate, but they were far from being stupid. How, then, if Michael was right, was the Fortress going to be usedi\\n\\n He had to get out of here. Had to get to Norway and put more pieces of this puzzle together. He doubted if the B-17 would be hangared in Norway; that was too far from the possible invasion sites. But Hildebrand and his new weapon were there, and Michael had to find out exactly what it was.\\n\\n The bombing had ceased. The camp\u0027s air-raid siren began to whine down.\\n\\n \"Good hunting to you,\" Lazaris wished the flyers, and in his voice there was a tormented longing.\\n\\n Michael lay down, trying to find sleep again. He kept seeing the grisly photographs of Hildebrand\u0027s test subjects in his mind. Whatever could do that to human flesh had to be destroyed.\\n\\n The swollen corpses of Metzger and the Frenchman gurgled and popped, releasing the gases of decay. Michael heard the faint scratching of a rat in the wall next to him, trying to find its way to the smell. Let him come, Michael thought. The rat would be fast, a canny survivor, but Michael knew he was faster. Protein was protein. Let him come. \\n\\n","sourceLink":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1/page-58.html","bookId":2469,"book":{"id":2469,"title":"The Wolf\u0027s Hour (Michael Gallatin #1)","description":"Storyline: The Wolf\u0027s Hour (Michael Gallatin #1) \\n This book is a remarkable tale of pulse-pounding excitement with a uniquely sympathetic, fascinating portrait of the werewolf as noble warrior-and conflicted being. Complex, compelling and utterly real.\\n","cover":"https://allnovel.net/images/the-wolf-s-hour-michael-gallatin-1.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:39:52 PM"}}
