{"id":82290,"no":65,"title":"Page 65","content":"The journey from Wolftown to the plant was harder on human legs than on wolfen, Michael soon learned. as he, Chesna, and Lazaris went through the woods, he heard noises all around them. The yellow wolf had brought her companions. Kitty had remained behind, to watch the boat, and also because her bulk would have slowed their progress to a crawl. Lazaris jumped at every sound-real or imagined-but Michael made sure the Russian kept the safety on his weapon and his finger off the trigger. Michael went under the fence first. Lazaris followed, muttering beneath his breath at how he\u0027d been born a stupid fool and did not wish to die as one. Then Chesna crawled under, her mind turning over the question of how Michael had dug such a hole without a shovel. In the shelter of an alley they stopped to remove extra ammo clips and two grenades from their packs. The clips went into the pockets of their parkas while the grenades were latched to the Schmeissers\u0027 straps. Then they went on, staying close to the wall, with Michael in the lead. He guided them toward the building where the prisoners were working. The two guards would be easy to overcome, and information about the plant could be gotten from the guards and the prisoners. Still, he took nothing for granted; each step was a careful one, and each turn a challenge. Near their target building Michael heard the noise of footsteps approaching and motioned Chesna and Lazaris down. He knelt, at an alley corner, and waited. One soldier was about to round the corner. as soon as Michael saw the man\u0027s knees, he came up off the ground in a burst of power and drove his gun butt against the soldier\u0027s chin. The man was lifted off his feet by the blow, and fell on his back to the pavement. He twitched a few times, then lay still. They dragged him into a recessed doorway and left him there folded up like a package after Lazaris had removed the soldier\u0027s knife and cut his throat with it. Lazaris\u0027s eyes glittered with blood lust, and he slipped the knife under his parka. a knife was also being used in Wolftown. Kitty used her hooked, blubber-slicing blade to cut hunks of dried beef into bite-sized pieces. as she put one into her mouth and chewed on it, she heard a wolf howl somewhere in the village. It was a high, piercing call that echoed over the harbor and ended in a series of quick, staccato barks. She did not like that sound. She picked up a flashlight and, armed with her knife, went out into the misty chill. There was no sound but the waves lapping against the seawall. Kitty stood there for a moment, slowly looking from left to right. The wolf made another noise: a series of harsh yips. Kitty left the house, walking toward the dock. Her boots squished in the dark mud that held her family\u0027s bones. When she reached the dock, she switched on the flashlight, and there she found it. a dark gray rubber boat, tied up beside her own craft. There were three sets of oars in it. Kitty\u0027s knife pierced the rubber in a dozen places. The boat gurgled as it crumpled and sank. Then she half ran, half careened on her stumpy legs toward her house again. as she went through the door, she smelled their sausage-and-beer sweat, and she halted in the presence of more dangerous beasts. One of the black-clad Nazee boys motioned with his rifle and spoke his gibberish. How could a human tongue make such a noisei Kitty wondered. The other two soldiers also held rifles on her, their faces daubed with black camouflage paint. The Nazee boys had known they were here, she realized. They had come prepared for a slaughter. She would give them one. She grinned, her blue Nordic eyes glittering, and she said, \"Welcome!\" as she lifted her knife and lunged forward. Michael, Lazaris, and Chesna had reached the workshop building\u0027s roof. They went along the catwalk and down through the stairwell. \"Watch where you point that thing!\" Michael whispered to Lazaris as the barrel of the Russian\u0027s weapon wandered. He led them through the jumble of equipment, and in another moment they could see the two soldiers, engrossed in their card game. The prisoners were working on the crates, sawing and hammering, proud of their carpentry skills even under the Nazi thumb. \"Wait,\" Michael told Chesna and Lazaris, and then he crept closer to the guards. One of the prisoners dropped a nail, reached down to get it, and at floor level saw a man crawling on his belly. The prisoner gave a soft, stunned gasp, and another glanced over in Michael\u0027s direction. \"Four aces!\" the guard with a winning hand crowed as he spread his cards out on the table. \"Beat me!\" \"as you wish,\" Michael said, rising up behind the man and slamming him over the head with the butt of his Schmeisser. The guard moaned and toppled, scattering cards. The second man reached for his rifle, which leaned against the wall, but he froze when the Schmeisser\u0027s business end kissed his throat. \"On the floor,\" Michael said. \"Get on your knees, hands cupped behind your head.\" The soldier complied. Very quickly. Chesna and Lazaris emerged, and Lazaris prodded the unconscious man\u0027s ribs with the toe of his boot. When the soldier groaned softly, he gave him a kick that made him pass out again. \"Don\u0027t kill me!\" the man on his knees begged. \"Please! I\u0027m just a nobody!\" \"We\u0027ll make you a no-head in a minute!\" Lazaris said as he pressed the knife blade to the man\u0027s quivering adam\u0027s apple. \"He can\u0027t answer questions through a cut throat,\" Chesna told the Russian. She put the barrel of her gun against the soldier\u0027s forehead and pulled back the cocking bolt. The soldier\u0027s eyes widened, wet with terror. \"I think we have his attention.\" Michael glanced over at the prisoners, who had stopped working and were mesmerized with surprise and bewilderment. \"What\u0027s going into those cratesi\" he asked the guard. \"I don\u0027t know.\" \"You lying bastard!\" Lazaris put some pressure on the blade, and the man yelped as a trickle of warm blood ran down his throat. \"Bombs! Hundred-pound bombs! That\u0027s all I know!\" \"Twenty-four of themi a bomb for each cratei\" \"Yes! Yes! Please don\u0027t kill me!\" \"They\u0027re being packed up for transporti In the Messerschmitt out on the fieldi\" The man nodded as his uniform\u0027s collar reddened. \"Transported to wherei\" Michael persisted. \"I don\u0027t know.\" More pressure from the blade. The man gasped. \"I swear I don\u0027t know!\" Michael believed him. \"What\u0027s inside the bombsi\" \"High explosives. What\u0027s inside any bombi\" \"Don\u0027t get cute,\" Chesna warned, her voice crisp and deadly. \"Just answer the questions.\" \"That fool doesn\u0027t know. He\u0027s just a guard.\" They looked to see who\u0027d spoken. It was the frail prisoner who had gray hair and wore wire-rimmed glasses. He came a few steps closer and spoke in what sounded like a heavy Hungarian accent. \"It\u0027s a gas of some kind. That\u0027s what\u0027s inside the bombs. I\u0027ve been here for over six months, and I\u0027ve seen what it can do.\" \"I have, too,\" Michael said. \"It burns the flesh.\" The man smiled faintly, a bitter smile. \"Burns the flesh,\" he repeated. \"Oh, it does more than burn the flesh, my friend. It eats the flesh, like a cancer. I know. I\u0027ve had to burn some of the bodies. My wife among them.\" He blinked, his eyes heavy-lidded. \"But she\u0027s in a better place than this. They torture me every day, by forcing me to live.\" He looked at the hammer he held, and then dropped it to the concrete. He wiped his hand on his trouser leg. \"Where are the bombs storedi\" Michael asked him. \"That I don\u0027t know. Somewhere deeper in the plant. There\u0027s a white building next to the big chimney. Some of the others say that\u0027s where the gas is made.\" \"The othersi\" Chesna asked. \"How many prisoners are therei\" \"Eighty-four. No, no. Walt.\" He thought about it. \"Danelka died two nights ago. Eighty-three. When I first came here, there were over four hundred, but...\" He shrugged his thin shoulders, and his eyes found Michael\u0027s. \"Have you come to save usi\" Michael didn\u0027t know what to say. He decided the truth was best. \"No.\" \"ah.\" The prisoner nodded. \"Then it\u0027s the gas, is iti You\u0027re here because of thati Well, that\u0027s good. We\u0027re already dead. If that stuff ever gets out of here, I shudder to-\" Something whammed against the corrugated-metal gate. Michael\u0027s heart kicked, and Lazaris jumped so hard the blade bit deeper into the soldier\u0027s throat. Chesna removed her gun barrel from the man\u0027s forehead, leaving a white circle where it had been pressed, and aimed the weapon toward the gate. again, something hit the metal. a rifle butt or billy club, Michael thought. a voice followed: \"Hey, Reinhart! Open up!\" The soldier croaked, \"He\u0027s calling me.\" \"No, he\u0027s not,\" the gray-haired prisoner said. \"He\u0027s Karlsen. Reinhart is on the floor.\" \"Reinhart!\" the soldier outside shouted. \"Open up, damn you! We know you\u0027ve got the pretty one in there!\" The female prisoner who\u0027d been poked with the rifle, her black hair framing a face as pale as a cameo, picked up a ballpeen hammer. Her knuckles bleached around the handle. \"Come on, be a sport!\" It was a different voice. \"Why hog her all for yourselvesi\" \"Tell them to go away,\" Chesna ordered. Her eyes were flinty, but her voice held a nervous edge. \"No,\" Michael said. \"They\u0027ll come in the way we did. On your feet.\" Karlsen got up. \"To the gate. Move.\" He followed the Nazi, and so did Chesna. Michael pressed his gun into the man\u0027s spine. \"Tell them to wait a minute.\" \"Wait a minute!\" Karlsen shouted. \"That\u0027s better!\" one of the men outside said. \"You bastards thought you were going to sneak one by us, didn\u0027t youi\" The gate was hoisted by a chain-and-pulley device, operated with a flywheel. Michael stepped to one side. \"Pull the gate up. Slowly.\" Chesna got out of the way, too, and Karlsen started turning the flywheel. The gate began to fold upward. and at that moment Reinhart, who\u0027d been shamming for the past two minutes, suddenly sat up at Lazaris\u0027s feet. He clutched at his two broken ribs and reached up for the wall beside their card table. Lazaris gave a shout and stabbed downward with the knife, sinking it into Reinhart\u0027s shoulder, but he was powerless to prevent what happened next. Reinhart\u0027s fist punched a red button attached to electrical cords on the wall, and a siren shrieked somewhere on the building\u0027s roof. The gate was a quarter of the way up when the alarm began. Michael could see four pairs of legs. Without hesitation he clicked off the safety on his gun and sprayed bullets below the gate, chopping down two soldiers who screamed and writhed in agony. Karlsen released the flywheel and tried to scramble beneath the corrugated metal as it clattered down again, but a burst from Chesna\u0027s gun ripped him open and the gate clunked on his butt. Lazaris repeatedly stabbed down on Reinhart, fierce strength behind the blows. The German crumpled, his face a mass of torn flesh, but the siren kept going. a black-haired figure swept past him. The woman raised her hammer and broke the alarm button to fragments. Still, a switch had been triggered and the siren would not be silenced. \"Get out while you can!\" the gray-haired prisoner shouted. \"Go!\" There was no time to deliberate. That siren would bring every soldier in the plant down on them. Michael ran for the stairwell, with Chesna a few paces behind and Lazaris bringing up the rear. They came out onto the roof, and already two soldiers were running along the catwalk toward them. Michael fired, and so did Chesna. The bullets sparked off the catwalk railing, but the soldiers flung themselves flat. Rifles cracked, the slugs zipping past their heads. Michael saw another pair of soldiers, coming across the catwalk from the building behind them. One of them fired a shot that snagged Chesna\u0027s parka, and puffed goose down into the air. Michael readied a grenade, then paused while the fuse sizzled and the soldiers got closer. a bullet sang off the railing beside him. He flung the grenade at the two men who were coming up from behind, and three seconds later there was a blast of white fire and two shredded figures twitching on the catwalk. Lazaris wheeled toward the other pair in front of them and fired short bursts that knocked sparks off the slate roof. Michael saw three more soldiers advancing over the catwalk behind them. Chesna\u0027s gun rattled, and the soldiers crouched down as slugs ricocheted off the railings. The rooftop was turning into a hornet\u0027s nest. a bullet struck the slates to Michael\u0027s left and spun like a burning cigarette butt less than five inches past his face. Chesna suddenly cried out and went down. \"I\u0027m hit!\" she said, her teeth gritted with pain and anger. \"Damn it!\" She was clutching her right ankle, blood on her fingers. Lazaris sprayed bullets first in one direction, then another. a soldier screamed and fell over the railing to the pavement twenty feet below. Michael bent down to help Chesna to her feet, and as he did he felt a bullet pluck at his parka. They had no choice; they had to get back down the stairwell before they were cut to pieces in the cross fire. He hauled Chesna up. She fired at the soldiers behind them, even as Michael pulled her to the stairwell door. a bullet hit the catwalk railing beside Lazaris and metal splinters pierced his jaw and cheek. He retreated, spraying bullets across the roof. as they got into the stairwell, slugs marched across the door and knocked it off its hinges. Michael felt a searing sting of pain in his left hand, and he realized a bullet had just gone through his palm. His hand went numb, the fingers twitching involuntarily. He kept hold of Chesna, and they all backed down the stairwell to the workshop. Two Germans entered at the top of the stairs, and Lazaris cut them down before they could aim their weapons. The bodies slid over each other down the steps. More soldiers crawled into the stairwell, and a few seconds later a grenade was flung and exploded with a whump of fire and concussion. But Michael, Chesna, and Lazaris were already in the workshop, where the prisoners had taken cover amid the equipment and oil drums. Soldiers scurried down to the bottom of the smoky stairwell and fired into the workshop. Michael looked over his shoulder toward the metal gate. More Germans were trying to wrench it up by hand from the other side, their fingers curled under the edge. as they struggled, other soldiers fired bullets through the gap at floor level. Michael released Chesna, who fell to her knees, her face glistening with the sweat of pain, and popped a fresh ammo clip into his gun. His hand was streaming blood, the wound a perfect puncture. He shot beneath the gate, and the Germans scrambled away from it. The siren had stopped its shrieking. Over the noise of gunshots a strident voice rang out: \"Cease fire! Cease fire!\" The shooting dwindled, and halted. Michael crouched down, behind a half-track load puller, and Chesna and Lazaris knelt in the shelter of oil drums. Michael heard the fearful moaning of some of the prisoners, and the clicks of guns being reloaded. a haze of blue smoke drifted through the workshop, carrying the pungent odor of gunpowder. a moment later a voice amplified through a loudspeaker came from beyond the metal gate: \"Baroni It\u0027s time you and Chesna threw out your weapons. It\u0027s over.\" Michael glanced toward Chesna, and their eyes met. It was Jerek Blok\u0027s voice. How did he knowi \"Baroni\" Blok continued. \"You\u0027re not a stupid man. Certainly not. You know by now that this building is surrounded, and there\u0027s no possible way you can get out. We will take you, one way or the other.\" He paused, letting them think it over. Then: \"Chesna, deari Surely you understand your situation. Throw out your weapons, and we\u0027ll have a nice talk.\" Chesna examined the blue-edged hole in her ankle. Her thick woolen sock was wet with blood, and the pain was excruciating. a cracked bone, she thought. She fully understood the situation. \"What are we going to doi\" Lazaris asked, with a note of panic. Blood trickled down into his beard from the splinter wounds. Chesna got her backpack off and unsnapped it. \"Baron, you amaze me!\" Blok said. \"I\u0027d like to know how that escape from Falkenhausen was engineered. You have my deepest respect.\" Michael saw Chesna reach into her pack. Her hand came out with a square of waxed paper. The cyanide capsule. \"No!\" Lazaris grasped her arm. \"There\u0027s another way.\" She shook her head, pulling free. \"You know there\u0027s not,\" she said, and began to unwrap the packet. Michael crawled across the floor to her. \"Chesna! We can shoot our way out! and we\u0027ve still got grenades!\" \"My ankle\u0027s broken. How am I going to get out of herei Crawli\" He gripped her wrist, preventing her from putting the capsule on her tongue. \"I\u0027ll carry you.\" She smiled faintly, her eyes dark with pain. \"Yes,\" she said. \"I believe you would.\" She touched his cheek, and ran her fingers across his mouth. \"But it wouldn\u0027t do any good, would iti No. I\u0027m not going to be caged and tortured like an animal. I know too much. I\u0027d be sentencing a dozen others to-\" Something clattered across the floor about fifteen feet away. Michael looked toward it, his heart pounding, and saw that one of the soldiers in the stairwell had just thrown a grenade. It went off, before any of them could move. Flame sputtered from the fuse. There was a pop! and a bright flash, then chalky-white smoke began to pour from it. Except it was not smoke, Michael realized in another two seconds. It had a sickly-sweet, orangelike odor: the smell of chemicals. a second gas grenade popped, near the first one. Chesna, her eyes already stinging and watering, lifting the cyanide pill to her mouth. Michael couldn\u0027t bear it. For better or worse he swiped the capsule out of her hand. The chemical smoke settled over them like the folds of a shroud. Lazaris hacked and coughed, struggled to his feet with tears blinding him, and flailed into the vapors. Michael felt as if his lungs were swelling up; he couldn\u0027t draw a breath. He heard Chesna cough and gasp, and she clung to him as he tried to pick her up. But his air was gone, and the smoke was so dense that direction was destroyed. One of Hildebrand\u0027s inventions, Michael thought and then, blinded and weeping, he fell to his knees. He heard the prisoners coughing, being overcome as well. a figure appeared through the smoke before him: a soldier wearing a gas mask. The man aimed his rifle at Michael\u0027s head. Chesna slumped beside him, her body hitching. Michael fell over her, struggled to rise again, but his strength was stolen. Whatever the chemical was, it was potent. and then, with the reek of rotten oranges in his nostrils, Michael Gallatin blacked out.","sourceLink":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1/page-65.html","bookId":2469,"book":{"id":2469,"title":"The Wolf\u0027s Hour (Michael Gallatin #1)","description":"Storyline: The Wolf\u0027s Hour (Michael Gallatin #1) This book is a remarkable tale of pulse-pounding excitement with a uniquely sympathetic, fascinating portrait of the werewolf as noble warrior-and conflicted being. Complex, compelling and utterly real.","cover":"https://allnovel.net/images/the-wolf-s-hour-michael-gallatin-1.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-wolf-s-hour-michael-gallatin-1.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:39:52 PM"}}
