{"id":64966,"no":40,"title":"Page 40","content":"Alix loved listening to her talk. Tammie Lee had the softest, sweetest voice she’d ever heard.\n Tammie Lee hugged Jacqueline as if it’d been a year of Sundays since she’d last seen her mother-in-law. “And you must be Alix. Jacqueline didn’t tell me what a beauty you are. Why, this is going to be easier than frying up griddle cakes. You must come in and let me take a good look at you.” Before Alix could object, not that she would have, Tammie Lee had taken her arm and led her into the house.\n “Where’s Paul?” Jacqueline asked.\n “Golfing with his daddy,” Tammie Lee said and sounded surprised that her mother-in-law didn’t know.\n Alix noticed a flicker of something in the older woman’s eyes. For an instant it looked like pain, but Alix was sure she must be wrong.\n “I’ve got everything set up in the spare bedroom,” Tammie Lee said. “I took out a bunch of my clothes for Alix to try on. That way, when we find something she likes, we’ll know where to shop.”\n “Good idea,” Alix said, although she couldn’t imagine wearing any style this southern belle would.\n True to her word, Tammie Lee had laid an assortment of clothes on the bed in the guest room. At first glance Alix’s heart fell. There seemed to be nothing but satin, lace and girly items.\n “You sort through what’s on the bed and I’ll get us all some iced tea.”\n “With mint,” Jacqueline added as she sat down.\n “Of course,” Tammie Lee said as she rushed from the room.\n “She adds mint to everything,” Jaqueline said in a disparaging whisper.\n Alix glanced at her quickly—a hint of the old disapproval was back—but didn’t comment. Instead she checked out a full-length jean skirt. This was workable but only if she wore a T-shirt with it and a wide leather belt. She set it to one side and reached for a frothy, lacy dress, which she immediately rejected.\n Tammie Lee stuck her head inside the door. “Would either of you prefer a Coke?”\n “I would.” Alix wasn’t shy. She’d never been a real fan of iced tea.\n “With or without peanuts?”\n “With.” She hadn’t had breakfast and a snack sounded good.\n “I’ll have the iced tea. Do you need any help?” Jacqueline asked.\n “Oh, heavens, no.” Once again Tammie Lee disappeared, but it wasn’t long before she returned.\n She brought in a tray and placed it on the dresser. Jacqueline stood up to get her glass of iced tea and Alix watched as she removed the mint leaf, using her thumb and index finger as if she were picking out a dead bug.\n Tammie Lee served the Coke in an old-fashioned soda glass. She’d apparently forgotten the peanuts, which was fine. Not until Alix reached for her Coke did she notice the peanuts floating on top. She couldn’t very well object now and took a sip. The taste was interesting, a blend of salt and sweet. This was probably one of those southern traditions Jacqueline complained about so much.\n “I like this,” Alix said and held up the jean skirt.\n “I thought you would.”\n “You can’t wear jeans to a fancy restaurant,” Jacqueline objected.\n “It’s not the same as regular jeans,” Tammie Lee explained.\n While they discussed what could be considered proper attire for a real restaurant, Alix drank her Coke, complete with floating peanuts.\n An hour later, after she’d tried on several outfits, the three of them headed to the mall in two separate cars—Alix, still riding with Jacqueline. Inside one of the major department stores, Jacqueline sat and waited, while Tammie Lee carried outfit after outfit into the dressing room. Some of them Alix rejected out of hand, but a few showed real possibility. In the end, she chose a long black skirt and a white silk blouse with a swooping neckline and cuffs that buttoned at the wrist.\n It was noon, and by then Alix was starved. She would’ve been happy with a hamburger, but Jacqueline suggested a sit-down place inside the mall. She insisted they try the delicate finger sandwiches with ultra-thin slices of cucumber. Alix ate her sandwich in two bites and had several more. She could’ve eaten out for a week on what Jacqueline paid for lunch. No wonder society women were so thin.\n “I don’t know about anyone else, but I’m exhausted,” Jacqueline said. “I just might let you two carry on without me.”\n “You go home and put your feet up,” Tammie Lee told her. “I’ll take over from here if that’s okay with Alix.”\n “But I do want to see Alix when you’re all finished with her.”\n “I’ll call you myself,” Tammie Lee promised.\n Left to their own devices, Tammie Lee and Alix made fast work of the remainder of their purchases, which included shoes and a silver necklace—all at Jacqueline’s expense. Alix would never have guessed how much she’d like Jacqueline’s daughter-in-law. Tammie Lee was fun and sweet and the nicest person she’d met in her entire life. Frankly, she didn’t know what Jacqueline found so disagreeable about her.\n They stopped for a Coke at a fast-food restaurant in the food court. Because she was still hungry, Alix ordered a cheeseburger and fries to go with it.\n Tammie Lee took one look at her and burst into giggles. “Make that two of everything.”\n “I’m not going back to the same hairdresser.” Alix wanted that understood in case Jacqueline had forgotten her previous reaction to Ms. Desiree.\n “I don’t blame you,” Tammie Lee said in a whisper. “Jacqueline wanted me to make an appointment with Desiree. So I did, shortly after Paul and I were married.”\n “Did you come out looking like one of the Brady Bunch?”\n “No,” she said with a silly grin, “I looked more like Don King. Every time Paul saw me, he laughed. I thought I’d die of pure mortification.”\n Their order was ready, and they found a table in the middle of the seating area.\n “Tell me about you and Paul,” Alix said as she unwrapped her cheeseburger.\n “Oh, Alix.” Tammie Lee gave a breathy sigh. “I don’t know where to start. I never thought I’d leave Louisiana, but it’s amazing what a woman will do for love.” Her expression was dreamy. “I discovered it didn’t matter where I lived, as long as I could be with Paul. The heart takes on a will of its own, if you know what I mean?”\n Alix did understand. The fact that she was in this mall was proof of that.\n “If you don’t object, I’ll do your hair for you,” Tammie Lee offered.\n “You will?”\n “I might not have all the training Desiree does, but I’m fairly good. All my friends let me do their hair for proms and such.”\n “Sure, if you don’t mind.”\n “It’ll be fun.”\n When Tammie Lee drove back to the house, Paul had returned from the golf course. He sat in front of the television with an empty plate in his lap and a milk glass on the end table.\n “Hi, Tam,” he said and smiled at Alix. He jumped up from his chair and took the packages from Tammie Lee’s hands, kissing his wife on the cheek. “How’d the shopping go?”\n “Great. This is Alix, your mother’s friend and now mine.”\n “Hello, Alix.” Paul gave her the once-over, as if he wasn’t sure she was for real. “You and my mother are friends?”\n “Yeah, we met in the knitting class.”\n “Oh, right.” He nodded. “I remember….”\n “I’m going to do Alix’s hair. She’s got a hot date tonight.”\n “Sure, go ahead.” His attention had already drifted back to the baseball game.\n Tammie Lee was as good as her word. By the time she’d finished, Alix felt like a candidate for Homecoming Queen. Staring at her reflection in the bathroom mirror, Alix had to blink in order to believe the image was her own.\n “What do you think?” Tammie Lee asked.\n “I…you made me pretty.”\n Tammie Lee slowly shook her head. “You’re already lovely, Alix, but I have a feeling your Jordan knows that.”\n Her heart did a little flip-flop at the way Tammie Lee said your Jordan, as if it was understood that the two of them were a couple.\n Before long, Jacqueline arrived to give Alix her nod of approval. While Alix suspected she fell far short of the designer dress and fancy hairdo her friend would’ve preferred, she seemed to pass muster. Tammie Lee hadn’t used anything more than a curling iron and mousse, but she’d managed to arrange Alix’s plain straight hair in a natural wavy style that suited her better than anything she’d ever imagined.\n After a moment, Jacqueline smiled.\n “Do you think Jordan will like it?”\n Jacqueline laughed delightedly. “My dear, he’s in for a real surprise.”\n That evening while she waited for Jordan to pick her up at the apartment, Alix nervously paced the living room.\n “Would you stop pacing,” Laurel snapped. She was parked in front of the television with a pint of cookie-dough ice cream, which she ate directly from the container.\n The knock on the door nearly sent Alix into a panic. She closed her eyes and although she wasn’t a person who’d prayed a lot in recent years, she found a prayer on her lips now. More than anything, she wanted Jordan to see her as beautiful.\n Holding her breath, she opened the door.\n Jordan stood there holding a wrist corsage in a clear plastic box. His eyes widened as he stood staring at her.\n “Say something,” she pleaded. “Anything.”\n “Wow,” he breathed. “Wow, Alix, is that really you?”\n “It’s me.” Holding back a smile would have been impossible. “You like it?”\n “I like you,” he said and handed her the corsage.\n This was the first time in her life anyone had given her flowers and nothing in the world could have pleased her more.\n CHAPTER 40\n “Whether I am knitting for myself or someone else, my passion for knitting enables me to express my creativity and produces a feeling of accomplishment.”\n —Rita E. Greenfeder, Editor, Knit ’N Style Magazine\n LYDIA HOFFMAN\n M argaret decided to go with me to the meeting with Dr. Wilson at his office. He had all the test results and medical reports back now, and there seemed to be some confusion about the diagnosis.\n Notoriously closemouthed, he did mention casually when I was released from the hospital that he’d asked a colleague to review the biopsy. That news, I suspect, was meant to encourage me. But in my heart, I knew the tumor was cancerous.\n “Don’t be such a pessimist,” Margaret mumbled as we sat in the waiting area. It was the last appointment of the day, another sure sign of my prognosis, but I didn’t say any of this to Margaret.\n Instead I leaned back and closed my eyes, wanting to block out the world. It was easy for my sister to suggest optimism. This wasn’t her life, her illness, her impending death. I couldn’t help wondering what her thoughts would’ve been had our situations been reversed. I bit back the words to remind her that she’d come running to me with her own recent scare. I was in that kind of mood right now. I could hardly keep from lashing out at the world and everyone close to me. The person who’d received the brunt of my anger, sadly, was Brad, and he was the last person who deserved it. But I refused to dwell on him or the regrets I felt whenever he crossed my mind. I’d done what I had for his own good. He would never know what it had cost me to send him away; I would carry the weight of that for the rest of my life, however short that might be. \n","sourceLink":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1/page-40.html","bookId":1933,"book":{"id":1933,"title":"The Shop on Blossom Street (Blossom Street #1)","description":"Storyline: \n The Shop on Blossom Street (Blossom Street #1) \n Bestselling romance author and ardent knitter Debbie Macomber combines both her skills in this novel about a newly opened Seattle yarn shop and the knitting class that brings four women together to make baby blankets. The owner of the shop and her three students produce more than blankets, knitting together bonds of solidarity, friendship, love, hope, and renewal. The book even includes the pattern for the blanket, which was created by premier knitting designer Ann Norling. \n When Lydia Hoffman, a cancer survivor and owner of A Good Yarn, starts a knitting class for her patrons, she forms a special friendship and bond with three extraordinary women--Jacqueline, Carol, and Alix--and together they share laughter, heartbreak, and dreams.\n \n","cover":"https://allnovel.net/images/the-shop-on-blossom-street-blossom-street-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:55:42 AM"}}
