{"id":64933,"no":7,"title":"Page 7","content":"A blonde. Men were so predictable.\\n\\n Jacqueline had turned her head the other way and pretended all was right in her marriage and her life. That didn’t mean this blonde-on-the-side didn’t hurt. The pain of Reese’s betrayal cut deep, but Jacqueline was mature enough not to dwell on such unpleasantness. Lord knew her husband hadn’t come to her bed in years. As far as she was concerned, his mistress was welcome to him.\\n\\n To be fair, separate bedrooms had been by mutual agreement. Early on in their marriage she’d produced the requisite offspring and following a respectable two-year span they’d tried for another child. But after two late miscarriages and the subsequent depressions, Jacqueline had given up hope.\\n\\n All too soon Paul was no longer a boy. Almost overnight, it seemed, he was ready for college. When their son moved into a dorm room, Jacqueline had casually suggested Reese take advantage of the extra bedroom. The very next day, he’d moved his things into the other room. She’d been a little chagrined at the promptness of his action, but relieved, too.\\n\\n Frankly she’d come to look upon sex as an intrusion. All that sweating and heaving and grinding while she did her best to pretend she was interested—it was just plain silly. Oh, the lovemaking had been pleasant and even enjoyable, especially in the beginning and then for a while after Paul. She was sure it would’ve been different if she’d been able to carry a second pregnancy to term. Jacqueline had wanted a daughter, but that was never to be. With the perspective of the last twenty years, she understood that her lack of interest in sex was due to anxiety or perhaps guilt. Still, it didn’t matter now. And she had no intention of visiting the doctors with couches in their offices to find out.\\n\\n Not having a daughter was one of Jacqueline’s lifelong regrets. Reese had told her years ago, when she was feeling particularly depressed, that she’d have her daughter when Paul got married. And that was supposed to be a comfort!\\n\\n Involuntarily, Jacqueline cringed. Tammie Lee was so far removed from what any daughter of hers would be that it wasn’t worth contemplating.\\n\\n “Jacquie, are you home?” Reese shouted from the hallway leading to their respective bedrooms.\\n\\n “I’m taking a bath,” she called back, setting the book aside. It was barely after seven; perhaps his interest in the other woman had waned. The scented water and bubbles sloshed as she stood up. On second thought, maybe something was wrong, but she couldn’t imagine what. She reached for a thick oversized towel from the heated rack. “Is everything all right?”\\n\\n Reese knocked briefly on the bathroom door and, without waiting for her to respond, walked inside. His eyes widened as he took in the sight of her, breathless and rosy from the hot water, with a towel wrapped around her.\\n\\n “What are you doing here?” she demanded, flustered that he’d walked in on her practically nude. At one time, her body had been sleek and lovely, but the years had taken their toll. Her stomach sagged and her breasts were those of a woman in her fifties. She pulled the towel more securely about her.\\n\\n “Are you kicking me out of the bathroom, too?”\\n\\n “I’d appreciate my privacy.”\\n\\n His eyes seemed to go cold for a moment before a blank look slid into place. “I’d like to talk to you for a few minutes when you’re available.”\\n\\n “Of course,” she murmured.\\n\\n Reese backed out of the room and closed the door.\\n\\n As Jacqueline stepped out of the tub, she realized she was trembling. She rested one hand on the counter to steady herself, and drew in a deep, calming breath while she gathered her wits. She dried off, then slipped into her satin nightgown and matching robe. She cinched it tightly about her waist and paused in an effort to still her pounding heart before seeking out her husband.\\n\\n Jacqueline found Reese in the kitchen, standing in front of the open refrigerator. He removed a take-out container she’d brought home from lunch two days earlier. She rarely cooked anymore, especially since Martha, their housekeeper, was more than willing to assume the task. Jacqueline had her own commitments and no longer bothered with meal preparation. Reese usually ate alone because he tended to stay late at the office. Or so he said.\\n\\n “What’s wrong?”\\n\\n He didn’t answer. Instead he lifted the lid and examined what remained of her Caesar salad with shrimp. Apparently it didn’t suit him because he closed it again and stuck the container back in the refrigerator. “Do we have any eggs?”\\n\\n “I think so,” she said, stepping between him and the refrigerator door. “Would you like me to make you an omelet?”\\n\\n “Would you?” He acted surprised that she’d offered.\\n\\n Irritated, Jacqueline took the egg carton from the door and grabbed a cube of Monterey Jack cheese.\\n\\n “What are you doing home?” she asked. If she was going to cook for him, the least Reese could do was answer her questions.\\n\\n He perched on the bar stool and watched as she chose a small frying pan and set it on the burner. “Do we have any mushrooms?”\\n\\n “No. Now answer my question.”\\n\\n Reese sighed laboriously.\\n\\n “Fine. Don’t tell me,” she muttered and turned away. Rummaging in the vegetable bin, she located a useable green pepper, half an onion and a questionable-looking zucchini, which she deftly tossed in the garbage.\\n\\n “You sent Paul and Tammie Lee a floral bouquet, didn’t you?”\\n\\n “I told you I would,” she said irritably. She wasn’t accustomed to explaining her actions to her husband. Since when was she accountable to Reese? And she hated the way he’d been nagging her about their daughter-in-law.\\n\\n “Did you hear from Paul?”\\n\\n Jacqueline pinched her lips to hide her displeasure. “No, but Tammie Lee phoned to thank us for the roses,” she answered with bad grace. Actually Tammie Lee had gushed with appreciation and chattered on as if she’d never seen a dozen roses before.\\n\\n “Is that all she said?”\\n\\n “Should she have said more?” she snapped. Jacqueline resented this inquisition, and she wanted him to know it.\\n\\n Reese glanced away. “I have no idea. You were the one who spoke to her.”\\n\\n “She informed me that she’s thrilled about being pregnant. According to her, the pregnancy was a surprise.” Jacqueline could hardly wait to hear what her country-club friends said when they learned Tammie Lee was expecting. Everyone knew her feelings toward her daughter-in-law and her hope that Paul would recognize his mistake.\\n\\n “I think she did it on purpose.” Jacqueline bristled just saying it. Tammie Lee knew exactly what she was doing. This baby was no more an accident than Pearl Harbor had been.\\n\\n “It’s Paul’s life.”\\n\\n “Do we need to keep having the same conversation?” The pan was hot and she cut off a small slice of butter and let it melt before tossing in the chopped vegetables. Taking her frustration out on the eggs, she cracked their shells against the side of the bowl and beat three eggs into a frothy foam.\\n\\n “Did you sign up for the knitting class?”\\n\\n Reese was certainly full of questions, and she concentrated on her task rather than respond. It didn’t escape her notice that he was close-mouthed about the details of his own life. She wondered how he’d feel if she started asking him questions. Like why he happened to be home at this time of night when he was supposed to be with his mistress. Or why he was suddenly so curious about what Jacqueline was doing. She decided not to answer.\\n\\n Jacqueline half expected Reese to be angry at her lack of response. Instead he laughed.\\n\\n “What’s so funny?”\\n\\n “You. I can’t imagine you with a pair of knitting needles.”\\n\\n She decided to let that remark pass. She wouldn’t give him the satisfaction of letting him know he’d annoyed her.\\n\\n “You don’t look like any grandma I’ve ever seen—especially in the bathtub just now, all pink and pretty.”\\n\\n Again Jacqueline let his comment slide. She poured the beaten eggs on the semi-cooked vegetables and added a heaping handful of grated cheese. With practiced ease she loosened the edges of omelet and flipped it over. When the eggs had cooked the way she knew Reese liked them, she slipped the omelet onto a plate and handed it to her husband.\\n\\n Reese’s eyes lit up appreciatively.\\n\\n “You never did say why you’re home this early.” He’d already refused to answer her once and she wondered if he would again.\\n\\n “I was hungry,” he said simply and dug into the eggs and cheese.\\n\\n Whatever had really happened, Reese obviously didn’t plan to tell her. She watched him a moment and then said, “I’m going to bed to read.”\\n\\n Setting the dirty pan into the kitchen sink for Martha to wash in the morning, she left the kitchen.\\n\\n Reese didn’t say anything until she was halfway out of the room. “Jacquie.”\\n\\n “What is it?” she asked in a resigned tone.\\n\\n “Thanks for making me dinner.”\\n\\n She sighed audibly and slowly shook her head. “You’re welcome.” With that she walked into her bedroom. She took off the robe and sat on the edge of the queen-size bed piled high with decorative pillows, running her hand over the lacy cover. Turning aside the down comforter, she slid beneath the cool sheets and arranged her pillows so she could sit up and read.\\n\\n In the distance she heard Reese rinse off his plate and put it in the dishwasher. Soon afterward the television in the den went on; just when she was about to complain, he lowered the volume.\\n\\n Jacqueline read for about ten minutes—until tears unaccountably blurred her vision. She didn’t understand why she was crying. Leaning across the bed to the night-stand, she plucked a tissue from the decorative box.\\n\\n It was because everything was happening at once, she decided. This untimely pregnancy, and then Paul and their angry exchange the day before, followed by Reese’s unexpected arrival tonight. Her life was a shambles. She’d be the laughingstock of her friends, she thought bitterly. Mrs. Donovan with her white-trash daughter-in-law. Her pregnant daughter-in-law, her love-struck fool of a son and her straying husband.\\n\\n Still, she was determined to prove to Reese and Paul that she’d be a good grandmother if it killed her.\\n\\n CHAPTER 7\\n\\n CAROL GIRARD\\n\\n C arol was in a hopeful mood as she prepared dinner on Thursday evening. Doug was due home any minute and she was full of news. Cutting a chicken breast into bite-size pieces, she poured soy sauce over the uncooked meat to marinate for his favorite stir-fry.\\n\\n She smiled when the door opened and her husband entered the condo. “Hi, honey,” he said as he hung up his suit jacket, then joined her in the kitchen. Carol immediately turned into his arms and enthusiastically brought her lips to his. The kiss was long and involved, revealing her eagerness for lovemaking.\\n\\n “To what do I owe this greeting?” Doug asked, leaning back far enough to take a slow, lingering look at her.\\n\\n “I had a marvelous day.”\\n\\n “Tell me what you did,” he said. He loosened his grip on her waist and began to examine the mail, which she’d placed on the kitchen table.\\n\\n “After you left for work I went for another walk to that yarn store I found on Tuesday. Lydia said it wasn’t necessary until our class tomorrow, but I picked out the needles and yarn for the baby blanket. Just wait till I show you the picture! It’s so cute!” Carol rushed into the other room and produced a pattern and a ball of off-white yarn. “Isn’t this just perfect?” \\n\\n","sourceLink":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1/page-7.html","bookId":1933,"book":{"id":1933,"title":"The Shop on Blossom Street (Blossom Street #1)","description":"Storyline: The Shop on Blossom Street (Blossom Street #1) \\n Bestselling romance author and ardent knitter Debbie Macomber combines both her skills in this novel about a newly opened Seattle yarn shop and the knitting class that brings four women together to make baby blankets. The owner of the shop and her three students produce more than blankets, knitting together bonds of solidarity, friendship, love, hope, and renewal. The book even includes the pattern for the blanket, which was created by premier knitting designer Ann Norling. \\n When Lydia Hoffman, a cancer survivor and owner of A Good Yarn, starts a knitting class for her patrons, she forms a special friendship and bond with three extraordinary women--Jacqueline, Carol, and Alix--and together they share laughter, heartbreak, and dreams.\\n","cover":"https://allnovel.net/images/the-shop-on-blossom-street-blossom-street-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:55:42 AM"}}
