{"id":19956,"no":16,"title":"CHAPTER XIII.","content":"GOVERNMENT OF THE DEMOCRACY IN AMERICA. I am well aware of the difficulties which attend this part of my subject, but although every expression which I am about to make use of may clash, upon some one point, with the feelings of the different parties which divide my country, I shall speak my opinion with the most perfect openness. In Europe we are at a loss how to judge the true character and the more permanent propensities of democracy, because in Europe two conflicting principles exist, and we do not know what to attribute to the principles themselves, and what to refer to the passions which they bring into collision. Such, however, is not the case in America; there the people reigns without any obstacle, and it has no perils to dread, and no injuries to avenge. In America, democracy is swayed by its own free propensities; its course is natural, and its activity is unrestrained: the United States consequently afford the most favorable opportunity of studying its real character. And to no people can this inquiry be more vitally interesting than to the French nation, which is blindly driven onward by a daily and irresistible impulse, toward a state of things which may prove either despotic or republican, but which will assuredly be democratic. UNIVERSAL SUFFRAGE. I have already observed that universal suffrage has been adopted in all the states of the union: it consequently occurs among different populations which occupy very different positions in the scale of society. I have had opportunities of observing its effects in different localities, and among races of men who are nearly strangers to each other by their language, their religion, and their manner of life; in Louisiana as well as in New England, in Georgia and in Canada. I have remarked that universal suffrage is far from producing in America either all the good or all the evil consequences which are assigned to it in Europe, and that its effects differ very widely from those which are usually attributed to it. CHOICE OF THE PEOPLE, AND INSTINCTIVE PREFERENCES OF THE AMERICAN DEMOCRACY. In the United States the most talented Individuals are rarely placed at the Head of Affairs.—Reasons of this Peculiarity.—The Envy which prevails in the lower Orders of France against the higher Classes, is not a French, but a purely democratic Sentiment.—For what Reason the most distinguished Men in America frequently seclude themselves from public affairs. Many people in Europe are apt to believe without saying it, or to say without believing it, that one of the great advantages of universal suffrage is, that it intrusts the direction of public affairs to men who are worthy of the public confidence. They admit that the people is unable to govern for itself, but they aver that it is always sincerely disposed to promote the welfare of the state, and that it instinctively designates those persons who are animated by the same good wishes, and who are the most fit to wield the supreme authority. I confess that the observations I made in America by no means coincide with these opinions. On my arrival in the United States I was surprised to find so much distinguished talent among the subjects, and so little among the heads of the government. It is a well-authenticated fact, that at the present day the most talented men in the United States are very rarely placed at the head of affairs; and it must be acknowledged that such has been the result, in proportion as democracy has outstepped all its former limits. The race of American statesmen has evidently dwindled most remarkably in the course of the last fifty years. Several causes may be assigned to this phenomenon. It is impossible, notwithstanding the most strenuous exertions, to raise the intelligence of the people above a certain level. Whatever may be the facilities of acquiring information, whatever may be the profusion of easy methods and of cheap science, the human mind can never be instructed and educated without devoting a considerable space of time to those objects. The greater or the lesser possibility of subsisting without labor is therefore the necessary boundary of intellectual improvement. This boundary is more remote in some countries, and more restricted in others; but it must exist somewhere as long as the people is constrained to work in order to procure the means of physical subsistence, that is to say, as long as it retains its popular character. It is therefore quite as difficult to imagine a state in which all the citizens should be very well-informed, as a state in which they should all be wealthy; these two difficulties may be looked upon as correlative. It may very readily be admitted that the mass of the citizens are sincerely disposed to promote the welfare of their country; nay more, it may even be allowed that the lower classes are less apt to be swayed by considerations of personal interest than the higher orders; but it is always more or less impossible for them to discern the best means of attaining the end, which they desire with sincerity. Long and patient observation, joined to a multitude of different notions, is required to form a just estimate of the character of a single individual; and can it be supposed that the vulgar have the power of succeeding in an inquiry which misleads the penetration of genius itself? The people has neither the time nor the means which are essential to the prosecution of an investigation of this kind; its conclusions are hastily formed from a superficial inspection of the more prominent features of a question. Hence it often assents to the clamor of a mountebank, who knows the secret of stimulating its tastes; while its truest friends frequently fail in their exertions. Moreover, the democracy is not only deficient in that soundness of judgment which is necessary to select men really deserving of its confidence, but it has neither the desire nor the inclination to find them out. It cannot be denied that democratic institutions have a very strong tendency to promote the feeling of envy in the human heart; not so much because they afford to every one the means of rising to the level of any of his fellow-citizens, as because those means perpetually disappoint the persons who employ them. Democratic institutions awaken and foster a passion for equality which they can never entirely satisfy. This complete equality eludes the grasp of the people at the very moment when it thinks to hold it fast, and \"flies,\" as Pascal says, \"with eternal flight;\" the people is excited in the pursuit of an advantage, which is the more precious because it is not sufficiently remote to be unknown, or sufficiently near to be enjoyed. The lower orders are agitated by the chance of success, they are irritated by its uncertainty; and they pass from the enthusiasm of pursuit to the exhaustion of ill-success, and lastly to the acrimony of disappointment. Whatever transcends their own limits appears to be an obstacle to their desires, and there is no kind of superiority, however legitimate it may be, which is not irksome in their sight. It has been supposed that the secret instinct, which leads the lower orders to remove their superiors as much as possible from the direction of public affairs, is peculiar to France. This, however, is an error; the propensity to which I allude is not inherent in any particular nation, but in democratic institutions in general; and although it may have been heightened by peculiar political circumstances, it owes its origin to a higher cause. In the United States, the people is not disposed to hate the superior class of society; but it is not very favorably inclined toward them, and it carefully excludes them from the exercise of authority. It does not entertain any dread of distinguished talents, but it is rarely captivated by them; and it awards its approbation very sparingly to such as have risen without the popular support. While the natural propensities of democracy induce the people to reject the most distinguished citizens as its rulers, these individuals are no less apt to retire from a political career, in which it is almost impossible to retain their independence, or to advance without degrading themselves. This opinion has been very candidly set forth by Chancellor Kent, who says, in speaking with great eulogium of that part of the constitution which empowers the executive to nominate the judges: \"It is indeed probable that the men who are best fitted to discharge the duties of this high office would have too much reserve in their manners, and too much austerity in their principles, for them to be returned by the majority at an election where universal suffrage is adopted.\" Such were the opinions which were printed without contradiction in America in the year 1830. I hold it to be sufficiently demonstrated, that universal suffrage is by no means a guarantee of the wisdom of the popular choice; and that whatever its advantages may be, this is not one of them. CAUSES WHICH MAY PARTLY CORRECT THESE TENDENCIES OF THE DEMOCRACY. Contrary Effects produced on Peoples as well as on individuals by great Dangers.—Why so many distinguished Men stood at the Head of Affairs in America fifty Years ago.—Influence which the intelligence and the Manners of the People exercise upon its choice.—Example of New England.—States of the Southwest—Influence of certain Laws upon the Choice of the People.—Election by an elected Body.—Its Effects upon the Composition of the Senate. When a state is threatened by serious dangers, the people frequently succeed in selecting the citizens who are the most able to save it. It has been observed that man rarely retains his customary level in presence of very critical circumstances; he rises above, or he sinks below, his usual condition, and the same thing occurs in nations at large. Extreme perils sometimes quench the energy of a people instead of stimulating it; they excite without directing its passions; and instead of clearing, they confuse its powers of perception. The Jews deluged the smoking ruins of their temples with the carnage of the remnant of their host. But it is more common, both in the case of nations and in that of individuals, to find extraordinary virtues arising from the very imminence of the danger. Great characters are then thrown into relief, as the edifices which are concealed by the gloom of night, are illuminated by the glare of a conflagration. At those dangerous times genius no longer abstains from presenting itself in the arena; and the people, alarmed by the perils of its situation, buries its envious passions in a short oblivion. Great names may then be drawn from the urn of an election. I have already observed that the American statesmen of the present day are very inferior to those who stood at the head of affairs fifty years ago. This is as much a consequence of the circumstances, as of the laws of the country. When America was struggling in the high cause of independence to throw off the yoke of another country, and when it was about to usher a new nation into the world, the spirits of its inhabitants were roused to the height which their great efforts required. In this general excitement, the most distinguished men were ready to forestall the wants of the community, and the people clung to them for support, and placed them at its head. But events of this magnitude are rare; and it is from an inspection of the ordinary course of affairs that our judgment must be formed. If passing occurrences sometimes act as checks upon the passions of democracy, the intelligence and the manners of the community exercise an influence which is not less powerful, and far more permanent. This is extremely perceptible in the United States. In New England the education and the liberties of the communities were engendered by the moral and religious principles of their founders. Where society has acquired a sufficient degree of stability to enable it to hold certain maxims and to retain fixed habits, the lower orders are accustomed to respect intellectual superiority, and to submit to it without complaint, although they set at naught all those privileges which wealth and birth have introduced among mankind. The democracy in New England consequently makes a more judicious choice than it does elsewhere. But as we descend toward the south, to those states in which the constitution of society is more modern and less strong, where instruction is less general, and where the principles of morality, of religion, and of liberty, are less happily combined, we perceive that the talents and the virtues of those who are in authority become more and more rare. Lastly, when we arrive at the new southwestern states, in which the constitution of society dates but from yesterday, and presents an agglomeration of adventurers and speculators, we are amazed at the persons who are invested with public authority, and we are led to ask by what force, independent of the legislation and of the men who direct it, the state can be protected, and society be made to flourish. There are certain laws of a democratic nature which contribute, nevertheless, to correct, in some measure, the dangerous tendencies of democracy. On entering the house of representatives at Washington, one is struck by the vulgar demeanor of that great assembly. The eye frequently does not discover a man of celebrity within its walls. Its members are almost all obscure individuals, whose names present no associations to the mind: they are mostly village-lawyers, men in trade, or even persons belonging to the lower classes of society. In a country in which education is very general, it is said that the representatives of the people do not always know how to write correctly. At a few yards distance from this spot is the door of the senate, which contains within a small space a large proportion of the celebrated men of America. Scarcely an individual is to be perceived in it who does not recall the idea of an active and illustrious career: the senate is composed of eloquent advocates, distinguished generals, wise magistrates, and statesmen of note, whose language would at all times do honor to the most remarkable parliamentary debates of Europe. What then is the cause of this strange contrast, and why are the most able citizens to be found in one assembly rather than in the other? Why is the former body remarkable for its vulgarity and its poverty of talent, while the latter seems to enjoy a monopoly of intelligence and of sound judgment? Both of these assemblies emanate from the people; both of them are chosen by universal suffrage; and no voice has hitherto been heard to assert, in America, that the senate is hostile to the interests of the people. From what cause, then, does so startling a difference arise? The only reason which appears to me adequately to account for it is, that the house of representatives is elected by the populace directly, and that of the senate is elected by elected bodies. The whole body of the citizens names the legislature of each state, and the federal constitution converts these legislatures into so many electoral bodies, which return the members of the senate. The senators are elected by an indirect application of universal suffrage; for the legislatures which name them are not aristocratic or privileged bodies which exercise the electoral franchise in their own right; but they are chosen by the totality of the citizens; they are generally elected every year, and new members may constantly be chosen, who will employ their electoral rights in conformity with the wishes of the public. But this transmission of the popular authority through an assembly of chosen men, operates an important change in it, by refining its discretion and improving the forms which it adopts. Men who are chosen in this manner, accurately represent the majority of the nation which governs them; but they represent the elevated thoughts which are current in the community, the generous propensities which prompt its nobler actions, rather than the petty passions which disturb, or the vices which disgrace it. The time may be already anticipated at which the American republics will be obliged to introduce the plan of election by an elected body more frequently into their system of representation, or they will incur no small risk of perishing miserably among the shoals of democracy. And here I have no scruple in confessing that I look upon this peculiar system of election as the only means of bringing the exercise of political power to the level of all classes of the people. Those thinkers who regard this institution as the exclusive weapon of a party, and those who fear, on the other hand, to make use of it, seem to me to fall into as great an error in the one case as in the other. INFLUENCE WHICH THE AMERICAN DEMOCRACY HAS EXERCISED ON THE LAWS RELATING TO ELECTIONS. When Elections are rare, they expose the State to a violent Crisis.—When they are frequent, they keep up a degree of feverish Excitement.—The Americans have preferred the second of these two Evils.—Mutability of the Laws.—Opinions of Hamilton and Jefferson on this Subject. When elections recur at long intervals, the state is exposed to violent agitation every time they take place. Parties exert themselves to the utmost in order to gain a prize which is so rarely within their reach; and as the evil is almost irremediable for the candidates who fail, the consequence of their disappointed ambition may prove most disastrous: if, on the other hand, the legal struggle can be repeated within a short space of time, the defeated parties take patience. When elections occur frequently, this recurrence keeps society in a perpetual state of feverish excitement, and imparts a continual instability to public affairs. Thus, on the one hand, the state is exposed to the perils of a revolution, on the other, to perpetual mutability; the former system threatens the very existence of the government, the latter is an obstacle to all steady and consistent policy. The Americans have preferred the second of these evils to the first; but they were led to this conclusion by their instinct much more than by their reason; for a taste for variety is one of the characteristic passions of democracy. An extraordinary mutability has, by this means, been introduced into their legislation. Many of the Americans consider the instability of their laws as a necessary consequence of a system whose general results are beneficial. But no one in the United States affects to deny the fact of this instability, or to contend that it is not a great evil. Hamilton, after having demonstrated the utility of a power which might prevent, or which might at least impede, the promulgation of bad laws, adds: \"It may perhaps be said that the power of preventing bad laws includes that of preventing good ones, and may be used to the one purpose as well as to the other. But this objection will have but little weight with those who can properly estimate the mischiefs of that inconstancy and mutability in the laws which form the greatest blemish in the character and genius of our government.\"—(Federalist, No. 73.) And again, in No. 62 of the same work, he observes: \"The facility and excess of law-making seem to be the diseases to which our governments are most liable.... The mischievous effects of the mutability in the public councils arising from a rapid succession of new members, would fill a volume; every new election in the states is found to change one half of the representatives. From this change of men must proceed a change of opinions and of measures which forfeits the respect and confidence of nations, poisons the blessings of liberty itself, and diminishes the attachment and reverence of the people toward a political system which betrays so many marks of infirmity.\" Jefferson himself, the greatest democrat whom the democracy of America has as yet produced, pointed out the same evils. \"The instability of our laws,\" he said in a letter to Madison, \"is really a very serious inconvenience. I think we ought to have obviated it by deciding that a whole year should always be allowed to elapse between the bringing in of a bill and the final passing of it. It should afterward be discussed and put to the vote without the possibility of making any alteration in it; and if the circumstances of the case required a more speedy decision, the question should not be decided by a simple majority, but by a majority of at least two thirds of both houses.\" PUBLIC OFFICERS UNDER THE CONTROL OF THE DEMOCRACY OF AMERICA. Simple Exterior of the American public Officers.—No official Costume.—All public Officers are remunerated.—Political Consequences of this System.—No public Career exists in America.—Result of this. Public officers in the United States are commingled with the crowd of citizens; they have neither palaces, nor guards, nor ceremonial costumes. This simple exterior of the persons in authority is connected, not only with the peculiarities of the American character, but with the fundamental principles of that society. In the estimation of the democracy, a government is not a benefit, but a necessary evil. A certain degree of power must be granted to public officers, for they would be of no use without it. But the ostensible semblance of authority is by no means indispensable to the conduct of affairs; and it is needlessly offensive to the susceptibility of the public. The public officers themselves are well aware that they only enjoy the superiority over their fellow citizens, which they derive from their authority, upon condition of putting themselves on a level with the whole community by their manners. A public officer in the United States is uniformly civil, accessible to all the world, attentive to all requests, and obliging in all his replies. I was pleased by these characteristics of a democratic government; and I was struck by the manly independence of the citizens, who respect the office more than the officer, and who are less attached to the emblems of authority than to the man who bears them. I am inclined to believe that the influence which costumes really exercise, in an age like that in which we live, has been a good deal exaggerated. I never perceived that a public officer in America was the less respected while he was in the discharge of his duties because his own merit was set off by no adventitious signs. On the other hand, it is very doubtful whether a peculiar dress contributes to the respect which public characters ought to have for their own position, at least when they are not otherwise inclined to respect it. When a magistrate (and in France such instances are not rare), indulges his trivial wit at the expense of a prisoner, or derides a predicament in which a culprit is placed, it would be well to deprive him of his robes of office, to see whether he would recall some portion of the natural dignity of mankind when he is reduced to the apparel of a private citizen. A democracy may, however, allow a certain show of magisterial pomp, and clothe its officers in silks and gold, without seriously compromising its principles. Privileges of this kind are transitory; they belong to the place, and are distinct from the individual: but if public officers are not uniformly remunerated by the state, the public charges must be intrusted to men of opulence and independence, who constitute the basis of an aristocracy; and if the people still retains its right of election, that election can only be made from a certain class of citizens. When a democratic republic renders offices which had formerly been remunerated, gratuitous, it may safely be believed that that state is advancing to monarchical institutions; and when a monarchy begins to remunerate such officers as had hitherto been unpaid, it is a sure sign that it is approaching toward a despotic or a republican form of government. The substitution of paid for unpaid functionaries is of itself, in my opinion, sufficient to constitute a serious revolution. I look upon the entire absence of gratuitous functionaries in America as one of the most prominent signs of the absolute dominion which democracy exercises in that country. All public services, of whatsoever nature they may be, are paid; so that every one has not merely a right, but also the means of performing them. Although, in democratic states, all the citizens are qualified to occupy stations in the government, all are not tempted to try for them. The number and the capacities of the candidates are more apt to restrict the choice of electors than the conditions of the candidateship. In nations in which the principle of election extends to every place in the state, no political career can, properly speaking, be said to exist. Men are promoted as if by chance to the rank which they enjoy, and they are by no means sure of retaining it. The consequence is that in tranquil times public functions offer but few lures to ambition. In the United States the persons who engage in the perplexities of political life are individuals of very moderate pretensions. The pursuit of wealth generally diverts men of great talents and of great passions from the pursuit of power; and it very frequently happens that a man does not undertake to direct the fortune of the state until he has discovered his incompetence to conduct his own affairs. The vast number of very ordinary men who occupy public stations is quite as attributable to these causes as to the bad choice of the democracy. In the United States, I am not sure that the people would return the men of superior abilities who might solicit its support, but it is certain that men of this description do not come forward. ARBITRARY POWER OF MAGISTRATES{164} UNDER THE RULE OF AMERICAN DEMOCRACY. For what Reason the arbitrary Power of Magistrates is greater in absolute Monarchies and in democratic Republics that it is in limited Monarchies.—Arbitrary Power of the Magistrates in New England. In two different kinds of government the magistrates exercise a considerable degree of arbitrary power; namely, under the absolute government of a single individual, and under that of a democracy. This identical result proceeds from causes which are nearly analogous. In despotic states the fortune of no citizen is secure; and public officers are not more safe than private individuals. The sovereign, who has under his control the lives, the property, and sometimes the honor of the men whom he employs, does not scruple to allow them a great latitude of action, because he is convinced that they will not use it to his prejudice. In despotic states the sovereign is so attached to the exercise of his power, that he dislikes the constraint even of his own regulations; and he is well pleased that his agents should follow a somewhat fortuitous line of conduct, provided he be certain that their actions will never counteract his desires. In democracies, as the majority has every year the right of depriving the officers whom it has appointed of their power, it has no reason to fear abuse of their authority. As the people is always able to signify its wishes to those who conduct the government, it prefers leaving them to make their own exertions, to prescribing an invariable rule of conduct which would at once fetter their activity and the popular authority. It may even be observed, on attentive consideration, that under the rule of a democracy the arbitrary power of the magistrate must be still greater than in despotic states. In the latter, the sovereign has the power of punishing all the faults with which he becomes acquainted, but it would be vain for him to hope to become acquainted with all those which are committed. In the former the sovereign power is not only supreme, but it is universally present. The American functionaries are, in point of fact, much more independent in the sphere of action which the law traces out for them, than any public officer in Europe. Very frequently the object which they are to accomplish is simply pointed out to them, and the choice of the means is left to their own discretion. In New England, for instance, the selectmen of each township are bound to draw up the list of persons who are to serve on the jury; the only rule which is laid down to guide them in their choice is that they are to select citizens possessing the elective franchise and enjoying a fair reputation.{165} In France the lives and liberties of the subjects would be thought to be in danger, if a public officer of any kind was intrusted with so formidable a right. In New England, the same magistrates are empowered to post the names of habitual drunkards in public houses, and to prohibit the inhabitants of a town from supplying them with liquor.{166} A censorial power of this excessive kind would be revolting to the population of the most absolute monarchies; here, however, it is submitted to without difficulty. Nowhere has so much been left by the law to the arbitrary determination of the magistrates as in democratic republics, because this arbitrary power is unattended by any alarming consequences. It may even be asserted that the freedom of the magistrate increases as the elective franchise is extended, and as the duration of the time of office is shortened. Hence arises the great difficulty which attends the conversion of a democratic republic into a monarchy. The magistrate ceases to be elective, but he retains the rights and the habits of an elected officer, which lead directly to despotism. It is only in limited monarchies that the law which prescribes the sphere in which public officers are to act, superintends all their measures. The cause of this may be easily detected. In limited monarchies the power is divided between the king and the people, both of whom are interested in the stability of the magistrate. The king does not venture to place the public officers under the control of the people, lest they should be tempted to betray his interests; on the other hand, the people fears lest the magistrates should serve to oppress the liberties of the country, if they were entirely dependent upon the crown: they cannot therefore be said to depend on either the one or the other. The same cause which induces the king and the people to render public officers independent, suggests the necessity of such securities as may prevent their independence from encroaching upon the authority of the former and the liberties of the latter. They consequently agree as to the necessity of restricting the functionary to a line of conduct laid down beforehand, and they are interested in confining him by certain regulations which he cannot evade. {The observations respecting the arbitrary powers of magistrates are practically among the most erroneous in the work. The author seems to have confounded the idea of magistrates being independent with their being arbitrary. Yet he had just before spoken of their dependance on popular election as a reason why there was no apprehension of the abuse of their authority. The independence, then, to which he alludes must be an immunity from responsibility to any other department. But it is a fundamental principle of our system, that all officers are liable to criminal prosecution \"whenever they act partially or oppressively from a malicious or corrupt motive.\" See 15 Wendell\u0027s Reports, 278. That our magistrates are independent when they do not act partially or oppressively is very true, and, it is to be hoped, is equally true in every form of government. There would seem, therefore, not to be such a degree of independence as necessarily to produce arbitrariness. The author supposes that magistrates are more arbitrary in a despotism and in a democracy than in a limited monarchy. And yet, the limits of independence and of responsibility existing in the United States are borrowed from and identical with those established in England—the most prominent instance of a limited monarchy. See the authorities referred to in the case in Wendell\u0027s Reports, before quoted. Discretion in the execution of various ministerial duties, and in the awarding of punishment by judicial officers, is indispensable in every system of government, from the utter impossibility of \"laying down beforehand a line of conduct\" (as the author expresses it) in such cases. The very instances of discretionary power to which he refers, and which he considers arbitrary, exist in England. There, the persons from whom juries are to be formed for the trial of causes, civil and criminal, are selected by the sheriffs, who are appointed by the crown—a power, certainly more liable to abuse in their hands, than in those of selectmen or other town-officers, chosen annually by the people. The other power referred to, that of posting the names of habitual drunkards, and forbidding their being supplied with liquor, is but a reiteration of the principles contained in the English statute of 32 Geo. III., ch. 45, respecting idle and disorderly persons. Indeed it may be said with great confidence, that there is not an instance of discretionary power being vested in American magistrates which does not find its prototype in the English laws. The whole argument of the author on this point, therefore, would seem to fail.—American Editor.} INSTABILITY OF THE ADMINISTRATION IN THE UNITED STATES. In America the public Acts of a Community frequently leave fewer Traces than the Occurrences of a Family.—Newspapers the only historical Remains.—Instability of the Administration prejudicial to the Art of Government. The authority which public men possess in America is so brief, and they are so soon commingled with the ever-changing population of the country, that the acts of a community frequently leave fewer traces than the occurrences of a private family. The public administration is, so to speak, oral and traditionary. But little is committed to writing, and that little is wafted away for ever, like the leaves of the sibyl, by the smallest breeze. The only historical remains in the United States are the newspapers; but if a number be wanting, the chain of time is broken, and the present is severed from the past. I am convinced that in fifty years it will be more difficult to collect authentic documents concerning the social condition of the Americans at the present day, than it is to find remains of the administration of France during the middle ages; and if the United States were ever invaded by barbarians, it would be necessary to have recourse to the history of other nations, in order to learn anything of the people which now inhabits them. The instability of the administration has penetrated into the habits of the people: it even appears to suit the general taste, and no one cares for what occurred before his time. No methodical system is pursued; no archives are formed; and no documents are brought together when it would be very easy to do so. Where they exist little store is set upon them; and I have among my papers several original public documents which were given to me in answer to some of my inquiries. In America society seems to live from hand to mouth, like an army in the field. Nevertheless, the art of administration may undoubtedly be ranked as a science, and no sciences can be improved, if the discoveries and observations of successive generations are not connected together in the order in which they occur. One man, in the short space of his life, remarks a fact; another conceives an idea; the former invents a means of execution, the latter reduces a truth to a fixed proposition; and mankind gathers the fruits of individual experience upon its way, and gradually forms the sciences. But the persons who conduct the administration in America can seldom afford any instruction to each other; and when they assume the direction of society, they simply possess those attainments which are most widely disseminated in the community, and no experience peculiar to themselves. Democracy, carried to its farthest limits, is therefore prejudicial to the art of government; and for this reason it is better adapted to a people already versed in the conduct of an administration, than to a nation which is uninitiated in public affairs. This remark, indeed, is not exclusively applicable to the science of administration. Although a democratic government is founded upon a very simple and natural principle, it always presupposes the existence of a high degree of culture and enlightenment in society.{167} At the first glance it may be imagined to belong to the earliest ages of the world; but maturer observation will convince us that it could only come last in the succession of human history. {These remarks upon the \"instability of administration\" in America, are partly correct, but partly erroneous. It is certainly true that our public men are not educated to the business of government; even our diplomatists are selected with very little reference to their experience in that department. But the universal attention that is paid by the intelligent, to the measures of government and to the discussions to which they give rise, is in itself no slight preparation for the ordinary duties of legislation. And, indeed, this the author subsequently seems to admit. As to there being \"no archives formed\" of public documents, the author is certainly mistaken. The journals of congress, the journals of state legislatures, the public documents transmitted to and originating in those bodies, are carefully preserved and disseminated through the nation: and they furnish in themselves the materials of a full and accurate history. Our great defect, doubtless, is in the want of statistical information. Excepting the annual reports of the state of our commerce, made by the secretary of the treasury, under law, and excepting the census which is taken every ten years under the authority of congress, and those taken by the states, we have no official statistics. It is supposed that the author had this species of information in his mind when he alluded to the general deficiency of our archives.—American Editor.} CHARGES LEVIED BY THE STATE UNDER THE RULE OF THE AMERICAN DEMOCRACY. In all Communities Citizens divisible into three Classes.—Habits of each of these Classes in the Direction of public Finances.—Why public Expenditures must tend to increase when the People governs.—What renders the Extravagance of a Democracy less to be feared in America.—Public Expenditure under a Democracy. Before we can affirm whether a democratic form of government is economical or not, we must establish a suitable standard of comparison. The question would be one of easy solution if we were to attempt to draw a parallel between a democratic republic and an absolute monarchy. The public expenditure would be found to be more considerable under the former than under the latter; such is the case with all free states compared to those which are not so. It is certain that despotism ruins individuals by preventing them from producing wealth, much more than by depriving them of the wealth they have produced: it dries up the source of riches, while it usually respects acquired property. Freedom, on the contrary, engenders far more benefits than it destroys; and the nations which are favored by free institutions, invariably find that their resources increase even more rapidly than their taxes. My present object is to compare free nations to each other; and to point out the influence of democracy upon the finances of a state. Communities, as well as organic bodies, are subject to certain fixed rules in their formation which they cannot evade. They are composed of certain elements which are common to them at all times and under all circumstances. The people may always be mentally divided into three distinct classes. The first of these classes consists of the wealthy; the second, of those who are in easy circumstances; and the third is composed of those who have little or no property, and who subsist more especially by the work which they perform for the two superior orders. The proportion of the individuals who are included in these three divisions may vary according to the condition of society; but the divisions themselves can never be obliterated. It is evident that each of these classes will exercise an influence, peculiar to its own propensities, upon the administration of the finances of the state. If the first of the three exclusively possess the legislative power, it is probable that it will not be sparing of the public funds, because the taxes which are levied on a large fortune only tend to diminish the sum of superfluous enjoyment, and are, in point of fact, but little felt. If the second class has the power of making the laws, it will certainly not be lavish of taxes, because nothing is so onerous as a large impost which is levied upon a small income. The government of the middle classes appears to me to be the most economical, though perhaps not the most enlightened, and certainly not the most generous, of free governments. But let us now suppose that the legislative authority is vested in the lowest orders: there are two striking reasons which show that the tendency of the expenditure will be to increase, not to diminish. As the great majority of those who create the laws are possessed of no property upon which taxes can be imposed, all the money which is spent for the community appears to be spent to their advantage, at no cost of their own; and those who are possessed of some little property readily find means of regulating the taxes so that they are burthensome to the wealthy and profitable to the poor, although the rich are unable to take the same advantage when they are in possession of the government. In countries in which the poor{168} should be exclusively invested with the power of making the laws, no great economy of public expenditure ought to be expected; that expenditure will always be considerable; either because the taxes do not weigh upon those who levy them, or because they are levied in such a manner as not to weigh upon those classes. In other words, the government of the democracy is the only one under which the power which lays on taxes escapes the payment of them. It may be objected (but the argument has no real weight) that the true interest of the people is indissolubly connected with that of the wealthier portion of the community, since it cannot but suffer by the severe measures to which it resorts. But is it not the true interest of kings to render their subjects happy; and the true interest of nobles to admit recruits into their order on suitable grounds? If remote advantages had power to prevail over the passions and the exigencies of the moment, no such thing as a tyrannical sovereign or an exclusive aristocracy could ever exist. Again, it may be objected that the poor are never invested with the sole power of making the laws; but I reply, that wherever universal suffrage has been established, the majority of the community unquestionably exercises the legislative authority, and if it be proved that the poor always constitute the majority, it may be added, with perfect truth, that in the countries in which they possess the elective franchise, they possess the sole power of making laws. But it is certain that in all the nations of the world the greater number has always consisted of those persons who hold no property, or of those whose property is insufficient to exempt them from the necessity of working in order to procure an easy subsistence. Universal suffrage does therefore in point of fact invest the poor with the government of society. The disastrous influence which popular authority may sometimes exercise upon the finances of a state, was very clearly seen in some of the democratic republics of antiquity, in which the public treasure was exhausted in order to relieve indigent citizens, or to supply the games and theatrical amusements of the populace. It is true that the representative system was then very imperfectly known, and that, at the present time, the influence of popular passions is less felt in the conduct of public affairs; but it may be believed that the delegate will in the end conform to the principles of his constituents, and favor their propensities as much as their interests. The extravagance of democracy is, however, less to be dreaded in proportion as the people acquires a share of property, because on the one hand the contributions of the rich are then less needed, and on the other, it is more difficult to lay on taxes which do not affect the interests of the lower classes. On this account universal suffrage would be less dangerous in France than in England, because in the latter country the property on which taxes may be levied is vested in fewer hands. America, where the great majority of the citizens is possessed of some fortune, is in a still more favorable position than France. There are still farther causes which may increase the sum of public expenditures in democratic countries. When the aristocracy governs, the individuals who conduct the affairs of state are exempted, by their own station in society, from every kind of privation: they are contented with their position; power and renown are the objects for which they strive; and, as they are placed far above the obscurer throng of citizens, they do not always distinctly perceive how the wellbeing of the mass of the people ought to redound to their own honor. They are not indeed, callous to the sufferings of the poor, but they cannot feel those miseries as acutely as if they were themselves partakers of them. Provided that the people appear to submit to its lot, the rulers are satisfied and they demand nothing farther from the government. An aristocracy is more intent upon the means of maintaining its influence, than upon the means of improving its condition. When, on the contrary, the people is invested with the supreme authority, the perpetual sense of their own miseries impels the rulers of society to seek for perpetual meliorations. A thousand different objects are subjected to improvement; the most trivial details are sought out as susceptible of amendment; and those changes which are accompanied with considerable expense, are more especially advocated, since the object is to render the condition of the poor more tolerable, who cannot pay for themselves. Moreover, all democratic communities are agitated by an ill-defined excitement, and by a kind of feverish impatience, that engenders a multitude of innovations, almost all of which are attended with expense. In monarchies and aristocracies, the natural taste which the rulers have for power and for renown, is stimulated by the promptings of ambition, and they are frequently incited by these temptations to very costly undertakings. In democracies, where the rulers labor under privations, they can only be courted by such means as improve their wellbeing, and these improvements cannot take place without a sacrifice of money. When a people begins to reflect upon its situation, it discovers a multitude of wants, to which it had not before been subject, and to satisfy these exigencies, recourse must be had to the coffers of the state. Hence it arises, that the public charges increase in proportion as civilisation spreads, and that the imposts are augmented as knowledge pervades the community. The last cause which frequently renders a democratic government dearer than any other is, that a democracy does not always succeed in moderating its expenditure, because it does not understand the art of being economical. As the designs which it entertains are frequently changed, and the agents of those designs are more frequently removed, its undertakings are often ill-conducted or left unfinished; in the former case the state spends sums out of all proportion to the end which it proposes to accomplish; in the second, the expense itself is unprofitable. TENDENCIES OF THE AMERICAN DEMOCRACY AS REGARDS THE SALARIES OF PUBLIC OFFICERS. In Democracies those who establish high Salaries have no Chance of profiting by them.—Tendency of the American Democracy to increase the Salaries of subordinate Officers, and to lower those of the more important functionaries.—Reason of this.—Comparative Statement of the Salaries of public Officers in the United States and in France. There is a powerful reason which usually induces democracies to economise upon the salaries of public officers. As the number of citizens who dispense the remuneration is extremely large in democratic countries, so the number of persons who can hope to be benefited by the receipt of it is comparatively small. In aristocratic countries, on the contrary, the individuals who appoint high salaries, have almost always a vague hope of profiting by them. These appointments may be looked upon as a capital which they create for their own use, or at least, as a resource for their children. It must, however, be allowed that a democratic state is most parsimonious toward its principal agents. In America the secondary officers are much better paid, and the dignitaries of the administration much worse than they are elsewhere. These opposite effects result from the same cause: the people fixes the salaries of the public officers in both cases; and the scale of remuneration is determined by the consideration of its own wants. It is held to be fair that the servants of the public should be placed in the same easy circumstances as the public itself;{169} but when the question turns upon the salaries of the great officers of state, this rule fails, and chance alone can guide the popular decision. The poor have no adequate conceptions of the wants which the higher classes of society may feel. The sum which is scanty to the rich, appears enormous to the poor man, whose wants do not extend beyond the necessaries of life: and in his estimation the governor of a state, with his two or three hundred a year, is a very fortunate and enviable being.{170} If you undertake to convince him that the representative of a great people ought to be able to maintain some show of splendor in the eyes of foreign nations, he will perhaps assent to your meaning; but when he reflects on his own humble dwelling, and on the hard-earned produce of his wearisome toil, he remembers all that he could do with a salary which you say is insufficient, and he is startled or almost frightened at the sight of such uncommon wealth. Besides, the secondary public officer is almost on a level with the people, while the others are raised above it. The former may therefore excite his interest, but the latter begins to arouse his envy. This is very clearly seen in the United States, where the salaries seem to decrease as the authority of those who receive them augments.{171} Under the rule of an aristocracy it frequently happens, on the contrary, that while the high officers are receiving munificent salaries, the inferior ones have not more than enough to procure the necessaries of life. The reason of this fact is easily discoverable from causes very analogous to those to which I have just alluded. If a democracy is unable to conceive the pleasures of the rich, or to see them without envy, an aristocracy is slow to understand, or, to speak more correctly, is unacquainted with the privations of the poor. The poor man is not (if we use the term aright) the fellow of the rich one; but he is the being of another species. An aristocracy is therefore apt to care but little for the fate of its subordinate agents: and their salaries are only raised when they refuse to perform their service for too scanty a remuneration. It is the parsimonious conduct of democracy toward its principal officers, which has countenanced a supposition of far more economical propensities than any which it really possesses. It is true that it scarcely allows the means of honorable subsistence to the individuals who conduct its affairs; but enormous sums are lavished to meet the exigencies or to facilitate the enjoyments of the people.{172} The money raised by taxation may be better employed, but it is not saved. In general, democracy gives largely to the community, and very sparingly to those who govern it. The reverse is the case in the aristocratic countries, where the money of the state is expended to the profit of the persons who are at the head of affairs. DIFFICULTY OF DISTINGUISHING THE CAUSES WHICH CONTRIBUTE TO THE ECONOMY OF THE AMERICAN GOVERNMENT. We are liable to frequent errors in the research of those facts which exercise a serious influence upon the fate of mankind, since nothing is more difficult than to appreciate their real value. One people is naturally inconsistent and enthusiastic; another is sober and calculating; and these characteristics originate in their physical constitution, or in remote causes with which we are unacquainted. There are nations which are fond of parade and the bustle of festivity, and which do not regret the costly gaieties of an hour. Others, on the contrary, are attached to more retiring pleasures, and seem almost ashamed of appearing to be pleased. In some countries the highest value is set upon the beauty of public edifices; in others the productions of art are treated with indifference, and everything which is unproductive is looked down upon with contempt. In some renown, in others money, is the ruling passion. Independently of the laws, all these causes concur to exercise a very powerful influence upon the conduct of the finances of the state. If the Americans never spend the money of the people in galas, it is not only because the imposition of taxes is under the control of the people, but because the people takes no delight in public rejoicings. If they repudiate all ornament from their architecture, and set no store on any but the more practical and homely advantages, it is not only because they live under democratic institutions, but because they are a commercial nation. The habits of private life are continued in public; and we ought carefully to distinguish that economy which depends upon their institutions, from that which is the natural result of their manners and customs. WHETHER THE EXPENDITURE OF THE UNITED STATES CAN BE COMPARED TO THAT OF FRANCE. Two Points to be established in order to estimate the Extent of the public Charges, viz.: the national Wealth, and the Rate of Taxation.—The Wealth and the Charges of France not accurately known.—Why the Wealth and Charges of the union cannot be accurately known.—Researches of the Author with a View to discover the Amount of Taxation in Pennsylvania.—General Symptoms which may serve to indicate the Amount of the public Charges in a given Nation.—Result of this Investigation for the union. Many attempts have recently been made in France to compare the public expenditure of that country with the expenditure of the United States; all these attempts have, however, been unattended by success; and a few words will suffice to show that they could not have had a satisfactory result. In order to estimate the amount of the public charges of a people, two preliminaries are indispensable; it is necessary, in the first place, to know the wealth of that people; and in the second, to learn what portion of that wealth is devoted to the expenditure of the state. To show the amount of taxation without showing the resources which are destined to meet the demand, is to undertake a futile labor; for it is not the expenditure, but the relation of the expenditure to the revenue, which it is desirable to know. The same rate of taxation which may easily be supported by a wealthy contributor, will reduce a poor one to extreme misery. The wealth of nations is composed of several distinct elements, of which population is the first, real property the second, and personal property the third. The first of these three elements may be discovered without difficulty. Among civilized nations it is easy to obtain an accurate census of the inhabitants; but the two others cannot be determined with so much facility. It is difficult to take an exact account of all the lands in a country which are under cultivation, with their natural or their acquired value; and it is still more impossible to estimate the entire personal property which is at the disposal of the nation, and which eludes the strictest analysis by the diversity and number of shapes under which it may occur. And, indeed, we find that the most ancient civilized nations of Europe, including even those in which the administration is most central, have not succeeded, as yet, in determining the exact condition of their wealth. In America the attempt has never been made; for how would such an investigation be possible in a country where society has not yet settled into habits of regularity and tranquillity; where the national government is not assisted by a multitude of agents whose exertions it can command, and direct to one sole end; and where statistics are not studied, because no one is able to collect the necessary documents, or can find time to peruse them? Thus the primary elements of the calculations which have been made in France, cannot be obtained in the union; the relative wealth of the two countries is unknown: the property of the former is not accurately determined, and no means exist of computing that of the latter. I consent, therefore, for the sake of the discussion, to abandon this necessary term of the comparison, and I confine myself to a computation of the actual amount of taxation, without investigating the relation which subsists between the taxation and the revenue. But the reader will perceive that my task has not been facilitated by the limits which I here lay down for my researches. It cannot be doubted that the central administration of France, assisted by all the public officers who are at its disposal, might determine with exactitude the amount of the direct and indirect taxes levied upon the citizens. But this investigation, which no private individual can undertake, has not hitherto been completed by the French government, or, at least, its results have not been made public. We are acquainted with the sum total of the state; we know the amount of the departmental expenditure; but the expenses of the communal divisions have not been computed, and the amount of the public expenses of France is unknown. If we now turn to America, we shall perceive that the difficulties are multiplied and enhanced. The union publishes an exact return of the amount of its expenditure; the budgets of the four-and-twenty states furnish similar returns of their revenues; but the expenses incident to the affairs of the counties and the townships are unknown.{173} The authority of the federal government cannot oblige the provincial governments to throw any light upon this point; and even if these governments were inclined to afford their simultaneous co-operation, it may be doubted whether they possess the means of procuring a satisfactory answer. Independently of the natural difficulties of the task, the political organization of the country would act as a hindrance to the success of their efforts. The county and town magistrates are not appointed by the authorities of the state, and they are not subjected to their control. It is therefore very allowable to suppose, that if the state was desirous of obtaining the returns which we require, its designs would be counteracted by the neglect of those subordinate officers whom it would be obliged to employ.{174} It is, in point of fact, useless to inquire what the Americans might do to forward this inquiry, since it is certain that they have hitherto done nothing at all. There does not exist a single individual at the present day, in America or in Europe, who can inform us what each citizen of the union annually contributes to the public charges of the nation.{175} If I attempt to compare the French budget with the budget of the union, it must be remembered that the latter embraces much fewer objects than the central government of the former country, and that the expenditure must consequently be much smaller. If I contrast the budgets of the departments to those of the states which constitute the union, it must be observed, that as the power and control exercised by the states is much greater than that which is exercised by the departments, their expenditure is also more considerable. As for the budgets of the counties, nothing of the kind occurs in the French system of finance; and it is, again, doubtful whether the corresponding expenses should be referred to the budget of the state or to those of the municipal divisions. Municipal expenses exist in both countries, but they are not always analogous. In America the townships discharge a variety of offices which are reserved in France to the departments or the state. It may, moreover, be asked, what is to be understood by the municipal expenses of America. The organization of the municipal bodies or townships differs in the several states: Are we to be guided by what occurs in New England or in Georgia, in Pennsylvania or the state of Illinois? A kind of analogy may very readily be perceived between certain budgets in the two countries: but as the elements of which they are composed always differ more or less, no fair comparison can be instituted between them. Hence we must conclude, that it is no less difficult to compare the social expenditure, than it is to estimate the relative wealth of France and of America. I will even add, that it would be dangerous to attempt this comparison; for when statistics are not founded upon computations which are strictly accurate, they mislead instead of guiding aright. The mind is easily imposed upon by the false affectation of exactitude which prevails even in the mis-statements of the science, and adopts with confidence the errors which are apparelled in the forms of mathematical truth. We abandon, therefore, our numerical investigation, with the hope of meeting with data of another kind. In the absence of positive documents, we may form an opinion as to the proportion which the taxation of a people bears to its real prosperity, by observing whether its external appearance is flourishing; whether, after having discharged the calls of the state, the poor man retains the means of subsistence, and the rich the means of enjoyment; and whether both classes are contented with their position, seeking however to meliorate it by perpetual exertions, so that industry is never in want of capital, nor capital unemployed by industry. The observer who draws his inferences from these signs will, undoubtedly, be led to the conclusion, that the American of the United States contributes a much smaller portion of his income to the state than the citizen of France. Nor, indeed, can the result be otherwise. A portion of the French debt is the consequence of two successive invasions; and the union has no similar calamity to fear. A nation placed upon the continent of Europe is obliged to maintain a large standing army; the isolated position of the union enables it to have only 6,000 soldiers. The French have a fleet of 300 sail; the Americans have 52 vessels.{176} How, then, can the inhabitant of the union be called upon to contribute as largely as the inhabitant of France? No parallel can be drawn between the finances of two countries so differently situated. It is by examining what actually takes place in the union, and not by comparing the union with France, that we may discover whether the American government is really economical. On casting my eyes over the different republics which form the confederation, I perceive that their governments lack perseverance in their undertakings, and that they exercise no steady control over the men whom they employ. Whence I naturally infer, that they must often spend the money of the people to no purpose, or consume more of it than is really necessary to their undertakings. Great efforts are made, in accordance with the democratic origin of society, to satisfy the exigencies of the lower orders, to open the career of power to their endeavors, and to diffuse knowledge and comfort among them. The poor are maintained, immense sums are annually devoted to public instruction, all services whatsoever are remunerated, and the most subordinate agents are liberally paid. If this kind of government appears to me to be useful and rational, I am nevertheless constrained to admit that it is expensive. Wherever the poor direct public affairs and dispose of the national resources, it appears certain, that as they profit by the expenditure of the state, they are apt to augment that expenditure. I conclude therefore, without having recourse to inaccurate computations, and without hazarding a comparison which might prove incorrect, that the democratic government of the Americans is not a cheap government, as is sometimes asserted; and I have no hesitation in predicting, that if the people of the United States is ever involved in serious difficulties, its taxation will speedily be increased to the rate of that which prevails in the greater part of the aristocracies and the monarchies of Europe. CORRUPTION AND VICES OF THE RULERS IN A DEMOCRACY, AND CONSEQUENT EFFECTS UPON PUBLIC MORALITY. In Aristocracies Rulers sometimes endeavor to corrupt the People.—In Democracies Rulers frequently show themselves to be corrupt.—In the former their Vices are directly prejudicial to the Morality of the People.—In the latter their indirect Influence is still more pernicious. A distinction must be made, when the aristocratic and the democratic principles mutually inveigh against each other, as tending to facilitate corruption. In aristocratic governments the individuals who are placed at the head of affairs are rich men, who are solely desirous of power. In democracies statesmen are poor, and they have their fortunes to make. The consequence is, that in aristocratic states the rulers are rarely accessible to corruption, and have very little craving for money; while the reverse is the case in democratic nations. But in aristocracies, as those who are desirous of arriving at the head of affairs are possessed of considerable wealth, and as the number of persons by whose assistance they may rise is comparatively small, the government is, if I may use the expression, put up to a sort of auction. In democracies, on the contrary, those who are covetous of power are very seldom wealthy, and the number of citizens who confer that power is extremely great. Perhaps in democracies the number of men who might be bought is by no means smaller, but buyers are rarely to be met with; and, besides, it would be necessary to buy so many persons at once, that the attempt is rendered nugatory. Many of the men who have been in the administration in France during the last forty years, have been accused of making their fortunes at the expense of the state or of its allies; a reproach which was rarely addressed to the public characters of the ancient monarchy. But in France the practice of bribing electors is almost unknown, while it is notoriously and publicly carried on in England. In the United States I never heard a man accused of spending his wealth in corrupting the populace; but I have often heard the probity of public officers questioned; still more frequently have I heard their success attributed to low intrigues and immoral practices. If, then, the men who conduct the government of an aristocracy sometimes endeavor to corrupt the people, the heads of a democracy are themselves corrupt. In the former case the morality of the people is directly assailed; in the latter, an indirect influence is exercised upon the people, which is still more to be dreaded. As the rulers of democratic nations are almost always exposed to the suspicion of dishonorable conduct, they in some measure lend the authority of the government to the base practices of which they are accused. They thus afford an example which must prove discouraging to the struggles of virtuous independence, and must foster the secret calculations of a vicious ambition. If it be asserted that evil passions are displayed in all ranks of society; that they ascend the throne by hereditary right; and that despicable characters are to be met with at the head of aristocratic nations as well as in the sphere of a democracy; this objection has but little weight in my estimation. The corruption of men who have casually risen to power has a coarse and vulgar infection in it, which renders it contagious to the multitude. On the contrary, there is a kind of aristocratic refinement, and an air of grandeur, in the depravity of the great, which frequently prevents it from spreading abroad. The people can never penetrate the perplexing labyrinth of court intrigue, and it will always have difficulty in detecting the turpitude which lurks under elegant manners, refined tastes, and graceful language. But to pillage the public purse, and to vend the favors of the state, are arts which the meanest villain may comprehend, and hope to practise in his turn. In reality it is far less prejudicial to be a witness to the immorality of the great, than to that immorality which leads to greatness. In a democracy, private citizens see a man of their own rank in life, who rises from that obscure position, and who becomes possessed of riches and of power in a few years: the spectacle excites their surprise and their envy: and they are led to inquire how the person who was yesterday their equal, is to-day their ruler. To attribute his rise to his talents or his virtues is unpleasant; for it is tacitly to acknowledge that they are themselves less virtuous and less talented than he was. They are therefore led (and not unfrequently their conjecture is a correct one) to impute his success mainly to some of his defects; and an odious mixture is thus formed of the ideas of turpitude and power, unworthiness and success, utility and dishonor. EFFORTS OF WHICH A DEMOCRACY IS CAPABLE. The union has only had one struggle hitherto for its Existence.—Enthusiasm at the Commencement of the War.—Indifference toward its Close.—Difficulty of establishing a military Conscription or impressment of Seamen in America.—Why a democratic People is less capable of sustained Effort than another. I here warn the reader that I speak of a government which implicitly follows the real desires of the people, and not of a government which simply commands in its name. Nothing is so irresistible as a tyrannical power commanding in the name of the people, because, while it exercises that moral influence which belongs to the decisions of the majority, it acts at the same time with the promptitude and the tenacity of a single man. It is difficult to say what degree of exertion a democratic government may be capable of making, at a crisis in the history of the nation. But no great democratic republic has hitherto existed in the world. To style the oligarchy which ruled over France in 1793, by that name, would be to offer an insult to the republican form of government. The United States afford the first example of the kind. The American union has now subsisted for half a century, in the course of which time its existence has only once been attacked, namely, during the war of independence. At the commencement of that long war, various occurrences took place which betokened an extraordinary zeal for the service of the country.{177} But as the contest was prolonged, symptoms of private egotism began to show themselves. No money was poured into the public treasury; few recruits could be raised to join the army; the people wished to acquire independence, but was very ill disposed to undergo the privations by which alone it could be obtained. \"Tax laws,\" says Hamilton in the Federalist (No. 12), \"have in vain been multiplied; new methods to enforce the collection have in vain been tried; the public expectation has been uniformly disappointed; and the treasuries of the states have remained empty. The popular system of administration inherent in the nature of popular government, coinciding with the real scarcity of money incident to a languid and mutilated state of trade, has hitherto defeated every experiment for extensive collections, and has at length taught the different legislatures the folly of attempting them.\" The United States have not had any serious war to carry on since that period. In order, therefore, to appreciate the sacrifices which democratic nations may impose upon themselves, we must wait until the American people is obliged to put half its entire income at the disposal of the government, as was done by the English; or until it sends forth a twentieth part of its population to the field of battle, as was done by France. In America the use of conscription is unknown, and men are induced to enlist by bounties. The notions and habits of the people of the United States are so opposed to compulsory enlistments, that I do not imagine that it can ever be sanctioned by the laws. What is termed the conscription in France is assuredly the heaviest tax upon the population of that country; yet how could a great continental war be carried on without it? The Americans have not adopted the British impressment of seamen, and they have nothing which corresponds to the French system of maritime conscription; the navy, as well as the merchant service, is supplied by voluntary engagement. But it is not easy to conceive how a people can sustain a great maritime war, without having recourse to one or the other of these two systems. Indeed, the union, which has fought with some honor upon the seas, has never possessed a very numerous fleet, and the equipment of the small number of American vessels has always been excessively expensive. {The remark that \"in America the use of conscription is unknown, and men are induced to enlist by bounties,\" is not exactly correct. During the last war with Great Britain, the state of New York, in October, 1814 (see the laws of that session, p. 15), passed an act to raise troops for the defence of the state, in which the whole body of the militia were directed to be classed, and each class to furnish one soldier, so as to make up the whole number of 12,000 directed to be raised. In case of the refusal of a class to furnish a man, one was to be detached from them by ballot, and was compelled to procure a substitute or serve personally. The intervention of peace rendered proceedings under the act unnecessary, and we have not, therefore, the light of experience to form an opinion whether such a plan of raising a military force is practicable. Other states passed similar laws. The system of classing was borrowed from the practice of the revolution.—American Editor.} I have heard American statesmen confess that the union will have great difficulty in maintaining its rank on the seas, without adopting the system of impressment or of maritime conscription; but the difficulty is to induce the people, which exercises the supreme authority, to submit to impressment or any compulsory system. It is incontestable, that in times of danger a free people displays far more energy than one which is not so. But I incline to believe, that this is more especially the case in those free nations in which the democratic element preponderates. Democracy appears to me to be much better adapted for the peaceful conduct of society, or for an occasional effort of remarkable vigor, than for the hardy and prolonged endurance of the storms which beset the political existence of nations. The reason is very evident; it is enthusiasm which prompts men to expose themselves to dangers and privations; but they will not support them long without reflection. There is more calculation, even in the impulses of bravery, than is generally attributed to them; and although the first efforts are suggested by passion, perseverance is maintained by a distinct regard of the purpose in view. A portion of what we value is exposed, in order to save the remainder. But it is this distinct perception of the future, founded upon a sound judgment and an enlightened experience, which is most frequently wanting in democracies. The populace is more apt to feel than to reason; and if its present sufferings are great, it is to be feared that the still greater sufferings attendant upon defeat will be forgotten. Another cause tends to render the efforts of a democratic government less persevering than those of an aristocracy. Not only are the lower classes less awakened than the higher orders to the good or evil chances of the future, but they are liable to suffer far more acutely from present privations. The noble exposes his life, indeed, but the chance of glory is equal to the chance of harm. If he sacrifices a large portion of his income to the state, he deprives himself for a time of the pleasure of affluence; but to the poor man death is embellished by no pomp or renown; and the imposts which are irksome to the rich are fatal to him. This relative impotence of democratic republics is, perhaps, the greatest obstacle to the foundation of a republic of this kind in Europe. In order that such a state should subsist in one country of the Old World, it would be necessary that similar institutions should be introduced into all the other nations. I am of opinion that a democratic government tends in the end to increase the real strength of society; but it can never combine, upon a single point and at a given time, so much power as an aristocracy or a monarchy. If a democratic country remained during a whole century subject to a republican government, it would probably at the end of that period be more populous and more prosperous than the neighboring despotic states. But it would have incurred the risk of being conquered much oftener than they would in that lapse of years. SELF-CONTROL OF THE AMERICAN DEMOCRACY. The American People acquiesces slowly, or frequently does not acquiesce in what is beneficial to its Interests.—The faults of the American Democracy are for the most part reparable. The difficulty which a democracy has in conquering the passions, and in subduing the exigencies of the moment, with a view to the future, is conspicuous in the most trivial occurrences in the United States. The people which is surrounded by flatterers, has great difficulty in surmounting its inclinations; and whenever it is solicited to undergo a privation or any kind of inconvenience, even to attain an end which is sanctioned by its own rational conviction, it almost always refuses to comply at first. The deference of the Americans to the laws has been very justly applauded; but it must be added, that in America the legislation is made by the people and for the people. Consequently, in the United States, the law favors those classes which are most interested in evading it elsewhere. It may therefore be supposed that an offensive law, which should not be acknowledged to be one of immediate utility, would either not be enacted or would not be obeyed. In America there is no law against fraudulent bankruptcies; not because they are few, but because there are a great number of bankruptcies. The dread of being prosecuted as a bankrupt acts with more intensity upon the mind of the majority of the people, than the fear of being involved in losses or ruin by the failure of other parties; and a sort of guilty tolerance is extended by the public conscience, to an offence which every one condemns in his individual capacity. In the new states of the southwest, the citizens generally take justice into their own hands, and murders are of very frequent occurrence. This arises from the rude manners and the ignorance of the inhabitants of those deserts, who do not perceive the utility of investing the law with adequate force, and who prefer duels to prosecutions. Some one observed to me one day, in Philadelphia, that almost all crimes in America are caused by the abuse of intoxicating liquors, which the lower classes can procure in great abundance from their excessive cheapness.—\"How comes it,\" said I, \"that you do not put a duty upon brandy?\"—\"Our legislators,\" rejoined my informant, \"have frequently thought of this expedient; but the task of putting it in operation is a difficult one: a revolt might be apprehended; and the members who should vote for a law of this kind would be sure of losing their seats.\"—\"Whence I am to infer,\" I replied, \"that the drinking population constitutes the majority in your country and that temperance is somewhat unpopular.\" When these things are pointed out to the American statesmen, they content themselves with assuring you that time will operate the necessary change, and that the experience of evil will teach the people its true interests. This is frequently true; although a democracy is more liable to error than a monarch or a body of nobles, the chances of its regaining the right path, when once it has acknowledged its mistake, are greater also; because it is rarely embarrassed by internal interests, which conflict with those of the majority, and resist the authority of reason. But a democracy can only obtain truth as the result of experience; and many nations may forfeit their existence, while they are awaiting the consequences of their errors. The great privilege of the Americans does not simply consist in their being more enlightened than other nations, but in their being able to repair the faults they may commit. To which it must be added, that a democracy cannot derive substantial benefit from past experience, unless it be arrived at a certain pitch of knowledge and civilisation. There are tribes and peoples whose education has been so vicious, and whose character presents so strange a mixture of passion, of ignorance, and of erroneous notions upon all subjects, that they are unable to discern the cause of their own wretchedness, and they fall a sacrifice to ills with which they are unacquainted. I have crossed vast tracts of country that were formerly inhabited by powerful Indian nations which are now extinct; I have myself passed some time in the midst of mutilated tribes, which see the daily decline of their numerical strength, and of the glory of their independence; and I have heard these Indians themselves anticipate the impending doom of their race. Every European can perceive means which would rescue these unfortunate beings from inevitable destruction. They alone are insensible to the expedient; they feel the woe which year after year heaps upon their heads, but they will perish to a man without accepting the remedy. It would be necessary to employ force to induce them to submit to the protection and the constraint of civilisation. The incessant revolutions which have convulsed the South American provinces for the last quarter of a century have frequently been adverted to with astonishment, and expectations have been expressed that those nations would speedily return to their natural state. But can it be affirmed that the turmoil of revolution is not actually the most natural state of the South American Spaniards at the present time? In that country society is plunged into difficulties from which all its efforts are insufficient to rescue it. The inhabitants of that fair portion of the western hemisphere seem obstinately bent on pursuing the work of inward havoc. If they fall into a momentary repose from the effects of exhaustion, that repose prepares them for a fresh state of phrensy. When I consider their condition, which alternates between misery and crime, I should be inclined to believe that despotism itself would be a benefit to them, if it were possible that the words despotism and benefit could ever be united in my mind. CONDUCT OF FOREIGN AFFAIRS BY THE AMERICAN DEMOCRACY. Direction given to the foreign Policy of the United States by Washington and Jefferson.—Almost all the defects inherent in democratic Institutions are brought to light in the Conduct of foreign Affairs.—Their advantages are less perceptible. We have seen that the federal constitution intrusts the permanent direction of the external interests of the nation to the president and the senate;{178} which tends in some degree to detach the general foreign policy of the union from the control of the people. It cannot therefore be asserted, with truth, that the external affairs of state are conducted by the democracy. The policy of America owes its rise to Washington, and after him to Jefferson, who established those principles which it observes at the present day. Washington said, in the admirable letter which he addressed to his fellow-citizens, and which may be looked upon as his political bequest to the country:— \"The great rule of conduct for us in regard to foreign nations is, extending our commercial relations, to have with them as little political connexion as possible. So far as we have already formed engagements, let them lie fulfilled with perfect good faith. Here let us stop. \"Europe has a set of primary interests, which to us have none, or a very remote relation. Hence, she must be engaged in frequent controversies, the causes of which are essentially foreign to our concerns. Hence, therefore, it must be unwise in us to implicate ourselves, by artificial ties, in the ordinary vicissitudes of her politics, or the ordinary combinations and collisions of her friendships or enmities. \"Our detached and distant situation invites and enables us to pursue a different course. If we remain one people, under an efficient government, the period is not far off when we may defy material injury from external annoyance; when we may take such an attitude as will cause the neutrality we may at any time resolve upon to be scrupulously respected; when belligerent nations, under the impossibility of making acquisitions upon us, will not lightly hazard the giving us provocation; when we may choose peace or war, as our interest, guided by justice, shall counsel. \"Why forego the advantages of so peculiar a situation? Why quit our own to stand upon foreign ground? Why, by interweaving our destiny with that of any part of Europe, entangle our peace and prosperity in the toils of European ambition, rivalship, interest, humor, or caprice? \"It is our true policy to steer clear of permanent alliances with any portion of the foreign world; so far, I mean, as we are now at liberty to do it; for let me not be understood as capable of patronising infidelity to existing engagements. I hold the maxim no less applicable to public than to private affairs, that honesty is always the best policy. I repeat it, therefore, let those engagements be observed in their genuine sense; but in my opinion it is unnecessary, and would be unwise, to extend them. \"Taking care always to keep ourselves, by suitable establishments, in a respectable defensive posture, we may safely trust to temporary alliances for extraordinary emergencies.\" In a previous part of the same letter, Washington makes the following admirable and just remark: \"The nation which indulges toward another an habitual hatred, or an habitual fondness, is, in some degree, a slave. It is a slave to its animosity or its affection, either of which is sufficient to lead it astray from its duty and its interest.\" The political conduct of Washington was always guided by these maxims. He succeeded in maintaining his country in a state of peace, while all the other nations of the globe were at war; and he laid it down as a fundamental doctrine, that the true interest of the Americans consisted in a perfect neutrality with regard to the internal dissensions of the European powers. Jefferson went still farther, and introduced a maxim into the policy of the union, which affirms, that \"the Americans ought never to solicit any privileges from foreign nations, in order not to be obliged to grant similar privileges themselves.\" These two principles, which were so plain and so just as to be adapted to the capacity of the populace, have greatly simplified the foreign policy of the United States. As the union takes no part in the affairs of Europe, it has, properly speaking, no foreign interests to discuss, since it has at present no powerful neighbors on the American continent. The country is as much removed from the passions of the Old World by its position, as by the line of policy which it has chosen; and it is neither called upon to repudiate nor to espouse the conflicting interests of Europe; while the dissensions of the New World are still concealed within the bosom of the future. The union is free from all pre-existing obligations; and it is consequently enabled to profit by the experience of the old nations of Europe, without being obliged, as they are, to make the best of the past, and to adapt it to their present circumstances; or to accept that immense inheritance which they derive from their forefathers—an inheritance of glory mingled with calamities, and of alliances conflicting with national antipathies. The foreign policy of the United States is reduced by its very nature to await the chances of the future history of the nation; and for the present it consists more in abstaining from interference than in exerting its activity. It is therefore very difficult to ascertain, at present, what degree of sagacity the American democracy will display in the conduct of the foreign policy of the country; and upon this point its adversaries, as well as its advocates, must suspend their judgment. As for myself, I have no hesitation in avowing my conviction, that it is most especially in the conduct of foreign relations, that democratic governments appear to me to be decidedly inferior to governments carried on upon different principles. Experience, instruction, and habit, may almost always succeed in creating a species of practical discretion in democracies, and that science of the daily occurrences of life which is called good sense. Good sense may suffice to direct the ordinary course of society; and among a people whose education has been provided for, the advantages of democratic liberty in the internal affairs of the country may more than compensate for the evils inherent in a democratic government. But such is not always the case in the mutual relations of foreign nations. Foreign politics demand scarcely any of those qualities which a democracy possesses; and they require, on the contrary, the perfect use of almost all those faculties in which it is deficient. Democracy is favorable to the increase of the internal resources of a state; it tends to diffuse a moderate independence; it promotes the growth of public spirit, and fortifies the respect which is entertained for law in all classes of society: and these are advantages which only exercise an indirect influence over the relations which one people bears to another. But a democracy is unable to regulate the details of an important undertaking, to persevere in a design, and to work out its execution in the presence of serious obstacles. It cannot combine its measures with secrecy, and will not await their consequences with patience. These are qualities which more especially belong to an individual or to an aristocracy; and they are precisely the means by which an individual people attains a predominant position. If, on the contrary, we observe the natural defects of aristocracy, we shall find that their influence is comparatively innoxious in the direction of the external affairs of a state. The capital fault of which aristocratic bodies may be accused, is that they are more apt to contrive their own advantage than that of the mass of the people. In foreign politics it is rare for the interest of the aristocracy to be in any way distinct from that of the people. The propensity which democracies have to obey the impulse of passion rather than the suggestions of prudence, and to abandon a mature design for the gratification of a momentary caprice, was very clearly seen in America on the breaking out of the French revolution. It was then as evident to the simplest capacity as it is at the present time, that the interests of the Americans forbade them to take any part in the contest which was about to deluge Europe with blood, but which could by no means injure the welfare of their own country. Nevertheless the sympathies of the people declared themselves with so much violence in behalf of France, that nothing but the inflexible character of Washington, and the immense popularity which he enjoyed, could have prevented the Americans from declaring war against England. And even then, the exertions, which the austere reason of that great man made to repress the generous but imprudent passions of his fellow-citizens, very nearly deprived him of the sole recompense which he had ever claimed—that of his country\u0027s love. The majority then reprobated the line of policy which he adopted and which has since been unanimously approved by the nation.{179} If the constitution and the favor of the public had not intrusted the direction of the foreign affairs of the country to Washington, it is certain that the American nation would at that time have taken the very measures which it now condemns. Almost all the nations which have exercised a powerful influence upon the destinies of the world, by conceiving, following up, and executing vast designs—from the Romans to the English—have been governed by aristocratic institutions. Nor will this be a subject of wonder when we recollect that nothing in the world has so absolute a fixity of purpose as an aristocracy. The mass of the people may be led astray by ignorance or passion; the mind of a king may be biased, and his perseverance in his designs may be shaken—beside which a king is not immortal; but an aristocratic body is too numerous to be led astray by the blandishments of intrigue, and yet not numerous enough to yield readily to the intoxicating influence of unreflecting passion: it has the energy of a firm and enlightened individual, added to the power which it derives from its perpetuity.","sourceLink":"http://novel.tingroom.com/duanpian/2819/77915.html","bookId":1259,"book":{"id":1259,"title":"American Institutions and Their Influence","description":"简介： The American publishers of M. De Tocqueville\u0027s Democracy in America, have been frequently solicited to furnish the work in a form adapted to seminaries of learning, and at a price which would secure its more general circulation, and enable trustees o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2819","creation":"Aug 1, 2019 12:24:44 AM","modification":"Aug 1, 2019 12:24:44 AM"}}
