{"id":22791,"no":1,"title":"Preface","content":"This book is intended as an explanation of the new educational ideals and methods now being fostered and developed, under great difficulties, by courageous educators, in various schools for the most part outside the public school system. These schools are “experimental” in the sense that they are demonstrating upon a small scale the vast possibilities of a modern kind of education. The importance of these schools consists not so much in the advantages which they are now able to give to a few of our children, but rather in the prophetic vision they afford of all youth growing up with the same advantages. \n \n Before that can happen, the public must discover what the new education signifies, and why the old educational system is unable to keep up with the demands of modern civilization. \n \n This book attempts only a small part of such a tremendous task of enlightenment. But it does undertake a brief review of the educational situation[Pg viii] in the light of our present scientific knowledge of human nature—and more especially, of the human nature of the child. \n \n Education may be said to be, essentially, an adjustment between the child and the age in which he lives. That adjustment can be a painless and happy one; at present it is a sort of civil war. This book deals precisely with the special problems involved in the difficult process of reconciling the nature of the child with the nature of our twentieth-century machine-culture. \n \n The method chosen in these pages for the exposition of this situation is one which many readers will consider unduly flippant, particularly in those passages which deal with the failure of the old educational system. But one might as well laugh at that failure as cry over it; for it is a ridiculous as well as a pathetic failure. The important thing is to recognize that it is a failure, and to lend a hand if we can in the creating of a better kind of education. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2525/69767.html","bookId":415,"book":{"id":415,"title":"Were You Ever a Child?","description":"简介： This book is intended as an explanation of the new educational ideals and methods now being fostered and developed, under great difficulties, by courageous educators, in various schools for the most part outside the public school system. These school...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2525","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
