{"id":4347,"no":7,"title":"Chapter 5 THE ANNEXATION","content":"Doubtful attitude of Boers towards Mission — H. R. H. attends debates in Volksraad — Paul Kruger — H. R. H.‘s projected journey home — Which was given up — Transvaal annexed — H. R. H. delivers copies of Proclamation and hoists British flag with Colonel Brooke.\n Life at Pretoria was very gay during this Annexation period. We gave a ball, followed on the next evening by a children’s party; the President entertained us to lunch. The English in the town gave us a great dinner in the Volksraad Zaal at which “God save the Queen” was sung with enthusiasm, and there were many other entertainments.\n But underneath all these festivities grave issues were maturing. Shortly after our arrival four hundred and fifty Boers rode into the town with the object of putting us back over the border. They were unarmed, but we discovered that they had left their rifles hidden in waggons not far away and guarded by a hundred and fifty men. If they really had any such intention, however, it evaporated after they had proceeded to the Government offices to ask what the English were doing in Pretoria and hoisted their flag in the Market Square. Then they talked a while and went away. One man, I remember, either on this or another occasion came and stood before the English flag which marked our camp, and shouted, “O Father, O Grandfather, O Great-grandfather, rise from the dead and drive away those red-handed wretches who have come to take our land from us, the land which we took from the Swartzels (black creatures)!”\n Then he made a somewhat feeble rush for the said flag, but was collared by his friends and taken off, still apostrophising his ancestors. It all sounds very mock-heroic and absurd, and yet I repeat that there was much to justify this attitude of the Boers. After all they had taken the land and lived there nearly forty years, and the British Government had more or less guaranteed their independence. Of course circumstances alter cases, and, as they could not govern themselves and were about to plunge South Africa into a bloody war, our intervention was necessary, but this the more ignorant of them could scarcely be expected to understand, at any rate at first.\n Many threats were uttered against us. Says Sir Theophilus Shepstone in one of his despatches of that day to Lord Carnarvon: “Every effort had been made during the previous fortnight by, it is said, educated Hollanders who had but lately arrived in the country, to rouse the fanaticism of the Boers and to induce them to offer ‘bloody’ resistance to what it was known I intended to do. The Boers were appealed to in the most inflammatory language by printed manifestos and memorials . . . it was urged that I had but a small escort which could easily be overpowered.”\n Indeed there is no doubt that at times during these months we went in considerable risk. I will not set down all the stories that came to our ears, of how we were to be waylaid and shot on this occasion or on that, but an incident that I remember shows me that Shepstone at any rate thought there was something in them. One night I and another member of the staff — I think it was Morcom — were at work late, copying despatches in a room of the building which afterwards became Government House. This room had large windows opening on to a verandah, and over these we had not drawn the curtains. Sir Theophilus came in and scolded us, saying that we ought to remember that we made a very easy target against that lighted background. Then he drew the curtains with his own hand.\n The Volksraad met and discussed all kinds of matters, but nothing came of their labours, except the appointment of a Commission to examine into the state of the country and confer with H.M.‘s Special Commissioner. I attended some of their debates and remember the scene well. They were held in a long, low room down the centre of which stood a deal table. Round this table sat some thirty members, most of them Boers. At the head of the room sat the Chairman at a little raised desk, by the side of which stood a chair for the use of the President of the State when he visited the Volksraad. Among the members was Paul Kruger, then a middle-aged man with a stern, thick face and a squat figure. At one of these sittings I obtained his autograph, a curious piece of calligraphy which I am sorry to say I have lost. We saw a good deal of “Oom Paul” in those days, for on several occasions he visited the Special Commissioner. Generally I showed him in and out, and I recollect that the man impressed me more than did any of the other Boers.\n In after days I knew that Volksraad Zaal well enough, for when I became Master and Registrar of the High Court I used to sit in it just beneath the judge.\n Doubtless I wrote a good many letters home at this time, but I imagine that they were destroyed either on receipt or perhaps after my mother’s death. Four or five of them, however, my father preserved, apparently because they refer to money matters. A little while ago my brother William8 found them when rummaging through papers at Bradenham, and kindly sent them to me. I have just re-read them for the first time, and, as a full generation has gone by since they were written, I find the experience strange and in a sense sad. The intervening years seem to fall away; the past arises real and vivid, and I see myself a slim, quick-faced young fellow seated in that room at Pretoria inditing these epistles which I had so long forgotten. They are written in a much better hand than I can boast today, every word being clear and every letter well formed, which doubtless was a result of my despatch work. I will quote some extracts.\n 8 Sir Rider’s eldest brother, the late Sir W. H. D. Haggard, K.C.M.G., at that time Minister at Rio. — Ed.\n Pretoria, S.A.R.: March 13, 1877.\n My dear Father, — Since my last letter matters have been rapidly advancing and drawing to a close. The Raad, after making a last move at once futile and foolish, has prorogued itself and left matters to take their course. Things are also looking much more peaceable, and I do not think that there will be any armed resistance. At one time an outbreak seemed imminent, in which case we should have run a very fair chance of being potted on our own stoep. . . . I spoke a day or two ago to the Chief as to my taking home the despatches, and he told me that he could not send me as the bearer of the despatches, 1st: because it was no longer done except through foreign territories; 2nd: because I might be delayed on the road by sickness or accidents, and that in performing a long journey of the sort a mail-bag had a better chance of getting safely and swiftly to its destination than a messenger. “But,” he said, “I will send you with the despatches and with credentials to the Colonial authorities, empowering you to give such information as my despatches do not and cannot contain, which is a great deal” (Sir T. is not a voluminous writer), “and in this way you will be a living despatch.”\n This is perhaps not quite so good as taking the actual letters, since I shall not get my expenses, but as far as regards other things it will answer my purpose equally well. It will be something to my name in case I wish or am obliged at any future time to avail myself of it. Besides it is indirectly a great compliment to myself. Any young fellow can carry despatches, but it is not for everybody of my age and short experience who would be trusted to give private information on so important a subject as the unexpected annexation of a splendid territory as large as Great Britain, information which may very probably be made use of in Parliament. Since I have been here I have done my best to study the question and to keep myself informed as to every detail, and I get my reward in this manner . . . .\n I think that I shall come home via the Cape. It will be a stiff journey, 1200 miles in a post-cart, but it will be a thing to have done, and I want if possible to get to London at the same time as despatches announcing the Annexation. When the Proclamation will go I cannot say, but I think it will be in the course of the next fortnight. We received news to-night that the troops and guns are on the way to Newcastle. I shall start by mail following the issue of the Proclamation.\n We are going on as usual here working in the dark (we are beginning to emerge now) and waiting the result. It has been an anxious business, but I think that we are all right now.\n I had rather that my letters were not shown, as we do not quite know what line the Home Government is going to take, and I have spoken pretty plainly. [All these letters to which I refer here are missing. — H. R. H.]\n It was after my return from Secocoeni’s and, I think, within a day or two of the Proclamation being issued, that I received that harsh epistle from my father of which I have written earlier in this book, that, as I have said, caused me at the last moment not to start for England. It was a very foolish act on my part, as the reader who studies the facts will see. I should have remembered that when he wrote his letter my father could not have known that I was coming home in this important position, namely to give viva-voce information to Lord Carnarvon as to all the circumstances connected with the Annexation. Nor, although I have little doubt that my mother and my sister Mary, now Baroness A. d’Anethan, were privy to the secret and private reasons for my journey, to which I have also already alluded, was he perhaps aware of them. However, so I acted in my hurt pride and anger, and there the thing remains. I may say in excuse of this want of judgment that I was very young, only twenty, and that I had to make up my mind on the spot while, as the Zulus say, “my heart was cut in two.”\n Moreover I repeat my belief that the finger of Fate was at work in the matter, how and why perhaps we should have to go back, or forward, ages or aeons to explain. Years ago I came to the conclusion that our individual lives and the accidents which influence them are not the petty things they seem to be, but rather a part of some great scheme whereof we know neither the beginning nor the end. The threads of our destinies, in black or in scarlet or in sombre grey, appear and disappear before our mortal eyes, but who can figure out the tapestry that they help to weave? That picture lies beyond our ken or even our imagining.\n The insect sees more than the worm, the snake more than the insect, the dog more than the snake, and the man, erect in his pride, more than all of them. But how much does the man see of the whole great universe, or even of this little earth?\n To the best of my belief I answered my father’s letter, which I think I destroyed upon the spot, very briefly, saying that I had abandoned my idea of coming home. Apparently this letter was not preserved. One remains, however, which appears to allude to the subject, and from it I quote some extracts.\n My dear Father, — I have to acknowledge your two letters dated respectively 27th March and the 4th April. I do not think that it will be of any good to dwell any more on what is to me, in some ways at least, a rather painful subject . . . .\n I received today my letter of appointment as English Clerk to the Colonial Secretary’s Office with a salary of 250 pounds per annum. I have not yet got my appointment as Clerk to the Executive Council, which will be worth nominally 100 pounds per annum, but in reality only 50 pounds. It was to have been gazetted tomorrow with the other, but the Chief thought it better to wait. However, unless something occurs, I shall get it before long, as soon as there is an Executive to be Clerk to. The reason that 50 pounds is to be knocked off is that it is not desirable to give offence by making my pay higher than that of any other clerk in the service, and though virtually I shall stand first on the list, it is thought better that I should not be nominally either under or over the one or two drawing equal pay. My position as “English Clerk” will be a perfectly independent one. The English work of the office will be in my hands, and as it now far more than equals the Dutch and will increase day by day, of course it is the most important part of the business and will soon swamp the other.\n The reason of the delay in my appointment is that there has been a difference of opinion about it between the Chief and Mr. Osborn, who is to be Colonial Secretary and consequently my Head of Department and, under the Governor, of the whole service. The Chief wished me to stop on with him as Despatch Clerk with the same salary, and Obsorn wanted me in his office. In the end they compromised it: my appointment is made out as above, and when I am wanted at Government House I am to go there. On the whole I would rather have it as it is, for the work will be more interesting though harder, and the position, on the whole, better.\n So much for the appointment itself; now as regards its future probable or possible results. . . . It is far better to take service here than in Natal. In five years Natal will be to this country what Ireland is to England. To begin with, the Transvaal is more than six times its size. If the Transvaal at all realises what is expected of it, it will before long, with its natural wealth and splendid climate, be one of the most splendid foreign possessions of the British Crown, and if as is probable gold is discovered in large quantities, it may take a sudden rush forward, and then one will be borne up with it. So that whatever happens I think that I shall always do pretty well here. However, my aim is of course to rise to the position of a Colonial Governor, and to do that I must trust to good fortune and my interest. I may, or I may not, according to circumstances. At any rate I have now got my foot on the first rung of the Colonial ladder, and D.V. I intend to climb it. Whether I have done better than I should have done by first reading for the Bar I do not know: there is much to be said on both sides. The great thing is that I am now independent and shall, I hope, put you to no more expense or trouble, of both of which I am afraid I have given you too much already.\n This brings me to the subject of money. I am very sorry to see from your letter that I have overdrawn to the amount of 25 pounds. I must have miscalculated, as I was under the impression that sum made up the 200 pounds. I believe however that if you think it over you will not consider that I have been very extravagant. You always calculated that the 200 pounds would last two years, and it is nearly two years since I left England (if I remember right it was this very day two years ago that I decided to come to Natal). I have had to draw more lately, owing to the heavy expenses I have had to meet in connection with this Mission. Horses, arms and servants cannot be had for nothing, and I had to provide myself with all. If I get any pay for this business that will at all enable me to do so I hope that you will allow me to remit the 25 pounds. If not I fear I shall have to draw on you once more for 20 pounds in order to meet some debts which I must pay before the month is up in connection with the transhipping of my baggage to Cape Town and back, etc. I shall be very sorry to put you to that expense, my dear Father, but I trust that it will be the last time I shall ever have to do so. As to pay for this business, I live in hope. I rather fear that the Chief may consider that the fact of accepting service under this Government may cancel all past debts, but still I shall have a shot for it.\n June 5, 1877.\n My dear Father, — I thanked the Chief the other day for the appointment, and he told me that he hoped it would be a good deal better soon, but that he was not sufficiently firm in his seat yet to make big appointments.\n I don’t at all know how I am going to live here, and I fear that I shall be obliged to build a house. Mr. Osborn gave me a hint the other day that I should be welcome to a room in his house when he gets settled. He has not got a house yet: there are none to get. The probabilities are that I shall stay in this country for many years, so I shall have to build something sooner or later. It will be the cheapest way and by far the most comfortable. However I shall try to shift along for the present, live in a tent or something, until I hear about that money. I hope that it is not saddled with conditions [this refers to a legacy of 500 pounds which had been left to me many years before by a godparent. — H. R. H.]. The scarcity of money here is something extraordinary. Till within a month or two, the few who had any lent it on security often three times the value of the sum lent, at the rate of 15 per cent. per annum. The Annexation has had a wonderful effect. An “erf” or building side that would have sold for 40 pounds before is now valued at 130 pounds.\n Ever your most affectionate and dutiful son,\n H. Rider Haggard.\n To return to public affairs. Ten days after our arrival at Pretoria from Secocoeni’s country the Transvaal was annexed to the British Crown. Of the actual history of the events surrounding that annexation I purpose to say little, as I have already written a full and true account of it in my book, “Cetewayo and his White Neighbours.” On one point, however, I will touch.\n On the 11th April, the day before the Annexation, Shepstone sent a message to Cetewayo; I myself saw the messenger despatched. This message told the Zulu king of the rumours that had reached Pretoria as to his intention of attacking the Transvaal, and ordered him, if these were true — which they were — to disband his armies, as the Transvaal was about to become the Queen’s land. In due course came Cetewayo’s answer. It is given in “Cetewayo and his White Neighbours,” and I will quote only a few lines here.\n I thank my father Sompseu for his message. I am glad that he has sent it because the Dutch have tired me out and I intended to fight them once and once only and to drive them over the Vaal. Kabana [name of messenger], you see my impis [armies] are gathered. It was to fight the Dutch I called them together; now I will send them back to their homes.\n It is my firm and fixed belief that at this juncture no one except Shepstone could have prevented the Zulus from sweeping the Transvaal or, at any rate, from attempting to do so.\n The great day came at length. On April 12, 1877, at some time in the forenoon — I think it was about eleven o’clock — we, the members of the staff, marched down to the Market Square, where a crowd was assembled, Sir Theophilus remaining at the building which afterwards became Government House. I do not remember that our little escort of twenty-five Mounted Police were with us. They may have been, but I think it probable that they were left near the person of the Special Commissioner. That there was a possibility of trouble we all knew, for many threats had been made, but in that event twenty-five policemen would not have helped us much.\n Everything being arranged decently and in order, Osborn stepped forward and read the Proclamation, which was received with cheers by the crowd, that of course was largely composed of English folk or of those who were not unsympathetic. After this ceremony was completed the ex-President Burgers’ formal protest, of which the draft had already been submitted to the Commissioner and approved by him, was also read, and received respectfully but in silence. The text of these historical documents can be studied in the Blue-books of the day, if anybody ever reads an old Blue-book, so I will not dwell upon them here.\n I recall that after everything was over it became my duty to deliver copies of the Proclamation, and of another document under which Sir Theophilus assumed the office of Administrator of the new Government, at the various public offices. In front of one of these offices — I remember its situation but not which one of them it was — was gathered a crowd of sullen-looking Boers who showed no disposition to let me pass upon my business. I looked at them and they looked at me. I advanced, purposing to thrust my way between two of them, and as still they would not let me pass I trod upon the foot of one of them, half expecting to be shot as I did so, whereon the man drew back and let me go about my duty. It was insolent, I admit, and had I been an older man probably I should have withdrawn and left the Proclamation undelivered. But I do not think that the incident was without its effect, for it did not pass unobserved. I was but one young fellow facing a hostile crowd which had gathered in the remoter spaces of the square, but for the moment I was the representative of England, and I felt that if I recoiled before their muttered threats and oaths, inferences might be drawn. Therefore I went on. Whatever happened to me I was determined to deliver my Proclamation as I had been ordered to do, or to fail because I must.\n My colleague, Major Clarke, had to deal with the same difficulty, but on a much more heroic scale. The story as he told it to me afterwards is as follows. He was sent down to take command of the filibustering volunteers at Leydenburg. Arriving at the largest fort with only his Zulu servant, Lanky Boy, for an aide-decamp, he at once ordered the Republican flag to be hauled down and the Union Jack to be hoisted, which order, somewhat to his astonishment, was promptly obeyed. A day or two afterwards, however, the volunteers repented them of their surrender, and arrived in his tent to shoot him. Clarke fixed the eyeglass he always wore in his eye, looked at them steadfastly through it, waved his one arm and remarked in his rich Irish accent, “You are all drunk. Go away.” So they went.\n This Lanky Boy, a jolly, open-faced Kaffir, was a good stick to lean on at a pinch. Once two natives waylaid Clarke, but Lanky Boy killed them both and saved his life.\n After the Annexation things settled down rapidly, and when, some three weeks later, the 1st Battalion of the 13th Regiment marched into Pretoria with the band playing, it was extremely well received both there and all along the road. On May 24th, Queen Victoria’s birthday, the British flag was formally hoisted at Pretoria in the presence of a large gathering of English, Boers and natives. The band played “God save the Queen,” the artillery boomed a salute, and at midday precisely, amidst the cheers of the crowd, Colonel Brooke, R.E., and I ran up the flag to the head of the lofty staff. I think that Brooke lifted it from the ground and broke it and that I did the actual hoisting, but of these details I am not quite sure; it may have been the other way about. In view of what followed it ought to have stuck half-way, but it did not. It was a proud moment for me and for all of us, but could we have foreseen what was to happen in the future we should have felt less jubilant.\n In one of the newly discovered letters to my mother, written from Government House, Pretoria, on June 17, 1877, I find an allusion to this hoisting of the flag. I say:\n We have Sir A. Cunynghame, K.C.B., stopping with us now; he starts for Leydenburg next Friday for shooting. On the same day the Chief starts for Potchefstroom and Lichtenburg, and will be away about five weeks. Mr. Henderson, Chairman of the Finance Committee, will be left alone with myself here. It will be a melancholy reduction of our large party. We are now awaiting with great anxiety to hear how the Annexation has been received. I suppose that the war9 has drawn most of the attention from this business. It will be some years before people at home realise how great an act it has been, an act without parallel. I am very proud of having been connected with it. Twenty years hence it will be a great thing to have hoisted the Union Jack over the Transvaal for the first time.\n My absence, which I remember we set down at five years at the most, is likely to be a long one now, my dearest Mother. The break from all home and family ties and the sense of isolation are very painful, more painful than those who have never tried them know.\n \n \n","sourceLink":"http://novel.tingroom.com/mingren/715/559.html","bookId":146,"book":{"id":146,"title":"The Days of My Life","description":"简介： Henry Rider Haggard was born on June 22, 1856, and died on May 14, 1925. The present work covers the first fifty-six years of his life, commencing with his earliest recollections and ending on September 25, 1912. On that day he wrote to me:...","cover":"http://novel.tingroom.com/uploads/121224/1-121224111250L6.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/715","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
