{"id":100149,"no":11,"title":"Page 11","content":"\"Wake up.\" The whisper, accompanied by a repeated tapping on his shoulder, sounded harsh, urgent, in Gary\u0027s ear. The young man was well settled into a wonderful dream, of a walk through beautiful Tir na n\u0027Og with Diane beside him, of bringing some of his other friends to Faerie and letting them see this different side of Gary Leger, this heroic side. \"Wake up!\" This time the call was accentuated by a finger snapping against Gary\u0027s cheek. He opened his eyes, saw that it was Gerbil standing in the dim light beside him. The gnome appeared anxious, but Gary couldn\u0027t figure out what might be wrong. The room was perfectly quiet, and the night outside the open window was dark, no moon this night, and still.\n Gary stretched his shoulders; the room had only one bed, claimed by Geno (though Gary couldn\u0027t figure out why, since the dwarf had flipped it over so that he could sleep across the hard slats), and Gary had fallen asleep sitting on the floor with his back against a wall. His accompanying yawn was too loud for poor Gerbil\u0027s sensibilities, and the gnome slapped a hand across Gary\u0027s open mouth.\n Gary pushed him away. \"What?\" he demanded in a soft, but firm, whisper. Gerbil looked nervously to the door. \"We have been discovered, it just very well might be,\" the gnome replied.\n Gary sat up straighter and rubbed the sleep from his eyes as Gerbil climbed up on a chair and dared to light a single candle sitting in a tray on the room\u0027s small desk. Only then, in the quiet light, did Gary realize that Geno was no longer in the room.\n They heard a commotion in the hall, a scuffling noise followed by several bumps, and looked to each other curiously. Gerbil hopped down from the chair and padded over to the door, glancing back at Gary, and then taking a tentative hold on the high knob. The door burst open; poor Gerbil came right off the floor, hanging onto the knob with his little feet kicking as he and the door swung about. \"The window!\" Geno cried, rushing into the room. The dwarf skidded to a stop and spun about, hammer swiping low. Gary winced at the resounding crack as the weapon connected on the kneecap of the man pursuing the dwarf. He howled and pitched headlong, grabbing at his crushed joint. \"Window!\" Geno cried again, and he grabbed Gerbil\u0027s freely waving hand and pulled the gnome from his doorknob perch. Gerbil\u0027s other hand immediately tugged a bottle from his belt. He brought it up to his mouth, bit off the end, and splashed its contents all over himself.\n \"Get me there!\" he bade the dwarf, and Geno was already thinking along those very lines. With a single, powerful arm, the dwarf twirled the seventy-pound gnome about his head once and then again, and hurled Gerbil across the room.\n Gary blinked in disbelief at the gnome\u0027s flight. Gerbil started fast, but soon lost momentum and seemed as though he would crash to the floor. He continued to float, though, turning several perfect somersaults and winding up in a straight-armed, slow-motion dive that slipped him through the open window without a scratch against the wooden frame.\n Geno turned back to the hall, facing four more dirk-wielding opponents - the same four men Gary had seen earlier in the tavern.\n \"Window!\" the dwarf shouted to Gary. Gary looked that way, then looked back to Geno curiously, surprised by the dwarf\u0027s uncharacteristic altruism. Geno was under no debt to protect Gary, or even to accompany them at all on this journey. And yet, here he was, fighting furiously, telling Gary to run off while he held the enemy at bay.\n Gary began to understand, then, the urgency of it all, the apparently desperate situation that Faerie had been placed in with the return of the dreaded dragon. But he would not run away from the dwarf, he decided. For perhaps the first time in his life (no, the second, he realized, counting his first trip to Faerie), Gary Leger felt as though he was part of something bigger than himself, something more important than his own life. He would go to Geno\u0027s side, use fists if need be against the daggers.\n \"Waiting . . . the window.\"\n The silent call came into Gary\u0027s mind, a voice he recognized clearly. How it had gotten there, he didn\u0027t know, but the spear of Cedric Donigarten was leaning above the rosebushes under his room\u0027s window, waiting for him to retrieve it.\n Geno cut a wide swath in front of him with his heavy-headed hammer, but came nowhere near to hitting the three agile men who had fanned out before him. Daggers thrust in behind the flying weapon, but the dwarf reversed his grip quickly and started with a reverse backhanded cut that forced the men to hop back once more.\n This time, though, Geno did not hold onto the hammer. It spun from his grasp, slamming one man in the chest and knocking his breath from his lungs. He staggered backwards, slamming into the door and then tripped to the floor, dazed.\n A companion, seeing the dwarf\u0027s weapon fly, snarled and thrust ahead more forcefully, but quicker than he anticipated, Geno pulled another hammer from his belt and snapped it across, slamming the man\u0027s fingers.\n The dagger, stained with the blood of the dwarf, fell to the floor. Geno had only been scratched, but when the newest of the wounded men fell away, the dwarf found the fourth of the party waiting for him, daggers in each of his hands, cocked back over his head.\n Geno went into a frenzy, started to charge, but got hit by the other man standing near to him. The dwarf blocked one of the daggers, but the other dug into his thigh. He shot a death-promising glance towards the thrower, only to see that the man had two more daggers up and ready.\n Geno fell to the side, threw his hammer up before him, and somehow managed to escape the deadly throws. He was vulnerable, though, offbalance and with the remaining uninjured man, the man who had gotten back up from the floor near to the door, and the man with the broken fingers, coming back in at him.\n The huge black tip of an enormous spear slashed the air between the combatants, forcing the three men to fall back. In stepped Gary Leger, grim-faced, whipping his powerful weapon about furiously, using its length so that the men, with their much shorter weapons, could not get anywhere near him or Geno.\n \"Window!\" the young hero cried to his dwarfish companion.\n A fifth man staggered through the crowd unexpectedly; Gary had to pull back on his cut to avoid disemboweling him. It didn\u0027t matter anyway, for the man looked at Gary plaintively, then fell to the floor, an elfish arrow protruding from his back, just under the shoulder blade, and through, Gary realized, the back of the dying man\u0027s heart.\n Gary\u0027s stomach did a flip-flop, but he determinedly swallowed the bile and continued his defensive frenzy.\n Geno patted him on the hip and was off and running, pounding across the room while issuing a long scream, then leaping headlong out the window and into the night.\n Gary heard Pwyll shriek from outside and figured that the dwarfish missile hadn\u0027t missed the fat Baron by far.\n \"Up!\" The sentient spear\u0027s warning came in time for Gary to snap the tip upward and knock aside a flying dagger. Instinctively, Gary came back the other way, covering his exposed flank, and he grimaced in anger as his spear cut deeply into an opportunistic enemy\u0027s side. Down the man went, screaming in agony, and Gary yelled, too, if only to block out the man\u0027s cries.\n \"No!\" Gary growled as he noticed again the man Kelsey had shot, now lying perfectly still in the unmistakable quiet of death. Gary\u0027s denial was useless, helpless, and realizing that, the young man buried his own frailties under a curtain of sheer rage.\n Now the spear came flashing across with renewed fury, Gary driving the remaining men backwards. He stopped a cut in midswing and gave a short thrust that forced the closest of the group to suck in his gut and hop up onto his toes, falling backwards a moment later and tangling with his companions.\n Gary turned and ran for the window. He smiled in spite of his revulsion, conjuring an image common to old Errol Flynn movies. As he came towards the window, Gary dipped the tip of his spear, thinking to fancifully pole-vault his swashbuckling way outside.\n His calculations weren\u0027t quite correct, though, for the enchanted spear\u0027s tip sliced right through the flooring, shifting Gary\u0027s angle and stealing his momentum. He came up in the air, up even with the vertical shaft, then went nowhere but down, to one knee on the floor just beyond the stuck weapon. He saw his enemies regrouping back by the door, and they saw him, and quickly came to understand his dilemma.\n Gary pulled hard on the spear, bending the metal shaft his way, but making no progress in freeing it. He thought of fleeing, of diving out the window, but he couldn\u0027t leave the spear behind - not to these men, who were obviously working for Prince Geldion.\n But still, what choice did Gary have? Three of the cruel men charged at him, verily drooling at the thought of such an easy kill, and a fourth hopped on his one good leg behind the pack. Gary tugged hard until the very last moment, then cried out and let go.\n The bent shaft sprang back the other way with tremendous force. The nearest enemy lifted a forearm in front of himself defensively, then howled as his bone snapped apart, jagged edges of it cutting out through the skin right before his disbelieving eyes. He flew away, into a companion, and both of them tumbled backwards, tripping up the man with the shattered kneecap.\n Gary could hardly believe his luck, went desperately for the spear as the remaining man came in around the quivering weapon. Gary almost reached his spear, but then he fell back, thinking that he had been punched in the side.\n Wide did Gary Leger\u0027s eyes go when he looked down to see not a fist, but a dagger, above his hip, to see his blood gushing out through torn skin. I\u0027ve been stabbed! The thought rocketed through Gary\u0027s mind, horrified him and confused him, for he honestly still felt as if he had only been punched; the pain was dull and not too intense. Still, the image was more than Gary could rationally take, and he didn\u0027t think of his actions, didn\u0027t hear the primal cry of sheer survival instincts escape his lips. His opponent was well balanced, crouching with the bloodied dagger held ready. He got the weapon up to block Gary\u0027s furious left hook, but Gary didn\u0027t even wince as his hand and arm scraped across the blade, continuing on to slam the man in the face. A right cross followed, coming in under the surprised man\u0027s rolled shoulder, finding an open path to the man\u0027s chin.\n The next left hook met no resistance at all until it smashed the man\u0027s cheek, whipped his head across the other way.\n This was pure street-fighting, not delicate boxing, and wild Gary didn\u0027t look, didn\u0027t aim, as he continued to swing, left and right, left and right. His own yelling prevented him from hearing the solid smacks, or the cracking bones in knuckles and cheeks alike.\n The man fell away, but Gary kept swinging, four more punches flying freely through the empty air before he even realized that he had knocked his opponent down. He regained his composure then, and saw the man on the floor, trying to crawl, trying to get up, apparently trying to remember where and who he was. He managed to get to his hands and knees, and Gary started to kick at him, but he rolled over to his side of his own accord, lay still and groaned.\n Gary put a hand to his side, wincing as he brought it up and regarded the generous amount of blood. It had all happened in mere seconds - the other three in the pile hadn\u0027t even sorted themselves out yet. Gary dove for the spear, grabbed its shaft in both his aching hands, and heaved with all his might.\n The back-and-forth action of the weapon had loosened the floor\u0027s hold on it, and it came out more easily than Gary anticipated. Spear in hand, he stumbled backwards, pitched head over heels in a backward somersault out the open window, his toes smashing glass and snapping the bottom wood on the window frame, and fell heavily into the thorny rosebush.\n \"Dammit!\" he groaned and he looked up from his natural prison to see an enemy come to the window - and then go flying away with a hammer tucked neatly into his face.\n \"About time ye\u0027re getting here, lad,\" Gary heard Mickey say. He tried to turn his head about to regard the leprechaun, but a thorny strand tugging painfully against his neck changed his mind.\n Baron Pwyll and Gerbil were at his side in an instant, pulling him free, while Geno lined up the window with another readied hammer.\n \"Hurry, then,\" Mickey implored them. \"We\u0027re to meet Kelsey down the south road, and the elf\u0027s not in any mood for us being late!\" Behind the leprechaun, the two horses and the pony whinnied nervously, but did not scatter. One of the horses, Gary\u0027s, had a large sack strapped over its back, bulging with the metal plates of Donigarten\u0027s armor.\n They finally got Gary untangled - Geno heaved another hammer into the room to turn away the two men stubbornly continuing the pursuit - and went for the horses. Pwyll hoisted Gerbil, who didn\u0027t seem thrilled at the prospect of riding so tall a beast, up to his mount, but before the little gnome had even swung his leg over, he pointed down the road and whispered, \"Trouble, oh, yes.\"\n \"Oh, yes,\" Gary echoed when he looked that way. Half a dozen riders lined the road a short distance from the tavern, regarding the friends and seeming almost amused by it all. One of the men wore full metal plating, like the armor of Donigarten, and carried a long lance tipped by a pennant bearing the standard of the lion and the clover, the emblem of Connacht. On his back was strapped a huge sword, one that Mickey and Baron Pwyll had seen before.\n \"Yield or be killed!\" the knight declared.\n \"Five on six,\" Geno muttered mischievously. \"Even up, if the damned elf would get here.\"\n \"I\u0027m thinking that Kelsey\u0027s got his hands full of fighting already,\" said Mickey.\n \"Oh, well,\" replied the dwarf without the slightest hesitation. \"Then Kelsey will miss all the fun.\"\n \"Not so quick,\" Mickey whispered back, sitting easily in his place in front of Gary\u0027s saddle. \"I\u0027m knowing that knight, and knowing that he didn\u0027t have the armor when he rode into town, not so long ago.\"\n \"So?\" Geno\u0027s question reflected no doubts and no fears.\n \"He\u0027s got friends in town,\" Mickey reasoned. \"More than we\u0027ve seen, don\u0027t ye doubt.\"\n \"Archers in the hedge,\" Gary whispered, nodding to his right, and even as he spoke, they heard several voices from men congregating in the room behind them.\n Baron Pwyll groaned.\n \"You got anything to trick them?\" Gary asked Mickey.\n The leprechaun shrugged. \"Me magic\u0027s not so good,\" he answered honestly. \"And the knight\u0027d see through it, if none o\u0027 the others would.\"\n It seemed to Gary as if they had few options other than the demanded surrender. But to do so would surely doom Baron Pwyll, and in looking at the precious spear he carried, Gary realized that the cost might be much higher than that.\n \"Yield or feel the tip of my lance!\" the knight bellowed. \"I have no time and no patience for your delay!\" Gary recalled all that he could about chivalry and codes of behavior, knew that this man was driven by a sense of honor, warped though it might be. Gary\u0027s smile widened; what his friends needed was a distraction. He hoisted Mickey from the horse and set him down on the ground.\n \"Get up with Geno,\" he explained quietly. \"You\u0027ll know when to ride.\" \"What\u0027re ye thinking?\" Mickey demanded, sounding not too pleased. Gary was already climbing up to his seat, and paying the leprechaun little heed.\n \"My friends will yield,\" Gary called to the knight.\n \"When gnomes fly,\" Geno growled, but Gerbil threw him a reminding smirk to defeat that protest.\n \"If you can defeat me in a challenge of honor,\" Gary finished. He couldn\u0027t see the knight\u0027s face for the faceplate, but he imagined a wide smile curling up under that metal.\n \"My dear Gary Leger of Bretaigne,\" the knight began, chuckling with every word and slowly lifting the grilled faceplate up onto his head. \u0027These guys don\u0027t miss a thing,\" Gary, surprised at being so easily recognized, whispered to Mickey.\n \"You have been blinded by your pride,\" the knight continued. \"For have you forgotten that you wear no armor?\" His comrades broke into laughter - too loudly, Gary noted, and that told him just how much they respected this knight. One of the men, though, trotted his horse up beside the knight and whispered something in his ear that the armored man apparently did not like.\n \"I remember!\" the knight roared, and he slapped the man away.\n \u0027They want him alive,\" Gary heard Mickey remark to Geno. The leprechaun continued to whisper to the dwarf, but Gary could only make out the name \"Ceridwen\" in the ensuing moments.\n \"What\u0027s the knight\u0027s name?\" Gary mumbled over his shoulder.\n Mickey directed Gary\u0027s gaze to Baron Pwyll.\n \"I don\u0027t know his proper name,\" the Baron said. \"But he is called by Redarm.\"\n \"Have I forgotten?\" Gary balked incredulously to the knight. He held the spear of Cedric Donigarten up high. \"Good Redarm, have you forgotten that my spear will cut through your feeble armor more easily than your lance will pierce my skin?\"\n \"My thanks, young sprout,\" came a call in Gary\u0027s head.\n The laughter down the road stopped abruptly.\n \"Don\u0027t mention it,\" Gary whispered to the sentient weapon.\n \"Laddie,\" Mickey warned.\n \"Are these horses as fast as Kelsey says?\" Gary asked.\n \"Faster,\" answered the leprechaun.\n \"Then get ready to prove it,\" Gary whispered. \"These guys, the archers, too, and especially Redarm, are going to be more interested in the joust than in you.\"\n \"Laddie,\" Mickey said again as the dwarf verily tossed the leprechaun atop the pony. Both Geno and Mickey understood what Gary Leger had in mind.\n \"Laddie,\" Mickey muttered again, not so sure that he liked the decision. \"Have a good ride to the netherworld,\" Geno said evenly to Gary, cutting Mickey\u0027s concerns short. \"Though I hate to lose the spear.\"\n \"Hey, Geno,\" Gary replied, smiling as wickedly as was the dwarf. \"Suck pond water.\" \"Thanks,\" the dwarf answered. \"I have, many a time. Nothing like it after a hot day at the forge.\"\n Gary unstrapped the sack of armor and handed it over to Pwyll, who nearly fell from his horse as he tried to secure it. \"By the way,\" Gary asked the dwarf, needing to know before he went for his apparently suicidal ride, \"how did you throw the gnome so far?\"\n Gerbil started to answer, \"Earth-pull reversal ...\"\n \"Never mind.\" Gary cut him off, holding his hand up high and shaking his head.\n \"I am waiting, Gary Leger of Bretaigne!\" growled Redarm, seeming larger and more ominous as his huge horse plodded out away from the other. \"We\u0027re all to die,\" muttered Pwyll.\n Gary ignored the gloomy Baron and trotted his mount out from the group. He looked to Redarm, to the road and fields around the man, and knew that his was a desperate choice. Perhaps Baron Pwyll was correct, at least as far as Gary was concerned, but even so, the young man would not despair. He felt again like something larger than himself, like a part of a bigger whole, and if he died allowing his friends to escape, then so be it. Gary paused as he fully contemplated those thoughts; never once in his own world had he felt this way.\n Gary lowered the mighty spear.\n \"If I win, then my friends are allowed to ride free,\" Gary declared. \"As you wish,\" Redarm replied exuberantly, and Gary knew that cocky knight didn\u0027t mean a word of it - not that Redarm expected Gary to win anyway.\n It was, perhaps, the hardest thing that Gary Leger had ever done, something that went against his very instinct for survival. But he gritted his teeth and kicked his horse into motion, commanding the bells to \"Ring!\" and charging off down the road. The thunder of hooves doubled as Redarm similarly charged, that long and deadly lance dipped unerringly Gary\u0027s way.\n Gary moved to the left side of the road, opposite the archers, held the spear across his body with his left hand, and clutched the bridle tightly with his right. Only with the bouncing of the charge did the young man realize how severe the wound in his side might be, and his battered knuckles ached so badly that he feared he would simply drop his weapon. He squinted against the sudden sharp pains, kept his focus straight ahead.\n \"Oh, valiant sprout!\" came the spear\u0027s cry in his head, a cry that showed the spear to be thrilled to be in a joust once more.\n \"Oh, shut up,\" frightened Gary growled back through a grimace, working as hard as he could to hold his balance while keeping the spear out in some semblance of an attack posture.\n The combatants closed, weapons leveled (though Gary\u0027s spear had begun to dip), elfish bells ringing and horses snorting for the exertion. In Gary charged, grim-faced, roaring in rage and pain.\n And then he veered, at the last moment, away from the knight, turned his horse to the side of the road and charged off into the darkness.\n \"Young sprout!\" came a cry of telepathic protest.\n \"Shut up!\" Gary yelled back.\n It took Redarm several moments to understand what had just happened in the pass. \"Treachery!\" he roared, in the direction of the diminishing sound of elfish bells. \"Coward! Kill him! Kill them all!\" The infuriated knight looked back towards the tavern wall, to the dissipating illusion of a horse and a pony where Gary\u0027s friends had been.\n The surprised archers put a few wild shots the way Gary had fled, then came out of the bushes, scratching their heads.\n The wind in Gary\u0027s face, the wind of freedom, almost erased the continuing pain in his side. He had outsmarted the enemies, used their strict adherence to codes against them, knowing that they would believe that he would not avoid a challenge of honor. But Gary would not confuse honor with stupidity. He had no armor on, hadn\u0027t even a shield to turn aside Redarm\u0027s deadly lance.\n He heard one arrow cut the air not so far away, but was more concerned with the sound of hooves as his enemies took up the chase. He bent low in the saddle, told the bells to stop ringing, and trusted in his steed. Kelsey had not lied; the sound of pursuit fast faded behind Gary as he flew on across the rolling fields. He heard the distant ringing of similar elfish bells and took it to be a signal from his friends. His mount apparently thought so, too, for the horse veered and snorted and took control of the ride from Gary. A few moments later, Gary saw a dark line up ahead, a stone wall probably. Whether he held doubts or not did not seem to matter to the horse, for the beast picked up its pace and did not turn to the side.\n Equestrian jumping looked so easy on television. And indeed, the mount of Tir na n\u0027Og easily flew over the low wall, clearing it on the far side by more than a dozen feet.\n They had to land, though, and Gary Leger immediately gained tenfold respect for the straight-backed riders he had watched in equestrian competitions. He jerked forward, almost flying over, as the horse\u0027s forelegs slammed down, then went straight down, though of course he could not go straight down, when the horse came fully to the field.\n His breath long gone, Gary thought that he should reach up and feel his throat to see just how high his testicles had bounced.\n He was still leaning when he caught up to the others, Kelsey included, his horse trotting in beside Baron Pwyll\u0027s mount.\n \"Well done!\" shouted the sincerely relieved Baron, and he clapped Gary hard on the shoulder. The dazed and wounded Gary would have fallen right off the other side of his horse, except that Geno was there to catch him and toss him roughly the other way.\n The others watched in confusion as Gary struggled to gain an unsteady seat on his mount. \"I think I need some help,\" the young man explained, and this time he did fall, between his horse and Pwyll\u0027s, the blood running freely from the knife cut in his side. \n","sourceLink":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2/page-11.html","bookId":2185,"book":{"id":2185,"title":"The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2)","description":"Storyline: \n The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2) \n The sequel to The Woods Out Back. The realm of Faerie is a beautiful and peaceful land--or at least it used to be. The enchanted world hidden behind Gary\u0027s house is threatened, and in his struggle to save Faerie, Gary must conquer a wicked king, a banished witch, and an angry dragon.\n \n","cover":"https://allnovel.net/images/the-dragon-s-dagger-spearwielder-s-tale-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:59 PM"}}
