{"id":100157,"no":19,"title":"Page 19","content":"Even the hardy mounts of Tir na n\u0027Og nickered and whinnied and flipped their heads side to side, shying away as the group approached the dark and tangled forest. Dreadwood started abruptly, a thick clump of trees in the middle of the plain between the mountains of Penllyn on the south and the rolling Crahgs on the north. Kelsey took them near to the Crahgs, the narrowest expanse of the forest, but still the wood seemed dark and wide to Gary Leger.\\n\\n He had spent many days of his youth in the woods, even .after sunset, with no fears beyond the very real possibilities of mosquito bites or of inadvertently stepping on a bees\u0027 nest. Now, though, as his horse approached the tangle, a feeling of dread rose up within Gary, a feeling that there was more evil within this place than biting bugs.\\n\\n Already he knew that whoever had named this forest had named it right. It didn\u0027t seem possible to Gary that they would even find a path through the forest. The twisted trees seemed a solid wall, gnarled and writhing, a living barrier that would not permit visitors.\\n\\n Kelsey held up his hand for the others to stop, and sat atop his horse, eyeing the wood suspiciously. He motioned to the side, and the whole troupe shifted.\\n\\n \"There is a road,\" Mickey remarked to Gary, and to Gerbil, who seemed nervous about the possibility of getting his quadricycle through. \"The trees just aren\u0027t wanting to show it to us.\"\\n\\n Again Kelsey motioned, back the other way, and the group followed accordingly. They reversed direction again, several more times, Kelsey studying the trees, looking for hints of the path.\\n\\n \"None better at spotting illusions than the Tylwyth Teg,\" Mickey said quietly, trying to keep his less informed friends patient and comfortable.\\n\\n Finally, Kelsey sat up straight on his mount and sighed deeply. He gave a look Mickey\u0027s way that seemed to say that he was pretty sure of the path, but also that it was only a guess. He reached down to the back of the saddle and drew an arrow out of his quiver, examining the fletch-ings. Apparently not finding something he needed, he shook his head and replaced it, drawing out another.\\n\\n After a similar examination, Kelsey put his mouth against this arrow\u0027s tip, whispering to it as though it could hear. He then produced a length of cord, fine and silvery as a spider\u0027s web, from his saddlebags, and threaded it through a tiny hole near to the arrow\u0027s fletchings. Then Kelsey fitted the arrow to his bow and lifted it towards the forest, closing his golden eyes.\\n\\n Again he whispered - some sort of an enchantment, it seemed to Gary - and he moved the bow slowly, first to the right, then back to the left. Seemingly at random, the elf let fly, and the arrow cut through the air, making for a huge elm. It didn\u0027t hit the tree, though, and Gary had to blink, thinking his vision had deceived him.\\n\\n The fine cord continued to unwind for some time, Kelsey holding its other end and nodding Mickey\u0027s way. At last, it went slack and the elf slipped down from his saddle and took it up, walking his mount as he collected the cord.\\n\\n \"What just happened?\" Gary had to ask.\\n\\n \"Arrows o\u0027 the Tylwyth Teg have a way of finding their way around the trees,\" Mickey explained with a sly wink. \"They\u0027ll not hit a living thing if telled not to by their makers.\"\\n\\n They were near the forest by then, near the living, seemingly impenetrable wall, when Gary, to his surprise, noticed a break in the trees, wide enough even for Gerbil\u0027s quadricycle to pass through. Why hadn\u0027t he seen that from the field? he wondered, and he shrugged his amazement away, reasoning that Kelsey\u0027s arrow magic had countered the forest\u0027s own magic.\\n\\n No matter how many times he returned, or how long he stayed, Gary Leger knew that he would ever remain a stranger to the land of Faerie.\\n\\n Kelsey disappeared into the dark forest, the shadows swallowing him as soon as he crossed the threshold. Right behind the elf, Geno\u0027s pony shied away, but the dwarf grunted angrily and with a single powerful tug put the beast back in line and kept it moving.\\n\\n Gerbil went next, his quadricycle bumping up one way and then the other as he passed over the nearest tree roots, and Gary came last, eyes determinedly straight ahead. It seemed to the young man as if he had walked into the night. Rationally, he knew that he was no more than a few feet from the entrance, the sky outside sunny and clear, but when he looked back, he saw a distinct hole of only dim light, as though the sun itself feared to peek into Dreadwood.\\n\\n \"Easy,\" Mickey coaxed, to the horse and to Gary. \"Easy.\"\\n\\n \"Some light, leprechaun,\" Kelsey called back as he retrieved his arrow, sticking at an angle from the forest path, and climbed into his saddle. Mickey gave a grunting response - it sounded more like a groan to Gary - and began a long chant, which seemed strange to Gary, since on his last visit to Faerie he had seen the leprechaun merely snap his fingers to produce globes of glowing light.\\n\\n Finally, Mickey did snap his fingers and a tiny ball, barely a candle\u0027s flicker, appeared atop them, hovering in the air and weaving wildly back and forth as though it would soon go out.\\n\\n Then it diminished even more and Mickey shrugged helplessly. \"Me magic\u0027s not so good against the weight of Dreadwood,\" he explained.\\n\\n Kelsey, who had just put an arrow through the trees\u0027 illusion, eyed the leprechaun suspiciously, and Gary understood the elf\u0027s obvious doubts. Something was wrong with Mickey, with Mickey\u0027s magic at least, for the leprechaun\u0027s bag of tricks had been far less helpful this time around than on Gary\u0027s first trip through the enchanted land. Gary remembered his first encounter with the sprite, when Mickey had tricked him repeatedly, when Mickey had him plucking giant mushrooms out of the ground, commanding them to take him to their pot of gold. Most of all, Gary remembered Mickey\u0027s cocky swagger, the leprechaun\u0027s sincere belief that tricking a human, or a monster, was a matter of course and nothing to get overly concerned about.\\n\\n Where had the leprechaun\u0027s confidence, and his magic, gone to? Gary wondered, and his look Mickey\u0027s way reflected his confusion.\\n\\n Mickey only shrugged and brought the brim of his tam-o\u0027-shanter low over his eyes, as deep an explanation as Gary or any of the others was going to get. The little faerie light winked out altogether a moment later, and with the dim portal fast fading behind them the friends soon found themselves fully engulfed by the gloom.\\n\\n In truth, the road inside the forest was flat and clear, and wide enough so that Gary could walk his horse beside the gnome\u0027s rolling contraption. Gary\u0027s eyes soon adjusted to the darkness, and he found that it was not so bad. Some sunlight did make its way through the leafy boughs, diminishing as it wove down to Gary\u0027s level, but enough so that he could distinguish general shapes around him, could see Kelsey and Geno, leading the way on their mounts. On the road beside him, Gerbil was at work again, fumbling with some items too small for Gary to make out, and absently pumping his little legs, his quadricycle easily pacing the horses. Gary realized that, though he and Gerbil had been traveling companions for several days now, he hadn\u0027t really gotten to know the gnome. He noticed Mickey, resting easily against his horse\u0027s neck, hat still low, long-stemmed pipe in his mouth, and little legs crossed at the knee, and realized that he wasn\u0027t going to find much company there. \"What are you making?\" Gary asked the gnome.\\n\\n \"Light,\" came the polite, if short, answer.\\n\\n Gary nodded, but then screwed up his face. \"You\u0027re making light?\" he asked. \"You mean, you\u0027re going to light a torch?\"\\n\\n \"Torches are for dwarfs and elfs, and the human folk,\" Gerbil replied, again pointedly not elaborating. \"Even for goblins, I suppose.\"\\n\\n Gary considered the condescending tone for a few moments. \"How do gnomes make light?\" he politely asked.\\n\\n \"Potions.\"\\n\\n Now Gary was intrigued, but he understood that the typically talkative gnome obviously didn\u0027t want to be bothered at that moment. He continued to walk his horse even with the quadricycle, watching Gerbil\u0027s every move. Soon the gnome had a pole erected in the front section of the contraption, its top a tube, rotating end around end in tune with the turning of the pedals. Gerbil had a funnel between his working knees, its narrow end connected to the bottom of the tube, and in his hands he held two beakers.\\n\\n \"Potions?\" Gary asked.\\n\\n \"Ssssh!\" the gnome hissed.\\n\\n \"Ye take a chance on blowin\u0027 yerself up if ye distract a workin\u0027 gnome,\" Mickey quietly added, and Gary went silent, having no doubts of Mickey\u0027s claims and having no desire to blow himself up. He watched curiously as Gerbil poured specific amounts of each potion into the funnel. A moment later, a glow came from the turning tube atop the pole, intensifying with each rotation.\\n\\n Kelsey and Geno both looked back curiously, and neither seemed pleased. \"Ye\u0027re makin\u0027 yerself into a target,\" Mickey remarked to the gnome. \"I cannot work in the dark, of course!\" the flustered gnome shot back. A bit more of the contents of one beaker went into the funnel, and the light brightened accordingly.\\n\\n \"Suit yerself,\" was Mickey\u0027s casual reply.\\n\\n Gary sat mystified. He had seen rings that used chemical reaction to produce light, but he hardly expected to find such a process utilized in this enchanted place. He was about to question Gerbil, and to congratulate him for his fine light, but then a tree branch reached down suddenly and plucked the gnome from his seat, lifting him up, kicking and squealing, into the dark boughs.\\n\\n Gary tried to call out, but found his voice stuck in his throat. He lunged over to grab at Gerbil as the gnome shot by, was overbalanced to the side when another branch swung down the other way, bashing him in the shoulder and sending him flying from the saddle to crash halfway over the side of the quadricycle. Gary turned back in time to see the same branch, a foot thick, slam straight down on the back of his horse, narrowly missing the purposely falling leprechaun. Gary heard a tremendous cracking sound as the poor horse\u0027s legs buckled, and the beast went right down to the ground.\\n\\n A hammer spun through the air, whacking off of the low branch, but doing no real damage. It was soon followed by a flying dwarf as Geno leaped from his mount, wrapping his powerful arms about the limb of the attacking tree. With a growl, the dwarf bit hard into the branch, tearing off a large piece of bark.\\n\\n Kelsey was already up the boughs, scampering along writhing branches to get near to the caught Gerbil. Smaller branches whipped at the elf as he passed and his sword flashed, often dropping pieces of tree free to the ground.\\n\\n \"Get up!\" came the call in Gary\u0027s thoughts, and he was already on his way. He fumbled to get his helmet straightened, then searched out the spear and hoisted it in eager hands.\\n\\n But where to hit a tree?\\n\\n Geno spat out another hunk of branch above him; Kelsey had reached Gerbil and was hacking mightily at the entrapping branch, but hadn\u0027t yet begun to free the gnome.\\n\\n Gary roared and went for the trunk, driving the spear straight ahead, its tip plunging through the hard wood. The tree went into a shaking frenzy, and poor Gerbil whined in pain.\\n\\n Gary turned and readied the spear for a throw, thinking to sink it into the branch holding the gnome, thinking that Gerbil would surely be squashed before too much longer. Another branch swung about first, though, slamming Gary\u0027s armored back and launching him through the air, where he landed, again, half across the quadricycle.\\n\\n \"Are ye all right, lad?\" asked Mickey, sitting low in the contraption\u0027s seat.\\n\\n \"I\u0027ve been better,\" Gary replied, forcing himself back up to his knees. He heard a crack above him and had to shift aside as Geno and his branch came tumbling down, the wild dwarf having bitten clear through the limb. \"Not half bad!\" Geno proclaimed, quickly biting off another chunk. And off he ran, leaping straight into the trunk, throwing a hug about it and chomping away with dwarfish ferocity.\\n\\n The branch hit Gary again, but not so hard, since the tree then seemed to focus on the dangerous dwarf. An instant later, back to his knees yet again, Gary understood the effectiveness of the dwarf\u0027s tactics, for the tree could not easily get at Geno when he was in so close.\\n\\n And Gary was glad for Geno\u0027s efforts, because, for the moment at least, he had been left alone. He immediately looked above him, to the squirming gnome and the battling elf, and knew that he had to react.\\n\\n Don\u0027t miss, he thought, to which the spear gave an indignant reply, as though it had been insulted.\\n\\n \"I\u0027m talking to myself!\" Gary explained gruffly, and he let fly.\\n\\n The spear cracked into the branch just a foot away from the gnome, nearly splitting the limb down the middle. Another great tug from Kelsey pulled the gasping Gerbil free, and then the elf and the gnome simply hung on as the branch cracked apart, dropping the spear straight back to the ground and sending its passengers on a wild swing that ended in a free-fall into a thick bush far to the side of the path.\\n\\n Gary grabbed up the spear, nearly chuckled aloud when he regarded the dwarf, seeming a wild cross between a famished beaver and a lumberjack. Then he fell flat to the ground in terror and shock when all the thick canopy above him erupted suddenly in flames.\\n\\n Horses whinnied and fled, wood crackled and burst apart. At first, Gary thought that Mickey had pulled off a clever illusion, but when he took a moment to think about it, it made no practical sense. How do you visually fool a tree? Besides, Gary realized as flaming brands began to fall all about him, as the air began to burn his lungs and sting his eyes, this was no trick. He knew he had to run. He got up as high as he could and felt a tug on his arm that put him over the side of the quadricycle for the third time. Mickey sat low in the seat, looking horrified and helpless. \"Suren it\u0027s the dragon!\" he called out, beckoning Gary to get in beside him.\\n\\n A tree not so far away exploded from the heat; Gary heard a horse shriek in agony and knew that the thing had been engulfed. He couldn\u0027t see Geno, or Kelsey and Ger-bil, had no idea at that confusing moment if the others were dead or running. And every second that slipped past put Gary\u0027s own escape into deeper jeopardy.\\n\\n He scrambled in beside Mickey and found, to his relief, that the clever gnomes had put a notched and sliding adjusting bar on the seat (though even sliding it all the way back did not allow Gary to straighten his legs). Gary gave a scream as a branch fell into his face, and batted the thing away, then kicked hard with one foot, hoping just to start the quadricycle moving on such rough and uneven ground. To Gary\u0027s amazement, the contraption leaped away. He didn\u0027t know ^whether incredible gearing, or magical potions, enhanced the ride, but merely a few pumps later, he was flying free of the fiery zone, rushing down the wide path.\\n\\n \"Ride on!\" the leprechaun commanded when Gary slowed and looked back to find his friends.\\n\\n \"We can\u0027t leave them!\" Gary retorted, surprised by Mickey\u0027s callous attitude.\\n\\n \"Go!\" came a call from back down the trail. Gary looked to see Kelsey emerging from the blazing region, waving him away.\\n\\n \"The dragon is on to us,\" Mickey explained. \"Our only chance is to separate and lead him in two different directions at once.\"\\n\\n As if on cue, Gary heard a whoosh of air from the canopy over his head, looked up to see a huge shadow cross above him.\\n\\n \"Ride on, for all our lives, lad!\" Mickey implored him, and Gary put his head down and pedaled with all his strength, sending the quadricycle careening down the winding road as fast as any Tir na n\u0027Og horse could run.\\n\\n He was more than a mile away before he even realized that Kelsey - the Kelsey who had told him to go - had not a bit of soot on his fair elven face.\\n\\n Soot-covered, his golden hair singed, and the gnome tucked unconscious under his arm, Kelsey crawled out the side of the bush, looking back helplessly and wondering if any of his friends or any of the precious mounts had survived. Gerbil groaned repeatedly, at least, and the elf knew that he was still alive.\\n\\n As was Geno, Kelsey learned a moment later when he heard the dwarf grumbling and growling and smacking his hammer off any nearby tree. Following the sounds, Kelsey was soon beside the dwarf.\\n\\n \"Where are the others?\" he asked.\\n\\n \"Stonebubbles!\" was all that Geno would reply.\\n\\n \"I thought that you had surely perished,\" Kelsey remarked.\\n\\n Geno snorted. \"I work at a dwarfish anvil, elf,\" he explained. \"It would take more than a bit of dragon fire to burn through this hide!\"\\n\\n \"But what of the leprechaun and Gary Leger?\" Kelsey asked, and gruff Geno could only shrug and curse, \"Stonebubbles!\" once more.\\n\\n The three kept low (and, with Kelsey\u0027s begging, Geno kept quiet) for the next half-hour as Robert continued to pass overhead, every now and then setting another section of the forest ablaze. Finally, the dragon seemed to tire of the game and swooped away, and Kelsey led his companions off. They found the pony, at least, wandering terrified to the south of the disaster, and then, when they hit the road, found the unmistakable tracks of the quadricycle, dug deeper than usual, as though the contraption was carrying more than the normal weight.\\n\\n \"They escaped,\" Kelsey proclaimed, deciding, as much on hope as on what his tracking skill was telling him, that both his friends must have been aboard. The elf\u0027s initial excitement ebbed as the three followed the tracks and came to realize that their companions were long gone.\\n\\n \"How fast does that thing go?\" Geno asked Gerbil, the dwarf obviously angered that Mickey and Gary had apparently run off.\\n\\n \"How fast?\" Gerbil echoed, scratching at his soot-covered beard. \"Well, indeed, with the added weight ... I put it at two hundred and fifty pounds ... but then, of course, Gary Leger is much stronger than the average gnome ...\"\\n\\n \"How fast?\" the dwarf growled.\\n\\n \"We cannot catch them on foot,\" Gerbil quickly replied. \"Or even with the single pony.\"\\n\\n Geno kicked a nearby tree and swung about to face Kelsey - then looked back over his shoulder to make sure that this particular tree wouldn\u0027t kick back. He looked back to the elf, then back to the tree right away, eyeing it suspiciously. Finally, convinced that this one was quiet, like a tree should be, Geno focused on the elf, and was surprised to see Kelsey taking a parchment from the trunk of a nearby tree. Geno thought it more than curious that none of them had spotted that note before.\\n\\n \"From the leprechaun,\" Kelsey said, and that alone explained many things. Kelsey read on and nodded, then held the parchment out for the others to see.\\n\\n Under control. Meet you at Braemar.\\n\\n \"Braemar?\" Geno roared. \"Why Braemar? I thought we were going to Giant\u0027s Thumb, to put the damned wyrm back in its damned hole.\"\\n\\n \"But now the dragon is out,\" Gerbil reasoned.\\n\\n \"The dragon was always out!\" Geno growled. \"On to Giant\u0027s Thumb, I say, and let\u0027s get this business finished!\"\\n\\n \"You forget that we do not have the stolen dagger,\" Kelsey interjected. \"If Mickey has returned to Braemar, then so must we.\"\\n\\n Geno wiped some soot off his unbearded face and shook his head helplessly. To all of them, it seemed as though they had been defeated, been turned around at the first sign of trouble. \"Damned stupid sprite,\" the dwarf muttered. \"What did he go and turn around for?\"\\n\\n Kelsey nodded, but his thoughts were heading in a different direction. Why indeed would Mickey turn back at this time? They were as close to Giant\u0027s Thumb as to Braemar, and would likely face Robert again whichever way they turned. Kelsey chuckled, understanding it all, understanding that Mickey had turned them around as a decoy, to hopefully turn Robert around as well.\\n\\n \"What is it?\" Geno demanded.\\n\\n Kelsey shook his head. \"I am only glad that we are all still alive,\" he lied, and he waited for Geno to look away before he turned his gaze back to the east, where he now knew that the leprechaun and Gary Leger were in full flight. \\n\\n","sourceLink":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2/page-19.html","bookId":2185,"book":{"id":2185,"title":"The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2)","description":"Storyline: The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2) \\n The sequel to The Woods Out Back. The realm of Faerie is a beautiful and peaceful land--or at least it used to be. The enchanted world hidden behind Gary\u0027s house is threatened, and in his struggle to save Faerie, Gary must conquer a wicked king, a banished witch, and an angry dragon.\\n","cover":"https://allnovel.net/images/the-dragon-s-dagger-spearwielder-s-tale-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:59 PM"}}
