{"id":100144,"no":6,"title":"Page 6","content":"He knew as soon as he opened his eyes on a glorious dawn that Diane was no longer beside him. He knew by the vivid colors, almost too rich for his eyes, that he had come again to the enchanted realm of Faerie, and he was not surprised at all a moment later to see Mickey McMic-key, Kelsey, and Geno staring down at him as he lay on a patch of thick grass, surrounded by blueberry bushes. Still groggy from the pixie poison, Gary stretched and yawned and forced himself to sit up. \"No time for sleeping, lad,\" Mickey said to him. \"Baron Pwyll\u0027s to be hung at noon, and we\u0027ve to get ye in the armor and get to Dilnamarra in a hurry.\" Gary\u0027s stare took on a blank appearance as he tried to orient himself to his new surroundings and tried to digest the sudden rash of news. The Baron ... the armor . .. Dilnamarra ... Geno grabbed him by the shoulder, and with strength far beyond what his four-foot-tall body should have possessed, easily hoisted, flung, Gary to his feet. \"Comes from eating rocks?\" a shaken Gary asked Mickey, remembering what the leprechaun had told him of dwarfish power. \"Now ye\u0027re catching on,\" Mickey said with a wide grin. \"There\u0027s a good lad.\" \"My welcome, Gary Leger,\" Kelsey added solemnly, and from what Gary knew of Kelsey\u0027s aloof demeanor, that seemed like the warmest greeting of all. Gary took a moment to look all around, to bathe in Faerie\u0027s preternatural colors and in the continual song that seemed to fill the ear, just below the level of conscious hearing. Music had been an important part of Gary\u0027s life in his own world, and the feelings bestowed by the best of the songs that he heard came close, but did not match, the subliminal and unending magical notes that filled Faerie\u0027s clear air. Mickey tugged at daydreaming Gary\u0027s belt, pointing out that Kelsey and Geno had already started away. When they arrived at the great oak tree and retrieved the armor, Gary was suddenly relieved that Diane had not come with him. Up this tree lived Leshiye, the wood nymph, a gorgeous and ultimately seductive creature with whom Gary had shared a most pleasurable encounter on his last visit to Faerie. Inevitably, Gary\u0027s eyes now drifted up the wide-spread branches, and he put a hand to one ear, wondering if he might catch a hint of Leshiye\u0027s enchanting and enticing song. Kelsey tapped Gary on the shoulder, and when the young man turned about to regard the elf, he looked into the most uncompromising glare he had ever seen. It was Kelsey who had climbed this very tree to pull Gary from Leshiye\u0027s tender, and inevitably deadly, clutches. The elf had been angry then, as dangerous as Gary had ever seen him, and Kelsey\u0027s glare now came as a clear warning to Faerie\u0027s visitor that he should concentrate on the business at hand and leave any sought-after pleasures for later. \"Why not give back the armor, instead of putting that one in it?\" Geno asked suddenly, drawing the attention of the other three. \"Geldion would let Pwyll go and I could get back to my home.\" \"But then Geldion would take the artifacts back to Connacht,\" Mickey reasoned. In truth, the dwarf\u0027s plan seemed simple, but Mickey couldn\u0027t let it come to pass, not if he wanted to retrieve his pot of gold. Worried that pragmatic Geno might spoil everything, Mickey found some unexpected support from Kelsey. \"We shall need the armor and spear if it comes to battle with Robert,\" the elf explained. Geno snorted. \"Let Geldion and Pwyll raise an army to battle the dragon,\" he said. Mickey chewed his lip as the situation seemed to hang on a fine wire. \"No,\" Kelsey said flatly, and Mickey tried hard to keep his relieved sigh quiet. \"Robert is our responsibility, since it was our actions that loosed him on the land. It seems a simple thing to return the item to the dragon\u0027s lair and force him to honor the terms of banishment.\" \"The dragon\u0027s out?\" Gary asked incredulously. \"Just a small issue,\" Mickey replied, straightening his tam-o\u0027-shanter. Gary looked to Mickey and shrugged, hopelessly confused, but the leprechaun put a finger to pursed lips, calling for silent patience. \"Your responsibility, elf!\" Geno balked, poking a stubby finger Kelsey\u0027s way. \"The quest was yours, never mine, and you bear the responsibility of the theft.\" \"What?\" Gary mouthed silently to Mickey, though he thought that he was beginning to catch on. The word \"theft\" led Gary to believe that Mickey had taken something from Robert, something that had broken the dragon\u0027s indenture. The notion that the friends had somehow loosed a dragon on the land began to weigh heavily on the young man\u0027s shoulders, began to make him think that going right back to the forest behind his mother\u0027s house might not be such a disappointment. \"Our responsibility,\" Kelsey promptly corrected. \"And we, together, shall see it through, shall put the wyrm back in his hole, and perhaps right many other wrongs in the land along the way.\" Mickey was smiling easily then, realizing that he had indeed appealed to Kelsey\u0027s overdeveloped sense of honor. \"Pretty words, elf,\" Geno said grimly. \"Let us hear them again in the face of an angry dragon.\" Despite his grumbling, though, the dwarf was the first to move for a metal plate. Gary felt the balance of the magnificent armor as Geno and the others went about the task of strapping it on. On his initial visit to Faerie, when he had first donned the armor, it had felt bulky and he had felt clumsy in it. Gary had spent the last five years strengthening his muscles, though, preparing himself for this return, and now, as the armor fell into place, his body remembered. When the last piece of metal plating was strapped securely into its place, Gary felt no more encumbered than if he had been wearing a set of heavy clothes and a long leather coat. Gary lifted the huge and ornate helm and tucked it under one arm. This was the only piece that didn\u0027t fit well - Cedric\u0027s head must have been huge indeed - and Gary saw no reason to put it on just yet. Then he went for the spear, pausing a long moment to study it, to bask in the view of its splendor. It was long, taller than Gary, and forged of black metal, with a wide tip that flared out back at the top of the handle and turned around on both sides into secondary points, making the whole appear almost like a distorted trident. It looked as if it would weigh a hundred pounds, but so balanced was it, and so heavily magicked, that Gary could easily hurl it fifty feet. \"Well met again, young sprout,\" came a call in Gary\u0027s mind, a telepathic greeting from the sentient spear. Gary let a reply drift from his thoughts, and then, almost as if they had never been apart, he and the weapon were communicating continuously, subconsciously, each becoming extensions of the other. It was in this telepathic joining that Gary Leger had learned to fight, that Gary Leger had come to see the land of Faerie as one of Faerie might, and make his battle decisions quickly and correctly when the situation demanded. The spear had given to Gary a different point of reference, and the confidence to act on his newfound instincts. When Ceridwen had caught them on the mountain outside Robert\u0027s castle, when all seemed lost, Gary had listened to those instincts and had hurled the spear into the witch\u0027s belly, saving them all and banishing Ceridwen to her island home. \"Lead on,\" Gary said to Kelsey as he took up the magnificent spear. The elf shook his head, put his slender fingers to his lips, and blew a shrill whistle, and a moment later, three horses and a pony burst into the clearing by the oak, flipping their heads about and snorting (Gary almost expected to see fire puffing from the nostrils of the mighty steeds). All four were pure white, and bedecked in an array of tinkling golden bells that rang out in perfect harmony as the beasts jostled about. Rich satiny purple blankets peeked out from under their smooth and delicate saddles. \"A bit noisy, don\u0027t ye think?\" Mickey asked Kelsey. \"The bells ring only when they are commanded to ring,\" Kelsey replied. \"No mount walks as quietly as a steed of Tir na n\u0027Og, and no mount runs as fast.\" \"Not likely,\" Geno grumbled, eyeing the pony with disdain. Kelsey and Mickey regarded the dwarf for a long while, not understanding what he was talking about, until the pony pawed near to Geno and the gruff and fearless dwarf verily leaped away, his hand snapping down to grab at a hammer. \"He\u0027s afraid of horses,\" Mickey chuckled, but his smile wrapped tight against his long-stemmed pipe when Geno turned his glare Mickey\u0027s way. \"Dilnamarra is many miles away,\" Kelsey said to the dwarf. \"We have no time to walk. You have ridden before,\" the elf reasoned, for horseback was the primary means of travel in Faerie. \"Ye rode the giant when I made him look like a mule,\" Mickey added. \"I rode the cart the giant pulled,\" Geno promptly corrected. \"I don\u0027t know how to ride,\" Gary cut in, looking apologetically to his friends. The young man thought himself incredibly stupid. He had spent five years in his own world preparing himself in case he ever got back to Faerie, and he had never even thought to take a riding lesson! \"Horses aren\u0027t so common in my world,\" he tried to explain. \"And when ye got here the last time, ye didn\u0027t know how to fight, either,\" Mickey reminded him. \"Ye learned, Gary Leger, and so ye\u0027ll learn again. Besides, don\u0027t ye worry, I\u0027ll be up in yer saddle beside ye.\" Gary looked doubtfully to the horse that had padded near to him, but shrugged and nodded Mickey\u0027s way. He started for the saddle, plopped the cumbersome helmet on his head, and put his foot up to the stirrup. \"From the left side,\" Kelsey corrected. \"Uh-oh,\" Mickey muttered under his breath. With a single fluid motion, Kelsey was up in his seat, taking the reins of the riderless horse beside him as well. Gary had to struggle a bit more - the leggings of the armor didn\u0027t quite spread wide enough for an easy mount - but he managed to get into place, and Mickey floated up in front of him, taking a comfortable seat between Gary and the horse\u0027s muscled neck. \"The lad can do it,\" Mickey said to Geno. \"Are ye not as brave?\" Geno grabbed the pony\u0027s bridle and pulled the beast\u0027s face right up to his own, nose to nose. The dwarf started to speak several times, but seemed as though he had no idea of what to say to a pony. \"Behave!\" he barked at last, sounding ridiculous, but when he turned his unrelenting scowl about to regard his friends, they all three quickly bit back their chuckles. When the dwarf finally settled on the pony\u0027s back, Kel-sey nodded to the others and clicked his teeth, and the mounts leaped away, hooves pounding as they thundered through the thick brush, bells ringing gaily, though it seemed to the stunned Gary Leger that not a leaf was shaking in their wake. The wild run through Tir na n\u0027Og was among the most exciting things Gary had ever experienced. The mounts seemed out of control, running of their own free will. Once his mount headed straight for the trunk of a wide elm, head down in a full gallop. Gary screamed and covered his eyes with his arm. Mickey laughed, and the horse veered slightly at the last moment, passing within inches of the elm. Gary fumbled to straighten the helmet, then looked back and saw that Geno\u0027s pony, following closely, had taken the same route, and the dwarf, who apparently had tried to jump off, was now struggling to right himself in his saddle, complaining all the while. \"Keep low in the saddle,\" Kelsey warned from the side, seeing the man upright, and Gary bent as far over as he could. Still, he felt more than one low-hanging branch brush across his shoulders, and the long spear cut a swath in the foliage along the tight side. Gary heard the singing of running water somewhere up ahead. A moment later, his helmet spun around on his head and he felt as if he was flying, and then he heard the sound of the water fading fast behind him. \"Unbelievable,\" he muttered, straightening the helm. \"That\u0027s the fun of it,\" Mickey quickly replied, still sitting easily in the crook between Gary and the horse\u0027s neck. \"Say, lad, ye didn\u0027t happen to bring me another book, now, did ye?\" Gary smiled and shook his head. He wished that he had brought several books, the rest of Tolkien\u0027s series, at least, so that he might hear Mickey\u0027s comments as the leprechaun read them - read them as if they were factual historical books. Gary smiled again as he realized that they just might be, from the perspective of Faerie\u0027s folks. The party charged out of Tir na n\u0027Og just a few minutes later, thundering across the hedge-lined fields, causing the many sheep and hairy \"heeland coos,\" as Mickey called the highland cows, to pause and look up to regard their passing. It all seemed a wondrous blur to Gary, the miles rolling under him as surely as if he had been flying down Route 2 after work back home. But even with the rag-top down, the sensations in the Mustang could not come close to equaling the thrill of riding this near-wild steed, a beast that Gary might coax, but certainly could not control. Some time later they came in sight of Dilnamarra, the single stone tower that served as Baron Pwyll\u0027s keep poking above the rolling plain and the low wooden shops and cottages. On Kelsey\u0027s command, the magical bells stopped ringing, and the elf slowed, bringing them in at an easy and quieter pace. A crowd had gathered at the muddy crossroads in the center of the small village, gathered around the gallows, to which a trembling and blubbering Pwyll was now being dragged. Kelsey led the others down around a low hill, where they left the horses and crept up on foot, pausing to watch from a hedgerow a hundred feet down the north road from the gathering, with the squat tower directly across the gallows from them. \"We\u0027ve come not a moment too soon,\" Mickey remarked. \"But how\u0027re we to get in there and get away?\" \"If we had walked, our concerns would soon be at their end,\" Geno grumbled, drawing angry stares from both Kelsey and Mickey. \"There are a lot of soldiers down there,\" Gary remarked. \"Aye,\" Mickey added, \"and most o\u0027 them wearing the colors of Connacht.\" He tapped Gary\u0027s hand, clutching tightly to the magnificent spear. \"We\u0027re for needing tricks, not weapons,\" he said, and Gary nodded and eased his grip. \"What tricks do you have, leprechaun?\" Geno asked gruffly. \"The fat one will be hanging by his neck in a ten-count.\" It was true enough; even as they crouched and tried to figure out a plan, Prince Geldion was reading from an unrolled parchment while a contingent of his men prodded and kicked the reluctant Pwyll up the stairs. \"Will the crowd help us?\" Gary asked eagerly, picturing some grand revolt with himself at the lead, dressed as Cedric Donigarten, the most famous hero of Faerie. \"Not likely,\" Mickey answered, bursting Gary\u0027s daydreams. \"They\u0027re commonfolk, and not likely to find the courage to go against Connacht, even if yerself\u0027s wearing the armor of their hero of old.\" \"You must get in close to the Baron,\" Kelsey said suddenly to Geno, stringing his bow as he spoke. \"My arrows have cut ropes before.\" Geno laughed at him. \"Geldion and the others will believe that Pwyll is hanging,\" Kelsey, undaunted, said to the dwarf. Kelsey turned to Mickey with a questioning stare, and the leprechaun understood what role the elf meant for him to play. Mickey looked back doubtfully to the gallows, where a soldier was putting the hangman\u0027s noose around PwylFs neck. If he had his pot of gold, his source of magical energies, Mickey could have woven an illusion that would have curious onlookers staring at the hanging man for a week. But he didn\u0027t have that precious pot, and without it, the leprechaun wasn\u0027t sure that his magical imagery would be precise enough to fool half the people around the gallows. \"I see no better way,\" he answered, though, and he rubbed his plump little hands together and began weaving the words of a spell. Geno continued to smirk doubtfully and shake his head. \"I will go if you\u0027re afraid,\" Gary offered, and he shifted away as the dwarf\u0027s disbelieving and threatening scowl fell over him. With a growl, Geno was up and running, cutting from bush to bush, then darting behind a water trough just a few feet behind the back ring of onlookers. There, Geno spat in his hands and tamped down his powerful legs like a hunting cat, preparing to rush out at the exact moment. Gary shot a mischievous wink Mickey\u0027s way. \"A little motivation for the dwarf,\" he explained. \"It\u0027s good to have ye back, lad,\" the leprechaun replied with a chuckle. Gary went out next from the hedgerow, slipping closer to the crowd, spear in hand. He heard Kelsey whistle softly and looked back to see the horses walking in behind the elf and Mickey. Then Gary turned his attention fully to the scene ahead, inching up as close as he could get to the anxious crowd. He noted the thickness of the rope and began to doubt Kelsey\u0027s plan, began to doubt that any arrow, no matter how perfect the shot, could cut that hemp cleanly. He heard Geldion complete the damning proclamation, labeling Pwyll as a thief and a traitor to the throne. \"And we hang traitors!\" the Prince cried out, a pointed reminder to everyone in attendance. \"Executioner!\" A whine escaped doomed PwylFs thick lips; the executioner\u0027s hand went to the long lever at the side of the gallows platform. It all happened at once, suddenly, with Geno hopping the trough and plowing through the onlookers, cutting a wide wake with his broad shoulders, an arrow splitting the air above him as the trap door dropped open, and Gary finding himself instinctively heaving the great spear behind the arrow in its flight. Kelsey\u0027s arrow hit the rope squarely, cutting an edge. Still the hemp held, and Pwyll\u0027s neck would surely have snapped, had not Gary\u0027s spear completed the task, its wide head easily shaving the rope in half as it flew past. The crowd roared, a unified groan. Baron Pwyll felt the sudden, sharp jerk, felt as if his head was about to be ripped off, and then he was falling, turning horizontally, and looking up to see himself hanging by the neck! \"I am dead!\" he cried, and he was surprised to hear the sound of his own voice. He slammed against the ground, but was back up again, seeming to float in the air as he continued to stare blankly at his own corpse. \"You should be,\" Geno agreed, grunting under the tremendous weight as he whisked the Baron away. Poor confused Pwyll didn\u0027t know what to think, caught halfway between what his senses were telling him and what his mind, what Mickey\u0027s illusions, were telling him. From the far side of the crowd, Gary blinked, for he hadn\u0027t witnessed any of it. Horror and revulsion welled up inside him as he stared at the hanging and twitching Baron. But then Gary noticed Geno, his arms full of a second Pwyll, rushing out the back side of the gallows, and Gary remembered Mickey. He looked through the illusion then, saw the severed rope, the dwarf running off, and his spear angled out of the ground twenty feet to the other side of the gallows. No one else was moving, though, caught up in the illusion, and Geldion hadn\u0027t called for any to block the fleeing dwarf\u0027s path. A rumble of confusion and a cry of alarm began its inevitable roll through the crowd. Up on the platform, Geldion and his soldiers glanced all around, trying to see what the commotion was about, for to their eyes, Pwyll was hanging securely right below them. Gary nearly jumped out of his armor when he felt something tap his shoulder. He turned to see his mount, down on its front knees, tossing its head anxiously. Gary hadn\u0027t even put his leg all the way over the beast\u0027s back before it took flight, flying around the side of the gathering. More and more people were beginning to recognize the deception, beginning to point this way and that, mostly to the northeast. Prince Geldion looked down through the trap door and screamed in shock. \"Cedric Donigarten is come!\" one villager cried, spying the armored rider. \"Woe to Connacht!\" cried another. \"Kill him!\" Geldion yelled, stuttering over the words, spittle streaming from his thin lips. \"We have been deceived! Oh, devil-spawned magic!\" \"The game\u0027s over,\" Gary whispered, bending low and urging his steed on. He saw Geno link up with Kelsey and Mickey, the leprechaun up behind Kelsey. The dwarf heaved Pwyll up on the spare horse, then rushed to his pony. A crossbow quarrel clicked off the shoulder-plating of Gary\u0027s armor. The road before Gary seemed clear, though, except that one soldier had rushed out of the keep\u0027s open door. The man had gone to the spear and was now tearing it from the ground. \"Dammit,\" Gary growled, and his steed seemed to read his thoughts, veering straight for the man. Gary thought he would have to run the man down, trample him flat, then wheel about and retrieve the spear on the second pass. \"Hurry, young sprout!\" he heard in his mind, and he watched in thrilled amazement as a flashing jolt of energy coursed through the spear handle, hurling the soldier to the ground a dozen feet away and sending the weapon flying high into the air. Gary caught the free-flying weapon in midstride, heard the sitting soldier cry out in terror as the horse bore down at him. But the beast of Tir na n\u0027Og was intelligent indeed and not evil, and it lifted its legs and easily cleared the ducking man, landing solidly far beyond him and thundering about in a tight turn to get away from the occupied keep and catch up to the fleeing companions. Gary held on for all his life, nearly went flying free as the horse wheeled. He heard a whistle in the air as another quarrel flew past. \"Mounts! Mounts!\" one soldier was yelling above the din of the frenzied villagers, the angry shouts of Prince Geldion, and the sudden blare of horns. Another quarrel zipped past and Gary bent as low as he could go, trying to present a small target. He saw the cloud of dust ahead as his sweating steed approached his companions, heard the tumult behind him fast fading. He came up between Geno\u0027s pony and the horse bearing Pwyll, and nearly laughed aloud, despite the danger, when he saw that the Baron still had the noose and length of rope around his neck. Three long strides brought Gary beyond those two, up beside Kelsey and Mickey. \"The illusion did not hold!\" the elf was claiming to the leprechaun. \"Didn\u0027t say it would,\" Mickey replied casually, puffing on his longstemmed pipe - which Gary thought an amazing feat, given that they were in full gallop. He noted that there seemed to be an underlying tension behind the leprechaun\u0027s carefree facade, and thought it curious, as did Kelsey, that Mickey, who had created illusions to fool a dragon for many minutes, had not been able to trick the crowd for any length of time. \"They\u0027re coming!\" Geno called from behind. Kelsey pulled up his horse and the others followed the lead, turning about to regard the now-distant keep. They saw the dust beginning to rise on the road back to the north and could hear the distant dull rumble of many hooves. \"How come every time we leave that place, there\u0027s a Prince chasing us?\" Gary asked. \"Oh, my,\" groaned the thoroughly flustered Baron Pwyll. He growled repeatedly, getting all tangled up as he tried to get the noose off his neck. \"Now I am in serious trouble.\" Gary blinked in amazement; Geno snorted. \"More trouble than hanging?\" Mickey asked, equally incredulous. \"Fear not,\" Kelsey assured them all, turning his mount back to the open road to the south. \"No horse can match the pace of the mounts of Tir na n\u0027Og!\" The elf handed Mickey over to Gary and kicked his steed away. Geno\u0027s pony flew past, with Pwyll\u0027s horse coming right behind. \"Ready for a run, lad?\" Mickey asked, settling into his seat in front of Gary. \"Do I have a choice?\" Gary replied, smiling. Mickey glanced around the man, to the north and the approaching cavalry. \"No,\" he said easily, puffing the pipe once more as Gary loosed his grip on the reins and the powerful steed of Tir na n\u0027Og charged off.","sourceLink":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2/page-6.html","bookId":2185,"book":{"id":2185,"title":"The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2)","description":"Storyline: The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2) The sequel to The Woods Out Back. The realm of Faerie is a beautiful and peaceful land--or at least it used to be. The enchanted world hidden behind Gary\u0027s house is threatened, and in his struggle to save Faerie, Gary must conquer a wicked king, a banished witch, and an angry dragon.","cover":"https://allnovel.net/images/the-dragon-s-dagger-spearwielder-s-tale-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:59 PM"}}
