{"id":100146,"no":8,"title":"Page 8","content":"What had gone from a gallop down a wide road to a trot down a narrow path soon became a plod along a barely discernible and winding way around steamy wet bogs. The annoying buzz of gnats and mosquitoes replaced the chatter of birds, and low-hanging fog stole the crystal blue from the sky. \"The land of fantasies,\" Gary Leger remarked quietly, and even his whisper seemed to come back at him ominously. \"And of nightmares,\" Baron Pwyll put in, sweat covering his thick-skinned face and his eyes wide and darting from side to side as though he expected some horrid monster to spring out and throttle him at any moment. \"Not so bad,\" Mickey said to keep Gary calm. \"She\u0027s a quiet place really, even if she\u0027s looking like a home for the spooks.\" The three of them hardly noticed that Kelsey and Geno, up in front, had stopped their march, with Kelsey turning his mount sideways along the narrow path so that he could look all about. The elf sat shaking his head, golden eyes squinting and lips pursed as though he had just taken a big bite out of a grapefruit. \"What is it?\" Mickey prompted. \"I did not believe that Geldion would follow us in here,\" Kelsey admitted. \"Even the mounts of Tir na n\u0027Og have difficulty navigating the treacherous bogs. The Prince is likely to lose more than a few men.\" Gary looked all around, confused. \"How do you know that he\u0027s following us?\" he asked, for he had noticed nothing that would indicate pursuit. Kelsey put a finger to his lips, and all the companions went perfectly silent for a few moments. At first, Gary heard nothing but the endless din of insects, and the occasional nicker from one of the mounts, but then came the unmistakable, though distant, clip-clop of horses plodding through the soft ground. \"I\u0027d lay ye a good-odds bet that our Geldion\u0027s got eyes guiding his way,\" Mickey remarked to Kelsey, and the elf didn\u0027t have to ask whom the leprechaun was referring to. Kelsey clicked softly to his mount and tugged the reins to right the stallion on the path. The elf had hoped to skirt the bogs and come back into the forest proper before nightfall. But now, though the sun was fast sinking in the western sky, he turned deeper into the swamp. \"Damned elf ears,\" Mickey said softly to Gary. \"If he hadn\u0027t gone and heard Geldion\u0027s horses, we\u0027d be away from this place afore the night.\" \"She\u0027s not so bad,\" Gary said, echoing the leprechaun\u0027s earlier remarks. \"Ye just keep believing that, lad,\" Mickey replied, and Gary didn\u0027t miss the honest look of trepidation that crossed the leprechaun\u0027s face as he lit up his long-stemmed pipe once more. The moon was up soon after the sun went down, and the swamp did not become so dark. The ground-hugging mist glistened, seemed to have a light of its own, starkly outlining the reaching branches of dead trees, and swirling to create images that had names only in the imaginations of frightened witnesses. Kelsey was glad for the glow, for he could continue to walk his mount along, but Gary found himself wishing for blackness. Mickey pretended to be asleep, but Gary often saw him peeking out through a half-closed eye from under his tam-o\u0027-shanter. Even Geno seemed fearful, clutching a hammer so tightly that his knuckles had whitened around it, and poor Pwyll fell into several fits of trembling and whimpering, and would have broken down altogether had not the dwarf promptly stepped his pony back to the Baron and whispered in his ear - probably threats, Gary realized. The young stranger to Faerie couldn\u0027t blame the Baron, though, couldn\u0027t fault the man for his weakness in this place that looked \"like a home for the spooks,\" as Mickey had put it. Bats were out in force, squeaking and squealing as they darted all about, easily getting their fill of insects. The sucking noises of the horses\u0027 hooves pulling free of the grabbing mud came to sound like a heartbeat to Gary, or like the gurgling spittle of a rasping ghoul. He peered closely into the fog at his side when they passed one fen, watching the edge of an angled log half floating in the stagnant water. Another branch was sticking straight up, just a few inches above the pool, its twigs resembling the dried fingers of a long-dead corpse. Just your imagination, Gary stubbornly and repeatedly told himself, but that thought held little weight when the supposed \"twigs\" clenched suddenly into an upraised fist. \"Oh, no,\" he muttered. \"What is it, lad?\" Mickey asked, the leprechaun\u0027s gray eyes popping open wide. Gary sat perfectly still, holding tight to the bridle of his nervous and unmoving horse. The arm began to rise up out of the pool. \"What is it?\" Mickey asked again, more frantically. Gary\u0027s reply came as a series of deep breaths, a futile attempt by the young man to steady his nerves. \"Oh, Kelsey,\" the leprechaun quietly sung out, seeing no real answer forthcoming. Nervous Baron Pwyll looked back to discern the problem with the trailing mount, looking from Gary\u0027s frozen stare to the pool. The fat man immediately spotted the arm, and then the top of a head, with matted, blotchy hair surrounding many open sores. Pwyll meant to cry out, \"Ghost!\" but his stuttered cry came out as simply \"GAAA!\" The Baron was nearly jerked from his saddle then, as Kelsey rode back, grabbed the bridle from Pwyll\u0027s hands and bolted away. Geno acted equally resourceful, skipping his pony past Pwyll\u0027s mount (and growing more than a bit frightened as his pony\u0027s hooves splashed into foot-deep water), and similarly grabbing at the bridle on Gary\u0027s horse. Gary never saw the face of the ghoulish creature rising from the bog, but he pictured it a hundred different ways, none of them overly pleasant. The group raced off as fast as Kelsey could lead them, and when the commotion had died away, they were all startled once more, this time by the calls of pursuit not far behind them. Kelsey veered into a brush tangle and pulled up there to get his bearings, the others coming in right behind, all of them eager to remain in a tight group. \"They\u0027re even following us at night,\" Mickey whispered to Kelsey. \"Who do ye know that\u0027d come through the fens without being chased through the fens?\" \"We\u0027re being chased through, and I don\u0027t want to be here,\" Gary put in sarcastically. \"The witch,\" Geno reasoned, to Pwyll\u0027s accompanying groan. \"Our pursuit is being guided,\" Kelsey admitted. \"Surely. Perhaps by Ceridwen, but in any case, I do not believe that we will leave them behind.\" \"We\u0027ll leave them behind,\" Geno promised grimly, pulling out a hammer and slapping it across his open palm. \"Prince Geldion rides with at least a score of men,\" Pwyll argued. \"Twenty more ghosts for this haunted swamp,\" the dwarf solidly replied. Geno tossed the hammer up into the air, then caught it perfectly in his gnarly hand. \"More than a score, I\u0027d be guessing,\" muttered Mickey, poking his chin out to the side, not behind, where the others were generally looking. A line of torches, two dozen at least, was evident through the fog and the trees, moving slowly and parallel to the path the companions had been riding. \"Flanking us,\" Geno remarked, his surprise obvious. \"And many more behind, would be me own guess,\" Mickey said. Kelsey ran his slender fingers through his thick and long golden hair, then put a questioning stare on Mickey as he reached for his long bow. \"I can slow \u0027em, perhaps,\" the leprechaun replied. \"But I\u0027m not likely to be stopping \u0027em.\" He closed his eyes then, and began chanting and waggling his fingers in the air before him, in the direction of the flanking soldiers. A second grouping of torches appeared, farther down the trail from the line of riders. \"There they are!\" came a cry, followed by a unified roar and the instant rumble of charging hoofbeats. The torches intersected and became a scramble of lights through the fog. Horses whinnied, complaining of being pulled up so short, and there came several wet thuds, as though mount and rider had gone down. \"Will-o\u0027-the-wisps!\" came one cry above the general tumult. \"Not really,\" Mickey said to his friends, taking another long draw on his pipe. \"It\u0027s just lookin\u0027 that way. A bit o\u0027 pixie lights, actually.\" The flanking line was soon in wild retreat, most riding, but some men running, and with less than half the torches burning that the companions had previously noted. One rider came splashing through the bogs directly for the brush that held the companions, though he obviously couldn\u0027t see them. His cry sounded remarkably like Pwyll\u0027s stuttered attempt at \"Ghost!\" and he was looking too much over his shoulder for such a pace in so treacherous an area. His horse hit some deeper water and rolled over headlong, pitching the soldier through the air. He slammed heavily into a dead tree and plopped down into the water, springing right back to his feet and running on, trying to wipe the blood and muck out of his eyes. \"They\u0027re as scared as we are,\" Gary reasoned, an idea coming to him along with a smile. \"As you are,\" Geno gruffly corrected. \"Even better,\" Gary replied. \"What are ye thinking, lad?\" Mickey asked, but the leprechaun would have to wait for his answer, for the fleeing cavalry apparently had linked up with Geldion\u0027s main force, and there came the sound of many riders approaching quickly from behind. \"Be off,\" Kelsey instructed, and his companions didn\u0027t have to be asked twice. Gary Leger had an idea. \"When I was a kid, we always threw scary parties on Halloween,\" he said to Mickey as they tromped along at the back of the line. \"Allhallows Eve?\" the leprechaun asked. Gary nodded. \"Everyone was afraid,\" he explained with a wry smile, \"except for the kids doing the haunting.\" Mickey took a long draw on the pipe and rolled his eyes as he considered Gary\u0027s point. His smile soon outshone Gary\u0027s. \"I told you to get the damned bugs out!\" Geno grumbled at Pwyll as the fat Baron slipped a hollowed log over the dwarf\u0027s arm. Pwyll immediately retracted the limb and brushed aside a few bugs, then slipped it back over the dwarf\u0027s outstretched arm. \"Quietly!\" Kelsey demanded, his voice muffled because his shirt was pulled up high over his head and buttoned tight. \"Can you see?\" Gary asked the elf. \"Well enough,\" Kelsey answered. \"Well enough to ride?\" The \"headless\" elf pulled open a space between two buttons and glowered at Gary. \"Just point me at the horse,\" he growled, his frustration only heightening at the sight of Gary\u0027s smirk. \"This will work,\" Gary said to calm him. Kelsey nodded, making the whole top part of his tightly pinned torso bob crazily. Despite his frustration - frustration born of fear - the elf approved of Gary\u0027s plan and thought it the best way for the companions to escape Geldion without an all-out battle. Gary helped him get to his horse, then, and helped him get up, and soon Kelsey seemed to settle into the saddle. \"Perfect!\" Baron Pwyll proclaimed, popping a stubby piece of rotting wood over Geno\u0027s head and lining it with brush. \"There ye go, lad,\" Mickey said, bobbing over to join Gary. The leprechaun cradled a curved piece of bark, a makeshift bowl, filled with some type of golden glistening mud. \"Stand still and put yer arms out wide.\" \"What is it?\" Gary asked. \"Something to give ye a ghostly glow,\" Mickey assured him. The leprechaun rubbed some of the mud on the hip-plate of Gary\u0027s armor and indeed, that section of the mail suit took on an eerie golden glow. \"Our enemies approach,\" Kelsey announced. He kicked his horse away, taking a side route so that he might flank Geldion\u0027s force. Pwyll took the reins of the other two horses and the pony and started away, turning back once to remind Geno to \"Look like a tree!\" \"Geno\u0027ll hold this spot,\" Mickey said to Gary. \"And Kelsey will hit \u0027em on the right. There\u0027s a ford across the bog to the left, a place Geldion might know.\" \"Lead on,\" the glowing warrior bade the leprechaun. Soon after, the area was quiet, except for the shuffling feet of Geno the tree as the dwarf tried to get into a better position. The toes of his hard boots stuck out from under the trunk he wore from shoetops to armpits, and his stubby finger couldn\u0027t even reach the end of the logs Pwyll had slipped over his arms. Even worse, Geno could hardly see at all, peeking out from under his treelike helmet, through strands of thick brush, and he feared that he might trip and fall, and lie like a helpless turtle on his back until (hopefully) one of the others came back for him. \"Stupid plan,\" the dwarf muttered, and then he went silent, hearing a group of soldiers moving along the path. Kelsey took many a stinging hit from low-hanging branches as his horse trotted through the thick brush. He held his seat easily, though, his strong legs wrapped tightly around his mount\u0027s back while he clutched his longbow, an arrow notched and ready. \"Find me a wide and safe run,\" he whispered to his horse when the torches of Geldion\u0027s flanking line came into sight. Gary had told Kelsey - and Kelsey thought it good advice - that his only chance was to make quick, fleeting passes at the soldiers, never to give the enemy a good view of him. A few moments later, Kelsey\u0027s mount waited patiently behind a copse of trees, with a clear run before it and Geldion\u0027s soldiers coming along a paralleling course barely twenty feet to the side. Kelsey held his horse back until the very last instant, then burst from the copse, groaning loudly, as Gary had instructed. \"There\u0027s one of...\" a soldier cried, but his sentence got cut short, turned into an indecipherable gurgle, when an arrow drove into his hip. The flanking line took up a cry of attack and swung about to charge out and intercept the fast-flying specter. Kelsey thought that the game was up. He fired a steady stream of arrows into the air, having no idea of how many, if any, might hit the mark, and kept his limited vision focused straight ahead, trying to discern an escape route once the wide run ended. Soldiers crashed their mounts through the blocking brush, a solid line of horsemen at first, but gradually dissipating until those few who suddenly found themselves out in front looked back curiously, then looked ahead to see what had stopped their eager comrades. \"Hey, he ain\u0027t got no head!\" one man cried - one man and then many. Kelsey heard the call and smiled under his high-pulled shirt. He dropped the bow across his lap, and in a powerful motion drew out his enchanted long sword, its rune-etched blade glowing a fierce blue that accurately reflected the elf\u0027s inner fires. Kelsey pulled hard on the reins, reared the stallion and then swung him about. \"Ring!\" he commanded the bells, and a thousand tinkling chimes accompanied his return charge. \"He ain\u0027t got no head!\" another man cried. \"Give me back my head!\" Kelsey answered in a mournful, crooning voice, again as Gary Leger had instructed him. One of the front soldiers, the captain of this contingent, sitting right in Kelsey\u0027s path, chewed on his lip and rubbed his fingers anxiously, desperately, along the hilt of his sword. He heard some of his forces breaking rank altogether, and didn\u0027t know which way to go. \"Give me back my head!\" Kelsey growled ominously once more. \"If any\u0027s got it, then give the damned thing back!\" another soldier, farther down the fast-disintegrating line, cried out desperately. \"Hey,\" the captain realized suddenly, straightening in his saddle. \"If he ain\u0027t got no head, then how\u0027s he talking?\" Thinking that he had uncovered the ruse, the captain turned smugly to one side and then the other. Only to find that he was sitting out there all alone. \"I ain\u0027t got your damned head!\" the captain shrieked at the closing horseman, and he threw his sword Kelsey\u0027s way, wheeled his horse about and galloped away, screaming, as were his deserting soldiers, of \"headless horsemen in the bog!\" \"They were here,\" one of the lead scouts said to his companion, studying the area where the five friends had split up. \"And none too long ago.\" The man bent low to study the fog-enshrouded ground beneath one small tree, his companion right at his back, waiting for news. Something hard conked the standing man on the back of the head. \"Who?\" he stuttered, spinning about. \"What\u0027re you about?\" the crouching scout asked him, looking back over his stooped shoulder. \"Something hit me on the head,\" the other man explained. \"This place is scary enough without your imagining things,\" the scout scolded. \"Now, be alert.\" The other man shrugged and adjusted his cap, looking back to his searching friend. Something hard conked him on the back of the head again, harder this time. \"Ouch,\" he said, stumbling into the crouching scout and grabbing at the back of his noggin. \"What?\" the exasperated scout began. \"Something hit me on the back of the head,\" the man protested, and the fact that his cap was five feet out in front of the two of them added credence to the claim. The scout pulled a small axe from his belt, motioned for the other man to go around one side of the small tree, while he went around the other. They hopped in unison around the trunk, coming to a standstill facing each other above one of the tree\u0027s two low-hanging branches. \"Nothing here,\" the scout said dryly. \"I\u0027m telling you,\" the other man began, but he stopped as the tree suddenly began to shake, its two limbs bobbing, its twiggy clump of branches rustling. \"What in the name of a hairy haggis?\" the scout asked, scratching his forehead. Geno brought his arm, his limb, straight back, clunking the scout on the nose, then shot it forward with all his strength, catching the unfortunate other man under the chin and launching him into the air. He landed in the muck on the seat of his pants, gasping and scrambling to get away. The tree spun about to face the scout squarely, but the man was not so intimidated. He wiped the blood off his upper lip and regarded it angrily. \"Damned haunted tree!\" he roared and his hatchet rushed in, splitting the bark and coming to a sudden stop close enough to Geno\u0027s face so that the dwarf could stick out his tongue and lick the weapon\u0027s razor-sharp edge. Geno turned quickly, one way and then the other, back and forth, his straightened limbs battering the scout\u0027s arms and shoulders. The man let go of his axe and tried to run, but got clipped and fell to the ground. Geno, trying to follow, tripped over the scout\u0027s feet, and he, too, came tumbling down. The tree-dwarf flattened the scout under him, burying the man in the soft muck. \"Now what?\" the dwarf muttered under his breath, helplessly prone with the frantic man trying to scramble out from under him. Geno began to shake wildly again, twisting so that his still-widespread arms continued to batter at the man. He added a haunting groan to heighten the effect. But then Geno was cursing his encumbering suit as the scout wriggled free, knowing that it would take him a long time to get to his feet, knowing that the man had him helpless. The scout didn\u0027t know it, though, for he had seen more than enough. As soon as he came up, spitting mud, he took off in full flight behind his already departing companion. He never looked back - and soon after, he retired as a scout and took up basket weaving. The five soldiers approached the ford, and the ghostly limned and impressive figure in the metal plate-mail armor, with due caution, their weapons drawn and the five of them repeatedly looking to each other for support. \"Standing and waiting for us to come and get you?\" one of them said as they neared the man. \"I am the ghost of Cedric Donigarten!\" Gary Leger growled at them, standing resolute, the wondrous spear planted firmly in the ground before him. Two of the soldiers backed away, two started to follow, but the fifth, a dirty-faced man with the green cap of a forest tracker, laughed aloud. \"Oh, are ye, then?\" he asked between chuckles. \"Then ye wouldn\u0027t happen to be that Gary Leger lad from Bretaigne, beyond Cancarron Mountains? Ye know who I mean, the one who fits so well in old Donigarten\u0027s armor?\" \"Trouble, lad,\" Mickey whispered, perched out of sight on a low branch right behind the young man. Mickey had recognized the speaker, and now so too did Gary, as one of Prince Geldion\u0027s personal escorts, one of the men who had been in attendance when Gary had gone with Kelsey and Mickey to originally retrieve the armor from Baron Pwyll, before they had ever set out to reforge the legendary spear. Gary feared that Mickey\u0027s estimate was correct, that the game was suddenly over, but some of the whispers behind the confident soldier gave him hope. \"No man, you fool,\" one of the retreating men remarked. \"See how he\u0027s glowing.\" \"Moon-mud,\" the sly man replied. \"He\u0027s a man in a suit of metal, is all he is, and no more a ghost than meself. Don\u0027t ye know at least Cedric\u0027s spear, if not the armor?\" \"I am the ghost of Cedric Donigarten!\" Gary growled again. \"I am invincible!\" \"Let\u0027s see,\" the sly man retorted, and he came forward a few steps, two of his comrades tentatively at his sides. Gary Leger tore the spear from the ground and held it out sidelong in front of him. \"NONE SHALL PASS!\" he declared in a booming voice, and the two flanking men stopped, causing their sly companion to pause and stare at them incredulously. \"Oh, that\u0027s good, lad,\" Mickey whispered from behind. \"Monty Python and the Holy Grail,\" Gary whispered over his shoulder. \"When he hits me, make my arm fall off.\" Mickey started to question that last remark, but the men were advancing again, swords ready. The sly man came suddenly, in a wild flurry, and Gary worked the spear all around, parrying the measured swordtnrusts. The soldier quickly grew frustrated, and came ahead with a straightforward thrust. Gary hopped aside and slapped down with the spearhead, likewise forcing the swordtip to dip. He put his opposite foot forward and turned his body beside his lunging opponent, coming near to the man and smacking him on the side of the head with the long handle of the spear. \"I am invincible!\" Gary declared again, hands on hips, as the soldier retreated a few steps to shake the dizziness from his vision. \"Five of us can take .. .\" the soldier cried, looking around, only to find that the two men at the back of his group were long gone. \"Three of us can take him!\" the man corrected. \"Together, I say, or face the wrath of Prince Geldion!\" The other two looked doubtfully at each other. The indomitable forest tracker slapped the sword from one man\u0027s hand. \"I\u0027ll not be asking again,\" the cruel and sly man said evenly. They came at Gary together, and only through his symbiosis with the magnificent weapon, the lessons the spear had subconsciously taught him, was Gary able to dance about, twirling the spear, and fend off the initial attacks. Fortunately, his enemies\u0027 attacks were not well coordinated, though they certainly kept Gary back on his heels. He whipped the spear side to side, brought it up suddenly to stop an overhead chop, then whipped it to his left, knocking aside a darting sword. Gary didn\u0027t know how long he could keep it up. He knocked away the sword to his left again, then the one to his right, and when he brought the spear back in line to halt the sly man\u0027s straightforward thrust, he saw an opening. He could have driven his speartip right through the man\u0027s chest, and with that man - who was obviously the leader - dead, the other two would likely have turned and fled. But Gary had to face the consequences before he made the move, had to come to terms with killing another human being. His hesitation cost him the opening, and nearly the fight, as the man on his left came in stubbornly again, the sword just missing as the spearshaft deflected it aside. The man jumped back and whooped with delight, and the sly man turned and punched him victoriously on the shoulder. Gary didn\u0027t have a clue of what they were so excited about - until he looked down to see his armored arm lying at his feet. \"Right,\" Gary cried, trying to defeat his own shock and remember the script. He lifted the mighty spear in one hand, the one remaining hand that appeared to his opponents to be intact. \"Have at it!\" The three soldiers screwed up their faces and looked to each other, then back to the stubborn knight. \"Come along then,\" Gary growled at them, lifting the spear in his right hand and leveling it in front of him. \"Yield,\" the sly man replied and he sarcastically added, \"ye one-armed ghost.\" \" \u0027Tis but a scratch,\" Gary insisted. \"And though the blood may SPURT from my shoulder, it will soon heal,\" he added, putting a heavy emphasis on the missing visual effect. On cue, a gusher of blood spurted from Gary\u0027s shoulder, splashing to the ground. \"I\u0027ve had worse,\" Gary said calmly to the disbelieving men. \"AAAAH!\" The tracker found himself suddenly all alone, and even he did not seem so keen for the fight. Gary waved the spear again, and the man advanced a step, but then lookedback to Gary\u0027s feet, his eyeballs nearly falling free of their sockets, and promptly turned and ran away. Gary\u0027s stomach did a flip-flop when he, too, looked down, to see his severed limb grabbing at his ankle and trying to crawl back up in place. \"Enough, enough,\" he whispered harshly, gagging in tune with the leprechaun\u0027s merry chuckling. \"Oh, a fine plan it was, lad,\" Mickey congratulated, coming from his hiding place, and privately patting himself on the back for being able to pull off the somewhat simple illusion. \"Our tricks\u0027ll put Geldion and his men on their heels for sure.\" \"If the others had similar success, we should get far away,\" Gary agreed, breathing easier now that the image of his own severed arm was no more. \"Now,\" Mickey began in all seriousness. \"I\u0027m knowing about the holy grail and where the thing is hidden, but tell me who or what this Monty Python fellow might be.\"","sourceLink":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2/page-8.html","bookId":2185,"book":{"id":2185,"title":"The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2)","description":"Storyline: The Dragon\u0027s Dagger (Spearwielder\u0027s Tale #2) The sequel to The Woods Out Back. The realm of Faerie is a beautiful and peaceful land--or at least it used to be. The enchanted world hidden behind Gary\u0027s house is threatened, and in his struggle to save Faerie, Gary must conquer a wicked king, a banished witch, and an angry dragon.","cover":"https://allnovel.net/images/the-dragon-s-dagger-spearwielder-s-tale-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-dragon-s-dagger-spearwielder-s-tale-2.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:59 PM"}}
