{"id":86006,"no":12,"title":"Page 12","content":"\"Um . . . you okay?\" I ask.\n \"If this gets around, I\u0027m never going to live it down. Oh, God, if Mrs. Peterson calls my parents I\u0027m dead. Or at least I\u0027ll wish I was dead.\" She keeps talking and shaking, as if she\u0027s a car with bad shocks and no brakes.\n \"Brittany?\"\n \". . . and my mom\u0027ll blame it on me. It\u0027s my fault, I know. But she\u0027ll freak out on me and then I\u0027ll have to explain and hope she--\"\n Before she can get another word out I yell, \"Brittany!\" The girl looks up at me with an expression so confused I don\u0027t know whether to feel sorry for her or stunned she\u0027s rambling and can\u0027t seem to stop. \"You\u0027re the one freakin\u0027 out,\" I comment, stating the obvious.\n Her eyes are usually clear and bright, but now they\u0027re dull and blank as if she\u0027s not all here.\n She looks down and around and everywhere except directly at me. \"No, I\u0027m not. I\u0027m fine.\"\n \"The hell you are. Look at me.\"\n She hesitates. \"I\u0027m fine,\" she says, now focused on a locker across the hall. \"Just forget everything I just said.\"\n \"If you don\u0027t look at me, I\u0027m gonna bleed all over the floor and need a fuckin\u0027 transfusion. Look at me, dammit.\"\n Her breathing is still heavy as she focuses on me. \"What? If you want to tell me my life is out of control, I\u0027m already aware of it.\"\n \"I know you didn\u0027t mean to hurt me,\" I tell her. \"Even if you did, I probably deserved it.\" I\u0027m hoping to lighten the mood so the girl doesn\u0027t have a complete breakdown in the hallway. \"Makin\u0027 mistakes ain\u0027t a crime, you know. What\u0027s the use in having a reputation if you can\u0027t ruin it every now and then?\"\n \"Don\u0027t try and make me feel better, Alex. I hate you.\"\n \"I hate you, too. Now please move out of the way so the janitor doesn\u0027t have to spend all day moppin\u0027 up my blood. He\u0027s a relative, you know.\"\n She shakes her head, not believing for an instant the head janitor at Fairfield is a relative. Okay, so he isn\u0027t exactly a relative. But he does have family in Atencingo, the same small town where my mom has cousins in Mexico.\n Instead of moving out of the way, my chem partner opens the door to the nurse\u0027s office for me. I think she\u0027s functioning even if her hands are still shaking.\n \"He\u0027s bleeding,\" she calls out to Miss Koto, the school nurse.\n Miss Koto has me sit down on one of the examining tables. \"What happened here?\"\n I look over at Brittany. She has a worried look on her face, as if she\u0027s concerned I might croak right here. I hope to God that\u0027s what the Angel of Death looks like before I kick the bucket. I\u0027d be more than happy to go to hell if a face like Brittany\u0027s was greeting me.\n \"My staples opened up,\" I say. \"No big deal.\"\n \"And how did that happen?\" Miss Koto asks as she wets a white cloth and dabs it on my arm. I hold my breath, waiting for the stinging to recede. I\u0027m also not about to narc on my partner, especially since I\u0027m trying to seduce her.\n \"I hit him,\" Brittany says, her voice hitching.\n Miss Koto turns around, stunned. \"You hit him?\"\n \"By accident,\" I chime in, not having a clue why I suddenly want to protect this girl who hates me and would probably rather flunk Mrs. P.\u0027s class than have to partner with me.\n My plans with Brittany are not working. The only feeling she\u0027s admitted to having toward me is hatred. But the thought of Lucky on my motorcycle is more painful than the antiseptic crap Miss Koto is now rubbing on my wound.\n I\u0027ve got to get Brittany alone if I\u0027m gonna have any chance of saving face and saving my Honda. Does her freakout session mean she really doesn\u0027t hate me? I\u0027ve never seen that girl do anything not scripted or 100 percent intentional. She\u0027s a robot. Or so I thought. She\u0027s always looked and acted like a princess on camera every time I\u0027ve seen her. Who knew it\u0027d be my bloody arm that would crack her.\n I look over at Brittany. She\u0027s focused on my arm and Miss Koto\u0027s ministrations. I wish we were back in the library. I could swear back there she was thinking about getting it on with me.\n I\u0027m sporting la tengo dura right here in front of Miss Koto just thinking about it. Gracias a Dios the nurse walks over to the medicine cabinet, Where\u0027s a large chem book when you need one?\n \"Let\u0027s hang Thursday after school. You know, to work on the outline,\" I tell Brittany for two reasons. First, I need to stop thinking about getting naked with her in front of Miss Koto. Second, I want Brittany to myself.\n \"I\u0027m busy Thursday,\" she says.\n Probably with Burro Face. Obviously she\u0027d rather be with that pendejo than me.\n \"Friday, then,\" I say, testing her although I probably shouldn\u0027t. Testing a girl like Brittany could put a serious damper on my ego. Although I caught her at a time when she\u0027s vulnerable and still shaking from seeing my blood. I admit I\u0027m a manipulative asshole.\n She bites her bottom lip that she thinks is glossed with the wrong color. \"I can\u0027t Friday, either.\" My hard-on is officially deflated. \"What about Saturday morning?\" she says. \"We can meet at the Fairfield Library.\"\n \"You sure you can pencil me into your busy schedule?\"\n \"Shut up. I\u0027ll meet you there at ten.\"\n \"It\u0027s a date,\" I say while Miss Koto, obviously eavesdropping, finishes wrapping my arm with dorky gauze.\n Brittany gathers her books. \"It\u0027s not a date, Alex,\" she says over her shoulder.\n I grab my book and hurry into the hallway after her. She\u0027s walking alone. The loudspeaker music isn\u0027t playing so class is still on.\n \"It might not be a date, but you still owe me a kiss. I always collect debts.\" My chem partner\u0027s eyes go from dull to shining mad and full of fire. Mmm, dangerous. I wink at her. \"And don\u0027t sweat about what lip gloss to wear on Saturday. You\u0027ll just have to reapply it after we make out.\"\n CHAPTER 15 Brittany\n One thing in life is certain--I am not making out with Alex Fuentes.\n Thankfully Mrs. Peterson had us busy doing experiments all week, giving us no time to talk except about who\u0027s going to light the Bunsen burner. Although every time I looked at Alex\u0027s bandaged arm it reminded me of when I whacked him.\n I\u0027m trying not to think about him while I gloss my lips for my date with Colin. It\u0027s Friday night and we\u0027re going to dinner and a movie.\n After double-checking and triple-checking myself in the mirror, and attaching the Tiffany\u0027s bracelet he gave me for our anniversary last year, I head to the backyard, where my sister is in our pool with her physical therapist. My mom, wearing her pink velour cover-up, is lounging on a chaise reading some home-design magazine.\n It\u0027s pretty quiet, except for the physical therapist\u0027s voice instructing Shelley.\n Mom puts down her magazine, her face tight and stern. \"Brit, don\u0027t be out past ten thirty.\"\n \"We\u0027re seeing an eight-o\u0027clock movie, Mom. We\u0027ll be home after that.\"\n \"You heard what I said. No later than ten thirty. If you have to leave the movie early to get home on time, so be it. Colin\u0027s parents won\u0027t respect a girl without a curfew.\"\n Our doorbell rings. \"That\u0027s probably him,\" I say.\n \"You better hurry up and get it. A boy like that won\u0027t wait forever, you know.\"\n I rush to the front door before my mom does it for me and makes a fool out of both of us. Colin is standing on our front stoop with a dozen red roses in his hand.\n \"For you,\" he says, surprising me.\n Wow! I\u0027m feeling stupid for thinking about Alex so much this past week. I hug Colin and give him a kiss, a real one on the lips.\n \"Let me put these in water,\" I say, stepping back.\n I hum happily as I walk to the kitchen, smelling their sweet fragrance. Putting water in a vase, I wonder if Alex ever brought his girlfriend flowers. Alex probably brings his dates sharp knives as gifts, in case she\u0027ll need one when she\u0027s out on a date with him. Being with Colin is so . . .\n Boring?\n No. We\u0027re not boring. We\u0027re safe. Comfortable. Cute.\n After cutting the bottoms off the roses and placing them in the vase, I find Colin chatting with my mom on the patio, something I really don\u0027t want him doing.\n \"Ready?\" I say.\n Colin flashes me his super white million-dollar smile. \"Yep.\"\n \"Have her back by ten thirty,\" my mom calls out. As if a girl with a curfew equals high morals. It\u0027s ridiculous, but I look at Shelley and swallow my argument.\n \"Sure thing, Mrs. Ellis,\" Colin responds.\n When we\u0027re in his Mercedes, I ask, \"What movie are we seeing?\"\n \"Change in plans. My dad\u0027s firm got tickets to the Cubs game. In a suite right behind home plate. Baby, we\u0027re goin\u0027 to watch the Cubbies.\"\n \"How cool. Will we be back by ten thirty?\" Because I know without a doubt my mom will be waiting at the door for me.\n \"If they don\u0027t go into extra innings. Does your mom think you\u0027ll turn into a pumpkin or something?\"\n I take hold of his hand. \"No. It\u0027s just that, well, I don\u0027t want to upset her.\"\n \"No offense, but your mom is strange. She\u0027s a hot MILF, but totally off the wall.\"\n I take my hand back. \"Eww! Colin, you just called my mom a MILF! I\u0027m completely grossed out.\"\n \"Please, Brit.\" He glances in my direction. \"Your mom looks more like your twin sister than your mother. She\u0027s hot.\"\n She works out so much, I admit her body looks more like a thirty-year-old\u0027s than a forty-five-year-old\u0027s. But to think my boyfriend is hot for my mom is plain yuck.\n At the game, Colin leads me to his dad\u0027s corporate suite at Wrigley Field. The box is crowded with people from a bunch of downtown law firms. Colin\u0027s parents greet us. His mom hugs me and gives me an air-kiss before leaving us to mingle with other people.\n I watch as Colin talks with the other people in the suite. He\u0027s so at home here; he\u0027s in his element. He shakes hands, smiles wide, and laughs at everyone\u0027s jokes whether they\u0027re funny or not.\n \"Let\u0027s watch the game in the seats over there,\" he says, leading me to the suite\u0027s seats after we get hot dogs and drinks from the food bar.\n \"I\u0027m hoping to get an internship at Harris, Lundstrom, and Wallace next summer,\" he says quietly, \"so I gotta get face time with these guys.\"\n When Mr. Lundstrom appears next to us, Colin goes into full-on business mode. I watch in admiration as he talks with Mr. Lundstrom as if they\u0027re old friends. My boyfriend definitely has a knack for schmoozing people.\n \"I hear you want to follow in your father\u0027s footsteps,\" Mr. Lundstrom says.\n \"Yes, sir,\" Colin responds, then they start talking about football and stocks and whatever else Colin brings up to keep Mr. Lundstrom talking.\n Megan calls on my cell and I give her highlights of the game and we talk while I\u0027m waiting for Colin to finish talking to Mr. Lundstrom. She tells me she had the best time at this dance club called Club Mystique that will let in teens. She insists Sierra and I will love it there.\n At the seventh-inning stretch, Colin and I stand and sing \"Take Me Out to the Ball Game.\" We\u0027re totally out of tune, but it doesn\u0027t matter because right now it sounds as if the thousands of Cubs fans singing are as out of tune as we are. It feels good to be with Colin like this, having fun together. It makes me think I\u0027ve been overcritical of our relationship.\n At nine forty-five, I turn to Colin and tell him we need to start heading home even though the game isn\u0027t over.\n He takes my hand in his. I think he\u0027s going to excuse himself from his conversation with Mr. Lundstrom. Instead, Mr. Lundstrom calls over Mr. Wallace. \n","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-12.html","bookId":2767,"book":{"id":2767,"title":"Perfect Chemistry (Perfect Chemistry #1)","description":"Storyline: \n Perfect Chemistry (Perfect Chemistry #1) \n A fresh, urban twist on the classic tale of star-crossed lovers. \n When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created \u0027perfect\u0027 life is about to unravel before her eyes. She\u0027s forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she\u0027s worked so hard for: her flawless reputation, her relationship with her boyfriend, and the secret that her home life is anything but perfect. \n Alex is a bad boy and he knows it. So when he makes a bet with his friends to lure Brittany into his life, he thinks nothing of it. But soon Alex realizes Brittany is a real person with real problems, and suddenly the bet he made in arrogance turns into something much more. \n In a passionate story about looking beneath the surface, Simone Elkeles breaks through the stereotypes and barriers that threaten to keep Brittany and Alex apart.\n \n","cover":"https://allnovel.net/images/perfect-chemistry-perfect-chemistry-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:10:17 PM"}}
