{"id":86023,"no":29,"title":"Page 29","content":"Shit. If I hadn\u0027t gotten arrested in the first place, I wouldn\u0027t owe this debt to Hector. \"I know you won\u0027t disappoint me. By the way, how\u0027s your mother? I haven\u0027t seen her in a while.\" \"She\u0027s fine,\" I say, wondering what mi\u0027ama has to do with this conversation. \"Tell her I said hello, will ya?\" What the hell does that mean? Hector opens the door, motions for Chuy to follow him, and leaves me to stew over it. I sit back, staring at the closed door, and wonder if I have it in me to do a drug deal. If I want to keep my family safe, my choice has been made for me. CHAPTER 37 Brittany \"I can\u0027t believe you broke up with Colin.\" Sierra is painting her nails on my bed after dinner. \"I hope you don\u0027t live to regret your decision, Brit. You two have been together for so long. I thought you loved him. You broke his heart, you know. He called Doug crying.\" I sit up. \"I want to be happy. Colin doesn\u0027t make me happy anymore. He admitted to cheating on me over the summer with some girl he met. He had sex with her, Sierra.\" \"What? I can\u0027t believe it.\" \"Trust me. Colin and I were over when he went away for the summer. It just took me a while to realize we couldn\u0027t fake it anymore.\" \"So, did you move on to Alex? Colin thinks you\u0027re mixing more than just test tubes with your chem partner.\" \"No,\" I lie. Even though Sierra is my best friend, she holds the belief there\u0027s a definite social divide. While I want to tell her the truth, I can\u0027t. Not now. Sierra closes the bottle of nail polish and huffs. \"Brit, I\u0027m your best friend whether you want to believe it or not. You\u0027re lying to me. Admit it.\" \"What do you want me to say?\" I ask. \"Try the truth, for once. Geez, Brit. I understand you don\u0027t want Darlene to know shit because she\u0027s gone off the deep end emotionally. And I can understand you not wanting the triple M-factor knowing everything. But this is me. Your best friend. You know, the one who knows about Shelley and who has seen your mom go off on you.\" Sierra grabs her purse and shoves it onto her shoulder. I don\u0027t want her mad at me, but I want her to know where I\u0027m coming from. \"What if you want to tell Doug stuff? I don\u0027t want to put you in a situation where you have to lie to him.\" Sierra gives me a sneer that resembles the one I use all the time. \"Screw you, Brit. Thanks for making me feel like my best friend doesn\u0027t trust me.\" Before she leaves my room she turns back and says, \"You know how people have selective hearing? You have selective disclosure. I saw you having a major conversation with Isabel Avila today in the hall. If I didn\u0027t know better, I\u0027d say you were sharing secrets with her.\" She throws up her hands. \"Okay, so I admit I was jealous that my best friend is obviously sharing stuff with another friend and not me. When you realize I\u0027m rooting like hell for you to be happy, call me.\" She\u0027s right. But this thing with Alex is so new, and I\u0027m feeling vulnerable about it. Isabel is the only one who knows both me and Alex, so I went to her. \"Sierra, you\u0027re my best friend. You know that,\" I say, hoping she knows it\u0027s the truth. I might have trust issues, but that doesn\u0027t negate the fact that she\u0027s the closest friend I have. \"Then start acting like it,\" she says before leaving. I wipe a bead of sweat slowly dripping from my brow as I drive to meet Alex for the wedding. I picked a cream-colored, fitted sundress with spaghetti straps. My parents will be home when I get back, so I put a change of clothes inside my workout bag. My mom will see the Brittany she expects to see when I get home--a perfect daughter. Who cares if it\u0027s a facade as long as it keeps her happy. Sierra was right; I do have selective disclosure. My car rounds the corner, riding the path to the body shop. When I spot Alex leaning on his motorcycle waiting for me in the parking lot, my pulse skips a beat. Oh, boy. I\u0027m in trouble. Gone is his ever-present bandanna. Alex\u0027s thick black hair rests on his forehead, daring to be swept back. Black pants and a black silk shirt have replaced his jeans and T-shirt. He looks like a young Mexican daredevil. I can\u0027t help but smile as I park next to him. \"Querida, you look like you\u0027ve got a secret.\" I do, I think as I step out of my car. You. \"Dios mio. You look ... preciosa.\" I turn in a circle. \"Is this dress okay?\" \"Come here,\" he says, pulling me against him. \"I don\u0027t want to go to the wedding anymore. I\u0027d rather have you all to myself.\" \"No way,\" I say, running a slow finger along the side of his jaw. \"You\u0027re a tease.\" I love this playful side of Alex. It makes me forget all about those demons. \"I came to see a Latino wedding, and I expect to see one,\" I tell him. \"And here I thought you were comin\u0027 to be with me.\" \"You\u0027ve got a big ego, Fuentes.\" \"That\u0027s not all I\u0027ve got.\" He backs me against my car, his breath warming my neck more than the midday sun. I close my eyes and expect his lips on mine, but instead I hear his voice. \"Give me your keys,\" he says, reaching around and taking them from my hand. \"You\u0027re not going to throw them into the bushes, are you?\" \"Don\u0027t tempt me.\" Alex opens my car door and slides into the driver\u0027s seat. \"Aren\u0027t you going to invite me in?\" I ask, confused. \"No. I\u0027m parkin\u0027 your car in the shop so it doesn\u0027t get jacked. This is an official date. I\u0027m drivin\u0027.\" I point to his motorcycle. \"Don\u0027t think I\u0027m getting on that thing.\" His left eyebrow raises a fraction. \"Why not? Julio\u0027s not good enough for you?\" \"Julio? You named your motorcycle Julio?\" \"After my great uncle who helped my parents move here from Mexico.\" \"I like Julio just fine. I just don\u0027t want to ride on him wearing this short dress. Unless you want everyone riding behind us to see my undies.\" He rubs his chin, thinking about it. \"Now that would be a sight for sore eyes.\" I cross my arms over my chest. \"I\u0027m jokin\u0027. We\u0027re takin\u0027 my cousin\u0027s car.\" We get in a black Camry parked across the street. After driving a few minutes he pulls a cigarette from a pack lying on the dashboard. The click of the lighter makes me cringe. \"What?\" he asks, the lit cigarette dangling from his lips. He can smoke if he wants. This might be an official date, but I\u0027m not his official girlfriend or anything. I shake my head. \"Nothing.\" I hear him exhale, and the cigarette smoke burns my nostrils more than my mom\u0027s perfume. As I lower my window all the way, I suppress a cough. When he stops at a stoplight, he looks over at me. \"If you\u0027ve got a problem with me smokin\u0027, tell me.\" \"Okay, I\u0027ve got a problem with you smoking,\" I tell him. \"Why didn\u0027t you just say so?\" he says, then smashes it into the car\u0027s ashtray. \"I can\u0027t believe you actually like it,\" I say when he starts driving again. \"It relaxes me.\" \"Do I make you nervous?\" His gaze travels from my eyes to my breasts and down to where my dress meets my thighs. \"In that dress you do.\" CHAPTER 38 Alex If I keep looking at her long legs I\u0027m gonna have an accident. \"How\u0027s that sister of yours?\" I ask, changing the subject. \"She\u0027s waiting to beat you again at checkers.\" \"Is that right? Well, tell her I was goin easy on her. I was tryin\u0027 to impress you.\" \"By losing?\" I shrug. \"It worked, didn\u0027t it?\" I notice her fidgeting with her dress as if she needs to fix it to impress me. Wanting to ease her anxiety, I slide my fingers down her arm before capturing her hand in mine. \"You tell Shelley I\u0027ll be back for a rematch,\" I say. She turns to me, her blue eyes sparkling. \"Really?\" \"Absolutely.\" During the drive, I try and make small talk. It doesn\u0027t work. I\u0027m not a small talk kind of guy. It\u0027s a good thing Brittany seems content without talking. Before long I park in front of a small, two-story brick house. \"Isn\u0027t the wedding at a church?\" \"Not for Elena. She wanted to get married at her parents\u0027 house.\" I rest my hand on the small of her back as we walk up to the house. Don\u0027t ask me why I feel a need to claim her as mine. Maybe deep down I am a Neanerthal. When we enter the house, Mariachi music blares from the backyard and people fill up almost every inch of space. I check out Brittany\u0027s reaction, wondering if she feels like she\u0027s been magically transported to Mexico. My family doesn\u0027t live in big houses with swimming pools like she\u0027s used to. Enrique and a bunch of my other cousins yell greetings to us. They all speak Spanish, which would seem normal except that my date only speaks English. I\u0027m used to being kissed to death by my aunts and given hearty slaps on the backs by my uncles. I\u0027m not sure she is, though. I nudge Brittany closer to me as a sign that I haven\u0027t forgotten her, and attempt to introduce her to my family but give up when I realize there\u0027s no way she\u0027ll remember all their names. \";Ese!\" comes a voice from behind us. I turn to Paco. \"What\u0027s up?\" I say, slapping my friend on the back. \"Brittany, I\u0027m sure you\u0027ve seen mi mejor amigo around school. Don\u0027t worry, he knows not to tell anyone he saw you here.\" \"My lips are sealed,\" he says, then like a dork pretends to lock his mouth and toss the key away. \"Hi, Paco,\" she says, laughing. Jorge sidles up to us, wearing a white tuxedo and a red rose in his lapel. I slap my cousin-to-be on the back. \"Yo, man, you really do clean up nice.\" \"You don\u0027t look too bad yourself. You gonna introduce me to your friend, or not?\" \"Brittany, this is Jorge. He\u0027s the poor guy ... I mean, lucky guy, marrying my cousin Elena.\" Jorge hugs her. \"Any friend of Alex\u0027s is a friend of ours.\" \"Where\u0027s the bride?\" Paco asks. \"She\u0027s upstairs in her parents\u0027 bedroom, crying.\" \"From happiness?\" I guess. \"No, man. I went in there to give her a kiss and now she\u0027s thinkin\u0027 of callin\u0027 it off, says it\u0027s bad luck to see the groom before the wedding,\" Jorge adds, shrugging. \"Good luck,\" I say. \"Elena is superstitious. She\u0027ll probably make you do some crazy shit to make the bad luck go away.\" As Paco and Jorge contemplate what Elena will make him do to erase the bad luck, I take Brittany\u0027s hand and lead her outside. A live band is playing. Even though we\u0027re pochos, we definitely keep our traditions and culture close. Our food is spicy, our families are big and close, and we like to dance to music that makes our bodies move. \"Is Paco your cousin?\" Brittany asks. \"No, he just likes to think he is. Carlos, this is Brittany,\" I say when we reach my brother. \"Yeah, I know,\" Carlos says. \"Remember I saw you two swapping spit.\" Brittany is stunned into silence. \"Watch your mouth,\" I say, slapping Carlos on the back of the head. Brittany puts her hand on my chest. \"It\u0027s okay, Alex. You don\u0027t have to protect me from everyone.\" Carlos takes on a cocky stance. \"That\u0027s right, bro. You don\u0027t have to protect her. Well, maybe except from Mama.\"","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-29.html","bookId":2767,"book":{"id":2767,"title":"Perfect Chemistry (Perfect Chemistry #1)","description":"Storyline: Perfect Chemistry (Perfect Chemistry #1) A fresh, urban twist on the classic tale of star-crossed lovers. When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created \u0027perfect\u0027 life is about to unravel before her eyes. She\u0027s forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she\u0027s worked so hard for: her flawless reputation, her relationship with her boyfriend, and the secret that her home life is anything but perfect. Alex is a bad boy and he knows it. So when he makes a bet with his friends to lure Brittany into his life, he thinks nothing of it. But soon Alex realizes Brittany is a real person with real problems, and suddenly the bet he made in arrogance turns into something much more. In a passionate story about looking beneath the surface, Simone Elkeles breaks through the stereotypes and barriers that threaten to keep Brittany and Alex apart.","cover":"https://allnovel.net/images/perfect-chemistry-perfect-chemistry-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:10:17 PM"}}
