{"id":85998,"no":4,"title":"Page 4","content":"\"That\u0027s enough, Colin. Alex, sit down.\" Mrs. Peterson eyes the rest of the class. \"That goes for the rest of you, as well. I can\u0027t control what you do outside of this room, but in my class I\u0027m the boss.\" She turns back to Alex. \"Do I make myself clear?\" \"Si, senora,\" Alex says, deliberately slow. Mrs. Peterson goes down the rest of the list while I do everything in my power not to make eye contact with the guy sitting next to me. It\u0027s too bad I left my purse in my locker or I could pretend to look for nothing like Sierra did this morning. \"This sucks,\" Alex mumbles to himself. His voice is dark and husky. Does he make it that way on purpose? How am I going to explain to my mother I have to partner with Alex Fuentes? Oh, God, I hope she doesn\u0027t blame me somehow for screwing this up. I glance at my boyfriend, deep in conversation with Darlene. I\u0027m so jealous. Why couldn\u0027t my last name be Allis instead of Ellis so I could sit next to him? It\u0027d be cool if God gave everyone a Do Over Day and you could yell \"Do Over!\" and the day would start new. This would definitely qualify for a DOD. Does Mrs. Peterson actually think it\u0027s reasonable to pair the captain of the pom-pom squad with the most dangerous guy in school? The woman is delusional. Mrs. Delusional finally finishes assigning seats. \"I know you seniors think you know everything. But never think of yourself as a success until you can help treat diseases that plague mankind or make the earth a safer place to live. The field of chemistry plays a crucial role in developing medicines, radiation treatments for cancer patients, petroleum uses, the ozone--\" Alex raises his hand. \"Alex,\" the teacher says. \"Do you have a question?\" \"Uh, Mrs. Peterson, are you sayin\u0027 the president of the U.S. isn\u0027t a success?\" \"What I\u0027m saying is . . . money and status aren\u0027t everything. Use your brain and do something for mankind or the planet you live on. Then you\u0027re a success. And you\u0027ll have earned my respect, which not many people in this world can boast about.\" \"I got things I can boast about, Mrs. P.,\" Alex says, obviously amusing himself. Mrs. Peterson holds up a hand. \"Please spare us the details, Alex.\" I shake my head. If Alex thinks antagonizing the teacher will get us a good grade, he\u0027s sadly mistaken. It\u0027s obvious Mrs. Peterson doesn\u0027t like smart-asses and my partner is already on her radar. \"Now,\" Mrs. Delusional says, \"look at the person sitting next to you.\" Anything but that. But I don\u0027t have a choice. I glance over at Colin again, who seems pretty content with his assigned partner. Darlene already has a boyfriend or I seriously would be questioning why she\u0027s leaning a bit too close to Colin and flipping her hair back too many times. I tell myself I\u0027m being paranoid. \"You don\u0027t have to like your partner,\" Mrs. Peterson says, \"but you\u0027re stuck together for the next ten months. Take five minutes to get to know each other, then each of you will introduce your partner to the class. Talk about what you did over the summer, what hobbies you have, or anything else interesting or unique your classmates might not know about you. Your five minutes start now.\" I take out my notebook, flip to the first page, and shove it at Alex. \"Why don\u0027t you write down stuff about yourself in my notebook and I\u0027ll do the same in yours.\" It\u0027s better than trying to have a conversation with him. Alex nods in agreement, although I think I caught the corners of his mouth twitch as he hands me his notebook. Did I imagine that twitch or did it really happen? Taking a deep breath, I wipe that thought from my mind and write diligently until Mrs. Peterson instructs us to stop and listen to each other\u0027s introductions. \"This is Darlene Boehm,\" Colin begins, being the first to speak. But I don\u0027t hear the rest of Colin\u0027s speech about Darlene and her trip to Italy and her experience at dance camp this summer. Instead, I glance down at the notebook given back to me by Alex and stare at the words on the page with my mouth open. CHAPTER 6 Alex Okay, so I shouldn\u0027t have fucked with her on the introduction thing. Writing nothing except, Saturday night. You and me. Driving lessons and hot sex ... in her notebook probably wasn\u0027t the smartest move. But I was itching to make Little Miss Perfecta stumble in her introduction of me. And stumbling she is. \"Miss Ellis?\" I watch in amusement as Perfection herself looks up at Peterson. Oh, she\u0027s good. This partner of mine knows how to hide her true emotions, something I recognize because I do it all the time. \"Yes?\" Brittany says, tilting her head and smiling like a beauty queen. I wonder if that smile has ever gotten her out of a speeding ticket. \"It\u0027s your turn. Introduce Alex to the class.\" I lean an elbow on the lab table, waiting for an introduction she has to either make up or fess up she knows less than crap about me. She glances at my comfortable position and I can tell from her deer-in-the-headlights look I\u0027ve stumped her. \"This is Alejandro Fuentes,\" she starts, her voice hitching the slightest bit. My temper flares at the mention of my given name, but I keep a cool facade as she continues with a made-up introduction. \"When he wasn\u0027t hanging out on street corners and harassing innocent people this summer, he toured the inside of jails around the city, if you know what I mean. And he has a secret desire nobody would ever guess.\" The room suddenly becomes quiet. Even Peterson straightens to attention. Hell, even I\u0027m listening like the words coming out of Brittany\u0027s lying, pink-frosted lips are gospel. \"His secret desire,\" she continues, \"is to go to college and become a chemistry teacher, like you, Mrs. Peterson.\" Yeah, right. I look over at my friend Isa, who seems amused that a white girl isn\u0027t afraid of giving me smack in front of the entire class. Brittany flashes me a triumphant smile, thinking she\u0027s won this round. Guess again, gringa. I sit up in my chair while the class remains silent. \"This is Brittany Ellis,\" I say, all eyes now focused on me. \"This summer she went to the mall, bought new clothes so she could expand her wardrobe, and spent her daddy\u0027s money on plastic surgery to enhance her, ahem, assets.\" It might not be what she wrote, but it\u0027s probably close enough to the truth. Unlike her introduction of me. Chuckles come from mis cuates in the back of the class, and Brittany is as stiff as a board beside me, as if my words hurt her precious ego. Brittany Ellis is used to people fawning all over her and she could use a little wake-up call. I\u0027m actually doing her a favor. Little does she know I\u0027m not finished with her intro. \"Her secret desire,\" I add, getting the same reaction as she did during her introduction, \"is to date a Mexicano before she graduates.\" As expected, my words are met by comments and low whistles from the back of the room. \"Way to go, Fuentes,\" my friend Lucky barks out. \"I\u0027ll date you, mamacita,\" another says. I give a high five to another Latino Blood named Marcus sitting behind me just as I catch Isa shaking her head as if I did something wrong. What? I\u0027m just having a little fun with a rich girl from the north side. Brittany\u0027s gaze shifts from Colin to me. I take one look at Colin and with my eyes tell him game on. Colin\u0027s face instantly turns bright red, resembling a chile pepper. I have definitely invaded his territory. Good. \"Quiet down, class,\" Peterson says sternly. \"Thank you for those very creative and . . . enlightening introductions. Miss Ellis and Mr. Fuentes, please see me after class.\" \"Your introductions were not only appalling, they were disrespectful to me and the rest of your classmates,\" Peterson says after class as Brittany and I stand in front of her desk. \"You have a choice.\" Our teacher holds out two blue detention slips in one hand and two pieces of notebook paper in the other. \"You can either serve detention today after school or write a five-hundred-word essay on \u0027respect\u0027 to hand in tomorrow. Which is it?\" I reach over and grab the detention slip. Brittany reaches out for the notebook paper. Figures. \"Do either of you have a problem with the way I assign chemistry partners?\" Peterson asks. Brittany says, \"Yes,\" at the same time I say, \"Nope.\" Peterson sets her glasses on her desk. \"Listen, you two better work out your differences before this year is up. Brittany, I won\u0027t be assigning you a different partner. You\u0027re both seniors and will have to deal with a plethora of people and personalities after you graduate. If you don\u0027t want to go to summer school for flunking my class, I suggest you work together instead of against each other. Now hurry to your next class.\" With that, I follow my little chem partner out of the room and down the hall. \"Stop following me,\" she snaps, looking over her shoulder to check how many people are watching us walk down the hall together. As if I\u0027m el diablo himself. \"Wear long sleeves on Saturday night,\" I tell her, knowing full well she\u0027s reaching the end of her sanity rope. I usually don\u0027t try to get under the skin of white chicks, but this one is fun to rattle. This one, the most popular and coveted one of all, actually cares. \"It gets pretty cold on the back of my motorcycle.\" \"Listen, Alex,\" she says, whipping herself around and tossing that sun-kissed hair over her shoulder. She faces me with clear eyes made of ice. \"I don\u0027t date guys in gangs, and I don\u0027t use drugs.\" \"I don\u0027t date guys in gangs, either,\" I say, stepping closer to her. \"And I\u0027m no user.\" \"Yeah, right. I\u0027m surprised you\u0027re not in rehab or some juvie boot camp.\" \"You think you know me?\" \"I know enough.\" She folds her arms across her chest, but then looks down as if she realizes her stance makes her chichis stand out, and drops her hands to her sides. I\u0027m doing my best not to focus on those chichis as I take a step forward. \"Did you report me to Aguirre?\" She takes a step back. \"What if I did?\" \"Mujer, you\u0027re afraid of me.\" It\u0027s not a question. I just want to hear from her own lips what her reason is. \"Most people at this school are scared that if they look at you wrong, you\u0027ll gun them down.\" \"Then my gun should be smokin\u0027 by now, shouldn\u0027t it? Why aren\u0027t you runnin\u0027 away from the badass Mexicano, huh?\" \"Give me half a chance, I will.\" I\u0027ve had enough of dancing around this little bitch. It\u0027s time to fluff up those feathers to make sure I end up with the upper hand. I close the distance between us and whisper in her ear, \"Face the facts. Your life is too perfect. You probably lie awake at night, fantasizing about spicin\u0027 up all that lily whiteness you live in.\" But damn it, I get a whiff of vanilla from her perfume or lotion. It reminds me of cookies. I love cookies, so this is not good at all. \"Gettin\u0027 near the fire, chica, doesn\u0027t necessarily mean you\u0027ll get burned.\" \"You touch her and you\u0027ll regret it, Fuentes,\" Colin\u0027s voice rings out. He resembles a burro, with his big white teeth and ears sticking out from his buzz cut. \"Get the hell away from her.\" \"Colin,\" Brittany says. \"It\u0027s okay. I can handle this.\" Burro Face brought reinforcements: three other pasty white dudes, standing behind him for backup. I size up Burro Face and his friends to see if I can take them all on, and decide I could give all four a run for their money. \"When you\u0027re strong enough to play in the big leagues, jock boy, then I\u0027ll listen to the mierda flyin\u0027 out of your mouth,\" I say.","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-4.html","bookId":2767,"book":{"id":2767,"title":"Perfect Chemistry (Perfect Chemistry #1)","description":"Storyline: Perfect Chemistry (Perfect Chemistry #1) A fresh, urban twist on the classic tale of star-crossed lovers. When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created \u0027perfect\u0027 life is about to unravel before her eyes. She\u0027s forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she\u0027s worked so hard for: her flawless reputation, her relationship with her boyfriend, and the secret that her home life is anything but perfect. Alex is a bad boy and he knows it. So when he makes a bet with his friends to lure Brittany into his life, he thinks nothing of it. But soon Alex realizes Brittany is a real person with real problems, and suddenly the bet he made in arrogance turns into something much more. In a passionate story about looking beneath the surface, Simone Elkeles breaks through the stereotypes and barriers that threaten to keep Brittany and Alex apart.","cover":"https://allnovel.net/images/perfect-chemistry-perfect-chemistry-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:10:17 PM"}}
