{"id":86000,"no":6,"title":"Page 6","content":"Darlene stands with her hands on her hips. \"Well, that was until he called and said all the pledges in the fraternity had to sleep at the frat house for some crazy initiation thing. As long as Tyler\u0027s penis is intact when it\u0027s all over, I\u0027m happy.\"\n At the mention of \"penis,\" I search for my keys in my purse. When Darlene gets to talking about penises and sex, stand back because she never stops. And since I\u0027m not one to share my sexual experiences (or lack thereof), I\u0027m out of here. A perfect time to escape.\n As I dangle my keys on my fingers, Sierra tells me she\u0027ll get a ride from Doug, so I\u0027m alone during the drive home. I like being alone. Nobody to put on an act for. I can even blast the music if I want.\n Enjoying the music is short-lived, though, when I feel my phone vibrate. I pull my cell out of my pocket. Two voice messages and one text message. All from Colin.\n I call him on his cell. \"Brit, where are you?\" he asks.\n \"On my way home.\"\n \"Come over to Doug\u0027s.\"\n \"My sister has a new caretaker,\" I explain. \"I have to help her out.\"\n \"Are you still pissed because I threatened your gangbanger chemistry partner?\"\n \"I\u0027m not pissed. I\u0027m annoyed. I told you I could handle it and you totally ignored me. And you caused a whole scene in the hallway. You know I didn\u0027t ask to be partners with him,\" I tell Colin.\n \"I know, Brit. I just hate that guy. Don\u0027t be mad.\" \"I\u0027m not,\" I say. \"I just hate seeing you get all riled up for no reason.\" \"And I hated seeing that guy whispering in your ear.\" I feel a headache coming on, full force. I don\u0027t need Colin to make a scene every time a guy so much as talks to me. He\u0027s never done that before and it left me open for more scrutiny and gossip, something I never want to happen. \"Let\u0027s just forget it ever happened.\"\n \"Fine by me. Call me tonight,\" he says. \"But if you can get out early and can come to Doug\u0027s, I\u0027ll be there.\"\n When I get home, Baghda is in Shelley\u0027s room on the first floor. She\u0027s attempting to change her special leak-proof undergarments, but she has Shelley in the wrong position. Her head is usually where her feet are, one leg is dangling off the bed . . . it\u0027s a disaster and Baghda is huffing and puffing as if it\u0027s the most difficult task she\u0027s ever attempted. Did my mom check her credentials?\n \"I\u0027ll do it,\" I tell Baghda, pushing her aside and taking over. I\u0027ve changed my sister\u0027s underwear since we were kids. It\u0027s not fun changing the undergarments of a person who weighs more than you do, but if you do it right it doesn\u0027t take long and it doesn\u0027t become a big, drawn-out deal.\n My sister smiles wide when she sees me. \"Bwiee!\" My sister can\u0027t enunciate words, but she uses verbal approximations. \"Bwiee\" means \"Brittany,\" and I smile back while situating her better on her bed. \"Hey, girlie girl. You hungry for dinner?\" I ask as I pull wipes from the container and try not to think about the task I\u0027m doing.\n As I slip new leak-proof underwear on her and slide her legs into a fresh pair of sweats, Baghda watches from the sidelines. I try explaining while doing the task, but one glance at Baghda and I can tell she\u0027s not listening.\n \"Your mother said I can leave when you got home,\" Baghda says.\n \"That\u0027s fine,\" I say as I wash my hands, and before I know it Baghda has Houdini\u0027d on me.\n I wheel Shelley into the kitchen. Our usually pristine kitchen is a disaster. Baghda hasn\u0027t cleaned up the dishes, which are now piled in the sink, and she didn\u0027t do such a hot job of wiping the floor after Shelley\u0027s earlier mess.\n I prepare Shelley\u0027s dinner and wipe up the mess.\n Shelley drawls out the word \"school,\" which really sounds like \"cool,\" but I know what she means.\n \"Yeah, it was my first day back,\" I tell her as I blend her food and set it on the table. I spoon soupy food into her mouth while I keep talking. \"And my new chemistry teacher, Mrs. Peterson, should be a boot camp instructor. I scanned the syllabus. The woman can\u0027t go a week without scheduling a test or a quiz. This year isn\u0027t going to be easy.\"\n My sister looks at me, decoding what I\u0027ve told her. Her intense expression says she\u0027s giving me support and understanding without having to say the words. Because every word that comes out of her mouth is a struggle. Sometimes I want to say the words for her because I feel her frustration as if it\u0027s my own.\n \"You didn\u0027t like Baghda?\" I ask quietly.\n My sister shakes her head. And she doesn\u0027t want to talk about it; I can tell by the way she tenses her mouth.\n \"Be patient with her,\" I tell her. \"It\u0027s not easy coming into a new house and not knowing what to do.\"\n When Shelley finishes eating, I bring her magazines so she can scan them. My sister loves magazines. While she\u0027s busy flipping pages, I stick some cheese between two slices of bread for my own dinner then sit at the table to start my homework while I eat.\n I hear the garage door open just as I pull out the notebook paper Mrs. Peterson gave me to write my \"respect\" paper.\n \"Brit, where are you?\" my mom yells from the foyer.\n \"In the kitchen,\" I call out.\n My mom saunters into the kitchen with a Neiman Marcus bag on her arm. \"Here, this is for you.\"\n I reach in the bag and pull out a light blue Geren Ford designer top. \"Thanks,\" I say, not making a big deal about it in front of Shelley, who didn\u0027t get anything from my mom. Not that my sister cares. She\u0027s too focused on the best- and worst-dressed pictures of celebrities and all their shiny jewelry.\n \"It\u0027ll go with those dark denims I bought you last week,\" she says as she pulls out frozen steaks from the freezer and starts defrosting them in the microwave. \"So . . . how was everything with Baghda when you got home?\"\n \"Not the best,\" I tell her. \"You really need to train her.\" I\u0027m not surprised she doesn\u0027t respond.\n My dad walks through the door a minute later, grumbling about work. He owns a computer chip manufacturing company and has prepped us that this is a lean year, but my mom still goes out and buys stuff and my dad still bought me a BMW for my birthday.\n \"What\u0027s for dinner?\" my dad asks as he loosens his tie. He looks tired and worn, as usual.\n My mom glances at the microwave. \"Steak.\"\n \"I\u0027m not in the mood for heavy food,\" he says. \"Just something light.\"\n My mom turns off the microwave in a huff. \"Eggs? Spaghetti?\" she says, listing suggestions to deaf ears.\n My dad walks out of the kitchen. Even when he\u0027s physically here, his mind is still on the job. \"Whatever. Just something light,\" he calls out.\n It\u0027s times like these I feel sorry for my mom. She doesn\u0027t get much attention from my dad. He\u0027s either working or on a business trip or just plain doesn\u0027t want to deal with us. \"I\u0027ll make a salad,\" I tell her as I pull lettuce out of the fridge.\n She seems thankful, if her small smile is any indication, for the help. We work side-by-side in silence. I set the table while my mom brings the salad, scrambled eggs, and toast to the table. She mumbles complaints about not being appreciated, but I figure she wants me to listen and not say anything. Shelley is still busy looking at her magazines, oblivious to the tension between my parents.\n \"I\u0027m going to China on Friday for two weeks,\" my dad announces as he comes back to the kitchen in sweatpants and a T-shirt. He plops himself down at his usual spot at the head of the table and spoons eggs onto his plate. \"Our supplier there is shipping defective material and I\u0027ve got to find out what the deal is.\"\n \"What about the DeMaio wedding? It\u0027s this weekend and we already RSVP\u0027d.\"\n My dad drops his fork and looks at my mom. \"Yeah, I\u0027m sure the DeMaios\u0027 kid\u0027s wedding is more important than keeping my business afloat.\"\n \"Bill, I didn\u0027t insinuate your business is less important,\" she says, dropping her own fork on her plate. It\u0027s a wonder our plates don\u0027t have permanent chips in them. \"It\u0027s just rude to cancel these things at the last minute.\"\n \"You can go by yourself.\"\n \"And have rumors start because you\u0027re not accompanying me? No thank you.\"\n This is typical Ellis dinner conversation. My dad saying how hard work is, my mom trying to keep up the facade that we\u0027re a happy-go-lucky family, and me and Shelley quiet on the sidelines.\n \"How was school?\" my mom finally asks me.\n \"Okay,\" I say, omitting the fact that I got stuck with Alex as a partner. \"I got a really tough teacher for chemistry.\"\n \"You probably shouldn\u0027t have taken chemistry,\" my dad chimes in. \"If you don\u0027t get an A, your GPA\u0027ll go down. Northwestern is a tough school to get into, and they won\u0027t give you a break just because it\u0027s my alma mater.\"\n \"I got it, Dad,\" I say, totally depressed now. If Alex isn\u0027t serious about our project, how am I going to get an A on it?\n \"Shelley had a new caretaker start today,\" my mom informs him. \"Remember?\"\n He shrugs because the last time a caretaker quit, he insisted Shelley should live in some facility instead of at home. I never remember screaming so much as I did then, because I\u0027m never letting them send Shelley to a place where they\u0027ll neglect my sister and not understand her. I need to keep an eye on her. That\u0027s why it\u0027s so important for me to get into Northwestern. If I\u0027m close to home, then I can live here and make sure my parents don\u0027t send her away.\n At nine Megan calls to complain about Darlene. She thinks Dar-lene changed over the summer and now has a big ego because she\u0027s dating a college guy. At nine thirty Darlene calls to say she suspects Megan is jealous because she\u0027s dating a guy in college. At nine forty-five Sierra calls to tell me she talked to both Megan and Darlene tonight and she doesn\u0027t want to get in the middle of it. I agree, although I think we already are.\n It\u0027s ten forty-five before I finally finish the respect paper for Mrs. Peterson and help my mom put Shelley to bed. I\u0027m so exhausted my head feels as if it\u0027s about to fall off.\n Sliding into bed after I\u0027ve changed into my pj\u0027s, I dial Colin\u0027s number.\n \"Hey, babe,\" he says. \"What\u0027re you up to?\"\n \"Not much. I\u0027m in bed. Did you have fun at Doug\u0027s?\"\n \"Not as much fun as I would\u0027ve had if you were there.\"\n \"When did you get back?\"\n \"About an hour ago. I\u0027m so glad you called.\"\n I pull my big pink comforter up to my chin and sink my head into my fluffy down pillow. \"Oh, really?\" I say, fishing for a compliment and speaking with my flirty voice. \"Why?\"\n He hasn\u0027t told me he loves me in a long time. I know he\u0027s not the most affectionate person in the world. My dad isn\u0027t, either. I need to hear it from Colin. I want to hear he loves me. I want to hear he missed me. I want to hear him say I\u0027m the girl of his dreams.\n Colin clears his throat. \"We\u0027ve never had phone sex.\"\n Okay, those so aren\u0027t the words I expected. I shouldn\u0027t be disappointed or surprised. He\u0027s a teenage guy and I know guys are focused on sex and fooling around. This afternoon I pushed away the feeling in the pit of my stomach when I read Alex\u0027s words about having hot sex. Little does he know I\u0027m a virgin.\n Colin and I have never had sex, period. Phone sex or real sex. We got close in April last year at the beach behind Sierra\u0027s house, but I chickened out. I wasn\u0027t ready. \n","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-6.html","bookId":2767,"book":{"id":2767,"title":"Perfect Chemistry (Perfect Chemistry #1)","description":"Storyline: \n Perfect Chemistry (Perfect Chemistry #1) \n A fresh, urban twist on the classic tale of star-crossed lovers. \n When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created \u0027perfect\u0027 life is about to unravel before her eyes. She\u0027s forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she\u0027s worked so hard for: her flawless reputation, her relationship with her boyfriend, and the secret that her home life is anything but perfect. \n Alex is a bad boy and he knows it. So when he makes a bet with his friends to lure Brittany into his life, he thinks nothing of it. But soon Alex realizes Brittany is a real person with real problems, and suddenly the bet he made in arrogance turns into something much more. \n In a passionate story about looking beneath the surface, Simone Elkeles breaks through the stereotypes and barriers that threaten to keep Brittany and Alex apart.\n \n","cover":"https://allnovel.net/images/perfect-chemistry-perfect-chemistry-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:10:17 PM"}}
