{"id":94914,"no":31,"title":"Page 31","content":"\\n\\n I\u0027m running, my arms pumping, gripping the ax tightly. The storm rages around me and I can hear the crash of trees, the sound of branches being tossed in the wind. I can\u0027t tell if the noises surrounding me belong to Unconsecrated. I keep my eyes glued on the ground in front of me, trying to look through the shiny darkness for anything that will cause me to fall. That will make me weak. Or a target.\\n\\n I\u0027ve gone fifty paces before I allow myself to breathe, to allow hope to squeeze fear out of my heart. I realize I\u0027m actually going to make it. Then the crashes around me grow more intense and I realize that even though I\u0027m covered in muck and mud the Unconsecrated still scent me. And then I remember my knee. Remember falling, the sharp pain, the blood.\\n\\n They track me now, the tang of blood oozing through the rain-soaked night. I can hear their moans. Hear their echoes. My mind begins to scream at me to turn back while there is still time. To race back to the gate. To choose a life with Harry and return to our village.\\n\\n But instead I push on. The moist air sears my throat and my lungs scream. The muscles in my legs burn and already I feel myself grow weak. The lack of food and racing from the fire over the last few days taking over.\\n\\n I grow careless, my arms flailing around me, the ax handle slick in my hand. I feel broken fingers wrap around my wrist and I pull back and shriek. Everywhere I look now I see them coming out of the darkness.\\n\\n I am surrounded by Unconsecrated.\\n\\n I have to force myself not to panic. Instead, I grasp the ax with both hands and begin to swing, running through the clearing that my weapon creates. Flesh falls around me, the squelch of steel meeting putrefaction mixing with the sound of the rain beating the ground, of my feet slipping in the mud.\\n\\n But it\u0027s not enough.\\n\\n I stumble. Hands grasp at my feet. I roll onto my back. I swing. My arm muscles scream at the effort. I dig my feet in, trying to push myself back along the sodden ground. Everywhere, they are everywhere.\\n\\n I am stuck in the mulch of leaves and limbs and sodden earth, my body pulled down by suction. I cannot escape. I am lost. Finally, the Forest, the inevitability of it all, has won.\\n\\n And then I can hear the screams. Not of terror but of rage. I hear the voice telling me to run and suddenly the Unconsecrated are gone. A hand reaches down, drags me to my feet. Presses me onward.\\n\\n It\u0027s Jed and he swings his blade alongside me.\\n\\n A new sound emerges through the Forest: the sound of racing water.\\n\\n “This way,” I tug at Jed, pulling him toward me as we run in the direction of the sound. And suddenly, the ground slopes sharply away beneath us and we cling to each other as we tumble down a steep incline. I drop my ax and use both hands to halt my fall, scrabbling at the muddled earth. I dig my toes and elbows and knees into the ground, branches digging into the soft skin of the underside of my arms, pebbles scraping the flesh from my legs and a bramble pulling at my cheek. Finally, I come to a stop.\\n\\n I take a deep breath, almost choking on the rain. My body throbs in too many places to count.\\n\\n All I want to do is rest here, determine how badly I\u0027ve been injured by the fall. But then I hear the moans and the water raging even nearer and I push myself to my knees.\\n\\n I look up and see the horde of Unconsecrated at the top of the hill, watch as they tumble down after us. They slide around me, their arms out and mouths open.\\n\\n With so many bodies it\u0027s impossible to find Jed. I begin to scream his name, terrified.\\n\\n Finally, I see him. He\u0027s looking at me, standing where he slid to a stop. Just at that moment a large Unconsecrated man careens down the slick hill, colliding full-force with him.\\n\\n I see Jed flip through the air and land on his back with a thud. I begin to sprint. The Unconsecrated man recovers his balance as my feet slip, getting stuck in the muck. I can\u0027t find my ax so I grab a branch to fend off the Unconsecrated that crawl around me.\\n\\n “Jed!” I shout, “I\u0027m coming, Jed, hold on!”\\n\\n My eyes fill with useless tears, blinding me. I swipe at them with my arm but that only makes the problem worse as mud coats my eyelashes.\\n\\n Jed isn\u0027t moving. The Unconsecrated man crawls closer. He\u0027s leaning over Jed as I approach. I\u0027m screaming now, hoping to distract the Unconsecrated, hoping to keep him from biting my brother.\\n\\n He bends his head down and I throw the heavy branch I\u0027m holding at him. It careens off his head and he glances at me. For a moment I think I\u0027ve won. I think that I\u0027ve enticed him enough.\\n\\n But then, with the ferocity of a feral animal, he hunches over Jed and lowers his head.\\n\\n I trip then and fall to one knee, the knee I had hit earlier. Pain explodes behind my eyes.\\n\\n I feel a hand scrabble at my back and I turn and punch a female Unconsecrated with all my might. She staggers back. Long enough for me to realize that I tripped over Jed\u0027s scythe.\\n\\n I wrap my fingers around its smooth wooden handle, remembering the heft of it from when I used it to kill Travis, and swing. I take out the Unconsecrated woman and then I stumble toward Jed and swing at the Unconsecrated man.\\n\\n It is a messy death and I have no idea if he\u0027s bitten Jed. Blood is everywhere, cuts on our arms, faces and legs from our fall down the hill. He is still not conscious but his chest rises and falls.\\n\\n I tug at him, shake his shoulder. But a pair of Unconsecrated children advance on us. I leave Jed and approach them, my fingers loose around the hilt of the scythe. The Unconsecrated have no avarice, no skill in the hunt. Their only strength is numbers, wearing down the living. And so the two children shamble toward me and it is easy to swipe the blade at them. To watch as it cleaves through the skulls and they each drop, a pile of clothes surrounding desiccated flesh.\\n\\n “Come on, Jed,” I say. I get back to his side and begin to tug at his arms. “We have to move!”\\n\\n He opens his eyes again but can\u0027t get his legs under his body. His movements are slow, uncoordinated. I keep pulling at his arms, bracing myself in the mud, slipping too much to get us anywhere.\\n\\n More Unconsecrated advance on us and I leave him to keep fighting. It\u0027s a never-ending stream of them. I look up to the top of the hill to see even more sliding down.\\n\\n And I am certain that this is how I will die. That I have chosen wrong. That this was not the path I was supposed to take. The gate was nothing more than a gate. It was not an answer.\\n\\n There are too many Unconsecrated bearing down on us. Too many for me to defend against.\\n\\n Chapter 35\\n\\n A hand grasps at my waist and I\u0027m about to swing when I realize that it\u0027s Jed. The blade barely stops before it would have split his throat. He is hunched over, his face pinched with pain.\\n\\n “This way,” he says. I look back over my shoulder, see the horde bearing down on us. It\u0027s too dark to see how many but I know it\u0027s enough to overwhelm us. “There\u0027s a river nearby,” he says. “We\u0027ll be safer there.”\\n\\n I nod and he leads the way, limping. I try to hold him up, to help him, but my own feet lose purchase and I constantly slip.\\n\\n The roar of the water pounds in my ears and eventually Jed slows, sliding his feet out as if he\u0027s probing for something.\\n\\n “We have to move faster,” I tell him. “They\u0027re getting too close again.”\\n\\n He holds a hand up and I am quiet.\\n\\n “Here,” he says, and I\u0027m about to walk past him to see what he\u0027s pointing out and he pulls me back at the last moment, just as I feel my right foot slipping into nothingness.\\n\\n He kneels and I follow suit. Both of us scoot forward and then I feel the emptiness with my own hands. There\u0027s a canyon, cut by the river. Just up the river I can see a massive waterfall, churning and throwing debris into the darkness. The roar of the water is deafening now, fed by the storm. Waves glint below, the river frothy, foamy, hungry.\\n\\n I\u0027m terrified looking down on it, my fingers digging into the mud. Jed swings one foot over the edge of the cliff near the falls.\\n\\n I grab his hand. “What are you doing?” I ask. My voice cracks from the strain.\\n\\n “It\u0027s too high to jump,” he tells me. “There might be rocks we can\u0027t see. We have to climb down.”\\n\\n I\u0027m already shaking my head. “The ground is too soft, we\u0027ll never make it.”\\n\\n He grabs my hand, pulls me over the side and wraps my fingers around something firm and slick with rain. “Roots,” he tells me. “We can use them like rope. Be careful of the rocks,” he adds, “the rain may have loosened them.”\\n\\n I\u0027m still unsure. I can\u0027t climb with the scythe and I\u0027m unwilling to let it go. But then the Unconsecrated horde descends on us and Jed pulls me over the edge before the first one can get me and I drop the weapon into the darkness below as I clamber for purchase in the soft earth.\\n\\n They begin to fall around us, bumping us, grabbing at us as they tumble down the side of the cliff.\\n\\n “Hold on!” Jed yells. The stream of Unconsecrated bodies does not stop, their arms reaching for us as they slip past, forcing us to climb lower. We shuffle down until I find a little overhang that protects me from the falling bodies.\\n\\n I don\u0027t hear them as they crash into the water but I don\u0027t dare look down.\\n\\n Jed joins me on my tiny ledge and together we press ourselves into the side of the earth wall, digging our fingers into the mud, grasping at the roots and brush.\\n\\n The rain still beats on our backs, the thunder mixing with the sound of the rapids and echoing around us. In the flashes of lightning I can see the Unconsecrated thrashing in the water so far below.\\n\\n I realize that Jed has been talking to me and I have to strain to hear his voice.\\n\\n “—sorry, Mary.”\\n\\n “What?” I yell at him.\\n\\n “I said I\u0027m sorry,” he says. And this time I hear him.\\n\\n “Why did you come through the gate?” I ask.\\n\\n “Because I\u0027m your big brother.” He smiles, then laughs. “And I want to believe in hope.” I cannot help but smile a little as well. At the two of us stuck here on the side of a cliff during a storm, unable to see anything around us but Unconsecrated that fall with the rain.\\n\\n For a moment it\u0027s just the two of us, the way it used to be back before there was Beth or Harry or Travis. Before our father and mother turned and we turned on each other.\\n\\n “Thank you,” I say.\\n\\n He\u0027s about to respond when an Unconsecrated bounces down the cliff, knocks into him and sends him tumbling away from me, out into the nothingness.\\n\\n “Jed!” I scream. Over and over again I yell for him as I scrabble down the cliff grasping at roots and branches and rocks, sometimes losing my grip and skidding down until I can stop my fall.\\n\\n Finally, I\u0027m close enough to the water. It churns with branches and bodies. Whitecaps roiling over each other. No order, just chaos.\\n\\n Sometimes a head will break the surface but never long enough for me to see the face. Arms flail but it\u0027s impossible to tell whether the arms belong to Jed or an Unconsecrated. Bodies continue to fall into the water, creating splashes that mix with the waves.\\n\\n I realize that the current is impossibly fast in places and so I start to move sideways down the cliff, trying to make it downstream. Hoping that Jed was able to find something to grab on to, to pull himself out of the water.\\n\\n As the night wears on my searches grow more frantic, more desperate. I find a tree that has fallen over the water and I inch my way out onto it, gripping the rough bark with my thighs. The rain continues to pound my back as I move forward, gusts of wind rip down the canyon, making me hug the tree so that I don\u0027t fall in.\\n\\n When I\u0027m out over the water I scan the surface below. The river clogs as a massive log jams into a narrow part of the canyon and the water begins to back up. Waves crash over my position.\\n\\n I back down the tree, concentrating so hard that I don\u0027t see it coming. An arm reaches out of the water. Grabs me. Yanks me in. Pulls me under.\\n\\n I kick and thrash and turn. Something tugs at my hair. My head breaks the surface and for a heartbeat I believe that my rescuer is Jed. That he\u0027s the one who has dragged me to the surface.\\n\\n But then I see the face, the hunger, the teeth. I lash out, push against the water with all my might. The current slips past me as I fight it. Lightning splits the sky and I can see my surroundings clearly.\\n\\n See the bodies like so much debris, a part of the swirling mess.\\n\\n And then nothingness.\\n\\n In my dream I\u0027m back in the clearing in the Forest, the one Sister Tabitha took me to through the tunnels under the Cathedral. The Forest is silent. No mosquitoes humming, no birds singing and I am alone. Suddenly, everything around me collapses. Sound clamors back and it\u0027s my mother screaming as she turned. I see the Unconsecrated rushing at me from the Forest, all of them fast, all of them wearing bright red vests. My mother is there and Jed and Cass and Harry and Jacob. Over and over and over I see the same faces coming at me, hungering for me.\\n\\n Panic wells inside me until I remember the fences. I am protected by the fences. I scrabble to find the entrance to the tunnel but it\u0027s not there. The ground is smooth; I can\u0027t find a single stick to use as a weapon. The Unconsecrated hit the metal links of the fence and they push and pull. My head swells with their moans.\\n\\n They\u0027re calling my name. “Mary… Mary… Mary,” like a chant, like a prayer. Blood pools from their mouths. Every Unconsecrated is my mother, Harry, Jed, Cass or Jacob.\\n\\n They raise their hands toward me, their fingers like claws, pointing at me. I can feel their accusations like a blow, like a ferocious wind pushing against me. And then the fence dissolves. There\u0027s nothing between us. They crawl toward me. Crawl like Gabrielle the last time I saw her. My only hope is that their strength will give out before they reach me. But I feel them on my legs, pulling me down. I\u0027m surrounded, smothered. I can\u0027t breathe.\\n\\n Their hands dig into me. It\u0027s as if they\u0027re all trying to crawl inside me at once.\\n\\n I can\u0027t stop them and they keep coming and coming and coming until I drown under them. \\n\\n","sourceLink":"https://allnovel.net/the-forest-of-hands-and-teeth-the-forest-of-hands-and-teeth-1/page-31.html","bookId":2585,"book":{"id":2585,"title":"The Forest of Hands and Teeth (The Forest of Hands and Teeth #1)","description":"Storyline: The Forest of Hands and Teeth (The Forest of Hands and Teeth #1) \\n In Mary\u0027s world there are simple truths. The Sisterhood always knows best. The Guardians will protect and serve. The Unconsecrated will never relent. And you must always mind the fence that surrounds the village; the fence that protects the village from the Forest of Hands and Teeth. But, slowly, Mary’s truths are failing her. She’s learning things she never wanted to know about the Sisterhood and its secrets, and the Guardians and their power, and about the Unconsecrated and their relentlessness. When the fence is breached and her world is thrown into chaos, she must choose between her village and her future—between the one she loves and the one who loves her. And she must face the truth about the Forest of Hands and Teeth. Could there be life outside a world surrounded in so much death?\\n","cover":"https://allnovel.net/images/the-forest-of-hands-and-teeth-the-forest-of-hands-and-teeth-1.jpg","author":"Carrie Ryan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-forest-of-hands-and-teeth-the-forest-of-hands-and-teeth-1.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:10:55 PM"}}
