{"id":72783,"no":24,"title":"Page 24","content":"“Who the heck’s this Richardson, anyway?” complained one member of the public. “Everybody knows a gopher’s a gopher!” “If I may speak to that, Your Worship,” began a small bespectacled man wearing a vest and striped tie, addressing the mayor. This was Norman Weber, who worked at the liquor store. He nervously pushed back his glasses and referred to a piece of paper in his hand. “The true and proper name for what is popularly known as a gopher is Richardson’s ground squirrel,” he read. He looked at the mayor. “Now, do we want the town of Glory to be a laughingstock because we don’t call our town animal by its proper name?” The poor man was drowned out by a chorus of “Aw, sit down” and “Who cares?” Hannah tried not to smile; a lot of people took this very seriously. Clearly, the gopher people were in the majority. No way she was suggesting spermophilii richardsonii, the Latin name, just to be really accurate! The debate continued, with the clerk finally calling a halt to discussion and opening the floor to suggestions about the festive season’s street decorations. The next half hour was spent arguing the merits of Santas and reindeers over candy canes and snowmen. By six she wondered if she’d have a chance to speak at all. Usually these meetings were fairly short. A little later, though, the call came from the town clerk, “Any more business?” and she put up her hand. “Hannah Parrish!” She left her coat and purse at her seat and walked to the end of the aisle so she could speak into the microphone. She pulled her sweater down neatly and cleared her throat. To her great embarrassment, she heard a wolf whistle from the corner of the room, where a group of skateboarders had taken seats. A general chuckle followed. The teens, according to the man next to her, were there to ask the town for a skateboard park in the new riverside development. “I’m here to speak on behalf of Seth Wilbee, who, as many of you know, has a small dwelling on the riverbank in the vicinity of the proposed park.” There was a murmur from the crowd. Hannah didn’t know whether to be encouraged by that or not. Seth Wilbee was tolerated in the community, but he wasn’t claimed as a friend by anyone she knew. She was sure town children were just as wary of the loner who lived in the riverbank shack as she had been of Mrs. Birch, the “old witch” of her own childhood. Hannah continued, relating how she’d visited him and discovered he’d been ordered to move his shack immediately. She had decided right from the start to keep Seth’s secret but pointed out to the mayor and councillors that since construction wouldn’t start until spring, perhaps Mr. Wilbee could be given an extension on the order, so he’d have more time to find a suitable dwelling place. “Yeah, like a cave!” shouted someone. “Or a barrel!” shouted another. Some chuckled and others booed the speakers. The mayor, the butcher from the IGA, asked the council if there were any serious objections to giving Mr. Wilbee an extension. No one had any objections, although one councillor, a real-estate agent, stood and lectured the crowd on the dangers of “indigents, mendicants and dilettantes” taking over the streets of Glory. No one was quite sure what he meant, but Hannah did not think it augured well for the young and generally unpopular skateboard crowd. “Ruth Putty!” the town clerk called out. Hannah was surprised. She hadn’t known her neighbor was there. The plump elderly woman made her way to the microphone, and took it from Hannah. Mrs. Putty was very red and out of breath. “I just want to say that although I wish Seth Wilbee would go into a home where he’d be off our streets and well looked after, I know he won’t because he’s too darn stubborn.” The crowd murmured in agreement. “But I want to put in a word here for my neighbor, Hannah Parrish. We live in the same apartment building, and I’ve known Hannah for several years. She’s a dear young thing, a real asset at our town library and a wonderful friend to me. I know she keeps an eye on Seth and even takes the old fool homemade cookies and such.” The crowd laughed. “Now she’s going to bat for him against the town and even teaching him to read! How about that? I think we should have a round of applause for our librarian, Miss Hannah Parrish. She’s a fine example to all our young people!” Mrs. Putty glared in the direction of the skateboarders, who sent up a good-tempered jeer. The crowd burst into applause, much to Hannah’s dismay. Mrs. Putty grabbed her and kissed her cheek, then went huffing and puffing back to her seat. Hannah followed, blushing. Just before she sat down, she glanced behind her, smiling at her many applauding supporters. Then she froze. Staring at her from the back of the room was one person she’d never thought she’d see in this room. It was Jack Gamble, dressed in jeans and a wind-breaker, and he looked as shocked and surprised as she was. CHAPTER TEN JACK WAS WAITING for her on the steps of her apartment building when Hannah arrived home. It had started to snow again, and she wasn’t sure she’d have noticed him right away. But a quick rap on the window above the doorway, the living-room window belonging to Mrs. Putty, left no doubt in her mind. When she looked up, Mrs. Putty made violent gestures pointing down, toward the door. Evidently she’d seen Jack and wanted to make sure Hannah didn’t miss him. How could she miss him? He looked as wonderful as ever—no, even more so—dressed in casual working clothes. She glanced down the street and noticed his pickup parked down the block a little, out of the loading zone. He watched her approach, making no move to come toward her. She felt self-conscious. But then she lifted her chin and met his gaze straight on. She liked who she was. She’d always liked who she was—plain Hannah Parrish. She decided to ignore him. After all, she had no idea why he was here. Why hadn’t he acknowledged her at the town hall? She’d looked for him in the crowd as the meeting broke up, but he’d left. Then she’d been delayed talking to various people, and after that, had decided to stop at Seth’s place to tell him it seemed very likely the town would give him a reprieve. Seth’s pale eyes had watered dangerously, and he’d held her gloved hands in his large gnarled ones and thanked her again and again. She’d noticed the open workbook on his wooden table, with a coal-oil lantern burning over it. The dotted lines of a’s were already traced in pencil. Hannah clutched her purse and the bag Seth had given her more tightly as she saw Jack step out from under the portico and move toward her. “What took you so long?” he asked, his voice warm. They were under the streetlight, well within Mrs. Putty’s view. Hannah looked stubbornly up at him, her lips pressed firmly together. She decided to ignore his question. “I saw you at the meeting.” “Yes.” Jack moved a little closer and smiled at her. “Hannah Parrish, isn’t it? The town librarian? This is where she lives and her neighbor’s name is Ruth Putty and she’s known her for several years?” Hannah knew her cheeks were a furious red. Mrs. Putty had set the facts out very clearly at the meeting, and Jack hadn’t missed a thing. She nodded. She didn’t quite trust her voice. “And Hannah Parrish has a parrot named Joan and a very independent cat called Mr. Spitz?” he went on, one eyebrow raised, a slight smile on his face. Hannah nodded and dug in her pocket for her key. She was feeling a little better. At least Jack wasn’t angry. He touched her arm and she turned to him. “Hannah!” He framed her face in his hands. “Forgive me?” “For what?” she asked, her breath painful in her lungs. “For not believing you. When you tried to tell me the truth.” He bent down and brushed her lips with his and Hannah felt her knees jiggle. He always had this effect on her! “I—I can’t say I blame you, Jack,” she replied quietly. Even thinking of it now, her foolish deception made her voice quaver and her eyes burn. “It was all so stupid. I’m so sorry. I can’t begin to explain—” “Emily told me,” he broke in. “She told me the whole story. When you didn’t answer your phone, I nearly went mad. You didn’t answer your door. I thought something had happened to you. I—” “Oh, Jack!” Hannah dropped her purse and the paper bag Seth had given her. “Kiss me!” Jack did, with enthusiasm. Hannah gave herself up to his embrace. This was where she belonged. Oh, thank you, Emily, thank you. “Hannah, honey,” Jack murmured, his face against her tam. “Is it too early in our relationship to say that I really, really like you? Exactly the way you are?” “No,” Hannah said, smiling into his jacket. She realized her face was wet with tears, tears of joy. Mrs. Putty was certainly getting an eyeful. “Okay, then.” He held her away from him so he could look at her. “I really, really like you, Hannah Parrish!” “And I really, really like you, Jack. I do.” “Good. I wanted to hear that.” He held her tighter and dropped a kiss on her nose. He pulled off her tam and buried his face in her hair. She heard his muffled laugh. “What’s so funny?” She barely trusted her voice. “Your hair. It’s a glorious brown. And it’s so curly.” He smiled down at her, twisting one tendril of her hair around his finger. “Did I ever tell you I’m very partial to brunettes?” “Oh, Jack!” He bent and kissed her again. Hannah opened her eyes to see her neighbor give her a thumbs-up before drawing her curtains—rather reluctantly, Hannah thought with a smile. “Have you had supper?” she asked when she caught her breath. “No,” he said with a huge grin. “Are you inviting me?” “Yes, I am,” she said. She wondered if she looked as giddy as she felt. Another chance with Jack! “Let me guess what you’re serving. Meat loaf?” “No.” She smiled. “Baked ham, noodles and string beans?” “No.” She giggled. “But you do have something in the oven, right? For after the meeting. Because you’re an organized, careful, domestic kind of person, right? Not to mention sexy as all get-out.” She nodded, eyes dancing. “Give up?” He took her key and opened the front door of her building. “Last guess—pot roast?” “Right!” “Hannah Parrish, you are the woman of my dreams.” He held the door for her. “Would you consider this too early for me to mention the possibility of you becoming a farmer’s wife someday?” She felt her heart melt all over again. “No, I wouldn’t,” she said softly. “Oh, baby!” Jack swooped her into his arms and kissed her again. Hannah was glad they were out of sight of her interested neighbor. “Although, I have to admit,” Hannah managed, her heart beating furiously, “it would depend a lot on who the farmer was.” Jack let out a whoop of laughter and released her, and Hannah glanced down at the stuff she’d dropped. He bent and picked up her purse and the paper bag, brushing off the snow.","sourceLink":"https://allnovel.net/born-in-a-small-town-patton-s-daughters-4/page-24.html","bookId":1980,"book":{"id":1980,"title":"Born in a Small Town (Patton\u0027s Daughters #4)","description":"Storyline: Born in a Small Town (Patton\u0027s Daughters, #4) In this three-in-one story collection, fans of Macomber\u0027s \"Midnight Sons\" series meet a whole new generation of family members and get updates on original characters in \"Midnight Sons and Daughters\". In addition, Bowen welcomes readers back to Glory, Alberta, in \"The Glory Girl\" and Johnson continues her \"Patton\u0027s Daughter\u0027s\" tale with \"Promise Me Picket Fences\".","cover":"https://allnovel.net/images/born-in-a-small-town-patton-s-daughters-4.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/born-in-a-small-town-patton-s-daughters-4.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:06 AM"}}
