{"id":72784,"no":25,"title":"Page 25","content":"“What’s in this?” “Oh, just some vegetables Seth gave me.” “Turnips? Yuck, I hate turnips.” Hannah peered in the bag. “No, parsnips. Seth says they’re a very misunderstood vegetable.” “They go with pot roast?” “Maybe,” she teased. She just couldn’t stop smiling. “You like parsnips?” “Not really. Why?” Jack looked bewildered. Hannah laughed and stood on tiptoe and kissed him on the chin. “You will. Trust me. Seth says they’re always sweeter after a frost. Always.” Promise Me Picket Fences Janice Kay Johnson Other Elk Springs books by Janice Kay Johnson HARLEQUIN SUPERROMANCE 854—THE WOMAN IN BLUE 860—THE BABY AND THE BADGE 866—A MESSAGE FOR ABBY 913—JACK MURRAY, SHERIFF ELK SPRINGS, OREGON Have you ever been to Elk Springs? You won’t find it on a map, but it’s out there in Central Oregon, a once old-fashioned town surrounded by high desert ranching country. These past ten years, Elk Springs has been transformed by a new ski resort on Juanita Butte outside town. New and old met when Scott McNeil, a man who helped build that ski resort, married Meg Patton, who was born and grew up in Elk Springs, then brought her son back to raise him in her hometown. You’re about to meet Scott’s brother, by the way. Kevin McNeil has come to Elk Springs to live and work—although his restless nature has him assuming he won’t stay. Oh, while you’re in town, stick your head in the new public safety building that houses the police department. If anything epitomizes change in this community, it’s the Elk Springs P.D., run for a quarter century by hard-nosed Chief Ed Patton, who didn’t know the meaning of mercy. Longtime residents are pretty sure he’s rolling over in his grave now that a woman, his own daughter, Renee Patton, wears the badge! Those same residents will tell you that, along with her two sisters—both also in law enforcement—Renee does a fine job of keeping the peace in Elk Springs. So enjoy your visit and come again. Janice Kay Johnson Other Elk Springs books by Janice Kay Johnson HARLEQUIN SUPERROMANCE 854—THE WOMAN IN BLUE 860—THE BABY AND THE BADGE 866—A MESSAGE FOR ABBY 913—JACK MURRAY, SHERIFF CHAPTER ONE THE CANNON BOOMED, white smoke puffing from its mouth. Blue-coated Yankee cavalry cantered through the forest, flashes of gleaming chestnut coat or gold braid glinting between branches. Closer, on the grassy hillside, Rebel and Yankee infantrymen maneuvered, making forays and being driven back by the sharp crack of rifle fire. Wounded fell as the watching crowd gasped. Bodies littered the landscape. His stern gaze fixed on the hillside skirmish, a Confederate colonel strode past the split-rail fence where Melanie Parker leaned. His gray frock coat had a curved breast with two seven-button rows and elaborate gold braid on the sleeves and trim on collar and cuffs. Blue trim ran up his trouser legs. His graying head was covered by an officer’s kepi, a kind of slouch cap. Melanie watched his progress with pardonable pride. She had made his uniform, from inner pockets to decorative braid. In fact, half the uniforms on this field had come from her sewing machine. The Civil War reenactors were a passionate bunch, she’d discovered. Every tiny detail had to be right, for these men and women were out here to educate, as well as have fun. She had become something of an expert on Rebel and Yankee uniforms both, from the pullover white muslin shirt with removable collar to the Confederate rank insignia on the coat sleeves. She’d sewed many of the gowns worn by camp followers, too. Melanie had something of an obsession herself for historical accuracy. Today’s reenactment of an obscure battle was being staged primarily for children. Scouting troops from all over central Oregon, both boys and girls, had gathered in the state park outside Elk Springs to watch, learn and participate. Melanie was here as leader of her daughter Angie’s troop. Except for a few stolen moments of pleasure taken in her handiwork, she was too busy keeping tabs on the girls to follow the strategy on the battlefield. Somebody always had to go to the portable toilets a quarter of a mile away. The booths selling 1860s-era keepsakes, clothing and candy enticed eight-year-old girls with allowance money tucked in their pockets. Melanie had spent the entire day thinking, Now, where is Jennifer? Oh. Good. Well, then, what about Rainy? And Sarah. She’s missing, too, isn’t she? Melanie did not envy the troop leaders with younger children. A buzz passed through the crowd, a ripple she scarcely noticed as she counted noses for the four hundred and eighty-eighth time. “Melanie.” A regional Scout leader paused, her expression harassed and even a little anxious. “You haven’t seen a wandering four-year-old, have you? A boy in green corduroy overalls?” “Are you kidding?” Melanie waved a hand and raised her voice. “Angie and Rachel, where do you think you’re going?” She switched her attention back to the leader. “Is this kid really lost?” “Nobody has seen him in the past hour. Or more.” She shook her head. “His dad has a group of older boys.” She nodded vaguely toward the encampment. “He thought his son was with his wife, she thought he was with the dad. You know how that goes.” No, actually, Melanie didn’t. Angie’s dad had never been interested in taking her places. In fact, she hadn’t even seen him in almost two years. But Melanie nodded. “I’ll keep an eye out.” “Right.” No small boy in green overalls darted through the crowd or tried to duck under the split-rail fence to join the battle. Eventually Melanie and other Scout leaders organized their kids to hunt through the crowd and down by the lake. The battle on the hillside dwindled in spirit, and the wounded rose to fight another day. Cavalry officers hunted through the fringe of the woods for the child. Somebody pointed out the boy’s mother, who raced along the riverbank, calling his name frantically, voice rising to a near scream. “Brandon! Brandon, come to Mommy!” “We need to send the kids home,” a senior Boy Scout leader decided, and the others concurred. Melanie corralled her girls by her Bronco, but Sarah’s mother hurried across the parking lot. “Aren’t you in the volunteer search-and-rescue group? Let me take the girls. You might be needed here. Angie can come home with Sarah.” As they piled into the Dodge Caravan, Melanie counted noses one last time and then hugged her daughter and thanked Sarah’s mother. “You’ll see that they all get home? Bless you. I’ll hope I’m not needed in the end.” An ardent hiker, she had joined the search-and-rescue group this past summer and had only been called out once, when a hiker got separated from his party in the Deschutes National Forest. His cell phone saved the day, which had taken some of the romance out of the rescue of a man with a sprained ankle, in Melanie’s private opinion. As the group gathered, she said, “We’re sure this little boy wasn’t…well…” “Taken?” the ranger who headed the group finished for her, his jaw set grimly. “No. We can’t be. But there was virtually no automobile traffic out of here in the past few hours. Remember, pretty much the whole audience was Scout troops. Unless we have some sicko leader who dragged the kid off…” Nobody wanted to think about that. “The kid is a wanderer, apparently. Couple months ago, he got up before his parents one morning and set off down the street. They found him a mile away. So that’s the likeliest possibility.” He looked around. “Other questions? No? Okay. Tom, you take your group and do a sweep along the riverbank.” He continued to give orders, and groups of eight or ten split off to follow them. Melanie had become aware of a man she didn’t know standing quietly nearby. He stood out from the crowd by virtue of his height, his lean powerful body and short-cropped but noticeably wavy auburn hair. In the late-afternoon sunlight, that hair was almost as red as the sweat-slick neck of the bay mare hitched to the nearby fence. “Kevin, you handle the woods beyond the concession area. Go several miles, the kid has been missing for almost three hours now, but keep it slow. His mother says this is nap time, and he may have found a place to curl up.” The big auburn-haired man in jeans and dusty hiking boots said in a deep easy voice, “You got it. Okay.” Clear gray eyes met Melanie’s for an oddly startling moment before moving on. “You eight—no, nine, are with me.” As they hurried across the beaten-down grass that had formed the parking lot, he gave orders: Fan out, but stay within sight and shouting distance of one another. He took the center himself. Melanie had the impression no one else knew him, either, but his air of command was so natural no one argued. Somehow, as they entered the ponderosa pines, Melanie found herself beside him. The woods weren’t dense, nothing like the Pacific Northwest coastal forests or the Florida Everglades. Here, reddish dust rose in tiny puffs with each footfall, and the scent of pine was sharp. If the ground had been level, finding one little boy would have been easy. As it was, however, the hill rising steeply from the Deschutes River was cut by narrow ravines with trickles of water that, in spring and early summer, would have been torrents. Every dip of ground had to be investigated, every clump of madrona or even long grass. Thank goodness this was late September and not August, when the heat would have had all of them dripping with sweat. Melanie heaved herself up a clump of crumbling aged lava. Why couldn’t Brandon Marsh have been wearing red or even royal blue? Why green? A big tanned hand was suddenly right under her nose. She blinked and looked up into those unnerving gray eyes. “Oh. Thank you,” she said breathlessly, and let his hand engulf hers. Kevin, whose last name she didn’t know, hoisted her up the last rise. Discombobulated by sensations she hadn’t felt in a long time—the skitter of nerves in her palm, the warmth that traveled easily up her arm and down to her belly—she stumbled and bumped into him. He was every bit as solid as he looked. She jumped back and teetered on the brink. Steadying herself, Melanie mumbled, “I’m sorry. If I’d known what I was going to be doing today, I’d have worn my boots.” “Your shoes look sturdy.” He still held her hand, as though he didn’t trust her not to tumble back the way she’d come. She couldn’t imagine why. “I almost wore canvas slip-ons,” she admitted. As if he would care. A smile touched his sexy mouth. “We haven’t met. I’m Kevin McNeil.” “Melanie Parker. I had a troop of girls here today. My daughter’s troop.” “Ah.” He let go of her hand. After a small silence he asked, sounding overly casual, “Was your husband here to take her home?” “Um? Oh, I don’t have…” Could it be? Was he hoping she didn’t have a husband? “I mean, I’m divorced. One of the other mothers took charge of the girls.”","sourceLink":"https://allnovel.net/born-in-a-small-town-patton-s-daughters-4/page-25.html","bookId":1980,"book":{"id":1980,"title":"Born in a Small Town (Patton\u0027s Daughters #4)","description":"Storyline: Born in a Small Town (Patton\u0027s Daughters, #4) In this three-in-one story collection, fans of Macomber\u0027s \"Midnight Sons\" series meet a whole new generation of family members and get updates on original characters in \"Midnight Sons and Daughters\". In addition, Bowen welcomes readers back to Glory, Alberta, in \"The Glory Girl\" and Johnson continues her \"Patton\u0027s Daughter\u0027s\" tale with \"Promise Me Picket Fences\".","cover":"https://allnovel.net/images/born-in-a-small-town-patton-s-daughters-4.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/born-in-a-small-town-patton-s-daughters-4.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:06 AM"}}
