{"id":12849,"no":1,"title":"I ALL AT SEA","content":"Mr. Joseph P. Mangles, at his ease in a deck-chair on the broad Atlantic, was smoking a most excellent cigar. Mr. Mangles was a tall, thin man, who carried his head in the manner curtly known at a girls\u0027 school as “poking.” He was a clean-shaven man, with bony forehead, sunken cheeks, and an underhung mouth. His attitude towards the world was one of patient disgust. He had the air of pushing his way, chin first, doggedly through life. The weather had been bad, and was now moderating. But Mr. Mangles had not suffered from sea-sickness. He was a dry, hard person, who had suffered from nothing but chronic dyspepsia—had suffered from it for fifty years or so. “Fine weather,” he said. “Women will be coming on deck—hang the fine weather.” And his voice was deep and low like a growl. “Joseph,” said Miss Mangles, “growls over his meals like a dog.” The remark about the weather and the women was addressed to a man who leaned against the rail. Indeed, there was no one else near—and the man made no reply. He was twenty-five or thirty years younger than Mr. Mangles, and looked like an Englishman, but not aggressively so. The large majority of Britons are offensively British. Germans are no better; so it must be racial, this offensiveness. A Frenchman is at his worst, only comically French—a matter of a smile; but Teutonic characteristics are conducive to hostility. The man who leaned against the rail near to Joseph P. Mangles was six feet high, and rather heavily built, but, like many big men, he seemed to take up no more than his due share of room in this crowded world. There was nothing distinctive about his dress. His demeanor was quiet. When he spoke he was habitually asked to repeat his remark, which he did, with patience, in the same soft, inaudible voice. There were two men on board this great steamer who were not business men—Joseph P. Mangles and Reginald Cartoner; and, like two ships on a sea of commercial interests, they had drifted together during the four days that had elapsed since their departure from New York. Neither made anything, or sold anything, or had a card in his waistcoat-pocket ready for production at a moment\u0027s notice, setting forth name and address and trade. Neither was to be suspected of a desire to repel advances, and yet both were difficult to get on with. For human confidences must be mutual. It is only to God that man can continue telling, telling, telling, and getting never a word in return. These two men had nothing to tell their fellows about themselves; so the other passengers drifted away into those closely linked corporations characteristic of steamer life and left them to themselves—to each other. And they had never said things to each other—had never, as it were, got deeper than the surface of their daily life. Cartoner was a dreamy man, with absorbed eyes, rather deeply sunk under a strong forehead. His eyelids had that peculiarity which is rarely seen in the face of a man who is a nonentity. They were quite straight, and cut across the upper curve of the pupil. This gave a direct, stern look to dreamy eyes, which was odd. After a pause, he turned slowly, and looked down at his companion with a vague interrogation in his glance. He seemed to be wondering whether Mr. Mangles had spoken. And Mangles met the glance with one of steady refusal to repeat his remark. But Mangles spoke first, after all. “Yes,” he said, “the women will be on deck soon—and my sister Jooly. You don\u0027t know Jooly?” He spoke with a slow and pleasant American accent. “I saw you speaking to a young lady in the saloon after luncheon,” said Cartoner. “She had a blue ribbon round her throat. She was pretty.” “That wasn\u0027t Jooly,” said Mr. Mangles, without hesitation. “Who was it?” asked Cartoner, with the simple directness of those who have no self-consciousness—who are absorbed, but not in themselves, as are the majority of men and women. “My niece, Netty Cahere.” “She is pretty,” said Cartoner, with a spontaneity which would have meant much to feminine ears. “You\u0027ll fall in love with her,” said Mangles, lugubriously. “They all do. She says she can\u0027t help it.” Cartoner looked at him as one who has ears but hears not. He made no reply. “Distresses her very much,” concluded Mangles, dexterously shifting his cigar by a movement of the tongue from the port to the starboard side of his mouth. Cartoner did not seem to be very much interested in Miss Netty Cahere. He was a man having that air of detachment from personal environments which is apt to arouse curiosity in the human heart, more especially in feminine hearts. People wanted to know what there was in Cartoner\u0027s past that gave him so much to think about in the present. The two men had not spoken again when Miss Netty Cahere came on deck. She was accompanied by the fourth officer, a clean-built, clean-shaven young man, who lost his heart every time he crossed the Atlantic. He was speaking rather earnestly to Miss Cahere, who listened with an expression of puzzled protest on her pretty face. She had wondering blue eyes and a complexion of the most delicate pink and white which never altered. She was slightly built, and carried herself in a subtly deprecating manner, as if her own opinion of herself were small, and she wished the world to accept her at that valuation. She made no sign of having perceived her uncle, but nevertheless dismissed the fourth officer, who reluctantly mounted the ladder to the bridge, looking back as he went. Mr. Mangles threw his cigar overboard. “She don\u0027t like smoke,” he growled. Cartoner looked at the cigar, and absent-mindedly threw his cigarette after it. He had apparently not made up his mind whether to go or stay, when Miss Cahere approached her uncle, without appearing to notice that he was not alone. “I suppose,” she said, “that that was one of the officers of the ship, though he was very young—quite a boy. He was telling me about his mother. It must be terrible to have a near relation a sailor.” She spoke in a gentle voice, and it was evident that she had a heart full of sympathy for the suffering and the poor. “I wish some of my relations were sailors,” replied Mr. Mangles, in his deepest tones. “Could spare a whole crew. Let me introduce my friend, Mr. Cartoner—Miss Cahere.” He completed the introduction with an old-fashioned and ceremonious wave of the hand. Miss Cahere smiled rather shyly on Cartoner, and it was his eyes that turned away first. “You have not been down to meals,” he said, in his gentle, abrupt way. “No; but I hope to come now. Are there many people? Have you friends on board?” “There are very few ladies. I know none of them.” “But I dare say some of them are nice,” said Miss Cahere, who evidently thought well of human nature. “Very likely.” And Cartoner lapsed into his odd and somewhat disconcerting thoughtfulness. Miss Cahere continued to glance at him beneath her dark lashes—dark lashes around blue eyes—with a guileless and wondering admiration. He certainly was a very good-looking man, well set up, with that quiet air which bespeaks good breeding. “Have you seen the ship on the other side?” she asked, after a pause; “a sailing ship. You cannot see it from here.” As she spoke she made a little movement, as if to show him the spot from whence the ship was visible. Cartoner followed her meekly, and Mr. Mangles, left behind in his deck-chair, slowly sought his cigar-case. “There,” said Miss Cahere, pointing out a sail on the distant horizon. “One can hardly see it now. When I first came on deck it was much nearer. That ship\u0027s officer pointed it out to me.” Cartoner looked at the ship without much enthusiasm. “I think,” said Miss Cahere, in a lower voice—she had a rather confidential manner—“I think sailors are very nice, don\u0027t you? But . . . well, I suppose one ought not to say that, ought one?” “It depends what you were going to say.” Miss Cahere laughed, and made no reply. Her laugh and a glance seemed, however, to convey the comfortable assurance that whatever she had been about to say would not have been applicable to Cartoner himself. She glanced at his trim, upright figure. “I think I prefer soldiers,” she said, thoughtfully. Cartoner murmured something inaudible, and continued to gaze at the ship he had been told to look at. “Did you know my uncle before you came on board, or were you brave enough to force him to speak? He is so silent, you know, that most people are afraid of him. I suppose you had met him before.” “No. It was a mere accident. We were neither of us ill. We were both hungry, and hurried down to a meal. And the stewards placed us next to each other.” Which was a long explanation, without much information in it. “Oh, I thought perhaps you were in the diplomatic service,” said Miss Cahere, carelessly. For an instant Cartoner\u0027s eyes lost all their vagueness. Either Miss Cahere had hit the mark with her second shot, or else he was making a mental note of the fact that Mr. Mangles belonged to that amiable body of amateurs, the American Diplomatic Corps. Mr. Mangles had naturally selected the leeward side of the deck-house for his seat, and Miss Cahere had brought Cartoner round to the weather side, where a cold Atlantic breeze made the position untenable. Without explanation, and for her own good, he led the way to a warmer quarter. But at the corner of the deck-house a gust caught Miss Cahere, and held her there in a pretty attitude, with her two hands upraised to her hat, looking at him with frank and laughing eyes, and waiting for him to come to her assistance. The same gust of wind made the steamer lurch so that Cartoner had to grasp Miss Cahere\u0027s arm to save her from falling. “Thank you,” she said, quietly, and with downcast eyes, when the incident had passed. For in some matters she held old-fashioned notions, and was not one of the modern race of hail-fellow-well-met girls who are friendly in five minutes with men and women alike. When she came within sight of her uncle, she suddenly hurried towards him, and made an affectionate, laughing attempt to prevent his returning his cigar-case to his jacket pocket. She even took possession of the cigar-case, opened it, and with her own fingers selected a cigar. “No,” she said, firmly, “you are going to smoke again at once. Do you think I did not see you throw away the other? Mr. Cartoner—is it not foolish of him? Because I once said, without reflecting, that I did not care about the smell of tobacco, he never lets me see him smoke now.” As she spoke she laid her hand affectionately on the old man\u0027s shoulder and looked down at him. “As if it mattered whether I like it or not,” she said. “And I do like it—I like the smell of your cigars.” Mr. Mangles looked from Cartoner to his niece with an odd smile, which was perhaps the only way in which that lean countenance could express tenderness. “As if it mattered what I think,” she said, humbly, again. “Always like to conciliate a lady,” said Mr. Mangles, in his deep voice. “Especially when that lady is dependent on you for her daily bread and her frocks,” answered Netty, in an affectionate aside, which Cartoner was, nevertheless, able to overhear. “Where is your aunt Jooly?” inquired the old man, hurriedly. “I thought she was coming on deck.” “So she is,” answered Netty. “I left her in the saloon. She is quite well. She was talking to some people.” “What, already?” exclaimed the lady\u0027s brother. And Netty nodded her head with a mystic gravity. She was looking towards the saloon stairway, from whence she seemed to expect Miss Mangles. “My sister Jooly, sir,” explained Mr. Mangles to Cartoner, “is no doubt known to you—Miss Julia P. Mangles, of New York City.” Cartoner tried to look as if he had heard the name before. He had lived in the United States during some months, and he knew that it is possible to be famous in New York and quite without honor in Connecticut. “Perhaps she has not come into your line of country?” suggested Mr. Mangles, not unkindly. “No—I think not.” “Her line is—at present—prisons.” “I have never been in prison,” replied Cartoner. “No doubt you will get experience in course of time,” said Mr. Mangles, with his deep, curt laugh. “No, sir, my sister is a lecturer. She gets on platforms and talks.” “What about?” asked Cartoner. Mr. Mangles described the wide world, with a graceful wave of his cigar. “About most things,” he answered, gravely; “chiefly about women, I take it. She is great on the employment of women, and the payment of them. And she is right there. She has got hold of the right end of the stick there. She had found out what very few women know—namely, that when women work for nothing, they are giving away something that nobody wants. So Jooly goes about the world lecturing on women\u0027s employment, and pointing out to the public and the administration many ways in which women may be profitably employed and paid. She leaves it to the gumption of the government to discover for themselves that there is many a nice berth for which Jooly P. Mangles is eminently suited, but governments have no gumption, sir. And—” “Here is Aunt Julie,” interrupted Miss Cahere, walking away. Mr. Mangles gave a short sigh, and lapsed into silence. As Miss Cahere went forward, she passed another officer of the ship, the second in command, a dogged, heavy man, whose mind was given to the ship and his own career. He must have seen something to interest him in Netty Cahere\u0027s face—perhaps he caught a glance from the dark-lashed eyes—for he turned and looked at her again, with a sudden, dull light in his face.","sourceLink":"http://novel.tingroom.com/duanpian/2877/79609.html","bookId":1161,"book":{"id":1161,"title":"The Vultures","description":"简介： Mr. Joseph P. Mangles, at his ease in a deck-chair on the broad Atlantic, was smoking a most excellent cigar. Mr. Mangles was a tall, thin man, who carried his head in the manner curtly known at a girls\u0027 school as poking. He was a clean-shaven man, w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2877","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
