{"id":12858,"no":10,"title":"X A WARNING","content":"It is a matter of history that the division of Poland into three saved many families from complete ruin. For some suffered confiscation in the kingdom of Poland and saved their property in Galicia; others, again in Posen had estates in Masovia, which even Russian justice could not lay hands upon—that gay justice of 1832, which declared that, in protesting against the want of faith of their conquerors, the Poles had broken faith. The Austrian government had sympathized with the discontent of those Poles who had fallen under Russian sway, while in Breslau it was permitted to print and publish plain words deemed criminal in Cracow and Warsaw. The dogs, in a word, behaved as dogs do over their carrion, and, having secured a large portion, kept a jealous eye on their neighbor\u0027s jaw. The Bukatys had lost all in Poland except a house or two in Warsaw, but a few square miles of fertile land in Galicia brought in a sufficiency, while Wanda had some property in the neighborhood of Breslau bequeathed to her by her mother. The grim years of 1860 and 1861 had worn out this lady, who found the peace that passeth man\u0027s understanding while Poland was yet in the horrors of a hopeless guerilla warfare. “Russia owes me twenty years of happiness and twenty million rubles,” the old prince was in the habit of saying, and each year on the anniversary of his wife\u0027s death he reckoned up afresh this debt. He mentioned it, moreover, to Russian and Pole alike, with that calm frankness which was somehow misunderstood, for the administration never placed him among the suspects. Poland has always been a plain-speaking country, and the Poles, expressing themselves in the roughest of European tongues, a plain-spoken people. They spoke so plainly to Henry of Valois when he was their king that one fine night he ran away to mincing France and gentler men. When, under rough John Sobieski, they spoke with their enemy in the gate of Vienna, their meaning was quite clear to the Moslem understanding. The Prince Bukaty had a touch of that rough manner which commands respect in this smooth age, and even Russian officials adopted a conciliatory attitude towards this man, who had known Poland without one of their kind within her boundaries. “You cannot expect an old man such as I to follow all the changes of your petty laws, and to remember under which form of government he happens to be living at the moment!” he had boldly said to a great personage from St. Petersburg, and the observation was duly reported in the capital. It was, moreover, said in Warsaw that the law had actually stretched a point or two for the Prince Bukaty on more than one occasion. Like many outspoken people, he passed for a barker and not a biter. It does not fall to the lot of many to live in a highly civilized town and submit to open robbery. Prince Bukaty lived in a small palace in the Kotzebue street, and when he took his morning stroll in the Cracow Faubourg he passed under the shadow of a palace flying the Russian flag, which palace was his, and had belonged to his ancestors from time immemorial. He had once made the journey to St. Petersburg to see in the great museum there the portraits of his fathers, the books that his predecessors had collected, the relics of Poland\u0027s greatness, which were his, and the greatness thereof was his. “Yes,” he answered to the loquacious curator, “I know. You tell me nothing that I do not know. These things are mine. I am the Prince Bukaty!” And the curator of St. Petersburg went away, sorrowful, like the young man who had great possessions. For Russia had taken these things from the Bukatys, not in punishment, but because she wanted them. She wanted offices for her bureaucrats on the Krakowski Przedmiescie, in Warsaw, so she took Bukaty Palace. And to whom can one appeal when Caesar steals? Poland had appealed to Europe, and Europe had expressed the deepest sympathy. And that was all! The house in the Kotzebue had the air of an old French town-house, and was, in fact, built by a French architect in the days of Stanislaus Augustus, when Warsaw aped Paris. It stands back from the road behind high railings, and, at the farther end of a paved court-yard, to which entrance is gained by two high gates, now never opened in hospitality, and only unlocked at rare intervals for the passage of the quiet brougham in which the prince or Wanda went and came. The house is just round the corner of the Kotzebue, and therefore faces the Saski Gardens—a quiet spot in this most noisy town. The building is a low one, with a tiled roof and long windows, heavily framed, of which the smaller panes and thick woodwork suggest the early days of window-glass. Inside, the house is the house of a poor man. The carpets are worn thin; the furniture, of a sumptuous design, is carefully patched and mended. The atmosphere has that mournful scent of better days—now dead and past. It is the odor of monarchy, slowly fading from the face of a world that reeks of cheap democracy. The air of the rooms—the subtle individuality which is impressed by humanity on wood and texture—suggested that older comfort which has been succeeded by the restless luxury of these times. The prince was, it appeared, one of those men who diffuse tranquillity wherever they are. He had moved quietly through stirring events; had acted without haste in hurried moments. For the individuality of the house must have been his. Wanda had found it there when she came back from the school in Dresden, too young to have a marked individuality of her own. The difference she brought to the house was a certain brightness and a sort of experimental femininity, which reigned supreme until her English governess came back again to live as a companion with her pupil. Wanda moved the furniture, turned the house round on its staid basis, and made a hundred experiments in domestic economy before she gave way to her father\u0027s habits of life. Then she made that happiest of human discoveries, which has the magic power of allaying at one stroke the eternal feminine discontent which has made the world uneasy since the day that Eve idled in that perfect garden—she found that she was wanted in the world! The prince did not tell her so. Perhaps his need of her was too obvious to require words. He had given his best years to Poland, and now that old age was coming, that health was failing and wealth had vanished, Poland would have none of him. There was no Poland. At this moment Wanda burst upon him, so to speak, with a hundred desires that only he could fulfil, a hundred questions that only he could answer. And, as wise persons know, to fulfil desires and answer questions is the best happiness. Father and daughter lived a quiet life in the house that was called a palace by courtesy only. For Martin was made of livelier stuff, and rarely stayed long at home. He came and went with a feverish haste; was fond of travel, he said, and the authorities kept a questioning eye upon his movements. There are two doors to the Bukaty Palace. As often as not, Martin made use of the smaller door giving entrance to the garden at the back of the house, which garden could also be entered from an alley leading round from the back of the bank, which stands opposite the post-office in the busier part of Kotzebue Street. He came in by this door one evening and did not come alone, for he was accompanied by a man in working-clothes. The streets of Warsaw are well lighted and well guarded by a most excellent police, second only as the Russians are to the police of London. It is therefore the custom to go abroad at night as much as in the day, and the Krakowski is more crowded after dark than during the afternoon. Kosmaroff had walked some distance behind Prince Martin in the streets. Martin unlocked the gate of the garden and passed in, leaving the gate open with the key in the lock. In a minute Kosmaroff followed, locked the gate after him, and gave the key back to its owner on the steps of the garden door of the house, where Martin was awaiting him, latch-key in hand. They did it without comment or instruction, as men carry out a plan frequently resorted to. Martin led the way into the house, along a dimly lighted corridor, to a door which stood ajar. Outside the night was cold; within were warmth and comfort. Martin went into the long room. At the far end, beneath the lamp and near an open wood fire, the prince and Wanda were sitting. They were in evening dress, and the prince was dozing in his chair. “I have brought Kos to see you,” said Martin, and, turning, he looked towards the door. The convict\u0027s son, the convict, came forward with that ease which, to be genuine, must be quite unconscious. He apparently gave no thought to his sandy and wrinkled top-boots, from which the original black had long since been washed away by the waters of the Vistula. He wore his working-clothes as if they were the best habit for this or any other palace. He took Wanda\u0027s hand and kissed it in the old-world fashion, which has survived to this day in Poland. But the careless manner in which he raised her fingers to his lips would have showed quite clearly to a competent observer that neither Wanda nor any other woman had ever touched his heart. “You will excuse my getting up,” said the prince. “My gout is bad to-night. You will have something to eat?” “Thank you, I have eaten,” replied Kosmaroff, drawing forward a chair. Martin put the logs together with his foot, and they blazed up, lighting with a flickering glow the incongruous group. “He will take a glass of port,” said the prince, turning to Wanda, and indicating the decanter from which, despite his gout, he had just had his after-dinner wine. Wanda poured out the wine and handed it to Kosmaroff, who took it with a glance and a quick smile of thanks, which seemed to indicate that he was almost one of the family. And, indeed, they were closely related, not only in the present generation, but in bygone days. For Kosmaroff represented a family long since deemed extinct. “I have come,” he said, “to tell you that all is safe. Also to bid you good-bye. As soon as I can get employment I shall go down to Thorn to stir them up there. They are lethargic at Thorn.” “Ah!” laughed the prince, moving his legs to a more comfortable position, “you young men! You think everybody is lethargic. Don\u0027t move too quickly. That is what I always preach.” “And we are ready enough to listen to your preaching,” answered Kosmaroff. “You will admit that I came here to-night in obedience to your opinion that too much secrecy is dangerous because it leads to misunderstandings. Plain speaking and clear understanding was the message you sent me—the text of your last sermon.” With his quick smile Kosmaroff touched the rim of the prince\u0027s wineglass, which stood at his elbow, and indicated by a gesture that he drank his health. “That was not my text—that was Wanda\u0027s,” answered the prince. “Ah!” said Kosmaroff, looking towards Wanda. “Is that so? Then I will take it. I believe in Wanda\u0027s views of life. She has a vast experience.” “I have been to Dresden and to London,” answered Wanda, “and a woman always sees much more than a man.” “Always?” asked Kosmaroff, with his one-sided smile. “Always.” But Kosmaroff had turned towards the prince in his quick, jerky way. “By-the-way,” he asked, “what is Cartoner doing in Warsaw?” “Cartoner—the Englishman who speaks so many languages? We met him in London,” answered the prince. “Who is he? Why should he not be here?” “I will tell you who he is,” answered Kosmaroff, with a sudden light in his eyes. “He is the man that the English send when they suspect that something is going on which they can turn to good account. He has a trick of finding things out—that man. Such is his reputation, at all events. Paul Deulin is another, and he is here. He is a friend of yours, by-the-way; but he is not dangerous, like Cartoner. There is an American here, too. His instructions are Warsaw and Petersburg. There is either something moving in Russia or else the powers suspect that something may move in Poland before long. These men are here to find out. They must find out nothing from us.” The prince shrugged his shoulders indifferently. He did not attach much importance to these foreigners. “Of course,” went on Kosmaroff, “they are only watchers. But, as Wanda says, some people see more than others. The American, Mangles, who has ladies with him, will report upon events after they have happened. So will Deulin, who is an idler. He never sees that which will give him trouble. He does not write long despatches to the Quai d\u0027Orsay, because he knows that they will not be read there. But Cartoner is different. There are never any surprises for the English in matters that Cartoner has in hand. He reports on events before they have happened, which is a different story. I merely warn you.” As he spoke, Kosmaroff rose, glancing at the clock. “There are no instructions?” “None,” answered the prince. “Except the usual one—patience!” “Ah yes,” replied Kosmaroff, “we shall be patient.” He did not seem to think that it might be easier to be patient in this comfortable house than on the sand-hills of the Vistula in the coming winter months. “But be careful,” he added, addressing Martin more particularly, “of this man Cartoner. He will not betray, but he will know—you understand. And no one must know!” He shook hands with Martin and Wanda and then with the prince. “You met him in London, you say?” he said to the prince. “What did you think of him?” “I thought him—a quiet man.” “And Wanda?” continued Kosmaroff, lightly, turning to her—“she who sees so much. What did she think of him?” “I was afraid of him!”","sourceLink":"http://novel.tingroom.com/duanpian/2877/79618.html","bookId":1161,"book":{"id":1161,"title":"The Vultures","description":"简介： Mr. Joseph P. Mangles, at his ease in a deck-chair on the broad Atlantic, was smoking a most excellent cigar. Mr. Mangles was a tall, thin man, who carried his head in the manner curtly known at a girls\u0027 school as poking. He was a clean-shaven man, w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2877","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
