{"id":95475,"no":28,"title":"Page 28","content":"He had shut her out, and she didn\u0027t know why. Lying in her sleeping bag that night, Kara ran over the events of the day in her mind, wondering what she had said, what she had done, to make him angry. She had tried several times to make him talk to her, to tell her what was wrong, but he had replied, politely, that nothing was wrong, he was only tired.\n He was lying.\n She had checked his injuries, amazed to see that the wounds, so bloody and ugly the night before, had nearly healed.\n She wanted him to take her in his arms, needed him to hold her, to assure her that everything would turn out for the best.\n She hesitated a few moments more, and then she slid out of the sleeping bag and went to gaze out the window at the man who was causing her heart such pain.\n He was standing near the lake\u0027s edge, his head thrown back, his arms spread wide, as he gazed up at the night sky. The moon\u0027s pale lightdanced across the face of the still water and bathed Alex in a shimmering silver haze.\n He looked so beautiful, and so alone, it made her heart ache. Why wouldn\u0027t he confide in her? Didn\u0027t he know how deeply his silence was hurting her?\n An owl hooted softly in the distance. Alex had told her that some tribes of Indians believed that the call of an owl near a lodge meant impending death. The sound drew his attention and as he turned toward it; Kara saw his face, saw the pain and loneliness in his expression.\n Needing to touch him, to comfort him, needing his comfort in return, she ran out of the cabin, heedless of the fact that she wasn\u0027t dressed.\n \"Alex, I\u0027m sorry.\" She threw her arms around him, burying her face in his shoulder. \"Please forgive me.\"\n Instinctively, his arms closed around her. \"Forgive you?\" Alex asked, startled by her apology. \"What have you done?\"\n \"I don\u0027t know.\" Her words were muffled against his shoulder. \"Why have you shut me out? I feel so alone.\"\n \"Kara . . . natayah . . .\" He stroked her back, his hands restless, his desire stirring at her nearness, at the silkiness of her flesh pressing so intimately against his. \"Kara . . .\"\n \"Don\u0027t send me away,\" she begged. \"Don\u0027t shut me out.\"\n Rising on tiptoe, she pressed her body against his. \"I love you, Alex.\" She tilted her head back so she could see his face, and then she kissed him deeply, fervently.\n And he was lost. Lost in the magic of her touch, the soul-deep love he had seen in her eyes.\n With a helpless cry of surrender, he cradled her in his arms, carrying her gently to the ground, covering her face, her neck, her breasts, with hungry kisses. His hands slid over her slender frame. Her skin was smooth, silky, vibrant beneath his fingertips. She arched against him, low moans of pleasure rising in her throat,encouraging him, inflaming him, until he had no thought save to possess her, to show her with his hands and his lips that he loved her, only her, now and forever.\n Her thighs parted eagerly to receive him, and then he was a part of her_heart and soul and mind and body. Every thought, every breath, was hers.\n Kara held him close, closer, until even the moonlight couldn\u0027t slip between them. Her fingers stroked the ridged flesh of his back, her fingernails following the faint pattern along his spine. She stroked him, she scratched him, and stroked him again. She cradled him within the deepest part of her, her heart pounding to the same frantic rhythm as his. She watched his face, entranced by the sheer beauty of him, by the passion blazing in his eyes.\n She sobbed his name as waves of ecstacy shuddered through her, heard his answering cry as his life force filled her with warm liquid heat.\n Locked together, they tumbled slowly back to earth.\n Alex loosed a deep sigh. Never had he experienced anything so wonderful, not even with AnnaMara. Though he had loved his wife, he had not needed her as desperately as he needed Kara. And yet, mixed with the sense of wonder was a horrible sense of guilt.\n What if Kara got pregnant? Barrett had told him this was the perfect time to impregnate her. The thought was staggering. As much as he yearned for a child born of their love, he was afraid to face the possibility, didn\u0027t want to consider the consequences that might result from the mating of ErAdonian and earthling.\n Kara made a soft sound in her throat, and he realized he was probably suffocating her with his weight. Rolling to the side, he carried her with him, holding her in his arms. He felt a sudden need to put distance between them, to be alone with his thoughts, but he knew she would not understand. She would be hurt, thinking that he was shutting her out again. He couldn\u0027t bear the thought of causing her more pain, and so he held her close, one hand stroking her hair, until her breathing grew even and shallow and he knew she was asleep.\n \"Forgive me, natayah,\" he murmured.\n He stared up at the sky, torn by conflicting emotions. He should never have gotten involved in her life . . . he should never have touched her . . . she was the best thing that had happened to him in two hundred years . . . she might be pregnant even now . . . he had ruined her life . . . he wanted her . . . he needed her.\n He loved her.\n He didn\u0027t want to love her, or need her, or want her.\n He never should have touched her.\n He wanted her again. Even now his blood was warming, thickening with desire . . . She stirred in his arms, murmured his name, and he held her tighter, knowing he would never be happy without her at his side, knowing that, sooner or later, he would have to let her go. No matter how earth-like he appeared, he was ErAdonian. A dog and a cat might fall in love, he mused bleakly, but they were two different creatures, never meant to share more than friendship.\n They stayed at the cabin until the food ran out. During those three days, Alex closed his mind to everything but making Kara happy. They walked alongthe lake at night, took long moonlight swims, slept late in the morning. He had vowed not to make love to her again, but each night she teased him with her kisses and her touch, tempting him beyond his ability to resist. Daily, he prayed for forgiveness, prayed she would not get pregnant, prayed for the strength to leave her when the time came.\n He memorized every line of her face, every curve of her slender body, the sound of her laughter, the husky timbre of her voice when she was in the throes of passion, the color of her eyes, the texture of her hair, the taste of her skin against his tongue. He told her he loved her in every way he could, and hoped she would still believe it was true when he had to let her go.\n Kara stared around the small cabin. She hated to leave the place. Even though it was small and cramped and equipped with only the barest of necessities, it had been a perfect place for a honeymoon.\n She glanced at Alex. He stood near the door, a towel wrapped around his waist.\n \"You didn\u0027t have to get all dressed up on my account,\" Kara remarked with a grin.\n \"Very amusing. Let\u0027s go.\"\n Still grinning, she followed him outside, waited while he performed a little male magic under the dash to start theengine.\n \"You want to drive?\" she asked.\n \"No, you go ahead.\" He slid into the passenger seat and sat back, his arms folded over his chest.\n Settling herself behind the wheel, Kara switched on the headlights. \"Which way?\"\n \"Turn left when you reach the road.\"\n \"You know where we are?\"\n \"More or less.\" Last night, he had determined their location by the position of the stars. If his calculations were correct, they were about seventy miles from Moulton Bay.\n Kara glanced at him as she drove. His wounds had healed, leaving no trace. She had seen it, yet it was still hard to believe that Alex had been shot, twice, and healed completely in three days. For the first time, she could understand Barrett\u0027s motives, even if she found them reprehensible. And yet, she couldn\u0027t help thinking of all the good Alex could do, the people he could help, the lives he could save.\n He was reading her mind again. She knew it the moment he spoke.\n \"How would I decide which lives to save, Kara?\" he asked quietly. \"I can only give so much blood. Do I sell it to the rich? Give it to the poor? How do I decide which life has more worth? A mother of three? A father of four? A child? A grandmother? There are millions of people, Kara, and I\u0027m only one man. I\u0027m not the Almighty. I don\u0027t want to hold the power of life and death in my hands. I don\u0027t want to make those kinds of decisions.\"\n He hadn\u0027t mentioned his own life, his own needs, but she knew he would never have any kind of private life if people knew the miraculous power of his blood. Everyone would want a piece of him_the public, the press, scientists, doctors, preachers and talk shows. He\u0027d never be able to go back to Moulton Bay, never have the time or the privacy to write another book. Some might think it selfish, his refusal to help, and if he was a mere human, she might think so, too. But he was an alien, and she knew that he would be hounded the rest of his life if people found out who he was, what he was. And that, she thought ruefully, could be a long, long time. Not only that, but his freedom would be forever lost. He would spend the rest of his life in a cage, being examined, questioned, analyzed.\n Selfishly, she realized that they would never have a life together if the world discovered his identity. And she wanted a future with Alex more than anything she had ever wanted in her life.\n Right or wrong, selfish or not, she intended to have it.\n They were driving on fumes and luck by the time they reached Moulton Bay. The clock on the dash put the time at nine-thirty.\n She\u0027d no sooner parked the truck in the garage than the engine sputtered and died. Opening the door, she slid from behind the wheel and followed Alex into the house.\n Alex moved unerringly through the darkness until he heard her stumble. Cursing his thoughtlessness, he switched on a light.\n \"Are you all right?\" he asked.\n \"Fine.\" Lips compressed, she rubbed her knee where she\u0027d hit it against a table. \"Want to kiss it and make it better?\"\n Her words were light, teasing, but he saw the hope in her eyes, heard the yearning in her voice.\n With an effort, he hardened his heart against her. \"I need a shower,\" he said. \"I\u0027ll wait if you want to go first.\"\n \"No, you go ahead.\"\n With a curt nod, he went up the stairs. Moments later, she heard the sound of water running.\n For a moment, she thought of joining him, and then, with a sigh, she went into the kitchen. In his present mood, he had probably locked the door.\n She fixed herself a cup of strong black coffee, sipped it slowly as she wondered how they\u0027d locate Gail and Nana. Maybe one of the neighbors would know where they\u0027d gone. And what about Barrett? Just thinking of him caused her to shiver with revulsion.\n After rinsing the cup and putting it in the sink, she went through the house, making sure all the doors and windows were locked, wondering if it had been smart to come back here. It wouldn\u0027t take much effort for Barrett to find out where Alex lived.\n She was wandering through the den when she felt Alexander\u0027s presence behind her. Slowly, she turned to face him. He was wearing a pair of faded Levi\u0027s and a black sweater. His feet were bare, his hair was still damp. He lookedbeautiful and sexy. And distant.\n \"Your turn,\" he said tonelessly. \"I\u0027ll see you in the morning.\"\n With a nod, she left the room and went upstairs.\n She didn\u0027t know what was bothering him, but she intended to find out. Soon.\n Alex watched Kara leave the room; then he sat down at his desk and stared at the computer. After a moment, he switched it on.\n Calling up the file that contained his latest manuscript, he scanned the material from page one. The manuscript was far from finished, but he felt driven to work on the conclusion to the story, despite the fact that it was out of sequence.\n He thought a moment, and then began to write.\n I gazed at Melynda, knowing the time had come when there could be no more lies between us. I had courted her for over a year, never letting her know what I was, certain that the love in her eyes would turn to fear, or worse, to revulsion, when she knew I was not the man she thought I was, but I could wait no longer. Melynda had declared her love for me, and I, foolishly perhaps, had admitted I felt the same. Our kisses, innocently chaste at the beginning of our courtship, had grown more passionate, more intense, once our feelings were spoken aloud. The desire between us blossomed into a flower of rare beauty, but I could not take her virginity, could not forge that bond of intimacy between us.\n \"What is it?\" she asked. \"What did you want to tell me?\"\n Filled with self-loathing for what I was about to do, I gazed into her eyes and prayed that she would be able to forgive me for my deception . . .\n Alex sat back in his chair, his palms resting on either side of the keyboard.\n He doubted there would be a happy ending for himself and Kara, but he could grant one to his vampire.\n With a sigh, he began to write once again.\n Hesitantly, I told her the truth, then waited for her to spurn me, to flee in terror from the monster who had dared to love her.\n \"Vampire?\" she exclaimed softly. Her eyes narrowed as she looked at me. \"Vampire?\" she said again, and began to laugh.\n At first, I thought her hysterical with fear. Tears rolled down her cheeks; she held her sides as laughter continued to bubble from her lips.\n \"Vampire! Oh, Alesandro, is that all?\"\n \"Is that all?\" Iasked, shocked by her reaction. \"All? Isn\u0027t that enough?\"\n \"I\u0027ve known about that for months,\" she said, wiping the tears from her eyes.\n \"Known? How could you have known?\"\n \"I\u0027m not blind, or stupid,\" she replied with a toss of her head. \"You never eat, you cast no shadow, I never saw you during the day.\" She shrugged. \"I saw how you looked at me that night I pricked my finger on a thorn. I saw the hunger in your eyes before you turned away. I saw, and I knew.\"\n \"And you don\u0027t care?\"\n \"Of course I care, but . . .\" She smiled up at me. \"I thought you were going to tell me you were married.\"\n \"No,\" I said, my mind still reeling with her ready acceptance of what Iwas. \"I\u0027m not married.\"\n \"But you will be soon,\" she predicted.\n \"Will I?\"\n \"I\u0027m sure of it,\" she said, and rising on her tiptoes, she pressed her lips to mine, and in that kiss was the promise of forever . . .\n Forever, Alexander mused as he saved the file and exited the program. He had stayed in Moulton Bay too long. It was time to move on. Time to find a new place to live, a new name, a new identity. For him, it wouldn\u0027t be hard. He had no family to leave behind, no ties to bind him to one place. He could abandon civilization, hide out in a jungle in the Amazon until Barrett was dead . . .\n \"Alexander?\"\n He whirled around, startled to see Kara standing in the doorway. It was the first time she had taken him unawares. \"I thought you had turned in for the night.\"\n Kara shrugged. \"I\u0027m not tired.\"\n \"I am.\" He stood up, his chair between them. \"I\u0027m going to bed.\"\n \"No, you\u0027re not.\"\n He arched one thick black brow. \"No?\"\n \"Not until we get this straightened out.\"\n \"Get what straightened out?\"\n \"I want to know where you think you\u0027re going without me, and why.\"\n Too late, he realized that while he was writing he had neglected to maintain the barrier between his mind and hers.\n She crossed her arms over her breasts and regarded him solemnly. \"I\u0027m waiting.\"\n Alex stared at her. She was wearing one of his T-shirts and a pair of his socks, and nothing else. She should have looked ridiculous; instead, she looked young and innocent and vastly appealing. Her legs were long and slender. A wave of heat suffused him as he imagined them wrapped around his waist.\n \"I\u0027m going to bed,\" he said firmly, and brushed past her before she could stop him.\n In his room, he shut the door, stripped off his sweater, then went to the window and stared into the darkness. He had to get her out of here. She\u0027d never be safe with him, not until Barrett was no longer a threat. Until then, he had to find her a refuge of some kind. But where?\n He went suddenly still as the door opened.\n \"I\u0027m still waiting.\"\n Her scent, soap mingled with toothpaste and strawberry shampoo, was intoxicating. Hands clenched at his sides, he glanced over his shoulder. \"Go to bed, Kara.\"\n \"All right.\"\n Too late, he remembered there was only one bed in the house_his_and she was walking toward it.\n \"Kara . . .\" He raked his hands through his hair, then shoved them into his pocketsto keep from sweeping her into his arms.\n She sat on the edge of the mattress looking up at him. \"I\u0027m listening.\"\n \"Have you always been this stubborn?\"\n \"Pretty much.\"\n \"Kara, I don\u0027t want to cause you any more trouble.\"\n \"Then don\u0027t.\" She patted the mattress invitingly.\n Alex shook his head. \"Kara, please . . .\" The words, meant to be a firm denial, fell from his lips like a prayer. \"I\u0027m only thinking of you.\"\n \"I know, but I\u0027m a big girl, Alex. I can make my own decisions. You promised to love me and defend me,\" she reminded him quietly. \"You promised me your life, Alexander Claybourne, promised you would be mine for as long as you lived. Have you forgotten?\"\n \"No.\"\n \"Have you stopped loving me?\"\n \"No.\"\n \"I promised to stay by your side in good times and bad. Would you send me away and make me break that promise?\"\n He groaned low in his throat, as if her words had pierced his heart.\n \"Would you?\"\n \"To save your life, I would do anything. Anything. Even send you away.\"\n \"You\u0027ve never done me any harm. Giving me your blood saved my life.\"\n \"Getting you pregnant could be fatal.\"\n \"I\u0027m willing to take that chance.\"\n \"I\u0027m not.\"\n \"Isn\u0027t it a little late to worry about that now?\"\n Her words cut through him like a knife through water. What if she was already pregnant?\n \"I didn\u0027t mean it like that,\" Kara said quickly. \"I only meant we\u0027ve already made love numerous times and nothing bad has happened. Maybe you\u0027re worrying for nothing. Maybe you were right, and it isn\u0027t possible for us to have a child.\"\n \"And maybe it is.\" He looked at her, sitting on the bed, her beautiful blue eyes warm with love, and wondered what kind of monster he was that he wanted nothing more than to go to her, to wrap her in his arms and bury himself deep within her.\n \"You\u0027re not a monster, Alex.\" She smiled as a low groan rumbled in his throat. \"Now you know how I felt when you were reading my mind.\"\n \"Kara, what am I going to do with you?\"\n \"Love me, Alex. Just love me as I love you.\"\n \"With my dying breath, natayah.\"\n \"Prove it.\"\n He shook his head. \"Since I can\u0027t make you listen to reason, I\u0027ll make a bargain with you.\"\n She tilted her head to one side. \"A bargain?\"\n \"No morelovemaking between us until we\u0027re sure you\u0027re not already pregnant.\"\n \"And then?\"\n A muscle twitched in his cheek. \"One of us will be neutered.\"\n \"Neutered!\" she exclaimed, horrified by the idea. \"What\u0027s wrong with just using a contraceptive?\"\n \"None of them are foolproof.\"\n \"Neutered.\" She said the word as if it tasted bad. \"Which one of us?\" Kara shook her head as his gaze slid away from hers. \"No, Alex, I can\u0027t . . .\"\n \"I can\u0027t go to a hospital, or a doctor\u0027s office, Kara. I can\u0027t take a chance like that.\"\n \"But . . .\" She bit down on her lower lip. She wanted to shout at him, to scream that she wanted children, his children if she could have them.\n \"Perhaps it\u0027s time for you to re-think our relationship, Kara, to make sure you understand what you\u0027re giving up.\"\n Kara stared up at him, mute. She didn\u0027t want to re-think anything.She didn\u0027t want to live without Alex, and yet the thought of permanently putting an end to any hope of having children silenced the denial that rose to her lips.\n \"I\u0027ll sleep on the sofa,\" Alex said, and leftthe room, quietly closing the door behind him.\n Kara stared at the door. To be sterile. Never to have children. Even adoption might be out of the question. She didn\u0027t know what legalities were involved in adopting a child. She was certain that Alex must have a phony birth certificate. He drove a car, so he probably had a driver\u0027s license. He earned money, so he probably had a social security number. A harsh laugh escaped her lips. In two hundred years, he had probably accumulated numerous forms of identification.\n Alien.\n Two hundred years.\n It hit her then, really hit her for the first time. Alex was an alien. He had told her that people were the same all over, and yet he was still from another planet, another race of people. What if she did get pregnant? What might the result be? Images of newborn babies flashed through her mind_babies with four arms and two heads, babies with skin like leather, babies with three eyes . . .\n She was letting her imagination run wild and she knew it. Alex was perfectly healthy and so was she. If they were able to conceive a child, there was no reason why they couldn\u0027t have a perfectly formed baby. It was far more likely that she would be unable to conceive at all, and that brought her back to her original quandary. Did she love Alex enough to give up all hope of ever being a mother? But even as she asked herself that question, she knew there was more involved, much more. What would happen to their relationship when she aged and he did not? How would they ever be free of Barrett? Did she want to spend her whole life looking over her shoulder? Even if they changed their names and left the country, she\u0027d always be waiting, wondering if Barrett was still looking for them. And what about Nana and Gail? Barrett had used her sister and grandmother to get to her in the past; she knew he wouldn\u0027t hesitate to do it again.\n And then she thought of a life without Alex, and knew she would make any sacrifice necessary to be with him.\n Rising, she went to stand at the window. It was raining. She stared at the downpour through eyes blurred by tears and knew the cloudburst outside was nothing compared to the storm raging in her heart.\n Alex wandered through the house, acutely aware of Kara\u0027s turbulent emotions. No doubt she would leave him now. It would be for the best. She deserved a normal life, with a man who could share the daylight with her, give her children, grow old at her side. She deserved to be happy, secure. Living with him would always carry an element of danger. If she wanted to go to the zoo, to the beach, on a picnic, for a walk in the park on a summer day, she would have to go alone.\n Feeling as if the walls were closing in on him, he went out into the backyard and let the rain wash over him.\n How would he go on without her? If his life had seemed empty before, how much more desolate would it be now, when he had known Kara\u0027s love, heard her laughter, felt the touch of her hand? And yet, no matter how much he loved her, he could not give her the kind of life she deserved.\n He wanted her to be happy.\n He wanted to carry her back to his mountain lair and never let her go.\n He wanted a home and a family, the love and companionship of a woman with dreamy blue eyes, the sound of a child\u0027s laughter.\n He wanted Kara.\n And yet he knew the best thing he could do for her was get out of her life.\n And he knew, with a certainty that was too awful to be borne, that he didn\u0027t have the strength to do what was right; he knew that, if his weakness was the cause of herdeath, he would have nothing left to live for. If that day came, he would walk out into the sun and let it destroy him.\n Burdened with a weight of sorrow too heavy to bear, he sank to his knees, his tears mingling with the rain.\n Kara stared at the lone figure standing in the yard. Rain pelted his head and chest, soaking his trousers. She didn\u0027t have to probe his mind to know what he was thinking, what he was feeling. His pain was hers. His thoughts were her thoughts. She felt his loneliness, his yearning for a home and a family, his fear for her life should she become pregnant, the strong sense of guilt that everything that had happened to her was his fault. He wanted her, but he was afraid, afraid for her life, her future, afraid of causing her pain.\n She pressed her hand to her heart as he dropped to his knees, his head bowed, as if in surrender.\n She was the cause of his anguish. The knowledge that he was hurting because of her cut her to the quick.\n A heavy sigh shuddered through her as she realized what she had to do. For his sake, she would leave him, now, tonight. In time, he would forget her. He might even find someone else to love. In time.\n She laughed softly as she wrapped a blanket around her shoulders and crept down the stairs and out the front door. If there was one thing Alex had plenty of, it was time. \n","sourceLink":"https://allnovel.net/deeper-than-the-night/page-28.html","bookId":2308,"book":{"id":2308,"title":"Deeper than the Night","description":"Storyline: \n Townsfolk of Moulton Bay said there was something otherworldly about Alexander Claybourne. Some people whispered that with his dark, arresting features and mesmerising eyes, the seductive stranger looked every inch a vampire. They never guessed how near the truth they were-or that after more than two hundred years of resisting temptation, Claybourne had found a woman he had to possess. \n Never one to be scared off by superstitious lore, Kara Crawford laughed at the local talk of creatures lurking in the dark. What harm could come of befriending the handsome stranger with the haunted look in his midnight eyes? No matter what shadowy secrets Alexander hid, Kara felt drawn to him, compelled to join him beneath the silver light of the moon, where they would share a love...\n \n","cover":"https://allnovel.net/images/deeper-than-the-night.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/deeper-than-the-night.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:14:01 PM"}}
