{"id":95482,"no":35,"title":"Page 35","content":"They heard the news on the radio the following night. A young man, identified as Mitch Hamblin, had been found dead in an alley behind the Eagle Flats Bank. The apparent motive was listed as robbery. Kara stared at Alex, her heart pounding. \"You don\u0027t think . . . ?\" Alex nodded. \"Barrett.\" \"How?\" \"He must have followed Hamblin.\" Kara sat back in her chair. It was never going to end, she thought bleakly. Alex crossed the room and placed his hand on her shoulder. \"It will end, Kara. Soon.\" \"What do you mean?\" \"I\u0027m going after him. Tonight.\" \"No!\" \"We can\u0027t go on like this. I don\u0027t know about you, but I\u0027m tired of hiding, tired of being hunted. One way or another, it ends tonight.\" \"How are you going to find him?\" \"He must have followed Mitch hoping the kid would lead him to me. I\u0027m guessing Barrett\u0027s still in town. And if he is, I\u0027ll find him.\" \"And then what?\" His silence was all the answer she needed. \"Alex, you don\u0027t have to do this. We can leave the state, change our names, relocate somewhere else.\" He shook his head, and even though he didn\u0027t say anything, she knew what was in his mind. There was a child to think of now, and he wanted the trouble with Barrett over before their child was born. She knew why, knew he was afraid that Barrett would find them, that he might find a way to get hold of their child . . . She refused to think of what that might mean. She knew what Barrett was capable of, knew the greed that drove him, the lust for fame and glory. \"I\u0027ll be back as soon as I can.\" \"I\u0027m going with you.\" \"No.\" \"Yes.\" \"Dammit, Kara, you\u0027re pregnant!\" \"So?\" He stared at her in exasperation. \"I don\u0027t want to put your life, or . . . or my child\u0027s life, in danger.\" \"I\u0027ll feel safer with you than staying here alone.\" Alex shook his head. \"There\u0027s no way Barrett can get in here once the door is sealed.\" \"You can take me with you, or I\u0027ll walk down the damn mountain, but I\u0027m not staying here alone.\" \"Stubborn,\" Alex muttered. \"More stubborn than an ErAdonian mud-dog.\" \"I heard that,\" Kara said, \"and I don\u0027t think it was a compliment.\" Alex glared at her, and then he laughed. \"And prettier than a Glantan wildflower, even when she\u0027s angry.\" Taking her by the hand, he drew her to him, enfolding her in his arms. \"All right,\" he agreed, hating to lie to her, yet knowing it was for her own good, \"you can go.\" Kara smiled smugly. \"I knew you\u0027d see things my way.\" \"I don\u0027t think I\u0027ve had my own way since I met you.\" \"Are you complaining, Mr. Claybourne?\" \"No, ma\u0027am. Just stating a fact.\" \"You can have your way next week.\" \"Promise?\" \"Unless I change my mind. It\u0027s a woman\u0027s prerogative, you know.\" He hugged her close, his lips moving in her hair as he drew in her scent. Sweet, so sweet, this beautiful, stubborn woman who was now his wife. So sweet, he would not, could not, put her life in jeopardy. Swinging her into his arms, he carried her into the bedroom. \"What are you doing?\" Kara exclaimed. \"I\u0027m going to make love to you.\" \"Now? I thought we were going after Barrett.\" \"All in good time.\" She started to question him further, but his lips swooped down on hers, warm and hungry, driving all thought of Barrett from her mind. He made love to her with a fierce intensity, every touch branding her as his, every kiss filled with hope, every caress an unspoken promise for the future. His hands played over her gently, tenderly, as if she were a precious instrument, and he was the only one who could hear the music in her soul. He called her name as his warmth spilled into her and then, holding her tightly in his arms, he whispered that he loved her, would always love her. The sound of his voice was the last thing she heard before sleep claimed her. Alex waited until Kara was sleeping soundly before he left the cavern. He kissed her gently, knowing there was a chance he might never see her again, knowing she would never be safe while Barrett lived. It was after nine o\u0027clock when he reached Eagle Flats. He drove around the bank to the alley and parked the car. He left the engine running, switched off the headlights, then stepped out of the car. Standing in the shadows, he glanced up and down the alley. The scent of blood, too faint to be detected by mortals, stung his nostrils. Hamblin\u0027s blood. Regret and remorse rose within him. But for him, the young man would still be alive, he thought, and then shook his head. Barrett was to blame. There was only one motel in Eagle Flats, and that was his next stop. He drove slowly through the parking lot, his nostrils flaring as he searched for Barrett\u0027s scent, his lips curling back in a feral grin as he foundwhat he was looking for. He pulled up in front of the motel room and honked the horn. Once. Twice. After the third blast of the horn, the door opened and Jarvis poked his head out. Alex heard the man swear under his breath, then Jarvis slammed the door and Alex heard him yelling for Barrett. Less than a minute later, Jarvis and Barrett burst out of the room. With a grin, Alex drove out of the parking lot. Kara woke with a start. \"Alex?\" Sitting up, she placed her hand on his side of the mattress. The sheets were still warm. \"Alex?\" Jumping out of bed, she ran toward the door. It was then she saw the note tacked to the door. \"Kara, I\u0027ve gone after Barrett. If I\u0027m not back by tomorrow afternoon, the main door will open. You\u0027ll find my instructions and your cellular phone under that big rock outside the door. I love you. Alex.\" She read the note a second time, and then crumpled it in her hand. She should have known he\u0027d do something like this! Going into the living room, she looked at the clock. Ten P.M. \"I\u0027ll never forgive you for this, Alexander Claybourne,\" she muttered. \"Never.\" But even as she said the words, she knew them for a lie. \"Please, just come back to me,\" she whispered. \"That\u0027s all I ask.\" He drove fast enough to stay ahead of Barrett, but not fast enough to lose him. And all the while, he thought of Kara, and all she\u0027d been through. Thought of the baby she carried. Thought of Mitch Hamblin. Thought about the torture he had personally endured at Barrett\u0027s hands. The man deserved to die. The mountain loomed ahead, dark and mysterious in the waning light of the moon. Alex turned up the narrow road, slowing to make sure Barrett was still behind him. When he reached the cavern, he parked the car out of sight, then took cover in the shadows. Moments later, Barrett\u0027s car reached the top. From his vantage point, Alex watched the two men exit the car. Both men were armed. \"Where\u0027d he go?\" Jarvis asked. The doctor shrugged. \"I don\u0027t know, but this is the end of the road. He\u0027s got to be here somewhere. You go that way, and I\u0027ll check over here.\" Jarvis grunted, then started walking slowly along the ledge toward Alex\u0027s hiding place. Alex waited until the man walked past, then he stepped out of the shadows and struck the man over the head with a tree branch. Jarvis grunted softly as he toppled forward. Alex caught him before he hit the ground and dragged him into the brush that grew alongside the ledge, then went back to the road and picked up the man\u0027s gun. It was a snub-nosed .38. Moving cautiously, Alex made his way toward the far end of the ledge. And Barrett. As he drew nearer the cavern, he could hear Barrett\u0027s footsteps, and then he saw the doctor standing at the end of the ledge near the entrance to the cavern. \"Looking forme, doc?\" Alex drawled. Barrett whirled around, his gun seeking a target, but there was nothing to see except the darkness. \"Drop your weapon,\" Alex said. \"No way. Where\u0027s Jarvis?\" \"Taking a nap. Drop your gun, Barrett. It\u0027s over.\" \"I don\u0027t think so.\" Barrett glanced around. \"So, this is where you live.\" \"And this is where you die, unless you drop your gun.\" \"You must think I\u0027m a fool.\" \"That\u0027s the best thing I ever thought of you. Why\u0027d you kill Hamblin?\" \"I didn\u0027t kill anybody.\" \"Maybe you didn\u0027t pull the trigger, but you killed him just the same.\" \"You can\u0027t prove a thing,\" Barrett said, his voice thick with contempt. \"Even if you went to the police, who\u0027d believe you?\" \"I\u0027m not going to the police. We\u0027re going to settle this here and now.\" A gunshot ripped through the night. Alex ducked as he felt the heat of the bullet near his head, swore under his breath as Barrett fired off another round, and then another. Alex!He heard Kara\u0027s voice inside his mind, knew she was standing at the portal, beating her fists against the door. I\u0027m all right, natayah. Let me out of here! Soon . . . Moving silently through the underbrush, he changed position. \"Barrett,\" he called, \"drop the gun.\" Muttering an oath, the doctor whirled around and fired in the direction of Alex\u0027s voice. \"Damn you,\" he cried, \"show yourself!\" \"I\u0027m here,\" Alex called, then flung himself to the ground as two gunshots rent the stillness of the night. \"We\u0027re doing this all wrong,\" Barrett said placatingly. \"I\u0027m not your enemy. We should be working together.\" He peered into the darkness. \"We could do wonderful things for humanity. Think of the lives we could save.\" \"The money you could make.\" \"I\u0027ll split it with you. Fifty-fifty.\" \"That\u0027s mighty damn generous of you, doc.\" \"All right. Sixty-forty.\" \"No deal.\" A wordless cry of frustration rumbled in Barrett\u0027s throat as he fired into the shadows. \"That\u0027s six,\" Alex remarked, stepping onto the ledge. Barrett froze, and then cursed softly. \"So, what now? You gonna kill me?\" \"Right the first time.\" Barrett took a step backward, the blood draining from his face. \"You wouldn\u0027t. You can\u0027t.\" \"Who\u0027s going to stop me?\" Barrett stared at him for stretched seconds; then, with a wordless sob, he whirled around and plunged into the darkness. The scent of fear stained the clear night air. Between one breath and the next, Alex felt the thin veneer of civilization slip away, felt the ancient urge to hunt sweepover him, and with it the almost overwhelming desire to kill, to feast on the blood of the man who had caused Kara pain. Neither of them would know a moment\u0027s peace until Dale Barrett was no longer a threat. Tossing the gun aside, Alex ran after the doctor. He could hear Barrett moving through the underbrush, hear the harsh rasp of his breathing, feel the vibration of his footsteps as he ran through the darkness. The scent of Barrett\u0027s fear grew stronger as Alex closed the distance between them. Age-old legends of his warrior ancestors raced through his mind, tales of ArkLa the Terrible, who had gorged himself on the blood of his enemies. He felt a thrill of exhilaration as he realized that Barrett was running in circles. Soon he would be back at the entrance to the cavern with nowhere else to run, nowhere to hide. And then Barrett was in front of him, his back pressed against the wall of the cavern, his eyes wide with fear as he realized he was well and truly caught. Slowly, inexorably, Alex closed the distance between them. Barrett let out a high-pitched squeak of fear as Alex\u0027s hand closed around his throat, slowly, slowly, choking the life from his body. Alex stared down at the man squirming in his grasp, felt the lust for blood rise up within him swift and hot and sure. And then he heard Kara\u0027s voice penetrate the red haze that engulfed him. Alex? He took a deep breath. Everything\u0027s all right, Kara. Don\u0027t worry. Where\u0027s Barrett? Alex\u0027s hand closed a little tighter around Barrett\u0027s throat. Right here. You haven\u0027t . . . Not yet. Alex, don\u0027t. Please don\u0027t. He stared down into Barrett\u0027s face. The doctor\u0027s eyes were white with terror, his face red with the effort to draw a breath. Alex? It isn\u0027t worth it. Please . . . The sound of her voice, sweet and pure, stilled the rage within him. He took a deep breath and relaxed his grip on Barrett\u0027s throat. Kara, bring me something to tie him up with. Why? Just do it. I can\u0027t. The door\u0027s locked. It\u0027s open now. \"You\u0027re a lucky man, Barrett.\" \"What . . . what are you gonna do to me?\" Barrett asked tremulously. \"You\u0027ll never know.\" Barrett swallowed hard. \"What\u0027s that supposed to mean?\" Alex grinned as he stepped forward and struck Barrett across the temple with the butt of the gun. \"Enough questions, doc.\" Moments later, Kara ran outside. She gasped when she saw Barrett sprawled across the ledge. \"What have you done?\" \"Nothing. He\u0027s unconscious, that\u0027s all. Tie his hands behind his back while I go get the other one.\" \"Alex . . .\" \"No time for questions now, natayah.\" She frowned at him; then, with a sigh, she knelt beside Barrett. Removing the sash from her robe, she tied his hands together. Kara glanced at the passing countryside. \"Where are we going?\" She glanced into the back seat. Alex had found Barrett\u0027s black bag in the trunk and had given the doctor and Jarvis injections to keep them unconscious. Now they were sleeping peacefully in the back seat. \"And why are we taking Barrett\u0027s car?\" Alex ran his hand over the steering wheel. \"It\u0027s a nice car, don\u0027t you think?\" Kara nodded. Barrett drove a late model Lincoln with leather upholstery and every extra one could imagine. \"You haven\u0027t answered my question.\" \"His car has a bigger trunk than your Camry.\" \"Alex!\" \"It\u0027ll be light before we get to Silverdale . . .\" \"Silverdale!\" Alex nodded. \"When the sun comes up, I\u0027m going to climb in the trunk.\" He shrugged, then grinned. \"No sense being cramped in the back of your Camry. Besides, we can\u0027t leave his car up on the mountain.\" \"Why are we going back to Silverdale, of all places?\" \"You\u0027ll see.\" \"Alex!\" \"If I tell you, it will spoil the surprise. Do you think you can find your way to the lab from here?\" \"I found it before, didn\u0027t I?\" \"It\u0027s going to be light soon.\" He pulled off the road and switched off the engine. \"I\u0027m gonna get in the trunk now. We should reach Silverdale about midnight.\" \"I\u0027m not going another mile until you tell me what\u0027s going on.\" \"Trust me, Kara. You\u0027ll love it.\" \"Stubborn man! Are you sure they won\u0027t regain consciousness before we get to Silverdale?\" \"I\u0027m sure.\" He kissed her then, one long sweet kiss, then got out of the car and opened the trunk. Kara followed him. \"Are you sure you\u0027ll be all right in there?\" \"I\u0027m sure.\" He kissed her again, quickly, then climbed inside the trunk. \"Close the lid for me, will you?\" \"All right,\" she grumbled. \"But I can\u0027t promise I\u0027ll let you out again.\" \"You will,\" he said with smug male arrogance. \"Maybe, maybe not.\" With a shake of her head, Kara closed the lid. Maybe she should write a book, she mused as she slid behind the wheel and started the ignition. Only who would believe it? At dusk, she pulled over and opened the trunk. Alex grinned up at her, then climbed out of the trunk. \"Everything all right?\" \"Yes, they\u0027re still out.\" She watched him stretch his arms and legs. \"Are you okay?\" \"Never better.\" They reached the lab an hour after midnight. Kara shivered as she looked at the building. She had hoped never to see this place again. She waited beside the car while Alex carried Barrett into the building, then came back for Jarvis. \"Are you sure you know what you\u0027re doing?\" Kara asked as she followed Alex into the lab and shut the door. \"Yes, ma\u0027am.\" She followed him down the dimly lit corridor, watched as he placed Jarvis on a metal table. Barrett, still unconscious, was strapped to a second table. An image of herself and Alex strapped to those very same tables flashed through her mind. \"Now what?\" she asked. \"A little ErAdonian magic,\" Alex replied. And then, while she watched, he filled two syringes with his blood. Slowly, incredulously, she realized what he was going to do. \"Why?\" she asked, watching as he prepared to give Barrett a transfusion. \"Why are you giving him your blood?\" \"It\u0027s part of the magic,\" Alex said, grinning. \"Wait and see.\" He refused to say more. Taking her by the hand, he led her into the corridor, backed her up against a wall, and kissed her. \"I love you,\" he said, nuzzling her neck. \"Did you know that?\" She nodded, her mind going in circles trying to figure out what he was going to do while her body responded to his touch. Just when she was about to pull him down on the floor, she heard a low groan. \"He\u0027s awake,\" Alex said, taking her by the hand. \"Come on.\" Barrett and Jarvis were both awake and tugging against the straps that held them. \"Turn me loose!\" Barrett demanded. \"All in good time,\" Alex said. \"What are you going to do?\" Jarvis asked, his voice ragged with fear. \"I\u0027m going to conduct a little experiment of my own,\" Alex said. \"Now,who wants to go first?\"","sourceLink":"https://allnovel.net/deeper-than-the-night/page-35.html","bookId":2308,"book":{"id":2308,"title":"Deeper than the Night","description":"Storyline: Townsfolk of Moulton Bay said there was something otherworldly about Alexander Claybourne. Some people whispered that with his dark, arresting features and mesmerising eyes, the seductive stranger looked every inch a vampire. They never guessed how near the truth they were-or that after more than two hundred years of resisting temptation, Claybourne had found a woman he had to possess. Never one to be scared off by superstitious lore, Kara Crawford laughed at the local talk of creatures lurking in the dark. What harm could come of befriending the handsome stranger with the haunted look in his midnight eyes? No matter what shadowy secrets Alexander hid, Kara felt drawn to him, compelled to join him beneath the silver light of the moon, where they would share a love...","cover":"https://allnovel.net/images/deeper-than-the-night.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/deeper-than-the-night.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:14:01 PM"}}
