{"id":22363,"no":36,"title":"Chapter 36","content":"IS A VERY SHORT ONE, AND MAY APPEAR OF NO GREAT IMPORTANCE IN ITS PLACE, BUT IT SHOULD BE READ NOTWITHSTANDING, AS A SEQUEL TO THE LAST, AND A KEY TO ONE THAT WILL FOLLOW WHEN ITS TIME ARRIVES \u0027And so you are resolved to be my travelling companion this morning; eh?\u0027 said the doctor, as Harry Maylie joined him and Oliver at the breakfast-table. \u0027Why, you are not in the same mind or intention two half-hours together!\u0027 \u0027You will tell me a different tale one of these days,\u0027 said Harry, colouring without any perceptible reason. \u0027I hope I may have good cause to do so,\u0027 replied Mr. Losberne; \u0027though I confess I don\u0027t think I shall. But yesterday morning you had made up your mind, in a great hurry, to stay here, and to accompany your mother, like a dutiful son, to the sea-side. Before noon, you announce that you are going to do me the honour of accompanying me as far as I go, on your road to London. And at night, you urge me, with great mystery, to start before the ladies are stirring; the consequence of which is, that young Oliver here is pinned down to his breakfast when he ought to be ranging the meadows after botanical phenomena of all kinds. Too bad, isn\u0027t it, Oliver?\u0027 \u0027I should have been very sorry not to have been at home when you and Mr. Maylie went away, sir,\u0027 rejoined Oliver. \u0027That\u0027s a fine fellow,\u0027 said the doctor; \u0027you shall come and see me when you return. But, to speak seriously, Harry; has any communication from the great nobs produced this sudden anxiety on your part to be gone?\u0027 \u0027The great nobs,\u0027 replied Harry, \u0027under which designation, I presume, you include my most stately uncle, have not communicated with me at all, since I have been here; nor, at this time of the year, is it likely that anything would occur to render necessary my immediate attendance among them.\u0027 \u0027Well,\u0027 said the doctor, \u0027you are a queer fellow. But of course they will get you into parliament at the election before Christmas, and these sudden shiftings and changes are no bad preparation for political life. There\u0027s something in that. Good training is always desirable, whether the race be for place, cup, or sweepstakes.\u0027 Harry Maylie looked as if he could have followed up this short dialogue by one or two remarks that would have staggered the doctor not a little; but he contented himself with saying, \u0027We shall see,\u0027 and pursued the subject no farther. The post-chaise drove up to the door shortly afterwards; and Giles coming in for the luggage, the good doctor bustled out, to see it packed. \u0027Oliver,\u0027 said Harry Maylie, in a low voice, \u0027let me speak a word with you.\u0027 Oliver walked into the window-recess to which Mr. Maylie beckoned him; much surprised at the mixture of sadness and boisterous spirits, which his whole behaviour displayed. \u0027You can write well now?\u0027 said Harry, laying his hand upon his arm. \u0027I hope so, sir,\u0027 replied Oliver. \u0027I shall not be at home again, perhaps for some time; I wish you would write to me--say once a fort-night: every alternate Monday: to the General Post Office in London. Will you?\u0027 \u0027Oh! certainly, sir; I shall be proud to do it,\u0027 exclaimed Oliver, greatly delighted with the commission. \u0027I should like to know how--how my mother and Miss Maylie are,\u0027 said the young man; \u0027and you can fill up a sheet by telling me what walks you take, and what you talk about, and whether she--they, I mean--seem happy and quite well. You understand me?\u0027 \u0027Oh! quite, sir, quite,\u0027 replied Oliver. \u0027I would rather you did not mention it to them,\u0027 said Harry, hurrying over his words; \u0027because it might make my mother anxious to write to me oftener, and it is a trouble and worry to her. Let it be a secret between you and me; and mind you tell me everything! I depend upon you.\u0027 Oliver, quite elated and honoured by a sense of his importance, faithfully promised to be secret and explicit in his communications. Mr. Maylie took leave of him, with many assurances of his regard and protection. The doctor was in the chaise; Giles (who, it had been arranged, should be left behind) held the door open in his hand; and the women-servants were in the garden, looking on. Harry cast one slight glance at the latticed window, and jumped into the carriage. \u0027Drive on!\u0027 he cried, \u0027hard, fast, full gallop! Nothing short of flying will keep pace with me, to-day.\u0027 \u0027Halloa!\u0027 cried the doctor, letting down the front glass in a great hurry, and shouting to the postillion; \u0027something very short of flying will keep pace with _me_. Do you hear?\u0027 Jingling and clattering, till distance rendered its noise inaudible, and its rapid progress only perceptible to the eye, the vehicle wound its way along the road, almost hidden in a cloud of dust: now wholly disappearing, and now becoming visible again, as intervening objects, or the intricacies of the way, permitted. It was not until even the dusty cloud was no longer to be seen, that the gazers dispersed. And there was one looker-on, who remained with eyes fixed upon the spot where the carriage had disappeared, long after it was many miles away; for, behind the white curtain which had shrouded her from view when Harry raised his eyes towards the window, sat Rose herself. \u0027He seems in high spirits and happy,\u0027 she said, at length. \u0027I feared for a time he might be otherwise. I was mistaken. I am very, very glad.\u0027 Tears are signs of gladness as well as grief; but those which coursed down Rose\u0027s face, as she sat pensively at the window, still gazing in the same direction, seemed to tell more of sorrow than of joy. “这么说，你决定今天早上跟我一块儿走了，嗯？”大夫问道，哈利梅莱这时走到餐桌前，跟他和奥立弗一起吃早点。“怎么，你的心情或者说打算，前半个小时和后半个小时都不一样。” “好歹有一天，你会改变看法的。”哈利无缘无故地红了脸，说道。 “但愿我会，”罗斯伯力先生答道，“不过我承认，我恐怕做不到。可昨天早晨，你还匆匆忙忙决定留下来，像一个孝顺儿子，陪你妈妈到海边去。还没到中午，你又宣布，你要顺道陪我去伦敦，给我这么大面子。晚上，你又神秘兮兮地鼓动我在女士们起床之前就动身。结果呢，小奥立弗到现在还给钉在这儿吃早点，他本来早该去牧场寻找各样奇花异草了。太糟糕了，不是吗，奥立弗？” “要是你跟梅莱先生上路的时候我不在家，我会非常难过的，先生。”奥立弗答道。 “那才够交情，”大夫说道，“你回来的时候可得来找我。不过，说正经的，哈利，你这么急着要走，是不是大人物那边有什么消息？” “大人物，”哈利回答，“在这个称谓下边，你恐怕把我那位非常体面的老前辈也包括进去了。自从我来到这里，大人物根本就没和我联系过，一年中的这个时候好像不大可能有什么事，要我务必赶到他们那儿去。” “好啊，”大夫说道，“你这家伙真怪。可话说回来，他们可能在圣诞节前的选举中把你送进议会，你这套一会儿一个花样的作风对于准备从政倒没有什么坏处。这其中自有一定道理。不管是为了角逐地位，锦标，还是赌****，训练有素总是需要的。” 哈利梅莱的样子似乎无意将这一番简短的对话继续下去，否则他只消用一两句话就能把大夫给噎住，他只说了一句“我们走着瞧”，没有继续发挥下去。不一会儿，驿车驶到了门口，凯尔司进来取行李，好心的大夫奔到外边，看行李捆扎得是否牢靠。 “奥立弗，”哈利压低声音说道，“我跟你说句话。” 奥立弗走到站在窗前向自己打招呼的梅莱先生面前，见他整个神态显示出悲哀与激动交织在一起的心情，不由得大吃一惊。 “你现在学会写字了，是吗？”哈利把一只手搭在他的肩膀上。 “恐怕是这样，先生。”奥立弗回答。 “我又要出门了，也许要走一段时间。我希望你给我写信――就算半个月一次吧。每隔一个礼拜的礼拜一，交伦敦邮政总局。可以吗？” “噢。那还用说，先生，我很高兴做这件事。”奥立弗大声说道，对这项使命非常满意。 “我想要知道――知道我母亲和露丝小姐身体好不好，”青年绅士说，“你可以写上满满的一张纸，告诉我，你们怎样散步，你们谈了些什么――她是不是――我说的是她们――看上去是不是非常快乐，非常健康。你懂我的意思？” “噢，懂，先生，完全懂。”奥立弗答道。 “你不要向她们提起这件事，”哈利紧赶着把话带了过去，“因为这样一来我母亲会急于更勤地给我写信，这对于她可是一件麻烦和操心的事。这就算是你我之间的一个秘密，别忘了把每件事都告诉我。全靠你了。” 奥立弗意识到了自己的重要性，很有几分得意，感到很荣幸，他诚心诚意地保证守口如瓶，实话实说。梅莱先生向他告别，并一再承诺，要多多关心他、保护他。 大夫上了马车。凯尔司手扶着打开的车门站在一旁（已经安排好了，他后一步走）。两个女仆在花园里看着他们。哈利朝那扇格子窗偷偷扫了一眼，跳上马车。 “走！”他嚷着说，“使劲，快，用最快速度！今天只有开飞车才合我的心意。” “喂喂。”大夫连忙把面前的玻璃放下来，冲着车夫吆喝道，“开什么也别开飞车，这才合我的心意，听见没有？” 铃声叮叮，蹄声得得，驿车顺着大路走远了，声音渐渐听不到了，只看见马车在飞速行驶，几乎隐没在飞扬的尘土之中，时而完全消失，时而重新出现，这取决于视线是否受阻或道路情况是否复杂。直到连那一团烟尘也看不见了，注目相送的人才各自散去。 驿车早就驶出好几英里开外了，却还有一位送行的人依然用眼睛盯着驿车消逝的那个地方。原来当哈利朝着窗子抬眼望去的时候，露丝本人就坐在那道白色窗帘的后边，窗帘挡住了哈利的视线。 “他好像很高兴的样子，”她终于开口了，“我一时还担心他会怎么样呢。我估计错了。我真是非常，非常高兴。” 眼泪是悲哀的信号，也是欢乐的信号。但是，当露丝坐在窗前沉思时，眼睛依旧盯着同一个方向，从她脸上滚落下来的泪水中蕴含着的忧伤却似乎多于欢乐。","sourceLink":"http://novel.tingroom.com/jingdian/97/5092.html","bookId":474,"book":{"id":474,"title":"Oliver Twist雾都孤儿","description":"简介： 《雾都孤儿》是英国作家狄更斯于1838年出版的写实小说。以雾都伦敦为背景，讲述了一个孤儿悲惨的身世及遭遇，主人公奥立弗在孤儿院长大，经历学徒生涯，艰苦逃难，误入贼窝，又被迫与狠毒的凶徒为伍，历尽无数辛酸，最后在善良人的帮助下，查明身世并获得了幸福。如同狄...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12898724529f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/97","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
