{"id":22367,"no":40,"title":"Chapter 40","content":"A STRANGE INTERVIEW, WHICH IS A SEQUEL TO THE LAST CHAMBER \\n\\n The girl\u0027s life had been squandered in the streets, and among the most noisome of the stews and dens of London, but there was something of the woman\u0027s original nature left in her still; and when she heard a light step approaching the door opposite to that by which she had entered, and thought of the wide contrast which the small room would in another moment contain, she felt burdened with the sense of her own deep shame, and shrunk as though she could scarcely bear the presence of her with whom she had sought this interview. \\n\\n But struggling with these better feelings was pride,--the vice of the lowest and most debased creatures no less than of the high and self-assured. The miserable companion of thieves and ruffians, the fallen outcast of low haunts, the associate of the scourings of the jails and hulks, living within the shadow of the gallows itself,--even this degraded being felt too proud to betray a feeble gleam of the womanly feeling which she thought a weakness, but which alone connected her with that humanity, of which her wasting life had obliterated so many, many traces when a very child. \\n\\n She raised her eyes sufficiently to observe that the figure which presented itself was that of a slight and beautiful girl; then, bending them on the ground, she tossed her head with affected carelessness as she said: \\n\\n \u0027It\u0027s a hard matter to get to see you, lady. If I had taken offence, and gone away, as many would have done, you\u0027d have been sorry for it one day, and not without reason either.\u0027 \\n\\n \u0027I am very sorry if any one has behaved harshly to you,\u0027 replied Rose. \u0027Do not think of that. Tell me why you wished to see me. I am the person you inquired for.\u0027 \\n\\n The kind tone of this answer, the sweet voice, the gentle manner, the absence of any accent of haughtiness or displeasure, took the girl completely by surprise, and she burst into tears. \\n\\n \u0027Oh, lady, lady!\u0027 she said, clasping her hands passionately before her face, \u0027if there was more like you, there would be fewer like me,--there would--there would!\u0027 \\n\\n \u0027Sit down,\u0027 said Rose, earnestly. \u0027If you are in poverty or affliction I shall be truly glad to relieve you if I can,--I shall indeed. Sit down.\u0027 \\n\\n \u0027Let me stand, lady,\u0027 said the girl, still weeping, \u0027and do not speak to me so kindly till you know me better. It is growing late. Is--is--that door shut?\u0027 \\n\\n \u0027Yes,\u0027 said Rose, recoiling a few steps, as if to be nearer assistance in case she should require it. \u0027Why?\u0027 \\n\\n \u0027Because,\u0027 said the girl, \u0027I am about to put my life and the lives of others in your hands. I am the girl that dragged little Oliver back to old Fagin\u0027s on the night he went out from the house in Pentonville.\u0027 \\n\\n \u0027You!\u0027 said Rose Maylie. \\n\\n \u0027I, lady!\u0027 replied the girl. \u0027I am the infamous creature you have heard of, that lives among the thieves, and that never from the first moment I can recollect my eyes and senses opening on London streets have known any better life, or kinder words than they have given me, so help me God! Do not mind shrinking openly from me, lady. I am younger than you would think, to look at me, but I am well used to it. The poorest women fall back, as I make my way along the crowded pavement.\u0027 \\n\\n \u0027What dreadful things are these!\u0027 said Rose, involuntarily falling from her strange companion. \\n\\n \u0027Thank Heaven upon your knees, dear lady,\u0027 cried the girl, \u0027that you had friends to care for and keep you in your childhood, and that you were never in the midst of cold and hunger, and riot and drunkenness, and--and--something worse than all--as I have been from my cradle. I may use the word, for the alley and the gutter were mine, as they will be my deathbed.\u0027 \\n\\n \u0027I pity you!\u0027 said Rose, in a broken voice. \u0027It wrings my heart to hear you!\u0027 \\n\\n \u0027Heaven bless you for your goodness!\u0027 rejoined the girl. \u0027If you knew what I am sometimes, you would pity me, indeed. But I have stolen away from those who would surely murder me, if they knew I had been here, to tell you what I have overheard. Do you know a man named Monks?\u0027 \\n\\n \u0027No,\u0027 said Rose. \\n\\n \u0027He knows you,\u0027 replied the girl; \u0027and knew you were here, for it was by hearing him tell the place that I found you out.\u0027 \\n\\n \u0027I never heard the name,\u0027 said Rose. \\n\\n \u0027Then he goes by some other amongst us,\u0027 rejoined the girl, \u0027which I more than thought before. Some time ago, and soon after Oliver was put into your house on the night of the robbery, I--suspecting this man--listened to a conversation held between him and Fagin in the dark. I found out, from what I heard, that Monks--the man I asked you about, you know--\u0027 \\n\\n \u0027Yes,\u0027 said Rose, \u0027I understand.\u0027 \\n\\n \u0027--That Monks,\u0027 pursued the girl, \u0027had seen him accidently with two of our boys on the day we first lost him, and had known him directly to be the same child that he was watching for, though I couldn\u0027t make out why. A bargain was struck with Fagin, that if Oliver was got back he should have a certain sum; and he was to have more for making him a thief, which this Monks wanted for some purpose of his own.\u0027 \\n\\n \u0027For what purpose?\u0027 asked Rose. \\n\\n \u0027He caught sight of my shadow on the wall as I listened, in the hope of finding out,\u0027 said the girl; \u0027and there are not many people besides me that could have got out of their way in time to escape discovery. But I did; and I saw him no more till last night.\u0027 \\n\\n \u0027And what occurred then?\u0027 \\n\\n \u0027I\u0027ll tell you, lady. Last night he came again. Again they went upstairs, and I, wrapping myself up so that my shadow would not betray me, again listened at the door. The first words I heard Monks say were these: \"So the only proofs of the boy\u0027s identity lie at the bottom of the river, and the old hag that received them from the mother is rotting in her coffin.\" They laughed, and talked of his success in doing this; and Monks, talking on about the boy, and getting very wild, said that though he had got the young devil\u0027s money safely now, he\u0027d rather have had it the other way; for, what a game it would have been to have brought down the boast of the father\u0027s will, by driving him through every jail in town, and then hauling him up for some capital felony which Fagin could easily manage, after having made a good profit of him besides.\u0027 \\n\\n \u0027What is all this!\u0027 said Rose. \\n\\n \u0027The truth, lady, though it comes from my lips,\u0027 replied the girl. \u0027Then, he said, with oaths common enough in my ears, but strange to yours, that if he could gratify his hatred by taking the boy\u0027s life without bringing his own neck in danger, he would; but, as he couldn\u0027t, he\u0027d be upon the watch to meet him at every turn in life; and if he took advantage of his birth and history, he might harm him yet. \"In short, Fagin,\" he says, \"Jew as you are, you never laid such snares as I\u0027ll contrive for my young brother, Oliver.\"\u0027 \\n\\n \u0027His brother!\u0027 exclaimed Rose. \\n\\n \u0027Those were his words,\u0027 said Nancy, glancing uneasily round, as she had scarcely ceased to do, since she began to speak, for a vision of Sikes haunted her perpetually. \u0027And more. When he spoke of you and the other lady, and said it seemed contrived by Heaven, or the devil, against him, that Oliver should come into your hands, he laughed, and said there was some comfort in that too, for how many thousands and hundreds of thousands of pounds would you not give, if you had them, to know who your two-legged spaniel was.\u0027 \\n\\n \u0027You do not mean,\u0027 said Rose, turning very pale, \u0027to tell me that this was said in earnest?\u0027 \\n\\n \u0027He spoke in hard and angry earnest, if a man ever did,\u0027 replied the girl, shaking her head. \u0027He is an earnest man when his hatred is up. I know many who do worse things; but I\u0027d rather listen to them all a dozen times, than to that Monks once. It is growing late, and I have to reach home without suspicion of having been on such an errand as this. I must get back quickly.\u0027 \\n\\n \u0027But what can I do?\u0027 said Rose. \u0027To what use can I turn this communication without you? Back! Why do you wish to return to companions you paint in such terrible colors? If you repeat this information to a gentleman whom I can summon in an instant from the next room, you can be consigned to some place of safety without half an hour\u0027s delay.\u0027 \\n\\n \u0027I wish to go back,\u0027 said the girl. \u0027I must go back, because--how can I tell such things to an innocent lady like you?--because among the men I have told you of, there is one: the most desperate among them all; that I can\u0027t leave: no, not even to be saved from the life I am leading now.\u0027 \\n\\n \u0027Your having interfered in this dear boy\u0027s behalf before,\u0027 said Rose; \u0027your coming here, at so great a risk, to tell me what you have heard; your manner, which convinces me of the truth of what you say; your evident contrition, and sense of shame; all lead me to believe that you might yet be reclaimed. Oh!\u0027 said the earnest girl, folding her hands as the tears coursed down her face, \u0027do not turn a deaf ear to the entreaties of one of your own sex; the first--the first, I do believe, who ever appealed to you in the voice of pity and compassion. Do hear my words, and let me save you yet, for better things.\u0027 \\n\\n \u0027Lady,\u0027 cried the girl, sinking on her knees, \u0027dear, sweet, angel lady, you _are_ the first that ever blessed me with such words as these, and if I had heard them years ago, they might have turned me from a life of sin and sorrow; but it is too late, it is too late!\u0027 \\n\\n \u0027It is never too late,\u0027 said Rose, \u0027for penitence and atonement.\u0027 \\n\\n \u0027It is,\u0027 cried the girl, writhing in agony of her mind; \u0027I cannot leave him now! I could not be his death.\u0027 \\n\\n \u0027Why should you be?\u0027 asked Rose. \\n\\n \u0027Nothing could save him,\u0027 cried the girl. \u0027If I told others what I have told you, and led to their being taken, he would be sure to die. He is the boldest, and has been so cruel!\u0027 \\n\\n \u0027Is it possible,\u0027 cried Rose, \u0027that for such a man as this, you can resign every future hope, and the certainty of immediate rescue? It is madness.\u0027 \\n\\n \u0027I don\u0027t know what it is,\u0027 answered the girl; \u0027I only know that it is so, and not with me alone, but with hundreds of others as bad and wretched as myself. I must go back. Whether it is God\u0027s wrath for the wrong I have done, I do not know; but I am drawn back to him through every suffering and ill usage; and I should be, I believe, if I knew that I was to die by his hand at last.\u0027 \\n\\n \u0027What am I to do?\u0027 said Rose. \u0027I should not let you depart from me thus.\u0027 \\n\\n \u0027You should, lady, and I know you will,\u0027 rejoined the girl, rising. \u0027You will not stop my going because I have trusted in your goodness, and forced no promise from you, as I might have done.\u0027 \\n\\n \u0027Of what use, then, is the communication you have made?\u0027 said Rose. \u0027This mystery must be investigated, or how will its disclosure to me, benefit Oliver, whom you are anxious to serve?\u0027 \\n\\n \u0027You must have some kind gentleman about you that will hear it as a secret, and advise you what to do,\u0027 rejoined the girl. \\n\\n \u0027But where can I find you again when it is necessary?\u0027 asked Rose. \u0027I do not seek to know where these dreadful people live, but where will you be walking or passing at any settled period from this time?\u0027 \\n\\n \u0027Will you promise me that you will have my secret strictly kept, and come alone, or with the only other person that knows it; and that I shall not be watched or followed?\u0027 asked the girl. \\n\\n \u0027I promise you solemnly,\u0027 answered Rose. \\n\\n \u0027Every Sunday night, from eleven until the clock strikes twelve,\u0027 said the girl without hesitation, \u0027I will walk on London Bridge if I am alive.\u0027 \\n\\n \u0027Stay another moment,\u0027 interposed Rose, as the girl moved hurriedly towards the door. \u0027Think once again on your own condition, and the opportunity you have of escaping from it. You have a claim on me: not only as the voluntary bearer of this intelligence, but as a woman lost almost beyond redemption. Will you return to this gang of robbers, and to this man, when a word can save you? What fascination is it that can take you back, and make you cling to wickedness and misery? Oh! is there no chord in your heart that I can touch! Is there nothing left, to which I can appeal against this terrible infatuation!\u0027 \\n\\n \u0027When ladies as young, and good, and beautiful as you are,\u0027 replied the girl steadily, \u0027give away your hearts, love will carry you all lengths--even such as you, who have home, friends, other admirers, everything, to fill them. When such as I, who have no certain roof but the coffinlid, and no friend in sickness or death but the hospital nurse, set our rotten hearts on any man, and let him fill the place that has been a blank through all our wretched lives, who can hope to cure us? Pity us, lady--pity us for having only one feeling of the woman left, and for having that turned, by a heavy judgment, from a comfort and a pride, into a new means of violence and suffering.\u0027 \\n\\n \u0027You will,\u0027 said Rose, after a pause, \u0027take some money from me, which may enable you to live without dishonesty--at all events until we meet again?\u0027 \\n\\n \u0027Not a penny,\u0027 replied the girl, waving her hand. \\n\\n \u0027Do not close your heart against all my efforts to help you,\u0027 said Rose, stepping gently forward. \u0027I wish to serve you indeed.\u0027 \\n\\n \u0027You would serve me best, lady,\u0027 replied the girl, wringing her hands, \u0027if you could take my life at once; for I have felt more grief to think of what I am, to-night, than I ever did before, and it would be something not to die in the hell in which I have lived. God bless you, sweet lady, and send as much happiness on your head as I have brought shame on mine!\u0027 \\n\\n Thus speaking, and sobbing aloud, the unhappy creature turned away; while Rose Maylie, overpowered by this extraordinary interview, which had more the semblance of a rapid dream than an actual occurrence, sank into a chair, and endeavoured to collect her wandering thoughts. \\n\\n 与这些比较纯真的感情抗衡的却是自尊――这种毛病在最下流、最卑劣的人身上也并不比地位高、自信心强的人逊色。她是一个与小偷、恶棍为伍的可怜虫，沦落风尘的浪女，与那些在绞刑台本身的阴影之下冲洗牢房监舍的家伙相伴――就连这样一个堕落的人也有一份自尊，不愿流露出一丝女性的情感，她把这种情感看成软弱，但唯有这种情感将她与人性连接起来了，从她的孩提时代开始，无法无天的生活已经抹去了人性的许许多多痕迹。\\n\\n 她抬起眼睛，刚够看到一个苗条、漂亮的姑娘出现在面前，随即把目光转向地上，装出漫不经心的样子摇了摇头，说话了：\\n\\n “要见到你可真是不容易，小姐。我要是发起火来，走了――很多人都会这样的――总有一天你会后悔，而且不是平白无故的后悔。”\\n\\n “我非常抱歉，如果有谁对你失礼的话，”露丝回答，“不要那样想，告诉我，你为什么要见我。我就是你要找的人。”\\n\\n 对方这种体贴的语调，柔和的声音，落落大方的态度，丝毫没有傲慢或者厌恶的口吻，完全出乎南希姑娘的预料，她哇的一声哭了出来。\\n\\n “噢，小姐，小姐！”她双手十指交叉，感情冲动地说，“要是你这样的人多一些，我这样的就会少几个了――是这样的――是这样的。”\\n\\n “请坐，”露丝恳切地说，“如果你缺少什么，或者有什么不幸，我一定真心诚意帮助你，只要我办得到――真的。请坐。”\\n\\n “让我站着，小姐，”南希边说边哭，“你跟我说话别那样客气，你还不怎么了解我呢，那――那――那扇门关了没有？”\\n\\n “已经关上了，”露丝说着，后退了几步，好像是万一需要呼救，别人更便于接应似的。“怎么回事？”\\n\\n “因为，”南希姑娘说道，“我就要把我的命，还有别人的命交到你手里。我就是把小奥立弗拖回老费金家里去的那个姑娘，就是他从本顿维尔那所房子里出来的那个晚上。”\\n\\n “你？”露丝梅莱说道。\\n\\n “是我，小姐。”姑娘回答，“我就是你已经听说的那个不要脸的东西，跟盗贼一块鬼混，自从我回忆得起走上伦敦街头的那一瞬间以来，我就没过一天好日子，没听到一句好话，他们让我怎么活我就怎么活，他们说什么就是什么，上帝啊，求求你保佑我。小姐，你只管离我远一点，我不会在意。我的年龄比你凭眼睛看的要小一些，我早就不把这些当回事了。我走在拥挤的人行道上，连最穷的女人都直往后退。”\\n\\n “真可怕。”露丝说着，不由自主地从陌生的来客身边退开了。\\n\\n “跪下感谢上帝吧，亲爱的小姐，”姑娘哭喊着，“你从小就有亲人关心你照看你，从来没有受冻挨饿，没经历过胡作非为喝酒闹事的场面，还有――还有比这更坏的事――这些事我在摇篮里就习惯了。我可以用这个词，小胡同和阴沟既然是我的摇篮，将来还会作我的灵床。”\\n\\n “有我同情你。”露丝已经语不成声，“你的话把我的心都绞碎了。”\\n\\n “愿上帝保佑你的好心。”姑娘回答，“你要是知道我有时候干的事情，你会同情我的，真的。我好歹溜出来了，那些人要是知道我在这儿，把我偷听来的话告诉了你，准会杀了我。你认不认识一个叫孟可司的男人？”\\n\\n “不认识。”露丝说。\\n\\n “他认识你，”姑娘答道，“还知道你住在这儿，我就是听他提起这地方才找到你的。”\\n\\n “我从来没听说过这个名字。”露丝说道。\\n\\n “那一定是我们那伙人告诉他的，”姑娘继续说道，“我先前也想到过。前一阵，就是奥立弗因为那次打劫给带到你们家那天晚上过了没有多久，我――怀疑这个人――我暗地里听到了他同费金之间进行的一次谈话。根据我听到的事，我发现孟可司――就是我向你问起的那个男人，你知道――”\\n\\n “是的，”露丝说道，“我明白。”\\n\\n “――孟可司，”姑娘接着说道，“偶然看见奥立弗跟我们那儿的两个男孩在一起，那是在我们头一回丢掉他的那一天，他一下子就认出来了，他自己正在等的就是那个孩子，可我弄不清是怎么回事。他和费金谈成了一笔买卖，一旦把奥立弗给弄回来了，费金可以拿到一笔钱，要是把他培养成了一个贼，往后还可以拿到更多的钱，那个孟可司有他自己的目的，需要这么做。”\\n\\n “什么目的？”露丝问。\\n\\n “我正在偷听，指望着把事情搞清楚，可他一眼看见我在墙上的影子，”姑娘说道，“除了我，能及时逃走，不被他们发现的人可不多。但我躲过了，昨天晚上我又看见他了。”\\n\\n “当时发生了什么事？”\\n\\n “我这就告诉你，小姐。他昨天晚上又来了。他们照老样上楼去了，我把自己裹了个严严实实，免得影子把我给暴露了，又到门口去偷听。我听到孟可司一开头就说：‘就这样，仅有的几样能够确定那孩子身份的证据掉到河底去了，从他母亲那儿把东西弄到手的那个老妖婆正在棺材里腐烂哩。’他们笑起来了，说他这一手干得漂亮。孟可司呢，一提起那个孩子，就变得非常野蛮，说他眼下算是把那个小鬼的钱太太平平弄到手了，不过他宁愿用别的办法拿到这笔钱。因为，如果能把他送进伦敦的每一个监狱去泡一泡，等费金在奥立弗身上结结实实发一笔财，之后再轻而易举让他犯下某一种死罪，弄到绞刑架上挂起来，把他父亲在遗嘱中夸下的海口捅个稀巴烂，那才带劲呢。”\\n\\n “这究竟是怎么回事？”露丝越听越糊涂。\\n\\n “完全是事实，小姐，尽管是出自我的日中，”姑娘回答，“――当时，他一个劲地骂，我听上去挺平常的，你肯定没有听到过，他说，一方面要取那孩子的命，另一方面他自己又不必冒上绞刑架的危险，他才能消心头之恨。可是因为做不到，他必须盯住奥立弗生活中的每一个转折关头，只要利用一下那孩子的身世和经历，还有机会收拾他。‘说简单点，费金，’他说，‘你虽然是犹太人，可还从来没有布置过像我替我的小兄弟奥立弗设下的这种圈套呢。”’\\n\\n “他的兄弟！”露丝叫了起来。\\n\\n “那是他说的，”南希说着，提心吊胆地看了看四周，从开始说话起，赛克斯的影子就在她的眼前时隐时现，害得她不停地四顾张望。“还有呢。他提到你和另外一位女士的时候说，简直就是上帝或者说魔鬼有心跟他过不去，奥立弗才落到你们手中。他哈哈大笑，说这事也有几分乐趣，你们为了弄清楚你们那只两条腿的哈巴狗是谁，就是出几千镑几万镑，你们也是肯的，只要你们有。”\\n\\n “你该不是说，”露丝的脸色变得一片煞白，“这话当真？”\\n\\n “他说得咬牙切齿，怒气冲天，再认真不过了，”姑娘摇了摇头，回答道，“他仇恨心一上来，从不开玩笑。我认识许多人，干的事情还要坏，可我宁愿听他们讲个十回八回，也不愿意听那个孟可司讲一回。天晚了，我还得赶回家去，别让人家疑心我为这事出来过。我得马上回去。”\\n\\n “可我能做些什么呢？”露丝说，“你走了，我怎么根据这个消息采取措施呢？回来，回来，既然你把同伴描绘得那样可怕，那你干吗还要回那儿去？我马上可以把隔壁一位先生叫来，只要你把这个消息再对他讲一遍，要不了半个小时你就能够转到某一个安全的地方去了。”\\n\\n “干吗回去？”姑娘说，“我必须回去，因为――这种事我怎么对你这样纯洁的小姐说呢？――在我向你讲到的那些人中间有一个，他们当中最无法无天的一个，我离不开他――是的，哪怕能够摆脱我现在过的这种生活，我也离不开他。”\\n\\n “你曾经保护过这可爱的孩子，”露丝说道，“为了把你听来的话告诉我，你冒着这么大的危险来到这里，你的态度打动了我，我相信你说的都是事实。你的悔恨和羞愧感都是明摆着的，这一切无不使我相信，你完全可以重新作人。啊！”热心的露丝姑娘双手合在一起，泪水顺着面颊不住地往下淌。“我也是一个女子，不要对我的恳求充耳不闻。我是第一个――我敢肯定，我是第一个向你表示同情的人。听听我的话，让我来挽救你，你还可以做一些有益的事情。”\\n\\n “小姐，”姑娘双膝跪下，哭喊着，“可亲可爱的天使小姐，你是头一个用这样的话为我祝福的人，我要是几年以前听到这些话，或许还可以摆脱罪孽而又不幸的生活。可现在太晚了――太晚了。”\\n\\n “仟悔和赎罪永远也不会嫌晚。”露丝说道。\\n\\n “太晚了，”姑娘的内心痛苦不堪，哭着说，“我现在不能丢下他。我不愿意叫他去送死。”\\n\\n “那怎么会呢？”露丝问。\\n\\n “他没得救了，”姑娘大声说，“如果我把对你讲的话告诉别人，让他们都给抓起来，他必死无疑。他是最大胆的一个，又那样残忍。”\\n\\n “为了这样一个人，”露丝嚷了起来，“你怎么能舍弃未来的一切希望，舍弃近在眼前的获救机会呢？你这是在发疯。”\\n\\n “我不明白是怎么回事，”姑娘回答，“我只知道本来就是这样，不光我一个人，还有成百上千个和我一样堕落的苦命人也是这样。我必须回去。我不知道这是不是上帝在惩罚我犯下的罪过，但就是受尽痛苦、虐待，我也要回到他那儿去，而且我相信，哪怕知道自己最终会死在他手里，我也要回去。”\\n\\n “我该怎么办呢？”露丝说道，“我不应该让你就这样离开我。”\\n\\n “你应该，小姐，我知道你会让我走的，”姑娘站起来，回答说，“你不会不让我走，因为我相信你的好心，我也没有逼你答应我，尽管我本来可以那样做。”\\n\\n “那，你带来这个消息又有什么用？”露丝说道，“其中的秘密必须调查清楚，你一心要搭救奥立弗，才把事情透露给我，我怎么才能帮助他呢？”\\n\\n “你身边准有一位好心的绅士，他听到这件事能保守秘密，并且建议你该怎么办。”姑娘回答。\\n\\n “可到了必要的时候我上哪儿找你呢？”露丝问道，“我不想打听那些个可怕的人住在什么地方，可你往后能不能在哪一个固定的时间在什么地方散步或者是经过呢？”\\n\\n “你能不能答应我，你一定严守秘密，你一个人，或者是跟唯一知道这事的人一块儿来，并且我不会受到监视、盯梢什么的？”\\n\\n “我向你郑重保证。”\\n\\n “每个礼拜天的晚上，从十一点到敲十二点之间，”姑娘毫不迟疑地说，“只要我还活着，准在伦敦桥上散步。”\\n\\n “等一下，”露丝见姑娘急步朝房门走去，赶紧说道，“再考虑考虑你自己的处境，这是你摆脱这种处境的机会。你可以向我提出要求，不单单是因为你主动带来了这个消息，而且因为你作为一个女子，几乎已经到了山穷水尽的地步：明明一句话就可以使你得救，你难道还是要回到那帮强盗那儿去，回到那个人那儿去吗？这是一种什么魔力，居然可以把你拉回去，重新投入邪恶与苦难的深渊？噢！你心里就没有一根弦是我能够触动的吗？难道没有留下一点良知让我可以激发起来，打破这种可怕的痴情？”\\n\\n “像你这样年轻，心眼好，人又长得漂亮的小姐，”南希镇定地回答，“一旦你们把心交给了男人，爱情也会把你们带到天涯海角――甚至连像你这样有一个家，有朋友，还有别的崇拜者，要什么有什么的人，也是一样的。我这号人，除了棺材盖，连个屋顶都没有，生了病或者临死的时候身边只有医院的护士，没有一个朋友，我们把一颗烂掉的心随便交给哪个男人，让他填上在我们苦命的一生中始终空着的位置，谁还能指望搭救我们呢？可怜可怜吧，小姐――可怜一下我们，要知道，我们只剩下这点女人的感情了，而这点感情本来可以使人感到欣慰、骄傲的，可是由于无情的天意也变成了新的折磨和痛苦。”\\n\\n “你要不要，”露丝顿了一下说，“从我这儿拿点钱，你可以正正当当地活下去――无论如何也要挨到我们重新见面，好吗？”\\n\\n “我绝不接受一个铜子。”南希连连摆手，答道。\\n\\n “请不要拒人于千里之外，”露丝说着，诚恳地走上前去，“我真的愿意为你尽力。”\\n\\n “假如你能马上结束我的生命，小姐，”姑娘绞扭着双手，回答，“就是为我大大尽了力了。今天晚上，想起我干的那些事，我比以往什么时候都要伤心，我一直生活在地狱里，死后能够不进那个地狱已经不错了。上帝保佑你，可爱的小姐，愿你得到的幸福和我蒙受的耻辱一样多。”\\n\\n 这个不幸的姑娘就这样一边说，一边大声抽噎着离去了。这一次非同寻常的会见与其说像一件实实在在的事情，不如说更像来去匆匆的一场梦，不堪重负的露丝梅莱倒在椅子上，竭力想把纷乱的思想理出一个头绪。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/97/5096.html","bookId":474,"book":{"id":474,"title":"Oliver Twist雾都孤儿","description":"简介： 《雾都孤儿》是英国作家狄更斯于1838年出版的写实小说。以雾都伦敦为背景，讲述了一个孤儿悲惨的身世及遭遇，主人公奥立弗在孤儿院长大，经历学徒生涯，艰苦逃难，误入贼窝，又被迫与狠毒的凶徒为伍，历尽无数辛酸，最后在善良人的帮助下，查明身世并获得了幸福。如同狄...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12898724529f0f8.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/97","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
