{"id":99561,"no":3,"title":"Page 3","content":"March does a quick head count; then, satisfied, he leads the way to the hatch and inputs the codes to pop it open. The pressure door gives with a hiss, and Vel slides past. Though we can’t gain access without him, sending him first makes me uneasy because he’s the only nonhuman among us. It smacks of prejudice: humans thinking we’re the most important race in the galaxy and everyone else should line up to serve. “There’s no reason this has to go bad,” March is saying to the rest of us. “Just limit the shooting as much as possible because it’ll be tight quarters.” “No shit.” Dina grins, visible even through her helmet. “I’d rather not catch one in the back.” “We’re looking for human cargo,” he goes on. “I don’t want to spend a long time over there, so let’s make it fast. This may be a target-rich environment, and you’re authorized to do whatever you need to. Clear?” I etch a salute. “Sir, yes, sir.” A smile flickers in his eyes, but he doesn’t let it touch his mouth. Instead, his gaze sweeps the rest of our boarding party. Everyone seems sharp and ready. My comm beeps, then Vel says, “I have disengaged the locks and manually opened their hatch.” March gestures toward the door. “Let’s go.” We cross one at a time. Vel’s already there, and Hit follows to give him solid backup. When my turn comes, I try not to think about the way the tube bows beneath me. It’s safe. It could hold ten times my weight. Still, I’m relieved when I step past the lip of the door with Vel’s help. He’s already taken readings, verifying that the ship’s air is safe for us to breathe and that force fields have sealed off the breaches, so I pull off my helmet and shove the hair out of my face. I didn’t have time to work up a sweat. But it’s not pure vanity or comfort motivating me here. Helmets limit your peripheral vision, and I’ll be damned if I let some slaver sneak up on my six. The rest of the team arrives quickly and efficiently, leaving us clustered in a narrow hallway. Little as I like it, it makes sense for us to split up and search. If we don’t, this will take longer, and every moment we waste standing around, we increase the possibility the slavers will reach somebody inclined to aid them. Plus, there’s the chance that catastrophe will strike this damaged ship. March gives a slight nod to show we’re on the same page. “From here, we split,” he says aloud. “I want a brawler in each team. Jax, you’re with me. Vel, go with Doc. Hit, stay with Dina. We meet back here in twenty . . . Set the timer on your comm if you need to. Call if you find anything, or you need backup.” Their ship was in good shape before we shot it up, I note. Of course, the same could be said of ours. I focus on staying behind March as he leads the way down the corridor. Overhead, the lights flash irregular and sparky. We need to be prepared for failure of life support. That was, in fact, our goal before I complicated matters. “It’s cold in here,” March says softly. “Not too much for humans yet. But the systems are hay-wire. It will get worse.” I duck beneath coils of wire and step over fallen ceiling panels. We really rocked this section. “Agreed.” We come to a door. March taps the button beside it, and it swishes open. Looks like somebody’s quarters, but all the belongings lie scattered on the floor. We’re not looters, so I don’t poke through any of it. Moving on. In that same vein, we canvass our part of the ship. In the last cabin, a wild-eyed man greets us with laser fire. I dive wide, landing to the left of the door, and March goes in shooting. I hear a cry, then he comes out alone. “Slaver,” he murmurs. “He didn’t want to talk.” “No kidding.” I offer a shaky smile. My time as an ambassador has left me soft, more accustomed to handling trouble with my mouth than wading in like I once did. The way things stand, I need to rewire that impulse in a hurry. Passing by, I smell charred flesh, but it doesn’t rouse the visceral horror it used to. I’m in control, no crazy knocking at the windows of my brain. I don’t know if it speaks well of me or poorly that, despite what I’ve been through, the stink doesn’t bother me anymore. “Well,” he answers aloud. “I already told you, Jax. You’re strong.” Whatever I might’ve said has to wait because from another part of the ship comes the sound of combat. March is already on the move, so I fall in behind him. We find Hit and Dina pinned down in a hallway; black marks score the floor nearby. More shots come in as we creep in from the intersection on the other side. Before us, two slavers crouch down, eyes on our crewmates. I shake my head silently. They’re not paying attention to the rear at all. Not smart. I’m hardly even breathing at this point, not wanting to alert them. They stink so bad I can smell them from here: eau d’garlic and dirty man-sweat. Before March can say a word, I crawl far enough to get a shot and take one in the back. He cries out, his back sizzling into a mass of open sores. Horrible as that is, it’s nowhere near as bad as a disruptor-inflicted wound. His mate turns, but March and Hit fire as if they’ve choreographed it, dropping him in a smooth motion. “You two okay?” I step forward and tug Dina to her feet. Not that she needs my help. Mary, she’d kick my ass if she thought I meant she couldn’t get up on her own. “Fine,” the mechanic answers. “We were about to push through.” I’m glad they didn’t have to. Warmth curls through me. For once, we were in time. “Any luck?” March asks. Hit shakes her head. “Nothing but scumbags so far.” Then Doc’s voice comes over the comm. “I think you’d better see this.” He gives us directions and, after a number of turns, we wind up heading toward the stern. That worries me a little, especially given the way the ship wobbles. Who knows what might give way? Or when? I watch my step as we come up to a storage room. Vel stands in the corridor outside, and I can hear weeping just inside. Guess he scared the folks worse than the slavers. That sends a pang through me because I know it hurts him. “You all right?” I pause beside him. “I have a face that frightens small children.” Is that a joke? “They’re just not used to you. Don’t worry about it.” I touch him lightly on the arm as I pass by and find Doc kneeling amid seven or eight small people. Kids. None of them older than ten turns. I’m not the best at estimating ages, though. Three boys, four girls. They peer around Doc, trying to get a glimpse of the monster in the hall. Poor Vel. “Mother Mary,” Hit breathes. The tall woman curls her hands into helpless fists, faced with upturned, teary eyes. I’m a little relieved that she, too, wears a trapped look, as if she could fight off a whole crew of slavers but has no idea what to do with weeping children. I know the feeling. Doc manages to coax their sobs into sniffles, and they cluster around his stocky form like he has pockets full of sweets. Beside me, March wears a look of quiet horror. I don’t need to be Psi to know what he’s thinking. How long have they been enslaved? I ask him. Do they remember their families? If so, we can get them home, March replies silently. If not, I don’t know what the hell we’re going to do with them. What if it’s worse than that? What if their parents were the ones who sold them? He has no answer for that. “Hush, now,” Dina says, kneeling. “We’re here to help.” A little girl peeps from between her fingers up at the mechanic. “You are?” “Yep,” March says. “Promise. But you have to be brave for a little while longer. Can you do that?” “Yeah,” she answers. “But . . . will you let the monster get me?” The others quiet, watching the proceedings with big, damp eyes. They want to know the answer to this question, too. “Sometimes,” I say quietly, “there are monsters who look like people . . . and they do bad things.” Like sell kids for fun and profit. “And other times, there are people who seem scary, but they’re nice on the inside.” “You can’t tell who’s nice by looking at them,” she tells me, too wise for her years. “Pretty much.” “You ready to go now?” Dina asks. They’re remarkably brave. They have nothing to pack, and there’s no time to exchange names. I grab a child at random and settle him on my hip. In the other hand I carry a pistol, just in case we didn’t get all the slavers. Mary, I hope we don’t have to fight our way out. “We have to get them off this ship,” Doc says. “It’s doomed.” As if in answer, the vessel shudders beneath our feet. CHAPTER 4 We’re halfway there when the lights go out. That means life support’s gone down. We only have the oxygen present in the ship, and it won’t be recycling, so when we use it up, we’ll be breathing carbon dioxide instead. Hopefully, we won’t be here that much longer. Without breaking stride, Vel snaps a torch-tube and navigates our course back to the hatch. He’s unencumbered, so it makes sense for him to lead the way, but again, I don’t like it. March and Doc are both weighted down with two kids each, so they won’t be much help in a fight. The burden of defense falls on Vel and, to a lesser degree, Hit and me, though we can only offer one-handed backup. If it comes to it, we’ll have to drop the children and hope they have the sense to stay down. I’ll certainly order mine to stay put, but my experience in the crèche on Gehenna taught me that children don’t always do as they’re told. “Almost there,” Vel says. Foreboding shimmies down my spine. Then, from the darkness beyond, a low voice says, “Don’t move.” I don’t, not so much as a millimeter. But I can speak. “Why the hell did you attack a bigger ship? And what are you doing out here anyway?” I’m trying to buy time for Vel to assess the situation. With him holding the light, they can see us, but we don’t have a target. There’s no telling how many of them there are, either. There’s no denying the fact that this doesn’t look good for us. But maybe we can flip it somehow. “Your shields are good. We didn’t detect your weapons until it was too late.” I hear the shrug in his voice. “As to what we’re doing here, you can frag off.” “Probably waiting on a rendezvous with a buyer,” Hit says softly. Mary, I wish she didn’t know that. “What do you want?” March asks, as if they’re the intruders. “I’m the captain of this ship. Obviously, I want my cargo back and the Danube repaired, but that’s not going to happen. So I’ll take your ship instead.” Dina actually laughs. “You really think that’ll work? Have you seen the size of our ship? It’s teeming with trained soldiers.”","sourceLink":"https://allnovel.net/killbox-sirantha-jax-4/page-3.html","bookId":1649,"book":{"id":1649,"title":"Killbox (Sirantha Jax #4)","description":"Storyline: Killbox (Sirantha Jax #4) Talk is cheap when lives are in jeopardy Sirantha Jax is a “Jumper,” a woman who possesses the unique genetic makeup needed to navigate faster than light ships through grimspace. With no tolerance for political diplomacy, she quits her ambassador post so she can get back to saving the universe the way she does best—by mouthing off and kicking butt. And her tactics are needed more than ever. Flesh-eating aliens are attacking stations on the outskirts of space, and for many people, the Conglomerate’s forces are arriving too late to serve and protect them. Now, Jax must take matters into her own hands by recruiting a militia to defend the frontiers—out of the worst criminals, mercenaries, and raiders that ever traveled through grimspace…","cover":"https://allnovel.net/images/killbox-sirantha-jax-4.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/killbox-sirantha-jax-4.html","creation":"Oct 5, 2019 8:57:49 AM","modification":"Oct 5, 2019 6:43:43 PM"}}
