{"id":99597,"no":39,"title":"Page 39","content":"For a change, I have intel before you do. I’ve heard from one of my commanders. His message leads me to believe there are not one but three vessels waiting our salvage efforts on Dobrinya asteroid. When you dispatch your team, please take every precaution in retrieving the technology and make sure no lives are lost this time. I also want your people to oversee distribution of aid and medical supplies on the mining colony. Take a news crew. I realize you can’t be there in person because it wouldn’t make sense, given your ostensible position, but make sure you put your best agents on this. I’m including some media contacts.\n Bonus: My commander suggests in that same message that we may want to contact the gray men and see if they’d be willing to contract with us as our police force. Given your past contacts with Farwan, it seems you would be ideally suited to locating them and cutting a deal. We must be perceived in a position of strength, but don’t do anything to compromise our integrity. At this point, that’s all we can offer to differentiate ourselves from the Corp.\n .ATTACHMENT-CONTACTS-FOLLOWS.\n .END-TRANSMISSION.\n . COPY-ATTACHMENT.\n .FILES-DOWNLOADED.\n . ACTIVATE-WORM: Y/N?\n .Y.\n .TRANSMISSION-DESTROYED.\n CHAPTER 42\n Back outside the facility, my weighted boots seem heavier than before.\n Now that the threat has passed, I’m feeling every year of my age. Most likely, nobody would stop me if I wanted to head back to the Triumph, but I’m curious what we’ll find on board. The other two vessels are completely wrecked; it wouldn’t be safe to explore the debris.\n This third one is more or less in one piece, though the breaks in the hull mean we can’t remove our suits once we get inside. I’m not sure I would do so in any case, despite being sure that the Morgut do breathe oxygen, just as we do.\n March comes up, nudging my arm to get my attention. I glance up. “Aren’t you afraid they’ll gossip about your familiarity, sir?”\n Color stains his cheeks. “I need to talk to you.”\n “I’m at your disposal, sir.” Oh, Mary, I hope this perfect formality bothers him half as much as it does me.\n “Did you think they died too easily?”\n Come to think of it, they didn’t seem as ferocious as the ones we fought on Emry. Slower, less certain, less skilled. “Yeah. But I thought it was because there were more of us, better trained, better gear, and we knew what we were getting into.”\n “So preparation made the difference?” he asks.\n I shrug. “I thought so, but now you’ve got me wondering. What are you thinking?”\n He hesitates too long before offering, “What if there are different types of Morgut?”\n “You mean ones who don’t eat humans?” I’m not sure I buy it. Not sure I want to.\n What if we just slaughtered three ships of tourists? But no, that doesn’t track.\n “I don’t know,” he says finally. “Just . . . there was something off about them. They weren’t like the ones on Emry.”\n “They died faster,” I answer. “So maybe they weren’t soldiers. That doesn’t make them nice. They might’ve still eaten us—and the colonists. But maybe they’re not the elite shock troops, just your average fanged monsters.”\n “But we didn’t know there were castes. Did we?”\n I shake my head. “Clearly we need to learn more about them if we’re going to fight them effectively. Anything else, Commander?”\n His face quiets, as if I’ve hurt him. “No, dismissed, LC.”\n I step toward the ship to see how we’re coming on gaining entry to it.\n Torrance has been working on the locking mechanism, trying to get us inside. Watching him, I can’t help but think Vel would’ve gotten us past long before now. I miss him. It feels like I haven’t seen him in ages, but the time I spent in training factors into that. Even before he left, we went weeks without contact due to our conflicting schedules.\n I’m not used to that, after Ithiss-Tor.\n “It’s using some kind of sequenced algorithm,” Torrance says eventually.\n “Can you crack it?” March asks.\n He’s already wasted a code-breaker charge on the ship. The slender filaments twitched against the impermeable device, then shuddered and broke into slivers of dust. Which leaves all of us watching our scout, hoping he can achieve a miracle.\n “Less than an hour of air left,” I say quietly.\n We don’t have a huge amount of ground to cover, but we don’t want to leave it too long, either. The scout swears as the panel flashes yellow again. We’ve figured out that means a reset, so anything he accomplished toward opening the door has been wiped.\n “Over here!” Dina calls. When I jog up, she points at the hull breach and hefts her cutting torch. “Who needs to crack their code when you can make a door?”\n I grin through my helmet at her. “Works for me.”\n Drawing my blade, though I don’t activate it, I step through the narrow break, avoiding jagged metal that would tear my suit and leaving me to choke out my last few seconds on this barren rock. I hear footsteps that say the others are right behind me.\n The Morgut ship is unlike anything I’ve ever seen.\n This dark metal shines like diamond chips ground into obsidian. I reach into my pack. After snapping the torch-tube, a wan glow kindles in my hand. I shine it around, marveling at the layered, tubular design. The floor has a faint slope in the middle, almost like a channel of some kind. With gloves on, I can’t assess how the strange material feels, but Torrance gets out his field kit and starts trying to chip off a sample of it.\n Dina peers at the blade and shakes her head. “It won’t work. Can’t you tell by the way it’s warping our metal?”\n I lean closer, eyes narrowed. Weird. The silver bends away from the surface, not as a result of too much pressure. “Like it’s trying to get away from it.”\n “Magnetized,” Torrance guesses aloud.\n March comes up behind us and puts a hand on Dina’s arm. “Let’s move on. If you want to see the whole ship, we’ll have to be fast.”\n She agrees, “I’d like to see the engine rooms, learn what they’re working with. Maybe I’ll find something that lets me perfect the pattern for the phase drive.”\n “Torrance, you’re with me. And you three.” He points at a trio of sturdy clansmen, grim-faced, implacable, and covered in gore. “The rest of you, follow the LC.”\n They head off in the opposite direction. For a brief moment I watch them go. Once, it would’ve been me at his side. Not Dina. And it hurts, no matter how often I tell myself it’s not because he doesn’t care. It’s not because he doesn’t love me.\n But hearing it in the silence of my own head isn’t the same as feeling his warmth wash through me, feeling him inside my head. It’s definitely not the same as feeling his arms around me.\n But the air is ticking out of my gear while I stand around. Time to check this place out. I glance around at my men, not recognizing the faces at first, then I place them. Figures, he left me with the smugglers, except for our medic.\n “Any of you have vid?”\n “I do.” Drake lofts the device, smiling at me.\n “You four follow in pairs and keep a sharp eye out. I don’t expect trouble, but . . .” A shrug finishes that sentence. Then I turn to Drake. “Come on, kid. You’re up front with me.”\n “Do you have any idea how old I am? Ma’am.” By his tone, I’ve pissed him off.\n It’s always the young ones who mind.\n “Not a clue,” I answer, moving along. “Would you like to tell me?”\n At least he turns the vid, following the way I shine the light. “Twenty-five turns.”\n How depressing. I’m nearly ten turns older than him—and it feels like twice that. Jumping takes a toll on the body and the mind. Each time I look in the mirror, I’m mildly surprised not to be looking at some withered old crone.\n “Coming up on a door to the right.” I hope it’s not locked, but it doesn’t make sense that interior doors would be.\n “Motion activated,” Drake notes.\n I beckon them all forward as I step inside. At first glance, the room seems to be empty, but as I step to the center, a series of sigils lights up on the fall wall. I’ve seen them before; unfortunately, I can’t remember where.\n “It’s a menu,” one of the smugglers volunteers.\n “Like, to order food?” another asks.\n The first guy shakes his head. “Don’t be an idiot. An interface, not dinner.”\n That’s where I’ve seen it: in the cockpit of the Silverfish back on New Terra. It must have been adapted for use by a Morgut pilot. The language chip doesn’t seem to guide me on written linguistics, as I’m staring at these without a clue what they mean.\n I cock a brow. “Think I should activate one?”\n “I don’t know if that’s good idea.” Drake focuses the vid on the wall, however, just in case I decide to be stupid.\n The tallest—Benhamin—takes a discreet step back. “If you do decide to play with that thing, ma’am, I hope you won’t mind if we wait in the hall.”\n “Of course not.” I grin. “Go on, all of you.”\n They accept with alacrity, then it’s just Drake and me.\n “I’ll stay,” he says. “We need something to show the commander, so he knows it’s not our fault. You know. If something horrible happens to you.”\n Ignoring that, though he’s most likely right, I approach the citrine symbols pulsing on the onyx wall. Tentatively, I tap the one on the far left. It’s a little like an S with a slash through it, a squiggly line under it, and a trill going off toward the ceiling. At first nothing happens, then it slides out of sight, and appears on the far right, now flashing twice as fast. The other symbols blink slowly at me.\n “Hm.” I glance back at Drake. “Do you think I should quit while I’m ahead?”\n He points the vid at me, and from long experience, I can tell he’s zoomed in on my face within the helmet. “Do you know what you’re doing?”\n “Nope.”\n “At least you’re honest. I wouldn’t presume to advise you, LC. Even though I think you’re nuts.” He adds the last sentence in a low mutter.\n Well, he may be right. I tap the circular thing next to the quick-blinking one. and it flashes bright green. A low hum seems to come from the very wall itself, the obsidian lightening to pale gray, then an image appears. It’s a giant display screen, except I can’t see where the display ends and the wall begins. There are no mechanical bits at all.\n The dark silhouette resolves into a hissing, clicking Morgut. This appears to be a transmission of some kind. I can’t tell if it’s live. I can’t tell if there are sensors in the dark, telling it that we’re here. Shit, I hope it’s not coming from within the ship.\n 14.54.66.78.94.33.0\n Numbers. It’s listing numbers. Streams of them. Before long, I realize they’re coordinates. I’m not sure I’ll be able to memorize all of this, so it’s good thing he’s recording. I’ll play it back later and note each location on the star charts. \n","sourceLink":"https://allnovel.net/killbox-sirantha-jax-4/page-39.html","bookId":1649,"book":{"id":1649,"title":"Killbox (Sirantha Jax #4)","description":"Storyline: \n Killbox (Sirantha Jax #4) \n Talk is cheap when lives are in jeopardy \n Sirantha Jax is a “Jumper,” a woman who possesses the unique genetic makeup needed to navigate faster than light ships through grimspace. With no tolerance for political diplomacy, she quits her ambassador post so she can get back to saving the universe the way she does best—by mouthing off and kicking butt. \n And her tactics are needed more than ever. Flesh-eating aliens are attacking stations on the outskirts of space, and for many people, the Conglomerate’s forces are arriving too late to serve and protect them. \n Now, Jax must take matters into her own hands by recruiting a militia to defend the frontiers—out of the worst criminals, mercenaries, and raiders that ever traveled through grimspace…\n \n","cover":"https://allnovel.net/images/killbox-sirantha-jax-4.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/killbox-sirantha-jax-4.html","creation":"Oct 5, 2019 8:57:49 AM","modification":"Oct 5, 2019 6:43:43 PM"}}
