{"id":69103,"no":10,"title":"Page 10","content":"Steve’s eyes narrowed as he studied her. It was difficult for Carol to meet his heated gaze and not wilt from sheer nerves. She was sure her cheeks were hot pink. Coming to his apartment was the most difficult thing she’d done in years. Her heart felt as if it was going to hammer its way right out of her chest, and her fingers were shaking so badly that she didn’t dare remove them from her pockets.\\n\\n \"Why are you here?\" His question was soft, suspicious, uncertain.\\n\\n \"I found the button.\" One glance told her he didn’t believe her, as well he shouldn’t. That excuse was so weak it wouldn’t carry feathers.\\n\\n \"What is it you really want, Carol?\"\\n\\n \"I… I…\" Her voice trembled from her lips, and her heart, which had been pounding so furiously a second before, seemed to stop completely. She swallowed and forced her gaze to meet his before dropping it. When she finally managed to speak, her voice was low and meaningful. \"I thought with you going away….\" Good grief, woman, her mind shouted, quit playing games. Give him the truth.\\n\\n She raised her chin, and her gaze locked with his. \"I’m not wearing any underwear.\"\\n\\n Steve went stock-still, holding his jaw tight and hard. The inner conflict that played over his face was as vivid as the picturesque scene she’d viewed from his living-room window. The few feet of distance between them seemed to stretch wider than a mile.\\n\\n It felt as if an eternity passed as Carol waited for his reaction, and she felt paralyzed with misgivings. She’d exposed her hand and left her pride completely vulnerable to him.\\n\\n She saw it then – a flicker of his eyes, a movement in the line of his jaw, a softening in his tightly controlled facial features. He wanted her, too – wanted her with a desperation that made him as weak as she was. Her heart leaped wildly with joy.\\n\\n Steve lifted his hand and held it out to her, and Carol thought she would collapse with relief as she hurried toward him. He crushed her in his arms and his mouth hungrily came down on hers. His eager lips smothered her cry of happiness. Equally greedy, Carol returned his kiss, reveling in his embrace. She twined her arms around his neck, her softness melding against the hardened contours of his body.\\n\\n His hands tightened around her possessively, stroking her spine, then lowered over the rounded firmness of her buttocks. He gathered her pelvis as close to him as was humanly possible.\\n\\n \"Dear God, I’ve gone crazy.\"\\n\\n Carol raised her hands to frame his face and gazed lovingly into his eyes. \"Me, too,\" she whispered before spreading a circle of light kisses over his forehead, chin and mouth.\\n\\n \"I shouldn’t be doing this.\"\\n\\n \"Yes, you should.\"\\n\\n Steve groaned and clasped her tighter. He kissed her, plunging his tongue into the sweet softness of her mouth, exploring it with a desperate urgency. Carol met his tongue with her own in a silent duel that left them both exhausted.\\n\\n While they were still kissing, Steve unfastened the buttons of her coat, slipped it from her shoulders and dropped it to the floor. His hands clawed at the back of her skirt, lifting it away from her legs, then settled once again, cupping her bare bottom.\\n\\n He moaned, his breath seemed to jam in his throat, and his eyes darkened with passion. \"You weren’t kidding.\"\\n\\n Carol bit her lower lip as a wealth of sensation fired through her from the touch of his cool hands against her heated flesh. She rotated her lower body shamelessly against the rigid evidence of his desire.\\n\\n His hands closed over her breasts and her nipples rose as though to greet him, to welcome him. His eager but uncooperative fingers fiddled with the fastenings of her blouse. Smiling, content but just as eager, Carol gently brushed his hands aside and completed the task for him. He pulled the silk material free of her waistline and disposed of it as effectively as he had her coat. Her breasts sprang to life in his hands and when he moaned, the sound of it excited her so much that it throbbed in her ears.\\n\\n The moist heat of his mouth closed over her nipple and she gasped. The exquisite pleasure nearly caused her knees to buckle. Blood roared through her veins, and liquid fire scorched her until she was certain she would soon explode. She lifted one leg and wrapped it around his thigh, anchoring her weight against him.\\n\\n Steve’s fingers reached for her and instinctively she opened herself to him. He teased her womanhood, toyed with her, tormented her with delicate strokes that drove her over the brink. Within seconds, she tossed back her head and groaned as the pulsating climax rocked through her, sending out rippling waves of release.\\n\\n By the time Steve carried her into his bedroom, Carol was panting. He didn’t waste any time, discarding his clothes with an urgency that thrilled her. When he moved to the bed, his features were keen with desire.\\n\\n Carol lifted her arms to welcome him, loving him with a tenderness that came from the very marrow of her bones.\\n\\n Steve shifted his weight over her and captured her mouth in a consuming kiss that sent Carol down into a whirlpool of the sweetest oblivion. Anxious and eager, she parted her thighs for him and couldn’t hold back a small cry as he sheathed himself inside her, slipping the proud heat of his manhood into her moist softness.\\n\\n He waited, as though to prolong the pleasure and soak in her love before he started to move. The feelings that wrapped themselves around her were so incredible that Carol had to struggle to hold back the tears. With each delicious stroke the tension mounted and slowly, methodically began to uncurl within her until she was thrashing her head against his pillow and arching her hips to meet each plunging thrust.\\n\\n Steve groaned and threw back his head, struggling to regain control, but soon he, too, was over the edge. When he cried out his voice harmonized with hers in a song that was as ageless as mankind.\\n\\n Breathless, he collapsed on top of her. Her arms slipped around his neck and she buried her face in the hollow of his throat, kissing him, hugging him, needing him desperately. Tears slipped silently from the corners of her eyes. They spoke the words that she couldn’t, eloquently telling him of all the love buried in her heart – words Carol feared she would never be able to voice again.\\n\\n When Steve moved to lift himself off of her, she wouldn’t let him. She held him tightly, her fingers gripping his shoulders.\\n\\n \"I’m too heavy,\" he protested.\\n\\n \"No… hold me.\"\\n\\n With his arms wrapped around her, he rolled over, carrying her with him in one continuous motion until their positions were reversed.\\n\\n Content for the moment, Carol pressed her ear over his chest, listening to the strong, steady beat of his heart.\\n\\n Neither spoke.\\n\\n His hand moved up and down her spine in a tender caress as though he had to keep touching her to know she was real. Her tears slid onto his shoulder, but neither mentioned it.\\n\\n In her soul, Carol had to believe that something this beautiful would create a child. At this moment everything seemed perfect and healed between them, the way it had been two years before.\\n\\n Gently Steve kissed her forehead, and she snuggled closer, flattening her hands over his chest.\\n\\n He wrapped his arms around her and his thumb tenderly wiped the moisture from her cheek. Tucking his finger under her chin, he lifted it enough to find her mouth and kiss her. Sweetly.\\n\\n \"I tried, but I never could stop loving you,\" he whispered in a voice raw with emotion. \"I hated myself for being so weak, but I don’t anymore.\"\\n\\n \"I’ll always love you,\" she answered. \"I can’t help myself. This year has been the worst of my entire life. I’ve felt as if I was trapped in a freezer, never able to get warm.\"\\n\\n \"No more,\" he said, his eyes trapping hers.\\n\\n \"No more,\" she agreed, and her heart leaped with unleashed joy.\\n\\n They rested for a full hour, their legs entwined, then-arms wrapped around each other. Every now and again, Steve would kiss her, his lips playing over hers. Then Carol would kiss him back, darting her tongue in and out of his mouth and doing all the things she knew he enjoyed. She raised herself up on her elbows and brushed a thick swatch of dark hair from his brow. It felt so good to be able to touch him this freely.\\n\\n \"What’s the name of that Mexican restaurant you mentioned earlier?\" Steve asked.\\n\\n Carol smiled smugly. \"You are so predictable.\"\\n\\n \"How’s that?\"\\n\\n \"Making love never fails to make you hungry!\"\\n\\n \"True,\" he growled into her ear, \"but often my appetite isn’t for food.\" His index finger circled her nipple, teasing it to a rose-colored pebble. \"I’ve got a year’s worth of loving stored up for you, and the way you make me feel tonight, we may never leave this bedroom.\"\\n\\n And they didn’t.\\n\\n Carol woke when Steve pressed a soft kiss on her lips.\\n\\n \"Hmm,\" she said, not opening her eyes. She smiled up at him, sated and unbelievably happy. She wore the look of a woman who loves wisely and who knows that her love is returned. \"Is it morning yet?\"\\n\\n \"It was morning the last time we made love.\" Steve laughed and leaned over to kiss her again, as if one sample wasn’t nearly enough to satisfy him.\\n\\n \"It was?\" she asked lazily. They’d slept intermittently, waking every few hours, holding and kissing each other. While asleep, Carol would roll over and forget Steve was at her side. Their discovery each time was worth far more than a few semiprecious hours of sleep. And Steve seemed equally excited about her being there with him.\\n\\n \"Currently,\" he said, dragging her back to reality, \"it’s going on noon.\"\\n\\n \"Noon!\" She bolted upright. She’d been in her teens the last time she’d slept this late.\\n\\n \"I’m sorry to wake you, honey, but I’ve got to get to the sub.\"\\n\\n Carol was surprised to see that he was dressed and prepared to leave. He handed her a fresh cup of coffee, which she readily took from him. \"You’ll be back, won’t you?\"\\n\\n \"Not until tomorrow morning.\"\\n\\n \"Will you…could you stop off and see me one more time, before you leave?\"\\n\\n His dark gaze caressed her. \"Honest to God, Carol, I don’t think I could stay away.\"\\n\\n As Steve walked away from his parked car at the Navy base in Bangor, less than ten miles north of Bremerton, he was convinced his strut would put a rooster to shame. Lord, he felt good.\\n\\n Carol had come to him, wanted him, loved him as much as he’d always loved and wanted her. All the world felt good to him.\\n\\n For the first time since they’d divorced, he felt whole. He’d been a crazed fool to harp on the subject of Todd Larson to Carol. From this moment on, he vowed never to mention the other man’s name again. Obviously whatever had been between the two was over, and she hadn’t wanted Todd back. Okay, so she’d made a mistake. Lord knew, he’d committed his share, and a lot of them had to do with Carol. He’d been wrong to think he could flippantly cast her out of his life.\\n\\n In his pain, he’d lashed out at her, acted like a heel, refused to have anything to do with her because of his foolish pride. But Carol had been woman enough to forgive him. He couldn’t do anything less than be man enough to forget the past. The love they shared was too precious to muddy with doubts. They’d both made mistakes, and the time had come to rectify those and learn from them. \\n\\n","sourceLink":"https://allnovel.net/navy-blues-navy-2/page-10.html","bookId":1957,"book":{"id":1957,"title":"Navy Blues (Navy #2)","description":"Storyline: Navy Blues (Navy Series #2) \\n From New York Times bestselling author Debbie Macomber comes Navy Blues, a poignant and emotional tale in her popular Navy series. After many years, Silhouette Books is proud to give readers the chance to enjoy Debbie Macomber\u0027s famous Navy series. Spanning five books, this emotional series brought fans Debbie\u0027s trademark humor, poignancy and affable characters. Navy Blues follows the February rerelease of the first title, Navy Wife, and will pave the way for the remaining three Navy titles coming in 2004. \\n Carol Kyle hadn\u0027t spoken to her bullheaded ex-husband in nearly a year, so luring him into her bed for one tempestuous night would be no mean feat. But even if it required strategy skills befitting a Navy admiral, she would manage. Because Carol wanted a child, and only Lieutenant Commander Steve Kyle would do as father-to-be. Somehow she\u0027d break through the wall of bitterness Steve was hiding behind. \\n Shameless seduction wasn\u0027t forthright Carol\u0027s style, but her slinky red dress and an unsteady Christmas tree seemed to be working to sultry perfection...until her carefully wrought baby-trap suddenly slammed shut--on her own unsuspecting heart!\\n","cover":"https://allnovel.net/images/navy-blues-navy-2.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/navy-blues-navy-2.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:11:58 AM"}}
