{"id":6372,"no":2,"title":"Chapter 1","content":"I WAS SITTING IN a taxi, wondering if I had overdressed for the evening, when I looked out the window and saw Mom rooting through a Dumpster. It was just after dark. A blustery March wind whipped the steam coming out of the manholes, and people hurried along the sidewalks with their collars turned up. I was stuck in traffic two blocks from the party where I was heading.\n 　　Mom stood fifteen feet away. She had tied rags around her shoulders to keep out the spring chill and was picking through the trash while her dog, a black-and-white terrier mix, played at her feet. Mom\u0027s gestures were all familiar梩he way she tilted her head and thrust out her lower lip when studying items of potential value that she\u0027d hoisted out of the Dumpster, the way her eyes widened with childish glee when she found something she liked. Her long hair was streaked with gray, tangled and matted, and her eyes had sunk deep into their sockets, but still she reminded me of the mom she\u0027d been when I was a kid, swan-diving off cliffs and painting in the desert and reading Shakespeare aloud. Her cheekbones were still high and strong, but the skin was parched and ruddy from all those winters and summers exposed to the elements. To the people walking by, she probably looked like any of the thousands of homeless people in New York City.\n 　　It had been months since I laid eyes on Mom, and when she looked up, I was overcome with panic that she\u0027d see me and call out my name, and that someone on the way to the same party would spot us together and Mom would introduce herself and my secret would be out.\n 　　I slid down in the seat and asked the driver to turn around and take me home to Park Avenue.\n 　　The taxi pulled up in front of my building, the doorman held the door for me, and the elevator man took me up to my floor. My husband was working late, as he did most nights, and the apartment was silent except for the click of my heels on the polished wood floor. I was still rattled from seeing Mom, the unexpectedness of coming across her, the sight of her rooting happily through the Dumpster. I put some Vivaldi on, hoping the music would settle me down.\n 　　I looked around the room. There were the turn-of-the-century bronze-and-silver vases and the old books with worn leather spines that I\u0027d collected at flea markets. There were the Georgian maps I\u0027d had framed, the Persian rugs, and the overstuffed leather armchair I liked to sink into at the end of the day. I\u0027d tried to make a home for myself here, tried to turn the apartment into the sort of place where the person I wanted to be would live. But I could never enjoy the room without worrying about Mom and Dad huddled on a sidewalk grate somewhere. I fretted about them, but I was embarrassed by them, too, and ashamed of myself for wearing pearls and living on Park Avenue while my parents were busy keeping warm and finding something to eat.\n 　　What could I do? I\u0027d tried to help them countless times, but Dad would insist they didn\u0027t need anything, and Mom would ask for something silly, like a perfume atomizer or a membership in a health club. They said that they were living the way they wanted to.\n 　　After ducking down in the taxi so Mom wouldn\u0027t see me, I hated myself梙ated my antiques, my clothes, and my apartment. I had to do something, so I called a friend of Mom\u0027s and left a message. It was our system of staying in touch. It always took Mom a few days to get back to me, but when I heard from her, she sounded, as always, cheerful and casual, as though we\u0027d had lunch the day before. I told her I wanted to see her and suggested she drop by the apartment, but she wanted to go to a restaurant. She loved eating out, so we agreed to meet for lunch at her favorite Chinese restaurant.\n 　　Mom was sitting at a booth, studying the menu, when I arrived. She\u0027d made an effort to fix herself up. She wore a bulky gray sweater with only a few light stains, and black leather men\u0027s shoes. She\u0027d washed her face, but her neck and temples were still dark with grime.\n 　　She waved enthusiastically when she saw me. \"It\u0027s my baby girl!\" she called out. I kissed her cheek. Mom had dumped all the plastic packets of soy sauce and duck sauce and hot-and-spicy mustard from the table into her purse. Now she emptied a wooden bowl of dried noodles into it as well. \"A little snack for later on,\" she explained.\n 　　We ordered. Mom chose the Seafood Delight. \"You know how I love my seafood,\" she said.\n 　　She started talking about Picasso. She\u0027d seen a retrospective of his work and decided he was hugely overrated. All the cubist stuff was gimmicky, as far as she was concerned. He hadn\u0027t really done anything worthwhile after his Rose Period.\n 　　\"I\u0027m worried about you,\" I said. \"Tell me what I can do to help.\"Her smile faded. \"What makes you think I need your help?\"\"I\u0027m not rich,\" I said. \"But I have some money. Tell me what it is you need.\"She thought for a moment. \"I could use an electrolysis treatment.\"\"Be serious.\"\"I am serious. If a woman looks good, she feels good.\"\"Come on, Mom.\" I felt my shoulders tightening up, the way they invariably did during these conversations. \"I\u0027m talking about something that could help you change your life, make it better.\"\"You want to help me change my life?\" Mom asked. \"I\u0027m fine. You\u0027re the one who needs help. Your values are all confused.\"\"Mom, I saw you picking through trash in the East Village a few days ago.\"\"Well, people in this country are too wasteful. It\u0027s my way of recycling.\" She took a bite of her Seafood Delight. \"Why didn\u0027t you say hello?\"\"I was too ashamed, Mom. I hid.\"Mom pointed her chopsticks at me. \"You see?\" she said. \"Right there. That\u0027s exactly what I\u0027m saying. You\u0027re way too easily embarrassed. Your father and I are who we are. Accept it.\"\"And what am I supposed to tell people about my parents?\"\"Just tell the truth,\" Mom said. \"That\u0027s simple enough.\"\n \n \n","sourceLink":"http://novel.tingroom.com/mingren/241/274.html","bookId":206,"book":{"id":206,"title":"玻璃城堡 The Glass Castle","description":"简介： The Glass Castle\u0027 is a 2005 memoir by Jeannette Walls. The book recounts her and her siblings\u0027 unconventional, poverty-stricken upbringing at the hands of their deeply dysfunctional parents. The memoir stayed on The New York Times Best Se...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/241","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
