{"id":9923,"no":20,"title":"CHAPTER XX. A LOST CLUE.","content":"What would you advise me to do, Mr. Sturgis?” asked Bernard as he was dressing the next morning. “I advise you to leave Professor Puffer. He seems to be a thoroughly bad man. You will be in danger as long as you remain with him.” “I will take your advice, though this will throw me upon my own resources. I think I can make a living in some way, though I should know better how to go about it in America.” “How much money have you got?” “About twenty dollars.” “That won’t last you long. I must see what I can think of for you. First of all, you mustn’t stay in Liverpool. Professor Puffer would probably make an effort to get you into his clutches.” “Where would you advise me to go?” “To London. I shall leave directly after breakfast and you can go up with me.” “I shall be glad to go with one who has been there before. But I must keep out of the way of the professor.” “I will arrange matters for you. When you are dressed, go at once to the station of the London and Northwestern Railway. You will find a restaurant close by where you can get breakfast. Then go to the waiting room, where I will join you before the next train starts.” Bernard followed the directions of his friend, and Mr. Sturgis went down to breakfast. Professor Puffer was already in the coffee room. “Where is my ward?” he asked abruptly. “I can’t tell you, sir,” returned Nelson Sturgis coolly. “Didn’t he pass the night with you?” “Yes, sir.” “Then you should know where he is.” “I have already told you that I don’t know.” “Do you think he has left the hotel?” “I think it quite probable.” “Did he tell you where he was going?” “No.” “I believe you are deceiving me,” said Professor Puffer angrily. “And I am sure that you are impertinent. I may feel inclined to pull your nose.” Nelson Sturgis was a tall, athletic man, and Professor Puffer was persuaded that he could carry out his threat if he was so minded. Accordingly he thought it best to desist. After breakfast Mr. Sturgis summoned a hotel attendant. “Here is half a crown,” he said. “Go to the chamber of my young friend, Bernard Brooks, and bring his satchel to my room.” “All right, sir.” This was done without the observation of Puffer, or he would have prevented the removal of Bernard’s luggage. Mr. Sturgis called a hackney coach, had his luggage put on, including Bernard’s satchel, and drove to the railway station. “Well, Bernard, I have brought your satchel,” he said. “Thank you, sir. I was wondering what I should do without it.” “I had no idea of leaving it with the professor. Now I will secure tickets to London.” “What will be the price?” “Never mind. I will undertake to get you to London free of expense to yourself. Afterwards we will consult about your plans.” Just as the train was starting, Professor Puffer reached the station, and from the platform espied his ward in the act of leaving him. “Stop!” he called out, shaking his fist at the receding train. “Good-by, Professor Puffer!” said Bernard with a smile and a wave of the hand. Puffer in his anger, ran a few steps, talking violently. “My ward is running away,” he said to a policeman. “Can’t you stop the train?” “No; I can’t.” “But I want to get him back.” “Then you’ll have to go before a magistrate.” “Where is that train going?” “To London.” “Then I’ll go, too. When is the next train?” “At twelve o’clock, sir.” Professor Puffer returned to the hotel at once, packed his trunk, and enrolled himself as a passenger on the noon train. “If that fellow escapes me,” he said with an ugly look, “he’ll have to be pretty smart. I won’t have it said that a boy of his age has got the better of me.” Mr. Sturgis bought first class tickets, and Bernard found himself in a handsomely upholstered compartment only large enough to hold eight passengers. The doors were locked after they started, which struck Bernard as peculiar. “I like our American cars better,” he said. “So do I, but they are not so exclusive. The English like to be exclusive.” It was an express train, and deposited them in London in a few hours. “Now, Bernard,” said Mr. Sturgis, “I think it will be well for us to go to different hotels. I shall go to the Charing Cross, but this is a prominent hotel, and should you go there you could easily be traced.” “Where shall I go?” “There is a comfortable family hotel in Arundel Street, Strand. The charges, including room and board, are only about six shillings per day, or a dollar and a half in American money. At the Charing Cross they are higher.” “Then I will go to Arundel Street.” “Very well. When you reach London I will see you started for your hotel.” “Shan’t I see you again, sir?” “Yes, I will call around in the evening. By the way, I have thought of a way to put Professor Puffer off the track.” “How is that, sir?” “He will very likely question some of the hackmen. I will therefore take you with me to the Charing Cross. Then we will dismiss the hackman, and you can take a cab from there to Arundel Street.” This precaution was well taken. When Professor Puffer reached London he began to interview the hackmen. “I had two friends arrive by the nine o’clock train,” he said, “a gentleman and a boy of sixteen.” Then he described them. “They neglected to tell me at what hotel they intended to stop. Do any of you remember seeing them?” “Yes, sir,” replied one cabby. “I took them to the Charing Cross.” “Thank you,” said Puffer, in a tone of satisfaction. “That is just what I wanted to find out. Here’s a shilling.” “Thank you, sir. You are a gentleman.” “And you may take me to the Charing Cross. I shall probably find them there.” “I should make a good detective,” thought the professor complacently, as he rolled through the streets. “Master Bernard Brooks will find that he hasn’t made much in his attempt to outwit me. Indeed I am better off for it, as he has been obliged to pay his own fare to London.” When he reached the hotel, he inquired at the office: “Is there an American gentleman named Sturgis here?” “Yes, sir.” “Where is he now?” “In the dining-room, taking dinner.” Professor Puffer smiled maliciously. “Doubtless Bernard will be with him,” He reflected. “They will be rather surprised to see me.” He walked into the dining-room and looked around. His search was partially rewarded. At a table near the window sat Nelson Sturgis with a substantial dinner before him, but Bernard was not with him. “He is somewhere in the hotel,” thought the professor. “Meanwhile I will pay my respects to Mr. Sturgis.” “I hope I see you well, Mr. Sturgis,” said the professor, with an ironical smile. “Thank you, I am quite well,” answered Sturgis composedly. “You see I have reached London not far behind you.” “So I see.” “Did you and my ward have a pleasant journey?” “Very pleasant.” “I am indebted to you for paying his traveling expenses.” “You can reimburse me if you like.” “You must excuse me. I only pay the boy’s bills when he is traveling with me.” “Just as you like.” “I will now relieve you of the charge which, without my permission, you have undertaken. Will you be kind enough to notify Bernard that I have come for him?” “Why do you give me that commission?” asked Sturgis, arching his brows. “Are you under the impression that Bernard is with me?” “Certainly. Isn’t he?” “No.” “Isn’t he stopping at this hotel?” “He is not.” “Where, then, is he? I have positive information that he came here with you.” “From whom did you obtain the information?” “From the hackman who drove you here,” answered Professor Puffer triumphantly. “Then I can’t deny it,” said Sturgis, with affected chagrin. “Of course you can’t. It wasn’t much trouble to get on your track. I am sharper than you probably anticipated.” “Very true, Professor Puffer.” “Now I will thank you to tell me where Bernard is. Of course you know?” “I can guess.” “So I supposed.” “But I don’t propose to tell.” “That is of very little importance. He is in this hotel. I have traced him here.” “He is not here now, however. He is in a different part of London.” “Is this true?” asked Professor Puffer, his jaw dropping. “Quite true, I assure you. By the way, Professor Puffer, you may be sharp, but I think I am a match for you. And now, if you kindly leave me, I will resume my dinner.”","sourceLink":"http://novel.tingroom.com/ertong/2955/81270.html","bookId":434,"book":{"id":434,"title":"Bernard Brooks\u0027 Adventures","description":"简介： Youre a bad lot, Bernard Brooks. I dont think I ever knew a wuss boy.Thank you for the compliment, Mr. Snowdon. Let me suggest, however, that wuss is hardly correct English.The speaker was fifteen years of age, but as tall as most boys of seventeen....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2955","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
