{"id":69748,"no":17,"title":"Page 17","content":"His lips glided over hers in a slow, sensual exploration that had her nerves quivering. Luckily she was seated; otherwise she was sure her knees would have given out on her. Then his hands were in her hair, his fingers splayed as he positioned his mouth over hers. When he finally eased away, she needed a moment to regain her composure.\\n\\n “Wow,” Adam whispered.\\n\\n “You can say that again,” Shana said, still caught up in the feelings his touch had aroused.\\n\\n Adam slowly expelled his breath. “Okay, now what?” His eyes burned into hers, as if seeking answers to questions she had yet to form.\\n\\n “Now…” Shana hesitated. “Now we know.”\\n\\n “Do you want to play this by ear?”\\n\\n She pressed her forehead against his chest. “I’m not sure I’ve had enough piano lessons.”\\n\\n Adam grinned and kissed the top of her head. “Don’t worry, I’m in no rush. We’ll take this one step at a time.”\\n\\n “First piano lessons, and now we’re out on the dance floor. Can’t you just hold me for a few minutes and leave it at that?”\\n\\n “For now.”\\n\\n For now, that was enough. As far as anything else was concerned, she’d have to see what her heart told her.\\n\\n Chapter Twelve\\n\\n Ali read her daughter’s e-mail a second time and smiled.\\n\\n Sent: June 26\\n\\n From:\\n\\n [email protected]\\n\\n To:\\n\\n [email protected]\\n\\n Subject: Guess what I saw\\n\\n Hi Mom,\\n\\n I had a great day and my favorite things were the carriage (our horse was named Silver) and having tea in a fancy hotel and watching Uncle Adam try to fit his finger in the handle of a little china cup. On the ferry home Uncle Adam and Aunt Shana sat next to each other and I was mostly asleep. They got real quiet and so I peeked and guess what? THEY WERE KISSING. Didn’t I tell you they were falling in love? I knew because Uncle Adam comes by almost every day he has off now.\\n\\n It gets even better. On the drive home, Aunt Shana had her head on his shoulder and then she didn’t when I pretended to wake up. They were whispering a lot, too. I tried not to listen, but I couldn’t help it. They were talking about Hawaii and I think it might be where they want to spend their honeymoon. Is this cool, or what?\\n\\n Love ya,\\n\\n Jazz\\n\\n Ali leaned back in her desk chair, feeling satisfied and more than a little cheered. Her daughter was full of news about the romance between Adam and Shana, and gladly accepted credit for it. She seemed convinced that Shana and Adam were just days away from an engagement—or maybe an elopement. That certainly wasn’t the impression Shana gave her, but she could see real change in her sister’s attitude toward Adam.\\n\\n In their last conversation, before Alison flew out of Seattle, Shana had told her she’d completely sworn off men. Apparently she’d reconsidered. This time, however, Shana had found herself a winner. Adam was as different from Brad as snow was from sun, and Ali hoped her sister realized it.\\n\\n Her first indication of the possible romance had been the e-mail Shana had sent full of questions about Adam. Several more had followed the original; all had thinly veiled inquiries about him. Shana had become more open and honest, admitting she felt an attraction even if she hadn’t decided what to do about it. Despite that, Alison saw the evidence of a growing relationship with every e-mail.\\n\\n Glancing at her watch, she turned off her computer. It was time to relieve Rowland in medical. As she checked her schedule, her gaze fell on her wedding band and she paused. Should she switch it to her right hand—or remove it entirely? She wanted to pass it on to Jazmine one day. Slipping the ring off her finger, she held it in the palm of her hand, weighing her options. No, she wasn’t ready to give it up yet. She placed it on her right hand, instead.\\n\\n The very fact that she’d questioned wearing her wedding band was a sign. She would always love Peter but her life with him was over. She supposed her uncertainty about the ring had something to do with Commander Dillon, too. She didn’t want him to believe she was married, but it might be safest if he did…. Still, moving the ring that represented her love for Peter to her right hand was a compromise.\\n\\n As far as she could tell, this feeling of hers for Frank Dillon was completely one-sided. If he’d noticed her lately, he hadn’t given the tiniest hint. He couldn’t. One thing she knew about Commander Dillon was that he lived and breathed for the Navy. He wouldn’t go against regulations if his life depended on it, and Alison wouldn’t want him to. But it made for an uncomfortable situation as they pretended there was nothing between them. Perhaps there wasn’t. She couldn’t be sure, but in her heart she felt there was.\\n\\n Commander Dillon was still recuperating in sick bay. He hated it, longed to get back to work and he was undeniably a pain in the butt. Her colleagues made their feelings known on a daily basis, but Alison simply didn’t acknowledge his bad moods. As a result, the cantankerous commander didn’t know what to think of her, and that was just fine with Ali.\\n\\n While others avoided him, she saw as much of him as her busy schedule would allow, which was never longer than a few minutes at a time. Her feelings for him grew more intense with each day.\\n\\n When she stepped into the infirmary, Lieutenant Rowland handed her his notes. “You’re welcome to the beast,” he muttered under his breath. “He’s been in a hell of a mood all day. Doc says he’ll have him out this week, but I don’t think that’s near soon enough to suit the commander.”\\n\\n That went without saying. When he’d first arrived at the infirmary Frank Dillon had been in agony, which meant his attitude was docile—at least compared to his current frame of mind. After reading Rowland’s notations, Alison pulled back the curtain surrounding him. The commander sat up in bed, arms folded across his chest. He scowled when he saw her.\\n\\n “You’ve become a rather disagreeable patient, Commander.”\\n\\n “I want out of here,” he barked.\\n\\n “That’s no reason to yell. I believe you’ve made your wishes quite clear.”\\n\\n He narrowed his gaze.\\n\\n “As it happens, Commander, you aren’t the one making the decisions. You can huff and puff all you want, but it isn’t going to do you a bit of good.” She reached for his wrist and found his pulse elevated. Little wonder, seeing how agitated he was.\\n\\n “How much longer is this going to take?” he demanded gruffly.\\n\\n As the lieutenant had reported, their patient was in a foul mood. Having her around hadn’t eased his temper, either. “I understand you’ll be released this week,” she said as she lowered the bed so that he was flat on his back. She needed to examine his incision. By now he knew the procedure as well as she did.\\n\\n Ali carefully peeled back the bandage to check for any sign of infection. With the tips of her fingers she gently tested the area while the commander stared impatiently at the ceiling.\\n\\n “This is healing nicely,” she assured him.\\n\\n “Then let me get back to work.”\\n\\n “It isn’t my decision.”\\n\\n He sounded as if he was grinding his teeth in frustration. “I can’t stand wasting time like this,” he growled.\\n\\n “Can I help in some way?” she asked, thinking she could find him a book or a deck of cards.\\n\\n “Yes,” he shouted, “you can get me out of here!”\\n\\n “You know I can’t do that,” she said reasonably. “Only a physician can discharge you.”\\n\\n “I’ve got to do something before I go stir-crazy.” He grimaced with pain as he attempted to sit up.\\n\\n “Commander, you’re not helping matters.”\\n\\n He glared at her as though she was personally responsible for this torture. “Just go. Get out of my sight. I don’t want you around anymore, understand?”\\n\\n She hesitated. “I’m responsible for your care.”\\n\\n “Get someone else.”\\n\\n “Commander,” she tried again, but he cut her off.\\n\\n “Get out!” He pointed at her. “And that’s an order.”\\n\\n Alison swallowed down the hurt as she walked out of his cubicle. His words, harsh and vindictive, rang in her ears during the rest of her shift. He didn’t want her anywhere near him and he wasn’t afraid to say so. Her stomach twisted in a knot, and she felt like a fool for having made assumptions about mutual feelings that obviously didn’t exist. Not on his part, anyway.\\n\\n She didn’t blame Frank for wanting to be back on duty, but he’d taken all his resentment and anger out on her. That wasn’t fair, and it added to the hurt Alison felt.\\n\\n Silently she watched as the corpsman delivered his dinner tray. Dillon glanced at her, then turned away, as if he found the sight of her repugnant.\\n\\n Thirty minutes later, when she walked past, she noticed that he’d barely touched his meal. She considered reminding him that he’d need his strength, but he wouldn’t want to hear it. And she wasn’t willing to risk another tongue-lashing.\\n\\n Twice more during the course of her shift, Ali resisted the urge to check on him. Frank had been very explicit about the fact that he didn’t want her company.\\n\\n When she’d finished, she returned to her quarters and curled up on her bed. After her shift she usually wrote Jazmine and her sister, but not tonight. Instead she reviewed the conversation with Frank.\\n\\n She told herself it was silly to have her feelings hurt by his rudeness, that he didn’t mean it, but she couldn’t help taking it personally. Earlier she’d always shrugged off his abrasive manner, and she couldn’t understand why today was so different. Probably because she’d let her attraction to him get out of hand.\\n\\n Ali wouldn’t be surprised if he was released the next morning, which was just as well. In a little more than four months, she reminded herself, she’d be home with her daughter and soon after that she’d be a civilian. This was an unsettling thought because Ali loved the Navy, but her resignation was necessary. Jazmine needed her, and Alison had given the Navy all she had to give, including her husband.\\n\\n As she’d suspected, Commander Dillon was released the following morning. Alison hated that his last words to her had been spoken in anger, but she tried to forget it. She wished him good health, but he was out of her life now, and it was unlikely they’d see each other again. Perhaps in another time or place they might have made a relationship work. But not here and not now.\\n\\n Of more interest was the romance developing between her sister and Adam Kennedy, and as soon as she could, Alison logged on to the computer to check her e-mail. She could count on hearing from Jazmine at least once a day.\\n\\n To her delight, there was an e-mail from Adam, too, but as she read it, her pleasure quickly evaporated. Adam feared that now his shoulder had healed, he was about to be transferred. He’d told Shana, but didn’t have the heart to mention it to Jazmine until he got his papers. Almost in passing, he added how much he’d enjoyed getting to know Shana.\\n\\n This was dreadful! Jazmine would be devastated if Adam was transferred out of the area, and she wasn’t the only one. Shana was going to be just as disappointed. \\n\\n","sourceLink":"https://allnovel.net/navy-husband-navy-6/page-17.html","bookId":1961,"book":{"id":1961,"title":"Navy Husband (Navy #6)","description":"Storyline: Navy Husband (Navy #6) \\n Hi Ali, \\n Just a quick note from your ever-loving sister. Wanted to bring you up to date on how things are going with Jazmine. After all, I am — according to the Navy — your official \"parenting plan.\" \\n I adore Jazmine. But who knew that a nine-year-old had so many opinions? Including an opinion on my love life (or lack thereof). I\u0027m pretty sure she\u0027s trying to set me up with that friend of yours, Adam Kennedy. Excuse me Lieutenant Commander Adam Kennedy. \\n Yeah, yeah, I know. He\u0027s great looking and very helpful(if a little dictatorial), but I am not in the market for a Navy husband. \\n Do me a favor — tell your daughter that, okay? \\n Love you. Miss you. \\n Shana\\n","cover":"https://allnovel.net/images/navy-husband-navy-6.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/navy-husband-navy-6.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:13:56 AM"}}
