{"id":38831,"no":19,"title":"CHAPTER XIX","content":"N Monsieur Felix Panneton’s little house there was a large room which had formerly been used as a studio by the fashionable painter, and which the new inmate had furnished with the magnificence of a great collector of curios and the discretion of an accomplished lover of women. Artistically and in methodical order Monsieur Panneton had strewn the room with couches, sofas and divans of all shapes and kinds. Looking from right to left as you went in, you would first of all notice a little blue silk settee the arms of which, shaped like a swan’s neck, reminded one of the time when Bonaparte in Paris, like Tiberius of old in Rome, was bent on improving the manners and customs of society. Then came another rather bigger couch upholstered in Beauvais cloth with tapestry-covered ends; then a settee in three divisions, covered in silk; then a little wooden settee à la capucine with a covering of Turkish tapestry; then a large sofa of gilded wood upholstered in crimson figured velvet with cushions of the same, which had belonged to Mademoiselle Damours; then a broad, low, luxuriously stuffed divan of flame-coloured silk; and finally a tottering mass of soft cushions on a very low Oriental divan which, bathed in a dim rose-coloured light, stood on the left near the Baudouin room. As she entered the room, each charming visitor could thus take in with a glance the varied seats and choose the one that best suited her moral character and her present state of mind. Panneton, from the first, observed his new friends, noticed their expressions, took some trouble to discover their tastes, and was careful to ensure that they should sit only where they wished to sit. The more chaste of his lady friends went straight to the little blue settee, placing a gloved hand on the swan’s neck. There was also a high straight-backed arm-chair of gilded wood and Genoa velvet, the former throne of a Duchess of Modena and Parma; that was for the haughty beauties. The Parisian ladies seated themselves calmly on the Beauvais couch; the foreign princesses generally preferred one of the two sofas. Thanks to the judicious arrangement of these aids to conversation, Panneton knew at a glance what he had to do. He was in a position to observe all the conventions, careful not to attempt too sudden a transition in the necessary succession of his attitudes, and was able to spare both his visitor and himself those long and useless pauses between the preliminary courtesies and the inspection of the Baudouins. His proceedings thereby gained a certainty and a mastery which did him honour. Madame de Gromance gave immediate proof of a tact for which Panneton was grateful. Without so much as a glance at the throne of Parma and Modena, and leaving on the right the Napoleonic swan’s neck, she sat on the flowered Beauvais sofa like a Parisienne. Clotilde had languished among the smaller landed gentry of the department and had had attentions paid to her by some rather under-bred young men; but the meaning of life was dawning upon her. She had racked her brains over money matters and was beginning to understand what social duty entailed. She did not dislike Panneton excessively. Partially bald, with very black hair brushed smoothly over his temples, and large prominent eyes, he looked like a lovesick apoplectic, and made her feel rather inclined to laugh, satisfying that craving for the comic element in love of which she had always been conscious. No doubt she would have preferred a magnificent young man, but she was inclined to facile gaiety and the sort of amusement which a man derives from jokes of a rather highly salted nature and a certain kind of ugliness. After a moment of very natural shyness she felt that it would not be so terrible, nor even very tedious. Everything went well. The transit from the Beauvais to the settee and from the settee to the big sofa took place with all due decorum. They judged it needless to linger on the Oriental cushions and went straight into the Baudouin room. When Clotilde thought of looking at it the room, like the erotic painter’s pictures, was strewn with women’s garments and fine linen. “Ah, there are the Baudouins, you have two of them.” “Just so.” He had the Jardinier galant and the Carquois épuisé, two little water-colours for which he had paid 60,000 francs apiece at the Godard sale, and which cost him considerably more than that because of the use to which he put them. Calm once more, and a little melancholy even, he gazed with the eye of a connoisseur at the slender, graceful, supple figure of the woman before him, and, finding her beautiful, was conscious of a little feeling of pride, which grew as she gradually reassumed her social characteristics together with her garments. She demanded the list of candidates. “Panneton, manufacturer; Dieudonné de Gromance, landed proprietor; Dr. Fornerol; Mulot, explorer.” “Mulot?” “Young Mulot. He was running up bills in Paris, so his father sent him round the world. Désiré Mulot, explorer. That sounds well, an explorer candidate! The electors hope he will open up new fields for their goods. Above all, they feel flattered.” Madame de Gromance was becoming serious. She wanted to hear the address to the senatorial electors. He outlined it and repeated some parts which he knew by heart. “First, we promise general pacification. Brécé and the pure Nationalists have not sufficiently insisted on pacification. Then we absolutely demolish the nameless party.” She asked what the nameless party was. “For us it’s the party of our adversaries; for our adversaries it is ourselves. There can be no mistake about that. We demolish the traitors, the creatures who have sold themselves. We fight against the power of gold—that is useful for the poor ruined aristocracy. Enemies of all reaction, we repudiate political adventure. France is resolved on peace, but the day when she draws the sword from the scabbard, etc. The country that regards with pride and affection her admirable national Army— I shall have to alter that sentence a little.” “Why?” “Because it is in both the other addresses, word for word; the Nationalists have it and so have the enemies of the Army.” “And you promise me that Dieudonné will get in.” “Dieudonné or Goby.” “What! Dieudonné or Goby? If you were not any surer than that you ought to have told me. Dieudonné or Goby! To hear you one would think it was all one which got in.” “It isn’t all one, but in either case Brécé goes under.” “Brécé is one of our friends, you know.” “And one of mine! In either case, as I said before, Brécé and his list will go under, and having contributed to his downfall the prefect and the Government will be under obligations to Monsieur de Gromance. After the elections, no matter how they result, you will come and see my Baudouins again and I will make of your husband—whatever you will.” “An ambassador.” At the scrutiny of the 28th of January, the list of Nationalist candidates, Comte de Brécé, Colonel Despautères, Lerond, ex-magistrate, Lafolie, butcher, obtained an average of about a hundred votes. The Progressive Republicans, Felix Panneton, manufacturer, Dieudonné de Gromance, landed proprietor, Mulot, explorer, and Dr. Fornerol, obtained an average of a hundred and thirty votes. Laprat-Teulet, implicated in the Panama affair, only succeeded in obtaining a hundred and twenty votes. The other three retiring Senators obtained an average of two hundred votes. At the second scrutiny Laprat-Teulet’s votes fell to sixty. At the third scrutiny Goby, Mannequin and Ledru, the three retiring Radical Senators, and Felix Panneton, Republican Progressive, were elected. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3035/83892.html","bookId":1059,"book":{"id":1059,"title":"Monsieur Bergeret in Paris","description":"简介： ONSIEUR BERGERET was seated at table taking his frugal evening meal. Riquet lay at his feet on a tapestry cushion. Riquet had a religious soul; he rendered divine honours to mankind. He regarded his master as very good and very great. But it was chie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3035","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
