{"id":38832,"no":20,"title":"CHAPTER XX","content":"OOK at the scene before you,” said Monsieur Bergeret to his disciple Monsieur Goubin, who was polishing his eyeglass, as they stood on the steps of the Trocadero. “Look at the domes, minarets, spires, belfries, towers and pediments; the roofs of thatch, slate, glass, tile, wood, hide and coloured earthenware; the Italian and Moorish terraces, the palaces, temples, pagodas, kiosks, huts, hovels, and tents; the fountains and fire-works; the harmony and contrast of all these human habitations, the marvels of workmanship, the wonderful playthings of industry, the prodigious diversions of modern genius, which has brought together in this spot the arts and crafts of the whole world.” “Do you think,” queried Monsieur Goubin, “that France will derive any profit from this huge Exhibition?” “She may reap great advantages from it,” replied Monsieur Bergeret, “provided it does not fill her with a barren and hostile pride. All this is only the decoration and envelope, it is the study of what it contains that will give us the opportunity of considering more minutely the exchange and circulation of products, their consumption at fair prices, the increase of work and wages and the emancipation of the worker. And do you not admire, Monsieur Goubin, one of the first kind offices of the Universal Exhibition, in scaring away Jean Coq and Jean Mouton? Where are they now? You neither see nor hear them nowadays, and formerly one saw nothing else. Jean Coq led the way, with his head high, his calves prominent. Jean Mouton followed him, fat and curly-headed. The whole city re-echoed to the sound of their cock-a-doodle-doo and baa-baa-baa, for they were eloquent. One day this winter I overheard Jean Coq say, ‘We must have a war. This Government has made it inevitable by its cowardice!’ And Jean Mouton replied: ‘I’d rather have a naval war.’ ‘Of course,’ said Jean Coq, ‘a sea-fight would be consistent with the enthusiasm of the Nationalists. But why not have war on land as well as on sea? Who’s to stop us?’ ‘No one,’ replied Jean Coq. ‘I should like to see anyone try to stop us! But we must first exterminate all traitors and spies, all Jews and Freemasons. That is essential.’ ‘That’s just what I think,’ replied Jean Mouton. ‘And I will not go to war until our land has been cleared of all her enemies.’ “Jean Coq is hot-headed, Jean Mouton mild and peaceful, but they both know only too well how to whet the national energies not to attempt by every means in their power to assure to their country the benefits of war at home and abroad. “Jean Coq and Jean Mouton are Republicans. Jean Coq votes at every election for the Imperialist candidate, and Jean Mouton for the Royalist, but they are both of them Republican Plebiscitarians, and can imagine nothing better for the consolidation of their chosen Government than to deliver it over to the hazards of an obscure and disorderly suffrage; in which they show themselves to be clever fellows. For it is, of course, a profitable thing, if you have a house, to stake it at dice against a truss of hay, because by so doing you run the chance of winning your own house, which of course would be a great advantage. “Jean Coq is not pious, neither is Jean Mouton a clerical, although he is no Freethinker, but they venerate and cherish the monks who grow rich by the sale of miracles and who publish seditious, insulting and slanderous newspapers. And you know as well as I do how such people abound in this country of ours and how they prey upon it. “Jean Coq and Jean Mouton are patriots. You think you, too, are a patriot, and I know that you are attached to your country by the tender and invincible ties of sentiment and reason. You are mistaken, however, and if it be your wish to live at peace with the world you are in league with the enemy. Jean Coq and Jean Mouton will prove that by falling upon you with their cudgels to the war-cry of ‘France for the French!’ ‘France for the French!’ is the slogan of Jean Coq and Jean Mouton, and as it is evident that these words exactly describe the position of a great nation in the midst of other nations, and express the necessary conditions of life, the universal law of exchange, the commerce of ideas and of products, just as they contain a great economical doctrine and a profound philosophy, Jean Coq and Jean Mouton have made up their minds to shut out all foreigners in order to keep France for the French, thus, by a stroke of genius, extending to human beings the system which Monsieur Méline applied only to the products of agriculture and industry, for the greater profit of a small number of landed proprietors. And this idea of Jean Coq’s, of closing the country to men of other nations, enforces, by its modest beauty, the admiration of quite a host of small middle-class people and coffee-house keepers. “Jean Coq and Jean Mouton are not evil; they are only the innocent enemies of the human species. Jean Coq is the more ardent, Jean Mouton the more melancholy, but they are simple fellows both, and believe what their newspapers tell them. This throws a dazzling light upon their innocence, for it is not easy to believe what their newspapers tell them. I take you all to witness, all you famous impostors, you forgers of all time; you egregious liars, distinguished tricksters, notorious creators of fictitious errors and illusions; you whose time-honoured frauds have enriched literature, sacred and profane, by so many dubious volumes; authors of apocryphal Greek, Latin, Hebrew, Syrian and Chaldean writings which have so long deceived learned and ignorant alike; you, false Pythagoras, false Hermes-Trismegistus, false Sanchoniathon, fallacious editors of the Orphic poems and the Sibylline books; false Enoch, false Esdras, pseudo-Clement and pseudo-Timothy; and you lord abbots who, to assure yourselves of the possession of your lands and privileges, forged in the reign of Louis IX the charters of Clotaire and Dagobert; and you, doctors of canon law, who based the pretensions of the Holy See on a heap of sacred decretals composed by yourselves; and you, wholesale manufacturers of historical memoirs: Soulavie, Courchamps, Touchard-Lafosse, lying Weber, lying Bourrienne; you, sham executioners and sham police-agents, who wrote the sordid memoirs of Samson and Monsieur Claude; and you, Vrain-Lucas, who with your own hand traced a letter said to be written by Mary Magdalene, and a note from the hand of Vercingetorix, I call you all to witness; and you whose whole life was a work of simulation; lying Smerdis, lying Neros, lying Maids of Orleans, who would have deceived the very brothers of Joan of Arc; lying Martin Guerre, lying Demetrius and fictitious Dukes of Normandy; I call you to witness, workers of spells, makers of miracles that seduced the mob: Simon the Magician, Apollonius of Tyana, Cagliostro, Comte de Saint-Germain; I call you to witness, travellers returning from far-off countries, who had every facility for lying and took full advantage of it; you who beheld the Cyclopes and the L?strygones, the Magnetic Mountain, the Roc and the Fish-Bishop; and you, Sir John Maundeville, who saw in Asia devils vomiting fire; and you, makers of stories and fables and tales—Mother Goose, Tyl Eulenspiegel, Baron Munchausen!—and you, chivalrous and picturesque Spaniards, most notable babblers, I call you to witness! Bear witness, all of you! You have not accumulated, in the long course of the centuries, so many lies as Jean Coq and Jean Mouton read in their newspapers in a single day! And after that, how can we be surprised that they have so many bogies in their heads!”","sourceLink":"http://novel.tingroom.com/duanpian/3035/83893.html","bookId":1059,"book":{"id":1059,"title":"Monsieur Bergeret in Paris","description":"简介： ONSIEUR BERGERET was seated at table taking his frugal evening meal. Riquet lay at his feet on a tapestry cushion. Riquet had a religious soul; he rendered divine honours to mankind. He regarded his master as very good and very great. But it was chie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3035","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
