{"id":38815,"no":3,"title":"CHAPTER III","content":"PON Monsieur Bergeret’s arrival in Paris, with his daughter Pauline and his sister Zoe, he had lodged in a house which was soon to be pulled down, and which he began to like as soon as he knew that he could not remain in it. He was unaware of the fact that in any case he would have left it at the same time. Mademoiselle Bergeret had made up her mind as to that. She had taken these rooms only to give herself time to find better, and was opposed to the spending of any money upon the place. It was a house in the Rue de Seine, a hundred years old at least. Never beautiful, it had grown uglier with age. The porte cochère opened humbly on a damp courtyard between a shoemaker’s shop and a carrier’s office. Monsieur Bergeret’s rooms were on the second floor, and on the same floor lived a picture-restorer through whose open door glimpses could be caught of little unframed canvases set about an earthenware stove, landscapes, old portraits, and an amber-skinned woman asleep in a dark wood under a green sky. The staircase was fairly well lighted. Cobwebs hung in the corners, and at the turns the wooden stairs were embellished with tiles. Stray lettuce-leaves, dropped from some housewife’s string bag, were to be found there of a morning. Such things had no charm for Monsieur Bergeret, but he could not help feeling sad at the thought that he would become oblivious of these things as he had of so many others which, though they were not of any value, had made up the course of his life. Every day, when his work was done, he went house-hunting. He thought of living for preference on the left bank of the Seine, where his father had dwelt before him, where it seemed to him one breathed an atmosphere of quiet life and peaceful study. What made his search more difficult was the state of the roads, broken with deep trenches and covered with mounds of earth. There were also the impassable and eternally disfigured quays. It will, of course, be remembered that, in the year 1899, the surface of Paris underwent a complete upheaval, either because the new conditions of life necessitated the execution of a great number of municipal undertakings, or because the approach of a huge international exhibition gave rise on every side to an exaggerated activity and a sudden ardour of enterprise. Monsieur Bergeret was grieved to see the town upset, for he did not sufficiently understand the necessity of such a proceeding, but, as he was a wise man, he endeavoured to console himself, to reassure himself by meditation. When he passed along his beautiful Quai Malaquais, so cruelly ravaged by merciless engineers, he pitied the uprooted trees and the banished keepers of bookstalls, and he reflected, not without a certain depth of feeling: “I have lost my friends, and now all that gave me delight in this city, her peace, her grace and her beauty, her old-time elegance and her noble historical vistas, is being violently swept away. It is always right and fitting, however, that reason should prevail over sentiment. We must not dally with vain regrets for the past, nor commiserate with ourselves over the changes that thrust themselves upon us, since change is the very condition of life. Perhaps these upheavals are necessary; it is needful that this city should lose some of her traditional beauty, so that the lives of the greater number of her inhabitants may become less painful and less hard.” And, in the company of idle errand-boys and indolent police-sergeants, Monsieur Bergeret would watch the navvies digging deep into the soil of the famous quay, and once again he would tell himself: “Here I see a vision of the city of the future, whose noblest buildings are as yet indicated only by deep excavations, which would suggest, to a shallow mind, that the labourers who are toiling to rear the city which we shall never behold are merely excavating abysmal pits, when in reality they may be laying the foundations of a prosperous home, the abode of joy and peace.” Thus did Monsieur Bergeret, who was a man of goodwill, look with a favouring eye upon the building of the ideal city; but he was much less at home amid the building operations of the real city, seeing that at every step he risked falling, through absence of mind, into a pit. Nevertheless he continued to go house-hunting, but he did so in a whimsical fashion. Old houses pleased him, in that their stones had for him a tongue. The Rue G?t-le-C?ur had a particular attraction for him, and whenever he saw beside the keystone of a gateway or on a door which had once been flanked by a wrought-iron railing a notice to the effect that there was a flat to let, he would mount the stairs, accompanied by a sordid concierge, in an atmosphere that reeked of countless generations of rats, which was aggravated from floor to floor by the smell of cooking from poverty-stricken kitchens. The workshops of bookbinders or box-makers enriched it at times with the horrible odour of sour glue, and Monsieur Bergeret would depart filled with sadness and discouragement. Home again, he would tell his sister and daughter, at the dinner-table, of the unfavourable results of his inquiries; Mademoiselle Zoe would listen calmly to his story. She had made up her mind to seek and to find a house herself. She regarded her brother as a superior person, but as one quite incapable of reasonable ideas concerning the practical affairs of life. “I went over a flat to-day on the Quai Conti. I don’t know what you two would think of it. It looks out on a courtyard with a well, some ivy, and a statue of Flora, moss-grown, mutilated, and headless, perpetually weaving a garland of flowers. I also saw a small flat in the Rue de la Chaise. That looks out on a garden with a great lime-tree, one branch of which, when the leaves have grown, would enter my study. There is a big room that Pauline could have; she would make it charming with a few yards of coloured cretonne.” “What about my room?” demanded Mademoiselle Zoe. “You never think of my room. Besides——” She did not finish her sentence, as she took no particular notice of her brother’s reports. “We may be obliged to move into a new house,” said Monsieur Bergeret, for he was a sensible man accustomed to subject his desires to reason. “I’m afraid so, papa,” said Pauline. “But never mind, we will find you a tree reaching up to your window, I promise you.” She followed her father’s investigations with perfect good nature, but without much personal interest, as a young girl undismayed by change, who vaguely feels that her fate is not yet determined, and lives the while in a species of anticipation. “The new houses are better fitted up than the old ones,” continued Monsieur Bergeret, “but I do not like them, perhaps because I am more conscious, in the midst of a luxury that one can measure, of the vulgarity of a straitened life. Not that the mediocrity of my fortune distresses me, even on your account. It is the banal and commonplace that I detest.... But you will think me absurd.” “Oh no, papa.” “What I dislike in new houses is the precise sameness of their arrangement. The structure of the apartment is only too visible from the outside. For a long while dwellers in cities have been accustomed to live one above another, and as your aunt won’t hear of a small house in the suburbs I am quite willing to put up with a third or fourth-story flat, and that is precisely why I cannot but regret giving up the idea of an old house. The irregularity of old houses makes the piling of flat upon flat more endurable. When I walk down a new street I find myself thinking that this superposition of households in modern buildings is, in its uniformity, ridiculous. The small dining-rooms perched one above the other with the same little windows and the self-same copper gaselier lighted every evening at exactly the same time; the same tiny kitchens with larders looking on the yard, the same extremely dirty maidservants; the same drawing-rooms, with their pianos one over the other. To my mind, the precision of modern houses reveals the daily functions of the creatures enclosed in them as plainly as though the floors and ceilings were of glass. And all these people who dine one above another, play the piano one above another, and go to bed one above another, in a perfectly symmetrical fashion—when one thinks of it, they offer a spectacle both comical and humiliating.” “The tenants themselves would hardly think so,” said Mademoiselle Zoe, who had quite decided to settle in a new house. “It is true,” said Pauline thoughtfully, “it is true, it is comical.” “Of course, here and there, I see rooms that I like,” continued Monsieur Bergeret. “But the rent is always too high. And that makes me doubt the truth of a principle laid down by the admirable Fourier, which assures us that our tastes are so diverse that if only we lived in harmony with one another hovels would be as much in demand as palaces. It is quite true that we do not live in harmony; or we should all possess prehensile tails, so that we could hang suspended from the trees. Fourier has expressly said so. Another man of equal merit, the gentle Prince Kropotkin, has assured us more recently that some day we shall live rent-free in the mansions on the great avenues, for their owners will abandon them when they can no longer procure servants to keep them up. In those days, says the benevolent prince, they will be delighted to hand them over to the worthy women of the working-classes who will not object to a kitchen in the basement. In the meanwhile, the question of a house is both arduous and difficult. Zoe, please come with me to see that suite of rooms on the Quai Conti of which I told you. It is rather dilapidated, having served for thirty years as a chemical warehouse. The landlord won’t do any repairs as he expects to let the place as a warehouse. The windows are oval dormer-windows, but from them you see an ivy-covered wall, a moss-grown well and a headless statue of Flora which still seems to smile. Such things are not easily found in Paris.”","sourceLink":"http://novel.tingroom.com/duanpian/3035/83876.html","bookId":1059,"book":{"id":1059,"title":"Monsieur Bergeret in Paris","description":"简介： ONSIEUR BERGERET was seated at table taking his frugal evening meal. Riquet lay at his feet on a tapestry cushion. Riquet had a religious soul; he rendered divine honours to mankind. He regarded his master as very good and very great. But it was chie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3035","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
