{"id":83345,"no":29,"title":"Page 29","content":"≈ ≈ ≈ I couldn’t wait for Nick to make it to the door. I needed to feel his arms around me, so I swung it open as he came up the steps and met him halfway. “It feels so good, so safe to be in your arms. I wanted to pretend all of this was a terrible nightmare that didn’t exist once I woke up.” He squeezed me tightly. “I wish I could make it all go away for you.” I grabbed his face and kissed him as though he might disappear at any moment. If my mom had anything to do with it, he would. When I was finished kissing him, I grabbed his hand and led him toward the house. “Come in so we can talk before Tillie and the kids get back.” We walked inside the house. “Have you had breakfast yet?” “No. I came straight here after you called.” “There’s still some breakfast left. Do you want anything?” “Sure.” I took him into the kitchen and he sat at the bar while I warmed leftovers from the breakfast Tillie had made for the kids. I put his plate in front of him and realized I probably should have told him what it was first. Everyone might not like dessert for breakfast. “Chocolate gravy and biscuits. Can you believe that? My mom would die before she would serve this in our house. She’d be afraid one of us might gain a pound.” His expression was bittersweet. “My mom used to cook this for us. I haven’t had this since I was a little kid.” He took his first bite and shook his head. “Tastes just the way I remember it.” I was afraid the reminder of his mother’s cooking might upset him, but it didn’t. It was a pleasant recollection for him and I found myself wanting to make a new memory for him...one of me cooking this meal for him. “Since Ginny taught me how to make biscuits, I could ask Tillie to show me how to make the chocolate gravy and I could cook this for you sometime.” He reached out and put his hand on top of mine. He squeezed it gently as he gave me that beautiful grin that showed his dimples. “I would like that very much.” I avoided the issue at hand while he finished his plate. I wanted him to enjoy it without feeling the nauseatingly nervous feeling I got every time I thought about how we were gonna handle this situation with my mother. When he finished his plate, he sat back in his chair and looked at me solemnly as he sighed. “Baby, what are we gonna do?” “I don’t know. I’m hoping Tillie will come back with good news but I’m not holding my breath. This is Vivian Archer we’re dealing with here.” “Is there a way to win? You either give in to your mother’s demands and never see me again or go against her and suffer the consequences? And what would her consequences be? Would she cut you off?” “I have no doubt she would.” “How could I ask that of you?” How could you not if you loved me? “I didn’t know it until last night, but I would go up against the world for you.” “This is nuts. You shouldn’t be forced to choose between me or your family. It’s not right.” “No, it’s not, but welcome to the world of money, privilege and influence. Those who don’t have it think it’s what they want and need, but money is ugly.” I heard Claire’s ringtone as my phone vibrated on the kitchen counter. “It’s Claire. I’m sure she’s calling to see how last night went. She doesn’t know anything about what happened with my mom. Do you mind if I take this?” “Go ahead and I’ll clear these dishes.” As I explained everything that happened after the banquet, I paced the floor because it was what I did when I was upset. I had almost explained the entire night’s events when I looked up and saw Nick staring at the photographs on the refrigerator. He turned to look at me and held up a photo he had taken off the freezer door. “Who is this?” I knew something was terribly wrong when I saw his face. “Claire, I need to call you back.” I walked over to him and looked at the photo I walked by every time I was in Tillie’s kitchen. I pointed to each person in the photo. “That’s my Aunt Tillie, Uncle Brigham and their kids Tristan and Tara.” He looked so pale. “She may be Tillie to you, but my dad always called her Mattie.” What? “I don’t understand. How does your dad know Tillie?” “Her name is Matilda and she’s my mother.” “That can’t be right.” “Do you think I could mistake my own mother? I might have been young when she left, but I couldn’t forget her face. This is Matilda Hawke, or she used to be. I guess she’s Matilda Archer now.” He sighed heavily. “Shit, it all makes sense now why my dad didn’t want me to date you. He knew I would figure it out.” Dutch didn’t want Nick to date me? That was news to me. The door leading from the garage flew open and Tristan and Tara came flying through the kitchen and both ran over to hug me around the waist. “Hey, Pate. Who’s your friend?” “This is Nick.” “Hey, Nick. Are y\u0027all staying to swim with us today?” I looked up at Nick and saw the realization on his face. He was looking at his brother and sister for the first time. “No, we can’t today, Sweet Pea. We have some things to take care of. Maybe another time.” “Okay.” Unaffected by our decline, they took off upstairs to their bedrooms and I was glad because I had no idea what was about to go down. Tillie came through the door carrying a couple of sacks of groceries and went straight to the counter without looking in our direction. She started putting the refrigerated products away and then caught sight of us and was startled. She looked at me and then at Nick and I knew by the look on her face that everything he said was true. She was his mother. She staggered back a step or two, taken surprise by the son she had abandoned so many years ago. “Nickolas.” “It’s Nick now.” She cupped her nose and mouth with both of her hands and didn’t say anything. Nick stared at her, taking her in and studying her. “All this time I thought you were a million miles away and you were only one town over. You were a twenty minute drive from us and nothing. Not one visit. Not a single call. You just left while we were in school. We got up that morning with a mother and came home without one.” She stared blankly at Nick. “How could you leave like that and never contact us again?” He stared at her waiting for her answer. I thought of that six year-old boy that felt like no one could love him if his own mother hadn’t and I became angry. My anger quickly escalated to fury as I thought about the way her choices had damaged this man I loved and I didn’t recognize the voice coming from within me. “Tell him! An explanation is the very least you owe him.” “I met Brigham and we fell in love, but he told me the only way we could be together was if I left all of you behind. He didn’t want kids that weren’t his.” She reached out to him and he recoiled from her touch. “You got your happily ever after. I hope it was worth it.” He spun around to leave and she called out after him. “I’m so sorry, Nickolas, but I swear there’s not been one day I didn’t regret leaving you and Jacob and Dallas.” The lack of Dutch’s name didn’t go unnoticed. “I’m out of here. Have a nice life, Mother.” “Wait. I’m coming with you.” I ran to grab my stuff and then I ran out the door to catch him. He stopped and turned to grab my arms as his fingers gripped me tightly. “Payton, I’m not in a good place right now.” I grimaced from the pain and he immediately loosened his hold and put his arms around me. “I’m so sorry, Baby. Did I hurt you?” He did, but I’d never tell him that. “No, you didn’t hurt me.” He pulled me into his world and squeezed me tightly. I needed him to know I was on his side. “You’re not leaving without me.” “I have to go see my dad. Alone. I have to know if he knew.” “I understand that you need to do that without me. When’s check out time on the room you booked last night?” “I think Noon.” We left in such haste that I know he didn’t check out. “Do you still have the keycard to the hotel room?” He reached for his wallet and opened it. He slid the card out and I stroked his hand as I took it. “Meet me there after you finish talking to your dad. And stop by the front desk to add on an extra night.” 22 Room 329 Nick I wasn’t looking forward to this at all. I wanted to turn my car around and go to Payton in our hotel room, but I didn’t have a choice. I had to confront my dad about the things he knew about our mom, but kept from us. His patrol car was in the drive when I got home. It was his day off, but I knew he wouldn’t be back from his morning run for at least another 30 minutes. Maybe longer if he was doing long distance today. I was sitting on the couch when he came through the door and he was clearly surprised to see me. “I thought you left.” “I did, but I came back because I need to talk to you about something serious.” He wiped the sweat from his face with the towel around his neck. “Okay. Shoot.” That was one of the perks of having Dutch Hawke for a dad. He was a straight shooter and taught me to not beat around the bush. “I’ve been at Matilda Archer’s house this morning. Did you know our mother lived in Franklin?” He sighed and sat in the recliner across from me. “I knew.” “Why didn’t you tell us?” “She was having an affair. He wanted her but he didn’t want you. He made her choose between him or her kids and she chose him. How was I supposed to look you in the face and tell you that?” “We deserved to know.”","sourceLink":"https://allnovel.net/shallow-going-under-2/page-29.html","bookId":1878,"book":{"id":1878,"title":"Shallow (Going Under #2)","description":"Storyline: Shallow (Going Under #2) Payton Archer\u0027s best friend, Claire, strives to be perfect in every way. Payton doesn\u0027t and this is her story. Nick Hawke likes his car fast and his girls even faster. He blows through females quicker than his muscle car races down the \"The Strip\" in Collinsville and he wouldn’t have it any other way. Determined to avoid the devastation he has watched his father endure in the aftermath of his mother leaving, he believes there is no room in his life or his heart for a relationship lasting more than one night. He seeks happiness in things that won’t let him down...fast cars, adrenaline and one night stands. To his absolute dismay, all of that changes when he unexpectedly runs into an old friend and is introduced to Payton Archer, the first girl he ever wanted for more than one night. There’s only one catch...she is completely immune to him and his smooth talking ways.","cover":"https://allnovel.net/images/shallow-going-under-2.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shallow-going-under-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:50:13 PM"}}
