{"id":71620,"no":5,"title":"Page 5","content":"“What are you writing about today?” I ask, and he jumps, like he didn’t even realize I was up here.\n He hurries to finish what he’s writing and closes the journal. “Nothing important,” he says. “I was just thinking about stuff.… About going back home… returning to the city and life…” He gazes out at the pine trees to the side of us, looking really sad and lost. “We should probably get going if we want to make it back and have a little time to relax before we go back to normal life.”\n “Are you sure you want to go back?” I ask, leaning back to look him in the eyes. “You seem so sad about it.”\n He shrugs and when he meets my gaze, I can see his sadness deepen. “We kind of have to, don’t we?”\n “Unless we want to lose our jobs,” I reply sadly, because even though I can’t wait to get back and take a real shower, I’ll also really miss my time alone with him. “I mean, Denny was understanding and everything, but he’s going to flip if I call him up and ask him for more time off.” I actually lucked out with Denny, my boss at this restaurant where I waitress. When I told him my plans for this road trip, he understood and said something about only being young once. He’s having his niece fill in for me while I’m gone and promised me I’d still have my job when I get back, but I doubt that’d be the case if I stayed away too much longer.\n “Yeah, I’m supposed to start work on that house being built up on Maple Street in a week.” He sighs heavy heartedly. “I guess it’s time to return to the real world.” He pauses, assessing me. “Although…” He trails off, cracking the tiniest smile.\n “What?” I ask as he stares at me with this strange look on his face. “Why are you looking at me like that?”\n He shrugs, his smile expanding. “Because I was thinking about taking another route back home.”\n “What sort of route?” I ask curiously.\n He bites on the end of his pen, studying me, his eyes following the beads of water rivering from my hair down my chest. “I was thinking maybe the beach sort of route.”\n My mood perks up and it seems to boost his too. “Are you being serious? You want to stop by the beach on our way home?”\n He nods, his smile breaking all the way through. “Yeah… you’ve been saying how much you hate the cold and so I figured we could head down south to South Carolina and spend a day there before we head west… maybe to the beach you said you went to as a kid.”\n I attempt not to smile, but I can’t help it. “I can’t believe you remembered that.”\n He sets his journal aside and scoots closer to me. “How could I not?” he asks, cupping my cheek. “It was probably the only pleasant story you’ve ever told me about your childhood.”\n “That’s because I went on the vacation with my friend’s family,” I tell him. “Not my own family.”\n “I remember,” he says. “You said it was your favorite vacation ever.”\n “It was… I actually felt happy for once… and content.” I pause. “Although, this one easily tops it.”\n He gives me a questioning look. “I’m kind of surprised you said that.”\n I’m baffled. “Why? I’ve been having fun and I thought you knew that.”\n “I did know, but…” He struggles, shifting his weight, and then he places his hands on the tops of my thighs. “You’ve been so upset since Chicago… and then last night…” He waits for me to explain, but I still don’t feel like I want to tell him.\n “It’s not because of the vacation,” I promise. “Although I’m not a huge fan of the mountains, I’m still having fun with you… everything is fun with you.”\n “Then why does it seem like you’ve been upset lately?” he asks, searching my eyes for something. “Ever since we visited Ella and Micha. And you won’t talk about it.”\n “Ethan…” I trail off, unsure. “I just don’t think I can talk to you about this.”\n “Why not?” he asks, starting to get frustrated. “Goddammit, Lila. I wish you’d just tell me because it’s driving me crazy. You tell me a lot of things and now suddenly you won’t… it makes me think it has something to do with me.”\n I shake my head. “I’m sorry, but I can’t talk to you about this… I just can’t…” I’m growing worried because I can feel a fight approaching, just like the one we had back in December.\n “Why not?” he asks, but there’s wariness in his voice and I wonder if he already knows what I’m thinking about.\n “Because the last time I brought it up we ended up fighting,” I say quietly. “And I don’t want to fight.”\n He tenses and I know he’s figured out what’s been bothering me, that it’s about marriage and our future. He lets out a slow breath and I feel like I’m going to cry because I want him to just say it. Lila, I want you for the long run. It doesn’t have to be Lila, will you marry me? I just want to know what’s ahead of us, more than just the next few days.\n “What can I do to make you feel better?” he asks with sincerity.\n I shake my head, sucking back the tears. “Nothing really.” And it’s the blunt truth because even if I made him say it, if he doesn’t mean it, then it’s nothing more than words. “Just let me think through my thoughts and figure stuff out… figure out what I want.”\n I’m not even sure what I mean, but he looks like I’ve just told him I’m breaking up with him. Frowning, he gets to his feet and picks up his journal. I think he’s going to take off, but then he extends his hand to me and helps me to my feet.\n “Let’s go pack up and hit the road; otherwise we won’t have time for the beach,” he says, avoiding eye contact with me.\n I nod, a lump forming in my throat because I still have no clue where we’re headed. To the beach in a few days. Then what? Home. And what happens when we get home? We don’t talk about it, so I have no idea. No idea what he wants, if he’ll ever want what I want. If maybe we’re just wasting our time.\n Ethan\n Lila needs to figure stuff out. Figure out what she wants. What the fuck does that mean? I’m not even sure what the hell just happened between us. One minute I have my fingers inside her because the need to touch her was so overwhelming it was worth getting wet and cold, and then the next thing I know we’re arguing and it feels like she might be thinking about breaking up with me. Or wanting to take a break. And I don’t want a break. I just want to keep doing what we’re doing. I’m having fun and that’s all I’ve ever wanted out of life. To enjoy it.\n When I was younger, and pictured my road trip, I’d always pictured doing it myself. But then Lila entered my life and things sort of shifted when I fell in love with her. It was one of the things that made me realize I was in love with her—because being alone didn’t seem as appealing as being with her.\n After we pack up the truck, we head down the mountain, barely saying more than two words to each other. As I drive down the road, heading toward the town on the outskirts of the mountains, I can’t help but wonder if in the future, Lila is going to give me an ultimatum. If she’ll demand that I either marry her or she’ll leave me… Fuck, what if she just leaves and never even gives me a choice? What if one day I wake up and she’s gone? Jesus, I never thought I’d turn into this guy, the one who gets upset at the idea of his girlfriend walking out on him. But after what Lila said on the rock… the idea that she could be thinking about ending it… I’ve definitely turned into that guy and I’m about to panic. Still, the idea of fully committing is scaring the shit of me too.\n “I didn’t mean for it to sound like that,” Lila suddenly blurts out from the passenger seat, finally turning her head toward me. “Back at the rock… what I said… I’m not trying to figure out what I want. I know what I want—you. And I’m sorry if I made you think I was questioning that.”\n “Don’t be sorry,” I say, gripping the steering wheel as I guide my truck around the corner. “You were just being honest, right?” \n","sourceLink":"https://allnovel.net/lila-and-ethan-forever-and-always-the-secret-0/page-5.html","bookId":1973,"book":{"id":1973,"title":"Lila and Ethan: Forever and Always (The Secret #0)","description":"Storyline: \n Lila and Ethan: Forever and Always (The Secret #4.5) \n Lila Summers just wants to know one thing for certain: that Ethan Gregory will be with her always. Once her friend, he\u0027s become so much more, melting the pain of her past away with each kiss. Now Lila is on a road trip with Ethan, in the wilderness under the stars, and she can\u0027t imagine her life without him. But when she talks about the future, something in Ethan changes . . . \n Ethan has no doubts about his feelings for Lila. His life with her gets better every day-and that\u0027s the scary part. How can he walk into a future where he has everything to lose? With Lila, his whole heart is on the line for the very first time. But if Ethan can\u0027t give her the promise she needs, his greatest fear might come true: he\u0027ll lose Lila for good.\n \n","cover":"https://allnovel.net/images/lila-and-ethan-forever-and-always-the-secret-0.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/lila-and-ethan-forever-and-always-the-secret-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:21:00 AM"}}
