{"id":27308,"no":4,"title":"CHAPTER III. THE FIRE-MIST.","content":"Evolution of other Bodies in the Universe—The Nebul?—Estimate of the Size of the Great Nebula in Orion—Photograph of that Nebula taken at Lick Observatory—The Dumb-bell Nebula—The Crossley Reflector—The late Professor Keeler—Astonishing Discovery of New Nebul?—120,000 Nebul?—The Continuous Chain from a Fluid Haze of Light to a Star—The Celestial Evolution. WE commence this chapter with a scrutiny of the heavens, to see whether, among the bodies which it contains, we can discover any which appear at this moment to be in the condition through which our system has passed in some of its earlier stages. So far as our unaided vision is concerned, we can see little or nothing in the skies which will render us assistance in our present endeavour. The objects that we do see in thousands are, of course, the stars, and, as we have already pointed out, the stars are sun-like objects, and as such have advanced many stages beyond the elementary condition. The stars are therefore not immediately available for the illustration we require. But when we come to look at the heavens through our telescopes we presently find 40that there are objects which were not visible to the eye, and which are neither stars nor planets. Closer examination of these objects with the powerful instruments of modern observatories, and especially with the help of those marvellous appliances which have enabled us to learn the actual chemistry of the heavenly bodies, supplies the suggestions that are required. For not only does the telescope reveal myriads of stars which the naked eye cannot detect; not only does it reveal wonderful clusters in which thousands of stars are grouped closely together so as to form spectacles of indescribable magnificence, when we take into account the intrinsic splendour of each star-like point, but it also reveals totally different objects, known as nebul?. These objects are not stars and are not composed of stars, but are vast extensions of matter existing in a far more elementary condition. It is to these curious bodies that we invite special attention at present. It is believed that they offer a remarkable illustration of the origin of the solar system. We shall first consider the best known object of this class. It is the Great Nebula in Orion. Fig. 6.—The Great Nebula in Orion (Lick Observatory, California). (From the Royal Astronomical Society Series.) And here it may be well to give an estimate which will enable us to form some notion of the size of this object. We are accustomed to recognise the stars as presenting the appearance of mere points of light; but an object like the Great Nebula stretches over a wide area of the sky. As to the actual extent of the space which it occupies we cannot speak with confidence. The fact is that with every increase in the power of the telescope the nebula appears to encroach more and more on the darkness of space 41around. We give in Fig. 6 a representation of the Great Nebula as it appears on a photographic plate obtained at the Lick Observatory in California. But no picture can adequately represent the extraordinary delicacy of the object and the softness and tenderness with which the blue nebulous light fades into the black sky around. And it must not be imagined that the nebula, as seen on this picture, represents the utmost limits of the object itself. Every prolongation of the exposure, every increase in the 42sensitiveness of the plate, show more and more the extent of the nebula. We shall, I doubt not, still be within the bounds of truth if we say that the nebula extends over an area ten times as great as that represented in this photograph. But we will take only the area of the object as shown in the photograph for the purpose of our calculation. Let us say that the nebula, as it is here represented, covers about two degrees square. I shall not attempt to express in miles the dimensions of an object so vast. I will try to give a conception of the size of the Great Nebula in a different manner. Let us employ the dimensions of our solar system for the purpose of comparison. Let us suppose that we draw, upon the scale of this celestial photograph, a map which shall represent the sun in the centre, the earth at her proper distance from the sun, and Jupiter in his orbit, which is five times the diameter of the earth’s orbit; and then let us mark the other planets at their respective distances, even to Neptune, revolving in his great ellipse, with a diameter thirty times that of the earth’s orbit. Let us then take the area of the orbit described by Neptune as a unit with which to measure the size of the Great Nebula in Orion. We shall certainly be well within the actual truth if we say that a million circles as big as that described by Neptune would not suffice to cover the area that is represented on this photograph. This will give some idea of the imposing dimensions of the Great Nebula in Orion. But I would not have it to be supposed that the Great Nebula in Orion is unique, unless in respect to its convenient position. The circumstances of its situation 43in space happen to make it a comparatively easy object for observation by dwellers on the earth. There are, however, very many other nebul?, although, with one exception—namely, the Great Nebula in Andromeda, to which we shall have to refer in a later chapter—they do not from our point of observation appear to be so brilliant as the nebula in Orion. The fact is that by large and powerful telescopes multitudes of these nebul? are revealed, and the number ever tends to increase as greater depths in space are sounded. Many of the nebul? are objects which possess sufficient detail to merit the particular attention which they receive from astronomers. It must, however, be confessed that by far the greater number of these objects are so dimly discerned that it is impossible to study their individual characteristics. Among the nebul? which possess sufficient individuality to merit study for our present purpose, I must mention the so-called Dumb-bell. This most interesting object can be seen in any good telescope. It requires, however, as indeed do all such objects, an instrument of the highest power to do it justice; in these modern days, however, the eye observation of nebul? through great telescopes has been superseded by the employment of the photographic plate. I may take this opportunity of mentioning that a photograph really shows more details in the nebula than can be perceived even by the most experienced eye when applied to the most powerful telescope placed in the most favoured situation as to climate. Those lovers of nature who desire to observe celestial objects through a great telescope, and have not the opportunity of gratifying their wishes, may perhaps derive consolation 44from the fact that a good photograph actually represents the object much better than any eye can see it. More of the nebula is to be seen by looking at the photograph than has actually been directly observed by any astronomer. We have chosen the Dumb-bell (Fig. 7) and the Great Nebula in Orion as characteristic examples of this remarkable class of celestial objects; but there are many others to which I might refer, some of which we represent in these pages. The Crab Nebula (Fig. 3) and others have been distinguished by special names; but I must forbear to dwell further on them, and rather hasten to give the results of recent observations which have enormously extended our knowledge of the nebulous bodies in the universe. Let me first explain the source whence this extraordinary accession to our knowledge has arisen. We owe it to the astronomers at the Lick Observatory, that remarkable institution placed on the summit of Mount Hamilton in California. Many important discoveries had already been made with the noble instruments with which the famous Lick Observatory had originally been endowed by its founder; it is, however, by a recent addition to its magnificent apparatus that the discoveries have been made which are specially significant for our present purpose. Many years ago Dr. A. A. Common, the distinguished English astronomer, constructed an exquisite reflecting telescope of three feet aperture (Fig. 8). With this telescope Dr. Common himself obtained notable results in photographing the heavens, and his success earned the award of the Gold Medal of the Royal Astronomical Society. This telescope passed into the possession of 45Mr. E. Crossley, of Halifax, and some time later Mr. Crossley presented it to the Lick Observatory. The great mirror, after its voyage across the Atlantic, was duly erected on the top of Mount Hamilton, and fortunately for science Professor Keeler, whose early death astronomers of both continents greatly deplore, devoted himself to the study of the heavens with its aid. He encountered many difficulties, as might perhaps be expected in such a task as he proposed. His patience and skill, however, overcame them, and though death terminated his labours when his great programme had but little more than commenced, the work he had already accomplished has led to results of the most striking character. Of the skill that he obtained in photographing celestial nebul? we have given illustrations in Figs. 6 and 7. Fig. 7.—The Dumb-bell Nebula (Lick Observatory, California). (From the Royal Astronomical Society Series.) 46It is not to the individual portraits of notable nebul? that we are now about to refer. The most striking characteristic of the sidereal heavens is not to be found in the fact that in one part of the sky we have a brilliant Sirius, in another a Capella, and in a third a Canopus, but in the fact that the heavens wherever we may test them are strewn with incalculable myriads of stars, many of which appear faint only on account of their distance and not because they are intrinsically small. In like manner the remarkable fact with regard to the nebul? which has been disclosed by Keeler’s memorable researches with the Crossley Reflector is the existence not alone of the great nebul?, but of unexpected scores of thousands of small nebul?, or rather, I should say, of nebul? which appear small, though doubtless in many cases these objects are intrinsically quite as splendid as the Dumb-bell Nebula or the Nebula in Orion. They only seem small in consequence of being many times further from us than are the more famous objects. Professor Keeler’s experience was a remarkable one. He was photographing a well-known nebula with the Crossley Reflector, and he was a little surprised to find that on the same plate which gave him the nebula at which he was aiming there were no fewer than seven other small nebulous objects previously unknown to astronomers. It at first appeared to him that this must be an unusual number of nebul? to find crowded together on one plate which covered no more than one square degree of the heavens, an area about five or six times as large as the area of the full moon. Subsequent experience, however, 47showed him that this fact, however astonishing, was not at all unusual. In fact, he found to his amazement that, expose the plate where he pleased, he generally obtained new nebul? upon it, and sometimes even a much larger number than the seven which so greatly surprised him at first. I may mention just one or two instances. There is a well-known and interesting nebula in Pegasus which Professor Keeler photographed. When he developed the plate, which, of course, included a considerable region of the heavens in the vicinity of the particular nebula, he found to his astonishment that, besides the nebula he wanted, there were not less than twenty other nebul? on the plate. But there is a more striking instance even than this. A plate directed to a part of the constellation of Andromeda, with the object of taking a portrait of a particular nebula of considerable interest, was found to contain not only the desired nebula, but no fewer than thirty-one other new nebul? and nebulous stars. Nor have we in these statements exhausted the nebulous contents of these wonderful plates, if indeed we have rightly interpreted their nature. Professor Keeler tells us that he finds upon them a considerable number of objects which in all probability are also nebul?, though they are so small that the telescope is unable to reveal them in their true character. Examination does little more than show these objects as points of light which, however, are apparently not stars. In the remarkable paper from which I have taken these facts Professor Keeler makes an estimate which is founded on the examination of his plates. If the heavens were to be divided into panels, each one square 48degree in area, there would be about forty thousand panels. It follows that if we desired to photograph the whole heavens, and if each of the plates was to cover one square degree, forty thousand pictures would be needed for the representation of the whole celestial sphere. Keeler’s work convinced him that such plates taken by the Crossley Reflector would, on an average, each show at least three new nebul?. He admitted it is quite possible that there may be regions of the sky in which no new nebul? are to be found. But in the regions which he had so far tested he invariably found more than three nebul? on each square degree; indeed, as we have seen, on some of his plates he found a much larger number of these remarkable objects. He therefore said that he makes but a very moderate estimate when he gives a hundred and twenty thousand as the probable number of the new nebul? within the reach of the photographic plates of the Crossley Reflector. The enormous extension which these investigations have given to our knowledge demands the serious attention of all interested in the heavens. The discoveries of the earlier astronomers had led to the knowledge of about six thousand nebul?; the Crossley Reflector at the Lick Observatory has now rendered it practically certain that the number of nebul? in the heavens must be at least twenty-fold as great as had been hitherto supposed. Fig. 8.—The Crossley Reflector (Constructed by Dr. A. A. Common F.R.S. and now at the Lick Observatory). In subsequent chapters we are to present the evidence for the belief that this earth of ours, as well as the sun and all the other bodies which form the solar system, did once originate in a nebula. According to this view the materials which at present are found in 50the globes of the solar system were once distributed over a vast extent of space as a fire-mist, or nebula. It is surely very pertinent to be able to show that a nebula, such as we suppose to have been the origin of our system, is not a mere figment of the imagination. No doubt it is impossible for us now to show the original nebula from which the solar system has been evolved. It is nevertheless possible, as we have seen, to show that a hundred and twenty thousand nebul? are now actually existing of every grade of magnitude. They range from such magnificent objects as the Great Nebula in Orion and the Dumb-bell Nebula, down to objects wholly invisible, not merely to the unaided eye, but even in the most powerful telescope, and only to be discerned as hazy spots of light on the photographic plates of an instrument such as the Crossley Reflector. Though no eye has seen the actual stages in the grand evolution of our solar system, we may at least witness parallel stages in the evolution through which some of the myriads of other nebul? are now passing. We find some of these nebul? in that excessively diffused condition in which they are devoid of visible structure. Material in this form may be regarded as the prim?val nebula. There is at least one of these extraordinary objects which is larger a great deal than even the Great Nebula in Orion, but altogether too faint to be seen except by the photographic plate. Here we find, as it were, the mother-substance in its most elementary stage of widest possible diffusion, from which worlds and systems, it may be, are yet to be evolved. From diffused objects such as shown in Fig. 5 we can pass to other nebul? in which we see a certain advance being made in the process by which the nebula is 51transformed from the primitive condition. We can point to yet other nebul? in which the advance to a further stage of development is more and more pronounced. Thus the various stages in the evolution of a system are to be witnessed, not indeed in the transformation of a single nebula, but by observing a properly arranged series of nebul? in all gradations, from the diffused luminous haze to a star with a faint nebulous surrounding. Such was Herschel’s original argument, and its cogency has steadily increased from the time he first stated it down to the present hour. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2984/82257.html","bookId":1070,"book":{"id":1070,"title":"The Earth\u0027s Beginning","description":"简介： Since these lectures were delivered in the Royal Institution of Great Britain there has been much advance in our knowledge of astronomy. The simultaneous advance in other sciences allied with astronomy has been, perhaps, even more remarkable. I am gl...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2984","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
