{"id":105730,"no":104,"title":"Page 104","content":"Fifth Son waits as the sun sinks and First Son slowly crosses the glimmering sand. He waits until First Son has come about half the distance between him and the rock. Then, casually, as soon as First Son has gone still and the last stone thrown by him has vanished under the surface, he takes a stone from his pouch, measures the distance, and tosses it to land at First Son’s feet. There is a moment of stillness. Wind whispers at his back. The long afternoon shadows of the WiseMothers stripe the nesting ground, cloudy, bright, cloudy, bright. First Son springs, dashing for the safety of the central hummock. But no creature can run faster than the ice wyrms. Three claws pierce the sand, engulfing the stone, and then the thick shaft of a tail thrusts through, whipping back and forth, seeking. The creature’s skin is so clear, like ice, that Fifth Son sees the venom curdling beneath. It strikes. The spiked tail recoils faster than the eye can see. Three times it strikes, for First Son is nimble and desperate enough that his luck holds twice as he dodges; but on the third it stings. And vanishes beneath the sand. First Son howls in pain, in fury. In fear. In his convulsions, he drops all the stones he has gathered for the return trip. They rain down around him like so much fist-sized hail. Tiny claws seek, find, and gather them into their grave, where they will lie for aeons in the clutches of the ice-wyrms. What use do the ice wyrms have for stones? Who can know? As First Son shakes and jerks, as spittle and frothy copperish blood foam from his mouth and nostrils and ears and eyes, Fifth Son cautiously slides off the hummock and circles it. First Son’s thrashing and spasms certainly will disorder the filaments that carry sound and motion to the burrowing ice-wyrms. But he still has to get the braids off First Son before he vanishes beneath the sands and thus those two trophies become lost to him. This is the most dangerous part, because it must be timed just right so that he reaches First Son after he can no longer struggle but before the ice wyrms drag him beneath. Slowly Fifth Son circles. Slowly his rival stiffens or really, more precisely, solidifies. His convulsions slow, stall, and the tiny claw stalks, the tendrils of the ice-wyrms, twine like vines up his legs and begin to haul him down, an ungainly process with something this large. First Son’s eyes are frantic with fear, the only fear one of the RockChildren is ever allowed to express without losing all honor and position. Fifth Son tosses a stone to the opposite side of the nesting ground and as the movement ripples out, attracting attention over there, he slides in toward his rival, who can see him but no longer resist. He cuts off his brother’s braid. He takes for himself the braid of Seventh Son, gained only yesterday. The day grows dim, as dim as it will get at this time of year. Only the brightest stars in the fjall of the heavens can pierce midsummer’s cloak. He tosses a stone and slide-steps away, far enough to watch safely, and then he waits, still and silent with his feet on the venomous sands. He watches as First Son is swallowed under the sands. He is helpless, and will remain so for a very, very long time. The priests say that the ice-wyrms digest that which they drag down into their nest, or that the thing which incubates there and which they protect digests it. Who can know? Who has ever returned to speak of such a thing? The WiseMothers do not answer that particular question. According to the priest, who may or may not know the truth of these matters, for it is in their interest to claim knowledge that they might not actually possess, it can take up to a thousand years for the living rock—that which First Son has now become—to be digested in the belly of the nesting ground. A thousand years is the life span of twenty-five RockChildren, each one measured from the ending of the last. That is a long time to take to die, and every moment of it—so the priests say—awake, aware, and in agony. But a thousand years is nothing to the sea. A thousand years is nothing to the wind. And to the bones of the earth laid bare at the surface as rock, a thousand years might encompass the merest shifting of one finger of a WiseMother’s hand. To the stars that lie above in the fjall of the heavens, a thousand years does not even encompass a thought. One stone at a time he moves out of the hollow, and he reaches safe ground as dawn brightens the short summer’s gloom that passes as night. From far below he dreams he hears the singing of SwiftDaughters and the stamp and scrape of their feet on the dancing ground. He counts his braids: one, two, three, four, five. And the sixth his own, still attached to his head. Triumphant, he descends from the fjall to proclaim his victory. When Alain woke, finding himself tangled in the bedclothes and alone in the bed, he heard Tallia praying. She spoke the words in a rush, as if she feared she would not have time to say them all. It was near dawn. She knelt by the unshuttered window, modestly clothed in a shift, with her head bent and her slight shoulders curled as under a great weight.","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-104.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations Praise for the Crown of Stars series: \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
