{"id":105756,"no":130,"title":"Page 130","content":"“St. Sonja offered herself at the gates in the hope of saving her people, even though they ridiculed her for her faith. Because of her youth and beauty, she was taken to the tent of the cruel king, Azaril, where she sang so sweetly that his heart was softened. He spared Korinthar and all those people who lived inside its walls. At this sign of God’s grace, the entire town wept and prayed at the tiny church built by St. Sebastian Johannes with his own hands, and pledged from that time forward to follow the faith of the Unities.”\n “What happened to St. Sonja?” asked Hathumod.\n “No one knows,” admitted the cleric. “Some say the Bwrish king took her captive and later had her killed when she refused to become his wife.”\n One of the girls squealed. “But it’s said that the Bwr people aren’t people at all but—”\n “I beg you, my lady!” From such a mild-mannered man, the retort bit doubly hard. “It would be abomination to speak more on that subject. That’s only a tale concocted to tempt men and women into improper thoughts. Most agree that she walked of her own accord into the dark lands inhabited by the Bwrmen to bring the Light of the Unities to their tribes. She was never seen again. But in any case, she left Korinthar and did not return.”\n “Look!” Tallia jostled her way to the front of the procession and now emerged first into the wide clearing. Alain rode up beside her. The ruins lay sprawled below them. She stared, pink staining her cheeks, and as he surveyed the walls, he wondered if there was a Dariyan road hidden here, now covered by grass and moss.\n While the rest of the progress fanned out to explore, Tallia dismounted, and he followed her into the ruins where she exclaimed over the carvings on the stone: spirals, falcons, people with human bodies and animal heads. “We must tear all these walls down! We can chisel these evil images from the stones and use them to build a convent where our prayer will glorify God.”\n She grabbed his hand to tug him along. Inside the altar house she knelt beside the white altar stone—still holding Alain’s hand—and with her free hand traced the pattern of four spirals that led into a fist-sized hollow sunk into the center of the pale stone. She shuddered ecstatically and drew Alain against her. “We will build the church right here! The chapel, with the Hearth, right over this very stone!”\n Her shoulders were so thin. She was still quivering. The feel of her body against him swept such strong feelings through him that he tried to disengage his hand from hers so he could step back. The memory of nettles was not helping.\n She stood so close he could easily tilt his head down and brush her mouth with his own. She stared up at him with her lips parted and a breathless urgency in her gaze. She did not shrink away when he gathered her more closely against him.\n “Do you see?” she whispered. “God has given us this opportunity to build a chapel, to honor Her, and Her Son, as is fitting. We can build a place to worship Mother and Son, to bring the true faith to those who have been lost in the false word of the church.”\n Dazzled by the flush in her face and eyes, he would have agreed to anything as long as it meant she stayed this close. Sorrow yipped from the shadow of the doorway. A moment later Lavastine appeared at the threshold, ducked inside, and registered their embrace.\n “I beg your pardon,” he said quickly, and made to turn and go back outside.\n “My lord count!” Tallia broke away from Alain, who stood there shaking as he struggled to control himself. “Now that the harvest is almost in, there are many laborers hereabouts who can serve my builders.”\n “To what purpose?” Lavastine came over but only to touch the altar stone.\n “To build a convent dedicated to Mother and Son! And a chapel, where they may be worshiped properly, and where the image of the sacrifice and redemption of the blessed Daisan, Her holy Son, can be painted so that people can learn the truth!”\n “Certainly not!” Lavastine plucked several weeds that had grown up around the stone, as if such untidiness offended him. “The counts of Lavas have always been on good terms with the church, and I do not intend to change that now.”\n “But you must wish to see the truth brought to light in the world!”\n “I wish for no disruption in my house! My lady Tallia, that you hold close to your heart beliefs that the church has named as a heresy troubles me, but I acknowledge that only God can judge our hearts, and so I leave you alone to pray as you wish. But I will build no monument on these lands to a heretical notion condemned by the skopos. And neither will my son!” \n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-130.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: \n In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \n Praise for the Crown of Stars series: \n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\n \n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
