{"id":105760,"no":134,"title":"Page 134","content":"The prize. It had never meant anything to Alain before, prizes, alliances, the ties of blood. But now it came clear: Tallia’s blood and rank would draw them to Lavas like flies to honey. Tallia had called herself a pawn because more powerful hands moved her where she did not want to go, but he had learned the rules of the game called chess this past year. The pieces called Lions were also called pawns because they were men-at-arms, common-born and expendable—like Julien. But Tallia was not a pawn. She was the granddaughter of kings and queens. In the game of chess, that made her a Regnant. 3 THE journey on roads fallen into ruin was hard on the horses. Anne directed them down the wrong fork in a maze of woodland paths and they had to retrace their steps only to find after much confusion that the pavement of the old Dariyan road had lain hidden by debris and moss. A chance-met forester, surprised to see them, told them that the village of Krona lay some miles ahead, and Anne nodded, seeming to expect this. Not four miles after, as twilight lengthened, one of the pack mules collapsed and died, worn beyond endurance. They camped that night out of sight of the corpse, but Anne set a servant to watch over it. They had been dogged by miserable weather, and it drizzled now. Liath had twisted her ankle when she’d slipped while dismounting, but she dealt with her misery by becoming increasingly silent. In truth, Sanglant was glad of it. He’d known soldiers who suffered loudly and those who suffered silently, and although he knew God enjoined humankind to feel compassion, he preferred the silent sufferers. Right now he crouched over a fire that he coaxed to stay alive despite the rain. Earlier he’d gathered comfrey along the banks of a stream. Now it steeped in boiled water. Anne came up behind him. She had an odd step, decided, as if she knew where she was going, but not at all heavy, as if she meant to tread lightly so no footprint would be left behind. Her robes smelled of rose oil. “You are learned in herb lore, Prince Sanglant? I thought you merely a fighting man.” “I know a little,” he said cautiously. “It’s always wise to observe, to learn what’s useful. I can treat wounds and a few illnesses, such things as we see on campaign.” She asked him a few questions, and he was astonished to discover that he knew more than she did about herbs. Her knowledge of them seemed all secondhand, as if she had spent time with someone who knew herblore but had in that time never truly listened to that wisdom. It did not interest her. If anything, what interested her was the extent of his knowledge, not the lore itself, which he had gleaned over many years by watching, listening, and asking questions of wisewomen and conjuremen and such healers as traveled in the train of armies. Later, when Liath sniffed at the poultice, she said “comfrey” in a choked voice, then shut her eyes and sucked in air as he pressed it gently over her ankle. He settled down behind her so that, back against back, they braced each other. It had stopped raining but now and again drops sprayed his face, spilled on a gust of wind. The dog snuffled along the ground, then flopped down beside him. It was so thin, and it never seemed to get any stronger. Sometimes he felt as if he were the thread drawing it forward, that otherwise it would simply lie down and die. “Da always said comfrey for sprains and aches,” murmured Liath. “People would come to him when they were sick. I never paid attention to how much he knew.” Sanglant shut his eyes. He was comfortable with her as counterbalance against his back. His fingertips brushed the dog’s ears Its hide had such an odd texture, not at all comforting like a real dog’s coat but dry and rough. Still. It grunted and whined, tail thumping as he scratched its head. He felt himself dozing off, his awareness like the thread that bound the dog to him just as he was bound to his father by an intangible cord that gleamed as softly as starlight. Yet that connecting thread wound farther back, beyond, to a place unremembered but felt in the pulse on his heart, so faint that he had to smell it and hear it more than see it, a binding made by the pull of blood. A woman walks along a forest path. Shadow and light make her clothing appear strange, unearthly: a jacket like that worn by the Quman, a ragged skin skirt made of a thin, pale leather. Feathers and beads decorate her hair. A rough-looking man walks behind her, leading a horse. She pauses as if taking a scent, then lifts her stone-pointed spear, shakes it once, twice. He grunted, coming awake to see a fire snapping brightly a body’s length from them. “I’m better at controlling fire,” she said. “It helps that it’s wet. The damp is like a shield—” Such a bitter regret washed over him at the thought of the soldiers he’d left behind at Werlida that he winced, then struggled up to his feet.","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-134.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations Praise for the Crown of Stars series: \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
