{"id":105776,"no":150,"title":"Page 150","content":"The day passed, one slow step after another. By midday they had reached an exposed side of the mountain where rain battered them, but word came down the line that the princess deemed it better to forge forward even in such terrible conditions than to try to make camp where they would be at the mercy of the elements. For the first time, as they floundered forward on the narrow path with a sheer cliff rising up on the right and a rugged drop-off plunging down to their left, Rosvita heard the men-at-arms grumbling. “We should have turned back.” “Why didn’t we wait until summer?” “Our luck is run out.” “Do you think we’ll even reach Aosta or all die at the foot of these cliffs?” “They won’t last much longer,” said Fortunatus to Rosvita when the entire line came to a halt while they waited for a wagon in front of them to get unstuck. “They don’t trust her, not like they would the king or Prince Sanglant.” “Why does everyone speak so lovingly of Prince Sanglant?” demanded Constantine. His hood kept getting swept back from his face and by now his hair was plastered to his head. “He’s no better than a dog. He behaved so strangely.” Fortunatus laughed bitterly, and for once his inexhaustible store of humor failed him. “You didn’t know him before, you young fool. Now shut up!” A crack like thunder shuddered in the air. A man screamed. Not twenty paces forward the road collapsed and a wagon, two oxen, and the driver plunged down the slope. Everyone screamed and shouted at once, men cursing, others shouting orders that no one heeded as the wagon crashed down the cliff only to lodge in a fissure. The driver clung to the wagon as it creaked. Scree poured down around him and rain battered the wagon as its contents slid away into the misty vale below. One ox lay limp, its weight dragging the wagon inch by inch out of the fissure; the other fought madly until it worked free of the harness and, with a last bellow, vanished into the mist. “Ho, there, lads!” cried a captain, coming up alongside Rosvita on his horse. “Throw down the ropes!” “But it’s too dangerous to go up to the edge,” shouted one of the servingmen. It was the only way to be heard above the rain. “We’ll never get across. We may as well turn back now!” “Hold your mouth! The princess is ahead of us. We can’t abandon her.” “Why not?” demanded the man. “We’ve no cause to be following her.” The captain raised a hand to strike, but a new shout came from the other side of the scar torn out of the road. “Make way! Make way!” If a heart could be said to lodge in a throat, Rosvita’s did so now. Theophanu’s figure was instantly recognizable for her height and broad shoulders and the fur-trimmed cloak she wore, but also because she rode her light gelding, Albus, a most intelligent and levelheaded horse. Now, despite shrieks of fear and protests behind her, Theophanu urged Albus forward over the broken road where the least misstep would cause her to fall to her death. The slope plunged down in jagged bursts, so steep that only a few stunted trees had found a foothold. Theophanu did not hesitate as she crossed he washed-out gap, even when wind gusted and her cloak swept out like the wing of an eagle, billowing over empty air. As everyone stared, she came clear of the breach and calmly reined up beside the captain. “Captain Fulk, throw ropes down to that man. The wagon is lost to us, but we need not lose him as well. And have the servingmen get shovels. The pack mules and foot soldiers can cross the fall, but we’ll need some bracing for the wagons.” She appeared oblivious to the rain, immune to it—unlike the rest of them. Then her gaze caught on Rosvita. ‘How did you come to be toiling back here, Sister? Ride forward with me.” “We are needed here, Your Highness.” Theophanu looked startled. Her gaze flicked over the waiting soldiers and servants, all standing as still as statues under he pounding rain—all except those who had thrown ropes down to rescue the driver. Another crack snapped the air, and the wagon lodged in the fissure shuddered, lurched, and crashed downward, shattering into bits. Theophanu frowned. She urged Albus closer to the edge, and Fulk began to object, then faltered. “Ah,” she said, “they have him.” Under her cool eye they hauled the driver up. He appeared o have a broken arm and many bruises, but was otherwise whole. ‘As you wish, Sister Rosvita,” she finished coolly. “Attend me this evening.” Without another word, she turned, crossed back over the washed-out area, and vanished into the rain and mist that shrouded the road before them.","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-150.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations Praise for the Crown of Stars series: \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
