{"id":105828,"no":203,"title":"Page 203","content":"With eleven ships he races south toward North Jatharin, because a messenger has come from Hakonin saying that their outlying lands have been attacked and halls burned by Eika gone raiding out of Jatharin. Many slaves have been taken, or killed, and worst of all, a nest of eggs was stolen. This insult must be avenged, and in a way, it is a kind of test. If he cannot protect those who are sworn to ally with him, then one by one his allies will sail away on dawn waters seeking a stronger ally. Seeking the one who has named himself Nokvi, Moerin’s chief, friend to the Alban tree sorcerers.\\n\\n He turns, finally, and beckons to the priest, who shuffles forward holding what looks like a spear completely wrapped in saffron-dyed cloth.\\n\\n “You have returned from your journey,” he says.\\n\\n “Have I? Where do you think I have been?”\\n\\n “North and east, south and west,” he replies. “Above and below. These are all mysteries which only the wise can fathom.”\\n\\n “Who is wise, and who is foolish?” cackles the priest.\\n\\n “We shall see,” he answers. “What have you brought me?”\\n\\n The priest chants nonsense in reply, as priests are wont to do. “Falcon flies, nightwing dies. Raven calls, ash tree falls. Yoke of gold, song of old. Serpent’s skin, tooth within. Dragon’s wing, wolf’s heart-string. In flute’s breath, magic’s death. Where he stands, lives the land.” As he chants, he unwraps the cloth to reveal a man-high haft of painted wood adorned with feathers and bones, unnamable leathery scraps, the translucent skin of a snake, yellowing teeth strung on a wire, the hair of SwiftDaughters spun into chains of gold and silver, iron and tin, beads of amethyst and crystal dangling by tough red threads, and several bone flutes so cunningly drilled and hung that the breeze off the water moans through them.\\n\\n “Did I not travel over sea and land, under the water and through mountains, above the moon and even to the fjall of the heavens, to find these things?” wheezes the priest. “Did I not bring you what I promised?”\\n\\n Stronghand grasps the haft. It hums against his palm as though bees have made their hive inside the wood—and maybe they have, although he can see no opening. He examines it all around, and except for the humming that emanates from the haft it appears to him as any standard that marks out one chieftain’s followers from another’s, little different from that he himself made when he triumphed at Rikin’s fjord. It is only an object; it cannot speak to him to tell him the truth.\\n\\n “This will protect me from magic?” he asks. “What of those who follow me?”\\n\\n The priest rattles the pouch of bones at his skinny waist. With effort he focuses his cloudy eyes as if he is trying to see only in this world, not in the many worlds, as priests are rumored to do. He speaks in true words instead of riddles and questions. “I have labored many months to devise this working. I am wise in the threads that weave magic. This amulet is your banner. Bear it with you, and it will protect you and yours from magic as far as you can spread your arm of protection.”\\n\\n He smiles, holding out the cup in his other hand. “I have a strong hand. In it I can hold many.”\\n\\n “What of our bargain?” wheedles the old one. “How will you give me freedom from the OldMothers?” He almost shivers with excitement. His skin is like a leathery old purse slipped loosely over scrawny bones. Stronghand wonders how old he really is. How many winters has he seen? How did he stretch the span of his years beyond that natural for a son of an OldMother’s nest?\\n\\n But he is resigned to never discovering the truth. Perhaps some truths are better left unspoken.\\n\\n “It is easy enough to give freedom from the OldMothers,” he replies.\\n\\n He signals, and his warriors grab the priest’s arms to restrain him as Stronghand flips open the chest. The scent of blood and power are strong, but he does not hesitate. He plunges his knife into the priest’s pumping heart. The old creature thrashes, jerking, trying to call down a curse, but the amulet protects Stronghand and his followers from magic. Blood spurts freely from the priest’s mouth, and Stronghand catches it in the cup.\\n\\n Only in death is there freedom from the decrees of the WiseMothers, who, like the rock, live for uncounted generations. Their children are like the rain, touching rock briefly before they flow away into the river, into the fjord, into the sea.\\n\\n As the cup fills to the brim and blood spills over the side, he sees the priest’s spirit swirling in the greenish-copper liquid. He hears a disembodied howl: “No, no, no, I have been tricked!”\\n\\n As the body ceases its thrashing, as the last blood pumps in sluggish jerks and slows to a trickle as the body sags, the priest’s spirit reaches with threadlike mist fingers, trying to find a house for its dying spirit; but everyone there is protected by the amulet. It expands in widening circles, seeking, groping, and once it leaves the cup, he takes one swallow of the priest’s blood and then passes it around to his soldiers, who each take one swallow. In this way the priest’s essence will be diluted among the many, and his vengeful spirit cannot return. \\n\\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-203.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \\n Praise for the Crown of Stars series: \\n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\\n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
