{"id":105831,"no":206,"title":"Page 206","content":"“For a holy place,” remarked Theophanu, “it is certainly defendable.” “No doubt the ancient mothers who hollowed out the convent here were well acquainted with the imperfections of humanity.” The scaffolding being built by Ironhead’s soldiers now reached about halfway to the lower terrace, with a broad base, reinforced sides, and plenty of dampened hides to protect the timber. Ironhead had even allowed his troops to cut down the dozen mature olive trees growing at the base of the cliff. No one seemed idle. Ironhead’s banner flew from the central tent, well out of arrow shot of the lower terrace and almost out of sight where the gully cut away to the left. She did not remember riding down that gully on their last gallop to safety, but she could see it was the only path to the convent. “Is there something new you wished me to see?” She saw it just as Theophanu pointed to a banner fluttering atop a small traveling pavilion half concealed behind Ironhead’s palatial white tent: red silk with an eagle, dragon, and lion stitched in gold. “Isn’t that the sigil of Wendar?” asked Paloma. “Does that mean the king of Wendar has come?” Rosvita almost laughed, imagining the king confined to such a paltry tent and with no sign of his elaborate entourage. “Nay child. A party riding on King Henry’s business and under his safe conduct would carry such a banner. There, at the tip, is a gold circle. That signifies an embassy led by a cleric from the king’s court.” “They arrived yesterday at dusk, escorted by Ironhead’s soldiers,” said Theophanu. “Can it be that your father has heard of our plight?” “You shall see,” said Theophanu. She turned to the young lay sister. “Paloma, you know the route.” The young woman nodded. “Gutta,” she said to the dark-haired girl, “go see what work awaits you in the kitchens.” Paloma led princess and cleric back through the refectory, down a side tunnel that banked into stairs, and through a hanging that concealed a smaller tunnel ventilated by air holes. Soon it grew too dark to see except by touch, and they crept forward as quietly as wolves nosing up on unsuspecting prey. Then, abruptly, dim light filtered through a screen carved so cunningly out of a thin sheet of rock that they could see into the lit chamber beyond without their own shapes being revealed. Rosvita eased in beside Theophanu and together they gazed into the whitewashed guest hall. Rosvita had come to that hall four days ago to see Brother Fortunatus who, like the soldiers and male servants, could not venture into chambers consecrated as a holy convent. Now she saw only soldiers standing at nervous guard over a pair of Aostan clerics. A red-haired Eagle stood off to one side, expression shadowed. “It still seems incredible to me,” one cleric was saying to another in Aostan. “I’ve crossed St. Vitale’s Pass in Aogoste and met blizzards. I don’t see how his party could have made it over the pass this late in the year and then brag of fine weather.” He dropped his voice. “What if it was weather sorcery? Yet none of his escort will utter an ill word of him. It’s as if he’s bewitched them all.” “Or was wrongfully accused.” “You know as well as I that normally St. Vitale’s Pass is closed from mid-autumn to early summer. I’ve never heard of any party crossing a week before Candlemass!” The other man shrugged. “It’s been a mild winter. They just had good fortune. The soldiers I spoke to said that as they came down the last few leagues it had begun to snow behind them.” “That proves nothing. It could still have been weather sorcery. What about those other tales we’ve heard? What about those lights we saw from the height of the rock last night? You heard screaming, too.” “Hush,” said his friend, glancing toward the soldiers. “We’re here to see that he keeps his word to Lord John, nothing more. What matter if there is sorcery at work? Sometimes I wonder what harm there is in sorcery, if it can be used for good. I’m sick enough of this siege and these rations that I’d not care if magic were used to persuade Queen Adelheid to surrender, so we could finally go home.” “Dominic!” His friend drew the Circle of Unity at his chest, like a ward against evil. Theophanu tugged on Rosvita’s hand, and Rosvita followed her into a passage so narrow that rock rubbed her shoulders, then her head, and she had to kneel and walk forward on her knees like a penitent approaching the altar. The path dipped, Theophanu let go of her hand, and she touched a stair-step and, farther up, Theophanu’s sandaled feet. She pulled herself up beside the princess in a cupboardlike space scarcely large enough for both of them. A hazy veil more mist than light screened one side of the space, but it took her a few moments to understand where she was.","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-206.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations Praise for the Crown of Stars series: \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
