{"id":105838,"no":213,"title":"Page 213","content":"Adelheid laughed delightedly, and Rosvita realized that she was enjoying the match, like two swordsmen playing at an absurd battle. “What loyalty do you have for me and my followers?”\\n\\n “I have no loyalty toward you, Your Majesty, although I hope you will not take offense from my plain speaking. I am a loyal subject of King Henry. If Lord John captures you, he will force you to marry him and use that claim to establish himself as king of Aosta. King Henry has ambitions in Aosta as well.”\\n\\n “Does he?” asked Adelheid coyly. “I am not altogether sure what it is that Henry wants in Aosta.” She glanced at Theophanu but did not address her directly. Theophanu sat unknowable in her silence.\\n\\n Hugh seemed caught by surprise. “King Henry sent a force south to find you, Your Majesty, but perhaps you did not meet them. That would account for this terrible situation you now find yourself in. Therefore I beg you, Your Majesty, let me act as King Henry’s ambassador: he seeks to aid you, who are the rightful queen of Aosta. He will aid you with an army, if need be.”\\n\\n “Yet I have heard he seeks to marry me to his bastard son, Sanglant, whom he intends to become king beside me.”\\n\\n There it was: a change in his expression as startling as a peal of distant thunder ripping away the calm of a hazy summer day. Then it was gone. “Why give to the son what the father deserves?”\\n\\n “Do you think Henry wishes to marry me?” asked Adelheid.\\n\\n “He would be a fool to turn away from a woman of your rank and quality, Your Majesty.”\\n\\n Theophanu came alive as a painted figure might stir, cracking its shell of paint, to walk out into the room. “My father’s wishes cannot be known to you! He hopes that Sanglant will marry Adelheid.”\\n\\n “Your Highness!” He was startled. He shifted, marking her place. “I did not know— This blinding cloth has disoriented me, or surely I would have been aware of your presence—”\\n\\n “And changed your tale?” demanded Theophanu. “But I am here, and I have listened. How do you intend to aid Ironhead in his plans?”\\n\\n But he was more in control than she was. “No man can serve two masters. To aid Ironhead for my own gain would be to betray King Henry.” He had the elegant speech of a courtier, graceful and pleasing, but for the first time Rosvita heard a different timbre ring underneath that elegant tone, one as unyielding as granite. “I have done things I am not now proud of, I have been made to see how shamefully petty ambition can ruin a man of promise. But I have never acted in any way against my regnant.” He almost seemed to be daring Theophanu to suggest otherwise, but she did not reply.\\n\\n “I wish to hear Lord Hugh’s proposal,” said Adelheid.\\n\\n “Is the Mother of this convent here?” asked Hugh. “Her permission must be gained, for what I propose might not meet with her approval.”\\n\\n Theophanu’s grunt was itself a comment.\\n\\n “I am here, Son,” said Mother Obligatia. “Speak freely before me.”\\n\\n “There is a crown of stones atop this rock. It is possible to travel long distances quickly through gateways created by the architecture of these stone circles.”\\n\\n “To travel?” demanded Adelheid, then laughed as at a particularly fine joke. “You must explain yourself, Lord Hugh. I do not understand you.”\\n\\n “When we travel by ship, Your Majesty, we make landfall not at any cliff or coastline but at harbors suited to putting ashore. Think of the stone crowns as harbors, and the road traversed between each crown not as land or sea but as the aether, the element of the seven spheres, all that lies above the moon.”\\n\\n “How can this be possible?” cried Adelheid. “Isn’t it blasphemy to suggest that we can travel the aether while we are living? Only the souls of the dead ascend through the seven spheres when they journey toward the Chamber of Light.”\\n\\n Hugh turned his head toward Mother Obligatia; despite his protestations about the blindfold, he could distinguish where each of the speakers sat. “Even the wall paintings in the guest chapel reveal the real purpose of the stone crowns. I cannot say if there are other paintings hidden away within this convent which reveal other secrets. But the painting I saw confirms that the ancient Aoi knew how to use the stone circles. Perhaps they even built them, for in the old stories they are portrayed as great magi.”\\n\\n “Can this be true, Mother?” asked Theophanu in a low voice. “Surely this is only the raving of a deluded mind. You don’t believe him? Do you?”\\n\\n Mother Obligatia was silent for a long time. Then she said only, “Go on, Lord Hugh.”\\n\\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-213.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \\n Praise for the Crown of Stars series: \\n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\\n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
