{"id":105842,"no":217,"title":"Page 217","content":"“There, now, I’m sorry,” said Baldwin. “I promised you before not to talk about her anymore.”\n “I hope she’s dead,” said Ivar furiously. “She abandoned me. She never cared for me at all.”\n “That’s right, agreed Baldwin. “Here, lie down again. You look ill.” He whistled sharply, and one of the servingmen hurried over. “Get him some wine. And get my clothes.”\n “I don’t like it here,” muttered Ivar. His head throbbed. “But there’s nowhere to go, and no reason to go, and nothing, nothing, nothing! And I don’t much like the prince,” he added, hating himself for whining.\n “I don’t either,” confided Baldwin. “But he got us away from the margrave, didn’t he?” The serving man returned with a cup of wine and Baldwin’s clothing. “Come now. Where’s that sweet smile?”\n Ivar couldn’t muster up any smiles, sweet, grumpy, or otherwise. He flung an arm over his eyes and lay there, hating himself and everything around him, except maybe Baldwin.\n Must his head pound so? A moment later, the door into the dormitory hall was shoved open so hard that it banged on the wall behind. Baldwin leaped up. The ill-named Brother Humilicus appeared in the door like the wrath of God, glowering, with a frown so deep that it seemed permanently chiseled into his handsome features. He had been set in charge of the new monastery by King Henry; it was his precise and orderly rule that Ekkehard had, upon arriving, overset completely.\n But Ivar didn’t like Brother Humilicus either. In fact, Ivar no longer liked anyone, anywhere, anyhow. Except maybe Baldwin and Ermanrich and Sigfrid, because they had suffered with him at Quedlinhame. Except Lady Tallia, but he didn’t really like her; one didn’t like or dislike a saint. Saints lived beyond crude emotion. They simply existed to be venerated.\n Yet he had done nothing but drown himself in wine and carnal lust.\n Baldwin got a strong grip on his arm and yanked him to his feet as the other young novices stumbled up to show respect to Brother Humilicus, their senior in every way.\n Including piety.\n Prince Ekkehard sprawled on his bed, staring sulkily at Brother Humilicus but not bothering to rise. His bed was set somewhat apart from the others and, as was usual for him, he had two girls with him, one on either side. Milo lay curled like a dog at the foot of the bed, snoring loudly. One of the girls dressed hastily as Brother Humilicus stared at her with disgust. The other, Ekkehard’s favorite, was a pretty, dark-haired woman at least five years older than the prince. Her slender body already showed signs of pregnancy. Carrying a royal bastard had made her proud, and she took her cue from the prince: She stretched insolently, displaying swollen breasts and belly.\n “You have missed morning prayers, Father.” Brother Humilicus felt obliged to say this every morning.\n “So I have. Here, Milo.” He nudged Milo with a foot, and the boy snorted awake. “Get me my hunting clothes. Dear Brother Humilicus, please see that the horses are ready. Will my cousin Lord Wichman be coming with us?”\n “As you wish, Father,” replied Brother Humilicus tonelessly. He withdrew without further comment.\n Ivar pulled on his tunic, stumbled outside, and washed his face in the cistern. Although winter’s chill stung the air, no ice had formed over the water. In the last month or so snow had dusted the ground two or three times and melted off, and it had rained a few times, nothing more. As he stood breathing in the cold air, the ache in his stomach subsided, but nothing could ease the ache in his heart. He didn’t want to be here in Gent; he didn’t want to go back to Heart’s Rest or Quedlinhame, and he couldn’t anyway. There was no reason to be anywhere. He had had a good life before Liath. He had been happy then, almost. It was all her fault.\n “Maybe she did witch you,” said Baldwin, coming up behind him and resting a hand companionably on his shoulder.\n Ivar began to weep, hated himself for weeping, and got angry instead. “What was the point of seeing the miracle at Quedlinhame? Why would God torment us with seeing Her handiwork so close up, and then abandon us?”\n Baldwin shrugged, found a ceramic pot on the ground, and used it to sluice water through his hair. When he straightened, he set the pot down and wiped water from his eyes and lips. A bead dripped from his nose. “God never abandoned us. The miracle is still with us in our hearts, if we let it be. Maybe Liath was really an agent of the Enemy, like they said at the council. The biscops and presbyters wouldn’t condemn her for no reason, would they? Maybe she shot a poisoned arrow into your heart, Ivar, and that’s why you’re so sad and angry all the time. Prince Ekkehard has noticed it. He’s not sure he wants you among his companions if you won’t drink and laugh and sing with the rest of us.” \n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-217.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: \n In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \n Praise for the Crown of Stars series: \n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\n \n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
