{"id":105867,"no":243,"title":"Page 243","content":"He was cautious with her, but he made it clear to her that once she had recovered, they would, they must, make a child between them. She only stared at him with those huge, delicate eyes.\\n\\n Like a bitter joke, Rage came into season. He penned up Sorrow and let her run with Fear, but she didn’t settle. As with Tallia, he would simply have to wait.\\n\\n Fevrua was understandably known as the month of hardship, with winter stores run out and spring not yet arrived. But under Lavastine’s stewardship, there were provisions enough for his own people, and Alain managed well, leaving to Chatelaine Dhuoda that which she did best and for his own part judging disputes: a rock wall had fallen and now the two house holders quarreled over the exact boundary line; a young man had gotten a young woman pregnant and they wanted to marry, but his parents had already arranged a good match for him and they wanted the pregnant girl’s family to either desist in their claims or else provide an equivalent dowry; a laborer had murdered one of his comrades, but they had both been drunk; mold had ruined a precious store of rye and the farmer in question accused his neighbor of working a charm against his grain because she was mad at him for not letting her son marry his daughter, even though in truth her son was a good-for-nothing slut. Winter disputes, Aunt Bel always said, had a flavor of boredom about them, petty and sullen. He did his best to resolve these disputes with common sense and a clear eye.\\n\\n By the Feast of St. Johanna the Messenger, Tallia had recovered sufficiently to walk out among the poor who came and went in the shantytown built in the woods to the west of Lavas village. Many of them had trudged north away from Salia in the hope of finding shelter here. Every ragged family gave a different story, drought, famine, fighting among lords, Eika raids, and in truth none of them really knew what was going on, only that in Salia there was suffering, no work, and nothing to eat.\\n\\n There was not enough for everyone. There never would be.\\n\\n Often he wept at night, having seen another tiny corpse. It seemed so horrible. It seemed so unjust.\\n\\n Often he set aside a loaf from his own platter, little enough, and himself passed out those loaves late in the evening when he took the hounds out for their last run. And those poor souls had so little that the next day they might speak of one loaf having become twenty, enough to feed forty people; and then some few of his own people might grumble, hearing such rumors, saying he wasted their living on strangers while others would retort that his own folk had plenty and it was the sign of a generous lord who didn’t hoard what he didn’t need.\\n\\n Often he prayed by Lavastine’s stony corpse, but he never received an answer.\\n\\n Come Mariansmass and the first day of spring, the snow melted off, violets bloomed in profusion, and the bier in the church of St. Lavrentius was at last complete. It seemed appropriate to lay Lavastine to rest on such a fine day, with a nip in the air that, like his cool way of showing approval, refreshed one’s heart, and with a sky evenly composed of high, light clouds and blue heaven, neither too dark nor too bright.\\n\\n It took all morning to get the body down the stairs on a sledge. Instead of rigging up horses, they simply tied stout ropes to the sledge and a dozen men gladly volunteered to haul the body to the church. A short walk under normal circumstances, it took an hour to drag the heavy corpse to its resting place, while in the church the deacon led the congregation in the Mass celebrating the martyrdom of St. Marian the discipla. The congregation looked on in silence as workmen used a combination of levers and ropes, stones and pulleys to hoist the body onto the bier. Afterward, they placed Terror at his feet and Steadfast above his head, to accompany him in death.\\n\\n Then, with Alain and Tallia kneeling beside the bier, the deacon sang the mass for the dead, and led the congregation in hymns. The bells rang to conclude the service, and as the assembly filed out, each one of them touched one or the other of Lavastine’s feet before leaving the church. Tallia went away with her servingwomen to see about the funeral feast being readied in the kitchens.\\n\\n Alain found it hard to leave. Somehow, leaving Lavastine alone in here meant he was truly, finally, dead. “Ai, God,” he prayed, “let him not lie in darkness. I pray you, Lady and Lord, let hope arise out of sorrow.” He touched the cool forehead, as hard and as smooth as granite. “I promise you,” he whispered, “that I will see your rightful heir installed as count after me.”\\n\\n “My lord count!”\\n\\n For an instant he didn’t reply, waiting for another voice. Then he brushed a finger over the pale stone lips, turned, and acknowledged one of his stewards.\\n\\n “A messenger, my lord! Duchess Yolande arrives today with full forty folk in attendance!”\\n\\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-243.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \\n Praise for the Crown of Stars series: \\n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\\n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
