{"id":105873,"no":249,"title":"Page 249","content":"Severus went on. “Now. Let us pass over the question of variation of force with distance and consider instead the celestial bodies. Most of the ancient scholars agree that the stars are fallen angels cast out from the Chamber of Light. But in what relation do they stand to the daimones who dwell in the upper spheres? Are the daimones slaves to their motion and their will, or are daimones creatures with free will, as we are?”\n Liath shifted in her chair, hoping he was almost done. He tended to mix theology liberally with astronomy, and theology bored her; she would rather calculate the motion of the planets or observe the natural world than ponder God’s will or dissect some obscure point glossed over in the Holy Verses.\n “So we are fallen,” he continued with a sigh more of disgust than longing. “This is the tragedy of humanity, that our pure souls have fallen through the spheres and lodged in a corrupt body, here into the cruel and transitory world of generation. Could we only lift ourselves closer to God—”\n He broke off. She heard, as clearly as if it were a bell ringing, the barking of a dog. But it was not Sanglant’s dog. Then she heard a shriek.\n Severus moved beyond the blanket. She grunted, heaving herself up, and waddled after him, thrusting the blanket aside and stepping carefully over the threshold, blinking as she came out into the sun.\n At first it was hard to make sense of the scene before her. She cut around the corner of the hall and there, out of sight, squatted to pee while shrieks, growls, and shouts serenaded her. She got herself up again and lumbered back around the corner just as a huge black hound lunged toward Sister Zoë. Liath grabbed a stick, but by the time she reached the scene Heribert had come running, brandishing his saw ineffectually, and Zoë had retreated to the tower where she sobbed from the safety of the doorway while Sister Meriam comforted her. Sister Venia had retreated with Severus, but now she cried out a warning. The hound lunged for Heribert and bowled him over just as Liath whacked it on the hindquarters. It slewed round, growling, but the sight and smell of her caused it to whine and slink away.\n She heard a howl. A moment later Sanglant came at a run, his Eika dog loping ahead of him. The black hound leaped forward, and the air became charged with the expectation of blood and death as the two dogs closed and Sanglant sprinted to reach them before they ripped out each other’s throats.\n “What is this noise?” demanded Anne, pushing past Zoë and Meriam and striding out to place herself beside Heribert, who scuttled backward, crablike, to get out of the way. “From whence comes this creature?”\n As if pulled by an irresistible thread, the black hound broke away, circled back, and padded over to sit at Anne’s feet. There it rested, tongue lolling. Sanglant whistled his own dog back, and it slunk along at his heels, still growling, as he came up beside Liath. He brushed her shoulder to make sure she was all right. She was breathing hard, from the rapid movement or from fear, she wasn’t sure which, but she only shook her head to show she’d taken no harm. He went over to help Heribert up off the ground, and Sister Venia hastened up to brush off the young cleric as solicitously as if he were a three-year-old. They all stared at the black hound who sat submissively at Anne’s feet.\n “What means this?” demanded Anne. She lifted up the hound’s ears to look for ticks, opened its mouth to examine its teeth, and checked its paws for thorns and sores. “Where did it come from?”\n Zoë still would not come out of the tower, but she answered in a breathless voice. “It came out of the circle of stones. Then it went after the goats, and then it chased me. You saw the rest.”\n “I see no reason for this intrusion to interrupt your work any longer.” Anne snapped her fingers at the hound. “Come.’ It followed her meekly to one of the sheds, where she bade it lie down. There she tied it up and left it, after bidding the servants to bring it water. “It will have to be fed,” she muttered\n Severus came over to her, keeping well out of reach of the hound, and began speaking in muted tones that excluded the others. Sanglant had come back to Liath and now he frowned at her.\n “It could have hurt you,” he said.\n “But it didn’t, and it looked as if it were about to rip Heribert’s face off. No harm came of it.” She caught hold of his elbow and with a light pressure drew him closer. “But doesn’t it look to you very like one of Count Lavastine’s hounds?”\n “So it does.” He took in a breath. “And smells like one of Lavastine’s hounds.”\n He was silent for a long time, listening, and she said nothing, only watched him. He had filled out, had lost the haunted expression that had chased him after Gent; his tunic now fit him without the swathes and folds of extra fabric draped over an overly-thin body. He was handsome not because his face was pretty but because he was bold and full of life, the way she had first seen him before the disaster at Gent. She sighed happily and leaned against him. Without taking his gaze off Anne and Severus, he pressed his palm onto her belly and, as if in answer, the fetus rolled, some uncanny communication of movement and pressure between father and child. \n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-249.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: \n In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \n Praise for the Crown of Stars series: \n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\n \n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
