{"id":105875,"no":251,"title":"Page 251","content":"“He’s dead,” she said, and Sanglant replied with a gusting sigh, an “ai!” of despair. “Lord Alain has become count in his place. But he only had two hounds beside him. Maybe the others were in the kennel.”\\n\\n “Ai, God. We should have followed him. I’m sure it was Bloodheart’s curse that killed him.”\\n\\n “The curse that was meant for me,” she murmured.\\n\\n “Peace, my love. What’s done is done. It was God’s will, or it was an accident, but there’s no undoing it now.”\\n\\n “Nay,” she agreed, wiping tears from her cheeks. “It can’t be undone. He’s dead. I saw Alain praying by his bier. Ah!” She grunted, legs smarting, all pins and needles, and got to her feet. Sanglant went with her to the cliff and she ran a hand lightly along the stubbly grain of rock as they walked alongside. The grass grew to the very foot of the sheer rock wall that then abruptly disintegrated into boulders, hulking things like monsters crowding the clearing. It was odd how they sat poised there, all jumbled up and yet with no sign that any had fallen farther to roll down onto the grass. It was as if an invisible hand had halted them and held them steady, there at the verge of the clearing. Snowflakes spun out of the air and lit on her cheeks. She smelled winter, but it didn’t touch her.\\n\\n “I’m sure it’s one of Lavastine’s hounds,” said Sanglant finally. He licked a snowflake off a finger. “I know their smell.”\\n\\n Snow swirled around them, dissolving in the brook that gurgled down from the stones past their feet, powdering daisies and snowdrop and vetch and then melting away into the green grass like the tears of a child who’s just been given a new toy. Beyond cliff and rock wall, winter engulfed the mountains while they stood here in eternal spring.\\n\\n “But if that’s true, how did it get here?” she asked. “Why did it come?”\\n\\n Sanglant said nothing, only brushed his fingers over his neck, where he had once worn the gold torque of royal kinship.\\n\\n 4\\n\\n SHE dreamed.\\n\\n A golden wheel flashed in sunlight, turning. A withered hand scraped at the latch of a door made of sticks bound together, and slowly the door opened; she would see Fidelis’ face at last. Would it resemble that of Emperor Taillefer, which she had seen carved in stone? It was so dark inside the hovel that she could only make out the shadow of a man, frail and ancient, and then the dream slipped through her mind like a fish twisting out of her hands, and as she stooped forward to enter the hut, she walked into a cavern whose walls gleamed as if they had been plastered with molten gold. Young Berthold slept at the base of a burning pillar of rock, surrounded by six attendants whose youthful faces bore the peaceful expression known to those angels who have at last seen God. The flames leaped heavenward, and she could actually see through them into another landscape so vivid that in an instant she was there, standing on a blanket of ice. A blizzard tore at mountain peaks, clouds streaming off the high rock summits, and the scream of the wind almost drowned the voice that spoke in her ear:\\n\\n “Sister, I beg you, wake up.”\\n\\n Her neck was cold and her shoulders were damp, and as she groped for purchase her hands slipped on dewy grass. A bee buzzed in and out of her line of vision. As a breeze came up, grass swayed into her face, tickling her nose. She sneezed.\\n\\n “Sister Rosvita!” With exaggerated care, Fortunatus helped her sit. “You fainted. Are you well?” A rising sun glinted in her eyes, and she had to shadow her face with a hand.\\n\\n “I’m very confused,” she said feebly. “Where are we? Is Sister Amabilia here?”\\n\\n “Hush, Sister.” He was smiling stupidly and he patted her hand more in the manner of a man soothing a nervous hound. “We are safe. Here. Let me help you up.”\\n\\n Even with his help, she trembled as she stood. She had pressed too hard after her illness, and it was all hitting now. The scene was so impossibly strange that she knew she was still dreaming. But she heard the bee clearly enough, humming about its business, and her nose tickled most realistically, stung by pollen, and she sneezed again.\\n\\n “God bless you,” said Fortunatus.\\n\\n Perhaps she wasn’t hallucinating.\\n\\n She stood on a grassy knoll sprinkled with sweet cicely, milk-white snowdrops, and the poisonous blue of wolfsbane, such a lovely flower that anyone might be forgiven for thinking it had some fine virtue when in fact it was deadly. Behind her, where the hill leveled off into a flat summit, a circle of standing stones crowned the height. Before her, the entourage had scattered down the hill like children at play, making for a ribbon of road worn into land below. Their spirits were infectious; they whooped and laughed and called out, and Fortunatus actually clapped her on the shoulder and pointed to the vista before them. \\n\\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-251.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \\n Praise for the Crown of Stars series: \\n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\\n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
