{"id":105891,"no":267,"title":"Page 267","content":"Henry sat back, and when the crowd had settled down, waiting for his response, he lifted a hand. “I want my dinner, and I have heard enough for today.” He rose, and the assembly was thereby dismissed.\n But that evening at twilight Hanna stood beside Hathui, and together they watched the king pacing in the garden as a fine drizzle dampened his cloak. She had given him Sapientia’s message, and now she simply had to bide her time together with all the other Eagles who rode in attendance on the king, waiting to be sent out again.\n “He still mourns his mother,” observed Hathui, “may her soul rest in peace. I tell you, Hanna, the king needs good cheer in his life, not dispute after dispute like this one!”\n “Then you favor Count Alain?”\n “Thank God I don’t have to pass judgment! Lord Geoffrey’s accusations are troubling, and hard to disprove. But Count Alain is no fool. King Henry respected Lavastine, and as Alain said, it is harder to pass judgment on the actions of a dead man than on the worthiness of a living one.”\n “Do you think so? The dead man can’t defend himself.”\n “But a good reputation is its own defense. It’s harder to pass judgment exactly because he can’t defend himself, because the whole of his life is laid out before you. Who are we, then, to decide we would have acted differently, and that our actions would have turned out for the better?” The rose garden was laid out between the great timber hall and the stone tower, bound on the other two sides by a roofed walkway and a log palisade. A half dozen servingmen lounged under the shelter of the walkway’s roof. “I do believe also that Lavastine and Alain will always be linked in the king’s mind with his own wishes for Prince Sanglant. For that reason, I think him likely to favor Count Alain over Lord Geoffrey.”\n Hanna hitched up her hood and held it tight under her chin. The wind shifted, and a mist of rain blew into her face. From the other side of the log palisade she heard the sound of horses being led into the stables after their afternoon’s exercise. Grooms called out to one another, laughing and joking.\n Footsteps crunched on the path behind them, and they moved aside for Villam to pass. He conversed with the king for a few moments, then went back the way he had come, into the stone tower.\n “Is there news of Liath?” asked Hanna softly.\n She couldn’t see Hathui’s expression, but she felt the other woman stiffen and shift a little away from her. “She ran off with Prince Sanglant. Nay, you knew that. You were still with the court then. The Council of Autun found her guilty of the crime of sorcery, and excommunicated her. If you have any traffic with her, Hanna—”\n “I’ll be excommunicated in my turn. But nevertheless, she is my friend, and whatever she was accused of, I know she’s innocent. What happened to Father Hugh?”\n Hathui grunted under her breath. “He was sent to Aosta to stand trial before the skopos. Only she can pass judgment on a man of his rank.”\n “You’ve heard nothing since from Liath? No word of Prince Sanglant?”\n “Nothing,” replied Hathui, even more softly. “And I’ve looked….”\n Her tone held a caution in it, but Hanna’s curiosity was piqued. “What do you mean, that you ‘looked’?”\n Hathui glanced around to make sure no one stood within earshot, but the stewards were far away and the king had walked to the farthest corner of the garden, where the curve of the stone tower met the palisade wall. Here a dog rose climbed a fretwork, and he touched a flower, bent to smell it, then, as with a fit of temper, snapped it off.\n “You’ve served the Eagles well and faithfully,” said Hathui in a low voice, “but you must wait until Wolfhere returns, for I’ve not the knowledge to teach, only to see a few shadows.”\n “I don’t understand you.”\n “There is more than one sight with which an Eagle can see. Wolfhere knows the secret of it, as do a few others. Those of us who can, learn it to aid ourselves and to aid the king. But you must never speak of it to anyone else. It’s like our badge. It’s part of our oath, sworn to serve the king and to aid each other.”\n “Serve the regnant and no other,” said Hanna, watching the king. He plucked the petals on the rose and ate them, wincing a little at their tartness, then picked a second rose. “Speak only the truth of what you see and hear, but speak not at all to the king’s enemies. Let no obstacle stand in the way of your duty to the king. Let your duty to your kin come second, and make no marriage—” Here she broke off, and Hathui finished for her. \n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-267.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: \n In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \n Praise for the Crown of Stars series: \n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\n \n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
