{"id":105896,"no":273,"title":"Page 273","content":"Yet did God love them any less than They did the fine nobles who never wanted for elegant clothing and full platters?\\n\\n But you’re nothing so noble as a beggar’s child. The voice scraped at him like a finger picking at a fresh scab. Did God love whores, too? The shame of having it spoken out loud in front of everyone still gnawed at him. It would never cease gnawing. His foster father Henri had protected him from the truth of what she was all this time. He had only ever said one thing about her, that she was beautiful. As if that was all that mattered. And maybe, in God’s heart, that was all that mattered.\\n\\n Rage whined, butting him, and he scratched her around the ears, buried his face in her massive neck as he patted her and she grunted contentedly. What about the testimony of the hounds? Yet where had Fear gone? Would he ever return?\\n\\n He ran a hand over poor Terror’s stone flanks where the old hound lay in death at Lavastine’s feet. The curse had marbled as the old hound stiffened and died, so that he looked hewn of a dark stone stippled with white. Lavastine lay peacefully, with Steadfast guarding his head and Terror his feet. The shame of this day did not touch him, for certainly he had atoned for his sins; his soul had ascended to the Chamber of Light. Alain had to believe that.\\n\\n Beside him, Sorrow stood stiffly, growling, but made no move to plunge forward. Alain clambered to his feet and combed back his hair with a hand.\\n\\n But he stood alone in the church, just as he had stood alone in the hall.\\n\\n Then he saw her back by the door, peering nervously out from behind the first square column. “Come forward. The hounds won’t hurt you.”\\n\\n Lady Hathumod moved with the hesitancy of a fawn approaching tame lions, innocent enough to trust and yet held back by an ancient caution.\\n\\n “Have you brought word from her?” he asked eagerly. She halted three paces from him, head bowed modestly, fleshy hands clasped in an attitude of prayer. “Nay, my lord. She refuses to see you. She refuses to send you a message.”\\n\\n “Then I will go to her! It isn’t right that Duchess Yolande keep us apart in this way.”\\n\\n Boldly, she stepped forward to lay a hand on his forearm as if she meant to hold him in his place. Then, as quickly, she jerked back. Her cheeks flushed a bright red. She still wouldn’t look him in the eye. “Nay, my lord, please do not do so. You will only humiliate yourself.”\\n\\n “How can I possibly bring on myself any greater humiliation than was heaped on me yesterday?” Bitterness rose in his throat, bile burning up from his stomach. “Tallia trusts me. She only need see that I haven’t blamed her for what happened. It isn’t her fault that Duchess Yolande dragged her away. I’m sure she didn’t want to go, not truly.”\\n\\n “I pray you, my lord.” She seemed almost to weep out the words as she clutched her hands together so tightly that her knuckles were white and the tips of her fingers red. “Do not blame Duchess Yolande. No matter what you say, Lady Tallia will not see you. So you must either be seen begging outside her door like a vagrant or breaking into her private chambers like a common thief.”\\n\\n “Since most of the nobles here think I am no better than a whore’s son, how will it harm me—?” Knowing it was excessive, he broke off. He simply could not believe that Tallia had abandoned him so callously.\\n\\n “I pray you, my lord,” she said in her soft voice. “Do not waste yourself suffering over that woman, for she is not worthy of you.”\\n\\n Amazed, he watched as tears slipped down her cheeks. “What do you mean?”\\n\\n “Tallia is the flawed vessel. She is how God has tested our faith, for truth was given to her, but it cracked her.”\\n\\n He was too stunned to reply. How had she concealed this disrespect for her mistress all these months? He had never guessed that Hathumod was anything but an obedient companion, willingly accepting banishment from Quedlinhame in order to remain with her beloved lady.\\n\\n “I know, my lord, that you do not believe the true word as revealed to us by Brother Agius, to whom God granted the glory of martyrdom. Yet who am I to question God’s design? I, too, am only God’s vessel.”\\n\\n “Surely the Lady sent you to stand beside Tallia. She needs someone to take care of her.”\\n\\n Her mouth, tightening, gave away the depth of her disgust. “She turned her back on the one who loved her selflessly. I am leaving her service, my lord.”\\n\\n “But where will you go? Back to your family?”\\n\\n “Nay, they sent me to the cloister because they have too many daughters and not enough land to divide between them. They do not want me back.”\\n\\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-273.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \\n Praise for the Crown of Stars series: \\n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\\n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
