{"id":105955,"no":335,"title":"Page 335","content":"As they came into camp, the army split into factions according to a complicated and confusing maneuver which she couldn’t follow, but in the end she approached the royal pavilion in the company of Prince Ekkehard, Lord Dietrich, who led the cavalry sent by King Henry, and Captain Thiadbold, representing the Lions.\n The princess sat at her ease beneath the awning of her pavilion, eating a plum as she watched her husband roll dice with a young Wendish nobleman and a flamboyantly dressed Ungrian who boasted mustachios so long that he had tied them back behind his neck to keep them out of the way of his game. Brother Breschius stood quietly in attendance, and it was he who delicately interrupted the game, although by this time Sapientia had risen, seeing Ekkehard or, perhaps, Hanna. Maybe it wouldn’t be such a joyous reunion.\n Bayan hadn’t forgotten her. He leaped up enthusiastically. “The snow woman to us returns!”\n “You have come from my father,” said Sapientia, more coolly, glancing at her husband with the sudden pinched mouth common to those who distrust their intimates. “And who is this? Ekkehard?”\n “Sister! Aren’t you glad to see me?” He dismounted and came forward, not waiting for permission. She embraced him in a sisterly fashion, kissing him on either cheek. He was taller than Sapientia, but she had gotten a little stouter in the past months, broader in the shoulders, and set against his youthful slimness she looked quite able to out arm wrestle him, should they set to it.\n “God help us, little Cousin,” said the young nobleman who had been playing at dice with Bayan, “I thought for sure you’d be eaten alive by the Quman.”\n “No thanks to you, Wichman!” retorted Ekkehard, and for a moment they looked ready to come to blows, but Bayan stepped neatly between them.\n “God have blessed us,” he exclaimed. “New troops to us come. With this number, we can meet the Quman.”\n Tallies were quickly made, but Sapientia’s humor did not improve. “Two hundreds of Lions? Thirty heavy cavalry and no more than two score inexperienced light? Arid Ekkehard with twelve untried boys and a few servants? Is this all my father could spare, Eagle? Didn’t you tell him how urgent our situation is here?”\n “I relayed your message faithfully, Your Highness,” said Hanna.\n “Come now, wife,” said Bayan, interceding. “The lioness must not upon the Eagle pounce who is the messenger only.” He seemed amused by his own wordplay and laughed heartily. “Also the margrave’s forces we have, and so this is more than what before we had, is it not?”\n “So it is,” agreed Sapientia grudgingly as he caressed her shoulder. “But where is my father? I thought he would understand how grave our situation is and ride here himself. Where is he, Eagle?”\n “Riding south to Aosta, Your Highness.”\n “Aosta! Always Aosta!” She flung the plum, which narrowly missed striking one of her attendants and instead rolled off into the dirt. “Why is he wasting his substance in Aosta when the real threat is here? He hasn’t—” She broke off. But a moment of stillness exhausted her resources. “There hasn’t been word of Sanglant, has there?”\n Hesitation is always fatal.\n “I knew it!” cried Sapientia in cold triumph. “Tell me what you’ve heard—!”\n “I know nothing official, Your Highness. But it has come to the king’s attention—” She had no chance to finish. Her cautious recital was interrupted by the arrival of Margrave Judith with a retinue of servants and companions at her back. The margrave was, manifestly, in a cold anger.\n “Is it true that Prince Ekkehard has arrived among us? By God, so it is. Where is he?”\n “Ekkehard is here,” said Sapientia, although it was obvious to everyone else that Judith knew exactly where Ekkehard was.\n To give him credit, he did not shrink away from her. “He wants a divorce,” he said as calmly as any lad of fifteen or so years could to a furious, formidable, and armed woman old enough to be his grandmother.\n Someone in her crowd of followers tittered and was hushed. “A divorce is within my right to obtain, not his. He has no grounds for divorce, nor has his family power enough to abrogate our agreement. Nor can the marriage be annulled since I recall quite vividly that it was consummated. So the marriage remains binding. Where is he?”\n Ekkehard was not a king’s son for nothing. “I swore that I would protect him. If I give him up to you, then I cannot count myself an honorable man.”\n “You are not even a man, Prince Ekkehard. You are only a very foolish boy.”\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-335.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: \n In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \n Praise for the Crown of Stars series: \n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\n \n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
