{"id":105973,"no":353,"title":"Page 353","content":"Ai, God. Still alive.\\n\\n Jerna’s sweet breath tickled his hand, soothing his skin.\\n\\n As he stood there, catching his breath, he saw dawn’s light rime the eastern slopes. Somehow, the night had passed them by.\\n\\n “Sanglant.” The hand that closed on his hand was still cool, slightly moist, as though she was coated with a sheen of water. Her voice was a stranger’s voice and yet entirely familiar. Was this truly his mother, who stood before him dressed in nothing but a ragged skin skirt and bold painted patterns marking her otherwise naked skin? “I did not know they had made such an ancient and dangerous enemy. Let us go.”\\n\\n He let go of the pony’s halter and staggered forward, slipping on ash. Even the ground had been parched and blackened. Alone of all things in this valley, the stone circle stood untouched. Of the marble walls and ebony gate he saw no sign. A single figure lay crumpled at the base of one of the stones: Anne.\\n\\n Liath was gone.\\n\\n Maybe he had known from the first instant he had seen them breach the gate and emerge into this world, which could not contain them. He had sensed it before, but now he finally, truly, understood what essence lived inside Liath, like a second being trapped within her skin.\\n\\n Fire.\\n\\n “Sanglant, we must go.”\\n\\n He looked at her bleakly. “Where do you intend to take me?” he demanded. “Why should I trust you? How do I know you didn’t bring those creatures through to attack us and steal my wife?”\\n\\n She sized him up rather like a lady examines a stallion she will buy as long as its temperament proves suitable. “I beg your pardon, Son. There should be affection between us, but there is none.”\\n\\n “You abandoned me.” He hadn’t known he was so bitter. He hadn’t known until this moment how much he resented her for what she had done.\\n\\n But she took no offense at his anger. “I abandoned you because I had to. Because you had to build the bridge between our kind and humankind.”\\n\\n “A bridge, or a sword?”\\n\\n “What can you mean?”\\n\\n “Isn’t it your intention to conquer humankind once you return to Earth from your refuge?”\\n\\n She cocked her head to one side, regarding him quizzically. “This I do not understand. Not by our own will did we leave Earth.”\\n\\n With a great sighing gasp, the timber hall collapsed in on itself. Ash and smoke poured up from its rubble into the sky, teased and torn by daimones as they fluttered round the ruined valley. Were they free, making sport of their old prison, or were these the ones not yet unbound from Anne’s spell? Anne herself, lying by the stone, groaned and stirred. Below, a hound barked, and he saw its black shape come loping up the hill.\\n\\n “Her I do not wish to battle again,” said his mother. She flicked soot from her mouth, spat, and scented the air, almost like a dog might. “My servant is of no more use to me.”\\n\\n “Is he dead? Should we bury him?” But he, too, watched Anne suspiciously, and in truth, a good captain knows that at times one must retreat in good order even when it means leaving the dead behind.\\n\\n “Let us go,” she repeated, as if in echo of his own thought. “Time grows short. Can you take me to Henri?” Although she spoke understandable Wendish, she still said his father’s name in the Salian way, with an unvoiced “h” and a short, garbled “ri”.\\n\\n He whistled, and good Resuelto, miraculously unharmed although a trifle singed, trotted nervously over to him, the poor goat hobbling in his wake. He untangled her back legs from the leadline, although she bleated most accusingly and tried to chew on his arm. Her kid was gone, consumed by the galla. “I know a path out of the valley that should be open now, unless you want to leave the way you entered. Through the stones.”\\n\\n “Where they did walk, the old paths will be twisted by their fire into a new maze.” Hoisting her spear, she shook it, and the bells tied to its base tinkled merrily. “That gate is closed to us.”\\n\\n “Ai, Lady,” he murmured as he took Resuelto’s reins and soothed the agitated horse, then offered the reins to her.\\n\\n “Nay, I walk. I lead this small horse.” Cautiously, she touched Blessing on the head. Jerna slid away, twining onto Resuelto’s neck. “So fecund is the human blood,” she murmured, as if to herself. Then she turned and gestured toward the woodland. The air still had a smoky color, almost purplish with dawn. Small animals skittered through the ashy remains, and as they started up the path, leading the two horses, he saw tiny animals digging out from the debris, frantic squirrels and bewildered mice, cluttering or silent as was their nature. \\n\\n","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-353.html","bookId":2014,"book":{"id":2014,"title":"The Burning Stone (Crown of Stars #3)","description":"Storyline: In the third volume of this astonishing Nebula Award-nominated fantasy series, the many plot strands created in the first two novels become more tightly interwoven--as the time of the cataclysm nears when people and places long sundered by magic will once again reside in the same time and universe...\"The best thus far...I can now honestly say I am rabid for the next book.\"--B\u0026N Explorations \\n Praise for the Crown of Stars series: \\n \"Well-thought-out, well-structured, and well-crafted... There\u0027s a bone-deep reality to the world.\" --Fantasy \u0026 Science Fiction\\n","cover":"https://allnovel.net/images/the-burning-stone-crown-of-stars-3.jpg","author":"Kelly Elliott","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-burning-stone-crown-of-stars-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:37:34 PM"}}
