{"id":9614,"no":12,"title":"CHAPTER XIII. AN UNEXPECTED SIGNAL.","content":"THE mystery to the lads was deeper than ever. Matters were inexplainable before, and now they were still more involved. \\n\\n \\n\\n “It strikes me,” said Herbert, “that the best course for us is to stay where we are and watch things.” \\n\\n \\n\\n “Nothing would suit me better, and yet it would be hardly right, after our promise to Strubell and Lattin. They asked us to ride forward to the spring, and we promised to do so. If we stay here we break our word. True, we would be sure to pick up some interesting information, but it would be of a kind that they don’t want us to have, at least for the present.” \\n\\n \\n\\n “You are right, as you always are,” replied Herbert; “it did not occur to me in that light; let us go on.” \\n\\n \\n\\n [115] \\n\\n \\n\\n Walking back to where their ponies were waiting, they remounted and started forward in the same order as before. Both were busy with their thoughts, and filled with a disquiet which disturbed them a good deal. They would have been glad to drive away the misgivings, but could not. The conviction was strong on each that a grave crisis was at hand, and that, before the setting sun showed itself again, every member of the party was likely to become involved in greater peril than they had faced since their union. \\n\\n \\n\\n The trail continued descending at the moderate rate of its ascent, and, at the point named by the Texans, it turned sharply northward, following a course parallel to the ridge and at its base. \\n\\n \\n\\n They expected to travel about a half mile over the new course, which they found freer from bowlders and obstructions than before. The horses moved with a brisker pace, as if they knew camp was not far off, and a long and grateful rest was at hand. \\n\\n \\n\\n At the moment of emerging from the hills, and reaching the lower level, the sun dipped[116] below the horizon and twilight began. Far to the westward stretched the broad prairie, with the faint blue line of a distant chain of mountains, resting like a cloud against the clear sky beyond. \\n\\n \\n\\n The sweep of the field glass failed to reveal any living creature. It seemed to the youths as if they were entering upon a vast solitude, where they were the only intruders. They pushed along the path in silence, the sounds of their animals’ hoofs being all that broke the solemn stillness. Nick turned his head now and then, and, looking over the backs of the pack horses, saw that Herbert was more thoughtful than usual. His face wore a grave expression, which proved that the situation oppressed him. \\n\\n \\n\\n “But,” added Nick to himself, “suppose his suspicions are right, what harm can result? If Strubell and Lattin are friends of Rickard, and have an understanding with him, in what way can it affect us? Mr. Lord may be deceived into believing they are honest, but we have nothing to fear. None of them has ill designs against us, and, whatever the relations[117] of the parties, our friends would never permit the outlaws to molest us.” \\n\\n \\n\\n Nick might have persuaded himself fully to this faith, but for the remembrance of the scene the night before. He could not forget the threat of Rickard as he walked off in the gloom, nor would that bad man forgive the indignity put upon him by a boy in the presence of a couple of acquaintances. Such characters are as revengeful as American Indians, and he would lose no opportunity of paying him therefor. It is a sad fact that about half the world are engaged in “getting even” with the other half, for fancied wrongs received at their hands. \\n\\n \\n\\n Nick had not ridden far when he abruptly checked his pony and called to Herbert: \\n\\n \\n\\n “Halloo! here’s something we didn’t bargain for.” \\n\\n \\n\\n “What’s that?” asked the surprised Herbert. \\n\\n \\n\\n “Come forward and see.” \\n\\n \\n\\n The elder was about to dismount, when he perceived that, by crowding, he could force Jill alongside of his friend. He did so, and discovered[118] that which had checked the procession. \\n\\n \\n\\n The trail which they had been following divided, one branch turning to the right and the other to the left. The divergence was so slight, that there could not be much space between the two at a considerable distance beyond, unless the angle increased. \\n\\n \\n\\n “It’s singular that neither Strubell nor Lattin said anything about this,” remarked Nick, looking inquiringly at Herbert, who was following the path with his eye. \\n\\n \\n\\n “I don’t understand that any more than I understand the other matters we have been talking about. How are we going to tell which is the right course?” \\n\\n \\n\\n It will be remembered that the youths had been riding northward, along the base of the ridge, where the ground was comparatively level; but for some distance the trail turned slightly in among the hills, compelling a moderate descent, and a more winding course, through and around the bowlders and obstructions. At the point where Nick had reined up his pony this trend became more pronounced,[119] while the path on the left led down toward the foot of the hills. \\n\\n \\n\\n The difficulty lay in the fact that each was marked with equal distinctness, and it was, therefore, beyond their power to decide with certainty which was the right one to follow. This was proven when Nick gave it as his belief that the one on the right was the main trail, while Herbert was equally positive that the reverse was the case; how, therefore, was the question to be settled? \\n\\n \\n\\n “There’s one thing clear to me,” said Nick, seeing how matters stood; “Strubell and Lattin are certain that we are not placing ourselves in any danger by leaving them behind and riding on alone; for we agree that the movement was meant for our good. We haven’t caught the first sight of man or animal, so we need not be troubled. Now, I will follow the upper path, which I think is the right one, while you take the lower. That will be better than for each of us to take the wrong course, and then come back to travel the same distance along the right one.” \\n\\n \\n\\n “But how will we manage it?” asked Herbert,[120] who was not well pleased with the proposal, despite his confidence in Nick’s judgment. \\n\\n \\n\\n “In the first place, we shall not be far apart after going a long way, unless there is a more abrupt divergence than we see here. If I reach the spring, as I feel sure I shall, I will call to you and you can join me.” \\n\\n \\n\\n “By riding back here to this fork—what will I gain by that?” \\n\\n \\n\\n “I think you can save considerable distance by riding across the intervening ground, though, if that can’t be done, and you have to double on your own trail, it will be but one, instead of two, who has to do it. If we keep together, and both go wrong, we will have double work, while by dividing, one is as sure to be right as the other is to go astray; consequently half the labor will be saved.” \\n\\n \\n\\n “What about the pack horses?” \\n\\n \\n\\n “I guess they would better go with me.” \\n\\n \\n\\n Herbert laughed. \\n\\n \\n\\n “That shows your faith in your own theory, but I am willing, though just as sure as you,[121] that you are putting extra duty on the animals.” \\n\\n \\n\\n “When I strike the spring,” continued Nick, with a smile, “I will give a whistle, which you will understand as a call for you, and you can cut across lots or gallop back to this point and follow after me.” \\n\\n \\n\\n “At any rate,” added Herbert, “I don’t see that the matter is very important, for we shall not be separated long. I will whistle to you when I reach the spring. Since I have only Jill, I will press on faster than you, and save you extra work.” \\n\\n \\n\\n With this laughing parting, each set out to verify his own theory, confident that they would soon come together again. \\n\\n \\n\\n Nick was inclined to force his pony into a gallop, for the trail was so free from obstructions that this could have been easily done, but he was afraid it would disorganize the pack horses. Their loads were not heavy and were generally fixed so securely in place that they could gallop whenever required, without risk to the property; but the goods had been hastily adjusted, when on the other side of the[122] ridge, and were likely to become disarranged, for the animals were so trained to follow their leader that when he increased his pace they were quite sure to do the same. \\n\\n \\n\\n “I knew I was right!” exclaimed Nick, with a laugh, after riding a fourth of a mile, as he came upon a broad, deep, crystalline spring, which warranted all the praise the Texans had bestowed on it; “I don’t see why Herbert was so positive; I’ve got him this time, and he’ll have to own up.” \\n\\n \\n\\n As agreed upon, he placed the tip of his finger and thumb against his tongue to emit the signal; but, before he could do so, the very same call reached him from the foot of the hills. Herbert had summoned him to retrace his steps to the fork and join him! \\n\\n \\n\\n “What under the sun can that mean?” asked the amazed Nick, holding his thumb and finger in front of his mouth, undecided what to do. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1539/45825.html","bookId":1300,"book":{"id":1300,"title":"Across Texas","description":"简介： NICK RIBSAM, of whom I had considerable to tell you in The Young Moose Hunters, returned to his humble home in Western Pennsylvania with his health fully restored by his stirring experience in the mountainous forests of Maine. He was naturally strong...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1539","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
