{"id":97038,"no":53,"title":"Page 53","content":"Her voice broke off and her eyes dropped. I took one of her small hands in mine. Her flesh was cold. “Ed, help me,” she pleaded. “If you help me maybe we can find out what it’s all about and then go to the police. It won’t do any good to go to them now.” She had a point. She couldn’t give the cops anything much to work on. “Jill.” She looked at me. “Think, now. Were you or Jackie ever arrested? I mean for any offense at all.” “Just a traffic ticket once. Nothing more.” “Did they fingerprint you?” “No, I just got a ticket.” “Were either of you ever fingerprinted for anything? A government job? Anything?” “I turned a trick with a UN diplomat once. But you don’t get fingerprinted for that sort of thing. Why the questions?” I filled a pipe and lit a match. Without prints, it was going to take them awhile to identify Jackie Baron’s body. A corpse without identification is a tricky thing, and although police routine always comes up with an answer, it takes time. They run through Missing Persons files, they ship the prints to Washington, they play games with laundry marks… So we had time to dig around a little. “All right,” I said. “We’ll leave the police out of things, at least for the time being.” “And you’ll help me, Ed?” “I’ll help you,” I said. FOUR I put my gun in the shoulder rig where it belonged, went to the window, pulled back the shade, and peered across the street. A few old ladies were walking home. No one seemed to be lurking in the shadows. “Did anyone follow you here?” “No.” “Are you sure?” “No.” I told her to wait there and left the apartment. I walked downstairs, then left through the rear exit where the janitor drags the garbage. There is a low fence between the yard of my building and the yard of the building behind it that fronts on 84th Street. I pushed a garbage can against the fence, climbed onto the can, and dropped over the fence. I walked through that building, smiled at a curious seven-year-old boy, and came out on 84th. The air was cooler now with the beginnings of a storm blowing up over the East River. The sky was a darker gray; in a few hours it would be completely black. I walked around the block to 83rd and headed toward my own building again, keeping my eyes open. All the parked cars were appropriately empty, all the doorways were now untenanted. If she had been followed, her shadow had melted. The coast seemed clear. I went upstairs. She was standing by the fireplace looking at some of my books. “Grab your purse,” I said. “Where we going?” “Downtown. I’m hiding you.” We left the apartment. A cab drove up, and I gave the driver an address in the West Twenties. As he put the taxi in gear, Jill looked at me inquisitively. “It’s a friend’s apartment,” I said. “Anyone I know?” “Probably not. She’s an actress, out of town with a road company. She won’t be back for two months.” “And you have a key to her apartment?” “Yes.” She smiled. “How cozy, Ed. Hiding one girl at a girlfriend’s apartment. Won’t she mind?” “She won’t be there to mind,” I said. She kept quiet the rest of the trip. Once or twice she dabbed at her eyes with a handkerchief. The cabby took Second Avenue downtown to 23rd Street, then cut west and doubled uptown a block to the address I had given him. “Here?” Jill said, surprised. “That’s right.” “Your actress friend can’t be making much money.” “It’s a tough business.” “It must be. Maybe she should try my line, Ed. Or doesn’t she have any aptitude in that direction?” “Don’t be bitchy.” She pouted. “Was I being bitchy?” “Very.” “I’m sorry,” she said. “I’ll try to be good. It’s just…I guess I’m cracking wise to get Jackie out of my mind, what happened to her, and, oh, it isn’t really working, Ed.” Jill and I climbed an unlit and shaky staircase past the machine shop on the first floor and Madame Sindra’s palmist studio on the second floor. She stood in front of Maddy’s door while I found the right key and opened it. We went inside. She sat down on a couch while I turned on the lights. “Well,” she said. “Now what?” I sat down next to her. “You’ll be safe here,” I said. “I know.” “And you can stay here while I try to get a line on whoever is after you. But I’ve got to ask you a question I already asked you, Jill. And you have to answer it straight.” “Go on.” “Were you mixed up in anything besides hustling?” “Isn’t that enough?” “I’m serious. Ever try blackmailing a customer? Or did you ever overhear anything you shouldn’t have heard? Think about it. It’s important.” Her face screwed up in concentration and then relaxed. She shook her head negatively. “Nothing?” “Nothing.” “And Jackie?” “If she was, I never knew about it.” “Then it can only add up one way,” I said. “Somebody had a reason to see Jackie dead. But you both looked alike and you both acted alike and he couldn’t tell you apart. Maybe Jackie was working some sort of deal of her own. He couldn’t be sure it was Jackie he was after, or that you weren’t in on it with her. So he has to kill both sisters to make sure he gets the one he wants. Do you follow me?” She nodded but looked perplexed. “Jackie wouldn’t do anything like that,” she said. “Are you positive?” “Well—” I got to my feet. “I want you to stay here,” I told her. “Don’t leave the apartment, not for anything. Don’t make any phone calls. As long as you’re here, you’ll be safe. Nobody followed us here and nobody’s going to come here looking for you. Just stay put and wait for me.” “Where are you going?” “To your apartment.” She stared at me. “Is that safe? The police—” “I’m sure they haven’t identified Jackie’s body yet. It should take them two or three days unless they get lucky. And if I spot any cops, I’ll come right back. If not, I’ll have a look at your place and see if Jackie left anything around of interest.” “And suppose the…the killer is waiting there?” “That’s a chance I’ll take. But I’m a big boy.” She looked me up and down, the kind of look I had given her earlier. “Yes,” she said evenly. “You are.” “Give me your apartment key.” She went over to her purse and gave me a brown leather key-wallet. She started to hand it over; then she took it back and looked at it, frowning. “This is Jackie’s,” she said. “What?” “It happens all the time,” she said. “We both have these things for our keys, same color, and we keep taking each other’s—” She broke off and looked at me. Her eyes were bright, as though she were trying to put a smile on top of a scream. “I keep forgetting she’s dead. I talk about her as if she’s still here…” She collapsed in a chair and cried. Her shoulders heaved from her sobs. I’m no good at that sort of scene. The reality of her sister’s death was first hitting home, and for the next hour or so there wasn’t anything I or anybody else could do for her. I took her dead sister’s keys and said, “Jill, I’ll hurry back.” There were three other apartments on the second floor besides the one I sought, and someone was standing in the hallway in front of one of them. I didn’t want an audience when I opened Jill’s door—New Yorkers are tolerant people, but there is no point in straining this inherent tolerance. I walked up to the third floor and waited. Then I went back to the second floor, emptied my pipe in a hall ashtray, and stood in front of Jill Baron’s door. I took out the key to the apartment, listened at the door, heard nothing. On a hunch I dropped to one knee and squinted myopically through the keyhole. The apartment was dark inside. I stood up again, stuck the key in the lock, and turned. I twisted the doorknob, pushed the door open, and stepped into a black room. I was groping around for the light switch when the Empire State Building fell on my head. It was good but not good enough. He caught me on the side of the head just above the ear and I did a little two-step and wound up on my knees. He moved in the darkness, coming in to throw the finisher. My head was rocky and my legs wouldn’t behave. I managed to swerve out of the way of the blow and got to my feet, but my rubbery legs didn’t want to hold me. He came at me again, a blur in the darkness, and something hard shot past my head. I ducked and swung, aiming for where his gut should be. My aim was good but there was nothing behind the punch—the shot on the head had drained my strength. He backed away from the blow and hit me in the chest. It wasn’t a hard punch but it sent me reeling. Somehow, I got to the light switch. I flicked it on and saw him, moving toward me and blinking at the sudden burst of light. A big man, a fast man. A chin like Gibraltar and a chest like a beer barrel. Hamhock hands, and a leather-covered sap in one of them. He swung the sap. I dodged, caught it on one shoulder. My arm went numb and my fingers tingled. I tried to make my hand fish the .38 out from under my jacket, but my arm was having none of it. It wouldn’t behave. He moved at me, grinning. I doubled up a left hand and pushed it at him. He batted it out of the way casually and kept coming. I lowered my fat head and charged him like a bull, and he picked up that sap and let me have it right between the horns. This time it worked. I caught a knee in the face on the way down but I barely felt it at all. I just noticed it, thinking, Ah, yes, I’ve been kneed in the face, taking note of it but not caring a hell of a lot about it one way or the other. Then I blacked out… FIVE I wasn’t out long. Five minutes, ten minutes. I opened both eyes and blinked in the darkness and tried to get up, which was a mistake. I fell down again. It was as though someone had cut the tendons in my arms and legs. They just wouldn’t do my bidding. This time I stayed down for a while. I took deep breaths the way they do in the movies, and I also took inventory. My head felt like a sandlot baseball after nine innings. My shoulder was aching and my arm was numb. I got up and, this time, stayed erect. The room was dark—apparently my “friend” had shut off the lights before leaving—but I managed to find the light switch for the second time that night. This time, though, I was alone. I found a chair, collapsed into it, and smoked a cigarette. There had been just the two of us, me and the man with the sap. But the room looked as if it had been the scene of a gang war. A bookcase stood empty on one wall, its contents heaped on the floor. Chair and sofa cushions were scattered around. My friend had been looking for something. Whether he had found it, I couldn’t tell.","sourceLink":"https://allnovel.net/one-night-stands-and-lost-weekends/page-53.html","bookId":2318,"book":{"id":2318,"title":"One Night Stands and Lost Weekends","description":"Storyline: In the era before he created moody private investigator Matthew Scudder, burglar Bernie Rhodenbarr, sleepless spy Evan Tanner, and the amiable hit man Keller—and years before his first Edgar Award—a young writer named Lawrence Block submitted a story titled \"You Can\u0027t Lose\" to Manhunt magazine. It was published, and the rest is history. One Night Stands and Lost Weekends is a sterling collection of short crime fiction and suspense novelettes penned between 1958 and 1962 by a budding young master and soon-to-be Grand Master—an essential slice of genre history, and more fun than a high-speed police chase following a bank job gone bad.","cover":"https://allnovel.net/images/one-night-stands-and-lost-weekends.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/one-night-stands-and-lost-weekends.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:23:12 PM"}}
