{"id":76593,"no":57,"title":"Page 57","content":"“You better write,” Mary Lou said at last.\\n\\n The first postcard arrived on a Thursday. It had pictures like an old Technicolor movie and was from somewhere called Peoria, Illinois. Other postcards followed: Topeka, Kansas. St. Cloud, Minnesota. Marfa, Texas. Norman, Oklahoma. Sometimes, pictures arrived in long, flat brown envelopes. Annie posing with a whip beside the striped circus tent. A bear in a fez on a unicycle. Moss-laden trees you’d never find in Nebraska. The world’s largest pile of shoes. No note would accompany these. Annie would simply write a caption on the back. “Miss Novak admonishes the tent for its fashion faux pas.” “Bear on Unicycle, Series 12.” “World’s largest pile of air fresheners next stop.” For a time, there were no pictures or postcards. And then there was a strip from a photo booth. In these stacked blocks of portraiture, Annie stared at the camera, unchanged from frame to frame. Her face was pale and her eyes, haunted. She’d written nothing on the back.\\n\\n Annie returned to them in the fall with a belly too swollen for flying in the big tent. Jacques-Paul sulked about the house, sullen and cramped, till even his shadow grew small. Sometimes Annie stood at the back screen door listening to the night howl, her hands pressed against the metal webbing that left indentations in the pads of her fingers. One afternoon, Mary Lou heard raised voices and crying and door slamming. She came out to see Jacques-Paul packing his tights, harnesses, and yo-yo into the trunk.\\n\\n “I am a performer,” he croaked. “You knew that when you met me.”\\n\\n “You’re some performer, all right!” Annie screamed and hurled the rattle she’d gotten at the baby shower given by the Lutheran Ladies’ Auxiliary. The rattle was made of pure silver and had come wrapped in tissue paper from a store in Kearney. It landed with a thud near Jacques-Paul’s feet.\\n\\n He looked down at the toy and his shoulders sagged under some invisible, impossible weight. “You’ll figure it out. You always do,” he said, climbing into the car. The Impala kicked up dust as it squealed out.\\n\\n “He didn’t smell right. Even Mary Lou could tell,” Annie cried, her eyes red-lined.\\n\\n “Cursed,” her mother nearly spat. “Cursed,” she said, softer this time.\\n\\n Mary Lou rescued the rattle. In the kitchen sink, she washed off the dirt and wrapped it again in the crumpled tissue paper. It didn’t look the same, so she put it in her mother’s closet among the handbags and summer blankets.\\n\\n Mary Lou found the pictures of her mother in an old shoe box on the high shelf. In the photos, her mother was young, a girl of seventeen or so, and her face was not so tired. She wore a red dress with big brass buttons down the front. The photographer had caught her midlaugh, and the defiance of her bared teeth and wide lips gave her face a hint of mischief and forthrightness. The girl in this photograph bet the house. Mary Lou could sense the wildness beneath her mother’s skin.\\n\\n Mary Lou marched in and slapped the picture down by her mother’s knitting. She folded her arms and waited for a response. Her mother squinted at the girl in the photo as if she were a distant relation whose name she struggled to remember. Without dropping a stitch, she nodded at the day’s paper. “There’s a pageant tryout in Omaha this weekend. Thought we could go see what all the fuss is about.”\\n\\n Mary Lou had never been to Omaha.\\n\\n This was the reason, then, that she had entered the pageants. Her mother wasn’t having Mary Lou turn out like Annie. The pageants got Mary Lou out of town, plus they were closely chaperoned and the girls were kept constantly busy. Far from any influence that might whisper unwanted thoughts and feelings to her too-weak soul, she was safe from the change. But here on the island, with the warm breeze tickling its fingers over her bare skin, the ever-present threat to survival keeping her body in a state of fight-or-flight, without the chaperones and routines and control — without the ring! — she was at the mercy of her body.\\n\\n Closing her eyes tightly, she tried to head it off by thinking of terrible things. This is what her mother and the nuns had said to do when the curse came on. But she was too tired to fight it tonight. Her teeth grew sharper; her senses heightened; her skin tickled and warmed till she was forced to shuck her clothes. The wind caressed her nakedness, and she gasped at the unwelcome, but not unwanted, joy of it. Under the moon’s besotted gaze, she ran deep into the jungle, her body strong, her every sense heightened. That was the shameful part — how good it felt to command her body in this way. How erotic the thrill of it! Like a caged beast finally allowed to hunt. Her mother called it a curse, and she understood that it was, that she had to control her urges. But somewhere deep down, she loved the sheer heady freedom of it. In this state, she was not afraid of the jungle, but part of it. \\n\\n","sourceLink":"https://allnovel.net/beauty-queens/page-57.html","bookId":2717,"book":{"id":2717,"title":"Beauty Queens","description":"Storyline: When a plane crash strands thirteen teen beauty contestants on a mysterious island, they struggle to survive, to get along with one another, to combat the island\u0027s other diabolical occupants, and to learn their dance numbers in case they are rescued in time for the competition.Written by Libba Bray, the hilarious, sensational, Printz Award-winning author of A Great and Terrible Beauty and Going Bovine. The result is a novel that will make you laugh, make you think, and make you never see beauty the same way again.\\n","cover":"https://allnovel.net/images/beauty-queens.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-queens.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:37:21 AM"}}
