{"id":76615,"no":79,"title":"Page 79","content":"Miss Ohio’s hand went up. “I’ll help!”\\n\\n A chorus of “me, too!” rang out.\\n\\n One of the guys stepped forward. A cool phoenix design had been etched into his close-cropped hair, and he wore a silver hoop earring in his right ear. He shook Nicole’s hand. “Ahmed. I got some basic training in the army. Happy to help.”\\n\\n “Great. You can start by getting everybody out of here,” Nicole said.\\n\\n The girls responded with awwws and pouts, but Nicole was resolute and Ahmed flashed a bright smile and promised everything would be just fine before shutting the thatched door.\\n\\n Mary Lou rushed over to the other girls. “Do you know who these guys are?”\\n\\n “Who?” Adina asked.\\n\\n Mary Lou’s eyes were huge. “We’ve just rescued the cast of Captains Bodacious IV: Badder and More Bodaciouser!”\\n\\n 37Be prepared for any event in a Salvation mohair poncho. Perfect with jeans or evening wear. Your outfit will always be saved with a Salvation poncho!\\n\\n 38MermaidTopia, The Corporation’s bestselling aquatic doll line. Every girl wants to be a Utopian mermaid! Attachable legs, removable voice box, and swoon-worthy prince accessories sold separately.\\n\\n CHAPTER TWENTY-ONE\\n\\n “You through with the razor?” Miss Ohio asked Miss Montana.\\n\\n The girls had lined up at the swimming hole. They’d pulped a coconut, which they were using for shaving cream.\\n\\n “Ordinarily, double-dipping on a razor would skeeve me out completely,” Miss Ohio explained. “But I am not hanging out with a boatload of fine pirates looking like a yeti.”\\n\\n “You in line?” Miss New Mexico asked Adina.\\n\\n “No, I’m not.” Adina stepped back and let her go ahead. “And you should worry more about fixing their ship and being rescued than shaving your pits.”\\n\\n “I can do both. I’m a multitasker.”\\n\\n “This is going to make such a great story: How I nursed a pirate back to health and my love saved him,” Miss Ohio said with a contented sigh. “And then we can have our own reality show about our relationship.”\\n\\n “Good luck with that.”\\n\\n Petra grinned at Adina.\\n\\n “What — you don’t believe in true love?” Petra asked. “The kind that can then be parlayed into awesome merchandising opportunities?”\\n\\n “Isn’t it exciting?” Tiara said, grinning. “TV pirates!”\\n\\n Brittani pouted. “I was still hoping for a vampire rescue.”\\n\\n “I’m just interested in their ship and getting off the island, not some fantasy fed by a gazillion romance novels and stupid rom-coms starring Jessica Everett,” Adina snarked.39\\n\\n “What’s your problem?” Miss Ohio said.\\n\\n “Hey!” Nicole waved to them from down on the beach. “The captain’s finally awake!”\\n\\n Captain Sinjin St. Sinjin had, indeed, awakened. He was a broad-chested guy of twenty with long, black, wavy hair, devilish sideburns, and a wicked smile that had charmed its way through many a port. The knuckles of his left hand had been tattooed with the word sexxy and his right with beast. He wore tight breeches tucked into tall boots and a puffy white pirate’s shirt unbuttoned to his navel. The other pirates sat near him. The girls hovered like satellites.\\n\\n “Hello, mates. Feeling all right, yeah?” he called in an accent straight out of a posh London boarding school by way of the Eastside. “Say, could one of you lovelies get me something to quench my thirst?”\\n\\n Four girls turned to go and Adina said, “You seem able-bodied to me.”\\n\\n Captain Sinjin put a hand to his chest. “We’ve been through a shipwreck, luv. We’re exhausted and need to lie about.”\\n\\n “Oh, I know how you feel,” Tiara said. “When our plane crashed here, and we had to bury the dead and deal with really bad wounds and Miss New Mexico got that tray stuck in her head —”\\n\\n “Hi!” Miss New Mexico waved.\\n\\n “— and the chaperones were all charred in the wreckage and it was really gross and scary and there was nothing to eat and no shelter and we had to build all that stuff and deal with giant snakes and bug bites and we barely survived a giant wave and mudslides and hallucinogenic plants and stuff, we were so, so tired.”\\n\\n Captain Sinjin blinked. “Yes, luv, but we’re pirates. So it’s much worse for us.”\\n\\n “Are you really the pirates from Captains Bodacious IV?” Miss Ohio asked. She lowered the neckline on her dress a tiny bit more.\\n\\n “Absolutely!” Sinjin said. “You familiar with the show, luv?” \\n\\n","sourceLink":"https://allnovel.net/beauty-queens/page-79.html","bookId":2717,"book":{"id":2717,"title":"Beauty Queens","description":"Storyline: When a plane crash strands thirteen teen beauty contestants on a mysterious island, they struggle to survive, to get along with one another, to combat the island\u0027s other diabolical occupants, and to learn their dance numbers in case they are rescued in time for the competition.Written by Libba Bray, the hilarious, sensational, Printz Award-winning author of A Great and Terrible Beauty and Going Bovine. The result is a novel that will make you laugh, make you think, and make you never see beauty the same way again.\\n","cover":"https://allnovel.net/images/beauty-queens.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-queens.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:37:21 AM"}}
