{"id":76630,"no":94,"title":"Page 94","content":"“Hey-oh. Pirate Casanova here. So, we’ve been shipwrecked, and you will not believe this, but we’ve been rescued by honest-to-God beauty queens. They are unbelievably beautiful. But there is one girl who is a real challenge: Adina.” He laughed and scratched his head. “She hates me, mate. I mean, straight up, hates the Casanova. But I’m going to wear her down. It’s my mission. It’s like my old man says: ‘There’s nothing more exciting than a challenging woman.’ You’re watching Confessions of a Pirate Casanova. Peace out.” The camera jumped ahead to darkness. A kerosene lamp. “Is this okay?” Duff asked. Adina heard her voice saying “Yeah,” and the room swam for her. She smashed the camera to the floor again and again until it was a pulp of metal. Mary Lou appeared at the door. “Deen? What’s wrong?” Adina’s words came out choked. “He … he …” Mary Lou looked from Adina to the broken camera. “Oh my God. Adina …” Sobbing, Adina pushed past Mary Lou, past the girls working on the ship, and far down the beach, searching for some place to run to until she realized there was nowhere to go. “Adina!” Mary Lou shouted, running after her. “Deen. Hey, Deen.” A sharp pain lodged beneath Adina’s ribs, making it hard to breathe. “I let him in,” she sobbed while Mary Lou held her. “He’s an ass**le. He doesn’t deserve you.” “I’m just like my mother. I didn’t learn anything. I’m just going to make the same stupid mistakes she did!” “Shh, it’s okay,” Mary Lou murmured to the top of Adina’s sweaty head. She tightened her hold. “How could I have been so stupid?” “Hey. Look at me.” Mary Lou turned Adina’s face to hers. “You didn’t do anything wrong.” Adina’s crying activated something deep and primal within Mary Lou. She pictured her sister, Annie, standing at the kitchen window, the baby on her hip, the longing stealing over her face like a ghost hand, the muted cries later in the shower. Her mother had told her they were cursed women. But in this moment, it seemed to Mary Lou that the curse was in allowing yourself to be shamed. To let the world shape your desire and love into a cudgel with which to drive you back into a cave of fear. And Mary Lou had had enough. When her friend had cried herself to sleep, Mary Lou covered her with a palm frond and marched toward the camp. Her strides took on purpose as if her feet were marking a path through the cornfields where wild girls ran unconstrained — and where they hid themselves when the world judged them for their agency. Her palms prickled. Her skin warmed. The wild girl was coming alive. The pack protecting its own. Everyone was on the beach, having something to eat. Duff sat among them, laughing at the jokes Ahmed and Chu told. A small growl clawed its way up Mary Lou’s throat. When she came close, the guys reacted to her wolfish sexuality with an awed silence. She tapped Duff on the arm. He tipped his head back to look up at her. “Hello, Mary Lou.” “Could you stand up, please?” Duff gave the boys an I-wonder-what-this-is-about look. “Sure thing.” He stood and faced Mary Lou. “What’s up?” “This.” Mary Lou’s fist connected with Duff’s face in an audible crunch. He tottered like a drunk. And if there had been a clock on the island, it would have ticked off exactly three seconds before he lost consciousness and went down hard in the sand. “Ow!” Mary Lou shook out her hand. Then she took her place at the fire and drank the rest of Duff’s coconut milk, drinking till she was sated. “Your friend’s a real ass**le,” Petra said to Sinjin when they were alone in her hut. “A: Duff’s not my friend. He’s a bloke I’m in a show with. B: He is, in fact, an ass**le. And C: Why do I feel like you’re pissed at me? I didn’t do anything.” Petra took a good look at Sinjin. “Are you blogging about us?” “No, luv, it’s snogging. That’s our word.” Sinjin went for a fake rim shot. “I’m serious.” “I would never,” Sinjin said, and Petra felt that this was true. He opened his arms and she went to him. “Can you believe that Duff guy?” Jennifer said. She and Sosie had applied another coat of pitch to the ship. They stood in the surf trying to wash the sticky stuff from their hands before it set into hard, dark lines. Sosie signed a word and Jennifer smirked. “Totally.” She stepped closer and kissed Sosie’s neck. “I would never do that to you.”","sourceLink":"https://allnovel.net/beauty-queens/page-94.html","bookId":2717,"book":{"id":2717,"title":"Beauty Queens","description":"Storyline: When a plane crash strands thirteen teen beauty contestants on a mysterious island, they struggle to survive, to get along with one another, to combat the island\u0027s other diabolical occupants, and to learn their dance numbers in case they are rescued in time for the competition.Written by Libba Bray, the hilarious, sensational, Printz Award-winning author of A Great and Terrible Beauty and Going Bovine. The result is a novel that will make you laugh, make you think, and make you never see beauty the same way again.","cover":"https://allnovel.net/images/beauty-queens.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-queens.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:37:21 AM"}}
