{"id":76635,"no":99,"title":"Page 99","content":"“Resourceful? You want to talk resourceful? Resourceful is being from a backwater town in Idaho and making it from Miss Teen Dream to Corporation stockholder to presidential candidate without letting your lipstick go cakey once, Agent Jones. Resourceful is trying to figure out what to do when your secret arms deal and your foolproof plan for gettin’ elected go to H-E-double-hockey-sticks.” On the screen, Ladybird Hope spray-painted an assault rifle with a stencil of her name in bubble letters.\\n\\n Agent Jones stood with his hands behind his back. He knew from experience that silence was often the best offensive. In a moment, Ladybird inspected her stencil work and smiled. “I do love me some arts and crafts. Anyway. Me and the Board have talked it over, and it seems to us that we’re missing a valuable opportunity here. Why just drill when we can take over the whole dang country?”\\n\\n “I’m not sure I’m following. And it’s ‘The Board and I.’ Me is objective case.”\\n\\n With tweezers, Ladybird added tiny sequins to the wet paint on the i in Ladybird. “MoMo B. ChaCha is a threat. Cost analysis of the pros and cons of the situation indicates that we need to eradicate the complications arising from the instability of the appearance of the girls on the island and strategize turnkey applications for phasing out less profitable product lines across all platforms.”\\n\\n Agent Jones took a moment to digest this. “You want me to kill The Peacock.”\\n\\n Ladybird continued her ministrations on the gun. “What we need to do is maximize the global content of our security infrastructure by curtailing non-dividend-paying future living possibilities through strategic planning initiatives at the weaponized level while strategizing turnkey profitability of the Republic of ChaCha through the implementation of dynamic platforms that will drive market share, synergize global objectives, and maximize global content.”\\n\\n “So … kill.” Agent Jones made a gun motion with his thumb and forefinger.\\n\\n “In a manner of speaking.” Ladybird sipped coffee through a straw. “What if we could catch MoMo in an act so heinous, so terrible, that the entire world would be on our side? We’d be justified in killing him. The world would thank us for doing its dirty work — and for marching right into his backward country and setting up a democracy. Along with lots and lots of cute shops.”\\n\\n “MoMo’s already racked up a pretty impressive list of atrocities. What could you possibly nail him for that would be so effective?”\\n\\n Ladybird managed a small smile. “Killing a bunch of teen beauty queens on live TV oughta do it, doncha think?”\\n\\n Agent Jones had staged assassinations and coups. He’d taken out KGB agents and lowlife informants and still managed to sleep at night. Sacrifices had to be made for national security. But this wasn’t about security; it was about profitability, the country as corporation. It almost made him nostalgic for the Cold War.\\n\\n He cleared his throat. “How will we manage that?”\\n\\n “It’s time to bring the girls in. I’ll announce the rescue on Barry Rex Live. We’ll have a surprise for the public. Imagine: staging the Miss Teen Dream Pageant right there on the island! It’ll be a ratings bonanza! Then, just before the crowning of the new Miss Teen Dream, MoMo’s guards will leap out with their shiny new guns and kill the girls.”\\n\\n “How are you going to get MoMo to do that?”\\n\\n “Silly. MoMo’s guards won’t actually do it. It’ll be Corporation black shirts dressed up like Republic of ChaCha soldiers. MoMo will die in the resulting bloodbath. The world will see it live on TV, and once it’s on TV, it’s true. I promised The Corporation ratings, and I will deliver. With the world’s outrage on our side, we will march into the ROC to stabilize the country. The whole operation will be contracted out to The Corporation. Oh, and I am seeing huge merchandising opportunities with this. What do you think of T-shirts that say ROC and Roll?”\\n\\n “That is quite possibly the most ludicrous thing I’ve ever heard.”\\n\\n Ladybird Hope cocked her head and smiled. “Well, thank you, Agent Jones. It’s sweet of you to say so.”\\n\\n When Agent Jones was eleven, his dad had called him into the front room and explained that there comes a time in every person’s life when a choice defines him.\\n\\n “Remember that,” he’d said. He was wearing the clown suit and full makeup. Since he’d been laid off eighteen months earlier, it was his only source of income.\\n\\n “Yes, sir,” Agent Jones had said. He was Bobby Jones then.\\n\\n Then his dad laced up the multicolored shoes, put on the red felt nose, squeaked his bike horn, and drove away to make balloon animals at a six-year-old’s birthday party. Afterward, he stopped off at Tom’s Bar for four boilermakers and wrapped his sedan around a tree. The paper used a photo from the party for his obituary. The last image Agent Jones would ever have of his father was of a defeated man in a red nose holding a balloon animal. \\n\\n","sourceLink":"https://allnovel.net/beauty-queens/page-99.html","bookId":2717,"book":{"id":2717,"title":"Beauty Queens","description":"Storyline: When a plane crash strands thirteen teen beauty contestants on a mysterious island, they struggle to survive, to get along with one another, to combat the island\u0027s other diabolical occupants, and to learn their dance numbers in case they are rescued in time for the competition.Written by Libba Bray, the hilarious, sensational, Printz Award-winning author of A Great and Terrible Beauty and Going Bovine. The result is a novel that will make you laugh, make you think, and make you never see beauty the same way again.\\n","cover":"https://allnovel.net/images/beauty-queens.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-queens.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:37:21 AM"}}
