{"id":63598,"no":17,"title":"Page 17","content":"\"Bals, bals, bals! I am sick to death of bals!\" I let out a large breath as Anya helped me undo my dress and corset and freed me from the elegant torture device. \"Much better,\" I said with a deep sigh. I could finally breathe again. I had attended three balls in the past two weeks, not to mention a ball et and an opera. I was exhausted. I had an essay on Pushkin due first thing Monday morning, as well as a chemistry test, and I had not studied for it yet. And the winter social season still had two months to go. \"Anya, I\u0027m going to move to Siberia and live in a hut!\" I was lying on my bed at home, staring up at the ornate gilded plasterwork on the ceiling. No more balls for me. \"I thought you wanted to be a doctor, Duchess,\" Anya said, carefully folding my ball gown away. \"What about medical school?\" \"No medical school in Russia will admit a woman,\" I said. \"But I could go to Paris. Or Switzerland.\" I sat up. \"Anya, let\u0027s run away together.\" She shook her head, her eyes wide. \"Oh, no, Duchess. We\u0027d get whipped by your father, for sure. Maybe you could marry a doctor and help him out in his office?\" \"I don\u0027t think I could ever be happy just being a man\u0027s helper. And I doubt any suitable husband Maman picks out for me would be the progressive sort who would allow me to attend medical school. No, I think I must run away.\" I was only half serious, knowing it would throw Anya into fits. Still, I did worry that my dream might never come true. To enter the University of Zurich\u0027s program, one had to prove proficiency in Latin and Greek. I had doubled my efforts in my Latin studies. Madame Orbel ani had also found a beginner\u0027s Greek textbook for me. It was more difficult than Latin, but I was struggling through it. I was determined to succeed. I\u0027d seen the handsome prince Danilo and his sisters several times over the past weeks, dancing with him often at the balls. He had been a perfect gentleman and did not act like a blood-drinking vampire at all. I mentioned the prince to Princess Cantacuzene when Maman and I were invited to a small dinner party-\"small \" meaning only one hundred or so guests-at the Vladimir Palace. All members of the Dark Court, of course. \"He has not reached the age of his ascension yet,\" the princess Cantacuzene told me. \"When does he turn eighteen?\" \"This June,\" I told her. We strolled together through the great hallway from the grand Russian-styled dining room to the more intimate and more exotic Persian room. \"But what if he doesn\u0027t turn into anything? I do not want to kill anyone, Your Highness.\" \"Are you willing to lay down your own life, then? For he will surely kill you. Or worse, turn you into one of his undead mistresses. You put others at risk as well. Your servants, your family, your children, even.\" \"Children?\" \"If you marry the Montenegrin prince, you will be required to produce heirs for him, Katerina Alexandrovna. Your daughters will become witches, and your sons will become blood drinkers upon their eighteenth birthday. Will you condemn your own children to such a life?\" She stopped walking and grabbed my hand. \"You are not wearing my ring! Mon Dieu, child! You will not be able to resist his charms if you do not wear the ring!\" The old woman was mad. Even though I suspected the Montenegrins of black magic, I found it difficult to believe Prince Danilo could be capable of any evil. Even Dariya had warmed to him a little, and no longer frowned when she saw the two of us dancing together. The old woman grabbed my chin with her cold hands and snorted. \"Bah, I can see it in your eyes,\" she said. \"You are already in his thrall.\" I did not want to believe it. The thought of being under someone else\u0027s control frightened me. I promised her I would wear the obsidian ring from then on. \"Do not eat or drink in the Montenegrins\u0027 presence. They will trick you with one of their herbal potions. They put something in that poor man\u0027s sorbet at the Anichkov Ball.\" I stared at Princess Cantacuzene in shock. Her supposed senility that night had been just a ruse to protect the grand duke! It would not surprise me at all if the Montenegrins had been trying to cast spells on many eligible bachelors that evening. I hoped the tsarevitch was safe. And his brother. I\u0027d not seen Grand Duke George Alexandrovich at any of the recent balls. Of course, we had not attended any that belonged to the Light Court. But Princess Cantacuzene was still talking about Prince Danilo. \"Before his ascension, he is merely a mortal and can die easily. After his ascension, he will not be immortal, but more difficult to destroy. You will have lost your chance.\" If only I had some proof that the ancient princess was telling me the truth. My troubled thoughts kept me awake for hours that night. Think rationally, I told myself. How would I find scientific proof that my handsome prince was going to turn into a blood drinker on his birthday? I thought about my dreams. Dreams are not proof, I reasoned. But Princess Cantacuzene\u0027s words had frightened me. I got out of my bed, poked through my jewelry box, and put on the obsidian ring.","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-17.html","bookId":2654,"book":{"id":2654,"title":"The Gathering Storm (Katerina #1)","description":"Storyline: The Gathering Storm (Katerina #1) St. Petersburg, Russia, 1888. As she attends a whirl of glittering balls, royal debutante Katerina Alexandrovna, Duchess of Oldenburg, tries to hide a dark secret: she can raise the dead. No one knows. Not her family. Not the girls at her finishing school. Not the tsar or anyone in her aristocratic circle. Katerina considers her talent a curse, not a gift. But when she uses her special skill to protect a member of the Imperial Family, she finds herself caught in a web of intrigue. An evil presence is growing within Europe\u0027s royal bloodlines—and those aligned with the darkness threaten to topple the tsar. Suddenly Katerina\u0027s strength as a necromancer attracts attention from unwelcome sources . . . including two young men—George Alexandrovich, the tsar\u0027s standoffish middle son, who needs Katerina\u0027s help to safeguard Russia, even if he\u0027s repelled by her secret, and the dashing Prince Danilo, heir to the throne of Montenegro, to whom Katerina feels inexplicably drawn. The time has come for Katerina to embrace her power, but which side will she choose—and to whom will she give her heart?","cover":"https://allnovel.net/images/the-gathering-storm-katerina-1.jpg","author":"Robin Bridges","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-gathering-storm-katerina-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:50:55 AM"}}
