{"id":63611,"no":30,"title":"Page 30","content":"The nurses at Oldenburg Hospital were much happier to see me when I arrived with my maid in the carriage bearing the Oldenburg family crest.\\n\\n We were ushered into the doctor\u0027s office and each given a cup of hot spiced tea. Dr. Kruglevski came in and listened to Anya\u0027s chest and gave her a small vial of cough syrup.\\n\\n The doctor looked happy to see me as well. \"Duchess! What a pleasure!\\n\\n You are looking much better than when I saw you last. How are you feeling?\"\\n\\n \"Actually, I wondered if you have any medicine that will help me sleep more deeply at night. I have been having horrible nightmares lately, and I\u0027ve not slept well in over a month.\" Not including the two days I was unconscious at the Vladimirichi Palace.\\n\\n \"Hmmm.\" He scanned through his glass cabinet full of brown and green glass bottles. \"Here is one I feel comfortable with you using. But only take one dropperful each night before going to bed. And it would be better if you do not use this every single night, as you will become dependent upon it.\"\\n\\n \"Thank you, Doctor,\" I said, taking the green bottle he handed me, feeling only a little remorseful about deceiving him. If one teaspoon would knock me out, I wondered how much it would take to knock out an undead soldier.\\n\\n As Anya and I were preparing to leave, the head nurse rushed in.\\n\\n \"Doctor, you must come quickly! They have brought in Prince Demidov!\" Princess Aurora\u0027s cousin. I set my things down and followed Dr.\\n\\n Kruglevski into the triage area, where they had laid the prince on a stretcher. There was blood everywhere. Anya began to swoon.\\n\\n \"I need a bottle of saline and some gauze, quickly!\" Dr. Kruglevski barked out orders to his associates.\\n\\n \"What has happened to him?\" I asked. The prince was still breathing, but it was very shallow. His face was snow-white.\\n\\n \"Katerina Alexandrovna, you should go home now,\" Dr. Kruglevski said.\\n\\n \"You should not have to see this.\"\\n\\n \"I want to help,\" I said. \"Tell me what I can do.\" The doctor did not waste any more time arguing with me but handed me a large bundle of gauze and told me to place it over the young man\u0027s neck.\\n\\n \"Hold pressure on the wound,\" he said grimly. \"There is a major artery there that is bleeding out.\"\\n\\n The gauze bloomed a bright red and became saturated. I still put as much pressure on his neck as I could.\\n\\n The doctor cut the patient\u0027s clothing off, revealing a young, muscular chest. I sucked in my breath. I had never seen even my brother\u0027s chest before. The room was getting a bit warm. Fight it, Katiya, I told myself. You are not going to pass out just because there is a half-naked, bleeding man in front of you.\\n\\n The doctor handed me more gauze, and I used it to reinforce what I already had pressed up against the severed blood vessel. The doctor started an intravenous line in the prince\u0027s arm and attached the bag of saline, trying desperately to replace the blood the prince was losing.\\n\\n Suddenly, the prince awoke with a cry and a spasm. His eyes rolled back in his head and he stiffened.\\n\\n \"He\u0027s seizing!\" the nurse cried.\\n\\n But the prince did not seize. He fell limp with a rattle in his chest. There was no more shallow breathing. He had just died. In my arms.\\n\\n I swooned. I tried not to, but I did. One of the nurses behind me held me up. \"It\u0027s all right, dear,\" she said calmly, as if she was used to seeing young men die. She tried to lead me to the bench in the hallway, where Anya was sitting. But I didn\u0027t want to leave.\\n\\n \"I\u0027m fine, thank you,\" I said, angry at myself. I was angry at the doctor for not being able to save the young man. And I was angry at whoever had killed him. \"What kind of wound is that on his neck?\" I asked. \"It almost looks like an animal bite.\" But there was so much blood I really couldn\u0027t tell.\\n\\n \"It does appear to be an animal bite,\" the doctor said, cleaning away the blood with saline. \"Who brought this man to the hospital?\"\\n\\n \"His companions are out in the lobby,\" one of the nurses said, and hurried off to find them.\\n\\n I did not recognize the soldiers who had accompanied Prince Demidov, but I was certain they knew my brother. I hoped he was not in any danger. I could hear the doctor asking them questions, but I could not hear the soldiers\u0027 answers. They were in shock. One of them was pale and shaking.\\n\\n He didn\u0027t look much older than I was.\\n\\n Feeling steadier now, I moved closer so I could hear the conversation.\\n\\n \"We were walking in the woods, behind the palace,\" said the first soldier.\\n\\n \"Something jumped out at us,\" the younger one finished. \"It was enormous.\"\\n\\n The doctor looked skeptical. \"In broad daylight? You must have gotten a very close look at it.\"\\n\\n \"It was dark in the woods,\" the first soldier said. \"I cannot say for sure, but I believe it was a wolf.\"\\n\\n I felt a little nauseated. Had a wolf caused all that damage to the prince\u0027s neck? Wolves were normally too shy to approach humans, especially in broad daylight. I thought about the slender silvery gray wolf we had seen coming home the night of Le ball Noir. The wolf\u0027s fur had gleamed in the light of the full moon.\\n\\n \"I\u0027ll test the body for rabies. This is the first wolf attack I have seen in years. Were either of you bitten as well?\"\\n\\n They both shook their heads. I felt sorry for the soldiers, knowing they could do nothing to save their friend. As they turned to leave, I saw a white cross flash from a bearded soldier\u0027s chest. The Order of St. John of Jerusalem. I rushed back to the room where the dead soldier was. Dr.\\n\\n Kruglevski had ripped the soldier\u0027s clothing off to inspect him, and I found the tattered, bloodstained uniform on the floor. There, on the right breast, was the white Maltese cross. This prince had been one of the tsar\u0027s knights. Like Count Chermenensky. \\n\\n","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-30.html","bookId":2654,"book":{"id":2654,"title":"The Gathering Storm (Katerina #1)","description":"Storyline: The Gathering Storm (Katerina #1) \\n St. Petersburg, Russia, 1888. As she attends a whirl of glittering balls, royal debutante Katerina Alexandrovna, Duchess of Oldenburg, tries to hide a dark secret: she can raise the dead. No one knows. Not her family. Not the girls at her finishing school. Not the tsar or anyone in her aristocratic circle. Katerina considers her talent a curse, not a gift. But when she uses her special skill to protect a member of the Imperial Family, she finds herself caught in a web of intrigue. \\n An evil presence is growing within Europe\u0027s royal bloodlines—and those aligned with the darkness threaten to topple the tsar. Suddenly Katerina\u0027s strength as a necromancer attracts attention from unwelcome sources . . . including two young men—George Alexandrovich, the tsar\u0027s standoffish middle son, who needs Katerina\u0027s help to safeguard Russia, even if he\u0027s repelled by her secret, and the dashing Prince Danilo, heir to the throne of Montenegro, to whom Katerina feels inexplicably drawn. \\n The time has come for Katerina to embrace her power, but which side will she choose—and to whom will she give her heart?\\n","cover":"https://allnovel.net/images/the-gathering-storm-katerina-1.jpg","author":"Robin Bridges","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-gathering-storm-katerina-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:50:55 AM"}}
