{"id":63634,"no":53,"title":"Page 53","content":"Queen Milena and her daughters arrived at Peterhof to prepare for the wedding festivities, and Grand Duchess Miechen held a ball in the Montenegrins\u0027 honor. All the members of the Dark Court would be in attendance. Dariya told me the gossip she\u0027d overheard from her stepmother as we got ready for the ball in my family\u0027s nearby dacha.\n \"Militza has succeeded in dominating the St. Petersburg vampires,\" my cousin whispered. \"She will take Princess Cantacuzene\u0027s place as the head of the House of Bessaraba in Russia. As Cantacuzene\u0027s niece, she has a legitimate blood claim.\"\n \"But her sister Zorka is older,\" I said. \"Wouldn\u0027t she be the rightful heir?\" Dariya shrugged. \"Militza has persuaded her sister to support her. She alone knows the secret hiding place of the undead Dekebristi. She believes she can control them with the Talisman of Isis-the same one that was mentioned in your book-and keep them out of Konstantin\u0027s hands.\" It would make Militza almost untouchable.\n \"Besides,\" Dariya said, \"the tsar now knows that Cantacuzene broke the treaty of 1825. Miechen thinks Militza will try to renegotiate that treaty with him once she has the undead army in her power.\"\n \"I don\u0027t think there is anything that Miechen can do, other than smile graciously and dance the polonaise with the King of Montenegro,\" I said. I hoped I would get a chance to speak with the dark faerie queen at the ball.\n \"What is the grand duchess thinking?\" my cousin said. \"She is too far along in her confinement to be dancing in public!\"\n \"Nonsense,\" I said. \"Princess Yussopova danced all night long at one of her own balls and gave birth to her son the very next day. With no difficulties.\" I looked up at my cousin in the mirror and smiled. \"And with no\n scandals.\"\n Dariya sighed. \"I suppose it would be a worse scandal if the King and Queen of Montenegro were snubbed by the Dark Court of St. Petersburg. I do hope you are careful tonight. If only there was a spell you could invoke to protect yourself from the crown prince. I kept searching that book of yours, but I could not find anything that looks practical.\" She looked at me pointedly. \"Nothing that does not involve raising your own undead army.\"\n \"That is out of the question,\" I said, my hands trembling as I fastened pearl earrings in my earlobes. \"I couldn\u0027t possibly do such a thing.\"\n \"But you do have the curse, do you not?\" Dariya asked soberly. \"Why else would Cantacuzene give you such a book? And the moth at the Smolny Ball. That was something you did, was it not?\" I did not know what to say. How long had she known? \"But I didn\u0027t want you to think I was a monster!\"\n \"How could I? My mother had the curse as well.\"\n I looked at her in surprise. \"How do you know that?\" Dariya\u0027s mother had died giving birth to her. Had she truly been a necromancer, like me?\n \"I found my mother\u0027s journal when I was six. For years, I secretly hoped I would inherit some special talent from her. Even the curse. It would have kept me connected with her in some small way.\" Dariya played with the lace in the window. \"I know how stupid it seems,\" she said sheepishly.\n \"Of course it doesn\u0027t. But I wouldn\u0027t wish this curse on anyone. I\u0027ve wanted to tell you for so long, but I didn\u0027t want you to be afraid of me!\" She rushed forward to embrace me. \"I know you are a good person, Katiya,\" she whispered in my ear. \"I\u0027m not afraid of you.\" I tried to blink away the tears. I prayed I would never let my cousin down.\n \"Girls!\" Maman\u0027s voice rang through the hallway. \"We must leave immediately!\"\n Hastily, I brushed the tears out of the corners of my eyes and sighed. \"I suppose I shal have to dance every dance with the crown prince,\" I said.\n Dariya smiled. \"Do not give up hope yet, Katiya. We will think of something before you have to marry him.\"\n Peterhof was a stunning estate, consisting of several palaces and chapels.\n The Grand Palace was known as the Russian Versail es and had an impressive bank of fountains, called the Grand Cascade, that flowed down toward the sea. Our own family dacha was also close to the water, looking out across the Gulf of Finland.\n It was a beautiful white night, the last in July, and the sun had no intention of setting that evening. All the women wore white court gowns embroidered in silver. Maman wore one of her tiaras and I wore an embroidered kokoshnik. Once I was married, I would be allowed to wear tiaras to balls and court functions. Maman had already showed me a few of her treasured pieces of jewelry she planned to give me as wedding gifts. I was afraid, though, that after my wedding, I would never see another ball again. I was afraid I would never see St. Petersburg again.\n \"Katerina, I am so pleased to see you.\" The crown prince met me at the top of the grand staircase at the Grand Palace and kissed my hand possessively. \"You are looking especially ravishing tonight.\" I could tell he did not plan to let me out of his sight all evening. With a polite bow to Maman and the grand duchess, he pulled me onto the ball room floor, making sure everyone saw us as a happy couple.\n We spun around and around to Strauss and Glinka. \"You look distracted, my love,\" he said. \"As if you long to be elsewhere.\" I said nothing. I glanced around the ball room. The Montenegrin princesses were all dancing gaily. Princess Anastasia was speaking with her mother and Grand Duchess Miechen. The grand duchess did not look happy. She looked pale.\n \"What has happened?\" I asked.\n \"Nothing to concern yourself with, my dear,\" Danilo said. \"But Russia\u0027s worst fears have been confirmed. Konstantin the Deathless has returned.\" I was so shocked I almost tripped over my own feet. I stopped dancing and stared at him. \"How do you know this?\"\n \"He has been at the priory here at Peterhof all along. The vampires have seen him and reported this to Militza.\"\n \"The tsar! He must be warned!\" I tried to pull away from Danilo. His hands gripped me tighter. \"The imperial family is here at Peterhof for the wedding ceremonies. We must send word to them immediately!\" Tsar Alexander and his wife preferred staying at one of the smaller palaces on the estate. It was tucked far away from the Grand Palace.\n The crown prince smiled lazily. \"Do not worry your pretty head about this.\n Montenegro has sworn her all egiance to Russia and the tsar. We have already sent our warrior priests to help the tsar\u0027s men defeat Konstantin Pavlovich.\"\n My stomach knotted. When the tsar found out about Queen Milena\u0027s ritual, he would know of my involvement. My blood had brought back Konstantin the Deathless. I could be killed for treason.\n \"Do not be frightened, Katerina. The tsar will never know your part in betraying him.\" He pushed a lock of my hair back off my shoulder and leaned forward to whisper, \"That is what you were thinking, is it not?\" I looked over again at Queen Milena, who was smiling at me and the crown prince. The grand duchess was no longer standing with her. I looked all around the vast ball room, but Miechen had left her own ball. Maman and Papa were dancing merrily, as were Princess Elena and one of the Georgian princes.\n \"Your Highness, I am terribly sorry,\" I said. \"I have been overcome with a terrible headache. I must beg you to excuse me for a moment.\"\n \"Perhaps you need some fresh air?\" Danilo asked as he turned to lead me to the veranda.\n I could smell the sea air on the night breeze, but I did not want to go outdoors. I wanted to find the grand duchess. I shook my head. \"I need to find a quiet place to sit down.\"\n His eyes flashed darkly as his fingers dug into my arm briefly. It was a painful warning. \"Do not try anything foolish.\"\n \"Of course not, Your Highness.\" \n","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-53.html","bookId":2654,"book":{"id":2654,"title":"The Gathering Storm (Katerina #1)","description":"Storyline: \n The Gathering Storm (Katerina #1) \n St. Petersburg, Russia, 1888. As she attends a whirl of glittering balls, royal debutante Katerina Alexandrovna, Duchess of Oldenburg, tries to hide a dark secret: she can raise the dead. No one knows. Not her family. Not the girls at her finishing school. Not the tsar or anyone in her aristocratic circle. Katerina considers her talent a curse, not a gift. But when she uses her special skill to protect a member of the Imperial Family, she finds herself caught in a web of intrigue. \n An evil presence is growing within Europe\u0027s royal bloodlines—and those aligned with the darkness threaten to topple the tsar. Suddenly Katerina\u0027s strength as a necromancer attracts attention from unwelcome sources . . . including two young men—George Alexandrovich, the tsar\u0027s standoffish middle son, who needs Katerina\u0027s help to safeguard Russia, even if he\u0027s repelled by her secret, and the dashing Prince Danilo, heir to the throne of Montenegro, to whom Katerina feels inexplicably drawn. \n The time has come for Katerina to embrace her power, but which side will she choose—and to whom will she give her heart?\n \n","cover":"https://allnovel.net/images/the-gathering-storm-katerina-1.jpg","author":"Robin Bridges","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-gathering-storm-katerina-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:50:55 AM"}}
