{"id":24666,"no":30,"title":"CHAPTER XXIII AROUND THE CORNER","content":"It was Saturday morning, and a very warm day, when Claudia started out from the house to meet her sister. The station was nearly a mile away through the fields. She had refused the offer of the dog-cart, although after she had been walking a few minutes she rather regretted her decision. The sun at half-past twelve was grilling, and there was hardly any breeze to stir the long grass, rich with big ox-eyed daisies, waving red sorrel, yellow trefoil, and all sorts of field flowers. She kept her sunshade well over her head, but it is really very tiring to walk in the heat on an August day. She wondered why she felt so listless and depressed. Why did she feel that life was simply a barren desert? Probably it was the result of having to listen to the pompous old vicar the previous night, who had engaged in a deep but narrow discussion with Sir John on the degeneration, ingratitude and irreligion of the working-classes. The talk had been brought about by the dissatisfaction in the mills at Langton, some ten miles off, from which Sir John derived a large part of his very handsome income, and as Claudia had listened, she had[343] wondered with a mild amusement what Colin would think of the views expressed around the Currey tablecloth. She ought not to be depressed when Pat—jolly, good natured Pat—was coming down to see her, and she tried to be severe with herself as she swept through the grasses. She must not be gloomy when Pat was coming down to announce her engagement. True, her own experience of married life had not been ideal, but Colin was different, and anyway, one had no right to dash the hopes of the newly-engaged. Some married couples are happy. She must be glad. She was glad. If it were not that inflated windbag, the vicar, it must be the remembrance of her own happy anticipations when she had first become engaged to Gilbert that made her feel blue. The sun to-day did not seem brilliant and wonderful, but only tiresomely hot. The long, luscious grass was not an exquisitely soft carpet, but only rather long for walking. The station was not one mile away, but many miles. At last, however, the little sleepy station was reached, and she sank with a sigh of relief on one of its wooden seats. Pat and Socky did fall out together, and then Socrates, being a friendly and remembering beast, nearly knocked Claudia down in his demonstration of joy at seeing her and being once more on terra firma. “Socky, shut up, you beast.... Look out, Claud, he’ll break your string of pearls.... My dear, you are blooming! If I could burst into poetry—Socky, leave my ankles alone—I should say you were like a red, red rose, or an apple-tree, or something equally unlike a woman.... Socky, come away from that pond. Can’t you see Auntie Claudia has got on a nice, white muslin frock? Darling, I’m awfully glad to see you.” How boyish Pat looked in her grey linen coat and skirt, and neat white silk collar and tie. It seemed almost absurd, the idea of her getting married. One could easier[344] imagine her having a wrestling bout with her lover, as did a certain Cornish heroine of fiction. If she had been espousing some happy-go-lucky, high-spirited youth of her own age it would have seemed more feasible—but Colin Paton! “Mother has become a Roman Catholic,” chattered Pat, “or she is going to become one when there’s a vacancy, or however they do it. Why? Oh! she’s tired of the professional spooky people, and she now finds that the ‘greatest and only true mysticism’—her words, not mine—is to be found in religion. She’s going into retreat, she says. As a matter of fact, I suspect she is going to have a new skin treatment that Rhoda is raving about, and which takes three weeks, during which time you have to lie perdu. She is going to pray for all of us and repent very picturesquely of her sins in purple and grey, not being able to commit quite so many now. She says that her liking for incense foreshadowed this. I told her she couldn’t become Saint Circe and pose in a stained-glass window, however much she tried; but her new r?le is to be very patient, oh! so sweet and patient.” Pat laughed. “She isn’t a bad sort really—she stumped up for all my bills the other day—only why on earth does she want to pose so much? Ah! the ‘Three Compasses!’ That’s the ducky window—dost see? If there were anyone impressionable about I should do the sentimental act from that window. He would call ‘Let down your hair, let down your hair, Patricia,’ in a sepulchral voice, and I should carefully remove about twenty hairpins, two side-combs and a piece of tape, and then lean out with a fatuous smile.” “Well, Colin is coming down to-morrow, you tell me. No doubt he will oblige.” Pat shook her head. “He’s too sensible for those tricks. Besides, he doesn’t admire fair hair. I will not let down my hair to a man who prefers dark hair.” [345] They entered the inn, and were shown up to a quaint-shaped, homely bedroom. “Pat, Lady Currey graciously extended an invitation to you for lunch to-day, but I told her a fib. I said I was engaged to you for lunch here.... Now, tell me the—secret.” “In a minute.... Do you like apples, lots and lots of apples? Would you like to be buried in apples, rosy-cheeked, luscious apples?” Pat grinned at her sister as she threw off her coat and commenced to wash her hands. “I like them tolerably,” smiled Claudia, watching the noisy ducks waddling in the pond. “But why——?” “You’ll like them intolerably soon. Wait till they arrive in barrels! But, as the novels say—I anticipate. Over lunch I will to thee impart the great news. Glory! Hallelujah! there’s an imitation of a bathroom. I shall have to bath in instalments, but I had awful visions of an egg-cup in my bedroom. No, wait till we’ve started lunch.” “I can guess one thing,” said Claudia, with a slight effort. “You are going to leave home. The house of Circe will soon be empty of her children.” “It will. Where’s that wild beast gone to? He mustn’t kill all the ducks. Oh, here he is! You idiot, that’s a turnip. Turnips don’t need catching. You are discredited as a sportsman. Anyone can catch a turnip.... Well, do you remember the talk we had when I said matrimony was not for me and you pretended not to believe me?” “And now——” “Now I’m sure of it. Look at me well, Claudia. I am a woman to be respected. Here at this table behold a farmeress! Salute her with the gravy-spoon!” “A what!” “A farmeress—feminine of farmer. I am the legal owner of a fruit-farm in Canada, and another of England’s unemployed will, at the beginning of next month,[346] emigrate and leave the sinking ship. It’s rude to stare, my dear sister. Isn’t it a brilliant idea? Alone I did it. At least, no. I got the idea and Colin Paton helped me to get the farm and see that it was genuine and above-board. Why, Claud, old girl, what’s the matter?” For suddenly Claudia found herself half laughing, half crying, and nearer hysterics than she had ever been in her life. She had a silly, light-headed sort of feeling that she could not account for. She seemed suddenly freed from a suffocating sensation that had oppressed her lately. She had never before experienced the sensation of wanting to laugh and cry at the same time. Indeed, she had always despised people who got so muddled in their emotions. But though she made an effort to keep on laughing—there was nothing really to cry about—the tears ran down her cheeks. “It’s all right, Pat.... It’s being shut up with the Curreys and the strike, I think.... Oh! Socky!” For the dog, very perturbed, was standing with his feet on her shoulders, showering moist kisses upon her. “Socky, go away ... give me some water ... all over.” Pat surveyed her anxiously, and she saw that although her sister’s physical health seemed perfect, her eyes were those of a woman who lies awake at night thinking. “Claudia, old girl, you want a change. Come to Canada with me next month. Do—it will do you a lot of good.” Her sister shook her head and absent-mindedly wiped her eyes on the serviette. “Go on, tell me more about it.” Then Pat, her eyes shining with excitement, told how an article on the future of women as fruit-farmers in Canada had fired her with a desire to do something real, as she expressed it, to get out of the smug, bandboxy life she was living. She had consulted Colin, who encouraged her, and all through the summer they had been investigating various farms that were for sale, and only a few days ago had they finally settled on one in the Winnipeg[347] district. “Colin was no end of a help to me,” concluded Pat, “because, of course, I should have been done in the eye like Martin Chuzzlewit was. But this is a good farm and belongs to a woman who wants to give it up, but she has consented to stop with me as long as I want her, so I can learn the whole box of tricks. Claudia, I know I shall love it. That’s what I meant by apples just now. I shall send you barrel-loads, simply barrel-loads.” Claudia asked if their father and mother had given their consent, though Patricia was of age and had her own income. “Yes, in a sort of way. They think I’ll come back in a few months, but I shan’t. I told you long ago I was a throw-back. I love the earth and all that pertains to it, and what’s the good of wasting my youth and energies in what the papers call Society? It’s all right for those who like it. I’m not slinging any adjectives at it; but I’m not made that way. I want more scope. But, seriously, will you sail with me next month for a holiday to see me settled?” “I should love it, but you see—I’ve got a husband.” Then, half-smilingly, yet with a touch of sarcasm, she added, “I’ve become useful to him, Pat. He complimented me the other day on my neatness and method in arranging some documents for him.” Pat walked to the little window and said something to herself that was very like “Damn!” “But he’s better, isn’t he?” she said, turning round again. “I shall never forget how scared I was when they got him back to the hotel at Le Touquet. They had to support him on the grass-roller. I was afraid he was dead, he looked so awful. I begged him not to go on playing, but you might as well ask an elephant to tread in a whisper. It was that climb up to the fourteenth that did it. But his heart is all right again now? Does[348] one quite get over a thing like that? It’s all vague to me. What’s the anatomy of a heart? Does something heal up?” “He will have to be more careful than formerly not to over-exert himself or get excited. But Neeburg says there are many people with worse trouble who live to be ninety. But let’s come out into the sunshine and sit under a tree!” She went to the door which opened on the small garden. “Oh! isn’t it a glorious day! Come and tell me more about the apples!” As Claudia went back to Wynnstay that night she wondered what she could tell Gilbert about the mistake she had made. Was it necessary to go up and gratuitously inform him that Colin was not engaged to Pat? She had made a blunder. Ought she to correct a wrong impression? Was it a wrong impression on anyone but herself? Gilbert’s attitude had certainly been one of quiet scepticism. The sun was setting, and the earth was very peaceful and restful after the hot day, as she walked up the long approach to the house. Now she was alone, she ought to be able to think out why Pat’s unexpected secret had moved her so strangely. But somehow, she had no want to probe into her feelings to-night. She only knew she felt happier than she had done for a long time. But then, Pat was a cheering person, she would have enlivened a graveyard. She hummed a little song as she walked, the drowsy birds twittering a half-hearted accompaniment. Pat and Colin came to lunch with them next day, for though Pat had made a hideous grimace at the prospect, she had ultimately agreed that she had better pretend to be a well-behaved person. She had urged Claudia to go with her to the station to meet Colin, but her sister had for some reason undefined, even to herself, pleaded the heat and the distance. Besides, was he not really coming[349] down to see Pat? Not in a lover-like way, but still to see her. Was he? Was he? She took out his last letter from Manchester. Somehow it seemed to read differently from the day she had received it. “When are we going to forgather?” it ran. “Letters are always so inadequate. I have crowds of things to tell you, and why don’t you write more about yourself? Your account of life at Wynnstay was most amusing. I could picture the deadly regularity of its clockwork, but what about the alien in its midst? Has she become a carefully adjusted machine too? I know what it must be to live with the Curreys day after day, and I wish I could help you in some way. I am sending you down a couple of books I think you will like, and a newspaper-cutting in which you will see I am described as an earnest, middle-aged man! Rather a blow, that! I wonder if I do impress people that way? Of course, it was probably written by some reporter at the back of the hall, but—’tis a horrid thought. Earnest! Middle-aged! I’ve still got two thirties to spare....” At lunch—or, as Sir John would insist on everyone calling it, luncheon—she did not sit next to him or have an opportunity for any private conversation. She had to be content with a long look and a smile. The vicar and his wife always dined with them on Sunday, and there were two or three other people, quite uninteresting, but very chatty. Claudia wondered vaguely why uninteresting people generally are chatty. It was not until nearly four that Claudia found herself free to talk to Colin, and she had been sitting so long that she jumped to her feet as the vicaress was lost to sight. “Let’s go for a little stroll before tea. Colin, do you know the view from the windmill? It’s rather jolly. Come and see it. Get up, Pat.” [350] “No, mum, it’s too nerve-racking looking after Socrates. Now he’s chained to the tree I don’t want to disturb him. No, go thou to the view. Peradventure thy servant will slumber a little. Those beastly ducks and a perfectly abominable creature called a guinea-fowl wouldn’t let me sleep this morning, and the hardness of the bed wouldn’t let me sleep last night. These facts, combined with an English Sunday lunch (I beg his pardon—eon) make me what writers call somnolent. Go away and leave me to somnol.” Claudia gave a great sigh of relief as they turned out of the gates of Wynnstay, and he looked at her with quick sympathy. “It isn’t an exhilarating existence at Wynnstay, is it?” he said. “I know how you feel about it. But it won’t be for much longer, I gather?” “No, thank goodness. It is rather dreadful. I either feel perfectly comatose or so irritably alive that I want to scream. Don’t let us talk about it. Let me tell you how glad I am at the success of your book. What a magnificent notice you had in the Times. Don’t you feel on top of yourself?” “I won’t pretend that I’m not glad. But, honestly, it has been rather a surprise. I had a horrible feeling all the time I was writing it that it was vieux jeu, that it had all been said before. It is charming to find people so appreciative,” he concluded modestly. “You’ve waited and done something worth doing,” said Claudia slowly. “That was prophesied of you long ago.” “My waiting was pure laziness,” he said lightly. “The silent man is not always the wise one, though he does look unutterables.” “Well, I’m glad, I’m very, very glad,” said his companion simply. “It gives me quite a thrill when I read the notices. Now tell me about Pat and her farm.” Claudia found that he had gone into the whole matter[351] very thoroughly, as he did everything he took up, and that Pat, through him, had made a very sound and promising bargain. “And you approve of Pat going out there?” she said. “It sounds rather mad. Suppose I took a craze in my head to go out to Canada and farm, would you do all this for me and pack me off with your blessing?” He laughed. “You and Pat are two very different propositions. Besides, you are not a bachelor like Pat.” “No.” There was a slight pause. “Pat doesn’t seem to want to marry. She snaps her fingers at your sex.” “Oh! that will come later on. She’ll marry right enough one day, when the right man comes along. Pat isn’t unfeminine or a crank.” Claudia shot a sideways glance at him as they walked in step together. They were passing a hedge fragrant with honeysuckle and she stopped and picked a piece. “Do you know—oh! do you mind getting that top piece—I once thought you had a—a fancy for her.” He looked down at her, honeysuckle in hand, a curious twinkle in his grey eyes. “I’m very fond of Pat, but not as a wife, thank you. I’m neither old enough nor young enough for her. Middle-age would not mate well with the Amazon.” “What ridiculous nonsense! The reporter was blind. You don’t look middle-aged.... Are you ever going to take a wife, Colin? Thank you. Doesn’t it smell sweet?” They were approaching the top of the hill on which stood the windmill revolving very slowly, and from whence a magnificent view of the country around could be obtained. Perhaps the jerks in their conversation were due to the need of economy in breathing, for the climb was fairly steep. “Do you insist on my marrying?” [352] “No ... of course not.... Isn’t it hot? Why did I choose this walk? But most men get married sooner or later, and—you—don’t dislike women, do you? You’re not unmasculine or a crank! But as a matter of fact,” she added recklessly and breathlessly, “I’d rather you didn’t, I think.” She thought he gave a little exclamation, but she could not be sure. “Why would you rather—I didn’t?” “Married friends are never the same as before they were married. Oh! here we are at the top at last! Isn’t the view worth the climb? No, please, don’t get married. I—I don’t want you to.” What was she saying? She hardly knew, except that it was the truth, the plain, unvarnished truth. She had really hated the idea of his marrying anyone, even Pat. There was something in the air this warm summer afternoon that made her take a reckless joy in saying the things she should have decently hid. “I—I don’t want you to,” she repeated, suddenly raising her eyes to his as they stood side by side, each apparently a little breathless still. She found he was looking at her and the quiet strength of his face was all broken up. The eyes looked at her as they had looked once before. When? When she had been flirting with Frank Hamilton at her mother’s. And suddenly she knew. It was as though something that had always been hiding round the corner for many years unexpectedly came into view. And with the knowledge came a rush of joy, so great, so overpowering, that she reeled. Instinctively she put out her hands and he took them in his. “Colin, I never knew until just this minute. Isn’t it curious.... I’m so glad, so glad.” The hands held hers very tightly, the warm, capable[353] hands that had always held her heart so safely, so securely, if she had only known it. He was looking at her as though he could never look enough. She knew now the love that she had wanted so badly, so desperately, had been at her side all the time, faithful, tender, and, what means so much to a woman, understanding. The scent of the honeysuckle, delicately persistent over the other field flowers, was around them both. The windmill across the field was giving slow, rheumatic creaks. A bird was chirping noisily in the bushy hedge. “Claudia, you can’t mean that you——” “Yes.... I think I have always loved you, only I didn’t realize it. The very strength of my love made it so quiet that I didn’t notice it. When you are a girl you imagine that love will come with a great stir and noise, with a flourish of trumpets, so that all your senses will be deafened, and you will be bound a captive. One doesn’t think of it as a great, noiseless, silent thing.” She gave a queer little laugh that was a half sigh. “One always expects the big drum, a sort of circus, in fact.... Oh, my dear! I’m so glad I know. That’s all I can think of now.” As she looked at him she saw that his love for her had taken its toll. There were little lines round the eyes—lines of repression, of unsatisfied desire that had not been there when she first knew him. He had suffered in that year in the Argentine when, because he was very human, he could not bear the sight of her happiness, when he had fled from her. He had schooled himself to be her friend, to aid her whenever she should call upon him, after that year, but it had not been done easily. Most men would have ridden away, unable to fulfil the demands of friendship, unwilling to bear the continued sting which the sight of her brought them. She saw now that his one aim had always been to make her happy, he himself had always come in a poor second. Gilbert had wanted her[354] to make him happy, and she had chosen—Gilbert! “Oh, Colin!” she cried, “I don’t deserve that you should have gone on caring for me all this time.” “Claudia, I can’t believe it. I’ve hungered for your love so long that, like a starving man, I can’t eat. I tried to be content with your friendship. I tried not to think of you in any other way, even when——” “Yes?” How steady and tender her eyes were. “Even when I knew you were not happy. I’d given up all hope. I had almost made myself believe I was content with your platonic affection.” She laughed a little mischievously. “Shall I take my love back? Ah, no! I couldn’t. It’s been out of my keeping so long. Yes, it’s true, Colin.” She blushed hotly. “I will be honest. I have felt passion for two other men, Gilbert—I thought that was passion born of love—and another. But the best part of me has always mated with you, always loved you. And yet I didn’t discover it until I thought you were going to marry Pat.” The word marry sobered both of them a little, but did not detract from their happiness. “Colin,” she said gently, “why did you let me marry Gilbert? I asked you once before in a different form. I think—I am almost sure, I was ripe for love in those old days when we used to poke round picture-galleries and book-shops together. I was always perfectly happy with you. Didn’t that mean love? Why didn’t you tell me?” “My dear, I wanted to give you plenty of time. Perhaps it was a mistake, but I felt it was your due. You were so young, so beautiful, such a success in Society, that I wanted you to have every chance. I’m nothing in particular, and I didn’t feel it was fair to press my suit until you’d got to know what the world and men were like. You see, you were always a little romantic, idealistic, enthusiastic, and such women as you are difficult[355] to woo fairly. One is afraid to take advantage of you. Because we were good chums didn’t necessarily mean that you could be happy with me as a husband.” “And yet isn’t friendship, comradeship, the best foundation for marriage?” “Some people say yes, some say no. I suppose one can’t generalize. It depends on temperament, age, experience, many things. I adored you, but that was natural. There were any amount of men who adored you. I thought I knew those you were at all likely to marry. Oh! I watched carefully, sometimes agonizedly. And then, as you turned them down one by one, I began to hope.... Your engagement to Gilbert came as a bomb-shell. Gilbert, my old college friend! Why, I was hardly aware you knew him, except that you had been neighbours as children.” “I didn’t.... He just carried me off my feet. I can’t think, even now, how it happened ... a sort of intoxication—youth, music, passion. In those days he was very much the male animal, and you see ... it was the flourish of trumpets ... I was deafened ... I thought it was the real thing, just because I was moved. When will women learn that the men who move them physically are not always the men they really love? No one can say I was brought up ignorantly; there were certain broad-minded, lax ideas I grew up with side by side, but I didn’t know. I thought it was love, because I liked the feeling of his arms around me. The two things are so horribly alike at crucial moments. If only they were differently dressed!” “I know.... I never moved you that way.” “You never tried. If I had once thought of you as a possible lover ... who knows? At least, I have learned what a large part a woman’s imagination plays in the game of love, but the woman is poor indeed who finds nothing for her imagination to feed on after marriage....[356] Why,” she exclaimed in wonderment, “I can’t imagine life without you. As I look back I see that our friendship has been a thread in my life for years, and I really believe the whole fabric would fall to pieces without it. Unconsciously I have always turned to you, always applied your standards to things.” “Claudia!” “Yes.... I think you saved me from a terrible mistake.... You said I wasn’t to speak of it. But I must now, just this once, then it goes into the realm of things utterly forgotten. You remember the night you found me on the stairs.... I expect you guess somewhere near the truth. Don’t look like that. It was as much my fault as his. I was ready to snatch at anything to fill my life. I thought I could—but I couldn’t.” “It wouldn’t have made any difference to me,” he said steadily. “I should have understood the reasons that drove you to it.” She looked at him, and marvelled that what he said was true. “But I’m glad,” she whispered, “that I—couldn’t. It would have made a difference to me. I think we should not have been standing here now. It wouldn’t have lasted, I should have gone on plunging.... Let me tell you something. That night your card was on the mantelpiece in the studio. I picked it up, and from that moment my mood changed. Somehow you seemed in the room with us.... Then I hated the way he had painted me. I knew you wouldn’t like it, and I wouldn’t like you to see it exhibited. I didn’t want to be that woman—because of you. I see it now. I didn’t understand why my mood changed at the time. Now it’s clear to me, and I can only marvel that I have been blind so long.” The mingled tenderness and strength of her face were very beautiful, as she added, “That temptation can never happen again. I shan’t feel so restless any more.” [357] He drew in a deep breath. “Claudia, it’s like an impossibly sweet dream that you should be saying these things to me. I know what you have meant to me for years; but that I can mean anything to you! Is it all quite real? You are sure it doesn’t come from your generous heart, just to comfort me, now you have found out my secret?” “It’s real,” she smiled, standing in front of him, and putting a piece of the honeysuckle in his buttonhole. “It’s the only thing that is real in my life. Fay and I have both been trying to fight, each in our own way—she’s helped me too with her pluck and courage, but now this makes the fight much easier. Now I shall go on almost happily, because I’ve got my wish, the greatest wish in the world.” “And that is——?” “To be first with the man I love. I am first, am I not?” “Don’t you know? Need you ask? If—if I ever had the chance, my one aim would be to make you happy, because—a man is always selfish, you see—that would make me happy.” “And that knowledge does make me happy. You and I belong to one another, just as much as if we were married, wherever we are, whatever we may do.” Then she gave a little laugh of contentment, and threw out her arms to the countryside, so green and smiling all around them. “This afternoon you and I, Colin, are on the top of the hill. We’ve climbed away from the stuffy, humdrum houses in the valleys. To-day we can shout and sing and be glad! Do you know, I seem to hear that Sullivan madrigal ringing in my ears, ‘All creation seems to say, earth was made for man’s delight’—do you remember? I am so happy, so happy. But it won’t always be as easy as it is this afternoon. We’re of the earth, earthy. At least, I am very earthy sometimes.” [358] “My darling,” he cried, passionately, more moved than he had ever been in his life, “you are the most wonderful woman in the world!” “Dearest, shall I tell you a secret in the greatest of confidence? You won’t tell anyone? I’m not. I like to think you think so, but I’m the most ‘ornery’ person, really. I shan’t remain on the hill-top. I shall sigh and groan and grunt inwardly, and—I shall want you just as much as you’ll want me.... I should hate to think you were too placid without me, I should hate to see serene, ethereal content in your eyes.... But if you know I’m feeling just as you are feeling, but, like you, resolutely sitting on those feelings, it makes it easier, doesn’t it? Sexless, unemotional people never helped anyone. And because we look things in the face we won’t be afraid to meet as friends; we won’t run away from our happiness and—our pain; we won’t fret because of a mistake that we can’t alter, will we? We’ll just make the best of what we have, shall we?” “Everything shall always be exactly as you wish,” he said, raising her hands to his lips. For a moment she wished that he would take her in his arms and kiss her, just once. Then she knew that he was right. Things in the future would be hard enough without that memory. For this was no sudden rush of passion that she felt, so that she longed to have his arms close round her. This man, standing on the hill-top with her, was her mate, her man, and naturally all that she had or was was his, by Nature’s unalterable laws. If she could have then and there gone away with him, there would have been no hesitation, no fear, no breathlessness, only a joyous and calm acceptance of the beauty that such mating would hold for them. After a while he said, “I shall go back to Manchester to-morrow, but at any time you send me the word ‘Come,’ I shall be with you by the next train. If you feel you[359] want to talk to me, if you are in any difficulty, you won’t hesitate to send for me?” “No.” When they arrived back at Wynnstay they found only stewed tea, an empty cake-dish, Patricia and an unrepentant cheerful Socrates under the trees. “He demolished the plate of cakes at one fell swoop when my back was turned, and Lady Currey has gone into the house in disgust. She finally, I am sure, washed her hands of the Iverson family. A little cold stew?” Her blue eyes, at present so sexless and so keen, noted the exaltation of the hill-top upon their glad faces, and she raised her eyebrows as she peered into the teapot. “Well, she’s tumbled to it at last,” she muttered. “And I can go to Canada with an easy mind. I don’t care what she does or does not do with Colin Paton.” “What on earth are you muttering about, Pat?” laughed Colin. “Is it an incantation to the Family Genie—the teapot?” Pat looked at him with a broad and bland smile. “I was thinking out your epitaph, Colin Paton. But it will keep for a few years yet.”","sourceLink":"http://novel.tingroom.com/duanpian/3077/85006.html","bookId":977,"book":{"id":977,"title":"Circe\u0027s Daughter","description":"简介： Richards looked carefully over the table with the eye of the well-trained manservant. He retouched a bowl of lilac that offended against his slavish idea of symmetry and then put a screen across the dying fire....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3077","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
