{"id":31610,"no":20,"title":"CHAPTER XX A JOB","content":"Skippy left the barge noiselessly that morning and did not return until six o’clock in the evening. Consequently, Big Joe spent a troubled day, waiting and hoping and fearing. When he saw the boy crossing the plank from the Dinky O. Cross, he hurried to the door. “And where have ye been, Skippy?” he called anxiously. “Here and ye been havin’ me crazy wonderin’ if ye’d run away!” Skippy laughed and greeted Mugs who seemed to be growing by the minute. Then he swung energetically into the shanty and sat down to a hot supper that Mrs. Duffy had faithfully sent over. “Guess what, Big Joe?” “Sure and ye’ll not be for quittin’ me ’cause o’ what happened last night?” Big Joe returned trying not to sound anxious. 121 “I should say not. Whad’ye think I am? I ain’t yeller, Big Joe. Besides I like you too much. What I wanta say is, I got a job.” Tully frowned. “It ain’t gonna be hard,” Skippy assured him. “I’m the new office boy at the Central Warehouse an’ I’ll get ten bucks a week. So now you needn’t be scareda cops.” Tully smiled in spite of himself. “My now, ain’t that just fine. Ain’t that just fine, kid. But do ye be knowin’ who’s boss o’ the Central?” “No. Who?” “Marty Skinner, actin’ as Buck Flint’s agent, no less.” “Well, he can see then that my Pop brought me up honest an’ hard workin’,” said Skippy after a moment’s surprise. “Sure, to be sure and he can that, but shiverin’ swordfish, don’t ye be goin’ on expectin’ too much from him, kid. D’ye be thinkin’ he’s wise ye be on the payroll?” “No.” “Well, now, just ye be waitin’ till he is. Just ye be....” 122 Skippy did not have long to wait. He had completed his first week’s work in the Central Warehouse when one day he heard a hushed voice pass around the awesome news that “the boss” was coming. Skinner recognized Skippy as soon as he stepped into the room. There were a few questions asked and Skippy trudged back to the Minnie M. Baxter that night with a heavy heart. Big Joe was all sympathy. “And what was he sayin’ to ye, kid?” “He wanted to know how I come to get a job there,” Skippy answered dolefully. “Wanted to know how I had nerve enough an’ said I was there as a spotter for my father’s gang probably. An’ before he finished he said it was lucky there hadn’t been a robbery there or he’d handed me right over to the police then an’ there. Me—me that ain’t done him a bitta harm an’ that wouldn’t! Gee, Big Joe, ain’t it enough that he helped put Pop where he is? Can’t he see how I am?” “None o’ ’em can see anythin’, kid,” Big Joe answered, bitterly. “That’s the trouble with me and Toby and every man in this Basin. Sure ’tis ’cause the likes o’ Skinner can’t see. They don’t even give us a chance, they don’t ’cause we’re river folks. They tell us so much that we’re crooked that we wind up that way whither we want to or not, so we do. They make us be crooked. And now they be startin’ in on you, kid. ’Tis a dirty shame, so ’tis.” 123 “I’ll get some other place,” Skippy was defiant. “They’re not gonna make me crooked when I don’t wanna be.” “Skippy, kid,” thought Tully from the depths of his river front wisdom, “I ain’t so sure, I ain’t so sure.” But what he said was: “Sure and that they’ll not, Skippy me boy, that they’ll not.”","sourceLink":"http://novel.tingroom.com/jingdian/1707/50278.html","bookId":1149,"book":{"id":1149,"title":"Among the River Pirates","description":"简介： The shabby old motor boat moved slowly up the river towing an equally shabby old barge. Dilapidated and unpainted as the hull was, the engine was well muffledsuspiciously well muffledand the disreputable looking craft moved through the water with all...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1707","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
