{"id":31598,"no":8,"title":"CHAPTER VIII ALONE","content":"Skippy’s hopes were somewhat rekindled during Toby’s recital of his visit to the yacht. The story sounded so straightforward as he told it, that it did not seem possible that these representatives of the law could find a single flaw in it. And yet to his utter dismay they found more than a flaw in it; they found it sufficiently damning to threaten his unhappy father with certain conviction. \\n\\n \\n\\n They had already seen Inspector Jones and had had his word for it that Toby Dare had threatened to “fix Josiah Flint,” and there was also the corroboration of the inspector’s men. There was also the strongly incriminating statement of the second mate of the Apollyon and the charge that Toby refused to stop when called to from the yacht by Skinner. \\n\\n \\n\\n “My Pop never carried a gun!” Skippy cried in protest. “You can’t say that he did!” \\n\\n 57 \\n\\n \\n\\n “There’s a robbery charge too,” said one of the officers sternly. “You went to Flint’s yacht because you were sore and Inspector Jones heard you crack that it would be bad for Flint if he didn’t kick in for the loss of the barge. It adds up swell for a jury.” \\n\\n \\n\\n “Yeah,” said another, “and when Flint give you the razz like you’re trying to tell us, you burn up, shoot him, then you choke him and frisk him to get that three hundred with plenty interest back. Your fingerprints on his throat are the only fingerprints we found. What did you do with the gun—throw it in the river?” \\n\\n \\n\\n Toby denied it all with a groan, and Skippy sidled up to his father and held on to his arm with a gesture of protection. The officers frowned for there is neither time nor place for sentiment in the progress of the law. They had come to arrest Toby Dare for the murder and robbery of Josiah Flint and all Skippy’s pleading would not thwart them. \\n\\n \\n\\n The faint boom of thunder sounded as Toby was led into the police launch and a flash of lightning streaked the black sky just above the Minnie M. Baxter. But Skippy was indifferent to everything save the hopeless, staring look that his father gave him as their eyes met. \\n\\n \\n\\n He fought back the tears bravely and smiled his bravest. \\n\\n 58 \\n\\n \\n\\n “Now, Pop, stop thinking about me again, huh!” he cried desperately. “Gee whiz, I’ll be swell—I promise I will so will you cheer up an’ everythin’, huh? Because you gotta prove you’re tellin’ the truth an’ never had a gun so how could you do what they say you did? So will you cheer up if I tell you I’ll be all right, no matter what?” \\n\\n \\n\\n Toby Dare’s troubled face lighted with a smile. \\n\\n \\n\\n “Skippy, boy,” he gulped, “I kin do anythin’ when I hear yer talk like that. Jest hearin’ yer say yer’ll be a good boy’s enough fer me.” \\n\\n \\n\\n “All right, then, Pop,” Skippy said, forcing a laugh. “So we won’t even say so long ’cause they’ll let you come back in a day or so, I bet.” \\n\\n \\n\\n “Sure,” Toby assured him. “They’re bound ter let me.” \\n\\n \\n\\n And that was all, for the launch chugged off leaving Skippy strangely numb and bewildered. He watched the snakelike movements of the trim craft as she darted through the inlet but soon the darkness enfolded her from view. After a few moments they switched on their running lights but there was too much distance between them for the boy to see his father and so he turned his back to the inlet and slowly walked toward the little cabin. \\n\\n 59 \\n\\n \\n\\n Not a light had appeared the length or breadth of the whole barge colony since the police launch slipped up to the Minnie M. Baxter yet Skippy knew that every man and woman in Brown’s Basin was awake and watching all that had transpired. His father had told him that these strange, lawless people had a surprising faculty for learning of the law’s arrival in the inlet. And hating the law as they did, they kept silently out of its sight, nor did they want to be drawn into it through another’s troubles. \\n\\n \\n\\n Notwithstanding this knowledge, Skippy had the feeling that he had only to call out and ask for help for himself and his father, and his lawless neighbors would immediately respond. Yet that is just what Toby had warned him against. Moreover, his promise to avoid dubious company was not ten minutes old. \\n\\n \\n\\n And so he resolved to bear his troubles manfully and alone, though never in his life had he so wanted the warmth and sympathy of human companionship. He was young enough to be afraid, yet old enough to feel ashamed of it. But the events of the day and his father’s unhappy plight finally proved too much for him and with trembling under lip he sought the shelter of the cabin. \\n\\n 60 \\n\\n \\n\\n A few minutes later a terrific storm broke over the river and swept through the Basin relentlessly. Rain lashed against the tiny windows of the cabin on the Minnie M. Baxter and the wind moaned eerily in and out of the inlet. \\n\\n \\n\\n Skippy buried his tousled head under a pillow in his bunk and tried to stifle the sobs that would not stop. His heart raced madly in his breast every time he thought of his father and his fears increased with every crash of thunder. Could it possibly be that his father wouldn’t come back? \\n\\n \\n\\n He squirmed farther under the bedclothes. He would have shut out his thoughts if that had been possible. Presently he heard a muffled knocking at the cabin door. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1707/50266.html","bookId":1149,"book":{"id":1149,"title":"Among the River Pirates","description":"简介： The shabby old motor boat moved slowly up the river towing an equally shabby old barge. Dilapidated and unpainted as the hull was, the engine was well muffledsuspiciously well muffledand the disreputable looking craft moved through the water with all...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1707","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
