{"id":64492,"no":16,"title":"Page 16","content":"Chapter 8 “A melia, do not cry any more. I beg you.” Amelia pulled the damask counterpane farther over her head. “Go away, Miss Pool. Please!” The bed sagged next to her and a hand came to rest on her shoulder. “Amelia, it breaks my heart to see you so distressed.” “How else should I feel?” She sniffled, her eyes burning and gritty, her heart broken. “Did you see what she went through? How she fought to come to me? I do not believe my father. Not any longer.” “Lord Welton has no reason to tel you untruths,” Miss Pool soothed, her hand stroking down her spine. “Lady Winter does have a somewhat… fearsome reputation, and you saw her garments and the men at her service. To me it appears that your father is correct.” Tossing back the blanket, Amelia sat up and glared at her teacher. “I saw her face. That was not the look of a woman who gleeful y accepts coin to stay away from me. She did not look like a conscienceless monster who wishes to train me into the life of a courtesan or similar such nonsense as my father has accused.” Miss Pool frowned, her pale blue eyes fil ed with confusion and concern beneath her blond brows. “I would not have stopped you from speaking with her if I had known she was your sister. I saw only a young boy running toward you. I thought it was a lovelorn swain.” She sighed. “Perhaps if you had exchanged words, you would not hold these il usions about her strength of character. Also, I’m not certain lying to Lord Welton was wise.” “Thank you for saying nothing to my father.” Amelia caught up her teacher’s hand and squeezed. The coachman and footmen had also kept their silence. Having been with her from the beginning, they had a tendré for her, and while they stopped short of all owing her to leave, they did their best to make her as happy as possible. Except for the groomsman Colin, the object of her affection, who spent all of his time either avoiding her or glaring at her. “You begged me,” Miss Pool said with a sigh, “and I was not strong enough to refuse.” “No harm was done by keeping the knowledge from him. I am here in Lincolnshire with you.” Deep in her heart, Amelia suspected strongly that if her father learned of Maria’s actions, everything in her life would change. She doubted it would be for the better. “I read the papers, Amelia. Lady Winter’s mode of living is not one that would be conducive to your instruction in ladylike pursuits. Even if everything else your father said was…embel ished—which I doubt after seeing what I saw—you must agree that the chances of her being a suitable influence are very small .” “Do not insult Maria, Miss Pool,” Amelia said briskly. “Neither of us knows her well enough to cast aspersions upon her character.” Amelia’s voice broke as she recal ed the sight of the large ruffian who had crushed Maria to the ground and then pierced her with a knife. Tears hung on her lower lashes and then fel to water the flowers that decorated her muslin gown. “Dear God, I hope she is Well.” All this time she had thought her father was protecting her from Maria. Now she was at a loss. The only thing she knew for certain was that her sister’s voice had carried a note of desperation and longing that would be impossible to feign. Miss Pool pulled her closer and offered a shoulder to cry on, which Amelia grateful y accepted. She knew Miss Pool would not be with her for long. Her father changed her governesses every time he moved her, which was no less than twice a year. Nothing in her life was permanent. Not this new house with its charming garden pathways. Not this lovely room with its floral décor in her favorite shade of pink. Then her thoughts paused. Siblings were permanent. For the first time in years, she realized that she was not an orphan. There was someone in this world will ing to die for her. Maria had risked life and limb in an attempt to speak with her. What a drastic difference that was from her father, whom she heard from only through third parties. Suddenly, she felt as if something she had been waiting for had final y come to fruition, though she did not understand why. She would have to explore it, come to terms with it, then decide how she would act upon it. After years of days that blended one into another with nothing new to offer, a mystery had been revealed, one that offered the hope to end her loneliness. The tears that fel next were tinged with relief. Maria stared up at the canopy above her bed and attempted to find the fortitude within her to bear the pain of moving. She needed to see to Simon. She knew he was capable of taking care of himself, but she also knew he would be worried about her and she could not all ow him to fret unnecessarily. She was about to slip out of bed when the door from the gal ery opened and St. John returned. Once again, her breath caught at the sight of him. He was beyond uncommon handsome, yes, but it was the absolute confidence with which he carried himself that she found most attractive. Simon also bore the trait, but in Christopher it was packaged differently. Where Simon exploded in Irish passion, Christopher coiled tighter and became more dangerous. “Move and I will turn you over my knee,” Christopher rasped. A smile hovered, but she held it back. The fierce pirate was something of a mother hen. She found it rather charming. It balanced out his otherwise overbearing and curt deportment. She could tel she set him off kilter. It was a simple joy to tease him, knowing that she was able to penetrate beneath his skin. “I must show Simon that I am Well.” A low growl rumbled through the space, then he stalked to the adjoining door. Opening it, he said loudly, “Lady Winter is Well. Do you understand this, Quinn?” Grunts and incensed mumbles accompanied Christopher’s statement. He turned to look at her and asked, quite arrogantly, “Do you feel better now?” “Simon, love?” she call ed out, wincing as the expansion of her lungs caused her shoulder to burn. Violent thumping of chair legs against the floor was her reply. Christopher stood there with one brow arched, waiting. “Must you restrain him so?” The other brow rose to match the first. “I feel as if I should do something to save him,” she murmured, chewing on her lower lip. Slamming the door shut, Christopher shrugged out of his coat and returned to his spot on the bed. She took note of how the stricture of his garments seemed to irritate him. Then she imagined him in only shirtsleeves and breeches on the deck of one of his ships and she shivered. His mouth lifted at the corner, as if he knew her thoughts. “I’ve no wish to be courteous to him. He should have been watching you. He failed in that task.” “He was unaware I was leaving.” “You snuck out?” She nodded. He snorted. “More fool he, then, for not anticipating such an action on your part. He should know you better than I, and yet even I would have expected you to run off.” “I would not have gone had I anticipated danger,” she argued. But then she would have missed that sighting of Amelia. While the outcome was heartrending, it gave her some hope. Amelia was healthy and stil in England. “Those who live as we do should always anticipate danger, Maria,” he said softly, stroking the back of her hand with his thumb. “Never lower your guard.” As she struggled with her response to his gentleness, her gaze shifted to the door, seeking escape. “Lord Welton was here.” Her gaze flew back to meet his. Dark blue and fathomless. The man was an expert at keeping his thoughts to himself. She, however, was almost certain he could read her panic. “Oh?” “He was under the impression that you were injured.” Maria winced inwardly. “But I assured him that two nights past we shared a repast and you were in excel ent health.” “Two nights past,” she parroted. Christopher leaned closer, his free hand lifting to brush across her cheek. He could not seem to stop touching her in some fashion, a foible she found vastly appealing. She had been taking care of herself for so long, it was lovely to feel cared for. “I told you I would help you,” he reminded softly. But there was something she sensed churning beneath the surface masculine perfection. More than mere unease with new territory. Until she knew what it was, she could not trust him with simple truths, let alone with something so vital as the reclamation of Amelia. So she nodded to signify her promise to consider his request, then closed her eyes. “I am truly weary.” The left side of her body throbbed from her head to her hip. She sensed him lean closer, felt his breath brush across her lips. He was going to kiss her again, one of those light but utterly delicious meldings that made her blood thrum. Because she relished those kisses, she opened to him. He laughed softly, a throaty sound she adored. “Can I trade a kiss for a secret?” he asked. She opened one eye. “You put too much stock in your kisses.” His grin stole her breath. “Perhaps you put too much stock in your secrets.” “Oh, go away,” she said with a wide smile. Instead he kissed her senseless. “Amelia?” Christopher settled farther into the window bench, resting his forearm atop his bent knee as he looked out at his rear garden below. It was after nightfal , but his home and its surrounding exterior were brightly lit and well guarded. Hedges were trimmed to prevent the creation of any hiding places. Like his life, the necessities were there, but there was no room for comforts or extravagances. “Yes, that’s what she was saying.” “And it was the girl who replied, not the governess. You are certain?” He shot a sidelong glance at the four men who were lined up a few feet away. They all nodded their agreement. “Why did no one go after the coach?” he asked. All four men shuffled uncomfortably. Sam cleared his throat and said, “You told us to watch the lady. When she was injured…” He shrugged lamely.","sourceLink":"https://allnovel.net/passion-for-the-game-georgian-2/page-16.html","bookId":2659,"book":{"id":2659,"title":"Passion for the Game (Georgian #2)","description":"Storyline: Passion for the Game (Georgian #2) Match Point Infamous for satisfying his limitless wants and desires, Christopher is a free man again. And this time he’s on a mission to engage, deceive and seduce the one woman as ruthless as he is when it comes to games of passion… Far from innocent in the ways of men, Maria is one step ahead of Christopher’s every move. It doesn’t mean she isn’t enjoying every delicious look, every unbridled kiss, every moment of abandon. But she never saw her own feelings coming into play. She never imagined the moment would come when she would meet her match—and that she would surrender to him again and again…","cover":"https://allnovel.net/images/passion-for-the-game-georgian-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/passion-for-the-game-georgian-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:54:10 AM"}}
