{"id":64508,"no":32,"title":"Page 32","content":"\\n\\n “Um…Yes. Wrong word. ‘Decline’ might be better?” Philip risked a glance at Christopher’s face and winced. “In any case, if Lady Winter and Lord Eddington were the cause, and I were to learn that they spent very little time together, I would conclude that perhaps they are not engaged in any lascivious activities.”\\n\\n “A reasonable conclusion.”\\n\\n “Yes, well …” Philip cleared his throat. “Therefore, since the events would make little sense to me, I would go to Lady Winter and ask her to clarify.”\\n\\n “She has never once told me a secret of hers,” Christopher said. “That is our primary point of contention.”\\n\\n “Wel …she did write to you. She came to you. I would consider that a positive sign.”\\n\\n Christopher snorted. “If only that were true. She came to say good-bye.”\\n\\n “But you do not have to say it in reply, do you?” Philip asked.\\n\\n “No. However, it would be best if I did. For both of us.”\\n\\n Philip shrugged. You know better than I. That was his protégé’s message. But it was tempered by an unspoken admonishment. His lieutenant did not believe he had exhausted all of his options, and Christopher supposed he was correct about that.\\n\\n “Thank you, Philip,” he dismissed. “I appreciate your concern and candor.”\\n\\n Philip made his egress with obvious relief.\\n\\n Christopher rose and stretched, his body aching from muscles strained by Maria’s passion. By God, the woman had ridden him to the best orgasm of his life, but the climax had been bittersweet. He had felt her withdrawal even as she opened herself as she never had before.\\n\\n “Maria,” he breathed, moving to the window where he could look out at the street below. She had come here to this cesspool in search of him.\\n\\n Christopher’s forehead pressed against the glass, the heat of his skin misting the pane, the unanswered queries in his mind tormenting him.\\n\\n There was no real need for the answers. Their relationship, such as it was, had nowhere to go. It was best that it end so miserably. Their estrangement should make it easier to do what he must—wrap her up in a pretty bow and deliver her to Sedgewick.\\n\\n Why pursue the connection?\\n\\n A knock sounded behind him, then, “Lord Sedgewick has come to call .”\\n\\n The irony almost made him laugh.\\n\\n It took him a moment to col ect himself, to lift his head from the glass and return to his desk. He nodded his readiness and waited for the viscount to enter.\\n\\n “My lord,” he greeted dryly, refusing to rise.\\n\\n Sedgewick’s lips whitened at the insult and then he sank into the seat Philip had recently vacated, crossing one ankle over to the opposite knee as if this were a social call .\\n\\n “Do you have any information for me or not?” the viscount snapped. “You and Lady Winter were both gone a fortnight. Surely you learned something during that time.”\\n\\n “You assume we were together.”\\n\\n Sedgewick’s gaze narrowed. “You were not?”\\n\\n “No.” Christopher smiled as the other man’s face reddened. “Why such haste?” he asked, taking a pinch of snuff from the box on his desk with deliberate leisure. “It has been years since the deaths. What are a few weeks more?”\\n\\n “My schedule is none of your concern.”\\n\\n Studying the peer with a trained eye, Christopher hummed softly. “You want something, a higher position within the agency, perhaps? And the length of time you have to acquire it grows short, yes?”\\n\\n “What grows short is my patience. It is not one of my virtues.”\\n\\n “Do you have any virtues?”\\n\\n “More so than you.” Sedgewick rose. “A sennight, no more. Then back to Newgate you go, and I will find another to take up the task you seem not to be capable of.”\\n\\n Christopher knew he could end this now. He could promise to deliver a witness who would implicate Maria. But the words would not come. “Good day, my lord,” he said instead, his nonchalance infuriating the foppish viscount, who then left the room in his profusion of lace and jewels.\\n\\n A week. Christopher rolled his tense shoulders back and knew the time had come to make a decision. Shortly, the men he had assigned to investigate the girl named Amelia would return with their reports. Beth hopeful y would have gleaned something interesting from her association with Welton. And the young man he had stationed in Maria’s house could be call ed back to share what he had learned.\\n\\n Christopher had pockets of information to tap. It was not like him to delay the reception of news. But then he had not been acting like himself since the night he first had sex with Maria.\\n\\n What hold did she have on him?\\n\\n He was stil asking himself that question when he handed the reins of his mount to her groomsman in front of her house. He took the short steps to her door with the heavy stride of a man walking to the gal ows, and he was not at all surprised to be told that she was not at home.\\n\\n Telling himself to go, to leave, Christopher stil found himself saying, “I am coming in. The manner in which I do so, however, is entirely up to you.”\\n\\n The grumbling butler stepped aside and Christopher took the stairs, anticipation warring with dread in a heady mix. He hoped for Quinn to appear and give him a fight. Though he was in poor physical condition, he didn’t care. Fisticuffs would leave him no room to think about Maria, which was all he wanted—to be free of his pining for her.\\n\\n He reached the second floor and found a familiar face there, although it was not Quinn’s.\\n\\n “How fare you?” he asked Tim, noting that his lackey was sporting a tidy queue and a Vandyke, the mass of his unruly beard gone.\\n\\n “Well.”\\n\\n Nodding his approval, Christopher said, “See that we are not disturbed.”\\n\\n “Aye.”\\n\\n Moving to Maria’s door, Christopher lifted his hand to knock, then thought better of it. Instead he turned the knob and entered her room without warning, pausing a step inside the threshold when he spied her standing before the window. Like all great sirens, she was en déshabil é, her lushly curved figure visible through the thin cotton chemise she wore. The sight of her tiny form framed by long, flowered and tasseled curtains made his throat nearly too tight to speak. Somehow, though, he was able to say, “Maria.”\\n\\n Her shoulders stiffened, and he watched as she took a deep breath.\\n\\n “Lock both doors,” she returned, without facing him, as if she had been expecting him. “Simon will return eventual y, and I want this resolved before there are any interruptions.”\\n\\n The air in the room was oppressive, fil ed with so many words left unsaid. Stil , as Christopher turned the locks, he felt as if a great weight had been lifted from him, simply because he was in the same space as Maria.\\n\\n He moved toward her but stopped a few feet away.\\n\\n She final y turned to face him, revealing dark circles under her reddened eyes. A heavy mantle of weariness shrouded her slender shoulders. “I had hoped you would stay away.”\\n\\n “I want to.”\\n\\n “Then why are you here?”\\n\\n “Because I want you more.”\\n\\n Maria’s hand lifted to her heart. “We cannot have what we want. People who live as you and I do forfeit affairs of the heart.”\\n\\n “Is your heart engaged?”\\n\\n “You know the answer,” she said simply. There was nothing in her features or the depths of her eyes to give him any clue to her thoughts.\\n\\n Christopher felt a drop of sweat glide down his temple. “That night I came to your room and we lay together…”\\n\\n She turned back to the window. “A beautiful memory to treasure. Good-bye, Mr. St. John.” Her voice was devoid of emotion.\\n\\n He stood unmoving. His mind told him to go, yet he could not make his limbs cooperate. He knew she was right, he knew it was in both of their best interests to walk away and resume the separate lives they had led before meeting. Instead, he found himself walking toward her, coming up behind her, wrapping his arms around her.\\n\\n The moment he touched her, she began to shake. He was reminded of that first evening in the theater, when he had held her similarly. She had been cool and col ected then. The vulnerable woman in his arms now had been brought to existence by his effect on her.\\n\\n “Christopher…” The sadness in her voice was the end of him.\\n\\n “Release me,” he said hoarsely, his nostrils buried in her fragrant hair. “Let me go.”\\n\\n Instead she turned in his arms with a pained cry and kissed him deeply.\\n\\n Enslaving him further.\\n\\n Chapter 16\\n\\n A melia slipped through the forest fil ed with anticipation. It was sil y, perhaps, to be excited about a kiss that she planned rather than accepted in a moment of passion, but she enjoyed the idea anyway. She was also eager due to the missive in her pocket. She had stayed up far too late the night before, trying to find exactly the right words to write to her sister. In the end, she had chosen the short and direct route, tel ing Maria to contact Lord Ware to arrange a meeting.\\n\\n The fence was directly ahead. After making certain that the guard was stil far enough away to miss seeing her, she hurried toward it. She did not see the man hidden on the other side of a large tree. When a steely arm caught her and a large hand covered her mouth, she was terrified, her scream smothered by a warm palm.\\n\\n “Hush,” Colin whispered, his hard body pinning hers to the trunk.\\n\\n Her heart racing in her chest, Amelia beat at him with her fists, furious that he had given her such a fright.\\n\\n “Stop it,” he ordered, pul ing her away from the tree to shake her, his dark eyes boring into hers. “I’m sorry I scared you, but you left me no choice.\\n\\n You won’t see me, won’t talk to me—”\\n\\n She ceased struggling when he pulled her into a tight embrace, the powerful length of his frame completely unfamiliar to her.\\n\\n “I’m removing my hand. Hold your tongue or you’l bring the guards over here.”\\n\\n He released her, backing away from her quickly as if she were malodorous or something else similarly unpleasant. As for her, she immediately missed the scent of horses and hardworking male that clung to Colin. \\n\\n","sourceLink":"https://allnovel.net/passion-for-the-game-georgian-2/page-32.html","bookId":2659,"book":{"id":2659,"title":"Passion for the Game (Georgian #2)","description":"Storyline: Passion for the Game (Georgian #2) \\n Match Point \\n Infamous for satisfying his limitless wants and desires, Christopher is a free man again. And this time he’s on a mission to engage, deceive and seduce the one woman as ruthless as he is when it comes to games of passion… \\n Far from innocent in the ways of men, Maria is one step ahead of Christopher’s every move. It doesn’t mean she isn’t enjoying every delicious look, every unbridled kiss, every moment of abandon. But she never saw her own feelings coming into play. She never imagined the moment would come when she would meet her match—and that she would surrender to him again and again…\\n","cover":"https://allnovel.net/images/passion-for-the-game-georgian-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/passion-for-the-game-georgian-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:54:10 AM"}}
