{"id":64514,"no":38,"title":"Page 38","content":"“Tel me something,” he said, his heavy-lidded eyes studying her intently. “I wish I had something to offer you,” she murmured, unwil ing to share news of Sedgewick until she knew for certain whether Christopher cared for her or not. The earl sighed, as if quite put upon, then he opened his snuff box. He caught her hand, set the pinch atop the fluttering vein in her wrist, and sniffed. “You are distressed over something,” he noted, staring at the betraying pulsing of that thin blue line. “My abigail cannot seem to manage the style I desired.” “Hmm…” He rubbed his thumb back and forth across her wrist. “What are your plans for the evening? Are you stil on holiday?” Maria tugged her hand back. “No. I have an assignation with a certain criminal of renown.” “Lovely.” Eddington smiled with pleasure. Even though she was fairly immune to his lauded charms, she could not fail to note how attractive the man was. And a spy, too. Quite delicious, if one liked a rakish hero. “Do you plan to ask St. John outright how he secured his release?” he asked conversational y. “Or do you plan to glean the information I need to recapture him in some other fashion?” “If I tel you my secrets, what value would I have?” “True.” He stood and lifted the lid to her patch box. Selecting a diamond shape, he prepared it and secured it next to the corner of her eye. “The agency could use a woman of your talents. You should consider it.” “And you should go, so I can complete the task you set for me.” The earl stood behind her, setting his hands on her shoulders. “Do not dismiss my offer out of hand. I am sincere.” Maria met his gaze in the mirror. “I never dismiss anything out of hand, my lord. Most especial y attractive offers made by men who stand to gain a great deal from my downfal .” Eddington grinned. “You don’t trust anyone, do you?” “Sadly”—she looked at herself in the mirror—“I have learned not to.” Tim pinned Sarah’s delightful y robust figure to the master sitting-room wal , his hand cupping her fleshy buttock and urging her against his erect cock. The lewd embrace had been the sole focus of his interest until he had heard Lady Winter’s discussion with Lord Eddington in the next room. His eyes closed and his forehead rested against the wal some inches above Sarah’s, who was so much shorter. It pained him greatly to learn of the betrayal. He had come to like and respect Lady Winter and had hoped her association with St. John would continue indefinitely. They both had a certain gleam in their eyes when referencing the other, and St. John had never looked happier than when he was in her ladyship’s company. “The earl has departed,” Tim rumbled, stepping back. “Lady Winter will be needing you now.” “Will you come to my room later?” she asked breathlessly. “I’l try. Go on now.” He spun her about and urged her toward the nearby door with a pinch of her ass. He waited until the latch had secured behind her, then he left the room. Time was of the essence. If he made haste, he could tel St. John about Lady Winter’s true nature and return before he was missed. Chapter 19 Colin whistled softly as he brushed the satiny-smooth coat of one of the carriage bays. His heart was both lighter and heavier, a strange mixture that he did not know how to manage. It was beyond foolhardy, he knew, to seek Amelia out. She was far too young, and many stations above him. They could never be together. Not in any way. Their few stolen kisses were a danger to both, and he felt the cad for even stealing those. She would be set free one day, exposed to the world at large and men like Lord Ware. She would look back on these days and her fervent girlish infatuation and wonder what she had been thinking to imagine herself in love with a groomsman. He was simply the only dish on the table, so she imagined herself hungry for him. But once she was set before a banquet, his common contribution would be like porridge amongst a multicourse meal. “Colin.” He turned at the sound of his uncle’s voice, watching as the rotund man entered the stable. “Yes, uncle?” Yanking off his hat, Pietro ran a hand through his graying dark hair in a gesture rife with frustration. Aside from the differing widths of their middles, they looked very much alike, their Gypsy heritage unquestionable even though Colin’s was diluted by a non-Gypsy mother. “I know you’ve been seeing the lass in the woods.” Colin tensed. “The guards tel me she’s been meeting the lord from the neighboring property, and now you’ve interfered.” “I haven’t.” Colin resumed his exertions. “She saw him yesterday.” “I told you to stay away from her!” Pietro approached, anger evident in the set of his shoulders. “Take your needs to the vil age wenches and dairymaids.” “I have. I do.” Breathing deep, Colin fought to control his temper. “You know I do.” And it ached when he did; every woman he took beneath him was a temporary relief from his raging desires, but nothing more. His heart had belonged to Amelia since he was a boy. His love for her had grown and changed, matured, even as his body did. She was guileless and innocent, her love for him pure and sweet. He rested his head against the horse’s neck. Amelia was everything to him, had been from the day Viscount Welton had hired his uncle. Pietro had agreed to work for far lower wages than other coachmen. It was the reason he had kept his job all these years rather than being replaced often, as the governesses were. Colin would never forget the way Amelia had run up to him with that bright, open-hearted smile and placed a dirty hand in his. “Play with me,” she’d said. Having come from a large band with many children, he had been afraid of loneliness. But Amelia had been a dozen playmates in one. Blessed with an adventurous spirit, she had been will ing to learn all of the games he knew and then she’d set her mind to besting him at every one. Over the years he’d come to appreciate her with a man’s awareness enhanced by a joyous history of friendship and true companionship. He had grown into love with her, not fall en, his affection rooted deeply in the past. Perhaps Amelia’s was, too, but how could he know for certain? He had experience with other females. Amelia had only him. Her feelings could change as she gained understanding of her choices. His never would. He would love her always. Colin exhaled wearily. Regardless, even if she felt the same, he could never have her. “Ah, boy,” his uncle said, placing a large hand on his shoulder. “If you love her, leave her be. She has the world at her feet. Don’t take that from her.” “I’m trying not to,” he said hoarsely. “I’m trying.” Christopher sat in a wingback in his sitting room and stared into the glass in his hand. He was not quite certain what it was that he was feeling. It was rather the way he had felt when he’d overheard Eddington and Maria in Brighton, only now the tightening in his chest was nearly unbearable. Inhaling and exhaling was a conscious task. “You should return,” he said to Tim, his voice so low and raw, it startled him a moment. He scarcely recognized himself. He was not thinking, acting, or speaking like the man he had been before meeting Maria. “We do not want you to be missed.” He thought wryly about Tim’s position in the Wintry Widow’s household. She was so confident of her inevitable success that she freely all owed a serpent in her midst. “Aye.” Tim turned to go. “If Eddington returns, I want to know the details of the exchange.” “Of course. I won’t disappoint you again.” Christopher nodded, his gaze stil deep in his glass. “Thank you.” He was vaguely aware of his bedroom door closing, but other than that, he was lost in thought. He prided himself on his ability to judge character and read people. He would not be alive today if he lacked that skil . Why then did he find it nearly impossible to convince himself that Maria felt no tenderness for him? The facts were there, clear and indisputable, yet in his heart he stil believed in her. Snorting, he lifted his glass to his lips and drained it. Therein lay his problem. His heart was directing him, and not his brain. Sadly, he loved her. That traitorous woman. His Jezebel, a seductress whose livelihood was dependent upon how many men she could lead to their rewards. A knock came to the door, pul ing him from his maudlin thoughts. “Come in,” he call ed out. Next he knew, he was rising to his feet by sheer habit, his pulse leaping into a passionate, riotous pace at the sight of his lover returning. How much time had passed? A glance at the mantel clock told him nearly two hours. Turning his head, he caught her gaze, saw the glimmer of pure pleasure that said she felt similarly, then it was quickly masked by a seductive smile. She was hooded, the black cowl framing her delicately seductive beauty, with those big, dark eyes and pouty red lips. Christopher took a deep breath, then walked toward her before circling behind her. He set his hands on her cloaked shoulders and breathed her in. Warm, luscious woman. “I missed you,” he murmured, reaching around her to the frogs at her throat. “Will you always greet me dressed only in breeches?” Always, as if there were a possibility of a future between them. “Would you like me to?” He unclasped the cloak, gently lifted the hood from her head, and then all owed the entire weighty mass to puddle on the floor at their feet. “I would prefer you naked,” she said. “As I would you, a preference I will see to directly.” He began the task of undressing her, appreciating how much easier it was to accomplish when sober. His fingers moved nimbly, quickly freeing buttons and tapes. “How was your day after I departed?” he asked. “Lonely. I missed you, too.”","sourceLink":"https://allnovel.net/passion-for-the-game-georgian-2/page-38.html","bookId":2659,"book":{"id":2659,"title":"Passion for the Game (Georgian #2)","description":"Storyline: Passion for the Game (Georgian #2) Match Point Infamous for satisfying his limitless wants and desires, Christopher is a free man again. And this time he’s on a mission to engage, deceive and seduce the one woman as ruthless as he is when it comes to games of passion… Far from innocent in the ways of men, Maria is one step ahead of Christopher’s every move. It doesn’t mean she isn’t enjoying every delicious look, every unbridled kiss, every moment of abandon. But she never saw her own feelings coming into play. She never imagined the moment would come when she would meet her match—and that she would surrender to him again and again…","cover":"https://allnovel.net/images/passion-for-the-game-georgian-2.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/passion-for-the-game-georgian-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:54:10 AM"}}
