{"id":18888,"no":10,"title":"CHAPTER X FREIGHT FOR HIGHBANK","content":"While Johnny had been talking to Margaret there was being enacted a far different scene down on the Bar H. The foreman\u0027s anger at the condition of his three men when they had ridden in the day before was newly aroused by Smitty the following morning, when he arrived and shamefacedly slunk into the bunkhouse. Big Tom stormed about the room, demanding to know why he had to have such sheep in his outfit. He wanted to know what they had done, and they could not tell him; he asked where they had gone, and they replied to the SV. What had they done there? They could not recall. Dahlgren spoke vaguely of \"going after th\u0027 feller,\" but had no idea who he was, or anything about it; but they all remembered that Nelson had been with them, in the same condition as themselves, and that he had terrorized the SV household. Smitty corroborated the last and rejoiced at the agility which had twice saved him. There were some things to which his memory clung. \n \n Little Tom Carney and Wolf Forbes enjoyed their friends\u0027 discomfiture, at the same time sharing in some of Big Tom\u0027s disgust. \n \n Wolf looked at them pityingly. \"You make me sick!\" he sneered. \"Fine bunch of sage hens—all you think about is liquor. How many times have I[108] told you to let th\u0027 stuff alone, as long as you couldn\u0027t drink like humans?\" \n \n \"Parson Forbes has th\u0027 floor,\" growled Carson. \"Bein\u0027 human, he——\" \n \n \"That\u0027ll do!\" snapped Wolf. \"You know how much parson there is to me. Who shot you out of a lynchin\u0027 bee back in Texas?\" he demanded. \n \n \"Who got me into it?\" demanded Carson. \"They was watchin\u0027 that bank, an\u0027 I told you so!\" \n \n \"You said so because you got scared at th\u0027 last minute!\" retorted Wolf. \"If I didn\u0027t have to waste half an hour arguin\u0027 with you—oh, what of it! That ain\u0027t excusin\u0027 you from bein\u0027 a fool day before yesterday, is it?\" \n \n \"Mebby you could \u0027a\u0027 done better?\" ironically queried Dahlgren. \n \n \"If he couldn\u0027t, I\u0027d fire him!\" snapped Big Tom. \n \n \"You wouldn\u0027t have to fire me; I\u0027d quit!\" replied Wolf. \n \n \"Then why don\u0027t you do somethin\u0027, \u0027stead of loafin\u0027 along that northwest line, pertendin\u0027 you has got to watch for rustlers an\u0027 them Double X fellers?\" sneered Fraser. \n \n \"I will!\" shouted Wolf. \"I\u0027m goin\u0027 to watch one man—not everybody on th\u0027 range. There\u0027s only one man in this country that ain\u0027t got a good reason for bein\u0027 here—that\u0027s Nelson—an\u0027 I\u0027m goin\u0027 to watch him till I get what I want. Then mebby you fools will be able to bury him for me. Think so?\" \n \n \"I\u0027m wishin\u0027 you luck,\" said Smitty. \"You\u0027ll need it. You be careful who it is that gets buried.\" \n \n [109] \n \n Wolf looked at him pityingly. \"You pore sheep!\" he said, \"I\u0027m sorry you was so lively in th\u0027 SV house, cussed if I ain\u0027t!\" He turned to Big Tom. \"Do I go?\" \n \n \"You do,\" said the foreman. \"Somethin\u0027 is wrong, an\u0027 we got to fix it. Stay as long as you has to. I\u0027m not worryin\u0027 about you—but I am scared th\u0027 cows will eat these four chumps. They shore is green an\u0027 tender. When you startin\u0027?\" \n \n \"Right soon,\" answered Forbes, going out. \n \n Big Tom stood in the doorway and watched his two-gun man enter the corral. His confidence in the wiry killer was not built upon hearsay. Cold, venomous, and quick, he was more like a rattler than his namesake. Up to now every man who had faced Wolf Forbes had faced death, a death swift and certain. \n \n In due time Wolf rode northward and arrived in Gunsight, where he loafed around exchanging gossip with everyone he knew. George was coaxed to talk, but his stupidity did what a mediocre cleverness might have failed to do. He yielded nothing that Wolf could use, and a few things which did not suit Wolf\u0027s needs. With Jerry, the harness-maker, the conversation was a husk without a kernel, and the second-hand saddles were of no value to Wolf, who was searching down things which were against his own convictions. Two-Spot smoked his cigar and rambled aimlessly in his garrulous monologue. He was hopeless from Wolf\u0027s viewpoint. Dave\u0027s admissions were barren of information of a constructive sort. Fanning did not know anything, and Dailey was as bad. Wolf finally gave up[110] the effort and went back to the Palace, there to await the coming of Nelson. \n \n Johnny entered the saloon some time later, nodded to its occupants, but kept on going toward the rear door. \"Be back after I eat,\" he said. \n \n George looked out to see who was washing. \"This ain\u0027t no time to come in for dinner,\" he growled. \n \n \"There\u0027s never no time like th\u0027 present. Can\u0027t help it,\" retorted Johnny. \"While I\u0027m washin\u0027 you rustle th\u0027 chuck.\" \n \n \"Wolf was here askin\u0027 about you,\" said George. \n \n \"That so? Well, that ain\u0027t no crime.\" \n \n \"Can he shoot better\u0027n you?\" queried the cook. \"He says he\u0027ll shoot against anybody in this country with six-guns, any fashion, for a dollar a shot. Does it sound like money?\" \n \n \"If I could shoot that good I\u0027d be too rich to be restin\u0027 up between cow-punchin\u0027 jobs,\" gurgled Johnny through a double handful of water. \"Reckon he knows what he\u0027s talkin\u0027 about, or he wouldn\u0027t risk bein\u0027 took up.\" \n \n \"Well,\" said the cook, \"I\u0027ve heard somethin\u0027 from them that seen it. If you aim to go ag\u0027in\u0027 him, let me know ahead of time, will you?\" \n \n \"I ain\u0027t aimin\u0027 to,\" replied Johnny. \n \n \"Hey! Wait!\" exclaimed the cook, disappearing. He returned with a clean towel. \"Use this. That ain\u0027t fit for a dog no more.\" \n \n Johnny looked at the old one and smiled. It was quite some distance from the condition which called for a change of towels at the Delmonico. \"Thanks.[111] Th\u0027 dirt won\u0027t come off this one. What about dinner?\" \n \n \"Gosh! I forgot,\" said George, dodging into the kitchen. \n \n Johnny had company while he ate, for the cook entertained him with an account of Wolf\u0027s visit, to all of which Johnny paid polite interest, but he hastened his meal. Then he slowed again, for George was beginning to get at the kernels. \n \n \"Has he lost his saddle?\" asked the cook. \n \n \"Don\u0027t know.\" \n \n \"Must a\u0027 busted it. He asked me if I knowed where there was a good second-hand one, gold or brass trimmed. An\u0027 say, keep yore eyes on yourn; he asks me if you tote it up to yore room nights. I didn\u0027t tell him you keep it in th\u0027 kitchen, but I did say there wasn\u0027t no room in yore room for no saddle. He wants one, I reckon, because he went to Jerry\u0027s when he left here.\" \n \n \"He wouldn\u0027t take my saddle,\" said Johnny. \"He was havin\u0027 fun with you.\" \n \n \"Mebby,\" admitted George. \"He was in a jokin\u0027 humor, \u0027cause he laughed an\u0027 says he reckoned you\u0027d get th\u0027 courtin\u0027 bug, like all th\u0027 rest, an\u0027 go callin\u0027 on that Arnold gal. An\u0027 he says he\u0027ll bet you get throwed as hard as th\u0027 rest of \u0027em. I gave it to him right back an\u0027 says that you an\u0027 me are both alike—we hates wimmin.\" \n \n \"They\u0027ve got to hustle if they rope you or me,\" laughed Johnny. \"What else did he say?\" \n \n \"That\u0027s all, that an\u0027 what I told you before. Where you goin\u0027 now?\" \n \n \"Round to Dave\u0027s for a game of cards, mebby.[112] Wolf an\u0027 Fanning are there,\" answered Johnny, taking his hat from the floor and arising. \n \n \"You ain\u0027t repeatin\u0027 what I said, are you?\" asked George, somewhat anxiously. \"He didn\u0027t mean nothin\u0027 by it.\" \n \n \"No; why should I? We all like to joke. I ain\u0027t got nothin\u0027 against Wolf. See you at supper,\" and Johnny went out the rear door. As he neared the corner of the kitchen Two-Spot turned it and bumped into him. \"Wolf\u0027s askin\u0027 about you all over town,\" he muttered, and then, louder: \"Why\u0027n blazes don\u0027t you look out?\" \n \n \"Some day I\u0027ll chuck you over th\u0027 roof,\" retorted Johnny. \"If you\u0027d keep yore head up you\u0027d see where you was goin\u0027!\" \n \n \"Keep yore own head up! You don\u0027t own this town!\" \n \n Johnny turned as he reached Dave\u0027s door. \"If I did I\u0027d run you out of it,\" and entering, he slammed the door behind him. \n \n There was a laugh from the bar, where Wolf and Fanning were still chatting with Dave. Wolf swung the conversation around to the SV and kept it there as long as he could after Johnny joined them. He worked around to Squint, and to the kidnapping of the Doc, and endeavored to get a careless admission from Johnny; but the latter evaded the traps. He showed no disinclination to talk about Wolf\u0027s pet subjects and even helped the other to keep the conversation on them. He disposed of the committee\u0027s visit to the SV by saying that either the Arnolds knew nothing at all about recent[113] events, or else they had been terrorized by the visitors\u0027 actions and had been unable to think clearly or even to talk. He admitted that the committee was in no condition to handle the situation, and that he was as bad as any member of it. As to what had really occurred out there the details were lost to him because he had been too drunk to know much about anything; and in this he was backed up by what Wolf, himself, knew about the other members of the committee. He remembered that he had got rough and that someone, he thought it had been Smitty, had yelled something about getting somebody, and they had followed him to do it. \n \n \"Give us another round, Dave,\" said Wolf. \"I ain\u0027t losin\u0027 no sleep about th\u0027 Doc—\" he began again. \n \n Johnny interrupted him and led the way to a table. \"Ain\u0027t no use standin\u0027 up all afternoon. We\u0027ll drink \u0027em over here, Dave.\" \n \n Fanning and Wolf followed and the afternoon passed in cards, drinking, and talking. Johnny drank his liquor every round without losing his head, for which he was indebted to the proprietor. When supper time came around Fanning pushed back the table. \n \n \"I just can\u0027t make nothin\u0027 these days,\" he growled. \"I never saw a game break so even; bet nobody\u0027s lost ten dollars.\" \n \n \"I won somewhere \u0027round four,\" laughed Wolf, arising. \n \n \"I\u0027m out five,\" grinned Johnny. \"Jim has played all afternoon to get that dollar. Goin\u0027 home, Wolf, or you aimin\u0027 to make a night of it?\" \n \n [114] \n \n \"Got to go,\" answered Wolf, \"but I got sense enough to get my supper in town,\" he smiled. \"Lead th\u0027 way, Jim.\" \n \n \"Hey!\" called Dave, \"somebody gimme a hand with this keg?\" \n \n Johnny, who was last in the line, turned. \"Be right after you fellers,\" he said, over his shoulder. \"Where do you want it, Dave?\" \n \n \"Up on th\u0027 buck, under th\u0027 bar. Easy, now! Up! Good.\" \n \n \"That was fine baby stuff I was drinkin\u0027 all afternoon,\" chuckled Johnny. \"How\u0027d you keep th\u0027 color?\" \n \n \"Young man,\" smiled Dave, \"yore business is punchin\u0027 cows; mine\u0027s sellin\u0027 liquor. Go on, now, an\u0027 eat. Keep yore wits sharp.\" \n \n While they were at supper there was a commotion outside and four punchers from the Double X stamped in. \"Hello, fellers!\" said Slim Hawkes, throwing his sombrero on a table. \n \n \"It smells good,\" grunted Wilkes, and turned to the other two. \"Boys, this is Nelson: Nelson, shake han\u0027s with Gus Thompson an\u0027 Bill Sage.\" He nodded coldly to Wolf, who returned it with reserve. \n \n \"What brought you hoodlums to town?\" asked Fanning. \"You fellers act scared of Gunsight. Ol\u0027 Dailey got you buffaloed?\" \n \n \"I reckon it\u0027s th\u0027 twenty miles,\" said Slim, dragging a table up to the one then in use. \"Hey, George! Can\u0027t you move faster\u0027n that?\" \n \n \"Go roll in a ditch,\" came the polite reply. \n \n \"Well,\" said Wilkes, \"we was ridin\u0027 near th\u0027 east[115] line when we discovers we was goin\u0027 to be late for supper, an\u0027 th\u0027 ranchhouse bein\u0027 near twenty miles, an\u0027 th\u0027 town only a couple, we votes for a ho-tel feed an\u0027 a session in Dave\u0027s.\" He turned toward the kitchen. \"Hey, George! We saw dust above th\u0027 Sherman trail an\u0027 figgers it\u0027s Buffalo. Is he due tonight? Thought I\u0027d tell you so you could get ready for th\u0027 old codger.\" \n \n George stuck his head in the doorway. \"Any more hard luck comin\u0027 this evenin\u0027?\" he demanded. \"Can\u0027t somebody trail in after him so I can keep on a-workin\u0027?\" \n \n \"You get back in there an\u0027 go to work!\" warned Thompson. \"We\u0027re hungry!\" \n \n Wolf arose, paid his bill, and took up his hat. \"Well, I\u0027m off. So-long, fellers,\" and he strolled out. \n \n \"Which ain\u0027t causin\u0027 me no tears,\" muttered Slim. \"He likes us \u0027bout as well as we like him. Here comes th\u0027 cook. Good for you, George!\" \n \n When the Double X squad had nearly finished, the rumble of a wagon was heard, rapidly getting nearer. Soon it passed the side of the hotel, and ceased. \n \n \"There\u0027s Ol\u0027 Allus-Late!\" grumbled George. \n \n \"I\u0027ll give him a hand,\" said Johnny, arising and going out. \"It\u0027ll save you time.\" \n \n \"Don\u0027t strain yoreself on my account,\" replied George. \n \n \"Hello, Buffalo!\" said Johnny, starting to unhitch. \"I\u0027ll put these boys in th\u0027 shed an\u0027 you go eat. George is ready for you. You can feed \u0027em later. If you\u0027ll trust me, I\u0027ll do it for you; I watched you last time.\" \n \n \"Much obliged, sonny,\" smiled the old man. \"Yo\u0027re[116] right obligin\u0027, but I allus eat last. They\u0027ve done good today, considerin\u0027 th\u0027 load, an\u0027 nothin\u0027s too good for \u0027em.\" \n \n \"Thought you came back light?\" \n \n \"Got near a load of hides—can\u0027t you smell \u0027em?\" \n \n \"I shore can; but I\u0027m so slow witted they didn\u0027t mean anythin\u0027 to me. Green, too?\" he suggested. \n \n \"Yep,\" replied the freighter. \"Picked \u0027em up all along; but I won\u0027t get no more this trip. Th\u0027 Triangle won\u0027t have none—an\u0027 I ain\u0027t goin\u0027 to go out of my way to call at th\u0027 Bar H. Got enough, an\u0027 I\u0027m goin\u0027 right through. I\u0027m allus glad to git home.\" \n \n \"I bet you are,\" replied Johnny. \"Ain\u0027t anythin\u0027 more I can do, is there?\" \n \n \"No, sonny; thankee. I appreciate yore help. I ain\u0027t as young as I used ter be, nor as quick. Thankee; good night.\" \n \n Johnny went to the saloon, where a sudden outburst of voices told him he would find Fanning and the Double X men. As he opened the door a roar of laughter greeted him. \n \n \"Cussed if that ain\u0027t rich!\" shouted Slim, jumping up and down. \"Th\u0027 Doc stole from his peaceful fireside. Oh! Ho! Ho! An\u0027 to \u0027tend to his friends, th\u0027 SV! By th\u0027 Lord! Mebby we\u0027ll do it over again, ourselves, sometime, when we feel extra good!\" \n \n \"I\u0027d give ten dollars to shake han\u0027s with th\u0027 man that done it,\" laughed Sage. \"I bet Big Tom rolled on th\u0027 floor when he heard it—an\u0027 bit th\u0027 furniture!\" \n \n \"But how\u0027d he get Squint\u0027s outfit?\" demanded Wilkes. \n \n [117] \n \n Dave told of Squint\u0027s disappearance and of the deep sorrow darkening the sun, whereupon an eager discussion took place. This lasted until Dailey came in and impatiently pounded on a table with the butt of his gun. \n \n \"Order, Gents; order!\" he shouted. \"My time\u0027s valuable—who are goin\u0027 to be th\u0027 victims?\" \n \n \"Shore we\u0027ll order!\" yelled Slim. \"All up, boys! Dailey\u0027s treatin\u0027,\" and despite his protests, he found that he was. Soon after this a six-handed game got into full swing. \n \n Dave\u0027s vexation grew steadily and passed the anger point without stopping. He was tired, and now his labors were only beginning. Two-Spot was living up to Dave\u0027s opinion of him, for he had not been much in evidence around the saloon since noon, and had not appeared at all since the Double X punchers had come in. Dave went to the front door and called, and then he went to the rear door and yelled, but received no response. Thinking that he saw a shadowy figure skulking in the darkness, he yelled again, and with no honeyed promises as the burden of his message. Glancing around in the darkness as if to penetrate it by an act of will, he shouted a threat and stamped back to the bar, slamming the door so hard that the windows shook. \n \n \"Come on, Dave!\" cried Dailey, cheerful in view of his ownership of the last pot. \"What you so slow about?\" \n \n \"If he\u0027d quit pickin\u0027 on Two-Spot,\" said Thompson, \"an\u0027 tend to business, folks would like it better.\" \n \n \"Anybody that don\u0027t like it can get out!\" retorted[118] Dave. \"He\u0027s never around when there\u0027s work to be did!\" \n \n The evening passed swiftly and midnight was not far off when Dave found it necessary to draw on the contents of the new keg, and he disappeared below the bar for a few minutes. Hardly had his head passed from sight when Two-Spot, closely watching the bar, slipped quietly through the rear door and went silently to Johnny, where he poked his face close to the puncher\u0027s ear and muttered for a moment. Johnny nodded and looked over his hand again, while Two-Spot scurried for the door and safety, being silently threatened by Fanning, who thoroughly enjoyed the situation. Two-Spot looked fearfully around and closed the door behind him. He barely had time to get under the saloon when Wolf Forbes, returning from his short tour around the buildings, turned the corner of the kitchen and peered in at the window. \n \n Johnny folded his hand, pushed out the required number of chips and grunted. \"I\u0027m trailin\u0027—but I shore wish that man would stop. He must have about thirteen aces.\" \n \n \"I\u0027m limpin\u0027, but I\u0027m there,\" remarked Thompson. \"Th\u0027 dust back here is awful.\" \n \n \"There ain\u0027t no call for you to put on airs,\" growled Slim, pushing in what he was shy. \"I got four kings, but you don\u0027t see me quittin\u0027, do you?\" \n \n \"You must a\u0027 picked up what I throwed away,\" said Dailey. \"Havin\u0027 felt yore pulses I\u0027m buildin\u0027 a house right out there in th\u0027 middle, where you all can see it, an\u0027 get covetous.\" \n \n [119] \n \n \"Th\u0027 coyote that wins this pot,\" said Slim, \"will shore have to get Ol\u0027 Buffalo an\u0027 his freight waggin\u0027 to haul——\" \n \n A roar of laughter burst from Johnny and he pushed back from the table, lying back in his chair so his lungs could have plenty of room. Dailey put his hand over the pile of chips he had just shoved in, Slim jumped and stared at the roaring puncher, the others manifesting their astonishment each according to his own manner. There was a resounding whack! from the bar and Dave, holding the top of his head with both hands, moaned as he looked wildly about, and then, glaring at the convulsed puncher, he made several pointed, pertinent, profane, and personal remarks and slowly went down again to finish his task. \n \n Slim scratched his head. \"Well,\" he drawled, \"I allus knowed I was bright an\u0027 witty, but I never knowed that I was that good. I likes a man that pays me a compliment like that.\" \n \n \"Th\u0027 loud an\u0027 screechin\u0027 roarin\u0027 of th\u0027 wild jackass is heard nightly over th\u0027 land,\" observed Sage. \"It has scared me plumb cold—I\u0027m layin\u0027 down as fine a pair of four-spots as I\u0027ve ever held. I ain\u0027t got th\u0027 nerve to give \u0027em the backin\u0027 they deserves. Will somebody lend me their gun?\" \n \n \"I cussed near shot,\" said Wilkes. \n \n \"What\u0027s that?\" demanded Dailey. \"Don\u0027t you do nothin\u0027 like that! He\u0027s a part of my profits. Now, if somebody will stuff a hat in that cave, I\u0027ll proceed from where I left off. I\u0027ve raised her till she sags in th\u0027 middle—who\u0027s got any props?\" \n \n [120] \n \n \"I allus play poker by th\u0027 weather,\" said Thompson. \"When it\u0027s dry an\u0027 hot, I calls, an\u0027 when it\u0027s hot an\u0027 dry, I raises. Bein\u0027 dry an\u0027 hot, I hereby calls. Dave, bring me a box to put it in.\" \n \n \"Don\u0027t you bother Dave,\" chuckled Dailey. \"He\u0027s puttin\u0027 hoss liniment on his bald spot—from ear to ear, an\u0027 eyes to spine. I can tote this home in a couple of trips.\" \n \n Johnny, weak and tearful, drew up to the table. \"I was just a-thinkin\u0027,\" he said. \"Where are we now?\" \n \n \"Was you?\" queried Fanning. \"Then don\u0027t you never do no thinkin\u0027 nights after I\u0027ve gone to bed.\" \n \n Dave emerged again, grinning. \"Beats all,\" he muttered, \"how our sins foller us around. Pore Squint; I reckon his mem\u0027ry\u0027s with us. I won\u0027t rest till I knows what was done with him.\" \n \n In the middle of the next game Johnny broke out again and Dave reached for the mallet. \n \n \"I ain\u0027t what you\u0027d call superstitious,\" said Dailey, \"but I lost that last pot to a man who didn\u0027t even know where he was. Every time I hears a jackass warble I has bad luck. I\u0027m obeyin\u0027 th\u0027 warnin\u0027 an\u0027 gettin\u0027 out of this game while I have th\u0027 holes left in my belt. What\u0027s more, I\u0027m goin\u0027 home; I know when it\u0027s time to let go.\" \n \n \"Pore Dailey,\" moaned Fanning, \"we all got a little of it tonight—an\u0027 I\u0027m sleepin\u0027 with a gun under my piller, you bet!\" \n \n \"It\u0027s time we quit,\" said Slim, arising. \"We got twenty miles to go—an\u0027 while mebby it ain\u0027t so dark as I\u0027ve seen it, it\u0027ll be dark enough to keep us from racin\u0027.[121] But before I go I\u0027d like to find out somethin\u0027: Will somebody please tell me what I said, that second time, that was so funny?\" \n \n \"It wasn\u0027t nothin\u0027 you said, Slim,\" answered Wilkes; \"it was yore face—but I holds that it\u0027s cussed unpolite for anybody to laugh right out loud about a man\u0027s misfortunes.\" \n \n \"Nelson, I begs yore pardon,\" said Slim. \"You has a proper an\u0027 fittin\u0027 sense of humor. Let\u0027s have one more round before we ride home an\u0027 wake up th\u0027 boys to tell \u0027em what happened to Dailey. How\u0027d you come out, Nelson?\" \n \n \"I got plenty—a great plenty, thank you,\" answered Johnny, throttling the laughter which threatened to burst out again. \"I\u0027m heavy with it. Dailey will foller me around tomorrow tryin\u0027 to get me into a seven-up or Californy-jack game in his store, where he\u0027s got lookin\u0027 glasses an\u0027 cold decks. Well—here\u0027s how.\" Putting down the half-emptied glass he turned, nodded, and went out. When he closed the door behind him he became alert as a cat in a strange cellar and slipped around the kitchen, hand on gun. Once inside the hotel he began laughing again, silently this time, and went hurriedly up to his room, where he lit the lamp and began to undress. Removing his boots he stood up, and in such a position that the shadow on the wall would tell any watcher that he was removing his shirt. Blowing out the light, he hurriedly put the garment on again and, carrying the boots in his hand, slipped silently down the stairs and into the kitchen, where he took the lariat from his saddle and went swiftly to the front door,[122] where he listened as he slowly opened it. Satisfied that no one was watching, he slid out sideways, closed the door gently behind him and, going along the side of Dailey\u0027s store, he slung the lariat around his neck, put the boot straps between his teeth and, dropping on all fours, crossed the road and disappeared into the darkness on the farther side. \n \n The noise around at Dave\u0027s took on sudden volume as the Double X punchers went out to their horses. Laughing and joking, they swung down the trail at a lope. Fanning and Dailey said good night to Dave and departed. \n \n Gunsight instantly grew quiet and soon a figure emerged from Dave\u0027s horse shed and was swallowed up in the darkness to the east of the main trail, and soon thereafter the hoofbeats of a horse were heard by one pair of listening ears in town. Two-Spot crept out from under the saloon and stood up, shaking his fist at the sound, which moved southward. Then the hoofbeats grew more rapid as Wolf increased the pace of his horse. \n \n Down the trail, where it narrowed to pass between two clumps of brush, a coatless, hatless figure crouched in the left-hand thicket, the coil of rope in his left hand held low down. At irregular intervals he seemed to be suffering from an attack of ague, for he quivered and shook; and there came from him strange, subterranean rumblings and rusty wheezes which he tried to muffle with an arm. As the hoofbeats coming from town grew rapidly louder and nearer he tensed himself. The pounding rang out loudly, now, the soft jingling of chain and[123] ornaments distinguishable in the greater sound, and soon the vague figure of a mounted man burst out of the darkness and swept past the clumps of brush. The waiting man on foot straightened his body and arm at the same moment, and at the instant the rope grew taut he pulled it sharply and leaned back with all his strength. There was an exclamation and a crash, and the man who had waited ran swiftly forward, hauling the rope in hand over hand. Kneeling at the side of the prostrate figure he slipped the guns from their holsters and threw them into the brush, and then fell back to work with the rope and the victim\u0027s kerchiefs. With the gagged, bound, and blindfolded man on his back he went up the trail toward town. \n \n Gunsight had been quiet for over an hour when a strangely shaped figure staggered across the road west of the hotel and steadily neared the shed. It came slowly around the corner and stopped at the side of the big freight wagon, where part of it went to the ground, while the remainder, appearing in the form of a man, worked at the ropes closing the tarpaulin at the rear of the wagon, and soon had it open. He stepped back for a moment as a reminder of what lay behind it struck his nostrils, and again he was seized with a recurrence of the peculiar malady which had seized him frequently in the last hour. At the muffled sounds which came from him, the figure on the ground writhed as if in sympathy and endeavored to repeat them. The attack passing, he drew a long breath and plunged his head and shoulders into the opening he had made and worked hard for a few minutes; and when he stepped back he had[124] several pieces of rope in his hands, which he had taken from a bundle of skins. Drawing a few deep breaths he moved around the wagon and bent over the figure on the ground, exchanging the pieces of rope for his own lariat, but not without a struggle which made it necessary for him to sit on the figure and exert his strength. Tying good knots in the dark on arms and legs which writhed and twisted was slow work, but it was necessary that it be well done, and when he arose to his feet he was assured as to that. Bending over, he picked up the figure and carried it to the rear of the wagon, where he pushed it headfirst into the opening made for it, despite its contortions and gurgled profanity. Again his head and shoulders disappeared under the tarpaulin, and when he straightened up he knew that his victim was so securely lashed to the wagon box that it would be impossible for him to move around, no matter how much he bridged and wriggled, no matter how much the wagon jolted. It was a job which demanded care, and had received it. Satisfied as to the conditions inside the wagon, he now turned his attention to the outside, which must be proof against telling anything to the observing eyes of the old buffalo hunter. He carefully replaced the tarpaulin as he had found it, even to its folds, and he duplicated the knots he had untied. Pausing a moment to think, he dusted canvas and ropes, cogitated as to his own footprints, which Old Buffalo would not fail to notice, if the light permitted. He got his rope, coiled it, and with this for his tool he effaced the prints and then went to the horse shed. When he reappeared he was leading a horse[125] whose color melted into the darkness like a lump of charcoal in ink. They passed in the dark like the passing of a cloud and it was not until some minutes later that the drumming of hoofs rang out on the trail, bound southward in search of a saddled, but riderless, horse, which should be found in that direction. It would not do for it to be seen by anyone but themselves while it bore the riding gear of Wolf Forbes. \n \n A blot on the ground near the horse shed arose. Two-Spot was in pain and the tears were flowing down his unwashed cheeks, while spasm after spasm racked him. Holding a six-gun limply in his hand, he stumbled and staggered away from the buildings, to some place where he could give free vent to the agonizing mirth which threatened to choke him. Coming to a weed-filled gully he sank into it and lay with his face buried in his arms. Minutes passed before he got control of himself and then he rolled over weakly and stared up at the star-filled sky, inert and sore, for he knew not how long. \n \n \"If it was anybody but Wolf,\" he moaned, \"it would be bad enough, but it\u0027s ten times worse as it is. Wolf Forbes, th\u0027 killer; Wolf, th\u0027 two-gun badman, th\u0027 terror of th\u0027 range; th\u0027 cool, deliberate, stuck-up Wolf, who walks with stiff-laigged dignity, an\u0027 holds his nose up in th\u0027 air! Wolf Forbes—oh, my G—d! Gimmie air! Snoopin\u0027 wiselike all over town, fillin\u0027 his ears; smart an\u0027 chipper, cold an\u0027 wise! Oh, me! Oh, my! Sneakin\u0027 \u0027round from winder to winder, listenin\u0027 at th\u0027 cracks—as if I didn\u0027t see his bow laigs passin\u0027 back and forth. Tryin\u0027 to learn if it was Nelson who stole th\u0027 pill-roller,[126] an\u0027 did for Squint. Hearin\u0027 what them Double X fellers had to say about it, an\u0027 him; standin\u0027 there bilin\u0027 with rage! Oh, when this night\u0027s work gets spread over th\u0027 range there\u0027ll go up a laugh that\u0027ll shake th\u0027 sky! If he\u0027s got th\u0027 nerve to come back an\u0027 face that music he\u0027ll have to use them guns of his\u0027n. An\u0027 he can\u0027t fight \u0027em all, good as he is. Wolf, huh? He started out as a wolf, but he\u0027ll change his spots afore he gets to Highbank, an\u0027 his scent, too! He! He! He! He\u0027ll turn into a polecat—a hydrophoby skunk! Oh! Me! Oh! My! Polecat Forbes, th\u0027 strong man! Oh! Ho! Ho!\" \n \n While he rested, his merriment slowly died and gave way to venom, and he sat up to shake his fist in the direction of the wagon. \n \n \"You earned it, cuss you!\" he snarled. \"Bound up like a bundle of rags, an\u0027 headed for Highbank, you are! Forty mile, it is; forty mile of sun, an\u0027 jolts, an\u0027 stink, an\u0027 flies, an\u0027 achin\u0027 bones, an\u0027 cuttin\u0027 ropes. Forty mile of heat an\u0027 dust an\u0027 thirst; forty mile of rage, of thinkin\u0027 it all over; forty mile of h—l on wheels—that\u0027s what it is—forty mile of h—l on wheels! Fourteen hours, says I, but I hopes it\u0027s twenty. Time enough for thinkin\u0027, you blackguard. \u0027Member th\u0027 time you kicked me off\u0027n Dave\u0027s hitchin\u0027 rail? \u0027Member how funny it was, huh? \u0027Member how I said I\u0027d get square with you, an\u0027 how you kicked me ag\u0027in, an\u0027 made me dance to yore blasted guns? I was a harmless ol\u0027 man; but it was funny, just th\u0027 same. Oh, I\u0027m wishin\u0027 I dast go over there an\u0027 tell you all I\u0027m thinkin\u0027—yore ears would bother you more\u0027n yore nose if I could.[127] If I only knowed you wouldn\u0027t come back; if I only knowed that! It was me that did it. I told Nelson about you, an\u0027 I was hopin\u0027 you\u0027d get blowed apart; but this is better, cuss you! When yo\u0027re dead yore troubles are over—an\u0027 you\u0027ll wish you was dead when this story gets out. An\u0027 if you keeps yore nerve, an\u0027 finds out who done it, you will be! Wolf? Wolf? Huh! I got a better name for you!\" \n \n He arose and went back toward the saloon, and had not quite reached it when he heard the soft steps of a horse on the sand and he dropped to the ground, his gun lightly held and ready. In a moment he made out a man leading a horse and he arose, which turned the approaching figure into a blur of action. He could feel the menace of the other\u0027s gun. \n \n \"It\u0027s me—Two-Spot,\" he whispered hoarsely. \n \n The other relaxed and came nearer. \"You tryin\u0027 to get shot?\" came a low, tense voice. \"What you doin\u0027?\" \n \n \"I had to be dead shore who it was that\u0027s tied up like a bundle of trash in th\u0027 waggin,\" answered Two-Spot. \"You ridin\u0027 south bothered me. I\u0027ll never forget this, never!\" \n \n \"That\u0027s th\u0027 first thing you got to do—till you hear about it from somebody else,\" replied Johnny, feeling at his saddle. \"Here,\" he said, untying a Winchester and holding it out. \"I promised you a rifle—an\u0027 this is somethin\u0027 else you want to forget. I got one of his six-guns tied under my slicker roll—you see that you don\u0027t forget that it belongs to me. I\u0027ll give you th\u0027 cartridges tomorrow—they\u0027re in th\u0027 belt over my[128] shoulder. You rustle under that floor, it\u0027s near daylight.\" \n \n A grin of delight swept over Two-Spot\u0027s face as he grasped the weapon, and he scurried to his nest. But there was one thing more to make his happiness complete—he had to see the start of the wagon. And he did not have to wait long. With the first blush of day Old Buffalo appeared, hitched up his horses and urged them to begin their long pull to Highbank. The wagon squeaked and rumbled and passed from the watcher\u0027s sight; and when the last sound died out in the south, Two-Spot went to his blankets to lie on his back and gloat over the miseries of Wolf as his vivid imagination pictured them. \n \n Down on the Highbank trail, bound and helpless, and exhausted by his frantic efforts to free himself, Wolf Forbes seethed with rage, which later would burn itself out and bring an inert apathy to ease him; and two things seared his memory: The mirth of the man who had trapped him, and the sound of a horse\u0027s hoofs pounding at top speed down the trail. They had gone southward, towards the Bar H, the Triangle, and the faint trail leading to the Double X. With these meager clues he built several edifices of speculation, not one of which could be singled out in preference to the others. His friends were notorious practical jokers, and he had done his share at it. The Double X outfit hated him, and Nelson had cause to wish him out of the way if his suspicions concerning Nelson were well founded. Would his unthinking friends carry a joke so far; would the Double X think of and carry out the[129] play; and if Nelson felt that he was in danger, would he be fool enough to do a thing like that? In his place Wolf would have killed. But he would hunt out the perpetrator, whoever he was, when he came back—and he was going back! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1984/56731.html","bookId":677,"book":{"id":677,"title":"Johnny Nelson","description":"简介： The horse stopped suddenly and her rider came to his senses with a jerk, his hand streaking to a six-gun, while he muttered a profane inquiry at he swiftly scrutinized his surroundings. Had it been any horse but Pepper he would have directed his susp...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1984","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
