{"id":20904,"no":19,"title":"CHAPTER XVIII. AN EVENING AT THE \"GOOSE AND GRIDIRON.\"","content":"Those political debaters who met together weekly at the \"Goose and Gridiron\" were certainly open to the insinuation that they copied the practices of another debating society, which held its sittings farther west. In some respects they did so, and were perhaps even servile in their imitation. They divided themselves into parties, of which each had an ostensible leader. But then there was always some ambitious but hardly trustworthy member who endeavoured to gather round him a third party which might become dominant by trimming between the other two; and he again would find the ground cut from beneath his feet by new aspirants. The members never called each other by their own names, but addressed each always as \"The worthy Goose,\" speaking at such moments with the utmost courtesy. This would still be done, though the speaker were using all his energy to show that that other Goose was in every sense unworthy. They had a perpetual chairman, for whom they affected the most unbounded respect. He was generally called \"The Grand,\" his full title being \"The Most Worthy Grand Goose;\" and members on their legs, when they wished to address the meeting with special eloquence, and were about to speak words which they thought peculiarly fit for public attention, would generally begin by thus invoking him. \"Most Worthy Grand,\" they would say. But this when done by others than well accustomed speakers, was considered as a work either of arrogance or of ignorance. This great officer was much loved among them, and familiarly he was called \"My Grand.\" Though there was an immensity of talk at these meetings, men speaking sometimes by the half hour whose silence the club would have been willing to purchase almost at any price, there were not above four established orators. There were four orators, of each of whom it was said that he copied the manner and tone of some great speaker in that other society. There was our friend Robinson, who in the elegance of his words, and the brilliancy of his ideas, far surpassed any other Goose. His words were irresistible, and his power in that assembly unequalled. But yet, as many said, it was power working only for evil. The liberal party to which he had joined himself did not dare to stand without him; but yet, if the whispers that got abroad were true, they would only too gladly have dispensed with him. He was terrible as a friend; but then he could be more terrible as a foe. Then there was Crowdy,—Crowdy, whose high-flown ideas hardly tallied with the stern realities of his life. Crowdy was the leader of those who had once held firmly by Protection. Crowdy had been staunchly true to his party since he had a party, though it had been said of him that the adventures of Crowdy in search of a party had been very long and very various. There had been no Goose with a bitterer tongue than Crowdy; but now in these days a spirit of quiescence had fallen on him; and though he spoke as often as ever, he did not wield so deadly a tomahawk. Then there was the burly Buggins, than whom no Goose had a more fluent use of his vernacular. He was not polished as Robinson, nor had he ever possessed the exquisite keenness of Crowdy. But in speaking he always hit the nail on the head, and carried his hearers with him by the energy and perspicuity of his argument. But by degrees the world of the Goose and Gridiron had learned that Buggins talked of things which he did not understand, and which he had not studied. His facts would not bear the light. Words fell from his mouth sweeter than honey; but sweet as they were they were of no avail. It was pleasant to hear Buggins talk, but men knew that it was useless. But perhaps the most remarkable Goose in that assembly, as decidedly he was the most popular, was old Pan. He traced his birth to the mighty blood of the great Pancabinets, whose noble name he still proudly bore. Every one liked old Pancabinet, and though he did not now possess, and never had possessed, those grand oratorical powers which distinguished so highly the worthy Geese above mentioned, no Goose ever rose upon his legs more sure of respectful attention. The sway which he bore in that assembly was very wonderful, for he was an old man, and there were there divers Geese of unruly spirit. Lately he had associated himself much with our friend Robinson, for which many blamed him. But old Pancabinet generally knew what he was about, and having recognized the tremendous power of the young merchant from Bishopsgate Street, was full sure that he could get on better with him than he could against him. It was pleasant to see \"My Grand\" as he sat in his big arm-chair, with his beer before him, and his long pipe in his mouth. A benign smile was ever on his face, and yet he showed himself plainly conscious that authority lived in his slightest word, and that he had but to nod to be obeyed. That pipe was constant in his hand, and was the weapon with which he signified his approbation of the speakers. When any great orator would arise and address him as Most Worthy Grand, he would lay his pipe for an instant on the table, and, crossing his hands on his ample waistcoat, would bow serenely to the Goose on his legs. Then, not allowing the spark to be extinguished on his tobacco, he would resume the clay, and spread out over his head and shoulders a long soft cloud of odorous smoke. But when any upstart so addressed him,—any Goose not entitled by character to use the sonorous phrase,—he would still retain his pipe, and simply wink his eye. It was said that this distinction quite equalled the difference between big type and little. Perhaps the qualification which was most valued among The Geese, and most specially valued by The Worthy Grand, was a knowledge of the Forms of the Room, as it was called. These rules or formulas, which had probably been gradually invented for the complication of things which had once been too simple, were so numerous that no Goose could remember them all who was not very constant in his attention, and endowed with an accurate memory. And in this respect they were no doubt useful;—that when young and unskilled Geese tried to monopolize the attention of the Room, they would be constantly checked and snubbed, and at last subdued and silenced, by some reference to a forgotten form. No Goose could hope to get through a lengthy speech without such interruption till he had made the Forms of the Room a long and painful study. On the evening in question,—that same evening on which Robinson had endeavoured to tear out the tongue of Brisket,—the Geese were assembled before eight o\u0027clock. A motion that had been made elsewhere for the repeal of the paper duties was to be discussed. It was known that the minds of many Geese were violently set against a measure which they presumed to be most deleterious to the country; but old Pan, under the rigorous instigation of Robinson, had given in his adhesion, and was prepared to vote for the measure,—and to talk for it also, should there be absolute necessity. Buggins also was on the same side,—for Buggins was by trade a radical. But it was felt by all that the debate would be nothing unless Robinson should be there to \"chaw up\" Crowdy, as had been intimated to our friend by that worthy Goose the young Poppins. But at eight o\u0027clock and at a quarter past eight Robinson was not there. Crowdy, not wishing to lacerate his foe till that foe should be there to feel the wounds, sat silent in his usual seat. Pancabinet, who understood well the beauty of silence, would not begin the fray. Buggins was ever ready to talk, but he was cunning enough to know that a future opportunity might be more valuable than the present one. Then up jumped Poppins. Now Poppins was no orator, but he felt that as the friend of Robinson, he was bound to address the meeting on the present occasion. There were circumstances which should be explained. \"Most worthy Grand,—\" he began, starting suddenly to his legs; whereupon the worthy Grand slightly drew back his head, still holding his pipe between his lips, and winked at the unhappy Poppins. \"As the friend of the absent Robinson—\" he went on; but he was at once interrupted by loud cries of \"order\" from every side of the Room. And, worse than that, the Grand frowned at him. There was no rule more established than that which forbade the name of any Goose to be mentioned. \"I beg the Grand\u0027s pardon,\" continued Poppins; \"I mean the absent worthy Goose. As his friend I rise to say a few words. I know he feels the greatest interest about this measure, which has been brought forward in the House of C—\" But again he was interrupted. \"Order, order, order,\" was shouted at him by vociferous Geese on every side, and the Grand frowned at him twice. When the Grand had frowned at a member three times, that member was silenced for the night. In this matter the assembly at the \"Goose and Gridiron\" had not copied their rule from any other Body. But it is worthy of consideration whether some other Body might not do well to copy theirs. \"I beg the Grand\u0027s pardon again,\" said the unhappy Poppins; \"but I meant in another place.\" Hereupon a worthy Goose got up and suggested that their numbers should be counted. Now there was a rule that no debate could be continued unless a dozen Geese were present; and a debate once closed, was closed for that night. When such a hint was given to the Grand, it became the Grand\u0027s duty to count his Geese, and in order to effect this in accordance with the constitution of the assembly, it was necessary that the servants should withdraw. Strangers also were sometimes present, and at such moments they were politely asked to retire. When the suggestion was made, the suggestor no doubt knew that the requisite number was not there, but it usually happened on such occasions that some hangers-on were at hand to replenish the room. A Goose or two might be eating bread and cheese in the little parlour,—for food could not be introduced into the debating-room; and a few of the younger Geese might often be found amusing themselves with the young lady at the bar. Word would be passed to them that the Grand was about to count, and indeed they would hear the tap of his tobacco-stopper on the table. Then there would be a rush among these hungry and amorous Geese, and so the number would be made up. That they called making a flock. When the suggestion was given on the present occasion the Grand put down his tankard from his hand and proceeded to the performance of his duty. Turning the mouthpiece of his long pipe-clay out from him, he pointed it slowly to one after another, counting them as he so pointed. First he counted up old Pancabinet, and a slight twinkle might be seen in the eyes of the two old men as he did so. Then, turning his pipe round the room, he pointed at them all, and it was found that there were fifteen present. \"There is a flock, and the discreet and worthy Goose is in possession of the room,\" he said, bowing to Poppins. And Poppins again began his speech. It was but a blundering affair, as was too often the case with the speeches made there; and then when Poppins sat down, the great Crowdy rose slowly to his legs. We will not attempt to give the speech of this eloquent Goose at length, for the great Crowdy often made long speeches. It may suffice to say that having a good cause he made the best of it, and that he pitched into our poor Robinson most unmercifully, always declaring as he did so that as his friend the enterprising and worthy Goose was absent, his own mouth was effectually closed. It may be noted here that whenever a Goose was in commerce the epithet \"enterprising\" was always used when he was mentioned; and if he held or ever had held a service of trust, as Poppins did, he was called the \"discreet\" Goose. And then, just as Crowdy finished his speech, the swinging door of the room was opened, and Robinson himself started up to his accustomed place. It was easy to see that both the inner man had been disturbed and the outer. His hair and clothes had been ruffled in the embrace with Brisket, and his heart had been ruffled in its encounter with Maryanne. He had come straight from Bishopsgate Street to the \"Goose and Gridiron;\" and now when he walked up to his seat, all the Geese remained silent waiting for him to declare himself. \"Most worthy Grand,\" he began; and immediately the long pipe was laid upon the table and the hands of the Grand were crossed upon his bosom. \"A circumstance has occurred to-night, which unfits me for these debates.\" \"No, no, no,\" was shouted on one side; and \"hear, hear, hear,\" on the other; during which the Grand again bowed and then resumed his pipe. \"If the chamber will allow me to wander away from paper for a moment, and to open the sores of a bleeding heart—\" \"Question, question,\" was then called by a jealous voice. \"The enterprising and worthy Goose is perfectly in order,\" said the burly Buggins. \"Many a good heart will bleed before long if this debate is to be choked and smothered by the cackle of the incapable.\" \"I submit that the question before the chamber is the repeal of the paper duties,\" said the jealous voice, \"and not the bleeding heart of the enterprising and worthy Goose.\" \"The question before the cabinet is,\" said My Grand, \"that the chamber considers that two millions a-year will be lost for ever by the repeal of the paper duties; but if the enterprising and worthy Goose have any personal remarks to make bearing on that subject, he will be in order.\" \"It is a matter of privilege,\" suggested Poppins. \"A personal explanation is always allowed,\" said Robinson, indignantly; \"nor did I think that any member of this chamber would have had the baseness to stop my voice when—\" \"Order—order—order!\" \"I may have been wrong to say baseness in this chamber, however base the worthy Goose may be; and, therefore, with permission of our worthy Grand, I will substitute \u0027hardihood.\u0027\" Whereupon the worthy Grand again bowed. But still there were cries of question from the side of the room opposite to that on which Robinson sat. Then old Pancabinet rose from his seat, and all voices were hushed. \"If I may be allowed to make a suggestion,\" said he, \"I would say that the enterprising and worthy Goose should be heard on a matter personal to himself. It may very probably be that the privileges of this chamber are concerned; and I think I may say that any worthy Goose speaking on matters affecting privilege in this chamber is always heard with that attention which the interest of the subject demands.\" After that there was no further interruption, and Robinson was allowed to open his bleeding heart. \"Most worthy Grand,\" he again began, and again the pipe was laid down, for Robinson was much honoured. \"I come here hot from a scene of domestic woe, which has robbed me of all political discretion, and made the paper duty to me an inscrutable mystery. The worthy Geese here assembled see before them a man who has been terribly injured; one in whose mangled breast Fate has fixed her sharpest dagger, and poisoned the blade before she fixed it.\" \"No—no—no.\" \"Hear—hear—hear.\" \"Yes, my Grand; she poisoned the blade before she fixed it. On Tuesday next I had hoped—\" and here his voice became inexpressibly soft and tender, \"on Tuesday next I had hoped to become one bone and one flesh with a fair girl whom I have loved for months;—fair indeed to the outer eye, as flesh and form can make her; but ah! how hideously foul within. And I had hoped on this day se\u0027nnight to have received the congratulations of this chamber. I need not say that it would have been the proudest moment of my life. But, my Grand, that has all passed away. Her conduct has been the conduct of a Harpy. She is a Regan. She is false, heartless, and cruel; and this night I have renounced her.\" Hereupon a small Goose, very venomous, but vehemently attached to the privileges of his chamber, gave notice of a motion that that false woman should be brought before the Most Worthy Grand, and heard at the bar of the \"Goose and Gridiron.\" But another worthy Goose showed that the enterprising and worthy Goose had by his own showing renounced the lady himself, and that, therefore, there could have been no breach of the privilege of the chamber. The notice of motion was then withdrawn. \"O woman!\" continued Robinson, \"how terrible is thy witchcraft, and how powerful are thy charms! Thou spakest, and Adam fell. Thou sangest, and Samson\u0027s strength was gone. The head of the last of the prophets was the reward of thy meretricious feet. \u0027Twas thy damnable eloquence that murdered the noble Duncan. \u0027Twas thy lascivious beauty that urged the slaughter of the noble Dane. As were Adam and Samson, so am I. As were Macbeth and the foul king in the play, so is my rival Brisket. Most worthy Grand, this chamber must hold me excused if I decline to-night to enter upon the subject of the paper duties.\" Then Robinson left the chamber, and the discussion was immediately adjourned to that day se\u0027nnight.","sourceLink":"http://novel.tingroom.com/duanpian/2752/75859.html","bookId":1350,"book":{"id":1350,"title":"The Struggles of Brown, Jones, and Robinson","description":"简介： It will be observed by the literary and commercial world that, in this transaction, the name of the really responsible party does not show on the title-page. IGeorge Robinsonam that party. When our Mr. Jones objected to the publication of these memoi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2752","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
