{"id":88567,"no":2,"title":"Page 2","content":"Rush\n Mismatched eyes that have haunted the shit out of me for too many years to count-too many years to not call myself a gigantic pussy-stare up at me. They\u0027re liquid and fearful, and they make me want to grab her and kiss her so hard she starts crying and runs away. Yeah, I want to make her run away this time. But I can\u0027t. I won\u0027t. I have an audience, and they\u0027ve come to see a show.\n I let my eyes do the work, move down her body, take in that crazy, garden party-looking shit she\u0027s wearing. I have no idea what she\u0027s been up to since high school, never wanted to know, because I might\u0027ve gone after her. And there was no way in hell I was jumping on board that train again.\n She fucking murdered my heart. It still beats, but not nearly as strong.\n \"What\u0027s your name again?\" I ask, then watch impassively as hurt flickers in her eyes.\n \"Addison,\" she says.\n Shit, her voice is like a fucking vise to my cock. My eyes narrow on her. \"You pregnant, Addison?\"\n She looks around, at everyone who\u0027s waiting, listening, then comes back to me, shakes her head. \"No.\"\n The lights in the center are killer bright, and they make her brown hair shimmer. I notice that it\u0027s gotten longer and lighter. Damn if I don\u0027t remember what it feels like all tangled up in my fingers.\n \"Any other reason why I shouldn\u0027t touch you today?\" I ask.\n She swallows, and I watch the movement in her throat so closely like it\u0027s the best goddamn movie I\u0027ve ever seen.\n \"No,\" she says.\n \"Then let\u0027s get started.\"\n I start to back up, but she reaches out and grabs my wrist. \"Wait.\"\n My skin burns where she\u0027s holding it. But even so, I don\u0027t pull away. My eyes lift and I utter, \"What\u0027s up?\"\n \"We didn\u0027t talk about what I wanted.\"\n \"No. We didn\u0027t.\" I swear to fucking god it\u0027s like the two of us are the only ones in the joint now. I know there\u0027s a crowd. I know Jane\u0027s watching me from her perch on the chair, probably wondering what the hell\u0027s my problem. But shit, I don\u0027t hear anything but Addison\u0027s voice, and I\u0027m not seeing anything but her eyes, one blue, one green. The green one is almost the exact same color as mine. It\u0027d been our thing. That eye of hers would only look at me. It belonged to me.\n She belonged to me.\n \"Maybe something really small?\" she says, her thin fingers still wrapped around my wrist. \"A butterfly or a heart.\"\n My mouth curves into a grin. \"You didn\u0027t know?\"\n \"Know what?\" she asks.\n \"The skin doesn\u0027t get to choose the ink. Not here. I decide what I want on you.\"\n Panic glitters in her eyes, and I can\u0027t help but get off on it.\n \"You really asking me to draw a heart on you, Addison?\" I say.\n Her teeth scrape against her top lip, and after a moment she releases me. She shakes her head. \"Do what you want, Rush.\"\n It\u0027s the first time she\u0027s used my name, and every goddamn memory of her whispering it, calling it out, moaning it in my ear, comes at me like a fucking firing squad.\n I lift an eyebrow at her. \"Wherever I want?\"\n She nods.\n My body is stoked up and I know I\u0027d better cool down if I\u0027m going to be holding a needle to her skin.\n I lean in and whisper, \"You trust me, Addison?\"\n She shivers instantly. \"Trust has nothing to do with this. Nothing to do with why I\u0027m here.\"\n \"Yeah, I know,\" I tell her. Because I do. The reason was in every email I never opened, every letter I sent back unread, every phone call I ignored. \"You want something from me I\u0027ll never give you.\"\n Her eyes hold me captive. They always did.\n \"You have to,\" she says, her voice reed-thin.\n I shake my head. Around us the crowd is getting restless. I don\u0027t give a shit about them, and I know I should.\n \"You have to, Rush,\" she says again, more impassioned this time. \"I can\u0027t...\" She stops, looks away.\n I hate that I care. I fucking hate it. And yet I ask, \"You can\u0027t what?\"\n It was her turn to shake her head. \"Nothing. I\u0027m ready. For you, for whatever you choose.\" She lifts her chin. \"For my first ink.\"\n The crowd explodes into hoots and catcalls. They\u0027ve waited long enough. Maybe I have, too. Getting her skin under me again. Not for pleasure, but for pain.\n I back up and motion to my chair. \"Fine. Take off your shirt and lie down.\" \n","sourceLink":"https://allnovel.net/first-ink-wicked-ink-chronicles-1/page-2.html","bookId":1915,"book":{"id":1915,"title":"First Ink (Wicked Ink Chronicles #1)","description":"Storyline: \n First Ink (Wicked Ink Chronicles #1) \n Rush \n Women in his bed, celebs and rockers in his chair and a killer bank account at his disposal, life is pretty freaking swell. Then she walks back into it again. With her mismatched eyes, perfect pink mouth and a laugh that still haunts him, she gave him nothing but marvelous misery. Now she wants his hands on her again. Not for pleasure, but for pain. For Ink. A bleeding heart to match the one she left him with five years ago. \n Addison \n She can’t forget him. No matter how hard she’s tried. The pain she caused him in the past eats at her daily, and she can’t move on with her life. But she has a plan, a hope for redemption – a way for him to take his revenge out on her flesh. But it’ll only work if he lets her inside his exclusive world, under his famous artist’s needle and into his bed—and heart-once again.\n \n","cover":"https://allnovel.net/images/first-ink-wicked-ink-chronicles-1.jpg","author":"Laura Wright","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/first-ink-wicked-ink-chronicles-1.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:29:42 PM"}}
