{"id":88568,"no":3,"title":"Page 3","content":"Addison I stare at him, watch him as he goes over to Ms. Pin-Up and whispers something in her ear. I have no idea what he\u0027s saying, but when he\u0027s done she glances up and gives me a strange look. Kind of like I just stepped out of a toilet, and she doesn\u0027t know whether to be disgusted by me or pity me. I wonder if she\u0027s his girlfriend. This beautiful, vibrant, tatted-up sex kitten. A girlfriend. It\u0027s a thought I hadn\u0027t entertained in years, if ever. But it\u0027s a thought that makes me unbearably sad. Heading over to his station, Rush thrusts his hands inside a pair of thin, black latex gloves, then lifts an eyebrow at me. \"Are we doing this?\" \"Yes,\" I tell him, praying to god I don\u0027t lose my nerve. Lisa was right. This could be the way to talk with him. Even if it is in front of hundreds of people. Taking in my moment\u0027s hesitation, his eyes move down my body. \"You\u0027re still wearing that shirt, and your ass is nowhere near my table.\" Wait, I think, with a sudden drop of my heart into my shoes. He was serious about that? \"Do you really need my top off? Or is this just a way to humiliate me?\" \"Why would that humiliate you, Addison? If I remember things right you have one extraordinarily beautiful body.\" He shrugged. \"Course in that blue pillowcase you\u0027re wearing it\u0027s hard to tell.\" My face goes hot, and his eyes flash with amusement like he\u0027s really enjoying seeing me squirm. \"Take it off already,\" some guy yells from the crowd. I look around and catch Lisa\u0027s gaze. From her spot in the front row, she looks guilty and worried, and she mouths the words, \"Do you want to go?\" followed by a grimace. I quickly shake my head. \"No one\u0027s here to see your tits, honey,\" the same guy calls out. \"Get someone else, Rush. This bitch is off.\" Rush walks past me without a word. His face is tight, so\u0027s his body, but it\u0027s his eyes that really freak me out. They\u0027re dark and deadly, and ice-cold. He dips into the crowd. I don\u0027t know how he knows where the guy is, but he does. \"Get the fuck out of here, dude,\" he says with absolute calm. The guy sniffs. He\u0027s probably somewhere in his mid-thirties, and nearly the same height as Rush, but thicker around the middle. \"I just want to watch, man. What\u0027s the big deal? Shit.\" \"Big deal is you don\u0027t talk to a lady like that. It\u0027s not cool, and it\u0027s not tolerated.\" \"Fuck you,\" the guy says, then gives Rush a shove. Rush sends his fist into the guy\u0027s gut, then grabs him by the back of the head and slams his knee into the man\u0027s stunned face. \"I really hate these conventions,\" I hear Rush say. As I watch dumbfounded, the guy goes down on his knees and remains there, intermittently wheezing and moaning. As the crowd falls quiet, Rush gestures to someone near the back, and in seconds two guys dressed in black haul Mr. Charming away. Eyes as cool as twin emeralds, Rush heads back my way, pulling off his gloves. The knuckles on his right hand are bleeding. \"Keep your bra on, baby. No one\u0027ll see a thing.\" I turn, my eyes following him, my heart pounding fast and sick. He\u0027s such a frighteningly, deliciously volatile creature, and I just want to know what it feels like to be taken over by him again. As he washes up in the sink, I unbutton my shirt. My fingers shake as I work off each small, silver circle like it\u0027s a puzzle piece. My brain isn\u0027t working right. It wants to work out other answers to other puzzles like, why did he do that? Why did he challenge that guy? Knock him down when he hates me so much? Rush slips on a clean pair of gloves, then looks up, locks eyes with me. He motions for me to come to him. My skin instantly reacts to the command by going hot and tight. I walk over, shrug out of my shirt and place it on the back of an empty chair. Cool air moves over my hot skin, but it\u0027s Rush\u0027s gaze moving over my skin that truly brings out the goose bumps. It\u0027s hungry and dark, and I can\u0027t help but get a little thrill that I still affect him in some way. \"Lie down,\" he says, his tone as tight as his jaw. I climb onto the table and stretch out, rest my cheek on my hands so I can watch him. Rush pushes his black swivel stool close to my shoulder blades and checks his materials all set out on a metal table by Ms. Pin-Up. Then he looks down at me. \"You okay?\" he asks. I take a deep breath and wonder again why I\u0027m doing this. This-as in, letting him permanently ink my skin with a design of his own choosing. Is it just to get him to talk to me? Listen to me? Or is there more? Do I want him to touch me? Be forced to touch me? \"I don\u0027t like pain,\" I say. His eyes flash as he reaches across my back to unhook my bra. \"No one does, baby. No one does.\" As I try not to obsess over his words and their obvious meaning, I watch him pick up a razor from the table and lean over me. I feel his hard stomach press against my arm as he runs the thing over my upper back a few times. Next, I feel a cool, wet cloth dragging gently across my skin. Then what feels like paper, about the size of an orange, pressing firmly into the area, then lifting away. He reappears in my eyeline and asks, \"Ready?\" My mouth is so damn dry I just nod, then brace myself. As the needle touches my skin, and Rush draws the first line of whatever image he\u0027s chosen, I close my eyes and breathe. It doesn\u0027t hurt nearly as bad as I thought it would, but I know it\u0027s going to be a long process and I have to prepare myself for what\u0027s coming. Over the next ten minutes, I let the sound of the machine lull me into a strange sense of calm. As I continue to rest my cheek on my hands, I vacillate between eyes closed and eyes open, and trying to figure out what he\u0027s drawing by the movements of the needle. But so far, I\u0027ve got nothing. From what I can see, Rush is concentrating really hard, his eyes pinned to my skin, his face tight with tension. It\u0027s incredibly hot, and I wish I had a better view. \"Rush,\" I say in a quiet voice, not wanting to jolt him from his focus. \"Can I talk while you work?\" \"Depends on what you have to say.\" \"Just...thanks.\" His nostrils flare, but his hand is shockingly steady. \"You can thank me after you see it.\" \"No,\" I correct him. \"I mean for the asshole in the crowd.\" The bite of the needle is gone momentarily. And I realize he\u0027s lifted it off my skin. His eyes flicker to mine. \"It\u0027s nothing.\" Then he returns to his work. I settle in to watching him again, completely unaware of the crowd, of Lisa, of everyone but him. It was always like that back when we were together. He was addictive. Like sugar. Like horror movies. Sometimes after we\u0027d have sex I\u0027d just lie there and stare at him, tell myself over and over that he was mine. That this gorgeous, talented boy belonged to me, wanted me, loved me. I saw us together, sharing an apartment as we went to college. And then I got moved from my aunt\u0027s house into a foster home, and then another foster home, and then a group home, and eventually everything I wanted and hoped for and believed in got crushed. Not by anyone I knew. God, that would\u0027ve been so much easier to forgive. But by me. \"Is it starting to hurt?\" Rush asks me, lifting the needle again, cocking his head to the side, his eyes finding mine. \"You\u0027re tensing up.\" \"No,\" I assure him. \"Just thinking.\" He doesn\u0027t ask. Instead his eyes return to my back. When the needle makes contact again, my mind tries to follow the lines it\u0027s making. I sense a diamond shape, but I can\u0027t figure it out. \"Are you going to tell me what you\u0027re tattooing on me now?\" I ask. \"You\u0027ll see for yourself when it\u0027s done.\" \"How about a hint? Like if it\u0027s something gross or pornographic or just really, really mean.\" I see the corners of his mouth twitch. God, he\u0027s so sexy. Forget Ms. Pin-Up. He probably has a hundred girlfriends. All on speed dial. All waiting with bated breath for him to call. I know I would be. \"It\u0027s not a portrait of me flipping you off or anything,\" he says. \"Okay, good.\" I make a face. \"That\u0027s a relief.\" His eyes darken. \"Don\u0027t get cute with me, okay? You\u0027ve wanted to get under my needle for what...two years now?\" I sober a little at his combative mood. \"I think it\u0027s going on three. Didn\u0027t realize your wait list was that long.\" \"It\u0027s not.\" Once again, he lifts the needle off my skin, gives me a look so dead sexy my breasts tingle against the table. \"You know, I never wanted a tattoo,\" I say. \"Yeah, I know. That\u0027s why you never got an appointment.\" I release a breath. \"I just wanted a chance to talk to you.\" \"Well, you got it. Or your girlfriend did. Either way, I\u0027m here, you\u0027re here. Go.\" \"Okay.\" I bite my lip. It felt so easy a second ago. Now my brain doesn\u0027t want to cooperate. \"It\u0027s just...there\u0027s a lot of people here...\" \"And?\" \"And I know it\u0027s kind of loud in here, but are you cool with someone, I don\u0027t know, in the front row maybe, hearing how I feel about you? How what I did five years ago is tearing me up? How every time someone touches me or kisses me I wish it was you?\" The sound of the tattoo machine dies, and Rush\u0027s eyes cut to mine. They\u0027re like twin daggers, and I can\u0027t tell if he\u0027s turned on or pissed off. Either way, my heart leaps hardcore into my throat. He looks up, gestures-no doubt to Ms. Pin-Up-and in seconds, I\u0027m cleaned off and something warm is rubbed into my back. His jaw tight, Rush places a cloth over my tattoo and tapes around it, then re-clasps my bra. \"You can sit up now and put on your shirt,\" he tells me coolly, ripping off his gloves. I\u0027m confused. Not by his tone-that I was expecting-but by the quick work. I always assumed tats took a few hours. \"That\u0027s it?\" \"For now,\" he says. For now? As in, there\u0027s more? \"What the hell, Rush?\" He\u0027s tossing his gloves in the trash, but as soon as they hit the rim, he rounds on me and places a hand on either side of my hip, locking me into his vibrantly tattooed airspace. The breath leaves my body as my gaze travels over his collarbone, which sports a skull interwoven with the letters of his last name. As I sit there in my boring bra and my even more boring skirt, his face closes in on mine, and I swear if I lean forward an inch I can press my lips to his. Does he taste the same? I wonder. Feel the same? \"You want to talk to me,\" he says, his warm breath moving over my skin, making me shiver. \"You want to finish this tat? We\u0027ll do it my way.\" His way. Oh, god, I used to love doing things his way. I contemplate sticking my tongue out and lapping at the air, seeing if I can taste him that way. \"Be at my shop at eleven tonight,\" he says. \"Alone.\" I nod dumbly and mumble a raspy, \"Okay.\" But instead of leaning closer, giving me what I think he knows I want, he releases me, pushes away. I instantly want him back. Sound familiar, Addison? My shirt is shoved into my hands by Ms. Pin-Up, and I stand up and get busy putting it on, buttoning it up. My heart is still knocking against my ribs and my insides feel almost as liquid as certain parts of my outsides. I don\u0027t care about the dissolving crowd or how Lisa\u0027s on her way over to me with a look of utter horror. All I care about is tonight, and seeing him again. Explaining things, asking for forgiveness. Getting his hands on me again. \"And Addison,\" he calls. I turn so easily, almost involuntarily, toward the sound of his voice, like it controls me now. He slips on a black knit cap, his eyes flashing emerald fire my way. \"Don\u0027t look at it. If you take off the bandage, I\u0027ll know.\"","sourceLink":"https://allnovel.net/first-ink-wicked-ink-chronicles-1/page-3.html","bookId":1915,"book":{"id":1915,"title":"First Ink (Wicked Ink Chronicles #1)","description":"Storyline: First Ink (Wicked Ink Chronicles #1) Rush Women in his bed, celebs and rockers in his chair and a killer bank account at his disposal, life is pretty freaking swell. Then she walks back into it again. With her mismatched eyes, perfect pink mouth and a laugh that still haunts him, she gave him nothing but marvelous misery. Now she wants his hands on her again. Not for pleasure, but for pain. For Ink. A bleeding heart to match the one she left him with five years ago. Addison She can’t forget him. No matter how hard she’s tried. The pain she caused him in the past eats at her daily, and she can’t move on with her life. But she has a plan, a hope for redemption – a way for him to take his revenge out on her flesh. But it’ll only work if he lets her inside his exclusive world, under his famous artist’s needle and into his bed—and heart-once again.","cover":"https://allnovel.net/images/first-ink-wicked-ink-chronicles-1.jpg","author":"Laura Wright","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/first-ink-wicked-ink-chronicles-1.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:29:42 PM"}}
