{"id":85939,"no":14,"title":"Page 14","content":"“How’s my baby?”\\n\\n “I’m fine, thank you. Oh wait, you mean the princess. She’s adorable and she’s sleeping.”\\n\\n “Great. We’ll be back to the hotel later. We’re going to take a tour of the art gallery.”\\n\\n “No hurry and have fun.”\\n\\n After we toured the art gallery, Connor and I said goodbye to Vinnie and slid into the back seat of the limo that was waiting for us. Connor reached over and took my hand.\\n\\n “Did you like the gallery?”\\n\\n “I loved it. It’s going to be amazing once it’s finished.”\\n\\n “It’ll be amazing when your paintings are hanging on the wall.” He smiled.\\n\\n After I kissed him on the cheek, I laid my head on his shoulder while I was worried about whether or not I’d be able to finish all five paintings in time. When I was single, the worry would never have crossed my mind. But now that I was a wife and a mother, it was going to be difficult, even with Connor’s and Mason’s help. I took in a deep breath as Connor kissed me on my head.\\n\\n Chapter 19\\n\\n Connor\\n\\n After we had a nice breakfast, we flew back to New York. I had Denny drop me off at Black Enterprises so I could catch up on business before he drove Ellery, Julia, and Mason home.\\n\\n “I’ll see you later, baby,” I said as I kissed Ellery and then Julia goodbye.\\n\\n “Bye, sweetheart. Don’t work too hard.”\\n\\n I shut the door and walked into the building. As I stepped onto the elevator, my phone rang. It was Paul.\\n\\n “I’m on my way up to see you. I’m in the elevator.”\\n\\n When the elevator doors opened, I walked down the hallway to Paul’s office. I opened the door and sat down across from him.\\n\\n “I found a place for Ellery’s art studio.”\\n\\n “Great; where’s it at?” I asked.\\n\\n “In your building.”\\n\\n I looked at him in confusion. “What do you mean, in my building? What building?”\\n\\n “Where you live, Connor,” he sighed.\\n\\n I knitted my eyebrows while I got up and walked over to his coffee pot. “I don’t know if that’s such a good idea. I wanted it outside of the building.”\\n\\n “Listen, Connor. It’s perfect, and I think she’d love it. It’s on the tenth floor, and it’s the end apartment. It has more windows for natural light, kitchen, bathroom, and a bedroom, which can be converted into a storage room. She’ll have everything she needs there and, most importantly, it’s safe. I know how you are with her about safety.”\\n\\n I stood there, sipped my coffee, and nodded my head. “Perhaps you’re right. I’ll go have a look at it before I head home. Thanks, Paul,” I said as I walked out and headed to my office.\\n\\n Later in the day, I decided to call Cassidy. I dialed her number and waited patiently for her to answer. I wasn’t sure if she would or not, considering how we left things the other day.\\n\\n “If you’re calling to harass me about my love life, save it,” she answered.\\n\\n “Now that’s a clever way to answer the phone. I take it you’re still pissed at me.”\\n\\n “Pissed isn’t a strong enough word, Connor.”\\n\\n “I’m sorry about the other day. I really am. Now, if you’ll forgive me, then I can tell you the reason I’m calling.”\\n\\n “You didn’t call to apologize?” she asked.\\n\\n “Well, yes, that too, but I also wanted to ask you for a favor.”\\n\\n I heard a long sigh on the other end. “What do you want?”\\n\\n “I’m looking at an apartment in my building to convert to an art studio for Ellery, and I would love for you to look at it with me. But please don’t tell her; it’s a surprise.”\\n\\n “When do you want to do this?”\\n\\n “What time is good for you?” I asked her.\\n\\n “How about an hour?”\\n\\n I looked across my office and I saw the door open. Cassidy was standing in the doorway. I smiled and hung up the phone, getting up from my chair as she stepped into the office. I gave her a tight hug.\\n\\n “I’m sorry, sis. You know how much I love you and Camden, and I only want the best for you.”\\n\\n “I know you do, Connor, and I love you too, but you can’t think that you can rule my life. Let me fall. I’ll get back up and try again. I’m not as weak as you think I am.”\\n\\n “I don’t think you’re weak at all.” I smiled as I broke our embrace.\\n\\n “I have a couple of things to finish up in the other office and then we can go.”\\n\\n “Great, I’ll call Denny to come pick us up.”\\n\\n “No need. I have my car. You can just drive us there.” She smiled as she left the office.\\n\\n There was nothing I hated more than New York City traffic and she knew it. Perhaps it was her way of getting back at me.\\n\\n Cassidy and I stepped into the apartment and, instantly, I knew it was perfect for Ellery.\\n\\n “I love it, Connor,” Cassidy said. “She’ll love it!”\\n\\n “It’s nice. Tell me your vision for the place. Remember, it’s to be an art studio.”\\n\\n As Cassidy walked around the apartment and showed me what she envisioned, I knew that Ellery was going to adore it. The more I thought about it, I knew that Paul was right. It was a lot safer here for Ellery to have an art studio, and I wouldn’t have to worry so much about her. Pulling out my phone, I called the owner and bought the apartment. Cassidy and I walked out the door and, as I pushed the button to the elevator, I hugged Cassidy goodbye. The doors opened and I jumped when I saw Ellery standing inside the elevator.\\n\\n “Connor, Cassidy. What are you doing?” she asked with a weird look on her face.\\n\\n Fuck, I thought to myself. “Baby, what are you doing?”\\n\\n “I believe I asked you first, Connor,” she said as she stepped off the elevator. “Why are you on this floor?”\\n\\n “Oh, hell,” I said as I shook my head. I grabbed her hand. “Come on; I’ll show you the reason.”\\n\\n I opened the apartment door and motioned for her to step inside. “I’m confused,” she said.\\n\\n “Welcome to your art studio.”\\n\\n A shocked expression overtook her face. “What?”\\n\\n I wrapped my arms around her waist. “This is your art studio, baby. I bought it for you as a surprise and Cassidy is going to decorate it. This is where you’ll come and do all your painting with no interruptions.”\\n\\n “Oh, Connor, I love it! Thank you,” she said as she kissed me.\\n\\n She thanked Cassidy with a hug and then Cassidy announced she had to leave.\\n\\n “I need to get home. I still have a lot to do for Camden’s party tomorrow.”\\n\\n Ellery asked her if there was anything she could help her do. Cassidy politely said no and that she had everything under control. After she walked out of the apartment, Ellery shut the door and stood up against it with a smile on her face. I could tell she was up to something.\\n\\n “We should get going,” I said.\\n\\n “We will, after we christen my new art studio.” She smiled.\\n\\n I felt a twinge below when she said that. She walked over to where I was standing, grabbed the bottom of my shirt, and lifted it over my head.\\n\\n “I’m going to give you a proper thank you, Mr. Black,” she said as she unbuckled my belt.\\n\\n I was grinning from ear to ear with that thought.\\n\\n We pulled up to the long, winding driveway of my parents’ house. The porch was decorated with balloons and a big sign that said Happy Birthday, Camden. Ellery and I both smiled when we saw the sign, knowing that, in the not-too-distant future, we’d be doing the same for Julia. We stopped at our beach house first to drop off our bags and to check on things. It’d been a while since we’d been there because of everything that was going on. Mason and Landon were driving up for the party as well as Peyton and Henry, and Denny and his wife, Dana. I parked the Range Rover and unbuckled Julia’s car seat. Ellery grabbed the diaper bag and Camden’s gifts. As we walked into the house, Camden came running from the family room. I quickly put down the car seat as he ran into my arms.\\n\\n “Happy birthday, buddy,” I said as I kissed his head. He smiled at me and then looked at Ellery and held his arms out to her. She set the gifts on the table and took him from me, hugging him and wishing him a happy birthday.\\n\\n As Ellery took Julia from the car seat, Camden led me by the hand out to the backyard. All of our family and friends were there, laughing, talking, and having a good time. The minute my mother saw us, she ran over and took Julia from Ellery. As we made our rounds, Aunt Sadie came up to us and gave us both a hug. She took Ellery’s hand and turned it over. I really hated when she was at family functions. As she looked at Ellery and smiled, she squeezed her hand.\\n\\n “You’re very healthy, my dear.”\\n\\n “Thank you, Aunt Sadie; that’s good to know.” She smiled.\\n\\n Aunt Sadie asked Ellery to bend down and she whispered something in her ear. I watched as Ellery smiled and thanked her.\\n\\n “What was that about?” I asked when Aunt Sadie walked away.\\n\\n “Oh, she just told me that she sees a little boy in our future.” She smiled as she hooked her arm around mine.\\n\\n I raised my eyebrows at her. “We’re going to have a son?”\\n\\n “According to Aunt Sadie, we are.” She laughed.\\n\\n The thought of having a son thrilled me. A boy that I could groom to take over Black Enterprises like my dad did with me. I leaned over and kissed Ellery on the head.\\n\\n “What was that for?” she asked.\\n\\n “Just because I love you.”\\n\\n She smiled as she gave my arm a squeeze. We walked over to where Denny and Dana were sitting and took a seat next to them. It wasn’t too long after I sat down that my father asked to see me. I followed him into the house and into his office, where he shut the door.\\n\\n “How are things going with the trial, son?” he asked.\\n\\n I ran my hand through my hair as I walked over to the bar and poured a glass of scotch. “It’s going like all trials go, Dad. I just wish this bullshit was over.”\\n\\n “You got yourself into this mess, Connor. What the hell were you thinking, getting into a relationship with that whore?”\\n\\n I took in a sharp breath as I looked at him. “I had my reasons.”\\n\\n “You never said what those reasons were, and I want to know. I don’t want my company dragged through the mud because you couldn’t keep your dick in your pants.”\\n\\n His comment burned throughout my body. “Black Enterprises is my company now. I turned that company around when you weren’t paying attention to it because you were off with your whore in the Caribbean and your accountant was robbing you blind,” I spat through gritted teeth.\\n\\n My father didn’t know that I knew about the woman that he took to the Caribbean two years before I took over the company. He was supposed to be on a business trip for a month in Germany, at least that’s what he told my mother. His accountant had embezzled money and his V.P. made some very bad business deals. My father turned around and wouldn’t look at me as he spoke.\\n\\n “You never told your mother about that. Why?” \\n\\n","sourceLink":"https://allnovel.net/forever-us-forever-3/page-14.html","bookId":1819,"book":{"id":1819,"title":"Forever Us (Forever #3)","description":"Storyline: The story of Connor and Ellery Black continues in the last installment of the Forever Black Trilogy, Forever Us. \\n You took Connor and Ellery’s journey of love, courage, and strength as Ellery’s illness threatened their future in Forever Black. You continued their journey through the eyes of Connor Black in Forever You as you watched them get their happily ever after through marriage and planning for their first child. \\n Join Connor and Ellery once again as they face the challenges of parenthood. Take their journey in Forever Us as they learn to cope with the demands of a new baby, a demanding career, and the onset of new challenges in which Connor and Ellery must confront for the sake of their family.\\n","cover":"https://allnovel.net/images/forever-us-forever-3.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-us-forever-3.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:09:25 PM"}}
