{"id":85940,"no":15,"title":"Page 15","content":"“Because, it would’ve killed her and I didn’t want to see her hurt. My relationship with Ashlyn was out of control. I was in a dark and bad place at that time. Thank God Ellery came into my life when she did. Listen, Dad, Lou has this under control. I don’t want you to worry about it. Hopefully, it’ll all be over soon.”\n As he turned around, he looked at me and smiled. “You’re right, son, and I’m sorry for what I said.”\n I gave him a small smile as he walked from behind his desk and patted me on the back. I opened the door and Ellery was standing there.\n “There you are. I wondered where you had disappeared to,” she said.\n “Sorry, Ellery. I had to steal my boy and go over a few things with him. Now where’s that granddaughter of mine?” My father smiled at her.\n As we walked out to the backyard, we heard screaming. I looked over to my right and saw Camden on the ground, kicking and screaming at the top of his lungs. I started to go to him and Ellery grabbed my arm. “Connor, don’t.”\n Just then, I saw Ben go over to him. He laid down on the ground next to him and made Camden look at him. He started making gestures with his hands and pointing up at the sky and told Camden to do the same. Ellery looked over at me and smiled as Camden instantly calmed down and did what Ben had asked. Everyone went about their business and continued to eat and talk amongst each other. Cassidy stared at me from across the yard. When I walked over to her, Ben and Camden got up from the ground and walked over to us.\n “That was impressive, Ben,” I said.\n “My brother is autistic and I practically raised him before I went off to college. My mom worked double shifts at the hospital and my dad took off when I was nine. Camden is a great kid.” He smiled as he looked at Cassidy.\n At that moment, I saw something between them. Ellery walked over to and handed me Julia.\n “Admit you were wrong about Ben,” she said.\n “I was wrong about Ben. He’s a great guy.” I smiled.\n Chapter 20\n Ellery\n Connor seemed to be more on edge lately and more irritable. He would go to the courthouse every day and then to the office. He was coming home later than normal because he was behind on work. I did as much as I could to try and take the stress off of him. Even though my studio wasn’t ready yet, I started painting and panic set in, as I was scared that I wouldn’t be able to finish.\n It was ten o’clock in the evening, and I had just put Julia to bed. As I sat down at my easel, I heard the elevator doors open.\n “Hey, baby. I’m sorry I’m so late. I had a lot of work to do,” he slurred as he kissed me on the cheek and the stench of alcohol overtook my senses.\n “Have you been drinking?” I asked.\n “I had a couple drinks,” he said as he sat on the couch.\n “At the office?”\n “No, I stopped at the bar before I came home.”\n He stretched out on the couch and put his arm over his eyes. I got up from my seat and walked over to him. “How did you get home?”\n “I took a cab.”\n I was furious with him for not telling me that he was stopping at the bar before coming home. I was also mad at the fact that he didn’t even come home to see Julia before she went to bed. This wasn’t like him, and something else was going on.\n “You couldn’t come home to spend some time with Julia before she went to bed?” I asked with a raised voice.\n He lifted his arm and looked at me. “Are you pissed off or something?”\n “Yes, I’m pissed off, Connor. You didn’t tell me you were going to the bar after the office. I just assumed you were there working. Who did you go to the bar with?”\n “I went with Paul. What’s the big deal? Fuck, Ellery, you’re pissing me off.”\n “I’m pissing you off? You come home at ten o’clock at night, reeking of alcohol, and you expect me not to be upset? It would’ve been different if you would’ve called and told me.”\n Connor got up from the couch and headed towards the stairs. “I don’t need to explain my whereabouts to you, Ellery.”\n I stood there in shock as he walked up the stairs; this wasn’t my husband. I decided it was best to leave him alone and let him sleep it off, but I couldn’t shake the feeling that something else was going on. Taking my phone from the table, I dialed Peyton.\n “Hello, sexy mama. Henry and I are about to have sex, so I need to make it quick,” she answered.\n “Why did you answer the phone, then?”\n “Because it’s you, and what if it was important?”\n “Connor came home drunk.”\n “Really? That’s not like him.”\n “I know. It’s this f**king trial and that bitch Ashlyn. I need to go and pay her a visit tomorrow and you’re coming with me. Remember; don’t say a word to Henry or anyone else.”\n “Okay, I’ll see you tomorrow for the fitting.”\n “Thanks, Peyton,” I said as I hung up.\n Turning off all the lights, I walked upstairs and checked on Julia before heading to the bedroom. Stepping into the shower, I couldn’t stop thinking about what Connor said to me, and it made me angry. The hot water streaming down my body felt good as I shampooed my hair. I didn’t want to wake up Connor, so I didn’t stay in the shower very long. As I stepped out, I was startled by him going to the bathroom.\n “Jesus, Connor, you scared me.”\n “Sorry. I just had to take a piss.”\n I wrapped the towel around me and as I went to step into the bedroom, Connor grabbed my arm and pulled me into him.\n “I’m sorry, baby. I’m sorry about tonight, and I’m sorry for what I said.”\n “I know you are, Connor. You’re under a lot of pressure.”\n “It’s no excuse, Ellery,” he said as he kissed me. “Please let me make love to you.”\n I smiled at his drunken words, and I nodded my head as he removed the towel from me, picked me up, and carried me to our bed.\n “So what are you going to say to her when you see her?”\n “I don’t know. I tried a million conversations in my head,” I replied as we drove to the jail where Ashlyn was.\n “What did you tell Connor you were doing today?” Peyton asked.\n “I told him that you and I were going for another fitting and then going to do some cake tasting.”\n I hated lying to him and it was killing me inside. But I didn’t have a choice. I needed to try and save my family and, most importantly, my husband. I parked the Range Rover and walked the distance from the parking lot to the building. The clerk sitting behind the glass window asked me the name of the prisoner I was visiting. Once I gave him Ashlyn’s name, he typed in the computer and then gave me a strange look.\n “I’m sorry, ma’am, but she was released from this facility a couple of weeks ago. She’s currently under house confinement.”\n My skin started to get prickly, and suddenly, I didn’t feel well. The thought of that bitch out of jail made me sick to my stomach. As I looked at Peyton, her eyes widened.\n “How the f**k did that bitch manage to get out of here?!” Peyton snapped.\n “She must have one hell of a lawyer, because according to my records, she was granted bail.”\n “Thank you,” I said to the clerk as I grabbed Peyton’s arms and hurried out of the building.\n We walked back to the Range Rover, and all I thought about was if Connor knew this. But I knew there was no way he did because he would’ve told me. My husband would’ve told me something as crucial as that.\n “Do you think Connor knew about this?” Peyton asked, as if she read my mind.\n “No. There’s no way Connor knew.”\n We climbed into the vehicle, and I put my forehead on the steering wheel.\n “Now what, Elle?”\n “Now, we go to Ashlyn’s apartment.”\n I heard Peyton gasp when I said that. I didn’t care if it was wrong or not. I was going to see her one way or the other.\n “Do you even know where she lives?”\n “Of course I do. Remember, Connor was the one who bought her the damn apartment.”\n We drove an hour back to the city and headed straight to Ashlyn’s apartment. I was furious that she was out on bail, and I couldn’t wrap my head around it.\n “FUCK!” I screamed. “How the hell did she get out on bail? I yelled as we pulled into a parking space.”\n “Calm down, Ellery.”\n As Peyton and I took the elevator up to the floor that her apartment was on, my body was shaking with anger. The fact that she could burn down a building, admit it, then change her plea, and get out on bail was too much for me to handle. We stood in front of her door, and I gently knocked. A few seconds later, the door opened and Ashlyn stood there. Her eyes grew wide as she stared at me.\n “What the f**k are you doing here?”\n “I want to talk to you,” I replied.\n “Get the hell out of here!” she exclaimed as she tried to shut the door.\n “Oh, no, you don’t,” Peyton said as she threw her body against the door to stop it from shutting.\n The two of them struggled while Ashlyn tried to shut the door and Peyton tried to keep it open.\n “Please, Ashlyn. I just want to talk to you,” I pleaded.\n Peyton managed to push the door all the way open and knock Ashlyn back a few steps. We walked inside and Peyton shut the door.\n “You better make it quick or I’m calling the police,” she said.\n My pulse was racing, and my skin was on fire as I stood in front of the woman who was ruining my family.\n “Why, Ashlyn? Just tell me why you want to ruin my family.”\n As she looked at me, her eyes grew even darker. “You ruined my life.”\n “How did I ruin your life?” I asked.\n “You took the only person I ever loved away from me. You walked into his life, and he completely ignored me. He was the only person that ever paid attention to me.”\n Standing there, I could see how unstable this woman really was.\n “You burned down Connor’s building. You hired someone to destroy it. Now you have to suffer the consequences for your actions. Did you think you wouldn’t get caught?”\n “I wouldn’t have gotten caught if that weasel wouldn’t have said anything.”\n “Ashlyn, do you have any regrets about what you did?”\n “No, I don’t. Connor hurt me deep down to the very core, just like he did my sister, and now I’m going to make him pay for what he’s done. I’m going to make sure he never hurts me again, even if I have to destroy you and his precious little baby.”\n A fire burned through my body like never before and an anger I never knew I had emerged from deep within my soul. She threatened my daughter. To threaten me was one thing, but to threaten my child was another. She had just crossed a dangerous line. I felt like my body was out of control as I lunged at her and knocked her ass to the ground. I sat on top of her as I clutched her face with both my hands.\n “Don’t you ever threaten my daughter. Do you understand me, you psychotic bitch?” \n","sourceLink":"https://allnovel.net/forever-us-forever-3/page-15.html","bookId":1819,"book":{"id":1819,"title":"Forever Us (Forever #3)","description":"Storyline: \n The story of Connor and Ellery Black continues in the last installment of the Forever Black Trilogy, Forever Us. \n You took Connor and Ellery’s journey of love, courage, and strength as Ellery’s illness threatened their future in Forever Black. You continued their journey through the eyes of Connor Black in Forever You as you watched them get their happily ever after through marriage and planning for their first child. \n Join Connor and Ellery once again as they face the challenges of parenthood. Take their journey in Forever Us as they learn to cope with the demands of a new baby, a demanding career, and the onset of new challenges in which Connor and Ellery must confront for the sake of their family.\n \n","cover":"https://allnovel.net/images/forever-us-forever-3.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-us-forever-3.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:09:25 PM"}}
