{"id":85929,"no":4,"title":"Page 4","content":"“They’re beautiful, Connor. Thank you.”\n “You’re welcome, baby.” I smiled.\n “She’s probably hungry again,” Ellery said as she looked over at Julia.\n “I’ll feed her.” I smiled. I walked over and took her out of her bouncy seat. The minute I held her, she stopped.\n “I think she missed her daddy today.” Ellery smiled as she set the food on the table.\n I sat down at the table with her and attempted to eat. The minute I picked up my fork, Julia started to scream. Ellery got up and warmed a bottle for her. She went to take her from me, but I wouldn’t give her up.\n “Let me feed her, Elle. You go and eat. You’ve been with her all day.”\n “But you worked all day. I can feed her so you can eat your dinner.”\n “No, now give me the bottle, and let me feed my daughter.” I smiled at her.\n “Okay.” She smiled back as she handed me the bottle.\n When I put the bottle in Julia’s mouth, she instantly started to drink it. As I looked over at Ellery, she glanced at me and ran the tip of her tongue across her lips. She was so beautiful, but she looked so tired.\n “Baby, you’re getting me hard, and I’m holding our daughter.”\n “Oops. Sorry.” She smiled. “Don’t forget to burp her.”\n I took the bottle from Julia’s mouth and set it on the table. When I put her over my shoulder and patted her back, she let out a big burp and then started crying for more. Ellery got up from her chair and took her from me.\n “It’s my turn now. I don’t want you eating cold food,” she said as she kissed me.\n I took the food from the carton and began eating. The only thing I wanted was to get this dinner over with so I could make love to Ellery. When Julia finished eating, Ellery finished her dinner. I got up from the table and cleaned up while she took the baby upstairs to change her into her pajamas. Once I was done, I grabbed a bottle of wine and two glasses and took them up to our bedroom. When I walked in, I found Ellery and Julia passed out on the bed. I looked down at my cock, which was semi-hard. Just knowing we were finally going to have sex aroused me. As I sighed, I set the bottle of wine on the dresser. I walked over to the bed and carefully picked up Julia. She stirred, opened her eyes, and closed them again. I carried her to her room and laid her down in the crib. As I walked back to the bedroom, I changed into my pajama bottoms, climbed into bed, and wrapped my arms around Ellery.\n “Sleep well, my love,” I whispered to her.\n Startled out of a sound sleep, I rolled over, gave Ellery a kiss, and told her to go back to sleep. She was exhausted, and it was my turn to take care of Julia. Her cries echoed through the baby monitor as I got out of bed and headed towards her bedroom. I turned on the lamp and walked over to her crib. As I looked down at her, she looked up at me and stopped crying. After I leaned over and picked her up, I sat down in the rocking chair. I sat and stared at her as she moved her little hands around, cooing and kicking her legs within the blanket in which she was wrapped.\n “You have no idea how much you and your mommy have changed my life,” I whispered as I softly ran my hand across her cheek and slowly rocked back and forth. “I have so many plans for us. I can’t wait to take you to the park and to the beach. I’m going to teach you how to skate, how to ride a bike, and how to swim. You’ll always know how much Daddy loves you because you’ll hear and feel it every day. You’ve already rocked my world, baby girl, and I love you so much.”\n Julia closed her eyes and folded her little hands. I looked up and saw Ellery standing in the doorway, smiling, as a single tear fell down her cheek. As I got up from chair and gently put Julia back in her crib, I walked over to Ellery and wiped her tear away. She wrapped her arms around me and held me tight. As I bent down and picked her up, she brushed her lips against mine. I carried her to the bedroom and laid her on the bed.\n “I’m so sorry I fell asleep,” she said.\n “Don’t be, baby. You’re tired, and you need all the rest you can get,” I whispered as my lips traveled to her neck.\n “Make love to me, Connor.”\n I took down one strap of her nightgown and softly kissed her exposed breast. The soft groan that came from the back of her throat excited me even more. It had been too long, and I was going to make up for lost time. As I took down the other strap from her shoulder, I sat up in front of her and pulled her nightgown off, exposing her entire body. She looked at me and smiled when I shed my pajama bottoms. My tongue made circles around her belly button as I softly kissed the incision from her C-section. While my mouth was devouring every inch of her torso, my hands were fondling her br**sts, taking her puckered n**ples between my fingers. As she threw her head back and moaned, Ellery moved her fingers swiftly through my hair. I grabbed the string of her panties as she slightly lifted her h*ps and took them down. My finger lightly traced the inside of her thigh, all the way up to her clit. I moved myself up to her lips and forcefully kissed her when I felt the wetness and arousal from her.\n “I don’t want to hurt you, baby. It’s been a long time.”\n “I’m fine. I need you so bad, Connor. I need to feel you inside me.”\n I dipped one finger deep inside her and then another. Her moans grew louder as she moved her h*ps up and down, begging my fingers to pleasure her. I climbed on top of her with my fingers moving in and out, rubbing her cl*t and bringing her to orgasm. Her body shuddered and shook as she released her warm pleasure all over me.\n “That’s my girl.” I smiled. “Oh, how I’ve missed doing this to you.”\n We stared into each other’s eyes as she whispered, “I want you to look at me as you make love to me.”\n I placed myself inside her while I stared into her beautiful blue eyes. As I pushed myself further inside, the corners of her mouth turned up. Her arms were wrapped around me when I slowly moved in and out of her.\n “You feel so good, baby. God, I’ve missed being inside you and feeling you like this.”\n She brought her legs up and wrapped them around me as I picked up my pace and moved in and out of her at a steady speed. Our breathing was rapid and our hearts were racing. As I stared into her eyes with each thrust, she stared back, smiling and running her finger across my lips. I could feel her spasms around my c*ck as she was getting ready to come.\n “Ellery,” I moaned as I couldn’t hold back anymore.\n “Connor,” she wailed as I poured myself into her.\n Her body tightened as she threw her head back and came. My lips forcefully locked with hers, and I didn’t want to stop. I finally broke our kiss and looked at her. She was smiling at me as I collapsed on top of her. Our breathing was shallow, and our heart rates were beating at the same speed.\n “God, how I’ve missed hav**g s*x with you,” Ellery said breathlessly.\n I kissed her neck before rolling off of her. “I’ve missed it too, baby. You felt so good,” I said as I ran the back of my hand across her cheek.\n Suddenly, little sounds came through the monitor. Ellery and I looked at the monitor on the dresser. Julia was stirring in her crib. A soft cry came from her and we looked at each other.\n “Don’t worry; I’ll get her if she continues to cry.” I smiled as I ran my finger across her jaw line.\n “It’s okay; I’ll get her. You just worked very hard.” Ellery smiled back.\n We lay there in each other’s arms, staring at the monitor and waiting for Julia to wake up. She didn’t. As I reached my hand down in between Ellery’s legs, I whispered, “Are you ready for round two?”\n Chapter 7\n Ellery\n As I awoke, I reached over to put my arm around Connor, but his side of the bed was empty. I sat up and looked around. I didn’t hear the shower running and Julia wasn’t in her crib. I put my robe on and walked down the stairs to the kitchen. Connor was sitting at the table with Julia in his arms, feeding her a bottle.\n “Good morning, baby.” He smiled as he looked up at me.\n “Good morning,” I said as I walked over and gave him and Julia a kiss. “Why didn’t you wake me? I would’ve gotten her.”\n “You looked so peaceful sleeping, and I was already awake when she woke up.”\n I poured a cup of coffee and sat down in the chair next to him. He looked so sexy in his black suit, and I wanted to take him upstairs and devour him before he had to leave for the office.\n “Is something special going on today? You hardly ever wear a suit to the office.”\n “I have to go to court today. I told you last week,” he said as he looked at me.\n “Shit, Ashlyn and the trial. I completely forgot. I’m sorry.”\n “It’s okay. You just had a baby and you’re still trying to adjust. Don’t worry about it,” he said as he put Julia over his shoulder to burp her.\n Denny walked into the kitchen and headed straight to the coffee pot.\n “Good morning.” He smiled as he looked at us.\n “Good morning, Denny.” I smiled in return.\n As Connor was burping Julia, she decided to spit up all down the back of his suit coat. I jumped up as he looked at me.\n “Seriously?” he said.\n I tried so hard to contain my laughter, as did Denny, but we both couldn’t hold it anymore. I took Julia from Connor and held her while Denny handed him a towel.\n “Don’t you know by now that you shouldn’t feed a baby while wearing a suit?” Denny asked.\n “I guess I do now,” Connor said as he walked out of the kitchen and up the stairs to change.\n Claire came into the kitchen, and I handed Julia to her. I walked upstairs and into the bedroom where Connor was pulling out another suit from the closet. I stood there with a smirk on my face.\n “What’s that look for?” he asked.\n “I just think it’s funny; that’s all.”\n “You think it’s funny that our daughter spit up all over my five-thousand-dollar suit?”\n “I do, and you don’t need a five-thousand-dollar suit anyway. That’s a ridiculous amount of money to spend. No one is going to know it costs that much, and you look just as sexy in a five- hundred-dollar suit.”\n Connor pursed his lips together and put the suit he pulled out back in the closet. As he started walking slowly towards me, I knew the look on his face, and I knew I was in trouble. When he approached me, I put up my hands to prevent him from coming any closer. He grabbed my hands and threw me on the bed.\n “You know how much I love it when you babble on like that.” He smiled.\n “Please, Connor, whatever you do, don’t tickle me,” I begged.\n Suddenly, we heard Denny’s voice from downstairs. “Connor, let’s go. You’re already late.”\n Connor kissed me on the lips. “You’re lucky, Mrs. Black. But make no mistake; we will continue this tonight.”\n “I’ll be ready.” I winked.\n Connor let go of my hands and walked back to the closet and pulled out his suit. I went back to the kitchen and took Julia from Claire. Shortly after changing his suit, Connor came down, grabbed his briefcase, and we walked him to the elevator. \n","sourceLink":"https://allnovel.net/forever-us-forever-3/page-4.html","bookId":1819,"book":{"id":1819,"title":"Forever Us (Forever #3)","description":"Storyline: \n The story of Connor and Ellery Black continues in the last installment of the Forever Black Trilogy, Forever Us. \n You took Connor and Ellery’s journey of love, courage, and strength as Ellery’s illness threatened their future in Forever Black. You continued their journey through the eyes of Connor Black in Forever You as you watched them get their happily ever after through marriage and planning for their first child. \n Join Connor and Ellery once again as they face the challenges of parenthood. Take their journey in Forever Us as they learn to cope with the demands of a new baby, a demanding career, and the onset of new challenges in which Connor and Ellery must confront for the sake of their family.\n \n","cover":"https://allnovel.net/images/forever-us-forever-3.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-us-forever-3.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:09:25 PM"}}
