{"id":21557,"no":9,"title":"CHAPTER IX ANNETTE’S WINDOW","content":"“Marjorie, grandpa is coming home this afternoon; don’t you want to go to meet him? Aunt Charlotte says we may go in the carriage.” It was the first cold day of the season and Caro looked like a bright-eyed squirrel in her gray coat and chinchilla furs. \n \n Of course Marjorie wished to go, and although it was an hour and a half before train time she put on her coat and hat and the two went out to frisk up and down the walk until the carriage came. \n \n They went as far as the seminary chapel, and seeing the door open Caro said, “Let’s go in and look at Annette’s window.” \n \n Marjorie was willing and in they went. Some one from a distance was giving a course of Bible lectures to the students in the chapel, and the one for that day was just over. \n \n [64]It was a small building, beautifully proportioned and decorated; the somewhat somber richness of the interior being relieved by the beautiful windows. \n \n The children found it great fun to walk about in perfect freedom instead of being obliged to sit in sedate silence, and they forgot to think about the time. They stood for a while before the window on which was represented the Good Shepherd freeing a lamb from a thorn bush, and spelled out the words beneath it: “In memoriam A. G.” \n \n “I should like to have a window,” Caro said. \n \n “But you can’t unless you are dead,” Marjorie answered. \n \n Caro was disposed to doubt this and would have begun to argue the question if the sound of a banging door had not startled her. “What was that Marjorie? I guess we’d better go,” she said. \n \n Pushing open the swinging door they went out into the vestibule, and there they found the outside door fast closed. \n \n “Oh Marjorie, it is shut tight, I can’t open it!” Caro cried. \n \n [65]Marjorie tried in her turn, but it was of no use, the janitor not knowing they were in the chapel had locked the door and gone away. \n \n “What shall we do? We shall be late to meet grandpa,” wailed Caro. \n \n Marjorie began to pound on the door and call, but this they soon realized could do no good. “Nobody can hear us it is so thick,” she said, beginning to cry. \n \n “Don’t cry Marjorie; maybe Clifford will come back again. But I’m afraid we won’t get out in time to meet grandpa,” Caro added with a little choke in her voice at the thought. \n \n “Clifford won’t be back till to-morrow I know,” and Marjorie continued to sob. \n \n “But they’ll look for us, I know they will,” Caro insisted. \n \n It was dark and chilly in the vestibule so they went back into the chapel where the air was still warm. Even here the light was dim, for the short afternoon was nearly over. The shadows looked so dark in the corners that Marjorie exclaimed, “Oh Caro I’m afraid!” \n \n “I don’t think anything can happen to us, and they will find us pretty soon I’m sure,”[66] said Caro encouragingly, although she couldn’t help thinking how very dark it would be after a while. \n \n “We’ll starve! I am hungry now,” Marjorie said tearfully. \n \n There was nothing to do but wait. They sat down in the seat usually occupied by Aunt Charlotte when they went to afternoon service with her, two very forlorn little girls. Suddenly Marjorie flung herself down on the cushions and began to cry and sob wildly. Caro’s tears fell more quietly, and after a time she wiped them from her eyes and looked up at the window. In the fading light she could just see the gentle, tender smile of the Good Shepherd as he rescued the lamb. It comforted her, and when Marjorie’s passion of crying had exhausted itself, she said softly “Marjorie look at the Good Shepherd!” \n \n “It is too dark to see.” \n \n “Marjorie let’s ask him to send someone to find us.” \n \n “Well,” Marjorie agreed. \n \n “And soon,” Caro added, “And to help us not to be afraid.” \n \n In the dusk two little figures knelt, two little[67] heads were bowed on the cushions. When Caro lifted hers she thought something wonderful had happened, for there was the Shepherd smiling down on them just as if he were about to speak. It was the electric light on the campus which had shone out while their eyes were closed, and made it seem almost like day. \n \n “We needn’t be afraid now Marjorie,” Caro said calling her attention to it. “But I do hope it won’t be very long, for I want so to see grandpa.” \n \n At that moment Dr. Barrows was wanting very much to see his little girl. When he stepped from his carriage expecting to hear her merry voice, and to see her flying to him, there was only his sister standing in the door with an anxious face, greeting him with: “The children have disappeared Charles, and can’t be found!” \n \n After a few questions the president hurried over to his brother’s, vague stories of kidnappers floating through his brain. It seemed strange indeed that two little girls could disappear so completely in so short a time, leaving no clew to their whereabouts. \n \n [68]The whole neighborhood was presently aroused, and professors and students might be seen running in every direction. Just how soon it would have occurred to anybody to look in the chapel it is impossible to say, but it so happened that Dr. Smith the lecturer was to leave town that evening, and in putting his papers together he missed some valuable notes which he thought must have been left on the desk in the chapel. The janitor was sent for, and in half an hour after the electric light shone out, the children, as well as the manuscript, were found. \n \n “It is so nice to be found!” Caro said, with her arms clasped about her grandfather’s neck; “but I truly wasn’t afraid after the light came, for the Good Shepherd looked so kind.” \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2686/73959.html","bookId":1482,"book":{"id":1482,"title":"The Candle and the Cat","description":"简介： At the entrance to the driveway leading to the residence occupied by the President of the Theological Seminary were two flat-topped stone pillars, and upon one of these on a certain bright September day, Trolley sat sunning himself....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2686","creation":"Aug 1, 2019 12:25:13 AM","modification":"Aug 1, 2019 12:25:13 AM"}}
