{"id":105552,"no":31,"title":"Page 31","content":"“Who, Ku Min? Knows what?” “You know. About me.” “Doesn’t suspect a thing,” I said. “We fooled him completely.” I’m not sure she believed me, but she relaxed, and the next thing I knew she was sleeping, curled up on one burlap sack and using another for a pillow. I closed my own eyes and tuned in to the motion of the boat and the thrum of its engines. I snacked on one of the cakes of sticky rice we’d brought along, and when Katya stirred I fed her one. The ship sailed lazily upstream, stopping at little river ports to load and unload cargo. After one such stop around noon a crew member brought down lunch for us, twin paper cones of rice and vegetables. The food was greasy and salty enough to sink the spirits of a cardiologist, but it was tasty and we were both hungry. He didn’t seem to expect to be paid for it, either, or for the two bottles of beer he brought us. Just like the airlines, I thought. Except the food on the boat was better. After he was out of earshot, Katya held her bottle aloft and raised her eyebrows. “Beer,” she said. “And it is past noon, is it not?” “You’d have to ask the little uniformed prick who took my watch,” I said. “I’d say it’s pretty close to noon.” “The men on the boats, Evan. Do they know we are not true monks?” “They know there’s something dodgy about us,” I said, “or they wouldn’t be smuggling us with the dried fish. As far as the beer is concerned, that may be a gray area for monks. I’m not completely sure. They may distinguish between distilled spirits and beer. The idea is to avoid intoxication. The beer in these countries is a whole lot safer than the water, and maybe they take that into consideration.” “There’s no label on the bottle.” “Well, I can see why. It’s not very good beer.” “And there’s only one bottle for each of us.” “It’s the standard complaint,” I said. “‘The food is terrible and the portions are small.’ I’m not sure if monks can drink beer or not. My guess is, nobody’s going to put it in our begging bowls.” “Will we really go begging?” “It’s what monks do. It has a different connotation when a monk does it; it’s not like being hit on by a child in Calcutta who’s been maimed by her parents so she’ll look more pathetic. A begging monk makes it possible for people to earn merit by putting some rice in his bowl. He’s performing a useful function.” “I should look forward to it,” she said. “It has been a long time since I performed a useful function.” The sun was just setting when we docked in Bagan. The captain came for us and helped us ashore. He said some parting words that I couldn’t make out, so I just nodded and pressed his hand in reply. We were on our own now. And I’d have to say the first few hundred yards were the hardest. It was a little early for tourist season – December and January would be the peak months – but Bagan was a town for tourists, and there were plenty of them in evidence, large hearty fair-haired Europeans with cameras. It seemed to me that they were staring at us, and of course they were – not because we didn’t look like true monks but because we did. A few of them pointed their cameras at us, and I decided they must be very recent arrivals. If they took pictures of every monk they saw, their film wouldn’t last long. We lowered our eyes and walked past them, and it turned out to be easy to ignore them once we got the hang of it. It was a little harder to ignore Bagan. It was all pagodas. There were literally thousands of them, ranging in all directions for as far as the eye could see. There were big ones and small ones, ornate ones and simple ones, pagodas in good repair after UNESCO’s restoration efforts and crumbling pagodas badly in need of attention. Most of them were the work of a Burmese king who’d converted to Theravada Buddhism with a vengeance a thousand years ago. He’d built pagoda after pagoda, and so had his successors, and the result, all these centuries later, was dazzling, if incomprehensible. Why? I could understand why UNESCO was engaged in restoration, mending the gradual damage of centuries of neglect and the more dramatic effects of the 1975 earthquake. The town’s archaeological value was enormous, and undeniable. And I could understand why the tourists came, and wouldn’t have been surprised if there had been far more of them. The sight of all those gold and silver stupas glowing in the setting sun was as impossible to prepare for as a first glimpse of the Grand Canyon. But why build the damn things in the first place? That’s what I couldn’t figure out. What on earth made old King Anawrahta think it was a good idea? We spent the night in a ruined pagoda. I wasn’t sure of the propriety of that, but I figured it would be reasonably safe. Tourists climb some of the pagodas before dawn in order to watch the sunrise, even as they climb others in late afternoon to watch the sun go down over the Irriwaddy. But the pagoda I picked for us was a rundown dun-colored wreck, not tall enough to attract climbers or remarkable enough in any other way to draw anyone else. In a place like Bagan, the unquestioned pagoda capital of the world, it wouldn’t make anybody’s must-see list, especially at night. We sat together in one of its darkened corners and polished off the last of the sticky rice. A beer would have been nice, Katya said. Or a slug of ayet piu. “We may be able to have beer,” I said, “once we get off the beaten track. But I think we can forget ayet piu.” “I know.” “They get their drinking water from the river,” I said, “and I guess it doesn’t kill them. And you’ve had a few years to acclimate to the water in Rangoon, so you’ll be all right. I guess I’ll come down with a case of Burma belly, but it won’t kill me. And I can’t buy bottled water. They might accept a monk drinking beer, but not paying for water.” “Maybe the water won’t be so bad.” “Maybe not,” I said. “I’m more worried about the mosquitoes.” “I have had a couple of bites.” “I just nailed one of the little suckers. But I don’t think he was the last mosquito in Bagan.” “If you killed him, you violated the First Precept.” “Nobody’s perfect. I just wonder what kind of mosquitoes they are.” “Females,” she said. “The males don’t bite.” “I mean the species. In other words, are they the kind that carry malaria? I still have Lariam working in my system, but I’m supposed to take a pill once a week, and the week’s up tomorrow. So the mosquitoes will have one or two Lariam-free weeks to bite me, maybe more.” “And you are worried?” “Well, yes,” I said. “I suppose it’s a more romantic disease than, say, the heartbreak of psoriasis, but I don’t imagine it’s a lot of fun. Come to think of it, what do you do?” “What do I do?” “You’ve been living here for years, and I gather you don’t take Lariam or anything else. How do you keep from getting malaria?” “I don’t worry about it.” “The malarial mosquitoes only bite at night,” I said. “At least that’s what the book says, though who knows if the mosquitoes have read it. I suppose a person could stay inside from dusk to dawn, but I know you don’t live that way. And there were no screens on the windows of the Char Win, anyway.” “No.” “Some people never get bitten. It’s their body chemistry, mosquitoes just don’t like the taste of them. But you said you’ve already been bitten a couple of times tonight, so that can’t be it.” “No.” “I suppose some people are naturally immune. The parasites can’t thrive in their bloodstream, so even if they get bitten they aren’t infected.” She was shaking her head. “Then I give up,” I said. “How come you don’t have malaria?” “I do have it.” “You do?” She nodded. “For years, before I ever got to Burma. You never get over it, you know.” “That’s what I heard. I think there’s a new treatment, but-” “Perhaps there is. But they told me the parasites stay in your system forever. The body adjusts to them, and most of the time you are fine. Unless the immune system is badly stressed, and then you get an attack.” “And that happens to you, Katya?” “Not so often. Only twice since I have been in Burma. It is not so bad. Chills and fever, and a terrible aching in the bones.” “That sounds pretty bad to me.” “Well, it is not good. But when you recover you cannot remember it too clearly. Because of the fever, I guess. So it is not so bad.” “Oh,” I said. “You’re not naturally immune, then-” “Obviously not.” “-but it’s possible that some people are, isn’t it?” “I suppose it is possible.” “And it’s possible I am one of those people.” “That is possible, too.” “But not terribly likely,” I said, and slapped another of the bloodsucking little bastards. Shortly after that she curled up in a corner and went to sleep, leaving me with nothing to do but think and hours to do it in. After a while I slipped out of the pagoda and looked up through the clear desert air at a sky full of stars. I watched them for an hour or so, hoping they’d make me turn philosophical, but my thoughts stayed on a worldly plane, switching back and forth from the probable consequences of malarial infection to those of being exposed as a mock monk, and in the company of a woman. What would they do to us? Precepts or no precepts, I somehow didn’t think they would be inclined to shrug it off. I hate to generalize, but I think you can say that no religion is terribly good at taking a joke. The Ayatollah Khomeini hadn’t been able to have a good laugh over The Satanic Verses, and even those faiths that place great stock in turning the other cheek are apt to lose it in the face of sacrilege and heresy. Great thoughts to wile away the hours of darkness. I’ll tell you, it was a relief when dawn came up (not quite like thunder, but impressively all the same) and we could go out and start begging. It was easier than I’d thought it would be. I had seen how it was done, but I’d watched a man fly a jet fighter plane, too, and that hadn’t made me feel qualified to replace him at the controls. Begging, however, wasn’t like that, nor was it one with brain surgery or rocket science. You walked along the street, and you held out your bowl, and people put something in it. Rice mostly, but sometimes it had bits of vegetable in it, and sometimes they gave you a little cake of sweet sticky rice. And they liked doing it. It was something the average Burmese got a chance to do every day, so they didn’t make a big deal out of it, but they genuinely seemed to welcome the chance to earn merit for the price of a handful of rice.","sourceLink":"https://allnovel.net/tanner-on-ice-evan-tanner-8/page-31.html","bookId":1535,"book":{"id":1535,"title":"Tanner on Ice (Evan Tanner #8)","description":"Storyline: Tanner on Ice (Evan Tanner #8) Once, Evan Tanner was known as the thief who couldn\u0027t sleep, carrying out his dangerous duties for a super-secret intelligence agency. Then someone put him on ice -- for about twenty-five years. Returning to the world (and trying to catch up with a quarter century\u0027s worth of current events), Tanner is about to embark on a new covert assignment that will take him to the exotic Far East, where mystery and menace are a way of life ....Now, whether he\u0027s dodging double crosses or disguising himself as a monk, Tanner is learning that when it comes to power games, pretty women, and political wrangling, some things never change. And he\u0027s making up for lost time -- with a vengeance.","cover":"https://allnovel.net/images/tanner-on-ice-evan-tanner-8.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/tanner-on-ice-evan-tanner-8.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:47:39 PM"}}
